{"by":"dagss","id":7507950,"parent":7507765,"text":"mCASH - Oslo, Norway - <a href=\"http://mca.sh\" rel=\"nofollow\">http:&#x2F;&#x2F;mca.sh</a><p>Product video: <a href=\"https://www.youtube.com/watch?v=AdgPQkHfp0Y\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=AdgPQkHfp0Y</a><p><i>We are looking for highly motivated individuals who share our belief in mCASH&#x27;s potential to revolutionize payments, and that have the guts to see that vision through. </i><p>mCASH is a startup that integrates with banks, merchants, webshops and apps to allow purchases and person-to-person transfers. Following a successful launch in the Norwegian market last month and a fresh $7.2mm USD in venture capital [1] from Northzone [2] and Entreé Capital [3], we are looking to scale up our team and expand internationally.<p>There are many small and big projects in our pipeline, and we always strive to improve on what we already have. As a member of our small team you&#x27;ll have a big impact on the trajectory of mCASH and shaping the company and product as we continue to grow. We&#x27;re an international team, with seven nationalities represented at the office.<p>As an mCASH employee, you are passionate about your own field of expertise, yet have the capacity to contribute to all parts of mCASH and are invigorated by the challenges we face.<p>The cornerstone of mCASH — our payment infrastructure — is built on Python, and we have launched native apps for iOS and Android. We are in the fortunate position that we get to write bleeding edge payment- and data analysis applications from the ground up — <i>we&#x27;d like you to join in and help us</i>!<p><pre><code>  == Requirements ==\n</code></pre>\n- A college degree in computer science, mathematics, engineering, physics or a similar field<p>- Ability to write elegant, well-documented and unit-tested code<p>- Solid knowledge of least three different programming languages<p>- Knowledge of Python in particular, or a similar language<p>- You like to KISS :-*<p>- A gutsy, proactive and I-can-do-this attitude that fits well with our start-up mentality<p>- A thorough understanding of the technology stack used in modern web applications, from front-end to back-end<p>- Statistics and machine learning experience is a plus<p>- Strong algorithms and data structures background is a plus<p>- You understand that knowledge sharing is fundamental in a fast-growing business<p>- Open Source contributions are a big plus - show us something you&#x27;re proud of!<p>- You are based in (or willing to relocate to) Oslo<p><i>Faced with problems to solve, you are quick in evaluating the solution set, are critical to your underlying assumptions, communicate efficiently with your colleagues, and apply appropriate technologies at a high pace.</i><p><pre><code>  == What we offer ==\n</code></pre>\nCompetitive salary and equity, pension plan, 5 weeks of paid vacation, free health care, computer of your choice, standing desks, high-end mobile phone and gadgets, free snacks and beverages, etc. Furthermore, at such a fast moving company you’ll find opportunities rather than boundaries in every single role. Your role may involve, but is not limited to:<p>- Fraud detection and prevention<p>- Determining out who wants what products at what price<p>- Detecting system anomalies<p>- Real-time analytics and metrics<p>- Rapid prototyping&#x2F;mocking of new ideas<p>- Developing and maintaining back-end systems using Python<p>- UX and front-end development across all of our platforms<p>Our offices are located in the heart of Oslo, in close proximity to public transportation, cafés, restaurants, shopping centers, the sea and parks.<p>Send an email to jobs+hackernews@mcash.no to apply.<p>PS: .pdf or .txt &gt; .doc(x)<p>[1] <a href=\"http://pehub.com/2014/02/norwegian-mobile-payment-provider-mcash-grabs-7-mln/\" rel=\"nofollow\">http:&#x2F;&#x2F;pehub.com&#x2F;2014&#x2F;02&#x2F;norwegian-mobile-payment-provider-m...</a><p>[2] <a href=\"http://northzone.com\" rel=\"nofollow\">http:&#x2F;&#x2F;northzone.com</a><p>[3] <a href=\"http://entreecap.com\" rel=\"nofollow\">http:&#x2F;&#x2F;entreecap.com</a>","time":1396358994,"type":"comment"}