{"by":"cjbprime","id":7508377,"parent":7507765,"text":"FlightCar - Lead Front-end Developer - Boston&#x2F;Cambridge, MA<p>FlightCar is the world&#x27;s first p2p car sharing company to operate at the airport. We&#x27;re a YC company that&#x27;s raised $6m+ in funding.<p>We give travelers free airport parking by renting out their cars to others. Everything&#x27;s insured up to $1m. We&#x27;re funded by General Catalyst, Softbank Capital, Brian Chesky, Ryan Seacrest, and others.<p>We&#x27;re looking for a Lead Front-end Developer. You&#x27;ll be developing our desktop and mobile sites as well as internal tools. As the front end lead, you&#x27;ll have the choice of which technologies to call on for projects. Currently we have a Django-backed site, and want to expand our front end work.<p>About our dev team: We all enjoy teaching and learning, and do things like build telepresence devices together: <a href=\"http://blog.printf.net/articles/2014/03/18/a-robot-for-timo/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.printf.net&#x2F;articles&#x2F;2014&#x2F;03&#x2F;18&#x2F;a-robot-for-timo&#x2F;</a><p>Responsibilities:<p>- develop new and existing features for our current consumer site, which uses Django templates and Bootstrap.<p>- create new customer-facing and internal services using the front end framework of your choice -- we&#x27;re a small team and you&#x27;ll be able to forge our architecture from the ground up.<p>- layout user interfaces using FlightCar&#x27;s current design language.<p>Qualifications:<p>- comfortable working in a fast-paced startup environment<p>- have solid understanding of HTML5 and CSS3<p>- knowledge of mobile web constraints and ways to optimize for them<p>- knowledge of jQuery and JavaScript, preferably including significant work with a modern client-side framework such as Ember&#x2F;Angular.<p>- a desire to complement the backend team by exploring server-side JS applications with node.js (or if you&#x27;re daring, Meteor).<p>- have a strong sense of UX best practices<p>- knowledge of Google Analytics or other analytics software is a huge plus<p>- love simple design and bright colors<p>This role will be on-site in our Cambridge office.  If you&#x27;re interested, please email rujul@flightcar.com. Thanks!","time":1396362302,"type":"comment"}