{"by":"FunnyLookinHat","id":7508578,"parent":7507765,"text":"System 76 - Denver, CO<p>Full Time Front End Web Developer<p>- - - - - - - - - - - - - - - - - - - - -<p>You see the world in HTML DOM elements. You love diving into the latest and greatest CSS frameworks. When you’ve written a particularly elegant piece of Javascript, it feels like all is right in the world. You shudder at the thought of websites before responsive design. If someone shows you an API, you instantly see a powerful user interface taking shape. You understand the stack of the web; getting your hands dirty with LAMP isn’t a show stopper to launching a product. You gave up Dreamweaver in 1997 because nothing ever looked as good as your bare code.<p>- - - - - - - - - - - - - - - - - - - - -<p>Required Skills &amp; Experience<p>Smart, motivated, and disciplined person who takes pride in their work.<p>HTML5 &#x2F; CSS3 expert; you know what to use and when for proper document markup.<p>Javascript and jQuery expert; you write beautiful, concise, and manageable front end code.<p>Know the difference between good and bad cross-browser compatibility (you’re a feature tester, not a version sniffer).<p>Love technical challenges and advanced UI features. Seeing a unique, yet functional page design with interesting challenges excites you.<p>- - - - - - - - - - - - - - - - - - - - -<p>The Perfect Candidate:<p>Regular and comfortable user of version control ( Git a big plus ).<p>Experience with SASS and CSS frameworks ( specifically Foundation ).<p>Experience working with and building REST APIs.<p>Written PHP and&#x2F;or Node.js applications; not afraid to get down &amp; dirty with back end code.<p>Feels completely at home within a Gruntfile.<p>Familiar with Javascript and PHP MVC frameworks.<p>Love Linux and Ubuntu.<p>More info here:<p><a href=\"http://careers.stackoverflow.com/jobs/50831/brilliant-front-end-web-developer-who-loves-ubuntu-system76-inc\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;50831&#x2F;brilliant-front-...</a>","time":1396363698,"type":"comment"}