{"by":"madprime","id":7508632,"parent":7507765,"text":"Back-end web developer - New York City - PersonalGenomes.org 501(c)(3) &#x2F; Open Humans (<a href=\"http://openhumans.org\" rel=\"nofollow\">http:&#x2F;&#x2F;openhumans.org</a>)<p>As the Senior Software Engineer at PersonalGenomes.org you will work on the Open Humans Network, a project that aims to help people aggregate and share their health and trait data to advance scientific, educational and humanitarian causes.\nOur model for this initiative is the work we’ve done on the Harvard Personal Genome Project (PGP), which has over 3,000 volunteers publicly sharing extensive biological and trait data, including hundreds of whole genomes, exomes, and genotyping data sets, over 1,000 health records, microbiome datasets from various bodily habitats, device data, brain imaging, etc. This combination of a highly informed and engaged community of volunteers and their contributions of extremely rich biological and health data, along with a network of collaboration-minded researchers, is an incredibly powerful scientific and educational resource that is unrivaled elsewhere. We will build on this momentum with this exciting new initiative that will transform participatory research and advance human health.\nOur current hiring position is focusing on someone with back-end web development skills, as we have plans to work with a design firm for initial front-end work. Because we plan to develop open source software used by researchers, we believe Python (which many scientists use) is generally preferred.<p>We&#x27;re looking for someone who...<p>-- Is interested in building and managing a full-stack website. As the Senior Software Engineer, your expertise will be an important factor in decisions about what kind of technology is used and how it’s deployed.<p>-- Has used multiple programming languages to build production systems (e.g. Python, JavaScript, Ruby).<p>-- Is experienced with back-end web development (e.g. Django or Rails).<p>-- Is comfortable managing Unix servers, cloud-based services and has opinions about how to store and disseminate large datasets (currently around 50TB total, although we would start with managing &lt;10GB).<p>-- Works well in a small team of developers and scientists.<p>-- Loves science, participatory research, and free&#x2F;open source ideals.<p>-- Believes in our mission!<p>About us: PersonalGenomes.org is a 501(c)(3) nonprofit organization working to generate, aggregate and interpret human biological and trait data on an unprecedented scale. PersonalGenome.org&#x27;s mission is to make a wide spectrum of data about humans accessible to increase biological literacy and improve human health. Its efforts are informed by values encouraging greater transparency and collaboration between researchers and participants. The organization supports the Personal Genome Project (PGP) global network. The first PGP research study was founded at Harvard Medical School in 2005, and PGP sites now exist at leading institutions in four countries. We also produce the annual Genomes, Environments and Traits (GET) Conference. More information is available at <a href=\"http://www.personalgenomes.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.personalgenomes.org</a><p>About Open Humans: We have years of practical experience, thousands of participants, and diverse data sets accrued. What we need now is an experienced developer to help us build a site for participants and researchers to manage and publicly share this data. Think of this as a nonprofit startup project!<p>Read more about Open Humans at <a href=\"http://openhumans.org\" rel=\"nofollow\">http:&#x2F;&#x2F;openhumans.org</a> and apply for the position by contacting us: Jason Bobe (jason@personalgenomes.org) and Madeleine Ball (madeleine@personalgenomes.org)","time":1396364034,"type":"comment"}