{"by":"onalark","id":7508600,"parent":7507765,"text":"Delhi (Other areas negotiable), India<p>Systems Developer, CycleTel<p>Are you passionate about using technology to create social impact? Do you operate well in start-up environments, building new ideas and strategies from scratch? Do you want to be part of a social enterprise that is positioned to change lives in India? This is your chance to join and shape a fast growing, mobile health (mHealth) service at a critical inflection point.<p>CycleTel is an mHealth innovation, developed and tested in India, that is positioned to be the first ever family planning method offered via SMS. No doctors, no visits to the health clinic—CycleTel puts family planning knowledge and use in the hands of couples, on their mobile devices. Based on the Standard Days Method (SDM) of family planning, the service has the potential to aid millions of women in India who have access to a mobile phone.<p>CycleTel seeks a passionate and skilled developer to lead development and administration of our SMS-based solution in India. The candidate will have an exceptional track record in software, preferably with experience in building and maintaining mobile systems services in India.<p>CycleTel is an initiative developed and incubated by Georgetown University’s Institute for Reproductive Health \n(IRH) in Washington, DC. IRH works to reduce unmet need for family planning by increasing fertility awareness and expanding access to family planning methods.<p>As a Systems Developer, you will help us improve, deploy and maintain our SMS-based solution. You will help us expand our reach within India and globally by adding multi-language support to our existing English&#x2F; Hinglish-based code. You will also help us expand by leading the development and integration of our application with technical partners. The System Developer will be part of the CycleTel team in India, and work in a focused team, reporting to our India CycleTel Manager, based in Delhi.<p>Please send cover letter and CV to the CycleTel team at charu.chadha.irh@gmail.com,","time":1396363841,"type":"comment"}