{"by":"mjwhansen","id":7508657,"parent":7507765,"text":"VISUAL DESIGNER, WASHINGTON DC (On-site preferred)<p>Engage is an interactive agency that provides technology and strategy to Fortune 500 companies, center-right political organizations, and nonprofits. A hybrid between an agency and a tech firm, we are innovators at heart. Our creative team is always looking for newer, cooler, better, more beautiful ways to do things. We love what we do and it shows.<p>If that sounds like the kind of agency you’d like to join—and we hope it does—we’re looking to add a Visual Designer to our creative team. The Visual Designer would report directly to the Design Director and be involved in all stages of the design process, from ideation and wireframes to finished product.<p>Projects might include creating branding collateral for well-known advocacy organizations, designing landing pages for issue campaigns, and crafting social media share graphics to drive engagement. We encourage you to review our portfolio at <a href=\"http://enga.ge/work/\" rel=\"nofollow\">http:&#x2F;&#x2F;enga.ge&#x2F;work&#x2F;</a> and <a href=\"http://dribbble.com/engagedc\" rel=\"nofollow\">http:&#x2F;&#x2F;dribbble.com&#x2F;engagedc</a>.<p>This is a full-time position in Washington, DC and comes with a generous benefits package. This is an immediate opening. If you’re outside DC, we&#x27;re willing to let you temporarily work remotely until you can relocate.<p>We will place the most weight on your proven work, so please submit your portfolio with your application (links to your website or Dribbble profile preferred). Your prior work experience and education are considered but are not as important. 2014 graduates with superior portfolios related to web design are also encouraged to apply.<p>More info &amp; apply:<p><a href=\"http://engagedc.theresumator.com/apply/5ePf5g/Visual-Designer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;5ePf5g&#x2F;Visual-Designe...</a>","time":1396364216,"type":"comment"}