{"by":"tptacek","id":7509137,"kids":[7511683],"parent":7507765,"text":"San Francisco, Mountain View - Matasano and iSEC Partners [WILL RELOCATE]<p><i>There are horrors beyond life&#x27;s edge that we do not suspect, and once in a while man&#x27;s evil prying calls them just within our range.</i><p>Talented tech people seek out jobs with interesting challenges. Different firms, different challenges. Here, a chance to grapple with large-scale payments; there, a purpose-built &quot;big data&quot; storage system; elsewhere, software running on an exotic platform; look hard enough and you may even find custom hardware to tinker with.<p>Consider a greater challenge: the one lurking in the shadows beneath all the other challenges; a maddening, beautiful challenge that awaits all applications, be they YC startups or giant tech companies, the hunt for which leads through the crevices of the payment processing gateways, the arcane backend of the storage system, and the insane, non-euclidian instruction patterns output by embedded compilers. The discovery of the unknown horrible secrets of our universe, the bending of those secrets to your will, and the billing of clients for PDF documentation of those secrets along with their exploitation steps and mitigation advice.<p>Matasano and iSEC together comprise one of the largest pure software security firms in the world. Our clients are the best companies --- and <i>most</i> of the largest of them. Our teams include some of the best researchers in the field.<p>I hire for both firms, our practices interlocked in an unholy embrace. You can read more about our hiring process at <a href=\"http://www.matasano.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.matasano.com&#x2F;careers</a>. Or, for a more philosophical take, here: <a href=\"https://news.ycombinator.com/item?id=7259845\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=7259845</a>. Put simply: we hire for aptitude, we ignore resumes, we respect and appreciate candidates, and we put real effort finding good fits. iA Cthulhu, iA iA, &amp;c &amp;c. Also, unlimited soda.<p>You can find out more by mailing &lt;careers at matasano.com&gt;. A human being who knows what they&#x27;re talking about will talk to you. And I&#x27;d like to think we&#x27;re fun to talk to!<p>For some of the flavor of what we do, check out <a href=\"https://microcorruption.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;microcorruption.com&#x2F;</a>","time":1396367251,"type":"comment"}