{"by":"sh1mmer","id":7509392,"parent":7507765,"text":"San Francisco - Uber Technology, Full time roles [WILL RELOCATE]<p>Last month I posted about some of the stuff we have going on at Uber and a bunch of the teams emailed me to share their interesting work too.<p><i>tl;dr</i> Uber needs more amazing engineers across the board. If you are smart, learn fast, and great to work with then you should talk to us. You can email me personally <i>tomc at uber dot com</i> or apply online <a href=\"https://www.uber.com/jobs/list?team=Engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;list?team=Engineering</a><p>All the teams have perks including 401k, medical, dental, monthly uber credits, gym stipend, relocation, etc.<p>Our core technologies at Uber include Python, Node.js, Backbone.js, iOS, Android, PostgreSql, mySQL, Puppet, and Redis but we&#x27;ve also had amazing engineers join the team from many background including C#, Java, Scala, C++, and many more. Mostly we are just looking for people who are good at what they do.<p>---<p>Here are some of the specific engineering roles we have open right now:<p>Mobile Engineer - With over a million downloads on both iOS and Android (not to mention the mobile web app) you&#x27;ll get to work on an app that your users will not just use but rely on every day. We also have a shiny new code base for Android KitKat to make use of the best new features of the platform. Our small mobile team is having a huge impact. Android (<a href=\"http://grnh.se/b6k308\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;b6k308</a>) iOS (<a href=\"http://grnh.se/h6y1cw\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;h6y1cw</a>)<p>Infrastructure Engineer - Uber is growing like crazy and our infrastructure team supports that growth. Help us deploy our distributed systems to data centers worldwide, while keeping stringent SLAs. We are looking for engineers with strong backgrounds in infrastructure, multi data center deployment, etc. <a href=\"http://grnh.se/tm8clj\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;tm8clj</a><p>Supply Engineering - Ever wonder why Uber is such a great service to use? It&#x27;s because we make it awesome for drivers too! By making amazing tools for the drivers who use our software we help them provide riders with the best experience. The Supply Engineering team works with nearly every team at Uber to make the drivers&#x27; experience first class. <a href=\"http://grnh.se/ph5ak7\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ph5ak7</a><p>Data Scientist&#x2F;Engineer - Build real-time signal processing systems, manage the economics and efficiency of Uber’s marketplace. Hack on estimated time of arrival, routing, dynamic pricing, demand forecasting and supply positioning. <a href=\"http://grnh.se/r1yh7p\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;r1yh7p</a><p>Realtime Engineering (my team) - Work on one of the largest real-time dispatching systems in the world. Our system is a highly available, distributed cluster. We use technologies like Node.js, C&#x2F;C++, and Scala to handle every Uber request and all communication with mobile devices. <a href=\"http://grnh.se/e8cpsa\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;e8cpsa</a><p>Web Applications Engineer - The Uber experience isn&#x27;t complete without a web presence, so we are looking for engineers who love Javascript, Node.js, OOCSS, and other modern web technologies to build scalable websites supporting millions of unique monthly visitors from all over the globe. <a href=\"http://grnh.se/buw840\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;buw840</a><p>Partnerships Engineering - Drive the Uber platform forward by leveraging business relationships and technology to further integrate Uber into the daily lives of our users. Hack on mobile applications, high-volume APIs and world-class operational tools. <a href=\"http://grnh.se/ywlr24\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ywlr24</a><p>Payments Engineering - Uber works on every continent (except Antiarctica) so we have to accept lots of ways for people to pay and get paid. You can work on one of the widest set of online payment solutions of any platform including all the major credit cards, Google Wallet, PayPal, and Alipay with still more on the way! <a href=\"http://grnh.se/tvuj54\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;tvuj54</a>","time":1396368938,"type":"comment"}