{"by":"misteroneill","id":7509431,"parent":7507765,"text":"New York, NY - Kindling - Lead Server-side Developer, Full Time<p>&quot;Kindling is enjoyable software used by teams to discuss ideas, solve problems, and pursue opportunities.&quot;<p>We’re looking for a talented developer to lead backend development on our Art+Engineering team.<p>Enterprise software is going through a massive transformation, away from stodgy, poorly designed apps sold on lists of features, towards thoughtfully designed solutions that work across all devices. At Kindling our mission is to modernize the enterprise experience with software people enjoy using. For us this means a design-oriented approach based on clarity, coherence, and simplicity. We build state-of-the-art innovation software which empowers members of an organization to contribute to the life and growth of that organization.<p>At Kindling you’ll be part of a tight-knit, supportive, creative, collaborative team that is passionate about building great user experiences. We’re excited about new technology and you should be, too; we’ve recently added elasticsearch and a node.js and redis socket to our platform—you’ll have a big impact on those types of decisions.<p>If all this interests you, Kindling is the place to be.<p>Some tools and processes that we use and you should be excited about:<p>* Crafting great software with the user’s experience in mind.<p>* Object-oriented PHP and the Zend Framework.<p>* Test-driven development, PHPunit, and automated testing.<p>* MySQL.<p>* Developing and working with RESTful APIs.<p>* Patterns and best practices.<p>* Caching and content indexing.<p>* AWS, with an emphasis on scalability and reliability.<p>* Communication, documentation, and collaboration.<p>* Modern client-side web application libraries and practices.<p>If you&#x27;re interested, check out: <a href=\"http://www.kindlingapp.com/jobs/lead-developer-with-a-mission-full-time/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kindlingapp.com&#x2F;jobs&#x2F;lead-developer-with-a-missio...</a>","time":1396369258,"type":"comment"}