{"by":"ccallebs","id":7509720,"parent":7507765,"text":"Intermediate&#x2F;Senior Web Developer\nTugg.com (Austin, TX; Los Angeles, CA)<p>Tugg launched at SXSW in 2012 and has since facilitated over 2000 events in all 50 states and abroad. Tugg is head quartered in the beautiful hills of Austin, Texas but has recently expanded to several remote offices. We have big ideas and are looking to expand our already great team!\nTugg is a platform that enables people to choose the films that play in their local theaters as well as to promote their own events. Our experienced team helps guide anyone from a first time promoter to someone hosting their 100th Tugg event on the path to creating a successful screening.<p>As Tugg continues to disrupt the way films are released in theaters, we are also growing the platform to become a major player in entertainment e-commerce. From the sale of Video on Demand, DVDs, and merchandise, to a broad offering of curated products from makers around the world, Tugg is building tools to make it easy for content owners, influencers, brands and fans to collaborate under one roof to know and grow their audience more vigorously than ever before.<p>------------<p>Requirements<p>------------<p>- Coding in Ruby or another scripting language. (Python, Perl, Javascript, etc.)<p>- Database administration using Postgres or MySQL.<p>- Application architecture design and implementation.<p>- User experience driven.<p>------------<p>What we are offering<p>------------<p>- A competitive salary: We offer competitive pay that is commensurate with experience.<p>- Competitive healthcare benefits<p>- Relaxed vacation policy: We are a small company. Nobody will be watching you clock in or out.  We simply expect you to get done what you say you will get done.<p>- Work remotely<i>:  We are based in Austin, Texas. Ideally, you are based here, or willing to relocate (relocation assistance available).  When we don&#x27;t need to be in the office, we tend to work from home, coffee shops, parks, etc. That said, we would strongly prefer candidates who are regularly able to work from either the Austin or LA office.  </i>Unfortunately, we are unable to sponsor H1B applicants.<p>- Happy environment:  We are a fairly young company, working in the entertainment space.  We like to have happy hours, outings, and other play times. We keep a kitchen stocked with snacks and have a budget for quality of life improvements.<p>------------<p>How to apply<p>------------<p>In addition to a resume and a short cover letter, please send us some links to view your code.  We want to know something about the projects you share. What went well? What could have been better? Please contact us at jobs@tugginc.com.<p>Thank you and we look forward to hearing from you!","time":1396371328,"type":"comment"}