{"by":"zinxq","id":7509947,"kids":[7545316],"parent":7507765,"text":"Refresh, Inc.\nMountain View, CA<p>Apply at: jobs@refresh.io\nH1B transfer applicants welcome.<p>Who we are:\nRefresh is a Silicon Valley startup located in downtown Mountain View, just blocks from CalTrain. We recently raised $10M from top VC’s Foundation Capital, Redpoint and Charles River Ventures.  Our current team includes Google, Microsoft, Yahoo, LinkedIn, and Salesforce veterans, as well as Stanford and Harvard alum.<p>We’ve built a well-reviewed iOS app and Google Glassware that have been written about in Inc., FastCompany, Venture Beat, and ComputerWorld, and we’re just getting started.<p>Who we’re looking for:<p>-----------------------<p>• QA&#x2F;Test Engineer<p>You&#x27;re someone so good at finding and isolating bugs, they sense your presence and immediately surrender themselves to you.  You’re part tester, part bug-hunter and when appropriate, bug fixer.<p>Responsibilities:<p>• Automated and Manual testing.\n• Writing and executing automated tests for both web and iOS environments.\n• Implementing and creating regression systems.<p>• Finding bugs in front-end web and iOS - following them through to the back-end.\n• Logging and tracking bugs in a bug database.\n• Supporting Customer Service to help resolve field issues immediately.<p>Requirements:<p>• 3+ years testing web and&#x2F;or iOS apps.<p>• Knowledge of bug tracking, writing test plans, test cases in Java.<p>• Coding experience in Java, Javascript, and&#x2F;or Objective-C.<p>• Hands-on mobile automation experience with FoneMonkey, MonkeyTalk, Selenium, Frank, UI Automation, KIF a plus.<p>• Not afraid to get your hands dirty fixing someone else’s code.<p>• Passion for problem solving, detail oriented.<p>• Strong written and verbal communication skills.<p>• Bachelor’s degree.<p>-----------------------<p>Java Engineer<p>We’re hiring passionate Java developers to add to our existing great team. New grads - you have a few significant Java projects you can show us. Experienced engineers - you have years of experience on large Java projects with high-performance requirements.  If you&#x27;re awesome in some other language but willing to learn Java, we’re happy to talk to you to. Our primary goal is hire great engineers.<p>Responsibilities:<p>The function of our back-end system is to pull, on-demand, data from dozens of data sources (in parallel), parse and semi-structure the input, create and package the results to be shipped back to the user device. If you’re thinking thousands of threads, hundreds of network connections, awesome caching layers, and lots of machines – you’re thinking Refresh.io. And of course, this all has to be done in real-time, or at least as fast as data providers can feed it.<p>Requirements:  \n• Passionate, crack shot coder in at least one popular computer language.<p>• You’ve built stuff. Stuff you can show us. Stuff you can’t wait to show us!<p>• You care about performance - you know there’s a user waiting for your code to finish.<p>• Experience developing Java apps is huge<p>• Multi-threading and Mongo experience are a plus.<p>-----------------------<p>• Android Engineer<p>Refresh is building a mobile system to better prepare you.  We’re a strong, diverse team.  We care how code runs and how users experience it.<p>If you’re an Android developer with a successful track record of launching Android apps and have an interest in working on Google Glass, we’d love to talk to you.<p>Responsibilities:<p>• Contribute heavily to the conceptualization and design of Refresh on the Android Platform<p>• Implementing custom native user interfaces using the latest Android programming techniques<p>• Interfacing Android client with Refresh’s extensive back-end intelligence systems<p>• Maintaining and evolving Refresh’s Android product experience<p>• Analyzing and optimizing UI and back-end application code for efficiency and performance<p>Requirements:<p>2+ years Android Development (android sdk, ndk, apk packaging)\nPublished apps in the Play store (or something far enough along to show)\nStrong Java language skills and Client-Server networking experience\nHistory of starting projects as well as jumping into existing architecture\nExperience developing UI’s working with user interface specifications, wire-frame modeling and with UI designers\nWorking experience with source code repositories such as git or Subversion\nPossess an aesthetic for good code design and good user experience design\nKnowledge of iOS development a plus","time":1396372834,"type":"comment"}