{"by":"alpha_ori","id":7509450,"kids":[7510213,7512271],"parent":7507765,"text":"Wanted:  Programming Unicorn.<p>We aren&#x27;t asking for much here at SwiftStack. All we need is someone that&#x27;s<p><pre><code>   * An experienced, opinionated crafter of scalable distributed systems\n   * Possessed of a deep and abiding knowledge of Linux\n   * A brilliant Python developer, steeped in the Web\n   * Excited about deployment and knowledgeable about packaging and \n     the infrastructure that goes into getting nontrivial software systems \n     from &quot;here&quot; to &quot;there&quot;\n   * Oh yeah, and it would be peachy if that person was really good at \n     front end development so they could give our users a smooth, \n     comprehensible experience that masks the inherent complexity \n     under the hood.\n</code></pre>\n(We&#x27;ll supply the horn.)<p>OK, maybe that is a big ask. It’s true, at a small (but growing) company, we do wear many hats, so the more you fit the above description, the better. But what we&#x27;re really looking for is a smart, talented, intellectually curious engineer with a strong background in at least one of the above skills and aspirations to grow in one or more of the others.<p>We&#x27;ve got a multi-talented engineering team and a host of compelling software-related challenges in many different arenas, and by the time you&#x27;re done here, you&#x27;ll have broad and deep enough experience that you&#x27;ll have earned your unicorn horn, and no can take that away from you. Because you&#x27;d stab them. With your unicorn horn.<p>Who the heck are we?<p>At SwiftStack we&#x27;re building software to help people create petabyte scale object storage infrastructure in their own data center instantaneously.  At our core, we use Swift, OpenStack&#x27;s object storage technology, but we&#x27;re building an orchestration layer that does the easy things for you, makes the hard things easy, and makes the impossible possible.<p>Why join SwiftStack?<p><pre><code>   * You&#x27;ll be part of a small team of highly skilled people who are also \n     very nice folks and would totally help you out in a pinch.\n   * You&#x27;ll be joining a company at a perfect size -- just big enough to \n     have momentum, but small enough that the decisions you make will have \n     a real impact on its course.\n   * You&#x27;ll get valuable experience building a product meant to manage massive \n     amounts of data. At scale, there are no easy problems.\n   * Swift is Open Source technology, and part of one of the most important Open \n     Source initiatives in recent history: OpenStack. You&#x27;d be writing code that \n     people all over the world would use, including the likes of Wikipedia and CERN. \n</code></pre>\nIf you&#x27;ve ever wanted to write code that has an impact, and we know you have, this is a good place to do it. Drop us a line at jobs@swiftstack.com, take a look at <a href=\"http://swiftstack.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;swiftstack.com&#x2F;jobs&#x2F;</a>, and&#x2F;or check out our puzzles at <a href=\"https://swiftstack.com/jobs/puzzles/\" rel=\"nofollow\">https:&#x2F;&#x2F;swiftstack.com&#x2F;jobs&#x2F;puzzles&#x2F;</a>.  Thanks!","time":1396369393,"type":"comment"}