{"by":"hglaser","id":7510721,"parent":7507765,"text":"Periscope -- San Francisco -- User Experience Designer<p>Periscope is a data analysis tool that uses pre-emptive in-memory caching and statistical sampling to run data analyses really, really fast.<p>The slick UI and impressive backend speed sell the product, but the most important feature is the way the user experience encourages sharing and collaboration on charts and dashboards. Periscope spreads data throughout an organization, eventually instigating a culture change that makes the company more data-driven.<p>One customer recently said of Periscope: &quot;It moved our data out of a closet and into a storefront.&quot;<p>We&#x27;re hiring our first user experience designer, who will own this experience.<p>About You<p><pre><code>   - You love the way that great user experience design enables users and makes them feel powerful within the product.\n   - You have great respect for how the little details impact user behavior and happiness.\n   - You understand that execution speed is a feature, and are comfortable with tradeoffs and making calls on the fly.\n   - You have a demonstrated track record of shipping designs in modern web or mobile apps.\n\n</code></pre>\nAbout Us<p><pre><code>   - We&#x27;re a team of 4 ex-Google and Microsoft PMs and engineers with venture funding, paying customers, and a spacious loft apartment in SF to work out of.\n   - We consider our design that enables frictionless sharing and collaboration to be our most important feature.\n   - We strongly favor rapid shipping over endless review and iteration.\n   - We have close relationships with our customers. We see customers several times a month, and email with them several times a week.\n</code></pre>\nReach out to me (Harry, co-founder &amp; CEO) at harry@periscope.io<p>More info: <a href=\"https://www.periscope.io/user-experience-designer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.periscope.io&#x2F;user-experience-designer</a>\nUs: <a href=\"https://www.periscope.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.periscope.io</a>","time":1396378013,"type":"comment"}