{"by":"charliefmoran","id":7510651,"parent":7507765,"text":"Advertising Age (adage.com) - New York<p>We&#x27;re looking for a director of technology, a senior position that reports to our GM of Digital. This role is responsible for the team’s overall technical strategy and operations, from its site infrastructure and CMS, to our registration system and how we integrate with third-party technologies. This person manages the front and backend development team, works closely with the GM and a team of product managers in managing the group’s priorities and queue of ongoing projects, and helps in improving internal processes. Importantly, the individual also plays a daily, hands-on development role on a wide variety of projects.<p>Job Responsibilities:\n* Ability to work and communicate across functions of the organization, from editorial to sales\n* Preparing and presenting potential technical solutions and advising the business on the technical value of a proposition\n* Keeping up-to-date on new technology, standards, protocols and tools in areas relevant to the rapidly changing digital environment\n* Manage homegrown JS libraries\n* Manage homegrown templating systems\n* Interface with a variety of 3rd party APIs (XML, SOAP, REST, etc.)<p>Job Requirements:\n• 8 to 10 years of digital experience with some management experience preferred\n• Expert-level software development experience with MySQL, PHP, Javascript, XML&#x2F;XSL, and HTML\n• Proven track record of delivering multiple projects on-time, on budget and within scope\n• Strong written and oral communication skills<p>Experience in the following is a plus:<p>• Experience working with a media organization\n• Security-conscious development\n• Speed-minded optimization\n• SEO-minded optimization\n• AJAX&#x2F;DHTML development<p>To apply, head here: <a href=\"https://re22.ultipro.com/CRA1001/jobboard/JobDetails.aspx?__ID=*486FA858151E4007\" rel=\"nofollow\">https:&#x2F;&#x2F;re22.ultipro.com&#x2F;CRA1001&#x2F;jobboard&#x2F;JobDetails.aspx?__...</a>","time":1396377587,"type":"comment"}