{"by":"dcoupl","id":7510908,"parent":7507765,"text":"Beats Music. San Francisco&#x27;s Dogpatch District.<p>Beats Music is creating a streaming&#x2F;downloading music solution for people who have a passion for music and who know the only thing as important as the song you’re hearing now is the song that comes next. Our product combines music selection algorithms with human curation to give the best music experience and discoverability possible. We just launched in January 2014 very successfully and have over a million users and growing. We are an offshoot of &quot;Beats By Dre&quot; audio equipment and as such we are very well funded by private non-VC parties, which gives us the freedom to go big in pursuit of the product vision.<p>We are hiring for engineering and other positions as well. We run at scale and have a complex distributed system with high performance requirements. Some of the tools we use daily include: Node.js, Python, Couchbase, Git, Objective-C (iOS), Java (Android), C# (Windows Phone), MySQL, Backbone.js, Puppet, Linux, Apache Kafka, Hadoop, Azkaban, Jenkins. There are several teams hiring:<p><pre><code>  - core API team (Node.js)\n  - web team (Backbone.js, Node.js)\n  - iOS team (Obj-C)\n  - Android team\n  - big data team\n  - analytics team\n  - operations and platform engineering team\n  - Windows Phone\n  - project management\n</code></pre>\nWe value creativity as well as engineering prowess. Many of us are musicians in our spare time. Trent Reznor (of Nine Inch Nails) is our Chief Creative Officer. We like to have fun while we solve complex problems with cutting edge tools and techniques. When you write code, it sees high throughput with many concurrent users. We have some other perks too:<p><pre><code>  - competitive salary (we pay well)\n  - great health care (Cigna!)\n  - reimbursed gym membership at UCSF Mission Bay\n  - new laptop!\n  - delicious healthful catered lunches 5 days a week\n  - a modern building of our own in the up-and-coming Dogpatch neighborhood\n  - a bright airy work space with exposed brick walls and skylights\n  - free parking in our 2 private parking lots\n  - free and discounted Beats By Dre gear\n  - stocked kitchen: beverages, non-candy snacks, fresh fruit, beer\n  - fun stuff to do: pinball, ping pong, a bar, cool interesting people\n  - onsite massages\n  - transportation reimbursement\n  - open-ended vacation policy (unlimited)\n  - flexible hours, work from home 1-2 days&#x2F;week\n  - company equity\n  - annual bonuses\n  - growth and advancement opportunities\n</code></pre>\nCheck out the listings here: <a href=\"http://www.beatsmusic.com/careers/listings\" rel=\"nofollow\">http:&#x2F;&#x2F;www.beatsmusic.com&#x2F;careers&#x2F;listings</a>\nIf you&#x27;re interested feel free to contact me directly by  emailing gtomei at beatsmusic dot com.","time":1396379422,"type":"comment"}