{"by":"JamilGETBASE","id":7510472,"parent":7507765,"text":"BaseCRM &#x2F;&#x2F; Mountain View, CA &#x2F;&#x2F; www.getbase.com<p>Product Support Specialist &#x2F;&#x2F; Full Time (multiple openings)<p>We’re seeking a Support Representative in our San Francisco office. You will be the first point of contact for our users and help serve as the voice of the company. You will assist current and potential Base users to understand the product, its features and how it can best be used to grow their business. You will work side-by-side with our Engineering team. We&#x27;re looking for smart, engaging, supportive, and dynamic people who learn quickly and have a passion for technology.<p>Responsibilities\n• Work with users to identify, troubleshoot and resolve issues as well as collect feedback that will help improve Base.\n• Provide product demonstrations and webinars for prospective and current users to help them understand how to get the most out of Base.\n• Manage and resolve support requests over the phone, live chat or email.\n• Update or create support articles and blog posts for new features.\n• Identify improvements to the system and communicate them to the Product team.\n• Provide a positive, personalized experience to each customer who reaches out to us.<p>Desired Skills and Experience\n• You have at least 1-2 years of experience working in a software or hardware support role.\n• You&#x27;re a self starter and are driven to conquer projects outside of your core responsibilities.\n• You possess strong written and verbal communication skills.\n• You are able to prioritize workload and adjust as situations change.\n• You enjoy helping others and appreciate the challenge of solving technology related problems.\n• You&#x27;re excited about learning and technology in a rapidly growing environment.\n• You engage well with others and remain calm under pressure.<p>An ideal candidate has\n• Familiarity with HTML&#x2F;CSS, Chrome Dev Tools, and various web technologies.\n• Familiarity with RESTful API.\n• Basic experience using Microsoft Excel.\n• Experience using a CRM solution and an understanding of the SaaS market space.\n• Basic knowledge of various mobile platforms: iOS, Android, and Windows Mobile.\n• Flexibility to work over weekends when needed.<p>What We Offer\n• Casual, fun and very approachable work environment. We’re a dynamic and smart team that you’ll love working with.\n• Flexible hours and vacation time.\n• Medical, dental and vision benefits.\n• Fully-stocked kitchen with great coffee and healthy snacks.\n• Personal development funds.<p>Apply here: <a href=\"https://getbase.com/company/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;getbase.com&#x2F;company&#x2F;careers&#x2F;</a><p>Thanks for reading!","time":1396376297,"type":"comment"}