{"by":"jscalisi","id":7511522,"parent":7507765,"text":"Palantir Technologies - Palo Alto, CA<p>At Palantir, we develop the world’s leading products for data analysis and we deploy them against problems that truly matter—uncovering human trafficking rings, containing the spread of infectious diseases, combating fraud, stopping cyber attacks, protecting privacy and civil liberties, prosecuting complex financial crimes, providing relief to victims of natural disasters, and more.\nSound exciting? We think so, too.<p>The Internal Tools team is comprised of the rockstar hackers that spend their time building, maintaining, and improving the glue that holds our development process together. In this highly cross-functional role, you’ll be developing innovative solutions that facilitate developer productivity.<p>Responsibilities:\n* Building and maintaining modules and configurations\n* Building scripts and plugins for our Source Control  Management and Continuous Integration services\n* Building additional tooling to make testing against complex systems easier\nExample: a simple service that makes it easy to use a shared, extremely fast Oracle server across multiple tests simultaneously\n* Building and maintaining bleeding edge build system architectural components\nExample: a web service for knowing how all of our internal packages depend on each other, allowing for chained upstream&#x2F;downstream builds when dependencies change<p>Requirements:\n* B.S.&#x2F;M.S. in Computer Science or equivalent\n* Experience in one or more of the following: Ruby, Java, SQL, scripting\n* Experience with Git, Jenkins, Gerrit, Gradle, Ivy, Oracle, Postgres, Eclipse or other open source code recommended\n* Previous experience with Jira, Confluence, Bamboo, Stash also a plus\n* Have a deep understanding of Unix, Linux, or Windows internals\n* Strong communication skills<p><a href=\"https://www.palantir.com/careers/OpenPosDetail?id=a0m80000002LiKaAAK\" rel=\"nofollow\">https:&#x2F;&#x2F;www.palantir.com&#x2F;careers&#x2F;OpenPosDetail?id=a0m8000000...</a><p>Questions?  Feel free to email me at jscalisi@palantir.com.","time":1396385039,"type":"comment"}