{"by":"jasonchen913","id":7511737,"parent":7507765,"text":"MongoDB - (New York, Texas, Palo Alto, Sydney)<p>We are always looking for great talent. Below are some of the many roles we have open. If you think you fit the bill, i&#x27;d love to chat. Please send me a ping @ careers@mongodb.com<p>---\nTechnical Services, Community  Location: New York, NY --- This team specializes working with the most important people - our community.  We are looking for tech savy individual who enjoys working on open source projects and being the face of the company. Development background is required.<p>----\nTechnical Services Engineer: Location: New York,NY &#x2F; Palo Alto,CA &#x2F; Austin, TX &#x2F; Sydney --- Team members will apply strong problem solving skills and will acquire a broad understanding of our products as well as a wide range of innovative customer applications and environments, from Foursquare to CERN to Metlife and everywhere in-between. At the end of the day, you’ll be able to look at these groundbreaking applications and say that you had a hand in making them happen. If you have a strong Dev, Ops, or DevOps background, you might be a great fit!<p>---\nSolutions Architect (Technical Pre-sales Engineer&#x2F;consultant) Location: Palo Alto, CA --- SA&#x27;s are responsible for guiding our customers and users to design and build reliable, scalable systems using MongoDB. The Solutions Architecture team at MongoDB is made up of seasoned software architects, entrepreneurs and developers who take direct responsibility for customer success, including the design of their software, deployment and operations. A development&#x2F;distributed systems background is required.<p>---\nConsulting Engineer (Field&#x2F;implementation&#x2F;post-sale Engineers) Location: New York, NY --- As a technical consultant, you&#x27;ll be MongoDB&#x27;s ambassador to our clients and other MongoDB users. You&#x27;ll deliver advisory consulting to and lead comprehensive training sessions with MongoDB&#x27;s clients, helping them solve mission-critical challenges in areas as varied as schema design, performance optimization (both in a database and in an application), software architecture, production operations. A development&#x2F;distributed systems background is required.\n---","time":1396386893,"type":"comment"}