{"by":"ianstormtaylor","id":7511232,"parent":7507765,"text":"Segment.io - San Francisco, CA<p>Mobile Engineer<p>We&#x27;re looking for an extremely good mobile engineer to help us change the way people approach mobile analytics.\nThis is a perfect position for someone who loves building clean APIs for others to use. You enjoy not only building mobile apps, but writing the libraries that power those apps. You&#x27;re fluent in everything to do with iOS as a platform, and if you have Android chops that&#x27;s a huge bonus, but definitely not a requirement.<p>You&#x27;d be working on current and new features of the mobile SDKs themselves, as well as helping to write code for where they touch our Node.js backend, where we process tens of millions of events per day. And you&#x27;d be in charge of our entire mobile offering, which is used in product by lots of big companies like Live Nation, Nest Labs and The Knot.<p>You&#x27;d be joining a team of very talented engineers that are in love with open-source. Both of those SDKs are open-source, as is tons of our codebase[1]. So if you enjoy working with smart people and getting to make a name for yourself releasing the things you work on to other developers, you&#x27;ve found the right place.<p>Not only that, but you&#x27;d be working on a few of our still-secret mobile projects that we&#x27;re pretty confident are going to change the way people integrate third party code into every mobile app they write afterwards.<p>[0]: <a href=\"https://segment.io\" rel=\"nofollow\">https:&#x2F;&#x2F;segment.io</a><p>[1]: <a href=\"https://github.com/segmentio\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;segmentio</a><p>---<p>To apply, email us at jobs@segment.io with:<p><pre><code>    1. a description of an app you&#x27;ve worked on (code is a bonus)\n    2. a description of a mobile library you&#x27;ve built (code is a bonus)\n    3. a link to your GitHub if you have one\n    4. the most interesting mobile SDK you&#x27;ve worked with and why</code></pre>","time":1396382258,"type":"comment"}