{"by":"eiphany06","dead":true,"id":7511125,"parent":7507765,"text":"Slice, a well-funded startup located in downtown Palo Alto, is a wonderful place to work and grow as an entrepreneur, engineer, designer, data scientist, and statistics scientist.<p>You will be surrounded by brilliant, compassionate team members. This is an inspirational place to evolve as an entrepreneur and programmer, and the elite level of leadership among the founders, who are also professors at Stanford Graduate School of Business, is unparalleled.  The networking and mentorship opportunities are truly amazing when immersed in this environment. Happy to chat more.<p>Product Data Analyst\n<a href=\"https://slice.resumetracker.com/public/job_detail/1093\" rel=\"nofollow\">https:&#x2F;&#x2F;slice.resumetracker.com&#x2F;public&#x2F;job_detail&#x2F;1093</a><p>What&#x27;s the job<p>We are seeking a Product Data Analyst to join the Slice Intelligence Measurement Science team. This person will support daily qa of critical, time sensitive, client bound data. The analyst will use his or her data analytical skills and attention to detail to quality stamp the data before it leaves Slice’s doors. Ability to thrive and succeed in a fast-paced start-up environment is the key to success.<p>Responsibilities:<p>·       Conducting qa on data and reports<p>·       Writing sql queries to pull data from database<p>·       Use of BI tool such as Tableau to help with qa inquiries<p>·       Signing off on reports before they are supplied to clients<p>·       Recommending novel approaches to data qa and implementing them<p>Requirements:<p>·       Bachelors with a quant background high desirable<p>·       Familiarity with SQL a big plus<p>·       Training or education with statistical methods a big plus<p>·       Good communications skills and positive demeanor<p>·       Willingness to learn and grow<p>Who we are:<p>Founded by proven entrepreneurs out of Stanford, Slice is a consumer internet company based in downtown Palo Alto that is venture backed by Lightspeed, DCM, Eric Schmidt and other top Valley investors.<p>We&#x27;re a bright and talented team that&#x27;s chock-full of consumer internet experience with a passion for delighting our users through amazing product experiences and thoughtful customer service.<p>Oh and we LOVE to have fun!<p>What we do:<p>Slice is solving a very big and important problem: we&#x27;re changing the way that people interact with the stuff they buy AFTER they buy it. And we&#x27;re doing this by tackling it at the source of where people get their electronic receipts: the email inbox.<p>We&#x27;re using email data to create fun and useful consumer applications and experiences. Our popular flagship app for iOS and Android provides an easy way for consumers to manage &amp; track all of their purchases and even save money with price drop alerts.<p>Why we&#x27;re cool:<p>Well our users certainly think we are (check out the reviews on the app stores). But the media love us as well!<p>We&#x27;ve been named one of 7 &quot;Startups to Watch&quot; by Inc. Magazine, and to Entrepreneur Magazine&#x27;s list of 100 Brilliant Companies.<p>We&#x27;ve also gotten tons of shoutouts from the press and media such as the NBC&#x27;s Today Show, Real Simple, CNN, and Lifehacker just to name a few.<p>Resumes&#x2F;Linkedin&#x2F;project pages&#x2F;portfolios to hannahft@stanfordalumni.org","time":1396381304,"type":"comment"}