{"by":"bensrubin","id":7512728,"parent":7507765,"text":"Boston, MA<p>A little about us - we&#x27;re called “Change Collective” and are a Boston startup. We are building a course platform that helps people make changes that matter with the help of world-class experts. Our goal is to transform the way people change. We&#x27;re backed by the best investors in Boston, and already count among our experts a NY Times best-selling author.<p>About you - you are a software engineer, programmer, architect, coder, or some or all of the above. Ultimately you, and the rest of the team around you, will love to learn, improve, refine and grow as a craftsman and professionals. You will get paid competitively. You will receive some equity in a young (funded) company. You will write a lot of Ruby, Javascript, markup and some Sass. You love Git, Github, Heroku, Trello (as much as one can love organizational tools), code reviews, occasional pair programming and open source. Although our stack does not currently include the following, there is a strong chance we will experiment with technologies like Ember.js, Angular, GoLang, Node, or the right tool for the job. We know for sure that there will plenty of native app development for iOS, Android and interaction with wearable devices. Right now we&#x27;re quickly becoming enamored with Rubymotion. We almost pass the Joel Spolsky test - nobody&#x27;s perfect (#7 needs some work). And we&#x27;re firm believers in working smart, sustainable, hours.<p>This would be a job local to Boston for now (near South Station &#x2F; Chinatown) as we&#x27;re a small team in a very collaborative environment.<p>If you like bullet points:<p>You are confident, comfortable and enjoy writing ruby, javascript, html and css\nYou practice test driven development\nYou are process driven, but not dogmatic\nRequired - you possess a healthy urge to get better, and help others get better, at their craft\nNot required (but won&#x27;t be held against you) - a university degree\nWe provide a competitive salary, equity and freedom to use the tools (hardware and software) that you consider best for your work.\nWe&#x27;re building a company that will live and breathe change and offer excellent opportunities for you to improve personally and professionally.<p>If you often wake up with an intense desire to improve your life and the lives of others, and regularly act on it — that&#x27;s our mission — email us (ben@changecollective.com and joel@changecollective.com) and say &quot;hello&quot;.","time":1396397876,"type":"comment"}