{"by":"erre","id":7514352,"parent":7507765,"text":"Amsterdam - The Netherlands. Full-time.<p>Layar (<a href=\"https://www.layar.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.layar.com</a>) is looking for a Back-End Python Developer, an Android Developer and a QA Engineer.<p>We are a front-runner in mobile AR technology. Our app is used by millions of users every month worldwide and needs to be the best in its class, our goal being to grow it to one of the top apps worldwide. Our app aims to stretch the technologies provided by iOS and Android to their limits, and relies heavily on reliable and highly efficient backend services and infrastructure to deliver an amazing experience. For content creators, our web front-end must be solid and quickly adaptable to new user demands.<p>We have three positions currently open:<p>------------------------------------------<p>- Back-End Python Developer<p>You will be joining a team of server developers with varied skills in web development, systems development, devops and QA.<p>Your primary roles will be to champion good software development practices in the team and to deliver high quality Python code. You will contribute to architecture and technical design of our back-end and of the Layar ecosystem as a whole. Our development team is small, and you can - and are encouraged to - have a big impact on product and technical decisions.<p>We expect you to be an experienced coder and technical designer, with a proven track record of designing, building, delivering and maintaining multi-server, scalable systems. A passion for delivering good products is essential. You know not only to make a computer do what you want, but also how to build (and keep building) a complex software product, within a varied and dynamic team.<p>We are specifically looking for:<p>* A proven track record in working on heterogeneous and distributed systems.<p>* 3+ Years of Python development experience.<p>* Experience with distributed source control (e.g. Mercurial, Git).<p>* Flexibility to deal with a rapidly changing environment.<p>Preferably you also have<p>* Experience with Python frameworks such as Django and Twisted.<p>* Experience with Infrastructure-as-a-Service, preferably AWS.<p>* Experience with automating analysis of large data sets.<p>------------------------------------------<p>- Android Developer<p>We are seeking a senior Android Developer who will take charge of our Android app and bring them to the next level. You will be working closely with our core team of mobile developers, buidling some of the core technologies that integrate in the app using assembly, C++ (NDK) and Java where appropriate to achieve the best performance. You will be responsible for building and delivering the new features on our roadmap. The ideal candidate will be flexible, self-motivated, loves making excellent code and takes pride in creating a great user experience.<p>Your primary role will be to maintain, improve and further develop our Android app. You&#x27;ll be able to use frameworks provided by other team members and work closely together with them to ensure tight integration in the Android app.<p>Your key responsibilities will be:<p>* to architect, develop and maintain the Android app;<p>* to ensure best possible performance, quality and responsiveness of the app;<p>* to help and guide the product team when designing new features.<p>------------------------------------------<p>- QA Engineer<p>We are seeking a QA Engineer who will be responsible for the quality of our front- and back-end web platforms. You will test our products through every stage of the development process and will give the final go for deploying new features or new releases. The ideal candidate will be flexible, self-motivated, loves finding bugs with a comprehensive suite of test cases and hates it when a customer is the one that hits a bug. You will be proactive in writing automated tests as well as helping developers write their own, and you will never manually test an issue twice: if something has escaped existing tests, you will write a new test for it.<p>You will work closely in an Agile methodology with the engineering team, consisting of backend and frontend developers, and devops, as well as with the product team designing and creating functional requirements. You will be responsible to set up and maintain a comprehensive test suite, whenever possible fully automated, covering all regressions and new features built by engineering team.<p>Your key responsibilities will be:<p>* To specify and create test cases for new features;<p>* To write automated test scripts that will provide test reports at every sprint;<p>* To profile our apps in order to check for best performance, responsiveness and memory footprint;<p>* To assist the decision makers in approving the final go for each release.<p>As a QA Engineer, we expect you to have a proven track record of creating test suites and testing web applications and web services. You should have enough programming knowledge (preferably but not necessarily of Python) to be able to write tests for complex scenarios. Experience in continuous integration and continuous deployment are a plus.<p>In order to ensure the highest quality, we require:<p>* 4+ years of experience as QA Engineer;<p>* Excellent understanding of REST APIs and structured responses such as JSON or XML;<p>* Excellent understanding of the web stack and its related technologies;<p>* Good understanding of client-server APIs;<p>* Experience with Jira and test management tools such as TestLink, or similar tools;<p>* Experience with test automation tools such as SOAPUI, Selenium, PhantomJS and scripting from the command-line;<p>* Flexibility to deal with a rapidly changing environment;<p>* Passion for quality.<p>Preferably you also have<p>• Good experience in writing web software using a framework such as Django&#x2F;Python;<p>• Experience with setting up server-based applications, such as a LAMP environment.<p>------------------------------------------<p>All positions are full-time, based on our office located downtown Amsterdam. Please apply at <a href=\"https://www.layar.com/about/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.layar.com&#x2F;about&#x2F;jobs&#x2F;</a> . If you have any questions, feel free to email me at rbp@layar.com<p>[Edits for formatting]","time":1396430061,"type":"comment"}