{"by":"davegolland","id":7514064,"parent":7507765,"text":"We&#x27;re Hiring at Prismatic (getprismatic.com)\nThe office is located in SOMA in San Francisco.<p>=============<p>Frontend Engineer at Prismatic: iOS, Web, and Android. <a href=\"http://boards.greenhouse.io/prismatic/jobs/5971\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;prismatic&#x2F;jobs&#x2F;5971</a><p>==<p>Strong CS basics in data structures and algorithms. Strong engineering; thoughtful design and clean code. Graphics, browser, games, or animation experience a big plus.\nA front-end engineer that has a strong computer science background, but wants to focus on product engineering rather than backend systems. You don’t want to just take off the shelf UI components, but want to explore new interactions. You aren’t afraid to dig under the hood of iOS frameworks or browser code in order to make an animation or interaction feel natural and smooth.<p>=============<p>Backend Engineer at Prismatic: <a href=\"http://boards.greenhouse.io/prismatic/jobs/5976\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;prismatic&#x2F;jobs&#x2F;5976</a><p>==<p>Prismatic is a great place to be a backend engineer - we analyze millions of shared web pages every day, automatically classify them into tens of thousands of topics, and serve up personalized feeds in real-time using our homegrown, lightning fast, machine learning-based relevance engine. We are looking to grow our top-notch team, with both junior and senior-level positions available.\nWe are looking for engineers with deep interest and knowledge in at least one area core to our business (i.e., distributed systems, ops and tooling, machine learning, designing and building new product features). We’re a small team, so you will have the opportunity to have a lot of impact, and to learn from peers who are extremely talented engineers, computer scientists, and data experts. Our backend is written entirely in Clojure, a JVM-based LISP that is a dream to work in. Almost none of us knew it before we joined, and we don’t expect you to either. We do, however, expect the following:\n- You live and die by good abstractions. You know that they can make the difference between easily understandable and maintainable code, and a spaghetti mess. - You think about edge cases and performance implications, and anticipate future needs. - You read and understand existing code before diving in and adding your own. You re-use existing code whenever possible, cleaning it up as needed to be more generally useful. - You know when to do it fast, when to do it right, and how to find the best compromise between the two. - You recognize that we are all stewards of the codebase, not owners. You leave code better than you found it, and you fix bugs without grumbling about whose they are. - You are a team player who enjoys discussing ideas and implementations with other engineers.\nHere’s a small sampling of the things you will be working on as a member of the Prismatic backend team:\n- Making our crawlers and document analysis better and more comprehensive - Building out new product features in our API - Solving tough systems problems to help us scale reliably and robustly - Building and improving Machine Learning systems for ranking, document analysis, and more - Creating tools to assist development and ops - Shipping some of the best open-source Clojure libraries out there, and working with the community to make them better<p>We are also looking for designers, visual and&#x2F;or interaction.","time":1396423109,"type":"comment"}