{"by":"MarkusMaier","id":7521604,"parent":7507765,"text":"BERLIN, SENIOR FRONTEND ENGINEER @ Keen<p>OUR MISSION\nKeen is a content curation and exploration platform that allows users to freely create, share and explore embedded multimedia content in customizable collections. Think &quot;Wikipedia on speed&quot;.<p>TEAM\nWe’re a young team of innovative and driven idealists disrupting the order of things. Our core team brings the Valley spirit to Berlin and hails from US top tier universities (Stanford &#x27;08 &amp; Brown &#x27;12). We just closed a big seed round to expand the engineering team and strive to hire the best international talent. We are the real (early stage startup) deal. Join us!<p>YOU\nYou eat web technologies for breakfast, your favorite pastime is hacking on a new challenge and you’re fascinated by software architecture. When faced with a problem, you rise to the occasion and use any resources available to you to find a solution. You have an open mind, high attention to detail and adopt best practices and design patterns whenever possible. FOR VISA REASONS, PLEASE ONLY APPLY WITH AN EU OR AMERICAN PASSPORT OR IF YOU HOLD A MASTERS IN CS.<p>YOUR QUALIFICATIONS\nAfter earning your degree in Computer Science or an equivalent professional education, you have gained various years of relevant work experience in a technical role. You are a skilled developer with strong experience in programming front end with very very good knowledge of Javascript and CSS. You have built single-page web applications, worked on many different large and small projects and collaborated diligently with clients and designers. You have experience with external APIs, REST &amp; test-driven development. You like to write clean and reusable code. If you speak Node.js fluently, we love that too.<p>WHAT WE OFFER\n* a kick-ass product to build from the ground up!\n* a high-impact role on a small team of designers and engineers\n* contributing to the architecture, technologies, and coding-standards\n* tackling interesting technical and UI challenges\n* an international, English speaking team\n* an open-source friendly environment\n* bringing a UI to life that feels like magic\n* attractive workspace in the heart of Berlin\n* and of course, a competitive remuneration package<p>WHAT NEXT?\nDoes this all spur your interest?!\nLet&#x27;s Talk!  We look forward to getting to know you. Drop us a line: join@letskeen.com","time":1396514180,"type":"comment"}