{"by":"pinterestjobs","id":7610435,"parent":7507765,"text":"San Francisco - Pinterest<p>Pinterest is a visual discovery tool for collecting and organizing things you love and enjoy. Millions of people use Pinterest daily in their lives and work. No matter what you&#x27;re interested in, there&#x27;s a place for it here.<p>As a Software Engineer on the Growth Team at Pinterest, you’ll have a huge impact on how we design, build and deliver our service to millions of people. You should be a generalist who enjoys working across the software stack with a strong focus on data and a keen eye for product. Prototyping, running A&#x2F;B tests, pushing code into production, weighing in on the best ways to grow Pinterest and engage Pinners...if that all sounds good to you, then this might just be the place for you.<p>Responsibilities:<p>-Find ways to get new users on the site and engaged with the product. This includes SEO, signup optimizations, new-user experiences and any product change you think needs to happen. For more about how we work, read all about how we recently rebuilt our new user experience and created our SEO sitemaps on our engineering blog: <a href=\"http://engineering.pinterest.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.pinterest.com&#x2F;</a>\n-Be heavily involved in every step of the product development process, from ideation to implementation to release.\n-Build new features that increase social sharing both within Pinterest and externally with friends (SMS, Facebook, Twitter).\n-Improve the messaging platform so that we can send our Pinners engaging and timely notifications and emails.\n-Run experiments on new and existing features to improve the overall Pinner experience. For example, check out our blog post on how we recently added animated GIF support.\n-Build and improve the tools and frameworks that let us quickly run experiments across all our platforms, including our A&#x2F;B experiments system, funnel analysis system, experience framework and more.<p>Requirements:<p>-BA&#x2F;BS degree in Computer Science or equivalent work experience (2+ years programming).\n-Proficiency in a dynamic programming language such as Python.\n-Strong focus on data and love for improving the Pinner experience.<p>Find out more on our site: <a href=\"http://about.pinterest.com/careers/openings/?gh_jid=8122\" rel=\"nofollow\">http:&#x2F;&#x2F;about.pinterest.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=8122</a>\nAnd check out our engineering blog: \n<a href=\"http://engineering.pinterest.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.pinterest.com&#x2F;</a>","time":1397844652,"type":"comment"}