{"by":"motoprog","id":7680079,"parent":7507765,"text":"The URBN Mobile Engineering Team is responsible for creating and delivering the URBN brand applications (UO, Free People, etc.) as well as a suite of applications that power our retail experiences.  We are located in a new building on the URBN campus in the Philadelphia Navy Yard.<p><a href=\"http://www.archdaily.com/92989/urban-outfitters-corporate-campus-meyer-scherer-rockcastle/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.archdaily.com&#x2F;92989&#x2F;urban-outfitters-corporate-ca...</a><p>The mobile team is leading change at URBN using the latest SDK features, cross-functional collaboration, and hard work. The engineer for this position should be someone who has shipped multiple applications to the app store; that can collaborate and influence designers, product owners, as well as peers; someone who can translate features and work to other members of the company. Good ideas come from everywhere and the mobile team expects open mindedness when approaching a solution.<p>The right engineer for this position should be passionate about Objective-C, while having the ability to pickup other languages across our stack (Java, JavaScript, Python) if needed. Futhering the existing automation and testing suites will be one of the main goals of this candidate, so experience is a must. The mobile team engineers also have strong opinions<p>Guidelines:\n- Experience with the software development cycle: product specification, design, implementation, QA, release, and maintenance.\n- 2+ years professional experience in creating native iOS applications, preferably ones that have been approved for release in the App Store.\n- Familiarity with common libraries and Cocoa design patterns.\n- A strong desire for developing high quality applications utilizing unit and integration testing techniques\n- A strong passion for learning and adapting to new technologies.\n- Ability to multi-task and context switch when necessary<p>We are carefully growing a fantastic team here at URBN and there has never been a more exciting time to get involved.  We hope you&#x27;ll come join in the fun!<p>Please send your CV and Github account user to: talent@urbn.com","time":1398955777,"type":"comment"}