{"by":"shaver","id":2058685,"kids":[2058862,2073491,2058746,2059740],"parent":2057704,"text":"tl;dr: Mozilla is hiring, and we have many different kinds of positions open.  Main offices are in Mountain View, Toronto, Auckland, Paris; remote work very much a possibility, esp for people with experience doing it.  I know most about engineering, but the fullish list is off <a href=\"http://www.mozilla.com/en-US/careers\" rel=\"nofollow\">http://www.mozilla.com/en-US/careers</a><p>Platform engineers: the native-code guts of Firefox, you could work on things ranging from network protocols to scripting performance, 3D graphics to parallelism, performance tuning to debugging and instrumentation.  And you get to deliver new web capabilities to about half a billion people.  Want to make contentEditable not suck?  Want to fix the CSS layout model so people don't miss tables?  Want to make Flash and Silverlight sweat more bullets?  Us too.<p>Firefox engineers: 2011 is going to be a very exciting year for Firefox, and we have lots of ambitious work planned.  There is lots systems work as we move to a multi-process model, as well as lots of \"app logic\" and more traditional front-end stuff.  Client-side web skills map well, and we want to make them map even better; you can help with that too.<p>Web developer tools: we're going to be significantly increasing our investment in developer tools, to improve the web development experience dramatically.  Package up the complexities of the web platform and make it grokkable to everyone from a grade-schooler to jeresig.<p>Engineering management: we need more people who know how to make developers successful and satisfied, and get joy out of doing it.  Our engineering organization spans the globe, has a scope as broad as the web itself, and competes against the biggest software companies in the world.<p>Developer infrastructure: we run a large software operation on open source tools, and want to make everything from crash reporting to bugzilla to mercurial to the build system work better.  Take the hard information problems of software development, make web apps and other tools to help understand and solve them.  If you have partially automated your breakfast routine, and want to play with some pretty large-scale data, this could be a lot of fun.<p>Security: program management and penetration testing both.  Your purview is security at the full breadth of the web.<p>Web development, apps big and small: top-25 web properties (without ads), software update systems for 420M+ users, demos for new web technologies, crash analytics systems backed by dozens of Hadoop nodes.<p>Mozilla is a non-profit organization chartered to improve the web.  We pay competitive salaries, have great benefits, and work in the open.  Wake up every morning glad you get to do the right thing!","time":1293921898,"type":"comment"}