{"by":"ronspy","id":19059952,"parent":19055166,"text":"SpyCloud | Austin, TX | Onsite | Full-time | <a href=\"https:&#x2F;&#x2F;www.spycloud.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.spycloud.com</a>\nSpyCloud is a pioneer in breach discovery. We strive to help businesses of all sizes mitigate data breaches by proactively alerting when employee or company assets have been compromised. We accomplish this through our early-warning breach detection service powered by a world-class team of intelligence analysts. We&#x27;re looking for the following:<p>1) Software Developer (Password Cracking) (<a href=\"https:&#x2F;&#x2F;www.indeedjobs.com&#x2F;spycloud&#x2F;jobs&#x2F;4a55ec9eec2405fdd50...\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeedjobs.com&#x2F;spycloud&#x2F;jobs&#x2F;4a55ec9eec2405fdd50...</a>)<p>SpyCloud manages the most expansive database of plaintext passwords in the industry. Once a new breach is recovered from the dark web, we use specialized hardware and software to crack as many of the password hashes as possible. This gives developers the ability to prove user exposures and automate password exposure checks across internal systems. We&#x27;re looking for someone to manage password cracking efforts and add new features&#x2F;optimizations to our password cracking platform.<p>Stack - Python, Pyramid, MySQL, All things AWS!<p>2) .NET Developer (<a href=\"https:&#x2F;&#x2F;www.indeedjobs.com&#x2F;spycloud&#x2F;jobs&#x2F;b7db83b305e0ce8cb20...\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeedjobs.com&#x2F;spycloud&#x2F;jobs&#x2F;b7db83b305e0ce8cb20...</a>)<p>We&#x27;re looking for someone who can contribute to our Active Directory Guardian software (<a href=\"https:&#x2F;&#x2F;spycloud.com&#x2F;pages&#x2F;active-directory-protect&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;spycloud.com&#x2F;pages&#x2F;active-directory-protect&#x2F;</a>). Active Directory Guardian leverages SpyCloud&#x27;s massive database of exposed credentials to protect corporate Windows domain environments from Account Takeover attacks. You will also be responsible for developing new tools that can leverage our data to protect Microsoft deployments.<p>Stack - C#, ASP.NET Core, Azure<p>If you&#x27;re interested or have any questions, please email me at ronak@spycloud.com. You can also apply via the links above.","time":1549065410,"type":"comment"}