{"by":"apu","id":19055944,"parent":19055166,"text":"Dropbox | Machine Learning Engineer | New York City, NY (SF and Seattle also possible) | Onsite, full-time<p>Dropbox is used by over half a billion people to share knowledge and coordinate work in organizations large and small. Our Machine Learning (ML) team is working on a variety of applications to make this process much easier and reduce the “work about work” that consumes a large part of many people’s days.<p>From images and videos to documents and audio (in every language!), we tackle it all. We leverage the full range of classic &amp; modern ML techniques (whatever a problem calls for), including {semi,un,}supervised learning, deep learning of all flavors (from CNNs to LSTMs and beyond), and online&#x2F;interactive learning.<p>Our current focus is on a set of features we’re calling DBXi (for intelligence); see this blog post for more details about our vision: <a href=\"https:&#x2F;&#x2F;blogs.dropbox.com&#x2F;tech&#x2F;2018&#x2F;09&#x2F;machine-intelligence-at-dropbox-an-update-from-our-dbxi-team&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.dropbox.com&#x2F;tech&#x2F;2018&#x2F;09&#x2F;machine-intelligence-...</a><p>This involves investments into a number of different areas, including deep understanding of many different content types, extracting and representing knowledge to build connections between items, and analyzing file activity and hierarchies — at scale! — to help keep teams more organized and individuals more focused on the work that really matters.<p>We&#x27;re looking for people with either academic or practical backgrounds in machine learning, ideally with experience in natural language understanding, information retrieval, or knowledge extraction. We’re growing an ML team within our NYC office and looking for both ML engineers and a NYC-based manager for this team. In addition, we also have openings in our existing ML teams in San Francisco&#x2F;Bay Area and Seattle as well.<p>Responsibilities:<p>-  Work within the Machine Learning Team to prototype, design, code, train, test, deploy, and iterate on large scale machine learning systems.<p>- Build delightful products and experiences for millions, while working alongside an excellent, cross-functional team across Engineering, Product and Design.<p>- Help shape the direction of machine learning and artificial intelligence at Dropbox.<p>Benefits and Perks:<p>- Having tremendous impact on products used by hundreds of millions of people around the world<p>- Working with a highly skilled and experienced ML team with backgrounds in industry &amp; academia, across many different fields<p>- Market competitive total compensation package<p>- Comprehensive medical, dental, &amp; vision insurance coverage<p>- 401k + company match<p>- Generous vacation &amp; volunteer policy<p>- Free Dropbox space for your friends and family :-)<p>Please reach out to me to apply, or even just to chat&#x2F;ask a question! (Contact info in my profile.)","time":1549040805,"type":"comment"}