{"by":"RichardPrice","id":19058379,"parent":19055166,"text":"Academia.edu | Full Stack Engineers; Product Managers; Data Scientists | San Francisco, CA | Onsite<p>The mission of Academia.edu is to accelerate the world’s research. To accelerate the pace of discovery. Academia.edu is building a new communications system for the dissemination and peer review of academic research.<p>We believe that there are some inefficiencies in academic publishing today. We believe that by shifting to an internet-first dissemination system, academic publishing can be made faster, cheaper, and more reliable.<p>Over 20 million papers have been uploaded to Academia.edu, out of 100 million papers ever written. About 40 million people visit Academia.edu each month to access academic research. Academia.edu became profitable in 2017 off of a premium business model.<p>Here are some of the priorities at Academia.edu:<p>- Open access: we want every paper ever written to be on the internet, available for free<p>- Distribution system: for any given upload, it could be distributed to any one of Academia.edu&#x27;s 72 million registered users. The goal of the distribution system is to enable a paper be distributed to the right subset of people. We want that subset to see that paper in their News Feed and think “Wow, I really want to read that.”<p>- Multi-platform: we started out on Web, and we are in the process of releasing an iOS app. After the iOS app, we will release an Android app.<p>- Peer review: as papers are distributed through the Academia.edu graph, academics share their opinions about those papers, and those opinions aggregate over time.<p>We have raised $33 million from Tencent, Khosla Ventures, Spark Capital, and True Ventures. Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot;<p>We are looking to hire full stack software engineers, iOS engineers, product managers, and data scientists. Technologies we use include Ruby, Rails, Postgres, DynamoDB, React. Our office is in downtown San Francisco. For more information, visit <a href=\"http:&#x2F;&#x2F;academia.edu&#x2F;hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>.<p>If you are interested to learn more, please email the CEO, Richard Price, at richard [at] academia.edu","time":1549053787,"type":"comment"}