{"by":"blizkreeg","id":19057574,"parent":19055166,"text":"Oncue | oncue.co | Senior Software Engineer | On-site, full-time | Oakland, CA<p>We&#x27;re an Oakland-based startup with a mission to bring trust, transparency, and ease to one of life&#x27;s most stressful experiences - moving. Much of this industry still runs on pen and paper. We&#x27;re changing that, and in the process, building a superior consumer-side experience as well.<p>We&#x27;re growing fast. Just this past year, more than 11,000 moves across more than a dozen states were managed through our platform. To keep up with demand for our service, we&#x27;d like to bring a Senior Engineer on who can help us take the product to the next level.<p>YOUR ROLE:\nAs an experienced engineer on the team, you get to establish the practices and systems that foster a strong, high-performing engineering team. You&#x27;re ideally someone who is very hands-on and enjoys rapidly iterating and shipping high-quality software. You&#x27;ll guide the team towards the right technical decisions.<p>WHAT WORKING AT ONCUE IS LIKE:\nAs a company, we&#x27;re committed to helping you grow. We believe in promoting internally and have done so on multiple occasions. You&#x27;ll work with experienced Sales and Product leaders at an early stage startup that has a proven business model. We&#x27;re also proud of the fact that 60% of our leadership team is female.<p>OUR STACK: Rails, React, React Native, Postgres.<p>INTERVIEW PROCESS: A bit about our interview process for senior engineers, which I think is different from many others, and a lot more real! See <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;vinthanedar&#x2F;status&#x2F;991149057555906560\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;vinthanedar&#x2F;status&#x2F;991149057555906560</a><p>APPLY: I&#x27;m one of the co-founders. Reach out to me at vineet[at]oncue dot co if you&#x27;re interested.<p>I recently wrote a piece about the things we have done right shipping product: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@vinthanedar&#x2F;teams-that-ship-de7b909bb8d6\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@vinthanedar&#x2F;teams-that-ship-de7b909bb8d6</a> - your experience may resonate with it.","time":1549049306,"type":"comment"}