{"by":"rmajmudar","id":19056035,"parent":19055166,"text":"Harry’s &amp; Flamingo | Backend Engineer, Data Engineer, DevOps Engineer | New York | Onsite, Fulltime | <a href=\"https:&#x2F;&#x2F;harrys.com\" rel=\"nofollow\">https:&#x2F;&#x2F;harrys.com</a> | <a href=\"https:&#x2F;&#x2F;shopflamingo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;shopflamingo.com</a><p>We are a multi-brand company in the men’s and women’s care and grooming space - we power <a href=\"https:&#x2F;&#x2F;harrys.com\" rel=\"nofollow\">https:&#x2F;&#x2F;harrys.com</a> and <a href=\"https:&#x2F;&#x2F;shopflamingo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;shopflamingo.com</a>, with millions of customers worldwide.<p>At Harry’s, you will join a backend team of ~6 people in New York, working on backend services, focused on data or joining in a devops role. The larger engineering organization is ~35 people.<p>We are building a cutting edge technology stack that is more sophisticated than first meets the eye (service-oriented using Scala &#x2F; Play, AWS, Kubernetes, Postgres, Python, Snowflake, Athena). You don’t need to know our stack - we are looking for driven, talented engineers that can help build the platform that will enable our vision.<p>Our engineers say they (1) love having ownership, contributing directly to the company’s success, (2) love the culture (especially work &#x2F; life balance with an average 40 hrs per week) (3) having smart &#x2F; nice co-workers (4) the fast pace of the team and (5) the rapid growth of the company<p>We offer highly competitive compensation with significant upside in equity, zero premium health plans, flexible time off, 5 days of paid time to volunteer, 401k matching, 16 weeks of paid parental leave and of course a fully loaded kitchen.<p>Apply here - <a href=\"https:&#x2F;&#x2F;www.harrys.com&#x2F;en&#x2F;us&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.harrys.com&#x2F;en&#x2F;us&#x2F;careers</a>. Feel free to email me with any questions roopak.majmudar@harrys.com.","time":1549041240,"type":"comment"}