{"by":"eloff","id":19055483,"parent":19055166,"text":"REMOTE long-term contract position with good pay for experienced React developer.<p>Company Description: Facilitation Labs is an early stage corporate innovation consulting firm focused on helping the insurance industry take advantage of new technological capabilities. We have an immediate opening to work on one specific initiative building proprietary technology in partnership with a Fortune 500 insurance company that will have broad applications and a significant impact on the status quo of how insurance is bought and sold.<p>What You’ll Do: This is a fully remote, long-term contract opening for senior developers (5+ years experience) React web developers (2+ years) with TypeScript proficiency. As part of a small team you’ll personally make a substantial contribution and your decisions will matter. \nHelp define the architecture and tooling for complex backend systems and data pipelines\nOwn and develop complex and secure services in React.js (heavy experience with TypeScript also desired)\nSet and hold a high bar for quality, well-tested code\nMotivated by a fast-paced, rapidly changing environment where every action drives company&#x27;s success and defines engineering culture at Facilitation Labs\nOn the job you’ll be using basic familiar tools like GitHub and Slack.<p>Technologies We Use:\nTypeScript, React.js, Redux, Go\nFirebase, Hashicorp Vault, S3\nAWS, Linux, Kubernetes, Docker\nGithub, Slack<p>You Have:\n5+ years professional work experience as a Software Developer\n2+ years working with React.js\nExperience with TypeScript\nExperience working remotely, including open-source projects\nFluent written and verbal English communication<p>To Apply:\nSend a resume to jobs@facilitationlabs.io along with an answer to the question:\n “why must you always use setState instead of modifying React state directly?” Please add links to any React work you’ve done that you’d like to share, include a link to the repo if open-source.","time":1549038407,"type":"comment"}