{"by":"jsomara","id":19058314,"parent":19055166,"text":"Citrine | Redwood City, CA | Frontend Engineering | ONSITE | Full-time | <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;</a> |\nCitrine Informatics is building the next-generation materials development platform from the ground up, using the power of domain expertise, data, and machine learning to bring new materials to market faster, and capture materials-enabled product value.<p>As part of the Front End Engineering team, you will be helping to design and build the next generation application in Materials Science. You will be creating a UX framework to empower scientists and engineers to discover, experiment with and create the materials and products of the future. Using our AI, scientists at Fortune 1000 companies have developed new materials that enable improvements from longer battery life to more efficient solar technology. Working in collaboration with our customers, we’re building the next version of our UI - and we’re looking for talented engineers to help lead the charge.<p>Open Positions:<p>Sr. Front End Engineer: <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#senior-frontend-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#senior-frontend-software-enginee...</a><p>As a senior leader of our staff you will help drive both engineering and software design as well as help scale and mentor our engineering team<p>Jr. Front End Engineer: <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#junior-frontend-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#junior-frontend-software-enginee...</a><p>As a valued member of our world-class engineering team you will continue to grow your technical abilities while contributing to our new platform in a fast-paced and exciting environment.<p>General job page: <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;</a><p>Some buzzwords to give an idea of what we are working with:<p>Frontend: React, Jupyter Notebooks&#x2F;Python, Node.js&#x2F;Express,<p>Our customers include some of the world’s largest Fortune 1000 materials and product companies. Citrine is backed by leading investors including Tencent Holdings, B&amp;C Holdings, Innovation Endeavors, DCVC (Data Collective), Prelude Ventures, AME Cloud, XSeed Capital, Morado Ventures, and Ulu Ventures.<p>Please reach out to Mark (mcooper AT citrine DOT io) if you have any questions.","time":1549053477,"type":"comment"}