{"by":"JasonCEC","id":19058352,"parent":19055166,"text":"Analytical Flavor Systems | Manhattan - NYC | Full-Time | Onsite | <a href=\"http:&#x2F;&#x2F;www.Gastrograph.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.Gastrograph.com&#x2F;</a><p>Positions: Full-Stack Engineer, Data Scientists, R&amp;D Product Formulator &#x2F; Scientist<p>Overview: Gastrograph AI is an artificial intelligence platform for modeling human sensory perception of flavor, aroma, and texture to predict consumer preferences of food &amp; beverage products. We help food and beverage companies develop new products, enter new markets, and optimize their existing brands. We&#x27;re a diverse 12 person post Series-A startup.<p>Application &amp; Data Stack: Javascript, React &amp; React Native, Java, GraphQL, Spark, R, postgres&#x2F;MySQL, AWS<p>The Position(s)<p>_Data Science_: We didn&#x27;t build a data science team to optimize our product&#x27;s marketing spend, sales funnel, or client retention – we built a data science team to build our product. Our Data Science team develops new models and algorithms from scratch to make second-order inference on sparse data sets from non-representative samples that generalizes to the underlying target population. We rely on cutting edge models such as persistent homology, PU Learning, and metric learning to make predictions on non-eucldian human sensory data. We don&#x27;t use tensor flow or pandas or keras as they are not a good fit for our problem space. We prefer a deep understanding of math and stats VS experience running logistic regressions in Python. \n(but we&#x27;re cool with Python &#x2F; Logit &#x2F; experience)<p>_Engineering_: (1) full stack engineers with experience with React, GraphQL, and React Native to work on our web app for clients and our mobile app for tasters. (2) Data-Engineers with experiance in micro-batch processing for machine learning pipelines.<p>Next Steps: please contact Jason Cohen at JasonCEO@Gastrograph.com to apply.","time":1549053658,"type":"comment"}