{"by":"mglidden11","id":19057649,"parent":19055166,"text":"Tulip | <a href=\"https:&#x2F;&#x2F;tulip.co&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tulip.co&#x2F;careers</a> | Boston, MA | Full time | Onsite Do you want to help transform manufacturing? We are building the best team in the industry to bring consumer-grade user experiences to a space dominated by ancient enterprise technology. Our platform enables our customers to create apps without code and to connect their apps to machines, sensors and smart tools. These augmented production lines would otherwise rely on paper to share information. We’re based in Somerville, MA and have raised $13m from NEA, Pitango, and other leading investors. Our customers include some of the largest manufacturers in the world across numerous verticals of the manufacturing industry. If you are looking to join a fast-growing, mission-driven company, and want to make a lasting impact on our organization and the manufacturing industry, we&#x27;d love to talk to you.\nWe&#x27;d love to talk to anyone interested, but in particular we are looking to bring folks on in:<p>- SRE&#x2F;DevOps: Kubernetes-admin, scalable monitoring across the firewall, hybrid cloud&#x2F;on-prem deployment<p>- SRE&#x2F;DevOps: Azure cloud architect, ideally with container service&#x2F;AKS experience - will consider contractors as well as F&#x2F;T, depending on interest and experience<p>- Web Development: React+Redux frontend, NodeJS+Mongo+Postgres+Redis backend, syncing data with Meteor, delivering useful, real-time experiences in the browser and on Electron<p>- Data &amp; Pipeline Engineering: planning, implementing, and finding insights with our next generation of process &amp; sensor analytics<p>- IoT&#x2F;Embedded Software: delivering a reliable, extensible HW platform across arm and x86, all manner of bus&#x2F;IO tech<p>Apply at <a href=\"https:&#x2F;&#x2F;tulip.co&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tulip.co&#x2F;careers</a> or email us at jobs@tulip.co","time":1549049738,"type":"comment"}