{"by":"chrstphrhrt","id":19058580,"parent":19055166,"text":"OpenMessage | Platform, Analytics &amp; Dev Tools Engineer | <a href=\"https:&#x2F;&#x2F;openmessage.io\" rel=\"nofollow\">https:&#x2F;&#x2F;openmessage.io</a> | NYC | Full-time | ONSITE or REMOTE in North America, EST timezone | $80-$120k + 0.1-2%<p>Hey fellow engineers and future colleagues,<p>We are making advances in the field of applied conversational experiences for messaging. Our platform implements true mixed-initiative dialog, which is not possible with stock AI frameworks or services.<p>It&#x27;s also pretty awesome that goal-oriented conversations are like conversion funnels, which makes for deeply meaningful metrics. If you&#x27;re into analytics, this is the lifeblood of our decision making so there is a lot of impactful work to do.<p>We are starting to share our API with other companies and need to create a great developer experience for them. This new role will get to own the open source SDK and client libraries, CLIs, documentation, key management etc. Same goes for logging, BI, and infrastructure for the developer ecosystem.<p>Our main tooling is a mix of Python, Node, PostgreSQL, Redis, and Elasticsearch. We prefer smaller abstractions, less frameworks, minimal dependencies, and leveraging purpose-built components. We value orthogonality and safety as design principles over cleverness and magic.<p>We are strongly motivated by inclusiveness of all genders, faiths, origins and backgrounds and are careful about ensuring a harmonious and respectful team culture with space for every voice and safety in mutual vulnerability. We value work life balance, boundaries, and privacy. No jerks allowed, but freaks and geeks are always welcome!<p>There is a small take-home project that covers basic data transformation and schema design. No silly puzzles or whiteboarding exercises. Open source code can be submitted as an alternative if applicable.<p>We will have an interview to go over implementation choices, ideas, and discuss technology. Then we do a couple with other team members to cover general topics like management philosophy, industry and market perspectives, intellectual motivations, professional development trajectory, office environment, interpersonal style etc.<p>Email me at chris@openmessage.io to set up a call. Thanks!","time":1549054991,"type":"comment"}