{"by":"johndbritton","id":19057911,"parent":19055166,"text":"Personal | Software Developer Apprentice | New York, NY | REMOTE &#x2F; FULL TIME &#x2F; INTERNS | <a href=\"https:&#x2F;&#x2F;airtable.com&#x2F;shr7Gxoh0jDu3Dwr8\" rel=\"nofollow\">https:&#x2F;&#x2F;airtable.com&#x2F;shr7Gxoh0jDu3Dwr8</a><p>I&#x27;m hiring a Software Developer Apprentice, full-time and paid.<p>There will be an emphasis on learning and quality, not speed of development. You&#x27;ll work on: frontend and backend web applications, mobile applications, desktop applications, and APIs.<p>=============================<p>Software Developer Apprentice<p>This is an excellent opportunity for an aspiring software developer who is eager to learn by doing.<p>Details:<p>The position is full-time and paid. Day to day work will be remote, but candidates may prefer to relocate to New York City temporarily for in person mentorship and learning opportunities.<p>In this position you will be tasked with a variety of software development projects spanning the entire stack using the following technologies:<p>* Web frontend: React<p>* Web backend: Ruby on Rails<p>* Mobile: iOS with Swift<p>* Desktop: Cross platform with Electron<p>* Platform: REST and GraphQL APIs<p>You will work on real projects and receive mentorship on software development and industry best practices. There will be a strong emphasis on producing quality work and becoming a great developer and less of an emphasis on speed of development.<p>This is not a typical job at a company. It&#x27;s a paid full time apprenticeship opportunity working with John Britton in an individual capacity.<p>Qualifications:<p>This is an apprenticeship: zero professional experience is required. Candidates must, however, have demonstrated determination and an unwavering desire to learn. Acceptable evidence may include: completed coursework, self study records, side projects, and personal recommendations.<p>Apply: <a href=\"https:&#x2F;&#x2F;airtable.com&#x2F;shr7Gxoh0jDu3Dwr8\" rel=\"nofollow\">https:&#x2F;&#x2F;airtable.com&#x2F;shr7Gxoh0jDu3Dwr8</a>","time":1549051319,"type":"comment"}