{"by":"OmarIsmail","id":19056683,"parent":19055166,"text":"Streak | Engineering Site Lead | Vancouver, BC | ONSITE\n<a href=\"https:&#x2F;&#x2F;www.streak.com&#x2F;careers&#x2F;vancouver-site-lead\" rel=\"nofollow\">https:&#x2F;&#x2F;www.streak.com&#x2F;careers&#x2F;vancouver-site-lead</a><p>Streak is establishing our first engineering office outside of San Francisco. We know that it takes focus and intentional planning to make a distributed office a success, and we&#x27;re looking to partner with an experienced engineer to take on the role of site lead and build out the office.<p>Your day to day will include:<p>- Engineering: We&#x27;re not particular about where in the stack you&#x27;re looking to contribute (see our existing engineering reqs for some possibilities, but we&#x27;re flexible), but we are looking for somebody with a strong engineering background who wants to be hands-on as the team gets off the ground. As the team grows, we&#x27;ll figure out together what division of time makes sense.<p>- People Management: Work with Vancouver engineers to make sure they&#x27;re happy, healthy, and engaged. Ensure that the team grows in a way that makes sense for both the office and Streak overall. Facilitate communication both within the site and with the San Francisco team.<p>- Recruiting: Lead hiring in Vancouver and work with the Streak recruiting team to source great candidates. Attend meetups and events, be the face of Streak in Vancouver.<p>We are excited about you if you:<p>- You&#x27;re an experienced engineer. You&#x27;ve contributed significantly to an evolving codebase and have the learnings to show from it.<p>- You&#x27;re an experienced leader. You&#x27;ve been a people manager, a product manager, or a tech lead for a significant team or product.<p>It would be phenomenal if:<p>- You have experience with distributed teams, especially in management.<p>- You&#x27;re familiar with the tech ecosystem in Vancouver. We&#x27;re new here ourselves and would love to partner with someone who knows their way around.<p>Learn more about our plans for Vancouver here: <a href=\"https:&#x2F;&#x2F;www.streak.com&#x2F;offices&#x2F;vancouver\" rel=\"nofollow\">https:&#x2F;&#x2F;www.streak.com&#x2F;offices&#x2F;vancouver</a><p>To learn more about the company and how we operate check out our careers page <a href=\"https:&#x2F;&#x2F;www.streak.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.streak.com&#x2F;careers</a>.","time":1549044591,"type":"comment"}