{"by":"helmg","id":19057926,"parent":19055166,"text":"Open Systems | Systems &#x2F; DevOps Engineers, Full Stack Engineers | Zurich, Switzerland | ONSITE | Fulltime | www.open.ch<p>In close collaboration with all engineers of the development department and product owners, you develop components of our managed security services. You ensure that these components and systems around the world can be configured, operated and monitored in a highly scalable manner. As part of the Mission Control team, you share operational duties with your colleagues.<p>Do you have existing know-how or a high motivation to acquire new knowledge in the following areas:<p>- Internet protocols (TCP&#x2F;IP, HTTP, SSL, SMTP, DNS)<p>- Knowledge of network security concepts and practices<p>- UNIX&#x2F;Linux<p>- Experience in software engineering with programming languages (e.g. golang, C, C++) and scripting languages (e.g. Bash, Python, Perl)<p>Are you ready to face the challenge of extending and improving our fully managed secure SD-WAN, apply for our Systems &#x2F; DevOps Engineer positions:<p><a href=\"https:&#x2F;&#x2F;opench.bamboohr.co.uk&#x2F;jobs&#x2F;view.php?id=42\" rel=\"nofollow\">https:&#x2F;&#x2F;opench.bamboohr.co.uk&#x2F;jobs&#x2F;view.php?id=42</a><p>Do you have existing know-how or a high motivation to acquire new knowledge in the following areas:<p>- Experience in web application development on the client side (JavaScript, CSS3, HTML5, React) and the server side (Java, Spring)<p>- Familiarity with SQL and relational databases<p>- Basic knowledge of build and deployment environments (Atlassian Bamboo, Maven, Tomcat)<p>Are you ready to face the challenge of making IT security visible, understandable and beautiful, apply for our Full Stack Web Application Engineer positions:<p><a href=\"https:&#x2F;&#x2F;opench.bamboohr.co.uk&#x2F;jobs&#x2F;view.php?id=111\" rel=\"nofollow\">https:&#x2F;&#x2F;opench.bamboohr.co.uk&#x2F;jobs&#x2F;view.php?id=111</a><p>You will join one of our small development teams that work with agile methods. The team will rely on you to focus on its goals and efforts as a team player while being able to work independently. At Open Systems we are passionate about what we do. We work in an environment in which innovative solutions, rapid development cycles, creativity and open communication are practiced and continuously fostered. The pursuit of technical advancement is at the center of our attention. You will be based at our office in Zurich (Switzerland) and will get the opportunity to work out of our office in Redwood City (US) for a few months.","time":1549051422,"type":"comment"}