{"by":"MKK","id":19056991,"parent":19055166,"text":"Aurora Solar | <a href=\"https:&#x2F;&#x2F;www.aurorasolar.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.aurorasolar.com&#x2F;</a> | San Francisco, CA | ONSITE | Full Time &amp; INTERN | VISA | Senior Frontend Engineer<p>TL;DR: Enjoy building complex web apps using WebAssembly, JS and WebGL to create an amazing CAD experience in a browser? Cool, so do we. Watch this to get a feel for how the app looks like today: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=oidOVwueS-k\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=oidOVwueS-k</a><p>print_job_posting --verbose<p>We are building the software platform that powers the the solar industry. Our clients are companies that work on transitioning our society to a future of sustainable energy by selling, designing and installing solar installations. Aurora enables them to do their job better, faster, and more efficiently. Aurora is a cloud-based SaaS solution that allows solar installers to build 3D models of buildings and trees, simulate the impact of shading on a homeowner&#x27;s roof, design advanced solar systems, calculate the financial return of a solar system and generate beautiful sales proposals. By enabling solar installers to do all of this in a short time and without having to leave their office, Aurora helps to reduce the cost of solar installations and make solar energy more widely available.<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.aurorasolar.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.aurorasolar.com&#x2F;careers</a><p>Frontend: Ember, Coffee&#x2F;Javascript&#x2F;ES6, WebGL, WebAssembly<p>Backend: Python, Ruby on Rails, C++, Go, Postgres<p>If you&#x27;re interested in working with us please apply online, mention you&#x27;re from HN and let us know what you&#x27;ve been working on lately. If you have any questions before applying, email me directly at mklocker@aurorasolar.com.","time":1549046145,"type":"comment"}