{"by":"bwreilly","id":19057182,"parent":19055166,"text":"DroneSeed | Seattle | Multiple Positions | Full-time | ONSITE, REMOTE<p>We at DroneSeed are working to address climate change by making reforestation scalable with drone swarms - surveying, planting trees, and spraying to protect them. We’re Techstars ‘16 alum, VC backed, and working with 3 of the 5 largest timber companies in the US.<p>We are looking for both hardware and software engineers that are deeply connected to our mission and capable of supporting our operations crews by designing, building, and maintaining state-of-the-art equipment, aircraft, and applications.<p>If you are someone with an engineering background and a bunch of hobby projects cluttering your home, drop us a line! We are especially interested in individuals with hands-on experience with unmanned aircraft, robotics, multi-agent path planning, remote sensing, and rapid prototyping.<p>But you don&#x27;t necessarily need to be an expert in drones! We have are a ton of projects around asset management, project planning, distributed logs&#x2F;metric collection&#x2F;analysis, and human-centric design (the UX of the ground control software, for instance).<p>Our hiring process involves a short take-home work sample test, reviewing work you have done, and reviewing our stuff. We want creative, thoughtful, empathetic people with serious grit to join a team dedicated to inclusivity and an important mission.<p>HW Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;452504-hardware-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;452504-hardware-engineer</a>\nSW Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;308041-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;308041-software-engineer</a><p>Or email at jobs@droneseed.com<p>Some media: <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2018&#x2F;11&#x2F;26&#x2F;that-night-a-forest-flew-droneseed-is-planting-trees-from-the-air&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2018&#x2F;11&#x2F;26&#x2F;that-night-a-forest-flew-d...</a><p>Our site: <a href=\"https:&#x2F;&#x2F;www.droneseed.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.droneseed.com</a>","time":1549047044,"type":"comment"}