{"by":"kaitlynkarat","id":19060454,"parent":19055166,"text":"Karat - Seattle, WA &amp; Remote<p>Karat is a Seattle-based startup that does software engineering interviews on behalf of other companies -- primarily first-round technical interviews. Quickly-growing companies can spend a significant fraction of their engineers&#x27; time interviewing; we help take the load off.<p>We are a well funded and quickly growing startup. Due to this quickly-growing demand, we&#x27;re looking to hire more Interviewer Engineers. The ideal candidate is a software engineer with strong written and verbal English skills with at least a few years of professional experience. Interviewing experience would be great, but we spend 20-25 hours (paid) training you before you even start, so if you&#x27;re strong technically and love working with people we can usually make it work. :) Interviews are conducted over video chat, using a collaborative code editor.<p>Freelance Interview Engineer - Remote - 7-40hrs per week <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a><p>Located in Seattle? Join us 2&#x2F;26 at the Riveter to hear about what its like to be an interviewer.<p><a href=\"https:&#x2F;&#x2F;www.eventbrite.com&#x2F;e&#x2F;engineering-the-technical-interview-tickets-54892681488?aff=linkedin\" rel=\"nofollow\">https:&#x2F;&#x2F;www.eventbrite.com&#x2F;e&#x2F;engineering-the-technical-inter...</a><p>Interested in a full-time opportunity? We’re also looking to hire a Senior Software Engineer. The ideal candidate is a software engineer with strong leadership and mentoring experience and at least four years of professional experience.<p>Senior Software Engineer - Seattle, WA - Relocation Available <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;7d70ca8a-2ed6-49a3-8403-b842ceabb60b\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;7d70ca8a-2ed6-49a3-8403-b842ceab...</a><p>If you have questions please email me at kp@karat.io\nVisit us at www.karat.io","time":1549071902,"type":"comment"}