{"by":"deepakkarki","id":19061489,"parent":19055166,"text":"Clarisights | Frontend, Backend, Data engineers | Bangalore, India | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;clarisights.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;clarisights.com&#x2F;careers</a> | 15LPA - 40LPA<p>Clarisights is an data ingestion and analytics platform that enables marketers to make sense of and gain unique insights from data coming in from all the sources (analytics, ads data, CRM, Payroll, etc). Our platform is a seamless in browser experience - the users just add the data sources they want to track, our backend then pulls in data from those resources and stores it into our own database. The user then proceeds to the visualisation page to create the required data visualisations.<p>We have found product market fit and have recently closed a $2M round from top European VC&#x27;s. Currently a team of 20 people looking to scale.<p>We deal with a lot of data and need real-time responses - you will have an opportunity to work on some really hard engineering problems. We often run into performance issues in popular open source tools and libraries - we don&#x27;t hesitate to find the bottlenecks and fix them. Team is lead by Ex-Google and Ex-Facebook folks who&#x27;ve got lots of experience building scalable production software.<p>We&#x27;re looking for frontend, backend and data engineers at all levels (Architects, senior, mid-level and interns). <a href=\"https:&#x2F;&#x2F;clarisights.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;clarisights.com&#x2F;careers</a><p>Tech stack :<p>Backend : PostGres, MongoDB, Docker, Kubernetes, Ruby on Rails, GoLang, NodeJS. Microservice architecture hosted on Google cloud platform.<p>Frontend : React, Redux, Styled components, Jest, FlowType, WebPack, etc.<p>------<p>NOTE : Send me a mail at deepak.karki@clarisights.com if you apply. Have &quot;HN whoishiring&quot; in the subject. I&#x27;ll have a personal look at your application!","time":1549088751,"type":"comment"}