{"by":"tabbott","id":19060483,"kids":[19075727],"parent":19055166,"text":"Zulip | <a href=\"https:&#x2F;&#x2F;zulipchat.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;zulipchat.com&#x2F;</a> | REMOTE or in San Francisco | Senior Mobile Engineer | Full-time | SF<p>Zulip is the leading 100% free and open source alternative to Slack. Our users love Zulip because of our unique UX with threaded conversations; compared to Slack or its clones, they find discussions in Zulip more productive.  See our website for details, or read some Hacker News comment threads filled with Zulip love:\n* <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16863675\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16863675</a>\n* <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17622987\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17622987</a>\n* <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=18400988\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=18400988</a><p>We have a handful of people in the USA, amplified by our enormous and amazing open source contributor community.  The entire product is open source; we make money selling hosting on Zulip Cloud as well as commercial support for on-site deployments.<p>This is an open-source job: all our code is open source and free software. We do our development in the open on GitHub and our own public Zulip instance at chat.zulip.org, and dozens of people contribute code every week from all around the world. You can be anywhere in the world too.<p>We&#x27;re primarily looking for an experienced engineer excited about taking our mobile apps to the next level. The ideal candidate has full-stack engineering skills, is experienced at participating in open source communities, has great design sense, gets stuff done, and (if not in SF) has done work remotely before, either professionally or in a major open source project.  But ideal candidates may not exist, and we&#x27;re willing to compromise on some of these things :).<p>We are also always opportunistically hiring for impressive candidates interested in working on other parts of Zulip (UI&#x2F;design, infrastructure&#x2F;scalability, growth, etc.).<p>See <a href=\"https:&#x2F;&#x2F;zulipchat.com&#x2F;team&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;zulipchat.com&#x2F;team&#x2F;</a> and <a href=\"https:&#x2F;&#x2F;zulipchat.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;zulipchat.com&#x2F;jobs&#x2F;</a> for details.","time":1549072335,"type":"comment"}