{"by":"bjelkeman-again","id":19062001,"parent":19055166,"text":"Akvo Foundation | REMOTE | Full stack developer| Full-time employment | prefered location: Eastern Europe, India or Indonesia.  <a href=\"https:&#x2F;&#x2F;akvo.org\" rel=\"nofollow\">https:&#x2F;&#x2F;akvo.org</a><p>Akvo is looking for a full stack developer to help us become the best data solutions provider for international development organisations.<p>Akvo is a global spread organization. Our aim to have significant impact to governance and sustainable development through our software and our services and believe in our Theory of Change. Our software, content and data is shared openly. Akvo works with 20 governments, 200+ NGOs and companies, as well as UNICEF, UNDP, World Bank and more.<p>Akvo is committed to a DevOps culture in which building, testing and releasing software can happen rapidly, frequently and reliably. We work in an agile way, with the goal of constantly improving how we deliver working software. We are user centric and put great effort into understanding problems before deciding on solutions.<p>Akvo Really Simple Reporting (RSR) is a web-based system that makes it easy for development aid teams to bring complex networks of projects online and instantly share progress with everyone involved. The system is designed to be used anywhere, on any device running a web browser. The Android app – RSR UP - allows you to post real-time updates on your projects, from the field.<p>You will be part of the Akvo RSR team and your main responsibilities will be in developing and improving the front end of the product, with support from our design team, and the backend, with support from our platforms team.<p>If you have any questions or want to apply, contact Anthony Gonzalez  at work@akvo.org. Read the full description here: <a href=\"https:&#x2F;&#x2F;akvo.org&#x2F;about-us&#x2F;working-at-akvo&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;akvo.org&#x2F;about-us&#x2F;working-at-akvo&#x2F;</a>","time":1549098411,"type":"comment"}