{"by":"karim","id":19079627,"parent":19055166,"text":"The Nylas Cloud APIs makes it an order of magnitude easier for companies to add email, calendar, and contacts integrations to their applications. By being at the core of business communication, scheduling, and contacts, we believe we can shape the future of how people work.<p>Our team is roughly equal by identified gender (including engineering) and focuses on creating an inclusive environment for all people. We welcome people from all different backgrounds and currently employ startup founders, college graduates from all over the country and the world, coding academy graduates, and even a professional dancer from the San Francisco Ballet.<p>We are actively and regularly working with the entire team to shape our culture in a conscious way to our ideal of empowerment, transparency, and kindness.<p>We&#x27;re looking for an experienced engineering manager to manage our San Francisco based engineering team. This person will manage a team of engineers split across multiple domains including but not limited to Product, Platform, and Customers.<p>In this role, you will manage a team of 7-9 engineers. The Engineering manager will report directly to the VP of Engineering. You will work alongside engineering managers responsible for our New York office and Technical Operations.<p>Responsibilities<p>* Communicate priorities clearly to engineers, and act as a liaison with business org to set clear and realistic expectations, and allow engineers to come up with ways to meet priorities<p>* Should provide support to engineers in terms of making sure they have what they need to be productive and successful.<p>* Hiring, disciplinary actions, and budget planning<p>* Always looking for ways to optimize and improve individual and team processes<p>* Not a project manager role<p>Requirements<p>* Previous experience managing multi-disciplinary engineering teams<p>* Excellent communicator<p>* Agile development experience<p>* Previously worked as an IC in a startup environment<p>* Experience debugging production systems<p>* Experience building high-performance distributed systems<p>Benefits and Perks<p>* <a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;handbook\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;handbook</a><p>To apply, send me an email at karim@nylas.com.","time":1549307693,"type":"comment"}