{"by":"binwiederhier","id":19071727,"parent":19055166,"text":"Datto | Sr. Software Engineer | Boston, MA &#x2F; Norwalk, CT &#x2F; Rochester, NY | ONSITE<p>Datto provides data protection, business continuity, networking, business management, and file backup and sync products.<p>Description: The Core Products Team maintains and develops new features for all of Datto’s backup appliances (SIRIS, Alto). In a nutshell, the backup appliance is a physical (or virtual) appliance that takes block-level backups of Windows, Mac, and Linux machines turn them into raw disk images and stores them on a local ZFS-based disk array. In the case of a disaster, our customers can then restore these backups&#x2F;disk image instantly as KVM-based virtual machines, iSCSI targets, Samba shares, and many other formats. We also offer a virtual VMware&#x2F;Hyper-V-based appliance and integrate with their hypervisors. We write code in modern Symfony-based PHP (with some Python and C sprinkled in), but we strongly rely on our Ubuntu-based Linux stack. Our appliance has a web UI (much like a router), but the main magic happens in the backend services and processes. We do amazing and exciting things every day, such as detecting when a VM has booted successfully, injecting drivers into the Windows registry before boot, or generating vmdk files on the fly. [More about the job on the website (see below)].<p>Responsibilities: You’ll work in one of our three Scrum teams, developing our SIRIS and Alto product. Each team consists of about five engineers. Work hours are usually around 9-5, though we&#x27;re pretty flexible with that. Working from home is also possible, although not encouraged.<p>Qualifications: We&#x27;re looking for a senior engineer with deep Linux know how -- ideally with knowledge in virtualization (VMware ESX, Hyper-V, libvirt, KVM&#x2F;QEMU), software defined networking and file systems (such as ZFS and Ceph).<p>Details see <a href=\"https:&#x2F;&#x2F;www.datto.com&#x2F;careers&#x2F;job-board&#x2F;post&#x2F;1524107\" rel=\"nofollow\">https:&#x2F;&#x2F;www.datto.com&#x2F;careers&#x2F;job-board&#x2F;post&#x2F;1524107</a><p>Email me (Phil) directly at phil @ datto . com or apply on the website.","time":1549222989,"type":"comment"}