{"by":"HannaTalend","id":19074797,"parent":19055166,"text":"1) Senior Security Architect| Talend | Onsite | Paris, France or Nantes, France or Bonn, Germany | <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=okyW7fwF&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=okyW7fwF&amp;s=HackerNews</a><p>We are looking for a skilled Senior Security Architect to join our Architect team based. Part of the R&amp;D Department, you will work closely with the Development team and the Cloud Operations team on all aspects of Software Development and SaaS Operations related security.<p>What we need from you:<p>* Detailed technical knowledge of techniques, standards and state-of-the-art capabilities for authentication and authorization, applied cryptography, security vulnerabilities, and remediation;<p>* Experience in Security Architecture;<p>* Adequate knowledge of web related technologies (Web applications, Web Services, Service Oriented Architectures) and of network&#x2F;web related protocols;<p>* Experience in Cloud &#x2F; Network security, ideally also practical experience in this area with AWS;<p>* Awareness of privacy and confidentiality legislation;<p>2) Data Security Engineer| Talend | Onsite | Paris, France or Nantes, France or Bonn, Germany | <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=oNf36fwV&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=oNf36fwV&amp;s=HackerNews</a><p>Talend is looking for a Data Security Engineer to join our growing Architecture team. In this role, you’ll be responsible for the security of our Talend Cloud service and will work with the SRE team to develop critical frameworks that control access to production systems, encrypt sensitive data and create audit trails.<p>What we need from you:\n* Experience in Security Engineering;<p>* Experience in Cloud &#x2F; Network security, ideally also practical experience in this area with AWS;<p>* Experience in Python<p>3) Backend Developer Cloud Platform Services| Talend | Onsite | Nantes, France | <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=oJd28fwQ&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=oJd28fwQ&amp;s=HackerNews</a><p>To support our growth, we are recruiting a Backend Developer for our Cloud Platform Services team in Nantes.\nAs a Backend Developer, you will be responsible for designing, implementing, testing, and deploying a data processing infrastructure that is fault tolerant and scalable to support multiple Talend Products<p>What we need from you:<p>* Professional experience in Java Programming with RESTful, Message-&#x2F;Event-Driven technologies, Multi-threaded applications<p>* Understanding of distributed and cloud computing, incl. deployment related experience (incl. Docker, AWS)<p>* Experience working in Agile&#x2F;Iterative&#x2F;Scrum development experience<p>What we offer you:<p>* Join a passionate team and work with the latest technologies (AWS, CloudFormation, K8s, Terraform, GCP to name a few)<p>* A challenging but rewarding environment with international scope<p>* Top modern offices with ideal locations<p>* Regular team events and company celebrations, as well as free drinks and fruits<p>For more information please send an email to hwuelfing@talend.com.<p>Best regards, Hanna","time":1549269371,"type":"comment"}