{"by":"alexieshaw01","id":19104978,"parent":19055166,"text":"Full Stack Developer wanted\nReference: HN-FSD-02&#x2F;19 \nLocation: Cambridge, UK \nStart Date: Immediate preferred \nSalary: Competitive compensation package including share options, subject to experience \nClosing Date: 01st April 2019<p>At Healx, we&#x27;re finding treatments for the 350 million people that are affected by rare diseases. We work with pharma companies, patient groups and charities to understand clinical unmet need and identify potential treatments for further testing. Healx is a fast-growing Cambridge UK startup, combining computational methods and deep pharmacology expertise to identify existing drugs that may treat rare diseases, enabling treatments to be found at a fraction of the time and cost of traditional drug discovery. \nWe&#x27;re looking for a full stack developer to help develop our internal tools and infrastructure to enable integration and analysis of scientific data. You’ll work closely with people from other disciplines across the company who are passionate about making a difference for rare disease patients, allowing you to see the impact of what you build first-hand. \nYou’ll be joining a team of software developers using practices such as test-driven development, continuous integration, and frequent releases. You should be comfortable with development at all levels of the stack, including the database, backend and frontend. The technology we use includes Python, SQLAlchemy, PostgreSQL, React and TypeScript. \nSome examples of our projects are: \nDeveloping tools to help our pharmacologists assess and find supporting evidence for treatments predicted by our computational methods \nImporting and reconciling drug and disease data from a number of external sources for use in our computational workflows \nWorking with biological data curators on tools to capture information and build an understanding of the rare diseases we work on<p>Our ideal candidate would have: \nExperience in building a web-based UI with a modern JavaScript framework, such as React \nExperience in building and maintaining the backend of a web service \nExperience working with relational databases \nAn interest in working with scientific data<p>Apply at the following Link quoting reference: HN-FSD-02&#x2F;19 \n<a href=\"https:&#x2F;&#x2F;healx-io.breathehr.com&#x2F;v&#x2F;ySsFgINb3gSoW7O9s4lECw\" rel=\"nofollow\">https:&#x2F;&#x2F;healx-io.breathehr.com&#x2F;v&#x2F;ySsFgINb3gSoW7O9s4lECw</a>","time":1549545355,"type":"comment"}