{"by":"akshipley88","id":19101765,"parent":19055166,"text":"INTERCOM | Dublin (Ireland), London (UK) and San Francisco (USA) Full Time | ONSITE | SaaS | <a href=\"https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;</a><p>- PRINCIPAL SOFTWARE ENGINEER (SF) <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;f44555431\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;f44555431</a><p>Intercom builds a suite of messaging-first products and we ship fast. We are looking for Principal Engineers in our San Francisco and London offices, to lead groups of high-performing teams that fuel our growth. Our teams in San Francisco build and maintain our Messenger (our flagship product) our go-to-market expertise, and our on-boarding experiences, ensuring new customers are set up for success when they start using Intercom. Principal engineers are our strongest technical leaders, and work on our hardest problems. They work as force multipliers for teams of engineers and provide engineering org wide leadership<p>- SENIOR FRONT END DEVELOPER (SF) <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;c726dde51\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;c726dde51</a>\nDo you cringe when a CSS animation is janky? … open up an inspector to see how a site has implemented a particular effect? … check your work in browsers besides Chrome? ... enjoy crafting pixel perfect performant webpages? If so, you’re in the right place.<p>We’re looking for a developer to join our team, and lead the charge to build amazing landing and marketing pages that tell the world about our products, features, people, and more. You will collaborate on a team of designers, developers, marketers, and more to transform ideas into unique, human experiences for current and future customers of Intercom. Our team creates award-winning sites that are shared widely and often featured on sites like Product Hunt and Hacker News. Check out our Brand Studio here.<p>- SENIOR SYSTEMS ENGINEER (DEVOPS) (DUB)  <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;8bfba8f41\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;8bfba8f41</a>\nWe&#x27;re also hiring engineers in Dublin and London to work on our product and build message delivery rules and composer, our app framework or our database models and user storage, to name a few. Our devops and security teams are busy ensuring scalability and security of our infrastructure.\nABOUT US: We&#x27;re a $1.3+ billion company, nearly 600 people and over 25k+ customers including Microsoft, Spotify, Stripe, Airbnb, Hootsuite, Yahoo, and over 500M monthly conversations sent on our platform reaching over a billion people worldwide.<p>TECH: Ruby on Rails application with an Ember.js frontend. We use MySQL, MongoDB and Amazon’s DynamoDB for most of our storage. Our web messenger is built on React.\nQuestions? Want a chat? Get in touch at ewa@intercom.com or check out our blog: <a href=\"https:&#x2F;&#x2F;www.intercom.com&#x2F;blog&#x2F;category&#x2F;engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.com&#x2F;blog&#x2F;category&#x2F;engineering&#x2F;</a>","time":1549499272,"type":"comment"}