{"by":"kiscica","id":2059209,"kids":[2059444],"parent":2057704,"text":"1010data is hiring in NYC.  Standard black-and-white descriptions of the current job openings are at <a href=\"http://www.1010data.com/company/careers/current-job-openings\" rel=\"nofollow\">http://www.1010data.com/company/careers/current-job-openings</a> (warning: links on that page are to PDFs) and you can find out what we do at <a href=\"http://www.1010data.com/company\" rel=\"nofollow\">http://www.1010data.com/company</a>, but here's a little extra color especially for HN:<p>(1) We are looking for someone (v. 'Infrastructure Engineer') who'd be excited to take on the challenge of helping to run, and ultimately running, a rapidly expanding cluster of hundreds of high-performance servers at several datacenters.  The environment is pretty unconventional (99.4% proprietary software, for example, and we prefer to use an \"exotic\" language - K - even for infrastructure purposes); I'd say it's much more comparable to academic/scientific clusters than to your typical web application company.  So that kind of background wouldn't hurt!  At the same time, though, you need to know Windows, 'cause we don't use Linux yet, and you need to know Linux, 'cause we will sooner or later, and you need to be really au courant on the standard datacenter stuff (networking, firewalls, security, backup and replication, racking hardware, receiving -- and making  -- urgent phonecalls at inconvenient times, etc.).  As you can imagine, this is a bit of a hard job to fill... you need to be highly experienced (because we need your experience to support the serious growth we're in the middle of) and yet have an extremely flexible mindset (since we do things in such an atypical way).  But if you're the right person to fill it, the rewards will be substantial.  Be <i>the</i> guy in charge of hundreds of some of the hardest-working servers out there: 1010data is the fastest analytical database on the planet, and our customers are pounding the cluster 24/7...<p>(2) We are also looking for a 'Web Application Developer'.  But again, the dry job posting belies the fact we need something a bit unconventional.  What we really mean by this is a <i>hacker</i> who just happens to <i>really love hacking in JavaScript</i>.  This is, I sense, a rare combination.  But it <i>does</i> exist (we have verified examples at 1010data).  We are developing cutting-edge browser-based interfaces to aforementioned fastest analytical database on the planet and since JS is the Language of the Browser... well, that's probably why you, JavaScript Hacker, chose JS.  Right?  Oh, you say it's because it's kind of an awesome language in its own right?  OK, well, whatever the reason: if you hack JS and want to develop cutting-edge browser-based interfaces for manipulating and visualizing large datasets... please, please apply for this job.  You're going to love it at 1010data.<p>(3) We are looking for a 'Systems Developer'.  We're not 100% sure how to define this, to be honest, but to paraphrase Justice Stewart, we'll know you when we see you.  You need to know a lot about Windows internals, but ideally also Unix/Linux, since one of the major projects you'll be involved in will be a gradual environment shift.  You'll be diagnosing performance issues.  You'll be trying to wring more speed from our already very efficient cluster.  You'll be writing code (bonus! in an exotic language!) to move data around, to do logging and performance reporting, and who knows what else.  You're going to be the guy we all go to when it comes to the low-level arcana, so you're very familiar with the Way Things Work.  You know who you are.  Let us know too.<p>If you think any of the above is you... then write to jobs@1010data.com and mention that you saw Adam's post at HN.<p>1010data, by the way, is a fantastic place to work.  We've got a whole floor in a grand old midtown building populated with a small but growing bunch of very dedicated, very smart, very happy people.  We're growing fast, so there's a lot of energy, and you'll be working hard, but what you do will <i>matter</i>.  No one is doing superfluous work at 1010.  Your stuff will be <i>used</i>.  You get all the startup excitement, but without the startup risk - 1010's a well-established company; we've been around since before the turn of the century.  Which, these days, is almost as long as it sounds!","time":1293935604,"type":"comment"}