{"by":"cal5k","id":2102632,"parent":2057704,"text":"Toronto<p>WEB/MOBILE DEVELOPER (we have no titles, actually, but this is the best description we could figure)<p>About us: Small company, about 15 folks, with offices in Chicago, Toronto, and Hyderabad (India). We specialize in disruptive technologies and business models, and we bring that knowledge to companies and organizations that are established and need to adapt or perish. We grew 300% last year, expecting the same this year, and this is a really exciting time to be with the company. You can feel electricity in the air around our offices.<p>We work with a variety of systems - we build pretty advanced platforms on Drupal (we're one of the only Enterprise Drupal partners in Canada), we build things from scratch with PHP/CodeIgnter, we build apps with Objective-C, etc. If you want to learn how to build wicked stuff and want to start a company somewhere down the line, this is a great place to work. Hell, you're even encouraged to work on a potential startup in your 15% time.<p>About you: Background in computer/software engineering or computer science is preferred, but we're open if you can demonstrate you know your stuff and have a nonconventional degree. We're looking for 1-2yrs experience (if you're fresh out of school get in touch anyway). Double points if you have startup experience.<p>We mostly work in PHP, but diverse language experience is a plus. It's more important that you're smart and driven than that you're a PHP expert. If you've played around with iOS development, HTML5, Python, Android dev, Facebook app dev, etc., those are all positives.<p>About the position: You'll be tasked with building important systems for interesting clients, with plenty of technical challenges and opportunities to learn as you go. You'll work in a Scrum team, primarily in PHP to start - you'll also likely learn how to build complex systems in Drupal.<p>If you're a startup guy/gal, you'll learn a lot just by being in our environment. You'll collide with amazingly smart developers, designers, analysts, and business folk - all of whom are constantly formulating new business models and thinking radical thoughts about the future. Bonus points if you like to endlessly philosophize.<p>Perks: Benefits (drug, dental, massage, etc.), 15% time (take a half day a week to build awesome stuff), relocation (if you're not located in the GTA), technical books (if you want 'em, you can have 'em), conferences, training.<p>Pay: We have a saying that goes like this: \"Hire 5 people who can do the work of 10 and get the pay of 8\". We want smart, driven developers, and we pay what it takes to get them.<p>How to apply: Email dustin (at) myplanetdigital (dot) com","time":1294981669,"type":"comment"}