{"by":"eugmandel","id":4727979,"kids":[4728952],"parent":4727241,"text":"Burlingame Marketing Automation Startup Qualaroo is Hiring a Full Stack Web Developer<p>About Us<p>Qualaroo (formerly KISSinsights) is an embeddable survey and messaging tool for websites and apps that lets marketers and product managers get targeted feedback from their users, and personalize prompts and forms based on the specific user's feedback.<p>Our office is in the building of Burlingame Caltrain station (\"The Station\"). We have a collaboration room and a quiet room. It’s simple. We respect you too much to describe the chairs or the equipment.<p>Our CEO/founder is a marketer (see his blog: startup-marketing.com). He is the kind of marketer engineers like. If you are interested in marketing, you will learn a lot here. Writing code that is used by no one sucks. Things need to be marketed. Things need to be sold.<p>Yes, of course the salary is competitive. Yes, of course you will get equity (we are a startup, after all). Yes, we have health and dental plans.<p>Our current infrastructure includes Ruby, Rails and MySQL. Our Javascript is both homegrown and based on jQuery and Backbone.js frameworks.<p>Our data set is growing. New technologies will be needed to support it. You will find and research them with us. It's a fun time.<p>About You<p>You are a startup-minded developer. You prefer a startup (somewhat chaotic) environment where you are given freedom and responsibility, as opposed to one where requirements are always clear, priorities don't change and processes are set.<p>You are a generalist. In a small team it does not make sense to focus on one small area to the exclusion of everything else.<p>You probably have a CS degree. If you don't, you have a pretty interesting story to tell.<p>You are pretty senior. You can work without supervision. Number of years of experience does not matter.<p>You do full stack web development. If you lean more towards back-end or front-end, it's fine, but you are still willing to tackle issues in all areas when needed.<p>You probably don't call yourself a \"Ruby Developer\". You are simply a developer. Ruby is just a tool. If you need to learn a new one - pick up a book. We'll pay for it.<p>You feel comfortable with databases. You know how to write code that does not kill them. In general, you always think about performance and how things will work under stress.<p>If you find yourself doing a task more than a couple of times, you want to automate it.<p>You enjoy teaching yourself whatever you need to get the job done. You are curious about new tools and technologies, but getting things done is always your first priority.<p>You like talking to customers and help them with their problems. Support is not a chore - it's how we learn.<p>You shepherd your features all the way into production. Until they have automated tests, are deployed, are monitored and integrated with analytics to see how they are affecting the business, they are not \"done done\".<p>You like Facebook’s \"Done is better than perfect\" and \"Move fast and break things\" posters, but don't take them to the absurd. When you see a piece of code, you can tell the difference between \"done\" and \"perfect\".<p>You can (and like to) describe your solution, make your point and defend it.<p>You voice your opinion when you disagree with something and don't care for passive aggressive behavior. We do argue here. Sometimes it might look not pretty from the outside, but it's because we really like and respect each other.<p>SOUNDS INTERESTING? \nPlease apply here: <a href=\"https://qualaroo.com/join-us/full-stack-web-developer\" rel=\"nofollow\">https://qualaroo.com/join-us/full-stack-web-developer</a>","time":1351783563,"type":"comment"}