{"by":"lelandr","id":4727700,"parent":4727241,"text":"Houston, TX - funded, Tech-focused startup looking for good talent.  Full time and INTERN positions available.<p>Work Environment:\nWork environment is fun and casual. We are a small startup with adequate funding to do the market some damage.  We are looking to build up a team of great developers to make great products, focusing on doing software right.  All developers will be provided with whatever equipment necessary to get the job done as efficiently as possible.  With a small team you will be able to take on very big projects and tasks that you can be proud of. Employees' meals are paid for, and a gym membership is included for all employees as a perk.<p>Looking for an ambitious, eager, gifted developer with extensive experience and knowledge regarding modern web development, including client-side technologies (ie, Javascript).  We are working on a very large web application that should be a lot of fun to build - and something that as a developer, you yourself would use.<p>Compensation:\nAs always, dependent upon experience - however our salary rates are very competitive relative to the market.<p>Required Skills:\n- C#\n- ASP.NET\n- Familiar with .NET Framework\n- ASP.NET MVC Framework\n- Razor View Engine Syntax\n- AJAX methodology\n- SQL (we will be using MS SQL)\n- Javascript\n- JQuery\n- CSS\n- HTML4+\n- DOM Manipulation\n- Object Oriented Design (polymorphism, inheritence, OOP design patterns, etc.)\n- HTTP<p>Helpful but NOT required Skills:\n- C# 4.0 / 3.5 (dynamic objects &#38; DLR, anonymous methods (lambda syntax), etc)\n- Lucene (or Lucene.Net)\n- Database Design (Index design, \n- Knockout.js\n- JQuery UI\n- LESS/SASS (pre-compiled CSS)\n- Multithreaded / thread-safe programming\n- IIS\n- Distributed Hashtables (ie, NoSQL implementations)\n- ORM Design\n- Security, Cryptography, etc.\n- Meta programming\n- HTML5 specifications\n- Local Storage (browser storage)\n- Third Party API Integration (ie, Facebook API, LinkedIn API, Twitter API, etc.)\n- Graphics Design (Photoshop, Indesign)\n- WCF Web Services\n- SQL Server<p>Feel free to contact me at leland@tech.pro with inquiries.<p>Note: in addition to developers, we are also highly interested in any talented designers as well.","time":1351780451,"type":"comment"}