{"by":"gadventures","dead":true,"id":4728558,"parent":4727241,"text":"Toronto: System Integration Engineer<p>Our team is excited to work at G Adventures because we love tech and we love travel. We are primary drivers of the technical decisions in an industry that is traditionally non-technical. We enjoy working in an open source environment with the ability to choose the right tools for the job. The complexities of the product (adventure trips) are beyond typical online goods and there are many challenges for any interested programmer, with plenty of room for innovation to disrupt the industry standard.<p>This opening specifically pertains to our internal ERP systems and the transportation of data between them using ETL practices, with the ultimate goal of increasing efficiency across departments and facilitating the reporting of sales and financial data that is invaluable to the business.<p>Our team is enthusiastic and involved in the Toronto tech scene, attending conferences such as DemoCamp, AndroidTO, EcommerceCamp, PyCon, and DjangoCon. Beyond the tech world, there are great travel perks and a vibrant entrepreneurial culture. G Adventures remains wholly owned by its founder, Bruce Poon Tip, which fosters an environment akin to a nimble start-up, with the perks of an established company, but without the long hours.<p>OUR ENVIRONMENT:<p>* You will be working with a PC, but most of the organization uses Macs<p>* Tools are your choice, but we have some recommendations (we love open source!)<p>* Everyone on our development team has an entrepreneurial spirit that we look for in new hires. You should be passionate about technology and trying new ideas<p>RESPONSIBILITIES:<p>* Actively assist in the development and testing of integration processes between multiple systems using Pervasive Data Integrator<p>* Maintain existing code and implement patches and new functionality as needed<p>* Apply best practices to ensure data integrity across systems<p>* Perform low to moderate level database administration (PostgreSQL 9.1, MS SQL Server 2008)<p>* Work with internal departments to identify business requirements<p>* Collaborate with other developers to aid in decision making processes and foster improvements<p>* Research new or existing technologies that would benefit system users<p>REQUIREMENTS:<p>* Bachelor's Degree in MIS, IT, Computer Science or related field. Equivalent technical experience may be substituted for educational requirement<p>* 1+ years experience in data integration and ETL<p>* 2+ years experience with relational databases and strong SQL knowledge<p>* Preferred experience with the following technologies and systems:<p>     <i></i> Pervasive Data Integrator<p>     <i></i> MS Dynamics GP<p>     <i></i> Web Services<p>     <i></i> XML<p>     <i></i> Java<p>     <i></i> VB scripting<p>     <i></i> Python<p>* Familiarity with modern source control systems like SVN or git<p>* Knowledge of financial accounting a plus (Ledgers, Accounts Receivable, Accounts Payable, etc.)<p>* Ability to learn quickly and think abstractly<p>* Continually seeks opportunities to increase product quality and customer satisfaction with a demonstrated fanatical attention to detail<p>Become a key player at one of the world’s top tour operators. Launch exciting initiatives in a global company with significant growth opportunities. A competitive salary, health benefits including major medical insurance, dental, life insurance, vacation time and unique travel opportunities are offered.<p>If you have what it takes and want to join an innovative company with the most creative travel product on Earth then apply now!<p>To apply you must hold appropriate citizenship or documents permitting you to reside and work in the Canada<p><i></i><i>We thank all interested candidates however only those chosen for an interview will be contacted.</i><p>Apply for this position here: <a href=\"https://gadventures.wufoo.com/forms/employment-application/\" rel=\"nofollow\">https://gadventures.wufoo.com/forms/employment-application/</a>","time":1351789894,"type":"comment"}