{"by":"sbisker","id":4728937,"parent":4727241,"text":"San Francisco, CA - Designers Wanted at Locu (<a href=\"http://locu.com\" rel=\"nofollow\">http://locu.com</a>)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We have recently launched Locu &#60;<a href=\"http://locu.com&#62;\" rel=\"nofollow\">http://locu.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>We're creating powerful design tools that let local merchants better connect with their consumers. We're looking for world-class visual designers and user experience designers who are excited to redefine what a menu looks and feels like across web and print, and create tools that put modern web technology in the hands of merchants.<p>Guidelines (requirements is such a strong word):<p><pre><code>  Exceptional visual and/or interaction design talent - please include\n  a link to portfolio.\n  (Intern candidates may link to individual samples of their work\n  instead of a portfolio.)\n  \n  Experience with Adobe Creative Suite, or the ability to learn\n  quickly (Omnigraffle or Fireworks a plus)\n  \n  Expertise in HTML / CSS and Javascript/jQuery, or the ability to learn quickly\n  \n  Excellent written and verbal skills - not afraid to debate and\n  discuss design decisions\n  \n  Experience with any of the following a plus: wire-framing,\n  prototyping, analytics, user research, asset creation, product\n  management, branding.\n</code></pre>\nSpecial note for Generalist Designers and Desingineers<p><pre><code>  We know you like to strike your own unique balance. So don't sweat the reqs and just \n  show us what you've got.\n  We want you to be able to do what you love, the way you're best able to do it. :)\n  \n</code></pre>\nInterested? Drop us a line at jobs@locu.com. Please specify \"Designer - HN\", in the subject of your letter. Learn more about us at <a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http://locu.com/about/jobs/</a><p>PS: Like most startups, we're always on the lookout for exceptional talent of all sorts. So if you feel you're a particularly strong fit for what we do or how we do it, check out our other descriptions at <a href=\"http://locu.com/jobs/\" rel=\"nofollow\">http://locu.com/jobs/</a>.<p>-------------------------------------<p><i></i><i>Founded a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 19 people with very diverse backgrounds, and growing.</i><i></i>","time":1351794485,"type":"comment"}