{"by":"kevinpfab","id":4728310,"parent":4727241,"text":"Emergent One - Remote (US) - Full Time<p>Emergent One automatically generates REST APIs for existing applications and databases. We're a new startup devoted to making APIs better and more prevalent. Although we're a small team, we are growing fast and moving even faster.<p>We are looking for a Software Engineer that is passionate about developer communities, REST, and of course, building and consuming APIs. The role will be a combination of development on our developer portal solution and our core tech behind generating APIs. You’ll be helping build the API that generates APIs. In fact, that API generated our own private API (so meta!). You'll have a huge impact on the company and customers as a very early member of the organization, and be introduced to a large range of cutting edge API providers.<p><a href=\"http://www.emergentone.com/jobs/\" rel=\"nofollow\">http://www.emergentone.com/jobs/</a><p>===Responsibilities<p>* Lead development on a robust developer portal solution for APIs we provide<p>* Contribute to the core solution that generates APIs<p>* Gain a deep understanding of the Emergent One platform<p>* Help troubleshoot problems in our customer's API design<p>* Work closely with customers to design solid RESTful APIs<p>* Build up a resistance to mildly brain melting meta-ness<p>===Qualifications<p>* 3+ years experience as a Software Engineer / Developer<p>* Experience developing applications built on APIs<p>* Deep awareness of RESTful API design and HTTP standards<p>* Strong knowledge of object-oriented design and design patterns<p>* Experience on a remote team a plus<p>===About Emergent One<p>* Ruby on Rack core, js / backbone frontend<p>* Funded Seed Round, TechStars Cloud Alumni<p>* Remote organization - work wherever you want!<p>* Choose your own hours - we're results driven first!<p>* Regular (friendly) debates and gaming sessions<p>* Founded by 2 ex-Rackspace developers<p>Email us at jobs@emergentone.com","time":1351787154,"type":"comment"}