{"by":"kms123","id":4728822,"parent":4727241,"text":"Cambridge, MA / Full time Engineers at Crashlytics (<a href=\"http://www.crashlytics.com\" rel=\"nofollow\">http://www.crashlytics.com</a>)<p>Frontend, Backend, iOS and Android. Mobile apps crash over 1 billion times a day - let's do something about it!<p>Crashlytics is mobile crash reporting and analysis as a service. If you're interested in the intersection of great UX, scalable systems, the mobile internet, and big data analytics we want to talk to you!  We're an early stage startup looking for truly talented engineers with a passion for clean code and great products. Our team is fast, smart and independent -- with previous startup success.  We are looking for seasoned developers and we don’t care what type of environment you are working in (Java vs. PHP vs. Ruby).  We believe in the fundamentals -- so you don’t have to be an expert at everything, we just want you to be excited about taking your production experience and jumping into an emerging tech stack.<p>We're small and growing rapidly, so it's important to us to have a great company culture to support that growth. We offer all of the usual startup perks: snacks in the kitchen, flexible work schedule, top-of-the-line gear (Macbook Air, Thunderbolt display, iPad/Android Tablet), etc. Additionally, we feel strongly that it's the culture created by shared values that really makes Crashlytics a great place to work.<p>Here's a brief look at a few of the things we value:<p>* We focus on the modern web - We don't support IE6, so you'll never have to worry about it! \n* We love feedback - you’ll be able to connect directly with customers who are using what you’re building and use their input to make the product better. \n* We’re self-directed - We trust you to manage your own schedule, vacation, etc. without complex policies or forms to fill out. \n* We ship - we're huge fans of TDD, build/measure/learn, and are moving towards continuous deployment. \n* We give back - We encourage open source contributions and community participation.\n* We’re hyper technical - Deep understanding and optimization are in our soul - what can your code accomplish in 18ms?<p>Interested, send your info to jobs@crashlytics.com!","time":1351792972,"type":"comment"}