{"by":"dogas","id":4729034,"parent":4727241,"text":"Philadelphia, PA, NY or DC - Sr. Technical Engineer at PipelineDeals<p>About PipelineDeals<p>Our team has been developing, delivering, and zealously supporting the PipelineDeals CRM solution for over six years.<p>We’re passionate about creating software that people want to use and share. We love what we do, and we want our customers to love us for helping them close more deals and rule the world.<p>We are looking to hire a Sr. Technical Engineer for our flagship product and future products. We’re interested in people who like to make a difference and will thrive in our culture, which revolves around our customers.<p>You will help create an overall user experience where every pixel counts, user feedback is instantaneous, performance is blazing fast, scaling is automated and downtime a very rare event.<p>What we are looking for:<p>- Software engineering chops - you value how code is written and enjoy teaching design patterns and coding techniques to others.<p>- Significant experience designing, developing and delivering web applications/services.<p>- Demonstrated success working with cloud-based infrastructure services.<p>- Ability to manage technical operations / devops.<p>- Experience utilizing agile methodologies.<p>- Strong application framework experience as well as extensive experience with a SQL backend.<p>- Fluent in Ruby/Ruby on Rails, and experience with Rails upgrade paths.<p>- Fluent in javascript based frameworks such as backbone.js and / or ember.js.<p>- Great communicator at all levels of the organization.<p>- Strategic thinker and detail oriented.<p>Responsibilities<p>* Design, develop and architect technical solutions to support product enhancements and new products.<p>* Own the development methodology and delivery of our product.<p>* Drive error free deployments.<p>* Perform rapid bug-fixing.<p>* Obsess about page load times and application snappiness and speed.<p>* Manage and maintain our infrastructure and technical operations.<p>* Manage and test regular backup and disaster recovery processes and procedures.<p>* Coordinate and perform regular security testing.<p>* Perform capacity planning and manage our infrastructure costs.<p>* Set technical direction and software architecture with input/planning from engineering team.<p>* Perform root cause analysis.<p>Location<p>* Ideally, you will be based in the Philadelphia or the surrounding areas.<p>* We will also consider candidates New York, or Washington D.C.<p>* Remote work situation also possible but not preferred.<p>Interested?  Please contact nick@pipelinedealsco.com.","time":1351795550,"type":"comment"}