{"by":"salsf","id":4729159,"parent":4727241,"text":"San Francisco, CA │ ePantry │ Founding Engineer<p>We launched in August and were seeded behind a vision of making it easier for busy people to make responsible choices.  Highlights below:<p>*  Customer Problem: We want to buy (and not run out of) sustainable products, but busy people take the path of least resistance on their household consumables<p>*  Customer Value Proposition: 5 min registration = A) never run out of TP, B) never overpay, C) always get products good for people &#38; the earth<p>*  Customer Archetype: ~35 y/o female, kids, busy; “green,” but SUV; Whole Foods, but 365 (private label); iPhone, but not techy; Gilt often, but Gucci rarely<p>*  What We Do: “Dollar Shave Club” for name-brand, “green” household consumables ($24+bn TAM), with an emphasis on flexibility and customer service<p>*  Competition: Selling a niche product better than Amazon has a surprising track record.  e.g. Alice, Dollar Shave Club, Manpacks, Quidsi, Zappos<p>*  Our Challenge: Create the most convenient platform in the world for a set of household products with unique purchasing patterns (not a shopping cart site…)<p>*  Full Time Team: Stu (Biz/PM): Advisor &#38; raised &#62;$2m @ 4 start-ups, &#62;$100m invested in tech, employee #2 twice; Jordan (Mktg): Goodby, Doritos, TD Ameritrade<p>*  Seeders : The entrepreneurs behind companies like Hotwire, CitySearch, Friendster, Cater2.me, Everfi, Vincraft, Augusta Columbia, and Toro IP<p>*  Stage: Funded. Compulsively user testing prototypes.  Conversations with suppliers on track.  Alpha customers by November 15<p>*  Founding Engineer: A fully empowered co-founder with strong opinions, understanding of lean &#38; MVP tradeoffs, full stack ownership, and a long term vision<p>*  What You Get: Competitive cash, generous equity, full benefits, flexible/fun environment, passionate team, leave the world better than you found it<p>I would love to grab a coffee/beer and brainstorm about the challenges and opportunities ahead.","time":1351796908,"type":"comment"}