{"by":"kittkat","id":4733472,"parent":4727241,"text":"Boston, MA: Full Stack Developers, Python Developers, Interns<p>Jana's hiring web developers at all levels to expand our engineering team. We’re actively hiring people to help us push the envelope on how the modern web can interact with mobile phones.<p>For more info and to apply check out our website: www.jana.com<p>We are:\nJana is a small Boston-based startup focused on people in the developing world.  We came out of the MIT Media lab. We help large multinational organizations like P&#38;G, Unilever, and the United Nations to connect with consumers in emerging markets like India, Indonesia, Brazil and Nigeria. Jana meets these consumers where they're at, which is often the mobile web on their low-end phone. We work at a global scale: through partnerships with more than 235 mobile operators in more than 100 countries Jana can send airtime rewards to more than 3.48 billion people.<p>We want:\nWe’re hiring software engineers to work on both our back-end and front-end challenges. We are python end-to-end, hosting our servers in Amazon’s cloud. Our challenges tend to be systems-level ones, as we engineer the ability to reliably connect with individuals on the other side of the world.<p>We are looking for people who are passionate about what we are trying to accomplish: making a direct connection to developing world consumers using mobile technology.<p>We offer:\nAlthough we're a small startup (15 people), founded in 2009, we offer benefits like 401k, medical, and dental.<p>We provide a fun, relaxing, productive work environment. Our office on Boylston Street in Boston’s Bay also now has a lounge featuring a flat screen tv and wii for people to unwind. For fun we play ping pong or Settlers of Catan. We have a “magic” kitchen whiteboard where suggestions tend to materialize the next day, be it snacks, beer for the beer fridge, wii game suggestions, kickball league sign up, etc. (although I’m still having trouble getting 2 unicorns and world peace).<p>Apply Directly:\n<i>Full Stack Web Developer <a href=\"http://jobsco.re/Rwi6X6\" rel=\"nofollow\">http://jobsco.re/Rwi6X6</a>\n</i>Head Engineering <a href=\"http://jobsco.re/YeB0UX\" rel=\"nofollow\">http://jobsco.re/YeB0UX</a>\n<i>Python Developer <a href=\"http://jobsco.re/OVBhqL\" rel=\"nofollow\">http://jobsco.re/OVBhqL</a>\n</i>Consumer Web App Developer <a href=\"http://jobsco.re/Tqo4oy\" rel=\"nofollow\">http://jobsco.re/Tqo4oy</a>\n<i>Part Time Coder <a href=\"http://jobsco.re/YeBrP1\" rel=\"nofollow\">http://jobsco.re/YeBrP1</a>\n</i>Web Developer Intern <a href=\"http://jobsco.re/Tqohbj\" rel=\"nofollow\">http://jobsco.re/Tqohbj</a>","time":1351874516,"type":"comment"}