{"by":"WLInternet","id":4734105,"kids":[4734117],"parent":4727241,"text":"Austin: Front-End Developers\nWhite Lion is looking for a full-time front-end developer.<p>We would like you to join us in our vision to be the recognized go-to regional interactive agency for handling complex and challenging web and mobile projects.<p>Does the following accurately describe you?<p>* I want to be part of an organization where my input carries weight and where integrity is a core value.\n* I want to be trained extremely well and then trusted to do my job as I prove myself.\n* I have an extreme passion for the creativity and discipline that goes into front-end development.\n* I like to work on a wide range of diverse and challenging projects.\n* I love the adrenaline rush of complex JavaScript requirements.\n* I can work with jQuery in my sleep.\n* I have a comprehensive knowledge of JavaScript, CSS3 and HTML5.\n* I have hands-on experience working with front-end coding frameworks.\n* I know PHP and I am familiar with MySQL.\n* I am so versed in what is next with front-end development I could teach classes on the subject.\n* I am extremely reliable and dependable.\n* I have an old fashion work ethic.\n* My attention to detail is extreme.\n* I love to continually learn and improve.\n* Web and mobile technologies fascinate me.<p>If ALL of the above matches you perfectly, your primary job responsibilities will be to:<p>* Serve as a front-end developer for new projects.\n* Help maintain and improve existing sites.\n* Collaborate with project managers, UX and graphic designers, back-end developers and other front-end developers.\n* Participate in helping the sales team price out new projects.\n* Help fellow developers debug and trouble shoot challenging issues.<p>We are a dynamic, growing company with a casual, fast-paced workplace.<p>Over the 16 years being in business we attract and retain self-starters by having handcrafted a flexible, world-class work environment.<p>If you have carefully read all of the listed content and feel you have the chops, we want to hear from you!<p>Apply at: <a href=\"http://wlion.com/hires-the-best/front-end\" rel=\"nofollow\">http://wlion.com/hires-the-best/front-end</a>","time":1351881575,"type":"comment"}