{"by":"JunkDNA","id":4762838,"parent":4727241,"text":"Philadelphia, PA<p>The Children's Hospital of Philadelphia\nWe're not technically a start-up, but our small group inside CHOP is striving to be a startup within a larger organization.<p>See my interview at OSCON for why you might want to work for us: <a href=\"http://youtu.be/wzcIOMp6ZKw\" rel=\"nofollow\">http://youtu.be/wzcIOMp6ZKw</a><p>We are hiring for both a Lead Analyst/Programmer and a Sr. Analyst/Programmer<p>-----\nWe are seeking an experienced software development professional to join our small, highly focused, entrepreneurial R&#38;D application development group within the Center for Biomedical Informatics (CBMi) at The Children's Hospital of Philadelphia. As a member of our team, your technical expertise can have an immediate impact on patient care through our mission to accelerate pediatric research with novel applications and data solutions. Furthermore, your work here has the potential to impact the future of healthcare through our research into software solutions supporting genome-enabled personalized medicine. Our research mission fosters an environment where creativity and exploration of new technologies are promoted and encouraged.\nLikely candidates should have solid experience and working knowledge in three or more programming languages (Python, JavaScript, or Scala experience is highly desirable) and be comfortable with one or more relational database platforms.<p>Our dynamic academic research environment demands an individual with exceptional written and oral communication skills who can rapidly translate requirements from a variety of disciplines into intuitive, high quality software solutions that support our strategic vision.<p>Candidates with prior experience in the biomedical field, especially using highly complex genomic data and/or data from electronic health records are very desirable. Participation in one or more public open source projects is an added bonus.<p>Full details and application for Sr. Analyst/Programmer here: <a href=\"http://bit.ly/cbmijob2\" rel=\"nofollow\">http://bit.ly/cbmijob2</a><p>Full details and application for Lead Analyst/Programmer here: <a href=\"http://bit.ly/cbmijob3\" rel=\"nofollow\">http://bit.ly/cbmijob3</a><p>See some of our active code repos on GitHub for an idea of the kind of stuff we do: <a href=\"https://github.com/cbmi\" rel=\"nofollow\">https://github.com/cbmi</a>","time":1352470362,"type":"comment"}