{"by":"pretzel","id":3652057,"parent":3652041,"text":"The internet is important. For the UK economy it is very important: contributing over 10% of GDP. At QuBit we are working to make the internet better. We want to make each company we work with as profitable as possible by processing online data intelligently. And we need your help.<p>We are looking for Front End Developers, Customer Solutions Engineers and a DevOps / Systems Engineer. You'll need a degree in Computer Science or similar discipline from a top university, the flair to do well in a dynamic growth-phase start up and an Open Source state of mind.<p>Front End Developers need to have skills in JavaScript, HTML, CSS and cross browser debugging. Any experience of the Back End or UI / UX design will be a major plus. We use tools like Backbone, Redis and Nodejs on the Front End side, and would love to hear from you if you do too.<p>Customer Solutions Engineers have all the skills of the Front Enders, with the ability to be client facing. You'll be dealing with major players in the eCommerce space and helping to troubleshoot and solve problems on their websites. In depth knowledge of server-side coding and web design would be really beneficial here.<p>Our DevOps / Systems Engineer is going to help us optimize our platform. We're looking for someone with crossover Sys Admin and programming experience. You'll be autoscaling our use of Amazon Web Services and maintaining our networks and systems including a Hadoop cluster.<p>We're looking at graduate, junior, mid-level and senior people for these hires. If your kung fu is the best let us know, we'd love to hear from you. Send a CV to careers@qubitdigital.com and maybe you'll be joining our team in London's Soho and enjoying life at Wired's start up of the week: <a href=\"http://www.wired.co.uk/news/archive/2012-02/28/startup-of-the-week-qubit\" rel=\"nofollow\">http://www.wired.co.uk/news/archive/2012-02/28/startup-of-th...</a>","time":1330610435,"type":"comment"}