{"by":"nikoftime","id":3652864,"parent":3652041,"text":"Join Nulu in redefining the way the world learns languages!(San Diego, CA)<p>JOB DESCRIPTION: We are an innovative and fast-growing startup in San Diego developing technology that will transform how consumers around the world gain fluency in foreign languages. We've garnered significant market traction in the US and are looking to expand internationally in the very near future.<p>We are a small team with big ambitions!  You'll be joining a team that knows how to launch successful products, and working with us to build tools that are going to change the world.  Ideally, you have an exceptionally strong web applications development background, and you are familiar with Python (bonus points if you've worked with Django) or Ruby on Rails.<p>As an early employee, you'll be joining our CTO and developers as an integral part of our engineering team. You'll have a major influence in the products we build, the technologies we adopt, and the culture of our company.<p>Our current software stack includes Ruby, jQuery, HTML5, HAML, RSPEC, MySQL, and git, running on an EC2 Deployment of Ubuntu instances.  If your background doesn't match up perfectly with our stack, but you're excited about what we're doing and learn quickly, we want to talk.<p>If you write awesome code, have a great eye for detail and care deeply about everything from the product architecture to its front-end design, get in touch with us to learn more about how we're changing the world.<p>To apply, send your resume to David Allison: david@nululanguages.com.  If you have a Github account, please send a link as well.<p>JOB REQUIREMENTS:<p>Must have 3+ years of hands on coding experience developing high volume and/or e-Commerce websites using technologies such as: Ruby on Rails or Python with Django, jQuery, HTML5/CSS, HAML, RSPEC, SQL, git/github, EC2 Deployment, etc.\nPersonality Traits: versatile, can adapt to new programming languages quickly, entrepreneurial\nCan write top-notch, cross-browser compatible, and W3C standards compliant code (Don't worry, we're not targeting old versions of IE)\nComfort using source-code version control: experience specifically with Git is a plus\nExperience testing your code with testing frameworks<p>COMPENSATION: Competitive salary (DOE) + meaningful equity","time":1330620681,"type":"comment"}