{"by":"SatvikBeri","id":3652200,"parent":3652041,"text":"Lattice Engines (www.lattice-engines.com) - Manhattan, NY<p><i>Analytics Engineer</i><p>As the Analytics Engineer, you will use SQL and analytics tools to transform business requirements into actionable data &#38; analytics.  You are adept at solving unforeseen problems in a creative manner.  You thrive in a fast-paced and dynamic environment.  You fluently convey complex ideas to colleagues and customers.<p>Responsibilities \nExecute data analysis, ETL, and data mining to support customer deployments\nConfigure enterprise Big Data analytics platform and tools\nWork closely with a customer delivery teams with mixed backgrounds (business &#38; sales, mathematics &#38; predictive analytics, database &#38; data management)\nSolve problems arising from dynamic data and changing customer requirements\nQualifications\nStrong knowledge of SQL (via SQL Server, MySQL, Oracle, etc.)\nBS degree in a technical discipline such as math, physics, computer science, operations research, engineering with relevant intern experience; advanced degree preferred\nExperience delivering business insights from data using pivot tables, advanced excel models, or business intelligence tools\nExperience with analytics tools such as SAS, SPSS, R, or MATLAB\nStrong project and time management, as well as written and communications skills\nAbout Lattice Engines<p>Lattice Engines is revolutionizing B2B sales and marketing by transforming Big Data into big sales for F5000 companies worldwide. Its predictive selling platform, salesPRISM, overcomes the limitations of CRM and arms front-line sales pros with real time, actionable insight to engage the most receptive customers in the most persuasive ways.  More than 100,000 sales pros at companies like ADP, Dell and VMware rely on Lattice Engines every day to achieve peak sales productivity.  Lattice Engines is privately held and backed by Sequoia Capital with headquarters in San Mateo, CA. Learn more at www.lattice-engines.com and follow @Lattice_Engines.<p>To apply, go to <a href=\"http://jobvite.com/m?3IArgfwJ\" rel=\"nofollow\">http://jobvite.com/m?3IArgfwJ</a> or send me an e-mail at sberi@lattice-engines.com with the subject line \"Hacker News\"","time":1330612745,"type":"comment"}