{"by":"jaredrhine","id":3653242,"parent":3652041,"text":"Xtranormal, <a href=\"http://www.xtranormal.com/\" rel=\"nofollow\">http://www.xtranormal.com/</a><p>San Francisco near Montgomery BART<p>Xtranormal allows people everywhere to tell animated stories in full 3D using web, desktop, and mobile tools. We need web/mobile application developers, designers, and operations people to help create our next generation of amazing ways to create and share movies. We're growing, have a great team, and get to do cool thing like Big Lebowski partnerships: <a href=\"http://www.xtranormal.com/big_lebowski\" rel=\"nofollow\">http://www.xtranormal.com/big_lebowski</a><p>To apply for any of these positions or for more information, please email jobs@xtranormal.com and you'll get straight to the hiring manager. Postings are available at <a href=\"http://www.xtranormal.com/jobs/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/</a><p>Positions:<p>* Senior Web Applications Engineer<p><a href=\"http://www.xtranormal.com/jobs/se-frontend/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/se-frontend/</a><p>Build full browser-based applications using heavy JavaScript and the classic HTML/CSS/DOM stack. We have mostly jQuery but are flexible. Our backend is Python+Django+MySQL+celery. You'd have heavy involvement in our web-based movie creation tool, with drag-and-drop, video integration, and all sorts of interesting browser challenges. You'd provide a senior perspective on the evolution of our codebase and help lead refactors, APIs, and new modules.<p>* Operations Manager/Lead Systems Engineer<p><a href=\"http://www.xtranormal.com/jobs/ops-sysadmin/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/ops-sysadmin/</a><p>Hands-on Linux cloud+colo production operations. Own the full stack, with an interesting mix of not-just-Web production systems. EC2, chef, Apache, Python+Django, Nagios, collectd, and lots of other modern tools. Be willing to participate in pager rotation. We enjoy a close collaboration between development and operations. We're always looking to improve our systems and have lots of flexibility to replace pieces that aren't doing well for us any more, as we grow.<p>* iOS Mobile Applications Engineer<p><a href=\"http://www.xtranormal.com/jobs/se-ios/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/se-ios/</a><p>Break open our mobile experience by translating our rich movie-making toolset onto the iOS platform. Should have a portfolio of demoable applications for iPhone and iPad, with a focus on interactive applications.<p>* Web and Graphics Designer<p><a href=\"http://www.xtranormal.com/jobs/ux-designer/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/ux-designer/</a><p>Develop interaction and graphical treatments for a wide variety of Xtranormal products and initiatives.  Integrate web usability, typography, user experience, and project constraints to produce great user experiences in collaboration with our engineering and product teams.<p>For all positions, we have benefits that include:<p>* Comprehensive benefits package\n* Ability to participate in stock option plan\n* SF/BART-able location","time":1330625446,"type":"comment"}