{"by":"joelesler","id":3653930,"parent":3652041,"text":"<a href=\"http://blog.snort.org/2012/02/vulnerability-research-team-is-hiring.html\" rel=\"nofollow\">http://blog.snort.org/2012/02/vulnerability-research-team-is...</a><p>The Vulnerability Research Team is hiring, we want YOU.<p>Have you ever written a Snort rule?  or wanted to?<p>Like messing about in the newest vulnerabilities or malware?  Like writing exploits?  Enjoy challenges like \"Here's a file that crashes -application- , figure out why\"?  Want to work with us to design what is next in Snort?  ClamAV?  Razorback?  Or any of the above topics?<p>We want you.<p>Let me talk about what I like.<p>The smartest people I've ever met all in one room.  We get to bounce ideas off of each other, figure out strange ways of fixing a problem, and come up with a solution.  That means anything from controlling EIP to how to write a rule to compare two things from two different streams using flowbits.<p>We pride ourselves in doing things not only better than the competition, but in the open too.<p>We work hard.  We play hard.  For instance, today, during break, we played kickball (remember that?) with a big yoga ball, and the ball got stuck in a tree.  Yours truly climbed said tree and retrieved the ball.  Then I came back inside and pulled apart some malware.  Beware of nerf darts, RFI readers, and the 6lb sand-filled ball of doom.<p>Like working in an environment where it doesn't matter how you wind up at the result, as long as you get the correct results?  Tired of being told what OS to use?  Like debating the merits of C, perl, or ruby?  Have a strong opinion between bash and zch?<p>If there's a problem that we don't have a solution for, we invent one.  Last thing we invented resulted in patents that have our people's name on them.<p>Working on next years projects this year.<p>Being the best.<p>When you write protection for a vulnerability or malware here, you cover IDS/IPS, a NGFW, and two antivirus systems.  You protect networks from endpoint to border and into the cloud.<p>If you gag when you hear the word cloud or synergy.<p>Vegetarian?  Paleo? Meat eater?  There is someone here that will sympathize with you.<p>Working for the fastest growing company in security\nHonestly there's way too many things to list.<p>Our currently open job listings are here.\n<a href=\"https://sourcefire.silkroad.com/epostings/index.cfm?fuseaction=app.welcome&#38;category_id=14174&#38;company_id=15640&#38;version=1&#38;startflag=1&#38;parent=VRT%20%28Vulnerability%20Research%20Team%29&#38;levelid1=14174\" rel=\"nofollow\">https://sourcefire.silkroad.com/epostings/index.cfm?fuseacti...</a><p>But that's not even the complete list.  We're a growing company, with lots of projects under our purview, and we need people, both junior and senior to be able to fill these roles.<p>If you like Snort, or ClamAV, or think you can learn, and want to learn, shoot us your resume at research [at] sourcefire [dot] com.<p>Challenge yourself.  Challenge us.","time":1330634556,"type":"comment"}