{"by":"hello-yoshi","id":3654853,"parent":3652041,"text":"Toronto, ON (Remote Workers welcome) - Slightly Crazy Web/Mobile Developer (<a href=\"http://www.myplanetdigital.com/careers\" rel=\"nofollow\">http://www.myplanetdigital.com/careers</a>)<p>We are change agents. With offices in Toronto and Chicago, Myplanet is a rapidly growing provider of technical and creative services for web and mobile platforms. Along with a top-notch user experience/interactive team, some of our main specialties include the Drupal Social Publishing Platform, the Magento E-Commerce platform, mobile development for Android and iPhone devices, PHP and Python-based web applications and integrating weird legacy systems (hello RPG code, how did you get in there?).\nOur clients range from large public companies to startups, non-profits and government agencies. On any given day, we work on projects ranging from building creative new web and mobile experiences, to launching startups for clients, to helping clients understand and plan for adoption of new interactive technologies. We are, in essence, one part technology specialist, one part interactive agency, and one part business model incubator.<p>We like to work on things that matter with people who care.<p>About the position<p>You'll be tasked with building important systems for interesting clients, with plenty of technical challenges and opportunities to learn as you go. You'll work in a Scrum team, primarily in PHP to start - you'll also likely learn how to build complex systems in Drupal through our 2 month intensive training program with world re-known Drupal experts.<p>About you<p>A background in Computer/Software Engineering or Computer Science is strongly preferred, but we're open if you can demonstrate you know your stuff and have a nonconventional degree. We're looking for 1-2yrs experience (if you're fresh out of school get in touch anyway). Double points if you have startup experience.\nWe mostly work in PHP, but diverse language experience is a plus. It's more important that you're smart and driven than that you're a PHP expert. If you've played around with iOS development, HTML5, Python, Ruby/Rails 3, Android dev, Facebook app dev, etc., those are all positives.<p>Learn more - <a href=\"http://www.myplanetdigital.com/careers\" rel=\"nofollow\">http://www.myplanetdigital.com/careers</a>","time":1330648872,"type":"comment"}