{"by":"biciblomquist","id":3658104,"parent":3652041,"text":"Social TV / Mobile Gaming Startup in New York, NY, San Francisco, CA and Los Angeles, CA is looking for Software Engineers (Java, Python/PHP, Scala, node.js, C/C++ for Audio Engineering), Web Engineers (Native JavaScript, Ruby on Rails), Mobile Engineers (iOS, iPhone, iPad and Android), Linux System Engineers (Amazon EC2 experience preferred), and Quality Engineers. Full-Time Employees preferred but consultants are okay too. Onsite work is preferred but we're flexible.<p>So, I work for Function(x), a technology driven media company that just launched its first product dubbed Viggle at the end of January 2012. Viggle is the first of its kind rewards/loyalty program for watching TV (I know what you're thinking, someone hadn't done that yet? Apparently not).<p>Viggle allows individuals with smartphones (we've launched an iOS app, an Android app is in the works) to check into your favorite TV shows and get great, REAL rewards such as movie tickets, music, gift cards and much, much more; all just for watching the TV shows you love.<p>As you probably know by now, we're hiring across the board and tackling some pretty interested engineering challenges.<p>Think real-time audio ingestion (\"audio thumbprint\" technology), real-time traffic spikes in users as they check-in to their favorite tv-shows, mobile networking issues, etc.<p>You may also have the chance to work on the \"next\" Function(x) product too.  We can't give away that secret sauce just yet.<p>Here's a link to the Viggle app - <a href=\"http://viggle.com/\" rel=\"nofollow\">http://viggle.com/</a><p>Here's a link to our corporate website (we're are still in start-up mode even thought we're publicly traded) - <a href=\"http://www.functionxinc.com/\" rel=\"nofollow\">http://www.functionxinc.com/</a><p>And here's some press that we've been getting (shameless self promotion isn't bad if it's the last thing you mention, right?) - <a href=\"http://www.functionxinc.com/press/\" rel=\"nofollow\">http://www.functionxinc.com/press/</a><p>If you're interested, check out all our job descriptions here - <a href=\"http://hire.jobvite.com/j/?bj=omXZVfwX&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=omXZVfwX&#38;s=Hacker_News</a><p>Or you can reach out to me at leifrecruiter \"at\" functionxinc \"dot\" com<p>Or at the following two phone numbers: +1-646-619-1327 or +1-516-220-0197<p>Thanks,<p>Leif Blomquist","time":1330718463,"type":"comment"}