{"by":"mdc2161","id":7324754,"parent":7324236,"text":"McKinsey Digital Labs is looking for INTERNS for summer 2014. These are paid positions in our New York office.<p>About the Firm:<p>McKinsey &amp; Company is one of the world’s premiere management consulting firms with some 8,500 consultants across 89 locations in 50 countries. The Firm provides a full spectrum of consulting services primarily to large corporations but also to governments, international institutions, and non-profit organizations. These organizations include 100 of the top 150 global companies, touching every major industry.<p>About MDL:<p>McKinsey Digital Labs (MDL) brings technological expertise to our clients as one of McKinsey&#x27;s new delivery models. We do this through our various service lines, which include:\n\t-Advising and coaching on agile and digital transformations\n\t-Building custom full-stack applications and software packages\n\t-Rapidly prototyping iPad and web apps\n\t-Creating and implementing big data solutions<p>Despite being part of a large, multinational organization, MDL works more like a small startup, employing small, flexible teams. We use agile methodologies to iterate quickly towards the solutions we need. We combine the latest open source technologies together with traditional Enterprise software products.<p>Our office culture is casual, fun and social, with an emphasis on education and innovation. We have the freedom to try new ideas, experiment and are expected to be constantly learning and growing.<p>We are looking for interns in three roles:<p>Designer-\nThese candidates have experience in visual design and, ideally, photoshop or illustrator.\nDesigners create the look and feel of applications, from high-level wireframe concepts to high-fidelity designs. They translate client business requirements, user needs, and technical capabilities into designs that are visually exciting, easy to use, and emotionally engaging. Much of our work makes heavy use of data visualization.<p>Developer-\nThese candidates have a background in computer science.\nOur developers fall roughly into three categories:\n\t- Front-end&#x2F;UI devs (HTML, CSS, JS, Angular.js, D3, etc.)\n\t- Server-side devs (Clojure, Node.js, .NET, Java, Ruby, etc.)\n\t- Data engineers (Hadoop, SQL, etc.)\nWe use a broad range of technologies to meet unique client needs, and so being able to learn quickly and adapt is a must. We value the new techniques and technologies shared from experimentation and self-learning. Experience with pair programming, agile, and test-driven development is a plus.<p>Product Owner-\nPOs generally come from a business or computer science background.\nPOs lead our teams using agile methodologies and serve as the point person for the client. They set the expectations for the client and the priorities for the team to ensure alignment between the business and IT stakeholders. Proficient with drawing storyboards, creating wireframes, creating product backlogs, writing user stories and developing acceptance criteria.<p>If interested please respond to matt_casey at mckinsey.com","time":1393690905,"type":"comment"}