{"by":"ladon86","id":7324965,"parent":7324236,"text":"ClassDojo<p>FULLTIME in SAN FRANCISCO, CA<p>ClassDojo is used by over 15mm teachers and students to manage behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We&#x27;re an edtech startup with funding some of the biggest names in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we&#x27;re one of the fastest growing education companies of all time. We&#x27;re the only non-YC company that Paul Graham has ever invested in.<p>We&#x27;ve built a product that makes a real difference and gets huge engagement with millions of kids, and we&#x27;re about to take it to the next level, hopefully with you on board. We have a strong team, an extremely comfortable and relaxed environment and great salary + benefits. If you&#x27;re a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n\n\n  https:&#x2F;&#x2F;classdojo.wufoo.com&#x2F;forms&#x2F;join-classdojo&#x2F;    \n\n\n  --------------------------    \n</code></pre>\nOr email jobs@classdojo.com. You can read about the work and environment here:<p><a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.classdojo.com&#x2F;jobs</a><p>Right now our most important hire is a senior iOS engineer. You will be joining a great iOS team of 2 very talented individuals, and you&#x27;ll be working on some exciting features that millions of students, teachers and parents love. We think there&#x27;s someone out there that will love building an amazing iOS product that makes teachers lives easier and improves lifetime outcomes for kids.<p>If you are a great developer with iOS experience, get in touch below - we think it will be the best move you ever make!<p>Apply here:<p><a href=\"https://classdojo.wufoo.com/forms/join-classdojo/\" rel=\"nofollow\">https:&#x2F;&#x2F;classdojo.wufoo.com&#x2F;forms&#x2F;join-classdojo&#x2F;</a>","time":1393692888,"type":"comment"}