{"by":"tommytsai1984","id":7324627,"kids":[7324642],"parent":7324236,"text":"Shopular (YC W2012) - Redwood City, CA<p>Shopular connects retailers and shoppers by automatically detecting when the shopper arrives at a store and popping up personalized promotions.<p>Shopular has over 2.5M users and almost 25,000 ratings averaging a near perfect ★★★★★. Time featured Shopular as one of the 50 Best iPhone Apps of 2013. Shopular is YC-backed and has raised a $6.4M Series A from Sequoia Capital.<p>The best part is that we are still a small team of 4 high-caliber engineers from Google, Shopkick, Ooyala and Loopt.<p>We are growing our team and looking for experienced and eager individuals who share our passion for creating consumer experiences that &quot;just work&quot;. You will get significant equity and responsibility at a company with strong traction and backing.<p>Our stack: iOS, Android, Python, Postgres, Redis<p>--- iOS Engineer ---<p>Master of iOS with significant prior experience building beautiful consumer-facing apps with a large number of users. You have built complex apps from scratch. When needed, you are comfortable jumping into the backend (Python or Ruby experience preferred) to build features to support the app.<p>--- Android Engineer ---<p>Master of Android with significant prior experience building consumer-facing apps with a large number of users. You have built complex apps from scratch. When needed, you are comfortable jumping into the backend (Python or Ruby experience preferred) to build features to support the app.<p>--- Backend Engineer ---<p>You can handle the entire backend stack including the DB, production app servers, web servers, and caching. You have built systems with significant scale and low latencies. You have deployed and maintained at-scale production setups, designed DB schemas to scale, built effective caching schemes, and managed high-throughput systems. You will lead the charge on our entire backend.<p>--- Full-Stack Engineer ---<p>You are a go-getter, fast learner, get-stuff-done engineer. You love new challenges and find creative solutions for problems. You are comfortable building features end-to-end, from bits in the DB to pixels on a smartphone.<p>--- UI&#x2F;UX Designer #1 ---<p>You have experience building mobile app interfaces. You strive to build the most intuitive and delightful UIs that can improve lives of millions of users. You obsess over every UX flow and every pixel on the screen. As our first designer, you will own the design of the entire app.<p>All roles require strong prior experience. If you have been looking for an early-stage startup opportunity where you can create a significant impact and be part of a stellar team, we may be the right fit. Let&#x27;s talk more!<p>Join us in our quest to transform physical retail and create the most intuitive consumer experiences. See more at shopular.com and angel.co&#x2F;shopular. We look forward to hearing from you at join@shopular.com!","time":1393689658,"type":"comment"}