{"by":"surrealize","id":7325216,"parent":7324236,"text":"San Francisco, CA | Cancer Therapeutics Innovation Group (CTIG)<p>Help cure cancer by building webapps.<p>At CTIG, we sequence the DNA of cancer tumors to recommend the right therapy for that tumor&#x27;s specific DNA mutations. Patients and their oncologists use our analyses to help make decisions about how to treat their cancer. With us, you&#x27;d help build the systems that doctors and patients use to access and interpret our results, and work on the systems we use to manage our internal processes.<p>It&#x27;s really important that our users (patients and doctors) be able to understand the results we&#x27;re giving back to them. So we&#x27;re looking for someone who can translate our analyses into web pages that are clear, simple, and well-designed. That makes front-end experience and an eye for aesthetics important, but you&#x27;ll be working on the backend as well.<p>Our current web apps are built using:<p>* Scala, with the Play framework<p>* Python, with Django and Flask<p>* Javascript, with Angular.js and D3<p>* HTML&#x2F;CSS&#x2F;LESS with Bootstrap<p>* Postgres<p>It&#x27;s great if you&#x27;re familiar with those, but general web dev skill and the ability to pick up new tools and technologies is more important. Our other systems also use R, and we&#x27;re experimenting with the Julia language, so if you&#x27;re looking to work with interesting technology then you&#x27;ll find kindred spirits here.<p>CTIG is located in Mission Bay in San Francisco, across the street from the UCSF campus here. We&#x27;re a very interdisciplinary group, with bioinformaticians and computational biologists from UC Berkeley, UC Santa Cruz, and UCSF; biologists from UCSF, and physicians from Harvard Medical School. Some of us have PhDs, some of us have MDs, and some of us are college dropouts; we&#x27;re not credentialists, but we do have strong backgrounds in our respective fields. It&#x27;s a small team with 6 programmers, so you&#x27;d be a core contributor and you&#x27;d help set our technical direction.<p>We&#x27;re very serious about cancer, but pretty laid-back otherwise; office discussions range from the nitty-gritty details of molecular biology and machine learning to re-enactments of South Park episodes.<p>We&#x27;re looking for people who are authorized to work in the US, and can work full-time on-site in SF.  If you&#x27;re interested, email me at mskinner@ctig.com, and include &quot;EGFR&quot; (the name of one of our favorite genes) in the subject.","time":1393695645,"type":"comment"}