{"by":"zinxq","id":7325619,"parent":7324236,"text":"Mountain View, CA<p>Refresh is hiring full-time developers and designers up and down the stack.<p>Who we are:<p>Refresh Inc. is a Silicon Valley startup, and we’ve raised $10M in funding. Our current team is pretty awesome and includes some ex-Googlers, ex-Microsofties, ex-Yahoo, ex-LinkedIn and ex-Salesforce folks, vets from startups, tech book authors, PhDs, along with Stanford and Harvard grads. We&#x27;re a super strong team that cares about how our code runs and cares that users simply love our mobile app.<p><a href=\"http://www.refresh.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.refresh.io</a><p>What our mobile app does (available for IOS now - try it!):<p>Refresh delivers real-time dossiers from data across the web about the people you meet. We grab data from over ~40 sources (more every week!) to give you an edge in every meeting you have.<p>Who we’re looking for:<p>We&#x27;re looking for passionate and capable engineers to add to our already great team. Are you excited about working with smart people who are motivated and driven? If you want to be part of building a start-up from the ground up and have an impact on things every step of the way, we want to hear from you.<p>Ø Java Developers (server side)<p>Work on our back-end system that pulls, on-demand, data from dozens of data sources (in parallel), parses and semi-structures the input, creates and packages the results to be shipped back to the user device. Needless to say we care about performance (a lot). If you do too, send us a resume!<p>We’re hiring across the experience spectrum from new grads to Senior Engineers. For more experienced engineers, you have years of experience on large Java projects with high-performance requirements. For new grads, you have a few significant Java projects you can show us. If you are awesome in some other language but willing to learn Java - we&#x27;re happy to talk to you too.<p>Ø IOS Engineer<p>Contribute heavily to the conceptualization and design of Refresh on the iOS Platform.<p>2+ years of iOS software development and iOS7, Core Data, Core Graphics and Core Foundation for iOS experience. Published iPhone and&#x2F;or iPad applications in the App Store (or something far enough along to be able to show us).<p>Ø Android Engineer<p>Contribute heavily to the conceptualization and design of Refresh on the Android Platform. Interface Android client with Refresh’s extensive back-end intelligence systems.\n2+ years of Android software development and Android sdk, ndk, apk packaging experience. Strong Java language skills. Published apps in the Play store (or something far enough along to be able to show us).<p>Ø QA Engineer<p>Automated and Manual testing. Writing and executing automated tests for both web and mobile environments. Implementing and creating regression systems.<p>3+ years testing web and&#x2F;or mobile apps with coding experience and familiarity with Java, Javascript, and&#x2F;or Objective-C. Hands-on mobile automation experience. Part tester, part bug-hunter and when appropriate, bug fixer.<p>Ø QA Tester<p>Manual front-end testing of mobile apps in iOS and Android environments.<p>3+ years of experience testing mobile apps (web apps a plus), with rock solid knowledge of bug tracking and writing&#x2F;following test plans and test cases. Knowledge of front-end technologies such as: HTML, CSS, JavaScript is a plus.<p>Ø Visual Designer (for Android)<p>Focusing on our Android app, you will play a critical role shaping the future of Refresh. You will work closely with the existing User Experience team to adapt our design for Android specific interactions.<p>Extensive experience in designing the UI for Android and iOS apps. You should have a passion for creating simple, clean designs with an element of delight.<p>Why you want to work with us: Awesome team, cool culture, top of the line dev machines, brand new office (killer views), free lunches, and more!<p>Refresh your relationships with our app and Refresh your career by working with us!<p>More information at: www.refresh.io&#x2F;jobs&#x2F;<p>Apply at: jobs@refresh.io<p>H1B transfer applicants welcome.","time":1393700676,"type":"comment"}