{"by":"sgrove","id":7325268,"parent":7324236,"text":"San Francisco, CA - Zenbox. Software Engineer. [LOCAL | RELOCATE OK]<p>We&#x27;re a YC company with a private-beta sales tool that helps small and large companies catch opportunities from slipping through the cracks.<p>If you&#x27;ve ever run a startup, you know how difficult it can be to stay on top of sales. And you also know how many companies fail because of it. We want to make them succeed.<p>We also spend time improving our tooling, and tools for other developers.<p><pre><code>  * We run the SF ClojureScript meetup\n  * Incredibly modern stack: written entirely in Clojure&#x2F;ClojureScript&#x2F;Om&#x2F;React\n  * Released the first reference Om app (https:&#x2F;&#x2F;github.com&#x2F;sgrove&#x2F;omchaya)\n  * Given presentations on how we see app development trending http:&#x2F;&#x2F;sgrove.github.io&#x2F;omchaya&#x2F;docs&#x2F;presentation.html (hint: It&#x27;s about to get much, much better, and referentially-transparent UI&#x27;s and serializable state play a big part)\n  * We&#x27;ve vastly improved the source-map capabilities of the ClojureScript compiler\n  * Reified keywords to the runtime to make ClojureScript a better citizen on the web. \n</code></pre>\nWe do all of this for two reasons: 1.) We want to build apps that customers love in the best way possible, and that often means taking the time to explore proper approaches. With the right team and stack, we run circles around others, and 2.) because we want to give back to the communities that have enabled us.<p>We&#x27;re looking for an engineer who loves the craft, who cares about building product, and is excited about helping customers.<p>Interested in working with Reactjs, Om, and functional programming in the client? We&#x27;re building a team that&#x27;s able to reduce complexity others balk at into simple, easy to reason about system, so we can continue to move quickly and delight both customers and ourselves.<p>This is fullstack work.<p>Languages: Clojure, Clojurescript, Javascript. sean @ zenboxapp <a href=\"https://www.zenboxapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zenboxapp.com</a><p>Also, come meet us at the SF ClojureScript meetup! <a href=\"http://www.meetup.com/SF-Clojurescript-Meetup/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.meetup.com&#x2F;SF-Clojurescript-Meetup&#x2F;</a>","time":1393696516,"type":"comment"}