{"by":"jraines","id":7325133,"parent":7324236,"text":"Stylitics<p>Fulltime in New York City (Manhattan) or REMOTE<p>We aggregate consumer data through our web and mobile apps, providing a self-service analytics dashboard to brands and retailers.<p>For consumers, Stylitics is the way to intelligently manage their wardrobe and style decisions. Our mobile apps (average 4.5 star reviews) give users a smart virtual closet, where they can access their closet, and plan and share outfits from anywhere.<p>For the fashion industry, Stylitics has built a highly needed product offering, helping brands and retailers answer questions like “What does my customer own?”, “What competitors do they shop at?”, “What do they pair my items with?”, and more. Clients and Partners include Tory Burch, Neiman Marcus, Rebecca Minkoff, and Urban Outfitters.<p>What we’re looking for: an experienced engineer who can move seamlessly between working with our client side application and helping us build our backend application and API services.  If you have an interest in, and skills for, data analysis and visualization, even better!<p>Current technologies include:<p>Rails, Node, PostgreSQL, Mongo, Backbone with Marionette, Heroku, AWS, git, d3.js and lots more.<p>We value TDD and craftsmanship in our code, and good communicators who aren&#x27;t afraid to bring strong opinions to the table with code to back it up.<p>We&#x27;d love to have you in our New York office, but we know how to have a great remote team &amp; experience -- our lead developer on the consumer products side was remote for two years before coming to New York, our lead for the b2b analytics product is currently remote, and we&#x27;ve had full or part time team members from Philadelphia, California, India, Iraq, and Bulgaria.<p>We offer a competitive salary and good equity on simple and straightforward terms.<p>See our full posting here:<p><a href=\"https://jobs.github.com/positions/c4e0214a-9cdb-11e3-9d0a-cebd829a5eff\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.github.com&#x2F;positions&#x2F;c4e0214a-9cdb-11e3-9d0a-ce...</a><p>And feel free to contact me directly if you have any questions:  jeremy@stylitics.com","time":1393694660,"type":"comment"}