{"by":"doctoboggan","id":7326549,"parent":7324236,"text":"I am working for a startup out of a top tier Boston university doing desktop 3D printing. We have an agreement with Autodesk where they will be developing custom cloud based software that will communicate directly with our printers. They are looking for a dev to do browser based 3D design software. You will be working in our offices at the school while we build out and test the printer. We need someone who knows best practices for web based 3d design software. Check out 123Design to see what is currently possible:<p><a href=\"http://www.123dapp.com/design\" rel=\"nofollow\">http:&#x2F;&#x2F;www.123dapp.com&#x2F;design</a><p>Reach out to me at jack@minardi.org<p>Autodesk Software Engineer, 3D Printing<p>Description<p>As a global leader in 3D design, engineering, and entertainment software, Autodesk helps people imagine, design, and create a better world. The Autodesk Consumer Group is a new and exciting team that is passionate about providing powerful and fun design and visualization tools, platforms, websites and communities that unlock the creativity in everyone. Whether it’s a kid looking to have some fun, a seasoned pro, or just someone who wants to amp up their creativity, the ACG is all about helping them turn their ideas into reality and share them with the world.<p>Job Title and Number: Software Engineer, 3D Printing, Req# XXXXXXX\nLocation: Cambridge, MA (Boston Area)<p>We are seeking an exceptional Software Engineer to help us design and develop the next generation of integrated 3D printing software. You will be working in a research environment with a diverse team of 3D printing experts aiming to make an impact on the way we fabricate the objects of the future. Using your software expertise, you will create compelling prototype design tools at the intersection of 3D printing and electronics. These prototypes will have the potential to reach millions of people through the Autodesk 123D family, that includes everything from digital sculpting to accessible circuit design. As a Software Engineer working in this exciting new team, you will have a huge impact on how we enable new forms of 3D printing in the future.<p>Principal Duties and Responsibilities:<p>* Develop software systems and prototype applications at the intersection of 3D printing and electronics.<p>* Collaborate with a diverse team of researchers, product designers, product managers, engineers, and scientists to create fully integrated 3D printing software.<p>* Deliver 3D design and fabrication software that leverages cutting edge research to deliver a seamless user experience.<p>Position Requirements:<p>* Passion for working with 3D printing and electronics.<p>* BS or MS in Computer Science, Mathematics, Engineering or other relevant field.<p>* Knowledge and experience in computer graphics, 3D design, and geometric modeling.<p>* Hands-on experience developing complete graphical applications, either through prototypes or real world applications.<p>* Experience with client&#x2F;server architecture and web technologies such as JavaScript, HTML5, and WebGL.<p>* Working knowledge of electronic circuit design.<p>* Experience with high-level software design, APIs, and software architecture.<p>* Self-directed and focused, requiring minimal supervision to execute on goals<p>* Strong communication skills with the ability to converse fluently to a range of different team members.<p>* Keen interest in scientific research and applying it to real world problems.","time":1393714872,"type":"comment"}