{"by":"DealerBuilt","id":7326438,"parent":7324236,"text":"We are seeking a .Net Developer to join our growing team that provides automobile dealers with a modern, flexible, and industry-leading dealer management system.<p>DealerBuilt offers employees the flexibility of taking their careers to exciting levels of achievement. You will be challenged and empowered to reach your full potential while providing new and innovative products for one of the most exciting industries.<p>DealerBuilt’s strength and the reliability of our product are built on the quality work ethic of our employees. Join the DealerBuilt team and you will be part of a family of professionals who are making a difference in a growing list of satisfied automobile dealers.<p>General Description\nThe .Net Developer designs, develops, implements, and maintains .Net software applications and components, providing support internally and to end users when necessary. Ideal candidates will be familiar with language and framework conventions, able to maintain clearly-written documentation, and anxious to find opportunities to think outside the box and find new approaches to solving complex problems.<p>Primary Responsibilities:\n• Software development in C# using Visual Studio and related tools\n• Creation and delivery of data-driven reports \n• Unit test design for new Windows and web software applications \n• Identification and correction of defects in existing software systems\n• Identification of opportunities to enhance existing systems in ways that make our business objectives more attainable\n• Investigation and development of skills in new software technologies \n• Creation of technical specifications, test plans, and operational guides\n• Maintenance of documentation on existing software systems\n• Close consultation with management and stakeholders on projects and tasks \n• Collaboration with colleagues on systems maintenance and improvement<p>Skill Requirements: \nSuccessful candidates are likely to have at least 3 years of experience in a professional capacity, as well as a bachelor’s degree in Computer Science (or equivalent discipline). However, talented entry-level developers are encouraged to apply.<p>• C#, JavaScript\n• SQL (PostgreSql preferred)\n• ASP.NET MVC\n• WPF\n• WCF &amp; SOA\n• HTML&#x2F;CSS, jQuery, Bootstrap<p>Salary is commensurate with experience.  Benefits include health, dental, short term disability, voluntary life insurance, 401k and paid time off.  Employer conducts pre-employment background checks. EOE<p>To apply for this position, send your resume and cover letter to avis.haberkamp@dealerbuilt.com.","time":1393713091,"type":"comment"}