{"by":"zg","id":7328712,"parent":7324236,"text":"LONDON (UK) -- Software Engineers (front and back-end), Data Architects<p>TrialReach is a VC-backed startup solving a huge problem in the healthcare industry.<p>• This is a company you can be proud to be a part of with a huge vision for transforming healthcare.<p>• You&#x27;ll be working alongside a small but highly talented multi-disciplinary team solving challenging technical problems.<p>• Our gorgeous riverside offices in Richmond provide a change from the urban jungle whilst being just 10mins from the tube.<p><i>The Roles</i><p>We&#x27;re currently recruiting for 1xBack-end developer and 1xFront-end developer. If you happen to be a full-stack developer, even better.<p>Our back-end stack is Linux&#x2F;Postgres&#x2F;Neo4j&#x2F;Python&#x2F;Django - we an experienced software engineer that can work across our range of products including being comfortable taking academic R&amp;D projects and turning them into production ready products. Any production experience with Neo4j or other graph databases highly valuable.<p>On the front-end we need somebody who can help define and build a brand new scalable and performance-focussed front-end architecture that works for mobiles, tablets or desktop computers. For more details see <a href=\"http://www.trialreach.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.trialreach.com&#x2F;about&#x2F;jobs&#x2F;</a><p>We&#x27;re also interested in talking to anyone with experience of data architecture for healthcare products. In particular this would mean a good understanding of available medical ontologies and a solid theoretical understandig of database architectures.<p><i>Where do I apply?</i><p>We&#x27;re happy to consider full or part-time applicants. We offer competitive salaries and stock options. You must have the right to work in the UK.<p>We&#x27;re interviewing candidates immediately. So if you&#x27;re interested, please do get in touch - jobs at trialreach.com (please mention that you heard about this on HN)","time":1393759312,"type":"comment"}