{"by":"0xa","id":7329569,"parent":7324236,"text":"Kensho, Boston, MA (Cambridge, Harvard Sq): FULL TIME Software Engineers (SRE, Python, JavaScript&#x2F;AngularJS&#x2F;d3js&#x2F;UI&#x2F;UX)\n.\nTL;DR: Kensho’s team (<a href=\"http://www.kensho.com/#team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kensho.com&#x2F;#team</a>) is actively hiring engineers with a passion for scaling and testing complicated cloud infrastructures.  Our current openings: <a href=\"http://bit.ly/Hj4hJz\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;Hj4hJz</a>.<p>We have major projects for people with a knack for site reliability--highly efficient caching, messaging and tuning--and making sure our site, code and engineering processes stay efficient.<p>Matt<p>Software Engineer, SRE | <a href=\"https://kensho.recruiterbox.com/jobs/29435/\" rel=\"nofollow\">https:&#x2F;&#x2F;kensho.recruiterbox.com&#x2F;jobs&#x2F;29435&#x2F;</a>\nAs a Software Engineer working on Kensho’s software stack and the silicon it runs on, your mission will be to ensure that Kensho services are always fast, available, and impossible to destroy. Seated at the helm of operations, you will solve the [often unexpected] problems of deploying systems at scale.  You will design and develop systems to deploy and run all of Kensho’s infrastructure alongside our elite engineering team.  You will also be driving performance and reliability from software and infrastructure at massive scale -- where storing, working with and transmitting petabytes and gigabits of data remains routine.<p>QA Lead Engineer (SET) | <a href=\"https://kensho.recruiterbox.com/jobs/27871/\" rel=\"nofollow\">https:&#x2F;&#x2F;kensho.recruiterbox.com&#x2F;jobs&#x2F;27871&#x2F;</a>\nAs QA engineer, you will be the gatekeeper for Kensho, ensuring that our weekly releases are bug-free. Working closely with engineers, you will create and work through test plans, spot-check our math, and create bugs&#x2F;improvements, assigning them to the appropriate engineer. You will also take charge of automated testing, unit tests, automation tests, and otherwise, to ensure that our product is as bug-free as humanly (or machinely) possible.<p>Chief Data Wrangler | <a href=\"https://kensho.recruiterbox.com/jobs/27848/\" rel=\"nofollow\">https:&#x2F;&#x2F;kensho.recruiterbox.com&#x2F;jobs&#x2F;27848&#x2F;</a>\nYou will scour the world for securities market data, and structured and unstructured data that affects markets. Combining curiosity, an entrepreneurial drive, and a desire to geek out on the arcana of market data, you’ll enable our clients to gain unprecedented insight into the world.<p>We also have openings for Software Engineer and UI&#x2F;UX Lead. All of our openings:\n<a href=\"https://kensho.recruiterbox.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;kensho.recruiterbox.com&#x2F;</a><p>About Kensho (<a href=\"http://www.kensho.com/#company\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kensho.com&#x2F;#company</a>)\nKensho combines high-speed parallelized algorithms and machine learning to create a new class of analytics tools for capital markets. Addressing the three biggest challenges surrounding financial analysis on Wall Street today—speed, scale, and automation—Kensho&#x27;s statistical computing and financial risk analysis applications are providing the next generation Bloomberg terminal in the cloud.","time":1393776850,"type":"comment"}