{"by":"joeturner101","id":7329761,"parent":7324236,"text":"Oklahoma City, OK -- Fast Food Lab (UI&#x2F;UX Designers, Product Engineers, Product Owners)<p><a href=\"http://futureof.io/burgers/\" rel=\"nofollow\">http:&#x2F;&#x2F;futureof.io&#x2F;burgers&#x2F;</a><p>We&#x27;re building a lab with a singular mission: hack the fast food lot. This is our moonshot moment – the chance to re-invent the QSR industry and to transform the restaurant experience via digital screens.<p>Everyone — not just customers — should love the restaurant experience. Today, it&#x27;s pretty good, but it&#x27;s not perfect. From the point of sale, to mobile applications, to employee training, to embedded interfaces, to supply-chain management, we&#x27;re hacking our systems to make them all better...forever.<p>Along the way, we&#x27;ll radically change how restaurants interact with customers. We&#x27;re making systems that create 1-to-1 communications, that build personalized food experiences, and that learn and get better with every sale.<p>With your help, we&#x27;ll build the best interfaces in the industry.<p>And the best part? It&#x27;s in Oklahoma. This is your chance to be a part of a movement, to play an integral role in a growing tech community that&#x27;s bringing economic growth and innovation to the Heartland.<p>Fair warning: things are run differently around here. Our culture is inspired by a new way of working. \nYour environment is part-startup, part-end-up:<p>Have autonomy and a say in your product, without putting in 70 hours a week.\nTake risks on new ideas, yet have predictable funding and runway.\nHave permission to fail, without worrying about the company going under.\nYour team wants you to take 14-day vacations.<p>Are you at a start-up with a life-span near its finish?\nAre you a talented member of a team at a popular technology company looking for the opportunity to have more say over what you do?\nAre you a workhorse at an agency, tired of creating products for promotions instead of real users?\nAre you an adventurer, looking to be a part of a growing community that&#x27;s making a huge regional economic difference?<p>Join us. We&#x27;re currently accepting inquiries for a spring 2014 start date for an OKC-based role.<p>- Product Owner: Act as the strategic lead for a new product innovation lab. Create our products&#x27; vision, make key decisions without much oversight, and own the tools and resources to build and ship ideas quickly. You’ll be a part of a startup-like environment in a company with millions of existing users.<p>LEARN MORE HERE: \n<a href=\"http://futureof.io/burgers/product_owner.html\" rel=\"nofollow\">http:&#x2F;&#x2F;futureof.io&#x2F;burgers&#x2F;product_owner.html</a><p>- Product Engineer: We seek a Full-Stack Product Engineer. You’ll will be involved in all parts of the product development process — you&#x27;ll brainstorm approaches to the problems we face, work with designers to create mockups and prototypes, test ideas in front of customers, code, ship, and tweak. Your work will evolve into a product that will ship within 6 months of your start date.<p>LEARN MORE HERE: <a href=\"http://futureof.io/burgers/product_engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;futureof.io&#x2F;burgers&#x2F;product_engineer.html</a><p>- Product Designer: Ever thought of creating your own product? This is your moment. You’ll have equal say throughout the product development process — from conception, to build, to launch. You’ll create paper prototypes. You’ll meet with customers and transform findings into new interfaces. By turning stories into product ideas and prototyping UX experiences, you’ll work with your team to ship a product within 6 months of your start date.<p>LEARN MORE HERE: <a href=\"http://futureof.io/burgers/product_designer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;futureof.io&#x2F;burgers&#x2F;product_designer.html</a><p>Excited? Apply Within: <a href=\"http://futureof.io/burgers/\" rel=\"nofollow\">http:&#x2F;&#x2F;futureof.io&#x2F;burgers&#x2F;</a>","time":1393779582,"type":"comment"}