{"by":"nicolethenerd","id":7330486,"parent":7324236,"text":"Amplify - Brooklyn, NY (we also have offices in Manhattan, Atlanta, North Carolina, and more)<p>amplify.com<p>Amplify is reimagining the way teachers teach and students learn in K-12 education. Our digital products are leading the way in data-driven instruction, breaking new ground in mobile learning and setting the standard for next-generation digital curriculum and assessment. And our professional services team, with years of classroom experience, helps schools implement digital solutions to meet their local conditions.<p>Amplify is built on the foundation of Wireless Generation, the pioneer that brought mobile assessments and instructional analytics to schools across America. To date, Amplify has supported more than 200,000 educators and 3 million students in all 50 states as they begin their digital transition. And we’re just getting started.<p>---<p>Amplify is an educational software company split into three divisions:<p>Amplify Insight (formerly Wireless Generation) creates assessment tools for teachers to evaluate their students&#x27; learning and track their process<p>Amplify Learning creates innovative curriculum, activities, and games<p>Amplify Access is building an Android-based tablet specifically designed for use in schools.<p>Amplify is a large company with a variety of roles across these different divisions - for a full list, check out www.amplify.com&#x2F;careers<p>---<p>I&#x27;m the technical lead on the Quests for the Core team (www.amplify.com&#x2F;curriculum&#x2F;quests-for-the-core), a part of Amplify Learning) - I&#x27;m specifically looking to fill a role on my team, as well as a few similar roles on some of the other Learning development teams (who are also creating interactive student-facing applications). I&#x27;m looking specifically for someone with good front-end skills, who can own the development of an interactive educational application from start to finish, and likes to experiment with new technologies and work closely with designers - the technologies we currently use on my team are HTML5, CSS3, JavaScript&#x2F;jQuery, and AngularJS - and some of the other Learning teams are also looking for HTML5 canvas and&#x2F;or Unity3D experience.  If this sounds interesting to you, please reach out to me directly at nbieber at amplify.com  - or feel free to get in touch if you have any questions about what it&#x27;s like to work at Amplify.","time":1393790016,"type":"comment"}