{"by":"itsdrewmiller","id":7332064,"parent":7324236,"text":"NGP VAN - Washington, DC or Boston, MA - Senior and Mid-Level Developers, QA Engineers, Interns<p>NGP VAN (<a href=\"https://coderwall.com/team/ngp-van\" rel=\"nofollow\">https:&#x2F;&#x2F;coderwall.com&#x2F;team&#x2F;ngp-van</a>) is the world’s leading political technology firm, providing campaign and organizing technology to Democrats, progressives, and non-partisan organizations. We offer an integrated platform that combines the best fundraising, compliance, organizing, and new media products available.<p>We are a rapidly growing company that built the voter contact and volunteer management tools used by Obama for America. Nearly every State Democratic Party in the country distributes our VoteBuilder tools to Democrats up and down the ticket, and we provide industry-leading organizing tools for labor unions, environmental groups, pro-choice advocates, civil rights activists, and international political parties across the world. Our fundraising and compliance software is used by the vast majority of Democratic candidates from the Presidential level on down, and our fast-growing new media platform has recently become the most-used platform by Democratic campaigns as well.<p>We have a couple of positions open in DC for developers - our stack is mostly ASP.NET MVC &#x2F; EF, but we have several node apps and are also using angular pretty heavily in new stuff.  We&#x27;re also looking for a QA engineer in Boston, and we&#x27;re open to summer interns in both locations.<p>The positions offers competitive compensation and a strong benefits package. NGP VAN prides itself on being a progressive and open-minded workplace; we have a fun and relaxed company culture, including blowing off steam on a softball field, drinking in the office on Fridays, enjoying periodic company retreats to warm places with beaches, and casual Friday every day.<p>Some relevant links:<p>Job Postings:<p><a href=\"http://www.ngpvan.com/about/jobs/senior-developer-0\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ngpvan.com&#x2F;about&#x2F;jobs&#x2F;senior-developer-0</a><p><a href=\"http://www.ngpvan.com/about/jobs/development-intern\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ngpvan.com&#x2F;about&#x2F;jobs&#x2F;development-intern</a><p><a href=\"http://www.ngpvan.com/about/jobs/qa-automation-engineer-0\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ngpvan.com&#x2F;about&#x2F;jobs&#x2F;qa-automation-engineer-0</a><p>Coderwall: \n<a href=\"https://coderwall.com/team/ngp-van\" rel=\"nofollow\">https:&#x2F;&#x2F;coderwall.com&#x2F;team&#x2F;ngp-van</a><p>Hit me up at dmiller at ngpvan dot com if you have any questions!","time":1393821284,"type":"comment"}