{"by":"jergason","id":7336224,"parent":7324236,"text":"i.TV  - New York City, Provo, Utah or remote<p>Us:<p>[i.TV](<a href=\"http://i.tv\" rel=\"nofollow\">http:&#x2F;&#x2F;i.tv</a>) is a growing second screen startup focusing on social television. Stuff we make:<p>* [tvtag](<a href=\"https://itunes.apple.com/us/app/tvtag-formerly-getglue/id377615302?mt=8\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;tvtag-formerly-getglue&#x2F;id377...</a>), an iOS app that helps people have conversations about live tv.<p>* [Nintendo TVii](<a href=\"http://www.nintendo.com/wiiu/built-in-software#/tvii\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nintendo.com&#x2F;wiiu&#x2F;built-in-software#&#x2F;tvii</a>), the TV app on the WiiU. It is a single-page app that runs on the WiiU browser.<p>* [Optik Smart Remote](<a href=\"http://www.telus.com/tv/apps/optik-smart-remote/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.telus.com&#x2F;tv&#x2F;apps&#x2F;optik-smart-remote&#x2F;</a>), an iOS and Android app for [Telus](<a href=\"http://telus.com\" rel=\"nofollow\">http:&#x2F;&#x2F;telus.com</a>). Basically the Comcast of Canada.<p>We have other fun things, like racks of servers processing live television to create and store thumbnails, tools to create games and other content around tv shows, etc.<p>We are a small-ish team of 13 engineers spread between Utah and New York. We communicate over team chat and screen-sharing to make remote people feel welcome. Our workflow is based around trust and helping developers be productive, which means flexible hours, remote friendly, loose vacation policy, whatever equipment you want among other things.<p>We are also still small enough that we don’t have tons of organized hierarchy, and passionate people can have a large impact on product, company culture, engineering practices, etc. We do 20% time, send people to conferences, and have Thursday brown bags to share things we learn. We aren’t perfect, but we try to make it a great place to be a developer.<p>Right now our backend architecture is lots of node.js, some Golang and a smattering of Python. MongoDB is our main data store, and we use RabbitMQ as a messaging layer. Our clients are built with iOS, Android, Angular, Backbone, and React among other things.<p>You:<p>We are looking for people that fit two main roles, but if you don’t quite fit but are still interested we are too!<p>1. Browser Engineer<p>* You know and love the browser platform<p>* You can use HTML, CSS and JS to build great experiences<p>* You have worked with one of the trillion browser MV-whatever frameworks<p>* You have experience with the modern web dev workflow (build tools, modular js, css transpilers, etc)<p>* You enjoy keeping up with the firehose of new developments in the web.<p>* You are willing to be taught and teach others<p>2. Senior Android Developer<p>* You have built Android apps you are proud of<p>* You have in-depth knowledge of Android platform<p>* You have experience creating&#x2F;using custom views<p>* You have experience making responsive UIs that fit all screen sizes<p>If any of our tech stack or problem domain interests you and you don’t fall neatly in to one of these roles, talk to us anyway. We are always open to good people.<p>Email jamison@i.tv to get in touch.","time":1393878597,"type":"comment"}