{"by":"mrmirz","id":7376087,"parent":7324236,"text":"LoanNow - Senior Software Engineer - Orange County, CA<p>PAYDAY LOANS ARE TRAPS<p>Imagine for a second that you have no credit card, your bank account is almost empty, and your car breaks down. You need cash and you need it fast.<p>You turn to a payday loan with an ABSURD 1000% interest rate that does NOTHING to rebuild your credit. Two weeks go by and your loan comes due. You&#x27;re in the same situation, so your roll that loan into the next loan, and the next loan – the average cycle lasts 5 MONTHS and it’s a cycle that 12 MILLION Americans live in.<p>Over a quarter million payday loans are issued EVERY, SINGLE, DAY.<p>We think there is a better way.<p>INTRODUCING LOANNOW<p>We&#x27;re a stealthy team of technologists disrupting a $15 billion slow moving giant of an industry. Everyone on our team codes and contributes on every level, front to back. We&#x27;ve built web scale products and helped scale them to tens of millions of daily active users.<p>We are ready to we go live with our beta and there will be nothing in the market that comes close. Every person we&#x27;ve showed it to smiles at how fast and easy we’ve made the lending experience.<p>But we’ve realized we need help to move even faster. We&#x27;re looking for a teammate who can come in and contribute at speed on day one, and who is world class at more than one thing.<p>You’ll be working with a team of A-players who have graduated from some of North America’s top schools and stem from companies such as Amazon, Nike, Citrix, Specific Media and Myspace. As teammates we value commitment and accountability; honing our craft; building tools to create leverage; and seeking to learn from and understand each other.<p>The ideal candidates is brilliant, passionate, and uncompromising in their pursuit of building an incredible product that will positively affect the lives of millions of Americans.<p>OUR STACK<p>Linux, Apache, MySQL, PHP 5.3+\nHTML &#x2F; CSS, AngularJS\nJava + STOMP \nAWS\nGit<p>ABOUT LOANNOW<p>At LoanNow, we believe we can change the world by helping people with less than great credit get back on track. Our loans reward you for good behavior instead of trapping you in an endless spiral of interest &amp; penalties. And we make getting a loan faster and easier than anyone else!<p>We are a very well funded stealth finance technology startup based in Orange County, CA. Our founders have an impeccable track record, which includes back-to-back Inc 500 Fastest Growing Company accolades. Our technology team includes veterans from Amazon, Nike, Citrix, Specific Media and Myspace.<p>You’ll earn a secure and competitive base salary and stock options. We also offer employer-sponsored medical&#x2F;dental&#x2F;vision coverage as well as 401(k), life, and supplemental insurance options.<p>The $15B payday predatory lending space is begging to be disrupted. We are the ones who are going to do it.<p>EMAIL hr@loannow.com","time":1394490194,"type":"comment"}