{"by":"kedargj","id":7385466,"parent":7324236,"text":"Asteria Aerospace - Bangalore, India.<p>Here is a short video about us <a href=\"http://youtu.be/3k6IL9cRDsw\" rel=\"nofollow\">http:&#x2F;&#x2F;youtu.be&#x2F;3k6IL9cRDsw</a><p>Asteria Aerospace has begun its journey with development of Unmanned Aerial Systems (UAS) and related technologies. We are one of the top three companies innovating in this space in India.<p>Our aim is to provide users of UAS products with advanced technological capabilities while making them intuitive and easy to use. We have already built our first product and have many more exciting challenges in the pipeline for which we need talented team members.<p>Image Processing Engineers<p>We are looking for Image Processing Engineers to join our Product Development team and work in a dynamic and positive environment where your contributions directly affect company performance and growth. You will be involved in exciting and challenging projects in the cutting edge field of UAS technology.<p>RESPONSIBILITIES<p><pre><code>  - Rapid prototyping of new video&#x2F;image processing algorithms and performing feasibility studies for the development of new features and applications.\n  - Develop appropriate algorithms for real-time image and video processing in order to meet the system level feature requirements.\n  - Collaborate with other engineers to optimize and translate such algorithms for software and hardware implementation.\n  - Develop appropriate test cases and perform extensive testing of the image&#x2F;video processing solutions.\n  - Document the design, development and testing of the implemented solutions.\n</code></pre>\nAPPLICATION PROCESS<p>Do you have what it takes to rise up to the challenges of building Unmanned Aerial Systems?<p>To apply, you are requested to demonstrate your curiosity and passion to solve challenging problems.<p>Can you take a stab at this one? <a href=\"http://www.gapjumpers.me/qs-427\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gapjumpers.me&#x2F;qs-427</a>","time":1394631455,"type":"comment"}