{"by":"MrGando","id":10494041,"parent":10492086,"text":"Vungle | San Francisco, CA Full-Time | ONSITE | VISA (<a href=\"http:&#x2F;&#x2F;www.vungle.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.vungle.com&#x2F;careers</a>)<p>Goal: Help us make mobile video ads not suck!\nAbout Us:\n- Leader in the Space : <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1U9FdpR\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1U9FdpR</a>\n- Profitable\n- Benefits include covering expense for Gym, Food, Travel, Relocation, and paid to work from any of our 5 international offices for 2 weeks!<p>Looking For:<p>* iOS Engineer (Senior)<p>- Join the iOS SDK team! We serve more than 1 billion impressions every month and are always trying to embrace the latest &amp; greatest that the iOS SDK has to offer to improve our whole experience. Love playing around with NSOperations? Enjoy the challenge of a memory&#x2F;cpu constrained environment? Drop us a line! (Objective-C, Specta, Carthage). We&#x27;re also the #37 most used SDK in the top 100 apps in the App Store (<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1XK4E1X\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1XK4E1X</a>)<p>* Android Engineer (Senior &amp; Non-Senior)<p>- Join our Android SDK team! Are you excited about making ads in Android awesome? We serve more than 1 billion impressions every month and it&#x27;s one of the cornerstones of our business. (Java, Graddle)<p>* Data Science and Machine Learning Engineers<p>- The Data Science team is instrumental in determining our success as a company, not just a side project. (Kafka, Cassandra, Spark, Python&#x2F;Scala)<p>* Senior Data Engineer<p>- Looking for people help scale the service-oriented infrastructure to handle over a billion requests per day. (Kafka, Cassandra, Spark, Python&#x2F;Scala)\nI&#x27;ve been with Vungle for about 6 months working on the iOS SDK team. It&#x27;s a lean environment where I can still impact technical&#x2F;business decisions. Great place to collaborate with inspired engineers from many diverse backgrounds.<p>Engineering Culture : <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1GOGQzV\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1GOGQzV</a><p>Respond or send questions to:<p>Me (Nicolas) - nicolas.goles@vungle.com<p>Recruiter (Simon) - simon.bunker@vungle.com","time":1446490017,"type":"comment"}