{"by":"chetanahuja","id":10494417,"parent":10492086,"text":"Packetzoom | San Mateo | Full-Time | VISA (H-1B transfers ok.) | REMOTE considered for exceptional cases only<p>Contact jobs@packetzoom.com or connect with me (Founder&#x2F;CEO) personally using one of the methods in my profile.<p>Mobile Networks are different. And yet we continue using the same legacy protocol stack (TCP&#x2F;HTTP&#x2F;SSL) to connect mobile devices to the cloud. We are changing this with radically new tech. If you want to help, come join us.<p>Packetzoom is rethinking the whole stack from the ground up. You get to hack network and&#x2F;or security protocols, innards of mobile operating systems and build a global distributed system around brand new protocols. It&#x27;s a small (but well funded) team so everyone contributes in everything.<p>PACKETZOOM ENGINEERING LEADER\nIf you have shipped products or built services where you (at least) actually had to deal with unix at the syscall level (either in the userspace or kernel) in C&#x2F;C++ code, we want to talk to you.<p>If you were responsible for shipping and maintaining the product for a decent amount of time, we really want to talk to you.<p>You&#x27;d be joining a small, elite team of other misfits who build and run the PacketZoom stack (<a href=\"https:&#x2F;&#x2F;packetzoom.com&#x2F;learn.html\" rel=\"nofollow\">https:&#x2F;&#x2F;packetzoom.com&#x2F;learn.html</a>) on millions of mobile client devices (iOS, Android and any others we decide to pursue) as well as our globally distributed cluster of servers running our own C++ and java code, while harvesting and processing millions of mobile perf data points in realtime while squeezing every last ounce of performance out of the hardware. If that sounds like fun to you, please do connect.<p>SENIOR ENGINEERS<p>We&#x27;re also looking for smart Software Engineers to join our team in individual roles. We&#x27;re looking for smart generalists who can dig into any given area depending on the need of the day. The areas of focus range from System level programming in C++ (supported by Java and Go), iOS and Android platform specific work (C++, Java&#x2F;ObjC),to Data Engineering and analysis at massive scale for the global mobile network performance metrics, visualization and alerting on detecting trends in said data etc. Basically a whole lot of fun for the motivated computer scientist.<p>We&#x27;re venture funded and have paying customers. Compensation will be market appropriate for your level and startups at our stage.","time":1446492335,"type":"comment"}