{"by":"jpswain","id":10493741,"parent":10492086,"text":"Sr. Scala Engineer @ NordstromRack.com&#x2F;HauteLook.com - Full-time, ONSITE in Los Angeles, CA (Downtown)<p>Requirements:\n* Talented Scala developer who excels in software design and execution.\n* Works well with team environment and is invested in making the team better and delivering the best possible product for the company.<p>Why this opportunity is really cool:\n* Get to work on massive scale: we at NordstromRack.com&#x2F;HauteLook.com represent the online&#x2F;off-price division of Nordstrom, and we are its fastest growing division.\n* Get to work with small, conversational team that is _agile_, rather than &quot;doing Agile&quot;.\n* Salary will be genuinely competitive relative to abilities and experience.\n* Get to build a lot of new stuff with:\n    * Scala: virtually all of this team&#x27;s our coding is with the Scala langauge\n        * Akka-based actor systems\n        * Lift web framework\n        * Spark\n    * We are doing virtually all development with AWS and Docker for this team. \n* Our management (all the way up to our President) is realistic about, responsive to feedback about, and invested in technology.  NordstromRack.com&#x2F;HauteLook recognizes and rewards quality results, which is unique for an established company of our size.<p>Role:\n* Compensation will be very competitive on the basis of abilities and experience.\n* Would be part of recently formed Search &amp; Personalization team that has ambitious goals for our members&#x27; ecommerce shopping experience.\n* Scale is giant, NordstromRack.com&#x2F;HauteLook.com represents the online&#x2F;off-price division of Nordstrom, which is its fastest growing division.<p>If interested, please email me your resume (and feel free to include github username) to jamie.swain@hautelook.com (hiring manager).  Of course let me know if you have any questions I can answer first too.<p>Thanks!\nJamie Swain\n@jpswain","time":1446487711,"type":"comment"}