{"by":"colindean","id":10492454,"kids":[10495978,10539815],"parent":10492086,"text":"IBM Watson | Multiple positions | Pittsburgh | Onsite | Full-time | Citizen; Visa for well-qualified candidates | Scala; Java; Python; Ruby; C; Golang; Watson Explorer<p>Want to be a part of a quickly growing product team, fueled by customers&#x27; never-ending thirst for knowledge? IBM Watson Pittsburgh has dominion over Watson Explorer and two recently released Watson Developer Cloud services: Document Conversion and Retrieve &amp; Rank. We&#x27;re a large, hilarious family seated in the heart of Squirrel Hill, a neighborhood of bonnie Pittsburgh. No office parks or egregious commutes here - unless you live waaay outside the city!<p><a href=\"http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs</a><p>Currently open:<p>* L2 Support\n* Product Management<p>There are likely to be software engineering jobs opening very soon, so bookmark this post and come back to that link in a couple of weeks. If you apply, make sure that you&#x27;ve completed the (admittedly lengthy) entire application. If I see it, I&#x27;ll respond with a thank you message!<p>Watson&#x27;s entry-level&#x2F;college graduate machine, the Blue Spark program, is running right now. <a href=\"http:&#x2F;&#x2F;www-03.ibm.com&#x2F;employment&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www-03.ibm.com&#x2F;employment&#x2F;</a> and search for `watson blue spark`. We have offices all over, in NYC, Boston, Columbus, Austin, San Jose, Raleigh, Pittsburgh, and more. If you&#x27;re graduating in December or in May, give it a shot! You can use the first link above and simply search for &quot;Blue Spark&quot; if you want me to get notified that you&#x27;ve applied.<p>I&#x27;m the software engineer tech lead on the Watson Explorer connectivity team and former consultant with the product&#x27;s Professional Services team. I&#x27;ve been around a long while and I can rightfully say that Watson group really does move quickly lives up to the &quot;startup speed&quot; thing seen in the press. Watson seems a lot different from what we&#x27;ve all thought is IBM, and I&#x27;m glad to be a part of the team keeping it that way.<p>You can read my post history for more about our interview process, our team functions, and our excellent culture that has a ridiculously high retention rate in our engineering department.<p>If you want to chat with me, hit me up on Pittsburgh Code &amp; Supply&#x27;s Slack chat (<a href=\"http:&#x2F;&#x2F;www.codeandsupply.co&#x2F;chat\" rel=\"nofollow\">http:&#x2F;&#x2F;www.codeandsupply.co&#x2F;chat</a>) or email me &lt;my hn username&gt; at us · ibm · com with &quot;Hacker News&quot; in the subject.","time":1446479415,"type":"comment"}