{"by":"TomFrost","id":10496917,"parent":10492086,"text":"TechnolgyAdvice | Nashville, TN | Full time | REMOTE &#x2F; ONSITE<p>About Us: We have a full JavaScript stack. React &#x2F; Flux on the front-end, NodeJS-centric SOA on the back. We&#x27;re independently profitable, solving awesome problems, and open-sourcing as many of those solutions as we can. Check those out on our Github (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;TechnologyAdvice\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;TechnologyAdvice</a>) -- DevLab just hit the HN front page yesterday. We&#x27;re growing by leaps and bounds and are passionate about cutting hours of research out of our friends&#x27; business technology decisions. We have a mature and productive dev culture, and get to spend most of our time working on entirely new, modern codebases, with super smart people on a team that&#x27;s 50% coast-to-coast remote.<p>Senior Software Enginer (Front-end):<p>We&#x27;re looking for engineers who are experienced with React and have a deep understanding of JavaScript. Perhaps you&#x27;re doing React in your off hours, or are building React on top of an existing tech stack. At TA, you&#x27;ll be able to work in React &#x2F; Flux &#x2F; Webpack full time. Our code base is only a few months old, so there&#x27;s no need to worry about drowning in &quot;mission-critical&quot; legacy projects.<p>Apply Online: <a href=\"https:&#x2F;&#x2F;technologyadvice.applytojob.com&#x2F;apply&#x2F;DAZ3IB&#x2F;Senior-Software-Engineer.html\" rel=\"nofollow\">https:&#x2F;&#x2F;technologyadvice.applytojob.com&#x2F;apply&#x2F;DAZ3IB&#x2F;Senior-...</a><p>Mid-to-Senior Software Engineers (Back-end):<p>We love passionate engineers. Applicants here should have a firm grasp of Node and Javascript in general, but we write microservices and use the best tool for the job, so knowing more outside of that ecosystem is heavily valued. We develop, test, and deploy in Docker, utilizing AWS for everything from hosting to message queues to our data warehouse. Our new microservices-based platform is still in its infancy, so we&#x27;d love to hear from architecturally-minded folks who love fresh design challenges.<p>Apply Online: <a href=\"https:&#x2F;&#x2F;technologyadvice.applytojob.com&#x2F;apply&#x2F;kPsEfJ&#x2F;Senior-Software-Engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;technologyadvice.applytojob.com&#x2F;apply&#x2F;kPsEfJ&#x2F;Senior-...</a><p>Product Owner&#x2F;Project Manager:<p>We&#x27;re growing like crazy and have hit the point where we need someone to help us manage a sane agile workflow. At the same time, we&#x27;re launching a whole new industry-first project, and we&#x27;re looking for a project manager who also has experience receiving feedback from customers and users both internal and external, and creating&#x2F;prioritizing user stories for the team. Technical experience is appreciated -- we&#x27;d love a PM who understands microservices, messaging queues, and enough technobabble to glean statuses from engineer chatter without a lot of pausing for explanation.<p>Apply Online: <a href=\"https:&#x2F;&#x2F;technologyadvice.applytojob.com&#x2F;apply&#x2F;QEmxsl&#x2F;Product-Owner\" rel=\"nofollow\">https:&#x2F;&#x2F;technologyadvice.applytojob.com&#x2F;apply&#x2F;QEmxsl&#x2F;Product...</a>","time":1446516638,"type":"comment"}