{"by":"rdl","id":10492714,"kids":[10493294],"parent":10492086,"text":"CloudFlare <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;</a> | San Francisco, CA; London, UK; Singapore, SG | VISA, ONSITE<p>CloudFlare is building a better Internet -- performance and security optimization at the edge. Our long term goal is to give every site the same performance, security, and reliability that major sites like Google and Facebook accomplish, without any specialized network hardware or complicated administration. We enhance over 2 million sites, including this one.<p>We&#x27;re hiring for a variety of roles -- started the year at 128, over 200 now, and hope to end around 256. This is a perfect time to join -- product market fit is established, but there&#x27;s a lot of great engineering, product, sales, and support work to be done. We&#x27;ve publicly said we&#x27;re profitable and on track for long term independent success.<p>You may wish to check out our blog to see the kinds of engineering work we do. (<a href=\"https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;</a>).<p><a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> has a listing of positions.<p>We&#x27;re always hiring for operations&#x2F;SRE, sales, general systems engineering (mostly in Go, nginx, and network, as well as DNS at scale), and web development.<p>Specific roles we&#x27;re keen to hire include:<p>0) Great operations&#x2F;SRE staff: operating our system at scale (65+ datacenters around the world, 24x7 coverage, millions of sites) requires highly competent, hard-working, and communicative engineers.<p>1) Billing engineer -- someone to take the lead as we build a new billing system.<p>2) Great front-end engineers -- building new UI&#x2F;UX to expose controls and data to customers  is an increasing portion of what we do<p>3) Principal Engineer -- owning the WWW stack which we use for control and administrative functions internally and for customers, and managing a move to a modern microservices model.<p>We&#x27;ve recently opened a Singapore office and are hiring sales&#x2F;support&#x2F;operations personnel there.<p>If you&#x27;re interested, please apply through the <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> link.","time":1446481230,"type":"comment"}