{"by":"MikeOracle","id":10498924,"parent":10492086,"text":"Oracle - Bristol, United Kingdom - Full Time (flex) - ONSITE<p>Cloud Development Team - Bristol, UK<p>Contact: michael.r.sutherland@oracle.com<p>On the back of strong public cloud product revenues, Oracle is expanding its UK presence by significantly growing its cloud development team in the center of Bristol.<p>Oracle’s Cloud Infrastructure &amp; Lifecycle team is seeking to hire experienced software engineers to develop next-generation cloud platforms, infrastructure and services. Developers in the Cloud Infrastructure &amp; Lifecycle team develop the core architecture and delivery lifecycle services to support all Oracle IaaS&#x2F;PaaS&#x2F;SaaS services and products.<p>Recruiting the best engineers is central to our strategy and we are committed to attracting the very best talent with highly competitive salaries, superb working conditions and terrific opportunities for learning and career growth.\nThe Cloud Infrastructure &amp; Lifecycle team is seeking software engineers with experience of developing cloud technology and services. Experience of Amazon Web Services, Rackspace, HP Helion, Google App Engine, OpenStack or similar environments is desirable.<p>Successful candidates will have:\n•\tExcellent programming skills using modern languages, including one or more of: Java, Scala, Python, Clojure.\n•\tRecent experience with modern build and continuous integration tools, including one or more of: Gradle, Maven, Artifactory&#x2F;Nexus, Ant, Hudson&#x2F;Jenkins, GIT.\n•\tExperience  working with *nix based  operating systems and environments.\nKnowledge of virtualization, hypervisors and containerization technologies (such as VMWare, Oracle VM, KVM, Xen, Docker, LXC) is desirable.<p>Principal Software Engineer is a senior, technical leadership role in an individual contributor capacity.  Successful candidates will typically have:\n•\tExperience working on projects in the context of complex, distributed, multi-tier architectures. \n•\tUnderstanding of cross cutting concerns (security, lifecycle, scalability and high availability) \n•\tThe ability to work on difficult, high risk, cross-team initiatives.\n•\tThe ability to provide technical leadership and to work across the full software development lifecycle.<p>Oracle has the largest portfolio of cloud products and services on the market today. Oracle’s Cloud Development team develops the core infrastructure and services that comprise and enable Oracle’s iAAS, PAAS and SAAS products and services. Successful candidates will work on the development and delivery of a wide range of cutting edge products and services including areas such as continuous delivery and deployment, lifecycle management, cloud security, compute, storage and data management.<p>michael.r.sutherland@oracle.com","time":1446551549,"type":"comment"}