{"by":"msy","id":10496904,"parent":10492086,"text":"Crowdstrike: Senior UI Engineers, full time&#x2F;permanent\nONSITE: London, LA or OC or REMOTE: Continental US\nAbove average salary + Bonus + Options\nWe’re a security startup that uses a realtime stream of data from our kernel modules on every major OS to keep out some of the world’s most sophisticated attackers. Big data like you wouldn’t believe and a whole host of fascinating engineering challenges, we’re literally changing what is possible in system security. We recently raised $100m from Google Ventures &amp; are growing fast.<p>We’re looking for JS engineers to help build the next generation of security interfaces, lots of Ember, data visualisation, animation and the opportunity to build in close collaboration with end users. We’re building a welcoming and flexible team that prizes collaboration over competition and gives everyone the opportunity to contribute to the direction of the team and the products we’re responsible for.\nDescription &amp; application below but if you’ve got questions feel free to email me (UI Lead) directly - alex dot graul at crowdstrike dot com<p><a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?aj=oF9W1fwv\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?aj=oF9W1fwv</a><p>Interested but not a UI developer? We’re hiring fast across the board:<p>Senior Data Scientists ONSITE LA&#x2F;OC&#x2F;Seattle or REMOTE US - work on cutting edge ML systems that are being used in production every day: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?38lHEhwA\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?38lHEhwA</a><p>Kernel Engineers ONSITE LA&#x2F;OC&#x2F;Seattle or REMOTE US - Join a team that includes the lead kernel developer of ReactOS building kernel modules for Windows, OS X &amp; Linux that are pushing the boundaries of what is possible: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3elHEhwG\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3elHEhwG</a><p>Cloud Engineers ONSITE LA&#x2F;OC&#x2F;Seattle or REMOTE US - Go, Scala, Kafka, Cassandra, Elastic Search and more at epic scale: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3rmHEhwU\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3rmHEhwU</a>","time":1446516462,"type":"comment"}