{"by":"pixelmonkey","id":10492305,"parent":10492086,"text":"Parse.ly - <a href=\"http:&#x2F;&#x2F;parse.ly\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly</a> - Fully Remote - Full-Time<p>Parse.ly has built a real-time content measurement layer for the entire web.<p>Parse.ly&#x27;s analytics platform helps digital storytellers at some of the web&#x27;s best sites, such as Arstechnica, New Yorker, The Atlantic, The Next Web, and many more.\nIn total, our analytics backend system needs to handle over 30 billion monthly events from over 450 million monthly unique visitors.<p>Our entire stack is in Python and JavaScript, and our team has innovated in areas related to real-time analytics.<p>Our UX&#x2F;design team has also built one of the best-looking dashboards on the planet, using AngularJS and d3.js. You can see some screenshots at <a href=\"http:&#x2F;&#x2F;parse.ly&#x2F;tour\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly&#x2F;tour</a>.<p>Our distributed team is best-in-class and we happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly dashboards on my monitors: <a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>We are currently looking for UX &#x2F; front-end &#x2F; full-stack engineers to help us build the best real-time analytics dashboard the world has ever seen. The only requirement is some experience in Python and JavaScript, with an emphasis on JavaScript.  Bonus points for an interest in information visualization, Edward Tufte, or d3.js.<p>Apply now by sending a CV&#x2F;website, github&#x2F;dribbble links (if available), and 1 paragraph intro to work@parsely.com. Let us know what part of the position interests you. Also, mention the HN Who&#x27;s Hiring thread.<p>p.s. to see an example of how we work, check out the blog post, &quot;Whatever It Takes&quot;: <a href=\"http:&#x2F;&#x2F;blog.parsely.com&#x2F;post&#x2F;46\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.parsely.com&#x2F;post&#x2F;46</a>","time":1446478347,"type":"comment"}