{"by":"m_rueg","id":10498476,"parent":10492086,"text":"KIWI.KI GmbH | Berlin, Germany | Full Time | Onsite | Frontend and Backend Engineers<p>KIWI.KI GmbH [1] is the Best Internet of Things Solution in Germany 2015 [2]. Our smart Entry System KIWI allows users to unlock\ndoors completely hands-free, with our identity token KIWI Ki or by using our KIWI App. We are well-financed and are looking\nto strengthen our awesome development team with the addition of experienced engineers for our frontend and backend.<p>• Backend Engineer: Our backend consists of many microservices and a RESTful API. We use Python 2 and 3 (Flask, Django, Kombu, Twisted), PostgreSQL, AMQP and Redis amongst others. We expect you to have strong knowledge of Python and its ecosystem, as well as competence with databases and SQL, particularly PL&#x2F;pgsql.<p>• Frontend Engineer: Our frontend consists of single-page web applications using Javascript (backbone.js, browserify, etc.), SASS and HTML5 which consume our RESTful JSON API. We expect you to have strong knowledge on modern Javascript development, HTML5, CSS3 and general web design concepts and the ability to work with code reviews (ReviewBoard), dvcs (git) and ticket tracking (JIRA).<p>Our friendly, open and international team with people from more than 19 countries in an office in Berlin Mitte offers a high degree of autonomy, challenging tasks and the ability to impact the company every day, as well as an inspiring work environment based on team spirit, fun and passion for our product.\nWe provide a stocked fridge and unlimited coffee as well as a weekly team breakfast and a team lunch.<p>Furthermore, we offer monthly and yearly bonuses tied directly to achievable targets and an employee stock ownership plan.<p>Non-native speakers are welcome to attend our weekly in office German classes. But don&#x27;t worry, we don&#x27;t expect you to speak German, as the mainly spoken language in our office is English.<p>If you need further information or can&#x27;t wait to send us your application, let Charlotte know via jobs@kiwi.ki or message us on angel.co [3].<p>[1] <a href=\"http:&#x2F;&#x2F;www.kiwi.ki&#x2F;en&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kiwi.ki&#x2F;en&#x2F;</a>\n[2] <a href=\"https:&#x2F;&#x2F;www.wallofbusiness.com&#x2F;germany&#x2F;winners\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wallofbusiness.com&#x2F;germany&#x2F;winners</a>\n[3] <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;kiwi-ki-1&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;kiwi-ki-1&#x2F;jobs</a><p>KIWI ist ein Service der KIWI.KI GmbH mit dem Sitz in Berlin. www.kiwi.ki","time":1446543941,"type":"comment"}