{"by":"bkudria","id":10493455,"parent":10492086,"text":"Clover Health, in San Francisco, is hiring full-time engineers, with a preference for Python. Job descriptions: <a href=\"https:&#x2F;&#x2F;cloverhealth.com&#x2F;about-us&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;cloverhealth.com&#x2F;about-us&#x2F;careers.html</a><p>Clover Health is a Medicare health insurance provider, which is the only way to get a complete profile of a patient&#x27;s health (since all billable items come through us). We&#x27;ve a team of RNs and other experts on the ground who are able to fill basic gaps in care that hospitals and primary care providers are not incentivized to fill. Our money comes directly from the government, and the healthier our members are, the less of it we need to spend.<p>We&#x27;ve built an awesome team of incredibly diverse and talented individuals, with background in healthcare and tech. One co-founder started a fully-integrated healthcare and hospital network in New Jersey. The other co-founder was a founding engineer and then VP of Engineering at Yammer.<p>We&#x27;re tackling a number of challenges, including integrating legacy data from numerous sources including claims&#x27; processing, lab tests results, and provider practices. We&#x27;re building data pipelines to allow our Data Science team to build models to identify gaps in care. We&#x27;re building internal tools to allow our nurses, pharmacists, and other experts to quickly see a complete picture of a member&#x27;s health, chronic conditions, interaction history, and any other relevant information.<p>There is plenty to build, but (depending on how you count) we only have 12-18 engineers. We all work in a great office in downtown SF, with all the usual startup perks. The best part of this team is the incredible diversity, and the focus we all have on fixing an incredibly broken system. Our business is structured in a way that aligns our incentives with actually maintaining the health and wellness of our members. We recently announced a $100M A led by First Round Capital [1, 2]<p>Our stack is primarily Python&#x2F;PostgreSQL, but we&#x27;re looking for anyone who is talented and has experience. If you&#x27;re interested, please send your resume to ben.kudria@cloverhealth.com, with a short note explaining why you&#x27;re interested in Clover.<p>1: <a href=\"http:&#x2F;&#x2F;www.businessinsider.com&#x2F;first-round-capital-makes-biggest-investment-ever-clover-health-2015-9\" rel=\"nofollow\">http:&#x2F;&#x2F;www.businessinsider.com&#x2F;first-round-capital-makes-big...</a>\n2: <a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;09&#x2F;17&#x2F;clover-health-a-data-driven-health-insurance-startup-raises-100m&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;09&#x2F;17&#x2F;clover-health-a-data-driven...</a>","time":1446485828,"type":"comment"}