{"by":"lancenlachance","id":10495659,"parent":10492086,"text":"GlobalSign - Portsmouth, NH - Onsite<p>Looking for Jr to Mid Level Embedded Engineers, Mid level to Sr Backend Software Developers, as well as Product Managers.<p>GlobalSign (www.globalsign.com) - one of the Internet’s original Certificate Authorities. Over the years we have issued millions of trusted Digital Certificates to people, servers and mobile devices for Public Key Infrastructure (PKI) enabled solutions and applications. Our identity and access management portfolio includes access control, single sign-on (SSO), federation and delegation services to help organizations and service providers create new business models for customer and partner interactions.<p>There are three roles in the Portsmouth&#x2F;Boston area I&#x27;m looking to fill:<p>• Embedded Systems - IoT Proof of Concept Engineer.  We have a pilot project getting off the ground, and looking for an engineer with some experience and interest in working with embedded systems.  Skills and Experience included:\nFamiliar with popular embedded platforms, industrial and consumer: Atmel (Arduino), Microchip (PIC), Motorola  (MSP), NXP (Xpresso). \nExperience with ARM Cortex based systems. Able to read and understand device &#x2F; peripheral datasheets. Good C knowledge\nHigh level language knowledge. Desirable to have embedded linux knowledge (RPi, Beagle board etc). Knowledge of IP stack desirable. Knowledge of encryption and hashing desirable. 0-4 years experience<p>• Backend Software Engineer - see: <a href=\"https:&#x2F;&#x2F;careers.jobscore.com&#x2F;jobs2&#x2F;globalsign&#x2F;senior-backend-software-engineer&#x2F;beE6wgJ4ar5imdiGalkWKP\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.jobscore.com&#x2F;jobs2&#x2F;globalsign&#x2F;senior-backend...</a><p>• IoT Product manager - I&#x27;m also looking for a junior to mid-level Product Manager who will help evolve out IoT portfolio, contributing to customer and business development, go to market strategy, and other supporting duties. The right candidate for this role will have experience and strengths in the enterprise software &amp; security market, technical sales and business development experience, and a strong technical background. 2-4 years relevant experience preferred.<p>If interested, or with any questions you can email me at lancen.lachance at globalsign.com","time":1446501970,"type":"comment"}