{"by":"secrisk","id":10498782,"parent":10492086,"text":"Security Risk Advisors • Philadelphia, PA • Full Time • ONSITE&#x2F;REMOTE<p>Security Risk Advisors is hiring: Security Consultant (Associate or Senior, depending on level of experience)<p>Company Description: Security Risk Advisors delivers technology services to leading companies in the Financial Services, Pharmaceuticals, Entertainment &amp; Media, Healthcare, Technology, Industrial Products and Consumer Products industries. The position focuses on:<p>• Web and Mobile Assessments: application security testing, enterprise policy, strategy and controls, app development standards<p>• Penetration Testing: red and blue team exercises, penetration testing for web, network, and mobile including custom product security assessments, social engineering, spear phishing and physical break-ins<p>Job Description: Candidates should possess experience in one or more of our core service areas. In addition to technical analysis, candidates should be comfortable creating presentations and reports.\nTypical projects range from 2 weeks to 2 months. Candidates should desire a fast-paced, highly varied schedule and interest in security for emerging technologies.\nTravel is expected to be 30-50% depending on assignments and specializations. Principal client locations include the Northeastern United States, with less frequent travel to the Southern &amp; Midwestern US, Europe and AsiaPac. Work arrangement is flexible, with work from home encouraged whenever travel is not required.<p>Qualifications: The following skills are preferred qualifications. Candidates are not expected to possess all of these specialized skills:<p>• Penetration Testing including Mobile, Web Application, Network, Wireless, Spear Phishing, and Physical<p>• Incident investigation and forensics<p>• Software development (including web and mobile)<p>Contact: recruit [at] securityriskadvisors.com<p>Website: <a href=\"https:&#x2F;&#x2F;www.securityriskadvisors.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.securityriskadvisors.com</a>","time":1446549337,"type":"comment"}