{"by":"montasaurus","id":10493827,"kids":[10561190],"parent":10492086,"text":"Blackcomb Software | Sarasota, FL Area | Full Time &amp; Part Time | REMOTE , INTERNS<p>Blackcomb designs software to bring the multi-billion dollar HVAC (heating, ventilation, and air conditioning), Plumbing, and Electrical industry into the next century. Our software and back office automation is being implemented at 3 of the largest HVAC companies in the US and we&#x27;re continuing to develop new ways to transform this technologically ancient vertical.<p>- Full Stack Developer:\nWe&#x27;re primarily looking for someone with an eye for great user workflow design. We really appreciate people who understand what it takes to extend that to someone working in a sweltering attic to troubleshoot a customer&#x27;s urgent issues. On the web front end, we&#x27;re mainly vanilla JS and evaluating a switch to React &#x2F; Redux. On the back end, we work with the .NET stack in C# (MVC, WebAPI, SQL, LINQ, Azure). Experience with Swift and iOS is a plus. If replacing cruft and repetitive tasks with smart software gets you as excited as we do, let us know you&#x27;re interested: <a href=\"https:&#x2F;&#x2F;www.blackcombsoftware.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blackcombsoftware.com&#x2F;jobs</a><p>- Customer Communication Designer:\nWe think communication with homeowners is an extremely important and often overlooked aspect of of a well run HVAC company. We want to keep homeowners up to date and informed about the work being performed at their homes. To do that, we place an emphasis on generating timely, informative, and visually appealing communications. These communications go out in print and digitally through emails. If you&#x27;ve ever been frustrated by a lack of actionable and timely information from a service provider and know you could design something better, let us know: <a href=\"https:&#x2F;&#x2F;www.blackcombsoftware.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blackcombsoftware.com&#x2F;jobs</a>","time":1446488413,"type":"comment"}