{"by":"PieSquared","id":10493650,"kids":[10495784],"parent":10492086,"text":"Karius | Menlo Park, CA | ONSITE, Full-time | Software (Full Stack), Computational Biology, Wet-lab Automation, Machine Learning<p>We are a team of crazy biologists, engineers, data scientists and clinicians on a mission to change forever the way infectious diseases are diagnosed and treated. We face incredibly interesting challenges in software engineering, machine learning and molecular biology, as we push the limits of diagnostics and genomic technologies.<p>We&#x27;re hiring software engineers for front-end, infrastructure, devops, bioinformatics and machine learning. Join us on the ground-level for this exciting journey to shape our technology, product and company culture.<p>If you&#x27;re an engineer who&#x27;s willing to learn about biological problems, or have experience in next-generation sequencing, feel free to contact us: greg@kariusdx.com<p>We currently use Python, Scala, Bash, and some Ruby, and have growing codebases in Haskell. If building the future of bioinformatics and wetlab automation in Haskell appeals to you, please get in touch!<p>Some of the things we’re looking for in people (not all required):<p>• Comfortable and familiar with backend and frontend technologies (MVC, Postgres &#x2F; ORMs, React)<p>• Experience with building infrastructure and devops (AWS, Puppet &#x2F; Chef &#x2F; Ansible, etc)<p>• Able to glide across the stack as needed<p>• Algorithms development background and strong understanding of practical implementation issues<p>• Deep understanding of probabilistic modeling, statistics and data structures<p>Potential responsibilities:<p>• Designing and implementing robust and scalable compute infrastructure on top of AWS<p>• Creating pipelines for analyzing, storing and visualizing complex genomic data.<p>• Research, implementation, and testing of new analysis methods in computational genomics, in particular related to sequence analysis and metagenomics.","time":1446487151,"type":"comment"}