{"by":"adamelmore","id":10498571,"parent":10492086,"text":"StatMuse, Inc. • San Francisco • Full Time • REMOTE<p>StatMuse is the fastest and easiest way to explore sports. We&#x27;re a small, well-funded team of six with great investors (TechStars, Disney), passionate users (<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;StatMuse&#x2F;timelines&#x2F;559770964406595586\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;StatMuse&#x2F;timelines&#x2F;559770964406595586</a>), and a product that&#x27;s a blast to work on. We offer competitive benefits and compensation packages, and we&#x27;re a distributed team that thrives working together remotely. Come join us and help shape the future of the product and the company!<p>• Full-stack javascript engineer -- You&#x27;ve built internet scale, consumer facing web products using the latest technologies. You have experience with React and Node. Performance and scalability keep you up at night. You&#x27;re always up-to-speed on the latest and greatest, but have a knack for knowing when it&#x27;s time to invest in a new technology. You have an eye for solid design and know when something feels off. You&#x27;re able to translate design mocks and assets with ease and accuracy. You&#x27;re located in San Francisco or you&#x27;re comfortable working remotely. Extra credit to those that have experience with universal&#x2F;isomorphic javascript, d3, and&#x2F;or datavis. Also helps if you&#x27;re into sports, though not required!<p>• DevOps Engineer -- You&#x27;ve deployed and managed internet scale, consumer facing web products on AWS. You&#x27;re a developer (not a sysadmin), but you apply your skills to operational concerns. You have experience with managing and automating configuration of MySQL database clusters. You have hands-on experience with cloud infrastructure technologies, including continuous integration tools, configuration management (Chef or Puppet), and systems monitoring and alerting. You&#x27;re located in San Francisco or you&#x27;re comfortable working remotely. Also helps if you&#x27;re into sports, though not required!<p>• Product Designer -- You eat, sleep, and breathe product. You sweat the small (tiny!) stuff. You&#x27;re an experienced visual and interaction designer and don&#x27;t mind getting your hands dirty. You&#x27;re able to put together quality mocks quickly and iterate on them based on feedback. You know when to stand your ground and are a great communicator. You&#x27;re located in San Francisco or you&#x27;re comfortable working remotely. Also helps if you&#x27;re into sports, though not required!<p>If interested, reach out to us at jobs@statmuse.com.","time":1446545913,"type":"comment"}