{"by":"umimagingjob","id":10500321,"parent":10492086,"text":"University of Michigan | Ann Arbor | Full-time | Onsite<p>This may be the only &quot;Who&#x27;s Hiring?&quot; posting this month (possibly ever?) that offers the opportunity to work directly with brain surgeons in an operating room. The Neurosurgery Department at the University of Michigan is hiring for a unique position in a lab developing tools to distinguish cancerous tissue during surgery. The HR-sanitized posting of the position is here:<p><a href=\"http:&#x2F;&#x2F;umjobs.org&#x2F;job_detail&#x2F;117286&#x2F;research_laboratory_specialist_associate\" rel=\"nofollow\">http:&#x2F;&#x2F;umjobs.org&#x2F;job_detail&#x2F;117286&#x2F;research_laboratory_spec...</a><p>...but we are really looking for someone with a software passion who wants to gain experience in a biomedical environment, perhaps as a pathway to graduate studies or medical school. A C++ background would be ideal, but any numerical computing  (Python&#x2F;NumPy, MATLAB, R, Julia) or functional (Ocaml, Haskell, Scala, Clojure&#x2F;Incanter, any Lisp...) programming experience is a plus. Experience developing in any of OpenCV, ITK, VTK, Point Cloud Library, or ImageJ would also be a plus as the position will  include microscopy, image analysis, and surgical navigation (look up &quot;BrainLab&quot; or &quot;Medtronic StealthStation&quot; to see what this looks like). At least initially, it will also require some hands-on wet-lab work (training will be provided -- the listed lab experience is negotiable). Above all, we are looking for intense curiosity and a willingness to get your hands dirty with software, hardware, and wetware.<p>I am the lab PI, and I was referred to this board by a friend who said he frequently sees HN posts asking about getting in to the biomedical field with a CS background. This job provides such an opportunity. We are a small, young, and ambitious clinical-translational lab with an extremely productive (multiple publications in a Science journal) collaboration with one of the top spectroscopy groups in the world. Do note that this is an academic lab position, so we can&#x27;t offer anywhere near Bay Area salaries. (but Ann Arbor&#x27;s QoL&#x2F;CoL ratio is absolutely fantastic!)","time":1446565848,"type":"comment"}