{"by":"carterschonwald","id":10501763,"kids":[10502543],"parent":10492086,"text":"JPMorgan •  New York City &#x2F; Brooklyn • Full Time • Onsite<p>The New Product Development (NPD) group at J.P. Morgan is seeking Haskell engineers to join our software development team. NPD focuses on high-impact and transformative technologies and solutions serving the bank and its customers, via exploratory R&amp;D leading to rapid pilot and production deployments. Successful projects are handed off to a partner line-of-business group while blocked or infeasible projects “fail fast.” You will work with a highly creative and talented team to transform how JPM does business.<p>The ideal candidate will be able to work closely with a group but also drive projects independently. Developers are encouraged to interact at every level of product development. New projects arise frequently with ample opportunity for developers to spearhead new efforts. Open source contributions are encouraged.<p>Exposure and expertise in any of the following areas is desirable:<p>·         Network engineering<p>·         Cryptography engineering<p>·         Distributed Systems<p>·         Programming language design (e.g. compilers, interpreters, development tools)<p>·         Database Systems<p>·         Software assurance &#x2F; verification (Model Checking (TLA+), QuickCheck, Jepsen, Coq, HOL)<p>·         Industrial&#x2F;production Haskell development<p>The Haskell group in NPD is focused on solutions in blockchain&#x2F;distributed databases; smart-contract DSLs; REST APIs; data anonymization; probabilistic modelling; and ML tooling. We are Haskellers who enjoy leveraging ever-more-powerful abstractions and maximal expressivity to deliver robust, correct, performant, maintainable and generally kick-a$$ software.<p>I&#x27;m one of the tech leads in the group, please email me at first name dot last name at gmail dot com if you wanna learn more ( please include a CV and perhaps a cover letter), and include &quot;functional enterprise job&quot; in the subject.<p>I look forward to hearing from you!","time":1446577586,"type":"comment"}