{"by":"anthonylukach","id":10516621,"parent":10492086,"text":"OspreyInformatics | Calgary AB Canada | UX Designer | ONSITE | Full-time or Contract<p><a href=\"http:&#x2F;&#x2F;www.ospreyinformatics.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ospreyinformatics.com&#x2F;</a><p>We are looking for a skilled and experienced User Experience (UX) Designer to join our fast-paced, innovative and rapidly growing visual monitoring SaaS company. The UX Designer will be working with product management and a team of developers to design products with rich user experience. He or she will be responsible for creating a unique and elegant interaction between users and our applications across all platforms, including mobile. The successful candidate must have demonstrable experience in translating business and user requirements into design elements and user experiences.<p>Key Skills and Responsibilities<p>* Executing interaction design as a part of a multi-disciplinary team<p>* Create user experience specifications, mockups, and prototypes<p>* Design usability testing protocols and manage testing sessions at appropriate milestones during product development<p>* Participate in product planning and sprint planning sessions<p>* UI standards &amp; best practices – maintain site UI architecture and procedures that provide consistency with respect to UI&#x2F;UX development<p>* Suggest and implement procedures to improve the UI&#x2F;UX production workflow<p>* Comfort working in a fast-paced, emerging growth environment<p>* Knowledge of user experience best practices<p>* Experience developing cross-platform user experiences (desktop and mobile)<p>* Ability to demonstrate a portfolio of work<p>* Experience working in an agile environment (desirable)<p>* Understanding of current and evolving web standards as they relate to user experience<p>How to Apply<p>Email your credentials to careers@ospreyinformatics.com. Resumes will be held on file for six months unless applicants indicate they would prefer their information be discarded once this position has been filled.","time":1446762878,"type":"comment"}