{"by":"eholmberg","id":10548509,"parent":10492086,"text":"Interactives and Website Developer • PublicSource • Pittsburgh, PA • Full Time • Onsite • <a href=\"http:&#x2F;&#x2F;publicsource.org&#x2F;jobs#developer\" rel=\"nofollow\">http:&#x2F;&#x2F;publicsource.org&#x2F;jobs#developer</a><p>PublicSource has an opening for an interactives and website developer in our Pittsburgh, PA., office. Founded in 2011, PublicSource provides in-depth and investigative news about Pittsburgh and SW Pennsylvania. We are nonpartisan and independent, with a mission of finding and writing about important stories that aren’t being covered elsewhere. We distribute our content on our website and through 50 media partners throughout the state and have an award-winning news team of five.<p>Job Description:<p>This job is part code and part design. We’re looking for someone who loves web-native storytelling, has an eye for beautiful design, and the tech skills to combine the two.<p>Duties and responsibilities:<p>This person will bring PublicSource stories to life on the web, as well as enhance our long-form and multimedia storytelling. You’ll also work to produce data visualizations and interactive maps. If you’ve got the ability and interest, we’d love for you to help build tools to make our newsroom work smarter. In this role, you are part of the newsroom, working to automate our processes. You’ll help make editorial decisions about how stories are best displayed online, what works digitally, and what doesn’t -- all the while ensuring that digital presentations function across multiple platforms.<p>You’ll leverage photography, illustrations, graphics, data visualizations, and video to create innovative and engaging visual packages. You’ll work to design individual stories, charts, and other content as needed.<p>You’ll also help with systems administration duties, such as helping us use Google Analytics for grant reports; and you’ll do light IT diagnostics with our web server; also some web optimization.","time":1447268789,"type":"comment"}