{"by":"pLuciano","id":10562583,"parent":10492086,"text":"SwipeShop • San Francisco • Technical Advisor&#x2F;CoFounder • 13%-18% FT DOE &#x2F; 1%-2% Part-Time • U.S. Only<p>SwipeShop is a peer-to-peer, mobile-first commerce platform that allows local buyers and sellers to connect and transact in a safe, social, and simple way. We took the simplicity of swipe-appraisal and applied it to discovering second-hand items in the local neighborhood. What makes us truly unique is our approach to building liquidity within a very specific and untapped market.<p>You will find more details here: <a href=\"http:&#x2F;&#x2F;www.SwipeShopApp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.SwipeShopApp.com</a><p>SwipeShop is as early stage as it gets. We bootstrapped a V1&#x2F;Beta, which we tested at 7 specific markets for 6 months. We have identified necessary changes based on focus group and consumer interactions and we are looking to bring on a technical advisor who can guide us in vetting a developer, or a lead cofounding developer who would come on and make immediate impact to the vision of the product.<p>Generally speaking, we are looking for technical talent familiar with the following aspects of app dev:\n1) Payments\n2) Data Analysis\n3) Messaging<p>Below is a more detailed look at our recruitment needs.<p>• iOS Front End -- We are looking for someone who is intimately familiar with iOS development and internals, who has an appreciation for the craft of software development and experience with making decisions that result in great products. This candidate should look at the product as his&#x2F;her own, and influence the project as such.<p>• Back-End Developer -- We are looking for a Back-End Web Developer responsible for managing the interchange of data between the server and the users. Your primary focus will be development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your coworkers into the application. A basic understanding of front-end technologies is therefore necessary as well.<p>• Android Developer -- We are looking for someone with deep knowledge of the Android framework and an equally strong intuition for pairing beautiful app experiences with beautiful code. You&#x27;ll be the architect of major features, working together with the development team to build the future of local commerce.<p>• Mobile UI &#x2F; Product Designer -- We’re seeking an original thinker with strong visual design skills ready to create a memorable user experience. You&#x27;ll take on developing the look and feel of SwipeShop on iOS, Android, and the desktop. You’ll be responsible for updating the visual design for the app and helping shape consistent guidelines to communicate a compelling user story across our products and other touchpoints. You’ll work closely with a team of engineers with a passion for making usable software.<p>See more at <a href=\"http:&#x2F;&#x2F;SwipeShopApp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;SwipeShopApp.com</a> or shoot me an email at hiring@SwipeShopApp.com","time":1447450789,"type":"comment"}