{"by":"bayonetz","id":9471352,"parent":9471287,"text":"RAND Corporation | Santa Monica - D.C. - Pittsburgh - Boston | Research Software Engineer, Data Science Engineer, and Visualization Engineer<p>We are the world’s leading think tank for policy and decision making. Read more about us here: <a href=\"http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RAND_Corporation\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;RAND_Corporation</a> or here: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1ImrPH8\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1ImrPH8</a> or here: <a href=\"http:&#x2F;&#x2F;rand.org\" rel=\"nofollow\">http:&#x2F;&#x2F;rand.org</a><p>We are looking for eager, creative folks to partner with PhD-level researchers to create cool end-to-end prototypes of research concepts.<p>You will work on project teams of research staff and domain experts and will often be the sole software engineer on the project. Our group functions a lot like an internal software development consultancy.<p>For Research Software Engineer positions, technical needs change with every project you work on. You should be a well-rounded type able to create solutions with the tools and tech that make most sense for the project. You could be writing an Angular prototype one week, Python NLP tools the next, and some social media analysis after that.<p>For the Data Science Engineer and Visualization Engineer positions, similar to above but with a focus on Hadoop&#x2F;Spark&#x2F;“Big Data” skills and visualization tech such as D3, Tableau, and R Shiny.  We have particular strategic needs in <i></i>Hadoop<i></i> and <i></i>Tableau<i></i>, so if that is you, definitely hit me up.<p>Don’t be scared! You don’t have to be a wizard yet.  The researchers provide the depth; you provide the breadth, creativity, and drive.<p>Good work-life balance compared to startups and mainstream tech companies.  20 days of vacation per year that you are incentivized to take!  Respectable salaries despite being a non-profit.  Santa Monica headquarters are a block from the ocean.  Relocation for good fits.<p>Ready yet?  Shoot me your resume at:<p>dev.hiring@rand.org<p>-Chris","time":1430489423,"type":"comment"}