{"by":"svec","id":9471531,"kids":[9476419],"parent":9471287,"text":"iRobot (<a href=\"http:&#x2F;&#x2F;www.irobot.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.irobot.com</a>) - Bedford, MA (just outside of Boston, MA) and Pasadena, CA<p>At iRobot we make robots that truly help people. Our robots help people save time by cleaning for them, save hassle by being remotely present for them, and save lives by putting themselves in harm&#x27;s way.<p>We have great work-life balance (including half-day Fridays during the summer so you can spend extra time with your family on Friday afternoons) and interesting problems to solve.<p>We blend cutting-edge research and practical engineering to build useful and affordable robots.<p>We&#x27;re looking for smart engineers who are easy to work with. You should want to help people with products you create, but a robotics background is NOT required. (I had no robotics background when I started at iRobot.)<p>iRobot is looking for software engineers, here are a few of our 20+ job openings:<p>* Embedded software engineers: We&#x27;re hiring for &quot;big embedded&quot; (C++, Linux, and big cpus) and &quot;small embedded&quot; (C, bare-metal, small cpus). If you have good OO skills (C++, Java, etc.) but no &quot;embedded&quot; background that&#x27;s okay too - shoot me an email and we&#x27;ll chat.<p>* Java software engineers<p>* iOS and Android software engineers<p>* Software engineers for vision, navigation, and mapping<p>* Test engineers<p>Check our jobs site for all positions: <a href=\"http:&#x2F;&#x2F;www.irobot.com&#x2F;us&#x2F;Company&#x2F;Careers.aspx\" rel=\"nofollow\">http:&#x2F;&#x2F;www.irobot.com&#x2F;us&#x2F;Company&#x2F;Careers.aspx</a><p>Email me directly if you&#x27;d like to know more: csvec@irobot.com<p>Please email even if you&#x27;re not sure if you&#x27;re a match; I&#x27;m always happy to talk to other HN&#x27;ers!<p>PS: We have hired people from these &quot;Who is hiring?&quot; posts, thanks to HN for this service&#x2F;forum.","time":1430490646,"type":"comment"}