{"by":"vincentg","id":9471611,"parent":9471287,"text":"Buildzoom (YC S12) - Full Stack Ruby on Rails Engineer - San Francisco. Visa ok but not H1B it&#x27;s too late :(, no remote<p>---<p>The company simplifies the process of selecting a home improvement contractor and improving the outcomes of remodeling and construction projects. \nBy gathering and analyzing information on 3.5 million licensed contractors and 50 million improvement projects, the company has brought new levels of transparency and accountability to a notoriously difficult industry.<p>---<p>In this role, you’ll be working throughout the stack to move our consumer marketplace site forward. Responsibilities will range from server configuration to front-end implementation and everything in between.<p>We&#x27;re looking for someone that will jump at the opportunity to take ownership of product features that drive traction, which will be used by tens of thousands of users each day.<p>Here are some examples of problems you’ll help us solve:<p>* Build a clean and simple user interface that sifts through millions of transactional records, allows consumers to see the current remodeling activity in their neighborhood and engage with the contractors performing the work.<p>* Implement payment processing by integrating with third party providers and implementing a scheduling and tracking system to maintain transaction records.<p>* Enhance the accuracy of our machine learning classifier, which infers what types of work contractors specialize in based off their transactional histories.<p>* Apply our pricing analysis to help consumers understand the cost and value associated with their home improvement investments.<p>Please Apply here:<p><a href=\"http:&#x2F;&#x2F;www.jobsintech.io&#x2F;jobs&#x2F;full-stack-rails-developer-buildzoom\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobsintech.io&#x2F;jobs&#x2F;full-stack-rails-developer-bui...</a><p>To know which visa you&#x27;re eligible to, please use: <a href=\"http:&#x2F;&#x2F;www.jobsintech.io&#x2F;visa_eligibility\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobsintech.io&#x2F;visa_eligibility</a>","time":1430491151,"type":"comment"}