{"by":"godawful","id":9471996,"parent":9471287,"text":"Housekeep - London, UK - Lead Developer - Full-time - on-site only<p><a href=\"https:&#x2F;&#x2F;housekeep.com\" rel=\"nofollow\">https:&#x2F;&#x2F;housekeep.com</a><p>We&#x27;re a young, funded startup with a lot to prove in the domestic cleaning market. You would be one of the first technical employees. Your job would be to do anything it takes to improve and extend our customer site, our operations systems, and our phone apps.<p>As a result, we&#x27;re looking for candidates that are excited about joining a very small team where they can make a huge difference. We are building technology to streamline every part of our business, and growing fast as a result. There&#x27;s a lot of real-time routing, scheduling and time management involved in coordinating all the work we do. And there&#x27;s a lot of skilled UI work to be done across our member&#x27;s site and operational web app, to help our staff manage everything that&#x27;s happening.<p>The role<p>We need an experienced, motivated, full-stack developer. Experience in any\nelement of our stack is a big plus, but a willingness and ability to learn fast\nis even better.<p>You would be working across:<p>- Our marketing website<p>- Our members application, where customers can set their cleaning schedule<p>- Our routing&#x2F;scheduling web application for our operations staff<p>- Our phone application for cleaners<p>These are built in:\n- Python &#x2F; Django<p>- Bootstrap, Knockout, Backbone<p>- Phonegap &#x2F; Angular<p>- PostgreSQL, PostGIS<p>We are a small, tight-knit team, so your personal qualities are just as important as your software experience. We want to work with other flexible problem-solvers who aren&#x27;t afraid of a challenge.<p>Apply directly to gareth.lloyd@housekeep.com. I&#x27;m not fussy about what you send, but if you highlight some repositories where I can read code that you&#x27;re proud of, I&#x27;ll take your application seriously.<p>Compensation: £competitive + options","time":1430493724,"type":"comment"}