{"by":"shortimer","id":9471499,"parent":9471287,"text":"Bottomline Technologies | <a href=\"http:&#x2F;&#x2F;bottomline.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bottomline.com</a> | Portsmouth, NH or South Portland, ME | Architect | Onsite Only<p>Bottomline Technologies (NASDAQ: EPAY), headquartered in beautiful Portsmouth, NH, is a global industry leader of cloud-based payment, invoice and digital banking solutions. Our solutions are used to streamline, automate and manage processes involving: payments, invoicing, global cash management, supply chain finance and transactional documents. Over 10,000 organizations throughout 77 countries, trust Bottomline to meet their needs for cost reduction, competitive differentiation and optimization of working capital.<p>The Software Architect will interface with the development team for the purpose of design and planning, implementation, integration and support of our products. This role is responsible for determining the integrated software architecture solutions that meet performance, usability, scalability, reliability, and security needs. In addition, the architect is expected to research and recommend technology to meet application requirements.<p><pre><code>    Responsibilities:\n\n    Technical review of proposed client software architectures\n    Work with development managers on implementation and integration work estimates\n    Custom JEE application design and architecture\n    Custom JEE application implementation and implementation team leadership\n    Application performance testing, recommendations and tuning\n    Design, lead and perform custom JEE application solutions throughout dev lifecycle\n    Maintain a baseline of IT&#x2F;JEE industry knowledge to advise on technical trends \n</code></pre>\nApply at <a href=\"https:&#x2F;&#x2F;home.eease.com&#x2F;recruit2&#x2F;?id=9491081&amp;t=1\" rel=\"nofollow\">https:&#x2F;&#x2F;home.eease.com&#x2F;recruit2&#x2F;?id=9491081&amp;t=1</a>","time":1430490387,"type":"comment"}