{"by":"QTtech","id":9471608,"parent":9471287,"text":"QUESTRADE INC. | PRODUCTION SUPPORT ANALYST, WINDOWS OR LINUX | TORONTO, CANADA (CONTRACT OR FULL-TIME)<p>Questrade is a rapidly growing online financial service firm in Canada. Our mission is to help Canadians achieve financial independence by offering our clients with great investment products, cutting edge technologies, and quality customer service throughout. We offer self-directed trading platforms for Do-It-Yourself Investing, as well as professionally managed portfolios at ultra-low fees.<p>---- ABOUT THE POSITION ----\nAs a Production Support Analyst, you will provide 3rd tier technical production support for mission critical brokerage applications and databases. In addition, you will timely investigate and troubleshoot incidents, support issue resolutions database, be involved into configuration and installation of applications. You will work with development, QA and infrastructure teams to understand applications and resolve incidents.<p>-- ABOUT YOU ---\nYour technical expertise comes from your BS degree and 3 or 4+ years of related technical experience supporting critical production systems. You possess strong Linux or Windows administration and troubleshooting skills, and have working knowledge of at least one Windows or Linux shell scripting language. You have an understanding of Sybase, MS SQL Server, or MySQL, as well as a working knowledge of networks, routers, TCP&#x2F;IP and UDP protocols. Your investigation, analysis, and problem-solving skills are well-developed, and you understand change and configuration management processes. You remain focused and do not lose sight of the smaller details, even under pressure. You play well with others and understand the importance of strong organizational and communication skills with other technical teams. Have a passion for the financial services industry and FinTech? Even better!<p>Wanna know more? Check out this and more of our opportunities: <a href=\"http:&#x2F;&#x2F;www.questrade.com&#x2F;why-questrade&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.questrade.com&#x2F;why-questrade&#x2F;careers</a>","time":1430491148,"type":"comment"}