{"by":"aui-hn","id":9471414,"kids":[9521115],"parent":9471287,"text":"AmazonUI (AUI) team at Amazon - Seattle or San Francisco - Full time - On-site only - Relocation packages available<p>AUI is the Front-end platform being adopted on Amazon.com. We are modernizing the company&#x27;s front end code base, while diving deep on latency, performance, API design, user experience, and cross browser&#x2F;device compatibility. Basically, we need people who can build libraries, not just use them.<p>Our team is incredibly customer centric. For any given situation, we have to make the right choice on behalf of the folks using our platform -- and we have to do it at scale. That may sound cliche, but within the next hour AUI will be used to generate tens of millions of page views. And that&#x27;s just in the US. Worldwide, we&#x27;re used on about 90% of requests across all device categories.<p>It&#x27;s a lot of responsibility, but also a lot of opportunity. For example, we can run experiments that change almost every page on Amazon.com. We can also impact the page load time for the entire site. Have you ever tried to figure out why your site is 6ms slower? We have.<p>We use these tools (but don&#x27;t expect you to know all of them):\nHTML, CSS, JavaScript, Ruby, Java, Perl, Git<p>And to give you an idea of who you will be working with, the folks responsible for these articles are on our team:\n<a href=\"http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;44698559168&#x2F;breaking-down-amazons-mega-dropdown\" rel=\"nofollow\">http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;44698559168&#x2F;breaking-down-amazons-mega-...</a>\n<a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2011&#x2F;09&#x2F;02&#x2F;amazon-coms-big-redesign-is-arriving-soon&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2011&#x2F;09&#x2F;02&#x2F;amazon-coms-big-redesign-is...</a><p>If you&#x27;re interested, drop us an email. Heck, you can even drop us an email if you&#x27;re in Seattle or San Francisco and you just want to have coffee:<p><pre><code>    function getEmailAddr( company ) {\n        company = company.replace(&#x2F;\\.com$&#x2F;i, &quot;&quot;).toLowerCase();\n        return String.fromCharCode(97, 117, 105, 45, 104, 110) + &quot;@&quot; + company + &quot;.com&quot;;\n    }</code></pre>","time":1430489880,"type":"comment"}