{"by":"jeffepp","id":9471622,"parent":9471287,"text":"Ambassador - Detroit, MI - FULL TIME<p>No &#x27;Series A&#x27; crunch here!  We&#x27;re venture-backed, cash-flow positive and looking to grow our 20 person team to 50 over the next 8-9 months.<p>Ambassador enables businesses turn their customers into brand ambassadors. We&#x27;re changing word-of-mouth on the web. <a href=\"https:&#x2F;&#x2F;getambassador.com\" rel=\"nofollow\">https:&#x2F;&#x2F;getambassador.com</a>.<p>We focus on the rapid production, testing, and deployment of beautiful code and design. We make our product team&#x27;s job as creative and simple as possible. No outdated management models, we get real work done and solve large problems. Success is measured through the enjoyment of our customers.<p>=========\nThe Perks\n=========<p>* Food - Whether you&#x27;re vegan or on a macrobiotic diet, we&#x27;ll make sure you&#x27;re covered. Friday lunches are a pastime.<p>* Benefits - Competitive salary, options, and healthcare. Happy faces every morning.<p>* Play - You&#x27;ll want a paddle at your desk to fight off incoming table tennis balls. Ninja backhand required.<p>==========\nJoin our ranks\n==========<p>Backend Web Engineer<p>Our REST API is our bread and butter and the heart and soul of Ambassador&#x27;s products, meaning you&#x27;ll always be on the forefront of product development. A passion for writing elegant and efficient code is a must as is experience in any # of modern scripting languages and frameworks. Experience with Python and Django is preferred. Knowledge of Django Rest Framework is a plus.<p>Frontend Web Engineer<p>You&#x27;ll have a wide-ranging experience across various products, bridging the gap between design and reality. You should have an eye for good design and UX, experience in either is a huge plus. Your JavaScript, HTML, and CSS skills must be top-notch, and you should already have experience working in JavaScript frameworks such as Angular. Experience with UI toolkits such as Bootstrap and preprocessors such as LESS are a plus.<p>UX&#x2F;Visual Designer<p>Your work must delight not only our customers but also our ambassadors, giving you the opportunity to design for two very different audiences. We also promote various one-off projects and marketing efforts for which you&#x27;d have the opportunity to collaborate. You should have a proven track record of working on software teams and designing beautiful interfaces that are also functional and serve both business and user needs.<p>For more information, check out <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;ambassador\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;ambassador</a>","time":1430491239,"type":"comment"}