{"by":"bjelkeman-again","id":9472626,"parent":9471287,"text":"Akvo Foundation - akvo.org - AMS, Amsterdam, Netherlands (and DC, LON, STO, OUA, NBO, DEL, BLR, SIN and more)<p>Akvo develops open-source software which we run as a service, which is used mainly in international development across Central America, Africa, Asia and the Pacific. We build data collection, mashup, management, visualisation and publishing tools. We work with thousands of NGOs, many UN organisations and countries. Our tools get used in everything from disaster response to environmental preservation.<p>We are hiring:<p>- UX designer - Helsinki (primary), Amsterdam, London, Stockholm, Bangalore (REMOTE possible for the right candidate)<p>- Senior technical services consultant - Amsterdam<p>- Senior devops engineer - Location: Amsterdam, London, Stockholm or Bangalore<p>Full descriptions here: <a href=\"http:&#x2F;&#x2F;akvo.org&#x2F;about-us&#x2F;working-at-akvo&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;akvo.org&#x2F;about-us&#x2F;working-at-akvo&#x2F;</a><p>UX designer<p>We are seeking a skilled, self-motivated, proactive and energetic UX designer. Working closely to the lead designer and product managers, your primary responsibility will be to grow concepts through design exploration, ideation and user validation. Your core skills are in product design and interaction design.<p>Senior technical services consultant and coordinator<p>As a technical services consultant and coordinator you work together with our partner teams and technical consultants to help implement and integrate Akvo’s tools with our partner organisations’ systems.<p>Senior devops engineer<p>Akvo seeks a senior DevOps engineer with leadership experience to initially lead our small Infrastructure team and later expand this to include live support team members. The role will have a mixture of hands-on work to maintain and expand our growing technology infrastructure as well as leadership and management of our infrastructure needs over the coming years.","time":1430497837,"type":"comment"}