{"by":"capkutay","id":9473050,"parent":9471287,"text":"WebAction | Downtown Palo Alto, CA | Big Data Platform Engineer (Java), UI Engineer (HTML&#x2F;CSS&#x2F;JS&#x2F;Backbone), UI&#x2F;UX Designer<p>jobs@webaction.com<p>WebAction is a Big Data Analytics Platform providing end-to-end real-time, streaming analytics. We mask complex, scalable analytics behind a visual, interactive web-based experience and a familiar declarative SQL-like language. Today, our end-to-end product is used to solve some of the toughest analytics challenges at large Telco, Finance, Retail, and Cloud companies.<p>Big Data Platform Engineer (java): Using open source tools like ZMQ, Elasticsearch, and Kafka in harmony with platforms built-in house you will build cutting edge data processing infrastructure<p>Senior Front-end Engineer: <a href=\"http:&#x2F;&#x2F;chj.tbe.taleo.net&#x2F;chj04&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o..\" rel=\"nofollow\">http:&#x2F;&#x2F;chj.tbe.taleo.net&#x2F;chj04&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a>.<p>Front-end Engineer: <a href=\"http:&#x2F;&#x2F;chj.tbe.taleo.net&#x2F;chj04&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o..\" rel=\"nofollow\">http:&#x2F;&#x2F;chj.tbe.taleo.net&#x2F;chj04&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a>.<p>UI&#x2F;UX Designers: We don&#x27;t have a job post up yet, email me at john@webaction.com if you are interested! Bonus for you design unicorns who use code to build prototypes<p>WebAction is founded by a team of Silicon Valley executives with a track record of creating multiple successful enterprise products including WebLogic (now Oracle WebLogic) and GoldenGate software (now Oracle GoldenGate). We&#x27;ve raised north of $11m since 2013 and our advisors&#x2F;board have done amazing things like creating the Apple logo and founding one of the top VC firms in Silicon Valley. With every product release, we delight our customers and engage new ones at an ever-growing rate. We&#x27;re based in Downtown Palo Alto, minutes away from the caltrain, philz coffee, and everything you need to make your work life convenient and comfortable.","time":1430501066,"type":"comment"}