{"by":"Zuph","id":9473057,"parent":9471287,"text":"Location: Louisville, Kentucky<p>The company I work for, Techshot (<a href=\"http:&#x2F;&#x2F;techshot.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techshot.com&#x2F;</a>), is currently looking to fill a couple of positions. We&#x27;re a small contract engineering firm located just outside Louisville, in Greenville, Indiana. We focus on high-tech development, with most of our contracts coming from the government. We do a ton of work for NASA, DoD, NHS, and others, in addition to corporate and start-up clients.<p>We&#x27;ve been in business for 25 years, sent multiple payloads up on the Space Shuttle, built several new medical devices, and spun off a business making rugged LED lighting. We recently sent a payload up to the ISS, and we&#x27;re under contract to deliver several more! With only 36 employees, it&#x27;s a great work environment, with lots of schedule flexibility, and freedom to &quot;go your own direction&quot; with projects. We&#x27;re currently looking to fill two positions: A Software Engineer and a Machinist.<p>Machinist Posting (<a href=\"http:&#x2F;&#x2F;techshot.com&#x2F;documents&#x2F;Machinist%20Posting%201_19_15.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;techshot.com&#x2F;documents&#x2F;Machinist%20Posting%201_19_15....</a>)<p>Looking for a general purpose machinist who can turn parts around rapidly when necessary. We shop out a lot of stuff, but sometimes we need to make things quick. If you have less experience than requested, but can demonstrate the ability to learn quickly, it&#x27;s still worth applying.<p>Software Engineer Posting (<a href=\"http:&#x2F;&#x2F;techshot.com&#x2F;documents&#x2F;Software%20Engineer%203_13_15.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;techshot.com&#x2F;documents&#x2F;Software%20Engineer%203_13_15....</a>)<p>Any software engineer would need to be reasonably comfortable with low-level interfacing with hardware. Embedded development experience a huge plus. Our software interacts with lower-level embedded device we&#x27;ve developed in-house, giving users a nice front-end interface, and offloading some of the heavy computational lifting.<p>I&#x27;m an Electrical Engineer here, and I can pretty confidently say that it&#x27;s a great job for a technically curious engineer. There isn&#x27;t a lot of opportunity to move &quot;up the management chain&quot; within the company, but the work environment is super-flexible, the projects are technically interesting and challenging, and the current team is intelligent and motivated.<p>If you have any questions about the company, job postings, or would like to submit your resume&#x2F;cover letter, send me an email, bluyster@techshot.com.","time":1430501147,"type":"comment"}