{"by":"johnhess","id":9473166,"parent":9471287,"text":"KnowledgeHound (knowledgehound.com) | Boston\nEngineering Intern<p>Deploy real-world code to production week one.  Develop code and your skills.  Spend some time in the sun, working in Boston and Cambridge.<p>WHAT WE DO:\nWe build KnowledgeHound, a data search and exploration tool, on top of some fantastic technologies.  We&#x27;ve got a real product, real revenue from Fortune 500 clients and real investment.  We&#x27;re looking to add some more interns &amp; developers to that mix.<p>COME WORK FOR US IF:<p><pre><code>   - You believe that work doesn&#x27;t need to be all consuming to be productive and fulfilling,\n\n   - You are committed to getting better at your craft every single day (tell me how you do it!),\n\n   - You want to get your hands dirty in a real code base (sorry, powerpoint doesn&#x27;t count as work here),\n\n   - You thrive on flexibility not micromanagement and\n\n   - You&#x27;ve built something real (class or side projects or previous internships are great examples)\n</code></pre>\nWHAT&#x27;S THE SUMMER GOING TO BE LIKE?\nWe&#x27;ve got a backlog of new features&#x2F;bugs, and we&#x27;re overhauling one of our major systems.  We want you to join hands with the rest of our tech team and deliver production code.  Just like everyone else, you&#x27;ll pull a new bug&#x2F;feature from the queue, work with anyone else necessary (e.g. our world-class designer, Joe) and put together a pull request.  I&#x27;ll be a personal resource and I&#x27;m dedicated to learning and to teaching.  If you hit a snag or don&#x27;t know the best way to do something, we&#x27;ll work on it together.<p>We are a collaborative team.  We count on everyone to think critically, bring ideas for improvements and champion those ideas.  In other words, &quot;We <i>do</i> pay you to think.&quot;  Be a part of designing our product and our business.<p>WHERE IS THIS PLACE?\nI&#x27;m currently our entire Boston office (there are another half a dozen of us at the home office in Chicago and one on the West coast).  On that account, we don&#x27;t have a permanent office here yet.  I&#x27;m planning to spend the summer working from co-working spaces, coffee shops, home, and places in the sun.  I like to alternate between working surrounded by great people and taking a full day somewhere quiet to knock out some &quot;real work&quot; (writing code).  If that sounds better than the cube farm, email me (john@knowledgehound.com).","time":1430502163,"type":"comment"}