{"by":"gabesmed","id":9473350,"kids":[9475662,9506287,9475392,9475181,9473595,9478436],"parent":9471287,"text":"Nava - Washington DC<p>I&#x27;m part of a small team of expats from Silicon Valley that came out to DC last year to help fix healthcare.gov. (Mostly Stanford, Google, Y Combinator folks) We&#x27;ve learned a ton, and see an opportunity to create software that radically improves how our government serves its people - we&#x27;ve started our company, Nava, to chase that vision.\nIn the last 6 months, we&#x27;ve launched 2 major projects:<p>- App 2.0, the new insurance application for healthcare.gov. It&#x27;s processing 70% of apps coming through the marketplace, and: converts 35% more people than the old app, gets them through in half the time, is mobile-friendly (20% of apps), sits on robust, scalable infrastructure, etc etc. It was the first system that CMS (Centers for Medicare and Medicaid Service) ever hosted on Amazon AWS.<p>- Scalable Login System (SLS), the new identity management system for healthcare.gov. Sadly, the main achievement here is that the system is actually up and available, unlike its predecessor. It&#x27;s now saving the taxpayer $70M in annual maintenance costs.<p>Here&#x27;s a Wired article from last summer about us: <a href=\"http:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;06&#x2F;healthcare-gov-revamp&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wired.com&#x2F;2014&#x2F;06&#x2F;healthcare-gov-revamp&#x2F;</a><p>We&#x27;re just starting on a few major new projects that have a huge potential to improve our government. We have the technical experience to do things the right way, and the relationships and trust inside government agencies to get things done. Our momentum is strong, the problem is important, and we&#x27;re looking for good people.<p>If you&#x27;re the type that would get fired up about reimagining broken government experiences and technology, please drop us a line at jobs@navahq.com, we&#x27;d love to hear from you!<p>Specifically, we’re looking for:<p>- a product manager with a technical background<p>- a senior devops engineer<p>- a senior full-stack engineer","time":1430503486,"type":"comment"}