{"by":"chatterleyp","id":9474439,"parent":9471287,"text":"Birmingham UK \nDevOps Engineer, Cloud\nTalis is a fast growing SAAS enterprise software company that is changing the way Universities globally engage with their students, and we are now looking for a DevOps engineer to work closely with our Development team on ensuring that we have the best tools for the job and we automate as much as possible.<p>Our infrastructure can range from big data tools such as Hadoop, Cloud services such as AWS and tool sets like Puppet, Ansible and Chef, but its really about that ability to work with the development team and build streamlined processes that enable faster and better systems for everyone.\nREQUIREMENTS<p>Strong Sys admin skills in Linux and cloud systems - AWS especially<p>Good experience with scripting tools, Python, Ruby, PHP<p>Good experience of databases especially MongoDB or other NoSQL systems.<p>Proven experience of working with automation of infrastructure especially in a 24&#x2F;7 SaaS environment<p>Knowledge of Puppet, Chef, Ansible, and the HTTP protocol.<p>A problem solver, able to get to the root of a problem<p>BENEFITS<p>Although our offices are based in central Birmingham, all of our roles allow a degree of home working depending on specific requirements as set by your peers and reports.<p>100% employee owned – every employee shares in the value of the company through our options scheme\nFlexible working hours and location – although we are small we have people on three continents and at many locations across the UK.\nTransparent reporting – every team communicates progress weekly to everybody – and you are free to ask questions or make suggestions.\nHack events every quarter – for the whole company not just dev – our latest projects included a custom-built arcade machine, internet-enabled milkbot built into our fridge and hacking the walls with custom graphics.\nBeautiful Grade II listed offices in the heart of the Jewellery Quarter, Birmingham.\nLearn more about what it is like to work at Talis.\nCareers.talis.com","time":1430513550,"type":"comment"}