{"by":"Clairesheng","id":9518796,"parent":9471287,"text":"Wiredcraft (<a href=\"http:&#x2F;&#x2F;wiredcraft.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com&#x2F;</a>) -- One of our offices: Shanghai, China<p>We build products at the intersection of technology around data. Lots of data visualization, big data and infrastructure. We work with large organizations on challenging problems (the World Bank, the United Nations, CNN) OR on our own products (mostly developer tools, things like <a href=\"http:&#x2F;&#x2F;devo.ps\" rel=\"nofollow\">http:&#x2F;&#x2F;devo.ps</a> or <a href=\"http:&#x2F;&#x2F;sweepboard.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sweepboard.com</a>).<p>We are a multicultural team with French, American, British, Chinese, Korean, Dutch and Finnish colleagues. We are about to settle a third office in NYC this year. We work a lot with Javascript (node.js, AngularJS), Python, occasionally Go and Erlang. Lots of single page apps, APIs and infrastructure automation.<p>- Sales director (freelance + FT); You would be involved with the following sales responsibilities: -Scale our existing sales channels, -Develop new sales channels, -Build up new partnerships, -Develop new business opportunities, Keep in mind that we provide both services and product, both of which you would likely get a chance to help us with.<p>- Project manager; We&#x27;re looking for somebody to help us lead and ship our projects and products. <a href=\"http:&#x2F;&#x2F;wiredcraft.com&#x2F;jobs&#x2F;project-manager&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com&#x2F;jobs&#x2F;project-manager&#x2F;</a><p>- Designer director; you have design chops, understand technology (HTML&#x2F;CSS...) and do more than nice pictures (content,strategy,color,theory,...). <a href=\"http:&#x2F;&#x2F;wiredcraft.com&#x2F;jobs&#x2F;design-director&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com&#x2F;jobs&#x2F;design-director&#x2F;</a><p>- Online marketing intern (Shanghai or NYC); we&#x27;d love some help with growth hacking our products and marketing our services like there&#x27;s no tomorrow. \n<a href=\"http:&#x2F;&#x2F;wiredcraft.com&#x2F;jobs&#x2F;online-marketing-intern&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com&#x2F;jobs&#x2F;online-marketing-intern&#x2F;</a><p>Drop me a line at job@wiredcraft.com, or go to <a href=\"https:&#x2F;&#x2F;wiredcraft.typeform.com&#x2F;to&#x2F;GG4GQz\" rel=\"nofollow\">https:&#x2F;&#x2F;wiredcraft.typeform.com&#x2F;to&#x2F;GG4GQz</a>","time":1431231918,"type":"comment"}