{"by":"ClarkyKentt333","id":9530415,"parent":9471287,"text":"Riot Games | EU | Engineers|VISA OK\nRiot is actively building engineering teams from leadership level to hands dirty individual contributors. Particularly interested in quantitative traders&#x2F;market store&#x2F;risk store architects, J2EE Platform architects and uber low latency&#x2F; hi avail scalability focused talents, talents that have worked with NOSQL,general open source dev, Coherence,\nweb apps, Go, and are product and end user focused engineers.[vs shiny pretty tech for techs sake only]<p>Agile architecture &amp; design, software components and architecture, data architectures &amp; distribution. focus languages can be [but not limited to] Java, C#, C++, REST, XML, JSON, a wealth of exotic database technologies. multithreading,  infrastructure and connecting pieces, service middleware + micro-services.<p>Massively collaborative and can find passion for delivering SAAS&#x2F;GAAS<p>This is a faily unique scenario where globally, the Company services +70M players a good proportion playing daily, and at appreciable concurrency yet we are building the European engineering presence from near scratch.<p>League of Legends and its global e sports ecosystem is humbled to be one of a handful of global products that doesn&#x27;t require heavy handed performance marketing tactics,\nthe community is passionate, are strong advocates and the company&#x27;s internal talents, equally so about serving and providing ongoing upwards trending value to their players. Riot enjoys direct and robust conversations with its players and vicerally listens to them.<p>Feel free to reach out directly to me if you&#x27;re curious. we are looking for entrepreneurial minded experienced engineers at this time at high mid through leadership level.\nIf you are tired of justifying &quot;what&#x27;s the ROI on that&quot; when you come up with a consumer focused awesomesauce solution, and If all of this sounds a lot like you please feel free to reach out:\ncwesterman@riotgames.com","time":1431422532,"type":"comment"}