{"by":"paladin314159","id":16057125,"parent":16052538,"text":"Amplitude Analytics | San Francisco, CA (SOMA) | <a href=\"https:&#x2F;&#x2F;www.amplitude.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amplitude.com</a> | ONSITE<p>We help companies build better products by providing analytics for understanding user behavior. We believe that the future of product development is in smart and easy-to-use analytics, not the complex data science stacks or surface-level vanity metrics of today. We&#x27;re a 100-person company (&lt; 20 engineers), and we raised our Series C last summer. We&#x27;ve gotten incredible traction helping customers like PayPal, IBM, Capital One, Twitter, Microsoft, and Square Enix change the way they build products.<p>We have many open positions that can be found here (we&#x27;re growing fast!): <a href=\"https:&#x2F;&#x2F;www.amplitude.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amplitude.com&#x2F;careers</a>. In particular, we&#x27;re looking to grow out the engineering team with the following positions:<p>* Senior Backend Engineer<p>* Senior DevOps Engineer<p>* Senior Frontend Engineer<p>Our tech stack consists of Java, Python, Redis, Kafka, PostgreSQL, Elasticsearch, Docker, SaltStack on the backend and JavaScript, React, Flux, Highcharts, d3 on the frontend. We&#x27;ve got a number of extremely challenging technical problems to solve thanks to being in the analytics space, and we&#x27;re looking for talented people who are passionate about the intersection of technology and product to help us take the next step.<p>We only hire the best engineers and pay very competitive salaries. Also, we don&#x27;t do whiteboard interviews! Bring your laptop, and be prepared to write code the way you expect to on the job -- in a familiar working environment with access to the internet.<p>If this sounds interesting to you, please reach out to us at careers@amplitude.com or apply directly through <a href=\"https:&#x2F;&#x2F;www.amplitude.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amplitude.com&#x2F;careers</a>.","time":1514937847,"type":"comment"}