{"by":"mkong1","id":16055493,"parent":16052538,"text":"GiveCampus (YC S15) | Full-Stack and Front-End Engineers | DC, SF | ONSITE, FULL-TIME | <a href=\"https:&#x2F;&#x2F;www.givecampus.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.givecampus.com&#x2F;careers</a><p>GiveCampus is a Y Combinator-backed company that builds fundraising software for educational institutions. We&#x27;re tired of schools being stuck with crappy software that never changes, and we&#x27;re working to bring actual innovation to the space, and solve the hair-on-fire problems fundraisers face.  Our mission is to help our partners advance the quality, the affordability, and accessibility of education.<p>Michael Seibel, CEO of YC, expects us to be a household name in the next few years: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13896296\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=13896296</a>. We were also covered by the Washington Post last year (<a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;19&#x2F;colleges-are-going-online-to-crowdsource-donations-and-theyre-raising-millions&#x2F;?utm_term=.16ba309e4c4c\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;1...</a>), and have more than 6x the number of schools using us since that article was published.<p>We&#x27;re still a small team, so if you&#x27;re looking to join a fast-growing startup and have an immediate impact, we&#x27;re looking for both full-stack (Ruby on Rails, Postgres) and front-end engineers with at least 2 years of professional experience. Our current team was previously with Facebook, Amazon, and Intel. Please no recruiters or dev shops.<p>Reach out to careers@givecampus.com with a bit about why you&#x27;re passionate about education, and a project you&#x27;ve working on that you&#x27;re particularly proud of.","time":1514926263,"type":"comment"}