{"by":"jsmeaton","id":16056188,"kids":[16147101,16056636],"parent":16052538,"text":"Kogan.com | Full Stack Developers, Front End Engineers, Back End Engineers | Full Time | Melbourne, Australia | ONSITE | <a href=\"https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;</a><p>Kogan.com is a pioneer of Australia&#x27;s online retail industry and Australia’s largest pureplay online retailer. \nOur software engineering team have end-to-end responsibility from idea to launch for all kogan.com built apps - \nincluding Kogan.com and dicksmith.com.au as well as purchasing optimisation and other internal applications.<p>We see our high volume, large scale apps as an exciting opportunity for innovation and revolution - both in technology and \nbusiness. We welcome new technologies, ideas and ways of working. To give you an idea on our stack we use Python and \nDjango on the backend; React on the frontend and tools&#x2F;technologies such as: Elasticsearch, AWS, Trello, Docker, Postgres, \nRedis and eClaire (our open-source Trello card printer for our physical wall <a href=\"https:&#x2F;&#x2F;github.com&#x2F;kogan&#x2F;eClaire\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;kogan&#x2F;eClaire</a>).<p>We run an Agile practice - adhering to our processes and refining them through retros. Check out what some of our \nengineers have written: <a href=\"https:&#x2F;&#x2F;devblog.kogan.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;devblog.kogan.com&#x2F;</a>. Our careers page has a pretty good rundown on our team and hiring \nprocess: <a href=\"https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.kogan.com&#x2F;software-devs-engineering&#x2F;</a>.<p>Our in person interview is generally focused on debugging \na python script or javascript on a laptop, with full access to google&#x2F;docs&#x2F;tools you prefer. We want you to succeed. \nWe&#x27;re interested in how you get there. If you&#x27;ve got any specific questions about our team or process I&#x27;ll be happy \nto answer below.<p>We&#x27;re looking for juniors, seniors, and everything in between. If you’d like to apply, send an email \nto dev.jobs@kogan.com with the subject line beginning with &quot;HN: &quot; and some content about who you are.","time":1514930551,"type":"comment"}