{"by":"nolloh","id":16055833,"parent":16052538,"text":"Brave + Basic Attention Token | Sr Software Engineer, Sr UX Designer, Product Lead (Browser), many more | San Francisco | Remote and Onsite opportunities | Full-time<p>Brave is on a mission to fix the web by giving users a safer, faster and better browsing experience – while growing support for content creators through a new attention-based ecosystem of rewards. Brave is free open source software, founded by the inventor of Javascript and co-founder of Mozilla. We all care deeply about privacy, security and the Internet.<p>In mid 2017 we started the Basic Attention Token project to radically improve the efficiency and privacy of digital advertising. You can learn more about it at <a href=\"https:&#x2F;&#x2F;basicattentiontoken.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;basicattentiontoken.org&#x2F;</a>.<p>Currently we’re hiring for over a dozen roles among blockchain, engineering, product and research. I’ve listed a few below and you can find the full list at <a href=\"https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;</a>.<p>Senior Software Engineer, Backend (REMOTE OK) - Brave is looking for an experienced Senior Software Engineer to work on back-end systems to support our desktop and mobile browsers. Our tech stack includes: NodeJS, Go, Ruby, Postgresql, MongoDB, Redis. Details: <a href=\"https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=894442\" rel=\"nofollow\">https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=894442</a><p>Automation and Infrastructure Engineer (REMOTE OK) - We are seeking engineers with a strong sense of best practices and principles including infrastructure as code, security baked in and devops as a culture - not as a team. You will work closely with our browser development team to revamp our continuous integration pipeline for browser releases. Details: <a href=\"https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=968506\" rel=\"nofollow\">https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=968506</a><p>Senior UX Designer - We are looking for a seasoned UX designer to join the Brave design team. In this role, you will design and implement delightful product experiences for Brave’s wide range of user types by applying your own proven product design abilities. Details: <a href=\"https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=946299\" rel=\"nofollow\">https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=946299</a><p>Product Lead, Brave Browser - We’re looking for a product lead for the Brave Browser, a cross-platform, privacy and performance oriented web browser which also serves as a frontend to the Basic Attention Token ecosystem. We’re especially interested if you have experience balancing privacy, security and usability. Details: <a href=\"https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=941656\" rel=\"nofollow\">https:&#x2F;&#x2F;brave.com&#x2F;jobs&#x2F;?gh_jid=941656</a><p>Feel free to email me directly at steven@brave.com ;)","time":1514928327,"type":"comment"}