{"by":"jameswilsterman","id":16052861,"parent":16052538,"text":"Volley (YC W18) | San Francisco | Lead Javascript Engineer &#x2F; Head of Engineering | ONSITE | Full Time | $120-$150K (+ equity)<p>Apply: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;volley&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;volley&#x2F;jobs</a><p>Website: <a href=\"https:&#x2F;&#x2F;volleythat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;volleythat.com</a><p>Volley develops voice-controlled games and entertainment for Amazon Alexa and Google Home.<p>We are the #1 voice-first game company with 10+ titles and exponential month-over-month growth. We&#x27;ve raised from top institutional investors in the gaming industry and we are starting Y Combinator in early January.<p>We are seeking a Lead Engineer or Head of Engineering to build out game engines and design the backend infrastructure for our games. You will help us conceptualize and build proprietary voice-controlled game engines, scale our infrastructure from hundreds of thousands to millions of users, and manage other engineers in a collaborative small-team environment. Founders are both technical from Harvard and Stanford.<p>Our software stack includes:<p>-- AWS Lambda (Node.js)<p>-- AWS DynamoDB<p>-- Alexa Skills Kit<p>-- Google Cloud Functions<p>-- Firebase<p>Stuff you may have done before:<p>-- Game development<p>-- iOS &#x2F; Android development<p>-- Engineering role at a gaming company<p>-- Engineering role at a consumer software company<p>-- Engineering management experience<p>-- AWS experience<p>-- Serverless Lambda experience<p>-- Alexa &#x2F; Google Home &#x2F; voice interface experience<p>Check out our top rated games for Alexa:<p>-- &quot;Song Quiz&quot; (<a href=\"http:&#x2F;&#x2F;songquiz.com\" rel=\"nofollow\">http:&#x2F;&#x2F;songquiz.com</a>) - A name-that-tune music trivia game in which you must correctly identify the title and artist of popular songs.<p>-- &quot;Yes Sire&quot; (<a href=\"http:&#x2F;&#x2F;yessire.com\" rel=\"nofollow\">http:&#x2F;&#x2F;yessire.com</a>) - A choose-your-own adventure story-driven game set in a medieval castle.","time":1514910462,"type":"comment"}