{"by":"kenashcraft","id":16056771,"parent":16052538,"text":"Calico Life Sciences | Full Stack Engineer | South San Francisco | Full-time | Onsite | Visa<p>At Calico (an Alphabet company), we’re using cutting-edge biology and machine learning to understand aging and age-related conditions like cancer, heart disease, and Alzheimer’s—to help people live healthier, longer lives. This is an interdisciplinary, long-term effort at a nimble startup with a firm financial footing. Here is NYTimes coverage of a recent Nature paper from Calico scientists: <a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2017&#x2F;11&#x2F;22&#x2F;science&#x2F;youth-cells-aging-worms.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2017&#x2F;11&#x2F;22&#x2F;science&#x2F;youth-cells-aging...</a><p><i>Who you are:</i> \nYou’re an expert React developer who enjoys working in a team environment and collaborating closely with a fellow React-proficient UX designer. You’re excited to use the latest technologies like GraphQL, Apollo, Flask, SQLAlchemy, MySQL, Apache Airflow, Docker, and Google Cloud Platform. You obsess over software usability and great design. You want to help people live healthier lives for longer.<p><i>Who we are:</i> \nWe’re a close-knit group of engineers, scientists, and UX designers with diverse backgrounds. We believe that such diversity is critical to understanding our users and building great software. Our scientists and computational biologists all sit within walking distance, making it easy to work with them to learn and iterate rapidly.<p>Our software organizes, processes, and visualizes the data generated by Calico scientists, accelerating their basic and translational research. Join us to make a difference in understanding the biology of aging and developing interventions to help people lead healthier lives.<p>Apply at <a href=\"http:&#x2F;&#x2F;www.calicolabs.com&#x2F;career&#x2F;?c=uBkzZqY2Uq&amp;t=full-stack-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.calicolabs.com&#x2F;career&#x2F;?c=uBkzZqY2Uq&amp;t=full-stack-...</a> or email ken [at] calicolabs.com","time":1514934671,"type":"comment"}