{"by":"phantomas1234","id":16053973,"parent":16052538,"text":"NNF Center for Biosustainability | Full Stack Engineer | Copenhagen Denmark | ONSITE | VISA<p>Full-stack Developer for Synthetic Biology Platform<p>The focus of The Novo Nordisk Foundation Center for Biosustainability is synthetic biology and strain design. Living cells are being genetically modified in order to produce chemicals in a sustainable way. The list of things that can be made by engineered strains includes biofuels, bioplastics, drugs, food supplements and much more.<p>Engineering a living cell is an incredibly hard task. Mathematical and computational models are being developed in order to make computer-aided design of biology possible. The project we are hiring you for is about building a web platform to provide easy access to metabolic models so the development of new strains becomes faster and cheaper. The platform already has the capabilities of modifying cells right in your browser window and constraining the models with real experimental data in order to gain insights about cell metabolism. You can get more information about the project at <a href=\"http:&#x2F;&#x2F;dd-decaf.eu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;dd-decaf.eu&#x2F;</a>.<p>We are looking for a full-stack developer with a strong focus on the frontend. You will be dealing with biological concepts every day, discovering the best ways to operate with genes and biochemical reactions. Deep understanding of biology is not a requirement though, most of the developers in the institute were able to gain the necessary knowledge after joining the team. Our technology stack at the moment is<p><pre><code>  * AngularJS (ongoing migration to Angular 5), Angular Material, Typescript\n  * Python3.6 for the backend services (aiohttp framework) and core scientific libraries\n  * Postgres, MongoDB, Redis, Neo4j\n  * Docker\n</code></pre>\nFor more information and application submission, please visit <a href=\"http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;about&#x2F;job&#x2F;job?id=3b130d96-edbd-49af-a707-4fd77355a28d\" rel=\"nofollow\">http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;about&#x2F;job&#x2F;job?id=3b130d...</a>","time":1514917454,"type":"comment"}