{"by":"andreatavour","id":16066203,"parent":16052538,"text":"Tavour | Seattle, WA | Full-Time, Onsite Only | www.tavour.com<p>Tavour is looking for a VP of Engineering to lead all product development and engineering functions. This is a rare opportunity to join at an early stage of an already profitable company. As a member of the executive team reporting to the CEO, you will help Tavour scale its products into a world class e-commerce experience. Growing our business is now almost exclusively dependent on architecting and delivering highly scalable products. You will recruit and develop the best e-commerce in a data-driven culture where we test everything and don’t take anything for granted.\nPreferred Qualifications:<p>- 7-10 years of software development experience, preferably at a tech startup\n- 4+ years of engineering management experience\n- Shows a bias for action to drive self and team to achieve results that delight customers\n- Fancies doing projects at half the time that most others would project and looks for creative solutions to achieve results\n- Understands cloud technologies and services and how to leverage them to build a exceptional software development organization\n- Knows how to implement A&#x2F;B testing and data driven approaches into product development\n- Can empower and enable engineers to demonstrate full ownership of customer problems\n- B.S. in Computer Science<p>Compensation range $110-$130K plus equity.<p>About working at Tavour: Tavour is a already profitable 8 figure business that is looking to grow to a $100M business in the next 3 years. Tavour has achieved profitability with a minimal venture raise and is thus still a great opportunity for anyone looking to join an early stage opportunity. Tavour prides on providing exceptional benefits including:\n-Equity Participation\n-Health Insurance\n-Paid Vacation\n-401K\n-Commuter and&#x2F;or Parking\n-Fitness Membership\n-Paid Maternity and Paternity leave<p>We are an equal opportunity employer and value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<p>Interested in applying directly? Send your resume and an introduction to andrea@tavour.com.<p>Cheers!","time":1515020097,"type":"comment"}