{"by":"xd_gov","id":16109279,"parent":16052538,"text":"xD | Washington, DC | Full-time | Onsite or Remote | Salary: GS-15 (fed government pay scale)| Backend Dev (experienced)<p>About xD<p>xD is a startup in the U.S. Census Bureau that works with internal partners and other agencies to build experimental data products. We build products that challenge the status quo of how agencies leverage their public data. To meet the growing demands of business and technology, we work closely with our agency partners to deliver new and exceptional product experiences to their constituents.<p>Position<p>We’re hiring a Backend Web Developer to help us build amazing products with our agency partners.<p>We’re looking for someone who is:<p>* Passionate about working on high-impact projects that further the public good<p>* Able to thrive in rapid development cycles<p>* Self-directed and able to set goals independently<p>* Excited to teach and learn new techniques<p>* Enthusiastic about building open-source software<p>* Skillful at communicating technical concepts to a non-technical audience<p>As a Backend Web Developer with xD, you will be responsible for:<p>* Building back-end information systems, including APIs and web applications<p>* Planning or contributing to sprint-planning meetings, stand-ups, and retrospectives<p>* Using version control, specifically Git and GitHub<p>* Writing software tests and adhering to test-driven development<p>* Designing relational database architecture and writing performant SQL queries<p>* Writing in modern, open-source scripting languages such as Ruby and Python<p>* Developing web applications using open-source frameworks such as Ruby on Rails<p>* Deploying and administering web application servers<p>* Building with scalable search technologies such as ElasticSearch or Solr<p>* Working with large data sets, including scaling their handling and storage<p>Apply<p>To apply, please send your resume to luke.keller@census.gov with the subject “Backend Web Developer Application.&quot; Make sure your resume includes links to example projects and source code.","time":1515527486,"type":"comment"}