{"by":"nschader","id":16101147,"parent":16052538,"text":"Front Porch | Front End Developer | Full-time | Sonora, CA (Local or Remote)\nPlease Submit resumes to nschader@frontporch.com\nWe are looking for a skilled Front End Developer (local or remote) to work on a brand new user interface for our recently acquired Get More Math product. Get More Math was developed by a math teacher to provide cumulative, personalized learning for every student and promote long-term retention. You will be working with a small, agile team on the interface that teachers use to manage their classes.\nWho we’re looking for\n* You have ambition to grow as a developer and learn from your peers\n* You are proactive and know how to take responsibility\n* You can work in fast-paced teams\n* You keep up to date with the latest developments in web technologies\nThe Ideal Candidate Will Have:\n* 5+ years of experience as a Software Engineer with a focus on UI and firm understanding of front-end best practices\n* Experience with React.js\n* Experience with functional reactive programming\n* Experience with SQL\n* Experience using Git and Github within a team\n* Experience working in an agile development environment using SCRUM or Kanban\nBonus Points If You Have:\n* Experience with Java, Typescript, Postgres, Redux, Next.js\nWhat we offer\n* Professional development\n* A competitive salary\n* 401K, Health, dental, vision, and life insurance options for employees and family\n* Paid Time Off, Paid Holidays\n* Work remote (U.S. based) or local in our newly remodeled office\nAbout us\nFront Porch employees treat one another like extended family members. Our company leaders demonstrate strong values, including a commitment to family, innovation, team building, and helping employees achieve their full potential. Our employees enjoy company-sponsored training, employee appreciation and team building events, casual dress code, flex time, and an ideal mixture of challenging work in a relaxed and creative environment. We work hard, and the rewards are great. More info about Get More Math can be found at <a href=\"https:&#x2F;&#x2F;getmoremath.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;getmoremath.com&#x2F;</a>.","time":1515449212,"type":"comment"}