{"by":"buf","id":5803952,"kids":[5811139],"parent":5803764,"text":"Rentify - Software engineer (Ruby on Rails) FT, Shoreditch, London, UK<p>Hi everyone. I've just moved to London from San Francisco (I was previously at Eventbrite) to join a growing startup called Rentify. Over the last month, the ruby community has been an impressive to me, packed with smart ambitious people who are full of enthusiasm.  So if anyone is interested in something new, please read on!<p>About Rentify\n- We’re a small tight-knit team of 11 that wants to change how rentals are done. The rental industry is old, antiquated, and ready for a push. Rentify wants to be the one stop tool shop for landlords. We think we have the right recipe, and so does Balderton Capital, who invested in us for our Series A.<p>- We don’t do deadlines, or assign your day to day work to you, or tell you how to get it done, or make your decisions. Read more about it here:<a href=\"http://engineering.rentify.com/post/47385480838/in-engineers-we-trust-to-get-shit-done\" rel=\"nofollow\">http://engineering.rentify.com/post/47385480838/in-engineers...</a><p>- We’re all hungry for success.<p>Responsibilities:<p>- Lead by example – by writing good code, talking about good code, and then drinking beers with the team about all the good code that was written<p>- Design and development of new product features and enhancements<p>- Communicate with non-engineers to define requirements and deliverables<p>- Know what technologies are out there in case you need to use them<p>- Periodically teach your co-workers all the great stuff you learned via tech talks, brown bags, blogs, or open source<p>Requirements:<p>- You ideally have Ruby on Rails experience.<p>- You want to work in a startup (a.k.a. a place that works hard and plays hard)<p>- You feel comforted when you write a good unit test<p>- You must have a Bachelor’s knowledge level of computer science via education or experience<p>- You know when to use what kind of data store<p>- You have to be able to travel to central London every day<p>Perks:<p>- Unlimited vacation (seriously no one counts)<p>- Equity in Rentify<p>- Food and drinks available in the office 24/7<p>- Feel free to crush your co-workers on our N64 and pool table. We’re probably going to build a nap room too because I need a snooze once in a while.<p>- We provide whatever tools you need to succeed like the latest hardware and educational material<p>- Be a part of a collaborative team that sits in an open environment (read: no politics) who previously worked at companies like Eventbrite, Uber, Universal, and Apple<p>To apply, just ping me at buford@rentify.com","time":1370095006,"type":"comment"}