{"by":"Ovid","id":5803800,"kids":[5805249,5803916,5804212,5821028],"parent":5803764,"text":"Hanover, Germany. Work Permit/Blue Card and Relocation Assistance Provided.<p>Looking for strong Perl developers for a company in Hanover, Germany. They're stable, profitable and they've been in business for years. Hanover is a beautiful, bike-friendly, mid-sized town in the north of Germany. The cost of living is low and the quality of life is high. It's a green-friendly town and hosts one of the largest Oktoberfests in the world. While we're listing \"desired\" skills, keep in mind that the company is happy to be flexible on most of this so long as you can convince them that you can help improve their systems:<p><pre><code>    - You have a strong Perl, testing, and refactoring background. \n      You'll be helping them transform legacy systems into modern ones.\n    - You have experience with AJAX, SOAP, REST and other Web technologies.\n    - You have good relational database experience, preferably\n      MySQL (what a surprise!)\n    - You understand that Object Oriented code is more than just using\n      Moose or blessing a reference.\n    - Familiarity with Linux\n    - You speak English. German's a plus, but not mandatory.\n    - You don't drool on your t-shirt.\n</code></pre>\nIn return:<p><pre><code>    - A competitive salary and strong job security (always profitable,\n      very low employee turnover)\n    - Top-notch equipment\n    - Shared offices to two or three devs -- no open plan\n    - Offices in downtown\n    - Flexible and fair working hours\n    - 30 days vacation!\n    - Get sent to conferences (if you want)\n</code></pre>\nWhy Hanover?<p><pre><code>    - An active local Perl Mongers group.\n    - Lots of asparagus!\n    - 500k people\n    - University town\n    - Greenest city in Germany (forest, lake, parks, rivers)\n    - Great transportation\n    - Low rent and low cost of living!\n</code></pre>\nYour job will not just be to hack Perl. You'll be actively working to help modernize their systems and improve standards. You'll have a high level of responsibility. In return, you get to enjoy a friendly, beautiful city and culture. Take a two week road trip across Europe and still have a month's vacation when you get back to work.<p>Send email to jobs at allaroundtheworld dot fr.","time":1370092255,"type":"comment"}