{"by":"nemesisj","id":5803897,"kids":[5804506,5805960],"parent":5803764,"text":"Administrate (<a href=\"http://www.getadministrate.com/\" rel=\"nofollow\">http://www.getadministrate.com/</a>) Edinburgh, Scotland. Full Time. Remote work OK after initial \"break in\" period.  We build online software for training companies that helps them run their entire operation.<p>---------<p>We're looking for a full time developer from our fantastic offices at the Edinburgh Tech Cube (<a href=\"http://www.techcu.be\" rel=\"nofollow\">http://www.techcu.be</a>) with spectacular views of Arthur's seat and the Meadows.<p>Remote work is fine after a \"burn-in\" period of a few months (we've got engineers happily working from Spain and Brazil at the moment) but we'd like to get to know you in person first!<p>Detailed job description can be found on our about page (<a href=\"http://www.getadministrate.com/about\" rel=\"nofollow\">http://www.getadministrate.com/about</a>), look on the lower right.<p>We're using a combination of technologies:<p>- Crufty old PHP (being refactored), and newer PHP (Doctrine)<p>- All new development is being done with: Python, SQL Alchemy, Flask, and AngularJS using the Bootstrap UI framework<p>We're looking for smart people that get things done using the above techs, and who want to join a small company, have lots of responsibility, and work in a very challenging environment.<p>------------<p>If you're debating sending us your CV, we've hired two top devs from these threads in the last 6 months, and we don't mind hiring people who have never completed university or don't look great \"on paper\".<p>We're growing really quickly, have a small team, a challenging product that's mission critical for our clients, and we're located in one of the most beautiful cities in the world with remote workers across the Central Belt of Scotland (and beyond).<p>If you're outside the EU, we can look into visa sponsorship in very special cases, but this can be a long and difficult process, particularly for the UK. Sorry.  Email me if interested, my name is John: jjp@getadministrate.com","time":1370094143,"type":"comment"}