{"by":"United857","id":5804724,"parent":5803764,"text":"Amobee -- Silicon Valley -- H1B, Intern, Full-time<p>I'm the technical lead at Amobee on our PULSE 3D platform, looking to disrupt the way we consume and create mobile advertising. We're looking for developers on HTML5, WebGL, iOS, and Android to build the next generation of rich media as well as touch-based content creation tools from the ground up.<p>We believe that ads should actually be fun; as fast, interactive and personalized as the best games and apps. That's why we built the world's first 3D platform for display advertising. Our startup, AdJitsu, was acquired by Amobee almost a year ago. Our team continues to operate like an autonomous startup, with the added benefit of our parent company's resources.<p>Our PULSE 3D platform combines WebGL (or native OpenGL on iOS) with HTML5 to create a designer-friendly environment for building interactive experiences powered by programmable shaders. You can have a look at some of our ads here: <a href=\"http://amobee.com/3d\" rel=\"nofollow\">http://amobee.com/3d</a><p>As a startup within a startup (we're a team of six people including three engineers with a lot of autonomy), you'll have the chance to own and solve problems such as:<p>* Build the next generation of realtime rendering and user interaction on mobile \n* Rethink content creation tools, from the ground up, for multi-touch interfaces \n* Design immersive, sensor-driven user experiences for clients \n* Analyze billions of data points from user interaction<p>We touch everything from SIMD assembly and fragment shaders, to Hadoop and Pig, and almost everything in between. Objective C, C++, HTML 5, Javascript, WebGL, Python, git and more are tools we use every day.<p>Our client include brands like BMW, Samsung, Autodesk, and Nokia. Our team brings experience from Apple, Cooliris, Dreamworks, Microsoft, Namco Bandai, NVIDIA, Ubisoft, and more. We're backed by the likes of Accel, Sequoia, and Singapore Telecom.<p>If this whets your appetite, get in touch with me at markw at amobee dot com and let's talk!","time":1370105214,"type":"comment"}