{"by":"marshallk","dead":true,"id":5804352,"parent":5803764,"text":"Platform Engineer at social data mining startup Little Bird\n<a href=\"http://getlittlebird.com/blog\" rel=\"nofollow\">http://getlittlebird.com/blog</a><p>Little Bird is looking for a full-time platform engineer to join our development team in Portland, Oregon. You will collaborate with smart and passionate colleagues to help make the server, database, processing, and logic of our innovative web application shine.<p>About Little Bird<p>Little Bird offers technologies and services to help our customers grow their knowledge, influence, and business in today’s complex and noisy social world. Whether you're looking to quickly understand who matters in topics that vary as widely as data science or ceramics, engage with the thought leaders in neuroscience or digital story-telling, or monitor the entire field of web comics or astronauts, Little Bird is ready. We're a small team of eight, based in Portland, Oregon, and are expanding quickly thanks to strong investment, prominent recognition, and a growing customer base.<p>Essential Responsibilities<p>* Able to communicate effectively with other development team members as well as with all other Little Bird team members.\n* Able to work independently when given a clear mission.\n* Able to ask for help when stuck.\n* Able to ground work within user experience and technical contexts and priorities based on Little Bird’s overall business and technology goals.<p>Qualifications<p>Required\n* Several years of engineering experience.\n* Knowledge of Ruby and Ruby on Rails or Sinatra, as well as template languages such as ERB.\n* Familiarity with database query languages and experience with databases like MySQL, CouchDB, and/or MongoDB.\n* Experience with API data retrieval.\n* Excitement to live the startup life.<p>Desired\n* You want your data endeavors to exceed Abraham Wald's statistical insights during World War II.\n* You've worked through Leonhard Euler's Königsberg bridge problem.\n* You can eyeball a function and tell what will happen when it scales from processing ten objects an hour to one million objects an hour.\n* You can look at code and tell whether programmers were happy/frustrated/drunk when they wrote it.<p>To apply<p>Please submit an email with the following links/docs to jobs@getlittlebird.com<p>* A short introduction to yourself and why you want to work for Little Bird\n* A PDF of your resume/CV and/or link to your Linkedin page\n* Link to your github repository\n* Link to your twitter account<p>Applications close Wednesday, June 5th","time":1370100720,"type":"comment"}