{"by":"derricki","id":5804650,"parent":5803764,"text":"Salt Lake City, UT - Lucidchart<p>Lucidchart is building world class graphical applications in the browser and on mobile devices. We're rapidly growing in every dimension of the business and need people of all experience levels to join the product development team. Talent and ability to learn are more important than specific skills.<p>BACKEND SOFTWARE ENGINEER (all experience levels) - Lucidchart runs with various decoupled services in a Linux environment using Scala, MongoDB, AWS, and MySQL. At Lucidchart your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly available, secure, and scalable.<p>Requirements:\n* Talent<p>Recommended experience:\n* Building large products / applications\n* Scala or Java\n* MySQL or other relational database\n* NoSQL databases (MongoDB especially desirable)\n* Opscode Chef or Puppet\n* Cloud computing (AWS)<p>FRONTEND SOFTWARE ENGINEER (all experience levels) - We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements:\n* Talent<p>Recommended experience:\n* Building large products / applications\n* Javascript\n* Google Closure compiler/library\n* CSS/HTML/DOM manipulation\n* jQuery\n* node.js\n* Native app development on Android and/or iOS<p>SYSTEMS ENGINEER - At Lucidchart your responsibilities would include working as an engineering team member to create and operate highly available, secure, applications by building continuous integration, deployment, monitoring, and cloud management solutions.<p>Requirements:\n* Talent<p>Recommended experience:\n* Delivering devops solutions\n* Cloud management tools such as Puppet or Chef\n* AWS\n* MySQL\n* Linux expertise (preferrably Ubuntu)\n* node.js\n* Shell scripting\n* Software engineering<p>All applicants email resumes to jobs@lucidchart.com.","time":1370104420,"type":"comment"}