{"by":"lamplightr","id":5804216,"parent":5803764,"text":"Toronto - REMOTE<p>Operations Engineer<p>Uken is looking for a talented Operations Engineer to work with our development and ops team to manage and improve our rapidly growing infrastructure.  This role is open to remote employees working from anywhere in the world.<p>You'd be working on meaningful things like:<p>- scaling our infrastructure to handle millions of concurrent users;<p>- enabling fast, reliable, user experiences by measuring and optimizing across the entire technology stack;<p>- automating tasks and streamlining processes to easily manage a growing 140+ server farm;<p>- working closely with developers to roll out new functionality and build internal tools;<p>- providing high reliability as part of our 24x7 on-call schedule.<p>Your background should include:<p>- experience scaling web applications with very large user bases through automation;<p>- a passion for measuring and optimizing everything;<p>- working knowledge of scripting, including a language like ruby;<p>- strong sysadmin skills, including linux, networking and security.<p>It'd be a big plus if you have:<p>- the ability to measure and optimize performance across our entire technology stack;<p>- hands on experience with Ruby on Rails;<p>- experience managing and optimizing databases;<p>- proven experience working independently (if working remotely);<p>- experience with some of the technologies we use: ruby, rails, nginx, unicorn, mysql, redis, memcached, jenkins, chef, nagios, github, aws.<p>About Us<p>Uken is one of the only true cross platform gaming companies around. We build fun social and mobile games that make people stare, smile, jump, and feel awesome inside. We have a quirky nerdy culture that fosters creativity, collaboration, quality ideas, and a data driven mindset. We believe in moving quickly and improving constantly and that mantra is reflected in the weekly updates we make to our games and internal technologies. We have an appetite for pushing technical boundaries and we’ve done exactly that with HTML5. We work on products that are used by millions of people everywhere and we’re just getting started.<p>More info at <a href=\"http://uken.com\" rel=\"nofollow\">http://uken.com</a>","time":1370099211,"type":"comment"}