{"by":"wellingtonwu","dead":true,"id":5804309,"parent":5803764,"text":"Python Engineer - Philadelphia, PA - Relocation Assistance Provided.<p>50onRed operates a premium ad network and serves over billions of online ad impressions each month. We work with large advertisers such as Groupon and eHarmony, and develop innovative products to monetize many of the web's largest shopping, dating, and social websites.  50onRed was recognized by Philly.com as one of the best places to work in Philadelphia.<p>We want Python Engineers to join our team that are smart, passionate and thrive on the challenges of building scalable software in a high-volume, big data world.  Our core platform handles over 5 billion (with a \"b\") transactions per day and Python is a key ingredient in making that all possible.  If that gets you excited, we should talk.<p>As part of our team, you will be surrounded by best-in-breed software engineers who are well versed in not only Python, but also with Java, PHP, AWS, and NoSQL... (not to mention ping-pong and craft brews!)  We work hard on tackling the challenges of big data and we have fun doing it.<p>Qualifications:<p>-Commercial Python development experience (more than just scripting)\n-NoSQL, MongoDB, or other \"big data\"\n-Comp Sci background and strong competencies in data structures, algorithms and scalable software design\n-Ability to alternate between different development tools and languages - no one trick ponies welcome here!\n-Energetic and passionate about technology\n-Desire to work with an amazing group of devs, engineering backend applications that are the core of our business!<p>Perks:\n-Friday summer hours\n-Catered lunch\n-Fully stocked kitchen\n-Competetive Bonus Plan\n-So much more!<p>Email recruiting@50onRed.com if you are interested.<p>This position is based out of Philadelphia, PA and located conveniently by 30th Street Station.  We have a beautiful view of the city line, art museum, and we're part of the heart of the growing Philadelphia technical community.  We offer relocation assitance and can even provide temporary company housing.","time":1370100219,"type":"comment"}