{"by":"amitt","id":5807522,"kids":[5811155],"parent":5803764,"text":"Union Square, San Francisco, CA. Full-time. Full-stack Engineer, All Levels.<p>Red Hot Labs (RHL) is looking for full-stack engineers at all levels that want to work on cutting edge mobile games and services for other mobile developers.<p>=Responsibilities=<p><pre><code>    - Write both server and client-side mobile code for iOS and Android apps. \n      (We can teach you this!)\n    - Actively learn and work with new technologies. There’s a very good chance \n       you’ll pick up experience with a new language / technology stack here!\n    - Collaborate closely with myself and the rest of our team to develop \n      products and services with a high quality user-experience. \n    - Architect and own big parts of our infrastructure. \n\n</code></pre>\n=Your skills=<p><pre><code>    - REQUIRED: CS degree or significant experience in a low-level language (C, C++). \n         - We're trying to hire smart folks that have a solid CS foundation.\n    - REQUIRED: Prior experience working with Javascript required.\n    - REQUIRED: Ability to pick up new languages and frameworks quickly.\n    - PREFERRED: Prior experience developing either business intelligence or games.\n    - PREFERRED: Prior mobile experience in either iOS or Android.\n\n</code></pre>\n=Why Red Hot Labs=<p>We’re a small 6-person FUNDED startup founded by the guys who made FarmVille and CityVille. We’re building mobile games and supporting services that we think are missing from the mobile ecosystem. This is not our first startup; our last one was acquired by Zynga and led to them being able to IPO using our core-tech and games.<p>Our company culture is one built on learning and the belief that everyone is a student and everyone is a teacher. We want to work with folks that inspire us to learn more and do our best work. We invest in our employees and want to help you grow in both your core skill-set and other areas you may be interested in. We can afford to do this while we’re small.<p>We focus on shipping quickly and constantly (our first game was built in 6 weeks with no pre-existing client-side code), so this is a great place to experience shipping multiple products. Our product development process is a full-team collaborative one based on a healthy balance of metrics and design intuition. We care A LOT about good design and are always striving for putting out products we’re proud of both technically and visually.<p>Our tech-stack is built on accelerating the ability to ship. We’ve developed a unique client/server architecture that we use for all of our apps that allows us to write new backend connected mobile apps without having to write modify any server code. This backend combined with our unique embedded-JS frontend allows us to deploy fully featured cross-platform apps very quickly. Our first-game was featured on Google Play and was built in about 6 weeks.<p>=Perks=<p><pre><code>    - WORKCATIONS! We’re a small company so we do unscalable things such as \n      rent a house for the whole team and spend a week working from a Ski-house Tahoe \n      or in a beach-house in Hawaii. \n    - Early-stage startup equity grants\n    - Health/Dental/Vision insurance\n \n</code></pre>\n=Our stack=<p><pre><code>    - An advanced client-side architecture written in C++ and \n      using embedded-JS bound to Objective-C/Java for our iOS and Android apps.\n    - Redis, Couchbase, Rails for our backend API.\n    - Mostly AWS with a little bit of Heroku for our hosting.\n    - AngularJS, jQuery, Underscore for our dashboard and web apps.\n    - 3rd party services: Twilio, Mailgun, Mixpanel, Crittercism, Testflight\n\n</code></pre>\n=Relevant press=<p><pre><code>    - About our culture: \n      http://gamesauce.org/news/2013/05/31/red-hot-labs-sons-of-zynga-forge-bridge-to-the-beyond/\n    - About our strategy:    \n      http://blogs.wsj.com/venturecapital/2013/02/28/zynga-veterans-red-hot-labs-says-can-cut-game-development-time/\n    - About our funding: \n      http://techcrunch.com/2013/02/28/red-hot-labs/\n\n</code></pre>\n=Applying=<p>Send an email to jobs+HN@redhotlabs.com with a little bit about yourself and what you’re looking for in a new role and we can chat a bit more about what we’re up to in detail. We look forward to speaking with you!<p>-Amitt (Founder/CEO)","time":1370152755,"type":"comment"}