{"by":"curveship","id":5809177,"parent":5803764,"text":"Durham, NC<p>Concrete Data is looking for an experienced .NET developer for systems integration and ground-up development projects. This is a full-time contract opportunity expected to last approximately 3-4 months, with a possibility of a longer engagement. Technologies include C#, ASP.NET MVC, CSS, Knockout, SQL Server 2008 and 2012, Windows Server 2008 and IIS. Familiarity with Java is a plus but not essential, as is domain expertise with enterprise project scheduling, capital asset management or cost accounting business processes.<p>This position is based in our office in downtown Durham, NC. We are not looking for a remote work arrangement at this time; please respond only if you are able to work onsite.<p>Strong candidates will have at least 6 years of experience developing .NET applications, will be experienced with Entity Framework or other ORM tools, will be experienced at estimation, architecture and design, and will have a track record of delivering high-quality code in a dynamic and client-centered environment.<p>If you enjoy delivering high-quality code with little supervision, are able to deliver great software to clients and are looking for a dynamic, exciting environment, we want to talk with you!<p>Learn more about us at www.concretedata.com.<p>Required:\n4 years experience with .NET development using C#, SQL Server and ASP.NET\nExperience with .NET 4.0 and/or 4.5\nStrong HTML and CSS knowledge\nExperience with Javascript frameworks, such as Jquery, Backbone or Knockout\nExperience building and interacting with .NET web services<p>Desired:\nASP.NET MVC, Knockout, Entity Framework experience\nExperience with Primavera P6, Microsoft Project or other commercial project scheduling tools\nExperience with cost accounting applications\nExperience integrating custom and commercial applications for enterprise clients<p>Principals in the Raleigh/Durham metro area only, please.<p>edit: forgot to add that inquiries may be sent to me: adam dot haile at concretedata dot com.","time":1370192028,"type":"comment"}