{"by":"ps4_ui_job","id":5809086,"parent":5803764,"text":"San Francisco (SoMa). Sr. Front-End Engineer. Local. H1B Transfer.<p>PlayStation 4, JavaScript Expert.<p>Sony Network Entertainment (SNEI) manages and develops global cloud services, PlayStation Network, digital multimedia content distribution and UI platforms as well as designing and implementing cutting-edge front-end experiences.<p>We're looking for a talented, multidisciplinary front-end software engineer to join our team. You will be architecting and developing core system User Interfaces for PlayStation 3, PlayStation 4 and future flagship Sony devices and services. This position offers the opportunity to directly impact millions of PS3 / PS4 customer experiences around the world.<p>Our UI team develops TV user interfaces, not traditional websites. There’s no cross-browser development.  You will be free to use and advocate for bleeding edge technologies.  We believe in simple data-driven front-ends with smart services driving the overall experience. We love open-source and web technologies. Our UI platforms are based around WebKit and OpenGL solutions to give us the best of rapid development and speed and fluidity of native graphics.<p>At SNEI San Francisco, all of our cloud services, visual design, platform and UI teams all reside under one roof. We aspire to maintain a SoMA start-up culture of passionate, agile development, close collaboration and rapid prototyping.  We also offer highly competitive San Francisco salaries and benefits.<p><pre><code>  Core Requirements:\n\n    - Expert in JavaScript\n    - HTML5 / CSS3\n    - Node.js\n    - Git\n\n  Beneficial Requirements:\n\n    - TypeScript / CoffeeScript\n    - WebGL / OpenGL\n    - Canvas2d\n    - C# / Python\n\n  Qualities:\n\n    - Driven and passionate about producing amazing software\n    - Works above and beyond set expectations. \n    - Is able to work independently and contribute wherever possible.\n\n  Education:\n\n    - 5+ years of relevant experience and a bachelor’s degree in computer science or equivalent\n\n</code></pre>\nYou can send resumes directly to me:<p><pre><code>    alex {{dot}} bustin \n    {{at}}\n    am {{dot}} sony {{dot}} com</code></pre>","time":1370190961,"type":"comment"}