{"by":"illsorted","id":5813901,"parent":5803764,"text":"Endicia (Palo Alto, CA or Fargo, ND):<p>Openings:<p>- Web Developer (details below)<p>- Project Manager<p>- QA Engineer<p>- QA Manager<p><a href=\"http://endicia.com\" rel=\"nofollow\">http://endicia.com</a><p>As a Web Developer on our Web team working from either of our 2 offices, Palo Alto, CA or Fargo, ND, your primary job will be to architect, develop, and maintain high-performance Endicia sites. These include Web sites, mobile applications, intranets, CMS, and e-Commerce solutions. This role requires a responsible individual who can balance multiple projects that involve working with database interfaces, customer-facing account management applications, internal applications, and reporting systems. The technology stack was recently rebuilt using jQuery and ASP.NET MVC as the primary platforms.   Building new features and evolving the system will be your primary duty.  You will be interacting with other project resources such as user interface, database and systems engineers and will need to be able to help manage the flow of work.<p>Your expertise with ASP.NET, C#, SQL, HTML and JavaScript will be critical as the primary developer of this highly scalable site.  Solid knowledge of front-end technologies including HTML, CSS, JavaScript, AJAX and preferably, development experience with ASP.NET MVC or other enterprise scale .Net architectures will round out your technical skill set.  Recently, your focus should have been at least partially on building pixel perfect public-facing transactional sites or applications that can scale to accommodate millions of users.  Previous experience developing enterprise level web based software, and superb written and verbal communication skills, will serve you well.  You will meet with fellow team members to understand client requirements; pair with an internal design and project management team to facilitate development, and write technical specifications and other documentation for the best-in-class site(s) you will create. Your ability to see the big picture and design and implement cost-effective solutions will ensure your professional growth here. You will position yourself for career advancement by integrating seamlessly into our tight-knit team and taking the lead on development efforts.  This is your opportunity to join one of the top internet companies in the nation and create best-in-class sites that will be viewed by millions of users.<p>Qualifications<p>- 5+ years of applicable experience<p>- Professional and possess excellent interpersonal and written communication skills<p>- Passionate about technology and have a strong desire to learn<p>- Knowledge of HTML/CSS/JavaScript, and have hand-coded pages.<p>- Knowledge of the latest front end packages / libraries used in the .Net world (jQuery, MSAJAX, Teleric, etc.) and have recent experience with ASP.NET MVC Framework.<p>- Excellent skills in C# .net and good experience with coding complex business logic with terabytes of data<p>- Proficient with Microsoft T-SQL or other SQL language. Comfortable with architecting and specifying database structures<p>- Deep knowledge of object-oriented design and programming (OOP) techniques.<p>- Desire to work with the best of the best web team, a variety of leading brands, the latest technologies<p>- Experience with Enterprise CMS Packages is a big plus<p>- Experience developing enterprise class Web applications either as a consultant or in house ® BS or MS in Computer Science or equivalent and relevant work experience<p>Please have good examples of your previous work to show.<p>Submit resume/samples/questions to neils@endicia.com","time":1370274281,"type":"comment"}