{"by":"grimborg","id":5819086,"kids":[5825636],"parent":5803764,"text":"We're hiring in the North of the Netherlands to conquer the world of event ticket sales!<p>Paylogic offers a state of the art online and mobile ticketing application from our offices in Amsterdam, Groningen, Berlin and Antwerp. Over 2000 event organisers around the world use it to sell their tickets because of its performance, ease of use, and large set of features.<p>Paylogic customers include ID&#38;T, Andre Rieu, RAI, and KNSB.<p>The Paylogic system meets the highest standards regarding scalability, availability and security. To achieve this Paylogic relies on its top notch sales, product and development teams, and the latest internet technologies. Due to its growth Paylogic is constantly on the lookout for skilled and passionate people. Paylogic is a young organisation in an exciting industry. We reach impressive results due to our high standards, professionalism and hunger for quality. We strive to be the best and have fun while doing so.<p>Some of the key features of the job<p>- Work on a highly scalable, high traffic online ticketing application written in Python;<p>- Work with state of the art Python libraries and frameworks (django, sqlalchemy, flask, etc);<p>- Be part of a excellent, international team of Python experts (&#62;20);<p>- Apply the latest advances in internet technologies (redis, zeromq, nosql, flask, backbone.js, celery);<p>- Use modern software engineering methodologies (agile, scrum, xp, pair programming, peer reviewing, etc);<p>- Friendly, knowledgeable and passionate coworkers;<p>- Open source oriented environment;<p>- Cool, fast-paced and high-tech atmosphere;<p>- Both a commercially and technically ambitious environment;<p>- Environment where the craft of software engineering is held in high esteem;<p>- Freedom and responsibilities above control and micro management.<p>About you<p>- Software engineering is your passion and you appreciate the hacker mind-set;<p>- You have proven to be a good software engineer;<p>- You have experience, or at least interest, in Python;<p>- You are well versed in standard internet technologies (javascript, html, css, json, caching);<p>- You know your database techniques;<p>- You are well versed in multiple programming languages, tools and conventions.<p>- Linux is no stranger to you.<p>- You are fun to hang out with;<p>- You love working in teams;<p>- You love to work in a dynamic environment;<p>- You are ambitious;<p>- Extra points for experience with: High availability systems, cloud computing (Amazon Web Services), payment industry, ticketing systems, monitoring large server clusters, distributed version control workflows.<p>Salary: In line with experience;<p>FTE: Full time employment (40h);<p>Location: Center of Groningen (The Netherlands), a cozy student-town with an abundance of world-class science and culture.<p>If you want to apply for the job, please send your resume and a cover letter to jobs [at] paylogic [dot] com<p>We will contact you as soon as possible.","time":1370350358,"type":"comment"}