{"by":"tom627","id":5825738,"kids":[5878038],"parent":5803764,"text":"Chicago, IL. Full-time. On-site preferred, but remote possible. Relocation assistance provided.<p>Our development team is building web applications for streamlining digital media planning. Our customers live in our apps eight hours a day, negotiating complex deals at blazing speed. We’re looking for someone with experience developing fast, modular web applications in a collaborative team environment to be the newest member of our growing band of talented developers, product managers and designers.<p>Consistently ranked among the best places to work by Crain's Chicago, we're proud to have rapidly built a leading reputation in Chicago's software space.  We're looking for exceptional Ruby &#38; JS developers...<p>You’re right for this job if:<p>- You're great at developing advanced web applications using Ruby, Rails, JavaScript (modern MVC/MVP frameworks like Backbone, Ember, Angular a plus) and HTML/CSS \n- You get relational databases, and also know a thing or two about document stores (and would like to learn more)\n- You work to build and maintain software with the highest standards of software craftsmanship\n- You believe in agile methodologies, including TDD, pairing, CI, and collective code ownership\n- You want to help build a culture of learning and continuous improvement on the team\n- You want to build strong business domain knowledge related to online advertising, campaign planning and execution, ad serving technologies and related topics\n- You enjoy collaborating with customers, product owners, developers and testers to solve real business problems\n- You can collaborate with Product Managers to create acceptance and integration tests\n- You can help support and improve development infrastructure including our continuous integration server and automated testing infrastructure<p>A few reasons people love to work here:<p>- 20% Time: Lots of shops talk about it, but we actually walk the walk. Every Friday you'll come in and work on whatever you want to. We've got people working on getting traffic lights hooked up to our CI, and factory alarm bells to announce the registration of new clients. Want to learn something about mobile development? We've got people working on iOS and Android apps.  Want to learn a new language? Maybe you'll want to pair with someone working on a DART application. Almost anything goes, and we all skip our normal stand-ups to have a quick chat about our fun projects.<p>- Work/Life Balance: We want you to love your job, and we know that's only possible if you have some time to step away from it. No death marches. Lots of vacation time. A super flexible schedule. All we ask in return for it is for you to do awesome things while you're here.<p>- Excellent People: We hire nice, smart people, who are awesome at what they do.  We go out to lunch, play games, have drinks, and hang out together.  You're a part of the team on day one.<p>Fun: Foosball room (yes, it's a high-end Tornado table), beer tap, soda fountain, free snacks and drinks.  Intelligentsia whole-bean coffee, burr grinder, aeropress, super-automatic espresso machine.  Weekly yoga classes.  Play some RBI Baseball or Mario Kart on the Wii.  Quoridor matches at lunch time (you've never heard of it, but you will learn to love it).<p>Training and Conferences: We're a Platinum sponsor of Windy City Rails.  Think there's another conference we should sponsor?  We're up for it.  Which conference do you prefer, RailsConf or RubyConf?  Want to go learn about data visualization from Tufte?  Maybe you'd like to take some classes towards a Master's Degree?  We'll help you out with all of it.<p>Hardware: Top of the line MacBook Pro.  24' displays.  Whatever accessories you want.  No desk phones.  Need something else to help you get your job done?  Let us know, we'll do our best to hook you up.<p>Autonomy: We only hire adults, so we treat everyone like an adult.  You know the best ways to get your job done, so we leave it up to you.  It sounds obvious, but you probably know it isn't always true.  At Centro, it is.<p>Compensation: We offer competitive salaries, bonuses, and a stock option program. Plus, 401(k) matching, great health care, gym memberships and lots of other little stuff.<p>If you'd like to learn more, grab coffee with our head of engineering, check out some of our work on GitHub, let me know.  Or, do you know folks that may be interested?  Make the introductions and if we hire 'em, we'll send you a check for a cool $2,500/person.  Thank you!","time":1370442175,"type":"comment"}