{"by":"wao","id":5826832,"parent":5803764,"text":"Central Europe, Homeoffice is priority.<p>FRONT-END DEVELOPER<p>We are looking for a passionate and seasoned designer to join our team. In this role, you will own significant design responsibilities across all our products. You will have significant impact as a member of our fast moving team. Our products are developed within use modern web designs trends. Our prefered stylehood is above Bootstrap &#38; Flat &#38; Metro ideas and similiar web elements. We are developing products with native user interface that works A-grade on most nowadays web browsers at tablets, smartphones and desktops with enterprise grade funcionality. You’ll be responsible for designing and implementing new features, pages, and interfaces on all parts of our product, from marketing pages to intricate data management interfaces. You should be passionate about creating beautiful tools for developers, and believe the best designs are the result of finding the simplest solution to complex challenges.<p>REQUIREMENETS:<p>Previous portfolio, public available, i.e Behance, Dribble\nMust have a minimum of 2-3 years of design UI &#38; UX experience in a professional software/SaaS development organization.\nA strong sense of UX and visual design, with an eye for simple-to-use interfaces.\nExpert with rapid prototyping with the ability to quickly go from mockups to implementation.\nExpert knowledge of web and mobile design standards.\nYou should understand best practices for designing landing pages, A/B tests, and increasing conversion rates.\nYou should have experience building production quality designs and assets for web apps.\nFront-end developer experience within HTML5, CSS3, Javascript, Jquery\nKnowledge of javascript frameworks, i.e. Jquery Mobile, D3.js<p>BONUS POINTS:<p>Experience with git SCM, and tools such as Atlassian Jira, Confluence are also strongly desired.\nExperience with D3.js is strong plus.\nExperience with developing mobile applications.\nExperience with iconography and illustration.<p>ask@geefu.net<p>Other jobs <a href=\"http://geefu.net/jobs\" rel=\"nofollow\">http://geefu.net/jobs</a>","time":1370451184,"type":"comment"}