{"by":"ajshankar","id":5827910,"parent":5803764,"text":"Berkeley, CA, Full Time<p>Are you looking to join a giant company? Hoping to turn your day into a dreary routine where your work will be marginalized? Well, you've come to the wrong place.<p>EasyESI is a 7-person, tech-led startup in downtown Berkeley that's changing how litigation is performed. Trust us: you'll like working with lawyers -- when they're paying you for a change. And they do pay us: we're comfortably cash-flow positive just two years after founding, and growing quickly.<p>We have many challenging problems, including machine learning, visualization, search, distributed systems, and nifty user interfaces. We're looking for generalists; we'll teach you (or you'll teach yourself) what you need to know.<p>We're a fun company, with an awesome location in downtown Berkeley, foosball, board games, and more (recent events: Warriors playoff game, ski weekend in Tahoe). We'll offer you a great salary, equity, health care, retirement with company matching, and a generous vacation schedule.<p>We are looking to fill 3 positions:<p>Software Engineer: We all wear many hats, contributing to a backend Java codebase that uses minimal XML. We use a lot of modern open source technologies: Lucene, Cassandra, AWS, etc. We have a separate Python codebase for performing offline work. We strive to write all of our code in a modular, reusable style that maximizes code-sharing and minimizes repetition. We schedule weekly time for refactoring so that we avoid the accumulation of technical debt. If you're sharp and you're interested in learning how to write performant code that uses modern academic research and operates on the latest infrastructure, you'll like this role.<p>Front-End/UI Engineer: Must have a good attention to detail and be able to use and contribute to a large, modular Javascript codebase (built on dojo). Good understanding of HTML/CSS/Javascript is a must, and a good eye for design is a nice bonus. We support only modern browsers (no IE6 headaches), so we have a very rich HTML/Javascript interface that relies on AJAX queries to pull down data and perform much of the work.<p>Salesperson/Marketer:  You'll help manage our current client base, land new customers, and develop our company's marketing strategy and materials. However, since we’re a small, flexible team, you will not be tied down to a particular role. You'll have the opportunity shape product development and design your own projects to help grow our company.<p>Check out some videos of our product at <a href=\"http://easyesi.com/review.html\" rel=\"nofollow\">http://easyesi.com/review.html</a><p>We consider all applicants; please apply for the position(s) you're interested in at <a href=\"http://easyesi.com/jobs.shtml\" rel=\"nofollow\">http://easyesi.com/jobs.shtml</a>.","time":1370459867,"type":"comment"}