{"by":"jlaws","id":5845513,"parent":5803764,"text":"New York, NY. Full Time @ Seer Inc - <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;seer&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;seer&#x2F;jobs</a><p>Senior Software Engineer - Big Data &amp; Machine Learning<p>Seer organizes your information so it is available when you need it most. We believe important things get lost in our email, on our devices, and across multiple cloud-apps, and this makes working and being organized harder than it should be.\nSeer is building the new way to work--a web-application that brings email, desktop, and cloud-apps into one place that applies algorithms to organize people&#x27;s data automatically and displays in an easy to use interface accessible from their browser, smartphone, or desktop.\nThis requires overcoming significant technical challenges, and we are seeking other engineers unfazed by difficult technical problems.\nWe are a small, early stage start-up that moves quickly. We were joined forces in October, funded by DreamIt Ventures, a top ranked national accelerator in November, built our MVP in 60 days, and demonstrated it at SxSw in March.\nOur next move is recruit a team dedicated to making Seer a success, launch our web-app publicly this summer, and win the Evernote Developers challenge in September.\nWe are looking for someone to excited to turn data into understandable insights, and we think should have the skills below.\nRequired Skills: \n• Functional Programming (Scala, Clojure, Haskell, Erlang, etc..) \n• Rest API&#x27;s (to get data from the DB) \n• Unit Testing\nDesire to Learn (if you don&#x27;t already have experience in them): \n• Scala (our primary language) \n• Data mining (we have several GB of metadata per user) \n• Natural Language Processing (deep processing of emails and documents) \n• Machine Learning (pioneer innovative ways to correlate user data) \n• NoSQL (Cassandra, Neo4j, etc…)\nRelevant Tools: \n• Git \n• SBT \n• Amazon Web Services \n• An IDE&#x2F;text editor of your choice<p>-------------------<p>UI Architect<p>Seer organizes your information so it is available when you need it most. We believe important things get lost in our email, on our devices, and across multiple cloud-apps, and this makes working and being organized harder than it should be.\nSeer is building the new way to work--a web-application that brings email, desktop, and cloud-apps into one place that applies algorithms to organize people&#x27;s data automatically and displays in an easy to use interface accessible from their browser, smartphone, or desktop.\nThis requires overcoming significant technical challenges, and we are seeking other engineers unfazed by difficult technical problems.\nWe are a small, early stage start-up that moves quickly. We were joined forces in October, funded by DreamIt Ventures, a top ranked national accelerator in November, built our MVP in 60 days, and demonstrated it at SxSw in March.\nOur next move is recruit a team dedicated to making Seer a success, launch our web-app publicly this summer, and win the Evernote Developers challenge in September.\nWe are looking for someone to excited to build an experience people love. You can look forward to frequent iterations with user feedback, working as part of product design team, and being responsible for the Seer experience in the web.\nRequired Skills: \n* Javascript \n* HTML&#x2F;CSS \n* jQuery \n* REST API&#x27;s \n* Unit Testing\nDesire to Learn (if you don&#x27;t already have experience in them): \n* Handlebars \n* Backbone.js \n* iOS native&#x2F;web-app development \n* Android native&#x2F;web-app development\nRelevant Tools: \n* Git \n* Grunt \n* NPM \n* AWS \n* Nginx<p>* An IDE&#x2F;text editor of your choice","time":1370712034,"type":"comment"}