{"by":"jmhain","id":14026068,"parent":14023198,"text":"IdentityMind | Platform Engineer | Palo Alto, CA | FULLTIME | ONSITE<p>At IdentityMind Global, we are building a unique platform providing Risk Management services to the financial industry: both traditional payments and emerging cryptocurrencies such as bitcoin. We are experiencing explosive growth and have just deployed our 2nd generation platform which currently scales to hundreds of transactions per second. We are expanding internationally and are also building Big Data analytics and reporting tools to cope with the financial crime prevention requirements of our clients.<p>This role will extend the existing anti-fraud and anti-money laundering system, and work closely with our data science team to integrate our machine learning models into our real time transaction analysis.<p>If you are interested in finding out more and explore a possible relationship, we would love to hear back from you to find out more about you and to tell you more about our platform.<p>Qualifications<p>* 5+ years industry experience<p>* Strong full stack Java<p>* Experience building real time transactional platforms<p>* Ability to take abstract user requirements and build a product that addresses the underlying use case<p>* Strong communication skills, both written and verbal<p>* Ability to work within a small high achieving team, as well as independently<p>* Self-driven, highly motivated, innovative<p>Desirable<p>* Domain expertise in anti-fraud and&#x2F;or anti-money laundering<p>* Productizing machine learning models<p>* Experience integrating with 3rd party services using REST, JSON, XML and&#x2F;or SOAP<p>* Cassandra<p>* Graph Databases such as Titan or Neo4j<p>* Light Linux administration<p>* Python or Perl<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.identitymindglobal.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.identitymindglobal.com&#x2F;company&#x2F;careers</a><p>Feel free to email us at jobs(at)identitymind(dot)com if you have any questions.","time":1491246702,"type":"comment"}