{"by":"gjreda","id":14024398,"parent":14023198,"text":"Sprout Social | Senior Data Scientist | Chicago, IL | ONSITE | <a href=\"https:&#x2F;&#x2F;sproutsocial.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sproutsocial.com</a><p>Our team uses Python and its data stack (pandas, numpy, scikit-learn) along with a little Java to drive decisions and power software that is used by more than 17,000 brands around the world. Companies like Microsoft, Zipcar, Hyatt, Google, and Zendesk rely on Sprout to create stronger relationships with their customers through social media.<p>We’re looking for curious, analytical, and creative people to help utilize the vast amount of data we have. If you love finding ways of using data to build better products and solve problems, we’d love to talk with you.<p>Responsibilities:<p><pre><code>    - Build predictive models in support of product and business goals\n    - Conduct research to surface new opportunities and understanding\n    - Build tooling for all of the above\n    - Mentoring, teaching, and helping to level up the team\n</code></pre>\nRequirements:<p><pre><code>    - You have professional experience working on data-driven problems. Examples might be classification, recommendations, churn prediction, topic modeling, fraud detection, etc.\n    - You’ve built production machine learning pipelines in Python or Java.\n    - You have a strong understanding of statistics (probability, experimental design, bayesian methods).\n    - You enjoy thinking about business and product, and how data can be used to inform or improve both.\n    - You understand, appreciate, and can explain the tradeoffs between simple methods and complex models.\n    - You probably studied a technical, quantitative, or analytical field throughout school, but also might have taken a different route. We’re looking for at least a Bachelor’s degree or equivalent.\n</code></pre>\nNice to haves:<p><pre><code>    - Experience working with text data and using natural language processing methods\n    - Experience with Apache Airflow, Spark, or AWS Data Products (EMR, Redshift, Kinesis)\n    - Experience with deep learning toolkits, such as Keras, Theano, or TensorFlow</code></pre>","time":1491237870,"type":"comment"}