{"by":"jeremiahblatz","id":14023318,"kids":[14025288],"parent":14023198,"text":"Blink Health | Security Hire #3: Hands on Policy, Risk &amp; Compliance (&quot;Governance Hacker&quot;) | New York, NY | Full-time ONSITE VISA <a href=\"https:&#x2F;&#x2F;www.blinkhealth.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blinkhealth.com&#x2F;</a><p>I’m looking for someone to join the security team here at Blink Health, primarily to help out with (like it says) policy, risk, and compliance. This job can be as hands-on as you like, and hopefully you like that! Also, this job requires creativity; not in the sense of “how dirty can we be and not get fined?” but in the sense of “nobody’s done this sort of thing before, how can we comply with both the letter and spirit of the regulations without a clear precedent?”<p>What does the job entail? Obviously designing policies and procedures for Blink Health and our other ventures. In addition to taking the lead on designing our governance, you’ll help implement, evaluate, and improve our policies and procedures. There will be audits, both internal and external. There will be partner evaluations to answer, and partner evaluations to perform. You’ll be figuring out how we can use 3rd party services more securely, and how to segment and protect our data internally. These activities won’t take all your time, though. You’ll have plenty of time to pursue other things that help improve Blink’s overall security, and plenty of discretion as to how to go about that. You’ll have a lot of responsibility, but you’ll also always have help and guidance.<p>Maybe you’re a governance &amp; risk management consultant who prefers to hang out with the pen testers. Maybe you work at BigCo and are frustrated with how long it takes to get things done. Maybe you’re a technical security person who’s discovered that they find the organizational aspects of security <i>really interesting</i>. Maybe you’ve got some other reason that you’re interested. It’s all good, let’s find a way for you to do interesting work and contribute to fixing health care.<p>Why you want to work for Blink Health:<p>* Interesting, varied work<p>* Building a real thing that actually helps people<p>* Get in early on a startup that has hundreds of thousands of paying customers<p>* Healthy work environment (friendly, reasonable people, crunch time is super-rare)<p>* Standard “well-funded startup” perks (unlimited vacation time (you will actually take vacation), free lunches, great stock plan, etc.)<p>* Standard “real company” benefits (health&#x2F;vision&#x2F;dental, 401(k), etc.)<p>What you should have to apply:<p>* Practical experience related to policy, governance, risk, and&#x2F;or compliance. HIPAA a plus.<p>* Familiarity with and interest in the technical aspects of security<p>* Desire for varied work<p>* Willingness to work in NYC SoHo","time":1491232358,"type":"comment"}