{"by":"atishd","id":14029024,"parent":14023198,"text":"EquityZen | Engineering Lead | New York City | Full-Time | <a href=\"https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?englead\" rel=\"nofollow\">https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?englead</a><p>Tim Draper &amp; Dave McClure backed, EquityZen is an early-mid stage FinTech firm, bringing private markets to the public. Our platform enables large, private companies to helps their shareholders get cash, while providing investors access to invest in these pre-IPO companies. EquityZen has served 60+ premier tech and digital health companies, and is proud to be considered a liquidity provider by 1 out of 3 of the largest unicorns.\n<a href=\"https:&#x2F;&#x2F;equityzen.com&#x2F;press&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;equityzen.com&#x2F;press&#x2F;</a><p>We&#x27;re looking for an Engineering Lead eager to help us as we redefine private markets. Join us if you&#x27;re looking to work alongside extremely brilliant engineers while rolling up your sleeves, diving into code, and driving our product vision.<p>Some of the things you&#x27;ll do:\n  Architect and implement the most secure private placement platform that can scale to trading $1B+\n  Work closely with experienced developers who love discussing software &amp; security\n  Collaborate with non-engineering teammates to solve difficult practical problems\n  Partner with Founders and Product Lead to set and manage expectations in delivering high quality technology at a fast pace\n  Demonstrable experience building robust infrastructure with our developers and data-driven business tools for other teams\n  Prototype and implement new product ideas with engineers, with initiatives such relying on NLP and ML based prediction\n  Gain exposure to all parts of the venture capital, private equity, and startup ecosystems<p>Also hiring for:\n<a href=\"https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?frontend\" rel=\"nofollow\">https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?frontend</a>\n<a href=\"https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?frontend-intern\" rel=\"nofollow\">https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?frontend-intern</a>\n<a href=\"https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?fullstack-intern\" rel=\"nofollow\">https:&#x2F;&#x2F;equityzen.com&#x2F;careers&#x2F;?fullstack-intern</a>","time":1491272448,"type":"comment"}