{"by":"tdowns","id":14026005,"parent":14023198,"text":"Kalibrate | Software Engineer, Platform Team | Cleveland, OH<p>For over 20 years, the people of Kalibrate have been staying ahead of the curve in the fast-moving world of fuel and convenience retail. Over 300 clients, in 68 countries on six continents, in mature and emerging markets, for clients large and small, Kalibrate is there with flexible, dynamic solutions that fit all.<p>What you&#x27;ll do<p>•   Build end-to-end features as part of a service oriented product<p>•   Design, code, test, debug and document software along with enhancing existing components to ensure that software meets business needs.<p>•   Build data-centric services to maximize market analysis efficiency and deliver market insights<p>•   Write modular, high-quality code while actively engaging in peer code reviews<p>•   Learn new technologies &amp; best practices, apply them to solve business problems and teach others about your experience<p>What you&#x27;ve done<p>•   Have 3+ years of experience working on the server side in any language (Java, Python, JavaScript, Ruby, etc.)<p>•   Have experience constructing interactive web applications using modern JavaScript frameworks (Angular.js, React.js, Knockout.js, etc.)<p>•   Have experience building REST based web services<p>•   A strong passion for engineering and a sense of ownership of your code and outcomes<p>•   Have experience with test automation, continuous integration and deployment<p>•   Have experience with Cloud services such as AWS or Azure<p>•   Have experience with environment isolation (Docker, Vagrant, etc.)<p>Our Tech Stack\nKalibrate runs a modern, service-oriented stack, continuously integrated and deployed (CodeBuild, CodePipeline, Elastic Beanstalk) on AWS. We deliver our client experience using Angular 2, Bootstrap 4 with Sass and D3.js graphing. We build data services using Dropwizard, PostgreSQL and Elasticsearch.<p>What&#x27;s next?\nInterested yet?  To hear more, please send your resume over. Please feel free to provide any coding samples (Github, Stackoverflow, etc…) or blog posts, we’d love to take a look! email us at clevelandtech (AT) kalibrate -dot- com","time":1491246257,"type":"comment"}