{"by":"landstrom","id":14026245,"parent":14023198,"text":"Cota | Senior Platform Engineer | New York, NY | Full-Time | Onsite<p>COMPANY - Cota (<a href=\"https:&#x2F;&#x2F;www.cotahealthcare.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cotahealthcare.com</a>) is a technology platform that enables providers, payers, and life science companies involved in diagnosing and treating complex diseases to optimize the care of individual patients and lower the overall cost of the patient population served. It is powered by the patented Cota Nodal Address™ (CNA) system, a unique digital classification methodology built by leading physicians and data scientists. The CNA is the first and only system that precisely categorizes patient factors, their diseases and intended therapies, enabling precision medicine at scale.<p>Cota&#x27;s technology enriches raw medical records to create research-grade data, and joins it with a suite of analysis, visualization, and management tools. This enables providers, payers, and life sciences companies to analyze, report on, and research outcomes, costs, treatments, and quality at any granularity and stage of the patient journey. The result is a constantly improving system that merges technology and science to help improve the lives of patients everywhere.<p>JOB DESCRIPTION - COTA is seeking passionate, entrepreneurial engineers comfortable with a multidisciplinary approach to shipping new products and platforms. A Platform engineer builds and takes ownership of entire platforms that support all our products. Engineers are involved in the entire product lifecycle, from conceptualization to production release. An ideal candidate is highly self-directed, with strong platform design sense and the motivation to continually iterate to deliver the best possible solution. The candidate should have extensive knowledge of, and working experience in, Data Life-Cycle Management including data-modeling, stream data processing, and messaging queues.<p>RESPONSIBILITIES - Understand data lifecycle requirements, and map them to technical implementation - Take ownership of the platform that supports and enables our data-driven architecture - Conceptualize and design&#x2F;architect components of the platform with emphasis on scalability, agility, maintainability and security - Design and build core micro services that will power our products and data partner integrations - Build Restful and Asynchronous Endpoints - Design and build caching solutions - Use AWS cloud infrastructure - Using modern CI techniques, you will ship features regularly - Work with QE for quality assurance - Collaborate with other other teams and stakeholders of the platform in order to understand and satisfy product requirements<p>REQUIREMENTS - Solid foundation and working knowledge of Object Oriented design and Functional Programming - Working knowledge of Data Structures, Algorithms, Data Modeling, Real-Time Data Processing and Concurrent &amp; Distributed Systems - 2+ years of experience programming in Scala with exposure to the most well known frameworks such as Akka, Play, SBT - Experience building services that fit Micro Systems Architecture - Good understanding of security standards like OAuth2 is a plus - Experience with web services API technologies (Rest, JSON) - Understanding of cloud technologies such as AWS - Experience in either Erlang or Haskell is a plus - Experience working in an Agile development environment<p>Please apply by emailing: cindykim@cotahealthcare.com","time":1491247761,"type":"comment"}