{"by":"papercruncher","id":14025254,"parent":14023198,"text":"Tubi TV | Data, Android, DevOps | San Francisco, CA | Full-Time ONSITE VISA (transfer H1&#x2F;O1 &amp; start GC) <a href=\"https:&#x2F;&#x2F;tubitv.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.com</a><p>We are making premium TV shows and movies available for streaming everywhere and to everyone, 100% free. Join Tubi TV and reinvent the way consumers discover and consume premium, studio content. With over 40,000 movies &amp; TV shows, Tubi TV has the world&#x27;s largest catalog of premium content, all made available to consumers for free.\nSome of our studio partners include MGM, Lionsgate and Paramount. We offer very competitive pay, full medical, dental &amp; vision benefits, catered lunch, gym subsidies and your choice of hardware. Learning is a huge part of our culture and we frequently help non-engineers learn basic programming skills. All positions come with stock options and full benefits.<p>We are hiring for:<p>- Lead Data Engineer&#x2F;Scientist ($150k-190k): Full autonomy and end to end ownership. In charge of building and running the entire data team. The ideal candidate can do their own analysis, build ML models, write quality code and ship them to production. <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7i9&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7i9&#x2F;</a><p>- Jr &amp; Sr Android Engineers ($100k-$160k): Work on an app with millions of users and help redefine how long form content gets consumed on mobile. The ideal candidate loves working on consumer products and obsesses over UX.  <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7ie&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7ie&#x2F;</a> and <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7ik&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7ik&#x2F;</a> for Senior roles.<p>- DevOps&#x2F;SRE ($130k-$160k): Be our first DevOps hire and own how we automate provisioning, deployment and monitoring. We use Ansible and DataDog, mostly on AWS with some parts on-premise. <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7ig&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk0m7ig&#x2F;</a><p>If you&#x27;d like to chat more first, shoot me an email and mention HN (marios at tubitv dot com). Unfortunately we do not currently offer remote positions.","time":1491242150,"type":"comment"}