{"by":"mrfowler","id":14023927,"parent":14023198,"text":"Broadridge | Senior &#x2F; Lead Full Stack Software Engineer | Boston | ONSITE\nWe&#x27;re looking for a few senior engineers with a frontend or backend focus to help us write the next generation of cloud based solutions for financial advisors. We&#x27;ve recently launched a new innovation lab located next to South Station to bring new technical light into our organization and are looking for motivated engineers to help us create high-quality software offerings. This is an exciting chance to get in on the ground floor of some greenfield projects.<p>We&#x27;re creating an innovative environment where we can use and experiment with the greatest new technologies (Scala, Kotlin, Go, React, Terraform and Ansible are under consideration or in use currently) and apply best practices in the areas of test driven development, continuous integration and continuous improvement.<p>If that sounds like the type of environment you&#x27;d like to work in we&#x27;d love to hear from you. You can email me directly with a resume and any other information at matthew dot fowler at broadridge dot com. I am the director of software development for the innovation lab.<p>Interview process consists of a phone screen, a take-home coding test and an onsite interview.<p>Required skills:<p><pre><code>  - 5+ years experience as a software engineer\n  - A strong desire for clean, simple and maintainable code\n  - A strong desire for continuous learning and improvement\n  - Experience with unit testing or test driven development\n  - Experience with Java or a modern JVM language\n  - Experience building REST APIs with one or more web frameworks such as Spring or DropWizard\n  - Working knowledge of database design\n  - Working knowledge of multi-tenant Software-as-a-Service (SaaS) software architecture\n  - Working knowledge of Agile development processes (Scrum, Kanban)\n  - Working knowledge of one cloud provider such as AWS, Google App Engine, Azure or Linode\n  - Working knowledge of Git and Git flow\n</code></pre>\nWe&#x27;ll like you even more if you have at least one of the following:<p><pre><code>  - Experience with an alternate JVM language such as Scala or Kotlin\n  - Experience leading a team of developers\n  - Experience with functional programming\n  - Experience with graph based data engines (Neo4J or Spark GraphX)\n  - Experience with data science or machine learning algorithms\n  - Experience with Natural Language Processing (NLP) and Language Understanding techniques\n  - Experience with building batch and real-time analytics, decision support and business intelligence analysis and reporting enterprise software\n  - Experience with &quot;front end&quot; frameworks such as React or Angular</code></pre>","time":1491235568,"type":"comment"}