{"by":"AdamTReineke","id":14025919,"kids":[14026071],"parent":14023198,"text":"Sway | Redmond, WA (Seattle) | FULLTIME | ONSITE<p>Come join Sway, one of the newest members of the Office suite (sway.com)! Sway team is focused on re-inventing how users author and consume documents in a cloud and mobile first world. Sway is a collection of Azure services and endpoints (Web, Windows, iOS, Android) that enable users to create dynamic web first documents that adapt their layout so they look beautiful on all screens and devices. Sway is looking for a passionate engineer with demonstrated experience in web development who is excited to work in an agile V1 environment where we move at the speed of the web, shipping to production daily, and accrue value to Office 365, one of the largest and most important Microsoft assets!<p>This position requires an engineer with demonstrated experience in web development to help lead the next evolutions of the Sway web stack. Qualified candidates should be experienced in industry application of web technologies such including JavaScript&#x2F;TypeScript, HTML5, and CSS3 and common industry standard libraries such as jQuery, React, etc. Day to day you can expect to be working in a small team of 3-5 engineers focusing on cross platform excellence of Sway web components. You will be expected to deliver maintainable, well tested code and analyze user telemetry and operational metrics to measure the impact of your work.<p>Skills Required:<p>•\t5+ years of web development experience<p>•\tDemonstrated experience writing readable code with low defect count and thorough unit test coverage.<p>•\tDemonstrated experience with web technologies: JavaScript or TypeScript, HTML5, and CSS3.<p>•\tIndustry experience building products using common web libraries such as React, MobX, jQuery, etc is desirable.<p>•\tBS in Computer Science or related field.<p>-------<p>I have been an engineer on the web team for nearly two years. This job posting isn&#x27;t live yet, so e-mail me (AdamRe at Microsoft) for now. I&#x27;ll try to check for replies to this thread a few times today and over the coming days.","time":1491245763,"type":"comment"}