{"by":"acaiola","id":14025803,"parent":14023198,"text":"Hello Alfred | Sr Full Stack Engineer (Full-time) | NYC | On-site | <a href=\"https:&#x2F;&#x2F;hello-alfred-1.workable.com&#x2F;jobs&#x2F;214124\" rel=\"nofollow\">https:&#x2F;&#x2F;hello-alfred-1.workable.com&#x2F;jobs&#x2F;214124</a><p>We are seeking a Full Stack Engineer with the ability and passion for building solutions for human-centered problems that are created at the intersection of human behavior and technology.\nAs part of a growing Hello Alfred engineering team you will have a direct and immediate influence on the technology choices, data architecture, and scalability of the platform. You will help develop our engineering philosophy and practices to lead the construction of a new type of service. Hello Alfred offers the opportunity to work closely with all aspects of a multi-sided business from our operations team, customers and - the stars of the business - the Alfred Client Managers<p>Experience with Elixir, Phoenix, and&#x2F;or functional languages is a big plus as much of the core platform is being migrated over. You are capable working across the full stack including front-end JS frameworks like React, Ember, Angular or similar.\nNice to have: some experience with iOS and&#x2F;or Swift.\nOur Stack: Migrating away from NodeJS&#x2F;Mongo to Elixir, Postgres, and React. We’re deployed on Heroku.<p>Ideal Candidates would meet many of the following qualifications:\nAt least 3 years’ experience across the full web stack: you can write SCSS, keep logic out of controllers, and properly index your database tables. You also have empathy, taste, and hobbies outside of engineering.\nIdeally you have shipped production code using Node JS and have a familiarity working on a web stack powered by Express or similar. Having a good working knowledge of modern Javascript is essential.\nNice to Haves: Experience with Elixir - we’ll train you up. iOS experience (Swift and Objective-C). An interest in UX and hospitality.\nAbout Alfred: At Hello Alfred we believe in creating an experience that empowers our customers to maximize their time by automating all of life’s little interruptions. We are dedicated to building solutions that learn from our customers’ behaviors and desires to delight them - not just by incorporating technology, but by making a truly human experience.","time":1491245192,"type":"comment"}