{"by":"AugustoCAS","id":14036546,"parent":14023198,"text":"QMetric Group | Java Developer (backend, all levels) | London | Full-time, ONSITE | <a href=\"https:&#x2F;&#x2F;www.policyexpert.co.uk&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.policyexpert.co.uk&#x2F;</a><p>We&#x27;re looking for a java engineer of all levels to expand our insurance platform functionality, which uses Domain-Driven Design, Event Sourcing, and a microservices architecture. We value clean, simple code and flexible, resilient architectures. Although experience in any of those buzz words would be great, it is your ability to write clean, pragmatic OO solutions that will interest us the most.<p>In a perfect world:<p><pre><code>  ● Excellent understanding of OO principles. + S.O.L.I.D.\n  ● Clean architectures. eg. Ports and Adapters.\n  ● Exposure to Micro Service and Feed architectures.\n  ● Understand of HTTP + RESTful APIs + Clients.\n  ● Linux, GIT, Maven, Gradle.\n  ● Coding with agility and pragmatism.\n</code></pre>\nWho will you be working with<p>A collaborative bunch of smart and approachable developers, with many years of expertise and knowledge in a wide range of domains. An environment of mutual trust between development and business, with a ‘we are all in this together’ attitude. A strong sense of teamwork, but also autonomy, and room to grow, learn and teach others.<p>How we operate<p>A relaxed, fun, open and honest environment, with trust and professionalism a must; but with a happy slice of light hearted scepticism. We all value the right work &#x2F; life balance and have flexible working hours.\nWe believe in continuous hands  on delivery, with you and your team in the driving seat of ideas. Constantly trying to remove or reduce any unnecessary bureaucracy, we have a flat structure, and everyone has the same opportunity to step up with direct access to all stakeholders, including CTO and business leaders.<p>Process: Phone chat - take home exercise - face to face (pair programming) - lunch with team - offer<p>Please get in touch with me at arodriguez@qmetric.co.uk","time":1491335555,"type":"comment"}