{"by":"Aretecjobs","id":14033581,"kids":[14051426],"parent":14023198,"text":"Aretec, Inc| Penetration Tester (Pen Tester)| Washington DC Area | $80-135k Salary + benefits | Full-time |ONSITE<p>Job Description:\nProvide technical security assessments of applications and infrastructure, security design reviews as well as risk assessments. This is a hands-on role, requiring technical skills from the hardware to the application layer.<p>Job Duties:\n• Skill in developing and apply security system access control\n•  Skill in assessments of industry IT operating system, software database, or hardware\n•  Skill in systems engineering, requirements analysis, system development, software development, or hardware development as applied to the information assurance or cyber security field\n• Prepare the various types of security related documents and conduct vulnerability scans and recognize vulnerabilities in security systems \n• Selects the appropriate technical tests, network or vulnerability scan tools, and&#x2F;or pen testing tools based on review of requirements and purpose; lists all steps involved for executing selected test(s) and coaches others in the use of advanced research, development, or scan tools and the analysis of comparative findings between proposed and current technologies\n• Performs joint interoperability testing on systems exchanging electronic information with systems of other services or nations, and determines whether the system is certified as interoperable based on analysis of results; provides recommendations on how to enable systems to operate effectively together<p>CERTIFICATIONS: (One or more required) \nCompTIA Net+\nCompTIA A+\nCompTIA Security + \nCPTE - Certified Penetration Testing Engineer or CEH - Certified Ethical Hacker GSEC<p>Salary is commensurate with experience.  Security certifications required (CISSP, CEH, Security+, CAP, GIAC, etc.). If you have a passion for cyber security and want to learn more about this position, please visit our career website <a href=\"http:&#x2F;&#x2F;www.aretecinc.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aretecinc.com&#x2F;careers&#x2F;</a>  or e-mail your resume to careers@aretecinc.com","time":1491319322,"type":"comment"}