{"by":"taylorcooney","id":14053841,"parent":14023198,"text":"We&#x27;re a high growth, exciting company committed to transforming the world of work with beautiful mobile software and we&#x27;re looking for a Android Developer to join our passionate and talented team.<p>Nudge Rewards’ mission is to reinvent team performance for the non-desk workforce. We change the lives of team members by creating a compelling, connected and winning environment – a job people will love. We help our customers drive sales and profitability by using software to accelerate team performance.<p>SKILLS &amp; REQUIREMENTS<p>You have 3+ years of experience building and shipping Android apps; other platform experience is a bonus but not required.\nYou are excited to take ownership over features or entire projects, seeing them straight through to release.\nYou have learned to write high quality code while maintaining a regular release schedule.\nYou can make informed technology and implementation decisions and justify them.\nYou are very comfortable with Git and GitHub.\nYou are legally able to work in Canada.\nAbout Nudge Rewards<p>WHY JOIN NUDGE REWARDS?<p>We are passionate about building apps that are simultaneously fun and useful.\nWe&#x27;re excited about the thought of scaling the platform to support 1M+ users in 2017.\nWe are a place where you can practice your craft, grow your skill set, move up (and over), and build yourself into whatever you aspire to be.\nHealth and wellness benefits spending plan, and a personal learning budget for conferences, classes, etc. of your choice.\nA results focused culture with flexible work hours and schedules.\nFun company hangouts (summer &#x2F; winter retreats, milestone celebrations and socials).\nLots of fun food and drink perks, including Thursday catered lunches.<p>Apply Here =&gt; <a href=\"http:&#x2F;&#x2F;nudgerewards.com&#x2F;about&#x2F;mobile-android-developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;nudgerewards.com&#x2F;about&#x2F;mobile-android-developer.html</a>","time":1491507158,"type":"comment"}