{"by":"clairbear","id":14070840,"kids":[14081451],"parent":14023198,"text":"Everlaw | Software Engineer, DevOps&#x2F;Site Reliability Engineer | Berkeley, CA |Full-time ONSITE | jobs.everlaw.com<p>We&#x27;re a growing startup with a real business model, rapid growth, and venture funding from Andreessen Horowitz. We provide document analysis, review, and discovery tools to law firms who need to wade through millions of pages of evidence to find that one needle in the haystack (or sometimes the smoking gun!). You&#x27;ll be developing core components of our litigation infrastructure, an online platform for lawyers to review, analyze, and collaborate on millions of documents.<p>Tackling litigation with technology is a surprisingly deep challenge, and it requires a lot of computer science, including machine learning, data visualization, search, distributed systems, databases, real-time collaboration, nifty user interfaces, and more.<p>We&#x27;re looking for full-stack generalists. We value great CS fundamentals, native ability, and humility, over experience with any particular platform, technology, or specialization. If you happen to have a specialty, we&#x27;ll put that to use -- but we won&#x27;t restrict you to that area. We care a lot about finding the best engineers, writing correct software, using the right tools for the job, and avoiding dogma, and as a result we&#x27;ve been able to build quite a bit of sophisticated technology with a small, talented team. It&#x27;s the kind of culture where you&#x27;ll own serious features, write great code, learn a huge amount, and have a lot of fun.<p>We code primarily in Java and Python but dabble in several other languages.<p>Requirements\n-Experience with a compiled language, such as C, C++, or Java \n-Good knowledge of algorithms and fundamental computer science concepts \n-A love of building systems \n-An eye for aesthetics and user experience \n-An eagerness to learn new technologies \n-Authorization to work in the United States; please note that at this time, Everlaw is not sponsoring visas for any positions.<p>Benefits\n-Competitive salary \n-Substantial equity \n-Retirement plan with company matching \n-Health, dental, and vision insurance \n-Maternity, paternity, and sick leave \n-Fifteen paid vacation days, plus ten bankable federal holidays<p>Check out full job descriptions+perks and apply at jobs.everlaw.com.  Contact me at clair@everlaw.com with any questions :)","time":1491720358,"type":"comment"}