{"by":"aprioni","id":14108005,"parent":14023198,"text":"Measurence | OpenWrt &#x2F; Embedded Engineer | NYC, Milan (Italy) | Full time, remote\n------\nOur vision\n90% of the economy lives offline but we know very little of what happens there. Our vision is to quantify and understand the physical world around us to improve business decision making. We analyze people behavior in physical spaces by collecting millions of data points with our simple, plug&amp;play WiFi sensor and we build algorithms that delivers actionable analytics from the physical world.\n------\nWho we are\nWe are a committed to creating a strong culture based on the values we live by: Transparency, Honesty, Autonomy, Curiosity, Commitment, Approachability, Creativity, Collaborativity, Frugality, Ownership, Focus. We believe that while implementation experience is essential, enthusiasm and interest can trump experience: we are willing to take a chance on someone who wants to step up!\n------\nYou will be responsible of maintaining and developing the firmware of our IoT sensors that get deployed inside our customer&#x27;s stores all over the world.<p>We are looking for a software engineer who:<p>- has experience as a systems developer and has worked on servers &#x2F; infrastructure implementation \n- has experience developing on OpenWrt (ideally porting &#x2F; testing it on new devices) \n- has experience on linux platform development (development &#x2F; network services management, troubleshooting etc.) \n- has knowledge of network protocols both at low and high level (ranging from WiFi protocols to SSH) \n- understands the basic of the GSM and 3G stack<p>Timezone requirement: UTC+&#x2F;-1 or UTC-5<p>To apply, email your LinkedIn Url (like: www.linkedin.com&#x2F;in&#x2F;alessandroprioni) AND the link of this thread (<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14023198\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14023198</a>) to aprioni@measurence.com cc’ing recruiting-openwrt@measurence.com","time":1492098498,"type":"comment"}