{"by":"sparkmeter","id":14109858,"parent":14023198,"text":"SparkMeter | Infrastructure Engineer (Automation Focus) | Waltham, MA | Full-time, ONSITE with flexible work location and schedule | <a href=\"http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;infrastructureengineeraf&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;infrastructureengineeraf&#x2F;</a><p>Come join SparkMeter’s Systems team and help increase electricity access in developing countries. As an Infrastructure Engineer with an automation focus, you’ll build the tools and architecture that will allow us to expand our affordable smart metering systems to new microgrid and central grid utilities.<p>At SparkMeter, we believe in embracing automation, and our team takes every opportunity to reduce manual work or remove workarounds using tools like Fabric, Chef, and Docker. You’ll officially own automation for the Systems team, creating new tools and taking over the maintenance of existing tools that others across the organization will use every day. This will include improving automation for our software release process, automating the (now largely manual) provisioning of the Linux base stations at the core of our smart metering system, and generally building and maintaining the tools that help make it easy for us to efficiently manage a growing herd of servers and devices.<p>SparkMeter’s core value is opportunity: the opportunity for underserved communities to achieve great things. That&#x27;s why our mission is to increase access to electricity in underserved communities - it is electricity and the services derived from it that unlock and create those opportunities. This value is reflected in our hiring ethos: we believe that the strongest teams have diverse backgrounds. Our approach to hiring has been validated by academic and industry studies that show that workforce diversity improves team and business performance. (It has also been validated by the quality of the team we’ve assembled so far!) We encourage applications from members of groups currently underrepresented in software engineering.<p>You can read the complete description for this role, including requirements and how to apply, at <a href=\"http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;infrastructureengineeraf&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sparkmeter.io&#x2F;en&#x2F;jobs&#x2F;infrastructureengineeraf&#x2F;</a>. Thanks!","time":1492109563,"type":"comment"}