{"by":"riviscure","id":14105422,"parent":14023198,"text":"Riscure | Delft - The Netherlands | Lean Software Developer | ONSITE, Full-time | <a href=\"https:&#x2F;&#x2F;www.riscure.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.riscure.com&#x2F;</a> \nRiscure is a world renowned security lab, specialized in building advanced security test tools and performing evaluations of security sensitive consumer devices, such as mobile phones, smart cards, embedded chipsets and set-top boxes.\nAs a Lean Software Developer you are part of the development team with the objective to develop new products, and improve existing ones. The development team has both software and hardware specialists and it follows the Lean development practice, where experiments drive the process of learning what users need. The Lean Software Developer is tasked with development of our main software product suite Inspector, which is mostly written in Java. Supporting tools for Inspector are also developed in Python and C. Your role is to manage and oversee the development process, methods and techniques used to develop our software products. You know how to structure the work and monitor the progress of the development team, based on lean development methodology. And you are in the lead of the technical choices of software development and are able to coordinate the contributions from both development team and from our security analysts. You also coordinate the integration of various internal and external hardware products into the main Inspector tool.\nWe try to find new employees who share our core values:\n• Proactively taking ownership: we are proactive in  our work; we take responsibility for our customers&#x27; satisfaction; we improve continuously, both professionally and personally.\n• Open to share knowledge: we share knowledge responsibly; we listen to each other and our customers.\n• Everyone feels at home: we can be ourselves; we are playful and like to surprise each other; we are respectful.\n• Maximize our creative potential: we like being challenged; we are curious; we encourage innovation.\nRiscure’s higher goal is to give insight, deliver breakthroughs and to bring color to the security of technology. If you want that as well and are interested, please check out <a href=\"https:&#x2F;&#x2F;www.riscure.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.riscure.com&#x2F;</a> for details or contact us directly with your motivation and CV via hrm@riscure.com!","time":1492076022,"type":"comment"}