{"by":"p_alexander","id":2504138,"parent":2503204,"text":"Palo Alto, CA - Stanford University - Full Stack Software Engineer<p>Apply: <a href=\"http://bit.ly/hve1AT\" rel=\"nofollow\">http://bit.ly/hve1AT</a><p>We're looking for a junior/mid level software engineer with an ability to work on front and back end code. We have a Rails/Javascript UI that uses a RESTful service built with Java (Spring, Hibernate, RESTlet) as its datastore.<p>Our team runs as closely to a startup as you can in the academic environment. We're responsible for building BioPortal: <a href=\"http://bioportal.bioontology.org\" rel=\"nofollow\">http://bioportal.bioontology.org</a>. This isn't one of those research projects that produces a ton of theory but nothing usable. We're responsible for a full production environment that gets tens of millions of hits a month and have a full team of developers, including proper managers and even some QA (this is huge in academia). The project is well-funded by the NIH and we're halfway through year one of a five year grant.<p>You'll have a huge say in how things get implemented. We're not scared to incorporate new tech and definitely appreciate what people have to bring to the table. You'll be encouraged to get things done with minimal supervision, but everyone on the team is excited about talking through problems as needed.<p>Stanford Pros:<p>* Competitive compensation. Stanford likes to hire the best and we know we're competing with Google, Facebook, and everyone else. Salaries are competitive, obviously no access to options, bonuses, or profit-sharing :)<p>* Awesome benefits. This makes up for the lack of compensation to me. We get three weeks of vacation plus sick time plus PTO plus holidays. There's a two-week closure every December. Amazing health plans,. Free Caltrain and VTA. Alternative transit compensation. Healthy living incentives. Access to classes, gyms, libraries, and anything else the Stanford community has to offer.<p>* The work is incredibly meaningful and not profit-driven. Nothing wrong with profit, but if you're interested in just jumping into challenging work without worrying about money it can be a benefit.<p>* You work with people who are the best in the world at what they do.<p>* Travel opportunities for conferences on occasion.<p>Questions: palexander@stanford.edu<p>edit: formatting","time":1304285378,"type":"comment"}