{"by":"Najeeb17","id":9812328,"parent":9812245,"text":"modblock - Co-founder&#x2F;CTO (with Game Dev XP) - London, UK - <a href=\"http:&#x2F;&#x2F;modblock.net\" rel=\"nofollow\">http:&#x2F;&#x2F;modblock.net</a><p>modblock is a startup operating in the gaming industry, looking to bridge the gap between freelance developers and actual game developers. Our product is a software, built to ease the integration of content created by freelance developers into existing video games.<p>Our ambitions with modblock are to provide new gaming experiences for players, empower freelance developers and enable game developers to leverage more out of their games with new streams of content. Each of these ambitions has its own challenges, but we’re convinced that execution could represent a real turning point in game development.<p>moblock is still at an early stage and we are looking to hire a CTO with great game development experience, to build our product and help us turn modblock’s vision into reality. More than experience, we’re looking to bring on board a true gaming passionate that wants to have a positive impact on the industry!<p>Responsibilities:<p>- building the modblock platform and ensure its maintenance for a smooth end-user experience.<p>- working closely with CEO to ensure that modblock vision is maintained throughout the development phase.<p>- ensure that customer feedback is taken into account and implemented to improve the experience.<p>- having an vivid interest in innovations in the fields of software and gaming developments.<p>The ideal candidate will have the following skills and experience:<p>- 5+ years of game development experience and modding, knowledge of C++&#x2F;C# a plus.<p>- Extensive knowledge of software and web development (HTML, CSS) desirable.<p>- Strong passion for gaming and extensive knowledge of the PC gaming landscape.<p>- Based in London, although we will consider applicants from other locations.<p>If you&#x27;re interested, please contact founder Najib El Kihel @ najib@modblock.net.","time":1435763515,"type":"comment"}