{"by":"jetsnoc","id":9812840,"parent":9812245,"text":"KickBack Rewards Systems, Remote<p><pre><code>  KickBack Rewards Systems\n  http:&#x2F;&#x2F;www.kickbacksystems.com\n  http:&#x2F;&#x2F;careers.kickbacksystems.com\n\n</code></pre>\nKickBack Rewards Systems is a privately held company founded in 1999 that specializes in customer specific marketing and payments for over 1000 US clients. Our clients include a half-dozen Fortune 50 companies, one of them is an anchor partner in our national coalition loyalty program. As the CTO and Director of Software Development I need some help! You will be joining a medium sized team of 13 developers who all commit to their projects as a labor of love and their lives work. If you are interested in any of these positions my contact information is located under my profile.<p>-<p>Test automation lead<p>We are seeking a Test Automation Lead to join our Software Quality Assurance (SQA) team. Candidate must have a background in test automation and experience with web application front-end and back-end scripting. Candidates with previous experience on Agile teams will be well suited for this position. We are looking for a mid-level tester with leadership and management skill-sets. This is a full-time staff position located either in Twin Falls, ID or remote. If remote, candidate must be willing to work around regular MDT office hours. This is a full-time staff position. KRS will not consider outsourced or software development contracts.<p>-<p>Lead Senior Software Engineer<p>We are seeking a Senior full-stack Developer with leadership experience to act as our technical team lead for a newly formed features team. We’re looking for someone with a strong computer-science background who has deep JavaScript experience who can help the team develop better applications. The correct person must be a polyglot and should feel comfortable reviewing JavaScript, PHP, Python and have a willingness to learn C# (Xamarin) for mobile projects. Candidates with previous experience on Agile teams will be well suited for this position. The expectation is that this person would focus on front-end development and interface very closely with the back-end team, but all of our leads are competent full-stack developers and very ops savvy. Furthermore everyone is empowered to explore and implement new ideas and improvements. This is a full-time staff position located either in Twin Falls, ID or remote. If remote, candidate must be willing to work around regular MDT office hours. This is a full-time staff position. KRS will not consider outsourced or software development contracts.<p>-<p>DevOps Engineer<p>We are hiring for our DevOps Engineering team. KickBack is looking for a technical leader with proficiencies in modern DevOps tooling, network administration and, Linux server administration. This is a full-time staff position. KRS will not consider outsourced or software development contracts.<p>To apply: Email me, my contact information is located under my profile, or, visit <a href=\"http:&#x2F;&#x2F;careers.kickbacksystems.com\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.kickbacksystems.com</a>","time":1435766627,"type":"comment"}