{"by":"KenoFischer","id":9812644,"kids":[9815639],"parent":9812245,"text":"Julia Computing Inc [<a href=\"http:&#x2F;&#x2F;juliacomputing.com\" rel=\"nofollow\">http:&#x2F;&#x2F;juliacomputing.com</a>] | Cambridge, MA<p>Julia Computing Inc. is looking for an LLVM engineer to work on LLVM, LLDB and Clang to improve integration with the Julia programming language. Knowledge of Julia is not required, but deep knowledge of LLVM is. This position will involve significant contributions back to the open source to both the LLVM and Julia projects.<p>Immediate high-priority projects<p><pre><code>    - LLVM’s JIT debugging and debug info\n    - LLVM’s JIT threading support\n    - Julia’s Clang-based C++ FFI – Cxx.jl\n    - Julia’s (experimental) LLDB-based debugger\n</code></pre>\nOn-going responsibilities and longer-term projects<p><pre><code>    - Working with Julia code gen experts to improve Julia’s generation of LLVM IR\n    - Fixing LLVM bugs encountered by Julia (we use LLVM hard, so this happens a fair bit)\n    - Tuning LLVM optimizations for Julia’s usage patterns (which differ somewhat from C&#x2F;C++)\n    - Porting Julia to new architectures by adding&#x2F;enhancing LLVM backends.\n    architecture of interest include ARM, Xeon Phi (Knight’s Landing), GPUs\n    - Improving any relevant LLVM tooling\n</code></pre>\nBoth full-time employment and short-term consulting opportunities are available. This advertisement is for our Boston (Cambridge), MA, USA office and being local is ideal, but REMOTE engineers will also be considered. Applicants should possess demonstrable experience working in the LLVM ecosystem.<p>If this position interests you, or you have any questions, please contact us at jobs@juliacomputing.com.<p>About Julia Computing<p>Julia Computing was founded by the creators of Julia in response to industry demand for professional support, consulting and training. As part of our mission to make Julia the best technical computing platform in the world, we’re pushing the boundaries of what can be done with tools like LLVM. Julia Computing has offices in Boston, New York and Bangalore.","time":1435765493,"type":"comment"}