{"by":"erichurkman","id":9812670,"parent":9812245,"text":"eShares (<a href=\"https:&#x2F;&#x2F;esharesinc.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;esharesinc.com&#x2F;</a>) | Mountain View, CA | ONSITE | FULLTIME | VISA<p>eShares is set to bring technology to a financial market that&#x27;s been stuck in the dark ages. Prior to eShares, private companies tracked ownership with rusty legal documents and paper stock certificates. We&#x27;re replacing that with technology and bringing needed transparency to the process for companies, founders, lawyers, investors, and employees. We&#x27;re in the process of launching the one and only zero-cost tender offer, letting companies offer liquidity to their investors and employees without having to go public.<p>Many of the companies you see on this page use eShares, from the early stage startups all the way up to tech giants in the $1B+ club; clients range from a few entries on their cap table all the way up to thousands+ of employees&#x2F;investors.<p>We&#x27;re looking for a few more SENIOR FULL STACK ENGINEERS &#x2F; FULL STACK GENERALISTS. Desirable skills include:<p>• Python &#x2F; Django (we love Django)<p>• JavaScript<p>• PostgreSQL<p>• AWS &#x2F; general dev-ops (nice to have)<p> • General web development<p>A financial background is not required. Why choose eShares?<p>• Great benefits (salary, equity)<p>• Get involved at the financial center of the startup world<p>• Raised $7mm in January from Union Square Ventures, Spark Capital<p>• Very rapid growth<p>• Great engineering&#x2F;product team with fantastic product designers<p>• Sane work&#x2F;life balance<p>ALSO LOOKING FOR:<p>• Account Managers to help move start ups&#x27; equity to eShares (we&#x27;re signing up hundreds of company&#x27;s each month) (from junior, fresh out of college to senior account managers)<p>• Customer success (our customers love us; you can help too!)<p>• Human resource manager<p>CONTACT: eric.hurkman+hiring@esharesinc.com ; skype eric.hurkman.0","time":1435765642,"type":"comment"}