{"by":"jwpeppa","id":9812409,"parent":9812245,"text":"<i></i>Position:  \tCTO<p><i></i>Location:\tNY Metro (ideal), but will look at Remote (Continental 48 States)<p><i></i>Company:\tWine Kloud – www.winekloud.com<p>_____<p>COMPANY OVERVIEW:<p>Wine Kloud is a content curator of daily wine deals from over 1,000 retailers nationwide.  WK leverages the hottest trends (daily deals) in popular culture and marries them with wine.  Think Kayak for travel meets wine.  And the timing is perfect.  Why?  Wine Kloud is part of an industry segment that tends to be behind the tech curve as compared to its target audience – wine drinkers!  We are not only prepared to change the way an industry operates, but set to change the way millions of consumers buy wine.  That is powerful and the CTO will be an integral part that makes it all happen.<p>WK has not launched yet, but will be live in a couple of weeks.  The initial buildout was outsourced to a development firm.  We have secured funding and will be happy to disclose all of that information to serious and interested candidates.<p>_____<p>POSITION DESCRIPTION&#x2F;REQUIREMENTS:<p>We are in search of a team member, not a rogue.  We are collaborators, not dictators.  Sounds cliché, but very true.  We want to foster an environment in which we all have valuable input and can work positively and effectively toward the common goals of the company.  To be clear, the individual we hire will have full direction over the tech strategy, but that strategy will be designed and created as a result of the management goals, which this person will help establish.<p>We need someone who can innovate, plan, build, implement, and drive all of the company’s tech initiatives, including coding.  While we have plans to build out a team underneath this person in the very near future, in the beginning, they will have to roll up their sleeves and code.  This is not a country club position in which they delegate.  This is a startup.  This individual will also be responsible for maintaining all aspects of our software, from debugging to taking preventative measures to ensure uptime.<p>This person’s actions will directly shape the company.  Their stamp will be all over Wine Kloud.  This is a big role and requires someone with the experience and acumen to fill it.  We need someone who is passionate about building and problem solving.  Someone who can contribute to and incorporate the company vision.  Someone entrepreneurial in nature with the ability to lead and, ideally, successful startup experience.  And possibly most important, someone who is committed to the success of the organization.  We are not looking for a year-long commitment from someone.  We need someone onboard who will see out the company’s success.<p>_____<p>TECH PROFILE:<p>Here’s the tech stack that our developers are working with.  The ideal hire will know these well:<p>- Python<p>- Django<p>- MySQL<p>- Redis<p>- Celery<p>- Stream Framework<p>- Python Social Auth<p>- Apache<p>- 3rd Party Services like Payment Gateways<p>_____<p>Please submit your resume or address questions to info@winekloud.com.  Thanks…","time":1435764126,"type":"comment"}