{"by":"amattn","id":9812298,"parent":9812245,"text":"Collective Health, ( <a href=\"http:&#x2F;&#x2F;collectivehealth.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;collectivehealth.com&#x2F;</a> ), San Mateo, CA (Full time, ONSITE only)<p>We&#x27;re tackling the employer-sponsored healthcare industry (our favorite analogy is how Tesla takes on several verticals at once, such car makers, dealers as well as the oil industry). We can lower both the first and second derivative of the rising health care cost curve, nationwide. There&#x27;s some compelling evidence we can do so, if you&#x27;d like to chat.<p>The company just under a year and half old. We punch well above our weight-class with experienced founders, 60+ team members (~ one quarter is engineering), and paying customers.<p>If you&#x27;re interested in some challenging work, you should let me know. We&#x27;ve got a ton of interesting problems to solve around distributed systems, data analytics and predictions, complex data modeling, ultra high-availability, security, privacy and more.  We&#x27;re currently looking for experienced SW engineers up and down the stack, back end, infrastructure, data, dev ops, test, generalist, etc.<p>Our tech stack is a mix of Go and Java components with Angular on the front end. We use a custom service bus to tie our SOA together, microservices style. We love Docker, CoreOS, postgres, riak, automated testing, and continuos integration.<p>As a company, we&#x27;re strong believers in transparency, trust and balance. As an engineering team, we believe good code is easy to read and should have a short &quot;time to understanding&quot;. We expect all of our engineers to continually teach as well as learn. We also believe that everyone should write good code, yet balance that against the need to ship.<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;collectivehealth\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;collectivehealth</a><p>We&#x27;re super proud of the company mission, engineering culture and tech stack we&#x27;ve put together and would love a chance to explain it all in detail!","time":1435763273,"type":"comment"}