{"by":"ryhanson","id":9812789,"parent":9812245,"text":"Royal Jay LLC (<a href=\"http:&#x2F;&#x2F;royaljay.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;royaljay.com&#x2F;careers&#x2F;</a>) | Boise, ID | Senior Software Developer, Copywriter<p>We are located in Boise, ID, A clean, safe city with a low cost of living ideal for families, outdoor enthusiasts and entrepreneurs. Boise is a regular in the Top 10 lists (go ahead, google it), and we love it here. Check out these videos and you’ll see why:<p>Boise is Waiting (<a href=\"https:&#x2F;&#x2F;vimeo.com&#x2F;81424694\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;81424694</a>)\nThis is Boise (<a href=\"http:&#x2F;&#x2F;www.boisestatefootball.com&#x2F;boise-0\" rel=\"nofollow\">http:&#x2F;&#x2F;www.boisestatefootball.com&#x2F;boise-0</a>)<p>Copywriter:\nRoyal Jay is actively recruiting an experienced copywriter. The ideal candidate has a proven track record delivering high-quality persuasive copy in the digital space. They posses a talent for transforming creative ideas into engaging copy, and have a passion for storytelling.<p>The copywriter will work closely with the digital strategist and UX&#x2F;UI designer to execute online marketing campaigns, website content and software messaging.<p>Senior Software Developer:\nRoyal Jay is actively recruiting creative and inventive Sr. Software Developers. The ideal candidate has a proven track record of delivering software solutions using the latest technologies and continues to keep their skills sharp, staying current on all new development trends, techniques, and frameworks. Our Developers are hungry for challenging work, enjoy pushing boundaries, and would rather create software vs. be stuck in meetings all day.<p>The Sr. Software Developer is an active developer and leader on a first class team, building next generation mission critical applications that are highly scalable, secure and fast, wrapped in a pixel perfect user experience.<p>In exchange for your innovation and talent we will offer you an environment where you are rewarded for your contributions, appreciated for your ideas, and empowered to make a difference. Come have a beer with us and discover working for a company created by developers, passionate about building great products that inspire people.<p><a href=\"http:&#x2F;&#x2F;royaljay.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;royaljay.com&#x2F;careers&#x2F;</a>","time":1435766311,"type":"comment"}