{"by":"jhdavids8","id":9812329,"parent":9812245,"text":"Pathgather | New York, NY | onsite preferred, will consider remote<p>Pathgather is Techstars NYC company building an enterprise learning platform that - unlike traditional learning systems forced on employees - is one you&#x27;ll actually enjoy using. We’re solving a big problem felt by almost all growing companies: how to continuously train and educate your workforce with modern&#x2F;relevant content.<p>One way we&#x27;re doing that is through the flexibility in our platform, which supports a variety of integrations. Because of that, we deal with lots of APIs.<p>We&#x27;re looking for an API expert to join our small but growing team. You&#x27;ll own the API we provide to companies like Qualcomm, Walmart, and Twitter, and you&#x27;ll help expand our suite of 3rd party integrations. You&#x27;ll have significant impact on every customer deployment and the opportunity to interface with the talented engineers consuming our APIs.<p>About You<p>- You&#x27;re an API expert. You of course prefer JSON REST APIs but can deal with an XML SOAP API if need be.<p>- You understand and have opinions on common API authentication methods like OAuth, JWT, etc<p>- You understand SQL (ideally Postgres). Maybe you&#x27;ve worked with ORMs like ActiveRecord and&#x2F;or Sequel.<p>- You have experience with Ruby&#x2F;Rails (or a similar language)<p>- Perhaps you&#x27;ve dealt with Redis and Elasticsearch too, but if you haven&#x27;t, no worries. We&#x27;ll give you the chance to in any case.<p>Responsibilites<p>- Lead and develop integrations that enhance our learning content offerings to our customers<p>- Enhance the API we provide to our customers (docs.pathgather.com). Some of the functionality you might add include analytics reporting and bulk creates&#x2F;updates.<p>- Help define the strategy for the launch of a Pathgather partner program&#x2F;platform. This project would allow partnered content vendors to integrate with Pathgather in a variety of ways via defined standards and API communications.<p>If you&#x27;re interested, please contact me at jamie@pathgather.com. We have a great work environment in our Union Square office and would love for you to be a part! You can also see more about us and what we offer at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;pathgather&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;pathgather&#x2F;jobs</a><p>Contact: jamie@pathgather.com","time":1435763516,"type":"comment"}