{"by":"sinneduy","id":9813767,"parent":9812245,"text":"Pixlee | San Francisco, CA | Full Time | ONSITE<p>Pixlee is revolutionizing the relationship between people and brands. We help companies leverage customer photos&#x2F;videos from social media to improve marketing.<p>We work with over 100+ customers, including top brands such as Converse, Kenneth Cole, UGG Australia, Mattel, Charlotte Russe, Marriott Hotels, and AMC Theatres, to drive higher online conversion, increase performance of owned media, and create a more authentic brand experience.\nA graduate of the Stanford StartX accelerator, Pixlee is an Andreessen Horowitz and XSeed Capital portfolio company. As a rapidly growing startup, we are constantly looking for talented people to join the Pixlee team and to help us revolutionize the intersection of big data and social media.<p>At Pixlee we work hard, love to learn, and value teamwork and humility. We’ve got a big vision and we’re looking for game changers to join our team.<p>We look for talented, high-potential individuals who aren’t jerks. Our proposition to them is simple: Pixlee offers a unique opportunity to thrive and grow rapidly in a small-team startup environment operating at big-company scale. Our customers are some of the largest brands in the world and everything you do here affects millions of consumers.<p>For me, I&#x27;ve really felt that I&#x27;ve been able to really grow very rapidly, and also been given the autonomy to make many decisions you can&#x27;t make at a much larger startup.  Its a very tight knit group, and we like to have fun.<p>We believe in using the right technology for the task, and we use a mix of rails, backbone, python, scala, elasticsearch, and postgres.<p>Engineering openings: <a href=\"https:&#x2F;&#x2F;pixlee.workable.com&#x2F;jobs&#x2F;66247\" rel=\"nofollow\">https:&#x2F;&#x2F;pixlee.workable.com&#x2F;jobs&#x2F;66247</a>, <a href=\"https:&#x2F;&#x2F;pixlee.workable.com&#x2F;jobs&#x2F;70151\" rel=\"nofollow\">https:&#x2F;&#x2F;pixlee.workable.com&#x2F;jobs&#x2F;70151</a>\nOther: <a href=\"http:&#x2F;&#x2F;www.pixlee.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pixlee.com&#x2F;careers</a><p>You can also email a resume&#x2F;portfolio to dennis[at]pixleeteam.com","time":1435772965,"type":"comment"}