{"by":"datahipster","id":9813221,"kids":[9814290],"parent":9812245,"text":"Oregon Health &amp; Science University | Scientific Programmer | Portland, OR | ONSITE | Full Time | Relocation available<p>We are seeking a skilled scientific programmer to develop genomic, imaging, and clinical analysis applications on a distributed data &#x2F; workflow management and analytics platform currently under development. This position will work in a team oriented software development environment, following best practices such as code sharing through GitHub and development of structured software APIs. A successful candidate will contribute to the international development of standardized APIs and data schemas, and develop implementations compatible with such APIs, ensuring that the system is interoperable within the emerging community ecosystem of software tools.<p>Responsibilities<p>+ Develop custom analytics and data management applications to facilitate one or more of the following: large-scale genomic data analysis; machine learning methods to infer genotype-to-phenotype predictive models; analysis of quantitative imaging data.<p>+ Work with the platform development team to implement scalable cloud-enabled workflows to disseminate analytical advances to the research community.<p>+ Establish and maintain standards for structured software &amp; systems engineering, including requirements, design, code, test, quality, configuration &amp; release management and project management.<p>+ Provide documentation and user support allowing computational researchers across campus to access and re-use analysis tools.<p>+ Maintain well-curated, highly structured, transparent omics, imaging, or clinical data resources.<p>+ Develop tools to integrate commonly used open source bioinformatics software applications.<p>+ Participate in leading international efforts aimed at establishing best practices and standards for genomic data representation and analysis.<p>The job posting is available at: <a href=\"https:&#x2F;&#x2F;ais.ohsu.edu&#x2F;OA_HTML&#x2F;OA.jsp?page=&#x2F;oracle&#x2F;apps&#x2F;irc&#x2F;candidateSelfService&#x2F;webui&#x2F;VisJobSchPG&amp;_ri=821\" rel=\"nofollow\">https:&#x2F;&#x2F;ais.ohsu.edu&#x2F;OA_HTML&#x2F;OA.jsp?page=&#x2F;oracle&#x2F;apps&#x2F;irc&#x2F;ca...</a><p>If you have any questions, feel free to send a note to novast@ohsu.edu.","time":1435769135,"type":"comment"}