{"by":"ripap","id":9813929,"kids":[9815818],"parent":9812245,"text":"Princeton, NJ &#x2F; Full Time &#x2F; Onsite<p>The Department of Astrophysical Sciences at Princeton University has an open position for an experienced software developer to work on the development of the scientific data processing pipelines for the Large Synoptic Survey Telescope (LSST). The role will involve working with Jim Bosch &amp; John Swinbank within the Princeton Astronomical Data Group (led by Robert Lupton, Michael Strauss and Jim Gunn), which, in addition to LSST, is deeply involved in the Hyper Suprime Cam and Prime Focus Spectrograph instruments on the Subaru Telescope and expects to play a part in WFIRST, the space-based Wide Field Infrared Survey Telescope.<p>The LSST will conduct the largest astronomical survey yet undertaken, observing a total of 20000 square degrees in six bands and around 1000 epochs, collecting over 50 PB of raw data and measuring the properties of 40 billion astronomical sources. Princeton is responsible for multi-epoch deep imaging and catalog production based on the LSST survey. All software written for LSST will be made freely available under an open source license; all data collected made publicly available within the US with no proprietary period.<p>This is a grant-funded, one-year term position with possibility of renewal.<p>We are seeking an experienced scientific software developer to contribute to the development of the scientific algorithms and supporting infrastructure. The ideal candidate would have at least 5 years of C++ expertise (required) and experience with collaborative software development in an astronomical environment (preferred). Knowledge of Python would be advantageous. An advanced degree in Physics, Astronomy, Computer Science or a related field, or equivalent practical experience is required.<p>We are seeking to recruit from as diverse a pool of talent as possible, and endeavor to preserve the Astrophysical Sciences Department&#x27;s reputation as a pleasant workplace with a lively and friendly scientific atmosphere which recognizes that technical innovations are an important intellectual contribution to the science produced by major astronomical surveys.<p>Interested persons should send a curriculum vita including bibliography, if applicable, and provide contact information for three references. The final candidate will be required to complete a background check successfully.<p>For further inquiries, contact John Swinbank (swinbank at princeton.edu) or Jim Bosch (jbosch at astro.princeton.edu). Apply online at  <a href=\"https:&#x2F;&#x2F;jobs.princeton.edu&#x2F;applicants&#x2F;jsp&#x2F;shared&#x2F;position&#x2F;JobDetails_css.jsp?postingId=211990\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.princeton.edu&#x2F;applicants&#x2F;jsp&#x2F;shared&#x2F;position&#x2F;Jo...</a>.","time":1435774219,"type":"comment"}