{"by":"akurilin","id":9813179,"parent":9812245,"text":"[Front Row Education (San Francisco, CA) www.frontrowed.com]<p>Foundational Systems Engineer with DevOps focus to join fast-growing education startup that changes how over a million young students learn math.<p>Our mission is important to us, and we want it to be important to you as well: over a million K-8 students learn math using Front Row every month. Our early results show students improve twice as much while using Front Row than their peers who aren’t using the program.<p>You’ll be one of the first engineers on the team, which means you’ll have an immense impact on our company, product, and culture; you’ll have a ton of autonomy and responsibility; you’ll have equity to match the weight of this role. If you&#x27;re looking for an opportunity to both grow and do meaningful work, surrounded and supported by like-minded professionals, this is THE place for you.<p>Front Row is one of the very few organizations in the world that use Haskell in production for most of their systems and is an active member of the Haskell community, including the Commercial Haskell Special Interest Group.<p>- Be able to work quickly and without handholding or supervision. You will have great autonomy. We&#x27;re a small team and everybody easily pulls twice their weight<p>- You&#x27;re morbidly well-organized, love documenting and obsess over continuously improving existing processes<p>- Relentlessly automate ALL the things: this is not a sysadmin position, this is developer position that removes the need for most system administration<p>- You&#x27;re not religious about any technologies, tools or approaches: the landscape of devops changes every day, new tools emerge, new techniques become trendy. A great devops engineer stays up to date with the emergent technologies, but is committed to using the right tool for the job, whether that&#x27;s an allen wrench or an immutable cluster<p>- You must care about being great at what you do. Front Row engineers are craftsmen who take pride in their work<p>- Must thrive on both technical breadth and depth. As a Front Row Systems Engineer, you will be taking care of setting up, maintaining and scaling a wide variety critical supporting infrastructure that makes running our applications possible and pleasant<p>- Experience working with cloud APIs, configuration management, deployment<p>- Experience running, maintaining and scaling RDBMS - we&#x27;re heavy Postgres users and deal with a lot of critical data<p>- You love sharing your knowledge and teaching others about systems engineering and devops. Front Row has a very active culture of sharing of knowledge and best practices. As our first Systems Engineer, you will be setting much of the technical culture for the organization.<p>Full description and application at <a href=\"http:&#x2F;&#x2F;frontrow.workable.com&#x2F;jobs&#x2F;70963\" rel=\"nofollow\">http:&#x2F;&#x2F;frontrow.workable.com&#x2F;jobs&#x2F;70963</a>","time":1435768870,"type":"comment"}