{"by":"calbear81","id":9813944,"parent":9812245,"text":"San Francisco, CA - CheckMate - On-Site<p>With the backing of a seasoned management team and experienced investors, CheckMate is creating a new category of software within the hospitality industry. CheckMate’s Guest Experience Management platform allows guests to control their hotel stay from their mobile device. From check-in to check-out and everything in between, we’re using mobile to create iconic moments for guests and enabling hotels to deliver superior service. We’re looking for experienced, intelligent​, ​and hardworking engineers to help bring this vision to life.<p>​Please see below for all our openings on the Engineering Team.​<p>Front-End Engineer - Fluency in JS and CSS is required. Production-level experience with Ember desired but open to equivalent experience in other frameworks (Angular, React, etc.) with a strong desire to become an expert in Ember.​<p>Software Engineer - Generalist - ​Do you have experience with a technology stack that includes:​ ​Ruby​ ​&#x2F;​ ​Rails​ ​&#x2F;​ ​PostgreSQL​ ​&#x2F;​ ​Redis​ ​&#x2F;​ ​Memcached​ ​&#x2F;​ ​Heroku​ ​&#x2F;​ ​AWS​ ​&#x2F;​ ​ElasticSearch​ ​&#x2F;​ ​Go​? Plus experience with Ruby and Rails and a love of the internet and related technologies​?<p>Software QA Lead - We are seeking ​a ​​QA lead​ ​who can​ ​build a world-class QA team​ ​that is capable of ensuring high quality deployments.​ ​Specifically we use RSpec for testing our Rails application.<p>Lead Data Scientist &#x2F; Engineer - The ideal candidate has an eye for detail, great communication, and a keenness for problem solving. As our first data scientist you would also need to have a strong desire to wear many hats from data science to data analyst to data engineer.<p>Machine Learning Software Engineer - ​Do you have NLP experience​?​ ​E​xtensive experience building and productionizing cutting edge Machine Learning systems end-to-end? ​Plus ​a good understanding of the mathematical underpinnings behind Machine Learning algorithms?<p>Apply here! <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;checkmate&#x2F;?lever-source=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;checkmate&#x2F;?lever-source=HackerNews</a>","time":1435774288,"type":"comment"}