{"by":"pyduan","id":9813630,"parent":9812245,"text":"Bayes Impact | Project Development Lead | San Francisco, CA | ONSITE<p>Bayes Impact is a technology nonprofit that uses data science to solve pressing social challenges across the globe. We build intuitive and powerful software applications that empower governments, nonprofits, and individuals to make critical, data-driven decisions. Our goal is to turn data into actions that impact the lives of billions of people. We believe that while technology shows tremendous promise when it comes to revolutionizing the social space, prototypes and proofs and concept are not useful unless they&#x27;re actually implemented and as such we only focus on a small number of high impact, long term projects.<p>ABOUT THE ROLE<p>We are looking for an explorer and visionary to join our team and develop our next big projects. Can algorithms be used to save lives by reducing wait times for ambulance dispatch? Will better data systems improve transparency in the criminal justice system? Is data science the key to realizing the future of personalized health? You will identify big questions like these and answer them with game-changing technology solutions.<p>Our mission is not just to create reports and recommendations; we build production-level software applications and deploy them in the field. However, turning an idea into a full-fledged operational solution that could improve the lives of millions is no small feat. If you thrive in ambiguity and hustle by nature, this role is for you.<p>We are looking for someone who can become an overnight expert in social issues, build partnerships, engage researchers, convince funders, negotiate roadblocks, sizing up incumbents, identify relevant technologies, devise software solutions, and do whatever it takes to make things happen.<p>If you’re interested, please send us your resume and a bit about what you want in your work (&#x2F;life&#x2F;love&#x2F;next meal&#x2F;etc). Email us at careers@bayesimpact.org. We’ll listen and get back to you.<p>More details here: <a href=\"http:&#x2F;&#x2F;www.bayesimpact.org&#x2F;stories&#x2F;?name=bayes-impact-is-hiring-a-project-development-lead\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bayesimpact.org&#x2F;stories&#x2F;?name=bayes-impact-is-hir...</a><p>(We are also accepting applications for full-time data science and software engineering positions.)","time":1435772092,"type":"comment"}