{"by":"blo","id":9813717,"parent":9812245,"text":"Vurb - San Francisco, CA - <a href=\"http:&#x2F;&#x2F;vurb.com\" rel=\"nofollow\">http:&#x2F;&#x2F;vurb.com</a><p>We launched in February on iOS (&quot;Best New Apps&quot;) - <a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;02&#x2F;26&#x2F;mobile-search-david-vs-googliath&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;02&#x2F;26&#x2F;mobile-search-david-vs-goog...</a> We also won TC Disrupt and raised over $10M with a small team<p>WHAT WE DO: Vurb is creating a single app mobile search and sharing experience - partnering with services like Yelp, Foursquare, Rotten Tomatoes, etc. Rather than jumping between different apps to find something, we&#x27;re delivering a cohesive experience in one place - an app you&#x27;ll use every day.<p>INVESTORS: Max Levchin, Drew Houston, Naval Ravikant, CrunchFund, Redpoint + others.<p>APPLY IF: You are looking for a rapidly growing small team and the opportunity to take on significant responsibility and ship quickly. Examples of challenging problems that you could help us solve include:<p>- Manage and index millions of objects around places, events, movies, etc with blazing fast read-write access<p>- Develop search relevance and content discovery infrastructure on millions of objects and TB’s of data<p>- Develop mobile apps for not only scaling app performance but architecting the app to support a growing number of services and verticals<p>LOOKING FOR:<p>* Full-stack Engineer &#x2F; DevOps - generalist opportunities across the stack: backend, frontend, devops. JavaScript, node.js, backbone.js, AWS<p>* Mobile Engineer - iOS &#x2F; Android engineers (2+ years experience)<p>* Search &#x2F; Data Scientist &#x2F; Data Engineer - search, classification, ranking, ML, graphs, data crawling&#x2F;processing. Advanced CS degree required.<p>* Product Designer - strong mobile UI&#x2F;UX skills<p>* Growth Lead - drive growth initiatives across product and marketing<p>INTERESTED? <a href=\"http:&#x2F;&#x2F;vurb.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;vurb.com&#x2F;careers</a> | jobs@vurb.com |\nOn-site only, H1B transfers OK","time":1435772639,"type":"comment"}