{"by":"Curaladie","id":9813749,"kids":[9819203],"parent":9812245,"text":"Curalate (NYC, SEATTLE <i>OR</i> PHILLY!) Apply here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;curalate#.VZQmUxPBzGf\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;curalate#.VZQmUxPBzGf</a><p>Curalate is the world’s leading marketing and analytics suite for the visual web. We help brands tell their story through imagery in order to drive consumer engagement, build brand awareness, and form stronger, more meaningful relationships with consumers. Our team consists of startup veterans, social media savants, pixel pushers, and big-data bosses. Oh, and we’re building a platform that’s already in use by hundreds of the world’s leading brands.<p>We&#x27;re not language zealots; we believe in using the right tool for the job, and are comfortable with a polyglot codebase.<p><i>Full Stack Engineers</i> \n  -  Languages: Scala, Javascript<p><pre><code>  -  Infrastructure: AWS, Asgard\n\n  -  Databases: Cassandra, MySQL (RDS), DynamoDB, Redis, Redshift, CloudSearch\n\n  -  Frameworks: Finagle, Storm, Scalatra, Lift\n\n  -  Front End&#x2F;Mobile: AngularJS, Bootstrap, Backbone, Ionic\n\n</code></pre>\n<i>DevOps</i>\n  -  Build and Deployment: Jenkins, Chef, Packer, Asgard<p><pre><code>  -  Frameworks&#x2F;Infrastructure: AWS, Finagle, Storm, Scalatra, Lift, Kafka, ZooKeeper\n\n  -  Datastores: Cassandra, MySQL (RDS), DynamoDB, Redis, Redshift, CloudSearch\n\n  -  Front End&#x2F;Mobile: AngularJS, Bootstrap, Backbone, Ionic\n\n  -  Languages: Scala, Javascript\n\n</code></pre>\n<i>Front End (Solutions) Engineer</i> -  \nAs a Front End (solutions) engineer, you’ll play dual roles of web developer and technical project manager.  As a web developer, you’ll write tight HTML, CSS, and Javascript to seamlessly integrate and customize Curalate’s products.  Your work will be highly-visible -- over five million customers will see it every day -- so the margin for error is small.  Because Curalate’s DNA is that of a software company, you can expect best-of-class tooling and processes (think code reviews, linting, etc.) to support every integration you work on.<p><i>Product Manager</i> -  \n  -  Work with founders to document the long-term vision into a coherent roadmap.<p><pre><code>  -  Translate long-term vision into actionable short-term and medium-term roadmaps.\n\n  -  Write goldilocks specs -- enough to get the feature built, no more.\n\n  -  Work with design and engineering teams to research feature feasibility and cost review specs (functional specs, wireframes, and visual designs)\n\n  -  keep products on track by rapidly removing roadblocks identity, gather, and analyze success metrics\n\n</code></pre>\n<i>Product Design</i> - \n  -  Create interaction models, screen designs, and UI details that promote ease of use and optimize the user experience<p><pre><code>  -  Manage multiple projects, working closely between product and engineering\n\n  -  Iterate on your ideas quickly and effectively\n\n  -  Obsess over details and consistency, but see the bigger picture\n\n  -  Contribute to high-level strategic decisions with the rest of the product and executive team\n\n  -  Own and maintain our product style guide</code></pre>","time":1435772824,"type":"comment"}