{"by":"hectorals","id":9813004,"parent":9812245,"text":"URX | urx.com&#x2F;careers | San Francisco | Senior Software Engineer, Web Applications<p>URX is a mobile technology company that shows contextual ads that link into apps.  Our platform is powered by a deep link API that finds relevant in-app destinations based on context and intent.  URX is a Y Combinator alum and has raised over $15 million in Series A capital from investors like Accel Partners, First Round Capital, Google Ventures and SV Angel. We’re currently at 35 people and based in San Francisco, CA.<p>We’re looking for our first dedicated Web Applications Engineer to build our self-serve dashboards and the server backend for our mobile SDKs. We have been seeing millions of daily users interact with our search widgets across iOS, Android and mobile web platforms. The notion of connecting users across apps is becoming increasingly relevant and with our unique AppViews technology app marketers are able to bring users to contextually relevant landing pages. As we grow these marketers will rely on our tools to adapt and improve their campaigns.<p>What you will do:<p>Build our outward-facing web apps and services, including both card UI server and self-serve customer dashboards&#x2F;reporting tools\nWork on the web services that integrate dashboards and card UI&#x27;s with the backend search &amp; data infrastructure teams\nCollaborate with Product and Marketing with user testing and improvements to our apps\nPresent the best UX and UI with our Design team\nWhat we look for:<p>Solid understanding of modern web application development\nDeep knowledge of web standards: HTTP, caching, etc\nExperience with Python (we use tornado and flask) would be advantageous\nExperience with Golang or JavaScript is a plus\nStrong understanding of concurrency\nStrong CS fundamentals, whether self-taught or college learned\nPassion for improving the way in which end users connect<p>Great benefits and perks!<p>To apply or find out more email hector@urx.com or careers@urx.com.","time":1435767579,"type":"comment"}