{"by":"JASchrodinger","id":9814125,"parent":9812245,"text":"Schrödinger | NYC | System Administrator | Full-Time&#x2F;Onsite<p>THE COMPANY<p>Schrödinger aims to provide integrated software solutions and services that truly meet its customers’ needs. We want to empower researchers to achieve their goals of improving human health and quality of life through advanced computational techniques that transform the way chemists design compounds and materials.<p>By building and deploying breakthrough scientific software solutions and forming collaborations and partnerships, we help scientists accelerate their research and development activities, reduce costs, and make novel discoveries that might otherwise not be possible.<p>THE ROLE<p>As part of the IT team at Schrödinger, you form the basis for all other work in the company. We’re looking for a person with a strong systems background who can understand the &#x27;why&#x27; along with the &#x27;what&#x27;. We are a global company, and you will propose and lead key projects to ensure Schrödinger’s infrastructure is at the forefront of computational science and industry today. You’ll be comfortable taking the lead in a collaborative environment where IT is appreciated and understood by a large number of our users.  We’re looking to you to provide expertise for a broad range of architectural issues - especially Windows&#x2F;AD related aspects.  We’re a dynamic organization and rapidly evolving.  We want you and your experience to be a part of that.<p>OUR TOOLS, TOYS, AND SOME BUZZWORDS<p>- AD &#x2F; SSO, DNS &#x2F; DHCP, WDS, SQL<p>- Jira, Agile, DevOps, Git, SaltStack, Chef, AWS, VMware, VNX, Isilon<p>CUSHY STUFF<p>- Catered lunch, M&#x2F;W&#x2F;F. Catered breakfast T&#x2F;H<p>- Fully stocked fridge &amp; pantry<p>- Ping pong, foosball, arcade room<p>We are prepared to offer a highly competitive compensation package for an exceptionally well-qualified candidate. Benefits include medical, dental, 401(k), flexible spending account, 3+ weeks vacation, and tuition reimbursement.<p>Learn more and apply directly via our website at: <a href=\"https:&#x2F;&#x2F;www.schrodinger.com&#x2F;careers&#x2F;description&#x2F;224\" rel=\"nofollow\">https:&#x2F;&#x2F;www.schrodinger.com&#x2F;careers&#x2F;description&#x2F;224</a>","time":1435775684,"type":"comment"}