{"by":"lucid304","id":9814184,"parent":9812245,"text":"Lucid – Oakland, CA\nSoftware Engineers - Full Stack and Javascript<p>Have you ever wanted to change the world? At Lucid our products are doing just that.  We enable the future of intelligent buildings by connecting hardware, software, and people through one collaborative interface: BuildingOS. Will you join us?<p>At Lucid our engineers develop well designed, responsive and engaging interfaces. We are tackling some of the toughest problems in the energy sector, the people who use it. Our engineering team is driven by technology and collaboration. We have smart people to work with, hard problems to solve, and every developer at Lucid has huge impact on the development of our product.<p>What are we building?\n* A Real-time Measurement and Verification engine for analyzing energy spend.\n* A Commercial implementation of IoT (Internet of Things) Controls.\n* A Gamification platform for building occupant engagement.\n* A Collection of reactive components for distribution into the wild.\n* Interactive kiosks for education.\n* Administrative tools and connectors to enable a holistic view of all energy consumption data.<p>How is it built?\n* Python, Django, Our REST&#x27;ful API, HTML&#x2F;CSS&#x2F;JS, SASS, Bootstrap, jQuery, require, Backbone, React, Flux, d3, Your code<p>Lucid Engineers collaborate constantly with a collection of great people who are all engaged in learning and building a great system, and use the latest tools and techniques to create the slickest system around.<p>You can read more about our company at <a href=\"http:&#x2F;&#x2F;luciddesigngroup.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;luciddesigngroup.com&#x2F;</a> and our open positions at <a href=\"http:&#x2F;&#x2F;luciddesigngroup.com&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;luciddesigngroup.com&#x2F;careers.html</a><p>Please apply via our online application. <a href=\"https:&#x2F;&#x2F;engineering-careers.luciddg.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering-careers.luciddg.com&#x2F;</a>","time":1435776094,"type":"comment"}