{"by":"Kerrick","id":9814878,"parent":9812245,"text":"Second Street | <a href=\"http:&#x2F;&#x2F;secondstreet.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;secondstreet.com&#x2F;</a> | St. Louis, MO | Full-Time, Onsite.<p>Second Street helps media and marketing teams grow and understand their audience with our easy-to-use promotions, messaging, and data analysis web platform.  CBS, Entercom, ESPN, The Washington Post, Sports Illustrated, and over 3,000 others rely on Second Street to create meaningful interactions with their consumers.<p>We’re a close-knit, vibrant organization located in downtown St. Louis -- close to Wash Ave, the Metro lines, and the Arch.  Second Streeters have a passion for software and the success of our customers.  We host local meetups whenever possible, including the STL Ember.js meetup.  More than anything, we value and trust each other.  We set our own goals and and give everyone the opportunity to offer feedback on major projects.  We keep it casual and work together to get things done.<p><i></i> Position Summary <i></i><p>This position will be a member of our cross-functional development team which is made up of designers, testers, back-end developers, and front-end developers.  Members of the team enjoy a high level of autonomy while also working very collaboratively in-person and using Slack, Trello, and Hangouts.  We work together to ship code every day and are constantly looking for ways to improve.   Developers at Second Street are fully involved in every part of the process, from planning, to developing, to testing, to launch.  We strive to use best practices including version control, automated testing, responsive design, code reviews, and occasional pair programming while keeping an eye toward usability and user experience.  This position, in particular, will have a special focus on making sure we’re using best practices in our front-end development, especially with Ember.js.  A typical day could consist of anything from spooling up a new ember-cli application and integrating with our existing library of ember-cli addons to helping another member of the team work through a particularly vexing issue.<p><i></i> Benefits <i></i><p>- Competitive Salary<p>- Unlimited PTO<p>- 401k with company contribution<p>- Development retreats every six months<p>- Computer of your choice<p>- Relocation reimbursement<p>- Free parking or a Metro pass, your choice<p>- Private gym in the basement of our historic building<p>- Professional development courses and conference opportunities<p>- Our focus on employee happiness leads to fun surprises like office scooters, renting out movie theaters, and a semi-annual week full of fun, food, and games known as Company Week<p>- Our incredible medical, dental, and vision benefits are 100% covered for you, and 50% for your family<p>- We work in a fun office environment with a shuffleboard table, Wii, gym, and full kitchen including a perpetually stocked kegerator<p>For more information, or if you&#x27;re interested, please get in touch! <a href=\"http:&#x2F;&#x2F;secondstreet.com&#x2F;careers&#x2F;#senior-front-end-dev\" rel=\"nofollow\">http:&#x2F;&#x2F;secondstreet.com&#x2F;careers&#x2F;#senior-front-end-dev</a>","time":1435782225,"type":"comment"}