{"by":"stevelydford53","id":9815216,"parent":9812245,"text":"Codurance is hiring Software Craftsman ONSITE in London, UK.<p>You consider yourself a software crafter. You care about and are proud of the code you write. You care about doing meaningful work and providing value to your clients or employer via well-crafted code. For you, writing code is not just a job but also a passion.<p>Test-Driven Development is second nature to you and that&#x27;s how you write code. You don&#x27;t use &quot;lack of time&quot; as an excuse to do a mediocre job, and fully understand the long-term costs and benefits of hacking a project together. You prefer to work in small increments, trying things out and iterating rapidly, tightening the feedback loop as much as possible.<p>You are a team player. You understand that software lives on long after it is first delivered, and that many different people will contribute to it over its lifetime. You enjoy working with other people, including other coders but also designers, business analysts, testers and anyone else working on the same project. You enjoy frequent collaboration, including pair-programming.<p>As a passionate developer, you spend a considerable amount of time outside working hours investing in your craft, learning new technologies and practicing different techniques and approaches. You create for creation&#x27;s sake, building pet projects or contributing to open-source development. You don&#x27;t do this because a client or employer asks you to; you do it because you want to.<p>As part of the learning process, you consider it important to share what you know with others. This might take the form of a blog, some code on GitHub, attendance at community events or something totally different. You also consider it your responsibility to help your fellow colleagues; perhaps this manifests itself as formal knowledge-sharing sessions in the workplace, but just as likely, it&#x27;s simply coaching as and when it&#x27;s necessary.<p>You understand that languages and frameworks are just tools. You choose the best tools for the job without being religious about it. The majority of books and articles you read are the ones that makes you a better developer and not a specialist in a specific framework. At the same time, you are extremely proficient with at least one or two programming languages and the tools around them, including testing frameworks, wiring and dependency injection mechanisms, user interface libraries and development environments.<p>You understand and embrace Agile processes, and are able to help other people to understand and adopt them. You are able to work closely with clients and product owners and help them to refine requirements and plan the work to be done.<p>You are proud to be a developer and want to remain a developer. You believe in emergent and collaborative architecture and design; you use your knowledge of SOLID principles, the Four Elements of Simple Design, and Domain-Driven Design to design applications that reflect the business domain.<p>If you believe you can meet the bar set, we are definitely interested in hearing from you.<p><a href=\"http:&#x2F;&#x2F;codurance.com&#x2F;careers&#x2F;craftsman&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;codurance.com&#x2F;careers&#x2F;craftsman&#x2F;</a> for more info","time":1435785352,"type":"comment"}