{"by":"shainawilliams","id":9815545,"parent":9812245,"text":"Clover Health (www.cloverhealth.com) | San Francisco, CA | Full time, On-site<p>Clover Health is driving down costs and producing improved health outcomes with a unique health insurance plan. We use sophisticated analytics and custom software to direct our own clinical staff to proactively fill in gaps in the care of our members. We have a proven model we&#x27;re scaling out. Join us!<p>Here are a few of the roles we&#x27;re hiring for:<p>-Web Engineer-<p><pre><code>  • Develop web applications and services to support the medical team and internal operations\n  • Work with our Analytics team to build an extensive and robust data pipeline that surfaces insights\n  • Define and maintain development practices that let us move fast with quality — including writing tests and documenting key implementations\n  • Work with a wide range of tools and technologies (from SQL to Javascript) and be able to evaluate technologies for what we are building\n  • Full job description here: https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;cloverhealth&#x2F;jobs&#x2F;73754?t=7s5rut#app\n</code></pre>\n-Data Scientist-<p><pre><code>  • A strong foundation in conditional probability\n  • 2+ years experience in Python\n  • A track record of generalizing solutions to problems, implementing them into frameworks getting the computer to do the work for you.\n  • A technology bent- you&#x27;ve been programming side projects, loving the command line, playing with the latest and greatest for as long as you can remember.\n  • Full job description here: https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;cloverhealth&#x2F;jobs&#x2F;73695?t=a3ucsg#.VZRiyRNViko\n</code></pre>\nFor a full list of openings visit: <a href=\"http:&#x2F;&#x2F;www.cloverhealth.com&#x2F;about.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cloverhealth.com&#x2F;about.html</a> or email jobs@cloverhealth.com<p>We look forward to hearing from you!","time":1435788243,"type":"comment"}