{"by":"Remy_duolingo","id":9815444,"parent":9812245,"text":"Duolingo – Pittsburgh, PA (onsite) – full time<p>Duolingo is the most popular language education platform worldwide. It also just got $45 million from Google, who stated: &quot;Duolingo’s mobile-first, adaptive, and gamified platform is changing the way people are learning languages across the globe.&quot;<p>It&#x27;s free, gamified and the curriculum is completely science-based and proven to work. You can learn on the go, from anywhere, and dedicate a few minutes at a time. A few facts below! It is also being used increasingly by teachers, schools and departments of education (<a href=\"https:&#x2F;&#x2F;schools.duolingo.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;schools.duolingo.com&#x2F;</a>).<p>- It&#x27;s the #1 downloaded app in the Education category on both iTunes and Google Play worldwide\n- 100 million users!\n- Selected by Apple as &quot;iPhone App of the Year&quot; and by &quot;Google as Best of the Best for Android&quot;, 2 years in a row\n- Unlike other online education platforms, Duolingo is a completely digital experience meaning it requires constant interaction and is native to computers &#x2F; mobile platforms.\n- Lessons are bite-sized so you can learn a language in 5 minutes at a time, whenever you&#x27;re in line or waiting for someone, with no excuses!\n- It&#x27;s 100% free. Our mission: free language education for the world\n- Duolingo uses machine learning technologies to create a completely personalized experience for each user\n- Luis von Ahn, co-founder and CEO of Duolingo, is a MacArthur fellow, Carnegie Mellon University professor, and the inventor of CAPTCHA<p>We&#x27;re looking for: Software Engineers, Designers and Product Managers to develop the next-generation technologies that improve how millions learn.<p>More details on our Jobs page: <a href=\"https:&#x2F;&#x2F;www.duolingo.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.duolingo.com&#x2F;jobs</a>\nOr send your resume and cover letter directly to jobs@duolingo.com","time":1435787302,"type":"comment"}