{"by":"svimma23","id":9815137,"parent":9812245,"text":"PortfolioStrat<p>Full-Stack Engineer Python, Big Data, Web JS-Based Charting at PortfolioStrat (<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;portfoliostrat&#x2F;jobs&#x2F;63057-full-stack-engineer-python-big-data-web-js-based-charting\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;portfoliostrat&#x2F;jobs&#x2F;63057-full-stack-engine...</a>)<p>Remote or NYC or London<p>DESCRIPTION\nThis engineer is a full-stack developer with extensive knowledge in Python and big data technologies and will work with a team of 4 other engineers some of whom are distributed.\nQualifications: \n-- 3 years minimum of Python and web experience \n-- Extensive knowledge of Python \n-- Knowledge of various database technologies: SQL, Redis, MongoDB, HDFStore \n-- Knowledge of charting libraries like d3.js and HighCharts \n-- Interest in advanced statistical analyses and data visualizations \n-- Machine Learning knowledge a plus\nOur dataset is increasingly large and complex as our analyses are complex and need to be done in near real-time. You work with our distributed engineering team and our CEO and Head of Business Development on product iteration.<p>PortfolioStrat is a cloud-based trading workflow tool SaaS Platform Portfolio Manager for hedge funds, asset managers, and other sophisticated investors. The platform helps professional investors generate investment ideas through screens and advanced analysis and visualization with statistical analyses, machine learning &#x2F; data science, and other overlays. We are a team of former hedge fund portfolio managers, investment bank quants and technologists work to connect all parts of the professional investor&#x27;s workflow in the cloud.\nWe have recently launched a beta product that has been 1.5 years in development and is backed by over 7 years of prototyping, IP, and industry knowledge. We have 10-20 hedge fund clients who have signed up to be early users of the platform and have signed a major broker to use it.\nThe two co-founders are looking to disrupt the entire investment workflow of a front office portfolio manager stuck on Bloomberg and Excel spreadsheets. We are closing our seed round now and have previously raised a round of friends and family capital last year.","time":1435784612,"type":"comment"}