{"by":"jdowner","id":9815591,"kids":[9815730],"parent":9812245,"text":"-Burlington, MA USA\n-ONSITE<p>US – We are RIFT.io and we&#x27;re looking for talented people. There are very few opportunities where you get to be a part of something ground breaking and on a global level; this is one of those moments. In less than one year of the company being founded, we built a product, acquired 5 customers (three of them on the Fortune 500), and finished out 2014 with 40 employees. 2015 has already turned into an exciting year; we&#x27;ve picked up another handful of customers, we&#x27;re on track to double by the end of the year and we come out of stealth mode.<p>LIFE – Work life here at RIFT.io is everything you imagined it could be. We have every snack and beverage you can think of. Can&#x27;t find what you&#x27;re looking for? Ask our snacks committee and they&#x27;ll make sure it&#x27;s stocked by the end of the week. We have some intense ping pong, corn hole, and Smash Brothers matches. But above all that, we have passion. It&#x27;s exuded by the amazing and talented people who work here. This isn&#x27;t your typical punch in punch out job; our employees come in early and stay late. It&#x27;s because of that dedication we cater dinners and make an effort to stop and eat with one another. This is a &#x27;douche-bag free&#x27; zone. We respect all ideas and all people who come through our front doors who are here to learn, contribute, and inspire. The pedigree of our leadership is amazing; founded, IPO&#x27;d and sold a company. They believe in the employees that work here and give them every opportunity and tool needed to be successful in this venture.<p>WORK – We&#x27;re still in stealth, so I can&#x27;t say much. What I can tell you is that you will be working on is something that has global impact, has never been done to this degree, and has to happen for technology to progress the way it is. The work is challenging and intense.<p><a href=\"http:&#x2F;&#x2F;riftio.mytribehr.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;riftio.mytribehr.com&#x2F;careers&#x2F;</a>","time":1435788687,"type":"comment"}