{"by":"mrdazm","id":9815380,"parent":9812245,"text":"BrightGauge (<a href=\"http:&#x2F;&#x2F;www.brightgauge.com&#x2F;)|\" rel=\"nofollow\">http:&#x2F;&#x2F;www.brightgauge.com&#x2F;)|</a> Front End Web Developer | Miami, FL | Full-time&#x2F;Onsite<p>BrightGauge Software is looking for an incredible Front End Web Developer to join our growing team.  You know the type: an HTML, CSS, JavaScript rockstar who loves building beautifully detailed web applications and all the magical interactions that happen in the browser.<p>As you’ll read and learn about BrightGauge, our product works with tons of data, is used all over the world, and we’re incredibly passionate about beautiful interactions.   So as a front end developer joining our growing product team, you’ll make a direct impact on thousands of people’s everyday work lives.  We want you excited about that, about shipping awesome code, and bringing designs to life.<p>In order to be an ideal fit with our team, here are some things that should describe your skills and personality:<p>- You love client side development, especially HTML, CSS, and JavaScript (not just jQuery either, the big time stuff like AngularJS).  Oh, and you’re pretty darn good about working in that stack.\n- You love testing your work for cross browser consistency (even that thing called IE)\n- You’ve worked on products before, preferably for a few years, and worked with designers bringing static pages and prototypes to pixel perfect life\n- You have plenty of experience in Git and working in small teams or projects.\nYou communicate extremely well, in person but also through tools like Slack, Trello, and Email\n- You’ve worked with, or at least tinkered with, Semantic UI and AngularJS (what we use at BrightGauge every day)\n- You’re an upbeat and fun personality that enjoys being with the team because we do spend a lot of time hanging out together\n- In your free time, you love to learn new technologies, help out others on the team wherever you can, and research new libraries.  We’re a small team, and you must love the “get your hands dirty” type of culture.<p>Like what you’ve read so far? It gets better! Here’s a bit more about what you’ll get to enjoy every day:<p>- Working with an amazingly focused group of people who care first and foremost about building an awesome product together as a team\n- A really nice base salary that will depend on your experience, plus access to full benefits (medical, 401K, etc)\n- Working in the most beautiful part of Miami, downtown Coral Gables\n- Shipping code and planning features from start to finish with other members of the product team (product manager, developers, designers, and YOU)\n- Minimal meetings, maximum development work\n- Being a part of a growing startup that is already passed those crazy early days of any new company.  We have those cool things called Revenue and Profit!<p>If this sounds like the opportunity that you’ve been searching for, and you’re a fit based on technical skills and the personality we need, send us an email at info[@]brightgauge[dot]com. Tell us why you’d be a great fit and why you’re interested in joining this awesome team. No recruiters please.","time":1435786749,"type":"comment"}