{"by":"chucknb","id":9815035,"parent":9812245,"text":"NationBuilder - Los Angeles, CA - Full Time - Database Engineer, Systems Engineer, Software Engineer<p>NationBuilder is an online Community Organizing System built by a world-class team dedicated to empowering a new generation of leaders and creators with the tools they need to create a new world. If you&#x27;re seeking to build something truly important - a genre-defining new product that is already changing people’s lives. Check out what we build: <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission</a><p>Software Engineer (ONSITE): As a developer you’ll help us architect, build and maintain our main codebase as well as ancillary services. You’ll recommend and implement system-wide improvements, new technologies, and contribute to our technological direction. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_developer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_developer</a><p>Database Engineer (ONSITE): Come join our LA team to take ownership of our database systems, with a strong focus on our core PostgreSQL databases, and take our databases to a new level of scalability and performance.  <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;database_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;database_engineer</a><p>Systems Engineer: Our operations engineering team needs a systems engineer who loves to code (think DevOps). You can work on a small enough team to allow strong ownership, but not so small you&#x27;ll be on call all the time. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;systems_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;systems_engineer</a><p>Our tech stack is primarily Ruby on Rails along with some Ruby and Golang services utilizing PostgreSQL and MongoDB. Managed by Puppet.<p>We will relocate folks, so if you ever considered living in LA we’ll convince you that it’s the greatest city to live in.","time":1435783729,"type":"comment"}