{"by":"sztanko","id":9815281,"parent":9812245,"text":"Badoo, London<p><a href=\"https:&#x2F;&#x2F;corp.badoo.com&#x2F;jobs&#x2F;?jvi=oHWj1fwH,Job\" rel=\"nofollow\">https:&#x2F;&#x2F;corp.badoo.com&#x2F;jobs&#x2F;?jvi=oHWj1fwH,Job</a><p>We are currently developing an in-house logging flow that traps hundred of thousands mobile client side  events per second, aggregates, processes and stores them in HDFS using Python and Spark, then shows reports and visualisations on our React based portal using D3.<p>You, the Ideal Candidate, are a passionate and thorough individual who could contribute to the development of some components of this system. You must love exploring new tools, libraries and technologies in various programming languages, but also should convince us you are able to maintain larger and longer term projects. You can write easily understandable code that is so good that even your grandchildren will be using it. In the past you already worked with large volumes of data, experienced scalability problems and explored various data streaming and storage systems to understand their benefits and limitations.<p>You must have experience in JavaScript and Python, and you should be really good (better than us) in one of those.  Experience in one of the JVM based languages is a huge plus. If you also have any side projects or open source contributions, that will be more than welcome.<p>We assume you know how to work with git, JIRA, regular expressions, etc. Apart from this, you should be really good at unix commands and SQL queries. Every day you will meet and talk with nice and friendly people who are using the system, so you should be good at explaining new features, showing new joiners how to start using it and explaining why things are not working in case of failure.<p>Badoo is a great company to work in. It gives you everything you need in order to enhance your skills. The problems we are solving are interesting and the tools we are choosing are cutting edge. We will be sending you to conferences and workshops, buying breakfasts and lunches, books and software for you.","time":1435785856,"type":"comment"}