{"by":"tyler-redclay","dead":true,"id":9815693,"parent":9812245,"text":"Red Clay | San Francisco<p>Full-stack Web Developer | ONSITE\n<a href=\"https:&#x2F;&#x2F;www.redclaydesign.com&#x2F;careers&#x2F;web_developer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.redclaydesign.com&#x2F;careers&#x2F;web_developer</a><p>At Red Clay we’re bringing today’s technological capabilities to an outmoded industry and redefining how design is done. We’re looking for an interdisciplinary teammate who is excited about our mission and determined to bring today’s technology and efficiency to the design process across every industry.<p>Our new developer should have strong Ruby on Rails skills and experience with Agile, test-driven development methodologies to join our small team of developers. The right candidate will be self-motivated, curious, and energized by the thought of solving process challenges with technology. He or she will care about following and cultivating web development best practices.<p>Stack &amp; Relevant experience: Ruby on Rails, Backbone.js, PostgreSQL, RSpec &#x2F; Capybara, Jasmine.<p>UX &#x2F; Web Designer | ONSITE \n<a href=\"https:&#x2F;&#x2F;www.redclaydesign.com&#x2F;careers&#x2F;web_designer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.redclaydesign.com&#x2F;careers&#x2F;web_designer</a><p>We are in search of a talented web or UX designer with graphic experience to lead our application and web design. This person will also be asked to lead our in-house design efforts (e.g. marketing collateral and branding materials), and must be:<p>- Comfortable rolling up his&#x2F;her sleeves and skinning front-end UI components in HTML &amp; CSS \n- Experienced in working on wireframes \n- Capable of delivering a cohesive visual design for the UX of web applications \n- Interested in assisting with overall branding efforts \n- Eager to follow and cultivate web design best practices<p>The right candidate is a highly creative designer who can find ways to make our product more delightful without detracting from its function, and who is passionate about bringing today’s technological capabilities to an outmoded industry and redefine how design is done.<p>---------<p>Prefer applicants apply thru Angel List. Details in the links above.<p>Thanks for your interest!","time":1435789712,"type":"comment"}