{"by":"kedargj","dead":true,"id":9815149,"parent":9812245,"text":"Experience Developer @Adobe Experience Design - San Francisco, CA (Full-time, on-site)<p>The Studio team within Adobe’s Experience Design (XD) group exists to identify untapped potential and help set the future direction of user experience at Adobe. We are looking for a developer with a passion for design, technology, human-computer interaction and building forward-thinking user experiences.<p>In this role:<p><pre><code>  -You&#x27;ll be working directly with other designers, developers and business strategists to prototype concepts and designs for new products.\n  -You will scout for, discuss and build new technologies that have the potential to revolutionize content creation and communication.\n  -You will work directly with designers to “think through making,” help Adobe identify sources of disruption, and set the future direction of its business and the industry at large.\n</code></pre>\nThis is a unique position with many facets, and we’re looking for someone willing explore a wide variety of technologies – from multi-touch to communications protocols to augmented reality to computer graphics.<p>Though we look for candidates with a broad skill set, we value quick learners with positive attitude and attention to detail even more. The ideal candidate should have experience developing user interfaces with both web (HTML&#x2F;CSS&#x2F;JavaScript) and native (C, C#, C++, Java or Objective-C) technologies.<p>This is a rare opportunity to work within a design-led organization to help build a new generation of creative tools at Adobe.<p>If you&#x27;re an ambitious creative technologist looking for a challenge, we want to hear form you.<p><i>Application Details:</i>\nWe are committed to having a meritocratic, transparent and bias-free selection process that is inclusive to applicants from all backgrounds.<p>In order to proceed to the next stage of the interview process, we want to make sure that you are genuinely excited about Adobe and are able to solve the types of challenges we face.<p>To apply, email your interest to adobe@gapjumpers.me or take this technical challenge at<p><a href=\"https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;adobe&#x2F;qs-251&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;adobe&#x2F;qs-251&#x2F;</a>","time":1435784701,"type":"comment"}