{"by":"tonyleask","id":9816153,"parent":9812245,"text":"&quot;Ask.com&quot; (Please email Jobs@ask.com) VISA Friendly &amp; ONSITE\nJD-Frontend JavaScript Developer \nThe role &amp; your impact\n•Passion, knowledge and experience within in the Javascript and Node.js ecosystem. You know how to navigate the vast and quickly evolving collection of open source projects and select the right tool for the job. You are the expert, as a front end developer, server side, or both!\n•Design and develop awesome experiences in our Node.js front-end platform that will delight our users.\n•Build out a new portfolio of products on a modern stack to support the growth of and expansion into the content space and beyond.\n•Focus on creating innovative and feature-rich content experiences and the best user experience.\n•Be a new member of a recently formed team. Get in early, collaborate, and contribute to our evolving Node.js front-end platform. We are actively recruiting a number of skilled developers who love working with JavaScript and are excited about working on something new! No legacy code here, just brand new projects to sink your teeth into!\nMore Specifics\n•The developer will be involved in all aspects of site&#x2F;feature development from start to finish (R&amp;D, design documentation, prototyping, implementation, unit testing, test plan&#x2F;test cases.)\n•Leverage the best technologies for the job, including Grunt&#x2F;Gulp, Less&#x2F;SASS&#x2F;SCSS, Mocha&#x2F;Chai, Express, HTML5, CSS3, REST, and your recommendations.\n•Collaborate and contribute to other engineering teams, supporting the evolution of our Node.js platform.\n•Take part in offsite adventures with the team.\n•You have a passion for using and creating great products on all devices.\n Your Strengths\n•Advanced JavaScript skills (OO, functional, performance, Node.js a plus.)\n•CSS selectors, specificity, rules, optimization, and preprocessors\n•Web fundamentals HTTP, AJAX, WebSockets, HTML5, CSS3.\n•Browser performance and compatibility\n•Demonstrated expertise building excellent web experiences for mobile and tablet users.\n•Enjoy an agile work environment that encourages shared responsibility.\n•A strong understanding of usability and visual design.\n•You profile your applications often in the browser and on the server, and you know how to identify performance bottlenecks and propose new solutions. Our applications need to scale, and load fast.\n•You constantly look for ways to improve developer and build processes. You have strong experience in debugging code and streamlining the build processes. You write tests and you expect your peers to do the same.\n•We value experience with other programming languages and strong CS fundamentals (algorithms, data structures, operating systems, networking).\n•You noticed that we did not mention any of your favorite frameworks and libraries.\n It’s a plus if you have\n•Familiarity with Agile&#x2F;Scrum.","time":1435796115,"type":"comment"}