{"by":"kedargj","dead":true,"id":9816779,"parent":9812245,"text":"Junior Developer in Test @BBC Digital (myBBC team) - London, United Kingdon (Full-time, on-site)<p>We’re looking for a Junior Developer with an unconventional background to join our engineering team, to innovate, develop and test web applications that will be used by millions of people every day.<p>With reasonable Test Automation background you’ll work shoulder-to-shoulder with our front and back-end developers to ensure that quality is built into our products from the ground up.<p>As a skilled agile practitioner you will play a key role in helping the team to meet our world-class quality expectations and also utilise every opportunity to develop your technical skills set<p>Scope of the Role:<p>Skills &amp; Competencies:<p><pre><code>  1. Must have worked in BDD Test Frameworks like Cucumber-JVM, Cucumber, RSpec, etc. using programming languages like Java or Ruby.\n  2. Good understanding of API technologies like RESTfull, SOAPUI, etc.\n  3. Experienced in Framework Management technologies like Maven or Ant.\n  4. Exposure with any one of the following Continuous Integration tools: Jenkins, Hudson, Team City, Bamboo, Anthillpro.\n  5. Must have strong views on Agile TDD&#x2F;BDD.\n  6. Strong understanding of OOPs concepts.\n  7. Must be a Good Team Player and be able to work with minimal supervision.\n  8. Must be comfortable in working with any existing Test Automation Framework and be able to contribute towards the improvement of the Test Framework.\n</code></pre>\nWe are committed to having a meritocratic, transparent and bias-free selection process that is inclusive to all applicants.<p>In order to proceed to the next stage of the interview process, we want to make sure that you are genuinely excited about BBC Digital and are able to solve the types of challenges we face.<p>To apply, take this technical challenge to showcase your capabilities and skills for the role <a href=\"https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;bbc-digital&#x2F;qs-256&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;bbc-digital&#x2F;qs-256&#x2F;</a> or email bbc@gapjumpers.me","time":1435809770,"type":"comment"}