{"by":"alexthornton","id":9816080,"parent":9812245,"text":"Locus Energy: <a href=\"http:&#x2F;&#x2F;locusenergy.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;locusenergy.com&#x2F;</a><p>San Francisco, CA. Remotes, interns and those needing visas are encouraged to apply.<p>About us: We’re dedicated to the proliferation of sustainable energy solutions. To that end, we build software to monitor, analyze and manage the performance of tens of thousands of solar power systems. We’re a mature startup with a close-knit team that is greater than the sum of its parts. Our organization provides some structure while still leaving plenty of opportunities to make your mark. We’re not perfect but constantly improving. We value folks who offer a new perspective and play nicely with others.<p>About you: You’re passionate about sustainable energy and want to play a part of pushing our society in that direction. Nothing would excite you more than wedding your engineering prowess with your dreams of clean, green energy. You write a failing test before fixing a bug. You are thoughtful, curious and ask questions when you don’t understand. You take ownership of your responsibilities and see them through to the entire development lifecycle from design to maintenance.<p>Perks:<p>- Conveniently located in downtown SF, a few minutes&#x27; walk from Montgomery St station<p>- Relaxed work atmosphere. Flexible working hours and work from home policies.<p>- Health insurance, 401k, and all the other benefits of a real company<p>- Fruit, snacks. Bagels and lunch each provided 1x a week.<p>- A spacious new office complete with a living room couch, big screen TV, PS3 and darts.<p>We are looking for both frontend and backend engineers that are familiar with any combination of Java, Scala, Python, JavaScript (especially Ember, Angular or Backbone), and MySQL. We&#x27;re also looking Product Solution Specialist to work with our customers on implementing our tools. For more details, head here: <a href=\"http:&#x2F;&#x2F;locusenergy.com&#x2F;company&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;locusenergy.com&#x2F;company&#x2F;careers&#x2F;</a>.","time":1435795087,"type":"comment"}