{"by":"DayneRathbone","id":9817083,"kids":[9819884,9831737,9817192,9817107],"parent":9812245,"text":"Australia &#x2F; Remote - Karma (<a href=\"https:&#x2F;&#x2F;www.karma.wiki\" rel=\"nofollow\">https:&#x2F;&#x2F;www.karma.wiki</a>)<p>Frontend Engineer Needed to Help Change the World<p>My name&#x27;s Dayne, I&#x27;m a programmer from South Africa currently living in Canberra, Australia. Last year my brother and I started working on a project with the potential to radically shift culture in the direction of openness and accountability.<p>In the last 6 months we’ve built an incredible team (including an ex Google &amp; Quora senior programmer, and some great tech entrepreneurs and CEOs), completed our MVP designs, launched a prototype, and secured seed investment.<p>Our plan is to demonstrate traction in Australia over the next few months, and migrate to San Francisco in late 2015 or early 2016. Our company is already incorporated in Delaware, and we’re hoping that with traction and growth we’ll get accepted into YC’s next batch.<p>We’re looking for someone with exceptional skills and experience in:<p><pre><code>    - HTML5\n    - CSS\n    - AngularJS\n    - Bootstrap\n    - Ideally experience with: Grunt, TDD, Go, Cassandra (or other NoSQL).\n</code></pre>\nPersonality traits and experience we’re looking for:<p><pre><code>    - Hard working &amp; 100% honest\n    - Passionate about freedom of speech &amp; information. If you think that the EU&#x27;s &quot;Right to Be Forgotten&quot; legislation is a good thing, or that Assange and Snowden are bad guys, you probably won&#x27;t like what we&#x27;re doing.\n    - Must be smart. We’re looking for someone who could have created the frontend for sites like AirBnB, Quora, etc. The interview process will include a programming and logic interview with an ex-Google senior programmer.\n    - Must show evidence of having worked on a project from start to finish.\n    - Extensive experience is not necessary - our priority is building a team of smart people who share our passion for Karma.\n    - Must be willing to relocate to San Francisco.\n</code></pre>\nWe are offering a salary as well as potential to earn equity in the company for the right applicant.\nIf you’re interested, please send a resume&#x2F;CV&#x2F;letter&#x2F;demo to dayne@karma.wiki.<p>Thanks,\nDayne<p>Learn more about what we’re doing here: <a href=\"https:&#x2F;&#x2F;karma.wiki&#x2F;#&#x2F;app&#x2F;start&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;karma.wiki&#x2F;#&#x2F;app&#x2F;start&#x2F;about</a> and here <a href=\"https:&#x2F;&#x2F;blog.karma.wiki\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.karma.wiki</a>","time":1435816307,"type":"comment"}