{"by":"skyscannerrec","id":9818631,"parent":9812245,"text":"SKYSCANNER <a href=\"http:&#x2F;&#x2F;www.skyscanner.net&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skyscanner.net&#x2F;</a> Backend Engineers and Senior Backend Engineers - Edinburgh, Glasgow, Barcelona, Sofia, Budapest - ONSITE<p>Complex Problems Live in Travel: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=pUkYP5Pfefg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=pUkYP5Pfefg</a><p>Our Backend Engineers are the backbone of our business. They build the engines that power Skyscanner. Platforms that can cope with the millions of user visits every day. We’re always looking for exceptional engineers to join them. We need those with proven experience of building web services using a range of internet technologies. Robust, scalable solutions that you’re prepared to hang your reputation on.<p>If your engineering ability isn’t up for debate, but your approach is always up for discussion, apply today.<p>You can offer us:<p>A hunger to learn, a desire to meet challenges, a passion for technology and development. Experience in scalable web architecture, web technologies and Agile practices.<p>We can offer you:<p>An excellent career move, a space within an autonomous Agile squad, the space to be trusted to do what you do best - and to make decisions that matter.<p>The potential to build big things, the thrill of writing great code and seeing it go live. The opportunity to build something that millions of people see and use every day.<p>So what do you need to apply?<p>We’re looking for people across all levels of experience and we’re more concerned with what you can do than what you have done. As a minimum, a Computer Science degree or similar; experience in a web economy or other tech environment; proficiency in object-oriented programming, REST web services, automated testing and database technologies.<p>Take a look at one of our videos where you can hear from one of our engineers speaking about the technical challenges he works on and life at Skyscanner: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=jy-VagQJq_E\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=jy-VagQJq_E</a><p>Our benefits include: bonus, pension, healthcare, flexible working, home country working, share incentives.","time":1435843331,"type":"comment"}