{"by":"MitraCapital","id":9821362,"parent":9812245,"text":"SOFTWARE ENGINEER, Boston, MA<p>Mitra Capital LLC is seeking a versatile and talented programmer to join our small, entrepreneurial team.<p>Mitra Capital is a Boston-based long-short equity hedge fund that uses a proprietary and proven framework with roots in the Central Intelligence Agency to analyze the public remarks of company management teams and take positions ahead of earnings events.  The Software Engineer’s core responsibilities will involve building tools and systems supporting the firm’s research process.  Example projects include writing systems and modules to access, manipulate, and produce outputs from historical databases of company results and market data, and coding and testing specified modules that enhance and expand the capabilities of the team’s text processing and machine learning systems.<p>The ideal candidate is a clever and versatile coder with a hacker mentality who is eager to tackle complex problems.  The Software Engineer must be comfortable working in an agile development environment with high expectations for rapid delivery of prototypes, evolving requirements, and direct feedback from internal business users.   The role offers the opportunity to work on a small and nimble team, with a high rate of learning on a diverse range of projects and the opportunity to quickly have direct impact upon the organization.<p>• Candidates should be able to learn fast and learn on the fly in order to work with a variety of languages and projects, and be capable of taking responsibility for delivering code that accomplishes defined objectives.<p>• High proficiency in SQL, including working with large and complex datasets and queries, is required. Experience with Python, SQL Server, PHP, UNIX, and&#x2F;or PHP is a plus.<p>• We are looking for candidates with 2+ years’ experience and a quantitative background with degree(s) in majors such as Computer Science, Engineering, Science, Mathematics, Economics or similar.<p>---- To Apply ----<p>Interested and qualified candidates are encouraged to send a resume and cover letter to recruitment@mitracapital.com.  Please include, in CV&#x2F;resume or separately, detailed descriptions of past relevant projects. Mitra Capital can only consider candidates who are legally authorized to work in the U.S. without sponsorship.  Mitra Capital is an equal opportunity employer.","time":1435868511,"type":"comment"}