{"by":"Elenainsightly","id":9823695,"kids":[9823696],"parent":9812245,"text":"If you like working in a small and fun startup environment, take full ownership and responsibility to deliver tangible results, Insightly is the right place for you! We are looking for a senior .NET Architect, to join our engineering team. You will design, develop, and maintain Insightly’s Web Application, APIs, and Mobile applications. In this role you will be working closely as part of a smart and collaborative team that is developing highly scalable cloud based CRM services for SMB.<p>Description\nResponsibilities :<p>Building highly scalable web applications for our users and customers.\nPlanning and designing effective and elegant solutions to support a rapidly growing customer base. (millions of users)\nFull ownership of entire engineering stack required to deliver features and results to business stakeholders and customers\nCollaborate and work with our small knit engineering team in an Agile environment.\n Establish good engineering practices and mentoring other team members.<p>Insightly is a well-funded VC backed startup that provides cloud based Customer Relationship Management (CRM) and Project Management software to small businesses. Insightly is the most widely deployed CRM application on the Google Apps Platform with more than 250,000 businesses located in over 150 countries worldwide using our software. Insightly has a freemium business model. Our paying customers pay $9 per user per month.\nInsightly is on a significant growth trajectory with a solid track record and reputable investors. We recently concluded a Series B financing round and is backed by Emergence Capital Partners, Cloud Apps Management LC, Sozo Ventures, and TrueBridge Capital Partners.<p>Company Perks\nWe&#x27;re not only a super successful and fast growing start-up, but also a fun place to work. Here are just some of the perks we offer:<p>Awesome office in SOMA, San Francisco close to Caltrain, Bart and Muni\nFlexible working arrangements\nGenerous medical, vision and dental cover coverage\nFree snacks, drinks, and fruits\nWeekly massages from professional masseurs","time":1435901399,"type":"comment"}