{"by":"skrebbel","id":9829711,"parent":9812245,"text":"Klets (<a href=\"https:&#x2F;&#x2F;klets.com\" rel=\"nofollow\">https:&#x2F;&#x2F;klets.com</a>) | Eindhoven, the Netherlands, Customer Support &amp; Happiness | INTERN, ONSITE<p>At Klets we bring customer chat to all businesses in the world. We believe that chat is a great communication medium but it&#x27;s underused for communication between companies and their customers. Especially B2B companies nearly exclusively use phone and email, and this is simply because there have been no good chat-based solutions to fill this gap. Klets fixes this. We launched a month ago and are seeing impressive traction and adoption.<p>We&#x27;re looking for an intern who wants to make our existing <i>and potential</i> customers extremely happy. Your role will be very flexible and very much open to your own wishes and (study) needs. It&#x27;s a plus if you have a clue about online marketing and can write (blog) well. You&#x27;ll be studying something related to marketing, business or communication right now, and we&#x27;ll tune the opening to match your studies. The fact that you, a non-programmer, are looking on Hacker News for internships gives you an immediate edge.<p>Most of our customer support (obviously) goes over chat, so it&#x27;s important that you enjoy chat and text messaging. We find that customer support via Klets makes complete strangers have fun and crack jokes with you, so it&#x27;s certainly a fun job. We&#x27;d also love for you to contribute to our marketing strategy if that&#x27;s up your alley - content marketing, growth hacks - anything you can think of, really.<p>We&#x27;d like you to live relatively nearby but we&#x27;re open to a big part of your work to take place remotely if necessary. So if you&#x27;re in (or near) the Netherlands but not near Eindhoven, no biggie, with a combination of trains and remote work we&#x27;ll make things work just fine.<p>We&#x27;re a very young startup, and in our stage, there is no real difference between sales and customer support, and even marketing (because a great product with great support tends to market itself to some extent). If you&#x27;re looking for a place to really significantly contribute to a startup&#x27;s growth, get in touch.<p>Interested? Chat with us on <a href=\"https:&#x2F;&#x2F;klets.com&#x2F;klets\" rel=\"nofollow\">https:&#x2F;&#x2F;klets.com&#x2F;klets</a> (no login or signup needed)<p>(we&#x27;re not interested in recruiters and intermediaries - please don&#x27;t get in touch)","time":1436002060,"type":"comment"}