{"by":"mmaunder","id":9839891,"parent":9812245,"text":"Wordfence ; Seattle, WA; FULL TIME ; REMOTE<p><i>Full-time PHP Developer with Security Emphasis</i><p>Do you want to work in information security? How about being able to work anywhere on the Planet? On a beach in Hawaii, or taking your lunch break fly fishing a stream in Alaska.<p>We are a fast growing information security company. You will be working for us remotely full-time, with full benefits including medical, dental, 401K and a generous stock options package.<p>We are a team of four full-time employees and a handful of contractors. We’re fast moving, nimble, self managing and work in a relaxed atmosphere. Rather than working for a mega-corp, you will be working in a company where your work has real impact in the fun high-growth stages of our evolution.<p>We use apps like Slack, Fogbugz and Dropbox for our workflow. Each team member is World-class at what they do. We have flexible working hours and we are a diverse team ranging in age and location from Maine to Redmond to Knoxville to Florida.<p>All permanent positions will involve a trial period of approximately 1 month with a minimum commitment of 10 hours per week. You will be paid for this time and it will be used to evaluate whether both parties want to pursue a permanent position.<p>We have the following position open:<p>Full-time PHP Developer with Security Emphasis<p>For required skills, please see our blog (post is too long for HN).<p><a href=\"https:&#x2F;&#x2F;www.wordfence.com&#x2F;blog&#x2F;2015&#x2F;06&#x2F;were-hiring-php-developer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wordfence.com&#x2F;blog&#x2F;2015&#x2F;06&#x2F;were-hiring-php-devel...</a><p>If you think you are a fit for this role, we want to hear from you. Please use the application link below to apply and note that as part of the application process we require that you include some source code. The application form has all the information you need. (Links to a form on Workable)<p><a href=\"https:&#x2F;&#x2F;wordfence.workable.com&#x2F;j&#x2F;29DA8705A2\" rel=\"nofollow\">https:&#x2F;&#x2F;wordfence.workable.com&#x2F;j&#x2F;29DA8705A2</a><p>Full post is on our blog:<p><a href=\"https:&#x2F;&#x2F;www.wordfence.com&#x2F;blog&#x2F;2015&#x2F;06&#x2F;were-hiring-php-developer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wordfence.com&#x2F;blog&#x2F;2015&#x2F;06&#x2F;were-hiring-php-devel...</a>","time":1436197355,"type":"comment"}