{"by":"crumley","id":9841281,"parent":9812245,"text":"<p><pre><code>  | \\ | |_   ___   _____       &#x2F; \\  _   _ ___| |_(_)_ __   |_   _|____  ____ _ ___ \n  |  \\| | | | \\ \\ &#x2F; &#x2F; _ \\     &#x2F; _ \\| | | &#x2F; __| __| | &#x27;_ \\    | |&#x2F; _ \\ \\&#x2F; &#x2F; _` &#x2F; __|\n  | |\\  | |_| |\\ V &#x2F;  __&#x2F;_   &#x2F; ___ \\ |_| \\__ \\ |_| | | | |   | |  __&#x2F;&gt;  &lt; (_| \\__ \\\n  |_| \\_|\\__,_| \\_&#x2F; \\___( ) &#x2F;_&#x2F;   \\_\\__,_|___&#x2F;\\__|_|_| |_|   |_|\\___&#x2F;_&#x2F;\\_\\__,_|___&#x2F;\n</code></pre>\nNuve, Inc | Austin, Texas | Full-Time ONSITE | <a href=\"http:&#x2F;&#x2F;nuve.us&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;nuve.us&#x2F;</a> | Full-Stack<p><i>Technology:</i><p>Ember&#x2F;React (to be determined by you), Docker, Machine Learning, Log oriented architecture, JVM, Functional.<p><i>Mission:</i><p>You’ll be helping us design, build, and deploy a next-generation software platform from the ground up. The team is small which means your contributions will have a big impact on the success of the company.<p><i>Role:</i><p>You will work across the full-stack from back-end to front-end with an initial focus on developing a best of class front-end. Design, build, test and deploy features that you own.<p>If you are interested in being one of our first 20 employees email me at &quot;crumley&quot; + &quot;@&quot; + &quot;nuve.us&quot;<p>For more information see our jobs site: <a href=\"http:&#x2F;&#x2F;www.nuve.us&#x2F;about-nuve&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nuve.us&#x2F;about-nuve&#x2F;jobs&#x2F;</a><p><i>About Nuve:</i><p>We’re building a robust asset monitoring and asset protection platform for the exploding Internet of Things. Nuve is venture backed raising more than $6M to get to where we are today. We’re actively monitoring more than 10,000 sensors from paying customers and have very aggressive growth plans. Our current focus is transportation solutions but our vision is much broader. Our hardware and software teams are small, focused, and have plenty of juicy problems for you to solve.","time":1436208298,"type":"comment"}