{"by":"jarin","id":9841826,"parent":9812245,"text":"JMJ Financial <a href=\"http:&#x2F;&#x2F;jmjfn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jmjfn.com</a> @ 501 W. Broadway Suite 2000 San Diego CA 92101<p># Rails Senior Developer [ONSITE]<p>Hi everyone, I&#x27;m looking for one or two people to take my spot at my current company.<p>They have treated me super great, and I was super lucky to find this job in the first place, but I just recently got even luckier and am moving on to a new opportunity.<p>Ok so first I&#x27;m looking for a full-time, in house Senior Rails Developer with strong JavaScript skills (or decent JavaScript skills and the ability to catch up quickly). The job mostly entails maintaining and adding features to three in-house developed Rails apps that process stock data and provide business intelligence for the company. It&#x27;s very interesting stuff, and you&#x27;ll learn a lot about the stock market. You&#x27;ll be working directly with the CEO and management team, and they&#x27;re very pleasant to work with as a developer (they communicate well, they have reasonable expectations, and you&#x27;ll have pretty much full autonomy regarding coding decisions). The pay is great, and the office is downtown. You get your own office, parking is included, and everyone at the company is great to work with. The company is also super generous with vacation time—we get about a month of paid time off around the end-of-year holidays, in addition to the regular vacation benefits and paid time off on market holidays.<p>It would be awesome if the person taking over my job also has decent desktop support and network skills, but if not we need a freelancer or IT support company who can be on call for that kind of stuff. Mostly it involves setting up Google Apps accounts, installing Office 365, and things like that. There&#x27;s occasionally some harder stuff like opening up firewall ports, forwarding ports, troubleshooting videoconferencing equipment, and things like that.<p>Please email me at jarin@robotmodehq.com if you&#x27;re interested or if you have any recommendations. Thanks!<p>Ruby on Rails, JavaScript, Full Stack","time":1436212927,"type":"comment"}