{"by":"jasonparekh","id":9847673,"parent":9812245,"text":"ONSITE | SalesWise | Atlanta | Looking for rockstar engineers<p>Space:  Sales is the singularly most important function of any Company.  The sales process is undergoing fundamental changes because prospects&#x2F;buyers have immediate online access to all aspects of a Company’s products, positioning, reputation, and in many cases pricing.  Many new products and platforms have been created to help sales organizations with these changes but sales reps and sales managers lack a compelling, easy to use, interface to organize, visualize, and share data about their prospects and sales performance.<p>Solution:  We are building a Relationship Intelligence platform that automatically interfaces and integrates with all backend sales systems and tools (CRM, Email, Calendar, Social, etc).  Our initial product radically simplifies how sales reps organize and interact with the prospect&#x2F;buyers  It’s an elegantly-designed product adapted to let them efficiently sell to their prospects without the headaches of CRM entry or spreadsheets.<p>We’re an Atlanta startup looking for passionate hackers that love building hard products.  We’re a small, growing team of 5 with the founders being a wildly successful serial entrepreneur that can’t stop and a passionate ex-Googler that lives on the forefront of tech.<p>You:<p>- Love the full stack or love the deep focus on a layer of the stack.  It’s OK if you don’t have chops in every technology that we’re using, but you should genuinely be eager about learning. Here’s what comprises our stack: Meteor, Javascript, Sass, Go (aka Golang), Kafka, Kubernetes, Mongo.  (We’re looking for both generalists and frontend or backend specialists.)<p>- Look forward to building and owning huge parts of the product.  You’ll be among the early technical hires and there are a lot of exciting pieces to work on, let’s chat and we can find the right fit for you.<p>- Love to get going -- have the mentality of a hacker and the quality of a pro.<p>- Yearn for the high rewards of an early stage startup.  Lucky for you, not so much risk as we have a solid comp plan lined up for you.<p>- Want to influence and grow the culture of a young company.  The way we see it: We’re building something of immense value, let’s have fun doing it.<p>- Live in Atlanta, or can make the move.<p>- Are full-time or potentially looking for an internship.  If you’re a rockstar, we don’t care what your deal is, let’s get you on board!<p>Sound like you?  Get in touch: jason@saleswise.com","time":1436298764,"type":"comment"}