{"by":"keithgabryelski","id":9848340,"parent":9812245,"text":"Jebbit, Inc. [<a href=\"http:&#x2F;&#x2F;jebbit.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jebbit.com</a>] | Boston, MA<p># Mid-Senior Ruby on Rails Engineer<p>Jebbit is a young adtech startup that powers Post-Click Engagement™ for some of the World’s largest brands. Jebbit’s products enhance after-the-click activities for brands’ online advertising campaigns, increasing the time and quality of engagement whilst providing campaign and consumer analytics through a self-service platform. Jebbit was recently lauded as “One of the World’s top 25 most Promising new Companies” by CNBC and is headquartered in Boston’s historic Faneuil Hall.<p>Job Description\nJoining the Jebbit team will give you immediate ownership of our consumer-facing products as you’ll be working in a small team of developers build and ship features on a daily basis. You’ll be responsible for the planning and execution of sprints, building feature functionality, and maintaining and scaling our existing application. Ideally you&#x27;d have experience with AWS and building high-powered analytics systems. We’re a young startup and we’re growing our team with excited, resourceful individuals.<p>RESONSIBILITIES:<p>Be awesome<p>Write clean, maintainable and efficient code<p>Design robust, scalable and secure features<p>Contribute in all phases of the development lifecycle<p>Follow best practices (testing, continuous integration, SCRUM, refactoring, code standards)<p>Drive continuous adoption and integration of relevant new technologies into design<p>QUALIFICATIONS:<p>BS&#x2F;MS degree in Computer Science, or equivalent experience<p>5+ years of experience developing software in a production environment<p>Proven working experience in developing applications with Ruby on Rails<p>A firm grasp of object oriented analysis and design<p>Passion for writing great, simple, clean, efficient code<p>Good knowledge of relational databases (PostgreSQL a plus)<p>Demonstrable knowledge of front-end technologies such as JavaScript, HTML, HTML5, CSS, JQuery<p>Experience with Ember.js and&#x2F;or Node.js is a big plus","time":1436305753,"type":"comment"}