{"by":"carpo","id":9856526,"parent":9812245,"text":"Digital Carpenter [ <a href=\"http:&#x2F;&#x2F;www.digitalcarpenter.com.au&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.digitalcarpenter.com.au&#x2F;</a> ] | Sydney, Australia<p>Digital Carpenter is, at the moment, just me. I’m an experienced consultant, full-stack analyst&#x2F;developer, and entrepreneur. I’ve been running the company since 2008, building products, advising clients and developing custom web applications. I’ve used freelancer and o-desk but now need a full-timer to help move the company in a new and greater direction.<p>About the job<p>*\tYou will contribute to the concept, design and development of internal products and custom client applications.<p>*\tWrite and maintain the front and back-end code for custom client Web Applications.<p>*\tImplement written processes to optimise performance.<p>*\tWork independently while staying within deadlines.<p>*\tSetup and maintain the servers that run the Web Applications.<p>*\tThere is scope to learn new languages and platforms, and for the right candidate, become involved in all aspects of the client and product life cycle.<p>*\tDeveloping content managed sites using Drupal, including creating custom modules, themes etc.<p>*\tAnnual salary of around $80k (inclusive of super)<p>*\tFull-time Sydney CBD based role. No remote available.<p>About you<p>*\tEnjoys programming and technology.<p>*\tKnows at least one back-end programming language really well. (Most new work will be in PHP using Laravel, but you need to be pragmatic about language use)<p>*\tEnjoys brainstorming solutions, drawing on whiteboards, discussing options, and understanding problems.<p>*\tYou know your way around Linux, or are willing to learn.<p>*\tKnow how to install and configure a database. PostgreSQL would be great.<p>*\tUse MVC frameworks, but could also build a site without one (or write their own basic one) if needed.<p>*\tCan design and build relational database schemas based on the description of an applications requirements.<p>*\tUse a front-end framework like Bootstrap.<p>*\tYou&#x27;re fluent in the latest versions of CSS, HTML, and JavaScript.<p>*\tFamiliar with Git and GitHub<p>*\tGiven a design guide, you could easily create a website that seamlessly matches.<p>*\tKeen to grow and learn more about business, products, marketing and sales.<p>*\tYou hit the ground running when given a project code-base.<p>To apply, email jobs@&lt;company domain name&gt;. Please add a paragraph or so introducting yourself in the body of the email, and attach your CV.<p><a href=\"http:&#x2F;&#x2F;www.digitalcarpenter.com.au&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.digitalcarpenter.com.au&#x2F;jobs</a>","time":1436425158,"type":"comment"}