{"by":"andrew_mahon","id":4596697,"parent":4596375,"text":"Exceptionally Talented Web Developer: DUMBO, Brooklyn<p>We are looking for an exceptionally talented web developer or two to join our six-person team of creatives and coders for a series of upcoming projects. We are looking for specialists on both ends of the stack: Client and Server, but hope to find someone whose talents transcend that divide.<p>Us:<p>Type/Code (<a href=\"http://typecode.com\" rel=\"nofollow\">http://typecode.com</a>) is an interaction design studio that works with ambitious clients to bring powerful ideas to life. Our clients range from well-known brands like Google and MoMA, to awesomely ambitious start-ups, and everything in between. We focus on conceiving, designing, and developing exceptional digital experiences, across all sorts of devices. Our studio atmosphere is fun, laid-back, and made up of a passionate group of friends who are love what they do. We eat lunch together, and have a custom Type/Code tap handle. We're located in a great studio overlooking the Manhattan Bridge and Lower Manhattan in sunny DUMBO, Brooklyn.<p>Role:<p>You will be working closely with both our creative and development teams to drive forward development on any number of projects. You will lead development (either UI or Server, depending on your strong areas) on a variety of projects ranging from small static sites, to full stack web applications. While we have a set of homegrown libraries and best practices, we are always looking to learn, so you should come ready to criticise and contribute.<p>You:<p>- Love building rich web applications, and have the work experience to prove it.<p>- Don’t recall the last time you’ve said “That’s not possible!”<p>- You live and breath cutting edge technologies (transition:, PushState, MongoDB, Tornado, Node.js), but can jive with the tried and tested (float:, XMLHttpRequest, Django, Wordpress, PostgreSQL).<p>- Have a broad range of skills across the web development spectrum - but specialize in a few. For example, If you specialize in UI, you should have experience with creating a Wordpress theme, or asynchronously connecting with web services; or if you specialize in server code, you should be able to fully comprehend, and write basic HTML/CSS.<p>- Don't (necessarily) have a professional degree in Computer Science, or a related field. Many of the brightest talents in our field come out of self-motivation from disparate fields. Please don't write us about your degree or certifications in whatever proprietary language that you might have.<p>- Are creative and detail-oriented, with awesome organizational and communication skills. While we are all for independent-genius-types, we will work together as a team, and need to be effective in doing so.<p>- Are in New York and are ready to work on-site in our DUMBO, Brooklyn studio. Please no recruiters, agencies, offshore contract firms, or remote freelancers.<p>- Are ready to work with an awesome team in a laid-back but incredibly motivated environment.<p>Compensation:<p>Don't worry, we know what you're worth. Current position's are on a contract basis, so compensation will be commensurate with project scope. We have a handful of projects in the pipeline, so get in touch and let’s talk about what makes sense. Additional perks include a beautiful view of Manhattan, an adorable studio dog, free snacks and coffee, and periodically, free beer.<p>Hire me already:<p>Send a brief (but creative) cover letter and some work or code samples to jobs+hn@typecode.com","time":1349096491,"type":"comment"}