{"by":"mebassett","id":4596784,"parent":4596375,"text":"London, UK - full time.<p>Universal Pictures International - Junior Data Scientist, International Research<p>We're certainly not a startup, but our department acts like one as much as possible.<p>We're building tools to forecast, simulate, and model the box office market.  We're developing simulations and models to give us estimates on how the market responds to social media, weather, video games, et cetera, and we're building web apps and ipad apps to present this information to key people in a way they can use and understand.  We need your help taking the project to the next level.<p>Initially, we need help with our existing html5/javascript apps as more offices around the world start using our tools. Later on, we'll need your help experimenting with new simulations, and new ways for people to interact with those simulations. In particular, you will be:<p>* Maintaining, debugging, and adding features to our existing apps (browser and ipad) that help people configure and use our simulations.<p>* Helping to maintain our Amazon EC2 cloud infrastructure.<p>* Helping us build new tools to allow people to interface with our newer models.<p>* Helping us develop new models and simulations that can give us deeper insight into how the market behaves and that can respond to historical and live data.<p>What we use:<p>We have code running in Racket (Lisp) and have written experimental code in Haskell. We're not shy about experimenting with your favourite toolset. We also use:<p>* A lot of python (web.py) and javascript (jquery, jqtouch).<p>* Amazon EC2 for running the simulations and occasional number crunching.<p>* Whatever gets the job done.<p>Who we're looking for:<p>This is a junior programming position with a very small and experimental team. We're looking for someone that likes learning new languages and technologies for fun, wants to try new things out, and is comfortable with functional programming. We're also developing statistical models, so we'd like to work with someone who is comfortable with mathematics, statistics, and machine learning methods.<p>Interested?  My contact details are in my profile, or visit upi-labs.co.uk/jobs.  If you've contacted me before and didn't hear back, please feel free to do so again.  I'm afraid we aren't able to sponsor visas. ","time":1349097451,"type":"comment"}