{"by":"tarmigan","id":4597084,"kids":[4597969,4599493,4598828],"parent":4596375,"text":"Tesla Motors | Stationary Storage group | Full time | Palo Alto, CA<p>The Stationary Storage team at Tesla Motors is growing and we’re looking for smart and versatile developers to add to the team. Our current team is very small and we’re looking for a hand-on, generalist who will get things done. You will work on a variety of subsystems, some are existing codebases (with other users and developers) that need modification for our application, while other projects are new and specific to our group. The team is small and you will be able to shape the direction of the product and a large amount of ownership of the firmware and software that is specific to this application ranging from architecture to implementation to testing.<p>Here are some of the projects that we see coming up soon:<p>* Embedded C on a microcontroller with an RTOS<p>* Communication over CAN, Ethernet, zigbee, and GSM networks<p>* Machine learning for analyzing and modeling energy systems (We’ve been using Matlab and Go, but would love to explore R, Hadoop, and AWS)<p>* Design and evaluation of algorithms for energy and power markets (think Quant algos but controlling real hardware and moving energy instead of money).<p>* Designing a robust system to control distributed resources<p>* UI for customer facing control and data viewing<p>* Development of parsers/compilers/code-transformers/DSLs for templating and code generation.<p>While this isn’t the typical HN job, we could see many of these projects appealing to people who are excited about at least several of:<p>* Green Energy<p>* Physical hardware<p>* Parsers/Compilers/DSLs<p>* Machine learning/algos for people who don’t want to work in Finance<p>* A variety of languages and technology (in the last 6 months I have used C, Python, Perl, Go, Matlab/Octave, Tcl, VB, and in my small circle people are using Ruby, Java, php, R and probably others.)\nWe are a small team working on energy and designing physical hardware (which you will control!), so our internal conversions are more likely to touch on “watt-hours” and “tooling costs” than “closures” and “apps”.\nWe would love to see (but we have some positions that don't require these):<p>* Comfortable with embedded C<p>* Degree in Engineering or experience with Energy<p>If you are interested in this job please email tcasebolt@teslamotors.com<p>There are also many more positions available in other groups at Tesla Motors, which you can see here: <a href=\"http://www.teslamotors.com/about/careers\" rel=\"nofollow\">http://www.teslamotors.com/about/careers</a>","time":1349101160,"type":"comment"}