{"by":"jeremydw","id":4597086,"parent":4596375,"text":"Mountain View at Google<p>My team is hiring a Python/JavaScript developer to work on internal developer tools on a small tools and infrastructure team at our HQ in Mountain View. Specifically, we are building tools responsible for the production and maintenance of thousands of Google's websites.<p>Apply via the following application (the role in the JD isn't exactly the one I described, so please mention you saw this post on news.ycombinator.com to get your application routed to the right place!):\n<a href=\"http://www.google.com/about/jobs/locations/mountain-view/engineering/ux/html5-js-developer-mountain-view.html\" rel=\"nofollow\">http://www.google.com/about/jobs/locations/mountain-view/eng...</a><p>---<p>Requirements:<p>* Strong Python knowledge.<p>* Experience building web applications and web services (RESTful).<p>* Experience with NoSQL databases.<p>* Experience with HTML/CSS/JavaScript.<p>* Excellent attention to detail and knowledge of web application design best practices.<p>* Excellent leadership and organizational skills.<p>* Excellent ability to communicate with diverse groups of users and developers.<p>Preferred:<p>* Experience with App Engine (and Django).<p>* Familiarity with content management systems and/or web site production tools and related processes.<p>---<p>As a member of our tools team, you will work on a small team of web developers and collaborate with marketing and engineering to develop the web applications and systems that create, manage, and serve Google's web sites.<p>You will be working on all aspects of our internal site development tools: developing systems and services that support the main application, working with developers to spec out and design new features, and ensuring that our systems are stable and fast. You will communicate with our users (webmasters, web developers, designers, localization, marketing, product management, etc.) to come up with creative ways to enable them to build and manage thousands of high-quality web pages.<p>You will work independently but also take direction and participate in a close-knit team-based environment. We regularly write and review design docs for major and minor features and have open discussions about application design. We release our primary application daily and have high test coverage and code health.<p>You must be passionate about the web and be excited about enabling Google to build and create the absolute best web sites possible!","time":1349101166,"type":"comment"}