{"by":"seldo","id":4598056,"kids":[4598479],"parent":4596375,"text":"awe.sm - San Francisco, CA - H1B okay<p>We're looking for a developer experience lead; a longer job description is here:<p><a href=\"http://jobs.awe.sm/apply/iXa9QF/Developer-Experience-Lead.html\" rel=\"nofollow\">http://jobs.awe.sm/apply/iXa9QF/Developer-Experience-Lead.ht...</a><p>In a nutshell, we are a platform that lets apps capture the social data generated by their own users and use it to improve their products. To do that, we have powerful APIs that work best when closely integrated into our customers' own products. Our developer experience lead's job is to work with individual customers to make their integrations successful, then take that experience and feed it back into the product to make it easier for all customers.<p>Your day-to-day tasks will include improving our documentation, building prototypes and platform demos, and serving as a platform expert with customers, showing them the best way to use all of our platform's capabilities.<p>The nature of this job means we don't need an expert in one language: we need somebody who can quickly pick up whatever language and frameworks our customers are using, capable of rapidly assimilating new information quickly, and capable of clearly explaining that knowledge, both in person and in documentation. For the right person, this is a dream job.<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 13 people right now. We have a cool new office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1349110788,"type":"comment"}