{"by":"RichardPrice","dead":true,"id":4599399,"parent":4596375,"text":"San Francisco, CA. Full time. Remote is fine too.<p>Academia.edu is a social platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>We believe that science is dysfunctional, and we are working on fixing it. Almost every innovation in medicine and technology in the world has its roots in a science paper. If we want to speed up the world, we need to speed up science. There are many inefficiencies in science:<p>* it's too slow (there is a 12 month time-lag between submitting a paper to a journal and it being published)<p>* all the world's research ends up behind extraordinarily expensive paywalls, even though it was authored and peer-reviewed for free by the scientific community<p>* it hasn't moved out of PDF-land yet (scientists haven't been provided with the incentives to share things like data-sets, code, videos, and other kinds of rich media).<p>We are working on fixing this. We dream of a world where research is shared instantly, as soon as it's finished; where scientists share their full scientific output (data-sets, code, videos, and comments on all this media), and not just papers; and where a villager in India has as much access to the world's scientific output as a professor at Harvard.<p>We need talented and passionate engineers to help us accomplish this mission. We have made a good start: 1.8 million academics have joined Academia.edu, and 3,500 join each day. But there is much more to do.<p>We're a 10 person, engineering-driven, team based in downtown San Francisco. The site is in Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd. We have raised $6.7 million from Spark Capital, True Ventures, Mark Shuttleworth (founder of Ubuntu), and others.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. We are looking to hire a range of positions:<p>* full stack engineers<p>* growth engineer (optimizing our growth and retention channels)<p>* iOS engineer<p>There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. There is more on TechCrunch about our mission here <a href=\"http://tcrn.ch/T42VWC\" rel=\"nofollow\">http://tcrn.ch/T42VWC</a> (The Future of Peer Review) and here <a href=\"http://tcrn.ch/R6Pgrr\" rel=\"nofollow\">http://tcrn.ch/R6Pgrr</a> (The Future of Science)<p>We want to hire world class engineers. We want you to join us in building the future of science whether you are based in San Francisco, New York, Delhi, or Beijing. Remote work is fine. We will handle re-location, including visas, if you would like to re-locate, but re-location is not necessary.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1349126323,"type":"comment"}