{"by":"stevewilhelm","id":4599075,"parent":4596375,"text":"Platform Engineer - Euclid Analytics, Palo Alto, CA<p>Euclid is digitizing the real world and leveling the playing field for the brick and mortar retailers by changing how they use data. The platform engineer’s role is to digest and circulate our terabytes of data. Euclid treats platform as an essential and rigorous engineering domain, and invest ample resources to it.<p>To successfully handle the traction with our clients and convert it to revenue, we are growing the platform team. We want to re-architect, revise and strengthen the existing platform to digest and circulate the expected amount of data from global sources.<p>Both the analytic and web application component of our product depend on the platform engineers' work. The platform engineer architects data collection from real time sensor technology, scales and creates algorithms to extract revolutionary business insights, and automates this process to power Euclid’s web application.<p>As a member of the Platform team, you must enjoy big data and everything that comes with it – you need to possess intellectual breadth beyond software, enjoy the creative side of analytics, and have a willingness to work outside your comfort zone.<p>General Requirements<p>+ Enjoy the creative analytical process as an end in itself<p>+ Willingness to work outside your comfort zone<p>+ Intellectual breadth beyond software<p>Qualifications<p>+ Understanding of SQL<p>+ C/C++/Java development experience in commercial grade applications<p>+ Experience with large data sets<p>+ Experience with MapReduce concepts and architecture such as Hadoop, Hive and Pig<p>+ Familiarity with catching approaches and technologies such as JCS<p>+ Experience with development on Linux system<p>+ MS in computer science is preferred<p>+ Strong knowledge in math and statistics is a plus<p>Apply at <a href=\"http://euclidanalytics.com/about-us/jobs\" rel=\"nofollow\">http://euclidanalytics.com/about-us/jobs</a>","time":1349121914,"type":"comment"}