{"by":"kyleowen212","id":4609678,"parent":4596375,"text":"Serra, an EandM Company - San Francisco, CA and Healdsburg, CA - full-time, Automation PLC / HMI Engineers<p>Little different than the rest of the stuff here, but it's worth a shot:<p>Serra is looking for Industrial Automation Engineers to work in our busy San Francisco and North Bay engineering offices, serving clients in Northern California.<p>We know it's not the sexist programming technology, but if you want the opportunity to make physical systems move around and do cool stuff, this is the place for you.<p>Serra team members create and implement industrial automation systems. In addition to working as part of a team, you will be given the responsibility to complete many tasks independently. A thorough understanding of automation systems, computer systems, and software is required, along with a eagerness to learn and to implement solutions. The ability to complete projects on time and on budget are critical to achieving success at Serra.<p>The ideal candidate will meet one of the following two qualifications: \n1. A Bachelor's degree in electrical or mechanical engineering \n2. Or, 5-10 years of practical experience in a related field, including some or all of the following: \n• PLC Programming: Siemens, Allen-Bradley, etc. . . \n• Industrial HMI development and maintenance: Wonderware, WinCC, iFix, etc. . . \n• Database development and maintenance (SQL) \n• Industrial communication network architecture and maintenance, TCP/IP, Modbus (and variants), ControlNet, DeviceNet, PROFIBUS, PROFINET, RS-232, RS-485<p>In addition, the qualified candidate must have: \n• Excellent written and verbal communication skills \n• A fundamental understanding of computer hardware and system architecture \n• A fundamental understanding of computer communications and network implementation\n• Solid programming skills in a variety of languages and environments<p>What Can You Expect at Serra?<p>Serra serves clients in a wide range of industries; our clients include wineries, semiconductor manufacturers, and everything in between. Serra Engineers spend their time working on project assignments, service calls, project reviews, and post-implementation support.<p>Assignments are diverse and include many aspects of industrial automation, including manufacturing and distribution systems (with an emphasis on discrete control and process control) and real-time data transactions.<p>If you're interested, shoot us a line at jobs@eandm.com with your resume and cover letter!","time":1349298407,"type":"comment"}