{"by":"MattBelanger","id":4614241,"parent":4596375,"text":"WebCanada | Full-Time, Toronto ON | Full-Stack Web Developer and Front-End Developer (two positions)<p>KEY RESPONSIBILITIES:<p>Web/Technical Development &#38; Site Maintenance<p>•\tResponsible for creating, updating and maintaining web pages based on content provided by Team Leader/Project Manager\n•\tCoordinates and incorporates appropriate content and structure to enhance web sites.\n•\tResponsible for choosing and integrating the appropriate software applications that will meet the project needs.\n•\tProvides ongoing support and enhancement for various websites and research projects. This may include some database work and online development requiring more advanced web site coding (php, mysql, html, and CSS)\n•\tProvides accurate coding of HTML and CSS in a fast paced environment.\n•\tEnsures design and content meet project requirements (mobile users, desktop users, browser compatibility, accessibility needs, etc) \n•\tMeets with project leaders to determine project scope and its technical requirements\n•\tEnsures all website properties are in operation (i.e. no broken links, redirect, etc)   \n•\tTakes ownership of assigned tasks and deliver requirements within tight deadlines\n•\tMaintains awareness and educates the team of web industry developments and best practices\n•\tCreates technical project plans and timelines \n•\tReports regularly to Project Managers<p>QUALIFICATIONS AND EXPERIENCE:<p>Education normally required: Completion of College or University program in: Computer Science, IT, web-based design, programming.<p>Experience &#38; Technical Skills:<p>• 3-4 years experience in website development/programming \n• Experience with CMS based web applications\n• Strong programming skills in at least one common web development stack (For full-stack developer)\n• Strong HTML and CSS skills\n• Familiarity with JavaScript and at least one DOM manipulation library, preferably jQuery\n• Familiarity with programming for mobile devices (iPhone, iPad, &#38; Android platforms) is an asset\n• Familiarity with industry standard graphic tools such as Adobe Illustrator, Photoshop (image slicing, resizing etc)\n• Experience with e-commerce is an asset\n• Previous exposure to clients in Travel &#38; Hospitality industry is an asset<p>WE OFFER:\n•\tA competitive salary and all the Coffee Crisps you could ask for\n•\tHealth &#38; Dental benefits\n•\tA comfortable and fun working environment\n•\tExcellent opportunities for professional development\nAt WebCanada we love our customers and are driven to help them succeed. We do everything possible to learn from and help them, as a way to maintain leadership in our industry. If you've got what we're looking for, send your resume to: human.resources@webcanada.com","time":1349382929,"type":"comment"}