{"by":"kinvey","id":4616885,"parent":4596375,"text":"Android Developer | Cambridge, MA | Kinvey<p>Kinvey, a Boston based cloud and mobile startup, is looking for an Android hacker who wants to empower other developers to make the next generation of insanely great Android applications. If you love hacking on mobile technology, tackling tough problems around network connectivity, and get a thrill out of optimizing every last byte of memory, then we want to hear from you!<p>About You<p>You're creative:<p>You'll research and develop new techniques to build awesome mobile libraries, allowing developers to easily connect their apps to Kinvey's cloud backend, as well as 3rd-party APIs.<p>You're thoughtful:<p>Your goal is also to understand our customers, determine what they want and create the product roadmap for our library and cloud backend.<p>You're a coder:<p>You'll write, enhance, test and document a world-class Android SDK that saves developer time and makes it ridiculously easy to leverage the cloud.<p>You’re entrepreneurial and love startups:<p>In addition to building and managing the Android SDK, you’ll be creating new app ideas, as well as building and publishing them. At Kinvey, we'll help you market and scale your apps. Basically, you'll be a mobile app entrepreneur within a startup.<p>You're an evangelist:<p>We've built a first-class evangelism program, reaching the mobile developer community online and offline via content, meet-ups, presentations, social media and more. You'll create and publish content around our mobile libraries, as well as showcase Kinvey at hackathons and meetups.<p>You're happy:<p>We love what we do. You should too!<p>Requirements<p>You have at least 2 years developing in Java.\nYou've got no problems with network client implementation (REST, HTTP, TCP).\nYou think in TDD and you don’t ship untested code.<p>Bonus<p>You're completely comfortable with the Android SDK.\nYou've published multiple apps, and integrated with a cloud backend.\nExperience with mobile cross-platform tools (PhoneGap, Appcelerator, etc.) would be useful.\nGot a CS Degree (or equivalent)? We'll talk to you about sliding window protocols and shortest path algorithms.<p>How to Apply<p>Send your resume to jobs@kinvey.com with the title – \"I want to be your Android Developer\"\nSend us Google Play links to any apps you've released, along with links to code and blog posts you've written.\nWant to stand out? Write a mobile app that uses Kinvey and send us the Github link.\nBonus points for pointing things out that we can do better.","time":1349445735,"type":"comment"}