{"by":"AndreMploy","id":4626053,"parent":4596375,"text":"Spotify - within Operations in Stockholm, Sweden - Service Reliability Engineer<p>We want to connect millions of people with their favourite songs and create a service that people love to use. We believe music should be easily accessible and that listening to music will make people live richer lives. We want to create a win-win situation for people who love listening to music and people who love creating music.<p>Our work environment is exciting, informal, friendly, fun, and very demanding. As an operations engineer you are part of the operations team working on the development and maintenance of the Spotify production environment.<p>The primary mission of the operations team is to make sure that the music never stops streaming.<p>Working at Spotify you get an unique chance to work with very large scale systems, millions of users and an incredibly fast-growing environment.  Key areas of focus are: automation, a structured approach to system development and a sense for building scalable systems.<p>The system which feeds all these streams is a diverse and technically challenging environment. The service we operate is comprised of a large number of applications running on hundreds of servers in multiple locations around the world. Our platform is built with a special focus on scalability, using mostly Free/Libre Open Source Software.<p>Responsibilities \nWith all this in mind, we are looking for a colleague who will shoulder the following responsibilities:\nMaking sure Spotify works.\nDevelopment and design of the systems used to operate Spotify, with a focus on automation and maintainability at large scale.\nDeployment of hardware and software in the production environment.\nTroubleshooting and analysing applications, networks and hardware.\nCollaboration with the development team on operations-related issues, providing support and acting as stakeholder.\nRequirements\nThe ideal candidate is hardworking, motivated and responsible. A university education is a plus but not required- most important is the desire and motivation to learn, strong sense of ownership and drive.\nVery good understanding of Linux/Unix based server systems.\nExperience with configuration management tools for example: Puppet, Chef, cfengine or FAI.\nDeep knowledge of IP-networking.\nExperience with maintaining and troubleshooting complex and critical IT-systems.\nVery sharp analytical skills.\nExcellent written and spoken English skills.\nKnowledge of at least one scripting language (bash, perl, python, etc)\nDebian GNU/Linux knowledge a plus.\nExperience with revision control systems a plus.<p>This is a full time position, working out of our Stockholm, Sweden location. When applying, please include your skype id and provide all documents in PDF or TXT format.<p><a href=\"http://www.spotify.com/se/jobs/view/oWbOVfwA/\" rel=\"nofollow\">http://www.spotify.com/se/jobs/view/oWbOVfwA/</a>","time":1349686990,"type":"comment"}