{"by":"musman","id":3914863,"parent":3913997,"text":"San Francisco, CA - User Experience Designer @ BillFloat.com<p>BillFloat is seeking a passionate and creative UI/UX Designer to join our product team.<p>We have an innovative solution which offers consumers ‘more time to pay’ over 2,500  bills such as utility, cable, mobile and insurance payments through a range of affordable small-dollar credit offerings.<p>You will work closely with our sales, product and engineering teams to define and evolve the brand and experience across multiple channels. Your main task will be to embrace our users' needs and develop simple, accessible and easy to use design solutions.<p>* Role and Responsibilities *<p>You are self-directed, and comfortable running with a feature from inception to release in an Agile environment.  \nPartner with product managers, fellow designers, and engineers to drive to the heart of a complex problem space and articulate clear user-centered design solutions.  \nYou know how to use data and analytics to inform your designs.  \nBring ideas to life with compelling visual assets, writing and verbal communication.  \nProduce highly usable designs for web and mobile environments.  \nWhile you don't need to be a strong visual designer for this position, you understand intimately the role and influence the visual design process brings to the finished product.<p>* Experience and Skills *<p>2-5 years experience working on consumer web products.\nAbility to translate user goals and behaviors into design ideas.<p>Ability to create workflow diagrams, wireframes, and mock-ups rapidly and at an appropriate level of fidelity. (Hand-waving, white-boarding, paper, balsamiq, Adobe, etc)<p>Ability to assess technology constraints and opportunities, and adjust design approaches accordingly.<p>You know which small stuff to sweat - careful attention to detail while being able to adhere to project deadlines.\nExcellent interpersonal and communication skills.<p>* Extra Credit *<p>Experience in consumer financial or ecommerce products and checkout flows\nWorking knowledge of front-end markup: HTML, CSS, JQuery or Ruby.<p><a href=\"http://jobvite.com/m?3RHMjfwn\" rel=\"nofollow\">http://jobvite.com/m?3RHMjfwn</a>","time":1335886834,"type":"comment"}