{"by":"brianmwang","id":3914359,"parent":3913997,"text":"Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>) - New York, NY (Full Time/Intern, no remote, no H1B)<p>Web Developer (<a href=\"http://fitocracy.com/jobs/\" rel=\"nofollow\">http://fitocracy.com/jobs/</a>)<p><i>About Us</i><p>Fitocracy is a fitness social network powered by game mechanics to make exercise a more addictive, accessible experience for all. Hundreds of thousands of people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We turn life into the ultimate RPG where you are the hero that levels up, beats quests, and finds the best version of yourself.<p>Our mission is to turn fitness into a more fun, addictive, and accessible experience for everyone. We aim to provide the motivation, information, and community necessary to \"re-wire\" people's brains so they make sustainable, impactful changes in their lives.<p>We are a small, 5-person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups and Eniac Ventures. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p><i>Our Stack</i><p>Django, Ubuntu Linux, MySQL, nginx, AWS, redis, git, Celery, and Javascript. Expect to use/learn these all.<p><i>Who We're Looking For</i><p>- Experience with Python and Django\n- You can traverse across the web development stack and you're quick to pick up new technologies\n- You are obsessed with delivering a great user experience\n- You work well with small, tight-knit teams and communicate well<p><i>Bonus Points</i><p>- Sysadmin experience a huge plus\n- Interest in health &#38; fitness a huge plus<p><i>Contact</i><p>Email me at brian@fitocracy.com","time":1335881471,"type":"comment"}