{"by":"pabloest","id":3914841,"parent":3913997,"text":"San Francisco, CA<p>Meraki - <a href=\"http://meraki.com\" rel=\"nofollow\">http://meraki.com</a><p>Meraki is the leader in cloud networking and we have over 20,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://www.meraki.com/customers\" rel=\"nofollow\">http://www.meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco - yes, it's sunny here!<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you’ll be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://www.meraki.com/company/jobs#frontendengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#frontendengineer</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://www.meraki.com/company/jobs#backendsystemsengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#backendsystemsengineer</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://www.meraki.com/company/jobs#firmwareengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#firmwareengineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://www.meraki.com/company/jobs#technicalmarketingmanager\" rel=\"nofollow\">http://www.meraki.com/company/jobs#technicalmarketingmanager</a><p>* Front-end Developer: expert level command of HTML and CSS with strong Javascript skills, knowledge of a scripting language, familiarity with back-end application concepts and a strong design aesthetic. (B.S. degree in computer science or equivalent)\n<a href=\"http://www.meraki.com/company/jobs#frontenddeveloper\" rel=\"nofollow\">http://www.meraki.com/company/jobs#frontenddeveloper</a><p>// Support<p>* Technical Support Engineer: sharp, energetic, technical support engineer who can work closely with many groups within the company, including engineering, to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://www.meraki.com/company/jobs#technicalsupportengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#technicalsupportengineer</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, sales engineers, and strategic sales.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1335886632,"type":"comment"}