{"by":"j_bear","id":3914358,"parent":3913997,"text":"Stitch Fix is in San Francisco at 3rd and Market.  Full-time candidates only, local preferred strongly over remote, relocation possible for the right candidate.<p>Stitch Fix is a totally new way to shop -- check out our video (<a href=\"http://bit.ly/GSelpp\" rel=\"nofollow\">http://bit.ly/GSelpp</a>) for a quick introduction to our service. Here's how we do it: Our clients provide us with details about their size and personal style. Once a month they are offered a Fix: for a $20 styling fee we hand select 5 items using a combination of our proprietary styling algorithm professional stylists and send it to their home. If a customer chooses to buy one or more pieces, the $20 styling fee is a credit toward their purchase. Lots of additional detail is available in our faq (<a href=\"http://bit.ly/JaVIM6\" rel=\"nofollow\">http://bit.ly/JaVIM6</a>).  Our clients love the service and the business is exploding. We have thousands of paying clients, business doubled from November to April, will double again by September, and we will grow faster in 2013. We just raised our Series A from top-tier VC firm to invest in scaling engineering, operations, and merchandising -- which is where you might come in.<p>We are building the team that is going to take us to 10x by the end of next year. We are looking for folks that get super excited about jumping in the deep end, building outstanding products, and delighting clients. In Engineering we're big fans of Continuous Deployment, Specializing Generalists, and people that know the difference between hacking together technology and consistently delivering world-class products. We like people that take their work seriously but aren't serious at work. We believe the best products are delivered when engineers are empowered to solve problems, involved in how the business works and have a clear connection to their customer. The engineering team is currently a data and analytics engineer, a front end engineer/designer, and a generalist engineer. We are in the process of moving from a Linode/Django/jQuery architecture to AWS/Rails/(ember|backbone|similar) and beyond that we have <i>lots</i> of new products to build and will need to incorporate a bunch of new technology to get there.\nWe are looking for 2 more great generalist engineers, ideally with Rails experience but it's not a requirement.<p>If you're interested please send an email to jobs@stitchfix.com.","time":1335881464,"type":"comment"}