{"by":"bherrup","id":3914306,"parent":3913997,"text":"Sterling, VA - Washington, DC - ZipList, Inc. (no H1B, no REMOTE)<p>ZipList, Inc, newly acquired by Condé Nast, seeks a Mobile Developer for a full-time staff position in Sterling, VA.<p>ZipList, Inc. is the technology leader in universal online and mobile shopping lists and recipe boxes. The robust technology ZipList provides is simple: digital and mobile users can populate their universal recipe box and shopping list with recipes from anywhere on the web, including food sites, e-cookbooks, and blogs. They can also save recipes to their universal recipe box using texts and QR codes, or via their mobile device. Combining this robust functionality with the high-quality content available on Epicurious and other Condé Nast food brands, enables consumers to have a one-stop digital recipe and shopping list network offering tremendous ease and flexibility.<p>Condé Nast is home to some of the world’s most celebrated media brands. In the United States, Condé Nast publishes 18 consumer magazines, four business-to-business publications, 27 websites, and more than 40 apps for mobile and tablet devices, all of which define excellence in their categories. The company also owns Fairchild Fashion Media (FFM), whose portfolio of brands serves as the leading source of news and analysis for the global fashion community. Condé Nast has won more National Magazine Awards over the past ten years than all of its competitors combined. Follow us on Twitter @CondeNastCorp and @CondeNastCareer.<p>We are looking for self-starting, entrepreneurial-minded software engineers to work on meaningful components of ZipList's mobile offerings. We work in a highly Agile, scrum-based development environment and we release early and often.  The ideal candidate will be able to easily switch from mobile platform to mobile platform.  They will keep themselves abreast of the new APIs and technologies that are available on these platforms. Also, the candidate will be able to participate in the discussions and make recommendations about what are the best solutions for the many varied scenarios we may face.<p>Skills/Requirements :<p>• A minimum of a B.S. in Computer Science, Electrical Engineering, Computer/Software Engineering or similar degree, and two years of professional software development experience.<p>• A minimum of one year of Mobile Development experience (modern smartphone platforms a plus, iPhone, Android).<p>• Minimum two years experience with Java and/or Objective-C and their respective User Interface layers.<p>• Minimum two years experience with JavaScript, HTML and CSS.<p>• Experience with Client Application Development and Deployment Processes, a plus.<p>• Experience with AJAX, JSON, and REST a plus.<p>• Experience with Windows Phone 7 (.NET) , a plus.<p>• Familiarity with Ruby, Ruby on Rails (or experience with other dynamic languages like PHP or Python)<p>If this sounds like you, please apply at <a href=\"http://bit.ly/HSPVPu\" rel=\"nofollow\">http://bit.ly/HSPVPu</a>","time":1335880687,"type":"comment"}