{"by":"Jun8","id":3915563,"parent":3913997,"text":"Chicago, IL. Full time.<p>The Applications &#38; Analytics Architecture Group in Motorola Solutions is looking for an software engineer. The group performs research and development on video, image, audio, and data analysis algorithms, applications, and services, to create next-generation public safety and enterprise solutions.<p>Job Responsibilities:\n• Collaborate in cross-functional teams to develop system prototypes, integrating video/image analytics algorithms and software.\n• Contribute to the development of video/image analytics &#38; processing algorithms, develop efficient software implementations of the algorithms, run simulations to evaluate performance and refine the methods.\n• Generate patent disclosures covering the system solutions and the underlying methods.\n• Present results and demonstrations at internal meetings and meetings with customers.<p>Basic Qualifications:\nThe position requires an MS in Computer Science, Computer Engineering or Electrical Engineering.<p>Specific Knowledge/Skills:\n• Enthusiasm for solving complex problems.\n• Extensive C++ and/or Java programming experience and strong object oriented design experience, including working knowledge of core libraries and design patterns.\n• Significant software development experience, including use of software development tools and version control in Unix/Linux and/or Windows environments.\n• Application programming experience on Android mobile platforms.\n• DSP and/or GPU programming experience on embedded platforms is a plus.\n• Web applications or services development experience, including server-side and client-side web scripting (e.g. JavaScript, Python, and/or Perl) is a plus.\n• Experience with multimedia frameworks (e.g. GStreamer, WindowMedia) and video codecs (e.g. MPEG-4 AVC) is a plus.\n• Experience deploying video/image processing applications in live prototype or pilot systems a plus.\n• Some hand-on skills building circuits is a plus.\n• Familiarity with one or more of the following areas is desirable: video/image processing, computer vision, machine learning, data mining, and pattern recognition.\n• Strong teamwork and communication skills, creativity, productivity, and learning agility.<p>If interested, send me a message.","time":1335894740,"type":"comment"}