{"by":"cperea","id":3915794,"parent":3913997,"text":"Full Time Job Opportunity in: Austin, TX with RGM Advisors, LLC\nH1B Sponsorship is a possibility\nPosition: Quantitative Researcher\nIndustry: Financial/Proprietary Trading<p>RGM Advisors, LLC is a proprietary trading firm headquartered in Austin, Texas that applies scientific methods and computing power to trading in multiple asset classes around the world. This is a unique opportunity to join a successful quantitative trading firm in a geographic location that is consistently recognized as one of the top 10 places to live, work, and play.<p>Responsibilities:\nWe are currently seeking Quantitative Researchers at various levels who are capable of working within our proprietary computational research and modeling environment to develop automated trading strategies using machine learning, statistical analysis and other quantitative techniques. Successful candidates have the opportunity to solve complex and intellectually challenging problems including research and development into improved modeling techniques; design of improved tools and processes for conducting research and building trading models; and development and implementation of quantitative trading models for financial instruments traded in various markets.<p>Qualifications:\nInclude the following\nExcellent analytical skills\nAcademic background in engineering, computer science, physics, math, statistics or another quantitative discipline\nFamiliarity with machine learning algorithms, statistical analysis and/or quantitative analytical techniques\nFamiliarity with UNIX and C++\nRGM Advisors, LLC offers a fast-paced environment where individuals take pride and ownership in their work.  Our culture is intelligent, friendly and diverse.  Our modern, comfortable office space is located in downtown Austin, Texas with 360-degree views of the city.  We offer attractive compensation and benefits packages, hands-on training in trading and financial markets and a casual work environment that fosters innovation and creativity.<p>To apply for this position and to see a full list of open positions at RGM Advisors, please visit our career portal: <a href=\"https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;searchLocation=&#38;searchCategory=\" rel=\"nofollow\">https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;sear...</a>","time":1335897534,"type":"comment"}