{"by":"emidln","id":3915266,"parent":3913997,"text":"Highland Park, Illinois (near Chicago)<p>OpinionLab is hiring. We listen for, process, and analyze the feedback our customers' clients provide. \nYou might have seen our [+] around the web.<p>We're looking for someone with a very good working knowledge of Python who can work autonomously.\nIdeal candidates would be comfortable digging into the depths of SQLAlchemy or Twisted (via pdb and/or the source)\nif Google or IRC don't produce quick results. Specific libraries or skillsets aren't required (trust me,  \nI'll be interviewing you), but you need to be able to learn efficiently. You'll be working with a small dev \nteam and asked to learn the full stack. We're building the next generation of OpinionLab products, starting \nwith a new data processing architecture, so you'll have an opportunity to shape the company.<p>Everyone likes lists of buzzwords, so we are some things we use: django, tastypie, sentry, rabbitmq, salt, twisted, pypy, ruby, rails, gunicorn, nginx, sqlalchemy, mysql, postgresql, mongodb, redis, autonomy idol, virtualenv, supervisord, github, campfire, linux<p>Our work environment is very casual. You spec your own working environment (some like OSX, some like Linux,\na small minority even do daily work in Windows) so that you are most comfortable (I'm a tmux+vim fanboy).\nYou might find a dog or five in the office on any given day. We provide great benefits (see the linked \nofficial job spec[1] for details).<p>If you have any questions, I'm @emidln on twitter, emidln on skype. and badams@opinionlab.com via email.<p>Send resumes (preferrably with a link to bitbucket, github, or something else publicially visible) to \ncareers@opinionlab.com<p>[0] - <a href=\"http://www.opinionlab.com\" rel=\"nofollow\">http://www.opinionlab.com</a><p>[1] - <a href=\"http://www.opinionlab.com/company/careers/sr-software-engineer-python/\" rel=\"nofollow\">http://www.opinionlab.com/company/careers/sr-software-engine...</a>","time":1335891166,"type":"comment"}