{"by":"springub","dead":true,"id":3916002,"parent":3913997,"text":"Jimdo, Web Startup Generalist, San Francisco, full time<p>Are you ready to pitch in? Jimdo is looking for a Jack/Jill of all trades!<p>Are you comfortable with the Internet and web in all its forms? Do you enjoying doing some of everything? Join us for a different startup experience<p>Jimdo is the easy-to-use but powerful way to create websites. Jimdo has over 5 million users around the globe and is available in 11 languages with offices in Germany, Japan, China, and now the US. We opened our office in San Francisco to put together a small team to provide awesome support to our US customers and to approach the North American market more effectively (<a href=\"http://techcrunch.com/2011/05/19/website-building-tool-jimdo-is-taking-off-adding-cool-features-making-money/\" rel=\"nofollow\">http://techcrunch.com/2011/05/19/website-building-tool-jimdo...</a>). Our team in Germany handles product development and infrastructure, so we’re focused here on finding disruptive ways to reach US customers and establish our brand in North America.<p>Your responsibilities reflect our broad mission. Developing marketing campaigns, helping out with customer support and engagement (email &#38; live chat), SEO, editing help articles, finding and working with partners and affiliates, and more. It’s all hands on deck!<p>This position is full-time and located in our office in San Francisco's Mission district.<p>* We’re looking for someone who has exceptional knowledge about the Internet and building websites.\n * You should be not afraid of changing gears quickly nor of hunkering down on one project for several weeks.\n * Excellent communication skills -- for working with Jimdo users and colleagues around the world.\n * You should write well and clearly.<p>Benefits\nWorking for Jimdo in San Francisco is special since you'll feel like you're at a small startup -- but with a big team behind you. We want everyone who joins Jimdo to visit the office in Hamburg, Germany, about once a year to get to know and work with the European team. You could combine this with a holiday in Europe ;-)<p>* Competitive salary and benefits\n * Three weeks of vacation each year (we expect you to take it!)\n * Centrally located office in San Francisco's Mission District\n * Several health insurance options\n * Vision and dental insurance<p>Still unconvinced? Here are even more reasons to work at Jimdo! <a href=\"http://www.jimdo.com/about-1/reasons-to-work-at-jimdo/\" rel=\"nofollow\">http://www.jimdo.com/about-1/reasons-to-work-at-jimdo/</a><p>Go ahead: <a href=\"http://www.jimdo.com/jobs/\" rel=\"nofollow\">http://www.jimdo.com/jobs/</a>","time":1335900519,"type":"comment"}