{"by":"sbisker","id":3916465,"parent":3913997,"text":"Cambridge, MA / San Francisco, CA - Full Time or Intern\nWeb Developer at Locu (<a href=\"http://www.locu.com\" rel=\"nofollow\">http://www.locu.com</a>)<p># Exceptional software engineering talent<p># Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills, or the ability to learn quickly<p># Experience with Python / Django is a plus<p># Previous experience building rich, interactive websites<p># Basic design skills (Photoshop), ability to work with designers<p># Experience in designing dashboards and user interfaces is a plus<p># Previous start-up experience is a plus<p>Front-enders, \"desingineers\" and full-stack all welcome for this position - as long as you enjoy hacking on cool new products and features. :D (We're not explicitly recruiting for pure backend or pure design positions right now, but we're open to resumes there as well - see <a href=\"http://locu.com/#jobs\" rel=\"nofollow\">http://locu.com/#jobs</a> for details. If you're a perfect fit, we'll find a way to make it work.)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We are about to launch MenuPlatform &#60;<a href=\"http://www.menuplatform.com&#62;\" rel=\"nofollow\">http://www.menuplatform.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>Interested? Drop us a line at jobs@locu.com. Please specify which position you're applying for, as well as \"HN\", in the subject of your letter. Learn more about our open positions at <a href=\"http://www.locu.com/#Jobs\" rel=\"nofollow\">http://www.locu.com/#Jobs</a><p>-------------------------------------<p>Founded less than a year ago by MIT graduates and researchers, Locu &#60;<a href=\"http://www.locu.com&#62;\" rel=\"nofollow\">http://www.locu.com&#62;</a>; has the backing and support of some of the best angel investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 10 people with very diverse backgrounds, and growing.","time":1335907880,"type":"comment"}