{"by":"urlwolf","id":3919828,"parent":3913997,"text":"Fluidshopping - Berlin - Fulltime - CTO<p>We are a Berlin-based startup working on next-generation testing and user experience. At Fluidshopping, we want to make split testing easy for web shop owners.<p>This includes test that change the business rules, not the GUI. For example, you may want to test if sending a $10 voucher to those who buy &#62;$50 will have an effect on chance of repeated buy. Or you want to test the effect of free shipping when they bought &#62;$100. As far as we know, these tests are not easy without tinkering with the current shopping cart software setup. We want to make this as easy as testing the GUI and UX elements (design, copy).<p>We use lean startup methods, and can systematically test hypotheses on any market. Our approach is the ‘startup of startups’, that is, iterate fast and discard what doesn’t work, even if the new product looks like a completely new application (and startup!). We have runway for a year. We are two people, and have been funded for only two months. We have offices in Berlin, but we often work from home.<p>We are looking for a technical cofounder (CTO) to disrupt the ecommerce analytics market with us and to receive a forthcoming EXIST schoolarship (2000-2500€/person/month) for one year. We are two people, one of us is technical, with a PhD in machine learning.<p>Responsibilities:<p>Your responsibilities will be to work on new key features, help us scale, contribute to the product and optimize performance. You’ll be the CTO in an agile development environment. The job offers lots of challenges because we build a real-time collaborative tool in a large market that is ripe for disruption.<p>As the CTO, you set the technology. Our current MVP is Django. We need to interface with shopping carts, and when the API is not enough, that means some PHP may be unavoidable.\nWhat we like:\n- node.js\n- Mongo or similar NoSQL db\n- jQuery\n- JavaScript\n- python/django\n- Backbone.js\n- Familiarity with HTML5 (websockets)<p>Perks:\n- Work from home as much as you want\n- … but have a nice office, with terrace and BBQ\n- Stock options in two-digit range\n- Dog\n - In the center of the Berlin startup ecosystem (we organize events such as demodinner)<p>For more see <a href=\"http://fluidshopping.com/blog/about-fluidshopping/\" rel=\"nofollow\">http://fluidshopping.com/blog/about-fluidshopping/</a>","time":1335975331,"type":"comment"}