{"by":"Dwatson783","id":3920826,"parent":3913997,"text":"Havas Digital - Boston - Full Time - BI Developer &#38; ETL/API Developer (no remote, relo welcome to discuss)<p>Havas Digital is a global marketing agency focused on utilizing data to help drive marketing initiatives for our clients.  To help drive the greatest results for our clients we use Artemis- a Havas developed analytics platform that drives decisions using big data.  If you're interested in learning about digital marketing, analytics and enjoy playing with data from ad servers, twitter, facebook, site analytics, offline campaigns, CRMs and more then we're what you're looking for.<p>The two roles we are hiring for are based in Boston as part of our solutions team.  These candidates will work as part of a small team to build new capabilities for clients, increase the sources of data we use to build insights and lead new ideas to expand the platform development.<p>What we're looking for:\n- A person that lives to tell a story through data. That understands design and presentation and is willing to go past the traditional to bring better insights.  They should also have an understanding of the data and it's structure, how it should be molded and prepared to optimize it's use.  An interest in online marketing is helpful, experience with big data is preferred and the desire to learn more technically and in the business is welcomed with open arms. If you've worked with Tableau, Microstrategy, Excelcius and the other handful of BI tools out there- we want to hear from you.<p>-A person who loves working with data, is interested in pushing the cutting edges of data and what we can do with it and has an interest in social media and online marketing.  You should have experience with pulling data from APIs such as those from Facebook, Twitter, GA.  You've worked with manipulating those data sets, automating the processes to feed systems with what you've built and tied it out nicely by inserting QA and controls to monitor your work.  You have no fear of diving in and figuring things out and can learn the tools you need to in order to service the platform the best you can.<p>For more on Havas Digital and Artemis: <a href=\"http://www.havasdigital.com/artemis/\" rel=\"nofollow\">http://www.havasdigital.com/artemis/</a><p>Interested? Email me at Doug.Watson[at]HavasDigital.com","time":1335988603,"type":"comment"}