{"by":"willf","id":3921379,"parent":3913997,"text":"Wordnik.com (San Mateo, California)<p>We have lots of positions at Wordnik (wordnik.com) as we build out our new recommendation and discovery engine.<p>Check out the jobs page at <a href=\"http://www.wordnik.com/jobs\" rel=\"nofollow\">http://www.wordnik.com/jobs</a> or write me directly (will@wordnik.com)<p>Machine Learning Expert: At Wordnik, we work with text — lots of text. Wordnik uses empirical methods to build recommendation systems and to extend and improve our Word Graph. We employ statistical, machine-learning, and deep-learning methods to exploit that prior knowledge for the modeling of text. We are a coding shop; developers in addition to researchers.<p>Computational Linguist: At Wordnik, we work with text — lots of text. Wordnik uses empirical methods to extend and improve our Word Graph, and we employ statistical, machine-learning, and deep-learning methods to exploit that prior knowledge for the modeling of text. We are a coding shop; developers in addition to researchers.<p>Full-Time Web and Mobile Designer: You are a talented designer that knows the web and mobile ecosystems inside and out. You're passionate about mobile and the web. You have ideas spilling out of your head for design simplifications, improvements, and additions to the user experiences affecting millions of people. Your design work is clean, focused, and inspiring to others.<p>Mobile Developer: You are an eager iOS developer who is a quick learner, with a passion for creating delightful and intuitive software. You want to help push the platform to its limits, with implementation approaches transcending even Apple’s first-party apps.<p>Frontend Hacker: We're looking for a Ruby/JS hacker with aesthetic sensibilities who can help us improve our existing ruby applications and build cool new things like our mobile site, games, browser extensions, etc.<p>Server Engineer: Wordnik is looking for a senior level engineer to help develop our public and private API system. You will help build our out Application cluster, which requires nuts-and-bolts knowledge of high-performance application stacks.<p>Cloud IT Architect: We're looking for a senior, hands-on developer capable of interfacing with the Amazon EC2 API and others, who would be responsible for building internal tools to manage our software infrastructure. This would include both back-end workflow as well as user-interface components.","time":1335995255,"type":"comment"}