{"by":"functionx","id":3954079,"parent":3913997,"text":"Function(x) Inc. / Viggle - New York City / San Francisco\nFull-time - Software / Platform Engineers<p>Function(x) is a start-up \"mode,\" technology driven media company that recently launched the award-wining iOS app (coming soon to the Android market) dubbed Viggle - the first of its kind loyalty and rewards program for watching television (bit.ly/GHC4t2).<p>You can check into your favorite TV shows with Viggle and get great, real, tangible rewards such as movie tickets, music, gift cards and much, much more. All just for watching the TV shows you love.<p>The main conduit through which people interact with Viggle is through the mobile platform, so your work will directly reach the millions of users across the country (and beyond) that we plan on reaching.<p>As a member of our product engineering team, you’ll build real products for the real world. You’ll be responsible for developing server-side infrastructure that powers our mobile and web based product offerings.<p>Responsibilities will include everything from product specification to system design to implementation to operational deployment.  Function(x) systems operate at large scale under highly variable load, so experience with or interest in designing systems for high-availability and scalability is a must.<p>We’re building a great infrastructure to support Viggle – we’re not afraid to choose the best technology for the job, from Java to Node.js to RubyOnRails to Riak to PHP and Python   We use open source and want our engineers to contribute back to the projects we use. Our development processes are agile and transparent.<p>Interested? See more:<p>San Francisco - <a href=\"http://hire.jobvite.com/j/?cj=oiwdWfwH&#38;s=hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oiwdWfwH&#38;s=hackernews</a><p>New York - <a href=\"http://hire.jobvite.com/j/?cj=of1PVfwK&#38;s=hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=of1PVfwK&#38;s=hackernews</a>","time":1336664371,"type":"comment"}