{"by":"tlipcon","id":3300604,"parent":3300290,"text":"INTERN or FULLTIME (REMOTE for some positions)<p>Offices in downtown San Francisco, Palo Alto, and Research Triangle Park<p>Cloudera offers enterprises a powerful new data platform built on the popular Apache Hadoop open-source software package. We enhance the storage and processing technologies originally developed by the world’s biggest Web companies, allowing our growing list of global customers to use Hadoop to solve problems and achieve their particular business goals.<p>We're hiring across a number of departments. A few that might be interesting to the HN crowd:<p>- Distributed Systems Engineer, Platform team: get paid to work on open source projects like Hadoop, HBase, Hive, Pig, ZooKeeper, Avro, etc. The work is challenging and impacts hundreds or thousands of companies worldwide, plus you get to collaborate with folks at a number of other companies on a daily basis<p>- Distributed Systems Engineer, Enterprise team: work on monitoring and deployment software that scales to 1000+ nodes. This software needs to collect metrics, generate alerts, search logs, and manage deployment at very high scales.<p>- Senior UI Engineer: build rich web interfaces to simplify the user experience for operators trying to manage 1000-node clusters. JavaScript, CSS, HTML, and a bit of Java.<p>- Software Quality Engineer: help test, validate, and debug the products mentioned above. You will get to drive 100-1000 node test clusters to their breaking point and then dig into what broke.<p>- Customer Operations Engineer: help Cloudera customers solve daily issues they run into when using software in the Hadoop ecosystem. Learn these distributed systems inside and out. Be the Dr House of Hadoop.<p>Our company is currently around 135 people, but growing fast. Our investors are top notch: Accel, Greylock, Meritech, Ignition. Our most recent round was $40m about a month ago, so we are well funded and will compensate you with more than ramen noodles (though we do offer free lunch!).<p>The full list is available here: <a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a><p>Feel free to contact me at todd@the obvious domain.com if you have any questions. Otherwise apply above.","time":1322761738,"type":"comment"}