{"by":"nixy","id":3300525,"parent":3300290,"text":"Stockholm, Sweden<p>Mountain View, CA<p>Madrid, Spain<p>Hong Kong<p>At Accedo (<a href=\"http://www.accedo.tv/\" rel=\"nofollow\">http://www.accedo.tv/</a>), we're hiring web developers, mainly client side, for work on connected tv platforms such as Samsung, Panasonic, LG, Roku, Boxee etc.<p>These are our current openings. Contact <i>nik at accedo dot tv</i> if you are interested or have any questions. Make sure to add \"HN\" to the subject line :)<p>Junior development engineers<p>Accedo is looking for talented and motivated junior engineering staff for our development centers in Stockholm, Hong Kong, Madrid and Mountain View, California. Experience from TV and Video technologies as well as knowledge about a wide range of programming languages are an extra bonus, but all talented applicants are also welcome. Since we have customers all over the world, language skills are also appreciated.<p>Senior development engineers and project managers<p>We are always looking for experienced staff to strengthen our development centers and provide leadership. A senior development engineer should have several years work experience and knowledge on a wide range of technologies and programming languages. They should also have experience and practice of creating high performing and manageable server side platforms. Interest and experience in developing applications for TV or Mobile device platforms is beneficial.<p>Business development manager<p>Accedo is looking for successful sales and business development managers. In this role, you are the face of Accedo to our customers and drive all sales efforts either directly or through partners. You should have at least 3 years sales experience. You should have a genuine interest in the latest trend in consumer electronics and new media as well as an overall understanding of software development projects.<p>Project or Thesis students<p>Are you a student looking for project or thesis work? Accedo has many exciting projects on next generation TV technology. We are actively looking for Masters and Undergraduate students to perform their thesis projects or internships at our Stockholm and Hong Kong development centers.","time":1322760496,"type":"comment"}