{"by":"relaunched","id":3301034,"parent":3300290,"text":"Santa Monica, CA<p>Venture-backed Parking In Motion is seeking Software Engineers / Python Programmers.<p>Send resume to jobs@parkinginmotion.com<p>Job Description<p>Are you interested in making magic using a massive brew of data, code, and creativity? Parking in Motion is looking for energetic, clever people to join our team who can pick up, take over, re-think, hand off, or own just about anything. The range of our systems require you to bring a broad set of skills as well as an eagerness to delve into uncharted territory without fear.  Python, Bash, GIS, AWS, PostGres, OCR, JSON, API, Obj. C, Java and looking for people to explore new technology to solve our complex problems.\nDesired Skills &#38; Experience<p>Requirements:\n3+ Years of production experience\n3 or more programming languages at an expert level\nIdeal candidate must have guru-level experience with 2 or more of:\nDatabases (PostgreSQL, MongoDB, etc)\nPython/Django + Frontend (MooTools, JS, CSS, HTML, etc)\nGrad-school level statistics (also: SAS, R, etc)\nMapping/Geospatial (GEOS, Mapserver/GeoServer,PostGIS,TIGER,etc)\nReliability and Quality (VM, HA, SCM/Build/CI/QA systems, etc)\nMobile Development (iPhone, Android, push notifications, etc)\nInformation Architecture/Visualization<p>Company Description<p>Parking In Motion (PIM) is the leading provider of dynamic and real time parking data, retaining deals with app developers, map makers, and GPS navigation companies. PIM's database is the largest of its kind, offering complete coverage of the US, Canada, and Europe with over 20,000 public parking lots enhanced with rates, hours, entrance points, and occupancy information.\tAdditionally, the database includes on-street meter and sign restrictions in the top 26 US markets.Building on its resources and relationships with operators and municipalities, Parking In Motion serves as an industry leader in providing accurate and instantaneous real time parking information to the world. With its assortment of tech-smart parking tools, PIM's innovative approach to parking makes it easier than ever for motorists to find the best possible place to park. By empowering drivers with intelligent information and an ever-expanding database, Parking In Motion aims to eliminate the stresses of parking once and for all.","time":1322767248,"type":"comment"}