{"by":"bkudria","id":3301555,"kids":[3303437,3302777,3357758,3336828],"parent":3300290,"text":"Hi, you might have heard of the company I work for, Yammer. We were in the news recently, and we're looking to hire in San Francisco.<p>We've got a variety of positions open, but since this is Hacker News, I'll tell you about our engineering team. Every single engineer here is the type of person that can be honest with themselves and others. We like to use tools and technologies because they allow us to build things our customers want, not because we think the tools are cool.<p>Some tools we use: Java. Scala. Ruby, and Rails, Javascript, Node.js, Objective-C, and C#. We like to store things in Postgres, Riak, Vertica, and our super-awesome custom-built distributed feeds DB written on top of BDB JE-HA.<p>If you're the type of engineer who believes in the One True Language To Rule Them All, we're not interested. If you're the type of engineer who doesn't understand how users think, we're not interested. Yammer has a high bar, and we're not willing to compromise on that. If you're confident in your abilities, and you think you can help use take over and <i>change</i> corporate America, let's talk.<p>Yammer is the type of place where you can use whatever resources you can muster to actually change the world. Yammer is used by many many large corporations, with real impact. We have customers inside the valley, outside the valley, and all around the world. We're used by a vast majority of companies in the Fortune 500. We have customers with 10 employees, 100 employees, and 100,000 employees. Or more. We allow those employees to all talk to each other, stay connected with their company, and do their job vastly more efficiently. Our customers stop sending email. Our customers communicate outside their departments, and low-level employees can have frank and honest conversations about their work with C-level executives. A Yammer company is quite different than your average company.<p>Our product is kinda like Facebook, and kinda like Twitter, sure. We're inspired by the best, and we won't hesitate to steal good ideas. But any change we make to our product is tested thoroughly and analyzed intelligently. We like the scientific method. We're not messing around. If you'd like to join a serious team of hard-working and effective engineers with their hearts set on changing how the modern corporation communicates, get in touch.<p>Yammer pays competitively. Yammer offers all the standard perks. Yammer is no longer allowed to host events in certain SOMA drinking establishments.<p>If you have questions, send me an email: bkudria@yammer-inc.com","time":1322776571,"type":"comment"}