{"by":"arupchak","dead":true,"id":3302674,"parent":3300290,"text":"Amazon.com - Seattle WA - No remote, but willing to relocate based on experience. H1B is possible, again, depending on experience.<p>I am looking for a strong Systems Engineer for our growing team. We like to describe our organization as a Startup within Amazon, as our part of the business is still growing rapidly and our engineers can have a lot of influence on where the product goes. For this role in particular, I am looking for someone with a strong infrastructure/hardware bias to help us make the changes we need to scale our business over the next ten years without having to lift a finger. We are moving more and more of our applications and services to AWS technologies and we are looking for someone to help lead this initiative.<p>Job description below. Contact me at ${hn_username}@gmail.com if you have any questions.<p>The Amazon Marketplace team is looking for a great Systems Support Engineer to keep our systems running and our customers happy. You should be comfortable in a Linux environment, be able to automate everything you did yesterday, and willing to troubleshoot and solve new problems on a daily basis. Come join one of the fastest growing teams within Amazon.<p>Responsibilities:<p>-Maintain stability and performance of our systems via tickets during business hours oncall shifts<p>-Diagnose and troubleshoot new production issues that affect our customers<p>-Create and maintain standard operating procedure documents for new issues identified<p>-Automate operational tasks to assist with our scaling needs<p>Requirements:<p>-Proficiency in a scripting language (Ruby, Perl, Python, Shell)<p>-Familiar with SQL databases<p>-Comfortable navigating a Linux environment<p>-Basic understanding of web application architectures<p>Bonus points:<p>-Written a Rails application<p>-Deep knowledge of Oracle databases<p>-Troubleshooting experience<p>-Ticketing experience<p>-Worked with AWS EC2 or RDS","time":1322799700,"type":"comment"}