{"by":"lvella","id":3304959,"parent":3300290,"text":"San Francisco, CA Full time<p>The medical software industry is experiencing a revolution, and pMDsoft is looking for Software Developers who have the talent and drive to change it forever. You'll have a huge impact on health care in America by using cutting edge technology to change the way that physicians practice medicine.<p>We are small yet fast-growing and profitable company looking for Software Developers and Senior Software Developers to join our team.<p>A developer's career at pMDsoft is nothing like the stereotype of a programmer. In addition to brilliant engineering, it involves high-level decision making; interaction with customers who love using our product; involvement in sales, recruiting and other aspects of the business; and rapid career growth through real mentorship.<p>It's like a startup in that you'll wear many hats, have a lot of responsibility and be part of a small, highly-motivated team. It's not like a startup in that we make our own business decisions. We have a proven and profitable product, extremely happy customers and a team of people as talented as you are. We love what we do. We strive to work like a beautifully engineered German car: fast, efficient and fun<p>Your programming work will focus on extending our Java/JSP Web application, with an emphasis on open source technologies like Linux, Apache, Tomcat, Struts, AJAX/Web Services and MySQL. You'll have opportunities to work on sophisticated native apps for Android, iPhone, iPad, BlackBerry and possibly others.<p>You:\n-bring at least three years of focused, impactful experience as a Web and/or mobile developer... plus a lifetime of curiosity \n-Have intelligence, energy and integrity\n-want to grow your career quickly and start learning management skills\n-lead multiple high-priority projects simultaneously\n-design applications that are intuitive and fun to use\n-communicate fluidly in a team environment\n-find elegant solutions to complex business issues that don't -always involve writing code\n-aren't agoraphobic - travel is fun!<p>We:\n-never set foot in a cubicle farm\n-like to play with sleek machines named after fruits and robots\n-inhabit a historical building in beautiful San Francisco\n-love our work\n-prefer Mac and Linux to... other operating systems\n-prefer to work in person with a small, fast-paced team\n-always search for the next hot thing\n-stock beer, tea and snacks in the office<p>If interested, please send your resume to lvella@pmdsoft.com","time":1322849179,"type":"comment"}