{"by":"200902","id":3304540,"parent":3300290,"text":"New York City - Full Time - Mid-Level Agile Developer (Rails)<p>Founded in 2003, Cyrus Innovation (www.cyrusinnovation.com) is a small (~40 people) NYC-based Agile development consulting firm. Cyrus believes that quality people, practices and code are the foundation of success, and pride ourselves on being named one of Inc. 5000's fastest growing companies for three consecutive years. We embrace the latest Agile practices, strive for continuous process improvement, and use the latest technologies (Rails, Scala, NoSQL, nodejs, MongoDB, HTML5, Groovy and more). We’ve spent nearly a decade helping enterprises and startups adopt Extreme Programming development practices by working side-by-side to achieve success. Our clients include: Saks Fifth Avenue, Boston Capital, NFL.com and Simon and Schuster. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you.<p>What you’ll do:\n- Create useful solutions to real problems\n- Code in Rails\n- Seek out ways to continuously improve software \n- Test Driven Development, Pair Programming\n- Mentor junior team members and pair with seniors\n- Interact directly with clients and have a voice in critical design decisions\n- Collaborate on all stages of software development from design to implementation<p>What we’ll do for you:\n- No travel\n- A true 40 hour work week\n- Great benefits including health, dental, vision, and 401(k)\n- Compensation ranging from 86K - 101K\n- Bagel Fridays and a kitchen stocked with snacks and beer\n- Annual personal budget and time off for professional development (conferences, workshops, etc.)\n- An energized, yet causal work environment\n- Game nights\n- Hackfests<p>You will bring:\n- 3-5 years of professional experience\n- A true, demonstrable passion for coding, both in and out of the office\n- A team oriented work demeanor and a desire for both teaching and learning\n- The ability to adapt to various cultures and environments\n- A strong enthusiasm and knowledge for XP\n- The desire and ability to learn new technologies quickly\n- Knowledge of design patterns and refactoring\n- Strong understanding and experience working with Ruby on Rails<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. Because happy developers produce the best work, we do everything we can to find, hire and keep the most talented minds in our industry. Whether we are building web applications and products, introducing new technologies and development practices, or just helping a great team get their work done, our spirit of joyful collaboration inspires everything we touch. We are serious about our commitment to our employees and invite you to join our team.<p>If you are interested in learning more or would like to apply for a position, send an email with your resume and cover letter to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1322844147,"type":"comment"}