{"by":"thehammer","id":3316585,"parent":3300290,"text":"Braintree - Chicago, IL<p>We're seeking exceptional developers.<p>If this job isn’t right for you, we’ll pay you $5,000 if you refer someone who is hired! Have them contact us or send us their contact information and we will do all of the leg work.*<p>We are growing our development team. Instead of including a list of requirements we want you to understand how we work. If our environment sounds like a place for you, then go to our ‘How to Apply’ section and follow the instructions.<p>How we work<p>We pair...<p>We pair program to write all of our software. We work on Mac Pros with two keyboards and two monitors. We work in an open team room; no cubicles or private offices. Communication is key to our process, and we don't want to hinder it with walls.<p>We test...<p>Testing is at the forefront of our development philosophy. We never need to check our code coverage to know that it's at 100%: with disciplined TDD, no line of code will be written without a test. We don't have a QA team. That might be terrifying when you consider the type of software that we're building, but we're confident that our automated testing is thorough and will catch any regression bugs. We use continuous integration to test every version of every client library against our gateway.<p>We are agile...<p>Agile development methodologies mean different things to different people. For us, the most important part of Agile is doing what works best for the team. We have a story card wall and release a few times a week. We keep the team in sync with daily standups and have a retrospective once a month to discuss things that are going well and opportunities for improvements. We’re pragmatic, not dogmatic. Although we have strong opinions, we're never afraid to try to new things to see if they work and reconsider our positions if the situation warrants it.<p>We are polyglots...<p>Although most of our software is written in Ruby, we don’t confine ourselves to a single programming language. We believe in using the best tool for the job while maintaining a slight bias toward the tools the team knows the best. We’ve written infrastructure components in Python, and we build client libraries for integrating with Braintree in Ruby, Python, Node.js, PHP, Java, and .NET.<p>We value our people...<p>We spend a whole day every two weeks working on whatever we’re interested in, regardless of whether it's relevant to the business. Some examples of the things people have chosen to work on include competing against each other to build a mesh chat client in node.js, contributing to open source projects, and discussing strategies for our Google AI challenge submissions.<p>Salaries are generous and compensation packages include 401k contributions, and ample vacation time.<p>Interested?<p>We're looking for people who are interested in getting in on the ground floor of an incredible opportunity to build amazing software and transform the payments industry.<p>Take a look at some of our blog posts to see some of the problems we face:\n<a href=\"http://www.braintreepayments.com/inside-braintree/how-we-built-the-software-that-processes-billions-in-payments\" rel=\"nofollow\">http://www.braintreepayments.com/inside-braintree/how-we-bui...</a><p>Take a look at some of the code we have on github: <a href=\"https://gihub.com/braintree\" rel=\"nofollow\">https://gihub.com/braintree</a><p>Think you’ve got something to contribute to our exceptional team? We’d like to hear from you!<p><i></i>NOTE: The referrer will receive this bonus only after the candidate is employed at Braintree for at least 60 days after his or her start date. The referrer must also complete and return a w-9 in order to receive the bonus. The referrer is responsible for paying taxes on the referral bonus. Also, to qualify for the referral bonus, the hired candidate must have accepted our offer of employment within two months of your referral.","time":1323120712,"type":"comment"}