{"by":"chrislorenz","id":3320551,"parent":3300290,"text":"Looking to join a future-forward technology company with a team full of brilliant, fun, talented people? At GraphEffect we know that choosing the right individual is what builds a great company. So far we have done just that and are looking for more passionate grade A players to join our team. We are shaking up the online ad industry by building a social campaign platform from the ground up. As an official Facebook Marketing API/Tools provider, our work is put in front of some of the most influential people in tech and the response has been great.<p>At GraphEffect we are constantly focused on creating the best user experience possible. To do this we need a rock solid and creative UX designer to help take our product to the next level. This individual needs to live and breathe UX and is extremely detail oriented. You must willing to take risks on ideas and iterate based off of feedback. We aren’t looking to reproduce what other ad tech companies are doing. Our goal is to disrupt the industry.<p>Responsibilites:<p>* Creating beautiful, intuitive and engaging user interfaces and interactions.<p>* Work closely with the Director of Product, Design &#38; Engineering teams to make your ideas a reality.<p>* Organize and standardize design patterns to keep the UI consistent and maintainable.<p>* Think outside the box, constantly come up with inventive ways to approach functional problems using your design skills.<p>* Deep understanding of the effect of online social interaction.<p>* Constantly learning and evolving your craft.<p>* Wireframing, mocking up and presenting your ideas in a cohesive manner.<p>Requirements:<p>* LOVE what you do!<p>* Be a team player, leave your ego at the door (while still  having confidence in your ideas)<p>* Superior Visual Design skills, from typography to shifting pixels.<p>* Compassion for the user, understanding where friction lies and how to design a better solution<p>* Constantly work on reaffirming your ideas by interacting with users and testing actual behavior.<p>* 4 years + Working experience in web &#38; app design.<p>Applications will only be considered if you include examples of past/current work. This job is for co-location only(We are located in Santa Monica, CA), no remote applicants please.<p>Please apply here: <a href=\"http://grapheffect.theresumator.com/apply/1H3w4y/Passionate-UX-Designer.html\" rel=\"nofollow\">http://grapheffect.theresumator.com/apply/1H3w4y/Passionate-...</a><p>Thanks!<p>Chris Lorenz\nDirector of Product\n<a href=\"http://grapheffect.com\" rel=\"nofollow\">http://grapheffect.com</a>","time":1323199058,"type":"comment"}