{"by":"vencatter","id":16052719,"kids":[16081753],"parent":16052538,"text":"Unnamed Yet | Fullstack, Backend, Frontend, DevOps Engineer | Junior &amp; Senior | Germany, Hamburg | Full-Time | ONSITE | VISA<p>Use your chance to design a whole product from scratch. We are searching our first five employees (whole teams welcome!) to build an automated solution for an existing, proven and successful business. We will start in late Q1&#x2F;2018 on technical green grass. We will be a completely decoupled subsidiary from our parent company and can benefit from long-term funding. We are not wasting our time on the next pitch for investors. Instead we focus on and work with our existing customers and benefit from our position without market-entry barriers.<p>You would...<p>* Work for an extraordinary life-work-balance and a fair, market-driven compensation<p>* Have the chance to build a product from day one<p>* Be able to work in the tools and languages you know best<p>* Be directly involved in profit sharing instead of working for low equity which eventually would be a net-loss for you<p>* Be part of an international team as we care for different cultures from begin on<p>We...<p>* Care for developer and personal skills and want to benefit from your knowledge<p>* Are interested in building junior aswell senior positions (this means: apply even without much professional knowledge!)<p>* Believe in flexibility instead of 40h&#x2F;week<p>* Live a feedback, non-bullshit-speak culture<p>* Honour error-making instead of unconsciousness<p>* Are located in Germany (Deutschland), Hamburg with own office space near main train station<p>* Are willing to provide Bachelor-&#x2F;Master-thesis-agreements if you want to stay in long-term<p>* Are building a real team where on-site activity is needed nevertheless we will have homeoffice policies<p>Interview process: virtual session(s) with CTO; on-site Mettbrötchen mit Zwiebeln™ (or pizza ;-) with CEO &amp; CTO; contract<p>Contact me: whoishiring@heap.nu<p>Avoid the confidence gap and reach out to me without bullshit-speak. We can talk on Skype and&#x2F;or phone for more details without you having to invest much time before preparing your application. Even a one-liner is okay. Please only applicate if you are near to us, willing to relocate (we will help you!) or to commute some days a week. No remote-only applications, please.","time":1514909691,"type":"comment"}