{"by":"triplesec","id":16057974,"kids":[16060261],"parent":16052538,"text":"Hackmind www.hackmind.ai, an engineer-focused incubator | Engineer&#x2F;Programmer participants, plus ancillary staff (esp at first HR &#x2F; Admin, Product EIR, interns) | Berlin, Germany, visas provided | Full time ONSITE<p>You can still apply last minute as we have a few spaces (cohort up to 50 people), but we&#x27;re also rounding out our team, especially initially in HR &#x2F; admin, product. Bright (paid) interns are also welcome. Note: some of the job roles on our website are adaptable, depending on the candidates&#x27; balance of experience and expertise and how they add to the team. You&#x27;re very welcome to email us (info &lt;At&gt; hackmind &lt;dot&gt; ai) with questions on that, and have a chat. As a startup, all of us also do all the jobs at various times where necessary.<p>A bit of background: we&#x27;re a pre-incubator in Berlin, with a deep engineering focus, and our next batch begins later this month. We give engineers plenty enough money to live here for 3 months to hack out your startup idea properly and find your (also technical) cofounder. So we help you at an earlier stage than most incibators, and we&#x27;re deeply engineering-focused.<p>Berlin is cheap and fun, but full of MBA-led company builders. Instead we&#x27;re engineer-led and aim to bring more hacker culture to this fine city. We&#x27;re bringing together lots of extremely smart engineers in one place to experiment, hack, test, and figure out what to build. So that catalyses the creation of ambitious new companies with genuinely original and - hopefully - world-changing results. We have a special focus in the ML and Deep Learning fields, and in Blockchain, but please note <i>good engineers and developers of all kinds can apply and are welcome</i>. We help  with both technical mentoring and the non-engineering things that you don&#x27;t think you can do as a startup, beginning with cofounder-finding.<p>Importantly, also to succeed you need soft skills. We love measuring things, and will help you with your metrics, and  how to develop your communication, personal and team skills.<p><pre><code>  For the second three months we fund the incorporation of your company (in any country: US, Germany, Estonia, wherever makes the most sense to your future). This part constitutes  more of the &#x27;standard&#x27; building incubator phase, with more money, offices ancillary support, and help with product and the business aspects of how to run a startup. We help you develop your product and prepare for demo for seed round or ICO. \n</code></pre>\nWe also have about 20-30% engineers with industrial engineer domain experience participating, for others of our participating engineers to team up with (12 fields, see website, including Biomedical, computational biology, materials, physics, robotics &#x2F; computer vision, energy and more).<p>You can apply through the website, or email us at [info &lt;at&gt; hackmind &lt;dot&gt; ai] with &#x27;HN&#x27; as part of the email title and I will personally reply.","time":1514948931,"type":"comment"}