{"by":"bitxbitxbitcoin","id":16057422,"parent":16052538,"text":"Spydermix | <a href=\"https:&#x2F;&#x2F;www.spydermix.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.spydermix.org&#x2F;</a> | Engineer | Full-Time | Remote<p>Interested in giving a giant middle finger to repressive regimes? Do you eat DHTs, blockchains &amp; P2P routing algorithms for lunch? Are ridiculously hard problems your idea of fun? Are you the kind of person who could figure out how to create a uni-directional off-chain micro-payment channel with multi-sig support for a verifiable market with order matching and final settlement via smart contract, without trusted parties - taking into account the impossibility of fair exchange without a trusted third party, maybe based on probabilistic payments and&#x2F;or zero knowledge contingent payments? Did you smile reading that last part? Good, it’s more fun when you have a sense of humor.<p>We’re working on changing the game with the backing of the world’s largest VPN service. An unstoppable multi-protocol decentralized onion routing system that is going to weave privacy into the very fabric of the Internet. Like TOR, if TOR was embedded into everything, had sensible economic incentive mechanisms, and was resistant to sybil attacks.<p># Scale of initial deployment<p>Servers : 100K+ Traffic : Exabytes Users : Millions<p># Things you probably already know in and out<p>IP networking, onion routing, VPNs, applied cryptography &amp; blockchains at the protocol level.<p># Things you’ll wonder when you read the prototype Apache module for fun<p>- Why don’t most HTTP proxies support keep-alives?<p>- Can you add a flag to the HTTP_PIPE contract to specify whether or not to use Global Session Support (GSS)?<p>- Is there a better way to track a single session across separate processes other than keeping track of session state in shared memory?<p>If you think you’re the type of person we’re looking for. Get in touch by sending a shout out to: contact [at] spydermix.org","time":1514940996,"type":"comment"}