{"by":"shiv86","id":16056504,"parent":16052538,"text":"Goldman Sachs | Full Stack Developers, (React,Redux,AEM) Front End Engineers (Java, Spring Jersey, Jackson,Dropwizard, MongoDB Microservices Architecture)Back End Engineers | Full Time | Chicago | ONSITE |<p>Consumer Finance Technology (CFT) is a new division within the firm focused on bringing state of the art Goldman technology to the consumer market enabling a complete new line of business Our goal in engineering is to facilitate the creative, iterative, and data driven creation of our all digital retail bank.<p>RESPONSIBILITIES AND QUALIFICATIONS\nThis role is truly an amazing opportunity to make an impact on a new and exciting division utilizing the latest technology. You&#x27;ll play an instrumental role in enhancing a highly visible existing platform and building a modern UI&#x2F;micro-services backend for GSBank.com. The role will provide you an opportunity to learn, take ownership and become a subject matter expert (SME) for our online banking platform. You&#x27;ll join a fintech startup environment with daily stand-ups, huddles and sprints.<p>Basic Qualifications:<p>Front End:\n• Experience building web interfaces using HTML5, CSS, CSS3,SASS, Bootstrap \n• Strong with vanilla JavaScript knowledge\n• Strong knowledge of JavaScript framework: React and Redux\n• Experience with build tools: webpack, grunt and npm\n• Knowledge of web fundamentals&#x2F; technolgies \n• Knowledge of testing frameworks (Karma, Jasmine)<p>Server Side:\n• Strong Knowledge Java programming languages\n• Strong Knowledge of Spring Frameworks and related Spring Projects\n• 7+ years of relevant (above) work experience\n• Exceptional software engineering knowledge; OO Design Principles\n• Experience building service highly scalable, available, and secure service and integration layers\n• Experience with RESTful Architecture\n• Experience with Enterprise Architecture, SOA, Micro Services Architecture\n• Strong Linux&#x2F;Unix skills\n• Experience with testing frameworks (JUnit, Mockito etc)<p>Reach out: Shivam.x.Sinha at gs.com","time":1514932543,"type":"comment"}