{"by":"gault8121","id":16052999,"parent":16052538,"text":"Quill.org | Software Engineer | New York, NY | ONSITE, SALARY: 80k-120k, <a href=\"https:&#x2F;&#x2F;www.quill.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quill.org&#x2F;</a><p>Quill.org is an open source web app that helps low-income K-12 students become great writers and critical thinkers. Quill is now being used by 600,000 students from 2,000 schools across the country, and we are funded by foundations such as the Bill &amp; Melinda Gates Foundation and Google.org, and the Pineapple Fund!<p>2018 will be a big year for Quill - we won a grant of $1m from the Pineapple Fund, and we are on track to help more than 1 million students improve their writing skills this year.<p>30 million low-income students in the United States struggle with writing, and we aim to help all of these students become confident writers and critical thinkers in the next 10 years. To see how writing instruction is a game changer for students, please check out this Atlantic article: <a href=\"https:&#x2F;&#x2F;theatln.tc&#x2F;2aJnEfU\" rel=\"nofollow\">https:&#x2F;&#x2F;theatln.tc&#x2F;2aJnEfU</a><p>We are looking for a talented web developer with 2+ years of experience who is passionate about education and open source development. The developer’s primary responsibilities will be scaling our Rails services to grow from 30k to 100k daily active students over the coming year. You’ll be responsible for owning features by influencing the initial spec, building the backend APIs (mostly Rails), and writing the front-end code (mostly React), and maintaining the feature once deployed.<p>We’re a small team of nine working in the Financial District of New York City. You will be joining as our fifth engineer, and you will be directly involved with both building the app and testing it with students in classrooms.<p>Fast Company recently featured Quill and explored how our automated writing feedback helps students revise their work and improve their skills:  <a href=\"https:&#x2F;&#x2F;www.fastcompany.com&#x2F;40458272&#x2F;this-machine-learning-powered-software-teaches-kids-to-be-better-writers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastcompany.com&#x2F;40458272&#x2F;this-machine-learning-p...</a><p>To apply, send us a resume, cover letter, and links to your blog, projects, Github, and any other resources that might help us understand your background and skills. Send these to Peter at jobs(at)quill(dot)org","time":1514911236,"type":"comment"}