{"by":"samidalouche","id":16054801,"kids":[16150349],"parent":16052538,"text":"Narrative I&#x2F;O | New York, NY | Full-time | ONSITE, REMOTE | <a href=\"http:&#x2F;&#x2F;narrative.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;narrative.io&#x2F;</a><p>Narrative is building the first global data marketplace.  It has often been said that data is the new currency.  Unfortunately, maximizing the value of data is often easier said than done.  On one side, transacting via individual point to point integrations carries a lot of overhead in both business development and technical integration efforts.  On the other, going through big aggregators introduces opacity in the pricing and provenance of the data.  At Narrative, we help our customers get value from their data by building a central auction platform to reduce the friction and tooling to increase the transparency in this process.<p>We are a small, early stage team looking for great developers who want to jump in and take major systems and user-facing features from design to launch.  Here&#x27;s where we are now:<p>- We are operating in Amazon Web Services.  Our services are mainly deployed on EC2 provisioned with Terraform.<p>- We also heavily use other technology on AWS such as DynamoDB, S3, and RDS.<p>- Our backend includes a data ingestion web service with supporting Kinesis consumers, along with a growing array of Spark projects.  It’s written mostly in Scala, with a smattering of Python for lambda functions.<p>- We sit somewhere in the middle of the “Scala as a worse Haskell” and “Scala as a better Java” spectrum.  We love functional programming and we do make use of libraries like cats, but at the same time we heavily favor core language features and have no intention of rewriting everything using Free Monads.<p>- Our frontend is written in Typescript with Angular2 and a supporting API running on Node, and is deployed and monitored using much the same supporting tech as the backend.<p>- Other services we use include: GitHub, CircleCI, DataDog.<p>Find out about Company Culture: <a href=\"http:&#x2F;&#x2F;transparency.narrative.io&#x2F;culture&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;transparency.narrative.io&#x2F;culture&#x2F;</a><p>Apply at hiring@narrative.io. We are hiring for Backend and Frontend Software Engineering roles and are building the team with a remote-first mindset.<p><a href=\"http:&#x2F;&#x2F;transparency.narrative.io&#x2F;join&#x2F;backend.html\" rel=\"nofollow\">http:&#x2F;&#x2F;transparency.narrative.io&#x2F;join&#x2F;backend.html</a>","time":1514922004,"type":"comment"}