{"by":"Youpel84","dead":true,"id":16057216,"parent":16052538,"text":"Iterable | San Francisco, CA | Full-Time, Onsite | <a href=\"https:&#x2F;&#x2F;iterable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;iterable.com</a><p>We’re excited to announce that Iterable ranks #1 on SaaS 1000 for two consecutive quarters. Our amazing team brings the growth hacking tools that consumer Internet companies like Twitter &amp; Facebook build internally to other large-scale companies. We aim to build the best user growth engine on the planet.  Over the past year we&#x27;ve grown from 35 to 100 employees, raised $30.5M of funding in Series A &amp; B, backed by reputable investment firms (CRV &amp; Index Ventures) and increased annual revenue 2.5x.<p>Our team of hackers and thinkers is from quant finance&#x2F;Twitter&#x2F;Google, (we built large parts of Twitter&#x27;s growth systems). One of our top level goals is to build a uniquely fun and growth oriented company culture. Knowledge sharing in any capacity is highly valued here -- are you interested in prediction markets or PGP encryption? Do you enjoy teaching posture techniques or purely functional data structures to others? We pair program, design together, and generally create a learn-and-teach environment here.<p>This is an opportunity to join a super-fast growing startup, in a huge market and with a great team, while it&#x27;s still early. If you&#x27;re interested in coming on board, you can help with some challenges we face: scale our messaging API, design and write performant, beautiful, asynchronous interfaces, write software to build machine learned user models, make data visualizations for our email and user data and design an immutable deployment infrastructure for our platform.  Technologies you&#x27;ll work with include; Scala, Elasticsearch, Postgres, Redis, AngularJS, Play Framework and RabbitMQ. You&#x27;ll get to work with us at our beautiful office at 3rd and Harrison in San Francisco.<p>Current Engineering Openings:\n* Software Engineer, DevOps - Infrastructure\n* Software Engineer, Front End\n* Software Engineer, Machine Learning\n* Software Engineer, Mobile\n* Software Engineer, Product - Full-Stack\n* Software Engineer, Security\n* Software Engineer, Systems - Infrastructure<p>To learn more about who we are, our engineering culture, and whether this is the right place for you, read our Key Values profile: <a href=\"https:&#x2F;&#x2F;www.keyvalues.com&#x2F;iterable\" rel=\"nofollow\">https:&#x2F;&#x2F;www.keyvalues.com&#x2F;iterable</a> and be sure to visit us at <a href=\"https:&#x2F;&#x2F;iterable.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;iterable.com&#x2F;careers&#x2F;</a> to view all the opportunities currently available on our team. Please email Melanie Graff (Senior Recruiter) at melanie@iterable.com with any questions. We look forward to speaking with you soon!","time":1514938792,"type":"comment"}