{"by":"clarkevans","id":16053115,"parent":16052538,"text":"Prometheus Research - Full Stack Developer | New Haven, CT | REMOTE &#x2F; US ONLY<p>Come and join our medical research registry development team.<p>Prometheus Research (<a href=\"https:&#x2F;&#x2F;prometheusresearch.com\" rel=\"nofollow\">https:&#x2F;&#x2F;prometheusresearch.com</a>) builds informatics solutions for medical researchers and medical associations, helping researchers manage their studies and helping doctors increase quality of care.  Most of our company&#x27;s work is client-facing application development and customization.  Some of our products that are of broad general use are included in an open source RexDB (<a href=\"https:&#x2F;&#x2F;rexdb.org\" rel=\"nofollow\">https:&#x2F;&#x2F;rexdb.org</a>) platform.<p>As a remote-first team, we value collaborative developers who excel at written communication, enjoy working with product users, and are self-directed.  Currently we are transitioning from a monolithic Python&#x2F;PostgreSQL&#x2F;React based application over to multi-application (but single repository, single VM) orchestration.  Proficiency with full-stack implementations and security standards (<a href=\"https:&#x2F;&#x2F;owasp.org\" rel=\"nofollow\">https:&#x2F;&#x2F;owasp.org</a>) is important.<p>In this position, you&#x27;ll be expected to drive key parts of our medical research registry product.  This involves looking at various client solutions, abstracting out shared functionality, documenting&#x2F;implementing shared works, and helping our custom development team with transition.  You&#x27;ll be working with FHIR, an emerging HL7 standard for medical data sharing.<p>This year we&#x27;ll be branching out to use Julia for backend data analytics and ReasonML&#x2F;OCaml for our front end development.  If you&#x27;re interested in hearing more, please send your resume and cover letter to sr-engineer-2018@prometheusresearch.com At this time, the expected pay range is from $90-$120K&#x2F;year.","time":1514911861,"type":"comment"}