{"by":"gtf21","id":16057120,"parent":16052538,"text":"Converge | ONSITE | Full time<p>About us:<p>Converge’s mission is to make construction and industry efficient, safe and sustainable by bringing data-driven decision making to the worksite. We make it easy to deploy large-scale wireless sensor networks and analyse the physical data they produce, and are convincing the world’s largest, most traditional and risk-averse industrial companies to embrace IoT. We have deployed on some of the UK&#x27;s largest residential, commercial, and infrastructure projects, and are now expanding into Europe and SE Asia.<p>We&#x27;re a small(ish) team but growing rapidly (7 in Dec. &#x27;16, 20 in Dec. &#x27;17) and have a diverse set of nationalities, age ranges and backgrounds as well as reasonable gender diversity (although we want to, and are, improving on this).<p>(PS. website is very out of date, currently undergoing a redesign so it&#x27;s not a great place to look for info on us)<p>Looking for:<p>Senior Embedded Systems Engineer<p>Email: hiring@converge.io to apply<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;converge&#x2F;jobs&#x2F;86838-senior-embedded-systems-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;converge&#x2F;jobs&#x2F;86838-senior-embedded-systems...</a><p>One part of our product is our wireless sensor network which collects physical data from worksites (e.g. a construction site) and delivers them to our servers for analysis. These have to be low-power, robust, and secure as we operate in some very hostile environments for IoT products. We are looking for a Senior Embedded Systems with experience building and delivering connected products (preferably in an industrial setting), as well as with experience of team leadership in this field.<p>Requires:<p>- experience building and delivering internet-connected products;<p>- experience leading an embedded-systems team;<p>- excellent embedded C&#x2F;C++ knowledge;<p>- good understanding of security on constrained devices;<p>- experience with RTOSs.<p>Nice to have:<p>- knowledge &#x2F; experience of mesh networking;<p>- knowledge &#x2F; experience of LoRa &#x2F; other LPWANs;<p>- good electronics design ability.","time":1514937790,"type":"comment"}