{"by":"leadpages","id":16066199,"parent":16052538,"text":"Drip + Leadpages (www.Drip.com) - Minneapolis, MN | Full Time | ON-SITE | Now Hiring Senior Ruby on Rails Developers, Senior DevOps Engineer, Support Engineer, BI Analyst, Account Executives, Customer Success Director and Technical Support Manager! We are also hiring for Python Developers for our Leadpages product team.<p>As a fast-growing startup in Minneapolis, Drip is backed by two of the tech industry’s most prominent venture capital firms and has quickly become one of the most cutting-edge and beloved products in our space. We are a small product team within Leadpages, an early-stage tech company, which has made #297 on the 2017 Inc. 5000 list (we were #3 in Minnesota) and named a Star Tribune Top Workplace for the past three years in a row! To learn more about us, we invite you to visit our Instagram, Facebook and About pages.<p>Now that the introductions have been made… here’s what we’re using:<p>Drip is a beautiful Ruby app that’s built on Rails 5, AWS, JSON, Sidekiq, Redis for caching, ElasticSearch, Ansible, Flight, PostgreSQL, Vanilla JS and Elm.<p>Leadpages is working built on a gorgeous Python REST API stack using Kubernetes on the backend and React on the front-end.<p>If anything caught your eye, we’d love to hear from you! We currently have opportunities available for:<p>- Support Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2BHoy97\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2BHoy97</a><p>- Senior Ruby on Rails Developer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2E4dgMB\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2E4dgMB</a><p>- Technical Support Manager =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2npl0oV\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2npl0oV</a><p>- Business Intelligence Analyst =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2CxZq7T\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2CxZq7T</a><p>- Account Executives =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2CDDdWM\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2CDDdWM</a><p>- Sales Development Reps =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2CAZ1lm\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2CAZ1lm</a><p>- SVP of Engineering =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2CPbBv1\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2CPbBv1</a><p>These are all full-time positions with exceptional benefits! We also offer generous relocation packages to help you relocate to beautiful Minneapolis, MN, if you are open to relocating.<p>Interested in emailing us directly? You can reach me at Tiffany@Ave81.com (no agencies or 3rd parties, please!)<p>Let’s build something awesome!","time":1515020072,"type":"comment"}