{"by":"baflatfair","id":16060513,"parent":16052538,"text":"flatfair | Senior Software Engineer | London, UK | Onsite | <a href=\"https:&#x2F;&#x2F;flatfair.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;flatfair.co.uk</a><p>This is a unique opportunity to join a founding team and impact every renter in the UK through exciting and highly rewarding work. We expect more people renting than ever before. That’s why we believe renting should be more affordable and accessible. We are a young and innovative startup company solving an affordability problem by offering deposit-free renting to millions of Tenants across the UK - with lots more exciting stuff to come.<p>Job Description<p>Our company was founded at the beginning of 2017, you’ll be joining the team of three founders. We’re about to go live with our first major client. In preparation for growth after that we’re looking to hire engineer #1. Day to day you’ll be working with CTO building our web app, APIs, infrastructure and helping to grow our team.<p>For the first version of our platform we’ve decided to keep our product as simple as possible. It’s small monolithic application written in  python (django), deployed on aws, using circleCI for builds, our infra is defined with terraform, we’re using postgresql for data store and pure html&#x2F;js for frontend. Experience with specific technologies we use right now is not required as long as you have worked with more than one stack during your career. We’re planning to keep open mind when selecting tech for new parts of our product. Some of direction we’re considering are elixir, go, clojure.<p>flatfair is based in London, so you must have the existing right to work within the UK. We offer competitive salary (£60-£85k depending on experience), flexible hours and the chance to make a big impact, quickly.<p>If you’re interested email us at careers@flatfair.co.uk or apply through <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;tnc2kg\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;tnc2kg</a>","time":1514983591,"type":"comment"}