{"by":"tlshaheen","id":16060402,"parent":16052538,"text":"Phone2Action | DevOps Engineer, Backend Software Engineer, Full Stack Engineer, Non-Engineering Roles (for example, Sales!), Summer INTERNS | Washington, DC | Full-Time | Onsite or US Remote | <a href=\"https:&#x2F;&#x2F;phone2action.com&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;phone2action.com&#x2F;about&#x2F;careers&#x2F;</a> or <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;phone2action&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;phone2action&#x2F;jobs</a> | Agile | VISA Sponsorship Available for exceptional candidates who already in the US<p>Phone2Action is the world’s fastest growing civic technology company. Millions use our tools to participate in public policy campaigns.<p>Build and innovate on tools that help connect people with their elected officials at the federal, state, and local level!<p>As a member of the engineering team you will join a world-class engineering-driven company, where you&#x27;ll have instant impact from day one. We have an open culture and flat organization where engineers sit just a few steps away from the founders. And we&#x27;ve raised over $5M in funding, including our $4.6M Series A funding round in 2016.<p>Our product has driven more than 18 million connections with elected officials since our founding in 2013 -- and we&#x27;re just getting started. If you have great problem solving, analysis and design skills, and a true passion for quality – you will be a great fit for the Phone2Action team.<p>Salary ranges from $80K - $145K for engineering roles!<p>All jobs are listed at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;phone2action&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;phone2action&#x2F;jobs</a> Email me - luke@phone2action.com - prefixing the subject with &quot;HN:&quot;, and include anything that will set you apart from the pack :)<p>DevOps Hypewords: AWS, Infastructure, Linux, CI, CD, Continuous Integration, Continuous Delivery, SQL, Ansible, SaltStack<p>Backend Hypewords: LAMP, PHP, MySQL, Laravel, APEX, Ruby, Java, Redis, API, Codeception<p>Frontend Hypewords: VueJS, ReactJS, HTML, CSS, Bootstrap, Webpack, Jest, ES6<p>Third party systems: Salesforce, Facebook, Twitter, MailChimp, NationBuilder","time":1514982325,"type":"comment"}