{"by":"patrycjaostrow","id":16060543,"parent":16052538,"text":"Optiver | DevOps Systems Engineer | Amsterdam, the Netherlands | Full-Time | Onsite | VISA Sponsorship<p>Optiver is a leading electronic market maker driven by\ntechnology. We build high-performance, low-latency trading systems and algorithms that are constantly evolving. Our infrastructure of globally distributed systems generates petabytes of data every day. To be able to compete in this industry everything, from the hardware to the software, has to be perfect.<p>As a DevOps Systems Engineer you will care for our trading software and systems using your distinct skillset and insights, and adapt the environment as required to achieve our business goals. Activities include setting up, tweaking, optimizing and monitoring the different software and hardware components manually, as well as developing tools to make these activities less labour intensive and more consistent.<p>More detailed job description: <a href=\"https:&#x2F;&#x2F;www.optiver.com&#x2F;eu&#x2F;en&#x2F;job-opportunities&#x2F;eu-510834\" rel=\"nofollow\">https:&#x2F;&#x2F;www.optiver.com&#x2F;eu&#x2F;en&#x2F;job-opportunities&#x2F;eu-510834</a><p>What you&#x27;ll need:<p>- Education in an IT related study;\n- Extremely well-developed analytical skills, smartness and stress resistance;\n- Experience with Unix&#x2F;Linux as well as Windows systems;\n- Scripting skills (i.e. Python, Bash, PowerShell, SQL);\n- Facilitating and enabling attitude, with a hands-on mentality;\n- To be a team player with excellent communication skills;<p>We offer excellent remuneration and great secondary benefits, such as an attractive profit sharing structure, training opportunities, fully paid first-class commuting expenses, a premium-free pension, breakfast and lunch facilities, sports and leisure activities, even weekly chair massages and of course Friday afternoon drinks. We are used to guiding expats through their relocation and offer relocation packages and discounts on health insurance.<p>If you are interested, get in touch at patrycjaostrowska@optiver.com.","time":1514983940,"type":"comment"}