{"by":"vasm","id":16067701,"kids":[16111395,16111391,16068370],"parent":16052538,"text":"Waldo Photos | Front-End&#x2F;Full-Stack Engineer | Austin, TX | ONSITE | REMOTE | Full-time | $80k - $100k<p>Waldo Photos is a photo finding platform empowering consumers to toss their selfie sticks, put their phones back in their pockets and live in the moment. Waldo is the only platform that removes all of the friction in getting photos of you taken by others and creates new opportunities for photographers to market and sell their photos.<p>We&#x27;re looking for an independent problem-solver who values learning, keeps current on technology trends, and enjoys the ownership and accountability that is expected from early-stage team members. The ideal candidate:<p><i></i>Desired Qualifications:<i></i><p>- Proficiency in React and Redux (built and shipped, 2 years of experience desired)<p>- Some experience in GraphQL and related libraries like Relay or Apollo (or at least some friction with those and willingness to learn)<p>- Strong design engineering skills (HTML&#x2F;CSS&#x2F;UX implementations)<p>- In depth understanding of the JavaScript ecosystem. Including but not limited to: ES2015&#x2F;6&#x2F;7, Babel, Webpack, Node.js runtime differences, Universal JavaScript, Unit test runners and supporting frameworks<p>- Interested in Node.js backend work or desire to learn other languages (we use Python, Clojure, Go and whatever language&#x2F;library&#x2F;platforms is right for the job)<p>The part of our stack you&#x27;d be primarily working on:<p>We&#x27;re heavy GraphQL users and all our web properties are based on React. Our main frontend web property is built on top of Apollo and Redux while we have some properties using just Redux (but still interfacing with GraphQL).<p>Our hiring process:<p>We don&#x27;t do algorithmic interviews, we provide a take-at-home mini-test focused on the frontend and then you&#x27;ll have a couple of discussions with some of our engineers about it.<p>Our vacation policy is very flexible.<p>Email at: vassilis@waldophotos.com","time":1515035246,"type":"comment"}