{"by":"ephermata","id":16066662,"parent":16052538,"text":"Microsoft (Security Risk Detection in AI &amp; Research) | Senior Developer | Redmond, WA | ONSITE | Full-Time<p>Microsoft Security Risk Detection brings pioneering Microsoft technology for analyzing the risk from &quot;million dollar&quot; bugs to everyone, wrapped up in a scalable cloud service for security testing. Customers come to Microsoft Security Risk Detection to scale security assurance processes without sacrificing speed of execution. We help customers be the best they can be at analyzing the risk from insecure software so they can do more of what they love. Learn more about the service at <a href=\"https:&#x2F;&#x2F;www.microsoft.com&#x2F;msrd\" rel=\"nofollow\">https:&#x2F;&#x2F;www.microsoft.com&#x2F;msrd</a>.<p>We are looking for a talented software engineer with strong technical skills and smooth team collaboration skills to join a small team of developers working in a fast-paced environment. This position is for a highly motivated and passionate engineer who can work autonomously and provide consistent engineering execution. You will be responsible for the technical execution and overall quality for our fuzzing workflow on Linux. This entails improving the existing offering to adapt to customers’ needs as well as implementing new scenarios.<p>As part of the Microsoft AI + Research organization, Microsoft Security Risk Detection is creating value for customers from cutting edge Microsoft research. Our organization is working tirelessly as one to democratize access to artificial intelligence technologies that are changing the world.<p>Want to learn more? feel free to email me: dmolnar (at) microsoft.com . I lead the group. I am also happy to answer questions about what it&#x27;s like at Microsoft generally or AI &amp; Research specifically.<p>Link to full JD and official application:<p><a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;jobdetails.aspx?ss=&amp;pg=0&amp;so=&amp;rw=1&amp;jid=320277&amp;jlang=en&amp;pp=ss\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;jobdetails.aspx?ss=&amp;pg=0&amp;so=&amp;r...</a>","time":1515023604,"type":"comment"}