{"by":"einaren","id":16079802,"parent":16052538,"text":"Emerson - Roxar | Software Engineer | Full-time | Oslo, Norway &#x2F; Stavanger, Norway | ONSITE , Relocation Assistance available<p>Roxar Software Solutions is part of Emerson Automation Solutions, providing subsea reservoir management and production optimization for global upstream to E&amp;P customers. \nThe use of Roxar technology enables our customers to increase oil and gas recovery, accelerate production and reduce capital and operating cost. \nWe develop high performance, interactive software for processing large volumes of scientific hydrocarbon reservoir data. Our project teams consist of highly skilled and motivated people across disciplines, from domain experts to developers and testers. We work by agile methods and are determined to deliver code by the highest standards. Our main products are RMS, Tempest and Roxar API, which are considered among the best in class by users all over the world.<p>Our products are cross-platform (Windows+Linux) and are built using the following techniques and tools<p><pre><code>  - C++, Python and C# \n  - Cross platform framework: Qt \n  - 3D visualization: Open Inventor, OpenGL, HueSpace, CUDA \n  - Wells data visualization: INT libraries \n</code></pre>\nWe are looking for three developers with proven skills in one or more of the following; API development, UX design, 3D graphics and knowledge in reservoir or wells domains. Experience with C++ is a must, experience with Python is a plus. Whether you develop on Windows or Linux is your choice. The working language in Roxar is English.<p>Benefits of working in Norway are 5 weeks paid vacation, free health-care and other benefits ranking Norway at the top of the OECD&#x27;s quality-of-life study <a href=\"https:&#x2F;&#x2F;www.weforum.org&#x2F;agenda&#x2F;2018&#x2F;01&#x2F;how-s-life-where-you-are&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.weforum.org&#x2F;agenda&#x2F;2018&#x2F;01&#x2F;how-s-life-where-you-...</a><p>Full job spec and application here - <a href=\"https:&#x2F;&#x2F;www.finn.no&#x2F;job&#x2F;fulltime&#x2F;ad.html?finnkode=110087989\" rel=\"nofollow\">https:&#x2F;&#x2F;www.finn.no&#x2F;job&#x2F;fulltime&#x2F;ad.html?finnkode=110087989</a>","time":1515171872,"type":"comment"}