{"by":"peterlcullen","id":16075533,"parent":16052538,"text":"Dispatch | Full-Stack Rails Engineer | Minneapolis, MN | REMOTE OK in the US | <a href=\"https:&#x2F;&#x2F;dispatchwithus.com\" rel=\"nofollow\">https:&#x2F;&#x2F;dispatchwithus.com</a><p>Dispatch is working to redefine same-day local delivery. Whether you need items delivered to a jobsite, don&#x27;t have time to stop at the store, or simply crave donuts from across town, we can get it to you.<p>THE ROLE<p>You’ll be one of the first members of the engineering team and will be influential in the technical direction of the platform as we grow. This is a high responsibility, high autonomy position and you’ll be deploying code to production within the first day or two. You’ll be encouraged to propose features and functionality as the platform continues to mature.<p>We believe that product development is more fun when deploying early and often, splitting up work into bite-sized chunks and getting feedback from real users as quickly as possible. We also believe that a single engineer should be empowered to develop a feature from start to finish, and that the technology stack should be simple enough to make that realistic.<p>WHAT YOU’LL DO<p><pre><code>  * Design and write well-structured, easily maintainable, and thoroughly tested code\n  * Participate in code reviews to ensure quality and consistency in the codebase, and to keep the team aligned\n  * Deploy your projects to production frequently and monitor the results to ensure quality and positive outcome\n  * Accept feedback from customers and adapt solutions with an eye for usability\n  * Work with the rest of the product team to come up with ways to make the product better overall\n</code></pre>\nWHAT YOU&#x27;LL NEED<p><pre><code>  * Experience building and supporting web applications in a full-stack capacity\n  * Proficiency with Ruby on Rails or Javascript&#x2F;React, and with an interest in getting your hands dirty on both backend and frontend\n  * A desire to dig into new technologies and learn as you go\n  * Bonus: React Native, iOS, Android, ElasticSearch, Google Maps APIs\n</code></pre>\nReach out to me at peter.cullen@dispatchwithus.com if you&#x27;re interested!","time":1515113200,"type":"comment"}