{"by":"bitfarmproject","id":16096488,"parent":16052538,"text":"SWISS FINTECH STARTUP HIRING ENTIRE TEAM IN EASTERN EUROPE: BACK-END DEVELOPER<p>Bitfarm is in process of being incorporated in Switzerland. As a Swiss Fintech company we will be serving major banks in Europe with a unique derivatives trading platform software in the investment banking space.\nWe are hiring an entire team of key-developers in Eastern Europe to build the platform. Having found the best talents for the platform, we will be shaping a local team around them. Rewards for bringing in new talents as your team-members will be provided.<p>WHAT WE OFFER:<p>-\tGreen-field development: No legacy systems. Your skillset defines the quality of the core structure of the new code.<p>-\tChallenging project: Building a software for the financial sector, a perfectionist approach on  scalability, stability and security are our key drivers for the platform.<p>-\tFlexible working hours: Develop at the time that you feel most productive. Results and quality counts, not the office clock.<p>-\tCompetitive salaries: Highly competitive base salary. Being a part of our core team on the long run, variable payments subject to the company success could be envisaged.<p>-\tGood team-spirit:. An excellent spirit in our team and fun with our work together has the same priority as the quality of the software being produced.<p>-\tLearning: We provide comprehensive education and development opportunities through an exchange of know-how within our team as well as space to acquire skills in new technologies.<p>SKILLSET WE ARE SEARCHING FOR:<p>-\tExcellent communication and interpersonal skills<p>-\tUniversity degree in software development<p>-\tProven work experience<p>-\tSelf-driving work spirit<p>BACK-END DEVELOPER (JUNIOR)<p>-\tJAVA [required]<p>-\tMongoDB [required]<p>-\tGigaspace [optional]<p>-\tNetwork [optional]<p>-\tWebserver security aspects [optional]<p>--&gt; We are looking forward to receiving your application under hiring@bitfarm.tech","time":1515417676,"type":"comment"}