{"by":"saratateno","id":16115192,"parent":16052538,"text":"Happity | REMOTE (UK-BASED) | FLEXIBLE | Cash and or Equity | Techn Lead | <a href=\"https:&#x2F;&#x2F;www.happity.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.happity.co.uk</a><p>Happity is a family friendly startup with a big mission. We’re looking for a talented lead dev to join us on our journey, helping new parents escape loneliness on the days spent as sole carer for a young child. (NB - I posted this on last month&#x27;s thread stating a modest salary range, but due to the  calibre of candidates we&#x27;re getting I&#x27;m reposting to make it explicit that this is also open to entrepreneurial CTO-types who are more interested in equity).<p>About Us:\n60% of mums go a whole day without adult interaction and a staggering 90% of new mums* admit to feeling lonely. Yet there is a plethora of baby and toddler friendly activities on their doorstep waiting to be discovered. Singing, comedy, dancing - did you know there’s even a bring-your-baby coding class? Happity helps parents to find and book these activities. Fast.<p>We facilitate these transactions and offer an holistic bookings platform for class providers. The beta site launched in a pocket of South East London and rapidly grew to over 5,000 monthly users.<p>We are looking for an experienced developer who&#x27;ll take on ownership over the tech function of the business, building a cutting-edge platform managing real-time bookings with social features.<p>We&#x27;re a startup that fully embraces both the benefits and challenges of remote, flexible working and is passionate about promoting gender equality and parenting rights for dads. We’re open to considering part-time work and discussing compensation based on your circumstances. We have raised pre-seed funding and the backing of Ignite Accelerator.<p>If you&#x27;d like to learn more, feel free to drop me a line: sara [at] happity.co.uk<p>Applications: <a href=\"https:&#x2F;&#x2F;happity.breezy.hr&#x2F;p&#x2F;deed7afde7f201-full-stack-lead-developer-parenttech--flexible-remote--uk-based\" rel=\"nofollow\">https:&#x2F;&#x2F;happity.breezy.hr&#x2F;p&#x2F;deed7afde7f201-full-stack-lead-d...</a><p>I look forward to hearing from you.<p>Current Stack: Rails, Postgres, AWS, Heroku<p>(* this is a problem that affects dads too - there just aren&#x27;t any stats on it yet!)","time":1515595313,"type":"comment"}