{"by":"jobs_crowdynews","id":16150590,"parent":16052538,"text":"Designer &#x2F; UX’er at Crowdynews | fulltime, ONSITE | Groningen, The Netherlands.<p>Do you enjoy working in an innovative, creative and progressive environment? This, and more, is what you can expect from a job at Crowdynews. Crowdynews is a major online publishing player and we value enthusiasm and a sense of humour. Do you have experience as a designer &#x2F; UX’er and would you like to contribute to our team? We’re looking for someone who:\n- Is able to guide a user experience and design decisions\n- Is able to manage the design of an application that meets the needs of a global audience\n- Has experience handling the research and prototyping phase of an application\n- Understands the importance of accessibility and degrading gracefully for customers on older devices\n- Doesn’t do pixel perfect designs, but instead -\n understands how to move from concept to an application that performs well in the fluid environment of the web\n- Enjoys working in an international team\nCrowdynews is an award-winning Dutch technology company founded in 2011. Our company is growing rapidly so you’ll get the chance to fully develop your talents. You will get the opportunity to work in a fun, welcoming and innovative environment. Crowdynews is a company with:\n- A progressive, modern technology stack\n- A dedicated team for AI research and development\n- A friendly, relaxed, open and international atmosphere, conducive to learning without macho nonsense\n- Little bureaucracy and a lot of autonomy\nAn international presence, we have employees all over the globe\nAt Crowdynews you’ll work with your colleagues from AI, the frontend and the backend team to build our new application. You’ll be part of the team that develops our new platform for content personalization and have lots of interesting problems to solve. Besides that you’ll be:\n- The great defender of our customers, guiding us into making decisions that’ll make our product a joy to use\n- The one who has a vision on the user experience and visual language of our application\nWe offer excellent benefits, including a contributory pension plan and plenty of room for personal development. Are you interested in boosting your career at Crowdynews and lots of room to explore a range of professional skills and interests? This is your chance!\nLet us know by sending your CV and motivation to jobs@crowdynews.com.","time":1516025541,"type":"comment"}