{"by":"jobs_crowdynews","id":16150562,"parent":16052538,"text":"Medior Front-end Engineer at Crowdynews | fulltime, ONSITE | Groningen, The Netherlands.<p>Do you enjoy working in an innovative, creative and progressive environment? This, and more, is what you can expect from a job at Crowdynews. Crowdynews is a major online publishing player and we value enthusiasm and a sense of humour. Do you have experience as a front-end engineer and would you like to contribute to our team? We’re looking for a frontend engineer who:\n- Understands writing modern, scalable HTML, CSS and JavaScript\n- Is comfortable working in an international team\n- Keeps up with, or is at least aware of developments in the field\n- Able to write accessible code that degrades gracefully\n- Has experience developing frontend JavaScript applications\n- Has experience with version control (git)\n- Plus: experience with Node.js &#x2F; npm\n- Plus: experience with CI &#x2F; CD based workflow<p>Crowdynews is an award-winning Dutch technology company founded in 2011. Our company is growing rapidly so you’ll get the chance to fully develop your talents. You will get the opportunity to work in a fun, welcoming and innovative environment. Crowdynews is a company with:\n- A progressive, modern technology stack (we were early adopters of Node.js, React and Kubernetes for instance)\n- A dedicated team for AI research and development\n- A friendly, relaxed, open and international atmosphere, conducive to learning without macho nonsense\n- Little bureaucracy and a lot of autonomy\n- An international presence, we have employees all over the globe\nAs a front-end engineer at Crowdynews you’ll work with your colleagues from UX, AI, design and the backend team to decide how to best structure our frontend. You’ll be part of the team that develops our new platform for content personalization and have lots of interesting problems to solve. Besides that you’ll be able to:\n- Test what you made by A&#x2F;B testing\n- Work on both server side and client side rendered frontends\nWe offer excellent benefits, including a contributory pension plan and plenty of room for personal development. Are you interested in boosting your career at Crowdynews and lots of room to explore a range of professional skills and interests? This is your chance!\nAre you the one? Let us know by sending your CV and motivation to jobs@crowdynews.com.","time":1516025326,"type":"comment"}