{"by":"SoftwareMaven","id":16736871,"parent":16735011,"text":"Ksplice @ Oracle | Devops | Remote | <a href=\"https:&#x2F;&#x2F;ksplice.oracle.com\" rel=\"nofollow\">https:&#x2F;&#x2F;ksplice.oracle.com</a><p>Ksplice is the leading technology that allows administrators to patch the critical components of a Linux system on the fly with zero downtime and zero disruption, and we are looking for experienced DevOps and Systems professionals to join our team.<p>As a DevOps engineer, you will be responsible for automating the deployment, monitoring, and day-to-day management of Ksplice&#x27;s infrastructure for building and serving critical security &quot;hot fix&quot; updates for various flavors of the Linux kernel and for user space applications. Our customers depend on us to keep their systems up-to-date and secure, so we would depend on you to make sure our systems stay running and secure.<p>Ksplice has a rich infrastructure that utilizes virtualization heavily, and we are looking for somebody who can help us take that infrastructure and modernize it. While some day-to-day system administration will be required, this is primarily a development role. As such, strong programming skills and an understanding of how to automate system tasks are required. Ksplice primarily uses Python, so experience with that is preferred, but experience with any similar language to perform system administration automation is acceptable.<p>The Oracle Ksplice team is a remote team, so you must be comfortable interacting remotely and working autonomously. We are a small team that expects its members to be comfortable with self-directed work. We\nwon&#x27;t micro-manage you, but, in return, we expect you to learn your job well enough that you know what is important to work on.<p>More information about Ksplice is available at <a href=\"https:&#x2F;&#x2F;ksplice.oracle.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ksplice.oracle.com&#x2F;</a>. You can find more information about the position at <a href=\"https:&#x2F;&#x2F;oracle.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job=18000CMG&amp;lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;oracle.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job=1...</a>. Feel free to contact me directly by email at travis.jensen@oracle.com if you have any further questions. Oracle is an equal opportunity employer.","time":1522690542,"type":"comment"}