{"by":"kevinwuhoo","id":16735258,"parent":16735011,"text":"10x Genomics | Software Engineer | San Francisco &amp; Pleasanton, CA | Onsite, 10xgenomics.com<p>We&#x27;re a biotech company developing novel software, hardware, and biochemical systems to give scientists new methods of discovering the mechanisms behind cancer and immunology. We&#x27;re looking to grow our software team of currently seven engineers (including myself) and three QA engineers to support the rapid adoption of our technology and release of three new novel products this year. Scientists are really excited about our technology as evidenced by the company seeing $71 million in revenue in 2017, which was more than double our revenue in 2016. We&#x27;re working to continue this trend this year.<p>You can find out more about our massively parallel pipelines as well as our visualization software at <a href=\"https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;</a>. We manage our pipelines with Go, develop analysis code using Rust and the NumPy&#x2F;SciPy stack, and drive our front-end applications with React&#x2F;Redux. No previous biological experience is required, but if you&#x27;re interested you&#x27;re more than welcome to learn! You&#x27;ll work with a team who are alums of YC, Google, Facebook, 23andMe, MIT, Harvard, Caltech, and more.<p>We&#x27;re currently hiring for several software roles, but feel free to email me if you think you&#x27;re a good fit for another role.<p>- Senior Software Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-software-engineer...</a><p>- Software Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-engineer&#x2F;</a><p>- Senior UI Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-ui-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-ui-engineer&#x2F;</a><p>- Software QA Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-quality-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-quality-enginee...</a><p>Just a note that we do have an office in San Francisco even though the listings only specify Pleasanton. We also now have company sponsored Lyft rides from the Dublin&#x2F;Pleasanton BART station to our Pleasanton HQ. Feel free to reach out if you&#x27;re interested in working on petabyte scale data problems using modern software practices or even if you just want to chat. You can reach me at kevin.wu@10xgenomics.com or @kevinwuhoo.","time":1522682462,"type":"comment"}