{"by":"thefahim","id":16738039,"parent":16735011,"text":"AdQuick | Venice, CA | Full Time | ONSITE | $80-140k<p>We&#x27;ve raised $3M+, ex-Instacart&#x2F;Amazon, building a marketplace to buy and measure outdoor advertising. We were profitable last year are projected to explode in growth 2018. Looking for talented senior engineers to help keep up with demand. Email me if you&#x27;re interested: fahim@adquick.com<p>About AdQuick<p>* Founded by ex-Instacart engineers&#x2F;marketing \n* Raised $3M led by Initialized Capital (Garry Tan &amp; Alexis Ohanian, Reddit co-founder). \n* Our customers include great brands such as: Kevin Hart, Peloton, FanDuel, Drake, Lyft &amp; more.<p>Technical Stack<p>* Our tech stack is Rails 4, Webpack, React, Postgres, Heroku. \n* Looking for 3+ years experience in running production systems, ability to iterate quickly and sense of ownership. \n* Strong focus on user experience and putting the customer first.<p>Technical Challenges<p>* We have a complex frontend user interface. Users should be able to view 100,000+ markers and transit lines on a map without their browser crawling to a halt. We need to support complex and interesting map visualizations – layering political voting data, Census data, Foursquare data and more.<p>* We&#x27;re a search company. AdQuick conducts a search every time the user pans the map. Searching by geography, demographics, AdQuick score and a myriad of other attributes from disparate data sources is computationally expensive. It will be a challenge to scale while keeping search response times and server costs low.<p>* We&#x27;re a data science company. We integrate with Google Analytics &amp; AdWords and other data sources to measure impact of physical advertising on online behavior (CTR in a region). ROI data from prior campaigns can help create more effective future campaigns. As our data warehouse grows, crunching this data will be increasingly challenging and more powerful. We&#x27;ll use machine learning to create better campaigns overtime.<p>* Our backend systems have to deal with a myriad of inventory CSV, PDF formats, requiring robust and fast file validations, normalization and ingestion systems.<p>* We scraped Instagram and used image recognition to see if people shared photos of billboards. Turns out, a lot of people Instagram&#x27;d Drake&#x27;s board. Innovative ROI tools are a core part of our offering.","time":1522695860,"type":"comment"}