{"by":"mwadams","id":16736298,"parent":16735011,"text":"Endjin| UK | Full-Time, UK | <a href=\"https:&#x2F;&#x2F;endjin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;endjin.com</a><p>Are you interested in working for a company where you learn something new every day? Where you get the chance to engage with industry leaders and Microsoft product teams to solve cutting-edge problems for our clients?<p>Endjin are hiring developers at all levels, from apprentices to seniors, to work on exciting projects with clients from all over the world, in verticals from retail to financial services, utilities and media.<p>Endjin specialises in digital transformation using Azure, Data &amp; AI. We have built 100k+ core Azure grids, and petabyte-scale storage solutions. We&#x27;ve produced machine learning algorithms that find the anomalies in hundreds of millions of device messages, or built bots that help a person sell their watch online.<p>Endjin was incorporated in 2010 by two founders wanting to create a sustainable long-term business with organic growth delivered by deep partnerships with our clients.<p>Since then, we&#x27;ve helped organizations of all sizes, across many industries to transform how they invest, envisage, build, deploy, test, manage, and grow new digital offerings.<p>We also structure innovation programmes, process improvement, and DevSecOps, as well as delivering production-ready code, cloud infrastructure, and thought-leadership content.<p>We value life-long learning and an eye for quality. We will help you to find the best learning techniques, tools, and team-working, so that you can achieve your potential, and deliver the best value to our clients; while balancing your personal goals and home life.<p>Our employees have a mutual respect, regardless of where they are in their career. Ideas are developed by the whole team, from interns to seniors.<p>Equally, our clients pass the &quot;nice to work for&quot; test (and usually do so with flying colours). As part of that, we try to understand the ethical implications of the work we undertake. We seek to do the best we can for each other, for our profession, clients, and for the world at large. With no external investors, endjin has been built as a sustainable, lifelong business: we are a company to retire out of, not exit at the expense of the employees.<p>You can work remotely from anywhere in the UK, with hubs in Cambridge, Reading, Hampshire and London. We hold meet-ups in London on a regular basis. You design your ideal working environment, and we will make it happen together.<p>Apart from a real passion for learning, you know a couple of programming languages pretty well (we do a lot of C# and Typescript, but you may know R, or Python too). You love working with other people, but value the opportunity to spend time in your own head, thinking things through.<p>You can learn more about our projects at <a href=\"https:&#x2F;&#x2F;endjin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;endjin.com</a>, see a video about our career development pathways <a href=\"https:&#x2F;&#x2F;vimeo.com&#x2F;200191869\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;200191869</a> or read our blog <a href=\"https:&#x2F;&#x2F;blogs.endjin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.endjin.com</a><p>Contact us on hello-at-endjin-dot-com if you think this looks like a good opportunity for you.","time":1522687769,"type":"comment"}