{"by":"cr15","id":16735116,"parent":16735011,"text":"TransferWise | Senior backend developer and mid-level fullstack developer | Full-time | London, UK | Onsite | £50k - £70k + stock<p>Typical interview process:\nTechnical test [1.5 hours] -&gt; pre-screening call [30 mins] -&gt; Technical interview [1.5 hours] -&gt; product interview [1 hour] -&gt; Final interview [1 hour]<p>Come and join the product team at TransferWise! Our engineers are product engineers (<a href=\"http:&#x2F;&#x2F;tech.transferwise.com&#x2F;every-engineer-is-a-product-person&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.transferwise.com&#x2F;every-engineer-is-a-product-per...</a>). They work with customers to understand the problems they are having and ideate on solutions to develop prototypes and validate them.<p>We’re currently looking for a senior backend engineer and a mid-level full stack engineer to help us on our mission. Specifically we’re building products that help consumers understand the confusing (and sometimes devious) money transfer market.<p>What we’re interested in as a team: high-quality &amp; testable software, continuous learning, good work&#x2F;life balance, working autonomously as a team.<p>Useful tech experience:<p><pre><code>  -Backend: A solid background working with Java &#x2F; Spring &#x2F; Spring Boot. Understanding and confidence working with a range of persistence and middleware technologies such as (but not exclusively) MySQL, PostgreSQL, Kafka, SQS.\n\n  -Full stack: Comfortable working on a full stack platform that (ideally) includes a strongly typed OO backend language. Frontend experience working with React, Webpack, Angular, Gulp, GraphQL desirable, but core JS skills required.\n\n  -Both roles: A keen eye for (SOLID) design principles, a positive attitude towards testing, maintainability and a iterative mindset is required.\n</code></pre>\nSo come and join a high-growth (100% year on year), high volume (£2bn transferred a month) and mission-driven company.<p>CVs to:  comparison@transferwise.com","time":1522681730,"type":"comment"}