{"by":"brianwawok","id":16738191,"parent":16735011,"text":"Listing Mirror | Lead Developer | South Bend, IN | ONSITE <a href=\"https:&#x2F;&#x2F;www.listingmirror.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.listingmirror.com</a><p>Listing Mirror is a two year old e-commerce startup that helps our customers to “Sell More, Work Less”. We are a small team from northern Indiana proving there is more than corn in Indiana!<p>Our customers each run online stores across multiple channels (Amazon, eBay, Walmart, Shopify, &amp; more). Our platform manages Listings, Inventory, and Orders from a single hub - saving our users massive amount of time and replacing antiquated and cumbersome single use tools with our amazing and ever improving Listing Mirror platform.<p>We are always seeking to move fast and innovate. We all contribute to the direction of the product and the company, and we all make a huge difference in the success of Listing Mirror!<p>We are looking for a lead developer and first technical hire after the technical co-founder. You would work together with the technical co-founder (me) to continue developing the core web platform. You would help set the policies for development, and assist in both selecting and mentoring future technical hires.<p>This position requires innovation! You must be able to come see a problem, discuss it with the team or the customer- design a solution - and implement it! You are not going to be given a ticket from Jira to code, although there is a backlog to mine for ideas. You are not going to have a project manager give you the direction of the project and ask for daily updates - you need to talk with the team and drive the project forward. You are not going to just code a rough draft and pass it off to QA to test - you will write your own automated tests and deploy it to production. We do not have a six month development cycle, we practice continuous delivery and deploy to production many times a day without our customers being disturbed.<p>We run on a Django + Kubernetes platform, but it is not required that you have experience with either. However you SHOULD have experience with web technologies (HTML&#x2F;CSS&#x2F;JS) and at least one modern web framework (Django &#x2F; Rails &#x2F; SpringMVC &#x2F; anything along that route), and modern practices like writing tests and using git.<p>Please send resumes to careers@listingmirror.com for consideration or just to chat more!","time":1522696719,"type":"comment"}