{"by":"jacquelineo","id":16735611,"parent":16735011,"text":"OpenLaw | Brooklyn | Full Stack Developers and Product Manager | REMOTE | <a href=\"https:&#x2F;&#x2F;new.consensys.net&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;new.consensys.net&#x2F;careers&#x2F;</a><p>OpenLaw is a ConsenSys spoke that has built the first “smart” legal agreements. We’re using blockchain technology to reimagine the future of commerce and the $160 billion transactional legal market.<p><a href=\"https:&#x2F;&#x2F;openlaw.io\" rel=\"nofollow\">https:&#x2F;&#x2F;openlaw.io</a><p>About Us:<p>At its core, OpenLaw is a multi-module blockchain-based protocol and markup language to prepare, manage, and execute smart legal agreements. Using the OpenLaw protocol you can seamlessly execute a range of commercial transactions, store digital signatures on a blockchain, and execute smart contracts.<p>We use Scala as our main programming language with JavaScript &#x2F; React for our frontend. Our backend uses LevelDB, and Ethereum to store, search, and verify data. We are product driven and committed to open source. That means our end goal is to the deliver the best and fastest product possible for our users and to do so in a community driven manner.<p>At OpenLaw you must balance passion for the technology while knowing when and how to focus the conversation on our users. At OpenLaw we enjoy an open and inclusive culture, competitive benefits, and the freedom to explore and experiment. We are always iterating and improving our work, the culture, and ourselves.<p>If you are someone that thrives in a fast-paced environment where being self-directed, determined, and resilient are a requirement, we would love for you to join us.<p>ConsenSys&#x27;s team is international, as is OpenLaw&#x27;s. Currently, our team works from the US; South America, Europe, and Asia. Feel free to inquire to see if we can support your location.<p>FULL STACK DEVELOPER (Scala experience a must!) (5 slots available)<p><a href=\"https:&#x2F;&#x2F;new.consensys.net&#x2F;careers&#x2F;?gh_jid=1061221\" rel=\"nofollow\">https:&#x2F;&#x2F;new.consensys.net&#x2F;careers&#x2F;?gh_jid=1061221</a><p>PRODUCT MANAGER (1 slot available)<p><a href=\"https:&#x2F;&#x2F;new.consensys.net&#x2F;careers&#x2F;?gh_jid=1061197\" rel=\"nofollow\">https:&#x2F;&#x2F;new.consensys.net&#x2F;careers&#x2F;?gh_jid=1061197</a><p>Please feel free to send your resume and&#x2F;or cover letter directly to me at jacqueline.outka@consensys.net. Or, if applying through the ConsenSys site linked above, note that HN brought you there.","time":1522684181,"type":"comment"}