{"by":"botswana99","id":16738522,"parent":16735011,"text":"DataKitchen | Boston&#x2F;Cambridge, MA, ONSITE full-time | Data Engineer in Customer Success (SQL, big data, Redshift, Python, AWS, DataOps) -- FOUR OPEN POSITIONS | <a href=\"http:&#x2F;&#x2F;www.datakitchen.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.datakitchen.io&#x2F;</a><p>DataKitchen, Inc. enables analytic teams to deliver value quickly, with high quality, using the tools that they love. DataKitchen provides the world’s first DataOps platform for data-driven enterprises, enabling them to support data analytics that can be quickly and robustly adapted to meet evolving requirements. DataKitchen is leading the DataOps movement to incorporate Agile Software Development, DevOps, and manufacturing based statistical process control into analytics and data management. Our company is profitable, stable, rapidly growing and stock will be part of the package.<p>You should have superior SQL development experience along with the ability to interface with customers (though there will be no significant travel required). This position requires top technical skills, business communication skills, excellent attention to detail and follow-up, and the ability to self-manage. You will get exposure as you work directly with our customers to tackle tough business challenges.\nWe are looking for ‘full stack’ Data Engineers. You should be able to talk to a customer, work with raw data, design a schema, do data transformation, write automated tests, and manage deployment and operations.  Your work will be 80% in code, primarily SQL. Some Python coding experience and experience building Docker containers is a plus. AWS and Amazon Redshift experience is a plus.  You will work with a team of world-class data engineers on challenging data.  We work weekly sprints and have the freedom to achieve and expect to own the results of your work.<p>We offer competitive pay, benefits of a company funded 401 K, experienced team, amazing customers, equity, and a cool office location. Contact jobs@datakitchen.io","time":1522698366,"type":"comment"}