{"by":"cottonseed","id":16739687,"parent":16735011,"text":"Hail @ Broad Institute of MIT and Harvard | Software Engineer &#x2F; Senior &#x2F; Principal | Boston, MA | ONSITE, <a href=\"https:&#x2F;&#x2F;hail.is\" rel=\"nofollow\">https:&#x2F;&#x2F;hail.is</a>, SALARY:$80k-200k<p>The Broad Institute of MIT and Harvard was launched in 2004 to improve human health by using genomics to advance our understanding of the biology and treatment of human disease, and to help lay the groundwork for a new generation of therapies.<p>The Hail team&#x27;s mission is to build tools to enable rapid analysis and exploration of biological datasets (100s of TB and tripling yearly). We are committed to open science and everything we do is open source. We currently develop in Scala, Spark, Python and C&#x2F;C++ but will use any tools we need to get the job done. Come help us build the future of big scientific data analysis.<p>We have multiple positions open:<p>1. We&#x27;re looking for skilled senior&#x2F;principal engineers who have a solid CS&#x2F;engineering background, can quickly write clear, correct code and have experience working on large, complex projects.<p>2. We have an opening for an ML engineer. Solid CS&#x2F;engineering background a must. Experience with modern deep learning frameworks (e.g. TensorFlow) and deep learning models required. Experience with Bayesian methods a plus. Experience with RNAseq data analysis a plus.<p>3. We have an opening for a distributed systems engineer. Help design the architecture that will allow to derive scientific insights from petabyte-scale datasets now and scale 3x&#x2F;year for the foreseeable future.<p>4. We have an opening for an engineer to support the Genome Aggregation Database (gnomAD) project. gnomAD is among the most comprehensive catalogues of human genetic variation in the world, and one of the largest genetic datasets. Analysis results are shared publicly and have had sweeping impact on biomedical research and the clinical diagnosis of genetic disorders. See gnomad.broadinstitute.org.<p>You don&#x27;t need experience in biology or our particular technologies. We work in a highly multi-disciplinary environment (with software engineers, biologists, bioinformaticians, doctors, operations and mathematicians). Self-improvement is a fundamental part of our culture. You must be excited to be challenged and learn new things.<p>I&#x27;m the hiring manager. Get in touch with me directly if you have any questions: cseed@broadinstitute.org.<p>You can learn more about the project here: <a href=\"https:&#x2F;&#x2F;hail.is&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;hail.is&#x2F;</a>","time":1522705576,"type":"comment"}