{"by":"toddmoka","id":16736784,"parent":16735011,"text":"MOKA Analytics | New York City, NY | www.moka.nyc<p>Senior Full Stack Engineer | Full-time | Onsite | Immediate | $100-150K | 0-2% Equity | Benefits<p>Senior Front-End Engineer | Full-time | Onsite | Immediate | $100-150K | 0-2% Equity | Benefits<p>MOKA Analytics builds intelligent strategic planning software for the world&#x27;s largest consumer companies. Our software blends advanced analytics with intuitive user experience to take the process of building a comprehensive strategic plan from months to weeks (or even days). MOKA Analytics was founded 2 years ago by McKinsey and Bridgewater Associates alumni. We maintain a lean, highly-leveraged, and profitable team.<p>If you&#x27;re excited about solving engineering challenges in a business context and shaping the direction of a product, email me with your resume and a short introduction at todd@moka.nyc.<p>Job details:<p><pre><code>  - Shape the architecture and design of our products by working collaboratively with developers, designers, business experts, and customers\n  - Rapidly prototype new features and refine the product experience\n  - Develop data infrastructure and visualizations that seamlessly transition across levels of detail and through time\n  - Opportunity to grow into engineering leadership positions\n  - Competitive compensation and benefits; range depend on your qualification and experience\n  - Stack: React, Redux, ES6, D3, Python, Django, Celery, Numpy\n</code></pre>\nRole details:<p><pre><code>  - 3-5+ years of experience; at least one (1) year delivering customer-facing interfaces\n  - Experience using multiple frameworks that inform your architecture and technology decisions\n  - Experience building maintainable systems supported by modern testing and source code analysis tools\n  - Data science and machine learning experience a plus\n  - Demonstrable track record of strong performance\n  - Self-starter, attention to detail, and ability to work collaboratively</code></pre>","time":1522690092,"type":"comment"}