{"by":"ppadvertising","id":16743965,"parent":16735011,"text":"PulsePoint | Machine Learning Engineer | REMOTE | ONSITE | NYC | Full-time<p>PulsePoint, a programmatic advertising platform with specialized healthcare expertise, fuses the science of programmatic targeting, distribution, and optimization with the art of brand engagement. The PulsePoint platform is powered by terabytes of impression-level data, allowing brands to efficiently engage the right audiences at scale while helping publishers increase yield through actionable insights.<p>The goals of the PulsePoint Data Science team: • Optimize and validate targeting mechanisms for specific health conditions • Improve and optimize our proprietary contextualization, and recommendation engines that handle hundreds of thousands of transactions per second, billions of times each month • Collaborate with internal Health experts to ideate and support rapid assessment, analysis, and prototyping of ideas for achievable commercialization.<p>What you will be tasked to do: • Research and develop user profiling models to enhance our clinical trial recommendation engine to leverage both online and offline data.\n• Collaborate with Product teams on data-driven products to support clinical trial platform design and delivery.\n• Support and enhance the existing work on health user profiling, prediction, and targeting tools.\n• Contribute on future project on patient&#x2F;physician identity for cross-device tracking, profiling and targeting.\n• Support existing codebases for data integration and production support for our core models.<p>Requirements\n• 3+ years of full-time experience working as a Statistician&#x2F; Machine Learning Engineer&#x2F; Data Scientist\n• Knowledge of Big Data technologies such as Hadoop, Hive, and Impala\n• Knowledge of Python using the numpy&#x2F;scipy&#x2F;pandas&#x2F;skilearn stack\n• MS&#x2F;PhD in something relevant or BS with several years of applied machine learning experience\n• A GitHub link with code samples<p>We have a couple of similar Data Science positions open: some more with a research focus, others with an engineering focus. If your experience leans more to one side than the other, do get in touch!<p>We have great benefits like sane working hours, great salaries, 401k match, lunches, snacks, excellent teammates, etc. Contact me (jmena@pulsepoint.com, I’m a happy software engineer here) with your resume and a Github link and I’ll make sure you get your application expedited.<p>We’re also hiring Data Engineers and Java Software Engineers!","time":1522758549,"type":"comment"}