{"by":"andrewdavey","id":16742982,"parent":16735011,"text":"Insight Tracking | Junior or Senior Full-stack .NET Web Developer | Hayle, Cornwall, UK | Full time | £30,000—£40,000<p>We&#x27;re small, fully bootstrapped, software as a service company. Our main product is an assessment tracking web app for primary schools. We currently have over 360 schools nationally and are growing rapidly.<p>Our customers love the system and send us great feedback! <a href=\"https:&#x2F;&#x2F;www.insighttracking.com&#x2F;testimonials\" rel=\"nofollow\">https:&#x2F;&#x2F;www.insighttracking.com&#x2F;testimonials</a><p>We&#x27;re a four-person team, focused on delivering excellent customer support. You&#x27;d be working closely with our main developer, as well as the customer support team. There are plenty of new features to build and existing things to improve.<p>From a tech point of view, the server-side runs on a mixture of ASP.NET MVC and Web API, which talk to RavenDB and SQL Server. The front-end has a legacy Angular UI, but newer screens are built using React.<p>We&#x27;re not bogged down by bureaucracy and meetings. We aim to keep the process lightweight, with a focus on rapidly delivering great software.<p>Being based in the seaside town of Hayle means we&#x27;re close to the beach and the countryside. It&#x27;s a chilled out town, with good connections to other parts of Cornwall. Remote work is also a possibility, however being UK-based would be preferred.<p>Skills we need:\nExperience with C# and .NET, especially ASP.NET;\nExperience with HTML, CSS and JavaScript;\nBasic knowledge of SQL Server;\nBasic knowledge of Git<p>Perks:\nYour choice of computer hardware;\nSit&#x2F;stand desk and ergonomic chair;\nFull-time here is just 30 hours a week (flexi-time);\nIn addition to the usual 28 days holiday plus bank holidays, take unlimited unpaid leave during school summer holidays;\nRegular team outings (recently we&#x27;ve completed an Escape; Room, played Skittles, learned to make Easter Eggs and spent the day in VR);\nWork-place pension, with up to 15% matched contributions;\nFree snacks, coffee, etc;\nClose to the beach!<p>Email andrew@insighttracking.com","time":1522746298,"type":"comment"}