{"by":"solresol","id":16741837,"parent":16735011,"text":"Daisee (www.daisee.com) | Software Engineer, Devops, Data Scientists | Sydney, Australia or Melbourne, Australia | Full-time, ONSITE, no visa but vague chance of REMOTE for someone brilliant<p>Daisee makes NLP and computer vision products.<p>We make software for call centre operators to transcribe calls, and then do various kinds of analysis on the call text (e.g. whether the caller was expecting a call back, general sentiment of the call, predictors of a successful or unsuccessful call). We also help call centres offload voice volume on to chat. We also do predictive modelling for demand (not just in call centres: retail as well).<p>We also have various medical and architectural computer vision products, and some software engineering support products.<p>We are a well-funded startup with a long runway to support our current 20+ staff. We&#x27;re making large $$$$ sales into enterprises most weeks. We have mature management (two ex-googlers are on the management team, including the former Australian general manager; the rest of the executive team have held senior roles across the banks, successful startups and a variety of other major corporations). You get the stability and mature culture of a large corporate job, but the interesting work and dynamic environment of a startup.<p>We have a team of data scientists already; I&#x27;m looking to hire one more, preferably with skills in computer vision.<p>I am looking to hire around 4-6 software developers to take on various projects. Back-end software development is mostly in Haskell, with some legacy Python. Front-end is the usual Javascript&#x2F;CSS&#x2F;HTML.<p>What I would like from a software developer is a lot of experience of working with data scientists and&#x2F;or some machine learning skills yourself. Having taken projects through to production and supporting them there is also valuable.<p>Any skills around Genesys or IPscape (or other call centre systems) will get you straight to the top of the resume pile. JIRA or Salesforce plug-in development  will also be appreciated. Medical imaging knowledge will be very highly valued as well.<p><a href=\"https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;2A144554F9\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;2A144554F9</a> or contact recruitment@daisee.com and mention that you saw this post on HN.","time":1522728319,"type":"comment"}