{"by":"Teryn_Roberts","dead":true,"id":16740277,"kids":[16748524],"parent":16735011,"text":"Passport Inc. | Software Engineer Team Lead | Charlotte, NC | Onsite | Full-time \nAs a Software Engineer Team Lead at Passport, you will be at the center of our efforts to build and manage our SaaS Back Office Web Portal application for both internal and external clients. You will collaborate with our Product team, while leading a Development team to build the next generation of our dashboard and reporting tool that supports multiple solutions (transit, parking, citations, and permits) that facilitate our clients’ business operations. In doing so, you will identify, design for, and solve technical challenges that arise from scaling our business at a fast pace.<p>Responsibilities: Leading, inspiring, and mentoring a team of developers to build, deliver, and continuously improve upon the dashboard and reporting tool, coaching and developing your team to successfully keep up with the changing business environment, provide technical and market guidance, and deliver a tool that continues to improve our clients’ operations; you will manage work for the team and perform some of the detailed technical work yourself, solving complex client challenges by using demonstrated proficiency in software development, tools, processes and procedures; selecting the proper solution architecture (language,Database, networking etc…) to accomplish the desired end, digging in on the details of technical and data challenges, and building solutions, communicating and working effectively with multidimensional and cross-functional teams to create a dynamic and complementary force within Passport, its partners and customers, collaborating with a variety of client profiles beyond technical staff (i.e. marketing, sales, production, quality control, security, operations, etc…) to integrate the desired solution, using experience to offer and implement creative and unique solutions; making connections between previously successful models to the current technical solution, setting and resetting priorities for self, team, and then influencing the priorities for the integrated solution so that the best outcome is achieved, handling tasks of high-complexity and contributing in all phases of customer sales contact, through installation and support.","time":1522710486,"type":"comment"}