{"by":"pastelsky","id":16741936,"kids":[16742014],"parent":16735011,"text":"Urban Ladder | E-Commerce | Multiple Engineering Positions | Onsite | Bangalore, India | Full Time<p>Urban Ladder is a tech-powered furniture retailer in India.<p>After leading online furniture retailing, we are now rapidly expanding to offline retail as well.<p>Positions:<p>* Front-end Engineers (midlevel) — React, ES6&#x2F;7&#x2F;8, Core JS, CSS3, HTML5<p>(<a href=\"http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-frontend\" rel=\"nofollow\">http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-frontend</a>)<p>* DevOps Engineers — AWS, CI&#x2F;CD, HTTP&#x2F;2, Docker, K8s<p>(<a href=\"http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-devops\" rel=\"nofollow\">http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-devops</a>)<p>* Backend Engineers — Ruby (RoR, Grape), Go, Java, Microservices<p>(<a href=\"http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-backend\" rel=\"nofollow\">http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-backend</a>)<p>* iOS Engineers — Swift, React Native, Unity<p>(<a href=\"http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-ios\" rel=\"nofollow\">http:&#x2F;&#x2F;tiny.cc&#x2F;ul-jobs-ios</a>)<p>To have a glimpse of things we are up to, look under the hood of our mobile website (<a href=\"https:&#x2F;&#x2F;www.urbanladder.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.urbanladder.com</a>). We are in process of transforming experiences across our web properties (including desktop website) and that makes it an excellent time to join!<p>We are looking for programmers with high regards to clean, performant, and secure code. In recent times, our team has invested a lot in shipping code which adheres to the style guides and stringent code review process the team has put in place. We need skilled developers who can leverage, or better evolve, this ecosystem to deliver features in a fast-paced environment.<p>We are a lean and nimble team of engineers and believe in working with right tools to deliver our best. We have an excellent professional learning environment for people who want to grow at an accelerated pace. We encourage open source contributions from team members and are open to open sourcing things we build.<p>Email at meenaxi.math@urbanladder.com with your resume (preferred) or apply directly at the links above.","time":1522730040,"type":"comment"}