{"by":"catskul2","id":16741289,"parent":16735011,"text":"Carnegie Robotics LLC | Pittsburgh, PA | Software Engineer, Software Associate | Full-Time | C++ | onsite\nCarnegie Robotics is seeking creative, energetic and driven Software Engineers with strong hands-on development skills to work on a variety of interesting and challenging robotics perception and control projects. This position provides the opportunity to join a team of talented veterans in the robotics field and program advanced sensors and autonomous robots from the ground up. The ideal applicant for this position has brains, creativity, and strong experience developing and testing software for robotics and&#x2F;or sensing applications. We seek candidates who take pride in building solid, rigorously tested systems. Experience and interest in production-level coding and testing methods is a plus for this position.<p>Carnegie Robotics offers a very competitive benefits package. Due to the nature of some of our work, US Citizenship or Permanent Residency is preferred.<p>We seek entry-level, experienced and Senior Software Engineer candidates with:<p>* Strong C and C++ development skills.<p>* Excellent software engineering habits.<p>* Familiarity with development in Linux-based environments.<p>* Experience with version control systems such as Git and Mercurial.<p>* Working knowledge of software debugging and profiling tools.<p>* Solid background in data structures and algorithms.<p>Ideal candidates will have seen robotics and sensing challenges before and have:<p>* Experience with complex robotic applications including perception and planning;<p>* Experience with embedded systems and real-time operating systems; and<p>* Strong math skills and familiarity with linear algebra.<p>Please apply via the following link:<p><a href=\"http:&#x2F;&#x2F;carnegierobotics.applytojob.com&#x2F;apply&#x2F;job_20161219181748_IXHKKTZQCBYIDJZI&#x2F;Software-Engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;carnegierobotics.applytojob.com&#x2F;apply&#x2F;job_20161219181...</a>","time":1522720660,"type":"comment"}