{"by":"mtweak","id":16741388,"kids":[16749098],"parent":16735011,"text":"Bitfusion | Senior Networked Systems Engineer | Austin, TX | Remote OK | bitfusion.io<p>We are looking for an extremely talented systems programmer with excellent C&#x2F;C++ skills, deep algorithms and data structures knowledge, and strong familiarity with Linux operating system internals and driver development.  The ideal candidate has at least some experience with networking internals, protocols, and distributed systems.<p>You should have a BS, MS, or PhD in Computer Science, Computer Engineering or equivalent. Strong communication skills are essential. Strong problem solving skills and out of the box thinking are a must. Experience with Linux Kernel development (esp. network subsystem), DPDK (or other zero copy networking approaches), and distributed systems is highly desired. Must work well in a fast paced team of talented, motivated, and coworkers. Working closely without our core engineering team in Austin, TX is highly preferred, though remote work may be possible depending on qualifications.<p>Must Haves\n* Excellent understanding of algorithms and data structures theory with practical application\n* Good experience in C&#x2F;C++, multi-threaded software development, distributed systems\n* Strong understanding of optimization, memory management, concurrency and multithreading\n* Experience with development on Linux and related tools: gcc, gdb, git\n* Should be able to pick up any new programming language quickly<p>Nice to Haves\n* Experience with CUDA or OpenCL programming\n* Experience working on LLVM\n* Familiarity with one or more performance profilers such as: VTune, XPerf, gprof, etc.\n* Knowledge of GPU and CPU architectures\n* Knowledge of at least one scripting language (Python, Perl, Ruby, Shell scripting)\n* Experience with software performance analysis, optimization and low-level programming<p>Relocation is available, remote positions available depending on level of experience.<p>We are an equal opportunity employer.","time":1522722040,"type":"comment"}