{"by":"DLinDeepSoma","id":16747756,"parent":16735011,"text":"OSARO INC | San Francisco | Full time | Onsite | Robot Control Software Engineer | Robot Motion Planning Engineer | Deep Learning Engineer | Reinforcement Learning Engineer | Senior Software Engineer | Software Engineer<p>At Osaro, we&#x27;re creating machine intelligence software that combines state-of-the-art perception with powerful adaptive decision-making abilities to help computer and robotic systems act efficiently and intelligently. You would collaborate with existing team members with expertise spanning reinforcement learning, computer vision, hardware architecture, robotics and more. Osaro is developing large-scale machine learning products that need to interface with customers’ complex software environments as well as interface with a variety of robotic hardware and sensors.<p>- Robot Motion Planning Engineer: We are searching for a full-time control systems engineer to research and implement motion planning systems for high-performance planning on industrial robots. The ideal candidate would have a graduate degree in robotics or a related field and extensive experience implementing and optimizing motion planning systems in both simulated and real-world robotics systems. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=969906\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=969906</a><p>- Robot Control Software Engineer: We are searching for a full-time control systems engineer to develop and maintain high-performance control interfaces to a suite of industrial robots. You will be responsible for development, maintenance, and optimization of the interfaces between Osaro’s abstract controller libraries and the low-level control systems of all our supported robot platforms. The ideal candidate would have a graduate degree in robotics or a related field and extensive experience implementing and optimizing control systems for real-world robotic systems.  <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=969996\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=969996</a><p>- Deep Learning Engineer: Seeking world-class deep learning engineers with broad background in machine learning. As a deep learning engineer, you are involved in all stages of algorithm development from inception and initial implementation to evaluation and all the way to a deployable production quality algorithm. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490809\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490809</a><p>- Reinforcement Learning Engineer: As an RL engineer you will be uniquely positioned in our team to work on large-scale machine intelligence problems and push forward the frontiers of AI technologies. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490848\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490848</a><p>- Senior Software Engineer: We are searching for a full-time software engineer to develop and maintain high-performance control interfaces to a suite of industrial robots and sensors that enable modern machine learning based robotics applications. You will be responsible for development, maintenance, and optimization of the interfaces between Osaro’s control and sensing algorithms and the lower level controls of our robot platforms. <a href=\"https:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=1081784\" rel=\"nofollow\">https:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=1081784</a><p>- Software Engineer: We are searching for a full-time software engineer to develop and maintain high-performance control interfaces to a suite of industrial robots and sensors that enable modern machine learning based robotics applications. You will be responsible for development, maintenance, and optimization of the interfaces between Osaro’s control and sensing algorithms and the lower level controls of our robot platforms. <a href=\"https:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=1104793\" rel=\"nofollow\">https:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=1104793</a><p><a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490453\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490453</a> Please apply directly on our website. Thanks! <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;</a>","time":1522780770,"type":"comment"}