{"by":"lzucchetti","id":16760507,"parent":16735011,"text":"Senior UX Designer opportunity  | Airteam | Sydney, Australia | Onsite | Full time permanent | No visa sponsorship available | Competitive salary<p>=== How this role fits into our team ===<p>Our UX Designers work through all stages of our design process to create usable and engaging digital products and services. You anticipate and plan activities to achieve desired project outcomes and goals. You use interaction design methods and bring together user needs, business objectives and tech considerations to arrive at a valuable experience and feasible solutions. You enjoy facilitating workshops and running user-centered activities to understand users, identify measures of success and explore and test ideas. You are comfortable navigating ambiguity and bring a practical approach to solving problems. You bring the team on a journey and create a shared vision of what’s being designed. You document UX insights and designs through reports, sketches, user flows, sitemaps, wireframes, interactive prototypes and confidently present and share with developers, visual designers and clients.<p>Job ad: <a href=\"https:&#x2F;&#x2F;airteam.com.au&#x2F;senior-ux-designer\" rel=\"nofollow\">https:&#x2F;&#x2F;airteam.com.au&#x2F;senior-ux-designer</a><p>=== How to apply ===<p>We prefer applications come directly to us so you can introduce yourself and tell us about why you think this is the role for you. You can apply by emailing your resume and personal introduction to Laura, our Head of Crew and Culture - laura [at] airteam.com.au.<p>Our hiring process is simple: introduce yourself, if we see there&#x27;s a skills and experience match we&#x27;ll have a chat and get to know each other. If we both like what we are hearing, there will be a behavioral interview before making an offer to join us.<p>=== About Airteam ===<p>We’re a design and tech studio in Sydney, Australia, building digital products, native apps, web apps and websites. We’re a passionate group of experienced professionals, with a desire to realise positive outcomes and bring meaningful ideas into the world. We have a smart and diverse team that includes, Researchers, UX&#x2F;UI Designers, Business Analysts, Full Stack Developers, Technical Leads and Scrum Masters.","time":1522886457,"type":"comment"}