{"by":"kcrossncc","id":16766111,"parent":16735011,"text":"NCC Group (formerly Matasano Security, iSEC Partners, and Intrepidus Group) - Atlanta, Austin, Boston, Chicago, Houston, New York, San Francisco, Seattle, and Sunnyvale, CA<p>It&#x27;s the time of year when we welcome back the sun, the cherry blossoms, and crippling seasonal allergies. 2 of out 3 ain&#x27;t bad. Searching for a job that goes 3 for 3? Consider NCC. Cutting-edge research, continuous learning &amp; training, and contributing on interesting client engagements. The elusive triple threat.<p>NCC Group is currently looking for passionate security minds to join our merry crew! We are looking for great people to join our pentesting, DFIR, and Risk Management &amp; Governance teams!<p>What do we do exactly? Penetration testing, security analysis, DFIR, and cutting-edge research into current technologies and attacks (breaking things). You spend most of your day thinking about security systems and how they can break. You get to be creative and have a lot of freedom to be clever while learning new technologies at a very fast pace. Engagements are usually 2-4 weeks long and in a year you will be exposed to 15-20 products and technology stacks. Your work will typically initiate person-months of security improvements in products millions of people use. You will have access to senior engineers&#x2F;architects and your findings&#x2F;ideas will be heard by senior decision makers. You will have enormous impact in making the software and products people use safer!<p>All of our consultants are also security researchers, with dedicated research time. Not too shabby!<p>We are looking to add new colleagues in all of our office locations. Specifically, we&#x27;re urgently looking to add folks in the following service offerings:<p>* Houston! We&#x27;re eagerly looking for junior and senior pentesters in the Houston market to help protect our growing client base locally. \n* Experienced, seasoned pentesters in all of our office locations (and remote, if willing to travel)\n* Great DFIR minds in the Bay Area, NYC, or Austin (or remote, if willing to travel)\n* Additions to our Risk Management &amp; Governance team all over the country\n* Junior pentesting additions to our team in every office location<p>If you want to learn more about us and our open positions check out our:<p>Blog (<a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;newsroom-and-events&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;newsroom-and-events&#x2F;b...</a>)<p>Cryptopals (<a href=\"http:&#x2F;&#x2F;cryptopals.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com&#x2F;</a>)<p>Microcorruption (<a href=\"https:&#x2F;&#x2F;microcorruption.com&#x2F;login\" rel=\"nofollow\">https:&#x2F;&#x2F;microcorruption.com&#x2F;login</a>)<p>If you&#x27;re ready to apply, contact us at <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;careers&#x2F;current-vacancies&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;careers&#x2F;current-vacan...</a> or reach out directly at na-cv@nccgroup.trust.<p>We&#x27;d love to hear from you! Have a good day!","time":1522944108,"type":"comment"}