{"by":"sara_komoot","id":16828160,"parent":16735011,"text":"Komoot | Backend Engineer (Algorithms, Rankings and Recommendations) | Full-Time | REMOTE<p>Millions of people experience real-life adventures with our apps. We help users all over the world discover the best hiking and biking routes, working to empower everybody to explore more of the great outdoors. And we’re good at what we do: Google and Apple have listed us as one of their Apps of the Year numerous times—and we are consistently ranked amongst the highest-grossing apps in both Google Play and the App Store. One key driving factor to our growth has always been our understanding that a technological approach can provide an outdoor experience far beyond the possibilities of traditional services. On the one side, we collect, combine and process various open data sources (such as OSM and Wikipedia) and turn raw data into easily accessible information and understandable products, such as our easy-to-use outdoor route planner. On the other, we leverage the wisdom of our vast user base and use crowdsourced data for personalized, local outdoor recommendations. Now, with your strong analytical skills and your passion for building well-crafted and tested code, we’ll leave traditional, standard solutions even further behind—and we’ll truly change the way people explore.<p>Your key responsibilities<p>-Implement new features closely together with our web and mobile developers, designers, copywriters and product managers.<p>-Develop and tune algorithms to leverage our content recommendation, rankings, content analyses and product smartness.<p>-Build new and improve existing micro-services, primarily in Java&#x2F;Kotlin and Python.<p>-Use the AWS ecosystem to build resilient and high-performing systems.<p>More information and application available at: <a href=\"https:&#x2F;&#x2F;www.komoot.com&#x2F;jobs&#x2F;backend-engineer-recommendations\" rel=\"nofollow\">https:&#x2F;&#x2F;www.komoot.com&#x2F;jobs&#x2F;backend-engineer-recommendations</a>","time":1523609941,"type":"comment"}