{"by":"anpat","id":18116052,"parent":18113144,"text":"Citrine | Redwood City, CA; Pittsburgh, PA | Backend, Frontend, Infrastructure, and Scientific Software Engineers | ONSITE or REMOTE | Full-time | <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;</a> |<p>Citrine Informatics is building the next-generation materials development platform from the ground up, using the power of domain expertise, data, and machine learning to bring new materials to market faster, and capture materials-enabled product value.<p>As we scale, there are opportunities across our whole product&#x2F;stack for people to join, learn and contribute; not only to the success of the company but also to solve real world, pertinent problems.<p>We are a team with diverse backgrounds and experiences; trained in materials science, data science, physics, biology, as well as computer science. The org is remote friendly, especially engineering where a bunch of us are remote FT (Seattle, Salt Lake City, Ann Arbor, FL to name a few). You can work out of our offices in Bay area (Redwood City), Pittsburgh, or remote, choice is yours.<p>Positions:<p>Sr.&#x2F; SSE : <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#scientific-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#scientific-software-engineer</a><p>Sr.&#x2F; BE : <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#senior-backend-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#senior-backend-software-engineer</a><p>Sr.&#x2F; Infra : <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#infrastructure-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#infrastructure-engineer</a><p>Sr.&#x2F; Full Stack Engineer: <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#senior-full-stack-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;#senior-full-stack-software-engin...</a><p>Link to general job page: <a href=\"https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;citrine.io&#x2F;careers&#x2F;</a><p>Some buzzwords to give an idea of what we are working with but if you have experience of building and delivering quality product and take pride in enabling your users and team members, feel free to reach out even if you don’t tick everything below.<p>Backend: Java&#x2F;Scala, Ruby (RoR), Python<p>DS: Scala, Python<p>Frontend: Angular, React<p>DataStores: PostgreSQL, ElasticSearch<p>Cloud: AWS<p>Tooling: Jenkins, JUnit, Maven, SBT, etc.<p>Our customers include some of the world’s largest Fortune 1000 materials and product companies. Citrine is backed by leading investors including Tencent Holdings, B&amp;C Holdings, Innovation Endeavors, DCVC (Data Collective), Prelude Ventures, AME Cloud, XSeed Capital, Morado Ventures, and Ulu Ventures.<p>Please reach out to Julianna (jchilds AT citrine DOT io) if you have any questions. Also, feel free to asks questions to me here&#x2F; apatel AT citrine DOT io (engineer on backend team).","time":1538422672,"type":"comment"}