{"by":"Mochalskyy","id":18114207,"parent":18113144,"text":"TuneIn | Various types of software engineer positions | San Francisco, CA and Los Angeles, CA | Full-time, ONSITE or Remote, <a href=\"http:&#x2F;&#x2F;tunein.com\" rel=\"nofollow\">http:&#x2F;&#x2F;tunein.com</a>\nSan Francisco, CA - close to Caltrain, across the street from AT&amp;T Park Los Angeles, CA - Venice Beach, 2 blocks from Venice Beach Boardwalk<p>Onsite preferred though we&#x27;ve hired remote folks before. Visa transfers ok and we support new green cards. New visas only if straightforward.<p><a href=\"http:&#x2F;&#x2F;tunein.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tunein.com&#x2F;careers&#x2F;</a><p>TuneIn’s mission is to deliver the world’s best listening experiences. We achieve this by being the most popular way to listen to streaming audio from around the world with more than 70 million monthly active users. Our free service combines over 100,000 free radio stations and more than 5.7 million on-demand programs stemming from every continent, so our users can listen to the world’s sports, music, news and talk from wherever they are. TuneIn Premium encompasses all of that as well as exclusive content, streaming sports from every major league in the US (NFL, MLB, NBA, NHL...), TuneIn Owned and Operated stations including curated content and over 600 commercial-free music stations. Our users use iOS, Android, Web, and dozens of connected platforms.<p>Our stacks are built on Golang, C#&#x2F;.NET, React.js, es6, Swift, MSSQL, MySQL, HBase, Redis, DynamoDB, AWS, AWS Lambda, Docker, and a few more things. We believe in using the right tool for the job.<p>We value being a top-notch engineering organization and have the same high standards with our code and our people. We hire well-rounded, fully-formed, communicative people whom we can envision being friends with and trusting. We make time for quality, are agile and pragmatic, strive to keep it simple, are data-driven, and love getting better. Our projects tend to be 1-2 engineers, so trust and accountability are required for us to work - and helps us keep processes &amp; overhead to a minimum. We&#x27;ve built a robust team and are always striving to be the best place to work we can be.<p>Check out our projects and principles on Github here: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;tunein&#x2F;engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;tunein&#x2F;engineering&#x2F;</a>","time":1538411360,"type":"comment"}