{"by":"ewa","id":18113939,"parent":18113144,"text":"Intercom | Dublin, Ireland or London, UK Full Time | ONSITE | SaaS | <a href=\"https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;</a><p>- SENIOR SOFTWARE ENGINEER <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;df1addcd1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;df1addcd1</a><p>- SYSTEMS ENGINEER (DEVOPS) <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;8bfba8f41\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;8bfba8f41</a><p>- SENIOR RUBY ON RAILS ENGINEER <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;f41039ce1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;f41039ce1</a><p>Intercom ships fast and we&#x27;re looking for a key Ruby on Rails productivity enabler for all Engineering teams. We&#x27;re also hiring engineers to work on our product teams, building the core features of Intercom. You could be working on message delivery rules and composer, our app framework or our database models and user storage, to name a few.<p>ABOUT US: We&#x27;re a $1.3+ billion company, nearly 600 people and over 25k+ customers including Microsoft, Spotify, Stripe, Airbnb, Hootsuite, Yahoo, and over 500M monthly conversations sent on our platform reaching over a billion people worldwide.<p>BENEFITS: Relocation, work permit, competitive salary, meaningful equity, free food, health insurance, life assurance, open vacation policy, public transport and gym covered.<p>Hiring process consists of tech test, phone interview and an onsite interview with technical and culture sessions.<p>TECH: The core Intercom product is a Ruby on Rails application with an Ember.js frontend. We use MySQL, MongoDB and Amazon’s DynamoDB for most of our storage. Our web messenger is built on React. We have API and integration clients for Ruby &#x2F; Rails, Java, PHP, Node, Go, and .NET. We like to buy the best tools and services where available but will build our own when we need to—we use an in-house continuous deployment service and built our own lightweight project management tooling.<p>Get in touch at ewa@intercom.com","time":1538409843,"type":"comment"}