{"by":"karim","id":18114486,"parent":18113144,"text":"Nylas – San Francisco, NYC or remote | Site Reliability Engineer | AWS, Ansible, Terraform | Full-time<p>The Nylas Cloud APIs (<a href=\"https:&#x2F;&#x2F;nylas.com\" rel=\"nofollow\">https:&#x2F;&#x2F;nylas.com</a>) makes it an order of magnitude easier for companies to add email, calendar, and contacts integrations to their applications. By being at the core of business communication, scheduling, and contacts, we believe we can shape the future of how people work.<p>We’re looking for Site Reliability Engineers to join our team to help build and scale the infrastructure our platform runs on and the tools our developers need to get work done. Our SRE team is responsible for the infrastructure layer of our API platform—the base operating system (including security), CI&#x2F;CD &amp; deployment tools, monitoring and observability tools, and our horizontally sharded data storage layer which stores tens of terabytes of data.<p>At Nylas, “DevOps” is a part of our engineering culture, not a role we’re looking to fill. Our development team shares the pager with operations and makes their own deploys.<p>Our stack: Python, MySQL, Redis, AWS, Debian<p>About you:<p>- You have 3 - 5 years of production engineering experience<p>- You are located anywhere in US timezones - we have offices in San Francisco and NYC and this team contains remote members<p>- You value communication and empathy as much as technical prowess<p>- You have experience automating systems using any modern configuration management system (Chef, Ansible, Puppet)<p>- You have experience running services on a cloud platform (AWS, GCP, Azure)<p>- You can write reliable code in at least one scripting language (Python, Ruby, Perl, JavaScript etc.), though this won’t be a focus of our interview process<p>- You’re excited to create a modern, scalable infrastructure and automate away drudgery<p>We wrote about our values, benefits, perks, and published them in our open-source handbook (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;handbook\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nylas&#x2F;handbook</a>). You can also find more details at: <a href=\"https:&#x2F;&#x2F;www.keyvalues.com&#x2F;nylas\" rel=\"nofollow\">https:&#x2F;&#x2F;www.keyvalues.com&#x2F;nylas</a><p>If you&#x27;re interested in applying, please send me an email at karim@nylas.com!","time":1538413066,"type":"comment"}