{"by":"jonahbailey","id":18115024,"parent":18113144,"text":"\tAtomic Object | Software Consultancy | Ann Arbor, MI | Onsite&#x2F;Fulltime<p><a href=\"https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-job\" rel=\"nofollow\">https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-j...</a><p>--- Work with smart, passionate people. Make cool stuff. Learn every day. ---<p>Atomic is growing a diverse and inclusive team of curious, creative people who love creating great software for our clients.<p>THE POSITION\n\tAtomic Object is a consultancy that creates custom software products. We work across web, mobile, desktop, and embedded product development—helping our clients innovate and grow by doing what they do better.<p>Atomic makers work on self-managed teams of 2-10 designers, developers, and testers—collaborating to create products for our clients, from the idea phase through launch and beyond.<p>WHY ATOMIC?\n\tAtomic is a great place to do awesome work. As an Atom, you&#x27;ll: Join a tight-knit group of makers working in an atmosphere of friendship, exploration, and respect.<p>Work on a variety of projects and help make pipelines safer, cities greener, healthcare smarter, and old products new again. Be part of a transparent, employee-owned company that&#x27;s active in making the software community stronger, smarter, and more diverse.<p>Receive great benefits, including support for professional development, schedule flexibility, employee ownership, 401(k) contributions, and generous vacation time.<p>INTERESTED?\n\tIf you&#x27;d like to find out more about Atomic or this position, don&#x27;t hesitate to check out our current open position:\n\tSenior Software Developer &amp; Consultant: <a href=\"https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-job\" rel=\"nofollow\">https:&#x2F;&#x2F;atomicobject.com&#x2F;careers&#x2F;senior-software-developer-j...</a>","time":1538416205,"type":"comment"}