{"by":"mattlong","id":18115749,"kids":[18117414],"parent":18113144,"text":"Lots of YC companies | Software engineers of all kinds | Many places, though mostly in the US | Mostly on-site, but some remote | Full-time and intern<p>Earlier this year, a team of us at Y Combinator started a &quot;common app&quot;, so that people could apply to work all Y Combinator companies at once. It seemed silly to us that even though so many companies are struggling to hire people, it still requires O(n) effort to apply to n companies.<p>So, we built <a href=\"https:&#x2F;&#x2F;workatastartup.com\" rel=\"nofollow\">https:&#x2F;&#x2F;workatastartup.com</a>. It&#x27;s a simple way to apply to all YC companies at the same time. Right now it&#x27;s only for software engineers &amp; data scientists for now (we hope to open it more broadly later). If a company is interested, you&#x27;ll get an email from them.  There is also a directory where you can browse the jobs of some of the companies that are actively hiring through the site and apply directly (not all companies have finished their director profile yet).<p>It seems to be working pretty well so far - many of the people who posted a profile have gotten more than a dozen company founders reaching out to them, and people have gotten jobs through it. You&#x27;re most likely to have good results if you&#x27;re looking for a full-time role in the US since that&#x27;s where most YC companies are based.<p>We recently hosted an in-person career fair where the founders of ~40 YC companies from a variety of fields and of various sizes gave short presentations and then mingled with attendees. [0, 1]<p>We&#x27;d love if you filled out a profile and let us know what you think (workatastartup@ycombinator.com) : <a href=\"https:&#x2F;&#x2F;www.workatastartup.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workatastartup.com</a><p>[0] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17367707\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=17367707</a>\n[1] <a href=\"https:&#x2F;&#x2F;www.workatastartup.com&#x2F;expo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workatastartup.com&#x2F;expo</a>","time":1538420638,"type":"comment"}