{"by":"tarikozket","id":18118523,"parent":18113144,"text":"Bain &amp; Company, Development Lab | Engineering Team Lead | San Francisco, CA | Onsite, Full Time<p>As our clients navigate the migration to a digital economy, the Bain Development Lab provides application prototyping and development to help deliver real, actionable results to supplement our consulting work. That means we build apps. A lot of apps. Which means we need to reinvent as few wheels as possible and get the most out of our own work and the broader development community.<p>Responsibilities\n- Be part of the global team that determines our technology stack<p>- Stay up to date on the latest trends to bring in the right technologies to make our work better – not just the coolest new thing<p>- Know when to buy vs. build - don’t reinvent the wheel<p>- Think about security as an inherent part of our frameworks and build it in<p>- Own the continuous improvement of our software development life cycle, ensuring that each team and app builds on the best of those that came before<p>- Serve as a coach and mentor to the Engineering Practices team within the Lab, as well as ensuring quality delivery from third party engineers who augment our capabilities by supporting their integration and coaching the Lab team on how to best collaborate.<p>- Support our clients as they improve their own engineering capabilities<p>- Support the Head of the Development Lab as well as members of other Bain teams in developing IP around modern engineering practices and how they can be best implemented within client businesses, bringing hands-on knowledge and expertise<p>- In some cases, work directly with our clients to help them solve specific challenges around strategy or adoption of modern software engineering practices<p>- Support the growth of the Lab by playing an active role in hiring<p>- Identify sources of engineering talent to bring to the Lab, including their own networks<p>- Assist the Dev Lab Head in defining the interview process for the Lab, including taking the lead on developing the technical portions of the process<p>- Interview engineering candidates for their team and others<p>To apply: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;79xGxu\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;79xGxu</a>","time":1538449462,"type":"comment"}