{"by":"heydenberk","id":18114006,"parent":18113144,"text":"QuotaPath | Frontend, Backend or Full-stack Engineer | Philadelphia, PA or Austin, TX | Full-Time | On-Site | <a href=\"https:&#x2F;&#x2F;www.quotapath.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quotapath.com&#x2F;careers&#x2F;</a><p>Sales compensation plans can be shockingly complex. Too often, sales\nprofessionals are forced to use unfriendly accounting software from the web 1.0\nera, or worse, to pass around Excel spreadsheets, without the ability to verify\nthe calculations or understand how they work.<p>At QuotaPath, we&#x27;re solving this problem in a new way. We&#x27;re creating a\nplatform that&#x27;s built for salespeople, not accountants. This means our business\nmodel is unique, both consumer-facing and B2B (&quot;B2BC&quot;). Good UX and beautiful\ndesign are at the core of our process. The demand for a product like this is\nintense and we&#x27;re working as hard as we can to deliver features to eager users.<p>We&#x27;re looking for engineers to help us accelerate our development as a product\nand as a company. If you&#x27;re interested in having a huge impact on a small team,\nthis is a great opportunity. We&#x27;re well-funded, but we&#x27;re still only 6 people:\n2 engineers, 1 UX and 3 others in product and executive team. I&#x27;m one of those\n2 engineers, and I&#x27;m also the technical co-founder. Please ask me questions if\nyou have any!<p>Our stack is Python + Django on the backend, TypeScript + React on the\nfrontend, but we&#x27;re more interested in working with people who are smart and\ncapable than people from any particular background. If you have strong opinions\nabout using different tech, we&#x27;ll hear you. Like most startups, we&#x27;re built on\nlots of open source tech and we plan on giving back. We value building a culture\nof inclusion and transparency. We care about diversity and hope you do too.<p>EDIT: feel free to reach out to me directly: eric at quotapath dot com","time":1538410310,"type":"comment"}