{"by":"transcriptic","id":18114579,"parent":18113144,"text":"Transcriptic (YC W15) | Backend, Full-stack engineers, Designers | Menlo Park, CA | <a href=\"https:&#x2F;&#x2F;transcriptic.com\" rel=\"nofollow\">https:&#x2F;&#x2F;transcriptic.com</a> | FULL TIME; ONSITE<p>Transcriptic is turning biology into an information science by creating a fully automated cloud wet lab. Biologists anywhere can submit and run experiments over the internet on-demand and without investing up-front in a lab facility.<p>The Transcriptic Common Lab Environment (TCLE) takes Autoprotocol (<a href=\"http:&#x2F;&#x2F;autoprotocol.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;autoprotocol.org&#x2F;</a>), a high-level JSON description of a biological protocol, and executes it on our custom-built robotic workcells. The protocols we handle routinely involve solving constraint programming models with thousands of variables and constraints in order to find a plan that fulfills the scientist&#x27;s biological intent.<p>Scientists manage their experiments through our web application or via our API. We provide a single platform that controls scientific devices from many vendors in a unified way, and an interface to control our automated labs.<p>Backend engineer: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;?gh_jid=1092746\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;?gh_jid=1092746</a><p>Full-stack engineer: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;?gh_jid=1236117\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;?gh_jid=1236117</a><p>UX Designer: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;?gh_jid=1333745\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring&#x2F;?gh_jid=1333745</a><p>Tech stack includes: Linux, Scala, RabbitMQ, Rails, Typescript, React, Ansible, Postgres<p>Benefits include: full medical&#x2F;dental&#x2F;vision insurance; catered lunch and dinner, and a fully stocked kitchen; flexible vacation policy; 401(k) with matching; gym and commuter reimbursement; and education reimbursement up to $3,000&#x2F;year.","time":1538413618,"type":"comment"}