{"by":"blystad","id":18114587,"parent":18113144,"text":"BARTEC PIXAVI | Oslo, Norway | ONSITE | <a href=\"https:&#x2F;&#x2F;www.pixavi.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pixavi.com</a><p>BARTEC PIXAVI creates smartphone for oil &amp; gas, mining, shipping, chemical production and similar fields (rugged intrinsically safe ATEX&#x2F;IEcx devices). The devices are used by almost all Fortune 500 energy companies, and they are manufactured in Norway. We&#x27;re currently working on next generation of our smartphone, and we need your help!<p>We&#x27;re currently hiring for two positions:<p>--- Backend + App developer ---\nThis position is responsible for a new (greenfield) project for analysing telemetry data and customer bug reports (which include a lot of data). A big focus for the next generation is quality assurance, and reduced cost. You&#x27;ll also be responsible for working on various apps that are shipped with the device, and used for over the air updates, and hardware testing (during manufacturing). And, if that isn&#x27;t enough, you&#x27;ll also assist with building software for automated hardware testing (software to control testing jigs, robot arms, analyse camera and sensor output, etc.). Some experience with statistical analysis is a bonus, but not a requirement (you can always ask your colleague with a PhD in mathematics).<p>Tech: Java&#x2F;Kotlin; PostgreSQL (in our existing solutions, the new project can use whatever fits best); Docker; Kubernetes.<p>--- Mechanical Engineer ---\nYou will have a unique chance to learn how to develop a smartphone and other mobile devices completely from scratch. We do almost everything in-house, you will be able to work on all the different product development phases. Everything from a new product proposal, concepts and prototyping, manufacturing and sourcing.<p>The position also assumes that you have experience with:<p>– CAD systems (Solidworks) as well as good technical and practical understanding.\n– Mechanical engineering and material science knowledge.\n– Production processes like: Injection molding, insert&#x2F;over molding, CNC machining, die casting and sheet metal work.\n– FEM simulation capabilities is a benefit.<p>For more information, check out <a href=\"https:&#x2F;&#x2F;www.pixavi.com&#x2F;company&#x2F;employment&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pixavi.com&#x2F;company&#x2F;employment&#x2F;</a>\nAny questions can be sent to jobs {at} bartec-pixavi.com (or me, acb {at} bartec-pixavi.com ).","time":1538413645,"type":"comment"}