{"by":"bobintornado","id":18118526,"parent":18113144,"text":"GO-JEK | Singapore, Indonesia, India | Map&#x2F;GIS Tech lead | Full-time | VISA | <a href=\"https:&#x2F;&#x2F;www.go-jek.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.go-jek.com&#x2F;</a><p>About the company.<p>GO-JEK is Indonesia’s first unicorn and is currently the fastest growing start-up in South Asia and the largest in Indonesia in terms of valuation, funding raised and number of transactions. Having started as a bike-taxi hailing business, the start-up grew more than 900X in just 18 months and diversified into food delivery, one-hour courier delivery, grocery delivery, and a digital wallet called GO-PAY. Over 900k bike and car drivers have signed up on our platform, you can order from over 100k+ restaurants on GO-FOOD, and we’ve completed 100million orders in our first 14 months after launching the app. In August 2016, GO-JEK had raised over $550 million in a new round of funding led by KKR and Warburg Pincus LLC, the largest ever for an Indonesian technology start-up. In more recent rounds, Tencent and Google have invested.<p>About the team.<p>The Geo team at GO-JEK is focused on moving things more efficiently. GO-JEK is not just about getting you from A to B, but it’s about delivering you the best and most desired food dishes, it’s about replenishing your house with the essentials like toilet paper and soap, it’s about enabling you to send any package anywhere in the city, it’s about empowering you to ditch your wallet and pay with your phone when you’re at your favorite mall. This requires us to have a deep understanding of how movement happens in a city. This team focuses on building a platform of location-based products. Our customers are the internal GO-JEK product teams: GO-RIDE, GO-CAR, GO-FOOD, GO-SEND, GO-MART, GO-SHOP, and GO-PAY.<p>About You.<p>Expert in the GIS&#x2F;map field, have deep understanding and production experience in routing, ETA and map-matching tech stack.<p>Contact: bob.cao at go-jek.com","time":1538449579,"type":"comment"}