{"by":"jeremy_jackson","id":18116069,"parent":18113144,"text":"Shift Lab | Developer, Front-end Developer, Scrum Master | ONSITE - New York, NY or Lancaster, PA | <a href=\"http:&#x2F;&#x2F;shiftlabny.com\" rel=\"nofollow\">http:&#x2F;&#x2F;shiftlabny.com</a><p>Hello! We&#x27;re Shift Lab.<p>Shift Lab is a close-knit team of well-rounded technologists, comfortable working in a variety of major languages and frameworks.<p>Our company is headquartered in New York City&#x27;s Flatiron District, with an additional studio located in beautiful downtown Lancaster, PA. Our workspaces are modern, bright, open, and welcoming. When we want to (which is often!), we work remotely Mondays and Fridays.<p>We are currently seeking Developers (entry to senior levels) to join our New York City or Lancaster, PA teams.<p>A qualified Developer at Shift Lab matches the following criteria:<p>- Mid to senior career candidates\n- You are a git master and a guru of pull requests\n- You understand Agile development processes\n- You can gather, plan, and articulate technical requirements by writing effective Jira stories and accurately estimating your work\n- You ain&#x27;t scared of the front-end, and can probably hold your own working in front-end technologies and frameworks\n- You have a mastery of one or more of the following: React and&#x2F;or Node (Javascript), Python, Ruby on Rails\n- You can be trusted to test your work and mentor teammates through peer code reviews (via PRs)\n- You&#x27;ve got some formal education in software development or comparable real world work experience\n- Maybe you know a thing or two about mobile development, Rust, 3D modeling&#x2F;animation, Unity, Arduino, Raspberry Pi, IoT, sensor networks or other awesome technologies<p>How to Apply<p>If you meet the criteria above and are interested in working for a talented, fun, flexible, founder-led company, hell-bent on producing top-of-industry work, please drop us a line at careers@shiftlabny.com.<p>Please DO NOT reply to this posting if:<p>1. You are a Recruiter\n2. You are NOT currently living a commutable distance (3 days &#x2F; week) from New York City or Lancaster, PA","time":1538422760,"type":"comment"}