{"by":"kaplun","id":18115979,"parent":18113144,"text":"Proton Technologies AG | Network Engineer&#x2F;Storage Engineer | Full-time | Geneve, Zurich, San Francisco | <a href=\"https:&#x2F;&#x2F;protonmail.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;protonmail.com&#x2F;careers</a><p>At ProtonMail, we are committed to online security and privacy. We have been working diligently on this cause since 2013, and we launched ProtonMail in 2014 with the goal of defending our rights to security and privacy online.<p>Today, ProtonMail is used worldwide by millions of business professionals, journalists, activists, and individuals who value security in their communications. We strive to make encryption and privacy an integral part of the future of digital communication. Along the way, we are developing and building cutting edge technology to support our rapidly growing community.<p>Proton Technologies AG is an international company headquartered in Geneva, Switzerland, with a presence in San Francisco, Macedonia, France, Czech Republic, and Lithuania. You will find among us former CERN and MIT scientists, chess champions, and many experts in their fields.<p>For those up to the challenge, ProtonMail provides an intense and exciting atmosphere as part of one of Europe&#x27;s highest profile and fastest growing startups. We&#x27;re looking for extremely intelligent and highly motivated problem solvers to join our team of experts. We provide highly competitive compensation packages, commensurate with experience and performance. As a fast growing company that doubles headcount annually, there is also the possibility for rapid advancement for capable candidates. We operate on a strict meritocracy, with a flat management structure, and promoting internally whenever possible.<p>ProtonMail has millions of users, and we are growing rapidly. As part of our team, you will have the ability to make a direct and significant impact. You will have the chance to work on challenging large scale problems related to scaling, security, reliability, and user experience. Our work is complex, and our team moves fast and works at a higher level than the typical team. You should be smart, fast, versatile, and creative. Working with us will likely be your most challenging job, but perhaps also the most exciting and rewarding. In the process, you will touch the lives of millions of people around the world.<p>We currently have several openings, and in particular we are looking for Network Engineers and Ceph Storage Engineers.<p>Our technology stack is built on top of PHP, Javascript (Angular&#x2F;React), and we have desktop client in Go, and Android and iOS apps. We also employ Ansible&#x2F;Puppet, Elasticsearch (ELK-stack), and Kafka.<p>See <a href=\"https:&#x2F;&#x2F;protonmail.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;protonmail.com&#x2F;careers</a> for more information and to apply.","time":1538422212,"type":"comment"}