{"by":"mattbee","id":18115502,"kids":[18115549],"parent":18113144,"text":"Bytemark | Front-end dev: HTML, CSS, JS, UI design | York, UK | ONSITE, REMOTE, FULL-TIME |<p>Bytemark is the UK&#x27;s cloud hosting provider with its own data centre &amp; cloud hosting stack, serving cloud-native developers across the country.<p>We&#x27;re looking for an enthusiastic Front-End developer with a passion for building browser-based applications. You will be a valuable and essential member of our Scrum team, working closely with other developers to build the front-end of all of Bytemark&#x27;s  systems- both internal and customer-facing.<p>Bytemark is a 34-person strong hosting company founded 15 years ago, with over 2400 customers. Our head office is in the beautiful, historic city of York. Our mission is to provide solid, reliable hosting with a strong focus on the UK market. We have a deep appreciation for the free software movement and as we’ve grown, made sure that our recruitment and management are truly equal-opportunity, provide a flexible 37.5-hour average work week and family-friendly employment policies.<p>For this position we&#x27;re happy to consider mostly-remote workers, but you&#x27;ll need to be able to visit York once a month.<p>We have an anonymous recruitment policy - no CV required until the last stage of our process, just an mobile phone# and a form to fill in, and we&#x27;ll take you through from initial chat to technical interview without knowing who you are.<p>To apply, head over to:<p><a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;24\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;24</a><p>And you can read a bit more about our anonymous recruitment process here:<p><a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;full-process\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;full-process</a><p>Happy to edit&#x2F;answer questions here if I&#x27;ve forgotten something obvious :)","time":1538418931,"type":"comment"}