{"by":"avj_vs","id":18113805,"parent":18113144,"text":"Vector GB Limited | Software Engineers and Research Engineers | London, UK | ONSITE<p>We are a global, continuously growing engineering company. For over a quarter of a century, we have been at the forefront of electronic innovations within the automotive industry and related sectors. Vector has over 2,000 employees at 24 locations worldwide, supporting manufacturers and suppliers with a professional platform of software and hardware tools, embedded software components, and services for developing embedded systems.<p>The VectorCAST line of products provides innovative software testing solutions for safety and mission critical embedded applications. Software development organisations that need to solve complex quality problems use these products to perform dynamic software analysis.<p>www.vectorcast.com<p>Our advanced code analysis team is looking to hire for roles under the title of &quot;software engineer&quot; or &quot;research engineer&quot;. The team applies fundamental computer science theory to real-world software engineering problems. Following the mantra of &quot;work smarter, not harder&quot;, we try to empower VectorCAST to take the human out of software testing. Recent technology used by the team includes Boolean Satisfiability, fuzz testing and software security.<p>This role would a suit a Masters or PhD student with knowledge of software engineering, compiler technology, static analysis and automated software engineering. An essential skill will be in assimilating academic publications, assessing their relevance and then putting forward the case for adoption within the Vector toolchain.<p>A working knowledge of the following would be preferable:<p><pre><code>    * C&#x2F;C++\n\n    * Python\n\n    * UNIX shell scripting\n\n    * Combinatorial problems\n\n    * Parsers and abstract syntax trees\n</code></pre>\nKnowledge of topics such as &quot;EDG&quot; or &quot;libclang&quot; would make you an ideal candidate.<p>We are predominately looking to hire for positions in our London office (Zone 1).<p>Feel free to reach out to me directly if you have an interest: andrew.jones [at] vector.com.","time":1538409065,"type":"comment"}