{"by":"JessQuinn","id":18124659,"parent":18113144,"text":"Scrapinghub | <a href=\"https:&#x2F;&#x2F;scrapinghub.com\" rel=\"nofollow\">https:&#x2F;&#x2F;scrapinghub.com</a> | 100% Remote |Full-time | Multiple roles<p>Scrapinghub is now hiring Python Developers, Support Engineers, Erlang Developer (Tech lead)<p><a href=\"https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs</a><p>Quick summary of some of the open positions (Check out our website for a full list):<p>- Python Developer (scraping): you will be in charge of designing, developing and testing Scrapy web crawlers.<p>- Support Engineer: Provide world class support for our Scrapinghub customers by investigating and resolving issues.<p>- Lead Erlang Developer: Join and lead our Crawlera team. Crawlera is a smart downloader designed specifically for web crawling and scraping. It allows crawler developers to crawl quickly and reliably by managing thousands of proxies internally.<p>About Scrapinghub: We&#x27;re a fully distributed team with more than 140 Shubbers working from over 30 countries, who are passionate about scraping, web crawling and data science.<p>You&#x27;ll have the chance to work on projects that harvest and transfer datasets of thousands of millions of records, as well as build some of the systems that will deliver data to current Fortune 500 companies and the startups that are building great products on top of our stack.<p>We have a very engineering-driven culture (two engineer-founders) and a great place to work if you&#x27;re self-directed, curious, and interested in working in open source environments. More on Open Source at Scrapinghub: <a href=\"http:&#x2F;&#x2F;scrapinghub.com&#x2F;opensource&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;scrapinghub.com&#x2F;opensource&#x2F;</a>.<p>Scrapinghub continues to grow significantly this year and we&#x27;re looking for great additions to our team. Positions are fulltime (40hours per week) and fully remote.<p>Interview process: 2 interviews and a technical trial project.<p>You can apply here: <a href=\"https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;scrapinghub.com&#x2F;jobs</a><p>Got questions? Feel free to contact me at jessica@scrapinghub.com","time":1538507026,"type":"comment"}