{"by":"madh","id":18120878,"parent":18113144,"text":"Facebook | Solutions Engineer | Menlo Park, New York, Austin, Chicago, Seattle, Amsterdam, Dublin, London, Stockholm, Berlin, Tel Aviv, Buenos Aires | Onsite<p>At Facebook, Solutions Engineers are creative problem solvers who strive to reconcile business challenges using various technologies to create effective marketing solutions. Our team is looking for high performance full-stack engineers with an entrepreneurial mindset. As a Solutions Engineer, you will lead the advertising industry by building new solutions and enabling partners to realize the full potential of those solutions. You will write production-grade code for Facebook Ads products in collaboration with product engineering teams. This role will allow you to apply your passion for problem solving and consult clients on creating and executing an ad-tech strategy.<p>Job listings are available at <a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;?q=solutions%20engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;?q=solutions%20enginee...</a> \n<a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1200000LT5zLEAT&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1200000LT5zLEAT&#x2F;</a>\n<a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1200000JXhMxEAL&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1200000JXhMxEAL&#x2F;</a><p>Facebook | Solutions Engineer Manager | Menlo Park, New York | Onsite\n<a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1H00000MoUL1UAN&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1H00000MoUL1UAN&#x2F;</a><p>We also have a great opportunity for an engineering manager that would like to support a team. You would support a distributed team, so travel would be required. Roughly half the time would be spent on people management, with the other half on Solutions Engineering work. We will consider a very experienced tech lead that would like to make the transition into people management.<p>If you would like to apply or have any questions, feel free to send me an email at hiten@fb.com .","time":1538483364,"type":"comment"}