{"by":"seanperkins","id":8120179,"parent":8120070,"text":"Mobility Labs - Washington, DC - <a href=\"http://mobility-labs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mobility-labs.com</a><p>Senior Front End Developer - Washington, DC(possibly remote)<p>At Mobility Labs, we work on projects that have a social impact. We work with non-profits, foundations, and small businesses. While we work with non-profits and foundations, we’re a for-profit company and offer competitive salaries and benefits. Our main industry is K-12 education, but we also have projects in public accountability. One reason our clients prefer working with us is because we build pilot projects to demonstrate success prior to building out larger applications. For us, this means lots of opportunities for building projects from scratch, allowing us to work with the latest and greatest development tools and frameworks.<p>You will be working with our team of developers, designers, and subject matter experts to build software that solves real problems. We build in an agile manner with direct user feedback as part of our design&#x2F;development cycle. You will have the opportunity to mentor others on the team while working with our senior developers. Our current stack leans towards Angular on the client side and Rails on our API server. Our developers are a curious sort though, so we will continue to adjust our stack as new technologies emerge.<p>As our front end expert you should be able to create directives, resources, services, controllers, and all the other fun parts of Angular with ease. We use package managers and build systems. We like speeding things up by using Bootstrap or Foundation, so familiarity would be great. Getting the most out of SASS and LESS will also help. Do you like automated testing? Us too! We use Jasmine, Karma, and CircleCi. We also can’t get enough of Github and have a strong code review culture.<p>The majority of the team is in Washington, DC but we also have members in NYC, Richmond, VA and Medellin, Colombia.<p>If you are interested shoot me an email at job@mobility-labs.com","time":1406905034,"type":"comment"}