{"by":"shin_lao","id":8120629,"parent":8120070,"text":"Senior C++ Developer at Bureau 14 - Paris, France<p>Do you have a <i>strong taste</i> for technical matters and software engineering is <i>your passion</i>?<p>Are you looking for <i>out of this world challenges</i>?<p>Are you <i>bored</i> at work?<p>## Join us!<p>We are in the process of building an all-star software engineering team and are actively looking for a\nsenior C++ developer.<p>Our product, quasardb (<a href=\"https://www.quasardb.net/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quasardb.net&#x2F;</a>), is written in C++ 14 and relies heavily on the STL and the Boost libraries. It is multiplatform and runs on FreeBSD, Linux and Windows.<p>Our customers — mainly in the finance industry — rely on quasardb to solve overwhelming data\nmanagement issues.<p>Quasardb is the world’s fastest database. Do you want to be part of it?<p>This is full-time position based in Paris, France.<p>## Who we are looking for<p>You are a bold, experienced, results-oriented software engineer with a strong taste for novelty. You always want to go further and want to join an extremely ambitious team.<p>Your taste for software quality and your pragmatism enable you to design large software with low maintenance costs.<p>### Mandatory<p>- Legal permission to work in France<p>- A proven track record of building production-ready large scale software<p>- Excellent C++ &#x2F; STL skills with a taste for template meta-programming<p>- Strong system programming skills<p>- Outstanding communication skills<p>- Fluency in English<p>### Welcomed<p>- Fluency in French (How will you buy your baguette otherwise?)<p>- Python&#x2F;Java&#x2F;.NET<p>- Any finance-related knowledge is warmly welcomed<p>- Network programming<p>- Kernel programming (FreeBSD, Linux or Windows)<p>## About Bureau 14<p>Founded in 2008, Bureau 14 publishes quasardb, a high-performance distributed database.<p>The company is profitable and well-funded.\nWe strive for technical excellence and outstanding customer service.<p>## Benefits<p>- Competitive salary and fully paid health insurance<p>- Great work environment in the heart of Paris with crazy Frenchmen<p>- Flexible working time<p>- You get everything you need to get things done (computer, software, documentation, coffee, baguettes…)<p>- 5+ weeks of paid vacation<p>- Fitness center membership<p>Apply at jobs@bureau14.fr","time":1406907740,"type":"comment"}