{"by":"lost_my_pwd","id":8120386,"kids":[8121206],"parent":8120070,"text":"Moveline - Las Vegas, NV or Remote<p><a href=\"https://moveline.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;moveline.com&#x2F;</a><p>tl;dr: full-stack JS (Express + Angular), MongoDB, Golang, web + mobile, remote, high impact on real customers<p>== The position ==<p><pre><code>  * Solid full-stack experience, preferably with JavaScript both\n    server-side and client-side\n  * Passion for clean, correct, and maintainable solutions as well as modern\n    development practices\n  * Bonus points for experience working with remote teams, devops skills, and an\n    eye for design\n  * Strongly self-motivated but eager to collaborate on tough problems\n  * Don&#x27;t care if the moving industry isn&#x27;t sexy\n  * Would rather make money than make the front page of TechCrunch\n    (though we do that too)\n</code></pre>\n== The team ==<p><pre><code>  * Supporting web and mobile offerings for customers plus an internal web\n    app for our operations team\n  * Primarily working in a MEAN stack (MongoDB&#x2F;Express&#x2F;Angular&#x2F;Node) with\n    a bit of Golang\n  * Evaluating new tools and technologies for real use cases, not just to play\n    with shiny new toys\n  * Shipping every day with continuous testing and deployment\n  * Small, tight-knit, self-managing, and highly communicative team (half\n    of us are remote)\n  * Deeply involved in understanding the business and creating long-term strategy\n  * We love Maker Day [4], board games, and hanging out together in\n    downtown Las Vegas\n</code></pre>\n== The company ==<p>Moveline is transforming an industry older than the internal combustion engine: we build software that dramatically improves the customer experience, end-to-end, around moving. We&#x27;re helping real people every day and excited to tackle more of the problem space.<p><pre><code>  * Techstars NYC 2012 graduate [1]\n  * 2014 TBAN Las Vegas Tech Transplant of the Year\n  * Located in the heart of Tony Hsieh&#x27;s Downtown Project [2]\n  * Well-funded by world-class investors and advisers [3]\n</code></pre>\nMarket salary and meaningful equity are available. Hackers in Vegas or remote in the US are welcome. Full-time candidates only, please (with an initial contract-to-hire phase). No freelancers or recruiters need apply.<p>MENTION HACKER NEWS WHEN APPLYING! - We have hired from HN before and consistently see the best candidates coming from these threads.<p>[1] <a href=\"http://www.techstars.com/companies/stats/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.techstars.com&#x2F;companies&#x2F;stats&#x2F;</a><p>[2] <a href=\"http://downtownproject.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;downtownproject.com&#x2F;</a><p>[3] <a href=\"http://angel.co/moveline\" rel=\"nofollow\">http:&#x2F;&#x2F;angel.co&#x2F;moveline</a><p>[4] <a href=\"http://www.fastcompany.com/3029158/agendas/why-your-office-needs-a-maker-day\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fastcompany.com&#x2F;3029158&#x2F;agendas&#x2F;why-your-office-n...</a>","time":1406906129,"type":"comment"}