{"by":"psculthorpe","id":8120138,"kids":[8120509,8120306],"parent":8120070,"text":"Full-stack Python&#x2F;Django developer\nLocal or remote<p>===<p>Rock Kitchen Harris, Leicester, UK - <a href=\"http://www.rkh.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rkh.co.uk</a><p>Hi! I&#x27;m looking for a super elite, super friendly, super smart Django developer to help a small and excited team work on lots of client projects plus our own apps. We&#x27;ve been around for 32 years and we&#x27;re well established, but unlike a typical agency dev team, ours is small, fast and independent.<p>We have all sorts of clients with differing needs, but we&#x27;ll trust you to work on huge projects like Police.uk (hundreds of thousands of visits a day) pretty quickly if all goes well.<p>We&#x27;re just about to move into a stunning new office in a 1930s bank (complete with our own café and kitchen, and next door to the pub). Ideally you&#x27;d work in the office on a shiny new Mac at a shiny new desk, but if remote works best for you then that&#x27;s cool - we&#x27;ll provide whatever tools you might need and hope to see you now and again for fun and games and beer.<p>### Essential life skills ###<p>* Python and Django experience - you know it inside out, but you&#x27;re also smart enough to know when rolling your own is a bad idea and when to stand on the shoulders of existing libraries, packages and apps<p>* Server chops - you&#x27;re comfortable with UNIX-based technologies, the thought of spawning and killing thousands of load-balanced AWS servers for high profile sites doesn&#x27;t scare you, and you could survive a whole day without touching a mouse if you needed to<p>* Passion - you love what you do, your Instapaper queue is off the scale, and you high-five yourself when something actually works(!!1)<p>* Initiative - you appreciate the need for &#x27;project people&#x27;, but you can focus on the end goal and pretty much get on with things without being micromanaged<p>* People skills - you recognise that non-developers think differently and always click the wrong button, but you&#x27;re ok with that and understand how important they are in the grand scheme of things<p>* Taste - you can spot bad code or an ugly design as well as you can spot efficient code and pretty things<p>* A clean record - we do a lot of work with sensitive government data, so we&#x27;ll have to do background checks to get you security clearance (and a cool ID card) for certain projects<p>### Stuff we use every day that doesn&#x27;t at all scare you ###<p>OS X, Ubuntu, tmux, Mercurial, Git, GPG, PostgreSQL, AWS, VPC, nginx, Gunicorn, supervisord, Python, Django, Celery, RabbitMQ, Memcached, HTML, Less, jQuery, Jenkins, Selenium, CloudFlare<p>### How to apply ###<p>Please send a CV&#x2F;resume and covering note directly to me: psculthorpe@rkh.co.uk<p>Or, better, surprise me! Perhaps your blog really tells us about you, or there is something really impressive you&#x27;ve created or worked on you can share, or your Github commit history is huge. Anything more than a boring CV tends to stand out! Let&#x27;s talk.<p>Thanks for reading :)<p>Paul Sculthorpe\nDirector, Rock Kitchen Harris","time":1406904734,"type":"comment"}