{"by":"bdejong","id":8120862,"parent":8120070,"text":"Native Instruments - <a href=\"http://www.native-instruments.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.native-instruments.com&#x2F;</a><p>We make cutting edge hardware and software for music production and DJs. If you listen to any kind of (electronic) music you&#x27;ve most probably heard our gear and software in action. You might know Traktor, Maschine or Komplete, three of our flagship products.<p>We&#x27;re looking for two positions in a team that is building a large web-api from the ground up.<p>In order to apply send email to bram.dejong@native-instruments.&lt;TLD for germany&gt; (and I&#x27;ll forward to our HR).<p><pre><code>  ====&gt; DEVOPS ENGINEER (F&#x2F;M)\n</code></pre>\nFulltime, Berlin, Germany.<p>We are looking for a devops engineer to join our Berlin-based team. In this role you will be responsible for setting up the infrastructure for a brand new highly reliable and scalable web API. The API will be consumed by our music production and DJing applications used by all Native Instruments product users worldwide. You will work with cloud services and set up, monitor and tweak machines for optimal performance. You keep up with the latest technologies and tools.<p><i>Your tasks</i><p>- You set up a scalable infrastructure which will host a variety of services and API’s<p>- In collaboration with the backend devs you make sure that all applications scale and are robust<p>- You support setting up cloud computing applied to music applications<p><i>Your profile</i><p>- You have at least 3 years of experience running and managing servers<p>- Experience with automation is a must<p>- You speak fluent Python and a variety of scripting languages<p>- You have a degree in computer science, software engineering, or similar<p>- Ideally you have experience with cloud services providers<p>- You enjoy testing and using the latest and greatest technologies<p>- You enjoy working in an international team<p>- Your English skills are very good, German is a plus<p><pre><code>  ====&gt; WEB-API BACKEND PYTHON DEV (F&#x2F;M)\n</code></pre>\nFulltime, Berlin, Germany.<p>We are looking for a backend python web engineer to join our Berlin-based team. In this role you will be responsible for building up a brand new highly reliable, and scalable web API. The API will be consumed by our music production and DJing applications used by all Native Instruments product users worldwide. Testing and documentation are not necessary evils for you, they form part of what you think is good software.<p><i>Your tasks</i><p>- You build a variety of music-application client-server API’s from the ground up<p>- In collaboration with DevOps you make sure that all applications scale and are robust<p>- You set up big-data analysis systems in collaboration with a research team<p><i>Your profile</i><p>- You have at least 3 years of experience with creating highly scalable web applications<p>- You speak very fluent Python and have used it to write server-side software<p>- You have a degree in computer science, software engineering, or similar qualification<p>- Ideally you have experience with cloud services providers (AWS, Digital Ocean, etc.)<p>- You enjoy working in an international team<p>- Your English skills are very good, German is a plus","time":1406909123,"type":"comment"}