{"by":"jsaxton86","id":8120478,"parent":8120070,"text":"Elemental Technologies (Portland, OR) -- <a href=\"http://www.elementaltechnologies.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.elementaltechnologies.com</a><p>We have lots of open positions, but most are for Software Engineers (specifically, anyone with C++, Rails, or video expertise): <a href=\"http://www.elementaltechnologies.com/company/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.elementaltechnologies.com&#x2F;company&#x2F;careers</a><p>We&#x27;re a growing company with maybe 140 people now. Our specialty is video transcoding, and we&#x27;re doing some pretty game changing stuff, especially in the areas of HEVC&#x2F;h.265 and 4K. I think we were the first company in the world to successfully pull off a live 4Kp60 broadcast. We&#x27;re working with many of the biggest names in the industry (ESPN, HBO, Comcast, BBC, etc.), and being involved in events like the World Cup and Olympics is a lot of fun.<p>Even though we have ~140 people now, Elemental still definitely has a startup feel -- almost everyone does a lot of new feature development. The team is extremely competent -- the most competent I have ever been a part of. Our products generally have 4 layers:<p>* A video codec written in C (with some CUDA -- we have GPU accelerated codecs)<p>* A C++ media engine that basically takes the aforementioned codec and does useful stuff with it (this is what I work on)<p>* A process manager written in Ruby<p>* A Ruby on Rails UI that basically takes in a bunch of user settings and converts it into an XML file that gets passed into the media engine<p>* We also have a cloud product that runs on top of AWS<p>The benefits at Elemental are amazing, and too numerous to list here. I encourage you to check them out here: <a href=\"http://www.elementaltechnologies.com/company/careers/benefits\" rel=\"nofollow\">http:&#x2F;&#x2F;www.elementaltechnologies.com&#x2F;company&#x2F;careers&#x2F;benefit...</a><p>If you have any questions, please email me at john.saxton [at] elementaltechnologies [dot] com or feel free to apply via our website: <a href=\"http://www.elementaltechnologies.com/company/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.elementaltechnologies.com&#x2F;company&#x2F;careers</a>","time":1406906729,"type":"comment"}