{"by":"makmanalp","id":8120619,"parent":8120070,"text":"Harvard Center for International Development - Cambridge, MA (Right next to Boston)<p>Two positions: We&#x27;re looking for a Designer + UI &#x2F; UX person AND a Front end developer, both onsite.<p>================================<p>The Atlas of Economic Complexity lets you interactively visualize a country’s trade and explore growth opportunities for more than a hundred countries worldwide. There are also two other National Atlas projects in the pipeline, one for Colombia and one for Mexico.<p>The idea is that countries provide us with their data and the Center provides them with economic policy advice and an interactive tool to explore their situation and make sound policy decisions at the regional level. If you&#x27;re looking for a high-impact job, this is it!<p>================================<p>We want to focus on building features around this idea of storytelling with data (see example at the end), as well as re-do our UI and design to be cleaner and up to modern standards, and to add better visualization capabilities. We look at NYtimes data driven articles with envy. We salivate when we see Tufte&#x27;s work.<p>We need <i>you</i>, dear designer &#x2F; frontend engineer, to make all that a reality!<p>We use d3.js for the visualizations. We know that at least the visualization part would be ideally suited for a single page app, and we&#x27;d love to implement that with Angular &#x2F; Backbone &#x2F; etc. We want to rethink our designs.<p>Especially with the new national projects with Colombia and Mexico, you&#x27;ll have free rein over the creative process and the technological aspects of your work.<p>==================================<p>We use python, django, mysql (hopefully postgres soon), elasticsearch, ansible for the back end. For the frontend, it&#x27;s jquery &#x2F; d3.<p>Everything we do is open source: <a href=\"https://github.com/cid-harvard\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;cid-harvard</a> and we use Github for bug&#x2F;feature tracking.<p>==================================<p>Coming from the startup world, the work environment is pretty laid back, but everyone is expected to hold their own and get their work done without being micromanaged. No late nights and weekends, although I&#x27;ve been known to do that once in a blue moon because I felt like it.<p>We&#x27;re a small engineering team (me and a data viz researcher), but we work with a large group of brilliant doctoral &#x2F; postdoctoral researchers from diverse backgrounds like econ, public policy, physics, international development. I&#x27;ve been here only for a few months, but I&#x27;ve been given responsibility to fully overhaul and clean up the backend, which speaks towards the kind of autonomy you&#x27;ll have.<p>I&#x27;m looking to build out our burgeoning team into a small but strong group that specializes in turning ideas into reality. We have great plans and dreams for the future of this site, and we need people to help. We&#x27;d love to hear more about you and see work samples if possible! Get in touch at mali_akmanalp at hks dot harvard dot edu.<p>Cheers,\n~mali<p>=================================<p>An example of how the atlas is useful take this story here:<p><a href=\"http://www.nytimes.com/interactive/2014/03/21/world/europe/how-much-europe-depends-on-russian-energy.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;interactive&#x2F;2014&#x2F;03&#x2F;21&#x2F;world&#x2F;europe&#x2F;h...</a><p>The EU recently placed sanctions sales of oil equipment, but not on oil imports. Why could this be? Almost 70% of russia&#x27;s exports are petrol products:<p><a href=\"http://atlas.cid.harvard.edu/explore/tree_map/export/rus/all/show/2012/\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;tree_map&#x2F;export&#x2F;rus&#x2F;all...</a><p>And Russia exports the overwhelming majority of its petroleum products to Europe:<p><a href=\"http://atlas.cid.harvard.edu/explore/tree_map/export/rus/show/2709/2012/\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;tree_map&#x2F;export&#x2F;rus&#x2F;sho...</a> and <a href=\"http://atlas.cid.harvard.edu/explore/tree_map/export/rus/show/2710/2012/\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;tree_map&#x2F;export&#x2F;rus&#x2F;sho...</a><p>The big blue chunk is europe, meaning a sanction would really hurt Russia. However, when you look at who else the EU could buy from, the situation is grim:<p><a href=\"http://atlas.cid.harvard.edu/explore/tree_map/net_export/show/all/2709/2012/\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;tree_map&#x2F;net_export&#x2F;sho...</a><p>There’s practically no one who’s a real political ally that Europe could depend on, save for Norway. It’s interesting how it’s practically impossible to buy oil from a country that’s relatively stable and doing well on the HDI front. It’s worse if you consider the cost of transporting it, and how close Russia is:<p><a href=\"http://atlas.cid.harvard.edu/explore/map/net_export/show/all/2709/2012/\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;explore&#x2F;map&#x2F;net_export&#x2F;show&#x2F;all...</a><p>Which probably explains why EU hasn&#x27;t placed sanctions on oil imports from Russia.","time":1406907688,"type":"comment"}