{"by":"bluellama","id":8120282,"parent":8120070,"text":"Secure Mission Solutions - REMOTE<p>We&#x27;re looking for a senior developer to join our team.\nWe are a team of about nine developers plus a full-time DevOps person.  We work from home and communicate via text and video chat.  We work 40-hour weeks with flexible hours, but we try to overlap as much as possible with 10am-4pm Eastern Time.  We are currently working on about eight different projects, each written in one or more of five different programming languages. These projects are small, ranging from one to three developers each.  Everyone works on at least two different projects, so we all need to be competent in more than one language.  Some of us started as system adminstrators and later became software developers. Others are pure developers with solid Unix&#x2F;Linux skills.<p>We&#x27;re looking for someone who meets the following qualifications:<p>- Either 5 years experience as a developer or you can show that you&#x27;re an exceptional candidate<p>- Comfortable with and enjoys working in C&#x2F;C++ plus at least one of the following: Python, Java, PHP, Perl<p>- Experience developing in both Linux and Windows<p>- Knowledge of version control software (Git preferred)<p>- Proficiency writing automated tests<p>- Doesn&#x27;t mind working on more than one project at a time<p>- Continues to improve your development skills and don&#x27;t just rely on what you already know<p>- Able to work autonomously but not afraid to ask for help when you need it<p>- US citizen, live in the US and are able to obtain a security clearance<p>The following experience would be a plus:<p>-   Familiarity with MIT Kerberos (big plus)<p>-   Other programming languages: Ruby, Clojure, Scala, JavaScript, etc.<p>-   Relational databases, especially MySQL or PostgreSQL<p>-   Agile software development<p>-   Computer security (CISSP or Security+ would be great)<p>-   Web page design<p>-   Mobile application development<p>-   System administration experience<p>If you are interested, please get in touch: pjewing [at] securemissionsolutions [dot] com","time":1406905542,"type":"comment"}