{"by":"bluetidepro","id":8120701,"parent":8120070,"text":"ParkWhiz (Chicago, IL, USA)<p>We are looking for experienced software engineers to help us build the parking platform of the future. You&#x27;ll get some challenging problems to work on - complex pricing models, GIS&#x2F;geospatial data, transaction processing, mobile apps - and flexibility to choose the best tools for the job. We have loads of exciting projects in the pipeline, and are looking for somebody to help architect and implement these new initiatives.<p>Founded in 2006, Chicago based ParkWhiz.com pioneered the eParking marketplace and has since become the industry standard and market share leading platform for event and downtown parking bookings across the country. ParkWhiz has extraordinarily strong revenue growth and ongoing product innovations that continue to change the way people think about parking.<p>We also just raised $10 million in our Series B led by Chicago-based venture fund Jump Capital. (<a href=\"http://www.chicagobusiness.com/article/20140721/BLOGS11/140729999/parkwhiz-pulls-in-10-million-in-new-funding\" rel=\"nofollow\">http:&#x2F;&#x2F;www.chicagobusiness.com&#x2F;article&#x2F;20140721&#x2F;BLOGS11&#x2F;1407...</a>)<p>Positions (all Chicago, IL, USA):<p>&gt; Ruby Software Engineer: <a href=\"http://www.parkwhiz.com/about/jobs/ruby-software-engineer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.parkwhiz.com&#x2F;about&#x2F;jobs&#x2F;ruby-software-engineer&#x2F;</a><p>&gt; DevOps Engineer: <a href=\"http://www.parkwhiz.com/about/jobs/devops-engineer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.parkwhiz.com&#x2F;about&#x2F;jobs&#x2F;devops-engineer&#x2F;</a><p>We are looking for an engineer to help us build the high-scale, mission critical infrastructure needed to support our web and mobile applications. This role will have considerable influence in choosing and implementing the technologies and tools needed to facilitate our immense growth.<p>&gt; Visual Designer: <a href=\"http://www.parkwhiz.com/about/jobs/frontend-visual-designer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.parkwhiz.com&#x2F;about&#x2F;jobs&#x2F;frontend-visual-designer&#x2F;</a><p>We are looking for a designer to help continually improve our products and raise our level of quality. This position is part of the product team involved in all aspects of design, and will have considerable influence in how we craft impactful visuals and engaging experiences.<p>You can find more info here: <a href=\"http://www.parkwhiz.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.parkwhiz.com&#x2F;about&#x2F;jobs&#x2F;</a><p>To apply for any position above email your resume or portfolio jobs@parkwhiz.com and tell us why you&#x27;d be perfect for the job. Please include &quot;Hacker News&quot; in the email subject line. <i>No phone calls or recruiters accepted.</i>","time":1406908252,"type":"comment"}