{"by":"helloshow","id":8120338,"kids":[8120586],"parent":8120070,"text":"SVP Engineering for Rails Application<p>Remote or South Florida<p>Hello Show is an automated appointment scheduling tool and messaging platform for real estate agents and their clients. Hello Show eliminates the need for expensive call centers, secretaries, and the endless game of phone tag between agents. Hello Show brings transparency and simplicity into the property showing and communication process. Our product automates routing and creates a paperless and efficient showing experience for all parties involved.<p>Agents participating in our closed beta have used the product with much success.  Typical responses and feedback have ranged between “How do I download this product now?” to “This is absolutely amazing!” We have customers lined up for the launch, with one even saying “promise us that you will give this to us first, before anyone else.&quot;<p>Our team consists of 2 of the top 100 Ruby on Rails contributors, one of the top 10 realtors in South Florida, a market research expert, and an additional senior and one junior engineer. The team is great and entirely remote.<p>Compensation package will include salary and equity, as we want the individual to be driven by our long term success. Relocation is optional, but preferred.<p>The individual needs to be adept in managing and working with a remote team. We are having a lot of success with our remote team, and it will grow to be a real competitive advantage.<p>To apply, send us an email at team @ helloshow.com<p>Technical:<p>• Ruby on Rails expert<p>• Expert writing and interfacing with APIs<p>• Strong to expert with Javascript<p>• Knows a bit about everything<p>• Eager to learn new skills as needed<p>Role:<p>• Experienced with and excited about managing a remote team<p>• Skilled at creating and refining organizational processes and structure for development team<p>• Obsessed with the details<p>• Focused on writing maintainable code<p>• Knows when to build internally and knows when to outsource<p>• Love of building products that people love<p>• Loves learning about everything","time":1406905782,"type":"comment"}