{"by":"kordless","id":8120922,"parent":8120070,"text":"San Francisco, CA - Remote Core Team Members for the Utter.io Project<p>See <a href=\"http://stackmonkey.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;stackmonkey.com&#x2F;</a><p>---<p><i>Introduction</i><p>Utter.io is like AirBnb for excess compute: The utter.io project provides fast location and provisioning of compute resources within a cooperative set of systems managed by OpenStack operators. Resource accounting inside the network is settled with Bitcoin and purchases of compute instances can be made by users without an account. Additionally, groups of operators can form adhoc hybrid clouds, allowing fast scaling and sharing of excess compute resources between trusted entities. If you are familiar with cloud terminology, this idea may be one possible solution to some of the challenges in achieving a global cloud federation.<p>It is my belief that crypto currency technologies can bring a new category to the existing cloud offerings of compute, storage, and network. That new category is trust. While conversations about how crypto currencies affect our financial systems are definitely interesting, paying for compute, storage and network with stored trust is an awe inspiring vision of the future.<p>More information is available on the public Github repos for the project (keep in mind the utter.io site is not live yet): <a href=\"https://github.com/StackMonkey\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;StackMonkey</a><p>The fund raise for the company will be done using decentralized raise methodologies sometime in late September via token issuance similar to Maidsafe or Storj.<p>---<p><i>Objectives and Team Overview</i><p>This is a pre-raise, core team buildout of roughly 4-5 individuals who will join me in an Open Source project that spans two distinct technologies: OpenStack and Bitcoin.  Individuals are expected to be experts in at least one of these fields and moderately versed in the other.<p>I am 47, well versed in both technologies, program in Python&#x2F;JavaScript, have written all the software to date in the repositories, have started, run and exited other startups, live in the SF Bay Area, excel at fund raising, marketing, leading, and enabling individuals to grow in their careers.  I believe passionately in this project because infrastructure is meant to be open, transparent and trustworthy.  To me, there is not greater cause and it is now my life&#x27;s mission to see this vison to fruition.<p>---<p><i>Desired Skills</i><p>Work will need to be conducted around operational crypto contracts, scheduling of Bitcoin micropayments, integration of blockchain nodes in the appliances, decentralized SSL tunnel solutions, OpenStack deployment methodologies, OpenStack SDN and general network architecture, distributed systems architecture, Python application frameworks, including AppEngine and Flask,  UX&#x2F;UI&#x2F;design experience with operational software, and developer focused evangelism.<p>If you find this opportunity interesting, worthy of your passion and you are looking at a 2-3 month timeframe for a change in your career, please drop me a line.  I&#x27;m kordless at stackmonkey dot com.<p>Thank you for reading and best of luck in all that you do!  These are exciting times.","time":1406909375,"type":"comment"}