{"by":"Moocar","id":8120758,"kids":[8180284,8120954],"parent":8120070,"text":"WalmartLabs - Clojure Developer. San Francisco (full time) or US remote.<p>You can work on Clojure at quite a few companies, but rarely can you impact millions of people at such a personal level. Walmart&#x27;s mobile apps are highly rated and the services we write to support them are the base of that success.\nWe started from a small company acquisition with a single product. Today, we power a platform and a suite of products running on mobile devices and systems in retail stores.<p>Our team has a unique environment. We&#x27;re still a small, flat team of engineers. We work with our own tools and make our own build-or-borrow decisions. Our culture is a healthy mix of sharing and pushing each other to be better at our craft. For example, we pair program when it best suits the task. We use pull requests &amp; code reviews liberally. We make refactoring time. We deploy often, with a single line of code run from a REPL. Engineers on our team are challenged to work through our full software stack and be part of our product and project management. We believe that people are more engaged, fulfilled and happy when they feel responsible for actually shipping their work.\nWhat we&#x27;re all about<p>The environment at WalmartLabs balances moving fast and breaking shit, with the knowledge that we could break shit for 140 million people every week. It&#x27;s a tough balance but we&#x27;ve found the payoff to be worth the challenge and responsibility.<p>Some aspects of our work that are important to us:<p><pre><code>  - high performance distributed systems\n  - robust &amp; well-factored codebases\n  - simple &amp; fast deployments\n  - automating the hell out of operations\n  - thorough system test coverage\n  - managing our own development process and work backlog\n  - pair programming when it makes sense (locally and remotely)\n  - contibuting back to the clojure &amp; open source community\n  - having an engaging team culture and environment\n</code></pre>\nWhat we do:<p><pre><code>  - write all our production systems &amp; tools in Clojure\n  - create and orchestrate massive distributed systems\n  - spin up RESTful web services for consuming &amp; ingesting large volumes of data\n</code></pre>\nWe are just a part of:<p><pre><code>  - Walmart is the world&#x27;s largest retailer and one of the world&#x27;s top online \n    retailers. The scale of challenges and potential impact is enormous.\n  - Walmart is actually a group of retail businesses spread all over the world\n    including Sam&#x27;s Club, Asda (UK), Massmart, Walmart International\n  - WalmartLabs is a software development shop responsible for tools, platforms \n    and applications for new products in all Walmart businesses. These \n    include platform tools, data analytics &amp; machine learning, search engines, \n    mobile applications and physical retail tools.\n  - WalmartLabs Mobile builds mobile applications and backend services for all \n    Walmart businesses.\n</code></pre>\nDoes this sound like something you&#x27;re into? Shoot me an email at amarcar@walmartlabs.com<p>Edit: formatting","time":1406908565,"type":"comment"}