{"by":"akubicek","id":8120830,"parent":8120070,"text":"Understory - <a href=\"http://www.understoryweather.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.understoryweather.com</a> - Boston, MA<p>About Us:<p>Understory isn&#x27;t your typical company using an agile social-based platform that mobilizes advertising with real-time commercial insight -- wait, actually, we aren&#x27;t a advertising company at all. Understory builds weather grids that create real data and use it to provide analytics to enterprise companies so that they can see how to respond to severe weather disasters. And maybe, just maybe, help humanity along the way with better thunderstorm, hail, and tornado predictions.<p>Understory currently is a team of five people and, with our recent funding of $1.9 million, we are adding some new members to the team. Our team works hard, but also takes time to let off steam -- playing board games, heading to the local climbing gym (company provided membership), and having a beer around the Understory kegerator.<p>Our team is excited as we are currently deploying weather stations out in the field and receiving our first datasets, come join us on the ground floor of building a completely new data set and platform that has a huge impact on everyday life!<p>If that sounds like something you are interested in, check out our positions!<p>* Back End Engineer * Data Scientist *<p>------------------------------------------------------------------------------<p>Back End Engineer<p>Blend open-source technology with proprietary hardware to deliver real time data to customers quickly and efficiently. Build the robust interface between the weather stations and the web so that not a single data point is lost. Be on the ground floor of Understory - as we are building out our software team and make the technology choices that will be the structure for our platform. Work with our data science team to implement algorithms that predict thunderstorms and their outcomes.<p>------------------------------------------------------------------------------<p>Data Scientist<p>Use statistical, signal processing, and machine learning techniques with our proprietary sensor data to help solve the current data sparsity problem. Use findings from our local grids to improve the picture of nation-wide weather effects. Explore the business opportunities for such high density data in the current market of sparse data. Join the team that will revolutionize weather data.<p>------------------------------------------------------------------------------<p>If you are still interested after reading all of that and think you would be a great fit for Understory, please see the full job descriptions at <a href=\"http://understory.theresumator.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;understory.theresumator.com&#x2F;</a> or email me for more information at info(at)understoryweather(dot)com.","time":1406908918,"type":"comment"}