{"by":"answers","id":8120594,"kids":[8120700],"parent":8120070,"text":"Answers - St. Louis or Mountain View (VISA)\nMobile Android Developer<p>The successful candidate will be part of an engineering team devoted to the design and development of the Android and Google Glass applications, the backend API systems and various supporting tools.<p>You will work closely with product and engineering management to satisfy user interface requirements, and work with QA to design tests and walkthroughs. The engineer will also work closely with the iOS team to provide consistent feature set and user experiences across different platforms.<p>Responsibilities:<p>Design and implement new features in our Android mobile app.\nResponsible for thorough testing of the Android app in different devices\nContribute to business and marketing strategies towards the goal of million downloads in 2014.\nContribute to the design of UX and UI in the Android app\nContribute to the UX design and the technical implementations of the new Google Glass app.\nWrite thorough, comprehensive technical and high-level documentation\nMentor junior engineers in company standards and development practices to help them become quality software developers\nRequirements:<p>3+ years programming experiences with Java\n2+ year programming experience with Android\nDetailed understandings of the Android ecosystem and the challenges in testing.\nProficient knowledge of the database technologies. MySQL preferred.\nProficient knowledge of the LAMP stack development.\nBS in Computer Science<p>Preferred:\n5+ years experiences in JAVA\n3+ years experiences in Android\n1+ year experience in LAMP development\nMS in Computer Science.<p>What&#x27;s the gig:\nDevelop the technology that powers 180+ million monthly unique visitors\nCollaborate within a team of fervent technology enthusiasts\nWork with the largest internet players, building software that significantly impacts vertical markets\nFun and exciting atmosphere where hard work is recognized and rewarded\nCompensation:<p>Highly competitive base salary + bonus + opportunity for Incentive Equity Units (similar to stock options with favorable tax treatment)","time":1406907540,"type":"comment"}