{"by":"dkaufman16","id":8121098,"parent":8120070,"text":"Kitchensurfing - New York, New York\n<a href=\"http://www.kitchensurfing.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kitchensurfing.com</a><p>--------------------------------------------------<p>What we&#x27;re doing:<p>- Kitchensurfing is an online marketplace where users can find outstanding local chefs to cook for them, at home. Our core mission is twofold: to provide a platform for chefs to grow their independent businesses, while making it possible for people to connect over great food.<p>- Line chefs at the nicest restaurants in the world make at most $12-15&#x2F;hour, yet the food they make is sold to diners at a hefty markup. We&#x27;re trying to bridge the gap.<p>- People are conditioned to expect great food in restaurants — and rarely elsewhere. We want to change the way people eat, while preserving the efficiency and hospitality of a great restaurant experience.<p>- Most internet service companies attempt to decrease human interaction through software efficiency. We’re building a company that does the opposite. We think there&#x27;s something magical about having a chef in your kitchen while you relax and enjoy the company of your guests.<p>How we&#x27;re doing it:<p>- We’re committed to code quality and productivity. With those values in mind, we pair program, test drive and practice continuous integration in a Rails environment. We don&#x27;t work &#x27;startup hours&#x27;, just normal ones.<p>- We&#x27;re a small team (currently 6 engineers). We rotate often between pairs and across projects.<p>- We deploy code whenever we finish a feature. As an example, last week we deployed to production 35 times.<p>- We have a collaborative culture where engineers work directly with product managers and designers to find the best solution to user problems.<p>- We work out of a townhouse in Gowanus right now, but are moving to Soho very soon.<p>Who we&#x27;re looking for:<p>- You&#x27;re interested in working with Rails and pair programming the majority of the time. You want to write tests for any feature you implement.<p>- You&#x27;re more interested in building a great product and shipping features than you are in figuring out the cleverest solution to a problem.<p>- You want to enjoy coming to work each day.<p>My name is Dan, I&#x27;m an engineer here at Kitchensurfing. If you&#x27;re interested in learning more, please get in touch: dan AT kitchensurfing DOT com","time":1406910181,"type":"comment"}