{"by":"azth","id":8121341,"kids":[8122280],"parent":8120070,"text":"Web Front End Engineer [FULLTIME, SAN MATEO, CA]<p>You will be responsible for designing and implementing the user interface for a brand new data processing system to detect advanced security threats using the latest stream processing and machine learning techniques.\nYou’ll be architecting and implementing the user interface and middle tier for the first generation of our service and you will be the foundation of our web engineering team. You will work with all parties in the company to define and provide a powerful yet simple and intuitive user interface that will be one of the key differentiators of the product.<p>You are a strong software engineer who is passionate about building elegant, simple, and stick user interfaces to delight customers. You care about producing clean, elegant, maintainable, robust, well-tested code; you enjoy collaborating with others to come up collectively with the best possible solution. You have experience with performance, scalability, and reliability issues of large 24x7 systems.<p>Responsibilities:<p>• Design and development of a rich user interface for a mission critical data processing and analytics application using Web front-end technologies<p>Requirements:<p>• Solid programming experience designing and writing well organized, clean, and extensible code<p>• Experience with some modern front-end technologies that \nbuild Rich Internet Applications using\nJavaScript, CSS, HTML5<p>• Ideally experience using JQuery, backbone.js, underscore.js<p>• Appreciation for high quality user interfaces and interest in user interaction<p>• Self-motivated, detail-oriented and strong analytical &#x2F; problem solving skills<p>• Bachelor&#x27;s Degree in computer science or equivalent experience<p>Why work at Exabeam?<p>• Unique opportunity to be part of a founding engineering team to help define and shape a brand new product for a huge business problem. Unique chance to start writing code from scratch.<p>• Work with a top-notch team of smart, motivated engineers, pushing the envelope to produce the most advanced real time security data processing engine<p>• Technically challenging and very interesting problem. Opportunity to work with the latest technologies in distributed systems, machine learning and high volume data processing<p>• Strong team with deep security and technology expertise<p>• Well funded company","time":1406911713,"type":"comment"}