{"by":"mischat","id":8121012,"parent":8120070,"text":"State (www.state.com) - Hiring Android developers and more in London - check out <a href=\"http://jobs.state.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.state.com&#x2F;</a><p>Based in London, State is looking for people like you to join our highly skilled, energetic, and creative team working at the forefront of technology. State was founded by Mark Asseily (Rebtel, Skype) and Alex Asseily (founder and chairman of Jawbone) and is advised by some world’s most influential people such as Tim Berners-Lee, Nigel Shadbolt, and Deepak Chopra.<p>Lead Android Developer - <a href=\"http://jobs.state.com/apply/n7iXQD\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.state.com&#x2F;apply&#x2F;n7iXQD</a><p>In this role you will lead the development of our Android app working alongside our team of world-class developers. The app is highly interactive with an innovative visual style, and is a core component of our vision to create the world’s opinion network.<p>We have only just gone public with State, so this is a great opportunity to join the team early and to make your impact on the world.<p>Experience<p>You have created multiple commercial, native Android apps on the Play Store that have widespread usage and are built on top of web services.<p>Skills<p>* Strong Java skills\n* Expert knowledge of the Android platform and its core frameworks\n* Familiar with Git&#x2F;Distributed version control, agile development and code reviewing\n<i>Familiarity with 3rd party libraries such as Dagger, Retrofit, Gradle, Robolectric, etc\n</i>Familiar with API design, networking, caching and complex modelling issues for highly interactive apps<p>Culture<p>You thrive in a fast moving, creative, and challenging environment. You are a team player, you can take initiative, you experiment - nothing here is static. Bring a sense of humour and help us change the world.<p>If reading this is getting you a bit excited, do not waste any more time and get in touch with us. We would love to meet you.<p>To apply please email me, Mischa Tuffield (State CTO) on mt[at]state[dot]com","time":1406909763,"type":"comment"}