{"by":"lowglow","id":8121804,"parent":8120070,"text":"Maker Media (makerfaire, makezine) is Hiring a full-stack hacker (rails, node, web apps)<p>Description:<p>When you look up and out over the city, does your mind drift towards questions about how the world works? Do you feel like you could do more than what you&#x27;re doing now? Deep in the vast blue grand planet there exists a voice calling you, growing from a whisper all the way to a roaring rush of inspiration: Build.<p>We want to do great things too. We want to inspire this driving voice in others. We&#x27;re a small group inside of Make (makezine, makerfaire, etc), that is setting out on a journey to explore how people interact, share, and publish their experiences online. This isn&#x27;t code for stealth mode, you&#x27;ll be shaping a product from its inception, launch, and beyond.<p>We&#x27;re looking for critical thinkers that also want to bring smart talent to the pack. If you enjoy building projects from scratch, wearing many hats, and learning a lot along the way, then this is your place.<p>These are some of the things we&#x27;re immediately looking for:<p>- Full-stack developers with startup experience. (Experience scaling is a big plus)\n- JS (Front-end frameworks)\n- Rails, Node\n- Postgres, MongoDB, MySQL, etc (Use what works)\n- Bonus: Having read Diamond Age, Snow Crash, Neuromancer\n- Extra Bonus: Interest in Machine Learning<p>What we offer:<p>- Typical equipment you would expect: Laptop, Monitor, Food&#x2F;Snacks\n- Free passes to Make events<p>Our culture:<p>- On Fridays, we&#x27;ll build extracurricular software&#x2F;hardware projects. Want to learn how to use an oscilloscope, code some microcontrollers, build an autonomous robot, or talk to a satellite? Cool. We&#x27;ll hack on that.\n- We have access to awesome amounts of makers. We&#x27;ll bring some of them in every month to chat with us.\n- We&#x27;re also right by the Exploratorium: Expect field trips.<p>Find out more:<p>Send us an email with some projects you&#x27;ve created. Bonus points for launching and having actual battlefield stories.","time":1406915881,"type":"comment"}