{"by":"AngularJobs","id":8121035,"parent":8120070,"text":"Recent Grads! Join LaunchHub to help Solve Industry Shaking Problems w&#x2F; BigData. Palo Alto, CA<p>&gt; <a href=\"https://www.angularjobs.com/posts/1081-recent-grads-join-launchhub-to-help-solve-industry-shaking-problems-w-bigdata-palo-alto-ca\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;posts&#x2F;1081-recent-grads-join-lau...</a><p>===<p>&quot;Competitive compensation, Elite experience required. Work w&#x2F; High Traffic clients, Machine Learning, and next generation user interfaces.&quot;<p>About LaunchHub<p>===<p>- A SaaS-based program for Marketers, specifically providing data analysis for apps<p>- Helps very high traffic clients, TB of data, analyze and implements Machine Learning to help marketers improve their ROIs.<p>- “We take historical app store data, app engagement data, and marketing data and we model out installs, engagement, and revenue.”<p>- 2 customers with Top 200 apps in iTunes<p>- 12 team members, 5 in Palo Alto and 7 remote.<p>- Product site: <a href=\"http://www.getlaunchhub.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.getlaunchhub.com&#x2F;</a><p>Required Experience<p>===<p>- B.S or M.S in Computer Science or Engineering from a top university (they gave me a long list found in attached Job Description)<p>- GPA 3.5-4 (unless a good reason why not) or Strong experience<p>- Employment at Experience Companies(Google, Facebook, Apple, LinkedIn, Amazon, Microsoft, Yahoo, EBay, Netflix, Twitter, Horton works (yahoo), cloudera, rackspace, IBM, Oracle, HP, Adobe, Walmart Labs)<p>- Knowledge of Javascript (Angular) and related web technologies like HTML, CSS<p>- Demonstrated design and UX sensibilities<p>- Awareness of cross browser compatibility issues<p>- Understanding of client side performance characteristics<p>- Knowledge of relational databases and SQL, preferably MySQL<p>- Bonus: Experience with C, C++ a plus<p>- Bonus: Experience working with backend systems<p>Notes about the Job<p>===<p>- Dashboard environment will be the Angular Javascript framework.<p>- Knowledge of CSS is valuable.<p>- Develop interactive directives&#x2F;elements<p>- Write API specifications and documentation<p>- Integrate the frontend using REST APIs<p>- Work closely with our product and design teams to define feature specifications<p>The Process<p>===<p>- Pre-Phone Interview<p>- Phone Interview<p>- 1 or 2 technical interviews<p>- Onsite to hire<p>Compensation &amp; Benefits:<p>===<p>130K - 180K (&#x27;Competitive&#x27;)<p>Apply here:\n&gt; <a href=\"https://www.angularjobs.com/apply/1081\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1081</a>","time":1406909866,"type":"comment"}