{"by":"taber","id":8121287,"parent":8120070,"text":"VERBA - San Francisco, CA\njobs@verbasoftware.com\n<a href=\"http://www.verbasoftware.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.verbasoftware.com&#x2F;</a><p>* Senior Rails&#x2F;JS Product Focus - FULL-TIME or HALF-TIME with benefits<p>We&#x27;re making higher education more affordable: Helping students compare their bookstore’s prices to those of its online competitors; Giving recommendations on close-to-market bookstore prices; Getting professor book choices in faster; Helping bookstores buy and sell books on a level playing field.<p>We guide every stage of a used book’s life. We help students save money, and bookstores become and stay relevant, competitive, and transparent.<p>Metrics: 350 colleges and universities, serving 4.5 million students, tracking ~200k unique book titles, integrating with 7 vendors &amp; 20 retailers, raising the “win rate” for bookstores to 80%, and dropping prices across the board. 17 employees, 3 part-time. 2 dogs. 5 cats. 3 children.<p>Profitable. Growing.<p>Code: Ruby, Rails, JS (Coffeescript&#x2F;Backbone), Clojure for Hadoop, MySQL on RDS, AWS w&#x2F; Chef. We love experiments and go with what works! We also love making a stable, solid product which is why we have a ton of metrics and a one-click build pipeline.<p>What’s in it for you: A great team and company culture, benefits (even for part time!), a laptop, unlimited books, BART pass, pool table, healthy (and un-) office snacks, great conversation during our yearly company work-cations, and hard, challenging, fulfilling, good (in the public sense) work.<p>Message us if: You want to help make education better. You’ve got strong Rails knowledge (several years worth), solid testing practices, a good head for architecture, and know enough JS to help out on front-end. A stats background, experience with Hadoop and knowledge of scheduling algorithms would be awesome, but not required.<p>How to get the job: Write a cover letter to jobs@verbasoftware.com that speaks to why this job might fit with you, and how you could help us out. The first step is a phone screen to solve a small programming problem. Then we’ll schedule an on-site interview for a few hours, where you&#x27;ll present for 15 minutes on any topic you&#x27;d like, have you walk through some of our code with us, and then deep-dive into the whole stack. Also we’ll ask you some historical behavior questions, not logic puzzles. Then we’ll make you an offer, and you’ll accept and we have a new employee party!<p>(And now a personal message from me!)<p>I came for the people. I&#x27;ve been at a few companies, I&#x27;ve written a lot of code, and in the end it&#x27;s who you spend every day with that matters and shapes you.<p>The problems of higher education are many, and this is just one avenue of attack, but it&#x27;s a fantastic start. Books are simply way too expensive.<p>What surprised me the most when joining was that everyone in the company is very kind, that their customers LOVE them, and everyone is highly performing. This doesn&#x27;t mean that everyone just works long hours and burns out - no, it seems everyone is careful about being at their mental peak and intend to stay that way. This informs every aspect of the culture here: planning, creating, getting feedback, paying off technical debt, retrospectives, always thinking about how to work better and more easily, time off, going to conferences, health care, 401k. Everything.<p>It&#x27;s like this company wants to stay around for a long time or something.<p>JOIN US AND MAKE EDUCATION GOOD","time":1406911356,"type":"comment"}