{"by":"thackerhacker","id":8121693,"parent":8120070,"text":"Code Trip - London, UK (Remote welcome)<p>C# Lead Engineer on new Marketplace platform\nCode Trip London, UK (allows remote)\n<a href=\"http://www.codetrip.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;www.codetrip.co.uk</a><p>==The story==<p>Over the last year we have written a new full-featured Marketplace eCommerce solution from scratch.  Our client base is now increasing so we need more development firepower.<p>We&#x27;re looking for someone to help us mature and grow the platform to cater for the varied needs of our clients while ensuring it remains unified and coherent and preventing it splintering into a million special cases.<p>We are a bootstrapped startup which means we need our software to help us out as much as possible.  This means it needs to be automated, reliable, flexible, comprehensible.  Monitoring and diagnostics are key.<p>==Skills &amp; Requirements==<p>Above all you need to be a generalist and a self-starter and see no boundaries to the technical work needed to make things work right.  You will bring the size of the core development team to 3 and between us we tackle everything from application code to investigating problems to proactive monitoring to deployments to JavaScript in the browser.<p>This is a C# project so you really should be very comfortable with C# and .net.<p>We use RavenDB.  If you don&#x27;t know what this is - go and read about it.  Working with it is just brilliant in so many ways.  Experience of Raven would be a fantastic bonus but it&#x27;s so easy to use you can learn it on the job - so not essential.<p>You should be comfortable with JavaScript and jQuery and at least have an understanding of CSS.<p>==In summary, must-haves==<p>- C#\n- great communication skills\n- a can-do attitude\n- ASP.NET MVC\n- experience of working in eCommerce or some other fast-moving consumer-facing web app<p>Experience of any of the following would be helpful:<p>- RavenDB (or other document db)\n- Lucene\n- git\n- building platforms with an configurable workflows, behaviours, themes, plugins, etc\n- JavaScript &#x2F; CoffeeScript\n- Azure\n- Payment Providers (Stripe, PayPal and others)<p>==This is a huge task but the rewards are equally great:==<p>- reusability is a goal: and nothing is more satisfying for a developer than successful reuse\n- our clients tend to be startups themselves, so you get to help create not one but multiple new businesses \n- as an early-stage employee, you can share financially in the success you help bring about\n- We want to build our team out with talented, self-starting developers.  This is an amazing opportunity to work in a developer-led company, using great technology on a product that is getting more and more popular all the time.<p>Remote working: Ideally we would like someone within commuting distance of London but we welcome applications for remote working for exceptional candidates with fantastic communication skills and a successful track record of remote working.<p>Please contact gaz@codetrip.co.uk","time":1406914696,"type":"comment"}