{"by":"jacobheller","id":8121882,"parent":8120070,"text":"Full-stack developer | Casetext (YC S13) | Palo Alto, CA<p>E-mail us at jobs@casetext.com<p>We are looking for a full stack engineer with design talent to help us rethink the way that people read, understand, and annotate texts.<p>Your mission will be to work with Casetext&#x27;s full stack and take substantial ownership over large parts of the code. (A sneak peek of the new site is at <a href=\"http://beta.casetext.com.\" rel=\"nofollow\">http:&#x2F;&#x2F;beta.casetext.com.</a>)<p>We aren&#x27;t looking for experience with a particular set of languages. Instead, you should be comfortable collaborating with other engineers on a diverse software architecture. Our front-end is a single-page AngularJS application written with Jade and Less.js that uses Firebase, a cutting-edge real-time datastore, to make the site incredibly fast and responsive. Our back-end stack includes ElasticSearch, NodeJS, Go, and Python.<p>ABOUT CASETEXT<p>Casetext&#x27;s mission is to make all the world&#x27;s laws free and understandable. We have amassed an enormous database of legal texts, starting with over two million U.S. judicial opinions. A community of law professors, lawyers, law students, and citizens are adding insight and explanations. \nCasetext is disrupting an $8 billion legal research market currently controlled by a duopoly (Westlaw and LexisNexis) that has barricaded quality legal information behind a paywall.\nThis is an opportunity to be an early employee at a rising start-up, take on a lot of responsibility, and play a substantial role in the future of the company. We are extremely selective with who we hire, but we make sure that our early team-members are well compensated in equity, salary, benefits, and quality of work.<p>You’ll be working with engineers from Google and IBM, the president of the Stanford Law Review, and former practicing attorneys from Yale’s and Stanford’s law schools. We are a Y Combinator company (Summer 2013) and have raised a seed round of over $1.8 million.<p>Perks include health&#x2F;vision&#x2F;dental, meals and snacks covered, and transit. We&#x27;re in Palo Alto, blocks from the Cal. Ave. Caltrain.<p>E-mail us at jobs@casetext.com.","time":1406916606,"type":"comment"}