{"by":"stu0590","id":8121783,"parent":8120070,"text":"Amazon is hiring in Austin, TX (Yes, you read that right.)<p><a href=\"http://www.amazon.jobs/job/271764/web-development-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.jobs&#x2F;job&#x2F;271764&#x2F;web-development-engineer</a><p>== Web Development Engineer, Austin, TX ==<p>Job Description<p>Amazon.com, along with being a retail and technology company, is an inventive research and development company that designs and engineers high-profile devices like the Kindle family of products. We have worked to produce best-selling tablets with breakthrough hardware technology, e-readers that have revolutionized reading, and Fire TV, a tiny yet powerful way to watch the best movies and TV shows in the comfort of your living room. What will you help us create?<p>Work hard. Have fun. Make history.<p>Online and Device Services team owns critical applications and backend services. The team has the charter to innovate customer experience avenues that will push the boundaries of customer-device interaction of devices.<p>We are seeking an experienced Web Developer to design interfaces for our customer facing self-service tools and agent facing CRM system. We aim to build code we can reuse. The interfaces will be internationalized into multiple languages and will need to be optimized for a variety of devices. You should be a talented and experienced front-end developer with expertise in web UI and AJAX-based interactive application development. You should have a solid background in the fundamentals of software development, and have a deep understanding of best practices in various languages&#x2F;technologies. You should love creating things and take great personal pride in building engaging and innovative interfaces.<p>Qualifications<p>· Experience in XHTML, Javascript, CSS and general Web 2.0 techniques\n· Experience developing AJAX interfaces with AJAX libraries and frameworks (e.g. YUI, DOJO, JQuery, Prototype, etc.)\n· Experience in a Unix&#x2F;Linux environment\n· 3+ years of software development experience\n· Bachelor&#x27;s degree or equivalent experience<p>Preferred Qualifications<p>· OO design and coding skills in Java\n· Passion for creating efficient, scalable web interfaces\n· Familiarity with scripting languages (e.g. PHP, Ruby) is a plus\n· Experience in Struts, Swing or JSP\n· Experience with AngularJS\n· Understanding of web services technologies such as SOAP, HTTP, WSDL, XSD, and REST\n· Degree preferably in computer science or a similar technical discipline\n· Genuinely excited about technology, have a strong interest in learning about and playing with the latest technologies and building compelling web applications and UI\n· Must be a self-starter and motivated<p>Amazon is an Equal Opportunity-Affirmative Action Employer – Minority&#x2F;Female&#x2F;Disability&#x2F;Vet","time":1406915643,"type":"comment"}