{"by":"voleon","id":8121505,"parent":8120070,"text":"Voleon Capital Management - Berkeley, CA <a href=\"http://www.voleon.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.voleon.com</a><p>Senior Deployment&#x2F;DevOps Engineer: full-time, on-site<p>Fast-growing science- and technology-driven company seeks a Senior Deployment&#x2F;DevOps Engineer. You will work with the RnD, Software, Infrastructure and Trading teams to develop, test, deploy, and manage research and production software.<p>About Us:<p>We apply statistical machine learning to develop automated trading strategies and systems. Our success is dependent upon the predictive power of our models rather than speed. The team includes our research staff as well as a group of exceptional software and IT professionals who are building our next-generation software and hardware infrastructure. We have a collegial, academic working environment, rely on open source software, and have built our own software stack.<p>The Position:<p>Focus areas include creating software infrastructure for our research department and production trading systems, as well as supporting the next generation of our compute and storage hardware systems. We seek a candidate who can bring both development and operations skills to rework existing software infrastructure and guide testing&#x2F;automation of new and ongoing deployments.<p>Qualifications:<p>* Experience with Unix-like OSes and open-source technologies<p>* Proficiency in at least one programming language<p>* Experience leading the deployment and maintenance of critical software systems<p>* Experience in operations for highly available services<p>* Experience designing and implementing processes for continuous integration<p>* Experience with configuration management and IT automation<p>* Track record of supporting multi-developer software projects<p>* Knowledge of databases and database administration<p>Additional Skills (Not Required):<p>* Knowledge of distributed systems, cluster computing, and fault tolerance<p>* Industrial experience as a software engineer<p>* Experience working in a technology-focused startup<p><i>A background in finance is not required.</i><p>devops.working@voleon.com","time":1406913018,"type":"comment"}