{"by":"benpotter","id":8121976,"parent":8120070,"text":"Corvallis, Oregon\nSr Backend Web Developer\nOptiTrack Motion Capture<p><a href=\"http://goo.gl/1uPTAa\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;1uPTAa</a><p>We’re NaturalPoint, the worldwide leader in the design and manufacture of motion capture cameras, software and solutions. We’re the perfect blend of a successful company that’s been around for 17 years with the flexibility and culture of a cutting-edge startup. Our clients include Activision, KMEL Robotics, NASA, Google, Nike, Lockheed Martin, MIT, USC School of Cinematic Arts and many more.<p>We’re looking for a full stack web developer that loves architecting and building exceptional websites. An ideal candidate will work well in a compact fast-moving team with project managers, designers and other developers, gets excited about working with high-profile clients, and is meticulous about writing rock-solid code.<p>Must haves<p>BS in a technical discipline (e.g. CIS, CS, Engineering) and&#x2F;or extensive industry experience.\nMastery of one or more web development languages such as PHP, Perl, Python, and Ruby on Rails.\nStrong working knowledge of SQL and query optimization (MySQL&#x2F;PostgreSQL)\nFamiliarity with common web server applications (Apache, Nginx)\nWorking knowledge of source control systems (Perforce, Git, etc.)\nPassionate about evolving web technologies and standards.\nA talent and drive for simple, clear communication while managing multiple projects.\nKnowledge of security best practices.\nReally nice if you have<p>Experience building large-scale, enterprise-grade web applications.\nExperience integrating with third party web services (payment gateways, shipping vendors, etc.).\nExperience with NoSQL databases, memcached, Cassandra\nUnderstanding of standards and best practices for web-development, database architecture, application security and PCI compliance\nExperience with automation using scripting languages (e.g. shell script, etc.).\nFamiliarity with front-end web-development languages (JavaScript, HTML, CSS etc.).\nExperience with web automation and build tools (Yeoman, Grunt.js, Gear.js, etc.).\nExperience with client-side JavaScript web application frameworks (Ember.js, AngularJS, Backbone JS).\nIf you’re still interested, send us<p>An email or cover letter explaining why you’d be a great fit at NaturalPoint.\nA resume that outlines your skills and experience.\nAny links to online portfolios, code samples, or previous work you’ve done.\nBenefits\nEmail to ben.potter [at] naturalpoint.com<p>Competitive salary\nNew development equipment\nGreat work environment\nHealth benefits\nPaid vacation\nRelocation assistance\nThis full-time position is based in our new Corvallis, Oregon campus where we enjoy a fast-paced and engaging work environment and good work&#x2F;life balance. No phone calls, please.","time":1406917532,"type":"comment"}