{"by":"alexfelmeister","id":8121103,"kids":[8121207],"parent":8120070,"text":"Analyst&#x2F;Programmer \nThe Children&#x27;s Hospital of Philadelphia \nCenter for Biomedical Informatics\nApplication Development Team\nPhiladelphia, PA<p><a href=\"https://www.chop.edu.apply2jobs.com/ProfExt/index.cfm?fuseaction=mExternal.showJob&amp;RID=33779&amp;CurrentPage=1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.chop.edu.apply2jobs.com&#x2F;ProfExt&#x2F;index.cfm?fuseac...</a><p>We are hiring talented developers who want to work in a start-up type environment creating new novel software within a large academic medical center.  Everything we do affects the health of Children.  That’s our primary mission.<p>The Analyst&#x2F;Programmer in Enterprise Translational Informatics at the Center for Biomedical Informatics (CBMi) is responsible for supervised development and implementation of highly creative and reliable tools in order to optimize informatics solutions in the research setting for bio-repository studies and enterprise translational informatics solutions. Most projects will relate directly and indirectly to the Children’s Brain and Tumor Tissue Consortium, but will have wider enterprise implications. This position demands an individual with superior technical programming skills who can quickly apply this knowledge to define a “best path” for a wide variety of projects. The Analyst&#x2F;Programmer will develop solutions for a fairly complex organization to yield deliverables such as bioinformatic analysis modules that utilize large and complex data types, data extraction&#x2F;analysis modules that are dependent on complex underlying healthcare data systems, and process-oriented modules that help maintain patient privacy and further the efficiencies in biorepository studies.<p>The programmer&#x2F;analyst will work closely with the Applications Research team in Translational Informatics to understand and execute on client requirements, design of solution sets, coding, testing and implementation for programming projects that affect the bio-repository and translational research community. The individual will be able to very quickly and independently translate requirements from disparate functions into deliverables that are immediately high in quality, extensible as defined by a long-term strategic plan, and intuitively accessed and utilized by users.","time":1406910194,"type":"comment"}