{"by":"samstave","id":8121141,"parent":8120070,"text":"SF Ca - Cognitive Networks:<p>-- Sr. Software engineer (Data&#x2F;Data Scientist)<p>---<p><a href=\"http://www.cognitivenetworks.com/senior-software-engineer-data/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cognitivenetworks.com&#x2F;senior-software-engineer-da...</a><p>---<p>Job Description<p>We’re looking for a senior engineer to help us build out our automated video content recognition (ACR) system.  Our ACR platform processes several million transactions per second at peak volume today – and we’re just getting started.  Soon we expect to process a higher input volume than any startup in history – and we’ll transform the television industry.   This is a unique opportunity for someone looking to take on big challenges and grow professionally in a well-financed startup poised to change the TV industry.<p>Responsibilities<p>We operate a cross-functional team that specializes when needed but aims to have everyone able to contribute.   Duties of  the Senior Software Engineer (Data) includes:<p>Implement and optimize data processing pipeline for terabytes of data<p>Own our data warehouse as well as real-time data reporting systems<p>Formulate metrics quantifying performance of advanced data systems<p>Design, build and use tools to understand our product platform behavior and performance<p>Design and conduct experiments to test concepts, implementations, and algorithms<p>Implement analytics tools to maximize the value of collected data<p>This role is not a research or analytical role.  This is a senior individual contributor role who is expected to contribute production solutions.  Our goal is a developer who is extremely strong in data science rather than a data scientist with limited coding skills.<p>We don’t use Hadoop now but we have not ruled it out.  This is not a run of the mill Hadoop role – this is a senior lead role that will own the entire data pipeline stack.  We currently use AWS RedShift as a big data backend and strongly desire someone with very large data warehousing&#x2F;ETL experience who are also very strong in python.<p>Desired Skills and Attributes<p>Significant real-world experience developing real products at large scale<p>Extremely strong programming skills in python – this is a MUST HAVE<p>2+ years experience working with large amounts of real data<p>Very strong SQL skills, ideally in PostgreSQL or Amazon RedShift<p>Strongly Desired: Expertise in applied statistics<p>Able to communicate findings clearly to both technical and non-technical audiences<p>A strong passion for empirical research and answering hard questions<p>Excellent Linux skills – must be totally comfortable at the command line<p>Team player – demonstrated experience on a team that shipped a product<p>Professional developer – experienced with source control and bug tracking<p>Practical-minded – chooses stability&#x2F;reliability&#x2F;maintainability over shiny<p>Passionate about technology – ideally you build things outside of work for fun","time":1406910430,"type":"comment"}