{"by":"jetcom","id":8121628,"parent":8120070,"text":"Iterable (<a href=\"https://iterable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;iterable.com</a>) - San Francisco, CA<p>Come join Iterable, the next-gen marketing intelligence platform for ecommerce. Email usage is changing, but the technology and capabilities haven&#x27;t caught up to the 21st century.<p>We&#x27;re a team of hackers and thinkers who are creating a solution for 2014 and beyond. Our team  of ex-Google and Twitter engineers wants to build the technology that powers user growth and commerce. This means writing code that improves the lives of our customers (enterprise ecommerce companies) and their millions of users. One of our top level goals is to build a uniquely fun and growth oriented company culture.<p>Knowledge sharing in any capacity is highly valued here -- are you interested in prediction markets or PGP encryption? Do you enjoy teaching posture techniques or purely functional data structures to others? We pair program, design together, and generally create a learn-and-teach environment here.<p>If you&#x27;re interested in coming on board, you can help with some challenges we face:<p><pre><code>  - Scale our API to beyond millions of requests \n  - Design and write performant, beautiful interfaces \n  - Write software to build machine learned user models \n  - Make data visualizations for our email and user data \n  - Design an immutable infrastructure for our platform\n\n</code></pre>\nSome aspects of our culture that make us different:<p><pre><code>  - We are all very focused on self improvement \n  - Our company has egalitarian and transparent values: work when you want, on what you want \n  - We are chill and empathetic people \n  - The company is completely transparent\n\n</code></pre>\nTechnologies you&#x27;ll work with:<p><pre><code>  - Scala\n  - ElasticSearch\n  - Postgres\n  - Redis\n  - AngularJS\n  - Play Framework\n  - RabbitMQ\n</code></pre>\nYou&#x27;ll get to work with us at our office in Twitter&#x27;s building on Market St. If this sounds like an interesting opportunity for you, please email us: aGlyaW5nQGl0ZXJhYmxlLmNvbQ==","time":1406914039,"type":"comment"}