{"by":"Reinhart","id":8121058,"parent":8120070,"text":"Senior Software Developer (Full Stack) - REDFIN San Francisco<p>Redfin is a technology-powered real estate brokerage with a huge and impactful mission to change the real estate industry in consumers&#x27; favor. We&#x27;re a blend of top real estate professionals and software engineers who wholeheartedly believe that first-class customer service and cutting-edge technology is the ticket. So far we’ve helped over 20,000 people buy and sell homes, saving them over $100M in fees, and doing it all with a 97% customer satisfaction score.<p>We have opportunities on several teams within Redfin:<p>Customer Engagement:  As a senior developer on the Customer Engagement team, you will be responsible for writing features and running experiments to drive more users to Redfin&#x27;s brokerage. Our team has a very broad reach - we touch almost every part of Redfin&#x27;s codebase, and we own our features vertically, from the database schema all the way up to the end-user experience. We run A&#x2F;B tests to bring customers face-to-face with our agents – and turn the winning combinations into real features; we keep our finger on the pulse of the conversion metrics; we understand our business’s needs and build features to address them, and much more.<p>Search Experience: As a senior software developer on the Search Team, your job is to make searching for a home as easy as finding a hipster coffee shop in the Mission. The Search Team takes an incredibly complicated home search process and brings it online into an addictive, fun, and delightful experience.<p>Who you really are : You are a developer who thinks like an end user, who knows that 90% done is only half done, and who can build rock-solid code that will withstand millions of users hammering on it. You love beautiful, simple user interfaces, and you constantly wonder what you could have done to make your last project simpler. You love working with a smart, talented team, because you know that makes you better. When you disagree, you disagree constructively, with respect for everyone else&#x27;s opinions and ideas. More than anything, you share a passion for our mission to radically change the way people make one of the biggest decisions of their lives.<p>The Tools: Our website is built with Java, Spring, JSP, Postgres, Hadoop, Hibernate, HTML, CSS, JS, and various other tools&#x2F;libraries. In production we run on Linux. On our desktops we mostly run Mac and Windows, but some opt for Linux. We use Eclipse, Maven, Git and Bamboo.<p>What you&#x27;ll get from us: Support and resources to continue learning, a brilliant team with which to collaborate, an office in downtown San Francisco close to all the action, and a commitment to your career so you can grow with the company under a management team that has experience building start-ups into profitable, publicly traded companies.<p>Apply: <a href=\"http://jobvite.com/m?3LVuAgwv\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3LVuAgwv</a><p>Another Senior Developer position in Seattle: <a href=\"http://jobvite.com/m?3BYuAgwo\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3BYuAgwo</a><p>Current employee myself and the benefits and people are great:\n<a href=\"http://www.redfin.com/about/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redfin.com&#x2F;about&#x2F;jobs</a>","time":1406909976,"type":"comment"}