{"by":"BrianPetro","id":8121689,"parent":8120070,"text":"Create Beautiful UIs w&#x2F; AngularJS for Support.com in San Francisco, CA<p>&gt; <a href=\"https://www.angularjobs.com/posts/995-create-beautiful-uis-w-angularjs-for-support-com-in-san-francisco-ca\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;posts&#x2F;995-create-beautiful-uis-w...</a><p>&quot;Focus on usability, design, and performance. Earn a competitive salary while getting to work from home 1-2 days per week!&quot;<p>Nexus Software is a SaaS for Managers to be able to see how their support team is performing in handling customer IT product queries. Provide true browser based support (cloud). White label service to big corporations such as AOL, OfficeDepot, Comcast, OfficeMax.<p>Apply Here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/995\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;995</a><p>- Team Size 5-7<p>- Engineering Dept. 60 people total<p>- Agile Scrum Team<p>Background<p>===<p>- B.S. degree in Computer Science or relevant work experience<p>- 4+ years developing JavaScript heavy applications<p>- Extreme focus on usability, UI design and performance<p>- Experience with consuming web APIs<p>- Experience in agile development or scrum<p>Tools<p>===<p>- AngularJS, HTML5, CSS, and jQuery<p>- Obsessed with keeping up-to-date with the AngularJS community, HTML5, CSS, and jQuery<p>- Event based asynchronous programming, promises<p>- Strong exposure of building web apps that work across browsers<p>- Express or other Sinatra like frameworks<p>- Mocha, Karma or other testing frameworks<p>Bonus Points<p>===<p>- Internationalization and localization<p>- Understanding SaaS applications<p>- Bootstrap or theme development<p>- Graphic design<p>- Websockets<p>- Livereload<p>Compensation &amp; Benefits<p>===<p>- 120k-150k annually<p>- 15 paid days of vacation<p>- 12 paid days for holidays<p>- Work from Home (max 1-2 day a week) possibility after 90 day period<p>- RSU packet (equity) (amount congruent on position)<p>The Process<p>===<p>- Preliminary discussion with AngularJobs<p>- Referred to Engineer Director<p>- Referred to VP of Engineering<p>Apply Here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/995\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;995</a>","time":1406914655,"type":"comment"}