{"by":"dfine","id":8122461,"parent":8120070,"text":"Computer Vision Engineer — Placemeter — NYC, REMOTE, OR VISA<p><i>About Placemeter</i><p>Placemeter uses public video feeds and computer vision algorithms to create a real time data layer about places, streets, and neighborhoods. Check out our algorithm in action here: <a href=\"http://placemeter.com/tech\" rel=\"nofollow\">http:&#x2F;&#x2F;placemeter.com&#x2F;tech</a><p>------<p>Our system is full stack in a way rarely seen before, from GPU processing to mobile application, and everything in between including computer vision and data analytics models and equations. If you like to learn about really kick ass technology in AI, data science and sensing and modeling, if you like huge, scalable systems designed to make a real impact, you will fit right in, and you will be faced with some of the best tech challenges you have seen so far. Get ready to seriously increase your tech street cred.<p>We are a paradise for video and data geeks. You will have the opportunity to experiment with a completely unique data set that measures the “busyness” of the real world in real time, and for every place out there! For that, we ingest and process video and data feeds at a scale never heard of. And this is growing every day.<p>We are looking for our lead computer vision engineer. In this position, you will be in charge of designing the next generation of computer vision algorithms or data analytics and prediction models we use to quantify the world. You will define the methodologies and set the standards of algorithmic development.<p>Placemeter will never identify people. Placemeter’s technology and cameras will never be used to individually track people.<p>-----<p>SKILLS YOU WILL NEED OR DEVELOP<p><pre><code>  + Computer vision – \n     -SIFT&#x2F;SURF\n     -Haar cascades\n     -scale-space models\n     -object tracking\n     -kalman filtering\n     -any other video analytics or pattern matching approach\n  + C&#x2F;C++\n  + Code optimization, multithreading, parallel architectures\n  + Software development methodologies\n  + Continuous integration, test driven development, agile methodologies\n  + Algorithmic quality measurement and testing\n\n</code></pre>\nEXPERIENCE<p><pre><code>  + A hands-on programmer with experience deploying at scale\n  + Multiple languages: \n     -you can prototype in matlab or F\n     -then code in java, python, or C++\n     -and you can look into lower level layers for optimization\n  + Data and ground truth driven algorithm development\n\n</code></pre>\nQUALITIES WE LOOK FOR<p><pre><code>  + A strong need to know what you’re doing in the long term, to view the big picture\n  + Respect and practical use of theoretical knowledge\n  + A love for beautiful code\n  + A real, pragmatic approach to your every day work\n  + A team player\n  + Humility, respect, and a tremendous desire to learn\n\n</code></pre>\n------<p>APPLY NOW<p>If you&#x27;re interested in working with us, send us an email and we&#x27;ll chat!<p><i>Email address:</i> jobs@placemeter.com<p><i>Subject line:</i> HN Computer Vision Post<p>[Edits: concision &amp; formatting]","time":1406923213,"type":"comment"}