{"by":"conickal","id":8122492,"parent":8120070,"text":"BOX VIEW &#x2F; CROCODOC<p>Los Altos, CA (Bay Area &#x2F; Silicon Valley)<p>Since Crocodoc (YC W10) joined Box last year, we’ve been expanding our efforts to make documents a seamless part of the web. Our service has converted hundreds of millions of PDFs, PowerPoints, and other documents into beautiful HTML5, and powers core document viewing and annotation functionality for companies like LinkedIn, Zendesk, and UberConference. Composed of Crocodoc and Box engineers, the Box View team is run with the energy and drive of a close-knit start-up, however we have the support and infrastructure of a larger organization. Our stack is built in Python, Django, Celery, Javascript, Jquery and Node, and we support the open source community and contribute back to it. We&#x27;re nimble and push code almost every day, but because our product reaches tens of millions of users, everything must be bulletproof.<p>In our free time, the team enjoys playing board games, bughouse chess, and Don&#x27;t Starve. We brew beer, hike Yosemite, and ski Tahoe.<p><i>Job Description:</i><p>Since you&#x27;ll be joining a small technical team, you&#x27;ll take the lead on core projects from the get-go and often work independently. We can use extra hands in the entire stack, so we&#x27;d rather find the right fit for the team than pigeonhole candidates into specific roles. We expect our team members to be driven, self-starting, and effective.<p><i>Skills and Qualifications:</i><p>We don&#x27;t like traditional job posting requisitions, so our requirements are short.<p>1. Know what you know\n2. Know what you don&#x27;t know\n3. Ask questions and be willing to learn #2<p>To get the fastest response, email me at nes@box.com and mention Hacker News. If you want to stalk me on LinkedIn, I&#x27;m at <a href=\"http://www.linkedin.com/in/nicholasesilva/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;nicholasesilva&#x2F;</a>","time":1406923488,"type":"comment"}