{"by":"chetanahuja","id":8122485,"kids":[8135434],"parent":8120070,"text":"<i>PACKETZOOM ENGINEERING</i><p>Burlingame, CA (just south of San Francisco in the bay area) FULL TIME H1B\nVISA Transfer ok for the right candidate. TN VISA ok.  REMOTE considered for\nthe perfect candidate<p>Mobile Networks are different. And yet we continue using the same legacy\nprotocol stack (TCP&#x2F;HTTP&#x2F;SSL) to connect mobile devices to the cloud. If you\nwant to help change that, come join us.<p>Packetzoom is rethinking the whole stack from the ground up. You get to hack\nnetwork and&#x2F;or security protocols, innards of mobile operating systems and\nbuild a global distributed system around brand new protocols. It&#x27;s a very\nsmall (but well funded) team so everyone contributes in everything. But\nfollowing two are the roles where we have specific needs to fill right now.<p><i>1) SENIOR ENGINEERING LEADER</i><p>IF you have shipped products or built services where you (at least) actually\nhad to deal with unix at the syscall level (either in the userspace or kernel)\nin C&#x2F;C++ code, I want to talk to you. If you&#x27;ve shipped and <i>maintained</i> the\nproduct for a few years, I really want to talk to you. You&#x27;d be responsible\nfor leading the team the team that builds and runs the packetzoom protocol on\nmobile clients (iOS, Android and any others we decide to pursue) as well as\nour globally distributed cluster of servers. No pressure ;-)<p><i>2) UNIX HACKER WITH AN ANDROID BENT</i><p>IF you&#x27;re the kind of person who isn&#x27;t happy until you&#x27;ve fixed up your\nandroid phone so you can ssh into it to, say, kill offending processes and&#x2F;or\nrun cron jobs,  I want to talk to you. You&#x27;d be responsible for our Android\nplatform (so you&#x27;d be writing some combination of Java and C++ code). In the\nprocess, you&#x27;d get to learn all about vagaries of mobile platforms and mobile\nnetworks at the global scale. In addition, you&#x27;ll have your pick of dozens of\ndelicious, hard problems to solve in the realm of distributed systems, unix&#x27;y\nthings, iOS stuff, security stuff etc. if you&#x27;re so inclined.<p>I&#x27;m a Founder&#x2F;CEO&#x2F;CTO. You will work directly with me. We&#x27;re well funded but\nstill a very small team (&lt; 10 people) So you get to enjoy an early stage team\nenvironment but not so much the high financial risk that goes with such\nthings","time":1406923431,"type":"comment"}