{"by":"frisco","id":8122121,"parent":8120070,"text":"Transcriptic: Full-stack developer (emphasis on frontend)<p>Menlo Park, CA<p>Transcriptic is &quot;Amazon Web Services&quot; for the life sciences. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic&#x27;s central, highly automated &#x27;biocenter&#x27; in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We&#x27;re building a long-term company to completely change the way life science research and development is done.<p>We&#x27;re looking for a highly talented full-stack web developer. On top of our robotic work cells is a slew of internal services as well as a Rails app that acts as our lab information management system and customer-facing UI. Challenges range from building rich, interactive interfaces for composing protocols to presenting analytical data generated by the lab back to the user. We use d3, Backbone, and some CoffeeScript today, but you&#x27;d be free to choose your own tools and libraries.<p>We&#x27;re a rapidly growing startup (you&#x27;d be #18), but well funded ($6M) and have customers at places like Harvard, Caltech, UCSF, and Stanford. You&#x27;d be able to work on interesting science and hard technology in a small, all technical team with lots of freedom and resources.<p>A biology background is preferred but not strictly necessary for outstanding people.<p>Recent coverage:<p>- <a href=\"http://www.theverge.com/2013/12/18/5216738/inside-transcriptic-the-secret-robot-lab-that&#x27;s-shaking-up-science\" rel=\"nofollow\">http:&#x2F;&#x2F;www.theverge.com&#x2F;2013&#x2F;12&#x2F;18&#x2F;5216738&#x2F;inside-transcript...</a><p>- <a href=\"http://techcrunch.com/2014/02/18/aws-for-life-science-with-4-1m-in-the-bank-transcriptic-wants-to-reinvent-scientific-research/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;02&#x2F;18&#x2F;aws-for-life-science-with-4...</a><p>- <a href=\"http://gigaom.com/2014/07/15/genetic-researchers-have-a-new-tool-in-api-controlled-lab-robots/\" rel=\"nofollow\">http:&#x2F;&#x2F;gigaom.com&#x2F;2014&#x2F;07&#x2F;15&#x2F;genetic-researchers-have-a-new-...</a><p>team at transcriptic.com<p><a href=\"https://www.transcriptic.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;</a>","time":1406918931,"type":"comment"}