{"by":"Plasmoid","id":8122549,"parent":8120070,"text":"Coverity - <a href=\"http://www.coverity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coverity.com</a> - San Francisco, Seattle, Calgary - VISA<p>We make software to find bugs in software.  Static Analysis, Dynamic Analysis, Security Analysis, and Test Analysis.  It&#x27;s an awesome place to work.<p>* Senior Build Engineer *<p>--------------------------------<p>We are looking for a Senior Build Engineer to support the Continuous Integration process&#x2F;infrastructure for Coverity products and components.  Our build environment is comprised of a myriad of platforms including different versions of Windows, Linux, Unix, and MacOSX with codebases in C&#x2F;C++, Java, and C#.  The ideal candidate is someone who despises doing a lot of busy manual work and prefers to develop automation for anything that he&#x2F;she feels can and should be automated.  The ideal candidate is also someone who is very comfortable interacting and working with pretty much everyone in the R&amp;D team as he&#x2F;she will be supporting Developers and QA.  We are looking for someone who finds it difficult to sleep at night knowing something might be wrong with his&#x2F;her build system.<p>More details - <a href=\"http://jobvite.com/m?3WDvAgwp\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3WDvAgwp</a><p>-----------------------------------<p>*  Java Backend Developer *<p>-----------------------------------<p>We&#x27;re looking for an engineer with significant design and implementation experience with the back end components of web applications.  This person will be part of Coverity’s Web Application team, which is charged with the delivery of advanced management capabilities for Coverity’s suite of code analysis tools. As Coverity grows and its solutions are more widely deployed, the accompanying management capabilities must become increasingly effective for a growing number of stakeholders and be capable of scaling to larger deployments.  The challenge this position holds is to meet these goals while continuing to satisfy the expert users of the application as it is currently implemented.<p>More details - <a href=\"http://jobvite.com/m?3nEvAgwR\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3nEvAgwR</a><p>-------------------------------------<p>* Senior User Interface Developer *<p>-------------------------------------<p>The Coverity Desktop team is looking for an experienced Java developer to help take our desktop GUI’s to the next level.  This includes IDE plugins (like Eclipse and IntelliJ IDEA) and stand-alone Java&#x2F;RCP GUI applications as well.<p>More details - <a href=\"http://jobvite.com/m?33EvAgwx\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?33EvAgwx</a><p>Feel free to ask me any questions about Coverity","time":1406924165,"type":"comment"}