{"by":"cmkale","id":8122198,"parent":8120070,"text":"Scopely&#x2F;Los Angeles, CA&#x2F;Server Engineer<p>We are looking for a Senior Server Engineer to join our team and work on a huge new title we are releasing this year<p>What will you be doing?<p>- Developing server-side features and APIs for Scopely&#x27;s multi-million user games that generate significant revenue for the company. Examples include matchmaking, tournaments, in-app purchasing conduits, etc\n- Our tech stack: Memcached, Redis, an array of AWS services, ElasticCache - etc.\n- Employing operational best practices to ensure Scopely&#x27;s games and services are reliable.<p>Why Scopely?<p>- We have landed the rights to some of the most well known titles in the space that we will be developing and launching in the coming year.\n- The previous four titles released by Scopely have been consecutive #1 overall titles in the iOS app store. All 5 Scopely releases have been top 5 overall titles.\n- While we are a start-up, we are stable and booming with 300% revenue growth last year and on track to grow dramatically in revenue this year.\n- The regular tech stuff: equity, free lunch, awesome perks, competitive compensation and medical benefits<p>Some recent press on us:<p><a href=\"http://venturebeat.com/2014/03/23/how-scopely-is-building-a-hit-factory-one-mobile-game-at-a-time-interview\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2014&#x2F;03&#x2F;23&#x2F;how-scopely-is-building-a-...</a><p><a href=\"http://www.gamesindustry.biz/articles/2014-05-23-scopely-hires-disney-biz-dev-executive\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gamesindustry.biz&#x2F;articles&#x2F;2014-05-23-scopely-hir...</a><p><a href=\"http://blogs.wsj.com/cmo/2014/04/15/hot-mobile-games-company-scopely-nabs-former-disney-executive/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;cmo&#x2F;2014&#x2F;04&#x2F;15&#x2F;hot-mobile-games-company...</a><p>If interested, email me directly at kale@scopely.com.<p>Not the position for you? Check out our career site\n<a href=\"http://www.scopely.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.scopely.com&#x2F;jobs&#x2F;</a>","time":1406919882,"type":"comment"}