{"by":"deedub","id":8122475,"parent":8120070,"text":"Lytics (www.lytics.io) Portland, Oregon - Hiring all sorts: Solutions Consultants, Distributed Data engineers, Data Scientists. I&#x27;m looking specifically for a Solutions Consultant but if you&#x27;re interested in another role please inquire as we would love to hear from you.<p>Lytics makes it possible for marketers to create comprehensive customer profiles across all touch points (mobile, social, web) and truly target their messages to increase results and improve customer experience. We are an early stage start-up in amazing Portland, Oregon.<p>The solution consultant role is a highly visible technical client facing role that partners with a variety of internal and external stakeholders and you will need to be great at communicating with the very technical to non technical spectrum. Solution consultants are experts in our solution and help our customers implement and use the technology. You will lead technical validations&#x2F;proof of concepts, technical onboarding, solution design, and customer training&#x2F;hand off.<p>You should have experience with:<p>- Javascript tagging and event collection implementation<p>- Web, mobile, email, and social data<p>- Advising customers about what types of data should be collected to support marketing and business use cases<p>- Helping onboard custom data collection, including csv, json files, export from dbs, upload to sftp&#x2F;s3 or http api&#x27;s.<p>- Helping customers set up other integrations or automated scripts to support marketing campaigns (eg: SendGrid, Mandrill, Mailgun, ExactTarget, Salesforce, Optimizely, etc.)<p>- Building repeatable processes and docs to help scale the onboarding and customer success teams<p>- Supporting the sales team, including sales calls, demos and solution design<p>- Providing ongoing product feedback and roadmap input as the voice of the customer to the Product&#x2F;Engineering organization<p>Please reach out to jobs@lytics.io","time":1406923350,"type":"comment"}