{"by":"chris_r","id":8122766,"parent":8120070,"text":"evo.com - <a href=\"http://www.evo.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.evo.com</a> - Seattle, WA<p>evo is a leading multi-channel retail brand that addresses the lifestyle and sporting needs for the urban, action sports enthusiast. The evo brand strives to uniquely balance commerce, cause, culture and community by effectively collaborating, connecting and integrating elements of urban culture, community, art, music and sports in the action sports industry.<p>evo is comprised of a group of passionate, fun-loving, highly-motivated people who come together to create a company culture that is unique, balanced, respectful, fun, and productive.  We are looking for someone to expand our team – someone who can solve tough problems and roll with the punches in a dynamic environment, someone who loves to learn and face new challenges, someone who isn’t afraid to communicate with a whole company’s worth of other people, and someone who loves technology almost as much as a top-to-bottom run in feather-light, chest-deep powder.  Sound familiar?  Read on.<p>The Job\nWe are in search of an expert in web UI and UX development who can complement our small, talented team of developers to help us build and maintain the next generation of the evo.com web presence and more.  This new developer will sit functionally between our application developers and our design team to tie the vision of our marketers, merchants and brand managers to the technology that supports our site, creating the clean, elegant user experience we want for our customers.<p>This job requires great communication skills, excellent critical thinking abilities, and sound judgment to assess design requirements, execute smart implementations, write maintainable and easily-readable code, address issues with site functionality, and help guide the architecture of the website into the future.<p>Job Responsibilities\n- Provide technical input on design requirements, working with representatives from design, marketing, merchandising, customer service, and others to inform the design process and ensure technical feasibility\n- Implement designs in a clean, readable, elegant way to ensure maintainability, end-user performance, usability on supported platforms, and adherence to coding standards and architecture\n- Work with application- and service-level developers to connect design elements to the data and logic that drives them from the backend systems\nAddress issues related to usability, compatibility, performance, and maintainability with thoughtful solutions in a manner appropriate to their severity<p>Requirements\n- Loves to stay on the bleeding edge of web technology\n- Craves elegant, optimized user experience and design\n- Extensive experience working with design teams, developers, brand managers, marketers, and preferably merchants as well\n- Browser and device limitations, compatibility and behavioral nuance are second-nature\n- Not bound to any particular JavaScript or CSS libraries but willing to use them as needed\n- Expert-level skills in HTML 5, CSS, jQuery, and JavaScript\n- Experience with XML, JSON, REST, AJAX, .Net, and SQL\n- Proven track record of designing and building for highly-variable, data-driven content on high-traffic sites\n- Problem solving and critical thinking are like breathing to you and something you do with a measure of enthusiasm, patience, tenacity, and thoroughness.\n- Ability to understand, explain, and relate to technology from a developer and an end-user perspective.  Okay, you get it, but can you <i>explain</i> it?\n- Must be customer service-oriented with the ability to learn quickly, be resourceful&#x2F;flexible, and exercise sound judgment.\n- Must demonstrate excellent communication skills – verbally, in writing and interpersonally to inspire and build trust as this role interfaces with everyone in the company.  We work with lots of different personalities, technical proficiencies, and styles of people every day.\n- Must be able to handle high pressure&#x2F;emergency response situations.  S#@% happens – can you handle those situations without your forehead veins bursting?\n- Participation in action sports or experience in the action sports&#x2F;outdoor specialty retail industry preferred, but not required.\n- Embraces and lives our values: The Great 8 - <a href=\"http://www.evo.com/info/the_great_eight.aspx\" rel=\"nofollow\">http:&#x2F;&#x2F;www.evo.com&#x2F;info&#x2F;the_great_eight.aspx</a><p>Apply: <a href=\"http://www.evo.com/job-opportunities.aspx\" rel=\"nofollow\">http:&#x2F;&#x2F;www.evo.com&#x2F;job-opportunities.aspx</a>","time":1406926582,"type":"comment"}