{"by":"ninthfrank07","id":8123543,"kids":[8124470],"parent":8120070,"text":"MaidSafe - C++ 11&#x2F;14 open source software engineer (hourly paid) - South Ayrshire, UK (allows REMOTE)<p>MaidSafe is currently looking for C++ open source software engineers. If you, or someone you know, fit the bill and would like to work at MaidSafe, please get in touch with us: careers@maidsafe.net<p>[c++] [boost] [c++-standard-library]<p>Job Description<p>What if Bitcoin did useful work like making the internet secure, private and anonymous again instead of SHA256 hash rounds? What if use of the Internet produced value backed by actual server storage and bandwidth resources? What if this new Internet had already seen over three years of cutting edge C++ 11&#x2F;14 source code written for it, and is expected to launch its first product this year?<p>This replacement for much of the internet’s services is from a startup called MaidSafe who, in recent months has generated a high activity of interest from the press.<p>TechCrunch - The Server Needs To Die To Save The Internet (<a href=\"http://techcrunch.com/2014/07/23/maidsafe/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;07&#x2F;23&#x2F;maidsafe&#x2F;</a>)<p>Wired - Scottish company Maidsafe claims to have built a Bitcloud-like system (<a href=\"http://www.wired.co.uk/news/archive/2014-01/27/maidsafe-bitcloud\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wired.co.uk&#x2F;news&#x2F;archive&#x2F;2014-01&#x2F;27&#x2F;maidsafe-bitc...</a>)<p>Forbes - Beyond Bitcoin: Crypto-Ownership Companies Hope You&#x27;re Ready To Decentralize Everything On The Internet (<a href=\"http://www.forbes.com/sites/kashmirhill/2014/04/08/beyond-bitcoin-crypto-ownership-companies-hope-youre-ready-to-decentralize-everything-on-the-internet/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;kashmirhill&#x2F;2014&#x2F;04&#x2F;08&#x2F;beyond-bi...</a>)<p>We recently raised over $8m in the first ever cryptocurrency-based round of financing. As we approach product launch, we are looking to strengthen our team with C++ engineers experienced in open source software to help us nail bugs and add that final polish.<p>Your role will be initially finding and squashing bugs in the MaidSafe implementation libraries, all of which are open source and on github. Once we&#x27;ve established your skills and you have learned your way around the code, you may be required to do such work, as writing demonstration projects using our API, or even writing API documentation.<p>Please have a look at the quality of our code for yourself at <a href=\"https://github.com/maidsafe\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;maidsafe</a>.<p>Leading Boost and ISO C++ committee members have contributed to our code, it is an exemplar of modern practice and is written exclusively in C++ 11! You may also find our Continuous Integration testing dashboard of interest at <a href=\"http://dash.maidsafe.net/index.php?project=MaidSafe\" rel=\"nofollow\">http:&#x2F;&#x2F;dash.maidsafe.net&#x2F;index.php?project=MaidSafe</a>.<p>Skills &amp; Requirements<p>Mandatory requirements:<p><pre><code>  - At least 200 days where you sent a commit of C++ code to an open source code repository which we can verify.\n\n  - At least 365 days where you sent a commit of anything to an open source code repository which we can verify.</code></pre>\nIt would be great if you could supply us with a github.com or sourceforge.net or equivalent account for us to have a look through (the more the better).<p>Good to have:<p><pre><code>  - A proven track record of submitting quality bug reports to open source issue trackers, preferably with bug fixes. Some links to examples would be great.\n\n  - Proven CI configuration experience, preferably Jenkins though Travis and others are fine, although it would be even better if there is a place on the internet displaying evidence of your experience in this.\n\n  - Proven experience with unit testing frameworks, preferably Google Test although others would be fine too. It would be very useful to provide some links to test code that you have written.\n\n  - Proven experience with writing code for at least two of Microsoft Windows, Linux, Apple Mac OS X, Android, iOS or WinRT. MaidSafe code is expected to run on all of these. Again links to examples would be great.\n\n  - Proven experience with writing C++ 11&#x2F;14 code, especially using the C++ 11&#x2F;14 STL. Links to examples please!\n\n  - A presence on Stack Overflow, where you have asked or answered hard questions and recognised by others for your answers.\n\n  - At least a minimum of experience writing C++ which works on Microsoft C++ compiler. MaidSafe code needs to work on Visual Studio 2013, so you would have to constrain your C++ to that feature set while awaiting Visual Studio 2014 being released.\n</code></pre>\nLovely to have<p><pre><code>  - Proven experience with code correctness checking tools such as Valgrind, Purify, Clang sanitisers and equivalents. Examples of where you have used them would be great.\n\n  - Proven experience with code peer review tools such as Gerrit or equivalents, with links to examples if possible.\n\n  - Proven experience with CMake on both Windows and on POSIX, again with examples to links if possible.\n\n  - Proven experience in writing and debugging multithreaded code, again any links where you wrote or debugged some multithreaded code would be very useful. As in an interview, we would certainly ask for details on this as the MaidSafe code base is multithreaded.\n</code></pre>\nIdeal to have (don’t worry if you don’t)<p>Proven experience in the Boost C++ libraries and C++ STL. Examples may include:<p><pre><code>  - History of posts to mailing lists.\n\n  - Stack Overflow answers.\n\n  - Books written on C++ theory or practice.\n\n  - Your own code that has passed a community review (or even submitted for a review and was rejected).\n</code></pre>\nAbout MaidSafe<p>MaidSafe is a small and highly innovative open source technology company based on the West Coast of Scotland. MaidSafe is developing a decentralised and global computing platform\nthat will fundamentally change how the Internet works for millions of users, delivering privacy, security and freedom for everyone.<p>How to apply<p>Please supply us with a list of URLs of evidence showing us why you would be a great hire for us to careers@maidsafe.net, explaining to us context of those URLs where necessary and we will get back to you if we would like to know any additional information.<p>The hourly rate we pay depends on proven experience, and would range between £13 ($22) and £35 ($60) per hour. If you tick any boxes in the “Ideal to have” section, we may go above the upper limit.<p>We are also keen on permanent staff and have a great team and employee ownership scheme (not the usual marketing type scheme either; after the Foundation, you are part of the largest shareholding).<p>Please indicate permanent staff or contract when applying.","time":1406938999,"type":"comment"}