{"by":"squirrel","id":8123187,"parent":8120070,"text":"London, UK - Osper<p>We provide a real prepaid debit card for young people, aged 8 - 18, so they can make their own decisions with money: in shops, online, at ATMs, and abroad. Thousands of children have already signed up to our service.<p>But we not only give debit cards to young people - we are building a highly automated financial system that gives them unparalleled service. Behaviour-based security measures. Using and contributing to the best of open-source tools. Fully automated continuous integration and deployment. Hackathons to build the next big thing - what is that exactly? That&#x27;s up to you.<p>We want to meet and work with geeks of all stripes - from sysadmins to server-side devs, testers to mobile coders, data crunchers to security analysts - with a broad and deep set of relevant skills. Some examples appear below but we&#x27;re excited to talk with you no matter what your technical profile is.<p>Back-end developer<p>* Writing well-tested, readable, robust code in any modern programming language. (We mainly use Python, but don&#x27;t worry if you know something else better.)<p>* Designing semantically meaningful, self-documenting, intuitive APIs, especially for server-to-mobile interaction.<p>* Integrating with sloppy, poorly-documented, sometimes buggy APIs from vendors - and hiding the mess behind a clean interface to simplify everyone else&#x27;s job.<p>* Building and extending a database schema that&#x27;s meaningful, readable, and fast.<p>* Developing financial applications of any kind (but payment processing and PCI compliance win bonus points).<p>Front-end developer<p>* Designing and building amazing mobile and responsive-web experiences using HTML, CSS, and Javascript. Extra points for native app experience, especially with PhoneGap.<p>* Consuming APIs on a mobile device - and contributing to their design and improvement.<p>* Automating tests for mobile applications.<p>* Using the top tools for elegant, beautiful front-end design and coding - we&#x27;re currently fans of SVGs, web fonts, and Photoshop.","time":1406932321,"type":"comment"}