{"by":"davidshariff","id":8134353,"parent":8120070,"text":"Yahoo! (London, UK) - Build products that become a daily habit for millions of users, partners, and merchants.<p>Help build our search by introducing compelling new products and experiences that are powered by deep science, knowledge, and data. We are making traditional and new Search experiences more exciting, useful, and fun. Specifically, we are innovating in areas such as Vertical Search for consumers, distribution of Search and Media services for partners, and Small Business Services for merchants.<p>☆☆☆ About EMEA Search ☆☆☆<p>★ Use a variety of languages and technologies to make an impact<p>★ Develop software that powers experiences on smartphone, tablet, and desktop<p>★ Collaborate with and learn from designers, product managers, engineers, and executives<p>★ Create technically excellent software iteratively using Agile methods<p>★ Drive growth in audience, engagement, and revenue globally<p>☆☆☆ Positions ☆☆☆<p>We are looking to hire engineers across the spectrum from junior through to senior, and lead levels.<p>█ Backend Software Engineer<p>◇ What you&#x27;ll be doing:<p>· Ingest, categorize, enhance, rank structured data for Shopping, Local, and much more<p>· Design algorithms to deliver contextual, personal, and socially relevant experiences<p>· Use big data and machine learning techniques to enhance understanding and relevance<p>· Define APIs that enable new use cases and engage developers internally and externally<p>◇ Requirements:<p>· Degree in Computer Science or closely related field<p>· Expertise Java or C++<p>· Expertise in cloud, database, and big data technologies (desired)<p>· Expertise in machine learning, natural language processing, or related field (desired)<p>· Expertise in creating high-performance, high-quality, reusable software at scale (desired)<p>· Expertise in data-informed and test-driven software development practices (desired)<p>· Pursues work with energy, passion, drive, and intense customer focus<p>· A personal commitment to continuous learning and self-development<p>· Ability to work well on a team with a positive attitude<p>█ Front End Software Engineer<p>◇ What you&#x27;ll be doing:<p>· Create new, distinguishing user experience that will bring new users to Yahoo<p>· Develop modern, beautiful, personal, and relevant experiences across devices<p>· Use edge-side caching and data query optimization to make sites “wicked fast”<p>· Design new advertising products to enhance the user experience and drive revenue<p>· Implement real-time measurement frameworks to help evaluate new features<p>◇ Requirements:<p>· Degree in Computer Science or a closely related field<p>· Expertise in JavaScript, HTML5, CSS3<p>· Expertise in JavaScript frameworks and browser technologies (desired)<p>· Expertise in creating high-performance, high-quality reusable software at scale (desired)<p>· Expertise in data-informed and test-driven software development practices (desired)<p>· Pursues work with energy, passion, drive, and intense customer focus<p>· Personal commitment to continuous learning and self-development<p>· Ability to work well on a team with a positive attitude<p>☆☆☆ How to apply? ☆☆☆<p>If you&#x27;re interested or want to learn more? Email me with a copy of your CV at dshariff@yahoo-inc.com or visit our careers page: <a href=\"https://careers.yahoo.com/gb/lang/en/\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.yahoo.com&#x2F;gb&#x2F;lang&#x2F;en&#x2F;</a>","time":1407190244,"type":"comment"}