{"by":"devaccounts","id":8140076,"parent":8120070,"text":"New Orleans - Full Stack Developer @ Carrollton (relocation assistance provided)<p>Carrollton is seeking a Full Stack Developer for full-time employment in the heart of downtown New Orleans. We are in the middle of expanding our talented development team to take on the growing number of projects coming through the door.<p>---A day in the life---<p>Coffee, nerf, and more coffee. At least once a week there are freshly baked goodies that will taunt you on your way to your desk in the bullpen. In the early morning there’s chatter, but then as the day progresses, it’s mostly headphones and HipChat. In between knocking out new features for a client, there are whiteboard sessions and strategy talks. When you need to clear your head, the New Orleans skyline surrounds you from almost every angle. However, you will feel the most liberated when you deploy, which typically leads to libations down at G &amp; O. Fun and exciting projects are the future and are possible because of our roots.<p>---What we look for in a candidate---<p>If you know every programming language ever invented, that’s great – but we need a bit more than just a technical ninja.<p>* Strong interpersonal skills with a team-player mentality<p>* Killer problem solving strategies and an acute attention to detail<p>* Ability to clearly explain technical choices and ideas to both co-workers and clients<p>* Knowledge of common software design patterns, such as MVC<p>* Experience developing applications in object-oriented languages<p>* Curiosity to learn new technologies...and actually do it<p>---Technologies under your belt---<p>We don’t expect you to know everything in this list. We work on a lot of different types of projects, so the more diversified your skill set, the better!<p>* Core languages: Java, JavaScript, PHP, C#, C++, Objective C<p>* Frameworks&#x2F;libraries: .NET, jQuery, Twitter Bootstrap, Node.js<p>* Server administration: Linux&#x2F;Apache, Windows&#x2F;IIS<p>* Web services: REST, SOAP, JSON, XML<p>* Databases&#x2F;caching: MySQL, Postgres, SQL Server, MongoDB, Redis<p>* Versioning&#x2F;Continuous Integration: Git (we use Bitbucket), Jenkins<p>* HTML5 and CSS3<p>* Puppet, Chef, Ansible, Salt<p>---Trust us, you want to work here---<p>In addition to fun and rewarding projects, here are some perks that come with the job.<p>* Competitive salary<p>* Comfy chairs and work environment, 3 monitor workstations<p>* Health&#x2F;dental insurance, supplemental life insurance<p>* Retirement Plan<p>* Gym membership<p>* Paid time off, flexible schedule<p>* Team outings and parties<p>* Awesome co-workers<p>* You get to live and work in a city that celebrates life 24&#x2F;7<p>---We want to hear from you!---<p>Qualified applicants should send us a resume, a cover letter, and some samples of previous work that might catch our eye. Email us at stoyer AT carrollton DOT la.","time":1407280415,"type":"comment"}