{"by":"jedberg","id":2950551,"parent":2949787,"text":"Los Gatos / San Francisco Bay Area\nNetflix<p>I'm hiring for my team (although there are a ton of other jobs too)<p>The description is a little light on programming, but it really is more programming than sysadmining.<p>Netflix is a very open environment -- any engineer can push code to production pretty much any time with almost nothing in the way.  There is no release manager or schedule.  Maintaining reliability in this environment is a fun challenge!<p>Our team has three main goals:<p>* Write tools to help the other engineers know when it is safe to deploy.<p>* Create monitoring tools to detect issues before users do, fix them automatically if possible, and if not, contact the right people as quickly as possible.<p>* Take charge of outages and lead the calls until they are resolved and then follow up to make sure the root cause has been found and fixed.<p>So if this sounds like something interesting to you, you can send your resume to me at jedberg@netflix.com, and if you have any questions about the job, feel free to comment here (but don't email for questions, because I'd rather answer them here were everyone can see the answer).<p>Here's a discussion about the job on reddit:<p><a href=\"http://www.reddit.com/comments/jyaqd/\" rel=\"nofollow\">http://www.reddit.com/comments/jyaqd/</a><p>Here is the full job description from the jobs site:<p>Netflix is the world's leading streaming video service, and our growth is accelerating. At Netflix, we are upgrading our cloud management tools and pushing the limits of using cloud-based technology, powering our explosive (and soon to be international) growth while presenting new challenges to build a reliable service with ephemeral commodity hardware in an engineer friendly environment..<p>As a member of the Cloud Solutions team, you will manage, support and operate the company’s cloud environment.  You will build tools to monitor, automatically fix and/or proactively notify service owners of problems before customers notice.  You will drive incident resolution and follow through on finding root causes and getting them fixed.<p>You are an expert in distributed, highly concurrent, web-scale systems that are fault-tolerant and run 24x7 with unparalleled availability. You are a talented devops engineer and you thrive on managing and maintaining a reliable environment that others depend on.<p>You possess these qualities:<p>* You see the big picture delivering a 24x7 service<p>* You are effective working with multiple teams<p>* You have high standards in everything you do<p>* You can balance multiple tasks<p>You have these skills:<p>* Great communication skills, both verbal and written<p>* In-depth experience operating a 24x7 production environment<p>* Fluent in Linux: RedHat, CentOS, Fedora, Ubuntu<p>* Strong scripting and programming skills (we’re going to ask you to write code on the whiteboard)<p>* Familiar with the Java platform, especially JVM configuration and JMX<p>* Knowledgeable in Linux packaging tools: rpm, yum, dpkg, apt<p>* Ability to quickly triage problems, determine root cause and drive resolution<p>* Ability to keep a cool head under pressure and effectively participate in system down crisis situations<p>You may even have these skills:<p>* Expertise in one or more of the following: Java, Python, Ruby, Perl, shell<p>* Prior experience with Amazon EC2/S3 or other cloud service providers<p>* Building systems deployment and service management automation tools<p>* Familiarity with large scale systems and methodologies<p>If this sounds interesting then we want to hear from you!","time":1314893035,"type":"comment"}