{"by":"fskilroy","id":2950505,"parent":2949787,"text":"Job Description:\nFull time - on site\nIf you are an expert at developing high-performance, MVC standards-compliant interactive web applications using Linux/Apache/MySQL/PHP (using the Zend framework), we want to talk to you!\nThe ideal candidate has the ability to write and understand PHP as well as being able to work under pressure in a dynamic environment. The candidate should be comfortable facing development challenges with enthusiasm while also researching and proposing new technologies in their field.\nMinimum Job Requirements:\n3-5 years experience developing code for standards-compliant, MVC web applications\nPHP5 (Object Oriented)\nMySQL 5\nVersion control (SVN)\nLinux OS shell environment and utilities\nXML and RSS standards\nZend framework\nBonus Job Qualifications:\nXHTML/HTML5, CSS\nStored procedures \nJavascript and knowledge of JS libraries such as JQuery\nExperience and understanding of AJAX methodologies\nExperience with third party APIs, particularly Facebook Open Graph and Amazon Web Services\nMemcached\nAbout Us:\nThe Orchard is an independent music and video distributor specializing in comprehensive digital strategies for content owners.\nWe partner with companies of all sizes, from major independent record labels to management firms to production companies, to make their music and videos available across more than 100 unique digital outlets across 230 countries, as well as physical retailers across North America and Europe. But, that’s not all. We work with our clients to maximize their revenue through pricing strategies and sales promotions, provide the latest and greatest digital marketing tools, and offer products like sophisticated sales analytics to help them run their businesses efficiently and effectively.\nWhy Work for Us:\nYou will be a core member of a small development team. You will have an enormous impact to shape applications being developed by a leader in the music industry. We offer good benefits and a great work environment for our developers.<p>To apply, please email theorchardjobs@gmail.com with the following:\nCover letter\nResume\nSalary requirements\nNo recruiters, please.","time":1314892399,"type":"comment"}