{"by":"carols10cents","id":2951788,"parent":2949787,"text":"Pittsburgh, PA - Careerimp (Resunate.com)<p>I'm a dev here, feel free to email me (carol at careerimp.com) if you have any questions.<p>Official job posting:<p>Fulltime Rails Dev<p>Careerimp is changing job searching, making it possible for jobseekers to gain insights into their application as they apply. Right now, we enable users to create a damn good resume with Resunate (resunate.com).<p>We code in Ruby on Rails and jQuery. We expect you to have a very strong foundation in programming and several projects behind you in developing web software. You should be someone who hates bugs to be found in your code, so you test it like crazy before deploying it. You are disciplined in development and can contribute in our transition to a more disciplined development culture. You like working with a designer to help style your features, and have a good eye for usability and aesthetics. You like to take skeletal user stories and flesh out the solution space. You think in graphs and algorithms, and are not afraid of complexity. You are bubbling with feature ideas.<p>There are a couple of major projects you will be working on with the team in the near future:<p>a) Developing an API for other apps to easily communicate with us \nb) Developing analytical tools for career centers \nc) Developing a utility for jobseekers to discover skills to improve \nd) Develop mechanisms to improve our matching engine\ne) Develop interesting social features that leverage social network APIs<p>We work in a designer space in Uptown Pittsburgh (between downtown and Oakland, across from South Side), which is co-inhabited by a giant poodle and other interesting tech companies. We like being co-located while working, and expect the same of you.<p>Friday afternoons you work on whatever you feel like. Seriously. We brew freshly ground single origin coffee at least twice a day. We will pay you comparable salary to companies our size, pay for half your health and dental insurance, and may provide you stock options.<p>Interested? Contact us at careers@careerimp.com<p>Note: This is a full-time position (40+ hrs/wk). Part-time contractors need not apply.","time":1314911631,"type":"comment"}