{"by":"200902","id":2951030,"kids":[2951660],"parent":2949787,"text":"New York, NY<p>Job Title: Developer | Rails / Java / XP<p>Cyrus Innovation (www.cyrusinnovation.com) is a small (~30 people) NYC-based Agile development consulting firm. As pioneers in Agile methodology, we pride ourselves on being named one of Inc 5000’s fastest growing companies for three consecutive years. We embrace the latest Agile practices, open source tools, and strive for continuous process improvement. We provide XP teams on demand to both start-ups and enterprise organizations. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you.<p>Cyrus will bring to you:\n- the chance to create complex software solutions you will be proud of\n- the opportunity to work alongside bright, analytical, and experienced programmers\n- a true XP environment: TDD, pair programming, continuous integration, and lightweight design\n- direct interaction with clients to gather and analyze business requirements\n- experience and collaboration on all levels of software development from design to implementation\n- experience working with Java, Ruby, Groovy, Scala, and Javascript\n- an opportunity to have a real voice in critical design decisions<p>You will enjoy:\n- a week-long training course by Jim Shore attended by the entire company\n- a true 40-hour work week with no / minimal travel\n- an energized, yet casual work environment\n- full benefits including medical, dental, vision, 401(k) matching\n- an efficient organization where your opinion really matters\n- an annual personal budget and paid time off for professional development (conferences, workshops, etc.)\n- weekly kaizen (process improvement) sessions\n- knowledge-sharing brown bag sessions\n- daily stand ups\n- a company wide hackfest at our quarterly company meeting<p>You will bring:\n- a true, demonstrable passion for coding, both in and out of the office\n- a team oriented work demeanor and a desire for both teaching and learning\n- an outside the box approach to problem-solving\n- a strong enthusiasm and knowledge for XP\n- the desire and ability to learn new technologies quickly\n- experience with Object Oriented programming \n- knowledge of design patterns and refactoring<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. If you’re a talented and hard-working developer who is enthusiastic about Agile, we would love to hear from you. We are serious about our commitment to our employees and invite you to join our team.<p>If you are interested in learning more or would like to apply for a position, send an email to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1314899551,"type":"comment"}