{"by":"ygyasi","id":2951335,"parent":2949787,"text":"San Francisco, CA - Triggit<p>Inside Sales<p>About You:\n# You know you can sell.    And you enjoy it\n# You’re a hungry self-starter with a relentless work ethic who doesn’t want or need to be micromanaged.\n# You’re motivated by making large quantities of money.  And you’ll work for it. OTE is $100K+ for top earners.\n# You’re never afraid to pick up a phone and cold call.  And you’re relentless enough that you’ll never quit.\n# You understand that finding the right person to talk to is as important as saying the right thing.   And you’ll pound the pavement, or weave the Internet, to source the right lead.\n# You’re fascinated by technology.  And selling groundbreaking ideas and products excites you.<p>Requirements:\n# 2+ years of integrated media/digital sales and or agency experience, or a way to prove you don’t need it.\n# Ability to understand and communicate complex technologies. \n# You understand Triggit’s core business propositions and technologies. And will be ready to communicate this understanding during your first call.\n# You can identify and close deals with digital brands and advertising agencies to achieve Triggit’s and individual’s quarterly and annual sales goals.\n# Excited to work in a fast paced, rapidly changing, start-up environment.\n# Ability/willingness to travel as needed. .\n# College degree with a solid GPA or equivalent work experience.<p>To Apply:<p>Please submit a Resume and Cover Letter answering the following questions to jobs at triggit dot com:<p>When our CEO Zach was 16 he rode his bike from Minnesota to the Atlanta Olympics and traded enough pins, and scalped enough tickets, to pay for his entire trip and deposit $5G into his bank account to boot.   What’s your sales story?<p>Compensation:\n# Role is contract-to-hire with aggressive commission structure, but solid base pay.\n# Pay is competitive with entry level at Google etc, and when hired full-time, package will include stock equity, 401k, health/dental/vision insurance, commuter benefits, plus breakfast and lunch every day.","time":1314904431,"type":"comment"}