{"by":"elidaniel","id":10000266,"parent":9996333,"text":"Bridj | Boston | Onsite  <a href=\"http:&#x2F;&#x2F;www.bridj.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bridj.com&#x2F;jobs</a><p>Bridj is your everyday transportation system that adapts in real-time to where you live, work, and play. Powered by data, we use a network of express shuttles that offer efficient and flexible trips that are as dynamic as the city you call home. We’re revolutionizing mass transit by connecting travelers directly with their destinations. We’re live in Boston and Washington, D.C. so far, bringing joy to hundreds of people’s commutes each day. And we’re just getting started.<p>We are looking for developers who will be excited to put their skills to work solving some of the most difficult and important transportation problems, helping people travel through their cities more easily.<p>We are hiring for a couple positions now:<p>1) iOS developer: <a href=\"https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Bridj&#x2F;84143330-mobile-engineer-ios-\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Bridj&#x2F;84143330-mobile-engine...</a>.  You’ll be driving development of the iOS app that our passengers use to book travel. We expect you to be a mobile-first thinker, with up-to-date knowledge of the iOS development world (including things like Swift and ReactiveCocoa).<p>2) full stack &#x2F; backend developer: <a href=\"https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Bridj&#x2F;84142588-full-stack-ruby-on-rails-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;Bridj&#x2F;84142588-full-stack-ru...</a>.  You’ll touch all of our systems: mobile apps, client-side javascript and HTML, server-side APIs (building ours and consuming others), back-end data processing — you name it. Our stack today includes Ruby on Rails, PostgreSQL, and Redis, but we’re growing fast and building new things, and will expect you to help us shape the stack of the future.<p>3) backend tech lead &#x2F; architect: No official job posting yet.  You&#x27;ll help us build out the technology stack we want and need as we grow.  Do you have production experience with multiple tech stacks?  Have an opinion on whether Rails is a good choice for a high-performance API backend?  How we should store real-time data about the locations of buses? How we should be versioning our services?  If you want to dig in, write a lot of code, and make things the way you think they should be, we want to hear from you.","time":1438639955,"type":"comment"}