{"by":"nestorp","id":10001891,"parent":9996333,"text":"Stampery is looking for a Junior Android Developer | Full-time (Madrid)<p>JOB DESCRIPTION\nOur vision is to make every document and communication legally binding, using the blockchain technology. We provide proofs of existence, integrity and ownership of any given piece of data, in a costless and decentralized way. \nOur goal is to send notaries on vacation.\nWe are expanding our team from 4 to 7, and one of these open positions is for an Android engineer.\nWhat we expect from you:\n- Passionate, hard working \n- Cares about the problem and builds first class solutions \n- Works in an autonomous way \n- Has a deep knowledge of Android development (in Java or other languages) \n- We don&#x27;t expect a degree or work experience. All we care about is real know-how, not titles\nWhat you can expect from us:\n- Product-focused approach \n- Relaxed work environment where everything goes around the goals, and not the hours \n- Great office in the center of Madrid (Alonso Martinez), with a cool rooftop, kitchen and lots of sunlight \n- Display, keyboard, standing desk if necessary... we cover all that<p>PRODUCT\nStampery relies on the bitcoin blockchain to generate reliable and unspoofable proof of ownership, proof of existence and proof of integrity at a minimum cost. The blockchain is a distributed and decentralized system, and thus the proof is verifiable any time by any independent third party<p>WHY US?\n- Product-focused approach \n- Relaxed work environment where everything goes around the goals, and not the hours \n- Great office in the center of Madrid (Hortaleza), with a cool rooftop, kitchen and lots of sunlight \n- Display, keyboard, standing desk if necessary... we cover all that<p>Full offer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;stampery&#x2F;jobs&#x2F;76402-junior-android-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;stampery&#x2F;jobs&#x2F;76402-junior-android-engineer</a><p>Let&#x27;s work together, join us!","time":1438667532,"type":"comment"}