{"by":"mdev","id":10000360,"parent":9996333,"text":"Juniper Networks - San Francisco, CA| Full-Time | ONSITE | VISA<p>The Group<p>Network security a dynamic industry teeming with innovation and the opportunity to define real solutions that go beyond traditional static approaches to stopping threats.  It&#x27;s time to build intelligence in the cloud and connect it to our network security devices. The data sets are large, the threats complex, and only the smartest will be able to create new algorithms to find the needles in the haystack that are malicious.  This is the right time to join the team at Juniper Networks “Juniper Security Intelligence”, in San Francisco with the charter to be disruptive, to build new products, and to cement Juniper as the thought leader in network security by stopping the bad actors and protecting our customers.  We need people to own responsibility for developing systems, algorithms, and approaches that connect the potential of large data and the wide footprint of the cloud with customer network devices to stop advanced threats.  Juniper Security Intelligence is the epicenter for advanced threat defense in Juniper and now is the time to join<p>Responsibilities:\nFirst and foremost you&#x27;re passionate about writing code. You love to code. When you&#x27;re done coding you ensure it is flawless by developing automated unit tests. As a Security Intelligence Software Engineer, you are implementing features designed by technical leads in the organization. You help estimate the software development cycle and follow through by completing your tasks in agreed time while not compromising on quality.<p>QUALIFICATIONS<p>3-4 years of Experience developing Software\n·         Experience with one or more modern programming languages: Python, C#, Java C<p>·         Experience with Malware security software and techniques.<p>·         Involved in building a cloud service application over a Cloud Infrastructure like Amazon Web Services (AWS).<p>·         Experience with some sort of &quot;big data&quot; stack: Hadoop, Dynamo DB, HBase, Cassadra, Mongo, PostgreSQL<p>·         Experience with HTTP, RESTFUL APIs, Web Sockets, SSL&#x2F;TLS.\nSome understanding of content formats (e.g. HTML, PDF, XLS, DOC)<p>Email resumés to: mahadevk@juniper.net","time":1438641177,"type":"comment"}