{"by":"alexzoltano","id":10000282,"parent":9996333,"text":"PayScale is hiring a full-stack software engineer and senior software engineer in Seattle, WA, onsite, full-time.<p>We have a service that tells you how much you should be paid in real-time and we&#x27;re moving it forward with React, ES6, AWS, NServiceKit, and more. You&#x27;d be reporting to me (@alexzdangelo, Web Architect).<p><a href=\"http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;xz2JUr\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;xz2JUr</a> <a href=\"http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;9J16ZG\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.payscale.com&#x2F;apply&#x2F;9J16ZG</a><p>What&#x27;s it like to work at PayScale?\nLots of laughter. People have lunch together. Wine and board games on Fridays. There is a buzz in the air. Feels like a startup with the stability of an established company.<p>What does the team do?\nWe’re building significant new features and products using modern technologies while still modernizing our existing codebase. Lots of opportunities to learn new technologies, evangelize them to the broader team (not just developers but sometimes to designers, content writers, and marketing), set best practices, and establish the foundation for the front-end of all sites. Experimentation is highly encouraged.<p>Recent projects include putting PayScale.com on Amazon CloudFront, incorporating React into the build tools, building a pilot for a new product, and organizing a hack day with our friends at Chef.<p>We use React, ES6, gulp, Bootstrap, Less, Webpack, Babel, JSHint, ESlint, node, npm, mocha, etc., in addition to C#, IIS, ASP.NET, and Amazon Web Services. We write unit tests. We&#x27;re working on the mobile strategy and exploring React Native for mobile development.<p>What we&#x27;ll do\nHelp you grow in your career. Offer mentoring. Encourage normal work hours. Hackathons every three months. Lots of fun activities.<p>What you&#x27;ll do\nFull-stack development with focus on the front-end. Research and evangelize best practices and modern technologies. Work across teams and products alongside a highly functional, world-class development team.","time":1438640122,"type":"comment"}