{"by":"jonnyli","id":10015992,"parent":9996333,"text":"pebble {code} | Lead Creative Technologist | London| Full Time | ONSITE<p>We&#x27;re a Technical Innovation Consultancy and we help businesses to innovate like startups and solve the right problems.<p>More about us here\n<a href=\"https:&#x2F;&#x2F;pebblecode.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;pebblecode.com&#x2F;</a><p>We are looking a Lead Creative Technologist who will work with our clients to fully understand and identify their problems, and design solutions to address those needs. Essentially a problem solving consultant who is also a technology polyglot.<p>To give a flavour of the work you could get involved with:\n- Data-driven competitive intelligence portal, enabling analysts and senior executives access to data they need in a fraction of the time, to adapt to an ever-moving market.\n- Crossing the digital and physical worlds with mobile applications using Bluetooth Low Energy.\n- Architecting and building online gaming platforms with multiple gaming engines from the bottom up.\n- Responsive and gamified ideation platform for over 70,000 global employees.\n- Predictive solutions for improving investment fund performance.<p>You’ll have the opportunity to:\n- Be instrumental in the analysis, design and building of stuff that makes people’s lives better.\n- Experiment with new new tools and technologies. Speak at conferences.\n- Write blogs and books - if you like.\n- Work with awesome people (no joke! we have super talented folks\n- here).\n- Change your title to something else - if you like. Your talent is valued over a role title, so if you want to be called something else, let us know.<p>If this sounds interesting, more details here: <a href=\"http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;93026&#x2F;lead-creative-technologist-pebble-code\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;93026&#x2F;lead-creative-te...</a>","time":1438865107,"type":"comment"}