{"by":"santiycr","id":10025262,"parent":9996333,"text":"Sauce Labs - San Francisco - Core Infrastructure Engineer<p>We&#x27;re looking for backend developers to help us scale our highly available service and massive cloud of Windows, Mac and Linux virtual machines. If you re an experienced developer with an interest in distributed systems, Linux, Python, async programming and devops. If you love solving complex problems and working with awesome people, shoot me an email at santi at saucelabs.<p>What we are looking for:<p>- You are passionate about  software.<p>- You know what it takes to ship something.<p>- You can think outside of the box.<p>- You are not afraid of learning new things and improving every day.<p>- You enjoy difficult problems and solve them in straightforward and practical ways.<p>What we offer:<p>- You will join a productive  team<p>- A work environment operating with values to prevent politics and friction<p>- Competitive compensation, including benefits and equity<p>- Catered lunches, company events and after hours with a happy group of coworkers<p>- Sunny office in SOMA, San Francisco, in a pet-friendly building<p>About Sauce:<p>Sauce Labs is a SAAS+E2E series D startup in the bay area. We provide an automated testing cloud service so our customers don&#x27;t have to build their own Selenium or Appium grids. We pride ourselves about our values and transparency (<a href=\"https:&#x2F;&#x2F;saucelabs.com&#x2F;our-values\" rel=\"nofollow\">https:&#x2F;&#x2F;saucelabs.com&#x2F;our-values</a>). Oh, and a nice to have these days: we have a real business model!<p>About the Team:<p>Our Core team is currently 8 people and we plan to grow in a controlled fashion this year, hiring awesome people who are excited about what we do. Most of the team is in SF, with some members in the EU working on a re-location. The system we built runs millions of Selenium tests every month, in real time, using VMs hosted on our own infrastructure. We own all our hardware and we collaborate tightly with our Ops team to run our cloud.<p>We are an equal opportunity employer and value diversity at our company and team. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, food preference or pet preference.","time":1438984685,"type":"comment"}