{"by":"jf_cringle","id":10033696,"parent":9996333,"text":"Cringle | Berlin Kreuzberg | Senior Full Stack Developer | <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;iN6swq\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;iN6swq</a> | ONSITE | FULL-TIME<p>ABOUT CRINGLE\nCringle is an app that makes payments between friends as easy as WhatsApp. Together with the second biggest direct bank Deutsche Kreditbank (DKB) we provide the most modern mobile peer to peer payment app in Germany. Cringle was founded two years ago, won multiple excellence awards and received its first support from Microsoft Ventures Accelerator and the Technical University of Berlin.<p>YOUR ROLE\nYou work with us on the Cringle backend, extending our APIs and general functionality\nYou write tests to ensure robustness\nYou help us build a healthy and scalable infrastructure in the Cloud™ \nYou help out in the frontend and Android or iOS client development<p>YOUR PROFILE\nYou are a devoted developer and you love solving complex problems in a smart way? \nYou have fun working with the latest technology to build a system that can safely scale up to handle hundreds of thousands of transactions?<p>You have minimum 3+ years’ experience in building complex projects\nYou have experience with Ruby on Rails or Go development\nYou have experience with Test-driven development\nYou have experience with Client-server communication\nYou know what it feels like to finish your scrum sprint’s work early\nYou have knowledge and skill of at least one of the following: Android development, iOS development, HTML&#x2F;CSS, JavaScript, Building infrastructures on the Docker stack<p>WHAT WE OFFER\nYou are an essential part of a committed international team with flat hierarchies and agile decision making processes\nYour work is essential for Cringle and has a large impact \nYou have full responsibility for your varied tasks\nWorking in the heart of Berlin Kreuzberg surrounded by many other Start-Ups\nCompetitive salary<p>Sounds like a fun job? Send us your impressive CV including references, portfolio and something that differentiates you as a person from others. E-mail info@cringle.net","time":1439202447,"type":"comment"}