{"by":"sumana25","id":10059589,"parent":9996333,"text":"Software Engineer (Web&#x2F;Frontend)at Telenor Digital -Trondheim, Norway<p>Permanent position, Full-time\nYou can apply at - <a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;nc9okjm\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;nc9okjm</a><p>Telenor Digital is aiming to create a world-class login solution with the goal of connecting tens of millions of users (we just reached our first million!) to different services within the next two years. When developing we focus on mobile-first and progressive enhancement, and we strive to offer an enjoyable experience to all our users, regardless of what device and platform they are using. We operate mainly in the European and the Asian markets, with all the challenges that include, for example: different alphabets, different levels of literacy among our users, and different experience levels with internet usage and technology.<p>Our implementation \nWe use Java a lot. As we are creating login, user-management, and payment applications, we use HTML forms a lot too. Our older applications are built with Jersey&#x2F;JAX-RS (<a href=\"https:&#x2F;&#x2F;jersey.java.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jersey.java.net&#x2F;</a>), while our new ones are built with Spark (<a href=\"http:&#x2F;&#x2F;sparkjava.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;sparkjava.com&#x2F;</a>). We try to keep the code-base to a minimum. On the frontend we use plain JavaScript (inline) for code that has to be executed right away, and jQuery for “nice to have” functionality. We use Apache Velocity for templating. We build using Maven and Grunt, and we track our code using Git. Performance is key, and our aim is that our applications should be ready to use (or at least be perceived as being ready to use) within a second, even on slow connections. \nWe have (big) databases too, but you won’t have to interact with them directly. Persistence is handled by an API created by another team.<p>Who we are looking for \nWe need more hands on Java&#x2F;Web. This means we need someone who would be comfortable with working with Java, Jersey, Spark, Apache Velocity and JavaScript&#x2F;jQuery. And Maven&#x2F;Grunt for building. We are not looking for someone who is already an expert on all of these things (It would be nice, though), but someone who knows a few and is willing and able to learn the rest.<p>Deadline for application:30&#x2F;08&#x2F;2015<p>Contact info: Tina Tan  (+47) 90894741","time":1439552448,"type":"comment"}