{"by":"mikecx","id":9996573,"parent":9996333,"text":"Zappos Labs - San Francisco, CA - ONSITE<p>Zappos Labs is looking for a Full-Stack Developer!<p>What is the job?<p>We are a small team of smart people looking to solve tough problems and brainstorm new ideas. Our projects focus on the future of Zappos and customer experiences using a combination of new technologies and new approaches to old technologies. As the Zappos Labs team, we have freedom to incubate new ideas with the backing of a large yet passionate-about-culture organization.\nSome of our recent projects include researching new lines of business for Zappos, exploring the physical pop-up space, and creating the tools to support self-organization.<p>What skills do you need?<p>We are looking for an experienced full stack developer with a focus on front end development. Some of the technologies we use are Ruby on Rails, Javascript frameworks, Node, Mysql, Postgres, and R. We also have a mobile project or two going on at any point in time. Our general approach is language agnostic, choosing the best language for the job.\nBeing able to design applications from top to bottom, troubleshooting and fixing tough problems, hitting quick deadlines, knowing when to push back on requirements, and mentoring other developers will all be very important parts of this role. Knowing a programming language or two like the back of your hand will also come in very handy.\nWe are ideally looking for a &quot;T-shaped developer&quot;—someone who has a broad interest and understanding of technology and the web, but also has deep interest in a specialized area. However, being a Labs developer isn’t a full-time programming job. We want someone who has their own big ideas, loves brainstorming sessions, and will participate in user research.<p>What kind of people do we want?<p>Our team is always in search of people that are self-starters, visionary thinkers, and people who don’t mind a little bit of ambiguity.\nThere are many open ended problems that there are no solutions for...yet. Can you brainstorm and come up with innovative solutions to new problems? Are you willing to work closely in a small team and push everyone to be the best that they can be? Do you love learning new things, expanding your knowledge, and iterating quickly? If so, the Zappos Labs team might be for you.<p>Zappos IP, Inc. is an equal opportunity employer and a drug-free workplace<p><a href=\"https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=ooKf1fw8&amp;s=Ycombinator_MikeCarey\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=ooKf1fw8&amp;s=Ycombinator_MikeCar...</a>","time":1438615215,"type":"comment"}