{"by":"arunmib","id":9996911,"parent":9996333,"text":"Sr. Engineer - Web &#x2F; UX<p>RideCell (<a href=\"http:&#x2F;&#x2F;ridecell.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ridecell.com&#x2F;</a>) is looking for a senior frontend engineer to join our team in San Francisco. We&#x27;re a small team, and you&#x27;ll have significant responsibility for designing and building products and features that you can take pride in.<p>About Us:<p>RideCell builds transportation automation software that helps large corporations, public transit agencies and universities optimize, manage, and scale their transportation systems.<p>We&#x27;ve already moved over 10 million people, but that&#x27;s just the beginning. We&#x27;re working on much higher impact things that will fundamentally change the way logistics is done. Doing this requires solving some pretty interesting engineering problems ranging from optimally routing and dispatching vehicles to predicting customer demand based on historical and real-time variables to maximize throughput.<p>About You:<p>* You&#x27;re fluent in Javascript and at least one or two MVC frameworks (especially Backbone.js and Angular.js).<p>* You have a good eye for design and always pay attention to the user experience of the product.<p>* You&#x27;re familiar with REST APIs and the concepts of RESTful architecture.<p>* You have opinions on how to structure code, and you&#x27;re excited about taking ownership of the architecture of our entire frontend codebase.<p>* You&#x27;re self-directed but good at communication.<p>* You&#x27;re excited about working for a startup and moving quickly.<p>* You currently live in the U.S. and are willing to relocate to San Francisco.<p>Nice to Have:<p>* Experience with Python and Django, especially with the Django templating language.<p>* Experience mentoring other engineers.<p>Next Steps:<p>To get started, please apply here or email jobs@ridecell.com with your resume. If you can link to your GitHub &#x2F; code samples, and&#x2F;or links to any deployed software you&#x27;ve worked on we&#x27;ll prioritize our conversation.","time":1438616952,"type":"comment"}