{"by":"karlkatzke","id":9996501,"parent":9996333,"text":"Voyant, Inc. | Javascript Developer (Ember) | Austin, TX<p><a href=\"https:&#x2F;&#x2F;www.planwithvoyant.com&#x2F;content&#x2F;us&#x2F;default&#x2F;aboutus&#x2F;emberjsdev.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.planwithvoyant.com&#x2F;content&#x2F;us&#x2F;default&#x2F;aboutus&#x2F;em...</a><p>Do you enjoy working in a flexible, family-oriented environment with a variety of adorable canines? Can you serve up a righteous beat-down in Super Smash Brothers? Do you enjoy bi-weekly massages, unlimited Topo-chico, and the ability to work from a treadmill desk? We are looking for intelligent and highly motivated individuals to add to our team of developers. At Voyant you will have the ability to help design, architect, and lead the implementation of our next generation web&#x2F;tablet-based applications built with cutting-edge Javascript-MVC frameworks. Be ready to wear a variety of hats, because we work in an agile-development environment where you can get your hands dirty in just about anything that you might be interested in.<p>- We are looking for team members to help design, architect, and lead the implementation of our next generation web&#x2F;tablet-based applications built with cutting edge Javascript-MVC frameworks.<p>Experience: \n- Extensive front-end development experience with HTML, Javascript, and CSS\n- Experience building enterprise class applications with EmberJS or other JS frameworks such as AngularJS, Backbone, or ExtJS\n- Experience working with XML, JSON, and RESTful web services\n- Familiarity and some experience with Spring and Hibernate\n- Enjoy working as a self-starter in an agile development environment<p>Location: Austin, TX. Optional travel opportunities to the UK and Ireland available if desired.<p>If you are looking for the chance to jump in and lead the creation of an important new solution, contact us at jobs@planwithvoyant.com.<p>We offer a highly competitive salary with stock options, full family medical and dental insurance, and retirement plan.<p>Relocation and immigration visa sponsorship is not currently available.","time":1438614878,"type":"comment"}