{"by":"xtracto","id":9996735,"parent":9996333,"text":"Kueski is Hiring in Guadalajara, Mexico!, yes you can get a piece o Silicon Valley if you are in Mexico too! ( <a href=\"https:&#x2F;&#x2F;kueski.com&#x2F;careers&#x2F;software_engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;kueski.com&#x2F;careers&#x2F;software_engineer</a> )<p>We are a growing group of people (31 now! around 12 in the Tech Group) who have been working for the last two years building the &quot;Amazon of Financial Services&quot;. Whether it is building financial risk models using the latest Machine Learning algorithms, or designing and developing that killer software architecture to process millions of applications and users, there is plenty of fun.\nKueski is backed by Crunch Fund and Core Ventures, having raised USD$1.3 M in the seed round and a Delaware Corp. But at the same time we are operating 100% in Mexico (Guadalajara, to be precise). For those reasons, you will find all the cool things you would expect from a company in the Valley such as (but not limited to =oP ) ping-pong, 24&#x2F;7 free food (imagine a big freezer full of delicious frozen Mexican food like cochinita, enchiladas, etc) great amicable culture, no office hours, among several other things.\nWe have open positions for variety of profiles: Developers, Human Resources, Data Scientists, Digital Media Marketing, Operations Associate, Controller. If you fit any of these profiles, we would like to hear from you.\nFor more info send your resume at jobs+hn@kueski.com or write directly to me at baqueiro@kueski.com\nSome info about Kueski in the news: <a href=\"http:&#x2F;&#x2F;www.economist.com&#x2F;news&#x2F;business&#x2F;21647624-nascent-tech..\" rel=\"nofollow\">http:&#x2F;&#x2F;www.economist.com&#x2F;news&#x2F;business&#x2F;21647624-nascent-tech...</a>. <a href=\"http:&#x2F;&#x2F;www.pr.com&#x2F;press-release&#x2F;556004\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pr.com&#x2F;press-release&#x2F;556004</a> <a href=\"http:&#x2F;&#x2F;elempresario.mx&#x2F;casos-exito&#x2F;kueski-los-geeks-se-ponen..\" rel=\"nofollow\">http:&#x2F;&#x2F;elempresario.mx&#x2F;casos-exito&#x2F;kueski-los-geeks-se-ponen...</a>. [Spanish]","time":1438616082,"type":"comment"}