{"by":"evtothedev","id":9996466,"parent":9996333,"text":"SnapDocs | Full Time | San Francisco, CA | Remote-to-hire OK<p>Competitive salary, benefits, and generous options.<p>The ideal candidate is someone who plans to become a lead engineer (or perhaps a product manager) in the not too distant future.<p>We&#x27;re a small team tackling the absolutely massive mortgage market. We&#x27;re bringing modern, elegant software to a field that still relies on fax machines and manilla envelopes. We are bringing security, efficiency and joy to a paper-based pillar of the US economy.<p>The type of problems we&#x27;re tackling involve workflow, product design, and data. Rapid feature iteration? Oh, yeah! We do SaaS for non-technical users. Everyday, our clients call and email to say that we&#x27;re making them happy, and that feels great. However, in this industry, most people are unaware of what modern software is capable of. That means we must do research, gather data and talk to customers to inform each of our choices.<p>Snapdocs&#x27;s culture is one that trusts its team members to make smart decisions. This means we value both independent work as well as seeking collaboration. We&#x27;re becoming ubiquitous in one segment of the market and we&#x27;re looking to hire another core engineer to help us expand further.<p>Required Skills<p>Ideally, you&#x27;re a fullstack coder. But in reality, you probably lean either towards the front or the back end. That&#x27;s fine, so long as you know (and are proud of) your strengths.<p>Being the 4th member of on a fast-growing technical team. This means helping to form a healthy and happy culture. We strive to be respectful of each other&#x27;s time and point of view. We&#x27;re learning how to do this together. We want to create a place where it&#x27;s OK to fail, and that you know the team has your back the whole way through.<p>Self-motivated. To us that means when you get an interesting problem, you will rip into it until you understand its nuances and perhaps have a glimpse of the solution.<p>Empathy. We work closely with our customers, meaning phone calls, emails, and sometimes lunch. It is important in this job to listen to them so that we can build what they need and want.<p>Knowledge of AWS would be excellent.<p>UX experience (or interest in cultivating it) would be excellent.<p>Document classification experience (OCR, etc.) would be a plus.<p>Send an email to jobs@snapdocs.com telling us about yourself. Please include a resume and a link to github if your profile is informative.","time":1438614709,"type":"comment"}