{"by":"ejdyksen","id":9996507,"parent":9996333,"text":"Mutually Human - Grand Rapids, MI and Columbus, OH (on-site, full time)<p><a href=\"https:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;</a><p>We are a small team passionate about making people&#x27;s lives better through software. We are hiring engineers and designers at our offices in Grand Rapids or Columbus.<p>A little bit about us:<p><pre><code>  - We write custom software of all shapes and sizes for clients all over the US.\n  \n  - We aren&#x27;t limited to any really specific set of technologies, which is a great\n  opportunity to learn. In the past two years, I&#x27;ve worked with Python,\n  Objective-C, Swift, Backbone.js + PhoneGap, Angular + CoffeeScript,\n  Node.js, and Ruby&#x2F;Rails.\n  \n  - We practice a sustainable pace. We recognize that we each have lives,\n  activities, and families outside of work. Late nights and &gt; 40 hour weeks are\n  rare by design. Last year I worked an average of 40.408 hours per week.\n  \n  - We offer competitive salaries, health&#x2F;vision&#x2F;dental insurance, quarterly profit\n  sharing, retirement + match, weekly catered lunches, and a top-floor office\n  with snacks, guitars, and your choice of standing or sitting desks.\n  </code></pre>\nA little bit about you:<p><pre><code>  - You love making software, and you have a couple of years of experience building\n  software with a variety of tools and technologies.\n  \n  - You learn new stuff quickly. You’ve used a lot of technologies, but you’re not\n  afraid to use more. You have some experience with web or mobile tech.\n  \n  - You believe software is written for humans, not computers.\n  \n  - You want to come into work every day and enjoy the people you work with.\n</code></pre>\nIf you&#x27;re interested, check out our website:<p><a href=\"https:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;hiring&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;hiring&#x2F;</a><p>Also, feel free to get in touch with me:<p>ej@mutuallyhuman.com","time":1438614898,"type":"comment"}