{"by":"jhdavids8","id":9996469,"parent":9996333,"text":"Pathgather | Front-End Engineer &amp; Back-End&#x2F;API Engineer | New York, NY | ONSITE preferred, REMOTE maybe | pathgather.com<p>Pathgather is a Techstars NYC startup building an enterprise learning platform that - unlike traditional learning systems forced on employees - is one you&#x27;ll actually enjoy using. We’re solving a big problem felt by almost all large companies: how to continuously train and educate your workforce with modern&#x2F;relevant content.<p>One way we&#x27;re doing that is through one of the more engaging and attractive interfaces in the enterprise market today, paired with an extreme focus on the end user (the employee). Past learning systems have focused heavily on compliance, providing tools to administrators to force and require learning. We want to inspire learning, not require it.<p>And even though we’re still pretty small (8 full-time members) and young (just been launched for a bit over a year), companies are starting to take notice. We’re working with some pretty notable customers, including Walmart, Qualcomm, and Twitter.<p>We’re looking to add a member on both the front-end team (Javascript&#x2F;Coffeescript, Angular, Sass, Haml, Browserify, Grunt) and back-end (Ruby&#x2F;Rails, Postgres, Redis, Elasticsearch). For the front-end, you&#x27;d do everything from helping define the UI&#x2F;UX for new feature releases to actual feature implementation in the usual front-end technologies (Javascript, CSS, HTML, etc). For the back-end, we’re looking for an API expert, someone who can come in and our own suite of APIs (both internal and external).<p>To apply, please email me at jamie@pathgather.com. We have a great work environment in our Union Square office and would love for you to be a part! You can also see more about us and what we offer at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;pathgather&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;pathgather&#x2F;jobs</a> and <a href=\"https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;company&#x2F;pathgather\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;company&#x2F;pathgather</a>","time":1438614716,"type":"comment"}