{"by":"ComputerGuru","id":9997354,"parent":9996333,"text":"REMOTE WORLDWIDE: various part-time and full-time positions.<p>We are NeoSmart Technologies (based in Chicago, IL) - as we like to bill ourselves, one of few startups making money selling real software and solving real problems. We develop and sell high-quality software solutions to consumers and businesses, solving tricky problems in (largely) niche domains elegantly and effectively.<p>We are currently looking for a number of business-minded individuals, developers, writers, and more to help us take everything to the next level.<p>* Full-time business developer direly needed. We have software solutions businesses are tripping over themselves to buy and other solutions that can reduce the operating expenses of some businesses ten-fold but we don&#x27;t know how to sell. If you have what it takes to reach out to these companies and bring them in, if you want to help us take our software to the next level and sell it the way it deserves to be sold, we want you. Previous experience in the B2B market (esp. with contacts) is a huge bonus.<p>* AdWords (and&#x2F;or other online advertising) expert? We&#x27;ve heard that ads are a dying business, but we don&#x27;t buy it. If you know how to craft the right AdWords ads and bid for the right spots to drive good customers to a software business in the backup&#x2F;recovery sector, look no further. Our developers and engineers have done their best but have ultimately failed to come up with an ad strategy on Google&#x2F;Facebook&#x2F;twitter that doesn&#x27;t cost us an order of magnitude more than what it brings in. We admit failure, but we&#x27;re not giving up. If you have experience in this field, please get in touch! We&#x27;re selling real products that solve real problems and bring in real money (while saving our customers a ton in the process), but we need your help to make it happen!<p>* HTML&#x2F;CSS developers wanted to modernize our existing site and create a mobile-friendly browsing experience for our users. If you have a talent for creating stunning landing pages or lightweight, snappy, and compatible websites - we want you! We&#x27;re not interested in bloat and form over function; our websites follow our own software&#x27;s mantra: sweet and simple. Our site is largely ASP.NET&#x2F;C#, landing pages are pure HTML&#x2F;CSS&#x2F;JS. ASP.NET experience is not a must, but comes in handy to better-understand the templating.<p>* We are looking for desktop C# developers that can make a good-looking and intuitive product to join our time and expand our repertoire of award-winning, world-class software. Most of our products are system-level utilities, previous experience developing commercial Windows software solutions is recommended. You&#x27;ll largely be responsible for small utilities and applications yourself.<p>* Are you a tech-savvy creative writer, who loves to experiment with software and explore new things? We are looking for writers and bloggers to expand our collection of guides, tutorials, and reviews! Windows and Mac experts are welcome; we are also highly-interested in doing new things in new and novel ways so if you have a penchant for something special (say, video reviews), introduce yourself. Experience with beta software and the courage to brave new versions of operating systems and experiment with the latest and greatest technology is a must. If this is you, please get in touch - we want to talk!<p>* Technical writers with experience in Windows and preferably also Linux&#x2F;BSD that know their way around virtual machines - please get in touch! We want to expand our user manuals and our documentation for our technical support staff with state-of-the-art and up-to-date documentation. Help us make our users and our staff happy, and find potential for improvements while you&#x27;re at it.<p>* IT experts with a knack for writing - we want to expand our online knowledgeable with more issues, better solutions, clearer instructions, and proper, vetted knowledge. Do you love researching? Have a penchant for QA work but want to apply it in novel and interesting ways? Help us document gotchas and find real (not folklore&#x2F;he-said-she-said) fixes for Windows, Mac, and Linux errors to help make solving these problems easier for everyone out there.<p>You probably have an idea of what we do from the few paragraphs above. Here&#x27;s the thing: we&#x27;re flexible! Do you see an opportunity to do something different that we might love? Don&#x27;t hesitate to get in touch, we&#x27;re open-minded and we&#x27;re hiring! We&#x27;re accepting both freelancers, part-time remote employees, and full-time remote employees alike.<p><a href=\"https:&#x2F;&#x2F;neosmart.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;neosmart.net&#x2F;</a> and you can contact me directly at mqudsi@neosmart.net","time":1438619241,"type":"comment"}