{"by":"moxie","id":9997853,"kids":[10008057],"parent":9996333,"text":"Open Whisper Systems • San Francisco • Full Time • ONSITE<p>Open Whisper Systems is making private communication simple. Our technology is used by hundreds of millions of people, and everything we produce is open source. What it&#x27;s like to work with us: <a href=\"https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;</a><p>iOS Front End -- Someone intimately familiar with iOS development and internals, who has an appreciation for the craft of software development and experience with making decisions that result in great products. No experience with cryptography necessary, just solid experience developing for iOS and an eye for good design.<p>Android Developer -- Is the pleasure center of your brain directly wired to the experience of a slick UX or a nice animation? Do you hunt down memory leaks and StrictMode violations for fun? We&#x27;re looking for someone with deep knowledge of the Android framework and an equally strong intuition for pairing beautiful app experiences with beautiful code. You&#x27;ll be the architect of major features, making your code available to the world. You don&#x27;t need to be a security expert; it&#x27;s knowing how to make complicated systems simple to use that&#x27;s at the heart of what we do.<p>Mobile UI &#x2F; Product Designer -- We’re seeking an original thinker with strong visual design skills ready to help make private communication simple. You&#x27;ll take on developing the look and feel of Signal on iOS, Android, and the desktop. You’ll be responsible for updating the visual design for the app and helping shape consistent guidelines to communicate a compelling user story across our products and other touchpoints. You’ll work closely with a team of engineers with a passion for making usable software. No experience with cryptography necessary, just intuition for what makes a great product and solid experience designing products that are a joy to use.<p>See more at <a href=\"https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;whispersystems.org&#x2F;workworkwork&#x2F;</a>, or send us a note at workwithus@whispersystems.org","time":1438621996,"type":"comment"}