{"by":"krg","id":9997493,"parent":9996333,"text":"TechEmpower - Los Angeles area, California (El Segundo, near LAX) - ONSITE<p>You may recognize us from the Web Framework Benchmarks that have been discussed on HN periodically: <a href=\"http:&#x2F;&#x2F;www.techempower.com&#x2F;benchmarks&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.techempower.com&#x2F;benchmarks&#x2F;</a><p>We hire people, not skill sets. If you&#x27;re a smart, motivated developer who likes our company culture, let&#x27;s talk.<p>Over the past 17 years we&#x27;ve cultivated a great group of people to work with. Our developers are smart, thoughtful, respectful to each other, opinionated, dedicated, and fun. We don&#x27;t hire often, and when we do, we value these qualities as much as technical abilities.<p><pre><code>    Challenging and varied projects\n    Informal, comfortable environment\n    Intelligent, engaged people\n    Lively, respectful technology discussions\n    Frequent mentoring\n    Easy camaraderie\n    General culture of helpfulness and friendliness\n</code></pre>\nTeams at TechEmpower are typically between 2 and 6 people. Because of the small size of our teams, we need developers able to work on all aspects of an application (&quot;full stack&quot; developers). We rely on individual developers to do much of the software design, with guidance and discussion, and actively work to improve each other&#x27;s technical capabilities.<p>On average, a typical developer will get exposure to 3 or 4 different projects over the course of a year. Since each project has a different technology stack, developers gain varied experience over time and never stop learning.<p>We pride ourselves on doing the best work we can for our clients. This means working with them to really understand what they need built, carefully planning how to do it, and delivering what we promise while maintaining a sensible work&#x2F;life balance. We build quality applications and have fun doing it.<p>The technologies we use vary over time with our mix of projects. Here is a snapshot of the technologies we use at the moment:<p><pre><code>    Languages: Java, JavaScript, Python, Go, C#, Ruby, PHP\n    Tools: Git, Docker, Jenkins (Continuous Integration), Sonar (static code analysis), IntelliJ, Eclipse, Ant, Maven\n    Web: Jersey, .NET MVC 5, Django, Node.js, Go, Rails, Handlebars, Backbone, Ember, Angular, Knockout, Servlets, jQuery, etc.\n    Mobile: iOS, Android, PhoneGap\n    Hosting: AWS (EC2, RDS, etc.), Rackspace Cloud, Linux deployments\n    Data Persistence: ORM (Hibernate, etc.), MySQL, Postgres, MS SQL Server, NoSQL (Redis, Riak, etc.)\n</code></pre>\nPlease apply here: <a href=\"http:&#x2F;&#x2F;jobs.techempower.com&#x2F;hn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.techempower.com&#x2F;hn</a>","time":1438619907,"type":"comment"}