{"by":"shanly","id":9997031,"parent":9996333,"text":"Ticketsolve - <a href=\"http:&#x2F;&#x2F;www.ticketsolve.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ticketsolve.com</a>, Dublin, Ireland - is hiring software developers for REMOTE working, short version below, details here: <a href=\"https:&#x2F;&#x2F;weworkremotely.com&#x2F;jobs&#x2F;1892\" rel=\"nofollow\">https:&#x2F;&#x2F;weworkremotely.com&#x2F;jobs&#x2F;1892</a><p>We are currently going through a very exciting and interesting evolution of our platform. We are moving from a traditional RoR architecture to a modern &quot;single page application&quot;, exposing our application as a set of hypermedia API&#x27;s consumed by an Ember front-end to provide a rich interactive experience.<p>We are now looking to add to our team to accelerate the creation and rollout of this change. To do this  we are looking to hire 2 people to join our team. These 2 positions should be able to contribute across the entire development stack. However, we are looking for one of the new hires to have strong experience in building and rolling out SPAs. Ideally, with experience using Ember to do this.<p>Skills &amp; Requirements<p>=====================<p>2 to 5 years experience developing web applications\nExperience with programming languages Ruby and Javascript preferred but good programmers always welcomed\nStrong understanding of front-end technologies: JavaScript, HTML5, SASS, Ember or any other MV* framework\nStrong programming skills with focus on clean design, well refactored code and automated testing  \nComfortable working as part of a remote team\nRelated to remote working a working knowledge of English is required<p>Technologies we use<p>=====================<p>Ruby on Rails<p>Yaks, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;plexus&#x2F;yaks\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;plexus&#x2F;yaks</a>, open source project created from the core hypermedia technology we use to build our API<p>MySQL<p>Ubuntu servers managed through CHEF<p>Ember 1.13.x going on 2.0\n  we track and upgrade to Ember regularly\n  we are currently in the process of moving to Ember CLI<p>GitHub for source code management and process support<p>Travis &#x2F; TeamCity for continuous integration<p>Meet the Team<p>=====================<p><a href=\"http:&#x2F;&#x2F;www.ticketsolve.com&#x2F;about-us&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ticketsolve.com&#x2F;about-us&#x2F;</a>","time":1438617639,"type":"comment"}