{"by":"scottdthomas","id":9998711,"parent":9996333,"text":"HealthExpense — Sunnyvale, CA — Lead&#x2F;Senior Engineers — Backend &amp; DevOps — FULLTIME, ONSITE<p>HealthExpense (<a href=\"http:&#x2F;&#x2F;www.healthexpense.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.healthexpense.com</a>) is looking for experienced engineering hands to round out our core team and to help us build the next great healthcare technology startup. If you are interested in joining a dynamic early-stage startup that is already seeing significant traction — there are already 1M+ employees using our platform — we’d love to talk to you.<p>You can reach us at jobs@healthexpense.com (or me at sthomas@healthexpense.com). There’s no resume “black hole” here — you’ll get a prompt, respectful reply.<p>OUR STACK: Backend — Scala (we’ll help you get up to speed), C++. DevOps — AWS, Chef. More here: <a href=\"http:&#x2F;&#x2F;stackshare.io&#x2F;healthexpense&#x2F;healthexpense\" rel=\"nofollow\">http:&#x2F;&#x2F;stackshare.io&#x2F;healthexpense&#x2F;healthexpense</a><p>ABOUT HEALTHEXPENSE:<p>In healthcare, $600B (that’s a B) is wasted every year. The HealthExpense platform (think “Mint for healthcare”) helps consumers and benefits administrators make the most of their healthcare dollars — tackling the mundane and often unnecessarily-complicated tasks like submitting insurance reimbursement claims, paying bills, and tracking deductibles and flex-spending caps. Our fast-growing network is quickly becoming the platform of choice for large employers and third-party administrators, and we’re already helping over 1M employees make better and more cost-effective healthcare decisions.<p>A few key details:\n- We’re well-funded and stable: we offer great salaries, medical&#x2F;dental&#x2F;vision coverages, and generous bonuses. \n- We’re off to great start. Our platform is already in use by millions, and we’re just getting started. \n- We set you up for success: We never skimp on the best hardware or tools money can buy.\n- We want you to share in our success. Every offer includes a healthy dose of stock options.\n- We’re building for the long-term. Our key executives have been around the block, and understand the importance (and sustainability) of true work-life balance.","time":1438627202,"type":"comment"}