{"by":"claudiac","id":9999680,"parent":9996333,"text":"GPU Infrastructure Engineer | Clarifai | Deep Learning Technology<p>Clarifai was founded in 2013 by Matthew Zeiler to bring the world’s best image recognition technology to market. Our expertise in deep neural networks helped us achieve the world’s best published image labeling results [ImageNet 2013]. Since then Clarifai’s deep learning systems have improved orders of magnitude in speed, vocabulary size, memory footprint and have expanded beyond images to extract knowledge from all forms of data.<p>Our technology and position in the field of machine learning has already seen extraordinary success and recognition with significant impact on the advancement of technology as a whole and amongst the developer community with our Developer API. See the press and try the demo.<p>Clarifai is backed by Google ventures, USV, NVDIA, Qualcomm, Osage, Lux Capital, LDV Capital &amp; Corazon Capital.<p>We are located in NYC.<p>About the position<p>GPUs have had a massive impact on how much information we can process and understand. We are looking for a highly motivated engineer who can make them scream across many different architectures, operating systems and devices.<p>Responsibilities<p>Optimize our gpu kernels across a wide variety of architectures.\nInterface low-level kernels with high level languages to make it simple and intuitive to leverage performance gains.\nInterface the GPU routines for communication across multiple devices to support parallel operation of our machine learning systems.\nSkills<p>Excellent programming skills and knowledge of C++.\nKnowledge of GPU architecture and corresponding parallel programming platforms such as OpenCL, OpenGL, or CUDA.\nExperience optimizing GPU kernels and conducting performance analysis.\nDeveloped solutions which leverage intra- and inter-node GPU communication using device-to-device, device-to-host or other communication patterns.<p>Contact: claudia@clarifai.com\nBachelor’s degree or higher level degree.","time":1438634926,"type":"comment"}