{"by":"garettb","id":15826734,"parent":15824597,"text":"Emailage | Machine Learning Engineer | Chandler, AZ | Onsite<p>Company Info:<p>Emailage is growing at an outstanding rate and we have an immediate opportunity for a skilled and enthusiastic Machine Learning Engineer to join our team.<p>Emailage is a global hub of intelligence associated with email addresses, which empowers companies to determine whether a transaction is fraudulent or legitimate. This vast network is combined with machine learning algorithms to generate a Risk Score, based on rules that are easily tailored to existing risk engines. Emailage Risk Assessment empowers companies to effectively fight fraud, increase revenue and transaction approvals, while preventing unnecessary customer friction.<p>Position Intro:<p>Data science and machine learning are the foundation of our approach to identify both risky and positive behaviors. We see it as the process of creating knowledge from data. At Emailage, we see a lot of data, and that will be your playground to implement scalable machine learning models and enhance big data processing capabilities in collaboration with our data scientists. You will be developing and deploying our advanced algorithms on production and perform as a bridge between data science and software development teams.<p>Some skills we are looking for: \nAWS (S3, EC2, EMR) | Python, R, SQL | Cassandra, DynamoDB, MongoDB | Knowledge of various Machine Learning frameworks<p>Full job description can be found here:<p><a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;machine-learning-engineer-at-emailage-513685943&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;machine-learning-engineer...</a><p>We have other technical positions on the IT side:<p>Sr. QA Automation Engineer: <a href=\"https:&#x2F;&#x2F;blog.emailage.com&#x2F;jobs&#x2F;sr-qa-automation-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.emailage.com&#x2F;jobs&#x2F;sr-qa-automation-engineer&#x2F;</a>\nIT Infrastructure Engineer: <a href=\"https:&#x2F;&#x2F;blog.emailage.com&#x2F;jobs&#x2F;it-infrastructure-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.emailage.com&#x2F;jobs&#x2F;it-infrastructure-engineer&#x2F;</a><p>If you have any questions&#x2F;interested, feel free to send me an email @ garett.brock@emailage.com","time":1512157709,"type":"comment"}