{"by":"kcrossncc","id":15826466,"kids":[15829319],"parent":15824597,"text":"NCC Group (formerly Matasano Security, iSEC Partners, and Intrepidus Group) - Atlanta, Austin, Chicago, Houston, New York, San Francisco, Seattle, and Sunnyvale, CA<p>Now that you&#x27;ve awoken from your Tryptophan-induced post-Thanksgiving coma, hide from your visiting relatives in the back room and consider your next career move! Consider NCC Group!<p>NCC Group is currently looking for passionate security minds to join our merry crew! Take your skillset to the next level, perform cutting edge security research, and contribute on interesting client engagements. The elusive triple threat.<p>What do we do exactly? Penetration testing, security analysis, DFIR, and cutting-edge research into current technologies and attacks (breaking things). You spend most of your day thinking about security systems and how they can break. You get to be creative and have a lot of freedom to be clever while learning new technologies at a very fast pace. Engagements are usually 2-4 weeks long and in a year you will be exposed to 15-20 products and technology stacks. Your work will typically initiate person-months of security improvements in products millions of people use. You will have access to senior engineers&#x2F;architects and your findings&#x2F;ideas will be heard by senior decision makers. You will have enormous impact in making the software people use safer!<p>All of our consultants are also security researchers, with dedicated research time. Not too shabby!<p>We are looking to add new colleagues in all of our office locations, and are looking to add folks specifically in the Houston market should you have interest. We are also seeking senior DFIR leaders in our New York and Bay Area offices!<p>If you want to learn more about us and our open positions check out our:<p>Blog - <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;</a><p>Cryptopals - <a href=\"http:&#x2F;&#x2F;cryptopals.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com&#x2F;</a><p>Microcorruption - <a href=\"http:&#x2F;&#x2F;microcorruption.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;microcorruption.com&#x2F;</a><p>If you&#x27;re ready to apply, contact us at: <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;careers&#x2F;current-vacancies&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;about-us&#x2F;careers&#x2F;current-vacan...</a> or reach out directly at na-cv@nccgroup.trust.<p>We&#x27;d love to hear from you! Happy holidays from NCC Group Recruiting!","time":1512155975,"type":"comment"}