{"by":"johnumbaugh","id":15827701,"parent":15824597,"text":"CareEvolution | Dev, DevOps, and Customer Relationship Management | Ann Arbor, MI | ONSITE, REMOTE, VISA, <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a><p>What we do actually matters.<p>It&#x27;s estimated that 250,000 people die in America annually because of medical errors. That makes it the #3 cause of death, just behind heart disease and cancer (goo.gl&#x2F;zntNUd). This is a major societal catastrophe - and it needs to be fixed. Part of the solution is the long-overdue modernization of our nation&#x27;s health IT infrastructure. This is CareEvolution&#x27;s mission - to create better patient outcomes by modernizing - and connecting - our health IT systems.<p>We&#x27;re looking for highly-technical, effective people to manage all aspects of customer interaction.  This includes fielding, diagnosing, and solving customer issues quickly, and escalating when and where necessary.  It also includes managing customer requests, and regularly engaging with customers.<p>This position requires a high degree of technical competency, including - preferably - at least some of the following: doing ETL; writing SQL queries; diagnosing and addressing slow-running SQL queries by using SQL profiler, rebuilding indexes, digesting a SQL plan, etc.; experience writing and fixing bugs in ETL processes, web apps, and&#x2F;or mobile apps; DevOps expertise including over AWS, Azure, and hosted solutions; clinical IT expertise, including HL7, claims formats, IHE profiles, CCDs, EMRs&#x2F;EHRs, FHIR.<p>We&#x27;re a small team - still under 100 people (and all technical!) - but our platform manages health data for over 130 million people.<p>Check out our company page on <a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;companies&#x2F;careevolution\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;companies&#x2F;careevolution</a><p>Visit our website at <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a><p>Submit resumes (PDF please!) to resume@careevolution.com .<p>Note: this job is open to US Residents only. Foreign nationals CAN apply, but only if you live within the US.","time":1512163826,"type":"comment"}