{"by":"ghc","id":15826943,"parent":15824597,"text":"Sentenai | <a href=\"http:&#x2F;&#x2F;sentenai.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sentenai.com</a> | full-time | On-site | Boston<p>Contact: jobs@sentenai.com<p>Key words: Data Scientist, Machine Learning Engineer<p>Sentenai is a Boston startup providing sensor data infrastructure for machine learning and predictive applications. Sentenai automates the process of ingesting and organizing sensor data so that data science teams and automation engineers can search for historical patterns and behaviors without the need for manual preparation or integration projects. We enable data scientists to explore and operationalize their data in real-time applications in the languages and toolkits they already use. Our customers are solving bleeding edge industrial IoT problems in complex and large-scale environments.<p>Sentenai is hiring our first dedicated data scientist to help us learn from customers and improve our product libraries. We are looking for someone with deep experience working with time series data, including anomaly detection, forecasting, and clustered behavior patterns. Desired skills include Torch, TensorFlow, Keros. Candidate should have knowledge of Python and R. The role will allow working on a wide variety of projects with our customers who are working on challenging real world problems with sensor data in industrial settings.<p>The position is based in Cambridge, MA and US work authorization is required.<p>Responsibilities:<p>- Developing machine learning techniques for working with noisy sensor data<p>- Collaborating with outside data scientists to shape Sentenai’s product roadmap<p>Creating content:\n - Guides to demonstrate how to use advanced machine learning techniques to predict anomalies and do forecasting on sensor data.<p>- Tutorials for data scientists getting started with Sentenai<p>- Sample machine learning projects using Sentenai<p>- Representing Sentenai at meetups and conferences<p>- Using your expertise to help customers get the most out of Sentenai<p>Requirements:<p>- 3+ years of experience working in research- or production-level data science stacks (python&#x2F;anaconda preferred)<p>- Experience with time-series predictions<p>- Working knowledge of dynamic programming, reinforcement learning, change-point detection, and signal processing techniques<p>- Strong written communications skills<p>Interested? Contact us at jobs@sentenai.com","time":1512159297,"type":"comment"}