{"by":"prattl","id":15828508,"parent":15824597,"text":"Hire an Esquire | UX&#x2F;UI Designer; Marketing Director | Pittsburgh, PA, USA or New York, New York, USA | Full time, ONSITE<p>Hire an Esquire is a Legal Labor Marketplace &#x2F; Vertical SaaS transforming legal freelance, hiring and recruiting by automating and updating an outdated process. We&#x27;re a lean, energetic startup team with offices in NYC, Pittsburgh, San Francisco, Philadelphia, and San Antonio.<p>[UX&#x2F;UI Designer] We’re rounding out our product team by searching for an ambitious and detail-oriented UX&#x2F;UI designer to join our product team in Pittsburgh, PA. The ideal candidate will have strong experience in responsive web application design and will be tasked with creating new and improving existing user workflows as we continue building out our product. We’re looking for somebody who has experience delivering both UX and UI designs, with a strong emphasis on responsive design and user-testing.<p>Apply at <a href=\"http:&#x2F;&#x2F;hireanesquireteam.applytojob.com&#x2F;apply&#x2F;TaTDoqgz2t&#x2F;UXUI-Designer\" rel=\"nofollow\">http:&#x2F;&#x2F;hireanesquireteam.applytojob.com&#x2F;apply&#x2F;TaTDoqgz2t&#x2F;UXU...</a> (be sure to mention HN)<p>[Marketing Director] We are also looking for an ambitious, analytical, and creative growth marketer to lead our marketing team, manage all online and offline channels, and build sustainable growth. You will work closely with the Sales and Product team to develop a holistic strategy that achieves Hire an Esquire’s mission. Our mission is to help redefine the concept of “work” in the legal industry by offering entrepreneurial options for legal talent seeking a more flexible, modern legal career.<p>Apply at <a href=\"http:&#x2F;&#x2F;hireanesquireteam.applytojob.com&#x2F;apply&#x2F;o0CtW3jKww&#x2F;Marketing-Director\" rel=\"nofollow\">http:&#x2F;&#x2F;hireanesquireteam.applytojob.com&#x2F;apply&#x2F;o0CtW3jKww&#x2F;Mar...</a> (be sure to mention HN)","time":1512169064,"type":"comment"}