{"by":"utefan001","id":15826281,"parent":15824597,"text":"DnsLearning.org | REMOTE | part-time | co-founder (tech or marketing) | hourly rate + equity<p>DnsLearning.org is looking to hire remote founder #3.  We often work long hours on Saturday, but we have a lot of fun solving problems that involve DNS, Linux, MySQL, bootstrap, iOS, Android, etc..  Founder #2 is interviewing today with one of the big 5 tech companies which means we need another founder who can manage at least one of the following areas: PHP, iOS and Android.  Git experience and Linux skills are important.  We are also interested in a founder who can fully manage a professional Kickstarter&#x2F;Indiegogo&#x2F;Fundly launch.<p>DnsLearning was created to help parents who have young kids whose minds are beginning to be taken over by YouTube&#x27;s deep neural network recommendation system.  In other words, we are trying to restore some balance between how much time a young child spends watching minecraft videos vs the time spent on education sites like DuoLingo and Khan Academy.<p>Our tech works by setting a child&#x27;s computer or tablet to use one of our DNSLearning servers.  After 30 mins, the server will switch the device from &quot;play mode&quot; to &quot;learn mode&quot;.  In learn mode, entertainment sites are blocked.  When the user earns a few points on one of our supported education sites, we will detect this and switch the device back to play mode.  It only takes 3 or 4 mins for a child to earn enough points to get back to play mode.<p>Real marketing will begin once the apps are 100% ready.  Currently we have 130 users that have signed up to use our app manually, using manual DNS config.  Android and Apple apps are very close to being feature complete.<p>A few tech details about us:<p>There are always interesting PHP, C++, MySQL, iOS and Android problems to solve.  For example, how do you uniquely identify different users coming from the same IP address in Android, iOS, or using a manual DNS setup?  For manual DNS, our answer is to use a separate server for multiple users in the same house.  If a customer has IPv6, we are able to assign a unique IP address to every customer.  It is easy to assign hundreds of IP addresses to a single server.  One of the problems we had to solve with IPv6 has to do with knowing, in our C++, what address the incoming UDP packet used to access the server.  When we were working on this problem, the Linux kernel did not save this information.  Last time I checked, Go still does not support this. Ngnix added similar support only a few months before we did.<p>We are looking for a hard working, passionate co-founder WHO BELIEVES LIKE WE DO, that parents deserve technology that is able to guide young minds away from junk grade online entertainment toward, at least for a few minutes, education sites that will help young minds to develop confidence and skills to hopefully provide a stronger knowledge foundation that is critical for their future.<p>support@dnslearning.org","time":1512154741,"type":"comment"}