{"by":"chintan","id":15825023,"parent":15824597,"text":"Applied Informatics, NYC <a href=\"http:&#x2F;&#x2F;ainfo.io&#x2F;|\" rel=\"nofollow\">http:&#x2F;&#x2F;ainfo.io&#x2F;|</a> Fullstack Software Engineer | Python, Django, React | Onsite<p>We’re actively looking for full-stack software engineers who are passionate about building cutting-edge systems that work on the latest tech stack (Python, React, AWS) but also help save lives. You’ll have an opportunity to learn and lead development of several AI-enabled products and solutions within the company that are geared to help accelerate the development of new cures and to reduce the inefficiencies in how healthcare information is managed.<p>Some of the things you’d be working on:<p>- Integrating health&#x2F;life sciences machine learning&#x2F;NLP&#x2F;data APIs into web apps.<p>- Scaling databases, applications and APIs on AWS&#x2F;docker&#x2F;container platforms.<p>- Planning product development and building intuitive and engaging UIs.<p>We’re headquartered in NYC (right across the street from the iconic Empire State Building) and we have offices in the Philippines and India. AND…..we can do headstands even after an all-night hackathon! So, if you want to work with technologies that have a real and positive impact on people’s lives, and you also want a fun time then come join our team.<p>The process: a quick phone screen, technical interview, take-home exercise then an onsite to meet with the team.<p>Requirements:<p>* Bachelor&#x27;s or an advanced degree in Computer Science or related technical field.<p>* Strong knowledge of the Python and front-end technologies including HTML, CSS and Javascript.<p>Benefits&#x2F;Perks:<p>* As a health-conscious company working in the healthcare domain, we provide free uBiome gut tests, 23andMe genomic test and fitness tracker of your choice (Fitbit, Garmin or Apple Watch).<p>* And of course, a competitive full-time salary, health insurance, flexible vacation policy with work from home option.<p>* Relocation and Visa assistance as needed.<p>If you’re unsure about applying or have any questions about the role or team, please don’t hesitate to email our CTO Chintan (chintan@appliedinformaticsinc.com) directly","time":1512146698,"type":"comment"}