{"by":"jbaviat","id":15825750,"parent":15824597,"text":"Sqreen - <a href=\"https:&#x2F;&#x2F;www.sqreen.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io</a> | Full-time Onsite engineers | Engineering team in Paris (France)<p>Sqreen is a security tool built with developers in mind (we are like New Relic, but for security).<p>We develop solutions that combine instrumentation, defensive algorithms and machine learning.<p>We are recruiting new engineers to join the team creating Sqreen agents for all technologies, and ship our incoming products.<p>Our most researched positions are within the agents team. You will join the guys that are writing the best instrumentation agents ever, and in all technologies (so far Ruby, Python, Node.js, PHP). These agents are protecting hundreds of thousands of applications, gazillions of HTTP requests per months...<p>- a C software engineer. The responsibility includes developing the PHP version of the Sqreen agent. PHP is written in C, we need an extension able to manipulate PHP internals to do PHP instrumentation), have you ever written something this cool for production usage?)\n\t<a href=\"https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs-c\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs-c</a><p>- a Java software engineer. This one is all about being the core maintainer of the Sqreen Java Agent. You need to be super comfortable  of the JVM internals for this one (we are relying on the Byte Buddy library for instrumentation: <a href=\"http:&#x2F;&#x2F;bytebuddy.net&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;bytebuddy.net&#x2F;</a>).\n\t<a href=\"https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs-java\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs-java</a><p>- a DevOps engineer. We have cool challenges like duplicating our infra to other zones (e.g. US, Asia), we are currently moving to DynamoDB, and we plan to do innovative usage of CDNs such as Fastly (<a href=\"https:&#x2F;&#x2F;www.fastly.com&#x2F;blog&#x2F;beacon-termination-edge&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastly.com&#x2F;blog&#x2F;beacon-termination-edge&#x2F;</a>)\n\t<a href=\"https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs&#x2F;sqreen-aws-devops.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs&#x2F;sqreen-aws-devops.html</a><p>Sqreen is already live for Ruby, Python, Node.js, and PHP.<p>You can find our other job offers here: <a href=\"https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sqreen.io&#x2F;jobs&#x2F;</a><p>Email: jobs@sqreen.io","time":1512151220,"type":"comment"}