{"by":"aloewenthal","id":15829860,"parent":15824597,"text":"Comfy|Senior Frontend Engineers|Oakland, CA|Onsite, Full-time<p>ABOUT US:\nWe are a venture-backed startup in Downtown Oakland that has developed an industry-first application allowing occupants to control the temperature in their office!  Our mission is to create great relationships between people and their workplaces. Comfy allows office occupants to increase their comfort and improve their productivity via a web and phone app that controls their physical environment. We apply machine learning and data insights to create a dynamic feedback loop between people and the places that support them, helping companies create satisfying, productive work experiences that adapt to people’s changing needs. We’re simultaneously solving the biggest complaint people have about their workplace AND saving loads of energy.<p>ABOUT THE ROLE:\nAs a Senior Frontend Developer at Comfy you help bridge design and engineering daily. Your eye for design brings mockups to life and will delight our users with transitions and polish. Your understanding of technical tradeoffs, curiosity in discovering edge cases, and craftsmanship efficiently creates reliable code. You will help us investigate the new technologies that will allow our team to quickly iterate and build the best possible experience.<p>ABOUT YOU:\nYou are a frontend developer who loves crafting beautiful applications that work smoothly on all browsers and on mobile. You&#x27;ve worked with IE and mobile Safari and they don&#x27;t scare you. You have the instincts to avoid troublemakers and performance hogs like tag-based selectors and frequent DOM lookups. Your code is maintainable, well-structured, and just works. You enjoy exploring new technologies, being on the leading edge, and collaborating with a team of talented engineers. You communicate effectively and help the entire team increase productivity by mentoring team members and sharing your expertise.<p>REQUIRED:\n4+ years of industry experience developing large-scale web applications\nIn depth knowledge of HTML&#x2F;CSS&#x2F;JS across browsers (yes, IE and mobile, too!)\nExperience with responsive design: AngularJS, Webpack, ES6\nProven ability to work collaboratively on an interdisciplinary team of designers, developers, and QA\nAbility to write comprehensible, well-structured, highly performant code\nApplied knowledge of computer science fundamentals: data structures, algorithms, OO design<p>BONUS:\nKnowledge of frontend testing frameworks like Karma &amp; Protractor\nExperience with Cordova, Android, or iOS development\nA willingness to pitch in when needed and work on our Python backend in Django<p>APPLY: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;lsh48x1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;lsh48x1</a> &amp; mention HN\nQUESTIONS? alicia@comfyapp.com","time":1512183382,"type":"comment"}