{"by":"kaizendad","id":15828899,"parent":15824597,"text":"Synacor | Full-Time | On-Site | Los Angeles, CA; Buffalo, NY; Pune, India | <a href=\"https:&#x2F;&#x2F;www.synacor.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.synacor.com&#x2F;careers</a><p>Synacor is a provider of a variety of white-label products to the entertainment and communications industries. If you have AT&amp;T internet, use single-sign-on with your Apple TV and your Cable provider, receive corporate e-mail by Zimbra, or a lot of other cool stuff, you (along with about 120 million other people a month) are using our tech. There are about 450 of us who work together in a friendly, Agile, engineering-led (really!) company.<p>I&#x27;m the lead for one of our teams in Los Angeles, working with AT&amp;T to provide portal and homepage products to their ISP customers. Our tech stack is moving to Preact&#x2F;Go with some legacy systems still in BackboneJS&#x2F;PHP. We also interface with a wide number of in-house systems written in Perl and Java. We&#x27;re hiring a Senior Engineer with deep O-O PHP experience, ideally some Go, and very strong unit testing experience. You&#x27;ll be doing about 60% front-end work, but if you&#x27;re not strong on the front-end, that&#x27;s fine, we can get you up to speed; experience building complex systems and a strong ability to bring best practices in code and component design is what we really need (and highly applicable across most languages, anyway).  Someone who can help their more junior teammates grow is a top priority. Apply at <a href=\"https:&#x2F;&#x2F;chk.tbe.taleo.net&#x2F;chk05&#x2F;ats&#x2F;careers&#x2F;v2&#x2F;viewRequisition?org=SYNACOR&amp;cws=39&amp;rid=2039\" rel=\"nofollow\">https:&#x2F;&#x2F;chk.tbe.taleo.net&#x2F;chk05&#x2F;ats&#x2F;careers&#x2F;v2&#x2F;viewRequisiti...</a>, or hit me up at wade.armstrong {at} synacor.com<p>If that&#x27;s not your speed, we have great openings in Ad Tech and Networking in Buffalo, and Preact&#x2F;Java work in Pune, visit <a href=\"https:&#x2F;&#x2F;www.synacor.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.synacor.com&#x2F;careers</a>.","time":1512172576,"type":"comment"}