{"by":"baflatfair","id":15825445,"parent":15824597,"text":"flatfair | Senior Software Engineer | London, UK | Onsite | <a href=\"https:&#x2F;&#x2F;flatfair.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;flatfair.co.uk</a><p>This is a unique opportunity to join a founding team and impact every renter in the UK through exciting and highly rewarding work.<p>We expect more people renting than ever before. That’s why we believe renting should be more affordable and accessible. We are a young and innovative startup company solving an affordability problem by offering deposit-free renting to millions of tenants across the UK – with lots more exciting stuff to come.<p>We have built a core team and a product we are proud of, partnered with industry leaders and are now moments away from launching with the UK largest independent letting agent.<p>In preparation for growth after that we’re looking to hire engineer #1. Day to day you’ll be working with CTO (myself) building our web app, APIs, infrastructure and helping to grow our team.\nFor the first version of our platform we’ve decided to keep our product as simple as possible. It’s small monolithic application written in  python (django), deployed on aws, using circleCI for builds, our infra is defined with terraform, we’re using postgresql for data store and pure html&#x2F;js for frontend. Experience with specific technologies we use right now is not required as long as you have worked with more than one stack during your career. We’re planning to keep open mind when selecting tech for new parts of our product. Some of direction we’re considering are elixir, go, clojure.<p>Responsibilities<p>* design, build, and maintain new features for our web application and APIs<p>* architectural planning (inc. security &amp; data)<p>* define engineering standards, tooling<p>* help to hire new team members<p>We’re looking for someone who<p>* is an experienced developer who have worked on live web applications before.<p>* have great backend skills and given our small team is also comfortable with basic frontend work<p>* thinks every good feature deserves a test or two<p>* has opinions on product and system design. You’ll have a chance to make a lot of decisions that will help us build secure, scalable product that will delight our users<p>flatfair is based in London, so you must have the existing right to work within the UK. We offer competitive salary (£60-£85k depending on experience), flexible hours and the chance to make a big impact, quickly.<p>If you’re interested email us at careers@flatfair.co.uk or apply through <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;yFr53A\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;yFr53A</a>","time":1512149212,"type":"comment"}