{"by":"victorquinn","id":15834462,"parent":15824597,"text":"Spring | multiple positions | NYC | onsite | full-time | <a href=\"https:&#x2F;&#x2F;www.shopspring.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.shopspring.com</a><p>Join our growing engineering team at Spring, a well-backed startup headquartered in New York City. We just raised a $65MM Series C to continue growing our team. We are building the future of fashion shopping, helping brands make the transition from brick and mortar to mobile and web. We have built and are scaling a single source marketplace for a growing list of great brands to sell their products direct to consumer.<p>A few cool challenges we are tackling: building the best in breed shopping experience on web and mobile, building out solid API integrations with our partners so they can integrate with our massive multi-brand product catalog, building our own custom order management system, tons of scalability work, building out a machine learning backed fashion recommendation engine.<p>We just moved into a beautiful new office in July by the Flatiron building and we offer all the startup benefits you&#x27;d expect and were recently named one of NYC&#x27;s best places to work by Crain&#x27;s <a href=\"https:&#x2F;&#x2F;vq.io&#x2F;2fR8jA4\" rel=\"nofollow\">https:&#x2F;&#x2F;vq.io&#x2F;2fR8jA4</a><p>We are looking for iOS, web, and backend engineers in lead and senior roles. We are also looking for data scientists to join our team working on our fashion recommendation system and other gnarly data problems.<p>Learn more about our tech stack and working here at Spring: <a href=\"https:&#x2F;&#x2F;www.shopspring.com&#x2F;engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;www.shopspring.com&#x2F;engineering</a><p>Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;icdh7l1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;icdh7l1</a><p>Feel free to email me directly victor at shopspring.com with any questions about our company, our roles, etc. (but please don&#x27;t send me resumes, use our application tracking system at the link above for that)","time":1512252789,"type":"comment"}