{"by":"alex-mohr","id":15833379,"parent":15824597,"text":"Google, Inc. | Software Developers, Security Engineers, Eng Managers | Seattle, WA | ONSITE, full-time | Comp: Google-scale + relocation<p>Come work for Google&#x27;s Cloud Platform in Seattle and help us build OSS Kubernetes [0] and our managed service, Google Kubernetes Engine (GKE [1]).  I manage our Seattle engineering teams and am hiring software developers, security engineers who love writing code, and engineering managers.<p>We have three subteams in Seattle, where each subteam has responsibility for making both k8s and GKE great in its area of ownership:<p>(1) Cluster Lifecyle: Active in sig-cluster-lifecycle and sig-cluster-ops, its mission is to deliver a great cluster administrator experience across the entire lifecycle of a cluster: not only one-off install time, but managing a cluster over years: upgrades, config, machines, repairs, and teardown, for cloud and on-prem environments.  We&#x27;re building a Cluster API to drive all of that.<p>(2) Security and Auth: Active in sig-auth, its mission is to deliver platform features that enable our users to build secure apps on k8s and GKE (not a reactive vulnerability disclosure nor pure analysis role -- must ship implementation).<p>(3) GKE API Infrastructure: Drive the infrastructure that lets us offer a great managed as-a-Service product.  It&#x27;s the central core of GKE and plays a role delivering features across multiple subteams.<p>Ideally you have previous experience with Kubernetes and&#x2F;or containers -- either building those platforms or running apps on top of them -- and further domain knowledge in one of our subteam&#x27;s focus areas.  You&#x27;re passionate about delivering great products to end users, and focus on impact over implementation.<p>Google Seattle also hosts a number of other Google Cloud Platform efforts and many are hiring.  Apply at <a href=\"https:&#x2F;&#x2F;careers.google.com&#x2F;locations&#x2F;seattle-kirkland&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.google.com&#x2F;locations&#x2F;seattle-kirkland&#x2F;</a> and mention the particular products you&#x27;re interested in, or contact me via hn@alexmohr.com.<p>[0]: <a href=\"https:&#x2F;&#x2F;kubernetes.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;kubernetes.io&#x2F;</a><p>[1]: <a href=\"https:&#x2F;&#x2F;cloud.google.com&#x2F;kubernetes-engine&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.google.com&#x2F;kubernetes-engine&#x2F;</a>","time":1512241296,"type":"comment"}