{"by":"leadpages","id":15845204,"parent":15824597,"text":"Drip + Leadpages (www.Drip.com) - Minneapolis, MN | Full Time | ON-SITE | Now Hiring Senior Ruby on Rails Developers, Senior Front-End Developers, Videographers, Support Engineers and Technical Support Managers!<p>As a fast-growing marketing automation platform, Drip is backed by two of the tech industry’s most prominent venture capital firms and has quickly become one of the most cutting-edge and beloved products in the space. Our entrepreneurial spirit and friendly atmosphere provide an engaging work environment, unlike any others you’ve encountered in the past. Our developers play a critical role in the forward momentum of our company and are in constant collaboration with various teams to cultivate rich, pioneering ideas that are helping advance Drip to the top of our industry.<p>Drip is a small product team inside Leadpages, working on a separate marketing automation application that is aptly named &quot;Drip&quot;. Working with us gives you the best of both worlds: the intimacy, influence, and speed of a small development team, but all the perks of a well-funded parent company (stable, health insurance, stock options, 401(k), etc.).<p>Leadpages+Drip was thrilled to make #297 on the 2017 Inc. 5000 list (we were #3 in Minnesota) and to be named a Star Tribune Top Workplace for the past three years in a row! To learn more about the teams that have helped us achieve these honors, we invite you to visit our Instagram, Facebook and About pages.<p>What we’re using…<p>We are super busy scaling one of the MarTec industry’s most impressive marketing automation platforms to date. It’s a beautiful Ruby app that’s built on Rails 4 (soon to be Rails 5!), AWS, JSON, Sidekiq, Redis for caching, ElasticSearch, Ansible, Flight, PostgreSQL, and Vanilla JS. Spoiler alert: we’re in the process of introducing Elm to our stack, too!!<p>If anything caught your eye, we’d love to hear from you! We currently have opportunities available for:<p>- Senior Front-End Developer =&gt; COMING SOON!<p>- Support Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2BHoy97\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2BHoy97</a><p>- Senior Ruby on Rails Developer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2hwUWCR\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2hwUWCR</a><p>- Technical Support Manager =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2npl0oV\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2npl0oV</a><p>These are all full-time positions with exceptional benefits! We also offer generous relocation packages to help you relocate to beautiful Minneapolis, MN, if you are open to relocating.<p>Interested in emailing us directly? You can reach me at Tiffany@Ave81.com (no agencies or 3rd parties, please!)<p>Let’s build something awesome!","time":1512405852,"type":"comment"}