{"by":"racheltempo","id":15848727,"parent":15824597,"text":"ONSITE&#x2F;SENIOR FULL STACK ENGINEER&#x2F;FULL-TIME\nTempo Automation is reinventing the way electronics are developed. Our customers build rockets, drones, medical devices, and much more.<p>We give our customers the physical equivalent of a fast compiler to turn their designs into real circuit boards quicker than anyone else.<p>We are currently hiring a Full Stack Software Engineer with proficiency in python, REACT, Django, Postgressql, etc.<p>In working towards our vision of a seamless and transparent customer experience, we run up against all sorts of obstacles in both software and manufacturing. Here are some problems we&#x27;ve solved so far:\nCAD Parsing &amp; Feature Extraction: extracting features from a customer&#x27;s CAD file is one of the first things we have to do to provide a great customer experience, but because much of the data we extract is geometric, this process can be very computationally intense. Parsing is also difficult, since there are many different CAD programs, each typically with its own distinct file format.<p>Automatic Quoting: our supply chain includes multiple vendors with complex pricing schemes, which makes generating detailed quotes for a given circuit board design very difficult. Solving this problem requires great UX as well, since we show customers quotes that are far more detailed (i.e. line-items at the individual component level) than any other manufacturer.<p>Process Traceability: our factory technicians need to record what they did and when, but doing so on a paper sheet or in Trello is time-consuming and often inaccurate. We&#x27;ve built a tailored mobile workflow management app instead that, as a bonus, gives them context-specific information about the design while they&#x27;re performing certain manufacturing steps.<p>We have so many interesting problems ahead, including:<p>offering real-time, automated manufacturing feedback based on certain parameters of our customers&#x27; designs. Think linting for hardware.\noptimizing our factory processes with statistics and scheduling algorithms.\nencoding the three-dimensional structure of each component (i.e. resistors, capacitors) that we place on customers&#x27; boards, to ensure minimal manufacturing defects.\nautomated optical inspection faster than anyone in the industry.<p>If interested, please email me at rachel@tempoautomation.com","time":1512432296,"type":"comment"}