{"by":"NewsNow","id":15851169,"parent":15824597,"text":"Head of Digital Product | NewsNow.co.uk | London, UK  | Full-time, permanent\nDesigner&#x2F;Developer | NewsNow.co.uk | London, UK  | Full-time, permanent\nWeb Developers &#x2F; Full Stack Developers &#x2F; News Algorithm Developers &#x2F; Back End Software Engineers | NewsNow.co.uk | 100% remote (UK residents only) | Full-time, permanent<p>We are a top ten UK media publisher, with a website loved by millions: a technology company at heart with industry-leading success metrics propelled by a highly experienced multi-disciplinary engineering team that can afford to run lean. Which means today, we offer all the excitement and agility of a start-up, but with the stability and benefits of an established business — we’re still a company where everyone gets to make a massive impact!<p>Our mission: to democratise and disrupt the market for news. Today, we have major plans for growth, both here in the UK and abroad, and to create even more social capital out of what has been an extremely successful platform: through increased editorial direction, curating credible but independent journalism, as well as through computational approaches to identifying the best news to show our users.<p>We currently have these opportunities:<p>- As a &#x2F;Head of Digital Product&#x2F;, you’ll take over from our CEO in keeping all our development efforts incredibly well organised and delivering the vision. You’ll grasp our strategic vision, consult with stakeholders to prioritise and specify desired developments, and co-ordinate the work of our agile development team to balance our editorial, development and commercial goals and deliver them with maximum efficiency.<p>- As a &#x2F;Designer&#x2F;Developer&#x2F;, you’ll be responsible for designing all aspects of the website UI and brand, and work closely with Head of Digital Product and senior management on the biggest redesign of our homepage in 20 years. You will be working with Adobe Creative Suite, JavaScript, CSS3, SASS, HTML5, Responsive Web Design, progressive enhancement and feature detection.<p>- As a &#x2F;Fully Remote Web Developer&#x2F;, you’ll write the logic that drives the UI, and integrate new UI with back-end data. You’ll also work on a wide array of other UI&#x2F;UX, SEO, and content integration challenges.<p>- As a &#x2F;Fully Remote Full Stack Developer&#x2F;, you’ll be expected to contribute authoritatively towards product development projects throughout the entire software stack: from database and infrastructure installation and configuration, through writing business logic and prototyping website presentation, to developing our bespoke programmatic advertising technologies.<p>- As a &#x2F;Fully Remote News Algorithm Developer&#x2F;, you’ll develop automated curation algorithms that will produce the content for a new homepage format.<p>- As a &#x2F;Fully Remote Back End Software Engineer&#x2F;, your projects will largely be server-side. You will bring a sophisticated approach to problem solving, finding ways to achieve objectives while addressing scalability challenges and security concerns.<p>All London positions are based at our centrally-located head office.\nAll fully remote roles are open to UK residents only.<p>If you think you’re a fit for any of these roles, please apply online. <a href=\"http:&#x2F;&#x2F;www.NewsNow.co.uk&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.NewsNow.co.uk&#x2F;careers&#x2F;</a>","time":1512474177,"type":"comment"}