{"by":"joejlam","id":15856288,"parent":15824597,"text":" Brainbuild (<a href=\"https:&#x2F;&#x2F;brainbuild.io\" rel=\"nofollow\">https:&#x2F;&#x2F;brainbuild.io</a>) | San Francisco | Full-time, Onsite | $42,000-50,000 + substantial equity | CTO - Full Stack JavaScript, React Native<p>ABOUT BRAINBUILD<p>Brainbuild is an automated nutrition scheduling system that optimizes the timing of meals, snacks, hydration, and sleep events based on a person&#x27;s unique daily schedule and adapts intelligently to day-to-day changes.<p>Everyone deserves to live a healthy life. This still isn&#x27;t possible today because we don&#x27;t have access to the right guidance when we need it the most—before we make a health decision. In our world of increasingly ubiquitous technology, what&#x27;s missing is a way for us to receive scientifically accurate and personalized suggestions to help us improve our health each day. We&#x27;re building that technology at Brainbuild as the leading company in nutrition scheduling.<p>PRESS<p>- Inc.com Top 30 Emerging Companies in the US (<a href=\"http:&#x2F;&#x2F;go.brainbuild.io&#x2F;inc-30\" rel=\"nofollow\">http:&#x2F;&#x2F;go.brainbuild.io&#x2F;inc-30</a>)\n- Inc.com &amp; Kairos Society (K50) Top 50 Most Innovative Companies in the World Started by Entrepreneurs Under the Age of 25 (<a href=\"http:&#x2F;&#x2F;go.brainbuild.io&#x2F;inc-50\" rel=\"nofollow\">http:&#x2F;&#x2F;go.brainbuild.io&#x2F;inc-50</a>)\n- Recent winner of the $18,000 Frank Borchardt Prize (David Cummings - <a href=\"http:&#x2F;&#x2F;go.brainbuild.io&#x2F;borchardt\" rel=\"nofollow\">http:&#x2F;&#x2F;go.brainbuild.io&#x2F;borchardt</a>)\n- Alum of the Groundwork Labs Startup Accelerator Program (<a href=\"http:&#x2F;&#x2F;groundworklabs.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;groundworklabs.com&#x2F;</a>)<p>SEEKING<p>We are looking for a person to lead our development full-time and continue improving our existing product. The best candidate will be someone looking to grow into the CTO role of a young startup and live the startup lifestyle.<p>Desired Experience &amp; Stack: JavaScript, ES6, React Native (Expo.io), Node.js, React.js, Redux, Firebase, AWS\nBonus: Data Science, Pipelines, Analytics; Python, C++, ML Algorithms; UI&#x2F;UX Design; Mobile Payment &amp; Referral Systems<p>More information at careers.brainbuild.io<p>Please reach out to Joe Lam (CEO) at careers@brainbuild.io with the subject line &quot;Brainbuild Career - HN&quot; or text him directly: (415) 234-3280  We are more than excited to hear from you!","time":1512510054,"type":"comment"}