{"by":"pabloest","id":3182252,"parent":3181796,"text":"San Francisco, CA and London, UK<p>Meraki - <a href=\"http://meraki.com\" rel=\"nofollow\">http://meraki.com</a><p>Meraki is the leader in cloud networking and we have over 18,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://meraki.com/customers\" rel=\"nofollow\">http://meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco.<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>We’re looking to hire in San Francisco and we have a few positions open in London as noted.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical operating data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services for all of those thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you will be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business; we are also growing quickly, with a proven model for our technology, so your work will reach many customers and have a huge impact.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://meraki.com/company/jobs#ui_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#ui_eng</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://meraki.com/company/jobs#bs_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#bs_eng</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://meraki.com/company/jobs#fw_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#fw_eng</a><p>* Hardware Program: passionate for research, product specs, engineering, project management, and manufacturing/quality (ME, EE or similar).\n<a href=\"http://meraki.com/company/jobs#hardware-program-engineer\" rel=\"nofollow\">http://meraki.com/company/jobs#hardware-program-engineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://meraki.com/company/jobs#product_mktg\" rel=\"nofollow\">http://meraki.com/company/jobs#product_mktg</a><p>* Marketing Manager: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr</a><p>* [London] Marketing Manager - Europe: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr_emea\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr_emea</a><p>// Support<p>* Inside Pre-Sales / Technical Support Engineering: sharp, energetic, and pre-sales and technical support engineer who can work closely with many groups within the company, including sales and product management, as well as with engineering to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://meraki.com/company/jobs#tech_support_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#tech_support_eng</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, channel sales, sales engineers, and strategic sales. Our London office is also looking for sales representatives, with a focus on DACH and other areas within Europe, Africa, and Russia.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1320158733,"type":"comment"}