{"by":"mookie","id":3183946,"parent":3181796,"text":"San Mateo, Full Time - SuccessFactors<p>The Jam product is a social collaboration tool in the SuccessFactors Business Execution suite that allows employees to communicate with each other and share information and knowledge, combining leading consumer social media products with enterprise productivity.  The Jam engineering team is looking for a Software Engineer to join our great team. The successful candidate will join a senior team of architects, systems experts, QA professionals, and world-class web developers from both the enterprise and the consumer web markets.<p>If you’re excited about delivering software, this is the team for you.  We ship our software weekly and facilitate this by living test driven development.  This means you get about 50 releases a year to get the code you’ve written in the hands of a user.<p>You will work closely with Operations, Quality Assurance, Product Management, and Customer Support teams to implement, test and deliver new features for the Jam product.  The ideal candidate is a self-starter who is eager to learn and use new technologies to build innovative applications.  Experience administering Linux systems is a must and experience building web applications with Ruby on Rails is a plus.  You will be responsible for coding and delivering new product features using the Ruby on Rails framework, as well as troubleshooting and identifying any issues seen in our production Linux, Apache, Rails and MySQL environments.  A more senior level role is negotiable in this position.<p>Duties and Responsibilities:<p>*\tWork closely with others to develop new features and site improvements<p>*\tSupport new and existing customers using the Jam product by providing bug fixes in a timely manner<p>*\tTroubleshoot Linux environments for Production, Staging, and QA<p>*\tImplement backend server side code in Ruby on Rails and MySQL<p>*\tBuild new features with a Test Driven Development methodology<p>*\tExcel in a highly iterative development process with weekly production releases<p>*\tTake ownership and help test, release, and maintain your code<p>Requirements:<p>*\t3-4 years of experience building software and a proven track record of getting stuff done<p>*\tB.S. Computer Science or related field<p>*\tFamiliar with MySQL, Linux, networking, and storage technology<p>*\tExperience installing, configuring, and administering Linux systems (Debian preferred)<p>*\tGood understanding of object oriented design and various design patterns<p>*\tAbility to understand and master new technologies quickly<p>*\tStrong focus on quality and generating results<p>*\tSelf-disciplined with strong attention to detail<p>*\tExcellent written and oral communications<p>Also a Plus:<p>*\tExperience with Ruby on Rails is preferred<p>*\tExperience building highly available, secure and scalable enterprise products<p>*\tExperienced in test driven development and various application development methodologies from waterfall to agile. SaaS delivery experience is highly desirable.<p>Please apply via:\n<a href=\"https://performancemanager4.successfactors.com/sfcareer/jobreqcareer?jobId=12652&#38;company=sf&#38;username\" rel=\"nofollow\">https://performancemanager4.successfactors.com/sfcareer/jobr...</a>","time":1320178563,"type":"comment"}