{"by":"galenward","id":3183254,"parent":3181796,"text":"At Estately we are building the Gmail of real estate to empower consumers to find and buy homes online. We're small and scrappy, but with a huge vision. We're profitable and we serve hundreds of thousands of users a month. Estately is in a unique position to upend the $50+ billion real estate industry with a small, technically-obsessed team.<p>We are actively looking for a new market manager / office manager to do amazing work as part of our team.<p>You can boil legal mumbo-jumbo into a succinct bulleted list and manage 10+ projects with a variety of deadlines moving forward simultaneously. You can figure out how to get a company registered in any state, read a complex set of rules and figure out the cheapest and fastest way to comply, you can assuage grumpy bureaucrats and you are capable at smooth talking your way through red tape. You can also document and organize the results of these efforts.<p>You are a a hyper-organized, detail-oriented, driven person who is interested in wearing a lot of hats to help our startup grow to become huge. You are driven to accomplish a lot and learn a lot very quickly. You are resourceful, upbeat, and enjoy getting things done on a budget (translation: you must be frugal, scrappy, and happy). You have web and computing skills, including maybe a little HTML and a good command of Microsoft Office.<p>You will assist in preparation of legal documents, including: \nPlan, organize, and execute long, multi-step process of setting up each new market\nFind and summarize relevant rules and regulations in various states\nCompose, draft, transcribe, and revise documents and forms as required\nCorrectly calculate fees, prepare checks, and submit to appropriate agency as required<p>When you aren’t moving us into new markets, you’ll have a host of everything-you-need-to-run-a-startup responsibilities:\nGet stuff here: Order, pick-up and assemble new desks, setup printers and computers\nRecruiting: draft job postings, reviewing and phone screen job applicants, schedule interviews and generally find phenomenal candidates for our open positions\nKeep state and local filings up-to-date\nFiling - state filings, employee paperwork\nEvaluating bug reports (no user left behind!): communicating with users to get to the bottom of the problem, documenting it so our developers can fix it and circling back with the user when it’s fixed\nSpreading cheer - be upbeat always and keep things lively. Maybe even help prepare for parties now and then\nEnsure that physical and electronic project files are properly generated and maintained, including\nExec admin – arrange board meetings, do lightweight word/powerpoint/excel prep and whatever else the CEO needs to keep moving quickly<p>Background: \nYou have some professional business experience on your resume, and have a college degree<p>You must be able to work autonomously to drive numerous projects simultaneously and you must be adept at project and information management. You must be comfortable digging deep--both online and on the phone--to determine the laws and rules applicable to our business and follow through on your plan to comply with all such laws and rules while accomplishing Estately’s objectives.<p>Although this is a junior position, you will play a key role at an angel-backed, quickly growing startup. You will report to the CEO of the firm. As good writing skills are important to this job, please include a short (~2 paragraph) plan of attack for helping a user who has written in telling us that the price is wrong on one of the properties on our site.<p>If you are looking for an exciting, demanding job that provides unique experience and gives you a chance to shine, this is a special opportunity.<p>Send me an email at jobs@estately.com.","time":1320170187,"type":"comment"}