{"by":"bobwaycott","id":3200847,"parent":3181796,"text":"Chattanooga, TN. Full-time, on-site.<p>Small, four-person creative/interactive team at EPB (electric power &#38; fiber optics internet/tv/phone service provider). We're looking for our 5th member.<p>We have a great working environment:<p>* The only employees who aren't stuck in cubicles\n* Wear what you want (I've worn shorts &#38; flip-flops the last 5 mos)\n* Top-of-the-line hardware--no cheap stuff\n* Really smart, creative team members who want to build great products<p>Current team:\n* 1 creative director/designer\n* 1 front-end UI/UX developer (who happens to be a jQuery core dev)\n* 1 back-end developer (who does a lot more than sling code)\n* Me--team lead, interactive director, co-developer, meeting-goer, idea-seller<p>We maintain and build apps/modules for the company's public sites, which presently are Python/Django-based. We've built a few internal apps--relied upon daily for core business operations--in Ruby. We also have a couple random things written in Haskell &#38; Scala which may or may not stick around. We are not married to any single language or platform.<p>We need a great developer comfortable and familiar with Python/Django, Ruby, and Objective-C/iOS above all things. We have a number of interesting projects in the works for each of these platforms. If you are into Android development, that could work, too.<p>We work hard at securing future interesting product work for the team--mobile apps, internal products, MediaRoom application development (for set top boxes), etc.<p>We're looking for a girl or guy who is interested in learning and building great products on any platform, who cares about delivering a fantastic experience for customers and employees alike. Someone capable of self-management, who has opinions on the right way to do things. We collaborate on everything, and are not afraid to hash something out for two hours until we believe we've got it right. We want you to be that kind of person, too.<p>We're the company's first and only creative/interactive team, and we enjoy autonomy in deciding our platforms, languages, technology, etc. We have no overlords who tell us how to do our jobs. You'll find yourself asked to be part of our decision-making on new products.<p>If any of this sounds interesting, we'd love to talk with you (and will probably ask you to meet up for lunch or something).<p>Official job description (apologies for the over-corporate-y-ness of it):\n<a href=\"http://www.epb.net/about/careers/jobs/web-and-ios-developer/\" rel=\"nofollow\">http://www.epb.net/about/careers/jobs/web-and-ios-developer/</a><p>Drop me a line and a CV: waycottb@epb.net.","time":1320525477,"type":"comment"}