{"by":"knes","id":7162929,"parent":7162197,"text":"Pusher - <a href=\"http://pusher.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;pusher.com&#x2F;jobs</a> - London, United Kingdom<p>Pusher is a uniquely techy London company with a large and growing global user base and we are looking to hire a Lead Designer, Growth Engineers and Platform Engineers among other positions ( <a href=\"http://pusher.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;pusher.com&#x2F;jobs</a> ).<p>Our company&#x27;s vision is to help stop developers reinventing the wheel when it comes to software, and help them focus their time and energy into valuable and meaningful work. We’re growing quickly and there’s much to be done.<p>We have currently a couple of open positions:<p>* Lead Designer: Join us as our first in house designer and you’ll have the opportunity to evolve our brand as well as the experience of the product itself. More info @ <a href=\"http://pusher.com/jobs/lead_designer\" rel=\"nofollow\">http:&#x2F;&#x2F;pusher.com&#x2F;jobs&#x2F;lead_designer</a><p>* Platform Engineer : The current Pusher platform is only the start of our plans. We&#x27;re looking for engineers who can help us build out our platform and help shape the way software is produce. More info @ <a href=\"http://pusher.com/jobs/platform_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;pusher.com&#x2F;jobs&#x2F;platform_engineer</a><p>* Growth Engineer : Engineers on the Growth team are responsible for iterating on, experimenting with, and devising new strategies for growing Pusher. Growth engineers care not just about technology — but ultimately the problems it can solve; they care about creating experiences that delight our users; and, they are comfortable at all levels of the stack. More info  @ <a href=\"http://pusher.com/jobs/special_developer\" rel=\"nofollow\">http:&#x2F;&#x2F;pusher.com&#x2F;jobs&#x2F;special_developer</a><p>We are also always keen on interns (paid) and we have other open positions. <a href=\"http://pusher.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;pusher.com&#x2F;jobs</a>","time":1391282070,"type":"comment"}