{"by":"squarespace","id":7162356,"parent":7162197,"text":"Squarespace - NYC (INTERN yes, REMOTE no, H1B yes)\n<a href=\"http://www.squarespace.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.squarespace.com&#x2F;</a>\nAbout us:<p>* Since 2004, Squarespace has offered a fully-hosted environment for creating and maintaining a website. Known for its sophisticated yet easy-to-use interfaces, Squarespace&#x27;s do-it-yourself tools allow creative professionals, businesses, bloggers, and web developers to quickly and easily create and maintain professional, high-quality websites.\nWhat we’re looking for:<p>* Software Engineers - To work on various projects related to building features into the platform, the underlying system powering millions of websites, e-Commerce, and data&#x2F;analytics. - You should be strong in Java and&#x2F;or JavaScript - Some other technologies we use: MongoDB, RabbitMQ, Jersey, Memcached, Guice, YUI3, jQuery, Elasticsearch, WebGL<p>* Front-end Engineers - Seeking engineers with strong design sensibilities who are interested in crafting some of the most sophisticated UIs on the web. - Advanced skills in HTML&#x2F;CSS and JavaScript (bonus if you’re familiar with YUI3) required - Bonus: Interest if not experience working further down the stack<p>* Senior Android Engineer - Help us build beautiful Android apps - Expertise in Java &amp; strong understanding of the Android SDK a must - Successfully published several apps to the play store - Must be passionate about Android and excited to evangelize the platform both internally and externally<p>* Developer Evangelist - Evangelize our developer platform both in person and on the web by presenting at conferences, blogging, writing technical tutorials, etc. - Must be a great communicator, have solid skills with web technologies like HTML&#x2F;CSS&#x2F;JavaScript, &amp; bonus points if you’ve built a Squarespace developer site<p>* Customer Acquisition Associate - Grow our subscriber base with profitable, brand-appropriate placements while executing display, e-mail, sponsorship, PPC, and other marketing programs in partnership with our business category managers. - Previous relevant customer acquisition experience is required along with Excel &amp; SQL knowledge.<p>We’d love to hear from you, feel free to reach out directly to learn more or with any questions - swood at squarespace dot com","time":1391276079,"type":"comment"}