{"by":"meaydinli","id":7162444,"parent":7162197,"text":"Android&#x2F;Java Developer, Chicago (downtown), H1B sponsorship available for the right candidate.<p>We are looking for new teammates who will join the existing Android team to design and develop native Android applications for several companies, paving the way for the much needed technological advancements in the entertainment industry. Our client roster includes the biggest names such xFinity, Paramount and others. Your every contribution will impact hundreds of thousands of people around the globe. Content Direct has a very laid back personality, with a touch of startup culture while having the stability and the backing of a large enterprise.<p>Content Direct solution empowers the top brands in media and entertainment to easily and effectively market, monetize and manage their premium digital content and customers. Content Direct is offered as either a set of software services or as an integrated solution, and allows content companies of all sizes to increase the value and return of every content transaction. The solution supports virtually all content types and commerce models, marketing promotions, partner management, financial management, reporting, and analytics.<p>Our Android&#x2F;Java Developer will take part in the design and development of applications utilizing multiple technologies and platforms. Translates requirements into effective, intuitive, and responsive user interfaces. Collaborates with developers, testers, clients, users and cross functional teams to continuously enhance the usability of applications. Works under minimal supervision on complex projects. You will be helping out on the project from the first day and your teammates will be there right alongside you, should you need any help or mentorship.<p>- 3+ years of Java and Eclipse IDE experience<p>- 1+ years of experience with the Android SDK preferred<p>- Experience building apps that communicate with RESTful services<p>- Experience in Object-Oriented Design, Data Structures, Algorithm Design, Problem Solving, Complexity Analysis and Debugging<p>- Experience in building and maintaining automated build and deployment processes preferred<p>- Roku and Smart TV development experience preferred<p>* Find more about us at <a href=\"http://contentdirect.csgi.com/us/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;contentdirect.csgi.com&#x2F;us&#x2F;careers.html</a><p>* Send us an email at Tiffany.Ingersoll@csgi.com and you will be put in touch with our engineers!","time":1391276981,"type":"comment"}