{"by":"ejdyksen","id":7162998,"parent":7162197,"text":"Mutually Human - Grand Rapids, Michigan  (INTERN yes, REMOTE&#x2F;H1B no)<p><a href=\"http://www.mutuallyhuman.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;</a><p>---------------------------------------<p>We are a small team passionate about making people&#x27;s lives better through software.<p>A little bit about us:<p><pre><code>  - We write custom software of all shapes and sizes for clients all over the US\n\n  - Though everyone here is fluent in Ruby, we don&#x27;t artificially limit ourselves.\n    In the past few months, I&#x27;ve worked with Objective-C, Backbone.js (inside\n    PhoneGap), Angular.js, Ruby (of course) and a little bit of Java and C#.\n\n  - We practice a sustainable pace. We recognize that we each have lives,\n    activities, and families outside of work. Late nights and &gt; 40 hour weeks are\n    rare by design.\n\n  - We&#x27;re agile, but not dogmatic about it. Our process evolves to suit our needs.\n\n  - We offer competitive salaries, health&#x2F;vision&#x2F;dental insurance, quarterly profit\n    sharing, retirement + match, weekly catered lunches, and a top-floor office\n    with snacks, guitars, and your choice of standing or sitting desks.\n</code></pre>\nA little bit about Grand Rapids:<p><pre><code>  - 2.5 hours from Chicago and Detroit, less than an hour to the beach.\n\n  - Lots of great beer. Founders Brewery (a mile from our office) has 3 beers in\n    the Beer Advocate top 15. HopCat is a “World Class” bar on BA.\n    Just look here: http:&#x2F;&#x2F;beeradvocate.com&#x2F;beerfly&#x2F;city&#x2F;43\n\n  - If you’re renting anything larger than a breadbox in the Bay Area or NYC,\n    you can afford a house here. I bought a nice house with a mortgage payment\n    30% lower than the rent of my 1 bedroom apartment in Mountain View.\n\n  - A growing technology and startup community.\n</code></pre>\nA little bit about you:<p><pre><code>  - You love writing software, and you have a few years of experience doing it.\n\n  - You learn new stuff quickly. You’ve used a lot of technologies, but you’re not\n    afraid to use more. It would be nice if you use and love Ruby, but not required.\n\n  - You believe software is written for humans, not computers.\n\n  - You want to come into work every day and enjoy the people you work with.\n</code></pre>\nI&#x27;m a software craftsman on this awesome team. If you&#x27;re interested, email me and I&#x27;ll get you more info on how to apply:<p>ej@mutuallyhuman.com","time":1391283028,"type":"comment"}