{"by":"blatherard","id":7162854,"parent":7162197,"text":"Unlockable - <a href=\"http://unlockable.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;unlockable.com&#x2F;</a> - New York City (No remote or H1B)<p>Position: CTO<p>Unlockable (unlockable.com) is a seed-funded company looking for the leader of our tech team. You are: a true full-stack engineer who has conceived, built, and launched your own projects. You have effectively managed and delegated to a team and to yourself. You’ll be the captain of the ship, getting it where it needs to be, on time and on budget. Your job will be to invent your role and build the team that allows you to fill it. You don&#x27;t want to be the &quot;tech guy&quot; working with &quot;business guys.&quot; You and the two founders will be the executive team, and together we&#x27;ll all make decisions about the business.<p>Our Mission<p>Developers, publishers, and all sellers of digital content are missing out on billions of dollars. That’s because an enormous share of their audience — often greater than 90% — stops at the paywall. Unlockable helps change the equation for selling digital media, from games to apps to streaming services and beyond: by letting people pay with their time in a fun, ad-supported experience.<p>Our Product<p>Unlockable lets people pay for content by playing ad-based games. Anywhere a &quot;Buy&quot; button can go, an &quot;Unlock” button can go next to it. All of our games use only existing video ads with no additional production, making it extremely easy for brands to get started. Publishers can earn more revenue from their existing audience, brands get guaranteed engagement on existing video, and players get a free way to access paid content. See a walkthrough (narrated by Zach, the CEO) here: <a href=\"https://www.youtube.com/watch?v=FV7lMxGMHaI\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=FV7lMxGMHaI</a><p>Our Progress<p>We have an upcoming launch with one of the largest mobile gaming companies in the world, with over 1 million downloads per day.<p>If you&#x27;re interested or have questions, email me at paul@unlockable.com.","time":1391281263,"type":"comment"}