{"by":"spicyj","id":7162829,"kids":[7223473],"parent":7162197,"text":"Mountain View, CA (we also love interns, and remote is a possibility for the right candidate)<p>---<p>At Khan Academy, we&#x27;re a small, 52-person non-profit tech startup. We&#x27;re trying hard to do good for the world. Here&#x27;s a testimonial we received just two days ago:<p><i>January 29, 2014</i><p><i>I am an adult returning to school for a midlife career change. I have always disliked math and thought I was bad at it -- and my last math class was over 20 years ago! But I just passed my Accuplacer placement test, thanks to Khan Academy. Thank you so much for making it fun and easy to refresh my skills. I also purchased the Accuplacer test prep app, but I found myself coming back to Khan Academy more often because I liked it more. Now I am learning coding at school, so I&#x27;ll definitely be back for more!</i><p><i>Lisa</i><p>This letter is one story, but every month we hear about hundreds of lives like this that we&#x27;ve transformed.<p>--<p>Most of you reading this are familiar with Sal&#x27;s videos, but we also have hundreds of videos by other teachers, partnerships with organizations like MoMA and the California Academy of Sciences, and a huge library of interactive exercises. Over 20 million math problems are done <i>every week</i> on our site. That&#x27;s a lot.<p>With this huge scale, we&#x27;re able to study learning in a way that wasn&#x27;t previously possible. We&#x27;ve run tests and found that students learn more when they&#x27;re given harder problems based on an intelligent machine-learning algorithm [1]. Right now we have dozens of A&#x2F;B tests running to help us understand what we can do to make people learn more, such as testing how different spaced repetition algorithms affect retention. We&#x27;re also beginning to release anonymized student data to external researchers.<p>We&#x27;re doing a big mobile push. Around 20% of our traffic comes from phones and tablets but we have only two mobile devs so far. We&#x27;re totally overhauling our iOS app; if you join us now, you can be a main developer on an app that is <i>guaranteed</i> to have millions of users. This is a rare opportunity.<p>You&#x27;ll be working alongside a small team with the best in the business – though we have &quot;celebrity&quot; devs like jQuery creator John Resig and Google&#x27;s first employee (and former Director of Technology) Craig Silverstein, we have many more you haven&#x27;t heard of but who are also amazing.<p>Whether you&#x27;re a machine learning guru or you take pride in perfecting UI details for a dropdown menu [2], we have something for you. We really have a great team and culture. We use (and contribute to) new technology [3], we invest heavily in mentoring our interns (and full-timers) [4], we have lots of fun at and around work [5], and even though we&#x27;re a non-profit, we pay well too. I&#x27;m also proud to say that we&#x27;re winning against GitHub in team Bensity (i.e., percentage of employees named Ben) [6].<p>---<p>We&#x27;re hiring engineers (frontend, backend, mobile, data science), designers, and more -- if you&#x27;re a designer, you might also be interested in our parnership with Bridge [7]. And if you want to have an amazing summer (or fall or spring) building real features for real users, we&#x27;re hiring interns too.<p>As I said above, mobile is a big priority for us. Let me know if you know someone great.<p>Please apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> directly (say you saw us on HN!). If you have questions, feel free to ask here or to email me at alpert+HN@khanacademy.org.<p>[1]: <a href=\"http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning\" rel=\"nofollow\">http:&#x2F;&#x2F;derandomized.com&#x2F;post&#x2F;51729670543&#x2F;khan-academy-machin...</a><p>[2]: <a href=\"http://bjk5.com/post/44698559168/breaking-down-amazons-mega-dropdown\" rel=\"nofollow\">http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;44698559168&#x2F;breaking-down-amazons-mega-...</a><p>[3]: <a href=\"http://joelburget.com/backbone-to-react/\" rel=\"nofollow\">http:&#x2F;&#x2F;joelburget.com&#x2F;backbone-to-react&#x2F;</a> (sorry about the background, but there are dinosaur pictures!)<p>[4]: <a href=\"http://bjk5.com/post/71559049069/the-most-common-feedback-we-give-dev-interns\" rel=\"nofollow\">http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;71559049069&#x2F;the-most-common-feedback-we...</a><p>[5]: <a href=\"http://life.khanacademy.org/\" rel=\"nofollow\">http:&#x2F;&#x2F;life.khanacademy.org&#x2F;</a><p>[6]: <a href=\"https://twitter.com/dmnd_/status/425870378330644480\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;dmnd_&#x2F;status&#x2F;425870378330644480</a><p>[7]: <a href=\"http://www.khanacademy.org/about/blog/post/75079597750/khan-academy-joins-bridge-to-find-more-amazing\" rel=\"nofollow\">http:&#x2F;&#x2F;www.khanacademy.org&#x2F;about&#x2F;blog&#x2F;post&#x2F;75079597750&#x2F;khan-...</a>","time":1391280991,"type":"comment"}