{"by":"pixelmonkey","id":7163371,"kids":[7187589],"parent":7162197,"text":"Parse.ly - Remote (EST &#x2F; CST preferred) - <a href=\"http://parse.ly\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly</a><p>We&#x27;re a fully distributed team (see <a href=\"http://bit.ly/distributed-teams\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;distributed-teams</a> for a post by me, the CTO) -- which is to say, a merit-based, technology-forward, super-bright team of Pythonistas who happen to collaborate using the same methods of major open web projects like Wikipedia, Wordpress, Ubuntu, and Mozilla.<p>We are well-funded with a solid SaaS business model, we are growing, and we are product-focused.<p>We&#x27;re looking to expand our engineering team. We are primarily looking for full-stack and UI-focused engineers, especially those with expertise in front-end data visualization &#x2F; interaction. You should know modern web and mobile design principles and be particularly excited by d3.js and its associated ecosystem.<p>You&#x27;d be joining the company at a great time. Our engineering team is still small enough that we feel like an elite task force, but unlike two years ago, we are making millions in revenue and have a ridiculous amount of data to draw insight out of on behalf of our customers.<p>You should be an expert in Python and JavaScript. You should be willing to learn, or already know, technologies like Tornado, MongoDB, Redis, Postgres, and Amazon Web Services. You should be extremely handy at a UNIX command line, possessing all the skills of a sysadmin.<p>If you join, you&#x27;d become part of a team that is building one of the web&#x27;s greatest analytics companies, while also serving a strong mission: helping editors and writers at top news organizations excel in the digital medium.<p>Our software aggregates data on &gt;5 billion pageviews per month of traffic, and we work with major media companies as customers, such as The Atlantic, Arstechnica, Mashable, The New Republic, MIT Technology Review, and many more.<p>Apply by sending a (short!) cover letter to work@parsely.com. Mention this HN post and say you&#x27;re looking for Andrew.<p>Include links to online portfolio, Github, LinkedIn, or any similar services, if you have them. If you have a Python code example that you think expresses your Python coding style, that would also be a good thing to send along -- as plain attachment, Github Gist, or similar.","time":1391288362,"type":"comment"}