{"by":"cloudify","id":7163703,"parent":7162197,"text":"Measurence - REMOTE (UTC-5 ~ UTC+5) - <a href=\"http://measurence.com\" rel=\"nofollow\">http:&#x2F;&#x2F;measurence.com</a><p>Hi! :) I&#x27;m Federico Feroldi, co-founder of Measurence. Our mission is to bring the power of lean analytics practices and tools to the brick &amp; mortar retailers (think about MixPanel and Optimizely for the real world).<p>We&#x27;re very early stage, but with a working product, enough seed funding, some excited customers and a few very important prospects.<p>This is not our first startup. As founders together have almost 30 years of combined tech and business experience with a few startups and exits already under our belt.<p>Your responsibility will be to build the front end app of our analytics platform using Rails and AngularJS. \nThe backend system (data ingestion and analysis) is built on Scala, so there&#x27;s a chance for you to learn it if you want :)<p>This is a fully remote position. You&#x27;ll be able to work from (almost) anywhere you want and organize you working hours as long as you deliver stuff and bring the product closer to the vision that we’re going to shape together.<p>You&#x27;ll not be told what to do. We&#x27;ll, instead discuss together what needs to happen then you&#x27;ll decide what and how to do to make it happen. You&#x27;ll need to be comfortable with the uncertainty that characterizes the early stage of a startup.<p>We value honesty, transparency and direct communication.<p>If you&#x27;re interested to discuss more, tell me your story and show me what you built at fferoldi - at - measurence.com<p>To learn more about the founding team:\n<a href=\"https://www.linkedin.com/in/feroldi\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;feroldi</a>\n<a href=\"https://github.com/cloudify\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;cloudify</a>\n<a href=\"https://www.linkedin.com/in/elionarciso\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;elionarciso</a>","time":1391292922,"type":"comment"}