{"by":"voleon","id":7163270,"parent":7162197,"text":"Voleon Capital Management -- Berkeley, CA -- Full-time, on-site, H1B<p>We are a science-driven systematic trading firm, built on the principle that statistical machine learning provides the best solutions to the scientific problems we must solve. Our CEO is a CS PhD and founded a successful internet startup, and our Head of Research&#x2F;CIO is a Berkeley statistics professor; both have a background in finance.  Our trading is entirely automated and based on cutting-edge machine learning techniques.  We have a collegial, academic working environment, rely on open source software, and have built our own software stack.  We have a track record of strong performance and have been raising money and growing fast.<p>Willingness to take\ninitiative, and a gritty determination to productize, are essential.<p>Our offices are in downtown Berkeley, one block from campus and one block\nfrom BART.<p>We have two positions open: CTO and Member of Research Staff.<p>* Chief Technology Officer<p>We have assembled a small group of exceptional software and infrastructure professionals and seek an experienced candidate to lead and grow the team. The CTO will manage the implementation of our next generation infrastructure, including production trading systems, software infrastructure for our research department, and our compute and storage hardware systems.  The CTO will work directly with the Head of Research and the CEO to set the technical direction of the company.  A strong candidate will be well-versed in state-of-the-art technology (particularly distributed systems and cluster computing), and will have a track record of building and leading elite technical teams and successfully delivering complex projects (especially in a startup environment).  A background in finance is not required.<p>* Member of Research Staff<p>We are looking for a PhD-level scientist to join us in developing predictive models and other components of automated trading systems. You will apply modern statistical machine-learning methods to large, high-dimensional data sets. The work will range from data preparation to model development to production software implementation.<p>We take a rigorous approach to building trading systems, and we actively foster a collegial, intellectual environment.<p>We hire on the basis of exceptional talent. If you excel in a technical field such as statistics, mathematics, computer science, engineering, ,or operations research, then we encourage you to contact us. The following criteria, while not all requirements, illustrate the demands of this role.<p>+ Background in modern statistical methods &#x2F; machine learning<p>+ Evidence of strong mathematical abilities, e.g. publication record, graduate coursework, or competition placement<p>+ Substantial programming experience and interest in software development techniques<p>+ Competence in solving large-scale computing problems<p>+ Track record as an applied researcher<p>+ Demonstrable clarity of thought (not optional)<p>Interest in financial applications is essential, but experience in finance is not a primary factor in our hiring.<p>Benefits and compensation are highly competitive. Interested applicants are encouraged to send a cover letter and resume to working@voleon.com.","time":1391286807,"type":"comment"}