{"by":"turya","id":7163465,"parent":7162197,"text":"Emeryville, Ca - Amyris, Inc - <a href=\"http://www.amyris.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amyris.com</a><p>We are searching for a talented and self-motivated engineer to join our Software Engineering team in building the most advanced production-scale synthetic biology platform on the planet. Research and Development at Amyris is a highly multidisciplinary effort, requiring brilliant contributions from every area of the life sciences and engineering disciplines.<p>From manipulating yeast DNA in the lab to full scale factory production of renewable chemicals, every aspect of our work is facilitated and accelerated by software and hardware automation. Our tools integrate the activities of scientists, engineers, and industrial robots to achieve the rapid optimization of genetic designs and laboratory processes.<p>Among the tools we have developed are a CAD&#x2F;CAM system for genetic engineering: a compiler toolchain whose target architecture is life itself. This stack physically integrates high level genetic modules into microbial hosts. We also derive novel strains through random mutagenesis and directed evolution. Using our custom control platform, we then subject these experimental organisms to high throughput performance screening in our state-of-the-art robot labs.<p>This is your chance to do foundational work in biotechnology. We are past proof of principle; we have begun the rapid expansion of a technology that will characterize this industry. We offer competitive compensation, excellent healthcare, unlimited high quality conversation, and many other benefits.<p>Code is primarily python, javascript and sql (postgreSQL, MSSQL).  We are open to anyone with solid experience with multiple similar languages.<p><a href=\"https://home.eease.adp.com/recruit2/?id=6794621&amp;t=1\" rel=\"nofollow\">https:&#x2F;&#x2F;home.eease.adp.com&#x2F;recruit2&#x2F;?id=6794621&amp;t=1</a>","time":1391290018,"type":"comment"}