{"by":"bitsweet","id":7164035,"parent":7162197,"text":"FULLTIME - Assembly (assemblymade.com) - San Francisco<p>We&#x27;re hiring Front-End and Ruby Engineers to help us build foundational pieces of the Assembly platform. Assembly&#x27;s collaborative platform enables the creation of a new class of software products; where anyone around the world can help collectively build, retain ownership, and receive proﬁt for their contributions.<p>We’re currently a small 5 person team in San Francisco that has recently secured a healthy financing from top-tier investors which will enable us to tackle the enormous challenges of creating a ‘meta’ company (a software company that creates software companies). You would have a direct hand in helping us shape the future of work and unlocking the power of independent creators.<p>We believe in progress over consensus, strong opinions weakly held, moving fast is best even if it breaks things, and we make what we measure - but you&#x27;ll have the opportunity to add your own lessons to that list. We work alone and we work together; meaning we believe the best know how to get things done on their own, as well as how to work in a team. Everyone on the team is responsible for self directing their work and has a tremendous impact on our shared success.<p>WHAT WE’RE LOOKING FOR<p>* Understand pain points, come up with solutions, and then prototype, iterate, and launch frequently.<p>* Strong opinions on testing &amp; code quality.<p>* Over 3 years experience with Ruby.<p>* Experience with Heroku, ElasticSearch, Postgres, or Redis a plus.<p>WHAT WE OFFER<p>* Free meals.<p>* Flexible work hours.<p>* A great vacation policy.<p>* Stand up desks, mac book pros, cinema displays...Buy or build your ideal work environment<p>* A sunny office space.<p>* Competitive salary and equity package.<p>* 100% covered health benefits.<p>We’re located in Mission, San Francisco, CA. Please apply by sending any work, resume, github username to jobs@assemblymade.com","time":1391298906,"type":"comment"}