{"by":"bitovi","id":7164847,"parent":7162197,"text":"Bitovi - Remote (N. America preferred) - <a href=\"http://bitovi.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bitovi.com</a><p>We are simplifying JavaScript development. We build amazing web apps, the right way. After years of solving complex front-end engineering problems, we know what works and what doesn’t. We’ve baked that experience into our tools, consulting, and training.<p>We’re a team of 20 developers (and designers) located around the US, Canada, and Croatia. This is a remote position, but due to travel requirements, we have a strong preference for North American-based developers.<p>YOU<p>We’re looking for passionate JavaScript developers who who enjoys identifying the hard parts of application development and simplifying them, talking about software architecture, and teaching others. We also want someone who can lead others and be an integral part of a team, but can also hang out with the dev team after the workday.<p>The following attributes are major positives, but not all hard requirements:<p>- Some experience contributing to or at least using open source<p>- Doesn’t mind a bit of travel, averaging one week per month<p>- Has strong opinions about the right way to develop<p>- Has a lot of JavaScript experience<p>- Has some full stack experience (backend and DB)<p>THE JOB<p>As soon as you begin, we’ll train you to become an expert in JavaScript application design, frontend architecture, and our JavaScriptMVC stack of tools. You’ll work with clients creating applications, designing and discussing architectures, reviewing code, and researching new front-end technologies.<p>In addition to client work, you’ll have the opportunity to shape a small and growing company by applying your talent and passion towards an area of interest. Bitovi developers:<p>- Speak at conferences<p>- Give trainings<p>- Run meetups<p>- Maintain open source projects<p>- Write articles<p>BENEFITS<p>- Competitive salary and yearly bonuses<p>- Bi-annual company retreats (previously in Las Vegas, New Orleans, and Amelia Island)<p>- 401(k) plan with matching<p>- 4 weeks paid vacation<p>- Health and dental insurance<p>- Gym membership reimbursement<p>- Maternity&#x2F;paternity leave<p>- Work from home<p>To apply, send your resume and an introduction that shows us that you are the kind of person we cannot live without to jobs@bitovi.com","time":1391315727,"type":"comment"}