{"by":"iteris","id":7165933,"parent":7162197,"text":"Keywords:<p>- INTERN: No<p>- REMOTE: Yes<p>- ON-SITE: Yes<p>Developer positions available, remote or on-site:<p>- Front-end&#x2F;web<p>- Full web stack<p>- Back-end<p>Company name: Iteris, Inc.<p>Location: Grand Forks, ND (Yup, you read that right.)<p>We&#x27;re seeking multiple positions to bolster our talented development teams. Whether you have 3 years, 8 years, or 15 or more years of development experience, we encourage you to apply.<p>The available positions will be responsible for participating in one or more of Iteris&#x27;s development teams working on highly interactive web sites, widely used mobile apps, big data-based APIs, SQL &amp; noSQL databases, or devops related projects, including participating in all aspects of the development process from design to implementation to deployment. Iteris embraces both the agile and devops methodologies with a very strong focus on maintaining stellar uptimes. There is a heavy emphasis on working with emerging and established web technologies, parallel development with mobile apps, and utilizing relational and non-relational databases. We work with many large data sets centered on weather and traffic. The candidate must be a strong individual contributor, collaborative, and takes pride in their work while delivering quality software on time.<p>Specific skills, experiences, or keywords that get us excited about a candidate:<p>Items with an asterisk (* ) get us really excited when a candidate has advanced knowledge on the subject!<p>- * Web stacks (Apache, Nginx, Varnish, Lighttpd, ...)<p>- * HTTP mastery (headers, caches, access methods, ...)<p>- * Javascript-based app experience (toolkits [dojo, jquery, YUI, etc.], NodeJS, ...)<p>- * Build and maintain sites&#x2F;servers&#x2F;services to survive Slashdot&#x2F;Reddit&#x2F;Fark&#x2F;Twitter&#x2F;Digg effect<p>- * Redundant, replicated, high-performance, multi-data center SQL&#x2F;noSQL databases (SSD friendly!)<p>- * Build automation, automated deployments, self-healing systems<p>- Deployment tools (Docker, Jails, systemd, supervisord, ...)<p>- SQL databases (Postgres, MySQL, Oracle, ...)<p>- NoSQL databases (HBase, MongoDB, Cassandra, Couchbase, ...)<p>- Programming languages (Python, Perl, Javascript, C#, others)<p>- GIS tools (Mapserver, PostGIS, OpenLayers, OpenStreetMaps, Leaflet, Google&#x27;s GIS-related APIs)<p>- Mobile dev experience (iOS&#x2F;Android)<p>- Revision control experience (branching, merging, svn, git, hg, etc.)<p>- Unix&#x2F;Linux development environment<p>Please contact us directly via rand@iteris.com.<p>The full list of available positions are listed here:<p><a href=\"https://www5.ultirecruit.com/ITE1000/JobBoard/ListJobs.aspx?__RecordsPerPage=100\" rel=\"nofollow\">https:&#x2F;&#x2F;www5.ultirecruit.com&#x2F;ITE1000&#x2F;JobBoard&#x2F;ListJobs.aspx?...</a><p>A quick explanation of benefits:<p><a href=\"http://www.iteris.com/about/careers/career-benefits\" rel=\"nofollow\">http:&#x2F;&#x2F;www.iteris.com&#x2F;about&#x2F;careers&#x2F;career-benefits</a><p>Iteris, Inc. is a scientific and information technology solutions innovator, developer, and provider with emphasis in the surface transportation and weather communities.","time":1391348239,"type":"comment"}