{"by":"gtuhl","id":7165271,"parent":7162197,"text":"MailChimp - Atlanta, GA<p>Database Engineer<p>MailChimp is a DIY email-newsletter service based in Atlanta that serves more than 4 million users worldwide. We&#x27;re self-funded and profitable, and we&#x27;re growing fast.<p>Job Description\nMailChimp is seeking a database-focused infrastructure engineer to join our team. You’ll build, maintain, and monitor systems that support millions of users across all products and applications at the company. We operate in a high volume environment and are growing rapidly, adding 10000+ new accounts&#x2F;day with that rate increasing every week. On the infrastructure side we do interesting work to support that scale and growth rate, working closely with developers to build and support our applications.<p>The engineering teams are small and focused, our benefits are unmatched, and internally we function much like a startup aside from established stability and abundant resources. There are no sales people, no investors, no board, and engineering teams are trusted to make good decisions with resources with minimal oversight.  We are competitive nationally on salary and benefits.<p>Applicants should have strong Linux experience, extremely heavy operational MySQL experience, independent troubleshooting skills, and a love for automation and monitoring.  Our core persistence layer consists of hundreds of horizontally sharded and paired Percona 5.5 instances. We are seeking an experienced engineer who would be part of the core infrastructure team with a focus on maintaining and improving this crucial MySQL layer in addition to contributing to the systems that feed off of it (emailgenome.org, Elasticsearch, Postgres, Redis). We take a pragmatic and practical approach to our stacks using proven components and building our own logic and complexity on top of well understood building blocks. This is a large, well built setup with consistent hardware, configs, monitoring, backups, and tuning in place.<p>Skills and Experience:\n- Linux servers\n- Experience with modern MySQL at high volume: sharding, replication, backups, monitoring, tuning\n- Knowledge of the current MySQL ecosystem and an interest in where things are headed\n- Deep understanding of InnoDB performance, recovery, tuning, and backups\n- Experience with replication and an understanding of all options and components involved\n- Exposure to HA solutions like MMM, haproxy, PXC\n- Scripting and coding (python, bash, php)\n- Puppet or other configuration management tool experience is a big plus\n- Zabbix or other monitoring tools\n- Familiarity with other infrastructure pieces of our stacks (nginx, apache, memcache, postgres, redis, elasticsearch) is also a big plus<p>Please apply here, the applications come directly to me:<p><a href=\"http://mailchimp.theresumator.com/apply/oJIqi3/Database-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;mailchimp.theresumator.com&#x2F;apply&#x2F;oJIqi3&#x2F;Database-Engi...</a><p>Many other positions available as well:<p><a href=\"http://mailchimp.theresumator.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;mailchimp.theresumator.com&#x2F;</a>","time":1391327710,"type":"comment"}