{"by":"adammichaelc","id":7165120,"parent":7162197,"text":"San Francisco ---&gt; Hiring Sales Hackers (No Cold Calling -- Hunting for Deals in the 21st Century)<p>What&#x27;s a sales hacker? Sales hackers have several personality traits: \n(1) First and foremost, you get a thrill from &quot;the hunt&quot; of selling, \n(2) you are extremely good at follow-up, \n(3) you are literate in technology (not necessarily a developer or anything, but you like becoming an advanced user of your tools, whether it&#x27;s Gmail or Evernote -- and you follow the software industry), \n(4) you can&#x27;t help but figure out ways to exploit systems for your gain, and \n(5) you understand enough about people to relate to them and you are good at asking pointed questions &amp; listening (as well as persuasive pitching when the time is right)<p><i>About Us</i><p>We are the team behind Mokriya Craigslist. Time, Wall Street Journal, Mashable, Xconomy, and a slew of tech bloggers raved about it. Check it out. <a href=\"http://craigslist.mokriya.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;craigslist.mokriya.com&#x2F;</a><p>We are a team of engineers, UX designers, and thinkers. We have worked for some of the hottest tech startups in Silicon Valley, including Path, MixPanel, Threadflip, SimpleGeo, SideCar, etc.<p>Google has us on a list of “best mobile development teams in the country” so we get calls from them too.<p><i>More Details</i><p>We are looking for strong people who we can build a team on top of. Our immediate functional need is for Sales Development (ie hunting for qualified leads to send to the closers on the team), but we are building leaders. If you join us now, there will be lots of room for professional and personal growth.<p>We have a unique technology stack that will help you automate much of the tedious parts of this job so you can focus on the important part - phone and in-person conversations where you can get to know the prospect.<p>* No cold calling<p>* Learn best practices used by the best B2B software sales organizations on the planet (Salesforce, Omniture, etc.)<p>Send a note to careers@mokriya.com (I&#x27;ll see it, I&#x27;m Adam. Sunil &amp; Pranil, the co-founders, will see it also). Say hi, tell us a bit about yourself. We&#x27;ll be most excited if you can sell yourself in writing.<p>Look forward to hearing from you!<p>Adam<p>801-687-1401","time":1391322561,"type":"comment"}