{"by":"cmcfadden1","id":7166645,"parent":7162197,"text":"Message Systems: Columbia, MD<p>1) Application Software Engineer (Javascript, Node.js, Angular.js)  - several positions at different levels of seniority\n<a href=\"http://messagesystems.com/about-us/careers/open-positions/application-software-engineer-javascript-nodejs-angularjs\" rel=\"nofollow\">http:&#x2F;&#x2F;messagesystems.com&#x2F;about-us&#x2F;careers&#x2F;open-positions&#x2F;ap...</a><p>2) Mobile SDK Software Engineer (iOS, Android, Windows)\n<a href=\"http://messagesystems.com/about-us/careers/open-positions/mobile-ios-application-software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;messagesystems.com&#x2F;about-us&#x2F;careers&#x2F;open-positions&#x2F;mo...</a><p>Several other positions can be found here:  <a href=\"http://messagesystems.com/about-us/careers/open-positions\" rel=\"nofollow\">http:&#x2F;&#x2F;messagesystems.com&#x2F;about-us&#x2F;careers&#x2F;open-positions</a><p>Application Software Engineer (Javascript, Node.js, Angular.js)<p>Message Systems is looking for a highly motivated full-stack Application Software Engineer to help us design and build applications and user interfaces that support our suite of industry-leading messaging software.  We are an engineering-focused company founded by an engineer and our customers include tech leaders Facebook, Linkedin, Twitter, Rackspace, Match.com, and Zynga.\nWe currently have several positions available for varying levels of experience. This position is based in Columbia, MD.  Message Systems believes in a fun but focused development environment:\n* Open floor plan\n* Flexible hours\n* Outstanding benefits\n* Hackathons\n* Group activities\n* Stocked kitchen with fresh food and catered lunch once a week\n* Equipment includes MacBook Pro + Linux Workstations<p>Responsibilities:<p>* Work within an agile software engineering team to create software applications that delight our customers.\n* Software development includes: Back-end &amp; front-end, database development, UX design, REST APIs.\n* Collaboration within the team and with our partners is essential (Product, Project Management, other teams) for all activities: requirements analysis, R&amp;D and prototyping, architecture, estimates, documentation, coding, and testing.\n* Unit, functional, and performance testing of backend and front-end code.\n* Automation of development, build, and testing process.<p>Desired Experience and Qualifications:<p>* 2-5+ years experience building, testing, and deploying high quality, highly reliable, scalable web applications, APIs, and user-interfaces in a team environment. \n* Expertise in server-side development with NodeJS (Express).\n* Expertise in client-side development with Javascript (AngularJS, JQuery), HTML, and CSS (Twitter Bootstrap)\n* Expertise with Linux.  \n* Experience with and passion for quality-oriented software development best practices including unit and functional testing, automation, continuous integration, and low-dependency architectures.\n* Ability to mentor other developers, and otherwise share and collaborate with peers on best practices, testing, and building in quality.\n* Must think critically, be outcome oriented, and constantly strive for improving how the team reliably delivers high-quality software.\n* Excellent analytical, problem solving, and debugging skills\n* Experience with version control systems, particularly distributed models including Mercurial and Git.\n* Knowledge of software design best practices: OOD, SOA, and design patterns.\n* Experience with relational (PostgreSQL, Vertica, Infobright) and non-relational databases (Cassandra, Hbase) and search engines (ElasticSearch, SOLR)\n* Experience with system and data integration and message queues.\n* Experience in commercial software products industry is a plus.\n* Experience with responsive design is a plus.\n* Experience with mobile application development (iOS, Android) is a plus.\n* Experience with the following tools is a plus: JIRA, Confluence, Crucible, Bamboo, Grunt, Vagrant, Selenium (testing), Karma (testing), Mocha (testing)\n* Bachelor&#x27;s Degree in Computer Science or related field or equivalent experience.\n* Experience with Agile development.","time":1391361652,"type":"comment"}