{"by":"archerabi","id":7168304,"parent":7162197,"text":"OnDeck ( New York,NY)<p>We are seeking Java Engineers &amp; Web Engineers for our Development Team to build cutting-edge web applications from the ground up that will help millions of small businesses across the country gain access to capital they need to grow their business. We are a tech startup backed by Google and Peter Thiel (among others). \nWe are a big proponent of cutting edge open source tools. We do not believe in red tape and seek to securely empower our development team to rapidly roll out new features. We welcome out-of-the-box thinking, resourcefulness, and a desire to innovate<p>==========<p>About You:<p>==========<p>* Startup experience, and experience building scaling web applications.<p>* You have 2+ years of experience using the Java platform.<p>* You have 2-5+ years of experience working on web-based projects, with exposure to the full stack.<p>* You are comfortable with building object-oriented systems and have an eye for good design.<p>* Ideally, you’ve created a public GitHub project, posted answers on Stack Overflow, modified open-source code, or created some hacks that you’re proud of.<p>* You have at least a Bachelors degree in Computer Science.<p>=============================<p>At on Deck Capital, you will:<p>=============================<p>* Have a meaningful impact on the company&#x27;s future, and share in the rewards accordingly.<p>* Be able to drive which technologies are used and which software development practices are followed.<p>* Work in a fun, fast-paced startup environment with some really cool and brilliant people.<p>* Be on a motivated team that gets a lot done.<p>======<p>Perks:<p>======<p>* Competitive salary, Stock options, 401K, Vision, Dental, Life, and Health insurance,<p>* In-office Happy Hour Wednesday’s<p>* Free drinks and snacks from our fridge<p>* Flexible time off and vacation policy.<p><i>Send your resumes to abhijithrc@ondeck.com or apply at <a href=\"https://www.ondeck.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ondeck.com&#x2F;careers</a>. Please include links to github, stackoverflow, blogs etc.</i><p>Check out why we’re such a great company to work at:<p>* <a href=\"https://www.ondeck.com/in-the-news\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ondeck.com&#x2F;in-the-news</a><p>* <a href=\"http://blog.ondeckcapital.com/blog/on-deck/on-deck-named-top-25-starts-up-to-work-for\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.ondeckcapital.com&#x2F;blog&#x2F;on-deck&#x2F;on-deck-named-top...</a><p>* <a href=\"https://www.ondeck.com/in-the-news/34-articles/477-techcrunch-ondeck-17m-gv-pt\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ondeck.com&#x2F;in-the-news&#x2F;34-articles&#x2F;477-techcrunc...</a><p>* <a href=\"http://www.forbes.com/sites/jjcolao/2013/03/27/need-a-business-loan-impress-the-algorithm-not-the-loan-officer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;jjcolao&#x2F;2013&#x2F;03&#x2F;27&#x2F;need-a-busine...</a>","time":1391389325,"type":"comment"}