{"by":"edolfo","id":7171658,"parent":7162197,"text":"SVBio: Foster City, CA (next to San Mateo, in the SF Bay Area): Full-time\n=========================================================================\nSVBio (<a href=\"http://svbio.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;svbio.com&#x2F;</a>) is looking for the most talented full-stack software engineer with experience and understanding of web architecture design and implementation, following best and up-to-date practices. The work will further enhance the application of our clinical-grade genome interpretation engine. As leaders in the field, we drive the vision of the genome-interpretation product down to the last detail - only modern browsers are supported here!\nKnowledge of some specific technologies is greatly desired (see below), but not necessarily required for the right hacker. Knowledge of javascript is a must, as well as the desire to write clean and maintainable code. Knowledge of the genome and next-generation-sequencing technologies is really nice to have, but definitely not required. SVBio is a tightly-knit organization with people from many diverse disciplines and backgrounds, so being an all-around friendly person is a must.\nAnyone who is interested should contact me (elicudine -A-T- svbio.com) directly with your background, a resume&#x2F;c.v., some previous work samples, a github link, whatever you think might help me out.\n---Preferable knowledge&#x2F;experience---\n- Significant proven experience, both in frontend and backend technologies.\n- Dynamic frontends (angular.js, angular-ui, JQuery, d3.js)\n- Advanced backend architectures (at least one of: node.js, express&#x2F;hapi&#x2F;geddy&#x2F;koa, flask, twisted, django, sinatra, rails)\n- Scalable persistency layers (HDFS, Postgres, mysql, mongodb)\n- Other tools (grunt.js, bower.js, require.js)\n- Testing frameworks (at least one of: chai.js, mocha.js, karma, capybara, cucumber, istanbul, supertest)\n-- Additional valuable experience:\n- Strong scripting knowledge (e.g., python, perl, bash)\n- An eye for aesthetics","time":1391445960,"type":"comment"}