{"by":"amwelles","id":7171053,"parent":7162197,"text":"Raleigh, NC, USA<p>Coalmarch is based in Raleigh, North Carolina, and provides its services to the United States and Canada. Our ideal candidate will live in Raleigh, NC or is willing to move in the near future. We are seeking exceptional people to join our team and be part of something amazing. If you think you have what it takes let’s talk. No calls please!<p>-----<p>PHP Developer -\n<a href=\"http://coalmarch.theresumator.com/apply/kZezfR/PHP-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;coalmarch.theresumator.com&#x2F;apply&#x2F;kZezfR&#x2F;PHP-Developer...</a><p>Coalmarch is looking for a PHP Developer to work with our web development team in creating user friendly, well structured, and scalable software- on-time and with minimal defects.<p>We are looking for a developer that is an expert in PHP&#x2F;MySQL and has experience working with a CMS, preferably Drupal. Our ideal candidate enjoys staying up to date on the latest technologies and trends and enjoys leading a team.<p>We want someone who can provide guidance and insight on development techniques and methodologies. Our ideal candidate writes clean, well-engineered code that conforms to accepted standards within the Drupal community.<p>------<p>Front-end Developer -\n<a href=\"http://coalmarch.theresumator.com/apply/BqFb5E/FrontEnd-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;coalmarch.theresumator.com&#x2F;apply&#x2F;BqFb5E&#x2F;FrontEnd-Deve...</a><p>The job of the Front End Developer at Coalmarch is to create and theme websites utilizing the Drupal framework.<p>We are looking for a full-time front-end developer with content management experience (including CCK, views, JQuery, PHP, and CSS) to help us better serve new and existing clients. The ideal candidate would be interested in furthering their development skills and would enjoy working with Drupal (our preferred CMS).<p>Our ideal candidate has an eye for design and good UX. They don’t have to be a graphic designer, but they should understand the basics, and know how to implement them. We want someone who enjoys documenting their work whether it is commenting code or logging details into Basecamp (our project management system).<p>-----<p>Local Search Specialist -\n<a href=\"http://coalmarch.theresumator.com/apply/0DvO8R/Local-Search-Specialist.html\" rel=\"nofollow\">http:&#x2F;&#x2F;coalmarch.theresumator.com&#x2F;apply&#x2F;0DvO8R&#x2F;Local-Search-...</a><p>The job of a Local Search Specialist at Coalmarch is to research and execute exceptional local search strategies for our clients.<p>The Local Search Specialist will be keenly aware of how Google works and changes and will be able to explain the implications of changes to the team. They will have a passion and understanding of microformats, schema, rich snippets, and social signals that impact local search results. The local search specialist will be responsible for analyzing and executing client’s SEO strategies.<p>The ideal candidate will be a team player and is interested in the bigger picture of how search impacts local-based businesses.<p>-----<p>Account Coordinator -\n<a href=\"http://coalmarch.theresumator.com/apply/BAp4wT/Account-Coordinator.html\" rel=\"nofollow\">http:&#x2F;&#x2F;coalmarch.theresumator.com&#x2F;apply&#x2F;BAp4wT&#x2F;Account-Coord...</a><p>The job of an Account Coordinator at Coalmarch is to provide amazing customer service to our clients, manage their expectations, and communicate their needs to the team.<p>Our ideal candidate is someone who is very organized and can manage website projects and inbound marketing clients. The account coordinator will work with the development and marketing teams to keep projects organized, on time, and on budget. The account coordinator will collaborate with the teams to manage capacity and keep the team focused on their priorities.<p>This position will be in touch with a lot of areas of the business. We are looking for someone who can work in a fast-paced environment and maintain a great attitude towards our clients, team members, and vendors.","time":1391441256,"type":"comment"}