{"by":"paf31","id":7171924,"parent":7162197,"text":"DICOM Grid - Phoenix AZ, or REMOTE, no H1B, US only - JavaScript Developer<p>DICOM Grid, a SaaS start-up in the healthcare technology field, is looking for a JavaScript developer to maintain and enhance DICOM Grid’s front-end medical image sharing and reading web application. You will report to the Director of Dev Ops.<p>Familiarity with modern front-end web development is essential, including but not limited to HTML5, CSS, JavaScript, LESS, JQuery, Underscore, Handlebars, Backbone. Experience working in the medical industry (DICOM, HL7, PACS, etc.) would be a bonus, but is not required.<p>The ideal candidate would be able to work independently with minimal supervision, and be enthusiastic about keeping up-to-date with the latest web technologies.<p>The team is distributed with team members working remotely in Phoenix, Los Angeles, Boston, and New York.\nPosition Responsibilities<p>- Plan, evaluate, implement, test and document new features and bug fixes for the DICOM Grid web application.<p>- Work with other development team members to integrate with backend services.<p>- Work with DevOps to deploy code into our production and UAT environments.<p>- Work with customers and professional services to gather requirements.<p>- Conform to company standard operating procedures.<p>What qualifies you to join?<p>- A combination of a college degree in CS, Math, Physics, or related, relevant work experience, and&#x2F;or a strong open source portfolio.<p>- General interest in the healthcare field.<p>- Strong communication and interpersonal skills.<p>- High enthusiasm and desire to work on an entrepreneurial team.<p>- Roll-up-the sleeves attitude is a must.<p>- Meticulous attention to detail with strong organization skills<p>- Heavy emphasis will be placed on problem solving skills, personal initiative and good people management&#x2F;relationship skills. Sense of humor is mandatory.<p>Logistics<p>- This is virtual position, you must be able to work from home effectively<p>- Base salary and stock options depend on experience; health insurance, paid holidays and vacation are part of the package.<p>Send your resume along with links to your StackOverflow, GitHub profiles, etc. to pfreeman+hn@dicomgrid.com. For bonus points, include a solution to the following short task, including code in JavaScript or the frontend language of your choice: given a JSON object conforming to the schema { value: ..., collapsed: (true|false), children: [...] }, where children is an array of objects conforming to the same schema, and a function render taking values to DOM elements, layout the information for read-only display, with the ability to expand&#x2F;collapse individual nodes. The aim of the exercise is to demonstrate familiarity with Javascript, so a very basic UI is all that is needed.","time":1391447755,"type":"comment"}