{"by":"OneMed","id":7171802,"parent":7162197,"text":"San Francisco, CA<p>--<p>Design-Oriented iOS Engineer\nOne Medical Group<p>We’re a tech company that delivers primary care. We seek a creative iOS engineer to join us in building our platform of digital health solutions to power our growing network of medical practices.<p>One Medical is a next-generation network of primary care practices designed to reinvent what health care should be. Using technology and process redesign, patients receive a convenient, accessible, and transparent health care experience that’s really unlike any other. Our offices are in San Francisco, New York City, Boston, Chicago, and Washington DC, and we’re expanding.<p>We offer the opportunity to work on solving a fantastic blend of compelling problems. These include mobile diagnosis and treatment; health data visualization and interactivity; video and device integration, social&#x2F;behavioral change, monitors&#x2F;sensors and more.  Plus the ability to create innovations that truly impact people’s lives.<p>You Have:<p>--Rich iOS development skills including, of course, Objective-C, UIKit and Storyboarding but also consuming RESTful APIs, Core Data, Core Animation, AFNetworking and similar such.\n--Published apps in the AppStore with impressive ratings &#x2F; ranking\n--3 - 5+ years industry experience, principally in consumer product space<p>You Are:<p>--Happiest innovating with Engineering, Product and Design folks. \n--Driven to engineer crisp, performant code\n--Prone to moments of outstanding creative genius<p>Our Tech:<p>--Native iOS apps talking to Rails stack via in-house REST API\n--Agile; Continuous Integration; Pivotal Tracker\n--Lean UX; In Situ User Testing and Design Iterations<p>We Offer:<p>--Competitive compensation and above average benefits including One Medical care\n--Downtown San Francisco location (352 yards &#x2F; 3 minutes from Montgomery St. station)\n--Internal hackathons, quarterly team offsites, personal development budget\n--People you&#x27;re happy to see every day\n--Opportunity to change the world<p>Contact: mobile@onemedical.com","time":1391446946,"type":"comment"}