{"by":"jscalisi","id":7172427,"parent":7162197,"text":"Palantir is hiring Infrastructure Quality Engineers in Palo Alto, CA.<p>Palantir Infrastructure Quality Engineers work on cross-functional product teams to ensure a successful, high quality product release.  We are looking for energetic, highly motivated, and detail-oriented engineers with strong software skills to fill this role.  As an Infrastructure Quality Engineer at Palantir, you will play a critical role in defining Palantir’s world-class information analysis platform.  You will accomplish this by drawing on your superb engineering ability to solve complex software problems.  You will figure out how to assess the server architecture of each release of Palantir’s platform to ensure that it operates flawlessly.  You will be responsible for designing software tests based both on expected uses and functional requirements; validating functionality; finding, filing, verifying, and solving issues and defects; and providing extensive input to the software development process.  This is an opportunity to join a fast growing start-up and be a critical member on cross-functional product teams building disruptive technology.<p>Responsibilities<p>Review and critique software specifications\nDesign and execute test cases using functional requirements\nDevelop scripts to automate and validate functionality\nFind and file defects; verify fixed deficiencies\nDebug software&#x2F;server issues\nWrite scripts to generate large data sets for scale testing\nMaintain and administer robust enterprise software deployments\nWork with developers to ensure a successful, high-quality release\nRequirements<p>BS&#x2F;MS in Computer Science, Computer Engineering, Information Systems, or equivalent\nDouble major in Finance, Mathematics, or Physics is a plus\nStrong experience with Linux; specifically, the ability to diagnose software issues on a server environment\nStrong shell scripting, Python or Perl\nFirm grasp of back-end QA methodologies with a focus on scale performance\nOracle, Postgres and&#x2F;or other (SQL) database knowledge\nSystems administration experience highly desired\nAbility to work in a fast-moving environment with ad-hoc objectives\nExcellent teamwork, independent decision making, and written&#x2F;verbal communication skills\nAnalytical thinking, creative problem solving, trouble shooting, and attention-to-detail a must<p><a href=\"http://www.palantir.com/careers/OpenPosDetail?id=a0m80000000jNlvAAE\" rel=\"nofollow\">http:&#x2F;&#x2F;www.palantir.com&#x2F;careers&#x2F;OpenPosDetail?id=a0m80000000...</a>","time":1391451264,"type":"comment"}