{"by":"lknix","id":7174728,"parent":7162197,"text":"Big Data&#x2F;Distributed Systems Software Engineer<p>AppMonsta - REMOTE<p>AppMonsta collects massive amounts of data about mobile apps and turns it into actionable metrics for a wide variety of business customers ranging from investors to health care companies to startups. We really love data, building distributed systems, and helping people understand complicated market dynamics through our data.<p>We&#x27;re looking for a distributed systems&#x2F;big data software engineer to join our distributed team. You&#x27;ll take ownership of our crawl &amp; data pipeline, keeping them running with high uptime, scaling them up to handle load, and adding new data sources and new features to help our customers make even better decisions. Experience with distributed systems and&#x2F;or big data is a huge bonus - we&#x27;re looking for people that have a good intuition about what good architecture looks like, and who can grow into leadership roles.<p>Our current tech stack is mostly Python, Linux, AWS (EC2, S3, &amp; EMR mostly), MongoDB, Celery and Redis. If you haven&#x27;t worked with individual pieces of this before it&#x27;s fine - we like working with smart people that are comfortable working in a distributed systems&#x2F;big data&#x2F;cloud environment. We&#x27;re happy to help you get up to speed with anything you haven&#x27;t seen before. We practice peer code review and continuous deployment on all our code and systems.<p>Our entire team works remotely. We&#x27;re very flexible about where and when you work, as long as you ship code, keep systems online, and are reachable by other team members for part of the day. We stay in touch via a team chatroom and weekly team video chats, with impromptu 1-on-1 video chats whenever there&#x27;s a detailed issue to discuss. To make this work, you&#x27;ll need to be in a compatible timezone (between PDT(UTC-08) and CET(UTC+1)), and be very fluent writing and speaking English. Like getting out of the house to work? Ask about our mobile Internet subsidy:)<p>This is a full time, longterm opportunity. If this sounds exciting, send us an email at jobs@appmonsta.com, and we can get the conversation started.","time":1391475248,"type":"comment"}