{"by":"lramirez","id":7178937,"parent":7162197,"text":"Santa Barbara, CA - PHP Developer<p>Is LAMP more than just an appliance in your living room? Is Ajax more than just a powdered household cleaner? Do you count electric sheep? Well then my friend, have we got a job for you! Join our team of adept developer ninjas as they grow our core code base by constantly optimizing our existing code while adding new and exciting Web 3.0 features! Additionally, you’ll be helping us with our client email delivery by handling bounces accurately and instantly, identifying and stomping out spam, and extending the current toolset that we offer to our clients! It is truly nerd-vana.\nDuties:\n·Collaborate with the team to solve problems\n·Track down and squash bugs when discovered or reported.\n·Work with product team to architect, develop and deploy new features\n·Improve existing code base by discovering and re-factoring speed bottlenecks, ensuring clean MVC and object-oriented architecture throughout, etc.\n·Research, architect, and port localized data file system to distributed content delivery network (CDN).\n·Research, test, and deploy portions of our system for hosting via AWS.\n·Monitor and improve algorithms to improve speed and delivery response\n·Build scripts to improve workflow for delivery admin\n·Design and implement queuing algorithm to minimize delivery latency while under load\n·Brainstorm caching schemes for quick delivery of email to MTA\n·Research, identify patterns, and develop algorithms to find and stop email abusers\n·Convert infrastructure to scale seamlessly from 3000 accounts to 100k accounts\n·Integrate 3rd party email testing and rendering services to provide customer feedback\nAlso:\n·Review customer feedback and develop reporting system improvements\n·Design database queries to improve speed and capability of our reporting engine\n·Design front-end data display tools for end-users, including scheduled reports via email, PDF, and more\n·Work with database engineer to develop real-time, live reporting for various datasets such as sales and lead flow\n·Develop internal statistics to monitor system and feature usage and display on company dashboard<p>Apply at:  recruiting@ontraport.com\n<a href=\"http://ontraportcareers.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;ontraportcareers.com&#x2F;</a>","time":1391535451,"type":"comment"}