{"by":"benjamid","id":7178289,"parent":7162197,"text":"---Memphis, TN (University of Memphis, workforum.memphis.edu)---<p>Currently searching for a full-time senior research programmer at the Institute for Intelligent Systems (IIS) to begin as early as February 2014.  Since the job involves working closely with researchers, it must be done on-site. Applicants must have completed a MS or PhD in software-related field, or a track record of industry experience on-par with such credentials. Successful candidates should have more than 5 years of experience in software design and development.<p>The candidate will be involved in the design and implementation of a novel service-oriented framework for intelligent tutoring systems (ITS).  ITS use a combination of artificial intelligence techniques, expert knowledge models, and computerized learning environments to significantly increase student knowledge.  UM-IIS is one of the leading labs in the world for ITS and is producing a natural language (NLP) service-oriented tutoring system.  This system will drive animated tutoring agents in traditional hypermedia contexts (e.g., HTML5) and also virtual reality environments (e.g., Unity).  We are looking for a programmer with strong fundamental skills and the drive to research interesting software problems.  Opportunities to publish scientific research will be available, but not required.  Our ideal candidate would have a background developing Python Web Services, but other well-qualified candidates will be considered.<p>Role and Responsibilities:\n● Develop scalable Python web services\n● Deploy and monitor Amazon Web Service deployments of these services\n● Maintain a well-tested and orderly code base\n● Work well in a small programming team environment<p>Preferred Skills:\n● 3+ Years Python Programming Experience\n● Experience with Amazon Web Services, MongoDB, Flask, and&#x2F;or OAuth\n● Experience with bug tracking, version control, and test frameworks\n● Good documentation habits (@param UsesDocStrings: Defaults to True)<p>Compensation:\n● Pay Range: $55k – $85k, commensurate with experience and fit\n● Benefits Available: State of Tennessee Partners Health Care Program\n● Travel opportunities to attend relevant conferences and meetings<p>How to Apply\nPlease complete an on-line application at <a href=\"https://workforum.memphis.edu\" rel=\"nofollow\">https:&#x2F;&#x2F;workforum.memphis.edu</a>  Click on the staff position box to find the posting for Senior Research Programmer. You will be required to upload a cover letter, resume, and a reference list.  Application review will begin in January 2014, and will continue until the position is filled. The University of Memphis is an Equal Opportunity&#x2F;Affirmative Employer.  We urge all qualified applicants to apply for this position. Appointment will be based on qualifications as they relate to position requirements without regard to race, color, national origin, religion, age, gender, handicap or veteran status. Successful candidates must meet guidelines of the Immigration Reform and Control Act of 1986.  The current job posting for this position is at: <a href=\"https://workforum.memphis.edu/postings/5996\" rel=\"nofollow\">https:&#x2F;&#x2F;workforum.memphis.edu&#x2F;postings&#x2F;5996</a>  The position number is 017180 in workforum.memphis.edu.  Please submit application materials through the University of Memphis workforum for consideration.  For questions on this posting, please contact Xiangen Hu (xhu@memphis.edu) or just reply here.<p>---<p>On a side note, the Institute for Intelligent Systems at UM is also an excellent and friendly work environment.  Programming is typically done in small teams, with a lot of opportunities for creativity.","time":1391530228,"type":"comment"}