{"by":"AndreLG","id":7180709,"parent":7162197,"text":"UBER Engineering\nSan Francisco\nFull Time<p>Sr. Software Engineer:  Supply-Engineering<p>Do you feel like the most exciting code is the code closest to the business? Do you thrive on being a generalist who’s able to understand infrastructure issues, develop backend services and design delightful web and mobile experience? Do you want to have a huge impact on people’s lives, helping them grow their business? Then join our supply engineering team!<p>Us<p>Our supply engineering team is responsible for prototyping, building and maintaining the partner-facing platform and business logic, supporting the livelihood and well-being of providers.<p>● We build internal tools to improve our operational efficiency, achieving high impact on the bottom line. Our team created an SMS Inbox that makes communicating with our partners a breeze.\n● We maintain of partner-facing tools helping them manage their business, abstracting complex tax and regulatory frameworks. For instance, we built a payment architecture that handles large volumes of financial transactions.<p>You<p>● Intelligent. Highly adaptable. Rapid learner.\n● Experience building web services. Deep knowledge of the web stack (from top to bottom).\n● Experience building highly scalable services.\n● Advanced knowledge or eagerness to learn Python, JavaScript, HTML&#x2F;CSS.\n● Advanced knowledge or eagerness to learn PostgreSQL, Redis, Kafka.<p>The role<p>As a member of our team, you’ll be confronted with a variety of technical challenges, including:<p>● Creating flexible implementations that are able to support extremely different regulatory environments, on a city and country basis.\n● Leveraging technologies such as OCR to considerably streamline internal processes.\n● Interfacing with different payment gateway providers to handle our partners’ payment.\n● Designing automatic anomaly detection for key business metrics.<p>We&#x27;re bringing Uber to every major city in the world.  We need brains and passion to make it happen and make it happen in style. Come join us!<p><a href=\"https://www.uber.com/jobs/4810\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uber.com&#x2F;jobs&#x2F;4810</a>","time":1391553065,"type":"comment"}