{"by":"tani_buttercoin","id":7200087,"parent":7162197,"text":"Buttercoin\nDev Ops Engineer - Palo Alto, CA\n<a href=\"http://buttercoin.com\" rel=\"nofollow\">http:&#x2F;&#x2F;buttercoin.com</a><p>Buttercoin makes Bitcoin trading platforms. We make them fast, safe, and easy to use.<p>We&#x27;re seeking an experienced Dev Ops Engineer to start immediately. This would be a full-time on-site position at our office in downtown Palo Alto, though we might be open to a contract position with the right person.<p>Do you love branching, testing, and deploying code across multiple servers at a moment’s notice? Does the thought of migrating hundreds of thousands of database items in 10 tables across 5 machines get you excited? How about backups? And, more importantly, restoring those backups? Remotely? In the middle of the night? Are you a source management pro, with extensive experience using distributed version control systems (i.e Git, Mercurial, Subversion). How much do you know about large relational and NoSQL databases, and can you manage the internals of our systems, check load balances, and respond in the blink of an eye to automated messages about the state of these machines? All while managing risk  and delivering superior results?<p>If this sounds like a typical day in your dream job, then we’d love to hear from you! You should be a developer with some experience as a systems administrator, or a systems administrator with extensive programming knowledge, and have an extensive open source portfolio (a link to your GitHub profile is required, please include it in your response).<p>Preferred Experience:\n* Provisioning tools like Chef or Puppet\n* Node and Java. Scala experience strongly preferred\n* CI and frequent deployments on a released product\n* Some Bitcoin knowledge preferred<p>Responsibilities:<p>* Own the workflow for getting new code into the wild\n* Use and develop tools to automate QA and release deployment\n* Design and implements systems to monitor the health of running code\n* Troubleshoot issues across the entire stack\n* Develop app features relevant and participate in code reviews\n* Take part in 24&#x2F;7 on-call rotation<p>If interested, please send an email to &quot;jobs@buttercoin.com&quot; with a link to your Github profile","time":1391827529,"type":"comment"}