{"by":"BdeUtra","id":7243899,"parent":7162197,"text":"London, UK | www.letolab.com | Full Stack Web Developer<p>We&#x27;re on a hunt for:<p>Dedicated web developer to join our growing team, based in the middle of the sought after Silicon Roundabout area, just opposite Google Campus in London. Taking into account our focus on innovation and the pace of work, we&#x27;re looking for an open-minded, flexible, and adaptable to change individual with a professional attitude to work. \nRequired Skills<p>Knowledge of:<p><pre><code>    * Fluency in Python and JS\n    * Exposure to OOP and Functional Programing\n    * Good knowledge of HTML&#x2F;CSS\n    * Django web framework\n    * Git\n</code></pre>\nExtra points:<p><pre><code>    * Knowledge of other languages (e.g Go)\n    * Node.js\n    * Exposure to evented&#x2F;asynchronous patterns\n    * Client side JS frameworks (backbone, angular, react, etc)\n    * TDD\n</code></pre>\nIn return you get:<p><pre><code>    * Competitive salary\n    * Rewards and recognition\n    * Work in experienced &amp; agile team\n    * Opportunity to work closely with London-based and international startups\n    * Opportunity to attend multiple tech events in the UK and abroad\n    * The latest technologies and devices to assist in your work\t \t\n    * Friday beers, Fifa, and much much more!\n</code></pre>\nAbout Leto:<p>Leto is a digital innovation agency that works with startups and enterprises. It helps to build and scale up new ventures and provides all kinds of services from IT consultancy, to branding, design and application development. Leto is also involved in various startup and technology events around Europe and London particularly, having presented at conferences and summits, as well as having recently run a pan-european startup competition StartupRally(<a href=\"http://startuprally.org\" rel=\"nofollow\">http:&#x2F;&#x2F;startuprally.org</a>).<p>If all of the above sounds cool to you – we want to hear from you asap! Drop an email with your CV attached to team@letolab.com. Please remember to include some links to show off your work (e.g. github, bitbucket).","time":1392475278,"type":"comment"}