{"by":"germanstartup","id":18589878,"parent":18589702,"text":"Unnamed Yet | CTO | Germany, Hamburg or Berlin | Full-Time | ONSITE | 10% equity<p>Use your chance to design a product from scratch. I am searching for a CTO who wants to be a part of building an App that will change the whole restaurant industry. We already have over 200 restaurants as partner and funds are on its way. We will start in Q1&#x2F;2019 on technical green grass.<p>You would...<p>* Work for an extraordinary life-work-balance and a fair, market-driven compensation* Have the chance to build a product from day one and disrupt a whole industry<p>* Be responsible for building the app (currently the plan is to build it together with a brilliant app development agency. I am curious about your opinion)<p>* Hire your own tech team, take responsibility for your team and the product<p>* Work in a team of young, passionate individuals that want to change the world<p>We…<p>* Care for personal skills and want to benefit from your knowledge<p>* Believe in flexibility instead of 40h&#x2F;week<p>* Live a feedback, non-bullshit-speak culture<p>* Honour error-making instead of unconsciousness<p>* Are building a real team where on-site activity is needed nevertheless we will have homeoffice policies.<p>Interview process: virtual session(s) with CEO; on-site beer and pizza with CEO; work out your own contract as you will be the first person you will hire for your tech team;)<p>Contact me: whoishiringyc@gmail.com (if you are german, application in german is absolutely fine)<p>Avoid the confidence gap and reach out to me without bullshit-speak.\nI am interested in…\n<i>a brief introduction of you as a person.\n</i>what projects did you work on in the past? References are really appreciated.\n<i>what experiences do you have in the app industry?\n</i>what companies did you work for?\n<i>why do you think you are the right person to build a tech team&#x2F;app from scratch?\n</i>which programming languages are you capable of?<p>Take the chance. Apply. Everything else, we can discuss later on.","time":1543853709,"type":"comment"}