{"by":"secureailabs","id":18592018,"parent":18589702,"text":"Senior Software Architect | Full Time | Cambridge, MA | ONSITE<p>Secure AI Labs (SAIL) has built and patented a new secure analytics platform that allows healthcare and life science companies to share valuable, sensitive data while maintaining ownership and privacy. SAIL is building a securely accessible network that integrates with existing data silos. Machine learning models are able to be trained and run through the network on isolated data sets.<p>We combine (i) secure computation technology with (ii) decentralized machine learning to increase the accuracy and speed of analytics for patients and healthcare providers. SAIL&#x27;s customers are training algorithms on encrypted health records and encrypted drug libraries, ensuring data ownership and privacy without compromising the computational speed and accuracy necessary for medical research.<p>We’re a pre-seed startup with 3 major pilots underway, so this role has high potential for growth within the company.  We’re looking for an engineer who will (i) help architect our platform for longevity and robustness, (ii) manage our other engineers as we implement features, and (iii) bring fresh eyes to any security vulnerabilities we should protect against.  Qualified candidates should have at least 5 years of experience managing, developing, and maintaining platform development. Hardware experience is a plus! A strong knowledge of relational databases, C, distributed networks, and security&#x2F;cryptography&#x2F;encryption.<p>Experience&#x2F;Education:<p>* BS degree in Computer Science or a similar technical field of study or equivalent practical experience<p>* 4+ years of software development experience<p>* Managing teams between 3-10 software engineers<p>* Background in health is a plus!<p>With deep expertise in at least 2 of the following:<p>* Distributed systems; networked systems<p>* Operating systems; kernel&#x2F;firmware<p>* Machine learning systems<p>* Security and&#x2F;or applied cryptography<p>* App&#x2F;dApp development<p>If you&#x27;re interested, send an email to &quot;careers [at] secureailabs [dot] com&quot; with &quot;HN&quot; somewhere in the subject.","time":1543865040,"type":"comment"}