{"by":"fkistner","id":18590247,"parent":18589702,"text":"JetBrains | Senior Software Engineer | Munich, Germany | ONSITE | <a href=\"https:&#x2F;&#x2F;www.jetbrains.com&#x2F;objc&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jetbrains.com&#x2F;objc&#x2F;</a><p>Are you passionate about developer tools? Are you an excellent engineer looking for a new challenge?\nJoin us in building the best tools for developers!<p>We’re currently hiring a Senior Software Engineer for AppCode, our IDE for iOS and macOS development, supporting Swift, Objective-C, as well as C&#x2F;C++. Tasks at hand include: language support, problematic code highlighting, auto-completion, refactorings, and code-generation as well as debugging, testing, and tools integrations.<p>On top of challenging tasks, we offer a fully transparent development process: team members can take part in any task, always participate in feature discussions, and version planning. Listening to and openly communicating with users in forums, issue tracker, and during conferences is one of the most important parts of the JetBrains culture and vital for understanding our users’ needs.<p>AppCode is based on the IntelliJ platform. Most of the code is written in Java, some in Groovy, and an ever growing part in Kotlin; low-level libraries use C&#x2F;C++ (for instance, LLDB integration). All our code is stored in Git repositories, covered by automated tests, peer-reviewed, and extensively tested by QA.<p>To apply, and to learn more about what we offer as well as this and other positions, we invite you to visit <a href=\"https:&#x2F;&#x2F;www.jetbrains.com&#x2F;careers&#x2F;jobs&#x2F;?team=AppCode\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jetbrains.com&#x2F;careers&#x2F;jobs&#x2F;?team=AppCode</a><p>Please note that we cannot sponsor work permits at this time. We are also currently accepting applications for internship opportunities from students at German universities.<p>If you have any questions, please feel free to reach out: florian.kistner+hn@jetbrains.com","time":1543856024,"type":"comment"}