{"by":"jaz46","id":18594163,"parent":18589702,"text":"Pachyderm | Core Systems Engineer | San Francisco (or remote) | jobs.lever.co&#x2F;pachyderm&#x2F;<p>Love Docker, Golang, and distributed systems?<p>Pachyderm (github.com&#x2F;pachyderm&#x2F;pachyderm) is hiring distributed systems engineers to help us build out the core product -- a distributed version-controlled filesystem and data processing engine. You’ll be solving hard algorithmic and distributed systems problems every day and building a first-of-its-kind, containerized, data infrastructure platform.<p>While your primary focus will of course be building the core product, you’ll also have direct exposure to users and enterprise customers via our open source support channels.  At Pachyderm, OSS user and customer feedback is major driver of our product roadmap and we believe that everyone within the company should experience that first-hand.<p>Pachyderm is just 8 people right now, so you&#x27;d be getting in right at the ground floor and have an enormous impact on the success and direction of the company and product.<p>You can of course check out the product on GitHub (github.com&#x2F;pachyderm&#x2F;pachyderm) because it’s open-source. \nWe offer significant equity, full benefits, and all the usual startup perks.<p>This role is based in San Francisco, but remote is optional if you have significant work history of successful remote work. <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;pachyderm&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;pachyderm&#x2F;</a><p>Qualifications:<p>* 2+ years of experience working in distributed systems, data infrastructure, back-end systems or related development work.  <p>* Major contribution to prominent and related open-source projects are a plus or can be a replacement for work experience in some circumstances (e.g. You’ve been a student just finishing your degree) <p>* While it is a bonus, experience with Golang is not a strict requirement. Programming languages are tools in your tool belt and we’ve found that great engineers have no problem learning new tools.","time":1543879009,"type":"comment"}