{"by":"shadytrees","id":18590202,"parent":18589702,"text":"Originate | NYC, SF, LA | Senior Product Designer, Senior Engineer, Senior Product Manager | <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;originate\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;originate</a> | REMOTE | Salary ~120-150K<p>‌‌~<i>~ hope you are having a nice december‌ ‌~</i>~<p>Originate was founded in 2007 and we&#x27;re a concept-to-launch software consultancy. We partner with our clients to build products of all shapes and sizes. If you worked here, you would get to learn a lot of different tech stacks, how lots of different industries operate, and build a lot of cool products with cool people. We strongly believe in a healthy work-life balance, we have 20% time for engineers to work on their own projects, and we have a generous vacation policy. We are primarily looking to staff our NYC&#x2F;LA&#x2F;SF offices BUT we do also have remote positions -- we have a strong remote culture -- available so please reach out to us through Lever even if that is a concern for you.<p>Because we&#x27;re a consultancy we don&#x27;t have one fixed tech stack, but I can tell you about the projects I&#x27;ve worked on. It&#x27;s been a while but the most exotic stack I&#x27;ve worked on was Haskell with Servant, Warp, lenses, all that good stuff. We have several 20% projects using Rust, including one that lets you compose binaural, microtonal music &lt;<a href=\"https:&#x2F;&#x2F;github.com&#x2F;xasopheno&#x2F;WereSoCool&gt;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;xasopheno&#x2F;WereSoCool&gt;</a>. We, of course, build tons of React&#x2F;Redux apps for browsers; our favorite new thing in the NYC office is to use yarn workspaces so that the Node.js backend and the React frontend share the same Flow or TypeScript types between them. That way you never have to worry about the data on the wire being malformed. We&#x27;ve also been on more Go, Scala, and Swift&#x2F;iOS projects than you can shake a stick at.<p>Also, fun fact: One of the lesser-known perks of working at a (product-oriented) consultancy like ours is that you rarely have to deal with technical debt. You get to use modern tooling most of the time because you&#x27;re always starting a project from scratch. It&#x27;s great! Tooling-wise we&#x27;re big believers in continuous integration (usually CircleCI) and deployment (also usually CircleCI even though it&#x27;s not always great for that). We use GitHub for everything. Our devops team uses Terraform and AWS, very standard. No surprises! If you love working with top-of-the-line tools, you should check us out.<p>My personal email is hao.lian@originate.com if you want to reach out to me. You can just ask me Haskell questions! Doesn&#x27;t have to be about a job. I work in the NYC office on 10 Crosby St so if you are in NYC we should at the very least grab a coffee. Also I&#x27;m @hlian on GitHub if you want to peruse all my semi-abandoned personal projects :)","time":1543855712,"type":"comment"}