{"by":"scanr","id":18592933,"parent":18589702,"text":"Investec | Software Engineer | London, UK | Full Time | Onsite | <a href=\"https:&#x2F;&#x2F;investec.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;investec.co.uk</a><p>The team you&#x27;d be joining is a diverse 20-person team on a mission to create a unique business banking experience for UK&#x27;s underserved mid-sized companies. Our highly motivated (and empowered!) team is responsible for building a range of innovative products that solve our clients&#x27; problems and empowers them to reach their full growth potential. These new products will be integrated with the great relationships and client service for which Investec is known; forging a truly out of the ordinary ‘high-tech, high-touch&#x27; banking experience.<p>As a Fin-tech team, our way of working is hypothesis-driven, client-led and data-informed. Our super-creative engineering team plays an integral part in this process; understanding our clients&#x27; problems and building compelling solutions that meet their needs and exceed their expectations.<p>As an out of the ordinary bank, we have a family-oriented culture and we genuinely care about our people. We are working really hard to create a fun, collaborative and learning environment - so expect lots of team activities, as well as plenty of support for training, mentoring and coaching.<p>What you&#x27;ll be doing:<p>As well as lots of coding and problem-solving, you&#x27;ll be joining a fast-moving, creative and\ncross-functional team that includes product, design, engineering, and strategic&#x2F;commercial.<p>• Building awesome products that solve our clients&#x27; problems.<p>• Discussing and debating user feedback and data insights.<p>• Learning and working with new technologies: including, React, Typescript, C# .NET Core 2, AWS, Docker, Kubernetes.<p>• Learning and experimenting with new domains, new methodologies, the future of banking.<p>• Collaborating extensively with your colleagues. Mentoring. Being mentored. Pairing.<p>• As a small team, helping shape our environment. Bringing your own passions, ideas and fun to the team.<p>• Working closely with product and design to drive product delivery and client outcomes at speed.<p>Interested?  Email me personally at jamie.mccrindle@investec.co.uk for a chat.","time":1543870810,"type":"comment"}