{"by":"thomasgruner","id":18593951,"parent":18589702,"text":"Oracle Cloud Infrastructure | Seattle, WA | Console Software Engineer or UX Web Developer | Full Time | ONSITE<p>Oracle has been making a next generation cloud from scratch for the past few years. There is space for having a real impact with your work and this team is one of the best that I have ever worked with. There is a good culture in this team with work life balance and a lot of really skilled and dedicated individuals. I was honestly surprised at how good the culture is and encourage you to come and meet us in person.<p>While there are many places on the cloud to contribute, I will limit my explanation just to the team I am on. You will be building a platform for user interfaces. This includes things like a reusable React component library, a runtime for console plugins written in TypeScript, and testing and metrics platforms for service plugins. Our team is also building out the homepage for the cloud and starting out some new dashboards. Another branch of our team builds out all of the SDK&#x27;s. It&#x27;s a great time to join and shape what the future of Oracle Cloud Infrastructure will look like. Help keep our users in focus while delivering top notch technical solutions.<p>I&#x27;ll call out two tracks that we are currently interviewing for: \n1) Webdev - focused directly on the frontend and delivering features. Needs solid web experience and understanding of usability.\n2) Software Engineer - builds out backend services and frontend components. Needs full set of skills and experience.<p>To apply please PM me or email me at tom.gruner@oracle.com or go to this link <a href=\"https:&#x2F;&#x2F;oracle.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobsearch.ftl?lang=en&amp;keyword=JoinOCI-UDX\" rel=\"nofollow\">https:&#x2F;&#x2F;oracle.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobsearch.ftl?lang=...</a><p>Keywords: React, Redux, Frontend, Javascript, TypeScript, User Experience<p>Want to know more about other areas of OCI that are hiring besides UDX? Check out this link:\n<a href=\"https:&#x2F;&#x2F;www.oracle.com&#x2F;corporate&#x2F;careers&#x2F;oracle-cloud-infrastructure.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.oracle.com&#x2F;corporate&#x2F;careers&#x2F;oracle-cloud-infras...</a>","time":1543877479,"type":"comment"}