{"by":"lylo","id":18593788,"kids":[18594632],"parent":18589702,"text":"FreeAgent, Edinburgh and REMOTE<p><a href=\"https:&#x2F;&#x2F;www.freeagent.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.freeagent.com</a><p>At FreeAgent we help freelancers and small businesses be more successful by putting them in control of their company finances.<p>We have built a multi-award-winning accounting app that offers full end-to-end compliance, from time tracking to tax return filing. We&#x27;re based in beautiful Edinburgh and we&#x27;re growing from strength to strength with over 70,000 paying customers and strong YoY growth. Our NPS is amazing (68!) - customers love what we do and our team get to make a real impact.<p>We&#x27;re an inclusive, diverse and growing team of over 160 people. The majority of our team are based in Edinburgh, but we have staff distributed across the UK (50% of our engineering team are distributed). We&#x27;re going through a growth spurt so if you want to help us make small businesses awesome at doing their finances, take a look at our vacancies (more details here -&gt; <a href=\"https:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;careers</a>):<p>* Product engineers, intern&#x2F;graduate&#x2F;mid&#x2F;senior&#x2F;principal - you&#x27;ll be working predominantly with Ruby on Rails but you don&#x27;t need to have commercial experience - we&#x27;ll get you up to speed.<p>* Platform engineers, mid&#x2F;senior&#x2F;principal - opportunities to work on large-scale refactorings, developer tooling, cloud migration (AWS specifically)<p>* Engineering managers, team leads, architects<p>You can apply directly via the website but feel free to get in touch with me directly (olly [at] freeagent [dot] com) if you have any questions. Happy to chat!<p>(We are looking for <i></i>UK-based<i></i> full-time staff only right now, or people who want to relocate to the UK of course!)","time":1543876023,"type":"comment"}