{"by":"heydenberk","id":18592020,"parent":18589702,"text":"QuotaPath | Backend or Full-stack Engineer | Philadelphia, PA or Austin, TX | Full-Time | On-Site | <a href=\"https:&#x2F;&#x2F;www.quotapath.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quotapath.com&#x2F;careers&#x2F;</a> Sales compensation plans can be shockingly complex. Too often, salespeople are forced to use unfriendly accounting software from the web 1.0 era, or worse, to pass around Excel spreadsheets, without the ability to verify the calculations or understand how they work.\nAt QuotaPath, we&#x27;re solving this problem in a new way. We&#x27;re creating a platform that&#x27;s built for salespeople, not accountants. This means our business model is unique, both consumer-facing and B2B (&quot;B2BC&quot;; think Slack). Good UX and beautiful design are at the core of our process. The demand for a product like this is intense and we&#x27;re working as hard as we can to deliver features to eager users.<p>We&#x27;re looking for engineers to help us accelerate our development as a product and as a company. If you&#x27;re interested in having a huge impact on a small team, this is a great opportunity. We&#x27;re well-funded, but we&#x27;re still only 8 people: 3 engineers, 1 UX and 4 others in product and executive team. I&#x27;m one of those 3 engineers, and I&#x27;m also the technical co-founder. Please ask me questions if you have any!<p>Our stack is Python + Django on the backend, TypeScript + React on the frontend, but we&#x27;re more interested in working with people who are smart and capable than people from any particular background. If you have strong opinions about using different tech, we&#x27;ll hear you. Like most startups, we&#x27;re built on lots of open source tech and we plan on giving back. We value building a culture of inclusion and transparency. We care about diversity and hope you do too.<p>Feel free to reach out to me directly: eric at quotapath dot com<p>(Please forgive if this is a repost! My original post seems to have disappeared)","time":1543865048,"type":"comment"}