{"by":"swong","id":18592554,"parent":18589702,"text":"DistroScale | Software Engineer, Video &amp; Software Engineer, Big Data | San Bruno, CA | ONSITE | <a href=\"http:&#x2F;&#x2F;www.distroscale.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.distroscale.com</a> DistroScale, Inc. is a fast-growing startup powering video experiences everywhere, wherever consumers are consuming video. We help create engaging video experiences &amp; content reaching hundreds of millions consumers every month.<p>## Software Engineer, Web&#x2F;Video<p>As a video player developer, you will be building high performance video players that work across different browsers and devices (desktop, mobile web, iOS, Android, OTT, etc.); fine-tuning the best presentation to its perfection; enable best interaction for end users; build intelligent content delivery incorporating optimal advertising and revenue solutions; working with business&#x2F;product teams to incorporate customer feedback; and more.<p>Description: <a href=\"https:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;software-engineer-video-2-years-experience-a976ec1186517a4d\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;software-engineer-video-2-years-e...</a><p>## Software Engineer, Mobile &amp; OTT<p>As a mobile video developer, you will be building high performance video players that work across different browsers and devices (iOS, Android, FireTV, Roku, tvOS, etc.); fine-tuning the best presentation to its perfection; enable best interaction for end users; build intelligent content delivery incorporating optimal advertising and revenue solutions; working with business&#x2F;product teams to incorporate customer feedback; and more.<p>Description: <a href=\"https:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;software-engineer-video-2-years-experience-a976ec1186517a4d\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;software-engineer-video-2-years-e...</a><p>## Software Engineer, Big Data<p>As a backend developer, you will be building a highly scalable, high-availability, and high performance service platform. Build efficient data processing pipelines to deliver real-time feedback to various components throughout production systems.<p>Description: <a href=\"https:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;big-data-developer-2-years-experience-b9ff280983cf0250\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;big-data-developer-2-years-experi...</a><p>Well funded, Profitable + Full healthcare + Catered lunches&#x2F;drinks&#x2F;snacks + Great team environment<p>Send your resumes to: jobs@distroscale.com","time":1543868710,"type":"comment"}