{"by":"mynock","id":18592612,"parent":18589702,"text":"BetterUp | Software Engineer (Full-Stack, Front-End, Machine Learning) | Remote | Full-time | <a href=\"https:&#x2F;&#x2F;www.betterup.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterup.co&#x2F;</a><p>BetterUp is a coaching platform that brings personalized professional coaching to employees at all levels. We help managers lead better, teams perform better, and employees thrive personally and inspire professionally. Our mission is to help people everywhere pursue their lives with greater clarity, purpose, and passion, so our product was developed by a team of leading behavioral scientists, researchers, and technologists. We&#x27;re already transforming the way companies approach talent development at high-performing organizations like LinkedIn, Salesforce, Capital One, Deloitte, and Logitech among many others.<p>We are an agile development shop that lives and breathes lean startup principles, continuous deployment, and have built culture of engineering quality where each team member is empowered to have an impact on our mission of building a platform for transformational behavior change. Our stack is primarily Ruby on Rails, Ember.js, Gitflow, AWS, and Docker and our principles and practices include:<p><pre><code>  - Comprehensive test coverage (&gt; 95%)\n  - Maintaining up to date dependencies (minor dependencies upgraded within 1 week of release, major dependencies 1 month)\n  - Continuous Deployment (ship early, ship often)\n  - Performance as a feature (&lt; 250ms 95th percentile API response time)\n  - &quot;Just in time&quot; Architecture (invest in architecture in lockstep with product initiatives)\n</code></pre>\nWe provide amazing benefits (unlimited vacation, volunteer days), but if you ask the team they’ll tell you that the greatest benefit we offer employees is an incredibly meaningful mission and transformative work.\nView all roles and apply here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;betterup\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;betterup</a>","time":1543869044,"type":"comment"}