{"by":"bwreilly","id":18592180,"kids":[18593583,18592694],"parent":18589702,"text":"DroneSeed | Seattle | Multiple Positions | Full-time | ONSITE, REMOTE<p>We at DroneSeed are working to address climate change by making reforestation scalable with drone swarms - surveying, planting trees, and spraying to protect them. We’re Techstars ‘16 alum, VC backed, and working with 3 of the 5 largest timber companies in the US.<p>We are looking for hardware and software engineers that are deeply dedicated to our mission and capable of supporting our operations crews by designing, building, and maintaining state-of-the-art equipment, aircraft, and applications.<p>If you are someone with an engineering background and a bunch of hobby projects cluttering your home, drop us a line! We are especially interested in individuals with hands-on experience with unmanned aircraft, robotics, airspace management, remote sensing, and rapid prototyping.<p>Our hiring process involves reviewing work you have done, reviewing our stuff, and pairing up on a practical task. We want creative, thoughtful, empathetic people with serious grit to join a team dedicated to inclusivity and an important mission.<p>HW Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;452504-hardware-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;452504-hardware-engineer</a><p>SW Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;308041-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;droneseed&#x2F;jobs&#x2F;308041-software-engineer</a><p>Some media: <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2018&#x2F;11&#x2F;26&#x2F;that-night-a-forest-flew-droneseed-is-planting-trees-from-the-air&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2018&#x2F;11&#x2F;26&#x2F;that-night-a-forest-flew-d...</a><p>Our site: <a href=\"https:&#x2F;&#x2F;www.droneseed.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.droneseed.com</a>","time":1543866147,"type":"comment"}