{"by":"ztorkelson","id":18592320,"parent":18589702,"text":"Clover | Sunnyvale, CA | ONSITE | Full-Time | Senior, Distributed Systems | USD $180k+<p><i>Who we are</i><p>We’re a small team of experienced software engineers tasked with ensuring that Clover’s rapid growth is sustainable over the long term. We solve for cross-cutting non-functional requirements like the security, scalability, and fault tolerance of Clover’s back-end platform and services. We design and develop the core architectural components, libraries, frameworks, tooling, and distributed systems at the heart of Clover’s global payment platform and services.<p><i>What we&#x27;re doing</i><p>We recently completed a project to horizontally shard our transactional (payment) database cluster, which had grown to 10+ TB in size. Now we’re building a fully autonomous service for rebalancing merchant data across the shards to distribute load and eliminate hot spots.<p>We recently completed a project to lift-and-shift our production infrastructure from private data centers to public cloud in order to streamline our global expansion. Now we’re revisiting our architecture, processes, and tooling in order to more fully leverage the cloud environment.<p>We are actively working on the design, development, and deployment of data pipeline infrastructure to support richer analytics and reporting for our merchants and internal business needs. Our focus is on its security, scalability, reliability, and performance.<p>We are paving the road towards a decomposed architecture of horizontal core services (like authentication, authorization, placement, tokenization, and inter-device replication) and vertical product services (like device management, merchant boarding, inventory propagation, and customer loyalty programs).<p>We already have a healthy suite of functional unit and integration tests, and we are actively enhancing our automated stress tests and supporting infrastructure. That involves building the tools to spin up full production-scale environments, synthesize load, perform fault injection, and to collect, analyze, and surface test results in order to help drive continual improvement of performance and availability.<p><i>What we use</i><p><pre><code>  - Java for back-end services.\n  - Python for integration and stress tests.\n  - MySQL for OLTP. Snowflake for OLAP.\n  - Kafka for stream processing.\n  - Memcached for caching (duh).\n  - Wavefront and ELK for operational visibility.\n  - Redis for ephemeral shared data structures.\n  - Google (GCP) as our cloud service provider.\n  - Docker for building containers. Kubernetes for running them.\n  - Netty for speaking HTTP, behind HAProxy for load balancing.\n</code></pre>\nThis is the Clover of today. Come help shape the Clover of tomorrow.<p>Contact: zac at clover dot com (please mention you saw this in HN)","time":1543867031,"type":"comment"}