{"by":"samcheng","id":18590694,"kids":[18636912],"parent":18589702,"text":"RINSE | San Francisco, Los Angeles, Washington DC, Chicago, Boston | Full-Time, Onsite<p>Lead&#x2F;Senior Engineer - Software Engineer - Software Intern<p>Rinse provides technology-enabled dry cleaning and laundry delivery services in five cities now, and we&#x27;re growing rapidly!<p>We&#x27;re hiring a Lead or Senior Software Engineer at our San Francisco office. This individual will lead our back-end engineering, including designing, building, and maintaining scalable logistics systems, leading and mentoring a team of engineers, advancing our software engineering culture, and liaising with other senior technical and non-technical staff.<p>This is a great opportunity for someone interested in the delivery &#x2F; logistics sector, or who grew up in dry cleaning, or who is looking to build consumer-facing products supported by a significant marketing budget.  It&#x27;s also an opportunity to do some management, while remaining technical.<p><a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;senior-software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;senior-software-engineer&#x2F;</a><p>We&#x27;re also hiring other software engineers of all experience levels, and have begun hiring individuals into our satellite offices. We have great offices in Los Angeles and Chicago, into which we would be happy to hire members of our already-distributed team.<p>We have a few seats for new graduates and interns as well.<p><a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;software-engineer&#x2F;</a><p>See <a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;</a> for a full list of openings.<p>Please apply!<p>Interested? Email jobs at rinse dot com, or contact me directly at sam at rinse dot com","time":1543858259,"type":"comment"}