{"by":"dakin","dead":true,"id":18593662,"parent":18589702,"text":"Nuro | Software Engineers | Mountain View CA | ONSITE | www.nuro.ai<p>About The Role:  \nOur software team is growing and we are looking for talented engineers to join us and contribute to 1 or more of the following areas: machine learning infrastructure, 3D modeling, simulation, firmware development, imaging data pipelines. We are hiring at all different levels for this team.<p>About The Work:\nDepending on your skillset and areas of interest you will work on some or all of the following:\nEngineer large-scale systems using big data and other techniques from the fields of Computer Science and Robotics including large-scale distributed systems and data processing systems\nRender large amount of data and perform tasks associated with the rendering process including projection, reconstruction, filtering, and estimation using advanced mathematics and computer science techniques\nResearch and develop advanced algorithms to get real-time performance\nOne or more of the following: Prototype&#x2F;develop advanced algorithms using Python and implement algorithms using C++ utilizing libraries such as OpenCV, OpenGL, and using CUDA to interface with the GPU; multithreading programming; programming with x86 architecture\nIdentify, troubleshoot, and resolve bugs and issues with software programming code that arise during field testing and provide ongoing Quality Assurance testing, software performance tuning and optimization\nCollaborate with engineering and product teams to understand customer needs, implement solutions, and deliver compelling robotic products<p>About You: \nYou have experience in one or more of the following areas: large-scale distributed systems; data storage and processing systems; advanced algorithms using C++ and Python; machine learning infrastructure, multithreading; x86 architecture; and software performance tuning and optimization, robotics software frameworks, different compute modalities (CPU, GPU, FPGA) etc.\nYou have strong problem solving and programming skills with advanced C++ skills.\nYou are passionate about accelerating the benefits of robotics for everyday life.\nWho We Are:\nNuro is a robotics start-up whose mission is to accelerate the benefits of robotics for everyday life. We have a best-in-class team of entrepreneurs and engineers, designers, and scientists who pioneer technologies that benefit everyone. We believe AI and robotics will be at the cusp of transforming daily life and we are dedicated to building these meaningful products. Join us on our mission, as you&#x27;ll play a significant role in our development and impact on everyday lives.","time":1543875072,"type":"comment"}