{"by":"ims","id":18596269,"parent":18589702,"text":"DrivenData Labs | Software Engineer (Python) With Focus On Data Applications | Berkeley, CA | FULL-TIME, ONSITE | <a href=\"http:&#x2F;&#x2F;drivendata.co\" rel=\"nofollow\">http:&#x2F;&#x2F;drivendata.co</a><p>-- OVERVIEW --<p>DrivenData brings the transformative power of data science to organizations tackling the world&#x27;s biggest challenges. We run online machine learning challenges with social impact, and we work directly with mission-driven organizations to drive change through machine intelligence and analytics.<p>We are looking for a talented software engineer who is interested in using their job to take on tough social challenges, while growing their data acumen and building real-world applications. As a core member of a small team your role will include managing code development, brainstorming approaches to engineering problems, working closely with data science and machine learning developers, and taking an open and constructive mindset to getting things done across multiple projects. You&#x27;ll work directly with data scientists that started their careers as software engineers, bringing an experienced understanding of software processes alongside opportunities to learn new quant skills, tools, and ways of approaching data applications.<p>-- ROLE --<p>This is a software developer role ideal for a Python engineer with 3-5 years of professional experience who is interested in data (possibly looking to transition into data engineering or data science). Advanced proficiency in Python and comfort with Linux a necessity. Good opportunity to learn the quant skills necessary to work in the data space. No need to have a background in math or a CS degree, but the job will involve a lot of quantitative thinking so the applicant should not be afraid of math.<p>Working on a small team means doing a little bit of a lot of things. We&#x27;re looking for somebody who can ask the right questions to figure out what is important, iterate between brainstorming together and working independently, and exercise sound engineering judgment to make reasonable decisions under conditions of ambiguity.<p>Doing client-facing work involves turning uncertainty into a reasonable path forward. As a team, we value arguments for how to proceed based on evidence, and we want somebody who will present their opinion and engage in a discussion around the best way forward.<p>Here are some of the things you&#x27;d be doing on an ordinary day:<p>- Internal software development: Maintain our Django codebase for drivendata.org, fix bugs, add features, safely refactor and maintain test coverage. Develop new internal tooling and improve on existing apps.<p>- Client-facing software development. Build a variety of applications, generally small green-field proofs of concept. Quickly learn and adopt new technologies on demand based on client needs; a typical engagement may include at least one data technology we haven&#x27;t all worked with before (e.g. Elasticsearch, Apache Storm, Cassandra).<p>- Light DevOps Tasks<p>-- REQUIREMENTS --<p>Critical skills: Python (advanced), Linux (advanced), SQL (intermediate to advanced). Must be able to learn quickly by reading appropriate documentation in order to write clean, idiomatic code.<p>Nice to have: Experience using IaaS like Amazon AWS or PaaS like Heroku. Experience using Docker. Exposure to big data tools like Spark or Hadoop, or familiarity with the underlying ideas like MapReduce.<p>Apply directly here: <a href=\"https:&#x2F;&#x2F;drivendata-labs.workable.com&#x2F;jobs&#x2F;839418\" rel=\"nofollow\">https:&#x2F;&#x2F;drivendata-labs.workable.com&#x2F;jobs&#x2F;839418</a>","time":1543897708,"type":"comment"}