{"by":"ammmir","id":18591987,"parent":18589702,"text":"BusinessVPN | Elixir and Go Engineers | Anywhere, REMOTE | FULL-TIME | <a href=\"https:&#x2F;&#x2F;www.businessvpn.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.businessvpn.com</a><p>BusinessVPN is building the next-generation secure network for SMBs that want the ease-of-use of a consumer VPN, but need centralized management, powerful web filtering, and end-to-end encrypted audit logging.<p>We are growing the team and adding a Golang engineer to work on our custom VPN framework for the server and cross-platform clients, as well as an Elixir engineer to work on our Phoenix web app and control plane API. This is an exciting opportunity to be a part of a new B2B SaaS offering and to directly influence the product. The work is challenging, but fun and varied: cross-platform considerations, user management, SSO, payment API, end-to-end secrets&#x2F;key management, device management, application delivery, to name a few!<p>Requirements (Go):<p><pre><code>  * Cross-platform Go development experience (macOS, Windows, Linux)\n  * Familiar with network protocol design, C10K problem, and Go garbage collector highly desired\n  * Secure systems design experience is a nice to have (cryptography, AWS KMS, Secrets Manager, etc.)\n  * Experience containerizing applications using Docker (e.g., Kubernetes concepts desired!)\n</code></pre>\nRequirements (Elixir):<p><pre><code>  * Proficiency with Elixir, Phoenix, and Ecto frameworks\n  * Experience running an Elixir application in production\n  * Solid HTML, CSS, and JavaScript skills\n  * Experience with Distillery, Erlang&#x2F;OTP concepts, and AWS a huge plus!\n</code></pre>\nCompensation Salary DOE | Health&#x2F;Dental&#x2F;Vision paid 100% for U.S. Employees | Flexible Vacation Time | Employer paid STD, LTD, and Life&#x2F;AD&amp;D | Additional perks if on-site in Denver, CO office, such as lunch&#x2F;snack and transportation benefits<p>Please email jobs@businessvpn.com with &quot;BusinessVPN Application&quot; in the subject line and include your current resume, links to shipping apps or code you are most proud of. Thanks for looking and best of luck!","time":1543864915,"type":"comment"}