{"by":"jbergknoff","id":18591552,"parent":18589702,"text":"Rival | Multiple roles | Los Angeles | Remote | Full-time | <a href=\"https:&#x2F;&#x2F;rival.co\" rel=\"nofollow\">https:&#x2F;&#x2F;rival.co</a><p>Rival is building the operating system for the world&#x27;s biggest venues. Ticketing is just one aspect of our platform, and by managing the inventory and truly digitizing the ticket by linking access to biometrics, we will be able to drive commerce, intelligence about fans, and enhanced security.<p>We have extraordinary engineers, PMs, and designers from the best technology companies in the world, who are working together to solve the many challenges of bringing millions of fans together for the music and sports events that they love. With investment from Andreessen, Upfront, sports teams from every major league in the US, and the leaders of Instagram, Twitter, Slack, and Stripe, we have the financial runway to build this platform the right way, from the ground up. We have revenue on the horizon and our first clients will be going live next year.<p>Our stack is mostly Python 3 and ES6+&#x2F;TypeScript&#x2F;React Native backed by AWS Lambda, Fargate, Kinesis, SQS, Aurora, and Dynamo. We&#x27;re heavy AWS users with all infrastructure managed by Terraform. Local development and CI use Docker extensively. We&#x27;re interested in engineers with expertise in these or similar technologies, or with background in distributed systems in general. We&#x27;re especially interested if you&#x27;re also passionate about building things, enjoy continuing to learn and grow, value open communication, and strong collaboration.<p>This is the opportunity you have been waiting for - hard engineering problems to solve; the conditions to move quickly and do your best work; to push yourself while having impact; to work with other exceptional people; and the chance to be a part of the early team that is building the technology platform that will change an industry.<p>Read more and apply via <a href=\"https:&#x2F;&#x2F;rival.co\" rel=\"nofollow\">https:&#x2F;&#x2F;rival.co</a>, or fast-track your application by completing the short CTF starting at <a href=\"https:&#x2F;&#x2F;hacker.rival.rocks\" rel=\"nofollow\">https:&#x2F;&#x2F;hacker.rival.rocks</a>.","time":1543862395,"type":"comment"}