{"by":"jayliew","id":18591614,"parent":18589702,"text":"TruePill (YC S17) | Software Engineer (Full-Stack Web &#x2F; Front-End &#x2F; Back-End ) | Full-Time | ONSITE | SF Bay Area<p>Hi! I&#x27;m one of the engineers on the team :)<p>TruePill is an API like Stripe, but for pharmacy.<p><a href=\"https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;yeGpu4Z\" rel=\"nofollow\">https:&#x2F;&#x2F;imgur.com&#x2F;a&#x2F;yeGpu4Z</a> (screenshots of our new web site b&#x2F;c current one is not an accurate representation)<p>If you&#x27;re interested in:<p>- Being an active participant in the decision-making process of a YC company rapidly capitalizing on an under-the-radar market opportunity<p>- Applying your technical skills to a meaningful domain outside of tech (while learning about industry insider nuances), that has real-world medical implications<p>- Being part of a small engineering team that not only measures daily active users but also physical products shipped, revenues, and real profits<p>- Being part of a small engineering team that ships not only software products but also physical products<p>- Watching how changes in your code physically impacts the operation of not just machines but the IRL work-flow of real people (specifically, pharmacists and technicians)<p>- Hands-on shipping of product and taking ownership, end-to-end! Everything from ideation --&gt; coding --&gt; customer delight (&amp; wash-rinse-repeat)<p>then I&#x27;d love to hear from you!<p>Our stack: React, Node, GraphQL (+ Apollo), ES6, Raspberry Pi, AWS (RDS, ECS, CloudFront, EC2), Elasticsearch, Jenkins, Rails, Python, Linux (Ubuntu), Docker, and moar.<p>We have deliberately avoided press coverage around our traction, investors, and market because we have been focused on taking over the market as quickly as possible, but we will doing a formal and proper launch with more details soon!<p>We&#x27;re in the pharmacy (not pharmaceutical) space and I&#x27;m happy to elaborate more in private for serious inquiries.<p>jay liew at jay liew dot com","time":1543862746,"type":"comment"}