{"by":"survios1","id":18593823,"parent":18589702,"text":"Survios | Full Stack Engineer | Culver City, CA | On Site <a href=\"https:&#x2F;&#x2F;www.survios.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.survios.com</a> | Full-Time |<p>Survios is at the forefront of VR game development and is pioneering the future of immersive technologies. Since inception, we have taken a holistic approach to virtual reality innovation, developing software, and games hand-in-hand to take VR to places that no one has dreamed possible.<p>Survios is constantly pushing the boundaries of VR, and we are looking for a Mid&#x2F;Senior Full Stack Engineer to architect and develop VR related products.<p>Responsibilities: Design and build scalable systems using industry best practices and process. Gather requirements to design and implement features and experiments. Participate in code and design reviews to maintain and ensure high quality coding standard and practices. Collaborate with your peers and cross-project teams such as Project Managers, UI&#x2F;UX designers, Graphic Designers, and QA. Participate in technical design discussions to assist with architecting new systems for features.<p>Requirements: 2+ years experience as a Full Stack Engineer. Extensive knowledge of JavaScript, HTML5 and CSS. Knowledge of client-side rendering libraries like Vue.js Strong back-end experience with MVC like frameworks such as Django or Ruby on Rails. Understanding of relational database systems and schema design. Understanding of fundamental design principles behind a scalable application. Experience with automated integration and unit testing with Jasmine, PhantomJS, or other related technologies. Excellent problem-solving and collaboration skills.<p>Pluses: Localization&#x2F;Internationalization Management of hosting environment, including database administration, scaling an application to support load changes, and continuous integration&#x2F;deployment. Experience with other languages such as Python, Go, C#. Experience with Twitter’s Bootstrap or Zurb’s Foundation. Extensive PostgreSQL experience. Extensive AWS experience. Strong understanding of version control systems such as Perforce, Git, and&#x2F;or Subversion.<p>You can apply directly via the website but feel free to get in touch with me directly (drew [dot] greeley [at] survios [dot] com) if you have any questions. Happy to chat!","time":1543876370,"type":"comment"}