{"by":"LucianoTray","id":18602114,"parent":18589702,"text":"Tray.io | London | Front&#x2F;Back&#x2F;Fullstack Engineers | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;tray.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tray.io&#x2F;</a><p>Tray.io is ushering in the era of the automated organisation We believe that any organisation can and should automate. With Tray.io, citizen automators throughout organisations can easily automate complex processes through a powerful, flexible platform, and can connect their entire cloud stack thanks to APIs. Today businesses like IBM, GitHub, Forbes, Lyft, and Digital Ocean rely on Tray.io to connect and automate data flow between the tools they use every day. With Tray.io visual workflow builder our customers create automations to drive their business processes without writing a single line of code. Our challenge is to build a cutting-edge product that is powerful and complete while also being beautiful and easy to use.<p>You&#x27;ll contribute directly to this mission with a team that fully supports you to do your best work. You&#x27;ll join humble but fiercely ambitious people like yourself, who also take great pride in what they do, working in a culture built on friendship, transparency, and above all, looking out for one another. You&#x27;ll have endless opportunities to learn and grow professionally in a fun, fast-paced, and open environment. Plus, you&#x27;ll get to make your mark at a rapidly-growing company positioned to completely reinvent a multibillion-dollar industry.<p>We&#x27;re looking for engineers (junior and senior) for all our teams Back End, Systems Engineers, Front End and QA.<p>Our current tech stack: Scala, Go, JavaScript, TypeScript PostgreSQL, Redis, ElasticSearch, Cassandra, AWS SQS, AWS Kinesis Docker, Terraform, AWS Lambda, Serverless Framework Jenkins, Grafana, Prometheus AWS &amp; Linux<p>If you can&#x27;t find a suitable job but you are curious about Tray and want to join a top team, please have a look at our careers page: <a href=\"https:&#x2F;&#x2F;tray.io&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;tray.io&#x2F;jobs</a>","time":1543947742,"type":"comment"}