{"by":"blynch_rv","id":18600630,"parent":18589702,"text":"Red Ventures | Front End Developer | Charlotte, NC &amp; Austin, TX | Onsite<p>Red Ventures is a leading digital consumer choice platform. Through deeply integrated brand partnerships and consumer-facing assets, Red Ventures connects online customers with products and services in the home services, financial services, and healthcare industries. We use advanced analytics, data science, and integrated technology to cultivate and customize digital connections between brands and customers. We marry the speed of a start-up, the DNA of a digital agency, the strategic thinking of a consultancy, and the analytical skills of a big data company. Red Ventures is headquartered in Charlotte, NC and has more than 3,500 employees in offices across the US as well as in Brazil and London.<p>We don’t do things because “that’s the way we’ve always done it.” We evaluate every process and fix what doesn’t work. We solve business problems because we are a culture of Doers. We care less about roles and more about solutions that move us forward. You will have the opportunity to challenge yourself and grow.<p>Red Ventures is looking for a passionate Front End Developer with the skills and the drive to build and maintain digital experiences for some of the country’s biggest brands. You’ll work with top talent including writers, analysts, designers and other developers in a fun, fast-paced environment at our headquarters right outside of Charlotte, NC or our Austin, TX location (relocation assistance provided). Each day, you&#x27;ll create, code and optimize websites and user experiences in a workplace where you can see the impact of your ideas.<p>Apply for Charlotte here: <a href=\"https:&#x2F;&#x2F;www.redventures.com&#x2F;careers&#x2F;position&#x2F;976732?gh_jid=976732\" rel=\"nofollow\">https:&#x2F;&#x2F;www.redventures.com&#x2F;careers&#x2F;position&#x2F;976732?gh_jid=9...</a>\nApply for Austin here: <a href=\"https:&#x2F;&#x2F;www.redventures.com&#x2F;careers&#x2F;position&#x2F;1441204?gh_jid=1441204\" rel=\"nofollow\">https:&#x2F;&#x2F;www.redventures.com&#x2F;careers&#x2F;position&#x2F;1441204?gh_jid=...</a><p>Red Ventures | Software Engineer | Austin, TX | Onsite<p>Red Ventures is seeking a full stack Software Engineer to create and own cutting-edge web services for consumer-facing financial applications. We help people get the most out of their money through smart credit card recommendations.<p>We are looking for someone who loves turning complex data from multiple sources into streamlined user-friendly tools. This is a full-stack role implementing browser JS and integrating APIs on the back end from day to day.<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.redventures.com&#x2F;careers&#x2F;position&#x2F;1134553?gh_jid=1134553\" rel=\"nofollow\">https:&#x2F;&#x2F;www.redventures.com&#x2F;careers&#x2F;position&#x2F;1134553?gh_jid=...</a>","time":1543939550,"type":"comment"}