{"by":"cnbuff410","id":18604687,"parent":18589702,"text":"Stryd, Boulder, CO, Techstars Boulder 2015 | Android Developer and web developer (who loves running!!) <a href=\"http:&#x2F;&#x2F;www.stryd.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.stryd.com</a><p>Stryd is a talented, multidisciplinary team that is enthusiastic about creating the future of wearable technology for runners. Out of this passion, we’ve developed technology for runners that provides insight into their health, technique, and performance. By using Stryd, runners can train effectively, race strategically, and unleash their full potential.<p>We’re looking for developers who are passionate about creating great Android&#x2F;web applications and crafting efficient, high performance, and delightful user experiences. We welcome people of different backgrounds, experiences, abilities, and perspectives.<p>Our work environment is open, supportive, and fast-paced. There is tremendous room for growth. The Stryd team is full of triathletes, ultra runners, marathoners, track&#x2F;cross-country athletes and fitness joggers. As a runner, you will never feel alone working here.<p>Qualifications:<p>- Android Developer: <a href=\"https:&#x2F;&#x2F;www.stryd.com&#x2F;job&#x2F;android\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stryd.com&#x2F;job&#x2F;android</a>\n- Web Developer: <a href=\"https:&#x2F;&#x2F;www.stryd.com&#x2F;job&#x2F;web\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stryd.com&#x2F;job&#x2F;web</a><p>Perks:<p>- Flexible vacation vacation policy so you don’t ever need to worry about work&#x2F;race conflicts.<p>- Up to $500 of reimbursement for race entry fees each year.<p>- Health insurance.<p>Being able to relocate to Boulder is required. BTW, if you like running, Boulder is pretty much your dream place. You get tons of opportunities to run and train with LOTS of elite athletes who are Stryd ambassadors here.<p>Salary &amp; equity depends on experience.<p>If interested, please send an email to kun@stryd.com","time":1543968556,"type":"comment"}