{"by":"sdbrady","id":18602209,"parent":18589702,"text":"Fact Labs | Founding Engineer | San Francisco and New York (NYC) | Onsite or Remote (US only) | Full Time<p>Building models in spreadsheets is broken. Spreadsheet models break down when you alter them, modularize them, or add more collaborators. Analysts in banking, investment management, and operations have gotten by with spreadsheets but not without enormous time and effort spent hacking around their many limitations. Fact Labs has developed a more powerful, more collaborative modeling paradigm that is inspired by logic programming and applied ontology yet is still accessible to sophisticated but non-programmer analysts. We are a small, funded, early-stage team with significant domain experience with our target customers. The team previously worked together on a distributed search and data management startup and sold the company a few years back.<p>What we are looking for:<p>Fast, deliberate learners eager to translate concept into practice OR experienced hands ready to take significant design ownership<p>Strong computer science fundamentals, including algorithms and data structures<p>Experience with one of the following through professional, academic, or personal work:<p>- Database design and implementation (query processing&#x2F;planning, database&#x2F;storage engines)<p>- Language design and implementation (parser generators, interpreters, virtual machines, compilers)<p>- Logic programming (Prolog, Datalog, SAT&#x2F;SMT solvers, etc.)<p>- Optimization (constraint satisfaction, combinatorial optimization, linear programming, etc.)<p>Language experience: C &#x2F; Rust<p>Self-starting attitude with strong communication skills (especially written)<p>The modeling experience we’re building is unlike anything out there. If you believe that spreadsheets are not the last word in end-user programming, reach out to us (stephen [at] fac.tt) and tell us a little about yourself (bio, resume, or LinkedIn). We’d love to hear from you and show you what we’ve been up to!<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;fact-labs&#x2F;jobs&#x2F;404135-founding-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;fact-labs&#x2F;jobs&#x2F;404135-founding-software-eng...</a>","time":1543948206,"type":"comment"}