{"by":"susan_truss","id":18633789,"parent":18589702,"text":"Truss | Software Engineer, Infrastructure Engineer, Delivery Manager, Product Manager, User Experience Designer | San Francisco or REMOTE &#x2F; DISTRIBUTED| <a href=\"https:&#x2F;&#x2F;truss.works\" rel=\"nofollow\">https:&#x2F;&#x2F;truss.works</a><p>Particularly interested in Delivery Managers, Product Managers, and Web Engineers with Javascript w&#x2F;React, Go experience<p>Truss solves complex technical problems for the private sector and government. We helped rebuild Healthcare.gov after its public failure in 2013. We seek the highest standard both in terms of the technology we build, and the way we run our company. We&#x27;d love to chat with you.<p>We are a software consultancy known for pragmatism, autonomy, expertise, and trust. We build strong relationships with our clients, contractors, and employees and we believe that this is fundamental to doing great work. As a Truss engineer you will facilitate bringing Truss values (<a href=\"https:&#x2F;&#x2F;truss.works&#x2F;values&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;truss.works&#x2F;values&#x2F;</a>) to those truly trying to make a difference in our government, and enable them to understand what their citizens actually need rather than implementing a perceived solution.<p>Here are some of the things we care about:\n* Great communication! Including thoughtful listening skills, the ability to express complex ideas clearly and succinctly, and the ability to communicate well in writing\n* The ability to deal well with ambiguity and act with autonomy\n* Technology-agnostic and pragmatic engineering sensibility, focused on solving key problems for the customer, not the tools\n* Proficiency in at least one commonly used programming language, such as Python, Ruby, Go, Javascript, Java, etc.\n* Experience deploying at least one application that other people use\n* Have held at least one engineering position post-education\n* Initiative, curiosity, a bias for action, and a problem-solving attitude<p>We expect all Truss engineers to consistently develop new skills, and cross-train into new disciplines outside of their current areas of expertise.<p>Check us out at: <a href=\"https:&#x2F;&#x2F;truss.works&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;truss.works&#x2F;</a> and apply at: <a href=\"https:&#x2F;&#x2F;truss.works&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;truss.works&#x2F;jobs&#x2F;</a><p>Product Manager -&gt;\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;trussworks&#x2F;560abbb9-2239-478e-a91e-15bb251291af?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;trussworks&#x2F;560abbb9-2239-478e-a91e-15b...</a><p>Delivery Manager&#x2F;Project Manager, GovTech -&gt;\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;trussworks&#x2F;9a9d24e2-9438-4b45-8f06-c61472e54b79?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;trussworks&#x2F;9a9d24e2-9438-4b45-8f06-c61...</a><p>Sr. User Experience Designer -&gt;\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;trussworks&#x2F;e1d4a9a4-b879-47c2-a0fa-3ce1c96726ac?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;trussworks&#x2F;e1d4a9a4-b879-47c2-a0fa-3ce...</a>","time":1544240624,"type":"comment"}