{"by":"ydotan","id":18643224,"parent":18589702,"text":"Affluent | Data Engineer &#x2F; Technical Product Manager | Raleigh-Durham, NC | Full-Time, Onsite | <a href=\"https:&#x2F;&#x2F;www.affluent.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.affluent.io</a><p>Affluent is a digital marketing analytics startup. We are looking for our first full-time, non-founder hire - a data engineer to join our data &amp; integrations team. This is a full-time role for an early and pivotal position in a growing startup.<p>Role<p>• Build and lead the team responsible for mapping, developing, and maintaining new integrations with third party marketing platforms.<p>• Map data from multiple sources into a common data model and create product requirement documents for developers to build integrations.<p>• Design efficient data processes to handle data ingestion, cleansing, transformation, and validation.<p>• Manage the integrations developers who build connectors to each integration.<p>• Lead the development of an automated data accuracy verification engine.<p>Requirements<p>• Very strong math and&#x2F;or data analytics skills, relentless perfectionism, and a sharp eye for detail – the ability and drive to find the missing cent hiding in millions of dollars.<p>• A love for creating process and procedure with high levels of accuracy.<p>• Intermediate to advanced MySQL or other RDBMS programming skills.<p>• Experience working on analytics, data-driven workflow, or business intelligence components of applications and technologies<p>• Demonstrated experience working with large and complex data sets<p>• Working knowledge of APIs (REST, GraphQL, SOAP, etc)<p>• We do not require a degree for this or any other position. Degrees are fantastic but, if you’re a child-prodigy who built a SQL database when you were 12 to document your Pokémon collection, please apply. That said, degrees in Computer Science, Statistics, Analytics, Economics, or similar are all great.<p>For more details, contact yonatan@affluent.io","time":1544389105,"type":"comment"}