{"by":"Runtastic","id":18646545,"parent":18589702,"text":"DATA ARCHITECT (Location: Linz&#x2F;Austria) == ONSITE | VISA ==<p>RUNTASTIC<p>We believe in supporting people to improve their fitness and overall health. With more than 220 million downloads of our apps and 115 million registered users on Runtastic.com, we face unusual and fascinating challenges everyday.<p>YOUR MISSION<p>As part of our Data Engineering team you will be responsible for evolving our data platform and making use of the treasury of data. In this unique role you will be:<p>--Leading the design &amp; development of our data architecture and data pipelines<p>--Exploring future-proof solutions for our data platform in our fast-paced environment<p>--Developing and aligning our company-wide data platform strategy with all stakeholders and ensuring its execution<p>--Working closely together with our Data Engineers, Data Scientists, Infrastructure team, and various stakeholders from different departments<p>--Supporting and educating product development teams in all data-related aspects<p>--Evaluating the latest technological enhancements that fit our use cases<p>YOUR PROFILE<p>--3-5 years of experience in software engineering, ideally in data engineering<p>--Degree in Business Informatics, Computer Science, or a related field (university or higher technical institute)<p>--Advanced programming skills in at least one language (i.e. Python, Java, C#)<p>--Ability to convert complex business systems and requirements into technical concepts and solutions<p>--Preferably, professional experience using Hadoop, Spark, Flume, MS SQL Server, other databases<p>--Technology enthusiast and visionary with a strong proactive mindset<p>--Excellent English skills, German is a plus<p>Apply now: <a href=\"https:&#x2F;&#x2F;runtastic.jobbase.io&#x2F;job&#x2F;u0rczchf\" rel=\"nofollow\">https:&#x2F;&#x2F;runtastic.jobbase.io&#x2F;job&#x2F;u0rczchf</a><p>And here’s the fine print: The minimum salary is EUR 40,572 gross per year. But that is certainly the very least we can do for you. Your actual offer depends on your skill set and experience.","time":1544435185,"type":"comment"}