{"by":"w0utert","id":10153450,"parent":10152809,"text":"ASML Netherlands&#x2F;Brion Technologies | C++&#x2F;Java&#x2F;Python software engineer | Eindhoven, Netherlands | ONSITE | full time<p>ASML Netherlands is the leading provider of optical lithography systems for the semiconductor industry. Brion technologies is a subsidiary of ASML Netherlands, and develops simulation and modeling software for lithography production and metrology applications.<p>We are looking for a software developer who loves designing and writing C++, Python and Java software modules using a Linux&#x2F;Unix environment, solving challenging problems for lithographic simulation and application software in a small, collaborative and fast moving team.<p>Job Mission: \nDeliver high quality modular software components (in C++, Python and Java) to improve and integrate Brion products with ASML machine specific knowledge and systems.<p>Job Description: \nAll-round software engineer, capable of designing and delivering high quality, well tested software working in a distributed (Eindhoven&#x2F;US) based team-setting.<p>Education: \nBS or MS in Computer Science.<p>Experience: \n- Relevant C++ software development experience (3-5 years).\n- Experience using Unix as a development environment (3-5 years).\n- Experience with version control systems (Git) (3-5 years).\n- Multi-language experience (C++, Python, Java) is preferred (0-2 years).\n- Experience in designing and developing large, complex, multidisciplinary software systems is preferred.\n- Relevant software development experience in semi-conductor industry is a pre.<p>Since we operate as a small and dynamic team of people who all share a passion for our work, we are looking for someone like-minded, who doesn&#x27;t expect a hierarchical, top-down approach and is not afraid of challenging him&#x2F;herself or other team members. Experience is obviously a pre, but we think someone who likes to learn and improve will fit in better than someone who&#x27;s used to doing things the same way for a long time.<p>Contact:\ndl-brion-vhv@asml.com","time":1441124061,"type":"comment"}