{"by":"niclas_irmak","id":10153368,"kids":[10155318],"parent":10152809,"text":"Munich, Germany, VISA, ONSITE - Embedded Enthusiasts - E.S.R. Labs AG<p>We are a team of software developers brought together by our enthusiasm for creating the best possible embedded systems. We are full-stack developers working on real-time, connectivity, mobile, and back-end projects. Customers come to us for two main reasons: when they feel their project is &quot;impossible,&quot; and if they expect the highest level of quality and reliability in their software development. The result speaks for itself: today our software runs in millions of cars.<p>E.S.R. Labs is a company founded by software developers for software developers. Our goal is to create a work environment in which programmers can thrive. Working at E.S.R. Labs means you will experience a diverse set of projects, with the chance to work with a wide range of technologies and the freedom to explore new ways of doing things.<p>Currently we are looking for you in the role of a performance-driven Embedded Software Developer (f&#x2F;m), focus: Automotive.\nFor this role you can choose where to build your career with us in Germany: \nAt our exciting new offices in the Neue Balan “Campus of Ideas” in wonderful Munich, ranked as one of the world’s most liveable and interesting cities.\nOr you can join us at our smaller offices in beautiful Kulmbach.<p>What does your work life look like with us? \nAs Embedded Software Developer, you are involved with very demanding projects, sometimes teamed with other E.S.R. Labs employees, and usually in cooperation with leading automotive OEMs. You develop software which ensures network communication within control devices used in world-renowned vehicle brands (such as Volkswagen&#x2F;Audi or BMW). You are part of the entire process of development and you work with different Ethernet-based technologies.<p>If you are interested, feel free to send us your application to:\n<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;19cqJ5f\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;19cqJ5f</a>","time":1441123586,"type":"comment"}