{"by":"playgen_dev","id":10153760,"parent":10152809,"text":"PlayGen ltd. Shoreditch London, UK<p>We are currently looking to hire a Junior Software Developer and a Mid-Senior Software Developer for our office in Shoreditch London.<p>PlayGen develop playful solutions to engage, influence, measure and inspire.\nDo you like startups but are not sure about the risks associated? Join the most awesome digital R&amp;D studio working with games, gamification and simulations.\nExisting clients include global leaders in health, defense, education, finance and research institutions. Imagine being given the opportunity to work in a startup environment, but with the backing of a organisations like Unilever, Samsung, European Union, BBC, NHS, HSBC, McKinsey and many more.<p>Here is a little overview of what kind of person we&#x27;re looking for:<p>Desired Skills and Expertise<p>Essential :<p>- 4 years+ of development experience (for mid-senior role)<p>- If it’s Frontend you might like Javascript &#x2F; HTML5&#x2F; XSLT&#x2F; CSS – Backbone, Angular, WebGL, D3.Js<p>- If backend is your thing then you’ll have experience of Web or apps and know your way around one or more of these: Visual Studio, C#, Objective C or C++, PHP, Ruby, Python and some experience of SQL or NoSQL Databases<p>Of course you might like both :) but you would be well versed in OO and software architecture. - Naturally a desire to be a part of the next big thing and make some awesome interactivity stuff used by the world’s greatest is a super plus!<p>Highly desirable :<p>- True GEEK (i.e. you want to spend time with people who love making stuff)<p>- If focusing on backend then interest in machine learning, functional programming &amp; peer to peer<p>- Web services, APIs and Extensible architectures - Cloud based application development including Hadoop, Cassandra and elasticity<p>In order to apply please visit the following:<p>- <a href=\"http:&#x2F;&#x2F;playgen.com&#x2F;developer-job-london&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;playgen.com&#x2F;developer-job-london&#x2F;</a> for the mid-senior role<p>- <a href=\"http:&#x2F;&#x2F;playgen.com&#x2F;intern-developer-role&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;playgen.com&#x2F;intern-developer-role&#x2F;</a> for the junior role","time":1441126057,"type":"comment"}