{"by":"kcrossisec","id":10152994,"parent":10152809,"text":"NCC Group (formerly Matasano Security, iSEC Partners, and Intrepidus Group) - Austin, Chicago, New York, San Francisco, Seattle, and Sunnyvale, CA<p>Ah, Autumn is just around the corner. Soon the leaves will start to fall and we’ll forget all about the summer months we longed for all Winter, yet complained about the whole time we were sweating in them. Kids will be headed back to school with cartoons on their lunchboxes you no longer recognize, which is slightly disconcerting. It’s a time for change. Why not consider a career change?<p>NCC Group is constantly hiring security consultants from ALL backgrounds to join our team. If you’re a tinkerer, a breaker rather than a builder, or someone who wonders “why” and ends up down the rabbit hole 36 hours later with a disassembled air conditioning unit surrounding them... we’d love to hear from you! Our process welcomes those with years of experience, as well as those with little to no direct experience in what we do.<p>The bottom line: if you love security and research, NCC Group just may be a perfect fit for you.<p>What do we do exactly? Penetration testing, security analysis, and cutting-edge research into current technologies and attacks (breaking things). You spend most of your day thinking about security systems and how they can break. You get to be creative and have a lot of freedom to be clever while learning new technologies at a very fast pace. Engagements are usually 2-4 weeks long and in a year you will be exposed to 15-20 products and technology stacks. Your work will typically initiate person-months of security improvements in products millions of people use. You will have access to senior engineers&#x2F;architects and your findings&#x2F;ideas will be heard by senior decision makers. You will have enormous impact in making the software people use safer. All of our consultants are also security researchers, with dedicated research time. Not too shabby!<p>If you want to learn more about us check out our:<p>Blog - <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;</a>\nCryptopals - <a href=\"http:&#x2F;&#x2F;cryptopals.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com&#x2F;</a>\nMicrocorruption - <a href=\"http:&#x2F;&#x2F;microcorruption.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;microcorruption.com&#x2F;</a><p>If you&#x27;re ready to apply, contact us at: <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;careers&#x2F;</a>. We&#x27;d love to hear from you!","time":1441121252,"type":"comment"}