{"by":"mattcaldwell","id":10153093,"parent":10152809,"text":"Endgame | Arlington, VA | Senior Front End Engineer | <a href=\"http:&#x2F;&#x2F;jobvite.com&#x2F;m?36gZyhwF\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?36gZyhwF</a><p>You will be working on one of Endgame&#x27;s Cyber focused analysis application that provides visualization of worldwide network scans and web crawls for comprehensive cyber analysis and situational awareness. Join Endgame&#x27;s fast-paced, agile development environment in helping us to create new software components for game changing data and security products.<p>Endgame is hiring a Senior Front end Engineer who loves working across the full spectrum of web technologies and gets excited about developing cutting edge commercial and federal cyber security solutions. If you are looking to work in a fast-paced, agile development environment creating new software components for game-changing data and security products, we would happily welcome you. Although we would prefer that you work in our Arlington, VA office there is tremendous flexibility.<p>You will fit our team workflow if…<p>You like Git for version control and following GitHub Flow.\nYou like the practice of Continuous Integration and aspire to practice Continuous Deployment.\nYou write automated tests by either following Test Driven Development (TDD), or at least ensuring there are tests in each of your Pull Requests.\nYou are familiar with Agile&#x2F;Scrum and you like or are open to trying these approaches.\nYou like trying out emerging technologies and fail fast when they don’t work out.\nYou will like working with our technology stack if…<p>You have used JavaScript testing frameworks such as Karma, Mocha or Jasmine, Sinon, and Chai.\nYou have experience using single page application web frameworks. We use React currently. Experience with other SPA frameworks (Angular, Backbone.js, ember.js, Knockout etc) is helpful so long as you are willing to use react\nYou have knowledge of HTTP and know how to interact with RESTful APIs.\nYou have experience using package management solutions like NPM and Bower.\nYou like using build tools such as Gulp or Grunt.\nYou have used SASS (alternatively LESS) for CSS pre-processing.\nAlways a plus:<p>Familiarity with network protocols\nGeospatial and mapping technologies (e.g., PostGIS, OpenLayers, Leaflet)\nCyber security background\nFamiliarity with network visualization libraries (e.g. Keylines)\nExperience working in a distributed office environment","time":1441121870,"type":"comment"}