{"by":"ladon86","id":10153072,"parent":10152809,"text":"ClassDojo | San Francisco, CA<p>------------------------------<p>We&#x27;re an education technology product that&#x27;s used in 50% of US schools daily. Check us out here: <a href=\"https:&#x2F;&#x2F;www.classdojo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.classdojo.com</a><p>We&#x27;re a team of 24 people, which is very small for the number of teachers, parents and students we serve every day. We also have a lot of face-to-face contact with our users. Me and two other engineers are just about to head out on a school visit to see our product out in the wild.<p>We&#x27;re currently in our crazy &#x27;back-to-school&#x27; season, which means we&#x27;re adding several hundred thousand new users every day, and that&#x27;s probably why we&#x27;re looking for a senior full-stack engineer! We work in a really collaborative environment, and being actively thoughtful about culture is important to us, so that would be a big part of your job. You know how you&#x27;ve had previous jobs and there&#x27;s always something about them that sucks? We try to continuously improve our processes and culture until they really don&#x27;t suck. Of course you&#x27;ll write code and be involved in the design and implementation of all our backend systems, but also we hope you&#x27;ll join us in building the kind of engineering team you&#x27;ve always dreamed of.<p>Finally, if you&#x27;re interested in having a real impact on public education, I truly believe that this is the place. While we started by solving a small classroom problem for teachers, the impact we are starting to have on student outcomes with our new products is incredible, and fascinating to be involved in.<p>Interested? Apply here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;classdojo&#x2F;e55a2293-c8b3-4f92-b90e-b39a808e82d8\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;classdojo&#x2F;e55a2293-c8b3-4f92-b90e-b39a...</a><p>Or if you want to ask any questions, feel free to drop me a personal email on: liam@classdojo.com","time":1441121753,"type":"comment"}