{"by":"edwhitesell","id":10154630,"parent":10152809,"text":"GoZone WiFi • Dallas, TX (90% work from home) • <a href=\"http:&#x2F;&#x2F;www.GoZoneWiFi.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.GoZoneWiFi.com</a><p>Client Support Specialist:\nWe are looking for a qualified and dynamic new team member to enable our customers to transform their WiFi into Smart WiFi™. You&#x27;ll be working with clients and partners all over the world to ensure they are getting all they can out of our platform. All from the comfort of your own home! One day you may be helping someone in Spain plug in a controller, the next day you may be helping someone around the corner format an HTML email template to be integrated into Mailchimp.<p>This is not simply an &quot;answer the phone and follow a script&quot; position. You&#x27;ll have lots of opportunity to step outside the box and learn new things, all while helping to build a successful company.<p>Required Skills:\n- 2+ years in Technical Customer Support\n- Familiarity with basic LAN technologies&#x2F;protocols (i.e. OSI Model, IP Addressing, DHCP &amp; DNS)\n- EXCELLENT verbal and written communication skills\n- Basic understanding of HTTP and web browsers\n- Technical troubleshooting skills<p>Bonus Skills:\n- Web programming (i.e. HTML, Javascript, PHP &amp; others)\n- Basic Graphic Design\n- Linux knowledge (i.e. CentOS, Ubuntu, SSH, bash, cron &amp; iptables)\n- Wifi&#x2F;wireless experience\n- Creating documentation\n- Marketing and&#x2F;or Advertising business experience\n- Willingness to learn all of the above (and more!)<p>Work Environment:\nYou can expect to spend 90% of your time working from home. We&#x27;ll connect you with the tools and training you need to excel within the company. Typical working hours are 8:30AM - 5PM Monday through Friday. Some other off-hours work may be required for some projects or customers, but we&#x27;re flexible too; Need to take a short break midday to pick up the kids from Soccer? No problem!<p>You&#x27;ll be reporting to our VP of Technology (also based in the Dallas area) and will work in-person together a few days a month (possibly more or less as needed). There will also be opportunities to travel to our HQ in south Florida to meet the rest of the team based there.","time":1441132205,"type":"comment"}