{"by":"jacques_chester","id":10152845,"kids":[10160206,10153543,10200856],"parent":10152809,"text":"ONSITE in NYC, SF and many other locations | Engineers, Designers, Product Manager | VISA and RELOCATION assistance<p>Pivotal Labs is a division of Pivotal Inc.<p>Labs helps clients to become better at development. For engineering we are religiously lean and agile -- in practice that means we pair program and TDD every line of code from the outside. Our product managers are fantastic at keeping products sharply focused, our designers are masters from users to pixels. We have a growing data science practice, and some engagements include all four roles. If you want to work in product instead of consulting, we also have dozens of teams working on Cloud Foundry, Big Data Suite, Spring and I probably forgot some cool stuff. Or you can rotate: I had a 7-month secondment to Cloud Foundry which was awesome.<p>Our NYC office is growing fast to meet exploding demand for Labs, Cloud Foundry and Big Data Suite.<p>We are also hiring in all our offices, including new offices: SF, Palo Alto, Los Angeles, Seattle, Boulder, Denver, Chicago, Boston, Washington DC, Toronto, London, Dublin, Berlin, Tokyo and Sydney.<p>We provide visa and relocation assistance. In the NYC office we have about 15 people from overseas, including Australians like me.<p>At the office we have free breakfast, weekly tech talks, good benefits and competitive pay. Ping pong is not mandatory, but it&#x27;s popular. I think west-coast ping pong is harder to beat, but east-coast style is more entertaining to watch. The beer fridge has more IPA than I prefer but I guess that&#x27;s life in paradise.<p>Frankly this is the best job I&#x27;ve ever had -- I&#x27;ve learnt more here than anywhere else. Everyone is smart and fun to work with.<p>We look for aptitude over APIs. It doesn&#x27;t matter wether your resumé says PHP or PhD: if you&#x27;re smart, know some stuff and have empathy, I and my peers want to work with you.<p>You can apply through our website: <a href=\"http:&#x2F;&#x2F;pivotal.io&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;pivotal.io&#x2F;careers</a>, but if you email me -- jchester@pivotal.io -- I can take advantage of our generous referral program and answer any private questions you might have.","time":1441120268,"type":"comment"}