{"by":"sadadar","id":10157320,"parent":10152809,"text":"Credit Karma (<a href=\"http:&#x2F;&#x2F;www.creditkarma.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.creditkarma.com</a>) is the company that is making credit for the people and helping to drive a huge change in how people understand their credit. We&#x27;re a hugely successful unicorn that is looking for a number of people to fill a few critical positions as we look to grow our next few billion in valuation.<p>We&#x27;re looking for someone to come in and lead our build and release team. The team has been growing into its own and has a ton of challenges supporting a few hundred engineers as they battle tech debt converting a monolithic backend into a cohesive set of beautiful modern services. You should be interested in leading teams that teach people to fish and write tools and services to enable scale. You should be a good product owner for highly technical work and be excited to have tons of other engineers as your stakeholders. You should feel confident that this is a job you are excited to do, if it is, you are probably a good fit.<p>We want a director and a few engineers to help grow our tools and services team. Tools and services are a set of scrum teams that do things like work on frameworks in scala, nodejs, and php that other teams will leverage to automate creation of the core features a good CK service uses. You&#x27;ll also have teams that are building a highly scalable notifications framework, a core administrative interface, and a variety of other things that we really need full time teams working on now that we scale. Just like build and release, you&#x27;ll have stakeholders who are all engineers and should be excited about those challenges. You&#x27;ll also help us break ground on some of our earliest open source projects (we&#x27;re late to the game).<p>Staff Software Engineers are what we title our best of the best. If you are the one in your company thinking &quot;I&#x27;m the smartest person in the room&quot; and &quot;I wish I had some real peers to talk to about this challenging problem&quot; you probably fit our definition. We have an extremely sharp team with some fantastic engineers who are looking to grow their ranks at the top. If you are excited about topics like domain driven design, distributed systems, high scalability, dockerization, android and ios development, and react and flux; this is a good stop for you.<p>Finally, we&#x27;re looking for a couple engineering managers. If you want to take a scrum team (~5 people) in our financial health (how our customers get tons of value out of CK), data engineering (how we figure out things that are useful for our customers), or tools and services (how our teams get stuff done) we need help. In addition to having managed technical folks: you should either have previously been a senior software engineer or have some serious program management skills to bring to bear.<p>If you are interested, hit me up matt dot greenberg at creditkarma.com (engineering director who volunteers to help with technical team hiring). We also have a ton of other job postings for other teams including Infrastructure, Security, IT, Marketing, and Operations at <a href=\"https:&#x2F;&#x2F;www.creditkarma.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.creditkarma.com&#x2F;careers</a>.","time":1441165698,"type":"comment"}