{"by":"skrebbel","id":10155008,"parent":10152809,"text":"Klets | Eindhoven, the Netherlands | <a href=\"https:&#x2F;&#x2F;klets.com\" rel=\"nofollow\">https:&#x2F;&#x2F;klets.com</a> - Marketer and customer cuddler (INTERN, REMOTE ok)<p>Klets is customer chat for normal companies. Super easy to set up, with Klets, any company makes it easy and fun for their customers to chat with them.<p>Unlike live chat popups, Klets focuses on companies that want to build real long-term relationships with their customers. This means great design, great UX, and all attention to the conversation. Companies don&#x27;t need any IT skills to set up Klets, and customers can chat without downloading anything or signing up.<p>Klets is only 3 people right now, looking to hire our first intern. Launched just 3 months ago, we now have paying customers, very many happy users, and we&#x27;re growing very fast.<p>We&#x27;re looking for a student or recent graduate in <i>marketing, communication, business administration or journalism</i> with an interest in tech startups. Help us make existing customers even happier about Klets and make Klets known to potential new customers. Think customer support, content marketing, referral marketing, and so on. We strongly believe that happy customers are the best marketing you can do, so in reality these fields are very closely related. We&#x27;re looking for someone who likes planning this out with us on a strategic level and <i>also</i> likes to execute.<p>If you&#x27;re a student looking for a (graduation) project, we can be very forthcoming with the precise contents and goals of the internship. It can be just about as practical or as academic as you need it to be to make it a great project.<p>Remote is OK, though the closer, the better. We need you to be at most 2 hours away from our timezone (CET).<p>The fact that you&#x27;re here reading this on HN means that you&#x27;re already very high on our list! So get in touch right now on our Klets page: <a href=\"https:&#x2F;&#x2F;klets.com&#x2F;klets\" rel=\"nofollow\">https:&#x2F;&#x2F;klets.com&#x2F;klets</a>","time":1441135286,"type":"comment"}