{"by":"wpietri","id":10152861,"parent":10152809,"text":"Code for America | San Francisco | on site<p>Code for America needs your help building Chime [1], its first commercial product: an open-source [2], git-based Python CMS built specifically to make city websites great. Full job description: <a href=\"http:&#x2F;&#x2F;codeforamerica.org&#x2F;jobs&#x2F;chime&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;codeforamerica.org&#x2F;jobs&#x2F;chime&#x2F;</a><p>In particular, we&#x27;re looking for a full-stack or back-end engineer who likes mentoring, so that a) we can ship more of the great features in our backlog, and b) we&#x27;ll be ready to hire more junior engineers while keeping code quality high.<p>What are we doing? City websites are a resident&#x27;s major interface to government. We believe that US city websites could be radically better. (As an example, compare <a href=\"https:&#x2F;&#x2F;gov.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;gov.uk</a> with your local city website; note how approachable and user-focused the former is.) A big part of the solution is a tool that makes it easy for city employees to do the right thing, making it easy for them to get good, user-friendly changes out quickly. We aim to make the lives of millions of residents better.<p>How are we doing it? The lowest level is git, which we trust to handle many people working in parallel on large, complicated sets of files. On top of that is Python and Flask for a straightforward, approachable back end code base. We currently use Travis to run our substantial unit test suite, and automatically deploy to AWS via Chef and Docker. We do that all through close collaboration, a cross-functional team, and shared decision-making informed by lots of user research. This all happens in a successful, well-regarded non-profit where you will get to meet lots of interesting people. (Last week at the kitchen snack jars, I ran across Tim O&#x27;Reilly.)<p>If that&#x27;s appealing, to apply just send me an email at william@codeforamerica.org with the 3 things listed here:\n<a href=\"http:&#x2F;&#x2F;codeforamerica.org&#x2F;jobs&#x2F;chime&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;codeforamerica.org&#x2F;jobs&#x2F;chime&#x2F;</a><p>Questions welcome, either here or via email.<p>[1] <a href=\"http:&#x2F;&#x2F;chimecms.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;chimecms.org&#x2F;</a><p>[2] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;chimecms&#x2F;chime\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chimecms&#x2F;chime</a> with Docker images available at <a href=\"https:&#x2F;&#x2F;hub.docker.com&#x2F;r&#x2F;chimecms&#x2F;chime&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;hub.docker.com&#x2F;r&#x2F;chimecms&#x2F;chime&#x2F;</a>","time":1441120335,"type":"comment"}