{"by":"paydro","id":10153412,"parent":10152809,"text":"8tracks | San Francisco | full time| ONSITE preferred | <a href=\"http:&#x2F;&#x2F;8tracks.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;8tracks.com&#x2F;jobs</a><p>Do you feel there should be a better way for people to find and enjoy the limitless spectrum of music created by mankind, much of which is now available online in some form -- if you know where to look? Do you love 8tracks but think the product could be even better?<p>8tracks is the best place for people who care about music to create and consume playlists. Its crowd curated platform offers unprecedented depth and relevancy in a &quot;lean back&quot; fashion -- spanning every imaginable style, activity or mood -- and an unmatched opportunity for music discovery, with less repetition and a uniquely human touch.<p>8tracks ranks #3 in the US among internet radio listeners aged 18-34 (after Pandora and iHeartRadio) and reaches 8m MAU who stream 30m hours&#x2F;month. Two-thirds of the music streamed on 8tracks hails from Independent artists and labels, and two-thirds of the music streamed is delivered to iOS and Android devices. Supported primarily by advertising sales, the business has operated at or near profitability for the last 3 years. Founded in 2008, 8tracks is backed by Index Ventures and Andreessen Horowitz, with offices in Mission Dolores (SF) and the Flatiron District (NYC).<p>Director of Engineering: <a href=\"http:&#x2F;&#x2F;8tracks.com&#x2F;job&#x2F;c3249aa0-ff26-4870-a972-ad352f434982\" rel=\"nofollow\">http:&#x2F;&#x2F;8tracks.com&#x2F;job&#x2F;c3249aa0-ff26-4870-a972-ad352f434982</a><p>iOS Dev: <a href=\"http:&#x2F;&#x2F;8tracks.com&#x2F;job&#x2F;f77ee7cd-b2ec-4c6c-8906-e7e0d099b36d\" rel=\"nofollow\">http:&#x2F;&#x2F;8tracks.com&#x2F;job&#x2F;f77ee7cd-b2ec-4c6c-8906-e7e0d099b36d</a><p>If you&#x27;re interested in our stack you can see my answer to it here: <a href=\"https:&#x2F;&#x2F;www.quora.com&#x2F;What-is-the-technical-architecture-of-8tracks\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quora.com&#x2F;What-is-the-technical-architecture-of-...</a>","time":1441123851,"type":"comment"}