{"by":"somya","id":10157267,"parent":10152809,"text":"SWARM (<a href=\"http:&#x2F;&#x2F;swarmnyc.com\" rel=\"nofollow\">http:&#x2F;&#x2F;swarmnyc.com</a>), a rapidly expanding digital services agency, is looking for a skillful backend, developer to join immediately. This position provides a unique opportunity to drive back-end technical decisions within a dynamic start-up setting.<p>Want to know more?<p>About you<p>- You are a skillful backend or a full-stack developer with significant experience (5 years +) in building high-performance, scalable, fault tolerant &amp; mission critical systems.<p>- You build REST services using old school tech (C#, Java, C++) and the new stuff (Node.js, GO)<p>- You work with SQL databases (SQL Server, Oracle) &amp; No SQL (Mongo, Redis)<p>- You work with and can dynamically scale services with cloud based platforms (AWS, Azure)<p>- You understand the importance of logging, monitoring &amp; unit tests.<p>- Overall you can pick the right tool for the job!<p>- For an added bonus you know video backend infrastructure ( ffmpeg, transcoding, webrtc)<p>- You love to learn, and equally love to share your knowledge with others.<p>About SWARM<p>At SWARM, we like to have fun as we push the boundaries on what can be done when you combine great design with solid development and marketing that gets noticed. On the surface, we make apps for iPhone, Android, Smart TV, wearables and emerging technology. Behind the scenes though - we draw, doodle, and solve puzzles. Usually, those puzzles are in code, product, or design. We’&#x27;re just a bunch of individuals who are passionate about technology.<p>Truth be told, we’re not just a services company. We experiment and hack a lot. Sometimes those experiments fail (like an anonymous twitter chat app) and sometimes they get pretty good traction, get noticed and win!<p>Also, we&#x27;re pretty big on education and learning forever. We’re always tinkering and evolving our processes, working out how to build better apps, challenging why certain designs work and why others don&#x27;t, and we&#x27;ll happily share with you as you grow in your skillset.<p>Our 10 person team is in a co-working space with plenty of comfy collaborative areas, and is beautifully situated in the Flatiron district.<p>please apply at hello@swarmnyc.com","time":1441164362,"type":"comment"}