{"by":"nickallain","dead":true,"id":10158127,"parent":10152809,"text":"Glasgow, UK OR Singapore - Spacecraft Software Engineer - ONSITE - <a href=\"http:&#x2F;&#x2F;spire.com\" rel=\"nofollow\">http:&#x2F;&#x2F;spire.com</a><p>Spire is a space-based data company. We&#x27;re about 60 people, have been around for less than 3 years, and are growing quickly. We&#x27;re a global company with office in San Francisco, Glasgow, and Singapore as well as employees from 14 countries and counting. Spire employees tend to get very good use out of their passports - especially software and hardware engineers. We pay for each employee to spend a week in any office each year (simply travel there and work as normal).<p>Working on our satellites offers software developers a chance to interact with the fullest of stacks, and this position can be customized to fit a variety of experiences and skill sets. As a Spacecraft Software Developer you will be working on the satellites and their terrestrial communication relays. You&#x27;ll have the opportunity to work on core systems, communication and radio, ground systems, satellite application platform, and more.<p>Extensive experience with C (interrupt handlers, concurrency, etc), Strong Linux skills (extensive CLI&#x2F;scripting familiarity, kernel mods, drivers, etc.), Sensor integration (over I2C, SPI, CAN, UART, etc.),  Python, Ruby, Bash<p>Strong candidates will also possess skills in one or more of the following areas:General hardware skills (EE,PCB,PSI), Networking (ISO, IP, protocol design), Domain Knowledge (ADCS), Embedded OS (FreeRTOS, embedded Linux), FPGA expertise (verilog, VHDL), RF programming (SDR, USRP)<p>Apply online: <a href=\"https:&#x2F;&#x2F;spire.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;spire.com&#x2F;careers&#x2F;</a><p>We also have openings in San Francisco, Singapore, and Glasgow for:\nCommunications Architect, Distributed Systems Engineer, Field Engineer, Ground Station Engineer, Network Operations Engineer, Production Manager, Satellite Hardware Technician, Spacecraft Hardware Engineer, \nSpacecraft Operations Engineer, Spacecraft Software Engineer, Support Engineer, Logistics Coordinator, Technical Recruiter","time":1441184544,"type":"comment"}