{"by":"colindean","id":10154095,"kids":[10155048],"parent":10152809,"text":"IBM Watson | Multiple positions | Pittsburgh | Onsite | Full-time | Citizen; Visa for well-qualified candidates | Scala; Java; Angular.js; Bootstrap; Python; Ruby; Watson Explorer<p>Want to be a part of a quickly growing product team, fueled by customers&#x27; never-ending thirst for knowledge? IBM Watson Pittsburgh has dominion over Watson Explorer and a number of upcoming Watson Developer Cloud services. We&#x27;re a hilariously large family seated in the heart of Squirrel Hill, a neighborhood of bonnie Pittsburgh. No office parks or egregious commutes here!<p><a href=\"http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;ibm.biz&#x2F;watson-pgh-jobs</a><p>* QA<p>* L2 Tech Support<p>* Product Management<p>* UI developers, junior and senior<p>* SWE positions opening periodically<p>If you apply, please ensure that you apply fully by clicking the link in the email you receive later today. People frequently miss that step and leave their application incomplete! I know the form is kinda long - I&#x27;m actively working with HR to shorten the process.<p>We try to keep our interview process as bullshit-free as possible. If we think you look good on paper, we’ll reach out for a phone chat and give you the details on a pretty open-ended &lt; 60 min code test, where you’ll implement a simple library. If we like your solution, then we’ll invite you for a live culture fit and technical interview, in-person if you’re near or remote if not. Our process has given us a ridiculously low turnover.<p>I&#x27;m the software engineer tech lead on the Watson Explorer connectivity team and former consultant with the product&#x27;s Professional Services team. I&#x27;ve been around a long while and I can rightfully say that Watson group really does move quickly lives up to the &quot;startup speed&quot; thing seen in the press.<p>See my post history for some additional details about the positions and our office: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;threads?id=colindean\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;threads?id=colindean</a><p>If you want to chat with me, hit me up on Pittsburgh Code &amp; Supply&#x27;s Slack chat (<a href=\"http:&#x2F;&#x2F;www.codeandsupply.co&#x2F;chat\" rel=\"nofollow\">http:&#x2F;&#x2F;www.codeandsupply.co&#x2F;chat</a>) or email me &lt;my hn username&gt; at us · ibm · com with &quot;Hacker News&quot; in the subject.","time":1441128111,"type":"comment"}