{"by":"grovr","id":10152848,"parent":10152809,"text":"Software Engineers - ONSITE, Cardiff, South Wales, UK - Sorenson Media<p>We&#x27;re looking to hire great Software Engineers regardless of specific technology background, who are happy to work on the full stack.\nTeams at Sorenson Media are empowered to autonomously make their own decisions about technology and &quot;how&quot; to do things, our Product Owner is also very open to listening to suggestions on &quot;what&quot; to do.\nUnit tests, integration tests, build servers and continuous integration are the backbone of our development practices.\nDevelopers get the chance to work on all parts of the product and you could find yourself working on backend code talking to the database as part of the same story where you also work on front-end Javascript and SCSS.\nWe work in an Agile fashion with 2 week sprints and a real focus on using the fortnightly retrospectives to come up with ideas to try out in future sprints to see if they help us make our customers happier. \nAs a team we have chosen to use Node.js for our server side components, backed by a MongoDB database. We encourage developers to help write integration tests and those are written in Ruby.\nMost of the people we&#x27;ve hired have little or no previous experience in these technologies and we train people up with a combination of time set aside for self-study and pair programming.<p>We&#x27;re looking for multiple engineers from mid to senior levels so I can&#x27;t specify specific salaries but I think they tend to be higher than most other Cardiff companies.<p>We&#x27;re hiring developers for our Spark Engage product: <a href=\"http:&#x2F;&#x2F;www.sorensonmedia.com&#x2F;spark&#x2F;engage&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sorensonmedia.com&#x2F;spark&#x2F;engage&#x2F;</a><p>If any of this sounds interesting then feel free to contact me at mgrover@sorensonmedia.com with any questions, CVs, github profiles etc.<p>Thanks - Matt, Scrum Master at Sorenson Media","time":1441120284,"type":"comment"}