{"by":"jhdavids8","id":10158821,"parent":10152809,"text":"Pathgather - <a href=\"http:&#x2F;&#x2F;pathgather.com\" rel=\"nofollow\">http:&#x2F;&#x2F;pathgather.com</a> - ONSITE preferred, REMOTE a possibility - New York, NY<p>Pathgather is an enterprise learning platform that - unlike traditional learning systems forced on employees - is one you&#x27;ll actually enjoy using, time and time again. We’re solving a big problem felt by almost all large companies: how to continuously train &amp; educate your workforce with modern&#x2F;relevant content.<p>One way we&#x27;re doing that is through one of the more engaging &amp; attractive interfaces in the enterprise market today. Historically, it seems that enterprise products can &quot;get away&quot; with compromising on UI&#x2F;UX, especially compared to consumer products. We don&#x27;t believe that should be the case. We strive to be a product you use daily, but in order for us to achieve that, our interface needs to meet (and exceed) the standards you experience on a daily basis.<p>We&#x27;re looking for an engineer who can focus &amp; make strides on this goal. You&#x27;ll do everything from helping define the UI&#x2F;UX for new feature releases to actual feature implementation.<p>About You<p>- You don&#x27;t test a feature in the browser without dev tools open<p>- You&#x27;re well versed in Javascript (we use Coffeescript), sans frameworks like jQuery<p>- You have experience building front-end features from conception to launch. This means extensive knowledge with CSS (we use Sass) and HTML (Haml)<p>- Perhaps you have experience in AngularJS. If not, you can learn here though<p>- Ideally, you have experience with front-end dev tools like Bower, Browsersify, Grunt, Jasmine, etc<p>- You&#x27;re used to writing unit &amp; E2E tests for your code<p>About Us<p>- We&#x27;re a Techstars NYC 2014 graduate<p>- We&#x27;ve got customers the likes of Qualcomm &amp; Twitter backing us<p>- We&#x27;re making a splash in a very antiquated industry, which means you&#x27;d be given the opportunity to design unprecedented solutions to problems that have plagued companies for quite some time<p>- On Fridays, you have the opportunity to work on or learn whatever you like. We often work on open source software (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;Pathgather\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Pathgather</a>) or dig into new technologies<p>If you&#x27;re interested, please email me at jamie@pathgather.com. Thanks!","time":1441198354,"type":"comment"}