{"by":"haikalpribadi","id":10160928,"parent":10152809,"text":"Ontoit (www.ontoit.io) is hiring in London!\ncareers@ontoit.io<p>Ontoit is a technology startup founded and run by graduates from the University of Cambridge. We work on integrating large datasets into knowledge ontologies using machine-learning techniques and performing parallelised semantic search on big data. The end result of using Ontoit search engine is that meaningful relationships can be inferred between pieces of information. These relationships can be used to perform explicit semantic search through large amounts of data. The Ontoit search engine will assist industries in a variety of fields to find information and explore ideas in an integrative manner. In order to create the proposed search engine, we intend to combine five distinct fields in computer science: ontology engineering, machine learning, natural language processing, semantic search and distributed computing.<p>Ontoit will first focus on developing one application for the movie industry. Our first product will be a semantic search engine to traverse the corpus of movie information on the internet.<p>Here at Ontoit, we develop our entire backend in one programming language, Java. Spring framework forms the backbone of our web services. We develop knowledge representations using stacks of graph databases and technologies. Natural sentence queries are parsed through an engine built using Stanford CoreNLP. Computations are distributed to a cluster developed using Apache Storm. Data crunches for Machine Learning models are parallelised using Spark. We store our data in scalable, NoSQL Cassandra.<p>Our system architecture is designed in great detail with a high degree of modularity and scalability.<p>Ontoit is currently recruiting for multiple positions:\nTeam Lead, Core Developer, NLP Developer, QA Developer. All positions are full time and we offer competitive salary + significant amount of equity.<p>Please find more details at: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;ontoitholdings&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;ontoitholdings&#x2F;jobs</a>\nand apply directly at Angel.co or careers@ontoit.io","time":1441216635,"type":"comment"}