{"by":"sinasadeghian","id":10198695,"parent":10152809,"text":"ApplyBoard | Kitchener, Ontario, Canada |  Ruby on Rails Developer | full-time, part-time, intern | ONSITE<p>ApplyBoard is a software platform for international students to choose and apply to universities in a fast and simple way. Our mission is to change the way students apply to schools and the way universities choose students and we have been successful so far.\nWe are looking for passionate software development to join us and build the first software platform to make university applications enjoyable to millions of students around the world. You will have the opportunity to work in a post-revenue startup and work on a well structured web application used by hundreds of users from all around the world everyday.\nOur platform is built on Ruby on Rails and MySql and is running on Amazon Servers (AWS).<p>Job Responsibilities:<p>Add features to ApplyBoard web application using Ruby on Rails framework, Find and fix bugs and propose new ideas to improve the system, Get hands dirty with both frontend and backend when needed, Talk to real customers everyday, find the pain points and find solutions for their problems<p>Required Skills:<p>Programming experience in at least one of Ruby, Python, PHP, C++, Java or similar Object Oriented programming languages, Familiar with basic data structures and algorithms, Familiar with web application architecture, HTML and CSS. Familiar with MVC frameworks and RESTful services (RoR&#x2F;Django), Basic knowledge of databases, Familiar with Linux&#x2F;Mac and shell&#x2F;bash script, Familiar with unit testing and test driven development<p>Nice to have:<p>Experience working with Ruby on Rails, Passenger and Apache web server, Experience with MySQL, Experience with AWS, Experience in Javascript, JQuery, Bootstrap, Familiarity with Git or similar version control systems, Speaking any of the languages French, Arabic or Spanish<p>Contact: sina@applyboard.com","time":1441899807,"type":"comment"}