{"by":"capkutay","id":10659618,"parent":10655740,"text":"Striim | Downtown Palo Alto, CA | Data Scientists, UX Engineer (HTML&#x2F;CSS&#x2F;JS) | ONSITE<p><a href=\"http:&#x2F;&#x2F;www.striim.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.striim.com</a><p>Striim is the only end-to-end solution for streaming integration and streaming analytics. The platform specializes in data integration across a wide variety of sources including change data from enterprise databases, log files, message queues, and IoT sensor data. With that difficult piece solved, Striim&#x27;s analytics layer makes it easy for operational teams to perform machine learning, correlate across streams, detect anomalies, identify and visualize events of interest, and trigger alerts and workflows, all within milliseconds.<p>Today, our end-to-end product is used to solve some of the toughest data management challenges at large Telco, Finance, Retail, and Cloud companies.<p>UX Engineer (React&#x2F;Redux&#x2F;Babel&#x2F;D3.js): <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;webaction&#x2F;job&#x2F;oYzZ1fwh\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;webaction&#x2F;job&#x2F;oYzZ1fwh</a><p>Data Scientist: <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;webaction&#x2F;job&#x2F;o7Aa2fwD\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;webaction&#x2F;job&#x2F;o7Aa2fwD</a><p>Distributed Systems QA Engineer:<p><a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;webaction&#x2F;job&#x2F;ovAg1fw6\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;webaction&#x2F;job&#x2F;ovAg1fw6</a><p>Striim is the flagship product of WebAction Inc, a company founded by a team of Silicon Valley executives with a track record of creating multiple successful enterprise products including WebLogic (now Oracle WebLogic) and GoldenGate software (now Oracle GoldenGate). We&#x27;ve raised north of $30m since 2013 including a recent $20m round of funding led by Intel Capital (in August 2015). Our advisors&#x2F;board have done amazing things like creating the Apple logo and founding one of the top VC firms in Silicon Valley. With every product release, we delight our customers and engage new ones at an ever-growing rate. We&#x27;re based in Downtown Palo Alto, minutes away from the Caltrain, Philz coffee, and everything you need to make your work life even more enjoyable!","time":1449011389,"type":"comment"}