{"by":"DLarsen","id":10656298,"parent":10655740,"text":"Connexity - Camarillo, CA (Los Angeles area) | on-site | <a href=\"http:&#x2F;&#x2F;connexity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;connexity.com</a><p>Are you a web developer eager to gain some serious experience with big data (~10 billion transactions per day)?  Help us build the web tools to wrangle billions of transactions every day.<p>#About Connexity<p>Our team is sharp and works well together. We enjoy perks such as daily paid lunch, a 9&#x2F;80 schedule (to get every other Friday off) and unconstrained vacation (don&#x27;t worry about having to build up enough vacation days for the family reunion); the culture of our team recognizes and respects the importance of your non-work life. Also, Ventura county is a pretty nice place to live&#x2F;work (unless you hate temperate coastal weather). If you&#x27;ve got Rails or other relevant web app experience, that&#x27;s a good start. More importantly, you&#x27;ll be eager to learn display advertising (banner ads, RTB) inside and out. Attitude, ambition and sound judgement trump experience with a specific set of tools. We&#x27;re a small team within a medium-sized organization, and we work hard to keep the small-team vibe while availing ourselves of the best bits from the mother ship in Santa Monica.<p>#Position: Rails + exposure to Scala, Hbase &amp; Kafka<p>We need someone to contribute to our Ruby on Rails app. It&#x27;s used to administer hundreds of advertising campaigns across hundreds of publisher sites. It&#x27;s not just boring CRUD. It provides a ton of control and insight to the team that operates our clients&#x27; campaigns; it&#x27;s truly the heart of our display advertising business. The business folks will know you, and you&#x27;ll find that excellence will stir up a tremendous amount of appreciation for your work. This role is a great way to learn advertising tech at scale as well as other tools. In addition to Rails work, you&#x27;d get hands on experience with Redis, Hbase, PostgreSQL, R and Scala. Several on the current team started in the Rails app and have moved into other areas of development (low-latency RTB bidder written in C, sophisticated reporting pipelines or novel optimization algorithms); so it&#x27;s a great position if you want to develop broader technical skills while really taking advantage of your growing knowledge of our vertical.<p>-- Unless you prefer to start with a HR-oriented chat, you can reach me (a lead engineer on the team) at david.larsen@connexity.com.","time":1448985597,"type":"comment"}