{"by":"worldadventurer","id":10655752,"parent":10655740,"text":"Code4Good --  <a href=\"https:&#x2F;&#x2F;www.engageSPARK.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.engageSPARK.com</a> - &quot;Twilio for Non-Techies&quot;  |  Cebu, Philippines  |  Full-Time | ONSITE<p>engageSPARK, a not-for-profit business, is an engagement platform that empowers NGOs to dramatically extend the reach and effectiveness of their pro-poor programs. Customers tell us that it’s the easiest to use self-service solution to easily and quickly launch comprehensive messaging, surveying, curriculum, education, and decision tree programs focused on developing countries via two-way SMS, Voice IVR Calls (roughly 40% of the world’s poor are illiterate), and Missed Calls in 200+ countries.<p>Customers such as International Rescue Committee, Innovations for Poverty Action, MedAir, Mercy Corps, and US Institute for Peace use the engageSPARK platform in countries around the world to make social change in the areas of Agriculture, Health, Finance, Elections, and Disaster Planning &amp; Response.  We&#x27;ve already changed the lives of more than 30,000 people living in poverty.<p>Full Stack Adventure Developer: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;j4h5WX\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;j4h5WX</a>\nAdventure Fellowship: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;YA8ENR\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;YA8ENR</a><p>Our stack: Go (GoLang) Microservices, Python&#x2F;Django, Java, Docker, Redis, Thrift, PostgreSQL, CouchDB, Android<p>Located in tropical Cebu Island, Cebu City is the second largest city in the Philippines. It’s a safe place to live with a variety of malls, restaurants, shops, beaches, and activities such as scuba diving, running, hiking, rock climbing, and snorkeling. It has a busy international airport with cheap flights to domestic and regional destinations. Check out Google Images: <a href=\"https:&#x2F;&#x2F;www.google.com&#x2F;search?safe=off&amp;site=imghp&amp;tbm=isch&amp;source=hp&amp;biw=1104&amp;bih=639&amp;q=cebu+philippines&amp;oq=cebu&amp;sout=0&amp;sa=X\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;search?safe=off&amp;site=imghp&amp;tbm=isch&amp;s...</a><p>Email us at Jobs at engageSPARK.com","time":1448982081,"type":"comment"}