{"by":"SCM","id":10656128,"parent":10655740,"text":"C++ Software Developer| Stevens Capital Management| Radnor,PA| ONSITE<p>An exceptional C++ Software Developer is sought by Stevens Capital Management LP (“SCM”),  a registered investment adviser that manages a multi-billion dollar hedge fund that has been in business for 20+ years. SCM specializes in the rigorous development and disciplined implementation of empirically based quantitative trading strategies. \nAs a C++ Developer you will be joining a highly productive team working in a fast-paced collegial environment, utilizing extensive data sets, technology and the scientific method to devise and employ trading strategies throughout the world’s most liquid financial markets.<p>We&#x27;re seeking highly driven, production-oriented C++ Developers who possess strong technical skills and the ability to work in a fast-paced collaborative environment.<p>Primary Responsibilities\n• Utilising your in-depth knowledge of C++ you will design, develop and implement proprietary trading programs, encompassing trade analysis, price validation, order routing, monitoring and risk analysis.\n•Develop and support multi-threaded applications with a strong emphasis on high performance.\n• Optimize our trading strategy implementation and performance analysis platform using network and systems programming.\n• Create tools to process, store and analyze quote, order and financial data.\n• Work closely with our quantitative research analysts, engineers and other groups to provide software solutions.<p>Requirements\n• Advanced C++ Professional level programming experience in a Linux environment. \n• A Computer Science or Mathematics degree.\n• Outstanding problem solving skills.\n• Knowledge of shell scripts and other languages including Perl, Bash or CSH is a plus.\n• Experience with relational databases including Sybase, SQL Server and Oracle is a plus.\n• Experience with GUI design is a plus.<p>Please submit your resume to recruiting@scm-lp.com\nWebsite: www.scm-lp.com","time":1448984501,"type":"comment"}