{"by":"piavpn","id":10660204,"parent":10655740,"text":"Private Internet Access | West Hollywood, CA or REMOTE | Full-Stack Engineers<p><a href=\"https:&#x2F;&#x2F;www.privateinternetaccess.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.privateinternetaccess.com&#x2F;</a><p>We run one of the world&#x27;s leading VPN services and are looking to grow both the Private Internet Access team as well as find engineers to help us on new projects. We are especially interested in people who care about privacy and freedom. We have a couple of different open positions:<p>Full-Stack Desktop Software Engineer (Ruby, JavaScript)<p><pre><code>  * Solid experience with Ruby and JavaScript hybrid&#x2F;native apps\n  * Experience with ReactJS, Tide&#x2F;Titaniun&#x2F;atom&#x2F;Electron frameworks desired\n  * Knowledge of Mac OS X&#x2F;Cocoa, Win32, Linux networking APIs a huge plus\n  * Not afraid to dig into unfamiliar APIs on multiple platforms\n</code></pre>\nMobile Engineer (iOS, Android)<p><pre><code>  * Comfortable with C&#x2F;C++ and JNI glue logic on Android\n  * An eye for good design and knowledge of interface design guidelines\n  * Prior experience implementing beautiful UIs\n</code></pre>\nIRC Software Engineer (Ruby)<p><pre><code>  * Intimate knowledge of IRC protocol (RFC 1459 et al., CTCP, \\001ACTION, etc.)\n  * Experience writing IRC bots and services (at the IRC protocol level)\n</code></pre>\nWeb &amp; Email Software Engineer (node.js, Ruby, shell script)<p><pre><code>  * Intimate knowledge of email protocols (SMTP, IMAP, etc.) and relevant RFCs\n  * Experience writing MTAs, MUAs, or email filtering tools\n  * Familiarity with secure coding practices, including running untrusted code\n    (JavaScript) in a sandbox\n</code></pre>\nWe&#x27;re a remote team (unless you happen to be based in the LA area, in which case you&#x27;d want to come work from our beautiful office in West Hollywood), and all of our collaboration happens over Slack and Trello, with the occasional email.<p>Email jobs@privateinternetaccess.com with your resume and&#x2F;or links to projects you&#x27;ve worked on, a link to your GitHub (or some other site where we can see your code), and what makes you interested in our company. Don&#x27;t forget to mention you&#x27;re from HN!","time":1449018916,"type":"comment"}