{"by":"cyngn-recruit","id":10674175,"parent":10655740,"text":"CYANOGEN | Palo Alto, CA | On-site Only | Relocation Assistance | Full Time | Visa (transfer only for H1b at this point)<p>Cyanogen is creating the next paradigm shift in mobile computing. We&#x27;re committed to opening up and evolving Android - by breaking down barriers that get in the way of innovation, by building a more open, level playing field for developers, and by enabling new interaction models and new types of user experiences that change the way we think about mobile apps and services. Cyanogen wants to give control back to users everywhere in far more meaningful ways by enabling the best possible mobile experience.<p>These are our high priority open positions:\n1) Sr. Software Engineer - Developer Platform: As a part of the Developer Platform team you will support and add features that have strong framework dependencies. Your work will be exposed through the Cyanogen SDK for developers across the world to build on your API’s. You’ll need extensive experience developing complex Android applications, exceptional OO design&#x2F;development skills, and a solid understanding of the Android SDK.<p>2) Sr. Android Software Engineer: You’ll contribute work that is fundamental to the Cyanogen experience by adding features to the Android frameworks, exposing them to apps, and allowing for deeper, richer experiences for our community to utilize. You’ll need extensive experience developing complex Android applications and exceptional OO design and development skills.<p>3) Sr. Platform &#x2F; Web Services Engineer: Build the scalable, distributed systems that power our mass-market mobile services accessed by 50M+ users. You’ll need hands-on experience with large-scale, distributed platforms, such as AWS, and excellent OO development skills. These services are being developed with Java NIO and open source frameworks like Vert.x and Netty<p>Working at Cyanogen, you&#x27;ll get to collaborate with developers from around the world and contribute daily to a platform used by millions of people. Community involvement is an integral part of our everyday work. If you have a passion for innovation and can demonstrate strong skills and a great attitude, we want to speak with you!<p>Check us out at <a href=\"http:&#x2F;&#x2F;cyngn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cyngn.com</a> and view all of our open positions here: <a href=\"http:&#x2F;&#x2F;goo.gl&#x2F;2kr9sR\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;2kr9sR</a>, or email us at recruiting AT cyngn DOT com with questions.","time":1449195697,"type":"comment"}