{"by":"eddiekim","id":10673108,"parent":10655740,"text":"iboss Cybersecurity|San Diego &amp; San Francisco |ONSITE| Full-Time|\nSr. Software Engineer<p>iboss Cybersecurity has been dedicated to arming organizations with the technology they need to defend against today’s most advanced and complex threats. This is the cutting edge of security with focuses on mobile technologies, cloud innovation, data protection and behavioral defense technologies. We are experiencing rapid growth and are backed by Goldman Sachs. Along the way we’ve achieved over 65+ technology patents and a customer retention rate consistently above 98.5%.<p>We are looking for a passionate Senior Software Engineer, who is ready to work on the cutting edge of Cyber Security Software solutions. This is an excellent opportunity to become a core member of a rapidly growing software development team. You’ll engineer solutions to challenging and meaningful problems, with the ultimate goal of expanding and enhancing the iboss security solutions suite.<p>Required Qualifications:\n•5+ years of experience using Java technology stack and servlet containers\n•3+ years of experience with frontend technologies (Javascript, HTML, CSS)\n•Working knowledge of database technologies and SQL, especially PostgreSQL\n•In-depth experience with OO design and proven design patterns\n•Comfortable working on a Unix environment\n•Experience working in an Agile environment\n•Team player with excellent interpersonal skills and the ability to work in a fast-paced environment\n•Strong analytical capability, independent thinking and good decision making skills\n•Must have a good sense of engineering tradeoffs, with an ability to understand the impact of software changes on extendibility, scalability, performance, and maintainability\n•Demonstrate excellent oral and written communication skills with the ability to listen, articulate, facilitate and advocate<p>Preferred Qualifications:\n•Experience with Tomcat and Spring\n•Experience with single-page applications using frameworks such as AngularJS\n•Knowledge of security, networking and handling of large datasets\n•Ability to identify and resolve performance problems in code\n•Experience building RESTful JSON APIs<p>Please submit resumes to: e.kim@iboss.com \n<a href=\"http:&#x2F;&#x2F;www.iboss.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.iboss.com&#x2F;careers</a>","time":1449180782,"type":"comment"}