{"by":"clarkevans","id":6139979,"parent":6139927,"text":"Chicago, IL &#x2F; New Haven, CT &#x2F; Telecommute -- Development Operations Engineer<p>Prometheus Research, LLC (<a href=\"http://prometheusresearch.com\" rel=\"nofollow\">http:&#x2F;&#x2F;prometheusresearch.com</a>) is searching for a full-stack development operations engineer to help build-out our SaaS offering and custom deployments of bio-informatics applications.  We&#x27;re comfortable with telecommute, however, since we work with HIPPA, you must be in the U.S.<p>* We help medical researchers (especially those working with autistic children) manage their data.<p>* We both use and produce free and open source software (YAML, HTSQL, and soon RexDB).<p>* We are a Javascript, Python, PostgreSQL, and Linux consulting and custom development group.<p>* We have a RexDB SaaS offering that is typically hosted on university networks.<p>* Our clients (and users) have demanding problems; they are appreciative, smart &amp; fun.<p>* Our work is primarily funded through foundations and grants (we&#x27;ll never be flush with cash).<p>We&#x27;re looking for someone who would help us build-out our software deployment and monitoring infrastructure.  You&#x27;ll be working closely with Clark Evans in Chicago (truthfully, over IRC) and other members of Prometheus in New Haven CT and Prague.  Your clients will be internal data analysts, custom software developers, and client relationship managers.  We&#x27;re currently transitioning from an ad-hoc set of system management scripts to Ansible and Cogs; and soon we&#x27;ll probably move most services to Docker or some other open source light-weight virtualization system.  We&#x27;re looking for someone who uses appropriate open source tools and helps us contributes back to the broader community.<p>We value planning, documentation and competent execution.  This is not an entry level position.  If you&#x27;re interested, tell us at ops-hn-20130801@prometheusresearch.com<p>Clark","time":1375362516,"type":"comment"}