{"by":"asm89","id":6140260,"parent":6139927,"text":"Rotterdam, The Netherlands - Full time  - Senior PHP Developer - Qandidate.com<p>Come and join our team in our quest to build the best recruitment software in the universe...and beyond ;-)<p>You will be working at our head office in Rotterdam, developing Qandidate.com, diverse internal back-office applications, internal and external API&#x27;s.<p>You get to work with experienced colleagues with a strong vision on web development and software architecture, giving you a full intellectual challenge every day. One day of your work week will be dedicated to R&amp;D, prototyping and researching new processes, techniques and tools to move the development of Qandidate.com to the next level. If you want to push your web development knowledge to the next level, come join us!<p># At Qandidate.com we use the following (and this list is growing):<p><pre><code>  - LAMP + Elasticsearch\n  - Symfony2 &#x2F; Yii (legacy)\n  - Git and GitHub\n  - IRC\n  - Test driven development\n  - Constantly investigating new stuff like DDD &#x2F; CQRS &#x2F; Event sourcing &#x2F; devops &#x2F; ...\n  - Our architecture is moving to decoupled applications, working together to provide the platform that runs Qandidate.com.\n</code></pre>\n# What do we ask from you?<p><pre><code>  - You have a Bachelor’s or Master’s degree in Computer Science (or equivalent)\n  - Strong object oriented programming skills\n  - Experience with developing with a framework such as Symfony2, Yii, or Zend2\n  - Experience with test driven development\n</code></pre>\n# What do we offer you?<p>We offer an excellent salary, an Option plan (SAR’s) and additional incentives every 6 months when we hit our company targets. Think of a day at the spa, dinner for two at a Michelin star restaurant or designer sunglasses of choice. We also have a pension scheme and if you like socializing, you’ll be pleased to know that there are plenty of outings and get-togethers taking place!<p>Meet your new colleagues! <a href=\"http://qandidate.com/tag/meet-the-team/\" rel=\"nofollow\">http:&#x2F;&#x2F;qandidate.com&#x2F;tag&#x2F;meet-the-team&#x2F;</a><p># We also offer:<p><pre><code>  - 25 holidays days;\n  - flexible working hours;\n  - time and budget for training;\n  - communal lunch every Tuesday;\n  - laptop with SSD and 16GB RAM + docking station and two 24” screens at your desk;\n  - 20% time for R&amp;D;\n  - great coffee ;-)\n</code></pre>\n# About Qandidate.com<p>Qandidate.com is the new and free recruitment system for those companies looking to improve and take direct control over their recruitment activities. Designed for in-house recruitment, Qandidate.com offers customers an alternative to Outlook and Excel by providing a refreshingly easy-to-use online recruitment system. Qandidate.com provides all the information and tools they need to create an effortless recruiting process. Customers can track and manage their applicants anytime, anywhere. All for free!<p>Interested? Drop me a mail at iam.&lt;my hn nick&gt;@gmail.com.","time":1375364992,"type":"comment"}