{"by":"pyrox420","id":6140237,"parent":6139927,"text":"Rockton, IL &#x2F; Fulltime Senior&#x2F;Mid Web Developer, AccuLynx (<a href=\"http://www.acculynx.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.acculynx.com</a>)<p>AccuLynx is a bootstrapped and profitable startup that is growing rapidly. We need two full-time web developers to help maintain and build upon our SaaS web application. We have a small team (4.5 devs) and have some amazing challenges ahead of us. The biggest being how can we scale efficiently to accommodate our growing customer base. We have interesting problems that need smart people to solve them.<p>Detailed job description can be found here: <a href=\"http://www.acculynx.com/about/jobs/#webdev\" rel=\"nofollow\">http:&#x2F;&#x2F;www.acculynx.com&#x2F;about&#x2F;jobs&#x2F;#webdev</a><p>Basically we are looking for smart people that get things done. Our team does not hire based on buzzwords or popular acronyms. We expect you to have mastered at least one language and be able to master any technology, language, or development environment in the future. If you are unfamiliar with a piece of technology we will help bring you up to speed.<p>We&#x27;d like to see skills in our current stack: Asp.net webforms (It is OK to shudder...), C#, jQuery, Sql Server. We are quickly moving to Asp.net MVC, Angular&#x2F;, ElasticSearch, and Redis. We are building<p>We believe in employee happiness and strive to accommodate that. We work at a 40hr sustainable work pace, have awesome sit stand desks, and create a fun&#x2F;relaxed environment. The village of Rockton offers &quot;small-town charm&quot; and low cost-of-living, without being far from larger metropolitan areas (Chicago, Milwaukee, Madison).<p>Benefits are top notch: Highly competitive salary (70k-100k), stock options, 15 days vacation, $5k&#x2F;year to spend on continuing education (conferences, classes, etc), choice of computer hardware, choice of cell phone, MSDN subscription, gym membership, competitive medical, dental, vision, 401K with matching &amp; safe harbor contributions, relocation reimbursement available.<p>Email me if you are interested (mention HN to get my attention), my name is Paul: dev@acculynx.com","time":1375364772,"type":"comment"}