{"by":"TLCooksey","id":6140478,"parent":6139927,"text":"Badgeville is looking for a Senior Operations Engineer.<p>Why would you want to be our Senior Operations Engineer?\nWe sit right at the spot where websites, mobile apps &amp; enterprise SaaS smack full-speed into big data analytics. Gamification is the big idea of 2013 and it’s only getting bigger. At Badgeville, you’ll be surrounded by the speed and flexibility of a start-up team while working to support some of the world’s biggest companies. Do you love brand-new offices featuring overstocked kitchens, games &amp; outings, bike &amp; jogging paths, unbeatable views and ridiculous gyms with climbing walls? Sure — we’ve got all of those. But you want all of that while you get to work with the latest systems in one of the hottest emerging markets around. You want to be in a position where the way you lead your team determines how the company performs every day. That’s why you want to be at Badgeville.<p>Requirements and Skills:<p>A minimum of 5 years hands-on Linux &amp; package management experience\nSolid understanding of Internet working and security fundamentals\nExtensive experience with automation tools – Puppet &amp; Chef\nGood understanding of underlying protocols &amp; web interfaces – TCP&#x2F;IP, JSON, REST, HTTP(S)\nConfortable with Linux shell scripting – Bash, Perl, Python\nStrong Systems Knowledge – storage subsystems, performance tuning\nAbility to quickly solve problems and automate routine tasks\nGood working knowledge of DB Systems (MongoDB, MySQL)\nExcellent written and verbal communication skills (ability to explain a problem&#x2F;issue)\nExcellent team player and comfortable interacting with developers\nPreferred Knowledge and Skills:<p>Good networking knowledge – multilayer load balancing, BGP, network traffic analysis, firewalls, routers, switches\nExperience in an Enterprise level Network Operations Center a plus\nBenefits&#x2F;Perks<p>Competitive Salary\nStock Options\nFull medical, dental &amp; vision benefits\nBrand-new office space bursting with tasty treats, games, and jogging&#x2F;bike paths\nFully paid gym membership (for code-crushing forearms)\nCompany-provided CalTrain pass\nLots of fun team events &amp; outings\nCatered lunch 3 days a week<p><a href=\"http://www.jobscore.com/jobs/badgeville/senior-operations-engineer/dwkyM-VMur4OrQeJe4iefn\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs&#x2F;badgeville&#x2F;senior-operations-en...</a><p>If interested email engjobs@badgeville.com","time":1375366913,"type":"comment"}