{"by":"leakybucket","id":6140962,"parent":6139927,"text":"Sessionbox - San Francisco, CA (SOMA)<p><a href=\"http://www.sessionbox.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sessionbox.com&#x2F;</a><p>Because instrumenting the frontend should be easy. (Let&#x27;s just say that&#x27;s the visible part of the iceberg). We&#x27;ve opened up the hood in a new way, enabling full x-ray visibility into the frontend (and a lot more that will surface in due time). Ok, we know. That&#x27;s a little cryptic. We look forward to being able to say more, and in the meantime, if you&#x27;re really curious, try reverse-engineering what we&#x27;re doing from our jobs page. You&#x27;ll see we have some tasty ingredients.<p>We&#x27;ve just finished seed funding, and are looking for our second and third engineers.<p>Software Engineer - Javascript Frameworks Expert<p>Are you tired of sprinkling blobs of Javascript instrumentation code throughout your applications? Have you explained the importance of the waterfall graph in DevTools a zillion times? Do you think that movie theatres should play compilations of Paul Irish videos? If so, this position might be for you.<p>Qualifications:<p>Demonstrable expertise with multiple programming languages<p>Expert understanding of web technologies (Javascript, HTML, CSS).<p>Expert understanding of at least one frontend Javascript framework (Backbone, Angular, Ember, Knockout, etc).<p>Substantial experience with Chrome DevTools.<p>BS&#x2F;MS in Computer Science or closely related field.<p>Bonus points:<p>Experience as a team or project lead.<p>Experience with d3 or other Javascript data visualization libraries.<p>Experience creating applications with node.js.<p>Familiarity with WebKit or Blink internals.<p>Software Engineer - Core and Backend Lead<p>You will work on the architecture and implementation of our core service. This includes both the core Sessionbox technology to monitor and analyze our customers&#x27; production web applications, as well as the backend infrastructure that will keep our service available and scalable.<p>Qualifications:<p>Demonstrable expertise with multiple programming languages<p>5+ years creating and scaling web application backends (including node.js)<p>Deep understanding and implementation experience with HTTP proxies.<p>Expert knowledge of at least one NoSQL database (Mongo, Cassandra, etc).<p>BS&#x2F;MS in Computer Science or closely related field.<p>Bonus points:<p>Experience as a team or project lead.<p>Experience with LXC based containers.<p>Familiarity with WebKit or Blink internals.","time":1375371076,"type":"comment"}