{"by":"fullstackdriven","id":6140685,"kids":[6141392],"parent":6139927,"text":"Full-stack dev co-founder for web-service infrastructure startup -- SFBay, possibly remote initially. H1B-okay<p>Looking for a technical co-founder to join technical founder in an\nambitious startup that aims to solve a widespread pain point in\nbusiness-consumer interaction.<p>This isn&#x27;t a todo or photo-sharing app. If successful it will be an\nimportant part of web infrastructure that many people use but hardly\nthink about. No hype, no quirkiness, no ego.<p>It has a sane business model that doesn&#x27;t depend on advertising or\nacquisition.<p>Once established it will exhibit a moat that will make competition\nvery difficult.<p>You must:<p>- be proficient with full-stack web development and have demonstrable experience through work products<p>- be driven, gritty, hard-nosed, goal focused<p>- be very intelligent (preferably with credentials)<p>- have shown that you can transfer your problem solving ability to different fields (accomplished background&#x2F;education in another field like physics, biology, philosophy? Write about topics outside CS&#x2F;Eng&#x2F;tech? Solved problems in another field?)<p>- get things done<p>- be technically talented in general<p>- be self-directed and self-sufficient<p>- be able to find out what needs to be done, what tools are needed and\n  learn how to use those tools.<p>- be able to take ownership of nearly all the technical stack of a typical web service<p>- be able to communicate effectively: be articulate, sometimes have strong opinions and be able to defend them without being dogmatic.<p>- be critical: You shouldn&#x27;t believe the hype or be a conformist. You\n  should be able to analyze issues independently and come to your own\n  conclusions. You should have some justifiable convictions that are\n  not in line with popular sentiment.<p>- be thoughtful: You should often think about how to make things\n  better, what things are broken, how things fit into the bigger\n  picture and about things happening in the world.<p>- Knowledge of web security and how to apply cryptography a plus.<p>Open to existing 2-3 person teams also.\nOpen to recent graduates, grad school dropouts and those with experience.<p>When responding please enclose a link or attachment to relevant work\nproduct samples along with a short resume and short introductory\nletter.<p>No contractors.<p>fullstackcofounder@gmail.com","time":1375368807,"type":"comment"}