{"by":"clarkevans","id":6140137,"parent":6139927,"text":"﻿New Haven, CT -- Senior Director of Product &amp; Application Development<p>Prometheus Research (<a href=\"http://prometheusresearch.com\" rel=\"nofollow\">http:&#x2F;&#x2F;prometheusresearch.com</a>) is looking for a talented department-level manager of technical people and projects who can get top performance from a talented team, coordinate development of multiple components into a complex product suite, and create management and reporting processes that keep stakeholders, including executive sponsors, informed and involved. You will understand every technical project in the company and delegate appropriately. You will make sure all the technical projects work together to advance the mission of the company. You will anticipate project, process, and hiring needs, and be able to hire and develop a great team, including developing next-level managers. You are passionate about creating transparency and accountability in software development organizations and about helping developers achieve greatness.<p>Prometheus helps customers transform their structured data into a valuable, sharable resource by organizing it in flexible, highly accessible systems. We’ve built our reputation on helping diverse members of the biomedical research community overcome the ordinary and extraordinary challenges of managing complex research data. We deliver sensible solutions to data management problems powered by our adaptable, web-based RexDB platform, and deliver expert consulting and data management services.<p>Areas of Responsibility include:<p>* Meet with senior technical leadership to facilitate clarity about technical direction<p>* Define and implement better management practices for software development and delivery<p>* Create and maintain plans for delivery of products and function points, including those that require integration of multiple components<p>* Talk with developers to enrich your understanding of the status of each project<p>* Review code check-ins, test suites, and documentation<p>* Meet with developers to mentor them on best practices and to promote professional growth<p>* Organize information about the state of software development into meaningful reports and present reports to stakeholders, including the executive team<p>* Work with the management team and the executive team to identify and resolve issues that block delivery<p>If you&#x27;re interested in discussing this position, please send a cover letter and your resume to mgt-hn-20130801@prometheusresearch.com","time":1375363798,"type":"comment"}