{"by":"sfgerrymorales","id":6141810,"parent":6139927,"text":"Senior UI Developer<p>Engineering | San Francisco, CA, United States \nAppDynamics is the leader in next generation solutions for managing modern, distributed, and extremely complex applications residing in both the cloud and the data center. Our customers include some of the largest web sites on the planet, who use our products to monitor and troubleshoot applications distributed across thousands of servers.<p>With the paradigm shifts to horizontally distributed applications, service oriented architectures, cloud hosting, and agile deployment it is more complex than ever to manage large-scale applications. The innovative AppDynamics technology greatly simplifies managing these modern application architectures. With over 500 high profile customers and year over year revenue growth above 300%, we are disrupting the multi-billion dollar APM (Application Performance Management) market.<p>Founded in 2008 and lead by proven innovators, AppDynamics has rock solid funding from top tier venture capital firms including: Greylock, Lightspeed, Kleiner Perkins and IVP.<p>Design, architect, and develop our user interface using the latest web and mobile technologies. Deliver innovations that make complex problems (massively distributed application analysis and management) easy for our customers to tackle. Make the impossible possible and the hard easy.<p>Requirements: \nPassion for creating amazing user experiences\nPassion for software design and well structured code.\nExpert level OO design and programming skills. \nComputer Science background \nExperience building complex Object Oriented web applications in JavaScript, HTML5 and CSS.\nExperience with client side web technologies&#x2F;frameworks (one or more of AngularJs, Knockout, Ember, Backbone,  Jquery&#x2F;JqueryUI, Closure, Sencha&#x2F;ExtJs, YUI, Bootstrap, Dojo, mustache.js, require.js, common.js, TypeScript, Dart etc)\nMotivated individual that wants to be part of a fast paced startup.<p>Bonus Experience:\nUI design (creating mockups and wireframes, working with visual designers, etc)\nMobile UI development (iOS&#x2F;Cocoa, Android,).\nJava server side web frameworks (SpringMVC, Struts, Tapestry, Wiket, Closure, JSF)\nJava&#x2F;J2EE and&#x2F;or .NET stack.\nFlex and Flash exposure\nProficiency with visual design tools (Photoshop, Fireworks, Illustrator, etc).","time":1375377259,"type":"comment"}