{"by":"wellingtonwu","id":6141553,"parent":6139927,"text":"Philadelphia, PA - Leadnomics, Philly&#x27;s fastest growing company is hiring Node.JS Developers! (Open to Relo)<p>To Apply: Follow this link <a href=\"http://www.leadnomics.com/about/#hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadnomics.com&#x2F;about&#x2F;#hiring</a> OR send your resume to wwu@leadnomics.com<p>Leadnomics is a fast-growing, innovative, online marketing company. We generate customers (leads) for large companies including financial institutions, online schools and insurance companies. We employ industry standards for best-practices and deliver high volumes of quality leads at competitive prices. Our team represents some of the leading minds in search, email, social, development and more. We don’t punch a clock or work in suits but each person knows their role and has the power to influence the direction and success of our company everyday.<p>Leadnomics is one of the fastest growing start-ups in Philadelphia. We launched in 2008 and have grown our revenue at over 500% per year. Our office is conveniently located in the Cira Centre next to 30th Street Station. We are a short walk from the heart of Center City and accessible by public transportation.<p>Position Overview:\nWe are looking for a Sr. Software Engineer to take on a role on our core dev team. Our team is comprised of talented engineers who are passionate about designing, creating and delivering highly scalable solutions for our core, lead management platform. Leadnomics is recognized as not only the 26th fastest growing company in the country, but as an industry leader in the on-line marketing, lead generation space. We cultivate and deliver real-time leads through targeted ad campaigns via our publisher network to some of the top companies in the Financial Services and Auto Insurance verticals. Our platform currently handles hundreds of thousands transactions each day from our partners all over the world.<p>Your job:\n-Design and develop high-performance distributed services for our next-generation platform \n-Assist team in delivering solutions to fuel growth, scalability and sustainability of our platform. \n-Generalize and simplify technical solutions to solve multiple needs using the best-in-breed tools and technologies. \n-Consistently research, innovate and implement improvements to expand the capacity of the platform.<p>Your background:\n-Experience designing, writing and deploying scalable software -Experience hand-coding server side Javascript \n-A track record of solving problems and getting things done \n-Strong proficiency with data structures and back-end systems -Experience dealing wtih scalability issues \n-Professional experience with low-level optimizing, tuning and debugging for performance \n-Top-notch expertise in at least one relevant technology \n-Highly productive developer in open source languages, with functional programming experience<p>Your toolbox:\nNode.js AWS Heroku Javascript asynch I&#x2F;O PHP Memcached Linux<p>Our Environment:\nWe&#x27;re a small company with an awesome view of the Philadelphia skyline, a fully stocked refrigerator and snack cabinet, catered lunch on Mondays, a plethora of office toys, and (we’ve been told) the best office parties in Philly!<p>Benefits include:\nHighly competitive compensation Generous paid time off Premium medical and dental insurance for employees 401(k) Catered Lunches Fully stocked kitchen w&#x2F; craft beers too! Friendly Fun, Diverse, Hard Working Environment","time":1375375391,"type":"comment"}