{"by":"wellingtonwu","id":6141835,"parent":6139927,"text":"Philadelphia, PA - Fulltime. DATA SCIENTIST<p>50onRed - www.50onRed.com - One of Philadelphia&#x27;s Fastest Growing Companies<p>To Apply: go to <a href=\"http://bit.ly/1aZ6FPq\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1aZ6FPq</a> or email wwu@50onRed.com<p>50onRed is an open source, technology driven organization that helps monetize the web for its clients through the web.  Simply put, we help bridge the gap between advertisers and publishers through an innovative traffic platform and online advertising products.<p>We are looking for a Sr. Data Scientist to join our team.   If you&#x27;re smart, passionate, and thrive on the challenges of building scalable software in a high-volume, big data world.  Our core platform handles over 5 billion (with a &quot;b&quot;) transactions per day.<p>As part of our team, you will be surrounded by best-in-breed software engineers who are well versed in not only Python, but also with Java, PHP, AWS, and NoSQL... (not to mention ping-pong and craft brews!)  We work hard on tackling the challenges of big data and we have fun doing it.<p>Requirements:<p>-Coursework or other training in machine learning and statistics.\n-3+ years industry or academic experience prototyping classification and regression models using scikit-learn, R, Matlab, Octave, Weka, or other machine learning software.\n-Ability to extract, process, and prepare training data from raw logs.\n-Must understand the nuances of split-testing and evaluating model performance on out-of-sample &#x2F; test set data.\n-Ability to work with engineering team members.\n-Familiarity with a Linux environment.<p>Desired:<p>-Master’s degree in computer science, statistics, or another quantitative field with formal training in machine learning.\n-Experience with Redis or other NoSQL technologies.\n-Fluency in Python and pandas.\n-Some experience or knowledge of natural language processing (n-grams, smoothing and back-off, TFIDF).\n-Experience with large-scale log processing or big data (Elastic MapReduce or Hadoop Streaming, Pig, Hive, Spark, or another Hadoop framework).\n-Familiarity with Amazon Web Services (S3, EC2, SQS, EMR).\n-Experience with Lean development.","time":1375377474,"type":"comment"}