{"by":"peawee","id":6141580,"parent":6139927,"text":"SpiderOak - Anywhere (Telecommute) - <a href=\"https://spideroak.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;spideroak.com&#x2F;jobs</a> &#x2F; <a href=\"https://spideroak.com/blog/20130722141302-python-web-developer-kansas-city-or-remote-2\" rel=\"nofollow\">https:&#x2F;&#x2F;spideroak.com&#x2F;blog&#x2F;20130722141302-python-web-develop...</a><p>SpiderOak seeks a web developer to build our next generation web presence and web applications.  You will be working closely with our designers and our CEO, and you&#x27;ll get regular code feedback from internal application security teams.  Key technologies are Python, Django, and HTML5.<p>You’ll be expected to have mastery of HTML-related presentation technologies, from HTML layouts with CSS to JavaScript-based UI frameworks and Bootstrap.  Prior knowledge of the Django ecosystem of reusable apps would be beneficial.<p>SpiderOak spans eighteen timezones the written word is essential.  You&#x27;ll need to join IRC channel occasionally during US business hours (but no rigid scheduling), participate on our bug tracker, wiki, and email.<p>Some of the best programmers we&#x27;ve known have poor resumes, so we have no minimum requirements for degrees. We’re also super-equal-opportunity: quality design knows no bounds for race, gender, nationality, sexual orientation, species (Giant Pandas will be encouraged because &quot;AAAAhhhh-dorable!!!!&quot;) or religion. If you can meet what we need, we’ll do amazing things together.<p>- About Us -<p>Started in 2007, SpiderOak provides desktop, web, and mobile software for backup, sync, and sharing, keeping user data encrypted and private.  We provide consumer and enterprise solutions, own storage backend and our own data centers.  Most of what SpiderOak creates is Python, and free and open source software.  SpiderOak is a 100% distributed, virtual-office, work-from-home, your own schedule company.","time":1375375584,"type":"comment"}