{"by":"meganap","id":6142110,"parent":6139927,"text":"San Francisco, CA - Full-time, permanent - MuleSoft<p>Sr. Javascript UI Engineer<p>Why should you join MuleSoft?<p>Every major company is adopting more and more cloud services, AND building lots of apps themselves, AND publishing their own APIs. We&#x27;re talking hundreds to thousands of integration points for a single reasonably-large enterprise to glue together. In fact, increasingly the heart of a company&#x27;s applications is in the glue itself. And that makes for an exponentially-big problem for enterprises: how do you assemble numerous services into coherent business flows, efficiently and effectively, then operate them for months and years, and keep them up to date as all these APIs evolve? How do you even know all the integration endpoints and flows you have at any given time?\nAt MuleSoft, we&#x27;re already solving this for thousands of companies, but now we&#x27;re taking it to the next level, with CloudHub: a cloud-based environment which pairs with the widely-adopted on-premise Mule &quot;bus&quot; to be the nexus of an entire enterprise&#x27;s integrations. In short, CloudHub is where modern enterprises run their integration glue.\nAnd that&#x27;s why MuleSoft has incredible momentum with some of the biggest companies in the world.<p>Where do you come in?<p>First, MuleSoft is investing heavily in our CloudHub platform. Since it&#x27;s a new product, there&#x27;s very little legacy; and since we&#x27;re still a startup, you get to be a big part of a small team with a very broad impact. This is not a place to rest on your laurels: this is a place to make your mark on the world.<p>Second, you get to work on great technologies: single-page Ajax apps; client-side MVC using backbone.js building on RESTful back-end APIs; Twitter bootstrap and jQuery; LESS; grunt; node.js, of course; perhaps you&#x27;ll bring in some other new technology to the stack.<p>Finally, and maybe the coolest part: since Mule already has the world&#x27;s biggest companies on board, CloudHub will have the backing of the biggest customers to drive adoption of standards, technologies, coding paradigms, etc. So this stuff is poised to make a huge impact.<p>And you? You already know you can create killer UI&#x27;s based on the work of designers and your own creativity; and it&#x27;s a given that you&#x27;re a master of all things HTML5&#x2F;CSS3&#x2F;JavaScript. But isn&#x27;t it time you turned your attention to a really, really big problem?<p>Click here if you&#x27;re interested\n<a href=\"http://hire.jobvite.com/j/?cj=o9SBXfwj&amp;s=ycombinator\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?cj=o9SBXfwj&amp;s=ycombinator</a>","time":1375379795,"type":"comment"}