{"by":"JeremyMorgan","id":6143181,"parent":6139927,"text":"Graphic Products - Beaverton, OR - Full-time, permanent - (<a href=\"http://www.graphicproducts.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.graphicproducts.com</a>)<p>PHP Web Developer (Beaverton Location)<p>Graphic Products is seeking a Web Developer to join our rapidly expanding Marketing Department. We are looking for dedicated and ambitious people who are eager to learn and grow with us. Our web development team is an agile, fast growing group that&#x27;s committed to building great solutions. If you&#x27;re looking for the energy and excitement of a start-up with the stability of an established company, we encourage you to apply. This is an exciting position with room to develop new skills. The candidate chosen will be a team player willing to handle various independent duties.<p>Required Technical Skills:<p>* Advanced knowledge of PHP<p>* Advanced knowledge of HTML and CSS<p>* Advanced knowledge of OOP with PHP 5<p>* Experience with PDO or ActiveRecord<p>Preferred Skills:<p>* PHP Object Oriented Programming<p>* HTML5 &#x2F; Responsive Design<p>* PHP Standards (Pear, FIG PSR 0-3)<p>* PHP frameworks<p>* MVC patterns<p>* CodeIgniter<p>* Familiarity JavaScript&#x2F;jQuery<p>We like to stay on the leading edge of web development and implement the following technologies:<p>* HTML5<p>* CSS3<p>* Responsive Designs<p>* JQuery<p>* JQuery UI<p>* Twitter Bootstrap<p>The working hours for this position will be decided on upon hire. No weekends or evenings. Health and Dental benefits are available after 90 days. \nWe also offer a 401k and competitive PTO.<p>We are seeking local candidates for this full time, in-house position.<p>To apply, e-mail your resume to:<p>job243@graphicproducts.com<p>Use the following format for subject line: Web Developer - LAST NAME -- FIRST NAME\n<i></i>Please be sure to include development samples or links to sites you have developed with your submission. <i></i>","time":1375388313,"type":"comment"}