{"by":"zinxq","id":6144356,"parent":6139927,"text":"Fulltime, Palo Alto  - funded Series A<p><a href=\"http://www.refresh.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.refresh.io</a>\npaul at refresh.io<p>Title: &quot;Rather Impressive Java Developer&quot;<p>Our current dev team is pretty awesome and we&#x27;re looking to add to it. Currently we have a few PhD&#x27;s, few ex-googler&#x27;s, some tech book authors, couple of ex-linkedin, ex-microsofties, and stanfords, and a bunch of startup vets like Trulia and dealer.com. Heck we even have the guy who wrote the Java testing framework TestNG ( <a href=\"http://www.testng.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.testng.org</a> ) and the guy who wrote Mailinator ( <a href=\"http://mailinator.blogspot.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mailinator.blogspot.com</a> ). And we&#x27;re only up to 7 people.  But we want an 8th and maybe a 9th.<p>Job Description:  \nSomeone we want to work with. Someone who will make us smarter and better and, in return, someone we can make smarter and better too. Someone who will help us make our company and its products great.<p>Our technology includes: \nJava. Thousands of threads (Mailinator guy keeps adding more, TestNG guy keeps removing them). Tons of data, tremendous data analysis, fuzzy logic, machine learning, natural language processing. We use Mongo and we&#x27;re having no problems with it - because we&#x27;re careful. We treat every  superfluous database access and every unnecessary network call like its a small insult to our users. And gosh darn it, we love our users.<p>Simply, we are building a product that fetches and analyzes massive amounts of data to improve our user&#x27;s lives (see the website for a more specific description, or better yet, email me)<p>Job Requirements: \nYou know Java (or at least you&#x27;re willing to learn it) - but hands-down you know some computer language cold.  You know it well enough to hate parts of it but yet probably understand why they&#x27;re there.  You get why algorithms are important and know when to implement them and sometimes, when its better to just do it the easy way. You understand that startups experiment a lot - and consequently discover amazing things occasionally, but throw away code far more often.<p>The static credentials on your resume are great but honestly, its the dynamic stuff we&#x27;re more interested in.<p>You&#x27;ve done stuff. You&#x27;re proud of the stuff you&#x27;ve done. You can show us - heck, you can&#x27;t wait to show us. It might be an iphone app, or an open source project, or a thread-safe cache-invalidation scheme, or a javascript game, or maybe you launched a startup. Either which way - you built something - start to finish. You can deliver.<p>The interview:<p>We love solving problems  and every interview question we ask is based on something we&#x27;ve actually had to code.  So we sometimes get rather excited to find a smart person willing to solve a problem a new way with us on a whiteboard. You should think this way too - you don&#x27;t rate interviews as being easy or hard - you rate them as being boring or fun. And we definitely shoot for fun.  Right answers aren&#x27;t the point - finding a good attack vector on the problem is.<p>Our CTO&#x27;s take on getting your resume Silicon Valley ready:  <a href=\"http://paultyma.blogspot.com/2012/05/how-to-get-your-resume-silicon-valley.html\" rel=\"nofollow\">http:&#x2F;&#x2F;paultyma.blogspot.com&#x2F;2012&#x2F;05&#x2F;how-to-get-your-resume-...</a>","time":1375399881,"type":"comment"}