{"by":"luminousbit","id":6144834,"kids":[6179789],"parent":6139927,"text":"Ruby on Rails Developer (REMOTE)<p>careers@chargify.com<p>Chargify.com is looking for a passionate Ruby on Rails Developer interested in joining our dynamic team. Your mission? Help build our ground-breaking recurring billing application developed by Grasshopper. We’re in an exciting growth phase right now. Not only will you have a chance to make your mark as a developer, but you’ll also get to work and interact with seasoned professionals and entrepreneurs deeply committed to revolutionizing this space.<p>Chargify&#x27;s ideal Ruby on Rails Developer is a multi-faceted individual who cares about the web and web standards, loves building apps using Rails, gets a rush from pushing the envelope in usability and interactivity, feels great when writing clean, well-tested code, and just &quot;gets it&quot; when it comes to building for today&#x27;s (and tomorrow&#x27;s) web. Yup, a tall order, but at Chargify, we only want the best.<p>Besides the right professional skills, how will you know if you&#x27;re the right fit for the Chargify team? Ask yourself--and be honest--are you fun, reliable, loyal, and interested in advancing both yourself and your team? If you answered in the affirmative, then you&#x27;re on the right track. So, if you’re an awesome Ruby on Rails Developer anywhere in the world, and you’re interested in getting involved in an exciting project at the ground level, then we want to hear from you.<p>Requirements<p>3+ years&#x27; experience building web applications\nPractical, demonstrable experience in building web applications using Ruby on Rails\nExperience building rich interactions with JavaScript&#x2F;jQuery&#x2F;AJAX\nKnowledge of relational database design and SQL\nThorough capabilities with (X)HTML and CSS\nExperience with test- or behavior-driven development\nStrong knowledge of version control systems (git) and application deployment\nExperience with testing frameworks such as Test::Unit or RSpec\nExcellent communication and documentation skills\nSelf-motivated and self-managed\nProven capability of working remotely\nAbility to work in a fast paced, deadline driven, dynamic environment\nA passion for the technologies of the web<p>Preferred Qualifications<p>Experience building billing applications (bonus)\nExperience in scaling web applications\nExperience exposing and consuming web services\nPreference for unobtrusive javascript\nStartup or small company experience\nEntrepreneurial tendencies\nOpen source contributions<p>Contact: careers@chargify.com","time":1375406812,"type":"comment"}