{"by":"greghinch","id":6144033,"parent":6139927,"text":"<i>London, UK</i> - We Are Pop Up - <a href=\"http://www.wearepopup.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wearepopup.com</a> - Full Time<p>We Are Pop Up is a community-driven marketplace for short-term commercial property leasing. The platform launched at the end of 2012, and has already given numerous creative entrepreneurs around the UK opportunities to engage the offline world in ways they never had before.<p><i>About the Role</i><p>We’re looking for an experienced Web Application Developer to work directly along side our Lead Developer and Creative Director, building features and scaling the platform. Someone who’s comfortable working with the whole stack, understands the principles of excellent software development, and wants to treat their code as their craft.<p>Primarily we build in a Django&#x2F;Python environment, but any relevant experience is great (as long as you are willing to learn Python). We’re looking for people with a few years of experience under their belt. Being an expert in SQL will get you a lot of points. We follow Agile development practices, and you’ll be shipping features frequently.<p><i>Skills and Attributes We’re Looking For (being 100% in all is not required, but candidates who are will receive preference)</i><p>- Experience building web applications from the bottom, up. Django&#x2F;Python experience preferred, but Rails&#x2F;Ruby, PHP, etc. is also great, so long as you’re a quick and willing learner<p>- Solid knowledge of SQL and related best practices. We use Postgres, but are happy with MySQL or similar experience<p>- Ability to work in Javascript&#x2F;HTML&#x2F;CSS. We use YUI 3 and Bootstrap. You certainly don’t need to be a designer, but you should be able to take on a feature and fully implement it, including all relevant front-end code<p>- General understanding of Solr&#x2F;Lucene search<p>- Experience deploying basic server infrastructure and with the Unix command line (being an expert SysAdmin is not required)<p>- Familiarity with code profiling and optimization<p>- Interested in things like Agile development, TDD, and pair-programming<p>- Work equally well in close coordination with others and independently&#x2F;self-directed. We’re a small team, so we’ll always be working closely, sometimes in pairs, but often you’ll need to be able to take on things on your own<p>- Legally eligible to work in the UK (mandatory)<p><i>More About Us</i><p>We’re a group of Brits and Americans who came together in the spring of 2012 to take on an ambitious idea cooked up by 2 of our co-founders in a pub one evening (where all good ideas start). We’re artists and environmentalists, consultants and entrepreneurs, engineers and educators. Collectively we’ve worked with Fortune 500s, government and the public sector, universities, creatives, small businesses, and (other) start-ups. We’re alumni of Springboard Mobile programme, and we’re looking to change the world.<p><i>Applying</i><p>Developer candidates <i>only</i>, please email jobs@wearepopup.com with the subject &quot;Interested in your Web Application Developer role, HN Aug 2013&quot;. Recruiters, prepare to be ignored at best, and possibly mocked (in other words, we&#x27;re not interested!)","time":1375396278,"type":"comment"}