{"by":"o0-0o","id":6144805,"parent":6139927,"text":"Full Stack Web Developer<p>Dealflow.com - New York, NY, USA (Wall ST)<p>Job Description:<p>Developer<p>Development is part of the Product Management team at Dealflow.com and is responsible for Dealflow.com’s development effort of our Dealflow.com product solutions.  Current projects include the design, development, and maintenance of cloud based software solutions related to deal marketing on the Internet.  Other projects involve systems &amp; networks administration duties, cross-functional teamwork with the Research &amp; Executive teams.<p>The Role:<p>The Developer will be a hands-on software developer involved in the build out of our new web application: Dealflow.com.  This senior member of the product team will manage and lead development with regards to our online, actively marketed, crowdsourced deal database software.  This database forms the central, integrated part of the Dealflow.com product.  The role will be a blend between front-end &amp; backend development.<p>The Developer is a creative team player that takes pride in crafting world-class products, is able to put together the whole picture, and believes in the value and opportunities of marketing deals on the Internet.  Dealflow.com is being designed to liberate all financial data by crowdsourcing the gathering and maintenance of certain financial data - in order to provide the highest quality active deal information to the entire general public.<p>Qualifications:<p>The ideal candidate will have at least 10 years of experience in core, full stack development including the development of complex, web-based software systems.  Financial experience is not mandatory, but would help the ideal candidate.  We develop in Node.JS, ElasticSearch, RabbitMQ, and SQL - so the successful candidate will have experience developing in these technologies, including scripting using PERL, Python, or another advanced, mature scripting language.  Strong JavaScript is mandatory.  In addition to development skills, the ideal candidate will have a good knowledge of crowdfunding, crowdsourcing, the JOBS Act, Regulation D, and General Solicitation.","time":1375406079,"type":"comment"}