{"by":"polyfractal","id":6146906,"kids":[6183924,6196249],"parent":6139927,"text":"Elasticsearch is hiring!  Most of our positions are location-independent (remote), but a few are for the Los Altos area.<p>Generic Hiring page: <a href=\"http://elasticsearch.com/about/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;elasticsearch.com&#x2F;about&#x2F;jobs&#x2F;</a><p>------------------------------------------ About Elasticsearch ------------------------------------------<p>We build an open source search and real-time analytics engine.  Elasticsearch is built on top of Lucene, so it benefits from the amazing capabilities that Lucene brings to information retrieval and general search.  Elasticsearch is distributed right out of the box and is designed to scale horizontally - sharding, dynamic cluster resizing, transparent search routing.<p>The company is almost entirely distributed.  I live in Charleston, SC - my colleagues live in Amsterdam, Prague, Barcelona, Bucharest, Nashville, Atlanta and San Francisco.  The talent at this company is truly amazing, I feel like a small fish in a very big pond every day.  And it&#x27;s a great feeling, I&#x27;ve learned so much since joining the company.<p>If you want to get in with a company that is making waves, learn from truly excellent developers about distributed systems, then Elasticsearch is the place for you.<p>Ok, enough gushing.  Here are the positions (I&#x27;ve never made a job ad before, I&#x27;m just a dev...if you have questions let me know!):<p>------------------------------------------ Front-end Developer [Los Altos] ------------------------------------------<p>Our sites are built in WordPress (yeah, sorry...) and we need someone that is capable of building custom features, managing scalability&#x2F;performance and can generally mash WP into submission.  For example, we have a custom plugin that imports Jekyll docs from Github and converts them to WP pages.<p>* Strong experience in PHP, WordPress customization, HTML5&#x2F;CSS3, JS<p>* Rapid prototyping of our two web properties<p>* Build landing pages to support marketing campaigns<p>* Responsible for performance, scalability, latency on client, etc.<p>Email zachary.tong@elasticsearch.com with a resume or portfolio, I&#x27;ll send back some more details.<p>------------------------------------------ UI&#x2F;Visualization developer [Remote] ------------------------------------------<p>A problem with &quot;big data&quot; is that it is often very hard to visualize.  We are working on ways to make data more manageable, and are looking for someone to take a lead role in developing&#x2F;creating new visualizations.<p>* Strong JS developer (framework agnostic, although we do have a lot of Angular and Ember folks here)<p>* Experience with a visualization framework (ideally D3)<p>* Worked with large amounts of data, and be capable of transforming this data into a visualization<p>* Portfolio would be great!<p>Email jobs@elasticsearch.com<p>------------------------------------------ Distributed Systems Developer [Remote] ------------------------------------------<p>Distribution and management of data across a cluster is what defines Elasticsearch.  We are looking for someone who will own this part of the core product and work to improve our distributed model.  Ideally the candidate will have previously implemented Paxos, RAFT, Zookeeper or some other distributed algorithm.<p>* Strong Java programming skills<p>* Experience with distributed systems, node communication and management<p>* Knowledge, use or development of cluster management algorithms like Paxos, RAFT, and Apache Zookeeper<p>Email jobs@elasticsearch.com<p><a href=\"http://elasticsearch.com/job/distributed-systems-software-engineer/\" rel=\"nofollow\">http:&#x2F;&#x2F;elasticsearch.com&#x2F;job&#x2F;distributed-systems-software-en...</a><p>------------------------------------------ .Net Developer [Remote] ------------------------------------------<p>We have programmers working in many different languages (Python, Ruby, PHP, etc) but are lacking .Net.  We are looking for a  dev to take the lead on all things .Net<p>* Innovate and lead our .NET development efforts and contribute to technical architecture, design, code, and test areas that you own.<p>* Collaborate with other development teams, quality engineering team, and documentation team to execute on product deliverables.<p>* Evangelism of our product to the .NET community at large.<p>Email jobs@elasticsearch.com<p><a href=\"http://elasticsearch.com/job/net-software-engineer-2/\" rel=\"nofollow\">http:&#x2F;&#x2F;elasticsearch.com&#x2F;job&#x2F;net-software-engineer-2&#x2F;</a><p>------------------------------------------ Java Software Developer [Remote] ------------------------------------------<p>Catchall job category.  Are you a great Java programmer?  Have you worked with Elasticsearch before?  You should apply!  We are always looking for more core developers.<p>Email jobs@elasticsearch.com<p><a href=\"http://elasticsearch.com/job/software-developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;elasticsearch.com&#x2F;job&#x2F;software-developer&#x2F;</a><p>------------------------------------------ Support Manager [Remote] ------------------------------------------<p>* Insuring customer issues are resolved within our committed service level agreements.<p>* Drive market-leading customer satisfaction rates, with proactive engagement of unsatisfied customers to ensure issues resolved.<p>* Build out the internal team, tools, and processes to optimize an efficient and effective support structure.\n* Develop real-time metrics, which track performance of the support organization.<p>* Maintain strong relationships with our technical team for the delivery of support, and sales team in the selling our support products.<p>Email jobs@elasticsearch.com<p><a href=\"http://elasticsearch.com/job/support-manager/\" rel=\"nofollow\">http:&#x2F;&#x2F;elasticsearch.com&#x2F;job&#x2F;support-manager&#x2F;</a>","time":1375452206,"type":"comment"}