{"by":"kevbo","id":6149494,"parent":6139927,"text":"Evanston, IL - Full Time (onsite), Permanent<p>Ruby Engineer at Leapfrog Online (<a href=\"http://www.leapfrogonline.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leapfrogonline.com&#x2F;</a>)<p>Leapfrog Online, an Evanston, IL-based direct digital marketing company, is seeking a Ruby Software Engineer to build and maintain high-traffic web sites using the Rails web framework for Leapfrog Online business units. This position makes extensive use of open source software to solve interesting problems. Scrum is practiced in all of our development teams, but we don’t require previous experience in Agile methodologies.<p>Are you a self-starter that holds high performance goals? Are you high energy and adaptable with an entrepreneurial mind-set? Can you successfully manage multiple projects simultaneously? Are you a good communicator who works well in teams? Do you have experience with open-source software or programming in Ruby? Are you able to recognize patterns in application behavior based off experiences with web-based technologies? If so, we are looking for you!<p>Responsibilities:<p>- Building and maintaining high-traffic web sites using the Rails web framework\n - Participating in project planning to review user stories, wireframes, and product specifications and applying them to your software designs\n - Presenting your ideas and demonstrating your work to technical and non-technical audiences in writing and in person.\n - Working with other team members to pair on programming and perform regular code reviews\n - Troubleshooting and advising on solutions to complex software issues\n - Developing automated test cases and test suites to ensure initial and ongoing quality in our software<p>Qualifications:<p>- Bachelor’s degree and 2 or more years’ experience relating to web-based software development using open source technologies\n - Real-world experience using Ruby application frameworks (such as Rails) to build high-traffic web sites and applications\n - Thorough understanding of common web application concepts and technologies, such as HTTP, SSL, XML and associated technologies, content management concepts, public-key cryptography, application and data security and privacy issues, and basic TCP&#x2F;IP networking\n - Non-trivial experience with any SQL-based RDBMS (PostgreSQL experience is especially useful)\n - Comfortable in the world of HTML, CSS and JavaScript\n - Knowledge of version control systems (especially Git)<p>For more information and to apply: <a href=\"https://hire.jobvite.com/j?cj=oBOpXfwv&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?cj=oBOpXfwv&amp;s=Hacker_News</a>","time":1375475712,"type":"comment"}