{"by":"bforgione","id":6149803,"parent":6139927,"text":"Levels Beyond, Inc. - Denver, CO - Full Time (<a href=\"http://levelsbeyond.com\" rel=\"nofollow\">http:&#x2F;&#x2F;levelsbeyond.com</a>)<p>Job Title: Developer&#x2F;Senior Developer<p>About Us\nLevels Beyond is a disruptive player in the new Video Ecosystem, providing products and solutions built on the Reach Engine platform. Reach Engine is powering the largest video libraries and distribution networks in the world, connecting content owners and creators with the devices and platforms their consumers demand.<p>About the Position\nYou&#x27;ll have the ability to leverage your Flex development experience to support our engaging user interfaces.  On the UI side, you have a good working knowledge of and expertise in Flex while being willing and able to support some of our HTML5 development work.  Doing this well, you will be part of our team, propelling the future of video forward, integrating with best of breed partner tools and APIs, and exposing our industry-leading video management and delivery software to the cloud.<p>We are looking for you if…\nYou are a polyglot. Some of our best developers believe this personal definition fits what we do at Levels Beyond. You like working with the latest technologies. You like to have the opportunity to take ambiguous requirements, break the problem down into understandable segments and get the job done for the customer. You have a willingness and ability to challenge our status quo while recognizing our path. In other words, you possess a blend of confidence and humility.<p>Your Skills and Credentials\n * Flex 4 &#x2F; ActionScript 3\n * Ability to support HTML5 development efforts\n * Relational DB knowledge, can read&#x2F;write&#x2F;modify moderately complex SQL\n * RESTful web service creation &#x2F; consumption\n * Ability to interface with clients from top-tier companies\n * 4-7 years of experience<p>Nice To Have &#x2F; Desire to Learn\n * Java application development\n * Experience with an ORM framework\n * NoSQL (Mongo, Cassandra, ect.)\n * Knowledge of the RobotLegs framework\n * Experience working in an Agile environment with daily Scrums\n * B.S. in Computer Science or a related degree. (preferred, not required)<p>Our Work Environment\n * Horizontally mobile\n * Less hierarchy-more unity\n * Driven toward strong ownership\n * Intensity to solve problems for clients\n * Political free zone\n * Autonomy\n * You recommend, we listen, you implement\n * Peer and personal responsibility\n * Food and drink abound\n * Work hard&#x2F;play hard - Hackathons and Company Happy Hours\n * Downtown Denver in RiNo<p>The Perks\n * 3 weeks vacation\n * 10 paid holidays\n * New Macbook Pro, external monitors, ect.\n * Health, Dental, Vision...what you would expect\n * Huge opportunity for career growth!<p>Please contact Bill Forgione &lt;bill@levelsbeyond.com&gt; to learn more.","time":1375479019,"type":"comment"}