{"by":"cmhylton","id":6161609,"parent":6139927,"text":"Interface Vision - Santa Cruz, CA - Cooper Street<p>You are bored at work. You are distraught. Your tests aren’t passing because green is the new red. You want to be a part of something that will change the future. You wish you were challenged more. So, you check us out at <a href=\"http://www.interfacevision.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.interfacevision.com</a>.<p>Wow, you think. A visual language of some kind? It’s been attempted before by many brilliant people. You ponder if they have some magical solution or have been partaking in some illicit chemical “exploration.”<p>Then you realize that, if a holy grail did exist, the way we make software would change forever. You see the “Vision”.\nSo, you contact us.<p>About the Position:\n* You are given the freedom to create.\n* You must be open minded, have the ability to speak your mind and also be willing to listen.\n* Optimally, we would like you to be with us in Santa Cruz, CA. However, if we can pull it off, you can work from anywhere (We’re going to be implementing remote collaboration, so we might as well eat our own dog food).\n* The magic is done in C# Mono with Xamarin.iOS and Xamarion.Android (www.xamarin.com). Xamarin is an awesome company. Go check them out if you haven’t already.\n* We don’t have a specific software development position to fill so tell us what you would bring to the table and what you want to do - we will listen to everyone.\n* We really need help extending our GUI for both iOS and Android.\n* We are interested in extending our framework to include OpenCL, OpenGL, REST (and general API support), extensive math library, etc.<p>Your Abilities:\n* What is your specialty?\n* What do you like to work on?\n* What have you done?\n* Why do we want you?<p>We can’t wait to hear from you - simply check out our career section on-line at <a href=\"http://www.interfacevision.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.interfacevision.com</a> and send us your info and resume&#x2F;CV (depending on where you are from).","time":1375725014,"type":"comment"}