{"by":"hurdleress","id":6187359,"parent":6139927,"text":"Counsyl: Medicine is now a software problem. Join us to write code that matters.<p>Software Engineer - South San Francisco, CA - Full-time<p>Counsyl&#x27;s goal is to make the human genome practically useful for life-altering decisions. Over the last few years, we’ve grown from a Stanford dorm room to become one of the largest clinical genome centers in the world. Our pre-pregnancy genetic test is now prescribed by physicians for more than 2.5% of all births in the United States.<p>TechCrunch covered Counsyl at our recent tech talk: <a href=\"http://techcrunch.com/2013/04/23/counsyl/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;04&#x2F;23&#x2F;counsyl&#x2F;</a><p>Watch our tech talk &quot;Genomics at Web Scale&quot; <a href=\"https://vimeo.com/63141778\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;63141778</a><p>The cost of sequencing human genomes is plunging - over 5x faster than the cost of computing; the potential impact on preventive healthcare and the medical landscape is boundless. The science is there but the scale isn&#x27;t. That&#x27;s where Counsyl comes in. We are building the technology platform to make genomics useful and accessible to everyone.<p>Software is at the heart of Counsyl<p>The vast majority of our operations are powered by our own custom-built infrastructure on a Python&#x2F;Django&#x2F;Postgres stack, from ordering to lab processing to billing. We’re building new tools, new workflows, and new infrastructure to solve the challenging problems of a technology startup involved with not just bits, but also interconnected physical components like lab robotics and patient samples.<p>Don’t be intimidated if you don’t have a genomics background; solving these problems fundamentally requires software solutions. We’re looking for the best and brightest software engineers — strong generalists with solid CS fundamentals and practical software engineering intuition — to help us scale up genomics to billions of users.<p>Prerequisites:<p>- Working towards a BS, MS or PhD in Computer Science (or equivalent experience)\n- Strong software engineering fundamentals: design, testing, version control\n- Significant independent programming experience as demonstrated by a GitHub account, personal web page or prior internships.<p>We like to see experience with:<p>- Python, Django, CoffeeScript, Backbone.js, Bootstrap, HTML5, CSS\n- NumPy, SciPy, scikit-learn\n- Relational database systems, such as PostgreSQL\n- Unix, Git, and other command line tools<p>What you&#x27;ll do:<p>- Move fast without breaking things :)\n- Start in the areas you&#x27;re familiar with, and grow to work on the full stack\n- Work closely with a small, tight-knit team\n- Develop algorithms and code for all aspects of clinical genomics, from machine learning to supply chain optimization to insurance billing\n- Quite literally save lives with your keyboard<p>Perks:<p>- Competitive compensation and benefits\n- Generous equity package in a fast-growing startup\n- Catered meals every day plus a fully stocked kitchen\n- On-site gym access to work it off\n- Dry cleaning and laundry service<p>Apply Today! <p>Full-Time Software Engineer: <a href=\"https://www.counsyl.com/jobs/software-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;software-engineer&#x2F;</a><p>Product Design: <a href=\"https://www.counsyl.com/jobs/product-design-web-htmlcss/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;product-design-web-htmlcss&#x2F;</a><p>We have other positions in Sales, in our Genome Center and in Operations. Check them out at jobs.counsyl.com","time":1376072508,"type":"comment"}