{"by":"nosh","id":16283969,"parent":16282819,"text":"HealthRhythms | Backend Engineer, Full-Stack Engineer &amp; Data Scientist | New York City | ONSITE<p>At HealthRhythms [<a href=\"http:&#x2F;&#x2F;healthrhythms.com\" rel=\"nofollow\">http:&#x2F;&#x2F;healthrhythms.com</a>] we are working to make it easy to measure and care for everyone’s mental health. Our products leverage real-time mobile measurements with data analysis and modeling to create truly personalized just-in-time interventions. We are helping people and their clinicians detect and characterize their mental health from passively available data from their mobile phones.<p>We are funded by the NIH as well as seed investors, and we work with researchers, hospital&#x2F;healthsystems, as well as pharma companies. You can read a recent news article here: <a href=\"http:&#x2F;&#x2F;www.mobihealthnews.com&#x2F;content&#x2F;healthrhythms-behavioral-health-platform-snags-21m-nih\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mobihealthnews.com&#x2F;content&#x2F;healthrhythms-behavior...</a><p>We&#x27;re looking for independent thinkers who care deeply about the problems we&#x27;re solving. Our mission is to redefine not only how we measure and treat mental illness, but how we optimize wellbeing as a whole. If being one of the first 10 employees at a promising startup in healthcare sounds exciting to you, please get in touch.<p>Positions:<p>Backend Engineer (Python, AWS) - Our backend runs on AWS, is primarily built in Python, and uses services such as AWS Lambda, DynamoDB, RedShift, etc. We are looking for someone who is well versed in both Python and AWS. Responsibilities will involve automating and scaling our current data pipeline, as well continuing to build out our data capture and data analytics capabilities.<p>Details are here: <a href=\"https:&#x2F;&#x2F;healthrhythms.com&#x2F;jobs&#x2F;backend-engineer-jan-2018.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;healthrhythms.com&#x2F;jobs&#x2F;backend-engineer-jan-2018.pdf</a><p>Full-Stack Engineer - We are additionally looking for an engineer that can help with both our front and backend. We have a set of web dashboards that researchers and clinicians use to view and interact with the data we capture. Our dashboards use Angular (though we are considering moving to React) and our backend is built with Python. You&#x27;ll be responsible for building out our dashboard capabilities and helping implement the APIs and infrastructure (built on AWS) used to power the dashboards. Depending on your skill set (e.g. more backend focussed) there are similarities with the Backend Engineer position posted above<p>Details are here: <a href=\"https:&#x2F;&#x2F;healthrhythms.com&#x2F;jobs&#x2F;full-stack-engineer-jan-2018.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;healthrhythms.com&#x2F;jobs&#x2F;full-stack-engineer-jan-2018....</a><p>Data Scientist - We are looking for a mid or senior level data scientist  to help drive our efforts in data analysis and machine learning. Primary responsibilities will include analyzing our sensor data to better charecterize patients&#x27; behavioral patterns, and developing algorithms for personalized just-in-time interventions to assist patients whose mental health is deteriorating.<p>Details are here: <a href=\"https:&#x2F;&#x2F;healthrhythms.com&#x2F;jobs&#x2F;data-scientist-jan-2018.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;healthrhythms.com&#x2F;jobs&#x2F;data-scientist-jan-2018.pdf</a><p>Email us your resume and tell us a bit about yourself at jobs@healthrhythms.com<p>We&#x27;re looking forward to hearing from you!","time":1517507664,"type":"comment"}