{"by":"jaustin","id":16283583,"parent":16282819,"text":"Micro:bit Educational Foundation | Lead Developer - website and services (fullstack) | Oxford, UK | ONSITE with flexibility, Full-time<p>The Micro:bit Educational Foundation (<a href=\"http:&#x2F;&#x2F;microbit.org\" rel=\"nofollow\">http:&#x2F;&#x2F;microbit.org</a>) is a not-for-profit with the global vision of helping every child to be an inventor. We are enabling children around the world to get creative with technology and learn to code in school, in clubs and at home. We do this primarily through educational programs based around the BBC micro:bit board, and building technology that just works for teachers and students in a school environment.<p>To do this we&#x27;re looking for a committed, flexible and collaborative software engineer to lead the development, deployment and maintenance of our systems and web presence at microbit.org.<p>This site is the first port of call for millions of students and teachers around the world who are learning about coding and technology using the BBC micro:bit. The role will require you to work with a range of languages and tools; we need someone who can start with what we have and lead the creation of our next generation platform.<p>Alongside this you will start to develop our community portals, ecosystem and accessory listings, and work with upstream communities to enhance the micro:bit code editors (makecode.microbit.org is Typescript and python.microbit.org is Javascript+Python). Our current stack includes Ruby&#x2F;Jekyll and CircleCI deployments to AWS.<p>More info <a href=\"https:&#x2F;&#x2F;micro-bit-educational-foundation.workable.com&#x2F;j&#x2F;E27CE5D6E4\" rel=\"nofollow\">https:&#x2F;&#x2F;micro-bit-educational-foundation.workable.com&#x2F;j&#x2F;E27C...</a><p>As well as building our own suite of sites and services, we also need to be confident contributing to and staying on top of other open-source tools that our partners are developing in conjunction with us. Most significantly, these are Typescript (makecode.microbit.org) and JS+Python-based (python.microbit.org)<p>It&#x27;s awesome working for a creative not-for-profit that&#x27;s all about broadening the range of people that get excited by computing. We&#x27;re flexible about office hours, working style, and the team&#x27;s built from people passionate about EdTech. This person will be hiring other team members as we grow.<p>We&#x27;ve only got the web tech lead job up right now, but all future jobs will go up here: <a href=\"https:&#x2F;&#x2F;micro-bit-educational-foundation.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;micro-bit-educational-foundation.workable.com&#x2F;</a>","time":1517505150,"type":"comment"}