{"by":"manoa","id":16283924,"parent":16282819,"text":"Envoy | All types of software engineering jobs | San Francisco, CA | Full-time | ONSITE, REMOTE | <a href=\"https:&#x2F;&#x2F;envoy.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;envoy.com&#x2F;</a><p>San Francisco, CA - SOMA\nDistributed - we have 1&#x2F;3rd of our team working full-time remotely.<p>Continental US time zones preferred so we can easily collaborate. Visa transfers ok and we support new green cards. New visas only if straightforward.<p><a href=\"https:&#x2F;&#x2F;envoy.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;envoy.com&#x2F;jobs&#x2F;</a>\nApply here!  <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;hs2m7P\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;hs2m7P</a><p>Envoy is on a mission to make the office feel effortless. We create technology that does its job, so people can focus on theirs. For us, it started with the front desk. Signing in with paper and pen used to be the norm, but Envoy set a new standard. It’s simple: Now, visitors everywhere are signing in on iPads.<p>To date, Envoy has helped our customers like Slack, Box, Github and Pinterest welcome over 21 million visitors in more than five thousand offices worldwide. But visitor management is just the beginning: We’re building a world where you know instantly when packages are delivered; where your office unlocks securely and automatically when you arrive; where you can book a meeting room simply by walking through the door.<p>If this world sounds exciting, we&#x27;d love for you to help us build it.<p>We’re always looking for our next great teammate. Our team is a mix of product engineers creating beautiful, finely polished experiences and folks focusing on scale, reliability, security, and performance. Challenging the status quo of workplace technology is a big problem with almost every type of technical challenge, so we look for fully-formed engineers that love solving problems and finding the best tools for the job.<p>Our stack is built on PostgreSQL, Redis, Elixir, Ruby, Javascript (Ember,js, React Native), and a few more things and we’re currently hosted on Heroku with some AWS (mostly Lambda), though we are constantly reevaluating as we scale.<p>We value being a top-notch organization with a strong engineering-driven culture, and have the same high standards with our code, systems, and people. We value learning and growth (and not being bored) and hire diverse, well-rounded, communicative people we can envision being friends with and trusting. Our projects tend to be 2 engineers max, so trust and accountability is required for us to work. Also helps us keep processes &amp; overhead low. We appreciate that we&#x27;ve built a reasonably-sized, high-powered team so far (61 employees including 29 engineers) and are always striving to be the best place to work we can be.<p>If this sings to you, come join us!","time":1517507340,"type":"comment"}