{"by":"ndonnellan","id":16287084,"kids":[16287510,16287492],"parent":16282819,"text":"athenahealth (<a href=\"https:&#x2F;&#x2F;www.athenahealth.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.athenahealth.com&#x2F;</a>) | Austin, TX | Full-time | Onsite | Dev, Architect, Dev-Manager, UX&#x2F;Design<p>Keep hearing about how crappy healthcare software is and how much healthcare is a blood sucking vampire squid on the economy? Come join me at athenahealth! No, not the insurance company that has a different name!<p>We make electronic health records and practice management software, but that includes a whole heck-of-a-lot of things including the stuff I work on which is web and mobile care-management for literally everyone.<p>My team specifically needs a mobile software engineer and a web engineer (we have multiple apps running off of React&#x2F;React Native (some typescript, redux, graphql, git, automated testing), a separate team supports us as platform, so we&#x27;re front-end client only software). We also are looking for a UX designer to make designs&#x2F;mockups&#x2F;prototypes for our scrum team and and lead design decisions for provider (e.g. doctors&#x2F;nurses&#x2F;care-managers) facing applications. This is a really really cool opportunity to insert our code, written once, into all parts of existing athenanet applications as well as the potential to leave the walls of our network and impact even more software.<p>We work in the coolest building downtown (Seaholm Power Plant) and have the coolest people (no jerks need apply).<p>Additional roles: a software architect and a dev manager! My zone (5 scrum teams) needs an architect and some other zone needs a dev manager. So lots of hiring going on here! Plz email me at either the email listed in my profile or my username at my company&#x27;s domain.<p>Moar info here: <a href=\"https:&#x2F;&#x2F;www.athenahealth.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.athenahealth.com&#x2F;careers</a><p>Be a part of the mission to #unbreakhealthcare<p>#cornyphrase #hrmademedoit","time":1517529257,"type":"comment"}