{"by":"shiratu","id":16284017,"kids":[16289491],"parent":16282819,"text":"Microsoft | Software Engineers | Bellevue, WA | ONSITE | Full Time<p>Microsoft Flow - <a href=\"http:&#x2F;&#x2F;flow.microsoft.com\" rel=\"nofollow\">http:&#x2F;&#x2F;flow.microsoft.com</a><p>Do you want to be part of a diverse team that has moved from incubation into full-scale product development? Are you looking for opportunity to work with multiple technologies and partner with multiple teams inside Microsoft and across the industry? Be a part of Microsoft Flow, a V1 SAS service built on top of Azure.<p>Microsoft Flow is part of the Business Application Platform (which includes PowerBI and PowerApps) and allows you to build workflows that join actions from more than 200 diverse REST services. We live the cloud-first and mobile-first mantra - our offerings are in the cloud backed by strong mobile offerings. \nOur culture is diverse, agile, and fun. We shipped a General Availability (GA) service a year ago and we are just getting started - key Microsoft Partners like SharePoint and Teams are committed to using us for their workflow scenarios.<p>We have multiple openings across the team and we are looking for strong developers to help us:\n * develop experiences on the portal for building, editing, debugging and monitoring workflows\n * expand our mobile footprint - our platform extends to mobile in interesting ways\n * enable 1st party and 3rd party applications&#x2F;partners to use Microsoft Flow as an extensibility platform\n * deliver the core infrastructure and user experience for flow management, packaging, lifecycle, security and administration<p>We are a full stack shop, you will be responsible for the delivery of the features end to end including required improvements to backend services and web portals. We need someone who is hands-on and passionate about building an extraordinary user experience.<p>Basic Qualifications: \n - 5+ years of professional software development experience in either C#, JavaScript or C++<p>Preferred Qualifications:     \n - Degree in computer science OR engineering or a minimum of 4 additional years of industry experience\n - Experience in Web technologies like HTML5, CSS3, JavaScript, TypeScript, AngularJS, React, Knockout.js or Twitter Bootstrap   \n - Experience in building scalable web services and SaaS offerings   \n - Experience with Azure or other Cloud Providers\n - Distributed systems experience<p>Please apply here:\n<a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;jobdetails.aspx?ss=&amp;pg=0&amp;so=&amp;rw=1&amp;jid=344953&amp;jlang=en&amp;pp=ss\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;jobdetails.aspx?ss=&amp;pg=0&amp;so=&amp;r...</a>","time":1517507932,"type":"comment"}