{"by":"rcruzeiro","id":16283789,"parent":16282819,"text":"REMOTE or ONSITE (London) Android Native Developer – Pony Bikes <a href=\"http:&#x2F;&#x2F;getapony.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;getapony.com&#x2F;</a><p>Pony Bikes is the smartest bike sharing system in the world, aiming at putting everyone on the planet on a bike. We have successfully launched in the UK and France with hundreds of Pony bikes grazing around.<p>No docking. No hassle. No limits.<p>The role: We are looking for a talented and experienced Android developer to own the Android app development effort. The app is an essential part of the product and is the main point of contact with the customers. This means that the app must be top quality and resilient (as our users might be using the app in less than ideal conditions e.g. poor connectivity, low GPS precision).<p>You will be working directly with the Head of Mobile to ensure that the app is consistent both in terms of UX and architecture with the existing iOS app (which is currently a bit more developed than its Android counterpart).<p>Main role: - Evolve our Android app from MVP to world-class app - Make sure that the UX is perfect and our users have a seamless experience while riding our bikes - Ensure that the app will work in several regions and languages (Pony Bikes is currently operating in Oxford, UK and Angers, France)<p>The ideal candidate: - Excellent communication skills (English) - Strong self management skills - Previous experience with RxKotlin is a huge plus - Shipped a world-class app before (preferably more than once) - Must be capable of owning the Android development. You&#x27;ll be part of a small team where every contribution counts, and you&#x27;re encouraged and expected to deliver great value to our loving customers<p>Details: - Competitive Pay (£35k - £60k) - Equity &#x2F; stock options - Free biking!<p>More details here: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;pulse&#x2F;you-strong-android-developer-..\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;pulse&#x2F;you-strong-android-developer-...</a>.<p>jobs@ponybikes.co","time":1517506450,"type":"comment"}