{"by":"mbaird","id":16283574,"parent":16282819,"text":"Koru Kids | London | Full-time Onsite | Full Stack Ruby Engineer #2 | <a href=\"https:&#x2F;&#x2F;www.korukids.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.korukids.co.uk</a><p>Koru Kids is growing quickly. We’re on a mission to improve childcare in London, and looking for someone experienced, creative &amp; friendly to join the team as our second full stack engineer.<p>We’re building a marketplace that enables families to find and share great quality nannies. To do this, we’re building great software for our families, supporting our matching team with critical tools that make complex matching problems a breeze, and using technology to supercharge our nanny recruitment and training processes.<p>We’re continuously improving our product, building key features that will move the needle in a big way. Instead of an endless product roadmap, we run short development cycles to test assumptions and make smart decisions quickly. This isn’t a sprint and there’s no project managers, we work closely with the rest of the business to make sure we deliver the most value to our customers.<p>Our stack uses Ruby for most of the backend, with Rails, PostgreSQL and Redis making up the majority of our core product. We use modern front end tooling, with ES6, React and Tachyons. When it comes to shipping code, we love GitHub code reviews and making CircleCI happy before anything gets into production. We mostly deploy to Heroku, with some heavy lifting on AWS. We favour feature flags over staging environments and deploy to production as often as we need to; deployment cycles shouldn’t get in the way of delivering value.<p>We’re looking for an experienced Ruby developer who thrives in small, fast-moving engineering teams.<p>If this sounds interesting, you can read more &amp; apply at <a href=\"https:&#x2F;&#x2F;korukids.workable.com&#x2F;jobs&#x2F;622008\" rel=\"nofollow\">https:&#x2F;&#x2F;korukids.workable.com&#x2F;jobs&#x2F;622008</a> or email me directly at michael [at] korukids.co.uk","time":1517505123,"type":"comment"}