{"by":"jaydestro","id":16284919,"parent":16282819,"text":"MongoDB  | Full Stack Engineer, Cloud Services, Monitoring | New York City | On-Site | full time<p>MongoDB Cloud Services Team is a diverse collection of individuals working together to help our users run MongoDB in the cloud at global scale. The Cloud Team is responsible for MongoDB Atlas - our database as a service offering and fastest growing product. MongoDB Atlas allows users to deploy fault-tolerant, globally distributed MongoDB clusters in just minutes.<p>We’re seeking a Full Stack Engineer to join our Cloud Monitoring team. The mission of the Cloud Monitoring Team is to help our users understand the health and performance characteristics of their MongoDB deployments, and to provide guidance to users on how to improve performance. The Monitoring Team runs systems responsible for the collection of metrics from hundreds of thousands of customer MongoDB instances, as well as for all the visualizations and analysis tools that we present to our users from the 5+ billion data points we collect per day.<p>We&#x27;re looking for someone who is\nComfortable working across the stack of a modern web application\nSkilled at writing backend systems in a compiled language (Java, C#, Go, etc.)\nEnjoys chasing down tough problems in a distributed systems environment\nAlways striving to expand their knowledge\nCurious, collaborative and intellectually honest\nResponsibilities\nWork closely with product teams, considering the user’s perspective while helping the team achieve success\nCollaborate with team members over best practices and core concepts\nHold yourself accountable to your actions, maintaining the balance between accomplishing goals with research &amp; development\nOwn our core values and adhere to them in your work, and\nStay up to date with best practices in web engineering\nSuccess Measures\nA Full Stack Engineer will be successful in this role when they:<p>Are open, honest and willing to contribute and collaborate with others\nDevelop confidence in finding their way across the platform\nCan take responsibility for the planning and execution of a major feature, representing Engineering when working with Product and Design\nAre willing to learn and contribute to all parts of the stack\nAre resolute in their approach to problem solving, balancing the needs of their team with the willingness to get to the bottom of issues<p><a href=\"https:&#x2F;&#x2F;www.mongodb.com&#x2F;careers&#x2F;jobs&#x2F;837489\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mongodb.com&#x2F;careers&#x2F;jobs&#x2F;837489</a>","time":1517512898,"type":"comment"}