{"by":"enoren","id":16283693,"parent":16282819,"text":"FanThreeSixty | Lead&#x2F;Senior Software Developer | Austin, TX | ONSITE | <a href=\"http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;</a><p>At FanThreeSixty we build software which enables sports teams and venues to better engage with fans to keep them connected to their teams they love by providing more personalized and fluid experiences whether at game time or in the off-season. Headquartered in Kansas City, MO, we are hiring in both KC as well in Austin, TX for multiple development positions to help expand our data science and data intelligence capabilities for real-time intelligence, recommendations, and predictions. Interest in machine learning, analytics, data, and system design is a must as you will be heavily involved in each area of the system. You will also work directly with data scientists on the team to scale models for production and provide an efficient and available platform for analysis and insight.<p>The basics:<p>* 4+ years of professional Java or similar OO experience required with a strong grasp of development patterns and principles.<p>* Prior professional experience preferred, but not required, in one or more of Spark, Kafka, Cassandra, Hadoop, and&#x2F;or machine learning applications<p>* Ability to learn quickly and work independently desired as there is a remote component to this position as we are a distributed team with significant WFH flexibility. No fully remote positions available though as all applicants must be able to work in either the KC(downtown) or Austin(Domain) office, with a preference for Austin.<p>* Our interview process is fairly direct and painless with an hour phone interview and then a half day on-site before making a final decision.<p>* In addition to medical, dental and vision insurance, we also offer a competitive PTO package, matching 401k and reimbursement of attending 2 sporting events each year...for market research.<p>* Our Austin team is a small and growing team which affords numerous opportunities for flexibility, autonomy and growth with plans to expand size and scope aggressively throughout 2018!<p>You can find more details about working at FanThreeSixty on our site <a href=\"http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fanthreesixty.com&#x2F;careers&#x2F;</a>.<p>Please contact me directly with any questions or to send your resume(my email address is in my HN profile).","time":1517505840,"type":"comment"}