{"by":"alasano","id":16282967,"parent":16282819,"text":"Coveo | Frontend Developer | Montreal &amp; Quebec City, Canada | Full-time, ONSITE<p>To help us in the development of all the admin interfaces we offer our clients here at Coveo. These interfaces are built to allow our clients to configure our intelligent and personalised recommendations platform exactly the way they see fit. They also allow our clients to have access to a wide variety of usage analytics reports! If we’ve sparked your interest, you may be the one we are looking for! You&#x27;ll be making use of TypeScript, SASS, React, Backbone and our own homemade libraries such as Vapor (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;coveo&#x2F;vapor\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;coveo&#x2F;vapor</a>) and React Vapor (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;coveo&#x2F;react-vapor\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;coveo&#x2F;react-vapor</a>).<p>While we offer all the perks people come to expect of a job (great new offices, top of the line equipment, competitive salaries and insurance, unlimited cappucinos and snacks, nerf gun battles), we think the best part about working with us is simply being excited about going to work every day. On a day to day basis you&#x27;ll continually face interesting challenges, have great autonomy and you&#x27;ll be able to bring your ideas to the table knowing that your team genuinely wants to hear them.<p>Coveo is positioned as the top leader for Insight Engines in Gartner&#x27;s 2017 Magic Quadrant (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for-insight-engines&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-leads-gartner-magic-quadrant-for...</a>). We&#x27;re growing quickly and hiring talented, passionate developers to join our worldclass team. Our Montreal offices are brand new (<a href=\"http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.coveo.com&#x2F;coveo-montreal-finally-home&#x2F;</a>) and we&#x27;ve also rebuilt our entire Quebec City office to accomodate all our new hires in a great environment.<p>Interview Process: phone screen - interview - tech test - offer.<p>To get in touch : aasanovic@coveo.com","time":1517501663,"type":"comment"}