{"by":"kevinwuhoo","id":16287063,"parent":16282819,"text":"10x Genomics | Software Engineer | San Francisco &amp; Pleasanton, CA | Onsite, 10xgenomics.com<p>We&#x27;re a biotech company developing novel software, biochemical, and microfluidic systems to help scientists gain understanding of the mechanisms behind cancer, the immune system, and our many different cells. We&#x27;re looking to grow our software team of currently six engineers (including myself) to support the rapid adoption of our technology. Scientists are really excited about our technology as evidenced by the company seeing $71 million in revenue in 2017, which was more than double the revenue in 2016. We&#x27;re also looking to double our revenue again in 2018.<p>You can read about (and run if you&#x27;d like) our massively parallel pipelines as well as our visualization software at <a href=\"https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;</a>. We manage our pipelines with Go, develop analysis code using the NumPy&#x2F;SciPy stack, and drive our front-end applications with React&#x2F;Redux. No previous biological experience is required; we have plenty of computational biologists here to handle that, but if you&#x27;re interested, you&#x27;re more than welcome to learn! You&#x27;ll work with a group of engineers that are alums of YC, MIT, Harvard, Caltech, Google, Facebook, and more.<p>We&#x27;re currently hiring for several software roles including generalists, UI engineers, and QA engineers. Our computational biology group is also always looking for bioinformaticians who are experienced with NGS, and our company is always looking for scientists and engineers (hardware included). Here are some of the job postings we have up, but feel free to email me if you think you&#x27;re a good fit for another role.<p>- Software Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-engineer&#x2F;</a><p>- Senior UI Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-ui-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-ui-engineer&#x2F;</a><p>- Senior Software Engineer: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;senior-software-engineer...</a><p>- Software QA Engineer - <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-quality-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;software-quality-enginee...</a><p>Just a note that we do have an office in San Francisco even though the listings only specify Pleasanton. Our full page of job listings can be found at <a href=\"http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;</a>. Please reach out if you&#x27;re interested in working on high impact, genomic-scale big data problems using modern software development or even if you just want to chat. You can reach me at kevin.wu@10xgenomics.com or @kevinwuhoo.","time":1517528955,"type":"comment"}