{"by":"bjelkeman-again","id":16283238,"parent":16282819,"text":"Akvo | Two developers | Amsterdam&#x2F;Bangalore | REMOTE&#x2F;ONSITE | Full-time<p>Akvo is a not-for-profit foundation focused on making international development and country governance more effective, transparent and collaborative.<p>Backend developer - Akvo Lumen is open source software that helps international development organisations transform, analyse and visualise their data. Our partners use Lumen to create visualisations, maps and dashboards. We&#x27;re looking for a developer who can help on the back end, who can contribute to architecture and feature building.<p>Lumen stack includes React, Clojure, PostgreSQL, Windshaft, Keycloak, Kubernetes, CSS&#x2F;SASS, Docker. We&#x27;re a small remote team. We&#x27;re looking for someone who is self-motivated, good at taking ownership of tasks, speaks English, set up for remote work and willing to learn. We prefer that you are located CET plus&#x2F;minus 2 hours.<p><a href=\"https:&#x2F;&#x2F;akvo.org&#x2F;products&#x2F;akvo-lumen\" rel=\"nofollow\">https:&#x2F;&#x2F;akvo.org&#x2F;products&#x2F;akvo-lumen</a>\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;akvo&#x2F;akvo-lumen\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;akvo&#x2F;akvo-lumen</a><p>Frontend developer - Akvo RSR is open source software that helps international development organisations to monitor, report and share their data. Our partners use RSR to monitor the results of their projects, create reports and make the scope and range of their work visible.  We&#x27;re looking for someone with knowledge and experience in front end development and with an instinct and drive for designing excellent user experiences.<p>RSR stack includes CSS, React and Javascript.  We&#x27;re a small remote team. We&#x27;re looking for someone who is self-motivated, good at taking ownership of tasks, speaks English, set up for remote work and willing to learn. We prefer that you are located in Bangalore, India.<p><a href=\"https:&#x2F;&#x2F;akvo.org&#x2F;products&#x2F;akvo-RSR\" rel=\"nofollow\">https:&#x2F;&#x2F;akvo.org&#x2F;products&#x2F;akvo-RSR</a>\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;akvo&#x2F;akvo-RSR\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;akvo&#x2F;akvo-RSR</a><p>Interested? email us at\nwork@akvo.org","time":1517503230,"type":"comment"}