{"by":"arrtz","id":16287674,"parent":16282819,"text":"Worldwide, REMOTE, full time or part time -- 100% flexibility. $70-100&#x2F;hr. Expert Interviewer at Karat (<a href=\"https:&#x2F;&#x2F;karat.io\" rel=\"nofollow\">https:&#x2F;&#x2F;karat.io</a>)<p>Work from anywhere in the world that has a solid internet connection. Work as much or as little as you want. Work any day, any time of day, any number of hours -- you can do 0 one week, 50 the next week, and back to 0 the next week. Only requirement there is that we want you to roughly average at least 10 hours a week, or else the training&#x2F;time investment doesn&#x27;t make as much sense from your end or ours. When each interview is done, you&#x27;re done.<p>I know the above might sound a little strange, so a bit about the company for context: Karat is a Seattle-based startup that does software engineering interviews on behalf of other companies -- primarily first-round phone screens. Quickly-growing companies can spend a significant fraction of their engineers&#x27; time interviewing; we help take the load off. We&#x27;ve done a lot to make the interview experience better for all stakeholders that I could write whole essays about, but suffice it to say that candidates love working with us, clients love working with us, and we&#x27;re well-funded and growing quickly as a result.<p>Because of this quickly-growing demand, we&#x27;re looking to hire more Expert Interviewers. The ideal candidate is a software engineer with strong written and verbal English skills with at least a few years of professional experience. Interviewing experience would be great, but we spend 25 hours (paid) training you before you even start, so if you&#x27;re strong technically and love working with people we can usually make it work :) Interviews are conducted over video chat, using a collaborative code editor.<p>Some of our interviewers are freelancers who use our scheduling model to backfill hours; others are full timers at top tech companies looking to make some extra cash; others have quit their jobs to work with us full time; some are digital nomads; one of our interviewers is road tripping around North America for a year and a half, doing anywhere from zero to 40 interviews each week depending on where he is and what the weather&#x27;s like.<p>The application form is here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86?lever-origin=applied&amp;lever-source=HNWH\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a><p>I know it&#x27;s a pretty unique job, so if you have any questions reply here or email me at josh@karat.io and I&#x27;m happy to talk through any of it.<p>P.S. We&#x27;re also hiring for our internal team -- particularly looking for senior engineers, dev managers, and a product manager right now; for those we generally prefer local (Seattle) candidates, though we do cover relocation. More details on those here: <a href=\"https:&#x2F;&#x2F;karat.io&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;karat.io&#x2F;careers</a>, or feel free to email me if you have any questions.","time":1517535582,"type":"comment"}