{"by":"kul","id":16293676,"parent":16282819,"text":"San Francisco | Onsite | Zeus (YC S11) | <a href=\"https:&#x2F;&#x2F;zeusliving.com\" rel=\"nofollow\">https:&#x2F;&#x2F;zeusliving.com</a><p>Zeus is looking for a full-time Resident Experience Manager, Customer Relationship Manager, and Supply Development Representative in San Francisco, CA!<p>Who we are and what we do: Zeus is shaking up the $12b corporate housing industry through its unique strategy of leasing unfurnished, privately-owned homes and converting them into expertly appointed, full-service corporate housing units for today’s global professional.<p>Job Summaries:<p>The Resident Experience Manager is responsible for ensuring all Zeus tenants have a flawless stay in our properties and an overall great experience with Zeus. Please apply here:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus&#x2F;d9f4baad-0d73-438b-b266-74b89e07b09a?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus&#x2F;d9f4baad-0d73-438b-b266-74b89e07b...</a><p>The Customer Relationship Manager position sits at the intersection of sales, product, marketplace development, and real estate. The ideal candidate would enjoy interacting with customers, selling the Zeus concept and committing to building a great customer experience. A fair amount of time will be spent on accommodating and selling inbound leads from inquiries on our site, calls, texts, online chat and via partners. Please apply here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus&#x2F;34232b4f-5c64-454e-8889-5f82ef9e6407?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus&#x2F;34232b4f-5c64-454e-8889-5f82ef9e6...</a><p>The Supply Development Representative will work closely with our Home and Demand teams to identify and generate high-potential supply- and demand-side interest for Zeus. This role is suitable for someone looking to begin their sales, growth, or marketing career, who is tech-savvy and willing to do things differently. We are ideally looking for someone based in San Francisco but would be willing to chat about REMOTE work for the right candidate. Please apply here: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus&#x2F;c10c7525-4949-405b-945f-af4cfbe47bb6?lever-origin=applied&amp;lever-source%5B%5D=Hacker%20News\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus&#x2F;c10c7525-4949-405b-945f-af4cfbe47...</a>","time":1517601105,"type":"comment"}