{"by":"stormy","id":16291738,"parent":16282819,"text":"BloomReach | Backend Engineer | Dallas, TX | Full time | Onsite | <a href=\"https:&#x2F;&#x2F;bloomreach.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;bloomreach.com&#x2F;</a><p>Howdy. BloomReach’s Platform team has two Dallas spots open for software engineers. If you love to get your hands dirty with web-scale data infrastructure projects, give me a ping (I’m on the team).<p><a href=\"https:&#x2F;&#x2F;www.bloomreach.com&#x2F;en&#x2F;about&#x2F;careers&#x2F;development&#x2F;software-engineer-backend-dallas\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomreach.com&#x2F;en&#x2F;about&#x2F;careers&#x2F;development&#x2F;soft...</a><p>Current infrastructure tech we’re using (non-exhaustive): solrcloud, kafka, c*, spark, emr, redis all deployed and managed on aws.<p>If BloomReach is new to you: we’re a product and engineering driven company, headquartered in Mountain View, CA, with a Dallas office of 15 people just north of downtown by House of Blues. We opened up shop here 2 years ago. Most of our products revolve around search, analytics, personalization, and content management and power many of the biggest brands online.<p>I’ve been part of the company for 6 of it&#x27;s 9 years and I’m just as excited as when I started. We’re coming off a crazy Q4 and 2017 where we unseated large and entrenched competitors with 2 of our new products. For what its worth, both products are well-placed in Gartner’s 2018 magic quadrant for their respectitve categories.<p>Our founder and CEO, Raj, built the company with a goal to make BloomReach the most impactful professional experience of each employee’s career. I can attest to that so far. You’re going to be hard pressed to find a better place to work in Dallas for software eng.<p>And if you’re not the engineer type, we also have Solution Architect, Solution Engineer, Senior PM, Senior Sales Analyst, and Sales Development Rep positions open in Dallas too (check career pages for those or message me stormy@bloomreach.com).","time":1517588615,"type":"comment"}