{"by":"robot","id":16300079,"parent":16282819,"text":"Buzz | Lead Node.JS Engineer | Onsite and REMOTE, INTERNS | Full-time | Mountain View, CA<p>Buzz is a community building tool for B2B companies to showcase their products and reach out to their audience directly.<p>Compensation: 90K per year + (%.5 - %1.0) vesting in 4 years. Numbers can vary based on experience and location.<p>Apply: info@getbuzz.io<p>We are looking for a Lead Node.js engineer.\n- Proficient with Javascript.\n- Lead development of backend components in Express JS, Node JS and related technologies.\n- Manage and lead backend development, undertake planning and approach for a feature.\n- Strong understanding of databases, normalization, caching. Knex.js and Sequelize experience is a plus. Design ER diagrams.\n- Experience with database optimizations and NoSQL databases is a plus.\n- Experience with real-time (e.g. Socket.io) is a plus.\n- JQuery experience is a plus.\n- Self-driven, diligent, values own and others&#x27; time. Understands importance of shipping.<p>Our day to day workflow involves planning, developing new backend features, update and optimize the backend architecture. We start by planning with the User Interface. The UI and its flows allows us to design the database models. We create ER diagrams to see the full picture in data models. Then we design the routes, urls, and define what needs to happen. We then write the logic that drives the feature. We take a holistic approach. We refactor features into sub-apps if needed. We write tests using Mocha and Chai. We measure response times, find bottlenecks and optimize.<p>We work remotely, using online tools. Our main office is in Mountain View, CA. We work flexible times, and encourage you to set up the best working environment for yourself.\nWe are a small, tightly knit team who truly cares about this product. We are looking for someone who will be just as excited.<p>You have your own space, your time, lots of flexibility, and control. Your contributions will make direct impact on our product.","time":1517697253,"type":"comment"}