{"by":"elirose","id":16306217,"parent":16282819,"text":"Shearwater (Techstars &#x27;15) | Software Engineer, Senior Software Engineer | Boston | ONSITE | Full-time | $70k - $180k | Contact: eli@shearwaterintl.com<p>We are a tech startup that helps schools deliver 1-on-1 mentorship to all their students. Our customers include Tufts University, Washington University in St. Louis, University of South Carolina, Northeastern and Penn State. Our users are students and alumni of these institutions.<p>Our mission is to directly increase the national graduation rate. We do randomized controlled trials to measure our impact on a given school. At the same time, we are constantly A&#x2F;B testing new experiments to make progress on the deep human questions that underlie what we do:<p><pre><code>  - Out of the thousands of alumni from this school, who will make the best mentor for this student?\n  - What ingredients go into a profound mentoring relationship? How do these relationships get sustained?\n  - What helps students stay in school?\n</code></pre>\nOverall, we have a nonprofit&#x27;s mission and a tech startup&#x27;s culture. We raised our seed round and went through Techstars in 2015. We are on our 4th consecutive year of doubling our revenue and are fortunate to be profitable.<p>We currently have 2 engineers (an overall team size of 16), one of whom is writing this message. We are hiring a 3rd. Our stack is Heroku&#x2F;Postgres&#x2F;Ruby on Rails with an EmberJS frontend, but we don&#x27;t dock you points for not already knowing these technologies -- we care far more about demonstrated ability to learn. See <a href=\"http:&#x2F;&#x2F;shearwaterintl.com&#x2F;engineering&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;shearwaterintl.com&#x2F;engineering&#x2F;</a> for more about our engineering culture and processes.<p>* While this is an onsite position, we have an extremely flexible remote work policy: work remotely whenever you feel like it and it&#x27;s OK with anyone you&#x27;re meeting with that day. I work from home two days a week.<p>Apply through AngelList (<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;shearwater-international\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;shearwater-international</a>) and mention HN in your note. Or send me an email (eli@shearwaterintl.com) and let&#x27;s talk more.","time":1517797683,"type":"comment"}