{"by":"blocher","id":16310273,"parent":16282819,"text":"Engage | Web Developer (Full-time) | Alexandria, VA (metro Washington DC) | ONSITE  | <a href=\"http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;pjtER7dRfx\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;pjtER7dRfx</a><p>Engage is seeking a Web Developer to join our award winning creative team. The Web Developer will collaborate with Engage’s client strategists, designers, and developers to plan and build digital tools, campaigns, and websites for our clients. If you’re interested in teaming up with government agencies and House of Representatives committees, Fortune 500 companies, leading advocacy organizations, and the nation’s top trade associations to deliver winning solutions in a fun, fast-paced environment—we want to talk.<p>This is a full-time position and you must be able to work on-site in Alexandria, VA (metro Washington, DC).<p>We prioritize proven work, so please make sure to submit work samples with your application (links to live projects preferred). You&#x27;ll probably need at least two years of experience in a web development role to meet the qualifications below, but we&#x27;re not opposed to hiring a prodigy.<p>Ideal Candidates would meet many of the following qualifications:<p>- Strong PHP (or other object-oriented programming) background<p>- Familiarity with WordPress theming and plugin development strongly preferred<p>- Familiarity with PHP frameworks like Laravel or Symphony preferred<p>- Understanding of relational databases such as MySQL<p>- Be comfortable with server administration (though by no means at expert level)<p>- Well versed in CSS, HTML, AJAX, and JavaScript<p>- Well versed in at least one CSS preprocessor like Grunt, Gulp, or Webpack as well as build tools<p>- Familiarity with JavaScript frameworks like Vue.js, Angular or React, a plus<p>- A love of creative problem solving\nComfortable working on tight deadlines and in a team environment<p>- In general, a nice person to be around who enjoys tackling challenges and learning new skills<p>- Bonus: .Net (C#, C, ASP), MSSQL, Drupal<p>About Engage:<p>Engage is a full-service digital agency based in Alexandria, VA.  O We offer very competitive compensation packages because we want to work with the best Our team is focused and hardworking, but we also want you to have fun and get home for dinner. Work&#x2F;life balance is important to us, and we believe happy employees make happy clients.","time":1517851136,"type":"comment"}