{"by":"davelr","id":16323980,"parent":16282819,"text":"LaundryRepublic | Full-stack developer (PHP &#x2F; MySQL) | ONSITE | FULL-TIME | London, UK | £50k-£60k pa | <a href=\"http:&#x2F;&#x2F;laundryrepublic.com\" rel=\"nofollow\">http:&#x2F;&#x2F;laundryrepublic.com</a><p>LaundryRepublic is transforming laundry and dry cleaning. We install secure lockers in buildings around London, enabling residents to get their clothes cleaned without the hassle of going to a shop or waiting at home for a collection and delivery. We’ve already cleaned more than 2 million garments and have grown to a team of 50. We’re now in fast-growth scale-up mode, financially strong and ready for the next exciting stage.<p>This is one of the first roles in our new in-house tech team, making it a great opportunity for someone looking to take a step up. Our offices are in Clapham South &#x2F; Balham, SW London, conveniently located for tube and train services.<p>Role<p>We’re looking for a highly motivated, self-starter to join as a senior full-stack PHP &#x2F; MySQL developer. You’ll be working with the founders to improve LaundryRepublic’s award-winning, innovative service through developments to our proprietary order management system and website. In the medium-term, a large part of the role will be to help build the tech team, recruiting and managing other developers, working with agencies, and leading the company’s tech function<p>Skills and experience required<p>- Strong PHP 5 and 7 skills\n- Experience of web-based system development\n- Strong relational database skills (MySQL)\n- Technologist, with a broad range of technical skills\n- Eager to work in a start-up environment and be highly influential in its future success\n- Excellent communication and interpersonal skills\n- Good problem-solving and analytical abilities\n- At least 4 years’ working in a similar role\n- Willing to learn new skills and languages\n- Experience managing &#x2F; leading other developers\n- Agile methodologies<p>The package<p>- £60,000 per year\n- Other benefits including pension, childcare vouchers, and heavily-subsidised dry cleaning\n- Ability to work from home 23 days a year<p>For more information go to <a href=\"https:&#x2F;&#x2F;www.laundryrepublic.com&#x2F;senior-full-stack-php-developer-role\" rel=\"nofollow\">https:&#x2F;&#x2F;www.laundryrepublic.com&#x2F;senior-full-stack-php-develo...</a> and to apply email you CV and a covering note to jobs@laundryrepublic.com","time":1518006717,"type":"comment"}