{"by":"YasminaElFekri","id":16331237,"parent":16282819,"text":"Sentiance | Interpreting human behavior from smartphone-generated sensor data with AI | Antwerp, Belgium, Europe | ONSITE | VISA sponsorship OK | Full-time | Junior - Medior - Senior Mobile SDK Engineers (iOS and&#x2F;or Android)<p>We are a data science company that uses AI and machine learning algorithms to analyze low level sensor data from IOT objects (like smartphones) to better understand and predict human behavior and context. We believe AI has the power to improve people’s lives and we work with some of the biggest and most innovative companies in the world to make this mission a reality every day. We&#x27;re based in Belgium and Lithuania and we&#x27;re growing, fast :).<p>We’re looking for Mobile SDK Engineers to support our rapid growth. What we offer you is not a classic app development job but a position that enables you to dive deep into low level embedded programming, on the cutting edge of IOT and Machine Learning:<p>- Mobile SDK Support Engineer (iOS &amp; Android)<p>- Android SDK Engineer<p>- Senior iOS SDK Engineer<p>- Senior Mobile SDK Engineer (iOS and&#x2F;or Android)<p>More information and full job postings here: <a href=\"http:&#x2F;&#x2F;www.sentiance.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sentiance.com&#x2F;jobs&#x2F;</a><p>We are a well-funded scale-up, with 60 people and over 15 nationalities, working hard together to make our company a success. We offer a high-energy, positive and constructive working atmosphere. If you need to relocate for this job, we offer Visa sponsorship and relocation support. On top of your salary, we offer a healthy work-life balance and some great benefits to support your wellbeing, from meal coupons to fresh fruit, discount on your gym membership, yoga in the office and many more.<p>Please apply via our website: <a href=\"http:&#x2F;&#x2F;www.sentiance.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sentiance.com&#x2F;jobs&#x2F;</a>","time":1518084462,"type":"comment"}