{"by":"mrjn","id":16337396,"parent":16282819,"text":"Dgraph Labs (dgraph.io) | Developer Advocate &#x2F; Senior backend Engineers | San Francisco, CA | ONSITE, VISA, Full-time, USD 120-180K + equity<p>Dgraph is the world’s most advanced graph database. It is horizontally scalable, synchronously replicated, transactional and distributed. It can do arbitrarily deep joins, while minimizing network communication and disk seeks, scaling well as cluster size increases. It is a low-latency, high-throughput database, serving complex queries over multiple independent data sources in real-time. <a href=\"https:&#x2F;&#x2F;github.com&#x2F;dgraph-io&#x2F;dgraph\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;dgraph-io&#x2F;dgraph</a><p>Dgraph Labs was started by ex-Google engineers and is VC funded. We are a small team of dedicated engineers, with a mission to build world’s best graph database. Nothing less excites us! <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;12&#x2F;19&#x2F;dgraph-raises-3m-for-its-open-source-distributed-graph-database-hits-1-0-release&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;12&#x2F;19&#x2F;dgraph-raises-3m-for-its-o...</a><p>We are looking for a Developer Advocate to help support the growing Dgraph community. As a DA, you will be responsible for representing Dgraph to third-party developers, and assisting them in achieving their goals. This includes managing our public communication channels, blog posts, coding examples, tutorials, public presentations, social media interactions, and even live streams! You will also be taking feedback from the community and ensuring that the needs of the developers are being considered in our product roadmap and that immediate concerns are addressed by the Dgraph engineering team. Your work will help us strengthen both the businesses and the number of developers that build their applications on top of Dgraph. A successful candidate will have a strong technical ability, excellent communication skills, charisma and gravitas that shows to other developers, and great project management skills.<p>If this interests you, please apply here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;dgraph\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;dgraph</a>","time":1518142613,"type":"comment"}