{"by":"sara_komoot","id":16339743,"parent":16282819,"text":"Komoot | Backend Engineer (Algorithms, Rankings and Recommendations)| Full-Time | REMOTE<p>Millions of people experience real-life adventures with our apps. We help users all over the world discover the best hiking and biking routes, working to empower everybody to explore more of the great outdoors. And we’re good at what we do: Google and Apple have listed us as one of their Apps of the Year numerous times—and we are consistently ranked amongst the highest-grossing apps in both Google Play and the App Store.<p>One key driving factor to our growth has always been our understanding that a technological approach can provide an outdoor experience far beyond the possibilities of traditional services. On the one side, we collect, combine and process various open data sources (such as OSM and Wikipedia) and turn raw data into easily accessible information and understandable products, such as our easy-to-use outdoor route planner. On the other, we leverage the wisdom of our vast user base and use crowdsourced data for personalized, local outdoor recommendations. Now, with your strong analytical skills and your passion for building well-crafted and tested code, we’ll leave traditional, standard solutions even further behind—and we’ll truly change the way people explore.<p>You will be successful in this position if you<p>-Are highly self-driven, responsible and keen to learn and improve.<p>-Know your toolkit: git, ssh, bash, junit, jenkins and docker.<p>-Have deep experience (4+ years) in developing software running under high load<p>-Possess professional experience in Java and Python.<p>-Have demonstrable knowledge of common algorithms within the machine learning and statistics space.<p>-Have strong analytical skills.<p>-Love to tune, test, simulate and evaluate solutions to unusual problems.<p>-Live and breathe DevOps and believe in automated testing, infrastructure as code, continuous deployment, monitoring and open communication.<p>Please apply at: <a href=\"https:&#x2F;&#x2F;www.komoot.com&#x2F;jobs&#x2F;backend-engineer-recommendations\" rel=\"nofollow\">https:&#x2F;&#x2F;www.komoot.com&#x2F;jobs&#x2F;backend-engineer-recommendations</a>","time":1518180133,"type":"comment"}