{"by":"mybuilder","id":16333309,"parent":16282819,"text":"MyBuilder | ReactJS Developer | London, England | Competitive<p>We’re a market leader in the UK and are part of IAC, a well known New York based internet group (Tripadvisor, Vimeo, Match.com, Tinder, HomeAdvisor, etc.). MyBuilder operates throughout the UK.<p>Our headquarters in Clerkenwell reflect our unique culture: we have an amazing office bar, guitars, a drum kit, a bike mechanic workstation, extensive library and a rotating food team who make lunch for everyone. It’s a fun place to be and that’s mainly because everyone in the team believes in the mission and is seriously good at what they do.<p>We want to work with people who are curious, honest, courageous and passionate - if that sounds like you and you want to work for an innovative, successful web business helping homeowners to find reliable tradespeople, then you may have found a new home.<p>Software development at MyBuilder<p>Our focus is to produce high quality, working and tested code which not only keeps us happy and productive, but also helps the business to succeed. Our development process has been honed through exploring various flavours of agile and we believe that our way of working helps us get the right things done at the right time.<p>We have open sourced a number of our tools and happily contribute back to projects we use.<p>We been moving over to react for our our web and mobile interfaces for the last few years. So far we five ReactJS single page applications and we will be rebuilding another of our major interfaces in this year.<p>Responsibilities<p>Developing &amp; maintaining our large single page applications\nWork with product team and web designers to understand user interactions\nDevelop a flexible and well-structured front-end architecture, along with the APIs to support it\nKeen to learn new things, and enjoys keeping up with the latest front end technologies.\nHelping the team to understand and develop with ReactJS better<p>Please apply for the role here: <a href=\"https:&#x2F;&#x2F;mybuilder.workable.com&#x2F;j&#x2F;5399BBB0EB\" rel=\"nofollow\">https:&#x2F;&#x2F;mybuilder.workable.com&#x2F;j&#x2F;5399BBB0EB</a>","time":1518107333,"type":"comment"}