{"by":"davidknezevic","id":8823120,"parent":8822808,"text":"Akselos (Software Engineer, Boston or REMOTE)<p>-------------------------<p>Akselos provides an advanced cloud-based engineering simulation platform for &quot;accelerated Finite Element Analysis&quot; based on over 10 years of award-winning research at MIT. This platform enables engineers to perform detailed, fully-3D analysis of large-scale complex systems in seconds, which eliminates a major pain point across a wide range of engineering disciplines.<p>We currently have major engineering firms from the mining and power systems industries as customers. Our software has been used by over 7000 students in an engineering course on edX. Also, we were recently featured on the Google Cloud Platform blog:\n<a href=\"http://googlecloudplatform.blogspot.ca/2014/12/mitxs-edx-course-uses-akselos-for-complex-engineering-simulations-on-Compute-Engine.html\" rel=\"nofollow\">http:&#x2F;&#x2F;googlecloudplatform.blogspot.ca&#x2F;2014&#x2F;12&#x2F;mitxs-edx-cou...</a><p>We have offices in Boston, Lausanne and Ho Chi Minh City. Working remotely is a possibility.<p>-------------------------<p>Send job inquiries to: jobs@akselos.com (or contact me directly at david.knezevic@akselos.com)<p>We&#x27;re looking for a Software Engineer to assist with our GUI development. The GUI is written in Python (Qt bindings) and allows users to create 3D models, send simulation requests to our cloud-based back-end and then render the results locally. For more info about the GUI see:<p><a href=\"http://www.akselos.com/platform/akselos-assembler.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.akselos.com&#x2F;platform&#x2F;akselos-assembler.html</a><p><a href=\"https://www.youtube.com/watch?v=7cL2hn2wpoA\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=7cL2hn2wpoA</a><p>More info about open positions is available here:\n<a href=\"http://www.akselos.com/join_the_team.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.akselos.com&#x2F;join_the_team.html</a><p>-------------------------","time":1420125203,"type":"comment"}