{"by":"oschwald","id":8823489,"parent":8822808,"text":"MaxMind - <a href=\"https://www.maxmind.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.maxmind.com&#x2F;</a> - REMOTE (US and Canada)<p>Email careers@maxmind.com. See <a href=\"https://www.maxmind.com/en/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.maxmind.com&#x2F;en&#x2F;careers</a> for more information.<p>= Frontend Software Engineer<p>The successful applicant will be able to demonstrate strong experience and knowledge in each of the following areas. We&#x27;ll give you a homework assignment that will give you an opportunity to show us your skills.<p>* Strong knowledge of JavaScript, including at least one framework such as AngularJS, Ember, or Backbone<p>* Experience writing unit and integration tests for frontend JavaScript code<p>* Extensive knowledge of modern CSS and HTML<p>* Experience with CSS frameworks like Bootstrap as well as CSS preprocessors such as Less or Sass<p>* Experience with responsive web design<p>* Experience with revision control, preferably Git<p>* Excellent written and spoken communication skills<p>* The ability to work with a geographically dispersed team<p>It&#x27;s also a big plus if you have any of the following:<p>* Experience with CMS tools such as WordPress or Drupal<p>* Working knowledge of graphic design tools such as Photoshop and Illustrator<p>* Backend development experience, especially with the implementation of RESTful APIs<p>* User interface and experience design skills<p>The salary range for this position starts at $110k&#x2F;year and is negotiable depending on experience.<p>= Senior Software Engineer<p>Minimum Qualifications<p>* Dynamic language programming experience. We use Perl but we&#x27;re happy to hear from Javascript, PHP, Python, or Ruby developers as well.<p>* Web development, especially RESTful web services.<p>* Experience developing for deployment on a Linux or BSD platform.<p>* Experience writing tests and documentation.<p>* Experience doing code reviews.<p>* Excellent written and spoken communication skills.<p>* The ability to work with a geographically dispersed team.<p>Bonus skills<p>* Data mining, number crunching, and math skills.<p>* Experience writing C, especially libraries.<p>* Experience writing Go.<p>* FS&#x2F;OSS contributions. Tell us about them!<p>Compensation includes a starting salary of $120-150k&#x2F;year and participation in a performance-based bonus plan.","time":1420133007,"type":"comment"}