{"by":"ddtruong17","id":8823135,"parent":8822808,"text":"Kaggle, Inc (<a href=\"https://www.kaggle.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kaggle.com&#x2F;</a>) - San Francisco, CA + various<p><pre><code>   ===========================\n   ====== What we do =========\n   ===========================\n</code></pre>\nKaggle is best known as the world’s largest community of data scientists. Our community of around 200,000 data scientists compete to solve complex data problems. We’re changing the way the most important data-driven problems are solved. We have branched out beyond our core business of machine learning competitions, to build end-to-end solutions in specific industries.<p>Our first focus industry is energy, where we are working with Global 10 companies to make better decisions on where and how to drill for oil &amp; gas. Our solutions take detailed geological and engineering data and help predict well performance. These solutions can minimize capital and environmental destruction by helping operators drill fewer uneconomic wells. Kaggle is located in the heart of the SOMA.\nFor all Kaggle career opportunities, please visit <a href=\"https://www.kaggle.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kaggle.com&#x2F;careers</a><p><pre><code>   =================================   \n   ===== Who we’re looking for =====      \n   =================================\n</code></pre>\n°Designer -&gt; Creatively work with the data scientists and developers on the Competitions team as well as supporting the creative needs of the energy solutions business.<p>°Contracts Manager (part-time) -&gt; Work closely with the Kaggle team to deliver projects for clients and manage the contracting needs pertaining to Kaggle’s vibrant community of participants.<p>°Sales Operations Coordinator-&gt; As the Sales Operations Coordinator at Kaggle, you will work closely with the Energy team to support all sales activities and customer relationships.<p>°Data Scientists to Focus on the Energy Industry-&gt; Help us build machine learning powered solutions focused on transforming the energy industry.<p>°Software Engineer -&gt; Software Engineer to focus on the software architecture behind Kaggle&#x27;s work in the energy industry.<p><pre><code>   ===========================   \n   ====== More About Us ======   \n   ===========================\n</code></pre>\nWe are well-funded (Khosla Ventures, Index Ventures and Max Levchin). We’ll help you do your best work with our awesome Kaggle benefits including spiffy new gear, catered lunches, awesome guest speakers, no vacation caps and much much more. Our team includes coffee, beer wine and whisky connoisseurs, pastry chefs, ping pong players, kiteboarders and rollerbladers.\nFor questions, please contact us at recruiting@kaggle.com or visit our career page at <a href=\"https://www.kaggle.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kaggle.com&#x2F;careers</a>","time":1420125517,"type":"comment"}