{"by":"aghuwalewala","id":8825729,"parent":8822808,"text":"Full Stack Python&#x2F;Django Developer &#x2F;&#x2F; Tripnary &#x2F;&#x2F; Chicago, IL (Locals ONLY)<p>jobs@tripnary.com<p>=== About Tripnary ===<p>Tripnary is a seed-funded, an early stage travel startup based in Chicago. We are focused on building a disruptive mobile app that helps travelers save and organize the places they want to see and be ready for their next vacation. Tripnary can be best described as Pinterest travel boards meets Kayak. We want to eliminate the clutter of spreadsheets, bookmarks, emails, etc. that are currently used to document travel plans and provide an easy way to collect all the places you find in one app so you can instantly compare airfares to all your favorite destinations simultaneously with one tap! We have a slick mobile app with a jaw-dropping design that blows away everyone who sees it. We work out of 1871, the coolest co-working space for the city’s digital startups.<p>=== About the role ===<p>Tripnary is seeking a highly motivated visionary with experience in building scalable servers to join the team. As a partner, you will<p>-- Collaborate with the founders to refine and execute on the \nTripnary vision.<p>-- Spearhead end-to-end development and participate in planning, architecture, design and implementation of a beautiful and intuitive travel app.<p>-- Guide the product roadmap and help deliver features that provide maximum value to Tripnary’s users.<p>-- Be a team player with an open mind possessing confidence to make important product-related decisions.<p>=== What Tripnary offers ===<p>Tripnary promises a fun, energetic, and fast-paced startup environment and the opportunity to be an early member of a growing team of passionate and tight-knit group of young entrepreneurs with a vision. Because we are a startup, everyone on the team is fully involved on multiple levels. This allows you to gain a great deal of experience both within and beyond your specific area of expertise as everyone works cohesively to accomplish a greater goal. The founder brings over a decade of combined experience with software development and technology businesses delivering million-dollar software products. You will be coming into a very goal-oriented, technically grounded team. We promise exciting challenges, a broad range of experiences across a variety of projects and the chance to make a difference while working in a casual but fast-paced setting. Just remember to work hard and party harder (or in our case, travel farther — just make sure to bring back a fridge magnet from your adventures!).<p>=== What we are looking for ===<p>We are looking for people with:<p>-- Experience building web applications in Python&#x2F;Django with either MySQL, PostgreSQL, or MongoDB<p>-- Experience with RESTful web services (Google Maps, Foursquare, Facebook, Wikipedia, etc.), JSON, XML, and SQL<p>-- Fluency with HTML5, CSS3, JavaScript, jQuery, AJAX<p>-- Knowledge of at least one client-side app frameworks such as Backbone.js, AngularJS, or Ember.js, etc.<p>-- Keen eye for design with demonstrated background to show<p>-- Enjoy creating innovative implementations that push the platform to the limit<p>-- Passionate about delivering a delightful experience to users<p>-- Experience deploying and hosting applications on Amazon Web Services, Heroku, or other cloud environments<p>-- Experience with test-driven development (TDD) and behavior-driven development (BDD)<p>-- Strong understanding of object-oriented programming including algorithms, data structures, and design patterns<p>-- Creative thinker with excellent analytical, troubleshooting, and debugging skills<p>-- Self-motivated, enthusiastic, fast learner with the ability to work in a team environment<p>-- Ability to wear many different hats<p>-- Attitude to thrive in a fun, fast-paced startup environment\nWe prefer people with:<p>-- Understanding of machine learning, Hadoop, and&#x2F;or MapReduce<p>-- Passion and love for everything travel<p>-- Appreciation for design thinking<p>-- Bachelor’s&#x2F;Master’s degree in computer science&#x2F;engineering or related field<p>=== Compensation ===<p>We provide competitive packages with both a salary and generous equity. Compensation for this position will consist of a substantial company equity as we are looking for the right partner with an entrepreneurial mindset. This ensures that we all take ownership of Tripnary and have a vested personal interest in its success.<p>=== How to apply ===<p>If you are interested to be part of Tripnary please drop us an email with your resume at jobs@tripnary.com. Thanks a lot for your interest!<p>Note: This is NOT a remote position. All applicants MUST be able to work from our offices in Chicago.<p>Note 2: All applicants MUST be authorized to work in the U.S. without sponsorship.<p>Note 3: This posting is for principals ONLY. Please do NOT contact if you are a recruiter or a development agency.","time":1420178750,"type":"comment"}