{"by":"bencpeters","id":8825075,"parent":8822808,"text":"Ardusat (Project-based education tech with access to space) Salt Lake City, UT<p>=================================================<p>Come help change the way science and math are taught in schools! Ardusat (<a href=\"https://www.ardusat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ardusat.com</a>) is a growing educational technology company providing engaging experiences to science and math students by creating technology, products, and curriculum preparing them to run custom experiments on real satellites in space. With over $6B available in public and private STEM (Science, Technology, Engineering, and Math) grants, this is an exciting space to work in.<p>========================================<p>Why Ardusat is an awesome place to work:<p>* Early stage startup with successful seed funding round. We&#x27;ve proven that investors and early adopters are excited about our vision, now we need help making that vision a reality! As part of a small team, you&#x27;ll have the chance to make a real impact on the future direction of the company.<p>* Education is a space where what you are doing matters. Everyone at Ardusat is here because we believe parts of the education system are broken, and need to be fixed. We want our work to impact student&#x27;s lives all over the world by cultivating more interest in math, science, and technology.<p>* We value autonomy, professional development, and life outside work. Do you do your best work when you get out skiing for the morning and work at 1 am? We understand different people work differently, and we want everyone we hire to be inspired by and love what they do. This means that we try to have people work on projects that are interesting to them, provide the resources to continue learning, and give the flexibility to fit in life outside work.<p>* Space is cool. So, you&#x27;re not exactly a rocket scientist? Well, we don&#x27;t actually work with rockets, either, but a satellite engineer is pretty close. We have a close partnership with San Francisco-based Spire and collaborate with their engineering team on a variety of projects. There&#x27;s a good chance that some of the code you write at Ardusat will be running in space in a few months.<p>* Salt Lake City is not the Bay Area. We love visiting the Valley, but we&#x27;re always pretty excited to get home. SLC is more affordable, has way less traffic, and, most importantly, is 30 minutes away from some of the best skiing, mountain biking, rock climbing, and hiking in the country. We are proud to be located somewhere where access to the mountains is close enough that you don&#x27;t have to be a weekend warrior. (We respect powder days)<p>===============<p>Jobs Available:<p>* Front End Developer - We need someone to help develop our various web-based tools. The ideal candidate would be comfortable creating great UX and familiar with modern JS frameworks (we currently use Angular.js) HTML5, CSS3. Experience developing mobile apps is a big plus. We work with a top notch design firm for our creative, but having a decent eye for design is important.<p>* Embedded Software Developer - We need a “full stack” embedded hacker to help us develop some of our product offerings. Experience with typical “maker” technologies (3D printing, proto-board prototyping, Arduino, etc.) is preferred. This is an important, early hire for the team, however, so it involves multiple hats, and we&#x27;re also looking for someone with experience working with backend technologies including sys admin and backend web development (we use Rails and Node.js).<p>============<p>Technologies<p>We try not to be dogmatic about individual technologies. We&#x27;ve all used a lot of different platforms, languages, and idioms over our careers, so we&#x27;re not overly focused on any particular technology&#x2F;framework. However, we currently use&#x2F;like the following technologies, and experience with some of them certainly helps!<p>Node.js<p>Ruby on Rails<p>Postgres<p>Angular.js<p>React.js<p>C<p>Arduinos<p>Docker<p>AWS<p>iOS&#x2F;Android<p>============<p>How to Apply<p>If you think Ardusat sounds like an exciting place to work, we want to hear from you! Please email us at jobs@ardusat.com with a brief description of your background and why you are interested in Ardusat, as well as a portfolio&#x2F;CV. We would like to see a non-trivial code sample that you feel showcases your coding abilities and experiences – whether that&#x27;s a github profile, side project code sample, OSS contribution or something else. We&#x27;ll try to get back to everyone as quickly as possible!","time":1420161222,"type":"comment"}