{"by":"oneofthose","id":8844223,"parent":8822808,"text":"Goettingen, Germany - BiomedNMR - Research Engineer Computer Science – Real-Time MRI<p>The Biomedizinische NMR Forschungs GmbH (non-profit) at the Max-Planck-Institut für biophysikalische Chemie in Göttingen, Germany is looking for a Research Engineer in the area of Computer Science.<p>BiomedNMR is a research laboratory devoted to the development of magnetic resonance imaging (MRI) and its application for studies of living systems. A current main research focus is on the development of real-time MRI acquisition and reconstruction techniques (“MRI movies”) that allow for unprecedented possibilities for biomedical research and clinical applications. BiomedNMR is seeking support in the further development and technical translation of the real-time MRI technology to clinical centers in Germany and worldwide.<p>Your Profile<p><pre><code>  * Master degree in Computer Science or Mathematics or Physics \n    or equivalent job experience\n  * Excellent knowledge of C++\n  * Excellent knowledge of Linux\n  * Experience in either Matlab or Python or Julia\n  * Knowledge in numerical analysis\n  * Good knowledge of English (oral and written)\n  * Experience in concurrent and parallel programming and GPUs is advantageous\n\n</code></pre>\nWe expect excellent team and communication skills and the ability to work independently and solve problems in a self-dependent manner.<p>Your Responsibilities<p><pre><code>  * Development, maintenance and monitoring of an image reconstruction system \n    for human MRI in a scientific and a clinical setting \n  * Implementation and support of software for research-specific requirements\n  * Implementation and support of software for partner sites\n\n</code></pre>\nOur Offer<p>As a member of an interdisciplinary team of experienced physicists, biologists and medical doctors you work at the forefront of redefining the diagnostic capabilities of MRI. Within this setting, there exists the possibility of independent research projects. Employment, compensation and benefits follow the civil service labor agreement (TVöD).<p>Contact<p>Please send your application in electronic form to<p><pre><code>  Frau Sylke Wallbrecht\n  Biomedizinische NMR Forschungs GmbH\n  am MPI für biophysikalische Chemie\n  37070 Göttingen\n  Tel.: 0551 – 201 – 1720\n  E-Mail: swallbr@gwdg.de\n  Web: http:&#x2F;&#x2F;www.biomednmr.mpg.de&#x2F;</code></pre>","time":1420551000,"type":"comment"}