{"by":"saucelabs","id":8875793,"parent":8822808,"text":"Engineering Internships – Summer 2015 - Sauce Labs (San Francisco, CA)<p>About Sauce Labs:<p>Sauce Labs makes testing awesome. Developers from startups to Fortune Global 1000 enterprises use our cloud-based service to automatically or manually test mobile and web apps on 350+ browsers and platforms. We’re a growing, tight-knit team working to transform how software testing and development gets done.<p>The internship will be in our San Francisco headquarters, located in SOMA. You’ll be provided various amenities including catered lunches 4 days a week, a pet-friendly building, a MacBook Air and more!<p>Our Internship Program:<p>Our 10-16 week internship program provides interns with the ability to explore and improve upon their interests in a growing start-up environment. Interns should be passionate about problem solving and using computer science fundamentals to collaborate with managers of their team and contribute directly to our product.<p>We have multiple disciplines within our Engineering team:<p><i>Core Development</i><p>- Grow your backend development and DevOps chops to help scale our massive cloud of Windows, Mac and Linux virtual machines<p>- Work on automation of management tasks like browser installation<p>- Contribute to operation planning like orchestrating distribution of disk images via torrent<p><i>Ecosystems &amp; Integrations</i><p>- Contribute to open source projects in the automated testing space, including Appium<p>- Work in multiple programming languages<p>- Learn how to pitch and give technical talks at meetups or conferences<p><i>Web Development</i><p>- Actively contribute to the Sauce Labs user experience that enables customers to be successful at test automation<p>- Gain full exposure of the web stack all the way from the frontend, APIs to the backing database<p>- Enhance your professional experience by working with a cohesive team of software engineers<p>- Increase your understanding of software architecture, style and design through feedback from your peers<p>- Experience the momentum of a passionate team who share a common set of values and rally behind the same goals<p>- Power our front-end development with exciting technologies such as Angular.js, Backbone.js, WebPack and Grunt<p>Specific responsibilities depend on your background and experience. At the end of the internship, interns will get the chance to present on their contributions to the company.<p>Qualifications:<p>- Currently pursuing a Bachelor&#x27;s or above in Computer Science, Engineering or equivalent experience.<p>- Software development experience using Python.<p>Interested in becoming an Engineering Intern at Sauce Labs? Send us your resume, a quick introduction and links to your projects at: recruiting@saucelabs.com","time":1421090107,"type":"comment"}