{"by":"bert2002","id":8888032,"parent":8822808,"text":"== Flystay ==<p>Like traveling? Not happy with your stopover experience at airports? \nInto tech and mobile? Join us!<p>We’re a small and enthusiastic team of tech-savvy globetrotters. We’re tired of stopovers in \nairports. Not because of the time spent there, but because we don’t quite know what to expect, \nwhat’s on offer, what’s good and what isn’t. We want to do everything we can to change that.\nTapping into solid data analysis, social media linking and airport partnerships we want to offer \nan awesome stopover experience with tailored suggestions, special promotions, amenities \nreviews and a service that remembers users’ preferences to make the stopover as smooth and \nexciting&#x2F;calm&#x2F;relaxing&#x2F;fascinating&#x2F;interesting&#x2F;effective as possible – whatever it is that each \ntraveler wants to get out of their stopover.<p>Co-Founder App Development<p>You should bring with you the following characteristics:<p>✈ Ideally you’ve traveled and know what we’re talking about here.\n✈ Mobile technology and apps make you excited. You’re a techie who is well versed in coding and UX \nfor apps, both iOS and Android.\n✈ You thrive in an extremely fast-pace environment, you want to get things done and you’re action-\noriented. You value clear communication and you work in a structured way.\n✈ You probably speak several languages and definitely feel comfortable in a global, dispersed team.\n✈ Financial reward isn’t your highest priority – we’re doing the first steps here, but attracting \ninvestments is on top of our list.\n✈ Responsibility, independence and having a direct impact are what keeps you going. Help us make \nthis the next big thing and we ensure you you’ll be handsomely rewarded.\nThe role of co-founder app development is in charge of app development for both iOS and \nAndroid. That means a lot of interaction with the CTO, and transforming a web-based app into a \nbeautiful and fully-functional mobile application. It will be a part-time role (though may turn into a \nfull-time position), and would suit someone who is looking to have a high-impact entrepreneurial \nexperience next to their current studies or job. A certain level of flexibility is required.\nWe do our meetings via web conference mostly, but have in-person meetings from time to time. \nBeing located somewhere in Europe, Eastern Europe or Southeast Asia will be beneficial.<p>Co-Founder Business Development<p>You should bring with you the following characteristics:<p>✈ You’ve traveled. Extensively. You know what we’re talking about here.\n✈ Mobile technology and apps make you excited. You might even have some experience in the tech \nor business side of it all.\n✈ You thrive in an extremely fast-pace environment, you want to get things done and you’re action-\n✈ Globe trotter describes you best, you speak several languages and feel comfortable in a global, \ndispersed team.\n✈ Financial reward isn’t your highest priority – we’re doing the first steps here, but attracting \ninvestments is on top of our list.\n✈ Responsibility, independence and having a direct impact are what keeps you going. Help us make \nthis the next big thing and we ensure you you’ll be handsomely rewarded.\n✈ You’re outgoing, with experience in business development &#x2F; sales &#x2F; marketing.\nThe role of co-founder business development is in charge of creating valuable partnerships \nwith airport authorities and in-airport retailers. It will be a part-time role (though may turn into a \nfull-time position), and would suit someone who is looking to have a high-impact entrepreneurial \nexperience next to their current studies or job. A certain level of flexibility is required.\nWe do our meetings via web conference mostly, but have in-person meetings from time to time. \nBeing located somewhere in Europe, Eastern Europe or Southeast Asia will be beneficial.<p>Email us to iwantto@flystay.xyz with your CV and a few lines about your motivation.","time":1421259968,"type":"comment"}