{"by":"chrchr","id":8543158,"parent":8542892,"text":"LegitScript in Portland, OR and Dublin, Ireland<p>We make the online health product sector safer and more transparent for individuals and businesses. We analyze and report on rogue online pharmacies and dangerous health products. Our services include monitoring, investigative reports, online pharmacy certification, and health product classification. Our mission includes protecting consumers from fake cancer cures, cosmetics that contain mercury, &quot;all natural&quot; supplements that contain dangerous pharmaceuticals, and illegal online pharmacies that fake their certifications and sell prescription medications to anyone who asks. Our clients include Google, Microsoft, Visa, Twitter and the FDA.<p>Our team focuses on producing simple, reliable software through excellent developer testing practices and collaboration, including test driven development, pair programming, and continuous integration.<p>* You should be able to demonstrate ability in Ruby, Python or similar dynamic, object-oriented languages. We use Ruby.<p>* You have experience writing developer tests. We use rspec.<p>* You should be familiar with relational databases and SQL. We use MySQL.<p>* You should have experience with modern web frameworks, such as Rails, Django, Sinatra, or Flask. We use Rails.<p>* You should be able to work with Web technologies such as HTTP, HTML, JavaScript, CSS, jQuery, et cetera.<p>* You should be comfortable working with the Unix command line. Our production systems run Linux.<p>* You have a degree in computer science or equivalent experience. You should know a little about algorithms and data structures.<p>You can find out more about what we do on our website (<a href=\"http://www.legitscript.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.legitscript.com&#x2F;</a>) and our blog (<a href=\"http://blog.legitscript.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.legitscript.com&#x2F;</a>). We were also recently featured in 37signals’ &quot;Bootstrapped, Profitable and Proud&quot; series (<a href=\"https://signalvnoise.com/posts/3612-bootstrapped-profitable-proud-legitscript\" rel=\"nofollow\">https:&#x2F;&#x2F;signalvnoise.com&#x2F;posts&#x2F;3612-bootstrapped-profitable-...</a>). The company is entirely self-funded and has been profitable since 2010. We offer a stable workplace with good benefits and regular pay increases. We believe in working at a sustainable pace with regular office hours.<p>Our spacious, modern Pearl District office is cubicle-free with plenty of natural light. We have sit&#x2F;stand convertible desks. Many of us bike to work and we have indoor bike parking, as well as a parking or public transit benefit. There&#x27;s an ofﬁce dog. The ofﬁce is a collaborative and fun work environment with no drama. Our friendly in-house barista serves complimentary beverages every morning, and every week we have a catered lunch or happy hour.<p>We offer a generous benefits package that includes a health plan, 401k with company contribution (available after 1 year). We offer full-time employees extra perks like company-paid massages, gift cards to local businesses, paid time of to volunteer, company sponsorship of your hobby, and group social outings!<p>Please apply! <a href=\"http://jobsco.re/1xL3tBE\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;1xL3tBE</a>","time":1414852468,"type":"comment"}