{"by":"paulc","id":8543096,"parent":8542892,"text":"LOCATION: NYC OR REMOTE<p>Hi, we&#x27;re DailyBurn a fitness and nutrition company based in Midtown Manhattan. We&#x27;d like you to come join our multi-discipline engineering team to build software on a wide array of platforms and technologies.<p>We really are a fitness company, we have our own well equipped gym in the office and offer a gym membership budget for all employees.<p>Everyday we get messages from users sharing the changes they&#x27;ve made in their lives not every company can say the same. If fitness is an area of interest for you this is a great place to get involved in changing peoples lives.<p>We are currently hiring a Lead Backend Engineer and Senior Web Engineer.  The Lead Backend position is only available to candidates in NYC or willing to relocate to NYC (we provide relocation help and compensation).<p>As a member of our Engineering team you&#x27;ll get:<p>* Yearly conference and travel budget<p>* Your pick of development hardware<p>* Access to all the corporate benefits of IAC (DailyBurn is part of IAC)<p>* Monthly gym membership benefit<p>Our team is currently made up of 10 developers with a team of 2 working on iOS and the rest of our team focused on web and platform development.<p>The DailyBurn engineering team offers the chance to work on a wide range of different technologies. Our main web platform is built using Ruby on Rails, but we also work with node.js and golang on our backend systems.<p>We have client applications built for many of the major mobile and TV platforms (using Javascript, Objective-C, Java \nand more) and you as a part of the team will have the opportunity to get involved in many of these different platforms.<p>We have built a number of production systems in the Go programming language and are investing in using it as systems language for our backend.<p>Lead Backend Engineer:<p>* Deep experience with Ruby on Rails or an equivalent web platform<p>* Experience leading development efforts for a team<p>* Experience architecting complex backend systems<p>* Experience with golang a plus<p>Senior Web Engineer:<p>* Experience with Ruby on Rails or an equivalent web platform<p>* Comfortable taking on any level of technical challenge<p>* Proven track record of shipping production software in rails or an equivalent web technology<p>* Experience with golang or React a plus<p>Reach out to me directly: paul@dailyburn.com","time":1414851433,"type":"comment"}