{"by":"alexthornton","id":8543528,"parent":8542892,"text":"Senior Front End Software Engineer\nLocus Energy (locusenergy.com): San Francisco, CA<p>Locus Energy builds software to help manage and optimize solar PV systems.<p>About you: You love building slick user-facing apps. You’re passionate about sustainable energy and want to play a part of pushing our society in that direction. Nothing would excite you more than wedding your engineering prowess with your dreams of clean, green energy. The screen is your easel as you paint delightful UX and data visualizations using HTML, CSS and JavaScript. You’re fluent in RESTful APIs and JSON. You write a failing test before fixing a bug. You are thoughtful, curious and ask questions when you don’t understand. You take ownership of your responsibilities and see them through to the entire development lifecycle from design to maintenance.<p>About us: We’re dedicated to the proliferation of sustainable energy solutions. To that end, we build software to monitor, analyze and manage the performance of tens of thousands of solar power systems. We’re a mature startup with a close-knit team that is greater than the sum of its parts. Our organization is mature enough to offer some structure while still leaving plenty of opportunities to make your mark. We’re not perfect but constantly improving. We value folks who offer a new perspective and play nicely with others.<p>Job Responsibilities:\n- Design and build dynamic end-user interfaces (including data visualization), using Javascript, CSS &amp; HTML\n- Be a key part of the software development process, designing scalable front end systems, and working together with an existing development team\n- Provide input on emerging software technologies that the company could incorporate into the overall plan<p>Skills &amp; Requirements:\n- Expertise in JavaScript, HTML5, CSS3, and general web technologies\n- Expert in Angular.js. Knowledge of other JavaScript frameworks is a plus.\n- Experience with RESTful APIs\n- Knowledge of current W3C standards\n- Having a github or bitbucket for review\n- Nice to have:\n-- Experience working with server-side technologies (e.g., Spring MVC, Django)\n-- JavaScript unit testing experience\n-- Knowledge of JavaScript engine internals and&#x2F;or performance tuning\n-- Experience with SASS or LESS\nUI&#x2F;UX design and experience<p>Contact hr_tech@locusenergy.com to apply.","time":1414858196,"type":"comment"}