{"by":"arach","id":8543641,"parent":8542892,"text":"Primary Kids (primary.com) - New York, NY<p>Hi, we’re Primary, a prelaunch vertically integrated ecommerce company that will change how parents shop for their children’s clothes. We are looking for a talented and experienced engineer to join our founding engineering team. Our founders were key executives at Quidsi, the ecommerce company behind Diapers.com that was acquired by Amazon for $545M. Our Creative Director has launched several successful online brands and I was most recently CTO at Lot18 where I lead the engineering team behind Lot18.com and later launched TastingRoom.com, the first technology enabled personalized wine club. TastingRoom went from 0-10M$&#x2F;yr in less than a year and was built from scratch using Flask.<p>At Primary, we&#x27;re building our website using Spree&#x27;s Ruby On Rails ecommerce framework. I&#x27;m loving the framework so far and our stack is going to be really fun to work with. As we grow, I&#x27;d like us to be polyglot but for now this is awesome. We&#x27;re not just building another ecommerce website with better design, we&#x27;re going to rethink every aspect of how a company in our space operates and think smart, simple with technology at the heart of everything we do.<p>I&#x27;d love to hire someone who loves working on frontend technology but would obviously also be happy with a more fullstack engineer. I don&#x27;t believe in putting people in a box (frontend&#x2F;backend&#x2F;etc).  Right now, I am mostly focused on hiring someone awesome who can be a good foundation for the kind of team I want to build. You would be on the founding engineering team and work closely with a really smart and friendly team. We are going to build something big here.<p>Some of the things I love about this company are that we value design, we&#x27;re scrappy even though we raised a significant seed round from top seed level investors and we have well defined values as a team.<p>Say hi - I&#x27;m the CTO email me at arach@primary.com","time":1414859825,"type":"comment"}