{"by":"jjarmoc","id":8543683,"kids":[8576410,8545175,8559743],"parent":8542892,"text":"Matasano Security  - Chicago. New York City. Sunnyvale.\nJob Title: Application Security Consultant<p>Have you ever seen the 1992 film Sneakers?  Near the start, we see Martin Bishop (Robert Redford) close out a bank account, and take the proceeds to the managers.  He pretty tersely says something like:<p>&quot;Gentlemen, your communication lines are vulnerable. \n\tFire exits need to be monitored. \n\tYour rent-a-cops are a tad undertrained. \n\tOutside of that, everything seems to be fine. \n\tYou&#x27;ll get our full report in a few days. But first, who&#x27;s got my check?&quot;&quot;<p>Cut to a bank secretary, writing Martin a check.<p>&quot;So, people hire you to break into their places...\n              ...to make sure no one can break into their places?&quot;<p>Whenever I&#x27;m asked to explain what we do at Matasano, this scene comes to mind.  Our work is the digital equivalent; breaking applications so they can be made stronger and more resilient to attack, inoculating the world&#x27;s software like a binary flu shot.<p>Modern applications are a lot like the bank in the movie.  Authentication protects the front door, much like the bank&#x27;s cameras and guards.  Encryption often protects sensitive data, similar to how steel lined walls protect a bank vault.  Communication protocols convey information in and out, like armored cars ferrying cash to and fro.  Finding the application&#x27;s &#x27;communication lines&#x27;, &#x27;fire exits&#x27;, and &#x27;rent-a-cops&#x27; is our goal.  As Application Security Consultants we seek the overlooked, the neglected, the unexpected flaws in an application&#x27;s code.  Like Martin, we show how these weaknesses can lead to overall failure of the application, and we do this so it can be improved.<p>Later in the movie, Cosmo (Ben Kingsley), a villainous ex-con says:\n\t&quot;The world isn&#x27;t run by weapons anymore, or energy, or money. It&#x27;s run by little ones and zeroes, little bits of data. It&#x27;s all just electrons.&quot;\nIn 1992, that might&#x27;ve been hyperbolic but it&#x27;s becoming more true every day.<p>If being part of ensuring the systems we all rely on continue to function safely and reliably, we should talk.  If working with smart people on the cutting edge of technology excites you, we should talk.  If diving deeply into a wide variety of technologies and facing new challenges daily appeals to you, we should talk.  If tearing apart application code and making it do things that its creators didn&#x27;t intend is fun for you, we should talk.<p>You can get a taste for the sorts of things we do at www.microcorruption.com and www.cryptopals.com.<p>Reach out to us at careers@matasano.com or by visiting our web site.","time":1414860323,"type":"comment"}