{"by":"jarmitage","id":8543441,"parent":8542892,"text":"ROLI – London, UK &amp; Shenzhen, China – Full Time – <a href=\"https://www.roli.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.roli.com</a><p>------------------------------<p>Available roles [1]:<p>Head of Finance<p>Product Manager (Synthesis)<p>Senior Software Engineer<p>Technical Project Manager<p>Production Manager (Shenzhen)<p>Graphic Designer<p>------------------------------<p>We are a design and technology startup based in Dalston, London. Founded in 2009 by Roland Lamb, our products increase the bandwidth of interaction between people and technology. The Seaboard GRAND is our first product and demonstrates our patent-pending SEA Interface technology. Praised by Hans Zimmer, it has been pre-ordered in over 30 countries and won the Design Museum&#x27;s Product of the Year Award 2014. Our recent Series A of $12.8m [2] has just been followed by $3.7m with Horizons Ventures to scale production and build our presence across Asia [3].<p>We pride ourselves in making ROLI a great place to work and are looking for the right people to grow our team. If you are looking for a healthy and challenging working environment in a vibrant London startup, we have the perfect opportunity for you.<p>If you are interested, feel free to contact me directly at jack [at] roli [dot] com. Highlights include:<p>• Join a fast-­growing team with an exceptionally diverse range of skills, interests and talents<p>• Participate in cutting­-edge design and innovation that will change the way people physically interact with technology<p>• Take advantage of our in­ house recording studio, fully equipped kitchen and state­-of-­the-­art design lab<p>• Enjoy a daily team vegetarian lunch and fresh bread baked daily in the office, limitless home­made GOLDnola and the outpourings of our juicer<p>[1] <a href=\"https://www.roli.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.roli.com&#x2F;careers</a><p>[2] <a href=\"http://blogs.wsj.com/venturecapital/2014/05/21/rolis-new-musical-keyboard-makes-fans-of-vcs-to-the-tune-of-12-8m/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2014&#x2F;05&#x2F;21&#x2F;rolis-new-mus...</a><p>[3] <a href=\"https://www.pehub.com/2014/10/horizons-ventures-backs-roli/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pehub.com&#x2F;2014&#x2F;10&#x2F;horizons-ventures-backs-roli&#x2F;</a>","time":1414856910,"type":"comment"}