{"by":"JangoSteve","id":8543324,"parent":8542892,"text":"Alfa Jango - Ann Arbor &#x2F; Detroit, MI - Ruby, JavaScript, both front-end and back-end developers - full-time - REMOTE or local<p>We build startups, all day, every day. We are our startups&#x27; technical co-founder, acting as their CTO and development team. We help everyone from new founders who have an idea and aren&#x27;t sure what to do next, to founders who have already raised money, have a product and are looking for a more experienced team to help out or take over the technology (one of our clients even went through YCombinator).<p>Several of our startups are doing very well and we need to add someone to the team to help us grow. A couple have won large competitions this year, a few are raising funding (in addition to the several that have already raised funding) amidst initial traction.<p>One of our startups also just got acquired by Edmunds.com!<p><a href=\"http://www.edmunds.com/car-news/edmundscom-acquires-carcode-sms-to-help-shoppers-dealers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.edmunds.com&#x2F;car-news&#x2F;edmundscom-acquires-carcode-...</a><p>---<p>We&#x27;ve recently grown to a small team of 6, and are now looking to bring on two more developers. We do most of our work using Ruby, JavaScript, HTML5, CSS, and other open web technologies (CoffeeScript, SASS, and more). We&#x27;re looking for intermediate to senior level developers for at least one (or preferably both) of next two positions (and maybe some interns or beginner-level developers immediately after that).<p>---<p>We also work on a lot on open-source. For example, I maintain the Rails jquery-ujs [2] and jquery-rails [3] libraries; Scott is a maintainer of the Kandan open-source chat app [4]; and we just launched Dynatable.js [5] back in December, which has now overtaken Datatables in popularity on Github; and we have several other projects in the works as well [6]. Our open-source projects have over 8,000 combined stars on Github so far.<p>We also each have our own side-projects we work on as well, including our company status dashboard (built on Node) which pulls from all of our internal applications in real-time to show how we&#x27;re doing that week, an application which helps you record and save your important voicemails forever, and several others.<p>If working on startups and open-source sounds like a lot of fun to you, then you might be a good fit :-) If you&#x27;re ready to become an integral part of a startup building startups, let us know.<p>Check us out (<a href=\"http://www.alfajango.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.alfajango.com</a>), and reach out to us at support@alfajango.com.<p>[1] <a href=\"https://github.com/rails/jquery-ujs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;rails&#x2F;jquery-ujs</a><p>[2] <a href=\"http://rubygems.org/gems/jquery-rails\" rel=\"nofollow\">http:&#x2F;&#x2F;rubygems.org&#x2F;gems&#x2F;jquery-rails</a><p>[3] <a href=\"https://github.com/kandanapp/kandan\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;kandanapp&#x2F;kandan</a><p>[4] <a href=\"http://www.dynatable.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dynatable.com&#x2F;</a><p>[5] <a href=\"http://os.alfajango.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;os.alfajango.com&#x2F;</a>","time":1414854971,"type":"comment"}