{"by":"oms1005","id":8543588,"parent":8542892,"text":"Watsi (YC W13, San Francisco, <a href=\"https://watsi.org\" rel=\"nofollow\">https:&#x2F;&#x2F;watsi.org</a>) is a non-profit that enables anyone to directly fund life-changing healthcare for people around the world. We’re a team of developers, designers, doctors, and marketers who believe that everyone, everywhere deserves access to healthcare. We move fast, take risks, and come to work every day excited about building an organization that matters more than we do.<p>The engineering team is small, but with big responsibilities, as we’re building a platform that connects donors directly with patients around the world. We’re all full-stack engineers who believe in end-to-end ownership of products, as we manage anything from rows in databases to pixels on the screen. We believe in testing everything from code to design and aspire to create the best experience for all of Watsi’s users. Our stack is Rails, Backbone.js, SCSS, Postgres, Redis, Sidekiq, Heroku, RSpec, and Jasmine.<p>About the job<p>This is an internship for summer 2015\nYou will be working in fast-paced environment building the future of healthcare\nWe’re a small group, so you’ll be interacting with everyone, not just engineers\nThis is an opportunity to work on interesting challenges and solve problems pertaining to tons of medical data<p>About you<p>+ You’re a product-focused generalist who wants to use your skills to bring healthcare to the world\n+ You’re able to work on a small team and own projects throughout the summer\n+ You take feedback well and put the product and the users first\n+ You provide good feedback on ongoing projects\n+ You can work on developing beautiful applications<p>Requirements\n+ Experience with Ruby and Ruby on Rails, Javascript, relational databases, and front-end tools such as templating languages and SCSS\n+ Be located, or willing to move to the Bay Area during summer 2015<p>If interested, please send whatever you have (resume, linkedin, github, website, etc.) to:<p>jobs+internships@watsi.org<p>Thanks!\n-Oscar (oscar@watsi.org)","time":1414859033,"type":"comment"}