{"by":"tqn","id":8543565,"parent":8542892,"text":"Luxe - San Francisco, CA - <a href=\"http://www.luxevalet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.luxevalet.com</a> - Full Time - Various<p>Hey HN!<p>I&#x27;m excited to share the opportunities available at our quickly growing startup. Check out our recent press:<p>CNBC: <a href=\"http://video.cnbc.com/gallery/?video=3000326377&amp;play=1\" rel=\"nofollow\">http:&#x2F;&#x2F;video.cnbc.com&#x2F;gallery&#x2F;?video=3000326377&amp;play=1</a><p>WSJ: <a href=\"http://blogs.wsj.com/digits/2014/10/23/new-valet-app-luxe-eases-parking-nightmares/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;digits&#x2F;2014&#x2F;10&#x2F;23&#x2F;new-valet-app-luxe-ea...</a><p>TC: <a href=\"http://techcrunch.com/2014/10/23/luxe-aims-to-solve-san-franciscans-parking-woes/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;10&#x2F;23&#x2F;luxe-aims-to-solve-san-fran...</a><p>NPR: <a href=\"http://www.marketplace.org/topics/tech/parking-valet-demand#.VEqX8M2ERhs.twitter\" rel=\"nofollow\">http:&#x2F;&#x2F;www.marketplace.org&#x2F;topics&#x2F;tech&#x2F;parking-valet-demand#...</a><p>To get a real feel for our business, we invite you to try out our service, currently available in SF. Simply email me at thai [at] luxevalet [dot] com and I&#x27;ll set you up with some free credit.<p>Luxe: A Parking Spot in Your Pocket<p>Luxe removes the pain out of parking through its on-demand valet service. With our mobile app, a driver can request one of our many trained valets to meet her at her destination and park her car. When the customer needs her car back, she can simply use the app to let the valet know and the valet will return it wherever the customer needs it. Our vision is to make circling the block for parking a thing of the past.<p>About The Team<p>The founding team hails from leadership positions at Google, Zynga, Ducati and Tesla. We&#x27;ve assembled an ever-expanding core team of 17, whose diverse backgrounds include the U.S. Marines, Code for America and YC. What unites us is our shared passion for solving complex problems and a commitment to creating a work environment, based on mutual respect for one another.<p>Opportunities: We&#x27;re currently hiring for the following roles:<p>1) iOS Engineer<p>2) Data Scientist<p>3) Marketing Specialist<p>4) Executive Assistant&#x2F;Generalist<p>5) Other - We&#x27;re always looking to meet talented and hungry individuals. If you think you&#x27;d be a good fit, let us know.<p>Ready to apply or learn more? Drop us a note at jobs@luxevalet.com with &quot;HN&quot; in the subject line. We promise to get back to you!<p>Thanks,<p>Thai<p>BD @Luxe","time":1414858746,"type":"comment"}