{"by":"samuelbrin","id":8543879,"kids":[8543898],"parent":8542892,"text":"Robinhood -- <a href=\"https://www.robinhood.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.robinhood.com</a> -- Palo Alto, CA (careers@robinhood.com)<p>Robinhood started with a simple idea: using technology, we can re-think the way financial services operate. We cut out the fat that makes other financial services costly — legacy technology, hundreds of storefront locations, and paper-based accounting. And as a result, we radically reduce costs. Our team members have a diverse set of academic and industry experiences from Stanford, MIT, Caltech, Pixar, Oracle, ETrade, Bungie and Facebook.<p>* iOS Engineer - We’re looking for an experienced iOS engineer to help build the Robinhood iOS app, for both iPhone and iPad. This is truly a next-generation trading app that takes advantage of all the newest iOS 7 and 8 features, while featuring a highly custom UI.<p>* Android Engineer - We’re looking for an experienced Android engineer to lead development of the Robinhood Android app. You will build a highly custom user experience while staying consistent with design guidelines for the upcoming L release. An ideal candidate will have excellent product sense, extensive experience dealing with device fragmentation, and knowledge of retrofit, volley, or similar network communication libraries.<p>* Web Engineer - We are seeking an experienced frontend web engineer to help build the Robinhood web app, for both desktop and mobile. The product features real-time, live-updating data and context-dependent interfaces, so you’ll be building a very rich client-side web application.<p>* Backend Engineer - Robinhood is looking for an experienced backend engineer to help build our brokerage web API. This includes systems such as market data, trading, accounting, authentication, and security. An ideal candidate would have previous experience designing RESTful APIs and the backend systems that implement them.<p>* Senior Release Engineer - Robinhood is looking for an experienced release engineer to develop systems and processes to deploy and monitor our brokerage software. Technologies that we use include AWS, SaltStack, Python, Django, Redis, and PostgreSQL. Experience with SaltStack or comparable alternative (Chef, Puppet, Ansible, etc) preferred. DevOps for those Ctrl+F&#x27;ing for keywords.<p>Please send all inquiries&#x2F;resumes to careers@robinhood.com<p>Robinhood Markets, Inc and its affiliates are equal opportunity employers.","time":1414863889,"type":"comment"}