{"by":"mbesto","id":8543813,"parent":8542892,"text":"Versame | <a href=\"http://versame.com\" rel=\"nofollow\">http:&#x2F;&#x2F;versame.com</a> | San Franicsco Bay Area or Charlotte, NC area | Software (Mobile) Development Lead and Embedded (Firmware) Engineer<p>Versame is a well-funded seed-stage startup founded by three Stanford graduates and experienced entrepreneurs aiming to revolutionize childhood education.  We are building a wearable device that measures the quantity and quality of parent-child interaction. Over 30 years of research shows that the number and quality of words spoken directly to a child is the single greatest predictor of educational success.<p>Compensation: Competitive salary + equity + benefits<p>Job 1 - Software (Mobile) Developer<p>Career Level: 4+ years working preferred<p>Education: CS degree preferred<p>* 3 + years experience in iOS -&gt; Obj-C, CocoaTouch, UIKit, CoreData<p>* Knowledge of Agile Scrum, why it works, what happens when it doesn&#x27;t and can coach both technical and non-technical people through the process<p>* Experience working with databases (e.g. SQL)  and data infrastructure<p>* Familiar with RESTful web services<p>* Ability to effectively lead small agile and distributed teams<p>Job 2 - Embedded (Firmware) Engineer<p>Career Level: Graduate, post-graduate, 2+ years working or experience in embedded area preferred<p>Education: BSCS, BSCE, or BSEE. MSCS, MSCE, or MSEE preferred<p>* Develop firmware architecture for [32-bit ]MCU platform<p>* Design, develop, debug and test firmware for [32-bit] MCUs<p>* C&#x2F;C++ language expertise (as related to resource-limited embedded systems) Experience with software Engineering processes and tools (i.e. - git, gcc) Successful design of Embedded System products<p>* Experience using RTOS&#x27;s and related stacks and middleware<p>* Hands-on system bring-up, testing, and debugging skills<p>* Familiarity with power management, memory management, security and safety systems<p>* Experience with communication protocols; USB, RS232, Bluetooth (4.1)<p>* Team player with excellent communication skills<p>Please send to nicki nicki@versame.com (please indicate in the subject whether you&#x27;re applying for the firmware position or the software lead position)<p>NO RECRUITERS PLS","time":1414862537,"type":"comment"}