{"by":"daveoflynn","id":8543079,"parent":8542892,"text":"Paddington, London, or REMOTE within UK. VISA help available. (<a href=\"http://www.alchemytec.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.alchemytec.com</a>)<p>AlchemyTec is a team of about ten people building software to turn the labour supply market on its head, starting with the UK construction industry. We want to become the Xero of finding, hiring, and paying people. And we need help.<p>We&#x27;re looking for a couple of modern-Java web developers. Ideally at least one will have an interest in levelling-up their front-end skills.<p>Our team has a diverse range of backgrounds, skillsets, and locations. We&#x27;re happy to talk to remote folk, though for now, only as long as you&#x27;re in the UK. We understand visas and right-to-work issues, so if you&#x27;re new in London or wondering about how to get here and pick up a cool job, give us a shout.<p>Our stack, back to front:<p><pre><code>    AWS\n    Docker + Puppet\n    MySQL\n    Dropwizard + Hibernate microservices for new stuff\n    Tomcat for legacy work\n    Jersey + Jackson for REST\n    Angular + jQuery\n</code></pre>\nOur tooling:<p><pre><code>    git\n    maven (ick)\n    gulp + less + browserify\n    Vagrant\n    Bitbucket\n    Bamboo\n    JIRA\n    Hipchat\n    Google Docs\n    mural.ly\n    Confluence\n</code></pre>\nDevelopers do everything from work with product management and design, through coding, test, deployment, and production monitoring and troubleshooting.<p>The application process: If you have a portfolio of OSS work, send us a repo URL and a cover letter: jobs@alchemytec.com. If not, send us a CV with the cover letter. Absent a portfolio of work on a stack similar to ours, we&#x27;ll ask you to do a fairly real-world coding test. We&#x27;ll follow up with a couple of chats on Skype or in person depending on your location. Then we either like each other or we don&#x27;t.<p>Warning: you may have to pretend you like dogs. Several members of the team are mildly obsessed.<p>Questions, comments, flames, etc: dof@alchemytec.com","time":1414851218,"type":"comment"}