{"by":"tair","id":8544748,"parent":8542892,"text":"Ruby developer * REMOTE * Deveo * <a href=\"https://deveo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;deveo.com</a><p>We&#x27;re looking for a talented, experienced, full-time Ruby developer to help us with design, implementation and testing of core Deveo product.<p>Here is who we are looking for:<p>You’re the type of person who is passionate about creating simple and practical solutions that are efficient and pleasant to use. You&#x27;re a coder, enthusiast, mentor, and tech evangelist. You are also an ambitious person with analytical skills, who is ready to take initiatives, but also listens to others. We also expect you to understand the principles of DevOps, enjoy creating developer tools, and willing to learn new technologies.<p>An ideal candidate will have:<p>* Strong Ruby programming skills<p>* Created Rails, Sinatra, and Ruby CLI applications<p>* Experience in deploying Ruby applications<p>* Solid knowledge of SQL and NoSQL databases<p>* Experience building simple, well-designed APIs<p>* Optimized performance of Ruby applications<p>* Tested with Rspec, Test::Unit, Capybara<p>* Working knowledge of C<p>* Familiarity with Linux operating systems<p>* Worked remotely in distributed team<p>* Strong written and communication skills<p>Bonus points for:<p>* Experience building real-time applications and APIs<p>* Open source contributions<p>* Past startup experience<p>* Familiarity with Node.js<p>Interested?<p>We offer possibilities for career progression in the company. You will have an opportunity to make a difference in an innovative bootstrapping tech startup. You will be able to work from anywhere and anytime, as long as you can make some of your working time overlap with business hours in the GMT+3 time zone. Read more about our working culture and hiring process at <a href=\"https://coderwall.com/team/deveo\" rel=\"nofollow\">https:&#x2F;&#x2F;coderwall.com&#x2F;team&#x2F;deveo</a>.<p>The perfect candidate has a passion for craft and a resume to back it up. Please send us links to your works, Github, Blog or any other resources you are proud of. Also, please attach a cover letter telling about yourself and why do you want to work for Deveo.<p>Apply for this job\n<a href=\"https://deveo.workable.com/jobs/23629/candidates/new\" rel=\"nofollow\">https:&#x2F;&#x2F;deveo.workable.com&#x2F;jobs&#x2F;23629&#x2F;candidates&#x2F;new</a>","time":1414878486,"type":"comment"}