{"by":"bsnyder","id":8544624,"parent":8542892,"text":"hybris software | <a href=\"http://hybris.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;hybris.com&#x2F;</a> | Boulder, CO<p>hybris is embarking upon a journey to create a comprehensive data management platform that allows for the collection of large data volumes and real-time analytics needs. We are particularly focusing on the domain of customer data aimed at driving customer insights and relevance into our product portfolio.<p>This person must have a unique mix of both domain knowledge and implementation experience in the big data problem space. We are seeking someone with experience as an architect as well as hands-on experience with big data tools and technologies. This person will be instrumental in helping to carry out this vision from conception to reality.<p>Minimum Qualifications<p>* BA&#x2F;BS degree in a computer related field (10+ years of degree relevant experience)<p>* Ability to work within distributed teams around the globe, in a highly collaborative and fast-paced environment<p>* Deeply analytical capability and experience in big data problem space<p>* Ability to write production level code<p>* Significant hands-on experience in software engineering related fields, e.g., Java web development, data mining, business intelligence<p>* Ability to wear multiple hats around architecture and software engineering<p>Preferred Qualifications<p>* Experience in implementing and&#x2F;or operating big data applications in a public&#x2F;private cloud environments<p>* MS&#x2F;PhD in a quantitative subject would be beneficial<p>* Direct experience utilizing Agile methods and practices (e.g., Scrum, Kanban, etc.)<p>* Domain knowledge in customer data related fields with strong quantitative focus (e.g. CRM, Marketing, Customer Analytics, ecommerce)<p>* Deep experience with predictive and&#x2F;or prescriptive analytics<p>* Hands-on experience with several of the following big data technologies: Hadoop (HDFS, HBase, Hive, Pig, Squoop), Spark, Storm, Cassandra, MongoDB, Kafka, Mahout<p>* Deep experience with and practical application of graph databases, e.g., Neo4J, OrientDB, Titan, in-memory databases<p>* Experience with relevant SAP products such as SAP HANA, SAP ERP, SAP BW, KXEN&#x2F;InfiniteInsight would be a plus<p>Responsibilities<p>* Be the bridge between product management and the development of a platform for collecting and analyzing data<p>* Deeply understand (and possibly challenge) business requirements and provide a vision of a software implementation<p>* Work as part of a small team to craft and implement a platform for data collection and analysis<p>* Development of proofs-of-concept to validate various approaches and assumptions<p>* Influence and&#x2F;or decide on technology selection for the platform<p>Please submit your CV at endurancecrew AT hybris DOT com referring to Big Data Architect.","time":1414876161,"type":"comment"}