{"by":"brendankemp","id":8544430,"parent":8542892,"text":"WeSpire — Boston, MA\nSenior Engineer<p>Hi there! We (WeSpire) are looking for a Senior Rails Engineer.<p>Guess What? That developer could be you!<p>If you&#x27;ve ever wanted to work with a world-class team on a brand new type of product that is being used for good in some of the biggest companies in the world, this could be your chance.<p>### What does WeSpire do?<p>WeSpire gets people to do things that matter, and measures the impact. We use behavior change models to design interactions that encourage people to act differently. Then we measure the delta in their actions, analyze the real-world impact, and display the information back to the user. We started in the sustainability space, and now work for many different applications, including volunteering, diversity, and happiness at work.<p>### What will I work on?<p>#### 1: Design Implementation<p>You will take designs from our product team, and turn them into working features.<p>You will work in one of two modes: prototype mode or production mode.<p>Sometimes, you will build code to last the next 4 years.<p>Sometimes you will build experiments to last the next 4 weeks.<p>You will know the difference between prototype mode and production mode and be comfortable working either way, because we are building solutions that are entirely new, and there isn&#x27;t a ton of known art, so we end up figuring out many things from scratch! (This should excite you)<p>#### 2: Writing Code<p>When you are writing code you will understand how people will use it, and you will know how to make things intuitive for them. You will also know when to raise the alarm because a feature doesn&#x27;t fully make sense and will confuse people.<p>Sometimes you will write every part of the feature, from CSS to JS to Ruby to SQL.<p>Sometimes you will split those responsibilities with a coworker.<p>Either way, you will be phenomenal at Ruby and SQL, good at JS, and at least passable at CSS.<p>#### 3: Writing Tests<p>You will write tests that will give you confidence about the behavior of your methods, of your objects, and of the system as a whole. From these tests, you will design code that is object-oriented, and interfaces between objects that are clear and reduce coupling. You will care about the readability, reusability, and performance of your code, and usually in that order.<p>#### 4: Working with Developers<p>You will:<p>* Work with developers who are similarly obsessed with good design and strong tests\n* Care about your coworkers and be invested in their success as well as your own\n* Be a leader in code quality while reviewing code, while mentoring other developers and defining best practices\n* Re-architect major portions of our application, as we rapidly outgrow our current architecture\n* Push the team to select the right technologies to meet our performance, maintenance, and code quality standards<p>### What technologies will I work with?<p>* Rails 4.1+\n* Ruby 2.1+\n* Postgres\n* Redis\n* Resque\n* SASS\n* Coffeescript\n* jQuery\n* HAML\n* Git\n* Github\n* Heroku\n* Slack<p>### OK, but will I actually like working at WeSpire?<p>We think so. If you like tackling difficult problems and working with smart people, you&#x27;ll feel right at home here. On top of that, we work hard to make sure the company culture is strong and welcoming, and that the work arrangements are flexible enough to work for you.<p>Here are some of the things that we do:<p>* Work from home Fridays. Pretty much everyone in the company works from home. It saves emissions, which fits with our sustainability roots, and it&#x27;s nice to have a day to work from your couch.\n* Flexibility on working from home other days too. You will like working from the office, and interacting with your coworkers, but if you have to work from home some day, it&#x27;s not a big deal.\n* &quot;Wine Wednesdays&quot; to bring the entire company together over some drinks\n* &quot;Meat-free Mondays&quot; with a chef-prepared vegetarian lunch for the whole company every Monday!\n* The entire company does an outing together at least twice a year. Previous outings: a scavenger hunt through the streets of Boston and Cambridge, a boat trip to a Boston Harbor Island, and a trip to Hopsters to brew our company beers.\n* Speaking of, we brewed our own company beers, a Belgian Quad and a Double IPA. They&#x27;re not too shabby, if we do say so ourselves.<p>### Compensation<p>Cash comp paired with equity — we are looking for the best and will pay them accordingly. Health coverage and dental benefits, 401k plan. The opportunity for growth in a fast-paced progressive company is yours for the taking.<p>### To Apply<p>Please send a link to projects you are proud of, a resume or LinkedIn profile and your quick thoughts on what’s extremely interesting to you about using technology to inspire positive actions to kim [at] wespire [dot] com.","time":1414872730,"type":"comment"}