{"by":"martinshen","id":8544049,"parent":8542892,"text":"UpOut - SoMA, San Francisco - Full Time Python and PHP<p>Would love to chat and see if there&#x27;s a good fit. Email at Martin@UpOut.com or call my cell at 415 404 5650 (don&#x27;t call me after 8pm PST please).<p>UpOut helps people get out more. Our main monetization is Insiders (&quot;Netflix for Events&quot;). For just $20&#x2F;month our thousands of customers get unlimited pairs of tickets to try new things each month like unique musicals, breakthrough concerts, cooking classes, sake tastings and if they don&#x27;t like any of the options, they can choose movie tickets instead.<p>We have double digit month over month growth, real revenue and have very recently brought on some of the valley&#x27;s top VCs. We&#x27;re hiring engineer #3 and #4 to help us scale up services and get started on some big data projects.<p>Our service is built on PHP, MySQL, Apache, Nginx, Python, Elasticsearch, Java, Memcached and Go. We’re hosted on AWS (EC2, RDS etc.) and use Github.<p>== Python Engineer ==<p><a href=\"http://upout.theresumator.com/apply/SAhv8F/Python-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;upout.theresumator.com&#x2F;apply&#x2F;SAhv8F&#x2F;Python-Engineer.h...</a><p>· 4+ years software development experience developing server-side applications.<p>· Professional experience with Python of at least 2 years (If you don’t have experience with Python, please be willing to learn them and have professional experience of at least 1 year with either Java, C or C++)<p>· Knowledge of SQL, and experience working with and writing high performance code optimized for transactional SQL databases.<p>== PHP Engineer ==<p><a href=\"http://upout.theresumator.com/apply/rEy1lM/PHP-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;upout.theresumator.com&#x2F;apply&#x2F;rEy1lM&#x2F;PHP-Engineer.html</a><p>· 3 years software development experience developing server-side applications.<p>· Extensive knowledge of SQL, and experience working with and writing high performance code optimized for transactional SQL databases.<p>· Professional experience with PHP of at least 2 years<p>=====================<p>Let me know if you have any questions: Martin@UpOut.com or 415 404 5650","time":1414866327,"type":"comment"}