{"by":"swampthing","id":8544487,"parent":8542892,"text":"Clerky - REMOTE - Software Engineer (Ruby on Rails, Javascript)<p>Help fix the legal industry!<p>The way legal transactions are done is filled with inefficiencies, which leads to ridiculously high legal fees. We&#x27;re fixing this by building software that automates and streamlines the process.<p>We&#x27;re profitable and growing. We launched a company formation service last year, and are now one of the most popular ways for high-growth technology startups to incorporate. Y Combinator and 500 Startups both use our software to handle their investment paperwork.<p>If you are interested in fixing the legal industry, this is arguably the best place to be (no hyperbole).<p>We use a lot of Ruby on Rails and Javascript, so familiarity with these technologies is a requirement. That said, we&#x27;re not religious about any particular technology - we believe in using the right tool for a given problem (we also have services written in Scala and Go). We have extensive spec and feature coverage, and have everything hooked up to a continuous integration server.<p>This is a great fit for people who want to work:<p>... at a product-driven company bringing an old-fashioned industry into the future<p>... on a product that has a lot of usage and visibility in the startup community<p>... in a company that strongly values good software development practices<p>... at a financially sound company<p>... hard, with ownership and dedication (but sustainably)<p>... with flexible hours and competitive pay<p>... where you&#x27;ll be a key early hire<p>Some hard requirements we have:<p>- An inability to write anything but clean, maintainable code.<p>- Bothered by code without test coverage.<p>- 5+ years of experience building software as part of a team with strong development practices<p>- 5+ years of experience with Rails and Javascript<p>We are not looking for consultants.  This position is for full-time employment.<p>If all of this sounds good to you, please send (1) your resume and (2) a code sample that you&#x27;re proud of to jobs at clerky.com.","time":1414873722,"type":"comment"}