{"by":"meritt","id":8544314,"parent":8542892,"text":"Savvr - Portland, OR - Full-Time<p>Savvr provides large-scale data collection, analysis, and research for institutional investors. We&#x27;re self-funded and profitable. We&#x27;re looking to add more engineers to our team. We do a wide variety of things so a generalist is more likely to succeed than a specialist. Rather than list specific requirements, I&#x27;ll just list the areas of experience and technologies we currently utilize on a daily basis.<p>* PHP - 5.5, modern code-base, back-end development, daemon processes, distributed workers<p>* MySQL - Medium-to-advanced SQL techniques, proper normalization, tuning configuration for efficiency. We work with PostgreSQL as well.<p>* Data-warehousing Understanding large datastores, star-schemas, fact-dimensions, pros&#x2F;cons of a RDBMS versus a document-storage engine, Hadoop, columnar databases, etc -- all good things to know.<p>* Redis - Acts as a job broker &amp; message queue for our platform<p>* AWS - We utilize a number of AWS services (ec2, route 53, s3, rds, vpc, etc)<p>* Web&#x2F;Mobile - We really dig into how the web and APIs (soap, xml, rest, json, etc) operate on a technical level. Mobile data is just as important. Understanding the role and specifics around things like: http, ssl&#x2F;tls, iphone, android, mitm, reverse-engineering are all important.<p>* Excel - The investment world loves Microsoft Excel and having a very solid understanding of XLSX, auto-generation of spreadsheets, dynamic data-source integrations is important.<p>* Automation&#x2F;testing We run a 24x7 platform and need to be confident things are running smoothly at all times.<p>I understand this is quite a laundry-list of technical skills, and so if you feel you&#x27;re strong in a few or more of these areas, we&#x27;d love to talk to you. We provide a competitive salary and benefits. We&#x27;re a small company and starting our physical footprint here in Portland (we&#x27;ve been 100% remote for the past three years) so we can collaborate better.<p>tim@savvr.com","time":1414870920,"type":"comment"}