{"by":"gnidan","id":8544416,"parent":8542892,"text":"The Pep Boys - Philadelphia, PA<p>Job Description<p>As part of our new, aggressive approach to our use of the web and its technologies, Pep Boys is now searching for a Senior Web Developer to join our growing team at our Corporate headquarters in Philadelphia, PA.   As a member of this team, you will play a key role in developing our internet site – a key corporate objective.  We are looking for a candidate that has a rich understanding of the web’s use with extensive experience developing eCommerce sites.  As a Senior Web Developer, you will be designing and developing web pages for our site using J2EE as well as other technologies.  The successful candidate will be skilled in creating and presenting technical and business solutions, and have the ability to work independently or within a group dynamic.<p>Job Requirements<p>-\t3+ years of  web development experience, particularly on eCommerce sites \n-\tEffective understanding of Website information organization and navigation design\n-\tExperience working  in J2EE or other web development language\n-\tProficiency in HTML, JavaScript and CSS\n-\tProficiency in MySQL or other major databases\n-\tProficiency in UNIX &#x2F; LINUX\n-\tMust be able to work with multiple individuals and departments.<p>Strong knowledge of any of the following technologies is a plus<p>-\tSpring Framework – preferable version 3.0\n-\tJ2EE platform\n-\tAlfresco Content Management System\n-\tApache Tomcat Web Server\n-\tWeb Services\n-\tJava Server Pages\n-\tEclipse Development Environment\n-\tApache Ant\n-\tApache Maven 2\n-\tWeb Analytical, monitoring, and testing tools<p>Experience and Education<p>-\t3+  years of web development \n-\tBachelor’s Degree Preferred but not required<p>Pep Boys Auto is the nation&#x27;s leading automotive aftermarket retail and service chain. We continue to lead our industry with trusted, credible and helpful associates who focus their passion for cars on our customers and their needs.  We are the automotive solutions provider of choice for the value-oriented customer. We offer a competitive salary and a comprehensive benefits package that includes medical, dental, vision, tuition reimbursement, and a 401(k).<p>If interested, please email my manager at john_cunningham@pepboys.com.","time":1414872532,"type":"comment"}