{"by":"conversica","id":8545701,"parent":8542892,"text":"Conversica - Bellingham, WA - \n<a href=\"https://conversica.com\" rel=\"nofollow\">https:&#x2F;&#x2F;conversica.com</a><p>We use artificial intelligence to help businesses efficiently find new customers and nurture existing ones.  Our software turns qualitative customer feedback into quantitative data that our clients can act on.  We have an international presence with clients in the Automotive, Insurance, Finance, Mortgage, and Education industries.  We pay competitive salaries and 100% of salaried employees&#x27; health insurance, have 401(k) matching, and offer daily catered meals.<p>TEST ENGINEER  -  Work with product development at all stages in order to promote product quality. This includes the development of processes for review of various components, testing procedures, testing systems, automated testing, cross-platform testing, determining performance requirements and confirming requirements have been met.  <a href=\"https://www.linkedin.com/jobs2/view/25374773\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;25374773</a><p>SYSTEMS ADMINISTRATOR  -  Responsible for enhancing and maintaining our server and network infrastructure to achieve business and technical goals.  Will work closely with system architects and developers to create new services, maintain existing ones, and perform complex troubleshooting when problems arise.  <a href=\"https://www.linkedin.com/jobs2/view/25373686\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;25373686</a><p>INFORMATION SECURITY ENGINEER  -  Maintain and enforce company-wide security policies, review and recommend strategies for implementing policies, coordinate security training and awareness, coordinate responses to actual or suspected breaches.  Responsible for ensuring the confidentiality, integrity and availability of company data.  <a href=\"https://www.linkedin.com/jobs2/view/25373642\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;25373642</a>","time":1414905162,"type":"comment"}