{"by":"frabrunelle","id":8545633,"parent":8542892,"text":"MaidSafe - C++ 11&#x2F;14 open source software engineer - Troon, Scotland<p>MaidSafe is currently looking for C++ open source software engineers based at our headquarters in Troon, Scotland. If you, or someone else you know fits the bill and would like to work at MaidSafe, please get in touch with us: justine.mclevy@maidsafe.net<p>Role<p>Can you imagine a new decentralised Internet, free from corporations selling your personal details and private information for their profit, where all data is secure, private and anonymous? What if this new network was comprised of the spare computing resources of the world’s Internet users and has already seen over three years of cutting edge C++ 11&#x2F;14 source code written for it? What if the company building this new platform was based away from cramped, expensive London on Scotland’s tranquil, beautiful and rugged South West coast, yet with excellent transport links to major cities and just a few miles from an International airport?<p>The company implementing the replacement for much of the Internet’s services is called MaidSafe and they plan a public launch of the platform later this year. This new network has generated much interest from the world’s technology press.<p><a href=\"http://techcrunch.com/2014/07/23/maidsafe/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;07&#x2F;23&#x2F;maidsafe&#x2F;</a><p>The Server Needs To Die To Save The Internet<p><a href=\"http://www.forbes.com/sites/kashmirhill/2014/04/08/beyond-bitcoin-crypto-ownership-companies-hope-youre-ready-to-decentralize-everything-on-the-internet/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;kashmirhill&#x2F;2014&#x2F;04&#x2F;08&#x2F;beyond-bi...</a><p>Beyond Bitcoin: Crypto-Ownership Companies Hope You&#x27;re Ready To Decentralize Everything On The Internet<p>Welcome to the age of crypto-ownership, where any kind of data can be encrypted and managed by a decentralized network of computers.<p>MaidSafe recently raised over $8m from one of the first ever cryptocurrency-based rounds of financing. As the company approaches product launch, they are looking to strengthen their team with C++ engineers experienced in open source software to help nail bugs and add that final polish.\nYour initial role will be to familiarise yourself with MaidSafe’s implementation libraries and once you are comfortable with the code, you will become a key part of MaidSafe’s core development team. \nPlease have a look at the quality of work for yourself at <a href=\"https://github.com/maidsafe\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;maidsafe</a>. \nLeading Boost and ISO C++ committee members have contributed to the code; it is an exemplar of modern practice and is written exclusively in C++ 11! You may also find MaidSafe’s Continuous Integration testing dashboard of interest: <a href=\"http://dash.maidsafe.net/index.php?project=MaidSafe\" rel=\"nofollow\">http:&#x2F;&#x2F;dash.maidsafe.net&#x2F;index.php?project=MaidSafe</a>.<p>Mandatory requirements:<p>- Based at MaidSafe’s HQ in Troon, Scotland, 5 miles from Glasgow Prestwick International Airport.<p>- At least 90 days where you sent a commit of C++ code to an open source code repository which we can verify.<p>- At least 180 days where you sent a commit of anything to an open source code repository which we can verify.<p>It would be great if you could supply us with a github.com or sourceforge.net or equivalent account for us to have a look through (the more the better).<p>Good to have:<p>- A proven track record of submitting quality bug reports to open source issue trackers, preferably with bug fixes. Some links to examples would be great.<p>- Proven CI configuration experience,preferably Jenkins though Travis and others are fine, although it would be even better if there is a place on the internet displaying evidence of your experience in this.<p>- Proven experience with unit testing frameworks, preferably Google Test although others would be fine too. It would be very useful to provide some links to test code that you have written.<p>- Proven experience with writing code for at least two of Microsoft Windows, Linux, Apple Mac OS X, Android, iOS or WinRT. MaidSafe code is expected to run on all of these. Again links to examples would be great.<p>- Proven experience with writing C++11&#x2F;14 code, especially using the C++ 11&#x2F;14 STL. Links to examples please!\n- A presence on Stack Overflow, where you have asked or answered hard questions and been recognised by others for your answers.<p>- At least a minimum of experience writing C++ which works on Microsoft C++ compiler. MaidSafe code needs to work on Visual Studio 2013, so you would have to constrain your C++ to that feature set whilst awaiting Visual Studio 14 to be released.<p>Lovely to have<p>- Proven experience with code correctness checking tools such as valgrind, Purify, clang sanitisers and equivalents. Examples of where you have used them would be great.<p>- Proven experience with code peer review tools such as Gerrit or equivalents, with links to examples if possible<p>- Proven experience with CMAKE on both Windows and on POSIX, again with examples to links if possible<p>- Proven experience in writing and debugging multithreaded code, again any links where you wrote or debugged some multithreaded code would be very useful. In an interview, we would certainly ask for details on this as the MaidSafe code base is multithreaded.<p>Ideal to have (don’t worry if you don’t)<p>Proven experience in the Boost C++ libraries and C++ STL. Examples may include:<p>- History of posts to mailing lists.<p>- Stack Overflow answers.<p>- Books written on C++ theory or practice.<p>- Papers submitted to ISO C++ standards committees, preferably WG21.<p>- Your own code that has passed an open source community review (or even submitted for a review and was rejected). Presentations or lectures given at computer science related conferences. Links to the video of your talk would be superb.<p>- Academic papers on computer science theory or practice. Rejected\npapers are welcome.<p>Working at MaidSafe<p>MaidSafe is a small and highly innovative open source technology company where your role is likely to be more varied than the highly specialised roles typical in a corporate employer. They are developing a decentralised and global computing platform that will fundamentally change how the Internet works for millions of users, delivering privacy, security and freedom for everyone. This role provides the opportunity to work for a cutting edge Open Source company with a big future, as well as the freedom to push your skills to the limit.<p>The location<p>MaidSafe are headquartered in Troon, on Scotland’s beautiful West Coast. Troon is a small and affluent town and has an excellent choice of independent bars, restaurants and shops, with first class transport links including a rail link and an international airport .<p>The area is a popular with families and is within easy reach of a number of excellent state and private schools, serving both primary and secondary students. There are also a number of Universities within easy reach and it is worth mentioning that University education is free of tuition fees for Scottish residents. Troon is well known for its large expanse of sandy beaches and those who prefer an active lifestyle will find first class golf, rugby, fishing, football and cycling on their doorstep. Located just 30 minutes from Glasgow, Scotland’s largest and most vibrant city, there is easy access to some of Europe’s best shopping and a lively nightlife.<p>Compensation<p>Being located in Scotland has advantages beyond the clean air and stunning scenery. Household expenditure is just 60% of that in London and average rental payments are 46% below the UK average. Similarly, mortgage payments are 17% below the UK average, while Scotland is estimated to have the 14th best standard of living anywhere in the world, based on GDP. It is also worth noting that the UK median gross annual income within the Information and Communication sector was just under £36,000 in 2012, the highest of all industries.<p>Further to a 3 month trial period, the salary at MaidSafe is £40k per annum. New employees will also become part of the employee benefit trust, an ownership scheme that currently distributes more than 25% of the company’s shares amongst a team of 15.<p>How to apply<p>Please supply MaidSafe with a list of URLs of evidence showing them why you would be a great hire, explaining the context of those URLs where necessary and the company will get back to you if we would like any additional information.","time":1414902692,"type":"comment"}