{"by":"rchiba","id":8545735,"parent":8542892,"text":"Tint (<a href=\"http://www.tintup.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tintup.com</a>) — San Francisco (SOMA), CA - Full Time Looking for Full Stack Web Developers, Front End Developers, Back End Developers, Support, and Sales&#x2F;Account Management<p>-----------------------<p>ABOUT TINT<p>Tint&#x27;s mission is to help organizations drive deeper relationships with their customers through social media. We are a group of 18 engineers and customer happiness heroes with a profitable, sustainable business and a great working environment.<p>When we started in January 2014, we made $101K. Last month, we made $352K.<p>Simply put, we have too many customers, and too few quick minds.<p>Join us on this incredible journey to become a market leader in the social media display and aggregation space. We have plenty of interesting engineering challenges to conquer and relationships to nurture with big brands with endless opportunity for personal growth along the way. Some of the tech we work with: MySQL, Redis, Ruby on Rails, PHP, Marionette &amp; Backbone.js<p>-----------------------<p>DETAILS<p>• on the positions available: <a href=\"https://jobs.lever.co/tint?lever-source=HN\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;tint?lever-source=HN</a><p>• on Tint company culture: <a href=\"http://www.tintup.com/about\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tintup.com&#x2F;about</a><p>• on our incredible journey: <a href=\"http://www.tintup.com/blog/tint-year-in-review-2013/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tintup.com&#x2F;blog&#x2F;tint-year-in-review-2013&#x2F;</a><p>• on our profit sharing: <a href=\"http://www.tintup.com/blog/restructuring-your-sales-commissions-teamwork-startup/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tintup.com&#x2F;blog&#x2F;restructuring-your-sales-commissi...</a><p>• on our startup role models: <a href=\"http://www.tintup.com/blog/startups-need-role-models-too/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tintup.com&#x2F;blog&#x2F;startups-need-role-models-too&#x2F;</a><p>• on a few of our customers: <a href=\"https://www.flickr.com/photos/124773594@N04/sets/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.flickr.com&#x2F;photos&#x2F;124773594@N04&#x2F;sets&#x2F;</a><p>-----------------------<p>BENEFITS (besides the competitive salary and equity...)<p>• Profit Sharing - We split 20% of all revenue made over 200k and distribute it evenly among the team.<p>• Team Transparency - We calculate compensation based on a formula that we all agree on. Cap table is made available to all employees. Business financials are known by all teammates.<p>• Personal Autonomy &#x2F; Consensus Driven Culture - We foster consensus-driven rather than top-down decision making when it comes to important business decisions. From what features to build next to what furniture to buy for the office, we believe it&#x27;s the fairest way of making decisions.<p>• Customer Driven Culture - We&#x27;re very in-tune with our customers and they love us. For example, we decide what features to build based on surveys we send directly to customers. Check out this one ( <a href=\"http://bit.ly/1fc73kh\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1fc73kh</a> ) that we sent out last year to decide what we would build this past quarter.<p>• Personal Development Stipend - A monthly stipend designed for self-improvement. Whether it&#x27;s books, yoga classes, or a fitness tracker, we want our teammates to improve themselves.<p>• Catered Lunch Everyday - Yum!<p>APPLY HERE: <a href=\"https://jobs.lever.co/tint?lever-source=HN\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;tint?lever-source=HN</a>","time":1414906108,"type":"comment"}