{"by":"woodhull","id":8547163,"kids":[8598509],"parent":8542892,"text":"ControlShift Labs - Remote Team (Global). Ruby&#x2F;Rails or DevOps - Freelance Contractor or Full Time. \n<a href=\"http://www.controlshiftlabs.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.controlshiftlabs.com&#x2F;</a><p>What we do:<p>We build a set of software tools that online advocacy organizations use to scale their work and make it more participatory. We&#x27;re excited about supporting a shift in how advocacy organizations are using the internet to organize  -- and building tools that empower ordinary activists in extraordinary ways.<p>We&#x27;re a small team of software engineers and online organizers with several decades of combined experience in the advocacy sector, including at Organizing for America, ActBlue, CREDO, MoveOn.org, and Purpose. Our deep organizing and technology background, coupled with a close interest in our partners’ campaigns and goals, lets us develop tools that are particularly effective in facilitating effective grassroots organizing and building strong and participatory organizations. We have a deep commitment to progressive social change around the world that infuses our work.<p>We&#x27;re profitable.<p>Tech:<p>We&#x27;re pragmatic about the technologies we use in our work but at the moment our stack includes ruby, rails, rspec, postgres, redis, sass and haml. We practice test driven development, hold daily team stand-ups via Google Hangout, and use an agile inspired process.<p>At the moment we&#x27;re looking for help with two roles:<p>- A dev ops contractor to help us fully automate our infrastructure using chef &#x2F; aws &#x2F; cloudformation &#x2F; packer &#x2F; vagrant &#x2F; etc.<p>- Contract or full-time Ruby&#x2F;Rails developers to help us with product feature development.<p>We offer the opportunity to do work that matters (with amazing social change organizations) with a flexible work environment and fair market compensation.<p>You must be comfortable working remotely (we meet up 2-3 times a year) and communicating in written and verbal English.<p>Emails us at talk@controlshiftlabs.com with your CV, a github profile and a pointer to some code that you&#x27;ve written that you are particularly proud of, and why you&#x27;d like to work with us.<p>Thanks!<p>Nathan","time":1414948361,"type":"comment"}