{"by":"mapdock","id":8550743,"parent":8542892,"text":"Grow (Norfolk, Virginia USA) - A leading digital agency with a focus on innovation and creative technology - Front and back end developer roles (2 openings)<p>We’re a team of close-knit creatives, technologists, strategists, and producers whose skills are matched only by our dedication. Our hard work put us on the map, and our commitment to creative innovation keeps us there.<p>Grow is currently hiring to fill two positions, one for a skilled mid&#x2F;senior-level front end developer accomplished in HTML&#x2F;CSS&#x2F;JavaScript and excited about new technologies and challenges. Our project-driven environment keeps the work fresh, and we&#x27;re committed to building the very best creative and technical workflow possible around progressive open source tools. Recent projects that demonstrate our typical output can be seen on our site at <a href=\"http://www.thisisgrow.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thisisgrow.com</a>.<p>We&#x27;re also looking for a person at a senior level to develop back-end solutions for our data-driven executions in web, mobile, and emerging technology. This includes API development, custom content management, front-end integration, image&#x2F;video rendering, and other complex builds.<p>Both positions are full-time employee roles at our office in Norfolk, Virginia.<p>=== About Grow ===\nAmazing clients and an inspiring environment come standard, but the best part is finding yourself among a close-knit group of about 30 incredibly talented and motivated colleagues. We’re part of a community of like-minded people in the Norfolk &#x2F; Virginia Beach area who spend our time creating great work and building culture around us—with lovely beaches, urban amenities, and family-friendly opportunities throughout the region. A wealth of company benefits include health, dental, matching 401k, disability, paid vacation and holidays, paid training, and more.<p>See our work and our surroundings at www.thisisgrow.com. Qualified applicants should e-mail jobs@thisisgrow.com, including work history and relevant portfolio links.","time":1415023068,"type":"comment"}