{"by":"courtneypowell","id":8552500,"parent":8542892,"text":"Real HQ, Junior Controller, REMOTE<p>Real HQ is the company behind Agent Pronto <a href=\"https://agentpronto.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;agentpronto.com&#x2F;</a>. We help home buyers and sellers find awesome real estate agents in their area. We’re four years old and growing quickly.<p><i>What We Believe</i>\nWe started this business with inspiration from Seth Godin and 37signals. We keep our fires going with inspiration from Frank Chimero, The National, Louis CK, and Warren Buffett.<p>We also have some Clubhouse Rulez to help guide us in our work:<p>-We will be artists.\n-We will asynchronously overshare.\n-We will work hard, but we won’t work long.\n-We will not create emergencies because we know that most often, they are created.\n-We will make things beautiful and profitable. We will even make beautiful more profitable.\n-We will speak to customers, partners and co-workers like a friend, not a corporate robot.\n-We will make ourselves better so we can make the world better.\n-And we will have a fucking blast doing it.<p><i>Work Anywhere</i>\nWe’re looking for people who live in the United States. Once hired, you’ll have the flexibility to work from anywhere. If working from home in your pajamas sounds like fun, give that a shot. Or you might be interested in checking out a coworking space in your area. You can even travel to exotic lands like Walla Walla, Keokuk, Cucamonga, or Seattle! Location is irrelevant as long as you do your job and you do it well.<p>If Real HQ had a home, it would probably be Austin, Texas. But we have folks who live in big cities like Kansas City, Chicago, and Portland and not-so-big cities like Bozeman, Lewis Center, and Erie. Some of us travel while we work. Ryan managed accounts and did yoga in a Berlin coworking space. Kym worked from a castle in San Juan. Peter pushed code from planes, trains, and a 2010 Hyundai Elantra.<p>Last year, our team got together for a weeklong retreat in the artfully-minded desert town of Marfa, TX. This year, we opted for the Rocky Mountains and headed to Boulder, CO.<p>Think You’re a Good Fit? Great, because we’re hiring! Available positions are listed below.<p>Click through to learn more about each role.<p><i></i>Junior Controller: <a href=\"http://realhq.com/jobs/junior-controller\" rel=\"nofollow\">http:&#x2F;&#x2F;realhq.com&#x2F;jobs&#x2F;junior-controller</a><p>Don’t see a role that’s a good fit? Get in touch with us anyway. We’re good at finding a place for smart, passionate people who are excited about what we’re doing and want to help us do it even better.<p><i></i>Add HackerNews to the subject line of any email you send us!","time":1415039328,"type":"comment"}