{"by":"maramaemartin","id":8554360,"parent":8542892,"text":"San Francisco, CA - Full-Time Lead Dev Ops Engineer needed for MongoLab <a href=\"https://mongolab.com/welcome/\" rel=\"nofollow\">https:&#x2F;&#x2F;mongolab.com&#x2F;welcome&#x2F;</a><p>MongoLab is a fully-managed cloud database service featuring highly-available MongoDB databases, automated backups, web-based tools, 24&#x2F;7 monitoring, and expert support. Developers absolutely love us because our Database-as-a-Service (DBaaS) allows them to focus their attention on product development instead of operations.<p>Who we&#x27;re looking for:\nWe are looking for a Lead DevOps Engineer to take a major leadership role in managing our vast fleet of MongoDB deployments and making our users the happiest and most productive MongoDB developers on the planet.<p>You&#x27;ll be responsible for: \n* The uptime and reliability of our fleet of hundreds and thousands of databases on various cloud platforms \n* The uptime and reliability of MongoLab&#x27;s infrastructure \n* Maintaining our Node.js and Python ops toolset for cloud and database operations \n* Customer and community communications regarding our cloud service<p>Our ideal candidate: \n* Has at least 2 years of experience handling technical operations for a SaaS or IaaS product \n* Is exceedingly responsible, organized, detail-oriented, and would be regarded by peers as precise, careful, thoughtful, and &quot;on it&quot; \n* Is extremely serious about data durability and availability \n* Loves problem solving and is naturally inclined to provide unbelievable customer service \n* Has programming experience, ideally in Python, Ruby, or Node, and experience using automation tools such as Chef or Puppet \n* Has good working knowledge of Linux and experience configuring and deploying applications to AWS or equivalent<p>What we can offer you: \n* Competitive salary, equity, health benefits, and 401k \n* An environment that gives you the flexibility to seize moments of inspiration<p>How to apply: * The Sourcery will be the first point of contact. * All applications receive a response. * All applications are kept strictly confidential. * To apply, please visit: <a href=\"http://www.thesourcery.com/jobs/824/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;824&#x2F;applications&#x2F;new</a>","time":1415058934,"type":"comment"}