{"by":"maramaemartin","id":8554653,"parent":8542892,"text":"Emeryville, CA (SF Bay Area) - Senior Full Stack Engineer wanted for TubeMogul (www.tubemogul.com)<p>About Us: TubeMogul is an enterprise software company for digital branding. By reducing complexity, improving transparency and leveraging real-time data, our platform enables marketers to gain greater control of their digital video advertising spend and achieve their brand advertising objectives.<p>The Role: We&#x27;re looking for a Senior Full Stack Engineer to join our engineering team. We have some redesigns and new features in the works, and we need your expertise to architect and lead implementation of these end to end. You&#x27;ll design and develop analytics dashboards, optimize application performance and responsiveness, and help us grow our edge as an effective high-frequency trading platform for video advertising.<p>Our Ideal Candidate Has: * 3+ years of professional experience developing a web application in modern OO- languages and MVC frameworks * 2+ years developing web applications in PHP, and some demonstrated experience with PHP MVC frameworks. We work in Kohana and CodeIgniter, but if you&#x27;ve used Zend, Symfony, Laravel or others that&#x27;s a great start. * Demonstrated experience developing features in JavaScript. If you&#x27;ve used tools like Node, Angular, Ember or Backbone we&#x27;d be thrilled! * Experience developing the full stack of a web application, including the front end.<p>Here&#x27;s what we&#x27;re offering:* Competitive salary, benefits, 401K and stock options that mean something (We went public in July 2014!) * Generous time off, including your birthday * Training and career development through TubeMogul Academy * High growth and momentum for rapid career advancement * Newly expanded, sunny office with a game room and a Zen room. * Hungry? We offer catered breakfast, fully stocked kitchen with drinks and snacks, and we occasionally cater lunch and dinner. * Coming from across the Bay? Our dedicated BART shuttle bus will get you to the office in no time.<p>How To Apply: * The Sourcery will be the first point of contact. * All applications receive a response. * All applications are kept strictly confidential. * To apply, please visit: <a href=\"http://www.thesourcery.com/jobs/799/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;799&#x2F;applications&#x2F;new</a>","time":1415063249,"type":"comment"}