{"by":"maramaemartin","id":8554404,"parent":8542892,"text":"San Francisco, CA - Full-Time Dev Ops Engineer Needed for iMatchative <a href=\"http://imatchative.com\" rel=\"nofollow\">http:&#x2F;&#x2F;imatchative.com</a><p>We&#x27;re iMatchative and we&#x27;ve built a state of the art, two sided, cloud-based network that helps investors and funds alike find stickier, more satisfying investments with innovative algorithms, behavioral and traditional statistics and analysis. We&#x27;ve called our product ALTX and it&#x27;s connecting the right investor to the right fund.<p>We&#x27;re looking for an experienced and talented Dev Ops engineer to join our growing engineering team. As our first hire in this area you&#x27;ll architect and own all configuration management, deployments and help us provision servers for our platform.<p>We&#x27;ve partnered with an outside Ops provider since our product went live, and you&#x27;ll continue to partner with them as you also grow your own operations team.<p>Here are some challenges you&#x27;ll help us solve: * Migrate our entire infrastructure to Amazon EC2, manage and deploy our new Vagrant development environments. * Collaborate daily with engineering, QA and Product Managers to plan, deliver and manage our services for efficient deployment and maximum uptime. * Own backups, restores, upgrades and all monitoring for our product.<p>Our Ideal Candidate Has: * 2+ years of professional Dev Ops experience using managed cloud services like AWS. * Some professional experience with continuous integration servers and systems Bamboo and Jenkins, and automation tools Chef and Puppet. * Experience scripting in Python or Ruby and a deep understanding of Git. * Experience serving in a rotating on-call as part of an engineering team.<p>What We Can Offer You: * Competitive salaries, comprehensive health&#x2F;vision&#x2F;dental benefits, 401K plan, equity, and much more.<p>How To Apply: * The Sourcery will be the first point of contact. * All applications receive a response and are kept strictly confidential. * Apply here: <a href=\"http://www.thesourcery.com/jobs/803/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;803&#x2F;applications&#x2F;new</a>","time":1415059550,"type":"comment"}