{"by":"kcrossisec","id":8557620,"parent":8542892,"text":"iSEC Partners - San Francisco, Seattle, Austin, New York City - Job Title - Security Engineer; Security Engineering Intern<p>Are you someone who loves to dig into things, take them apart, and figure out how they work?<p>Do you not just use computers, but know how they work -- and how to exploit their weaknesses? Do you know how to make tools to get the job done?<p>Do you enjoy doing cutting edge security research and telling the world about it?<p>iSEC wants to hear from you!<p>iSEC Partners is looking for security-focused engineers and researchers to join our application security consulting and research practice. Job duties will include penetration testing, security analysis, and cutting-edge research into current technologies and attacks. You will spend most of your day thinking about security systems and how they can break. This is a very creative job that gives individuals a lot of freedom to be clever while learning new technologies at a very fast pace. Typical engagements will pair you with another experienced security consultant who you will learn from and teach along the way. Engagements are usually 2-4 weeks long. In a year, you will be exposed to 15-20 products and technology stacks. Your work will typically initiate person-months of security improvements in products millions of people use. You will have access to senior engineers&#x2F;architects and your findings&#x2F;ideas will be heard by senior decision makers. You will have enormous impact in making the software people use safer. All of our consultants are also security researchers, with dedicated research time. Check out some of our research work here:<p><a href=\"https://isecpartners.github.io/\" rel=\"nofollow\">https:&#x2F;&#x2F;isecpartners.github.io&#x2F;</a><p>Check out all of our career opportunities here:\n<a href=\"https://www.isecpartners.com/about/careers.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.isecpartners.com&#x2F;about&#x2F;careers.aspx</a>","time":1415120984,"type":"comment"}