{"by":"jsfour","id":8577118,"parent":8542892,"text":"octavius labs : Los Angeles : Tech Lead : <a href=\"http://bit.ly/1GBhnwm\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1GBhnwm</a> : Ruby on Rails&#x2F;Node.js&#x2F;Ember\nFounded:    2014<p>Funding:    Self Funded &amp; In Revenue<p>Website:    <a href=\"http://octaviuslabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;octaviuslabs.com</a><p>Company Focus:    A product studio based on LA.<p>Compensation:     Salary with equity<p>#### About Us:<p>At octavius we build SaaS products and assemble teams to support the products as they grow.<p>Businesses fail because they run out of cash, yet many companies are still founded without thinking about how, or if, the business will make money. These types of companies push forward in hope of getting acquired but this strategy isn’t sustainable. Businesses are not lottery tickets.<p>At octavius we are more interested in building sustainable businesses. We incubate ideas that can generate cash from day one, and our process of systematically approaching product development allows us to better understand risk. Once we have an accurate understanding of a market, products that have the best opportunity to succeed are spun out into their own companies to grow.\nThe partners of octavius are founders who have bootstrapped to sustainability or sold businesses in the marketing tech space.\nWe are currently based in a beautifully restored brick warehouse located in El Segundo’s just south of LAX.<p>#### Tech Lead Responsibilities:<p>The tech lead should think of development as a craft and see themselves as master craftsmen. They are primarily responsible for the development and maintenance of the products that we are incubating. Ideal candidates are full of ideas and are constantly looking for ways to improve themselves and the world around them. Candidates should also be able to lead a team of developers.<p>#### General Requirements:<p>* The belief that the only limitation on what is possible is ones imagination<p>* Open mind<p>* Self motivated<p>* A passion for learning<p>* The ability to “think on your feet”<p>* A willingness to solve problems with the best technology available<p>* Enjoys working on various projects<p>* Must operate effectively on a team<p>* Hustle<p>#### Specific Requirements:<p>* Clear written and oral communications skills<p>* 5+ Years experience writing production quality code<p>* Demonstrated experience working in multiple tech stacks ie Rails&#x2F;Node&#x2F;Ember<p>* Experience launching and managing AWS instances<p>* Experience recruiting and leading a team<p>* A CS degree or equivalent work experience<p>* SaaS experience is a plus<p>Email recruiting {at} octaviuslabs.com if interested","time":1415460750,"type":"comment"}