{"by":"jspiral","id":8588415,"parent":8542892,"text":"Unnamed new venture | Los Angeles (Santa Monica) | Designer, Full Stack Developers<p>We&#x27;re looking to form a new team inside of a medium sized business (180M revenue last year). I have a history of doing work with these guys and will be joining full time to do this.<p>We will be developing a new product for brand management and content quality across world markets. I&#x27;m convinced that there is a need for this service and that the existing client base of the business will put it to immediate use as it comes into existence.<p>The office will be somewhere on the west side of Los Angeles. We&#x27;re looking for people who can work several\ndays a week in Santa Monica, Venice, or thereabouts. Some work from home would be fine, along with time flexibility.<p>=================<p>What do we offer?<p>=================<p>This will be greenfield development with control over technology choice and processes, while at the same time working reasonable hours in a stable and profitable company. Benefits will include good health insurance, 401k matching, and options in the parent company (held by private equity, liquidity event about 4 years down the road).<p>===================<p>Who would be a fit?<p>===================<p>We&#x27;re planning to get to initial launch with 3-4 team members:<p>- A designer with UX chops (&quot;Academic&quot; UX is relevant to the application domain, and would be valued, and any interest in CSS or other frontend development skills is great too)<p>- 2-3 Full stack developers, where at least one person is very strong with Angular or Backbone and is in general a real Javascript engineer<p>===============================<p>What technologies are relevant?<p>===============================<p>Generalists who have experience in several technologies are ideal.<p>The plan is to collectively decide what technologies to use as the team comes together. My own recent projects have used:<p>Angular &#x2F; Backbone<p>Python &#x2F; Ruby<p>Rails &#x2F; Django &#x2F; Sails.js<p>rspec &#x2F; unittest &#x2F; mocha<p>Sidekiq &#x2F; Celery<p>Postgres<p>Riak<p>Redis<p>SOLR<p>Ansible &#x2F; Docker &#x2F; Vagrant<p>I also have past professional experience in C++, PHP, Java + various frameworks, and C# with the MVC framework.<p>My opinion is that rails has a small productivity edge for this type of project but we may want to optimize for other goals.<p>informal inquiries are welcome, please put Hacker News in the subject line. I&#x27;ll be at the AWS conference this week if anyone is there.<p>doug@coderinger.com","time":1415682587,"type":"comment"}