{"by":"michaelrstubbs","id":8592197,"parent":8542892,"text":"FiscalNote - Washington, DC. Job Title: Jack-of-all-Trades Software Engineer<p>We are looking for software engineers who will never rest in their quest to capture the most relevant and timely information possible. Our software engineers work at the tip of the FiscalNote spear, continuously aggregating large quantities of open data. FiscalNote data scientists and policy experts rely on FiscalNote software engineers to formulate and implement inventive methods of data collection in order to provide the top-tier analysis expected by our customers. Additionally, we are an organization that encourages go-getters who recognize issues, whether assigned to them or not, and solves them. We at FiscalNote are not wedded to bureaucracy, but rather a &quot;getting things done and getting them done well&quot; attitude.<p>Requirements\n•  Expert in Python, C, and C++\n•  Experience using Javascript\n•  In-depth knowledge of database management with Postgresql and MongoDB\n•  An understanding of test-driven development, basic algorithms, and data structures\n•  Data mining and web scraping experience with strong understanding of thread-based and event-based paradigms<p>==========================================================<p>At how many companies can you as a developer sit next to talented team members that in former lives worked in a Senate office, as a Marine Corps Captain, on Wall Street, as a squire at Medieval Times, as an Engineering Director in the Valley, or as early-stage employees at other successful startups? Or where would you have daily conversations with some of the nation&#x27;s premier machine learning and natural language processing Data Scientists?<p>Our team has a wealth of diverse life and career experiences that allow us to think outside of the box and ahead of the curve. And we laugh -- all the time. You&#x27;ll get the opportunity to work at a place that is dedicated to making open data more transparent, all the while pursuing a career that allows you to look forward to going to work in the morning.<p>And technically, you&#x27;ll get the opportunity to help guide and work on the development growth of a company that will be a household name within a few short years. We&#x27;ve already been identified by CNN as one of the Top 10 Startups of 2014.<p>What&#x27;s there not to like?<p>We&#x27;ve also got an incredible group of investors behind us, including Mark Cuban, Jerry Yang (AME Cloud Ventures), NEA, First Round Capital, and Dorm Room Fund.<p>Apply at - www.fiscalnote.com&#x2F;careers or email stubbs@fiscalnote.com","time":1415740283,"type":"comment"}