{"by":"joshuamcginnis","id":8609344,"parent":8542892,"text":"AssetAvenue | Los Angeles, CA 90034 | <a href=\"https://www.assetavenue.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.assetavenue.com&#x2F;</a> | Sr. Software Engineer<p>We&#x27;re looking for a couple of in-house full-time senior software devs to join our growing team and help build our Peer-to-peer real estate crowdfunding platform.<p>We&#x27;re fully funded and gearing up to close a healthy Series A. We have a great culture and are poised for a lot of growth in the coming year.<p>As a member on your team, you&#x27;ll participate in daily stand-ups, be a significant contributor to architectural-design decisions, advocate for developer best practices to your team, and most importantly, write a great deal of quality software that is used by thousands of people across the world.<p>We&#x27;re all Rails &amp; PostgreSQL hosted in Amazon. We work hard but also know how to have a lot fun.<p>----------------------------------------------------<p>Here are the areas of responsibility:<p>-Architect and implement testable, performant back-end software to support investor and borrower workflows<p>-Deliver features with high quality that are repeatable and predictable<p>-Interface with multiple third-party API&#x27;s that do everything from fraud-protection to the handling of millions of investor dollars<p>-Develop the backend to support all client-facing website interactions<p>----------------------------------------------------<p>What we&#x27;re looking for:<p>-BS degree in Computer Science or related technical field or equivalent practical experience<p>-5+ years of software development using one or more of Ruby, Python, Java, C++<p>-Demonstrated mastery of the Ruby on Rails framework<p>-Strong understanding of SQL<p>For all of open positions and more details, check out our careers page: <a href=\"https://www.assetavenue.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.assetavenue.com&#x2F;</a><p>Feel free to email me directly with any additional questions: joshua@assetavenue.com","time":1415997452,"type":"comment"}