{"by":"pntech","id":6653579,"parent":6653437,"text":"Precision Nutrition - Toronto, ON &#x2F; Anywhere (REMOTE) - <a href=\"http://precisionnutrition.com\" rel=\"nofollow\">http:&#x2F;&#x2F;precisionnutrition.com</a><p>AWESOME QA SPECIALIST NEEDED!<p>Obsessed with small details? Do misplaced pixels and obscure edge cases keep you up at night? We need a meticulous QA specialist to join our team and help us continue to build groundbreaking fitness and nutrition coaching software.<p>Our Ideal Candidate:<p><pre><code>  Has real professional experience implementing and especially running an ongoing \n  Agile-friendly QA process. This can’t be your first rodeo.\n\n  Lives within driving distance of Toronto or is at least willing to travel \n  to Toronto once a month for 2 days at a time (for in-person sprint meetings).\n\n  Has experience developing automated QA testing processes from scratch. Knowledge \n  of automated testing frameworks and tools is a major asset. You should be \n  comfortable with both manual and automated testing.\n\n  Enjoys working across teams, departments to get the best outcome, even when \n  the questions are outside of your comfort zone. No &quot;that&#x27;s not in my job \n  description&quot; types.  Our entire team contributes to every element of the \n  product development process.\n\n  Is capable of working independently. There will be no other dedicated QA people \n  at first, but you’ll get help from the team.\n\n  Has integrity, talent and a palpable excitement about the future. Shadiness, \n  mediocrity and pessimism&#x2F;cynicism&#x2F;excessive &quot;constructive criticism&quot; are out.\n\n  Is excited about the possibility of helping people with their health and \n  well-being, and long-term, piloting an entirely new form of education.\n  </code></pre>\nInterested? Apply with your resume here: \n  <a href=\"https://app.hirefully.com/main/191/apply/?includeDescription=True\" rel=\"nofollow\">https:&#x2F;&#x2F;app.hirefully.com&#x2F;main&#x2F;191&#x2F;apply&#x2F;?includeDescription...</a><p>At Precision Nutrition our mission is Life-changing, research-driven nutrition coaching for everyone.\nWe’re interested in hearing from enthusiastic candidates who want to make a difference in other people’s lives – and who have the skills and dedication to do that.<p>Keep in mind, at Precision Nutrition we:<p><pre><code>  * Pay in the top 10% in the world for each position.\n  * Offer 4 weeks paid vacation, full benefits, and the ability to work remotely.\n  * Set you up with whatever fancy gear you need to perform at your best.\n  * Offer a full health benefits package.\n  * Give you the flexibility to make your own schedule.\n  </code></pre>\nNot only that, but if you join us you can:<p><pre><code>  * Work from anywhere. If you’re in Toronto, our hometown, great! \n    If not, no worries. Many people on our team work exclusively from home, \n    from all over the world.\n  * Work in the fitness and nutrition industry.  We love exercise, \n    we love nutrition, and we love sport. That’s why we started this company. \n    If you do too, you’ll appreciate how rare it is to do a job you really love. \n    For active, fit people, Precision Nutrition is that opportunity.\n  * Work with fun, bright, and talented people. We’re a small company, and \n    we’re picky about who we work with, because to us, this isn’t just a job – \n    it’s our life. Over time, and with careful selection, we’ve put together \n    a group of extremely talented, flexible, and positive people who truly \n    love what they do, and who appreciate the strengths their teammates bring. \n    It&#x27;s an incredibly creative environment.\n</code></pre>\nRead more about how we work at: \n  <a href=\"http://www.precisionnutrition.com/remote-how-to-work-the-pn-way\" rel=\"nofollow\">http:&#x2F;&#x2F;www.precisionnutrition.com&#x2F;remote-how-to-work-the-pn-...</a><p>We&#x27;re also looking for coaches and an HR Director. Check our other postings here: \n  <a href=\"http://www.precisionnutrition.com/contact#employ\" rel=\"nofollow\">http:&#x2F;&#x2F;www.precisionnutrition.com&#x2F;contact#employ</a>","time":1383313034,"type":"comment"}