{"by":"paulmay","id":6653752,"parent":6653437,"text":"BuzzStream (<a href=\"http://buzzstream.com\" rel=\"nofollow\">http:&#x2F;&#x2F;buzzstream.com</a>) –Austin, TX, will consider remote for the right person<p>WHO WE ARE: We’re a small SaaS company based in downtown Austin that’s growing fast and that’s built a product that our customers love (<a href=\"http://storify.com/paulmay/buzzstream-twitter-props\" rel=\"nofollow\">http:&#x2F;&#x2F;storify.com&#x2F;paulmay&#x2F;buzzstream-twitter-props</a>)  We have over a thousand paying customers, our annual revenue is $1M+ and it’s doubling every year.<p>WHAT WE DO: BuzzStream helps marketers find and build relationships with influencers to drive traffic and build brands. Our customers include some of the most well-known brands in the world and many, many digital agencies.<p>We’ve just scratched the surface of the things we can do to help our customers, and we think we can grow at a much faster rate if we keep delivering on our roadmap. We need your help getting there.<p>WHAT WE’RE LOOKING FOR: We’re looking for mid to senior level  software engineers, but we’re much less concerned about the specific level of experience than we are in finding people with the right attitude, ability to learn, and approach to solving problems.  Part of our team works remotely, and we’re open to remote work for this position for the right person.<p>Our app is written in Java, deployed on Amazon’s cloud and utilizes several open source dependencies.  Expert knowledge of Java and Linux are required. Experience with AWS and modern javascript technologies is a plus.<p>BuzzStream may be a good fit for you if...<p>* You want to work at a place where virtually everything you work on impacts the business and you know exactly how everything you build helps the customer.<p>* You don’t want to be pigeon-holed as “the guy&#x2F;girl who works on the [XYZ] part of the product.” You’ll be working on every part of the product and you’ll constantly be learning.<p>* It’s really important to you to work on a team where every person cares deeply about building great software that solves real problems.  You have no use for bureaucracy, pointless meetings, or team members that provide limited value but succeed as a result of fake hustle and strong political skills.<p>* You really want to learn what it takes to build a startup, but you’d rather not learn through the “I learned what not to do” method. We’ve made plenty of mistakes, but we’re past the stage of trying to figure out how to build a successful business.<p>If this sounds like something you’re interested in, I’d love to hear from you. Please send me a resume, along with a note telling me a bit about yourself and why you’re interested in BuzzStream. You can reach me (Paul May, co-founder) at careers@buzzstream.com.","time":1383314387,"type":"comment"}