{"by":"pdegnan","id":6653651,"parent":6653437,"text":"Web Application Developer for Marvel Entertainment - NYC<p><a href=\"http://marvel.com\" rel=\"nofollow\">http:&#x2F;&#x2F;marvel.com</a><p>==================================================<p>Marvel Entertainment is seeking a talented Web application developer.<p>At Marvel you will work with a top-notch development team building the engine which powers Marvel’s successful online businesses. You will work closely with a creative and canny product team on Web and mobile products used by millions of users a month.  You will give technical input during product design and aid other developers in adopting new technologies and methodologies.  You will help implement innovative, cool solutions which excite both long-time Marvel fans and new users alike.<p>Developers at Marvel tackle problems like:<p>+   Creating fast, responsive web sites and apps which entice long-time Marvel fans and new users alike<p>+   Building and maintaining a digital comics subscription product that advances industry-leading storytelling and marketing innovations\n+   Creating a recommendations algorithm for comic readers that mines semantic and transaction data for user preferences\n+   finding innovative ways to visualize and explore one of the richest IP and metadata sets you’ll ever work with (like this: <a href=\"http://marvelentertainment.tumblr.com/post/30536120271/marvel-universe-data\" rel=\"nofollow\">http:&#x2F;&#x2F;marvelentertainment.tumblr.com&#x2F;post&#x2F;30536120271&#x2F;marve...</a>)<p>The successful candidate will have a specialty in server-side Web development but will be comfortable learning and diving into any part of the technology stack.  They will enjoy working with both non-technical and technical resources in a highly collaborative environment.  They will use their knowledge of Marvel’s and the Web’s technical capabilities to drive product development.<p>Responsibilities:<p>+   Development and implementation of desktop and mobile Web applications using PHP and MVC frameworks in a LAMP environment.<p>+   Work with traditional software lifecycle methodologies. Create design documents when and as required. Perform coding, debugging and testing.<p>+   Participate in design brainstorming sessions, technical design reviews, formal code reviews, bug triage, and functional walkthroughs.<p>Qualifications:<p>We are a LAMP shop, but look for team members who share the conviction that programming is our discipline and languages are details. Nobody here has ever written code in only one language. Having said that, we’re looking for:<p>+   3+ years hands-on experience with server-side Web and MVC development<p>+   3+ years hands-on experience with SOAP, REST and XML-RPC Web services<p>+   Demonstrated experience working on high-traffic properties<p>+   Strong sense of ownership and urgency<p>+   Ability to juggle multiple projects, set priorities and meet deadlines<p>+   Critical thinking skills and a high attention to detail<p>Working at Marvel:<p>Why do you want to work for Marvel?<p>+   Full package of benefits including health insurance, 401k, park admission, and all other benefits, provided by The Walt Disney Corporation.<p>+   The Marvel brand represents action and innovation around the world. You’d work where the best and most successful movies, comics, and TV shows are created.<p>+   We believe in supporting the professional and technical development of our people.<p>+  +   In the past year, members of the team have been sent to Google I&#x2F;O, WWDC, Edge Conference, and Lucene&#x2F;Solr Revolution<p>+  +   We have presented at local NYC coding meetups<p>+  +   We are running a “Seven Languages in Seven Weeks” book club, just because it’s interesting to learn new coding paradigms<p>+  +   We have had visitors give talks on topics including: golang.org, Google Glass, OO theory, and the production process for print and digital comics<p>+   We respect and welcome people of all genders, cultures, faiths, and orientations. Diversity = strength.<p>Reach out to pdegnan@marvel.com or @pauldegnan if you&#x27;re interested!","time":1383313655,"type":"comment"}