{"by":"mknoke","id":6653804,"parent":6653437,"text":"Senior Ruby on Rails Developer (m&#x2F;f) Berlin<p>SponsorPay fuels the app economy by providing smarter solutions for ad monetization and is the world’s leading value-exchange advertising platform. Our innovative solution drives the monetization of premium content on platforms such as Facebook, iOS and Android through brand engagement, user acquisition and direct response ad campaigns.<p>In an era when 90% of all apps in the Apple App Store are free, our solutions are crucial for publishers trying to generate revenue. Our innovative solutions help publishers to monetize their apps through smarter forms of advertising.<p>We work with thousands of partners including leading publishers Zynga, Electronic Arts, Ubisoft and OutFit7 as well as renowned advertisers such as Coca-Cola, Samsung, Warner Brothers and Volkswagen. Moreover SponsorPay has been honored as one of the world’s top private advertising companies by OnMedia, OnMobile, Red Herring, White Bull and others.<p>We are headquartered in Berlin with offices in San Francisco, New York, Los Angeles, London, Paris, Istanbul, Shanghai, Seoul and Tokyo. For our Berlin office we are currently looking for a Senior Ruby on Rails Developer.<p>Your role\n•\tDesign, develop and maintain an in-game advertising &amp; monetization platform, based on RoR\n•\tBe part of a SCRUM team that focuses on one of the SponsorPay Products (e.g. our Mobile App Distribution Product or our Brandengage Video Platform) \n•\tFull stack development from the database all the way to the browser \n•\tMentor and coach other developers\n•\tHelp identify new technologies and techniques that can improve our apps or our development processes<p>Your skills\n•\tPassionate about software development - naturally you have your own pet projects\n•\tExperience driving professional Ruby on Rails projects in an Agile environment\n•\t5+ years software development experience, 3+ years experience with Ruby \n•\tOO design skills\n•\tStrong testing background (TATFT)\n•\tVery comfortable with Git and Github\n•\tProactive with a focus on getting things done<p>Awesome Extras\n•\tExperience with high-traffic production systems with 1000s of requests per second\n•\tExperience with one or more of the MVC JavaScript frameworks (Ember, Backbone, Batman, Angular…)\n•\tNoSQL experience<p>What We Offer\n•\tWork in a team with more than 15 talented developers, a lot of them senior\n•\tProduct driven environment\n•\tCasual work environment characterized by flat hierarchies, a family-like atmosphere and open discussion\n•\tSupport and assistance in relocating from outside of Berlin\n•\tCompetitive remuneration package\n•\tFruit &amp; free drinks everyday :)<p>Learn more about our development team at <a href=\"http://sponsorpay.github.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;sponsorpay.github.com&#x2F;</a>\nVisit us at www.sponsorpay.com&#x2F;careers or write us via jobs@sponsorpay.com","time":1383314836,"type":"comment"}