{"by":"0xa","id":6653578,"kids":[6655889,6655895],"parent":6653437,"text":"Kensho, Boston, MA (Cambridge, Harvard Sq): FULL TIME Software Engineers (Python, JavaScript, UI&#x2F;UX).<p>TL;DR: Kensho’s team of 16 people just launched our first product and is actively hiring engineers with a passion for intuitive usability and data at scale.  Our current openings: <a href=\"http://bit.ly/Hj4hJz\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;Hj4hJz</a>.  Our team: <a href=\"http://www.kensho.com/home/#company\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kensho.com&#x2F;home&#x2F;#company</a><p>We have major projects for people with a knack for web application design, a nose for efficiency, and a passion for scale and visibility.  We’re especially excited about the opportunities to shape, grow and expand our front end experience.<p>Happy 50th Birthday to the Arecibo Observatory,<p>Matt<p>To apply click the blue button at the bottom of the job link.<p>Front End Software Engineer&#x2F;Lead  |  Apply: <a href=\"http://bit.ly/1astuOm\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1astuOm</a><p><pre><code>    You will wield JavaScript, Python, CSS and HTML5 with an eye for beauty, \n    elegance and compatibility despite the quirks of browser technology. \n    Your passion for intuitive, simple interfaces that bring life to complex\n    data is self evident--you might say it’s Twue Wuv.  \n\n</code></pre>\nSoftware Engineer  |  Apply: <a href=\"http://bit.ly/180Vdjb\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;180Vdjb</a><p><pre><code>    You will code in python with a passionate yet steady hand. On our mission\n    to unify complex data with an elegant interface, your designs and \n    code shows the natural, intuitive touch of an inspired artist--one\n    who appreciates the uncarved block.  \n\n</code></pre>\nUI&#x2F;UX Lead Designer  |  Apply: <a href=\"http://bit.ly/1astIFj\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1astIFj</a><p><pre><code>    You live for design--building intuitive experiences with an appreciation\n    of the technical implications on releasing your creation to the world.\n    Your passion for elegant simplicity is the peanut butter to our complex\n    data jelly.  \n</code></pre>\nAbout Kensho (<a href=\"http://www.kensho.com/about\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kensho.com&#x2F;about</a>)<p>Kensho combines high-speed parallelized algorithms and machine learning to create a new class of analytics tools for capital markets. Addressing the three biggest challenges surrounding financial analysis on Wall Street today—speed, scale, and automation—Kensho&#x27;s statistical computing and financial risk analysis applications are providing the next generation Bloomberg terminal in the cloud.","time":1383313034,"type":"comment"}