{"by":"hyoogle","id":6653524,"kids":[6653911,6654619],"parent":6653437,"text":"Likeable Local - Portland, Maine - Social Media Tools for Small Businesses<p><a href=\"http://www.likeablelocal.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.likeablelocal.com&#x2F;</a><p>We at Likeable Local are looking to grow our team and seeking two talented \nand motivated software engineers.  One immediate role would be perfect for \nsomeone who is great with numbers and analytics.  The other role is better suited\ntowards someone who loves working in the front-end and loves making things \nlook and interact beautifully- with html, javascript, and css.  In both cases the \nengineers should love building cool things, learning, and social media.  We are \nin Portland, Maine which is atypical for Hacker News, but is a great place to live!  \nWe aren&#x27;t looking for remote workers at this time.<p>We are a tech-startup-spinoff of the award-winning (NYC-based) agency Likeable \nMedia, and we are looking for people that are willing to jump right in and be on \nour small team (currently 3 other full-time developers) creating features that will \nbe visible and impactful and used immediately.<p>We are hard-working and smart, and we love to solve challenging problems.  \nWe use a lot of node.js, javascript, python, django, and the Oxford comma.<p>You love being a substantial contributor and are interested in the “full stack” of \ntechnologies from details of server configuration, back-end, front-end, and mobile \nplatforms.  You are self-disciplined, self-directed, but also detail-oriented in your \ncommunication about what choices you make and what you are doing.<p>Likeable Local offers an integrated software solution that allows small businesses \nto create, enhance and manage their social media presence. Likeable Local was \nfounded in 2012 and has a deployed product that integrates with Facebook and \nTwitter. The software is sold on a subscription basis, allowing for attractive recurring \nrevenue economics, and is in use by dentists, dry cleaners, florists, and jewelers \nand we continue to expand.<p>Interested?  Email me at hugh@likeable.com and lets connect!","time":1383312586,"type":"comment"}