{"by":"edwardog","id":6653994,"kids":[6654731],"parent":6653437,"text":"<i></i>Shopify<i></i><p>Shopify is the best platform for online stores, as well as a diverse company of happy polyglots who hack on everything between UX, data warehouses, and low-level CRuby VM performance issues. \nWe value personal growth, and developer quality of life in a huge way and show it by having safe deployment systems anyone can trigger; facilitated retrospectives + off-sites with Corey Haines; GitHub and PRs for everything; small, mixed teams of folks with 0 to 30 years of experience, and encouragement from the still-hacking CEO to give back to open source on company time.<p><a href=\"http://shopify.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;shopify.com&#x2F;careers</a> – apply to any dev&#x2F;ops job and mention HN and I’ll give you a hand.<p>Here’s a sampler of the current teams at work:<p><i>Reports</i><p>High throughput + realtime tools for customers; we hired the author of SkyDB to continue making it more awesome. People on this team have backgrounds in low-level kernel work,  Smalltalk VM development, and deployment of national wireless systems.<p><i>Stack</i><p>The right thing to do should be the easiest thing to do; this team works on things like implementing Kafka across the entire Shopify system to let anyone pub&#x2F;sub to any call-site, opening the door for easy instrumentation&#x2F;experimentation.<p><i>Performance</i><p>We’re in the process of sharding Shopify in order to isolate and better service stores experiencing $3000000+&#x2F;hour flash sales. People working on IBM’s specialized JVM are now hacking here, while also contributing context threading patches to CRuby off the side of their desk for fun.<p><i>Point of Sale</i><p>If you like making beautiful hardware + beautiful software that you can see used by customers who tell you this is the Holy Grail of retail systems, then you go here.<p><i>Operations</i><p>Engineers here work on projects like Chef, distributed cloud+iron failover systems, DDOS mitigation stuff and our new datacenters.<p><i>More teams</i><p>Data (giant, columnar data-stores + PhD withbackgrounds in finance and astrophysics)<p>Admin (Batman.js + UX professionals + designers who code)<p>Self help (machine learning for people learning)<p>Apps (JS SDKs for seamless iframes + APIs)<p>Checkout (provide low-latency experiences while dealing with high-latency payment gateways; don’t drop any of the zillion$$$ going by)<p>Platform + Growth (biz dev science + gamification of ecommerce education)<p>Internal tools (Fast Company-covered staff bonus system aka “Unicorn”, Bayesian classification of customer questions assigned to support experts, hand-made phone queueing systems wrapped around Twilio, etc., etc.)<p>Billing (hard-core testers need only apply)<p>Payments (integrations with Stripe + fraudster f-ing)<p>Core&#x2F;API (everything not here)<p>(more but secret)<p>Seeking full-time programmers, and data analysts to work in Toronto, Montreal, and Ottawa, Canada. We’ll help with visas.\nSeeking operations staff anywhere (remote friendly).<p><a href=\"http://shopify.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;shopify.com&#x2F;careers</a> – apply to any dev&#x2F;ops job and mention HN and I’ll give you a hand.","time":1383316488,"type":"comment"}