{"by":"doctoboggan","id":6654081,"parent":6653437,"text":"Enthought, Inc, <a href=\"https://enthought.com/company/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;enthought.com&#x2F;company&#x2F;careers&#x2F;</a> Full Time in Austin, TX<p>tl;dr - Enthought is looking to hire for two different roles: DevOps and Scientific Developer. We mostly develop in Python, but will consider candidates with a strong C&#x2F;C++ background.<p># DevOps<p>Enthought is looking for an experienced DevOps engineer to help expand our software publishing and web services automation infrastructure. Enthought Canopy is our new Python platform for scientific and analytic computing. As a core member of the development team you&#x27;ll be developing a software publishing system capable of building multiple custom products to growing our web services infrastructure, among other challenges. Check out the details at: <a href=\"https://enthought.com/company/careers/devops-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;enthought.com&#x2F;company&#x2F;careers&#x2F;devops-engineer&#x2F;</a> Help spread Python!<p># Scientific Developer<p>Enthought is currently seeking Scientific Software Developers. If you are passionate about scientific computing, dedicated to quality software, and pragmatic about problem solving, we&#x27;d love to hear from you. Our developers participate in the development of scientific and technical applications involving GUIs, 2D and 3D graphics, workflow and pipeline architecture, and numerical algorithms for our proprietary products and for customer applications. Some travel may be required.<p># Desired Skills and Capabilities:<p><pre><code>    * (Required) Bachelor&#x27;s Degree in Computer Science or other scientific or \n       engineering field with preferably an M.S. or Ph.D. degree.\n    * (Required) Minimum 2 years of technical lead or development experience\n       with 4 years being preferred\n    * Ability to understand a problem domain and then conceive of and\n      implement an intuitive user interface geared toward the scientist or engineer user.\n    * Discipline, pride, and professionalism to write readable, documented, and \n      unit-tested code that serves as an example to those who study your work\n    * Strong work ethic and commitment to satisfying the customer.\n    * Experience with Python, and a strong understanding of how to apply its \n      capabilities to develop GUIs, work flow frameworks, and elegant \n      scientific applications.\n    * Strong understanding of statistics, optimization, image processing, \n      signal processing, or other similar area.\n</code></pre>\nWe find that a scientist will thrive at Enthought if their passion for software is as deep and ingrained as their scientific interests.\nPlease visit us at <a href=\"https://enthought.com/company/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;enthought.com&#x2F;company&#x2F;careers&#x2F;</a> to learn more about our open positions, our values, and what kind of developer fits best at Enthought.\nInterested? Send a resume and cover letter to jobs@enthought.com or you can contact me directly at jminardi@enthought.com","time":1383317149,"type":"comment"}