{"by":"espringe","id":6654628,"parent":6653437,"text":"Agave Lab -- Guadalajara Mexico.<p>We&#x27;re an early stage product incubator located in sunny Guadalajara, Mexico that was founded by an ex-Bay Area startup exec 4 years ago. We turn out products, about 3-4 per year, based on our own ideas. The ones that go well, we reinvest in. Those that don&#x27;t, we bury in the yard. We also invest in, mentor, and incubate local startups targeting the Latin American market. We&#x27;re at the center of the rapidly emerging startup boom in Mexico. Mostly though, we have a lot of fun.<p>We&#x27;re giving a few developers the opportunity to rethink their life priorities and get out of Dodge for a while. You&#x27;re startup is flagging? Sick of the fog? Commute got you down? Just broke up with your partner? Why not pull the rip cord and come work with us for a while?<p>What do we have to offer?\n* A vibrant, biggish (pop. 4M), student-oriented city, that&#x27;s full of hip bars, restaurants, and (really) beautiful, friendly people.\n* A work environment that is, hands down, the hippest place to work in Mexico. Imagine programming in the hammock - poolside (yes, we have a pool).\n* Use of the beach house. We have a 3 story beach house with all mod cons, 20 feet from a graceful, immaculate sandy bay in a small fishing village. Also, one of the premier left point surf breaks is 5 minutes away by boat (which we also have).\n* A chance to learn (or practice your Spanish).\n* An opportunity to be at ground zero for one of the most vibrant and rapidly expanding startup scenes in the world.\n* Beef up your resume with experience in navigating the business climate in Mexico and Latin America.\n* and, finally, ALMOST NO MONEY. Okay, not entirely true - you&#x27;ll be paid a very tidy wage (by mexican standards) which will allow you to live well here - most things are cheap here. However, if you compare what you&#x27;ll make here versus what you&#x27;re making now? It will be a disappointing exercise. Said differently, if money is what you&#x27;re after - then this is not for you. If you&#x27;re looking for adventure, fun, and to challenge your self with something new - welcome to your new home!!!<p>Who are we looking for? It&#x27;s all listed on the website: <a href=\"http://www.agavelab.com/hiring/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.agavelab.com&#x2F;hiring&#x2F;</a> but in summary:\nHTML&#x2F;CSS&#x2F;Javascript kung fu\nMobile dev skills (android or iOS)\nServer dev skills\nCommunity managers&#x2F;growth hacking<p>Our technology stack is HTML5, CSS3, Java, NodeJS, MongoDB, Play Framework, Scala. But don&#x27;t worry if you don&#x27;t know these. As long as you have a very solid command of at least one programming language (Java, C, C++, Python, etc) and are smart as a whip, we can teach you the rest. We expect the same things that any software development shop would: ability to write clean, well-documented code, familiarity with Dev Environments (Xcode, CodeIgniter&#x2F;Play&#x2F;Angular&#x2F;etc.), experience with Agile&#x2F;Scrum concepts, etc. Culturally we look for self-starters that can thrive with very little guidance and who have a genuine passion of solving complex problems. You should also like beer (or not be afraid to watch others consume large quantities of it), music, the sun, and tacos.) Oh yes, and a sense of humor - you&#x27;ll want to bring that too.\nYou want to know more? Of course you do. Check out the site: www.agavelab.com or drop us an email. Maybe download&#x2F;visit a few of our apps and check them out. Or read some of our press:\n<a href=\"http://pandodaily.com/2013/05/21/how-a-valley-veteran-found-happiness-and-opportunity-building-tech-in-mexico/3/\" rel=\"nofollow\">http:&#x2F;&#x2F;pandodaily.com&#x2F;2013&#x2F;05&#x2F;21&#x2F;how-a-valley-veteran-found-...</a>\n<a href=\"http://www.nytimes.com/2013/09/22/world/americas/for-migrants-new-land-of-opportunity-is-mexico.html?pagewanted=1&amp;_r=2&amp;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2013&#x2F;09&#x2F;22&#x2F;world&#x2F;americas&#x2F;for-migrant...</a>\n<a href=\"http://venturebeat.com/2013/09/23/agave-lab-throws-sparks-onto-startup-scene-south-of-the-border/?utm_content=buffer94afe&amp;utm_source=buffer&amp;utm_medium=facebook&amp;utm_campaign=Buffer\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2013&#x2F;09&#x2F;23&#x2F;agave-lab-throws-sparks-on...</a>\nWe hope to hear from you soon.","time":1383321464,"type":"comment"}