{"by":"mattlutze","id":6654793,"parent":6653437,"text":"<i>Junior Software Developer - Stuttgart, Germany</i><p>We are hiring a full-time junior developer, focused on front-end development, at our offices in Stuttgart, Germany.<p>This is a great opportunity for someone relatively new to the software development business that wants to make a consistent, meaningful impact on the ability of the United States to provide humanitarian aid and support partner countries throughout the African continent. We&#x27;re discovering more opportunities to support the command, and are excited to be able to offer an opportunity for a junior developer to break into the industry.<p>Projects are varied and iterative with short timelines; you&#x27;ll regularly score wins and work closely with the people using your tools on a daily basis.<p>If you&#x27;re ready to check out the listing, head here: <a href=\"https://ch.tbe.taleo.net/CH09/ats/careers/requisition.jsp?org=MCDEAN&amp;cws=1&amp;rid=1297\" rel=\"nofollow\">https:&#x2F;&#x2F;ch.tbe.taleo.net&#x2F;CH09&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?or...</a><p><i>Requirements:</i><p>-Responsible for the design, development, and maintenance of software programs applied to technical and engineering domains.<p>- Includes: formal design preparation and presentation using integrated software design and modeling toolsets, code development, documentation preparation, web development, unit testing, and software debugging<p>- Also: life cycle software documentation development from use cases and system design specifications to test plans and operations and maintenance (O&amp;M) manuals<p>-Specific expertise with formalized programming languages as well as open source development methodologies and toolsets required<p>-Works in all phases of software development life cycle, and across all functional applications, systems analysis, and programming activities.<p><i>Functional Duties:</i><p>-Perform code development in accordance with the established system architecture, coding standards and Information Assurance guidelines<p>-Perform unit and functional automated test development, functionality and performance optimization<p>-Perform software deployment, upgrades, troubleshooting, and other O&amp;M activities<p>-Support development of system documentation, including software design specifications, O&amp;M procedures, and configurations guides<p><i>Requirements</i><p>Must:<p>- Be a U.S. Citizen. Applicants selected may be subject to a government security investigation and must meet eligibility requirements for access to classified information.<p>The best candidate will also be able to check each of these boxes:<p>- B.S. Degree in Engineering, Mathematics, Computer Science, Management or Information Systems.<p>- A minimum of one (1) or more years as a front-end developer with experience in the design, development, coding, integration, testing and follow-on maintenance and support of software programs.<p>- Knowledge of the following programming languages and formats: jQuery, JavaScript, REST, JSON, HTML5 and CSS along with a solid understanding of software design principles.<p>- Experience working within Microsoft SharePoint environments.<p>- Should be able to design a solution and understand how that solution will affect other related solutions.<p><i>About M.C. Dean, Inc. </i><p>M.C. Dean is a systems engineering and integration firm focusing on large, complex information systems: electrical, electronic, telecommunication, security, safety, and mission-critical systems. We have more than 2,900 employees with offices in Washington, D.C., Northern Virginia, Richmond, Baltimore, Atlanta, Baton Rouge, Clearwater&#x2F;Tampa, Fort Worth, and in Stuttgart, Germany.  Due to extraordinary growth and expanding business development efforts, we are looking to add an exceptionally talented Software Developer to our team of IT professionals.<p>M.C. Dean, Inc. offers an excellent benefits package including a competitive salary; medical, dental, vision, life and disability insurance; paid-time off, tuition reimbursement; 401K Retirement Plan and Military Reserve pay offset.<p>Applicants selected may be subject to a government security investigation and must meet eligibility requirements for access to classified information.<p>For more information about our company, you can visit <a href=\"https://www.mcdean.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mcdean.com</a>.\nM.C. Dean, Inc. is an equal opportunity employer M&#x2F;F&#x2F;V&#x2F;D<p>For more information or to apply, please visit: \n<a href=\"https://ch.tbe.taleo.net/CH09/ats/careers/requisition.jsp?org=MCDEAN&amp;cws=1&amp;rid=1297\" rel=\"nofollow\">https:&#x2F;&#x2F;ch.tbe.taleo.net&#x2F;CH09&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?or...</a>","time":1383324650,"type":"comment"}