{"by":"buf","id":6654946,"kids":[6658250],"parent":6653437,"text":"London, UK - Rentify - Software Engineer (Rails)<p>We&#x27;re a small tight-knit team that wants to change how rentals are done. The rental industry is old, antiquated, and ready for a push. We think we have the right recipe, and so does Balderton Capital, who invested in us for our Series A.<p>We don&#x27;t do deadlines, or assign your day to day work to you, or tell you how to get it done, or make your decisions. You&#x27;re smart, professional. You don&#x27;t need us to tell you how to do your job. Of course, we don&#x27;t mind helping if you get stuck.<p>Here&#x27;s how we hire: <a href=\"http://bufordtaylor.com/post/62455729428/how-we-interview-engineers\" rel=\"nofollow\">http:&#x2F;&#x2F;bufordtaylor.com&#x2F;post&#x2F;62455729428&#x2F;how-we-interview-en...</a><p>Here&#x27;s how we work: <a href=\"http://engineering.rentify.com/post/47385480838/in-engineers-we-trust-to-get-shit-done\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.rentify.com&#x2F;post&#x2F;47385480838&#x2F;in-engineers...</a><p>Responsibilities:<p><pre><code>  * Lead by example – by writing good code, talking about good code, and then drinking beers with the team to celebrate all the good code everyone wrote\n  * Design and development of new product features and enhancements\n  * Communicate with non-engineers to define requirements and deliverables\n  * Know what technologies are out there in case you need to use them\n  * Periodically teach your co-workers all the great stuff you learned via tech talks, brown bags, blogs or open source\n</code></pre>\nRequirements:<p><pre><code>  * You ideally have Ruby on Rails experience. (We’ll still talk to you if you’ve done something with Django or node.js)\n  * You want to work in a startup (a.k.a. a place that works hard and plays hard)\n  * You feel comforted when you write a good unit test\n  * You must have a Bachelor’s knowledge level of computer science via education or experience\n  * You know when to use Postgres&#x2F;Mysql vs Mongodb&#x2F;Redis\n  * You understand the full stack (servers, RoR, javascript&#x2F;css&#x2F;html)\n  * You have to be able to travel to central London every day\n</code></pre>\nPlease email me at buford@rentify.com","time":1383325682,"type":"comment"}