{"by":"mavelikara","id":6654271,"parent":6653437,"text":"AppDynamics -- San Francisco, CA -- H1B welcome<p>AppDynamics is a successful, well-funded startup in Application Performance Management space. Our product and business model are proving to be quite disruptive in a very large market. Companies like Netflix, Priceline.com, Deutsche Bank, Williams Sonoma, Betfair and Expedia are using AppDynamics to ensure the performance and availability of their revenue-critical applications.<p>AppDynamics&#x27; traditional products for JVM, CLR, PHP and Node.js kick ass at measuring server-side performance across your app. But with the shift to highly interactive websites and mobile apps, an increasing number of performance problems are caused by client-side code or internet latency. End-User Monitoring measures the performance that your real users&#x27; experience by instrumenting client-side platform APIs. EUM complements server-side monitoring, but comes with its own set of challenges:<p>* Client-side platforms are not designed for easy instrumentation. How can we extract meaningful performance data from web browsers, iOS, and Android?<p>* Client-side performance performance is confounded by the huge variability in devices, workloads, and network latency. How can we make sense of this complex, noisy, multi-dimensional data?<p>* How can we cope with the volume of performance data flooding in from millions&#x2F;billions of users?<p>* How can we incorporate client-side and server-side data into a complete picture of app performance?<p>Here are the components of our system, and what it takes to work on them:<p>Browser Agent:<p>* Write fast, bulletproof instrumentation for JavaScript that can run inside any web app across hundreds of browser versions.<p>* Understand behavioral and performance idiosyncrasies of various browsers.<p>* Incorporate new timing specifications from W3C performance working group, but develop fallback timing techniques for other browsers.<p>Mobile Agents:<p>* Build fast, bulletproof instrumentation for iOS (Objective-C) and Android (Java) platform APIs that can run inside any app across thousands of devices.<p>* Understand mobile app architecture and frameworks, identify strategies to extract user actions, performance and system crash data.<p>* Understand iOS, Android, and Dalvik internals, and the characteristics and constraints of mobile platforms in general.<p>Cloud:<p>* This is the processing platform that receives data from the agents. It&#x27;s a scalable data processor and analytics engine (think real-time map&#x2F;reduce) built on Amazon Web Services.<p>* Process billions of end-user requests from some of the biggest sites in the world.<p>* Scale with AWS infrastructure components (EC2, S3, DynamoDB, EMR, etc).<p>* Ensure zero downtime, zero data loss, continuous deployment, multi tenant, multi \nversion, etc.<p>* Analyze huge volumes of data with statistical techniques, machine learning, predictive analysis.<p>UI:<p>* Design and build learnable, usable, data-rich HTML5 UI that helps users discover, triage, and root-cause performance problems.<p>* We use AngularJS and TypeScript.<p>I work in the EUM team and we are looking to expand. If you have skills or interest pertaining to any of the above-mentioned areas, please write to me at bthomas@appdynamics.com","time":1383318636,"type":"comment"}