{"by":"benl","id":6655601,"kids":[6669225,6658635],"parent":6653437,"text":"Academia.edu (San Francisco, CA) - Software Engineers, Designers, Data Scientists<p>At Academia.edu, we&#x27;re trying to accelerate the scientific process by changing the way scientific research is shared. Right now publication is slow, un-innovative, and expensive - we want it to be fast, innovative, and free. We&#x27;re a platform where scientists upload and share their research directly, and track metrics on the impact of their work. These metrics help when they apply for jobs and grants.<p>A leading climate scientist in Germany told us &quot;Academia.edu shows the impact of your work that is not covered by Web of Science and citation indexes of that sort. With Web of Science you only learn how many people have quoted what. But with Academia.edu I can see what is viewed, what is actually read or not. Here I learn something additional, something I would not know otherwise.”<p>5.1 million academics have signed up to Academia.edu, and around 1 million join every 2 months.<p>We are a 10 person team based in downtown San Francisco. We just raised $11 million from Khosla Ventures, Spark Capital, and True Ventures. We are looking for full-stack engineers, designers and data scientists. Technologies we use include Ruby, Rails, CoffeeScript, Backbone, Postgres, Mongo and Varnish.<p>Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot;<p>There are some core values that define the Academia.edu culture. Since everyone in Academia.edu is involved in running the company, we look for these values in everyone we hire:<p>* Being a do-er - &quot;The credit belongs to the man who is actually in the arena&quot; - Theodore Roosevelt<p>* Being driven - &quot;Look at a day when you are supremely satisfied at the end. It&#x27;s not a day when you lounge around doing nothing; it&#x27;s when you&#x27;ve had everything to do, and you&#x27;ve done it.&quot; - Lord Acton<p>* Having equanimity - &quot;First they ignore you, then they laugh at you, then they fight you, then you win.&quot; - Gandhi<p>* Having humility - knowing what you know, what you don&#x27;t know, and where you just have an instinct<p>* Being motivated to open up and accelerate science<p>See the founder, Richard Price, on Bloomberg TV: <a href=\"http://www.bloomberg.com/video/academia-edu-scientific-research-available-to-all-14Q_Hj66RZqcSRlZ25spvw.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloomberg.com&#x2F;video&#x2F;academia-edu-scientific-resea...</a>\nRead the coverage of our recent funding round: <a href=\"http://venturebeat.com/2013/09/26/meet-academia-edu-a-startup-that-wants-to-publish-every-science-pdf-online/\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2013&#x2F;09&#x2F;26&#x2F;meet-academia-edu-a-startu...</a><p>To learn more, take a look at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>, and then email Ben Lund at ben [ at ] academia.edu.","time":1383333018,"type":"comment"}