{"by":"sshrinivasan","id":6656755,"parent":6653437,"text":"Full-Stack Software Developer, Vancouver, Canada.<p>Zymeworks Inc. is a Canadian computational biotechnology company that is developing predictive computational technology for optimizing protein therapeutics. We combine high performance computing, visualization and data exploration tools with leading edge molecular simulation algorithms to build a complete suite of molecular modeling applications geared towards engineering better drugs for cancer and autoimmune diseases. We are looking for a talented software developer to join our team of developers and scientists to design, build and expand our molecular modeling software suite.<p>Responsibilities<p>• Creating front-end web applications and their supporting back-end APIs for analyzing and visualizing computational data from our simulation tools as well as biological data from our laboratory experiments.<p>• Writing tools to enable our protein scientists to visualize, analyze and interpret computational as well as biological data.<p>• Working with our molecular simulation scientists to understand the simulation algorithms being developed, and propose novel ways to present and interpret the results of the algorithms, taking into account the end-users needs.<p>• Actively coordinating with the different R&amp;D teams to find areas of inefficiencies in data analysis and exploration, and proposing solutions in conjunction with the software development team.<p>• Integrating and maintaining the developed software as part of the entire computational platform.<p>• Experimenting with different visualization, data exploration and back end frameworks and technologies in conjunction with our software team.<p>Required Qualifications<p>• A Bachelor’s degree in Computing Science, Engineering, or equivalent.<p>• Proven experience developing and maintaining JavaScript based web applications, their supporting back-end APIs and other associated infrastructure.<p>• Experience developing software on Linux or Mac OS X.<p>• Fluency in English, spoken and written.<p>• Applicants with proven and demonstrable experience developing large-scale data analysis, exploration and visualization tools will be given preference.<p>Our Platform<p>Candidates should have demonstrable experience in, or an interest working with the following technologies:<p>• JavaScript, including AngularJS, D3, and WebGL<p>• Python, including NumPy, Pandas, Pyramid<p>• Server side architecture and technology, egs. Go.<p>• SQL<p>To discover more about Zymeworks Inc, please visit our website at www.zymeworks.com. If you are interested in applying for this position, please email your curriculum vitae and cover letter to careers.1278@zymeworks.com.","time":1383343059,"type":"comment"}