{"by":"acdantonio","id":6657150,"parent":6653437,"text":"Weddington Way is a rapidly growing, venture-backed start-up building a new collaborative shopping experience for wedding parties. We are passionate about creating a fun and rewarding experience for friends coming together for one of life’s most important events – weddings.<p>We were founded in 2010 by our CEO Ilana Stern, a former buyer for Bloomingdales who came up with the vision for Weddington Way while pursuing her MBA at Stanford. In just three short years, Weddington Way has scaled to a team of twenty high-performing individuals responsible for driving a fast-growing customer and product pipeline.  We’re a fun, smart, entrepreneurial group with successful track records. We’re looking for like-minded people who have the desire to achieve aggressive goals, want to have a voice in what we’re building, and love their job in the process.<p>Open Positions<p>Director of Operations\nYou are:\n•Someone who can help us scale while protecting and improving our customer experience.\n•Comfortable touching many pieces of the business and be able to institute the necessary processes&#x2F;metrics.\n•An analytical, strategic thinker who can correct inefficiencies and be a decision-maker.<p>Marketing Analyst \nYou are: \n•Highly analytical, well-versed in excel, and able to analyze large data sets\n•Ready to put numbers into action and guide the team on how to best optimize their marketing programs \n•Goal-oriented, passionate about A&#x2F;B testing and has a proven track record of improving ROI across all channels.<p>Director of Acquisition: \nYou are:\n•A leader who will own our marketing acquisition efforts from end-to-end and successfully scale the business \n•Super analytical and have experience acquiring users through Facebook, PPC, display ads, SEO, etc. \n•Ready to test and manage different acquisition channels with a data-driven mind-set<p>Feel free to contact us for more information at jobs@weddingtonway.com","time":1383347340,"type":"comment"}