{"by":"cliftonk","id":6657271,"parent":6653437,"text":"OrgSync — Dallas, TX. Full-time.<p>Frontend &#x2F; Backend &#x2F; Full-stack<p>## Job Summary<p>We&#x27;re looking for a sharp engineer to work alongside a small team of\ndevelopers and designers committed to building a robust, performant and\nscalable web application serving over 350 colleges and universities\naround the country. You have an attention to detail and a professional\ncuriosity that extends beyond the workplace. You will work in a mostly\nautonomous environment, so you have to be just as awesome at getting\nthings done as you are at composing elegant solutions.<p>Most of our code is written in Ruby and runs on the Rails stack backed\nby a MySQL database, but we also incorporate other technologies such as\nNode.js, Memcached, ElasticSearch and Redis. We use GitHub for version\ncontrol and our infrastructure is entirely hosted via cloud services.\nWe care about keeping our libraries up-to-date and test coverage. While\nmost of our stack is on Rails today, we&#x27;re comfortable with other\ntechnologies and always strive to use the right tool for the job.<p>This is a full-time position at our headquarters in Dallas, TX and\nincludes a competitive base salary, a full range of benefits, stock\noptions, and an awesome team of creative people by your side.<p>We&#x27;re a very open company and you will<p>## Requirements<p>- Passion for developing excellent software and an appreciation for elegant code<p>- Strong understanding of web services and REST concepts<p>- Strong understanding of relational databases including complex queries and optimization<p>- Experience writing object-oriented software guided by tests<p>- Strong understanding of performance optimization and caching techniques<p>- Being comfortable in a polyglot environment a plus<p>- Open source project contributions a plus<p>- Ability to play &quot;Careless Whisper&quot; on saxophone a plus<p>- Strong written and verbal communication skills<p>## Links<p>Open source: <a href=\"http://orgsync.github.io/\" rel=\"nofollow\">http:&#x2F;&#x2F;orgsync.github.io&#x2F;</a><p>Blog: <a href=\"http://devblog.orgsync.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;devblog.orgsync.com&#x2F;</a><p>Openings: <a href=\"http://www.orgsync.com/company/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.orgsync.com&#x2F;company&#x2F;careers</a><p>email clifton [at] orgsync . com for more information.","time":1383348621,"type":"comment"}