{"by":"probst","id":6668071,"parent":6653437,"text":"Software Engineer at Aircloak - REMOTE ((UTC +2) +- 2)<p>My name is Sebastian, and I am the CTO at Aircloak. Aircloak is a young and well-funded startup working on privacy preserving data processing and analytics. We are a spinout from the German Max-Planck Institute for Software System research institute and receive a lot of backing and support from the institute and their extended network.<p>Our technology allows us to process highly private streams of data and only ever make fully anonymous data available to our customers. One of the features that make our system unique is that no one, including operators, customers, and ourselves, ever has access to the sensitive raw data. This property holds true even after we update the software running on the machines processing the sensitive data!<p>You should:<p><pre><code>    - be intelligent\n    - have a good sense of humour\n    - be an amazing programmer\n    - wish to change the world\n</code></pre>\nOur system spans many machines and services, with major components written in Erlang and Java, in addition to components written in C, C# and ruby. Knowledge of functional programming is a plus. Experience with web development is not going to hurt either.<p>The founding team consists of recent University of Cambridge graduates and a director at the Max-Planck Institute. In the past months we have also been joined by two excellent engineers.\nThe work environment is highly international and diverse, and we would like to keep it that way.<p>We are looking to hire one additional engineer, and are in the lucky position where we can afford to be picky with whom we choose. \nOur team is distributed, and we would therefore expect you to work remotely as well. We would prefer if you were located within one or two timezones of our own (UTC+2). We offer good and stable salary, generous equity, exciting problems to solve, and a fabulous team, and in turn expect you to be driven, social, and good at solving problems.<p>We hope to hear from you. Please email us at jobs@aircloak.com if you have any questions!<p>You can find more on our website: <a href=\"http://www.aircloak.com/join.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aircloak.com&#x2F;join.html</a>","time":1383566167,"type":"comment"}