{"by":"hurdleress","id":6683137,"parent":6653437,"text":"Counsyl - South San Francisco, CA<p>REMOTE, H1B, INTERN<p>Our goal is to make the human genome practically useful for life-altering decisions.<p>We&#x27;ve invented the Counsyl Test, a breakthrough diagnostic intended for parents planning to start a family. The test won the Wall Street Journal Innovation Award for Medicine, was named one of Scientific American&#x27;s &quot;Top 10 World Changing Ideas,&quot; and was featured in the New York Times. Our test is now prescribed by physicians for more than 12% of all carrier screens in the United States.<p>The cost of sequencing human genomes is plunging - over 5x faster than the cost of computing; the potential impact on preventive healthcare and the medical landscape is boundless. The science is there but the scale isn&#x27;t. That&#x27;s where Counsyl comes in. We are building the technology platform to make genomics useful and accessible to everyone.<p>TechCrunch article:  <a href=\"http://techcrunch.com/2013/04/23/counsyl\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;04&#x2F;23&#x2F;counsyl</a><p>The vast majority of our operations are powered by our own custom-built infrastructure on a Python&#x2F;Django&#x2F;Postgres stack, from ordering to lab processing to billing. We’re building new tools, new workflows, and new infrastructure to solve the challenging problems of a technology startup involved with not just bits, but also interconnected physical components like lab robotics and patient samples.<p>Don’t be intimidated if you don’t have a genomics background; solving these problems fundamentally requires software solutions. We’re looking for the best and brightest software engineers — strong generalists with solid CS fundamentals and practical software engineering intuition — to help us scale up genomics to billions of users.<p>Prerequisites:<p>- BS, MS or PhD in Computer Science or equivalent experience\n- Strong software engineering fundamentals: design, testing, version control\n- Significant independent programming experience as demonstrated by a GitHub account, personal web page, or prior experience.<p>We like to see experience with:<p>- Python, Django, CoffeeScript, Backbone.js, Bootstrap, HTML5, CSS\n- NumPy, SciPy, scikit-learn\n-Relational database systems, such as PostgreSQL\n- Unix, Git, and other command line tools<p>* Full-Time Software Engineers Apply: <a href=\"https://counsyl.recruiterbox.com/jobs/11742\" rel=\"nofollow\">https:&#x2F;&#x2F;counsyl.recruiterbox.com&#x2F;jobs&#x2F;11742</a>\n* Intern Software Engineers Apply: <a href=\"https://counsyl.recruiterbox.com/jobs/12657/\" rel=\"nofollow\">https:&#x2F;&#x2F;counsyl.recruiterbox.com&#x2F;jobs&#x2F;12657&#x2F;</a>","time":1383751565,"type":"comment"}