{"by":"Dustin_Vaughn","id":6712100,"parent":6653437,"text":"Panama City Beach Florida(Full Time)\niSirona(Medical Device Connectivity&#x2F;Integration)\nwww.isirona.com&#x2F;\nContact me Dustin.Vaughn@iSirona.com<p>Overview:\nYou will be designing and building a portfolio of web applications targeted at modern browsers and mobile devices. Our applications use a web-based fat client architecture that leverage cutting edge open-source tools, helping us write better, faster, easier to maintain code. Join our team and help us create compelling applications using  Backbone.JS, HTML5, CSS, Javascript, AJAX and Bootstrap and a variety of exciting web application frameworks.<p>iSirona?\nYour not the first one to think it. The tune sounds similar but unfortunately, we are not the “The Knack.” iSirona is a unique name symbolizing our solutions in a healthcare setting. Sirona was a Celtic healing deity. Since we were founded is 2008, we have grown to 180+ strong and have cultivated a fun and dynamic culture that inspires and welcomes freedom and creativity in one of the fastest growing and most rewarding industries.<p>Benefits:\n- Freedom culture means(casual dress with no time cards or set hours)\n- Performance based bonuses and pay raises                                                                                                \n- Relocation Assistance\n- Unlimited paid time off\n- 11 paid holidays\n- Health, Dental, Vision, Life Insurance \n- Immediate 401K matching\n- Monthly cell phone reimbursement\n- Employee chosen food and drinks. Pepsi delivers about once a week!\n- Game room\n- On-site gym(Due in Jan 2014)\n- Nerf Gun Wars\n- Work with stunning colleagues on the waters of the Gulf of Mexico<p>Tech Stack:\nBackbone.JS, HTML5, CSS, Javascript, AJAX, Bootstrap and Java<p>Helpful Experience:\n-You know what JQuery is and have used it for years\n-You know what the module pattern is and can write JavaScript that way on a whiteboard\n-Organizing front-end code for large web applications is an interesting challenge to you\n-You have a background in Java, even if it’s not your day-to-day language\n-Experience in healthcare is a plus\n-iOS, Android development experience a plus\n-Agile development experience is a plus<p>Let us see your work:\nSend us your github, stack overflow, twitter, or other development profiles. We&#x27;d like to see how you fit in to the development community. \nSend us a link to a live project featuring your JavaScript work.","time":1384184648,"type":"comment"}