{"by":"corbettdrummey","id":6715837,"parent":6653437,"text":"Popular Pays - Chicago, IL<p>We&#x27;re democratizing social currency. Imagine a Klout for local business, where you can get a cup of coffee if you have a bunch of Instagram followers. But instead of caring about whether or not Justin Bieber retweeted you, we measure influence based on your ability to get your followers to visit that shop you just posted about. Oh yeah, it&#x27;s possible.<p>We&#x27;re a recently-launched and VC-funded startup and you&#x27;ve got to be a full-stack &#x2F; back-end engineer as good as our mobile dev: @mxcl, the guy who made Homebrew. (Yeah, that thing you use everyday.)<p>Here&#x27;s our app: <a href=\"https://itunes.apple.com/us/app/popular-pays/id673760702?mt=8\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;popular-pays&#x2F;id673760702?mt=...</a><p>Here&#x27;s some press: <a href=\"http://www.fastcoexist.com/3015760/change-generation/your-instagram-followers-are-good-for-more-than-just-likes-now-they-get-yo\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fastcoexist.com&#x2F;3015760&#x2F;change-generation&#x2F;your-in...</a><p>* Since none of the 4 current teammates are taking a salary, there&#x27;s plenty of Seed Funding left for you. Equity, too.<p>* We&#x27;ve got our own unique space inside of an ad agency downtown that they gave to us, but you can work where ever you want.<p>* We&#x27;ll pay for gym, laundry, and anything that&#x27;s a distraction from doing shit you don&#x27;t want to do.<p>* Vision&#x2F;Health&#x2F;Dental&#x2F;Medical covered 100%.<p>* We don&#x27;t count vacation days.<p>* We pay your phone bill and when you join we&#x27;ll upgrade you to the newest iPhone. We might have to steal from somebody if you want a gold one though.<p>* You&#x27;ll get a dope computer…duh.<p>If you&#x27;re not from Chicago but want to work with us for a month, we&#x27;ll fly you out and you can live in our startup dorm. (We&#x27;ve got 5 out of 6 units in our two neighboring houses and they&#x27;re all our friends.)<p>If you pass our interview and we offer you a job, you can keep $1,000 cash even if you don&#x27;t take the job.<p>If you&#x27;re interested, just email jobs@popularpays.com with your name&#x2F;Github&#x2F;Twitter and say hi.","time":1384230299,"type":"comment"}