{"by":"johnomoore","id":6737108,"parent":6653437,"text":"Boston - Atelion Health - Full Time - On Site<p><a href=\"https://careers.stackoverflow.com/employer/jobs/55465/listing\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;employer&#x2F;jobs&#x2F;55465&#x2F;listin...</a><p>Job Description:<p>Frontend Software Engineer and Core Team Member of Innovative Healthcare Startup<p>Qualifications:<p>Proficient in HTML5, JavaScript, CSS3 development of data-driven apps (mobile and desktop)\nExperience developing successful commercial apps\nSkill creating compelling data visualizations and responsive user interfaces\nPassion for optimizing user experience in difficult problems\nAble to work full-time on-site in our Harvard Square, Cambridge, MA office<p>About the Company:<p>Atelion Health is an early-stage startup company. It is a MIT Media Lab spin-off from the New Media Medicine Group (<a href=\"http://newmed.media.mit.edu\" rel=\"nofollow\">http:&#x2F;&#x2F;newmed.media.mit.edu</a>) creating a software platform that empowers patients to lead the management of their chronic diseases through a revolutionary new model of collaboration with clinicians. Six years of research provide evidence that our disruptive approach will yield unparalleled improvements in experience, outcomes, and cost.<p>Transforming healthcare is one of the most challenging and rewarding missions. It is not just about engineering but about navigating an entrenched culture and perverse economic incentives. You should be excited about being part of a revolution and have passion for developing elegant solutions to complex problems. The time for change is now, and Atelion Health is poised to have a profound impact. You will be part of a team that will help to improve the lives of millions.<p>Specifics of the Job:<p>You will be a high-level team member, involved in all aspects of the platform and user experience, but your focus will be on the cross-platform frontend applications. Applications for patients need to take complex medical data and make it accessible and compelling in ways that engage them in improving their health. Applications for clinicians need to allow them to efficiently and effectively care for thousands of patients with constantly evolving conditions while making each patient feel like he or she is the only one that matters.<p>You should not just be a programmer, but a true software engineer who enjoys analyzing problems and architecting mobile applications. You communicate extremely well and enjoy collaborating with backend developers to create the optimal user experience. You write clear and concise code, understand the benefit of effective documentation, have expertise in rigorous testing methodologies, and have experience in deploying and maintaining commercial apps.<p>Desirable Skill Sets:<p>HTML5 &#x2F; CSS3 &#x2F; JavaScript\nAngular &#x2F; Backbone &#x2F; Ember &#x2F; etc.\nData Visualization (D3.js a plus)\nPhoneGap &#x2F; Sencha Touch &#x2F; etc.\nAndroid &#x2F; iOS &#x2F; Windows\nUnit Testing &#x2F; Integration Testing &#x2F; UML &#x2F; Design Patterns &#x2F; Refactoring<p>Perks:<p>Competitive startup salary\nEquity in the company as an early member of the core team\nHealthcare benefits\nConveniently located in Harvard Square<p>Contact: johnomoore@gmail.com","time":1384478811,"type":"comment"}