{"by":"floydy50","id":5305969,"kids":[5306163],"parent":5304169,"text":"London, England. \nCTO<p>Contact Ben@barpass.co.uk<p>Who are we<p>Bar Pass Ltd, founded by two finance professionals with experience in providing technology within the hospitality industry, growing and advising young companies through from concept to profit.<p>What we are doing\nDeveloping a mobile application that provides customers in a bar the ability to browse the menu, order and pay for food and drinks through their mobile device.<p>Where we are as a company<p>We are fully funded up to release of V1 and have a number of people looking to back us after this point. \nWe have had a several positive meetings with target chains of bars, that are keen on our solution and see it as a higher quality vision than our competition. We are well connected within our target market and have some very senior industry players keen to take active board positions.<p>Who you are<p>You will be working full time as CTO, working at our offices in London.<p>You will be responsible for defining and implementing our web and mobile strategy. You will eventually have the opportunity to form and lead a larger team.<p>During early stages you may be required to manage contractors to help build out some parts of our solution.<p>Core requirements:<p>&#62; Comfortable being the sole internal developer working on a new product from the ground up\n&#62; Experience with both back-end API development and front-end mobile application development\n&#62; Back-end architecture and RESTful API design &#38; development to support consumer iOS, Android and Web apps.\n&#62; Work on integration with payment processors and social networks\n&#62; Experience building solutions which are fast, reliable, flexible and scalable\n&#62; Experience building for iOS in Objective-C\n&#62; Familiarity with Agile/SCRUM and TDD practices\n&#62; Continuous Integration, cloud based deployment and other DevOps/SysOps understanding<p>What we offer<p>Dependant on experience we will offer a salary between £20,000-£30,000 as well a minimum of 5% equity.\nThe chance to get involved with a great business from the beginning and decide what we offer to our next employees.<p>Contact Ben@barpass.co.uk","time":1362162343,"type":"comment"}