{"by":"stevemarsh","id":5305200,"kids":[5307081,5305290],"parent":5304169,"text":"Cambridge, UK - Full Time - Server-side SUPERMAN!<p>GeoSpock Ltd.<p>US:<p>At GeoSpock we love technology, we especially love tech that solves real world problems. We’re building a platform to power mobile apps which will completely revolutionise the way you interact with the world around you. Founded by techies and a crack-team of startup veterans, our brand-spanking new, funded, Cambridge-based startup is on the lookout for awesome talent who want to make a dent in the universe…<p>YOU:<p>So you’ve the brain the size of a small planet, you’re a master hacker and you’re so sh*t hot at coding that you don’t even know what a bug looks like anymore. Like most ninjas you’re hard to find, elusive, hard-as-nails and always finish the mission no matter what! You’re bored and want to do something beyond the normal 9-to-5 rat-race – you want to change the world.<p>We’re looking for a hero, someone who understands BIG-DATA and can solve the big problems of scale. We want someone who can help us build a powerful platform capable of simultaneously serving millions of users interacting in real-time and who can save the day if things go wrong!<p>Must-haves:<p><pre><code>   - A great sense of humour &#38; energy levels\n   - Master Python hacker as well as Java or C/C++\n   - Excellent knowledge of Object-oriented programing, data structures, algorithms and complexity theory\n   - In depth knowledge of databases, parallel programming and JSON REST APIs\n   - Test-driven development experience\n   - An interest in Big-Data\n</code></pre>\nNice-to-haves:<p><pre><code>   - A love of beer, socializing and changing people’s lives for the better\n   - Experience working with startups\n   - Experience with Git or other version control systems\n   - Knowledge of NoSQL databases\n   - Experience with cloud based services AWS, AppEngine, Heroku etc.\n   - Web development experience\n   - Machine learning expertise\n</code></pre>\n£ Lots of pennies + EQUITY + FREE ACCOMODATION AT OUR HACKER-HOUSE + NERF GUNS + FRUIT-BASED COMPUTER GEAR + iPhone + FUN + FAME + BEER + more<p>This is no ordinary company…<p>Email: Steve@getcollide.com","time":1362155755,"type":"comment"}