{"by":"mindcrime","id":5306513,"parent":5304169,"text":"Raleigh / Durham / Chapel Hill, NC.  Fogbeam Labs.  <a href=\"http://www.fogbeam.com\" rel=\"nofollow\">http://www.fogbeam.com</a><p>We are looking for sales people, to sell Open Source enterprise software.  We have some really cool products that live at the intersection of social-networking, business process management, collaboration/groupware and knowledge management.  Think \"facebook for the enterprise\" (ala Yammer or Jive) but with a much stronger focus on deep integration into business processes and workflows.<p>Experience doing enterprise sales is preferred, but if you've never sold a thing in your life and you're interested, apply anyway.  We'll train the right person(s).<p>And if you <i>really</i> have the right stuff, we'd consider granting you a significant chunk of equity and bringing you in as a co-founder.  In any case, since this is a startup, there is a ton of opportunity to grow and help us build an empire.  Our first salesperson could easily wind up VP of Sales or Chief Marketing Officer or something down the road (if they are interested, of course).<p>We're also open to adding another technical person to the co-founding team.  The right person would need some seriously strong technical chops, with a background in the JVM world, preferably with some or all of:<p>serious Groovy/Grails experience, strong knowledge of various persistence mechanisms (relational databases, graph databases, document databases, etc), experience with Lucene, Mahout, jBPM, Activiti, Camel, Jena, Solr, and/or Hadoop.  Any experience with Machine Learning, NLP, Semantic Web technologies, and/or Social Network Analysis would be a big bonus.  A double extra super bonus would be any experience or background as a business analyst or similar role.  Front end development skills would be a positive as well, but isn't required (one of the current co-founders (not me) is a bad-ass front-end designer).<p>So, if you're interested in joining the next great Open Source enterprise software company, working on Open Source projects full-time (and we mean REAL Open Source, developed in the open, collaboratively, ASLv2 licensed, etc), working on hard problems with Machine Learning, NLP, Information Retrieval, Social Network Analysis, and \"big data\" tools, get in touch.  We have an obsessive focus on solving real problems and creating real value, in exchange for real money.  This isn't some speculative \"hey, let's build a great site for sharing photos of cats doing silly things and figure out how to monetize it when we have a billion users\" deal.<p>We can't pay any relocation expenses at the moment, so local folks only, please.  Email prhodes (at) fogbeam (dot) com for more info.","time":1362167153,"type":"comment"}