{"by":"joelg87","id":5306277,"kids":[5317602,5349933,5373225],"parent":5304169,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - Anywhere in the world (we're a distributed team of 10 people in the US, UK, Hong Kong and Sydney).<p>I'd love for you to come join Buffer for the fun ride. We have over 500,000 users and are on a $1M+ annual revenue run rate. There are some super interesting challenges ahead, as we are looking to hit the millions of users in 2013.<p>We've consistently grown 15% MoM for the last year and are expecting even faster growth in the coming months through our mobile efforts. That's where we are in need of some help.<p><pre><code>    So, we're looking for an Android Developer to work on our app.\n    This includes taking over most of the work of the app which has\n    70,000 downloads and more in the Kindle and Blackberry stores too.\n    If you've worked with Android before, that's great. If you're a great\n    hacker and have developed in Java or other mobile platforms that's\n    awesome also.\n</code></pre>\nIf you're interested in coming on board, you will:<p><pre><code>    - work primarily with myself and Sunil, who has lead development\n      so far and is now taking a more general tech role\n    - be a happy, positive-minded and kind person who has a great\n      approach in dealing with others\n    - be a Buffer user (would be awesome, it’s cool if not)\n    - be friendly and comfortable helping our users\n    - be anywhere in the world, and if you'd like, you have help and\n      support from us to move to where you want to be\n    - have experience working with another startup before (would\n      be awesome, it’s cool if not)\n</code></pre>\nOne of our core values at Buffer is to \"Default to transparency\". I've told you above how many users we have, and our revenues. We raised $450k from awesome investors, and we are cash-flow positive. Within the team, there is even more transparency. We have an Open Salary policy where everyone knows how much everyone else makes.<p>Another key value we have is to \"Have a focus on self improvement\". The thing that we do which I don't know that any other startups do, is that we have a daily 'standup' Google Hangout between pairs of people in the team (the pairs cycle each 2 weeks). As part of the call we share a daily improvement. Something we're working on to improve ourselves. It can be related to Buffer, but usually it isn't. Some examples of improvements people have worked on: start blogging every 2 weeks, speak at first event, speak to a new person every day, wake up an hour earlier. We all encourage each other with our improvements, and this helps us push forward much faster than otherwise. It's a really positive environment and there is built in accountability. Everyone here seems to progress at an incredible pace, we want to do everything to make that happen for you as well. Whether you want to start speaking, blogging, learning marketing or have other areas of personal growth, you’ll have my personal support and the whole team as a resource too.<p>If you're interested in all our values, you can take a look at them here: <a href=\"http://www.slideshare.net/joelg2/buffer-culture-01-16707113\" rel=\"nofollow\">http://www.slideshare.net/joelg2/buffer-culture-01-16707113</a><p>Since we have Open Salaries at Buffer, I can tell you right now that your salary will be between $88k and $110k depending on your location (living costs) and experience. You will also get equity in the 0.5-1.5% range.<p>If this sounds fun, let's have a chat. I'm looking forward to it! I'm Joel, drop me an email directly - joel@bufferapp.com.","time":1362165053,"type":"comment"}