{"by":"nkohari","id":5307451,"parent":5304169,"text":"Adzerk (<a href=\"http://adzerk.com\" rel=\"nofollow\">http://adzerk.com</a>) - Durham, NC (also Raleigh or Chapel Hill)<p>Ready to put all those ideas about scalability into practice in a situation where you really need it? We're helping Stack Overflow and other sites that you've probably heard of serve billions of ads per month. At that scale, things get very interesting.<p>As an engineer at Adzerk, you'll have the opportunity to work on all parts of our system, from the front-end web UI to the engines that serve the ads. Our system uses Node.js, C# (Mono), ASP.NET MVC, jQuery, MongoDB, Hadoop, and RabbitMQ.<p>We're also looking for someone to fill a more devops-oriented role. We use Chef to administer our systems on AWS, build and deploy using Travis-CI, and monitor using DataDog (a pretty cool startup based around statsd).<p>Performance and scalability are our two primary concerns, and with the traffic and growth rates that we're experiencing, lots of the lessons that you've learned start to break down. Because of that, it's not as important what you know right now – what matters is how quickly you can learn and adapt.<p><pre><code>  * Your work will have an immediate and profound impact on our product and business.\n  * We ship code dozens of times a week, and you will write code and push to production on your first day.\n  * You will be responsible for making important decisions about what tools and libraries we use.\n  * You will have a direct role in building the team, helping us choose additional team members as we grow in size.\n  * We prize open source contribution. You should have a GitHub account already.\n  * Everyone gets equity. We want a team of partners.\n  * Unlimited vacation. We work hard, but at a sustainable pace.\n  * Flexible work schedule, including working at home part-time if you want.\n</code></pre>\nIf you think you might be a great fit, drop us a line at jobs@adzerk.com.","time":1362177918,"type":"comment"}