{"by":"lambda","id":5307808,"parent":5304169,"text":"Boston, MA (Full time or single-project contract starting immediately)<p>EditShare <a href=\"http://www.editshare.com/\" rel=\"nofollow\">http://www.editshare.com/</a><p>We are a small but rapidly growing company selling integrated hardware and software solutions for a professional digital video editing workflow. We have always been privately owned, never taken funding from anyone outside the company; you will be working directly with the CEO and co-owner, who built the company from a single machine at a trade show.<p>We are looking for a full-stack JavaScript developer, with experience in Node.js, Backbone.js, Socket.IO, and HTML5 video (or some suitable subset, or equivalent experience with similar frameworks). We are creating a web-based interface for a video asset management system, which will allow searching and playing video and adding metadata.<p>We are ready to hire immediately; we had the previous developer on this project leave unexpectedly, and have an urgent deadline approaching, so we are ready to give a job offer on Monday if you're good. Code samples are strongly recommended when applying.<p><a href=\"http://ephemera.continuation.org/FullStackWebDeveloper.pdf\" rel=\"nofollow\">http://ephemera.continuation.org/FullStackWebDeveloper.pdf</a><p>In addition, we are always looking for good engineers for our other products. We maintain our own Linux distribution (we are in the process of moving from an RPM based distro to  an Ubuntu derivative) which forms the basis for our platform, and write management software in Python using Twisted, work on a variety of open source packages in C, and have application software written in C++. We strongly support open source software, funding and working closely with several projects, as well as having released Lightworks (<a href=\"http://lwks.com/\" rel=\"nofollow\">http://lwks.com/</a>), a professional non-linear video editor, for free (as in beer at the moment, though we plan to release the source code once we've finished the Linux and Mac ports and removed the proprietary codecs that we've licensed from third parties). So if you have experience in digital video, distributed systems, storage, backup, Linux packaging, Python, C, or C++, we would also love to hear from you.<p>Email resume and code samples (cover letter optional, but at least mention which position you are interested in) to: work(at)editshare.com","time":1362183578,"type":"comment"}