{"by":"a113n","id":5307393,"parent":5304169,"text":"BIGLIST (<a href=\"http://www.biglist.com/\" rel=\"nofollow\">http://www.biglist.com/</a>) - Media, PA (outside of Philadelphia)<p>BIGLIST seeks a full-time application developer skilled in open-source software tools, and with a passion for creating web and Internet-based applications. You will help us build our next-generation products and services. Our tools, current and future:<p>* Dynamic programming languages (Ruby, Perl, PHP, etc.)\n* Unix tool chain and design philosophies. We live on the command line.\n* SQL databases (PostgreSQL) and NoSQL data stores (Redis, Hadoop)\n* Web technologies (Ruby on Rails, PHP, HTML, CSS, Javascript, JQuery)\n* Message queuing (Resque, AMQP)\n* Agile development practices (Git, TDD, Iterative releases)\n* Email systems (Qmail, Postfix)<p>We recognize the best people are smart and adapt to new technologies, have experience with this tool chain, and can sprint independently or collaborate. Your resume need not match the listed technologies exactly if you catch on quickly.<p>You will be an integral part of the company and will influence how we work.<p>===================================================\nStart-up Agility. Stable Company.<p>BIGLIST is a small, stable, and profitable company. Our \"Software as a Service\" products allow companies to create, manage, and send email to their customers and contacts. Our applications include a front-end web interface and API for our clients, back-end processing to perform email distribution, automated mailing list management, service monitoring, and statistics analysis. Our office is located steps off of charming State Street in Everybody's Hometown, Media, PA, and is walking distance to public transport by trolley, bus, and regional rail line.<p>Please provide an ASCII, HTML or PDF version of your resume with cover letter, and Github projects, blog, application URLs or similar. jobs - developer () biglist . com","time":1362177254,"type":"comment"}