{"by":"jabrams","id":5321833,"parent":5304169,"text":"Founders Den: Office Manager (San Francisco)<p>We are looking for a well-rounded and high energy Office Manager to run the daily operations of Founders Den.  This is a challenging but fun opportunity to manage a dynamic entrepreneurial environment and network with startups, executives and VIPs in the technology industry.<p>Founders Den is a shared startup office space and private club for experienced entrepreneurs, located in the heart of San Francisco’s SoMa district.  Launched in January 2011, Founders Den is the only co-working space in San Francisco that operates on a referral-only model.  Founders Den was co-founded by four experienced entrepreneurs, Jason Johnson, Jonathan Abrams, Michael Levit, and Zachary Bogue.  Founders Den is sponsored by DLA Piper, Norwest Venture Partners, Bullpen Capital, Rackspace and Wells Fargo.   In our two years of operation, Founders Den has been home to over 75 startups like Cake Health, DataSift, DotCloud, Kaggle, Socialcam, and Wanelo, as well as Lieutenant Governor (and former San Francisco mayor) Gavin Newsom.<p>For more information see:<p><a href=\"http://www.foundersden.com/\" rel=\"nofollow\">http://www.foundersden.com/</a><p><a href=\"http://techcrunch.com/2011/01/10/founders-den/\" rel=\"nofollow\">http://techcrunch.com/2011/01/10/founders-den/</a><p><a href=\"http://www.youtube.com/watch?v=oOopg8ltENQ\" rel=\"nofollow\">http://www.youtube.com/watch?v=oOopg8ltENQ</a><p>Responsibilities:<p>- Oversee the day-to-day operations of Founders Den, reporting to the Managing Partners.<p>- Represent the Founders Den community and Managing Partners as the ambassador of Founders Den to advisors, partners, vendors, property management, visitors, tenants, and alumni.<p>- Handle facilities management and logistics including supplies, deliveries, kitchen &#38; beverages, and supervising repairs and cleaning.<p>- Manage shared resources such as conference rooms, and enforce house rules and policies with tenants and visitors.<p>- Coordinate tenant leasing, including tracking upcoming vacancies, conducting tours, interviewing prospective tenants, and coordinating the approval process with the Managing Partners.<p>- Manage internal and external events, such as talks, advisor dinners, demo nights, and sponsor events.  - Event management includes coordination of invitations, guest lists, event budgets, event staff, food &#38; beverages, furniture, and A/V.  Some late nights for coordinating evening events will be involved.<p>Requirements:<p>- Ability to multi-task and balance multiple changing priorities.<p>- Passion for community building.<p>- Excellent communication skills.<p>- Familiarity with basic bookkeeping and expense tracking.<p>- Experience or familiarity with Internet startups is preferred.<p>Please email resumes to michael@foundersden.com","time":1362440782,"type":"comment"}