{"by":"noahcoffey","id":5328679,"parent":5304169,"text":"UI/UX Designer for Formstack.com\nIndianapolis, IN<p>We're looking to add a UI/UX Designer to our growing UX team at Formstack. Are you passionate about web apps and modern, user-centered web design? Do you enjoy working in a collaborative environment that values critical &#38; constructive discussions about design?<p>Responsibilities:<p>* Work with the UX team to develop and iterate user interface designs for the Formstack app.\n * Translate design mock-ups into clean, standards compliant HTML and CSS.\n * Produce final user interface designs, adhering to the style and guidance of the UX team.\n * Work collaboratively with both the UX team and Development to implement your designs in an agile workflow environment.<p>Required experience / skills:<p>* 2 - 4 years of experience.\n * Experience in product development teams working on UI designs.\n * Experience or a high level of interest in UX.\n * Experience designing standards-based web sites that render properly in a wide array of web clients.\n * Experience using modern front-end frameworks and responsive design concepts.\n * Knowledge of how to best design to solve business and user problems. Ability to understand the needs of customers.\n * Design fundamentals including information design, visual design, industry UI standards for desktop and web-based applications, and ease of use best practices.\n * Experience with relevant design tools.\n * Strong written and verbal communication skills.\n * Strong understanding of HTML5, CSS, and JavaScript (this is not a development role, but a strong understanding of the advantages and limitations is imperative).<p>Awesome (but not required)<p>* Experience working on a UX team.\n * Experience designing for mobile apps (iOS, Android, Windows, etc.) and the mobile web.\n * Experience with Lean/Agile methodologies.<p>Other details:<p>* This position is located in our corporate office in Indianapolis.\n * Competitive salary &#38; 401k.\n * We provide full benefits: dental, vision and healthcare.<p>TO APPLY: <a href=\"https://www.formstack.com/forms/stack-ui_designer\" rel=\"nofollow\">https://www.formstack.com/forms/stack-ui_designer</a>","time":1362532594,"type":"comment"}