{"by":"NateLawson","id":3060397,"kids":[3060526],"parent":3060221,"text":"Oakland, CA - Root Labs<p>We are a fully-funded startup with a major paying customer, building a web-based service for analyzing and searching code. You will be in charge of building a large, distributed computing system for parsing and indexing code for our search engine. We've been creating the code analysis tools for existing customers, and we need you to build the automation framework to help us scale. We are building something really uncommon for a HN hiring thread, so contact me even if you're just curious!<p>We're solving problems that will have a major impact on the software industry. For example, one goal is that independent, open-source authors have a way to get paid for their work.<p>You'll team up with us to implement solutions to some challenging problems. (But don't worry, you don't already need to be an expert at all of these).<p><pre><code>    * Nearest-neighbor search in high dimension (or knowing how to\n      avoid this by projecting to a lower dimension)\n    * Classifying code by various metrics (structural flowgraph analysis,\n      symbol sequences and frequency, etc.)\n    * Map/reduce deconstruction of complex queries\n    * Distributed computing design, cluster management, software deployment,\n      load balancing \n</code></pre>\nBeing a good programmer is the most important part. We mostly work in Python and C/C++ although considering Scala or other options for some tasks. We use PostgreSQL, Redis, and Riak for a lot of the existing components.<p>You need to understand distributed computing, fault detection and error recovery, messaging, etc. An interest (but not expertise) in low-level details like compilers, operating systems, and reverse-engineering is a good plus.<p>We have much more details here:<p><a href=\"http://www.rootlabs.com/developer-job.html\" rel=\"nofollow\">http://www.rootlabs.com/developer-job.html</a><p>Ask any questions in the comments, or contact me directly at the address in my profile. Thanks!","time":1317487927,"type":"comment"}