{"by":"speek","id":7829804,"parent":7829042,"text":"Weft - <a href=\"http://weft.io\" rel=\"nofollow\">http:&#x2F;&#x2F;weft.io</a> - Cambridge&#x2F;Boston, MA (office is in central sq.)<p><pre><code>   ===========================\n   ====== What we do =========\n   ===========================\n</code></pre>\nReal-time logistics optimization (EZPass for Ports).<p>On the left side of the problem, we track every ship on the water so that we can make predictions about the impact of a bunch of things on the rest of the supply chain (this mostly manifests itself in us being able to help companies save a bunch of money on demurrage. One company we&#x27;re working with, alone, spends 6.5 mil every month on this). On the right side of the problem, we let truckers know when they need to arrive at a port in order to wait in line the least amount of time (so that they spend more time making money and less time waiting). Right smack dab in the middle, we optimize port throughput by scheduling all the right people to do the right thing at the right time.<p><pre><code>   ===========================\n   ===== How we do it ========\n   ===========================\n</code></pre>\nWeb&#x2F;data stack -&gt; Clojure + postgres&#x2F;cassandra&#x2F;redis&#x2F;rabbit + ruby on rails (along with hadoop&#x2F;EMR)<p>Mobile -&gt; Currently building iOS app, android in the near term<p>Algorithms -&gt; a dizzying mixture of oldschool and newschool techniques ;-)<p><pre><code>   ===========================\n   ====== And the rest =======\n   ===========================\n</code></pre>\nWe&#x27;ve got some very interesting partners and customers (ranging from telcos to enterprise software providers to regional and international logistics companies). We also have some top tier investors (a16z)!<p>Looking for help on mobile, frontend, and data science sides! Would be thrilled to find a CTO to grow the tech side of the company with me, but I&#x27;m also happy to find engineers who know their shit who just want to build great things.<p>If this sounds interesting, please shoot me an email at marc@weft.io!","time":1401641345,"type":"comment"}