{"by":"Robin_Message","id":7829603,"kids":[7852015],"parent":7829042,"text":"Firefly - London, UK <a href=\"http://fireflysolutions.co.uk/join-our-team/jobs/junior-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;fireflysolutions.co.uk&#x2F;join-our-team&#x2F;jobs&#x2F;junior-deve...</a><p>Firefly is a tool for schools to make it simple for students, teachers and parents to create, share and learn. We&#x27;re small (~30 people), which means we can stay close to our clients and develop and improve our products very quickly to meet their needs. It also means you&#x27;ll get great exposure to all of the things that go on in a fast growing business, and have a chance to have a big impact very quickly. We&#x27;re also quite a close-knit team, so we&#x27;re keen to find somebody with good social skills who would enjoy and thrive in this environment.<p>We’re looking for a junior back end web developer to join our growing development team. Development deals with expanding the functionality of Firefly, as well as providing support for the existing areas of the product. Previous experience in real world web development; familiarity with databases, mobile development and other school systems are helpful but not necessary.<p>We&#x27;re looking for someone who is:<p><pre><code>    • A keen and efficient problem solver\n    • Independent in their work\n    • Able to locate and fix problems in existing code\n    • A good team player to work with other members of the team and work alongside\n      our support team when necessary\n    • Good with time management\n    • Happy to take on responsibilities\n    • A logical thinker\n    • A good communicator – within the team and with other areas of the business\n</code></pre>\nKnowledge of any of these would also help:<p><pre><code>    • Microsoft development technologies (especially C# and ASP.NET)\n    • Mobile app development (iOS or Android)\n    • Linux, PHP and scripting\n    • Experience in the education sector\n</code></pre>\nMost importantly, we&#x27;re looking for someone friendly, enthusiastic and good at picking up new skills quickly.<p>Salary would be competitive and depend on experience. All of the Firefly team also participate in a yearly bonus scheme based on the success of the business and their contribution. We&#x27;re committed to your own professional development, so we offer a flexible training budget for you to spend on attending courses or other events.<p>Apply online at <a href=\"http://fireflysolutions.co.uk/join-our-team/jobs/junior-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;fireflysolutions.co.uk&#x2F;join-our-team&#x2F;jobs&#x2F;junior-deve...</a> or please drop me an e-mail with any questions at robin+hn1406@fireflysolutions.co.uk.","time":1401638485,"type":"comment"}