{"by":"JangoSteve","id":7829261,"parent":7829042,"text":"Alfa Jango - Ann Arbor &#x2F; Detroit, MI - Ruby, JavaScript, and front- and back-end developers - full-time - REMOTE or local<p>We build startups, all day, every day. We&#x27;re CTO and development team for hire. We help everyone from new founders who have an idea and aren&#x27;t sure what to do next, to founders who have already raised money and have a product and are looking for a more experienced team to help out or take over the technology.<p>Some of our startups are starting to do very well and we need to add someone to the team to help us grow. A couple have won large competitions this year, a few are raising funding (in addition to the several that have already raised funding) amidst initial traction, and I&#x27;m on my way out to Santa Monica right now for one that is starting in the new Edmunds.com FastLane startup accelerator.<p>---<p>We&#x27;re a small team of 5, looking to bring on two more developers. <i>We do most of our work using Ruby, JavaScript, HTML5, CSS, and other open web technologies (CoffeeScript, SASS, and more). We&#x27;re looking for intermediate to senior level developers for the next two positions (and maybe some interns or beginner-level developers immediately after that).</i><p>---<p>We also work on a lot on open-source. For example, I maintain the Rails jquery-ujs [1] and jquery-rails [2] libraries; Scott is a maintainer of the Kandan open-source chat app [3]; and we just launched Dynatable.js [4] back in December; and we have several other projects in the works as well [5]. Our open-source projects have over 8,000 combined stars on Github so far.<p>We also each have our own side-projects we work on as well.<p>If working on startups and open-source sounds like a lot of fun to you, then you might be a good fit :-) If you&#x27;re ready to become an integral part of a startup building startups, let us know.<p>Reach out to us at support@alfajango.com.<p>[1] <a href=\"https://github.com/rails/jquery-ujs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;rails&#x2F;jquery-ujs</a><p>[2] <a href=\"http://rubygems.org/gems/jquery-rails\" rel=\"nofollow\">http:&#x2F;&#x2F;rubygems.org&#x2F;gems&#x2F;jquery-rails</a><p>[3] <a href=\"https://github.com/kandanapp/kandan\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;kandanapp&#x2F;kandan</a><p>[4] <a href=\"http://www.dynatable.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dynatable.com&#x2F;</a><p>[5] <a href=\"http://os.alfajango.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;os.alfajango.com&#x2F;</a>","time":1401633320,"type":"comment"}