{"by":"laironald","id":7829787,"parent":7829042,"text":"Storefront - FULLTIME in San Francisco, CA -- Jobs: <a href=\"http://sfrt.co/1n0rS2j\" rel=\"nofollow\">http:&#x2F;&#x2F;sfrt.co&#x2F;1n0rS2j</a><p>Storefront is the world&#x27;s largest marketplace connecting the best merchants with the best short term physical space. The press likes to call us the Airbnb for Retail, but we like to think of ourselves as making retail accessible.<p><i>Hiring</i>:<p>UX, software engineers (Stack = Rails, AngularJS) and other non technical roles.<p><i>Traction</i>:<p>To date we have successfully launched over 1,000 retail experiences. Our customers are entrepreneurs and we are humbled by the opportunity to work with this dynamic group of people.<p><i>Funding</i>:<p>We recently completed a $7.3m round led by Spark Capital, investors of Warby Parker, Twitter, Tumblr, OMGPop and others. Other notable investors include Troy Carter (Lady Gaga&#x27;s former manager), NAS, Gary Vaynerchuk, Tom Glocer (former CEO of Thompson Reuters) and Vikram Pandit (former CEO of Citigroup).<p><i>Storefronters</i>:<p>Storefront has alumni from Harvard, MIT, Stanford, UChicago, Berkeley, McKinsey, Goldman Sachs, Apple, Google, Trulia, Yelp and other awesome institutions. We are looking for YOU to join this dynamic group of individuals.<p><i>Technology and Company</i>:<p>Our stack is AngularJS, Rails and Bootstrap. We solve difficult problems in matching, build processes for offline + online, we are building a large transaction platform (deals can be $100k+) and we have the opportunity to work with our customers who are hungry, hustling entrepreneurs. If you are looking to work with an incredible team disrupting a $100bn+ market, apply. Please put [hacker news] in the Subject line of the Application so we can pay special attention.<p><i>About you</i>:<p>We are looking for candidates with the following characteristics:<p><pre><code>  * great communicators\n  * initiative\n  * ownership\n  * passion\n</code></pre>\nWe give a lot of freedom and responsibility to our employees.<p><i>About Me</i>:<p>My name is Ron Lai and I am the VP of Product. I enjoy mentoring my team and providing people opportunities to grow. Pls learn more about me @ <a href=\"https://linkedin.com/in/ronaldlai\" rel=\"nofollow\">https:&#x2F;&#x2F;linkedin.com&#x2F;in&#x2F;ronaldlai</a><p>Jobs @ <a href=\"http://sfrt.co/1n0rS2j\" rel=\"nofollow\">http:&#x2F;&#x2F;sfrt.co&#x2F;1n0rS2j</a>","time":1401641081,"type":"comment"}