{"by":"jerryr","id":7829769,"parent":7829042,"text":"MindTribe - San Francisco, CA<p>We make hardware. We’re looking for senior firmware engineers to join the team!<p>The hard requirements are brief: 5+ years of writing code for embedded systems with experience leading projects. At Mindtribe we code most often in C. In addition to technical work, our senior engineers plan projects, lead teams of engineers, and mentor junior members.<p>At this point, you can tackle most technical challenges that come your way. The rest you could figure out given enough time. You’re starting to grow into someone who can elevate an entire team – not just by adding engineering horsepower, but by multiplying the abilities of those around you. You could probably get a job anywhere you want. Why Mindtribe?<p>As a product development consultancy, we get to peek inside a lot of exciting companies. That’s how we know there’s nowhere else we’d rather be.<p>Nobody sees the kind of variety that we do. Working at Mindtribe is being immersed in a constant stream of projects across different industries using different technologies. You will learn. A lot. About everything. Mindtribers are not just versatile within their own fields – “firmware” engineers work with everything from 8-bit micros to embedded Linux to smartphones – we also have EE’s driving SolidWorks, ME’s developing iOS apps, and FW engineers laying out PCB’s. You’ll iterate through many careers-worth of projects and solutions faster than you thought possible. And you’ll get better at it each time.<p>Everyone here loves hardware, so much that we’ve been known to spend leisure time on projects that aren’t so different from what we do at work. Or perhaps it’s the other way around. We may code in bits and bytes, but we work in the real world. Our desks are cluttered with dev boards and prototypes. We work shoulder-to-shoulder with teammates, discuss our work throughout each day, and build amazing things together. We’re constantly in front of clients to extract feedback, plot course corrections, and lead the way.<p>Mindtribe succeeds by putting forward strong teams with sound methods. While we consider ourselves talented engineers, relying on heroic individual efforts to meet impossible deadlines is a painful way to squeak by. Instead, our edge comes from constant introspection about how we do engineering, and we are always looking for ways to improve. Things that are broken here don’t stay that way for long.<p>We’re a small company. As a result, your contributions will have immediate, visible impacts not just on projects, but also on the success of the entire organization. Although we all swab the decks, everyone also gets to help steer.<p>Mindtribe is located in the heart of downtown San Francisco, convenient to public transit and at the epicenter of a flourishing technology industry. We enjoy working together and place great value in maintaining an awesome company environment. ‘Tribers regularly spend time together outside the office, whether that’s doing happy hour at a local watering hole or enjoying the rocking chairs at the new Exploratorium.<p>For more information about us, check out our team (<a href=\"http://www.mindtribe.com/team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mindtribe.com&#x2F;team</a>), our portfolio (<a href=\"http://www.mindtribe.com/portfolio\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mindtribe.com&#x2F;portfolio</a>), and our method (<a href=\"http://www.mindtribe.com/method\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mindtribe.com&#x2F;method</a>).<p>If this is resonating, we’d love to get to know you! Please drop us a line at nopnjmp@mindtribe.com to tell us how you’ve demonstrated leadership in your career and why you’d be excited to do what we do.","time":1401640720,"type":"comment"}