{"by":"dphase","id":7829441,"parent":7829042,"text":"Where are we?<p>- Doesn’t matter - you can work from your preferred location. But in case you’re wondering, we’re in Hattiesburg, MS.<p>Who are we?<p>- <a href=\"http://www.schoolstatus.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.schoolstatus.com</a><p>- SchoolStatus is a data framework for the K-12 education industry that combines a school district&#x27;s disjointed data systems into one easily-accessed location. Our web-based interface allows educators to make data-driven decisions - regardless of previous technology experience. We also provide a mechanism for principals to deliver evaluation measures to teachers for real-time classroom feedback.<p>- Our backend engine provides mechanisms for automated data retrieval and sanitation, allowing the customer’s data to remain fresh with no interaction needed.<p>- Launched in January 2013, we’ve quickly become the data solution for roughly 50% of Mississippi public school districts and are currently migrating into other states.  We’ve been revenue-driven and maintain profitability, which has made us attractive to potential funding sources and we’re currently considering our options.<p>Who are you?<p>- You are a talented, enthusiastic programmer that can’t wait to assist in the development of our backend engine and front-end interfaces.  Our core technologies include:<p>* Ruby as primary language on backend.  Due to lack of APIs on many third-party educational systems, data retrieval is often performed by various scraping methods.  Experience with Mechanize, Nokogiri, Watir, and the likes are the icing on your cake.<p>* Ruby’s Padrino, a highly extensible framework built on Sinatra, is the glue connecting our backend to frontend.<p>* MongoDB, Redis, Postgresql, Elasticsearch, and Amazon Redshift provide our various data stores.<p>* Objective-C&#x2F;UIKit powers our teacher evaluation instrument for iPad and you are totally okay with that.<p>* Angular.js on the frontend is something that makes you smile. Data visualizations created with Highcharts, D3, and Charts.js.<p>* By no means are we limited to the languages and technologies above.  Solutions from other areas are always welcome - as long as they play nice with others (Flash.)<p>What will we give you?<p>- Competitive salary with full health, vision, and dental benefits.<p>- Retirement plan (comparable to the big guys that have way more meetings) with company match that will make sure your cohabitating hamsters are well-cared for in their old age.<p>- Flexible vacation structure (meaning just tell us you’re going out of town), including a company-provided condominium in Florida.  Yes, we have a condo.<p>What will you give us?<p>- Loyalty to the company goals as a whole and a desire to serve the greater good.<p>- Flexibility to perform outside of your specific role when it’s needed, included talking with customers and attending trade shows from time to time.<p>- A good sense of humor - because nobody likes a boring job.<p>----<p>Contact us with questions, resume&#x2F;CV, or portfolio at hack@schoolstatus.com","time":1401636235,"type":"comment"}