{"by":"adambratt","id":7829192,"parent":7829042,"text":"Benzinga -- is getting massive amounts of new traffic and we need some more team members to help us handle all the new visitors either REMOTE or local full-time in Detroit, MI.<p><pre><code>   Positions\n      ☆☆☆ Lead UX &#x2F; UI Designer &#x2F; CD - Full creative control + build your own team\n      ☆ Senior Django Developer \n      ☆ Senior Drupal Developer\n\n\n   Quick Stats\n      ★ Customers include TD Ameritrade, Microsoft, Yahoo\n      ★ 20 million+ monthly readers\n      ★ 1000s of subscribers to our private Marketfy investor communities\n      ★ Accelerated growth rate \n</code></pre>\nWe&#x27;re a financial media company, a poor man&#x27;s - lest we say everyday man&#x27;s - Bloomberg competitor, and a financial product SaaS all forged together into a powerful trident that is attacking the high seas of Wall Street in a relentless pursuit of transparency.<p>And conquer we shall! We&#x27;ve grown 100% quarter over quarter all last year and another 100% just in the last month. Our team has surged to 30+ people and the waves of revenue washed together to form a rushing roar with just one of our products going from nothing to $200k&#x2F;month in under a year.<p>Being a media company we find our way into all kinds of cool stuff. Our office is furnished with things like a $3000 high-end bed that was sent to us to review. We got to talk to and get pictures with Warren Buffett and Lloyd Blankfein (CEO of Goldman Sachs) when they came to Detroit.<p>But, you interject, finance is one of the toughest startup seas to sail upon! The old boys club runs an ironclad ship with no visible decks for boarding. Avast! We&#x27;ve built a battering ram of a business in just a few short years that has pummeled its way deep into the heart of Wall Street. Old Ironsides has warmed itself to Benzinga and once a taste the thirst cannot be quenched.<p>We&#x27;ve recently became Microsoft&#x27;s premier finance partner alongside 3 other companies, all worth over a billion dollars and established for years. As of this Christmas we were installed by default on 500 million desktops and tablets via Windows 8 Finance. No download necessary. That&#x27;s right mateys, we&#x27;re in the source code.<p>And if you happen to trade or invest yourself you&#x27;ll find us inside almost all of the major brokerages in the US.<p>So, where do you fit in this rigging, you swashbuckling scalawag? Well, our team is crazy ambitious, motivated, and experienced with shaking shit up. If you know your tech, and want on deck this is the place to do it. Your exact technical background and language of choice doesn&#x27;t matter as much as your motivation and your ability to adapt quickly.<p>We are a young team and we&#x27;re especially looking for sailors who&#x27;ve got some salt in their whiskers who can help us scale from millions to hundreds of millions.<p>Why be a ninja when you can be a pirate? This ship is forging a new course, send an email to dev-us@benzinga.com to board!<p>Email us now: dev-us@benzinga.com<p>Check us out: <a href=\"http://marketfy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;marketfy.com</a> and <a href=\"http://benzinga.com\" rel=\"nofollow\">http:&#x2F;&#x2F;benzinga.com</a>","time":1401631951,"type":"comment"}