{"by":"yesimahuman","id":7829195,"parent":7829042,"text":"Ionic Framework - <a href=\"http://ionicframework.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;ionicframework.com&#x2F;</a> - Madison, WI or REMOTE<p>We are looking for a few great developers to help make Ionic and web technologies the leading platform for mobile development.<p>The first role we are looking for is a core contributor to our  open source GitHub project (<a href=\"https://github.com/driftyco/ionic\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;driftyco&#x2F;ionic</a>). As a core contributor, you will work with the existing contributor team to add new features to the framework, fix issues, interact with the community, and build out build and test services. We are looking for strong Javascript developers that love the web but are interested in adapting native concepts to the browser. We are lucky to say we get to work on open source as a full time job!<p>We are also looking for two backend developers to help build out our as yet unreleased backend services and tools which will give Ionic developers some unique and powerful features that make building on Ionic very compelling. Come help us build out our service stack on AWS with Docker, Python, and Go.<p>In the few months since Ionic has been out, the project has seen some really great adoption. With 6200 stars, Ionic is one of the top 120 projects on github and rising quickly. Traffic is growing 40% month over month, and our developer community is becoming very strong. Come join our team of 12 (a mixture of Madison and remote in the US) in making native development a thing of the past! (More about our company: <a href=\"http://techcrunch.com/2014/03/10/drifty-makers-of-the-ionic-mobile-framework-raise-1-million/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;03&#x2F;10&#x2F;drifty-makers-of-the-ionic-...</a>)<p>To apply, either send an email to max AT ionicframework DOT com, or apply on AngelList: <a href=\"https://angel.co/ionic-2\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;ionic-2</a>","time":1401632051,"type":"comment"}