{"by":"capkutay","id":7830017,"parent":7829042,"text":"WebAction (www.webaction.com) in Downtown Palo Alto - Full Time Hiring UI Engineers, Platform Engineers\nJobs@WebAction.com<p>At WebAction, we&#x27;re working on a platform that shrinks the gap between you and diverse, physically disparate data at petabyte scale. WebAction is a company based in the San Francisco Bay Area, providing an end-to-end platform that aims to enable the next generation of real-time, data driven applications. Founded by a team of Silicon Valley veterans with proven track records, WebAction is backed by some of the most respected names in Silicon Valley. We&#x27;re also well funded (recently raised $11m Series B by a private equity firm with a $15 billion fund).<p>We offer a competitive salary, excellent benefits package, generous equity for the right candidates. Our office is also a short walk from some great restaurants and coffee spots on University Avenue in Downtown Palo Alto.<p>For the UI Developer Position:<p>-Turn mockups and wireframes into functional, fluid web components<p>-Implementing beautiful and robust dashboards using d3.js<p>Requirements:<p>-Strong knowledge of Javascript, CSS, HTML, and jQuery<p>-Enthusiasm for working in a startup environment<p>Nice to haves<p>-You’re interested in designing engaging and intuitive user experiences<p>-Experience with Backbone.js, angular.js or other front-end MV* frameworks<p>-An interest in the type of scalable systems you hear about at Google, Facebook, Twitter, etc.<p>-You’re interested in telling stories and revealing anomalies through data visualization<p>-Concentration in Human Computer Interaction<p>For the Platform Engineering position, we ask that you have experience writing clean code in Java and have a strong desire and skills to work on a scalable, highly optimized data management infrastructure. We ask that you have the following skills:<p>-Large-scale distributed systems<p>-Highly available, highly scalable architectures, Hadoop (MapReduce &#x2F; Pig &#x2F; Zookeeper),<p>- Data Serialization (Avro &#x2F; Thrift &#x2F; Protocol Buffers)<p>- Experience with HBase or Cassandra<p>-Real-time messaging (0MQ &#x2F; Kestrel &#x2F; Kafka or similar), Real-time event processing, Continuous Queries<p>If this sounds like you, shoot us an e-mail at jobs@WebAction.com.","time":1401645193,"type":"comment"}