{"by":"drags","id":7830708,"kids":[7830733],"parent":7829042,"text":"&gt;&gt;&gt; VERBA - San Francisco, CA<p>&gt;&gt;&gt; jobs@verbasoftware.com<p>&gt;&gt;&gt; <a href=\"http://staging.verbasoftware.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;staging.verbasoftware.com&#x2F;</a> (we&#x27;re mid-refresh)<p>&gt;&gt;&gt; Senior Rails&#x2F;JS Product Focus - FULL-TIME or HALF-TIME with benefits<p>We&#x27;re making higher education more affordable: Helping students compare their bookstore’s prices to those of its online competitors; Giving recommendations on close-to-market bookstore prices; Getting professor book choices in faster; Helping bookstores buy and sell books on a level playing field.<p>We guide every stage of a used book’s life. We help students save money, and bookstores become and stay relevant, competitive, and transparent.<p>&gt; Metrics: 350 colleges and universities, serving 4.5 million students, tracking ~200k unique book titles, integrating with 7 vendors &amp; 20 retailers, raising the “win rate” for bookstores to 80%, and dropping prices across the board. 17 employees, 3 part-time. 2 dogs. 5 cats. 3 children.<p>Profitable. Growing.<p>&gt; Code: Ruby, Rails, JS (Coffeescript&#x2F;Backbone), Clojure for Hadoop, MySQL on RDS, AWS w&#x2F; Chef. We love experiments and go with what works! We also love making a stable, solid product which is why we have a ton of metrics and a one-click build pipeline.<p>What’s in it for you: A great team and company culture, benefits (even for part time!), a laptop, unlimited books, BART pass, pool table, healthy (and un-) office snacks, great conversation during our yearly company work-cations, and hard, challenging, fulfilling, good (in the public sense) work.<p>&gt; Message us if: You want to help make education better. You’ve got strong Rails knowledge (several years worth), solid testing practices, a good head for architecture, and know enough JS to help out on front-end. A stats background, experience with Hadoop and knowledge of scheduling algorithms would be awesome, but not required.<p>How to get the job: Write a cover letter to jobs@verbasoftware.com that speaks to why this job might fit with you, and how you could help us out. The first step is a phone screen to solve a small programming problem. Then we’ll schedule an on-site interview for a few hours, where you&#x27;ll present for 15 minutes on any topic you&#x27;d like, have you walk through some of our code with us, and then deep-dive into the whole stack. Also we’ll ask you some historical behavior questions, not logic puzzles. Then we’ll make you an offer, and you’ll accept and we have a new employee party!","time":1401657246,"type":"comment"}