{"by":"jason_wang","id":7830140,"parent":7829042,"text":"TrueVault (YC W14), San Francisco (SoMa)<p>We are hiring our founding engineering team right now, so this is a high impact and high ownership opportunity with competitive salary and solid benefits.<p>Open positions:<p>- Sr. Full-Stack Developer (<a href=\"https://jobs.lever.co/truevault/b4f76aa2-2d7b-473a-b7db-41e51427f2cc\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;truevault&#x2F;b4f76aa2-2d7b-473a-b7db-41e5...</a>)<p>- Client Library Developer (<a href=\"https://jobs.lever.co/truevault/19430c93-7827-4198-82dd-de041ff2b3b5\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;truevault&#x2F;19430c93-7827-4198-82dd-de04...</a>)<p>At TrueVault, you are encouraged to:<p>- contribute to open source projects (we have an open IP policy).<p>- have personal hack days&#x2F;weeks to work on extraordinary stuff.<p>- be curious and do the hard stuff.<p>- choose what to work on and be accountable for its success.<p>- have a good work&#x2F;life balance.<p>- build stuff users want.<p>Perks:<p>- Competitive salary and above-average equity packages.<p>- Open vacation policy. We don&#x27;t count days.<p>- Flexible work hours.<p>- Buy or build your ideal work environment.<p>- Personal wellness budget to spend on gym membership, fitness classes, etc.<p>- Health, dental, and vision benefits.<p>- Free snacks and drinks.<p>What is TrueVault?<p>TrueVault is an off-premise, secure data store that developers use to make their applications immediately secure and HIPAA compliant. TrueVault stores healthcare data from mobile health apps, wearable devices and even genomic research so that our customers don’t need to spend their precious time worrying about security, performance and scalability. More than just a database as a service, TrueVault’s proprietary technology allows us to secure our customers&#x27; data better than anyone else can (hint: think encryption and global scale slice distribution).<p>Our mission is to provide the simplest, most secure way for web apps, mobile apps and even wearable devices to store sensitive data. Simple and secure access and storage to people’s most personal and private information is a huge challenge. That&#x27;s why we are looking for incredible people (like you perhaps?) to join us.<p>Who is TrueVault?<p>TrueVault is a Y Combinator graduated startup based in SoMa San Francisco. We have an incredible group of investors including Paul Buchheit, Mark Pincus, and Bill Tai who have invested more than $3 million dollars because they deeply believe in our mission. We are a group of engineers passionate about data security, API performance and building products that developers like us love to use. We are looking for a handful of engineering MacGyvers to join our founding team.<p>Why Join TrueVault?<p>Because at TrueVault, you will have the opportunity to work in arguably the biggest market opportunity of this coming decade, improve the collection, portability and security of really critical data, and push the envelop of data portability forward. You’ll work on things that haven&#x27;t been done before. Plus you’ll get to choose what you want to work on and develop products that your peers will rely on and love using.<p>If you want to work at a place that values &quot;getting things done&quot; more than &quot;working the startup hours&quot; talk to us. If you take pride in what you do and care about the people who use the product you’ll find people just like you here. If you want to open source and share what you’ve built with the world at TrueVault you can.  But most importantly, if you want to work with other incredible minds and welcome the challenges of doing things that’ve never been done, then we want you to join us. If you are passionate about security, performance and scalability, TrueVault might be just what you’re looking for.","time":1401647525,"type":"comment"}