{"by":"lambtron","id":7830528,"parent":7829042,"text":"Rainforest QA, San Francisco, CA (but open to remote employees)<p>Additional info:\n<a href=\"https://www.rainforestqa.com/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rainforestqa.com&#x2F;jobs&#x2F;</a><p>FULL STACK ENGINEER<p>Are you an experienced web-software hacker? If you have worked on a production web site with meaningful traffic and customers, know at least 3 programming languages and are comfortable writing unit tests then we want to talk to you.<p>Are you opinionated and diplomatic? Most people are one or the other. All major decisions are made democratically, and we do code reviews on every pull request to keep quality high. You need to be able to express your opinions in as objective a manner as possible, and be able to accept and learn from constructive criticism. There&#x27;s always a better way to do something.<p>Are you working on personal projects &#x2F; your own startup? You&#x27;ll need to be a self-starter to get on at Rainforest, because we&#x27;ll give you a lot of freedom and almost no hand-holding.<p>DESIGNERS WHO CODE<p>Design is at the heart of everything we do. We fundamentally believe that great design - meaning usability, simplicity and elegance - is core to our competitive advantage, and one of the most important ways we can work toward our mission of making developers happier and more productive.<p>We are proponents of noPSD design (so much so that we wrote a blog post about our process). To that end you should at the very least be comfortable with mocking up your designs in HTML and CSS, and ideally be able to own the entire front-end process of shipping a new feature, from conception through user research, to design and build, and iterating based on usage metrics and qualitative feedback.<p>We know we&#x27;re looking for a unicorn, so if you feel like you&#x27;re an excellent front-end hacker whose design chops are a bit rusty you should still get in touch. Design is all about iteration, and we already have a great designer on our team who can help you grow as a designer.<p>DEV OPS<p>We&#x27;re looking for an exceptional DevOps engineer to join as the next member of Rainforest. We&#x27;re still a very small team, but people usually think we&#x27;re much bigger given the scale at which we operate.<p>One of the more technically complex parts of our infrastructure is managing a large stack of virtual machines. Every single test run through Rainforest is done through a newly minted VM. This means that we boot thousands of machines every single day. Given our current growth, we expect this to grow exponentially.<p>Here&#x27;s what we hope to get out of you: You&#x27;re not afraid of writing code, our stack is Ruby, so you&#x27;ll have to either know it or be ready to learn it. You need to have prior experience with a provisioning tool (Puppet, Chef, etc). You understand systems and networks thoroughly. You know things we don&#x27;t about distributed systems.<p>We&#x27;re working on super hard problems that make developers&#x27; lives easier. We are a group of friends that love what we&#x27;re working on, and believe that we&#x27;re going to change the world for people building software.<p>DATA NERD<p>We run a lot of tests here at Rainforest. We record everything that testers do to execute each test. Clicks, text entry, submission times, answers, screenshots… everything. Alongside that, we have fine-grained metrics on our testers, where they are from, what time they log into the system, how often they test with Rainforest. That&#x27;s a lot of data and we could do so much more with it.<p>We&#x27;re looking for someone to help us do that. Your role will be to use this data to improve the quality of the results we return to our customers, detect fraud, resolve disputes, generate tests automatically and many many other things.<p>We&#x27;re looking for someone with a strong background in data science, statistics and supervised learning. You&#x27;ll also need to be able to write code to productize your work. Most importantly, you should be able to own your projects and see them through to improving the lives of our customers. This role would probably be perfect for academics who want to get into a small team that moves fast and ships software every day.<p>Apply via our website! <a href=\"https://www.rainforestqa.com/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rainforestqa.com&#x2F;jobs&#x2F;</a>","time":1401654685,"type":"comment"}