{"by":"spditner","id":7831442,"parent":7829042,"text":"Iotum Inc., Los Angeles, CA - Full Time and Toronto, ON - Full Time <a href=\"http://iotum.com\" rel=\"nofollow\">http:&#x2F;&#x2F;iotum.com</a><p>We are seeking Junior and Senior Developers for full time employment who are available to commence work within the next month in our Toronto or Los Angeles office. Capability is more important than formal school training; we are willing to expand the skill set of the right candidate.<p>Our distributed development team is self managed and uses components of agile, scrum, and XP practices to build products in a fast paced, yet casual work environment.<p>You will be working closely with team leads designing and implementing features for our web and mobile based WebRTC communications suite, focusing on dynamic and responsive interfaces.<p>Hard Skills:<p><pre><code>  - Proficient in at least one scripting language such as Ruby, Python, or Javascript\n  - Knowledge and experience with object oriented design (OOP)\n  - Knowledge of best practices and principles for web applications\n  - Experience with HTML, CSS, jQuery, AngularJS\n  - Experience developing in Linux environments\n  - Mobile application development (e.g. Android, iPhone, Blackberry) an asset\n  - Knowledge of IP networking, and socket level programming an asset\n  - WebRTC, SIP, and telephony knowledge an asset\n</code></pre>\nSoft Skills:<p><pre><code>  - Must be able to work within a team and independently\n  - Excellent communication skills (written and oral)\n  - Comfortable with new, difficult, and challenging work\n  - Trustworthy\n  - Creative\n</code></pre>\nWe offer competitive wages and great benefit packages. You must be entitled to work in Canada or the United States. Only candidates that meet the above qualifications will be contacted for interview.<p>About the Company:<p>iotum is an international company with roots in VoIP, telecom switch development, and innovative voice and mobile services. Today, we provide several teleconferencing platforms and collaboration services to millions of users worldwide, and we are working on the next generation of virtual services to make it easier to collaborate and converse around the world.<p>Apply at: jobs@iotum.com, and include &#x27;Hacker News&#x27; in the subject.","time":1401672711,"type":"comment"}