{"by":"bazillion","id":7831326,"parent":7829042,"text":"The Control Group, San Diego, CA - Full Time<p>There are a ton of positions open including: Node&#x2F;PHP Developer, Devops&#x2F;Sysadmin, Front End Engineer, Graphic Designer, and other non-technical positions.  Here is the link to the job listings: <a href=\"http://www.thecontrolgroup.com/category/job-openings/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thecontrolgroup.com&#x2F;category&#x2F;job-openings&#x2F;</a><p>Here&#x27;s what the listing for Node&#x2F;PHP Developer says:<p>San Diego application developers! Are you looking for a job where you’ll feel challenged, be appreciated, and given the space you need to do your thing? We’ve cultivated a developer-friendly culture here and we intend to keep it that way. You get autonomy, and the chance to collaborate with other top-tier developers in the industry. Sound good? Keep reading.<p>Do you view programming as “your craft” and have strong opinions on the subject?\nAre you prone to raising an eyebrow when people say “Big Data” and enjoy playing with stats?\nDo you live in the cloud?\nDo you dream in data structures?\nDo you want to gain experience scaling a high traffic website to handle millions of requests each day?\nIf you answered “yes” to any of these questions, we want to hear from you.\nTo Apply, You Must Have:<p><pre><code>    *Experience with node.js\n    *Expert-level JavaScript knowledge\n    *Solid experience with PHP or Python\n    *Solid experience building scalable web applications using open source technology\n    *Knowledgeable in HTTP &#x2F; DNS &#x2F; INET protocols\n    *Strong understanding of web standards-based HTML5 &#x2F; CSS3 &#x2F; AJAX coding.\n    *Confident in a Linux environment using bash and vi&#x2F;emacs\n    *Use a design pattern when you can and write reusable code\n    *Have used MVC (Zend FW &#x2F; Codeigniter)\n    *Use Distributed Version Control\n    *Familiar with functional programming languages\n   </code></pre>\nWe Would Be Stoked if You Also Had:<p><pre><code>    *Experience with Redis\n    *Experience with Nginx\n    *Experience with Internet marketing and split testing\n    *Knowledge of eCommerce, SEO, and affiliate marketing\n    *Experience with Elastic Search, Lucene, Solr, or Hadoop\n</code></pre>\nFreelancers! Please Note: This is a full-time, onsite position. Sorry, you can’t work from home in your PJs.<p>In exchange for showing up to work and being awesome every day, you’ll get tons of perks like:<p><pre><code>    *PTO\n    *A generous compensation package plus 401(k) plan after one year\n    *All the Red Bull and coffee you can drink (which leads us to our next perk)\n    *Health care for when your body rebels against all the Red Bull (including dental)\n    *Freshly squeezed veggie juice every day\n    *Snacks galore\n    *Early bird breakfast on Fridays\n    *You have access to Xbox, Call of Duty, Halo, and free throw basketball machines\n    *Working in a state-of-the-art office right on the beach, or in the heart of Little Italy\n    *(Most importantly) Awesome friends and coworkers\n</code></pre>\n------------------------------------------------------<p>I work in the Pacific Beach office which is literally right on the beach -- it makes for really awesome lunch times being able to walk the boardwalk and try a bunch of different places.  There&#x27;s even a rack at our entrance to put your surfboard!<p>You could talk to me if you&#x27;re interested (justin.mealey@thecontrolgroup.com), or you can apply through our website.","time":1401670053,"type":"comment"}