{"by":"maramartin","id":7834985,"parent":7829042,"text":"Redwood City, CA - FULL TIME - ON SITE<p>We’re looking for a Data Infrastructure Engineer to join as our first engineering hire.<p>You’ll design, implement and debug our backend, which processes data coming from mobile applications through a forecasting engine, which will then send the forecasted data to the front end. You’ll also develop back end systems for user-focused features stemming from data gathered from a variety of data sources.<p>Our product is driven by data, and we measure every part of the product and user experience through analytics and user surveys to deliver the best experience possible. Our current stack is Java and Scala on the backend, front end in Angular.js and we’re hosted on AWS.<p>Here are some specific things you&#x27;ll own: \n• You’ll design, implement and debug scalable Big Data backend systems that provide analytics on the front end. \n• You’ll design and develop analytics systems within a service oriented architecture, and systems for big data processing. \n• You’ll use storage and interchange technologies like MySQL, Hadoop, HBase and Presto within a heterogeneous Big Data ecosystem.<p>Our Ideal Candidate: \nOur ideal candidate has created data analytics systems for sales forecasting or demand forecasting using frameworks and technologies like Presto, Spark, Hive, and Hadoop from scratch.<p>Here are a few other things we’d be thrilled to see in a strong candidate: \n• You have 5+ years of experience developing high traffic web applications in Java, and can demonstrate knowledge of functional programming languages like Scala or Golang \n• You have a BS, MS or PhD in Computer Science, or equivalent work experience and can share open source contributions \n• You have experience developing and scaling a data analytics infrastructure, ETL, or data warehousing for a software company \n• You’re an early adopter of new technologies. You were exploring Hadoop and Hive in 2008, Spark in 2011, and Presto in 2013.<p>What&#x27;s in it for you? We thought you might ask... here&#x27;s some of what we offer: \n• Competitive salary \n• Meaningful, first engineering hire Equity \n• Full benefits (medical, dental, vision)<p>Apply via link: <a href=\"http://www.thesourcery.com/jobs/705\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;705</a>","time":1401733807,"type":"comment"}