{"by":"maramartin","id":7835119,"parent":7829042,"text":"San Francisco, CA OR Pittsburgh, PA OR Telecommute - Full Time<p>Stitch Fix is the first ecommerce brand to blend proprietary technology, unique product and human-powered design to deliver a shopping experience that is truly personalized for our clients.<p>Founded in 2011, we&#x27;ve grown from word-of-mouth and our leadership team includes former execs and engineers from Netflix, Polyvore, OPower, Baseline Ventures, and Uniqlo, among other leaders in the data and retailing fields.<p>We&#x27;re building a Full Stack Startup to solve major challenges in ecommerce, apparel, merchandising, client experience, personal styling, inventory management and logistics, and we&#x27;re set to double our engineering team of 9 in the next year.<p>If you want to come build new products and solve interesting problems with a great group of people, we&#x27;re looking for more excited and talented individuals to join us.<p>More about our engineering team: \nWe&#x27;re working in a post-Agile process and are developing a distributed architecture of Rails applications (no monorails here) that not only help our clients, but also improve everything we do at Stitch Fix.<p>Our engineering and data science team is small, senior, and autonomous with no QA, product managers or project managers. We work with direct access to our clients and business data, and we communicate openly and transparently with the executive team.<p>We&#x27;re working from San Francisco, Pittsburgh and remotely and we rely on collaborative communication and dev tools like GitHub, HipChat, Google Hangouts and Heroku to get it all done.<p>The Role: \nWe&#x27;re looking for a Sr. Full Stack Engineer to join our team. We&#x27;re building a new kind of enterprise, service-oriented set of applications that&#x27;s powering one of the most innovative ecommerce platforms ever.<p>Here are some things we&#x27;re working on: \n* Advanced learning algorithms to aid our awesome styling team \n* Multiple-application architecture running in the cloud \n* Custom warehouse and inventory systems for a very unique business model \n* Responsive web interfaces to drive both the customer experience and our internal tools \n* Building prediction models for a smart and successful future<p>We build through open communication, collaboration, prototyping and testing. We work mostly in Rails with some Python. We love HipChat and Google Hangouts. We use new continuous integration tools like Tddium to deploy to Heroku.<p>Our Ideal Candidate: \nIs someone who&#x27;s developed a couple solid Rails and other MVC-framework web applications as part of a collaborative team.<p>We&#x27;re especially looking for lead engineers who can demonstrate aptitude in the following skills: \n* Real tech fluency: You can build anything with anything, and you probably have 5+ years of software development experience with a couple of those years working in Ruby on Rails. \n* Communication skills: You aren&#x27;t just great at listening, speaking and writing. You are able to convey complex ideas and information regardless of the medium or situation. \n* Product-Centric Thinking: You come from a tech background but you have opinions about how the product you&#x27;re building should work. You dig deep and work with customers, the company and our executive team to uncover the ideal way to leverage technology to solve problems. \n* Self-Directed: Once you&#x27;ve got something, we don&#x27;t have to worry about it. You have a bias toward action. Our team doesn&#x27;t have QA, project managers or product managers so we take ownership of what we build. \n* Passion: You love what you do and can share side projects or open source contributions with a GitHub repository, personal project page or blog. \n* Just Generally Awesome: You take your work seriously but not yourself. You show everyone respect regardless of the circumstance. Extra points if we think you&#x27;re funny or if you&#x27;re already a Stitch Fix superfan!<p>Bonus Points For: \n* Experience working collaboratively as a team. We use GitHub, Heroku and HipChat to get stuff done. We&#x27;re agnostic about what you&#x27;ve used (and no judging if you&#x27;re more into BitBucket) and are more interested in the process you like to use. \n* Experience working with testing and continuous integration. We&#x27;re working with the usual Ruby gems like Rspec, Capybara and others for unit and feature tests, Tddium for CI and RabbitMQ for asynchronous messaging. \n* Experience using pull requests to create rapid prototypes and new features. If we like what you make (and if you like what we&#x27;re making), we agree to merge it to production! \n* Unique ways to automate and get things done. For example, if you&#x27;ve created a Ruby gem to complete a task in your projects, tell us about it! :)<p>We knew you&#x27;d ask eventually, so here&#x27;s what we&#x27;re offering: \n* Competitive salaries and generous equity. \n* A business that trusts and embraces tech. We know, a style brand? But it&#x27;s totally true. \n* Want to move to San Francisco or Pittsburgh? Stitch Fix has your relocation expenses covered. \n* A senior team that does things right. \n* A startup with a proven business model that&#x27;s growing fast. \n* Use your preference of tools and hardware. \n* A comprehensive health insurance plan, including full dental and vision coverage. \n* Fully stocked pantry with your choice of snacks and drinks. \n* Sunny office in downtown San Francisco and also in downtown Pittsburgh (or you can come visit our SF office once every 2 months if you prefer to work remotely)<p>How To Apply\n* To apply, click the link: <a href=\"http://www.thesourcery.com/jobs/724\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;724</a>","time":1401735206,"type":"comment"}