{"by":"maramartin","id":7836369,"parent":7829042,"text":"REDWOOD CITY, CA - FULL TIME - ON SITE - SR. SOFTWARE ENGINEER<p>Course Hero is creating a platform where students and experts can share and access great academic content they need to succeed at any time, from anywhere. Today, millions of students take advantage of our educational resources including study guides, flashcards and tutors.<p>We believe that improved access to knowledge enriches lives and increases future opportunities. Technology is revolutionizing the way we learn, and we’re committed to providing individualized support to students everywhere to help them expand their academic knowledge and professional skills.<p>Our company culture is very open, flat, and transparent. We succeed and learn together. We’ve tried hard to make this a pleasant and inspiring place to do creative work and it’s been working since we started out in 2008. \nMost importantly, we seek to hire individuals whose personality, integrity and passion for our business make our team better as a whole. We’re growing fast, profitable (yes, it’s true for 4 years and counting!), and looking for new team members to push us toward the future.<p>Check out these videos to learn more about our engineering culture, and our company mission.<p>The Role:<p>Course Hero is looking for a Sr. Software engineer who can hit the ground running. Our engineering team releases code every day to millions of people, so we&#x27;re looking for someone who can take on challenges, build new features, and iterate quickly.<p>Each engineer has a role in building Course Hero&#x27;s architecture and will have the opportunity to touch all parts of the stack. Our projects are big ­­ terabytes of data and customers around the world ­­ but our team is small, so you’ll see projects from start to finish, and work closely with product managers and designers to ensure successful results.<p>Some of the challenges you&#x27;ll help us tackle include:<p>* Helping us expand our core applications architecture (Study Guides, Flashcards, Tutors) into MVC frameworks like Zend or Symfony. \n* Taking us global as we scale our site from 10x to 100x as many students who can access our resources for any course, anywhere, at any time. \n* Lead new product development as we add native mobile applications for iOS and Android.<p>Our Ideal Candidate Has:<p>* 3+ years of professional software engineering experience where you’ve worked with modern languages and MVC frameworks like PHP, Ruby, Python or Node.js. \n* A degree in Computer Science or STEM field, or related work experience working with data structures and algorithms. \n* Experience working with SQL databases like MySQL or PostgreSQL. \n* Experience working within a SCRUM or Agile team, where you practiced TDD. \n* Appreciation for statistical analysis and the power of data-driven decisions. \n* Ability to formulate articulate opinions on product design and engineering issues with a focus in finding the most effective solution. \n* A deep sense of product ownership.<p>Nice-To-Have&#x27;s Include:<p>* Front end development or design experience with jQuery, Angular.js, JavaScript, Sass or Susy. \n* Mobile development experience professionally or in side projects. \n* Side projects where you’ve learned to apply new technologies, frameworks or programming languages. \n* Familiarity using or developing a document categorization system (i.e. Naïve Bayes classifier, Latent Semantic Indexing)<p>What we can offer you:<p>* Industry competitive salary and stock options. \n* Full medical coverage (medical, dental, vision). \n* 401(k) program to help you save for the future \n* Regularly planned team events and outings. \n* Free Friday lunches and an endless snack and drink supply \n* On-site amenities including a day spa, full-service cafeteria, 3 miles of nature walks along the Bay and free membership to a 7500 sq. ft. fitness center.<p>Apply via link: <a href=\"http://www.thesourcery.com/jobs/734\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;734</a>","time":1401743042,"type":"comment"}