{"by":"maramartin","id":7836488,"parent":7829042,"text":"REDWOOD CITY, CA - FULL TIME - ON SITE - SOFTWARE ENGINEER<p>Apply here: <a href=\"http://www.thesourcery.com/jobs/735\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;735</a><p>Course Hero is looking for a software engineer who can hit the ground running. Our engineering team releases code every day to millions of people, so we&#x27;re looking for someone who can take on challenges, build new features, and iterate quickly. \nEach engineer has a role in building Course Hero&#x27;s architecture and will have the opportunity to touch all parts of the stack. Our projects are big ­­ terabytes of data and customers around the world ­­ but our team is small, so you’ll see projects from start to finish, and work closely with senior engineers, product managers and designers to ensure successful results.<p>Some of the challenges you&#x27;ll help us tackle include:<p>* Helping us expand our core applications architecture (Study Guides, Flashcards, Tutors) using MVC frameworks like Zend or Symfony. \n* Taking us global as we scale our site from 10x to 100x as many students who can access our resources for any course, anywhere, at any time. \n* Learning new product development as we add native mobile applications for iOS and Android. \n* You’ll work with our engineering, product and design teams to build new features, tools and functionality with PHP, JavaScript, MySQL and other fun tools in our stack. \n* You’ll learn more about TDD and SCRUM practices as part of a small, collaborative team.<p>Our Ideal Candidate Has:<p>* Some academic, project or 1-2 years of work experience where you’ve worked with modern languages and MVC frameworks like PHP, Ruby, Python or Node.js. \n* A degree in Computer Science or STEM field, and interest in side projects you can share through a project website or GitHub repository. \n* Experience working with SQL databases like MySQL or PostgreSQL. \n* Academic or work experience in data structures and algorithms<p>Nice-To-Have&#x27;s Include:<p>* Front end development or design experience with jQuery, Angular.js, JavaScript, Sass or Susy. \n* Mobile development experience. \n* Experience or familiarity with continuous integration or TDD.<p>What we can offer you:<p>* Industry competitive salary and stock options. \n* Full medical coverage (medical, dental, vision). \n* 401(k) program to help you save for the future \n* Regularly planned team events and outings. \n* Free Friday lunches and an endless snack and drink supply \n* On-site amenities including a day spa, full-service cafeteria, 3 miles of nature walks along the Bay and free membership to a 7500 sq. ft. fitness center.","time":1401743985,"type":"comment"}