{"by":"saool","id":7836581,"kids":[7842425],"parent":7829042,"text":"Thinkful – New York, NY – EdTech – Several roles<p>Founded in 2012 in New York City, Thinkful is on a mission to reinvent education. We are building a school that trains the workforce in the technology skills necessary to sustain innovation and growth in the economy. We are developing a method of online learning that emphasizes practical, sustainable skills and prepares students to achieve their career goals.<p>The company will be growing from 13 people to 40 this year and we are hiring for a variety of roles:<p>* Course Developer — <a href=\"http://goo.gl/8TURBl\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;8TURBl</a><p>* Student Support — <a href=\"http://goo.gl/CaICO8\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;CaICO8</a><p>* iOS Course Writer (contract) — <a href=\"http://goo.gl/Liz9tm\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;Liz9tm</a><p>* Head of Content Strategy — <a href=\"http://goo.gl/oejC4Z\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;oejC4Z</a><p>* Inbound Sales Specialist — <a href=\"http://goo.gl/dZdbdD\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;dZdbdD</a><p>* Paid Acquisition Manager — <a href=\"http://goo.gl/PEVv19\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;PEVv19</a><p>* Talent and Ops Manager — <a href=\"http://goo.gl/96lMJW\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;96lMJW</a><p>and...<p>* Engineers!!!!!!!!!11111ELEVEN — <a href=\"http://goo.gl/uXfqfR\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;uXfqfR</a><p>We are looking for experienced engineers with a passion for education that want to join us and help shape the way people learn online.<p>Our stack is mainly Python, Postgres, Redis, AngularJS and a bunch of other tools. But you don&#x27;t need to be master of them all: we are looking to hire talented people with interesting experiences and backgrounds, rather than for a particular skill &#x2F; technology (as long as there is willingness to learn!). Fear, surprise, ruthless efficiency, an almost fanatical devotion to Vim (or Sublime, in extremis) and nice red uniforms will definitely be considered a plus.<p>The company was founded by Dan Friedman—one of the Thiel Fellows—and Darrell Silver, founder of Perpetually (acquired by Dell), our CEO and technical co-founder. The culture is balanced: analytical but fun, serious but sane. You&#x27;ll be joining a small, agile team with big challenges ahead of us.<p>If you are interested, apply through the website (<a href=\"http://goo.gl/uXfqfR\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;uXfqfR</a>) or email darrell+hn@thinkful.com to hear more.","time":1401744799,"type":"comment"}