{"by":"imethan","id":7842128,"parent":7829042,"text":"Voltaiq - SF, NYC, or REMOTE - Full Time - <a href=\"http://voltaiq.io\" rel=\"nofollow\">http:&#x2F;&#x2F;voltaiq.io</a><p>Software Developers — Full Stack&#x2F;Backend&#x2F;Deployment<p>Battery performance is the key bottleneck slowing the adoption of electric-vehicles, renewable energy, and longer lasting more powerful mobile electronics.<p>Voltaiq is developing a powerful web-based data analytics and visualization platform to enable better, longer-lasting batteries and other energy devices. We have early customer revenue, and grant funding from the National Science Foundation and U.S. Department of Energy.<p>Voltaiq is looking for creative, experienced, and extremely talented software developers to join our team in the San Francisco Bay Area or New York City (remote will be considered for more senior applicants). We’re looking to fill out our initial team with someone who has full-stack backend experience both shipping features and managing multiple-server deployments.<p>We are looking to fill a position immediately, and will give preference to those with a broad knowledge base and a strong desire to learn.<p>Desired Tech Skills:<p>* Strong coding skills in one or more of the following: Python, Java, C&#x2F;C++, Go.<p>* Solid understanding of a web deployment stack: Cookies, sessions, websockets, asset management.<p>* Experience with ZeroMQ or a similar asynchronous messaging system.<p>* Strong command of Linux and deployments on Amazon Web Services.<p>* Deployment experience: Salt Stack (big plus!), Ansible, Chef, Puppet, Fabric, Nginx, uWSGI.<p>* Knowledge of Git and experience committing to a team code repository.<p>* Experience with SQL and NoSQL databases.<p>Other Prerequisites:<p>* Undergraduate or advanced degree in Computer Science, Physics, Math, Engineering, or a related discipline.<p>* At least 3 years of experience developing and shipping software.<p>* Willingness to travel occasionally for in-person meetings, conferences, and deployments.<p>* Strong team player with the ability to help build and work as a cohesive team.<p>Compensation: Competitive salary plus equity and full benefits.<p>Location(s): SF Bay Area, NYC, or remote.<p>Email us a resume at jobs@voltaiq.io<p>Thanks HN!","time":1401822278,"type":"comment"}