{"by":"jules27","id":7848962,"parent":7829042,"text":"Deliv (<a href=\"https://deliv.co\" rel=\"nofollow\">https:&#x2F;&#x2F;deliv.co</a>) | full time | Menlo Park, CA<p>Software Engineer, Full Stack, H1B welcome<p>Deliv is a crowdsourced, same day delivery service that extends the reach of national retailers and helps them enhance their customer experience by giving customers the choice to receive their items whenever and wherever they want. Deliv allows retailers to offer their customers a same day delivery option as they shop from their website, mobile app or from their physical brick and mortar store. By simply adding the Deliv same day delivery option into their existing checkout process, the retailer preserves the customer shopping experience, fulfills orders from inventory from their local brick and mortar stores all while maintaining ownership and data from each customer transaction.<p>Deliv has partnered with many national and regional retailers, as well as the nation&#x27;s four largest mall operators, who manage nearly 800 malls across the country.<p>We’re a team of passionate startup veterans, backed by top-tier venture firms, and we’re looking for our next engineer.<p>Who you should be:<p>* Ready to shake things up in a stodgy old industry, leveraging some damned cool technology.<p>* A true full stack engineer. You enjoy working all over the codebase, and while you may not be the best or fastest at &quot;x&quot;, you’re never afraid to dig in and try.<p>* A passion for e-commerce, crowd-sourcing, and&#x2F;or RESTful APIs.<p>* A team player. We’ve all got a million things to do, but you’re happy to chip in wherever you can to help your teammates out when they’re underwater.<p>* Someone that can roll with it. As a fast moving startup, things get shuffled, priorities change. You should be cool with that.<p>* Someone that recognizes the art of engineering. We like writing tests, CI, and love code quality metrics. Code reviews are awesome, and you’re always looking forward to learning something new.<p>* Someone who’s comfortable working quickly, with lots of iterations, and shipping often.<p>Requirements:<p>* Experience with modern MVC web frameworks. We’re Rails, but if you’ve used Django, Cake or Zend, you’ll be fine.<p>* Comfortable working in scripting languages (Ruby, Python, PHP).<p>* Experience with REST APIs.<p>* Familiar with the git workflow.<p>* Ability to work independently, set realistic deadlines, and hit those deadlines.<p>Please email eng@deliv.co for questions, applications, or just say hi.","time":1401922497,"type":"comment"}