{"by":"apaprocki","id":5637739,"parent":5637663,"text":"New York / London - Bloomberg<p><a href=\"http://jobs.bloomberg.com/\" rel=\"nofollow\">http://jobs.bloomberg.com/</a> <a href=\"http://www.bloomberg.com/ux\" rel=\"nofollow\">http://www.bloomberg.com/ux</a><p>There are many jobs open at Bloomberg, but I'm particularly looking for intelligent software engineers and UX professionals to work under the CTO and Infrastructure team in R&#38;D. We have roughly 4,000 R&#38;D employees, so work is very diverse across the company. Teams are roughly 4-8 people at the lowest level and group up into larger organizations organized by product type (equities, fixed income, etc.). I happen to work on infrastructure for the Professional service (aka Terminal). Our team has very little interaction with anything finance related and most of our work is related to evolving the entire platform forward and making forward-looking changes. Back in 2005, we converted all of our higher-level \"app\" development to server-side JS (custom, Spidermonkey based) and now run probably the largest server-side JS stack in the world (~20MM LOC). We migrated a lot of our GUI toolkit to be scripted as well (LUA this time) to allow us to more easily evolve it. And now we're evolving it, embedding WebKit and pushing bugfixes and feature enhancements to do what we need (our fork is on GH). We're helping define and implement CSS3 Grid spec and help implement ES6 generators among other things. We built and run a third-party app store within the Terminal. Over the past decade we've rebuilt the C++ foundation of the company from the ground up, starting with our own STL implementation using the Lakos allocator model (Lakos and a few other C++ committee members work here). We have a huge wealth of awesome C++ libraries that we started open-sourcing and will continue to add more layers as time goes by.<p>All of what I mentioned above is stuff done by the infrastructure team, and we're a tiny percentage of the overall R&#38;D population. Other teams get to do fun stuff as well. The mortgage team ported long-running ABS OAS calculations from Linux farms to GPU clusters and wrote a Python based cash flow engine from the ground up, potentially helping define the SEC's Python-files-must-be-included rules.<p>We run a worldwide network with somewhere around 35,000 circuits in 180+ countries. We ingest anywhere from 45-60 billion \"ticks\" daily aggregate from feeds in all of these countries. We normalize, scrub, and then re-distribute all this data to customers in all of those countries in an efficient manner. The Terminal provides analytic and visualization tools to work with market data, as well as the same tools to work with news and alerts. On the news side, we ingest over 80,000 news feeds (e.g. WSJ would be one \"feed\") from around the world and do the same kind of processing, applying ML for sentiment and topic classification, etc. We also design our own hardware in-house -- everything from keyboards and monitors, to custom ASICs for authentication/subscription tokens and PCIe hardware security modules for our certificate infrastructure. The web side (bloomberg.com, businessweek.com, BGOV, BLAW, Black, etc) uses mostly Rails stacks and everything you would expect to find in a web shop.<p>Oh, and we have a TV station, radio station, etc. They innovate too. Bloomberg TV is the first non-OTA channel to be distributed via Aereo, for instance :)<p>We could use a motto like \"We do a lot of stuff.\"<p>Contact me if you want to discuss at andrew@ishiboo.com. If you want to chat in person, we are a sustaining sponsor of NYTM and are at all the meetups. and we'll have a few people at JSConf in May.","time":1367415112,"type":"comment"}