{"by":"gokult","id":5638466,"kids":[5638525,5639630],"parent":5637663,"text":"Apple - Cupertino, CA<p>We're looking for backend server engineers who really understand distributed systems to be a part of iCloud. Apple keeps small teams that have large responsibilities. If you love owning big pieces, and love distributed systems, you'll really love it here. Everyone here is really passionate about our work, and we hope it shows in the product.<p>There are a lot of openings across iCloud you can search for in jobs.apple.com. I'm specifically looking for engineers to join our Messaging Services team (<a href=\"https://jobs.apple.com/us/search?#&#38;ss=25546086&#38;t=0&#38;so=&#38;lo=0*USA&#38;pN=0&#38;openJobId=25546086\" rel=\"nofollow\">https://jobs.apple.com/us/search?#&#38;ss=25546086&#38;t=0&#...</a>).<p>Here are some highlights:<p>Scale<p><pre><code>    - Hundreds of millions of active users using some of the most desirable devices on the planet\n    - 2bn+ iMesssages/day, 4 trillion push notifications sent\n        - http://thenextweb.com/apple/2013/01/23/apples-icloud-now-has-250m-icloud-users-imessage-users-send-2b-messages-a-day/\n        - http://www.theverge.com/2013/1/23/3908330/apple-q1-2013-earnings\n    - Super high throughput, ultra-low latency network services\n    - Write code deploys in thousands of machines, datacenters around the world\n</code></pre>\nProducts<p><pre><code>    - iMessage, FaceTime, Apple Push Notifications, and exciting new projects\n    - Define future of the industry with services for Apple's current and future hardware\n</code></pre>\nTech<p><pre><code>    - Best of breed modern open source systems\n    - High performance asynchronous I/O\n    - Distributed algorithms and highly parallel systems\n</code></pre>\nSounds interesting? Email me your resume - gthirumalai at apple, and please prefix your subject with \"HN:\".<p>If there are other openings on iCloud that interest you, please apply through jobs.apple.com and mention Hacker News when applying!","time":1367421707,"type":"comment"}