{"by":"Ovid","id":5638647,"kids":[5639493],"parent":5637663,"text":"Amsterdam, Netherlands. Work permit and relocation assistance provided.<p>Hiring for two different companies, both of whom will pay your relocation.<p>Company 1:<p>Looking for UX designers, front-end and back-end developers.\nUX designer: use Photoshop, Gimp, or whatever makes your socks roll up and down and you know how to make Web and/or mobile applications work for customers. Knowledge of HTML, JavaScript and CSS also needed.<p>Front-end developer: you can make Web sites do exactly what you want them to do, regardless of the browser or operating system the web site is running on. Knowledge of HTML, JavaScript and CSS required.<p>Back-end developers: you know what it takes to power the back-end of large web sites. You understand scalability issues and can explain the difference between an inner and outer join. You know what O(log N) is and why it's important. Your programming language history isn't important because you're good enough to learn a new language if needed.<p>All positions: not looking for rock stars. Looking for competent technical talent who are willing to move to Europe (unless you're already here). We have many expats working here and we'll even help pay for Dutch lessons, if you want them.<p>We also like people who understand business because you'll be expected to make many of your own decisions without having to ask permission from management for every little thing that you do. You will have the power to get stuff done, work with a great bunch of people and be able to spend your five weeks of vacation time cruising across Europe and discovering why Amsterdam is such a beautiful city.<p>Company 2:<p>Unlike Company 1, Company 2 <i>is</i> looking for rock stars to bring to Amsterdam. They want front-end devs and system engineers. They want you to have at least a bachelor's degree in IT or a related field and you have to have a fairly impressive resume/CV (in terms of work, open source or educational background (preferably all three)) to even get an interview. In return, they offer a very agile environment, hard tasks, in a stable, long-term company. Large company, but each team gets a room with only a few people (no open-plan distractions). Management gets out of your way and meetings are discouraged. There's a heavy focus on constant performance optimization of systems because no one like a slow system. Multiple programming languages are used with the language being chosen to fit the problem and not the other way around.<p>Front-end devs: mostly PHP with Smarty and Propel, though other languages, such as Java,  and Python are used. You will be working on desktop, tablet and mobile applications and know Javascript and CSS fluently. This means more than just jQuery! Mobile experience is helpful, as it UX work.<p>System Engineers: you will be responsible for thousands of Linux servers across several data centers. Company 2 serves a quarter of a billion page views a day and heavy use of the latest open-source technologies is encouraged in their quest for better and better performance. Nginx, Puppet, stackless Python and MySQL are just a few of the technologies involved. The engineers are heavily involved in open source and are encouraged to give back to the community. You have deep experience in Linux, preferably multiple distributions, you know bash and at least one scripting language. You have strong experience with a variety of open source monitoring and scalability technologies.<p>To apply for any of these, send an email to jobs at allaroundtheworld.fr and refer to this post.","time":1367423251,"type":"comment"}