{"by":"vivekpreddy","id":5638358,"parent":5637663,"text":"Sick of the recruiting industry? Want to make it better and help great companies continue to grow?<p>Here at Entelo we believe that a primary barrier to growth for most companies is the difficulty associated with discovering and assessing talent. Entelo helps make proactive recruiting more efficient and effective and is currently helping fast-growth companies like Square, Yelp, and Box grow their teams.<p>We're looking for motivated engineers, salesmen (or women!), and marketers that are passionate about seeing the recruiting industry evolve.<p>For Engineers:<p>-Our current stack includes Ruby, Rails, Scala, MySQL, MongoDB, Resque, and elasticsearch and other big data technologies.<p>-We're also contributing to open source as much as we can (e.g. <a href=\"https://github.com/gip/resque-telework\" rel=\"nofollow\">https://github.com/gip/resque-telework</a>) and eventually plan to have open source contributions that don't start with \"tele\". :)<p>-In addition to Github we're using Asana internally to manage projects and we operate in a very flexible way.<p>-We provide competitive compensation, generous benefits, a beautiful office working environment in the Mission (SF) and catered lunches. We're backed by Battery Ventures and Menlo Ventures.<p>For Sales we're looking for people with:<p>-Experience selling to enterprise customers, particularly SMBs<p>-Evidence of outstanding performance (e.g. exceeding quotas, sales awards)<p>-Prior experience with recruiting or selling to recruiters<p>For Marketing we're looking for people with:<p>-Experience creating wonderful, educational content for business professionals<p>-A proven track record of scaling various marketing channels and analyzing ROI on marketing spend<p>-Ability to implement an maintain an analytical marketing framework that expands and improves conversion at each stage of the funnel<p>If you're interested in learning more, you can check out our jobs page (entelo.com/jobs) or please send us an email directly at jobs@entelo.com","time":1367420656,"type":"comment"}