{"by":"saetaes","id":5638719,"parent":5637663,"text":"San Mateo, CA - Media Service Performance Engineering<p>Akamai (<a href=\"http://www.akamai.com\" rel=\"nofollow\">http://www.akamai.com</a>) has a number of open positions around the globe, but we're specifically looking for talented engineers to join our Media Service Performance team.  A brief description is below, but I've worked in the Service Performance group for a number of years and can try to answer any questions you may have about what we do.  Reach out to me via my personal email address in my HN profile.<p>Overview:\nMedia Performance is the Akamai group with end-to-end responsibility for ensuring that our Media services are performing well. A well-performing service, in addition to being fast and available, also needs to be robust and well-operated. Media Performance team members need to have very strong communication skills to enable them to work across all areas of the company (especially engineering, operations, networking, and technical services).<p>Responsibilities:\n* Collect and analyze data from a network serving 10s of millions of hits per second to discern trends and anomalies.\n* Work in a distributed network / content delivery environment on Linux and Windows, applying advanced skills in network diagnostics and debugging tools, and the related network protocols and implementations, routing protocols, and application level protocols to measure, analyze, characterize and improve performance, robustness, availability and scalability of large distributed content delivery systems.\n* Identify and implement new approaches to improving performance and reliability, including scoping, designing, and implementing software features for new and existing software systems, from kernel changes to distributed server applications.\n* Prototype substantial system modifications to serve as proofs of concept for large system development initiatives.\n* Work in and with teams across all technical areas in the Company including engineering, customer care and professional services to enable innovative new solutions in both live and test network for complex issues that span multiple technologies and services often to meet specific customer needs.","time":1367423816,"type":"comment"}