{"by":"wahnfrieden","id":5638973,"parent":5637663,"text":"Canvas Networks - New York, NY - Fulltime, On-site or remote<p>Canvas Networks is looking for an iOS Engineer to join a small, close-knit team building DrawQuest — iPad's premier drawing community. We're venture funded and backed by an incredible group of investors, who include Union Square Ventures, Andreessen Horowitz, Lerer Ventures, SV Angel, Founder Collective, Joshua Schachter, and Chris Dixon.<p>We're investing in mobile and tablet in a big way and are looking for someone to join our iOS engineering efforts. We're a young company with a brand new product, so this is a good opportunity to grow with us as we grow as a company, and a great time to join and make an impact.<p>We're tackling some interesting product and engineering challenges. To help us iterate and sustain momentum, we practice continuous deployment to the extent possible, which demands technical creativity with native Objective-C / Cocoa apps. On our backend servers, we ship upwards of twenty times a day — iOS development makes things more complex but it's an area we're interested in improving.<p>We ask a lot of our developers, but we offer a lot in exchange:<p>* Perks and benefits. Free lunch, an office arcade (3 cabinets!), competitive equity and salary with full benefits (health, dental, vision), take-what-you-need vacation.<p>* A great working environment, including whatever tools you need. Big monitors, the hardware setup you want. Sit-stand desks if you're into that kind of thing.<p>* A voice in product development. Decisions aren't made in a vacuum. Be a key player in building an amazing product.<p>* Transparency into the business. We review financials as a team monthly. Meetings aren't held behind closed doors.<p>Our office is in Union Square, Manhattan. If you don't live in New York City, we'll fix that.<p><a href=\"http://drawquest.com/\" rel=\"nofollow\">http://drawquest.com/</a><p>Shoot us an email with your resume and portfolio to jobs@canv.as","time":1367425915,"type":"comment"}