{"by":"dkadams","id":5638511,"parent":5637663,"text":"Baxter Planning Systems - <a href=\"http://www.bybaxter.com/careers/\" rel=\"nofollow\">http://www.bybaxter.com/careers/</a> - Austin, TX - FULLTIME LOCAL<p>Have you ever wondered where parts originate to repair your air conditioner, the ATM at your bank, or the MRI machine in your local hospital? To reduce downtime, companies depend on a global supply chain of warehouses, delivery services, and manufacturers to supply the service parts to maintain the infrastructure of the modern world. Baxter Planning Systems is seeking outstanding Java Developers to optimize and automate every facet of this service parts supply chain.<p>Baxter Planning Systems offers a unique environment combining the flexibility of a startup with the stability of an established company. Our developers are involved in the entire product lifecycle, from problem description to design and execution. 20 years of established business with numerous satisfied customers provides ongoing revenue that isolates us from the anxiety of funding cycles or the constant search for the next big deal.<p>Working closely with on-staff domain experts, our developers have the opportunity to learn about the complexities of global supply chain management, and offer their own solutions to the challenges it presents. Challenges like planning optimal stocking levels for tens of thousands of parts distributed across thousands of locations worldwide, combined with complex interdependencies due to substitutability, regulatory issues, and the need to minimize both downtime and cost.<p>The ideal candidate for Baxter is a smart developer who gets things done by applying technology, especially open source, to meet our goals while maintaining a healthy work-life balance. The development and QA teams work closely with key stakeholders to formulate and manage development timelines that are both realistic and produce high-quality application features. You won't have to start from scratch either: we have a great infrastructure of automated unit/integration/regression/UI tests, automated builds, virtualized test environments, and a solid technology stack. But we recognize there's always room for improvement and welcome the experience and expertise you'd bring in improving our development practices, tools, and execution.<p>Regretfully at this time we are unable to accommodate 3rd party placement agencies, H-1B sponsorships,  long-term telecommuting, or relocation. Please submit your resume and salary requirements to devjobs@bybaxter.com.","time":1367422123,"type":"comment"}