{"by":"JackHerrick","id":5638821,"kids":[5638969],"parent":5637663,"text":"wikiHow (<a href=\"http://www.wikihow.com/wikiHow:Jobs\" rel=\"nofollow\">http://www.wikihow.com/wikiHow:Jobs</a>) - Palo Alto<p>We're \"Wikipedia for how-to\". We have over 40 million monthly users, but only 5 engineers.  That's 8 million users per engineer!<p>==Our vision==\nImagine a world where anyone can easily learn how to do anything. A world where access to comprehensive step-by-step instructions in multiple languages enables billions of people to improve their lives, in both ordinary and extraordinary ways. That’s the world we want to create.<p>==Where==\nwikiHow is located in a homey office in downtown Palo Alto, California, three blocks from the Palo Alto Caltrain Station. We also have satellite offices in Portland, Oregon and Seattle, Washington.<p>==Why we’re different==\n* We take wikiHow's educational mission seriously. We put our mission above short-term business goals.\n* We pay well. You get the joys of a nonprofit mission with a competitive for-profit salary and benefits package. \n* We have a huge number of users, but a very small team. Your work will make an immediate, noticeable impact on millions of people. \n* We all work from home one day a week.\n* We don't think working long startup hours is productive or healthy. We work hard and productively, then go enjoy rich lives outside of work. \n* Our small, cohesive team is gender balanced: 50% female, 50% male.\n* We’re often wrong (and that’s OK).  Making mistakes shows that we are innovating. We love to innovate.   \n* We like walking. We even have a few treadmill desks.\n* We love coming to work every day. Working with intelligent people to accomplish something globally ambitious is intrinsically satisfying. \n* We like to share. We develop open source software and Creative Commons licensed content.  \n* With over 40 million readers a month, wikiHow is one of the top 200 sites on the web. Even your mom will use and love our product.\n* We are profitable and growing. \n* We are self-funded. We refuse VC money on a regular basis. Investors don’t make our decisions, we do. \n* We are better in person than on TV:  <a href=\"http://www.youtube.com/watch?v=gYdfGsYyALI\" rel=\"nofollow\">http://www.youtube.com/watch?v=gYdfGsYyALI</a>\n* We're delightfully quirky (but you probably figured that out already).<p>=== A warning ===\nBefore you book an appointment with us, you should understand that wikiHow is not hoping to be acquired or looking for a quick financial exit. Our company is already profitable, financially stable (aka your job isn’t going away at someone’s whim), and we all love working here, so we aren’t in a rush to sell it to some big company. In fact, we think we are doing a pretty good job running it, and selling it might mean the end to a product that we all love working on. The team here shares a passion for helping the millions of people we reach everyday. It is an amazing feeling to work on such a popular and impactful product! That amazing feeling makes us smile when we wake up every day and think about going to work. If all of this sounds appealing to you, we encourage you to apply... If this is a bummer, then that’s okay too, we probably aren’t the best fit for you right now...and that’s totally fine!<p>===Engineering at wikiHow===\nWe have a five-person engineering team and over 40 million users.  That’s more than 8 million users per engineer!  Everything you build will make an immediate impact on millions of people.<p>Some of the problems wikiHow engineers are working on:\n* Building user-facing features for our volunteer editing community that are fun enough to gather mass usage, while simultaneously making sure the output of the work produces high-quality educational information. It’s easy to get people to upload funny cat memes on the Web; the real challenge comes when you want them to create and curate the world’s best instructional content. \n* Creating features to bring in new content contributors. To keep growing and achieve our goals, we solve how to enable contributors from mobile devices, as well as continuing to gain new desktop community members.\n* Scaling, scaling, scaling.  We get more users before 10 AM than most startups will get in their entire existence. \n* Big data. Lots of usage creates lots of data that we work with to further improve our products.\n* Mobile and tablets. The majority of wikiHow users will soon be on portable devices, but they don’t practice typical behavior patterns.  We are rethinking wikis and collaboratively created content for the mobile era. \n* Reader delight features. Better software means happier readers. We’re inventing new ways to make learning pleasant and more efficient.\n* Your awesome idea! We value our employees ideas and opinions, and most of our projects originate from people on the team.<p>Our stack:\nPHP, Mediawiki, MySQL, Bash, Javascript, HTML/CSS, Python, C++, Memcache, Varnish, Nginx, Linux, iOS, Android. This is a partial list, because we also explore and test new technologies.<p>We’re looking for full-stack engineers, and are hiring people with a variety of experience levels and technology interests.<p>Apply at engineering-jobs@wikihow.com\n<a href=\"http://www.wikihow.com/wikiHow:Jobs\" rel=\"nofollow\">http://www.wikihow.com/wikiHow:Jobs</a>","time":1367424670,"type":"comment"}