{"by":"bitovi","id":5638499,"parent":5637663,"text":"Bitovi(<a href=\"http://bitovi.com\" rel=\"nofollow\">http://bitovi.com</a>) - Full-time, Remote (North America)<p>Bitovi is looking for awesome JavaScript developers to join our team and help change the way companies build applications.<p>We are a JavaScript consulting company best known for our open source projects JavaScriptMVC, CanJS, and jQuery++. We build applications for companies all over the world, provide JavaScript training and are constantly improving our projects. We also speak at and sponsor conferences like JSConf and jQuery Conference and organize JavaScript meetups all over the country.<p>## You\nWe want smart and articulate people: someone who will instantly work well with our clients, and be able to have a beer with them afterward. And we want people who can get organized and stay on top of things in a fast-moving environment.<p>The most important ingredient, though, is passion. You should be ready to defend your strong, well-formed opinions on such topics as the future of web development, JavaScript, what a good web application looks and feels like, and Star Trek versus Star Wars versus Battlestar Galactica.<p>You should have experience in JavaScript (that’s important) and jQuery (or similar library), as well as CSS and HTML. Oh, and you should have had at least one fever dream involving parentheses counting, memory leaks, and/or Douglas Crockford.<p>## The Job\nYou’ll have the opportunity to shape your role depending on your skills, and desires. In addition to working on client projects, you’ll also get the chance to develop your own ideas and work with intelligent and talented people who want to make the web a better place.<p>A job at Bitovi includes:<p>Competitive pay and 4 weeks of vacation.\nHealth and dental insurance, as well as a gym membership reimbursement plan.\nThe ability to work from wherever you like and set your own hours.\nThe perfect amount of travel: a week every month or two.<p>To apply, send an email to jobs@bitovi.com and include a little about you, links to some code and a resume if you still have one of those kicking around.","time":1367422038,"type":"comment"}