{"by":"erickhill","id":5639613,"parent":5637663,"text":"If you're in the Seattle area, Sporcle is looking for a web developer.<p>You'll work in a team to maintain and improve our profitable flagship site as well as other web properties for the Sporcle brand. As a fast-moving startup, we want to bring on talented, energetic individuals with a passion for developing platforms for fun and innovative games that are played by millions. We strive to maintain a casual and fun work environment (bring your dog or goldfish!), but we're serious about meeting our deadlines to produce the best experience for our users and contributors.<p>Responsibilities:<p>-) Design, develop and test optimized web applications using CSS, HTML5, Javascript, working with PHP, MySQL, 3rd party libraries and services<p>-) Work as a team member to ensure that implementation details translate through to testing plans and deployment on our sites<p>-) Show product ownership through collaboration with product managers, designers, other developers to build scalable robust applications.<p>-) Excellent inter-personal and communication skills, including clear and concise writing for specifications, documentation and test plans.<p>-) Ability to switch rapidly between different projects in a fast-paced environment<p>As the next Sporcle employee, what you should bring to the table is:<p>-) Enthusiasm and passion for web applications and mobile gaming<p>-) Attention to detail and a hunger for stability and performance<p>-) Familiar with the quirks and limitations of css and javascript in a multi-browser environment<p>-) Know when to hold 'em, know when to fold 'em; Understand when to embrace and extend existing code, not just rewrite from scratch.<p>-) Comfortable working in a Linux &#38; open-source environment with source control and other content management tools.<p>-) Able to commute to Sporcle's office in Seattle, Washington (We're in Fremont across from the Burke Gilman trail)<p>-) BA/BS degree or higher, preferably in CS or a combination of education and applicable experience<p>-) Entry level applicants with relevant experience are encouraged to apply.  Being part of a small company means that there's no help desk, no formal review committees or rigid structure. We work as a team, but everyone is expected to be an independent problem solver with the ability to research and solve their own issues. We have plans and goals, but also embrace change and a little bit of chaos.\nAlready a Sporcle user? We'd love to know more about your experiences with the site or our mobile apps. Include your Sporcle handle and tell us about your favorite games.<p>Apply here:\n<a href=\"http://www.jobscore.com/jobs/sporcleinc/web-developer/aSoESiNj4r4PD8eJe4egig?ref=rss&#38;sid=68\" rel=\"nofollow\">http://www.jobscore.com/jobs/sporcleinc/web-developer/aSoESi...</a>","time":1367430965,"type":"comment"}