{"by":"fps","id":5639874,"parent":5637663,"text":"Nuance HPC Team (<a href=\"http://www.nuance.com\" rel=\"nofollow\">http://www.nuance.com</a>, NUAN) - Burlington, MA, full time.<p>We're looking for a Sr. HPC Systems Engineer to join a growing team focused on building scalable high performance computing platforms.  You'll be expected to develop tools and organize open source and commercial components to inventively solve problems at the HPC scale (Thousands of servers, petabytes of storage, hundreds of researchers.)<p>Responsibilities:<p><pre><code>  - Develop tools to deploy, manage, monitor and troubleshoot HPC systems at scale.\n  - Ability to maintain technical leadership in several of the following technical areas: Linux, Storage, Monitoring, Network, Scripting and Security.\n  - Provide mentoring and coaching to less senior staff.\n  - Advise on system architecture and growth planning.\n  - Work independently, or lead projects on a small team to build solutions based on documented requirements.\n  - Interact with internal clients, staff, IT, and external vendors to troubleshoot and resolve issues.\n  - Maintain thorough documentation on system configurations, processes and tools.\n  - Troubleshoot issues across the whole stack, software, hardware and network.\n  - Handle after hours on-call duty as part of a team rotation\n</code></pre>\nRequired Skills:<p><pre><code>  - Proficiency in at least one of the following languages: python, ruby, perl, bash.\n  - Strong verbal and written communications skills.\n  - Automation experience with tools such as Puppet, Chef, Ansible or CfEngine.\n  - Experience using source revision control systems such as SVN or Git.\n  - Virtualization experience with Linux systems on internal or external Cloud environments.\n  - Ability to learn new technologies quickly and thoroughly\n  - 4+ years experience maintaining Linux systems at a large scale.\n  - Seeks to increase knowledge/skill in platforms/services.\n  - Stays up to date with current industry trends and emerging technologies.\n</code></pre>\nPreferred Skills:<p><pre><code>  - Experience maintaining clustered filesystems using technologies like GPFS, Lustre, Gluster or HDFS.\n  - Experience with high performance/Grid compute systems such as SGE, Hadoop\n  - Experience with Openstack technologies including Swift and Nova.\n  - Knowledge of Enterprise Networking and SAN technologies.\n  - Has contributed code to an open source project.\n</code></pre>\nWe offer a competitive compensation package; including stock options, employee stock purchase plan, 401(k), full health and welfare benefits and a casual yet technically challenging work environment.<p>fred.smith@nuance.com","time":1367433032,"type":"comment"}