{"by":"schung","id":5639269,"parent":5637663,"text":"Voxer is more than just a walkie-talkie app, it is one of the most used Push-to-Talk and messaging applications in the world. Voxer iOS and Android apps allow tens of millions of users across the world to communicate instantly. We're making voice and multimedia communication faster, more efficient, and more social. Our goal is ambitious - we're building the next generation communication voice service at the intersection between PTT, phone calls, SMS, conference calls, and multimedia messaging.<p>It's no small feat to achieve, to keep one of the world's fastest growing voice applications humming along and growing at a phenomenal pace. But we are 50 dedicated individuals who are putting some of the most exciting technology in the world to work right now - we are the world's largest Node.js site, and we also run one of the largest Riak clusters in the world.<p>We are dedicated and solely focused on building the next generation of communication. The problems we're facing are at a scale only seen at companies like Twitter and Facebook and we're looking for exceptional people who can help us tackle them.<p>We closed our first outside round of funding last spring, and our brand new offices are right off Market Street in San Francisco. There's tons of restaurants and shopping nearby at Westfield and Union Square to spend your hard earned cash on, and if you're a musician there's a few outside on the street that we wouldn't mind you teaching a few new songs to. There are plenty of MUNI lines right outside, BART is a block away, plus the Ferry to Oakland and Marin is a pleasant fifteen minute stroll or five minute bus ride away.<p>We are hiring across the board and looking for Front End Engineers, iOS Engineers, Android Engineers, Server Engineers, and more!<p>Check out our site for a complete list of open jobs.\n<a href=\"http://careers.voxer.com/\" rel=\"nofollow\">http://careers.voxer.com/</a>","time":1367428623,"type":"comment"}