{"by":"theflyingkiwi42","id":5639009,"parent":5637663,"text":"Simply Studio / 17 Hats (<a href=\"http://simplystudio.com/\" rel=\"nofollow\">http://simplystudio.com/</a>) - IRVINE, CA / REMOTE (US/CANADA preferred)<p>We're looking for a senior web developer to join our team. We're building a fantastic one-stop SAAS app for one person businesses. It handles everything from invoicing, to contact management, to online contracts, to accounting and more. Over the past year we've built the initial version of the app for the photographers. It's been very successful and we're ready to move on to other industries.<p>This is where you come in! As we grow, we need somebody who can take care of building new front end functionality, as well as fix the occassional bug in our current feature set. The front end of the app is a single page app, using Sammy.js and Knockout.js. We built our own MVC framework that kicks ass, and is very easy to use.<p>We're looking for the person who loves coding challenges, and can figure out the best solution in a reasonable matter of time. A person who will work with our UX designer (who creates the necessary HTML and CSS) to implement the design. A person who understands that real businesses use our software on a daily basis and the importance of writing code that does what we expect.<p>You'll be joining a small but very experienced development and design team. We've been making scalable SAAS applications for over 15 years with over 10,000 clients. Since 2010, we've been using AWS for basically everything.<p>Skills &#38; Requirements<p>Must haves:<p>- Great understanding of writing re-useable Javascript<p>- Understand JSON structures<p>- Experience with 'single page' web application<p>- Have written a jQuery plugin<p>- Know your way around HTML and CSS<p>- Tons of Ajax experience<p>Plus:<p>- Server side experience with MySQL<p>- Perl experience<p>- Knockout.js experience<p>- Amazon AWS experience<p>An interest in (small) business would be another plus.<p>About Simply Studio / 17Hats<p>We're self-financed and profitable. The position is available now, and it is possible to tele-commute. Currently our team is location all over the country and Canada. If you live in the LA area, you would still work from home (or your favorite coffee shop) but we'd meet up once a week or so to go over the latest developments.<p>There's always a lot going on, which means every day is different. There are always new challenges. With our current user base, it is very rewarding when you see the responses come in after you release a new feature or fix an existing issue.<p>If you love front end app development, we're the place for you!<p>Salary range, depending on experience, is between $80,000 and $120,000 (US Dollars).<p>Please drop us an email at jobs@simplystudio.com","time":1367426297,"type":"comment"}