{"by":"committee","id":5639955,"parent":5637663,"text":"Positions available in: San Francisco, CA; Palo Alto, CA; New York, NY; London, UK; Chicago, IL<p><a href=\"http://www.optimalsocial.com/\" rel=\"nofollow\">http://www.optimalsocial.com/</a><p>Vision - Optimal, Inc. provides unparalleled audience data to help marketers manage and optimize their social advertising campaigns, all in real-time. Optimal was named the 9th fastest-growing, privately-held company in the San Francisco Bay Area in 2011 by the San Francisco Business Times and PwC. We are a Facebook Preferred Marketing Developer and are working closely with other major social networks, but our vision is a more general one – to be the numerati behind what it means to engage in a world where people are voluntarily social and highly mobile.<p>Culture - We are growing very rapidly and occupy a unique position in the social advertising ecosystem. Optimal is seeking top-caliber, motivated individuals who view optimality as a way of being, whose curiosity embraces both theory and practicality, and who are enthusiastic about applying their talent to the future of social media: open graphs, real-time, big data, and word-of-mouth at scale. Our culture is built around an intelligent and professional look at the wider world of online and social media, but we are also a group that doesn’t take ourselves too seriously. If you want to work with smart people and change social marketing forever, come and join us!<p>We're currently seeking candidates for these positions (H1B welcome): Java Engineer and Cloud Ops Engineer.<p>We're also hiring for non-technical roles within Operations and Sales (i.e. Account Managers, Analysts, Social Media Analyst Interns, and Business Development Directors).<p>Check it out and apply here! - <a href=\"http://www.optimalsocial.com/careers/\" rel=\"nofollow\">http://www.optimalsocial.com/careers/</a><p>If you have any questions, feel free to reach out directly to me: derek AT optimalsocial dot com.","time":1367433764,"type":"comment"}