{"by":"jshah13","id":5639784,"parent":5637663,"text":"Splunk is looking for Software Engineer for Cloud Team.\nob Description: That’s a cool job! I want it!<p>We are busy designing and implementing a public cloud based version of Splunk with the goals of instant deployment and extremely fast time-to-value.  The service will allow customers of platform as a service provider (PaaS) and other cloud based services to quickly troubleshoot their applications and build real-time analytical dashboards, which deliver “Operational Intelligence”.<p>We are using the newest technologies to build a multi-tenant, horizontally scaled version of Splunk for thousands of concurrent users.  This project is run a little differently than typical software projects. We believe in eating our own dog food by using other cloud services wherever possible.  We are ardent believers in the concept of “DevOps” where the people who write the code also deploy and manage the virtual systems it runs on.  Thus all systems are managed via “Infrastructure as Code” tools and techniques.<p>Responsibilities: I want to and can do that!<p><pre><code>    Design and write code to develop and maintain systems which power Splunk multi-tenant services hosted in the public cloud\n    Build high-performance and reliable data transport applications\n    Implement horizontally scaled out systems, which allow thousands of concurrent Splunk users.\n    Define a publish best practices\n</code></pre>\nRequirements: I’ve already done that or have that!<p><pre><code>    2+ years software development experience\n    Thrives on big data challenges of large volumes, at high velocity, with extreme variability\n    Fluency in programming languages such as Python, C, C++\n    Strong knowledge of OOP, Network Programming, distributed computing concepts\n    Understanding of application development environments such as Django and/or Rails\n    Experience with deployment, operations, and management issues for complex distributed data systems\n    In-depth understanding of performance considerations with web-scale deployments\n    General Familiarity with tools like Chef, Puppet, cfengine, etc.\n    Experience with technologies like DNS, HTTP(S), Layer 7 load balancing, etc.\n    Understanding of both RDBMS and NoSQL approaches to data storage\n    Experience with Amazon EC2, Rackspace or other public cloud technologies and API’s\n    Strong communication skills, both verbal and written\n    Previous experience in a high paced agile development environment using tools such as Git, Mercurial, Basecamp, Pivotal Tracker, etc.\n\n </code></pre>\nEducation: Got it!<p><pre><code>    Bachelors Degree in Computer Science or related discipline.\n</code></pre>\nAbout Splunk:<p>Splunk was founded to pursue a disruptive new vision: make machine data accessible, usable and valuable to everyone.  Machine data is a fast growing and pervasive part of “big data”—generated by every component of IT infrastructures, applications, mobile phone location data, website clickstreams, social data, RFID and much more.<p>Splunk is focused specifically on the challenges and opportunity of effectively managing massive amounts of machine data, and providing a next-generation platform for powerful new applications.  Since shipping its software in 2006, Splunk now has almost 3,000 customers in over 70 countries around the world.  These organizations are using Splunk to harness the power of their machine data for application management, IT operations and infrastructure management, cyber security, compliance, web intelligence, business analytics and more.  Innovation is in our DNA – from technology to the way we do business.<p>Splunk software has become a platform for machine data!<p>Splunk now has over 400 employees worldwide, with headquarters in San Francisco, an office in Cupertino, CA and 8 offices around the world.<p>We’ve built a phenomenal foundation for success with a proven leadership team, highly passionate employees and unique patented software.  We invite you to help us continue our drive to define a new industry and become part of an innovative, and disruptive software company.<p>Benefits &#38; Perks: Wow! This is really cool!<p>Health Care, full company paid Dental, Vision and Life Insurance, flexible spending and dependent care accounts, Commuter benefits, PTO and sick leave, 401K, 3 weeks vacation, 2 completely stacked micro kitchens, catered lunches on Monday and Bagel Fridays, basketball hoops, ping pong, bbqs, soccer, ski trips, on-site yoga classes, health fairs.<p>This isn’t a job – it’s a life changer – are you ready?<p>To all recruitment agencies: Splunk does not accept agency resumes. Please do not forward resumes to our jobs alias, Splunk employees or any other company location. Splunk is not responsible for any fees related to unsolicited resumes.<p>Splunk is an equal opportunity/affirmative action employer supporting workforce diversity.","time":1367432350,"type":"comment"}