{"by":"dfriedmn","id":5639351,"parent":5637663,"text":"Thinkful (thinkful.com) - NYC, full-time.<p>We are a team of educators and students. Whether you’re building the product, designing a curriculum, or working directly with students, you’ll be asked to learn quickly and help others do the same. We hire for the curiosity, enthusiasm, and grit that characterize our students. We believe in both teaching and learning while at work, and we provide the freedom and support you need to learn any skill.<p>We offer everything you should expect from a well-funded startup: competitive salaries, health insurance, significant equity, and a few perks that reflect our culture: gym membership, Kindle, and monthly book credit. We share an office with other great startups in the Flatiron district of Manhattan.<p>Python/Django engineers<p>We’re building the tools to deliver curricula, expertise and live help so anyone can advance their career. As an engineer at Thinkful you’ll be working directly with both Darrell and Dan to architect, build and grow our technology and our team. You’re excited about learning new skills and applying them to help others learn. You must have a portfolio of interesting software engineering projects you can show us. The ideal candidate has a keen interest in education and learning, reflecting the aspirations of our students. Talent and curiosity matter more than raw skill: Experience is valued, but not as much as potential. This position is with us in New York City.<p>Contact Darrell (darrell at thinkful dot com) to apply. Send along your GitHub profile, or any work that makes you awesome.<p>UX/UI designer<p>We need to build a visual voice that reflects the values of Thinkful: Aspirational, curious, and open to experimentation. In this role, you’ll define the look and feel of the Thinkful brand and create the UX and UI of our educational product. You’re excited to design experiences that help our students learn faster and retain what they learn. You want to contribute ideas, and take others’ ideas to the state of finished products. If you don’t already know how to code your designs, you’re excited to learn (we’re happy to teach you). Your experience must demonstrate that you’re versatile, and your curiosity must convince us that you intend to become more so. This position is with us in New York City.<p>Contact Darrell (darrell at thinkful dot com) to apply. Send along any work that makes you awesome.","time":1367429250,"type":"comment"}