{"by":"ad93611","id":5640078,"parent":5637663,"text":"We are looking for a core-team member for our startup in Bangalore, India. We offer good chunk of equity for the right person.<p>Background<p>Gaglers (<a href=\"http://gaglers.com\" rel=\"nofollow\">http://gaglers.com</a>) is a scalable real-time chat platform. Currently, we offer group chat for communities and live chat with unlimited operators.<p>Our high-level technical challenges are,<p><pre><code>    scaling a real-time platform to millions of concurrent users.\n    measure all interactions to make data driven decisions\n</code></pre>\nThis is a full-time position based in Bangalore, India.<p>Typical Day at the Job<p>Here is how a typical day will look like. You start by looking the status of the production dashboard and bugs. With a quick scan you find that that the message counts are not getting updated in the dashboard after the code push last night. You jump on it right way and send a short code-review out, after testing it on your staging setup.<p>With that out of the way, you get back to the feature that you have been working on. You know exactly why you are building this feature and what impact it will have on the customers. The feature was specced out last week in some intense design discussions. You finished a quick prototype yesterday. You throw it out today and start the code and unit testing for the initial release. The plan is to deploy a basic version this week sometime, gather feedback over a few days and then fine-tune it based on what the customers say.<p>Just after lunch, while you code, you come across a bug in the queuing sub-system. You decide that it would be simple for you to fix it as well and so you do. While you fixed the bug, you thought about how you can make the queuing system much more scalable. You write a quick note to yourself to talk about it later.<p>By the end of the day you'll have a good chunk of the new feature implemented. You'll send that queuing system bug fix for code-review tomorrow morning and continue your work of the new feature.\nHow the role will develop<p>Initially, the tasks you take on will be smaller and fairly well defined. Longer term, the requirements you get will be more general, and you’ll interpret them to produce great solutions. You’ll also generate tasks on your own initiative as you identify opportunities.<p>As we grow, we may need to take on more developers. You’ll have the opportunity to be responsible for these folks if you want.<p>Technical Qualifications<p>You will be,<p><pre><code>    fluent in Django and Python and comfortable using Git\n    be happy with HTML and Javascript\n    have designed and written applications using Django\n    comfortable managing a group of remote linux servers.\n</code></pre>\nYou'll have the opportunity to work on all areas of our stack. Our technology stack includes,<p><pre><code>    Django, Python, Erlang\n    Redis, MySQL\n    RabbitMQ, Celery\n    MemCache\n    Bootstrap, JQuery, Javascript\n</code></pre>\nWe are looking for someone who sees their role as bigger than just programming. You'll also get to know our business. You'll also look for opportunities to make things cooler for our customers.<p>Contact me directly: augustus at gaglers dot com","time":1367434891,"type":"comment"}