{"by":"anson","id":5640059,"parent":5637663,"text":"San Francisco, Full time. H1Bs welcome.<p>We are also offering the first 25 people who apply through Hacker News a free $100 Cardpool Gift Card (can be used to buy virtually any other gift card in the US).<p>Cardpool.com (YC W10) is looking for software engineers to join our talented team of 4 engineers (total team size ~15 + customer service and fulfillment).  We are also looking for a Senior/Director-level Account Manager to help develop, launch, and manage new high-profile partnerships. This person will be responsible for implementation, training, reporting, problem solving, growing the business, presenting to executives, and much more.<p>Cardpool makes it ridiculously easy to buy and sell gift cards. In the last 3.5 years, the company has grown from 2 guys in a living room to a company that helps hundreds of thousands of customers buy and sell over $100,000 in gift cards each day.  We have been featured on CNN, NBC, CBS, ABC, FOX, NPR, and The New York Times.<p>We pride ourselves on being an engineering-focused group (with experience @ Apple, Google, Amazon.com, Microsoft, MIT, CMU, UIUC, Harvard, and Brown) that moves quickly and builds great customer experiences. Some of the interesting technical and business challenges we're working on include real-time inventory management, dynamic pricing problems, high-performance transaction processing, security, data mining, API design, and ping-pong matchmaking algorithms :)<p>The ideal candidate would be excited by the prospect of working on a small group of highly technical engineers and enjoy having a ton of responsibility while learning something new almost daily.  Experience working with Ruby, Python, or Ruby on Rails is a plus but not a requirement.<p>Cardpool has an incredible team, above-market compensation, and a generous profit-sharing program.  We were acquired in 2011 and will appeal to candidates who are looking to work at a fun small startup-like environment but with the lifestyle (reasonable hours), benefits, and financial strength of a public company.<p>To learn more, head to <a href=\"http://www.cardpool.com/jobs\" rel=\"nofollow\">http://www.cardpool.com/jobs</a> or email us at jobs@cardpool.com (this goes straight to the founders).<p>Hope to hear from you soon!\nAnson, Founder/CEO/GM","time":1367434697,"type":"comment"}