{"by":"sdevlin","id":5640441,"kids":[5641094,5640704,5640506,5641676],"parent":5637663,"text":"Matasano - New York City, Chicago, San Francisco Bay Area<p>We break into banks. And hospitals. And financial firms. And social media startups. And any other business that puts an open port between itself and the big bad world.<p>Matasano is looking for appsec consultants, now and forever. What does that mean?<p>We dig deep. Our consultants spend their days sliding up and down the ladder of abstraction, rapidly assimilating unfamiliar systems (and then breaking them). One week you're pulling apart macros in a Lisp app; the next, you're on your hands and knees crawling through x86 disassembly.<p>We move fast. Our projects run on tight deadlines: one or two weeks is typical. Recently we wrote a bespoke proxy to rip apart a custom encrypted protocol, tamper with messages, and cobble it back together again. That could be a two-week job in itself. At Matasano, that's just Tuesday.<p>We find bugs. Not just in applications, but in the tools they're built with. That includes some of the biggest open-source and proprietary software stacks in the world.<p>This is the <i>Mission: Impossible</i> of software gigs, and we need the best people to get the job done. NO PRIOR APPSEC EXPERIENCE REQUIRED. We need great software developers and fast learners, for we intend to go in harm's way. If this sounds interesting to you, we should absolutely talk.<p>Who knows what evil lurks in the hearts of software applications?<p><i>Matasano knows.</i><p>Full benefits. Free books. Really smart coworkers. For more information, visit <a href=\"http://www.matasano.com/careers\" rel=\"nofollow\">http://www.matasano.com/careers</a>.<p>Looking for a taste of what we do? Shoot an email to cryptopals@matasano.com. We'll get you started with 48 problems (and counting) of real-world cryptography problems. This is the best answer you will ever get to the question: \"Why shouldn't I roll my own crypto?\"","time":1367438764,"type":"comment"}