{"by":"eliekh","id":5641961,"parent":5637663,"text":"Woopra (<a href=\"http://www.woopra.com/\" rel=\"nofollow\">http://www.woopra.com/</a>) - Leading customer analytics company. We just moved to a new bigger space in the heart of SoMa SF (1 block away from the caltrain station). We're looking to fill 2 positions:<p><i>Frontend Engineer</i><p>Requirements:<p><pre><code>  - Strong knowledge of HTML, CSS (SASS), JavaScript (not just jQuery)\n  - Good sense of design/UI\n  - Experience with building web applications - not just simple DOM manipulations\n  - Experience in design patterns and OOP inheritance\n  - Knowledge of version control (git)\n</code></pre>\nResponsibilities:<p><pre><code>  - Develop and maintain the client side application\n  - Improve the client side architecture\n  - Help establish and adhere to coding standards\n  - Investigate and optimize client side performance issues\n</code></pre>\nPluses:<p><pre><code>  - Front-end testing experience (mocha, jasmine, selenium, etc)\n  - Side projects\n  - Experience with MVC JS frameworks (Backbone, Angular, Ember, etc)\n</code></pre>\n<i>Sysop Engineer</i><p>Requirements:<p><pre><code>  - Experience in high availability, high performance and high scalability\n  - Experience in distributed systems ( databases, parallel processing)\n  - Fluent in Linux systems (Red Hat flavors is a plus)\n  - Deep knowledge of internet protocols layers and standards (TCP/UDP, HTTP) \n  - Experience in Java\n  - Experience in Chef or Puppet.\n</code></pre>\nResponsibilities:<p><pre><code>  - Own monitoring &#38; alert configuration to detect, triage and resolve issues quickly\n  - Take charge of outages, lead calls until they are resolved, and make sure the root cause has been found and fixed\n  - Perform data analysis to detect trends in usage, errors, etc. and triage production issues appropriately\n  - Setup automated deployment with versioning\n  - Manage AWS services\n  - Manage colocated infrastructure\n  - Assist in integrations with 3rd-party providers\n</code></pre>\nTo apply, visit <a href=\"http://www.woopra.com/careers/\" rel=\"nofollow\">http://www.woopra.com/careers/</a> or email us at careers@woopra.com.","time":1367458212,"type":"comment"}