{"by":"Robin_Message","id":5643556,"parent":5637663,"text":"Unifyo (<a href=\"https://unifyo.com\" rel=\"nofollow\">https://unifyo.com</a>) – Cambridge/London, UK – Sales and Account Executive<p>That's right, we're looking for a sales guy on Hacker News. We figured there must be some sales guys on here who love technology but their skills and passion are in sales, and are looking for a startup to join. If that sounds like you, don't bother scrolling down; there won't be many more of these.<p>Basically, we have the technology (cue Six Million Dollar Man theme) and we need you to help us turn it into money and happy customers.<p><i>The Product</i><p>Unifyo is a genius product that can accelerate millions of people’s workflow (e.g. in sales or customer service) by having instant access to unified customer profiles.<p><i>The Plan</i><p>You’ll proactively reach out to new and existing users (= leads) of Unifyo. Instead of cold calling potential clients, you focus on making sure that current users use Unifyo successful inside their companies and with their colleagues, so they feel comfortable paying for it. We’ll expect you to organise the sales approach, process and tools yourself and come back with results. The whole team will support you in your exciting quest providing the metrics and customer data you'll need to increase Unifyo's revenues from thousands to millions.<p><i>What we (think) we need from you</i><p>• You have at least 2 years of sales experience with demonstrable sales targets achieved, along with a track record of selling software solutions (SaaS) over the phone and face to face.<p>• You have received formal sales training.<p>• You have an innate hunger for personal and company success combined with a great personality.<p>• You have a solid understanding of web, enterprise, and SaaS technologies.<p>• You have a strong interest in tech (that's why you're on Hacker News) but you also have the ability to clearly explain complicated ideas to a non-technical audience. Try explaining Facebook to your grandmother before applying.<p><i>What's next</i><p>For more information, and to apply, get in touch with me (Robin) or Ben (our names at unifyo.com), or check out the full job at <a href=\"https://unifyo.com/jobs-sales\" rel=\"nofollow\">https://unifyo.com/jobs-sales</a>","time":1367490885,"type":"comment"}