{"by":"benblair","id":5645276,"parent":5637663,"text":"Chicago, IL<p>Help MarkITx[1] build the software systems that will track, value and trade the world’s IT infrastructure. Working side-by-side with our CTO Ben Blair (that's me) and our head of product Shawn Kelly, you’ll design and build a web of distributed systems sitting atop our AWS infrastructure. You'll have full ownership of your projects and the systems you work on. You'll never be micromanaged.<p>We're looking for engineers who have built, deployed and managed large distributed systems. We're pragmatists, not purists.  We try to use the right technology for the job, with familiarity being a tie breaker. Some things we use today: Node.js, ElasticSearch, Redis and CouchDB and a slew of AWS services.<p>The types of project you might work on:<p>- An automated market making system for wholesalers<p>- An inventory import that can identify products in anything from poorly formatted spreadsheets to scanned invoice PDFs to photos of asset tags<p>- A public-facing API for asset valuation and trading<p>We Offer:<p>- Great work environment + generous equipment budget<p>- Base salary in the $110 - $130k range + significant equity<p>- Raise to $160 - $180k when we close our Series A<p>- Benefits including health, dental<p>About MarkITx<p>MarkITx is a B2B exchange for buying and selling IT hardware (anything that goes into a datacenter). We are disrupting the $350B secondary IT market by bringing simplicity and transparency to a process that is currently painful, ugly and untrustworthy. We are a well funded startup, working out of 1871. We are a very talented, deeply experienced and tight-knit team. We have some of the best backers and advisors in Chicago. We’ve proven the model, with over $60MM in orders and over $150k per month in transactions. We’re just getting started, and we need your help to scale.<p>Our culture is driven by a simple constraint: every colleague we add should make the rest of the team happier and better at their own jobs. That means talent density grows as we grow. It means we have zero tolerance for ego-driven BS. It means we’re in awe of what our colleagues are capable of. It means we have complete autonomy to identify and solve the problems in our domain. It means we care more about the win than we do about who did what to get us there.<p>Email me at ben@markitx.com if you're interested and tell me about what you've built.<p>[1] <a href=\"https://www.markitx.com\" rel=\"nofollow\">https://www.markitx.com</a>","time":1367509895,"type":"comment"}