{"by":"hardscore","id":5657826,"parent":5637663,"text":"Berlin, Full-time Unity Mobile Game Developer, Good chunk of equity (Late Co-Founder) 7-10% Equity, Salary to cover living expenses, we help with relocation<p>Join our team of 4 game enthusiast (2 artists, 1 dev, 1 biz)\n- We are on a mission to redefine strategy gaming for smartphones (no more please wait 32 hours to build a goddamn house) \n- Founded Autumn 2012\n- Angel Funded<p>Requirements:\nBurning passion to build (strategy) games for gamers (not 35 year old moms)\nExperience in developing kickass games with unity<p>Please send me an email: felix@hardscoregames.com<p>Felix\nFounder<p>5 Reasons to move to Berlin (thanks Node.js - great summary)\n1. Lowest livings costs with highest standard of living. Stay in gorgeous, perfectly renovated apartments in pre-WWII residential buildings with high ceilings, right in the middle of the center and pay a fraction of costs of any other capital (even cheaper than any Eastern European capital). No need for a car—Berlin has one of the densest subway nets and wide streets make biking fun + we have Car2Go and Drive-Now (these are world's best smartphone-supported car sharing systems with brand new cars at every corner, cheaper than owning a car or riding a cab). In addition, Germany has an amazing social health care system including health, unemployment and pension (when working as an employee).\n2. A vibrant and fast growing ecosystem of smart people. A vast number of new software talents, founders, software companies and VCs are moving to Berlin, every day (Twitter, Google, Soundcloud, Early Bird, Mozilla and many more).\n3. People here are open-minded, outgoing, mix well and international—no need to learn German, everyone speaks English! Making new friends is a matter of days. Visit tons of networking and startup events, every week.\n4. Easy work permissions—Europeans do not need any and can work from day one.\n5. Berlin's night life is unmatched, huge and changing every day (plus ridiculously cheap). Berlin has got some of the most dazzling, naughty, and original clubs on the face of the Earth.\nBerlin is calling and getting the new tech hub of Europe. If you are passionate about building great software, we’d love to talk with you. If you don't live in Berlin yet, we could help to fix that.","time":1367742161,"type":"comment"}