{"by":"AndreMploy","id":5672843,"parent":5637663,"text":"Spotify, New York, Site Reliability Engineer, Full time, on site.<p>We want to connect millions of people with their favorite songs and create a service that people love to use. As a Systems Engineer working on Spotify’s Site Reliability Engineering Team, your mission will be to ensure Spotify is always fast, available, and scalable.<p>The primary mission of the Site Reliability Engineering Team is to make sure that the music never stops streaming. In order to achieve this, you will have the opportunity to work with many different teams at Spotify. You will be involved in architecting and designing new systems and driving improvements to existing ones. You’ll have a unique chance to work with large-scale systems in a very fast-growing environment.<p>Responsibilities<p>Work in our Site Reliability Engineering team, focusing on automation and maintainability at large scale to keep the music playing<p>Work with a service platform built with Open Source Software<p>Help us strategically scale our data centers and networks to reach more and more users around the world<p>Troubleshoot and analyze applications, networks, and hardware<p>Collaborate with development teams to ensure all systems are built to scale along with our user growth, acting as a stakeholder.<p>Requirements<p>Bachelors degree in Computer Science or relevant work experience<p>Linux: the internals of the kernel, the intricacies of userland, and the ins and outs of packaging<p>Networking protocols at all layers of the stack<p>High availability, high performance, high security, and where each needs to be applied<p>Configuration management tools (Puppet, Chef, Salt, etc)<p>System automation with scripting languages<p>Revision control systems<p>Databases (PostgreSQL, Cassandra, MySQL, etc)<p>Out of the box solutions for problems most haven’t encountered<p>Excellent written and verbal communication<p>Debian GNU/Linux knowledge a plus<p><a href=\"https://www.spotify.com/us/jobs/view/oqqSWfwo/\" rel=\"nofollow\">https://www.spotify.com/us/jobs/view/oqqSWfwo/</a>","time":1367994538,"type":"comment"}