{"by":"jriediger","id":5689358,"parent":5637663,"text":"Recommind - San Francisco, CA - Machine Learning, Enterprise Software and Frontend Engineers - Full-time<p>We are looking for people who are passionate about building applications for finding information in unstructured and semi-structured data. Why should you work with us? We have just recently been named as one of the world’s most innovative companies in big data [1].<p>Our small team is working on a new prototype that will help automatize and scale information extraction on unstructured data by a patent-pending learn-by-example method. Currently our goal is to make information extraction in legal contracts easier, but we really focus on all kinds of unstructured or semi-structured information.<p>If you have expertise in Machine Learning and/or Natural Language Processing, are familiar with building enterprise applications and/or have great design and frontend skills, we would love to get in touch with you. We are generally looking for strong generalists who are familiar with at least two of the described three areas and share our vision.<p>Our stack is largely Java/jQuery/CSS/HTML5-based, but we also use Ruby on Rails for rapid prototyping.<p>Depending on your area of expertise, you should have:<p><pre><code>  - Strong CS fundamentals (algorithms, data structures)\n  - Strong software design and architecture skills\n  - Experience with ML or NLP\n  - Frontend development and design experience\n</code></pre>\nIn any case you should have:<p><pre><code>  - Passion to build quality software\n  - Experience with Java or exceptional capabilities to learn it quickly\n  - Entrepreneurial attitude\n  - Willingness to learn and adapt to new technologies\n</code></pre>\nWe offer competitive compensation with benefits and a work experience with a high degree of freedom and flexibility (work hours/work from home option) - what’s important to us is the result of your work. While you would be part of a small but growing team working on a completely new product, you would enjoy the perks and benefits of a fast-growing company.<p>[1] <a href=\"http://www.fastcompany.com/most-innovative-companies/2013/industry/big-data\" rel=\"nofollow\">http://www.fastcompany.com/most-innovative-companies/2013/in...</a><p>If this sounds interesting, let’s talk! Send me your resume/CV and links to github, projects or blogs etc.: julian (dot) riediger (at) recommind (dot) com<p>-Julian (Technical Product Manager)","time":1368234056,"type":"comment"}