{"by":"samcheng","id":14689601,"kids":[14746809],"parent":14688684,"text":"RINSE | San Francisco, CA, Culver City, CA, Washington, DC, Boston, MA | Full Time<p>Rinse is a technology-enabled dry cleaning and laundry delivery service. We&#x27;ve grown at double-digit month-over-month rates for about four years now, our business fundamentals are solid, and our customers love us! We have a number of open positions:<p>1) We&#x27;re actively seeking Software Engineers of all skill levels, including those looking for leadership opportunity.  We&#x27;re primarily a Django &#x2F; Python shop, but an individual with solid systems engineering fundamentals will succeed, regardless of technical specifics. It&#x27;s a &quot;target rich&quot; environment with plenty of opportunity to make a direct and meaningful impact on the business! We&#x27;re solving problems as varied as demand forecasting, route optimization, QR tagging for inventory control, SMS automation, and a suite of mobile apps for our customers and staff. See <a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;software-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;software-engineer&#x2F;</a><p>2) In particular, we&#x27;re missing a Senior Front-End Developer to join the team and provide some leadership in the development of our suite of hybrid mobile apps and web tools.  We&#x27;ve seen success building a React Native app for our customers, and we have sophisticated internal apps on Backbone.js.  Our users are an interesting mix of newly-acquired customers, highly-engaged staff who need these tools to do their job, and vendors who may be the dry cleaners down the street from your house.  See <a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;senior-front-end-developer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;senior-front-end-developer&#x2F;</a><p>3) We&#x27;re hiring our first Data Scientist to augment our data-driven management culture. The ideal candidate will span Data Engineering, Data Science, and Business Intelligence roles, and be familiar with enterprise data warehousing technologies. Important technical skills include SQL and Python, with Excel familiarity a big plus. We have an interesting and growing data set; this position will enjoy considerable executive visibility and a significant influence in the direction of the company. See <a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;data-scientist&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;data-scientist&#x2F;</a><p>4) Finally, we&#x27;re aggressively recruiting for a Boston City Manager to found and lead our Boston operation.  This is a great &#x27;mini-startup&#x27; opportunity, with operational, management, financial, marketing, and business-development roles all rolled into one.  This position enjoys significant support from our corporate team, and we have a good idea how to do that, since this will be our fifth city.  See <a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;city-manager-boston&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;city-manager-boston&#x2F;</a><p>See <a href=\"https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rinse.com&#x2F;careers&#x2F;</a> for even more open positions, including numerous open marketing roles!<p>Want to join a rapidly-growing startup that actually has a sustainable business model? Perhaps your family ran a dry cleaner or laundromat when you were growing up? Delighted with our service? Let&#x27;s talk!<p>Email sam &lt;at&gt; rinse.com with questions, or contact jobs &lt;at&gt; rinse.com directly to apply.","time":1499100166,"type":"comment"}