{"by":"analyticalspace","id":14689053,"kids":[14702951],"parent":14688684,"text":"Analytical Space Inc | Embedded Systems Engineer or Flight Software Engineer | Cambridge&#x2F;Boston, MA | ONSITE, REMOTE analyticalspace.com<p>Analytical Space (ASI), a venture-backed startup, is developing the 1st network of small satellites that use laser communication to provide global data relay services. Initially, our network will connect remote assets in the air and on the Earth&#x27;s surface and more than triple data downlink from remote sensing satellites. At scale, our network will deliver global connectivity at lower latency than terrestrial fiber optic cables over continental distances. Currently, the company is on track for the launch of our demo satellite at the end of this year with multiple beta customers already signed up.<p>Founded by Harvard students with deep experience in technology and space policy. The team&#x27;s background includes stints at NASA, the White House, Planetary Resources, MIT, CalTech, Florida Tech and Harvard.<p>Job Description:\nAnalytical Space is seeking an Embedded Systems Engineer or Flight Software Engineer who will be part of a small team to write software used to operate and manage computing resources on a 6U cubesat. You will be in charge of designing and implementing mission planning software on a FreeRTOS microcontroller interact with hardware and other subsystems of the spacecraft.<p>Responsibilities: \nDevelop reliable mission planning software to command and manage all other hardware and subsystems of the spacecraft Design house-keeping software for fault mitigation, detection, and resolution Write well-structured and performant RTOS and Linux based software for embedded systems (AVR32, ARM, x86) Work with other engineers to test your code, and set up automatic testing<p>Basic Qualifications: \nExperience in C and C++ for embedded systems Ability to prototype systems in Python to test out designs Strong debugging and unit testing skills<p>Preferred Skills&#x2F;We&#x27;d like to see: \nGood Dev-ops skills, continuous integration and testing experience Experience with RS-422, RS-485, CAN, I2C, network programming Experience developing RTOS applications or bare-metal programming Experience writing linux device drivers for hardware is a plus<p>Bonus&#x2F;Not required but nice to have: \nExperience writing in Rust Written code that has flown in space (and worked properly!)","time":1499096520,"type":"comment"}