{"by":"s0rc3r3r01","id":14688987,"parent":14688684,"text":"Curve - www.imaginecurve.com | Shoreditch, London, UK | Onsite | FT | FinTech - Salary + Equity + great coffee!<p>Come join our adventure! - We’re currently eager to hear from naturally inquisitive, experienced &amp; deft SREs, Full Stack Software Engineers and Android Developers who want to make a difference and have influence!<p>Our Mission: Curve is on a mission to simplify the way people spend, send, see and save money. We are focused on an ambitious opportunity fuelled by a couple of trends starting to play out in the market, from fragmentation of financial services to new convergence layers for the customer experience. We believe the end-game will be a connected world of money, tailored individually for each customer. As such, we&#x27;re building a new category - a digital banking platform.<p>About Us: We are an award winning high-performance team of circa 40 (recently won WIREDMoney Startup) rallied around a higher purpose; we work closely together to turn dreams and ideas into actions and product innovation. Developing a ground-breaking product with our customers at the core. We are, bold, like to challenge assumptions, adaptable and resourceful in the ways we can serve people. We constantly strive to find the ‘why’, and move quickly into action. We believe in deep collaboration, treat each other respectfully and improve together. Our collective conviction and passion drives our mission.<p>Technical Complexities: scalability, security &amp; real-time transactions are all part of the day-to-day challenges; the near future will include a public API, fraud engine, machine learning &amp; big data.\nIf you like to be intellectually stretched, your potential exercised and want an opportunity to have a real voice, input, impactful contribution and agency, then we’re offering that in abundance.<p>Tech Stack includes: PHP, GO, Symfony2, Kubernetes, AWS, Snowplow, Java, RxJava<p>Contact:  Anney our Talent Lead on anney.wyner@imaginecurve.com or for more info about our jobs, check out: <a href=\"https:&#x2F;&#x2F;curve-1.workable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;curve-1.workable.com</a><p>Our Process: Includes a developer challenge and 3&#x2F;4 conversations….but we don’t dither when deciding and can turn offers around very quickly!","time":1499096062,"type":"comment"}