{"by":"apu","id":14689967,"kids":[14696698],"parent":14688684,"text":"Dropbox | Machine Learning Engineer | San Francisco, Seattle, New York | Onsite, full-time<p>Dropbox’s Machine Learning team develops high-impact solutions that touch millions of people and a lot of data. From images and videos to documents and audio (in every language!), the Dropbox ML team tackles it all! We leverage the full range of classic &amp; modern ML techniques (whatever a problem calls for!), including {semi,un,}supervised learning, deep learning of all flavors (from CNNs to LSTMs and beyond!), and online&#x2F;interactive learning.<p>See this blog post for a deep-dive into a recent feature we developed (OCR on scanned documents): <a href=\"https:&#x2F;&#x2F;blogs.dropbox.com&#x2F;tech&#x2F;2017&#x2F;04&#x2F;creating-a-modern-ocr\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.dropbox.com&#x2F;tech&#x2F;2017&#x2F;04&#x2F;creating-a-modern-ocr</a><p>We&#x27;re looking for people with either academic or practical backgrounds in machine learning, ideally with experience in natural language understanding, information retrieval, knowledge extraction, and&#x2F;or deep learning.<p>Responsibilities:<p>- Work within the Machine Learning Team to prototype, design, code, train, test, deploy, and iterate on large scale machine learning systems.<p>- Build delightful products and experiences for millions, while working alongside an excellent, cross-functional team across Engineering, Product and Design.<p>- Help shape the direction of machine learning and artificial intelligence at Dropbox.<p>Benefits and Perks:<p>- Getting to make a tremendous impact on our infrastructure &amp; products, which are used by hundreds of millions of people around the world<p>- Working with a highly skilled and experienced team with backgrounds in industry &amp; academia, across many different fields<p>- Market competitive total compensation package<p>- 100% company-paid individual medical, dental, &amp; vision insurance coverage<p>- 401k + company match<p>- Generous vacation &amp; volunteer policy<p>- Free Dropbox space for your friends and family :-)<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.dropbox.com&#x2F;jobs&#x2F;listing&#x2F;533100\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dropbox.com&#x2F;jobs&#x2F;listing&#x2F;533100</a><p>Please don&#x27;t hesitate to reach out to me, even if just to ask a question or clarify something! (Contact info in my profile)","time":1499103008,"type":"comment"}