{"by":"pixelmonkey","id":14689312,"kids":[14691991,14691983],"parent":14688684,"text":"Parse.ly | Success Engineers + Software Engineers | Remote | Full-Time<p>What&#x27;s Parse.ly? We&#x27;ve built a real-time content measurement layer for the entire web. Our analytics platform helps digital storytellers at some of the web&#x27;s best sites, such as Arstechnica, The New Yorker, TechCrunch, The Intercept, Mashable, and many more. In total, our analytics system handles over 65 billion monthly events from over 1 billion monthly unique visitors.<p>Parse.ly is a fully distributed team, as described here: <a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;3203&#x2F;the-how-and-why-of-parse-lys-fully-distributed-team&#x2F;?utm_campaign=hn201707\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;3203&#x2F;the-how-and-why-of-parse-lys...</a><p>Our entire stack is in Python and JavaScript, and our team has innovated in areas related to real-time analytics, building some of the best open source tools for working with modern stream processing technologies. Our UX&#x2F;design team has also built one of the best-looking dashboards on the planet, using AngularJS and d3.js. You can see some screenshots: <a href=\"http:&#x2F;&#x2F;parse.ly&#x2F;tour?utm_campaign=hn201707\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly&#x2F;tour?utm_campaign=hn201707</a><p>Our distributed team is best-in-class and we happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly dashboards on my monitors: <a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>To see an example of how we work, check out the blog post, &quot;Whatever It Takes&quot;: <a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;46&#x2F;?utm_campaign=hn201707\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;46&#x2F;?utm_campaign=hn201707</a><p>As for the roles available:<p>Success Engineer - At Parse.ly, we think code + communication = success. The goal of a Success Engineer: ensure our customers are delighted with our products, through the wise application of technical know-how, engineering magic, and strong communication skills. The full job posting for that role is available here: <a href=\"https:&#x2F;&#x2F;weworkremotely.com&#x2F;jobs&#x2F;4874-success-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;weworkremotely.com&#x2F;jobs&#x2F;4874-success-engineer</a><p>Software Engineer - Are you a more advanced programmer with interest in data engineering who wants to work with Python, Storm, Spark, Kafka, Elasticsearch, and petabyte-scale datasets? Or, are you a user experience programmer who wants to build beautiful dashboards and data visualizations, using JavaScript, d3.js, Swift (iOS), and similar tools? If either of these teams sound appealing, then please send a cover letter, CV&#x2F;resume, and optionally links to projects or code, to the email address here: work@parsely.com.<p>For either role, when you email us, make sure to indicate which role you&#x27;re interested in and that you&#x27;re coming from this HN thread. Note that though Parse.ly is fully distributed team, we prioritize candidates in ET&#x2F;CT&#x2F;MT timezones (or close) and who have past experience working remotely.","time":1499098193,"type":"comment"}