{"by":"JackMorgan","id":14690986,"parent":14688684,"text":"SmartStream Tech | Software Developer | Center City, Philadelphia, PA | Full-Time, ONSITE<p>The ideal candidate is:\nLooking for fantastic work&#x2F;life balance - no stress, few meetings, no overtime, no assigned work, permanent 10% weekly research time ​<p>Polyglot-comfortable - doesn&#x27;t mind learning C#, F#, Java, JavaScript, Ruby, and sometimes working in all five in one day<p>Loves pair-programming&#x2F;TDD - is excited to work with a talented team - mentoring and being mentored 100% of the time<p>Tolerates occasionally grungy work needed to maintain an enormous C#&#x2F;F# banking application used by the majority of the world&#x27;s biggest banks<p>Comfortable working without a tech lead - we have no leads, every pair is trusted to design the best solutions without being told or supervised in a self-organizing team<p>Intrinsic desire to learn and improve - We are always learning and pushing into new areas: currently some are researching and writing proposals for an AWS-hosted version of our system. Several others are studying linear programming to better develop an in-progress optimization system using CPLEX. Others are studying dependent-typed programming with proof assistants in an experiment to formally prove parts of our system. A couple team-mates are doing broad improvements across our 4.6 million line codebase designed to make it more type-safe with fewer bugs.<p>Feel free to email me for more info at steven.shogren@smartstream-stp.com. The interview process is whiteboard-free, no memorization, no algorithms. We pair program together working on several small projects for a day.<p>We are a small team that opens up positions rarely: this is the first position we&#x27;ve opened up in years without a waiting list of pre-screened candidates. The pay for the current position is average for Philly for a developer with 3-5 years of experience. If you&#x27;ve got a lot more and are a really great fit let&#x27;s talk anyway and we&#x27;ll see what we can do. Worst case you get on the waiting list for the next position ;)<p>For more information about our self-organizing practices, see here: <a href=\"http:&#x2F;&#x2F;deliberate-software.com&#x2F;categories&#x2F;self-organization&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;deliberate-software.com&#x2F;categories&#x2F;self-organization&#x2F;</a>","time":1499112161,"type":"comment"}