{"by":"ryan53","id":14695734,"parent":14688684,"text":"FiftyThree (www.fiftythree.com) | Senior Software Engineer - Full Stack, Back End, and Front End | New York, NY | Full-time<p>We are FiftyThree, makers of creativity-boosting tools including the award-winning app, Paper, and companion stylus, Pencil. FiftyThree also happens to be a world-class web shop, building productivity tools for the modern workplace. Our latest app, Paste, is a web-based visual collaboration tool built from the ground up for Slack teams. We are hard at work at our next iteration of Paper and Paste features, and that&#x27;s where you come in.<p>Full Stack<p>You are a talented full-stack engineer looking to join a team of top-notch web developers. You enjoy building rich, dynamic, magical web applications across the entire stack. You have a passion for making data flow cleanly, efficiently, and synchronously across clients. You feel at home architecting complex client-side interactions that push the boundaries of performance. You are excited to ship updates and features to customers frequently.\n- <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fiftythree&#x2F;jobs&#x2F;643413#.WVuV_tPytjs\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fiftythree&#x2F;jobs&#x2F;643413#.WVuV_tP...</a><p>Back End Web<p>You are a talented back-end engineer looking to join a team of top-notch web developers. You enjoy building rich, robust, and performant back-end web applications. You have a passion for making data flow cleanly, efficiently, and synchronously across clients. You feel at home creating complex back-end services that interact with and integrate data coming from a constellation of external APIs and services. You are excited to ship updates and features to customers frequently.\n- <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fiftythree&#x2F;jobs&#x2F;671355#.WVuXHNPytjs\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fiftythree&#x2F;jobs&#x2F;671355#.WVuXHNP...</a><p>Front End Web<p>Build rich, dynamic, magical web applications. Work hand-in-hand with the design team to implement interfaces that look beautiful and adapt dynamically to all types of devices. Architect complex client-side interactions that push the boundaries of performance. Implement animations and transitions that make experiences in the browser come to life.\n- <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fiftythree&#x2F;jobs&#x2F;492901#.WVuXgdPytjs\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;fiftythree&#x2F;jobs&#x2F;492901#.WVuXgdP...</a>","time":1499175077,"type":"comment"}