{"by":"KenoFischer","id":14691845,"parent":14688684,"text":"Julia Computing | Compiler or Systems Engineer | Boston, MA | FULL-TIME | ONSITE<p>Julia is an exciting new language in the increasingly important field of mathematical computing. As machine learning becomes part of every programmer’s stack of tools, increasing demands are being put on programming languages and compilers to meet the need of simple and efficient mathematical computing. Julia Computing, one of the top contributors to the open source\nJulia programming language, is seeking compiler and systems engineers\nto take the julia programming language and its tooling to the next level.<p>We work at all levels of the software stack, from the hardware up, in order to support julia and its applications. Any experience working at the kernel (Linux primarily), toolchain, compiler, language, or developer tooling level, would be highly beneficial. Since tasks often span a significant range of this stack, interest in and the willingness to learn about the rest of the stack are required.<p>Knowledge of or previous experience with Julia is not required, but would be beneficial.\nHowever, experience working with systems-level tools (C&#x2F;C++&#x2F;Rust&#x2F;GDB&#x2F;perf etc) would\nbe highly desirable.<p>Substantial portions of this work will involve contributions back to existing open source projects (Julia&#x2F;LLVM&#x2F;Linux, libraries, etc.) or the development of new open source projects.<p>Example tasks may include:<p><pre><code>    - Working with the core language team on future versions of the julia programming language \n      (Don&#x27;t like something about the language? Here&#x27;s your chance to fix it!)\n    - Supporting and enhancing the performance of julia HPC applications at petascale and beyond\n      (Obsessed about performance? Us too! Come play with supercomputers)\n    - Enabling julia on next-generation hardware architectures and accelerators\n      (Like fancy new hardware? Want to play with it before everyone else? Can do!)\n    - Developing modern developer tooling (debuggers, profilers, static analysis&#x2F;verification tools)\n      (Think you can do better than the state of the art here? Come try it out!)\n    - Enhancing the compile-time performance of julia and the underlying LLVM compiler\n      (Cut down the iteration time for scientist using julia - help them come up with new ways to cure cancer, solve climate change or survey the sky faster)\n    - Developing novel programming models for diverse kinds of hardware\n      (What&#x27;s the best way to program all these crazy architectures? We don&#x27;t know yet, but we&#x27;re planning to find out - maybe you have the crucial idea)\n</code></pre>\nBoth senior and junior full-time positions are available. This advertisement\nis for our Boston, MA, USA location. There are no formal education requirements.\nWe are happy to sponsor US visas.<p>If this position interests you, or you have any questions, please contact us at\n<i>jobs@juliacomputing.com</i>","time":1499120028,"type":"comment"}