{"by":"kuldar","id":14694124,"parent":14688684,"text":"Pento (<a href=\"https:&#x2F;&#x2F;pento.dk\" rel=\"nofollow\">https:&#x2F;&#x2F;pento.dk</a>) | Full Stack Web Developer | REMOTE | SALARY: €40K – €55K<p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;pento&#x2F;jobs&#x2F;242469-full-stack-web-developer-javascript-go-remote\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;pento&#x2F;jobs&#x2F;242469-full-stack-web-developer-...</a><p>About us:\nWe&#x27;re building a new payroll&#x2F;HR product for the European market, starting with Denmark. A very conservative market with old competitors and products = tons of potential. We are 5 people on the team and hiring more in the coming months, so we&#x27;re in a very interesting growth phase. We have 150+ customers already and growing 30-40% each month. We are a remote team, which means that we have no office and you can work from wherever you want.<p>We&#x27;re looking for two full stack web developers to join our remote team. Ideally, you are a person who is not only proficient in frontend and backend work, but also have some experience in DevOps and system architecture. As you will be part of the early team, you should be a fast learner and be able to work in different roles.<p>Specific requirements:<p>- BS&#x2F;MS in Computer Science, Software Engineering or similar OR at least 3 years of professional development experience.<p>- Basic knowledge of Linux.<p>- A good understanding of internet basics (HTTP, TLS, DNS etc).<p>- An understanding of HTML&#x2F;CSS&#x2F;JS.<p>- Experience with frontend frameworks (eg. React, Angular), libraries (eg. Relay, Redux) and tools (eg. webpack).<p>- Experience with DBMS’s (we use Postgres).<p>- Experience with (or ability to learn fast) Node.js, Go.<p>- Experience with Docker.<p>- Basic knowledge of Docker orchestration tools (specifically Kubernetes).<p>- Knowledge of how to use git<p>- Knowledge of CI<p>- Curiosity and willingness to use and try out new tech.<p>Bonus:<p>- Experience with building and using microservices.<p>- Experience building performant web apps (through the entire stack)<p>Come build awesome stuff with us! ️","time":1499152358,"type":"comment"}