{"by":"vivekrkumar","id":14696439,"parent":14688684,"text":"Qlicket (<a href=\"https:&#x2F;&#x2F;www.qlicket.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.qlicket.com</a>) | Pittsburgh, PA &amp; New Delhi, India | Software Engineer - Java (New Delhi Office) | Fulltime Onsite<p>INTRO TO QLICKET<p>Qlicket is an intelligent WiFi platform that enables businesses to form a dialogue with customers and gain greater real-time insights into their behavior through its patented hardware and software solution.<p>Today, when customers post online reviews for offline establishments, it&#x27;s after they&#x27;ve left - when it&#x27;s too late for an establishment to be able to do anything. In hospitality, for example, 90% of customers read online reviews before deciding where to stay, and one bad review can cost an establishment up to 30 lost customers or $4,000 in lost revenue.<p>Qlicket makes it easy for establishments to capture feedback from guests when they are signing into the WiFi network. Establishments can then read and respond to this feedback in real-time, resolving any potential concerns.<p>We&#x27;re live in more than 100 establishments and have raised $600K to date.<p>THE OPENING<p>We&#x27;re looking for highly research oriented Java developers who can build and ship Restful web services. We want people who can really own the development space across all layers from frontend to backend and over all the development phases from request gathering to production rollout and maintenance. This is a full time position in Delhi.<p>KEY SKILLS<p>* Java EE 7 with exposure to JAX-RS, EJBs &amp; JPA preferred<p>* JSON, Ajax, spring, hibernate, CORS and html5<p>* Javascript with experience of jQuery, Angular and&#x2F;or Reactjs\nMySQL &amp; MongoDB<p>* Unit testing with JUnit or TestNG or Arquillian and exposure to Selenium<p>GOOD TO HAVE<p>* Administration experience of Any Java EE container like Wildfly, TomEE or Glassfish&#x2F;Payara<p>* Experience with building highly available and distributed cloud based Restful web services over AWS or GC<p>* Docker, Git, and Linux<p>Please email kumar@qlicket.com, tewari@qlicket.com, monika@qlicket.com and alok@qlicket.com if you&#x27;re interested.  Thank you!","time":1499182391,"type":"comment"}