{"by":"andytw","id":14697765,"parent":14688684,"text":"ThoughtWorks | Lead Mobile Engineers | New York, San Francisco, Chicago, Dallas, Denver, Atlanta | Full Time | On Site &amp; Travel | VISA transfer OK | www.thoughtworks.com&#x2F;<p>APPLY:<p>New York: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;208767\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;208767</a><p>San Francisco: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;479920\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;479920</a><p>Chicago: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;208775\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;208775</a><p>Dallas: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;641638\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;641638</a><p>Denver: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;641212\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;641212</a><p>Atlanta: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;641645\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;641645</a><p>ABOUT THOUGHTWORKS:<p>As software delivery consultants, we work with a variety of clients that hire us to solve complex and interesting problems. Each client we work with gives us a new perspective and a broad exposure to different technologies, which leads to a pretty unlimited learning environment. If you have a passion for exploring new technologies, chances are you’ll fit right in.<p>Our Lead Mobile Engineers partner with our clients to define their mobile strategy and are hands-on in building applications that can scale an enterprise system. We create enterprise mobile applications that are clean, well-tested, scalable and deployed in a CI&#x2F;CD pipeline.<p>WHAT WE’RE LOOKING FOR:<p>Ideal candidates have been working in the mobile space for a few years, have led a few mobile teams, can lead mobile strategy, and care about best practices like testing and continuous delivery. We are particularly interested in engineers with native iOS experience, especially Swift.<p>We have a strong preference for candidates with previous full stack development experience, as the nature of consulting means working on projects with a huge variety in scale, scope and technology. However, we are open to considering candidates without previous full stack experience if there is a strong desire to learn from our full stack developers, DevOps engineers, etc.<p>We work almost exclusively on client site providing a mix of delivery and consulting services, so you’ll travel extensively as part of your role.","time":1499196274,"type":"comment"}