{"by":"joergrech","id":14702372,"parent":14688684,"text":"Talentwunder | Senior Software Engineer (Groovy, Java, Akka) | Torstr. 33, Berlin, Germany | ONSITE, Full-Time | <a href=\"https:&#x2F;&#x2F;www.talentwunder.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talentwunder.com</a><p>We’re looking for skilled senior software engineers for our Groovy-based Web-Scraping system who care about efficiency, high-performant and maintainable software. Our challenges include scaling to support big data sets and servicing our users with up-to-date data in a user-friendly tool. We strive to create a fast yet reliable platform enabling our developers to continuously ship updates.<p>Requirements<p>* 3+ years experience in Web-Development using Groovy&#x2F;Java or experience in Web Scraping with HTML, CSS, and Javascript<p>* Experience with Akka, Akka Cluster or similar frameworks<p>* Experience with agile software development (Scrum&#x2F;Kanban)<p>* Plus: Proficiency in handling of multi-terabyte datasets with billions of documents<p>* Plus: Experience with cloud-based development using AWS, Azure, Google Cloud, Cloud Foundry, Docker or other container&#x2F;PaaS environments is a plus<p>* Plus: Experience with testing techniques<p>* Good communication skills in both German and English is a plus (one is sufficient)<p>What are we offering?<p>* Great work-life balance, including flexible working hours without travelling<p>* Competitive salary with stock options – connecting you directly to the success of the company<p>* An education budget to spent on conferences, books, online tutorials, meetups, etc.<p>* A hardware budget to buy the MacBook&#x2F;Laptop, Monitor, etc. of your choice<p>* Free drinks, chocolate &amp; fruits<p>Interested? We’re excited to receive your application! Please send your resume, your earliest possible starting date, your salary expectations and – if available – your profile&#x2F;portfolio on Github, Stack Overflow, Linkedin, Behance, etc. to Jörg (joerg |at| talentwunder -dot- com)!","time":1499262821,"type":"comment"}