{"by":"cybertoast","id":14701279,"parent":14688684,"text":"LocalProjects.com | Creative Engineer (Back-end) | Full-time | ONSITE | VISA | Python&#x2F;Flask, C&#x2F;C++, Go, ReactJS, DevOps, SysOps, Full-stack development, Machine Learning<p>Local Projects is an award winning &quot;Experience Design&quot; firm - we create engaging and innovative experiences using a variety of technologies (see <a href=\"http:&#x2F;&#x2F;localprojects.com&#x2F;work\" rel=\"nofollow\">http:&#x2F;&#x2F;localprojects.com&#x2F;work</a>). Building these experiences requires a skillset which combines creative thinking (working with graphic, interaction and motion designers) with solid computer-science and engineering practices, to ensure the solutions are efficient, long-term stable, and easy to maintain.<p>Due to the nature of our engagements, we&#x27;re often solving &quot;startup scale problems&quot;, but simultaneously need to consider long-term stability and industry-standard best-practices.<p>We are looking for candidates passionate about building well-engineered systems and infrastructure to support rich front-end experiences. This includes everything from content&#x2F;asset management systems, to stable monitoring&#x2F;maintenance dashboards, to reusable machine learning systems. Because our focus is on creating innovative experiences, we&#x27;re constantly experimenting and prototyping with new technologies.<p>As a Creative Engineer at Local Projects you will be actively involved in a combination of tasks which include: back-end development (Python&#x2F;Flask, Go, PHP, bash, C++, etc), Machine Learning solutions, DevOps (Ansible, Chef, Salt, etc), and SysOps (network architecture and setup, AWS, etc).<p>You will be working in a creative environment, collaborating with architects, designers, and hardware engineers and will be encouraged to cross domains, even to contribute to the ideation process.<p>You must have at least 3 years working experience with the following: Python&#x2F;Flask; C, C++, Java or C#; RDBMS &amp; MongoDB; DevOps solutions, and SysOps.<p>Please apply by emailing your CV, your github account, and any references to public-facing work to jobs@localprojects.com.","time":1499250831,"type":"comment"}