{"by":"phantomas1234","id":14720336,"parent":14688684,"text":"DTU Biosustain | Synthetic Biology | Copenhagen Area, Denmark | Onsite | Full-time | 450k-550k DKK | VISA<p>Full-stack Web Developer for Synthetic Biology Design Platform<p>We&#x27;re looking for a software engineer to help build a web-based software platform for data-driven design of microbial cells and communities. DTU Biosustain conducts research on metabolic engineering and synthetic biology of microbial and mammalian cell factories for chemical and therapeutic protein production.<p>With advances in synthetic biology, genomes can now be edited at unprecedented speed and fidelity allowing making multiple changes in the same genome at the same time. This increases the need for computational tools to design cells and communities of cells analogous to the tools used in Computer Aided Design (CAD) of cars, buildings and other man-made objects.<p>A prototype of the platform is hosted at <a href=\"https:&#x2F;&#x2F;app.dd-decaf.eu\" rel=\"nofollow\">https:&#x2F;&#x2F;app.dd-decaf.eu</a>. We furthermore enjoy open source software and most of our code is publicly available at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;biosustain\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;biosustain</a> and <a href=\"https:&#x2F;&#x2F;github.com&#x2F;dd-decaf\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;dd-decaf</a>. You can find our Scrum board here <a href=\"https:&#x2F;&#x2F;waffle.io&#x2F;DD-DeCaF&#x2F;scrum\" rel=\"nofollow\">https:&#x2F;&#x2F;waffle.io&#x2F;DD-DeCaF&#x2F;scrum</a>.<p>Our stack currently, in no specific order: AngularJS, Angular Material, Typescript, Python 3 (including its scientific stack), PostgreSQL, Docker, Travis-CI, D3.<p>To read more and apply, go to: <a href=\"http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;about&#x2F;job&#x2F;job?id=64a0e1d2-ad98-49b1-b603-c369fcfd434b\" rel=\"nofollow\">http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;about&#x2F;job&#x2F;job?id=64a0e1...</a>","time":1499449102,"type":"comment"}