{"by":"charlesweitzer","id":14748698,"parent":14688684,"text":"Voleon | Head of Recruiting - Quantitative Hedge Fund | Berkeley, CA | Onsite www.voleon.com<p>The Voleon Group is a technology-driven investment firm employing cutting-edge statistical machine learning techniques. We are looking for a creative, analytical, and experienced Head of Recruiting to drive our strategic growth in every functional area.<p>Responsibilities:<p>· Architect and implement a logical, data driven approach to growing the capacity of our recruiting team.\n· Ensure that our recruiting goals are met.\n· Standardize our agreements with external recruiting agencies.\n· Provide overall management and guidance for all recruiting related efforts, including on-campus, conferences, and trade shows.\n· Architect and execute a comprehensive global sourcing strategy.\n· Actively participate in the branding of our firm. From our website, company overview, executive profiles, job descriptions, brochures, you will be a driving force.\n· Work with HR to craft and deploy effective employee retention strategies across multiple functional domains.\n· Understand the legal issues related to recruiting and hiring.\n· Propose, adapt and track metrics for team productivity and performance.\n· Provide training to staff across all functional areas ensuring the efficacy of each stage in our hiring process.<p>Requirements:<p>· 10+ years of experience in all aspects of recruiting, with an emphasis on designing and managing the overall recruiting effort.\n· Demonstrated success interacting with and recruiting executive talent.\n· In-depth experience in recruiting technical and research professionals.\n· Extensive experience driving the process of hiring meetings, creating agendas, and keeping individuals and teams on track.\n· Ability to manage complex workloads effectively.\n· Experience training, mentoring, and coaching junior and senior recruiters.\n· Demonstrated leadership skills and experience.<p>Interest finance is essential, but experience in finance is not a primary hiring factor. Benefits and compensation are highly competitive. We can be very flexible for the right person.<p>Email CV&#x2F;request for more info to charles@voleon.com.","time":1499812849,"type":"comment"}