{"by":"PhilDG","id":14773612,"parent":14688684,"text":"Deep Genomics | Bioinformatician | Toronto Canada | ONSITE, <a href=\"https:&#x2F;&#x2F;www.deepgenomics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.deepgenomics.com&#x2F;</a><p>Deep Genomics | Molecular Geneticist &#x2F; Computational Biologist | Toronto Canada | ONSITE, <a href=\"https:&#x2F;&#x2F;www.deepgenomics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.deepgenomics.com&#x2F;</a><p>Deep Genomics is a Toronto based startup aiming to revolutionize genome analysis using machine learning. It was founded by a team of scientists from the University of Toronto led by Dr. Brendan Frey, a world-leading researcher in the area of machine learning and genome biology.<p>Bioinformatician:<p>We are seeking a highly motivated bioinformatician with solid scripting skills to help with tasks like variant annotation, genomics data-set integration and other tasks. A successful candidate will have the following:<p>* BSc or MSc in Computer Science, Bioinformatics or related fields<p>* Understanding of basic concept of molecular biology and human genetics<p>* Solid knowledge of Python and Unix shell, some knowledge of R<p>Molecular Geneticist:<p>We are seeking a highly motivated molecular geneticist with computational skills to help evaluate molecular effect predictors using ClinVar and other variant databases, curate variant effects from the literature, help interpreting results from whole exome and whole genome sequencing. A successful candidate will have the following:<p>* MSc or PhD in Molecular Genetics or related fields  \n* Familiarity with variant annotation resources (e.g. RefSeq, Annovar, dbSNP, SIFT, UCSC genome browser)<p>* Experience with human genetic variant interpretation and curation<p>* Basic working knowledge of at least one scripting language (e.g. R, Python, Perl, Ruby) to perform tasks such as importing and filtering a data-set, computing simple classification performance metrics<p>Please apply at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;deepgenomics\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;deepgenomics</a> \nThanks!","time":1500070202,"type":"comment"}