{"by":"dsr_","id":8394772,"parent":8394339,"text":"Cambridge MA - Sysadmin in a DevOps world<p>Smartleaf is a small, profitable, and privately held company which helps some of the largest firms in finance manage portfolios for their clients. More details can, of course, be found in the obvious place:\n<a href=\"http://www.smartleaf.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.smartleaf.com</a>.<p>We are looking for an experienced general sysadmin to join the IT&#x2F;Ops team.  This is a full-time, on-site position with shared on-call responsibility.<p>This team handles everything that could possibly fall under the IT&#x2F;Operations umbrella in a small company. On the operations side, we keep the company delivering the service our customers are paying for. Linux servers (mostly Debian, a few Red  Hat-ish Oracle servers) at colo data centers run our software.  If it&#x27;s mission critical, we manage it ourselves, from DNS through load balancing to web servers, databases and storage. We&#x27;ve been committed to reducing workload via automated configuration management for a long time -- so long, in fact, that we wrote our own deployment system and GPL&#x27;d it. Now we&#x27;ve moved systems automation over to Chef.<p>The system runs 24&#x2F;7, but we have an available maintenance window every weekend.  Every night is a fresh re-deployment. The monitoring system is in charge of waking one of us up, if need be. Long term, we need to wake up about once a month.<p>We make sure that everyone can telecommute; it beats going in on a snow day.<p>Our technology stack includes Debian Linux, Chef, Oracle, Ruby on Rails, C++, Perl, git. We use RequestTracker for ticketing. Routers and firewalls are from Juniper. Our employees mostly use Macs, with a bare handful of Windows desktops to support. There are no Microsoft servers\nat all. We are interested in teaching you what you need to know and learning new things from you.<p>You must have:<p>* significant Linux&#x2F;UNIX systems administration experience - 6 years or longer<p>* preferably with Debian or Ubuntu and a Red Hat-style Linux distribution<p>* the ability and desire to track down problems and solve them<p>* solid organizational skills and time management<p>* a desire to learn<p>* and the ability to teach<p>* good shell scripting and one or more of Perl, Python, or Ruby<p>* strengths in several areas that complement our other team members<p>* excellent written English<p>* an existing legal right to work in the USA<p>You must be:<p>* clever, competent, and kind.<p>We offer a competitive salary, fully paid healthcare premiums and three weeks of vacation plus holidays. Office hours are flexible and partial work-from-home can be arranged. We are nice people.<p>Please send cover letters and resumes to future@smartleaf.com in plain text or PDF. In your cover letter, please tell us about an interesting technical  problem that you have solved, in a way which makes us excited to learn more. If you ask questions, we will answer.","time":1412174823,"type":"comment"}