{"by":"jacobmorse","id":8394549,"parent":8394339,"text":"Brainspace Corporation, Dallas, Texas - (Full time, Local)<p>At Brainspace (<a href=\"http://www.brainspace.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.brainspace.com</a>), our goal is to meaningfully connect the world. We&#x27;re building the next generation of web and mobile applications on top of our groundbreaking (patented) semantic platform. We&#x27;re passionate about creating the best possible technology and user experiences.<p>Do you want to come to work every day and creatively solve big market-driven problems?  We work hard and play hard. We’re looking for the best, and offer competitive salary and benefits.<p>Senior Front-End Engineer<p>We&#x27;re looking for an expert front-end engineer to join our team, bringing passion and pixel perfection as we build innovative experiences.  Be a team leader on development tasks. You should be able to work independently, as well as mentor junior developers. You’ll assist in defining timelines and development tasks.<p><pre><code>    * Integrate with internal and external REST API&#x27;s\n    * Strong command of HTML5, CSS, and Javascript\n    * Mastery of the DOM and jQuery\n    * Experience with multiple MVC JS frameworks like Knockout and Angular\n    * Experience implementing complex front ends across browsers\n</code></pre>\nOn top of that, it would be great if you also:<p><pre><code>    * Have experience in cloud environments like AWS\n    * Are familiar with LESS and SASS\n    * Have design skills\n</code></pre>\nSenior Software Engineer<p>We&#x27;re looking for a senior Software Engineer to join our team, bringing passion and perfection in helping us build innovative products.  You will be working with really cool Machine Learning and Natural Language Processing technologies, as well as using tools like Lucene&#x2F;ElasticSearch, Jersey, and maybe some Scala or Clojure.<p>You need to have the following:<p><pre><code>    * Expertise in Java development\n    * Strong OO development skills\n    * Expertise in build RESTful API&#x27;s\n    * SQL Skills\n    * Familiarity with agile processes\n</code></pre>\nIt would be great if you have:<p><pre><code>    * C# skills\n    * Experience with PostgreSQL, Tomcat, and Jersey\n    * Javascript or Ruby knowledge\n    * Machine Learning or Natural Language Processing skills\n    * Experience in the Legal&#x2F;eDiscovery market\n</code></pre>\nIf either of these opportunities look interesting to you, please contact us at careers@brainspace.com","time":1412173673,"type":"comment"}