{"by":"EmilLondon","id":8394442,"parent":8394339,"text":"CITYMAPPER (LONDON, UK). <a href=\"https://citymapper.com\" rel=\"nofollow\">https:&#x2F;&#x2F;citymapper.com</a>\nFull time software engineers in London. OK to relocate exceptional candidates.<p>Recent HN post! (help us solve the problems mentioned) Citymapper is what happens when you understand user experience<a href=\"https://news.ycombinator.com/item?id=8238260\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8238260</a><p>We&#x27;re building one of the most important apps on mobile, an urban transport app built on the back of open data, to help navigate and use cities. We&#x27;re a VC-backed startup (Balderton, Index, Greylock, Connect) based in London with a team with backgrounds from Google, academia and startups.<p>We&#x27;re looking for great people first and foremost, but especially the following roles:<p>- Routing. We&#x27;re reinventing getting from A to B in the world of mobile, multi modal and real-time data.<p>- Infrastructure engineer. Be responsible for our platform in the cloud, shape the tool chain, and ensure that the moving parts of our system can communicate, so that we can expand to all the cities in the world.<p>- Android and iOS developers. We&#x27;re reimagining mobile interfaces and developing all the features that we dream about. You care about the &quot;little big details&quot; and know the grotty implementation details required to make things work across a range of devices and future platforms.<p>- Data pipeline&#x2F;data science&#x2F;analytics. We&#x27;re building an omnivorous transport data processor that fuses together loads of data sources, and a psychic city brain.<p>- Software engineers. We&#x27;re looking for great engineers to solve a range of other big problems, including search, data analysis, natural language processing. We use a lot of Python, and some C and Java.<p>If interested, please contact me at emil@citymapper.com or apply at <a href=\"https://citymapper.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;citymapper.com&#x2F;jobs</a>.","time":1412173045,"type":"comment"}