{"by":"eggsyntax","id":8394396,"parent":8394339,"text":"National Climatic Data Center - <a href=\"http://www.ncdc.noaa.gov\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ncdc.noaa.gov</a> - Asheville, North Carolina<p>Scientific software developer, full-time<p>NCDC is the world&#x27;s largest active archive of weather and climate data, and a leading source of climate research. I&#x27;m part of a new project that aims to take some of the key software here and bring it in line with modern software standards (a lot of it has grown organically over many years, and has been mostly written by scientists, not professional developers). In some cases that means rewriting it; in others it may mean surrounding it with better infrastructure: automated tests, better configuration management, better deployment practices, thorough documentation etc. It&#x27;s a small team (you&#x27;d be the fourth dev), and a really strong one. We care a lot about bringing better software practices to our day to day work (for the sake of our own sanity and morale) and to NCDC as a whole (because the global climate record deserves nothing less).<p>We&#x27;re looking for someone who&#x27;s smart, passionate, and likes making important things better. You&#x27;ve got to be comfortable picking up new languages on the fly, and new domain knowledge as well. Good (English-language) communication skills are a must. Some background in the physical sciences or scientific software would serve you well, as would experience with large refactoring and rewriting projects. Decisions about languages and tools are being made on a project-by-project basis, and you&#x27;d be a big part of those decisions (all else being equal, we have a fondness for Python, but performance and user community buy-in have a big effect on language choice for these projects). You should be able to get behind the idea of using best-practice approaches for projects where reliability and long-term viability matter a <i>lot</i>.<p>Asheville (<a href=\"http://www.exploreasheville.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.exploreasheville.com&#x2F;</a>) is an amazing little mountain city nestled in the Blue Ridge Mountains. It&#x27;s a fantastic place to live. You could think of it as a smaller version of Portland, OR and not get it too wrong, although it&#x27;s definitely got a character all its own.<p>Please feel free to contact me with questions (eggdavisjs(at)novonon(dot)com), or you can apply for the position at <a href=\"http://gst.iapplicants.com/ViewJob-624553.html\" rel=\"nofollow\">http:&#x2F;&#x2F;gst.iapplicants.com&#x2F;ViewJob-624553.html</a> . No H1B or remote.","time":1412172608,"type":"comment"}