{"by":"mchesler","id":8394875,"parent":8394339,"text":"TheLadders’ mission is to match people with the jobs that are right for them.  In order to do that, we need a strong engineering team.  We’re looking for a DevOps Engineer to join our Production Operations team.  If you’re the type of person who believes in automating any task you’d perform more than once, enjoys having access to every aspect of an IT environment, and believes that a new system isn’t deployed until it’s highly available, monitored and documented, come check us out.<p>TheLadders is looking for a DevOps Engineer that has a passion for problem solving and a sixth sense when it comes to troubleshooting production systems. Our systems process millions of job seekers and jobs every day.  Some of the technologies we use are Puppet, VMware, CentOS, PureStorage, Git and Icinga.  Our DevOps team supports the production operation of multiple technologies such as Storm, ElasticSearch and Riak in our perpetual task of finding the right person for the right job.<p>Responsibilities of the DevOps Engineer:<p>Maintain and improve our fully virtualized production environment\nStrive to squeeze every last bit of performance out of our compute and storage infrastructure\nCollaborate with your team to design and implement solutions to support sustained growth of our job matching platform<p>Basic Qualifications of the the DevOps Engineer:<p>5+ years of Linux or Unix-based systems engineering\nCS degree or equivalent work experience\nStrong proficiency in one or more of: perl, ruby, bash\nTake ownership of the infrastructure you build<p>Preferred Qualifications of the DevOps Engineer:<p>Experience with VMware ESXi and vCenter\nPuppet in more than a passing capacity\nA thorough understanding of Linux performance tuning<p>Based in SoHo, we have one of the most open and advanced Agile workplaces in New York City. We run a fully virtualized environment and believe that changes to our systems should never be made by hand. Change and improvement are limited entirely by your desire to see it happen.<p>Beyond the day to day, we believe in helping our engineers continue to learn and grow. We invest heavily in training, conferences, and seminars for our team members. Some of the conferences and training seminars attended by our team members this year include AWS Summit, PuppetConf, WWDC, No Fluff Just Stuff, Strangeloop, Immersive Domain Driven Design, API Strategy Conference and many others.<p>In addition, you will have ample opportunity to learn from and teach those around you, both day to day and in our weekly technology conclaves.<p>We have an awesome work environment that includes perks like:<p>Unlimited vacation days! Yes, unlimited!\nA well-stocked kitchen and catered meals\nExciting events including holiday parties, picnics, talent shows, pumpkin carving, and more\nCompany-sponsored athletic teams\nCompetitive salary, bonus and stock options\nHealth&#x2F;Dental&#x2F;Vision Insurance\n401(k)<p>Find out more about our team by visiting: <a href=\"http://dev.theladders.com/ourteam\" rel=\"nofollow\">http:&#x2F;&#x2F;dev.theladders.com&#x2F;ourteam</a><p>Read about what we’re working on at <a href=\"http://dev.theladders.com\" rel=\"nofollow\">http:&#x2F;&#x2F;dev.theladders.com</a> and <a href=\"http://github.com/theladders\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;theladders</a><p>Read about our open positions or begin the application process at: <a href=\"http://careers.theladders.com\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.theladders.com</a>","time":1412175424,"type":"comment"}