{"by":"diggan","id":8394427,"parent":8394339,"text":"<p><pre><code>   == Barcelona, Spain -- Typeform -- Full time frontend engineer ==\n</code></pre>\nTypeform looking for frontend developer to innovate forms on the web as we know it<p>Typeform is a startup in sunny Barcelona, creating the next generation of forms and surveys on the web. We are heavily focused on great UX with the user in mind and we’re now looking for the best frontend developers Barcelona and Spain has to offer us to help us build a scalable and maintainable frontend.<p>As a frontend engineer at Typeform, you would be responsible for creating and innovating on every cornerstone in the frontend platform at Typeform. This means you should be exceptional at writing Javascript (with Coffeescript) that works without any problems in the most popular browsers (at least IE8 and up!) but also HTML and CSS that works excellent for all our current and future users.<p>You should have a solid understanding of software architecture and design patterns. You should know OOP from the inside out and would be great if you have a great desire to innovate, learn about new technologies and also be ready to take a part in the building of the product.<p><pre><code>   == Currently, we use (but not limited to) the following technologies ==\n</code></pre>\n* HTML and CSS (via LESS)<p>* JavaScript (via Coffeescript)<p>* PHP<p>* Go<p>* Docker<p><pre><code>   == We have the following requirements for you as a developer ==\n</code></pre>\n* Multiple years of experience with frontend development<p>* A strong will to learn more about the technologies you use<p>* Expert OOP programmer<p>* Experience in writing automated tests to ensure functionality and quality<p>* You love Git without any borders<p>* Making yourself understandable in the english language in a business situation (medium &#x2F; high level of english)<p>* Know how to develop web application for cross-browser&#x2F;device usage<p>* Good understanding of graphics programming<p>* You are a highly flexible individual that likes to take a pro-active role to innovate, learn and participate in a exciting startup, in a exciting city that plans to do great things<p><pre><code>   == If one or more items below matches you, you’re perfect! ==\n</code></pre>\n* Expert in TDD or similar methodology<p>* Familarity in working Agile<p>* Degree in computer science<p>* Knowledge in PHP&#x2F;nodeJS<p>* Good knowledge about UX<p><pre><code>   == Please fill in this questionnaire to apply for the job position ==\n</code></pre>\n<a href=\"https://jobs.typeform.com/to/e7NNgU\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.typeform.com&#x2F;to&#x2F;e7NNgU</a><p><pre><code>   == In case you haven’t heard of typeform yet… ==\n</code></pre>\n<a href=\"http://www.smashingmagazine.com/2014/09/26/sci-fi-frustrations-flash-and-forms-the-typeform-story/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.smashingmagazine.com&#x2F;2014&#x2F;09&#x2F;26&#x2F;sci-fi-frustratio...</a><p><a href=\"http://web.appstorm.net/reviews/data-management/typeform-a-b..\" rel=\"nofollow\">http:&#x2F;&#x2F;web.appstorm.net&#x2F;reviews&#x2F;data-management&#x2F;typeform-a-b...</a>.<p><a href=\"http://www.genbeta.com/a-fondo/un-vistazo-a-typeform-la-revo..\" rel=\"nofollow\">http:&#x2F;&#x2F;www.genbeta.com&#x2F;a-fondo&#x2F;un-vistazo-a-typeform-la-revo...</a>.<p><a href=\"http://www.webcreatorbox.com/webinfo/typeform-jpn/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.webcreatorbox.com&#x2F;webinfo&#x2F;typeform-jpn&#x2F;</a><p>if you have any questions, please email jobs@typeform.com or me directly at victor@typeform.com","time":1412172870,"type":"comment"}