{"by":"theatrus2","id":8394718,"parent":8394339,"text":"Twitter - Software Engineer - San Francisco, CA<p>My team is Observability at Twitter; we work on monitoring and we’re looking for distributed systems engineers and full-stack engineers. We are one of the largest monitoring stacks in the industry, writing up to 15 million metrics per second for all production services at Twitter. We also have a front-end service that is used every day by most engineers at Twitter. We write our services in Scala, use a state-of-art Cassandra-like database called Manhattan, and if you join, you’ll get to work on challenging problems from day one.<p>Here are some of the things we’ve done in the past 12 months:<p>- Made our alerting execution service seamlessly fail over across datacenters<p>- Implemented a temporal set membership service for our database to keep track of metric groupings<p>- Added tiering policies for metrics based on their automatically-derived significance<p>- Added hybrid online&#x2F;offline processing of data for different use cases<p>- Optimized the time-series query language to make reads more efficient<p>- Made an asynchronous query processor to support expensive queries with lower latency requirements<p>- Wrote a client-side agent that collects and reports metrics to the storage system<p>Our team is 12 people, including back-end, front-end, full-stack and reliability engineers. You can find out more by reading last year’s article here: <a href=\"https://blog.twitter.com/2013/observability-at-twitter\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.twitter.com&#x2F;2013&#x2F;observability-at-twitter</a>. More formal list of requirements for the position is here: <a href=\"https://about.twitter.com/careers/positions?jvi=oO0WXfwr,Job\" rel=\"nofollow\">https:&#x2F;&#x2F;about.twitter.com&#x2F;careers&#x2F;positions?jvi=oO0WXfwr,Job</a>.<p>Engineers from foreign countries, H-1B initiations and transfers are welcome. You can reach out to me directly at yann@twitter.com.","time":1412174536,"type":"comment"}