{"by":"answers","id":8394670,"parent":8394339,"text":"St. Louis, MO\nAnswers.com \nPHP Developer\nMeaghan.Cale@Answers.com<p>nswers’ is seeking a Software Development Engineer to work with the core technologies powering our infrastructure. The successful candidate will be part of an engineering team devoted to the design and development of high-traffic web applications, backend processing systems, various supporting tools, and administrative front ends. This position will be located in our St. Louis, MO office.<p>Responsibilities:\n* Contribute architecture input to new system components, rewrites of legacy systems, etc.\n* Write thorough, comprehensive technical and high-level documentation\n* Engineer and implement new product features for web-based applications using LAMP\n* Optimize and enhance web applications with tens of millions of page requests, high volume data logging and processing needs, and high performance requirements\n* May require an on-call rotation to support production<p>Requirements:\n* Experienced LAMP developer (Linux, Apache HTTP Server, MySQL, PHP)\n* Proficient test planning for web applications \n* Detailed knowledge of daemons, cron jobs, and system requirements for high traffic, fault tolerant, 24x7 websites, supporting a service-oriented architecture\n* Experience with MVCs \n* Basic XML, TCP&#x2F;IP, NFS, YML, mod_JAVA, and Apache application server knowledge<p>Required Personal Skills:\n * Excellent written, verbal, and non-verbal communication skills\n * Strong initiative - capable of working on a self-sufficient basis and identifying areas of potential technical improvement\n * Self-management - capable of prioritizing and executing tasks\n * Problem solving - ability to diagnose and resolve technical issues<p>Preferred:\n*  4+ years experiences in design, development and operation on web applications or websites from the front end to the back end.\n * Expertise in data structures and algorithm evaluation\n * Experience with Test Driven Development\n * Scrum&#x2F;Agile development\n * Experience with other languages&#x2F;systems\n * BS&#x2F;MS degree<p>Job Benefits:\nDevelop the technology that power millions of daily unique visitors\nCollaborate within a team of fervent business and technology enthusiasts\nWork with the largest internet players, building software that significantly impacts vertical markets\nFun and exciting atmosphere where hard work is recognized and rewarded<p>Compensation:<p>Highly competitive base salary + bonus + opportunity for Incentive Equity Units (similar to stock options with favorable tax treatment)<p>More reasons to join Answers:\n• Company provided equipment, such as up-to-date laptops and cell phones\n• Liberal paid time off, and&#x2F;or the ability to earn more based on performance\n• Commuter benefits: transportation by train, subway, bus or ferry\n• 100% company principle paid health insurance -- Free options!\n• Company paid group dental and vision insurance\n• Company paid life and disability insurance\n• Liberal employee performance bonuses\n• Paid time off (PTO) policy - 15 days to start\n• 10 holidays company paid\n• 401k savings plan","time":1412174254,"type":"comment"}