{"by":"boyd","id":8394915,"parent":8394339,"text":"One Codex (YC S14) – Genomic search and data platform. San Francisco, CA (<a href=\"https://www.onecodex.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.onecodex.com</a>).<p><pre><code>  ==============\n  == About Us ==\n  ==============\n</code></pre>\nWe’re a software and biology start-up building a global data backbone and search platform for genomics – an essential piece of infrastructure for a world in which we increasingly understand health, disease, and our environment by transforming biology into data. Our first application area is pathogen detection – working with doctors, epidemiologists, and public health officials to identify and characterize the bacteria and viruses that threaten our health. And already, we’ve attracted users at many of the top public health and research organizations across the globe.<p><pre><code>  ===============\n  == About You ==\n  ===============\n</code></pre>\nWe’re looking for talented software engineers to help us build towards our vision for a global genomics data network and enable widespread <i>in</i> <i>silico</i> diagnostics. Specifically, we’re interested in folks with a passion for and depth of experience in one or more of the following areas:<p>1) Full Stack Engineering: We will be building everything from developer-facing APIs to easy-to-use end applications for doctors and public health officials. You care about everything from elegant APIs to compelling data visualizations. Python experience preferred (we currently use Flask for our web backend).<p>2) Distributed Systems: We’re building systems for organizing and indexing billions to trillions of genomic fingerprints across the entire tree of life. You’re passionate about data structures, efficient computational solutions, and distributed systems (and don’t mind the occasional bit twiddling). We’ve built some cool initial tech in C, Nimrod, and Python (probabilistic data structures, Docker pipelines for reliably running bioinformatics workflows, etc.), and are excited about the extensive greenfield opportunities here.<p>3) Genomics &#x2F; Computational Biology: We are tackling hard problems at the intersection of microbiology, genomics, statistics, and computer science. You have research experience or another strong connection to these fields, understand current bioinformatics tools and approaches (and their limits), and have worked extensively with next-generation sequencing data. Ideally, you also have some intuitions and strong hypotheses about how bioinformatics tools can scale for petabyte-sized reference sets.<p><pre><code>  ===\n</code></pre>\nYou’ll be one of our first hires and directly shape our technology choices, product, and business. If you’re interesting in working on large-scale data challenges of both scientific and societal importance, please send us a note at careers@onecodex.com or reach out to me directly at nick@onecodex.com.","time":1412175664,"type":"comment"}