{"by":"answers","id":8394709,"parent":8394339,"text":"St. Louis, MO\nQA Engineer\nAnswers.com\nMeaghan.Cale@answers.com<p>The primary duties of this position will include manually testing web applications, Answers.com in particular.  This will entail using MySQL to verify data and Linux to deploy and verify code.  This is an entry-level position at Answers with room for vertical growth.  This is a great way to get your foot in the door of a fast growing and evolving web technology company headquartered in Saint Louis.<p>Summary of essential job functions:\nQuality Assurance Engineers will test daily releases, write regression test plans for new products, and work closely with developers to ensure quality on the Answers.com website.<p>Minimum requirements:\nA Bachelors &#x2F; Associates degree in CS&#x2F;IS&#x2F;CE. This requirement can be supplemented with experience.\nAbility to compose SQL queries for testing and debugging.\nComfortable working in the Linux &#x2F; Unix command line.\nCan understand the big picture for end-to-end data flow and regression testing.\nHunger to learn and grow as a QA Engineer in a fast paced tech startup atmosphere.<p>Preferred:\nThe ability to accurately review PHP &#x2F; JavaScript code and understand the algorithms behind the change. Limited web development experience is a plus.\nExperience working in a LAMP stack environment.\nThe above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.<p>Job Benefits:\n* Develop technology that reaches millions\n* Fun and exciting atmosphere where hard work is recognized and rewarded<p>Compensation:\nHighly competitive base salary + bonus + opportunity for Incentive Equity Units (similar to stock options with favorable tax treatment)<p>More reasons to join Answers:\n• Company provided equipment, such as up-to-date laptops and cell phones\n• Liberal paid time off, and&#x2F;or the ability to earn more based on performance\n• Private office space, garage parking, and other office-related benefits\n• Commuter benefits: transportation by train, subway, bus or ferry\n• 100% company principle paid health insurance -- Free options!\n• Company paid group dental and vision insurance\n• Company paid life and disability insurance\n• Liberal employee performance bonuses\n• Paid time off (PTO) policy - 15 days to start\n• 10 holidays company paid\n• 401k savings plan","time":1412174471,"type":"comment"}