{"by":"stevewepay","id":8394486,"parent":8394339,"text":"WePay.com - Palo Alto, CA - Full-time (Relocation assistance provided)<p>WePay is looking for talented and motivated software engineers to join our rapidly expanding team. Our transaction volume has more than tripled year-over-year, and we need your help to scale our customers’ payments to even higher levels over the next few years. We are eager to grow our team of engineers who love programming, take pride in the quality of their code, and are at least decent at ping pong (rock climbing is a nice-to-have).<p>Requirements:<p>You must be a great coder that loves to write efficient and maintainable code. We believe that great coders can adapt to whichever new language they need to, whether it’s Java, Python, PHP, Javascript, C++, Scala, Ruby, or any other SEO-optimized buzzword, so we don’t care what background you have (unless you have solely coded in brainfxck). And in fact, we have outgrown our current PHP-MySQL environment and are in the process of architecting our next-generation service-oriented architecture, so we will be excited to make full use of your experience and perspectives as we select the right tools for the job.<p>You must be able to take complete ownership over a bug, feature, or entire project and drive it to completion. We have to trust that each of our team members can work in relative independence because we hate micro-managing.<p>You must be open-minded, flexible, and have a pragmatic approach to solving problems. The payments industry can be baffling at times, so we value people who can persevere and continue to make progress with a positive attitude.<p>One or more of the following specialized skills would be awesome:<p>* Front-end expertise, including JavaScript, CSS, AngularJS<p>* Back-end expertise, including extensive database experience<p>* High Availability and Distributed Systems<p>* Big Data experience, including Hadoop and&#x2F;or Storm<p>* Machine Learning and Modeling<p>* Experience in Risk and Fraud Detection<p>* Experience in payments and PCI compliance<p>* Expertise in Security<p>* Team Lead experience<p>If you have any interest or questions about WePay, please contact me directly at steven at wepay.com. I&#x27;m an engineer, not a recruiter, so your email will get a response.","time":1412173269,"type":"comment"}