{"by":"answers","id":8394703,"parent":8394339,"text":"St. Louis, MO\nAnswers.com\nJava Developer\nMeaghan.Cale@answers.com<p>Answers’ is seeking a Java Developer to work with the core technologies powering our infrastructure. The successful candidate will be part of an engineering team devoted to the design and development of high-traffic web applications, backend processing systems, various supporting tools, and administrative front ends. This position will be located in our St. Louis, MO office.<p>The ideal developer will work closely with product and engineering management to satisfy user interface requirements, and work with QA to design tests and walkthroughs.<p>Responsibilities:\nContribute architecture input to new system components and maintenance&#x2F;rewrites of legacy systems\nWrite thorough, comprehensive, technical and high-level documentation\nEngineer and implement new product features for web-based applications using Java and Spring MVC\nOptimize and enhance web applications with tens of millions of page requests, high volume data logging and processing needs, and high performance requirements\nRequired Experience:\nJava development\nCSS, HTML, JavaScript\nDemonstrated knowledge of OOP concepts\nRDBMS concepts and schema design\nSpring&#x2F;Hibernate\nTomcat Application Servers and Apache Web Servers\nGood working knowledge of networking protocols (HTTP, HTTPS, FTP, TCP&#x2F;IP)\nTroubleshooting ability (e.g., should be able to debug a system from front end to back end)\nUnderstanding of common data formats such as CSV, TSV, JSON and XML\nDetailed knowledge of system requirements for large-scale, high traffic, fault tolerant, 24x7 websites, supporting a service-oriented architecture\nProficient test planning for web applications \nClient-server architectures\nVCS (preferably perforce, git)\nPreferred:\n4+ years experiences in design, development and operation on web applications or websites from the front end to the back end.\nExpertise in data structures and algorithm evaluation\nHands on experience with Test Driven Development (TDD) and testing frameworks (e.g., junit)\nBuild tools (ant, maven, gradle)\nScrum&#x2F;Agile development process\nContinuous Integration systems (Hudson, Bamboo)\nIntelliJ IDEA\nKnowledge of non-relational data storage systems (e.g., Cassandra)\nLAMP Development\nDetailed knowledge of daemons and cron jobs\nExperience with other languages&#x2F;systems\nBS&#x2F;MS degree\nJob Benefits:\nDevelop the technology that power millions of daily unique visitors\nCollaborate within a team of fervent business and technology enthusiasts\nWork with the largest internet players, building software that significantly impacts vertical markets\nFun and exciting atmosphere where hard work is recognized and rewarded\nCompensation:  Highly competitive base salary + bonus + opportunity for Incentive Equity Units (similar to stock options with favorable tax treatment)<p>More reasons to join Answers: (Varies by region)<p>Company provided equipment, such as up-to-date laptops and cell phones  \nLiberal paid time off, and&#x2F;or the ability to earn more based on performance  \nPrivate office space, garage parking, and other office-related benefits  \nCommuter benefits: transportation by train, subway, bus or ferry  \n100% company principle paid health insurance -- Free options!  \nCompany paid group dental and vision insurance  \nCompany paid life and disability insurance  \nLiberal employee performance bonuses  \nPaid time off (PTO) policy - 15 days to start  \nFlex Hours (Varies by dept)  \n10 holidays company paid  \n401k savings plan","time":1412174393,"type":"comment"}