{"by":"atiffany","id":8395207,"parent":8394339,"text":"REMOTE Developers at Twin Technologies - <a href=\"http://twintechs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;twintechs.com</a><p><pre><code>  ★★★★★★★★★★=========================================\n\n  ★★★ Help the U.S. government save trees and tax dollars!\n\n  ★★★★★★★★★★=========================================\n\n  ======================\n  ★ About the project:\n  ======================\n</code></pre>\nWe are seeking a few good men and women to help build a “best of breed” enterprise form processing platform. Our client is a top government organization that has continuously been at the forefront of the E-government initiatives.  Your work will be visible and touched by customers throughout the federal government every day. We’re looking for someone who can take ownership of automating resolution of common server problems as well as improve the stability and performance of the application.<p><pre><code>  ======================\n  ★ About us:\n  ======================\n</code></pre>\nTwin Technologies is an elite technology consultancy that delivers business optimization, e-Commerce, and custom engineering solutions that place a premium on customer experience and technical excellence. We hire the world’s best designers, developers, and project managers to solve big problems for our clients, helping them grow and innovate through business transformation.<p>Our culture is very open, with a focus on craftsmanship, trust, innovation, and integrity. Our virtual environment allows us to hire the best people, but requires transparency and a drive for performance among a distributed team while also promoting work&#x2F;life balance.<p><pre><code>  ======================\n  ★ You will:\n  ======================\n\n  + Work remotely as a member of a highly-effective Agile team.\n  + Influence technical decisions in upcoming projects.\n  + Develop automated solutions to intelligently maintain server health.\n\n  ======================\n  ★ You have:\n  ======================\n\n  + Strong coding skills and a computer science background.\n  + Experience using Java and&#x2F;or other JVM languages.\n  + Excellent communication skills and good habits about carefully documenting your work.\n  + A keen eye for spotting inefficiencies and a desire to eradicate them with process and code.\n  + A sense of pride and craftsmanship in the work you deliver.\n  + Bonus: experience with advanced server automation scripting.\n\n  ======================\n  ★ Tech we use and teach:\n  ======================\n\n  + Java, Jersey, JPA, Dropwizard, JBoss.\n  + Adobe LiveCycle.\n  + Jenkins, Maven.\n  + MSSQL.\n  + Server automation tools &amp; languages that you recommend.\n\n</code></pre>\nThis is one of many roles we are currently hiring for at Twin Technologies.  You can always find more here: <a href=\"http://twintechs.com/about-us/contact-us/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;twintechs.com&#x2F;about-us&#x2F;contact-us&#x2F;careers&#x2F;</a><p>Send your resume to andy.tiffany@twintechs.com to apply for this one.","time":1412177340,"type":"comment"}