{"by":"sb_ba","id":8395351,"parent":8394339,"text":"Blue Apron (New York, NY) - Fulltime<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is an NYC-based startup delivering original recipes and premium, seasonal ingredients needed to prepare them, in exactly the right proportions. We&#x27;ve raised $58M from First Round Capital, Bessemer Venture Partners, and Stripes Group [1]. Last year, Forbes named us one of the hottest startups of 2013 and we&#x27;ve only continued our rapid growth in 2014 [2].<p>Our engineering team creates software to manage the forecasting, purchasing, preparation, and shipment of new fresh ingredients every week, delivering over 800,000 meals nationwide monthly.<p>The nature of our business carries with it unique supply chain and logistical challenges that require purpose-built solutions and data analysis.<p>Current stack: Ruby, Rails, Ember, PostgreSQL, RSpec, Haml, Sass<p>We&#x27;re hiring:<p>- UX&#x2F;Frontend Developers: HTML, CSS, JavaScript (Ember would be awesome but not required) - <a href=\"http://www.blueapron.com/pages/jobs?gh_jid=14848\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=14848</a><p>- Software Engineers: Ruby, Rails, Ember - <a href=\"http://www.blueapron.com/pages/jobs?gh_jid=11091\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=11091</a><p>- DevOps Engineer: This person will design a high availability, distributed AWS architecture to serve our customers, fulfillment centers, and e-commerce operation. (Chef, Puppet, Ruby or Python exp. is a plus) - <a href=\"http://www.blueapron.com/pages/jobs?gh_jid=25367\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=25367</a><p>About you:<p>- You&#x27;ve taken features or products from concept to completion and have experience working with production web applications.<p>- You communicate your ideas clearly, and are capable of designing and implementing complex, scalable solutions.<p>- You are always learning and are excited at the prospect of mastering new technologies and techniques.<p>This role comes with health, dental, and vision insurance, a flexible vacation policy, and competitive salary and equity. To apply, visit our site (blueapron.com&#x2F;jobs) and drop an application; it only takes about 60 seconds.<p>[1] <a href=\"http://blogs.wsj.com/venturecapital/2014/04/30/blue-apron-raises-50m-to-deliver-do-it-yourself-meal-kits-recipes/\" rel=\"nofollow\">http:&#x2F;&#x2F;blogs.wsj.com&#x2F;venturecapital&#x2F;2014&#x2F;04&#x2F;30&#x2F;blue-apron-ra...</a>\n[2] <a href=\"http://www.forbes.com/pictures/emjl45himd/blue-apron-4/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;pictures&#x2F;emjl45himd&#x2F;blue-apron-4&#x2F;</a>","time":1412178376,"type":"comment"}