{"by":"vaxtrac","id":8395414,"parent":8394339,"text":"Software Engineer at VaxTrac (<a href=\"http://vaxtrac.com\" rel=\"nofollow\">http:&#x2F;&#x2F;vaxtrac.com</a>) | Washington, DC | Full-time<p>--------------------------------------------------------------------------------------------<p>Job Description: VaxTrac is looking for talented software engineers who share our passion for making a difference in the world. We build tools to improve the delivery of health care to those that need it most.<p>We are looking for those who:<p>+ are committed to using their skills to generate real social impact.<p>+ have an interest and passion for emerging technologies and novel use cases.<p>+ thrive in loosely structured environments.<p>+ share the conviction that we can make the world just a little bit better.<p>Roles and Responsibilities<p>+ Core design and development of applications for frontline immunization workers<p>+ Co-development of our core mobile application with partner organizations<p>+ Integration of custom applications with third-party frameworks<p>+ Basic quality assurance and documentation<p>+ Soliciting feedback and triaging bugs reported from the field<p>+ Secondary technical support of global program staff Skills and Requirements<p>+ Unparalleled, demonstrable programming skills<p>+ Full stack experience with an eye for UI and UX design<p>+ Finds ways to proactively contribute to all phases of development with limited supervision<p>+ Willingness to travel and spend time in remote corners of the globe<p>Bonus Points<p>+ Demonstrable expertise in Android development<p>+ Experience with Django, Pyramid or other web-based framework<p>+ Experience building for limited resource environments<p>+ Familiarity with front-end web development and Javascript<p>+ Practical experience with a NoSQL database<p>+ Exposure to CommCare or MOTECH APIs<p>+ Love of travel<p>VaxTrac is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.<p>To apply for this position, please email your updated resume and cover letter as attachments to careers@vaxtrac.com. Selected candidates will be contacted for an initial interview. Thank you for your interest!","time":1412178859,"type":"comment"}