{"by":"FlashFunders","id":8395611,"parent":8394339,"text":"FlashFunders - Santa Monica, CA\n<a href=\"http://flashfunders.theresumator.com/apply\" rel=\"nofollow\">http:&#x2F;&#x2F;flashfunders.theresumator.com&#x2F;apply</a><p>FlashFunders is a Santa Monica-based online equity funding platform and we’re hiring experienced full-stack Ruby on Rails engineers to join our small, energetic and cohesive team, to help us re-envision how startups raise capital. You&#x27;ll hit the ground running, become an integral member of the team, and start contributing towards our goal of becoming the industry standard in online capital raising. Some of the things you’ll be working on include:  Simplifying the investment experience  -  Integrating with state-of-the-art banking APIs using modern tools  -  Crafting an intelligent, intuitive user experience<p>Here are a few of the reasons why we think you’ll enjoy working here:<p>-Competitive Salary + Equity + Benefits + Relocation<p>-Paid-vacation, sick leave &amp; personal days<p>-We are VC-backed and very well funded<p>-Additional perks for the new gal&#x2F;guy include New Macbook Air, 27” Apple Monitors (fit for royalty), Snacks and drinks up the wazoo, Friday beverages every Friday at 5:00 (Fridays at Five)<p>-Join our small team, make a BIG Impact<p>Now, tell us a little about yourself, we’d like to see candidates with the following experience: Full-stack developer\n4+ years development experience,\n2+ years working with Ruby on Rails\nExperience with the rest of our stack: Ruby, Javascript, Postgres, HTML&#x2F;CSS, Heroku,\nBachelors or Masters in Computer Science preferred,\nExperience working in an agile environment, If you think you have what it takes, drop us a line - we’d love to discuss the possibility of you working at FlashFunders!<p>FlashFunders&#x27; mission is to democratize private capital markets -- improve efficiency and access to capital for entrepreneurs and provide all investors with access to high growth investment opportunities. FlashFunders provides startups with free template investment documents, a platform to publicly market their offerings (in an SEC compliant manner), FDIC insured escrow accounts to receive investments from accredited investors which are verified by FlashFunders, document management, and help with all closing procedures when they get funded (issuing shares, filing forms, etc). The best part about FlashFunders is there&#x27;s no cost for a startup to create and market an offering -- FlashFunders&#x27; business model is predicated on receiving the right to invest at the same terms as all other investors.","time":1412180286,"type":"comment"}