{"by":"jonomillin","id":8395568,"parent":8394339,"text":"DroneDeploy - <a href=\"http://www.dronedeploy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dronedeploy.com</a> - San Francisco, SOMA<p>We are on a mission to take the complexity out of using unmanned vehicles and make them powerful, simple, and safe tools that everyone can use. We&#x27;ve created some really exciting technology that could change the world. We&#x27;re building a world-class engineering team and looking for more talented people to join us.<p>Being a part of DroneDeploy means working hard and having fun. We like moving quickly and value engineers who can drive an idea from inception to production. We work in a dog-friendly office in SOMA with a kitchen full of drinks and snacks, including plenty of hot sauce and beef jerky! We have a rooftop patio for team lunches and weekly BBQs. When we’re not in the office, you can find us out flying drones, playing indoor soccer, or on an overnight team trip.<p>If you want to work with great people, flying robots and seriously cool technology, check out our open positions below.<p>We&#x27;re immediately looking to take on:<p><i>Full Stack Engineer</i> (Python + JavaScript) - FULL-TIME: We want people who can execute and get things done fast while still scrutinizing performance and reliability. You should work well in an agile workflow by breaking down tasks. You will need to communicate clearly with the team and be hungry and willing to work with new technology. You should be self-directed and willing to take on responsibility.<p><i>UI&#x2F;UX Design Engineer</i> - FULL-TIME: You will be responsible for changing the way people interact with drones by building functional, beautiful interfaces for drone control and data exploration on both desktop and mobile. You should be able to clearly articulate design decisions.<p><i>Test Engineer</i> - FULL-TIME: We want someone dedicated to high impact testing, and maintaining a top quality code base. You will be working on constructing and maintaining a system to test and deploy software for drones incorporating live hardware. You will also be responsible for building testing environments for UI, API, platform and full mock drone flights.<p>and soon we&#x27;ll be looking to take on people for:<p><pre><code>    - Business Development\n    - Geomatics Engineers\n    - Video&#x2F;PhotoGrammetry Engineers\n    - DevOps Engineers\n\n</code></pre>\nbut most importantly:<p>We are always looking for smart motivated people that share our vision. We can provide the environment for you to learn what you need to know.<p>We were in AngelPad 2013 with $2M+ in funding from SoftTech, Data Collective, Redpoint and DFJ.<p>More job information available here: <a href=\"https://www.dronedeploy.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dronedeploy.com&#x2F;jobs</a>, or jump the queue and email Nick directly: nick@dronedeploy.com","time":1412179977,"type":"comment"}