{"by":"askhr","id":8395592,"parent":8394339,"text":"URBANSPOON | Seattle, WA (Visa offered)<p>Come join our great team especially if you love to eat!<p>Us<p>1 billion shakes and counting.  Urbanspoon is the leading app and web site dedicated to helping over twenty million consumers each month discover the best restaurants and food in multiple countries around the world.  We have excellent restaurant information and recommendations from our customers as well as from professional critics and bloggers, and we’re looking for a Technical Product Manager to join a talented team in taking our apps and services to a new level.  Urbanspoon is a dynamic yet stable startup located in the Eastlake neighborhood of Seattle, near South Lake Union.<p>The Role<p>The Technical Product Manager will be deeply involved in defining and executing the evolution of our product strategy.   We are looking for an experienced product manager who will contribute to the product vision, translate the vision into detailed product roadmaps, lead the cross functional delivery of the product and drive the post launch analysis.   You will play a critical role in our product transformation as we move beyond restaurant discovery to also helping our customers discover great food and dining experiences anywhere worldwide.<p>Your Task<p>+ Define and manage the product roadmap for new initiatives and features, and build internal excitement for the product vision\n+ Build business cases by identifying market opportunities, evaluating the competitive landscape and understanding user needs.  Build models to predict product KPIs and drive backlog prioritization\n+ Partner with your colleagues in user experience, engineering, customer operations, business development, finance, and marketing teams to launch new products and features\n+ Write rock solid user stories.  Define, scope and prioritize the backlog with an understanding of tradeoffs and business impact\n+ Develop clear acceptance criteria, and act as the agile product owner for determining product and feature readiness\n+ Be willing and able to wear many hats in an entrepreneurial environment\n+ Technical knowledge; solid understanding of architecture concepts, scope tradeoffs and evaluating new opportunities with technical team members.  Our technologies include Ruby on Rails, HTML&#x2F;CSS, iOS, Android, and Elastic Search\n+ Demonstrated ability to work cross-functionally with various stakeholders, and strong project management skills\n+ Excellent problem solving, organizational and prioritization skills<p>Required<p>+ Bachelor’s degree\n+ 5+ years of software Product Management &#x2F; Program \n+ Management experience, 2+ in a technical role in an agile development environment\n+ Strong analytical and quantitative skills; ability to use hard data and metrics to back up assumptions, recommendations and drive actions\n+ Strong verbal and written communication skills\n+ Passionate about building great products and solving customer and business problems<p>Preferred Experience<p>+ CS degree or advanced degree in related field (MBA)\n+ Scrum Master certification\n+ Experience working with and building external APIs\n+ 3+ years of consumer facing Web Product Management experience or Mobile App product experience with mass market consumer products\n+ Experience driving customer adoption on web and mobile: SEO, SEM, CPI mobile acquisition, app store marketing, etc\n+ Proficient with Google Analytics for web and mobile, or equivalent web&#x2F;mobile analytics tools\n+ SQL Proficiency<p>Apply at our website: <a href=\"http://www.urbanspoon.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.urbanspoon.com&#x2F;careers&#x2F;</a>","time":1412180141,"type":"comment"}