{"by":"pron","id":8396838,"parent":8394339,"text":"Bay Area | Developer Evangelist | Parallel Universe (YC S12) <a href=\"http://paralleluniverse.co\" rel=\"nofollow\">http:&#x2F;&#x2F;paralleluniverse.co</a><p>Parallel Universe is building next generation server-side open source infrastructure software, which lets developers write simple code that is extremely performant and scalable. We believe while hardware architecture changed drastically almost a decade ago, software hasn&#x27;t caught up. Current software clashes with hardware, and requires more effort to be expended on scaling rather than on business logic. The problem is most severe in server-side software that ingests real-time data, and needs to respond to a very large number of concurrent requests at low latencies. It facilitates software that is harmonious with modern hardware -- with multi-core and multi-cache, with the storage hierarchy and the IO-to-processing ratio -- rather than software that fights the hardware at every turn. The result is applications that require far less hardware, while at the same time provide much greater performance and headroom for growth.<p>As a developer evangelist, your job would be to help drive adoption of the Parallel Universe stack. The job is a mix of marketing, coding, sales, and geeking out. On the job you will:<p>* Write demos and benchmarks, and blog about them<p>* Write introductory blog posts and tutorials<p>* Speak at (and organize) developer events and hosted tech-talks<p>* Study the problems facing potential users, and help direct our software to best address those problems<p>* Provide support and guidance on technical forums and social media<p>* Provide on-site support and guidance for customers<p>* Build and cultivate relationships with US companies<p>Requirements:<p>* Experience writing software for the JVM, especially in Java (knowing Clojure is a plus)<p>* Strong familiarity with modern server-side architectures<p>* Participation in developer communities<p>* Strong technical writing skills<p>* Public speaking experience<p>* Strong social skills and an outgoing personality<p>* Residence in the San Francisco Bay Area<p>You will work from home, but travel in the Bay Area (and occasionally in the rest of the US) to visit companies and participate in events. We offer a competitive salary (with benefits) and equity.<p>To apply, email jobs@paralleluniverse.co","time":1412189728,"type":"comment"}