{"by":"natgordon","id":8396298,"parent":8394339,"text":"BabyList - Downtown Oakland, CA (2 blocks from 12th Street BART)<p>BabyList (<a href=\"http://babyli.st\" rel=\"nofollow\">http:&#x2F;&#x2F;babyli.st</a>) makes having your first baby less overwhelming, more creative and most importantly more delightful. We have a large and rapidly growing user base of passionate parents-to-be who are making important purchasing decisions for one of the biggest events in their lives. The baby industry is massive and ripe for disruption. Our core product is an easy to use registry that let’s parents-to-be add anything they can find on the internet. Our users LOVE this product.<p>&gt;&gt; Senior Front-end developer:<p>We&#x27;re looking for a senior developer to lead the development of our website. You know how to create great user experiences on the web using client-side code&#x2F;frameworks and css. You will work with our designer and backend developer to add new features to BabyList and build brand new products from scratch. Our stack is Ruby on Rails, MySQL, and CoffeeScript&#x2F;Javascript&#x2F;jQuery. We&#x27;re looking for someone who has a lot of coding experience and expert-level fluency in at least one programming language (you don&#x27;t have to be great at Ruby right now).<p>We&#x27;re offering meaningful equity, a competitive salary, benefits, and relocation expenses.<p>If you’d like to find out more, email me at natalie@babyli.st<p>&gt;&gt; Junior developer intern (INTERN):<p>The Internship:\nYou’ll work out of our office in Oakland for 12 weeks. The work will be a split 50&#x2F;50 between admin stuff (that we really, really need help with) and writing real production code. The internship is paid and can lead to a full-time job. This program has been very successful with two interns already.<p>You:\nYou’re a junior developer. You have some coding experience. You can clone our Rails code base and start to make small changes. This is a good fit for someone before or after an intensive developer bootcamp.<p>You are extremely motivated to learn and become a better developer. You’re a great writer and communicator. You have high-energy and are a positive person. You are good at multi-tasking and are comfortable with ambiguity.<p>To Apply:\nSend me an email (to natalie@babyli.st) that has:\n- A very short paragraph describing your coding background with a link to something that is live and running that you created. If you don’t have anything live, tell me what the most awesome thing you’ve built is.<p>- A very short paragraph about what your goals are. Be honest, instead of telling me what you think I want to hear.<p>- What is something else, unrelated to tech, that you’ve done that was hard and is cool.<p>- A link to your linkedin.com profile.","time":1412185376,"type":"comment"}