{"by":"spicyj","id":8396953,"kids":[8401310,8399282,8400216,8397140],"parent":8394339,"text":"Khan Academy — Mountain View, CA (we also love interns, and remote is a possibility)<p>We&#x27;re a small, non-profit tech startup bringing a free, world-class education to anyone, anywhere.<p>Here&#x27;s a testimonial we received last week:<p>==================================<p>I am 52. I returned to school almost twenty years ago and did quite well--but I had taken care of all my math requirements 15 years before that and my degree is about as far from math as one can get. So I had not seen the inside of a math classroom for more than thirty years when I decided not long ago that I wanted to review high school math. Listening to Sal&#x27;s explanations have made this so easy it is as though I had remembered all of it this whole time!<p>I am disabled now, and have no means to continue formal studies in much of anything, but I am now learning the calculus and linear algebra I was planning on studying when I was much younger--before my college career ran off the rails for an extended time. Thank you Sal (and the internets) for letting me remain a student! Keep this place running; I want to be able to hang around here until I am no longer able to hang around anywhere anymore.<p>==================================<p>Every month we get hundreds of letters like this from people in all walks of life who are thankful for our free, high-quality educational content. Most of you reading this are familiar with Sal&#x27;s videos, but we also have hundreds of videos by other teachers, partnerships with organizations like MoMA and the California Academy of Sciences, and a huge library of interactive exercises. Over 20 million math problems are done every week on our site.<p>A few things we&#x27;re currently working on building right now:<p>– The next version of our personalized learning dashboard [1] to make the UI more consistent across subjects and to help people learn better<p>– Improved knowledge models so we can better know what you know and don&#x27;t know [2]<p>– Infrastructure improvements to make the site more reliable and faster for our millions of visitors every month [3]<p>– Better tools for our content creators to allow them to make thousands of engaging, interactive exercise problems without knowing how to code [4]<p>– A major revision to our iOS app to let students practice skills on the go (or in a classroom with iPads!)<p>You&#x27;ll be part of a small team working alongside both &quot;celebrity&quot; devs (like jQuery creator John Resig and Google&#x27;s first employee Craig Silverstein) and many more who you haven&#x27;t heard of but who are also really awesome.<p>==================================<p>We&#x27;re especially looking for new product designers and mobile devs but we have a handful of other positions open -- take a look and see if anything suits you.<p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> and mention that you&#x27;re coming from HN. Feel free to ask me here if you have questions about applying or about KA in general. Unfortunately we can&#x27;t sponsor visas right now unless you&#x27;re from Canada, Australia, or Mexico.<p>[1]: <a href=\"https://www.khanacademy.org/about/blog/post/58354379257/introducing-the-learning-dashboard\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;about&#x2F;blog&#x2F;post&#x2F;58354379257&#x2F;intr...</a><p>[2]: <a href=\"http://mattfaus.com/2014/05/improving-khan-academys-student-knowledge-model-for-better-predictions/\" rel=\"nofollow\">http:&#x2F;&#x2F;mattfaus.com&#x2F;2014&#x2F;05&#x2F;improving-khan-academys-student-...</a><p>[3]: <a href=\"http://www.alangpierce.com/blog/2014/07/07/bigbingo-khan-academys-new-bigquery-backed-a-b-testing-framework/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.alangpierce.com&#x2F;blog&#x2F;2014&#x2F;07&#x2F;07&#x2F;bigbingo-khan-aca...</a><p>[4]: <a href=\"https://github.com/Khan/perseus\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Khan&#x2F;perseus</a>","time":1412190643,"type":"comment"}