{"by":"ianbicking","id":8397346,"kids":[8400669],"parent":8394339,"text":"Mozilla – San Francisco, Mountain View, other locations, and REMOTE (American timezones preferred) – OS Engineer (aka programmer)<p>Cloud Services For Firefox OS team is hiring for a Firefox OS Client Developer.<p>The Cloud Services For Firefox OS team is building end-to-end services (front and backend) for Firefox OS (Mozilla&#x27;s mobile operating system) and other Firefox platforms.  These are services such as backup, push services, and account services.  As we build these services we&#x27;re also helping expand the platforms; we&#x27;re not satisfied until anyone can build the same kinds of services that we do on the web platform.  You&#x27;ll be working together with a small team sharing a handful of projects.<p>Client development happens both in Gaia (the set of HTML and JavaScript applications that make up much of Firefox OS) and in Gecko (Mozilla&#x27;s core platform that underlies Firefox on desktop, Android, and OS).  JavaScript will be the primary language you use, but this is not a JavaScript job.  Mozilla loves JavaScript so much that it uses JavaScript in ways that you are unlikely to be familiar with.  You should be open (even excited!) to work with large and complex codebases, and to work within the process that coordinates the Mozilla company and community.<p>Working at Mozilla is a unique opportunity:<p>1. Everything you do will be open source and in public repositories.\n2. You can be as open and public about your work as you choose: we strive to make our processes open within the company and beyond the company to the community and world.\n3. We love the web without reservation.  It&#x27;s not that we just like hanging out with the web, or that we love what the web can do for us: Mozilla and the web are married for life.\n4. Mozilla is a mission-led organization.  That means lots of things, but part of what it means is that when you interact with people, or even disagree with them, you also know that we&#x27;re here for the same reason and that we share a motivational foundation.\n5. Mozilla is super friendly to remote work.  And even if you don&#x27;t want to start remote, this gives you options in the future.\n6. Mozilla is focused on its impact on the world, and we&#x27;ll support you in your own ambitions to have impact.<p>Requirements:<p>1. BS in Computer Science or equivalent experience; being able to show examples of your work is the best evidence.\n2. Experience with web technologies: HTML, CSS, JavaScript.\n3. Experience with methods common in open source world: version control, integration testing, etc.\n4. Mobile experience is a plus.\n5. Experience or readiness to interact with large codebases and distributed teams.\n6. Excellent written and verbal communication skills.<p>We are open to both junior and senior candidates for this position.<p>You can work remotely or in one of our regional offices (<a href=\"https://www.mozilla.org/en-US/contact/spaces/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mozilla.org&#x2F;en-US&#x2F;contact&#x2F;spaces&#x2F;</a>).  North American timezones are preferred so you can be more compatible with the rest of the team.  If remote, experience with remote work is strongly desired.<p>––––––––––<p>To apply: <a href=\"https://hire.jobvite.com/j/?aj=ojPBZfws&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j&#x2F;?aj=ojPBZfws&amp;s=Hacker_News</a> – if you have any questions you can contact me (ibicking@mozilla.com) or even better ask here (I&#x27;ve answered a few questions in <a href=\"http://bit.ly/1ueasn6\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1ueasn6</a> as well).","time":1412194021,"type":"comment"}