{"by":"realdlee","id":8397350,"parent":8394339,"text":"BuildZoom (YC W13) - San Francisco, CA - Full Time\n== Full Stack Engineers ==<p>BuildZoom is a marketplace for remodeling and construction services that is changing the way people approach home improvement. With over 650k monthly users, we&#x27;re one of the fastest growing start-ups in an enormous market.<p>We&#x27;re looking for engineers who can work throughout the stack. Responsibilities will range from server configuration to front-end implementation and everything in between.<p>About the team and our culture:<p>1. Product-first approach to the business with a dev team lead by talented, experienced engineers \n2. We move fast and engineers are expected to write exceptionally clean, functional code \n3. We&#x27;re metrics driven: everyone on the team is able to contextualize their effort against key business goals and indicators<p>Examples of problems we are currently working on:<p>1. Building a clean, simple user interface that sits on top of millions of transactional records, allowing consumers to see current remodeling projects and contractors in their neighborhood \n2. Enhancing the accuracy of our machine learning classifier, which infers what types of work contractors specialize in, based off their transactional histories. \n3. Developing a budgeting app to help consumers understand the cost and value associated with their home improvement projects<p>Our ideal candidate will have:<p>1. Extensive experience with medium-to-large scale RoR deployments \n2. Strong fundamentals: OOP and application architecture \n3. Experience with scaling for exponential user growth \n4. Appreciation for quality, maintainability, and performance 5. Attention to detail and personal pride in your work<p>Pluses:<p>1. Familiarity with system administration, database design, full-text search engines, HTML, CSS, JS \n2. Experience designing and implementing APIs for web and mobile \n3. Experience developing online marketplaces<p>To apply, e-mail jobs@buildzoom.com with whatever you think would help us best understand your background and accomplishments.","time":1412194030,"type":"comment"}