{"by":"chadg_77","id":8397928,"parent":8394339,"text":"Software Engineer (also hiring for devops and data engineering positions)\nLocation: Santa Barbara, CA\nType: Full Time\nMin. Experience: Entry Level\nAbout Us:<p>Email me directly: cgoldberg at findthebest.com<p>FindTheBest is a research engine that collects, structures, and connects the world&#x27;s data -- 60 billion pieces of information to date -- to give people all the information they need to research with confidence. The company&#x27;s desktop site, mobile site, and embeddable widgets let people thoroughly research thousands of topics on one intuitive interface. Launched in late 2010, FindTheBest has quickly become a leading research destination with 22 million monthly visits. FindTheBest is headquartered in Santa Barbara, California.<p>We&#x27;re backed by two VC firms: Kleiner Perkins Caufield Byers and New World Ventures. Our founder&#x2F;CEO previously started DoubleClick (sold to Google for $3.1B). Located in Santa Barbara (“Silicon Beach”), we&#x27;re fast-growing, and best of all, fun. Employees enjoy snacks, a game room, quick access to the beach, and daily classes with a personal trainer.<p>About the Position:<p>As a software engineer, you will join a small team of elite developers working to build the fastest, most comprehensive, and most user-friendly data platform living on the semantic web. You will commit code several times a day, and your work will be immediately seen by millions of users. We launch fast, and we iterate quickly and will rely on you to build killer products (not features) at mind-numbing speeds. And occasionally, you will debate with your colleagues about how best to quantitatively rate Pokemon Cards (<a href=\"http://pokemon-pokedex.findthebest.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;pokemon-pokedex.findthebest.com&#x2F;</a>). Still working to crack that problem...<p>Please include your GPA (cumulative, and Major&#x2F;Minor) and your graduation date (if you are still in school) on your resume or cover letter.<p>Qualifications:<p>Expertise in at least one major programming language: JavaScript, PHP, Java, Python, C++, Ruby, etc.\nCommand of a server-side programming language (PHP on Apache preferred), and a solid understanding of the HTTP protocol, and the DOM (CSS, HTML)\nProficiency in SQL (MySQL) and NoSQL (MongoDB) databases\nComfort working in a UNIX environment (or excited to learn)\nDesire to build and prototype new products and features\nPluses: a love for optimizing even the fastest code, minor delusions of grandeur (Napoleonic complex acceptable)\nOlympic-level-proficiency in ping pong (strong kick-ball skills acceptable)\nStart Date: As soon as possible<p>Pay:  Salary will be based on experience.<p>Benefits: Equity for every employee, 3 weeks paid vacation, 11 paid company holidays, and competitive medical, dental, and vision insurance. We offer a lunchtime workout class 4x&#x2F;week and an evening yoga class 2x&#x2F;week, along with catered Taco Mondays and Bagel Tuesdays and a fully stocked snack kitchen.<p>All Positions: <a href=\"http://www.findthebest.com/careers/explore-opportunities\" rel=\"nofollow\">http:&#x2F;&#x2F;www.findthebest.com&#x2F;careers&#x2F;explore-opportunities</a><p>Email me directly: cgoldberg at findthebest.com","time":1412199503,"type":"comment"}