{"by":"whichdan","id":8397397,"parent":8394339,"text":"Vista Higher Learning - Boston - Systems Architect<p>Why join us? We at Vista Higher Learning are proud to say that we’re not just another publisher. We’re the leading specialized language publisher for U.S. and Canadian higher education and secondary school markets whose first-hand knowledge of languages and diverse cultures sets us apart from other publishers. We’re passionate about developing educational materials that incorporate authenticity and culture. We bring a fresh new approach to teaching languages by integrating technology, design, content, and pedagogy to make learning easier, more practical, and more rewarding. With current programs in Spanish, French, Italian and German Vista Higher Learning is committed to helping people communicate across languages and cultures.<p>Summary<p>Under the direction of the Sr. Director, Engineering, the Systems Architect role oversees and helps to shape the service-oriented vision of our Maestro 3 learning management platform. Working with the Engineering and Information Technology (IT) teams, the Systems Architect transforms high-level architectural plans into actionable blueprints. In this role, the Systems Architect must be able to articulate and communicate complex ideas clearly and coordinate multiple concurrent projects across teams. Experience with distributed systems and service-oriented architectures strongly preferred.<p>Key responsibilities include:<p>Specific responsibilities include the following:<p>- Planning available, reliable, fault-tolerant architectures<p>- Performing infrastructure performance analysis and tuning<p>- Reviewing failures, evaluating causes, and implementing preventative measures<p>- Assisting in planning capacity and forecasting demand<p>- Trouble-shooting systems and product issues<p>- Training and mentoring engineers and developers<p>Desired Skills:<p>- Experience shipping high-quality, performant, well-tested applications in a consumer-facing environment<p>- Demonstrated systems-level troubleshooting and performance tuning<p>- Experience with Ruby&#x2F;Rails or similar MVC framework<p>- Strong Unix administration and command line experience<p>- In-depth knowledge of two or more of: Redis, Memcached, Mysql, Postgres, MongoDb<p>- Strong written and verbal communication skills<p>Education and Experience:<p>- Bachelor’s degree or equivalent experience. Master’s degree preferred<p>- At least three years of experience in systems architecture, preferably with experience in educational markets<p>- Team building, leading, and &#x2F; or management experience preferred<p>- Experience working with Agile processes within a product development environment<p>If this sounds like you, join our team and you’ll enjoy a competitive compensation program, a comprehensive benefits package and an exciting work environment in a growing company located within easy access to the “T”. Please introduce yourself by sending your resume, cover letter and salary requirements to: hr@vistahigherlearning.com.","time":1412194422,"type":"comment"}