{"by":"RiskIO","id":8397475,"parent":8394339,"text":"[Chicago, IL or San Francisco, CA] Rails Engineer - Risk I&#x2F;O<p>We are a venture-backed startup in Chicago, and we are looking for smart engineers to join our team. This is an early-stage opportunity with a healthy amount of equity and the chance to have a significant impact on technical process and company culture. We’re looking for well-rounded engineers who are comfortable working throughout our entire stack.<p>This position is an opportunity for an engineer to take ownership of significant technical areas in a small, growing company. In particular, this position offers the chance to tackle complex analytical problems across a large data set in a tech-centric company.<p>RESPONSIBILITIES:<p>1. In-browser charts and graphs\n2. Hazard modeling\n3. Building a large, noSQL environment\n4. Working on application features guaranteed to see the light of production<p>QUALIFICATIONS:<p>1. Experience working in small teams with a great deal of autonomy\n2. An understanding of the pace of a startup (and the excitement to jump into it)\n3. Experience with some or all of our existing stack: Ruby on Rails, JQuery, MySQL, Mongo, Redis, Resque and git\n4. Significant experience with dynamic languages, agile methodologies, predictive analytics, front-end web programming, test-driven development, and distributed workers\n5. Experience with, or interest in building reliable applications on cloud and service-based architectures\n6. You &quot;get&quot; UNIX. No n00bs here\n7. Experience communicating with customers in the lifecycle of a technology product or project. This could be direct project ownership at your full-time job, but it could also be something more modest, such as an open-source library you released on Github and got five other people to use, or a small web application you built in a weekend hackathon. In fact if you have any open source or web apps, show em to us, they speak louder than resumes<p>COMPENSATION:<p>1. Cash compensation: Competitive with emerging technology companies\n2. Benefits: Competitive with emerging technology companies.\n$2501 spend-how-you-like budget for initial IT hardware setup\n3. Equity compensation: Competitive with emerging technology companies<p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex or national origin.<p>Interested in joining us? Please send your CV and a list of git repos or anything else you feel is relevant to jobs@risk.io","time":1412195181,"type":"comment"}