{"by":"stevemarks","id":8398743,"parent":8394339,"text":"Joyable | joyable.com | San Francisco (local, relocate)<p>Hiring Rails, fullstack, and frontend engineers<p>At Joyable, we aspire to cure the world&#x27;s anxiety and depression. We&#x27;ve raised $2 million in venture funding and are looking for a second engineer to join our awesome team.<p>As our second engineer, you&#x27;d have a substantial opportunity to change lives by transforming mental health, and, equally importantly, you&#x27;d play a key role in shaping our technical architecture. You&#x27;d be the fifth member of the team, so you would also get to help build the company and our culture.<p>Culturally, we&#x27;re an extremely team-oriented environment. We believe you should take your work seriously, but not yourself seriously. We&#x27;re very mission-driven but we want to have a good time along the way.<p>If you&#x27;re interested in helping change the world by reinventing mental health, we should chat (steve@bejoyable.com).<p>==================================<p>Today, tens of millions of Americans don&#x27;t get minimally adequate treatment for mental health issues that we know how to treat. At Joyable, we think that&#x27;s crazy. Our mission is to make evidence-based mental health care available to everyone. We&#x27;re starting by delivering cognitive behavioral therapy for people with clinical social anxiety. The clinical content is delivered via a webapp, but we pair the app with a layperson coach who keeps our clients engaged andmotivated.<p>We just finished a very successful beta with outcomes equal to best-in-class in-person therapy. Sample customer quotes from our beta include:<p>- &quot;This is a godsend&quot;<p>- &quot;I never thought my results would be that different, so soon. Thank you so much&quot;<p>- &quot;I feel like I was in prison, and you gave me the key&quot;<p>We raised $2 million of venture funding led by Thrive Capital (Instagram, Warby Parker, Oscar Health) and Harrison Metal (AdMob, Heroku, Grand Rounds). Our team is 4 today and based in downtown SF on top of the Powell BART Station.","time":1412209800,"type":"comment"}