{"by":"akoumjian","id":8399106,"parent":8394339,"text":"Nimia (<a href=\"https://app.nimia.com\" rel=\"nofollow\">https:&#x2F;&#x2F;app.nimia.com</a>) -- Seattle, WA (REMOTE possible, VISA possible)<p>== About Us ==<p>Nimia is a place where independent filmmakers and agencies can license, share, and archive their 4k video. See our quick video intro: <a href=\"https://app.nimia.com/video/35785/demo\" rel=\"nofollow\">https:&#x2F;&#x2F;app.nimia.com&#x2F;video&#x2F;35785&#x2F;demo</a><p>== Company Culture ==<p>We are small. We want you to help us decide what to build, what to improve on, and even how to market ourselves. We are in constant communication with our users. Sales, marketing, legal, and engineering meet up frequently to collaborate.<p>We use SCRUM to keep everyone on the same page and to constantly reevaluate how we&#x27;re spending our time. HACK DAY is every other week on Friday, sometimes taking over the next sprint when something awesome comes up. Schedule is flexible, but we are always in touch. We deploy almost daily.<p>On evenings and weekends we often do (completely optional) creative side projects, such as helping with this film shoot: <a href=\"https://app.nimia.com/video/139992/base-aerial-footage-sneak-peek\" rel=\"nofollow\">https:&#x2F;&#x2F;app.nimia.com&#x2F;video&#x2F;139992&#x2F;base-aerial-footage-sneak...</a><p>== Positions ==<p>= Fullstack Developer =<p>Responsibilities:<p>You will get to spend your time in a myriad of places, depending on your interests and strengths:<p><pre><code>  * Features\n  * UI &#x2F; UX\n  * Performance &#x2F; DevOps\n  * Marketing &#x2F; SEO\n</code></pre>\nWho you are will help define the position and we want you to have a real interest in designing and engineering the product.<p>Qualifications:<p><pre><code>  * Experience with Django, Rails, or a server side javascript framework\n  * Experience with a client side javascript framework\n  * Plus: Experience with video encoding &#x2F; codecs\n</code></pre>\n= Intern Developer =<p>Responsibilities:<p><pre><code>  * Learn the stack\n  * Spend grueling hours on the most tedious bugs (just kidding, we all have to do that)\n  * Hop between programming and marketing tasks\n  * Keep us up to date on what all the hip startups are doing\n</code></pre>\nQualifications:<p><pre><code>  * You want to learn\n  * Demonstrate a real interest in programming\n  * You eventually want a fulltime position\n</code></pre>\n== Our Stack ==<p>We use Python, Django, NodeJS &#x2F; Javascript, Backbone, SCSS, Elasticsearch, Redis, Saltstack, AWS and some other bits and pieces. We aren&#x27;t afraid to try new technologies, libraries, or 3rd party services as long as they perform well and do something great for our users.<p>== Some Cool Engineering Things We&#x27;ve Done ==<p><pre><code>  * First to implement client side multi-part upload directly S3 so that our users could upload their 10GB+ video files without touching our EC2 servers\n  * Within one hack day we added realtime updates for video status &amp; chat using nodeJS + socketIO and deployed to production\n</code></pre>\nContact alec@nimia.com and please include:<p><pre><code>  * 3 references\n  * Github profile and&#x2F;or personal website\n  * Resume</code></pre>","time":1412216275,"type":"comment"}