{"by":"Michelle_AAce","id":8399017,"parent":8394339,"text":"Agent Ace - Santa Monica, CA<p>Agent Ace is hiring for a Senior Software Engineer&#x2F;API Architect, a Backend Data Engineer, a Product Manager, and a QA Engineer<p>Agent Ace (<a href=\"http://www.agentace.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.agentace.com</a>) matches clients with the best real estate agent for the specific home they intend to buy or sell. The science of finding the best agent is complex, but the results are simple, unbiased, and speak for themselves.<p>Our tight-knit team is looking for engineers who can mesh well with our culture. When we aren’t busy crushing code, we enjoy frequent company happy hours and office parties, a relaxed office environment and a location that&#x27;s four blocks from the beach. We have catered lunches and a kitchen stocked with mad snacks. Our flexible work hours mean that if you want to work a later shift because you were surfing in the morning, go right ahead. About ⅓ of our team bikes, walks or skates to work - did we mention we’re in Santa Monica and we will relocate you?<p>We have a dynamic, energetic and focused (but fun) work environment that you will thrive in. We’re growing like wildfire, and our outstanding team enjoys the camaraderie that comes with moving towards the same goal.<p>For the Senior Software Engineer&#x2F;API Architect, requirements are: <i>A BS in Computer Science or a related degree </i>5+ years professional software development experience <i>Professional software development experience with C++ or Java </i>2+ years LAMP stack experience (PHP)<i>Solid understanding of SQL, SQL optimization techniques </i>Experience architecting and developing REST APIs <i>Understanding of REST-based API </i>Authentication &amp; Session handling best practices <i>Strong conceptual understanding of OO concepts and design patterns\n</i>Unfortunately, we are unable to sponsor visa candidates at this time.<p>Ideally, you also have: <i>An MS degree in Computer Science or Software Engineering </i>Experience with Agile development, Code Reviews, Test Driven Development and Continuous Integration <i>Experience with NoSQL databases </i>Experience with real-time analytics infrastructures (log streaming&#x2F;BI) <i>Experience with GIS or Real Estate data </i>Experience with SugarCRM or SalesForce CRM integration<p>For our Data Engineer, requirements are: <i>A BS in Computer Science or a related degree, </i>4+ years professional software development experience, <i>Professional software development experience with C++ or Java, </i>2+ years CLI Scripting on Linux (PHP, Python, Perl + shell), <i>Comfortable with regex-based tools (awk, sed, grep, etc.), </i>Solid SQL, SQL optimization skills, <i>Experience working with&#x2F;managing large data sets, data processing pipelines, </i>Understanding of OO concepts and design patterns<p>Ideally, you also have <i>An MS degree in Computer Science or Software Engineering, </i>Experience with Agile development, Code Reviews, Test Driven Development and Continuous Integration, <i>Experience with NoSQL databases, Hadoop, MapReduce, </i>Experience with real-time analytics infrastructures (log streaming&#x2F;BI), <i>Experience with GIS or Real Estate data, </i>Experience with SugarCRM or SalesForce CRM customization<p>To find out more check out <a href=\"http://agentace.com/about/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;agentace.com&#x2F;about&#x2F;careers&#x2F;</a>","time":1412214083,"type":"comment"}