{"by":"grantpatterson","dead":true,"id":8399297,"parent":8394339,"text":"Building Robotics in Oakland, CA <a href=\"http://buildingrobotics.com/building-robotics/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;buildingrobotics.com&#x2F;building-robotics&#x2F;careers&#x2F;</a><p>We are an interdisciplinary team of engineers, designers and building industry experts re-inventing building controls with advanced computing and thoughtful user experience.<p>Comfy, our flagship product, enables building occupants to control the temperature of their space with a simple user interface. Comfy uses machine learning to learn people&#x27;s preferences. By adjusting building temperatures dynamically, it also saves energy.<p>Operations Engineer (3-5 years experience)<p>Buildings are critical pieces of infrastructure – availability, security and reliability are paramount. Our operations engineers design, implement, and manage our cloud-based, distributed control fabric for buildings. This could include everything from improving our automation tooling, implementing consistent monitoring and internal dashboards for key service metrics, and auditing security concerns to digging into building control systems to integrate our platform with a new vendor. The ideal candidate is comfortable with complicated architectures spanning multiple levels of abstraction and making improvements to make the overall system more robust, scalable, and transparent.<p>Skills: Knowledge of CI deployment workflows (travis, trial, fabric), monitoring (sentry), services (apache2, postgres, supervisord), Linux networking (openvpn, iptables), and EC2 deployment best practices. Experience managing distributed service-oriented infrastructure.<p>Frontend Engineer (3-5 years experience)<p>A delightful, intuitive user experience is core to our vision, reinventing the way we interact with the office buildings we all spend over half of our time in. Our frontend engineers develop delightful and informative user interfaces, exposing complex building mechanics simply and in real-time.<p>Skills: Knowledge of responsive HTML 5, JavaScript, CSS, SVG, Django.<p>Backend Engineer<p>Modern buildings are complex digitally controlled mechanical systems with thousands of sensors and actuators. Our backend engineers develop infrastructure for wide-scale data collection and actuation that can scale to millions of buildings.<p>Skills: Knowledge of Python, Twisted and c&#x2F;c++. Experience developing distributed, fault-tolerant systems.","time":1412220491,"type":"comment"}