{"by":"jamespayneuk","id":8400359,"parent":8394339,"text":"Alphalend (www.alphalend.com) - London - First non-founding developer(s)<p>=== TL;DR ===<p>We believe that banking should be driven by the latest and greatest technologies, not legacy systems. As technology evolves, banking processes should evolve in sync, not lag behind. That is our goal here at Alphalend: to supercharge consumer lending and revolutionise the industry’s standard practice . Technology moves fast… nothing you read below is set in stone and everyone who joins our team is expected to continually drive us to do better. If this sounds like you, please get in touch: contact@alphalend.com<p>=== Who are we? ===<p>We are a small, passionate and energetic team of exceptional people funded by some of Europe’s most respected angel investors. Our vision is to move banking into the 21st century. We have the plan, the backing and the skills to make it happen but we need additional talented devs to push us further and faster.<p>=== Who are you? ===<p>You are a leader: you imagine, share, collaborate and create. You have the skills and experience to improve and evolve our development strategy, but most of all you always want to keep learning. You relish the idea of joining a fast-growing company that is using cutting edge technology to redefine the world of retail banking. An understanding of IoC, its benefits and drawbacks, quality testing and experience working in early stage teams are the key skills required given our current setup. Our technology stack will evolve, however, so you should love to experiment, always striving to find the best means to achieve the goal at hand, and always be keen to explore new technologies that would improve our product.<p>=== What we offer: ===<p>Market-leading compensation<p>25 days holiday + public holidays<p>Whatever equipment you need to get the job done - you choose<p>Flexible working hours whenever possible. Occasional working from home<p>7th floor office with the best view of any office you’ve worked in, guaranteed<p>Opportunity to be our first non founding developer, take a key role in recruiting the team and evolving our development strategy<p>=== Technology: ===<p>Platform built on Symfony 2.4<p>Doctrine2 using MySQL on Amazon RDS. Doctrine migrations for DB updates.<p>PHP5.5 and Apache running on Amazon EC2<p>Testing with PHPUnit. Coverage currently around 30%, ideally you can help improve this. BDD lover? Please teach me!<p>Jenkins used for automated build and deployment<p>Git for version control<p>Lots of 3rd party APIs used to gather data (REST and SOAP)<p>Machine learning (fuzzy logic and neural networks) for the most intelligent risk assessment and pricing possible.<p>Extensive analytics driven marketing.<p>No legacy code, all written in the last 6 months<p>=== How we work: ===<p>Our development methodology is currently very agile and approaches continuous deployment. We regularly do several live deployments per day. A feature implementation would go something like: Feature branch -&gt; implement -&gt; code review -&gt; merge to development -&gt; test on dev -&gt; merge to master -&gt; deploy to live.<p>=== Interested? ===<p>email us at contact@alphalend.com","time":1412251027,"type":"comment"}