{"by":"bjelkeman-again","id":8404831,"parent":8394339,"text":"Akvo Foundation - Amsterdam, Stockholm, Helsinki, London, EU or remote within +&#x2F;-2 hours from CET<p>Akvo seeks an experienced Systems Administrator to join our Release Engineering Team within the wider Development Team and help us maintain and expand our growing technology infrastructure.  Our core projects currently rely on various infrastructure types including hosted Linux VM clusters, cloud computing services like Google App Engine and Amazon Web Services as well as both relational databases and distributed datastores.  The Akvo Dev Team has tech hubs in Amsterdam, Stockholm, Helsinki and Bangalore with a distributed presence in other EU countries including the UK, Germany and Spain.<p>Primary responsibilities would be to:<p>- continue the automation of machine provisioning and deployment<p>- setup monitoring and alerting for various services and machines<p>- ensure stability and continuity of services and machines<p>Core skills and experience should include:<p>- configuration management and provisioning using Puppet<p>- Linux system administration for Ubuntu machines<p>- configuration and maintenance of cloud services using Google App Engine, Amazon Web Services, OpenStack or similar technologies<p>- configuration and administration of MySQL and PostgreSQL relational databases<p>- scripted build and release automation using shell scripting, Gradle, Ant, Python, Ruby or other scripting languages<p>- continuous integration experience with TeamCity, Jenkins, Travis or similar<p>- good communication and team collaboration skills with excellent written and spoken English<p>Additional skills and experience preferred:<p>- experience working within a globally distributed team<p>- experience with monitoring &amp; graphing technologies like Graphite, Grafana or InfluxDB<p>- software development experience using Java, Python or Clojure<p>- setup and maintenance of continuous delivery pipelines<p>- setup and maintenance of multi-site Wordpress installations<p>Candidates should be based in Amsterdam, Stockholm, Helsinki or elsewhere within 2 hours of the Central European time zone and must already have an appropriate residence or work visa.  To apply for this position please send your CV to olivergl@akvo.org.","time":1412329086,"type":"comment"}