{"by":"slack","id":8406465,"parent":8394339,"text":"Engine Yard | San Francisco, CA; Portland, OR, Dublin, Ireland; REMOTE | Platform Engineer<p>As a platform engineer, you will spend most of your time working on orchestration and automation which manages customer environments across AWS and Azure infrastructures. Our platform is largely written in Ruby so a strong grasp of the language is preferred.<p>Every day you will deliver features on a platform that powers tens of thousands of servers. Ship software that runs the production environments for many startups and enterprises. Have a direct impact on the lives of other developers so they can focus on getting work done. Help us make cloud deployments, better, faster and stronger.<p>The engineering team at Engine Yard is spread across 8 timezones (Dublin, Ireland to San Francisco, California), so experience working in a distributed team is very helpful. You will talk to colleagues via Zoom, post funny gifs to our slack chat rooms, reserve and deploy your topic branches to staging environments via our good pal `eybot`. When the build is green the trap is clean. We deploy multiple times a day.<p>You&#x27;ll get:<p><pre><code>  Competitive salary\n  Full medical, dental and vision benefits\n  25 paid days off per year (holidays and PTO)\n  401(k)\n  We take care of your phone bill\n  Paid travel to conferences\n</code></pre>\nMust haves:<p><pre><code>  A passion for writing great software to solve real problems for real people\n  Demonstrated experience working with large-scale production systems\n  Experience working in a distributed team\n  Strong Ruby background\n  The strong belief that a feature isn&#x27;t finished until it&#x27;s tested\n  Occasional travel (at least once or twice a year: inter-office travel and engineering offsite)\n  Somewhere between UTC and UTC-8\n</code></pre>\nGreat to have:<p><pre><code>  Experience building and consuming apis\n  Experience deploying and managing cloud-based infrastructure\n  Experience with multiple languages (and an understanding of their tradeoffs)\n  You&#x27;ve done the agile dance\n  Thorough understanding of `git`\n  Experience with configuration management (any will do, but we use chef)\n  Linux systems administration background\n</code></pre>\nContact:<p><a href=\"http://www.engineyard.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.engineyard.com</a><p>email: jhansen+job@engineyard.com","time":1412356997,"type":"comment"}