{"by":"vpaloc","id":8407325,"parent":8394339,"text":"Linode - Software Engineer - <a href=\"https://www.linode.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linode.com&#x2F;careers</a><p>Location: Galloway, NJ\nType: Full Time\nMin. Experience: Mid Level<p>Summary<p>Founded in 2003, Linode is a leading cloud hosting provider with 150,000 customers worldwide. Since then, Linode has invested heavily in its people and set the bar for excellence in the cloud hosting industry. Our customer service, development, ops, hardware, marketing, documentation, and management teams are all part of making Linode everything it can be. This industry moves fast, but we’re committed to hiring the kind of people who can stay a step ahead and keep us - and themselves - at the top.<p>Linode is seeking an enthusiastic Software Engineer with experience developing web based applications, web services and public APIs, and developing front and back-end projects.This individual will be responsible for small to mid-size projects, right from the concept phase and all the way to production deployment and beyond. We strive to maintain a work environment that fosters innovative solutions, rapid development cycles and open communication. Because so much of what we do involves automating systems related tasks, we&#x27;re really after a developer who has experience with or knowledge of Linux administration.<p>We&#x27;re a closely knit team with a focus on agile development and innovative solutions. We encourage and reward curiosity, ingenuity, and technical excellence. If you enjoy working on ambitious projects that have a big impact, you&#x27;ll enjoy working at Linode!<p>Candidates must be available to work full-time at Linode headquarters in Galloway, NJ. Relocation assistance is available.<p>The ideal candidate will have:<p>• 3+ years experience in software development\n• Bachelor&#x27;s degree\n• Solid Perl&#x2F;Python development experience in Unix&#x2F;Linux operating environments\n• ColdFusion CFML&#x2F;cfscript development experience preferred\n• Excellent communication and interpersonal skills\n• Strong programming skills including software engineering methodologies and best practices\n• Experience with virtualization technologies like Xen, KVM, and UML\n• Experience with Nagios monitoring\n• Independence and initiative\n• Comfort maintaining live production systems\n• Ability to work in a fast-paced, cross-functional setting<p>To Apply, please visit <a href=\"https://www.linode.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linode.com&#x2F;careers</a>","time":1412366150,"type":"comment"}