{"by":"nttdocomo","id":8408092,"parent":8394339,"text":"San Francisco - We&#x27;re looking for engineers to join the web application team at Loggly. We&#x27;re growing quickly and have multiple positions open, but right now we&#x27;re very interested in Fullstack, Frontend, and UI Engineers.<p>Who We Are:\nLeader in cloud-based log management. Check out our site (www.loggly.com) for more information.<p>Tech Stack:\nWe have a pretty sophisticated client written in Angular, and a backend written in Python (Django) and MySQL.<p>What we&#x27;re looking for:\nPretty much what any good engineering team is looking for: competent engineers. We&#x27;re not looking specifically for people who are Angular or Django experts (although we certainly wouldn&#x27;t hold it against you).<p>That was vague, give me some specifics:\n- You have had at least 3 years working on an engineering team (We&#x27;re not at a place right now where we can help junior engineers succeed in their careers)\n- You love what you do\n- You know the basics, and you know them without hesitation. For example, if you&#x27;re a frontend engineer, you should be able to do a basic 2 column layout in raw html&#x2F;css without looking anything up or using bootstrap, or be able to implement a function like _.filter in 2 minutes (because you thought it was really easy since you understand javascript really well and you&#x27;ve worked with it enough where it&#x27;s pretty much second nature to you)\n- You ask questions when you&#x27;re confused, and aren&#x27;t afraid to push back or say no when someone asks you to do something that&#x27;s a terrible idea. (Full points rewarded if you usually offer them an explanation of why that&#x27;s a bad idea, and what it would entail to do it correctly, but you still get points for being able to say no)<p>What we offer:\n- Standard perks to make your life awesome at work, and outside of work (good pay, free meals, time off whenever you need it, healthcare, dignity... sorry, got carried away)\n- An awesome team invested in making sure you succeed<p>Email vincent at loggly dot com with a resume, or a github link, or some kind of material that shows you&#x27;re a good engineer.","time":1412377114,"type":"comment"}