{"by":"glotojobs","id":8422272,"parent":8394339,"text":"Fulton, Maryland.<p>Gloto - small tech startup working with huge customers.<p>Job Title(s): Software Engineer, Application Developer, Web Programmer, iOS&#x2F;Android Specialist<p>Gloto is looking for awesome people to join our growing team! Our greatest ongoing need is for stellar Software Engineers to help build amazing apps, gadgets, and websites. Don&#x27;t worry about your title - you can be an Application Developer, Web Programmer, or Software Engineer - as long as you know what you&#x27;re doing and you&#x27;re a great team player, we want to hear from you!<p>==========<p>A quick questionnaire to see if you&#x27;re the right person for the job:<p>- Are you able to take the reins of a project and develop it from start to finish?<p>- Can you fix bugs and add new features to existing projects?<p>- Do you understand project goals and how the final product will make a client happy?<p>- Are you comfortable being involved in the entire project life cycle, from the development of the specifications, design of the user interface, database design and construction, programming, and gathering of client feedback?<p>- Can you work with business development teams with regard to proposals and budgets?<p>- Do you enjoy being a part of a multi-disciplinary team that includes programmers, designers, front-end developers and project managers, all with the common goal of wow-ing the customer and their consumers?<p>- Are you naturally curious with technology, and do you keep up with the latest and greatest in industry best practices?<p>- Do you work fast and efficiently? Do you take pride in writing good code?<p>- Do you have a degree in Computer Science, Engineering, Math, or related fields?<p>If you answered &quot;yes&quot; to at least a couple of these questions, we would love to hear from you!<p>==========<p>You will be successful in this position if:<p>- You have experience with agencies and think it&#x27;s an ideal work environment because of the pace and the diversity of projects and technologies<p>- You are proficient with at least a couple of the following: iOS development, Android development, Java, git, MySQL, Amazon Web Services, Ruby, Web technologies including HTML, CSS, and JavaScript<p>- You go beyond the specifications by making suggestions for making projects function better and flagging things that don&#x27;t make sense.<p>- You have the ability to juggle multiple projects, tasks and deadlines.<p>- You believe that code should be elegant and clean, and that coding is a creative act.<p>==========<p>Gloto is a growing tech startup in Fulton, Maryland. We make awesome websites and apps for major customers and we are looking for equally amazing people to join our team. If you think you&#x27;d be a good fit, send us your resume today! jobs@gloto.com","time":1412700863,"type":"comment"}