{"by":"mbaldini123","id":8423457,"parent":8394339,"text":"Royal Oak, Michigan, FULL TIME POSITION<p>Tome has big plans for its new iOS engineer\nHelp wanted: New company seeks free agent tech world-mover<p>Tome Software has an immediate opening for an additional iOS engineer to work in our tech office in downtown Royal Oak. Tome, the second startup launched by Jake Sigal and Massimo Baldini  (they previously founded Livio, which was later acquired by Ford Motor Co.) was born in April 2014 and is currently running in stealth mode. Publically, we’re working within the vague-but-exciting “Internet of Things” tech space. What we’re really doing is building big things for paying customers. And we’re growing. If you’re a free agent looking to work with a proven and award-winning entrepreneurial team to change the status quo of tech through passion and hard work, here’s what you need to know about us, and what we need from you.<p>Tome’s typical workday: Jeans. Coffee. Code. Create.<p>Pre-qualifications:\nMinimum four-year degree (BS&#x2F;MS) in Computer Science, Engineering or a related field.\nMinimum of one year post-college work experience.\nMust live or be willing to live within 15 miles of Royal Oak, Mich.\nMust be authorized to work in the U.S.\nAbility to think on your feet and solve complex problems.\nMust love writing code.<p>Qualifications:\nThree or more years of software development experience.\nThree or more years of iOS development.\nMust have published one or more iOS apps in Apple’s App Store.\nA deep familiarity with Objective-C and Cocoa Touch.\nExperience with third-party libraries and Web APIs (familiarity with REST &amp; JSON&#x2F;XML).\nWorking knowledge of the general mobile landscape, architectures, trends and emerging technologies.\nBonus points for Bluetooth Low Energy, ANT&#x2F;ANT+ experience.\nMust love creating great experiences for users, whether they are developers or consumers.<p>Tell us if you have these bonus skills:\nAdditional programming languages.\nAmazon Web Services experience a plus.\nExperience working on teams using Github or Bitbucket to track code and issues.\nExperience building connected experiences, through Wi-Fi, BLE, Bluetooth (iAP), USB (iAP), or 2nd screen.\nExperience making complex APIs simple and easy to use.\nExperience working in a lean, startup environment<p>Benefits: 100-percent company-paid health and dental coverage, stock options, vacation, 15 paid holidays.<p>Please apply directly at [iOS&#x27;s UI Framework]@tomesoftware.com with your resume. In the email, feel free to include links to projects and&#x2F;or tell us about projects you’ve enjoyed working on in the past.","time":1412710541,"type":"comment"}