{"by":"mikeearley2001","id":8426090,"parent":8394339,"text":"Shoe Lovers&#x2F;Burlingame, CA&#x2F;Lead Architect - Social Commerce &amp; Member of Founding Team<p>Shoe Lovers is hiring a Lead Architect to join it&#x27;s growing team of 8!<p>Shoe Lovers is the world’s largest online community for shoe fashionistas, curated with love.  We offer a unique mobile social commerce platform to help passionate women who love shoes to find offers, discover trends around the world, and share their passion with others.  We have added 20+M fans in a year, and we are scaling the company to meet demand and offer a continuing array of exciting additional products.<p>We are a small team who are as passionate about our market as our fans are, tackling the challenges of creating a large-scale platform that handles millions of customer interactions daily.  We have raised $650k of seed funding and are now looking for key team members who are excited by this challenge of creating the world’s largest fashion social market, initially in Spanish-speaking geographies and later the world.<p>Shoe Lovers is looking for a highly motivated lead architect and developer interested in revolutionizing the social shopping experience.  As a key member of the founding team, this individual will design and lead the development of the next generation of our social commerce platform and will work closely with the CTO, Product Manager, and the other software engineers in the analysis, design, development, testing and deployment of the platform.  The ideal candidate will have experience with highly scalable commerce systems, be able to demonstrate logical thinking and good organizational skills as it applies to decomposing complex software systems, and devising clean and robust solutions to technical problems.  <p>Responsibilities:<p>• Develop and implement the next generation of social commerce platform\n• Develop and implement the underlying data model to support innovative and flexible social shopping experience\n• Ensure code quality with thorough unit and integration tests, and participation in code reviews\n• Promote and advocate best practice development methodologies and help facilitate an Agile development process<p>Requirements:<p>• 5+ years professional hands-on software development experience\n• Direct experience with ecommerce systems and integration with a range of payment systems\n• Experience with highly-available systems\n• Experience developing enterprise-scale applications\n• Logical, organized approach to system analysis and technical design\n• Proficient in multiple programming languages and frameworks\n• Strong relational database skills\n• A history of productive, collaborative development\n• Startup experience preferred\n• Effective oral and written communication, and listening skills\n• Bachelor&#x27;s degree in Computer Science or related field<p>About Shoe Lovers:<p>Shoe Lovers is the world’s largest online community for shoe fashionistas, curated with love.  We have grown to 20+M Facebook fans in a little over a year by offering a unique mobile social commerce platform to help passionate women who love shoes to find offers, discover trends around the world, and share their passion with others.<p>Our initial market is Spanish-speaking women in the US, Latin America, and Spain, but we have fans in 45 countries worldwide.  Our users are highly engaged and passionate about our community, with an average 3M DAU.  Our vision is to expand our community on a global basis and enable women across the world to find shoes that they love.<p>The power of social commerce resides in the network effect of recommendations, and Shoe Lovers was built to maximize the utilization of the network of community interactions to create maximum engagement.  By utilizing big data analysis of the social network and a combination of curated content and internet-generated content, we automatically capture the fans’ preferences with unprecedented accuracy to provide an outstanding user experience.<p>Our technology provides an integrated platform supporting visual search, automated preference tracking, and personal recommendation systems across Facebook, our mobile app, and mobile web.  The user experience is integrated through a fine-grained data acquisition platform and preference profiling service as well as content creation and curation processes which enable our bloggers, curators, and fashion content creators to contribute to and interact with the community.<p>Shoe Lovers is funded by Tandem Capital, which has backed such successful companies as Bash Gaming, PagerDuty, Tile, Upsight and UpOut.<p>Shoe Lovers is based in downtown Burlingame, CA.<p>Website: www.shoelovers.co<p>AngelList: <a href=\"https://angel.co/shoe-lovers\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;shoe-lovers</a><p>Tandem Capital: www.tandemcap.com<p>If you are interested in this position, please send your resume to: jobs@shoelovers.co","time":1412761780,"type":"comment"}