{"by":"maramaemartin","id":8460904,"parent":8394339,"text":"San Francisco, CA - Full-Time Expedite<p>Expedite is looking for their first Front End Engineer &amp; UX Designer!!<p>Expedite is empowering people to make life&#x27;s important financial decisions. We&#x27;re starting with the biggest one: financing the home. If you have ever applied for a mortgage, you&#x27;ll immediately recall the confusion, countless hours, multiple middlemen and tons of paper. At Expedite we are bringing innovation to the $10TN mortgage industry by focusing on the borrower and gathering insight from data, building a solution that comes from an engineering-driven culture.<p>FRONT END ENGINEER:\nHere&#x27;s what you&#x27;ll accomplish:\n* Develop a Web application that feels natural in both mobile, tablet and desktop environments, without writing redundant code. \n* Build features that integrate financial education, financial profile creation and loan application process into an end-to-end application. \n* Have an opportunity to use the newest frontend development frameworks that massively increase the team&#x27;s productivity.<p>UX DESIGNER:\nHere&#x27;s what you&#x27;ll accomplish:\n* Design experiences that simplify a complex process that for most people is the most important decision they will ever make in their lives. \n* Integrate financial education, financial profile creation and loan application process into an end-to-end application. \n* Create a long-term, engaging experience. We&#x27;re building a lifetime partnership to help empower people with their own data as they build their financial identity with us. \n* Decide which interfaces work on the desktop, tablet and mobile, and allow a user to move seamlessly between these form factors.\n* Lead Usability Research.<p>We&#x27;re offering early stage equity, competitive salary, full healthcare benefits, and advancement opportunities.<p>To apply, visit:\nFront End Engineer - <a href=\"http://www.thesourcery.com/jobs/821\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;821</a>\nUX Designer - <a href=\"http://www.thesourcery.com/jobs/820/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;820&#x2F;</a>","time":1413399683,"type":"comment"}