{"by":"jrhusney","id":14906111,"kids":[14912717],"parent":14901313,"text":"Parabol | Senior Full-Stack Developer | Los Angeles, New York, or Remote<p>Parabol is solving a problem that plagues many teams: prioritization. We help teams balance between executing on planned objectives and responding to the challenges and opportunities of the day. We do this by giving teams a universal inbox that spans the tools teams use (like Trello, GitHub, ZenDesk, and their email), guiding the team through prioritizing items by facilitating their weekly team meeting and reporting on progress at the end of the week.<p>We love to push the boundaries of technology. Our application is open-source (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;ParabolInc&#x2F;action\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ParabolInc&#x2F;action</a>), it&#x27;s also real-time and multiplayer. Sharing what we&#x27;ve learned is important to us. If you&#x27;d like to get a sense of who we are and how we think, he&#x27;s a videocast we did recently for GraphQL Radio: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Gxag5PXGXN8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Gxag5PXGXN8</a><p>We&#x27;ve operated our company using our own software, growing to hundreds of users, and raised a pre-seed round with SV Angel, Slack, and Flight.vc<p>YOU ARE:\n● 5+ years experience architecting and developing software on a team\n● Energized about the challenge of creating real-time, multiplayer applications\n● Expert in ES2015+, React, GraphQL, and Node, with good linting habits\n● Familiar with building distributed systems and microservices\n● Eager to give back to the open-source community and share knowledge\n● Excited to create and launch useful tools for the Future of Work\n● An empathetic and generous communicator that lives by, “don&#x27;t hate, iterate”<p>CULTURE &amp; COMPENSATION:\n● Offering 60% FMV cash salary + early-stage equity\n● Geographically distributed team (CA, NY, TX) that values &amp; promotes work-life balance\n● Convenes 4x&#x2F;year for all-hands strategy sessions","time":1501627060,"type":"comment"}