{"by":"airesume","id":14907254,"parent":14901313,"text":"A.I. RESUME (<a href=\"https:&#x2F;&#x2F;airesume.com&#x2F;hiring?ref=hackernews\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com&#x2F;hiring?ref=hackernews</a>)<p>Worldwide, Remote, Full time&#x2F;Part time&#x2F;Contract, $100-$185K<p>Work like you&#x27;ve never worked before (in a good way)\nWe are a passionate team of developers, engineers and scientists dedicated to revolutionizing the way people find, get &amp; keep jobs. We all know getting jobs is going to get tougher and one day we will be competing against artificial intelligence (A.I.) so help us build an A.I. that can level the playing field for humans! We already have an amazing product and your skills will help us make it even greater!<p>Get in on the ground floor of an amazing opportunity to work with a great team while still being able to work on your own side projects and explore&#x2F;expand your expertise anyway you want, your growth is our goal! We encourage people to continue learning and we pay for it!<p>Take a vacation ANYTIME for as long as you like, PAID! We encourage digital nomadship (whether for a few weeks, months or even years if you like) as often as you want! We also have families so staying put is cool too, but we have traveled with kids before and highly recommend it!<p>We are hiring for the following positions:<p>• Artist, Illustrator and Graphic Designer<p>• UI, UX Professional<p>• Machine Learning, Deep Learning Professional<p>• Data Scientist<p>• Growth Marketer&#x2F;Digital Marketing Professional&#x2F;Growth Hacker<p>• Strategic Partnerships &amp; Business Development<p>• Marketing Intern<p>• Don&#x27;t see a position that fits your skills? No worries! Send us your resume letting us know what you can do and why you want to work with us.<p>Visit <a href=\"https:&#x2F;&#x2F;airesume.com&#x2F;hiring?ref=hackernews\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com&#x2F;hiring?ref=hackernews</a> to apply.","time":1501638711,"type":"comment"}