{"by":"acron0","id":14909539,"parent":14901313,"text":"Mastodon C | Frontend Developer | London or REMOTE (UK), Full-time<p>Interested in functional programming? Want to build UIs in ClojureScript, using tools like React and Reagent? We’re looking for a frontend developer to help us work on a project with global impact.<p>Mastodon C are big data and data science consulting specialists. We offer the open source technology platform and the skills to help our clients realise the potential of their data. We work, in particular, in applying data to areas where we think we can have a positive impact on the world, like sustainability, health, and built environment. You will be working alongside a team of Clojure developers for a major new product; applying big data, open data, and analytics technologies to improve city planning. We’re about to roll our product out to customers and would like to grow our ability to deliver new features.<p>You will:\n - Design and implement contemporary user interfaces.\n - Collaborate with the team to develop and improve a consistent and effective user experience.\n - Contribute to code bases across our entirely open source stack.\n - Develop features end-to-end – you will be specialising in frontend and UI technologies, but you will also get involved with building and scaling the rest of the technology in the product.<p>Our ideal person for this role would:\n - Have already held a professional designer or software developer role\n - Know or be interested in learning Clojure&#x2F;ClojureScript.\n - Have experience with Javascript, HTML, and CSS, and be comfortable learning other new languages\n - Be excited about enhancing your UI and UX skills\n - Be interested in and excited about applying data and analytics to important issues in the world\n - Be able to demonstrate experience in turning complex needs into simple and elegant interfaces<p>The salary for this role is up to £35,000 per year. We are based in Bermondsey, London but happy to discuss part-remote or part-time arrangements if those are important for you.<p>If this looks like your kind of a job, please contact us at theteam@mastodonc.com with a CV (and, if possible, recent code or project examples) and we’ll talk.<p>Please note that you need to be eligible to work in the UK to apply for this position.","time":1501671634,"type":"comment"}