{"by":"epberry","id":14903841,"parent":14901313,"text":"Perceive | Hardware Engineer | West Lafayette, IN | ONSITE | <a href=\"https:&#x2F;&#x2F;www.perceiveinc.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.perceiveinc.com</a><p>Perceive is a computer vision startup based in West Lafayette, IN working to improve customer service in retail stores. We’ve obtained over a million dollars in seed funding to create the first digital assistant for a physical store. We’re looking for a hardware hacker to design, prototype, and manufacture the next version of our patent-pending camera hardware. This is a full time position starting in Fall 2017 in West Lafayette, IN. As the first dedicated hardware engineer at Perceive, this position comes with great power, but also great responsibility. Our immediate needs include: design and testing of new device packaging, circuit design for two new components on a peripheral board, and coordination of manufacturing for a five-hundred unit production run. This hardware engineer, working closely with our CEO who has been leading hardware development thus far, must be a strong communicator and extremely organized engineer. Previous experience developing embedded software would also be very valuable. Compensation includes salary and equity befitting an early employee.<p>Required Skills: Circuit Design, preferably in power electronics, motor control, and&#x2F;or digital electronics, Microcontroller interfacing, Prior experience planning and completing a complex hardware project, Able to effectively communicate complex technical ideas<p>Experience with at least one of the following: CAD (designing and prototyping a mechanical system), Python, 3D printing, Plastic injection molding, Supply chain management (on a small-scale)<p>How to Apply:\nEmail your resume to hello@perceiveinc.com along with a few sentences telling us about yourself, why you might want to work at Perceive, and what you think of Elon Musk’s description of AI as the “greatest existential threat facing humanity”.","time":1501612357,"type":"comment"}