{"by":"karatkier","id":14908250,"parent":14901313,"text":"Karat | Expert Interviewer | Seattle, WA | Full or part-time |Remote | <a href=\"https:&#x2F;&#x2F;www.karat.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.karat.io</a><p>Interviewing is a time consuming process that is rarely data-driven. Here at Karat, we see a massive opportunity to transform the interviewing experience for every candidate and company.<p>We face incredible demand for our service and are delivering significant value to elite engineering companies like Interana, BuildZoom and Minted. We are funded by top VCs including Formation8 and Founder Collective, plus the founders of companies like Glassdoor, Mulesoft, Lookout, OPOWER, MediaLink and CAA. Karat is headquartered in the University District of Seattle, WA.<p>Join our elite community of Expert Interviewers.<p>Karat&#x27;s Expert Interviewers are recognized and rewarded for doing a first-class job as top assessors of technical talent. Every interviewer in the network is an accomplished engineer. Our interviewers include development managers from big-tech companies, start-up engineers and freelancers covering the full technology stack.<p>As an Expert Interviewer, you will be compensated at highly competitive rates for your interviewing expertise. The time commitment is flexible---many of our interviews happen on nights and weekends. Some experts do 5 interviews&#x2F;week while others do over 20 interviews&#x2F;week. You can work from anywhere, anytime. You will sharpen your interviewing skills and transform the interviewing experience for every candidate and company.<p>Who are we looking for?<p>We are looking for experienced software engineers who believe that interviewing is a first-class job. You should possess:<p>- Experience as a top performing engineer at a big-tech or start-up.<p>- Significant interviewing experience focused on evaluating fundamental computer science skills (i.e. data structures, algorithms etc.), software craftsmanship (i.e. understanding of unit testing, source control, APIs etc.), and&#x2F;or specific technologies (i.e. iOS, distributed systems etc.).<p>- Strong oral and written communication skills. Able to empathize with candidates and provide actionable feedback.<p>- An ability to structure your schedule (i.e. you can pick certain blocks of time during the day, evenings, weekends).<p>- A genuine desire to continuously improve the Karat service and technical interviewing.<p>Interested? Apply below to learn more and connect with the Karat Team.<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86?lever-source=CLNYC\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a>","time":1501653679,"type":"comment"}