{"by":"chrisocast","id":14902737,"parent":14901313,"text":"Arivale | Software Engineer | Seattle, WA | FULL-TIME | ONSITE | <a href=\"https:&#x2F;&#x2F;www.arivale.com&#x2F;careers&#x2F;?gh_jid=744015\" rel=\"nofollow\">https:&#x2F;&#x2F;www.arivale.com&#x2F;careers&#x2F;?gh_jid=744015</a><p>Arivale is looking for a Software Engineer to join our Product Development team. The ideal candidate is someone that thrives in a creative, collaborative environment and feels motivated by empowering others to live full, healthy lives.<p>As an early member of the team, you will also have the opportunity to help develop the technical culture within the company. We believe in well-crafted software, end-to-end ownership of projects, strong opinions loosely held, and rapid iteration. Currently, the main technologies we rely on are Python, Postgres, Docker, AWS, and React&#x2F;Redux.<p>If you joined us tomorrow, you’d find yourself working on projects like:<p>Our in-house data pipelines for multiple types of biological data – like genetics, blood biomarkers, and microbiome.\n- A custom health and wellness platform used to track clients&#x27; goals and measure progress.\n- Physician-focused tools to review and understand client data.\n- Scheduling and logistics tools to make the user experience seamless.\n- Or an idea you bring that we’ve yet to imagine...<p>Arivale is launching an entirely new sector based on scientific wellness with a goal to maximize wellness and aid in minimizing disease. Our scientific co-founder, Lee Hood, is a pioneer in the study of human genetics and helped invent 5 instruments at the heart of modern genetics. Dr. Hood has co-founded over a dozen biotech companies, including Amgen, Applied Biosystems, Systemix, Darwin, and Rosetta. We were also voted 2016 Geekwire startup of the year.<p>More details or to apply:\n<a href=\"https:&#x2F;&#x2F;www.arivale.com&#x2F;careers&#x2F;?gh_jid=744015\" rel=\"nofollow\">https:&#x2F;&#x2F;www.arivale.com&#x2F;careers&#x2F;?gh_jid=744015</a>","time":1501606222,"type":"comment"}