{"by":"jackgavigan","id":14903048,"parent":14901313,"text":"Zcash | REMOTE | Full time | Engineering Project Manager<p>The Zcash team is building a permissionless inclusive global financial platform. See <a href=\"https:&#x2F;&#x2F;z.cash\" rel=\"nofollow\">https:&#x2F;&#x2F;z.cash</a> for more info. We’re seeking an Engineering Project Manager to lead and grow our engineering team.<p>Responsibilities:<p><pre><code>  o Managing product development\n    - Tracking product development\n    - Clarifying requirements, including the use cases driving them\n    - Maintaining a roadmap with milestones and their anticipated schedule\n\n  o Team management:\n    - Helping individual engineers grow on a trajectory that is fulfilling for their specific goals\n    - Cultivating peer and mentorship relationships within the team as well as between our team and the broader community\n    - Continually improving and refining our engineering processes\n  \n  o Zcash Foundation Collaboration:\n    - Coordinating with the Foundation to dovetail our goals and resources wherever possible\n    - Facilitating open collaboration between our engineers and the broader community\n</code></pre>\nDesired Skills &amp; Experience:<p><pre><code>  - Experience as a project manager of a medium-sized software development team (10–50 people) \n  - Excellent at communicating effectively, understanding and managing emotions effectively, and social, organizational, and negotiation skills\n  - Exposure to different software development methodologies\n  - A clear understanding of trade-offs between schedule, scope, and quality\n  - Familiarity with open source software and test-driven development\n  - Background in software development&#x2F;engineering\n</code></pre>\nCompensation, Benefits &amp; Logistics<p><pre><code>  - Competitive Salary. Health Insurance plan for US-based employees.\n  - Full time position, 40 hours per week. REMOTE. No relocation required.\n  - “Fun Friday” - 20% time working on any project relevant to Zcash of your choice.\n  - Occasional travel for company meetings or other events is expected, approximately quarterly.\n  - Distributed work of this nature requires strong communication &#x2F; coordination skills. We rely heavily on calendaring, meeting schedules, Slack, and Github to coordinate.\n</code></pre>\nHow to apply: Email a resume and cover letter in text or PDF form to jobs [at] z.cash.","time":1501607928,"type":"comment"}