{"by":"jconley","id":14903141,"parent":14901313,"text":"Redwood City, CA | Full time | ONSITE | <a href=\"http:&#x2F;&#x2F;bravahome.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bravahome.com</a><p>tldr; - We need a DevOps&#x2F;SRE Lead and a Junior&#x2F;Mid Full Stack Web Engineer.<p>You probably haven’t heard of us but we’ve spent the last few years building a better way to cook food. I guess you could call it an IoT device, however, we did way more than just put a screen and wifi connection on an existing technology. We use computer vision, machine learning, various sensors, a completely novel heating system, and applied physics to cook amazing food quickly and consistently. We’ve recently raised a Series B round and are gearing up for launch.<p>On the technology side of the company we have teams of culinary scientists, embedded engineers, software engineers, automation engineers, electrical engineers, mechanical engineers, and even a physics professor. We are all working together to build a great product. Our experienced software engineers have built a myriad of backend software to support our device, mobile apps, and web site. We have to scale always-on connections from our devices as well as mobile and web applications, support auto-updates, an eCommerce system, analytics events, device telemetry, logs, monitoring, machine learning clusters, and more. We’re largely using open source software packaged up in Docker images and orchestrated with Kubernetes, running on a mix of AWS and GCP.  We want our systems to be hosted cross-region, highly available, and cloud-agnostic.<p>We must have secure, performant, and highly available backend systems. Right now we have a gap in our team and are in need of a DevOps Engineer to get our systems production ready.  As the first hire on our DevOps team, you would be responsible for taking ownership of our deployments&#x2F;infrastructure and setting the standard of how we manage it going forward.<p>We also need a Junior&#x2F;Mid level full stack engineer, ideally with a front-end focus, that can help us create all of the things that DevOps engineer will have to manage. We work in Python&#x2F;Django and NodeJS&#x2F;Express, with a largely Postgres&#x2F;Redis&#x2F;Kafka backend.<p>You can email me directly at jd+jobs@bravahome.com","time":1501608449,"type":"comment"}