{"by":"yab","id":14904463,"parent":14901313,"text":"Arzeda | Seattle | Multiple Positions | ONSITE | <a href=\"https:&#x2F;&#x2F;arzeda.com\" rel=\"nofollow\">https:&#x2F;&#x2F;arzeda.com</a><p>We are Arzeda, The Protein Design Company (tm). By using the power of computational and synthetic biology, we create new enzymes and chemical products that can compete on cost, sustainability, and performance. Our platform creates cell factories used at industrial scales to solve problems and create opportunities that would otherwise be impossible.<p>Having raised a $12 mil series A this past month, we are expanding to massively scale up operations. We&#x27;re a heavy consumer of cloud compute and HPC (bursting on the order of 1000s of instances), and are searching for a Senior Cloud Infrastructure Architect to plan, lead, and implement cloud-centric deployment and automation for our computational biochemistry software stack and core services. Operationally this will require knowledge spanning much of what&#x27;s found under the DevOps umbrella, including containerization, configuration management&#x2F;automation, CI&#x2F;CD, &amp; build&#x2F;release engineering. In addition, this hire will directly contribute to our proprietary cloud meta-scheduler (encompassing on-prem, AWS and Azure, with plans for additional public clouds coming online), including developing algorithms for job scheduling and resource provisioning&#x2F;allocation.<p>If you&#x27;re a computational scientist, we also have positions open in cheminformatics&#x2F;bioinformatics&#x2F;metabolic modeling and computational protein design.<p>We are a highly talented and motivated team that spans the complete spectrum from computational scientists &amp; software engineers working in-silico all the way to the wetlab scientists producing our biologically engineered products that are a direct result of our calculations &amp; predictions. Come change the world with us.<p>We offer competitive salaries and industry standard benefits including medical&#x2F;dental&#x2F;vision and 401k. For additional information and the formal job ads, please see our website and its careers page. <a href=\"https:&#x2F;&#x2F;arzeda.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;arzeda.com&#x2F;careers&#x2F;</a><p>Please apply with CV and cover letter to jobs(AT)arzeda.com","time":1501615916,"type":"comment"}