{"by":"colinsidoti","id":14904542,"parent":14901313,"text":"Front-End Engineer - Full time or contract<p>We are looking for a talented front-end engineer with experience in Javascript, HTML, and CSS3 (JQuery and&#x2F;or React a plus). Initial engagement would be for two months, but you can consider this as a direct audition for a full-time position as a Lead Front-End Engineer.<p>You will report directly to the CTO, who is an experienced engineer focused on technical architecture, product management, and back-end development. You will turn our strong product vision first into living, breathing prototypes and finished products.. You recognize that you are joining a young startup, and sometimes that means being flexible with development priorities, and ready to compromise on perfection if necessary.<p>As our first full-time Front-End Engineer, we expect you to bring a passion for understanding our customer and delivering a superior experience for them. This is an ideal role for you if you are an experienced engineer who is eager to test yourself against the hardest front-end problem in the world (making people care about financial planning). We are heavily focused on consumer engagement and view our front-end experience as the most critical differentiation for the business. We are building a top-tier engineering team that will help us revolutionize the financial advice industry--you can expect to work alongside a team that is as talented and hard-working as you are.<p>About Harbor<p>Harbor is improving America&#x27;s retirement security. We are building software to make high-quality financial planning accessible and affordable to the 65% of Americans who are not receiving any today.<p>We provide our users with a beautiful, online experience to design a financial plan that would cost thousands of dollars from a professional advisor. To enable that, we are developing a financial planning platform that is automated (where possible), intuitive, and educational to use. We are maniacally focused on making it easier for the average American to actually think about their finances, and are building a best-in-industry user experience to achieve that.<p>We are an early-stage start-up with a powerful mission and a small but high-calibre founding team: 3 co-founders educated at Harvard and MIT, extensive professional experience in financial services, management consulting, and engineering, and are one of 10 teams in the Techstars Chicago accelerator program.<p>Note: following the program&#x27;s completion in October, we will relocate to Boston, New York, or San Francisco, depending on what&#x27;s best for the business.<p>If interested, please contact colin@harborpension.com with your resume and a little about yourself.","time":1501616335,"type":"comment"}