{"by":"davezatch","id":14902105,"parent":14901313,"text":"Uberall | Frontend Engineer | Berlin, Germany | Full-time, Onsite, Visa | <a href=\"https:&#x2F;&#x2F;uberall.com&#x2F;en&#x2F;careers?postingId=mp0mmqv\" rel=\"nofollow\">https:&#x2F;&#x2F;uberall.com&#x2F;en&#x2F;careers?postingId=mp0mmqv</a><p>WE ARE UBERALL – We are a tech-startup from Berlin that develops Europe&#x27;s leading Geomarketing Platform.<p>It is our mission to contribute to this evolution by bringing online everything that&#x27;s local, to provide complete and accurate information whenever and wherever needed - On our phones and on our tablets. On our PCs and in our in-car GPS systems. On websites and in apps. For known use-cases and upcoming opportunities.<p>We are a very ambitious company and are proud to focus on engineering. By now we have a very professional, skilled and fun team. Our tech stack is built on Groovy and Grails + enterprise proven technologies like Hibernate, Tomcat, Redis on the back-end side, and HTML5, JavaScript (ES2015, React, Redux, etc.), LESS, dogfooding our own REST API on the front-end.<p>We are looking for Frontend Engineers (m&#x2F;f) to support our tech team. You will be working closely with product development and be responsible for turning their wildest dreams into reality.<p>About you:<p>- You take ownership of your work, &amp; for you a feature is done when it makes using the product a better experience for all users<p>- Passion for all things in the browser, experience with modern frontend web technologies<p>- Creativity! We&#x27;re open here, and if you&#x27;ve got a great idea, we want to know about it<p>- You understand the importance of quality and testing, you value automated testing as much as we do and see it as an integral part of the process<p>- You value maintainability, so clean &amp; organized code goes without saying<p>What you would do at uberall:<p>- Build extensible widgets, pushing for the simplest integration of our latest functionality<p>- Develop our web-apps that our customers use every day to manage anywhere from 50 to 10s of thousands of business listings<p>- Build a reference connection to our extensive Rest API that both our partners and our own client apps us<p>To apply: <a href=\"https:&#x2F;&#x2F;uberall.com&#x2F;en&#x2F;careers?postingId=mp0mmqv\" rel=\"nofollow\">https:&#x2F;&#x2F;uberall.com&#x2F;en&#x2F;careers?postingId=mp0mmqv</a> or send an email to jobs@uberall.com.","time":1501603112,"type":"comment"}