{"by":"linkmotion","id":14909477,"parent":14901313,"text":"Link Motion | Senior Linux Platform Developer | ONSITE Tampere&#x2F;Helsinki Finland or REMOTE in EU | Full-time<p>Link Motion is a technology company developing a secure connected car computer, in other words known as &quot;carputer&quot;. Our system is an all-in-one solution, consolidating multiple functions traditionally handled by discrete computers into a single, powerful system. The computer is designed to drive connectivity, instrument cluster display, infotainment display and a third display (e.g. HUD) simultaneously. The software stack on the application processor is based on Linux.<p>Job description:\nWe are looking for a person with good hands-on skills with Linux development to join our platform development team.<p>Your responsibilities are:<p>- Development of Linux platforms, including platform component maintenance, implementing new features, porting software to hardware and debugging software issues<p>- Documentation and architectural design of software components<p>- Performance optimization<p>- Testing<p>We have tasks with varying levels of difficulty ranging from solving complex problems involving Linux internals, multiple components and hardware to more straightforward development. You can work on tasks that best suit your experience level.<p>Requirements:<p>- Ability to solve technical problems, particularly familiar with C&#x2F;C++ development<p>- Comfortable working with prototype boards and BSPs<p>- Knowledge of boot loaders and the Linux kernel<p>- A genuine interest in system level design and utilizing the low level features to enable creating great user experience for the end users<p>- Good communication skills in English for using issue trackers and remote communication tools<p>To apply for the position, send your free-form application and CV via email to jobs@link-motion.com. In the subject line enter &quot;REKRY: Senior Linux Platform Developer&quot; to ensure quick reply.","time":1501670668,"type":"comment"}