{"by":"tonyleask","id":14906442,"kids":[14929557],"parent":14901313,"text":"Dictionary.com | Multiple Developer Openings | Oakland, CA &amp; Los Angeles, CA | ONSITE, FTE, VISA, SALARY:DOE, <a href=\"http:&#x2F;&#x2F;www.dictionary.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dictionary.com</a><p>Do you love to build and launch products at consumer scale? Do you thrive in small team environments? Do you have a strong preference for TDD &#x2F; BDD or similar development methodologies? Do you have a strong track record of continuously improving great software? Each month, Dictionary.com helps more than 70 million monthly users attain language success. Our leading mobile applications have been downloaded more than 100 million times – and we are just getting started! We are hard at work reinventing the dictionary as a platform that will enable and inspire social connection, communication, learning, creativity and expression in the connected world. We are looking for experienced, full-stack software engineers who have dealt with the challenges of scaling consumer applications.<p>Skills needed:\n- Mastery at least one modern (PHP, JavaScript, Ruby) backend stack. - Work experience with any of the following: Node, React or Angular.js. - Solid understanding of both SQL and NoSQL; strong experience with at least one NoSQL-database. - Strong knowledge of *nix.<p>Benefits: - Unlimited vacation - Competitive salary plus bonus - Great benefits (medical, dental, vision, 401k matching, legal insurance, pet insurance) - Unlimited snacks&#x2F;drinks, frozen yogurt and beer on tap in our barcade (as in beer and arcades) - Relocation assistance (if moving to the SF Bay Area) - Close to many public transit options (BART, Ferry, AC Transit) - Subsidized dollars towards public transit or parking garage - Tuition Reimbursement<p>OUR CURRENT OPENINGs\nSenior Software Engineer (Oakland): <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;d_HWGg\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;d_HWGg</a>\nFull-Stack Developer (Oakland): <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;hLIKEA\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;hLIKEA</a>\nSenior Software Engineer (Los Angeles): <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;2LpMkw\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;2LpMkw</a><p>For a list of all our current openings, visit: <a href=\"http:&#x2F;&#x2F;content.dictionary.com&#x2F;about&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;content.dictionary.com&#x2F;about&#x2F;careers</a> (or e-mail jobs@dictionary.com)<p>About our company: <a href=\"http:&#x2F;&#x2F;content.dictionary.com\" rel=\"nofollow\">http:&#x2F;&#x2F;content.dictionary.com</a> For more jobs, visit: <a href=\"http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings\" rel=\"nofollow\">http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings</a>","time":1501629875,"type":"comment"}