{"by":"krg","id":14901389,"parent":14901313,"text":"TechEmpower - Los Angeles area, California (El Segundo, near LAX) - ONSITE<p>We&#x27;re looking for good programmers with an interest in web development. If you&#x27;re smart and motivated, and you want to work in a supportive environment, then let&#x27;s talk.<p>TechEmpower is a custom software company. We help our clients understand their needs, plan solutions for them, and build software -- on time and on target. By taking away their technical headaches, we help our clients succeed.<p>- We&#x27;re small.  We have 30 employees and we work in teams of 1-6.<p>- We&#x27;re friendly.  Our office is professional and collegiate, like a computer lab staffed by adults.  We help each other out.<p>- We&#x27;re mostly a web shop.  We do a bit of desktop, and a bit of native mobile, but 90% of our work is creating complex web applications.<p>- We work with a wide range of technologies (see Technologies below) but Java is first in our heart.<p>- We&#x27;re established.  We were founded way back in 1997, which means we&#x27;ve continued to grow despite the dot-com bomb, the great recession, and several hurricanes.<p>- We&#x27;re the authority on web framework performance (<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;hashtag&#x2F;techempower\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;hashtag&#x2F;techempower</a>)<p>The technologies we use vary over time with our mix of projects. Here is a snapshot of what we&#x27;re using now:<p>Languages: Java, JavaScript, Python, Go, C#, Ruby, PHP<p>Tools: Git, Docker, Jenkins, Sonar, IntelliJ, Eclipse, Ant, Maven<p>Web: Jersey, .NET Core, React, Django, Node.js, Go, Rails, Handlebars, Backbone, Ember, Angular, Knockout, Servlets, jQuery<p>Mobile: iOS, Android, PhoneGap<p>Hosting: AWS, Rackspace Cloud, Linux deployments<p>Data Persistence: ORM (Hibernate, etc.), Postgres, MySQL, MS SQL Server, NoSQL (Redis, Riak, etc.)<p>We don&#x27;t expect new hires to have experience with all of these, but we do expect you&#x27;ll learn more about them every day.<p><a href=\"http:&#x2F;&#x2F;jobs.techempower.com&#x2F;hn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.techempower.com&#x2F;hn</a>","time":1501599897,"type":"comment"}