{"by":"numbsafari","id":14903100,"parent":14901313,"text":"Bainbridge Health | <a href=\"http:&#x2F;&#x2F;bainbridgehealth.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bainbridgehealth.com</a> | Philadelphia, PA | JS, Data Science | ONSITE | Fulltime<p>A spinout of the Children&#x27;s Hospital of Philadelphia (CHOP), Bainbridge Health is making the hospital a safer place for patients. We are building a data analytics and clinical intelligence system for hospital medication safety management. We are integrating transactional data from the multiple devices and systems involved in the medication ordering, preparation, supply chain, and administration pipeline, turning siloed data into actionable insight and preventing errors before they ever reach patients.<p>Our stack: Python, Go, VueJS, Kubernetes, BigQuery, GCP. You&#x27;ll be getting in early, so you&#x27;ll have a chance to help shape and grow all of this.<p>Our office is in Center City Philly, convenient to transit and all the good things a major city can offer.<p>You can apply via our careers page, <a href=\"http:&#x2F;&#x2F;www.bainbridgehealth.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bainbridgehealth.com&#x2F;careers</a>, or by emailing me using the address in my profile.<p>We are currently very actively looking for a clinical data analyst to help support both product development and customer clinical support. You would be working in a very hands-on fashion with the medication safety teams at some of the most prominent hospitals in the country to drive real-world improvements in medication delivery. This isn&#x27;t ad-tech, this is actually improving and saving lives.<p>We are also very interested in hiring a front-end engineer who is interested in data visualization. This is an opportunity to build incredibly useful tools that save professionals huge amounts of time and drive executive-level decisions at some of the largest healthcare organizations in the country.","time":1501608246,"type":"comment"}