{"by":"arc12","id":14903157,"parent":14901313,"text":"Nest Labs | Software Engineer, Frontend | Palo Alto, CA | Onsite<p>The Web Applications team is looking for a motivated engineer willing to work on tough problems. We build and maintain a growing React &#x2F; Redux based front-end with a truly global user base. You&#x27;d be joining an experienced and diverse team of folks working on new products and truly exciting frontiers - pushing the boundaries of new technology and Web APIs. Taking on such tasks will lead you to working cross functionally with many people including the Nest hardware, and Design teams. Our aggressive browser support matrix and ambitious hardware integrations&#x2F;support goals put Nest&#x27;s Web App team in a truly unique and exciting place.<p>Our work usually includes (but is not limited to):\n* Designing and implementing the best web application possible alongside some truly top-tier engineers (and just great people to be around). \n* Investigating new web technologies and evaluating how they could benefit Nest&#x27;s product line and user experience - always looking for a way to deliver more Nest magic.\n* Participating in fun team activities such as lunches and informal discussions\n* Working cross-functionally to ship the best features&#x2F;products possible across dozens of countries and locales.<p>Preferred Qualifications\n<i>Deep understanding of modern Javascript (ES6+), CSS, HTML, and web application design\n</i> Familiarity with modern frameworks and Web APIs\n* Experience with Agile development process\n* Strong attention to detail - from design through code to testing\n* Comfort with ambiguity, rapid release cycles, and tight schedules\n* Demonstrated expertise in problem-solving and technical innovation.<p>Email cameronhill [at] nestlabs.com with questions.<p>We also have many other roles in hardware, embedded, cloud, design, etc here: <a href=\"https:&#x2F;&#x2F;nest.com&#x2F;careers&#x2F;positions&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;nest.com&#x2F;careers&#x2F;positions&#x2F;</a>","time":1501608525,"type":"comment"}