{"by":"runna-othman","id":14905527,"parent":14901313,"text":"Neighborhoods.com is hiring an ONSITE Software Engineer. (Chicago, IL)  \nApply: www.neighborhoods.com&#x2F;careers<p>Who We Are:<p>Neighborhoods.com is a real estate resource that helps people find the perfect home as well as the ideal neighborhood. We believe that the neighborhood you live in is just as important as the home you live in. The people, places, schools and amenities that surround your home have an enormous impact on your quality of life. When you&#x27;re looking for a place to live, you aren&#x27;t just picking out a house. You are also deciding who your children will play with and who you might become friends with. So while many people search for their dream house, we believe you should look for your dream home. And your neighborhood is a huge part of that dream.<p>Software Engineers are responsible for developing and maintaining Neighborhoods.com as well as our other products. Specific tasks include new feature development, data management and integration, enhancing our existing feature set, and designing technical solutions to complex problems. This is an excellent opportunity if you like working with newer technologies and toolsets to solve difficult problems..<p>Essential Qualifications:<p>Knowledge of at least one object-oriented programming language (we use PHP)\nExperience with framework usage and best practices\nUnderstanding of common web stacks (apache, nginx, etc.)\nExperience working with relational database systems (MySQL, Postgres, etc.) and NoSQL databases.\nAn interest in working with new technologies<p>What You&#x27;ll be doing:<p>Developing code and technical designs for existing and new products, with a strong focus on quality, performance and maintainability.\nWorking in a microservice-oriented suite of applications written mostly in PHP.\nUsing tools including AWS, Docker, Vagrant, Terraform and Jenkins to deploy to dynamic, scalable environments.\nParticipating in our engineering culture, with an emphasis on contributing ideas, thoughts, and constructive feedback regarding the work of others on our team.\nWorking with the engineering team to continually define and refine our technical practices and toolsets.\nCollaborating with designers, front-end developers, and product stakeholders to deliver technical solutions to complex problems.\nCreating and managing data integrations with large, complex third party data stores.\nAssisting with interviewing, onboarding, and training engineers as they join the team.\nParticipating in code reviews, both of your code and of others.","time":1501622869,"type":"comment"}