{"by":"karatkier","id":14908282,"parent":14901313,"text":"Karat | Software Engineer | Seattle, WA | Full time | <a href=\"https:&#x2F;&#x2F;www.karat.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.karat.io</a><p>As a member of Karat&#x27;s engineering team, you will get to work on an exciting mission with a superstar team that feels like family.  You will be able to easily relate to the product given that we&#x27;ve all been through technical interviews.  We work in a Ruby and Unix environment, practice continuous integration and regularly unit test.  As we are a young company, you will receive close mentorship from industry veterans as you help us to shape the premium interviewing experience we are endeavoring to create.  We want individuals who are hungry to take ownership of their work and who want to make a significant impact.   We believe that a flexible work environment is where people are most comfortable and productive.<p>About You<p>- You believe in our mission and crave the ownership and responsibility we will give you.<p>- You have strong experience in a dynamic language used for web development, such as Ruby, Python, or Go<p>- You are comfortable working on dynamic websites using AJAX and modern frameworks like Angular or React, as well as plain old JavaScript<p>- You’ve worked on web apps - you know how HTTP, Rest, and web security works<p>- You are at home in a Unix&#x2F;Linux workflow<p>- You have a distinct passion for product driven development and you love writing clean, understandable, and maintainable code<p>- You have a desire to learn and improve your craftsmanship, plus you will always go the extra mile to provide happiness to your customers<p>Interviewing, teaching, or mentoring experience is a plus as it will help you relate to our mission and culture.<p>Interested? Apply here:<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;586c77ea-5c3a-40e6-a940-f74ffeba7262\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;586c77ea-5c3a-40e6-a940-f74ffeba...</a>","time":1501653995,"type":"comment"}