{"by":"ashok-s","id":14911678,"parent":14901313,"text":"integral.io | detroit, mi | onsite | full-time | agile engineer<p>Software is eating the automobile: \nWe offer automakers with the agility and innovation of a startup. As the automotive industry shifts toward new technologies, we integrate the latest advances with established capabilities.<p>Developers with courage:\nWe are a recently launched Detroit-based startup focused on helping our automotive clients by\ndelivering better software than they have ever seen before. Our team is looking for software practitioners who are dedicated to writing amazing code in order to deliver critical products and systems.<p>Collaborative craftsmanship:\nWe want developers with all types of experience and a passion to make yourself and those around you better every day. We practice paired programming to share our knowledge while focusing on quality, so you should be comfortable writing code with another person for 6-8 hours each day.<p>Test driven development and transportation:\nWe have all worked for companies who pay lip service to the idea of being agile or doing test driven development. Not here. We challenge ourselves and our clients to deliver code that keeps on giving long after it was first written. \nIf you love arguing about TDD or IOC containers over a cold beverage and then taking that conversation and applying to critical applications in the automotive space, you will fit right in at Integral.<p>Things We Love to See:\n● Passion to learn and share knowledge with others\n● Proficiency in a modern front-end and back-end technology stack\n● Experience with TDD and XP\n● Fluency in cloud deployment and 12-Factor app methodology\n● A comfort interfacing with clients to understand and translate their product requirements\n● A code sample you’re proud (and permitted) to walk us through<p>Benefits\nCompetitive salary, Equity for early employees, Growth opportunities with a rapidly growing company, Daily catered breakfast, Weekly catered lunch &amp; learn sessions, Latest hardware and equipment, Team offsites, Medical plan, Fitness membership reimbursement<p>Send a cover letter and resume to careers@integral.io","time":1501689878,"type":"comment"}