{"by":"leadpages","id":14911395,"parent":14901313,"text":"Leadpages (www.Leadpages.net) - Minneapolis, MN | Full Time | ON-SITE or REMOTE* | Now Hiring Senior Python Engineers, Senior Rails Developers, Senior JS App Engineers and Customer Success team members!<p>Leadpages is a Minneapolis-based SaaS startup and we focus on conversion optimization software. We&#x27;re 100% committed to diversifying our team to include all members of the Python, Ruby, Java, and PHP communities - we&#x27;ve found that through this diversity, we&#x27;re able to grow in infinite ways and build great things. We have an excellent culture that is light years ahead of the industry and a great appreciation for work-life balance (we practice this heavily!). We welcome remote applicants but if you are local, we also work from home two days per week with the other three days from our incredible downtown Minneapolis office.<p>What we’re using…<p>For Leadpages&#x27; flagship application, the landing page builder, we’re using a fantastic Python REST API stack based on the Falcon framework and running in Kubernetes. Our Distributed Systems team is using Scala and Akka, while our DevOps team is using Docker, Ansible, Grafana, Kibana, Jenkins, ElasticSearch and Google Compute Engine. On the front end, we’re using modern JS tools like React, Redux, Babel and venturing into Next.<p>Our Drip product team is busy scaling one of the MarTec industry’s most impressive marketing automation platforms to date. It’s a beautiful Ruby app that’s built on Rails 4 (soon to be Rails 5!), AWS, JSON, Sidekiq, Redis for caching, ElasticSearch, Ansible, Flight, PostgreSQL, and Vanilla JS.<p>If anything caught your eye, please apply using the links below! We currently have opportunities available for:<p>- Senior Python Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2qLeBRq\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2qLeBRq</a><p>- Senior Ruby on Rails Developer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2w2nAkX\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2w2nAkX</a><p>- Senior JavaScript Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2sjK0w8\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2sjK0w8</a><p>- Senior Software Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2rvL16m\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2rvL16m</a><p>* At this time, only the Senior Python and Senior Software Engineer positions have 100% remote options.<p><i>These are all full-time positions with excellent benefits including Medical, Dental, Vision, 401k (+match), Open PTO, Flexible Schedules, Work From Home days, and more! We even offer generous relocation packages to help you relocate to beautiful Minneapolis, MN, if you are open to relocating.</i><p>If you&#x27;re interested in seeing any other open positions within our Marketing, Product, HR&#x2F;Recruiting, Customer Success or Operations teams, check out our website at <a href=\"http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers</a><p>Interested in emailing us directly? You can reach me at Tiffany@Ave81.com (no agencies or 3rd parties, please!)<p>Let’s build something awesome!","time":1501688284,"type":"comment"}