{"by":"bessemer","id":14963474,"parent":14901313,"text":"Bessemer Alliance | Software Engineer, Senior UX Designer | Pittsburgh, PA | ONSITE<p>=== Who We Are ===<p>Bessemer Alliance is a small business and design consulting firm based in Pittsburgh, PA. Our client base is diverse, ranging from small startups to global Fortune 100 companies. Our client engagements typically involve research, strategy, design. In addition to client work, we are working on a top-secret, internally-developed product that is slated for limited release in Q1 2018 (it is going to be great). You are getting in on the ground floor, and will be pivotal to this new product&#x27;s success in the years to come.<p>=== Who We Are Looking For ===<p>Software Engineer \n- This role would be dedicated to working on our stealth startup. We are looking for an experienced engineer to work with our top-notch design and development team, taking ownership of our full-stack application using these technologies: Node.js, ES6, MongoDB, Redis, ElasticSearch, Ampersand.js, and Heroku. \n- Learn more at <a href=\"http:&#x2F;&#x2F;voyant.applytojob.com&#x2F;apply&#x2F;qlK5266xDv&#x2F;Software-Engineer-Full-Stack\" rel=\"nofollow\">http:&#x2F;&#x2F;voyant.applytojob.com&#x2F;apply&#x2F;qlK5266xDv&#x2F;Software-Engin...</a><p>Senior UX Designer \n- This role would be focused primarily on consulting work, while lending a hand to our stealth startup as needed. We are looking for someone strong in research and interaction design, but able to work across the design process. You should be as comfortable conducting contextual inquiry as you are prototyping in Principle. \n- Learn more at <a href=\"http:&#x2F;&#x2F;voyant.applytojob.com&#x2F;apply&#x2F;uS4K1ZyIIL&#x2F;Senior-UX-Designer\" rel=\"nofollow\">http:&#x2F;&#x2F;voyant.applytojob.com&#x2F;apply&#x2F;uS4K1ZyIIL&#x2F;Senior-UX-Desi...</a><p>=== Interested? ===<p>Apply at the links above, or feel free to email me at spencer@bessemeralliance.com.","time":1502230788,"type":"comment"}