{"by":"dogas","id":13766691,"kids":[13766744,13767413],"parent":13764728,"text":"ConvertKit | Senior Rails Engineer | REMOTE<p>ConvertKit is looking for Senior Rails Engineers.<p>* We are a 100% remote company, scattered across 8 states and 4 countries.  There is no central office.<p>* Bootstrapped, profitable, and growing very quickly (See for yourself! <a href=\"https:&#x2F;&#x2F;convertkit.baremetrics.com\" rel=\"nofollow\">https:&#x2F;&#x2F;convertkit.baremetrics.com</a>)<p>* We put a high emphasis on work &#x2F; life balance, and we value and strive for 40 hour work weeks.<p>* We have a positive, vibrant, and genuine culture. (see <a href=\"https:&#x2F;&#x2F;charlimarie.com&#x2F;2017&#x2F;02&#x2F;06&#x2F;finding-my-place\" rel=\"nofollow\">https:&#x2F;&#x2F;charlimarie.com&#x2F;2017&#x2F;02&#x2F;06&#x2F;finding-my-place</a>)<p><i>About the role</i><p>You&#x27;ll be part of our awesome engineering team, helping to build our product. We primarily use Rails, Mysql, Redis and Sidekiq to get the job done. We&#x27;re facing real (fun) scaling challenges because of our incredible growth. Ideally\nyou&#x27;ve been there, done that before.<p>We&#x27;re also looking for someone who cares deeply about writing clean, maintainable, well-tested code, and generally tends to leave code in a better state than when they encountered it.<p><i>About you</i><p>You’re a perfect fit for this role if you’ve got experience developing software, love pragmatic OO design for its long-term cost benefits, and testing. Clean code is not just a phrase for you. Given our high rate of growth, you&#x27;ll need to have strong knowledge of scaling Rails applications up.<p><i>Benefits:</i><p>* 3 weeks paid vacation, 7 paid holidays, and 3 sick days &#x2F; year.  4 weeks paid vacation after a year of employment.<p>* The team gathers twice a year in-person for fantastic team retreats (<a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;1L0en33hfqI\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;1L0en33hfqI</a>)<p>* Excellent Health benefits.<p>* 8 weeks paid maternity &#x2F; 4 weeks paid paternity leave.<p>* $2500 equipment allowance given every 2 years.<p>* 4% matching 401k.<p>* Conference credit.<p>* $1,000 yearly vacation bonus.<p>* Profit sharing!<p>Apply here:  <a href=\"https:&#x2F;&#x2F;convertkit.workable.com&#x2F;jobs&#x2F;431034&#x2F;candidates&#x2F;new\" rel=\"nofollow\">https:&#x2F;&#x2F;convertkit.workable.com&#x2F;jobs&#x2F;431034&#x2F;candidates&#x2F;new</a>","time":1488393073,"type":"comment"}