{"by":"Charlie_K","id":13767500,"parent":13764728,"text":"Intersection Co. www.intersection.com | Hardware Engineering, Lead | New York, NY | onsite | Full time<p>The Hardware Engineering Lead will serve as the technical lead for the design, sourcing, prototyping, testing, manufacture, integration, and evolution of hardware components in Intersection’s Urban Technology Platform.\nWe are looking for someone to own the architecture, design and evolution of our hardware platform, creating the protocols and artifacts to capture customer needs and transforming them into concepts, designs and specifications\nEnsure the tight integration of hardware within Intersection’s broader product portfolio; particularly across software, operations, administration, and consumer experience.\nDefine toolkits and standards to maximize design consistency, compatibility, modularity, and reuse while supporting innovation and maximizing the customer experience\nDrive sourcing including vendor identification, selection, contract negotiation and renewal\nManage manufacturing to deliver designs meeting schedule, budget, and quality requirements.\nContinuously improve new and existing hardware based on feedback from internal&#x2F;external stakeholders, field operations, and identifying and resolving technical challenges.\nEnsure compliance with all appropriate industry and government standards and certifications<p>M.S&#x2F;M.Eng. in Mechanical, BioMedical, Computer, Electrical Engineering\n7+ years of commercial&#x2F;industrial electrical or embedded product design experience\nProduct management experience with a P&amp;L mindset\nKnowledge of network protocols, equipment, deployment, and operations\nDesign for manufacture, Lean Six Sigma or green belt certification<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;intersection&#x2F;jobs&#x2F;535306#.WLcjtRIrLUI\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;intersection&#x2F;jobs&#x2F;535306#.WLcjt...</a>","time":1488397397,"type":"comment"}