{"by":"Infosourcer","id":13766616,"parent":13764728,"text":"Cloudera | <a href=\"https:&#x2F;&#x2F;www.cloudera.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudera.com&#x2F;</a> | Software Engineers | Palo Alto, CA | Onsite | Returnship<p>Cloudera, a leader in Big Data and Open Source, was founded in 2008 by some of the brightest minds at Silicon Valley’s leading companies—including Google (Christophe Bisciglia), Yahoo! (Amr Awadallah), Oracle (Mike Olson), and Facebook (Jeff Hammerbacher). Doug Cutting, co-creator of Hadoop, joined the company in 2009 as Chief Architect and remains in that role. Today, Cloudera has over 1,600 employees across the globe-and looking to add more!<p>This month, we are highlighting the Path Forward Return to Work program at Cloudera: This is a 16- week paid internship for experienced professionals returning to the workforce after taking time off for caregiving. The program is open to women and men who have at least 5 years of professional experience and have been out of the paid workforce for at least two years to focus on caring for a child or other dependent. If you meet these criteria, we welcome you to apply.<p>At Cloudera, we are excited to be part of the Path Forward program because we appreciate the skills you can offer, the perspective you provide, and the contributions you will make. This program offers you a chance to revamp your skills, update your resume with new experience, and make connections with other women and men transitioning back to the workforce. It also offers support through Path Forward, a nonprofit organization on a mission to empower people who’ve been focused on caregiving transition back to the paid workforce.<p>To apply check out these links:<p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3g1msiwS\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3g1msiwS</a><p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3r2msiw4\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3r2msiw4</a><p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3A2msiwd\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3A2msiwd</a>","time":1488392632,"type":"comment"}