{"by":"jackhack","id":13768643,"kids":[13772143],"parent":13764728,"text":"Duke University School of Medicine | Jr. and Sr. level Software Developer | Durham, North Carolina, USA<p>Office of Research Informatics Developer I   Requisition Number 401227399\nOffice of Research Informatics Developer II  Requisition Number 401227397<p><a href=\"https:&#x2F;&#x2F;sjobs.brassring.com&#x2F;TGnewUI&#x2F;Search&#x2F;Home&#x2F;Home?partnerid=25017&amp;siteid=5172##keyWordSearch=Office%20of%20Research%20Informatics%20Developer\" rel=\"nofollow\">https:&#x2F;&#x2F;sjobs.brassring.com&#x2F;TGnewUI&#x2F;Search&#x2F;Home&#x2F;Home?partner...</a><p>The Office of Research Informatics represents a custom software development group within the Duke University School of Medicine. We are currently building applications to support Big Data, machine learning, and Precision Medicine efforts. Our aim is to use technology in the service of patient care and the research necessary to improve that care.<p>What we want:<p>You’ll guide us in choosing tools, technologies, languages and approach that fit the job at hand, balancing “shiny new tech” vs. “dependable known toolsets” and making the argument for one approach over another to design a solution. Our systems must be rugged, robust, structurally sound and scalable. We’ll lay out a set of technologies and design a solution that delivers fast results while keeping an eye toward our long-term goals. A love for efficiency, simplicity, elegance will help us make wise technology choices.<p>We’ll be watching metrics to look where we can improve performance, finding bottlenecks, and working through them to deliver scalability to support a workgroup, a department, or an institution.<p>A background in bioinformatics or statistics is helpful, as is a love for clean code, elegant solutions, and a drive to do more than just create widgets – we deliver solutions that improve lives.<p>The details of our work will necessarily vary: manipulate data in R, work with SAS, design a database schema, build a quick script in Python, review some Ruby code, build a microservice, consume resources from around the University (or around the world), build a website, create a backend microservice, etc. These are suggestions and we understand there are a million ways to solve a problem -- you tell us the right tools for the job.<p>What we offer<p>Stability of a large organization but with the flexibility of a small team.\nFreedom from formal process. Fast cycles and authority to make decisions. A beautiful office at American Tobacco Campus (downtown Durham, NC, next to Durham Bulls ballpark, restaurants, etc.). Freedom to “tinker” and explore ideas. A chance to serve as the exemplar for research software solutions development.” Great benefits, solid pay and an opportunity to make a difference doing work that matters.","time":1488404096,"type":"comment"}