{"by":"nutonomy","id":13765953,"kids":[13790329],"parent":13764728,"text":"nuTonomy | Software Engineer - Tools and Infrastructure for self-driving cars |  Cambridge (MA), Santa Monica (CA), Singapore | VISA <a href=\"http:&#x2F;&#x2F;nutonomy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;nutonomy.com</a><p>nuTonomy aims to be the first company in the world to launch an autonomous taxi system, and we are building up an awesome team to make this goal a reality. nuTonomy is developing the first-of-its-kind complete solution for providing point-to-point mobility via large fleets of autonomous vehicles. This includes software for autonomous vehicle navigation in urban environments, smartphone-based ride hailing, fleet routing and management, and controlling a vehicle remotely through teleoperation. The company’s software has been tested in the U.S., Singapore, and Europe. For more information about nuTonomy, visit: <a href=\"http:&#x2F;&#x2F;nutonomy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;nutonomy.com</a><p>We are seeking talented software engineers to help develop and roll out the next generation of our highly advanced infrastructure and the supporting tools for autonomous driving.<p>Job Responsibilities:<p>* Develop scalable infrastructure for our autonomous driving operations<p>* Work closely with all teams to understand needs, come up with testing&#x2F;tooling plans, and implement functionality<p>* Assist with high-level analysis, design, and code reviews<p>Education and Experience<p>* MS or BS in computer science or related field\n* 3+ years professional work experience as software engineer<p>Core Skills<p>* Excellent C++&#x2F;Python development skills on Linux platforms\n* Experience working with distributed storage systems that span cloud and in-house servers\n* Experience designing and coding unit tests for complex systems\n* Prior experience with developing test plans, software stress testing, and designing large scale integration tests\n* Experience with software engineering tools (e.g., Git, CMake, CI, gdb, etc.)<p>Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;d7gxie1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;d7gxie1</a>","time":1488389427,"type":"comment"}