{"by":"dannybeard","id":13766009,"parent":13764728,"text":"Arthrex Inc. | Developer &amp; DevOps Engineer | Naples, FL | Full time, Remote, Onsite<p>Software Developer\n----------------------------\nWe are looking for developers with either web or mobile experience to join our growing team in southwest Florida. Arthrex is a global medical device company and a leader in new product development and medical education in orthopaedics. As the software development team, we create innovative products to help support the company in education and research opportunities for our customers. Some projects that need immediate assistance include:<p>- Our main company website that serves as an education portal for our customers with tools and resources on our products\n- A research registry that is being used by surgeons to track their patient&#x27;s progress both pre and post surgery\n- Patient engagement software facilitating communication between the surgeon and the patient\n- Several innovative mobile applications that further educate surgeons on best practices and new techniques<p>Some of the technologies&#x2F;patterns we work with:\n- Golang, Ruby, Objective-C, Swift, Java, Xamarin&#x2F;C#\n- Amazon Web Services\n- Postgres\n- Microservices<p>DevOps Engineer\n----------------------------\nWe are looking for an experienced DevOps engineer to join our team and take ownership over of multiple production deployments and supporting services across our deployment\n- Experience with AWS services\n- Experience with Docker and orchestration of containers in a production environment\n- Hands on experience developing, deploying, and maintaining Rails, Go or similar technologies required. We expect DevOps engineers to work closely with the development team, and pitch in and help where needed.\n- Experience with running microservices, and architecture around microservices is a plus<p>Please email dbeard at arthrex.com if you have any questions or interest!\nArthrex was voted one for the top 100 places to work in 2016! Read more here: <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;best-companies&#x2F;arthrex-62&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;best-companies&#x2F;arthrex-62&#x2F;</a>","time":1488389650,"type":"comment"}