{"by":"cloudcommuting","id":13766845,"parent":13764728,"text":"DialMyCalls (<a href=\"https:&#x2F;&#x2F;www.dialmycalls.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dialmycalls.com</a>) is a web-based mass notification system that lets anyone easily send a call, text, and&#x2F;or email to a group of people within seconds. Founded in 2008, we have grown to over 100,000 users from all over the United States and Canada. We have offices in both Jupiter, Florida and Houston, Texas as well as a handful of team members who work remotely. Our customers consist of everything from small little league teams to huge Fortune 100 companies. Beyond businesses and organizations, we have thousands of schools and churches who use DialMyCalls to get their messages sent out quickly and reliably.<p>We are at the stage of the company where we&#x27;re looking for an experienced leader to take the role of VP of Operations. We are hiring someone who is passionate about our technology with an in-depth understanding of web-based companies who target B2B customers. The ideal candidate is someone who has proven experience working and growing other heavily tech-based companies in the past. You should also be very comfortable working with a distributed team where many team members are in different offices.<p>As VP of Operations you&#x27;ll be working closely with the founders of DialMyCalls in order to help the company grow and achieve its strategic goals. Day-to-day responsibilities will include working with our team members to execute new initiatives and ensure quality while existing procedures are being kept up. You&#x27;ll also be working heavily with our sales and lead generation teams to continue to build out our funnels and ensure as many customers as possible are being closed.<p>An energetic, goal-oriented team player will thrive at our company. Our existing team members are all strong and dedicated, with the right person to help lead the day-to-day operations we&#x27;ll be able to push ahead further and faster than ever before.<p>Responsibilities Include:<p>- Working with and expanding the sales team to ensure more customers are being brought through the sales process.<p>- Coordinate with lead generation team to target new sources of business. Help follow through with new initiatives in the lead generation process.<p>- Work with the customer support team to help ensure customers are being assisted to the maximum extent of our ability.<p>- Work to improve our net promoter score and maintain high levels of customer satisfaction.<p>- Coordinate with all teams to help execute new product releases in a project management role.<p>- Lead the operations team and hold weekly accountability meetings.<p>- Help set goals and help different departments hit those goals and celebrate their victories.<p>- Help hit and exceed the overall company&#x27;s growth targets including sales and user acquisition.<p>- Contribute to high-level strategic decisions with the rest of sales, development, and executive teams.<p>Ideally we&#x27;re looking for someone to work out of our Houston, Texas or Jupiter, Florida office. However for candidates with a strong and proven track record with a distributed team, working remote is also a possibility.<p>Competitive starting salary plus bonuses and goals.<p>Our team is laid back but hard workers, someone with a good work ethic but also a good personality will be a great fit. We&#x27;re looking for someone who we can really grow the company with and be a great fit with our current founders and team members.<p>If this sounds like a good fit for you, we&#x27;d love to talk!  You can apply on our site at: \n<a href=\"https:&#x2F;&#x2F;www.dialmycalls.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dialmycalls.com&#x2F;careers.html</a>","time":1488393832,"type":"comment"}