{"by":"freen","id":13767866,"parent":13764728,"text":"Blue Ridge Labs @ Robin Hood | Full Stack Engineer | New York City | Onsite | <a href=\"https:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;</a><p>Our Fellowship helps top developers, designers, product managers, and “experts” (whether that be academic, professional, or people with lived experiences) build new digital tools for low-income New Yorkers. We start with an intensive eight-week Research Phase, delving deeply into the lived experience of people to discover insights that lead to potential product ideas. Followed by an 80-day Build Sprint, where the best ideas a that come out of the Research Phase are tested, validated, and built.<p>Our previous Fellows, joining us from places like Facebook, Linkedin, Google, Twitter and more, have created new social ventures that fight poverty. Things such as an app that makes using food stamps simple easy and delightful, to a platform that helps renters get things fixed in their apartments. Some of these apps have raised millions in private venture funding, helped hundred of thousands of people, and made a real impact on the world.<p>It&#x27;s full time, paid opportunity to build a new social venture from the ground up with a top notch group of peers in a well supported environment.<p>This year the Fellowship will focus on enabling Senior Citizens and their Caregivers.<p>Our nation is aging rapidly, but rather than enjoying their golden years, too many seniors find themselves struggling, forced each month to choose between food, medication, or rent. And there has been an alarming rise in the number of seniors who are homeless or relying on food banks.<p>In New York City, the number of seniors is projected to increase to nearly 1.9 million by 2030, making it the fastest-growing population. Unfortunately, seniors struggle disproportionately with access to benefits, health issues, and affordable housing.<p>- One out of every six seniors relies on emergency food\n- One out of five lives below the poverty line\n- One out of four has limited mobility<p>Many face these challenges alone. In 2014, 32 percent of persons age 65 and over, and nearly half of persons 85 and older in New York City lived alone. In addition, seniors who live alone have the second highest poverty rate (among all older households).<p>We think technology has a part to play.<p>We are looking for excellent, full stack engineers who want to put their skills to work to make the world a better place.<p>Learn more here: <a href=\"http:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.robinhood.org&#x2F;fellowship&#x2F;</a>","time":1488399437,"type":"comment"}