{"by":"dtwhitney","id":13769763,"parent":13764728,"text":"PINATA | Senior Frontend and Backend Engineers | New York, NY | ONSITE<p>PINATA<p>We&#x27;re building a marketplace for field marketing. What&#x27;s that? Ever notice the people working a booth at Comic Con, or demoing an app at SXSW, or pouring a sample of whisky, and wonder, &quot;what is that job and how did they get it?&quot; That job is &quot;field marketing&quot;, and how they got it: craigslist.<p>Almost a third of all marketing dollars go into field marketing, and it&#x27;s managed with broken spreadsheets and scribbled down phone numbers. We&#x27;re fixing it. We launched only a few months ago and just signed some major Fortune 500 clients. We push them live in a few weeks, and we&#x27;ve just finished raising our seed round. The runway looks great, and our team has a lot of experience in this field. It&#x27;s a great time to join!<p>TECHNOLOGY<p>We like Facebook&#x27;s OSS. It&#x27;s well grounded in solid computer science fundamentals, and we feel those qualities will allow their frameworks to persist longer than most, so we&#x27;re happily using React &#x2F; React Native, GraphQL and Relay.<p>We also like the impact functional programming is having on JavaScript, and very happy to have Facebook&#x27;s Flow for static type annotations. We&#x27;re over-the-moon with ES6 (or whatever you want to call it) and looking forward to the new stuff in ES2017.<p>We like functional programming. We also like type systems. We&#x27;re not quite advocates for Haskell, but we see it becoming more viable with each passing year, and while we wait for its eventual viability we&#x27;re quite happy with Scala.<p>Our GraphQL API is backed by Scala, and we&#x27;ve bought into the ethos that GraphQL subtly preaches: CQRS&#x2F;EventSourcing. We&#x27;ve built this largely with the Typelevel stack (cats&#x2F;fs2&#x2F;http4s&#x2F;circe&#x2F;eff&#x2F;shapeless&#x2F;doobie), and it&#x27;s running on top of AWS Lambda and Kinesis.<p>CULTURE<p>We all attend and run meetups, organize conferences (<a href=\"http:&#x2F;&#x2F;www.nescala.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nescala.org&#x2F;</a>) and read lots of papers, so this intellectual churn is constant within our tech community, and we are constantly looking for new people to bring something we haven&#x27;t seen before.<p>INTERESTED?<p>Send me an email at dustin@gopinata.com","time":1488411270,"type":"comment"}