{"by":"mike_heffner","id":13767154,"parent":13764728,"text":"Librato&#x2F;SolarWinds Cloud | Data Engineer | SF | <a href=\"http:&#x2F;&#x2F;librato.jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;librato.jobs</a><p>Librato, located in San Francisco, develops a unique cloud-based platform designed to help companies collect, visualize, store and create alerts on large amounts of streaming data to manage the health of their applications.<p>We are currently hiring Data Engineers who want to help the build systems that power the backend infrastructure of Librato. We are looking for someone that enjoys working on large-scale distributed systems problems to build a metrics and monitoring solution used by thousands of customers.<p>We’re a small team so everyone has the opportunity to have a big impact. We’ve built our platform out largely on Java8 Dropwizard services, a handful of Golang services and some C++ where performance is critical. We leverage Kafka as our main service bus, Cassandra for long term storage, our in-house stream processing framework for online analytics, and we rely on Zookeeper as a core part of intra&#x2F;inter-service coordination. Our data pipeline pushes millions of messages a second.<p>All team members at Librato, whether local or remote, commit code to Github, communicate over Slack and Hangouts, push code to production via our ChatOps bot, and run all production applications on AWS. We also use an array of best-breed SaaS applications to get code to production quickly and reliably. We are a team that is committed to a healthy work&#x2F;life balance.<p>Librato is wholly owned by SolarWinds Inc. so you get the benefits of a small startup, with the backing of a big company so there is no worry about the next round of funding. SolarWinds offers competitive bonus and matching 401k programs that create an attractive total compensation package.<p>If this sounds remotely interesting I’d be happy to spend a few minutes talking about what you are looking for and whether what we are doing would be appealing.<p>This is an example of some of the technology we build and work with on a regular basis: <a href=\"http:&#x2F;&#x2F;www.heavybit.com&#x2F;library&#x2F;blog&#x2F;streamlining-distributed-stream-processing-with-superchief&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.heavybit.com&#x2F;library&#x2F;blog&#x2F;streamlining-distribute...</a>.<p>Learn more at: <a href=\"https:&#x2F;&#x2F;www.librato.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.librato.com&#x2F;jobs</a>.<p>Apply at: <a href=\"http:&#x2F;&#x2F;solarwinds.jobs&#x2F;san-francisco-ca&#x2F;sr-data-engineer&#x2F;AE56CC21BD2D4A519674149D7FA99550&#x2F;job&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;solarwinds.jobs&#x2F;san-francisco-ca&#x2F;sr-data-engineer&#x2F;AE5...</a>","time":1488395586,"type":"comment"}