{"by":"the_mirror","id":13767061,"parent":13764728,"text":"Stealth Fitness Startup | NYC | ONSITE or REMOTE<p>About Us:<p>Our company is a stealth fitness technology concept being launched by an established leader in the NYC boutique fitness space with a team of experienced hardware and software engineers. We’re building a hybrid hardware&#x2F;software product to bring high-quality, personalized fitness content into people’s homes across the country. Our team includes experienced IOT engineers and developers, as well as top tier seed investors and advisors, with extensive background in launching premier consumer brands.<p>Openings:<p>To apply send an email to jobs@getthemirror.com with the job title as the subject line. Include a link to your linkedin and&#x2F;or an attached CV. Feel free to let us know what makes you tick as an engineer or any previous projects you think display your skills.<p>Stealth Fitness Startup | Android Engineer | NYC | ONSITE (REMOTE under the right circumstances)<p>We are looking for an Android engineer to work on our custom platform, focused on user interface and interaction with the server. An ideal candidate has worked on consumer facing apps before and has a good awareness of how their decisions will effect customer interaction.<p><pre><code>  - BA&#x2F;BS Computer Science or equivalent experience\n  - Experience building user facing android applications\n  - Experience consuming REST API&#x27;s from the front end\n  - Knowledge of WebRTC and Streaming Media are a huge plus\n</code></pre>\nStealth Fitness Startup | Python Engineer | NYC | ONSITE or REMOTE<p>Design and implement beautiful REST api&#x27;s and deploy with AWS to deliver on demand content to our users.<p><pre><code>  - BA&#x2F;BS Computer Science or equivalent experience\n  - Thorough understanding of and experience with Python\n  - SQL Skills (we use PostgreSQL)\n  - A healthy habit for writing TESTED code\n  - Front end skills and knowledge of WebRTC API&#x27;s are a huge plus</code></pre>","time":1488395102,"type":"comment"}