{"by":"brown4","id":13767031,"parent":13764728,"text":"Endgame’s security platform enables organizations to hunt for adversaries within their networks and secure their most valuable assets. We are characterized by a high degree of autonomy and flexibility, intellectual engagement, and a competitive compensation structure that rewards performance. We work within a fast-paced, driven, and flexible work environment that allows for both professional growth, as well as unwinding through team events like weekend family brunches, happy hours, and outdoor activities. Endgame values engagement within the tech community. We provide opportunities for open source contributions, speaking at meetups or conferences, and participating in our technical blog<p>Endgame | DC, SF | Senior Software Engineer (Front End)| <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3hamsiw2\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3hamsiw2</a> - Endgame’s Front End Engineering team is looking for a Senior Front End Engineer to be part of a cross-functional team working with designers, product managers, and engineers across multiple phases of the product lifecycle. Our Front End team builds responsive and elegant interfaces while maintaining a solid enthusiasm and passion for cutting-edge technologies. Our Front End Engineers embrace modern JavaScript frameworks and libraries, develop rapid prototypes, and iterate on features to optimize user interaction. Front End Engineers at Endgame use innovative UI architectures and designs, setting the bar high to produce compelling interfaces and creative visualizations.<p>Endgame | DC, SF |Senior Full Stack Engineer | <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?33amsiwO\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?33amsiwO</a> \nContribute to the architecture, design, and implementation of a highly secure and scalable distributed commercial software product in an enterprise&#x2F;SaaS&#x2F;cloud environment. Ensure efficient and streamlined version control and work flow, helping guide the team in a fast-paced Agile&#x2F;Scrum environment. Build large-scale, security applications, with a penchant for adopting new technologies while maintaining and implementing computer science fundamentals, as well as concurrency, and performance management<p>Checkout <a href=\"https:&#x2F;&#x2F;www.endgame.com&#x2F;career-openings\" rel=\"nofollow\">https:&#x2F;&#x2F;www.endgame.com&#x2F;career-openings</a> and email me if anything looks interesting jbrown[@]endgame.com","time":1488394889,"type":"comment"}