{"by":"leadpages","id":13766567,"parent":13764728,"text":"Leadpages (www.Leadpages.net) - Minneapolis, MN | Full Time | ONSITE | Now Hiring Senior Software Engineers (Python, Ruby and JavaScript) and Technical Support Specialists<p>If you&#x27;re not familiar with Leadpages, we&#x27;re a Minneapolis-based SaaS startup and we focus on conversion optimization products for our customers. We&#x27;re we&#x27;re 100% committed to diversifying our team to include all members of the RoR, Java, and PHP communities (in addition to Python) and have found that through this diversity, we&#x27;re able to grow in infinite ways and build amazing things. We have an excellent culture (I&#x27;m sure you hear that a lot, but this is actually true) and a great appreciation for work-life balance (we practice this heavily!), AND... we work remote two days per week with the other three days from our incredible downtown Minneapolis office (yes, if you are not already local, you’d have to be open to relocation).<p>What we’re using…<p>The Leadpages main app was built with Python on Google App Engine on the backend; we have a fantastic Python REST API stack based around the Falcon framework, running in Kubernetes. Our Distributed Systems team is using Scala and Akka, while our DevOps team is using Docker, Ansible, Grafana, Kibana, Jenkins, ElasticSearch and Google Compute Engine. On the front end, we’re using modern JS tools like Aurelia, React, Redux, and Babel. Our Drip product is a marketing automation platform with one of the smoothest UI’s I’ve seen yet! It’s a monolithic Rails app that’s built on Rails 4.<p>Anything catch your eye? We’d love to hear from you! We currently have opportunities available for:<p>- Senior Python Engineer =&gt; <a href=\"http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;bOzcohCzhq&#x2F;Senior-Python-Engineer?source=HackerNews\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;bOzcohCzhq&#x2F;Senior-Python-...</a><p>- Senior Ruby on Rails Developer =&gt; <a href=\"http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;h3xdedHgU3&#x2F;Senior-Ruby-On-Rails-Developer-Drip-Product-Team?source=HackerNews\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;h3xdedHgU3&#x2F;Senior-Ruby-On...</a><p>- Senior JavaScript Engineer =&gt; <a href=\"http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;7JjdN2&#x2F;Senior-JavaScript-Engineer?source=HackerNews\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;7JjdN2&#x2F;Senior-JavaScript-...</a><p>- Senior Software Engineer =&gt; <a href=\"http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;3acrO3&#x2F;Senior-Software-Engineer?source=HackerNews\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.leadpages.net&#x2F;apply&#x2F;3acrO3&#x2F;Senior-Software-En...</a><p>These are all full-time positions with great benefits including Medical, Dental, Vision, 401k (+match), open PTO, Flexible Schedules, Work From Home days, and more! We even offer generous relocation packages to help you relocate to beautiful Minneapolis, MN.<p><i></i>Interested in seeing other open positions within our Marketing, Product, HR&#x2F;Recruiting, Customer Success or Operations teams? Check out our website at <a href=\"http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers</a><p>Want to email us directly? You can reach us at Tiffany@Ave81.com or Madelon.Deming@Ave81.com<p>Let’s build something awesome!","time":1488392307,"type":"comment"}