{"by":"kubatyszko","id":13771294,"parent":13764728,"text":"ZestFinance | Sr. Devops Engineer | Los Angeles | Onsite Full-Time <a href=\"http:&#x2F;&#x2F;www.zestfinance.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zestfinance.com</a><p>ZestFinance is a well-funded FinTech startup founded in 2009 to provide fair and transparent credit to everyone. With our machine learning technology, we&#x27;ve been able to disrupt credit market and continue to innovate in this space.<p>As a Sr. DevOps Engineer you will be responsible for engineering our infrastructure with the same care and commitment as we do our software. From building software delivery pipelines to working with developers to ensure best systems engineering practices - our team is responsible for the uptime of our and our client’s business critical systems.<p>Responsibilities:<p><pre><code>   * Serve as a primary point responsible the overall health, performance, and capacity of our business systems\n   * Assist in the roll-out and deployment of new releases to facilitate our rapid iteration and constant growth\n   * Develop tools to improve our ability to rapidly deploy and effectively monitor our application stack.\n   * Work closely with software engineers to ensure our applications are designed with &quot;operability&quot; in mind\n   * Participate in a 24x7 on call rotation\n   * Ensure high reliability of our services\n\n</code></pre>\nQualifications:<p><pre><code>   * Prior experience in an enterprise facing technical operations role\n   * 5+ years in a UNIX-based operations role\n   * Deep UNIX&#x2F;Linux systems knowledge and&#x2F;or systems administration background managing large business critical deployments\n   * Strong troubleshooting skills that span systems, network, and code\n   * Demonstrated programming skills in one or more of: Python, Ruby, Java, C, Shell\n   * Experience with cloud technologies such as AWS, Google Cloud\n\n</code></pre>\nApply here: <a href=\"https:&#x2F;&#x2F;www.zestfinance.com&#x2F;careers.html?p=job%2FoLmP4fwK#open-positions\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zestfinance.com&#x2F;careers.html?p=job%2FoLmP4fwK#op...</a>","time":1488427195,"type":"comment"}