{"by":"agerwick","id":13841961,"parent":13764728,"text":"Librato | SF| Senior Developer | Full-time &#x2F; Onsite | <a href=\"http:&#x2F;&#x2F;solarwinds.jobs&#x2F;san-francisco-ca&#x2F;senior-developer&#x2F;39E464A0DD904E99A4D1C541375F1F8A&#x2F;job&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;solarwinds.jobs&#x2F;san-francisco-ca&#x2F;senior-developer&#x2F;39E...</a><p>Responsibilities:\n<i>Iterate, iterate, iterate.\n</i>Write code in Ruby, Python, and configuration management to automate repetitive tasks.\n<i>Oncall rotation.\n</i>Be passionate about monitoring.\n<i>Believe MTTR is more important than MTBF.\n</i>Believe Operations provides a service instead of working tickets.\n<i>Understand that availability is everyone’s responsibility.\n</i>Optimize the entire software delivery pipeline with quality built in.\n<i>Believe that data trumps all mere opinions.\n</i>Have a belief in Agile methodologies to enable high team velocity.<p>Qualifications:\n<i>6 to 12 years industry experience\n</i>Significant experience with cloudbased deployment and ephemeral hardware.\n<i>Comfortable with a variety of </i>NIX platforms.\n<i>Experience managing significant load in the wild, comfortable with scaleout tiers, resiliency.\n</i>Strong scripting language experience (bash, Ruby, Python).\n<i>Strong intrapersonal skills with the ability to work well with other team members, customers.\n</i>Ability to work independently &#x2F; deliver without supervision.\n<i>Experience implementing DevOps practices.\n</i>Experience managing large AWS infrastructures.<p>Our parent company SolarWinds provides powerful and affordable IT management software for the enterprise to more than 100,000 customers worldwide. SWI has $500M in revenue and 40% growth year over year. Together we offer application performance management for any environment, with unexpected simplicity.<p>If interested please apply directly or email me at ashley.gerwick@solarwinds.com and reference this posting!","time":1489178678,"type":"comment"}