{"by":"knerd83","id":3537969,"kids":[3538611,3538086],"parent":3537881,"text":"Knewton: New York (NYC) funded startup seeking software engineers interested in functional programming, machine learning, distributed systems, and \"big data\" problems. +ONSITE, +REMOTE, +FULLTIME, +INTERN. I am not personally sure (I'm a software engineer) about H1-B but I will refer any visa questions to someone who can answer them.<p>Investors include Peter Thiel (Founder's Fund), Reid Hoffman, and Pearson, a leader in educational publishing. We were recognized as a Technology Pioneer for 2011 by the World Economic Forum in Davos and one of the top 25 best places to work by Crain’s New York Business.<p>We have about 80 employees right now. We pay full market salaries plus stock options, and you can take as much vacation as you need. Hours are typically 40-50 per week.<p>Our product is an adaptive learning platform, which means we use machine learning and \"big data\" techniques to deliver an individualized education to each student. Our eventual goal is to make a high-quality, adaptive education available to everyone in the world. The product is used by Arizona State University right now, and we recently signed a deal with Pearson to power many of their products.<p>Our code is a mix of Python, Java, and Scala. Most of our existing code is in Python, but we're working to scale up in a major way, which involves a migration to the JVM. Currently this involves a mix of Java and Scala, but our long-term goal is to move toward Scala. Consequently, we're really hot for Scala talent right now. Anyone who has experience taking Scala into production we would love to talk to right now.<p>You can reach me at knerd83 at gmail.com, and I'm a software engineer so I'll be able to answer any of your technical questions (e.g. why we're interested in Scala). Reach out if any of the following interest you:<p>* Using technology to democratize education.<p>* Machine learning and data mining, including approaches such as probablistic graphic models (PGMs), Support Vector Machines (SVMs) and Monte Carlo Markov Chains.<p>* Functional programming (cf. Scala and Python).<p>* The Java Virtual Machine (JVM) internals and performance optimization.<p>* NoSQL databases (Cassandra and Redis).<p>* Thrift (the RPC protocol).<p>* Cloud computing (Amazon Web Services, Unix) and distributed systems.","time":1328105662,"type":"comment"}