{"by":"ismarc","id":3538527,"parent":3537881,"text":"Austin, TX, Fulltime, Invodo (<a href=\"http://www.invodo.com/html/about/jobs/\" rel=\"nofollow\">http://www.invodo.com/html/about/jobs/</a>)<p>We are a startup that's growing customer-wise and employee-wise.  If you're interested in one, feel free to email me directly at work (mbrace@invodo.com) if you prefer it to be handed off, but we're small enough that you can feel comfortable just sending it to careers@invodo.com.<p>For developers, the skills listed for each job is pretty long.  However, this isn't just a list of buzz-words to catch folks, these are technologies/etc. that we actually use.  Some of the systems we're looking to move away from as they're from systems written before we got traction (which means an entirely different business model) that are slowly being replaced.<p>Software Development Engineer (UI) -- Javascript, Actionscript, working on player framework utilized by our customers.  Skills we're looking for:<p>* Desire to create fast, light, clean, maintainable code that works great, regardless of browser<p>* Excellent JavaScript development skills, including\nJavaScript and CSS optimization and minification techniques<p>* Experience embedding code in 3rd party sites (HTTP&#38;HTTPS)<p>* Asynchronous loading techniques<p>* Experience using RESTful APIs from the browser and Flash runtime JSON/P and XML<p>* ActionScript 3 development<p>* Extensive CSS and HTML development experience<p>* Familiarity with embedding code in e-commerce pages<p>* Familiarity with web video streaming (FMS, HLS, etc.)<p>* Familiarity with HTML5 and emerging HTML5 video standards<p>* Understanding of video SEO (sitemaps, Open Graph, etc.)<p>* Experience using CDN’s<p>* Basic graphics production (Photoshop)<p>* Experience programming in and/or working against a Java stack<p>Senior Software Engineer (Java) -- Senior developer, some Tomcat applications, some embedded Jetty, some applications that aren't web based at all (Netty based, written in Scala), really needs a really good understanding of the JVM.  Technologies actively in use (even if we're trying to phase some of them out) and skills needed:<p>* Grails<p>* Java EE / Groovy / Scala<p>* Spring<p>* Hibernate<p>* HTML, CSS, Javascript<p>* Flash video<p>* Tomcat &#38; Apache<p>* Linux (Redhat / CentOS)<p>* Database/MySQL<p>* Performance modeling and analysis<p>* REST web services<p>* High availability Internet applications<p>* Cloud computing (e.g. Amazon EC2/S3)<p>* Content Delivery Networks","time":1328112802,"type":"comment"}