{"by":"scraplab","id":3539872,"parent":3537881,"text":"London, UK. Full time.<p>Designer &#38; Front-end Developer at Newspaper Club.<p><a href=\"http://www.newspaperclub.com\" rel=\"nofollow\">http://www.newspaperclub.com</a><p>We help anyone make and print their own newspapers. We believe the web is too important to be left to screens, and that newsprint is a highly evolved technology too. We build things that combine the two, using each medium for what it's best at.<p>We're looking for a great designer + front-end developer to work alongside our co-founder and engineer (me, @tomtaylor) and form the start of a tight knit development team.<p>We want to overhaul our existing in-browser newspaper layout tool + API, launch a print-on-demand marketplace, and develop a number of products and services that use completely personalised newsprint in smart ways.<p>Things like the Postcode Paper we built for Data.gov.uk. <a href=\"http://blog.newspaperclub.com/2009/10/16/data-gov-uk-newspaper/\" rel=\"nofollow\">http://blog.newspaperclub.com/2009/10/16/data-gov-uk-newspap...</a><p>Or the prototype Telepaper, which turns Readability + Instapaper content into a delivered newspaper. <a href=\"http://telepaper.newspaperclub.com/\" rel=\"nofollow\">http://telepaper.newspaperclub.com/</a><p>You'll need to be able to go from sketches and conversation, to working code in browser yourself. We like generalists who can think both like designers + engineers, with a good sense of product intuition. Someone who can code their own designs, and enjoys working closely with a backend engineer.<p>Bonus points if you have a solid understanding of how to build well structured Javascript web apps, using frameworks like Backbone.<p>You've probably got a few years experience working on public sites, either for yourself or others, and can show us sample projects you've worked on. We value code over experience, so show us what you've done.<p>We run a small, friendly ship, in a relaxed environment we share with interesting folks in Shoreditch. We've got a proven business model, and are generating real, actual, genuine profit, with very little investment. We're doing this on our terms, and building the kind of organisation we'd like to work for.<p>All of which, I'll be honest, completely astounds me.<p>In return, we can offer a competitive package of salary and equity, in varying proportions.<p>If you're interested, drop us a line at jobs@newspaperclub.com, with a note about yourself and links to things you think we'd find interesting (eg. Github account, CV, portfolio).","time":1328129626,"type":"comment"}