{"by":"RichardPrice","id":3539308,"parent":3537881,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>It's widely held that science is too closed, and too slow. We are trying to change that. We believe that faster sharing of research will lead to an acceleration in research innovation: faster innovation in medicine, biology, engineering, economics, and other fields. Faster sharing in biology and medicine, for example, could lead to cancer being solved 12 months before it otherwise would have been, which would lead to millions of lives being saved.<p>Academia.edu has over 950,000 registered users, and over 3 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,000 academics join each day.<p>We need talented engineers to come and help us accelerate the world's research. We believe that there is a chance to make a big impact.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We have a strong engineering culture. We're a 6 person team based in downtown San Francisco. The site is Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture. There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1328121843,"type":"comment"}