{"by":"lpolovets","id":3539165,"parent":3537881,"text":"Bay Area or Los Angeles or Shanghai strongly preferred, but remote work is possible for exceptional candidates (must live in the U.S.). Full-time only. H1B is okay. We also have several summer internship opportunities.<p>Factual's vision is to be an awesome and affordable data provider, so that developers, startups, and big companies can focus on innovation instead of data acquisition. We believe in openness and transparency rather than proprietariness and obfuscation.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). In late 2010, we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Newsweek, Loopt, and Blekko. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We currently have about half a dozen job openings, from data engineering to software engineering to system administration. For the software engineering position, you would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p>If you're interested in the Bay Area office, it just opened in December of 2011, so you'd have a significant influence on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1328120078,"type":"comment"}