{"by":"bartman","id":3539553,"parent":3537881,"text":"Berlin, Germany (Remote considered) FULL TIME<p>NVIDIA ARC GmbH is looking for a senior software engineer to join our GPU cloud computing project. We're building a rendering solution that greatly reduces the upfront costs for rendering and design studios by seamlessly integrating cloud computing into the 3D modelling and rendering workflow. User response so far has been great - see these (slightly outdated) videos to get an impression: [1] [2]<p>We're a team of five engineers looking for an engineer with outstanding C++ and network programming abilities to take over the client-side part of this project. You should be familiar developing in multi-threading applications and integrating with binary protocols and RESTful APIs. Experience with EC2 and HTML/Javascript/Coffeescript is a plus.<p>Technologies we use are AWS EC2, (unbiased/consistent) real-time raytracing, C++, CoffeeScript/Javascript, Python, PHP, HTML, Flex, RESTful APIs, single-command deployments. You'll have a lot of freedom in working with technologies you like and prefer.<p>We prefer somebody who's in Berlin or willing to move, but are willing to consider remote as an option for the right candidate.<p>Personally, I've been with NVIDIA for 4 years and enjoy the flexibility and freedom I'm given, both on as an engineer and employee (for example, moving to the US to study abroad &#38; transfer to NVIDIA US for that time was encouraged and quite easy).<p>Feel free to email me (see profile) or apply online at [3].<p>[1] <a href=\"http://www.youtube.com/watch?v=NSHkJfDrsf8\" rel=\"nofollow\">http://www.youtube.com/watch?v=NSHkJfDrsf8</a>\n[2] <a href=\"http://www.youtube.com/watch?v=-4CoC1HL0Eo\" rel=\"nofollow\">http://www.youtube.com/watch?v=-4CoC1HL0Eo</a>\n[3] <a href=\"http://careers.nvidia.com/pljb/global_jsp/applicant/DisplayJob/JobDetails.jsp?display=1&#38;pljbHome=/nvidia/nvidiaemployment/applicant/index.jsp&#38;id=6853\" rel=\"nofollow\">http://careers.nvidia.com/pljb/global_jsp/applicant/DisplayJ...</a>","time":1328125497,"type":"comment"}