{"by":"chuang","id":3540953,"parent":3537881,"text":"Menlo Park, CA. Full Time.<p>Production Engineers at Facebook are hybrid software/systems engineers who ensure that Facebook's services run smoothly and have the capacity for future growth. They are embedded in every one of Facebook's product and infrastructure teams, and are core participants in every significant engineering effort underway in the company. Our team is comprised of varying levels of experience and backgrounds, from new grads to industry veterans. Relevant industry experience is important, but ultimately less so than your demonstrated abilities and attitude. We sail into uncharted waters every day at Facebook in Production Engineering, and we are always learning.<p>Responsibilities<p>-Own back-end services like our Hadoop data warehouses, front-end services like Chat and Newsfeed, infrastructure components like our Memcache infrastructure, and everything in between\n-Write and review code, develop documentation and capacity plans, and debug the hardest problems, live, on some of the largest and most complex systems in the world\n-Together with your engineering team, you will share an on-call rotation, backed by our 24x7 Site Reliability Operations team\n-Partnered alongside the best engineers in the industry on the coolest stuff around, the code and systems you work on will be in production and used by millions of users all around the world<p>Requirements<p>-BS or MS in Computer Science, Engineering, or a related technical discipline or equivalent experience\n-Extremely sound knowledge of UNIX and TCP/IP network fundamentals\n-Ability to code really well in at least one language (even if it is not one that Facebook uses)\n-Ability to rapidly learn new development languages (PHP, Python, C++, and Java are all in heavy use)\n-Ability to pick up new software, frameworks and APIs quickly\n-Sharp and tenacious troubleshooting skills: you can fix anything\n-Ability to perform 'guerrilla capacity planning' for internet service architectures\n-Good knowledge of basic large-scale internet service architectures (such as load balancing, LAMP, CDN's), even if you haven't worked on one\n-Configuration and maintenance of common applications such as Apache, memcached, Squid, MySQL, NFS, DHCP, NTP, SSH, DNS, and SNMP\n-A healthy respect for our motto 'Move Fast and Break Things,' but always make sure you know how to fix them too\n-Good verbal and written communications skills\n-Detail oriented and careful<p>If you are interested, please email cathy [at] fb.com or apply through our careers  page: <a href=\"https://www.facebook.com/careers/department.php?dept=engineering&#38;req=a2KA0000000LknwMAC\" rel=\"nofollow\">https://www.facebook.com/careers/department.php?dept=enginee...</a>","time":1328144670,"type":"comment"}