{"by":"baspland","id":3540378,"parent":3537881,"text":"Windows Phone 7 App Developer - C# + Silverlight\nWhatsApp Inc - Mountain View, CA<p>We are looking for engineers to work on our Windows Phone Client Team.<p>We are looking for engineers who enjoy writing compact code for mobile phones and are passionate about user experience. Using your start-up mindset and your experience developing native mobile apps, you will create new, awesome features used by millions of current WhatsApp users. You must have the ability to work in a very small team and self-organize feature prioritization and delivery; own release and QA cycles of your code; and have strong C# programming and debugging skills.<p>Client Engineer requirements:<p>•\tBS in computer science or equivalent.<p>•\tStrong C# programming and Debugging skills<p>•\tStrong understanding of C#, application architecture and object-oriented design<p>•\tExperience developing native WP7 mobile apps is strongly preferred, but not required.  LINQ, Silverlight and SQL Server client code have strong cross over utility with Windows Phone development.<p>•\tWorking experience with TCP, Messaging, IM, Push APIs<p>About WhatsApp, Inc. WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows, and Nokia smartphones. In addition to basic messaging, WhatsApp Messenger users can send each other unlimited images, video and audio messages as well as participate in groups.<p>  WhatsApp Inc. was founded in 2009 by two ex-Yahoo! engineers. We are located in a spacious office in downtown Mountain View. We are profitable, funded, and we offer very competitive compensation packages.<p>Other reasons to join us:\n- work side-by-side with the founders \n- unlimited supply of latest (and even unreleased yet) smartphones \n- fully stocked fridge from Whole Foods\n - herman miller embody chairs - frequent company paid lunches and dinners \n- open space, collaborative environment'<p>Please send resumes to baspland@whatsapp.com<p>WhatsApp Inc is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status.","time":1328135408,"type":"comment"}