{"by":"magicpixelgames","id":3541212,"parent":3537881,"text":"Los Angeles, CA.  Full Time, onsite only.<p>Senior Game Systems Designer\n(<a href=\"http://www.magicpixelgames.com/2012/01/15/senior-designer/\" rel=\"nofollow\">http://www.magicpixelgames.com/2012/01/15/senior-designer/</a>)<p>Established Video Game development team<p>Unannounced Project<p>Magic Pixel Games (<a href=\"http://www.magicpixelgames.com\" rel=\"nofollow\">http://www.magicpixelgames.com</a>) was founded in 2010 by the core members that developed the award-winning Steven Spielberg's BOOM BLOX. Much of our team has worked together for almost a decade, and we’ve now struck out on our own to continue our tradition of creating extraordinary games. Our first product was launched in 2011: Carnival Island, developed with Sony Santa Monica Studio.<p>We’re now building a team as we ramp up for our second project, which again, strives to break new ground – but is significantly different from our first in all ways – tone, target audience and style…we’re excited!<p>Join us and make a difference!<p>Each member of our closely-knit team makes a very real contribution to the game, and awesome ideas come from everyone. We all wear many hats, we play to each other’s strengths, and we build on each other’s ideas.<p>Our team moves fast, and takes on big challenges. We love what we do, and you will too!<p>Note: We're currently located by the Los Angeles airport. At the moment, we are not considering telecommuters.<p>----------------------------------------------<p>Our team is now looking for a <i>Senior Game Systems Designer</i> to guide the vision for our games. Designers drive our games, and this role is critical for making sure our games are fun, accessible, and ultimately compelling for users of all ages and skill levels…and this is a chance to get involved in its formative days.<p>Primary Responsibilities:<p>• <i>Ideate, design and implement game systems,</i> as required by lead designers and project requirements<p>• Design and tune games and experiences while bearing target audience requirements in mind<p>• Work closely with other designers to help conceive game mechanics while preserving the overall theme and design constraints of the product<p>• Prototype rapidly on ‘whatever works’ (paper or existing games), and then translate those findings into a production environment<p>• Communicate design directives to the team, and confirming that guidelines are followed, providing clear and actionable feedback to content creators where necessary<p>• Evaluate, prioritize and integrate feedback from stakeholders<p>• Drive design considerations for art<p>• Collaborate with engineers on required gameplay enhancements and feature requests, design tools and pipeline<p>• Collaborate with audio artists as needed to fulfill design requirements<p>• Work closely with all team-members in a collaborative agile, small team environment<p>Requirements:<p>• General awesomeness<p>• 2-4 years’ experience in working on and shipping games (at least one shipped and credited game)<p>• Excellent written and verbal communications skills, including sketches, flowcharts or diagramming when needed<p>• Experience with current generation consoles, and the technical aspects of creating content for them, in scripting or creating basic level geometry<p>• Experience architecting complete gameplay systems and compulsion loops including table- and data-jockeying<p>• Comfortable working on an agile and collaborative team<p>• Accurate time and schedule management<p>• Self-motivated, proactive and engaged attitude towards the project<p>• Mention a penguin in the cover letter or accompanying e-mail<p>• Passionate for (and interested in working on) games<p>• Tendency towards bursts of innovative thinking and inspiring brainstorming<p>• Ability to rapidly consider repercussions of design decisions throughout all aspects of a \ngame<p>• Deep understanding of player motivations and design compulsions<p>• Mentally agile and able to participate and contribute to fast-paced design brainstorming and discussion<p>• Wide range of knowledge on all games, past and present and the ability to tap into this for design discussions<p>Preferences:<p>• At least three shipped, credited game projects<p>• Prototyping and rapid iteration skills<p>E-mail your relevant materials to jobs@magicpixelgames.com","time":1328150879,"type":"comment"}