{"by":"jgarrison","id":3591573,"parent":3537881,"text":"Scottsdale, AZ, Denver, and Ames, IA<p>Software Engineers (www.WebFilings.com)<p>WebFilings’ software engineers develop best-in-class, next-generation collaborative web applications for accounting and finance teams around the world.  We hire software engineers with a broad set of skills who are ready to tackle some of technology’s greatest challenges.  Developers work across several Internet application technologies, including RIA platforms like Flash Player, HTML5 and Google App Engine, with an emphasis on great user experiences.<p>WebFilings’ culture is highly innovative and team-oriented.  We encourage autonomy and provide you the opportunity to develop mastery in areas about which you are passionate.  As a software engineer at WebFilings, you will clearly understand the needs of our customers and the benefits our software provides them and their community.  Since we develop and release on extremely fast cycles, you will see your code live, in production, often within days or weeks rather than the months or years as with some companies.\nMinimum Qualifications:<p>BS degree in Computer Science or related field (In lieu of degree, 4 years relevant work experience).\nExperience programming in one or more of Python, Actionscript/Flex, C/C++, C#, Java or Javascript/AJAX<p>Preferred Qualifications:<p>Masters or PhD in Computer Science or related field.\nA solid foundation in computer science, with strong competencies in data structures, algorithms, and object-oriented software design.\nSeveral years of large systems software design and development experience.  Experience working with virtualized OS environments a plus.\nSignificant coding skills in one or more of Python, Actionscript/Flex, C/C++, Java or Javascript/AJAX\nAdditional experience with Objective-C, Mobile computing, SQL, NoSQL, Google App Engine, Amazon EC2, database design, knowledge of HTTP and web protocols are a plus.<p>We Have Three Unique Developer Profiles:<p><i>User-Facing Web Applications<p>We develop highly interactive web applications using the latest web and browser technologies including HTML5, AJAX, Javascript, CSS, and related libraries.  These applications stretch the boundaries of what is possible for a browser-based application and deliver a user experience that is second to none.<p>Relevant technical backgrounds include: Web Application Development, Cross Browser Compatibility, User Interface Development.<p></i>Rich Internet Application Developer<p>RIA developers will be working on a cutting-edge platform that combines a state of the art Google App Engine back-end with a large scale Flash Player-based enterprise application written with the Flex SDK in Actionscript.  Attention to detail, crafting superior user experiences, and writing high-performance efficient code are all key qualities necessary for this position.<p>Relevant technical backgrounds include: Actionscript, Flex SDK, PureMVC, Async service calls, UI/UX Development.<p>*Cloud Computing Infrastructure and Services<p>We develop on the latest cloud computing technologies including Google AppEngine and Amazon EC2 in a hybrid cloud environment unlike anything else in the industry.  We focus on scalability and performance, building a platform that will scale to support tens of thousands of users.<p>Relevant technical backgrounds include: Database Development, Large Scale Distributed Systems, Performance and Memory Optimization, Web Service Development, Google AppEngine, and Amazon EC2","time":1329250138,"type":"comment"}