{"by":"jbleich89","id":10658967,"parent":10655740,"text":"CLVmetrics |Lead Front-End Engineer - Early Employee | Philadelphia, PA w&#x2F; NYC 2016 | Onsite w&#x2F; some Remote<p>CLVmetrics (<a href=\"http:&#x2F;&#x2F;www.clvmetrics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.clvmetrics.com</a>) is a technology company with a simple but important belief: companies should treat their customers differently based on each customer’s lifetime value (CLV) to the business. Our goal is to enable firms to do so by providing access to the cutting-edge statistical models of co-founder Wharton Professor Peter Fader that forecast customer behavior far into the future.<p>To accomplish this goal and allow companies to implement customer-centric marketing strategies, our world-class team of statisticians, marketers, and engineers is building an enterprise-grade cloud-based analytics suite to commercialize our own award-winning research on consumer behavior, marketing theory, and statistics. Our team has the technical expertise across stack to implement our models at scale, and we are looking to add an expert front-end developer to the team to help us design and develop a stunning front-end that will allow our customers to discover novel insights about their customers, develop marketing interventions around CLV, and track the results of those actions.<p>Candidates should be comfortable with React&#x2F;Angular and a visualization library such as d3. Candidates should also have a strong sense for UI&#x2F;UX.<p>The key challenges that you will face are:<p>-Presenting a new metric: Predictive CLV is a new metric that has never been accessible before. The success of its penetration depends critically on effective communication to our clients.<p>-Visualization of massive data sets: We need to present output from millions of customers and billions of transactions in an elegant and simple-to-understand fashion.<p>-Design for different stakeholders: We need dashboards and visualizations appropriate for a range of audiences from performance marketers to the C-suite.<p>Please email justin@clvmetrics.com to apply.","time":1449005684,"type":"comment"}