{"by":"ILIKEPONIES","id":10660678,"parent":10655740,"text":"Underdog.io | New York, NY | <a href=\"https:&#x2F;&#x2F;underdog.io\" rel=\"nofollow\">https:&#x2F;&#x2F;underdog.io</a> | Full-Time | ONSITE or REMOTE<p>We’re looking to hire a full-stack engineer (engineer #3&#x2F;employee #6).<p>Today, Underdog.io is a curated marketplace for talent. We connect amazing people with founders and hiring managers at top technology companies.<p>We don’t charge placement fees because we’re not recruiters. We’re building technology to reduce the noise of the job search and match. We started Underdog.io because we experienced the pains associated with (1) hiring while working at top startups and (2) looking for new opportunities.<p>Our platform is currently live in SF, NYC, and remote where we work with 180+ awesome startups. We’ve had to turn away one of every two companies that have tried to join the network. We&#x27;ve proudly bootstrapped and profitable.<p>As we scale, we’ll focus on building tools for candidates to organize, search, and discover new job opportunities. In our view of the future, job candidates don’t receive unsolicited outreach from recruiters and companies don’t pay placement fees for the vast majority of their hires. Job search is organized and talented candidates have more high-quality options.<p>We use Python&#x2F;Flask, Javascript&#x2F;Node.js, PostgreSQL, Elasticsearch, AWS. We&#x27;re also working on a project in Ruby&#x2F;Sinatra. And we&#x27;re big supporters of open source.<p>Link to Github: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;underdogio\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;underdogio</a><p>Link to recent Medium post: <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@cmuir&#x2F;lessons-from-sixteen-months-of-bootstrapping-at-underdog-io-6deb98344d31\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@cmuir&#x2F;lessons-from-sixteen-months-of-boo...</a><p>Email chris@underdog.io to apply.<p>Keywords: NYC, Brooklyn, Developer, Dev, Engineer, Python, Flask, Node.js, Ruby, Sinatra, PostgreSQL, Elasticsearch, Open Source, <a href=\"https:&#x2F;&#x2F;underdog.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;underdog.io&#x2F;</a>","time":1449026322,"type":"comment"}