{"by":"charlesweitzer","id":10660525,"parent":10655740,"text":"Voleon | www.Voleon.com | Berkeley, CA | Senior Machine Learning Software Engineer - Quantitative Hedge Fund<p>The Voleon Group is a technology-driven investment firm employing cutting-edge statistical machine learning techniques. We are looking for an exceptionally capable software engineer. You will architect &amp; implement new production trading systems, machine learning infrastructure, data integration pipelines, and large-scale storage systems.<p>We seek candidates with a proven track record of writing correct, well-designed software, solving hard problems, and delivering complex projects on time. You should preferably have experience designing and implementing fault-tolerant distributed systems. Experience with building large-scale data infrastructure, stream processing systems, or latency-sensitive programs is a bonus.<p>Required experience: - Go&#x2F;C&#x2F;C++&#x2F;Python in a Linux environment with a focus on performance, concurrency, and correctness. - TCP&#x2F;IP networking, multi-threading, and server development. - Common Internet protocols (IP, TCP&#x2F;UDP, SSL&#x2F;TLS, HTTP, SNMP, etc.). - architecting and designing highly available systems. - architecting and designing large-scale data management infrastructure. - Large codebases and building modular, manageable code.<p>Preferred experience.: - Debugging&#x2F;performance profiling, use of tools (strace, valgrind, gdb, tcpdump, etc.) - Build and test automation tools. - work with well-defined change management processes. - diagnosing RDBMS performance problems, exploiting indexing, using EXPLAIN PLAN, optimizing at the code layer, etc. - working with messaging queues (RabbitMQ, Redis, etc.) as well as distributed caching systems.<p>Interest finance is essential, but experience in finance is not a primary hiring factor. Benefits and compensation are highly competitive. We can be very flexible for the right person.<p>Email CV&#x2F;request for more info to Charles@Voleon.com.","time":1449023810,"type":"comment"}