{"by":"jackfoxy","id":10660123,"kids":[10660746],"parent":10655740,"text":"Tachyus - San Mateo, CA - several open positions<p>We are revolutionizing the oil and gas industry, well funded, and (most importantly) producing significant revenue. This is the opportunity for the right people to align with us and share in ownership. We are a focused science and engineering driven team working with real physical devices and processes measuring and analizing the natural world. We take our Values statement seriously, so read it first and decide. <a href=\"http:&#x2F;&#x2F;www.tachyus.com&#x2F;joinus&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tachyus.com&#x2F;joinus&#x2F;</a><p>As a technology company, our long-term success is dependent on the skill and alignment of our engineering team. We develop new software and hardware and rely on our engineers to bring the company&#x27;s vision to fruition. Every engineer has the opportunity to make huge product contributions and has a responsibility to promote internal collaboration and adherence to best practices.<p>Software Engineer - DEVOPS<p>Our core physics and data science algorithms (what we call “Data Physics”) are written in a combination of Python and Matlab. Tachyus data physics algorithms solve large scale, difficult oil field problems using highly parallelizable, dynamic computation environments. The algorithms are typically developed on a Windows architecture but scale out to many Linux-based instances for deployment.  These algorithms integrate with a full stack web environment running in F#, a functional-first, multiparadigm language, which is deployed to a Microsoft Azure deployment environment. Both environments operate in parallel. We seek engineers who are excited to work on dynamic allocation of computation resources, efficient operations, and cloud-scale operations.<p>Correctness (QA) Engineer<p>The Tachyus Correctness Engineer is a Software Engineer who specializes in building the infrastructure to prove our software and algorithms produce accurate results. The CE works closely with the Software and Science organizations to prevent, catch, prioritize and eliminate errors in both software and data. Correctness Engineering is also intimately involved in continuous Integration and release management. He or she is an engineer at heart, preferably with experience writing production code.","time":1449017974,"type":"comment"}