{"by":"aturek","id":10665114,"parent":10655740,"text":"Convoy<p>Software Engineers &#x2F; Designers &#x2F; Sales &#x2F; Operations<p>Downtown Seattle, WA<p>We&#x27;re optimizing the trucking and logistics industry; automating what is, today, a $749B industry that still relies on phone calls and paper.<p>Some of our open engineering positions:<p>- Front-end engineer - Live and breathe JavaScript, HTML, and CSS? Come work on our single-page app using React and redux!<p>- Mobile engineer - We have Android and iOS apps, and we’re interested in people competent in either native or react-native mobile development (both is a huge plus). These are beautiful, bulletproof apps that solve real-world problems for truck drivers and carriers.<p>- Back-end engineer - We’ve got some fun CS problems to solve around route optimization and market making, plus working on the API that connects all these clients.<p>If you’re a high-performing engineer but don’t have one of these specific tools on your belt, we’d still love to talk. We trust awesome people to learn the tech!<p>We&#x27;re a small, close-knit team that hails from both startups and large tech companies, backed by some big names. Jeff Bezos, Pierre Omidyar and Drew Houston are all investors.<p>I&#x27;m one of our full-stack software engineers (employee #2). I&#x27;ve worked at several software companies large and small, but this one feels like a rocket ship. I&#x27;m working with some of the smartest people I&#x27;ve ever met, both engineering and business, we&#x27;re building a great product at an incredible pace, and growing our business like crazy. I&#x27;m excited to go to work every day.<p>We just exited stealth mode a month ago:<p><a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;10&#x2F;27&#x2F;superstar-investors-back-convoys-plan-to-streamline-freight-operations&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;2015&#x2F;10&#x2F;27&#x2F;superstar-investors-back-convo...</a><p>If you&#x27;re in Seattle (or willing to relocate) and looking to be on a small team where you can have a huge impact, email me at alex@convoy.com or check out our jobs page <a href=\"https:&#x2F;&#x2F;convoy.com&#x2F;about.html#jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;convoy.com&#x2F;about.html#jobs</a>","time":1449083615,"type":"comment"}