{"by":"Gugel","id":10661128,"parent":10655740,"text":"Houston, TX | Product Manager | Onsite<p>About the company:\nGoCo is raising the bar for Houston Tech! We have an amazing team of developers, designers and sales folks that are on a mission to simplify and automate all the annoying admin work small businesses have to put up with (and make the workplace way more fun for those companies&#x27; employees along the way).<p>We&#x27;ve recently raised $1.8M and we need your help!<p>About the position:\nAs a PM at GoCo, you&#x27;ll be a mini-CEO. You&#x27;ll need to help us figure out what we should build and how we should build it. And you&#x27;ll probably make mistakes along the way. But that&#x27;s OK. We&#x27;re all about learning quick.\nThe ideal GoCo PM would demonstrate these 4 main traits: \n- Excellent communicator: You&#x27;ll need to be a great listener so you can understand users&#x27; problems. And once you understand those problems, you&#x27;ll need to convey your proposed solutions via email, PowerPoint decks, whiteboarding or just sitting down and talking with devs, design, and execs.\n- Half analytical, half creative: You&#x27;ll quantify and prioritize what&#x27;s going to deliver the most bang for the buck. Sometimes, those features won&#x27;t be very creative. What&#x27;s worked before can work now. But sometimes, you&#x27;ll really have to really think out of the box.\n- Design: You don&#x27;t need to be a designer. You don&#x27;t need to know how to make things beautiful. But you do need to know how to distill complicated flows into something that&#x27;s intuitive and simple. \n- Bias for action: You need to get stuff done!\nAs a PM, you&#x27;ll report directly to the seasoned Chief Product Officer and have massive opportunities for personal growth, leadership, and career advancement in a rapidly growing company.<p>You don&#x27;t need any direct PM experience (though that&#x27;s awesome). You just need to demonstrate the traits outlined above. Any experience with HR or insurance is a big plus.<p>Struck your fancy?  Email me, Michael Gugel (the co-founder and CPO) at gugel@goco.io.","time":1449033335,"type":"comment"}