{"by":"theuri","id":10665303,"parent":10655740,"text":"Guide Financial | Full-Stack Developers (Ruby&#x2F;Rails) &amp; Product Designer | San Francisco, CA | <a href=\"http:&#x2F;&#x2F;www.guidefinancial.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.guidefinancial.com</a><p>FULL-STACK DEVELOPER\nThe Full-Stack Developer role is a critical position for us. We are seeking a developer with experience working extensively in both front-end and back-end software development, reporting to the Head of Engineering. Your initial focus will be on our core web experience, and may expand to mobile platforms as well.<p>You will be responsible for developing, testing and maintaining some of our most important and ambitious technology features, and you should have a proven track record of delivering well-engineered and tested software at scale.<p>PRODUCT DESIGNER<p>We are seeking a Product Designer with experience, passion and expertise in both visual and product design. As part of this role, you will lead design efforts as a lead designer for Guide Financial (including our financial advisory platform and future product releases in new markets), as well as collaborate with other innovation teams within John Hancock. You will report to the Managing Director of Guide Financial.<p>You will collaborate closely with colleagues from the ecosystem of innovation labs, including the Lab of Forward Thinking, to drive innovation across global markets. This includes collaborating with customers and business leaders to identify opportunities to improve the customer journey of lifetime financial wellness, and lead the design process from initial mockups through launching new businesses.<p>ABOUT GUIDE FINANCIAL\nAt Guide Financial (<a href=\"http:&#x2F;&#x2F;www.guidefinancial.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.guidefinancial.com</a>) our mission is to use technology (artificial intelligence and applied behavioral finance) to enable millions of middle-class families to increase their savings rates, make better financial decisions and achieve retirement security.<p>We&#x27;ve recently joined John Hancock as part of their long term innovation plan. We’ll be continuing to support our core advisor technology and also build out new, innovative technology in huge markets that will impact millions of customers.<p>We seek to combine the best of a startup - small team, great technology, lots of fun and a fantastic culture - with the benefits of an industry leading firm - including very competitive benefits&#x2F;comp and the ability to see our technology deployed rapidly across millions of households worldwide.<p>To start a conversation - drop us an email at info@guidefinancial.com with a brief note about yourself and a resume.<p>You can also read more here: <a href=\"https:&#x2F;&#x2F;www.guidefinancial.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.guidefinancial.com&#x2F;careers</a>","time":1449085412,"type":"comment"}