{"by":"m_rueg","id":10664249,"parent":10655740,"text":"KIWI.KI GmbH | Berlin, Germany | Full Time | Onsite | Frontend and Backend Engineers, Scrum Master<p><a href=\"http:&#x2F;&#x2F;kiwi.ki&#x2F;en&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;kiwi.ki&#x2F;en&#x2F;</a><p>KIWI.KI GmbH is the Best Internet of Things Solution in Germany 2015 [1]. Our smart Entry System KIWI allows users to unlock doors completely hands-free, with our identity token KIWI Ki or by using our KIWI App. Our development team is an interdisciplinary mix, covering the full range from hardware and firmware development through systems, web, and mobile. Our highest priority is safeguarding the privacy and security of our users. We believe that it&#x27;s possible to have a connected system without gathering huge amounts of information on the private lives of our customers. As a result, we have developed our whole system almost entirely in-house, using cutting-edge cryptography, an innovative wireless sensor network, and an open-source approach.<p>We offer a high degree of autonomy, challenging tasks, and the ability to impact the company every day; an inspiring work environment based on team spirit, fun and passion for our product; the best tools available; monthly and yearly bonuses tied directly to achievable targets and an employee stock ownership plan; German classes for non-native speakers; weekly team breakfast and lunch as well as a stocked fridge and unlimited coffee; a friendly and international team with people from more than 19 countries and an office in Berlin Mitte.<p>• Backend Engineer: You will be part of the engineering team, with tasks related to new product development, prototyping, and the ongoing development and maintenance of our backend systems. You will be working with all aspects of the company and creating new and useful functionality in regards to our testing, optimization, continuous integration, and on deployment processes. Our backend consists of many microservices, and a RESTful API. We use Python 2 and 3 (Flask, Django, Kombu, Twisted), PostgreSQL, AMQP and Redis amongst others.<p>• Frontend Engineer: Our frontend team is responsible for the maintenance and development of our internal and client-facing frontends. The KIWI App lets users securely open real, physical doors by clicking a button. Our management platform allows our partners to manage hundreds of doors and related user accounts. Our front-ends are REST-ful single-page API consumers built with modern Javascript practices, including Backbone, Browserify, ES6, as well as, end-to-end tests and setting up continuous integration.<p>• Scrum Master: Our Scrum Master is responsible for: Continuous improvement of our agile development processes; providing a smooth and effective development process; planning and execution of sprint planning meetings, retrospectives, sprint reviews and the daily standups; protecting the team from interruptions &amp; obstacles; ensure a good collaboration between product owners and the development team; coaching our team members in topics related to self-organization and agile development. Excellent communication skills in English and German are required.<p>Join our talented team and be a part of the KIWI story!<p>For more information see: <a href=\"http:&#x2F;&#x2F;kiwi.ki&#x2F;en&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;kiwi.ki&#x2F;en&#x2F;jobs&#x2F;</a><p>Please send your application to Charlotte to jobs@kiwi.ki.<p>KIWI is a service of KIWI.KI GmbH.<p>[1] <a href=\"https:&#x2F;&#x2F;www.wallofbusiness.com&#x2F;germany&#x2F;winners\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wallofbusiness.com&#x2F;germany&#x2F;winners</a>","time":1449076629,"type":"comment"}