{"by":"tamta","id":10663350,"parent":10655740,"text":"relayr || DevOps Engineer || Berlin, Germany\nFull-time, Onsite<p>Berlin-based startup relayr is looking for DevOps Engineer:\nYou dreamt of building the future but find yourself bored of working on the mundane tasks of yet another mobile advertising platform or clothing e-tailer?<p>Our platform for the Internet of Things, connects smart devices to each other, and to app developers. We’ve created three easy tools (Platform as a Service, SDKs and a Sensor-Kit – the WunderBar) which allow developers to quickly program Internet of Things solutions, with sensor data to create applications for their physical surroundings.\nYour Tasks:\n&gt;Help build out and scale our platform cluster (currently AWS)\n&gt;Work with the backend developers to bring new features to our platform\n&gt;Keep it running and performing\n&gt;Develop Continuous Deployment and Monitoring strategies\n&gt;Help Develop long term strategies<p>Your Skills:\n&gt;A minimum of 3 years experience.\n&gt;Modern DevOps skills – such as Containers, Hypervisors, service discovery,  Infrastructure as code\n&gt;Experience working with Cloud Providers (AWS is a significant bonus)\n&gt;Command line and shell scripting are your friends, languages such as python and ruby are constant companions.\n&gt;Deep knowledge of Linux operating system (particularly Debian based)\n&gt;Knowledge of TCP networking stack and ability to design firewalls and security rules. (iptables, ipfw, selinux)\nUnderstanding of database administration for Cassandra, InfluxDB, PSQL\n&gt;Monitoring and Continuous Deployment make you passionate. We use ELK, Grafana, Sensu and Jenkins among other tools We love to experiment with new tools\n&gt;You bring experience and feel comfortable working with both, Developers and Operators<p>Sounds interesting? We’d be happy to receive your CV, start date and salary expectations!\nLooking forward to hearing back from you at jobs@relayr.io<p>For more details, follow the link: <a href=\"https:&#x2F;&#x2F;www.relayr.io&#x2F;jobs&#x2F;devops-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.relayr.io&#x2F;jobs&#x2F;devops-engineer&#x2F;</a>","time":1449069007,"type":"comment"}