{"by":"bartonfink","id":10672500,"parent":10655740,"text":"Whole Latte Love | Remote (HQ is Rochester, NY) | Full-Time (W2)<p>Whole Latte Love is among the largest retailers of coffee, espresso and other caffinated goodness on the internet today. In business since 1997 and based out of Rochester, NY, Whole Latte Love sells high end coffee beans and equipment to thousands of people around the world. At Whole Latte Love we are about everything coffee and we put passion behind everything we do. We&#x27;re looking for a couple of developers to help scale out an in-house development team and expand a successful US-based business overseas. This is going to mean a lot of development to grow from our current monorail storefronts to a more service-based platform.<p>Right now, we are built on Rails with a heavily customized Spree back end. We deploy to AWS via Ansible, and are backed by MySQL and Redis. Our front-ends are primarily Deface&#x2F;ERB - this is a traditional multi-page app for the time being. We believe in using the right tool for the job, and are always open to evaluating new technologies and platforms. We&#x27;re not looking specifically for front-end, back-end or devops specialists, although we have pain points that would be served by any of these. Rather, our ideal candidate will build a role around themselves, and be able to find multiple ways they can contribute across our systems, without getting distracted or going too deep down the rabbit hole. We aren&#x27;t tied to any specific amount of experience, but we expect that you&#x27;ll be able to take a feature or issue to production without too much hand holding (what might be called a mid-level or senior developer).<p>It&#x27;s a low-key work environment, and we have a lot of management buy-in to build as effective a development team as possible. Development is primarily remote, so proactive communication, responsibility and accountability are at least as important as technical ability. There will need to be regular overlap with core hours (8:30-5:00 EST) but we can work out the specifics of what that overlap entails depending on where you live.<p>Please write to coffeejobs@wholelattelove.com with an introduction and resume. An online code repository is helpful and even encouraged, but absolutely not required. Thanks!","time":1449175643,"type":"comment"}