{"by":"Everhusk","id":17444652,"parent":17442187,"text":"social.network | Toronto, NYC, or Anywhere | ONSITE &#x2F; REMOTE |<p>Social.network is building a decentralized protocol to power the next generation of online social networks. The world is spending an increasing amount of time contributing to centralized online social networks with business models that promote mass surveillance, increasing amounts of data collections, growing inequality, and behavioural&#x2F;political influence on an scale which the world has never before seen. Help fix that.<p>As a part of the social.network R&amp;D team, you will create POC&#x27;s of new blockchains, social.network wallets, block explorers, and much more using bleeding edge new technology. This is one of the most critical positions in a company aiming to improve global social networking, so we&#x27;re looking for engineers and scientists who are able to execute on a world class level.<p>Responsibilities:<p>- Build POC&#x27;s of new blockchain technology<p>- Research new blockchain technology and stay up to date with the industry<p>- Read whitepapers, write&#x2F;run the code, and evaluate it for applicability to the social.network protocol<p>- Write research reports to educate the open source community on new ideas and progress<p>Requirements:<p>- Extensive crypto and software engineering experience with world class projects to prove it<p>- Deep understanding of computer science, cryptography, and blockchain fundamentals<p>- Someone who leads by example, executes efficiently, and doesn&#x27;t waste time arguing when they could be hacking<p>- A humble hacker who doesn&#x27;t allow their ego to get in the way of their decision making<p>Compensation:<p>1. Base salary (optional - or opt for tokens)<p>2. Option to travel the world and work out of exotic locations with the core team.<p>3. Conference and education stipend<p>4. Equity or portion of fees from platforms, wallets, etc. that you develop<p>Email careers@social.network with your application and we&#x27;ll go from there.","time":1530559659,"type":"comment"}