{"by":"furchin","id":17445371,"parent":17442187,"text":"Built For Me Inc. | Seattle, New York, San Francisco, Remote (US-only) | Senior Front-end Software Engineer | Full Time | $150k-$200k<p>Who we are: We are a small company loathe to use the word “startup”. The phrase that most aptly describes us is “boutique consulting firm” as we are currently working on select software consulting projects while concurrently laying the foundation for a stand-alone product which will focus on enabling business workflows and growing workplace productivity. We are being smart in our approach balancing software consulting with our own product. We balance both to pay ourselves well and support our vision for the future. We have an excellent four person team in place with Big-4 backend experience. We&#x27;re looking to get one final person in place to help us define what a modern and maintainable front-end stack should look like and to help build our product. Hopefully that&#x27;s you.<p>Who you are: An incredibly motivated, amazingly talented full stack engineer whose abilities truly shine on the front end. You know React, Webpack, CSS, Sass, JSX, and the other standard front-end technologies we aren&#x27;t as familiar with. You are a self-starter who can work with little supervision. You are meticulous about details and sufficiently passionate to get things done, yet know when to pivot to a more experimental move-fast mode. You should be a great teammate who looks to make your colleagues more productive because you know they are doing the same for you. You love the state-of-the-art and yet understand the danger of being there and can articulate the reasons why.<p><a href=\"https:&#x2F;&#x2F;www.builtforme.tech\" rel=\"nofollow\">https:&#x2F;&#x2F;www.builtforme.tech</a><p><a href=\"https:&#x2F;&#x2F;blog.builtforme.tech\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.builtforme.tech</a><p>Apply via AngelList: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;builtforme&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;builtforme&#x2F;jobs&#x2F;</a>","time":1530566068,"type":"comment"}