{"by":"tkmcc","id":17447376,"parent":17442187,"text":"Curalate | Full Stack Developer, Back-end Developer, Front-end Developer, Product Designer, Product Manager | Seattle, NYC, Philadelphia | <a href=\"https:&#x2F;&#x2F;www.curalate.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.curalate.com&#x2F;</a><p>Curalate is the leading visual commerce platform, connecting pictures, people and products. Our visual commerce software enables brands to use social content and social audiences to sell more effectively online. Over 1,000 brands and retailers use Curalate to turn images and videos into shoppable content on their sites, social channels, ads, and emails.<p>We&#x27;re hiring developers, designers and product people with exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. We&#x27;re not language zealots: we believe in using the right tool for the job, and are comfortable with a polyglot codebase. That said, today we lean on:<p><pre><code>  Primary Languages: Scala, Javascript\n  Front end frameworks: React&#x2F;Redux, Typescript, AngularJS\n  Back end&#x2F;micro-services stack: Finatra&#x2F;Finagle, Docker ECS, Terraform\n  Data stores: ElasticSearch, MySQL (RDS), DynamoDB, Redis, Redshift, S3\n  Data processing: AWS Lambda, Kinesis, SQS, Spark\n  Machine Learning: MxNet, Caffe, Scala, Python\n  Computer Vision: OpenCV, Scala, C++\n</code></pre>\nAlthough experience with our existing technology stack is great, we&#x27;re much more interested in hiring developers with exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. While we&#x27;re not looking for any specific industry experience you should have a CS degree and&#x2F;or at least two years of experience and come prepared to join a fast-moving, high-performing team.<p>Check out our Engineering Blog to learn more: <a href=\"https:&#x2F;&#x2F;engineering.curalate.com\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.curalate.com</a><p>You can find and apply to all roles on our jobs pages (<a href=\"https:&#x2F;&#x2F;www.themuse.com&#x2F;companies&#x2F;curalate\" rel=\"nofollow\">https:&#x2F;&#x2F;www.themuse.com&#x2F;companies&#x2F;curalate</a>, <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;6v7imw1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;6v7imw1</a>), or reach out to me directly and mention HN (&lt;my username&gt;@curalate.com).","time":1530590054,"type":"comment"}