{"by":"tehwalrus","id":17443637,"parent":17442187,"text":"Pico Technology | C# Software Engineer, and other roles | ONSITE | St Neots, Cambridgeshire, UK | £30k - £50k | <a href=\"http:&#x2F;&#x2F;jobs.picotech.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.picotech.com</a><p>Established in 1991 Pico soon became a leader in the field of PC Oscilloscopes and data loggers. Based out of our head office in St Neots, UK, our software development teams work in an agile environment creating innovative software using C#, solving problems such as visualising large data sets.<p>Due to continuous growth plans Pico Technology are looking to recruit C# Software Engineers with proven C# development skills who are passionate about the code they develop. Additional skills in the following areas would be of interest:<p>C++, JIRA, Microsoft Visual Studio, DVCS, MVVM, WPF, Cocoa and &#x2F; or Gtk#, Intel IPP &#x2F; OpenCV, Azure &#x2F; AWS<p>Equal to the technical skills our developers possess, we also value excellent organisational, communication and interpersonal skills.<p>Our Software Engineers benefit from a working environment that encourages them to produce excellent code with a customisable workstation, multiple monitors and an open plan office. Development Engineers can use Wednesday afternoons to work on inspirational projects either as part of a team of individually.<p>Away from the desk our Development Engineers can be found competing in our annual pool tournament, playing arcade games in the kitchen, gathered round the table football or simply enjoying our picnic benches in the garden. The flexible working hours suit many different lifestyles, with core hours from 10 till 3, Monday to Friday as well as an annual profit related bonus.  A full list of the benefits can be found on our careers website.<p>If this sounds like the environment you would thrive in and are interested to find out more apply now for immediate consideration. Please mention Hacker News in the &quot;where did you hear about us&quot; box!<p>Check out our latest recruitment video, @tehwalrus features! <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;CKJWzBJuZ5E\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;CKJWzBJuZ5E</a>","time":1530552378,"type":"comment"}