{"by":"eagsalazar2","id":17442957,"parent":17442187,"text":"Blackbird Studios | Lead Fullstack Developer | San Francisco | Onsite or Remote* | Contract to hire<p>Blackbird Studios is a full service digital product studio. We specialize in a holistic approach inspired by HCD and Lean. Services include CTO consulting, product strategy, engagement strategy, UX&#x2F;UI, and development plus long term BML iterations and maintenance. We work with large and small companies&#x2F;startups on projects ranging from 1-6 months with 2-6 people on each project.<p>We build full stack web, mobile, physical installations, etc. Our favorite stack is React&#x2F;Redux, GraphQL, Rails, and React Native. We also use a wide range of other tech as needed since we face a pretty diverse set of challenges. Recent and upcoming examples: Elixir&#x2F;Phoenix, .Net, C++&#x2F;Qt, embedded Linux, Native iOS&#x2F;Swift, Native Android&#x2F;Kotlin.<p>Working at Blackbird is very different from larger product companies. We operate in very strategic relationships with our clients which gives us a unique opportunity every few months to deep dive into a new interesting understanding of our client&#x27;s business and build ground up new apps where everyone is making major and early contributions.<p>We are looking for a Lead Developer with extensive experience in dev team leadership, new product development, and collaboration with business and design stakeholders. Serious consulting experience is also a huge plus. Specific skills ideally include our favorite stack (see above) plus deep knowledge of either native iOS or Android. As a senior Blackbird team member, occasional travel to San Francisco and other locations is part of the job for project kickoffs and other critical collaboration phases or meetings. In a given month this can be anywhere from no travel up to a couple days every week or occasionally an entire week on site with a client.<p>I am a founder so ask me anything! If there are other aspects of what we do that interest you definitely still hit me up!<p>Email me at jobs@blackbird.us","time":1530548372,"type":"comment"}