{"by":"blatherard","id":17445068,"parent":17442187,"text":"Flatiron School (now part of WeWork) | Software Engineers, esp. Seniors | New York, NY (NYC) | ONSITE | FULL-TIME<p>Hi, I&#x27;m the Engineering Director on the Product&#x2F;Engineering team at the Flatiron School. I joined the team about four months ago as part of a general scaling up of the team (we&#x27;re currently about 25 devs and growing) and love it. We mostly work on Learn, a modern Learning Management System that runs the school&#x27;s online coding bootcamps. This place is an unusually kind and nurturing place, and we have a mission that we believe in. A number of the developers originally went through the Flatiron School, so the level of knowledge and empathy with users is unusually high.<p>We&#x27;re looking for developers with a wide range of backgrounds, especially people with a few years under their belts and an interest in mentoring less-experienced developers. We value diversity of all kinds and would love to benefit from having many perspectives. I can speak from my own experience as a parent that it&#x27;s a family-friendly place with pretty good core hours, flexibility around timing, good health benefits, friendliness toward dialing in (though we generally prefer to work together in-person) and just a generally nice vibe.<p>As far as the tech stack goes, we mostly use Ruby&#x2F;Rails, Elixir&#x2F;Phoenix and Javascript&#x2F;React and we&#x27;re moving to AWS. I wouldn&#x27;t get too hung up on having all of these particular items on your resume. What&#x27;s most important to me is having some ways of solving problems collaboratively on a team. There&#x27;s all kinds of cool problems to work on here as we scale our user base, course offerings, team and our infrastructure, and there will be plenty of new problems that will require adaptability, openness and an ability to communicate.<p>We have some job listings at <a href=\"https:&#x2F;&#x2F;flatironschool.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;flatironschool.com&#x2F;careers&#x2F;</a>, but if you&#x27;re interested in finding out more, applying or just want to chat, please drop me a line at paul@flatironschool.com.","time":1530563396,"type":"comment"}