{"by":"champbronc2","id":17442382,"parent":17442187,"text":"Rain Financial | San Francisco, CA | Full Time | ONSITE\nRain is a regulated digital currency exchange established in a new region.<p>We have a partnership with a central bank, as well as multiple other banking partnerships. We believe we are a security company at our core. We are working closely with regulators to form one of the first licensed digital currency exchanges in the world. We strive to offer some of the industry&#x27;s best rates and great customer support. We are currently in a private beta serving our first customers and building out a veteran technology team. We look forward to hearing from you.<p><i></i>Backend Engineer<i></i><p>Our platform team will be responsible for maintaining the backend systems that are responsible for managing users, processing orders, sending&#x2F;receiving digital currency transactions, etc. We want to build a platform team of experienced, senior software engineers, that have 6+ years experience in the financial industry.  They should have accumulated a great deal of domain knowledge about how to write software that handles money.  In particular, they should have a solid understanding of how to build secure, robust, and scalable web applications.  Knowledge of the digital currency industry is also highly sought after but not required.<p><i></i>Requirements<i></i>\n - Bachelor&#x27;s degree in Computer Science, Engineering or related field\n - You’ve been building large scale financial systems professionally for 6+ years and can point to things you’ve worked on\n - You enjoy and have experience with building APIs at scale and know the factors that lead to a good API\n - You are a very strong communicator. You’re excited to explain complex technical concepts and share your knowledge with different audiences\n - You are curious how things work and when things break you are eager and able to help fix them\n - You are located in or willing to relocate to the San Fransisco Bay Area \n - Bonus: Experience with Go and Postgres<p>Please email applications to resume@rain.bh","time":1530544772,"type":"comment"}