{"by":"nidx","id":17442754,"parent":17442187,"text":"ICOM Productions | Calgary, Alberta, Canada | Full-Time | Web Software Developer | ONSITE | <a href=\"https:&#x2F;&#x2F;www.icomproductions.ca&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.icomproductions.ca&#x2F;</a>\nAbout Us<p>ICOM is an award-winning eLearning company. Our team is made up of more than 50 learning specialists, including instructional designers, project managers, writers, graphic designers, and software programmers.<p>At ICOM, it&#x27;s our mission to challenge and inspire the world to learn differently. Over our 22-year history, we’ve developed hundreds of online education programs for some of Canada’s biggest and best-known companies. From modifying behaviours to driving business objectives, ICOM creates engaging eLearning programs that help produce real on-the­-job results.<p>Our office is located on Stephen Avenue in the heart of downtown Calgary, close to public transportation and loads of attractions.<p>About The Position<p>As a software developer at ICOM, you will collaborate with our team of technical wizards to produce innovative solutions using the latest web technologies. Have a new technology you’ve been dying to use? We are open to trying new things, but be prepared to teach your fellow developers all about it!<p>Our ideal candidate has graduated with a degree in Computer Science within the last few years and is interested in cutting-edge web application development. They are able to motivate themselves in a flexible environment. They can solve problems both individually and collaboratively, while not being afraid to ask for help when the need it or take criticism of their code. They are familiar with at least one C-style language, such as PHP, Java, C, C#, JavaScript, or the Go programming language. We strive for knowledge of the full stack, so BASH command line experience will be very helpful.<p>Here are some of the technologies that we are currently using:<p><pre><code>  * Git&#x2F;GitLab\n  * MySQL&#x2F;Aurora\n  * CentOS&#x2F;RHEL&#x2F;Amazon Linux\n  * HTML &amp; CSS&#x2F;LESS\n  * JS\n    * ES6 + JSX using Babel\n    * React\n    * Node.js &amp; npm&#x2F;yarn\n  * PHP(5.3 &amp; 7.1)</code></pre>\nWe don’t expect you to have had real-world experience using all of these technologies. ICOM is a learning company, and that applies to our employees as much as it applies to our clients. If any of this appeals to you, apply now!<p><a href=\"http:&#x2F;&#x2F;jobs.icomproductions.ca&#x2F;apply&#x2F;Vx8mXx50mA&#x2F;Web-Software-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.icomproductions.ca&#x2F;apply&#x2F;Vx8mXx50mA&#x2F;Web-Software...</a>","time":1530547104,"type":"comment"}