{"by":"rahimnathwani","id":17444738,"parent":17442187,"text":"OneFi | London, UK | Full-time | VP Engineering, Senior Product Manager, Data Scientist, Head of Risk | <a href=\"https:&#x2F;&#x2F;onefi.co\" rel=\"nofollow\">https:&#x2F;&#x2F;onefi.co</a><p>We&#x27;re a small team of high performers who have built the leading African Mobile First Consumer Lending Business. Ranked #1 for Finance apps (and #41 overall) in Google Play in Nigeria. Fast growing business (5%&#x2F;month). Well funded. Team spread between Lagos, Cape Town and San Francisco. As we expand our platform to new markets (Ivory Coast, Ghana, Senegal, Egypt), we are planning to establish our senior leadership in London.<p>VP of Engineering [<a href=\"https:&#x2F;&#x2F;careers.onefi.co&#x2F;3&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.onefi.co&#x2F;3&#x2F;</a>] : Responsible for the entire engineering organization. This includes recruiting, retention, organizational structure, technical roadmaps, engineering process and practices, and outcomes.<p>Senior Product Manager [<a href=\"https:&#x2F;&#x2F;careers.onefi.co&#x2F;2&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.onefi.co&#x2F;2&#x2F;</a>] : Own the whole product, and work with the VP of Engineering to expand the platform into multiple countries.<p>Head of Data Science [<a href=\"https:&#x2F;&#x2F;careers.onefi.co&#x2F;1&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.onefi.co&#x2F;1&#x2F;</a>] : Turn the wealth of data Paylater&#x2F;OneFi has gathered over the years into a clear edge over newer entrants;<p>Head of Risk [<a href=\"https:&#x2F;&#x2F;careers.onefi.co&#x2F;4&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.onefi.co&#x2F;4&#x2F;</a>] : Develop the framework for the business to be run on a cLTV basis and drive risk decisions to support maximum growth<p>If you’re interested in any of these roles, please email me (careers[AT]onefi.co) with your CV or a link to your profile (on LinkedIn or similar), mentioning HN in the subject line.","time":1530560324,"type":"comment"}