{"by":"dekobon","id":17443966,"parent":17442187,"text":"Joyent | San Francisco &#x2F; Denver | Full-Time | ONSITE or REMOTE<p>Technical Product Manager (TPM)<p>The TPM is chief customer advocate within the Manta (object storage) product group and will report directly to the Product Owner. It is the most important role in the product group and arguably more important to the day to day functioning of the organization than the Product Owner. They will bring an analytic mindset to uncovering sources of risk to the product and customers. A TPM will need to be compassionate and level-headed towards team members within the Manta group while at the same time being unapologetic about making sure the customer’s needs are met. At times this role will be supervisory, at times it will be solitary and require contemplation of data. The TPM will determine their own day to day activities with the singular mindset of ensuring customer satisfaction.<p>Detailed Description: <a href=\"https:&#x2F;&#x2F;www.joyent.com&#x2F;about&#x2F;careers&#x2F;technical-product-manager\" rel=\"nofollow\">https:&#x2F;&#x2F;www.joyent.com&#x2F;about&#x2F;careers&#x2F;technical-product-manag...</a><p>Experience<p>The TPM will <i>ideally</i> have the following experience:<p>5+ years of experience as a software engineer as an individual contributor<p>3+ years of experience in management (managing 10+ people)<p>1 year of experience in a customer facing or product management role<p>2 years of experience working in a dysfunctional organization that changed to a functional organization<p>Experience creating development processes<p>Experience creating quality processes<p>Experience creating release processes<p>Experience working in an pure operations organization or in a devops model<p>An ideal TPM candidate may have the following experience:<p>Worked as a turnaround consultant&#x2F;expert<p>Experience with cloud computing, systems software, distributed systems or storage<p>Worked actively in a risk-management role","time":1530554469,"type":"comment"}