{"by":"ishwarn","id":17443591,"parent":17442187,"text":"Abl Schools|Multiple positions (engineering and design)|San Francisco|Full-time|ONSITE|www.ablschools.com<p>Technology has made the world more connected, fundamentally changing how we live, work and interact; yet traditional schools have not evolved to prepare students for the 21st century. Replacing textbooks with tablets won’t be enough. We believe schools need a new foundation. That’s why we’re building a web-based school scheduling platform, that allows administrators to put master schedules and daily calendars into a single cloud-based system. We are creating the next generation of software for all K12 schools to fundamentally change how they design, measure and improve their schools. We are also a company that deeply values diversity in every way.<p>View openings on our site:\n<a href=\"https:&#x2F;&#x2F;ablschools.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ablschools.com&#x2F;careers&#x2F;</a><p>--------------------------------------------------<p>Sr. Front-End Engineer:<p>Your Impact<p>+ Work collaboratively with the Product and Design team to understand the experiences and pain points of schools, teachers, and students<p>+ Define and build compelling new products and exciting new features that give educators insights that will enable them to optimize how they use their resources<p>+ Use your extensive knowledge of front-end technologies to build high-quality designs that are scalable<p>+ Manage code review, increase performance, and communicate best front-end engineering practices<p>+ Create a first of its kind interface that will progress K-12 schools and their communities<p>Qualifications<p>+ Experience with Javascript frameworks such as React, Backbone, Angular etc.<p>+ You should have a great feel for user experience and an eye for beautiful designs<p>+ Bring a deep understanding of best practices in design, optimization, interaction, and usability<p>+ Familiarity with the whole web stack, including protocols and web server optimization techniques<p>--------------------------------------------------<p>Sr. Product Designer<p>What you&#x27;ll do:<p>+ You’ll think and design holistically to create a cohesive and coherent product experience that delivers high value to school leaders<p>+ You’ll tackle a complex puzzle--master scheduling-- and provide users with an intuitive tool and process, simplifying a complicated workflow<p>+ You&#x27;ll create high-level user stories, UX flows, wireframes, prototypes, design mockups, specs, and production assets<p>+ You’ll collaborate with the internal schools and engineering teams, and with customers<p>+ You’ll provide actionable feedback gracefully and without ego, and won&#x27;t hesitate to seek guidance yourself<p>Qualifications:<p>+ Impact focused: You’re a strategic thinker able to tackle complex user problems, addressing fundamental user needs and delivering impact<p>+ Project management: You&#x27;ve designed, coordinated, and shipped intuitive user experiences from conception to execution.<p>+ Ability to think big and small: You’re comfortable envisioning versions of features many years in the future and working on a single feature’s first iteration<p>+ Design depth: Experience designing data-heavy visualizations, recommendation UX and&#x2F;or enterprise software is a big plus.<p>+ Natural leadership: You enjoy taking initiative and owning projects, big and small. The details matter and you&#x27;re committed to getting it done right.<p>+ Growth-mindset: You effectively convey your opinions to peers directly with clear expertise and humility. You encourage others to challenge or build upon your opinions.<p>--------------------------------------------------<p>Personal note: I&#x27;ve been on the Abl engineering team for about 9 months and I love it. First, the interview process was fair.  Second, the mission and the team make coming into work enjoyable. I could go on. If you have any questions, feel free to reach out to me - my contact info is in my profile.","time":1530552124,"type":"comment"}