{"by":"bellwether","id":17448812,"parent":17442187,"text":"CareerBliss | Irvine, CA | Software Architect | REMOTE, Full-time | <a href=\"https:&#x2F;&#x2F;www.careerbliss.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careerbliss.com&#x2F;</a><p>CareerBliss is a resource and community for job seekers. We provide users with career research, company reviews, job postings and email alerts.<p>We are comprised of an entrepreneurial team looking to expand its reach into F1000 companies and agency accounts in the talent acquisition space.  Our technology stack is a combination of Microsoft, Google, and Open Source technologies. Our web applications are in C# ASP.NET MVC, our application processing is a combination of C# and Golang, and our databases are a combination of SQL Server, Solr, and Mongo. Our older infrastructure is predominately C# and our newer infrastructure is predominately Golang.<p>The Software Architect will be an integral component in CareerBliss’ next growth phase. The near-term goal for this position is to ensure stability in our current infrastructure while a new infrastructure is built. Just as importantly, the long-term goal for this position is to leading development across a variety of technology stacks, from websites to microservices to standalone applications to native mobile applications.<p><i>Responsibilities</i>\n- Lead development on existing C#, ASP.NET MVC, and SQL Server websites and applications\n- Maintain and lead future development on Golang applications for email and ETL processing\n- Be a key member in defining a new system infrastructure<p><i>Skills</i>\n- Experience leading development on backend infrastructure\n- Excellent data analysis and problem-solving skills that can see the big picture and the little details\n- Strong written and verbal communication skills, both with programming and business\n- Ability to adapt to new and existing technology changes\n- Demonstrate leadership qualities and ability to produce in an independent environment\n- Outstanding organizational skills, attention to detail, and the ability to handle multiple tasks in a fast-paced environment<p><i>Qualifications</i>\n- Computer Science degree (or equivalent training and experience)\n- 7+ years of experience with Microsoft technologies (C#, SQL Server)\n- 1+ years of experience with Golang\n- 2+ years of experience with Solr or Elasticsearch, learn to rank is a plus\n- 3-5 years of leadership experience\n- AWS and Google Cloud Platform experience is a plus<p>If you are interested, PM me or send your resume to nadeem {dot} chaudhry {at} careerbliss {dot} com","time":1530611122,"type":"comment"}