{"by":"roasbeef","id":17453698,"parent":17442187,"text":"Lightning Labs | Frontend Developer, Crypto Protocol Engineer, Infrastructure and Distributed Systems Engineer | San Francisco | Onsite or Remote | Full-time<p><a href=\"https:&#x2F;&#x2F;lightning.engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;lightning.engineering&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;angel.co&#x2F;lightning&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;lightning&#x2F;</a><p>At Lightning Labs, we build technology to scale Bitcoin and blockchains. Our current focus is the development and deployment of the Lightning Network[1], an open blockchain scalability protocol. We push the edge of innovation w.r.t blockchain scalability, privacy-preserving smart contracts, and cryptocurrency UX. Our team includes applied cryptographers and designers of the Lightning Network protocol, including Bitcoin developers such as roasbeef[2].<p>We’re looking for:<p>{Frontend Developer}<p>Frontend developer to address UI&#x2F;UX challenges associated with building second-layer blockchain applications. Our applications are built on React, React-Native, MobX and Electron, communicating with a Lightning daemon over a binary RPC protocol. Ideal applicants have experience building+shipping React-Native applications and maintaining open source projects.<p>{Cryptographic Protocol Engineer}<p>Experienced software engineer versed in applied cryptography, peer-to-peer networks, distributed systems, open source software, and cryptocurrency protocols. Tasks include working on lnd[3], the most feature-complete implementation of the Lightning Network, neutrino[4], an advanced light client operating mode for Bitcoin, and contributing to the design of the BOLT[5] specifications.<p>{Infrastructure and Distributed Systems Engineer}<p>Systems-oriented engineer (or SRE) to build highly-available, secure systems, lowering the barrier to entry for operating routing nodes. Tasks include writing advanced software tooling for automated channel management, initial client channel selection (autopilot), ongoing capital management and optimization, monitoring infrastructure for routing nodes, and passive analysis of the health of the network from graph theoretic metrics.<p>To apply, send a brief description of your relevant experience, github link (optional) and resume to jobs@lightning.engineering.<p>[1]: <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Lightning_Network\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Lightning_Network</a><p>[2]: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;roasbeef\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;roasbeef</a><p>[3]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;lightningnetwork&#x2F;lnd&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;lightningnetwork&#x2F;lnd&#x2F;</a><p>[4]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;lightninglabs&#x2F;neutrino\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;lightninglabs&#x2F;neutrino</a><p>[5]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;lightningnetwork&#x2F;lightning-rfc&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;lightningnetwork&#x2F;lightning-rfc&#x2F;</a>","time":1530652873,"type":"comment"}