{"by":"fnl","id":17458017,"parent":17442187,"text":"Selerity | Manhattan, NYC, NY | <i>Java</i> NLP Engineer | ONSITE, REMOTE (world-wide) | Full-time | <a href=\"http:&#x2F;&#x2F;www.seleritycorp.com&#x2F;careers&#x2F;smle.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.seleritycorp.com&#x2F;careers&#x2F;smle.html</a><p>Selerity provides low-latency, high-performance AI solutions for financial workflow automation as a complete analytics and recommendations package over any kind of unstructured content the sell-side process, particularly for in-house, (material) non-public information (e.g., trader chats), while mingling it with publicly available data (e.g., news), all in real-time.<p>We’re looking for an experienced Java NLP Engineer to join us in a hands-on role, applying the latest technology in natural language processing and machine learning (including deep learning) to solve real-world problems in capital markets, institutional research, financial news and social media.<p>Qualifications: At least 5 years (ideally 10+) of challenging work experience. • Advanced proficiency developing high-performance, concurrent Java in Linux environments. • Rigorous data science foundations and theory, including algorithms, statistics, experimental setup, etc. • Experience applying SOTA NLP and machine learning methods to large-scale datasets, especially open information extraction techniques. • Verifiable in-depth experience with at least a hand-full NLP-relevant libraries. • Experience with deploying, monitoring, and maintaining large-scale A.I. applications in production environments. • Experience with large-scale analytics and machine learning technologies including TensorFlow (Serving), (Py)Torch, Spark, Hadoop, H2O, etc. • Nice to have: Advanced proficiency developing high-performance Python code.<p>What we offer:<p><pre><code>  - Fully remote position, world-wide, or a work-place in Manhattan\n  - Flexible work hours &amp; startup culture\n  - Yearly team meetings in NYC\n  - Equity and competitive salaries\n</code></pre>\nTo apply, please send your CV and short cover letter to careers@selerityinc.com; I&#x27;m Florian, the CTO, and look forward to meeting you!","time":1530721033,"type":"comment"}