{"by":"hass_rg","id":17455368,"parent":17442187,"text":"Red Guava | REMOTE | Software Developers | Full-Time (30 hours&#x2F;week) | <a href=\"https:&#x2F;&#x2F;redguava.com.au&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;redguava.com.au&#x2F;</a><p>Red Guava is a small, bootstrapped and profitable software company based in Melbourne, Australia. Our team works remotely from all over the world.<p>Our sole focus is building an application called Cliniko (<a href=\"https:&#x2F;&#x2F;cliniko.com\" rel=\"nofollow\">https:&#x2F;&#x2F;cliniko.com</a>). Cliniko makes life easy for Allied Health professionals by handling appointment scheduling, storing treatment notes and a bunch of other things. It&#x27;s quite a neat system and is used globally by tens of thousands of people every day.<p><i>Things we love to do:</i><p><pre><code>  - Provide great software and service.\n\n  - Work with talented people.\n\n  - Delight our customers.\n\n  - Make the world a little bit better.\n</code></pre>\n<i>The job</i><p>We are looking for an amazing software developer to join our team. This doesn’t mean you need to have 5+ years experience in the industry, we care about skill, passion and integrity much more than credentials.<p><i>Who you are</i><p>You are a software developer presumably, otherwise your chance of success for this role is quite low.<p>You love to code and for your work to have a positive impact. You want to have fun and enjoy yourself. You want to constantly improve.<p><i>You&#x27;re comfortable working in at least a few of these:</i><p><pre><code>  - CSS\n\n  - DOM\n\n  - Client side JS\n\n  - JSON APIs\n\n  - Web frameworks\n\n  - Relational databases\n\n  - Redis&#x2F;Sidekiq\n</code></pre>\nSee the full job description and apply now: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;redguava&#x2F;960bdf6d-0731-490e-981b-becf83492a17\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;redguava&#x2F;960bdf6d-0731-490e-981b-becf8...</a>","time":1530680888,"type":"comment"}