{"by":"suhaasprasad","id":17455547,"parent":17442187,"text":"Revfluence | Backend &amp; Full Stack Engineer Roles | ONSITE | Full Time | Visa | San Francisco, CA | $100k - $200k + generous equity + benefits<p>Revfluence (<a href=\"https:&#x2F;&#x2F;www.revfluence.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.revfluence.com&#x2F;</a>) is a profitable, Series A funded enterprise SaaS platform that helps companies create high quality branded content by finding, connecting and coordinating with thousands of talented content creators and influencers. Our platform aims to solve a greater challenge beyond influencer marketing with a novel, data-driven approach to making the process of collaborating with photographers, videographers, influencers and other content creators more seamless and scalable than ever before, while also providing the infrastructure to constantly learn and recommend the right piece of content to the right person through the right channel.<p>This is a unique opportunity to join a fast growing startup with ambitious goals to make it possible for talented creators to earn a living doing what they love. We&#x27;re a well-funded, 40+ person company but our core team of engineers is still quite small and looking to grow quickly, which means you can have the opportunity to take on ownership and make a big impact!<p>We’re looking for engineers with the ability and desire to build a great product who aren’t afraid of learning new technologies. Our current tech stack includes Python, Google App Engine, Django, Postgres, and ReactJS + Typescript (currently migrating from AngularJS). Check out some of our job postings for more details!<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;revfluence?team=Engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;revfluence?team=Engineering</a><p>Feel free to also send me an email with any questions! My name is Suhaas, CTO at Revfluence, and you can reach me at sprasad@revfluence.com","time":1530684901,"type":"comment"}