{"by":"s3nnyy","id":17473938,"parent":17442187,"text":"onedot.com | Data Analyst (or Manager) - German speaking | Zurich, Switzerland | SALARY: 90k-110k CHF for individual contributor, 100k-140k CHF for manager | ONSITE | Swiss or EU member-states passport-holders and German speaking folks only<p>If you know anyone German-speaking who would fit to this role, please recommend him&#x2F;her; we pay a nice commission for every successful recommendation. For more info, reach out to me at iwan.gulenko@onedot.com. Here the German job advert:<p>Über Onedot: Wir entwickeln Machine Learning Algorithmen, probabilistische Methoden und Textanalysen, um unstrukturierte Daten automatisch in strukturierte Information zu verwandeln. Wir sind momentan ein 20-Personen Team und wachsen gerade stark. Wir werden von führenden Venture Capital Firmen und Weltklasse-Unternehmern unterstützt.<p>Gesucht sind zwei Experten:<p>1) Data Analyst: Hands-On Erfahrung im Customer Success.<p>2) Data Analyst Manager (Deliverymanager, Projektmanager), eine Person, die das Customer Success Team aufbauen soll.<p>Für beide Rollen wäre Folgendes ideal: Erfahrung mit ETL Software, Daten Pipelines, Data Warehousing oder frühere Arbeit als IT-Berater, BI Analyst, Data Analyst, oder im Customer Success.<p>Du musst in der Rolle viel mit Daten und Kunden arbeiten. Ein Beispiel: Du musst gemeinsam mit einem Kunden aus dem MedTech, oder Gentest Bereich das Zielschema von Datenbanken anpassen, Data Transformation Konzepte erarbeiten, und SQL Queries ausführen. Du musst Daten zusammenführen&#x2F;trennen und eigenständig Entscheidungen treffen, die Wert schaffen. Unsere proprietären Technologie hilft Dir dabei. Ein Beispiel: Unser Backend erzeugt eine 80% Trefferwahrscheinlichkeit bei Schema Mapping.<p>Hiring Prozess:<p>1. Kurzer Kennenlern-Call - 15 Minuten.<p>2. Take-home Task: Generiere Business Insights basierend auf einem SQL-File (Dauer: 2-4 Stunden). Dies ist Grundlage für das Onsite.<p>3. Call mit unserem CTO - 30 Minuten.<p>4. Onsite Tag bei uns im Office in Zürich. Du wirst mit dem Team gemeinsam weiter an dem Take-home Task arbeiten , und wir werden uns gegenseitig auch beim Mittag besser kennenlernen.<p>Gehalt: 90k-110k CHF für den hands-on Data Analyst, 100k-140k CHF für den Data Analyst Manager. Infos bezüglich Lebenserhaltungskosten in Zürich findest Du hier: <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;2GNlJcA\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;2GNlJcA</a>.<p>Schreib an iwan.gulenko@onedot.com und sag auch ob Du dich als hands-on Analyst oder als Manager bewerben möchtest.","time":1530901740,"type":"comment"}