{"by":"kapnobatairza","id":7324242,"kids":[7324524],"parent":7324236,"text":"Max2 Inc.<p>&gt;&gt;LOCATION&lt;&lt;<p>New York City<p>&gt;&gt;WHO WE ARE&lt;&lt;<p>MaxSquare is developing a suite of capabilities accessible through SMS, mobile apps or the web that allows local businesses to leverage what we call the &quot;the local marketplace API&quot;. We believe there is a huge opportunity in developing a better way for local businesses to interact with their potential customers and vice versa.<p>We are well capitalized through angel investors and positioned to leverage several key strategic partnerships once the initial product offering has completed development.<p>&gt;&gt;WHERE WE ARE&lt;&lt;<p>We&#x27;ve currently in RAD mode developing our MVP. For our MVP, our backend is built in MySQL and a web2py framework for the application tier. The frontend app is built in Sencha Touch and wrapped in PhoneGap and communicates with the backend with a RESTFUL api. The backend and API is being developed in-house while the front-end is currently being contracted out.<p>We are looking for our #2, #3, #4, and #5 technical hires.<p>&gt;&gt;BENEFITS AND WORK ENVIRONMENT&lt;&lt;<p>We are located in an awesome private brownstone building with a garden, kitchen, a nice break room, in a quiet neighborhood on the UES of New York. Mostly empty right now, with ample space to create an ideal work environment.<p>Founder title and meaningful equity stake.<p>Excellent health, dental and vision benefits.<p>Stocked fridge, free breakfasts, lunches, snacks, seamless &amp; postmates in the office.<p>Flexible work hours, no counting vacation or sick days. \nChoice of MacBook Pro or 2xCinema Displays (or whatever equivalent you want).<p>Build&#x2F;choose your ideal workstation!<p>No forced work environment or corporate culture: All we care about is building the product and nurturing a very hacker-friendly culture. We are 100% hacker owned and operated.<p>A business that puts solving the problems of our customers first. Our investors and team only care about one thing: Building the best product possible. We care about creating technology that keeps small local businesses in their neighborhoods. Because who wants to live in a world where every other building is a bank, megabrand or franchise?<p>&gt;&gt;WHO YOU ARE&lt;&lt;<p>A world-class engineer passionate about building beautiful and, more importantly, useful products using bleeding-edge technology.<p>Someone who thrives in a startup environment and wants to be involved in building a company from the ground up.<p>Someone who pays attention to details, a perfectionist who is driven and comfortable working with rapidly evolving products. You are proactive about improving our products and you are able to prototype and iterate quickly.<p>&gt;&gt;WHAT WE ARE LOOKING FOR&lt;&lt;<p>--- CTO<p>Our current CTO will be moving into the COO role. We are looking for candidates with a strong full stack pedigree in web and mobile app architecture and will be responsible for designing a scalable architecture, overseeing product development and providing technical leadership.<p>Compensation in the range of 100-200K.<p>--- Backend Engineer<p>Will be responsible for writing and maintaining the back-end.<p>Open to developers with expertise in any modern technology stack - as long as you can make a case for it.<p>Must be able to collaborate and work with frontend engineers<p>Being able to support and work with the current back-end framework in MySQL and web2py is a plus, but not necessary if we transition to a new stack like django or flask.<p>Expertise or knowledge in machine learning and&#x2F;or natural language processing a plus.<p>Must be comfortable writing lots of code.<p>Compensation in the range of 50-100K<p>--- Frontend Engineer<p>Must be able to work with the currently contracted devs to finish the MVP in Sencha Touch, and possibly for future releases while in transition to moving to a native mobile app.<p>Must have a high level of proficiency in either native iOS or native Android development. Proficiency in both is a plus.<p>Must have some level of proficiency in desktop web frameworks to support a future release for desktop web browsers.<p>Must be able to coordinate with our backend engineer, so some knowledge of back-end architecture and APIs is required.<p>An eye for and&#x2F;or competency in UI&#x2F;UX design a huge plus.<p>Must be comfortable writing lots of code.<p>Compensation in the range of 50-100K<p>--- UI&#x2F;UX Designer<p>Will be responsible for evolving our brand as well as the product itself.<p>Will be responsible for conceptualizing and creating a distinctive and elegant UX, UI and style guide that will be used across our products.<p>Must have proficiency in Photoshop, Illustrator, or equivalent visual design tools.<p>Must be able to work with other developers to translate mockups into products, so some knowledge of front end markup code (HTML,CSS,JQUERY,etc.) is a plus or must be willing to learn.<p>Must have an eye for clean, beautiful, intuitive design that can translate basic AND complex solutions into fast and simple to user interfaces and user interactions.<p>Must understand that when it comes to UI, less is more.<p>Must be passionate about typography, icon design, color, imagery and graphic elements.<p>Must be passionate about the design of &quot;everyday things&quot;.<p>Will have the unofficial title of Chief Design Officer and in charge of improving company aesthetics (stationary, letterheads, email templates, merchant collateral, business cards, office interior design&#x2F;decorations).<p>A talent for creating beautiful and accessible ways to visualize data is a big plus.<p>Compensation in the range of 40-100K.<p>&gt;&gt;HOW TO REACH US&lt;&lt;<p>Drop me a line if you think you&#x27;d be a good fit: careers@max2.com","time":1393683168,"type":"comment"}