{"by":"joelgascoigne","id":7324781,"kids":[7324806,7327969,7341807,7360009,7355620,7326806,7327643,7327793,7346485,7326922,7326990],"parent":7324236,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bufferapp.com</a>)<p>Hey everyone, hope your weekend is off to a killer start!<p>February just came to a close and Buffer stands at 1.4M total users served by a small 16 person team spread across 12 cities and 5 continents. 130,000 of our users are actively using the product each month. We generated $333,000 in February, and we have $520,000 in the bank. The average salary at the company is $98,000 and our total funding to date is $450,000 which we raised in December 2011, for which we gave up 14% of the company. I&#x27;m sharing all of this because one of the highest values we have at Buffer is to be fully transparent, and I&#x27;d love for you to be part of the incredible journey we&#x27;ve embarked upon.<p>At 16% month over month revenue growth on average in the last 6 months, we&#x27;re seeing increasing demand to build out the product further and help our fast-growing customer base with all their social media problems. To achieve this, we&#x27;d love your help with some interesting engineering challenges.<p>Do any of these areas stand out for you? I&#x27;d really love to hear from you:<p><pre><code>    - Reliability Hacker (we&#x27;re sending 400,000 posts to social networks every day,\n      our architecture is still not ideal)\n    - Happiness (Support) Hacker (we have a crazy obsession for customer happiness\n      and want to build our own tools to go beyond what&#x27;s normal)\n    - Android Lead (our Android app has half a million downloads but currently no\n      full-time developer!)\n    - iOS Hacker (our favorite people who use Buffer are all crying out for an\n      iPad app)\n    - Growth Hacker (our landing page conversion is at 7%, we&#x27;d love your help\n      improving it and many other metrics)\n    - Frontend Hacker (last month 130,000 people used Buffer, we&#x27;d love to improve\n      our dashboard interface and extensions for them)\n</code></pre>\nSome of the tech we work with: PHP, Python, MongoDB, AWS (Elastic Beanstalk, Elasticache, SQS), Backbone.js, Grunt.js, Android, iOS).<p><pre><code>    - We&#x27;re completely open about salary and equity, in fact here is a spreadsheet\n      of all individual salaries: https:&#x2F;&#x2F;docs.google.com&#x2F;a&#x2F;bufferapp.com&#x2F;spreadsheet&#x2F;ccc?key=0AgrWVeoG5divdE81a2wzcHYxV1pacWE1UjM3V0w0MUE&amp;usp=drive_web#gid=1.\n      It&#x27;s most likely you&#x27;d fall into a range of $85,000-$120,000 and 0.1%-1%.\n    - We&#x27;re a fully distributed remote team, and we come together 3 times a year for\n      super fun retreats. The last one was in Thailand in December, our next is\n      Cape Town in April!\n    - We have a big focus on culture, that&#x27;s the main thing we think about when someone\n      joins the team. Here is our slide deck of values: http:&#x2F;&#x2F;www.slideshare.net&#x2F;Bufferapp&#x2F;buffer-culture-03 \n</code></pre>\nI&#x27;ll read through emails with our CTO Sunil, I hope yours might be part of that. Send him a quick note at thenexthacker@bufferapp.com. If you&#x27;d like you can check out more details about all the areas we need help with at <a href=\"http://jobs.bufferapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.bufferapp.com</a><p>I&#x27;m excited about the chance to work with you. If you have any questions about our culture, product or journey so far, add a reply to this - I&#x27;ll be checking throughout the day to get back to you :-)<p>- Joel (Founder&#x2F;CEO)","time":1393691066,"type":"comment"}