{"by":"edolfo","id":7324762,"parent":7324236,"text":"Full-Stack Engineer<p>Location: Foster City, CA<p>Use Angular + Node on genomic data to define the future of medicine!<p>At SVBio, we are working on bringing next-generation DNA sequencing technology to the clinical setting. Our software stack includes a proprietary scientific workflow engine running on top of our distributed system on Amazon, data and machine learning infrastructure, and ways to visualize and interact with it all. We have standing relationships with top-tier medical institutions, including the Mayo Clinic, who are extremely excited about our product.<p>We&#x27;ve built a world-class team, and are looking to augment it with a full-stack engineer who is looking for an opportunity to grow and learn. You are well-versed in javascript and have experience with an MV* client-side framework (Angular&#x2F;Backbone&#x2F;Knockout&#x2F;Ember&#x2F;etc...). Your primary challenges will include things like clean API development, rethinking the way Angular is being used right now in the industry, and creating rich, interactive interfaces to expose and visualize patient data based on their genome.<p>Requirements:<p>- Exceptional coding skills, with a solid understanding of software design, architecture principles and best practices.<p>- Strong analytical skills; you should be comfortable spending just as much time (or more!) thinking about a problem before implementing a solution.<p>- A demonstrated proficiency in server-side programming and writing clean, maintainable code.<p>- Extremely independent, but collaborative; you will need to talk to scientists, engineers, physicians, and business people for a list of requirements, figure out the technical specifications, collaboratively put together a roadmap, and execute to completion.<p>Additional valuable experience:<p>- An eye for aesthetics (UI&#x2F;UX)<p>- Experience writing clean APIs<p>- Experience taking a product from inception to completion<p>We are a Sequoia-backed company (seed and series A).  To apply, send some information my way (elicudine at svbio dot com).","time":1393690952,"type":"comment"}