{"by":"newfund","id":7324841,"kids":[7330780,7330783],"parent":7324236,"text":"Business Analyst and Associate (San Francisco Preferred)\nIntern (SF Preferred, Remote could be ok for the right candidate)<p>We are a few entrepreneurs&#x2F;investors looking for a hard-working, jack of all trades to help us scale our business operations. We have a seed-stage investment fund, a small hedge fund, and three startups (one consumer internet, one enterprise financial services, and one consumer packaged goods) - you will have the opportunity to work on all of them. Our backgrounds are varied - one former venture capitalist, one hedge fund analyst, one former consultant with a successful startup exit, one lawyer, and one musician&#x2F;startup junkie. We all are friends and started working together in the past year - we have a lot of fun together which makes work a breeze.<p>You should be sales-oriented and results-driven, with a willingness to learn new skills: To varying degrees depending on the role, we need people to write web content, collect customer feedback, research markets, establish partnerships, help investment diligence, and get dirty building models.<p>Like the rest of us on the team, you should be in love with the Internet and everything you can do with it. You should enjoy solving tricky problems and be a great communicator, in person, on the phone and in writing. We&#x27;re looking for a few different roles: one would be a recent college grad who is ready for the startup experience, and another for someone with a couple of years of experience in banking or consulting. We&#x27;re also open to the idea of an intern.<p>The position is full-time and reports directly to two successful serial entrepreneurs. You’ll work from our headquarters in the mission district of San Francisco.<p>Competitive compensation with $$ and equity for the right candidate – probably beginning as a contractor and moving to full time as the business scales. There will also be massive opportunity professional growth as you learn the ins and outs of scaling a startup.<p>If this describes you and the opportunity seems exciting, lets talk! Send an email to thisisanewfund@gmail.com to introduce yourself. We’ll be happy to fill you on the details of our companies and tell you more about the opportunities. Sorry for our stealthness - some of our stuff isn&#x27;t ready for prime time yet!","time":1393691651,"type":"comment"}