{"by":"notmyname","id":7324346,"parent":7324236,"text":"SwiftStack - <a href=\"http://swiftstack.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;swiftstack.com&#x2F;jobs</a> - San Francisco, CA (preferred)<p>Everyone has data, and it&#x27;s always growing. This growth in data means that we need an effective way to store massive amounts of data. OpenStack Swift is designed to effectively store massive amounts of data while providing high durability, high availability, and support massive concurrency across the entire data set. SwiftStack is building management, monitoring, and integration tools to turn the Swift storage engine into an effective storage solution that is used by millions, daily.<p>We&#x27;re looking for engineers of all experience levels to join us. We do most of our work in Python, but we&#x27;ve got some Ruby, Javascript, and a few other things mixed into our stack.<p>So far this year, we&#x27;ve built out global clusters for a major expense reporting and travel support site[1], provided the storage system for Disney Interactive&#x27;s gaming platform[2], and integrated Swift into radical new hard drive technology from Seagate[3]. We&#x27;re currently working with companies like Intel and Box to build support for erasure codes into Swift[4].<p>My vision for OpenStack Swift is that it will be used by everyone, every day, even if they don&#x27;t realize it. Swift is storage that is built for the web and already powers some of the world&#x27;s largest storage clouds. I would like to work with you at SwiftStack to see this vision become a reality.<p>Interested? Send us an email at jobs@swiftstack.com. Send us your github profile, your LinkedIn account, a link to your website – whatever will best display the work that you’ve done. Tell us in a few lines of text why you’re interested in SwiftStack, and why we’ll be interested in you. We’ll be back in touch shortly to get the conversation started.<p>[1] Concur video: <a href=\"http://www.youtube.com/watch?v=qQmGfzewWQw&amp;t=29m23s\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qQmGfzewWQw&amp;t=29m23s</a><p>[2] Disney + SwiftStack: <a href=\"http://venturebeat.com/2013/08/30/how-disney-built-a-giant-cloud-by-bolting-two-together/\" rel=\"nofollow\">http:&#x2F;&#x2F;venturebeat.com&#x2F;2013&#x2F;08&#x2F;30&#x2F;how-disney-built-a-giant-c...</a><p>[3] SwiftStack + Seagate: <a href=\"http://swiftstack.com/blog/2013/10/22/kinetic-for-openstack-swift-with-seagate/\" rel=\"nofollow\">http:&#x2F;&#x2F;swiftstack.com&#x2F;blog&#x2F;2013&#x2F;10&#x2F;22&#x2F;kinetic-for-openstack-...</a><p>[4] Building erasure codes into OpenStack Swift: <a href=\"http://swiftstack.com/blog/2013/07/17/erasure-codes-with-openstack-swift-digging-deeper/\" rel=\"nofollow\">http:&#x2F;&#x2F;swiftstack.com&#x2F;blog&#x2F;2013&#x2F;07&#x2F;17&#x2F;erasure-codes-with-ope...</a>","time":1393685069,"type":"comment"}