{"by":"reas","id":7325548,"parent":7324236,"text":"Q-Centrix - San Diego, CA<p>We&#x27;re a small team looking to grow to about 10 in various roles this year. We need engineers obsessed with test-driven development and who want to build applications that help lower hospital costs and directly improve the quality of patient care.<p>Our challenges include:<p><pre><code>  * Use machine learning to allocate nursing resources to high-risk patients\n  * Coordinate day-to-day work for hundreds of data extraction and nursing staff\n  * Monitor and report on patient care to help hospitals prevent mistakes\n</code></pre>\nWe&#x27;re hiring for all of the following:<p><pre><code>  * A senior engineer and team lead experienced with Rails and TDD\n  * Software engineers comfortable with web frameworks, preferably Rails\n  * A UI&#x2F;UX designer that can juggle multiple projects and create a unifying vision\n  * A DevOps engineer that can effectively administer a HIPAA environment\n  * A data scientist&#x2F;ML specialist with medical informatics exposure for pilot projects\n  * A product manager preferably with experience in healthcare or analytics\n</code></pre>\nOur benefits include:<p><pre><code>  * Generous compensation, insurance, and a 401k plan\n  * Flexible work hours and days, work from home when appropriate\n  * Conference travel and attendance fees at least once per year\n  * Distraction-free office in San Diego focused on cutting-edge product development\n  * Time dedicated to exploring new langauges&#x2F;frameworks and creating open source\n</code></pre>\nInterested?<p>Drop me an email to say &#x27;hi&#x27; if you want to talk more: devjobs@q-centrix.com. Let me know if you&#x27;re currently in San Diego or want to move here. Hope to hear from you soon!<p>About Q-Centrix<p>Formed in 2010, Q-Centrix provides outsourced clinical data abstraction, analysis, and reporting services to hospitals. Q-Centrix is the largest and fastest growing provider of quality related outsourcing services in the nation. A recent partnership with growth-focused private equity firm Sterling Partners gives Q-Centrix the resources and managerial expertise to continue growing at a rapid rate.","time":1393699853,"type":"comment"}