{"by":"capkutay","id":7325363,"parent":7324236,"text":"WebAction (www.webaction.com) in Downtown Palo Alto - Full Time Hiring Front End Web Developers, Platform Engineers, and Application Developers Jobs@WebAction.com<p>WebAction is a company based in the San Francisco Bay Area, providing an end-to-end platform that aims to enable the next generation of real-time, data driven applications. We provide data management solutions for mission critical systems by providing real-time processing power, an intuitive web user interface, and beautiful dashboards.<p>Founded by a team of Silicon Valley veterans with proven track records, WebAction is backed by some of the most respected names in Silicon Valley. We&#x27;re also well funded (recently raised $11m Series B by a private equity firm with a $15 billion fund).<p>We offer a competitive salary, excellent benefits package, generous equity for the right candidates. Our office is also a short walk from some great restaurants and coffee spots on University Avenue in Downtown Palo Alto. We also offer an array of perks and free food at our office.<p>UI Developers: Do you wish you could work on visualizing some of the world&#x27;s most valuable data? Example use cases for WebAction include visualizing cell tower data, revealing cyber security attacks, catching fraud, showing the ins and outs of world&#x27;s largest data centers, and many other problems of that nature. At WebAction, you would have the following responsibilities on UI:<p>- Code user interface components for a real-time big data dashboard<p>- Optimize code for performance and usability<p>- Contribute innovative ideas for new dashboard features<p>- Collaborate with platform engineers to coordinate user interface with back-end functionality<p>Requirements:<p>- Strong knowledge of Javascript, CSS, HTML, and jQuery<p>- Enthusiasm for working in a startup environment<p>- Portfolio of deployed projects<p>Nice to Haves<p>- Experience working with real-time, data-intensive user interfaces<p>- Experience with D3.js or other data visualization libraries<p>- Experience with Backbone.js or other front-end MV* frameworks<p>- User experience and design skills<p>For the Platform Engineering position, we ask that you have experience writing clean code in Java and have a strong desire and skills to implement a scalable, highly optimized data management infrastructure. For those of you interested in scalable, low latency data platforms, WebAction is an opportunity to create one yourself. The following skills are desirable:<p>-Large scale distributed systems<p>-Familiarity with the HStack (Hadoop&#x2F;Zookeeper&#x2F;HBase)<p>-Significant experience or interest in HBase or Cassandra.<p>-Interest in stream processing systems such as Storm or Akka.<p>If you&#x27;re interested, please send us a message at jobs@WebAction.com","time":1393697714,"type":"comment"}