{"by":"danielsamuels","id":7325864,"parent":7324236,"text":"Full-stack Django developer - Onespacemedia - Cambridge, UK - <a href=\"http://www.onespacemedia.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.onespacemedia.com&#x2F;</a><p>If you&#x27;re a web-obsessed Django developer with an eye for design and you want to join a friendly team in central Cambridge we want to talk to you! We&#x27;re looking for a developer who can come onboard and dive right into a wide variety of client projects.<p>Essential skills:  Knowledge of writing clean HTML5, Javascript and CSS3 code which works cross device and cross browser. Experience with working with standard APIs such as Google Maps, Twitter and Facebook. 2+ years of experience using Python and Django along with common packages such as South and Twython. Ability to think logically about data models, relationships and application flows. Eagerness to learn new technologies and improve yourself. Comfortable with Unix based technologies and getting around in a Terminal. In general, you&#x27;ll know about most of the things on the Full Stack Python website.<p>Bonus skills: Previous agency experience. SASS and Compass. Unit testing. Zurb Foundation &#x2F; responsive design.<p>What you can expect to work on: Expect to work on a wide range of challenging projects. We don&#x27;t have a cookie cutter approach to the web and push the design and technical envelope on all our work. Recent projects have included: an application that manages, filters and analyses radio spectrum data from a series of nationally-located nodes; a responsive website for a high-end safari and Africa travel company; a large website and online admin system to manage the ever-changing attractions and events for an interactive science centre; and a website&#x2F;application that tracks, maps and graphs the progress of University spin-out companies. Most of our projects are responsive and we&#x27;re as committed to the front-end user experience as we are to what&#x27;s happening under the hood.<p>How to apply: Please send CV, covering note and links to any websites or applications you have created, or been involved with, to jobs@onespacemedia.com<p>More details here: <a href=\"http://www.onespacemedia.com/careers/full-stack-django-developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.onespacemedia.com&#x2F;careers&#x2F;full-stack-django-devel...</a>","time":1393704224,"type":"comment"}