{"by":"kamens","id":7325282,"kids":[7328112],"parent":7324236,"text":"Khan Academy — Mountain View, CA (we also love interns, and remote is a possibility)<p>We&#x27;re a small, non-profit tech startup trying to give a free, world-class education to anyone, anywhere. We&#x27;re making a big mobile push and need your help.<p>Here&#x27;s a testimonial we received recently:<p>==================================<p>Hi! My name is Chelsie and I&#x27;m a college student. When I was 19 years old I was kicked out of a great university because I had terrible grades. My disappointed parents cut me off financially so I began working night shifts to support myself. The truth is, I had no desire to go to school because learning had always seemed very distant from reality to me. ... Success in school felt like something you either had or you didn&#x27;t, and I had been getting Cs since middle school….I stumbled across [your] videos about math. I HATED math. I watched them anyway. I don&#x27;t know why, but I did. I loved them. I continued watching videos- chemistry, programming, physics. I&#x27;m 24 now, and I&#x27;m in college pursuing a degree in computer engineering. I have straight As. Sal&#x27;s videos made me feel like I had the capacity for understanding math and science even though my parents never sent me to space camp and I never won a ribbon at a science fair in elementary school...<p>==================================<p>Every month we get hundreds of letters like this from people in all walks of life who&#x27;re thankful for free, high-quality educational content.<p>Most of you reading this are familiar with Sal&#x27;s videos, but we also have hundreds of videos by other teachers, partnerships with organizations like MoMA and the California Academy of Sciences, and a huge library of interactive exercises. Over 20 million math problems are done every week on our site.<p>And now we&#x27;re doing a big mobile push. Around 20% of our traffic comes from phones and tablets. We&#x27;re totally overhauling our iOS app.<p>If you join us now, you can be a core developer on an app that is guaranteed to have millions of users. We have loads of high-quality educational content just waiting to be shared within a great product. We have partnerships lined up around the block to promote your work. We just need you.<p>You&#x27;ll be part of a small team working alongside both &quot;celebrity&quot; devs (like jQuery creator John Resig and Google&#x27;s first employee Craig Silverstein) and many more of us normal folk ;) you haven&#x27;t heard of but who are workin&#x27; hard to help education.<p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> and be sure to mention that you&#x27;re coming from HN. Feel free to email me at ben+HN@khanacademy.org w&#x2F; random questions.","time":1393696757,"type":"comment"}