{"by":"stanshch","id":7336351,"parent":7324236,"text":"Axial - New York City<p>About Axial:<p>Axial is a platform that connects entrepreneurs outside of the startup economy with capital and trusted advice.  This market is much larger than the startup world and dramatically less well-served.  The software we build enables entrepreneurs worldwide to connect with the capital and specialized advice they need to grow, finance or sell their business.<p>The Axial Corps:<p>The Engineering team at Axial is referred to internally as “The Corps”.  We are a team of 10 engineers dedicated to achieving excellence in every aspect and level of our system, from our automated build system to Axiom (our test framework), from our Python data-services to our increasingly modular front-ends.  We aspire to build outstanding high performance software, so we focus on one thing at a time, one area at a time, one day at a time.<p>Our slogan is “Factum non Verbum”, “Actions not Words”:<p>Predictability, simplicity and flexibility are our guide<p>We aspire to (and usually do) ship improvements to our product every day<p>We change our minds when we’re proven wrong<p>We&#x27;re actively hiring for two main roles right now:<p>Front-End Engineer<p>Front-End Engineers at Axial build modular and responsive user-interfaces using jQuery and Backbone.js. You operate within self-sufficient cells alongside Product Managers, Designers and Python Engineers who are specifying, designing and build data-services for your interfaces.<p>The Problems You’ll Solve:<p>Engineers at Axial solve difficult technical problems so our members don’t have to. Some of our biggest technical challenges right now are:<p>Modernize. Our members expect Axial to work equally well on their desktop, tablet and mobile devices. We obsess over our members, and we’re committed to modernizing our platform to meet and exceed the demands of our members.<p>Modularize. We want our interface to be modular, and highly re-usable.  We believe that the CSS, JavaScript and templates for each module should be compartmentalized so that loading any component will never interfere with loading another component.<p>Go SOA. We believe our data is our business, and we believe that modular interfaces making use of decoupled data services give us the maximum flexibility and utility.<p>We look for technologists who:<p>- Are expert at working with JavaScript, HTML, and CSS<p>- Are intimately familiar with browser quirks<p>- Love creating well-crafted interfaces and elegant web UI’s<p>- Communicate and collaborate well<p>Bonus points for:<p>- Bootstrap, jQuery, or Django<p>- Experience developing in <i>NIX environments<p>- Experience with a non-JavaScript programming language \n(python, php, ruby, perl, sh)<p>Python Engineer<p>As a Python Engineer at Axial, you will build data-service backends using the Flask and Django web-application frameworks. You will work on the same team as Product Managers, Designers and Front-End Engineers who specify, design and build products and widgets that consume your data-services.<p>Axial’s mission is to enable every private company to access the capital needed to finance or exit their business.  Your software will connect entrepreneurs, investors, brokers and business advisors, driving the largest network of private investors in the world.<p>The Problems You’ll Solve:<p>As an engineer at Axial, you will solve difficult technical problems so our Members don’t have to. Some of our biggest technical challenges right now are:<p>Search. Search connects entrepreneurs, and their advisors with capital and services.  By constantly improving search, we help our Members:\n - secure the capital needed to finance or sell their business\n - connect and build relationships\n - constantly improve relevancy<p>Shared Authorization Framework.  We serve both small businesses and large companies. If you’ve ever wanted to build a licensing management system that manages user, group and feature access required to support the disparate needs of smallest and largest companies in the world, we’re your destination.<p>Go SOA.  We believe our data is our business, and we believe that decoupled data-services give us the maximum flexibility and utility in accessing our data.<p>You’re an ideal candidate if you ...<p>- communicate and collaborate well\n- are a seasoned python expert\n- have designed and implemented distributed HTTP data services\n- have extensive SQL experience\n- have worked with git\n- are experienced working with and managing a </i>NIX system\n- love flat, repeatable data structures<p>If you&#x27;d like to learn more email stan@axial.net.","time":1393879821,"type":"comment"}