{"by":"unobliged","id":7336526,"parent":7324236,"text":"Plyfe (www.plyfe.com) - NYC<p>We are looking for a Senior Software Engineer to join our NYC-based team. Plyfe works with Fortune 500 brands to help them reach their audiences across web, social and mobile. You will be joining the company as a core team member and as a lead developer with great growth opportunities. This is a full-time position based in our office on the lower east side.<p>We are building a platform to facilitate the creation and deployment of interactive media ad units. Our widgets are embedded across a brand’s digital properties (corporate sites, Facebook, Twitter, etc.). The widgets support interactive content including mini-games, social media actions, polls, and more. User interaction data powers analytics and reporting.<p>Role:\nYour role is to work with the CTO and engineering team to help build our core technologies and expand our platform’s product offerings and reporting capabilities. An ideal candidate will contribute to all aspects of the development process: analysis, design, full-stack implementation, QA, and DevOps.<p>Requirements:\nOur core technology stack is a Rails-backed API with a suite of Ember.js applications and some legacy Backbone.js, all continuously deployed to AWS-infrastructure (EC2, MySQL-RDS, Elasticache, ELB, OpsWorks). A collaborative, test-driven, agile development process facilitated by GitHub and Asana is central to our workflow, with frequent code-reviews and pairing sessions.<p>You should be extremely comfortable working with both Rails and Javascript frontend frameworks. A solid understanding of the various ‘fundamentals’ of web applications (databases, relational design, remote server administration, command-line scripting) is a must. Our preference is for candidates that are comfortable with learning, experimenting, and collaborating with new technology.<p>Some experience with social media APIs (e.g. Facebook, Twitter) and&#x2F;or AWS services would be good, but not necessary.<p>If you can show us code samples and talk us through what you’ve worked on (feel free to bring a laptop), we’d be happy to have you over. Remote candidates are also welcome to apply provided they can commit to availability during our office hours (10am-6pm EST). An overarching focus on robust, testable, quality code is our top priority.<p>Compensation and Perks:\nSalary commensurate with experience + benefits (medical, dental, vision) + equity. We are offering a stress-free, friendly work environment with great work&#x2F;life balance. Perks include open vacation policy, flexibility to work from home, equipment budget, office food &amp; beverages, and more.","time":1393881253,"type":"comment"}