{"by":"jasonchen913","id":7337337,"parent":7324236,"text":"MongoDB - (New York, Texas, DC, and Hong Kong)<p>We are always looking for great talent. Below are some of the many roles we have open. If you think you fit the bill, i&#x27;d love to chat @ careers@mongodb.com<p>---<p>Technical Support Engineer,Community (I am open to better names (:) Location: New York, NY\nThis team specializes working with the most important people - our community. We are looking for tech savy individual who enjoys working on open source projects and interacting with the community.<p>---<p>Solutions Architect (Technical Pre-sales Engineer&#x2F;consultant) Location: Austin, TX &#x2F; Hong Kong\nSA&#x27;s are responsible for guiding our customers and users to design and build reliable, scalable systems using MongoDB. The Solutions Architecture team at MongoDB is made up of seasoned software architects, entrepreneurs and developers who take direct responsibility for customer success, including the design of their software, deployment and operations. A development&#x2F;distributed systems background is required.<p>---<p>*Consulting Engineer (Field&#x2F;implementation&#x2F;post-sale Engineers) Location: New York, NY &#x2F; Washington D.C. (Clearance is required)\nAs a technical consultant, you&#x27;ll be MongoDB&#x27;s ambassador to our clients and other MongoDB users. You&#x27;ll deliver advisory consulting to and lead comprehensive training sessions with MongoDB&#x27;s clients, helping them solve mission-critical challenges in areas as varied as schema design, performance optimization (both in a database and in an application), software architecture, production operations. A development&#x2F;distributed systems background is required.<p>---<p>Technical Services Engineer: Location: New York,NY &#x2F; Palo Alto,CA &#x2F; Austin, TX &#x2F; Sydney, AU\nTeam members will apply strong problem solving skills and will acquire a broad understanding of our products as well as a wide range of innovative customer applications and environments, from Foursquare to CERN to Metlife and everywhere in-between. At the end of the day, you’ll be able to look at these groundbreaking applications and say that you had a hand in making them happen. If you have a strong Dev, Ops, or DevOps background, you might be a great fit!<p>---","time":1393889100,"type":"comment"}