{"by":"justkez","id":7339174,"parent":7324236,"text":"<i>Technology All Rounder, Harris + Hoole, London, UK - Full Time.</i><p>We’re on the hunt for a Technology Guru to join our fantastic team at Hooligan House. This is a full time role based in our HQ at Barbican.<p>### About Us<p>Harris + Hoole is a family affair - from our roots making artisan coffee on the back streets of London, we’re using all our coffee know-how to bring a whole new coffee experience to high streets in the UK. We’re all about good coffee and happy people. We reckon if we get these things right, everything else will look after itself.<p>### Your Responsibilities<p>With 30 shops to date, we&#x27;re growing fast and need a talented Technology Guru to help us implement key initiatives:<p><pre><code>  - Own IT support for HQ, helping our teams get the most out of technology\n  - Manage external partners to ensure our technology projects are successful\n  - Develop highly efficient business as usual processes for supporting internal customers and ensuring IT is never a pain point for H+H\n  - Ensure all of our new shops open with a perfect tech track record and all the moving parts are talking to each other\n  - Identify business development opportunities where technology can make a difference\n</code></pre>\n### What We’re Looking For<p>For this role to bring out the very best you’ve got, you’ll have a special blend of the following \nthings:<p><pre><code>  - 1-3 years experience working in technology&#x2F;IT\n  - Confident self starter who is able to take the initiative and work autonomously from conception to completion\n  - Multi-tasker that can successfully handle a variety of projects simultaneously\n  - Friendly demeanour and strong ability to communicate technical concepts to a non-technical audience\n  - Comfortable with concepts like ETL for handling raw files, MDM for managing all our iPads and SQL to extract meaning from structured data\n  - Well-versed in process automation, basic security concepts, API design and making different systems talk to each other. You’ll try and automate anything you do more than once\n  - Excited to join an innovative start-up and get stuck in to our entrepreneurial culture\n</code></pre>\nIf you think this could be the role for you then please send your CV and cover letter to our Technology Manager, via techjobs@harrisandhoole.co.uk","time":1393923642,"type":"comment"}