{"by":"dcheng1029","id":7358560,"parent":7324236,"text":"GAME CLOSURE ENGINEER<p>Brief Description<p>We are looking for stellar software engineers to architect and build features for our core SDK (and more). Whether you&#x27;re a generalist or specialist -- we welcome both -- as long as you enjoy the challenges that come with building a next-gen gaming platform, this role will be perfect for you.<p>Description<p>Game Closure is looking for great engineers to help us build the world&#x27;s best mobile game engine. We are 25-strong and growing (carefully). If you want to join a great team, develop cutting-edge technology and have an impact, then we want to talk to you.<p>ABOUT GAME CLOSURE<p>Game Closure is democratizing mobile game development using HTML5, allowing developers to build a game once and launch seamlessly on a variety of mobile platforms (iOS, Android, etc.).<p>We write cross-compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js &amp; Python back-ends, JavaScript game APIs, and whatever else it takes. As an engineer at Game Closure, you will work with these technologies to build core features of our product. You will work with the best engineers in the world -- we have top talent in every part of our stack, from server architecture to browser optimization to Android internals -- on the hardest problems in mobile and social gaming.<p>A few other tidbits:\n- Backed by top-tier investors, including Highland, Benchmark and Greylock.\n- Located in Mountain View, right off Caltrain and in the heart of the Castro Street restaurant corridor.\n- We offer truly meaningful equity -- we want you to feel like a partner in our business and share in its success -- and competitive pay and full benefits<p>Some press clippings:\n- Techcrunch: <a href=\"http://tcrn.ch/XTR9ir\" rel=\"nofollow\">http:&#x2F;&#x2F;tcrn.ch&#x2F;XTR9ir</a>\n- VentureBeat: <a href=\"http://bit.ly/TszL2o\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;TszL2o</a><p>WHAT WE&#x27;RE LOOKING FOR &#x2F;&#x2F; WHAT YOU&#x27;LL DO<p>We are looking for stellar software engineers to architect and build features for our core SDK (and more). Whether you&#x27;re a generalist or specialist -- we welcome both -- as long as you enjoy the challenges the come with building a next-gen gaming platform, this role will be perfect for you. We&#x27;re at the size where we can still fit the role around the individual and their interests (rather than the other way around).<p>WHAT WE OFFER<p>In addition to a great work environment and solid compensation and benefits, Game Closure offers:<p>- Ownership: We&#x27;re a small team, and we empower our people to pursue novel approaches.\n- Challenge(s): What we&#x27;re doing isn&#x27;t easy. We&#x27;re working every day to solve the hardest problems in mobile game development.\n- Skills: There&#x27;s zero stagnation here. We use the latest tools and technologies every day. You can touch all parts of the stack and see your influence on real, shipping products\n- Creative input: Ideas are valued from all corners of Game Closure, and we work fast -- that idea can go from concept to live in short order.\n- Community. Closures hang together. We take care of our people and believe it makes us stronger as a company. We enjoy working together and relaxing together.<p>TO APPLY<p>We&#x27;d love to hear from you. To apply for this position, click &quot;Apply&quot; below and you&#x27;re off to the races. <i></i> There is no &#x27;black hole&#x27; here. We reply to everyone.<i></i> Thanks!","time":1394167899,"type":"comment"}