{"by":"jarvinen","id":7361576,"parent":7324236,"text":"Newton, MA (Metro Boston) Full-time \nDATA SCIENCE AND VISUALIZATION FOR PUBLIC INTEREST SCIENCE ORG<p>Mission Statement: Help Silent Spring Institute make our science intelligible to everyone through interactive web and mobile applications.<p>Details:\nWe’re looking for a developer to lead our efforts to communicate our findings.<p>We’re relentlessly asking tough questions about the chemicals that are increasingly a part of the products we buy -- see <a href=\"http://bit.ly/RIcdra\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;RIcdra</a>, <a href=\"http://nyti.ms/U8YrxF\" rel=\"nofollow\">http:&#x2F;&#x2F;nyti.ms&#x2F;U8YrxF</a>. You’ll be there with us, helping us communicate our findings to make healthier homes, more informed consumers, and cleaner communities.  This means data wrangling, automated reporting, and interactive visualization using web-based technologies (and eventually mobile). You would initially work on some of our ongoing projects, but will contribute to the development of new projects in the future.<p>For one of our scientific studies, we took readings of chemical levels in people’s environments and their bodies. For your first project, you’ll help us turn numbers into messages that the people themselves can understand in an interactive, web-based visualization.<p>Additional opportunities include working with R or ArcGIS (and learning them if you don’t already know them) to finish development of an R package for environmental health data, creating computational systems to assess privacy risks in environmental health data, and leading further development of our MassHEIS site. You could also contribute to the ongoing development of a mobile app to help people make informed decisions about reducing toxics in their homes.<p>You\n•\tweb app development. You can implement a design using web technologies (CSS, HTML, and Javascript), ideally both desktop and mobile.\n•\tdata visualization. You can make intelligible custom graphs and charts, using tools like d3.\n•\tclient and server: You know or are learning your technology options (Rails, Django, node.js, PHP, etc., Bootstrap, Stylus, Backbone, etc.), and can make informed decisions.\n•\tdata management and statistical analyses: Ideally, you’ll be familiar with R or a similar tool, or be willing to learn.\n•\texperience with interaction design is a definite plus.\n•\tgood software engineering habits: source control, testing, reusability, documentation, etc.<p>You’ll need to be able to work with diverse technical and non-technical colleagues. As the primary software person on our team, you’ll need to demonstrate considerable autonomy and versatility.<p>More about us\nOur 16-person multi-disciplinary team includes expertise in toxicology, exposure science, epidemiology, and community-based participatory research.  We collaborate with computer scientists and other scientists at Harvard, UC Berkeley, US Centers for Disease Control and elsewhere.  We publish in peer-reviewed journals and are often in the news (<a href=\"http://bit.ly/RIcdra,http://nyti.ms/U8YrxF\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;RIcdra,http:&#x2F;&#x2F;nyti.ms&#x2F;U8YrxF</a>).  We are celebrating our 20th anniversary year!<p>Compensation:  This is a full time position.  We offer competitive salaries, 4 weeks vacation to start plus holidays, health insurance, and other benefits.<p>To apply: Send a cover letter and resume to careers@silentspring.org. If you don’t have significant work experience yet, please also include a copy of your academic transcript (photocopy is fine).<p>Silent Spring Institute is a non-profit research organization dedicated to identifying—and changing—the links between environmental chemicals and women’s health. We work with collaborating investigators at Harvard, UC Berkeley, CDC etc., and activists at Massachusetts Breast Cancer Coalition and nationally. Research focuses on breast cancer and environmental pollutants, especially endocrine disrupting compounds and animal mammary gland carcinogens, and path-breaking studies of household exposures. This is an opportunity to be part of a nationally recognized, innovative, mission-driven team. www.silentspring.org","time":1394214133,"type":"comment"}