{"by":"dwillrett","id":7389830,"parent":7324236,"text":"Full-Time Senior Application Developer<p>The Department of Radiology at the Stanford University School of Medicine is seeking candidates for a full-time Senior Application Developer.  This role is responsible for the support of Web-based Java applications, including development, testing, and deployment of front-end interfaces and backend databases.<p>The Senior Application Developer will assume a leadership role in a large NIH-funded project to create open-source Web-based and desktop software to annotate, store, search, and process biomedical images. This exciting work will enable researchers to discover image-based indicators of disease that will transform medical care. The software developed will become part of a national infrastructure supporting biomedical research, and will have high impact throughout the medical community. The Senior Application Developer will be responsible for designing, developing and documenting the software, working with collaborators and users to understand and implement their requirements, and evaluating and disseminating the software. The successful candidate will be self-directed, thrive in a stimulating collaborative research environment, work well with other developers, and be excited by the opportunity to assume an ownership role in creating software infrastructure that will be adopted by medical centers nationally. The candidate will work closely with faculty, research associates, students, developers, and other collaborators.<p>Required Skills:\n•\tB.S. in Computer Science (or related degree), or equivalent experience\n•\tExpert skill level (5+ years) Java programmer\n•\tExpert skill level (5+ years) server-side Java web development\n•\tStrong experience developing RESTful web services\n•\tJDBC, MySQL \n•\tTomcat Application Server, Jetty, Apache Web frameworks Linux, virtual machine management (e.g., VMware)<p>Preferred Skills:\n•\tAdvanced degree in Computer Science is desired\n•\tExperience with DICOM programming, DICOM databases, and dcm4chee \n•\tXML Parsers, Native XML databases\n•\tExperience with rich Web application development, such as Google Web Toolkit (GWT)\n•\tHTML5 technologies including Canvas and WebGL\n•\tJavaScript and Ajax Libraries (jQuery and Closure)\n•\tExperience in image processing and programming with DICOM\n•\tExperience with test platforms such as Selenium and Jenkins","time":1394679305,"type":"comment"}