{"by":"BenjaminDyer","id":7398185,"kids":[7398217],"parent":7324236,"text":"Powered Now - REMOTE (possibly) - UK - Marketing Engagement Specialist, aka Growth Hacker, aka Digital Marketing Expert<p>Where: UK South Coast, working from home (office to open within 12 months)\nSalary: Great salary DOE with bonus linked to MRR targets\nBenefits: Share options (subject to shareholder approval)<p>Well funded startup run by experienced entrepreneurs with a brilliant technical team seeks someone special to lead the digital marketing side of our business. The right person will be a digital marketing expert with a background in online products and services, there are extra points if you’ve worked in mobile.<p>Your immediate goal is to find a repeatable process to capture early adopters. Therefore, we need someone who can experiment with various strategies to find one that works.<p>The short-term objectives for this role are to:<p>- Draw up a plan of ideas (brain-stormed with the founders) to test, building on what has already been achieved.\n- Test those ideas, measure their success and report back.<p>At the end of this period:<p>- You should have a clear understanding of what strategies work and where you should focus efforts to grow the user base\n- Demonstrable growth in the subscriber base, for this we will reward you with a bonus linked to MRR.<p>In the long-term you will be immersed in our customer lifecycle, from acquisition to retention, so that you can serve as a subject matter expert and implement initiatives to reduce friction. This means you will be working with teams across the company on initiatives that deliver value to our users early and often.<p>You’ll like this job if you are (aka essential skills):<p>- Analytically focused.\n- Methodical, consistent and diligent at recording all experiments. You won’t get bored and stop recording the results!\n- Smart enough to spot trends.\n- Into digital marketing and advertising.\n- Like working with smart people in a fast paced environment.\n- Happy to work remotely (although we are planning opening an office in the coming months) and capable at managing your own workload.\n- You can work within a budget.\n- Know how to use Google Analytics.\n- Like occasional travel to exotic European destinations.<p>Extra points awarded for:<p>- SaaS or Mobile products background.\n- Knowing additional analytical products like Mixpanel, Kissmetrics\n- Living on the South Coast of England, although if you are the right person we can be flexible.\n- Creative, comfortable when writing website copy and designing landing pages for campaigns (we use Wordpress).\n- Any qualifications to do with SEO or PPC (Google adword certification would be exceptional).\n- Startup mentality, we all have to ‘muck in’ from time to time.","time":1394798261,"type":"comment"}