{"by":"vldr","id":13765158,"parent":13764728,"text":"GUTS Tickets | Junior .. Senior Full stack developer | Amsterdam, The Netherlands | (partial) Onsite €35k-€70k p.a. depending on experience, part-time&#x2F;full-time, equitiy plan available<p>Are you a developer who loves live music? And do you want to join the ticket revolution? At GUTS we’re not only building a product, but as a team we chasing a common goal: Stop disgraceful secondary ticket prices and ticket fraud. We don’t work to punch out a time card, we work hard to give fans what they deserve. GUTS is a ticketing system which uses blockchain technology to register ownership of SMART-tickets. GUTS makes ticket fraud impossible. The ticket can only be (re)sold at a fixed price, so no more disgraceful prices for secondary tickets.<p>GUTS Tickets is hiring frontend and backend junior &#x2F; senior developers! We have about 2 to 3 positions to fill depending on experience and flexibility of the developers.<p>Our current stack consists of<p>- Python 3.5 &#x2F; Django &#x2F; Django Request Framework - Ethereum &#x2F; solidity &#x2F; blockchain technology<p>- EmberJS (2.10)<p>- react native<p>To expand our team we&#x27;re hiring for different roles:<p>- junior .. senior backend developer. Experience with Python, Django, DRF is preferred, experience with ethereum would be nice<p>- junior .. senior frontend developer. Experience with EmberJS (&gt;2.3) is preferred<p>- react-native developer<p>Of course full stack frontend&#x2F;backend&#x2F;mobile developers that have experience with a mix of the above technologies are also very welcome to apply<p>We&#x27;re located in the center of Amsterdam (Leidseplein). We prefer people who can occassionally be onsite so full remote working is not an option right now. We also cannot provide visa&#x27;s or relocation services at this time.<p>If you&#x27;re interested in working with us, please send your CV to jobs@guts.tickets<p><a href=\"https:&#x2F;&#x2F;guts.tickets&#x2F;we-are-hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;guts.tickets&#x2F;we-are-hiring</a>","time":1488386065,"type":"comment"}