{"by":"StefanWallin","id":13766438,"parent":13764728,"text":"MittMedia | Software Developer | Sundsvall, Sweden | ONSITE <a href=\"https:&#x2F;&#x2F;translate.google.com&#x2F;translate?hl=sv&amp;sl=sv&amp;tl=en&amp;u=http%3A%2F%2Fdev.mittmedia.se%2Fjobb\" rel=\"nofollow\">https:&#x2F;&#x2F;translate.google.com&#x2F;translate?hl=sv&amp;sl=sv&amp;tl=en&amp;u=h...</a><p>== WHAT WE DO ===<p>Main stack: Ruby on Rails, React&#x2F;React Native, PostgreSQL<p>Data platform: Java, TitanDB w. Cassandra<p>We do innovative web, app &amp; big data development on local news media in central Sweden. We are the biggest local media organization in Sweden and reach 1.9M unique browsers per week. Sweden has a 10M population.<p>== HOW WE DO IT ==<p>As part of our hiring process we do pair or mob programming after initial screening depending on what the recruit feels comfortable with.<p>We do development with User Experience in focus and have a large and strong UX Team that drives a lot of our development.<p>Sweden has great social benefits, including health care, sick leave, 25 days paid vacation(33 from us), 480 days parental leave per kid. Language training is free from the government if wanted.<p>I personally work in our app team. We&#x27;re energetically looking for Front End developers.<p>== CULTURE ==<p>We pride ourselves in being inclusive. We focus on an open and constructive dialogue and have people from the Netherlands, China and Germany. We strive to achieve different backgrounds, genders and cultures as we believe different perspectives are key to a successful business. We have non-Swedish speakers on the teams and are moving to using English as our main language.<p>The organization employs 1500 people but in the development organization we are 28 people with a direct connection to the company board. The board places an incredibly high trust in our department and we help form the board strategies.<p>== APPLY ==<p>Via email to my boss at:\nmathias.nylen mittmedia.se","time":1488391652,"type":"comment"}