{"by":"davemel37","id":13766368,"parent":13764728,"text":"Tenfold Traffic | Search Engine Marketer| Denver | <a href=\"http:&#x2F;&#x2F;www.tenfoldtraffic.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tenfoldtraffic.com</a> - <a href=\"http:&#x2F;&#x2F;www.davidmelamed.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.davidmelamed.com</a><p>Tenfold Traffic is a rapidly growing Digital Marketing Consultancy looking to scale into a full blown agency.<p>The business is currently a One person consultancy, leaning on 3 contractors to help service the accounts. We focus on Search, Native &amp; Paid Social and offer some SEO and ABM.\nI am looking to make my first full-time hire and bring most of the outsourced work in-house.<p>The role requires a strong handle on SEM and Google Shopping best practices, with clarity about how to think about account structures and a unquenchable thirst for knowledge, experimentation and pushing the limits.<p>Initially, the role will require account management, client communication, report creation and account build outs, restructures and optimization.<p>I need someone very well rounded for this initial hire, but hope to build a team around and under them, so the role will become more defined and focused over time.<p>I need someone who excels at asking the right questions of clients to help develop a truly unique strategy for them.<p>Our main differentiator is deep targeting strategy. We consistently hear from our clients that they never heard ideas like ours from the other agencies they speak to. This is core to our offering. A deeper, more meaningful understanding of the clients, their goals, and their internal decision making processes and mapping that to the channels we are using to deliver a strategy that truly moves the specific needle that needs moving.<p>Must haves:<p><pre><code>  • A clear understanding of all the available levers within Adwords and AdCenter.\n\n  • Clear understanding of Google Shopping strategy, ideally with experience segmenting campaigns by search query intent.\n\n  • Semi-Technical - Know enough to troubleshoot tracking problems, manipulate an XML data feed, tweak css, tweak adwords scripts (javascript, etc... The more technical the better, but a bare minimum of being able to google an issue and troubleshoot it on your own if necessary. \n\n  • Experience with Excel - Specifically, Index Match, Pivot Tables, Vlookups, etc... A HUGE plus is someone with VBA experience,and using tools like Supermetrics in Excel. \n\n  • Some knowledge of statistics is important. \n\n  • Experience using Google Analytics, setting up custom reports, and building many different audience segments for retargeting. \n\n  • Experience using Unbounce is important.\n\n  • The ability to tell a compelling story from data. \n\n  • Strong communication skills.\n</code></pre>\nEmail david@davidmelamed and let’s chat!","time":1488391275,"type":"comment"}