{"by":"arshneet","id":13767574,"parent":13764728,"text":"Amazon Web Services | Senior Software Engineer; Senior Software Engineer in Machine Learning | Vancouver, Canada; Seattle, WA | Full-time | ONSITE, VISA |<p>RDS is looking for a Senior Software Engineer to join our team working on AWS scale big-data analytics problems. RDS Performance Insights team is working on a new and as yet unreleased service which will reshape the way that customers use databases and redefine industry expectations of what a modern, enterprise grade cloud-native database provides. Leveraging a number of AWS services including Kinesis and EMR&#x2F;Spark, our mandate is to provide actionable insights into underlying database performance and push the boundaries of product and technology innovation in this area. As the only big-data, analytics and ML focused team in RDS, our greenfield project is worked on by a tight knit devops team, owned, and operated entirely from the new Amazon office here in Vancouver, Canada. If you’re a snowbird in the winter, love long summers and beaches, and want to work on a very engaging, highly impactful product with extremely high customer demand, endless learning and collaboration in a world-class group then get in touch!<p>- Lead the design, build and operations of our application stacks<p>- Ability to influence adoption of capabilities built by the team to AWS teams outside of RDS<p>- Continuously discover, evaluate, and implement new technologies to maximize development and operational efficiencies<p>– Have a scope of influence in development practices, methods and approaches across the team and RDS organization<p>Requirements:<p>- Comp Sci, Engineering, Stats&#x2F;Mathematics BA&#x2F;MA&#x2F;PhD<p>- 8-10+ years professional experience in software development<p>- Experienced technical leader, excellent communication skills. Recruitment, coaching and mentoring of other engineers.<p>- Ability to independently define and execute against a technical vision and roadmap<p>– Strong will to adhere to best practices in OO development and a need to leave well–structured code in your tracks<p>For more information and to apply:<p><a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;392408\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;392408</a><p>Please feel free to directly contact me (I&#x27;m an engineer on the team) [MyHNUsername][AT]amazon.com, or my manager pimmel[AT]amazon.com for any questions that you might have.","time":1488397798,"type":"comment"}