{"by":"gregwebs","id":13769150,"kids":[13817360],"parent":13764728,"text":"Karius | Software Engineer or Analyst | Redwood City, CA | ONSITE, Full-time www.kariusdx.com<p>Karius has taken the genomic sequencing revolution (NGS) out of the lab. We help save the life of difficult to diagnose patients and improve the medical care of those stricken by infectious disease.\nTraditional testing approaches rely on an array of hypothesis-driven specific tests. We directly sequence the pathogen DNA to determine what a patient is infected with. There is a lot of excitement about this technology, you can see our CEO give an overview of our technology at a panel discussion at a recent conference here: <a href=\"https:&#x2F;&#x2F;vimeo.com&#x2F;203982777#t=30m47s\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;203982777#t=30m47s</a><p>I am a software engineer without a biotech background. I really appreciate working with a team with diverse backgrounds and having the opportunity to learn many new things and work towards solving difficult problems. Its nice that Karius is still a startup where you can make significant contributions and broaden your understanding of different areas.\nThere is a great vibe at Karius: people are happy to come to be at work, there is a lot of maturity, and everyone seems to bring their own special talents into the mix. We have company retreats twice a year and we care about making it possible for everyone to experience joy at work.<p>We are greatly expanding our engineering team this year.<p>• Bioinformatics Pipeline: Bioinformatics experience not required if you are an eager learner. Experience or desire to work with a strongly-typed language. We are moving from Python (with MyPy) to Rust.<p>• Front-End: TypeScript, React, CSS, a desire to work iteratively with those outside of engineering<p>• Dev-Ops: Bring a desire to lead devops and bring excellence there while branching out into infrastructure and automation<p>• Infrastructure: Build the infrastructure that powers our analytical pipeline and our data discovery.<p>• Backend Web Services: Help build us a new LIMS (labratory management information system). We use REST APIs documented with swagger.<p>• Data discovery: build the platform that you can use to bring out insights from our data<p>We are also hiring for our analytics team to do bioinformatics analysis.<p>jobs at kariusdx.com","time":1488407124,"type":"comment"}