{"by":"chillydawg","id":13765138,"parent":13764728,"text":"Longshot Systems | Machine Learning &amp; Sysadmin roles | Marylebone London UK | ONSITE | Full time | £50k-£70k<p>At Longshot Systems Ltd we&#x27;re a small startup building advanced platforms for sports betting analytics and trading. Having developed a lot of our core platform infrastructure we are looking to begin expanding our trading strategy research activity and core infrastructure management. We have an office dog, Minos. He&#x27;s a beagle and rather cheeky. We can send you a pic if you need it to help in your decision making process.<p>We&#x27;ve got two openings right now:<p>Senior Machine Learning Researcher, £50-70k<p>You&#x27;d be working closely with the CEO to design, test and implement new high frequency sports betting strategies based on machine learning models for our clients. Due to us being a small startup the role suits someone who wants to be involved in all aspects of the R&amp;D process, from high-level design through to production implementation. The ideal candidate will be highly creative and enjoy generating new, innovate ways to tackle problems and suggesting improvements to existing methodologies; you&#x27;ll have a high level of autonomy to research whichever methods you felt would be best suited to the problem at hand.<p>---<p>Senior Systems Administrator, £50-70k<p>You&#x27;d be working closely with the CTO and the development team to support our production &amp; development trading infrastructure, develop new infrastructure and detect, diagnose and help solve performance issues in applications, networks and operating systems. You should be happy wading through tonnes of metrics, packet dumps and logs to find and solve issues. This role combines SRE, sysadmin and devops. We&#x27;re a small team (6 currently) and you&#x27;d be responsible for the entire production and devlopment infrastructure.<p>Unfortunately we can&#x27;t support visa applications at this time. To learn more about the roles and to apply please visit <a href=\"https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;</a> or email jobs at longshotsystems dot co dot uk","time":1488385941,"type":"comment"}