{"by":"kevinherron","id":13764827,"parent":13764728,"text":"Inductive Automation | <a href=\"https:&#x2F;&#x2F;www.inductiveautomation.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.inductiveautomation.com</a> | Software Engineer | Folsom, CA<p>Come help develop the future of software used in industrial automation. In this position, you would join our core product development team. Together, we work to build our primary product, Ignition.<p>This position is focused on implementing and maintaining network protocols for communicating with industrial controllers (PLCs, RTUs, etc…) as well as the system responsible for bridging data from those implementations into the Ignition platform. Responsibilities include new feature and protocol development as well as the maintenance and enhancement of existing functionality.<p>We are a tight-knit team of developers working every day to delight customers worldwide with a product they actually need. If this sounds like something you’d like to be part of we look forward to talking to you.<p>Requirements<p>- B.S. in Computer Science, or equivalent experience<p>- Minimum 5 years of programming experience<p>- Strong Java 8 skills<p>- Experience writing server and networking code<p>- Experience writing highly concurrent multithreaded code<p>- Modern toolchain and source control familiarity, e.g. Maven&#x2F;Gradle and Git&#x2F;Hg<p>Skills Not Required, But a Plus<p>- Experience with OPC Classic or OPC UA<p>- Experience with industrial automation fieldbuses or protocols such as Modbus, EtherNet&#x2F;IP, Omron FINS, Siemens S7, Emerson&#x2F;Fisher ROC, ABB Totalflow (DB&#x2F;DB2), etc<p>- Experience with PLCs and&#x2F;or PLC programming<p>- Any other relevant experience in industrial automation<p><a href=\"https:&#x2F;&#x2F;inductiveautomation.com&#x2F;about&#x2F;careers&#x2F;senior-software-engineer-backend\" rel=\"nofollow\">https:&#x2F;&#x2F;inductiveautomation.com&#x2F;about&#x2F;careers&#x2F;senior-softwar...</a><p>You can also contact me at my email address in my profile.","time":1488384461,"type":"comment"}