{"by":"Perefin","id":13769040,"kids":[13860611,13815190],"parent":13764728,"text":"IBM Watson Developer Labs + AR&#x2F;VR Labs (www.ibm.com) | San Francisco, CA | Product Manager (ONSITE)<p>For full job description go to  <a href=\"http:&#x2F;&#x2F;www-03.ibm.com&#x2F;employment&#x2F;us&#x2F;index.shtml\" rel=\"nofollow\">http:&#x2F;&#x2F;www-03.ibm.com&#x2F;employment&#x2F;us&#x2F;index.shtml</a> and look up for req : 83961BR<p>I&#x27;m staffing up a new team and need motivated, scrappy, creative folks who can think strategically, love shipping quality products that solve real problems for developers and have a strong outcomes-oriented interest in AI, ML, Chatbots, Developer Marketplaces and&#x2F;or AR&#x2F;VR. Below is some of the Job Description:<p>Something big is happening at IBM. We’re building an entire organization for developers, by developers, and we need passionate Product Management professionals with a strong interest in solving real developer problems in order to be successful. Watson Developer Labs is a new team within this organization built for the threefold purposes of 1. Strategically creating the next generation of IBM products, platforms &amp; experiences developers love, 2. Enhancing the simplicity and usefulness of existing Watson-led IBM platforms, and 3. Delivering useful tools for our Developer Advocates to leverage in their community engagement and training efforts.<p>This is a position for self-directed product managers who think strategically, who want to build the next generation of IBM platforms &amp; services that developers love, and who don’t mind getting scrappy &amp; technical to get the job done.<p>Successful candidates for this role will initially own one of the following three Offering areas:\nDeveloper Incentivization\nDeveloper Marketplaces\nVR&#x2F;AR Labs<p>What you’ll do:\n●          Define product vision and strategy\n●          Leverage data driven market research efforts\n●          Determine IBM’s uniquely differentiated value proposition\n●          Develop a go to market strategy\n●          Build and lead cross functional teams from relevant IBM business units\n●          Create product&#x2F;platform road-map and deliverables\n●          Ship amazing products for developers\n●          Iterate using continuous delivery &amp; feedback loop best practices","time":1488406468,"type":"comment"}