{"by":"RBC-ACE","id":13765245,"parent":13764728,"text":"RBC ACE | Toronto, Luxembourg | Full-time, ONSITE | <a href=\"https:&#x2F;&#x2F;jobs.rbc.com&#x2F;ca&#x2F;en&#x2F;search-results?keywords=ACE\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.rbc.com&#x2F;ca&#x2F;en&#x2F;search-results?keywords=ACE</a><p>Openings:<p>- Full Stack Technical Lead<p>- Big Data Developer<p>- Full Stack Developer<p>- Exploratory Tester<p>What is the opportunity?<p>RBC Investor and Treasury Services (I&amp;TS) has developed a multi-year business transformation strategy, Advanced Client Engagement (ACE), that focuses on aligning our clients’ requirements with system enhancements designed to improve their overall experience, enhance operational efficiency and reduce risk.<p>What you will do?<p>Design, develop and test a large-scale, custom distributed software system using latest Java and JavaScript technologies:  Spring Boot, Angular and Cloud Foundry.\nEmploy agile development practices including test and deployment automation as well as Continuous Integration using Jenkins to improve overall execution speed and product quality.\nBe a technology advocate and share expertise with other team members.\nBe a key partner to the business and the rest of the team throughout the delivery cycle.\nThink through challenging and interesting problems and solve them with your team.<p>What’s in it for you?<p>We thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.<p>A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable.\nLeaders who support your development through training and study groups.\nBe a key enabler of RBC agile and technology transformation.\nAbility to make a difference and lasting impact.\nWork in a dynamic, collaborative, progressive, and high-performing team.<p>For more information please email us at ACEResourcing@rbc.com","time":1488386418,"type":"comment"}