{"by":"nutonomy","id":13765900,"parent":13764728,"text":"nuTonomy | Computer Vision Research Scientist (self-driving cars) |  Cambridge (MA), Santa Monica (CA), Singapore | VISA <a href=\"http:&#x2F;&#x2F;nutonomy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;nutonomy.com</a><p>nuTonomy aims to be the first company in the world to launch an autonomous taxi system, and we are building up an awesome team to make this goal a reality. This includes software for autonomous vehicle navigation in urban environments, smartphone-based ride hailing, fleet routing and management, and controlling a vehicle remotely through teleoperation.<p>nuTonomy is looking for Computer Vision Research Scientists.<p>A robust and adaptive perception systems is essential for creating fully autonomous vehicles. We are looking for excellent research scientists in Computer Vision that will focus on researching, developing, and deploying algorithms for extracting semantic information from RGB(D) video streams, including detection, segmentation, tracking and fine-grained classification, with the goal of using this information in a real-time robotic system with high safety requirements.<p>In this role, you would work closely with experts of other sensor modalities to build a fully-integrated perception system, as well as experts in planning and control to “close the loop” on actual robots.  To support your work, you will be able to use a state-of-the-art scalable computing, simulation, and testing environment, which allows a quick transition of your ideas from prototype to vehicles on the road. You will also be expected to mentor junior colleagues. Lastly, you will join an awesome group of motivated colleagues, both industry professionals as well as leading researchers from academia, who like to approach problems with both creativity and rigor, to push beyond the state of the art.<p>Requirements:<p>* Ph.D. in Computer Science or related field.\n* Extensive experience of one or more of the following:\n  - Deep learning applied to images or video data.\n  - Other modern machine learning methods, with a focus on rigorous statistics.\n  - Geometric computer-vision such as SLAM, optical-flow and stereo.\n* Sensor fusion of RGB and depth.\n* Excellent analytical, communication, and writing skills.\n* Experience developing software as part of a team.<p><a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;2v8qat1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;2v8qat1</a>","time":1488389201,"type":"comment"}