{"by":"rubiquity","id":13765652,"parent":13764728,"text":"MotionMD | Web Developers (Ruby&#x2F;Rails) | San Diego, CA | Remote (US only), Contract<p>MotionMD is a clinical workflow application for Orthopedic practices. We help automate the paperwork for healthcare billing and prescription and inventory management so that Doctors and their staff can spend more time delivering great care to the patient. MotionMD is a budding software organization inside of DJO Global, a 40 year old Orthopedic bracing and surgical company. We are not a startup! :-)<p>The development team works remote all across the US with team members in every US time zone. The app is built using Ruby (2.3) and Rails (4.2, soon 5.0!) with primarily Backbone and Bootstrap on the front end. Our Rails app is going on 9 years old and is very well maintained and continuously undergoing new feature development. We’re looking for people who value writing and reading maintainable code and enjoy working on software that makes an impact. At this time we’re looking for people with experience in the Intermediate to Senior range.<p>Here&#x27;s what our hiring process looks like so you know what to expect from us:<p>1. An initial phone screen to learn more about you learn more about us<p>2. Pair programming session for 1-2 hours where we will work on an actual bug in MotionMD<p>3. Group video chat with the MotionMD development team<p>We’re looking for help in the following areas:<p>- DevOps &amp; Automation: our app runs on AWS and we’re looking to continue building more tools and automation to help us do our jobs better. We use Terraform, Ansible, and Packer for automation.<p>- Front-End: Our app is a mishmash of CoffeeScript, Backbone, Bootstrap, and Jasmine tests. We would love for someone to lead the way on unifying our JS&#x2F;CSS approaches and set us up for new horizons such as TypeScript, Vue, or Elm<p>- Back-End&#x2F;Feature Development: There’s a lot of room for innovation in healthcare and we always need help implementing new functionality for our users.<p>Please email richard.bishop@djoglobal.com if you’re interested","time":1488388147,"type":"comment"}