{"by":"animeshsingh","dead":true,"id":13769173,"parent":13764728,"text":"Cloud, Containers and Infrastructure Advocacy Staff Developer  (www.ibm.com) | San Francisco  Bay Area, CA |  Advocacy Staff Developer (ONSITE)<p>Please connect with me on <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;animeshsingh1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;animeshsingh1</a> if you are interested<p>Are you an accomplished developer looking to share your experiences and lead the next wave of how developers collaborate and build industry leading solutions based on open source cloud technologies? If so, IBM is the place to be.<p>We are building teams of developers whose overall mission is to develop innovative applications and solutions on IBM`s Open Cloud Platform and Infrastructure offerings that will engage developers and create a strong pull for them to leverage IBM`s technologies and build applications using our products. You will have the freedom to develop applications using all of the technologies that IBM has to offer. The list includes, but is not limited to, Bluemix, Serverless, Containers Services including Docker, Kubernetes, Cloud Foundry and OpenWhisk. You will also engage with the development community through outreach programs such as hackathons, meetups, workshops and more.<p>Key aspects and skills for this role would be have an understating and working knowledge of Cloud computing concepts like PaaS, IaaS, Serverless, Containers, etc, breadth of knowledge of many programming languages including Web Languages, Swift, Python, Ruby, Go and others. To go along with the programming you will also be expected to have a working knowledge of CI&#x2F;CD processes and tools. Being active in open source developer communities such as Apache, OpenStack, CNCF, Kubernetes, Cloud Foundry and others is a plus, and so is being responsive and visible on Stack overflow, Reddit, Google groups etc.<p>You should also have good communication skills, both written and verbal, as you will be in roles where you will speak at hackathons, meetups, and other public venues as well as communicating via blogs, emails and other written communication. You will also be expected to have a social presence by leveraging social media outlets like Twitter etc.<p>Multiple opportunities are available. Candidates must be willing to be based in one of the following locations: Bay Area","time":1488407269,"type":"comment"}