{"by":"andytw","id":13766045,"kids":[13766787],"parent":13764728,"text":"ThoughtWorks | Senior Developer, Lead Developer, Infrastructure Developer (DevOps), Mobile Developer | New York | Full Time | On Site &amp; Travel | VISA transfer OK | www.thoughtworks.com&#x2F;<p>ABOUT US:<p>As technology consultants, we work with a variety of clients that hire us to solve complex and interesting problems. We believe in change through delivery and collaborate with client teams to build world-class technology that breaks through traditional enterprise models.<p>Each client we work with gives us a new perspective and a broad exposure to different technologies, which leads to a pretty unlimited learning environment. We are constantly questioning the status-quo, innovating, and delivering. If you have a passion for exploring new technologies, chances are you’ll fit right in.<p>Our developers have been contributing code to major organizations and open source projects for over 25 years now. They’ve also been writing books, speaking at conferences, and helping push software development forward -- changing companies and even industries along the way.<p>TECHNOLOGY:<p>The nature of consulting means that the languages we code in and technical environments vary from project to project. ThoughtWorks looks for individuals with expertise in multiple technologies, but most importantly, those who are always willing to learn more. Keywords: java, ruby, javascript, .net, scala, clojure, python, ios, android, continuous integration (CI), continuous delivery (CD), cloud, docker, platform as a service (PaaS), test driven development (TDD), agile, lean<p>APPLY:<p>Senior Developer: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;68103\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;68103</a><p>Lead Developer: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;68248\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;68248</a><p>Infrastructure Developer (DevOps): <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;502823\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;502823</a><p>Mobile Developer: <a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;208767\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;208767</a>","time":1488389800,"type":"comment"}