{"by":"arnon","id":13766236,"parent":13764728,"text":"SQream Technologies | Big-Data Solution Architect | New York | Full time | ONSITE www.sqream.com\nThe Big-Data Solution Architect is responsible for understanding emerging and evolving customers’ Big-Data Analytics models and requirements, able to articulately talk through, present and whiteboard big-data analytics concepts and approaches with customers and provide creative solutions utilizing SQream DB to meet customer needs. The Big-Data Solution Architect, will define and lead customers’ POCs and will be working closely with the North American Sales team, as well as the technical product team in the R&amp;D center.<p>SQream Technologies | VP Products | East Coast USA, Tel-Aviv Israel | Full time | ONSITE www.sqream.com\nThe role requires an individual with strong leadership, business, partnering, customer-facing and analytical skills who can become the key owner of SQream’s product and product vision. This individual should be very technical and business savvy with ability to leverage his&#x2F;her proven expertise in SQream to foster a vibrant product ecosystem, help to build solutions from existing ideas and help to develop new disruptive ideas.<p>SQream Technologies | High-performance C++&#x2F;CUDA Software Developer | Tel-Aviv Israel | Full time | ONSITE www.sqream.com\nYou will be joining our crack team of highly skilled C++&#x2F;CUDA developers working on our massively parallel SQL query engine. Our team uses a mixture of leading open-source and in-house developed tools in order to develop a cutting-edge database which harnesses powerful Nvidia GPUs.<p>SQream Technologies | GPU Software Developer | Tel-Aviv Israel | Full time, part time | ONSITE www.sqream.com\nSQream Technologies is looking to hire experienced Software Developers specializing in GPUs. Developers must be familiar with multi-threading, Nvidia GPU technology, and Linux programming. The desired candidate will be responsible for GPU runtime code.<p>About SQream Technologies: \nBig Data Analytics Software Vendor SQream Technologies delivers a high-performing Next Generation GPU-powered SQL database designed to quickly relieve Big Data and complex Analytics pains to enable businesses interact dynamically with their digital assets.<p>Send your CV to jobs@sqream.com","time":1488390688,"type":"comment"}