{"by":"vqc","id":13766225,"parent":13764728,"text":"Open Law Library (<a href=\"http:&#x2F;&#x2F;www.openlawlib.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.openlawlib.org</a>) | Software Engineer | U.S. | REMOTE | $90k-$110k+<p>Open Law Library is a small nonprofit tech startup and open access legal publisher dedicated to making the law accessible to all.<p>We take tools and techniques developed for engineers to publish software code - linters, compilers, continuous integration&#x2F;deployment, VCS, etc - and adapt and transform them for use by governments to publish legal codes. Governments use our tools to save time and money and publish laws in human-friendly and computer-friendly formats.<p>If you are looking for a meaningful way to contribute to our democracy, you find joy in building the perfect tools for your users, you like deep and challenging problems in such diverse areas as version control, DSL design, UI&#x2F;UX, and NLP (more accurately, LLP - Legal Language Processing :), and the idea of helping build a team excites you, contact vchuang at openlawlib dot org.<p>We are looking to fill two types of positions:<p>Engineer with Legal Experience<p>We serve our government partners and their citizens by quickly and efficiently solving their legal publishing needs through technology. But every government is different, so we are always looking for strong engineers with legal experience who can quickly understand our partners’ needs and customize our software to their specific requirements. If you are a engineer with legal experience - lawschool grad, paralegal, or lawyer - come apply your passion for technology and the law to meaningfully change how the public experiences the law. When applying or inquiring, please include the phrase law in square brackets in the subject line.<p>Developer Tools Engineer<p>We are looking for an engineer with extensive experience writing developer tools who is interested in applying that experience to legal writing and publishing. If you have experience with IntelliSense, IDEs, linters, compilers, etc, and you want to apply it to a completely new field, we’d like to chat! When applying or inquiring, please include the phrase tools in square brackets in the subject line.","time":1488390627,"type":"comment"}