{"by":"mzagaja","id":13770486,"parent":13764728,"text":"ONSITE\nMetropolitan Area Planning Council | Front end Web Developer | Boston, MA | ONSITE <a href=\"http:&#x2F;&#x2F;www.mapc.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mapc.org&#x2F;</a><p>The Metropolitan Area Planning Council seeks a Front End Web Developer to join the Digital Services Group, housed within the Data Services Department, a team of 12+ planners, analysts, researchers, programmers, and IT professionals dedicated to using data and technology to support informed decision-making. The Front End Web Developer will support the Digital Services Group in front end design and web development of open-source, public sector web applications related to regional planning, municipal operations, and civic engagement.\nMAPC&#x27;s Data Services Department has a long history of using technology to drive informed decisions across the region. If selected for the position you will work in a collaborative, respectful environment using modern web technologies and frameworks, and leading user-centered design processes. As part of a small, interdisciplinary group, you will be involved in all aspects of the product delivery cycle.<p>As MAPC&#x27;s Front End Developer, you will contribute frontend design and development to a growing portfolio of web applications that streamline municipal operations, make complex data visual and easy to interpret, and support informed decision-making at the policy and individual level across many topic areas (housing, transportation, clean energy, open data policy, economic development). Recent digital projects include an algorithm-based system to improve operations of Boston&#x27;s Youth employment system, a data portal to understand proposed and current real estate development, and scraping rental advertisements to understand housing affordability across Boston&#x27;s Metro Area. Our ongoing work can be viewed at <a href=\"http:&#x2F;&#x2F;data.mapc.org\" rel=\"nofollow\">http:&#x2F;&#x2F;data.mapc.org</a> or at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;mapc\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;mapc</a>.<p>This is a full time position (37.5 hours&#x2F;week).  The starting salary ranges from $60,000 to $70,000 annually depending on qualifications and experience. MAPC offers excellent Massachusetts state employee benefits. MAPC&#x27;s workplace and our benefits are designed to provide a sustainable, healthy relationship with your work, including flexible time, remote working policy, and a family-friendly environment.","time":1488417159,"type":"comment"}