{"by":"alexatkeplar","id":13771845,"parent":13764728,"text":"Snowplow Analytics | Sysadmin | ONSITE London, UK<p>Snowplow is building out a dedicated Technical Operations team in 2017, and is looking for experienced systems administrators to join it. Initially this role is open only to candidates based in London or the South-East of England.<p>The sysadmins within our Technical Operations team will have four key responsibilities:<p>1. Handling deployments, upgrades and other maintenance of Snowplow-related infrastructure (load balancers, Redshift clusters, ASGs etc) for our Managed Service customers, across over 100 AWS accounts<p>2. Responding to customer issues and questions concerning Snowplow-related infrastructure, as escalated to you by our L1 Support team<p>3. Working with Snowplow SREs to design, deploy and operate Snowplow’s internal infrastructure, responsible for running the Snowplow Managed Service, the Snowplow website and other services<p>4. Being on call rotation to triage and resolve operational incidents relating to internal or client infrastructure<p>For more information: <a href=\"http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;about&#x2F;jobs&#x2F;systems-administrator&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;about&#x2F;jobs&#x2F;systems-administrato...</a><p>Snowplow Analytics | Support Engineer | REMOTE UTC+8 to UTC+10<p>Having grown our team to two support engineers with a broad timezone reach (Alberta, Canada to Berlin, Germany), we are now looking to move to a full “follow the sun” model, and hire our third support engineer in the UTC+8 to UTC+10 timezone range.<p>This is a support engineering role - not a support agent role. We are looking for candidates who can learn, troubleshoot and explain the many complex technical systems that make up the Snowplow offering. You will be supporting the Snowplow Managed Service, under which we orchestrate and monitor the Snowplow event pipeline for over 100 customers.<p>The support that we provide to our customers is a core part of the Managed Service offering, and we strive to provide the best technical support of any analytics vendor.<p>You&#x27;ll find more information here: <a href=\"http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;about&#x2F;jobs&#x2F;support-engineer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;about&#x2F;jobs&#x2F;support-engineer&#x2F;</a>","time":1488434677,"type":"comment"}