{"by":"DavidMcLaughlin","id":13770978,"kids":[13794904],"parent":13764728,"text":"Twitter | Software Engineer | San Francisco, CA | ONSITE<p>We&#x27;re looking for engineers to come work on Twitter&#x27;s Cloud Platform team. The majority of this work revolves around developing Apache Mesos[1] and Aurora[2].<p>Aside from the constant challenge of making sure our platform can scale with the company (we have the largest Mesos clusters in the world), Twitter is in an exciting stage where efficiency (and thus hard performance problems) are becoming more and more important.<p>Because most of our platform is open sourced, contributions you make on this team will also be felt across a huge number of companies in the community. Mesos is used at companies like Apple and Netflix and Aurora adopters include Paypal, Uber and Electronic Arts. Twitter&#x27;s commitment to OSS as well as our unique position in terms of platform size gives us a huge opportunity to lead development of key features.<p>One of my favorite things about working on this team for the last few years has been that I get to touch literally every part of the stack. It&#x27;s a constant learning process. Mesos is written in C++ and is very heavy on systems, Aurora is on the JVM, much of our developer tooling and automation is in Python, and then we also have a product layer and other tooling that are written in a modern JS stack (React&#x2F;redux&#x2F;etc.). So no matter your interests, you can make a huge impact here.<p>From a product point of view - trying to keep thousands of developers happy and productive in the face of constant comparisons to public offerings like Heroku and AWS, as well as other platforms like Kubernetes, Docker Swarm, etc. is also a huge (but fun) challenge. So if you&#x27;re a product-focused engineer, this is also a great opportunity.<p>We have a great team that&#x27;s based in SF and within six months will be completely onsite. So we&#x27;re not looking for remote workers right now.<p>If this interests you at all or you&#x27;d like more information, please get in touch at dm@twitter.com for my work e-mail or david@dmclaughlin.com for my personal e-mail.<p>[1] - <a href=\"http:&#x2F;&#x2F;mesos.apache.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;mesos.apache.org&#x2F;</a>  \n[2] - <a href=\"http:&#x2F;&#x2F;aurora.apache.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;aurora.apache.org&#x2F;</a>","time":1488422541,"type":"comment"}