{"by":"jonovate","id":13780251,"parent":13764728,"text":"Expedi | Front-End&#x2F;Full Stack developer++ (2nd Tech Hire) | Houston, TX | On-site (Full Time)<p>We&#x27;re on the hunt for our 2nd engineer who considers themselves more of a Front-End developer with some &quot;Full Stack&quot; and E-Commerce know-how, yet does not want to be constrained to doing just that. Having a strong desire to grow your career quickly as an early employee, will make it a perfect fit.<p>Expedi, LLC is an Oil &amp; Gas start-up with huge plans to quickly scale up and out in the physical supplies market. Our seed round is already in the bank and we&#x27;ll be raising our Series A in the very near future. Plus we&#x27;re bootstrapping in parallel by doing the traditional thing, which gets us in the door of our customers&#x2F;partners and helps prepare to shift them (and the market) into this decade.<p>+Our office is in NW Houston (Off FM1960 &#x2F; between the 249 and I-45)<p>+Healthcare and vacation provided, along with optional dental&#x2F;vision&#x2F;etc. The expected usual&#x27;s and more to come as the company grows, including equity&#x2F;bonus. (Family and work-life balance are key to the board, myself and our CEO, COO)<p>+On the team, I have a strong engineering &amp; continuous learning culture planned which brings us all exponential growth and challenges. This includes the opportunity to make a name for yourself (if that&#x27;s your thing), using&#x2F;contributing to open source, development blog, representing us at meetups&#x2F;hackathons&#x2F;conferences and more (plus what is important to you).<p>Our first launch will require experience with Python+Django, Node, HTML5&#x2F;ES6&#x2F;CSS (Bootstrap, etc.), Postgres, Linux &amp; Docker&#x2F;Containers, Git, Ecommerce - lots of open source... \nThen once we&#x27;ve launched this Summer, you will be able to continue focusing on that, plus so much more as the team grows. There will be back-end &amp; integrations to SaaS&#x2F;On-premise systems, mobile apps, security, cloud management, SEO, data analysis, hardware&#x2F;IOT?, etc...\nWe&#x27;re not there yet, therefore you basically have that rare chance to help drive a road-map and build a company from the ground-up, while doing something you enjoy.<p>Hopefully interested?? Email me: it@goexpedi.com and we&#x27;ll go from there. No recruiters please and we are unable to sponsor a Visa at this time. :(<p>!! Also, if anyone is wanting an opportunity to expand their UX&#x2F;Design portfolio, reach out to me as well as we will be looking for help soon.","time":1488507527,"type":"comment"}