{"by":"DarkVision","id":13807090,"parent":13764728,"text":"DarkVision Technologies | C++ Developers | North Vancouver, BC, Canada | ONSITE, <a href=\"https:&#x2F;&#x2F;darkvisiontech.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;darkvisiontech.com&#x2F;</a><p>* Email me at [suter-at-darkvisiontech.com](mailto:&#x2F;&#x2F;suter-at-darkvisiontech.com). Don&#x27;t worry about a cover letter -- send me a resume and let&#x27;s start the conversation from there.<p>DarkVision Technologies Inc. has developed a new ultrasound-based imaging technology used to inspect the inside of oil and gas wells to improve well integrity and minimize environmental impacts. The company’s field-ready hardware has been designed from the ground up including the ultrasound transducers (designed and built on-site), the mechanical housing (a 15,000-psi pressure vessel) and the electronics (a custom FPGA and arm SoC Architecture running an embedded Linux).  Our image processing pipeline processes up to 20 Gbits of data every second to create datasets that can be used to find small cracks in wells that can be many kilometers long.  Our team consists of experts from machine vision, medical imaging, aerospace, and computer graphics sectors.  With several of North America’s largest oil and gas companies already secured as early customers, DarkVision’s flagship product is now making its debut in the field.  We’re not a typical oil and gas service company. We’re not your typical &#x27;app 2.0&#x27; or LOB company. And we&#x27;re not a 20-year science experiment that never delivers a product of value. What we are is a technology company that has chosen to solve a critical and real problem for one of the largest industries in the world. We combine the right balance of big-picture thinking with pragmatic plans to develop technology that leaves the lab, and works in the real world to solve our customers’ problems.<p>We are seeking to recruit a talented C++ engineer to develop our embedded, desktop and cloud applications.  The right candidate loves modern C++ and loves to write high-performance data processing, rendering and image processing code.  \nThe candidate will work with our software and hardware engineers and have the opportunity to do complete “full stack” development -- from embedded systems to data processing to 3D rendering to databases and web services.<p>Responsibilities (include, but are not limited to):\n  * Implement the 3D visualization engine in C++ on windows.\n  * Implement computer vision&#x2F;image processing algorithms on an ARM SoC embedded Linux platform.\n  * Implement data processing pipeline code for post processing ultrasound data for defect detection.\n  * Implement efficient data streaming algorithms for a responsive end user experience while browsing data sets that contain hundreds of gigabytes of information.\n  * Implement stateless web services in C++ including database communication.\n  * Implement cloud services on Amazon Web Services including deployment and configuration.<p>Qualifications:\n  * Bachelor of Computer Engineering, Computer Science, or related field\n  * 2-5 years C++ experience (variable depending on the candidate)\n  * C++11&#x2F;14 and Boost experience\n  * [Bonus:] DirectX&#x2F;OpenGL&#x2F;Vulkan&#x2F;OpenCL&#x2F;CUDA experience\n  * [Bonus:] Image Processing, Computer Vision and Machine Vision experience\n  * [Bonus:] Web Services and Database development experience\n  * [Bonus:] Amazon Web Services experience<p>Compensation:\n  * Competitive salary\n  * Full benefits\n  * Up to 8-weeks vacation (yes 40 days!)","time":1488843284,"type":"comment"}