{"by":"adam-p","id":13813903,"parent":13764728,"text":"Psiphon | Metrics System Administrator | <a href=\"https:&#x2F;&#x2F;psiphon.ca\" rel=\"nofollow\">https:&#x2F;&#x2F;psiphon.ca</a> | Toronto, Canada - ONSITE<p>= What we do =<p>Psiphon develops and operates a censorship circumvention network that helps millions of people in freedom-restricted countries to access the uncensored Internet. We work at the leading edge of circumvention technology, where the latest network protocol and endpoint obfuscation research is rapidly deployed into production around the world. Our tasks include censorship technology research, server and client software development, and operation of a dynamic, global network of thousands of proxy servers.<p>We’re a small team (8 developers) looking for skilled and enthusiastic people to join us as a Metrics System Administrator for our ELK stack.<p>As the Metrics System Administrator, you’ll be the primary for our production Elasticsearch, Logstash, and Kibana (ELK) instances handling several million data points per minute across over 30 nodes. You will be responsible for configuration, uptime and monitoring, capacity planning, maintenance, backups&#x2F;restores, and high availability planning&#x2F;testing. You will also handle interactions with the ancillary systems which use the data from this infrastructure including dashboards, and associated query writing and debugging, user management, and maintenance.<p>== Roles and Responsibilities ==<p>* Be the primary administrator of day-to-day operations and maintenance of a production ELK stack<p>* Monitor key health metrics, execute maintenance tasks, and respond to any incidents<p>* Plan and implement configuration changes, cluster topography changes, external access, and backup&#x2F;restore procedures<p>== Qualifications and Skills ==<p>* Experience with ELK from an administrative perspective<p>* Experience with system administration in a Linux environment<p>* Experience writing and maintaining scripts to automate administrative tasks<p>* Familiarity with AWS infrastructure and tooling is an asset<p>= Contact =<p>info+hn@psiphon.ca","time":1488915485,"type":"comment"}