{"by":"agerwick","id":13841433,"parent":13764728,"text":"Librato&#x2F;Papertrail | SF| Sr Data Engineer | Full-time &#x2F; Onsite | <a href=\"http:&#x2F;&#x2F;solarwinds.jobs&#x2F;san-francisco-ca&#x2F;sr-data-engineer&#x2F;AE56CC21BD2D4A519674149D7FA99550&#x2F;job&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;solarwinds.jobs&#x2F;san-francisco-ca&#x2F;sr-data-engineer&#x2F;AE5...</a><p>We&#x27;re looking for a full-time software engineer to take a key role in building the scalable backend systems that power Papertrail.<p>Qualifications:\n<i>You are an experienced Internetcentric engineer, equally adept at improving interfaces as at tracking down complex performance problems\n</i>At least 5 years of experience building distributed systems with Java or Scala\n<i>At least 2 years of experience with Ruby\n</i>Comfortable with using and reasoning about concurrency primitives\n<i>Experience with ZooKeeper, Dropwizard, MySQL\n</i>Understand the importance of metric instrumentation\n<i>Experience with building and consuming REST APIs\n</i>Comfortable debugging network, disk, performance issues in complex distributed systems\n<i>Experience working in and developing for Linux environments\n</i>At least 6 years of relevant engineering experience\n<i>Comfortable with cloud-based deployment, remote teams, and git<p>What&#x27;s in it for you?\n</i>Competitive salary &amp; compensation\n<i>Excellent health care coverage\n</i>Fewer meetings, more shipping. Most of Papertrail’s operations are in Slack.\n<i>A team committed to life&#x2F;work balance\n</i>4% 401(k) match<p>About Papertrail:\n<i>We&#x27;re part of SolarWinds, which includes Librato, Tracelytics, and Pingdom . You can see some of the things we think about on @papertrailapp.\n</i>SolarWinds is on Forbes&#x27; lists of Most Innovative Growth Companies and America&#x27;s Best Small Companies.<p>If interested please apply directly or email me at ashley.gerwick@solarwinds.com and reference this posting!","time":1489174862,"type":"comment"}