{"by":"aaronjg","id":4323798,"parent":4323597,"text":"Brooklyn, NY Full Time<p>Custora (YC W11) is a customer analytics tool that helps retailers earn more from happier customers.\nTo be a little more specific, we can point to a single retail customer and paint a meaningful portrait with his data: How much he’ll spend, how often he'll make purchases, what types of products he's inclined to buy, his predicted likelihood of returning, and more. Custora also integrates with email marketing providers and customer support systems to fuel a seamless, iterative flow of insights to actions.<p>From Fab.com to Etsy, some of the fastest growing and respected names in retail are using Custora on a daily basis.<p>Who We’re Looking For<p>We’re looking for a developer to join our core team. Our web stack is Ruby on Rails, and our analytics are done in R. Experience with these technologies is a plus, but we’re open to sharp developers with experience building products for the web in general.<p>Where We Are<p>Location-wise, we’re in Brooklyn, NY. We love it. Progress-wise, we’re a YC company from Winter 2011. We’ve recently been featured in the New York Times, GigaOm and BetaKit, and in the last 2 months we’ve had more signups than in the previous 10.<p>Day to Day\nHere’s a taste of what happened last month:<p>Aaron implemented a Dirichlet Latent Class Multinomial to power customer archetype analysis based on customer purchasing behavior.<p>Martin made dramatic improvements the email marketing part of the product. He made it easier for our clients to launch multiple email tests in parallel, and added four new email providers to our growing list of integrated partners.<p>Jon and David worked together to completely redesign the interface of the application. We moved from an interface that focused on browsing through dashboards to one that delivers answers to specific questions.<p>Outside the office, Corey and Dave manned a booth at a big e-retailer conference and developed a Blackjack-style Custora game to play with prospective clients.<p>What We Offer<p>Our compensation is competitive with anyone on the market. Since you’ll be a core member of the team, meaningful equity is part of the package. We offer comprehensive health coverage, including a dental and vision package. Lunches are paid for and we usually eat as a team. We do happy hours at least twice a month and play bocce ball competitively (sort of). Our vacation policy is based on trust — take what’s needed and keep the rest of the team up to speed.<p>Let’s Chat<p>If you’re interested, apply online at \n<a href=\"http://www.custora.com/careers\" rel=\"nofollow\">http://www.custora.com/careers</a>","time":1343838030,"type":"comment"}