{"by":"yqiang","id":4324451,"kids":[4327505],"parent":4323597,"text":"Location: San Francisco, CA (SOMA)\nPosition: Product Generalist<p>What we do: Subscription based social hyperlocal mobile gamified discovery engine with loyalty deals. For the enterprise.<p>Just kidding. We're a stealthy 3 person team of full stack product engineers going after a huge opportunity. Everyone on the team codes and contributes at every level, front to back. We've all built web scale products and grown them to millions of daily active users with zero marketing spend. We're looking for 1 or 2 product generalists who can come in and contribute the same way on Day 1. Our product is mobile first.<p>We are well funded by A-List investors.<p>We are NOT your average stealth startup. We are NOT yet another me-too-social-local-sharing app. We DON'T sell condoms by subscription. We are NOT the place to share photos of your dog taking a leak. There will be NO gamification. We are filling a hole in the universe by building software that addresses a fundamental human need. The world is becoming a different place: everyone has a network connected super computer with ambient sensors in their pockets and we can see the future that is enabled by these devices. We are making that future happen.<p>Real talk: We've been running our prototype for 2 months and we all use it every day. Every person we've showed it to has asked us if they can use it. Every single person has gotten mad when our testflights expire off their phones after letting them test it.<p>The ideal candidate is a brilliant, fearless and passionate individual who is uncompromising in his/her pursuit of building an incredible product that will positively affect the lives of millions of people every day.<p>As members of a team we believe in commitment and accountability; the importance of honing our craft; building tools to create leverage; and seeking to learn from and understand each other.<p>We are offering founding team equity and above market salary. Retina Macbook Pro &#38; 30 inch monitor. Office space in the heart of the SoMa district in beautiful San Francisco. Willing to relocate. Willing to fly in candidates for interviews. Willing to tell you our stealthy secrets.<p>Interested? Email alex at herelabs.com","time":1343843202,"type":"comment"}