{"by":"zmb","id":4324516,"parent":4323597,"text":"<i></i>* KeepSafe <i></i>*<p>Location: San Francisco, SOMA<p><a href=\"http://www.getkeepsafe.com/about.php#jobs\" rel=\"nofollow\">http://www.getkeepsafe.com/about.php#jobs</a><p>KeepSafe helps consumers protect their privacy. We make tools millions of people find useful - and we’re just two engineers right now. Come be our first hire to do impactful work that scales. Here’s why you should join us:<p>(1) KeepSafe has millions of customers and we’re growing fast. We solve the privacy problems that users feel every day and our phenomenal retention speaks to our success. In this team, every bit of work you do will directly impact a huge user base. At KeepSafe you will have significant product ownership and your decisions count.<p>(2) KeepSafe is a product and engineering startup by DNA. Building a great product is our first priority. To get there with a small team requires smart engineering solutions. You won’t spend your brain power on useless meetings, instead we build and ship.<p>(3) KeepSafe is a great place to work. We’re making this the most fun and most productive time of our lives. As the third person in the company you will shape the way KeepSafe lives and breathes. Of course you’ll get to choose your personal work environment. Any equipment you need, we’ll get it.<p>(4) KeepSafe is going to be huge. Everyone values privacy, not just since Facebook. It is human nature and KeepSafe is catering to that. KeepSafe will be <i>the</i> tool and <i>the</i> place for people to protect their content. Our traction and growth support our ambitious vision, and our investors believe in us. You are joining this company at a time where all that’s left to do is get to work and make it happen.<p>If you’re a great programmer, you love coding, you do it in your spare time and you get upset at badly made consumer software, we want to talk to you. You’re the kind of engineer we’ll enjoy working with.\nWe want you to join us to learn new things, build a great product for millions of users, and make KeepSafe an amazing company. What could be a greater opportunity than that?<p>About KeepSafe<p>KeepSafe gives you control over who sees what on your phone. You choose what is public, what is private, what can be shared and for how long. Your content and your privacy should be under your control. KeepSafe is the place and the tool you use to store and lock your stuff.\nOur apps let you control your pictures and text messages. Over 3m users on Android and iPhone use this.","time":1343843796,"type":"comment"}