{"by":"jobi","id":4324302,"parent":4323597,"text":"Boston MA, full-time<p>Senior QA Tester<p>litl is looking for a motivated and highly experienced Senior Tester to join our growing Copley Square-based software team.  litl is the company that brought you the litl webbook, a computer that lets you enjoy the web without worrying about anything else and winner of numerous national and international awards. litl is currently bringing multiple consumer photography applications to market. The ideal candidate would have experience in mobile application testing. As a Senior Tester, you will work as part of the larger development team that's building exciting mobile applications for iOS, Android and Windows mobile.<p>Skills &#38; Requirements<p>A minimum of 5 years software testing experience. Extensive experience in functional testing, integration testing, regression testing, GUI testing, browser-compatibility testing, and load/performance testing. Experience with manual and automated testing methods. Knowledge of all aspects of the software development life cycle. Knowledge of automated test frameworks. Knowledge of Agile/Scrum software development. Ability to review project requirements/design specifications and develop relevant test strategies. Provide mentoring to junior QA Associates. Adaptable and flexible to changing priorities. Self-motivated and comfortable working in both team/solo environments. Strong analytical and troubleshooting skills. Strong attention to detail. Excellent communication, documentation and organizational skills.<p>About litl<p>We're a small computer company with big ideas. Located in Boston, we also have people in London, Brazil, the Greek Isles...you get the idea. Our 60 person team consists of software developers, hardware engineers, industrial designers, user experience experts, graphic designers, software testers, evangelists, logistics gurus, and top-notch customer support. An unlikely mix, perhaps, but what we have in common is passion for creating compelling user experiences. Our four-year pursuit has been continually fueled by enthusiasm and excitement about our diverse set of projects. The results are always simple, useful, and delightful<p>jobs@litl.com","time":1343841888,"type":"comment"}