{"by":"sbisker","id":4324904,"parent":4323597,"text":"<i>[These positions are for our new San Francisco office in Lower Nob Hill. We're also happy to announce a $4M Series A from the likes of General Catalyst, SV Angel, Lowercase Capital and Lightbank, to name a few. <a href=\"http://techcrunch.com/2012/04/23/data-focused-locu-raises-4m...\" rel=\"nofollow\">http://techcrunch.com/2012/04/23/data-focused-locu-raises-4m...</a>. -sbisker]</i><p>San Francisco, CA - Senior Full Time Software Engineers at Locu (<a href=\"http://locu.com\" rel=\"nofollow\">http://locu.com</a>)<p>We're looking for all sorts - front-enders, \"desingineers\", back-enders and full-stack all welcome for this position. As long as you enjoy hacking on cool new products and features. :D<p>For Back-End<p><pre><code>  Deep understanding of algorithms and complexity\n  Strong linux system administration experience a plus\n  AWS expertise a plus\n</code></pre>\nFor Front-End<p><pre><code>  Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills\n  Experience with Python / Django is a plus\n  Previous experience building rich, interactive websites\n  A good sense of design and/or an ability to work with designers\n  Experience in designing dashboards and user interfaces is a plus\n  Experience in proper UI engineering and reusable architectures a plus\n  (proper use of prototypes in JS, experience with Backbone, and what have you.)\n</code></pre>\nFor Full-Stack and Desingineers<p><pre><code>  We know you like to strike your own unique balance. So, show us what you've got.\n  We want you to be able to do what you love. :)\n</code></pre>\nFor all<p><pre><code>  Ideally 4+ years of experience\n  Experience leading or managing an engineering team a plus\n  - we'll give you a chance to mentor and grow as an leader.\n  Exceptional software engineering talent\n  Previous start-up experience is a plus\n</code></pre>\nLocu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We are about to launch MenuPlatform &#60;<a href=\"http://www.menuplatform.com&#62;\" rel=\"nofollow\">http://www.menuplatform.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>Interested? Drop us a line at jobs@locu.com. Please specify which position you're applying for, as well as \"HN\", in the subject of your letter. Learn more about our open positions at <a href=\"http://locu.com/jobs/\" rel=\"nofollow\">http://locu.com/jobs/</a><p>-------------------------------------<p>Founded less than a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best angel investors in the country.\nWe are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 10 people with very diverse backgrounds, and growing.","time":1343847582,"type":"comment"}