{"by":"stevewilhelm","id":4325201,"parent":4323597,"text":"Palo Alto, CA - Euclid Elements<p>Help Euclid digitize the physical world.  Through innovative sensor technology and data engineering, we’re arming brick and mortar retailers with a new class of analytics to help them improve their profitability and shopping experience.<p>The dataset we’re providing is revolutionary, and we want our product experience to be just as special.  Current retail business intelligence tools are clunky, ugly, and tedious.  Euclid wants to break to mold by delivering insights AND a beautiful and effortless product experience.<p>The Visual Designer will work closely with the Product and Engineering teams to create this experience.  Primary responsibilities will include prototyping and designing user interfaces, producing gorgeous visual design, and delivering production ready assets.  The Visual Designer will also help make sure the product is well represented on our website and in our marketing collateral.<p>Things we’re looking for<p>+ A unicorn with deep experience in visual and interaction design for web and mobile<p>+ Empathy for the user, can eliminate pain-points with minimalist interfaces<p>+ Artistic ability to create beautiful graphics, textures and layouts<p>+ Thoughtful communication of design decisions and processes<p>+ Mastery of the Adobe Creative Suite and relevant prototyping tools<p>+ Experience producing clean and accurate HTML and CSS<p>+ Proven success working in a collaborative and iterative environment, takes ownership of the product design while incorporating feedback from the team<p>+ Obsessive attention to detail, misplaced pixels drive you nuts!<p>+ Passionate about success, but also likes to have fun<p>+ Believes that B2B products can be sexy too<p>Pluses<p>+ Experience with charting, dashboards, and data visualization<p>+ Portfolio that includes marketing projects such as print collateral, company websites and branding<p>+ Familiarity with javascript and other client-side programming languages","time":1343850371,"type":"comment"}