{"by":"asianexpress","id":4325860,"parent":4323597,"text":"Seattle<p>Senior Software Engineer<p>Come join PaperG (<a href=\"http://www.paperg.com\" rel=\"nofollow\">http://www.paperg.com</a>), just named one of Forbes' 100 Most Promising Companies in America, as we reinvent modern advertising. Once described by the New York Times as \"an ad engine to put Mad Men out of business,\" (<a href=\"http://www.nytimes.com/2010/05/23/business/23novel.html\" rel=\"nofollow\">http://www.nytimes.com/2010/05/23/business/23novel.html</a>) our product can build a customized ad for any business in under a minute. It's so cutting edge that people often call it magic.<p>Our mission is to make online advertising easy for small businesses, since many are unable to get online due to the prohibitive cost of building ads. PaperG solves this issue with PlaceLocal, using novel technology to retrieve relevant images, ratings, positive reviews and other information about any local business from all over the Internet, packaging it into a beautiful display ad in under a minute.<p>==Responsibilities==<p>* Write high quality code for a product seen by millions<p>* Architect and build highly scalable platforms/services<p>==Requirements==<p>* Big Data or Machine Learning experience a plus<p>* Fluent in one or more of the following languages: Python, Java, PHP, C#<p>* Passion for learning and evaluating new technologies<p>* Bachelor's Degree in Computer Science or equivalent<p>==Benefits==<p>We know that happy employees are essential to building a great company, so we're proud to offer a competitive salary and excellent benefits like:<p>- daily free lunch<p>- full Medical, Dental, and Vision coverage<p>- unlimited vacation days<p>- free Amazon.com credit for professional education<p>- stock options.<p>You will be working out of our technology office in Bellevue, WA.<p>----<p>Interested or have questions?  Please send your resume and cover letter to careers@paperg.com<p>We also have other positions in both Seattle and SF: <a href=\"http://www.paperg.com/careers.php\" rel=\"nofollow\">http://www.paperg.com/careers.php</a>","time":1343856624,"type":"comment"}