{"by":"neptunius","id":4325827,"parent":4323597,"text":"Leap Motion – San Francisco, CA – Full time, interns, H1B transfers<p>WHAT WE'RE BUILDING<p>Leap Motion is reinventing the way people interact with computers. We are building a technology that uses a breakthrough mathematical approach to 3D, touch-free motion control software that’s unlike anything that currently exists on the market or in academia. The Leap device senses your individual hand and finger movements independently, and is 200 times more sensitive than existing gesture control technologies on the market today. In case you haven't seen it yet, watch our product demo video: <a href=\"http://www.leapmotion.com/\" rel=\"nofollow\">http://www.leapmotion.com/</a><p>OUR CULTURE<p>We have a collaborative environment where we discuss challenges and ideas openly. Everything from quick design questions, philosophic discussions, to fun ideas for our technology – nothing is off limits. At Leap Motion, you have the utmost creative freedom to work on your passions, and be able to make a significant impact early on. We want our team to think unconventionally, be creative, and find elegant solutions to problems that are yet unsolved. We are an engineering-driven organization; everyone here makes product decisions.<p>WHO WE’RE LOOKING FOR<p>We are looking for exceptionally talented individuals with diverse backgrounds to fill our engineering, design, and operational roles. Join the core team that will help develop the foundation for innovators to build the future. We are seeking passionate problem-solvers to help us tackle seemingly impossible challenges in the areas of applied math/physics, algorithms, graphics, UI/UX design, machine learning, driver development, circuit/hardware design, photonics, and more.<p>DESIRED SKILLS &#38; BACKGROUND<p>• Advanced degree or significant experience in computer science, engineering, math, physics, or a related field<p>• Strong programming skills in C++ preferred; experience with Python, Java, or Matlab also a plus<p>• Solid understanding of algorithms, data structures, and computer science fundamentals<p>• Strong background in image processing, computer vision, graphics, or machine learning<p>• Strong understanding of low-level client-side optimization or GPU programming a plus<p>BENEFITS &#38; PERKS<p>• Competitive compensation, great benefits, and generous equity<p>• Your very own Leap device, and insight into how it works<p>• Collaborate with friendly, talented people with diverse backgrounds<p>• Any computer setup and work station you want<p>• Lunch catered daily, snacks and drinks stocked according to requests<p>• Spacious office in SoMa, near Caltrain and BART stations<p>• Flexible work hours - we care about life-work balance<p>• Health plan including medical, dental, and vision<p>HOW TO APPLY<p>Please email us at jobs@leapmotion.com and mention \"Hacker News\" in the body of your email. We'd love to see what projects you've worked on, and hear what interests you and what problems you'd like to tackle at Leap Motion. Tell us what makes you unique and why you’ll make a vital member of our team.","time":1343856320,"type":"comment"}