{"by":"thirdusername","id":4334337,"parent":4323597,"text":"Singapore - Kallang Area<p>Software Engineer / Junior Software Engineer - Full Time<p>Media Pop (<a href=\"http://www.mediapop.co\" rel=\"nofollow\">http://www.mediapop.co</a>) is a social media technology and marketing firm. We support big name brands and agencies in Singapore in \ntheir social media efforts and as the technology supplier.<p>Media Pop is almost entirely a Python and Django shop with a small but technically competent and helpful tech team that \nwork towards a common vision of quality and a technologically pleasant work environment. Because we have such an abundance of small projects, you'll often find yourself in the drivers seat of the thing you are building.<p>The position:<p>Your role will be to come in and learn enough to take the load off our current team. Which entails maintaining our current systems, and gradually taking responsibility for full web projects.<p>Currently about 60% of the work involves Facebook applications. 20% games and the rest is mobile and other initiatives.<p>Requirements:<p>* 1 years+ commercial experience in web development or fresh graduate. \n* Good communicator in English, we have a multinational team from all over the world.\n* A willingness to pick up and use Python and/or Django.<p>Some experience in web development necessary, you need to at least be familiar with:\n* HTML/CSS/JS\n* At least 1 programming language. If it's Ruby, Python or anything fancy (Haskell?) or flavor of the week (node.js?) it puts you right on top of our list of people we want to interview.<p>Useful skills that you'll have or will probably learn:<p>If you have done anything relating to the following, that's awesome. If not you'll pick it up as you need:\n* Python\n* Django\n* MySQL\n* Facebook, Twitter API experience.\n* Git\n* Linux (Ubuntu / RHEL)\n* Amazon Web Services\n* Nginx\n* Supervisord\n* Jenkins\n* PHP (only about 5% of what we do is PHP, we try to avoid it)\n* WordPress\n* node.js\n* Ruby<p>This job opening is applicable to Singaporean or PR Applicants only (sorry, we've filled out quota.)<p>Apply by emailing me at kit@mediapop.co.","time":1344006726,"type":"comment"}