{"by":"brianmwang","id":4364426,"parent":4323597,"text":"New York, NY - Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>)<p>Web Developer<p>We are looking for exceptional software developers to help us take Fitocracy to the next level. Our team is solving really tough problems all set behind an awesome user experience that needs to scale to millions of users. You must kick ass at Python, Django, and Javascript as well as be biased toward shipping code and product. Since we are a small team, you will work not only on product development but pretty much any other challenge we can throw your way.<p>We are offering a competitive salary and equity ownership. This is for a full time position in New York. And yes, we will help you relocate to the best city on Earth :)<p>What You'll Be Doing<p>- Work closely with the rest of the Fitocracy team and deliver new features using Python, Django, and Javascript\n- Help manage the servers and services we use: AWS, Linux, MySQL, nginx, uwsgi, redis, git, and Celery\n- Communicate constantly with both the team and the Fitocracy community\n- Track user feedback and continuously iterate on it\n- Test, release, and maintain your code\n- Make sure the user experience is consistently awesome<p>About Us<p>Fitocracy is a social network that empowers everyone to reach their next level of fitness. Over half a million people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We are building a world where fitness is possible for everyone. Enough of the useless crap that's polluting the market these days. We're setting out to change everything.<p>We are an 8 person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups and Eniac Ventures. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p>Contact<p>Email me at brian@fitocracy.com","time":1344563945,"type":"comment"}