{"by":"keithhanson","id":4379103,"parent":4323597,"text":"Shreveport, Louisiana - Full Time - Rails/iOS Agency<p>Twin Engine Labs - workwithus@twinenginelabs.com<p>We're an award winning, cutting edge design and engineering shop. We bootstrapped our company from two people (designer and engineer) to 11, and along the way learned a lot of lessons. A few of them are:<p>1. Building tools that make our jobs easier in the future is smart and gives our agency an edge. You will be expected to constantly try to improve our process, and your voice will be heard.<p>2. Following that point, if you think something should change? Do it. Let me know about it (CEO), get buy in from the other engineers, and don't wreck our timelines. But stop talking and start doing!<p>3. Salespeople will never estimate your project officially. Ultimately, I will bring in a project, lay it in front of you, and ask the team to do a planning poker session. Your velocity is set at a scant 10 points, and the timeline is bid against that initial velocity. Under promise, over deliver.<p>4. If you estimate poorly, you are expected to fix it. If the project just went off the rails due to things out of your control, then your feet won't be held to the fire, but if it's genuinely your fault, fix it. It's completely in your control.<p>5. Try the impossible. We built The Fantastic Flying Books of Mr. Morris Lessmore, an impossible feat for it's day. We've built complex interfaces for Cisco, Symantec, and now are working with O'Reilly. Don't be afraid to use 2D Game frameworks if you have to. People don't contract Twin Engine Labs to do the status quo.<p>6. Be a full stack engineer. Know iOS but not Rails? Talk to us. Know Rails but not iOS? Talk to us. You will be placed in projects of your capacity, but very quickly ramped up to both  platforms. We expect you to know everything from server deployments to iOS deployments, to Postgres optimization to Core Data optimization, from caching in Restful APIs to caching NSURL connections. Being a full stack engineer allows you to move faster than every other shop out there.<p>7. Finally, work directly with the customer. You, as the engineer, will always be expected to speak with the customer faster than I can. I will <i>always</i> give you air cover when you need it (and I typically can see that coming from a mile away). As well, you'll hear their requirements from their mouths (no games of telephone here), and get to ask them questions, with the safety net that I always stand behind our employees.<p>Perks? Multiple projects in a year, constantly learning the cutting edge techniques, and some seriously huge names under your belt.<p>Our environment is flat. No Pointy Haired Bosses allowed or bean counters here. Paint yourself purple, turn yourself upside down, and spin around three times while you code. As long as you deliver, I don't care how you do it.<p>Employees come into work at what is a reasonable hour to them. Our employees set their own start times, with flexible work at home situations when required. Most of them come into work because... well... we like each other :)<p>Intrigued? Talk to us. We've helped multiple entrepreneurs sink funding, watched multiple apps receive awards, and are known in our region and nationally.","time":1344911484,"type":"comment"}