{"by":"JGreenberger","id":10007059,"parent":9996333,"text":"Bright (YC W15) | Full Time | San Francisco<p>Bright is hiring a Software Engineer to help bring solar to developing countries - more here: www.thinkbright.mx&#x2F;jobs<p>You’ll help build out Bright’s technology – a wide range of projects, including:<p>- Building an automated solar monitoring and alerting system from scratch (data analysis + visualization, solar modeling).\n- Data integrations with existing Mexican energy infrastructure (reverse engineering, API integrations).\n- Design &#x2F; architect &#x2F; implement a web platform for homeowners, local solar partners, and financiers (web technologies, API design, backend software).\n- Working with finance, operations, investors and customers to develop a deep empathy for Bright’s end users, iterating quickly.<p>Here’s what we’re looking for:<p>- 5+ years of professional full-stack experience. You’ve led development in large projects before. You’ve built stuff from the ground up before. You’ve used a well-known web framework before (Django&#x2F;Python, Rails&#x2F;Ruby, etc.).\n- Working knowledge of ops and efficient monitoring. You’ve carried a pager before. We’re on AWS+Docker.\n- Versatility: In addition to having an intimate knowledge of the whole web stack, you understand how all the pieces fit together (front-end, database, network layer, etc.) and how they will impact the performance of our platform.\n- Practical experience with unit testing and functional testing.\n- Experience working with various relational databases (Postgres, MySQL, etc.), non-relational databases (Redis, Cassandra, etc.), and caching systems (memcached).\n- Strong opinions on technology decisions. We’re currently using React backed by Node.js, but we’re open to the right tool for the job.\n- Strong architecture skills. You know how to build highly scalable, robust, and fault-tolerant services that support our unique rate-of-growth requirements.\n- Prior startup experience and product intuition is a plus","time":1438731329,"type":"comment"}