{"by":"spyrosg","id":10003000,"parent":9996333,"text":"RCDevs | Esch-sur-Alzette, Luxembourg | Full Time, ONSITE | Systems integrator<p>RCDevs is a Luxembourgish software development company that sells authentication software and services around network security. We have business around the world with all kinds of clients. We tend to focus on good engineering and the quality of our customer support. You can find us at <a href=\"https:&#x2F;&#x2F;www.rcdevs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rcdevs.com</a> .<p>Your job will consist in:<p><pre><code>  - integrating our product into the infrastructure of clients who are trying out,\n    installing or maintaining our main product,\n  - consult for local clients that ask for additional services around our product.\n    This usually involves network security topics and some system administration, \n  - program and write documentation during downtime.\n</code></pre>\nAll this is mostly done in English, so a certain level of fluency in the language is mandatory.<p>If you are a recent graduate, we expect you to:<p><pre><code>  - know your way around Linux (having played with Ubuntu in a VM is not enough\n    -- have some war stories about shell programming? now we&#x27;re talking),\n  - know how to troubleshoot common networking problems (&quot;why isn&#x27;t that packet\n    getting to the internet?&quot;),\n  - prove that you are dedicated to your discipline. If you are jobless we expect\n    you have the time to have a small project demonstrating your ability. A small\n    AWS network, a script to solve an interesting puzzle, anything.\n  - You will get enough mentoring to progress in your skills, but we expect\n    you to be resourceful.\n</code></pre>\nIf you are more seasoned, we are interested, in addition to the former listing, in any experience you have with the stuff we usually deal with:<p>RADIUS, LDAP, Web services, EAP, OpenID, SAML, OAuth, PHP, C, Linux administration, PKIs, SSL&#x2F;TLS, HTTP, Active Directory and network security. If you have some deep experience in another technical skill, we cannot promise you will get to practice it here, but we are interested still.<p>Those criteria are what we believe will make you successful in this position. If these do not describe you, but you still believe you could be right for the job, feel free to surprise us. The important thing is that you get the job done well, the client is happy, and we enjoy having you as a colleague.<p>Most of the office speaks french, although we do not require you to know the language. (But if you want to learn, all the better!)<p>If you want to know more about the company, the job, or to apply, send us an informal email at jobs@rcdevs.com.","time":1438692336,"type":"comment"}