{"by":"sfanning95","id":10002336,"kids":[10018705],"parent":9996333,"text":"Improbable | Multiple Software Engineers | Full Time, ONSITE LONDON, UK<p>(<a href=\"http:&#x2F;&#x2F;improbable.io&#x2F;life-at-improbable&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;improbable.io&#x2F;life-at-improbable&#x2F;</a>)<p>Improbable is developing an operating environment that makes building simulated worlds possible. Worlds which can be run in real time, simulating the behaviours and interactions of millions of entities. Spaces with their own rules and properties that a multitude of people can simultaneously change, explore and visualise in as many different ways as developers can imagine.<p>Simulated worlds provide unique insight to those asking questions of complex systems. As well as enabling completely new experiences in gaming, simulated worlds can solve significant problems in areas as diverse as defence, energy, city efficiency, health, and finance.<p>We are hiring across multiple teams within the business including:<p>- Building our base real-time distributed simulation platform\n- Applying our real-time distributed simulation platform to gaming\n- Building revolutionary new online games backed by our simulation platform\n- Applying our real-time distributed simulation platform to other verticals<p>Check out: <a href=\"http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;parmyolson&#x2F;2015&#x2F;05&#x2F;27&#x2F;improbable-startup-simulations&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;parmyolson&#x2F;2015&#x2F;05&#x2F;27&#x2F;improbable...</a><p>#38 on MIT list here: <a href=\"http:&#x2F;&#x2F;www.technologyreview.com&#x2F;lists&#x2F;companies&#x2F;2015&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.technologyreview.com&#x2F;lists&#x2F;companies&#x2F;2015&#x2F;</a><p>Interested in hearing from both Interns and experienced hires. In some circumstances we can sponsor visa&#x27;s for exceptional talent. Currently 20+ open positions with more in the pipeline - email me directly if you don&#x27;t see anything that quite matches your skills (Sean@improbable.io)","time":1438679782,"type":"comment"}