{"by":"panamafrank","id":10000191,"parent":9996333,"text":"Spiffy | Berlin &#x2F; Europe | Senior Go &#x2F; Golang Developer(s) | madebyspiffy.com&#x2F;jobs | REMOTE | PART-TIME<p>We&#x27;re small startup building a whiteboxed dispatch system to sell initially to taxi firms, we are a distributed company and work 100% remotely, 95% of costs are wages, we have no VC funding and pay our own way via revenue. We offer a paid trial month. As for the product we&#x27;ve found &quot;market-fit&quot; and we&#x27;re now iterating towards a robust scalable finish.<p>As a developer at spiffy you only work 20 hours a week, all we require is that you&#x27;re around in the afternoon, there&#x27;s no hierarchy &amp; no management, we work in small vertical teams and you&#x27;re expected to decide, design, implement, maintain &amp; support. The wage (for everyone) is €3000 per month + VAT for now but you&#x27;re employed as a consultant (less tax) and can take on other projects at the same time, not enough to live in London or Zurich but enough to live somewhere with a nice beach or even in Berlin (like me).<p>As for tooling, we use github, jenkins &amp; slack and we&#x27;re always constantly improving. There are no skype calls, no meetings of any kind, no standups, no performance reviews, just open and honest communication.<p>We are only looking for senior developers (3+ years) at this moment who can be around in the afternoons Central European Time<p>I personally would like to work with someone who employs TDD pragmatically and writes clean maintainable code. Who is widely read, possessing a depth of experience and able to bring ideas to the table. Experience building, operating &amp; testing distributed systems would be a massive plus.<p>At the moment we&#x27;ve developed a microservice architecture on app engine and we&#x27;ll be moving to containers in the near future. We don&#x27;t expect you to have three years of Go experience but you need have something in Go&#x2F;Golang to show us.<p>Just write a short cover letter detailing your past projects and what you&#x27;ll bring but don&#x27;t forget to indicate that you&#x27;ve read into what the company is about. Multi stage interviews are too resource consuming so if we like your application and you come across well in the interview then we&#x27;ll invite you for a paid trial month.<p>Email us at hello@madebyspiffy.com","time":1438639127,"type":"comment"}