{"by":"piavpn","id":10001064,"parent":9996333,"text":"Private Internet Access | West Hollywood, CA or REMOTE | Full-Stack Ruby and JavaScript Engineers<p><a href=\"https:&#x2F;&#x2F;www.privateinternetaccess.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.privateinternetaccess.com&#x2F;</a><p>We&#x27;re one of the world&#x27;s leading VPN service providers and are looking to grow our team with people who care about privacy and freedom. We are focusing on improving the entire customer experience of our product and service, everything from the website, customer portal, internal tools, to our VPN clients.<p>While we&#x27;re looking for well-rounded full-stackers, we have a couple of different focus areas:<p>* Ruby generalists who are intimately familiar with Rails<p>* Front-end JavaScript engineers who have experience with client-side frameworks like React and Flux<p>Our stack, including infrastructure and deployment tools, is completely Ruby-based. Our desktop VPN clients are built with Ruby and web technologies. Our ideal candidates should have extensive experience with one or more of the following:<p>* Payments provider integration and subscription management (e.g., Stripe, PayPal, Amazon, etc.)<p>* Performance optimization of the site itself, database schema and queries, etc.<p>* Affiliate program implementation and third-party integrations<p>* Cross-platform (Mac, Windows, Linux) app development using web technologies (Titanium, node.js, Electron&#x2F;Atom, etc.)<p>We&#x27;re a remote team (unless you happen to be based in the LA area, in which case you&#x27;d want to come work from our beautiful office in West Hollywood hills), and all of our collaboration happens over Slack and Trello, with the occasional email.<p>Email jobs@privateinternetaccess.com with your resume and&#x2F;or links to projects you&#x27;ve worked on, a link to your GitHub (or some other site where we can see your code), and what makes you interested in our company. Don&#x27;t forget to mention you&#x27;re from HN!","time":1438651199,"type":"comment"}