{"by":"lespider","id":10000532,"parent":9996333,"text":"tCell | Front-end&#x2F;Back-end&#x2F;Analytics&#x2F;Instrumentation | Full-time | San Francisco or Stockholm | ONSITE, INTERNS, VISA, REMOTE<p>tCell is developing the next generation solution in Application Security for the world of continuous deployment, and cloud infrastructures. Applications today are highly dynamic, change is a constant, and threats are ever-increasing. This requires a new approach to adaptively detect threats, and defend sites against those threats. We&#x27;ve assembled a team hailing from companies such as Google, Salesforace, Splunk, and Okta, and are looking to add to our core team people passionate about security, data, scalability, and in general looking to do something mind-blowingly cool.<p>Positions Open<p>Front-end Engineer - We&#x27;re looking for a solid well-rounded coder who can make front-ends that are elegant both inside and out. If you&#x27;re the right one for us, you&#x27;ll work with  designers, other engineers, and customers to create crisp interactions that enable our customers to rapidly detect and respond to attacks. In your toolkit of skills should be HTML&#x2F;CSS&#x2F;Angular.js&#x2F;jQuery&#x2F;D3.js, but more importantly, the ability to innovatively leverage new technologies that result in a front-end that delights our users. Your motto: the right UI makes it easy to think and do the right thing.<p>Back-end Engineer - We&#x27;re looking for someone who can write rock-solid, well-tested, back-end code that serves as foundation to our security solution. Our stack includes, Scala, Play, Java, Spark, and Cassandra. If you are right for us, you&#x27;ll have good intuition for API design, separation of concerns, modularity, scalability, and extensibility. Your motto: what makes a solid house, is a solid foundation.<p>Analytics Engineer - Can you build systems that ingest terabytes of data daily, and provide real-time analytics for a variety of security use cases? These include recognizing attack patterns, detecting anomalies, generating enforceable models, enabling rapid data exploration, real-time alerting, and more. The ideal candidate would be familiar with recent developments in ML libraries, and able to design analytic pipelines that make the right trade-offs to make our customers successful. Your motto: actionable information has an expiration date.<p>Instrumentation Engineer - Are you a polyglot? Are you fascinated with internals of app servers? Do you like the fact that the great thing about standard frameworks is that there&#x27;s so many of them? Then, we want you. You&#x27;ll be key in evolving our extensible instrumentation libraries to extract run-time data from various applications with very low-impact. Your motto: analytics is only as good as the data.<p>If you have expertise in security, deployment infrastructures, design, performance, etc. and have a passion for new solutions, and desire to solve hard problems, contact us at jobs@tcell.io","time":1438643697,"type":"comment"}