{"by":"Robin_Message","id":10002147,"parent":9996333,"text":"Firefly Learning | Developers | London UK | ONSITE<p>Imagine you could save every teacher in a school one hour a week. Instead of an hour of drudgery, they could be preparing their lessons, teaching or actually having a life outside the classroom. At Firefly, you can help do exactly that.<p>Firefly is a learning platform used by hundreds of schools worldwide to create, share and learn. We combine easy content creation with deep school integration to make a useful tool for class work, homework, and coursework. We’re self funded and doubling yearly.\nAs an established company serving many customers and integrating with a variety of other services, we’re continually learning how apply best practices to existing code, whilst still deploying new features and bug fixes for teachers and students every two weeks. We&#x27;re currently focusing on getting better at separating of concerns and building up an automated testing suite. We’re also improving the speed and reliability of our infrastructure, and trying new technologies to keep current (e.g. Swift and React).<p>We looking for four main strengths in you:<p>◦ <i>skill</i>: your colleagues would say you get things done. You work to a high standard, and know about and apply appropriate best practices in your work. You are at home with improving and extending existing code as well as new development.<p>◦ <i>desire to learn</i>: despite (or perhaps because of) you being good at what you do, you want to get better. You seek out best practices, new ideas, honest feedback, and unknown areas of code, in order to know more and work better.<p>◦ <i>understanding</i>: our product team is great but not infallible. You’ll be happy to challenge and clarify product decisions with our users’ best interests at heart. Similarly, our QA team is meticulous but not your babysitter. You’ll be handing something polished to QA, not throwing the first thing that compiles over the wall. Overall, everyone at Firefly shares responsibility for the product making sense and being of high quality.<p>◦ <i>clear communication</i>: We have a lightweight process, so most days, other than a morning standup meeting to share what’s going on and what’s planned, you’ll be responsible for your time. This also means that, when there are issues, you need to inform the right people, explain what’s going wrong, and help get things resolved and moving forward again.\nSpeaking of process, we have a design team who handle HTML and CSS, a product and UX team who produce clear specifications, a QA team to help us build things well, and a two-week sprint cycle for getting things done. Other than that, we’re pretty small-a agile and are happy to try things out to see what helps.<p>In terms of experience, we need you to be comfortable with iOS or a web platform. Our server-side code is written in C# and our web front end has some Javascript, so you’ll need to know these or be able to pick them up. We work as generalists, so experience of any of the following would be a positive: Android, Windows Phone, shell scripting, infrastructure automation, databases, particularly SQL Server, building API integrations.<p>We offer competitive salaries dependent on experience, a generous bonus scheme, flexible training budget, brown bag talks and a Kaizen day for self-improvement and experimentation every fortnight.\nSo, if you’ve got an interest in education and a desire to learn your craft alongside others making the same journey, we want to hear from you. Drop me an e-mail (robin at fireflylearning.com) or apply on our website – <a href=\"http:&#x2F;&#x2F;fireflylearning.com&#x2F;join-our-team&#x2F;jobs&#x2F;developer\" rel=\"nofollow\">http:&#x2F;&#x2F;fireflylearning.com&#x2F;join-our-team&#x2F;jobs&#x2F;developer</a>","time":1438674865,"type":"comment"}