{"by":"haas-teki","id":10016314,"parent":9996333,"text":"Recruitics | New York City | Full Time (on-site only) | www.recruitics.com<p>About Recruitics: We&#x27;re a profitable and well-funded start-up located in Midtown Manhattan. Recruitics is working to help companies better understand the hiring process. Our analytics platform helps HR departments make intelligent, data-driven decisions about the jobs they post online so they’ll get a higher return on their investment. Recruitics feels like a family. We&#x27;re about 50 employees strong with our HQ in Manhattan, near Bryant Park. Recruitics Engineering is currently 5 folks working full-time with an off-shore team we engage with closely. The team goes out and celebrates quarterly goals, has a book club, and goes to Escape the Room challenges. It&#x27;s a great opportunity to come in and work on an established code base, make it better, and develop some really awesome new products as we expand our team.<p>We have three roles we&#x27;re looking to fill, but that doesn&#x27;t mean we&#x27;re stopping at only three more folks.<p>Core Team: Are you familiar with Java or C#? Is there at least one major programming language you&#x27;re familiar with? Used a relational database like MS SQL or Postgres? Have you written any stored procedures or functions?Have you lead a team of engineers? Have some experience with project organization and mentoring?<p><a href=\"http:&#x2F;&#x2F;jobs.recruitics.com&#x2F;job&#x2F;Software-Engineer-Senior-New-York-New-York-46170210\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.recruitics.com&#x2F;job&#x2F;Software-Engineer-Senior-New-...</a><p><a href=\"http:&#x2F;&#x2F;jobs.recruitics.com&#x2F;job&#x2F;Software-Engineer-Core-Platform-New-York-New-York-46170207\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.recruitics.com&#x2F;job&#x2F;Software-Engineer-Core-Platfo...</a><p>Client Integrations Team: Have you used Ruby professionally? Worked with a number of neat Javascript libraries? Have a working familiarity with relational databases?<p><a href=\"http:&#x2F;&#x2F;jobs.recruitics.com&#x2F;job&#x2F;Ruby-Developer-New-York-New-York-46170203\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.recruitics.com&#x2F;job&#x2F;Ruby-Developer-New-York-New-Y...</a><p>If you have any questions at all, feel free to email me, Patrick, at patrickd &lt;at&gt; recruitics.com or one of our great HR guys, Chris, at christopher &lt;at&gt; recruitics.com. I encourage you to look at our listings and apply or email us, we&#x27;d be happy to answer any questions you may have!","time":1438868754,"type":"comment"}