{"by":"kristinachung","id":10039242,"parent":9996333,"text":"MileIQ <a href=\"http:&#x2F;&#x2F;mileiq.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mileiq.com</a> @ San Francisco, CA<p>Android UI Engineer [ONSITE)<p>You are an enthusiastic Android developer with a passion for great user experience, interface and design. You take pride in seeing others interact with your work and take feedback through user testing very seriously. You like to prototype and iterate with code, then polish and ship.\nWho are we:\nMobile Data Labs is dedicated to the self-directed workforce. These hard-working individuals get out of bed each morning and make their own success. They’re the lifeblood of the economy, already 55M strong in the US alone and growing fast. Mobile Data Labs designs products and services to automate time consuming tasks, turning data into useful information, while saving time and money.\nOur first service, MileIQ, is having an incredible reception; top grossing finance App in AppStore 15 months in a row, five star average review and a very engaged user base.\nResponsibilities\nCollaborate closely with product and designers with a focus on new feature design and prototyping\nBe involved in the user experience design process, from wireframes and mockups through to implementation and release\nWork closely with designers, product owners and developers to define and implement elegant solutions to interesting problems\nHelp define and maintain visual guidelines and consistency throughout the app\nFast prototyping of new user interactions and iteration based on feedback from peers\nRequirements\nProven track record of releasing features and functionality into the hands of users\nA portfolio of applications or demo apps that illustrates thoughtful or unique user interaction and design\nExperience building complex animations, custom or unique interactions, or better, a combination of both!\nA keen interest in interaction design, usability and aesthetics in user interface design\nThrives on collaboration, constant feedback, iteration and always looking to learn from others\nExperience and comfort working in an agile and collaborative environment\nA balanced approach to pixel perfect design vs. good enough to ship\nSome experience using design tools like Adobe Creative suite tools, Sketch or wireframe tooling is a huge plus\n3+ years of Android or mobile development experience\nBachelors or Masters in Computer Science or a related field\nIf you believe in user-centric design, finding elegant and simple solutions to complex and challenging problems and excel at solving real issues for real people, we’d like to talk to you.\nWe work in a fantastic office in San Francisco that is close to public transportation. We organize in small cross-functional teams with sprints, daily standups, retrospectives and demos. Transparency, communication and accountability are core values.<p>Send resume to kristina@mileiq.com for immediate consideration!","time":1439271134,"type":"comment"}