{"by":"sumana25","id":10059716,"parent":9996333,"text":"Software Engineer at Telenor Digital AS - Trondheim, Norway<p>Permanent position, Full-time You can apply at - <a href=\"http:&#x2F;&#x2F;tinyurl.com&#x2F;nc9okjm\" rel=\"nofollow\">http:&#x2F;&#x2F;tinyurl.com&#x2F;nc9okjm</a><p>We offer a position that will make you part of a hard core software development house. You will join a team of world class developers that feel strongly about what they are making.<p>About the job \nWe are a growing bunch of software engineers, working on an ever-changing list of exciting projects. Working in Telenor Digital gives us the tremendous opportunity to reach millions of users, across borders, cultures and languages, with our code, with the flexibility to choose the technology that does the job best. Exciting challenges at huge scale and high speed!<p>If this is you or who you want to be, we want to hear from you:<p>We want coders that are challenged by complex problems in distributed environments, but value simplicity in their solutions. We want software designers that look at the entire system and think like engineers - you look for data to validate your assumptions, you create tests to verify your implementations, you know your tools, and you look for opportunities to automate everything. You want to learn how all the parts work together - you want to know what it takes to run your code in a global production environment as much as you care about writing and debugging it.<p>You have a M.Sc in Computer Science or equivalent experience, and have worked with various programming languages, like Java, Go, Scala, C++ or Python. You are excited by distributed systems, cloud computing, and service-oriented architectures. You keep your code in a version control system, possibly distributed like git or mercurial, and you use more than your brain to keep track of your ideas and bugs. We don’t care if you’ve used the technologies we’re currently working with before. We DO care that you think they’re cool and something you want to work with.<p>We want smart people who will fight for their point of view because we’re often wrong, we just don’t like admitting it. We want co-workers who want to constantly learn new things and are capable of fluidly moving between projects. We want teammates who can quickly become subject matter experts in new areas and share that knowledge with the team and with the company. We want colleagues who take pride in what they do and want to share it with the world. We want engineers who are excited by contributing to open source projects, writing blog posts and speaking at conferences. We want people who want to dive into projects supporting Telenor’s business units all over the world.<p>The position is located in Trondheim. \nWe conduct background checks on relevant candidates.","time":1439554537,"type":"comment"}