{"by":"leemac","id":9996546,"kids":[10002287],"parent":9996333,"text":"Ledgex Systems - Full Time&#x2F;On-Site - Boston, MA (<a href=\"http:&#x2F;&#x2F;ledgex.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ledgex.com</a>) – Microsoft Stack<p>We’re a small software company that spun out of an IT firm called Eze Castle Integration. We built a platform that focuses on the delivery of high end investment management applications to the fund of fund, hedge fund, family office and private equity communities.<p>I’m one of the founding engineers and head of the small web development team. My team is looking to expand with two software engineers to help with our Web app and desktop applications.<p>== Our Stack ==<p>Microsoft stack for the most part and we like to keep up to speed with the industry:<p><pre><code>  * ASP.NET&#x2F;C# (Targeting ASP.NET 5 support in next year or so)\n\n  * BackboneJS&#x2F;MarionetteJS\n\n  * WPF&#x2F;C# desktop client\n\n  * MSSQL (Views&#x2F;Stored Procedures&#x2F;Functions&#x2F;SQLCLR)\n\n  * SaaS offering hosted on Azure, on-premise is an option for clients as well\n</code></pre>\n== The Position ==<p>Full-Stack Software Engineer to provide hands-on development with new \nand existing features and products. The candidate will focus on the ASP.NET-backed platform, various backend services, Web APIs and underlying architecture of the web platform which relies heavily on a MSSQL database.<p>== Who we’re looking for ==<p><pre><code>  * 3-5+ years as a developer using ASP.NET, C# and SQL\n\n  * Ability to design and implement solutions that adhere to the basic principles of SOLID\n\n  * Strong written, verbal and interpersonal skills\n\n  * BS&#x2F;MS Computer Science or equivalent degree\n</code></pre>\nSorry, we can’t sponsor at the moment.<p>More details + apply here: <a href=\"https:&#x2F;&#x2F;rew31.ultipro.com&#x2F;EZE1000&#x2F;JobBoard&#x2F;JobDetails.aspx?__ID=*FD66311B6C6D9B78\" rel=\"nofollow\">https:&#x2F;&#x2F;rew31.ultipro.com&#x2F;EZE1000&#x2F;JobBoard&#x2F;JobDetails.aspx?_...</a>","time":1438615078,"type":"comment"}