{"by":"mocko","id":9996410,"parent":9996333,"text":"London, UK | Permament | ONSITE<p>Lost My Name is on a mission to make kids mindful, kind and curious. We combine the power of stories with the possibilities of technology, to create magical, personalised experiences for kids and their families.<p>One key hire for us is a DevOps Engineer to join our team based in East London.<p>Everybody nowadays calls themselves DevOps. We really mean it: dev and ops, living together in perfect harmony. While part of the infra team, you&#x27;ll be sat with developers and expected to steer their work towards the most robust, host-able, cloud-shaped solution you can to fit on our growing architecture. You&#x27;ll need a heap of technical experience together with strong opinions and the communication skills to put them across.<p>• We&#x27;re a heavy AWS user and you&#x27;ll need to be proficient with services like EC2, Route 53, CloudFront, IAM and VPC&#x27;s. Because of this we’d like you to have considerable experience running web hosting environments with at least one hosted on AWS. You might even have built your own.<p>• We use a lot of Ruby plus Node.js and Go. How about you? If you’re proficient in at least one high-level programming language that would be really useful<p>• We currently use Chef as our configuration management system. We’d really like to speak with someone who has experience with this or at least one other configuration management system<p>• Do you container? We might start. Come lead the way!\nTroubleshooting &amp; performance work at the level of single hosts and at the network level with CDN&#x27;s and caching<p>• Building deployment and testing systems<p>• Configuring &amp; tuning monitoring systems and all the usual systems admin plumbing. Do you know how to deal with most of DNS, SSH, SSL, DHCP and at least two Linux distributions?\nPackaging new applications from developers and for regular (&amp; possibly continuous) deployment to production<p>• Should be better than me at formatting HN job posts<p>No recruiters please.<p>Full job spec @ <a href=\"http:&#x2F;&#x2F;making.lostmy.name&#x2F;listings&#x2F;DevOps\" rel=\"nofollow\">http:&#x2F;&#x2F;making.lostmy.name&#x2F;listings&#x2F;DevOps</a>","time":1438614406,"type":"comment"}