{"by":"kcrossisec","id":9996754,"parent":9996333,"text":"NCC Group (formerly Matasano Security, iSEC Partners, and Intrepidus Group) - Austin, Chicago, New York, San Francisco, Seattle, and Sunnyvale, CA<p>Maybe you&#x27;ve been a builder, but have always thought breaking seemed more fun? Maybe you&#x27;re a seasoned information security veteran looking for dedicated research time? Maybe you&#x27;ve always been intrigued by security, but never had a clear path for how to get started? Maybe you are an infosec wunderkind looking for a place where you can be exposed to a myriad of technologies and products over the course of a year? Maybe you mistyped a web address and somehow wound up here? With the exception of that last example, we&#x27;d love to hear from you!<p>Many of you will be familiar with NCC Group&#x27;s legacy US names - Matasano Security, iSEC Partners, and Intrepidus Group. We&#x27;re now all officially integrated under the NCC Group name and one happy family.<p>The bottom line: if you love security and research, NCC Group just may be a perfect fit for you.<p>What do we do exactly? Penetration testing, security analysis, and cutting-edge research into current technologies and attacks (breaking things). You spend most of your day thinking about security systems and how they can break. You get to be creative and have a lot of freedom to be clever while learning new technologies at a very fast pace. Engagements are usually 2-4 weeks long and in a year you will be exposed to 15-20 products and technology stacks. Your work will typically initiate person-months of security improvements in products millions of people use. You will have access to senior engineers&#x2F;architects and your findings&#x2F;ideas will be heard by senior decision makers. You will have enormous impact in making the software people use safer. All of our consultants are also security researchers, with dedicated research time. Not too shabby!<p>If you want to learn more about us check out our:<p>Blog - <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;</a><p>Cryptopals - <a href=\"http:&#x2F;&#x2F;cryptopals.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com&#x2F;</a><p>Microcorruption - <a href=\"http:&#x2F;&#x2F;microcorruption.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;microcorruption.com&#x2F;</a><p>Research - <a href=\"https:&#x2F;&#x2F;isecpartners.github.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;isecpartners.github.io&#x2F;</a><p>If you&#x27;re ready to apply, contact us at: <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;careers&#x2F;</a>. We&#x27;d love to hear from you!","time":1438616167,"type":"comment"}