{"by":"DLarsen","id":9996550,"parent":9996333,"text":"Connexity - Camarillo, CA (Los Angeles area) | on-site | <a href=\"http:&#x2F;&#x2F;connexity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;connexity.com</a><p>Are you interested in learning advertising tech from the inside out? We&#x27;re looking for an eager software engineer who takes their personal development seriously and seeks to make a huge impact.<p>You&#x27;ll be working alongside a tight, driven team right in the heart of the profit center. Our division of Connexity works in online display advertising (aka &quot;banner ads&quot;) through RTB, and we run 50 to 100 million impressions each day. Our total transaction volume is between 5 and 10 billion per day, and I&#x27;d bet you a burger we&#x27;ve served ads on nearly every site you&#x27;ve ever visited.<p>We&#x27;re primarily looking for someone to contribute to our Ruby on Rails app. It&#x27;s used to administer hundreds of advertising campaigns across hundreds of publisher sites. It&#x27;s not just boring CRUD. It provides a ton of control and insight to the team that operates our clients&#x27; campaigns; it&#x27;s truly the heart of our display advertising business. The business folks will know you, and you&#x27;ll find that excellence will stir up a tremendous amount of appreciation for your work.<p>This role is a great way to learn advertising tech at scale as well as other tools. In addition to Rails work, you&#x27;d get hands on experience with Redis, Hbase, PostgreSQL, R and Scala. Several on the current team started in the Rails app and have moved into other areas of interest (low-latency RTB bidder written in C, sophisticated reporting pipelines or novel optimization algorithms).<p>Our team is sharp and works well together. We enjoy perks such as daily paid lunch, a 9&#x2F;80 schedule (to get every other Friday off) and unlimited vacation; the culture of our team recognizes and respects the importance of your non-work life. Also, Ventura county is a pretty nice place to live&#x2F;work (unless you hate temperate coastal weather). If you&#x27;ve got Rails or other relevant web app experience, that&#x27;s a good start. More importantly, you&#x27;ll be eager to learn display advertising inside and out. Attitude, ambition and sound judgement trump experience with a specific set of tools.<p>We&#x27;re a small team within a medium-sized organization, and we work hard to keep the small-team vibe while availing ourselves of the best bits from the mother ship.<p>Unless you prefer to start with a HR-oriented chat, you can reach me (a lead engineer on the team) at david.larsen@connexity.com.","time":1438615101,"type":"comment"}