{"by":"mattzito","id":9996783,"parent":9996333,"text":"Synthesio - <a href=\"http:&#x2F;&#x2F;www.synthesio.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.synthesio.com</a> | Multiple positions | Remote or NYC<p>We&#x27;re one of the leading social media analytics companies - every month we pull in &gt;2bn pieces of social data, and allow our users to slice and dice that data to answer all sorts of interesting questions, like:<p>- Why are people buying our products vs. our competitors?<p>- What people on social media are driving discussion about our brand?<p>- How can we calculate what subjects are getting people excited about a particular political candidate?<p>I&#x27;m the VP product here in NYC, while our engineering team is in Paris.   I&#x27;m looking to hire a couple of positions reporting to me, and then we&#x27;re hiring a bunch of folks throughout the organization.<p>Solutions Engineer - <a href=\"http:&#x2F;&#x2F;synthes.io&#x2F;1IAxN5A\" rel=\"nofollow\">http:&#x2F;&#x2F;synthes.io&#x2F;1IAxN5A</a><p>This is a presales engineer role, but with some fun extras.  Since you&#x27;re reporting with the product organization and R&amp;D, we spend more time working on product strategy and partnerships than a typical SE does.  The ideal candidate will be someone who can talk APIs and implementation plans as well as a deep and abiding interest in big data and social analytics.  This position is ideally based in NYC, but open potentially to remote for exceptional folks.<p>Functional QA Manager - <a href=\"http:&#x2F;&#x2F;synthes.io&#x2F;1KMaTw0\" rel=\"nofollow\">http:&#x2F;&#x2F;synthes.io&#x2F;1KMaTw0</a><p>We&#x27;re looking for someone to drive our QA and testing strategy forward - how do you test a platform that can analyze data across hundreds of different metrics, with millions of different sources?  How much can be automated vs. what needs to be done by people?  What do the right test plans look like for extremely complex scenarios?  This position could be remote, or NYC.<p>There are links to the job postings next to the title, you can always feel free to email me at mzito@synthesio.com if you have any questions or comments, or you can also reach out to our internal recruiter at syard@synthesio.com.<p>For the rest of our job postings, take a look at: <a href=\"http:&#x2F;&#x2F;synthesio.applytojob.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;synthesio.applytojob.com&#x2F;</a>","time":1438616312,"type":"comment"}