{"by":"dleffel","id":9996454,"parent":9996333,"text":"Crew Messaging - <a href=\"http:&#x2F;&#x2F;crewapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;crewapp.com</a>\n* Onsite roles in San Francisco\n* Hiring an Android Lead <a href=\"https:&#x2F;&#x2F;crewapp.com&#x2F;jobs&#x2F;android\" rel=\"nofollow\">https:&#x2F;&#x2F;crewapp.com&#x2F;jobs&#x2F;android</a> and iOS Lead <a href=\"https:&#x2F;&#x2F;crewapp.com&#x2F;jobs&#x2F;ios\" rel=\"nofollow\">https:&#x2F;&#x2F;crewapp.com&#x2F;jobs&#x2F;ios</a>\n* Market Salary and generous equity\n* Founded in January, seed round funded ($1.9M)\n* Launched in March, already top 100 Business app (Google Play &amp; iTunes)<p>About Crew<p>Crew is a productivity platform for iOS and Android that is geared to deskless workers (e.g. service industry, restaurant, retail, medical, manufacturing, and more!). In the tech industry, we have been on the receiving end of some killer productivity apps. Some of our favorites include Asana, Yammer and Slack. These apps have completely changed the way we work… unless you’re part of the half of the economy that doesn’t sit at a desk. Try using these apps 100% of the time on a mobile device and you’ll likely grow frustrated. Worse yet, these apps were imagined using the use cases of product managers and engineers, not bartenders, hotel workers, contractors or similar jobs. The existing apps are just too hard to use and fundamentally miss on solving the problems workers in these industries face.<p>Crew tries to take what we’ve learned about productivity for desk-bound workers and make that more compatible for other industries. Crew currently consists of multiple “modules”: Messaging — Before using Crew, many of our users were using a mix of text messages and emails, with some using consumer messaging apps like WhatsApp and GroupMe. Crew makes messaging much easier by allowing a manager to add employees to a central directory, enabling employees to communicate without trading phone numbers (both a convenience and actually a safety concern in some companies). Scheduling — Coordination around shifts is one of the top concerns in the businesses of many of our customers. Employees have shift schedules which can vary from week to week and employers get burned when shifts are busted (no-shows). Crew makes it easy to post the shift schedule and then coordinate shift swapping when necessary. Task Management — Did you know that many restaurants have a “chore board” in the back? An actual chalkboard or piece of paper posted letting everyone know what has to get done today. Tasks replaces the chore board with a ticketing system.<p>We have new modules currently under development but what we’ve released thus far has already received a warm reception. Despite only having been available since April, Crew is growing very fast and is frequently ranked in the top 100 Business apps on both Google Play and iTunes. The traction we’ve gotten has helped us raise a seed round. Our backend is a highly automated deployment in EC2 that utilizes auto scaling along with many AWS features. Currently our client consist of an iOS, Android and Webapp utilizing a common infrastructure to communicate. The communication and data infrastructure is written in Node.js and Java (Spring) with heavy reliance on Mongo, Redis and ActiveMQ. This stack allows us to meet our goal of having a linear scalable application that targets zero downtime. The webapp is a Node.js Express application that utilizes Backbone, Require.js and Bootstrap to deliver a responsive and highly performant experience.","time":1438614662,"type":"comment"}