{"by":"timspratt","id":9996641,"parent":9996333,"text":"Permutive (YC S14) — London, UK — <a href=\"http:&#x2F;&#x2F;permutive.com\" rel=\"nofollow\">http:&#x2F;&#x2F;permutive.com</a> — ONSITE<p>We&#x27;re focused on understanding and recommending content at scale. We use ML&#x2F;NLP techniques to algorithmically understand the meaning behind content and make sense of people&#x27;s wide and nuanced interests based on their behavior. Engaging content is the future of online monetization, and we&#x27;re building the intelligent infrastructure for deploying revenue-generating content.<p>We have a ton of interesting problems to solve. We&#x27;re constantly ingesting vast numbers of documents to learn from, tracking millions of interactions with content, computing the interests of millions of users, and making personalized real-time recommendations. This scale impacts every engineering decision we make, and we&#x27;re looking to build a company with people excited by the challenges it poses.<p>You&#x27;ll want to have interests or experience in some of the following:<p>* Working extensively in functional languages (we mostly use Scala, with Akka, Spray, Scalaz; some Haskell).<p>* Building large-scale distributed systems (we run a microservices architecture on AWS)<p>* Designing and implementing proprietary machine learning models and real-time personalized recommendation systems<p>* Rapidly iterating and scaling a front-end product (designing UX and UI, HTML&#x2F;CSS &amp; React, etc.)<p>We&#x27;re a VC and Y Combinator-backed startup at the beginning of our journey. As one of our first engineers you&#x27;ll play a central role in defining our tech culture and direction. There&#x27;s a huge opportunity to effect change at scale through real responsibility and ownership of product. And because at this early stage there&#x27;s so much to do, there&#x27;s so much to learn and room to grow!<p>To apply, please head over to <a href=\"https:&#x2F;&#x2F;permutive.workable.com&#x2F;jobs&#x2F;72041\" rel=\"nofollow\">https:&#x2F;&#x2F;permutive.workable.com&#x2F;jobs&#x2F;72041</a>","time":1438615570,"type":"comment"}