{"by":"mtsmith85","id":9996366,"parent":9996333,"text":"Senior Engineer | Ellevest | New York, NY (onsite)<p>(Job description, including interview process, is online here: <a href=\"http:&#x2F;&#x2F;ellevest.com&#x2F;careers&#x2F;senior-engineer-client-platform.html\" rel=\"nofollow\">http:&#x2F;&#x2F;ellevest.com&#x2F;careers&#x2F;senior-engineer-client-platform....</a>)<p>== Our Company<p>We’re a well-funded, early-stage tech startup based in NYC that is reinventing financial services for women. We’re currently in stealth mode building a new kind of investment platform, which has the potential to be a disruptive and meaningful force for good. Our team has deep, successful roots in the startup and finance communities.<p>== The Role<p>We’re looking for a Senior Engineer to help develop our investment platform product. We’re looking for an engineer that has at least two years of professional experience writing code in Ruby. You have experience writing well tested code with tools like RSpec,Cucumber or Minitest. A strong attention to detail, a yearning to write well-tested, continuously-integrated code and an interest in developing software from the ground up are attributes that describe you. You work well both independently and as part of a team. You have experience writing well organized, object oriented Ruby code that goes past the basic Rails applications. You have strong feelings about “Plain Old Ruby Objects” and have a healthy concern of “magic.” Security is really important to you, even if you don’t have a large amount of experience in this area.<p>This is a full time development role that will have great impact on our product. You will be writing core code that makes trades in the securities markets. You will participate in code reviews, help develop our best practices and coding styles, and ultimately have a big impact as our company is starting out.<p>We’re a mission-driven company with a diverse team of people who value honest and transparent communication, simple and focused execution, and work-life balance. We’re building a NYC-based team and offer market compensation and significant equity for world-class candidates.<p>== Next Steps<p>Introduce yourself to our team via e-mail by sending a cover letter and resume to jobs@ellevest.com.","time":1438614179,"type":"comment"}