{"by":"mmayerhofer","id":9996579,"parent":9996333,"text":"Digital River — Vienna, Austria, (On-Site, VISA, Full-time)<p>We are creating a microtransaction platform primarily focused on providing payment solutions for video games. We&#x27;re a small team of 15 people from all over the world (Austria, Brazil, Nigeria, India, Italy, Spain, Ukraine). We can assist in applying for a work VISA (as we already went through this whole process a couple of times).<p>We are currently looking for:<p>- Software Engineer (Java): <a href=\"http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=DIGIRIVE&amp;cws=1&amp;rid=1568\" rel=\"nofollow\">http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a><p><pre><code>  Context: You will be working on our core platform and design &#x2F; implement new features. One of our next big projects is migrating serveral components of our platform from Oracle to Cassandra.  \n\n  Stack: Spring Framework, Java 8, Hibernate, Oracle, Cassandra\n</code></pre>\n- DevOps Engineer: <a href=\"http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=DIGIRIVE&amp;cws=1&amp;rid=1584\" rel=\"nofollow\">http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a><p><pre><code>  Context: You will be working on our deployment pipline and platform infrastructure which spans multiple datacenters.\n\n  Stack: Chef, Scientific Linux\n</code></pre>\n- QA Automation Engineer: <a href=\"http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=DIGIRIVE&amp;cws=1&amp;rid=1563\" rel=\"nofollow\">http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a><p><pre><code>  Context: You will be writing automated tests for our frontend UIs as well as load tests for our platform.  \n\n  Stack: SOAP UI, CasperJS, Selenium, Apache JMeter\n</code></pre>\n- Web Developer: <a href=\"http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?org=DIGIRIVE&amp;cws=1&amp;rid=1579\" rel=\"nofollow\">http:&#x2F;&#x2F;chc.tbe.taleo.net&#x2F;chc02&#x2F;ats&#x2F;careers&#x2F;requisition.jsp?o...</a><p><pre><code>  Context: You will be implementing UIs for our stores which are accessible via game clients &#x2F; web browsers. \n\n  Stack: Javascript, CSS, HTML5\n</code></pre>\nAbout our interview process:<p>In the first round we will contact you via phone for an quick chat and give you more details on what we do and what we have to offer, this is usually a one to one conversation. Before the second round we might ask you to do a simple code exercise, which you can solve at your own pace or you can show us a project you have worked on, where you can provide us the source code. The code &#x2F; project you have provided will be discussed with at least one engineer from our team as part of the second interview round and we will try to answer all the questions you might have regarding our company &#x2F; team &#x2F; product &#x2F; etc. In the third round you will meet more people of our team, the questions asked are usually not as technical as in the second round.<p>If you have any further questions, my email address is in my profile (I&#x27;m a software engineer).","time":1438615234,"type":"comment"}