{"by":"nateps","id":9996932,"parent":9996333,"text":"Lever (YC S12) | <a href=\"https:&#x2F;&#x2F;www.lever.co&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lever.co&#x2F;</a> | San Francisco<p>Lever makes hiring software for entire company collaboration. It enables recruiters to focus their time on more strategic efforts and managers to easily participate and keep on top of what&#x27;s happening. Everyone in a company knows that Lever is a tool for them and that they are a part of growing their company.<p>We&#x27;re breaking the applicant tracking system mold, and companies from 5 to 5000 people are switching to Lever. They find that Lever is modern, well designed, and a better fit to how hiring gets done today.<p>We care deeply that the hiring process and environment at Lever is inclusive to all. We strive to make all people feel comfortable being who they are at work.<p>First and foremost, Lever is product driven company, and our founders have deep product experience from Google, Zynga, and design education at Stanford. We are also committed to innovative technology. All of our applications are written with DerbyJS (<a href=\"http:&#x2F;&#x2F;derbyjs.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;derbyjs.com&#x2F;</a>), an innovative realtime JavaScript framework. It is the only open source application framework entirely built around data syncing with Operational Transformation, the algorithm behind realtime conflict resolution in Google Docs, and formerly Google Wave and Etherpad. In addition, DerbyJS has a unique approach to optimized server and client-side rendering, and was an early pioneer in universal JavaScript rendering.<p>Lever is helping companies build the next-generation workplace, and we are starting with ourselves. We&#x27;re a small team of just 40 right now, but huge growth is on the horizon. Join us to be part of the foundational team that sets the trajectory for what this company becomes.<p><a href=\"https:&#x2F;&#x2F;www.lever.co&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lever.co&#x2F;jobs</a>","time":1438617082,"type":"comment"}