{"by":"francoisblavoet","id":9997540,"parent":9996333,"text":"Deezer - deezer.com  &#x2F;  Paris, France<p>Senior Android Software Engineer - Core Team  [VISA]<p>Press play on your next adventure! Music uplifts, it makes us get up and dance, it adds colour to life. Here at Deezer, it fuels everything we do. Want in?\nIf you’re looking for an adventure, not just a job, and you fancy seeing ideas come to life in a heartbeat, you&#x27;re in the right place. Behind the code and the pixels is the team. From all over the world, with diverse talents and skills, we&#x27;re building something incredible – together.\nNow, here’s the fun part… We are looking for an experienced Android Engineer with a passion for technology and product quality. We aim at strengthening the mobile Android team with a creative and innovative problem-solver, who is able to cope with a challenging environment.If you want to work on an app with big audience and help millions of Android users listening to their favorite artists all over the world, then join the team!<p>RESPONSIBILITIES<p>- Working closely with the whole Android team and helping them achieve their objectives.\n- Ensuring that all the code written, and the architecture is high quality and scalable\n- Improving the production process with innovative solutions and tools\n- Solving complex problems with smart solutions<p>LIFE@DEEZER<p>- Start-up environment and philosophy, right in the center of Paris\n- Highly motivated and product-focused people ready to drive innovation\n- In-house Deezer Sessions with your favorite artists, gig tickets\n- Friday drinks, summer and winter parties\n- A stocked kitchen with free drinks and snacks\n- Areas to relax and collaborate with beanbags, guitars and table football\n- An ‘at home’ vibe, with great outdoor spaces\n- Gym access at Deezer HQ, with lunch-time yoga, pilates and thai boxing classes<p>more infos and other jobs offers -&gt;   <a href=\"http:&#x2F;&#x2F;www.deezer.com&#x2F;company&#x2F;jobs_offer_description&#x2F;ogLb0fwW\" rel=\"nofollow\">http:&#x2F;&#x2F;www.deezer.com&#x2F;company&#x2F;jobs_offer_description&#x2F;ogLb0fw...</a><p>You can also mail me directly at fb@deezer.com","time":1438620139,"type":"comment"}