{"by":"kscottz","id":9998163,"kids":[10000811,9998229],"parent":9996333,"text":"Tempo Automation<p>San Francisco | On-site &#x2F; Partial remote in the Bay Area<p>About Tempo Automation:<p>Tempo Automation is a San Francisco based start up creating the electronics factory of the future from the ground up. We are developing our own software and hardware (i.e. robots) to help electrical engineers prototype circuit boards better, faster, and cheaper. Working for us means that every day you get to see physical products made from the outputs of your labor.  Our ultimate goal is to make hardware development move at the same pace as software development. We provide competitive pay, equity, health and dental benefits and generous vacation. Tempo Automation strongly values diversity; candidates of all races, genders, and backgrounds are strongly encouraged to apply.<p>Company culture and benefits:<p>* Happy and empowered employees: be kind, work hard, work smart, and live a balanced life.<p>* Do good engineering: collaborate, think, build, evaluate, improve, rinse, repeat.<p>* Happy customers: every customer is 100% satisfied 100% of the time.<p>* Make money: every day build more boards more efficiently.<p>Senior Front End Developer<p>The Job<p>* Maintain and develop our front end order website.<p>* Develop and maintain the user interface for our automated assembly robot.<p>* Develop and maintain our internal manufacturing resource planning software<p>The Candidate<p>* Bachelor or Masters degree in computer science or equivalent.<p>* Expert level javascript capabilities, python skills are a bonus.<p>* At least two years experience in the real world. We want to see that you’ve built at least one non-trivial web application.<p>* Real world experience with django&#x2F;python backends.<p>* Core developer on one or more open source javascript libraries a big plus.<p>* Capable of hiring and managing junior front end developers when the time comes.<p>* Interest or experience in rendering games or graphics intensive web applications a big plus (e.g. WebGL, html canvas &#x2F; SVG, D3, etc).","time":1438623876,"type":"comment"}