{"by":"kevinburke","id":9998237,"kids":[9998307,9998859],"parent":9996333,"text":"San Francisco, CA - Onsite or Remote - Shyp<p>Need to mail something? Request a pickup in the Shyp app, we&#x27;ll pick it up from you, package it, and find the best deal out of UPS, Fedex &amp; USPS to get your items to their location safely, cheaply &amp; on time.<p>5 server-side engineers are serving operations in 5 cities. We just raised $50m and we&#x27;re looking for engineers to help us grow.<p>Lots of interesting problems to work on, including:<p>- Dispatch and demand prediction - recently we announced we&#x27;re making all Shyp couriers full time employees, <a href=\"http:&#x2F;&#x2F;blog.shyp.com&#x2F;shyp-ceo-note&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.shyp.com&#x2F;shyp-ceo-note&#x2F;</a><p>- Standardizing shipping options and warehouse flow<p>- Scaling engineering - bit.ly&#x2F;1fZsGG7 for example<p>Some of the benefits of the job:<p>- No getting paged in the middle of the night! Open hours are 8am to 8pm.<p>- Whatever laptop setup you want, and $400 a year in travel credit.<p>- Postgres and all timestamps are UTC<p>- Everyone leaves the office at 6pm sharp.<p>We&#x27;d love to talk to you! You can&#x27;t waste our time by getting in touch. We&#x27;ll answer all your questions and tell you a little more about what our interview process looks like.<p>Please drop me a line - burke@shyp.com, or check out our jobs page - <a href=\"https:&#x2F;&#x2F;shyp.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;shyp.com&#x2F;jobs</a><p>Re: Remote opportunities - We are super interested in hiring great people who can&#x27;t move to SF. We believe our processes can support remote work, but we understand this is a hard thing for us to assert with confidence. That said, we are extremely interested in building remote-work processes that scale - let&#x27;s talk!<p>Not looking, but based in SOMA? You might be interested in our lunchtime tech talks - ping me, burke+talks@shyp.com.","time":1438624229,"type":"comment"}