{"by":"bennettweb","id":9998738,"parent":9996333,"text":"eBay - London&#x2F;Berlin - ONSITE - FULL TIME<p>eBay European Product Development (EPD) has teams in London and Berlin; we&#x27;re part of a much larger Seller Experience group globally within eBay.<p>The Seller Experience group is responsible for improving the experience of our 25 million sellers worldwide. To do this, we improve existing experiences and build new products to make the life of eBay sellers better, no matter where in the world they are based.<p>We are continually striving for the highest quality, and work in small focussed teams following bits of Scrum, bits of Kanban, with a healthy dose of Extreme Programming (p.s these aren&#x27;t buzzwords, we mean it when we say we do this stuff).<p>We need a developer with an expert&#x27;s depth and breadth of experience in building high availability, scalable applications and RESTful API. You will be proficient in teaching and leading by example, and be comfortable mentoring both junior and senior engineers. Most of our applications are written in Java, Scala or Javascript.<p>You will work with people who care about well written, test-driven, clean code, delightful user experiences and all the lovely stuff that&#x27;s involved with automatically tested, zero touch deployed applications. The team works very closely, and like to pair program on pretty much everything. Developers write their own tests, whilst learning from embedded test engineers who code.<p>We value individual contributors on the team and department level greatly, and have a fantastic culture of recognizing self starters.\nWe hope you&#x27;re getting the idea of what we&#x27;re looking for. We&#x27;re looking for great people, with an opinion, and the capability to back it up.<p>What we offer:\n* Dynamic, international teams with very skilled personalities, a passion for e-commerce, professionalism and a good sense of humour\n* A chance to interact with other teams across eBay. We will work closely with other teams across Europe and USA\n* A competitive salary, great benefits and an excellent working environment.\n* Silicon Valley amenities, such as iPhones and MacBook Pros, crazy high spec dev machines and very nice office facilities\n* An opportunity to build applications which are used by millions of people globally<p>For more information, see our careers site (yes, I know it looks a mess - I&#x27;m working on it!) - <a href=\"https:&#x2F;&#x2F;jobs.ebayinc.com&#x2F;jobs&#x2F;2324386-52000&#x2F;London-United-Kingdom-Agile-Software-Developer?lang=en-US\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.ebayinc.com&#x2F;jobs&#x2F;2324386-52000&#x2F;London-United-Ki...</a><p>Alternatively, you can find me on twitter (<a href=\"http:&#x2F;&#x2F;twitter.com&#x2F;sb_io\" rel=\"nofollow\">http:&#x2F;&#x2F;twitter.com&#x2F;sb_io</a>) or contact me via my website - <a href=\"http:&#x2F;&#x2F;www.steve.codes&#x2F;contact\" rel=\"nofollow\">http:&#x2F;&#x2F;www.steve.codes&#x2F;contact</a>","time":1438627364,"type":"comment"}