{"by":"hungerhack","id":9998146,"parent":9996333,"text":"Feeding Forward -Engineering- SF, CA (ONSITE)<p>Feeding Forward Engineering is a high-performance culture marked by fearlessness and hyperproductivity. We’re looking for fantastic experienced individuals who can work harder, faster, and smarter without sacrificing technical excellence. Our organizational challenges are unique, so you should be comfortable in uncharted territory and pumped to build systems that can support and feed cities of 100,000 and 10 million people alike.<p>As a software engineer, you&#x27;ll have a direct impact on the customer experience for both food donors and recipient agencies. Do you like our idea and want to bring it to the next level? Do you have a beef with current solutions and want to fix them? Then you should apply to join our team. We are ambitious, engaged and excited about disrupting hunger across the world. Not just another social web app: we are moving perishable food to feed real people in need around the world.<p>HERE ARE THE KINDS OF SKILLS WE&#x27;RE LOOKING FOR:<p>--Fast learner. We’re looking for software engineers who thrive on learning new technologies and don’t believe in one-size-fits-all solutions. You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment. You have advanced knowledge of at least one scripting language (e.g. PHP, Python or JavaScript) and knowledge of or eagerness to learn: MySQL, PostgreSQL, Redis, Kafka, and ElasticSearch.<p>--Fearlessness. You think a working proof-of-concept is the best way to make a point. You strive on proving that speed and quality are not conflicting; that you can achieve both at the same time.<p>--Versatility. In addition to having an intimate knowledge of the whole web stack, you understand how all the pieces fit together (front-end, database, network layer, etc.) and how they impact the performance of your application.<p>--Strong architecture chops. You know how to build highly scalable, robust, and fault-tolerant services that support our unique rate-of-growth requirements. You stay up-to-date with the latest architectural trends.<p>--Passion. You feel ownership over everything you ship; you&#x27;d never call code &quot;released&quot; until you’re confident it’s correct. You pride yourself on efficient monitoring, strong documentation, and proper test coverage.<p>--A team player. You believe that you can achieve more on a team — that the whole is greater than the sum of its parts. You rely on others&#x27; candid feedback for continuous improvement.<p>--Design and business acumen. You understand requirements beyond the written word. Whether you’re working on an API used by other developers, an internal tool consumed by our operation teams, or a feature used by thousands of customers, your attention to details leads to a delightful user experience.<p>PERKS:<p>--The rare opportunity to change the world such that everyone around you is using the product you built. We’re not just another social web app, we are moving perishable food to feed real people all over the world and reinventing hunger alleviation and logistics globally.<p>--Sharp, motivated co-workers in a fun office environment in the heart of downtown SF.<p>We&#x27;re bringing Feeding Forward to every major city in the world. We need brains and passion to make it happen and to make it happen in style. To apply, send us a resume, brief description (less than 2 paragraphs) of why you’re awesome (bonus points for humor and&#x2F;or creativity), why you want to work with Feeding Forward, what you want to accomplish, and your availability to: apply@feedingforward.com by 8&#x2F;15.","time":1438623792,"type":"comment"}