{"by":"nidx","id":9998035,"parent":9996333,"text":"ICOM Productions <a href=\"http:&#x2F;&#x2F;www.icomproductions.ca&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.icomproductions.ca&#x2F;</a> | ONSITE Calgary Alberta<p>Web Software Developer<p>We are Canada&#x27;s largest custom eLearning shop and we create some of the most innovative and effective training around! Our Technical Development team is responsible for creating the systems that deliver our educational training in a variety of forms.<p>As a software developer at ICOM, you will collaborate with our team of technical wizards to produce innovative solutions using the latest web technologies. Have a new technology you’ve been dying to use? We are open to trying new things, but be prepared to teach your fellow developers all about it! Just look at how friendly we all are!<p>Tech Team (<a href=\"http:&#x2F;&#x2F;s3.icom.productions&#x2F;tech_team.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;s3.icom.productions&#x2F;tech_team.jpg</a>)<p>Our ideal candidate has graduated with a degree in Computer Science within the last few years and is interested in cutting-edge web application development. They are able to motivate themselves in a flexible environment. They can solve problems both individually and collaboratively, while not being afraid to ask for help when the need it. They are familiar with at least one C-style language, such as PHP, Java, C, C#, JavaScript, or the Go programming language.<p>Here are some of the technologies that we are currently using:<p><pre><code>  * Git\n  * SQL (MySQL &amp; DQL)\n  * Linux (RHEL&#x2F;CENTOS 5)\n  * HTML &amp; CSS\n  * JavaScript (ES6, React, AngularJS)\n  * PHP\n</code></pre>\nWe don’t expect you to have had real-world experience using all of these technologies. ICOM is a learning company, and that applies to our employees as much as it applies to our clients. If any of this appeals to you, apply now!<p><a href=\"http:&#x2F;&#x2F;jobs.icomproductions.ca&#x2F;apply&#x2F;ewHN2U&#x2F;Web-Software-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.icomproductions.ca&#x2F;apply&#x2F;ewHN2U&#x2F;Web-Software-Dev...</a>","time":1438623128,"type":"comment"}