{"by":"justinweiss","id":9999552,"parent":9996333,"text":"Avvo (<a href=\"http:&#x2F;&#x2F;www.avvo.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.avvo.com</a>) | Seattle, WA (ONSITE) | Rails API&#x2F;Backend Developer<p>We’re looking for great software developers to help us connect people with the legal help they need.<p>As an API &#x2F; Backend Developer, you’ll build fast, easy-to-use APIs to help our Mobile team ship remarkable apps. You’ll bridge between our iOS, web, and platform teams, and help us unlock new ways to bring our data to other apps and devices.<p>About You:<p>- 3+ years of API development experience with frameworks such as Rails, Django, or node.js (or others!).<p>- Strong CS fundamentals: A good knowledge of data modeling, object-oriented design, and algorithms.<p>- You’ve worked with multiple product teams at once, and can make the right tradeoffs based on those teams’ needs.<p>- You can clearly explain complex ideas without buzzwords and jargon.<p>- You love to mentor and be mentored. You live by the philosophy that everyone has something to teach you.<p>- You’re addicted to shipping, solving problems, and helping the people around you succeed.<p>About the Team:<p>- We mostly run on Rails, but have brought in technologies like Go, Angular.js, Scala, and Sinatra. We’re open to using the right technologies for what we build.<p>- We iterate quickly, and ship multiple times a day.<p>- We work in small teams with product managers and designers, and help shape the products we’ll be building from day 1.<p>- We have a strong tradition of supporting open source. Projects like resque_scheduler, robut, resque_unit, and json_api_client were all extracted from our codebase, and we’ve contributed several patches back to Rails.<p>Why Avvo?<p>Right now, you have an opportunity to join the team while it’s still on the small side, and grow your career faster than you would at almost any other company. You’ll be able to help shape our dev organization and define our culture.\nCompanies in our position are rare, and joining a company like ours will be one of the most memorable parts of your life.<p>(Side note: I&#x27;ve been here 8 years, and still love it. It&#x27;s an awesome place to work.)<p>Contact: jweiss@avvo.com","time":1438633862,"type":"comment"}