{"by":"claudiac","id":9999720,"parent":9996333,"text":"Mobile Engineer | Clarifai | Deep Learning Technology | ONSITE<p>Clarifai was founded in 2013 by Matthew Zeiler to bring the world’s best image recognition technology to market. Our expertise in deep neural networks helped us achieve the world’s best published image labeling results [ImageNet 2013]. Since then Clarifai’s deep learning systems have improved orders of magnitude in speed, vocabulary size, memory footprint and have expanded beyond images to extract knowledge from all forms of data.<p>Our technology and position in the field of machine learning has already seen extraordinary success and recognition with significant impact on the advancement of technology as a whole and amongst the developer community with our Developer API. See the press and try the demo.<p>Clarifai is backed by Google ventures, USV, NVDIA, Qualcomm, Osage, Lux Capital, LDV Capital &amp; Corazon Capital.<p>We are located in NYC.<p>About the position<p>Mobile devices are generating the majority of visual content, and we need you to harness these devices to build compelling use cases around visual understanding. Build the first photo apps, games, and shopping apps to harness world-class image recognition.<p>Responsibilities<p>Develop mobile applications that leverage our visual recognition technology.\nIntegrate closely with cloud based APIs and cope with large amounts of data.\nDetermine user flow and implement UIs to make complex technology simple.\nSkills<p>Great UI&#x2F;UX and design sense. A portfolio of graceful and functional apps where you’ve been lead or a major contributor.\niOS or Android.\nProduct instinct: a knack for what users want and need.\nExperience with all stages of the product lifecycle, from concept through production launch.\nBackend server experience in Python or other languages a plus.\nMobile game, graphics or GPU programming a plus.\nBachelor’s degree or higher level degree preferred.<p>Contact: claudia@clarifai.com","time":1438635209,"type":"comment"}