{"by":"BCharlie","id":14462702,"parent":14460777,"text":"GE Power | Sr. Software Security Programmer | Atlanta GA, Schenectady NY, Detroit MI | ONSITE <a href=\"http:&#x2F;&#x2F;jobs.gecareers.com&#x2F;ShowJob&#x2F;Id&#x2F;388&#x2F;Staff-Software-Security-Programmer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.gecareers.com&#x2F;ShowJob&#x2F;Id&#x2F;388&#x2F;Staff-Software-Secu...</a><p><i>About us</i>:<p>We&#x27;re a team of software engineers focused on helping the business build secure software on GE&#x27;s Predix platform (predix.io) and industrial internet of things.<p><i>About the role</i>:<p>We build security tools for development teams, security focused libraries and embed with product teams as security focused developers - focusing on user stories around security.<p><i>Technology focus areas</i>:<p>GE is a big company, and we support teams that use all sorts of languages, frameworks, and technologies. The most frequent technologies we work with are:<p>* Java with SpringBoot<p>* Angular<p>* Polymer<p>* Node<p>Other languages I am seeing more of: Python, Ruby, Elixer, Go<p>When we build internal tooling, we pick the best tools for the job: Elixer, Scala, Python, Node or whatever makes sense.<p><i>What we look for</i>:<p>Great programmers who love security and understand secure coding. Experience with the technologies listed above, CI&#x2F;CD, TDD, and general development best practices is key.<p>We hire at all skill levels and are more than happy to train in any technology or skill set if you bring enthusiasm and a programming background to the table.<p>If you love to code, understand how to find, exploit, and fix vulnerabilities in web apps, and want to help us build security tooling, I&#x27;d love to chat!<p><i>Apply</i><p>You can find the full job posting at <a href=\"http:&#x2F;&#x2F;jobs.gecareers.com&#x2F;ShowJob&#x2F;Id&#x2F;388&#x2F;Staff-Software-Security-Programmer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.gecareers.com&#x2F;ShowJob&#x2F;Id&#x2F;388&#x2F;Staff-Software-Secu...</a>, or go to ge.com&#x2F;careers and search for job number 2749772<p>You can also just reach out to me with questions!","time":1496339842,"type":"comment"}