{"by":"g-wilson","id":14463770,"kids":[14464377],"parent":14460777,"text":"Tallysticks | Javascript Developer(s) | London<p>We&#x27;re looking for a Front-end Developer and a Node.js Developer to join our small team in London. We&#x27;re a Barclays Techstars 2016 graduate and are currently based in the Barclays &#x2F; Rise building in Old St &#x2F; Shoreditch.<p>This is a fantastic opportunity for a motivated developer to join a company in its early stages. Help us shape our core technology platform as we build out for our first customers.<p>Our product is a financing application based around smart contracts (Ethereum blockchain right now) which allows importers and exporters access to financing for international trade much faster, and at much lower cost compared to the legacy method - banks, phone-calls, and actual paper.<p>We&#x27;re tackling a real-world problem and delivering real-world value, with cutting-edge tech. We also already have traction with a number of corporates in the finance and international trade spaces.<p>The Node.js Developer role will be focused on building out APIs and other backend services. It will also involve some devops work with AWS. It is a greenfield project, so expect lots of technical planning and decision-making. As well as excellent Javascript ability, the ideal candidate will have past experience with Blockchain platforms&#x2F;clients, Elasticsearch, Redis, AWS, Docker.<p>The Front-end role will be focused on building single-page applications with React and&#x2F;or Vue and will be responsible for leading all front-end projects going forward. We also have a React-Native project which may be interesting to potential candidates. As well as excellent HTML&#x2F;CSS&#x2F;Javascript ability, the ideal candidate will have a good understanding of modern browser APIs, web performance, experience with React and&#x2F;or Vue.js, and isn&#x27;t scared of front-end build tools.<p>Equity available.<p>To apply, email nitesh@tallysticks.io with your CV.","time":1496346103,"type":"comment"}