{"by":"voldern","id":14468920,"parent":14460777,"text":"Creation Suite (Schibsted) | Senior Engineer | Oslo, Norway | Onsite | Full-Time<p>Schibsted Creation Suite is a digital only, award winning [0][1] news creation platform used by several newspapers, including the largest ones in Norway and Sweden. In total we are around 30 people, but you will be part of a smaller team  (4 full stack devs, 1 UX and 1 PM in Oslo; 2 developers in Krakow) working on creating the next generation of personalized news delivery systems and related tools. We&#x27;re small enough that you will have a big impact, but there&#x27;s still plenty of career opportunities within the rest of Schibsted.<p>We&#x27;re looking for a senior engineer that is very experienced with JavaScript and Node.JS (or so good at other stuff and willing to learn that it doesn&#x27;t matter). The rest of our stack consists of Flowtype, PostgreSQL, Spinnaker and AWS (RDS, EC2, SNS, SQS, Kinesis). We&#x27;re constantly experimenting and innovating and no strangers to trying new technology when we get a good opportunity. As of writing we&#x27;re currently looking into linkerd.io.<p>You should also not be afraid of doing frontend development when it makes sense. We&#x27;re currently using ReactJS and are contributing back to a open source system driven by Schibsted called Roc [2], that tries to alleviate some of the pain points of doing development in JS.<p>English is our working language so knowing Norwegian is not required. For The Right Candidate we are willing to help with relocation to Oslo<p>Email me at espen.volden@schibsted.com if you&#x27;re interested.<p>[0] <a href=\"http:&#x2F;&#x2F;www.inma.org&#x2F;practice-detail.cfm?zyear=2017&amp;id=6E4243B1-1456-4AF3-9DC4-1DE05815AF72\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inma.org&#x2F;practice-detail.cfm?zyear=2017&amp;id=6E4243...</a>\n[1] <a href=\"http:&#x2F;&#x2F;www.inma.org&#x2F;blogs&#x2F;main&#x2F;post.cfm&#x2F;40-inma-global-media-awards-winners-unveiled-aftenposten-takes-top-prize\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inma.org&#x2F;blogs&#x2F;main&#x2F;post.cfm&#x2F;40-inma-global-media...</a>\n[2] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;rocjs&#x2F;roc\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;rocjs&#x2F;roc</a>","time":1496400008,"type":"comment"}