{"by":"maartenv","id":14461011,"kids":[14465538,14462406],"parent":14460777,"text":"Fastly is a flexible, transparent content delivery network (CDN) that accelerates and scales websites, mobile applications, and APIs. We do this by moving content physically closer to a company’s end users. We have a high impact, friendly security team, that makes sure we build our products to the highest security standards in the industry!<p>Fastly | Application Security Engineer | San Francisco | FULLTIME, REMOTE<p>We are looking for versatile engineers at all levels of seniority who enjoy being deeply involved in all aspects of building and securing our platform. Qualified candidates will excel at analyzing the design of our software and implementations, and will show an aptitude for discovering complex security issues.<p>Fastly | Director of Application Security | San Francisco | FULLTIME, ONSITE<p>As Director of Application Security at Fastly you will manage and build Fastly’s application security team of security architects and security engineers.<p>Fastly | Security Analyst | San Francisco | FULLTIME, REMOTE<p>This role will be responsible for analyzing DDoS and WAF customers in the Fastly cloud stack. Fastly builds on the popular Varnish cache along with the VCL language to provide DDoS defense and WAF functionality. This position will build on these features. You will build capabilities that will be able to handle growth in our existing products while laying groundwork for exciting new applications.<p>Fastly | Security Javascript Engineer | San Francisco | FULLTIME, REMOTE<p>We&#x27;re looking for a senior security Javascript engineer to join our web application firewall (WAF) team. The ideal candidate will have proven experience building rich client-side User Interfaces for security products on the web. They should be fluent in web technology and standards, capable of delivering excellent code in a fast-paced, cross-functional environment, and enjoy a combination of autonomy and collaboration.<p>Fastly | Security Researcher - SOC | San Francisco | FULLTIME, REMOTE<p>This role will be responsible for investigating threats as they impact web applications, such as novel attacks and new protocols, and how to effectively defend against them. This role mixes exploit analysis and web application analysis together with security control development.<p>Fastly | SOC Manager | San Francisco | FULLTIME, REMOTE<p>This role will be responsible for building and leading the Security Operations Center, which supports customers in the Fastly cloud stack. Fastly builds on the popular Varnish cache along with the VCL language to provide security capabilities, including DDoS defense and WAF functionality.<p>Fastly | Security Systems Engineer | San Francisco | FULLTIME, REMOTE<p>Our Security Systems Engineers build, scale and maintain services that maintain the security and integrity of Fastly’s network traffic. You will work as part of the security team, building scalable security controls and security features. This role will have a specific focus on how we define and manage secrets, generate and distribute key material and how we collect and investigate security logs.<p>Check out these roles at <a href=\"https:&#x2F;&#x2F;www.fastly.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastly.com&#x2F;careers</a>. Most of these roles can be in our San Francisco, New York, Denver, London or Tokyo -- or for the right applicant, can be remote.","time":1496330527,"type":"comment"}