{"by":"papercruncher","id":14462778,"kids":[14463263],"parent":14460777,"text":"Tubi TV | Data, Android | San Francisco, Beijing |  ONSITE VISA SALARY:150k-225kUSD <a href=\"https:&#x2F;&#x2F;tubitv.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.com</a><p>We are making premium TV shows and movies available for streaming everywhere and to everyone, 100% free. Join Tubi TV and reinvent the way consumers discover and consume premium, studio content. With over 40,000 movies &amp; TV shows, Tubi TV has the world&#x27;s largest catalog of premium content, all made available to consumers for free. Some of our studio partners include MGM, Lionsgate and Paramount. We offer very competitive base salary &amp; a performance-based bonus plan, stock options, full medical, dental &amp; vision, catered lunch, gym subsidies and your choice of hardware. Learning is a huge part of our culture and we frequently help non-engineers learn basic programming skills.<p>- Lead Data Engineer&#x2F;Scientist: Full autonomy and end to end ownership. In charge of building and running the entire data team. The ideal candidate can do their own analysis, build ML models, write quality code and ship them to production. <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;esfm0b1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;esfm0b1</a><p>- Sr Data Engineer&#x2F;Scientist: Machine Learning background and comfortable writing production quality code in Python or Scala. <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;uhpgc01\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;uhpgc01</a><p>- Sr Android Engineer: Work on an app with millions of users and help redefine how long form content gets consumed on mobile. The ideal candidate loves working on consumer products and obsesses over UX. <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;j5sgvm1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;j5sgvm1</a><p>If you&#x27;d like to chat first, send me an email (marios at tubitv dot com) and mention HN in the subject. Unfortunately we do not currently offer remote positions. We also have some non-engineering positions open, see <a href=\"https:&#x2F;&#x2F;tubitv.com&#x2F;static&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.com&#x2F;static&#x2F;careers</a> for more details","time":1496340237,"type":"comment"}