{"by":"hackernews","id":14461576,"parent":14460777,"text":"Grand Rounds | Lead Front-End Engineer | San Francisco, CA USA | <a href=\"https:&#x2F;&#x2F;www.grandrounds.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.grandrounds.com</a><p>Grand Rounds[1] was recently named Best Digital Health Company to Work For[2] by Rock Health, and is currently recognized by Glassdoor&#x27;s as the #2 Best Places to Work[3].\nWe are also represented on Wealthfront&#x27;s Career Launching Companies[4] for the second year in a row and are looking for talented Software Engineers to join our mission.<p>For this particular opening, we&#x27;re looking for an experienced React Engineer to join our growing team.   You&#x27;ll leverage your skills in a fast pace environment to help us deliver the next generation of our mobile applications as well as be a key contributor in the standardization of front end components and application services.<p>We&#x27;re building on the modern ecosystem of JavaScript technologies.   You&#x27;ll be immersed with ReactJS, ReactNative, Redux, GraphQL, Jest, Yarn, and will have the autonomy to help shape the toolchain.  The team you&#x27;ll join is comprised of 3 other software engineers, a test engineer, product manager, designer, and a UX&#x2F;UI researcher.   We have clear business goals to achieve.<p>The ideal candidate will have led in the development of a JavaScript application at scale.   You&#x27;ll mastered JavaScript long ago, knowing the pitfalls of asynchronous javascript, and know how to leverage modern standards to avoid them.   You&#x27;ll evangelize importance of encapsulation, separation of concerns and other best practices that lead to building reusable components and libraries.   You&#x27;ll have had experience building ReactJS components and GraphQL APIs.  Knowledge of Ruby and Rails a huge plus.<p>This an ideal position for a highly motivated individual wanting to make a significant impact through the work they do.   If this sounds like you, please reach out to me brett@grandrounds (mention HackerNews) and we&#x27;ll be in touch.<p>[1]<a href=\"https:&#x2F;&#x2F;www.grandrounds.com&#x2F;life-at-grand-rounds&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.grandrounds.com&#x2F;life-at-grand-rounds&#x2F;</a> [2]<a href=\"https:&#x2F;&#x2F;rockhealth.com&#x2F;announcing-the-2017-top-50-in-digital-health&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;rockhealth.com&#x2F;announcing-the-2017-top-50-in-digital...</a> [3]<a href=\"https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Award&#x2F;Best-Small-and-Medium-Companies-to-Work-For-LST_KQ0,43.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Award&#x2F;Best-Small-and-Medium-Compan...</a> [4]<a href=\"https:&#x2F;&#x2F;blog.wealthfront.com&#x2F;2017-career-launching-companies-list&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.wealthfront.com&#x2F;2017-career-launching-companies...</a>","time":1496333632,"type":"comment"}