{"by":"blocher","id":14463025,"parent":14460777,"text":"Engage, LLC| Web Developer, Wordpress, Contract | Alexandria, VA, Remote | Remote <a href=\"http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;LjUbUMePiB&#x2F;WordPress-Developer-Contract-Work\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;LjUbUMePiB&#x2F;WordPress-...</a><p>About the Position<p>Engage is looking for a highly motivated, experienced full stack web developer to contract on a part or full time basis. The ideal candidate is a problem solver, capable of working within given parameters, and works well in a team. You&#x27;d be working with our back-end and front-end web developers building websites and applications.<p>Our office is located in Alexandria, VA (in the Washington DC metro area) and we&#x27;ll give preference to local applicants. Ideal candidate profile would include the following skills:<p>Strong WordPress theme or plugin development experience\nAbility to take a PSD or Sketch file and turn it into a pixel-perfect, responsive website\nHTML5, CSS3, Bootstrap, JavaScript, and JQuery\nPHP&#x2F;MySQL background\nExperience with a PHP framework—Laravel, Symphony, CakePHP, Zend, or CodeIgniter—a plus.\nVue.js, React, or Angular experience—a plus.\nA love of creative problem solving\nEnjoys working with deadlines and in a team environment\nComfortable with version control—Git\nExtremely responsive, especially if working remotely\nA passion for the open source community\nIn general, a nice person to be  around who enjoys tackling challenges, learning new skills, and using new skills\nIn order to be considered, you must submit work samples. Please link to your GitHub profile or portfolio&#x2F;website.<p>About Engage:<p>We are a full-service digital agency that is dedicated to impacting the world around us through bold strategy and innovative technology. With clients that range from political campaigns to top level associations and advocacy groups, we use cutting-edge technology to tell the most compelling story for our clients.<p>About Our Work Culture:<p>We take pride in producing high quality and award winning work, but we always find time for Nerf gun fights and team lunches. We love coming to work and think that you will too!","time":1496341742,"type":"comment"}