{"by":"jayborly","id":14462758,"parent":14460777,"text":"Neighborly.com | Senior Data Engineer (Apache Spark &amp; Scala) | SF or NYC<p>Howdy, neighbor! I think we have a pretty special opportunity for someone with a strong Scala track record and ~1+ year production experience with Apache Spark.<p>Full job posting here on Lever: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;neighborly&#x2F;3148b5cf-ec48-4716-8b20-bd995248f921\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;neighborly&#x2F;3148b5cf-ec48-4716-8b20-bd9...</a><p>Speaking from my personal perspective, here is some background on why I think Neighborly is an <i>awesome</i> place for civic-minded, world-positive, impact-seeking senior engineers: We&#x27;re changing the game of Public Finance, putting the Public back where they belong. We&#x27;re a unique company in the intersection of FinTech and GovTech, with a lot of very interesting data problems to solve, the outcome of which becomes a much more optimized system for communities to fund critical civic improvement projects responsibly through a better municipal bond financing process.<p>Our core business model aims to democratize the municipal bond market. Issuers (cities, states, counties, school districts, special districts, etc) will one day be able to borrow more cheaply, quickly, in more convenient precise amounts, with more of the city&#x27;s nominal debt payments flowing back into the community. Investors get direct access to a relatively stable investment product for which the positive impact is a known quantity.<p>We have a substantial investment in our data platform already that we&#x27;re very proud of, but we&#x27;d like to hire top-talent from the Apache Spark community to focus on taking it to the next level. If that&#x27;s you, and our mission resonates, reach out to us on Lever, or if you&#x27;d prefer a more casual conversation, email me at jay@neighborly.com<p>I must disclaim that the content Neighborly publishes should not be construed as investment advice. The information in this post is for general purposes only and no representation or warranty, express or implied, is made or is to be inferred as to the accuracy, reliability, timeliness or completeness of any such information. 2017 Neighborly Corporation.<p>Securities are offered through Neighborly Securities, member FINRA, SIPC and registered with the MSRB. Learn more at <a href=\"https:&#x2F;&#x2F;learn.neighborly.com&#x2F;terms\" rel=\"nofollow\">https:&#x2F;&#x2F;learn.neighborly.com&#x2F;terms</a>\nNeighborly Corporation, 16 Maiden Lane, Suite 600, San Francisco, CA 94108\nNeighborly Securities, 115 W. 18th St., Suite 302, Kansas City, MO 64108\nNeighborly Securities, 335 Madison Ave.,4th Floor, New York, NY 10017","time":1496340075,"type":"comment"}