{"by":"okhudeira","id":14463033,"parent":14460777,"text":"Marketing Attribution | Lead and Senior Data Engineer and Lead Frontend Engineer | Evanston, IL (with telecomute days) | Full Time | On Site | <a href=\"http:&#x2F;&#x2F;marketingattribution.com\" rel=\"nofollow\">http:&#x2F;&#x2F;marketingattribution.com</a><p>Marketing Attribution was founded and is run by Ross-boy Link, a seasoned statistician and entrepreneur who’s been doing data science since before the term was coined. Ross continues to actively participate in the development of the product given his background in analytics and you’ll see him sling some Python to experiment with a new way to crunch numbers.<p>We develop and support highly automated analytical software that uses cloud-based statistical analysis of large marketing datasets to measure the incremental sales that result from various media, allocate marketing spend to the most efficient media, and connect to media buying systems to execute media buys.<p>In short, we take the client’s sales and marketing data, run analytics on it (our secret sauce), and from those results, tell the client where they should start and&#x2F;or stop spending on marketing (TV, Radio, Internet etc.).<p>We&#x27;re hiring our first engineers (#2, #3, and #4). Full description at:<p>- Lead Data Engineer (<a href=\"http:&#x2F;&#x2F;marketingattribution.com&#x2F;jobs&#x2F;lead-data-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;marketingattribution.com&#x2F;jobs&#x2F;lead-data-engineer</a>)<p>- Senior Data Engineer (<a href=\"http:&#x2F;&#x2F;marketingattribution.com&#x2F;jobs&#x2F;senior-data-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;marketingattribution.com&#x2F;jobs&#x2F;senior-data-engineer</a>)<p>- Lead Frontend Engineer (<a href=\"http:&#x2F;&#x2F;marketingattribution.com&#x2F;jobs&#x2F;lead-frontend-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;marketingattribution.com&#x2F;jobs&#x2F;lead-frontend-engineer</a>)<p>You&#x27;re coming in on the ground floor. This is an entirely greenfield project with no legacy code to maneuver around. You&#x27;ll be responsible for building everything from the ground up.","time":1496341782,"type":"comment"}