{"by":"foomoo","id":14463119,"parent":14460777,"text":"VincuVentas &#x2F; Polymath Ventures | UI&#x2F;UX Designer with Product Feeling | Bogotá, Colombia | ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;vincuventas.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;vincuventas.com&#x2F;</a><p>VincuVentas is a data-driven marketplace for matching job-seeking candidates and businesses in the sales domain. We were founded by one of the most important company builders in the LATAM region, Polymath Ventures [0], with which we share an office. We&#x27;re looking for a UI&#x2F;UX Designer to join our diverse 10-person colombian-swiss-dutch-italian-german team in Bogotá. There is a strong focus on fast, iterative learning cycles and a real chance for you to impact the direction the product is going to take over the next coming months.<p>Some of the things you can work on here would be:<p><pre><code>  * Design Vincu’s company and candidate facing products, including candidate profiles, subscription forms, easy to use inbox system, market intelligence, etc\n  * Communicate with the tech and marketing team to continuously improve our platform and allow rapid scaling\n  * Quickly design and test prototypes with real clients\n  * Create wireframes, storyboards, user flows, process flows and site maps to effectively communicate interaction and design ideas\n</code></pre>\n...and much more. You&#x27;ll have a lot of freedom to explore different areas of the product and thereby develop yourselves in the direction you would like to go. More info and application here: <a href=\"http:&#x2F;&#x2F;www.polymathv.com&#x2F;join-us&#x2F;706131&#x2F;UI%2FUX+Designer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.polymathv.com&#x2F;join-us&#x2F;706131&#x2F;UI%2FUX+Designer&#x2F;</a> Feel free to ask me any questions you might have (city, office, team, application process, ...), email in profile.<p>Needless to say, Bogotá is a very exciting place to live in, Colombia offers many options for getaways and exploration (think beaches, mountains, plains and jungles rolled into one).<p>[0] <a href=\"http:&#x2F;&#x2F;www.polymathv.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.polymathv.com&#x2F;</a>","time":1496342264,"type":"comment"}