{"by":"pgollakota","id":14467323,"parent":14460777,"text":"Udacity | Lead &amp; Senior Software Engineer, Lead Data Analyst, Senior Data Analysts&#x2F;Scientists (2), (5 positions) | Mountain View, CA |FULL TIME | REMOTE, VISA<p><a href=\"https:&#x2F;&#x2F;www.udacity.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.udacity.com&#x2F;jobs</a><p>Come join us and help us meaningfully impact the lives of millions of students across the world. Udacity has about 25% of employees who work remotely including many engineers. We have a good culture of remote work; you won&#x27;t be alone working remotely!<p>Lead and Senior Data Engineering<p>Do you a vision and ability to architect data infrastructure from scratch?\nData @ Udacity is an small team but we have a lot of exciting challenges. We currently have one engineer on the team and are looking for two (or possibly three) more. The team also has 9 data analysts and a data scientist. Scope of work involves architecting and building data pipelines with tools such as Kafka, Kinesis, Redshift, Airflow etc. We are at the very early stages of engineering design so there&#x27;s a lot of creative freedom.<p>- Knowledge of Kafka and Zookeeper. Experience with writing Kafka consumers and&#x2F;or producers.<p>- Prior experience with AWS Redshift and&#x2F;or PostgreSQL preferred.<p>- Knowledge of Linux, network and file system, and database level troubleshooting.<p>- Ability to manage, mentor, and grow a team<p>- Experience in Python&#x2F;Java.<p>Lead and Senior Data Analysts&#x2F;Scientists<p>- Ability to figure out, and use the right analytical techniques to discover insights from data.<p>- Sampling, A&#x2F;B testing, bayesian methods<p>- Excellent knowledge of Pandas&#x2F;Python (or R)<p>- Prior experience with data visualization and abilty to use the right visualization tools to tell the right data story.<p>- Lead analyst will lead a team of 4-5 data analysts and be a techincal mentor for all projects related to her&#x2F;his area.<p>Please email praveen+hnjobs@udacity.com with your resume and&#x2F;or questions","time":1496375762,"type":"comment"}