{"by":"orf","id":14461458,"parent":14460777,"text":"Context Information Security | Python Developer and Penetration testers |  London, UK, Germany, NY, AUS | INTERNS | ONSITE | VISA | <a href=\"https:&#x2F;&#x2F;ctx.is&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ctx.is&#x2F;</a><p>Context provides solutions to our clients most complex information security challenges, in order to protect their most critical resources. Our customers trust us with this great responsibility because of the quality of our people; leaders in their field, inquisitive and capable of rising to the most complex of challenges. \nAlongside our employees drive and determination to be the best at what they do is Context’s company ethos. We are passionate about developing our staff, through provision of continuous training and development opportunities. We also pride ourselves on our flexible and social working environment.<p>Context is always looking for smart people to join our company, whether you have formal information security training and experience or not. A passion and a willingness to learn is key: If you are an excellent developer or sysadmin or working in another technical role and have a keen and demonstrable interest in information security, then we would love to hear from you. We are looking for people who can transfer technical skills from other areas into penetration testing and can support you in doing this.<p>If you&#x27;re interested but not sure, have a go at our challenges[1][2].<p>We are also looking for full-time Python&#x2F;Django developers (including junior roles) to join our in-house development team, to work on exciting projects in the information security space for some very interesting clients. If you&#x27;re a junior or a graduate we look mainly for a desire to learn and a spark, but for more senior positions we are looking for people who:<p>- Have solid Python and Django skills<p>- Have experience with front end development (EmberJS, or other JS frameworks)<p>- Love Postgres as much as we do<p>- Know their way around git<p>- Have good interpersonal skills, with good grasp of the English language<p>If either of these roles appeal to you send your CV and what kind of position you are interested in to careers@contextis.com.<p>1. <a href=\"https:&#x2F;&#x2F;www.contextis.com&#x2F;careers&#x2F;context-challenges&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.contextis.com&#x2F;careers&#x2F;context-challenges&#x2F;</a><p>2. <a href=\"https:&#x2F;&#x2F;ctf.ctx.is&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ctf.ctx.is&#x2F;</a>","time":1496332965,"type":"comment"}