{"by":"BreadFinance","id":14462056,"parent":14460777,"text":"Bread | Senior Software Engineer | NYC | ONSITE, <a href=\"https:&#x2F;&#x2F;www.getbread.com&#x2F;jobs&#x2F;?gh_jid=74853\" rel=\"nofollow\">https:&#x2F;&#x2F;www.getbread.com&#x2F;jobs&#x2F;?gh_jid=74853</a><p>We have enormous and engaging technical challenges. We are designing an API that can drop easily into any one of dozens of ecommerce platforms, proprietary and off-the-shelf, hosted and on-site. We need to verify online identity and predict fraud while providing a beautiful and frictionless consumer experience, and mine user and financial information to approve and price credit, all in real time.  And we are using technology to explore new approaches to consumer credit marketplaces that have never been attempted before.<p>Come learn what we’re all about at www.getbread.com.<p>We are looking to hire a senior engineer to join the current technology team in continuing to build out our core platform and product. This senior engineer will:<p>be responsible for leading design and implementation of new features and iterations of our core platform\ncontinue to develop our core infrastructure for Bread’s scalable and reliable services\ndeliver new working code every two weeks in a fast-paced, code-focused agile development environment\nwork with the rest of the engineering team to deliver new functionality to face merchants, consumers, investors, and internal users\ndesign new iterations of our merchant integration APIs\nbe on the front lines responding to customer issues and ensuring smooth integrations\nRequirements<p>Expert knowledge of server-side languages and data stores (our system is built with Go and PostgreSQL, but we’re also happy to speak with those that have strong backend experience with other languages, including JVM languages like Java or Scala; Python; or C++)\nExperience with message-based, loosely coupled architectures (we use RabbitMQ and Redis)\nExperience with public web APIs\nExperience building scalable, reliable distributed systems\nExperience developing systems intended for cloud deployments (we use AWS)\nA passion for engineering and technology\nPreferred<p>Knowledge of financial products\nExperience with Go&#x2F;PostgreSQL&#x2F;Rabbit&#x2F;Redis\nFront-end skills in JavaScript, using a framework like Angular or Backbone (we use React)\nKnowledge of e-commerce platforms, like Magento, Shopify, Demandware, or others\nDo you have any questions, we would love to hear from you - Jacob@breadfinance.com","time":1496336256,"type":"comment"}