{"by":"chrisBob","id":14461066,"kids":[14488466],"parent":14460777,"text":"University of Michigan | Research Support Programmer | Ann Arbor, MI | Full-time | Onsite | $60-$67k <a href=\"https:&#x2F;&#x2F;lsa.umich.edu\" rel=\"nofollow\">https:&#x2F;&#x2F;lsa.umich.edu</a><p>I am a research support programmer in the College of Literature, Science and The Arts (LSA) at the University of Michigan, and we are adding a programmer to the Advocacy and Research Support team.<p>The official posting is: <a href=\"http:&#x2F;&#x2F;careers.umich.edu&#x2F;job_detail&#x2F;142167&#x2F;research_support_programmer_intermediate\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.umich.edu&#x2F;job_detail&#x2F;142167&#x2F;research_support_...</a><p>We are a small team (currently 3) that handles any programming job that a lab in our college can’t handle internally. We do a lot of work in MATLAB, LabView, and C. Some examples of my recent projects are:<p>- Write an iPad app and database backend to allow users to easily input data into a MySQL database while assembling small robots in a cleanroom.<p>- Write a genetic algorithm program in MATLAB to process protein crystallography data.<p>- Fix a Java&#x2F;PHP&#x2F;SQLite webpage that someone wrote a few years ago and is now crashing.<p>- Add an Arduino controlled servo to an existing Script used to collect data with an automated microscope.<p>- Build a template project so that archieology students can easily add their artwork to a HoloLens program and share&#x2F;visualize the sites they are studying.<p>If you have any questions you are welcome to email me, but you should apply directly via the official post. The pay is reasonable for the area, and we have a nice, low-stress work environment. The projects vary greatly, and you will have the opportunity to work on large and small projects in a variety of languages. We are putting an emphasis on candidates that have some lab&#x2F;research work. A CS Degree is not required. I am a mechanical engineer by schooling and I fit in well.","time":1496330825,"type":"comment"}