{"by":"djd20","id":14480877,"parent":14460777,"text":"<a href=\"http:&#x2F;&#x2F;rsrchxchange.com\" rel=\"nofollow\">http:&#x2F;&#x2F;rsrchxchange.com</a> | Full Stack Python Hacker and Frontend Angular&#x2F;LESS dev (2 jobs)| London or Catnerbury, UK | ONSITE<p>We are looking for both Frontend (angular) and Full-stack&#x2F;backend (python) Devs.<p>Looking to join a small 6 person, casual, team of PhD&#x27;s&#x2F;Unix hackers who pride themselves on quality? Looking for a well funded startup run by an experienced dev team who have been working together for 10 years? Do you love python, postgres, pyramid and sqlalchemy?<p>Drop us a line - we&#x27;re working on a large, well funded, project where we process (for search &amp; convenient reading) thousands of documents a day for the finance industry and need a solid pair of hands with a sense of humor and a life outside of work. This involves a pile of aws infrastructure, and a fair amount of tricky reporting and data-collection work, as well as things like &#x27;similar to this document&#x27; and surrounding compliance. Lots of good concurrency issues and careful balancing of resources &amp; profiling profiling profiling... and testing!<p>As pretty much everything we do is based on open source libraries we try to contribute back where we can, have contributed small patches to sqlalchemy &amp; deform.<p>We will happily consider a range of experiences, but would prefer someone who is familiar with our tool-chain, any experience with elastic search &amp; recommendation mechanisms a plus. Some frontend js&#x2F;css knowlege, and sysadmin (ansible, linux) knowledge welcome too although we are happy to share internally.<p>Our offices are in London (near Baker st), and Canterbury, Kent.<p>Drop us an email to contact at our domain name with a CV, and any work you may have open sourced online.<p>Our interview process will usually involve a skype chat, followed by a group chat with the whole team. Depending on background we may ask you to complete a task or two.<p>No recruiters please.","time":1496576430,"type":"comment"}