{"by":"kieronmint","id":14486276,"parent":14460777,"text":"TLScontact | Database Developer | Beijing China, Lyon France or Belgrade Serbia | ONSITE | FULL TIME | corp.tlscontact.com<p>Who we are！\nTLScontact is a pioneering company specialized in providing customer relationship management excellence within a face-to-face environment. We are part of the Teleperformance Group, the worldwide leading provider of excellent customer experience at every single opportunity, serving governments and companies. Our rapid growth is a direct consequence of the confidence our clients have in us and the outstanding work performed every day by our teams around the world.<p>What we do！\nWe operate a growing number of face-to-face contact centers worldwide. TLScontact offers its clients an end-to-end solution, starting with information provision across multiple media platforms, to the direct face-to-face contact experience and back office tasks.<p>Where we are！\nOur global presence combined with our experienced project management teams enable us to open and begin operating any new face-to-face contact centers in a short period of time.<p>Database Developer &#x2F; Data Engineer<p>Data team is an small team but we have a lot of exciting challenges. We currently have 2 engineers on the team and are looking for one more. The team also works in collaboration with other IT department for system setup, etc.. Scope of work involves maintaining current data pipelines for reporting data transfers and architecting and building new data pipelines with tools such as WSO2.<p>• Experience in SQL database architect and application development, Data Modeling, Database design \n• Experience with RDBMS like MySQL, PostgreSQL, MSSQL or Oracle\n• Experience with ETL and SQL for Reporting or Data Warehouse\n• Experience with data integration\n• Experience in Python&#x2F;Java\n• Experience NoSQL, Cassandra or Hadoop would be a plus\n• Knowledge of Kafka, Storm or Spark would be a plus\n• Superb analytical skills and persistence in database problems solving\n• Attention to details and accuracy, strong logic skill\n• Excellent communication and documentation skills\n• Good verbal and written communication in English.<p>Please email qx1496654841nkx@easytrashmail.com with your resume and&#x2F;or questions (sorry, I am not authorized to share my real email address)","time":1496654928,"type":"comment"}