{"by":"mlent","id":14481317,"parent":14460777,"text":"SumUp | Frontend Engineer | Berlin | ONSITE, VISA <a href=\"https:&#x2F;&#x2F;sumup.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.com</a><p>The people of SumUp have brought the best way to accept card payments to 15 countries so far, but we won’t stop there. Headquartered in London, SumUp&#x27;s major offices are in Berlin, Sofia and São Paulo. The Berlin office alone comprises more than 100 people from 24 countries. SumUp could be interesting for you as an engineer in part because we cover so many platforms: we have physical hardware (made right here in Berlin), our own proprietary payment processing platform, mobile apps on iOS and Android, SDKs and APIs supporting third-party integration, and of course (the main star, in this team&#x27;s humble opinion) a merchant-facing web app.<p>We&#x27;re a team of 4 devs, looking to grow by several members. Our tech stack includes React, Angular 1.6, Webpack 2, Node (Koa and Express), Lodash, d3, and a little RxJS. We are hiring:<p>- Frontend Engineer: <a href=\"https:&#x2F;&#x2F;sumup.workable.com&#x2F;j&#x2F;10969B9646\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.workable.com&#x2F;j&#x2F;10969B9646</a>\n- Senior Frontend Engineer: <a href=\"https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;487768\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;487768</a><p>You&#x27;ll be a great fit if you have a passion for technical excellent, enjoy implementing beautiful designs, are relatively comfortable working on the command line, and strive to learn something new every day!<p>Learn more about working at SumUp here: <a href=\"https:&#x2F;&#x2F;sumup.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.com&#x2F;careers</a> &lt;&lt;&lt;<p>--<p>Note for both positions: If you are not an EU citizen, we can sponsor your visa, but please consider that our hiring process involves on-site interviewing and on-site trial work!","time":1496581082,"type":"comment"}