{"by":"pnagele","id":14523953,"parent":14460777,"text":"Wikitude | C++ Software Engineer (Windows UWP) | Salzburg, Austria | ONSITE, <a href=\"https:&#x2F;&#x2F;www.wikitude.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wikitude.com</a><p>Type: Full time<p>Description: Wikitude is the leading independent augmented reality platform for phones, tablets, and smart glasses. We currently have 100,000+ registered developers, over 25,000 published apps with our AR SDK and 1 billion app installs across the world. We’re looking for a C++ dev to bring our SDK features to Windows UWP and work on the next generation of augmented reality for mobile and wearable devices. You will be responsible for architectural choices and implementation of the Windows version of the Wikitude SDK. By the way we just were awarded “Best developer tool for Augmented Reality”.\nJunior to senior level are welcomed. Excellent knowledge and experience with C++ is required. Experience in development for mobile operating systems (UWP Mobile) would be awesome. Office language is English and your colleagues come from various countries around the World.<p>Location: Salzburg, Austria - Austria in the center of Europe has a great quality of living. Salzburg lies directly at the gate to the Alps. Within 25 mins you can reach great mountain areas as well as beautiful lake side. The vicinity to Munich and Vienna make it easy to travel abroad.<p>Remote: Not preferred.<p>Visa Sponsorship: Not guaranteed. Applicants from the European Union are encouraged to apply.<p>Technologies Mainly C++11 and adopting C++14. Our main development environment is Mac and Linux for server-side tasks. However your job will be running our SDK on Windows. Notions of OpenGL and DirectX is a plus. In a perfect world you have experience with the angle project. Working on mobile systems is a plus.<p>Salary and Benefits: The salary for this position starts at 32,000€ per year (~35,000 in US $), depending on experience and qualification. The salary is negotiable but also includes several other benefits (meal vouchers, free public transport, potential for company equity,..) The cost of living is way cheaper than in most international cities. Renting a decent flat costs about 500-700€ &#x2F; month. Most of the taxes go into a retirement fund that is available even when retiring abroad. We offer 25 days weeks of vacation per year. Additionally, Austria has great social security, healthcare is essentially free, including dentists visits. Schools are good and free.\nContact: Send CV and a short and cool motivation letter to jobs@wikitude.com","time":1497037874,"type":"comment"}