{"by":"Ibotta","id":15386408,"parent":15384262,"text":"Ibotta | Various Positions | Denver, CO | ONSITE \n<a href=\"https:&#x2F;&#x2F;www.ibotta.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ibotta.com&#x2F;careers</a><p>We have a variety of openings for mid &amp; senior level positions.<p>+ Android Engineer - Please apply at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;xnb3af1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;xnb3af1</a>\nHere is what you&#x27;ll be doing: Work with mobile team to design and implement features. Develop automated tests for Ibotta&#x27;s Android application. Fix bugs and improve performance, participate in the definition of new mobile features and experiences<p>+ Big Data Engineer - Please apply at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;jola4g1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;jola4g1</a>\nHere is what you&#x27;ll be doing: Work with engineering, analytics, and product management to implement data-driven features, work with big data sets (on the order of 1011 rows), build, monitor, and maintain data ETL pipelines. Implement systems for tracking data quality and consistency. Administer and maintain our AWS Redshift clusters, EMR, and other data infrastructure. Design, create, and optimize database schemas. Work with Analytics to productionize machine learning systems. Share relevant knowledge with Engineering and Analytics teams<p>+ Platform Engineer - Please apply at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;es4dp21\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;es4dp21</a> \nWork with a cross-functional team to design and develop new features that will be used by millions of users. Use Amazon’s AWS infrastructure and advanced services daily\nIdentify and fix performance bottlenecks. Work with big data sets (hundreds of millions of rows). Write tests and perform code reviews to ensure that we&#x27;re shipping reliable, readable, and reusable code. Ship production code daily. Implement serverless architectures. Research and implement technology solutions for reliable, scalable, high-performing services<p>+Salesforce Developer - Please apply at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;7igksh1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;7igksh1</a>\nHere&#x27;s what you&#x27;ll be doing: Develop new automation and integration with the Ibotta platform that supports business requirements. Build new user experiences using Salesforce best practices. Create Salesforce integrations that have complex mappings and data migrations. Manage the Salesforce testing process, including devising test plans, creating test cases, establishing testing protocols and appropriate testing environments and coordinating software testing. Keep apprised of new Salesforce features and functionality, providing recommendations for improvements, and teaching others. Provide high quality, reliable, scalable and high-throughput solutions. Write tests and perform code reviews to ensure that we&#x27;re producing reliable, readable, and reusable code. Create and maintain technical documentation on integrations with the platform<p>+ Senior iOS Engineer - Please apply at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;1ub86d1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;1ub86d1</a>\nWork with mobile team to design and implement features. Develop automated tests for Ibotta&#x27;s iOS application. Fix bugs and improve performance. Participate in the definition of new mobile features and experiences<p>+ Senior Software Engineer - Please apply at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;bxhs531\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;bxhs531</a> \nWork with a cross-functional team to design and develop new features that will be used by millions of users. Use Amazon’s AWS infrastructure and advanced services daily. Identify and fix performance bottlenecks. Work with big data sets (hundreds of millions of rows). Write tests and perform code reviews to ensure that we&#x27;re shipping reliable, readable, and reusable code. Ship production code daily\nImplement serverless architectures. Research and implement technology solutions for reliable, scalable, high-performing services","time":1506968612,"type":"comment"}