{"by":"mattbee","id":15385360,"parent":15384262,"text":"Bytemark | Platform Engineer | York or Manchester, UK | Remote OK | Full Time, £32-40k<p><a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;14\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;14</a><p>Edited hilights from the full ad:<p>We&#x27;re looking for a Linux expert to maintain our cloud hosting systems and raise the bar for our internal deployment systems. You&#x27;ll be keen on measurement, monitoring and reliability, and want to be a creative member of a new &amp; growing team within our company (you&#x27;ll be #4 in this new team; we&#x27;re 30 in total).<p>The big issues you&#x27;ll be solving are how to manage a growing hosting platform, redeploy some old internal applications to better support our engineering team, and generally improving our reasoning about failures and reliability.<p>The low-level work is picking jobs out of a work queue, carefully rearranging and documenting hundreds of servers to improve reliability and performance, communicating reliability issues to both our support team and our customres.<p>The company is centered in York, but none of the team are based here, so all its practices are remote-first.<p>Bytemark is a 15-year old hosting firm in the UK.  We&#x27;ve built our own cloud hosting platform since 2012, our own data centre in the UK, and even our own free Debian-based distro for that &quot;shared hosting&quot; vibe.  So we do everything in the hosting stack from top to to bottom.<p>Lastly - we&#x27;ve got a very anonymous hiring process.  That means we don&#x27;t want your name or CV up front, just an alias and a few questions about your interest and ambition.  We&#x27;ll arrange remote, anonymous interviews and only ask for your identity and CV at the 3rd stage.<p>You can read more about the process here:<p><a href=\"http:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;full-process\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;full-process</a><p>We&#x27;re an equal opportunities employer, provide 25 holiday days per year (+ UK bank holidays + 1 extra day per year of service), we pay for your broadband, administer a pension, provide a health cash plan for dental &amp; optical, provide 16 weeks enhanced (full) maternity pay, run a childcare voucher scheme, and pay for 5 days out at conferences alongside other relevant training.<p>If you think Bytemark could be somewhere you want to work, the full description and big &quot;Apply&quot; button is here on the ad:<p><a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;14\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;14</a><p>Happy to answer any further questions here.","time":1506962481,"type":"comment"}