{"by":"dcgudeman","id":15384887,"parent":15384262,"text":"SymphonyRM | Palo Alto | REMOTE | Full Stack Developer | <a href=\"http:&#x2F;&#x2F;www.symphonyrm.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.symphonyrm.com</a><p>SymphonyRM helps health systems thrive in the rapidly evolving US Healthcare industry. By applying data science to large amounts of information from many sources, we empower clients to make smarter decisions at every turn in their business. Our products help keep patients healthy and physicians happy. Our customers love the results they’re seeing using SymphonyRM to improve important business metrics.<p>Full Stack Developers play a critical role at SymphonyRM. They develop the web and mobile experiences that our end users interact with everyday. Our application engineers:<p>- Work with UX designers to conceive&#x2F;design&#x2F;finalize HTML&#x2F;CSS&#x2F;SASS<p>- Create front-end JavaScript and server-side PHP that powers our web &amp; mobile apps<p>- Develop &amp; enhance REST APIs in JavaScript using Express on node.js<p>- Query backend data from MySQL and Amazon Redshift using Sequelize ORM<p>- Help us explore and apply important new technology, e.g. GraphQL, React, etc.<p>SymphonyRM is seeking a Full Stack Developer to conceive, design, and implement new features and products by working closely with our sales and CSG teams. You will have the opportunity to influence the structure and function of our products by giving valuable feedback to stakeholders. You’ll have access to the results of algorithms that have processed vast amounts of data to guide users to take the next best action for patients. Your code will improve the lives of patients and increase physician satisfaction. As a member of our application engineering team, you’ll help push the envelope on how to use data to help end users take better action.<p>Apply Here: <a href=\"https:&#x2F;&#x2F;symphonyrm.workable.com&#x2F;j&#x2F;399179CB09\" rel=\"nofollow\">https:&#x2F;&#x2F;symphonyrm.workable.com&#x2F;j&#x2F;399179CB09</a>","time":1506960081,"type":"comment"}