{"by":"scoj","id":15387856,"kids":[15406653],"parent":15384262,"text":"FMG Suite &#x2F; http&#x2F;&#x2F;fmgsuite.com &#x2F; MN or CA (Remote, but hiring from those states) | Senior .NET Software Developer\nWe’re looking for a smart and creative full stack .NET developer to add to our development team.<p>Our ideal candidate is purpose-driven, able to take ownership of how our products and systems operate, and be awesome to work with.  You should have a strong understanding of the .NET, C#, Javascript, SQL, ASP.NET and MVC.  You must be an excellent team player and be able to contribute positively to our culture of iterative development, team collaboration and our fun, positive, professional work environment.<p>Our Team\nWe’re a growing web development team building SaaS marketing products. We embrace an engaging, fast-paced, results-oriented culture. We value open collaboration and communication.  We strive to continuously improve both our products and our processes.  We believe work should be both fun and challenging.  Our goal is to invest in happy, successful individuals in order to see them succeed both inside and outside of work. We do continuous integration and simple click deployments near daily. We strive to get better and faster and keep pushing our tech forward.<p>Job Requirements\nRequired skills and experience:\nA minimum of five years experience developing web-based software\nStrong understanding of software development in C#, the .NET framework\nStrong understanding of MVC, ASP.NET, SQL\nSolid understanding of Javascript and a front end framework (ex, Knockout, Angular, React)\nSolid understanding of HTML, CSS, XML\nStrong verbal and written communication skills\nSelf-motivated with the ability to work independently \nFast learner &amp; strong team player\nVersion control, continuous integration methodologies (git, Jenkins)\nMastery of the pirate effect in Google hangout<p><a href=\"http:&#x2F;&#x2F;hrbrg.co&#x2F;zBy8aK\" rel=\"nofollow\">http:&#x2F;&#x2F;hrbrg.co&#x2F;zBy8aK</a>","time":1506977577,"type":"comment"}