{"by":"saip","id":15384657,"kids":[15386775],"parent":15384262,"text":"FloydHub | Cloud Infrastructure Engineer | San Francisco, CA | Onsite | Full-time | Salary: 100k-125k (0.5%-1% equity) | <a href=\"https:&#x2F;&#x2F;floydhub.com\" rel=\"nofollow\">https:&#x2F;&#x2F;floydhub.com</a><p>FloydHub (YC W17) is building a Heroku for deep learning. We enable data scientists to do deep learning in the cloud with a few simple commands and without any of the infrastructure or DevOps hassles.<p>Every day, we handle training, scaling and serving of several thousand deep learning models on our GPU clusters and manage TBs of data. As an infrastructure engineer, you will be responsible for building and scaling our GPU cloud infrastructure. Not simply operating the system, but be part of architecting and building scalable and secure cloud infra.<p>Keywords: AWS&#x2F;GCP&#x2F;Azure, Kubernetes, Docker, Mesos, Terraform, Packer, Python.<p>Requisites: 3+ years of cloud infrastructure experience<p>We&#x27;re a small team (4 engineers), agile and very early stage (YC W17). We&#x27;re Stanford&#x2F;CMU grads, with experience leading deep learning research at Bing&#x2F;Microsoft, large engineering org (Location Labs, Avast) and infrastructure at LinkedIn.  We&#x27;re backed by some of the best VCs and angels in town (<a href=\"https:&#x2F;&#x2F;floydhub.com&#x2F;about\" rel=\"nofollow\">https:&#x2F;&#x2F;floydhub.com&#x2F;about</a>). If joining an awesome 4-person team doing AI&#x2F;infra excites you, come join us! As a founding team member, you will have the opportunity to considerably impact not only the technical direction of the product, but also the culture of the company!<p>Email us: careers@floydhub.com or find more info at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;floydhub&#x2F;jobs&#x2F;240935-senior-infrastructure-engineer-founding-team-member\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;floydhub&#x2F;jobs&#x2F;240935-senior-infrastructure-...</a>","time":1506958867,"type":"comment"}