{"by":"monetatedevops","id":15387522,"parent":15384262,"text":"Monetate | Software Engineer, DevOps Engineer | New York City, Conshohocken (Philadelphia), Palo Alto, London, Remote (US, Canada only) | <a href=\"https:&#x2F;&#x2F;monetate.com\" rel=\"nofollow\">https:&#x2F;&#x2F;monetate.com</a><p>Monetate, the personalization vendor most preferred among IR 500 brands is hiring! With a history of fast growth and the backing of VCs such as First Round and OpenView, it&#x27;s no wonder that over 300 marquis consumer-facing brands choose Monetate to power their e-commerce success.<p>Our cutting-edge technology leverages artificial intelligence (AI) and processed more than 2.1 billion personalized pages over Cyber weekend alone, offering peace of mind that we deliver real-time personalization at astounding scale. Designed for marketers, we are beloved for our ease-of-use.<p>At Monetate, we love this stuff and our Monetators fervently believe in a world in which brands can effortlessly deliver the best experiences to their customers—every time, using everything known about the customer, in every place a brand engages with them.<p>If you want to be a part of a bigger purpose, bringing cutting edge technology to market, Monetate may be the right spot for you! We have offices located in NYC, Conshohocken, PA, Palo Alto and London and we focus on hiring the absolute best talent by welcoming remote employees as well.<p>Why work for Monetate:<p>- You’ll get to work with a very talented and passionate team of product managers, software engineers and designers\n- We pride ourselves on upholding a respectful and supportive environment; if there&#x27;s something you need to get your work done, well get it for you\n- We understand that everyone is different. We have flexible hours, no dress code, and you&#x27;re free to migrate between dedicated desks (standing desks available), private rooms, open lounges with couches, or even the lawn to get your work done.\n- You&#x27;ll never go hungry - catered lunches and tons of snacks\n- 12 weeks of fully paid maternity leave and 4 weeks of fully paid paternity leave\n- Full Benefits, 401k &amp; Stock options<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.monetate.com&#x2F;about&#x2F;careers#join-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.monetate.com&#x2F;about&#x2F;careers#join-team</a><p>We are an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.","time":1506975352,"type":"comment"}