{"by":"skrebbel","id":15388198,"parent":15384262,"text":"TalkJS (<a href=\"https:&#x2F;&#x2F;talkjs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;talkjs.com</a>) | Eindhoven, the Netherlands | REMOTE (&lt; 200km)<p>TalkJS is the messaging platform for platforms.<p>FULL-STACK PROGRAMMER: We&#x27;re looking for an experienced programmer - the kind that could make it to &quot;software architect&quot; at a boring bigco but prefers to get their hands dirty.<p>Our stack is made of Elixir, ES6, React, PostgreSQL and a little bit of Node. We&#x27;re particularly looking for people with strong front-end skills, with an eye for design and UX. This means that either you identify as a frontender, or as a full-stack developer.<p>WRITER &#x2F; CONTENT MARKETER: We&#x27;re looking for a passionate technical writer &#x2F; content marketer. No deep tech skills needed, but an affinity with tech is required. This is your chance to design &amp; carry a young startup&#x27;s content marketing effort.<p>Content already drives a significant chunk of our growth, but there&#x27;s still a lot of room for us to get better at it. Our product is technical in nature, so some of that content will need to be technical in nature too. We&#x27;re looking for someone who loves producing the kind of useful content (insights, tutorials, analyses, etc) that entrepreneurs and programmers in our target audience really need. Not fluff promo pieces or useless Twitter spam.<p>ABOUT TALKJS: Our team is small and highly proactive, and we expect the same from you. If you need to be told what to do all the time, don&#x27;t apply. If you want to be the smartest person in a (chat) room full of interns, don&#x27;t apply. If you want to move fast with an experienced team, get in touch.<p>We prefer on-site for both positions, but remote is OK as long as you&#x27;re max 2 hours away from Eindhoven so we can meet often. Eindhoven has a great low-cost airport so this includes a fair share of Europe.<p>Apply or ask questions through the chat popup on our website.","time":1506980482,"type":"comment"}