{"by":"dbingham","id":15386652,"parent":15384262,"text":"Ceros (<a href=\"http:&#x2F;&#x2F;ceros.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ceros.com</a>) | Full Stack Developer (Security background) | New York, NY | Remote | Full Time<p>Ceros is the world&#x27;s leading collaborative design platform. Our users work collaboratively in real-time on a browser-based digital canvas to create pixel-perfect experiences with rich animations and interactivity. The experiences they publish work consistently across all browsers and devices, and all customer engagement is tracked with extensive analytics. All without writing code.<p>Our customers include some of the world’s leading brands, such as Mashable, Bloomberg, Red Bull, United Airlines, and AIG.<p>We are well-funded and venture-backed by prominent investors including Grotech Ventures, Sigma Prime, Starvest Partners, Greycroft and Mark Cuban.<p>Our codebase is 95% JavaScript and the Ceros product is comprised of multiple single-page applications with a client-heavy focus. We use libraries like jQuery, Require, and Backbone. The Ceros Studio is architected around the HTML5 Canvas element.<p>We’re not language zealots. We believe in using the right tool for the job, and our current server-side infrastructure runs PHP, Node.js, Redis, AWS Aurora, Chef, etc. on the Amazon AWS cloud.<p>Working completely from home, you’ll be communicating often through chat rooms, email, and video conferencing. We offer flexible working hours and an extremely flexible vacation policy. And we provide excellent gear (15” Macbook Pro, iPad, external monitor, etc.).<p>While we are not a security company, we are looking for a developer with a passion for security. One with past experience in a highly regulated industry (banking, trading, etc.) or working with security software. You should be familiar with OWASP and be able to mentor other developers on secure-coding best practices.<p>More info here: <a href=\"http:&#x2F;&#x2F;labs.ceros.com&#x2F;jobs&#x2F;#&#x2F;job&#x2F;722719\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.ceros.com&#x2F;jobs&#x2F;#&#x2F;job&#x2F;722719</a><p>We&#x27;re also looking for:<p>Ceros | User Experience Designer (Product) | New York, NY | Onsite | Full Time<p>More info here: <a href=\"http:&#x2F;&#x2F;labs.ceros.com&#x2F;jobs&#x2F;#&#x2F;job&#x2F;782987\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.ceros.com&#x2F;jobs&#x2F;#&#x2F;job&#x2F;782987</a>","time":1506969908,"type":"comment"}