{"by":"zgoldberg","id":15384506,"kids":[15384681],"parent":15384262,"text":"Lottery.com | Backend&#x2F;Fullstack Senior Software Engineer | San Francisco, CA | Full-Time | North America Remote OK<p>Contact us at: careers@lottery.com<p>ABOUT LOTTERY.COM<p>At Lottery.com we’re assembling a world-class team of brilliant minds, resourceful doers and creative problem-solvers with a ‘find a way or make a way’ attitude. Founded in 2015 and based in San Francisco, California, Lottery.com is creating the next generation of lottery ticket sales &amp; ticket management systems. We make buying and redeeming lottery tickets more convenient, secure and intelligent through our mobile application and online platform. We look for candidates that demonstrate what we call the “three Is” -- Intelligence, Integrity and Intrinsic motivation.<p>ABOUT OUR ENGINEERING TEAM<p>Our engineering team powers our entire product, both for our users and internal operations team. Engineering at Lottery.com is divided into several squads, each on the smaller side at 5-6 engineers. We bias towards passionate engineers who bring experience, well reasoned opinions and a variety of perspectives to the table. We encourage honest debate and emphasize concrete, forward-thinking solutions. We operate on a weekly schedule, have regular internal demos&#x2F;tech talks, and a weekly retrospective. We’re experienced and confident but have no ego, we’re open minded and constantly looking for ways to improving ourselves and our processes.<p>STACK<p>NodeJS, Heroku &amp; AWS, RabbitMQ, MongoDB, Serverless, Microservices<p>RESPONSIBILITIES<p>Design and implement key components of our technical infrastructure, including services supporting payments, lottery results, user management, ticket facilitation and more.\nTake ownership over mission-critical functionality that is consumed by our mobile, web and internal applications\nWork as a team with your peers, collaborating on architecture, mentoring teammates and pushing our entire stack forwards.\nPartner with sister squads, including frontend, growth and product teams on delivering a seamless experience across the board.\nStay up to date on the latest innovations in our industry and in our tech stack.\nHelp us push the boundaries on what a small team can produce and maintain with simple code and well thought out architecture.","time":1506957921,"type":"comment"}