{"by":"ridewithvia","id":15384967,"parent":15384262,"text":"Via Transportation (<a href=\"https:&#x2F;&#x2F;ridewithvia.com\" rel=\"nofollow\">https:&#x2F;&#x2F;ridewithvia.com</a>) | New York, NY | Full-time Onsite<p>Via is re-engineering public transit—from a regulated system of rigid routes and schedules to a fully dynamic, on-demand network. The Via algorithm matches, in real time, multiple passengers headed the same way with a single large SUV or van. Passengers request rides through a mobile app, and Via’s systems instantly select and, if necessary, re-route the vehicle that best matches the passenger’s route. Targeting the gap between outdated public transit and expensive luxury car services, the Via platform currently operates in New York City and Chicago, has provided more than four million rides, and is growing rapidly.<p>We&#x27;re looking for entrepreneurs who are excited about getting in on the ground floor of a fast-growing start-up; imaginative thinkers who relish wearing multiple hats and never back down from a challenge.<p>We&#x27;re unusually selective in our hiring process. If you have a record of exceptional achievement, take intense pride in your work, and want to join a world-class team, we’d love to talk to you.<p>Via&#x27;s Growth Team is hiring!<p>The Growth team at Via is a multidisciplinary team that focuses on the user acquisition funnel, as well as activation, engagement, and retention. We are hiring for two roles:<p>Growth Product Principal<p>As Growth Product Principal, you will define, test, and iterate on product improvements and features that drive virality, improve conversion, and eliminate friction from key user flows in the Via mobile app.<p>Apply here: <a href=\"https:&#x2F;&#x2F;via.workable.com&#x2F;jobs&#x2F;231180\" rel=\"nofollow\">https:&#x2F;&#x2F;via.workable.com&#x2F;jobs&#x2F;231180</a><p>Growth Associate<p>As a Growth Associate, you will collaborate with a multi-disciplinary team of data scientists, engineers, and marketing specialists. You will work on large and complex data sets to understand the behavior of Via’s end users, rigorously develop and implement strategies for efficient customer acquisition and retention, and help design and prototype analytical and operational tools that will support Via’s growth at scale.<p>Apply here: <a href=\"https:&#x2F;&#x2F;via.workable.com&#x2F;jobs&#x2F;536213\" rel=\"nofollow\">https:&#x2F;&#x2F;via.workable.com&#x2F;jobs&#x2F;536213</a>","time":1506960455,"type":"comment"}