{"by":"caseus515","id":15389638,"kids":[15481060],"parent":15384262,"text":"Preferred Networks | AI Research and Engineering positions | Tokyo and San Mateo, California | ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;</a><p>We are a growing startup with about 100 members based in Tokyo, Japan, focusing on applying deep learning to industrial problems such as autonomous driving, robotics, and bio-healthcare. We love open source; we are actively developing the deep learning framework Chainer (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;chainer&#x2F;chainer\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chainer&#x2F;chainer</a>).<p>We recently announced the launch of one of the largest private GPU clusters in the world with 1,024 NVIDIA Tesla P100 GPU accelerators, in addition to currently available 500+ GPUs:\n<a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;news&#x2F;pr20170920\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;news&#x2F;pr20170920</a><p>In August, we received an investment of $95 million from Toyota: <a href=\"http:&#x2F;&#x2F;newsroom.toyota.co.jp&#x2F;en&#x2F;detail&#x2F;18012355&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;newsroom.toyota.co.jp&#x2F;en&#x2F;detail&#x2F;18012355&#x2F;</a><p>We are looking for great people that are able to handle challenging tasks in:<p>- Autonomous driving<p>- Computer vision<p>- Robotics<p>- NLP<p>- Bioinformatics<p>- FPGA&#x2F;ASIC design<p>- Deep learning<p>- Reinforcement learning<p>- etc. (please see our \nwebsite for all available roles)<p>We have a western-style working environment with attractive salaries and benefits in the heart of Tokyo. Ability to communicate in either English or Japanese is OK. We have a flat hierarchy, so you can expect your opinion to count. Experience a Silicon Valley-like culture - while living in Japan! We are mainly hiring for our Tokyo office, but some positions are also available at our San Mateo office in California.<p>More job details and application instructions can be found at <a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;job</a>","time":1506997291,"type":"comment"}