{"by":"osmihi","id":15387123,"parent":15384262,"text":"Kipsu | Full Stack Software Engineer | Minneapolis, MN | Onsite | Full-Time or Intern<p><a href=\"https:&#x2F;&#x2F;www.kipsu.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kipsu.com</a><p>Kipsu is a six-year old, bootstrapped software company whose messaging tools keep personal connections at the heart of service. We&#x27;re hiring driven, curious developers with zero to three years of experience to become a vital part of our engineering team of 10 and help us build the next phase of our industry-leading software platform.<p>We’re seeking independent people with a hunger to learn to join our team. Some reasons you might want to toss your hat in the ring:<p>• Autonomy - our engineering team cultivates a culture of trust and responsibility that empowers developers to drive meaningful changes and make their own architectural choices<p>• Impact - small, nimble teams means that your work makes a measurable difference in the success of the business (and yes, even moving the proverbial needle!)<p>• Evolution - our all-in, continuous improvement attitude lends itself to blameless retros; we value learning from our mistakes as individuals and as a team<p>• Conviviality - we’re a Best Places to Work awardee chock full of smart, friendly Minnesotans (and a couple Ioweigians) who prioritize relationships and love treating our customers and each other ridiculously well<p>• Bonus: We embrace modern DevOps practices, with a focus on collaboration from design and coding through deployment and beyond<p>Our ideal match is a full-stack developer with experience building web applications with JavaScript and front-end frameworks as well as maintaining a solid, scalable backend codebase by applying object-oriented principles using a modern programming language– at Kipsu we use PHP, Node.js, Go, Swift, Python, Java, and others. Amazon Web Services (AWS) or other cloud computing platforms and experience building native mobile applications for iOS or Android are a huge bonus.<p>If you’re interested in learning more from our VP of Talent, we welcome you to text us at (612) 400-7222, email us at resume@kipsu.com, or to view our full job description at <a href=\"http:&#x2F;&#x2F;kipsu.io&#x2F;2S8\" rel=\"nofollow\">http:&#x2F;&#x2F;kipsu.io&#x2F;2S8</a> and apply. Either way, a human will get back to you!","time":1506972581,"type":"comment"}