{"by":"oatwcareers","id":15384931,"parent":15384262,"text":"Opportunity@Work | Senior Software Developer | Washington, DC | ONSITE<p>We are looking for an experienced full-time developer who will work with our small in-house product and engineering team to help us realize our vision of a multi-sided labor marketplace designed to enable skills-based, inclusive hiring that reaches millions of Americans. You will:<p><pre><code>  - Collaborate with technical and nontechnical teammates across Opportunity@Work, providing technical feedback and mentorship around best practices\n  - Inform technical trade-offs and possible product paths for development strategy\n  - Mentor and guide junior members of the development team\n  - Develop technical solutions according to specification\n  - Inform technical trade-offs and possible product paths for development strategy\n  - Help define interfaces with the diverse array of relevant tools and players (e.g., job boards used by job seekers, applicant tracking systems used by employers)\n</code></pre>\nYou are passionate about using technology in service of the most pressing and complex social challenges. You are experienced in working in agile product development teams. You have experience with and a track record of demonstrating excellence across the following skills and technologies:<p><pre><code>  - Front-end web development (HTML, CSS, Bootstrap)\n  - Back-end data architecture (API design)\n  - Object-oriented programming and at least one modern web framework (we use Rails)\n  - Managing the software development lifecycle within a team; agile development\n  - Making smart tradeoffs of efficiency&#x2F;speed&#x2F;reliability&#x2F;maintainability\n  - Following software development best practices (automated testing, code comments, etc)\n  - Collaborating with nontechnical partners to effectively communicate technical outcomes\n  - Taking a user-driven approach, finding effective solutions for users of diverse socioeconomic and educational backgrounds\n</code></pre>\nYou should also have:<p><pre><code>  - Passion for our mission: You care deeply about workforce, social justice and inclusive training&#x2F;hiring related issues.\n  - Clear communication: You have good written and verbal communication skills with the ability to synthesize complex information into simple and engaging terms with your audience in mind.\n  - People-centered approach: You enjoy engaging with people and have a talent for building and managing strong relationships that achieve outcomes. You are comfortable working in teams and can build rapport with people from diverse backgrounds and perspectives and use a human centered design approach to your work.\n</code></pre>\nTo apply, visit <a href=\"https:&#x2F;&#x2F;opportunityatwork.org&#x2F;join-our-team&#x2F;#techhire\" rel=\"nofollow\">https:&#x2F;&#x2F;opportunityatwork.org&#x2F;join-our-team&#x2F;#techhire</a>","time":1506960299,"type":"comment"}