{"by":"flowtech","id":15387503,"parent":15384262,"text":"Flow Commerce | Software Engineer (all levels&#x2F;disciplines) | Hoboken, NJ | ONSITE<p>Flow is an enterprise SaaS platform that makes it simple for ecommerce brands to sell globally. It’s a large market (~$400B last year) and growing quickly (~30% year over year). We closed a massive series A funding round earlier this year ($16M) and are scaling the team. We love building software. We love open source. We spend tons of time carefully designing our APIs - both for the REST APIs and the event schemas we use on our data platform.<p>We’re looking for developers who are passionate about:\n- APIs - both REST and real time event processing - Machine Learning &#x2F; NLP to solve real problems in the ecommerce world - Bringing great UI and UX to the enterprise<p>About you:\n- You take pride in owning technical features from concept to keyboard to end-user. - You’re comfortable in a fast-paced environment with a bias toward delivery. - You believe in automation and tools over process and bureaucracy.<p>About us:\n- Balanced and Productive. We have a great core team that genuinely built the culture on a foundation of trust - more at <a href=\"https:&#x2F;&#x2F;www.flow.io&#x2F;our-company&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.flow.io&#x2F;our-company&#x2F;</a> - Founded in 2015 by second time successful entrepreneurs (Gilt Groupe, Fizzback).<p>Open source: node.js, react, redux, scala (the kind of scala without a var), play framework, golang (CLIs) - more at: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;flowcommerce\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;flowcommerce</a>.<p>Our commitment to diversity goes well beyond demographics. We have many friends here on HN, and are really looking for interesting people from all backgrounds, industries, and levels of experience. It&#x27;s early enough that you will have a huge impact on what we do and how we do it. If you have questions or want to apply, pls drop me a note: Eric &lt;em at flow.io&gt;","time":1506975183,"type":"comment"}