{"by":"mike_heffner","id":15388008,"kids":[15388048],"parent":15384262,"text":"Librato&#x2F;Papertrail&#x2F;TraceView | Sr Data Engineer | SF &#x2F; US-REMOTE | Full-time | <a href=\"https:&#x2F;&#x2F;www.librato.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.librato.com&#x2F;jobs</a><p>We&#x27;re looking for a full-time software engineer to take a key role in building the large-scale distributed systems that power Solarwinds Cloud products: Papertrail (hosted logs), Librato (time-series metrics) and TraceView (APM and distributed tracing).<p>We’re a small team so everyone has the opportunity to have a big impact. We’ve built our platform out largely on Java8 Dropwizard services, a handful of Golang services and some C++ where performance is critical. We leverage Kafka as our main service bus, Cassandra for long term storage, our in-house stream processing framework for online analytics, and we rely on Zookeeper as a core part of intra&#x2F;inter-service coordination. Our data pipeline pushes millions of messages a second and tens of terabytes of logs per day.<p>All team members, whether local in San Francisco or remote, commit code to Github, communicate over Slack and Hangouts, push code to production via our ChatOps bot, and run all production applications on AWS. We also use an array of best-breed SaaS applications to get code to production quickly and reliably. We are a team that is committed to a healthy work&#x2F;life balance.<p>Papertrail&#x2F;Librato&#x2F;TraceView are wholly owned by SolarWinds Inc. so you get the benefits of a small startup, with the backing of a big company so there is no worry about the next round of funding. SolarWinds offers competitive bonus and matching 401k programs that create an attractive total compensation package.<p>This is an example of some of the technology we build and work with on a regular basis: <a href=\"http:&#x2F;&#x2F;www.heavybit.com&#x2F;library&#x2F;blog&#x2F;streamlining-distributed-stream-processing-with-superchief&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.heavybit.com&#x2F;library&#x2F;blog&#x2F;streamlining-distribute...</a>.<p>Learn more at: <a href=\"https:&#x2F;&#x2F;www.librato.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.librato.com&#x2F;jobs</a> or contact me directly at mike@librato.com (no recruiters).","time":1506978762,"type":"comment"}