{"by":"blakeweb","id":15387729,"parent":15384262,"text":"Recursion Pharmaceuticals | SLC, Utah | Onsite, full-time<p>Recursion is a startup with about 70 people, generating rich biological data at a pace comparable to the biggest institutions anywhere doing biology and disease research. We generate literally millions of images every single week from experiments our biologists conduct in our labs. We’ve gotten more than $2M in multiple grants from the NIH, and last fall closed a $15M series A led by Lux Capital. We’re using imaging experiments to turn human cell experiments into massive amounts of rich biological data so we can find treatments using ML and data science for many diseases as fast as possible. Yoshua Bengio (one of the fathers of deep learning) just became an advisor for our ML work.<p>We’re looking for:<p>* Senior Data Scientists&#x2F;ML researchers: Looking for highly experienced senior&#x2F;principal-level data scientists and machine learning researchers who want a challenging problem, massive amounts of rich data, abundant GPUs, ML expertise all around, and knowledge that their breakthroughs will seriously help people. No bio background needed.<p>* Software Engineers: Looking for highly experienced full-stack and backend senior&#x2F;principal-level engineers who like interacting heavily with internal customers and building complex systems quickly, for a good cause. No bio background needed.<p>* Biologists, computational biologists, automation scientists, and drug discovery experts.<p><a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers</a> for more details and to apply.<p>Logistics: Salt Lake City, Utah. Hiking&#x2F;running&#x2F;biking is literally out our back door, and it&#x27;s half an hour to 5 ski resorts. Great pay, health insurance, 401k, relocation assistance (onsite is required), equity, a top-caliber team, and help make a massively positive impact. Happy to sponsor&#x2F;extend visas, but you need to already be authorized to work in the US--we can’t handle the lottery at this stage.<p>Tech: Data science: python scientific stack (pandas, numpy, scikit-learn, matplotlib, bokeh, etc). Software engineering: go, python, angular.js, react, javascript on aws and gce. Deep learning (e.g. convolutional networks) we&#x27;re mainly using the python frameworks (keras, theano, tensorflow, etc).<p>Our team so far: <a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team</a>","time":1506976779,"type":"comment"}