{"by":"optile","id":15384344,"parent":15384262,"text":"optile in Munich, Germany (noremote (well, a little bit of remote work is already possible), fulltime, EU work permit preferred, but Visa possible)<p><a href=\"https:&#x2F;&#x2F;www.optile.net&#x2F;en&#x2F;company&#x2F;job-offers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.optile.net&#x2F;en&#x2F;company&#x2F;job-offers&#x2F;</a><p>optile is creating an open payment gateway that solves the pain involved in taking international payments and taking a lot of different payment methods in many different countries. We do this through a REST&#x2F;JSON API, a well thought-out architecture and intricate knowledge of the payment\nsystems that govern all of our lifes. We are growing fast and are\nexecuting a huge opporunity for the company with a number of big name customers now in the pipeline.<p>We have a very diverse team (over 20 nationalities) consisting of 40+ people.<p>I (Jonas Maurus, the person posting this) have just recently taken on the responsiblity of CTO and was positively surprised by the culture I already found in the existing team. I am now continuing to foster it. optile is firmly based on mutual respect, hiring smart people and getting out of their way (aka taking responsiblity), honest feedback and transparency. Work here is challenging, but also fun and I personally focus on creating a team of happy humans who build great software. We pay competetive wages and have a good track record of providing incentives through equity for all employees. There are free soft drinks, beer, coffee and fruit.<p>We do have remote positions available in building payment method adapters, as the adapter team is the one that has most experience and the cultural tenets to work remotely, but the core team and the company is still local to Munich. One thing can lead to another, though :).<p>That said, we are looking for:\n- Java developers of all kinds (junior, senior, you name it). The\nadapter developer position mentioned above needs more of a &quot;senior&quot; profile.\n- ReactJS&#x2F;Redux&#x2F;ReactNative developers (junior, senior, you name it)<p>We are also looking for candidates in &quot;not typically HackerNews&quot;\npositions: Vice President Customer Success, Internal Operations Manager (Office support etc), Junior IT Support, and a variety of positions for working students.<p>Experience with MongoDB, Spring, PostgreSQL, Lodash, D3.js, Vertx, a good understanding of cryptography, previous payment experience, risk models and machine learning are all a plus.<p>We&#x27;re looking forward to meeting you. Please apply through the link above.","time":1506956916,"type":"comment"}