{"by":"aaroneous","id":15389110,"parent":15384262,"text":"ShopPad | Software Engineer (Full-stack) | Oakland, CA | ONSITE | <a href=\"https:&#x2F;&#x2F;www.theshoppad.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theshoppad.com</a><p>ShopPad is one of the largest solution providers for Shopify&#x27;s eCommerce platform. We work with exciting companies like Tesla Automotive, General Electric, Sundance Film Festival, Acer Computers, Starwood Hotels &amp; Resorts, Nine West, 5-Hour Energy Drink and many more to deliver eCommerce experiences that perform and delight. Our founders are experienced entrepreneurs and we&#x27;re backed by some of the best angels in the Bay. Our office is located in Oakland&#x27;s Uptown neighborhood — just a few blocks from 19th Street BART.<p>About You: You&#x27;ll be working with PHP 7, JavaScript (React), HTML5, CSS3, Git, the Linux command line, MongoDB, with some Node mixed in. Familiarity with eCommerce, Shopify, 3rd-party API&#x27;s or AWS is a plus, so be sure to mention if you have a background in any of those. Experience comes in many forms and passion goes a long way, so please consider applying even if you aren&#x27;t intimate with our entire stack.<p>About The Role: As a full-stack developer on our apps team, you&#x27;ll work with a small, close-knit team to create beautiful products at scale. You&#x27;ll be empowered with the authority to make decisions that materially affect the company&#x27;s future. This is a great place for builders, makers, and hackers who want to create something great. You will own everything you build, being responsible for architecture decisions and scaling your solution to meet customer demand.<p>Compensation includes: competitive salary, equity, medical&#x2F;dental&#x2F;vision&#x2F;commuter benefits. A fully-stocked kitchen with food &amp; beverages. PTO with 15+ paid holidays (incl. some fun ones like your birthday, Valentine&#x27;s day, St. Patrick&#x27;s Day, Halloween, etc). Flexible hours where everyone has the option to work from home &#x2F; remote once a week.<p>If you&#x27;re excited about having a big influence on software used by millions of online shoppers every day, then we&#x27;d love to hear from you!<p>Please send your resume and cover letter briefly explaining why you&#x27;re interested to careers-417@theshoppad.com","time":1506990668,"type":"comment"}