{"by":"yosito","id":15388706,"parent":15384262,"text":"Senior Node&#x2F;Python Developer \nGreenbelt, MD | ONSITE | NASA (SSAI Contract)<p>SSAI is looking for a highly qualified, seasoned software developer who values exploration, discovery, efficiency, and finding resolutions to complex issues.  This individual must be self-motivated, demonstrate initiative, exhibit a strong work ethic, and have excellent written and verbal skills, time management, organizational skills, as well as the ability to work in a distributed team environment.<p>Our team provides architecture, development, and operations support for NASA’s Global Imagery Browse Services (<a href=\"https:&#x2F;&#x2F;earthdata.nasa.gov&#x2F;gibs\" rel=\"nofollow\">https:&#x2F;&#x2F;earthdata.nasa.gov&#x2F;gibs</a>), an open-source (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;nasa-gibs\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;nasa-gibs</a>) web service designed with the goal of advancing user interactions through full-resolution earth science data visualizations captured by NASA’s Earth observing satellites.  On a daily basis, thousands of users explore the past and present state of the planet to support a wide range of activities – from locating remote forest fires to navigating around ice laden seas to tracking the progress of tropical cyclones.  Our goal is to enable this exploration and discovery of our ever-changing and evolving Earth.  Additionally, we are committed to open source ideals and believe in sharing what we’ve done while learning from others.<p>You’ll work closely with our engineers, developers, operators, and our NASA customers to develop and support GIBS as it migrates its existing Linux-based on-premises system into an Amazon Web Service cloud-computing environment. Your primary responsibilities will include:<p>- Participate in software requirements and test plan reviews\n- Mature an AWS cloud-based software design, integration process, and deployment model\n- Develop open-source software leveraging AWS services\n- Support operations and testing activities<p><a href=\"https:&#x2F;&#x2F;www.ssaihq.com&#x2F;employment&#x2F;careers&#x2F;Careers.aspx?adata=EH8tklwxi692YNGoVXnOQdUgK%2bpURSHR0SRRYl1zXMTGhezkvlUiA8hixIOhlJu6Aln959zWdPrUfjwU6N3XWFxmdunU4NTeOAY3g1bgeZMZm1mmDdPR1ZOJudWLSwaaFZjxkYeM6cJbCBRH0BZUiIa4p%2bVGL19dAIQVuT%2f29KBzC6BAmhxgHNN9lNmf46KSog%3d%3d\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ssaihq.com&#x2F;employment&#x2F;careers&#x2F;Careers.aspx?adata...</a>","time":1506985154,"type":"comment"}