{"by":"elementsNL","id":15390972,"parent":15384262,"text":"Elements Interactive | Fullstack developer (Python&#x2F;Django) | Almere, The Netherlands | Full-time | ONSITE <a href=\"https:&#x2F;&#x2F;www.elements.nl\" rel=\"nofollow\">https:&#x2F;&#x2F;www.elements.nl</a><p>For one of our long-term clients (M.I.C.), we are searching for a dedicated developer that will work exclusively on improving their platform.\nWe have developed a platform, in which customers can create and manage interaction campaigns by uploading their users and inviting them to participate. Invitations are sent by an interactive SMS (in nearby future e-mail or push notifications) and users participate by clicking on the personal link in the invite. As a result of that, a campaign is started in the browser. Participating users generate data and conversion. M.I.C offers real-time KPI reports that allow the customers to see results and track conversion.<p>WHAT YOU WILL DO<p>This position offers a high degree of freedom in terms of implementing new ideas and improvements. You will work on a variety of tasks related to our platform such as developing new and optimizing existing functionalities, maintaining and extending our API’s and integration with customer systems. You will also work on developing and maintaining our SAAS solution, including online onboarding, billing and customer management. Furthermore, you will optimize performance and scalability and create and check unit tests.<p>WHAT YOU NEED<p>* At least a BS degree in a related field * At least 3 years experience with professional programming and development, including 1 year experience with Python&#x2F;Django * Knowledge of (X)HTML, XML, CSS, JavaScript, Ajax and related technologies * Preferably knowledge of and experience with Ansible * Excellent English language and communication skills<p>PLEASE NOTE - We are not able to offer VISA sponsorship for this specific position and can therefore only accept applicants with a valid EU work permit.<p>BENEFITS<p>* We offer you a place in our diverse, enthusiastic and highly technically oriented team of developers, where you get to teach and learn at the same time<p>* We provide you with the equipment of your choice, free lunch every day, snacks and unlimited freshly ground coffee<p>* We have flexible working hours and a possibility to occasionally work from home<p>* We encourage you to visit events and&#x2F;or take courses to keep up-to-date and learn new skills<p>* And to top it off, what would work be like without fun? You could get your fair share at our regular company events and Friday beer &amp; game afternoons, or by diving into the nostalgia of your childhood on our arcade machine<p>Do you see yourself in these words? Then we&#x27;d love to hear from you!<p>Read more &amp; APPLY HERE: <a href=\"https:&#x2F;&#x2F;elementsinteractive.workable.com&#x2F;j&#x2F;595556CC6A\" rel=\"nofollow\">https:&#x2F;&#x2F;elementsinteractive.workable.com&#x2F;j&#x2F;595556CC6A</a>","time":1507019082,"type":"comment"}