{"by":"patman_h","id":15409320,"parent":15384262,"text":"Hive.co (YCS14) | Full-Stack Software Engineers &amp; Designers | Kitchener&#x2F;Waterloo, ON, Canada | FULL TIME ONSITE | <a href=\"http:&#x2F;&#x2F;www.hive.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.hive.co</a><p>Hive is a Y-Combinator backed smart email platform that helps thousands of brands personalize and automate their marketing campaigns. Our technology helps brands sell more stuff, while keeping their customers happy, engaged, and spending money.<p>Our tight-knit team is a bunch of hackers and hustlers, and we split our time between offices in Waterloo and Los Angeles. You’ll be engineer #3 or designer #1 on our product &amp; engineering team in Kitchener.<p>Required Skills:<p><pre><code>  - Passionate about building things. You&#x27;ve got side projects you&#x27;re proud of and you probably read Product Hunt, Twitter, or Hacker News more than is healthy.\n  - When it comes to design and development, you&#x27;re comfortable owning, designing, building, and shipping your own features&#x2F;products\n  - You love thoughtful, clean design with an emphasis on usability and our users’ needs\n  - You thrive or want to thrive in a startup environment\n  - Brands, e-commerce, large amounts data and innovative marketing campaigns get you excited\n  - You&#x27;ve built things with our stack before (or can google and learn how to quickly):\n    - Python&#x2F;Django (MySQL&#x2F;Redis) web app, jQuery and CSS (LESS) on the front end\n    - Celery (RabbitMQ) for billions of asynchronous data-processing tasks\n    - MongoDB&#x2F;Elasticsearch for big-ish data\n    - AWS Stack (RDS, EC2, ELB, S3, Lambda, Redshift, Elasticache)\n    - Git (Github) for source control and code reviews, whatever code editor you like\n  - You might have a great CS or Engineering degree, or something else, or you dropped out, or you didn&#x27;t even go to school! Our team is made up of all kinds of smart people.\n</code></pre>\nBottom line... We&#x27;re looking for fast learners who are passionate about what we&#x27;re building. You&#x27;ll be well taken care of: meaningful equity, salary, and the benefits you need to be happy &amp; healthy.<p>Finally (and most important), culture is important to us. After a few days of busy work, you&#x27;ve got to know how to let loose - our team loves everything from concerts and music festivals, to ski trips and tech talks - and of course, whatever you’re in to!<p>Here&#x27;s our open positions: <a href=\"http:&#x2F;&#x2F;www.hive.co&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.hive.co&#x2F;jobs</a><p>If you want to talk directly or have any questions: patrick [at] [our domain] (no recruiters, please!)","time":1507212857,"type":"comment"}