{"by":"akshxy","id":4857771,"kids":[4858968,4866862],"parent":4857714,"text":"Rails Hacker/ Chief Technical Officer<p>Mumbai, Helsinki, San Francisco<p>What’s in it for you?<p>Early mover advantage as we are still a small start-up and building a growth team like those at Quora, Facebook, Slideshare. You will be our first full-time Ruby Developer with your key responsibility being to own anything back-end related. You will be part of the new product team and work closely with our Front-End &#38; UX/UI team. Opportunity to work with really talented engineers, designers and growth hackers to build products that you will be proud of. Culture of high performance, flexibility and responsibility with hack days every other weekends. Your views will be heard because we strongly believe everybody plays a critical role. Work exchange platform if you like balancing multiple projects. Enjoys beer/wine/etc… nothing like a cold beer down the pub after work on a Friday<p>Compensation<p>Salary plus equity package,\nOpportunities to travel and attend/speak at industry events,\nSubsidized membership Gym, swimming pool.\n100% Paid Medical, Dental &#38; Vision benefits, \nCatered hot lunches and breakfasts!\nAfter 6 months you will have the opportunity to work from home once a week.\nAn awesome team who love what they do!<p>Requirements<p>5 years of programming experience with at least 3 years of Ruby and Rails experience,\nGithub profile,\nHelp make UI and UX decisions,\nExperience building and scaling applications with Ruby on. Rails.\nExperience with jQuery, Backbone, or similar JS frameworks, \nRESTful web service API development.\nExperience using and/or building APIs.\n <p>Bonus points if,<p>You blog,\nYou have startup experience,\nYou are familiar with hackathons,\nYou have knowledge of Agile Development Methodology,\nYou know top 30 things you want to do in life,\nYou meet deadlines and you do it all before lunch.<p>Company Overview<p><a href=\"http://sugardoctor.in/\" rel=\"nofollow\">http://sugardoctor.in/</a><p>Sugar Doctor is India's 3.0 healthcare company. The founders are industry veterans with more than 15 years of experience and were the first ones to come up with a specialized diabetes treatment centre in India in 1996. Till date our founders have treated over 150,000 patients from countries like India, US, Qatar, Oman, Saudi Arabia, Yemen, UAE, Iraq, South Africa, Ethiopia, Tanzania and Kenya and still leading the charts. \nUnleash your talent for impacting the life of 347 million people worldwide who have diabetes. Join our team of doctors and growth hackers.<p>How to apply<p>Email us-\takshay@sugardoctor.in<p>Know someone who might be interested? Spread the word and earn $300 if we end up hiring you or someone you refer.","time":1354373709,"type":"comment"}