{"by":"timanglade","id":4857745,"kids":[4859173,4860283],"parent":4857714,"text":"Apigee (Palo Alto, REMOTE, H1B) — Developer Advocates, Java Developers, Mobile Developers.<p>Apigee is dedicated to powering the API &#38; Mobile revolutions. We are helping thousands of developers build API-driven infrastructure and mobile apps every day. Our technology is used at Gilt, Getty Images, Tout, Walgreens, OnStar, eBay, GameSpy, Citrix, AT&#38;T, Pearson, ConstantContact, Best Buy, Dell, Comcast and hundreds of others.<p>We offer catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>We are actively hiring for App Services (our Mobile Backend-as-a-Service technology). Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is currently in open Beta. We are built on top of Jersey, Jackson and Cassandra (we gutted a lot of the latter and built our own indexing system, query system, storage format and multi-tenancy strategy on top of it).<p>Our newest open position is Developer Advocate. Our developer advocates partner up with indie developers &#38; startups to ensure they have a successful launch on our platform; meet people from all walks of life from around the world and help them build apps and APIs; bring feedback from the trenches to the product. This is not solutions architecture or community bootstrapping. This is about helping our existing, vibrant community of indie developers into being even more successful than they already are without our help :) (More details here: <a href=\"http://apigee.com/about/jobs/developer-advocate\" rel=\"nofollow\">http://apigee.com/about/jobs/developer-advocate</a>)<p>We are also looking for Java Developers to join our Core team and help us overcome the next-generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>Finally, we are looking for Mobile developers with at least 1 year experience in one of iOS, Android or JavaScript+HTML5 development to work on our SDKs and a range of exciting mobile apps.<p>Want to apply? Have some questions? Want to join but don’t match either position? Then get in touch! ➝ tim@apigee.com","time":1354373316,"type":"comment"}