{"by":"akshxy","id":4857779,"kids":[4857801],"parent":4857714,"text":"User Experience Designer/ Chief Architect<p>Mumbai, Helsinki, San Francisco<p>What’s in it for you?<p>Early mover advantage as we are still a small start-up and building a growth team like those at Quora, Facebook, Slideshare.\nOpportunity to work with really talented engineers, designers and growth hackers to build products that you will be proud of.\nCulture of high performance, flexibility and responsibility with hack days every other weekends. \nYour views will be heard because we strongly believe everybody plays a critical role.\nWork exchange platform if you like balancing multiple projects. \nEnjoys beer/wine/etc… nothing like a cold beer down the pub after work on a Friday.<p>Compensation<p>Salary plus equity package. \nOpportunities to travel and attend/speak at industry events.\nSubsidized membership Gym, swimming pool.\n100% Paid Medical, Dental &#38; Vision benefits. \nCatered hot lunches and breakfasts!\nAfter 6 months you will have the opportunity to work from home once a week.\nAn awesome team who love what they do!<p>Requirements<p>Experience- 3 to 5 years.\nDribble profile or portfolio link.\nKnowledge of HTML5, CSS3, Javascript, Jquery.\nIn-house means work and office at one place and therefore can adjust in our startup family.\nWe expect you to be Dustin Moskovitz and not Eduardo Saverin.\nSense of humor. We work hard but it shouldn’t feel that way.\nIndependent, self-starter who can hit the ground running from day one.<p>Bonus points if,<p>You blog,\nYou have startup experience,\nYou are familiar with hackathons,\nYou have knowledge of Agile Development Methodology,\nYou know top 30 things you want in your life,\nMeet deadlines and you do it all before lunch,<p>Key Responsibilities<p>Creating parallax scrolling websites,\nDeveloping UI drag and drop,\nDesign goodies like a Github store, \nCreating dynamic Infographics,\nInternal promotional materials for print and video,\nDeveloping e-commerce and transaction based applications,\nExtending JavaScript frameworks, Developing UI Controls, Plugins and Widgets.<p>Company Overview<p><a href=\"http://sugardoctor.in/\" rel=\"nofollow\">http://sugardoctor.in/</a><p>Sugar Doctor is India's 3.0 healthcare company. The founders are industry veterans with more than 15 years of experience and were the first ones to come up with a specialized diabetes treatment centre in the country in 1996. Till date our founders have treated over 150,000 patients from countries like India, US, Qatar, Oman, Saudi Arabia, Yemen, UAE, Iraq, South Africa, Ethiopia, Tanzania and Kenya and still leading the charts. \nUnleash your talent for impacting the life of 347 million people worldwide who have diabetes. Join our team of doctors and growth hackers.<p>How to apply<p>Email us\takshay@sugardoctor.in<p>Know someone who might be interested? Spread the word and earn $300 if we end up hiring you or someone you refer.<p>Good designers follow the rules. Great designers understand the rules and then bend them in ways that make products even better for users.","time":1354373876,"type":"comment"}