{"by":"seldo","id":4858969,"parent":4857714,"text":"San Francisco, CA. Full time. H1B okay.<p>Sharing over social media is driving an ever-increasing percentage of web traffic, and becoming more central to the adoption and spread of every type of application. But app developers are flying blind -- not only are traditional web analytics very bad at tracking social traffic due to the rise of mobile clients and increasing prevalence of HTTPS, but even when they have the numbers, they don't have actionable data.<p>That's the problem awe.sm solves: our platform tracks sharing behavior and results, and ties them back into meaningful metrics -- whether thats page views, signups, or a dollar value in sales. Our APIs and drop-in integrations allow developers to integrate social data deeply into their products without needing to reinvent the wheel (and our wheel is really shiny).<p>We're an engineering-driven team building products primarily for other developers, so we're passionate about providing an amazing experience for developers. To help us get there, we're looking for a Developer Experience Lead, which you might also call a Platform Evangelist. By that we mean somebody who will own the experience a developer has using our product: somebody who understands deeply how to get the most out of awe.sm, and has the communication skills to get that information to developers. That will mean representing awe.sm at hackathons, conferences and other developer events, and being the primary point of contact for developers building on our platform on Stack Overflow and other forums. We want you to find the pain points before our customers do, and feed that information back to the engineering team, so we can adapt our product to real-world needs.<p>This is an unusual role, combining technical talents with public speaking and writing skills, but for the right person it's a dream job, and there's no role more critical to our growth right now.<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 14 people right now. We have a cool office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1354395716,"type":"comment"}