{"by":"sugarbear","id":4858646,"kids":[4859133],"parent":4857714,"text":"Disqus - San Francisco, CA<p>Disqus is building the largest conversation platform on the internet. Our embedded comment service sees more than 6bn pageviews monthly, but we're working on more than just comments (check out <a href=\"http://allthingsd.com/20121130/the-future-of-disqus-aims-at-better-discovery-trolls-not-welcome/\" rel=\"nofollow\">http://allthingsd.com/20121130/the-future-of-disqus-aims-at-...</a>).<p>Our core technologies include javascript with backbone.js, python / django, cassandra, and postgres - though we're always experimenting with new stuff.<p>We're a small engineering team, and we need your help to grow. Here are some of our open positions:<p>* Full-stack Web Engineer. Build the future of disqus.com, focusing on: user features, the moderator dashboard, real-time analytics, and payments for new signups and advertising.<p>* Software Engineer - Infrastructure. Use Python to scale and improve our core architecture, hack on our constantly evolving API, and increase our system reliability.<p>* Core JavaScript Engineer. Work on our widely distributed embedded commenting platform / Backbone.js application (reaching millions of users daily).<p>* Operations Engineer. Help improve uptime and speed up our response times in our backend infrastructure. We're on dedicated hardware running postgres, cassandra, redis, and memcache. Lots of freedom and exposure to all aspects of our stack here.<p>* Automations Engineer. Automate all the things, specifically our testing, packaging, deployments. Work on building new tools to speed up development and improve code quality.<p>We've got a strong culture of open source (<a href=\"https://github.com/disqus/\" rel=\"nofollow\">https://github.com/disqus/</a>) and passionate voices in the community (e.g. <a href=\"https://github.com/dcramer/\" rel=\"nofollow\">https://github.com/dcramer/</a> &#38; <a href=\"https://github.com/benvinegar/\" rel=\"nofollow\">https://github.com/benvinegar/</a>).<p>If you're interested in joining us (even if you have a passion that doesn't match up with the postings above), drop me a line: mike@disqus.com","time":1354389291,"type":"comment"}