{"by":"iconfinder","id":4858104,"parent":4857714,"text":"Iconfinder - Copenhagen, Denmark<p>Full-time developer<p>IconFinder is looking for an awesome full-time code slinger to join our development team and jump straight into moving our core platform forward. Being both a search engine and an e-commerce marketplace for icons, we're looking for a hacker with a passion for all things Web.<p>We're working full steam on providing not only the best search experience but also the best shopping experience for icons. At the heart of our platform is a young Django application backed by a PostgreSQL database and an elasticsearch cluster, which is used by more than 2.5 million people every month.<p>We're looking for an inspired, self-motivated and creative developer, who wants to make a dent and inspire others to do the same. As we've only just scratched the surface of our ideas and the opportunities Iconfinder holds, we're looking for a savvy colleague to help us move Iconfinder ahead even faster.<p>Need to have<p>At least two years of professional Python web development experience.\nSolid frontend expertise including experience using HTML5, CSS and JavaScript.\nExperience in working on database-driven (PostgreSQL or MySQL) web applications using open source MVC-esque frameworks (Django, Rails, etc.), and running them in production on Linux systems using open source stacks (nginx, memcached, Redis, the lot.)\nAn unquenchable thirst for knowledge and a solid amount of professional pride.\nAn eye and love for design.\nNice to have<p>Knowledge about Django.\nA relevant degree, like computer science or graphic/web design.\nSemi-mad design skills.\nAppreciation for great coffee.\nInterested?<p>Please send your resume and/or GitHub profile etc. to jobs@iconfinder.com. If you have additional questions, feel free to call Martin at: +45 61 69 67 81.<p>Our offices are in Copenhagen, Denmark. We are currently working from the office sharing space, Founders House.","time":1354379565,"type":"comment"}