{"by":"davidblondeau","dead":true,"id":4858750,"parent":4857714,"text":"Burlingame, CA (next to the San Francisco airport)<p>Collaborative Drug Discovery (CDD - <a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>) is the first real SaaS informatics platform. Every day, scientists around the world use CDD to manage, analyze and collaborate around their data. This type of collaboration is crucial to research on under-funded diseases like Tuberculosis and Malaria and strategic for many players in the industry. Our long list of customers includes academic labs, biotechs, pharmas, government agencies and worldwide foundations like the Bill &#38; Melinda Gates foundation.<p>We think the world has seen too many ugly scientific applications. We care about usability and details. Our team ships code quickly and iteratively. We think design and community management are as important as great technology.<p>We believe a few great people can make a big difference. We strive to embody our name and empower every CDD employee to do their best work. This means working collaboratively, and giving every person ownership and responsibilities.<p>++Senior Software Engineer++<p>As an engineer, you will have a huge impact on how we design, build and deliver our application. You should be a generalist and enjoy working across the software stack. Our current technologies include Ruby (Rails), MySQL, Javascript, Java, and Solr.<p>We look for engineers who love finding efficient, thoughtful, and highly useable solutions to a variety of technical and product challenges. You should strive to write efficient, maintainable code and you should enjoy fast iterations.<p>Sample projects include:<p>* Designing a flexible model and flow that allow scientists to invite collaborators and selectively share data with them.<p>* Building and maintaining an API for third party developers and integrations.<p>* Developing interactive graphical representations for the analysis of chemical and biologic data.<p>* Optimizing import, export and computation of large data sets.<p>To apply, please contact work@collaborativedrug.com with your resume, cover letter, and links to things you’ve built.","time":1354391451,"type":"comment"}