{"by":"0xa","id":4858362,"parent":4857714,"text":"Tumblr, New York, NY (NYC, Manhattan): FULL TIME Software Engineers (Scala, Java, Go), PHP Developers, Database Engineers (MySQL), and a Site Reliability Engineering Lead (Linux, Nginx, HBase, HAProxy, Memcached, and OpenTSDB)<p>Tumblr is actively hiring experienced engineers at every layer of our technology stack.  We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility.  We work in an open, friendly and positive environment that encourages intellectual curiosity, a love for open source, and empowering millions of users to create and explore content. I'll highlight a few positions here, but you can see an awesome photo of Tommy the Pomeranian with Mayor Bloomberg, our great benefits, and the complete listing of open positions at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): Writing generic, reusable services in Scala or Go, you'll design, code and grow a blazingly fast platform for our PHP application.  Being a productive coder with architecture common sense is a must, but expertise in Java or JVM tuning is a plus.<p>* Database Engineer (<a href=\"http://bitly.com/U0VK2P\" rel=\"nofollow\">http://bitly.com/U0VK2P</a>): You'll scale and organize our data persistence layer to a level few sites can match.  We'll love your MySQL expertise and eye for efficiency.<p>* Search Engineer (<a href=\"http://bitly.com/TcOdt8\" rel=\"nofollow\">http://bitly.com/TcOdt8</a>): Real-time search and analysis is your forte.  Using your large-scale experience with building and innovating search backends, you'll tune our evaluation algorithms and expand the software infrastructure.<p>* Site Reliability Engineering Lead (<a href=\"http://bit.ly/Uyy04u\" rel=\"nofollow\">http://bit.ly/Uyy04u</a>): As the team lead, you are an inspiring software developer with a passion for the highly performant, fault-tolerant, massively distributed systems that make Tumblr fast, reliable and available for hundreds of millions of visitors and tens of millions of users.<p>* Product Engineer (<a href=\"http://bit.ly/ToF7Ya\" rel=\"nofollow\">http://bit.ly/ToF7Ya</a>): You're a versed engineer and perfectionist with good taste, ready to take ownership of entire features of our PHP application.<p>About Tumblr:<p>Founded by David Karp in New York City in 2007, Tumblr is a microblogging platform that allows users to effortlessly share anything. Tumblr now hosts over 70 million blogs with over 30 billion posts to date. Our pageview to engineer ratio is 0.5 billion PV per month to 1 engineer. This means every line of code every developer writes has a huge impact. We are focused on building tools and technologies that will advance the state of the art in dealing with massively scaled websites as we quickly grow past 50,000 requests and 1,400 posts per second. We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1354384303,"type":"comment"}