{"by":"peterlai","id":4859110,"parent":4857714,"text":"Crocodoc (YC W10)<p>San Francisco, CA | Full time | Director of Product<p>## Description<p>Crocodoc’s HTML5 document collaboration platform reaches tens of millions of users, and our business is profitable and growing fast. Our customers include Dropbox, LinkedIn, and Yammer, and we're funded by investors including YC, SV Angel, 500 Startups, and top angels from Silicon Valley.<p>Right now we're inundated with sales inquiries from SMB customers who want to embed documents within their web and mobile applications. We’re looking for a multifaceted candidate to take charge of our SMB product and blow it out of the water. This is a key leadership role with enormous growth potential.<p>## Responsibilities<p>- Talk to LOTS of prospective customers (both product managers and developers)<p>- Develop our SMB product offering<p>- Optimize our pricing plans and product tiers<p>- Develop a scalable sales process and design a self-service experience<p>- Develop user acquisition strategy (everything from inbound marketing to direct sales)<p>- Qualify leads, own our sales pipeline, and close lots of deals<p>TL;DR: you must be capable of growing our SMB product like crazy while wearing many hats in the process.<p>## Qualifications<p>- World-class ability to communicate with clients and develop customer relationships<p>- Experience with SaaS and/or B2B technology solutions<p>- Basic technical experience (you’ve written a web app) required<p>- Sales experience (you’ve closed deals before) strongly preferred<p>- Startup experience (you can set own agenda and thrive in a fast-paced environment) a plus<p>- Product experience (you understand principles of UI and UX) a plus<p>- Product marketing experience (you’ve been responsible for user acquisition) a plus<p>This is a tremendous opportunity to own an entire product from soup to nuts. If you think you'd be a great fit, please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.","time":1354398173,"type":"comment"}