{"by":"cyberco","id":4887253,"parent":4857714,"text":"INTERN: Software engineer at Paylogic (Groningen, The Netherlands)<p><i></i>Job Description<i></i>:<p>As a Software engineer you will be working on many technical challenges of a fast growing, highly available online ticketing system in a international (English speaking) team of over 15 friendly Python experts. Paylogic has a professional software development environment to ensure maximum quality and a minimum of distraction. Paylogic strives to give software engineers as much freedom and responsibility as possible. Salary is in line with market and experience.\nPython is Paylogic's tool of choice and it is used for everything from the ORM database layer (SQLAlchemy) to DevOp scripts to managing large clusters in the cloud (AWS), and for web apps (Django, Flask) to continuous integration tools (Jenkins).<p><i></i>Requirements<i></i><p>You are an experienced, passionate and professional software developer with a hacker mind-set and a love for open source and Python. You are pragmatic and positive and expect the same from your environment. You have the social and technical skills to inspire others. You have studied computer science or something similar. A working permit for The Netherlands is not required but would be handy. It would be great if you have experience with highly available and highly scalable web applications, database techniques or cloud computing.<p><i></i>About Paylogic<i></i><p>Paylogic is a successful, international ticketing company from The Netherlands. Her service has to meet the highest standards regarding scalability, availability and security. The technological standard within the company is high. As is the humor standard. The development department is situated in an office at the center Groningen, one of the liveliest towns in The Netherlands. World class science, bars and culture right next door. Every year in May Paylogic organizes pygrunn (.nl), a renowned high-tech developer conference about/for Python and its friends.<p><i></i>Contact<i></i>: \nHarmen Zijlstra - jobs@paylogic.nl\n<a href=\"http://corporate.paylogic.nl/en/jobs/\" rel=\"nofollow\">http://corporate.paylogic.nl/en/jobs/</a>","time":1354893744,"type":"comment"}