{"by":"luluvise12","dead":true,"id":4186109,"parent":4184755,"text":"London, England<p>iOS Developer at Luluvise<p>--<p>Overview\nLuluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>Job Description<p>The company is looking for an iOS Developer to join as a key member of the team.  You will be working closely with the CEO, product and engineering teams. You will work in a collaborative environment, which is diverse and open-minded.<p>Responsibilities<p>•\tDevelop, implement, and maintain new features \n•\tEnsure the mobile experience is consistent with overall company/product proposition, including user experience, data handling/retention and feature interaction\n•\tDefine and document mobile experience (site/app/interaction) goals\n•\tDrive mobile testing, usability tests and focus groups – and incorporate feedback into iterations\n•\tResponsible for app store submission/process and mobile go-to-market requirements\n•\tContinually keep the company up-to-date with current best practices in mobile experiences<p>Job Requirements<p>•\tExperience with iOS, Objective C or Cocoa Touch \n•\t1 year minimum experience in mobile application development\n•\tFamiliar with fundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis\n•\tProficiency in, at least, one modern object-oriented language such as Objective C (preferred), C++, or C#\n•\tGood communication skills and team work skills\n•\tMust possess an entrepreneurial mindset and spirit<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Apply by sending us your CV to careers@luluvise.com","time":1341176278,"type":"comment"}