{"by":"rickyyean","id":4187508,"parent":4184755,"text":"We are! We are hiring our first employee at Crowdbooster (YC S2010).<p>We've built the best way for businesses to get fast, actionable data about their social media accounts. Tens of thousands of businesses use us every day, including Fortune 500 companies, advertising agencies, coffee shops, sports teams, rappers, politicians, and more.<p>Some more things about us:<p>-We have a legit technical team including two Stanford engineers with backgrounds in machine learning, human-computer interaction, and databases.<p>-We believe in simplicity, minimalism, and creating things that are a joy to use.<p>-We're here to help businesses use social media to build real relationships, not spam, and we’ll never compromise on that.<p>-We're funded by some of the best early-stage investors in the valley, including SV Angel, Charles River Ventures, Y Combinator, and several early investors and employees of Facebook, Twitter, and Slide.<p>What we'd like to see from you:<p>-While your peers might describe you as a rockstar, the term embarrasses you. We love rockstars (many of them are Crowdbooster users!), but we've made a conscious decision to have a culture that revolves entirely around our product, not our egos.<p>-You've wrestled with big data before. Crowdbooster requires storing terabytes of data, extracting insights using statistical learning techniques, and making it available to our users in real-time.<p>-That said, you like working at every level of the stack, not being pigeonholed as a backend developer.<p>-You care a lot about the products you ship, and don't need a manager or \"product guy\" to motivate you to get every detail right.<p>-You're familiar with several parts of our stack, and willing to learn the rest. We use Python, Django, MySQL, Redis, Memcached, jQuery, Protovis, RabbitMQ, Celery, HAProxy, EC2, git, and more.<p>-You have projects of your own to show us. It doesn't matter whether it's an open source project, a startup idea, or just a really fun toy project. Just as long as you shipped it.<p>If this fits you, definitely email us at jobs@crowdbooster.com","time":1341207679,"type":"comment"}