{"by":"ajohansson","id":4189605,"parent":4184755,"text":"London, UK, Full time<p>A rare opportunity for a Linux/C++/SQL developer to work at the leading edge of live video analytics and big data management!<p>Crowd Vision is an exciting early-stage London-based technology company with ambitious near-term growth plans. The company has a unique software product that automatically analyses crowded scenes from video feeds in real-time to provide actionable intelligence to a wide range of customers.The company is now investing in further developing and optimising the product. R&#38;D plans are in place and include optimisation of architecture, algorithms and user interfaces. In addition a new remote web-based service variant of the product (\"Cloud Vision\") is being designed, developed, tested and productised.<p>The company’s new Tech Hub, now being formed, will be led by the CTO (and the original developer of the software) and include a Hub Project Leader, a Software Developer, and other Technical Support staff focused on product management and technical support to sales and customers. The Tech Hub will be located in central London in a pleasant creative environment intended for tech businesses. There will also be the opportunity for some home/mobile working amongst the team. The Software Developer will be a key member of the Tech Hub and involved in several different projects that require coding skills and experience.<p>The job will be fulltime and based in London. There may be a need/opportunity to travel on a limited basis. The chosen candidate can start immediately if available.<p>The ideal candidate will have: \n• Excellent coding skills in C++ and SQL \n• Solid experience of working in a Linux environment \n• Experience of and/or keen interest in: video processing, data extraction algorithms, big data management, the cloud-based real-time environment, user interfaces \n• Experience of, and respect for, best practice software development standards<p>For more information / to apply:\n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=3314124\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=3314124</a>","time":1341247590,"type":"comment"}