{"by":"lizfogcreek","id":4189061,"parent":4184755,"text":"New York, NY. Full Time. Fog Creek Software<p>System Administrator<p>Fog Creek Software is looking for experienced, unstoppable Systems Administrators. On our team, you'll work with top-notch developers and support engineers on the infrastructure behind our SaaS applications like FogBugz On Demand, Kiln, and Trello. You'll build tools and automation that will run the environment while you sip lattes. You'll help tune the infrastructure and help plan for future growth.<p>Requirements<p>At least five years of computing experience. You know the terrain, you know you love it, and you can't stop bragging about it.\nYou have a solid grasp of the programing tools at your disposal and know when to use each one.\nWorking experience with configuration management (Puppet/Chef/CFEngine) and monitoring (Ganglia/Nagios) systems.\nComfortable owning the infrastructure and pragmatically solving problems dealing with complex systems, even when the only error messages are in hex and you're at the far end of a 1200 baud telnet link.\nAt ease wearing lots of hats in a heterogeneous environment. Working with web servers &#38; databases, Windows and Unix, hardware and software.\nExcellent command of written and spoken English.\nPermanent legal right to work in the US (includes TN status).\nWilling to work in our New York City office. No telecommuting.\nBenefits<p>Competitive salary\nFree gym membership\nFree MetroCard\nFree lunch\nFree soft drinks and snacks\nFree DIY lattes\nComprehensive health insurance plan\n401(k) retirement plan with matching\nGenerous parental leave policy\nFlextime\nFour weeks paid vacation\nAll-expense-paid technical conferences\nTo apply, email us at jobs@fogcreek.com, attaching a current resume in HTML, Word, Plain Text, or PDF format. In the body of the email describe how you fit our first five requirements. Your application will be read by a real, live Systems Engineer, so please eschew the non-technical fluff in favor of serious details.<p>About Fog Creek Software<p>Fog Creek Software is a small, entrepreneurial software company in New York City founded in 2000. Our key products are FogBugz, Kiln and Copilot; all three have been very successful. We bootstrapped ourselves without outside investment and have been profitable from the beginning.<p>Fog Creek Software, Inc. does not discriminate in employment matters on the basis of race, color, religion, gender, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, disability, or any other protected class. We support workplace diversity.<p>More Information Here: <a href=\"http://www.fogcreek.com/careers.html\" rel=\"nofollow\">http://www.fogcreek.com/careers.html</a>","time":1341240188,"type":"comment"}