{"by":"johnkoscielak","id":4195054,"parent":4184755,"text":"FIS Global is currently recruiting for a Security Developer<p>FIS is one of the world's top-ranked technology providers to the banking industry. With more than 30,000 experts in 100 countries, FIS delivers the most comprehensive range of solutions for the broadest range of financial markets, all with a singular focus: helping you succeed. Every FIS solution has the strength you need for profitability today, and the power to help you manage whatever comes next.\nFIS is part of the S&#38;P 500. FIS has also been named the number one overall financial technology provider in the world by American Banker and Financial Insights (FinTech 100). \nJob summary:<p>Us: The Architecture Oversight and Framework &#38; Standards teams at FIS; the world's largest global provider dedicated to banking and payments technologies.<p>You: Security developer<p>Job: Work with a talented team of developers and architects to assist with ongoing work related to emerging threats. This is a hands-on position which will focus on implementation of specific security initiatives across the enterprise.<p>General duties and responsibilities:\n• Driving proof of concept, pilot, and implementation support activities for specified initiatives.\n• Researches, tracks and understands new technologies to provide technical leadership in developing service applications and analyzing business requirements as they pertain to intranet and external Internet-based systems.\n• Work with product teams on critical remediation activities\n• Builds applications and framework components\n• Builds custom rules for security code analyzer\n• Provides written design documents, test plans and test results.\n• Manages, develops, integrates and implements related applications components, including front-end development, server-side development and database integration.\n• Plays a direct role in programming, maintenance, technical support, documentation and administration of the applications.\n• Establishes and communicates standards to manage cost and ensure continuity of applications.\n• Suggests technical alternatives and improves/streamlines processes and systems\n• Completes project assignments and special projects commensurate with job expectations\n• Conducts planning, analysis and forecasting activities to plan projects and tasks\n• Performs other related duties as assigned.<p>Requirements:\nBachelor's degree in Computer Science, Engineering or a related discipline; or equivalent combination of education and experience that is required for the specific job level. Post-graduate education is desired.<p>Primary Location US-PA-Malvern PA\nOther Locations US-WI-Milwaukee WI, US-AR-Little Rock AR<p>ADA Disclaimer:  In developing this job description care was taken to include all competencies needed to successfully perform in this position.  However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation.  All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.<p>EEO/AA Employer<p>Please email resumes to john.koscielak@fisglobal.com","time":1341335688,"type":"comment"}