{"by":"LifeAfterCubes","id":4201749,"parent":4184755,"text":"San Francisco or Los Angeles, CA. Full time - This Week In<p>Incredible opportunity for a Business Development / Sales Executive to help shape the future of independent media at the Web TV network ThisWeekIn.<p>Corporate cogs, this isn't the job for you. Fire-in-your-belly entrepreneurs, you'll fit right in.<p>== Responsibilities ==<p>* Drive online advertising sales; meet and exceed sales goals\n * Starting, negotiating, and closing strategic partnership deals\n * Develop strong contacts with agencies and directly with clients\n * Assist in identifying and executing revenue-enhancing strategic partnerships\n * Work with sales management to create strategies to develop new vertical markets\n * Prepare proposals and respond to RFP's quickly, and with a high degree of quality\n * Prepare insertion orders and negotiate contracts to satisfy both the company's and the client's best interests\n * Maintain a thorough understanding of online advertising trends and major initiatives<p>== Requirements ==<p>* Bachelors degree\n * One to five years of sales experience selling for trade shows, print, B2B and/or podcasting\n * Strong organizational skills and the ability to manage your own agenda while working closely with others in a cross-functional role\n * Proven track record of success, with quantifiable results in previous sales positions\n * Excellent written and verbal communication skills, including proposal generation and presentation\n * Desire to work in a team-based, entrepreneurial company\n * Please include a resume and cover letter detailing why you're the best candidate for this position.<p>== About Us ==<p>ThisWeekIn, Inc. is a web television network covering a wide variety of topics from tech to entertainment. Produced out of our Culver City studios, our web shows feature expert hosts and guests who are founders, celebs, comedians, technologists and CEO's -- all keeping you on the bleeding edge of their industries. This position can be based in the LA or San Francisco area.<p>== To Apply ==<p>Please apply via our online form: <a href=\"http://mahalo.theresumator.com/apply/iA1yj0/Techsavvy-Business-Development-Sales-Exec-For-Web-TV-Startup.html\" rel=\"nofollow\">http://mahalo.theresumator.com/apply/iA1yj0/Techsavvy-Busine...</a>.","time":1341462740,"type":"comment"}