{"by":"CodeforAmerica","id":4227228,"parent":4184755,"text":"San Francisco, CA\nCode for America Fellow (Developer)<p>Are you hacker with a huge heart? Code for America is looking for developers to join its 2013 fellowship.<p>In previous years men and women left companies such as Google, Apple, and Microsoft to use their skills to give back.<p>Cities are under greater pressure than ever, struggling with budget cuts and outdated technology. That’s why Code for America is connecting talented technologists with city governments to harness technology, and innovate. Code for America is helping cities keep pace with the communities they serve by creating and implementing new applications and by demonstrating new ways of resolving local challenges. We’re making cities better, and you can help.<p>Join the “Peace Corps for Geeks.”<p>Code for America is now accepting applications for its 2013 fellowship program. If you want to write code while making a difference, this is your opportunity to build apps that will make city governments work better.<p>Why Become a CfA Fellow?\nDuring the 11-month program, you will not only receive a living-wage stipend, travel expenses, and healthcare, but also the training and mentorship to be a leader in business, local government, or both. You'll get:<p>Gov 2.0 Training\nYou will start with a crash course in municipal government and gain practical understanding of the vital intersection of government and technology.<p>Connections \nThe biggest names in the tech industry and the Gov 2.0 movement will provide you with unparalleled networking, mentoring, and support.<p>Professional Development\nWorking closely with other talented individuals, you will develop lasting relationships and learn new skills and language in a fast-paced, startup atmosphere.<p>The Code\nNot only do you decide what language to write in, or what technology to use, it’s all open source, and you’ll be contributing to non-profit GitHub repos.<p>A Labor of Love\nYou’ll not only accomplish a lot and make the world a better place, but you’ll have a lot of fun working with other passionate people. To borrow a line from the Peace Corps, it will be the toughest job you’ll ever love.<p>Code for America fellows are an elite group of individuals using their skills to make a difference.<p>Applications are due July 29, 2012. See codeforamerica.org/fellows for more information.<p>Apply online at: codeforamerica.org/fellows/apply","time":1341969915,"type":"comment"}