{"by":"benweatherman","id":11405973,"parent":11405239,"text":"Ordoro | Austin, TX | Full-time | Onsite (we&#x27;ll pay relocation)<p>Ordoro makes it easy for e-commerce businesses to ship orders and manage inventory. Everyday our software helps thousands of small businesses save lots of time and make more money by simplifying and automating the shipping process. It&#x27;s not a glamorous space, but we make it awesome. We&#x27;re well funded and have strong revenue.<p>We&#x27;re looking for an experienced engineer to start our devops team. You&#x27;ll help us transition from an aging Rackspace deployment to the crazy world of Amazon. We also need to step up our monitoring, logging, and alerting game.<p>We&#x27;re a small team so you&#x27;ll have the opportunity to make a huge impact. Our 9 developers code hard to make Ordoro awesome. We&#x27;re serious about having fun while we work and equally serious about taking time off to enjoy life. Bonus points if you can make us laugh or cry.<p>You&#x27;ll get the normal startupy benefits<p>- A paycheck<p>- Equity in the company<p>- Health, dental, and vision insurance<p>- 401k (though we don&#x27;t match yet)<p>- Unlimited time off<p>- Whatever gear you need for the job<p>More specifically, we want you to<p>- create best practices for continously deploying our apps on Amazon<p>- manage our current postgres, redis, and elasticsearch datastores<p>- lead the transition from Rackspace virtual servers to EC2, lambda, and other Amazon services<p>- increase visibility into the health of our apps with more cohesive monitoring, logging, and reporting<p>- worry about things like DNS, SSL, key management, and security<p>- use bash when you can and a higher level language when you must (we love python)<p>- have opinions about kubernetes, mesos, swarm, and their ilk<p>In the first 2 days you&#x27;ll commit and deploy code to production. In the first 2 weeks you&#x27;ll help us transition a small project from RAX to AMZN. In 3 months you&#x27;ll be completely responsible for all ops-related activities. In 6 months you&#x27;ll be running the company<p>Want to learn more? Hit me up at ben@ordoro.com or @benweatherman. Ready to apply? Tell me why you want to work with us.","time":1459527540,"type":"comment"}