{"by":"jetsnoc","id":11408549,"parent":11405239,"text":"KickBack Rewards Systems | Full Time | Remote (US primarily; will consider international for the right candidate.)<p><pre><code>  KickBack Rewards Systems\n  http:&#x2F;&#x2F;www.kickbacksystems.com\n  http:&#x2F;&#x2F;careers.kickbacksystems.com\n</code></pre>\nKickBack Rewards Systems is a privately held company that specializes in customer specific marketing and payments for over 3000 US clients. Our clients include a half-dozen Fortune 50 companies, one of them is an anchor partner in our national coalition loyalty program. All of that dribble means we have a market, a product fit and are now continually adding value and enhancing our platform.<p>As the CTO and Director of Software Development I need some help! You will be joining a medium sized department of 40 who all commit to their projects as a labor of love and their lives work. If you are interested in any of these positions my contact information is located under my profile.<p>Our stack? C (embedded device), Python (RESTFul web services), AngularJS, D3, MySQL, Chef, Ansible and I am certain I am missing two dozen things.<p>I manage the engineering, devops, qa and product teams. That means I get to guide our culture and values through hiring the right people and by setting the standard. I also get to reinforce boundaries, protect the team&#x27;s interests and ensure I&#x27;m facilitating an environment at KickBack that allows for a world-class engineering team. At KickBack you will be joining an open, transparent and honest environment. You&#x27;ll be treated with respect and you won&#x27;t be required to lower your standards. Yes, we&#x27;re a for profit business so at times compromises need to be made but they are discussed, debated and the negatives are understood very well when we do so.<p>We&#x27;re like any other company, we have some technical debt but we strive for perfection in ourselves and in our software product as much as the free market and customers allow. At any rate, we think our approach to management and operating a software development business is a breath of fresh air.<p>I need to fill the following roles:<p><pre><code>  - Senior Frontend Developer \n  - Senior Python Developer\n  - Senior Test Automation Developer\n  - Product Owner\n</code></pre>\nIf you&#x27;re interested in applying or hearing more, please email me.<p>NOTE: KRS has a healthy intern program but we keep a very personal and 1:1 relationship with our interns. Unfortunately, at this time I&#x27;m not able to take on any more interns but email me in six months once these roles are filled by exceptional candidates and my team leads and developers are ready to mentor future experts.","time":1459544189,"type":"comment"}