{"by":"jlees","id":11406348,"kids":[11435251],"parent":11405239,"text":"Riot Games - Los Angeles, CA &#x2F; St. Louis, MO - Onsite - Full-Time - Software Engineer<p>We make the game League of Legends, which by various metrics is the most played PC game in the world. That means we have some really fun problems that come with operating at scale, worldwide, 24&#x2F;7.<p>We&#x27;re hiring for a bunch of things (<a href=\"http:&#x2F;&#x2F;riotgames.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;riotgames.com&#x2F;careers</a>) in a few locations worldwide, but I wanted to specifically plug my team, Service Availability. We basically manage all the &#x27;behind the scenes&#x27; stuff from data centers to backend microservices. It feels like a tech startup within a game company -- many of our engineers have tech-industry backgrounds (Google, Amazon, Netflix, MS etc).<p>Engineering blog: <a href=\"https:&#x2F;&#x2F;engineering.riotgames.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;engineering.riotgames.com&#x2F;</a><p>We&#x27;re solving problems from the infrastructure layer up, making it easy for developers internally to launch and operate services worldwide, regardless of the underlying hardware&#x2F;cloud. e.g. building a Docker-based cluster, deployment and build tools, microservice frameworks and interoperability standards, monitoring, logging, and other developer-experience type features. We&#x27;re also working on services that use that stack to deliver awesome new things to players, e.g. the Riot API. We write a lot of Go, which I&#x27;m really excited about.<p>Our culture is also really interesting, especially for a games company. We&#x27;ve got some Fortune awards etc, but the TLDR is: we have work-life balance, we are focused around personal growth, individuals are very empowered to make change and be part of decision making, and we are very feedback-driven. If you like working in a silo we are not the place for you. We value engineering breadth and the ability to level others up.<p>If you&#x27;re a gamer with a tech industry background (you don&#x27;t have to be a massive League of Legends player, but if you hate the game, you probably won&#x27;t have a great time working here), you like developer platforms, microservices, distributed systems and scaling problems... we should talk. I&#x27;m jlees at riotgames dot com, Jellybear ingame, or you can apply via our site.<p>PS: Working at a games company surrounded by people who love games as much as you do is really freakin&#x27; cool.","time":1459529573,"type":"comment"}