{"by":"evtothedev","id":11405543,"parent":11405239,"text":"Snapdocs | Rails &amp; Data &amp; Product Engineers |San Francisco, CA | Full-time, onsite<p>Snapdocs (YC W14) is a early-stage, rapidly growing company looking to fill a variety of engineering roles. (Growth, amiright?)<p>The ideal candidate is someone who plans to become a lead engineer (or perhaps a product manager) in the not too distant future.<p>We&#x27;re a small team tackling the absolutely massive mortgage market. We&#x27;re bringing modern, elegant software to a field that still relies on fax machines and manilla envelopes. We bring security, efficiency and joy to a paper-based pillar of the US economy.<p>The type of problems we&#x27;re tackling involve workflow, product design, and data. Monolith vs microservice is an ongoing debate. We are working to find a good authentication pattern that allows for people to work across companies in multiple roles (which is trickier than you might think!). Domain Driven Design is our guiding light.<p>For data, it decides everything we do. We won&#x27;t start work on a new feature until we can point to the numbers we hope to move.<p>Snapdocs&#x27;s culture is one that trusts its team members to make smart decisions. This means we value both independent work as well as seeking collaboration. We&#x27;re becoming ubiquitous in one segment of the market and we&#x27;re looking to expand further.<p>Skills &amp; Requirements\n* Rails Engineer. 3+ years experience, but more is welcome. Ideally, you&#x27;re a full stack coder. But in reality, you probably lean either towards the front or the back end. That&#x27;s fine, so long as you know (and enjoy) your strengths.\n* Data engineer. You can be shown a feature set and then start riffing on what should be tracked and why. You&#x27;ll then build (or collaborate on) this tracking. You&#x27;ll dig into data to propose new features.\n* Being the 5th member of on a fast-growing technical team. This means helping to form a healthy and happy culture. We strive to be respectful of each other&#x27;s time and point of view. We&#x27;re learning how to do this together. We want to create a place where it&#x27;s OK to fail, and that you know the team has your back the whole way through.\n* Self-motivated. To us that means when you get an interesting problem, you will rip into it until you understand its nuances and perhaps have a glimpse of the solution.\n* Empathy. We work closely with our customers, meaning phone calls, emails, and sometimes lunch. It is important in this job to listen to them so that we can build what they need and want.\n* Knowledge of AWS would be excellent.\n* UX experience (or interest in cultivating it) would be excellent.<p>Send an email to jobs@snapdocs.com telling us about yourself. Please include a resume and a link to github (and specific github repos) if your profile is informative.","time":1459524772,"type":"comment"}