{"by":"johnrball","id":11407144,"parent":11405239,"text":"Olo<p>White Hat Hacker &#x2F; Security Engineer<p>Engineering - New York or Remote within the United States - Full Time<p>At Olo we run an online food ordering platform used by many of the country’s largest restaurant chains, reaching millions of consumers through branded mobile apps and ordering websites. We are seeking an experienced security engineer to help us maintain our excellent security track record. You would be collaborating closely with all development teams and across all services.\nYour responsibilities would include conducting internal and external penetration testing, advising engineers and other employees on secure designs, reviewing and testing new releases for vulnerabilities, hardening our hosting infrastructure, and monitoring for malicious activity. You would be involved throughout the development lifecycle from design to production. You would help Olo maintain compliance as a PCI DSS Level 1 Service Provider.<p>Requirements\n* \t\tIn-depth knowledge of cryptography, OWASP vulnerabilities and the PCI Data Security Standard.\n* \t\tWhite Hat penetration testing experience using a formal methodology\n* \t\tDeep, low-level knowledge of network security (TCP&#x2F;IP, DNS, Firewalls, HTTP)\n* \t\tExperience with both Windows and Linux servers\n* \t\tProficient at automating tasks in the scripting language of your choice\n* \t\tStrong communication and interpersonal skills\n* \t\tExperience with AWS will be beneficial<p>About Olo\nOlo reaches millions of consumers by powering mobile and online ordering for many of the country’s largest restaurant chains.  Mobile ordering and payments is an exciting and active industry full of interesting players and yet still a relatively untapped market ripe for disruption.\nWe’re quite up-front about the technical challenges our business faces.  Running a platform with multiple white-labeled front-ends, that maintains real-time connections into thousands of restaurants’ POS systems, and coordinates complex transactions between these and other third parties (such as payment gateways and gift card providers) is not for the faint of heart!\nOlo is located at 26 Broadway in the historic Standard Oil Building, the former home of John D. Rockefeller.  We offer great benefits, such as 20 days of Paid Time Off, paid health, dental and vision care, stock options, a generous maternity&#x2F;paternity leave plan and perks like FitBits, rotating craft beers on tap in our kitchen, and food events featuring our clients&#x27; menu items (now you know why we give out FitBits!).<p>Please feel free to reach out directly to johnball@olo.com<p><a href=\"http:&#x2F;&#x2F;www.olo.com&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.olo.com&#x2F;careers.html</a>","time":1459534492,"type":"comment"}