{"by":"Torn","id":11408811,"parent":11405239,"text":"Skyscanner | London, Barcelona, Edinburgh, Budapest, Sofia | ONSITE, VISA | full-time<p>We&#x27;re one of the biggest travel metasearch products in the world by traffic... and we want to x10 that :)<p>Hiring experienced people in lots of key disciplines: backend with distributed systems, full stack and frontend, designers, product, iOS &amp; Android. We are hiring to all our European offices - London and Barcelona being the 2 newest offices we&#x27;re scaling. In short, if you&#x27;re good, and looking for something challenging, we&#x27;re interested.<p>We&#x27;re one of the very few unicorn companies HQ&#x27;d in Europe who are profitable - and have been so for the past 7 years. Recently we&#x27;ve had the director of Amazon S3, Bryan Dove join us as our VP engineering - in London you would be working closely with him alongside some very experienced industry figures.<p>We&#x27;re looking for people interested in working on large scale challenges and building new products. We have an incredible amount of historical data and a unique position in the market. What does the future look like? How do we change the game? How do we best use our data, our scale and new technologies to our advantage as we grow? We&#x27;re particularly interested in travel personalization and recommendation, as well as developer enablement and tooling.<p>We&#x27;ve recently opened a Barcelona and London office and there is incredible energy across the company. We are set out to be the #1 flight search engine in the world: from the UK through US, all the way to Asia.<p>You can apply at <a href=\"http:&#x2F;&#x2F;www.skyscanner.net&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skyscanner.net&#x2F;jobs&#x2F;</a> - or ping me an email at alex (.) treppass [at] skyscanner.net for a referral. Happy to answer questions or pass you to someone who can.<p>On a personal note, I see a lot of freedom, responsibility, accountability. Engineers have a LOT of room to make decisions and move fast, and the encouragement to make things better. It&#x27;s an exciting place to be.","time":1459546780,"type":"comment"}