{"by":"beck5","id":11405367,"parent":11405239,"text":"ShareLaTeX&#x2F;DataJoy | EU Time Zone | REMOTE | Open Source | front&#x2F;full stack devs or Ops&#x2F;backend.<p>Help us create tools for scientists by building usable open-source research tools.<p>We&#x27;re looking for a remote full-time developer to join our team at ShareLaTeX (<a href=\"https:&#x2F;&#x2F;www.sharelatex.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sharelatex.com</a>) and DataJoy (<a href=\"https:&#x2F;&#x2F;www.getdatajoy.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.getdatajoy.com</a>). ShareLaTeX is an online LaTeX editor with over 750,000 registered users, and DataJoy is our new app for online data analysis with Python and R.<p>You should be comfortable quickly learning new technologies and enthusiastic about improving the efficiency of scientists and their tools. Our current technology stack involves Node.js, MongoDB, Redis, Coffeescript, Angular.js, and Docker, so experience in these is useful but not required. We’d rather see that you have demonstrable interest in the problems we are solving, and that you’ve created some great stuff in the past.<p>We realise people can&#x27;t be experts in everything but as a small company you will be exposed to all parts of the stack. However if you are much stronger on the front end and usability or on infrastructure, with docker then that is great.<p>Some reasons you&#x27;d enjoy working for us:<p>* Around 80% of our codebase is open-source and we’re big fans of free software.<p>* We’re agile (with a lower case a). We test everything (unit and acceptance), we have a CI build process, a full staging environment to play with, and we automate as much as possible.<p>* Working hours can be flexible to your needs.<p>* Remote is a first class citizen, all founders and employees work remotely.<p>* We’re a bootstrapped &amp; profitable company with no outside investors which means no crazy business pressures, code quality and user happiness comes first.<p>Send us an email: founders@sharelatex.com","time":1459523622,"type":"comment"}