{"by":"srainier","id":11408708,"parent":11405239,"text":"Bonsai AI | Berkeley, CA &amp; Seattle, WA | Full Time<p>We&#x27;re an early stage startup creating developer tools to enable all software developers to build sophisticated AIs without having AI expertise. We&#x27;ve got quite a few positions we&#x27;re hiring for, but here are the ones we&#x27;re most actively looking for:<p>AI Lead&#x2F;Manager: We need someone with a broad background in AI, through some combination of academic work and industry experience, to oversee the design and implementation of our learning systems. You should be experienced and comfortable with the many available AI methods of today (deep learning, statistical methods, probabilistic methods). You can also ship production-level code and have worked with at least one of the popular AI frameworks (Tensorflow, Theano, Caffe, etc). We&#x27;ll consider both those that want to people-manage and those that just want to lead the technical work.<p>Lead IDE Developer: We&#x27;re creating an IDE to support our new programming language and a number of visual debugging and authoring tools. The ideal candidate has most or all of the following: Strong C++ skills, some Javascript experience, experience building apps with Qt (any platform), experience building an IDE, interactive debugger, or other developer tools, and a passion for designing and building great user interfaces and experiences.<p>Build &amp; Release Manager: This is a many-hats position, including:\n* Build our tools and create package installers for Windows, Mac, and Linux. CMake experience will be helpful.\n* Create and maintain the Vagrant environments we use for development.\n* Ensure end-to-end functional correctness of our product, preferably programmatically.\n* Manage our cloud infrastructure and deployments to said infrastructure.<p>Interested in any of these positions, or perhaps are just enthusiastic about AI and want to be involved somehow? Send your resume and a brief note to jobs@bonsai.ai. For more info: <a href=\"http:&#x2F;&#x2F;bonsai.ai\" rel=\"nofollow\">http:&#x2F;&#x2F;bonsai.ai</a>, <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OwgBXwTnFgo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=OwgBXwTnFgo</a>","time":1459545859,"type":"comment"}