{"by":"henryalee","id":11407555,"parent":11405239,"text":"OrderAhead (YC) | SF | Product (Full-Stack) &amp; Data Science Engineers<p>OrderAhead is a technology-enabled business that&#x27;s reinventing the way the world shops. Today, we help people eliminate the stress and frustration of senseless waiting via on-demand pickup and delivery from local restaurants. Ultimately, we believe that we can provide an unimaginable level of convenience, transparency, and value to both consumers and merchants through well-designed software. We’re backed by top-tier investors including August Capital, Eric Schmidt, Marc Benioff, Adam D’Angelo, and Y Combinator.<p>--- Product Engineer ---<p>We believe that the best product engineers are full-stack generalists with strong fundamentals who can transition effortlessly among responsibilities. We’re looking for people who enjoy the iterative design process as much as the challenge of coding up elegant implementations. Most importantly, we want teammates who can empathize with end users to push our products to the next level.<p>Responsibilities &amp; Example Projects:<p>- Work on our five native iOS&#x2F;Android client applications for customers, merchants, and drivers<p>- Push code daily through the entire stack, from customer-facing interfaces to backend database optimizations<p>- Collaborate with designers to spec and implement innovative visual and functional improvements to our products<p>-  Analyze data and conduct experiments to make data-informed decisions about new features and product improvements<p>--- Data Science Engineer ---<p>We’re looking for people who enjoy the process of research and experimentation just as much as they love implementing and deploying solutions to see the real-world impacts. We believe that leveraging models, simulations, and data analysis is key to ensuring correct prioritization and optimizing all components of our business. Most importantly, we want teammates who can quickly sift through vast amounts of data to find the hidden stories that will drive business decisions and product features.<p>Responsibilities &amp; Example Projects:<p>- Improve the accuracy of our Delivery Time Estimate service, which provides customers the lowest reliable delivery times by analyzing current driver locations, queued orders, and desired pickup&#x2F;delivery addresses<p>- Optimize our Assignment Engine, which uses VRP-based algorithms to assign orders to drivers, while ensuring timeliness, minimizing distance travelled, and maximizing utilization and efficiency<p>- Model future growth and optimally schedule driver shifts in order to properly cover demand across geographic regions and time of day<p>Details at <a href=\"https:&#x2F;&#x2F;www.orderaheadapp.com&#x2F;jobs&#x2F;engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;www.orderaheadapp.com&#x2F;jobs&#x2F;engineering</a>, or contact me directly (henry at orderaheadapp.com) if you&#x27;d like to chat about the exciting technical challenges we&#x27;re facing.","time":1459537103,"type":"comment"}