{"by":"w-m","id":11405697,"parent":11405239,"text":"VideoStitch | <a href=\"http:&#x2F;&#x2F;www.video-stitch.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.video-stitch.com</a> | Paris, France [ONSITE] | Full Time |<p>We are focused on bringing the highest quality Post-production and Live 360° video content creation software to content producers and creatives all over the world. To provide live, life-like VR experiences of the real world, we have built a set of software reducing cutting-edge video stitching to a few milliseconds.<p>We made VideoStitch because we needed this tool in 2010, when we made a huge 360 video campaign for Renault. As there was no dedicated software on the market to stitch our 360 videos, we created it ourselves. Our goal is to deliver the fastest, cinematic VR grade 360 2D and 360 3D video stitching professional filmmakers need.<p>Now we have over 1000 customers in 45 countries including entertainment, media and Fortune 500 companies including Facebook, Red Bull and Sony Entertainment. We raised $2.75m to date and have offices in Paris and San Francisco.<p>We are an awesome international team (speaking English) with a shared love for 360 video and upcoming VR gadgets. On the technical side we are mainly C++ hackers and UI engineers, computer vision engineers and applied scientists, audio engineers and testers. We&#x27;d like to welcome new:<p>* General C++ Engineers for high-performance software<p>* Qt&#x2F;C++ UI Engineers<p>* UX Designer<p>* Video Coding&#x2F;Streaming Engineers<p>* QA&#x2F;testers, for automated and manual testing<p>If your profile doesn&#x27;t fit one of our open positions but you&#x27;d like to work in 360 video, apply for &quot;your own role&quot; and let us know how you would like to contribute to our team! Keywords: C++, Qt, Python, GPGPU (CUDA), Video codecs, RTMP, HLS, SDI, Parallelism, Image processing &#x2F; Computer vision &#x2F; Computational photography, QA, Testing<p>Our office is in inner-city Paris. We can assist you with the visa process for France.<p>If you&#x27;re interested, visit <a href=\"http:&#x2F;&#x2F;www.video-stitch.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.video-stitch.com&#x2F;jobs&#x2F;</a> and apply to one of the open positions!","time":1459525771,"type":"comment"}