{"by":"clay_to_n","id":11406543,"kids":[11414834],"parent":11405239,"text":"Stasis Labs | Los Angeles | ONSITE or REMOTE<p>Stasis Labs is hiring a full-stack web engineer &amp; a hardware engineer. We&#x27;re a startup based out of Los Angeles (West Hollywood) building a medical hardware + software system for hospitals that will have a positive impact on people. Our first product will be available this summer. We recently finished a pilot of our product in a large hospital in Bangalore.<p>We give doctors more information so that they can stop emergencies before they happen.  Our first product is a vital signs monitoring system for hospitals targeting patients who, today, are not currently continuously monitored.<p>You will be the seventh or eighth full-time employee of Stasis Labs. You will have a great deal of autonomy and be responsible for shaping the culture, technology and processes of our company. We&#x27;re a small team and are looking for people who can learn quickly and become competent in multiple parts of the tech stack.<p>Our software stack includes C++, an Android application, and a web application (node.js backend, React frontend). We&#x27;re using both Bluetooth Low Energy and wi-fi. Our cloud backend is an important part of our product.<p>Full-stack Web Engineer:<p>-   Node + SQL backend, React + general JS frontend skills<p>-   Experience with deploying web applications in production<p>-   Experience leading a web product at a startup or on a small team is a plus<p>-   Experience working in a regulated environment is a plus<p>-   You don&#x27;t need to be an expert in both frontend and backend, but you should be willing to learn the skills you don&#x27;t have today.<p>Hardware Engineer (ONSITE required):<p>-   Circuit design experience<p>-   Experience going from idea to production on a design<p>-   Experience managing a supply chain is a plus<p>- Experience with programming or mechanical engineering is a plus.  If you can write basic code for your designs, or handle SolidWorks design, you&#x27;ll be able to use those skills.<p>If interested, please email software@stasislabs.com or hardware@stasislabs.com","time":1459530737,"type":"comment"}