{"by":"pierre","id":11405485,"parent":11405239,"text":"AXA Technology Services Advanced Engineering Lab www.axa.com | Lausanne, CH | ONSITE | DevOps<p>* Environnement<p>The Lab is located is located on the EPFL campus in Lausanne. The Lab was created in 2014 to contribute to a global strategic program of digital transformation at AXA Group level. The Lab is not only an innovation lab but also, and above all, an engineering team helping AXA entities to “test and learn” their digital “ideas”. We respect the “learning by doing” rule and believe we have the right to fail: we can make mistakes and learn from them in order to innovate in a better way with better tools. Our projects span from IT related topics, to Internet of things, robotics, drones and many other web&#x2F;mobile related initiatives.<p>* Domain of responsibility<p>We are looking for an experienced sys&#x2F;net engineer, highly motivated and very aware of trends and groundbreaking startups. To support our “learning by doing” principle, AEL has acquired a test bed (POD), fully OCP compliant, as two datacenters in a rack. You will join our team of engineers with the responsibility of evolving and maintaining our platform, but above all, we expect you to help us identifying and testing breakthrough solutions. Promote promising technologies and support the transfer to operational teams is also an important part of the job.<p>* Mission<p>Rethink the way we should design our Datacenter infrastructures, and globally our IT to face the future technology challenges (IoT, Big Data, Real-time Analytics, Behavioral User Analysis, etc.) by using state of the art practices DevOps&#x2F;NetOps and looking further on breakthrough technology solutions (NFV&#x2F;SDN).<p>Among responsibilities:<p>- Deploy and Automate the POD server’s systems<p>- Perform technology surveys to update&#x2F;enhance the infrastructure<p>- Constantly improve the team knowledge with technology watch, white papers, position papers, … and promote new ideas<p>- Submit new projects ideas to the Lab steering committee<p>- Implement selected projects and coordinate with external stakeholders when necessary, especially when projects are deployed within the operational perimeter.<p>- Develop the infrastructure for the team on other innovation subjects (data collection, databases, storage, …)<p>- Develop a good team spirit and strongly contribute to the Lab reputation<p>- Develop a good network within the AXA technology community<p>You can apply by email at : david.ramahefason at axa-tech.com","time":1459524481,"type":"comment"}