{"by":"jisto","id":11406479,"parent":11405239,"text":"Jisto (<a href=\"http:&#x2F;&#x2F;www.jisto.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jisto.com</a>) | Boston | Full-time | On-site<p>Jisto helps its customers run many more workloads on their (typically-underutilized, existing or new) data centers and cloud resources, without disrupting their existing mission-critical and legacy workloads and infrastructure.<p>Jisto leverages the exciting, open-source innovations in containerization and abstract cloud-workload scheduling, allowing companies to safely tap into their otherwise-wasted resources, and putting those resources to work running modern applications. These applications can run alongside any traditional enterprise products (whether they are containerized or not), while avoiding any resource disruption or contention.<p>We have 3 open positions that all come with competitive salary and equity:<p>- Senior Software Engineer: <a href=\"http:&#x2F;&#x2F;www.jisto.com&#x2F;cloud&#x2F;careers&#x2F;#senior_software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jisto.com&#x2F;cloud&#x2F;careers&#x2F;#senior_software_engineer</a><p>- Enterprise Software Engineer: <a href=\"http:&#x2F;&#x2F;www.jisto.com&#x2F;cloud&#x2F;careers&#x2F;#enterprise_software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jisto.com&#x2F;cloud&#x2F;careers&#x2F;#enterprise_software_engi...</a><p>- Systems Engineer&#x2F;Architect: <a href=\"http:&#x2F;&#x2F;www.jisto.com&#x2F;cloud&#x2F;careers&#x2F;#systems_engineer_architect\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jisto.com&#x2F;cloud&#x2F;careers&#x2F;#systems_engineer_archite...</a><p>Jisto is located in the heart of Boston. We’re an early-stage startup that is well-funded, well-connected, and poised for rapid growth. Our team has previously worked at startups, venture capital firms, and some of the largest software enterprises.<p>To apply, please email your resume or CV to us at careers@jisto.com.<p>Know someone who might be a good it? Refer them to us at referrals@jisto.com, and if we hire them, we will reward you with $2,500.","time":1459530344,"type":"comment"}