{"by":"yread","id":11405559,"parent":11405239,"text":"NKI | Amsterdam, Netherlands | Full time | On-site<p>We are a leading integrated cancer center with 100 years of history, with a strong focus in basic and translational research. There is one position for hackers at the department of Biochemistry (\n<a href=\"http:&#x2F;&#x2F;www.nki.nl&#x2F;divisions&#x2F;biochemistry&#x2F;perrakis-a-group&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nki.nl&#x2F;divisions&#x2F;biochemistry&#x2F;perrakis-a-group&#x2F;</a>\n)<p>We are looking for a software developer with an open and inquisitive mind, to join our team that develops software for structural biology. Versatility and enthusiasm is highly desirable to cope with two distinct and challenging projects:<p>Your first task will be to create a new front-end for our popular PDB_REDO web server (\n<a href=\"https:&#x2F;&#x2F;xtal.nki.nl&#x2F;PDB_REDO&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;xtal.nki.nl&#x2F;PDB_REDO&#x2F;</a>\n) with an emphasis in enabling easy job customization for the end-user, as well as to create a new modern application substituting and extending our ProteinCCD server (<a href=\"https:&#x2F;&#x2F;xtal.nki.nl&#x2F;ccd\" rel=\"nofollow\">https:&#x2F;&#x2F;xtal.nki.nl&#x2F;ccd</a>\n). Within the West-Life EC project (\n<a href=\"http:&#x2F;&#x2F;internal-wiki.west-life.eu\" rel=\"nofollow\">http:&#x2F;&#x2F;internal-wiki.west-life.eu</a>\n) both applications will be extended to make use of Grid and Cloud technologies in collaboration with the West-Life network of experts.<p>The second task is to build on your strong background in scientific programming, to gradually learn the code base of our crystallography software, and help improve our algorithms that build models of macromolecules in three dimensional maps from X-ray crystallography and cryo electron microscopy (cryo-EM) data. Expert knowledge of C++ is not necessary, as major extensions can be done in your language of choice, but the current code base is in C++. If you understand the science or algorithms behind it will be a huge plus.<p>You will work in a small operational team of bioinformaticians, in a lively department of about 40 PhD students and post-doctoral scientists, that embed in a research operation of about 600 enthusiastic people, including biologists, chemists, and bioinformatics experts of many flavors. In addition, collaboration within big European consortia (West-Life but also iNEXT, \n<a href=\"http:&#x2F;&#x2F;www.inext-eu.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.inext-eu.org</a>\n) will allow you to build a wide professional network in both academic and private research establishments across Europe. The NKI offers competitive salaries, experienced foreigners can get a 30% tax discount, and Amsterdam with its many cultural amenities enables you to enjoy a good work-life balance.<p>Drop me a mail at j.hudecek@nki.nl","time":1459524841,"type":"comment"}