{"by":"theuri","id":11407493,"parent":11405239,"text":"John Hancock Digital | Senior iOS Developer (Swift) &amp; Full-Stack Developers (Ruby&#x2F;Rails) | San Francisco, CA | <a href=\"http:&#x2F;&#x2F;www.johnhancockdigital.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.johnhancockdigital.com</a><p>Come join us as we build and launch an ambitious, high impact stealth project focused on making financial advisory more simple, accessible and effective for millions of people.<p>SENIOR iOS DEVELOPER (Swift)<p>We are seeking an iOS Engineer with a focus on our core mobile experience, reporting to our Vice President of Engineering.<p>You will be responsible for developing, testing and maintaining some of our most important and ambitious technology features, and you should have a proven track record of delivering very user-friendly, well-engineered and tested software. You should also be excited and comfortable juggling multiple priorities in a fast-paced environment.<p>FULL-STACK DEVELOPER (Ruby)<p>The Full-Stack Developer role is a critical position for us. We are seeking a developer with experience working extensively in both front-end and back-end software development, reporting to the Head of Engineering. Your initial focus will be on our core web experience, and may expand to mobile platforms as well.<p>You will be responsible for developing, testing and maintaining some of our most important and ambitious technology features, and you should have a proven track record of delivering well-engineered and tested software at scale.<p>ABOUT JOHN HANCOCK DIGITAL\nWe serve as an independent digital innovation startup within John Hancock, focused on scaling our technology to improve the financial lives of millions of customers in the US and globally. We are an agile, fast-moving startup team based in San Francisco, that leverages the brand, support and resources of John Hancock and its Manulife parent company to ship products that positively impact the lives of customers around the world.<p>In addition to our work supporting our legacy product (see more at GuideFinancial.com), we are also embarking on a mission to use technology (machine learning and applied behavioral finance) to enable millions of middle-class households to increase their savings rates, make better financial decisions and achieve retirement security.<p>To start a conversation - drop us an email at hello@johnhancockdigital.com with a brief note about yourself and a resume.<p>You can also read more here: <a href=\"https:&#x2F;&#x2F;www.johnhancockdigital.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.johnhancockdigital.com</a>","time":1459536689,"type":"comment"}