{"by":"flyankur","id":11413268,"parent":11405239,"text":"Grofers.com | Staff Engineer Backend, Mobile | G-town, India | $100,00 - $150,000 | Work at the biggest hyper-local marketplace in South-Asia | ONSITE<p>Are you ready for a crazy, wild, roller-coaster ride - grofers.com&#x2F;blog&#x2F;first-days-grofers-abhinav-desor&#x2F;?<p>Why move to India!! - This is the time to be in India - you will be solving some of the most challenging problem on earth which can only be solved by technology. The problem set, sheer scale and market size ($600 Billion) is unique to India. Pirates wanted! You will greeted with amazing peers, tough and impactful problems to code on and beer!<p>Grofers engineering is a fast-paced environment that focuses on excellence and high productivity. We face unique organizational challenges everyday and if you look forward to join us, you have to be someone who is comfortable in uncharted territory and is ready to build consumer, logistics, catalogue, fulfillment, retail and marketing systems that can support operations of 100,000 and 10 million people alike.<p>We&#x27;re constantly taking on challenges like making efficient and fast hyper-local logistics, personalisation, search, payments, and growth - all the while shipping a beautiful user experience. We want to build solutions to these problems that are scalable, performant, and elegant, and we&#x27;re looking for talented people to help us do just that.<p>The mission is to make buying groceries as simple as tap water availability. Confused? Two decades earlier, tap water was not readily available and the task of fetching water for the household was an unavoidable chore. With time, the establishment of a well-defined supply has now made lack of tap water availability a lore of the past.<p>That is exactly what we want to do to the issue of grocery shopping. The challenge is to organise the entire retail market (sellers, supply and distribution), build hyper-local logistics that can scale fast economically, and provide a delightful experience to the consumers.<p>Some facts from the last year and a half:<p>- Hyper-Growth: 0 to 1.5 million active monthly users across 17 cities within 1.5 years<p>- We were the best app of 2015 - Android &amp; iOS<p>- Backed by Sequoia, DST, Tiger and Softback ( We are the only Indian company to have all of them onboard)<p>===<p>Email me at Ankur@grofes.com | <a href=\"https:&#x2F;&#x2F;grofers.com&#x2F;careers&#x2F;engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;grofers.com&#x2F;careers&#x2F;engineering</a><p>===","time":1459629032,"type":"comment"}