{"by":"knewman","id":11423589,"parent":11405239,"text":"Java Applications Developer | Harvard Business Publishing, <a href=\"https:&#x2F;&#x2F;hbr.org\" rel=\"nofollow\">https:&#x2F;&#x2F;hbr.org</a> | Boston, MA<p>Harvard Business Review (HBR) is the leading destination for smart management thinking. Through its flagship magazine, books, and digital content and tools published on HBR.org, Harvard Business Review aims to provide professionals around the world with rigorous insights and best practices to help lead themselves and their organizations more effectively and to make a positive impact.<p>This developer will work on our Java-based software applications to meet both user and business needs. They will help cross functional teams gather and document requirements for future product upgrades and enhancements. As needed, the Application Developer will drive the design, testing, and high performance development of systems and software to ensure the business continues to thrive in our industry.<p>Responsibilities: \n* The Java Engineer will focus on both existing and new applications and tools\n* Experience with REST web services and the Spring Framework required. Full stack experience preferred but not required, and junior developers are encouraged to apply.\n* This person needs a strong problem-solving and analysis mindset, with an ability to analyze a problem at a system level and determine the root cause at a technical level<p>Required Qualifications: \n* 3+ years Java application development - including maintenance and delivery is highly desirable with some history working in a small team environment \n* Proven ability to learn and apply new technologies quickly to solve technical problems\n* Ability to interact with non-technical colleagues and communicate issues in layman&#x27;s terms\n* Has high standards and applies those constantly \n* Never loses touch with the goals of the business \n* Strong results orientation\n* Thinks bigger than the task at hand \n* Exhibits excellent judgment<p>For more information or to apply just email Kevin Newman via knewman[at]hbr[dot]org","time":1459790304,"type":"comment"}