{"by":"lachenmayer","id":11421823,"kids":[11431561],"parent":11405239,"text":"Boiler Room | London | Web Developer (full-stack) | full time, ONSITE<p><pre><code>        =  =\n     =        =\n    =  BOILER  =\n    =   ROOM   =\n     =        =\n        =  =\n</code></pre>\nBoiler Room is the world’s leading community of underground music fans. We live-stream DJ sets and live gigs from music hubs such as London, Berlin, New York, Paris, LA and &gt;60 other cities to music lovers all over the world. It started as a webcam taped to a warehouse wall in East London - in five years Boiler Room has grown to become the online home of underground music, and also a complex broadcasting and editorial platform in its own right.<p>We are currently in the process of building the next generation of the web app powering Boiler Room. We have upwards of a million views on our site a month, and that’s not including the hundreds of millions of views that our videos have accumulated on YouTube and Dailymotion. We want to create a completely unique web experience that lives up to the quality of our live shows. To do that we need someone who knows their way around the wonderful mess that is web development, and truly cares about the experience that music lovers will have while using our web app on all kinds of devices.<p>You’ll be an essential part of a dev team currently consisting of 3 developers and 2 designers. You ideally have strong opinions about how web development should be done in 2016, and you should be able to come up with and implement new ideas for consuming &amp; sharing online music experiences. Going forward, we have some really exciting ideas around peer-to-peer audio and video streaming - interest and&#x2F;or expertise in that area would definitely be a strong plus.<p>(...on top of that you’ll of course be able to go to &amp; invite your friends to our exclusive parties being live-streamed on the site!)<p>If this sounds like your kind of jam, give me a shout on harry.l+hn@boilerroom.tv!","time":1459777622,"type":"comment"}