{"by":"Porch_","id":11426631,"parent":11405239,"text":"Porch.com - Senior Full Stack Engineer - Seattle, WA - fulltime<p><a href=\"https:&#x2F;&#x2F;porch.com&#x2F;about&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;porch.com&#x2F;about&#x2F;careers</a><p>Porch is seeking Senior Full Stack Developers to be part of our Engineering team. Be part of a rapidly growing, fast-paced company looking to revolutionize an industry with a strong focus on beautiful design and great user experience.<p>We are looking for candidates that thrive in a highly collaborative, rapidly changing environment. We release code every day, making for quick iterations. To succeed in this role, you should be a self-starter who is constantly challenging yourself to write better code, learn new technologies, and help your colleagues grow.<p>Responsibilities:\nCollaborate with design, product management, and data engineers to deliver features to production\nDevelop website features using Node and React\nDevelop web services using Java and Scala\nBalance long term code health and maintainability with business needs\nProvide input on shaping development best practices\nOwn features from initial discussions through release\nMentor junior developers<p>Qualifications:\nBS in Computer Science or similar field or relevant experience\nThree years experience building public facing, database backed websites\nProfessional experience working with one or more of Java, C#, PHP, Ruby, or Python\nExpertise in HTML5, CSS3, and JavaScript\nExperience working with SQL and relational databases\nExperience developing for mobile or responsive websites\nAbility to organize and self-direct to get things done\nEffective verbal and written communication skills<p>About Porch\nWe&#x27;re a startup with a big vision. We&#x27;re out to solve the pain that millions of homeowners’ experience regularly as they try to select a home service professional that they can trust. The home services market is highly fragmented and local. So a solution is going to need a unique approach to using data and technological innovation that makes it easier than ever for homeowners to connect with quality professionals. As such, we&#x27;re a smart group of passionate techies that&#x27;s focused on bringing order (and dare we say delight) to an age old, recurring problem. We believe in Beautiful Products, Relentless Customer Focus and Team Before Individual. We practice the lean methodology and believe in data driven decision making. We&#x27;re always looking for the right people to add to the team and thrive on diversity (of views, experiences, skills, passions, etc.).","time":1459812780,"type":"comment"}