{"by":"NewsNow","id":11447918,"parent":11405239,"text":"Software Developer&#x2F;Web Developer&#x2F;Product Manager | NewsNow.co.uk | London, UK | Full-time, permanent<p>Passionate about any area of news, sport, or fairness in news reporting? Relish crafting elegant solutions to hard technical and business problems, using whatever is the best tool for the job? Thrive in an open, collaborative environment, where the best ideas can come from anyone? Confident and articulate about what you know, and humble and articulate about what you don&#x27;t? Fancy the idea of competing with Google, by being clever rather than colossal?<p>Then why not consider joining NewsNow.co.uk, news aggregator and top ten UK media publisher with 15M users monthly. Established 1998 and profitable ever since, our ethos and business models have stood the test of time. Ours is a developer-led company: our Founder and CEO heads up our development team.<p>We currently have three opportunities:\n- As a &#x2F;software developer&#x2F;, you’d be working on projects including our unique in-house article classification engine, generating live digests of our most compelling content, or mining live streams of data about events from all over the world. \n- As a &#x2F;web developer&#x2F;, you’d work on projects like letting users view images from the news, and rate articles. \n- As a &#x2F;product manager&#x2F;, you’d help us to ‘get it right’ through your zest for software development and the user experience, your passion and excitement for our business and your ability to inspire this in the rest of the team.<p>We run Debian Linux on our co-located raw metal and on AWS EC2&#x2F;VPC, with MySQL, Apache, and in-house code written in a variety of languages. We do our web development in HTML5, CSS3, advanced JavaScript, jQuery. We use OO patterns in coding.<p>We’re also welcoming applications from remote developers if you live within about an hour of London.<p>If you like the sound of us, we’d love to hear about you. Please get in touch!<p><a href=\"http:&#x2F;&#x2F;www.NewsNow.co.uk&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.NewsNow.co.uk&#x2F;careers&#x2F;</a>","time":1460042313,"type":"comment"}