{"by":"rcjpm","id":11452049,"parent":11405239,"text":"JP Morgan| New York &#x2F; London &#x2F; Glasgow &#x2F; Bengaluru   | Onsite | Distributed Systems Engineer &#x2F; Front End Developer &#x2F; Full Stack Developer<p>We are hiring for multiple roles at multiple sites and all levels of seniority.<p>Risk Central is a new firm-wide effort at JP Morgan to bring in best in class Big Data technologies to store, aggregate and report risk and PNL data. Using Big Data technologies like Hadoop, Kafka and Spark, the Risk Central team will build a resilient high-capacity platform supporting the firm’s business and regulatory agenda. On a typical day, vast amounts of data will stream into the system from both end of day batches and real-time calculators. Processing engines will link the incoming data streams to derive business relevant data views. Modern front ends will be built for desktop and mobile platforms to service the needs of heterogeneous clients across the Investment Bank and Risk &amp; Finance.<p>===<p>Distributed Systems Engineer (<a href=\"https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=160027871&amp;lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=1...</a>)<p>The ideal candidate for the role has a proven track record of using Big Data technologies to effectively store, report and analyze large volumes of time-series data, preferably in the financial domain. The candidate will be able to guide the build out of the Risk Central system, using their expertise to ensure all tools are used optimally and build to scale to the firm’s long term requirements. They will also work actively on the development and deployment of the system. Additionally, they should be able to add significant value to the system by using data analysis tools to mine and analyze the large volumes of data available.<p>===<p>Front End Developer (<a href=\"https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=160027876&amp;lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=1...</a>)<p>The front end developer will build modern user interfaces for browsers, mobile devices and native clients. These interfaces will interact with Apache Spark on the backend to aggregate and visualize a vast set of data points which can be sliced across portfolios and time series. Each UI needs to be responsive to the needs of users across different regions, lines of business and functional requirements.  As the background data can change in real time, the front end also has to be sophisticated enough to re-aggregate and render the affected views in real time.<p>===<p>Full Stack Developer (<a href=\"https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=160026429&amp;lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=1...</a>)<p>The Application Developer role requires full-stack development, with the ideal candidate involved in all aspects of the Risk Central build out. This includes writing internal and external APIs, writing code that persists and aggregates data and building highly scalable, mission-critical components servicing users across the globe. Candidates will be able to handle the full pipeline of the system, from receiving data from upstream systems to reporting results to downstream clients. In order to accomplish this, the developer will have familiarity of all technologies used in the project and have a basic understanding of all involved workflows.","time":1460079550,"type":"comment"}