{"by":"sidahl","id":8394960,"kids":[8405820],"parent":8394339,"text":"Bloomberg LP, Portfolio Risk Analytics, NYC, VISA<p>We&#x27;re the Pricing&#x2F;Scenario Analysis&#x2F;Enterprise risk team and we&#x27;re looking for skilled senior software developers to design and build systems to provide cutting edge risk analytics and portfolio insight to Bloomberg users around the world. The problems we solve are an interesting mix of math&#x2F;finance&#x2F;software and system design in a fast paced client facing environment. The group&#x27;s culture provides the stability of a large successful firm with the entrepreneurial risk taking nature of small agile teams. We&#x27;re looking for people who can write high quality software to solve complex analytical problems and have an interest in driving the direction of the business and the architecture.<p>The team&#x27;s responsibilities include components of the risk engine to generate simulations based on Monte Carlo methods, historical simulations, predictive scenario generation, stressed market Monte Carlo etc. These simulations are used to drive analytics such as Counterparty risk, VaR, greeks, default analytics such as incremental risk charge and specific risk and stress scenario analysis. We also provides efficient pricing for non-linear securities such as derivatives based on stress matrix methodologies and liquidity risk analytics. We expect a programmer to solve large scale distributed computation problems to manage millions of these calculations every day in a service oriented architecture.<p>The team works extensively with groups all over the firm including trading systems, quantitative teams, pricing and market data teams etc. As such, strong communication skills and the ability to do well in a collaborative environment are very important.<p>Apply online at \n<a href=\"http://jobs.bloomberg.com/job/New-York-Senior-Software-Developer-Enterprise-RiskScenarioPricing-Team-Job-NY/70120100/\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.bloomberg.com&#x2F;job&#x2F;New-York-Senior-Software-Devel...</a>","time":1412175896,"type":"comment"}