{"by":"answers","id":8394720,"parent":8394339,"text":"St. Louis, MO\nFront-End Web Developer \nAnswers.com \nMeaghan.Cale@Answers.com<p>Answers is seeking a Front-End Web Developer with a deep knowledge of — and experience with — HTML5, CSS3, and Sass; a very keen awareness of good UX; and a dedication to best practices and working successfully in an agile team environment. The successful candidate will be focused on implementing optimal and reusable elements in a fast-paced, rewarding, and goal-oriented environment. This position will be located in our St. Louis, MO, office.<p>Responsibilities:\n* Writing semantic HTML for back-end developers to implement\n* Writing Sass-based CSS for multiple mobile and desktop platforms and browsers (IE8+)\n* Involvement in multi-team project planning, bringing sound UX practices to projects<p>Requirements:\n* Proficiency with HTML5, CSS3, and Sass\n* Understanding and knowledge of JavaScript&#x2F;jQuery\n* Ability to collaborate effectively with other UX team members, back-end developers, business team stakeholders, and product managers\n* Ability to work in a fast-paced environment, moving from planning to a first iteration&#x2F;MVP quickly<p>Required Personal Skills:\n* Excellent written, verbal, and non-verbal communication skills\n* Ability to work in a team setting\n* Strong initiative, capable of working on a self-sufficient basis and identifying areas of potential technical improvement\n* Self-management, capable of prioritizing and executing multiple tasks and projects\n* Problem solving, ability to diagnose and resolve technical issues<p>Preferred:\n*  2+ years experience in front-end development\n* Experience with Sass\n* Experience with&#x2F;enjoyment for creating and using reusable web component systems, as well as atomic&#x2F;OO CSS systems \n* Experience with MVC frameworks\n* Experience with git or other version control system in a team environment\n* Experience with Scrum&#x2F;Agile development<p>Job Benefits:\n* Develop technology that reaches millions\n* Fun and exciting atmosphere where hard work is recognized and rewarded<p>Compensation:\nHighly competitive base salary + bonus + opportunity for Incentive Equity Units (similar to stock options with favorable tax treatment)<p>More reasons to join Answers:\n• Company provided equipment, such as up-to-date laptops and cell phones\n• Liberal paid time off, and&#x2F;or the ability to earn more based on performance\n• Private office space, garage parking, and other office-related benefits\n• Commuter benefits: transportation by train, subway, bus or ferry\n• 100% company principle paid health insurance -- Free options!\n• Company paid group dental and vision insurance\n• Company paid life and disability insurance\n• Liberal employee performance bonuses\n• Paid time off (PTO) policy - 15 days to start\n• 10 holidays company paid\n• 401k savings plan","time":1412174544,"type":"comment"}