{"by":"ehberger","id":8394849,"parent":8394339,"text":"Desmos - San Francisco, CA<p>-- About us --<p>Desmos builds great math software.  If you love math, write great code, and care about education, then we want to meet you.<p>Check out a sample graph at <a href=\"https://www.desmos.com/calculator/bbhzdbudoy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.desmos.com&#x2F;calculator&#x2F;bbhzdbudoy</a> if you haven&#x27;t seen our calculator before.<p>-- Software Developer (calculator) --<p>The Desmos calculator lives entirely in the browser. It incorporates a realtime LaTeX WYSIWIG editor, includes a full compiler pipeline to interpret unstructured user math input and transform it into meaningful and efficiently-evaluable code, and makes extensive use of modern web technologies such as web workers and canvas rendering. The calculator core is modular and well-tested code which powers our free-to-use desktop, tablet, and mobile versions, used by millions of students, as well as driving our API, which many of the world&#x27;s largest education companies use to power their graphing and math input. There&#x27;s a lot to do to make the calculator faster, more powerful, more featureful and more beautiful, build out mobile apps, and continue to grow the calculator API.<p>We&#x27;re not big into hard requirements, but a love of and interest in math is non-negotiable.<p>If this is the right job for you, you&#x27;re probably also interested in numerical and geometric computation, compilers, code generation, performance optimization, API design, CAS implementation and graphics.<p>-- Software Developer (lessons) --<p>Desmos is redefining what online math content can look like by treating the creation of each lesson as software development. Each lesson we build has unique interactions, streams realtime data to other students and to the teacher dashboard, and has to work effectively across a wide range of devices. Basically, we&#x27;re building a new app every few weeks, each one designed by our team of world-class educators and designers. If you&#x27;re not excited by a never-ending stream of ready-to-build projects that will each make a significant impact on a specific area of math education, this is not the position for you.<p>We need to see a demonstrated ability to create high-quality interactive experiences rapidly, and a love of math and teaching.<p>Bonus points if you&#x27;ve produced and maintained code in a high-throughput &#x2F; multi-product environment, developed complex single-page web apps, built complex touch interactions, or spent time as an educator.<p>-- Why Desmos --<p>Here&#x27;s what it means to work at Desmos.<p><pre><code>  * Great benefits: full medical and dental, catered lunch every day, unlimited vacation days whenever you need them.\n  * Productive environment: no mandatory meetings, bureaucracy, or artificial barriers. Full transparency and participation in company goals and direction.\n  * Competitive compensation: we offer substantial equity and competitive salary to every fulltime employee. We want everyone to feel both financially secure and deeply invested in the future of the company.\n  * Work-life balance: we value results over hours, and sustainable, long-term success over short-term wins.\n</code></pre>\n-- Apply --<p>If this sounds like you, send an email with resume to careers@desmos.com","time":1412175252,"type":"comment"}