{"by":"joshuakarjala","id":8394710,"kids":[8400096],"parent":8394339,"text":"CTO candidates - FULLTIME<p>Founders - Copenhagen, Denmark - <a href=\"http://founders.as/joinus/cto/\" rel=\"nofollow\">http:&#x2F;&#x2F;founders.as&#x2F;joinus&#x2F;cto&#x2F;</a><p>BE PART OF BUILDING A NEW COMPANY<p>Founders is a startup studio focused on building healthy technology companies. We believe a lot of the risk of starting a new business can be mitigated by running new ideas and companies repeatable process.<p>Our goal is to co-found 3-4 companies per year and to promote the growth of our existing companies by pooling and sharing strategic resources.<p>As one of our CTOs you will work together with another co-founder and the Founders team to launch a company from scratch.<p>DOES THIS SOUND EXCITING?<p><pre><code>  * Guide a company from an initial MVP to a full-blown product\n  * That means being responsible for maintaining a good balance between scalability, stability and speed of delivery\n  * Make sure the feature is pipeline is based on real operational and customer feedback. With the rest of the co-founders you will be responsible for setting the goals of the company\n  * You will build and lead your own team and ensure a strong and health development culture (both formally and informally)\n\n</code></pre>\nYOUR ARTILLERY<p><pre><code>  * Hands-on experience with technology leadership in an entrepreneurial company or startup\n  * Experience building large web applications from scratch\n  * You like to plan and deliver measurable improvements to the product every week\n  * Language agnostic - we believe in using the best tools for the job\n  * Not scared to get your hands dirty with HTML and CSS - you enjoy working on both the backend and front-end of a project\n\n</code></pre>\nBONUS POINTS<p><pre><code>  * Strong analytics and data analysis experience\n  * Devops experience\n  * Experience developing mobile applications\n  * Open Source contributor\n\n</code></pre>\nTHE ADVENTURE WE OFFER<p><pre><code>  * You will get to work with a team of creative and driven people who are passionate about and skilled in testing ideas and building businesses\n  * Opportunity for equity\n  * Relaxed office on Indiakaj, Copenhagen\n  * Competitive pay + gear\n\n</code></pre>\nInterested? Send your CV, Github etc. marked CTO to connect@founder.as","time":1412174477,"type":"comment"}