{"by":"joshuakarjala","id":8395251,"parent":8394339,"text":"Experienced Python &#x2F; Django Developer<p>GoBox - Copenhagen, Denmark - FULLTIME (<a href=\"https://gobox.dk\" rel=\"nofollow\">https:&#x2F;&#x2F;gobox.dk</a>)<p>Join an ambitious and professional team in building GoBox to become a successful european player.<p>GoBox is an on-demand storage company (dropbox for your physical stuff). GoBox sets out to disrupt the traditional growing self-storage business by being obsessed with convenience, customer satisfaction and a fair price. We want to make it easy to get more space.\nWe have customers, venture funding and is now gathering the team needed to build a scalable product and then grow across Europe<p>DOES THIS SOUND EXCITING?<p>Joining the GoBox development team, means being an integral part of continuously perfecting the following main focus areas.<p>Sales &#x2F; Conversion<p><pre><code>  * Ensure we have a well performing and measurable on boarding process.\n  * Build a structure for easily creating &#x2F; managing &#x2F; measuring campaigns\n</code></pre>\nCustomer experience<p><pre><code>  * Craft a simple and engaging user experience on both mobile and desktop.\n  * Ensure smooth and fault free overview and management of boxes and deliveries.\n</code></pre>\nOperations<p><pre><code>  * Enable efficient handling of couriers and deliveries.\n  * Keep our storage facility well managed from a technical point of view. We insist on keeping our perfect track record of handling customer boxes.\n\n</code></pre>\nRESPONSIBILITIES<p><pre><code>  * Plan and execute development activities\n  * Define and shape features based on operational and customer feedback\n  * Plan and deliver measurable improvements to the product every week\n  * Be responsible for maintaining a good balance between scalability and speed of delivery\n\n</code></pre>\nYOUR ARTILLERY<p><pre><code>  * Strong experience building web applications\n  * You know how to plan and scope a feature\n  * Strong Python experience as GoBox is built in Django. \n  * Not scared to spend time in HTML &#x2F; CSS - you enjoy working on both the backend and frontend of a project\n  * Self-motivated and able to work independently as well as part of a team\n\n</code></pre>\nBONUS POINTS<p><pre><code>  * Analytics experience\n  * Open Source contributor\n  * Devops experience\n  * Experience developing mobile applications\n\n</code></pre>\nTHE ADVENTURE WE OFFER<p><pre><code>  * A chance to build something big\n  * High level of freedom and responsibility\n  * Relaxed office on Indiakaj, Copenhagen Ø\n  * Experienced (and very friendly) colleagues\n  * Competitive pay + gear\n  * The opportunity to earn equity\n\n</code></pre>\nGoBox is based in Copenhagen, Denmark. GoBox was started at and is funded by Founders A&#x2F;S.<p>Interested? Send your CV, Github etc. marked DEVELOPER to jakob@gobox.dk","time":1412177640,"type":"comment"}