{"by":"svjozi","id":8395860,"parent":8394339,"text":"Unata (Toronto) - Full-time<p>Unata (unata.com) is a VC-backed, Toronto-based startup in the enterprise retail space. We are building the retail experience of the future. We work with large retailers to power their digital experiences (web, mobile, email, etc.), while personalizing each shopper’s content and offers based on their purchase history. We’re connecting the physical shopping experience with the best of the digital world.<p>Current stack<p>Backend: Python (Flask, SQLAlchemy, Celery, Numpy, Pandas), PostgreSQL, Cassandra, Jenkins CI, Redis, Memcached, CentOS<p>Frontend: iOS, Android, Angular.js, Sass, Grunt<p>We are growing fast and need to scale our core product team (Jobs page &gt; bit.ly&#x2F;1uBEinc). We are looking for the roles below.<p>- Back-end developer -  \nPython experience, intermediate&#x2F;sr, understanding of service-oriented architectures (more info &gt; bit.ly&#x2F;1iT202T)<p>- Mobile developer -  \niOS and&#x2F;or Android experience, Sr, great understanding of mobile app architecture (more info &gt; bit.ly&#x2F;1uBEpit)<p>- Lead UI&#x2F;UX Designer - \nExperience with web AND mobile, on top of design trends (iOS7&#x2F;8, Material design, etc.), ability and willingness to take over the product design efforts, working smoothly with developers &amp; product managers, HTML&#x2F;CSS chops for rapid prototyping prefered (more info &gt; bit.ly&#x2F;1uBEVwR)<p>- Web developer - \nMastery of modern, core web technologies and experience building large, modular client-side apps using MVC style frameworks like AngularJS and Ember (more info &gt; bit.ly&#x2F;1rM8o5l)<p>Why you should work for us:<p>- Competitive compensation and stock options, comprehensive health benefits, flexible paid vacation<p>- Relaxed work environment in downtown Toronto (King &amp; Bathurst), Work-from-home-Wednesdays, Fun company activities<p>- Opportunity to make a big impact in digital retail! Your work will be seen and used by millions of retail customers!","time":1412181999,"type":"comment"}