{"by":"atto","id":8395008,"parent":8394339,"text":"Kifi (<a href=\"http://www.kifi.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kifi.com&#x2F;</a>) - Mountain View, CA (H1B okay, prefer already in the area) - Front-end, mobile, designer, backend, search&#x2F;information retrieval<p>—— About us ——<p>Kifi.com is a recommendations network, designed to help us outsmart information overload together. As Kifi automatically learns your interests and your friends’ interests, it helps you find and discover only the good stuff, from the right people at the right time -- anytime, anywhere. We&#x27;re well funded and are growing quickly.<p>We use several fun technologies like Scala, Lucene, Akka, Play Framework, browser extensions, AngularJS, Gulp, etc.<p>—— Front-end Engineer ——<p>Build the product, bridging our backend to an excellent user experience. Day to day, you will work with product managers, designers, and other engineers to create a modern and easy-to-use product. You’ll strongly influence which technologies we use across our whole stack and how we incorporate them. We use AngularJS, gulp, etc.<p>• Highly proficient in JavaScript and HTML&#x2F;CSS<p>• Well versed in HTTP semantics and web API design principles<p>• Good knowledge of at least one backend programming language<p>• Comfortable learning and using new web technologies to build rich applications (think WebSockets, MutationObservers, CSS Transforms, SVG …)<p>—— Mobile engineer ——<p>Design and build high quality, modern consumer mobile user experiences. Define and implement APIs (library and network) for mobile apps. Our mobile engineers should be comfortable working at all levels of the development stack (storage, server, multiple mobile platforms).<p>• Prior iOS or Android experience<p>• Passionate about user experience<p>—— Lead Designer ——<p>We’re looking for a talented designer to join our founding team. You will be working closely with our founders and our experienced team (previously from Google, Facebook and Linkedin). You will be responsible for all design aspects of our consumer product, UI&#x2F;UX Design, mobile design, website design, and brand design.<p>• Passionate about understanding consumers needs and designing accordingly<p>• Loves designing for a variety of platforms and products (web, mobile, tablets, etc.)<p>• Know which details matter and when to push back and say “no.”<p>• Communicate your designs to the team with patience while being open to feedback<p>—— Machine Learning &#x2F; Information Retrieval Engineer ——<p>Kifi is dealing with massive amounts of user events, analytics data, social graphs and web documents. You will be asked to design and build a new breed of Machine Learning and Information Retrieval systems that will be of large scale with tight throughput and latency requirements.<p>• Proficient in at least one JVM language and can easily pick up Scala<p>• Passion for elegant and efficient algorithms and data structures<p>• Experience with implementing high quality ML&#x2F;IR systems<p>There&#x27;s a few more positions listed at <a href=\"https://www.kifi.com/about/join_us\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kifi.com&#x2F;about&#x2F;join_us</a>. If you&#x27;re interested, the best contact address is careers@kifi.com. If you have any questions or want to chat more about what we&#x27;re working on, feel free to drop me a line directly at andrew@kifi.com.","time":1412176143,"type":"comment"}