{"by":"QTtech","id":8395180,"parent":8394339,"text":"TORONTO, FULL-TIME\nHiring for: SOFTWARE BUILD MANAGER<p>ABOUT US:\nQuestrade is Canada’s fastest growing online discount brokerage!<p>We’re a tech company that operates within financial services, and we’re committed to transforming brokerage services for all Canadians through the use of innovative and cutting edge technologies and trading platforms. \nWe do everything in-house – from desktop services, UX&#x2F;UI and graphic design, systems administration – you name it! \nWe believe “work doesn’t need to suck” and we’re looking for people who feel the same. If you’re looking for a place where you can grow your career, work with exciting technologies and projects, and collaborate with amazing and talented people, you’ve come to the right place!<p>We have 30+ opportunities. Check out our website at www.questrade.com&#x2F;careers<p>ABOUT THE SOFTWARE BUILD MANAGER ROLE:\nYou will be responsible for - \n•\tAdministration and maintenance of source code repository (SVN)\n•\tAdministration and maintenance of defect tracking system (JIRA)\n•\tManaging automated build system (Hudson)\n•\tMaintaining and developing scripts and utilities to support SCM processes\n•\tParticipating in build promotion process development\n•\tDocumenting on SCM practices and tool usage\n•\tCreating and organizing trainings on SCM subject for team members\n•\tPerforming audits on projects and systems to ensure that the SCM procedures and guidelines are followed<p>Are you qualified? You are if...\n•\t5+ years of experience in Software Configuration Management (SCM) field\n•\tProven record of multi-platform product release and maintenance\n•\tExperience with building and packaging enterprise-level software products\n•\tFamiliarity with large-scale C++ and .NET software development\n•\tProven record of organizing and maintaining successful SCM processes\n•\tExpert knowledge of one or more scripting languages (Python, Perl, Shell)\n•\tGood understanding of software development and SCM practices\n•\tUnderstanding of source code versioning, experience setting up and administering SVN repositories\n•\tExperience with build automation tools such as Hudson \n•\tBachelor Degree in Computer Science or related discipline\n•\tExcellent written and verbal communication skills\n•\tFlexibility to work in constantly evolving environment\n•\tKnowledge of Continuous Integration principles\n•\tExperience with Atlassian Software product line (JIRA, Fisheye, Confluence, Crucible)\n•\tExperience with automated build and versioning systems (Hudson)","time":1412177189,"type":"comment"}