{"by":"joshuakarjala","id":8395199,"kids":[8400098],"parent":8394339,"text":"Developer - FULLTIME, possibly remote<p>Founders - Copenhagen, Denmark - <a href=\"http://founders.as/joinus/developer/\" rel=\"nofollow\">http:&#x2F;&#x2F;founders.as&#x2F;joinus&#x2F;developer&#x2F;</a><p>BE PART OF BUILDING A NEW COMPANY<p>As a developer in one of our portfolio companies, you will work within a product team to launch a company from scratch.<p>You will be part of developing a product which solves real world problems and generates real revenue.<p>DOES THIS SOUND EXCITING?<p><pre><code>  * Be part of a company going from an initial MVP to a full-blown product\n  * Deliver polished features based on operational and customer feedback\n  * Help create an architecture with a good balance between scalability and speed of delivery\n  * Work with a talented and passionate team\n\n</code></pre>\nYOUR ARTILLERY<p><pre><code>  * Experience building web applications\n  * You know how to plan and scope a feature\n  * Our companies use a wide array of technologies. Hopefully there is a match with your experience. We belive in using the right tools for the job and prefer people who are not fanatics :)\n  * Not scared to get your hands dirty with HTML and CSS - you enjoy working on both the backend and frontend of a project\n  * Self-motivated and able to work independently as well as part of a team\n\n</code></pre>\nBONUS POINTS<p><pre><code>  * Experience developing mobile applications\n  * Open Source contributor\n  * Analytics experience\n  * Devops experience\n\n</code></pre>\nTHE ADVENTURE WE OFFER<p><pre><code>  * You will get to work with a team of creative and driven people who are passionate about and skilled in testing ideas and building businesses\n  * Relaxed office on Indiakaj, Copenhagen Ø\n  * Competitive pay + gear\n  * The opportunity to join the startup if you fall in love\n\n</code></pre>\nInterested? Send your CV, Github etc. marked DEVELOPER to connect@founder.as","time":1412177314,"type":"comment"}