{"by":"eworksmedia","id":8395284,"parent":8394339,"text":"Front-end Developer in Rancho Mirage, CA (<a href=\"http://www.e-worksmedia.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.e-worksmedia.com</a>)<p>We are a branding and development firm looking for a temporary to full-time (5 mos; may develop into permanent) front-end developer to assist in web development, applications and plugin projects and to help maintain multiple web properties and assist in ongoing development and maintenance of internally developed CMS and web framework.<p>Responsibilities:<p><pre><code>   • Attend team meetings.\n   • Possible attendance in client meeting&#x2F;presentations.\n   • Collaborate with Project Manager&#x2F;Designer&#x2F;Lead Developer in development project plans.\n   • Collaborate with Lead Developer on development execution.\n   • Follow development plans.\n   • Assist in developing development plans.\n   • Adheres to schedules.\n   • Provides timely status&#x2F;risk reports to Project Manager.\n</code></pre>\nQualifications:<p><pre><code>   • Expertise in modern HTML&#x2F;CSS&#x2F;Javascript stack\n   • Ability to Create &#x2F; Understanding of &#x2F; Ability to Execute modern UX patterns\n   • Moderate knowledge in PHP\n   • Knowledgeable in Smarty a big plus. If no knowledge in Smarty, PHP expertise required. \n   • Knowledgeable in Doctrine a plus, not required. \n   • Understanding of MVC design pattern\n   • Critical thinkers only! Ability to troubleshoot&#x2F;fix on-the-fly in creative ways.\n   • Must have sound understanding of the Web as a platform.\n   • Must love to write code. Ideal candidate considers themselves a programmer first-and-foremost.\n   • Must root for the NFL Raiders and NBA Lakers.\n   • Ability to take a joke.\n   • Ability to brainstorm creative pranks.\n   • Ability to browse reddit, imgur, and hacker news and still be productive ?_?..\n</code></pre>\nTemporary (5 mos contract) to Permanent Position<p>Benefits for permanent employees.<p><pre><code>   • Medical\n   • Dental\n   • Life Insurance\n</code></pre>\nAbout Us:<p>e-works media, inc. - creative services and beyond... Why we do it? It&#x27;s in our blood.<p>Our team at e-works media is composed of highly skilled professionals possessing tremendous passion for the industry we serve. We take much pride in delivering the absolute best work and service possible. We simply couldn&#x27;t do anything else.<p>Branding. Creative Services. Web Apps. Website Development...<p>e-works media, inc. is an award winning Southern California branding company with a proven track record. From identities, printed materials, interactive websites, web-based software applications, content and social media strategies and on in to building mobile and tablet technologies, we have the advertising, marketing and visual design experience and expertise required to deliver effective media solutions. In the past several years we have completed hundreds of successful projects and campaigns for a variety of clients of all sizes. And we are not just consultants. We can execute on just about everything we recommend.<p>But, no one can do it alone. We combine beaucoup talented artists, strategist, marketers and programmers into a team that will not only conceptualize and develop creative solutions for our clients, but also integrate that solution into new or existing technologies. We develop new strategies, ideas and concepts to build logos, images and branding, marketing messages and campaigns, launch new products, sell products, build web properties - mobile properties – all promoting positive relations between our clients, their customers, vendors, staff and their industry. We have developed our own CMS&#x2F;framework, project management tools, communication tools and browser plugins to create a well oiled machine that allows for a very efficient workflow and reduces the risk of boredom from execution of tedious tasks.<p>To Apply:\nPlease email your resume and cover letter to jobs@e-worksmedia.com and reference your availability and other requirements you may have.<p>We look forward to hearing from you! <a href=\"http://www.e-worksmedia.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.e-worksmedia.com</a>","time":1412177882,"type":"comment"}