{"by":"tptacek","id":8395627,"kids":[8397518],"parent":8394339,"text":"Chicago. New York City. San Francisco. Mountain View.<p>Matasano Security &#x2F; iSEC Partners<p>Job Title: Senior &quot;three year endless winter whose storms rattle branches off world-tree, hearkening the end of this world, the rebirth of the next&quot; Engineer.<p>Startup devs work to build things people want. Matasano team members work to break things people want.<p>This is, I expect, my last HN hiring post for Matasano. My last day is next Friday. Yggdrasil&#x27;s branch has struck the world-serpent Jormungand, Heimdall strides towards the Gjallarhorn, the garbage around my desk is being picked up, the yeti pictures torn down.<p>I confidently recommend Matasano. The team is amazing. There are too many great people here to list, but let me talk about a couple. Do these sound like roles you&#x27;d like to play?<p>* The German PhD who hit the ground running as one of our best C&#x2F;C++ vulnerability researchers, wrote the &quot;idb&quot; iOS analyzer, and schooled the rest of the team on timing attacks.<p>* The person we moved from DC to Chicago, along with their... notable... Windows driver security and exploit development skills.<p>* The Mountain View line-of-business web software dev we found who picked up a Rails CVE within an hour of looking at Rails for the first time.<p>* The Santa Cruz shorts-and-flip-flops-wearing RTOS spelunker and Microcorruption coauthor; that guy has seen some shit.<p>* The devops from STL who&#x27;d never so much as poked at a web app who implemented an impossibly tricky lattice-reduction+FFT cryptanalytic attack that Nate Lawson showed me as a joke, inside of a week.<p>* The Chicago .NET dev who found us on HN and wound up writing half the crypto challenges<p>I give up. This post would be 5000 words long if I tried to capture just one awesome thing about everyone I work with here. I will miss working with all of them terribly. You could be working with them now. I think you should!<p>As Patrick McKenzie once put it: &quot;If I were looking for a day job, I wouldn&#x27;t be looking for a day job any more: they&#x27;re friendly, happy people who get social license to join the Dark Side, do smart stuff all day, and then go home while it is still light out.&quot;.<p>Matasano tries very, very hard to be cool about hiring. You can&#x27;t waste their time, and they&#x27;ll respect yours.<p>www.matasano.com&#x2F;careers","time":1412180427,"type":"comment"}