{"by":"hectorals","id":8396124,"parent":8394339,"text":"Software Engineer - Ripple Identity Platform | Ripple Labs | San Francisco, CA | careers@ripple.com<p>=========<p>Our team:<p>The Ripple Identity team is revamping the way digital identity works on the Internet. We’re operating on two core beliefs: 1) that individuals - not social networks, governments, or corporations - should control their own data and 2) that access to the traditional banking system is broken.  If you want to fix these problems, then we should talk!<p>=========<p>About Ripple Labs:<p>Ripple Labs is a 60+ person seed-stage startup backed by investors like Google Ventures, Andreessen Horowitz, Lightspeed Venture Partners and IDG Capital Partners. We developed Ripple (www.github.com&#x2F;ripple&#x2F;rippled), an open-source, distributed payments protocol that enables the exchange of value in any currency, instantly and for free. Ripple is the world’s first distributed currency exchange, where you can trade any store of value, including dollars, yen, euros, bitcoins, and even loyalty points. Our code is open-source and has been forked by thousands of developers around the world.<p>=========<p>About you:<p>You’re committed to our mission of empowering consumers to access the financial system, and control their data and who they share it with.<p>You are an engineering leader. You take pride in each commit, knowing that your work is public and you’re setting the standard for the Ripple community<p>You are self-directed and are pro-active about asking for input<p>You enjoy mentoring software engineers, and consider Ripple’s developer community an extension of your team<p>You enjoy working on small teams, and managing your time without direct supervision<p>=========<p>Your background:<p>Javascript experience, especially Node.js (Angular.js, Less, or Jade experience are an added bonus)<p>Professional experience with backend web development, in any language<p>Professional experience with test driven development<p>Preferred experience implementing open standards for authentication and authorization, such as OAuth and OpenID Connect<p>Ability to communicate effectively with a scientific mindset - empirically test your hypotheses<p>Startup experience or past work with distributed systems or cryptocurrencies are an added bonus<p>Interests: open-source, entrepreneurship, economics and financial markets, strong work ethic, creative thinking, systems architecture thinking, cryptography, creative logic, fast-paced environment<p>=========<p>What we offer:<p>Competitive salary and compelling seed stage equity<p>Fully paid medical and dental insurance for employees, 50% contribution for spouses and dependents<p>Take time off when you need it - unlimited vacation policy<p>Industry-leading maternity and paternity leave policies<p>Open source projects 100% of the time<p>A learning environment where you can dive into the latest technologies and engineering principles as well as mentor our upcoming engineers<p>Work with some of the best - early Bitcoin pioneers and cryptographers, ex-NASA engineers, ex-Fed regulators<p>=========<p>To apply, email careers@ripple.com","time":1412184134,"type":"comment"}