{"by":"hectorals","id":8396086,"parent":8394339,"text":"Senior Software Engineer - Front End | Ripple Labs | San Francisco, CA | careers@ripple.com<p>=========<p>Our team:<p>The Ripple Client team is responsible for taking Ripple’s groundbreaking new technology and making it usable. Our code is open-source and has been forked by thousands of developers around the world.<p>=========<p>About Ripple Labs:<p>Ripple Labs is a 60+ person seed-stage startup backed by investors like Google Ventures, Andreessen Horowitz, Lightspeed Venture Partners and IDG Capital Partners. We developed Ripple (www.github.com&#x2F;ripple&#x2F;rippled), an open-source, distributed payments protocol that enables the exchange of value in any currency, instantly and for free. Ripple is the world’s first distributed currency exchange, where you can trade any store of value, including dollars, yen, euros, bitcoins, and even loyalty points.<p>=========<p>About you:<p>You are an engineering leader. You take pride in each commit, knowing that your work is public and you’re setting the standard for the Ripple community. You create intuitive user interfaces that make our users smile. You enjoy mentoring software engineers, and consider Ripple’s developer community an extension of your team. You are self-directed and are pro-active about asking for input. You’re a true team player, willing to sacrifice for the greater good of our team. You’re committed to our mission of making value move like how information moves today.<p>=========<p>You’ll get to:<p>Architect and build Angular.js applications for traders and consumers around the world<p>Collaborate with UX and product designers on building the best user experiences possible<p>Optimize engineering processes so that our team can produce as quickly as possible<p>Share our approach and principles with developer communities both in San Francisco and worldwide<p>Build out a global open -source community who will look up to you for guidance and support<p>=========<p>Your background:<p>Experience building beautiful consumer user web applications<p>Expert knowledge in Javascript<p>Extensive knowledge about version control systems (Git preferred)<p>Angular.js, Node.js, Less, or Jade experience are an added bonus<p>Professional engineering experience in a diverse set of languages and understanding of engineering concepts:<p>Object-oriented and classical inheritance paradigms<p>Unix process and concurrency models<p>Server application deployment and infrastructure automation<p>Design patterns<p>Unit and end-to-end testing<p>Ability to communicate effectively with a scientific mindset - empirically test your hypotheses.<p>Startup experience or past work with distributed systems or cryptocurrencies are an added bonus<p>Interests: open-source, entrepreneurship, economics and financial markets, strong work ethic, creative thinking, systems architecture thinking, cryptography, creative logic, fast-paced environment<p>=========<p>What we offer:<p>Competitive salary and compelling seed stage equity<p>Fully paid medical and dental insurance for employees, 50% contribution for spouses and dependents<p>Take time off when you need it - unlimited vacation policy<p>Industry-leading maternity and paternity leave policies<p>Open source projects 100% of the time<p>A learning environment where you can dive into the latest technologies and engineering principles as well as mentor our upcoming engineers<p>Work with some of the best - early Bitcoin pioneers and cryptographers, ex-NASA engineers, ex-Fed regulators<p>State-of-the-art penthouse facility with a private rooftop deck and private elevator in the heart of San Francisco’s Financial District and flexibility to work remotely<p>========<p>To apply, email careers@ripple.com","time":1412183886,"type":"comment"}