{"by":"lightningstorm","id":8396219,"kids":[8416802],"parent":8394339,"text":"Good Eggs - San Francisco, CA, Full Stack Engineers<p><a href=\"http://www.goodeggs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.goodeggs.com</a><p>=== About us ===<p>Good Eggs brings local, farm-fresh groceries right to your door! We are a technology focused company with a CTO who previously founded Carbon Five, an exceptional agile development shop. See our Engineering Blog and Github account:<p><a href=\"http://bites.goodeggs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bites.goodeggs.com</a><p><a href=\"https://github.com/goodeggs/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;goodeggs&#x2F;</a><p>We have a great mission (<a href=\"https://www.goodeggs.com/about/mission\" rel=\"nofollow\">https:&#x2F;&#x2F;www.goodeggs.com&#x2F;about&#x2F;mission</a>) - to grow and sustain local food systems worldwide - and everyone here is deeply committed to it. We started in 2011 and have over 200 employees across four cities (New York, New Orleans, Los Angeles and San Francisco). Our investors include Sequoia Capital, Harrison Metal, Baseline Ventures, Collaborative Fund and Westly Group, among others.<p>There are 16 of us on the engineering team and we’re actively growing. We’re building next-generation web and mobile applications with JavaScript across the stack, including Node.js, MongoDB, AngularJS, Backbone, CoffeeScript and a wealth of other tools from the rapidly-evolving JavaScript ecosystem. We employ the best practices of test-driven development, pair programming, and continuous deployment. We use the leading SASS providers - Heroku, AWS, Algolia (search), Mixpanel, Sendgrid, etc. We are happy to train the right person to work in this environment.<p>== Perks ===<p>* Medical Insurance with FSA&#x2F;HSA options, vision, dental, etc.<p>* Super tasty lunches made on-site by our chefs using healthy and fresh ingredients (from our producers!)<p>* Amazing work&#x2F;life balance and time-off policies<p>* Snacks<p>* Laptop<p>== About you ===<p>Ideal Candidates Will Have:<p>* Full-stack web application development experience in Ruby, Python, Java, or JavaScript<p>* Agile software development experience including automated testing and pair programming<p>* Demonstrable interest in learning and adopting new tools and techniques<p>More information:<p><a href=\"http://www.jobscore.com/jobs2/goodeggs/software-engineer/cQ_hd-0USr4Om7eJe4iefn\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;goodeggs&#x2F;software-engineer&#x2F;cQ_...</a><p>I joined the company recently, feel free to e-mail me: moshe(at)goodeggs.com","time":1412184838,"type":"comment"}