{"by":"spang","id":8396812,"parent":8394339,"text":"Inbox | <a href=\"https://www.inboxapp.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.inboxapp.com&#x2F;</a> | San Francisco, CA (Mission) or REMOTE | Backend systems + Ops<p>Hi! We&#x27;re Inbox, and we&#x27;re looking for help building the next generation email platform. We&#x27;re building a missing piece of Internet infrastructure and are looking for systems and infrastructure&#x2F;operations engineers to join us.<p>Companies are building their core businesses around our API right now, and that means we have to be reliable, up all the time, and fast. We have more data for a single user than in most startups&#x27; entire database. That means big technical challenges to solve as we scale out our fledgling distributed backend.<p>== We&#x27;re particularly looking for folks who ==<p>* Take personal pride in their work and value autonomy and ownership.<p>* Have a experience with automated deployments, debugging running systems, release engineering, and on-call schedules, but are still comfortable writing code.<p>* Want the chance to step up and lead a team.<p>* Put the work before ego. We&#x27;ve got each others&#x27; backs, and we want you to be with us on that.<p>== A bit more about us ==<p>* We&#x27;re built on tools like Python, Flask, gevent, nginx, MySQL, AWS, and Debian. Go and Docker are likely to join this list soon. We&#x27;ve been careful to keep our architecture componentized.<p>* Tons of our code is open source. Check it out: <a href=\"https://github.com/inboxapp\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;inboxapp</a><p>* We&#x27;re 40% women on our team of 10 (9 engineers), including 1 of 2 cofounders. We want to make that number 50%.<p>* Our sunny Mission office is more cozy than tidy. Think art studio, not corporate.<p>* We&#x27;re more likely to end up at the climbing gym or on a bike ride together than out drinking at the latest startup event.<p>* We have an open vacation policy and value personal responsibility and ownership.<p>To apply, email your resumé (+ GitHub&#x2F;code links if you have) to spang@inboxapp.com. We welcome and encourage applications from women and people of colour.<p>More info and other open positions: <a href=\"https://www.inboxapp.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.inboxapp.com&#x2F;jobs</a>","time":1412189516,"type":"comment"}