{"by":"GiselleDarlene","id":8396607,"parent":8394339,"text":"Director of Technology - VC-backed E-commerce - Full-Time - Chicago, IL<p>Doggyloot.com is looking for driven, thoughtful, and dog-loving professional to join our team.<p>Our small engineering team has already built a robust CRM&#x2F;e-commerce&#x2F;fulfillment platform and migrated from Ruby on Rails to Node.Js and Backbone. We are looking for a technology leader to help take our Company to the next level. This is a great opportunity to get involved early and make your mark with a promising, funded startup with rapidly-growing revenue and interesting technologies.<p><i>RESPONSIBILITIES</i><p>-Lead and complete significant development projects (front and back end) for our existing systems\n-Manage our product development cycle and responsible for project management\n-Manage our small development team\n-Ensure our platforms scale with our growing startup<p><i>ABOUT YOU</i><p>-Experience in project management and delivering complex projects on-time and on-budget\n-E-commerce experience preferred\n-Experience with Node.JS, Python, JavaScript, Django, Backbone, Git, Ruby on Rails, HTML&#x2F;CSS\n-Can clearly explain technical concepts and make decisions with technical and non-technical team members\n-Can complete basic server administration tasks\n-Experienced with TDD, Agile, etc., but also sensitive to balancing process and progress<p><i>BONUS POINTS</i><p>Interest in or experience with personalization\nFull stack developer background\nDog lover\nHOW TO APPLY<p>Email us at jobs@doggyloot.com with:<p>-Resume or LinkedIn profile\n-Explain why you’re specifically interested in this position and Doggyloot\n-Provide some links to your public GitHub projects or other code samples, and online work examples\n-Make one technical suggestion for our company (could be an improvement to our existing website, or a general idea of something that could help bring our business to the next level)<p>Doggyloot offers competitive compensation based on experience. We are conveniently located in the West Loop at 213 N Racine Ave, Chicago, IL 60607.\nNo recruiters, please.","time":1412187776,"type":"comment"}