{"by":"sikakkar","dead":true,"id":8396490,"parent":8394339,"text":"Front Row Education (<a href=\"https://www.frontrowed.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.frontrowed.com&#x2F;</a>) - San Francisco, Fulltime<p>== Position ==<p>Early Full-stack web engineer to join fast-growing education startup that changes how hundreds of thousands of kids learn math. Email jobs@frontrowed.com<p>== TL;DR - Reasons to care about working with Front Row ==<p>- A mission you can be proud of: kids using Front Row improve twice as much at math\n- Tremendous impact on a small team\n- Flexibility on what you work on, and autonomy over your schedule\n- Effective &amp; exciting tools: Clojure, Haskell, PostgreSQL, Backbone.js, Ansible\n- Be part of a growing success: in just over a year after launch, we are in more than 6% of all US schools<p>== The Business ==<p>Millions of teachers around the USA are struggling to help 30+ students in their class learn math because every student is in their own place. In a typical fourth grade classroom, there may be students learning to count, students learning to add, students learning to multiply, and students learning how exponents work - and one teacher somehow needs to address all these needs.<p>Thousands of teachers use Front Row every day to save hours of time and make sure their students are growing quickly. Front Row active users have been growing 100% a month for the past 8 school months.<p>== The Role ==<p>As one of our very first engineers, you will be part of a team of developers who are passionate about their vocation, take pride in their craft and who push each other to grow as professionals. You will strive for pragmatism and 80&#x2F;20 in your work. You will be using tools that provide you with the most leverage and make you most effective. By working really smart, you will produce more than the average developer ever will, but without the crazy hours.<p>You will work in an effective team that plans, executes and reflects together. Because we’re a small team, everything you create will go into production and be used by students. You will never do unimportant work: every contribution will make a clear and tangible impact on the company’s trajectory. Your personal success will be directly aligned with that of the company.<p>Most importantly, your work will have purpose: Front Row is a mission-driven company that takes pride in making a significant impact in the lives of hundreds of thousands of students.<p>== Benefits ==<p>- Competitive salary\n- Generous equity option grants\n- Medical, Dental, and Vision\n- Food budget\n- Work from home up to 1 day a week, extremely flexible work schedule\n- Team meal outing every week, and half-day event every month (trip to Sonoma, BBQ, etc)\n- Equipment budget\n- Flexible, untracked vacation day policy\n- Working from Runway - one of the best startup coworking locations right in the heart of San Francisco<p>Email jobs@frontrowed.com to tell us a bit about yourself if you would like to apply.","time":1412186790,"type":"comment"}