{"by":"MattRogish","id":8396742,"parent":8394339,"text":"Remote - Rails Machine - Senior&#x2F;Mid-Level Site Reliability Engineers<p>==\nEmail matt at railsmachine dot com and please put &quot;SRE Job Application&quot; in the subject. Thanks!\n==<p>At Rails Machine, we all work from home - we have a “Remote First” culture. We are a Results-Only Work Environment, have a transparent and public technical ladder, unlimited time off, and require healthy work-life balance. Rails Machine pays 100% of health insurance premiums, participates in 401k match and has been bootstrapped and profitable since our founding in 2006. All employees participate in quarterly profit sharing.<p>As a Site Reliability Engineer at Rails Machine, your goals will be to ensure our customer’s applications are available, fast, and secure. Our customers need the best service, support, and products, and we need you to help us deliver.<p>At Rails Machine, we offer two main products: managed infrastructure and managed operations. Through managed infrastructure, we provide automation, infrastructure, and scalability in our own data center on our own hardware. We provide both bare-metal and virtualized hosting options for our customers, and you’ll work directly with them to ensure their goals are met through automation, analysis, and hardware.<p>Via managed operations, we provide custom, consulting-based solutions on top of AWS and other cloud vendors, as best meets our customer’s needs. You’ll manage globally load balanced AWS installations, cross-datacenter replication on different vendors, or within customer’s data-centers.<p>No matter the product, we take a DevOps-centric approach with our customers - we believe that we provide the best service and our customers get the best value when we work closely together. We integrate task trackers (Pivotal, Trello, Asana), chat (Slack, Hipchat), and source control (github) into our own workflow through careful and clever use of automation, giving our customers the ability to reach out to us like they would with an internal DevOps team but without an operational burden on us.<p>You’ll work with virtualization and container technologies like Xen, OpenStack, Vagrant, Ansible, and Docker. You will setup and automate high availability data clusters (MySQL Galera, PostgreSQL replication, Redis failover, ElasticSearch clustering, Memcached, MongoDB etc.), application instances for technologies like Ruby-on-Rails, Django, Node, and Scala (to name a few), and layer on top of those management, orchestration, monitoring, and alerting for fleets of instances. If you’ve ever wanted to work at a scale that few companies do, you’ll find the right challenge here at Rails Machine!","time":1412188950,"type":"comment"}