{"by":"bretkugelmass","id":8397668,"parent":8394339,"text":"Airphrame - UAV Technology &#x2F;&#x2F; San Francisco, CA &#x2F;&#x2F; email:jobs@airphrame.com<p>Full Time: \n- Full Stack Web Developer\n- Front End Web Developer\n- Back End Web Developer\n- Mechatronics Engineer\n- Computer Vision Engineer<p><pre><code>   ---------------\n</code></pre>\nCompany:\nAirphrame, a well funded venture-backed startup based in San Francisco, is building the technology to control fleets of autonomous devices in a scalable and centralized manner. That&#x27;s right, tens of thousands of robots under our control... do I have your attention?<p>Our product focus is the development of a UAV-based “on-demand imaging platform,” primarily for data collection, to assist civil engineers, land surveyors, environmental engineers, and other professionals. Our technology has already demonstrated a tenfold cost reduction compared to traditional survey operations. Our goal is to use that advantage to open up a new realm of data acquisition strategies.<p>Airphrame has been developing drone technology since 2012. We were the first to demonstrate Internet-only based control and the first to utilize fleets commercially (completely without pilots). We&#x27;ve done more with less and plan to keep it that way. We prefer to work with small teams of talented people rather than large teams of “pretty good” engineers. We&#x27;re a tight knit group, with immense respect for each other&#x27;s complementary skill sets. We thrive on pushing the boundaries and our company mascot is a bourbon Manhattan.<p>We’re looking for self-directed, versatile individuals who work well in teams. You should be able to say you are the absolute best at what you do.<p><pre><code>   -----------------\n</code></pre>\nFull Stack:\n- Scala and&#x2F;or Java, JavaScript, HTML, CSS\n- Scalable API design and implementation\n- Relational and NoSQL databases\n- Knowledge of modern frontend frameworks\n- Linux system administration\n- Amazon Web Services (AWS)\n- 4+ years industry experience, coding entire life\n- Passion for robotics, maps, and startup experience are all big plusses\nEXAMPLE TASK FOCUS\nCreate a web interface for an analyst to label objects shown in images that are a part of a large geospatial dataset.<p>Mechatronics:\n - Knowledge of sensor selection, design, and usage (e.g. sensor fusion)\n - Familiar with system integration, microprocessor, signal processing and various communication peripherals (e.g. SPI, I2C, UART)\n - Hands-on prototyping and hardware debugging, including fine-pitch soldering and rework, use of oscilloscopes and logic analyzers\n - Robust knowledge in embedded software developement (C, C++)\n - Bonus: Experience integrating sensors directly with autopilots\nEXAMPLE TASK FOCUS\nSource and integrate a small parachute deployment based on sensor feedback through the Pixhawk flight controller.<p><a href=\"http://www.airphrame.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.airphrame.com&#x2F;careers&#x2F;</a>","time":1412197006,"type":"comment"}