{"by":"danielha","id":8397407,"parent":8394339,"text":"Disqus (<a href=\"http://www.disqus.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.disqus.com</a>) is hiring a Site Reliability Engineer (full time) - San Francisco (SOMA), CA or New York, NY<p>APPLY HERE: <a href=\"http://grnh.se/xd5jkt\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;xd5jkt</a><p>We&#x27;re looking for an experienced Site Reliability Engineer to play an integral role on our DevOps team at Disqus. The ideal person is obsessed with uptime and site speed and has years of experience with server hardware and Linux systems. At the same time, you are passionate about working with development engineers to get more done faster with less trouble. You&#x27;ll be working at our office in San Francisco. Disqus reaches over 1 billion unique visitors a month. You&#x27;ll be working on large scale challenges immediately as well as make a huge, lasting impact on all technical decisions.<p>What You&#x27;ll Do<p>- Work with our server-side infrastructure, including configuring Linux systems (e.g. packaging) and dealing with hardware\n- Participate in 24&#x2F;7 on-call rotation (be available by phone or email in case something goes wrong)\nTroubleshoot issues with hardware, software, applications and network\n- Work with engineers on product decisions and troubleshooting, but primarily work independently\n- Help improve the development organization’s ability to rapidly and safely deploy code\n- Architect and build our systems for maximum productivity and scalability<p>What We&#x27;re Looking For<p>- Proven ability to build large, reliable, scalable infrastructure (you&#x27;ve directly contributed to scaling a highly-trafficked website or web application)\n- Extensive knowledge of Linux (we use Ubuntu and Debian) and 5+ years of system administrator experience\nPostgreSQL, Slony, pgbouncer; also non-relational such as Cassandra\n- Nginx, HAProxy, Varnish, Memcached\n- Knowledge of shell scripting and Python (familiarity with Django is a plus)\n- Able to join the team onsite at San Francisco HQ or NY office<p>Nice-to-Haves<p>- A relevant university degree is great, but we care more about industry experience and knowledge\n- Programming experience (Python, Django, JavaScript). You&#x27;ll work directly with engineers and assist in debugging&#x2F;optimizing on the application-side\n- Previous work experience in a startup environment\n- Previous experience with a development focused operations team<p>Work Perks<p>- Competitive salaries and stock options\n- Daily catered lunch and fully stocked snacks, drinks, and beer\n- Weekly in-office yoga and massage\n- Apple computers and a bountiful equipment policy\n- Flexible hours, so you can be at your most productive\n- Generous out-of-office time for holidays, vacation, sick leave, and personal or family needs\n- Comprehensive medical, dental, and vision plan options\n- Team celebrations: company anniversaries, birthdays, weddings, babies - you name it, we celebrate it!\n- 401(k) plan, pre-tax commuter benefits, employee assistance program and flex spending accounts\n- Convenient office location in SOMA near public transit (blocks from BART, Muni, Caltrain) and parking\n- Friendly, casual office environment with plenty of toys (foosball, ping pong, video games, and more)","time":1412194513,"type":"comment"}