{"by":"answers","id":8397726,"parent":8394339,"text":"ANSWERS.COM - Email: amanda.blume@answers.com \nFront-End Developer - Javascript, HTML, and CSS<p>Proven skills building high-performance, large-scale, distributed server applications - you have a portfolio of web apps you’ve played a key role in shipping\nExpert knowledge of Javascript, HTML, and CSS\nExperience with modern frameworks like Backbone or Angular\nExperience with a Javascript unit-testing frameworks, such as Jasmine, Qunit, and Browserstack.\nFamiliarity with a server-side language such as PHP or Java\nExperience working with REST APIs\nA passion for automation, including writing unit and integration tests\nA desire to move fast, ship things, make our customers happy, and get things done\nA history of open source contributions and&#x2F;or personal projects you’ve shipped\nB.S. or M.S. Computer Science or related field, or related experience<p>About our team\nYou&#x27;ll be part of a team focused environment, working with many other talented and driven developers\nEveryone’s voice is heard and you’ll feel the satisfaction of delivering enterprise level software to a global user base\nWe are a development family and work together to solve engaging real world problems\nCareer development is a point of focus – take advantage of the ability to learn new technologies and grow your skill set within individualized career paths<p>More reasons to join Answers: (Varies by region)\nCompany provided equipment, such as up-to-date laptops and cell phones  \nLiberal paid time off, and&#x2F;or the ability to earn more based on performance  \nPrivate office space, garage parking, and other office-related benefits  \nCommuter benefits: transportation by train, subway, bus or ferry  \n100% company principle paid health insurance -- Free options!  \nCompany paid group dental and vision insurance  \nCompany paid life and disability insurance  \nLiberal employee performance bonuses  \nPaid time off (PTO) policy - 15 days to start  \nFlex Hours (Varies by dept)  \n10 holidays company paid  \n401k savings plan","time":1412197571,"type":"comment"}