{"by":"answers","id":8397718,"kids":[8399783],"parent":8394339,"text":"ANSWERS.COM - Email: amanda.blume@answers.com\nSoftware Developer - JAVA SPRING XML - Answers, Ann Arbor, MI<p>As an Answers.com (ForeSee Product Line) Java Developer, you’ll work in small talented teams on products that are used by hundreds of millions of people around the world. From day one, you’ll have an impact on the way Answers does business, the products we offer and the future of the Internet. And with herculean resources at your fingertips, you’ll tackle and solve\nincredibly complex programming challenges. With our Ann Arbor team surrounded by the Great Lakes of Michigan, and our global headquarters in Saint Louis, Missouri combined with offices in California, Cleveland and New York .. Answers truly makes America its home.<p>Please remember our awesome perks like fully stocked kitchens with lots of yummy (and free!) goodies, on-site movies, generous time off for new parents, and of course our world-class monthly field trips and epic annual parties.<p>Leveraging information at the scale of the worlds web requires ideas from every niche of computer science, including artificial intelligence, behavioral analytics, predictive modeling, machine learning, natural language processing, large-scale system design, networking, security, and user interface design; the list goes on and t&#x27;s growing every day.<p>From the worlds leading Q&amp;A platform, to broad reaching media banks, and consumer analytics platforms, many opportunities await you at Answers.<p>We are mostly a Java shop, though we use other technologies and frameworks as the situation requires. We use as many leading edge technologies as we can while remaining responsible and delivering dependable software solutions to our customers.<p>Responsibilities\nContribute to your development team&#x27;s successful implementation of new software and maintenance of existing systems\nCoordinate with the Quality Assurance team to provide rock-solid code and deployment&#x2F;implementation details\nWork with the Product team to devise forward thinking solutions to complex problems\nHandle mutli-tasking and context switching in a fast paced environment","time":1412197496,"type":"comment"}