{"by":"thathoo","id":8397420,"parent":8394339,"text":"San Francisco, CA [Remote Ok]: Front End Engineer, Full Stack (RoR) Engineer - MyTime.com is hiring for full time roles<p>About MyTime. MyTime is reinventing local ecommerce. We’ve built an online destination where consumers can book appointments and purchase local services such as haircuts, house cleanings, massages, and more from nearby local businesses. MyTime has integrated into the leading calendar applications on the market, giving us real-time visibility into each merchant’s schedule. When customers book appointments on MyTime, we even write back to the merchant’s calendar. This allows us to be a true one-stop destination to purchase services from millions of businesses across the country.<p>The Job.<p>Software Engineers at MyTime are developers who thrive on building products and features from scratch. We are generalists who build features end-to-end, from coding up the back end in Ruby on Rails to implementing the subtle interaction behaviors that surprise and delight our users. We build large new features and push daily small product enhancements in a continuous deployment environment.<p>Bring It.<p>For front end specialists \n* Strong technical skills focusing on HTML, CSS, JavaScript (we use JQuery &amp; some Backbone and at some places Angular) \n* Experience with Ruby on Rails or Python \n* Experience with bootstrap a plus<p>For full stack engineers \n* Strong experience with Ruby on Rails or Python \n* Some experience with MySQL, Memcache, and extra credit for ElasticSearch experience \n* Some experience with AWS products (EC2, RDS, S3, ELB) preferred but not required \n* Some experience with HTML, CSS, JavaScript<p>Act now, and you’ll also get: \n* Competitive salary. Significant equity. Opportunity to make a tremendous impact. \n* Full Benefits Package, Catered Meals, Awesome SOMA location. \n* The chance to actually make a difference in a growing startup that is solving a big problem.<p>If you&#x27;re interested, we&#x27;d love to talk! Please send a resume or LinkedIn profile and&#x2F;or a link to your Github to jobs@mytime.com.","time":1412194632,"type":"comment"}