{"by":"CrystalValley","id":8397526,"parent":8394339,"text":"Crystal Valley - Lake Crystal, USA<p>Be part of an organization that helps feed the world! If you possess the following then Crystal Valley would be a great fit.<p><pre><code>  • Solid work ethic\n  • Strong sense of ownership\n  • Committed to doing what’s right\n  • Passion for American agriculture\n</code></pre>\nWe are seeking a Software Developer to join our growing development team! At Crystal Valley, our team develops several types of applications, including WPF Windows programs, iOS apps, and ASP.NET websites.  Most of our software is written in C#, Objective-C, JavaScript, and T-SQL.  While we are most comfortable with Microsoft and Apple technologies, we are open to the technology that will provide us with the best solution.<p>The ideal candidate would complement our current skillset by bringing strengths in front-end web development (such as HTML5, CSS, MVC, Reactive Design, or jQuery), while also being open to learning Windows and Mobile development.  Since this is a small team, you must be willing to work independently and be comfortable with all aspects of software development, including gathering requirements, QA and documenting.<p>Requirements:<p><pre><code>  • Passion for technology and programming\n  • Solid understanding of computer science\n  • Comfort with functional programming concepts and object orientation\n</code></pre>\nDesired Qualifications:<p><pre><code>  • Familiarity with Unit Testing\n  • Strong understanding of web services and REST\n  • A good eye for creating UIs and graphics\n</code></pre>\nThis is a full-time position located at our headquarters in Lake Crystal, MN and includes a competitive salary, health&#x2F;dental&#x2F;vision, 5% 401k match, vacation, profit sharing, an office with 2-4 monitors, and a skilled team of co-workers. The typical work week is 40 hours.  Telecommuting a few days a week is an option.  You’ll also have the choice of hardware and software.<p>Crystal Valley is a local full-service cooperative with 160 full-time employees serving the agronomy, energy, feed, and grain customer. We began in 1927 and have nine locations serving south central Minnesota with sales last year of $375 million.<p>Please send resume to Ashley Leivermann, Human Resources Director at ashley.leivermann@crystalvalley.coop","time":1412195618,"type":"comment"}