{"by":"OscarPedroso","id":8397262,"parent":8394339,"text":"GradFly -- Software Engineer -- Buffalo, NY -- www.gradfly.co<p>About us:<p>GradFly is a repository for hardware projects kind of like github is for code.  STEM students, inventors, tinkerers, and do-it-yourselfers document the step-by-step process of building a project from idea to implementation.  Projects include robotics, electronics, programmables, and manufacturing objects in the K-12, higher ed, and maker spaces. We are growing and would like to extend an invitation for someone to join a small team with dynamic power. Ideally, we’d love to find 2 Software Engineers. Remote is okay.<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><p>Press:<p><a href=\"http://techcrunch.com/2013/04/30/gradfly-launches-an-online-portfolio-platform-to-let-high-school-students-showcase-and-explore-technical-projects/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;04&#x2F;30&#x2F;gradfly-launches-an-online-...</a><p><a href=\"http://www.fastcompany.com/3022198/innovation-agents/4-lessons-your-startup-can-learn-from-a-rust-belt-incubator\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fastcompany.com&#x2F;3022198&#x2F;innovation-agents&#x2F;4-lesso...</a><p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>*\nAbout the role:<p>Seeking full-time Software Engineer experienced in enterprise python development with competency in frontend development in css, html, javascript. Required to have a working knowledge of git, and able to deploy code 10+ times a day (or something like that) :-)<p>Everyone is fullstack and interacts with cto and product management for features they build.<p>You have room to make this position as autonomous or collaborative as you&#x27;d like.  We are free thinkers but also lean on each other when we need help.  We are open books in that sense.<p><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i><i></i>*<p>Applying:<p>Joe and I are the cto and ceo respectively, you can reach out to us at oscar (at) gradfly dot co OR joe (at) gradfly dot co ;Happy to answer questions, share stories, and carry you under our wing. Thanks for reading!","time":1412193355,"type":"comment"}