{"by":"jconley","id":8397056,"parent":8394339,"text":"RealCrowd (YC S13) - Palo Alto, CA - Full Time<p>RealCrowd is a seed funded, profitable, commercial real estate investment marketplace. Investors purchase shares of commercial real estate properties, funds and debt, and participate in their share of the returns on those investments. What were once investments reserved for large funds and country club networks are being opened up to the individual investor.<p>We are taking a fundamentally different approach than others in the &quot;Real Estate Crowdfunding&quot; market and it is working. Investments are growing at a rate of 25% per month and our investors make on average three investments per year at over $50,000 average investment size. We&#x27;ve participated in over $500 Million of real estate transactions with top real estate firms, investors using our site having contributed nearly $17 Million of capital. We listed the first investment about one year ago just before demo day on August 20.<p>We&#x27;re looking for junior engineers that have a passion for the responsive web, an unusual ability to ship code quickly, and a desire to learn from industry veterans.<p>The RealCrowd site is 100% responsive with about 20% of our sessions originating from mobile and tablet devices.<p>Our front end is developed primarily with a custom Bootstrap theme, AngularJS and CoffeeScript.<p>We are an API-first development organization, so there are a myriad of APIs available to the front end.<p>We have designers on staff to help ship best in class UX and visual design.<p>We&#x27;re looking for junior engineers for entry level positions to work on a team with 5 senior engineers with an average of over 10 years of software development experience. We are growing and there should be much room for internal advancement in the future for motivated employees.<p>You should be able to:\n - Build web sites using html, css, and javascript\n - Learn new concepts quickly\n - Try, fail, and try again\n - Be familiar with server side development in a fairly modern environment such as MEAN, RoR, ASP.Net MVC, etc\n - Have a passion for building great user experiences\n - Accept critical feedback and improve your craft\n - Be passionate about being the best software developer you can be\n - Get shit done<p>You will do a small project (where you will maintain copyright) and take a little test rather than have any BS technical puzzle interviews or whiteboard coding.<p>We have 100% paid health insurance, great food, a relaxed yet high output work environment, and commuter benefits available. This role is on-site in Palo Alto.<p>Check us out: <a href=\"https://www.realcrowd.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.realcrowd.com</a> \nA bit about culture: <a href=\"https://www.realcrowd.com/blog/2014/08/realcrowds-team-culture-work-hard-open-stay-balanced/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.realcrowd.com&#x2F;blog&#x2F;2014&#x2F;08&#x2F;realcrowds-team-cultu...</a>\nTech blog: <a href=\"http://code.realcrowd.com\" rel=\"nofollow\">http:&#x2F;&#x2F;code.realcrowd.com</a><p>Email jobs@realcrowd.com. Include samples of your work, if no samples are available email us and we can send you our coding challenge project.","time":1412191426,"type":"comment"}