{"by":"davegolland","id":8397234,"parent":8394339,"text":"We&#x27;re hiring at Prismatic in San Francisco, CA<p><a href=\"http://www.getprismatic.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.getprismatic.com&#x2F;jobs</a><p>== Systems Engineer at Prismatic, San Francisco ==<p>Prismatic is a great place to be an engineer – we analyze millions of shared\nweb pages every day, automatically classify them into tens of thousands of\ntopics, and serve up personalized feeds in real-time using our homegrown,\nlightning fast, machine learning-based relevance engine.  We are looking to\ngrow our top-notch team, with both junior and senior-level positions available.<p>We are looking for engineers with deep interest and knowledge in at least one\narea core to our business (i.e., distributed systems, ops and tooling, machine\nlearning, designing and building new product features). We’re a small team, so\nyou will have the opportunity to have a lot of impact, and to learn from peers\nwho are extremely talented engineers, computer scientists, and data experts.\nOur backend is written entirely in Clojure, a JVM-based LISP that is a dream to\nwork in. Almost none of us knew it before we joined, and we don’t expect you to\neither. We are looking for engineers who will fit well within our engineering\nculture: You live and die by good abstractions. You know that they can make the\ndifference between easily understandable and maintainable code, and a spaghetti\nmess.  You think about edge cases and performance implications, and anticipate\nfuture needs.  You read and understand existing code before diving in and\nadding your own. You re-use existing code whenever possible, cleaning it up as\nneeded to be more generally useful.  You know when to do it fast, when to do it\nright, and how to find the best compromise between the two.  You recognize that\nwe are all stewards of the codebase, not owners. You leave code better than you\nfound it, and you fix bugs without grumbling about whose they are.  You are a\nteam player who enjoys discussing ideas and implementations with other\nengineers.<p>Here’s a small sampling of the things you will be working on as systems engineer on the Prismatic team:<p>- Making our crawlers and document analysis better and more comprehensive<p>- Building out new product features in our API<p>- Solving tough systems problems to help us scale reliably and robustly<p>- Building and improving Machine Learning systems for ranking, document analysis, and more<p>- Creating tools to assist development and ops<p>- Shipping some of the best open-source Clojure libraries out there, and working with the community to make them better<p>== Engineering Manager at Prismatic, San Francisco ==<p>Managers will be responsible for supporting a sizable engineering team, and applicants can expect to be working on the following problems:<p>- Writing and reviewing code in Clojure, Objective C and Android. You should have great technical depth and a passion for great code.<p>- Helping to manage the development roadmap for large portions of the product, and working with engineers, tech leads, designers and product managers to efficiently prioritize and execute.<p>- Recruiting top candidates for both generalist and specialized engineering roles<p>- Evangelizing our technical brand through external communication, press and speaking at events<p>- Understanding the growth needs of each person you manage, and helping them continually expand scope and impact within the team.<p>== Relevance Engineering at Prismatic, San Francisco ==<p>Here’s a small sampling of the things you will be working on as a relevance engineer on the Prismatic team:<p>- Feature engineering for improving the quality of news feeds through iterative experiments<p>- Building and optimizing recommendations for topics for users to follow<p>- Extending and improving the set of topics available to users<p>- Systems for quickly training, deploying and testing machine learning models in production<p>- Creating tools to evaluate the performance of existing machine learning systems","time":1412193011,"type":"comment"}