{"by":"ashleyjohn","id":8397216,"parent":8394339,"text":"Academia.edu (Downtown San Francisco)<p>Full Time Openings:<p>* Full Stack Engineers<p>* Sr. Front End Developer<p>* Data Engineer<p>* Designers<p>Company:<p>* Our mission is to build a new system for scientists to share their results and broadcast their work<p>* We have over 13 million users and they are extremely important to us!<p>* Our investors include Khosla Ventures, Spark Capital and True Ventures<p>Team:<p>* We move quickly, everyone is in charge of their own projects but also very collaborative<p>* We get catered lunches from zerocater and lunch usually ends with a round of foosball<p>* We&#x27;re a diverse group with backgrounds in philosophy, biology, music and art<p>Technical:<p>* Peer Review: We are revisiting peer review with a novel product built from the ground up that will allow layers of discussion on top of a single document and we are building this using Rails and Backbone.js<p>* Recommendation Engine: Lots of machine learning to parse science papers and figure out what people want to read. Pretty cool stuff<p>* Servers, Speed, Security and Storage (Postgres &#x2F; Dynamo &#x2F; Elasticsearch &#x2F; Redis): Speed and stability are really important to us because areas in the world with slower internet connections tend to be where researchers can benefit the most from open access to research<p>About you:<p>- You want to have a huge impact on a product that is making a positive impact on the world<p>- You have a curious mind and enjoy tackling hard technical problems<p>- You work best when given a lot of autonomy<p>- You enjoy board games, foosball, rock climbing, sailing, roundtable discussions and&#x2F;or free lunches<p>Please contact ashley@academia.edu if you would like to apply or if you have any questions.<p>We are also hosting a meetup this Friday, October 3rd.  If you would like to join, please rsvp at <a href=\"http://www.meetup.com/academia/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.meetup.com&#x2F;academia&#x2F;</a>","time":1412192892,"type":"comment"}