{"by":"RiskIO","id":8397463,"parent":8394339,"text":"[Chicago, IL] Sr. Designer - Risk I&#x2F;O<p>If you like clean and dynamic digital designs and thrive in a fast paced startup environment, then we would love to meet you.<p>Risk I&#x2F;O is a venture-backed startup in Chicago, and we are looking for a Sr. Designer to join our team. This position will entail living and breathing the digital design of Risk I&#x2F;O, including developing and refining visual elements and creative concepts for both web and print deliverables. Our Sr. Designer will work closely with the marketing and engineering teams to create end-to-end mockups and visual designs.<p>RESPONSIBILITIES:<p>1. End-to-end design ownership from creating a vision to design development and implementation\n2. Develop creative working documents and finalize design layout pieces\n3. Ensure that all designs clearly communicate the identity of the Risk I&#x2F;O brand\n4. Mock-up pixel perfect user interface and digital designs\n5. Support web-based design projects with user research and usability testing\n6. Work across every team including engineering, marketing, etc. to ensure designs meet expectations, objectives and specifications determined by the specific team<p>QUALIFICATIONS:<p>1. Expert in Photoshop, Illustrator as well as HTML, CSS3 and JS\n2. Proficient in illustration, typography\n3. Expert knowledge in strategy, identity, and branding as they relate to design\n4. Broad understanding of strategic marketing, traditional media and the digital marketing landscape\n5. Ability to design within an existing visual style\n6. Working knowledge of wireframes, mockups and simple, logical design\n7. Ability to design high-level conceptual models for product solutions\n8. Ability to justify and defend your design recommendations\n9. Sense of humor<p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex or national origin.<p>Interested in joining us? Please send your CV and a link to your Dribbble portfolio or anything else you feel is relevant to jobs@risk.io.","time":1412195021,"type":"comment"}