{"by":"tommccabe","id":8398954,"parent":8394339,"text":"DVF - New York, NY - <a href=\"http://www.dvf.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dvf.com</a><p>Are you a front-end developer? Interested in fashion? Interested in e-commerce?<p>DVF is a luxury fashion brand based in NYC. We&#x27;re looking for a front end developer who can craft great shopping experiences.<p>ROLE AND RESPONSIBILITIES:<p>* Develop and modify websites and email campaigns.<p>* Optimize front-end architecture, for site performance and maximum e-commerce conversion, across multiple platforms (web, mobile, &amp; tablet).<p>* Research and utilize emerging front-end technology in order to achieve e-commerce objectives.<p>* Daily QA of e-commerce storefront to prevent and address critical interruptions in the customer shopping experience.<p>* Provide technical assistance to multiple teams to ensure timely execution of merchandise and content updates of the e-commerce storefront.<p>* Monitor analytics to identify areas of improvement; provide technical recommendations that will drive e-commerce sales and increase brand visibility.<p>REQUIREMENTS:<p>* 3-5 years experience working in a collaborative environment.<p>* Demonstrated experience writing cross browser, standards compliant HTML, CSS, &amp; Javascript for multiple platforms (web, mobile, tablet &amp; email).<p>* Experience developing on enterprise e-commerce platforms (e.g. ATG, Demandware, GSI).<p>* Basic understanding of Adobe Photoshop and Illustrator for web production.<p>* Experience using code versioning tools (e.g. Subversion, Git) and bug tracking applications (e.g. Bugzilla, Jira)<p>* Familiarity integrating third party APIs (e.g. Google Merchant Center, Facebook, Twitter)<p>* Familiarity with XML for data manipulation and import&#x2F;export processes\n* Familiarity with analytics systems (e.g. Omniture, Coremetrics, Google Analytics)<p>* Strong documentation skills.<p>* Proven ability to build strong relationships with cross-functional business partners.<p>* Analytic strength and strong problem solving skills.<p>If you are interested, please reach out to me - t.sullivan@dvf.com","time":1412213103,"type":"comment"}