{"by":"vonnik","id":8398983,"kids":[8435862],"parent":8394339,"text":"FutureAdvisor - San Francisco, CA<p>FutureAdvisor is an online investment manager that graduated from YCombinator in 2010. We&#x27;re backed by Sequoia and Canvas Venture, and we&#x27;re tackling an important problem: helping people save enough to actually retire. We&#x27;ve grown our revenue by 18x in the last year, and raised our $15.5 million Series B in May.<p>We have more than 150,000 users depending on us for advice and investment management to preserve and grow their life savings, and we&#x27;ve made a crucial service available to the middle and working class for the first time. FutureAdvisor is at that sweet spot where most of the risk is behind us, and most of the upside is ahead.<p>We have about 40 employees and we&#x27;re based in the Financial District. We&#x27;re looking for an infrastructure engineer (DevOps&#x2F;PostOps), a senior engineer with lead potential, and an engineering intern. Our Web app is based on a Rails stack, using Coffeescript to transpile to Javascript on the frontend, where we use an EmberJS framework.<p><a href=\"https://medium.com/terms-conditions/if-you-think-the-job-hunt-sucks-try-recruiting-677921d7f897\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;terms-conditions&#x2F;if-you-think-the-job-hun...</a><p>We&#x27;re also looking for two product managers. We need people with experience launching and improving a web&#x2F;mobile-based consumer software product. They should be metrics driven and very thoughtful about how features affect users, and how they can be tested.<p>Finally, we need an interactive designer who can show us their UI&#x2F;UX work. Someone both practical and empathetic who cares about solving a real, high-stakes problem.<p><a href=\"https://medium.com/job-portraits/futureadvisor-is-hiring-a-lead-designer-to-create-a-visual-language-of-investing-a1b1a78cd79d\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;job-portraits&#x2F;futureadvisor-is-hiring-a-l...</a><p>In our experience, four things make team members want to stay with a company: sane, caring management; a product with a mission; work-life balance; and competitive compensation. We offer all those, and we&#x27;re a nice place to work. :)<p>Our job descriptions: <a href=\"https://www.futureadvisor.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.futureadvisor.com&#x2F;jobs</a><p>Any one interested can write me: chris.nicholson@futureadvisor.com","time":1412213622,"type":"comment"}