{"by":"baspland","id":8398381,"kids":[8398386],"parent":8394339,"text":"Full Stack Web Developer: Tools&#x2F;Localization&#x2F;Custom-Support Teams - Mountain View, CA Are you passionate about helping those around you become more effective?\nWhatsApp is the world’s largest and fastest growing communication company with over 600M Monthly active users globally. A Top 25 iOS app in more than 100 countries and an Android app with more than 500M installs on Google Play! Using your startup mindset and your experience developing native mobile apps, you will create new, awesome features used by 600+ Million current WhatsApp users. We are looking for Full Stack Web Developer-Internal Tools<p>Responsibilities: -Design, develop, maintain internal web front-ends, database systems and APIs -Passionate about helping those around you become more effective<p>Requirements: -Bachelor’s Degree in Computer Science and&#x2F;or a fantastic github profile -HTTP fluency -CSS and JavaScript skills -Familiarity with one web framework and has completed projects using it -Familiarity with one database and has completed projects using it -Strong knowledge of Unix<p>About WhatsApp<p>WhatsApp Messenger is a cross-platform mobile messaging app that allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows Phone, and Nokia smartphones. In addition to basic messaging, WhatsApp Messenger users can send each other unlimited pictures, videos, and audio messages, as well as participate in groups. WhatsApp Inc. was founded in 2009 by two ex-Yahoo! engineers. We are profitable, funded, and offer very competitive compensation packages. We are located in downtown Mountain View.<p>Please follow this link to our posting via jobvite: <a href=\"https://hire.jobvite.com/j?cj=o8KEZfwf&amp;s=Full_Stack_Web_Developer_-_Tools/Localization\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?cj=o8KEZfwf&amp;s=Full_Stack_Web_Deve...</a> or email jobs(at)whatsapp.com","time":1412204671,"type":"comment"}