{"by":"maramaemartin","id":8402953,"parent":8394339,"text":"San Francisco, CA - Full-Time MongoDB Database Administrator needed for MongoLab <a href=\"https://mongolab.com/welcome/\" rel=\"nofollow\">https:&#x2F;&#x2F;mongolab.com&#x2F;welcome&#x2F;</a><p>MongoLab is a fully-managed cloud database service featuring highly-available MongoDB databases, automated backups, web-based tools, 24&#x2F;7 monitoring, and expert support. Developers absolutely love us because our Database-as-a-Service (DBaaS) allows them to focus their attention on product development instead of operations.<p>We are looking for a DBA to help us manage our vast fleet of MongoDB deployments, and to help make our customers the happiest and most productive MongoDB developers on the planet.<p>You&#x27;ll work on awesome things including: * Managing and monitoring a fleet of hundreds and thousands of databases \n* Managing large multi-terabyte sharded MongoDB clusters * Prototyping MongoLab on new cloud providers * Helping customers with difficult performance and data modeling problems * Writing about MongoDB deployment best practices (in docs and our blog)<p>Our ideal candidate: \n* Has 3+ years of professional experience as a SQL DBA or a MongoDB DBA. (We&#x27;d be thrilled to see MongoDB experience but it&#x27;s totally not required).\n* Has some experience with MySQL or PostgreSQL, or familiarity with MongoDB \n* Has some experience with Linux or UNIX. \n* Has experience with troubleshooting and being on call. Like many roles in our engineering team, this position includes being on call for approximately two 24-hour periods a week<p>Here&#x27;s what we can offer you: \n* Competitive salary, equity, and health benefits \n* Tons of leadership opportunities as you grow with our company \n* An environment that gives you the flexibility to seize moments of inspiration<p>How to apply:\n* The Sourcery will be the first point of contact.\n* All applications receive a response.\n* All applications are kept strictly confidential.\n* To apply, <a href=\"http://www.thesourcery.com/jobs/817/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;817&#x2F;applications&#x2F;new</a>","time":1412282213,"type":"comment"}