{"by":"maramaemartin","id":8406903,"parent":8394339,"text":"San Francisco, CA - Full-Time Senior Software Engineer needed for MongoLab <a href=\"https://mongolab.com/welcome/\" rel=\"nofollow\">https:&#x2F;&#x2F;mongolab.com&#x2F;welcome&#x2F;</a><p>MongoLab is a fully-managed cloud database service featuring highly-available MongoDB databases, automated backups, web-based tools, 24&#x2F;7 monitoring, and expert support. Developers absolutely love us because our Database-as-a-Service (DBaaS) allows them to focus their attention on product development instead of operations.<p>We are looking for a Senior Software Engineer who will join us in scaling MongoLab from managing well over 100,000 databases to managing millions of databases at ever-increasing levels of complexity. As our newest team member you&#x27;ll work with every major cloud provider and infrastructure technology. We currently run on Amazon, Google Cloud Platform, Joyent, Rackspace, and Microsoft Azure and have integrated with all of the major Platform-as-a-Service providers including Heroku.<p>Here are some challenges you&#x27;ll help us solve: \n* You&#x27;ll create and scale Node.js and Python tools and services for automating the entire lifecycle of database servers and clusters \n* You&#x27;ll architect, develop and scale essential tools for MongoDB, including our backup engine and large-scale monitoring systems \n* You&#x27;ll build APIs for integrating with users and partner providers across the __-as-a-service spectrum<p>Our ideal candidate: \n* Has 3+ years of professional software engineering experience and a degree in Computer Science or a related STEM field.\n* Has some professional development experience with Python, Node.js or Ruby \n* Has some experience with MongoDB, MySQL or PostgreSQL \n* Has strong verbal and written communication skills<p>What we can offer you: \n* Competitive salary, equity, health benefits, and 401K \n* Tons of leadership opportunities as you grow with our company \n* Attend hackathons, events, and anything else that will contribute to our community<p>How to apply:\n* The Sourcery will be the first point of contact.\n* All applications receive a response.\n* All applications are kept strictly confidential.\n* To apply, please visit: <a href=\"http://www.thesourcery.com/jobs/816/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;816&#x2F;applications&#x2F;new</a>","time":1412361418,"type":"comment"}