{"by":"maramaemartin","id":8407228,"parent":8394339,"text":"San Francisco, CA - Full-Time Senior Platform Engineer wanted for Liftopia (www.liftopia.com)<p>Liftopia is building tools that are igniting a revolution in the ski industry. We are bringing innovative products to market that benefit both alpine resorts and those who love snow and the outdoors. Liftopia&#x27;s ecommerce, yield management and business intelligence technology tools allow resorts to manage and execute robust pricing strategies around their tickets, lessons, rentals and other recreational products. Our tools and services help resorts grow their revenue through business intelligence based on pricing strategy analysis &amp; advance purchase booking data. As a result consumers can enjoy their favorite activities more frequently and at affordable prices.<p>The Role:\nLiftopia is seeking a Senior Platform Engineer to join the development team at Liftopia. We&#x27;re looking for someone who&#x27;s passionate about building robust &amp; scalable technology platforms, systems, and APIs. You&#x27;ll be an integral part of the engineering team and will work closely with folks throughout our company to deliver the best possible product to our customers. Ideal candidates will have deep experience with Ruby, API development, and Service-Oriented Architecture.<p>Things You Will Work On:\n* Transaction processing services to process revenue in the millions of dollars per day \n* Search services to query tens of millions of items \n* An API platform that will be consumed internally and directly by 3rd parties \n* Tooling to help other developers work more effectively \n* Designing, developing, and maintaining a robust transactional API platform \n* Improving our existing ecommerce platform codebase \n* Writing and maintaining complex SQL queries in codebase \n* Championing and collaborating with the team to establish and improve upon procedures and processes in a Continuous Delivery environment<p>Our Ideal Candidate Has:\n* Deep expertise working with Ruby and Ruby on Rails \n* Experience building high volume API platforms \n* Experience with high-end, high traffic web applications \n* Solid understanding of SQL and ability to write&#x2F;maintain complex queries \n* Exposure and experience with Service-Oriented Architecture<p>Competitive salary and unique benefits\n* Stock options \n* Comprehensive benefits program \n* Bonus potential \n* Flexible Schedule and Discretionary Time Off \n* Fun, outdoor activity focused culture \n* Casual office<p>How To Apply:\n* The Sourcery will be the first point of contact.\n* All applications receive a response.\n* All applications are kept strictly confidential.\n* To apply, please visit: <a href=\"http://www.thesourcery.com/jobs/801/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;801&#x2F;applications&#x2F;new</a>","time":1412364921,"type":"comment"}