{"by":"Diogenes-Dog","id":8433655,"parent":8394339,"text":"Aeon Media - San Francisco, USA. Melbourne, Australia.<p>Job Title: CTO<p>This is an opportunity for an experienced developer to help lead one of the world’s most innovative media startups through the next major stage of its evolution.<p>In the two years since launch, Aeon Media has established an international reputation for high quality digital publishing and big ideas in Aeon Magazine. Now we are taking a major step forward, actively developing an entirely new platform: a hub for expert conversation around the big defining questions of our age. Aeon Ideas is currently in private beta and due for launch early 2015.<p>We are looking for a dynamic, creative CTO to drive the development of Aeon Ideas and to direct Aeon’s overall digital strategy. Aeon has offices in London, San Francisco and Melbourne. This role will be based either in San Francisco or Melbourne.<p>--------<p>Responsibilities:<p>* direct our current tech team located in London, who are contracted to continue developing Aeon Ideas from prototype towards launch<p>* recruit and manage a new in-house tech team\nhands-on development of features for the new site and our existing sites<p>* work with the directors to devise and implement a long-term plan for Aeon’s digital strategy and development<p>*liaise with editors on content and designers and developers on UX&#x2F;UI challenges across our sites<p>---------<p>You will have a minimum of 4 years commercial development experience, including a demonstrated engagement with innovations in digital publishing and social networking. You will be excited by the potential of new collaborative digital tools to help people connect and create the best content on the web. You will be intrigued by the success of Wikipedia, Reddit, Quora and Medium, and you will be prepared to challenge the digital landscape with a whole new approach to collaborative knowledge-making.<p>A competitive salary will be offered along with opportunities for international travel and an incentive&#x2F;equity scheme to participate in the growth of Aeon.<p><a href=\"http://aeon.co/magazine/fast-growing-digital-media-start-up-seeks-cto/\" rel=\"nofollow\">http:&#x2F;&#x2F;aeon.co&#x2F;magazine&#x2F;fast-growing-digital-media-start-up-...</a><p>------<p>TO APPLY: Please email jobs@aeonmagazine.com with a cover letter and resume.","time":1412874479,"type":"comment"}