{"by":"pzearfoss","id":8457049,"parent":8394339,"text":"Tysons Corner, VA (Remote Possible)<p>CircleBack is looking to add an experienced iOS engineer to our team in Tysons Corner in Northern Virginia, near DC.<p>Contact management is a problem for both individuals and enterprises.  CircleBack is working to solve those problems.  Our business app, CircleBack helps professionals discover the possibilities in their network. They can get access to a living and breathing address book that maintains their contact business information always up to date.  We&#x27;re looking for another iOS Engineer to join our team to work on our apps.<p>Technical Experience:<p>- You’re the kind of engineer who likes to have a hand in all facets of the app development process.<p>- You care about the user’s experience from end to end. You like clean, elegant, well tested code.<p>- You read about iOS development. You follow the right people on Twitter. You know where the iOS development landscape is headed and you’re prepared to work with a team that’s headed that direction too.<p>- You’ve got 3 years experience, an app or two in the store, and GitHub account.<p>- You have a very strong knowledge of Objective-C and CocoaTouch, UIKit, CoreData, KVO, Foundation. You’ve imported runtime.h more than a few times.<p>- You work proficiently in Xcode, AppCode, or both.<p>- You’ve used CocoaPods before, and you’ve probably have one or two of your own.<p>- You like unit tests, and you like them better with Kiwi or Specta.<p>- You’ve dabbled (or better) in Swift.<p>- You’re a fan of storyboards and auto-layout. You never feel constrained by constraints.<p>- You understand MVC, but you think MVVM is better. You might even think functional reactive programming is the future.<p>- You get git.<p>- You’ve probably filed a radar or two.<p>- You&#x27;re also a great communicator verbally and in writing.  You&#x27;re an advocate for the user experience and you&#x27;ve got an eye for detail.<p>Please contact us directly at recruiting@circleback.com.  You can also apply to our indeed.com posting: <a href=\"http://www.indeed.com/job/ios-developer-b0a2bc8856648910\" rel=\"nofollow\">http:&#x2F;&#x2F;www.indeed.com&#x2F;job&#x2F;ios-developer-b0a2bc8856648910</a>","time":1413343875,"type":"comment"}