{"by":"jacobwg","id":18589727,"kids":[18590323,18590527],"parent":18589702,"text":"THORN | Data Engineer | Full-stack Engineer | Full-stack Engineer with + UI&#x2F;UX  | REMOTE (US based) | FULL-TIME | $100k - $150k + Amazing benefits <a href=\"https:&#x2F;&#x2F;www.wearethorn.org\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wearethorn.org</a><p>Thorn is a non-profit that builds technology to defend children from sexual abuse. Thorn gives you the opportunity to apply your expertise and passion for building to directly impact the lives of vulnerable and abused children. Our staff solves dynamic, quickly evolving problems with our network of partners from tech companies, NGOs, and law enforcement agencies. If you are able to bring clarity to complexity and lightness to heavy problems, you could be a great fit for our team.<p>We are hiring for:<p>Data Engineer: Building a system from beginning to end that assists law enforcement in identifying the most vulnerable victims. This role spans areas including adaptive crawling, search, data engineering, data pipeline development, and devops. Apply today! <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;c3cb5f132\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;c3cb5f132</a><p>Full-Stack Engineer: You will work on building an application from beginning to end that assists law enforcement in identifying the most vulnerable victims. The work spans engineering topics from single-page web application development to API endpoint creation. Apply today! <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;f50cce292\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;f50cce292</a><p>Full-stack Engineer with UI &amp; UX design experience: You will build products used by our industry partners to help make their platforms safer and prevent the spread of child abuse material on the internet. You will split your time between product design and full-stack development, creating UI wireframes and designs and building single-page web applications and APIs, Apply today! <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;5446d4772\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;5446d4772</a><p>Tech stack: React &#x2F; Redux &#x2F; TypeScript &#x2F; Express &#x2F; GraphQL &#x2F; Python &#x2F; PostgreSQL &#x2F; Elasticsearch &#x2F; Spark &#x2F; Kafka &#x2F; Docker &#x2F; Terraform &#x2F; Kubernetes &#x2F; AWS<p>Fully funded healthcare + unlimited vacation + remote first culture + flexible working + 401(k) + wellness","time":1543852901,"type":"comment"}