{"by":"hendiatris","id":18590099,"parent":18589702,"text":"Global Parametrics | Spatial Database Architect | Lexington, KY or Savannah, GA &#x2F; Remote | Full-time | globalparametrics.com<p>I work for this company and we need someone who is motivated by working on difficult scientific and computing infrastructure problems. To work for Global Parametrics is a chance to work on helping low and middle income countries become more resilient to natural disasters. Many companies talk about how they are improving people&#x27;s lives – here&#x27;s a chance to actually do it.<p>Here is the job post:<p>We are seeking a database architect for maintaining a large and growing repository of geophysical scientific data (50TB). The bulk of the data consists of<p>* Global Climate Data<p>* Numerical weather forecasting models (GCMs)<p>* Seismic and Earthquake events<p>* Hurricane storm tracks<p>This data must be updated daily and organized for consumption by scientists through consistent data access layers and APIs. Experience with large scientific datasets is preferred, and suggest that you highlight this experience compared to large transactional databases.<p>Specific Responsibilities:<p>* Responsibility for creating an optimized database architecture for efficient delivery<p>* Maintaining and updating the database with new data sets<p>* Refine and automate regular data harvesting processes<p>* Refine DB queries and indexes to speed performance<p>* Expertise in SQL and NoSQL environments<p>Environment:<p>The candidate will work largely independently, but also collaboratively with other code developers in an agile development framework. Results are prioritized over process. This senior position will report directly the to the chief technical officer.<p>Global Parametrics (GP) offers innovative resilience solutions in emerging economies impacted by natural disasters. GP is a for-profit social venture, with government backing from the UK and Germany.<p>Email careers@globalparametrics.com with your CV, a brief explanation of who you are, and a summary of your relevant technical experience to apply.","time":1543855061,"type":"comment"}