{"by":"joshmaker","id":18593190,"kids":[18598602,18598608],"parent":18589702,"text":"The Atlantic | NYC or Washington DC | Onsite | <a href=\"https:&#x2F;&#x2F;www.theatlantic.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theatlantic.com&#x2F;</a><p>The Atlantic is a digital-first media company with over 160 years of history and 36 million readers a month. Founded in 1857 and today one of the fastest-growing media platforms in the industry, The Atlantic has throughout its history championed the power of big ideas and continues to shape global debate through our two websites: TheAtlantic.com and CityLab.com.<p><i>Front End Lead</i> | \n<a href=\"https:&#x2F;&#x2F;atlanticmedia.theresumator.com&#x2F;apply&#x2F;b6ZvfSoePV\" rel=\"nofollow\">https:&#x2F;&#x2F;atlanticmedia.theresumator.com&#x2F;apply&#x2F;b6ZvfSoePV</a><p>You are an experienced developer with proven leadership and management experience well versed in the modern front-end, and can mentor junior members of the team on the latest best practices concerning ES6, SCSS, and performance.<p><i>Senior Front End Developer</i> | \n<a href=\"https:&#x2F;&#x2F;atlanticmedia.theresumator.com&#x2F;apply&#x2F;EfTMcPw1rG\" rel=\"nofollow\">https:&#x2F;&#x2F;atlanticmedia.theresumator.com&#x2F;apply&#x2F;EfTMcPw1rG</a><p>You are an experienced developer and solid communicator with an interest in journalism and the media business. Above all, you’re a creative problem solver: able to devise and deliver practical, maintainable software that addresses Atlantic staffers’ and readers’ needs.<p><i>Python Web Developer</i> | \n<a href=\"https:&#x2F;&#x2F;atlanticmedia.theresumator.com&#x2F;apply&#x2F;wg6KVKTXIB\" rel=\"nofollow\">https:&#x2F;&#x2F;atlanticmedia.theresumator.com&#x2F;apply&#x2F;wg6KVKTXIB</a><p>You are Python developer with a passion for clean code and great journalism, excited about working with our product team to implement and deploy new features to TheAtlantic.com and CityLab.com where they will be viewed by millions of people","time":1543872160,"type":"comment"}