{"by":"justacodefan","id":18594842,"parent":18589702,"text":"Betterment | <a href=\"https:&#x2F;&#x2F;betterment.com\" rel=\"nofollow\">https:&#x2F;&#x2F;betterment.com</a> | New York, NY | Onsite or REMOTE (certain roles)<p>We built the new way of managing money will forever put customers first.\nIn 2010, we set out to build an institution. A place that helped our customers pursue happiness, efficiently, and an environment where our team would look back and feel that they were enabled and encouraged to do the best work of their lives.<p>We set out to become the first and leading independent online financial advisor because we believed financial services could be better—that people deserved better. It&#x27;s a belief that&#x27;s shaped how we work, what we build, and our undying mission: to empower people to do what&#x27;s best for their money, so they can live better.<p>We&#x27;re a fiduciary, which means we act in your best interests. We&#x27;re not incentivized to recommend certain funds, and we don&#x27;t have our own investment products to sell. That means we&#x27;ll do what we believe is right for you, always.<p>Recommended reading to have a good understanding of us as a company, what we do, how and what we value: <a href=\"https:&#x2F;&#x2F;www.betterment.com&#x2F;TheBettermentWay\" rel=\"nofollow\">https:&#x2F;&#x2F;www.betterment.com&#x2F;TheBettermentWay</a><p>============================<p>Recruiting for various roles:<p>- Site Reliability Engineering Manager<p>- Full Stack Software Engineer<p>- Software Engineer - Backend<p>- Lead Information Security Software Engineer<p>============================<p>We use Ruby on Rails, Java 8, Scala, Python, Golang.<p>Please reach out to me directly at andre@betterment.com or apply directly at <a href=\"https:&#x2F;&#x2F;betterment.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;betterment.com&#x2F;careers&#x2F;</a> (please mention HN Dec 2018).<p>Happy to answer any questions via email.","time":1543885104,"type":"comment"}