{"by":"baflatfair","id":18593694,"parent":18589702,"text":"flatfair | Software Engineer | London, Uk | Full-Time | On-Site Remote<p>flatfair is the UK’s fastest growing deposit alternative. Our mission is to make renting more affordable and accessible We’re a young, innovative startup that’s partnered with the UK&#x27;s largest independent letting agency,<p>Day to day, you will be working on our core product: a dashboard used by tenants, landlords and agents to manage their tenancies. Our project started as a django monolith. Initially we build all our views in pure HTML, CSS &amp; JavaScript. Since then we’ve introduced Vue.js. We define our infrastructure using terraform and deploy to AWS, store data in postgres, use circleci for CI. Apart from our core app we&#x27;re deploying services writen in node.js using AWS Lambda  On a usual day you can expect to:<p><pre><code>    Work in a small team of developers and designers to build our core platform\n\n    Write HTML, CSS and JavaScript\n    Contribute to our django backend \n    Create new services written in node.js\n\n    Collaborate with the team and help to decide how to improve our product\n\n    Think how to improve the way we work, iterate on the process and tools to make sure we take advantage of best practices and technology\n\n    Take ownership of your project by designing, building, maintaining and iterating new features and new products.\n</code></pre>\nQualifications<p><pre><code>    1+ years experience working in a full-stack role\n\n    Strong knowledge of Javascript, HTML and CSS\n\n    Interest in learning about backend and&#x2F;or devops\n\n    Knowledge of unit and functional testing\n</code></pre>\nWe love open source, we want to give back to the community so in addition to your standard holiday allowance you can take extra days of to contribute to your favourite open source projects.<p>email us at careers@flatfair.co.uk or apply on <a href=\"https:&#x2F;&#x2F;flatfair.co.uk&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;flatfair.co.uk&#x2F;careers</a>","time":1543875233,"type":"comment"}