{"by":"joeinSFO","id":18591615,"kids":[18593003],"parent":18589702,"text":"Tally | San Francisco, CA &amp; Vancouver, BC | Salary range: $135K - $185K + equity | Onsite - Full-time | Multiple Positions | www.meettally.com&#x2F;careers<p>Tally helps people overcome credit card debt. Currently at Series B with $42MM in funding, Tally is the first automated debt manager for consumers. Tally&#x27;s vision is to automate consumers&#x27; whole financial lives, starting with America&#x27;s $1 trillion credit card debt.<p>-&gt; Engineering Manager, Mobile -<p>We’re looking for a proactive leader to manage iOS and android development. You will play an important role in defining product roadmap and feature development and you’ll partner closely with engineering leadership and product owners on strategic projects. We’re a small team (about 20 engineers total) so it’s important that our leaders are hands on and not afraid to jump in during crunch times. (<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;tally&#x2F;7f6ab557-f174-4e92-9fa5-583f84995933\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;tally&#x2F;7f6ab557-f174-4e92-9fa5-583f8499...</a>)<p>-&gt; iOS Engineer -<p>You’ll have broad ownership: strategically driving building processes, tooling, and technical architecture. We’re a mostly Objective-C code base but moving to swift and are excited to integrate the latest frameworks. (<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;tally&#x2F;f0a28b54-9a7d-4876-952e-6eb7c947ea01\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;tally&#x2F;f0a28b54-9a7d-4876-952e-6eb7c947...</a>)<p>-&gt; System Operations Engineer -<p>Tally’s System Operations team uses an infrastructure-as-code approach to scale &amp; manage our various environments. Core Technologies: Scala, ElasticSearch, Postgres, Redis, Puppet, Terraform, Datadog in addition to various AWS services such as EC2, RDS, EMR, ECS, Redshift etc.(<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;tally&#x2F;961de8b9-7ccc-4e1b-8603-5b3d5b94c409\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;tally&#x2F;961de8b9-7ccc-4e1b-8603-5b3d5b94...</a>)<p>Apply directly to our Head of People: joe@meettally.com","time":1543862747,"type":"comment"}