{"by":"bkudria","id":18591792,"parent":18589702,"text":"RaiseMe | Principal, Senior, Full-stack engineers | San Francisco, CA | ONSITE, Full-time<p>RaiseMe is expanding access to higher education by reinventing how students earn scholarship dollars from colleges. Our platform allows colleges and universities to award incremental &quot;micro-scholarships&quot; to high school and community college students, based on academic, testing, extracurricular, and real-world experience. We&#x27;ve over 250 college partners, and users in 1 of 2 high schools in the US. Many of our students earn tens-of-thousands of dollars for college. The coolest part of our platform is how it educates students about the possibility of college in the first place. Many of our users are first-generation college attendees, or minority or low-income students.<p>We closed our Series B earlier in the year, bringing our total funding to around $30M. Our investors include Salesforce Ventures, Chan-Zuckerberg Initiative, Teamworthy Ventures, and First Round, among others.<p>Here&#x27;s some awesome press coverage about us:\n - <a href=\"https:&#x2F;&#x2F;impact.vice.com&#x2F;en_us&#x2F;article&#x2F;ne3yvm&#x2F;students-earned-dollar1-billion-in-college-scholarships-using-their-smartphones\" rel=\"nofollow\">https:&#x2F;&#x2F;impact.vice.com&#x2F;en_us&#x2F;article&#x2F;ne3yvm&#x2F;students-earned...</a>\n - <a href=\"https:&#x2F;&#x2F;www.fastcompany.com&#x2F;90206816&#x2F;exclusive-zuckerberg-backed-micro-scholarship-startup-raises-15-million\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastcompany.com&#x2F;90206816&#x2F;exclusive-zuckerberg-ba...</a>\n - <a href=\"https:&#x2F;&#x2F;www.edsurge.com&#x2F;news&#x2F;2018-07-26-raiseme-gets-15m-to-help-students-cut-college-costs-if-they-do-well-in-school\" rel=\"nofollow\">https:&#x2F;&#x2F;www.edsurge.com&#x2F;news&#x2F;2018-07-26-raiseme-gets-15m-to-...</a><p>If you&#x27;re an engineer looking to work with other smart and passionate individuals on the mission of helping all high school students achieve their college ambitions, get in touch! We are a small company still, with a 12-person engineering team. We offer competitive pay, great benefits (including a dog-friendly office!), and meaningful equity stake.<p>Tech stack: Ruby&#x2F;Rails, React&#x2F;Redux frontend, MongoDB&#x2F;Postgres&#x2F;Redshift, with some small things in Go, Python, and Node.<p>I&#x27;m happy to answer any questions - email me at bkudria@raise.me. Our jobs listing page is here: <a href=\"https:&#x2F;&#x2F;www.raise.me&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.raise.me&#x2F;jobs</a>","time":1543863834,"type":"comment"}