{"by":"BeeswaxIO","id":18591834,"parent":18589702,"text":"Beeswax | New York, NY | Sr. Software Engineer | Full Time | ONSITE |<p>Beeswax provides Real-Time Bidding as a service. If you’re not familiar with this world, we create software that advertisers use to bid on the opportunity to show an ad when someone loads a webpage or a mobile app. This means we handle massive scale (~1 million queries&#x2F;second) and need to handle complex messages and large data sets with latencies under 20ms. On top of our technical challenges, we maintain an exhaustive list of bee-related puns and constantly keep coming up with new ones.<p>After working together for several years on the Ads team at Google our three co-founders decided to start Beeswax because they saw a change in this market. Four years later their efforts have borne fruit and their predictions validated leading us to double in both revenue and team size over the past two years with a clear plan to double again this coming year.<p>We’re a software company right down to our core with engineers from major tech companies such as Microsoft, Amazon and Facebook as well as engineers from many other excellent software cultures. Beeswax is well funded (RRE and Foundry Group amongst others) and far beyond the ramen hustle stage with benefits and a culture that encourages growth and long-term success. We are funded by leading angels from the ad tech ecosystem, in addition to Foundry Group, RRE, Highland Capital, SV Angels, and Revel Partners<p>We&#x27;re looking for both Sr. and Experienced Engineers to join our backend distributed systems teams which process more than 25 Billion events daily. We&#x27;re fairly tech agnostic in regards to prior experience, however, this role would have you working with a tech stack built in production C++ &amp; Python. Most of our team did not have this experience prior to joining Beeswax.<p>At Beeswax we stand for:\nTransparency: We pride ourselves on providing complete visibility into the successes, and sometimes failures, of our business as we grow and scale. It is an integral part of our culture as we collaborate and work towards a common goal across functions.<p>Control: Control and ownership over individual business impacting projects empowers our employees to think critically and contribute to the development of Beeswax as an industry challenging platform.<p>Flexibility: We empower our employees in a work environment that is conducive to creating the optimal work&#x2F;life balance.<p>website: <a href=\"https:&#x2F;&#x2F;www.beeswax.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.beeswax.com&#x2F;</a><p>Job Link: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;beeswax&#x2F;jobs&#x2F;683888\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;beeswax&#x2F;jobs&#x2F;683888</a>","time":1543864062,"type":"comment"}