{"by":"gbernatchez","id":18590430,"parent":18589702,"text":"Taiga Motors | Firmware Engineer | Montreal, Canada | Onsite | Fulltime | <a href=\"https:&#x2F;&#x2F;www.taigamotors.ca&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.taigamotors.ca&#x2F;</a> Taiga Motors is a Montreal, Canada based startup developing high power electric powertrains for powersports applications. We believe in pure clean exhilaration– in vehicles that outperform everything else without sacrificing the environment.\nAt Taiga, we are uniting innovative and adventurous minds to form a team that isn&#x27;t afraid to tackle the industry&#x27;s toughest problems. Our approach is simple: we start from a clean sheet and push the frontiers of technology until we end up with elegant and powerful solutions.<p>We are looking for a senior and a junior firmware engineer candidates to work with us to bring our dreams to fruition.<p>The position entails:<p>•\tWriting low-level C for various microcontrollers (Freescale, Microchip, NXP...)<p>•\tWriting C++ code for embedded Linux<p>•\tMaintaining a continuous-integration build system with Git, Python, and other tehcnologies<p>•\tDesigning and writing tests, whether it&#x27;s unit tests, board-level, or full system-level testing<p>•\tIntegrating the firmware with external tools and our backend<p>•\tStructuring higher-level vehicle diagnostics protocols using UDS&#x2F;ODX&#x2F;CAN<p>However, we&#x27;re mostly just looking for someone smart who can pick up skills on the go!<p>If you think you’re a fit for this position, or if you&#x27;re interested in learning some new technologies, don’t hesitate to reach out to us at careers@taigamotors.ca For more information and awesome pictures and video of our vehicles in action, check out our website or social media:<p><a href=\"https:&#x2F;&#x2F;www.taigamotors.ca&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.taigamotors.ca&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;taigamotors&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;taigamotors&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;www.instagram.com&#x2F;taiga.motors&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.instagram.com&#x2F;taiga.motors&#x2F;</a>","time":1543857092,"type":"comment"}