{"by":"nz_manulife","id":18591262,"parent":18589702,"text":"Manulife | Senior Software Engineer - Engineering Transformation | Kitchener, Waterloo | ONSITE<p>Manulife is a leading international financial services group that helps people achieve their dreams and aspirations by putting customers&#x27; needs first and providing the right advice and solutions through innovative technology solutions.<p>We are changing the way we develop and we want you to be part of it! We are growing our Technology, Architecture &amp; Engineering Transformation Office, with the mandate to power world-class customer and employee experiences through software and engineering skills.<p>We are seeking self-motivated engineers, who are obsessed with delivering value, are forward-thinking, and excited to see the successful implementation of the products they deliver.<p>As a Senior Software Engineer – Engineering Transformation, you will:\n• Champion the development of engineering staff within your team and other areas within Manulife.\n• Prototype and build new functionality to deliver on key product objectives with strong and extendable architectural design\n• Exposure and opportunity to collaborate with leaders across the organization, as well as other software engineers, architects, and operations engineers to uncover and showcase opportunities to deliver new business value through software<p>Last year Manulife spent over $1 billion on technology. You will be working with:\n• Languages such as Java, JavaScript, C# (.NET Core), HTML5, CSS3, React&#x2F;Relay, GraphQL, Kafka, Nifi and&#x2F;or similar technologies\n• Cloud Foundry and other components supporting a highly-automated global engineering platform\n• Open source! As we accelerate our delivery of world-class experiences, we know embracing open source technologies will help us get there. Any experience with open source is very attractive to us!<p>We offer competitive salaries with great benefits and enjoy great work-life balance!<p>To apply:  <a href=\"https:&#x2F;&#x2F;jobs.manulife.com&#x2F;ShowJob&#x2F;Id&#x2F;344669&#x2F;Senior-Software-Engineer-Engineering-Transformation\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.manulife.com&#x2F;ShowJob&#x2F;Id&#x2F;344669&#x2F;Senior-Software-...</a>","time":1543860878,"type":"comment"}