{"by":"inglor","id":18591733,"parent":18589702,"text":"Testim.io | Senior Frontend Engineer | Tel Aviv, Full-Time | On Site<p>Testim.io is a well funded startup located in Tel Aviv and San Francisco. We are the fastest growing provider of autonomous testing using machine learning solutions with hundreds of companies across 15 countries. Our platform supports engineering teams who are developing some of the most complex software that is used by millions of people everyday.<p>We are looking for a Senior Fullstack&#x2F;Frontend Developer to join a uniquely strong team!<p>As a member of the team, you will be focusing on the user interface of our web app but also implement end-to-end features which include the Node.js backend. Testim is a highly technological product, so we’re looking for tech evangelists to join us and bring the new generation of automation tool to the world!<p>WHY YOU&#x27;LL LOVE THIS JOB<p>You will be challenged to push your development skills to the limits by researching and using new technologies, APIs and frameworks.\nYou will work with cutting edge web and mobile technologies, in the highest levels.\nWork with a proven technical team to deploy your code to production daily.\nBe rewarded for your hard work with a competitive salary, stock options, benefits and all the coffee and beer you can drink.\nGet in at the ground level to help influence the culture of the company.<p>REQUIREMENTS AND SKILLS<p>4+ years of experience in developing modern web apps using a framework (Angular preferred). You’re a frontend rockstar, keep yourself constantly updated and love every minute of it.\nJavascript experience, including concept like asynchronous programming, ES6, OOP and Design Patterns.\nHTML&#x2F;CSS experience, including concepts like layout, specificity and cross browser compatibility. Pixel perfect implementations.\nAbility to write high-performance, reusable code for UI components.\n1+ years working with Backend Javascript (Node.js) and databases (MongoDB, MySQL, Redis).\nKnow how to take responsibility and a sense of ownership over the quality of the created product, even if it’s not your own code.\nA team player, highly motivated, quick learner and independent with minimal guidance and instructions.<p>Feel free to contact me about this at benji@testim.io or benjamingr@gmail.com","time":1543863452,"type":"comment"}