{"by":"TechAtCLEAR","id":18591388,"parent":18589702,"text":"CLEAR|Java Tech Lead|Austin, TX|Onsite, Full-time<p>CLEAR transforms what is uniquely you – your fingerprints, your face, your eyes – into a secure, biometric key to frictionless experiences. We are creating a world where travel is effortless, where accessing your office building is as simple as walking in, and where shopping is as easy as walking in and out of a store—without ever once showing an ID or credit card. CLEAR currently powers secure, frictionless customer experiences in nearly 40 U.S. airports and venues. With over 2 million members so far, CLEAR is the identity platform of the future, today.<p>CLEAR is looking for a Java Tech Lead to join the Technology team in Austin. In this role, you’ll be responsible for building cutting-edge applications from the ground up for Airports and Sports verticals. We’re looking for someone who is passionate about technology, stays on top of the latest trends within the field, and loves to engage with the developer community. You’ll do the best work of your career.<p>What You Will Do:\n<i>Develop a brand new microservices based platform from the ground up and develop it with reliability and observability in mind.\n</i>Work on cutting edge tech stack (Java 10, Docker, Kubernetes, Kafka streams, Node, Electron, React) \n<i>Develop applications to be released into production mid week with a zero down time based deployment model\n</i>Build a team from the ground up and lead decisions involving hiring, team fit, and culture\n<i>Drive the initiatives on architectural, design, and technical stack recommendations\n</i>Work with other Tech Leads across the organization to drive a consistent approach to software development, and architecture\n<i>Lead a vertical business aligned team of highly motivated individuals to define and deliver incremental value through milestones.\n</i>Measure measure measure: performance, throughput, sprint velocity, number of releases per sprint, mean time to value, median time to develop a story and collect loads of other metrics to make data driven decisions\n<i>Adhere to best practices for testing and designing reusable code\n</i>Write automated Unit, Integration and Acceptance tests for each service while maintaining a code coverage of &gt; 90%<p>To apply: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clear&#x2F;jobs&#x2F;1417202\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;clear&#x2F;jobs&#x2F;1417202</a>\nTo see all of our Engineering roles: <a href=\"https:&#x2F;&#x2F;www.clearme.com&#x2F;about-us&#x2F;#careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.clearme.com&#x2F;about-us&#x2F;#careers</a>","time":1543861548,"type":"comment"}