{"by":"zowen","id":18590514,"parent":18589702,"text":"Armoire | Seattle, WA | Onsite | Full-time | <a href=\"https:&#x2F;&#x2F;www.armoire.style&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.armoire.style&#x2F;</a><p>Armoire is helping women to find their style and gain confidence by giving them access to an unlimited closet of clothes. Our customers pay us a subscription fee to keep four of our items at a time, with the ability to swap items out whenever. Think Netflix by mail for clothing. In marketing speak? We’re working revolutionizing the apparel industry by enabling autonomous personal styling and fulfillment. We are well-funded our roots in MIT&#x27;s startup accelerator with substantial customer traction and revenue.<p>Our business model means that we develop a deep relationship with each of our customers, collecting hundreds of data points per month on style, fit, and more. We are already leveraging our dataset to generate 75% of clothing rentals from our machine learning powered recommendation model, but there is much more exciting work ahead of us. We are looking for full-stack engineers and a data scientist to help us take our product to the next level.<p>Our current stack is Python and Django on the backend interfacing through Django REST Framework with our frontend in Vue.js.<p>Full-Stack Engineer: Back-end &#x2F; Services Emphasis - We’re looking for an exceptional engineer who is interested in helping to design and structure the data underlying our business.  In this role, you will work on everything from systems architecture to implementing systems to improve internal operations for our teammates. In addition, you will also have the opportunity to design data-driven systems using machine learning as your interests and abilities allow.<p>Full-Stack Engineer: Frontend&#x2F;Mobile Emphasis - We are looking for a product-focused engineer who is able to collaborate with a UX designer to refine mockups and then turn them into delightful frontend experiences for our customer. In this role you will be able to participate in all phases of the development process from providing input on the proposed design through the actual implementation.<p>Data Scientist - At Armoire, we believe that every single employee directly impacts our members. As our Data Scientist focusing on Inventory Procurement and Allocation, you will be making sure we have the right product at the right time. In this role, you will create, improve and run allocation strategies to help maintain healthy inventory levels and will work closely with our data science team and the Director of Merchandising.<p>UX Designer - UX, product, and the voice of our customers must come together to make this happen. So — do you get excited about making digital experiences really, really easy for customers? Are you a good listener? Do you love to choreograph the dance of getting users from A to B? Well then you get that the best UX isn’t even noticed by a user because the design gets out of their way. We’re looking for an exceptional designer who is interested in owning our end-to-end digital experience to take the Armoire service to the next level.<p>Details on all positions: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;armoire-style&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;armoire-style&#x2F;jobs</a>","time":1543857445,"type":"comment"}