{"by":"tslmy","id":18594591,"parent":18589702,"text":"Wharton Research Data Services (University of Pennsylvania) | Data Scientist | Philadelphia, PA | ONSITE | VISA<p>We are looking for a full-time Data Scientist to join us at Wharton Research Data Services (WRDS), a Wharton department that provides business intelligence, data analytics, and research support to academic institutions around the world.<p>## Technical Details<p>·  Programming languages: Python! You will make use of the `pandas` module extensively in daily work. Knowing how to parallelize your computation is a bonus (we work on a 40-core server). It would help to explain your work to your fellow colleagues if you know SAS, but it is not a required skill.<p>·  Machine learning: &quot;Shallow&quot; learning techniques (such as SVM classifiers with `scikit-learn`) would help a lot, while neural network packages (such as Tensorflow&#x2F;Keras) would be an overkill.<p>·  Environment: All our R&amp;Ds are performed on a Linux server. You need to be comfortable with terminal access, Linux commands, SSH tunneling, and package management with `conda`. Our filesystem is NFS, so knowledge of optimizing IO for cache utilization would be great.<p>·  Delivery: You need to be good at clearly summarizing your work by writing reports and documentations. By &quot;clear&quot;, we mean &quot;easily understandable by financial analysts who have little CS background&quot;. In terms of format, Word is good, but LaTeX or Markdown would be a delight. You will also need to pack your derived datasets and&#x2F;or codes in a portable way, so that our data team can add them to our client-facing database. You can choose your own version control solution.<p>·  Computational resources available: We have Jupyter Lab deployed on our internal R&amp;D server, as well as a huge SAS cluster shared with our clients. Most of our numerical data are on PostgreSQL. Feel free to set up our own MongoDB, etc., if needed.<p>## Preferred Background Knowledge in Finance<p>We are in the School of Finance, after all. While not required, these background and experience will be preferred:<p>·  experience with business&#x2F;financial&#x2F;accounting analytics based on large datasets,<p>·  knowledge in finance,<p>·  good at foosball,<p>·  experience working with SEC data (including textual filings and numerical data), and<p>·  experience with financial databases (e.g. CUSIP, CRSP, and Compustat).<p>## Apply<p>If you are interested, please apply through Penn Human Resources at <a href=\"https:&#x2F;&#x2F;upenn.dejobs.org&#x2F;philadelphia-pa&#x2F;business-systems-analy-sr&#x2F;C1BCE37F7EAB43E1B3A667AA19084AF2&#x2F;job&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;upenn.dejobs.org&#x2F;philadelphia-pa&#x2F;business-systems-an...</a> .","time":1543882596,"type":"comment"}