{"by":"pravinc4","id":18603319,"parent":18589702,"text":"Job Location : ONSITE at Salt Lake City, UT<p>About us: \nControl4, a leading provider of personalized automation and control solutions, allows you to control virtually any device in a home or business, automatically. Founded in 2003, the company mission is to deliver an elegant and more affordable way to control and automate lighting, music, video, security, and energy in a single room or throughout the entire home. We believe life’s better when everything works together. Control4 solutions interoperate with over 12,000 third-party consumer electronics devices—and that number is rapidly growing. By partnering with the biggest brands in consumer electronics, appliances, energy, lighting and home security, Control4 leads the industry in interoperability, ensuring an ever-expanding eco-system of devices will work together in the home or business.<p>We have an exciting opportunity for Sr Audio Electrical Engineer. Please see the below job description. If you are interested please email me at pchaubey@control4.com<p><a href=\"https:&#x2F;&#x2F;control4.applicantpro.com&#x2F;jobs&#x2F;893721.html\" rel=\"nofollow\">https:&#x2F;&#x2F;control4.applicantpro.com&#x2F;jobs&#x2F;893721.html</a><p>The Senior Audio Electrical Engineer will be responsible for developing next generation Control4 Audio products as well as supporting existing product lines. He&#x2F;She will define requirements, detail specifications, develop audio hardware with system level&#x2F;holistic approach to optimize system efficiency, performance, and cost, from input to output.  Position requires teamwork with existing audio team and designing to high performance standards.<p>ITEMIZED DESCRIPTION OF DUTIES:\n•Create, control and release design documents (schematic, layout, gerber, test procedure, bill of material, etc.)\n•Tune and optimize the acoustic performance of reference designs and demo platforms\n•Perform competitive product analysis and benchmarking\n•Support product derivative initiatives that expand existing product portfolios\n•Work and collaborate with a broad cross-functional team to ensure new product designs are developed with proper attention to detail, manufacturability, supply chain consideration\n•Must be able to identify, articulate and mitigating technical risk early in the development process\n•Evaluate supplier capabilities and drive OEM&#x2F;ODM partners to meet quality, cost and feature requirements<p>MINIMUM QUALIFICATIONS:\n•Minimum Bachelor of Engineering degree in Electrical Engineering (Masters preferred)\n•10+ years&#x27; experience designing analog and digital professional and&#x2F;or consumer audio products\n•Knowledge of processor architecture, digital circuit design and various communications protocols such as I2C, UART, SPI, USB, MIPI, I2S, etc\n•Experience partnering with software teams to define and implement firmware, drivers and algorithms","time":1543955281,"type":"comment"}