{"by":"jobs_at_priori","id":18616622,"parent":18589702,"text":"Priori Data | Big Data Engineer | Berlin, Germany | ONSITE | www.prioridata.com<p>ABOUT PRIORI DATA<p>Priori Data is a Berlin-based app market intelligence company.\nWe help our partners and clients make data driven decisions around the app economy by providing download, revenue and usage estimates for every relevant app and game, as well as tools for keyword optimization (ASO).\nVarious stakeholders in the app economy rely on our products, including top developers, large brands, leading venture capital firms and consultancies.<p>OUR TECHNOLOGY<p>* BigQuery. We use BQ to store and analyse massive datasets without the need to manage   any infrastructure. It’s our data lake.\n* Kubernetes. We are currently using Google Kubernetes Engine to aid in resource intensive tasks, like generation Machine Learning predictions for our data models.\n* Apache Airflow is our data processing pipeline orchestration tool\n* Self managed Celery &amp; Sidekiq – for job&#x2F;task queue management\n* Monitoring and observability with Grafana and InfluxDB* (Several other products from Google Cloud stack, Cloud SQL, Pub&#x2F;Sub, StackDriver, Cloud Storage etc.\n* Python and Ruby as main programming languages.<p>WHAT WE’RE LOOKING FOR<p>* You will help setup and maintain large scale, reliable distributed data collection systems\n* You will closely collaborate with Data Scientists, Developers and Product teams\n* You have some knowledge about designing and implementing Distributed Systems\n* You know your way around Python or Ruby as your programming language\n* You have knowledge of Linux platforms and scripting capabilities (i.e., Bash, Ansible)\n* You have experience with cloud platforms like Google Cloud Platform&#x2F;GCP or AWS\n* Ideally have experience with Docker and container orchestration tools\n* You are able to communicate your findings clearly to both tech and non-tech audiences. (We are an English-speaking office so German is not required.)<p>Email: jobs@prioridata.com","time":1544089461,"type":"comment"}