{"by":"LRadix","id":18632662,"parent":18589702,"text":"Radix Labs | onsite (Cambridge, MA) | no remote | visa sponsor | engineering or marketing | 90-150k | equity<p>We are Radix Labs, and we build a compiler and operating system for the computer architecture expressed by a biology lab. We do this to allow biologists to disseminate their work in a runnable form to other labs. We&#x27;re currently hiring Scala engineers and marketing specialists to help us with this.<p>We&#x27;ve just cleared our Seed round, with investors like MIT&#x27;s The Engine, Y Combinator, and Firstminute capital. We&#x27;re a rapidly growing team that could use a person like you. Even if you don&#x27;t meet all of our requirements, we&#x27;re happy to talk and see if we can work together.<p>Site: Radix.bio<p>Job 1:\nScala Engineer:\nOur entire stack is in scala, from our compiler to our runtime implementation to our device drivers. We interface with sensors and lab equipment to provide abstractions that allow biologists to write their lab protocols as formal programs, constraining the acceptable environmental conditions in their protocol, which we check at compile time to provide error logs and insight into why protocols may not reproduce.<p>Job 2:\nMarketing&#x2F;Head of Sales<p>We&#x27;re looking for a salesperson with experience in selling deeply technical products that provide business value, such as a database or log parsers. Experience in Enterprise SaaS is welcome, with a keen interest in research biology and the pharmaceutical industry. This person would manage our sales process to entities such as research labs in universities, small biotech companies, large biotech companies, and big pharma. We would rely on them to interpret user needs and deliver prioritized lists of features requested by customers for our technical team to build.<p>For details:\n<a href=\"https:&#x2F;&#x2F;angel.co&#x2F;radix-labs-1&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;radix-labs-1&#x2F;jobs</a>\nOR inquire: lucas@radix.bio\nThank you.","time":1544225760,"type":"comment"}