{"by":"rsp1984","id":8980311,"kids":[8981859],"parent":8980047,"text":"At DotProduct, a mobile 3D Computer Vision company, we have two open full-time positions in engineering. Location is either in our R&amp;D headquarters located in Wiesbaden, Germany (Frankfurt am Main area) or in our office in Waltham, MA.<p><pre><code>  == 1. Senior R&amp;D Engineer in Computer Vision ==\n  == 2. Software Engineer in Mobile ==\n  \n  == About the Senior R&amp;D engineer position:</code></pre>\nWe are looking for a software engineer with a strong Computer Vision or Graphics background and experience in GPGPU or mobile development (ideally both), to join our core technology R&amp;D. We prefer candidates who are proficient both on a theoretical&#x2F;algorithmic level and in practical implementation (mostly C++ and shader languages) of Computer Vision and Graphics algorithms, and who can make contributions to our product and core technology from the start.\nCandidates should be able to present relevant work experience either through previous work (employed, freelance, PhD studies, Post-Doc etc..) or extra-curricular work &#x2F; open source contributions.<p><pre><code>  == About the Software Engineer in Mobile position:</code></pre>\nWe are looking for a strong, hands-on, detail-oriented coder with experience in mobile development (Android or iOS), to join front-end and tools development. Practical skill and programming experience are preferred over academic achievements for this role. Required language skills are Java and C++. Experience in iOS technologies (Objective-C, Swift, Metal), bash, Python, Javascript and web-development are a plus (but not required). A background in Computer Vision and Graphics is not required, however the ability and interest to learn about them is. Also, candidates should have the ability to discuss, design and implement UI.<p><pre><code>  == General information:</code></pre>\nOur technology stack is for the most part Java, C++ and GPU languages. Platforms we target are (in order of importance) Android, MacOS, Windows, Linux and iOS. We strive to make everything we do really really fast.\nOur R&amp;D team is still intimate so any new hire can have large impact on product and future developments. Both positions are local and full-time. We prefer candidates who are able to spend at least 3 full days per week together with the team in the office. Besides a well-above market rate salary and a nice work place we offer the opportunity to work with an international team of smart people on leading mobile Computer Vision technology. Significant equity is part of the compensation package.<p><pre><code>  == About DotProduct:</code></pre>\nWe are a team of seasoned entrepreneurs and Computer Vision professionals that brings real-time dense 3D capturing to mobile devices equipped with advanced camera sensors. Our current product, the DPI-7 Kit (consisting of an off the shelf NVIDIA tablet and a Primesense Carmine sensor) has been launched in August 2013 and enjoys great success with high-end 3D professionals in various industries. We are backed by Intel Capital and various angel investors. Our office locations are Houston, TX (manufacturing and order execution), Boston, MA (management, marketing, sales) and Wiesbaden, Germany (R&amp;D). Contact is jobs (at) dotproduct3d (dot) com\nwww.dotproduct3d.com","time":1422806266,"type":"comment"}