{"by":"bmj1","id":8980274,"parent":8980047,"text":"Moni (getmoni.com) - London - Visa, full time<p>:: iOS Developer :: Android Developer :: Linux&#x2F;Devops Engineer :: PHP engineers ::<p>This is a great opportunity to be a part of a growing development team in a London-based mobile start-up, and work in an environment that requires collaboration, great communication skills and flexibility.<p>At Moni we believe in latest technologies and lean approach. Our solution revolves around a distributed API backend with UX focussed mobile and web clients. We are strong believers in lean development, outside-in testing, continuous integration and delivery; we automate virtually every aspect of our day to day and are constantly looking for improvements in these areas.<p>Our diverse team, based in central London, is now 24 strong and growing, we are looking for smart &amp; ambitious people who would like to help us build something truly great. If you are engaged, critical, and always ready to propose that one idea that will make our product and systems that much better - WE WANT YOU!<p>We are well-funded. The founders were previously heads of Google Mobile and Yahoo! Mobile product teams and we&#x27;re backed by TechStars as well as a team of smart investors &amp; advisors who believe in our vision.<p>If you are up to the challenge, we’d love to hear from you. Please email Athina: athina+hn@getmoni.com and let us know why you&#x27;d like to join.<p><i>Full jobs specs</i>\nAndroid Developer: <a href=\"http://playfair-capital.workable.com/jobs/31269\" rel=\"nofollow\">http:&#x2F;&#x2F;playfair-capital.workable.com&#x2F;jobs&#x2F;31269</a> \niOS Developer: <a href=\"http://playfair-capital.workable.com/jobs/31268\" rel=\"nofollow\">http:&#x2F;&#x2F;playfair-capital.workable.com&#x2F;jobs&#x2F;31268</a>\nLinux&#x2F;Devops Engineer: <a href=\"http://playfair-capital.workable.com/jobs/27548\" rel=\"nofollow\">http:&#x2F;&#x2F;playfair-capital.workable.com&#x2F;jobs&#x2F;27548</a>","time":1422805843,"type":"comment"}