{"by":"sparkman55","id":8980849,"parent":8980047,"text":"RINSE - www.rinse.com - Design District, San Francisco, CA<p>Rinse is a technology-enabled dry cleaning and laundry delivery service. We&#x27;ve been growing our service at an exponential rate for the past year, and our customers love us! We have a number of open positions, and have hired a significant portion of our team via Hacker News.<p>FOUR positions:<p><pre><code>  1) Software Engineer\n  2) Special Operations Associate\n  3) Customer Service Specialist\n  4) Business Development Manager\n</code></pre>\nRinse is hiring Software Engineers to develop our functionality across the stack. We have hybrid mobile apps for both Android and iOS for our customers AND our drivers. We also have sophisticated web-based tools for our customer service team, internal operations staff, and vendors. Laundry is a surprisingly-complex logistical process, and so our customer-facing software is just the tip of the iceberg. We&#x27;re solving problems like the Traveling Salesman and image classification, too. Our tech stack is approximately HTML5 &#x2F; Backbone.js &#x2F; Django &#x2F; Python &#x2F; Postgres &#x2F; Heroku &#x2F; Ubuntu, but we&#x27;re a tiny tech team, so any newcomer will be able to shape architecture.<p>We&#x27;re also hiring for a &quot;Special Operations Associate&quot; which is someone who may not have unique technical ability, but who has great aptitude and a willingness to work hard to improve our business. Analytical capability and attention to detail are important skills for this person. Bonus points for someone with an Industrial Engineering or Process Engineering background. This position is great for an ambitious analytical mind looking to join a &quot;rocket ship&quot; startup. Obviously, this position presents a significant growth opportunity.<p>Rinse has excellent customer service, and we&#x27;d like to continue improving it with a Customer Service Specialist.  This individual will lead a team of customer service associates, while enjoying close support from our technology and operations teams.  The ideal candidate will have managed customer service in a consumer-focused startup environment.<p>Finally, Rinse is looking for a Business Development Manager to &quot;hustle&quot; and cement new business relationships as we grow.  If you like going out and meeting small business owners, this is your gig!<p>Any applicant who we interview will receive $25 in free Rinse credit... If you live in San Francisco, give us a try!<p>Interested? I&#x27;d be happy to answer any questions at sam (at) rinse.com.","time":1422812919,"type":"comment"}