{"by":"z1g1","id":8980617,"parent":8980047,"text":"Amazon Web Services security team is hiring.<p>Locations: Seattle WA, North Virginia, Dublin Ireland (EU), Sydney Australia<p>We&#x27;re looking for security-minded engineers at various skill levels. Our positions range from support engineers (who we expect to have a good technical depth, but not necessarily a security focus) to principal engineer (capable of running a security campaign across 100s of thousands of servers and 10s of thousands of employees.<p>[edit: linebreaks]\nKey focus areas include:<p>- Recognize, adopt, utilize and teach best practices in security engineering: secure development, cryptography, network security, security operations, systems security, policy, and incident response.<p>- Collaborate to ensure that decisions are based on the merit of the proposal, not the proposer. When none of the proposals is the obvious winner, you are still decisive, able to disagree and commit to the team’s decision<p>- Demonstrate high capacity and tolerance for extreme context switching and interruptions while remaining productive and effective<p>- Participate in efforts to promote security throughout the Company and build good working relationships within the team and with others across Amazon<p>- Partner with teams throughout the Company to develop pragmatic solutions that achieve business requirements while maintaining an acceptable level of risk<p>- Solve problems at their root, stepping back to understand the broader context<p>- Maintain an understanding of the Internet threat environment and how it affects the company<p>- Find and fix flaws in existing company systems and sites<p>- Leverage current state of network and application security tools and how they can benefit the company<p>- Maintain knowledge and skills required to keep up with the rapidly changing threat landscape<p>- Participate in efforts that create and improve the company’s security policies<p>- Work under extended, extreme pressure, handle situations calmly and lead incident response teams effectively<p>- Proactively support knowledge sharing within the team and across the company<p>- Help recruit the very best people for Amazon through active participation in the overall recruiting process<p>- Large-scale security engineering Cloud security experience is obviously a plus, but not a firm requirement. Listings are available here: <a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?jobSearchKeywords=%22aws-security-na%22&amp;category=*&amp;location=*&amp;x=-1575&amp;y=-166\" rel=\"nofollow\">http:&#x2F;&#x2F;www.amazon.com&#x2F;gp&#x2F;jobs&#x2F;ref=j_sq_btn?jobSearchKeywords...</a> Or PM me and I can provide a professional reference.","time":1422809561,"type":"comment"}