{"by":"eli","id":8980492,"kids":[8981140],"parent":8980047,"text":"Washington, DC - Industry Dive - <a href=\"http://industrydive.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;industrydive.com&#x2F;</a><p>Industry Dive is a growing B2B digital media company. We report news and publish information to help executives and decision makers in the world&#x27;s biggest industries. See <a href=\"http://www.retaildive.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.retaildive.com&#x2F;</a> and <a href=\"http://www.utilitydive.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.utilitydive.com&#x2F;</a> for examples. You may have seen a recent story we wrote about the economics of solar power on the HN frontpage: <a href=\"https://news.ycombinator.com/item?id=8947198\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8947198</a><p>Industry Dive is a successful and growing three-year-old startup. We just moved into a nice new office in Chinatown overlooking 7th St... but we&#x27;re still small enough that every person here has an important job and the ability to impact the course of the entire company.<p><pre><code>   JR SOFTWARE DEVELOPER (Mainly Python&#x2F;Django)\n</code></pre>\nI&#x27;m looking for a smart, hungry, and entrepreneurial-minded developer to add features and fix bugs in our core content management system. The ideal candidate has at least a couple of personal or professional projects under their belt, but extensive Python experience or a degree in CS is <i>not</i> a requirement.<p><pre><code>   DEVELOPER INTERN\n</code></pre>\nI&#x27;m looking to bring on one or two interns to learn about software development as they build tools that make Industry Dive a better company.<p><pre><code>   WHY WORKING AT INDUSTRY DIVE IS GREAT\n</code></pre>\n- We&#x27;re a successful, growing and profitable company. We&#x27;re also still small \nenough that everyone matters. No &quot;busy work&quot; here.<p>- Short development cycle. We like to ship early and iterate.<p>- Not the same thing every day. You&#x27;ll have the opportunity to work on projects\n outside your core job description.<p>- Great team -- Work with a diverse group of people who are <i>really good</i> at what they do.<p><pre><code>   TO APPLY\n</code></pre>\nTo apply for the above positions, visit <a href=\"http://industrydive.com/jobform/\" rel=\"nofollow\">http:&#x2F;&#x2F;industrydive.com&#x2F;jobform&#x2F;</a> or email eli&#x2F;at&#x2F;industrydive.com with any questions.<p>Members of underrepresented groups are strongly encouraged to apply.","time":1422808181,"type":"comment"}