{"by":"spulec","id":8980301,"parent":8980047,"text":"YipitData, NYC, Fulltime. VISAs welcome.<p>Data Systems Engineer: <a href=\"http://yipitdata.com/jobs/#job-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;yipitdata.com&#x2F;jobs&#x2F;#job-engineer</a><p>YipitData develops clever ways to learn about businesses from online data. We specialize in acquiring this difficult to obtain but extremely valuable information through modern, large-scale technology.<p>We are profitable, VC backed, and our clients include the largest funds on Wall Street. Our goal is to predict quarterly financial performance and identify long-term inflection points for every public internet company. There are over 100 such companies today that create meaningful data, and 15 new ones go public every year.<p>We are building the premier destination for understanding data about important companies. We think this is the future (<a href=\"http://avc.com/2012/08/it-is-hard-to-hide-from-the-web/\" rel=\"nofollow\">http:&#x2F;&#x2F;avc.com&#x2F;2012&#x2F;08&#x2F;it-is-hard-to-hide-from-the-web&#x2F;</a>) of investment research.<p>YipitData:<p>- Python + Redis + MySQL<p>- Continous integration with Travis CI and Buildbot<p>- Continuous deployment<p>- Cloud hosting in AWS with Cloudformation and Chef<p>- &quot;Automate the boring stuff&quot;<p>You:<p>- Conscientious about assumptions baked into a system<p>- Critical eye for small things that &quot;seem off&quot;<p>- Disdain for inefficient processes (you often find yourself \ncomplaining about elevator algorithms)<p>- Curiosity to dig deep into issues that you don&#x27;t fully understand<p>Your first day will consist of:<p>- Fresh bagels (is there any other way to start a new job in NYC?)<p>- Unwrapping your new MacBook<p>- Your first commit (adding yourself to our about page)<p>- Your first production rollout (this is automatic since we practice continuous deployment)<p>- Introduction meetings with team members from across the company<p>- Learn about our different products by going through the codebase with another engineer<p>- Welcome drinks!<p>Your first week will involve training for the following:<p>- Overview of our infrastructure<p>- Introduction to Finance<p>- Web Extraction<p>- Introduction to Sell Side Research<p>- Introduction to Outsourcing<p>- Overview of our internal libraries that allow us to quickly develop new products<p>Within three months of joining, you will:<p>- Investigate and evaluate the potential for new data products<p>- Help write the technical spec for a new data product<p>- Take primary ownership for the development and maintenance of that product<p>- Configure the servers in the production environment for this product<p>- Work with data analysts to refine the resulting data from this product<p>- Start to contribute back to the shared libraries we use across products<p>- Pair program with data analysts on smaller projects<p>- Help in recruiting more data engineers<p>We offer highly competitive salary, equity, and excellent benefits. YipitData promotes strong engineering and company cultures; candidates should be excited about being a part of a fast growing start-up.<p>Send me an email if you are interested: steve@yipit.com","time":1422806202,"type":"comment"}