{"by":"kwayed","id":8981014,"parent":8980047,"text":"Monetate - Remote (US&#x2F;Canada only) or Philadelphia or London -- <a href=\"http://monetate.com\" rel=\"nofollow\">http:&#x2F;&#x2F;monetate.com</a><p>DevOps Engineer<p>Monetate powers personalization for the world&#x27;s best brands.  We deliver more than a million requests per minute using our 100% Linux, 100% AWS platform.<p>Location\nWe&#x27;re a geographically distributed team, and we welcome applicants from the US and Canada.  If you prefer working in an office, we also have positions available in London UK, Conshohocken PA, and Palo Alto CA.  We&#x27;re all-in on distributed teams.  We use technologies including Slack, BlueJeans, and GitHub to stay connected, and we get together a couple times per year as well.<p>We are looking for a DevOps Engineer to join our growing Engineering team.  Our engineering team is passionate about scale. We believe in respect for each other and for our customers as a core value. We believe that, as professionals, we should find our work fulfilling and it should contribute towards our happiness in life. We believe that a small team with full technical authority and responsibility is key to both happiness and project success. We believe in working with the best and we commit to continual improvement.<p>Why we need you:<p>To help us deliver reliable, zero-downtime releases using tools such as Terraform and CloudFormation.\nTo help us create machine images using tools such as Ansible and Packer\nTo help us monitor our infrastructure and applications using tools such as Circonus, CloudWatch, and Sensu.<p>You&#x27;ll be successful in this role if:<p>You are a Linux expert who can program a bit (and wants to learn more!)\nYou&#x27;ve used AWS or other virtualized infrastructure\nYou prefer automation tools such as Ansible, Chef, or Puppet to ssh and shell scripts\nYou&#x27;ve spent several years administering Linux&#x2F;Unix services in production<p>Bonus Points for:<p>Python expertise\nExperience using AWS services at scale\nExperience running high-volume Internet services\nContributions to Open-Source Software<p>Contact kway at monetate dot com","time":1422815118,"type":"comment"}