{"by":"arunmib","id":8981694,"parent":8980047,"text":"RideCell(YC W12) - Senior Backend Engineer - San Francisco, CA<p>You wouldn&#x27;t believe how inefficient most transportation systems are!<p>At RideCell, we build transportation automation software that helps large corporations, public transit agencies and Universities optimize, manage, and scale their transportation systems.<p>Our software has already moved almost 10 million people but that&#x27;s just the beginning. We&#x27;re working on much higher impact things that will fundamentally change the way logistics is done. Doing this requires solving some pretty interesting engineering problems ranging from optimally routing and dispatching vehicles to predicting customer demand based on historical and real-time variables to maximize throughput.<p>About You<p>- You have at least 3 years software development experience, including at least 2 years working with Python&#x2F;Django.<p>- You have experience mentoring new developers.<p>- You have code samples you can share with us - preferably real projects hosted on GitHub or something similar.<p>- You&#x27;ve worked at a startup before and love moving quickly.<p>- Bonus points: you have experience with one or more of these: Angular.js, Django REST framework, Postgres, AWS, Vagrant, Ansible.<p>- Bonus points: you&#x27;ve worked on location aware projects before.<p>- Currently living in US and willing to relocate to San Francisco.<p>What We Offer<p>- A significant role on a small team working on a huge and valuable problem<p>- Competitive salary and meaningful equity<p>- An incredible team of genuinely good people<p>Next Steps<p>We don&#x27;t believe in interviews full of syntax questions. We&#x27;d like to pay you to work with us for a week or two on a real project, we think that&#x27;s the best way to see if we&#x27;d be a good match for each other. To get started, email jobs@ridecell.com your resume, link to your GitHub &#x2F; code samples, and links to any deployed software you&#x27;ve worked on.","time":1422825305,"type":"comment"}