{"by":"qthrul","id":8982918,"parent":8980047,"text":"VCE -- <a href=\"http://vce.com\" rel=\"nofollow\">http:&#x2F;&#x2F;vce.com</a> Richardson, TX USA &#x2F; Durham, NC &#x2F; Cork, Ireland &#x2F; Marlborough, MA USA &#x2F; REMOTE<p>VCE is an EMC Federation Company with investments from Cisco and VMware. VCE recently surpassed a $2B annualized demand run-rate and a sixth consecutive quarter of greater than 50% year-over-year demand growth. Want to ride the rocket ship and work on interesting things?<p>- Senior Software Engineers \n- Manager, Software Engineering \n- Principal Product Manager Systems Management Software \n- Consultant Program Manager Software Products and Operations \n- Software Quality Assurance Engineer \n- Principal Program Manager Software Products \n- Consultant Product Marketing Manager Software and Systems Management<p>More listings are available by going to <a href=\"http://UnicornJockey.com\" rel=\"nofollow\">http:&#x2F;&#x2F;UnicornJockey.com</a><p>Keyword soup: analysis, design and development of service based components using React, Angular, Dojo, SOAP, WSDL, RESTful, using XML&#x2F;JSON standards; performing front-end development using JavaScript, JQuery and AJAX; in performing back-end development using SQL, PL&#x2F;SQL and stored procedures in Oracle; in Java&#x2F;J2EE, JPT (Java Performance Tuning) technologies and ORM frameworks including iBatis, Hibernate, JPA, Struts, Spring and Spring AOP&#x2F;MVC; in using Web and Application Servers including WebSphere and Tomcat; and in performing, building and deploying software components using Jenkins, Maven. OpenStack, CoreOS, Docker, combinatorial optimization, VMI algo, unicorns, turtles, rainbows, sentient cheese wheels, self lubricating sea slugs, etc...<p>p.s. If you are a currently at a startup working in Data Center Infrastructure Management, OASIS SCA &#x2F; TOSCA, DMTF OVF &#x2F; CIM &#x2F; CIMI, OGF OCCI, and&#x2F;or ODCA PEAT please contact me: jay dot cuthrell at vce.com","time":1422857098,"type":"comment"}