{"by":"jedanbik","id":8982483,"parent":8980047,"text":"Scry Analytics – Raleigh, NC<p>Senior ETL Developer (Pentaho&#x2F;Talend)<p>We are in urgent need of a senior ETL developer professional with some or all of the following skills and background (7-9 years of ETL experience):<p><pre><code>   * Pentaho and Talend experts on a full-time basis; for most situations we are using Pentaho suite and Talend-DI.\n\n   * Applicants must have a development background with enterprise Databases like SQLServer and Oracle (or preferably PostgreSQL) and their respective scripting platforms.\n\n   * Applicants must have a development background with high-performance ETL tuning and a reasonable amount of experience in core Java development.\n\n   * Applicants should eventually be good teammates within Scry Analytics and good at working directly with our enterprise customers.\n\n   * We have these openings in our San Jose and in our Raleigh offices (in the United States) and we are looking to hire at the associate level, and at the mid-manager levels.\n\n   * Domain knowledge of networking technologies and operations will be good to have; in any case, the candidate should be open to learn the skills on the job.\n\n   * Working knowledge of parallel computing, structured and unstructured databases, machine learning and artificial intelligence is definitely a plus (but not a pre-requisite)\n\n   * Scripting skills on Linux is a must.\n</code></pre>\nThe English word, &quot;Scry&quot; means &quot;crystal ball gazing&quot;.\nScry Analytics (www.scryanalytics.com) provides Big Data Science solutions to do predictive and prescriptive analytics (i.e., to &quot;forecast the future&quot;) and our aim is to:<p><pre><code>   * Codify work-flows in the services industries so that they are well-defined &amp; repeatable.\n\n   * Collate and harmonize client&#x27;s data that is required for such work-flow systems.\n\n   * Provide Scry Analytics&#x27; proprietary data that improves the key performance indicators and the characteristics of such work-flow systems.\n\n   * Use our proprietary Big Data Science platform as well as deep Computer Science &amp; Math algorithms to build decision support systems that improve the metrics related to these work-flows.\n</code></pre>\nAlthough Scry Analytics provides analytics and Big Data Science services, our aim is to minimize these services by providing automation and software solutions (where we can). We are currently solving problems in the following domains:<p><pre><code>   * Retail\n\n   * Banking and Insurance\n\n   * Inventory &amp; Transportation of After Market Parts; Maintenance\n\n   * Utilities and Telecom\n\n   * Health care\n</code></pre>\nSince most techniques that Scry Analytics is using are taken from cutting-edge research, the kind of solutions that we are building are unlikely to be built by companies that provide data analysts in a staff augmentation mode or those that provide IT professionals. So, we are looking for Bachelors, Masters, and PhDs in computer science, data analytics or math that have a &quot;research&quot; or &quot;advanced development&quot; bent.﻿","time":1422843928,"type":"comment"}