{"by":"iotum","id":8982937,"parent":8980047,"text":"Iotum Global Holdings - Los Angeles - Full Time<p>We are a software company in need of a rock-star Systems Engineer with DevOps leanings to join our team.<p><pre><code>  You eat&#x2F;sleep&#x2F;breathe technology. \n  Technology is your passion, your hobby, your lifestyle. \n  You are a tinkerer, driven by the desire to innovate.\n  Repetitive manual tasks are your pet peeve, and you derive satisfaction out of automation.\n  You are OS agnostic.\n  You are connected to and involved in the tech community.\n  You love participating in hack-a-thons.\n  Nerf dart guns are your weapon of choice.\n</code></pre>\nDoes this describe you? If so, we&#x27;d love to hear from you.<p>The ideal candidate will be ready to hit the ground running from day 1, working closely with our Software Architect to build the next generation teleconferencing platform and suite of collaboration tools.<p>Unlike many other environments, more than half of our employees wear technical hats so they&#x27;re pretty self-sufficient (ie desktop support isn&#x27;t really a thing around our office). The primary focus of this role will be building and maintaining our customer-facing (and revenue-generating) products and services.<p>Knowledge and experience in any of the following areas will put you at the front of the pack:<p><pre><code>  FreeSWITCH, Asterisk, or any other VOIP&#x2F;SIP experience\n  Designing highly-available infrastructure using AWS EC2, VPC, S3, etc\n  Working within an Agile &#x2F; Scrum team\n</code></pre>\nResponsibilities:<p><pre><code>  Assist Software Architect in designing and deploying a cutting edge technology platform using AWS\n  Maintain a diverse, distributed network of collocated and AWS-based servers running Windows and Linux\n  Identify opportunities to automate and improve processes that enable DevOps team to be more productive\n  Troubleshoot system issues escalated from Customer Service team\n  Advise DevOps team on Security best practices\n  Share on call rotation with rest of DevOps team\n</code></pre>\nFollowing satisfactory completion of a 90-day probationary period, you will become eligible for a comprehensive benefits package that includes 100% employer-paid medical, dental, and life insurance as well as 401k matching and paid sick&#x2F;vacation time.<p>You must be authorized to work in the United States. Only <i>local</i> candidates that meet the above qualifications will be contacted for interview.<p>About the Company:\niotum is an international company with roots in VoIP, telecom switch development, and innovative voice and mobile services. Today, we provide several teleconferencing platforms and collaboration services to millions of users worldwide, and are working on the next generation of virtual services to make it easier to collaborate and converse around the world.<p>Apply at: jobs-devops@iotum.com, and include &#x27;Hacker News&#x27; in the subject.","time":1422857643,"type":"comment"}