{"by":"anusriram","id":8983896,"parent":8980047,"text":"Real Image Media Technologies - Chennai - India - Full Time<p>If you have a passion for movies and software development then Real Image is the place to be.<p>Real Image is India’s leading provider of technology in the film, video and audio domain and is the company that was instrumental in dramatically changing India’s entertainment industry bringing about paradigm creative shifts in production, post-production and exhibition using the power of technology.<p>Qube Cinema - a global entertainment technology pioneer is a subsidiary of the company and is a comprehensive end-to-end digital cinema platform with products for mastering, distributing and playing movies. It has an installed base in 48 countries and is the largest digital cinema network in India with powerful satellite-connected on-screen advertising.<p>Justickets is a cool new movie ticketing website for the Indian market and is an associate company of Qube Cinema. Justickets is the first consumer-facing tool that showcases the company&#x27;s extensive cinema experience and footprint by offering a quick and easy way to book tickets online for current and upcoming movie releases across India.<p>MovieBuff is another new website launched with programatic access to the most accurate movie, talent and cinema information, thus enabling an enhanced movie ticketing experience with Justickets<p>We are looking for a full-stack Web Developer to work with us on enhancing our product and service offerings. A self-learner with tremendous energy, comfortable with various aspects of web development will be an ideal candidate to join our product team.<p>Required skill set:\nDatabase: MySQL&#x2F;PostreSQL. Knowledge of NoSQL data stores like Redis&#x2F;MongoDB\nLanguages: Ruby&#x2F;Python&#x2F;Node.js&#x2F;Javascript\nFrameworks: Rails&#x2F;Express&#x2F;Sinatra or equivalent\nExperience working with single-page web application, e-commerce website would be a big plus.<p>Please send in your resumes to vijayaraj.palaniraj@realimage.com with the subject heading – HACKERNEWS AD PLACEMENT","time":1422881467,"type":"comment"}