{"by":"conspicuus","id":8984428,"parent":8980047,"text":"Slader - New York - Python&#x2F;Django Backend Developer<p>We are looking for an experienced full-time, NYC-based Django developer to join our amazing team. You&#x27;ll be responsible for anything and everything on the backend of our education-focused website. We&#x27;re shaking up the education space with student-centered products for the high school and university space.<p>About You:<p>- expertise in Django&#x2F;Python and related technologies&#x2F;libraries<p>- expertise in HTML&#x2F;CSS&#x2F;JS<p>- experience with optimization of high-traffic applications<p>- familiarity with PostgreSQL<p>- experience with AWS a plus<p>- possess a decent sense of aesthetics<p>- self-directed, willing to take on multiple responsibilities \nand meet deadline expectations<p>- detail-oriented<p>- a willingness to learn new things<p>You will be responsible for:<p>- Working with the dev team to keep the website running day-to-day<p>- Developing and deploying new products and revamping and upgrading old ones<p>- Working with design and product teams to develop both front and backend tools to make life easier for all of our end users<p>- Thinking of new and innovative ways to handle and put to use large datasets<p>- Optimizing and streamlining rich web applications<p>- Improving our users&#x27; experience through better, faster, more relevant products<p>About Slader<p>- The largest student-led academic network<p>- Reaches over 1.5 million students each month<p>- Has grown solely via word-of-mouth<p>- Delivers over 30 million page views per month<p>- Fun, irreverent, and quirky brand<p>- Our users LOVE us<p>- User base of 14-22 year olds with a student-focused interface<p>- We have educational content, but we try to keep our users (and ourselves!) entertained<p>- We&#x27;re constantly working on new things and new ideas<p>Please email us at (jobs AT slader DOT com) with links to sites you&#x27;ve worked on, a resume, your Github account, and&#x2F;or any other relevant information.","time":1422889409,"type":"comment"}