{"by":"techwraith","id":8984705,"parent":8980047,"text":"Getable - San Francisco<p>We are changing the way the construction industry rents and manages equipment. Getable is a marketplace where contractors can find, rent, and manage equipment from local suppliers. We&#x27;re the first to tackle this $41 billion market, and our customers love us. We&#x27;ve seen impressive growth over the past year, and have closed a series A funding round. Now, we need help taking this from an MVP to a industry leading product. Come join us as we enter our growth phase.\nWe&#x27;re a small company of twelve people with eight in the product team. We&#x27;re building a diverse team, but we&#x27;ve all got one thing in common: we love building great things. We&#x27;re always work to have an impact on our users, our team, and our product.<p>Our engineers use the latest in open source JavaScript tooling; Node.js, Browserify, npm, socket.io, PhoneGap, Docker, all help us build our realtime apps quickly. Atomify, our open source UI framework makes us nimble and simplifies the front-end development process. Our continuous integration and testing systems help us make sure that we&#x27;re not sacrificing quality for development speed.<p>At Getable, we don&#x27;t separate our engineers into front-end and back-end teams. It&#x27;s all JavaScript here, so everyone is comfortable working on the whole stack. Product work is usually done in two to four week cycles by two to four people. We ship frequently, and we don&#x27;t build things that won&#x27;t be used.<p>We offer competitive salaries, meaningful equity, and great health, dental, and vision benefits.<p>Who we&#x27;d like to hire<p>We&#x27;re looking for generalists who can go from working on an UI component on the client to building an API on the server and back again without missing a beat. We&#x27;re looking for engineers who have experience building beautifully responsive single page applications.\nWe strive for a culture of mentorship. Our senior engineers work with and help train more junior engineers to become the senior engineers we know they can be.<p>We&#x27;re looking for both junior and senior level engineers.<p>If this sounds like you, email daniel@getable.com","time":1422892089,"type":"comment"}