{"by":"lipsmack","id":8984119,"parent":8980047,"text":"Football Radar - London, UK<p>Football Radar is a young, profitable company which does advanced statistical analysis of football. We are amongst the best in the world at what we do, and need more experienced engineers to help us grow our modelling and trading platforms.<p>====================<p>Senior PHP Engineer:<p>====================<p><a href=\"http://footballradar.com/jobs/#op-44681-senior-php-software-..\" rel=\"nofollow\">http:&#x2F;&#x2F;footballradar.com&#x2F;jobs&#x2F;#op-44681-senior-php-software-...</a>.<p>We&#x27;re looking for an engineer who can write structured, testable code for our web applications. You should have experience of object-oriented programming in PHP and one other language. Ideally you&#x27;ll have some experience of working with MVC frameworks and especially Symfony2 components.<p>Some of the technologies we use:<p>- Symfony2, Doctrine<p>- MySQL, MongoDB, Redis<p>- Vagrant, Ansible<p>- Amazon EC2<p>===============<p>Scala Engineer:<p>===============<p><a href=\"http://footballradar.com/jobs/#op-20718-scala-software-engin..\" rel=\"nofollow\">http:&#x2F;&#x2F;footballradar.com&#x2F;jobs&#x2F;#op-20718-scala-software-engin...</a>.<p>We’re looking for an experienced programmer to help us build real-time trading software, work with large datasets and do complex statistical modelling. The main language we use for our real-time and modelling systems is Scala, but we use Python and PHP too. We expect you to have some experience with Scala and also not being afraid of working with other languages.<p>====================<p>JavaScript Engineer:<p>====================<p><a href=\"http://footballradar.com/jobs/#op-14508-javascript-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;footballradar.com&#x2F;jobs&#x2F;#op-14508-javascript-engineer</a><p>We are looking for a seasoned JavaScript Developer to help us deliver highly effective, maintainable user interfaces. The ideal candidate will have experience working with rich user interfaces and single-page applications. We are scaling up our business operations, and we need someone who can create powerful interfaces that help us grow.<p>Some of our JS stack:<p>- React, Immutable-js<p>- Realtime technologies (WebSockets, socket.io, etc.)<p>- Node.js, npm, CommonJS (Browserify, webpack)<p>- Nodeunit, Jest, Mocha, PhantomJS<p>- Reactive programming (RxJS, Bacon.js)","time":1422885317,"type":"comment"}