{"by":"sophiestrap","id":8984322,"parent":8980047,"text":"Cincinnati, Ohio | Backend Developer | Strap\n<a href=\"https://angel.co/strap/jobs/43782-backend-developer-cincinnati\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;strap&#x2F;jobs&#x2F;43782-backend-developer-cincinna...</a><p>DESCRIPTION\nStrap is looking for a Backend Developer to join our growing team in Cincinnati, Ohio’s historic Over-The-Rhine neighborhood. The Backend Developer has 2+ years of experience developing scalable and secure solutions on the server side using Node.js and MongoDB. Experience with Python and MapReduce is a plus. You’ll be responsible for developing a wide variety of APIs to support all of our web and mobile-based products. Experience with OAuth workflows is strongly desired.  You’ll work closely with our CTO to ensure that your logic and architecture decisions support the wider mission of the Strap family of products.\nAt Strap, we follow a fairly rigorous agile development process. You are expected to communicate your progress “stand-up” style daily while maintaining your work in feature branches with frequent commits. The goal is not to add meaningless processes to your plate; rather, we believe that communication and transparency are two extremely important factors in a successful development team.\nAll employees are expected to also be evangelists for Strap, so you’ll spend 10-15% of your week (NTE 6 hours) being extroverted in some form. Examples include blogging, spending time on Stack Overflow answering questions, or contributing to open source projects. These activities may or may not be directly related to content marketing, but being in the community as a representative of Strap helps our street cred tremendously.\nYou may be asked to travel periodically for conferences, hackathons, or other professional engagements. Travel is not expected to exceed 10% annually.<p>SKILLS:\nPython, Javascript, MongoDB, Node.js, Mapreduce, Amazon Web Services, Security, OAuth","time":1422888171,"type":"comment"}