{"by":"medovina","id":8985285,"parent":8980047,"text":"Roundtown - <a href=\"http://roundtown.com\" rel=\"nofollow\">http:&#x2F;&#x2F;roundtown.com</a> - Cambridge, MA<p>We&#x27;re a 6-person Internet startup. Our site launched last year - it lists events (festivals, art shows, concerts, plays, everything else) happening all over the US, Canada, the UK, Ireland, Australia and New Zealand. We have over 100,000 visitors a month and our traffic is growing quickly.<p>Our goal is to build the most accurate, comprehensive and up-to-date list of events happening everywhere and to make it available in a way that&#x27;s fast, practical and fun, both on the desktop and on mobile devices. We want to be the first name people think of when they want to know what they can go out and do.<p>We are a technology company. Unlike some of our competitors that curate event lists by hand, we&#x27;ve developed a system that pulls in events continuously from many different sources online and unifies them into a single event set. It&#x27;s far from perfect today, and we need to solve many interesting engineering challenges to make our event data more complete and accurate and to scale our system up.<p>Our web site today is just a first step. We plan to add lots of features that will make it easier to find great events. These include personalized event recommendations, social event sharing, notifications when your favorite bands&#x2F;artists are coming to town, and more.<p>Our mobile story today is weak - we have a mobile site but it needs a lot of work, and we have no apps at all yet. We have a lot to do.<p>We&#x27;re looking to add several more software engineers to our friendly and experienced team to work on all of the above. You should be a proficient, energetic, creative programmer who&#x27;s a great communicator and is enthusastic about joining a fast-moving startup environment. We&#x27;re using the following technologies, which you should already know or be able to learn quickly:<p>Scala\n- Play\n- Slick\n- Postgres\n- Angular\n- Bootstrap<p>Knowledge of machine learning, statistics and&#x2F;or scikit-learn is not required but would also be a plus.  Experience building apps for iOS and&#x2F;or Android would be a plus as well.<p>We&#x27;re in a cool coworking space right near Central Square. Unlike some startups, we can offer you a real salary plus early-stage stock options in our venture.<p>Sound like a fit? Yeehaw - send your resume to jobs@roundtown.com.","time":1422897545,"type":"comment"}