{"by":"andreroman55","id":8986557,"parent":8980047,"text":"C#&#x2F;.NET Developer (Contact) - Cognitive Medical Systems - San Diego, CA\nwww.cognitivemedicalsystems.com<p>Must be legally authorized to work for any employer in the United States without sponsorship.<p>Develop solutions in C#&#x2F;.Net, collaborating on all phases of the systems development life-cycle (SDLC) with a focus on the application design, development, and implementation phases. Deploy solutions to a controlled and externally hosted SharePoint 2010 environment.<p>Responsibilities:<p>•\tDesign, develop, and implement software packages for a custom SharePoint 2010 Web application using C#&#x2F;.Net and associated tools.\n•\tTroubleshoot, debug and implement software code to resolve issues found within the .Net application<p>Qualifications:<p>•\tBS degree\n•\t4 years of experience developing C# applications\n•\t2 years of experience with SQL Server 2008\n•\t1-2 years of SharePoint 2010 application support experience\n•\tMust be a US Citizen or permanent resident of the USA\n•\tExpert knowledge of software development life cycle and Agile methodologies\n•\tProficient with Visual Studio\n•\tSharePoint 2010 installation and set up experience a plus<p>As an emerging concept-engineering company, Cognitive Medical Systems is making its mark in both the software and healthcare communities in San Diego and the United States. This local and national recognition has increased our growth potential and we are welcoming talented individuals to join our team. We need new team members who can help us reach our goal of improving the quality of healthcare that produces impactful Clinical Decision Support systems. Our high quality engineering solutions are positively impacting legacy healthcare systems and integrating them with contemporary technologies so that patients and physicians alike are presented with the best healthcare delivery options available. Cognitive needs individuals with the right skill and knowledge set to help us continue our growth and mission of positively impacting the world of healthcare.<p>We offer a competitive compensation &#x2F; benefits package and the opportunity to earn equity through incentive stock options.<p>Please send resume to careers AT cognitivemedicine.com with C#&#x2F;.NET Developer in the subject line.<p>Cognitive Medical Systems is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Applicants will receive fair and impartial consideration without regard to race, sex, color, religion, national origin, age, disability, veteran status, genetic data, or religion or other legally protected.","time":1422907418,"type":"comment"}