{"by":"falonfatemi","id":8986623,"parent":8980047,"text":"Node - San Francisco Hiring full-time in SF (SoMA), contract-to-hire preferred: \n* Backend Software Engineer (python) \n* Data Engineer \n* Data Scientist<p>We&#x27;re a seed funded startup - 3 former Googlers - and we&#x27;re tackling the messy world of business. Every day, people shake hands over million-dollar deals that can change the future of a company. From fundraising and acquisitions to partnerships, promotions and product placement, businesses get together and make new things happen. But there&#x27;s no platform for them; they typically overload sales-focused CRMs, or are stuck in the world of spreadsheets and email. We&#x27;re changing that. It&#x27;s a fascinating data problem as we&#x27;re mapping out professional and company-to-company networks, trying to understand who does business with whom and why, feeling our way around the underlying graph that nobody&#x27;s explicitly mapped out before. From old school tie to the boardroom, why do people do business with each other? What are the trust and influence networks? What&#x27;s the equivalent of PageRank for investors? What does it mean when a VP moves from one company to another? How do I get my startup funded?<p>We&#x27;re trying to answer all these questions. We have an invite-only product already launched, we&#x27;re building a team-facing solution, and we&#x27;re expanding our data team to work on the platform that powers it all. Here&#x27;s our team&#x27;s take on the space: <a href=\"https://medium.com/@jennielees/the-joy-of-data-a1d3757d3567\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@jennielees&#x2F;the-joy-of-data-a1d3757d3567</a> Looking for fast learners who can get their hands dirty, quickly; who know when to duct tape and when to have 100% test coverage (think like a hacker, ship like a pro); who don&#x27;t mind being wrong occasionally; and who are intrigued by the overall space we&#x27;re in. We&#x27;ve had a good run from HN posts so far, hoping to continue it. You&#x27;d be single-digit employee and have a significant chance to influence our culture and growth, as well as immense impact on the product itself. We have a generous equity setup, though we prefer contract-to-hire so we can figure out if we&#x27;d work well together. For our data roles, we prefer Python. Graph-specific data experience is a bonus.<p>Email falon@node.io","time":1422908012,"type":"comment"}