{"by":"mlent","id":8991410,"kids":[9049914],"parent":8980047,"text":"SumUp - Berlin, Germany - Front-End Web Developer (m&#x2F;f)\n------------\nKey responsibilities\nExpertise in Angular.js, our framework of choice, is a huge plus, but we&#x27;re also interested in your history with other javascript frameworks such as Ember, Backbone, or Knockout. You are fluent in Javascript, not just jQuery, comfortable with modern front-end development tools like Grunt and Sass, and you are proficient (dare we say, pedantic) with Git. Your eye for UX and usability are also essential to succeed in this role. Experience with at least one server-side language, especially Ruby, demonstrates that you are the kind of flexible and well-rounded developer we are looking for.\nWhat we expect from you\nYou care about performance, clean code, and enjoy experimenting with different approaches to a technical problem. And of course, you know your way around Linux and have either a Computer Science education or understand the equivalent fundamentals. You love to work as a reliable part in a dedicated, high-performance team. Your excellent communication and written skills in English will help you collaborate with team members from a wide range of countries and cultures. You love what you do and strive for improvement in all areas of your life – whether at work or in your free time. You are excited and motivated by a good challenge.\nWhat you can expect from us\nAn amazing working environment at the beautiful riverside in Kreuzberg, Berlin – the heart of the most vibrant city in Europe. Short decision-making channels in a technologically demanding, international and motivating environment with flat hierarchies. Challenging tasks and responsibilities and a wide scope for action. This full-time job, now.\n------------\nIf you’re interested in joining us, please send a copy of your CV and&#x2F;or a link to your Github to careers@sumup.com. We look forward to hearing from you!","time":1422982233,"type":"comment"}