{"by":"mikeearley2001","id":8993256,"parent":8980047,"text":"Cuff (www.cuff.io) - San Francisco - Full-time - Android Lead Engineer<p>Cuff is leading a fashion revolution in wearable technology, creating first-of-its-kind assortment of fashion wearables: smart-technology accessories that people will actually want to wear.  We partner with leading fashion companies to provide hardware and software for stylish smart jewelry.  We are well-funded by top tier investors including NEA, Tandem Capital and Tugboat Ventures. (<a href=\"http://techcrunch.com/2015/01/06/cuff-raises-5-million-series-a-and-partners-with-richline-to-bring-smart-jewelry-to-the-mainstream/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;01&#x2F;06&#x2F;cuff-raises-5-million-serie...</a>).<p>We are looking for an Android Lead Engineer to join our team as employee #4.  It’s an exciting time to come aboard -- you’ll have the opportunity to build and shape the engineering team from scratch. You’ll also work cross-functionally with the Product and Design teams on shared goals, while taking action and assuming responsibility for implementation decisions.<p>Responsibilities:<p>- Architect and implement our mobile experience\n- Keen user-centric focus when developing our UI &amp; UX \n- Work very closely with our Product&#x2F;Design&#x2F;Server&#x2F;Hardware teams\n- Thrive in a fast-paced startup environment\n- Help us grow our team\n- Laugh and enjoy yourself<p>Qualifications<p>- Intimate understanding of Java\n- Experience with Agile Development and Version Control Systems\n- Passion for best practices and design patterns\n- Comfortable in collaborative environments<p>Pluses<p>- Worked with Bluetooth - low energy\n- Appreciation for unit tests and functional tests<p>We offer a competitive salary, best equity in the Silicon Valley and a killer benefits package.<p>If you are interested in hearing more about this position, please get in touch with us at: jobs@cuff.io","time":1422996610,"type":"comment"}