{"by":"SherylBehave","id":8995472,"parent":8980047,"text":"San Francisco - Close - Python Developer-  Scalable, Distributed Systems. Contract to Hire Ideal<p>We are a well funded, stealth mode startup, (located in San Francisco’s SoMa district), building out an API, serving up a new way to obtain search results for hundreds of thousands of simultaneous clients.  We are looking for the next member of our team, a strong, experienced python developer to help build out our backend, indexes and crawlers.<p>This role is hands-on, and you will be in the trenches, contributing to our codebase and making sure the lights are on.  We are looking for someone who is able to dive in and help address complex challenges without the need for handholding.  You will need to use your judgment to avoid getting sidetracked in minor details, and to keep a focus on quality and excellence without losing sight of tactical needs.  We’re looking for someone with a collaborative style, who knows when to take initiative and when to defer to the judgment of the team.  You will also need to be able and willing to write a lot of unit and integration tests.<p>Ideally, you will have real-world experience with one or more of the following: asynchronous workers, ElasticSearch&#x2F;Lucene, Docker, graph databases, segmentation of graph data along organizational boundaries, distributed algorithms, data analysis, ApacheStorm, Samza, Spark, Titan, Hadoop&#x2F;HBase,triple stores, and&#x2F;or implementation details relating to API security, rate limiting, monitoring and billing. You will also work with JSON and third-party APIs, daily.<p>A contract-to hire arrangement is preferred, and there will be opportunity to grow with the position as our company grows. We are excited about the problems we are tackling in our space: <a href=\"https://medium.com/@jennielees/the-joy-of-data-a1d3757d3567\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@jennielees&#x2F;the-joy-of-data-a1d3757d3567</a><p>We would love to hear your thoughts on how to build an architecture that will allow for replay, from some previous point in time, and handle incoming events instead of batch processing.<p>Interested? Contact us today - sheryl@node.io","time":1423027787,"type":"comment"}