{"by":"jedanbik","id":8996912,"parent":8980047,"text":"Scry Analytics - Raleigh, NC - Full time<p>Front End Web Application Developer:<p>Job Description and Responsibilities:<p>We are looking for a front-end web application developer interested in creating web applications. The candidate must be able to take an idea with only a list of features and translate that list into a concrete design document with emphasis on user experience. Then, after creating the design document and page mock-ups, be able to work with database engineers and software engineers to create a fully integrated web application able to handle big data analytics.<p>All applicants should be prepared to demonstrate their development ability. During the interview, we may give a simple algorithmic coding test as well as a coding test based on a previous difficulty we’ve run into on the project.<p>This is a full time position and all applicants must be willing to work onsite – relocation may be discussed in the interview.<p>Required Skills:<p>•\tProficiency in HTML, CSS, Javascript, and Javascript libraries (e.g. jQuery)<p>•\tProficiency with Node.js or Angular.js, preferably both<p>•\tWorking knowledge of at least one server side scripting language (e.g. Python, PHP, Perl)<p>•\tWorking knowledge of either relational (e.g. MySQL, Oracle DB) or document based (e.g. Mongo DB, Informix) databases<p>•\tProficient in writing clean code as well as documentation and APIs for code<p>•\tWork in a team environment and work on multiple projects in different phases of the development life cycle<p>Reconmmended Skills:<p>•\tWorking knowledge of one programming language (e.g. Java, C++)<p>•\tWorking knowledge of web servers (e.g. Apache) and servlet containers (e.g. Jetty)<p>•\tWorking knowledge of the full MEAN (Mongo DB, Express, Angular.js, Node.js) stack<p>•\tExperience with graphing and data visualization technologies<p>Qualifications:<p>•\tBachelor’s Degree or equivalent in web design or programming, experience may be substituted for education","time":1423059827,"type":"comment"}