{"by":"Clairesheng","id":9008233,"parent":8980047,"text":"One of our offices: Shanghai, China<p>We build products at the intersection of technology around data. Lots of data visualization, big data and infrastructure.<p>We work with large organizations on challenging problems (the World Bank, the United Nations, CNN) OR on our own products (mostly developer tools, things like <a href=\"http://devo.ps\" rel=\"nofollow\">http:&#x2F;&#x2F;devo.ps</a> or <a href=\"http://sweepboard.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sweepboard.com</a>).<p>We are a multicultural team with French, American, British, Chinese, Korean, Dutch and Finnish colleagues. We are about to settle a third office in Berlin this year.\nWe work a lot with Javascript (node.js, AngularJS), Python, occasionally Go and Erlang. Lots of single page apps, APIs and infrastructure automation.<p>We are looking for full-time or interns:\n- Developers; front-end (HTML5 + Compass + AngularJS), backend (node.js, Python), ops (Python, Go).<p>- Designer director; you have design chops, understand technology (HTML&#x2F;CSS...) and do more than nice pictures (content,strategy,color,theory,...).<a href=\"http://careers.wiredcraft.com/jobs/design-director/\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.wiredcraft.com&#x2F;jobs&#x2F;design-director&#x2F;</a><p>- Technical project manager; you&#x27;re comfortable fitting entire technical architectures in your head, you have a burning desire to see things done.<p>- Online marketing intern; we&#x27;d love some help with growth hacking our products and marketing our services like there&#x27;s no tomorrow. <a href=\"http://careers.wiredcraft.com/jobs/online-marketing-intern/\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.wiredcraft.com&#x2F;jobs&#x2F;online-marketing-intern&#x2F;</a><p>- Business Development; if you are in Washington DC, Berlin or Paris, understand enough of our space and would like to help us grow our services, shoot us an email.<p>Drop me a line at job@wiredcraft.com, or go to <a href=\"http://wiredcraft.com/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;wiredcraft.com&#x2F;careers.html</a>","time":1423214686,"type":"comment"}