{"by":"laszlocph","id":9017849,"parent":8980047,"text":"COPENHAGEN, DENMARK EUROPE - SENIOR BACKEND ENGINEER<p>Falcon Social is a Software-as-a-Service provider in the Social Media Management space. We provide a unified approach for marketers, customer service specialists and hr personnel of big international brands to manage their social media presence. That means plenty of challenging engineering tasks, complex UIs to simplify and data, loads of data.<p>We are looking for senior members for our engineering team. You are joining an ambitious team of experts who keep pushing the limit in product delivery and experiment furiously while striving for technical excellence.<p>We are agile, organized ourselves into cross-functional, autonomous teams, focusing on one product with a clear mission. We intend to be flat, with everyone equal and with each member&#x27;s role respected. Day-to-day you will work together with people of different trades: frontend, backend engineers, ui&#x2F;ux designers, cloud operation engineers, and product owners.<p>We are a maturing startup with an engineering headcount of 20. We are not small anymore, and still growing rapidly. Working at a startup is the most rewarding choice that one can make, but it requires a certain personality as well. That being said, we value open people who take initiative more than lone rockstars.<p>Falcon Social’s frontend is a single page web application built with AngularJs, Bower, Grunt, D3.js\non top of a REST flavored HTTP+JSON api served by a lightweight Java8 backend running on DropWizard, PostgreSQL, ElasticSearch, AWS, Apache Spark and Python.<p>This job requires extensive Java programming language experience and also the knowledge of how modern Java is done. We favor lightweight frameworks like DropWizard, we value a good domain model (DDD), we think in single responsibility (micro)services, we prefer good refactoring skills, pragmatism and craftsmanship.<p>AS A SENIOR MEMBER OF THE TEAM, YOU<p><i>deliver high quality solutions\n</i>act as a sparring partner to various members of the team<p><i>constantly share and debate best practices with your peers<p></i>take initiative<p><i>know when to speak up, know when is time for crunching<p></i>perhaps able to lead a group of engineers<p><i>perhaps enjoy mentoring<p>AS A BACKEND ENGINEER, YOU<p></i>will define accurate domain models<p><i>will store data efficiently in a matching storage engine<p></i>will build highly parallel data processing pipelines<p><i>will be building fluent apis<p>WHAT WE CAN OFFER<p></i>Open and informal work environment with more than 30 different nationalities (<a href=\"https://www.youtube.com/watch?v=_e2Kd8HuXEU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_e2Kd8HuXEU</a>)<p><i>High level of responsibility, newest technologies, room for experimentation<p></i>Working at a central location in Copenhagen (the home of the best craft beer and bicycle lanes in Europe, also the most liveable city on the planet: <a href=\"https://www.google.dk/?gws_rd=cr,ssl&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;ei=jdm7VK_bE4XgywPN_IGADQ#q=the+most+liveable+city+copenhagen\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.dk&#x2F;?gws_rd=cr,ssl&amp;amp;amp;amp;amp;amp;amp...</a>)<p><i>5 paid weeks vacation<p></i>Yearly personal conference budget<p><i>Healthy lunch and drinks<p></i>Healthy and not so healthy snacks. We take our candy seriously!<p><i>Choose your own gear<p></i>A phone of your choice with subscription and internet for your home<p><i>Smoke machines in different shape and size. Look what we&#x27;ve built for the Øredev conference at Malmo: <a href=\"https://fogit.falconsocial.com\" rel=\"nofollow\">https:&#x2F;&#x2F;fogit.falconsocial.com</a><p></i>Friday bars<p>*Of course, a foosball table","time":1423417493,"type":"comment"}