{"by":"cairo140","id":9024288,"parent":8980047,"text":"TATCHA - San Francisco - Full time - Full stack web developer<p>We are looking for a Web Software Engineer to join our dynamic, fast-paced team in San Francisco.<p>We are interested in intermediate to principal-level candidates, both as individual contributors and as project and technical leads.<p>Our work focuses primarily on our eCommerce website <a href=\"http://www.tatcha.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tatcha.com&#x2F;</a>. You would be joining as a key member of the technical staff, owning major parts of our web infrastructure, and taking features all the way from inception to development to deployment and maintenance.<p>The greatest thing about being on the Tatcha technical team is that it&#x27;s a perfect mix of small team and big impact.<p>We are big enough that we run an eCommerce shop with thousands of visitors and plenty of transactions a day, where any change hits a large number of customers. And we&#x27;re big enough that we know what we do well; we&#x27;re not pivoting for a business model or running down a funding runway.<p>At the same time, we are small enough that we don&#x27;t deal with a lot of typical &quot;big company&quot; overhead (separate IT&#x2F;operations, complicated technology purchasing&#x2F;licensing, cumbersome architectural momentum). You pick the build tool&#x2F;library&#x2F;monitoring service&#x2F;operating system that best allows us to get things done. And our technical vision 12 months to 5 years from now? Yours to define.<p>Here is a list of the primary objectives and a sample of our projects for our engineering team today:<p><pre><code>    * New feature development: in-browser live interactive audio and video assistance, new content app development (e.g., skin consultation), streamlined gifting experience.\n    * Site conversion funnel optimization: checkout page optimization, A&#x2F;B testing infrastructure, landing page tests\n    * Performance and infrastructure optimization: smart HTTP request caching, enhanced server caching, progressive CSS&#x2F;JS&#x2F;image loading.\n</code></pre>\nOUR TECHNOLOGY:<p><pre><code>    * Operational stack: LAMP-based stack, using Magento as our eCommerce&#x2F;cart platform and ExpressionEngine as our content CMS.\n    * Frontend build: Grunt.js, Bower, HAML, CloudFlare CDN, Javascript (Angular.js, jQuery), SCSS, in development: single code base (mobile&#x2F;tablet-responsive).\n    * Workflow: Trello, git, Bitbucket, CI on dev, weekly rollouts.</code></pre>\nYou are primarily a front-line coder who can work independently to deliver new features all the way from the technical planning and estimation to the production deployment.<p>Your day-to-day could look like this:<p><pre><code>    * Writing code\n    * Participating in code reviews\n    * Advising product managers on technical requirements and dev estimates\n    * Working on manual technical operations (deployments, report investigations, systems maintenance)\n    * Investing in our infrastructure (update our dev&#x2F;deploy&#x2F;sync systems, plan measures like automated testing, CI, and configuration management)\n</code></pre>\nYou are able to learn quickly and take initiative, as our company is dynamic and ever-evolving. To succeed in this position, the following qualities are paramount:<p><pre><code>    * You’re able to own architectural decisions and know how to pick the right tool and approach for the job.\n    * You work with a long-term horizon and want to come to a place where everyone sees their work the same way.\n    * You love to ship features and bug-fixes that affect tens of thousands of customers every day.\n</code></pre>\nQUALIFICATIONS (INTERMEDIATE&#x2F;SENIOR):<p><pre><code>    * 2+ years of professional experience building websites and web apps\n    * Able to build high-quality HTML&#x2F;CSS&#x2F;Javascript applications independently\n    * Experience with full LAMP stack or comparable (e.g., RoR) environment\n    * Proficiency in maintaining a modern frontend webdev pipeline or willingness to learn+\n</code></pre>\nQUALIFICATIONS (PRINCIPAL&#x2F;LEAD):<p><pre><code>    * 5+ years of professional experience building websites and web apps including full lifecycle (roadmapping, team selection, stakeholder management, deployment, maintenance)\n    * Expert fluency in HTML&#x2F;CSS&#x2F;Javascript, including performance&#x2F;bottleneck analysis, library maintenance, and long-term technical design\n    * Strong grasp of web&#x2F;network security and service architecture and maintenance\n    * Strong web server and OOP proficiency\n</code></pre>\nEXTRA CREDIT:<p><pre><code>    * Experience in our particular stack and libraries\n    * eCommerce experience&#x2F;interest\n    * Growth and conversion optimization\n    * Interest in skincare or beauty\n    * Customer service background\n</code></pre>\nImmediate on-site full-time hire preferred<p><a href=\"http://www.tatcha.com/careers/web-software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tatcha.com&#x2F;careers&#x2F;web-software-engineer</a> or email careers@tatcha.com.","time":1423521669,"type":"comment"}