{"by":"superbatfish","id":9032142,"parent":8980047,"text":"Janelia Research Campus - Scientific Software Developer<p>Job Description<p>Ilastik (<a href=\"http://ilastik.org\" rel=\"nofollow\">http:&#x2F;&#x2F;ilastik.org</a>) is a collaborative open-source project with the aim of providing a scalable image analysis platform for the neurosciences and beyond. Current ilastik development seeks to bring the power of interactive machine learning to very large data sets and a variety of tasks.<p>Janelia Research Campus, HHMI (<a href=\"http://www.janelia.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.janelia.org</a>) in Ashburn, VA, one of the premier centers for the neurosciences and biomedical research worldwide, is funding a Junior or Senior Scientific Software Developer to reach that goal. Specifically, the goal is to implement in ilastik a pipeline for the tracking of multiple animals in video, a modality that allows biologists to study the social behavior of animals under various experimental conditions. The envisioned software shall be able to correctly track multiple subjects over hours of continuous observation, comprising numerous social interaction events between individuals. When success is achieved, the resulting software will exploit world-class tracking algorithms (Hamprecht Lab) and will be the field-standard, open-source animal tracking software, enabling cutting-edge studies of complex animal behavior across biomedical research.<p>Practical tasks include the integration or reimplementation of advanced machine learning and image analysis algorithms; the integration with existing tools; and the implementation of a graphical user interface for exploratory analysis of results as well as targeted proof-reading.  The software developer will be guided by Kristin Branson (<a href=\"http://www.janelia.org/lab/branson-lab\" rel=\"nofollow\">http:&#x2F;&#x2F;www.janelia.org&#x2F;lab&#x2F;branson-lab</a>) and Marta Zlatic (<a href=\"http://janelia.org/lab/zlatic-lab\" rel=\"nofollow\">http:&#x2F;&#x2F;janelia.org&#x2F;lab&#x2F;zlatic-lab</a>), as well as a senior core ilastik developer at Janelia, and will interact with scientists and other core developers at the University of Heidelberg.<p>Salary is commensurate with prior experience and will be competitive for well-matched candidates. The position will be located on the beautiful Janelia Research Campus. The successful candidate will be in a position to help shape a project that is becoming an enabling technology in one of the most interesting fields conceivable: the deciphering of the inner workings of the brain.<p>Please send full details to Stuart Berg at bergs@janelia.hhmi.org and attach or link to a representative code sample demonstrating your skill.   \nSkills &amp; Requirements<p>The position requires<p><pre><code>    a strong background in either C++ or Python\n    experience in developing user interfaces\n    experience in software engineering applied to large projects\n    familiarity with modern design patterns\n    the skills to integrate existing algorithms and functionality into a unifying biomedical image processing framework.\n</code></pre>\nExperience with C++&#x2F;Python interoperation, Qt, numpy, and scientific parallel programming is a plus. Good communication skills are essential to ensure effective cooperation with local experts and other programmers working remotely.\nAbout HHMI Janelia Research Campus<p>Opened in 2006, HHMI&#x27;s Janelia Research Campus is a pioneering research center in Ashburn, VA, where scientists pursue biology&#x27;s most challenging problems in a uniquely innovative and collaborative atmosphere. HHMI&#x27;s reputation for excellence is reflected in its employees, who form a remarkable team working throughout the United States to carry out HHMI&#x27;s mission of conducting biomedical research and promoting science education.<p>HHMI is an equal opportunity employer.","time":1423648107,"type":"comment"}