{"by":"itay","id":3413050,"parent":3412900,"text":"A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people. Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you. I personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>Some specific areas where we're looking to hire:\nFrontend engineer - Splunk is doing some awesome frontend development, so if you're interested in the intersection of presenting big data in a human-usable manner, this is a great position. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ</a>\nSys Admin: we recently launched Storm, our Splunk in the Cloud offering. We're looking for a sysadmin to help us manage that undertaking. This is a product that just launched, so you could have a big impact here. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=ou6XVfwc\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=ou6XVfwc</a>\nSr Developer for Hadoop: Splunk is doing more and more work with Hadoop, and it's a completely new offering for the company and product. We're looking to add more people to the team who are excited about the space and want to improve the Hadoop landscape. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o792VfwX\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o792VfwX</a><p>Also, check out our new dev portal which we launched recently: <a href=\"http://dev.splunk.com\" rel=\"nofollow\">http://dev.splunk.com</a>","time":1325427135,"type":"comment"}