{"by":"davi","id":3413070,"kids":[3418648,3413566],"parent":3412900,"text":"Ashburn, VA/Heidelberg, Germany<p>Scientific Software Developer<p><a href=\"http://hci.iwr.uni-heidelberg.de/Jobs/\" rel=\"nofollow\">http://hci.iwr.uni-heidelberg.de/Jobs/</a><p>Ilastik (<a href=\"http://ilastik.org\" rel=\"nofollow\">http://ilastik.org</a>) is a collaborative open-source project with the aim of providing a scalable image analysis platform for the neurosciences and beyond. Current ilastik development seeks to bring the power of interactive machine learning to very large data sets.<p>Janelia Farm (<a href=\"http://www.janelia.org\" rel=\"nofollow\">http://www.janelia.org</a>), one of the premier centers for biomedical research worldwide, is funding a Scientific Software Developer (Janelia Farm Research Campus, Ashburn, VA with visits to Heidelberg University, Germany) to reach that goal quickly. Tasks include the refinement of the architecture, the integration with existing tools and the design of a graphical user interface for handling of very large microscopic data sets using image analysis and machine learning algorithms. The software developer will also support proof-of-principle studies on pioneering applications from the neurosciences, and liaise between experts at Janelia Farm and ilastik core developers at the University of Heidelberg.<p>The position requires a strong background in C++, experience in software engineering applied to large projects, and the skills to integrate existing algorithms and functionality into a unifying biomedical processing framework. Experience with python, Qt, numpy, scipy and scientific parallel programming is a plus. Good communication skills are essential to make for good cooperation both with local experts and with other programmers working remotely. Salary is commensurate with prior experience and will be highly competitive for extremely well-matched candidates.<p>The principal work place is on the beautiful campus of Janelia Farm, with regular visits to Heidelberg. The successful candidate will be in a position to help shape a project that is becoming an enabling technology in one of the most interesting fields conceivable: the deciphering of the inner workings of the brain.<p>see also:<p><a href=\"http://janelia.org/\" rel=\"nofollow\">http://janelia.org/</a>, \n<a href=\"http://www.hhmi.org/research/fellows/bock.html\" rel=\"nofollow\">http://www.hhmi.org/research/fellows/bock.html</a>","time":1325427908,"type":"comment"}