{"by":"ridejoy","id":3414043,"parent":3412900,"text":"We're looking for designers and engineers!<p>Ridejoy is a community marketplace for rides (YC S11)<p>We love well-designed experiences, we have a rapidly growing community that loves us back (and loves telling us so), and we're building a marketplace for everyone who's ever needed to get somewhere.<p><a href=\"http://www.ridejoy.com/jobs/\" rel=\"nofollow\">http://www.ridejoy.com/jobs/</a><p>We've all been employees at early-stage, venture-backed startups. We know what it's like, so we're generous with the benefits and your equity. (Plus full salaries, of course.) We're well-funded by top-tier investors, and we do things like all-you-can-eat free food, and free tickets and transportation to Burning Man.<p>We have a tight-knit team and we're looking for people who we can develop a deep mutual trust with. This is not code for \"the same as us\"; we want to build a team that's more diverse than your typical startup. We understand that a great company and a great culture depends on far more than technical aptitude.<p>Details: Located in SF. We will happily pay for and help with relocation for the right candidate.<p>For designers: As the lead designer, you'll be working closely with two engineers who care deeply about the user experience of our product, and want to let you focus on what you do best.<p>The product is very early, so you'd be shaping it from the ground floor; we want someone to help us build a design culture from the very beginning. Like everyone else we work with, we want you to teach, and to be teachable.<p>For engineers: Our current stack is Ruby, Rails, Postgres, Coffeescript, Sass, and jQuery, and we're looking to expand into iOS and Android. It's not mandatory to know these coming in; passionate generalists who can learn quickly work too.<p>PSA: Refer someone we hire, and get a thousand bucks of collaborative consumption credit! You can pick from among Airbnb, Taskrabbit, Grubwithus, Getaround, RelayRides, Tutorspree, Skillshare, and Vayable.\nLink: <a href=\"http://www.ridejoy.com/jobs/\" rel=\"nofollow\">http://www.ridejoy.com/jobs/</a>","time":1325457641,"type":"comment"}