{"by":"shrike","id":12628754,"parent":12627852,"text":"Oracle | Seattle, WA | Local or Remote (USA) | <a href=\"https:&#x2F;&#x2F;cloud.oracle.com&#x2F;en_US&#x2F;bare-metal\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.oracle.com&#x2F;en_US&#x2F;bare-metal</a><p>Are you ready to join an incredible team and shape the future of the cloud? Today we offer compute, storage and network and we are looking for people to help us build a future that will deliver what customers need in a compelling way; Solution Architects are essential to that task. As a Solutions Architect you will work directly with enterprise customers to help them understand cloud technology, understand the value of the Oracle Bare Metal Cloud and help them move their workloads from on-premises to the Oracle Bare Metal Cloud. You will take what you learn and feed that directly back to PM and engineering to help build additional products and features. Experience working at or consuming AWS, GCP, or Azure is appreciated but not required.<p>What others are saying about the new platform - \n<a href=\"https:&#x2F;&#x2F;cloudpundit.com&#x2F;2016&#x2F;09&#x2F;20&#x2F;oracles-next-gen-cloud-iaas-offering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;cloudpundit.com&#x2F;2016&#x2F;09&#x2F;20&#x2F;oracles-next-gen-cloud-ia...</a>\n<a href=\"https:&#x2F;&#x2F;www.sdxcentral.com&#x2F;articles&#x2F;news&#x2F;bare-metal-cloud&#x2F;2016&#x2F;09&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sdxcentral.com&#x2F;articles&#x2F;news&#x2F;bare-metal-cloud&#x2F;20...</a><p>We have a technical bar, candidates should have some DevOps experience, solid *nix or Windows sysadmin experience and basic skills in any popular scripting language. SAs are also responsible for writing white-papers, presenting in public and some travel to customers sites; you will be able to self-manage the amount of travel.<p>Interested? Email me your resume and a writing sample if you have one to craig . carl @ oracle . com.","time":1475511595,"type":"comment"}