{"by":"amattn","id":12629002,"parent":12627852,"text":"Collective Health, ( <a href=\"https:&#x2F;&#x2F;collectivehealth.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;collectivehealth.com&#x2F;jobs&#x2F;</a> ), San Francisco (very near caltrain), CA (Full time, ONSITE only, VISA case-by-case, see below)<p>We&#x27;re replacing health insurance with a system that members love. Using our SW, platform and services, an employer can pay doctors directly, saving a ton of money and making the employee experience amazing (with the testimonials to back it up). The company is well-funded, ~two and a half years old and growing very rapidly with sales traction. We punch well above our weight-class with experienced founders, ~250 team members (~ one quarter is engineering), and paying customers.\nOur tech stack is a mix of Go and Java components with Angular on the front end. We use a custom service bus to tie our SOA together, microservices style. We love Docker, CoreOS, postgres, automated testing, and continuos integration. We&#x27;ve got some neat in-house tools for service discovery, health checks, cluster setup and deploy and more.<p>As a company, we&#x27;re strong believers in transparency, trust and balance. As an engineering team, we believe good code is easy to read and should have a short &quot;time to understanding&quot;. We expect all of our engineers to continually teach as well as learn. We also believe that everyone should write good code, yet balance that against the need to ship.<p>We&#x27;ve got a ton of interesting problems to solve around distributed systems, data analytics and predictions, complex data modeling, ultra high-availability, security, privacy and more.<p>We&#x27;re currently looking for experienced SW engineers up and down the stack. Our biggest needs are DevOps and Backend Engineers.\nAll open jobs: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;8f7q15\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;8f7q15</a><p>If you are non-technical, but are interested in experiencing a hyper-growth startup, we also are hiring for sales, business development and other roles as well. If you care about such things, we were recently flattered&#x2F;embarrassed to be highlighted as one of fifty potential next unicorns by the nytimes: <a href=\"http:&#x2F;&#x2F;nyti.ms&#x2F;1JLKaCT\" rel=\"nofollow\">http:&#x2F;&#x2F;nyti.ms&#x2F;1JLKaCT</a><p>We&#x27;re super proud of the company mission, engineering culture and tech stack we&#x27;ve put together and would love a chance to explain it all in detail!<p>*VISA minutiae: We can transfer H1B visas. We can sponsor TN &amp; H1B1 visas in most cases. If you have another existing visa, we can probably transfer it.","time":1475512998,"type":"comment"}