{"by":"edave","id":12628672,"kids":[12629090],"parent":12627852,"text":"Converge | San Francisco, CA | Software Engineers | ONSITE | Full-time | Drones &#x2F; Mobile &#x2F; Web Apps<p>We&#x27;re a revenue-generating enterprise software startup (seed stage) from MIT that makes it easy for skilled professionals (think construction, insurance, real estate, etc) to use drones everyday in their job through a combination of incredible AI and HRI.<p>* Looking for junior or senior software engineers, and (paid) interns. Everyday, we work on tech that spans from Drones to AI to UX to Data Viz to IOT. We&#x27;re less concerned with your exact skill set and more about what you would find motivating to work on every day.<p>* We strongly prefer people who have an engineering&#x2F;science degree, or equivalent work experience. If you&#x27;ve only taken a three month class on the &quot;full stack,&quot; these positions will not be a good fit for you.<p>About Converge:<p>* Started in 2015, our founders were some of the first people to work on drones in the world, worked on the unmanned Blackhawk helicopter, and created the first mobile app ever for flying a drone (way back in 2008 at MIT…)<p>* We like people who have excelled at something outside of work, and are just downright interesting to have a conversation with.<p>* If you are looking for a keg, ping pong table or bro culture, we&#x27;re not going to be a good fit for each other.<p>* Our team is small, we&#x27;re very deliberate about hiring- you would be in the first 10 employees.<p>To get started, please get ahold of via the instructions here: <a href=\"https:&#x2F;&#x2F;www.cvg.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cvg.io&#x2F;careers&#x2F;</a><p>If you come from an underrepresented group in tech, please get in touch w&#x2F; me (@edave) directly via my HackerNews profile.<p>Some buzzwords for you keyword searchers: iOS, Android, Fullstack, Rails, Python, Ruby, React, ES6, Angular, Machine Learning","time":1475511191,"type":"comment"}