{"by":"bencpeters","id":12628722,"parent":12627852,"text":"Ardusat | <a href=\"https:&#x2F;&#x2F;www.ardusat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ardusat.com</a> | Salt Lake City, UT | Full-stack Engineer, Front End Engineer<p>Come help change the way science and math are taught in schools! Ardusat is a growing educational technology company providing engaging experiences to science and math students by creating technology, products, and curriculum preparing them to run custom experiments on real satellites in space. With over $6B available in public and private STEM (Science, Technology, Engineering, and Math) grants, this is an exciting space to work in. We are a small (9 person) team with a successful round of seed funding and a lot of really promising district pilot programs. Everyone at Ardusat is here because we believe parts of the education system are broken, and need to be fixed. We want our work to impact students’ lives all over the world by cultivating more interest in math, science, and technology.<p>We&#x27;re looking for an experienced engineer to work on building out our student&#x2F;teacher software features and help us scale as we grow. We&#x27;ve got a great working platform that is used by schools around the world to conduct science experiments, create and discover curriculum, and help manage, document, and assess Maker projects in the classroom. We have tons of ideas, but we need help taking this tool set to the next level. As an Ardusat software engineer, you would be responsible for architecting major new features and portions of our system - we&#x27;re not just ticking off a bug list here. The ideal candidate is someone who has experience building web applications from the ground up and is excited by owning a large portion of product direction and design decisions.<p>Development Process:\nOur development process is organized around 2-3 week sprints, and we have 2 in-person engineering tag ups a week. We are a small team and encourage autonomy, so we do asynchronous daily updates (accomplishments, blockers, collaboration needs) but try to avoid getting too bogged down in process or unnecessary meetings. We value accomplishments, not time-in-office, so we try to optimize our process around allowing flexibility and personal accountability.<p>Tech Stack:\nOur website and API are powered by Ruby on Rails, our experiment tools and platform use Angular.js, our real-time features use Node.js, and we have a handful of microservices related to our data pipeline using Python. On the database side, we use Redis to coordinate services and Postgres for our primary data store. We’re especially interested in candidates with Ruby, Javascript, and Angular experience, but for the right candidate we’re open to other languages&#x2F;platform experience with a demonstrated track record for learning new technology. Although everyone wears a lot of hats at an early startup like Ardusat, this position will be more backend focused, so experience with server management, cloud platforms (we use AWS), Docker, CI, or API design is a plus (although not required). Experience with &quot;maker&quot; technologies including Arduino, Raspberry Pi, 3D printing, etc. is also a plus.<p>Apply or request more details: jobs@ardusat.com\n<a href=\"https:&#x2F;&#x2F;www.ardusat.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ardusat.com&#x2F;jobs</a> for more details.","time":1475511412,"type":"comment"}