{"by":"thenipper","id":12628189,"kids":[12633031,12628217],"parent":12627852,"text":"Mercy Corps&#x2F;Gaza Sky Geeks | Product Manager | Gaza, Palestine | ONSITE | Full Time<p>We are the first and only startup accelerator in Gaza run by Mercy Corps and founded with an initial grant from Google; and now a tech hub in the Google for Entrepreneurs partner network.<p>Are you interested in: \n- Scaling up a fresh market in the field of ‘Product Development &amp; Management’?\n- Inspiring and teaching eager entrepreneurs how to launch their products?\n- Expose yourself to lot of startup opportunities within different country in the Middle East?<p>Have you built demonstrated ability to launch products successfully using an iterative, incremental, user-focused, and data-driven approach?<p>Reach out to us here: <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=o4IL3fwk&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=o4IL3fwk&amp;s=Hacker_News</a><p>Mercy Corps&#x2F;Gaza Sky Geeks | Software Engineering Manager | Gaza, Palestine | ONSITE | Full Time\nWe are the first and only startup accelerator in Gaza run by Mercy Corps and founded with an initial grant from Google; and now a tech hub in the Google for Entrepreneurs partner network.<p>Are you interested in:<p>- Scaling up a fresh market and charting new territory while iterating on your own approach?<p>Have you built an experience as top notch software engineering manager with 8+ years of experience including managing teams of engineers?<p>Shipped multiple products successfully using an iterative, incremental, user-focused, and data-driven approach?<p>Reach out to us by visiting: <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=o6IL3fwm&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?cj=o6IL3fwm&amp;s=Hacker_News</a><p>Mercy Corps is a leading global organization powered by the belief that a better world is possible. In disaster, in hardship, in more than 40 countries around the world, we partner to put bold solutions into action—helping people triumph over adversity and build stronger communities from within. Now, and for the future.","time":1475508697,"type":"comment"}