{"by":"john_cogs","id":12628576,"parent":12627852,"text":"HBC Digital | New York, NY | Multiple Roles | ONSITE VISA<p>WHO WE ARE<p>HBC Digital drives the digital retail&#x2F;ecommerce and digital customer experience across all HBC retail banners including Hudson’s Bay, Lord &amp; Taylor, Saks Fifth Avenue, Saks OFF 5TH and Gilt. While it’s clear that the future of retail will rely heavily on new technologies and the internet, we are still discovering how this will pair with in-store shopping to power commerce in the coming years and decades. With millions of customers, both online and offline, HBC Digital is positioned at the center of this reinvention.<p>OUR CULTURE<p>A recent survey of HBC Digital employees about our culture revealed the three most common responses were fast-paced, team-oriented and growth.<p>Fast-paced – Our employees are constantly tackling new problems and challenges that result from working at a company growing rapidly through acquisitions and in an industry that is continuously evolving.<p>Team-oriented – Our employees work on small, cross-functional teams with a high level of autonomy and ownership. Projects are run in an Agile fashion. We keep meetings to a minimum so people can focus on getting work done. HBC Digital also offers a flexible work environment, great work-life balance and a growing number of perks and career development opportunities.<p>Growth – Our employees are encouraged to use 20% of their time for learning new technologies. HBC Digital also has a strong history of developing our employees and opening new doors for them to grow their careers.<p>HOW WE WORK<p>You can expect to be working with a mix of Java and Scala. If you have never worked with Scala, don’t worry, we’re perfectly happy to help you get up to speed. On the Scala side of things, we are heavily leveraging Akka and Play, as well. There is also some Clojure in our ecosystem, so you may get the chance to work with that as well.<p>You’ll have a choice of a Mac or a PC for your laptop. When we move into our brand new office in August, you’ll also get a super comfy Herman Miller Aeron chair. The new space will be flooded with tons of natural light and feature amazing views of Lower Manhattan, New York Harbor and New Jersey. The open floorplan has plenty of flex space for impromptu meetings and cozy nooks for when you need to tune out. As for tools, you’re encouraged to use whatever editors, IDE’s, etc. that you’re most comfortable with.<p>Please email our Tech Evangelist, john_coghlan@s5a.com, if you&#x27;re interested.","time":1475510624,"type":"comment"}