{"by":"gabraham21","id":12637428,"parent":12627852,"text":"Blue Apron - NYC - Full Time - ONSITE<p>Blue Apron (<a href=\"http:&#x2F;&#x2F;www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is an NYC-based startup delivering original recipes, and pre-portioned, premium seasonal ingredients needed to prepare them.<p>Our engineering team creates software to manage the forecasting, purchasing, preparation, and shipment of new fresh ingredients every week. The nature of our business carries with it unique supply chain and logistical challenges at a large scale that require purpose-built solutions and data analysis. We&#x27;re now shipping over 8 million meals a month nationwide up from 500,000 just over 18 months ago.<p>Current stack: Ruby, Rails, Ember, Backbone, PostgreSQL<p>We&#x27;re hiring:<p>- Sr. Frontend Engineers: Experience building out front end architecture; JavaScript MV* experience (Ember would be awesome but not required) - <a href=\"http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=14848\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=14848</a><p>- Software Engineers&#x2F;Leads&#x2F;Mgrs: Ruby, Rails, Ember - <a href=\"http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=11091\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=11091</a><p>- iOS Engineer: currently iPhone app built in Swift; Swift exp. a plus - <a href=\"https:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=74053\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=74053</a><p>- Product Designer: looking for someone who is equally strong with the visual aspects of design as well as thinking through UX flows and what the simplest, most elegant experience for the user could be - <a href=\"https:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=118839\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blueapron.com&#x2F;pages&#x2F;jobs?gh_jid=118839</a><p>This role comes with health, dental, vision, life insurance, a flexible vacation policy, and competitive salary and equity. To apply, visit our site (blueapron.com&#x2F;jobs) and drop an application; it only takes about 60 seconds.<p>*While the numbers have increased, this article provides insight into we operate: <a href=\"http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;alexkonrad&#x2F;2015&#x2F;10&#x2F;14&#x2F;inside-blue-apron-and-the-meal-kit-rush&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;alexkonrad&#x2F;2015&#x2F;10&#x2F;14&#x2F;inside-blu...</a>","time":1475602606,"type":"comment"}