{"by":"kqxxjzptdujt5n7","id":12637311,"parent":12627852,"text":"Red Balloon Security <a href=\"http:&#x2F;&#x2F;redballoonsecurity.com\" rel=\"nofollow\">http:&#x2F;&#x2F;redballoonsecurity.com</a> | ONSITE | Relocation available | Security Researcher &#x2F; Systems Software Engineer | New York, NY<p>Our interview process consists of two technical questions; If you answer&#x2F;solve the two questions, we bring you to New York to party with us and see if you&#x27;re culturally a fit for our hax0r culture.<p>Red Balloon Security is a cyber security company headquartered in NYC. Our mission is to provide embedded device manufacturers with strong host based defense. Embedded devices are the non general-purpose computers that run the modern world. We believe all embedded devices require stronger protection against malware and intrusions. The company was started in 2011.<p>Mr Robot Visits Red Balloon Hacker Fortress | <a href=\"https:&#x2F;&#x2F;motherboard.vice.com&#x2F;read&#x2F;the-hacker-who-turns-office-equipment-into-bugging-devices\" rel=\"nofollow\">https:&#x2F;&#x2F;motherboard.vice.com&#x2F;read&#x2F;the-hacker-who-turns-offic...</a><p>Job Description\n * Design and implement host-based defense software for black-box embedded devices. \n * Design and implement automated hardware&#x2F;software testing infrastructure.\n * Conduct offensive and defensive research on embedded hardware and software.\n * Contribute to the FRAK (Firmware Reverse Analysis Konsole) framework.\n * Perform hardware and software reverse engineering on embedded devices.\n * Automate vulnerability identification for embedded software.<p>Required Skillz\n * BA&#x2F;BS required in computer science, engineering or related major.\n * Proficiency in hardware and software reverse engineering.\n * Experience with low-level software design and implementation.\n * Understanding of modern software design and engineering practices.\n * High level of self-initiative and self-motivation.\nPreferred Skillz\n * Experience with ARM &#x2F; MIPS &#x2F; PPC assembly languages.\n * Strong understanding of OS design and implementation.\n * Strong understanding of software vulnerabilities and practical exploitation techniques.<p>If you think you have what it takes: email jobs @ redballoonsecurity.com subject:&quot;Security Researcher (ycombinator)&quot;","time":1475601955,"type":"comment"}