{"by":"lherta","id":12630030,"parent":12627852,"text":"Spiral Genetics | Seattle, WA | Senior C++ Engineer | Full Time<p>Spiral Genetics is a funded Seattle-based startup that makes high performance bioinformatics software. We specialize in large-scale DNA data analysis for medical, pharmaceutical and agricultural research.\nWe are looking for a Senior C++ Software Engineer to help develop our next generation DNA analysis engine. Compensation will be competitive, dependent on experience.<p>Tech + Science = Awesome<p>Spiral believes that new advances in DNA research can only be achieved with technological and scientific excellence. We have built a disruptive platform that allows researchers to detect complex genetic variations with unprecedented speed and accuracy. Our patented approach identifies structural variations that are currently undetectable using conventional algorithms.<p>Impact Matters<p>We love tech. We also love impact. We build technology to change the world. Researchers use our software for a wide variety of applications, from children’s cancer diagnosis to crop fungal resistance to detection of rare diseases to biofuel development.<p>Requirements:<p>* Computer Science degree or equivalent<p>* 8+ years professional programming experience<p>* 5+ years C++ experience (we use C++11, STL, Boost)<p>* Python fluency; Boost.Python experience a plus<p>* Experience with map&#x2F;reduce in a high volume, large scale data processing app<p>* Excellent analysis and problem-solving skills<p>* Ability to debug multithreaded, multiprocess, multi-node applications<p>* Expert Linux command line skills<p>* git (we use Bitbucket and git flow)<p>* Deployment experience to AWS, Azure, or other cloud environment<p>* A willingness to learn new science in our emerging field<p><a href=\"http:&#x2F;&#x2F;www.spiralgenetics.com&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spiralgenetics.com&#x2F;about&#x2F;careers&#x2F;</a><p>Apply: careers@spiralgenetics.com","time":1475519424,"type":"comment"}