{"by":"ross_at_premise","id":12630522,"parent":12627852,"text":"Premise Data | Seattle, WA; Portland, OR; San Francisco, CA | Staff Front End Engineer | ONSITE<p>Premise is a mobile data and analytics platform bringing visibility to the world’s hardest-to-see places. Human-directed and machine-refined, Premise indexes and analyzes millions of observations captured daily by our global network of contributors, unearthing connections between them to map reality on the ground, and help global decision-makers move faster and make more impactful decisions.<p>We’re a passionate, tight-knit, hyper-ambitious team in San Francisco, Seattle and Portland. We love technology, and it shows in the craftsmanship of the products we create. Our network is currently comprised of more than 30,000 individuals in over 200 cities in over 35 countries, that execute on contracts for our customers who are among the world’s largest commercial, NGO, financial and governmental institutions. Internally, our diversity mirrors the global nature of our work: we come from 30 countries, speak more than 14 languages, and believe in the value of life experience that an unconventional background inherently brings. What unites us is our innate curiosity and collective ambition to build technology that ultimately has measurable human impact.<p>I’m a front end engineer with a secondary focus on building out our engineering office in Seattle. We’re looking for all sorts of scientists and engineers, but I am most interested in senior front end engineers with 5+ years of heavy JavaScript and complex web application development experience. Extra emphasis on those who currently reside or are looking to relocate to Seattle, though I’m also happy to hear from candidates for both our SF and Portland offices. Our front-end stack includes some really fun and powerful technology, including Flow, React, Redux, and Jest.<p>Some additional details and notes:<p>* Specific to front end, we are looking for experienced, senior candidates only at this time. Please no recent university &#x2F; coder school grads.<p>* All of the usuals are included: free daily lunch, competitive compensation and benefits, equity in the company.<p>* Premise currently has $61 million in VC funding, with the most recent round being a Series C of $50 million in September 2015.<p>* PLEASE NO RECRUITERS I am looking to speak directly with candidates only. 3rd party recruiters will be ignored.<p>If you’re interested or have any questions, shoot me a message: ross ( at ) premise ( dot ) com.","time":1475522826,"type":"comment"}