{"by":"theuri","id":12631976,"parent":12627852,"text":"John Hancock Digital | iOS Developer (Swift) &amp; Full-Stack Developer (Ruby&#x2F;Rails) | San Francisco, CA | <a href=\"http:&#x2F;&#x2F;www.johnhancockdigital.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.johnhancockdigital.com</a><p>iOS DEVELOPER (Swift)<p>We are seeking an iOS Engineer who will own our core mobile app experience. You will ideally have experience in Swift or be a fast learner interested in building expertise.<p>You will be responsible for actively contributing to, testing and maintaining an innovative mobile experience that can change the lives of millions of families. We’re looking for someone with a proven track record of delivering very user-friendly, well-engineered and tested software, coordinating well with API teams, who thrives in a fast moving startup and environment.<p>You will be responsible for developing, testing and maintaining critical application features that seamlessly engage users and drive better financial behavior.<p>As a nice to have, we are looking for candidates with either experience or interest in participating in Android development over time.<p>FULL STACK DEVELOPER (Rails)<p>We are seeking a Full-Stack Software Developer with experience in back-end and front-end software development, including work building and consuming APIs. In the role, you will be creating the engine that powers our automated money management platform and shapes a flawless, engaging experience for our mobile application users.<p>You will be developing, testing and maintaining some of our most important and ambitious features, and you should have a proven track record of delivering well-engineered and tested software at scale. You should also be excited and comfortable juggling multiple priorities in a fast-paced environment.<p>ABOUT JOHN HANCOCK DIGITAL\nWe serve as an independent digital innovation startup within John Hancock, focused on scaling our technology to improve the financial lives of millions of customers in the US and globally. We are an agile, fast-moving startup team based in San Francisco, that leverages the brand, support and resources of John Hancock and its Manulife parent company to ship products that positively impact the lives of customers around the world.<p>Our mission is to use technology (machine learning and applied behavioral finance) to enable millions of middle-class households to increase their savings rates, make better financial decisions and achieve retirement security.<p>To start a conversation - drop us an email at hello@johnhancockdigital.com with a brief note about yourself and a resume.<p>You can also read more here: <a href=\"https:&#x2F;&#x2F;www.johnhancockdigital.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.johnhancockdigital.com</a>","time":1475534643,"type":"comment"}