{"by":"browseatwork","id":12633783,"kids":[12633862],"parent":12627852,"text":"TokBox | San Francisco, CA &#x2F; London, UK | Onsite | Engineering, Business Analytics, Business Development, Product<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;</a><p>TokBox makes it easy for developers to embed real-time video, voice, and messaging into their native and web applications. We build the premier WebRTC platform. Want to build the functionality of Google Hangouts, Skype, or Facebook Live? Use us! We have great clients from individual developers to massive players in tech, entertainment, education, and many other industries (customers include Mozilla, the Minerva Project, Chegg, esurance, Major League Baseball, Double Robotics, Fox Sports, and many YC companies). We were acquired by Telefonica 4 years ago. It hasn&#x27;t changed the culture much, and has helped us reach more customers around the world.<p>The product is industry leading, the space is growing rapidly and getting hot, and the people are great. It&#x27;s an awesome group of 100 or so- nice, smart, skilled. We are laid back and have a sense of humor. Minimal politics. Good salary and benefits in a relaxed, enjoyable environment. Actual work-life balance.<p>We&#x27;re looking for 2 product managers - one focusing on industry verticals (e.g. the unique needs of education, or financial services,  or media companies) and a developer experience PM (ideal for former engineers or evangelists). In engineering, we’re looking for a DevOps engineer to keep things up and running, a media focused backend engineers to expand and maintain our robust, low-latency media server and other systems, a test engineer to automate testing (especially for mobile). Lastly, we&#x27;re looking for 2 key engineering roles with a direct customer-facing aspect: a solutions architect who will build things for key partners and customers, and a customer success engineer to help champion user needs, answer support requests, and help users solve problems. In business analytics, we&#x27;re looking for someone to join a small but strong team to help keep us informed and making smart choices. Lastly, in BD, we’re looking for someone with experience in the tech and startup world in London.<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;careers</a><p>or<p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF</a><p>Come join us!","time":1475564706,"type":"comment"}