{"by":"kkl","id":12631584,"kids":[12631717],"parent":12627852,"text":"Praetorian | Austin, Texas | REMOTE (For principal and staff positions)<p>Praetorian is different. We are a collective of highly-technical engineers focused on helping our clients solve their most difficult security problems. Rather than break things over and over, our goal is to have an actual impact in making the world a better place. 100% privately owned and self-funded, we are focused on doing the right thing over short term profits. Where other companies pay lip service to vision statements and principles, we are unwaveringly guided by our core values, which are:<p><pre><code>    * Put the client first - Everything else will work out.\n    * Enjoy the work you do - Passion eats education and experience for breakfast.\n    * Be humble - True significance is only achieved as a team.\n    * Embrace the wobble - There is existential urgency to our work. We need to move and adapt quickly.\n    * Walk with a swagger - Relish the new challenge.\n    * Default to open - The right decision is in the data. Share all of it.\n    * Orient to action - Do not wait to be directed. Engage.\n    * Performance matters - We are a small company intent on doing big things. Every individual effort counts.\n    * Stop evil - Our mission is to make the world a safer and more secure place.\n    * Make craters - Our time on this earth is short. Leave an impact.\n</code></pre>\nAlthough small, we are growing rapidly, with 50% YOY growth for the past three years. That growth is based on fantastic clients and their support. Our annual net promoter score is consistently over 80%. By comparison, Apple is typically in the mid 70s, and Amazon is usually in the high 60s.<p>We are looking for experienced engineers that share our values. We offer our staff a generous benefits package, including:<p><pre><code>    * Competitive salaries\n    * Quarterly bonuses, 4% 401k matching, stock options\n    * Health insurance, and options for vision, dental, ADD, Short term disability, and life\n    * 20% Bench time for research, tool development, or training\n    * Flexible vacation policy\n    * Low travel requirements. Seriously. No more than 20% for those in network security and nearly 0% for those in application security.\n    * Company contributions to training and conferences\n    * Opportunities for rapid growth and advancement based on merit.\n</code></pre>\nIf you’d like to learn more, please visit our career page at: <a href=\"https:&#x2F;&#x2F;www.praetorian.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.praetorian.com&#x2F;company&#x2F;careers</a>. \nTake a look at our tech challenges too, as we’ll ask you to complete one early in the interview process: <a href=\"https:&#x2F;&#x2F;www.praetorian.com&#x2F;challenges&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.praetorian.com&#x2F;challenges&#x2F;</a>","time":1475530972,"type":"comment"}