{"by":"phantomas1234","id":12650913,"parent":12627852,"text":"DTU Biosustain | Copenhagen Area, Denmark | Onsite | Full-time | VISA\nFull-stack Web Developer for Synthetic Biology Design Platform\nWith advances in synthetic biology, genomes can now be edited at unprecedented speed and fidelity allowing making multiple changes in the same genome at the same time. This increases the need for computational tools to design cells and communities of cells analogous to the tools used in Computer Aided Design (CAD) of cars, buildings and other man-made objects. The European Commission has awarded 6.3 million Euros to a four-year collaborative project to build a CAD tool for data-driven design of cells and microbial communities. Applications will range from human health to sustainable production of chemicals.<p>Our web stack currently, in no specific order: AngularJS (soon Angular2), Angular Material, Typescript, Python 3, PostgreSQL, Docker, gRPC &amp; protobuf. The API is written in Python and our scientists write most of their algorithms in Python. We currently use AngularJS for the front-end, however this is not set in stone. As visible on our GitHub org (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;biosustain\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;biosustain</a>), we are very dedicated towards releasing most of our tools as open source software.<p>We will help with getting a VISA, as well as with administrative issues related to relocation. Our working language is English. We are a very diverse workplace; 70% of our staff have an international background. The salary depends on qualifications and needs to be agreed by your union representative -- so I cannot give an official range -- but a rough personal estimate is 420k-500k DKK.<p>So if this sparked your interest, come and join a diverse team of scientists and engineers to work on something that matters.<p>To read more and apply, go to:\n<a href=\"http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;about&#x2F;vacant-positions&#x2F;job?id=2ec2e118-15ab-44c4-85a3-508e9963bccd\" rel=\"nofollow\">http:&#x2F;&#x2F;www.biosustain.dtu.dk&#x2F;english&#x2F;about&#x2F;vacant-positions&#x2F;...</a>","time":1475741416,"type":"comment"}