{"by":"lenan","id":12695025,"parent":12627852,"text":"Amazon Lab126, (located in Sunnyvale, CA) is an inventive research and development company that designs and engineers high-profile consumer electronics. Lab126 began in 2004 as a subsidiary of Amazon.com, Inc., originally creating the best-selling Kindle family of products. Since then, we have produced groundbreaking devices like Fire tablets, Fire TV and Amazon Echo. What will you help us create?<p>The Role:<p>As a Software Development Engineer for the Hardware Development, Systems and Infrastructure Team, you will own critical software platforms used by Amazon&#x27;s Hardware Development teams.<p>These systems are heavily used by both internal and external customers alike and have aggressive SLAs -- which means architecting a scalable, fault-tolerant system is essential. You will engage with an experienced cross-disciplinary staff to conceive and design innovative solutions. You must be responsive, flexible and able to succeed within an open collaborative environment. You will take part in designing solutions to hard problems across a global infrastructure platform. You will work closely with multiple DevOps teams to drive the SDLC from concept to launch and ensuring the highest level of quality for your deliverables.<p>As a software development engineer, you will:<p>Design, develop and implement internal tools of hardware engineering systems \nWork with new technologies to bring exceptional user experience \nBe responsible for software design and architecture \nDeliver investigation plans and reports, architectural documents, design specs, software and firmware source code, and build scripts \nPerform tasks including debug, bring-up, prototype and production software development \nCollaborate with both software and hardware engineering teams<p>Internal job description\nBasic qualifications\nBachelor&#x27;s degree and&#x2F;or Master&#x27;s degree in Computer Science.\n3+ years of experience as a software development engineer.\n3+ years of experience coding in Python and&#x2F;or Java.\n3+ years of multidisciplinary experience working with software development, infrastructure and QA teams.<p>SEND RESUMES TO LENAN@LAB126.COM","time":1476294533,"type":"comment"}