{"by":"lenan","id":12695054,"parent":12627852,"text":"Amazon Lab126 (located in Sunnyvale, CA)| On-Site | Full time\nThe Role:<p>Do you want to shape the future of the Amazon Smart Home and Internet of Things space? Come and join us! Our team is developing cutting-edge technologies to define the smart home space, leveraging the Amazon Alexa speech platform and Amazon Web Services. We are looking for an intrepid problem-solver to dive into an ambiguous problem space and design and deliver innovative software solutions that put the &quot;Smart&quot; in Smart Home.<p>You&#x27;ll be digging into the possibilities unlocked when we embed technology into internet-connected, physical things in the home. If you want to be at the hub of enabling the next wave of innovation in technology, we have a role for you.<p>As a Software Development Engineer - Cloud, you will be part of an experienced cross-disciplinary team designing and building new technology and bring to market innovative software solutions for consumers.<p>This hands-on position requires broad engineering competence and in-depth technical knowledge of cloud software development, as well as demonstrated experience successfully planning, organizing, and conducting software development projects in a dynamic environment. \nThe ideal candidate is passionate about new opportunities and has a demonstrable track record of success developing and building distributed systems and applications. In this role you will:<p>Provide technical leadership and contribute to the definition, design, implementation, and release of custom cloud software solutions\nDesign and build innovative and highly scalable cloud services\nRapidly prototype and iterate on new software and services for the Smart Home<p>Internal job description\nBasic qualifications\nBachelor’s degree in Computer Science or related field\n3+ years of experience doing hands-on software development\n2+ years of current experience working with distributed systems or applications\nExperience developing and releasing cloud software services for scalability, performance and reliability\nKnowledge of REST architecture for web services\nData analysis and debugging skills\nCoding skills in Java<p>SEND RESUMES TO LENAN@LAB126.COM","time":1476294717,"type":"comment"}