{"by":"Tablet_Hotels","id":12710360,"parent":12627852,"text":"Tablet Hotels | New York, NY | Onsite | Fulltime | Salary + Equity | Backend Lead, Frontend Lead, iOS<p>Our stack: Python 2.7&#x2F;Flask, MySQL&#x2F;SQLAlchemy, Unix&#x2F;FreeBSD, React.js, Swift<p>Tablet (www.tablethotels.com&#x2F;en&#x2F;careers) was founded in the year 2000 by Laurent Vernhes and Michael Davis, a pair of new-media veterans in search of a cure for boring travel and an antidote to the internet’s most common affliction: an overdose of options. Our users trust our taste — we do the hard work of selecting only the most extraordinary hotels, and we make booking them as painless as it can be. Sixteen years on, Tablet is still growing fast, and for that we credit three things: a mission with resonance, a lot of hard work, and — perhaps most important — an extremely talented team. Our New York office doubled in size in 2011, and we’re not done expanding yet.<p>---<p>On the backend: We’re tackling a third party integration which will more than double our inventory and it requires our SOA become fully distributed, an elimination of technical debt, cloud migration, and frontend redesign. We’re seeing more traffic and bookings than ever before and gearing up for an influx of traffic and users while venturing into new territory like personalization&#x2F;recommendations.<p>Backend Lead interview: Recruiter information call&gt;Head of Tech call&gt;Two onsite interviews<p><a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2dcBsDt\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2dcBsDt</a><p>---<p>On the frontend: With our backend integration underway it’s a good time to architect and rebuild the site which includes overhauling pages with react.js, revising login authentication with Web Tokens, and developing a testing suite with jest.js.<p>Frontend Lead interview: Recruiter information call&gt;Frontend Engineer call&gt;Two onsite interviews<p><a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2bB9cc7\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2bB9cc7</a><p>---<p>On mobile: Our recently launched iOS app has been featured twice in the app store and continues to grow in bookings. We&#x27;re building out the next iteration to supplement the booking experience.<p>iOS Engineer interview: Recruiter information call&gt;iOS Engineer call&gt;Coding assugnment&gt;Onsite interview<p><a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2cTb1yn\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2cTb1yn</a>","time":1476471955,"type":"comment"}