{"by":"dsr_","id":15385675,"parent":15384262,"text":"Smartleaf | Senior Software Developer | Boston (Cambridge) | ONSITE, Full-time<p>We are making it possible for all investors to get the level of portfolio oversight and customization that was once the exclusive preserve of the ultra-wealthy. Your work on this system will directly impact our mission to democratize wealth management, lower costs and improve service since 1999.<p>We are looking for a steady producer who is friendly, generous with their attention and knowledge and eager to make a difference to both customers and team members.<p>You will work in a team of 5 developers, responsible for our customer-facing application and support. You will participate in all aspects of design, implementation, peer code review, testing and bug fixing. Your first mission will be to help us scale out our trading API services, focusing on handling large volumes of requests in a multi-tenant application.<p>This position is mostly backend work, with some front-end support.  Financial analysis is handled by a separate development team; our team handles all other aspects of the application from the GUI and storage of customer data to automating complex workflows.<p>We would like to see:<p>* Experience with Rails or similar web development frameworks.<p>* A solid grasp of design and architecture. (Experience with API design is a plus!)<p>* Experience with a diverse set of technologies, backend integrations and scaling large systems, as well as experience supporting a mature product.<p>* An enthusiasm for tracking down and solving problems in a complex system with interdependent data structures.<p>* Thorough testing habits.<p>* Around 5+ years relevant post-bachelors’ experience.<p>Most importantly, we are looking for candidates who are clever, competent and kind.<p>A financial services background is NOT required.<p>We offer competitive compensation; comprehensive health and dental coverage; three weeks paid time off, plus holidays; flexible office hours.<p>Please send a cover letter and resume to future@smartleaf.com in plain text or PDF. In your cover letter, please tell us about an interesting technical problem that you have solved. Questions are welcome–we look forward to hearing from you!","time":1506964059,"type":"comment"}