{"by":"cf_pentesting","id":15384878,"parent":15384262,"text":"Coalfire Labs | Penetration Testers | Sterling, VA | ONSITE | Fulltime<p>Coalfire is composed of highly specialized security testers with a passion for enhancing system security postures. Our team members actively participate in the information security community and have released toolsets, blog posts, and whitepapers. Our team members have presented at numerous industry conferences, including BlackHat, DefCon, ShmooCon, BlueHat, DerbyCon, 44CON, and numerous BSides, about offensive and defensive operations as well as the tools and capabilities we create and share. Come join an amazing technical security team who makes a difference in the information security industry and consistently pushes the limit of offensive and defensive security capabilities. We&#x27;re currently seeking Mid - Sr Penetration Testers to join our team.<p>What you’ll do:<p><pre><code>    Provide expertise in focusing on network and Web application tests, code reviews, social engineering, penetration testing, digital forensics, application security, physical security assessments, and security architecture consulting\n    Provide hands-on, penetration testing and Red Team engagement expertise\n    Participate in Red Team operations, working to test defensive mechanisms in an organizations\n    Simulate sophisticated cyberattacks to identify vulnerabilities\n</code></pre>\nWhat you’ll bring:<p><pre><code>    Experience in information security with web application or network penetration testing experience.\n    Experience carrying out and participating in Red Team engagements\n    Develops scripts, tools and methodologies to enhance Coalfire’s Red Team processes\n    Hands-on experience with scripting languages such as Python, Shell, Perl, or Ruby\n    Reverse engineering malware, data obfuscators or ciphers\n    An aptitude for technical writing, including assessment reports, presentations and operating procedures\n    Strong working knowledge of at least two programming and&#x2F;or scripting languages\n    Strong understanding of security principles, policies and industry best practices\n</code></pre>\nWhy Join us?<p>Coalfire’s high energy, challenging, and fast-paced work environment will keep you engaged and motivated. Work-life balance is a core priority at Coalfire – we work hard and we play hard, and the two often overlap.<p>Email patrick.hurd@coalfire[.com] with subject line including &quot;HN - Who is Hiring&quot; for more information.","time":1506960044,"type":"comment"}