{"by":"alexashopping","id":15385008,"parent":15384262,"text":"Amazon Alexa Shopping | Software Development Engineers | Seattle, WA and Palo Alto, CA | FULLTIME | ONSITE<p>Here at Alexa Shopping we are working hard and pioneering in many areas to enable shopping in everyday life.<p>We allow customers to instantly order whatever they need, by simply interacting with their Smart Devices such as Echo or Fire TV. Our services allow you to shop, no matter where you are or what you are doing, you can go from &#x27;I want that&#x27; to &#x27;that&#x27;s on the way&#x27; in a matter of seconds. We are seeking the industry&#x27;s best to help us create new ways to interact, search and shop.<p>The Alexa Shopping group is seeking talented and experienced engineers to design and develop Natural User Interface (NUI) shopping experiences and algorithms in Seattle and Palo Alto. You&#x27;ll have the freedom (and encouragement) to experiment, improve, invent, and innovate on behalf of our customers. You will have an impact on Amazon&#x27;s new devices and the way shopping is done in the area of IoT. And finally you will have the satisfaction of being able to look back and say you were a key contributor to something special from its earliest stages.<p>We have many challenges ahead of us, and we like taking risks so we can move quickly. We don&#x27;t always get it right, but that&#x27;s okay, our agility allows us to quickly learn, respond to customer needs, and keep building. Our team ships features that deliver customer value every sprint.<p>If you are interested in joining our team in Seattle or Palo Alto, please reach out with &quot;HN&quot; in the subject and the location you are interested in.<p>Contact:<p>alexashoppingjobs@amazon.com<p>Here are a few of our open positions:<p><a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;577780&#x2F;software-development-engineer-alexa-shopping\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;577780&#x2F;software-development-...</a> (Seattle) and <a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;549698&#x2F;software-development-engineer-ii-alexa-shopping\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;jobs&#x2F;549698&#x2F;software-development-...</a> (Palo Alto)<p>Note: we are unable to hire interns or recent college graduates for these roles. Please apply here if you are seeking an intern or college graduate role: <a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;team&#x2F;university-tech\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;team&#x2F;university-tech</a>","time":1506960587,"type":"comment"}