{"by":"TheEzEzz","id":15385573,"parent":15384262,"text":"Standard Cognition | Researchers and Engineers | San Francisco, CA | Full-time, onsite | 120k-180k<p>We&#x27;re using machine vision to build zero-friction checkout for stores. Walk in, grab stuff, and leave. Our system figures out what you grab and charges you automatically. Checkout what our real-time inference engine looks like <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=yeS8TJwBAFs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=yeS8TJwBAFs</a><p>If you love hard problems, machine vision, and building products that change the way we interact with the world we&#x27;d love to talk with you. We&#x27;re a young team that&#x27;s moving fast and looking for people that love to rapidly iterate on challenging ideas. We&#x27;re a YC company that&#x27;s VC backed, 7 strong, and looking to grow. Two of our cofounders are UCSB alumns, so we&#x27;d love to hear from you.<p>Research Candidates<p>We&#x27;re looking for strong deep learning and machine learning researchers to help lead our research programs. We view deep learning as a science, not an art, and we&#x27;re looking for strong scientists: people that can generate, test, and refine hypotheses rapidly, with minimal bias. Fail fast, fail often. That&#x27;s the mantra of startups, and that&#x27;s the mantra of science. Help us rapidly generate targeted hypotheses and approaches for building a system that can comprehend the massive amount of video footage we feed it. If you&#x27;re expertise isn&#x27;t in machine vision but you&#x27;re a passionate tinkerer or researcher in ML or deep learning we&#x27;re happy to get you up to speed on the state of the art in vision.<p>Engineering Candidates<p>We&#x27;re looking for strong Python engineers to help develop and productionize soft real-time algorithms in our vision pipeline. We have lots of big problems to solve. Engineers looking to lead and take on hard projects are welcome. Take cutting-edge research that requires massive clusters to work and make it run in real time on a single machine. Take disparate research results and merge them together into more powerful models. Build a massively parallel system that can comprehend 100Gbps of raw footage streaming from hundreds of cameras.<p>Experience in some of these areas is a plus: high performance and scientific computing, cluster management, deep learning, image processing, performance optimization, algorithmic research. Experience with some of these tools is a plus: cython, numpy, TensorFlow or some other deep learning framework, opencv, nix. If you&#x27;re smart, passionate, and can learn fast on the job, we&#x27;re happy to train an engineer in any and all of these areas.","time":1506963526,"type":"comment"}