{"by":"ElenaADEX","id":15384852,"parent":15384262,"text":"Berlin, Germany | The ADEX GmbH (DMP, Big Data)| Senior DevOps Engineer | ONSITE | <a href=\"https:&#x2F;&#x2F;short.sg&#x2F;j&#x2F;1177207\" rel=\"nofollow\">https:&#x2F;&#x2F;short.sg&#x2F;j&#x2F;1177207</a><p>At ADEX we are working on a real Big Data scale (we are talking about processing 400 TB of raw data in real time). We analyze billions of requests daily using one of the biggest Big Data clusters in Europe (110 local servers). We love automation, so we use tools like Puppet and Cloudera on a daily basis, and always try to minimize the manual interactions. Some of the new technologies that we are using right now are Spark, Hadoop, Kafka and Docker.<p>We are looking for a Senior DevOps Engineer who will take up the challenge of updating our architecture to continue improving our real time functionality. As a Senior DevOps Engineer, you will help the team with maintaining, growing and optimizing the existing fleet of Linux servers. Furthermore, you will architect the infrastructure behind our application’s backend, creating scalable services, frameworks and storage solutions in PHP, Java, Python and Go. You will be challenged with the amounts of data&#x2F;requests we manage to process daily, and upcoming projects which will put even more pressure and require new approaches and infrastructure stacks in the future.<p>Apart from the challenges mentioned above, there are a few things we can offer apart from those listed in the job description. From the company side, you can expect a lot of freedom, trust and flexibility. From our DevOps wizard you can expect professionalism and reliability from eye to eye level. He is a person who is really motivated, committed and keeps up with new technologies by visiting meet ups and conferences.<p>We are around 30 people in the company, half of the team works on tech positions. 15 employees are male, the other 15 female. The ADEX is based in Berlin with a small customer support team based in Hamburg. As we are a small company, we have many 1-person teams and we would like to have at least two people working on the same team, that&#x27;s why the position is open. We are pretty flexible and chilled, and very tech- and product-focused. We work in a cutting-edge industry, so we encourage our employees to try new technologies, go to meet-ups, workshops and conferences. We are not afraid of trying and failing because we strongly believe in learning from mistakes.<p>If you have any questions, please get in touch: elena@theadex.com","time":1506959961,"type":"comment"}