{"by":"simeonlee","id":15387803,"parent":15384262,"text":"Primary Data | Front End Engineer | Los Altos, California | Full-Time, ONSITE, <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;primary-data&#x2F;job&#x2F;onLA4fww\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;primary-data&#x2F;job&#x2F;onLA4fww</a><p>Hey I’m Simeon Lee, a senior UI engineer at Primary Data (www.primarydata.com). We&#x27;re growing and looking for high performance athletes to join our front end team to deliver graphical insights into our customers&#x27; automated data mobility and migration across their entire data infrastructure. We&#x27;re tackling a big problem, and after we&#x27;re done companies won&#x27;t be willing to manage their data in the same manual way again.<p>Your responsibilities will include implementing new features, driving codebase improvements, and working across teams to ensure the timely and tested delivery of core products. We&#x27;ve just switched to a React &#x2F; Redux based codebase, and we&#x27;re looking for superstars in modern JavaScript development to power up our transition and growth.<p>Primary Data intelligently automates the flow of data to ensure the right data is in the right place at the right time across enterprise infrastructure and the cloud. We have really experienced senior leadership that counts the likes of former founders of fusion.io and Steve Wozniak, and we are at an inflection point in our growth. We have a laid back office in Los Altos, California, right near Stanford and Palo Alto, and we have no problems with you working at home for a few days out of every week - we firmly believe in productivity and eliminating wasteful distractions. You&#x27;d get to work with some of the brightest minds in enterprise software working to fundamentally change the way companies house and manage aging data!<p>PS. We are also always on the lookout for astounding backend people - check out our careers page on our site!","time":1506977258,"type":"comment"}