{"by":"jzhen","id":15384418,"parent":15384262,"text":"Thinknum | New York | Multiple Positions | On-site - Full-time | $90k-$140k + equity<p>=== Who We Are ===<p>Thinknum is one of the fastest growing profitable SaaS companies in the world. Economic activity is coming online - companies are selling products, hiring employees, marketing and moving operations to the web. Thinknum captures the data trails that are created (e.g., How quickly is UberEATS growing on a restaurant-by-restaurant basis vs Grubhub?). We work with hundreds of financial institutions and corporations. We have a private office in Midtown and offer full benefits.<p>=== Who We Are Looking For ===<p>Director of Marketing<p>We’re looking for a Director of Marketing that can help position our product and generate new qualified leads. You will help deliver our story, vision and product innovation resulting in increased coverage and awareness globally. Expertise in content marketing, public relations and using marketing analytics to make data-driven decisions is essential.<p>Web Crawling Engineer<p>We&#x27;re looking for an experienced Python engineer that will extract and ingest data from websites using web crawling tools or APIs. You will need experience in Python and Javascript and to be familiar with the DOM and tools for parsing the DOM like Selenium and BeautifulSoup. At least two years of experience in web crawling is required.<p>Site Reliability Engineer<p>We’re looking for a SRE that will support enterprise level applications hosted in the cloud. You need to have extensive experience in web application development and exposure to Amazon Web Services, Redshift and Postgres. Experience with container management and micro-services architectures such as Docker is a requirement. Enthusiasm for security best practices is a major plus.<p>=== Interested? ===<p>Interested in any of these positions? Drop me a note at jzhen@thinknum.com with Hacker News and the position title in the subject line.<p>Learn more about us: <a href=\"https:&#x2F;&#x2F;www.thinknum.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thinknum.com&#x2F;</a>","time":1506957385,"type":"comment"}