{"by":"swaraj","id":15388295,"parent":15384262,"text":"Sempre Health | Backend&#x2F;Full-Stack Engineer | San Francisco, CA | ONSITE Full-time | <a href=\"https:&#x2F;&#x2F;www.semprehealth.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.semprehealth.com&#x2F;</a> + <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;sempre-health\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;sempre-health</a><p>Referral bonus: $10k cash for referral to candidate who ends up joining Sempre<p>At Sempre, we&#x27;re building individualized healthcare pricing, helping patients save thousands of dollars every year on medications. We raised $2.5M from Social Capital last summer, have revenue from 2 fortune 100 customers, and and are focusing now on scaling. We currently work with hundreds of patients, but will soon be launching programs that impact tens of thousands of lives.<p>About the role: If you come on board, you&#x27;ll work on projects including our patient engagement services responsible for handling inbound communications and triggering events [python], backend APIs to integrate with the nationwide pharmacy network and calculate the optimal price for each patient [python], and our internal patient management tools [React]. These products drive our ability to help patients afford medications they need.<p>About the founders: My name is Swaraj, and I&#x27;m the co-founder &amp; CTO of Sempre Health. Previously, I was engineering director at MindMeld (NLP&#x2F;search, acquired by Cisco), and at Zynga, launched FarmVille 2 (most popular game on FB for &gt; 6 mo). My co-founder &amp; CEO was the founding data scientist at Propeller Health, after reporting directly to DaVita&#x27;s CFO (Fortune 500, largest kidney care company in US).<p>To apply: email me directly at swaraj[at]semprehealth.com<p>Full job req: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;sempre-health&#x2F;jobs&#x2F;130959-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;sempre-health&#x2F;jobs&#x2F;130959-software-engineer</a><p>Thanks,<p>Swaraj","time":1506981298,"type":"comment"}