{"by":"themeinge","id":15384534,"parent":15384262,"text":"Cambridge Intelligence | Solutions Engineer | Cambridge, UK | Full-time | ONSITE (Some home-working permitted)<p>ABOUT CAMBRIDGE INTELLIGENCE<p>We are an award-winning start-up based in Cambridge (UK). Our flagship product, KeyLines, is an innovative, browser-based data visualization software toolkit, which lets organizations explore networks in their data. We work with hundreds of customers worldwide, including the US Army, Visa, Cisco, Symantec and Microsoft.<p>ABOUT YOU<p>You’ll either have a background in software solutions, technical consulting or building complex apps in JavaScript. You’ll be a problem-solver who is comfortable taking a consultative approach to understand customers’ needs.<p>WHAT YOU&quot;LL BE DOING<p>This is primarily a development role. You’ll become an expert user of KeyLines and use it to develop data visualisation apps for our customers that are both powerful and beautiful.<p>ROLE REQUIREMENTS<p>JavaScript (ES6) and frameworks (e.g. Node.js, React, Angular)\nSolid web stack experience, which might include: HTML, CSS, Python, SQL etc.\nExperience of data transformation&#x2F;manipulation, web services and database management would be an advantage\nStrong analytical and problem–solving skills\nAn ability to clearly explain technical concepts to a non-technical audience in an engaging way.<p>FAST PASS TO THE FRONT OF THE QUEUE<p>Subject matter experience of anti-fraud &#x2F; compliance, cyber security or law enforcements &#x2F; crime prevention\nExperience with graph databases (e.g. Neo4j, Titan, ArangoDB, OrientDB), graph frameworks or graph visualization libraries (e.g. KeyLines, d3, Linkurious, sigma.js)\nExperience of any data visualisation libraries, tools or solutions.<p>APPLY HERE: <a href=\"https:&#x2F;&#x2F;cambridge-intelligence-1.workable.com&#x2F;jobs&#x2F;505257\" rel=\"nofollow\">https:&#x2F;&#x2F;cambridge-intelligence-1.workable.com&#x2F;jobs&#x2F;505257</a>","time":1506958078,"type":"comment"}