{"by":"adrianh","id":15385529,"parent":15384262,"text":"Soundslice | Product designer | REMOTE | Full time<p>Soundslice (<a href=\"https:&#x2F;&#x2F;www.soundslice.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.soundslice.com&#x2F;</a>) is &quot;living sheet music.&quot; We make web-based, responsive music-notation technology that you can listen to and interact with. The goal is to be the best way to learn any piece of music.<p>See <a href=\"https:&#x2F;&#x2F;www.soundslice.com&#x2F;demo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.soundslice.com&#x2F;demo</a> for an example. It&#x27;s one of the coolest HTML5 web apps in the world that&#x27;s an actual business and not a project. When I originally posted it to HN, it stayed at the top of the homepage for the better part of a day and was universally praised: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4790636\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=4790636</a><p>Soundslice is a small (two-person) business -- you&#x27;d be the third. It&#x27;s proudly bootstrapped and makes money.<p>We&#x27;re looking for a designer. Somebody who&#x27;s good at the whole design process -- understanding problems, creating mockups, implementing in HTML&#x2F;CSS. You must also be a musician at some level.<p>WHY WORK HERE:<p>* You&#x27;d work on an amazing product that helps people learn music.<p>* Design is front-and-center of our product. Much of its value is pure design&#x2F;UX.<p>* Excellent work&#x2F;life balance.<p>* You&#x27;d work with me (one of the people who created Django, plus some other stuff; see holovaty.com). I&#x27;m an experienced developer and can teach you a lot, if you&#x27;re open to it.<p>More info is at <a href=\"https:&#x2F;&#x2F;www.soundslice.com&#x2F;blog&#x2F;53&#x2F;job-product-designer-at-soundslice&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.soundslice.com&#x2F;blog&#x2F;53&#x2F;job-product-designer-at-s...</a> and feel free to email me (Adrian Holovaty) at adrian@soundslice.com.<p>[No, we are not hiring a programmer. Designers only, please!]","time":1506963349,"type":"comment"}