{"by":"sankethkatta","id":15385024,"parent":15384262,"text":"Smartcar API | Frontend Engineering, Backend Engineering, Business Operations, Business Development | Mountain View, CA | ONSITE | <a href=\"https:&#x2F;&#x2F;smartcar.com\" rel=\"nofollow\">https:&#x2F;&#x2F;smartcar.com</a><p>We&#x27;re a small team (9 people) making a big change in transportation. Technological additions to vehicles are kicking off a new era of better transportation which is affordable, greener, and safer. The automotive industry is undergoing the most disruptive changes since its inception. We believe the future of transportation is Autonomous, Electric, Shared, and Connected. Smartcar is building a REST API platform to solve the &quot;connected&quot; part of it.<p>We recently launched our platform with BMW in Germany: <a href=\"https:&#x2F;&#x2F;blog.smartcar.com&#x2F;smartcar-launches-connected-car-platform-in-germany-d631d821536a\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.smartcar.com&#x2F;smartcar-launches-connected-car-pl...</a> and built <a href=\"https:&#x2F;&#x2F;teslabot.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;teslabot.ai</a> to show a sneak peak of what our platform can do.<p>The positions we are hiring for:<p>+ Business Development with 2+ years of experience selling in the Automotive industry.<p>+ Business Operations to manage delivery and process of new projects.<p>+ Frontend Software Engineer with 2+ years of experience with any modern frontend framework (React, Angular, Ember, ...).<p>+ Fullstack&#x2F;Backend Software engineer with 2+ years of experience. Our backend stack is Node.js, Postgres, Redis, Docker, AWS.<p>If you are interested in helping us modernize transportation and enjoy working in a collaborative environment, we&#x27;d like to meet you. Compensation is $95K to $130K + equity. Read more about the positions and apply at: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;smartcar\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;smartcar</a>.<p>If you want to learn more, email me at sanketh@smartcar.com or call me at 530 475 2882. No recruiters.","time":1506960716,"type":"comment"}