{"by":"savrajsingh","id":15385057,"parent":15384262,"text":"Daily Harvest | <a href=\"https:&#x2F;&#x2F;www.daily-harvest.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.daily-harvest.com</a> | Full-Stack Software Engineer | Princeton, NJ, USA | Full-time Onsite | <a href=\"https:&#x2F;&#x2F;www.daily-harvest.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.daily-harvest.com&#x2F;careers</a> | contact me at savraj@ [our domain] and mention HN in the subject line!<p>Based in Princeton and NYC, we are a rapidly growing startup sending out thousands of products to happy customers each week. Everyone around you -- especially the non-techies in your life -- will at least try, if not consistently enjoy the pre-portioned, frozen superfood eats that your work at Daily Harvest will deliver.<p>Our 29 flavor combinations of smoothies, overnight oats, chia parfaits, and sundaes are co-created by our team of chefs and nutritionists and come packed with organic fruits and vegetables, and no added sugar or preservatives. Each cup is perfectly portioned, so all you have to do is take it out of the freezer, add your liquid of choice and blend, heat or soak.<p>Daily Harvest seeks a full-stack software engineer, fluent in Python, to help build the future of frozen food delivery. As a member of our software engineering team, you’ll craft and ship the code that powers our entire business -- from user-facing UI, to code that interfaces with our shipping providers, to inventory and supply chain management at scale. You’ll be working with a small team of friendly, easy-going engineers and report directly to our CTO in Princeton, NJ. More info here: <a href=\"https:&#x2F;&#x2F;daily-harvest.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;daily-harvest.com&#x2F;careers</a><p>Your qualifications\n- BS in computer science or equivalent - 3+ years of experience in software development roles - Experience with Python-powered web-apps (Flask, Jinja, Google Cloud, Google App Engine, Stripe) - MySQL, Google Cloud SQL, PeeWee ORM - Experience with Git, Travis CI, PyTest, and deployments to Google Cloud.<p>Thanks for reading this far! Contact us! (@savraj on twitter)","time":1506960891,"type":"comment"}