{"by":"vicentereig","id":15385752,"parent":15384262,"text":"New Relic, Inc | Senior Software Engineer | San Francisco | ON SITE<p>The Growth Engineering Team is looking for a great Senior Software Engineer to join us in building customer experiences to drive acquisition, onboarding, monetization, organic&#x2F;viral growth, and retention across the New Relic product suite. Please include a short cover letter, telling us why you’re interested in this position and why you think we should work together.<p>As a good fit for this role, you…<p>* Have a least 5 years of industry experience working in a team environment building production web applications with modern OO languages such as Ruby or functional languages like Elixir. You have built Single Page Apps in AngularJS, and backend services in Rails and Elixir.<p>* Possess a Growth Engineering mindset focused on continuously improving the customer experience to help drive engagement and sales. You are curious at heart and ship iterative changes and experiments with instrumentation to improve key metrics. You minimize risk introduced by these changes with an ironclad test suite.<p>* Actively participate in code and UI design reviews, weekly sprint planning meetings and team retrospectives to ensure we are all building at our best while driving key business goals.<p>* Have strong opinions, weakly held and rooted in personal experience. Can easily disregard prior held biases and opinions in the face of new information and use cases.<p>* Be part of a disciplined team that follows best Agile practices. Can build strong alliances with Product and Engineering Managers, using your knowledge to influence task prioritization.<p>* Relish the chance to mentor others and are passionate about improving software and your teammates’ skills.<p>Apply here in our Careers website! <a href=\"https:&#x2F;&#x2F;newrelic.com&#x2F;about&#x2F;careers?p=job%2Fosn55fwJ\" rel=\"nofollow\">https:&#x2F;&#x2F;newrelic.com&#x2F;about&#x2F;careers?p=job%2Fosn55fwJ</a>","time":1506964466,"type":"comment"}