{"by":"ghc","id":15384791,"parent":15384262,"text":"Boston, MA | Sentenai | Full-time | On-site<p>Apply at: jobs@sentenai.com<p>Keywords: Haskell, Machine Learning, Distributed Systems, FreeBSD<p>Sentenai: Machine Intelligence. Accelerated.<p><i>Who we’re looking for:</i><p>Haskellers with an interest in distributed systems and machine learning. The more production Haskell experience, the better. Applied maths and type theory backgrounds are highly desirable, as is experience with optimizing large in-memory data structures. Our culture is built on a foundation of good communication skills and solid engineering principles. Sentenai has been built with Haskell and running on FreeBSD since day 1, and two years later Sentenai remains committed to Haskell as we grow our engineering team.<p><i>Why?</i><p>Machine intelligence represents a huge potential breakthrough in many industries, from manufacturing to aircraft maintenance. The problem is that working with sensor data to build predictive applications is a slow, time consuming process fraught with data engineering challenges. At Sentenai, we’re determined to change that.<p>Sentenai is the first cloud data infrastructure purpose-built for data scientists and machine learning engineers who need to rapidly mine diverse sensor data sets for behavioral patterns and build targeted training sets for predictive models.<p>At the core of Sentenai is a novel set of distributed machine learning technologies and a distributed time-series query engine that natively understands sensor fusion and cross-stream pattern mining. Applied to our distributed data storage and indexing system, these technologies help Sentenai abstract away the details or data preparation, storage and querying on time series data to provide users with a clean data interface to their data without exposing them to the complexities of the underlying database technologies we develop.<p><i>Company details:</i><p>Sentenai is based in Cambridge, MA in Central Square. Our founding team has deep experience in the IoT space and our engineering team consists of Haskell engineers with a wide range of experience levels (from two to ten years) and non-computer interests (like travel, euro games, playing music, cooking, and hunting for fine wine). We love open source and conferences&#x2F;meetups, so you’ll probably see some of us attending various conferences or organizing meetups around our interests. Our investors include funds like Flybridge, Founder Collective, Hyperplane and Project 11.<p>Sound interesting? Contact us at jobs@sentenai.com.","time":1506959639,"type":"comment"}