{"by":"otih","dead":true,"id":15384951,"parent":15384262,"text":"Neckarsulm, Germany | FUJITSU TDS GmbH | IT Engineer Linux und Datenbanken (w&#x2F;m)<p>Mit über 800 Mitarbeiterinnen und Mitarbeitern betreiben wir Lösungen im IT Outsourcing und SAP Consulting für mittlere und große Unternehmen. Die Fujitsu TDS GmbH, unsere Kolleginnen und Kollegen sowie unsere Arbeitsweise zeichnen sich dadurch aus, dass wir pragmatisch handeln – oder, wie man auch sagt, „machen“. Und Macher gibt es viele. Bei der Fujitsu TDS erst recht: Werden auch Sie Teil dieses starken Teams in einem internationalen Unternehmen mit mittelständischen Strukturen.<p>Welche Aufgaben erwarten Sie bei uns?\n- Sicherstellung des reibungslosen Betriebs und Supports der heterogenen Systemlandschaften unserer Kunden\n- Betreuung unserer Großkunden im Banken- und Automotive-Sektor\n- Einrichtung, Konfiguration und Betrieb der Server-Betriebssysteme auf Basis von Linux und MS-Windows\n- Installation, Wartung und Überwachung der eingesetzten Datenbanken und Applikationen\n- Integration und Weiterentwicklung bestehender Systemumgebungen\n- Durchführung von Release- und Versionswechsel sowie Automatisierungen und Performance-Tunings<p>Welche Qualifikationen Sie mitbringen sollten:\n- Erfolgreich abgeschlossene Ausbildung als Fachinformatiker oder eine vergleichbare Qualifikation\n- Erfahrungen in der Administration mit mindestens einem Server-Betriebssystem (Linux und&#x2F;oder MS-Windows)\n- Kenntnisse in der Administration von Datenbanken (Oracle und&#x2F;oder MySQL, PostGreSQL)\n- Erste Berührungspunkte mit Open Source Produkten, wie Apache, Tomcat, etc., wünschenswert\n- Kommunikationsfähigkeit sowie eine selbstständige und zielgerichtete Arbeitsweise zeichnen Sie aus\n- Gute Englischkenntnisse in Wort und Schrift runden Ihr Profil ab<p>Gegenseitiges Vertrauen und ein wertschätzender Umgang bilden die Basis der Zusammenarbeit im Team der Fujitsu TDS. Unsere Mitarbeiterinnen und Mitarbeiter schätzen besonders, dass sie eigenständig handeln können und dass wir kurze Entscheidungswege haben. Wir bieten Ihnen individuelle fachliche und persönliche Weiterbildungsmöglichkeiten sowie attraktive Perspektiven für Ihre berufliche Entwicklung.<p>Fujitsu TDS GmbH\nDiana Weller\nTel. +49 7132 366-1443\nrecruiting@tds.fujitsu.com\nfujitsu.com&#x2F;tds&#x2F;karriere","time":1506960396,"type":"comment"}