{"by":"andrey81inmd","id":15385002,"parent":15384262,"text":"CapitalOne | Applied Solutions Architect | NYC, Wilmington DE, MacLean VA | Onsite<p>You believe that code speaks louder than PowerPoint, and that the best solutions are arrived at by engineers working collaboratively on a problem rather than by mandate. You look forward to finding that obscure race condition in code review. You have multiple solutions for no-downtime deployment of distributed customer facing systems, and can list pros and cons of each. You’d rather re-use a good solution than re-invent the wheel. You are open minded to different technical solutions, but forceful in questioning their merit. You get equally excited about a product feature that will make customers’ lives better, and about the latest Docker release. You want to jump in and contribute code whenever possible.<p>As an Applied Solutions Architect at CapitalOne, you will be facilitating engineering guilds; reviewing, sharing, and enhancing reference implementations; providing feedback on application designs; providing input on company-wide initiatives; embedding in engineering teams to jump start complex projects; and helping raise the talent bar by recruiting and hiring top engineering talent. You will also work with product owners to articulate benefits of proposed solutions; influence technical roadmap of enterprise platforms; and help business prioritize work. If this sounds exciting, the Applied Solutions Architect role could be for you!<p>The person we’re looking for:\nIs passionate about hands-on coding, testing, releasing, monitoring, and supporting working software in production\nHas depth and breadth of knowledge across multiple software engineering disciplines\nIs self-driven, actively looks for ways to contribute, and knows how to get things done\nValues data and truth over ego\nHas a strong sense of engineering craftsmanship, takes pride in the code they write\nBelieves that good software development includes good testing, documentation, and collaboration\nHas good communication and reasoning skills, including the ability to make a strong case for technology choices\nHas ability to build consensus and iteratively improve solutions\nFirmly believes in leading by influence and by adding value<p>Apply at <a href=\"https:&#x2F;&#x2F;capitalone.wd1.myworkdayjobs.com&#x2F;Capital_One&#x2F;job&#x2F;Wilmington-DE&#x2F;Applied-Solutions-Architect_R35322\" rel=\"nofollow\">https:&#x2F;&#x2F;capitalone.wd1.myworkdayjobs.com&#x2F;Capital_One&#x2F;job&#x2F;Wil...</a>","time":1506960579,"type":"comment"}