{"by":"diN0bot","id":15386490,"parent":15384262,"text":"Karat | REMOTE | Part-time and Full-time | <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a><p>Y&#x27;all can email me directly at lus@karat.io - I&#x27;m an engineering manager who discovered interviewing at Karat through a Who&#x27;s Hiring post last year. I love working here and am happy to chat!<p>We&#x27;re essentially looking for folks who are technical (eg, you&#x27;ll have to read a wide variety of code and identify bugs and complexity) and social (eg, you&#x27;ll have to host interview conversations and be warm and encouraging).<p>We do 1-on-1 technical interviews online. You can set your own schedule and work from home.<p>From the Job Posting:<p><i>Interviewing is broken.  Karat professionalizes interviewing.</i><p>Hiring top talent is a critical activity for all companies, yet the way organizations interview candidates is broken. Interviewing is a time consuming process that is rarely data-driven. Here at Karat, we see a massive opportunity to transform the interviewing experience for every candidate and company.<p>Karat is on a mission to assess the world&#x27;s talent.  We are the first dedicated marketplace for technical interviewers. Karat&#x27;s network of seasoned engineers conduct the first rounds of technical interviews for elite engineering companies. Our robust platform saves teams thousands of valuable hours while allowing them to focus on the top performing candidates.  Karat&#x27;s unique approach recognizes that people are central to the hiring process and that they can be supercharged by leveraging machine learning and our rich database of the world&#x27;s interviews.<p>We face incredible demand for our service and are delivering significant value to elite engineering companies like Interana, BuildZoom and Minted.  We are funded by top VCs including Formation8 and Founder Collective, plus the founders of companies like Glassdoor, Mulesoft, Lookout, OPOWER, MediaLink and CAA.  Karat is headquartered in the University District of Seattle, WA.<p><i>Join our elite community of Expert Interviewers.</i><p>Check out the job posting for more: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced64c86\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;karat&#x2F;d44ab283-c7c0-4bbd-b8c3-4dc0ced6...</a>","time":1506969173,"type":"comment"}