{"by":"alexhornbake","id":15387519,"parent":15384262,"text":"Beme (CNN) | Platform Engineer (Golang) | NYC | ONSITE | <a href=\"https:&#x2F;&#x2F;beme.com\" rel=\"nofollow\">https:&#x2F;&#x2F;beme.com</a><p>Beme is looking for a software engineer to join us in creating the next generation of apps for newshounds. We&#x27;re building a new, independent, and wildly ambitious technology+media company bringing a wider range of perspectives to the news. We want to change who informs the world, and how. Our team is small and we are in our earliest stages, so your impact will be massive.<p>You will be developing product features and infrastructure at scale. If building a better, scalable foundation for the future of video and mobile technology is a challenge you want take on, we’d love to hear from you.<p>This position is based at Beme’s office in Tribeca, NYC.<p>What you&#x27;ll do:\n- Architect application’s backend, creating scalable services, frameworks, and storage solutions using GoLang.\n- Have a voice in the entire product, but focus on the performant, server-side implementation of features.\n- Collaborate with the rest of our small, talented team of designers and engineers on a mobile-first application. Specifically Beme’s API and workers written in Golang, and hosted on AWS.<p>What we&#x27;re looking for:\n- Prior experience with Go and AWS is not a prerequisite for a seasoned coder, but mastery of at least one statically typed language (C++, Java, Golang, etc), understanding of back-end scalability, performance, and&#x2F;or automation is important.\n- The ability to comfortably straddle the line between back-end dev and dev&#x2F;ops.\n- A practical view towards technology selection, striking the right balance between cutting-edge tools and more stable, rock-solid, traditional choices.\n- Eagerness to learn as well as teach. Our engineering team come from large scale platforms like Livestream, Google Search, and Tumblr; there are many learning opportunities in this role, but we also expect you can show us a new thing or two!<p>We have all the perks you might expect: catered lunches, unlimited snacks, relaxed time off and work from home policy, subsidized health, vision, and dental care, 401k program, and fun team outings. We also have a homemade arcade. Interested? Get in touch with us at jobs@beme.com.","time":1506975323,"type":"comment"}