{"by":"botswana99","id":15385977,"parent":15384262,"text":"DataKitchen | Boston&#x2F;Cambridge, MA, ONSITE full-time | Data Engineer in Customer Success (SQL, big data, Redshift, Python, AWS,) | <a href=\"http:&#x2F;&#x2F;www.datakitchen.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.datakitchen.io&#x2F;</a><p>DataKitchen, Inc. enables analytic teams to deliver value quickly, with high quality, using the tools that they love. DataKitchen provides the world’s first DataOps platform for data-driven enterprises, enabling them to support data analytics that can be quickly and robustly adapted to meet evolving requirements. DataKitchen is leading the DataOps movement to incorporate Agile Software Development, DevOps, and manufacturing based statistical process control into analytics and data management. Our company is profitable, stable, rapidly growing and stock will be part of the package.\nYou should have solid SQL development experience along with the ability to interface with customers (though there will be no significant travel required). This position requires excellent technical skills, good business communication skills, excellent attention to detail and follow-up, and the ability to self-manage. You will get great exposure as you work directly with our customers to tackle tough business challenges.<p>Working knowledge of SQL including creation and maintenance of tables, views, indexes, and stored procedures. Some Python coding experience and experience building Docker containers is a plus. AWS and Amazon Redshift experience is a plus. Flexibility and self-motivation – with a problem solver&#x27;s attitude. Excellent attention to detail. Ability to work independently yet collaborates cross-functionally in a team environment. Highly effective written and verbal communication skills with a collaborative work style.<p>We offer competitive pay, benefits like a company funded 401K, experienced team (we all code), amazing customers, equity, and a cool office location. Contact jobs@datakitchen.io","time":1506965952,"type":"comment"}