{"by":"DLinDeepSoma","id":15386102,"parent":15384262,"text":"OSARO INC | San Francisco | Full time | Onsite | Real-time Simulation Engineer | Front End Engineer | Deep Learning Engineer | Reinforcement Learning Engineer | Software Engineers&#x2F;DevOps<p>At Osaro, we&#x27;re creating machine intelligence software that combines state-of-the-art perception with powerful adaptive decision-making abilities to help computer and robotic systems act efficiently and intelligently. You would collaborate with existing team members with expertise spanning reinforcement learning, computer vision, hardware architecture, robotics and more. Osaro is developing large-scale machine learning products that need to interface with customers’ complex software environments as well as interface with a variety of robotic hardware and sensors.<p>- Real-time Simulation Engineer: As a simulation engineer, you will be responsible for architecting, implementing, optimizing, and maintaining software both to interact with and model physical robotic systems, and to create fully-simulated environments in which to train and optimize our machine learning algorithms. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=858184\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=858184</a><p>- Front End Engineer: As a front end software engineer, your job will be to develop and maintain the software infrastructure needed to build these interfaces, which both our internal research and development team and our customers will use to interact with Osaro’s products. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=858140\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=858140</a><p>- Deep Learning Engineer: Seeking world-class deep learning engineers with broad background in machine learning. As a deep learning engineer, you are involved in all stages of algorithm development from inception and initial implementation to evaluation and all the way to a deployable production quality algorithm. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490809\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490809</a><p>- Reinforcement Learning Engineer: As an RL engineer you will be uniquely positioned in our team to work on large-scale machine intelligence problems and push forward the frontiers of AI technologies. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490848\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490848</a><p>- Software Engineers&#x2F;DevOps: As a software engineer, your job will be to maintain and develop the software infrastructure to interface with robotic hardware and a variety of sensors, acquire data, run experiments in both simulation and on real physical systems, programmatically store, access, and analyze results, developing dashboards and monitoring tools, and train and reliably deploy machine learning models across cloud based and local resources. <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490453\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;?gh_jid=490453</a><p>Please apply directly on our website. Thanks! <a href=\"http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.osaro.com&#x2F;careers&#x2F;</a>","time":1506966746,"type":"comment"}