{"by":"bradleypowers","id":15387638,"parent":15384262,"text":"Locus Robotics | UI-Robotics | Wilmington, MA | Onsite, Remote | <a href=\"http:&#x2F;&#x2F;www.locusrobotics.com&#x2F;about-us&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.locusrobotics.com&#x2F;about-us&#x2F;careers&#x2F;</a>\nLocus Robotics has developed a field-proven solution for improving productivity in rapidly growing and strategic warehouses operations around the world. Our mobile, autonomous robots work together with human warehouse associates to deliver real and measurable business value. Our incredible technology is solving a real problem in fast growing and diverse market segments.    \nAn important challenge of any robotic system is enabling their use by non-experts. It will be your role to define how users will interact with and control the system during tasks such as mapping, calibration, and maintenance. Working with a small team of dedicated roboticists, you will develop, build and test a practical robotics solution for a rapidly-evolving market, e-commerce fulfillment solutions. We work and iterate quickly with very cool tech, have a transparent company culture and work environment and have a fully-stocked kitchen!\nResponsibilities:\n-Define our Web&#x2F;UI technology stack with whatever architecture and technology fits the bill.\n-Design sensible frontend APIs (REST or otherwise) for a distributed software system.\n-Create user workflows for setup, operation, and maintenance tasks.<p>Requirements:\n-Proficiency with JavaScript.\n-Familiarity with Python, RDBMS systems.\n-Familiarity working within a Linux environment.\n-3+ years of experience developing and shipping production software.\n-Bachelor’s degree in Computer Science or equivalent experience.\n-Experience working with ROS, Robotics, or physical hardware.<p>Interested?  Please apply direct through our Careers Page at <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;ekl03g\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;ekl03g</a>\nLocus Robotics is an Equal Opportunity Employer","time":1506976105,"type":"comment"}