{"by":"packeted","id":15389283,"parent":15384262,"text":"Outcomes.com | San Francisco Bay Area, CA | Full-time | CTO &amp; Co-founder | <a href=\"https:&#x2F;&#x2F;outcomes.com\" rel=\"nofollow\">https:&#x2F;&#x2F;outcomes.com</a><p>At Outcomes.com we&#x27;re developing a platform that enables doctors and care teams to routinely track how their patients do relative to major surgery or medical treatment. We do this by checking in regularly with patients through a web&#x2F;SMS based interface, capturing information using validated patient-reported outcome measures. We then make this data useful and accesible at the front line to close the feedback loop and facilitate a more proactive model of care that will be critical to practices as they transition to value-based models of payment.<p>Don&#x27;t just take our word for it, in one of many recent papers this JAMA study showed patient-reported outcomes enabled care drastically improved survival, increased quality-of-life and reduced readmissions in patients newly diagnosed with end-stage cancer (<a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;2rw4j4\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;2rw4j4</a>).<p>The company was born out of my own experience as a practicing surgeon and this is a problem I am determined to solve. We already have a working HIPAA-compliant MVP that has been deployed with customers. I&#x27;m looking for an ambitious JavaScript engineer, co-founder and business partner who is willing to commit to building a game-changing company and is ready for an entrepreneurial adventure. This is a chance to get in at the ground floor (with commensurate equity, we have a completely clean cap table) but with a lot of the foundational work already established.<p>If you&#x27;re interested please do get in touch. For your reference our stack is MEAN + React, D3.js, Docker, Twilio deployed on AWS and Aptible with all that HIPAA goodness. Prefer on-site but willing to consider remote&#x2F;visa options for the right person. Contact Francis Wong (MD) at francis@outcomes.com.","time":1506992969,"type":"comment"}