{"by":"tmostak","id":15390073,"parent":15384262,"text":"MapD | San Francisco (city),  | Backend Developer, Frontend Visualization Developer, Developer Advocate (ONSITE&#x2F;REMOTE)<p>MapD (<a href=\"https:&#x2F;&#x2F;www.mapd.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mapd.com</a>) is a NEA&#x2F;Google Ventures&#x2F;Nvidia&#x2F;Verizon Ventures&#x2F;Vanedge&#x2F;In-Q-Tel backed Series B startup that builds a lightning-fast open source GPU-accelerated database and visual analytics platform that takes advantage of the massive parallelism and high memory bandwidth of GPUs. We can literally run queries orders of magnitude faster than other systems (<a href=\"http:&#x2F;&#x2F;tech.marksblogg.com&#x2F;billion-nyc-taxi-rides-nvidia-tes...\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.marksblogg.com&#x2F;billion-nyc-taxi-rides-nvidia-tes...</a>) and since the results are on the GPUs, we can easily visualize the result sets with the native GPU rendering pipeline. Check out our Tweetmap demo (<a href=\"https:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;tweetmap\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;tweetmap</a>) or our 11.6 billion record shipping demo (<a href=\"https:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;ships\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;ships</a>) for an idea of what the system can do.<p>We’re looking for:<p>Backend Developer - Someone with strong experience in C++ and database&#x2F;systems programming. Knowledge of CUDA&#x2F;OpenCL, LLVM, X64 Optimization, and&#x2F;or OpenGL a major plus.<p>Frontend Developer – Someone with strong knowledge of React&#x2F;Redux. Ideal candidate has good design sense and a data visualization background.<p>Developer Advocate - Someone who can convey the technical value of our product to the developer community, both in written form and at meetups, conferences, etc.<p>We’re a growing Series B company (~50 people) with deep knowledge of databases and GPU Programming. Benefits and equity are competitive ($110K-$175K &#x2F; 0.1+%).<p>Please email jobs@mapd.com if you&#x27;re interested!","time":1507003773,"type":"comment"}