{"by":"wronskian","id":15393179,"parent":15384262,"text":"RPC Consulting | .NET developers | South of Cambridge, UK | ONSITE | full-time<p>Our company provides software and consultancy services to the insurance, banking and science sectors. We have our own software platform - Tyche, a high-performance, general-purpose Monte Carlo engine - which consultants and clients use to build models and run calculations.<p>We use a Microsoft stack, with most development in C#, a little in C++. Our development team (around ten people at present) is located separately from the main company, on a beautiful science park setting near Cambridge. Our developers work across the product, so a real mix of work from performance enhancements on our framework, through UI (WPF) development, and implementing numerical algorithms.<p>We&#x27;re looking to grow the team by another five or so developers within the next few months, across a range of experience levels. Exact number of years in the field isn&#x27;t important, what matters to us is an ability to get up to speed with C#&#x2F;.NET quickly if it&#x27;s not already your main language, and some numeracy to your background. Most - but not all - of our developers have a university degree in a subject like physics, maths, engineering, computer science, and we&#x27;re happy to hear from recent graduates with coding skills, too.<p>More information can be found on our Stack Overflow posting page : <a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;companies&#x2F;rpc-consulting\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;companies&#x2F;rpc-consulting</a>\nand our corporate site (which is admittedly not particularly useful for prospective candidates, though gives some idea of the background behind the firm!) is here : <a href=\"https:&#x2F;&#x2F;www.rpc.co.uk&#x2F;services&#x2F;rpc-consulting\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rpc.co.uk&#x2F;services&#x2F;rpc-consulting</a><p>Please feel free to contact me directly, sam.holloway@rpc.co.uk, or apply via StackOverflow.","time":1507045458,"type":"comment"}