{"by":"KurtisL","id":15396024,"parent":15384262,"text":"SigOpt’s first Product Marketing Manager will own our product marketing, working closely with our CEO, sales team, product team, and engineering team, to craft messaging, brand, and content strategy from the ground up. SigOpt’s platform is a unique product marketing challenge: breakthrough optimization technology with wide applicability across customer verticals, with radically different marketing and competitive landscapes in each vertical. Your contributions will be critical as we scale our business!<p>Responsibilities:\n-Own the SigOpt product marketing, messaging, brand and content strategy. Develop marketing collateral across all our key verticals, and measure effectiveness in improving sales efficiency.\n-In collaboration with the product and sales teams, conduct market research and create competitive teardowns to inform our sales and product strategy.\n-Maintain and extend all of SigOpt’s externally-facing messaging, including our marketing website, sales collateral (decks, 1-pagers), and technical whitepapers.\n-Create and implement content marketing strategy for both executive- and practitioner-targeted blog posts, working with our sales, product and research teams.\n-Work with external creative and web agencies to expand our brand collateral and maintain our marketing website.<p>We’re a startup; your responsibilities will evolve with your skills and interests and the company’s needs as we grow. Your responsibilities will extend far beyond this list!<p>Requirements:\n-2 or more years of experience in an enterprise B2B product marketing or content marketing role.\n-Comfortable with taking full ownership over projects, from idea to execution, either working at startups or ownership of initiatives at a larger organization.\n-Have worked with a highly technical product targeted towards technical buyers.\n-Demonstrated ability to craft high-quality, high-ROI marketing materials and measure their effectiveness.\n-Clear and concise communication ability, both oral and written.\n-BA or BS degree, ideally in a quantitative field such as mathematics, economics, computer science, statistics, etc. MBA or MA optional.<p>Pluses:\n-Frontend web development experience (CSS, Node).\n-Experience building and managing teams that exhibit technical and operational excellence.\n-Passion and aptitude for quantitative products and optimization.\n-A desire to make the world a more optimal place.","time":1507063524,"type":"comment"}