{"by":"recr-datatonic","id":15459284,"parent":15384262,"text":"Datatonic | Data Engineer | London | ONSITE<p>Does real-time processing of millions of rows per minute, working with petabytes of data and running large scale machine learning algorithms on thousands of CPUs sound like something you want to do? Do you enjoy a dynamic working environment with different challenges on a regular basis? Then become Datatonic’s next Data Engineer!<p>You will be working on the data engineering and architecture part of our consulting projects, building robust pipelines and wrangling data in a way that it becomes easy to visualise and ready to be fed into our machine learning models. In addition to that, you will be helping us to build out the data engineering side of our next-generation machine learning products.<p>In case you&#x27;re interested, please apply via <a href=\"https:&#x2F;&#x2F;datatonic.workable.com&#x2F;jobs&#x2F;514654\" rel=\"nofollow\">https:&#x2F;&#x2F;datatonic.workable.com&#x2F;jobs&#x2F;514654</a><p>Datatonic | Data Scientist - Machine Learning | London | ONSITE<p>We&#x27;re looking for a machine learning expert to unleash the power of data with our customers. You&#x27;ll be working closely with our partners and customers on the most exciting data projects: product recommender systems, IoT data analysis, segmenting user behaviour profiles with web analytics data, geo-spatial analysis with billions of datapoints and many more.<p>You will be part of a growing and agile team that has accumulated expertise in, computer vision, recommender systems, NLP and predictive analytics across various business sectors including media, telecommunication, finance and e-commerce. Working closely together with our data engineers you will be helping us to build our next-generation machine learning products.<p>To be successful, you will need advanced analytic skills to find relationships, models, and statistical associations between massive data sets. You will have natural curiosity to dig into unknowns, unearth insights buried in data, and provide practical conclusions. Furthermore, you will also have the ability to tackle a project on your own and drive its progress from the initial brainstorm to the delivery of a production ready solution.<p>In case you&#x27;re interested, please apply via <a href=\"https:&#x2F;&#x2F;datatonic.workable.com&#x2F;jobs&#x2F;514630\" rel=\"nofollow\">https:&#x2F;&#x2F;datatonic.workable.com&#x2F;jobs&#x2F;514630</a>","time":1507826717,"type":"comment"}