{"by":"goldiecheng","id":2506803,"parent":2503204,"text":"Los Angeles, CA - Senior Developer (Python / Django)\n(Can be remote with some face-to-face meeting)<p>We are looking for a full-stack, senior web developer to help build a grand vision. Are you someone who can wear many hats and get things done? Looking for a hot startup in a huge market?<p>Lets talk if: \n You are well versed in Python/Django/MVC, HTML, CSS, JavaScript, AJAX/JSON, &#38; Linux environment \n Expert level SQL(MySQL/ Postgresql), configuration management, Apache, Nginx, wsgi) and experienced with networks and script languages\n You have experience building LAMP websites from wireframe through deployment\n Love great User Experience, Scalability, Well- Structured Code, Encryption, Privacy and Security \n Not intimidated by large amounts of data. \n Comfortable with distributed GIT / Subversion<p>On the softer side:\n You are in-tune with the latest and greatest technologies and platforms and are eager to keep learning more about them.\n Excellent communication and interpersonal skills\n Good at project management, managing others and juggling your own priorities\n Fun, Energetic, Hard-working and flexible<p>NOW is a great time to join the team and help lead development. This position can be Permanent or Contract and starts immediately. This position can be on-site (Los Angeles, CA) or remote (with some face-to-face meetings).<p>Who we are: \nWe a marketplace for healthcare with web-based tools and information for patients. Users on our site can easily schedule appointments online, receive electronic appointment reminders, get pre-negotiated discounts on fees and complete their medical history forms before they arrive at the doctor's office.<p>To apply, please respond with CV/resume with information on websites built, specific responsibilities, frameworks used, dates and the cost-to-complete\n<a href=\"http://organicstartup.theresumator.com/apply/C3GJnb/Senior-Developer-At-Los-Angeles-Startup.html\" rel=\"nofollow\">http://organicstartup.theresumator.com/apply/C3GJnb/Senior-D...</a><p>THANK YOU, We look forward to meeting you and being impressed!","time":1304353847,"type":"comment"}