{"by":"fortawesome","id":5150942,"kids":[5151770],"parent":5150834,"text":"Boston | Full-Time | Kyruus | <a href=\"http://kyru.us\" rel=\"nofollow\">http://kyru.us</a><p>Hi. I'm Dave Gandy. I'm the lead product designer at Kyruus. I wake up every single day excited about my job. Why? <i>Kyruus is going to change healthcare.</i> No exaggeration.<p>Kyruus is a well-funded, big data healthcare startup in Boston. We believe that the right data at the right time can help doctors make better decisions. <i>We believe data can save lives.</i><p>WHAT I LOVE ABOUT KYRUUS:<p>- Product design. From the top of the organization, Kyruus is committed to product design done right. It's awesome.<p>- Purpose. Every day, I get to help make the world a better place – a little at a time.<p>- People. I work with some of the best people I've ever met. More than just smart people. Good people.<p><i>Kyruus needs good people.</i> Specifically, a UI/UX developer to join the design team. Come work with me.<p>ABOUT YOU<p>- You think users should drive how things are designed.<p>- You think design should drive what gets built.<p>- You love the intersection between art and technology.<p>- You often start designing on paper.<p>- You like to prototype directly in HTML &#38; CSS with a dash of JS.<p>- You know the difference between UI and UX.<p>- You'd describe yourself mostly as a UI designer.<p>- Programmers think you're a designer. Designers think you're a programmer.<p>- You have a GitHub repository. You might have even contributed to an open-source project or two.<p>- You have examples of websites you've designed.<p>SOUND INTERESTING? Feel free to contact me directly. I look forward to meeting you.<p>Dave Gandy - dgandy@kyru.us<p>Lead Product Designer, Kyruus - <a href=\"http://kyruus.com/careers\" rel=\"nofollow\">http://kyruus.com/careers</a><p>Creator &#38; Maintainer, Font Awesome - <a href=\"http://fortawesome.github.com/Font-Awesome/\" rel=\"nofollow\">http://fortawesome.github.com/Font-Awesome/</a>","time":1359730108,"type":"comment"}