{"by":"nixy","id":5150923,"parent":5150834,"text":"Palo Alto, CA<p>Software/Mobile Engineer at Accedo.tv<p>We are seeking an Junior Mobile Developer to be an integral member of our development team. The ideal candidate will be proficient with application development in Smartphone / tablet space and web development (web 2.0 / rich frontends). Provide expert knowledge and guidance on multiple mobile initiatives. Ensure that the development effort adheres to SDLC process. Give input to Mobile Solutions. The candidate will also be able to work on multiple projects, be equally comfortable jumping into existing applications and pushing out a large volume of high quality code in a fast-paced, highly iterative environment. The ability and willingness to pick up new technologies quickly is essential. This is your opportunity to design and develop applications for some premium media companies and gain experience of working across multiple platforms and multiple audience needs.<p>Ideal candidate will have the following-<p><pre><code>  BS/MS CS/CE or equivalent experience\n  Exp w/iOS SDK and Objective-C\n  Exp w/Android or Google Web Kit front-end a plus\n  Exp development and using Web Services using contract-first techniques.\n  Demonstrated experience with object oriented software design and development (in PHP/Java).\n  Good knowledge of software engineering life cycle process including design, development, build/release and QA.\n  Basic understanding of source code control procedures and environments (git, subversion, Jira).\n  Basic knowledge of Internet Application architectures and Protocols (TCP/IP, HTTP, etc.).\n  Experience in creating user interfaces from design concepts \n</code></pre>\nThis is a contract to hire/ full time and on-site position located in our Palo Alto office. Salary commensurate with experience. Please contact back with your resume and cover letter.<p>About Accedo: Accedo is the leading enabler of Smart TV and IPTV applications. Accedo provides platforms, applications, tools and services to media companies, platform and CE companies and TV operators globally, to help them deliver the next-generation TV experience. Accedo's cloud-based platform solutions enable customers to cost-efficiently roll out and manage application offerings and stores for multiple devices and markets.<p>nik at accedo dot tv (Please put HN in the subject line)","time":1359729957,"type":"comment"}