{"by":"scosman","id":5151130,"kids":[5151432],"parent":5150834,"text":"Toronto - MyShoebox Engineer<p>## Job Summary ##<p>MyShoebox is a recently launched startup with explosive growth. Our mission to to unify photo collections across devices and people. You can read more about our product in Forbes and TechCrunch (links at the bottom) or at shoeboxapp.com<p>We're looking for entrepreneurial developers to help us grow. You will have an opportunity to try multiple roles including new feature development, scaling a startup, product design, measuring progress and more. As a small company you'll have the opportunity to make a large impact to our business.<p>ABOUT US<p>1) With apps for Mac, PC, iOS and Android MyShoebox unifies your photo collection in the cloud and allows you to access any photo from any device.<p>2) Forbes says: \"MyShoebox is obviously onto something here and their numbers prove it. Let’s just see how fast all the other players in the photo-sharing game can catch up.\"<p>3) Founded by ex-Microsoft and ex-RIM engineers with a passion for building innovative experiences to explore large photo collections.<p>4) Located in Queen Street West, downtown Toronto. We're easily accessible by transit and in the heart of a fun and diverse neighbourhood with dozens of amazing lunch options.<p>ABOUT YOU<p>1) You want to start your own startup some day<p>2) You build passion projects or contribute to open source projects<p>3) You believe choosing the problem is just as important as how you solve a problem<p>4) You love to jump into new and ambiguous problems<p>5) You believe design includes everything from pixels to big-O performance<p>PRESS\nTechCrunch \"After One Month MyShoebox Tops 13M Photos Stored Averaging 3,275 Per User\"\n<a href=\"http://techcrunch.com/2012/11/28/after-one-month-myshoebox-tops-13m-photos-stored-averaging-3275-per-user/\" rel=\"nofollow\">http://techcrunch.com/2012/11/28/after-one-month-myshoebox-t...</a><p>Forbes \"Move Over Flickr Photobucket and Picasaweb Here Comes MyShoebox\"\n<a href=\"http://www.forbes.com/sites/karstenstrauss/2012/11/07/move-over-flickr-photobucket-and-picasaweb-here-comes-myshoebox-video/\" rel=\"nofollow\">http://www.forbes.com/sites/karstenstrauss/2012/11/07/move-o...</a><p>## Job Responsibilities ##<p>Startups require embracing a number of roles. Depending on your area of interest and expertise there are opportunities in:<p>New feature development<p>- building highly available web services<p>- scaling high-throughput image and video encoding servers<p>- mobile application development (iOS and Android)<p>- desktop application development (Mac and Windows)<p>- web development<p>- computer vision (best shot detection, face detection/recognition)<p>Growth hacking<p>- Determining where customers come from, how they engage and developing ways to grow faster<p>Interaction design<p>- Designing new ways to make photo collections as large as 120,000 photos friendly, approachable and fun<p>## Required Skills ##<p>We believe strong engineering fundamentals allow you to adapt to new languages, development environments and challenges. As a company with 5 client platforms and multiple servers we value the ability to learn quickly over expertise in any one technology.<p>Applicants should have:<p>- A passion for building new things (please include links to GitHub account and/or side projects on your resume)<p>- A understanding of standard algorithms, data structures and performance<p>- Respect for software maintainability and readability<p>- Experience with multiple languages and frameworks. We use Java, C#, Objective-C, Javascript and Ruby<p>- Experience with data stores, multiple a plus. We use Postgresql, Redis and Memcached","time":1359731748,"type":"comment"}