{"by":"kylered","id":5151406,"parent":5150834,"text":"VividCortex, Inc.<p>Charlottesville, VA (Remote, Fulltime)<p>We're building database administration tools delivered as a service. We're early-stage, pseudo-stealth, but with great momentum and access to the market, and we're well funded. It's a pretty unique company and market, and it's tackling a legitimate problem in the devops/sysadmin world. Our jobs:<p>Dev/ops: our backend systems and infrastructure are all written in Go (it’s awesome). We are ramping up to handle a jaw-dropping amount of incoming data. Data storage involves MySQL and other storage technologies in a fault-tolerant, distributed environment. We're looking for someone who can switch in and out of a couple of developer and sysops roles -- writing some server software, setting up some machines, whipping up some Chef recipes, and so on. We're a small team, so the real job description is \"we need another backend/infrastructure engineer.\"<p>Frontend: the web app is backed by PHP and Symfony2, and fronted by a lot of JavaScript, using up-to-date technologies and frameworks. There's a lot of API interaction from JavaScript, and a complex user interface that's key for making our customers rave about the experience, not just the technology. We'd love to find someone who can hop back and forth between the PHP and the stuff that runs in the browser, and it's even better if they've got some design sensibilities and can help shape the product's features and functionality too. If you've got the latter skillset, then the PHP coding is optional.<p>Head of UX/UI: your impact would be immediate as we already have leading consumer web companies using our technology. Your impact would also be lasting because there really isn’t anything in this space, and, if you can lead the defining efforts of UX/UI for system administration, then you will have moved the industry forward. \nIdeally, you know Photoshop, have worked with front-end development teams and know a little bit about system administration. Additionally, we work with a lot of charts and graphs, and notification feeds. Other than that, we are open to a variety of experiences.<p>As an early-stage company, we offer the chance to end up owning a fair chunk of what we believe is likely to be a very valuable business.<p>Email jobs@vividcortex.com","time":1359734048,"type":"comment"}