{"by":"sadadar","id":5151364,"parent":5150834,"text":"ConnectSolutions - San Francisco, CA - Full Time <a href=\"http://www.connectsolutions.com/careers\" rel=\"nofollow\">http://www.connectsolutions.com/careers</a><p>ConnectSolutions works in the Unified Communication space as a managed services provider, hosting enterprise and government UC products and building a platform and services around them. We are a profitable small business based in SF that was bootstrapped but recently took investment ($10M, <a href=\"http://tiny.cc/qnqdrw\" rel=\"nofollow\">http://tiny.cc/qnqdrw</a>) in order to drive additional growth. We solve real and challenging collaboration problems for a large base of highly recognizable customers. Our success is in a large part due to the collaborative nature of our business and dynamic company culture. Our competitive compensation, benefits and perks reflect the high value we place on our people. Sometime this year ConnectSolutions customers (including Google, Charles Schwab, KPMG, SAS, Kaplan, General Motors, USAID, FDA, and many others) will surpass 5 billion collaboration minutes.<p>We're looking to start to ramp up a SaaS business to augment our successful and profitable managed services business that attracts high profile enterprise and government customers with a business that can take our lessons learned and value to small to medium sized business.<p>- Our product manager wants a full stack engineer with a lot of energy to work closely with to co-found a business line, if you're interested in being a technical co-founder without  the risk of short runway this would be a great job for you.<p>- Our engineering team is looking for a devops engineer who can help move us into a SaaS world while our 5 year history is in managed services.<p>- We're also hiring a support engineer on our managed services side and an associate customer engagement person (combo project manager and account manager)<p>If interested in any of these positions, or you just think the domain/company sound cool and aren't a fit for these but want to work with us, e-mail me at matt@connectsolutions.com.","time":1359733695,"type":"comment"}