{"by":"jobi","id":5151655,"kids":[5151715],"parent":5150834,"text":"Boston or REMOTE - full-time<p>Senior Front-End Developer<p><i>Job Description</i><p>The Woven team at litl is looking for a Senior Front-End Developer to join our Copley Square-based team. You will be responsible for all things HTML at litl, including:<p>- develop full HTML5 applications, for the web, mobile or smart-TV platforms<p>- take over maintainership of our existing HTML-based projects, such as our companion app for Samsung TVs, our shared photo site, our internal Operations Dashboard etc...<p>- maintain the company websites<p>- work in close cooperation with our design team to develop user experience prototypes<p>While our headquarters are in Boston, we have developers from various parts of the world. Working remotely is a common practice at litl.<p><i>Skills &#38; Requirements</i><p>Proven record as an excellent HTML5 developer, ideally on a broad range of browser and platforms:<p>- Expert knowledge of HTML5, JavaScript and CSS3.<p>- Experience structuring large HTML applications and writing maintainable client-side code.<p>- Significant experience with popular web development frameworks (such as jQuery, backbone.js...).<p>- Experience in responsive designs for desktop and mobile browsers.<p>- Strong emphasis on code quality and maintainability. We will ask you for code samples.<p>- Experience working in a small team of developers strongly desired. For example, involvement with an open source project is greatly appreciated.<p>- Experience with git strongly desired.<p>- Experience with other platforms appreciated.<p>- Good sense for design and aesthetics appreciated.<p><i>About litl LLC</i><p>We’re the company that brought you the litl webbook, an Internet computer for the home that’s been hailed as a “design miracle” by Fast Company, “truly new” by John Gruber, and “bold” and “refreshing” by Walt Mossberg.<p>With the launch of Woven, our photo viewing app, we’re increasingly focused on helping people enjoy their treasured photo collections through smart and simple mobile apps, desktop software, and supporting services. More information about Woven is available at its website, woventheapp.com.<p>Email: jobs@litl.com","time":1359736067,"type":"comment"}