{"by":"amwelles","id":5151508,"parent":5150834,"text":"Help advocacy organizations get things done by working with Richir Outreach (<a href=\"http://richiroutreach.com/\" rel=\"nofollow\">http://richiroutreach.com/</a>)<p>Raleigh, NC, USA - Full time, no remote<p>We work primarily with NationBuilder (<a href=\"http://nationbuilder.com\" rel=\"nofollow\">http://nationbuilder.com</a>), Salsa (<a href=\"http://salsalabs.com\" rel=\"nofollow\">http://salsalabs.com</a>), ActionKit (<a href=\"http://actionkit.com\" rel=\"nofollow\">http://actionkit.com</a>), Wordpress, and Drupal. Even our strategists get hands-on with code!<p>---------------<p>LEAD DIGITAL STRATEGIST<p>The Lead Strategist will serve as project manager for a number of progressive campaigns and grassroots organizations.  The ideal candidate will be able to manage web projects from beginning to end, as well as coordinating integrated outreach campaigns that include social, mobile, video, and paid media. The Lead Strategist should also be knowledgeable of best practices in online organizing and outreach for nonprofits and campaigns, and be able to advise clients accordingly.<p>The individual in this role should have demonstrable experience with online organizing and outreach, although we are willing to provide technology-specific training to the right candidate.<p>- 3-4 years project management or outreach experience<p>- track record of managing projects with multiple stakeholders and demanding timelines<p>- understanding of intersction of new media, outreach, and organizing<p>- excellent verbal and communication skills<p>- interest or background in advocacy and/or community organizing experience<p>---------------<p>FRONT-END DEVELOPER<p>Our staff has the freedom to geek out on the latest tech and implement their vision for a variety of projects. Work with jQuery, Liquid, HTML, SASS, PHP, MySQL, and whatever else you'd like to get your hands dirty with.<p>- demonstrated mastery of CSS<p>- 2 years experience with Adobe Suite or similar<p>- portfolio of implemented themes, templates, or skins<p>- familiarity with open source libraries such as jQuery<p>- track record of troubleshooting and training<p>- commitment to winning reforms that will advance the public good<p>Bonus points for:<p>- PHP/MySQL experience<p>- contributions to open source projects<p>- UX expertise<p>- familiarity with mobile web development<p>---------------<p>Enjoy competitive salary and significant benefits including 100% employer-paid healthcare, 17 paid days off your first year (27 your second year), plenty of training opportunities, and a great working environment.<p>We are an affirming employer. Transgender and gender non-conforming people, lesbians, gay men, people of color, people of faith, and people with disabilities are strongly encouraged to apply.<p>---------------<p>Contact autumn@richiroutreach.com for more information, or apply online (<a href=\"http://richir.theresumator.com/apply/\" rel=\"nofollow\">http://richir.theresumator.com/apply/</a>).","time":1359734922,"type":"comment"}