{"by":"cdolan92","id":5151899,"parent":5150834,"text":"<p><pre><code>    Startup - Sequoia Waste Solutions (Pittsburgh, PA) \n\n    Full Time or Contract. Remote OK, Local Preferred.\n\n    Positive-Cash Flow with 8 full time employees + contractors, interns\n</code></pre>\nWe are a 1.5 yr old startup working to disrupt the $60 billion waste industry, and we are primarily looking for a backend &#38; systems developer. We need individuals who are willing to solve problems inherent to an aging industry, and by doing so, topple the biggest players in the market.<p><pre><code>    About the company: \n</code></pre>\nSequoia is saving businesses money by incentivizing them to recycle. We work with almost any sized business to make recycling and waste-vendor management simple.<p>We have hundreds of client locations in a dozen states, and are cash flow positive with reoccurring monthly revenue, but need to stay on top of our tech development to stay ahead of the multi-billion dollar players in the space.<p>You will be an integral part of a small development team, tasked with improving upon 1-2 years of database, iOS, and customer portal/CRM development.<p>Currently we are rebuilding our backend, taking into consideration all the lessons of our first year and a half with clients. After doing so, we'll be prepared to roll out service in nearly every metro-area around the country - scaling on what will be your product!<p><pre><code>    &#60;-- Requirements/Responsibilties --&#62;\n</code></pre>\nLeadership experience, with the ability to produce from conception to execution.\nComfortable architecting 'behind the scenes' systems, and building those systems in a manner suitable for scale.\nA keen eye for customer UX.<p>Preferably, you have a cool project, website, or demo that you could send in.<p>We've done a majority of development for iOS, and run our data services on Salesforce and an AWS RDS instance. We're looking to get away from Salesforce as the backend to our customer portal and develop our own, pulling data from our own database.<p><pre><code>    &#60;-- What we will be working on --&#62;\n</code></pre>\nCollecting more data streams, via government agencies and any available API's, so that we may better analyze our customer's services.\nFurther down the road, we will make trash receptacles 'smart' for data collection and customer service.<p><pre><code>    &#60;-- To apply --&#62;\n</code></pre>\nEmail resumes and any relevant work to &#60;resumes@sequoiawaste.com&#62; , or through our website, at <a href=\"http://sequoiawaste.com/opportunities#view3\" rel=\"nofollow\">http://sequoiawaste.com/opportunities#view3</a>","time":1359738246,"type":"comment"}