{"by":"ryen","id":5152425,"parent":5150834,"text":"Ochre - New York City<p>Software Engineer<p>--<p>Ochre (www.theochre.com) is an NYC-based media startup. We are a new,\ngrowing company building an online video network giving content makers the\nability to create interactive videos where viewers can make decisions on the\noutcome of the story - seamlessly and in real-time. We partner with ad networks,\nagencies and IT resellers to release this content.<p>Founded by Grammy-winning producer Devo Springsteen, Ochre is not just\nabout 0s and 1s. It’s about embracing technology to allow our partners tell stories\nin meaningful ways never before possible. It’s about changing the video medium\nfrom a 1-way presentation to a 2-way conversation. It’s about changing culture\nand our expectations of content.<p>We are a seed-funded startup (including celebrity investors) currently closing a\nround with top tier institutional investors.<p>----------<p>About our Software Engineer Position<p>We’ve developed an API-based video platform which stitches together videos\nduring playback. As one of the first full-time engineers you will be responsible for\nhelping scale the system to meet with our fast-climbing demand. You’ll do things\non a high level such as:<p>- Integrate our playback system with partners (Aol, Youtube, Spotify, etc.)<p>- Help scale our video consumption and playback system<p>- Further develop robust HTML5 playback protocol to stitch videos together on iOS/Android<p>- Integrate the interactive technology with relevant e-Commerce and social network backends<p>- Integrate user data with our analytics platform<p>- Assist with hiring additional team members and help develop processes for iteration and\nrelease<p>- Help make our product more fun and valuable<p>We offer competitive compensation packages including generous equity options.<p>----------<p>Requirements<p>- 3+ years experience building products for fast growing web or mobile products<p>- Minimum 3+ years of experience with Ruby/Rails<p>- Bonus points for experience with Flash/ActionScript3 and/or HTML5 video<p>- BS or MS in Computer Science or related field preferred<p>- Comfortable in a small, intense and high-growth start-up environment<p>- Passion for media &#38; fun!<p>If interested, contact info@theochre.com with resume and any other relevant\ndetails and we’ll connect from there!","time":1359743339,"type":"comment"}