{"by":"davezatch","id":7970497,"parent":7970366,"text":"Uberall - <a href=\"https://uberall.com\" rel=\"nofollow\">https:&#x2F;&#x2F;uberall.com</a> - Berlin, Germany (Mitte)<p>WE ARE UBERALL – A young and ambitious technology startup from Berlin. We believe that the internet enables us to connect to our local environment in radically new ways and that it lets us navigate and shape our daily lives like we never before could. We want to be part of this development, bring customers and local businesses closer together and re-instill a sense of community where anonymity has become the norm. To this end we are building a revolutionary marketing platform for local businesses. This platform makes getting in touch and communicating with their customers through all relevant online channels super easy for them. Really.<p>These are amazing times – we are well financed, we have a beautiful office space in the heart of Berlin and we are looking to hire a number of highly motivated and skilled colleagues to join forces with us!<p>We are looking for backend engineers (m&#x2F;f) to support our tech team. You will be working closely with product development and be responsible for turning their wildest dreams into reality. Your skill-set includes:<p>-       Real passion for developing great web apps <p>-       Proven experience in Java &amp; web technology, possibly Grails <p>-       Building &amp; maintaining scalable architectures using modern tools<p>-       Enthusiasm for beautiful, pragmatic code and an eye for simplicity<p>-       Looking past your Java IDE to play with servers, databases, and web services is your everyday playground<p>-       Competent English ability. The team is international and English is the language of the office<p>We’re looking for YOU!<p>You already have at least some work experience, you have an above-average education and you thrive in an environment that lets you take on responsibility early on? You’re highly motivated, an independent thinker but still a team player and you’re hungry to do things that matter? Then you should join us!<p>You get the chance to become part of a young company with an ambitious and highly skilled team, to contribute to our vision to really bring local business to the web, to work on and implement your own ideas and to have a lot of fun on the way.<p>Just send your application containing all relevant documentation (including past projects, GitHub &amp; stackoverflow links, etc) and we will get in touch soon. Applications to jobs@uberall.com, please!","time":1404221564,"type":"comment"}