{"by":"trefn","id":7970770,"kids":[7970900,7977687],"parent":7970366,"text":"San Francisco, CA\nMixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mixpanel.com</a>) is the most advanced advanced analytics platform ever for web &amp; mobile applications.<p>Mixpanel is profitable, with thousands of customers and millions in monthly revenue.<p>ENGINEERING CULTURE<p>Our engineering culture:<p><pre><code>  * We do very thorough, line-by-line code reviews using GitHub pull requests. This keeps our code quality high and helps us learn.\n  * We try to have two people work together on every project (collaborating, not pairing). It&#x27;s more fun and it results in better code.\n  * We practice rapid iteration. If it&#x27;s better than live, we ship. We also build things so they can go live (whitelisted) long before launch day.\n  * We write tests for things that are mission-critical, prone to failure, or cause paranoia. Think billing and datastore code, not Django views.\n  * We care about learning. Right now we&#x27;re reading through Advanced Programming in the Unix Environment.\n  * We currently have 9 vim users, 2 IntelliJ, and 1 emacs holdout.\n</code></pre>\nENGINEERING POSITIONS<p>We have two types of engineering positions available - systems and product. Both of these positions require you to be able to work in San Francisco, CA.<p>Systems engineers build and scale our infrastructure, and write mostly C, C++, and Python. We are working on a number of new products right now with serious infrastructure challenges and we need more people with great depth to help us solve them. This position requires at least 4 years of experience.<p>Responsibilities of this role include:<p><pre><code>  * Working on our custom datastore (written from the ground up in C)\n  * Scaling the data processing pipeline (currently handling &gt; 50K requests per second)\n  * Building notification delivery infrastructure (currently sending &gt; 100M emails &amp; push notifications per month)\n  * General improvements to performance, reliability, and security\n  * Work with the rest of the engineering team to design, build, deploy, and maintain systems\n</code></pre>\nIf you&#x27;re interested in a more full-stack role, check out the Product engineer position: <a href=\"http://boards.greenhouse.io/mixpanel/jobs/7910\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;mixpanel&#x2F;jobs&#x2F;7910</a><p>--<p>The engineering team is still small (12), and there&#x27;s a lot of interesting stuff to do. Happy to talk details.<p>If you&#x27;re interested, drop me a line - tim@mixpanel.com.","time":1404224019,"type":"comment"}