{"by":"lnanek2","id":7970859,"parent":7970366,"text":"New Frontier Nomads - <a href=\"http://newfrontiernomads.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;newfrontiernomads.com&#x2F;</a> - hiring a Senior Android Developer in Seattle, WA (and other locations in USA)<p>-------------COMPANY DESCRIPTION-------------<p>We partner with startups and companies to validate, design, develop and launch innovative new web and mobile products. We design, build and validate MVPs, provide highly skilled product and software development teams on an ongoing basis, or augment and build internal teams around a core of highly skilled subject matter experts, all in exchange for fees and equity.<p>-------------JOB DESCRIPTION-------------<p>The product is a very exciting experimental offering and the client’s most important undertaking at the moment.   The environment is agile and collaborative.  The team is packed with experienced and accomplished developers.<p>Required skills:<p>Solid Android background\nExperience shipping products   \nTake-charge (do what it takes personality and sense of ownership of deliverables and timelines)<p>Desired skills:<p>Video streaming on Android \nQuality vs. lag tradeoffs \nDRM \nConsuming near realtime web services  \nFrequency vs. battery life tradeoffs \nCustom, high-polish UI components<p>-------------ADDITIONAL INFORMATION-------------<p>For idea-stage startups, we provide the most direct route from idea to product with traction. We help you de-risk, validate, design and develop your idea, we make sure the correct technical decisions are made from the start, and we help you collect and analyze key metrics which help you chart your path from unproven idea to product-market fit.<p>For later-stage startups, we provide a well-oiled, turnkey development team, and the peace of mind that comes with it. We take care of product and software development, so you can focus on your areas of core expertise, whether business development, fundraising, or marketing.<p>For companies, we build startup teams within large organizations. Our track record with early and later stage startups helps large companies create agile and lean processes which foster and enable innovation. We seed internal teams with highly skilled and innovative mobile and web resources, or we build-manage-transfer new teams around a core of highly experienced veteran mobile and web developers.<p>You can contact me at lnanek@gmail.com if interested or apply through our job ad here:<p><a href=\"https://www.smartrecruiters.com/NFN/76806044-remote-android-dev-must-live-in-us\" rel=\"nofollow\">https:&#x2F;&#x2F;www.smartrecruiters.com&#x2F;NFN&#x2F;76806044-remote-android-...</a>","time":1404224903,"type":"comment"}