{"by":"MattRogish","id":7970820,"parent":7970366,"text":"Rails Machine - <a href=\"https://railsmachine.com\" rel=\"nofollow\">https:&#x2F;&#x2F;railsmachine.com</a> - Remote, USA<p><pre><code>  ---------------------------------\n  ---- Who are we looking for? ----\n  ---------------------------------\n\n</code></pre>\nOperations professionals (DevOps, SysAdmin, Automation, DBA, Rails&#x2F;Node developers, etc.) with a strong customer-service bent. We support our clients by understanding and identifying their problems and proposing solutions to fix them. This might be running stuff on our hardware, it might be a mix of AWS and Heroku, or something else entirely.<p>We have no billable hours - we are empowered to fix issues, add memory&#x2F;CPU&#x2F;disk, etc. based on our pricing&#x2F;billing model.<p><pre><code>  --------------------------------\n  ---- What is Rails Machine? ----\n  --------------------------------\n</code></pre>\nRails Machine is a boutique managed services hosting provider for medium and large sized web firms. Although our name is &quot;Rails Machine&quot;, we operate a large Rails, PHP, Node, and Java application server farm (but Rails is the largest proportion). We have PostgreSQL, MariaDB, and MongoDB clusters. We multiple geographically distributed data centers. We have our own metal but also manage AWS, Heroku, etc. as necessary to achieve client goals.<p><pre><code>  -------------------------\n  ---- Extreme Support ----\n  -------------------------\n</code></pre>\nWe take an approach of extreme support - our default unit of work is the pull request on the client repo. We contract with our clients to provide a certain level of service (9&#x27;s, latency, response time, whatever) and we are empowered to do anything to resolve it (adding database indexes, removing N+1 queries in Rails code, etc.).<p>If bare metal is on one end of the spectrum, we&#x27;re on the complete opposite end. Off the charts.<p><pre><code>  -----------------\n  ---- Details ----\n  -----------------\n</code></pre>\nWe&#x27;ve been around and profitable since April, 2006.<p>We are a completely virtual&#x2F;remote company (although we have physical data centers). You can work from home or a local co-working place. Unfortunately, you need to be a US citizen to apply.<p>Salary plus profit sharing ensures  you&#x27;re paid well above average (75th percentile).<p>If you&#x27;re interested, drop me a line at matt at railsmachine.com.<p>Thanks!<p>--\nMatt","time":1404224533,"type":"comment"}