{"by":"gmac","id":7970694,"parent":7970366,"text":"PSYCHOLOGICAL TECHNOLOGIES (<a href=\"http://PSYT.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;PSYT.co.uk</a>) — Epsom&#x2F;Brighton, UK<p>* Seeking: experienced Android and&#x2F;or full stack engineer<p>WHAT WE DO.  We’re a tech startup creating corporate and consumer products to measure and enhance wellbeing and productivity. There are two strands to what we do. First, we quantify cognitive and psychological states, such as attention or happiness. Second, we deliver interventions, such as mindfulness, to boost cognitive and psychological skills. Web and mobile apps are key to both these strands.<p>WHO WE ARE.  Our backgrounds span finance, psychology, technology, and design. CTO George leads on the measurement side, having mapped the nation’s wellbeing with the Mappiness app (<a href=\"http://mappiness.org.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;mappiness.org.uk</a>). CEO Nick leads on interventions, as the former Head of Research for successful mindfulness app Headspace (<a href=\"http://www.getsomeheadspace.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.getsomeheadspace.com</a>).<p>WHAT WE USE.  We love CoffeeScript, both in the browser and for our internal app logic. Our back-end is largely Postgres and Ruby. We could imagine using Node, Python, Go and&#x2F;or R at some point; maybe other things too. Our iOS apps are C and Objective-C, of course, with liberal use of SpriteKit and Accelerate. We’ve tried RubyMotion (impressive, but probably not for us) and we’re playing with Swift. Our Android apps don’t exist yet, and that might be where you come in.<p>WHO YOU MIGHT BE.  We’re looking for someone smart, opinionated, and enthusiastic (in the face of interesting work). Someone with solid experience in web, Android (especially) and&#x2F;or iOS app development, who likes learning, and who agrees that UX is the most important — and usually the hardest — thing to get right. Bonus points for any of: user testing, sysadmin or database expertise; an interesting technical blog or Github&#x2F;BitBucket profile; and an interest in mindfulness or subjective wellbeing.<p>WHERE WE’RE AT.  Geographically we’re currently at Nuffield Health&#x27;s offices in Epsom (free gym and lovely offices) but a move to Brighton is likely in the works over the next year. We have just completed our first investment round. Currently our CTO does all development, so you’d be our first developer hire. That means we can be flexible about the work you take on, playing to your strengths and your preferences. That also means you can expect to help guide our development and share in our success.<p>Contact george(at)PSYT.co.uk","time":1404223416,"type":"comment"}