{"by":"adrianhon","id":7970423,"parent":7970366,"text":"Six to Start - London, UK - Senior iOS Developer&#x2F;Senior Android Developer<p><a href=\"http://sixtostart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sixtostart.com</a><p>We&#x27;re the indie game developers behind the world&#x27;s bestselling smartphone fitness game, Zombies, Run!, which has over 900,000 players. We&#x27;ve also created the NHS&#x27; first smartphone game, The Walk, which was Editor&#x27;s Choice on the App Store in the US and UK in December. The games we make literally improve people&#x27;s lives!<p>We are looking for a senior iOS developer with experience in creating innovative iOS apps or games. Our games combine innovative real-world gameplay with captivating stories and design. We want to find someone who can help us improve our existing games and develop new games that are just as revolutionary and innovative as Zombies, Run!<p>Responsibilities<p>* Developing new features for our existing games, and maintaining them to take advantage of new OS-level features (we&#x27;re currently targeting iOS7 for all our apps)<p>* Developing and designing new apps and games<p>* Working with our web developer to ensure good communication with our online services<p>* Working with our Android developers (currently, all of our games are available on both platforms)<p>Requirements<p>* At least two years of experience developing iOS applications.<p>* An enthusiasm for quickly learning and applying new and emerging technologies.<p>* An interest in games and game design, and a tenacious approach to problem-solving.<p>We&#x27;re a small, bootstrapped, profitable company that makes people&#x27;s lives better. Position is full-time and based in London.<p>See more info at <a href=\"http://www.sixtostart.com/onetoread/2013/senior-ios-develope..\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sixtostart.com&#x2F;onetoread&#x2F;2013&#x2F;senior-ios-develope...</a>. and email us at hello at sixtostart dot com.","time":1404220852,"type":"comment"}