{"by":"bignoggins","id":7970967,"parent":7970366,"text":"Yahoo Fantasy Sports - <a href=\"http://sports.yahoo.com/fantasy\" rel=\"nofollow\">http:&#x2F;&#x2F;sports.yahoo.com&#x2F;fantasy</a> - Sunnyvale, CA<p>We are the #1 fantasy sports destination on the web. Fantasy Sports is a booming industry that is growing every year and has one of the most passionate and engaged users on the web.<p>We have several positions that we are currently trying to hire for as we try to bring home the championship. Sports and fantasy knowledge is a plus, but not required. Just a willingness to get a little crazy and watch sports! Watching sports will be a part of your job, how cool is that? Here is what we are hiring for:<p>1. Data Scientist - We have some of the largest warehouses of both user generated and sports data anywhere. This is a sports nuts&#x27; dream! Apply for this if you love figuring out what users are doing and how to iterate on the product based on numbers.<p>2. Backend engineer - We are creating a new, state of the art backend infrastructure. Fantasy Sports is one of the most challenging backends on the web, due to the spiky nature of traffic. During an NFL Sunday, our peak RPS can exceed twitter! Apply for this if you love massive scaling and performance optimization.<p>3. Mobile engineer - Looking for both iOS and Android expertise. I was acquired by Yahoo last year (<a href=\"http://techcrunch.com/2013/07/01/yahoo-acquires-bignoggins-a-one-man-fantasy-sports-app-maker/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;07&#x2F;01&#x2F;yahoo-acquires-bignoggins-a...</a>), and my goal is to make Yahoo Fantasy Sports the runaway leader in mobile sports apps. We have a great team of designers and developers, and Yahoo mobile is actually now the largest mobile development organization in the world! We are taking mobile seriously, and you can help us get there.<p>4. SDET - For fantasy sports, we can NOT make mistakes. No fumbles, no turnovers, nothing. Our crack team of SDETs writes automated test scripts and build testing and release infrastructure to make sure that the devs can move fast and (not) break things!<p>Yahoo may not be the most glamorous company in the Valley, and we definitely don&#x27;t have it all figured out. Most startups let you make a big impact in a small pond, and a big company lets you make a small impact in a big pond. Yahoo is the rare opportunity to make a big impact in a big pond. There is a lot of low hanging fruit that we need to solve, and if you want to be part of one of the most epic turnaround stories in the Valley, then hit me up!<p>If you wanna come kick ass and chew bubble gum, hit me up at bignoggins@yahoo-inc.com!","time":1404225765,"type":"comment"}