{"by":"mrbird","id":7970776,"parent":7970366,"text":"Redwood City, CA - INTERN, VISA<p>No remote, but we do offer relocation and visa sponsorship.<p>Summary: We’re profitable, very open as a company, and supportive, and we need more engineers. EdTech.<p>Full description: Course Hero, the leading platform for crowd-sourced educational materials, is looking for a software engineer who can hit the ground running.\nOur team releases code every day to millions of people, so we&#x27;re looking for someone who can take on challenges, build new features, and iterate quickly. Each engineer has a role in building Course Hero&#x27;s architecture and will have the opportunity to touch all parts of the stack. Our projects are big -- terabytes of data and customers around the world -- but our team is small, so you’ll see projects from start to finish, working closely with product managers and designers to ensure successful results.<p>Our company culture is very open, flat, and transparent. We succeed and learn together. Our office is very comfortable, has a lot of natural light, and great amenities like a gym and walking trails onsite. We’ve tried hard to make this a pleasant and inspiring place to do creative work.<p>Most importantly, we seek to hire individuals whose personality, integrity and passion for our business make our team better as a whole. We’re growing fast, profitable (yes, it’s true!), and looking for another core team member to push us toward the future.<p>Our stack is LAMP (PHP&#x2F;Symfony) + jQuery and AngularJS, but we’re open to people with all kinds of experience. iOS would be a nice bonus.<p>More info: <a href=\"http://www.coursehero.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coursehero.com&#x2F;jobs&#x2F;</a> - Company video: <a href=\"https://www.youtube.com/watch?v=5ig5g4xp9tE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=5ig5g4xp9tE</a><p>Please email: jobs@coursehero.com (and put “Hacker News” in the subject)","time":1404224093,"type":"comment"}