{"by":"AgaMatrix","id":7971360,"parent":7970366,"text":"AgaMatrix Software Engineer - Salem, NH<p>Responsibilities\nRelies on experience and judgment to plan and accomplish goals. Performs a variety of complicated tasks. May lead and direct the work of others. A wide degree of creativity and latitude is expected.<p>Tasks\n*Designs, modifies, develops, writes and implements software applications for multiple platforms: iOS, Android, and web client&#x2F;server applications.\nCreates, supports, and&#x2F;or installs in-house tools for development and testing automation.\n    Assists in authoring and&#x2F;or reviewing software requirements.\n    Participates in Risk Analysis meetings for new and current products<p>Qualifications<p><pre><code>    Requires a bachelor’s degree in CS, CE, EE or equivalent experience in the field or in a related area.\n    Familiar with best practices and procedures of the field of software engineering.\n    High competency in a modern OO language.\n    Comfortable in a rapid, agile development environment\n    Deep knowledge of mobile and&#x2F;or web application architectures.\n    Able to write clear and accurate technical documentation\n</code></pre>\nWHAT WE DO:\nAgaMatrix is revolutionizing health care. We’ve sold over a million devices, two billion sensors, and we are the first FDA cleared medical device&#x2F;app that works with iOS. We’ve been featured by the New York Times and Fast Company, and we work with the world’s largest retailers (Walmart, Kroger, Target) and pharmaceutical companies (Sanofi, Perrigo) to change the way diabetes is treated. If you want to make a living while making a difference, we should talk.<p>You’ll be joining a team with numerous Ph.D’s and engineers&#x2F;scientists from a dozen countries, founded by a Marshall Scholar. There is never a lack of challenging problems.<p>WHO WE ARE:\nWe are driven, passionate people who value innovation and perseverance, while still enjoying a collegial, familial atmosphere. Our people come from a variety of backgrounds from biochemistry and algorithm design to industrial design and regulatory affairs, so you will have the chance to learn from many different disciplines.<p>WHERE WE’RE HEADED:\nWe are extending our product development group with an A-team of designers and engineers. This team will deliver on our vision for mobile diabetes care: leveraging hardware and software technology to reduce healthcare costs and enable a quantum leap forward in the quality of care for the 285+ millions of people with diabetes worldwide.<p>HOW TO APPLY:\nFor immediate review, send resumes to tnevin@agamatrix.com","time":1404228867,"type":"comment"}