{"by":"akubicek","id":7971249,"parent":7970366,"text":"Understory - <a href=\"http://www.understoryweather.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.understoryweather.com</a> - Boston, MA<p>About Us:<p>Understory—named for the area in a rainforest beneath the forest canopy—detects rain, hail, wind and other weather events directly at the earth’s surface, where the risk to life and property is greatest. While traditional, radar-enabled weather centers collect data by analyzing conditions observed in the atmosphere, Understory’s “ground-truth”-based detection is a marked enhancement in both resolution and fidelity, providing real time datasets and graphical views of the movement and intensity of weather events, which leads to better insight and early detection of risks.<p>Our company recently raised a seed round of $1.9 million and we are growing our engineering team.<p>We are currently working out of the Greentown Labs (<a href=\"http://greentownlabs.org/\" rel=\"nofollow\">http:&#x2F;&#x2F;greentownlabs.org&#x2F;</a>) space in Somerville, MA. We have a large office space, prototyping lab with awesome equipment, full kitchen, smash bros melee, and free coffee. Understory also provides a free employee membership to the nearby climbing gym - Brooklyn Boulders Somerville.<p>We are looking for the following full-time positions:<p>* Back End Engineer * Data Scientist *<p>------------------------------------------------------------------------------<p>Back End Engineer<p>Blend open-source technology with proprietary hardware to deliver real time data to customers quickly and efficiently. Build the robust interface between the weather stations and the web so that not a single data point is lost. Be on the ground floor of Understory - as we are building out our software team and make the technology choices that will be the structure for our platform. Work with our data science team to implement algorithms that predict thunderstorms and their outcomes.<p>------------------------------------------------------------------------------<p>Data Scientist<p>Use statistical, signal processing, and machine learning techniques with our proprietary sensor data to help solve the current data sparsity problem. Use findings from our local grids to improve the picture of nation-wide weather effects. Explore the business opportunities for such high density data in the current market of sparse data. Join the team that will revolutionize weather data.<p>------------------------------------------------------------------------------<p>If you are interested in these positions or think you would be a great fit for Understory, please see the full job descriptions at <a href=\"http://understory.theresumator.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;understory.theresumator.com&#x2F;</a> or email me at info(at)understoryweather(dot)com.","time":1404228283,"type":"comment"}