{"by":"alexkinch","id":7972526,"parent":7970366,"text":"Ziron - Junior Linux Systems Administrator (Office based), near Oxford, UK<p>Ziron is building a new generation of telecommunications operator, where APIs are at the heart of the service – and not just an afterthought.<p>As part of our rapid expansion we’re looking for a Junior Linux Systems Administrator to help expand our team at our Oxfordshire (UK) office, based in a beautiful listed former milking shed on a farm just outside Bicester.<p>Reporting to the CTO and working as part of a team based in the UK, US and Australia, you’ll be primarily responsible for monitoring, supporting and developing the company’s Linux-based voice and messaging platform. You’ll also be expected to assist with customer support enquiries, plus help diagnose and resolve any issues relating to third party suppliers.<p>You’ll need to have:<p>Good working knowledge of Linux (Centos)<p>Good working knowledge of MySQL<p>Experience of supporting web applications (PHP)<p>Bonus points if you have:<p>Knowledge of REST APIs\nUsed JIRA, Confluence, Zendesk before\nIncident and problem management experience\nBasic IP networking knowledge\nPrevious experience working in a customer support role\nExperience of noSQL technologies (e.g. Redis, MongoDB)\nExperience of FreeSWITCH, Kamailio, Kannel\nUnderstand any of the following: SIP, RTP, RTMP, WEBRTC, SMPP, SS7, SIGTRAN, ISUP, MAP\nKnow how to use Git\nDon’t mind the occasional out of hours &#x2F; weekend work<p>What we’ll give you in return:<p>A competitive salary with regular reviews\n28 days paid holiday (inclusive of public holidays)\nA shiny new Macbook Air\nFast-track career advancement\nHealthcare and company pension\nFree snacks and drinks\nA Fitbit and company contribution to gym&#x2F;fitness centre membership to balance up those free snacks and drinks\nThe chance to be part of a fast growing team in an exciting environment<p>* Please ensure you have the right to work in the UK before applying. Sorry, no sponsorship or relocation package *<p>Interested? Please email your CV and a covering note to jobs@ziron.com or visit <a href=\"https://ziron.recruiterbox.com/jobs/fk08qj/\" rel=\"nofollow\">https:&#x2F;&#x2F;ziron.recruiterbox.com&#x2F;jobs&#x2F;fk08qj&#x2F;</a> to apply","time":1404238616,"type":"comment"}