{"by":"abhiv","id":7972372,"parent":7970366,"text":"Full-Stack Software Engineers - Trulia, San Francisco - INTERN, VISA welcome; REMOTE possible<p>Contact me at abhi@trulia.com for more info, or send me your resume.<p>Positions are available on multiple teams at Trulia, including on the rentals team that where I work. We&#x27;re growing very quickly and aim to hire the highest quality people while doing so.<p>How we work:<p>The engineering team is about a hundred people, and we break into small teams of 2-4 to focus on specific projects. The rentals team is a small, vertically-integrated team within the larger engineering team. We are responsible for the entire Trulia Rentals product, giving us the speed and flexibility of a startup with the resources of a public company.<p>We release weekly, but new features are always under development and often span releases. Our local QA team writes automation tests and does hand testing of your features, working with you to ensure that only high quality code gets to production. Organizationally, we&#x27;re pretty flat, though you&#x27;ll have a mentor with whom you&#x27;ll have weekly 1-on-1 meetings, to review code, exchange ideas, and ensure we&#x27;re doing everything we can for you to thrive in your role.<p>Behind the curtain:<p>- &#x27;Innovation Week&#x27; every quarter - work on any project you like for one week each quarter, recruit others to work on your project with you, present your work to other engineers (if you feel like it)<p>- People you&#x27;re happy to see every day<p>- Stocked Kitchens and two kegerators<p>- Unbeatable SOMA location with penthouse roof deck<p>- All IDEs welcome<p>- Aeron chairs<p>- Great benefits (untracked time off, variety of health plans, 401k match)<p>You:\n- You have experience working on high-traffic, scalable internet applications<p>- You love solving hard problems and working in small teams with smart people<p>- You&#x27;re comfortable with everything from bash scripting to javascript<p>- You&#x27;re a great person<p>- You love making fast websites<p>What you&#x27;ll work with:<p>Our base web stack is LAMP, but that rides on top of Solr&#x2F;Lucene, Hadoop, Memcache, Python, Couchbase, Open Street Maps, and more. We’re rewriting our website to use Javascript on both client and server using Rendr.js, Node.js and Backbone.js. We use jQuery on the client, d3.js and Raphel.js for our charts and Git for source control. If there&#x27;s something that&#x27;s a good idea for the team, we&#x27;ll do our best to implement it.<p>Why work at Trulia?<p>Engineering gets respect.<p>We use the phrase &#x27;we&#x27;re a tech company that does Real Estate&#x27; to emphasize how important engineering is to the company. Engineering is the department that drives our apps, tools, data, and interfaces forward. This attitude comes not only from the Engineers, but from our CEO and other top management. They believe in us.<p>We have awesome problems to solve.<p>The housing market provides a fantastic blend of problems. We need creative people to help us combine the data about every address in America with the soft side of helping people find a home that makes them feel safe, happy, and comfortable.<p>Stability is wonderful.<p>We&#x27;re that rare company that holds the culture of its startup roots, while blending in the sanity of a regular work schedule with an emphasis on work&#x2F;life&#x2F;family balance.<p>Trulia is a successful rapidly growing Internet technology company, redefining the home search experience for consumers and changing the way real estate professionals build their businesses. Our marketplace, delivered through the web and mobile applications, gives consumers powerful tools to research homes and neighborhoods and enables real estate professionals to efficiently market their listings and attract new clients.\nTrulia was founded in 2005, backed by Accel Partners and Sequoia Capital, and had a successful IPO in 2012. We are headquartered in downtown San Francisco with offices in Denver and New York and voted Best Place to Work in both San Francisco and Denver.","time":1404237295,"type":"comment"}