{"by":"mag00","id":7972494,"parent":7970366,"text":"Coinbase, San Francisco, CA<p>Hi - I&#x27;m Ryan, I&#x27;m with Security @ Coinbase. We&#x27;re trying to make BTC easy to use.<p><a href=\"https://coinbase.com/mission\" rel=\"nofollow\">https:&#x2F;&#x2F;coinbase.com&#x2F;mission</a><p>We&#x27;re building out our security and engineering teams. We are based out of San Francisco, and have remote engineering options. We&#x27;re a company that cares deeply about our security engineers and how they improve our security every day, and we are looking for more.<p>We&#x27;re looking for engineers to build new security features for Coinbase, secure our customers, employees, products and infrastructure from all sorts of threats. We&#x27;re doing a lot of building, and looking for builders. Today, we&#x27;re a Rails+AWS shop, with mobile apps and lots more technology being built on the backend. We&#x27;re also building a culture and a company, so you should care about that stuff too.<p>We&#x27;re looking for software engineers, systems engineers, and security engineers... or whatever combination you might be. You should have no problem thinking like a bad guy and be up to date on building defensively. You shouldn&#x27;t be afraid of an incident and you shouldn&#x27;t be afraid of getting your hands dirty on new technology.<p>We&#x27;ve setup some fun tests (On HackerRank) to make sure everyone has a fair shake for an interview (Resumes can only tell us so much anyway) Choose one or more that suits your skillset, have fun, and hope we can talk soon.<p>App Security Engineer (Written) <a href=\"http://istest.co/prodsec1\" rel=\"nofollow\">http:&#x2F;&#x2F;istest.co&#x2F;prodsec1</a>\nApp Security Engineer (Coding) <a href=\"http://istest.co/prodsec3\" rel=\"nofollow\">http:&#x2F;&#x2F;istest.co&#x2F;prodsec3</a>\nSecurity Engineering (Written) <a href=\"http://istest.co/infosec1\" rel=\"nofollow\">http:&#x2F;&#x2F;istest.co&#x2F;infosec1</a>","time":1404238380,"type":"comment"}