{"by":"drone","id":7972106,"parent":7970366,"text":"Lead Developer &#x2F; MacroFab, Inc. &#x2F; Houston, TX Full-time<p>==== About MacroFab<p>MacroFab is making it easier, faster, and less expensive for makers and creators to get their designs to market through cloud-enabled electronics manufacturing and automated operations services. Our goal is to make it possible for any maker or product designer to get their product to market quickly and easily, whether their market is 100 users or 100,000.<p>Fully interactive and automatic production tools for electronic products, with direct control over all just-in-time manufacturing and fulfillment tasks through the web and via APIs. MacroFab is the first electronics manufacturing service to give makers and entrepreneurs a completely transparent, scalable, and manageable outsourcing capability.<p>===== Why Work with Us?<p>We’re creating the next generation of manufacturing services, one which is powered not by cheap labor, but by intelligent software and beautiful machines. We’re creating a service that has all of the capabilities we needed when we had a small products company. We’re makers, developers, and entrepreneurs who are working to enable other makers, developers, and entrepreneurs. We are all about building things: machines, software, and communities. We’re focused on that point where abstracts meet reality and concrete inventions are born. If you like creating new, beautiful code and machines, if you like the challenge of tackling difficult problems, and if you want to help inventors and makers get from idea to product fast while saving them money and time, then we’d love to have you on our team.<p>====== About You<p>As a Lead Developer at MacroFab, you’ll be responsible for creating stable, performant APIs and control systems to run our network of manufacturing equipment, 3D printers, and warehousing systems.  You’ll build great software to work with machines large and small, both purchased and built in-house.  If you like, you can help design and write the core software for those machines too.  You’ll build great, reliable APIs in Mojolicious, and solve complex task management in Python, C++, Erlang, or whatever language you believe will be able to solve the problem most effectively.  Of course, to fit in with our existing tech stack, you’ll have working knowledge of (Or, will be able to pick it up fast!) RabbitMQ, Elasticsearch, memcached, MySQL, and AWS APIs.<p>You’re the kind of person that thinks crafting 4-dimensional bin packing algorithms is fun, but also believes in shipping software every day.  You can get into the seat of your users and understand the pains they feel and absolutely must solve those problems with your work.  You always build software using best industry practices and have kept your knowledge of security and performance concerns up-to-date.  As a Lead Developer, you’ll pride yourself in the examples you set for your team. You’ll be part of a small team, and will have the autonomy you need to express your creativity in all of the ways you want.<p>======= Get in Touch!<p>Send your resume and some examples of your work to jobs@macrofab.net","time":1404235055,"type":"comment"}