{"by":"spicyj","id":7972215,"kids":[7975490,7990874],"parent":7970366,"text":"Khan Academy — Mountain View, CA (we also love interns, and remote is a possibility)<p>We&#x27;re a small, non-profit tech startup bringing a free, world-class education to anyone, anywhere.<p>Here&#x27;s a testimonial we received last wweek:<p>==================================<p>I just want to thank you soooo very much in high school it was very hard for me and I hated studying also even thou my mother told me it would help me I never listened and now I am in college and this website helps me so much with algebra&#x2F;health and so much more when I start working again I want to give back to you for helping me out in college and becoming a Doctor because you can never say never :)<p>==================================<p>Every month we get hundreds of letters like this from people in all walks of life who are thankful for our free, high-quality educational content. Most of you reading this are familiar with Sal&#x27;s videos, but we also have hundreds of videos by other teachers, partnerships with organizations like MoMA and the California Academy of Sciences, and a huge library of interactive exercises. Over 20 million math problems are done every week on our site.<p>You&#x27;ll be part of a small team working alongside both &quot;celebrity&quot; devs (like jQuery creator John Resig and Google&#x27;s first employee Craig Silverstein) and many more who you haven&#x27;t heard of but who are also really awesome.<p>We&#x27;re especially looking for new product designers (of all types) but we also have many engineering positions open as well as some positions for a teacher and contract question writers.<p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> and mention that you&#x27;re coming from HN. Feel free to email me at alpert+HN@khanacademy.org if you have questions about applying or about KA in general. Unfortunately we can&#x27;t sponsor visas right now unless you&#x27;re from Canada, Australia, or Mexico.","time":1404235953,"type":"comment"}