{"by":"ev-dev-dev","dead":true,"id":7972845,"parent":7970366,"text":"--- Off the Record - UI&#x2F;UX Designer - San Francisco, CA ---<p>We’re an off-the-record YC company building financial services tools. We&#x27;re already cash-flow positive, and laptops, and office snacks, and etc. and so forth. and general good things. Here&#x27;s what&#x27;s awesome: we have non-technical customers paying us for an online tool. Everyday, our clients call and email to say that we&#x27;re making them happy. And that feels great.\nBut there&#x27;s one problem: parts of our product are a little bit ugly and a little bit confusing. We&#x27;re rapidly adding new features, and we&#x27;re quickly outpacing our design capabilities. In short, it’s time to hire a UX&#x2F;UI designer.<p>Our clients use our product for hours at a time. This is their tool for getting their jobs done. It is their workflow. We want it to beautiful and intuitive. It should be easy for a new client to learn, while at the same time, it should make power users feel like they’re flying through their day.<p>You must have experience with The Struggle of Application Design. And frankly, you should enjoy this struggle, because it’s hard to get things right, but really rewarding when you do.<p>What would your first day on the job be like? Well, we’ve got a product live right now that processes several hundred orders per day. You now own the design and you will be responsible for improving it. Changes could be simple, like, ‘make this button blue’ or it could be more elaborate like, ‘add tooltips and a new customer tutorial,’ or maybe you might want to redesign aspects of the site from scratch. Ideally, within a couple weeks, clients should be telling us that they’ve noticed small, nice design improvements.<p>List of Responsibilities: - Design - Usability and Utility are more important (at the moment) than purely visual appeal. As a team, we frequently meet with our clients to learn how they’re using the product. A good candidate for this role will be able to speak to users and feel out their feelings.<p>List of Skills: - UI&#x2F;UX design experience - Responsive design experience (a lot of our clients access our site on their phones) - HTML&#x2F;CSS is great. At the moment, we’re using a lot of Bootstrap. Pixel perfect designs are not (yet) crucial; usability is paramount.<p>We’re in San Francisco on a trolley-filled street in Union Square. We’re small (3 in-office employees) and we’re still building a culture. If you have ideas for how to build a blissed-out company, we’re all ears. Thinking of moving to San Francisco, but not yet ready to commit? Talk to us.<p>Send an email to fintechw14@gmail.com telling us about yourself. Include a resume and a portfolio if possible.","time":1404241907,"type":"comment"}