{"by":"mixmastamyk","id":7973154,"parent":7970366,"text":"Senior Java Database Scalability Engineer - Weta Digital, Wellington, NZ<p>Imagine 50,000 Orcs beating at the door of your database app!\nThat&#x27;s the challenge you&#x27;ll get at Weta Digital.<p>We&#x27;re looking for a top developer to scale our Render Queue and Asset\nTracking applications to the next level.  Requirement:<p>1. Demonstrated ability to scale database applications using Java frameworks!<p>Details found below:<p><a href=\"http://www.wetafx.co.nz/jobs#Senior%20Java%20Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.wetafx.co.nz&#x2F;jobs#Senior%20Java%20Developer</a><p>Highlights:  Java, Spring, Postgres, MySQL, Linux Performance tweaking<p>Additional bonus items:<p>* Experience with Apache Thrift or Protocol Buffers for communication.<p>* Knowledge of porting from MySQL.<p>* Python, shell scripting, C++, git<p>* Familiarity with throttling erratic or demanding clients, both scripted\n  and in-the flesh.  ;)<p>* Must be willing to move to beautiful New Zealand for about a year.\n  Yes, there&#x27;s a reloc package and team to help you get settled.<p>If you&#x27;ve been living in the Bay Area or other big city such as LA, NY, or\nLondon, you&#x27;ll be happy to hear that for the price of a studio apartment there\nyou&#x27;ll be able to rent a three bedroom house with yard here, possibly with\nocean or bay views.<p>More perks:<p>* Monday continental breakfast, everyday organic fruits &amp; veggies, espresso,\n  dinner when on overtime, and &quot;Beer o&#x27;clock&quot; happy-hour on Friday.<p>* Beautiful scenery in every direction for weekend trips.<p>* Good to great schools and healthcare.<p>* Credit on future films you can probably guess the names of.<p>And fair warning, as nowhere is perfect:<p>* Winters are cold and windy in Wellington, but it keeps things interesting.<p>* All employees are contractors and paid by the hour, 50 hrs is typical but\n  up to you.<p>* Lots of legacy software and procedures after 20 years in business--\n  we&#x27;ll need your help to update them.<p>* Occasionally noisy but fun office environment (think Nerf bullets).<p>Please apply at the link above.  If you&#x27;d like to reply here, I&#x27;ll confirm that\nyour resume makes it through HR.<p>_____________________________________________________","time":1404245003,"type":"comment"}