{"by":"NationBuilder","id":7973369,"parent":7970366,"text":"NationBuilder, Senior Ruby Engineers, Los Angeles- CA\nNationBuilder is an online Community Organizing System built by a world-class team dedicated to empowering a new generation of leaders and creators with the tools they need to create a new world.<p>We’re currently hiring great software developers to join our core and web systems teams in Los Angeles.  We will relocate folks, so if you’ve ever wanted to live in LA, this is probably the best opportunity you’ll get. (And if you never considered living in LA we’ll convince you that it’s the greatest city to live in.)<p>Our driving force as a company is to empower organizers to make the world a better place, and we do this by creating a powerful product with a great customer experience.<p>As a team we are dedicated to continuous learning and improvement.  We will push code within minutes of a customer reporting a problem, and our entire process is set up for rapid iteration and agile development.<p>On our core and web systems teams, you will build, extend, refactor, and scale the core parts of our product. From systems that form a content management system for websites, to a comprehensive control panel for relationship and contact management, to scalable integrations with domain management and email systems -- you will be responsible for keeping NationBuilder running well, becoming better and faster, and achieving our mission. Your skills will need to be balanced between the front-end and the back-end, as you will cross layers from the database to JavaScript in order to develop new features. Your troubleshooting skills will allow you to drill down from a bug report to a solution regardless of complexity. You will work with the product management team to develop delightful, usable, fast, and maintainable features that solve real customer needs.<p>You:<p>are always interested in learning new things.<p>get excited when you have the chance to pair.<p>practice test-driven development and judicious refactoring.<p>enjoy being responsive to customer feedback.<p>are a pragmatic problem solver, knowing how to find the middle ground between “perfect, but takes forever to code” and “fixes it now, but nobody will ever be able to understand what I did”<p>work well in small teams with a clear mission.<p>detail oriented and precise in code, communication, and documentation.<p>have the insight to know what’s important and the dedication to get it done.<p>Skills required:<p>While existing experience with the technologies we use is welcome, an open and disciplined approach to your work is more important to us than whether you already know Ruby, Rails or anything else in our stack. We value the willingness to learn our technologies and environment over domain-specific skills.<p>We use Ruby, Rails, PostgreSQL, MongoDB, Redis, HTML&#x2F;CSS&#x2F;SCSS, and JavaScript (JQuery, Handlebars.js, Underscore.js, etc).<p>Please send email to mona@nationbuilder.com with:<p>Contact details, resume, that sort of thing<p>Sites you’ve worked on recently<p>GitHub account (or other online code) if you have it","time":1404247101,"type":"comment"}