{"by":"varunsrin","id":7974135,"parent":7970366,"text":"SoundFocus - San Francisco, CA<p>Roles: iOS Engineer, Product Marketer, Community Manager<p>Full-time in SF (VISA ok, will relocate)<p>==================================<p>TL:DR; We&#x27;re a YC-backed startup building audio hardware to help people hear better using their mobile phones when making phone calls, listening to music or watching movies. If you&#x27;re an iOS dev, marketer or community manager that&#x27;s passionate about audio hardware or music, email me varun@soundfocus.com.<p><a href=\"http://soundfocus.com/jobs.html\" rel=\"nofollow\">http:&#x2F;&#x2F;soundfocus.com&#x2F;jobs.html</a><p>==================================<p>iOS Engineer<p>We&#x27;re looking for an experienced mobile engineer to take ownership of our user-facing software stack, including our iOS and Android applications. Our ideal candidate is passionate about developing beautiful user interfaces, and has an eye for design and detail. As an early employee at SoundFocus you&#x27;ll get a chance to develop products that will have a positive impact on the lives of millions who face hearing-related challenges.<p>==================================<p>Product Marketer<p>SoundFocus is looking for a product marketing manager to drive the launch for our first hardware product. You’ll be instrumental in crafting our go-to-market strategy and will need to know our customers inside out. In addition to spearheading our marketing efforts, you’ll also be tasked with building strong connections with cultural icons and industry leaders. As the first hire on the marketing team, we’re looking for someone who’s creative, scrappy, and resourceful, with a successful track record of strategic business development and cultivating meaningful relationships.<p>==================================<p>Community Manager<p>SoundFocus is looking for a community manager who will play a critical role by building a strong and vibrant community of both current and potential customers. Your overarching goal will be to ensure that each and every individual has an interaction with the product and the team that is as positive and rewarding as possible.<p>You should be energetic and enthusiastic, with an innate ability to build and maintain great relationships with people at all levels, from the janitor to our world famous customers. You will be first in line to help people understand the product and engage with it.","time":1404257344,"type":"comment"}