{"by":"twakefield","id":7974009,"parent":7970366,"text":"Rackspace - San Francisco, CA (will relocate and remote possible)<p>TLDR; email me if you want a great job writing software to change the world: taylor@hackrackspace.com.<p>Ok, it&#x27;s time to make a decision…<p>Do you want to write closed-source software to enrichen your corporate overlords...do you want to take a flyer with a startup and do all the work without the big founder upside...or do you want to write open-source software and collaborate with other awesome devs around the world working on the leading edge of cloud computing, while making great salary and benefits?<p>If it&#x27;s the latter, we are changing the future of cloud computing at Rackspace and collaborating with OpenStack, Docker, CoreOS and anyone else that wants to joint the OSS cloud party. Just check out our latest offering, OnMetal [1], which is a combination of open source software (OpenStack) [2] and open source hardware (OpenCompute) [3].<p>If you are passionate about OSS&#x2F;cloud&#x2F;distributed systems, we would love to have you be part of our team in SF. We have positions available in a startup environment with recent acquisitions Mailgun and Exceptional.io, as well as big, hairy distributed computing problems to solve at Rackspace. So there is something for everyone.<p>We are located in the SoMa neighborhood in San Francisco on 2nd St. and Folsom.<p>Below are some positions currently available:<p>* All: Get stuff done, people that are motivated to make an impact.<p>* All: Excited to build new products, passion for new technology, new programming models.<p>* Backend Engineer: Distributed systems experience, passion for large scale systems.<p>* Frontend Engineer: Architecting interesting fully client side apps, dashboards, live updates, etc...<p>* Data Engineer: Building big data systems to be used throughout the company.<p>* Spam Fighting Engineer (Mailgun): Finding spammers and fraudsters with smart algorithms.<p>* Deliverability Engineer (Mailgun): Automating email deliverability best practices into code.<p>* Marketing Manager (Mailgun and Exceptional.io): Taking the lead on these teams&#x27; marketing efforts.<p>I was a co-founder of Mailgun and I run the SF office so email me directly if you are interested: taylor@hackrackspace.com.<p>[1] <a href=\"http://www.rackspace.com/cloud/servers/onmetal\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rackspace.com&#x2F;cloud&#x2F;servers&#x2F;onmetal</a> \n[2] <a href=\"https://www.openstack.org\" rel=\"nofollow\">https:&#x2F;&#x2F;www.openstack.org</a>\n[3] <a href=\"http://www.opencompute.org\" rel=\"nofollow\">http:&#x2F;&#x2F;www.opencompute.org</a>","time":1404255693,"type":"comment"}