{"by":"jandw","id":7976828,"parent":7970366,"text":"UX Designer — MIT Cambridge, MA<p>We&#x27;re looking for someone to help us plan, design, code and test the user workflows, behaviors and interfaces of web-based applications. This role will work to understand the needs of an application&#x27;s users and translate that knowledge into the creation of workflows and experiences that promote learning, with special emphasis on usability. As a member of the User Experience &amp; Interaction team, this candidate works closely with product management, programmers and other designers to translate product requirements into highly usable web applications using cutting edge technology. The UX Designer must be comfortable addressing a complex and diverse set of interaction problems, and researching and&#x2F;or developing new solutions to design&#x2F;technology challenges.<p>This role must be comfortable working both independently and collaboratively, with good time management skills, solid team experiences and proven judgment in order to plan, prioritize and accomplish goals. Strong creative skills and effective decision-making skills are required.<p>•       Develop conceptual models, storyboards, scenarios, flowcharts, prototypes, detailed UI design requirements and interface designs.\n•       Build and write design deliverables to effectively communicate functional behavior to stakeholders.\n•       Create, run and analyze usability tests to measure effectiveness of UI solutions; incorporate results into overall UX design through assessment and prioritization of business, technical and user constraints. \n•       Knowledge of ARIA, usability, accessibility (508-compliance) and cross-browser compatibility\n•       Evaluate effectiveness of new and existing projects and features through performance metrics, customer feedback, competitive landscape, and industry standard best practices to evolve and continuously improve user experience.\n•       Perform necessary research for each project including ethnography, competitive analysis, and participatory exercises.\n•       Advise client&#x2F;team&#x2F;stakeholders on user experience and human factors best practices.\n•       Present prototypes to client&#x2F;team&#x2F;stakeholders and iterates as appropriately.\n•       Proficiently code in HTML and CSS&#x2F;SASS; advocate web standards, cross-browser compatibility and semantic mark-up; hold basic understanding of Javascript&#x2F;AJAX.\n•       Actively identify product issues, propose solutions, participate in quality improvement activities.\n•       Maintain strategic outlook and great attention to detail.\n•       Collaborate within a dynamic multidisciplinary team.\n•       Have excellent written and verbal communication skills.<p>Please submit a CV, portfolio and cover letter to jandw@mit.edu<p>Thanks!","time":1404307957,"type":"comment"}