{"by":"clieu","id":7981695,"parent":7970366,"text":"ClustrixDB - San Francisco, San Jose, or Seattle<p>---- Senior Software Engineer ----<p>Clustrix is solving one of the most difficult open problems in the software database industry today: scaling SQL. We’ve built our own distributed relational database from the ground up. Now we’re looking for smart and motivated folks to join our small team of developers and take this technology to the next level. We work on:<p>- a C codebase written mostly in continuation-passing style\ndatabase fundamentals: B-trees, logging and recovery, checkpointing, MVCC<p>- a Paxos-based distributed system: group membership, transaction consensus, global checkpoint<p>- a query planner and compiler, modeled on the Cascades Framework, which generates distributed queries<p>- a rebalancer, which manages data distribution across the cluster<p>You should be someone with experience in databases, file systems, or other systems at scale and comfortable with designing efficient programs in C.<p>Here are some things that make Clustrix a great place to work:<p>- Our team is small, so you get to own significant projects and contribute in a big way to the product.<p>- We have a lot of interesting problems to work on, in a variety of areas.<p>- Our customers love us. We help them do things they could never do with their legacy SQL databases.<p>- We are passionate about making our software work better and faster<p>Our customer base is growing, both in number and in size of deployment. Their  clusters keep getting bigger and their  workloads more varied, so you will see interesting challenges and solutions in solving those.<p>We have offices in Seattle, San Jose, and San Francisco, with all the perks you expect from a startup (happy hours, snacks, hoodies, etc).<p>Let’s build a scalable database!<p><a href=\"http://www.clustrix.com/company/careers/openings/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.clustrix.com&#x2F;company&#x2F;careers&#x2F;openings&#x2F;</a>","time":1404367355,"type":"comment"}