{"by":"teripremise","id":7984928,"parent":7970366,"text":"Premise Data Corporation,San Francisco<p>------About Premise------\nPremise is building a novel information-gathering network on a global scale. The network harnesses the explosion in mobile technology, combined with sophisticated machine learning capabilities, to aggregate observations from users all around the world to deliver business, economic and human development data in real-time. We are growing the platform to sufficient scale where it will deliver any user-observable information on demand, whether that is the price of food staples at a Mumbai street market, or the length of a queue at a Walmart de México parking lot.<p>We’re a fast-growing startup – bolstered by the backing of significant ‘smart money,’ but still young enough such that you’ll be a core member of the team that is reinventing how the human race understands its own economic activity. We’re being helped in our mission by Silicon Valley’s most creative and disruptive investors: Social+Capital Partnership, Google Ventures, Andreessen Horowitz and Harrison Metal.<p>Bottom line, this is an opportunity for someone who:<p>Wants to build something meaningful at a fast-growing and mission-driven startup\nWants to contribute to the amazing, messy evolution of the open-source ecosystem\nActually cares about social good enough to make Premise a permanent part of their resume\nRead more about Premise in TechCrunch, New York Times, Wired, The New Yorker, TheAtlantic, MIT Technology Review and The Wall Street Journal.<p>Benefits &amp; Perks\n<i>Great open office workspace in SF SoMa&#x2F;Design District, near CalTrain, BART, 101&#x2F;280.\n</i>Competitive salary and equity packages.\n<i>Health, dental, and vision benefits.\n</i>Open vacation policy. We hire folks who ship and love to code, no need to count days.\n<i>Create your ideal work environment.\n</i>Free healthy meals, snacks, and beverages.<p><i></i><i></i><i></i><i>Software Engineer- Data</i><i></i><i></i><i></i><p>Responsibilities:\n<i>Build data pipelines that analyze web content as well as user activity to drive features ranging from user-engagement, user-retention, notifications, targeting, geo-spatial applications, A&#x2F;B-experimentation, cohort&#x2F;session analytics\n</i>Develop &amp; launch algorithms to extract signals from data, develop recommenders, extract entities, generate product taxonomy, detect sentiment, improve search relevance and generate user preferences\n<i>Develop &amp; launch algorithms for time-series analysis, anomaly detection, analyze media, generate indices based on econometric models\n</i>Own release and quality assurance of data sets, including QA&#x2F;side-by-side eval &amp; pipeline metrics<p>Required Qualifications:\n<i>Experience developing, releasing, and maintaining search&#x2F;knowledge&#x2F;data-mining applications (send us links to your projects)\n</i>BS, MS or PhD in Computer Science or equivalent work experience &amp; analytical skills\n<i>2+ years of experience in developing applications using one or more of: Java, Python, Scala\n</i>Deep understanding of Data Structures, Algorithms, Machine Learning, Statistical Methods\n<i>Working knowledge of at least two of: MySQL, Redis, Hadoop&#x2F;Spark, MongoDB, Protocol Buffers&#x2F;Avro, Play Framework\n</i>Passion for learning and sharing knowledge with the team around you<p>Bonus Qualifications:\n<i>Experience building consumer&#x2F;marketplace products\n</i>Experience with one or more of NLP toolkits (Lucene, Solr&#x2F;ElasticSearch, NLTK, Hadoop&#x2F;Cascading&#x2F;Scalding, Apache Tika)\n<i>Experience with graph databases &amp; computing models (Neo4j, Gigraph, Titan)\n</i>Passion for creating products; personal projects or other work (send us links to your GitHub repos)<p><i></i><i></i><i></i><i>Software Engineer- Computer Vision</i><i></i><i></i><i></i><p>Responsibilities:\n<i>Build data pipelines that analyze user-generated images and other media, to drive features ranging from automated quality control, user-engagement, user-retention, targeting, gamification\n</i>Develop &amp; launch algorithms to extract signals from time-varying text, numerical &amp; image data, develop recommenders, extract entities, generate product taxonomy, detect sentiment, improve search relevance and generate user preferences\n<i>Develop &amp; launch algorithms for time-series analysis, anomaly detection, analyze media\n</i>Own release and quality assurance of data sets, including QA&#x2F;side-by-side eval &amp; pipeline metrics<p>Required Qualifications:\n<i>Experience developing, releasing, and maintaining vision&#x2F;knowledge applications (send us links to your projects)\n</i>BS, MS or PhD in Computer Science or equivalent work experience &amp; analytical skills\n<i>2+ years of experience in developing applications using one or more of: Java, Python, Scala\n</i>Deep understanding of Data Structures, Algorithms, Machine Learning, Statistical Methods\n<i>Expert knowledge of vision related libraries such as OpenCV, SimpleCV, CCV as well a familiarity with NLP toolkits.\n</i>Passion for learning and sharing knowledge with the team around you<p><i></i><i></i><i></i><i>Software Engineer- Backend</i><i></i><i></i><i></i><p>Responsibilities:\n<i>Build backend applications that drive features ranging from user-engagement, user-retention, notifications, targeting, experimentation, analytics, and interfacing with external systems\n</i>Collaborate with frontend engineers to build clean &amp; well-documented APIs that drive fast &amp; highly relevant user experience.\n<i>Collaborate with data engineers to build scalable pipelines ranging from ingest content, cleaning web content, deriving signals that feedback into the application\n</i>Own release and quality assurance of backend components, automate testing infrastructure &amp; performance monitoring<p>Required Qualifications:\n<i>Experience developing, releasing, and maintaining backend Applications (send us links to your projects)\n</i>BS, MS or PhD in Computer Science or equivalent work experience &amp; analytical skills\n<i>2+ years of experience in developing backend applications using two or more of: Java, Python, Scala, Ruby, Node.js\n</i>Deep understanding of Data Structures, Algorithms, Distributed Computing, Storage Systems\n<i>Deep understanding of at least two of: MySQL, Redis, Hadoop&#x2F;Spark, MongoDB, Protocol Buffers&#x2F;Avro, Play Framework\n</i>Passion for learning and sharing knowledge with the team around you<p>Bonus Qualifications:\n<i>Experience building consumer products using Facebook, Twitter APIs\n</i>Experience building or interfacing with XMPP-based systems, or other messaging&#x2F;notification platforms\n<i>Information Retrieval (Lucene, NLTK), data-mining, data-modeling\n</i>Experience building scalable mobile&#x2F;web applications with HTML5 as well as server-side components using Python, Ruby, Scala, MySQL or similar technologies\n<i>Passion for creating products; personal projects or other work (send us links to your GitHub repos)\n</i>Maven, Intellij, Gradle, SBT, JUnit, Remote Debugging, JVM cpu &amp; memory profiling, Continuous Integration, Continuous Deployment","time":1404413664,"type":"comment"}