{"by":"maramartin","id":8001551,"parent":7970366,"text":"Wearable Intelligence - San Francisco, CA - <a href=\"http://wearableintelligence.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;wearableintelligence.com&#x2F;</a><p>Our mission is to empower every enterprise by giving their employees the right information at the right time. We’re the first enterprise company devoted specifically to wearable technology, and we’re solving difficult problems for real customers that will impact 80% of the world’s workforce, from doctors &amp; nurses to manufacturing and energy workers.<p>Our leadership team includes folks who’ve built and sold successful companies, and we’re backed by First Round Capital, Andreessen Horowitz, Google Ventures, Kleiner Perkins, and other prominent investors.<p>Android Engineer:<p>We’re looking for a capable, curious and smart Android Engineer to join our team. You’re a tinkerer and an aesthete, and you like to write code that gives mobile and wearable devices magic abilities. You have a passion for building great products that are robust and enjoyable, and you’re interested in stretching the boundaries of what’s possible on wearable hardware.<p>As one of our early team members, you’ll work directly with our leadership team to develop software for wearable devices -- from our product suite to core framework components -- and help us ensure optimal performance for our clients. We’re growing, and we’d be thrilled for you to grow your career with us, be it into a senior engineer, team lead, or architect.<p>Apply here: <a href=\"http://buff.ly/1qPkvPd\" rel=\"nofollow\">http:&#x2F;&#x2F;buff.ly&#x2F;1qPkvPd</a><p>Full Stack Engineer:<p>We’re looking for a Full Stack Engineer to join our growing team. You have a knack for strong user-centric design, and also speak the language of libraries and frameworks. You stay on top of web technology trends and know the best practices and idioms of writing Javascript- and CSS-rich software.<p>As one of our early team members, you’ll learn from and work directly with product managers, designers and senior engineers to develop complex in-browser apps as well as the web platform for the client-facing part of our product. We’re growing, and we’d be thrilled for you to grow your career with us.<p>Apply here: <a href=\"http://www.thesourcery.com/jobs/760\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;760</a>","time":1404768547,"type":"comment"}