{"by":"ollieglass","id":8003938,"parent":7970366,"text":"Silicon Milkroundabout - LONDON &#x2F; UK - ollie@siliconmilkround.com<p>tl;dr: seeking back-end engineer to lead development of Rails product suite<p><pre><code>  #############################\n  # Who are we?\n  #############################\n</code></pre>\nWe&#x27;re Silicon Milkroundabout, the jobs fair for software developers, product managers, designers and marketers interested in working for UK tech startups. We put people directly in touch with the founders and teams behind 150 startups. This works: face-to-face conversations happen, and more than 1,000 people have found new jobs through us since our first event in 2011.<p><pre><code>  #############################\n  # Who we’re looking for\n  #############################\n</code></pre>\nWe’re looking for an engineer with experience of the usual tech stack ­ AWS, Heroku, Github, Postgres, Rails and JavaScript ­to manage and develop our suite of products. You’ll be strong with development and devops, confident adding features to Rails apps, managing processes such as cron jobs, queuing and database migrations. You’ll move us to continuous integration, test driven development and automated server configuration, ensuring everything keeps working as we migrate. You’ll have a solid disaster recovery plan, but you’ll do what it takes to ensure we don’t need to use it.<p>You’re might not call yourself a front­end or full­stack developer, but you’re comfortable updating existing views and adding whole new user flows to an app. You’re happy to roll your sleeves up and use jQuery and Twitter Bootstrap to get the job done. You know enough CSS to make it look tidy, but you’re not trying to win design awards for your work - you’re happy when everything’s working.<p><pre><code>  #############################\n  # Why we’re hiring\n  #############################\n</code></pre>\nWe’ve worked with four freelancers in two years, have done a few too many rewrites and maybe didn’t think carefully enough about our build versus buy decisions. We’re looking to put that right. We need someone who can join us for the long term, a safe pair of hands to fix up our systems and fill in the gaps, then take our technology platform to the next level as our company grows. You’ll start working on the SMR product suite, including a B2C web app, a sales CRM, candidate vetting tools and an event check­in app. We also have a public API, event tools, B2B site, data visualisations and a range of microsites in the pipeline. We hope you’ll help shape our roadmap, and as we’re a small team, you’ll join in conversations on everything from our marketing, expansion plans and event experience.<p><pre><code>  #############################\n  # Must have\n  #############################\n</code></pre>\n- Experience with AWS, Heroku, Github, Postgres, Rails and JavaScript\n- Experience building and maintaining reliable, performant, secure web apps\n- Committed to writing elegant, maintainable code with great test coverage\n- Reasonable front­end development skills with HTML, CSS, JavaScript, jQuery and Bootstrap - enough to get the job done<p><pre><code>  #############################\n  # We&#x27;re offering\n  #############################\n</code></pre>\n£40-55k salary depending on skills and experience.<p>All the usual startup perks: a nice office in Shoreditch just off Hoxton Square, a £2000 equipment budget to buy whatever you need (Mac, Linux, desktop, laptop, dual monitors... whatever you’re comfortable with), unlimited freshly ground coffee and table tennis.<p>Contact ollie@siliconmilkround.com","time":1404818365,"type":"comment"}