{"by":"zemo","id":16287389,"parent":16282819,"text":"Jackbox Games | Chicago, IL | Onsite | Full-time<p>I&#x27;m hiring a person to join me in running the infrastructure at Jackbox Games. We make party games like Quiplash, Fibbage, and You Don&#x27;t Know Jack. Here&#x27;s a gameplay example from when Jimmy Fallon played Quiplash on his show: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=UTe6yVbM2Ks\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=UTe6yVbM2Ks</a><p>Our infrastructure team right now is, er, me. I could use a hand running the multiplayer servers. The servers themselves are socket.io servers written in node, but I&#x27;m transitioning them to Go. Players play our games from a web app on their phones, which acts as the controller. The controller and the game consoles both connect to a server, which is really a glorified messaging proxy. Most of our games are designed for up to 8 players, some more, some less. Many of our games support live audiences of up to 10,000 people; some popular streamers stream our games on Twitch so that their streaming audience can participate in the games, and our games are played at public events (football halftimes, for example).<p>I&#x27;m the lead engineer on the multiplayer server application and the lead devops person. A few of the other engineers pitch in a few hours a week with the servers but I&#x27;m the only person working on the server infrastructure full time. We&#x27;re hoping to find someone to help us continue to evolve the multiplayer server application and share the devops work. We have a handful of ancillary web apps to run, like asset-generating servers, a shopping cart app, and an internal CMS that we use for managing game assets. Redis, AWS, Terraform, Chef, node.js, golang, blah blah blah, we use those things and some other things, too.<p>Here&#x27;s the job description:\n<a href=\"https:&#x2F;&#x2F;jackbox-games.breezy.hr&#x2F;p&#x2F;495ceb424998-infrastructure-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;jackbox-games.breezy.hr&#x2F;p&#x2F;495ceb424998-infrastructur...</a>","time":1517532507,"type":"comment"}