{"by":"SDang","id":16282953,"parent":16282819,"text":"Engagency | Sitecore (Enterprise .NET CMS) Partner | Austin, Texas | ONSITE | Full-Time<p>Are you tired of working at a soul-less job with little to no chance for personal and career development? Tired of working on projects that aren&#x27;t challenging? Tired of being one of the few people on your team that actually pulls your weight? Tired of working fifty-, sixty-, and seventy- hour weeks and never feeling like you&#x27;re getting ahead on projects?<p>We were too, and that&#x27;s why we&#x27;ve set out to do things differently. We&#x27;re looking for like-minded developers to join our team and make a difference.<p>Engagency is a .NET shop in Austin, Texas that develops and maintains websites built on the Sitecore content management system and associated integrations. We&#x27;re a small, growing, collaborative team that values long-term client relationships and maintaining a good work&#x2F;life balance. Our goal is to serve our clients by maximizing the return on their investment in the Sitecore platform.<p>Sitecore is an enterprise-class content management system and is recognized by Gartner as a Digital Experience Platform leader.<p>What we&#x27;re looking for:<p>- US Citizens Only - are unable to provide visa sponsorship at this time\n- Onsite developers - we value in-person, face-to-face interaction\n- 2+ years of experience w&#x2F; ASP.NET MVC + C#, CSS, and JavaScript\n- Self-starters who are detail-oriented, collaborative, and can work with little supervision\n- Strong communicators who are comfortable speaking directly to a client<p>What to expect:<p>- You&#x27;ll immediately begin learning Sitecore and how to build components for it\n- At the conclusion of your training, you&#x27;ll be assigned to a project and work with one or more developers. You&#x27;ll be expected to contribute working code and components.\n- By your three-month review, you&#x27;ll be expected to be fairly self-sufficient and contribute to code reviews.\n- As you progress further and become more comfortable with ongoing projects, you&#x27;ll be expected to interact with clients regularly, understand their business requirements, and make recommendations regarding architecture and project direction.<p>Email careers {at} engagency.com, using the subject &quot;Hacker News: Sitecore Developer&quot;, with a link to your LinkedIn profile and any other relevant material (Github profile, resume, etc.).","time":1517501583,"type":"comment"}