{"by":"neiljohnson","id":16283647,"kids":[16289465],"parent":16282819,"text":"New Vector (Matrix.org Riot.im) | London, UK &amp; Rennes, Fr | ONSITE | Full-time | Team of 13 growing rapidly<p>New Vector is the open source software development startup which employs the core team behind Matrix.org – the leading project for secure decentralised communication.  Matrix’s mission is to create a universal open network and protocol for real-time communication; liberating users from being trapped in the islands of communication they use today and returning ownership and control of communication back to the people. New Vector builds flagship apps for Matrix such as Riot.im as well as contributing to the core Matrix open source clients, SDKs, servers, bridges and the protocol itself.<p>We believe that the Matrix protocol has the potential to become part of the fabric of the internet, bringing with it a future radically different from the increasingly centralised internet we see today.<p>While New Vector is self sufficient, following a recent funding round [1,2] we are looking to grow the team across the stack. In particular:-<p>* UX&#x2F;UI Designer to work on Riot web and native apps<p>* Backend Engineers to work on homeserver development as well as bridges, bots, integrations and widgets.<p>* Android Engineers to build out the matrix-android-sdk and Riot.im app<p>* Frontend Engineers to build out the matrix-react-sdk and Riot.im web experience<p>* SREs to support matrix.org and riot.im infrastructure<p>* Cryptography Engineer to move our E2E Encryption out of beta<p>If you are up for the challenge or just want to know more, either write to us at jobs@matrix.org or reach out to me via matrix IM on @neilisfragile:matrix.org<p>Even if you are not a perfect match for the above get in touch anyway, we’re always keen to talk to people interested in Matrix.<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16258263\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=16258263</a>\n[2] <a href=\"https:&#x2F;&#x2F;matrix.org&#x2F;blog&#x2F;2018&#x2F;01&#x2F;29&#x2F;status-partners-up-with-new-vector-fueling-decentralised-comms-and-the-matrix-ecosystem&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;matrix.org&#x2F;blog&#x2F;2018&#x2F;01&#x2F;29&#x2F;status-partners-up-with-n...</a>","time":1517505527,"type":"comment"}