{"by":"mwadams","id":16285404,"parent":16282819,"text":"Endjin | UK | Azure | <a href=\"https:&#x2F;&#x2F;endjin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;endjin.com</a><p>Do you think you would like to come and explore what is happening in data, analytics and business transformation with us in 2018?<p>Are you the kind of person that just can&#x27;t leave a question unanswered? Do you really want to know how things work, and share that knowledge with your team and the wider community? Do you understand how people and technology can come together to craft something special, each reshaping the other?<p>Endjin are hiring developers at all levels, from apprentices to seniors, to work on exciting projects with clients from all over the world, in verticals from retail to financial services, utilities and media.<p>We build modern data platforms in the cloud, and use them to help businesses adopt machine learning, data science, and automation.<p>We work with fascinating new technologies like Service Fabric, Reactor, Cosmos DB, and Data Lake to develop novel software architecture at the boundaries of hyperscale computing, for our clients, our own internal IP, and partners like Microsoft.<p>We increase our value by using our products, blueprints and library of intellectual property, sharing the benefit with our clients and partners.<p>We value life-long learning and an eye for quality. We will help you to find the best learning techniques, tools, and team-working, so that you can achieve your potential, and deliver the best value to our clients; while balancing your personal goals and home life.<p>Our employees have a mutual respect, regardless of where they are in their career. Ideas are developed by the whole team, from interns to seniors.<p>Equally, our clients pass the &quot;nice to work for&quot; test (and usually do so with flying colours). As part of that, we try to understand the ethical implications of the work we undertake. We seek to do the best we can for each other, for our profession, clients, and for the world at large.\nWith no external investors, endjin has been built as a sustainable, lifelong business: we are a company to retire out of, not exit at the expense of the employees.<p>You can work remotely from anywhere in the UK, and we hold meet-ups in London on a regular basis. You design your ideal working environment, and we will make it happen together.<p>Apart from a real passion for learning, you probably dream in data - how it can be represented, handled, secured and manipulated. A bit of maths improves your day. You know a couple of programming languages pretty well (we do a lot of C# and Typescript, but you may know R, or Python too). You love working with other people, but value the opportunity to spend time in your own head, thinking things through.<p>You can learn more about our projects at <a href=\"https:&#x2F;&#x2F;endjin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;endjin.com</a>, see a video about our career development pathways <a href=\"https:&#x2F;&#x2F;vimeo.com&#x2F;200191869\" rel=\"nofollow\">https:&#x2F;&#x2F;vimeo.com&#x2F;200191869</a> or read our blog <a href=\"https:&#x2F;&#x2F;blogs.endjin.com\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.endjin.com</a><p>Contact us on hello-at-endjin-dot-com if you think this looks like a good opportunity for you.","time":1517515832,"type":"comment"}