{"by":"erijgersberg","id":16283614,"kids":[16290983],"parent":16282819,"text":"Netherlands Forensic Institute | Forensic exploit developer | The Hague, the Netherlands | ONSITE | VISA | Full-time | €45k - €88k<p>Who are you?\nYou are a qualified ethical hacker or reverse engineer with practical experience with mobile devices, looking to apply your skills to benefit the public good.<p>Who are we?\nWe are a group of embedded systems specialists within the Digital and Biometric Traces Division of the Netherlands Forensic Institute.\nWe develop and perform methods for extracting digital data from lawfully seized electronic devices like mobile phones, navigation systems and other smart devices.<p>What will you do?\nWe need you to expand our device exploitation capabilities.\nThe increased use of strong cryptography in consumer devices demands for new approaches to keep our services up to standard.\nYou will be working on developing exploits for mobile devices that were seized in criminal investigations.\nYour job is to develop methods to find valid passwords or to find other ways to decrypt extracted data.\nThe information from seized devices plays an important role in criminal court as evidence to prove or disprove guilt.<p>What do we offer?\nThe Dutch government offers some excellent benefits. Examples:<p><pre><code>  * 8% annual holiday pay and 8.3% annual end-of-year-payment (&quot;13th month&quot;)\n  * (partially) paid parental leave\n  * 23 days paid vacation per year @ 36 h&#x2F;week; 46 days&#x2F;year @ 40 h&#x2F;week\n</code></pre>\nFor this position we are recruiting globally; speaking Dutch is a plus but not required. Although the job is onsite, we do offer assistance with relocating to the Netherlands. A security screening is part of the application procedure.<p>More information about the NFI: <a href=\"https:&#x2F;&#x2F;www.forensicinstitute.nl&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.forensicinstitute.nl&#x2F;</a><p>Interested? You can email me at the address in my profile.","time":1517505311,"type":"comment"}