{"by":"keechongtan","id":16287066,"parent":16282819,"text":"WorldRemit | Senior Data Engineer, Machine Learning Engineer | London, UK | VISA<p>WorldRemit is the global FinTech success story that has been described as &quot;the WhatsApp of Money&quot; (Business Insider) and &quot;Changing the world of remittances&quot; (BBC). Backed by leading Silicon Valley investors with more than $140m in funding, our app and website help people send money to friends and relatives in more than 140 countries. We&#x27;re a high-volume business – our customers send hundreds of thousands of transfers every month – and we&#x27;re growing fast.\nAs a (full stack) Senior Data Engineer, you will be responsible for working on the data structure and pipelines, including designing and architecting many of its components. You will be working alongside our analysts, data scientists, machine learning engineers amongst other stakeholders to identify and implement the best possible solutions for our analytical data needs. We are looking for engineers with experience in Python and SQL, and extensive work around large complex datasets. Apply at: <a href=\"https:&#x2F;&#x2F;www.worldremit.com&#x2F;en&#x2F;careers?gh_jid=937808\" rel=\"nofollow\">https:&#x2F;&#x2F;www.worldremit.com&#x2F;en&#x2F;careers?gh_jid=937808</a><p>As a Machine Learning Engineer, you will be working alongside our data scientists and engineers to help create a culture and infrastructure of machine learning. Initially focused on cyber crime activities - including creating, training and maintaining models - the boundaries for this role are endless. WorldRemit is a fast-growing business that wants to treat its customers intelligently and we believe data and machine learning are the key to help us achieve this. From offering dynamic user journeys to helping automate manual decisions, at virtually every level of our organisation there is a machine-learning hole that we&#x27;re excited to fill with a growing data team. Specific projects already identified are: fraud prevention; behavioural analytics for the checkout experience; chatbots; marketing optimization; and anti-money laundering models. Apply at: <a href=\"https:&#x2F;&#x2F;www.worldremit.com&#x2F;en&#x2F;careers?gh_jid=927461\" rel=\"nofollow\">https:&#x2F;&#x2F;www.worldremit.com&#x2F;en&#x2F;careers?gh_jid=927461</a><p>TECHNOLOGIES: SQL, python, AWS, Redshift, Kafka, Hadoop&#x2F;Hive&#x2F;Presto&#x2F;Spark, Docker, pandas, sklearn<p>EMAIL: sovenden@worldremit.com","time":1517528986,"type":"comment"}