{"by":"thejash","id":16285565,"parent":16282819,"text":"Sourceress | Senior Python Engineer Lead | San Francisco | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs</a><p>Do you want to grow into a great engineering leader? We strongly value personal growth, and pay for coaching for all employees.<p>Other Qualifications:<p>- Do you love mentoring other developers and helping them grow?<p>- Are you an incredibly prolific programmer who knows both the value of shipping quickly and the value of software craftsmanship, and has the judgment to know when to apply each?<p>- Are you empathetic, highly systematic, intensely driven, and intellectually curious? See our values here [1]<p>Our stack: Python (Django, nltk), AWS (S3, PostgreSQL), Javascript (React)<p>About Us:<p>We&#x27;re a (human-assisted) AI sourcing platform that delivers great results (customer quote: &quot;I&#x27;d have a panic attack if you guys stopped existing&quot;). Our mission is to fundamentally change the way that human effort is allocated.<p>We just raised $3.5M from OpenAI researchers and Lightspeed [2] at one of the highest ever valuations coming out of YC. One founder previously sold a company and is a published machine learning researcher; the other was Chief of Staff at Dropbox, and our team of 10 hails from other great organizations as well (Google, MIT, McKinsey, etc)<p>We have a real business, customers, revenue, crazy growth, funding--and a ton of work to do. We have machine learning problems that are core to our product, data infrastructure and scaling problems to tackle, and interesting product work to be done as well.<p>To Apply:<p>Just email me at josh@sourceress.com<p>[1] <a href=\"https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sourceress.com&#x2F;jobs</a><p>[2] <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;11&#x2F;07&#x2F;sourceress-raises-3-5m-to-find-candidates-that-managers-want-without-realizing-it&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;11&#x2F;07&#x2F;sourceress-raises-3-5m-to-...</a>","time":1517516983,"type":"comment"}