{"by":"asti","id":16282840,"parent":16282819,"text":"Advanced Simulation Technology, inc. (ASTi) | Herndon&#x2F;Reston, VA | Multiple Positions | ONSITE<p>We’re a small company building innovative products in the simulation and training industry. We help train pilots and soldiers by providing realistic sound and communications environments. Our flagship product is Telestra (<a href=\"http:&#x2F;&#x2F;www.asti-usa.com&#x2F;telestra&#x2F;index.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.asti-usa.com&#x2F;telestra&#x2F;index.html</a>), a real-time modeling suite for full flight simulators used around the world to reproduce cockpit sounds and radio communications. One of our newest products is SERA (<a href=\"http:&#x2F;&#x2F;seraatc.com\" rel=\"nofollow\">http:&#x2F;&#x2F;seraatc.com</a>), the Simulated Environment for Realistic ATC. SERA helps airline pilots learn to communicate properly by simulating the entire air traffic control environment. This includes artificial intelligence for other aircraft pilots and controllers, trainee&#x2F;student speech recognition, and text-to-speech radio chatter.<p>ASTi has been around almost 30 years. We’ve been very successful in our niche (audio and communications), but we’re trying to grow and need your help! On-site, full-time engineering positions available for those interested in software, web, cloud and speech technology.<p>Stack: C&#x2F;C++&#x2F;C#, Python, Go(golang), AngularJS, Node.JS, AWS, Docker, RethinkDB, SIP, RaspberryPi<p>Check out this page for more information on ASTi, our unique work environment, and the full job descriptions: <a href=\"https:&#x2F;&#x2F;www.asti-usa.com&#x2F;jobs&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.asti-usa.com&#x2F;jobs&#x2F;index.html</a>. A few other reasons to consider ASTi: excellent compensation, profit-sharing, start at 4 weeks vacation (growing to 6 weeks over time), company-paid retirement plan, and we were included in Washingtonian Magazine’s &quot;50 Great Places to Work&quot; in 2015.<p>Get in touch via jobs@asti-usa.com. Thanks!","time":1517500976,"type":"comment"}