{"by":"jcberk","id":16285760,"parent":16282819,"text":"Jobcase | Boston&#x2F;Cambridge MA | onsite | full time | <a href=\"https:&#x2F;&#x2F;www.jobcase.com&#x2F;about_us\" rel=\"nofollow\">https:&#x2F;&#x2F;www.jobcase.com&#x2F;about_us</a><p>Jobcase runs a set of job boards and a professional social network focused on the almost 3&#x2F;4 of the country that doesn&#x27;t have a four-year college degree. We&#x27;re growing quickly, with 80MM registered members, and are mostly self-funded to 100+ employees, so we&#x27;re highly focused on data-driven decisions and making smart capacity investments for the future. We&#x27;re one of Boston Business Journal&#x27;s Best Places to Work (again!).<p>Recruiting for multiple roles, especially:<p><i>Platform engineer (including technical lead)</i> - Build all our core systems (including interesting architecture&#x2F;scaling problems), working on a well-documented code base in a team with a strong review culture and very clear communications. We use a Java&#x2F;Hibernate stack; happy to get applications from people with experience in comparable technologies.<p><i>Front-end engineer</i> - Build all our member-facing applications including Jobcase.com, working mostly in Ruby on Rails. Drive the member experience for acquisition and social network features, working closely with product management and design&#x2F;UX.<p><i>Quantitative data analyst</i> - Own a slice of our business metrics and drive member acquisition and engagement. Send email&#x2F;SMS communications, work with engineering to build new flows and features, and come up with experiments to optimize the member experience.<p><i>Data science &#x2F; machine learning &#x2F; information retrieval (experienced) </i> - Help our members find relevant advice and jobs, and our colleagues make good decisions. Have a direct impact on revenue and on engagement, working with a team that&#x27;s making major optimizations for our members and with colleagues who are uniformly data-savvy.<p>Interview process is a phone screen, then onsite interviews, with onsite design exercise and&#x2F;or take-home coding&#x2F;analysis exercise. Happy to answer questions, jberk at jobcase.com - my team works pretty closely with all of those teams.<p><a href=\"http:&#x2F;&#x2F;www.jobcase.com&#x2F;locations&#x2F;4Od3KKqq7pBUVSLdOt5YCwfo&#x2F;nzrsagNgjg18QzdOKcLpbpvq&#x2F;jobcase-cambridge-201-broadway&#x2F;apply\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobcase.com&#x2F;locations&#x2F;4Od3KKqq7pBUVSLdOt5YCwfo&#x2F;nz...</a><p>As one of our members said this week, &quot;How Jobcase works is that when you get hired, you help pay it forward and help others get hired, as much as you can!&quot;","time":1517518315,"type":"comment"}