{"by":"petetnt","id":16286525,"parent":16282819,"text":"Motley | Multiple developers (JavaScript) | Helsinki, Finland | <a href=\"https:&#x2F;&#x2F;motley.fi\" rel=\"nofollow\">https:&#x2F;&#x2F;motley.fi</a> | ONSITE<p>Motley is a strategy, design, storytelling and technology company from Helsinki, Finland. We are working with some of the biggest and most exciting clients in Finland and we are looking for multiple developers to join our fantastic team.<p>As a frontend developer you write lots of HTML, CSS (and variants) and JavaScript (specifically React), but you aren’t afraid to dive into WordPress or you can find your way around e-commerce store frontends of SaaS products such as Shopify. Use your knowledge of frontend development to deliver new exciting products and services to our clients and learn new things by contributing to our own inner processes, libraries and best practices! You also get to help your co-developers by triaging bugs and troubleshooting issues.<p>As a full-stack &#x2F; backend developer you know enough of modern software development to contribute everywhere. And of course you get to write tons of awesome code: we mainly work with NodeJS on the backend, but we also have lots of experience on building backends with Python, PHP, Ruby-On-Rails, Scala and other server side languages. As our ideal developer you should be familiar with cloud services, continuous integration and delivery, relational and&#x2F;or NoSQL databases and you should love working with Unix-y servers.<p>As a developer you get to make an impact in every part of our projects while working alongside of super talented people! If you don’t know all our core stack techs, it’s no biggie as long as you can learn them quickly and enthusiastically. Most importantly, you are interested in modern software development methodologies.<p>To help you grow as a developer, we have a mentoring program, we offer any study related things you might need (courses, books...) and you get to travel to conferences of your choice. You get to choose your own tools and the best possible hardware and software to help you produce the best possible work. Love contributing to open source projects? So do we! And of course you are compensated accordingly with additional perks like medical care, sports vouchers and lunch cards.<p>Sounds good to you? Check out <a href=\"https:&#x2F;&#x2F;motley.fi&#x2F;jobs&#x2F;developer\" rel=\"nofollow\">https:&#x2F;&#x2F;motley.fi&#x2F;jobs&#x2F;developer</a> and ship your CV &#x2F; portfolio &#x2F; GitHub&#x2F;GitLab&#x2F;BitBucket profile or similar to jobs@motley.fi and mention HN on the title.","time":1517523993,"type":"comment"}