{"by":"julianshapiro","id":16285505,"kids":[16289065],"parent":16282819,"text":"<a href=\"http:&#x2F;&#x2F;BellCurve.com\" rel=\"nofollow\">http:&#x2F;&#x2F;BellCurve.com</a> | Growth Strategy for YC co&#x27;s | We train you | $85,000&#x2F;yr USD or $105,000&#x2F;yr CAD | Remote (US or Canada)<p>---<p>Teaser: We&#x27;re eventually moving to a 4-day workweek. And you get to work from home on day one.<p>---<p>The role: Helping Y Combinator companies refine their user acquisition and conversion optimization strategy. So they get more users. Who stick around longer and pay more. We have a moat of data and tactics that make us the best. Which is why big startups work with us for so long.<p><pre><code>  - Who we are: BellCurve.com is the top startup growth agency in SF. We grow mostly YC startups.\n  - Clients include: Envoy, Clearbit, and Sentry. Plus a dozen more.\n  - Our team: 6 engineers turned marketers. \n  - Approach: We emphasize data — not brand voice. We care about conversion — not brand marketing. \n  - Prior knowledge: We will teach you everything about advanced growth tactics.\n</code></pre>\nWe need someone who already:<p><pre><code>  - → Is personable and can bond with others over phone calls. This has to be a strength of yours.\n  - → Is a strong writer.\n  - → Has worked for at least 1 funded startup. Can&#x27;t be brand new to startup life. (No interns.)\n  - (If you&#x27;re introverted and don&#x27;t say much on a call, you won&#x27;t be a good fit for this role.)\n  - Is concerned about process and being efficient with their time. Automate, delegate, batch. \n  - Lets data decide instead of exclusively relying on hunches.\n  - Is passionate about a long-term future in growth marketing (aka growing startups).\n  - Is able to quickly connect dots and come up with creative strategies on the spot.\n</code></pre>\nWe operate unlike a typical agency. (I wish there were a better term than &quot;agency.&quot;) We work with clients for a long time; we see them from start to finish. You&#x27;ll get a front-row seat to some of the most interesting companies. We have a profound impact on our clients&#x27; businesses and product roadmaps. They listen to us. Because we have built a moat of data and tactics that others have not figured out. (I personally learned a lot from previously running growth for Heap and Webflow.)<p>I have a hunch that A) operations&#x2F;product leads, B) sociable engineers, and C) salespeople looking for something more than sales calls will be a great fit for this role.<p>How to apply:<p><pre><code>  - → Email me (Julian Shapiro): jobs [at] bellcurve.com\n  - → Kindly link me to your LinkedIn or attach a resume :)\n  - Please note you must have experience working at a funded startup.\n  - You must live in the US or Canada.\n  - If you&#x27;re a fit, I will respond same-day and we&#x27;ll hop on a call together.\n</code></pre>\nI will look at every application very closely.<p>---<p>More about me (Julian):<p><pre><code>  - My growth interview on IndieHackers: https:&#x2F;&#x2F;www.indiehackers.com&#x2F;podcast&#x2F;017-julian-shapiro-of-bell-curve\n  - I wrote the most popular guide on growth: http:&#x2F;&#x2F;julian.com&#x2F;learn&#x2F;growth\n  - I built Velocity.js — one of the biggest open source projects\n  - Catch me here: twitter.com&#x2F;shapiro\n  - My LinkedIn: https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;juliandeanshapiro\n\n                               (\n                      .-&#x27;&#x27;&#x27;-..&#x27; \\                      _____           _____\n            _______ .&#x27;       -   \\                 ,ad8PPPP88b,     ,d88PPPP8ba,\n          &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; );__   ,,,_)   \\               d8P&quot;      &quot;Y8b, ,d8P&quot;      &quot;Y8b\n             &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; ) ;C  &#x2F;     \\             dP&#x27;           &quot;8a8&quot;           `Yd\n               &lt;&lt;&lt;&lt;&lt;&lt; (.-&#x27;-.  )====_)_=======&gt;   8(              &quot;              )8\n                 &lt;&lt;&lt;&lt;&lt; \\    &#x27;&#x27;&#x27;&#x27;&#x27;&#x27;&#x27;   )          I8                             8I\n                 ;  &lt;&lt;&lt;     .......__&#x2F;            Yb,                         ,dP\n            .-&#x27;&#x27;&#x27;         (         )              &quot;8a,                     ,a8&quot;\n         .-&#x27;              ;.       &#x2F;                 &quot;8a,                 ,a8&quot;\n        &#x2F;  .-&#x27;     .     =  .     &#x2F;                    &quot;Yba             adP&quot;\n    _-&#x27;&#x27;\\_&#x2F;         &#x27;. .&#x27;    .   &#x2F;                       `Y8a         a8P&#x27;\n .-&#x27;  )  ;\\          &#x27;&#x27;&#x27;.     . &#x2F;                          `88,     ,88&#x27;</code></pre>","time":1517516518,"type":"comment"}