{"by":"jacobwg","id":16283974,"parent":16282819,"text":"Thorn | San Francisco or Remote (US based) | Full-time | $100k - $150k | Software Engineer<p>Thorn is a non-profit focused on building technology to defend children from sexual abuse. Working at Thorn gives you the opportunity to apply your skills, expertise and passions to directly impact the lives of vulnerable and abused children. Our staff tackles dynamic, quickly evolving problems with our network of partners from tech companies, NGO’s and law enforcement agencies. If you are able to bring clarity to complexity and lightness to heavy problems, you might be a great fit for our team.<p>You will work on our dark web investigation tool, as well as a variety of other projects. Examples of projects include our Child Finder Service, in which we apply computer vision to find missing children, and our Industry Toolkit, which will be used to clean online communities of child abuse. You will also participate in broad exploration to fight child abuse and trafficking. The work spans engineering and data science topics from security to artificial intelligence — including adaptive crawling, statistical analysis, search, machine learning (NLP, computer vision, sentiment analysis), data pipeline development, and UX design.<p>Requirements:<p>- Professional software development experience<p>- Adept at quickly learning new technologies<p>- Experience implementing, testing, and deploying code to production<p>- Skilled at rapidly prototyping applications<p>- Ability to collaboratively solve problems with internal and external stakeholders<p>- Clear, efficient, and eloquent communicator — we are a distributed team, so written communication is crucial, from Slack to pull requests <p>Apply today! <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;mdial42\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;mdial42</a><p>For more general information about Thorn, see <a href=\"https:&#x2F;&#x2F;www.wearethorn.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wearethorn.org&#x2F;</a>","time":1517507677,"type":"comment"}