{"by":"kingarosa","id":16289306,"parent":16282819,"text":"Clipo Inc. | iOS Engineer | Full-time | ONSITE | Krakow, Poland<p>We are a US startup with an office in central Krakow, Poland. Our product - Polyvibe (previously Polygram) is a new social app for the iOS platform. It is quickly gaining traction and has enjoyed extensive media coverage. Outlets such as TechCrunch, Yahoo Finance, Engadget or MIT Technology Review have covered our app. The app leverages a deep neural network that analyses the facial expressions of users browsing content. We developed this technology in-house at a significant cost having undertaken a large scale training data gathering operation. Anyone that posts content on Polyvibe knows how other users react to it in addition to sophisticated anonymised statistics that include viewers’ locations. This feedback loop creates an engaging experience for which users return to the app. We are also making heavy use of ARKit.<p><a href=\"https:&#x2F;&#x2F;uk.finance.yahoo.com&#x2F;news&#x2F;polygram-social-network-powered-facial-000300033.html\" rel=\"nofollow\">https:&#x2F;&#x2F;uk.finance.yahoo.com&#x2F;news&#x2F;polygram-social-network-po...</a> \n<a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;08&#x2F;25&#x2F;polygram\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;08&#x2F;25&#x2F;polygram</a>\n<a href=\"https:&#x2F;&#x2F;www.engadget.com&#x2F;2017&#x2F;08&#x2F;25&#x2F;polygram-social-network-facial-recognition&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.engadget.com&#x2F;2017&#x2F;08&#x2F;25&#x2F;polygram-social-network-...</a>\n<a href=\"https:&#x2F;&#x2F;www.technologyreview.com&#x2F;s&#x2F;608748&#x2F;the-next-generation-of-emoji-will-be-based-on-your-facial-expressions&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.technologyreview.com&#x2F;s&#x2F;608748&#x2F;the-next-generatio...</a><p>We’re looking for an experienced iOS developer capable of independent work on a complex project. A person that enjoys working in a team and is happy to provide guidance to fellow team members. You value quality above all else and your approach towards the product is pro-active.<p>Requirements:\n- you’ve a passion for what you do and have contributed to the iOS community in one way or another\n- at least some of the native apps you worked on are still in App Store\n- you’ve lead a team or shared a significant part of responsibility for a product’s development\n- you’ve solid background in design patterns\n- you’re no stranger to UIKit’s intricacies, multithreading and mobile databases\n- you write testable code and unit tests\n- you’re a nice person and fun to work with<p>We offer:s\n- ownership of the projects you work on\n- ability to implement your own ideas and improvements\n- work in an international environment \n- B2B 14-18k PLN, more for an outstanding candidate\n- 26 days of paid holidays\n- flexible working hours<p>Contact: kinga.rosa@myclipo.com","time":1517561735,"type":"comment"}