{"by":"jocatalin","id":16283008,"parent":16282819,"text":"Container Solutions | Amsterdam, Berlin, London, Zurich | ONSITE | FULLTIME | container-solutions.com<p>We help clients build confidence with cloud technologies and transition to microservices. We work with cloud native vendors on next-generation open-source tools. We&#x27;re growing our Amsterdam (HQ) and Zurich offices and creating new engineering teams in Berlin and London. We are hiring for potential, not for skills.<p>We are looking currently for:<p>Cloud Native engineers (all offices)<p>Background in development or operations with some experience in microservices, CI&#x2F;CD, technologies like Docker, Kubernetes, Mesos, cloud (AWS, Google, Azure), cloud automation and provisioning (Terraform, Ansible, Cloud Formation etc). We value consultancy skills and community work (open-source projects, meetups and conference talks, blogging).<p>Expect mainly short-term projects (2-4 months) mostly delivered from our offices. We automate the infrastructure of our customers and deploy on top of it orchestration layers for running apps and data. We work in small self-managed teams that take full responsibility for the projects. We&#x27;re not tech&#x2F;cloud service resellers, we mix the best open-source tools and services that make sense for the project.<p>All our engineers are encouraged to share their knowledge at conferences and within the company. We consider ourselves a continuous learning company. Switching between projects&#x2F;roles&#x2F;offices is possible and quite common.<p>Front-End Developer (Amsterdam)<p>Create beautiful and usable interfaces and are especially interested in building GUIs for distributed systems. Should have an affinity with design thinking and from the beginning, are expected to lead ideation sessions and have interest in backend development.<p>HR Coordinator (Amsterdam)\nSales Executives (Amsterdam)<p>We&#x27;re active in the open-source area via meetups (Docker, Rust, Nix, Software Circus), conferences (our own conference in Amsterdam: <a href=\"http:&#x2F;&#x2F;www.softwarecircus.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.softwarecircus.io&#x2F;</a>  ), workshops, code (Minimesos: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;ContainerSolutions&#x2F;minimesos\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ContainerSolutions&#x2F;minimesos</a> ), books (Using Docker: <a href=\"http:&#x2F;&#x2F;shop.oreilly.com&#x2F;product&#x2F;0636920035671.do\" rel=\"nofollow\">http:&#x2F;&#x2F;shop.oreilly.com&#x2F;product&#x2F;0636920035671.do</a> )<p>Apply here: <a href=\"http:&#x2F;&#x2F;container-solutions.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;container-solutions.com&#x2F;careers&#x2F;</a> \nRead about our culture here: <a href=\"http:&#x2F;&#x2F;container-solutions.com&#x2F;space-beyond-culture&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;container-solutions.com&#x2F;space-beyond-culture&#x2F;</a>","time":1517501885,"type":"comment"}