{"by":"BukhariH","id":16287284,"kids":[16287699],"parent":16282819,"text":"TransferWise (<a href=\"https:&#x2F;&#x2F;transferwise.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;transferwise.com&#x2F;</a>) | Senior Java Developer&#x2F;Full Stack Engineer | London, United Kingdom | Tallinn, Estonia (Visa Sponsorship Available) | ONSITE | Full-time<p>Hi guys! Bear with me since I&#x27;m not a recruiter: the Treasury team is looking to hire one or two senior engineers for either of our London or Tallinn offices.<p>Just a bit about what we do: as a core product team we are responsible for managing all the money at TransferWise. By “all the money” - I mean literally everything from customer funds (&gt; 1 billion GBP per month) to the money we’ve raised from investors (396.4 million USD to date).<p>We track every single penny from the time it enters TransferWise to the time it leaves, we balance different currency routes to ensure there’s always liquidity available where needed and we safeguard customer funds to ensure our users are always protected.<p>Our team right now is built up of ex-Deutsche Bank, ex-JP Morgan, ex-Mircosoft employees so ideally we’d like someone who has some experience working in the finance world or at least you should be interested interested in trading (not hard with all the cryptocurrency buzz right now).<p>We run a Netflix style microservices architecture based on Java, Kafka, Spring Boot, React and some other exciting stuff that we’ve built internally.<p>Anyway, if you’re interested then you should:<p>1. Apply for one of the roles listed here: <a href=\"https:&#x2F;&#x2F;transferwise.com&#x2F;jobs&#x2F;roles&#x2F;engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;transferwise.com&#x2F;jobs&#x2F;roles&#x2F;engineering</a><p>2. And definitely mention in your cover letter that you’re interested in working with the Treasury team<p>P.S. If you’re looking for an internship this summer then check out our internship bootcamp on: <a href=\"https:&#x2F;&#x2F;transferwise.com&#x2F;jobs&#x2F;roles&#x2F;engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;transferwise.com&#x2F;jobs&#x2F;roles&#x2F;engineering</a> which is a 10 week program open to everyone in the EU!","time":1517531363,"type":"comment"}