{"by":"jamesor","id":16288249,"parent":16282819,"text":"Discovery Digital Media | Client Engineering | Fulltime | New York, NY | ONSITE | <a href=\"https:&#x2F;&#x2F;www.discovery.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.discovery.com</a><p>ABOUT US:<p>We are a small, but mighty team, working at the cross roads of technology and entertainment to bring content from iconic television brands to our audiences over the Internet in the most entertaining ways we can imagine and build. As television changes, our mission remains true to the principles that founded Discovery – every day we seek to ignite people’s curiosity to engage, entertain and enlighten the world around them through amazing viewing experiences.<p>We deploy applications for each of our network brands: Discovery, TLC, Velocity, Science Chanel, Investigation Discovery, Animal Planet, American Heroes Channel, Destination America, Discovery Life, Discovery Familia and Discovery en Español.<p>This is a fantastic opportunity to help solve complex but interesting scalability, performance and availability problems for products consumed by millions of users each day! You will have the opportunity to work with a suite of great technologies and in a highly collaborative environment where the engineers get together on a quarterly basis in NY to problem solve major business challenges.<p>CLIENT PLATFORMS:<p><pre><code>  - Responsive Web\n  - Android Phone &#x2F; Tablet\n  - iOS Phone &#x2F; Tablet\n  - Xbox One\n  - Fire TV\n  - Apple TV\n  - Roku\n  - New platforms road mapped for 2018\n</code></pre>\nOPEN POSITIONS:<p>Software Engineer, Web Clients\n<a href=\"https:&#x2F;&#x2F;careers-discovery.icims.com&#x2F;jobs&#x2F;18956&#x2F;software-engineer---web-clients&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-discovery.icims.com&#x2F;jobs&#x2F;18956&#x2F;software-engi...</a>\nDiscovery Digital Media is looking for a Web Client Engineer to build React JS applications with best-of-breed UX across Web, Xbox and Smart TVs.<p>Client Engineering Manager\n<a href=\"https:&#x2F;&#x2F;careers-discovery.icims.com&#x2F;jobs&#x2F;19074&#x2F;manager-client-engineering&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-discovery.icims.com&#x2F;jobs&#x2F;19074&#x2F;manager-clien...</a>\nThis role will be responsible for growing, mentoring and leading a team of client engineers to build TV Everywhere applications with best-of-breed UX across current and future platforms.","time":1517543197,"type":"comment"}