{"by":"RichardPrice","id":16288157,"parent":16282819,"text":"Academia.edu | Full Stack Engineer | San Francisco, CA | Onsite<p>Academia.edu’s mission is to get every paper ever written on the internet, available for free.<p>Founded in 2008, Academia.edu is the leading online platform for academics worldwide.  Over 59 million academics are Academia.edu members, and have added 20 million papers. Academia.edu attracts over 30 million unique visitors a month, and has raised more than $33 million from leading VC firms including Khosla Ventures, True Ventures, Spark Capital and Tencent. Our work has garnered favorable attention from trade and mainstream media including Fortune, Wired, EdTech, Venture Beat, San Francisco Business Times, The Economist, The Washington Post, TechCrunch, Scientific American and Forbes.<p>If you join Academia.edu, you&#x27;ll be designing and building systems and services to make our user base more productive in their academic work life. You&#x27;ll be working on such systems as:<p>- communications and messaging tools to facilitate collaboration and feedback<p>- a scalable peer review system to facilitate the verification of academic research<p>- a scalable news feed, highlighting the latest research in every field<p>- tools and platforms that enable academics to publish directly on the Academia social network<p>- advanced search products and personalized analytics<p>We need mission-driven engineers to come and help us. Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot;<p>We’ve turned cash flow positive, we’re generating profit, and we expect our revenue to double in the next year.  With a recent addition of capital from our VCs, we are widening and deepening our free and premium products this year.  We’re moving to a larger space, while staying in downtown SF, near to all public transportation sites.<p>We are looking to hire full stack and mobile software engineers, as well as Product Managers. Technologies we use include Ruby, Rails, Postgres, DynamoDB, React. For more information, visit <a href=\"http:&#x2F;&#x2F;academia.edu&#x2F;hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>. If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1517542071,"type":"comment"}