{"by":"CommonSenseSF","id":16293374,"parent":16282819,"text":"San Francisco, Ca. Front-End Engineer- Full Time- Onsite<p>Apply: <a href=\"https:&#x2F;&#x2F;commonsense.recruiterbox.com&#x2F;jobs&#x2F;fk0fcxj\" rel=\"nofollow\">https:&#x2F;&#x2F;commonsense.recruiterbox.com&#x2F;jobs&#x2F;fk0fcxj</a><p>We are currently seeking an experienced front-end engineer to join a team of developers, QA engineers, product managers, and UX designers who work closely with UI designers led by a creative director. This role will help build and maintain all things client-facing and will help translate our organization and customer needs into functionally seamless, and appealing, interactive applications. Creating a great user experience is the focal point of this role, and the ideal candidate is curious about new digital technologies and stays abreast of coding best practices. This role will collaborate with a top-notch team of developers on a feature-rich, responsive site and help build personalized and social site experiences to help connect members with each other and the rest of the world.\nLOCATION: San Francisco, CA TYPE: Full-time (40 hours per week) CLASSIFICATION: Exempt<p>WHAT YOU&#x27;LL DO: You&#x27;ll be issued a Mac laptop for local development, use GitHub for version control, and work in a LAMP stack on our dev&#x2F;staging&#x2F;prod servers hosted at Acquia. We code to Drupal standards and strive toward industry best practices. Our engineers take pride and ownership in our projects, working closely with product and the other stakeholders to build something that is rock-solid and easily maintained. You&#x27;ll have the opportunity to help shape the product you&#x27;re working on and have your voice heard.<p>Sites You will be working on a multitude of high-traffic websites that garner millions of users&#x2F;month, including: Common Sense Media (www.commonsensemedia.org): The platform that hosts reviews, advice, and more for parents. Common Sense Education (www.commonsense.org&#x2F;education): Designed to help pre-K–12 educators discover, use, and share the best apps, games, websites, and digital curricula for their students. Also contains curriculum, professional development, and teaching resources for educators and school administrators.<p>WHAT WE NEED TO SEE ON YOUR RÉSUMÉ: Bachelor&#x27;s degree and a minimum of 3 years of relevant experience Demonstrated proficiency writing standards-compliant HTML5 and CSS3 Proficiency with JavaScript in a cross-browser, cross-device environment (both jQuery and Vanilla JS) Understanding of current front-end and mobile development best practices, including responsive design, touch interfaces, performance optimization, and progressive enhancement Experience working with source-control with Git Experience working in a LAMP stack with PHP skills","time":1517599034,"type":"comment"}