{"by":"vdvleon","id":16291031,"parent":16282819,"text":"Front-end&#x2F;Full-stack developer | Deskbookers | Amsterdam, The Netherlands | Full-Time, Onsite | <a href=\"https:&#x2F;&#x2F;www.deskbookers.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.deskbookers.com</a><p>At Deskbookers, we have an ambitious goal to bust open the opaque and inefficient world of commercial real estate... a complex problem not for the weak hearted.<p>We believe we add value to people’s lives. Where you work should inspire you to reach your potential. How we help is by providing the best tools for professionals to find and rent their ideal workspace, whether it’s an office space for a few months or years, a meeting space for a day or a week or a private desk for hours.<p>We don’t compromise on talent. We aim to be a high performing sports team… we know we are stronger together than as individuals, we are dedicated to meeting our goals and we enjoy each other&#x27;s company. We don’t take our culture lightly and are continuously aiming to build a company where people want to invest their professional talents.<p>We thrive on learning and growing beyond our comfort zone. Whether it’s from smart and talented peers with international backgrounds, from experienced leaders who have worked in a diverse set of industries or from amazing angel and venture investors, there is no better place to enhance your well rounded skillset.<p>As a Front-End Developer at Deskbookers, you will be responsible for making sure our applications work seamlessly. This involves implementing new features using modern techniques, maintaining the existing code base and working together with your peers in the product team. We are looking for a passionate coder with a strong feeling for UI design, a team player that takes initiative to come up with great ideas and realizes they need a team to build something awesome.<p>Our tech-stack: React, AWS, PHP, Node 8+, Postgres, Redis, Elasticsearch, Vagrant, Docker, GitHub<p>For more information about the job opening see <a href=\"https:&#x2F;&#x2F;deskbookers.homerun.co&#x2F;front-end-developer&#x2F;en\" rel=\"nofollow\">https:&#x2F;&#x2F;deskbookers.homerun.co&#x2F;front-end-developer&#x2F;en</a> or email me directly: l.vanderveen@deskbookers.com","time":1517583944,"type":"comment"}