{"by":"buckie","id":16299035,"parent":16282819,"text":"Kadena | Software Engineer | REMOTE, ONSITE (Brooklyn, NY) | Full-Time $80k-$150k + Coin and&#x2F;or Equity<p>Kadena is seeking Haskell engineers to join our team either in Brooklyn or remote. Kadena (<a href=\"http:&#x2F;&#x2F;kadena.io\" rel=\"nofollow\">http:&#x2F;&#x2F;kadena.io</a>) is a tech-founded, post-revenue smart-contract blockchain startup founded in 2016 by Stuart Popejoy and Will Martino, two lead engineers from JP Morgan’s blockchain group. Kadena is poised to become the leading blockchain platform for businesses and enterprises by solving scalability and security concerns that impede widespread blockchain adoption. Our existing technology stack consists of our open-source smart contract language Pact and our private-chain protocol ScalableBFT, products that are already in use with Fortune-100 clients and coded entirely in Haskell. We firmly believe Haskell lends a decisive advantage through drastically enhanced productivity, excellent concurrency and parallelization support, unbeatable programming-language tooling, and sheer pleasure of coding. We’ve built a lot with just two devs, we can’t wait to see what you will add to our stack!<p>The ideal candidate will be able to work closely with a group but also drive projects independently. Developers are encouraged to interact at every level of product development. Initial focus is on building out our new public-chain protocol Chainweb and furthering our work in formal verification of Pact smart contracts; later projects will include operational pieces for the public platform like load balancers, monitoring, and messaging systems. Finally, partner integrations can lead to entirely new products integrating Pact smart contracts with bespoke systems. Public-chain projects are entirely open source (BSD3), and contributions to other projects are encouraged as well.<p>Exposure and expertise in any of the following areas is desirable:<p>- Network engineering<p>- Cryptography engineering<p>- Distributed Systems<p>- Programming language design (e.g. compilers, interpreters, development tools)<p>- Database Systems (RDBMS but also key-value systems)<p>- Software assurance&#x2F;verification (Coq, SMTLIB2, QuickCheck, Jepsen, Coq, HOL)<p>- Industrial&#x2F;production Haskell development<p>To apply please send a resume to hiring+hn@kadena.io.","time":1517685464,"type":"comment"}