{"by":"TedDev","id":16328679,"parent":16282819,"text":"Promenet, Inc | NYC Onsite work | $50-60k (Junior Engineer)<p>Is anyone looking for an IT &#x2F; Security job?<p>I came from more of a background in software development and found my way into networking. I found huge differences between them. I think they involves two very different mindsets.<p>Networking is great for people who are very interested in learning how to operate things. They want to get to know how to use things in the world to their advantage and find ways to make them do useful things in concert.<p>A programmer has to think more about how to get new, undiscovered or previously unimplemented behavior out of a system and do so reliably.<p>Network engineers need to do that at a large scale as a small aspect - like when a network goes completely down and no one knows why. You have to discover how things are supposed to work, why they&#x27;re not working, and how to get them to work again - that&#x27;s support. They also have to be able to design at a large scale and understand pre-built connection templates (i.e. protocols) and follow them. And they need to be responsible for hundreds of customers access to information, utilities, and the business.<p>We look for engineers with college degrees in sciences and technology. Promenet has 20 years of experience, with focuses in security, networking, systems, consulting, infrastructure managed services, and other high-level IT services. Named CRN Pioneer 250 for MSP 5 years running. Servicing 85% of New York private schools, and many businesses in legal, finance, insurance, and more.<p>The job entails servicing our clients by getting well acquainted with different networks, systems, and operation to the point of being proficiently able to provide service uptime and repair, knowledgeable and influential technology advice, and ingenuity to make our service offering better.<p>Let me know if you are via an intro and resume to itjobs@promenet.com","time":1518043678,"type":"comment"}