{"by":"sxh","id":16339504,"parent":16282819,"text":"Unruly | Aldgate East, London| FULL-TIME | ONSITE<p>We’re fortunate enough to be blessed with lots of good ideas, supportive management, a great environment and the desire to grow our team to deliver as many of those ideas as we can. We develop mostly in Java and Javascript, with reporting based on a combination of Postgres, Actian Vector and Splunk. Our philosophy is “if you build it you run it”, so we’re biased towards full stack developers, and we support them with a small infrastructure team and shared specialist roles. Our growth plans also give us scope to create new roles that will improve the overall effectiveness of the broad development team. Contact us if you’re interested in:<p>- Programming in Java or Javascript<p>- Using large volumes of data to inform business decisions (both ours and our clients’)<p>- Coaching and enabling better product development, consistently with agile values<p>- Problem solving in a complicated, dynamic technical environment<p>- Understanding the video advertising domain and working with both technical and non-technical people on product development<p>- Exploring new approaches to organisational structure and responsibility<p>- Building applications on cloud infrastructure, to helping teams get more value from their cloud infrastructure<p>Have a look at the job descriptions for our open roles, but don’t be deterred if you don’t find exactly the role you’re looking for. Feel free to contact me (steve.hayes@unrulygroup.com) or our People Team (talent@unrulygroup.com) if you’d like to discuss either a job description or other opportunities.<p>Unruly is the video marketplace you can trust to move people, not just reach people. We help the world’s biggest advertisers engage global audiences by harnessing the power of our data-powered video marketplace, UnrulyX, on brand-safe, premium sites, while helping top publishers better monetise their audiences. Our superpower is emotional testing and targeting via UnrulyEQ, which leverages over a decade of video data and almost 2.2 million viewer reactions to videos to provide deep analysis of metrics that matter, enabling us to deliver better targeting and higher campaign ROI at scale.<p><a href=\"https:&#x2F;&#x2F;unruly.co\" rel=\"nofollow\">https:&#x2F;&#x2F;unruly.co</a>","time":1518177035,"type":"comment"}