{"by":"chillydawg","id":16359241,"parent":16282819,"text":"Longshot Systems | Multiple Roles | Marylebone, London, UK | ONSITE | Full time | £65k-£85k<p>At Longshot Systems Ltd we&#x27;re a small startup building advanced platforms for sports betting analytics and trading. Having developed a lot of our core platform infrastructure we are looking to begin expanding our trading strategy development activity.<p>1) Machine Learning Engineer (<a href=\"https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;jobs&#x2F;578496\" rel=\"nofollow\">https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;jobs&#x2F;578496</a>). You&#x27;d be working closely with the CEO, CTO and ML research team to turn prototype trading models into production-ready systems, design and build the tooling &amp; frameworks to support strategy research and development as well as architecting the high-level design of the strategy software to minimise trading latency and scale effectively. Our ML stack is Numpy&#x2F;Scipy based and communicates with our core infrastructure, written in Golang, by RPC. The ideal candidate will have a strong software engineering background, with broad experience across a range of topics related to general high performance computing such as multi-threading, networking, profiling and optimisation.<p>2) Senior Software Engineer (<a href=\"https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;jobs&#x2F;610845\" rel=\"nofollow\">https:&#x2F;&#x2F;longshot-systems-ltd.workable.com&#x2F;jobs&#x2F;610845</a>). You&#x27;d be part of the platform team, creating services in Golang and improving performance and reliability of our trading platform. You&#x27;d be working with the CEO and CTO and the rest of the team directly. You should have good knowledge of one or more systems programming languages and ideally some Go experience. We do a lot of trouble shooting so good knowledge up and down the stack is critical, including debugging, profiling, network wrangling and optimisation.<p>We have an office dog, Minos, although he&#x27;s home on paternity leave right now. He&#x27;s a beagle and rather cheeky. We can send you a pic if you need it to help in your decision making process. If you would like to learn more about the roles please visit <a href=\"https:&#x2F;&#x2F;www.longshotsystems.co.uk&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.longshotsystems.co.uk&#x2F;</a>","time":1518449754,"type":"comment"}