{"by":"rickygrows","id":14901923,"parent":14901313,"text":"Grow | <a href=\"https:&#x2F;&#x2F;thisisgrow.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;thisisgrow.com&#x2F;</a> | Norfolk, VA | Associate Technology Director | ON-SITE | Full-time<p>Paid relocation and temporary housing for selected candidates. This is a full-time position at our office in downtown Norfolk, VA.<p>Our Associate Technology Director plays a key role in concepting, planning, and executing our interactive projects. Successful candidates for this job will bring deep experience leading development teams while building and sustaining productive lines of communication within Grow and to our clients.<p>1.) Lead development teams on assigned projects through all aspects of project executions including requirements gathering, solution architecture, coding and QA.<p>2.)Manage and provide direct support to 3-5 frontend developers including professional development, 1:1 meetings, and general guidance&#x2F;advice.<p>3.) Serve as the primary technical contact to clients, developing timing and resource allocations, technical specifications, and scope of work documentation.<p>4.) Work within the local and global development communities to promote Grow as a leader in the digital field.\nDefine and maintain best practices in development, documentation, standards support, and QA.<p>Grow is a smaller agency (just under 40 employees) that loves to do amazing work for amazing clients. We’re part of a community of like-minded people in the Norfolk &#x2F; Virginia Beach metro who spend our time creating great work and building culture around us—with lovely beaches, urban amenities, and family-friendly opportunities throughout the region.<p>You’ll start with a full month of paid vacation and holiday leave, including two weeks in which the company pauses operations—one at midsummer, and one at the holidays. A wealth of additional company benefits include health, dental, matching 401k, disability, paid training, and more.","time":1501602217,"type":"comment"}