{"by":"nsainsbury","id":14906390,"parent":14901313,"text":"RateIt | REMOTE - (Australia or similar TZ) | Full-Time | <a href=\"https:&#x2F;&#x2F;www.rateitapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rateitapp.com</a><p>RateIt is an Australian led company which is focused on helping businesses (retail, hospitality, medical, etc.) consistently deliver great customer experiences every day.<p>We&#x27;re Hiring For:<p>1) A product focused full-stack web developer to join our small (28 people) but hardworking and passionate team. We find the people who fit best at RateIt often come from a startup background where they&#x27;ve had to wear many hats and have been involved with bringing new products to market end-to-end.<p>We’re a modern development team – our tech stack today is a micro-services oriented architecture using C# + SQL Server on the back-end (Azure&#x2F;Service Bus&#x2F;Storage&#x2F;Functions), with Angular&#x2F;Backbone&#x2F;Marionette on the front-end. However, if you love to learn new things and come from a background with Ruby, Python, Go, etc. we&#x27;d still love to talk to you. Rather than just hiring for expertise in a particular stack, we believe that great developers demonstrate their skill through design, UX, thoughtful architectural decisions, user empathy, outstanding technical communication, and overall product understanding. In other words, we&#x27;re looking for someone who sees themselves as more than just a cog in the wheel.<p>2) QA engineer. You&#x27;ll be the first QA employee at RateIt so we&#x27;re looking for someone who can step in and own software quality end-to-end. Your job will be to write and maintain automated test scripts and develop testing plans and execute them against new features and bug fixes. You&#x27;ll prioritize and manage bugs and overall help improve our development&#x2F;testing process to prevent problems before they happen.<p>Sound like a good fit? Get in touch with me at neil@rateitapp.com","time":1501629439,"type":"comment"}