{"by":"ryan_j_naughton","id":14905827,"parent":14901313,"text":"Fair Financial | Software Engineer | Data Engineer | Data Scientist | Santa Monica, CA | Onsite | Full-Time<p>Fair is an automotive FinTech startup revolutionizing the way consumers finance and shop for cars by offering unprecedented freedom, flexibility, and a fully digital experience. We are well funded. Our leadership team ran Tesla Financial Europe and BMW Financial and founded TrueCar. We are using machine learning to rethink the industry approach to car residual valuation, enabling us to bring flexibility to car leasing (i.e. a car lease without a term enabling customers to return the car whenever they want).<p>Our mobile application fully digitizes the car buying experience, turning the traditional 3-4 hour experience at the car dealership into a relaxed 15 minutes (think fully automated credit checks, fraud checks, contract generation, vehicle pricing, titling&#x2F;registration, etc). The customer then is month-to-month with their car -- they can return the car with only 1 month notice.<p>We are looking for software engineers, data engineers, and data scientists with python experience. We like generalists as we regularly move between training machine learning models to writing production APIs to managing data pipelines.<p>* Bachelor’s degree in computer science or mathematics (or equivalent experience).\n* 2+ years of professional experience using dynamic, high level languages (e.g. python, ruby).\n* 3-5 years of experience in professional software development.\n* Proficiency in Python.\n* Experience with ORMs preferred (e.g. SQLAlchemy and ActiveRecord).\n* Experience building and maintaining RESTful services using established web frameworks (e.g micro frameworks like Flask and Sinatra).\n* Familiarity with SQL databases and query languages.\n* Experience building ETL pipelines a plus.\n* Experience with automated testing (unit, functional, and integration tests).\n* Ability to contribute to and excel in a team environment.\n* Great communication skills.<p><a href=\"https:&#x2F;&#x2F;www.fair.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fair.com&#x2F;</a>\nryann@fair.com","time":1501625089,"type":"comment"}