{"by":"patv","id":14906042,"parent":14901313,"text":"Vitally | Senior Javascript Engineer (First Hire) | New York | Onsite<p>Vitally is looking for a senior&#x2F;lead front-end engineer to join us as we go through Techstars this summer.<p>What we&#x27;re looking for:<p>An ideal teammate for us is a front-end focused senior engineer who is quick learning and adaptable. We&#x27;d like you to initially own a good amount of our front-end and dive in where ever else you may be curious (back-end, devops, etc). As the lead on the front-end, you&#x27;ll also play a critical role in product strategy, design, and building&#x2F;managing the future front-end team.<p>Our tech stack is evolving quickly, but we&#x27;re building the front-end in React&#x2F;Redux + Typescript and the backend in Node + Typescript + Postgres. Experience with any of those technologies is a plus, but we&#x27;re open to speaking with strong engineers who will pick things up quickly. Any experience building data-intensive applications is also a plus - we deal with a lot of data :)<p>As we grow, you&#x27;ll be able to take a significant leadership role within our engineering team. You&#x27;ll also have the opportunity to be a member of the team as we go through the Techstars NYC summer session, working alongside some of the most promising startups and talented entrepreneurs in New York.<p>Who we are: \nWe are a product analytics platform built for Customer Success. We help Customer Success teams track the product metrics critical to customer retention alongside their impact on those metrics. Check out our demo at <a href=\"https:&#x2F;&#x2F;play.vitally.io\" rel=\"nofollow\">https:&#x2F;&#x2F;play.vitally.io</a><p>Who you are:<p>- You are an exceptional Javascript engineer and not just a &quot;framework user&quot;<p>- You have an intuition and passion for delightful UI and UX. We are setting the bar quite high here and need you to help ensure that polished design translates well into actual code. So yes, you should have a decent understanding of CSS :)<p>- You are a crazy-fast learner. Thrown into a foreign codebase, you can fire up dev tools and find your way around in a short amount of time<p>- You have a passion to join a startup at the ground floor. You want to help contribute to the development of the team and culture, helping build both into one of the most respected and reputable around","time":1501626540,"type":"comment"}