{"by":"d8niel","id":14906029,"parent":14901313,"text":"drchrono | Senior Software Engineer, API Engineer, Full Stack Engineer, Backend Engineer | Mountain View | Full Time, VISA, <a href=\"https:&#x2F;&#x2F;www.drchrono.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.drchrono.com</a><p>If revolutionizing healthcare excites you, join our growing team and help us achieve our mission to build better software for doctors and patients and improve healthcare for all. drchrono was founded and is led by two software engineers, Michael Nusimow and Daniel Kivatinos. Unlike other healthcare companies, our company is built from the ground up to address modern healthcare through technology and innovation.  We believe in open APIs and being part of an open ecosystem.<p>We are a YCombinator funded Silicon Valley startup working out of the chronoplex in Mountain View, CA and Hunt Valley, Maryland. Since our inception, we have attracted over 100k physicians, 10 million patients, and have been to the White House to discuss how technology can solve healthcare problems as part of the Obama Administration’s Precision Medicine Initiative . So far we’ve booked 20+ million patient appointments and processed 1.5 billion dollars in medical billing per year.  drchrono is ranked by INC 500 as one of the fastest growing private companies in America.  We are an official Apple Mobility Partner with our industry leading EHR (Electronic Health Records)  iPad app.<p>drchrono Engineering plays a critical role delivering innovative products from inception to mass adoption.  You’ll be able to use your expertise and creative talents to build things working closely with product, design, and other departments.  We have the mind and soul of SaaS startup and you’ll be able to build world class software that delights users and can scale to millions of people.  The ideal candidate will be comfortable in a fluid start-up environment and will bring an energetic, fun and creative approach to their work. You could be an experienced engineer or a recent graduate eager to learn and get involved at all stages of the development lifecycle.<p>Apply here! \n<a href=\"https:&#x2F;&#x2F;www.drchrono.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.drchrono.com&#x2F;careers&#x2F;</a><p>or email your cv to careers at drchrono dot com","time":1501626443,"type":"comment"}