{"by":"colinsidoti","id":14904516,"parent":14901313,"text":"Head of Engineering - Full Time<p>We are committed to building a top-tier engineering team that will help us revolutionize the financial advice industry.  As Head of Engineering, leading this team and the development of our technology will be your primary responsibility. You will ensure our software remains scalable and stable as usage grows and our product iterates, expands, and improves.<p>You will report directly to the CTO, who is also responsible for product management and technical recruiting.  You will work with the CTO to identify personnel and other engineering needs as they come up.<p>You are an experienced technical leader and engineer, and have worked in both ideal and non-ideal environments.  You recognize that you are joining a young startup, and sometimes that means choosing good over great.<p>You are ultimately responsible for taking command over the engineering team, the code architecture, and the technologies in use.  By the end of the year, you are likely to be overseeing at least 2 additional full-time engineers.<p>About Harbor<p>Harbor is improving America&#x27;s retirement security.  We are building software to make high-quality financial planning accessible and affordable to the 65% of Americans who are not receiving any today.<p>We provide our users with a beautiful, online experience to design a financial plan that would cost thousands of dollars from a professional advisor. To enable that, we are developing a financial planning platform that is automated (where possible), intuitive, and educational to use. We are maniacally focused on making it easier for the average American to actually think about their finances, and are building a best-in-industry user experience to achieve that.<p>We are an early-stage start-up with a powerful mission and a small but high-calibre founding team: 3 co-founders educated at Harvard and MIT, extensive professional experience in financial services, management consulting, and engineering, and are one of 10 teams in the Techstars Chicago accelerator program.<p>Note: following the program&#x27;s completion in October, we will relocate to Boston, New York, or San Francisco, depending on what&#x27;s best for the business.<p>If interested, please contact colin@harborpension.com with your resume and a little about yourself.","time":1501616222,"type":"comment"}