{"by":"kimburgess","id":14906284,"parent":14901313,"text":"ACA Projects | Front-end developer | Brisbane &#x2F; Sydney, Australia (Onsite)<p>ACA are a fast-paced team of developers and designers based in Sydney and Brisbane, Australia. We build open systems for modern, connected environments.<p>For those who don&#x27;t speak marketing bullshit: we build systems which cover &#x27;smart workplace apps&#x27; (people finding, room booking), room &#x2F; environment automation to event space control (audio mixing, lighting, video distribution etc). Our projects revolve around wrapping everything in the physical environment which has an API (or some way to interact with it) into a nice, cohesive UX for users and then providing simple management and analytics for teams who look after installed tech.<p>In addition to what you&#x27;ll find on our site (<a href=\"https:&#x2F;&#x2F;www.acaprojects.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.acaprojects.com&#x2F;</a>), you can see a quick video here:\n <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;99DTmflCdw4\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;99DTmflCdw4</a> (complete with cheesy feelgood music) that showcases some of what we&#x27;ve enabled across PwC&#x27;s new workplaces. Where there has traditionally been proprietary, hardware based systems and solutions designed for vendor lock-in, we replace these with a modern, open source software stack (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;acaprojects\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;acaprojects</a>).<p>---<p>We are searching for another front-end developer to help us build these things. You will need to be familiar with TypeScript, Angular2 and collaborating with other humans. You will be joining a team that&#x27;s a mix of full stack as well as front-end only devs and designers.<p>---<p>Our Brisbane presence is based out of Little Tokyo Two (The Capitol) which you&#x27;ll find in the middle of the city and has fast, symmetric internet, showers and bike racks, beer on tap, and tolerable colleges. The Sydney team work from a nice open space above a gallery in Chippendale that&#x27;s flanked by good coffee and slightly above average bars.<p>To find out more, or get in touch, hit me up via kim@acaprojects.com.","time":1501628443,"type":"comment"}