{"by":"le_zonzon","id":14902878,"parent":14901313,"text":"LightOn | Software engineer | Paris, France | FULL-TIME, ONSITE<p>Would you like to contribute to a fast-growing company at the cutting edge of innovation between optics and artificial intelligence? LightOn is looking for a Software Engineer to help develop our new optical co-processors for Artificial Intelligence. \nWithin the R&amp;D team, reporting to the CTO, your main duties include : \nDefine and design the digital i&#x2F;o protocols of LightOn processors,\nDevelop the software layer between LightOn hardware and various scientific computing &#x2F; machine learning frameworks,\nInstallation &#x2F; admin of a cloud-based server,\nIntegration and testing of the algorithms developed by the Machine Learning team,\nInteracting with the team developing the experimental prototypes, \nManaging suppliers, subcontractors and industrial partners (writing specifications, technical follow-up, planning and quality control), \nDefining user interfaces, according to specific use cases, \nAccording to skills: sysadmin, data management and security procedures for the entire team.<p>THE COMPANY  Founded in 2016, LightOn ( www.LightOn.io ) is a technology start-up that develops a new generation of optical co-processors designed to accelerate low power Artificial Intelligence algorithms for massive amounts of data. The technology developed by LightOn originates from the ESPCI and Ecole Normale Supérieure laboratories, in Paris, France. LightOn won in 2016 the best Digital Tech startup from the City of Paris. We are located in the center of Paris, within the Agoranov incubator.<p>CONTRACT DETAILS  This position is for a full-time employment, that can start as soon as a possible. Salary will based on technical skills and experience. The candidate must have the right to work in the EU.<p>REQUIRED PROFILE Engineering Degree (MSc or PhD) in Software Engineering. An industry experience would be a plus. \nTechnical skills (required) : You must be expert in<p>- Development of hardware drivers under GNU &#x2F; Linux<p>- C &#x2F; C++ development with hardware &#x2F; embedded devices<p>- Python integration &#x2F; wrappers<p>- Code profiling &#x2F; optimization<p>A significant interest in one or more of the following topics would be a plus:<p>- Scientific programming (in particular NumPy &#x2F; SciPy frameworks),<p>- Knowledge of current Machine Learning frameworks  (Scikit-learn, TensorFlow, etc),<p>- Parallel programming (GPU under CUDA).<p>- Digital signal processing, digital circuits, FPGA programming.<p>In order to work in a small startup such as LightOn, you will also need to be creative and pragmatic, have a good team spirit and communication skills. LightOn is an equal opportunities employer. <p>CONTACT  To respond to this offer, please send an e-mail to jobs@LightOn.io with [CS Engineer] in the subject line. Please attach a resume (including name of possible references) and short cover letter both in PDF.","time":1501607026,"type":"comment"}