{"by":"jackietreehorn","id":14902218,"parent":14901313,"text":"Cloudflare <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;</a> | San Francisco, CA; London, UK; Singapore, SG; Urbana-Champaign, IL; Austin, TX; | VISA, ONSITE\nCloudflare is building a better Internet. Our long term goal is to give every site the same performance, security, and reliability that major sites like Google and Facebook accomplish, without any specialized network hardware or complicated administration. We enhance millions of sites, including this one.\nWe believe in working collaboratively with an emphasis on personal growth and responsibility. Working at Cloudflare lets you wear many hats, spearhead new projects, and shape your career. Product market fit is established, but there&#x27;s a lot of great engineering, product, sales, and support work to be done. We&#x27;re starting 2017 at 330 people, with plans to double that in the next year.\nWe&#x27;re always hiring for operations&#x2F;SRE, sales, general systems engineering (mostly in Go, nginx, and network, as well as DNS at scale), and web development. Here&#x27;s some specific roles we&#x27;re keen to hire:\n0) Engineering Manager -- We&#x27;re looking for an Engineering Manager to lead our PlatOps team, and also generally looking for more managers. Our engineering management team is very strong and we are looking for experienced individuals to join.\n1) Data Engineering(s) -- We have a ton of different technologies that our data engineers work with, and they are a really strong core team here. Kafka, PostgreSQL, Docker, Mesos, Marathon, Chronos, nginx, and so many more technologies.\n2) Product Security Engineer -- We have a lot of applications and need more talented software engineers who love to break and fix. We need hands on engineers who are not afraid to dive in and drive fixes to completion, and evangelize security.\n3) Systems Engineer (Austin&#x2F;SF&#x2F;London) -- We are hiring systems engineers at all of our offices. Our Austin office is growing particularly fast. Web and distributed systems built with Go, Node, Docker, and much more. Check out our blog to see what&#x27;s planned for 2017 (<a href=\"https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;</a>)\nIf you&#x27;re interested, please apply through the <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> link, our recruiting team looks at every single application from every applicant.","time":1501603689,"type":"comment"}