{"by":"raj7desai","id":14902028,"parent":14901313,"text":"School Of Accelerated Learning | On-Site | Full Time | Hyderabad, India<p>School Of Accelerated Learning is a new age system of learning. Built on the pillars of research and feedback driven methodologies, enhanced with positive feedback loops, the school enables deeper, meaningful learning of future ready skills. SOAL is in essence a parallel system of education that enlightens each student and triggers their drive to embrace disruption in a rapidly evolving world.<p>We’re launching our maiden course TheExponentProgram:WebDev, that aims to teach and develop the skills of modern software craftsmanship in individuals who have the aptitude and zeal to succeed as software developers in today&#x27;s ever evolving technology landscape.<p>TEP:WebDev is a 14 week, full time, immersive program that will be hosted at T-Hub, Hyderabad.<p>TEP:WebDev works with students on building future ready technical skills along with a focus on cognition and social intelligence, through our proprietary module MetaLearning.<p>The curriculum consists of modern frameworks such as NodeJS, React, Electron, Docker etc. Learners will focus on the semantics of designing and developing a software product and not just the syntax. The learning path at TEP:WebDev is defined by Milestones- products which learners will build to better understand and learn core tech. concepts.<p>We’re looking to hire for the following profiles:<p>- Educator : Experienced (3-5 years work. ex) developers who know NODE, React&#x2F;Native and would be interested in teaching along with development of products (learning products for SOAL) <a href=\"http:&#x2F;&#x2F;applications.soal.io&#x2F;educator&#x2F;en \" rel=\"nofollow\">http:&#x2F;&#x2F;applications.soal.io&#x2F;educator&#x2F;en </a><p>- Guide : Freshers (0-2 years work ex.) who know any programming language and would like to learn, build and help students with their learning curve.  <a href=\"http:&#x2F;&#x2F;applications.soal.io&#x2F;guides&#x2F;en \" rel=\"nofollow\">http:&#x2F;&#x2F;applications.soal.io&#x2F;guides&#x2F;en </a><p>- Research and Development Associate: Freshers (0-2 years work ex.) who are interested in research on learning and education and would like to build data driven research methodologies to analyse the various aspects of SOAL learning. <a href=\"http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en\" rel=\"nofollow\">http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en</a> (Mention ‘Research and Development Associate’ in the Role field) <p>- Marketing Lead - Experienced (3-5 years work ex.) marketing professionals who will be responsible for strategising and executing all marketing efforts for SOAL <a href=\"http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en\" rel=\"nofollow\">http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en</a> (Mention ‘Marketing Lead’ in the Role field) <p>- Partnerships and Alliances Lead (3-5 years work e.x) : Experienced (3-5 years work ex.) professionals who will lead all strategic partnerships for SOAL with various leading technology companies to sign them on as partners for product building and recruitment <a href=\"http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en\" rel=\"nofollow\">http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en</a> (Mention ‘Partnerships and Alliance Lead’ in the Role field)  <p>- Digital Marketing Associate : Freshers (0-2 years work ex.) who would be responsible for execution of the digital marketing strategy and will also interface with various agencies involved in this effort.  <a href=\"http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en\" rel=\"nofollow\">http:&#x2F;&#x2F;applications.soal.io&#x2F;associate&#x2F;en</a> (Mention ‘Digital Marketing Associate’ in the Role field)  ","time":1501602761,"type":"comment"}