{"by":"dkoston","id":14902888,"parent":14901313,"text":"Help.com | Multiple Positions | Austin, TX | ONSITE | FULL TIME<p>It&#x27;s 2017 and customer service still sucks. Companies have tons of data about you (what you&#x27;ve purchased, every page view to your site, every interaction you&#x27;ve ever had with them). However, that data is stuck in a bunch of fragmented systems and even the customer service systems they currently use don&#x27;t connect their own data between different channels (tickets, chats, phones, etc).<p>Help us eliminate terrible customer service experiences by building out the world&#x27;s best customer service and support platform. With workflows shaped from our time at HostGator (10M+ customers) and GoDaddy (10M+ customers), and technology skills developed from building cPanel, Cloudflare, CBS Sports apps, Node itself, and more.<p>We are predominantly in the JavaScript&#x2F;Node.JS ecosystem, specifically a React&#x2F;Redux stack on the front-end with Jest and Enzyme driving testing. On the backend, we launch Node.JS services of sizes ranging from micro to large. Everything is built and deployed in containers on Kubernetes and we&#x27;re building for scale.<p>Our product is real time, distributed, and relies on a great user experience. Since we&#x27;re a communications platform, we strive for 100% uptime (multi-zone, multi-region, horizontally scalable, cross datacenter replication). As such, simple things on a single application&#x2F;server become fun challenges in a distributed system :)<p>Open Roles:<p><pre><code>  - Quality Assurance Engineer (JavaScript)\n  - Software Engineer (Front-end - React.js)\n  - Senior Software Engineer (Backend - Node.js)\n  - Software Engineer (Backend - Node.js)\n</code></pre>\nPerks:<p><pre><code>  - Working with 2 Node Core Contributors and tons of other smart folks\n  - Founders have helped build many successful companies before (cPanel, Cloudflare, HostGator, etc)\n  - On-site lunch\n  - Well tested code and agile practices\n  - Your code is used 8+ hours a day by our customers so you&#x27;ll gain massive amounts of experience and feedback\n</code></pre>\nCurrently Predominant Technologies:<p><pre><code>  - Node.JS\n  - React&#x2F;Redux (Jest, Flow, Enzyme)\n  - Docker &#x2F; Kubernetes\n  - Google Cloud Platform, AWS\n  - Message Queues (NATS, Google Pub&#x2F;Sub)\n</code></pre>\nApply today at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;help.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;help.com&#x2F;</a>","time":1501607091,"type":"comment"}