{"by":"rymohr","id":14903601,"kids":[14903641],"parent":14901313,"text":"Kumu | Senior Software Engineer | REMOTE | <a href=\"https:&#x2F;&#x2F;www.kumu.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kumu.io</a><p>Bootstrapped data viz platform that helps people understand complex relationships, primarily through network, systems, and stakeholder maps.<p>We’re currently working with some of the world’s top organizations including The Omidyar Group, Gates Foundation, Hewlett Foundation, USAID, Stanford ChangeLabs, 100Kin10, Democracy Fund, World Bank, Humanity United and more.<p><pre><code>    - Full-time remote position\n    - Salary $60-80k\n    - Equity 1-2%\n    - ARR over $200k\n    - Flexible hours within a small, mission-driven team\n    - Annual adventure retreats\n    - Stack: react, redux, rails, webgl, webpack&#x2F;babel, aws, git&#x2F;github, IE11+\n    - Bonus points for experience with: graphs&#x2F;networks, couchdb, elasticsearch, redis, d3\n</code></pre>\nYou’re probably a great fit if:<p><pre><code>    - You’re a talented web developer (both frontend and backend)\n    - You’ve mastered multiple programming languages and frameworks\n    - You’ve built and maintained a complex library, single page web app, or product\n    - You work well setting your own priorities and working with lots of freedom\n    - You’re excited about (or at least don’t mind getting dragged into) snowboarding in Bend, rock climbing in Utah, surfing in Costa Rica, or whitewater rafting in Colorado.\n</code></pre>\nOn a day-to-day basis you’ll be working with Ryan [1] and Dan [2]. You’ll be involved throughout the entire development process, from initial brainstorms and sketching to the final stages of testing and release. We move fast and ship often, and try to break work into weekly deliverables to keep everyone’s expectations and progress in check. We do a hangout at the beginning of each week to reconnect and revisit everyone’s immediate priorities.<p>If you’re interested, please send a SHORT email to careers@kumu.io telling us why you’re excited to work for Kumu. Experienced developers only. Lengthy and&#x2F;or generic applications will be ignored. Thanks!<p>[1]: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;rymohr\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;rymohr</a><p>[2]: <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;_danprince\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;_danprince</a>","time":1501611025,"type":"comment"}