{"by":"vikp","id":14902965,"kids":[14916321,14907082],"parent":14901313,"text":"Dataquest | San Francisco, CA | Remote or onsite | Full-time<p>At Dataquest, we teach data science interactively online to hundreds of thousands of students worldwide.  We&#x27;re focused on teaching skills and building intuition from the ground up with our project based curriculum.  Unlike most educational options, we focus on motivating students to learn, not just content delivery.<p>We have students go from no programming knowledge to jobs at companies like SpaceX, Amazon, and Microsoft, and you can read their stories here -- <a href=\"https:&#x2F;&#x2F;www.dataquest.io&#x2F;stories\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io&#x2F;stories</a> .  Best of all, we do it at a low monthly cost of $29 or $49.<p>We&#x27;re a bootstrapped company, which we think is extremely important, since it aligns our incentives with our students.<p>Our open roles are a great opportunity if you&#x27;re passionate about teaching, if you&#x27;re burnt out doing work that doesn&#x27;t feel like it has a direct impact, or if you want to peek inside a profitable bootstrapped company.<p>Please email vik@dataquest.io if you&#x27;re interested.<p>Open roles:<p>* Data Science Instructor (75k-105k) -- outline our curriculum, teach concepts, and analyze data to continuously improve how students learn.  This is a chance to make a direct impact on students around the world, while teaching and learning interesting concepts (neural nets, data pipelines, etc).<p>* Data Analysis Instructor (70k-95k) -- teach data science concepts to non-technical people.  Ideally, you have experience with SQL and Excel, exposure to teaching, and, most importantly, are passionate about building intuition by crafting good explanations.<p>* Devops (75k-100k) -- maintain and enhance our backend infrastructure that allows students to run code and have it automatically checked for correctness.  Develop our deployment infrastructure and make architecture decisions.  Work with Python 3, Docker, and Kubernetes.<p>* Data Journalist (60k-80k) -- Help us teach data science on our blog (dataquest.io&#x2F;blog) that gets hundreds of thousands of monthly uniques.  Work with technical experts to build compelling content that has value to students learning data science.","time":1501607522,"type":"comment"}