{"by":"pettersamuelson","id":14902829,"parent":14901313,"text":"Agentum (<a href=\"http:&#x2F;&#x2F;agentum.se&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;agentum.se&#x2F;</a>) | Full-stack senior developer | Stockholm | Fulltime | ONSITE<p>About Agentum &amp; why this role really really is key\nAgentum runs an executive recruitment business in the Nordics. Over the years we have created a totally unique network of well-known and well-connected people, the agents. Via our 1000 agents we source candidates to our clients’ assignments both quicker and with greater quality than our competitors. In short, we’re a crowdfunded referral recruitment business.\nKey to our success is therefore not only signing the right assignments, but also assuring continuous top quality and engagement among agents. Basically it’s all about creating the platform where great people can meet great people.\nAnd that’s where our product development becomes key – we constantly need to assure a seamless business model where we can communicate, develop and enhance the experience of both candidates, agents and clients.\nSo you see, we really really need a massively talented and business savvy senior developer!\nAnd why would you really really need us…?\n•\t…because you’ll build Agentum’s products using cutting edge web and server side technologies\n•\t…because you’ll grow as a developer and a professional, working independently but near a small and agile team of world-class software engineers and product designers who work for our sister company Nova\n•\t…because you’ll have great impact on transforming the very traditional industry of executive recruitment \n•\t…because you’ll truly have sooo much fun\nSkills we really really want you to have:\n•\t&gt;5 years of professional software development experience\n•\tProfessional experience with at least one functional programming language\n•\tSolid Javascript skills (including experience with Javascript MVC&#x2F;MVVM frameworks)\n•\tProven ability to convert UX&#x2F;UI designs into pixel-perfect HTML and CSS\n•\tStrong communication and analytical skills\nAnd of course, goes without saying, you have a self-driven can-do mindset and an insatiable desire to learn. And you really really like having fun at work!<p>Send application to info@agentum.se","time":1501606681,"type":"comment"}