{"by":"bowenli","id":14901834,"parent":14901313,"text":"Weaveworks | Senior Backend Engineer, Senior Frontend Engineer, Developer Experience&#x2F;DX | San Francisco, London, Berlin | ONSITE, Full-time, <a href=\"https:&#x2F;&#x2F;www.weave.works\" rel=\"nofollow\">https:&#x2F;&#x2F;www.weave.works</a><p>* Senior backend engineer: Work on Weave Cloud and our open source cloud native projects Weave Net, Scope, Flux and Cortex, as well as sister technologies such as Docker, Kubernetes, and Prometheus. All backend work is primarily in Go. Appy here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;qjr62o1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;qjr62o1</a><p>* Senior frontend engineer: Write reactive and clean web UIs that display complex data and are easy to navigate. Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;m6jkow1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;m6jkow1</a><p>* Developer Experience&#x2F;DX: Help lead the growing community of users of Weave and its sister technologies such as Docker, Kubernetes, and Prometheus. Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;05flus1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;05flus1</a><p>Come help us build OSS tools that other developers use to tame their containerized applications. Projects like Weave Scope observe containers&#x2F;pods&#x2F;services and their interactions to provide visibility and insights. Developers can quickly see the state of the resulting systems and validate their assumptions.<p>We offer family-friendly hours (some of us have kids, too) and encourage a good work-life balance. Feel free to work from home on certain weekdays, or combine work and travel for a month. It&#x27;s no big deal if you&#x27;re not a Go expert, we trust that you can learn on the job. Also, all our tools are open source: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;weaveworks\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;weaveworks</a> Browse our PRs to see how we work as a team!<p>The hiring process: Checking your CV&#x2F;GH&#x2F;SO (if not enough signal: small coding challenge), 45 mins hangout, afternoon take-home coding&#x2F;design challenge, in person interview with future colleagues.<p>Note: Weaveworks is not set up to sponsor visas at this point.","time":1501601876,"type":"comment"}