{"by":"chrmcg","id":14911060,"parent":14901313,"text":"FitMango | Software Engineer | Baltimore, MD | ONSITE | fitmango.com<p>FitMango is transforming the fitness industry by making it easier and cheaper for gyms to offer excellent personal training for their clients.<p>Our SaaS platform tracks detailed client data (think EHR for fitness), replaces a trainer&#x27;s notebook and stopwatch with an easy-to-use mobile app, and allows a gym to write workout templates that get customized to each client&#x27;s specific and evolving needs.<p>One of our cofounders, Ben, runs a successful boutique gym specializing in small group personal training (1 trainer : 4 clients) that doesn&#x27;t compromise on customization.\n(<a href=\"https:&#x2F;&#x2F;www.yelp.com&#x2F;biz&#x2F;activate-body-baltimore\" rel=\"nofollow\">https:&#x2F;&#x2F;www.yelp.com&#x2F;biz&#x2F;activate-body-baltimore</a>)\nBy automating away the paperwork and context-switching inherent in this model, we&#x27;re making it possible for larger gyms to offer drastically cheaper personal training, with a view toward bringing about large-scale improvements in public health.<p>Our investors own various gyms in Maryland and beyond, including more than 50 Planet Fitness franchises, and we have great relationships within the industry. We&#x27;re looking for fantastic developers to help us scale our SaaS process, take ownership of features for new clients, and use the data we generate to help our gyms provide more effective training.<p>Our front end is React and React Native; we are transitioning from Meteor&#x2F;Mongo to AWS Lambda and Dynamo on the back end. We&#x27;re looking to hire two engineers with complementary skill sets, so whatever you&#x27;re good at, send us an email at hiring@fitmango.com with a link to a project you&#x27;re proud of. As employee #5 (or 6), you&#x27;ll make a huge impact on our company, enjoy unlimited free personal training with a competitive salary and equity package, and help set the tone for what&#x27;s shaping up to be a revolution in personal fitness.","time":1501685986,"type":"comment"}