{"by":"pruth","id":14923633,"parent":14901313,"text":"Carv by MotionMetrics | iOS Swift Developer | London, UK &#x2F; Vienna, AT | Full-Time | £35 - £60k<p>If you love skiing as much as we do and want to combine your hobby with your profession, then read on!<p>Carv is a wearable that speaks to you as you ski - it’s the world’s first digital ski coach. This is an exciting and rare opportunity to work for a well-funded start-up that broke the sports wearables record on the crowdfunding platform Kickstarter and is now months away from launch.<p>We’re a sports technology company born out of London making a huge impact on the world of skiing. Built in consultation with Olympians, Carv gives casual skiers access to the feedback and knowledge that only elite skiers have had access to so far. With an extremely thin and intelligent insert, Carv measures your motion and pressure distribution then relays actionable feedback through the user’s earphones in real-time.<p>Our team is looking for an excellent Swift engineer to come join our team full-time in London, Vienna or Tignes (yes that’s the French Alps!). If you love skiing as much as we do and want to combine your hobby with your profession, then read on!<p>In the role, you will:<p>- Get to ski! \n- Report directly to the CTO and work closely with the CEO. \n- Be responsible for all things Swift and iOS with a direct impact on our customers from Day 1. \n- Work with a variety of iOS frameworks including CoreBluetooth, Realm, MapBox and Swift Protobuf. \n- Use CI and UI Testing to ensure quality. \n- Work with other tools like Sketch and Paintcode. \n- Own the maintenance and updating of the app. \n- You may even get your hands dirty with our core analysis engine written in c++.<p>Our candidate is someone who is:<p>- A skier with a love of the great outdoors. \n- Experienced (ideally 1+ yr) in Swift and 2+ years in iOS with an app or 2 to show for it. \n- Willing to learn with a strong foundation to build upon. \n- Willing to get their hands dirty and communicate ideas effectively with an attention to detail \n- A person who finds a fast-moving, unpredictable and constantly evolving work environment to be buckets of fun.<p>Reach out to me at pruth@motionmetrics.co","time":1501792710,"type":"comment"}