{"by":"jasonrosenbaum","id":14930829,"kids":[14930846],"parent":14901313,"text":"Worldwide, REMOTE (or in Washington, DC), full time, $75-$95k (negotiable for the right person). Frontend engineer with Action Network (<a href=\"https:&#x2F;&#x2F;actionnetwork.org\" rel=\"nofollow\">https:&#x2F;&#x2F;actionnetwork.org</a>)<p>We are Action Network. We build technology for the progressive movement in a unique not-for-profit model; we create SaaS solutions with a social mission. Fast Company called our platform “the backbone of the anti-Trump organizing efforts.” <a href=\"https:&#x2F;&#x2F;www.fastcompany.com&#x2F;3069132&#x2F;this-tech-platform-is-the-backbone-of-the-anti-trump-organizing-efforts\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastcompany.com&#x2F;3069132&#x2F;this-tech-platform-is-th...</a><p>We are the technology behind the Women’s March, People’s Climate March, Swing Left, Indivisible groups around the country, the AFL-CIO, Daily Kos, and hundreds of other progressive organizations. Our platform creates new possibilities for collaboration and mobilization that is meeting a real need for the progressive movement. We are a small team that is growing rapidly, and we are expanding our technology significantly.<p>You are an excellent frontend&#x2F;javascript developer or engineer, well-versed in today’s rapidly changing frontend and javascript landscape. You are experienced working with a small, dedicated team of product managers, designers, and backend engineers to build web-driven software, especially SaaS offerings. You know how to make hard choices, balancing perfectionism when it&#x27;s possible with just getting it done when you have to so you can ship on time and on budget. You think outside the box to find solutions and thrive on both collaborative and independent problem solving. You are independent and ready to own a product’s frontend implementation from start to finish. And you are looking for a job where ideals are matched by a solid business that is growing rapidly and making a difference in the world.<p>You&#x27;d be joining a small, flexible, largely remote team with a lot of autonomy and the chance to make foundational tech choices, rather than dealing with legacy systems, with the potential to ship products that immediately impact the world. Hiring process includes phone interviews, small take-home projects, and some pair programming.<p>More details here: <a href=\"https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;16JknptHKk5jfNoptQhw7v5Kw6adAKcRyDqV2uKvPfGw&#x2F;edit?pli=1#\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;16JknptHKk5jfNoptQhw7v5Kw...</a><p>Apply with a resume&#x2F;CV and a portfolio&#x2F;github account at resumes@actionnetwork.org. Happy to answer any questions!<p>Edited to add: Should mention, excellent benefits. Generous leave and vacation policies, health care, 401k grant, etc...","time":1501871613,"type":"comment"}