{"by":"antonber","id":14933333,"parent":14901313,"text":"Highrise - Durham, North Carolina | Lead Backend Developer (Scala) | ONSITE | Full-time | Relocation to Durham | <a href=\"https:&#x2F;&#x2F;highrise-inc.workable.com&#x2F;jobs&#x2F;513323\" rel=\"nofollow\">https:&#x2F;&#x2F;highrise-inc.workable.com&#x2F;jobs&#x2F;513323</a> | Highrise connects the world through games<p>Highrise (<a href=\"http:&#x2F;&#x2F;appstore.com&#x2F;highriseyouravatarcommunity\" rel=\"nofollow\">http:&#x2F;&#x2F;appstore.com&#x2F;highriseyouravatarcommunity</a>) is the leading avatar-based social network on iOS. Every day, over 100,000 people use our application to make friends, keep in touch, decorate avatars and rooms, and chat. We are committed to providing a warm and comforting environment for people from all walks of life in Highrise.<p>As Lead Backend Developer, you&#x27;ll be the first non-founder engineer on the backend team. The role is highly independent and will be working closely with our cofounders on all things backend. We have a strong engineering culture with an extremely capable and experienced team. The entire Highrise mobile app was built single handedly by our CTO, with the entire server backend written by our VP Eng. We are looking for an engineer and developer of the same caliber to join our team to take Highrise to the next level.<p>The role is fast-paced and independent, with a focus on results rather than on direct oversight or management. The role will require learning new tools, languages, algorithms, techniques and much more. Our backend is modern and highly performant. The stack uses Kubernetes, JRuby, Scala, Akka, and MongoDB, so experience with any of these technologies is a plus. To support the next round of growth we plan to migrate the JRuby codebase to Scala, and you will be the lead architect of this new Scala backend. In short, this is the perfect role for a self-starting engineer who loves to solve challenging problems in a fast-paced environment.<p>More here: <a href=\"https:&#x2F;&#x2F;highrise.workable.com&#x2F;j&#x2F;B30762210C\" rel=\"nofollow\">https:&#x2F;&#x2F;highrise.workable.com&#x2F;j&#x2F;B30762210C</a>","time":1501890705,"type":"comment"}