{"by":"cargomatecrew","id":14936270,"parent":14901313,"text":"CargoMate Technologies | Front-end JavaScript Engineer | Richmond Upon Thames | Onsite, Full-time, £25K-£65K + 0.25-2% Equity, www.cargomate.co.uk<p>CargoMate Technologies brings innovative efficiency to the container shipping industry.<p>We’re developing a range of applications and technologies to record, monitor and analyse container ship cargo operations (i.e. the process of moving containers on and off a ship in port), to ensure ships depart early and consume less fuel on voyage. Our long-term goal is to bring the widespread adoption of autonomous technologies to merchant ships.<p>Voyages by ship are legally classed as ‘adventures’. We see CargoMate as an adventure too; driven by passionate problem solvers who are resilient when faced with a storm. We reach our destination by working as one crew.<p>We are backed by one of the UK’s most successful tech accelerators, Entrepreneur First.<p>We care about our craft and it’s important to us that you do as well. We’re looking for someone who’s willing to learn on the job, as well as teach others. You write code that you’re proud of as you know you and your team members will be the ones maintaining and adding new features to it.<p>You’ll work on a customer facing React.js website as well as an Android only React Native app. You don’t have to know our whole tech stack but it’s important that you’re willing to learn.<p>You’ll collaborate closely with the CTO as we turn our proof of concept into an MVP ready for production. You’ll build new features, do code reviews, mentor future team members as well as have mentors around you.<p>We keep up to date with the latest tech but know that bleeding edge usually puts you in an unstable spot. Our projects are written in Javascript, React.js, React Native and all use ES6.<p>For this role, Javascript skills and culture fit are more important than a formal education. We don’t do whiteboard interviews or ask you how many golf balls fit in a 747. You will get to show that you know what you’re doing by coding on your own machine as part of the interview process.<p>We see coding as a way of communication, it’s therefore important that you have excellent communication skills as well as fluency in written and spoken English.<p>Our intention is to enable remote working and flexible working hours as soon as we can. As this is one of our first hires, we need you full-time on-site in our offices in central Richmond upon Thames.<p>crew@cargomate.co.uk","time":1501948240,"type":"comment"}