{"by":"flippable","id":14963098,"parent":14901313,"text":"Designer, Product Manager, and others | New York | Full Time | www.flippable.org&#x2F;careers<p>flippable is hiring for four positions: Product Manager, Product Designer, Director of Marketing and Communications, and Director of Operations. We are accepting applications on a rolling basis and hope to onboard these new roles before this year’s state legislative elections in November. See more information about flippable below.<p>We care deeply about building an inclusive, equitable, and nationally representative team -- and thus designing our hiring process to minimize bias. We are using principles from Project Include and are actively recruiting individuals who share our passion for good government but may not yet have heard of us.<p><i></i>\nOur democracy is upside down. We see partisan imbalance at all levels of government -- but especially in our states. Over the past 10 years, the GOP invested heavily in winning state elections in order to take control of national elections. They passed laws suppressing voters and redrawing district lines to give themselves a permanent majority in Congress. And if we don’t take action at the state level, our system will continue to favor Republicans through 2030.<p>But we can flip the script -- starting in the states. By flipping state legislatures from red to blue, we can draw new Congressional maps and protect voting rights, giving everyone an equal voice in our democracy. We can enact progressive policies that protect our civil rights and expand the social safety net. And we can build a Democratic bench, ensuring strong state and federal leadership for decades to come.<p>Flippable is building a national movement to flip states from red to blue. We empower voters, volunteers, and donors with information that both educates and motivates them to support Democrats at the state level. Our primary activities are:<p>Raising awareness: We produce original digital content that highlights the critical role of state governments in a balanced democracy. Our content is viewed over 10M times per month.<p>Running the numbers: We are building a model to identify which Democratic candidates donors should invest in -- where their dollars and time will have the greatest ROI. Our analysis shows where we are most likely to flip seats and, ultimately, the state chambers that have the greatest impact on redistricting and voting rights.<p>Supporting candidates: We show our community the highest-impact ways to get involved through clear, tangible calls to action. Since November 2016, we have raised $450,000 and deployed thousands of volunteers to support Democrats running in the most critical -- and flippable -- races.","time":1502228575,"type":"comment"}