{"by":"astockel","id":2284659,"parent":2270790,"text":"BuzzGenie - Los Gatos - Remote is OK, but must be able to attend on site brainstorming and status meetings near Hwys 17 &#38; 85.<p>BuzzGenie is a social network/news/blog/action Internet portal. We address an individual's need to not only voice their opinions, but to make a difference, enabling them to discuss and blog interests and act on causes, issues, events, topics, and persons of interest while keeping their identity private to the Internet at large. BuzzGenie combines the best features of Facebook, Huffington Post, WordPress, Yelp, and Twitter by integrating the friends feature; recent activity feeds; interest-based news feeds, blogs, and Tweets; and connecting people using an <i>interest-based</i> social graph.  We have a solid revenue model which gets us to profitability in about two years.<p>Looking for LAMP and mobile developers, as well as Unix/Plesk admin.<p>Also looking for activists-bloggers.<p>You will play a key role on a very small team. Since we are at very early stage, you can become a major player in a company that wants to change and improve the way people interact on the things they care about. This is a very hot, competitive space with a potentially huge payout for the team first to get traction in the market. Great achievers will be rewarded accordingly.<p>Benefits of working on site has the additional benefit of three free gourmet meals a day (including Indian/vegetarian), an outdoor patio work area, hot tub, home gym, and unlimited gourmet espresso/cappuccino/coffee (it's a private residence). Imagine upscale 'garage' start-up. Walking distance to park with basketball, tennis courts, running track, and par course. Across Bascom Ave. from Los Gatos Creek trail for walking, running, roller blading, and biking.<p>Have a look at the site and see if it interests you. Helps to have some activist in your blood.<p>Compensation is accomplishment based until funding is closed. Founder's stock available.<p>astockel at buzzgenie com","time":1299170487,"type":"comment"}