{"by":"dalys","id":9127498,"kids":[9130925],"parent":9127232,"text":"Platform Engineers (Python backend) Junior to Seniors, to Lifesum - Stockholm, Sweden, Europe - Full-time &#x2F; No remote<p>Lifesum (formerly ShapeUp Club) is a Swedish digital health startup with the vision to make people healthier and happier by using applied psychology and technology. Founded in 2008 with headquarters in central Stockholm, the company is growing fast and was selected by Wired UK as one of Stockholm&#x27;s 10 hottest startups. To date, the Lifesum app has registered more than 7,3 million members, with 500,000 monthly active users and a growth rate of more than 10,000 new members per day. We have big ambitions and are growing fast. Lifesum is looking for a product driven engineer, even with little documented experience. Our small team is international and diverse, so we are welcoming everyone. Focus will be on handling large amount of data in multiple formats, not all normalized, work with services integration (REST, OAuth, analytics, payment) and finally with algorithms for graphs (social, content relationship, ...), search and statistics. Product-wise, you will be taking features from the idea stage to scalable production deployments. You will work on making highly scalable solutions, get feedback from analytics and monitoring tools and be able to refine and perfect your solution at each iteration Tech-wise, our server code is written in Python (Django) and you will be exposed to distributed computing (scalable stack, queue-driven distributed processing), cloud hosting (Amazon), database optimization (MySQL, Redis), search solutions (Sphinx, ElasticSearch), test driven development, load testing, etc You have some (professional or personal) experience with Django, Python (and bonus for Amazon Web Services and distributed systems) And you love building products and work for millions of users.<p>To read more go to:<p><a href=\"http://jobs.lifesum.com/jobs/427-platform-python-backend-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.lifesum.com&#x2F;jobs&#x2F;427-platform-python-backend-eng...</a> or<p><a href=\"http://jobs.lifesum.com/jobs/1103-senior-platform-backend-python-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.lifesum.com&#x2F;jobs&#x2F;1103-senior-platform-backend-py...</a> or<p><a href=\"http://jobs.lifesum.com/jobs/1711-test-automation-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.lifesum.com&#x2F;jobs&#x2F;1711-test-automation-engineer</a><p>--<p>I posted a couple of months ago and we got a really really good response from a lot of great people so I&#x27;m really excited to post again! My name is Martin and I work as a Platform Engineer at Lifesum myself. If you want to formally apply, please do so via the jobs page: <a href=\"http://jobs.lifesum.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.lifesum.com&#x2F;</a> I&#x27;m not the person hiring, but you will join my platform team, and with that in mind, feel free to contact me personally and ask me anything martin.lissmats@lifesum.com :) And if I&#x27;m slow to reply or miss to do so, call me out on it! Cheers, and thanks a lot to everyone that applied and contacted me with questions!","time":1425225528,"type":"comment"}