{"by":"augustflanagan","id":9127322,"parent":9127232,"text":"NerdWallet - San Francisco, CA - relocation and H1B ok (sorry, no remote)<p>NerdWallet is a fast growing startup dedicated to bringing transparency to the world of personal finance. Our mission is to empower millions of people by providing them with the research and data driven tools they need to make informed money decisions, both big and small throughout their lives.<p>Our engineering team is small (~20 engineers) and is growing fast. We&#x27;re hiring across the board - full stack, data, and platform engineers. Our core web platform is a traditional LAMP stack. Our data and various service APIs are written in Python&#x2F;Flask, and we&#x27;re pushing more and more code into this service layer everyday. We&#x27;re also starting to use Node.js to serve different parts of our website.<p>I joined the company recently after spending a lot of time getting to know different members of the engineering team. This is a very smart team that is poised for massive growth. There are a ton of challenges to be solved, and this is a team that is up to the task. The company as a whole has this same attitude and culture. Everyone is very friendly and collaborative.<p>We offer:\n- Competitive compensation package<p>- 100% paid premiums for medical, dental and vision for employee and their dependents<p>- 401(k) with company match<p>- Generous, flexible vacation<p>- Catered lunches daily, free dinner, and a kitchen stocked full of snacks<p>- In-office fitness classes<p>- Paid commuter benefits<p>- Friday happy hours<p>- Pet-friendly office<p>- Awesome monthly company outings<p>To learn more about NerdWallet or to apply for an open position visit our careers page  - <a href=\"http://www.nerdwallet.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nerdwallet.com&#x2F;careers</a><p>If you have any questions you want to run by an engineer feel free to contact me directly - aflanagan[at]nerdwallet.com","time":1425223362,"type":"comment"}