{"by":"ghouse","id":9127418,"parent":9127232,"text":"TuneFind - Remote - Approx 20 hrs&#x2F;week - Front End&#x2F;Back End Developer<p>We&#x27;re a four-person company with a music-related site that&#x27;s loved by tens of thousands of real people and visited millions of times a month. We&#x27;ve dominated our niche since 2005. When you see it, you&#x27;ll think: ah, that&#x27;s both cool and useful.<p>The site is built on PHP 5.6 &#x2F; Kohana, MySQL, and jQuery. 99% of the code was written in-house and is clean, modular, built on a sane schema, and is easy to develop with minimal external dependencies. It&#x27;s also really fast; we&#x27;re near the top of the New Relic leaderboard for our category and in the 90th percentile of site speed according to Google. We take pride in what we built, and we&#x27;re looking for someone who is proud of their work to continue what we&#x27;ve started.<p>We&#x27;re seeking a developer who can spend approximately 20 hours a week working on discrete, meaningful projects on the site. We have more of these projects than we can count, so consider this a long term project where you&#x27;ll have the chance to work on a wide variety of interesting stuff, based on your skills and interest.<p>Here are a few real example projects that are coming up:\n* Integrate some additional song providers alongside iTunes and Amazon using our song search job queue.\n* Create the concept of timestamping for our data, modifying a variety of model and view classes, as well as adding Bootstrap modal components and forms in our templates.\n* Add features to our REST API.\n* Create front-end features for admins and superusers using HTML and jQuery.\n* Make a real-time activity section on our front page based on activity data we keep in redis.\n* Add a redis caching layer on top of our models to reduce MySQL query volume.\n* Add artist @handles to our tweets.\n* Plus many more...<p>We manage projects using a private Github repository and task list. Our specifications are short and to the point. Your code will go live on the site as soon as it&#x27;s ready -- no long release cycles.<p>Critically, you don&#x27;t need design or sysadmin skill to work on this project. At all. We expect you to generate good HTML structure but if you never touch our CSS or fiddle with images, that&#x27;s fine by us. Same goes for setting up servers, patching PHP, etc. We&#x27;ve got that all covered.<p>The ideal candidate will be able to show us what they&#x27;ve done using the technologies listed above. Experience with Laraval (likely future framework) and&#x2F;or Kohana ideal, but not required. Honesty and strong communication skills are critical. Comfort with Github, pull requests, and the git toolchain generally is important -- we&#x27;ll ask for your Github username when we consider your application. We&#x27;ll give you all the support you need, but expect you to dive in and own large parts of our application.<p>Interested? Email amanda@tunefind.com","time":1425224657,"type":"comment"}