{"by":"shs","id":9127725,"kids":[9127793],"parent":9127232,"text":"HubSpot - Cambridge&#x2F;Boston, MA<p><a href=\"http://hubs.ly/y0zbwS0\" rel=\"nofollow\">http:&#x2F;&#x2F;hubs.ly&#x2F;y0zbwS0</a><p>HubSpot is a great place to work with a great culture of getting things done and delighting our customers.  HubSpot loves investing in Engineering as a way to build a world-class product.<p>On the front-end, we use technologies like CoffeeScript and React to create a wonderful experience for our users interacting with the system.<p>On the back-end, we use technologies like HBase, Kafka, MySQL, Elasticsearch, ZooKeeper, and Dropwizard.  If you haven&#x27;t looked at Dropwizard, it&#x27;s actually a really nice way to develop web services in Java: you can annotate paths like you would do in Python and Flask and just return a Java object that will be serialised into JSON for you by Jackson.<p>Engineering is organised into small teams (usually around 3 people) where you can have a big impact on the product.  We deploy hundreds of times per day and use GitHub Enterprise for SCM, Jenkins to build, and an internally developed open-source system built on top of Mesos called Singularity to deploy app instance containers.  Your changes won&#x27;t be languishing in git waiting for a major release.  Because deploys are so painless, we&#x27;re able to deploy small changes.<p>If Google&#x27;s catch-phrase is &quot;Don&#x27;t be evil&quot; ours is &quot;use good judgement&quot;.  Check out our Culture Code for more information: <a href=\"http://www.culturecode.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.culturecode.com</a>.  Also take a look at our 2014 Year in Review if you&#x27;re interested: <a href=\"http://hubs.ly/y0zbyd0\" rel=\"nofollow\">http:&#x2F;&#x2F;hubs.ly&#x2F;y0zbyd0</a>.<p>Work schedules are flexible, though most engineers get in around 10am.  You get to make a meaningful difference in a product with loads of paying customers and a ton of traffic. Best of all, you get to work with loads of smart and fun people. That&#x27;s the best thing about HubSpot: the people are great people that you can rely on, learn from, and have a great time getting things done with.","time":1425228297,"type":"comment"}