{"by":"whusterj","id":9127799,"kids":[9149516],"parent":9127232,"text":"Aspire (<a href=\"http://aspire.is\" rel=\"nofollow\">http:&#x2F;&#x2F;aspire.is</a>), Full-Stack Software Engineer (Python, Django, JavaScript, Postgres), Washington, DC, Full Time<p>Aspire is start-up helping companies provide awesome perks experiences to their employees through a simple online platform.<p>Aspire needs an experienced full-stack engineer to come work with us in our offices in downtown Washington, DC. We&#x27;re not going to measure your experience in years, we&#x27;re going to measure it in experience. The bottom line is: have you done it before?<p>We&#x27;re obsessed with creating an enjoyable, memorable, and above all highly personalized workplace perks experience for the users of our software. Our engineering team is challenged with building a digital layer around a fundamentally human service. Where the tech and services meet, the interaction must be exceptional.<p>Our software has to be fast, reliable, and beautiful. It has to &quot;just work&quot; across the wide range of personal and professional devices in use today.<p>Requirements and Experience:\n- You have worked full-stack on a live production system and perhaps built one from scratch.\n- You have worked with a distributed and highly available system and perhaps designed and built it yourself or with a team.\n- You don&#x27;t mind being involved in product design. In fact, you enjoy it.\n- You are comfortable in many programming languages and use the best one for the job at hand.\n- You&#x27;re familiar with ORMs: their strengths for prototyping and their limits on expression and performance.\n- You may not be familiar with the tools we use, but you are smart and capable enough to pick them up quickly and start building.<p>You&#x27;ll work hard at Aspire, but it&#x27;s critical that you take care of yourself. Aspire helps by providing:\n- Competitive Salary\n- Employee Stock Options\n- Insurance: Health, dental, and vision\n- Minimum paid vacation policy: You must take off at least 20 days (4 weeks) of work every year. Yes, you read that right!\n- Unlimited sick days: No sneezing at work. Take care of yourself and your coworkers.\n- Team adventures and perks galore! Delivered through our own software.\n- A Better Workplace: Casual, fun, and supportive work environment with all the tools and amenities you need to succeed.<p>More detail at <a href=\"http://aspire.is/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;aspire.is&#x2F;careers</a>","time":1425229291,"type":"comment"}