{"by":"tanto","id":9127730,"parent":9127232,"text":"<a href=\"https://berlinstartupjobs.com/engineering/full-stack-developer-log-os/\" rel=\"nofollow\">https:&#x2F;&#x2F;berlinstartupjobs.com&#x2F;engineering&#x2F;full-stack-develop...</a><p>Full-Stack Developer &#x2F;&#x2F; log.os<p>log.os is a social business, based in Berlin. Our purpose is making big (book) data a community asset and providing the best social reading experience ever. Period. You are an avid reader or sundry book aficionado. And you can’t help but writing. Unless it’s not stories you write, but code. Your ambition is to create something that stands out, that really makes a difference.<p>log.os is a social business, based in Berlin. Our purpose is making big (book) data a community asset and providing the best social reading experience ever. Period.<p>You are an avid reader or sundry book aficionado. And you can’t help but writing. Unless it’s not stories you write, but code. Your ambition is to create something that stands out, that really makes a difference.<p>As a full stack developer at log.os you will be in a small team of dedicated people to change the world of reading. You will be part of concept, design and development of the log.os frontend and backend applications and architecture. Closely working with other developers you will find the areas where your expertise can be utilised the most and take responsibility for that area.<p>You will work closely in a small team of developers building the basis for log.os from the ground up No legacy code and high involvement in the software architecture of all components The task ahead will be challenging but also offer you personal growth opportunities You will try to make the world better by going against the big guys Stock options<p>Sounds appealing? Get in touch!<p>eMail: work@logos.vision<p><a href=\"https://berlinstartupjobs.com/engineering/full-stack-developer-log-os/\" rel=\"nofollow\">https:&#x2F;&#x2F;berlinstartupjobs.com&#x2F;engineering&#x2F;full-stack-develop...</a>","time":1425228335,"type":"comment"}