{"by":"Suragm","id":9128954,"parent":9127232,"text":"The #1 startup to work for in NYC is looking to expand [1] and we just raised our Series B funding with Accel Partners [2]. You should join us!<p>Hi, we&#x27;re Grovo. We&#x27;re like a Khan Academy for digital and professional skills. Everyone from big corporations to K12 schools pay us to teach their employees skills from how to use Excel Pivot Tables to Google Drive powertips to how to beat procrastination.<p>It&#x27;s proven to be really valuable and we&#x27;re growing like crazy.<p>The engineering team is looking for Full-Stack, QA Engineers, and SREs to join our team of 14.<p>We use LAMP, Agile, AWS, etc. Our current big initiatives are setting up strong APIs, creating a data warehouse, and scaling to meet the demands of training hundreds of thousands of employees simultaneously.<p>Yes, we have perks. Yes, we have a strong engineering team. Yes, we give 10% time for side projects. Yes, we give competitive compensation and equity. But that&#x27;s not why we were named the #1 best place to work by NYC Tech.\nIt&#x27;s because of the people [3]. Everyone here is absolutely fantastic and we screen heavily for passionate, ambitious, playful people.<p>Interested in a Full Stack Engineer, QA Engineer, or SRE role? Then email me directly at suragm@grovo.com. Mention Hacker News in the subject line and you&#x27;ll get my immediate attention.<p><a href=\"http://grovo.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;grovo.com&#x2F;careers</a><p>======================================================================<p>PS To get a glimpse into some of the challenges facing our engineering team today and how we&#x27;re tackling them firsthand, check out our latest blog post: <a href=\"http://labs.grovo.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;labs.grovo.com&#x2F;</a><p>[1] We were named by NYC Tech as the #1 Best Place to Work: <a href=\"https://medium.com/@internetweek/its-the-people-how-grovo-became-the-best-place-to-work-fa95a2324910\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@internetweek&#x2F;its-the-people-how-grovo-be...</a><p>[2] Grovo Raises $15M More To Help Businesses Train Their Employees With Bite-Sized Videos<a href=\"http://techcrunch.com/2015/02/18/grovo-series-b/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;02&#x2F;18&#x2F;grovo-series-b&#x2F;</a><p>[3] Grovo&#x27;s amazing culture is centered around collaboration and fun, all while driving innovation and impact within our teams. See it in action here: <a href=\"https://www.youtube.com/watch?v=NuGVwJ9xicc&amp;noredirect=1\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=NuGVwJ9xicc&amp;noredirect=1</a>","time":1425245282,"type":"comment"}