{"by":"giaour","id":9128502,"parent":9127232,"text":"Business Insider - PHP Engineer - New York City (Flatiron)<p>Business Insider is looking for a highly-skilled PHP developer to join our world-class engineering team. You will help to conceive, design, build, and deliver the next-generation of online news&#x2F;media working with cutting edge technologies such as MongoDB, AWS, NodeJS, and Go. We are a dynamic company reaching the new generation of business leaders. We are a well-funded (including by Jeff Bezos) company at the forefront of digital media. You&#x27;ll be joining a close team that works hard and has fun.<p>We&#x27;re looking for solid PHP developers who have experience working with MVC systems and appreciate the agile methodology and continuous integration. We face exciting challenges every day due to the demands of our growing audience and the 24&#x2F;7 news cycle. Your work will reach millions of people—50+ million every month around the globe. Our product team pushes the boundary on feature development, resulting in a varied and interesting assortment of tech challenges to solve.<p>Position requirements include:\n    Skilled back-end programmer who can write lean object-oriented PHP 5 code\n    Broad understanding of web architecture and how it applies to scalability\n    Enjoys building user-focused interfaces, using Ajax when appropriate\n    Collaborating with product managers, editorial, and business partners to understand software requirements\n    Participating in architectural decisions\n    Troubleshooting and solving complex problems\n    Solid understanding of version control principles, preferably using Git\n    Strong communication skills<p>Bonus points for experience with:\n    Agile development\n    PHPUnit\n    Behat and&#x2F;or Cucumber\n    Symfony, Laravel, or Silex\n    AWS\n    MongoDB and Doctrine\n    Golang\n    JS&#x2F;CSS&#x2F;HTML<p>Send your resume directly to jeskew [at] businessinsider.com for prioritiy review.<p>The official job listing can be found at <a href=\"http://www.jobscore.com/jobs2/businessinsider/php-developer/cJkUTcPzyr5iz4iGalkWKP?ref=rss&amp;sid=68\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;businessinsider&#x2F;php-developer&#x2F;...</a>","time":1425238196,"type":"comment"}