{"by":"skant","id":9128420,"kids":[9128422,9128457,9128425],"parent":9127232,"text":"BlueStacks.com | San Jose, California | H1B Ok<p>About us:\nBlueStacks (<a href=\"http://www.bluestacks.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bluestacks.com</a>), a privately held, venture funded, Silicon Valley startup with a brand name enjoying global recognition.  You can play your favorite Android apps on your Windows PC, Mac or TV using the BlueStacks App Player. You can also bring your Android mobile experience to your home by linking your devices through our mobile apps. We are awestruck and feel humbled by the organic, grass roots adoption of our products worldwide, they have become a key driver for Android adoption since we started the company. It never ceases to amaze us when we meet people in everyday life, in every part of the world we have traveled to, who tell us, “Hey, I use BlueStacks every day! ”.<p>Our business is growing and we are looking for a few more smart people who can grow it and grow with it further. Ideally, you’ve got at least three years experience under your belt, are an agile individual who wants to work in a fast- paced environment, and an excellent portfolio of work to show for it.<p>email - careers at bluestacks dot com (Please mention  &quot;Hacker News&quot;)<p>Open Positions:<p><i>Front-end developer</i><p>• HTML.<p>• CSS&#x2F;CSS3&#x2F;CSS preprocessor Sass&#x2F;Less.<p>• Responsive&#x2F;adaptive design techniques.<p>• Object oriented JavaScript including jQuery.<p>• An ability to write well-structured, semantic, maintainable code.<p>• Experience building single page applications with technology such as<p>Backbone JS, Angular JS, Require JS.<p>• Excellent understanding of cross-browser and cross-platform issues.<p>• Ability to complete and juggle multiple projects whilst meeting strict<p>deadlines.<p>• SEO best practices.<p>• Experience with version control, GIT.<p>• Comfortable using the command line tools<p>• An understanding and practice of website optimization techniques.<p>• 3 years of industry experience.<p>======================================<p>continued...","time":1425236933,"type":"comment"}