{"by":"aj_icracked","id":9129688,"kids":[9141890],"parent":9127232,"text":"iCracked is looking for VP of Engineering to lead our Engineering team in creating the ultimate on-demand repair, insurance, and trade-in service. Initially, the VP of Engineering must have the ability to develop a relationship with a small team of highly talented engineers. This team represents a great core nucleus that our VPE should understand how to grow and push in a way to achieve great things. The VP of Engineering is responsible for delivering the company’s products on time and within spec. This role will report and work directly with me (CEO).<p>Our company is just over 100 strong with offices in San Francisco, Redwood City, London, and Berlin and the iCracked engineering team is currently 14 individuals and we are looking to grow that to ~35 in the next 12 months. Our system currently consists of our website, 3 sets of custom built business admin tools and 3 iOS apps (1 consumer and 2 enterprise). Our stack is powered by PHP, MySQL and Javascript (JQuery and AngularJS). We also have 5 people on our front end engineering team that are excellent (Check out iCracked.com)<p>We have a platform that powers thousands of iTechs that’s based on managing and optimizing, on demand workforce through a robust backend platform and network. You can think of it as an Uber-like service, but addressing an entirely different market need. The company is on fire.<p>Revenues have gone from $1.7M in 2012, to $&gt;17M in 2014 with massive growth estimated for 2015. We are #83 on the fastest growing INC 5000 companies globally. Backed by the preeminent Venture Capital firms in Silicon Valley and growing like crazy. Graduate of Y-Combinator (W12) Poised to dominate a massive global market with backend technology that can be applied to a variety of different markets in the future.<p>We&#x27;re building a complete Warranty, Repair, and Trade-In platform that should consolidate 3 multi-billion dollar a year industries under one consumer brand.<p>We have an incredibly talented and fun team put together and are excited to talk to new members that can add tremendous value while doing the best work of their lives. We&#x27;re a lean development team that moves fast. We push to production multiple times a day and continuously iterate on the core service. This is an exciting time to join if you truly want to be involved in developing the core product at a tech driven company.<p>What we’re looking for in you:<p>Responsibilities<p>Technical leadership – act as a check and balance system relative t o key architecture decisions and other key technical trade-offs.<p>Implement processes to deliver results – create and maintain deadline-driven processes that ensure high quality products, identify inefficiencies, create and deliver on goals.<p>Team leadership – clearly define individual roles and responsibilities, motivate and empower our engineers, generate engineering buy-in, manage progress as well as overall team happiness, dynamics and recruiting.\nExecution – work with engineering leads to plan to achieve product goals&#x2F;business priorities, set priorities and timelines, help allocate engineering resources.<p>Customers&#x2F;Users – engage and represent the company in a way that will establish credibility and confidence with our customers&#x2F;users.<p>Coaching – mentor engineering talent to build a rich team and foster collaboration, good habits, stable code, and creative problem solving skills<p>With iCracked, you wouldn’t be starting a new job; you would be joining a family. We take care of all team members and provide almost all amenities to make everybody’s lives better. Salary is negotiable and we have set aside great equity packages and other benefits for you. If you&#x27;re interested please connect with me at Aj[at]iCracked.com","time":1425257318,"type":"comment"}