{"by":"rolepoint","id":9129268,"parent":9127232,"text":"RolePoint | (mostly) Python Software Engineers | London, UK and New York, US - <a href=\"https://careers.rolepoint.com\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.rolepoint.com</a><p>You&#x27;ll play a key role in building a platform that&#x27;s changing how Technology, Finance, Media, Healthcare organisations hire and access talent - and that is already implemented in the three largest employers in the world.<p>==New York==<p>You will be a key figure in the New York engineering team; the primary function will be to build and manage the integrations between RolePoint&#x27;s applications and the systems that exist within our clients infrastructure (typically Applicant Tracking Systems and Candidate Relationship Management tools). RolePoint&#x27;s success is dependant on the reliability and features of our data integrations, so you&#x27;ll be integral to the team and involved in the management of the integration product.<p>From our New York office, you&#x27;ll be helping to shape the engineering team based in Soho where we currently have our Account Management department. They are a group of highly intelligent, experienced and passionate people who are also expanding. You&#x27;ll also be working closely with our London engineering team and RolePoint&#x27;s customers.<p>Bonus: Created APIs used by internal and external developers<p><a href=\"https://careers.rolepoint.com/#ahBzfnJvbGVwb2ludC1wcm9kchALEgNKb2IYgICA48mctQkM/WVrq7\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.rolepoint.com&#x2F;#ahBzfnJvbGVwb2ludC1wcm9kchALE...</a><p>==London==<p>You&#x27;ll be building the most advanced and user-friendly application flow that candidates go through when applying to jobs online.<p>Based in our London office, you&#x27;ll work alongside passionate, like minded individuals, where ideas and innovation take precedent and each team member contributes equally. You&#x27;ll be writing code and architecting solutions, all whilst maintaining balance between great design and shipping products.<p>Bonus: Functional programming, GAE<p><a href=\"https://careers.rolepoint.com/#ahBzfnJvbGVwb2ludC1wcm9kchALEgNKb2IYgICA8_WMlwkM/2tcE7\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.rolepoint.com&#x2F;#ahBzfnJvbGVwb2ludC1wcm9kchALE...</a><p>==RolePoint==<p>We&#x27;re building a company that allows you to work on interesting projects in a stimulating, social environment. We work on flexible hours, offer unlimited vacation days, go out for weekly team activities and once a year bring the whole company together on an international gathering to reconnect outside of our work.<p>Check out more roles at <a href=\"https://careers.rolepoint.com\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.rolepoint.com</a>","time":1425250261,"type":"comment"}