{"by":"dreur","id":9131237,"parent":9127232,"text":"Foko - Private Photo Sharing App - Full-time&#x2F;Permanent (on-site) - Ottawa, Gatineau, Hull - Canada<p>We are searching for Backend Dev position and a Marketing position.<p><a href=\"http://foko.co/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;foko.co&#x2F;careers.html</a><p>Since launching in June 2014 - Foko has users in 10% of the Fortune 100, and boast high profile clients like Whole Foods, Trend Micro, Maxim Integrated, and One Medical Group. Monthly active usage is over 45% - nearly 3X industry average for enterprise services. <a href=\"http://www.foko.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.foko.co</a><p>===============<p># Backend Node.js Developer<p>===============<p>Responsibilities:<p>•\tWork in a small backend team to build an innovative platform supporting both mobile and web applications that solve real business needs.<p>•\tWork closely with client team and product team to deliver world-class innovative products to interrupt business world, on time.<p>Desired Skills:<p>•\tSolid knowledge of Javascript<p>•\tStrong commitment to quality<p>•\tExperience with NodeJS<p>•\tCloud based systems (Amazon AWS, etc)<p>•\tExperience building and scaling a Rest API<p>•\tBeing awesome and wanting to be the best in what you do<p><a href=\"http://foko.co/careers.html#web\" rel=\"nofollow\">http:&#x2F;&#x2F;foko.co&#x2F;careers.html#web</a><p>============================<p># Digital Marketing Specialist<p>============================<p>We need someone with a talent for digital marketing. Someone that knows how to increase relevant leads through social media and SEO tactics. This person will use social platforms like Facebook, Twitter, Instagram and other to drive traffic and sign-ups to the service. The successful candidate will also be responsible for the social media interactions with our customers, fan and followers. The successful candidate will be passionate about strategy, communication and marketing.<p>Essential Duties and Responsibilities<p>•\tDevelop and implement a corporate marketing strategy and campaign for Foko.<p>•\tWork with the product and development team to understand product releases and develop the appropriate marketing campaigns.<p>•\tWork with customers to create internal marketing campaigns to promote Foko with their employees<p><a href=\"http://foko.co/careers.html#marketing\" rel=\"nofollow\">http:&#x2F;&#x2F;foko.co&#x2F;careers.html#marketing</a>","time":1425292932,"type":"comment"}