{"by":"vonnik","id":9134769,"parent":9127232,"text":"<a href=\"https://www.futureadvisor.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.futureadvisor.com</a> - <a href=\"http://nyti.ms/X3N7r2\" rel=\"nofollow\">http:&#x2F;&#x2F;nyti.ms&#x2F;X3N7r2</a><p>== Experienced infrastructure engineer, San Francisco ==<p>FutureAdvisor is an automated investment manager. We help our customers cut their investment fees, avoid excessive risks and save on taxes, so that they and their families will face better choices down the road.<p>We&#x27;re seeking an infrastructure engineer. Your job will be to keep FutureAdvisor running smoothly. It might be deploying and maintaining server clusters on EC2, building tools to automate our deployment pipelines or designing and implementing a new piece of the request pipeline. Your job will be to make FutureAdvisor as fast and reliable as possible. You&#x27;ll work on building out more tools to manage and track our server cluster using AWS technologies like EC2, S3, OpsWorks, and VPC.<p>Skills you&#x27;ll need:<p><pre><code>    Experience working with AWS\n    Experience provisioning and maintaining VPC instances on AWS\n    Knowledge of service oriented infrastructure\n    Knowledge of working with Linux and Bash scripts\n    Experience with infrastructure management tools like Chef or Puppet\n    Bonus Experience launching Ruby on Rails apps\n</code></pre>\n<a href=\"https://boards.greenhouse.io/futureadvisor/jobs/26313#.VPTiI2a-zTA\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;futureadvisor&#x2F;jobs&#x2F;26313#.VPTiI...</a><p>== Interactive designer, San Francisco ==<p>You&#x27;re seeking meaningful work solving problems in an organization that supports design. FutureAdvisor distills the complexity of finance into a simple interface so that our customers can understand and grow their life savings. We&#x27;re giving working- and middle-class households a powerful portfolio management tool that they never had access to, until now.<p>What we&#x27;re looking for:<p><pre><code>    Background in interactive design\n    Portfolio of web and&#x2F;or mobile apps\n    Empathetic and practical individuals\n</code></pre>\n<a href=\"https://boards.greenhouse.io/futureadvisor/jobs/26309#.VPTiRGa-zTA\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;futureadvisor&#x2F;jobs&#x2F;26309#.VPTiR...</a>","time":1425335058,"type":"comment"}