{"by":"dale-ssc","id":9136224,"parent":9127232,"text":"Socialserve.com -- Charlotte, NC, USA<p>We are seeking a top-notch senior systems administrator who is ready to help us with all our IT needs, everything from desktop support to server provisioning to helping plan our long-term IT strategy.<p>Socialserve.com is a technology-driven non-profit in Charlotte, NC providing hosted web applications for users and organizations all over the USA.  We use OS X on our desktops and Linux on our servers. We rely on and love to use open source software, including Python, Git, PostgreSQL, and Asterisk.<p>We&#x27;re looking for someone who:<p>* Is looking for a full-time, on-site staff position in Charlotte, NC<p>* Is a friendly person and a good communicator<p>* Excels at planning and independent problem solving<p>* Is willing to wear a number of hats in a small business<p>* Will take responsibility for IT projects big and small<p>* Loves to automate his&#x2F;her job and has the ability to do it, including mastery of shell scripting and at least intermediate experience with some other programming language(s)<p>* Has extensive experience with Linux administration including configuration, monitoring, troubleshooting, and maintenance<p>* Has a firm grasp of TCP&#x2F;IP networking<p>In return we offer you an easy-going, productive environment at a non-profit with a minimal amount of bureaucracy and friendly, interesting coworkers. You&#x27;ll have a lot of freedom to solve our problems your own way, which will give you plenty of opportunities to learn new technologies and expand your skills. We want to give you what you need to succeed and get out of your way.<p>If this sounds good to you, let&#x27;s talk! Please send your résumé to employment@socialserve.com, or read more at <a href=\"http://www.socialserve.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.socialserve.com&#x2F;jobs&#x2F;</a>.<p>This is an FTE position only.  Sorry, we will only consider candidates with a legal right to work in the United States who are able to work on-site in our office in Charlotte, NC, USA. No contractors, no recruiters, please.","time":1425359802,"type":"comment"}