{"by":"hughstephens","id":9148643,"parent":9127232,"text":"Dialogue Group (Project name TBC) | <a href=\"http://dialoguegroup.com.au\" rel=\"nofollow\">http:&#x2F;&#x2F;dialoguegroup.com.au</a> | Melbourne, Australia but REMOTE totally OK | UI&#x2F;UX designer | Salary negotiable – it&#x27;s a contract&#x2F;hourly role<p>We&#x27;re producing an awesome new app&#x2F;ecosystem in the tertiary healthcare (hospital) space. Think slack meets trello meets doctors.<p>It&#x27;s super-early days. We have ideas, we have some potential workflows, but a core part of this product&#x27;s success will be its interface and user experience. Doctors are one of the most time-poor audiences around, and so being able to pick up the iOS&#x2F;Android app + web interface quickly and easily will be the &#x27;make or break&#x27; in delivering our product.<p>I&#x27;m looking for someone who can help us with the UX&#x2F;UI on an advice basis, and provide design mockups for us to then do an MVP build on top of (are you an awesome dev? I&#x27;d prefer to build it cross-platform so if you have experience for stage 2 feel free to get in touch).<p>I&#x27;m a strong &#x27;ship it early, ship it quick&#x27; advocate, so if you&#x27;re someone who can take &#x27;mockups&#x27; from sketch to full HTML (or even better, Angular&#x2F;Ionic or similar in JavaScript) you will win all the dogepoints.<p>Remote job (but we&#x27;ll need to Skype here and there to chat and meet obviously...), happy to pay you on an hourly basis as a contractor, which is why I haven&#x27;t put a salary range up! I should say though that I&#x27;m not looking for a $500&#x2F;hr super insane skilled person, but also not a $20&#x2F;hr eLancer...mid-level I guess then. If you&#x27;re currently working somewhere awesome FT and just feel like helping someone else out (paid obviously) as a side project that&#x27;s okay too...<p>Anyway, get in touch. My email is hugh at dialoguegroup dot com dot au, and we can have a chat.","time":1425517896,"type":"comment"}