{"by":"hurdleress","id":9160018,"parent":9127232,"text":"Backend Developer @ ShareProgress <a href=\"http://shareprogress.org\" rel=\"nofollow\">http:&#x2F;&#x2F;shareprogress.org</a><p>At ShareProgress, our mission is to help progressive organizations achieve success through the use of data and technology. Innovations in these fields have made it possible to organize and campaign more effectively than ever before, but most groups don&#x27;t have the knowledge or ability to take advantage of these advances. We help organizations like Greenpeace, Sierra Club, CREDO, Compassion &amp; Choices, AFL harness these innovations for their work.<p>For us, progressive means more than just the political left. It describes any organization working to help and protect the less fortunate amongst us or to make life better for the population at large: improving our cities, protecting our environment, encouraging civic engagement, fighting for economic justice, and providing training and opportunities for those who haven&#x27;t traditionally had access to them. Our primary focus is on nonprofit organizations, but we consider any company with an inherent social good mission to be progressive as well.<p>This role is full-time. Preference for the position will be given to candidates in San Francisco, but REMOTE work (including from outside the US) is a possibility.<p>Your Job:<p>- Scoping out, developing, and validating new features for the ShareProgress web tools<p>- Researching and making recommendations on third-party tech services to use with the platform, when appropriate<p>- Keeping an eye on scalability for all new development with the ShareProgress codebase<p>- Coordinating with the larger ShareProgress team on projects related to platform development<p>Experience with:\n- Ruby on Rails<p>- Test-Driven Development using RSpec<p>- Developing scalable web applications (to handle hundreds of millions of records)<p>- PostgreSQL and Heroku<p>Benefits:\n- Health&#x2F;dental&#x2F;vision insurance<p>- Stock options<p>- Team outings around SF<p>To apply or learn more, send your résumé to jobs@shareprogress.org.","time":1425680934,"type":"comment"}