{"by":"OptiverAsiapac","id":9182300,"parent":9127232,"text":"Sydney, Australia | Local Applicants or Visa Holders<p>Trading Systems Engineer| Optiver AsiaPac<p>Optiver is a Global Trading firm focused on market-making. We take pride in our people and our technology.<p>Most of us come from an infrastructure background however, we have some great engineers who were once developers and decided to change into a more end-to-end role where they have more scope and breadth of responsibility. We manage the entire trading system from end-to-end - servers, networks, software deployments etc- and we ensure that they are performing at their peak. We are expert troubleshooters, natural problem solvers, love to do root cause analysis,  performance analysis and look for ways to continuously improve the performance of our trading systems.<p>Your tech-know-how would include:\n• Experience working as a Systems Administrator, Infrastructure Engineer or any technical role that requires complex troubleshooting and incident management\n• A solid understanding of Linux – whatever flavour you like\n• Experience with Networking will be pretty handy\n• If you can script using Python or have any software development experience, these will definitely help too<p>What you’re like\n• You’re awesome\n• Love to communicate and have excellent verbal, written and face-to-face comms\n• You dream about troubleshooting and root cause analysis and thrive on solving problems\n• Understand the importance of managing expectations – you don’t leave your stakeholders hanging\n• Easily liaise with both techies and non-techies\n• Love to learn and often find yourself trying to improve just about everything, all the time\n• You’re efficient and keep a cool head under fire<p>You don&#x27;t need to have had prior experience in trading to be successful in this role. We will support you and give you all the training, love, and guidance you need to be as successful as you can be.<p>If you experience any problems when trying to apply through our website, please email your resume and cover letter to careers@optiver.com.au or go to this link \n<a href=\"http://alescoprod.talent2payroll.com/pls/aparbtpp/WK8127$APP.FormInsert?P_VACANCY_REF_NO=168\" rel=\"nofollow\">http:&#x2F;&#x2F;alescoprod.talent2payroll.com&#x2F;pls&#x2F;aparbtpp&#x2F;WK8127$APP...</a>","time":1426042688,"type":"comment"}