{"by":"BrandonMTurner","id":3783874,"parent":3783657,"text":"Boston, MA (No remote) - Full Time - <a href=\"http://www.loseit.com\" rel=\"nofollow\">http://www.loseit.com</a><p>= About Lose It! =<p>Lose It! is a popular iPhone / Android / Website application that changes people's lives by helping them manage their weight.<p>8M+ iPhone Downloads (currently top 10 in Health category)<p>500k+ Android Downloads (very new, currently top 15 in Health category)<p>2M Website enabled users (connecting to our website is optional)<p>2M Uniques per month across all platforms<p>9M+ pounds of weight have been lost by website enabled users (Estimated ~18M pounds lost across all users)<p>8k messages betweens users that opted into social features per day<p>450M+ foods logged by website enabled users<p>Current Team - 1 CEO (technical), 1 Developer (me), 1 Business Dev, 1 Community Manager<p>Current Stack - GWT, MySQL, Java (server side and Android), AWS, Objective C (iPhone), Membase<p>Current Tools - Intellij, Git, Navicat, New Relic, CloudBees, Asana<p>= Who we are looking for =<p>Lose It! is looking for new members (we have more then one spot open) for our product team to help us build our next generation of products. We believe that small teams of well rounded people can do great things, so we're looking for someone that can contribute to all phases of building a great product. We believe that iterating on our products with customers is the best way to build something great, so we'd like someone who enjoys talking to customers and making them happy (and maybe even helping to change their lives).\nAs a software engineer at Lose It!, you'll be an early member of the team that is building the core product, the most complete and effective weight loss software spanning mobile devices and the web. You should have a passion for and a proven track record of building products that delight users.<p>= Who to contact =<p>{first name} at loseit.com - If you think you would be a good fit send me an email with anything (resume, cover letter, github account, maybe just a simple 'hello'. I'll read anything and everything you send).","time":1333293568,"type":"comment"}