{"by":"alexsolo","id":3784924,"parent":3783657,"text":"San Francisco, CA<p>PagerDuty - <a href=\"http://www.pagerduty.com\" rel=\"nofollow\">http://www.pagerduty.com</a><p>FULLTIME<p>* Front-end Developer (<a href=\"http://www.pagerduty.com/jobs/engineering/frontend-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/frontend-engineer</a>)<p>* Designer<p>What we do:<p>At PagerDuty, we're building an alerting and incident tracking system that helps IT operations groups detect and respond to high-severity issues.<p>We're not like the thousands of monitoring systems out on the market. In fact, we don't do monitoring at all. Instead, we plug into existing monitoring systems and handle the people part of the equation: alerting (via phone, SMS, email), on-call scheduling for teams, auto-escalation of critical alerts, and incident tracking.<p>Our current product helps IT ops people know about critical problems as quickly as possible, collaborate as a team to fix problems quickly, and help track and improve incident response performance over time. Our vision is to expand into the event management space. This means treating data from monitoring tools as events and intelligently filtering and correlating events across monitoring tools in order to reduce the noise. It's like spam filtering for events: a critical problem, such as a bad deploy, will automatically alert the entire team via phone call, while a minor issue like a server going down in a fleet of 20 will only generate a low-priority email alert.<p>Why you should work with us:<p>We are different than many startups out there: we charge money for a product. Companies like Intuit, National Instruments, VMWare, Square and 37signals love our product; that's a lot to say for a system that frequently wakes our users up in the middle of the night. We're also fairly early stage (13 people plus a few interns). This combination means you'll get a market-rate salary plus a decent chunk of stock in a company that has already figured out product/market fit.<p>We put a very big focus on the user experience (UI/UX), since some of our core concepts can initially be confusing to people who don't have a lot of experience in the operations and support realm. We want to guide people to use best practices whenever possible. Our customers span a gamut of sizes, from small start-ups just trying to monitor their websites to enterprise clients like Heroku who have to monitor thousands of servers and deal with complex infrastructural issues. As a result, our UIs have to scale and be intuitive with a wide range of data. Simply put, we're solving problems no one else has solved before, and we're doing so by designing clean, elegant, easy-to-use UIs.<p>To apply, please send your resume to jobs@pagerduty.com.","time":1333314741,"type":"comment"}