{"by":"diego","id":3784307,"parent":3783657,"text":"LinkedIn, Mountain View, CA. Local only.\nOur search back-end team is growing, and we are looking for an experienced manager for it. Job description pasted below.<p>Email dbasch AND iperisic at linkedin dot com<p>Responsibilities:<p>·       You will lead an innovative team of software developers to design, build and maintain our search infrastructure.\n·       You'll lead through uncertainty and collaborate with other engineering teams, Business Development, Legal, and teams across the organization to make things happen to achieve desired results.<p>Requirements:<p>·       Deep Software Technical Skills: You are deeply technical, understand how to break down problems and design extensible solutions. You have ample development experience in Java (preferably also C++ or other JVM-based languages such as Scala), as well as scripting languages. You know how to scale systems to a billion calls per day, how to parallelize requests, and how to build infrastructure and APIs for softwareservices. You have experience building large-scale information retrieval solutions, and understand search engines inside and out. You are intimately familiar with concepts such as garbage collection algorithms, parsing, lexing, building inverted indexes, ranking algorithms, etc. You have deep knowledge of the fundamental concepts discussed in books such as Modern Information Retrieval or Managing Gigabytes.\n·       You likely have a BS, MS or PhD in Computer Science or closely related field.<p>·       Management and Cross-Organizational Influence: You have demonstrated successful leadership in building and leading small, high-performance engineering teams. You understand the value of relationships and are highly effective at influencing cross-organizational teams to implement internal component APIs to meet the needs of external consumers. You communicate effectively to all levels inside the company and with partners.\n·       You're a very hands-on technical manager who can influence and lead the architecture, design and development of a scalable, high performance, and high reliability platform.","time":1333301034,"type":"comment"}