{"by":"hmark6","id":3784313,"parent":3783657,"text":"Canton, CT - Web Engineer<p>Build apps for NFL.com, NBA.com, NASCAR.com, NCAA.com, SI.com, USAToday.com,<p>Sports Technologies LLC is looking for a Web Engineer to join our team. You'll be a key contributor as we create new products and expand our current offerings. You'll be a good fit if you're passionate about web development, sports, media, and providing users with a great experience on the web.<p>What's in it for you:<p>* Top of the line equipment so you have the tools you need to get things done\n* A flexible and fun work environment\n* Work as part of a team of bright and passionate developers\n* Competitive base salary\n* Full benefits package that includes: medical, dental, paid vacation, 401k, flexible spending account\n* Annual bonus program\n* The opportunity to build experiences for sports fans across the web\n* Relocation package<p>Things we're looking for:<p>* 2+ years real-world experience in developing web applications\n* Experience working on at least one dynamic, user-centric web application\n* DB Experience (MySQL or similar), you should have the capabilities to write queries, create tables, etc.\n* Familiarity with version control systems\n* Ability to work in a fast-paced environment\n* Exceptional communication skills\n* A willingness &#38; eagerness to collaborate with a team\n* Entrepreneurial spirit\n* Linux/Unix skills, you won't need to do system administration, but you must be able to at least do basic tasks on the command-line\n* Solid Javascript skills, you'll need to know about things like: AJAX, JSON, &#38; JS Frameworks (jQuery, Prototype, etc.)\n* Understanding of modern web standards (html/xhtml, css, best practices, etc.)\n* Bachelor's degree or equivalent experience<p>Other \"nice-to-haves\":<p>* Experience with social components (Facebook/Twitter integration)\n* Experience working on an application targeted at mobile devices\n* Ruby on Rails experience is a big plus\n* To apply, please send an email to eric@sportstechinc.com with your resume, a brief note about yourself, and point us to something that you are proud to have worked on (a Github or similar account would be a great option).","time":1333301070,"type":"comment"}