{"by":"joebasirico","id":3784508,"parent":3783657,"text":"Boston, MA<p>Security Innovation is hiring two roles.<p>A Security Engineer and a Lead Security Manager. If you eat, sleep and breathe Software Security please apply! We've also setup a challenge website for you to test your skills on at: <a href=\"http://bit.ly/Hekjxe\" rel=\"nofollow\">http://bit.ly/Hekjxe</a> (email jobs@securityinnovation.com for hints if you get stuck).<p>Lead Security Manager<p>Our Lead Security Manager will be tasked with delivering security assessments and managing a team of security engineers to deliver security assessments for Security Innovation's wide array of clients; from web, embedded, desktop, mobile and cloud based applications. This person should have some management experience and deep technical, security experience. Their day to day tasks include helping to scope application security projects, delivering the projects, leading and growing a team of security engineers and helping the local sales and marketing resources with proper messaging and understanding. Additionally this person will be expected to lead projects and interface directly with our clients. This person should have at least 3-5 years of manual application penetration testing experience, deep security knowledge, and 1-2 years of development experience.<p>Security Engineer<p>At Security Innovation Security Engineers are tasked with delivering security assessments for our wide array of clients on an even wider array of technologies and platforms. This person should have deep technical and security knowledge. This person will be tasked with performing manual Penetration Tests, Code Reviews, creating Threat Models, Design Reviews and more. Beyond their technical skill this person should have strong written and spoken communication skills. Additionally, this person should have 1-3 years of manual application assessment experience, deep security experience, and development experience would be a plus.<p>About Security Innovation<p>Security Innovation helps our clients to reduce their overall risk by providing application security services, education and standards. We assess the security of a wide range of applications and technologies to ensure they properly protect their sensitive data. Security Innovation is headquartered in Boston and has a branch office in Seattle, WA. This is an immensely challenging and rewarding company to work for, we have built a tight knit team of security experts who are well regarded as leaders in the field. As a reward for being the best in the industry we provide our engineers with 10% of their time for research, hefty hardware and research budgets, retirement, compensation and insurance packages. Oh, and we have unlimited vacation too.<p>More info at:\n<a href=\"http://bit.ly/pisNHF\" rel=\"nofollow\">http://bit.ly/pisNHF</a>","time":1333305229,"type":"comment"}