{"by":"ChiperSoft","id":3784168,"parent":3783657,"text":"NFY Interactive is a San Diego based web development firm seeking qualified candidates in the Pacific time zone for a fulltime remote position. You would be a part of a fast-paced, highly skilled company with projects in web development, content management systems, PHP framework development, API construction/consumption, and mobile applications.<p>We are seeking candidates with at least 2 years of experience developing in the commercial arena. Qualified candidates must have a solid grasp of the following:<p>- HTML5 and CSS3 with progressive enhancement<p>- LAMP Application Stacks and the Linux command line<p>- Object Oriented PHP Programming within a structured framework<p>- Basic MySQL database design and query writing<p>- Ability to work quickly and efficiently remotely, communicating via email/IM/video chat<p>Beneficial but not required:<p>- Custom CMS Sites<p>- Javascript Enhancement using jQuery and/or Prototype.js<p>- REST APIs (Creation and Consumption)<p>- Web Application Product Cycles (from design to launch and post-launch maintenance)<p>- Mobile web development<p>- Billing systems and payment gateways<p>- SMS<p>- QR Codes<p>We are looking for full-time candidates which are ready to go to work and can fulfill job tasks which are available now.  This is a remote working position, so candidates must be capable of working from home and managing their own time.  Ideally we would like applicants from the San Diego area, but will accept resumes from anyone in the Pacific time zone.  If you are the right person for this job -- please send your resume/cv and examples (code, github or portfolio) to careers@netfinity.net, or apply on our website at <a href=\"http://netfinity.net/about/careers\" rel=\"nofollow\">http://netfinity.net/about/careers</a><p><i>Absolutely only United States - If you are an overseas development firm please do not contact us.</i><p>We also have an opening for a full-time iOS developer.","time":1333298628,"type":"comment"}