{"by":"callado4","id":3786041,"parent":3783657,"text":"New York, NY - User Experience Designer<p>DirectMarkets is looking for an innovative, creative and intelligent User Experience Designer to join our Product team. A User Experience Designer at DirectMarkets is responsible for creating intuitive, goal directed user experience for DirectMarkets users. The UX Designer will collaborate with the Product Manager, Developers, Stakeholders and Users to create experiences which deliver business value and drive the growth of the business. The key deliverables will be designing wireframes and producing style guides to ensure consistency across the platform.<p>Qualifications:<p>The ideal candidate has:<p>* Minimum or 3-5 years creating user experiences for web-based products.\n* Experience with enterprise products and/or trading systems is a plus.\n* Bachelor's Degree or higher in Human Computer Interaction or similar program.\n* Experience and passion for working in an Agile environment (specifically SCRUM).\n* Excellent verbal and written communication skills.\n* Highly collaborative and innovative.\n* Solid understanding of technology and how software systems are built.\n* Ability to learn new industries and businesses quickly.\n* Experience in visual design is a plus.<p>DirectMarkets' groundbreaking platform is the next evolutionary step in connecting the C-Suite of existing public companies directly with the capital markets. This is accomplished by electronically linking existing public companies with purchasers of securities. The DirectMarkets platform empowers issuers to efficiently sell primary shares directly into the secondary market, providing investors a new source of supply and liquidity, and the ability to accumulate stock positions in a cost-effective manner. Additionally, the DirectMarkets platform enables investors to initiate transactions directly with issuers, redefining the capital-raising paradigm. The result is greater transparency and substantially reduced time and costs associated with capital origination for existing public companies.<p>Apply by email chartel@directmkts.com<p>Website: <a href=\"http://www.directmkts.com\" rel=\"nofollow\">http://www.directmkts.com</a>","time":1333334940,"type":"comment"}