{"by":"benjesson","id":3787419,"parent":3783657,"text":"REMOTE: Conversion Rate Optimization (CRO) Consultant<p>About Us...<p>Conversion Rate Experts (CRE) scientifically optimizes websites to make them more profitable, by making them more effective at converting visitors into customers. CRE's clients include Apple, Google, Sony, BT, Vodafone, SEO Book, and SEOmoz. Double-digit improvements are the norm.<p>Nine great reasons to join us...<p>* Work anywhere you choose. We are looking for the very best people, so we won’t be restricted by geographic location.<p>* Learn to be one of the world’s best conversion rate experts. We’ll reveal every secret we’ve ever discovered about growing web businesses.<p>* Industry-leading compensation—with even greater incentives when you “deliver the goods”.<p>* Prestigious clients: Lead projects for some of our great clients, like Apple, Google, Sony, Vodafone, SEOmoz and many exciting less-well-known businesses.<p>* Great colleagues. Our goal is to build and grow the world’s number one team of conversion rate experts. We also work with many of the world’s most respected marketers. So you’ll be in exciting and stimulating company.<p>* Join our private mastermind group. You’ll have access to our mastermind group in which we discuss the latest techniques we’ve developed, and the results they’ve generated.<p>* Opportunities to develop. You’ll be encouraged (and expected) to develop yourself. You’ll have freedom to utilize the latest technology, and to access the most advanced training programs. And you’ll have the budget to work with the best vendors in the world.<p>* Avoid all the nasty and boring stuff. You’ll only be required to work on the important stuff: helping our clients to grow their businesses. We’ll take care of all the admin, paperwork, negotiating, invoicing and marketing, which leaves you free to concentrate on the activities that make you money (getting results!)<p>* Entrepreneurial, but without risk. You will receive a combination of guaranteed payment plus performance-based bonuses. You’ll receive regular training designed to optimize your performance, your time and your income.<p>To learn more (or to apply online), please visit...<p>* <a href=\"http://www.conversion-rate-experts.com/careers/\" rel=\"nofollow\">http://www.conversion-rate-experts.com/careers/</a><p>Cheers,<p>Ben","time":1333364073,"type":"comment"}