{"by":"lhsgo","id":3795006,"parent":3783657,"text":"Data Analyst at Well Known Major Online Video Service -- Los Angeles\nWe are looking for a Data Analyst Engineer to join our Financial Planning &#38; Analysis (FP&#38;A) team. Primary responsibilities will include generating raw data reports and digging deep into data, analyzing trends on subscriber behavior, preparing reports for management, and collaborating with multiple teams to provide insightful analysis to senior management. While some pieces will be routine, many projects will be ad hoc. Due to the “undefined” nature of the work, the successful candidate will have the aptitude to tackle multiple projects, problem-solve, and efficiently execute deliverables. Competitive salary and full benefits offered.\nResponsibilities may include: •\tCollaborating with different business units to define and build insightful reports •\tOngoing report generation and analysis of key business metrics •\tDigging deep into data files, analyzing and calculating internal traffic metrics • Assisting with the preparation of weekly and monthly metrics reports for the executive team and other departments •\tWorking closely with the marketing team to analyze 3rd party promotions and marketing efficiency •\tAssisting with the creation of presentations to support board meetings and other ad hoc strategic initiatives •\tParticipating, owning, and driving various ad hoc projects<p>Qualifications: •\t2 – 3 years of experience working with large data systems •\tThe ideal candidate will have at least 1-2 years of experience in the online video space or least have a strong understanding of current consumer trends and marketing tactics in the space •\tExpertise with at least one major database system (MS SQL Server, MySQL, Oracle) •\tStrong knowledge of database development, administration and reporting •\tStrong SQL/TSQL development skills •\tBachelor's degree with a major or emphasis in Accounting, Finance, Economics, or Computer Science is required •\tExceptional analytical abilities and strong MS Excel skills •\tExperience in a roll-up-your-sleeves environment is a plus •\tIndependent, energetic, highly technical, and capable of driving for results under pressure and ambiguity<p>EMAIL resume and brief cover letter to: onlinevideodataanalyst@gmail.com","time":1333490327,"type":"comment"}