{"by":"ruckusred","id":3802898,"parent":3783657,"text":"MoviePass is hiring for Customer Support (interns or full-time), as well as a Full Stack Lead Developer/Architect (permanent).\nWe're located in NYC, but finding the right person is more important than their location.\nSend an email to kristina@moviepass.com with contact info and any relevant information you'd like to share.<p>Customer Support Agent<p>What You Can Expect:\nWe have a dynamic, laid back office with other funded startups. We believe the more fun and freedom an individual has, the more they create and contribute, and our office shows this. You'll also get to be a part of the early stages of a young company, knowing that you are helping provide what could be the best customer experience ever :)<p>What We Expect:\nYou LOVE talking to people, and and you're creative with ways to delight them. You can easily handle a phone call, 3 chats, and a barrage of emails, all while boxing up t-shirts to send out and compiling our daily reports. You have a tremendous drive to succeed, and you like discussing creative ideas on how to do that. You're eager to learn about the startup world, and you've had entrepreneurial ideas of your own. You plan on staying with us for awhile, because you love seeing projects through to the end. You have phenomenal communication skills, written and verbal, and you tackle problems head on.<p>Full Stack Lead Developer / Architect<p>background includes...\n5+ years experience with RoR with demonstrable experience using best practices. For example:\n'separation of concerns', 'skinny controllers / fat models', 'progressive enhancement'\ntesting frameworks - preferably RSpec/Cucumber/Web as well as Continuous Integration (both setup and use).  Should be part of your daily workflow.\nAbility to plan and develop a coherent system across various platforms - desktop, mobile, mobile apps\nExternal API's - producing/consuming XML-based data feeds\nGit - should be comfortable with not only basic usage - but more advanced features as well - push/pull branches, gitflow, etc.\nHTML5 &#38; CSS3 - best practices and graceful degradation\nJavascript.  Should be very comfortable with Javascript/JQuery/Ajax\nExperience with payment gateways and e-commerce solutions.\nExperience creating mobile sites\nConfident inheriting legacy code that needs improvement.\nAuthoritative Dev Leader, with the ability to collaborate across departments\nMust have excellent communication skills - both verbal and written, able to articulate ideas.\nAbility to break a job into smaller tasks and accurately estimate time to complete overall project<p>…a plus:\nExperience deploying / managing apps on EngineYard\niOS or Android Develop experience","time":1333638987,"type":"comment"}