{"by":"Clear-Capital","id":3823391,"parent":3783657,"text":"Roseville, CA Full Time<p>Clear Capital offers a rare mix of fast growth, undying devotion to technical innovation and stability (10 years old, $120MM company). Your exceptional programming skills will be used daily to create web applications that literally run our company. When it comes to new tech, if we don't use it, we want to. We write all of our own code and we actively seek out new technologies and languages that can help us continue to grow and become more efficient. We are currently hiring:<p>Applications Developer: We are looking for a developer who understands the benefits of object oriented development, takes pride in their work, knows java, C# and .NET and is hungry to learn and contribute. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=135\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Applications Development Manager: Our next manager will have no problem jumping in to code using java, ColdFusion, jQuery, AJAX or javascript when needed without missing a beat. Our manager will also understand how to keep the team productive when the jobs are coming in fast and will have learned the trade from a successful career in app dev management. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=134\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Front End Developer: Help develop web UIs that integrate our back end components using HTML, CSS, jQuery and JavaScript. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=136\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Graphic Designer: Do you live and breath clean design? Do you appreciate what your design can do to drive a B2B business forward? Strong business focused web design portfolio required. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=84\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a>","time":1334079561,"type":"comment"}