{"by":"tokugawa88","id":11406374,"parent":11405239,"text":"HERE Capture Software Team | Berkeley | ONSITE | Full Stack Developer (Full-time)<p>Imagine a future where an autonomous vehicle can detect a rockslide or traffic accident on the road ahead and update the navigation data of surrounding vehicles in real-time. HERE is working on both the technological challenges underpinning that future, and international standards and specifications required to allow that to happen between all vehicles, regardless of their make. HERE is in a unique position to bring this vision into being, integrating the rapid advances coming out of the Internet of Things, distributed processing technologies and sensor-rich autonomous vehicle development.<p>A little about HERE:\nHERE collects, sustains and serves up mapping and navigational data with a global reach. Recently acquired by BMW, Audi and Mercedes for ~2.8 billion USD, HERE&#x27;s focus on the future of autonomous vehicles is set to intensify.<p>Positions on my team:\nFull-stack engineer (More back-end focused than front-end)\n<a href=\"http:&#x2F;&#x2F;rolp.co&#x2F;5WFW9\" rel=\"nofollow\">http:&#x2F;&#x2F;rolp.co&#x2F;5WFW9</a><p>About my team:\nWe are the Capture Systems Software team. We build the software running on our data collection systems across the globe; receiving the transmissions and messaging from those systems into our cloud-based services; and the web interfaces used across the company for monitoring and tracking the fleet and it&#x27;s collection. Currently I&#x27;m building out mapping interfaces to track where our sensors are and what they are detecting, in real-time.<p>Other members of the team are:\n-Building out the Android applications used by drivers in our full sensor rigs,\n-Architecting AWS-based cloud services for receiving, processing, storing and serving the high volume of messages coming out of HERE sensors,\n-Improving and stream-lining the robotics software that runs on sensor hardware itself, and\n-Standardizing the deployment processes for all of these projects, running in very different environments.<p>If you can contribute to any of those functional roles, reach out! Positions for DevOps, Android development and more back-end focused roles are opening up shortly, so contact me if you want to know about those once they are released.","time":1459529706,"type":"comment"}