{"by":"johnrball","id":11407067,"parent":11405239,"text":"Olo - Software Engineer, Infrastructure Automation Engineering - New York - Full Time OR Remote within the USA<p>At Olo we run an online food ordering platform used by many of the country’s largest restaurant chains, reaching millions of consumers. Olo is revolutionizing the customer experience at these restaurant chains, and we&#x27;re looking for talented engineers to join our team and help us achieve our vision.\nAs part of the Engineering team you will play a significant and visible role in helping us scale one of the most advanced food ordering platforms in the market. Your penchant for automating tasks enables you to remove friction from our Development and QA teams. You understand that Getting Things Done extends to the whole team as you look for ways to improve everyone’s efficiency. You follow the latest trends in Continuous Integration, Continuous Deployment, and Infrastructure as Code and enjoy introducing new practices and tools that improve everyone’s daily worklife.\nYou&#x27;ll work with a smart, passionate team dedicated to delivering amazing products using modern tools and technologies such as AWS, .NET 4.6, ASP.NET MVC 5, TeamCity, GitHub, Octopus Deploy, Xamarin, and heavy use of OSS.<p>Responsibilities\nAutomate each stage of the build-test-deploy cycle. Ensure that the Development environments run smoothly.\nManage continuous deployment of new builds to Development. Oversee our change control, configuration and release management processes.\nOversee and optimize of our continuous integration system.<p>Requirements\nYou have a passion for computing that extends beyond work. You have worked at a senior technical level as a developer or devops engineer. Your development experience enables you to build the tools that will make a .NET developer’s life easier, with a strong working knowledge of C#, .NET and SQL. Your have solid experience with Amazon Web Services infrastructure administration (EC2, S3, VPC, RDS, IAM, SQS, Route53) through the AWS CLI or SDK. You are driven to automate any manual process and adept at one or more scripting languages (e.g. PowerShell, bash, Perl, Python). You have overseen software builds and deployment on a .NET platform for at least one year. You have a strong working knowledge of source control systems (Git highly desirable), continuous integration platforms (such as TeamCity), and continuous deployment platforms, especially in support of deploying hosted, SaaS applications. You have a strong working knowledge of networking, Windows Server, Linux (CentOS and Ubuntu) and SQL Server administration.<p>Please feel free to contact me directly at johnball@olo.com","time":1459534019,"type":"comment"}