{"by":"snewman","id":11406081,"parent":11405239,"text":"Scalyr | SF Mid-Peninsula (ONSITE)<p>DevOps Evangelist: $130-180K, &gt;=0.5% equity<p>Online Marketing Manager: &gt;=$100K, &gt;=0.2% equity<p>At Scalyr, we&#x27;ve built a log analysis and ops visibility tool that our users rave about, because it smashes expectations for performance and ease of use. Now it&#x27;s time to spread the word. We offer the equity, influence, and fun of an early-stage company, with stability, great pay, and a low-stress culture. We have great backers, strong traction, and an 11-digit target market. I&#x27;ve built half a dozen startups, including Writely (aka Google Docs), and I can honestly say this is my favorite so far.<p>DevOps Evangelist: if you&#x27;re passionate about enlightened server operations, appreciate good tools, and would like the chance to bring a great tool to great customers, we should talk. We&#x27;ve had success with meaty posts like <a href=\"https:&#x2F;&#x2F;www.scalyr.com&#x2F;community&#x2F;guides&#x2F;zen-and-the-art-of-s..\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scalyr.com&#x2F;community&#x2F;guides&#x2F;zen-and-the-art-of-s...</a>. and <a href=\"http:&#x2F;&#x2F;blog.scalyr.com&#x2F;2014&#x2F;08&#x2F;99-99-uptime-9-5-schedule&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.scalyr.com&#x2F;2014&#x2F;08&#x2F;99-99-uptime-9-5-schedule&#x2F;</a>. Join us and you&#x27;ll have the chance to write meaningful articles, engage with fellow engineers, and spread the word on a great product. If you have an engineering background, experience in operations, and a love of communicating, drop me a line!<p>Online Marketing Manager: a hands-on, execution-focused opportunity to put your SEO, SEM, email, and analytical abilities to great use.  You&#x27;ll work on growing inbound traffic through both organic and paid channels.  That means oversight of our SEO (from content marketing and distribution to keyword analysis, link building, and more), our paid campaigns (Facebook, Twitter, Adwords, etc.), and our email drip campaigns.  You should be equally comfortable both building and analyzing your work and not afraid to experiment and iterate.<p>If either of these roles sound good - drop me a line!  steve@scalyr.com","time":1459528036,"type":"comment"}