{"by":"layble","id":11405442,"parent":11405239,"text":"Narrative IO | Software Engineer &#x2F; Employee #2 | NYC | Full-time | On Site<p>The following job is for employee number two at an obviously very early stage startup.  Please reach out to me (founder) directly.  I&#x27;m happy to answer questions and go a little deeper than makes sense in a job post.  My last two companies, where I was on the management team but not a founder, have had successful exits.<p>Nick\nnick (at) narrative.io<p>---<p>At Narrative we believe that data are incredibly valuable assets for modern businesses.  Unfortunately not every business have the data they need.  Conversely many companies have large data sets that they are aren&#x27;t getting the full potential value out of.  To help solve this problem, Narrative is building an unstructured data marketplace that will enable the efficient discovery, pricing, transaction, and delivery of data between companies. We are looking for people to join us to achieve this goal.<p>This is the first full-time hire at the company and the role would be employee #2 after the founder.  As such this person needs to to be willing to walk into a situation with a lot of big challenges as well as uncountable unknowns.<p>An early version of our backend infrastructure is already in production, but we&#x27;re looking to quickly expand the feature set while maintaining a highly reliable and scalable platform.\nWhere are we today?<p>Today&#x27;s data collection platform is built on top of Amazon Web Services.  All backend code is written in Scala using open source technologies like Jetty, Apache Thrift, Kafka, and ZooKeeper.<p>What is next?<p>While we think this is a good start there are already some pressing architectural needs that need to be addressed to make the platform truly scalable.  These include the design and implementation of our next generation core infrastructure, migration of data from our legacy systems,  and building out our data analytics framework.  We&#x27;re also actively on boarding new customers who will have a variety of new data types and requirements on how they will be traded.","time":1459524203,"type":"comment"}