{"by":"backstage","id":11405762,"parent":11405239,"text":"Backstage is hiring for a Data Warehousing Engineer in NYC (Brooklyn, New York, NY, for those of you using find-on-page to skip through the list here).<p>What does that mean? You are going to be our sole data warehouse&#x2F;BI engineer, designing and building a data warehouse and ETL process to answer the specific types of questions our business team has.<p>For the right person, this position is an amazing opportunity to own a data warehouse operation entirely from start to finish.  For the wrong person, this is being thrown in the deep end without a life jacket.<p>The number one, very special skill we&#x27;re looking for here is a talent for getting to the heart of and asking the question the stakeholder is <i>really</i> trying to work out, rather than answering the one they&#x27;ve thought to ask.  You won&#x27;t be insulated by a layer of business analysts.  You&#x27;ll be working directly with our operations, marketing, and accounting people to get them the data they need.  They&#x27;re smart people who are highly capable of working with numbers, but they don&#x27;t necessarily understand databases or all the ways they can use data to get the answers they need.<p>Of course, you&#x27;ll also need strong enough programming chops and sufficient understanding of dimensional modeling and data pipelines (in a Linux ecosystem, and ideally AWS) to design and implement from scratch an OLAP database and the ETL processing to populate it.<p>You&#x27;ll be expected to work independently and manage your own work.  We&#x27;re a very small engineering team, and each member is almost entirely self-managing -- we can&#x27;t afford a lot of process overhead, let alone micromanagement. You&#x27;ll have a team of intelligent, deeply technical engineers to talk things through with, but no one else on the team will be working directly on the same projects, and none of us have a deep background in the technologies and processes you&#x27;re implementing.<p>It&#x27;s not a requirement, but the ideal candidate would also be comfortable with enough web development to be able to jump into our front-end (JS w&#x2F; Backbone and React) and back-end (Python&#x2F;Django) codebases to add and adjust event tracking code as needed without having to wait for the web team.  If you can contribute to building, maintaining, optimizing, and automating our development processes, that&#x27;d be another awesome bonus.<p>Oh, right, we need some buzzwords... try these: data warehousing, business intelligence, analytics, OLAP, ETL, dimensional modeling, SQL, SQL, SQL, DBA, Python, R, Pandas, MySQL, PostreSQL, Elasticsearch, Redshift, AWS, RDS, Linux, Ubuntu, bash, DevOps, Sysadmin, Bamboo, Ansible, Fabric, CI.<p>Who&#x27;s Backstage?  We&#x27;re the leading platform in creative talent placement. We are currently composed of two brands: Backstage.com, for actors; and Sonicbids.com, for musicians -- with plans to launch a third vertical by the end of 2016.  At under 70 people, we&#x27;re a small business with the casual energy, collaborative mindset, and get-things-done attitude of a startup, but the stability and mature decision making of a more established company.<p>We offer benefits including health insurance (vision and dental available), commuter benefits, 401K, unlimited vacation, summer Fridays, and tickets&#x2F;tuition for select conferences&#x2F;courses. Our DUMBO office is spacious and convenient to 3 subway lines, and we offer snacks and a couple days per week work-from-home.<p>Apply at: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;backstage&#x2F;d5228dde-c2cd-4c43-b8cf-eba64dcf6d7e\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;backstage&#x2F;d5228dde-c2cd-4c43-b8cf-eba6...</a><p>By the way, if this sounds like an awesome place to work, we&#x27;re also hiring an experienced iOS engineer in Brooklyn and a senior front-end engineer in Boston! <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;backstage\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;backstage</a>","time":1459526205,"type":"comment"}