{"by":"jameincke","id":11405342,"parent":11405239,"text":"New York, NY | CloserIQ (<a href=\"https:&#x2F;&#x2F;closeriq.com\" rel=\"nofollow\">https:&#x2F;&#x2F;closeriq.com</a>)<p>CloserIQ is the network connecting top sales talent to venture backed tech startups. We are a NYC based self-funded and highly profitable recruiting tech startup combining powerful software with world class service.<p>We&#x27;re currently hiring for 4 roles:<p>Talent Advisor: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;jYihA&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;jYihA&#x2F;8bd29</a> (ONSITE)<p>Our Talent Advisors attract, engage and onboard top sales talent to the rapidly growing CloserIQ network. You’ll be joining a small team of sales leaders, technologists, recruiters, and growth hackers as a “sports agent” for the top revenue generators in the tech community. Looking for candidates with interest in sales and recruiting.<p>Talent Development Analyst: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;j2VXg&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;j2VXg&#x2F;8bd29</a> (ONSITE)<p>This role is a hybrid sales &amp; marketing where you will be responsible for generating demand for CloserIQ by leveraging digital sales &amp; marketing strategies. You&#x27;ll have a chance to work directly with our founders, wear multiple hats and have a meaningful impact on the success of the company from day one.<p>Sales and Marketing Intern: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;j8h2w&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;j8h2w&#x2F;8bd29</a> (ONSITE)<p>We&#x27;re looking for smart and tech savvy interns to help out as we grow the business. We&#x27;re a team of 6 based in midtown east. You&#x27;ll work with our founders, talent team and engineers on all aspects of the business and have a meaningful impact on the success of the company.<p>Freelance Writer: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;jl7MKQ&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;jl7MKQ&#x2F;8bd29</a> (REMOTE)<p>CloserIQ is looking for a freelance writer to help us create and curate relevant content as we build out our content strategy. The focus of this work will be within the scope of sales and careers, along with some viral content.","time":1459523471,"type":"comment"}