{"by":"johnrball","id":11407096,"parent":11405239,"text":"Engineering Manager Engineering - New York, NY - Full Time<p>At Olo we develop an online food ordering platform used by many of the country’s largest restaurant chains, reaching millions of consumers. We take pride in a neat codebase with automated tests and continuous integration, and encourage new ideas, experimentation, and constant refactoring.<p>Olo is revolutionizing the customer experience at these restaurant chains, and we&#x27;re looking for a talented engineering manager to join our team and help us achieve this vision. As part of the team you will play a significant and visible role in helping us deliver an industry-leading digital ordering capability to our clients. You’ll work with a passionate team dedicated to delivering amazing products using modern tools and technologies such as .NET 4.6, ASP.NET MVC 5, TeamCity, GitHub, Octopus Deploy, Redis, Xamarin, and heavy use of OSS.<p>You will manage one of Olo’s software engineering teams. Your primary responsibility is to ensure that your team is able to effectively deliver new product value at a steady pace. You will be responsible for hiring talented engineers and providing the needed coaching and guidance to ensure that they excel and grow. You will be a key facilitator in Agile planning, supporting business priorities and advocating engineering priorities. You will oversee a team consisting of both developers and QA engineers and will be responsible for the full software lifecycle of Agile planning through deployment.<p>This is a full-time position based in NYC.\nRequirements * You have demonstrated mastery of C#, .NET, web application and object-oriented concepts in a development leadership role. * You know good code when you see it. * You understand the value of QA as a fundamental component of producing enterprise-grade commercial software. * You have at least 3 years on-the-job experience managing development teams. * You are comfortable translating business needs into workable plans, and translating business-speak to geek-speak (and vice versa). * You can articulate what it takes to build reliable, robust software systems. * You enjoy the role of coach and facilitator, and are confident in your ability to build and mentor a high performance team. * You have experience developing software iteratively under an Agile process framework. * Experience developing a multi-tenant SaaS platform<p>Please email your resume to johnball@olo.com","time":1459534196,"type":"comment"}