{"by":"grayfox","id":11405751,"parent":11405239,"text":"Compose (IBM) | REMOTE (US, UK, CA)<p>If you are looking to join a forward-thinking industry with a stable outlook (databases-as-a-service), we have a tremendous challenge for you and a terrific team willing and able to support you through it. Compose hosts production grade MongoDB, PostgreSQL, Redis, RabbitMQ, etcd, RethinkDB and more to come.<p>The Compose family has grown into a vibrant group where folks can feel comfortable being themselves, living a balanced life. We welcome you to enjoy comfort when taking risks, collaborate with spirited peers, and to unleash your creative personality.\nSome great things about Compose:<p>* Work from anywhere! (As long as you&#x27;re legally able to work in the United States, Canada, or the United Kingdom).<p>* Many neat conundrums to solve.<p>* Self-managing, distributed decision making. Choose your projects. We&#x27;re deadline averse and quality focused.<p>* Ruby&#x2F;Go.<p>* Fantastic salary and benefits - MacBook Pro.<p>* Join a thriving and respectful international team.<p>* Fizz: <a href=\"https:&#x2F;&#x2F;www.compose.io&#x2F;articles&#x2F;the-tool-we-built-to-help-us-work-remotely&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.compose.io&#x2F;articles&#x2F;the-tool-we-built-to-help-us...</a><p>* Fair and objective &#x27;blind-hiring&#x27;.<p>Our hiring process is nifty. We request a work-sample upfront that closely resembles the work you&#x27;d be doing within your role.<p>Once you submit, your answers are anonymized then graded by 3 different people following pre-defined criteria.\nWe want to know, objectively, who is going to both enjoy and crush the work. We have several positions open for candidates:<p>* Now hiring Team Anchors: If you have deep knowledge within MongoDB, Elasticsearch, RethinkDB, or RabbitMQ, we would like you to be the nucleus of one of our DB teams. We want you to help ensure our individual DB offerings stay excellent.<p>For the full postings checkout <a href=\"https:&#x2F;&#x2F;compose.io&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;compose.io&#x2F;jobs</a> or email jobs+hn@compose.io if you&#x27;d like to have a chat with us to see what we&#x27;re all about.","time":1459526116,"type":"comment"}