{"by":"apbp","id":11405253,"parent":11405239,"text":"Transcriptic | Full Time | ONSITE (Menlo Park, CA) | www.transcriptic.com<p>All job listings: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring</a><p>Transcriptic is setting new standards for basic research by making life science discoveries cheaper, faster, and more accessible than anyone thought possible. We enable scientists to run experiments on our automated work cells via our web application from anywhere in the world. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic&#x27;s central, highly automated &#x27;biocenter&#x27; in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We&#x27;re building a long-term company to completely change the way life science research and development is done.<p>We&#x27;re a rapidly growing startup, now 30-something people, well funded ($15M) and have customers at places like Harvard, MIT, Caltech, UCSF, and Stanford. You&#x27;d be able to work on interesting science and hard technology in a small, all technical team with lots of freedom and resources.<p>We&#x27;re looking for talented engineers and bioengineers to join our team. You&#x27;ll have competitive salary and benefits, subsidized commuting, free caffeine and food, and great teammates.<p>Recent coverage: <a href=\"http:&#x2F;&#x2F;learn.transcriptic.com&#x2F;press&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;learn.transcriptic.com&#x2F;press&#x2F;</a>\nAll job listings: <a href=\"https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transcriptic.com&#x2F;hiring</a>\nhiring at transcriptic.com","time":1459522916,"type":"comment"}