{"by":"tyre","id":11405562,"parent":11405239,"text":"Seneca Systems | Redwood City, CA | Full Time<p>Seneca Systems is the company behind Romulus, a constituent system-of-record and service request management platform for local governments. Think Salesforce + Zendesk for cities.<p>Our mission is to elevate democracy at the local level by building software that solves the everyday, unsexy little problems of public servants.<p>We don&#x27;t care what TechCrunch or ProductHunt think of our work. We&#x27;re solving problems we don&#x27;t want our kids to have.<p>## What we need<p>- Product marketing&#x2F;go to market strategist:  Your goal is to do what Salesforce did for enterprise and Square did for SMBs: bring transformative technology to markets others were too scared to touch.<p><a href=\"http:&#x2F;&#x2F;seneca.systems&#x2F;careers&#x2F;growth&#x2F;go-to-market-strategist-product-marketer\" rel=\"nofollow\">http:&#x2F;&#x2F;seneca.systems&#x2F;careers&#x2F;growth&#x2F;go-to-market-strategist...</a><p>- Government Technology Advisor:<p>Giving outstanding Romulus demos to state and local government teams.<p>Performing outbound and inbound sales activities including prospecting, follow-up, and closing. Building strong relationships with hundreds of government representatives and staff members. Turning successful sales into referrals.<p><a href=\"http:&#x2F;&#x2F;seneca.systems&#x2F;careers&#x2F;sales&#x2F;government-technology-advisor\" rel=\"nofollow\">http:&#x2F;&#x2F;seneca.systems&#x2F;careers&#x2F;sales&#x2F;government-technology-ad...</a><p>- Postgres Database Engineer:<p>From GIS to high-performance search, we have a few dozen customers in large cities (e.g. Chicago, Detroit, Miami) and tens of millions of records. As we move to serve America&#x27;s 330 million constituents, coupled with the unique security and auditing requirements of government software, infrastructure cannot be an after-thought.<p>We push everything (triggers, constraints, source-of-truth) as far down the stack as possible. We love Postgres and so should you.<p>Email: chris@seneca.systems","time":1459524857,"type":"comment"}