{"by":"kronion","id":11408464,"kids":[11408544],"parent":11405239,"text":"Predata | NYC | Full-Time | ONSITE | <a href=\"http:&#x2F;&#x2F;www.predata.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.predata.com&#x2F;</a> | jobs@predata.com | $75K-130K + up to 1% equity<p>Predata builds tools for understanding political risk around the world. Our platform allows strategic decision makers across the federal, financial, and corporate sectors to collect and analyze open-source metadata signals (digital conversations, web traffic) and process them to understand how they relate to real-world geopolitical events.<p>Our leadership team has has successfully exited several ventures, and our CEO was previously National Intelligence Officer for East Asia intelligence at the CIA and Assistant Secretary of Defense for Asia at the Pentagon.<p>Our engineers often participate in client meetings and bring insights back to the codebase. We value people who are lifelong learners, think originally, and are interested in real-world problems. Finance experience is a plus.<p>Stack:\n  - Python, numpy, scipy, pandas, scikit-learn, statsmodels\n  - Django, Flask\n  - CoffeeScript, Mithril.js, D3\n  - PostgreSQL, HDF5, Redis, bcolz, ElasticSearch\n  - RabbitMQ, Selenium, PhantomJS\n  - Docker, AWS\n  - We&#x27;re pragmatic about using the right tool&#x2F;language for the task at hand<p><i>Full Stack Engineer</i><p>Help design and build new infrastructure and products. You&#x27;ll be involved in everything from designing data structures to scaling architecture to assessing user experience. You care about security, testing, and deployment automation.<p><i>Data Engineer</i><p>Work with data that has an impact on the real world. You&#x27;ll help us ingest, store, process, and query large data sets — this includes building ontologies, designing data pipelines, and transforming data to make it more useful.<p><i>Frontend Engineer</i><p>Work on complex visualizations that allow an analyst to go from high-level overviews to deep-diving explorations. You&#x27;ve built complex frontend applications, are passionate about information design, and know how to squeeze performance out of layout engines.","time":1459543491,"type":"comment"}