{"by":"perrylaj","id":11408304,"parent":11405239,"text":"Inductive Automation | Folsom, CA (Sacramento area) | Full-Time | Software Engineer &#x2F; Senior Software Engineer<p>Onsite ( 2 days of remote work&#x2F;week optional )<p>inductiveautomation.com<p>We&#x27;re a medium sized growing software company with an Industrial Automation platform currently used in nearly every industry imaginable.<p>Our Software Engineering team needs to grow.  To quote a listing on our careers page (<a href=\"https:&#x2F;&#x2F;inductiveautomatio.com&#x2F;about&#x2F;careers&#x2F;senior-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;inductiveautomatio.com&#x2F;about&#x2F;careers&#x2F;senior-software...</a>): &quot;We are currently starting a major new project that will require both Java and front-end web programming skills. If you dream of working with a hands-on, tight-knit group of developers working every day to delight customers worldwide with a product they actually need, we look forward to talking to you.&quot;<p>Our core server-side platform is Java based, with Python&#x2F;Jython, Scala, JS and others.  Our platform is large and flexibile, providing many areas&#x2F;fields of development to work in.<p>We use the tools that we want, everyone&#x27;s input is valued, good ideas are pursued.  We work fairly independently, so its a job that fits self-starters.  The right person probably has some Java SE experience, is knowledgeable about web application development, networking, and has some experience working on front-end with modern JS.  That said, I&#x27;d encourage anyone to inquire if they have a decent foundation in software engineering and are able&#x2F;willing to learn quickly.<p>I&#x27;m a member of the dev team posting this outside of our normal HR pipeline.  Feel free to post&#x2F;get in touch with me with any technical questions.<p>We have openings for a number of other non-development roles as well.<p>Careers page: <a href=\"https:&#x2F;&#x2F;inductiveautomation.com&#x2F;about&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;inductiveautomation.com&#x2F;about&#x2F;careers&#x2F;</a>","time":1459542493,"type":"comment"}