{"by":"cerebralchow","id":11407898,"parent":11405239,"text":"HEAT Software | Scottsdale, AZ and others | Full Time - Onsite<p>HEAT Software is leading the unification of Cloud Service Management and Unified Endpoint Management (UEM). We empower IT, HR, Facilities, Customer Service and other enterprise functions to simplify and automate their business processes to improve service quality, while managing and securing endpoints to proactively detect and protect against threats to business continuity.<p>Specifically I work within the endpoint protection groups and the positions below are ones that I&#x27;m personally familiar with and on the team. \nOpen Positions in Scottsdale:\n- Senior Software Engineer (8+ years): <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3I6oUhwS\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3I6oUhwS</a>\n- Software Engineer II (4+ years): <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3JcoUhwZ\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3JcoUhwZ</a><p>Both positions will be working within our group that develops our SCCM plugin (Microsoft System Center), and working on automation that helps expand our HEATSoftware patch content used in SCCM and our partners. Good working knowledge how operating system update processes work for Windows or Linux is a benefit, but not required. Ability to work against 3rd party web services to mine data is a plus as well. More detail is in the job descriptions themselves.<p>Technical Skills Needed:\n.NET, C#, JavaScript, ASP.NET, C++, SQL Server, MS IIS, CSS2&#x2F;CSS3 and HTML&#x2F;HTML5\nExperience with any of the following Unix&#x2F;Linux&#x2F;MacOS, in a development or personal capacity.<p>Feel free to apply using the links above for the teams I work within, or look at the other listings directly at <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3wboUhwL\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3wboUhwL</a> for Milpitas, CA | Colorado Springs, CO | Filderstadt, Germany | Galway, Ireland","time":1459539582,"type":"comment"}