{"by":"WillEngler","id":11413596,"parent":11405239,"text":"Urban Center for Computation and Data | Chicago | Systems Engineer | ONSITE | Full Time<p>About us: We are a research group at the University of Chicago and Argonne National Laboratory that develops tools to better understand cities. <a href=\"http:&#x2F;&#x2F;www.urbanccd.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.urbanccd.org&#x2F;</a><p>The project: The Array of Things (<a href=\"http:&#x2F;&#x2F;arrayofthings.us\" rel=\"nofollow\">http:&#x2F;&#x2F;arrayofthings.us</a>) is an urban sensing project involving the installation of at least 500 multi-sensor devices in the City of Chicago. The project relies on an open source platform, Waggle (<a href=\"http:&#x2F;&#x2F;wa8.gl\" rel=\"nofollow\">http:&#x2F;&#x2F;wa8.gl</a>), developed by Argonne National Laboratory.<p>Your role: As we deploy Array of Things (AoT) nodes, we need to ensure that the data we are collecting will be available to the public in the form most useful to them. For scientists, we need to develop APIs that enable analytics workflows. For developers, we need to minimize latency to allow near-real-time applications. For policy analysts without advanced data munging skills, we need to present interfaces that make the data easy to discover and use.<p>Technologies: You&#x27;ll mostly be programming in Python. (The AoT storage system - <a href=\"https:&#x2F;&#x2F;github.com&#x2F;waggle-sensor&#x2F;beehive-server\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;waggle-sensor&#x2F;beehive-server</a> - and our open data hub - <a href=\"https:&#x2F;&#x2F;github.com&#x2F;UrbanCCD-UChicago&#x2F;plenario\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;UrbanCCD-UChicago&#x2F;plenario</a> are both written in Python.) For storage we use Cassandra and PostgreSQL + PostGIS.<p>Location: We require you to be onsite most days, but we&#x27;re flexible about which of our sites you want to work at: Downtown Chicago, University of Chicago campus, or Argonne National Laboratory.\nPerks: Everything we do is open source. Great university benefits.<p>Official job description: <a href=\"http:&#x2F;&#x2F;jobopportunities.uchicago.edu&#x2F;applicants&#x2F;Central?quickFind=230037\" rel=\"nofollow\">http:&#x2F;&#x2F;jobopportunities.uchicago.edu&#x2F;applicants&#x2F;Central?quic...</a><p>Email me (willengler@uchicago.edu) or apply through the University of Chicago job listing.","time":1459633103,"type":"comment"}