{"by":"chucknb","id":11424566,"parent":11405239,"text":"NationBuilder - Los Angeles, CA &amp; Remote - Full Time - Web Designer, Senior Database Engineer, Software Engineer, Senior Software Engineer<p>NationBuilder creates software for leaders of all kinds - political candidates, nonprofit organizations, anyone building a community of people to make something happen in the world. If you&#x27;re passionate about your personal growth and learning, and would rather be better than right, you should strongly consider working at NationBuilder. Check out what we build: <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;mission</a><p>Web Design (Los Angeles): Join our Design team! Your focus will be maintaining the NationBuilder brand, crafting delightful web experiences to help tell the NationBuilder story, and taking a central role in the evolution of design at the company. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;designer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;designer</a><p>Software Engineer (Los Angeles&#x2F;2-3 years professional experience): As a developer you’ll help us architect, build and maintain our main codebase as well as ancillary services.  We value the willingness to learn our technologies and environment over domain-specific skills. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;software_engineer</a><p>Senior Software Engineer (Los Angeles&#x2F;Remote&#x2F;3-5 years professional experience): As a senior developer you’ll help us architect, build and maintain our main codebase as well as ancillary services. You’ll recommend and implement system-wide improvements, new technologies, and contribute to our technological direction. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_software_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_software_engineer</a><p>Senior Database Engineer (Los Angeles&#x2F;Remote&#x2F;3-5 years professional experience): Come join our LA team to take ownership of our database systems, with a strong focus on our core PostgreSQL databases, and take our databases to a new level of scalability and performance. <a href=\"http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_database_engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;nationbuilder.com&#x2F;senior_database_engineer</a><p>Our tech stack is primarily Ruby on Rails along with some Ruby and Golang services utilizing PostgreSQL and MongoDB. Managed by Puppet.","time":1459797545,"type":"comment"}