{"by":"clured","id":11423135,"parent":11405239,"text":"Full-Stack Engineer &#x2F; Data Scientist | The Open Syllabus Project (<a href=\"http:&#x2F;&#x2F;explorer.opensyllabusproject.org\" rel=\"nofollow\">http:&#x2F;&#x2F;explorer.opensyllabusproject.org</a>) | NYC &#x2F; SF | Full-time | NYC or Remote<p>The Open Syllabus Project is an academic data-mining project at Columbia and Stanford that’s extracting structured information from a corpus of 1M+ college course syllabi. What’s actually being taught in college classrooms? How has this changed over time? What can we learn about the organization of the modern university from large-scale trends in the texts that are being assigned? How can insights from these data be applied to curriculum development, education policy, and lifelong learning?<p>We launched a beta version of the platform with an op-ed in the New York Times in January, and since then the project has appeared in The Washington Post, Time, The Chronicle of Higher Education, MarketWatch, Der Spiegel, Business Insider, Lifehacker, FiveThirtyEight, WNYC, QZ, and elsewhere. It&#x27;s also been picked up by major news outlets in Europe, Russia, China, Japan, South Korea, Ukraine, Egypt, and Mexico.<p>We&#x27;re looking for someone who has experience with large-scale data analysis, natural language processing, web archiving, and web application development to help us grow OSP into a comprehensive, feature-rich authority about teaching trends in higher education. Some of the things we&#x27;re going to be working on in the coming months:<p>* Build a scalable infrastructure for crawling university websites for syllabi, with the goal of growing the corpus to 4-5M documents in the next 6 months.<p>* Expand the universe of books and articles that we search for in syllabi by identifying new bibliographic databases (Citeseer, arXiv) and integrating them into OSP’s data extraction pipeline.<p>* Write classifiers to improve the accuracy of the citation and metadata extraction jobs.<p>* Expand the public-facing web application to surface new types of information – visualize change in assignment trends over time, add profile pages for authors and publishers, and build richer ways to explore the citation graph.<p>* Help develop a research program around the data. We’re interested in applications to information science, literary studies, education policy, history of science, and canon &#x2F; university studies.<p>If these kinds of projects sound interesting, we&#x27;d love to hear from you! We use Python for the data extraction rig and the public-facing website (Flask), Elasticsearch for citation extraction, React+Redux on the front end, and Ansible to manage infrastructure on AWS. Beyond specific technologies, though – first and foremost we&#x27;re looking for a collaborator and partner who can help us build on what we have and push the project in new directions.<p>Drop us a line at syllabusopen@gmail.com.<p>Links:<p>* <a href=\"http:&#x2F;&#x2F;www.nytimes.com&#x2F;2016&#x2F;01&#x2F;24&#x2F;opinion&#x2F;sunday&#x2F;what-a-million-syllabuses-can-teach-us.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2016&#x2F;01&#x2F;24&#x2F;opinion&#x2F;sunday&#x2F;what-a-mill...</a><p>* <a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;wonk&#x2F;wp&#x2F;2016&#x2F;02&#x2F;03&#x2F;what-ivy-league-students-are-reading-that-you-arent&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;wonk&#x2F;wp&#x2F;2016&#x2F;02&#x2F;03&#x2F;what-...</a><p>* <a href=\"http:&#x2F;&#x2F;time.com&#x2F;4234719&#x2F;college-textbooks-female-writers\" rel=\"nofollow\">http:&#x2F;&#x2F;time.com&#x2F;4234719&#x2F;college-textbooks-female-writers</a><p>* <a href=\"http:&#x2F;&#x2F;www.spiegel.de&#x2F;unispiegel&#x2F;studium&#x2F;aristoteles-bis-marx-diese-zehn-buecher-muessen-studenten-in-harvard-lesen-a-1074279.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spiegel.de&#x2F;unispiegel&#x2F;studium&#x2F;aristoteles-bis-mar...</a><p>* <a href=\"http:&#x2F;&#x2F;www.businessinsider.com&#x2F;the-most-popular-required-reading-at-the-top-10-us-colleges-2016-1\" rel=\"nofollow\">http:&#x2F;&#x2F;www.businessinsider.com&#x2F;the-most-popular-required-rea...</a><p>* <a href=\"http:&#x2F;&#x2F;lifehacker.com&#x2F;open-syllabus-project-shows-the-books-students-are-assi-1758765225\" rel=\"nofollow\">http:&#x2F;&#x2F;lifehacker.com&#x2F;open-syllabus-project-shows-the-books-...</a><p>* <a href=\"http:&#x2F;&#x2F;fivethirtyeight.com&#x2F;features&#x2F;to-kill-a-mockingbird-author-harper-lee-dies\" rel=\"nofollow\">http:&#x2F;&#x2F;fivethirtyeight.com&#x2F;features&#x2F;to-kill-a-mockingbird-au...</a>","time":1459787246,"type":"comment"}