{"by":"papaver","id":11449636,"parent":11405239,"text":"Talenthouse | Fullstacker | West Hollywood, CA (REMOTE or ONSITE) | Fulltime | $120k<p><a href=\"https:&#x2F;&#x2F;www.talenthouse.com&#x2F;collaborate&#x2F;all\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talenthouse.com&#x2F;collaborate&#x2F;all</a><p>Seeking a senior engineer capable of jiving well with a tiny and nimble team. We take pride in the code we write and take care of our posse.  The main office is in West Hollywood but most of the tech team works remotely.  Slack, Hangouts, Trello, GitHub, and Hackpad help keep the team communications current, emails are rare between the engineering team.  We believe in transparency which leads to a culture of trust, which in turn leads to a lot more flexibility than most other companies.<p>Our development tower consists of play&#x2F;slick&#x2F;postgres&#x2F;redis&#x2F;react&#x2F;angular glued together using scala&#x2F;html&#x2F;javascript&#x2F;less.  It&#x27;s not necessary you know any of the tech or languages, though definitely helpful.  An eagerness to learn new technology and having strong problem solving skills mixed with a little tenacity and grit will take you a long way.<p>Our platform enables artist all over the world to receive exposure through marketing channels they may have never dreamed possible.  We work with both brands and popular artists to bring creative briefs to our community.  Several artists have experienced life changing opportunities through our work.<p>I&#x27;ve been working at Talenthouse for just a little over a year.  Having worked at a dozen companies before this and as a freelancer, its my favorite so far.  The team I get to work with is top notch.  Individual needs are met all the while still delivering the required technology to push the company another step forward.  I picked up the technology on the way and can say its been an amazing experience working with scala, definitely my favorite language now (out of the 13 others I’ve used in production over the last decade).<p>Give us a ping at jobs@talenthouse.com to open up a conversion, mention the hacker news post.  Cheers.","time":1460055268,"type":"comment"}