{"by":"voto","id":12406481,"kids":[12408397],"parent":12405698,"text":"VOTO - REMOTE<p>VOTO is about tackling tough development challenges through basic mobile technology: we’re helping amplify the voices of 3 billion people not yet on the internet, making sure their feedback reaches the organizations that serve them, and connecting them to the daily information they need. We build technology and expertise to do mobile surveys, messaging campaigns and hotlines through the basic mobile phone channels most able to engage hard-to-reach audiences.<p>We are looking for:<p>(1) Director of Product Design: You will lead the design of user workflow and user experience across the web application. You will provide expert input to the engineering team on new feature designs, and also manage the product feature roadmap. Ideally, you will be strong in front-end engineering, so they can get hands-on in directly prototyping new features, working within the engineering team, and avoiding a design-to-engineering translation layer.\nMore info: <a href=\"https:&#x2F;&#x2F;www.votomobile.org&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.votomobile.org&#x2F;careers&#x2F;</a><p>(2) Front End Engineer: You will be responsible for building client-side functionality of the VOTO web application.  You will work on rich, Javascript-intensive user interfaces, including VOTO’s “Trees” –  a powerful in-browser visual programming tool that empowers our partners to “draw” virtually any kind of mobile engagement with end-users they can imagine. You will be empowered to cover a range of roles from requirements analysis to UI design to implementation in code.\nMore info: <a href=\"https:&#x2F;&#x2F;www.votomobile.org&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.votomobile.org&#x2F;careers&#x2F;</a><p>Candidates should be open to significant global travel to ensure they can attend a thorough in-person orientation, and routinely build in-person relationships with their team.","time":1472746307,"type":"comment"}