{"by":"theuri","id":12408305,"parent":12405698,"text":"John Hancock Digital | iOS Developer (Swift). Principal Engineer&#x2F;Team Lead (Ruby&#x2F;Rails). Full-Stack Dev (Ruby&#x2F;Rails). Office Manager | SF | <a href=\"http:&#x2F;&#x2F;www.johnhancockdigital.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.johnhancockdigital.com</a><p>NOTE: We are also hiring for full-stack Rails developers and an office manager (no descriptions below - please contact us at hello@johnhancockdigital.com)<p>iOS DEVELOPER (Swift)<p>We are seeking an iOS Engineer who will own our core mobile app experience. You will ideally have experience in Swift or be a fast learner interested in building expertise.<p>You will be responsible for actively contributing to, testing and maintaining an innovative mobile experience that can change the lives of millions of families. We’re looking for someone with a proven track record of delivering very user-friendly, well-engineered and tested software, coordinating well with API teams, who thrives in a fast moving startup and environment.<p>You will be responsible for developing, testing and maintaining critical application features that seamlessly engage users and drive better financial behavior.<p>PRINCIPAL ENGINEER &#x2F; TEAM LEAD (Ruby&#x2F;Rails)<p>We are seek an experienced engineer who has a passion and desire to continue as a senior engineering contributor while managing and mentoring a small team of engineers.<p>At John Hancock Digital, we value leadership by example, flat management structures, peer reviews and moving quickly. This position first and foremost involves serving as a lead engineering contributor, and secondly serving as a manager and mentor to other engineers. As such, we expect our Principal Engineer &amp; Team Lead to aim for an 80&#x2F;20 balance between engineering contributions and management responsibilities.<p>We seek a team player with an engaging positive attitude and a startup mentality of being able to juggle multiple demands, focus on what needs to get done, and ability to foster a productive, optimistic attitude across the team.<p>As part of your role, you will also be an active leader in continuing to recruit a world-class development team, and should have a proven track record of managing software development teams to deliver well-engineered and tested software at scale.<p>ABOUT JOHN HANCOCK DIGITAL\nWe serve as an independent digital innovation startup within John Hancock, focused on scaling our technology to improve the financial lives of millions of customers in the US and globally. We are an agile, fast-moving startup team based in San Francisco, that leverages the brand, support and resources of John Hancock and its Manulife parent company to ship products that positively impact the lives of customers around the world.<p>Our mission is to use technology (machine learning and applied behavioral finance) to enable millions of middle-class households to increase their savings rates, make better financial decisions and achieve retirement security.<p>To start a conversation - drop us an email at hello@johnhancockdigital.com with a brief note about yourself and a resume.<p>Read more here: <a href=\"https:&#x2F;&#x2F;www.johnhancockdigital.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.johnhancockdigital.com</a>","time":1472759361,"type":"comment"}