{"by":"alexthornton","id":12407993,"kids":[12415890,12410764],"parent":12405698,"text":"Locus Energy: <a href=\"http:&#x2F;&#x2F;careers.locusenergy.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.locusenergy.com&#x2F;</a><p>San Francisco, CA; New Delhi, India. Remotes, interns and those needing visas are encouraged to apply.<p>About us: We’re dedicated to the proliferation of sustainable energy solutions. To that end, we build tools and services to monitor, analyze and manage the performance of tens of thousands of solar power systems. We’re a mature startup with a close-knit team that is greater than the sum of its parts. Our organization provides some structure while still leaving plenty of opportunities to make your mark. We’re not perfect but constantly improving. We value folks who offer a new perspective and play nicely with others.<p>About you: You’re passionate about sustainable energy and want to play a part of pushing our society in that direction. Nothing would excite you more than wedding your engineering prowess with your dreams of clean, green energy. You are thoughtful, curious and ask questions when you don’t understand. You take ownership of your responsibilities and see them through to the end.<p>Perks:<p>- Relaxed work atmosphere. Flexible working hours and work from home policies.<p>- Conveniently office locations accessible from public transportation.<p>- Health insurance, 401k, and all the other benefits of a real, stable company.<p>- Lunch provided once a week, with a smorgasbord of snacks available all the time.<p>Open roles:<p>- Senior Software Engineer in New Delhi, India. We&#x27;re growing our business into India and are hiring a local software team to go with it. You&#x27;ll be part of our core engineering team and will help provide an Indian perspective. Only locals to New Delhia, please. <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;locusenergy&#x2F;jobs&#x2F;273120#.V8h645MrIo8\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;locusenergy&#x2F;jobs&#x2F;273120#.V8h645...</a><p>- Sys Admin &#x2F; DevOps Engineer. Help make our infrastructure delicious. <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;locusenergy&#x2F;jobs&#x2F;262398#.V8h6-5MrIo8\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;locusenergy&#x2F;jobs&#x2F;262398#.V8h6-5...</a><p>- Technical Support Associate. Entry-level position that offers a great path to other parts of the company as you grow. <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;locusenergy&#x2F;jobs&#x2F;247528#.V8h7tZMrIo8\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;locusenergy&#x2F;jobs&#x2F;247528#.V8h7tZ...</a>","time":1472756713,"type":"comment"}