{"by":"kmerritt","id":12407866,"parent":12405698,"text":"Socrata | Seattle | Onsite | Full-time<p>Seattle-based Socrata is helping improve the workings of government - and therefore society - by helping governments become data-driven. Our cloud-based big data platform helps government information workers find, use and analyze their data internally for improved operational efficiency; and helps agencies publish their data externally (open data) for transparency, economic development, and third party service delivery (e.g. apps like Citymapper depend on open data).<p>We have about 20 open positions. Perhaps most interesting to the HN audience we&#x27;re looking for a Principal (Distinguished) Engineer &#x2F; Architect and a DevOps&#x2F;Site Reliability Engineer, Product Designer, Senior Product Manager, Product Marketers.<p>See the full list of open positions here: <a href=\"https:&#x2F;&#x2F;careers.socrata.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.socrata.com&#x2F;jobs&#x2F;</a><p>Read about our culture, values, benefits here: <a href=\"https:&#x2F;&#x2F;careers.socrata.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.socrata.com&#x2F;</a><p>Socrata has about 160 employees, has raised $54M in venture capital and has more than 1,000 of the most innovative government agencies as customers. Learn how our customers use our platform here: <a href=\"https:&#x2F;&#x2F;socrata.com&#x2F;customer-stories&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;socrata.com&#x2F;customer-stories&#x2F;</a><p>Government is going through a huge transformation. They&#x27;re shifting from analog to digital. Go become a public servant directly, or if you&#x27;d rather help government indirectly by working for a fast-paced company that is 100% focused on the government, come join us at Socrata!<p><a href=\"https:&#x2F;&#x2F;socrata.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;socrata.com&#x2F;</a>\n<a href=\"http:&#x2F;&#x2F;www.opendatanetwork.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.opendatanetwork.com&#x2F;</a>","time":1472755751,"type":"comment"}