{"by":"makmanalp","id":12406194,"kids":[12407067],"parent":12405698,"text":"Center for Intl Development at Harvard | Product Manager, Data Visualization&#x2F;Frontend Engineer | FULLTIME ONSITE Cambridge, MA (near Boston)<p>The Growth Lab (at the Center for International Development) is a research team that works to solve the issues of poverty in developing countries and focuses on the question, “Why do some countries grow while others don’t?” We are building a team of four&#x2F;five people within the Growth Lab creating web based data visualization tools, largely funded by governments (past examples include Mexico, Colombia, Peru). We’re currently at one designer, one backend + data munger, one frontend engineer. We&#x27;re aiming for one more mostly-frontend person who focuses on data viz, plus someone for a PM role - though we&#x27;re trying to prevent everyone from getting too siloed, and trying to hire people who are T-shaped: specializing at one sort of thing, but curious about related areas. We work alongside a larger team of researchers with diverse backgrounds.<p>---<p>One of the more recent sites we worked on: <a href=\"http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col\" rel=\"nofollow\">http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col</a>\nOne of our older sites, focusing on international trade data: <a href=\"http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;atlas.cid.harvard.edu&#x2F;</a>\nOur head researcher, talking about our ideas: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2FeugaLv5Bo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2FeugaLv5Bo</a>\nA neat webgl project one of our interns did: <a href=\"http:&#x2F;&#x2F;globe.cid.harvard.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;globe.cid.harvard.edu&#x2F;</a><p>---<p>Regarding the frontend &#x2F; data viz person: We&#x27;re looking for folks who are comfortable with <i>modern</i> javascript &#x2F; d3 and <i>best practices</i>, but also have a creative side. Previous work experience doing stuff like this and &#x2F; or a portfolio with sample work is a huge huge bonus and the best predictor of success in our experience. The work would probably be a bit of data viz and a bit of general frontend development, but there are teammates to help with both.<p>Regarding the product manager role, see this gist: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;makmanalp&#x2F;bb7fb0cf50e3a44c2d1321a08e71c3db\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;makmanalp&#x2F;bb7fb0cf50e3a44c2d1321a08e...</a><p>---<p>To get in touch, contact Andrea Hayes (andrea underscore hayes at hks dot harvard dot edu), preferably with stuff that you&#x27;re proud of!","time":1472744634,"type":"comment"}