{"by":"Bahamut","id":12409200,"parent":12405698,"text":"Mindflash | Palo Alto, CA | Full-Time | Remote or Onsite | US Citizen or Green Card only<p>We are a small edtech company (~30 people) by El Camino &amp; Page Mill Road in Palo Alto looking to ramp up our engineering team by up to 5 solid mid-level&#x2F;senior full-stack engineers.<p>Our company has been around since 1999, and remained small while only having ever raised a seed &amp; Series A round with a single investor. Our product is a learning management system (LMS), which allows our clients to educate their users. It was recently ranked #4 in Fortune&#x27;s most flexible workplaces[1], and I have the pleasure of saying that this is the best company I have worked at thus far due to the combination of excellent management&#x2F;executives, and tremendous work-life balance enjoyed by all, as well as ample opportunity to move technology forward. In addition, we have better gender balance at the company than most in the area, including in engineering - we strive to be inclusive, although primarily we just want people who are awesome to work with, including being considerate to others.<p>We have a smart &amp; burgeoning engineering group that is working on some interesting problems. Our tech stack includes Node.js (v4), Angular 1 &amp; 2, MySQL, Elasticsearch, &amp; Jenkins, as well as Selenium with Java 8 on the QA automation side. There is a lot of opportunity across the stack to touch many different areas to make improvements. We are open to trying different technologies as well, and have a culture of writing tests for our code. We strike a great balance of keeping product quality high while creating the ability to address technical debt, and get raving reviews from our clients for ease of use.<p>We are willing to relocate able candidates, or allow working remote if the candidate is willing to work roughly standard Pacific time working hours (9 am - 5 pm PT).<p>Our interview process generally involves no whiteboarding or live coding, and instead focuses on experience &amp; ability to design software while working on a team.<p>Please contact me at wesley.cho(at)mindflash.com if interested in more details - no recruiters please, I will not respond.<p>[1] <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;best-workplaces-flexibility&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;best-workplaces-flexibility&#x2F;</a>","time":1472766942,"type":"comment"}