{"by":"doberman","id":12406966,"parent":12405698,"text":"Doberman Design (<a href=\"http:&#x2F;&#x2F;dobermandesign.com\" rel=\"nofollow\">http:&#x2F;&#x2F;dobermandesign.com</a>) | NYC | Design Technologist Lead | Full-time | ONSITE\nAt Doberman NY, we are entrepreneurial, creative and motivated developers, producers and designers. We love solving design challenges with the unexpected and magical, sometimes even revolutionary. Over the years we have nurtured a collaborative and people-focused culture because we believe that fuels innovation, and our work-life balance is as evident as our focus on people.<p>We work with a broad range of technologies within full-stack development, continuous integration, hosting and system architecture. We like to start fresh. We don&#x27;t iterate on the same products forever. You’ll feel a sense of accomplishment when you deliver one project and tackle the next one.<p>In this role you will: - Lead development efforts for innovative digital products - Be empowered to choose the best technology for the job - Act as technical advisor to interesting and forward-thinking clients - Mentor other design techs and lead the growth and recruitment of the NY tech team - Provide input to help shape new business scopes and drive more opportunities - Lead and contribute to development of our open source projects - Participate in hack days and tech talks<p>We want you to have: - A broad understanding of different front end frameworks and libraries (such as BackboneJS, Angular, Ember, etc) as well as back end frameworks (e.g. Django, Ruby on Rails) and be able to apply them as appropriate - Experience with CSS, CSS frameworks (e.g. SCSS) and methodologies (e.g. BEM) - Be detailed oriented, especially visually as related to UI&#x2F;UX - A passion for and curiosity about trends and developments in technology<p>Our perks include 25 days PTO, benefits package, 401K. 8 hour work day is expected, no regular overtime.\nDoberman is a leading design firm based in New York, Stockholm and at our think tank studio in Berlin. Awarded Sweden’s Best Employer (twice) and Sweden’s Service Innovator of the Year. Interested? Please send your resume and portfolio to work-nyc@dobermandesign.com.","time":1472749382,"type":"comment"}