{"by":"johnrball","id":12407758,"parent":12405698,"text":"Spreemo  -  Senior Rails Engineer-  Remote or NYC<p>Spreemo is a fast growing digital health company reshaping the way we evaluate and select our doctors. Today, we’re doing this in radiology, tomorrow, the greater healthcare ecosystem. We’re looking for a Senior Rails Engineer who will help re-architect and develop our core healthcare marketplace platform. We are committed to following Rails best practices around enabling continuous deployment with comprehensive testing. We are recruiting for an experienced, full-stack developer who has deployed numerous production Rails applications and has well-thought-through opinions on which gems to rely on, coding style, and best practices for rapid iteration and maintainability.<p>As with most rapidly growing companies, the work environment will be fast-paced and exciting. Importantly, you will also have the opportunity to take a senior role right from the beginning and shape the technical side of our organization. We are looking for someone who is committed to writing well-tested code, and who has a collegial attitude and an interest in mentoring junior developers.<p>THINGS OUR IDEAL RAILS DEVELOPER KNOWS<p>Best practices in building a RESTful API\nDeep experience with Cucumber, Capybara, and Rspec\nThe hows and whys of git\nThorough understanding of full-stack security and performance issues<p>THINGS OUR IDEAL RAILS DEVELOPER LOVES<p>Writing good testable code\nCollaborating with others to build something great\nMentoring (but not managing) junior developers\nWorking iteratively<p>THINGS THAT WOULD BE NICE FOR YOU TO HAVE<p>DevOps experience, particularly with AWS\nDeep familiarity with Postgres\nBS in Computer Science or closely related technical field<p>THINGS WE&#x27;LL GIVE A GREAT RAILS DEVELOPER<p>Competitive compensation package and health benefits\nCollegial team environment with a fast-growing company<p>If you&#x27;re interested in joining a fun-loving team full of people trying to fix America&#x27;s healthcare system, send us your resume and cover letter and let us know why you&#x27;d like to join our team.<p>Email your resume to john.ball@spreemo.com<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;spreemo.com&#x2F;f9ccce00-3ec1-4689-b488-58daf67b8a7b\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;spreemo.com&#x2F;f9ccce00-3ec1-4689-b488-58...</a><p>*Remote candidates have to be US based and have at least 1 year of prior full remote experience","time":1472754991,"type":"comment"}