{"by":"papercruncher","id":12407374,"kids":[12410443],"parent":12405698,"text":"San Francisco | Senior Engineers | Tubi TV | Full-Time | ONSITE | VISA (transfer H1&#x2F;O1 &amp; start GC)<p>We are making premium TV shows and movies available for streaming everywhere and to everyone, 100% free. Join Tubi TV and reinvent the way consumers discover and consume premium content. With over 40,000 movies &amp; TV shows, Tubi TV has the world&#x27;s largest catalog of premium content, all made available to consumers for free.<p>Some of our studio partners include MGM, Lionsgate and Paramount. We offer very competitive pay, full medical, dental &amp; vision benefits, catered lunch, gym subsidies and your choice of hardware. Learning is a huge part of our culture and we frequently help non-engineers learn basic programming skills.<p>All positions come with stock options and full benefits. We are hiring for:<p>- Senior ML&#x2F;Data Engineer($140k-$170k): Come and build out the next iteration of our data platform. Full autonomy and end to end ownership. Work on your choice of algorithms using Spark&#x2F;Flink or any other stacks you deem suitable. See: <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk06xpn&#x2F;?referer=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk06xpn&#x2F;?referer=hn</a><p>- Senior Backend Engineer($140k-$170k): Work on NodeJS v6, design APIs, architect video encoding pipelines, experiment with ad payloads and help build out our media delivery network. Previous AdTech experience is a major plus. We are also exploring adding Scala or Elixir in certain projects. See <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk067d5&#x2F;?referer=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk067d5&#x2F;?referer=hn</a><p>- iOS Engineer ($100k-$120k): Work on a brand new iOS codebase and tvOS app, with a lot of guidance from seasoned engineers.    \n<a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk068xc&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk068xc&#x2F;</a><p>- Android Engineers($120k-$175k): We are hiring both Jr and Sr Android Engineers to work on our very popular app that has over 8M installs and close to 2M monthly active users.<p>If you&#x27;d like to chat more first, shoot me an email and mention HN (marios at tubitv dot com).","time":1472752066,"type":"comment"}