{"by":"Torn","id":12406357,"parent":12405698,"text":"Skyscanner | London, Barcelona, Edinburgh, Glasgow, Budapest, Sofia | ONSITE, VISA | full-time senior hires<p>We&#x27;re one of the biggest travel metasearch products in the world by traffic... and we want to 10x that, again :)<p>Hiring at an experienced level in lots of key disciplines: backend with microservices &amp; distributed systems, big data &amp; data science, full stack (modern frontend + api skills - particularly Node or Python), designers, product, iOS &amp; Android. We are growing in all of our European offices - London and Barcelona being the two newest. In short, if you&#x27;ve got good industry experience, know what best practices look like, and have the drive to make things better, we&#x27;re interested.<p>We want to hire people interested in large-scale challenges and building new products. We have an incredible amount of historical data and a unique position in the market. What should the future look like? How do we best use our data, our scale and new technologies to our advantage as we grow? We&#x27;re particularly interested in data-driven personalization and recommendation, exploring new travel products and experiences, as well as developer enablement and tooling.<p>We&#x27;re one of the very few unicorn companies HQ&#x27;d in Europe who are profitable, and have been so for the past 7 years. Our CTO Bryan Dove joined us from Amazon S3 - in London you would be working closely with him alongside some very experienced industry figures in a cool and central location.<p>You can apply at <a href=\"http:&#x2F;&#x2F;www.skyscanner.net&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skyscanner.net&#x2F;jobs&#x2F;</a> - or ping me an email at alex (.) treppass [at] skyscanner.net for a referral. Happy to answer questions or pass you to someone who can. CV in Word &#x2F; .doc format would be ideal, pdf is fine.<p>On a personal note, I see a lot of freedom, responsibility, accountability. Engineers have a lot of room to make decisions and move fast, and the encouragement to make things better and make us faster as a tech company. It&#x27;s exciting.","time":1472745575,"type":"comment"}