{"by":"kevinbuckley","id":12408684,"parent":12405698,"text":"Next Century Corporation|www.nextcentury.com|Full-time|Onsite @ Annapolis Junction, MD| Software Developer<p>The primary responsibility for this role would be for the design, implementation, integration and customization of various data-driven web applications to provide rapid insight to end users and decision makers. You would be utilizing front end development using Angular.JS, jQuery, and Bootstrap while still utilizing backend development utilizing Java, Spring, and JavaScript.<p>Perhaps you’re more of a Front End Developer instead of a Full Stack Developer. Have no fear; we have several opportunities for individuals with your caliber.<p>A bit about who we are-<p>We were founded as a direct result of the 9&#x2F;11 attacks and provide solutions that integrate situational awareness, at a glance analysis, decision support, collaboration, and other core capabilities utilizing our expertise in data visualization, user interface design, GIS, image exploitation, and mobile computing.<p>Who We Are Seeking\n•At Next Century, we are committed to growing our team of high performers to accomplish our mission of saving lives and protecting our country. \n•We are not a body shop; we avoid staff augmentation, and we are totally committed to excellence in all that we do. \n•Joining our team is not just a position, but a journey with a team of world class software engineers who share a passion for using their skills and experience to make a difference. \n•We are seeking those that hold these traits and beliefs:            \n       o Passionate about protecting our country and saving lives. \n       o Aware of the concept of a high-performance organization and is committed to achieving them. \n       o Engineers that desire to work closely with end users to identify the most critical information. \n       o Demonstrated passion for learning and curiosity of the world.<p>Common Technology- Java, Swing, Unit testing, OpenGL, Spring, Groovy, Maven, Hudson&#x2F;Jenkins, GIS applications, NoSQL, Mongo DB, and AngularJS<p>Required education: * Bachelor&#x27;s You must be eligible and willing to obtain a security clearance.","time":1472762244,"type":"comment"}