{"by":"rcsorensen","id":12408727,"parent":12405698,"text":"Trello | New York, NY or REMOTE<p>Trello ( <a href=\"https:&#x2F;&#x2F;trello.com\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com</a> ) is a visual collaboration tool that creates a shared perspective on any project.<p>We&#x27;re a remote-friendly, venture-backed startup headquartered in NYC.<p>We&#x27;re growing quickly, not the kind of quickly where you&#x27;re hiring just for headcount numbers, we&#x27;re hiring for quality. We&#x27;re currently 92 employees total. Joining us at this stage empowers you to help define our future processes, what it means to be on the team, and lends itself to lots of exciting career growth.<p>We’ve got four roles open right now that might be of special interest to the HN crowd:<p>Site Reliability Engineer –  you’ll work on keeping everything running efficiently as we scale the infrastructure supporting over 10 million Trello users on the way to our goal of 100 million users. ( <a href=\"https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;site-reliability-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;site-reliability-engineer</a> )<p>Developer Advocate – it will be your mission to make it easy and fun to build on top of our API and new Power-Ups platform. ( <a href=\"https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;developer-advocate\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;developer-advocate</a> )<p>Growth Engineer – you&#x27;ll be working to build features and run experiments to improve acquisition, engagement, retention, revenue, and virality. ( <a href=\"https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;growth-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;growth-engineer</a> )<p>IT Specialist (NYC) – own and manage our cloud based infrastructure tools for collaboration across the company and support our local and distributed employees for all things IT related. ( <a href=\"https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;it-specialist\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com&#x2F;jobs&#x2F;it-specialist</a> )<p>Some other jobs and some of our perks can be seen at <a href=\"https:&#x2F;&#x2F;trello.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;trello.com&#x2F;jobs</a> .","time":1472762656,"type":"comment"}