{"by":"lstamp","id":12410478,"parent":12405698,"text":"LiveRamp | Back​ ​End&#x2F;Full​ ​Stack Developers | San Francisco &amp; London | Onsite<p>Want to build software that connects companies and marketers? LiveRamp is the leader in data connectivity, helping the world’s largest brands use their data to improve customer interactions on any channel and device.​ ​We help marketers eliminate data silos and unlock greater value from the tools they use every day.<p>Our stack: We are looking for full-time engineers and aspiring managers in three primary areas.<p>1) Large scale distributed systems engineering (primarily Java on our 10+ PB Hadoop cluster)<p>2) Full-stack web engineering (mostly Ruby-on-Rails and Javascript)<p>3) Engineering management (you would code for about 6 months before taking on a manager role).<p>We are steadily growing (200 current employees) with plans to double in size over the next year. We’re looking to grow the engineering team both in our San Francisco Headquarters and our newly opened London office.<p>About you: You’re comfortable in multiple languages, frameworks, and environments.Our employees enjoy a fun office with catered meals, unlimited PTO, ​an ​annual camping trip and lots of social gatherings. But the best job perk is our awesome team - we’ve got a staff of amazing people who just happen to be great engineers as well.<p>Check out what we’re all about: \nSenior Backend Engineer (<a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;afx5wq\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;afx5wq</a>)\nSenior Full Stack Engineer (<a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;f2la7b\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;f2la7b</a>)\nData Engineer&#x2F;New Grad (<a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;jmgo1f\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;jmgo1f</a>)\nLondon Data Engineer (<a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;4e6qvw\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;4e6qvw</a>)<p>​Want to learn more? Email Lstamp@liveramp.com with questions about the roles and use the links above to apply directly.","time":1472784588,"type":"comment"}