{"by":"conorgil145","id":12413529,"kids":[12436300,12415104,12415131],"parent":12405698,"text":"Virtru | Washington, DC or REMOTE (within America) | Fulltime | DevOps, Javascript fullstack<p>== Who we are ==<p><a href=\"https:&#x2F;&#x2F;virtru.com&#x2F;how-it-works\" rel=\"nofollow\">https:&#x2F;&#x2F;virtru.com&#x2F;how-it-works</a><p>Everyone has a right to keep their digital content private and secure. We founded Virtru because we believe that exercising that right should be easy and convenient.<p>Virtru allows you to send end-to-end encrypted email using your existing email address and existing email provider with the flip of a switch. We have browser extensions for Chrome&#x2F;Firefox, apps for iPhone and Android, and a plugin for Outlook desktop.<p>Our full time team of ~40 is currently ~50% engineers spread among all 4 US-based time zones. We value automated testing, readable&#x2F;maintainable code, documentation, and code reviews. We run in 2 week sprints and dedicate about 20% of total capacity to things the dev team thinks are important (technical debt, refactoring, exploring a new technology, etc), while the rest goes to feature development and addressing bugs.<p>We are well capitalized and just closed a $29 million dollar round with top investors [0].<p>== Current positions ==<p>1) DevOps engineer to help us scale. We are working on a range of projects including: improving our resource utilization by hosting our applications with Docker, streamlining our build&#x2F;deploy pipeline so that we can reduce production impact of bad builds, rearchitecting our application layer to increase our throughput and lower our latencies, etc, etc. We work mainly with AWS (too many services to list), Terraform, Ansible, NodeJS, and Python. Please apply via Stack Overflow Careers [1].<p>2) Full stack NodeJS&#x2F;Javascript developer with experience building, deploying, and maintaining RESTful web services and infrastructure in AWS using automated tools such as Terraform, Ansible, Chef, Puppet, AWS CloudFormation, etc. Please apply via Stack Overflow Careers [2].<p>== Get in touch ==<p>If you care about privacy and are interested in creating security products at a company which thinks that user experience is a first class citizen, please get in touch! We currently use Stack Overflow Careers to track all of our candidates in one place, so please apply via the links below. Please include in your cover letter a short explanation of what interests you about Virtru.<p>[0] <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;08&#x2F;22&#x2F;email-and-file-encryption-service-virtru-built-by-ex-nsa-engineer-raises-29-million&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;08&#x2F;22&#x2F;email-and-file-encryption-...</a><p>[1] <a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;119612&#x2F;senior-devops-engineer-virtru\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;119612&#x2F;senior-devops-engineer...</a><p>[2] <a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;99104&#x2F;full-stack-javascript-developer-virtru\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;99104&#x2F;full-stack-javascript-d...</a>","time":1472829031,"type":"comment"}