{"by":"yurt_","id":12410144,"parent":12405698,"text":"Raygun | Seattle, US &amp; Wellington, NZ | Engineering &amp; Sales | Permanent Full time | Onsite<p>----------------------------\n----------------------------\n----------------------------\n-------------------<p>Raygun gives developers the power to create perfect software experiences on a global scale.<p>----------------------------\n----------------------------\n----------------------------\n-------------------<p>Https:&#x2F;&#x2F;raygun.com&#x2F;careers<p>Sales Roles | Seattle, US<p><pre><code>  Sales Development Rep\n  Account Executive\n  VP of Sales\n  Customer Success Manager\n</code></pre>\nGet in on the ground floor of an already successful SaaS business! How? Raygun (<a href=\"https:&#x2F;&#x2F;raygun.com\" rel=\"nofollow\">https:&#x2F;&#x2F;raygun.com</a>) is setting up a sales office in Seattle – it’s first sales office globally. The Raygun Platform is already in use with thousands of customers in more than 100 countries. We’re a high growth, but profitable, business. We achieved this with a great product coupled with great marketing. Simply put, you’ll be helping find new leads for a product that has proven value to software development teams in a rapidly growing market.<p>Engineering Roles | Wellington, NZ<p><pre><code>     Software Engineer - We are always on the look out for awesome software engineers\n</code></pre>\nYou love coding to the brink of obsession! The code you write is clear, easy to maintain and unit test. You care about the user and you get a kick out of building features they love using. You will excel in a collaborative and agile environment where we deploy continuously, measure everything and take responsibility to diagnose and fix what breaks.<p>You&#x27;ll get a good idea of our mentality here. \n<a href=\"https:&#x2F;&#x2F;raygun.com&#x2F;blog&#x2F;2016&#x2F;08&#x2F;the-best-software-engineering-roles-in-new-zealand&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;raygun.com&#x2F;blog&#x2F;2016&#x2F;08&#x2F;the-best-software-engineerin...</a>","time":1472779524,"type":"comment"}