{"by":"CentralwayCW","id":12413449,"parent":12405698,"text":"Centralway Numbrs AG | <a href=\"https:&#x2F;&#x2F;www.centralway.com&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.centralway.com&#x2F;en&#x2F;</a> | Software Engineer, Backend (Go &#x2F; Golang) | Zurich, Switzerland | ONSITE | Full-time<p>Centralway’s focus is on developing products to manage banking transactions and assets. The platform provides banking services for the consumer, as well as the development and implementation of banking software towards financial institutions.<p>Your responsibilities as a Software Engineer, Backend will include the continuous development and improvement of the current backend and service architecture of Centralway Numbrs. You will administer and support our backend API, databases and other components. Researching and remaining up-to-date with the latest technologies will help you to implement scalability and redundancy in all parts of the application.<p>Technical requirements\nEducation: B.S. or M.S. degree in computer science, or equivalent work experience relevant to the role\nTechnology: Experience with at least one modern, object-oriented programming language such as Golang, Java or C++ and knowledge of at least one scripting language (Ruby, Python, Perl or other). Experience with Git and continuous integration. Preferably experience with Docker and comfortable with DevOps tasks and deployment tools such as Ansible, Puppet or Chef.\nLanguage: Excellent communication skills in English.<p>About our Infrastructure\nGo programming language, elastically scalable Microservices.\nHosted on AWS\nMore than 1 billion API requests.\nMore than 20 million unique events.\nMore than 10,000 new events daily.\nThousands of concurrent users.\nConnection to more than 3,500 financial institutions.<p>We offer free breakfast and lunch buffets, snacks and ice-cold drinks, sports club &amp; fitness studio and many extra perks and benefits.<p>Recruiting process:\nSkype Interview --&gt; Skype Live Coding --&gt; 1 day onsite interview with future colleagues, tech lead and management (Centralway is pleased to cover the travel expanses for the onsite interview). We provide fast and transparent feedbacks after the interviews.<p>Apply for this job here: <a href=\"https:&#x2F;&#x2F;www.centralway.com&#x2F;en&#x2F;careers&#x2F;open-positions&#x2F;details#oLzvZfwy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.centralway.com&#x2F;en&#x2F;careers&#x2F;open-positions&#x2F;details...</a>","time":1472828337,"type":"comment"}