{"by":"falon","id":12416239,"parent":12405698,"text":"------------------------------------------------------------<p>Node.io | San Francisco | Senior Data Engineer | Full-Time<p><i>Backend Engineer | Senior Software Engineer | Data Scientist | Distributed Systems</i><p>We have an opening for a senior level engineer who is entrepreneurial and passionate about leveraging big data and search technologies (e.g Hadoop, Machine learning, Natural Language Processing, Web Crawling) to build out a unique product that will transform how businesses are able to analyze relationships between entities on the web to uncover new opportunities.<p>We&#x27;re looking for fast learners who can get their hands dirty, quickly; who know when to duct tape and when to have 100% test coverage (think like a hacker, ship like a pro); who don&#x27;t mind being wrong occasionally; and who are intrigued by the overall space we&#x27;re in. You&#x27;d be a foundational member of the engineering team and have a significant opportunity to influence our culture and growth, as well as immense impact on the product itself.<p>We spent the last year and a half building out the platform and this year have been working with a select group of enterprise customers.<p>Below is a bit more on Node: \nAt Node, we believe the future of the web isn’t about search; it’s about proactive, personalized recommendations. We’re a team of ex-Googlers re-organizing information on the web for the people that use it. Backed by Mark Cuban, NEA, Avalon Ventures and Canaan Partners, you can read more about the platform that aims to transform how business is done and drive the future of the contextual web.<p>Are you interested in hearing more? Looking forward to hearing from you. Email falon@node.io<p><i></i>Node CEO Article Published in TechCrunch:<i></i> <a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;08&#x2F;18&#x2F;the-future-of-the-web-is-all-about-context&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;08&#x2F;18&#x2F;the-future-of-the-web-is-al...</a><p><i></i>Mark Cuban discussing Node as a Game Changer on Bloomberg TV:<i></i> www.bloomberg.com&#x2F;news&#x2F;videos&#x2F;2016-06-27&#x2F;mark-cuban-on-node-this-is-a-game-changer<p><i></i>$7.5M funding round earlier this year:<i></i> <a href=\"http:&#x2F;&#x2F;www.businesswire.com&#x2F;news&#x2F;home&#x2F;20160613005131&#x2F;en&#x2F;Node-Secures-7.5-Million-Funding-Reorganize-Web\" rel=\"nofollow\">http:&#x2F;&#x2F;www.businesswire.com&#x2F;news&#x2F;home&#x2F;20160613005131&#x2F;en&#x2F;Node...</a><p>------------------------------------------------------------","time":1472849935,"type":"comment"}