{"by":"dbRM","id":12435848,"parent":12405698,"text":"Rails Machine  |  Site Reliability Engineer  | Full-Time | Remote | Hiring Junior to Senior Levels\n<a href=\"http:&#x2F;&#x2F;railsmachine.com\" rel=\"nofollow\">http:&#x2F;&#x2F;railsmachine.com</a><p>As a Site Reliability Engineer at Rails Machine, your primary goals will be to ensure our customer’s applications are available, fast, and secure. Our customers need the best service, support, and products, and we need you to help us deliver.<p>We offer two main products: managed infrastructure and managed operations. Through managed infrastructure, we provide automation, infrastructure, and scalability in our own data center on our own hardware. We provide both bare-metal and virtualized hosting options for our customers, and you’ll work directly with them to ensure their goals are met through automation, analysis, and hardware. And via managed operations, we provide custom, consulting-based solutions on top of any cloud vendor, as best meets the customer’s needs.<p>We give our customers the ability to reach out to us like they would an internal DevOps team!<p>You’ll work with virtualization and container technologies, and setup and automate high availability data clusters (MySQL Galera, PostgreSQL replication, Redis failover, ElasticSearch clustering, Memcached, MongoDB etc.). You&#x27;ll manage application instances for technologies like Ruby-on-Rails, Django, Node, and Scala (to name a few), and layer on top of those management, orchestration, monitoring, and alerting for fleets of instances. If you’ve ever wanted to work at a scale that few companies do, you’ll find the right challenge here at Rails Machine!<p>Responsibilities:<p>* Manage availability and performance problems for customers; automate resolution to prevent reoccurrence<p>* Pair with other SRE&#x2F;SAs, mentor junior staff<p>* Releases and maintains open-source software and projects<p>* Author blog posts and participate in the community by going to meetups, conferences, etc. as a Rails Machine representative<p>* Creates and maintain system architecture, design, and implementation<p>Minimum Qualifications :<p>* Proficient in Ruby with additional experience in C&#x2F;C++, Python, Java, or JavaScript preferred<p>* Significant experience with config management or automation framework, like Chef, Puppet, Ansible, Capistrano<p>* 4 years maintaining production infrastructure on a Linux environment<p>* Intermediate Ubuntu system administration skills<p>* Strong DevOps experience and customer service skills<p>* Ability to participate in on-call&#x2F;pager rotation<p>Interested?   Tell us what you&#x27;ll bring to the team by emailing hiring@railsmachine.com !","time":1473168795,"type":"comment"}