{"by":"barnabyc","id":3538664,"parent":3537881,"text":"Providence, RI - Swipely (<a href=\"https://swipely.com\" rel=\"nofollow\">https://swipely.com</a>)<p>Senior UX Engineer<p>Want to change the world?  Love creating awesome user experiences?  Keep reading.<p>THE MISSION<p>Swipely revolutionizes how local merchants do business, arming them with innovative technology that puts the clunky, archaic systems used by big retailers to shame. We're the Robin Hood of business, disrupting the payment space to enable the little guys to do what only the big guys can, and then some. We interact directly with both merchants and their customers, impacting the personal experience on both sides in deep, meaningful ways. We turn rewards and loyalty upside-down (or, as we see it, rightside-up!) by giving points and discounts to customers through their credit card, without the need for special cards, mobile apps, bar codes, or anything else that gets in the way of the experience. We analyze every payment transaction, providing intuitive reports and automated tools for merchants that use them to grow and deeply engage their customers. And that's just the beginning of the possibilities with our passionate team, unique resources, and mission to make our merchants successful!<p>THE OPPORTUNITY<p>Combine a world-class front-end team with a powerfully creative atmosphere, and you get a compelling culture that liberates us all to envision and realize innovative product ideas every day. You will push your own limits of what you think is possible with a user experience. You will propose and refine new concepts, comps, technologies, and solutions, and get the support needed across the company to realize the untapped potential we have yet to discover.  You will work with top sales, marketing, and product talent that deeply values innovation and the engineers that drive it.<p>Evolution is our greatest ally. We built the first incarnation of Swipely with jQuery, experimented with Backbone yet quickly realized we needed more structure, and now cruise on YUI3, with YUI3.5 around the corner. We rock MVC-driven, single-page applications, fully templatized Handlebars views, restful JSON persistence to our Rails backends, frontend unit and integration tests, and (soon!) a pushState architecture with hot data visualizations.<p>We always track and contribute to new technologies like D3, Node.js, Ember, Harmony, CoffeeScript, and Less. Exploration and collaboration are part of our culture, and any topic that can improve our engineering efforts is fair game, including NoSQL storage, Nginx/Unicorn architecture, and deployment and continuous integration tools.<p>THE REQUIREMENTS<p>You love what you do. You wake up every day more passionate about the web’s IxD models and UX than the day before. You demand the highest quality of your projects and want to work with people who demand and inspire the same, from the code down to the pixels. You get energized when opening new Fireworks and Photoshop comps and diving deep with designers.<p>You are self-directed and take initiative with confidence, yet know when to include others. You communicate effectively and thoughtfully. You appreciate the value of documentation. You are accountable for the entire user experience, from conception to production.<p>You love contributing to opensource. Your Github profile is a hive of exciting collaborations. You strive to learn and shape emerging projects. You lead and inspire others with your own applications and sites in your free time. You go out for drinks with your friends and have engrossing discussions about the web. You love freenode.<p>Your JavaScript knowledge is one of your greatest assets. You instinctively understand where native JavaScript ends and frameworks begin. Your extensive experience with MVC and design patterns guides you to insightful and intuitive solutions. You are eager to define new TDD and BDD frontend flows. You’re gratified that your language of choice is currently the most popular on Github and is evolving in leaps and bounds on the server-side. You love your backend developer. You regard as common knowledge that robust, performant code is integral to a compelling UX.<p>Your HTML5 and CSS3 expertise expands as fast as the specs are updated. You shiver with anticipation for Level 4 CSS selector support, consistent gradient rule syntax, and native grid layouts. You rock the Chrome Dev channel and wish the Safari updates were out already. You crave responsive design. You know when to go web versus native.<p>THE BENEFITS<p>Swipely is small yet growing rapidly with explosive signup rates (seriously, off the charts!) offering Silicon Valley style startup perks and more. We've got you covered on hardware -- configure your own laptop and bring on the Happy Hacker keyboards, dual-monitors, and pairing stations. Travel expenses, conference tickets, industry and social events?  Check!  Aeron chairs, daily catered lunches from the finest restaurants around (they are our merchant partners, after all!), all the snacks, beverages, and happy hours you can handle?  Done, done, and done!<p>Residing at 39 Pike Street in the Creative Capital that is Providence, you'll find us strategically located between the humming downtown and the vibrant campuses of Brown and the Rhode Island School of Design, a block away from the best coffee shop in the city.<p>Everyone in our company, from sales to engineering, is searching for you RIGHT NOW and wants to be working with you yesterday. Do us a favor; reach out and tell us about yourself.<p>Please send your resume and github profile to uxeng+y212@swipely.com – include a portfolio if available.","time":1328114158,"type":"comment"}