{"by":"alexgodin","dead":true,"id":3539539,"parent":3537881,"text":"New York, NY Full Time (remote or relocation)<p>Backend Engineer @ Dispatch.io<p>What we do<p>----<p>Dispatch connects your cloud services to give you one place to organize, share, and collaborate around your stuff. Our vision is for a more connected cloud.<p>Why you should work here<p>----<p>We are a small, fast-moving team who are passionate about building awesome things. You'd be one of the first few members of the team (we’re 5 people right now).<p>We have a big open office in the Flatiron district in NYC, in the center of the NYC tech scene. Our kitchen is well stocked, and our Campfire overfloweth with animated GIFs. As a team member you'll work on your schedule, have access to competitive health insurance plans, a chance to earn real equity, and, most importantly, the opportunity to contribute in a big way to building new ways to organize, collaborate and share in the cloud.<p>We're looking for a backend engineer. The Dispatch backend is a service oriented architecture, built entirely on AWS. Most of the current services are written in Java (and some Scala), but we’re language agnostic. Want to write that new service in Fortran? Go for it! Ok, maybe not. Let’s talk about it.<p>You'll work on architecting and building new stuff, and on improving existing services.<p>Like hacking on 3rd party APIs? Good, because we build on Dropbox, Google Docs, Facebook, Twitter, Gmail, with plans for many more.\nInterested in file transfer and sync? We’re making moving files in the cloud fast and reliable. Search? We’re building search across the stuff in your clouds. Realtime? You can head up our plans to move from asynchronous polling to a socketed system.<p>Things we're looking for<p>----<p>* Good architecture skills with a focus on details, experience with fault-tolerance, use of message queues, etc.<p>* Experience with small or cross-functional teams (startup experience would be nice).<p>* Solid understanding of computer science fundamentals, e.g. data structures, time complexity, algorithms.<p>* Comfort with statically-typed languages, knowledge of OOP.<p>* Security-mindedness, with the ability to identify and defend against threats and vulnerabilities.<p>* Experience with Amazon Web Services would be nice.<p><i>If you're interested in applying please email jobs@dispatch.io</i>","time":1328125340,"type":"comment"}