{"by":"itay","id":3539367,"parent":3537881,"text":"Seattle, San Francisco, Cupertino (and other places), FULL-TIME, INTERN, H1B<p>A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people. Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>For example, my project for the past couple of months has been to develop our new Node.js/Browser SDK, including pulling some of our propietary UI components and sharing them with the world. We also do a lot of work with customers to best help them use Splunk. One of the projects I was involved in included analyzing social data using Splunk (like Twitter/Foursquare).<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you. I personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>I wanted to highlight a few specific positions we're looking for:<p>* Dev. Platform Software Engineer: This is the team I work on. We strongly believe that there is a use for Splunk outside of logging, and we're enabling the usage of the technology for dealing with large quantities of data, whether it's for social network analysis, cloud management or anything in between. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oHkCVfwi\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oHkCVfwi</a><p>* Frontend engineer: We're trying to present a lot of data (some might even call it big data :) in a human-understandable manner. Help us implement the next wave of visualizations: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ</a><p>* UI/UX Designer: For many of our customers, they spend a great deal of their day in our web UI, and even more importantly, they spend time there when something is going wrong and they want to find out what. Help us make the UI/UX as easy and intuitive to use as possible: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=okQ4VfwT\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=okQ4VfwT</a><p>* Cloud Software Engineer: we're developing the next stage of our product, which is a hosted version of Splunk in the cloud, with all the benefits you'd expect (like automatic elastic scaling). Come help us make this a reality: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL</a><p>* Hadoop Software Engineer: Usage of Hadoop is exploding to do batch-oriented processing on massive quantities of data. We think there is a lot of value to be had by combining the power of Splunk and Hadoop, and we're developing solutions to make this possible. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS</a><p>* Software Engineer in Test: Splunk is a complex machine, deployed in a distributed manner, many times being used for different things. Our testing team is top notch, and helps us deliver quality releases. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe</a>","time":1328122754,"type":"comment"}