{"by":"baspland","id":3540452,"parent":3537881,"text":"WhatsApp Inc - BlackBerry App Developer – Java-ME\nMountain View, CA<p>We are looking for experienced BlackBerry client engineers to work on our Blackberry Team.<p>We are looking for engineers who are passionate about the BlackBerry user experience. Using your start-up mindset and your experience developing native mobile apps, you will create new, awesome features used by millions of current WhatsApp BlackBerry users. You must have the ability to work in a very small team and self-organize feature prioritization and delivery; You will own release and QA cycles of your code;<p>Client Engineer requirements:<p>•\tBS in computer science or equivalent.<p>•\tStrong Java programming and Debugging skills, with an understanding of Java-ME limitations<p>•\tExperience developing native BlackBerry apps is strongly preferred, but not required<p>•\tWorking experience with TCP, Messaging, IM, and Push APIs<p>About WhatsApp, Inc. WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows Phone, and Nokia smartphones. In addition to basic messaging, WhatsApp Messenger users can send each other unlimited images, video and audio messages as well as participate in groups.<p>WhatsApp Inc. was founded in 2009 by two ex-Yahoo! engineers. We are located in a spacious office in downtown Mountain View. We are profitable, funded, and we offer very competitive compensation packages. \nOther reasons to join us:\n- work side-by-side with the founders\n - unlimited supply of latest (and even unreleased yet) smartphones\n - fully stocked fridge from Whole Foods \n- herman miller embody chairs \n- frequent company paid lunches and dinners\n - open space, collaborative environment<p>WhatsApp Inc is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status.<p>to apply please go to the following link <a href=\"http://jobsco.re/wSDfNx\" rel=\"nofollow\">http://jobsco.re/wSDfNx</a>","time":1328136307,"type":"comment"}