{"by":"myoung8","id":3540946,"kids":[3541114],"parent":3537881,"text":"Bay Area, CA.<p>Come hack the auto industry at CarWoo! (YCS09)<p>-----------------------------------------------<p>We are looking for an awesome Rails developer to help us take the online auto industry by storm. You'll join a great engineering and design team that's working hard to bring car-buying into the 21st century. The features you create will help turn the mostly terrible experience of buying a new car into a wonderful experience for our customers.\nResponsibilities<p>Work with Michael, Erik, Scott, Rimas, Tim, Andrew, and Patrick to create a world class set of products. We're a small team (just 5 engineers and 2 designers), but we work smart and get a lot done. Here's some of the cool stuff we're working on right now: a queuing system to optimize our operations across the country, an iOS app, and a stealth web crawler.<p>We do story-driven development, so you'll get the chance to work on any or all of this stuff if you so choose.<p>Qualifications<p>- Deep knowledge of Rails and everything that goes along with it (MVC, REST, relational database design/SQL)<p>- Solid grasp on modern web application design using Javascript, HTML, CSS<p>- Experience with version control systems (we use Git/Github)<p>- Solid testing methodologies and willingness to write comprehensive tests before release<p>You get extra bonus points for:<p>- Extensive Javascript experience outside of JQuery (e.g. Backbone)<p>- Ability to write complex SQL<p>- Understanding of good RDBMS design. Experience optimizing queries.<p>- Experience with memcached, sphinx, and nginx<p>- Story-driven development<p>- Web service/API development (REST)<p>- Experience with iOS development (Objective-C)<p>- Ability to play ping-pong skillfully and/or drive a go-kart furiously<p>Perks<p>- Full Benefits (medical, dental, vision, 401k)<p>- 17 days of PTO (vacation)<p>- $5,000 to buy anything you want to get your work done (must include an Apple computer of some sort)<p>- A substantial amount of equity in the company<p>If you're interested, send an email with your résume and something interesting about yourself to michael@carwoo.com.<p>We're based in Silicon Valley, but if you live outside the Valley, we still really want to talk to you (we'll pay for your flight, hotel, and meals when you come interview with us).","time":1328144529,"type":"comment"}