{"by":"magicpixelgames","id":3541135,"parent":3537881,"text":"Los Angeles, CA.  Full Time, onsite only.<p>Generalist programmer:  Tools Focus (<a href=\"http://www.magicpixelgames.com/2012/01/20/generalist-programmer-tools-focus/\" rel=\"nofollow\">http://www.magicpixelgames.com/2012/01/20/generalist-program...</a>)<p>Established Video Game development team<p>Unannounced Project<p>Magic Pixel Games (<a href=\"http://www.magicpixelgames.com\" rel=\"nofollow\">http://www.magicpixelgames.com</a>) was founded in 2010 by the core members that developed the award-winning Steven Spielberg's BOOM BLOX. Much of our team has worked together for almost a decade, and we’ve now struck out on our own to continue our tradition of creating extraordinary games. Our first product was launched in 2011: Carnival Island, developed with Sony Santa Monica Studio.<p>We’re now building a team as we ramp up for our second project, which again, strives to break new ground – but is significantly different from our first in all ways – tone, target audience and style…we’re excited!<p>Join us and make a difference!<p>Each member of our closely-knit team makes a very real contribution to the game, and awesome ideas come from everyone. We all wear many hats, we play to each other’s strengths, and we build on each other’s ideas.<p>Our team moves fast, and takes on big challenges. We love what we do, and you will too!<p>Note: We're currently located by the Los Angeles airport. At the moment, we are not considering telecommuters.<p>----------------------------------------------<p>We’ve identified an immediate need for a Tools Programmer to help build up the asset pipeline for our game. As ramp up for our next game, we’re finding gaps in the technology that allow our content creators to put their awesomeness into the game, and we’d like your help!<p>Primary Responsibilities:<p>• Design, implement and maintain content creation tools, asset pipelines and scripts as required by lead programmer and project<p>• Collaborate with other engineers on integration and support tasks<p>• Collaborate with designers, artists and audio artists as needed to build and refine content pipelines.<p>• Work closely with producers, artists, and designers in a highly collaborative agile, small team environment<p>Requirements:<p>• 2-4 years’ experience in working on and shipping games<p>• Superlative C/C++ Proficiency<p>• Strong math skills<p>• Self-motivated, proactive and engaged attitude towards the project, and a genuine desire to help people realize their visions in game<p>• A mention of your dessert in your cover letter/E-mail<p>• Experience with working on other people’s code on a medium-sized team<p>• Comfortable working on an agile and collaborative team<p>• Flexibility in working with scripting languages, build systems, automation, XML and version control systems<p>• Strong debugging skills<p>• Accurate time and schedule management<p>• Passionate for (and interested in working on) games<p>• Generalist skill set, adaptable and flexible<p>Preferences:<p>• At least one shipped, credited game project<p>• Experience on current generation consoles<p>• Familiar with various high level or scripting languages \nfor game development<p>• Experience in GUI development with C# a plus<p>• Affinity to procedural content generation<p>• Wide range of knowledge on games<p>E-mail your relevant materials to jobs@magicpixelgames.com","time":1328148843,"type":"comment"}