{"by":"aturley","id":5803963,"kids":[5804157],"parent":5803764,"text":"Company: TheLadders (<a href=\"http://www.theladders.com\" rel=\"nofollow\">http://www.theladders.com</a>)<p>Location: New York, New York<p>Position: Full-time on-site software engineer (H-1B negotiable)<p>We are looking for great software engineers to help us find the right jobs for the right people. Our current engineering projects are based on JavaScript, Java, Scala, MySQL, and iOS, so if you have experience in any of these areas then we would really like to talk to you. We are also doing things with Storm, Elastic Search, Scala, Erlang, Couchbase, and Riemann, so if these things tickle your fancy please get in touch. And finally, if you're interested in building software the right way and you want to work with a group of smart engineers who will help you learn and grow then by all means send me an email.<p>As an engineer you will help us tackle big technical problems. We have over one million users and thousands of jobs, with historical data going back nearly a decade. In order to provide our users with an experience that they are willing to pay for, we need to build smart scalable solutions. You will be at the heart of this, designing and building these solutions using your skills and the best available technologie\ns.<p>We are committed to taking care of our engineers. We offer competitive pay, comprehensive benefits, and unlimited vacations. We also want to help our engineers grow. Inside the office you'll see this in things like our onboarding process (<a href=\"http://dev.theladders.com/2013/03/theladders-on-boarding-a-retrospective/\" rel=\"nofollow\">http://dev.theladders.com/2013/03/theladders-on-boarding-a-r...</a>), code reviews, technical discussions, and our developer blog (<a href=\"http://dev.theladders.com\" rel=\"nofollow\">http://dev.theladders.com</a>). Outside of the office it will take the form of conferences and training programs, paid for by the company.<p>If you would like to learn more, please send me an email at aturley@theladders.com.","time":1370095194,"type":"comment"}