{"by":"srjk","id":5804006,"parent":5803764,"text":"Ringio - Full Time, Near Courthouse Metro, VA / Washington, DC<p>keywords: go, growing pains, grails, node.js, ejabberd, erlang, realtime<p>Ringio(<a href=\"http://ringio.com\" rel=\"nofollow\">http://ringio.com</a>) provides internet phone service to small businesses to improve the quality of their phone interactions. We have some great ideas for owning this domain and are looking for a few great software engineers to help take our product to the next level. If you're interested (or know someone who is), read more and email srijak AT ringio.com[1]. If you are interested in Go or node.js you should definitely get in touch.<p>Major areas of development focus:<p><pre><code>  - Scaling: We are growing at a rate where our current stack and architecture need\n              to be rethought. So, there is a lot of interesting work to be done.\n\n  - Modern HTML Applications: We’re very excited about  JavaScript frameworks that\n              have grown in popularity (like Angular.js, D3). We’re interested in\n              using web technologies for our mobile and desktop applications, so if\n              you’re experienced with (or just interested in) JavaScript, \n              CoffeeScript, SCSS, WebSockets, or BOSH, there’s a lot of research \n              and development to be done.\n\n  - Voice Technology: All calls using Ringio run through our voice systems to enable\n              things like on-hold music, call screening, and transfers.\n              We have a lot of new voice functionality that we’d like to build,\n              as well as technology we’d like to integrate. This is fairly unique to\n              our industry and involves some interesting timing, reliability,\n              concurrency, and state management problems.\n\n  - API Development: Integration with CRM systems and reselling partners requires APIs\n              for large pieces of our platform. We need help expanding our APIs, \n              making sure they’re usable and secure, and testing that they’re working\n              correctly.\n</code></pre>\nWe’re Looking For People Who Are:<p><pre><code>  - Smart software developers\n\n  - Familiar with object oriented programming. We use Grails and Java for our major\n    systems but are moving towards Go, Node.js for our service layer. We don't require\n    you know any of these languages, but expertise in *a* language is desired.\n    If you are interested in Go or node.js you should definitely get in touch.\n\n  - Familiar with Unix/Linux command-line systems. Logging into a Linux server to count\n    the number of ERROR lines in a log file grouped by hour wouldn’t be difficult\n    for you.\n\n  - Excited about joining a startup and wearing many hats.\n\n  - Authorized to work in the US\n\n  - Able to work from our Courthouse Metro office (flexibility to work from home\n    sometimes, but most time will be at the office)\n</code></pre>\nIf you're interested, email srijak AT ringio.com[1].<p>[1] Email should have your resume attached, have the string \"from hackernews\" somewhere in the subject line, and tell us why you think Ringio should hire you :)","time":1370095927,"type":"comment"}