{"by":"dlnb","id":5804200,"parent":5803764,"text":"San Diego, CA. Summer Internship with the Foundation for Learning Equality (learningequality.org)<p>Posting page: <a href=\"https://sites.google.com/a/learningequality.org/kalite/development/internships\" rel=\"nofollow\">https://sites.google.com/a/learningequality.org/kalite/devel...</a><p>We’re looking for a...\nSoftware Developer Intern \n*Accepting Applications for Summer 2013\n(Not interested in coding? There are tons of ways to get involved! Email us: info@learningequality.org and we'll be in touch!)<p>Where?\nUC San Diego, La Jolla, California. Remote is fine too!<p>When?\nJuly 1 - September 15, 2013 (flexible)<p>Who are we?\nThe Foundation for Learning Equality (FLE) is a non-profit organization dedicated to creating tools for sharing and creating open-licensed educational content for use by anyone around the world, with a focus on reaching those with limited or no internet access.<p>We are a group of hackers, educators, and aspiring ninjas, that are excited about bridging the divide between those with access to high-quality educational resources, and those without.<p>What you get to hack on:\nKA Lite (kalite.learningequality.org) is a lightweight web app for serving core Khan Academy content (videos and exercises) without needing internet connectivity, from a local server (even a Raspberry Pi!). Take it for a test drive, it’s open-source. Check out our wiki for more information.<p>Technologies we use and skills we would value (but learning on the job is acceptable!):\nPython!\nDjango\nJavaScript / HTML5 apps\njQuery\nBackbone.js\nVideo.js\nHTML / CSS / LESS\nAndroid development\nHardware / networking / system administration\nCryptography / databases / API design<p>What we plan on building:<p>This summer, we will be continuing to develop the KA Lite project, to meet the needs of the schools and organizations that are deploying the project around the world, and make it accessible to even more people. Some of the features we’ll be working on are:\nIncluding mechanisms for peer-to-peer synchronization of software updates, content, and usage data, so that it can be kept up to date even in no-bandwidth scenarios.\nImproving the coach reporting tools and adding more gamification.\nPolishing up an in-progress Android wrapper for KA Lite, so it can be used completely standalone on mobile devices.\nAdding support for internationalized interfaces and content (dubbed videos and translated exercises).\nAdding the features that you, the interns, dream up! Bring your ideas to help increase educational access, and improve the user experience for both students and teachers.<p>We will also be beginning development on a new platform for distributing and hosting other open-licensed educational materials (beyond Khan Academy), as well as allowing teachers to author their own content -- offline -- to use in their classrooms as well as share back with the rest of the world. There will be exciting opportunities to be part of the design and prototyping phases of this new initiative over the summer!<p>We Offer the Following Benefits:<p>- You will be hacking on a piece of technology that has the potential to bring high-quality educational resources to literally billions of people who have never before had access.\n- You’ll be surrounded by a wide variety of development talent, from FLE team members, to professionals on the UC San Diego campus, and our internationally based partners. \n- You’ll have the chance to make real contributions to an ambitious development road map at a fast-growing startup nonprofit.\n- The UC San Diego campus is beautiful, the weather is perfect, and it’s only a five-minute walk to one of the world’s most iconic beaches. \n- A recommendation to our many partners in the tech and education industry.<p>Expectations\n- We believe that you’ll get as much out of this as you put in. If you want, you can work 20 hours per week, or you can work 40 (although we do ask for at least 20).\n- Set realistic goals for yourself and hold yourself accountable for reaching them. \n- Familiarity with some programming language and the ability and willingness to spend time on your own learning the technologies that we use (Python, Django, JavaScript, etc). \n- A commitment to providing access to education and promoting open content.<p>What life will be like: FLE is a pretty diverse group. Members enjoy playing soccer, board games, making marmalade, visiting Mexico (a 30-minute drive), doing Arduino projects, going to local San Diego Meetups, making sandcastles, bodyboarding, eating vegan food, playing various awesome instruments and learning to play new ones. We'll be organizing some fun events over the summer.<p>Application Process<p>Step 1.  Fill out our Google form: <a href=\"https://docs.google.com/a/learningequality.org/forms/d/1THHIE5xwa7bSxu8xLP05327UBtMkQX2_WDJ6Gh20XDI/viewform\" rel=\"nofollow\">https://docs.google.com/a/learningequality.org/forms/d/1THHI...</a>. No need to send a resume or transcripts.<p>Step 2.  After reviewing your application, we’ll send you an email to set up a Google Hangout or Skype session with one of our current team members.","time":1370099040,"type":"comment"}