{"by":"henrygarner","id":5804213,"parent":5803764,"text":"Likely - Shoreditch, London, UK. Full Time.<p>Clojure + Hadoop + Ubuntu + Rails + CoffeeScript<p><a href=\"http://likely.co/about/\" rel=\"nofollow\">http://likely.co/about/</a><p>Founded in 2011, Likely is already at the forefront of social media data collection and analysis having helped companies such as Coca-Cola and the British Government develop highly engaging, relevant presences online.<p>We analyse billions of social interactions – such as follows, shares and comments – to better understand how people cluster around things they are passionate about. By looking at brands as a collection of “passion points”, we have found that it is significantly easier to discover the people that are most likely to engage with a brand’s content and understand what content will resonate most with them.<p>We're looking for:<p>Software Developers. You will be expected to write Clojure for the majority of your work, whether that is delivering web services to power our internal tools and external products, or writing code to query our Hadoop cluster through Cascalog.<p>Client-side Developers. Must have good working knowledge of CoffeeScript and a desire to write rich, visual, responsive applications which present our data to our customers. You will be working on our core products and will have the opportunity to develop and shape our front end capabilities.<p>Both roles will be working closely with the CTO but will be given the responsibility and flexibility to design and build systems as part of a small, highly focused development team.<p>In return we offer:<p>• A competitive basic salary<p>• 10% of time dedicated to hack-day projects<p>• An excellent working environment with ample opportunity for progression<p>• An openness to flexible working<p>• 30 days holidays per year<p>• A company commitment to quality technology and external training<p>Please email henry@likely.co or contact us through our website.","time":1370099154,"type":"comment"}