{"by":"mackey","id":5804385,"parent":5803764,"text":"Brightcove - Boston, MA - Android<p>Brightcove is a leading online video platform.  <a href=\"http://www.brightcove.com/\" rel=\"nofollow\">http://www.brightcove.com/</a><p>Android Specialist.  We are looking for someone to join our team working on native video SDKs.  We are a small team of 3 working on iOS and Android.  We plan on expanding to other platforms, possibly Xbox, Roku, etc.  Right now we looking for someone to come in and own our Android SDK, but who also isn't afraid to hack on some iOS or other platforms if needed.<p>You:<p><pre><code>    - Have current experience working with the Android SDK,\n      though you may also have a background in JavaScript,\n      Flex/AS3, Silverlight, Cocoa, or WPF.\n    - Are able to think within the constraints of memory and\n      network availability, yet still deliver sophisticated\n      end user interactivity.\n    - Understand the importance of proper version control\n      and dependency management.  You love Git and Maven, or\n      want to teach us how to use better tools.\n    - Probably have strong opinions on programming\n      languages, tools, and software architecture, but\n      aren’t beholden to dogma – you are as interested in\n      learning from others as you are in sharing your own\n      ideas.\n</code></pre>\nUs:<p>We foster an atmosphere of learning and knowledge sharing by having regular lunch tech talks and also hosting many Boston-area developer meetups after-hours. Our engineers have 20%-time projects, unlimited vacation, freedom to work from home, and a great office overlooking the water by South Station. But these are just the perks. The real reason we’re here is to make great things.<p>Not required, but we'd be impressed if you also have:<p><pre><code>    - Experience programming with media playback technology\n      (any platform)\n    - Development experience on iOS, MacOSX, Windows Phone,\n      or game consoles (Xbox/PS3)\n    - Experience/interest in using RxJava and functional\n      reactive programming\n    - Links to published apps or your contributions to open\n      source projects\n</code></pre>\nBrightcove has more openings Boston, Seattle, and San Francisco.  In the time it takes you to read this sentence, our web player has been downloaded more than 10,000 times.  If you want a challenge, apply today at <a href=\"http://www.brightcove.com/en/company/careers/\" rel=\"nofollow\">http://www.brightcove.com/en/company/careers/</a>.","time":1370101060,"type":"comment"}