{"by":"frisco","id":5805035,"kids":[5807084],"parent":5803764,"text":"Transcriptic: Web Development, Electrical Engineering, or Mechanical Engineering<p>Menlo Park, CA<p>Transcriptic is \"Amazon Web Services\" for the life sciences. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic's central, highly automated 'biocenter' in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We're building a long-term company to completely change the way life science research and development is done.<p>We're looking for people for three types of positions: web, EE, and ME.<p>On the web side, we're looking for a highly talented full-stack web developer. On top of our robotic workcells is a slew of internal services as well as a Rails app that acts as our lab information management system and customer-facing UI. Challenges range from building rich, interactive interfaces for composing protocols to presenting analytical data generated by the lab back to the user. We use d3, Backbone, and some CoffeeScript today, but you'd be free to choose your own tools and libraries.<p>On the hardware side, you'd be part of a small functional team (2-3 people) working on developing new hardware to solve specific problems.  We have in-house rapid prototyping and you'd also work with outsourced manufacture, whether in Sunnyvale or China.  Our MCAD is Solidworks-based; most people here use Eagle for electronics but that would be up to you.  Include a portfolio of projects you've worked on before; experience in robotics a major plus.  If you have HVAC experience, note the separately, too.  PhD is a plus but definitely not necessary.<p>We're a small startup (you'd be #11), but well funded and have customers. You'd be able to work on interesting science and hard technology in a really small, all technical team with lots of freedom and resources.<p>A biology background is preferred but not strictly necessary for outstanding people.<p>max at transcriptic.com<p><a href=\"https://www.transcriptic.com/\" rel=\"nofollow\">https://www.transcriptic.com/</a>","time":1370108781,"type":"comment"}