{"by":"capkutay","id":5805733,"parent":5803764,"text":"WebAction Inc. in Downtown Palo Alto - Full Time- Hiring Front End Developers and Platform Engineers<p>Jobs@WebAction.com<p>WebAction is an enterprise infrastructure software company based in Palo Alto, CA bridging the gap between transactional and big data. The company was founded in May 2012 and it is currently in stealth mode. Founded by a team of Silicon Valley veterans with proven track records, WebAction is backed by some of the most respected names in Silicon Valley.<p>We offer a competitive salary, excellent benefits package, and generous equity for the right candidates. If you want to join our cutting-edge team, grow as we do and share the excitement of an early start-up environment please apply today.<p>Job Description: You should be a self-starting senior web UI developer with a desire to lead and mentor others. You excel in a fast-paced agile environment and will be able to collaborate with back-end engineers to design interfaces and architect interaction models, and with the product team to wire-frame and prototype ideas.<p>Desired Skills &#38; Experience for Front-end Position: \n-Excellent JavaScript knowledge necessary – please be prepared to show us examples of your work<p>-Experience with HTML5/CSS3<p>-Experience with JavaScript frameworks (jQuery, Backbone, etc.)<p>-Experience with visualization frameworks (d3, processing.js)<p>-Know how to build drag and drop web diagramming UIs (such as mxGraph, gliffy, drawio)<p>-Excellent communication skills, both written and oral<p>-Must be able to function well in an early stage startup environment<p>-Must be able to multi-task<p>Pluses: \n-Experience in user interaction design and user experience<p>-Knowledge of back-end web frameworks<p>-iOS or Android experience<p>For the Platform Engineering position, you should have the following interests/credentials:<p>Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>Candidates must currently reside in the USA. If this sounds like you, shoot us an e-mail at jobs@WebAction.com.","time":1370117187,"type":"comment"}