{"by":"donerico","id":5805496,"parent":5803764,"text":"Vancouver, BC, Canada - UX designer and server engineer (contract and full time)<p>Hey everyone, first post on HN!<p>We're RocketChicken Interactive, a start-up mobile game company in Vancouver, BC (well, technically our office is just across the road in Burnaby...) and we're working at lightspeed to develop a prototype for a follow up to CodeRunner, an alternate reality iOS game that we built in our spare time and released late in 2011. It got us noticed and got us some funding, so now the chips are down and we have to prove we can do it again!<p>Our biggest need in the short term is a UX designer with strong graphic design skills to help us shape the look and feel of CodeRunner:2. You will have an amazing amount of influence over the visual style and user experience. We really need someone who can take a project from vision to reality in a short amount of time, and who has a proven track record of working closely with a team in a highly collaborative environment. In the early stages we will need someone who can be on site most of the time. This role will start as a contract with the potential to work into a full-time position. You can find the original job posting here:<p><a href=\"http://www.rocketchicken.com/2013/05/23/mobile-game-ui-designer/\" rel=\"nofollow\">http://www.rocketchicken.com/2013/05/23/mobile-game-ui-desig...</a><p>In the more medium term, we need to find a server engineer who has a lot of experience with web services and scalable database systems. Ideally you'll be well-versed in both SQL and NoSQL solutions and can help us assess our requirements to identify the best solution. This game is going to rely heavily on a pretty sophisticated server back-end, so you'll be right in the middle of building what we think is going to be the coolest mobile game ever. ;) This is a full-time position:<p><a href=\"http://www.rocketchicken.com/2013/04/02/experienced-server-engineer/\" rel=\"nofollow\">http://www.rocketchicken.com/2013/04/02/experienced-server-e...</a><p>And if you're not interested in these positions, but want to see what CodeRunner is all about, check out the web site here:<p><a href=\"http://www.coderunnergame.com\" rel=\"nofollow\">http://www.coderunnergame.com</a><p>Thanks!<p>Ryan","time":1370114139,"type":"comment"}