{"by":"versusio_berlin","id":5806066,"parent":5803764,"text":"NODE.JS SOFTWARE ENGINEER FOR HIGH TRAFFIC SITE\nBERLIN,GERMANY, FULL-TIME, RELOCATION ASSISTANCE<p>We are looking for a talented Node.js Software Engineer for a fast growing company. URGE IO, the creator of VERSUS IO, headquarted at Media-Spree in Berlin-Kreuzberg, backed by Earlybird/Dave McClure and many more, is looking for talents building groundbreaking technologies in the field of AI and Natural Language Processing. We are one of Berlin's fastest growing companies—VERSUS IO has launched and is sky-rocketing showing an average growth of 35% per month with 25% mobile users while available in 18 languages including Chinese.<p>We offer:<p><pre><code>  - Be with an amazing team and top-notch architects\n  - Work on a high traffic product—learn and be challenged every day\n  - Contribute to a cutting-edge product employing newest technologies from day one\n  - Our product was covered by TechCrunch, Mashable, GigaOM, VentureBeat, BBC, The Next Web, Lifehacker and many more\n  - We are backed by top-notch investors including Earlybird and Dave McClure\n  - Be right in the center of Berlin's melting pot Kreuzberg right at Media-Spree, one of the coolest neighborhoods and startup - communities\n  - Be part of Europe's new tech hub Berlin and a vibrant ecosystem of smart people and many career opportunities\n  - A top salary, 100% health insurance\n  - 5 weeks of vacation\n  - Help and bonus on relocating/moving to Berlin\n  - A long-term perspective at a fast growing company\n  - Perfect software development environment\n  - We are pushing code live every day\n  - Work on a Macbook Pro Retina 15\" or a Thinkpad X1 Carbon\n</code></pre>\nWe require:<p><pre><code>  - Experience developing JavaScript-heavy applications\n  - Experience with Sinatra-like frameworks or Express\n  - Experience writing Node.js applications\n  - Experience working with NoSQL (MongoDB) and SQL databases with Node\n  - A passion for performance and scalability\n  - An obsession with keeping up-to-date with the Node.js community and the latest projects and modules\n  - Motivation and the desire to learn new technologies\n  - Company language is English—no German language skills required\n  - Team player\n</code></pre>\nBerlin is calling and getting the new tech hub of Europe! If you are passionate about building great software, we’d love to talk with you. If you don't live in Berlin yet, we could help to fix that.<p>To apply or in case you have questions just send us an email with your CV and a short note about yourself to:<p>career (at) urge (dot) io<p>More infos about us on <a href=\"http://urge.io/jobs\" rel=\"nofollow\">http://urge.io/jobs</a>","time":1370121732,"type":"comment"}