{"by":"elemeno","id":5806085,"parent":5803764,"text":"London (N/NW), UK - Permanent (no remote)<p>C#/ASP.Net Developer - Help bring the NHS into the 21st Century<p>Job Description<p>We're looking for smart self-motivated developers who can bring their own ideas to the table and get excited about the products we're building. You'll be working on a range of different projects - anything from designing and building new features into our products, to working on database optimisations, to building text processing and analysis tools. We're expanding rapidly so there will be plenty of opportunities to take on more responsibilities and grow with the role.<p>Our core product is a digital transcription platform that includes both desktop components and web components as well as integrating with various data services and voice recognition services. We're pushing to move to a purely web based solution, but there's still some interesting problems to solve around how you use client-side hardware like digital voice recorders from a browser. We're also starting to build a suite of data analysis tools on top of all the data we've got to do thing like automatic document taging and coding - there's plenty of interesting challenges ahead!<p>Skills &#38; Requirements<p>Essential<p><pre><code>    - C# 3.5/4.0\n    - ASP.Net MVC 3/4\n    - SQL (SQLServer)\n    - WCF\n</code></pre>\nNice To Have<p><pre><code>    - Server Side .Net Development\n    - HTML/CSS + JavaScript\n    - .Net Web App Deployment\n    - SQL Server Query Tuning\n    - Refactoring\n    - ClickOnce Deployment\n\n    </code></pre>\nAbout The Company<p>DictateIT are the leading provider of outsourced transcription and Digital Dictation services to the NHS and due to continued growth we're looking to expand our in house development team to build the next version of our dictation platform as well as the suite of tools we're building on top of the platform. We're looking for a mix of junior and more experienced developers to join our team and we'll be looking to hire more than one person. We're a small but friendly company who believe in working sane hours and going out for a drink afterwards.<p>We're looking to pay fair salaries - up to £30k for Junior Devs (one or two years experience) and up to £50k for more senior developers - and we want to provide an environment that you'll enjoy working in. We're moving to a new office in a few months time that's being designed just for us and which should be a pretty plush working environment!<p>If you're interested or you've got questions drop me an e-mail at tech.recruitment@dictate.it","time":1370122002,"type":"comment"}