{"by":"hseikaly","id":5818978,"parent":5803764,"text":"New York, NY<p>R&#38;D Ventures, The New York Times - Software Engineer<p><a href=\"http://jobs.nytco.com/job/New-York-Software-Engineer-Job-NY/2549994/\" rel=\"nofollow\">http://jobs.nytco.com/job/New-York-Software-Engineer-Job-NY/...</a><p>The R&#38;D Ventures team is seeking a Software Engineer.  R&#38;D Ventures (<a href=\"http://nyti.ms/10hrYe1\" rel=\"nofollow\">http://nyti.ms/10hrYe1</a>) is an agile and entrepreneurial group tasked with commercializing ideas and technologies coming out of the R&#38;D lab (<a href=\"http://nytlabs.com\" rel=\"nofollow\">http://nytlabs.com</a>).  We need a creative and talented engineer to work on one of our inaugural products Ricochet (<a href=\"https://ricochetmedia.net\" rel=\"nofollow\">https://ricochetmedia.net</a>) as well as other projects coming down the pipeline.<p>As a Software Engineer on the R&#38;D Ventures team, you will be working on solving complex and interesting problems. To handle some of the problems you will need to brainstorm on ideas that require knowledge of many aspects of Computer Science including but not limited to: information retrieval, data storage, distributed computing and processing, algorithms, security, etc.<p>Although you will be working on a team that typically uses Python and MongoDB for their day to day tasks, we strongly believe that a programming languages and technologies are merely tools that aid in accomplishing a goal. We also believe in using the right tool for the right job, so as a member of the team, you may be required to create prototypes with unfamiliar technologies on a fairly regular basis.<p>Minimum Qualifications:\n- Bachelors degree in Computer Science or a related technical discipline (in lieu of degree 4 years relevant work experience)\n- 2 to 4 years of relevant work experience with large systems software design and development skills\n- Extensive programming skills with strong Object Oriented programming skills (Java/C++/Python).\n- Solid foundation in computer science with competencies in data structures and algorithms.\n- Experience building software in a team based environment using a Source Code Management System (Subversion, Git, Mercurial etc.)<p>Preferred Qualifications:\n- M.S or PhD in Computer Science or related field\n- Understanding of Relational (MySQL, Oracle etc.) as well as Non Relational (NoSQL) Database systems (MongoDB, CouchDB, Redis, Hadoop, HBase etc).\n- Prior experience building web based API's.\n- Prior experience integrating with 3rd party API's (Preferably Facebook and Twitter API's).\n- Experience developing for Unix/Linux based systems.\n- Experience with asynchronous data processing using queuing systems (Beanstalkd, RabbitMQ etc.)\n- Familiarity with software deployed in a Cloud based system such as AWS or Rackspace cloud.\n- Familiarity with Agile development methodologies such as Scrum<p>If you would like to learn more about this, email peter [dot] ng [at] nytimes [dot] com.<p>Thanks!","time":1370349019,"type":"comment"}