{"by":"yourabi","id":5834629,"parent":5803764,"text":"I know of an interesting company hiring -<p>Chief Software Architect - San Carlos, CA. Full time.<p>Burstorm provides a unique solution for any organization that is both focused on reducing the cost of compute, storage, datacenters and networks, while also providing infrastructure that can respond to the ever increasing demands of the business.<p>Burstorm enables its customers to know how their IT cloud infrastructure compares to the market, what options are available and decide which new cloud services to acquire using a combination of software and people.<p>This position is a great opportunity to join a profitable and mature Cloud Startup (we know that seems like a contradiction but when you meet us you will understand) and have a major impact. We are looking to grow our team with the following position:<p>Responsibilities:\nAs the main developer the Chief Software Architect will:\n Be a key member of the office of the CTO helping shape the future of Burstorm application services.\n Drive the software architecture design and deployment of our next generation services.\n Create mock-ups, prototypes and other tools to present new concepts and ideas.\n Create the Software Infrastructure foundation for our next generation platform.\n Lead integration efforts with 3rd parties as needed.\n Be flexible and able to adjust to rapidly changing environments and learn quickly<p>Skills/Qualifications:<p>The successful candidate has the following characteristics:\n Broad and deep exposure to several development platforms and technologies, preferably in context of cloud services. \n Capable in building an end to end application from UI to database, in the cloud but no need to be an artist.\n Proven experience with Ruby On Rails 3.2, PostgreSQL 9.2, Elastic Search, Chef, Capistrano and Ubuntu Linux 12.04 LTS\n Familiarity with RabbitMQ, Twitter Bootstrap, jQuery, CoffeeScript, nginx, Puma and Google apps highly desired. \n Familiar with compute and storage, datacenter and network technologies.\n Familiar with the math of modeling and optimization.\n Ability to learn and adapt to new technologies quickly<p>Send email to edward .at. burstorm.com","time":1370546873,"type":"comment"}