{"by":"mayberryrecruit","id":5851630,"parent":5803764,"text":"DATA SCIENTIST - RALEIGH, North Carolina, United States<p>Responsibilities\nIdentify new data sources that will improve online targeting efforts\nEstablish links across existing data sources and find new, interesting mashups\nWork closely with statisticians to identify, design and build appropriate datasets for complex experiments\nCoordinate data resource requirements between analytics team and engineering team\nDevelop tools and libraries that will help analytics team members more efficiently interface with huge amounts of data\nHelp develop algorithms and predictive models to solve critical business problems\nCreate informative visualizations that intuitively display large amounts of data and&#x2F;or complex relationships\nWork with product managers, engineers and analytics team members to translate prototypes into production<p>Qualifications\nHighly motivated individual with degree(s) in CS or applied quantitative field (math&#x2F;statistics, economics, engineering).\nMinimum of 3-5 years working with relational databases\nAbility to write and execute complex SQL queries to extract&#x2F;process data.\nStrong analytical skills\nExperience in programming with JAVA, Python, Perl.\nExperience with statistics software (prefer R, SPlus, MatLab)\nWell versed in UNIX command line utilities (Sed, awk, etc.) and experience using these tools to clean&#x2F;process very large and often very messy datasets\nCoursework or practical experience with data mining, machine learning, building algorithms, applied math and statistics a plus\nDeep knowledge of various data sources (government, open source APIs, point-of-sale, proprietary sources, etc.) and experience in linking them\nExperience with very large datasets a must. Knowledge of map&#x2F;reduce framework (hive&#x2F;pig other tools for accessing data in Hadoop&#x2F;HBase cluster systems) a plus<p>Relocation offered:\n$80K-$125K<p>Please submit resume at <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;14tbv22\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;14tbv22</a>\nor contact Muriel Mayberry at muriel@hansenrecruiting.com","time":1370826231,"type":"comment"}