{"by":"thecodemonkey","id":5868790,"parent":5803764,"text":"Washington D.C., Full Time Front-End Developer<p>Engage, an interactive agency that provides technology and strategy to Fortune 500 companies, political organizations, and nonprofits, is looking to add a Front-End Developer to our already-strong bullpen of developers. Unlike much of our competition, all of our development and creative work is produced in-house, so you’ll be working directly with our team of designers and developers.<p>This is a full-time position and you must be able to work on-site in Washington, DC. We provide competitive salaries and a generous benefits package (plus snacks and free energy drinks, if that’s your thing). We also encourage (read: subsidize) our developers to go to hackathons and relevant conferences.<p>Must-haves:<p><pre><code>  * Strong experience with CSS3, HTML5 and JavaScript and able produce clean, standards-compliant markup\n  * Experience with several (ideally all) of the following: jQuery, Backbone, Underscore, RequireJS, Twitter Bootstrap, Media queries&#x2F;Responsive design, Cross-browser compatibility, testing &amp; support\n  * Strong grasp of UX\n  * Understands and pursues pixel perfection for every site &amp; project\n  * Skilled with Photoshop &amp; the Adobe Creative Suite\n  * Comfortable working on tight deadlines and in a team environment\n  * In general, a nice person to be around who enjoys tackling challenges and learning new skills\n </code></pre>\nBonus points if you:<p><pre><code>  * Have some experience with WordPress, Expression Engine, and&#x2F;or Drupal\n  * Have a basic understanding of PHP or MySQL\n</code></pre>\nTo apply, please include your resume, work samples, and a brief description of why you’re interested in the position. For work samples, please provide links to live projects you’ve worked on (and your GitHub profile, if you have one).<p>More information and apply here: <a href=\"http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;VzN338&#x2F;Front-End-Web-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;VzN338&#x2F;Front-End-Web-...</a>","time":1371053066,"type":"comment"}