{"by":"leeny","id":3182115,"kids":[3182997],"parent":3181796,"text":"San Mateo, CA - Full time - American Efficient (<a href=\"http://www.americanefficient.com\" rel=\"nofollow\">http://www.americanefficient.com</a>)<p>We're currently looking for both front-end and back-end engineers.  If you’re really smart, love to build stuff, and want to work on something that will, in a very real, non-cliche kind of way, make the world a better place, please contact alerner@americanefficient.com.<p>---------------<p><i>FRONT-END</i><p>We’re looking for someone who can become our resident master of HTML, CSS, and JavaScript; essentially you will lord over all things front-end.  The position itself is somewhat open-ended, in that we would love to shape the specific role to accommodate your strengths and interests, within reason.  Some of the kinds of things you'd work on include:<p><pre><code>   * work with the back-end engineering team to create scalable and responsive\n     products that entice end-users to make energy efficient purchases\n   * create beautiful, cutting edge UIs that deliver great user experience to both\n     consumer and enterprise users\n   * build out our UI framework\n   * help build a flexible A/B test framework\n   * be a HTML/CSS/JavaScript resource to our design and back-end engineering teams\n</code></pre>\n<i>Requirements:</i> really solid HTML/JavaScript/CSS, portfolio of sites you've created in the past, ability and interest in staying current with trends and technologies.\n <i>Nice-to-haves:</i> Design ability, PHP, experience with social application development (Facebook, Twitter, etc.)<p>---------------<p><i>BACK-END</i><p>As a back-end generalist, you will work all across our platform on a variety of interesting problems ranging from data mining and search relevance to scaling and architecture.  If you’re really smart, love to play around with the kinds of data retrieval/manipulation challenges that make mere mortals weep, love architecting clever solutions to all manners of design challenges, and would like to define your role based on your strengths in this arena, you are going to love this job.  Essentially, we’re still building out big pieces of our platform, and this could be an awesome opportunity to create something truly meaningful and interesting.  To give you an idea of the kinds of things we’re working on in this realm, take a look at the list below:<p><pre><code>   * out of many potential data sets, which should we display and what order\n     should we display them in?\n   * doing the above really, really fast\n   * architecting and scaling a reporting and analytics system to deliver fast\n     and reliable numbers to drive decisions both internally and for our partners\n   * developing heuristics to do fuzzy data matching between data sets with\n     different structures and formats\n   * feature design, including deciding the depth of customization and balancing\n     tradeoffs of complexity, responsiveness, flexibility in the future, and\n     administrative overhead\n   * database design, including schema, indexes, query optimization, partitioning,\n     and database abstraction\n   * building levels of caching to allow us to scale, including investigation of\n     different caching options and subsequent implementation of caching\n     technologies\n   * building platform infrastructure, which can include A/B testing, reporting,\n     APIs, etc\n</code></pre>\n<i>Requirements:</i> B.S, M.S., or Ph.D in Computer Science or equivalent, experience scaling systems, significant experience w/databases.\n<i>Nice-to-haves:</i> MySQL, PHP, mobile experience<p>---------------<p><i>COMPENSATION &#38; BENEFITS</i><p><pre><code>   * Salary commensurate with experience\n   * Meaningful equity stake in the company\n   * Benefits (medical, dental, vision)\n</code></pre>\n---------------<p><i>THE COMPANY</i><p>American Efficient is a well-funded startup in the clean energy sector.  We’re changing the way consumers and business owners make product choices for their homes and commercial properties - namely tipping decision makers to energy efficient choices through a platform approach.  We're working on hard problems related to big data, platform development, search, mobile, and more.<p>The team includes repeat Internet entrepreneurs who have had tremendous success (Reputation.com, Trialpay) and who hail from MIT, Stanford Engineering, the Stanford Graduate School of Business, Stanford Law, and Penn. Our advisors include a Nobel Prize-winning academic and the VP of Business Development of Groupon who was instrumental in growing that company from one city and ten employees to the group buying giant that it is today.<p>Our office is located in downtown San Mateo, CA, one block from Caltrain.  In the office, you will find, among other things, mandolin-playing interns and a very cute golden retriever puppy.","time":1320157112,"type":"comment"}