{"by":"gducharme","id":3186686,"parent":3181796,"text":"Medidata is a leading provider of software as a service solutions for clinical trial management and execution. We assist our clients who have developed a compound, device, or procedure to prove that it is safe and effective by designing and planning a clinical trial, recruiting participants, executing a trial, collecting data, analyzing the data for safety and efficacy, generating the submission materials, and then submitting those materials to the appropriate regulatory agency for regulatory approval. The Medidata clinical service platform is built on the principles of distributed computing and service oriented architecture.<p>Medidata is located in Manhattan. We have a flexible office culture that allows people to work from home. We value face-to-face communication and use technology to promote that in a distributed environment. We keep teams small and self organizing. We demand quality. We like to ship our code into the cloud frequently using Chef and OpsCode. We are dedicated to agile development. Because we handle sensitive and potentially urgent medical information concerning the health of real people we take testing very seriously. All engineers write tests first.<p>Medidata values innovation and research. We support research projects through innovation time that allows qualifying engineers to devote 15% of their time to individual research projects. We value and support open source software. We expect our engineers to continuously be questioning, researching, simplifying, learning, and improving. The open source world moves fast and we expect all of our engineers to be in the lead.<p>What we are looking for:\nMedidata is looking for Ruby and Rails engineers or for talented engineers interested in learning Ruby and Rails. We expect our Rails engineers to be database savvy and excited to run a query profiler. We want engineers interested in MySql, NoSql, and graph databases. Candidates should not be scared of big O notation and like to consider space and time characteristics of their data structures and algorithms. Candidates will work with Unix, Git, Ruby, Css, Javascript, Chef, Goliath, EventMachine, MySQL, NoSQL, and lots of Cucumber and RSpec. They know HTTP. Candidates care about building simple, intuitive, user experiences. They know REST is more than clean URLs. They want to design small, isolated, highly available, fault tolerant, scalable services. We like our candidates to be curious. Candidates should like to get their hands dirty. They are fanatical about quality. They are fanatical about performance.","time":1320242838,"type":"comment"}