{"by":"earthaid","id":3196431,"parent":3181796,"text":"MyEnergy - Boston, MA - Full-time Data &#38; Rails Engineers, VP Engineering to build the People's Energy Internet<p>MyEnergy ( <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a> ), formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We have small offices in San Francisco and DC, and we're now consolidating our dev team and HQ into an awesome brand new headquarters --- a sunny two-story loft --- in downtown Boston.<p>We empower households to track &#38; contextualize their electric, natural gas, and water utility usage. We value data, clarity, focus and beauty. We are looking for people who do too --- people who want to work on incredibly complex problems and come up with solutions that will change the world. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption.<p>To learn more about our very competitive salaries, excellent benefits, fun company culture, and small arsenal of office helicopter drones, check out: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, (or our new careers page under construction at: <a href=\"http://www.myenergy.com/engineering\" rel=\"nofollow\">http://www.myenergy.com/engineering</a> ) and send us an e-mail at jobs at myenergy dot com","time":1320421123,"type":"comment"}