{"by":"stuffihavemade","id":3206725,"parent":3181796,"text":"REMOTE [Full Time]<p><a href=\"http://www.trackabout.com\" rel=\"nofollow\">http://www.trackabout.com</a><p>apply at <a href=\"http://trackabout.theresumator.com/apply/njfPJu/Senior-WebMobile-NET-Software-Engineer-Telecommute.html\" rel=\"nofollow\">http://trackabout.theresumator.com/apply/njfPJu/Senior-WebMo...</a><p>TrackAbout is a profitable and growing software company providing asset tracking and rental services via the internet using a Software as a Service (SaaS) business model. Our customers use a variety of mobile devices to record the movements of their valuable assets.  Data is stored and made available through our hosted web site and web services. Visit trackabout.com for more information on what we do.<p>We are experiencing high demand for our services and we are growing. We need great people who are interested in playing pivotal roles in the growth of a small company. Our customer base is very dependable and we consider ourselves lucky to be doing well even in this soft economy.<p>We are seeking an exceptional and experienced developer who is truly passionate about technology and the craft of software development.<p>This is a full-time position, not a contract.<p>Our development staff is completely virtual (no office) and each developer works from home. We are not considering applicants outside the U.S.<p>You'll be working on all aspects of the TrackAbout offering including our ASP.NET website and web services, MS SQL Server and developing for various mobile devices. Your responsibilities will include designing and building new features, enhancing existing features, and fixing (gasp) bugs.<p>All members of our development team are dedicated to keeping up with the latest technologies, practices, patterns and tools related to software development. We take time out to share our knowledge with one another and improve both our skills and our distributed development environment. We often experiment with and integrate new tools into our environment. Some of the tools and technologies we're currently using include: ReSharper, Subversion, MassTransit, Jenkins CI, TDD with NUnit, VersionOne, MediaWiki, WCF, RESTful web services, RhinoMocks, Ninject, NHibernate and jQuery.<p>Required Technical Skills:<p><pre><code>    Building web-based applications and web services\n    Object-oriented programming fundamentals\n    C#\n    ASP.NET WebForms (MVC in the future)\n    HTML/CSS/javascript\n    MSSQL programming skills (sprocs, udfs, triggers, indexes, constraints, etc.)\n    XML/XSD/XSLT\n    Experience with SCM/version control\n</code></pre>\nNice-to-Haves:<p><pre><code>    Experience with common OO design patterns\n    Test-driven development (TDD)\n    Mobile device development\n    I18N and L10N development experience\n    Experience in Agile environments\n</code></pre>\nSince this is a work-at-home position, you'll be expected to be able work independently and unsupervised, but with clear goals and direction. We are quality- and results-oriented and we don't micromanage.<p>We look for the following:<p><pre><code>    Passion\n    Solid interpersonal, organizational and task-management skills\n    Insatiable curiosity, a love of learning and a desire to continuously improve\n    Friendliness\n    Team-orientation\n    Fanatical attention to detail</code></pre>","time":1320681536,"type":"comment"}