{"by":"TommyWu","id":3223461,"parent":3181796,"text":"San Francisco, Lead Python Developer<p>At Tribal Crossing we work on creating games with deep story lines and engaging characters, something missing from most Facebook games today.  Tribal Crossing is looking for a strong software engineer to lead the future development of our backend game engine, refine our custom system for expressing game logic and flow, and develop new games from the planning stage to post-launch.<p>What we're NOT:<p>* We're NOT working in a sweatshop making clones of Zynga games<p>* We're NOT making reskins of Evony, Kingdoms of Camelot, Atlantis, etc<p>* We're NOT letting metrics rule our lives (Star Wars wasn't created through metrics)<p>What we ARE:<p>* We ARE making games that are focused on delivering amazing story lines<p>* We ARE creating characters that players will care about<p>* We ARE building tools that will allow allow content creators to do 1 and 2<p>Why You Should Apply:<p>* TECHNOLOGY: We embrace cutting edge technology if it saves us time in the long run. Ask us about how we wrote our own DSL that in turn generates code for serializing game data and defining API routes. Or perhaps watch our webinar with Membase about how we are able to support millions of users with NO sysadmin and a tiny team. Bigger doesn't always mean better, if you know how to use the right tools.<p>* INNOVATION: We have built a wide range of tools and processes that greatly reduce both low level work and endless cross-functional meetings. By making sure team members are unblocked and focused on high value activities, we're able to spend more time on adding innovation to our games.<p>* IMPACT: We've signed some long term deals with publishers that want to distribute our games on the web and mobile platforms. We are looking for folks that want to join on this initial traction and help take it to the next level. We will be asking for your opinion so be ready to have one.<p>If that sounds interesting, you should apply here: <a href=\"http://www.tribalcrossing.com/jobs/\" rel=\"nofollow\">http://www.tribalcrossing.com/jobs/</a>","time":1320987324,"type":"comment"}