{"by":"speek","id":8252849,"parent":8252715,"text":"Weft - <a href=\"http://weft.io\" rel=\"nofollow\">http:&#x2F;&#x2F;weft.io</a> - Cambridge&#x2F;Boston, MA (office is in central sq.)<p><pre><code>   ===========================\n   ====== What we do =========\n   ===========================\n</code></pre>\nWe&#x27;re the single source of truth in logistics data -- we track every boat on the water, every plane in the sky, and every truck on the ground so that we can know everything that&#x27;s going on in the logistics world. We do a lot of analysis and optimization, too.<p>We’re working in the largest, least sexy, most invisible industry in the world — 90% of everything has been on a ship at one point in time.<p>The problem -&gt; To try to decrease costs, carries have been increasing the size of container ships. The only problem there is that as container ships get larger, the variability in the global supply chain goes up (e.g. a large ship being late causes a headache to more people than a small one).<p>How we fix it -&gt; We track every ship on the water and run a bunch of analysis on our data sets so that we can help our customers smooth out the rough edges. (One company we&#x27;re working with spends 6.5 mil every month on “late fees” because of these rough edges).<p><pre><code>   ===========================\n   ===== How we do it ========\n   ===========================\n</code></pre>\nWeb&#x2F;data stack -&gt; clojure + postgres&#x2F;cassandra&#x2F;redis&#x2F;rabbit + ruby on rails + hadoop&#x2F;EMR (we’re a SOA shop)<p>Mobile -&gt; iOS, android in the near term<p>Algorithms -&gt; a dizzying mixture of oldschool and newschool techniques ;-)<p><pre><code>   ===========================\n   ====== And the rest =======\n   ===========================\n</code></pre>\nWe&#x27;ve got some very interesting partners and customers (ranging from CPG companies and telcos to enterprise software providers to regional and international logistics companies). We also have some top tier investors (a16z, atlas)!<p>Looking for help on frontend and data science sides! (also looking for experimentalists for fun hedge fund stuff)<p>If this sounds interesting, please shoot me an email at marc@weft.io!","time":1409580329,"type":"comment"}