{"by":"iis_zephyr","id":8252813,"parent":8252715,"text":"South Lake Tahoe (Zephyr Cove, NV)<p>Informa Investment Solutions, Inc. is seeking both a senior and a junior developer to join our web applications team at our office on the shores of Lake Tahoe. If you love designing and building modern, responsive web applications that make it easy for business users to run sophisticated investment analysis software, we would like to talk to you. We’re an established company with actual paying customers and we want to make our little corner of the world a better place for our users.<p>We use standards-based HTML, JavaScript and CSS, along with state of the art technologies – Canvas, SVG, RequireJS, Backbone, Marionette, and LESS – to build cross-browser interfaces and advanced data visualizations. The backend is a mixture of C#, Java, C++ because we believe in using the right tool for the job, and we are regularly evaluating our tools to ensure that. Our development process is agile and we release our web products approximately once a month.<p>Our offices are a five minute walk from the Nevada shore of Lake Tahoe and Heavenly ski resort is a fifteen minute drive from the office. As a developer you’ll also get your own private office and even though we mostly develop on Windows, all our developers have Mac hardware. We prefer to hire generalists who are as curious and excited about technology as we are. All of us enjoy learning new technologies and tools; we have a small team and each developer should be able to work on every aspect of the system.<p>To get a feel for one of our software products, please visit zephyrondemand.com and click Try Zephyr Analytics.<p>Please note: these are full-time positions in our Zephyr Cove office. We do permit senior developers (5+ yrs. relevant experience) to work remotely, but total travel time to the Zephyr office can be no longer than 3 hours. If you&#x27;re interested, please email matt.motherway -at- informais.com (and put “Hacker News” in the subject). Thank you.","time":1409579811,"type":"comment"}