{"by":"5vforest","id":8252920,"parent":8252715,"text":"Ruby Developer to Fix America\nDepartment of Better Technology\nHeadquarters: USA\n<a href=\"http://www.dobt.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.dobt.co</a><p>About us<p>We’re the Department of Better Technology, a Knight Foundation-funded startup that’s digging into the guts of government and trying to fix it with technology.<p>Job Details<p>We&#x27;re hiring a web developer to help us revolutionize the world of government IT. We started this company after being embedded inside government and seeing first-hand the horrors of the technology that these folks have to use everyday. We worked on a project called RFP-EZ that made it super simple to view and bid on government contracts. It wasn&#x27;t anything amazing -- just a simple Bootstrap site, but just by making this process easier to understand for web firms who don&#x27;t specialize in government contracting, we were able to save the federal government an average of 30%.<p>We&#x27;ve been in business for a just under a year, and have already created dozens of success stories - governments who are using our software to save staff time, save money, and provide better experiences for citizens. We&#x27;re looking to grow our team and help us scale this success to governments across the country.<p>Experience<p>We&#x27;re looking to bring on a developer who fits the following:<p>You are experienced in Ruby and ideally, Rails\nYou have strong knowledge of SQL&#x2F;Postgres\nYou have a passion for good user experience and are excited about frontend development, too\nYou are comfortable working with a 100% distributed team\nAnd last, but perhaps most important, you are as passionate as we are about our mission to revolutionize government IT<p>Our Culture<p>For many people in the technology industry, DOBT is a different kind of place to work, and a different set of people work here. Usually, they’re people who value time more than they value money. While from time to time, circumstances may call for it, you aren’t going to see a lot of 80 hour weeks, and depending on your time zone you might see some people who clock out at around 6.<p>You’re probably not going to be in a work environment that has a foosball table, catered lunches, and its own mass transportation either. That’s because we’re a fully remote firm. While some people may opt to work together in the same space, we want people to work from wherever they feel like it. So if you’ve always wanted to live in Japan, now’s your chance.<p>Diversity<p>DOBT is an equal opportunity employer. We will not discriminate and will take measures to ensure against discrimination in employment, recruitment, advertisements for employment, compensation, termination, upgrading, promotions, and other conditions of employment against any employee or job applicant on the bases of race, creed, color, national origin, or sex. We are committed in all areas to providing a work environment that is free from harassment.<p>How to apply<p>Fill out the form on Screendoor: <a href=\"https://screendoor.dobt.co/dobt/developer-hiring/\" rel=\"nofollow\">https:&#x2F;&#x2F;screendoor.dobt.co&#x2F;dobt&#x2F;developer-hiring&#x2F;</a> (yay for dogfooding!) Alternatively, send a note to sdp-response-hclhimz1@in.dobt.co. USA&#x2F;Canada only, sorry. Recruiters and agencies will be marked as spam.","time":1409581000,"type":"comment"}