{"by":"jzarge","id":8252930,"parent":8252715,"text":"Principal&#x2F;Senior Software Engineers- Application Development C++ (New Product&#x2F;Team) - Burlington, MA USA<p>POSITION PROFILE:\nYou will one of the founding members of the PowerFLOW Studio team. This is a high visibility product that will consolidate Exa&#x27;s pre-processing, post-processing, and run submission&#x2F;monitoring tools into one integrated environment with a focus on multi-run projects, multi-run analysis, and design optimization studies. PowerFLOW Studio will provide a platform for future additions to Exa’s technology portfolio.<p>We’re at the early stages of designing and implementing PowerFLOW Studio. The tool will have a variety of major capabilities, including data visualization, both desktop and web interfaces, database access, remote job execution, support for design optimization studies, and job management controls. In these projects, a particular emphasis will be placed on usability (intuitive controls and user work-flow), performance (CPU &amp; memory usage, file I&#x2F;O, etc.), and extensibility.<p>Exa’s work environment is informal, collaborative, and supportive of individual growth in talent and leadership. As part of our small development team, you will:<p><pre><code>  • Be responsible for the design and implementation of new product features as well as the maintenance of existing functionality.\n  • Make significant contributions to PowerFLOW Studio from day one and expected to take ownership of various portions of the product.\n  • Coordinate the input of a variety of domain experts (for example, aerodynamicists) as design considerations, so technical communication and comprehension skills are very important.\n  • Produce functional and technical designs which effectively balance customer needs and implementation considerations, so a clearheaded and methodical approach to problem solving is also very important.\n  • Provide technical leadership to other developers on the team.\n </code></pre>\nREQUIREMENTS:\nThe ideal candidates would meet all of the following requirements, but we will seriously consider candidates who combine demonstrated software development talent with an eagerness to learn new skills. You should possess most of the following:<p><pre><code>  • BS or MS in Computer Science, Engineering, Mathematics or a related discipline\n  • 2 - 7 years experience designing and developing complex commercial software systems\n  • Excellent C++ programming skills and familiarity with STL\n  • Solid grounding in computer science theory\n  • Intellectual curiosity. Regardless of your background, you will encounter new technologies  and problem domains here. A natural curiosity is a great asset in this environment.\n  • Experience designing and implementing graphical user interfaces using a high-level toolkit (ideally Qt) on Windows and&#x2F;or Linux\n  • Excellent English written and verbal communication skills\n  • Solid organizational skills; Able to handle multiple tasks&#x2F;projects simultaneously\n  • Strong problem-solving skills; ability to thrive in a fast-paced, challenging environment; strong desire to learn.\n </code></pre>\nAdditional Skills &amp; Experience:\nExperience with one or more is a plus:<p><pre><code>  • Usability concerns as they apply to user interface design\n  • Python scripting language\n  • General Computer Aided Engineering (CAE) familiarity\n </code></pre>\nCOMPENSATION AND BENEFITS:\nExa offers competitive compensation, stock options and a dynamic, growing company environment.  Benefits include comprehensive coverage for medical, dental, life, disability, flexible spending accounts, 401K savings plan with company match, vacations and holidays, flexible work schedule and free access to our on campus fitness club, classes and amenities center.<p>TO APPLY:\nFor immediate consideration, please send your resume to vizjobs@exa.com with the Job Title: Principal&#x2F;Senior Software Engineer - Studio in the Subject line.\nExa Corporation\n55 Network Drive\nBurlington, MA  01803\nvizjobs@exa.com\nwww.exa.com","time":1409581094,"type":"comment"}