{"by":"gpjt","id":8252885,"parent":8252715,"text":"PythonAnywhere (<a href=\"http://www.pythonanywhere.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pythonanywhere.com&#x2F;</a>) - London, UK<p>Fancy helping to build the Python world&#x27;s favourite PaaS (probably)? We&#x27;re looking for a &quot;junior&quot; programmer with plenty of smarts to come and join the team, learn the stuff we do, and inject some new ideas...<p>Job spec<p>Here&#x27;s some stuff you&#x27;d be doing:<p>Working in an Extreme Programming (XP) shop, pair programming and TDD all day, woo[+].<p>Coding in Python lots and JavaScript a bit, and maybe other stuff too (OK there&#x27;s like 5 lines of Lua code somewhere. But you could come along and try and convert us all to ClojureScript or something...)<p>Devops! Or what we take it to mean, which is that you deploy to and administer the servers as well as write code for them. Lots of Linux command-line goodness in SSH sessions, and automated deployment stuff.<p>Sexy CV-padding technologies! Like Docker, nginx, websockets, Django, copy-on-write filesystems, Ansible, GNU&#x2F;Linux (Ubuntu), virtualbox, vagrant, continuous integration, AWS, redis, Postgres, and even Windows XP! (although we&#x27;re phasing that last one out, to our great chagrin). Don&#x27;t worry, you don&#x27;t have to know any of these before you show up, you&#x27;ll get to learn them all on the job...<p>Learn vim (if you want to) much faster than you would on your own by being forced to pair program with vim cultists all too happy to explain the abstruse keyboard shortcuts they&#x27;re using...<p>Get involved in the nonprogramming aspects of the business too (we all do!), like customer support and marketing. Honestly, that can be fun too.<p>Work near enough to Silicon Roundabout that you can walk to the Hacker News meetups, but not so near that you&#x27;re forced to overhear bad startup ideas being pitched in every coffee shop<p>[+] The pair programming thing is an unbelievably good deal for new developers btw, there&#x27;s just no faster way of learning than sitting down next to someone that knows and being able to ask them questions all day, and they&#x27;re not allowed to get annoyed.<p>Person spec<p>Here&#x27;s the kind of person we&#x27;d like<p><pre><code>  * Smart -- academically or otherwise. A degree (CS or other), won&#x27;t hurt, \n    but it&#x27;s not required either.\n  * An enthusiastic programmer (but not necessarily Python and not necessarily \n    professional)\n  * A bit wacky (which doesn&#x27;t mean you have to be an extrovert, just \n    inclined to left-field ideas)\n  * Willing to come and work here in sunny Clerkenwell\n  * Willing to get paid less than you would at Google or a bank, in exchange \n    for working in an exciting but relaxed tech-startup environment\n</code></pre>\nHere&#x27;s some stuff we don&#x27;t care about:<p><pre><code>  * Age\n  * Male&#x2F;Female&#x2F;Black&#x2F;White&#x2F;Number of functioning limbs&#x2F;Space alien.\n  * Gaps in CVs\n  * Current country of residence (as long as you&#x27;re willing to move here promptly! \n    You do need to be able to speak good English, and unfortunately we&#x27;re \n    too small to sponsor visas, so you need to already have the right to live \n    + work in the UK)\n  * Dress codes\n</code></pre>\nSend us an email telling us why you&#x27;d like to work here, and a current CV, to jobs@pythonanywhere.com","time":1409580690,"type":"comment"}