{"by":"superimmo","id":8253033,"kids":[8253793],"parent":8252715,"text":"Superimmo.com - Développeur full-stack - Ruby - INTERN - Paris - FR<p>Le Projet :<p>Start-up dans l&#x27;immobilier, nous avons besoin de vous pour refondre et améliorer en continue notre site et service  Superimmo.com\nNotre ambition est d&#x27;offrir dans les futurs versions du service la meilleure expérience à l&#x27;internaute à la recherche d&#x27;un bien immobilier à la vente ou à la location.\nRendre le service toujours plus simple, rapide et pertinent seront les objectifs qui vous guideront dans votre travail au quotidien.\nNotre site web est une app Rails. Vous travaillerez à la fois sur la backend et le frontend.<p>Votre profil :<p>Nous recherchons une personne avec de l&#x27;expérience et ayant un profil full-stack.\nVous prendrez part à la refactorisation du code historique.\nNous itérons rapidement, et déployons plusieurs fois par jour, il vous faudra donc être consciencieux.\nVous travaillerez en étroite collaboration avec tous les membres de l’équipe.<p>* Au moins 1 ans d’expérience dans le développement,\n\t* Maîtrise de Ruby et du framework Ruby on Rails 4.x,\n\t* Familiarité avec l’état de l’art du développement (tests, revues de code, intégration continue, documentation de l’architecture, etc.),\n\t* Bonne expérience du JavaScript&#x2F;CoffeeScript, HTML, CSS&#x2F;SASS,\n\t* Maitrise de Postgresql, de l’utilisation et des performances des bases de données.\n\t* Bonnes connaissances en Php,\n\t* Bonne maitrise de l’orthographe et de la grammaire,\n\t* Autonomie, auto-gestion et capacité à prioriser le travail<p>Bonus points :\n\t* Maitrise d&#x27;un Framework Js (Angulare&#x2F;EmberJs),\n\t* Connaissance en Machine Learning &#x2F; BigData,\n\t* Maîtrise du Java, Python,<p>Notre stack inclu :<p>Ruby, Postgresql, Redis, Mahout, Hadoop, DynamoDB, Js\nNginx, Chef, Capistrano, Git, AWS, New Relic<p>Ce que nous proposons :<p>* Un poste en CDI\n\t* Rémunération en fonction de votre niveau d’expérience\n\t* Une expérience stimulante et pleine de challenges au sein d’une équipe jeune et motivée\n\t* Un esprit startup\n\t* Des bureaux en plein centre de Paris (Entre Bourse et Grands Blvds)\n\t* L’innovation et l’ambition comme valeurs phares<p>Contactez-nous en ajoutant tout lien intéressant (linkedIn, GitHub, Stack Overfow, etc).<p>jobs@superimmo.com","time":1409582288,"type":"comment"}