{"by":"jdelic","id":8253097,"parent":8252715,"text":"Front-End Engineer and UX Designer LATERPAY - Munich, Germany (fulltime, remote work possible)<p>UX DESIGNER\nWe are looking for a full-time front-end UX designer who will take care of our HTML5&#x2F;JavaScript based clients for desktop browsers, tablets and mobile.<p>You should have a strong portfolio of work and have general knowledge of the current state-of-the-art in web user experience and design. We are currently revamping our user experience completely.<p>We are looking for a:<p>- well organized, self motivated individual who is a<p>- great communicator in written and spoken English and who is<p>- dedicated to constant iterative improvement<p>UX design in the payment space is governed by contractual and legal limitations, so creating great designs that incorporate such limitations should be your strong suit. We are looking for somebody who can think outside of the box while simultaneously creating designs that keep all of the obligations in mind.<p>Your job will be to improve designs across all of our internet-facing systems, create new, beautiful device-specific payment experiences and then work with front-end engineers to get them implemented and deployed.<p>FRONT-END ENGINEER\nLaterPay is creating a HTML5, JavaScript, JSON&#x2F;REST based, secure payment experience.<p>We are looking for a full-time front-end engineer with deep knowledge, experience any a keen interest in<p>- HTML(5),<p>- CSS (based around purecss.io and Stylus)<p>- JavaScript (YUI and&#x2F;or jQuery), because that&#x27;s what our plug-ins are based around and<p>- JavaScript application libraries like React.js<p>- strong opinions about user experience and great code with high maintainability<p>- experience with Django and Python is a plus as that is our server-side stack<p>- automated testing<p>A dedication to improving the whole user journey is deeply ingrained into our company by now.\nLaterPay employs 17 people from 8 countries. We have an office in Munich where we meet up roughly every 6 weeks. We offer remote work, competitive salaries and a great team.<p>Send applications to jobs@laterpay.net or contact us at @laterpay.","time":1409582994,"type":"comment"}