{"by":"melsmo","id":8253685,"parent":8252715,"text":"San Francisco, CA - CoreOS - Full Time - <a href=\"https://coreos.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;coreos.com&#x2F;</a><p>__Product Marketing Manager__<p>Join the CoreOS team. You&#x27;ll spend time with the CoreOS line of products to develop product positioning, create lead gen campaigns and develop an expertise on the overall market.<p>You’ll:<p>-Analyze the CoreOS line of products and determine the best way to price, position and market products in a competitive marketplace.<p>-Use a data-driven strategy based on customer insight and market research to understand how our products and solutions are doing in the marketplace.<p>-Create customer-facing collateral such as white papers, customer case studies, and webinars to drive prospects through the sales funnel.<p>-Design integrated marketing plans across owned, paid, and earned media channels - driven by a rationale for why, when, and how each channel should be used<p>Requirements:<p>-You have 5+ years of experience working for an enterprise-focused software, SaaS, or web services company.<p>-You have a proven track record of marketing to a highly technical audience. You are comfortable working with and marketing to developers and technical buyers within enterprises.<p>-You like analyzing marketing methods, doubling down on those that work and cutting those that don&#x27;t.<p>-You have a passion for measurement, metrics and continuous improvement.<p>-You are hands on. Passionate. Persistent. Creative. Easy to work with. Get things done.<p>If interested in the product marketing position please email your resume and&#x2F;or Linkedin to mel@coreos.com.<p>__Engineering Positions__<p>We are also hiring a number of engineers that are passionate about infrastructure and open source software in our SF and NYC offices.<p>Distributed Systems - Help make distributed systems easy. You’ll be working on our open source projects, etcd and fleet. etcd is being widely adopted by many different projects, including Pivotal’s Cloud Foundry and Google&#x27;s Kubernetes, but it is still a very early project and we need help.<p>OS - Writing a hobbiest kernel on the weekend? Contributed to Gentoo in 2005? Hacking on the core of CoreOS might right up your ally. The OS team is responsible for CoreOS itself, building, patching, and architecting the future of linux on the server. We work very closely with upstream, contributing patches to Linux itself, systemd, docker, and any other component that’ll make CoreOS more successful for our users.<p>Backend Web - Outside of building a new OS and a new distributed database (etcd), we are also building backend web services. If you have an interest in systems, but expertise in backend web development, please consider CoreOS. Our architecture is a Go based json&#x2F;http API app server, coupled Angular on the frontend.<p>If you are interested in the engineering positions, please email our CEO directly with your resume or LinkedIn: apolvi@coreos.com","time":1409589655,"type":"comment"}