{"by":"nlavezzo","id":8253162,"parent":8252715,"text":"FoundationDB - Developer; Sales Engineer - DC, Boston, Bay Area<p>--------------------------------- ---- About FoundationDB ------- ---------------------------------<p>FoundationDB is the company behind the eponymous distributed database. FoundationDB&#x27;s primary product - its Key-Value Store - is unique in the database market. It is a distributed, high performance, exceptionally fault-tolerant ordered key&#x2F;value store that supports true, no asterisk, ACID transactions across all data in a cluster. The unique characteristics of the key-value store make it relatively easy to build stateless layers that expose different data models at the top and store all of their state in they key&#x2F;value store at the bottom, using ACID transactions. The product vision is to make it possible for organizations to store all of their state in FoundationDB, while providing their application developers access to all of the various data models and APIs that they want to use for their applications.<p>--------------------------------- - Developer - DC or Boston Area - ---------------------------------<p>FoundationDB is currently seeking exceptional developers to join our growing team. In this position you will help us continue to build the next generation of transactional database technology. You will work with a team of exceptional engineers with backgrounds from top CS programs, research fields, and successful startups. We don’t just write software, we build our own languages, simulations, and state of the art tools to write better software.<p>Key Responsibilities:<p>* Working closely with other development team members on core and layer development.<p>* Thinking about high-level and long-term implications of design decisions<p>* Taking significant ownership in projects<p>* Doing a significant amount of actual coding each day<p>* Contributing to our dynamic entrepreneurial environment Required Skills:<p>* A good attitude, friendly personality, and strong work ethic<p>* Strong systems programming experience<p>* A high level of interest in software engineering and computer science<p>* Ability to work legally in the US<p>Beneficial, But Not Required Skills:<p>* Experience working on large software development projects<p>* Proficiency in C++<p>* Experience with distributed systems development<p>* An interesting portfolio of side projects that show you enjoy solving problems<p>* Experience interacting with users<p>* Strong verbal and written communication skills<p>Apply here for DC area: <a href=\"https://foundationdb.com/jobs/8923-Developer-Tysons-Corner-VA-Washington-DC-?gh_jid=8923\" rel=\"nofollow\">https:&#x2F;&#x2F;foundationdb.com&#x2F;jobs&#x2F;8923-Developer-Tysons-Corner-V...</a><p>Apply here for Boston area: <a href=\"https://foundationdb.com/jobs/10443-Developer-Boston-Cambridge-?gh_jid=10443\" rel=\"nofollow\">https:&#x2F;&#x2F;foundationdb.com&#x2F;jobs&#x2F;10443-Developer-Boston-Cambrid...</a><p>------------------------------------- Sales Engineer - DC, Boston, Bay Area -------------------------------------<p>FoundationDB is currently seeking Sales Engineers to join our growing team. In this position you will be the technical representative for FoundationDB&#x27;s products and services. Your mission will be to work with our Sales team to ensure the successful closure of software and services sales, while laying the foundation for customer success. This role requires deep, hands-on database and&#x2F;or development experience - you will be much more than a powerpoint jockey. You will be writing “Layers” and contributing them to the FoundationDB community. You will architect and deliver technology solutions for customers, prospects and partners. Experience with the entire customer success lifecycle is crucial – conception, solution architecture, technology evaluation, solution presentation, pilot, production, performance optimization and maintenance &amp; support.<p>Working knowledge of high-performance cloud architectures and distributed database systems (SQL &amp; NoSQL) as well as hands-on engineering is essential. We&#x27;re looking for customer-facing, hands-on technologists with a track record of success to join us in locations throughout North America. Sales Engineers are responsible for actively driving and managing the technology evaluation stage of the sales process; working in conjunction with the sales team as the key technical advisor and product advocate. Presenting FoundationDB products as well as building strong relationships with key sponsors both during and after the sales cycle.<p>The Sales Engineer must be able to articulate technology and product positioning to both business and technical users across a wide variety of horizontal solution landscapes and in vertical industries. He or she must be able to rapidly identify all technical issues of assigned accounts to assure complete customer satisfaction through all stages of the sales process. Sales Engineers must be able to establish and maintain strong relationships throughout the sales, and then customer success, cycles.<p>An existing network and&#x2F;or relationships within the DevOps community in Cloud, SaaS, eCommerce, Media &amp; Entertainment and&#x2F;or Financial organizations is a plus.<p>Key Responsibilities:<p>* Partner with the Sales team and Account Executives to achieve defined sales goals.<p>* Propose technical and business solutions in support of sales activities.<p>* Present technical and business aspects of proposed solutions to prospective and existing customers.<p>* Assist with strategy development within the target accounts by building customer relationships.<p>* Manage target accounts that may span multiple Account Executives.<p>* Work with Partners to achieve defined sales goals.<p>* Lead efforts to ensure the delivery of all technical resources into the sales campaigns.<p>* Assist in the production of RFPs and other proposals to prospective and existing customers.<p>* Responsible for development and delivery of consistently high-quality product demonstrations focused on advancing the sales cycle and addressing specific customer needs.<p>* Responsible for the design and delivery of on or off site technical Proof-of-Concepts for prospective customers.<p>* Responsible for representing the product to customers; and at field events such as conferences, seminars, etc.\n* Work with colleagues across the organization to receive the support needed to accomplish the technical goals.<p>* Creative solution development and presentation based on customer requirements, challenges and needs.<p>* Sphere of Influence: Sales team, customers and prospective customers, partners<p>Technical Skills: Experience with one or more in each of the categories below<p>Engineering: Java, Ruby, Python, PHP, Node,js, C&#x2F;C++&#x2F;C#, .NET, SQL, Go, Erlang, Scala<p>Databases &#x2F; State Storage Systems: Relational (Oracle, SQL Server, MySQL, PostgreSQL), NoSQL (key value, document, graph, columnar), Time Series databases<p>Operating Systems: Linux, Windows, Macintosh OS Required Skills:<p>* 8+ years of related experience in IT.<p>* 5+ years of specialized experience in software development or software delivery organization.<p>* Previous experience with architecture, design, build and management of distributed applications, databases<p>* Previous experience providing database and&#x2F;or NoSQL solutions<p>* Previous experience with data infrastructure tools – Integration, ETL, MDM, data quality<p>* Previous experience with Time Series applications<p>* Experience with Linux, Windows system configuration or Network configuration (TCP&#x2F;IP, web servers, firewalls, security).<p>* Extensive experience in production environments (application servers, web servers, databases), together with experience working with DevOps teams.<p>* History of success with Enterprise customer sales cycles, prototypes or large-scale development and deployment projects.<p>* Technical depth to respond to all functional and technical elements of RFIs&#x2F;RFPs.<p>* Proven success conveying customer requirements to Product Management teams.<p>* Strong verbal and written communication skills, customer interaction, requirements analysis, presentations, training, requirements specifications, system design, and documentation of user guides.<p>* Bachelor’s degree in Engineering, Math, Computer Science, or equivalent background.<p>* Willingness to travel to customer locations.<p>Apply here: <a href=\"https://foundationdb.com/jobs/10431-Sales-Engineer?gh_jid=10431\" rel=\"nofollow\">https:&#x2F;&#x2F;foundationdb.com&#x2F;jobs&#x2F;10431-Sales-Engineer?gh_jid=10...</a>","time":1409583819,"type":"comment"}