{"by":"robvolk","id":8253778,"parent":8252715,"text":"Charlie Contacts - Software Engineer - Chicago, IL<p>We&#x27;re looking for a developer who thrives on solving complex problems and learning new technology.  You want to make an impact in an early-stage company.  You write killer back-end code, but don’t shy away from the front-end.<p>We’ve built Charlie to research people at scale, using the latest Ruby on Rails stack with MongoDB, Redis, Sidekiq, and hosted in an elastic cloud farm.  We write code with agility and have a tight process where anyone on the team can deploy to production at any time, without approval (it&#x27;s near-continuous deployment).  We thoroughly test our code, though we’re not strict TDD.  We pair program on more complex problems.  We&#x27;re a small dev that loves to code, and constantly pushes, and learns from each other.<p>Before any meeting, Charlie automatically researches people before you see them.  Researching people is a complex problem: we sift through, analyze, and manipulate data into powerful insights (i.e. what are they passionate about, what do you have in common?).  CNBC called us “One of the world’s most promising new companies” and SXSW selected us as an Accelerator Finalist.<p>This is your opportunity to join an early-stage company that’s making moves.  Sound interesting?  Let us know what makes you the perfect candidate.<p>Why we’re special:<p><pre><code>   * Flexible working situation: hours, location\n   * Relaxed work environment\n   * Competitive salary + equity\n   * Funded startup backed by some amazing people\n   * Everyone deploys to production (fully automated, painless)\n   * We do fun things (concerts, Bulls &amp; Cubs games, and occasionally ski in Colorado)\n</code></pre>\nRequirements:<p><pre><code>   * Backend developer\n   * Ruby on Rails preferred, but you can learn.\n   * DB experience (MongoDB preferred)\n   * Not afraid of the front-end (HTML5, jQuery, Coffeescript, bootstrap, Sass, Slim)\n   * Test your code (Rspec, capybara, cucumber, etc)\n   * Codes on the side (you love to code, right?)\n   * Creative problem solver\n   * Git &#x2F; Github\n   * Smart &amp; gets things done.</code></pre>","time":1409590859,"type":"comment"}