{"by":"buu700","id":8254074,"parent":8252715,"text":"CypherChat - Software Engineer - REMOTE<p><pre><code>   =====================================\n   ================ Us =================\n   =====================================\n</code></pre>\nWe&#x27;re building a completely frictionless encrypted messaging service.<p>Our goal is to bring privacy and security to the unsophisticated masses, by targeting users who value those qualities in principle but won&#x27;t compromise &quot;for-your-grandmother&quot; ease of use. Eventually, we&#x27;ll be replacing conventional telephony&#x2F;SMS.<p>Team:<p><pre><code>    * Ryan Lester (Washington, DC): Carnegie Mellon, SpaceX, Napster.fm, YC Hacks\n    * Josh Boehm (Los Angeles): SpaceX, Napster.fm, Baron of the Principality of Sealand\n</code></pre>\nStatus:<p><pre><code>    * Funded\n    * Pre-launch, but with a working (very alpha) version of the product\n    * We have a nice office in the DC area, which you&#x27;d have the option to work out of\n\n   =====================================\n   ================ You ================\n   =====================================\n</code></pre>\nYou would be our first hire, so you&#x27;d get to help establish the company culture and probably end up managing a dev team. Right now, you&#x27;d be working directly with the founders.<p>If you have strong (mobile) UI&#x2F;UX skills, you&#x27;ll be a great fit.<p>Ideally, you&#x27;d be willing to start before the end of September (the earlier the better).<p>We don&#x27;t care much whether you&#x27;ve already used any of these, but you need to be willing to work with the following technologies:<p><pre><code>    * JavaScript (okay, you should have at least used this one)\n    * Titanium (compiles JS&#x2F;XML to cross-platform native apps; it&#x27;s hella dope)\n    * Crossrider (cross-browser extension framework)\n    * OTR\n    * XMPP\n    * WebRTC\n\n   =====================================\n   =========== Compensation ============\n   =====================================\n</code></pre>\nWe&#x27;ll pay well. We can negotiate the amount and the equity&#x2F;cash ratio based on your preferences and qualifications&#x2F;experience.<p>If necessary, we may be willing to provide hardware.<p>Also, any interest in being paid in Bitcoin? (I haven&#x27;t looked into the recent IRS guidelines on this, so it may be a horrible idea. If you live outside the US, though, this could possibly turn out to be really convenient. I&#x27;ll talk to our lawyer about it.)<p><pre><code>   =====================================\n   ======= If you&#x27;re interested ========\n   =====================================\n</code></pre>\nEmail me a resume or something at hacker@linux.com.","time":1409595398,"type":"comment"}