{"by":"d0m","id":8254562,"kids":[8255751],"parent":8252715,"text":"ListRunner (YC S2014), San Francisco And&#x2F;Or Montreal - FULL-TIME (Can help with VISA)<p>ListRunner (www.listrunnerapp.com) brings project management to doctors in hospitals. It&#x27;s hard to believe but doctors are still using paper and pager to manage their team and critical patient information. They&#x27;re not even allowed to use email..<p>We&#x27;re getting amazing traction - and excitement from doctors - and we are looking to expand the team with a few key people:<p>1) Backend developer: We use Mongo and Node. Lots of very cool challenge in building a robust and flexible API. Experience with real-time synchronization, AWS, security, offline apps and Angular.js is definitely a plus.<p>2) Product&#x2F;UX designer: Building an app for doctors is a big UX challenge. They&#x27;re extremely busy people and are used to have access to lots of information all the time.<p>3) UI Designer: Doctors are tired of those ugly 1980 computer systems still in use in hospitals. They want to work with the same kind of polished and beautiful apps that they&#x27;ve started using at home. We&#x27;re looking to push the current healthcare design status quo to a new level.<p>4) ios and Android developers: We&#x27;re looking for great ios&#x2F;android developers with an eye for design who can take a leading role in implementing beautiful and snappy native apps.<p>5) Machine Learning &#x2F; Data geek: Right now, 75% of critical patient information is trashed at the end of the day. That information is not going back in the EMR and is totally wasted. There are so many opportunities in helping finding better diagnosis, helping doctors be more efficient, helping the departments&#x2F;hospitals save time and money, etc.<p>6) Front-end developer: We&#x27;re looking for a great front-end developer&#x2F;designer who love writing clean html&#x2F;css code with an attention to details (We care about those pixels). Experience with Angular.js with an eye for design is definitely a plus.<p>----<p>We&#x27;re a multi-disciplinary team (Two doctors on the team) solving a massive healthcare challenge. Doctors love ListRunner and they can&#x27;t wait to start using it every day. If you&#x27;re looking for an opportunity to use your technical and design skill to solve a real, practical and meaningful problem, please reach out to us (contact@listrunnerapp.com or to me directly at phzbox@gmail).","time":1409603460,"type":"comment"}