{"by":"jwheare2","id":8254043,"parent":8252715,"text":"IRCCloud.com (London&#x2F;Sheffield, UK) - <a href=\"https://www.irccloud.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.irccloud.com&#x2F;jobs</a><p><pre><code>  * Front end engineering (on site or remote)\n  * Design (on site)\n</code></pre>\n---------<p>IRCCloud is an IRC client and bouncer without all the baggage.\nWe keep you connected all the time. Stay in sync and get notified wherever you are with our web and mobile apps.\nWe also host private IRC servers for teams and have a self-hosted version for enterprise.\nPlus, upload code snippets and files (soon!), search your logs (soon!), and images, videos, tweets embedded inline<p>--------<p>FRONT END ENGINEERING<p>IRCCloud is a long running rich web application with real time performance needs. If you&#x27;re up for the challenge of making a website feel like a desktop app and have deep experience with the following then email your CV to jobs@irccloud.com<p><pre><code>  * Backbone&#x2F;Underscore&#x2F;React\n  * jQuery\n  * CSS&#x2F;SASS\n  * WebSockets\n  * gulp&#x2F;browserify\n  * JS step debugging\n</code></pre>\n-----<p>DESIGN<p>IRC has a reputation as a chat tool for hackers, and a long history to go with it, but it&#x27;s not always been associated with brilliant design. We&#x27;ve set out to fix that by giving IRC a beautiful and intuitive home on the web and mobile devices.<p>Our focus is on functional elegance, clarity, and making complex things obvious. And it&#x27;s time to step it up a notch. We&#x27;re looking for someone to help us make IRC more appealing to those who&#x27;ve never used it to collaborate before, while still making sure the old hands feel at home.<p>We need to respect the IRC community, and the limitations of the medium, while making bold decisions that question the conventions of the last 25 years. We&#x27;re not building something completely new, trendy, and unproven. IRC is still thriving for a reason, and you&#x27;ll be responsible for better aligning it with the way people communicate online today.<p>Ideally, you&#x27;ll have several years of experience designing for the web and mobile, with a strong graphic design background. A working knowledge of HTML&#x2F;CSS for in-browser prototyping would be a significant bonus.<p>Email a portfolio and CV to jobs@irccloud.com to apply","time":1409595075,"type":"comment"}