{"by":"DLarsen","id":8254595,"kids":[8256036],"parent":8252715,"text":"Connexity - Camarillo&#x2F;Los Angeles, CA<p>We&#x27;re building a sophisticated advertising platform to help brands and retailers sell efficiently through loads of shopping intent data.<p>1) We need a Rails dev to own our campaign management interface.  While we have a growing set of systems doing automated optimization and altering, you&#x27;ll help humans effectively manage hundreds of campaigns for well-known brands and retailers.  We serve 50+ million ads every day and process 3.5 billion transactions, and you&#x27;ll be right in the thick of it.  You&#x27;ll work directly with Postgres, Redis, HBase and Hadoop.  You&#x27;ll also likely play a key role in developing a new API for several key partners.<p>2) We need someone with fierce tenacity to run QA and technical ad operations.  When an account manager sees that we recorded no clicks for a certain campaign in Firefox browsers, you&#x27;ll get to hunt down the resolution.  You&#x27;d bring a meticulous eye for detail to bear with browser and Javascript chops.  Done well, you&#x27;ll be a daily hero.  (As it turns out, the folks writing &quot;system code&quot; perform best when they can stay in the zone, head down as much as possible.)  Count on becoming well acquainted with Hive.<p>3) Finally, we&#x27;re looking for a strong DevOps team member.  You know networking and Linux very well.  You&#x27;ll help improve our Hadoop clusters.  You&#x27;ll tune monitoring and alerting thresholds.  Most importantly, you&#x27;ll eagerly seek to expand your usefulness as you work with the rest of the dev team.  We&#x27;re not driven by dogma, and you&#x27;ll find yourself in good company if your sole priority is fixing the problem at hand.<p>I&#x27;m one of the lead devs, and you can reach me at dlarsen@connexity.com.  I&#x27;m happy to speak informally about our situation, and can hook you up with the HR folk at the appropriate time.","time":1409603932,"type":"comment"}