{"by":"hyramgraff","id":8254433,"parent":8252715,"text":"MPA - <a href=\"http://www.consultmpa.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.consultmpa.com&#x2F;</a> - Chicago, IL<p>This is an on-site, full-time position.<p>== Job Description ==<p>MPA is building a small, elite team of world-class software engineers to directly influence the quality and cost of healthcare, addressing the fundamental challenges facing the healthcare system in the United States.<p>Our developers write software to:<p>* support internal analyses of healthcare data<p>* define and improve overall technical processes<p>* compute appropriate costs for care and reconcile them to actual costs<p>* build a suite of packaged products and services that evaluate clinical outcomes of care<p>* analyze performance data to identify the most appropriate and effective patterns of care<p>MPA is seeking exceptional software engineers who are deeply committed to delivering high quality, timely results and who possess a proven ability to derive and apply practical and creative solutions to difficult technical and business problems.<p>Members of this unit will have significant input into and control over processes, protocols, and tools employed.  The firm has historically stored, manipulated, and analyzed healthcare data using SAS.  However, SAS knowledge and expertise is NOT a prerequisite for this team.  MPA’s leadership will support technologies and tools best suited to the work being performed.<p>== Skills &amp; Requirements ==<p>* Experience in analyzing information, software algorithm design, software design, software debugging, software development fundamentals, software documentation, and software testing<p>* Demonstrated experience translating business needs and requests into functioning software<p>* Ability to grasp broad concepts, an acute attention to detail, and the capacity to translate between the two<p>* Ability to meet deadlines, work within project timeframes, and to quickly adapt to changing business needs<p>* Strong verbal and written communication skills and organizational skills<p>* Excellent problem solving skills<p>* Comfort with and capacity to work in a self-directed, unstructured environment<p>Experience with the following is strongly desirable but not required:<p>* Healthcare related database experience (e.g. Billing, claims, and registry data)<p>* Background in statistics, using and creating mathematical models and working with other analytics<p>== About MPA ==<p>Founded in 1988, MPA is a small, innovative healthcare consulting firm addressing the critical issues that currently dominate the national healthcare debate.  The firm provides technical expertise on quality monitoring, quality improvement, and payment reform.  Since its inception, MPA has served organizations nationwide in every segment of the healthcare industry, providing groundbreaking solutions that have helped establish our clients as industry leaders.<p>To apply, please send an email to hr at consultmpa dot com.","time":1409601206,"type":"comment"}