{"by":"Hackerati","id":8254956,"parent":8252715,"text":"Sr. Android&#x2F; Wearables Engineer - New York, NY<p><a href=\"http://hackeriam.theresumator.com/apply/8HJrx9/Senior-Android-Wearables-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;hackeriam.theresumator.com&#x2F;apply&#x2F;8HJrx9&#x2F;Senior-Androi...</a><p>-About The Hackerati-<p>The Hackerati offers Engineering as a Service—our Agile consulting model—to deliver advanced technologies to blue chip companies and startups alike.<p>In the last couple of years, we’ve worked on a broad range of projects, including fullstack Web (79M unique visitors per month), APIs, native mobile (iOS&#x2F;Android with millions of downloads), mobile web, machine learning, natural language processing, Big Data (330+ TB&#x2F;mo), realtime processing (10k events&#x2F;second), wearable devices, and geospatial applications.<p>In addition to working as consultants, all Hackerati will have the opportunity to secure funding for their own startup ideas through Hackerati Labs, allowing them to maintain salary and benefits purely by developing their startups. As we continue to accrue revenue from EaaS to allow this platform to come to fruition, we will provide entrepreneurship and engineering mentoring, as well as legal, sales, marketing, and financial support. In order to surface the best startup ideas, we’ve cultivated a unique culture that elevates innovation to a first-class citizen, alongside execution.<p>Finally, Hackerati Academy is our engineering training ground where we build a foundation of good habits and best practices. The Academy enables all employees to continue to learn and teach new technologies.<p>About the Team<p>We’re all hackers in our own disciplines—inventors who naturally defy conventional wisdom to build awesome stuff. We specifically look for hackers with entrepreneurship in their DNA. Hackerati are visionary creators and explorers who are driven by curiosity and passion to improve the world around them.<p>We are doers and dreamers.\nWe are students and teachers.\nWe are scientists and artists.\nWe are The Hackerati.<p>About the Role:<p>-Become a fulltime member of a fun, diverse, badass engineering team to help deliver beautiful, usable, and innovative native Android apps\n-Drive feature development of popular apps for Android smartphones and tablets, mentoring small teams of engineers and taking ownership of end-to-end product quality\n-Lead prototypes of new ideas and explore new technologies on the forefront of mobile technology\n-Opportunities to hack wearable devices like Google Glass and EEG headsets\n-Work with some of the world’s best-known companies\n-Learn and teach new technologies through Hackerati Academy\nPotentially get your inventions funded by Hackerati Labs<p>YOU:<p>-are an entrepreneurial hacker with a current interest in mobile apps\n-have 3+ years of experience developing native Android apps with solid experience in Java, Android SDK, API stack, and an understanding of data models and UI.\n-have work that can be found in the Google Play app store\n-have a solid fundamental understanding of software engineering, including computer architecture, data structures, algorithms, OOP, etc.\n-know the meaning of teamwork\n-prefer social contracts over rules\n-challenge the status quo\n-practice intellectual humility\n-are fearless about diving into new technologies<p>IT&#x27;D BE GREAT IF YOU ALSO:<p>-have work that can be found in public repos on Github\n-have worked on an Agile team\n-know the difference between unit and functional testing and QA, and you know what stubs and mocks are\n-have mastered other engineering disciplines like mobile web, fullstack, and Big Data\n-know what gumption means—and have it\n-create in other mediums like music, visual art, poetry, film, comics, etc.\n—\nThe Hackerati is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status.<p>APPLY HERE:<p><a href=\"http://hackeriam.theresumator.com/apply/8HJrx9/Senior-Android-Wearables-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;hackeriam.theresumator.com&#x2F;apply&#x2F;8HJrx9&#x2F;Senior-Androi...</a>","time":1409610689,"type":"comment"}