{"by":"Katelyn","dead":true,"id":8255373,"parent":8252715,"text":"Director of Engineering- NYC<p>Defy Ventures, a &quot;Y-combinator meets Khan Academy&quot; for people with criminal histories, is hiring a Director of engineering&#x2F;Senior Software Developer to join us on our mission to transform the lives (and hustle) of millions of Americans with criminal histories.<p>====================<p>=====Who You Are====<p>====================<p>The ideal candidate is an experienced, product-focused, full-stack developer who wants to use their skills to take our already proven solution and bring it to scale.<p>A major part of Defy&#x27;s scalable solution will be its web application, where students interact with mentors, peers, our curriculum, scheduler, projects and APIs.<p>====================<p>=====Who We Are====<p>====================<p>We’re a small but rapidly growing team of product designers, entrepreneurs, teachers and business executives who believe everyone deserves a second chance.<p>We move fast, take risks, and never settle for “good enough.&quot;  We recognize that truly great products are built, refined and perfected over time.  We come to work every day excited about building something that matters more than we do.<p>While Defy is is a 501(c)(3), we&#x27;re dedicated to doing whatever&#x27;s necessary to building a world-class team.  We’re passionate about using our craft to redeem lives and restore communities and realize there are few other world-changing endeavors that can match the scalability and impact of what we&#x27;re building at Defy.  After all, “How we spend our days is, of course, how we spend our lives.<p>====================<p>=====Our Mission====<p>====================<p>At Defy, our mission is simple: we believe that men and women with criminal histories:<p>- Represent America’s most overlooked talent pool\n- Are some of the scrappiest and most accomplished entrepreneurs and salesmen\n- Share skills and talents with top business leaders<p>Defy&#x27;s program breaks generational legacies of violence, poverty and incarceration by equipping the millions of men and women with criminal histories with tools and communities they need to unlock their potential and &quot;transform their hustle&quot; by creating profitable, legal business ventures.<p>Email your resume and&#x2F;or Github handle to Katelyn at careers@defyventures.org, with subject line: HN-Engineer.<p>To learn more, visit: <a href=\"http://defyventures.tumblr.com/lead-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;defyventures.tumblr.com&#x2F;lead-engineer</a> or <a href=\"http://defyventures.org\" rel=\"nofollow\">http:&#x2F;&#x2F;defyventures.org</a>","time":1409621447,"type":"comment"}