{"by":"giaour","id":8255990,"parent":8252715,"text":"New York, NY - Business Insider<p>Business Insider is looking for a highly-skilled PHP developer to work closely with our world-class engineering team to conceive, design, build, and deliver the next-generation of online news&#x2F;media.<p>We face exciting challenges every day due to the demands of our growing audience and the 24&#x2F;7 news cycle. Your work will be used by millions of people—40+ million every month around the globe.<p>Our product team pushes the boundary on feature development, resulting in a varied and interesting assortment of tech challenges to solve.<p>The Business Insider engineering team also handles DevOps tasks of our scalable server infrastructure, and other cutting edge technologies such as MongoDB, AWS, and NodeJS.<p>Business Insider is a dynamic company reaching the new generation of business leaders. We are a well-funded (including by Jeff Bezos) startup at the forefront of digital media. You&#x27;ll be joining a close team that works hard and has fun.<p>We&#x27;re looking for strong PHP developers who have experience working with MVC systems and appreciate the agile methodology and continuous integration.<p>Position requirements include:<p><pre><code>    Skilled back-end programmer who can write lean object-oriented PHP 5 code\n    Strong front-end JavaScript and CSS knowledge a plus\n    Broad understanding of web architecture and how it applies to scalability\n    Enjoys building user-focused interfaces, using Ajax when appropriate\n    Collaborating with product managers, editorial, and business partners to understand software requirements\n    Participating in architectural decisions\n    Troubleshooting and solving complex problems\n    Solid understanding of version control principles, preferably using Git\n    Strong communication skills\n</code></pre>\nOur ideal candidate has experience with:<p><pre><code>    Agile software development, prototyping and code reviews\n    Major PHP frameworks \n    Major cloud providers\n    Systems administration of Linux servers\n    NoSQL document-based DB stores such as MongoDB\n    Two years of work experience is ideal. \n</code></pre>\nBased in New York — you will need to be able to work out of our office on Fifth Avenue.<p>Apply online: <a href=\"http://www.jobscore.com/jobs2/businessinsider/php-developer/bewZd6izWr5kvLiGalkWKP\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;businessinsider&#x2F;php-developer&#x2F;...</a>","time":1409636686,"type":"comment"}