{"by":"perplexes","id":8256101,"parent":8252715,"text":"VERBA - San Francisco, CA<p><a href=\"http://verbasoftware.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;verbasoftware.com&#x2F;</a><p>jobs@verbasoftware.com<p>* Rails&#x2F;JS Product Focus - FULL-TIME or HALF-TIME with benefits [work on your side projects!]<p>Verba thinks that college should be more affordable, so we help bookstores get books faster, cheaper, and sell them competitively.<p>We guide every stage of a used book&#x27;s life. We help students save money, and bookstores become and stay relevant, competitive, and transparent.<p>Numbers: 400 colleges and universities (and more beating down our door), tracking ~200k unique ISBNs, serving millions of students (rush season means 100 requests&#x2F;s), raising the &quot;win rate&quot; for bookstores to 80%, and dropping prices across the board. 19 employees, 3 part-time. 2 dogs. 5 cats. 3 children.<p>Code: Ruby, Rails, JS, Clojure for Hadoop, MySQL on AWS w&#x2F; Chef. We love experiments and go with what works! We also love making a stable, solid product which is why we have a ton of tests, metrics and a one-click build pipeline.<p>What&#x27;s in it for you: A great team and company culture, benefits (even for part time!), laptop, books, BART pass, pool table, somewhat healthy office snacks, great conversation during our yearly company work-cations (<a href=\"http://verbasoftware.com/vacay\" rel=\"nofollow\">http:&#x2F;&#x2F;verbasoftware.com&#x2F;vacay</a>), and hard, challenging, fulfilling work.<p>Message us if: You want to help make education better. You&#x27;ve got strong Rails knowledge, solid testing practices, a good head for architecture, and know enough JS to help out on front-end. We prefer slope over y-intercept.<p>How to get the job: Write a cover letter to jobs@verbasoftware.com that speaks to why this job might fit with you, and how you could help us out. The first step is a phone screen to solve a small programming problem. Then we&#x27;ll schedule an on-site interview for a few hours, and have you walk through some of our code with us. Also we&#x27;ll ask you some historical behavior questions, not logic puzzles. Then we&#x27;ll make you an offer, and you&#x27;ll accept and we have a new employee party!","time":1409640098,"type":"comment"}