{"by":"krg","id":8258624,"parent":8252715,"text":"TechEmpower - Los Angeles area, California (El Segundo, near LAX)<p>You may recognize us from the Web Framework Benchmarks that have been discussed on HN periodically: <a href=\"http://www.techempower.com/benchmarks/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.techempower.com&#x2F;benchmarks&#x2F;</a><p>Work Hard, Have Fun, Be Nice<p>Let&#x27;s be honest: you became a developer because you like to build things. Interesting things, useful things, cool things. It&#x27;s like building with Legos, only you get paid, and there are always plenty of the right color pieces.<p>At TechEmpower, we build things. Interesting things. Cool things, mostly in webapp form. We build them as individuals, because we&#x27;re creative people. We build them as teams, because we like to help each other grow, and because we know that collaboration improves even the best code.<p>Having the best people doesn&#x27;t hurt, either. We&#x27;ve got most of them already, and we&#x27;re looking to find the rest. You can build things with us. What&#x27;s the catch? We&#x27;re pretty darn selective.<p>To work as an individual, you have to be motivated and creative and thoughtful and serious. To work on a team, you have to be respectful and energetic and open and absolutely not a jerk. We need developers who can work on every part of an application, from the data store to the page–sometimes known as full stack developers. And to be a full stack developer, you have to know technology and want to learn more technology, because those acronyms just keep coming.<p>Our clients expect us to work with them, not for them. We help them define their problems, and we provide solutions, on time and on target. We&#x27;re service-oriented, and you should be too.<p>Still reading? Please apply! And check out our Web Framework Benchmarks while you&#x27;re at it. We pretty much wrote the book on that one.<p>Just so you know:<p><pre><code>   Teams range between 2-6 people\n   Developers are exposed to 3-4 projects per year\n   All development is done on high-performance workstations with 4K displays. A lot of code fits in 3840x2160 pixels!\n   We maintain an informal, comfortable environment, just like the old college computer science lab, but with grown-up hours\n   Everybody&#x27;s nice\n</code></pre>\nThe technologies we use vary over time with our mix of projects. Here is a snapshot of what we&#x27;re using now:<p><pre><code>   Languages: Java, JavaScript, Python, C#, Ruby, PHP\n   Tools: Git, Jenkins (Continuous Integration), Sonar (static code analysis), Eclipse, IntelliJ, Ant, Maven\n   Web: Dropwizard, .NET MVC 5, Play, Django, Rails, Mustache, Handlebars, Backbone, Angular, Knockout, JSP, Servlets, jQuery, etc.\n   Mobile: iOS, Android, PhoneGap\n   Hosting: AWS (EC2, RDS, etc.), Rackspace Cloud, Linux deployments\n   Data Persistence: ORM (Hibernate, etc.), MySQL, Postgres, MS SQL Server, NoSQL (Redis, MongoDB)\n</code></pre>\nWe don&#x27;t expect new hires to have experience with all of these, but we do expect you&#x27;ll learn more about them every day.<p>If this sounds like the kind of place you&#x27;d like to work, please apply here: <a href=\"http://jobs.techempower.com/hn2\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.techempower.com&#x2F;hn2</a>","time":1409676055,"type":"comment"}