{"by":"blakeweb","id":8263455,"parent":8252715,"text":"Hiring a Lead Data Scientist and a Software Engineer (Python) - Recursion Pharmaceuticals - Salt Lake City, Utah (Also hiring biologists with mammalian cell culture experience!)<p>We’re a five-person biotech startup with an amazing set of advisors, and we&#x27;re using high throughput experiments, automated image segmentation and analysis of human cells, and lots of data analysis to find new treatments for rare genetic diseases faster than anyone has previously thought possible. There are more than 5,000 rare genetic diseases, in total affecting millions of Americans, and our serious goal is to find treatments for 100 rare diseases in the next 10 years. We’ll need the best minds out there to help us make that happen.<p>Our approach is to model rare genetic diseases in human cells, then use these disease models to find drugs that revert the cells to a healthy state, and thus are strong candidates for impacting the disease in patients. In a pretty quick experiment, we image millions of human cells. Image segmentation and analysis quickly makes thousands of measurements, resulting in a very deep quantitation of the state of every single cell. The challenge at hand is running the right experiments in the right way and analyzing results to make the discoveries we seek as quickly as possible.<p>My two co-founders developed the basis of our approach at the University of Utah, using it to find two very promising candidates for a serious and fairly common genetic disease. We’re moving those candidates forward, and at the same time adapting the approach to address the thousands of other untreated rare genetic diseases as quickly as we can. I joined them to start this company because this is the best chance I’ve found for a software&#x2F;stats person to make such a huge impact on the lives of millions of people. I also believe that imaging-based biological experiments are going to be a big part of the wave of advancement coming to treating and curing diseases in the next two decades.<p>--<p>Software Engineer (Python):<p>- You have several years of experience in python software development, preferably using ipython and other scientific python tools. You’re also super-comfortable at the command line and handling the standard a linux server, and great at solving any kind of computational issue via stackoverflow. No sysadmins, DBAs or the like will be around to help for a while.<p>- You’re motivated by challenging problems, and by the idea of making millions of patients’ lives dramatically better, as fast as we can.<p>- You’ll work with biologists and data scientists to develop tools to manage and automate our experiments and analyses. To manage the experiments and analyses it will take to treat 100 diseases in 10 years, we’ll need a pretty amazing set of systems in place eventually, but need to get there incrementally so that we can make rapid progress immediately using the resources we have.<p>--<p>Lead Data Scientist (Python):<p>- You have several years of experience in statistics, machine learning, and software development solving problems and answering questions efficiently using lots of data, preferably using ipython and lots of python’s scientific programming tools. We’re not hadoop-scale for now, but every experiment can generate hundreds of gigs of quantitative measurements.<p>- You’re ready to take on any problem and figure out the best solution you can with available time, having fun in the process.<p>- Maybe you already know some biology, but if you don’t, you’re excited to learn what you need to (we’ll help, of course!) in order to really understand our data and approach.<p>- You’re motivated by challenging problems, and by the idea of making millions of patients’ lives dramatically better, as fast as we can.<p>- You’ll come to understand our experiments and data at a visceral level and help us guide the direction of our experiments and our company towards our goals.<p>- You’ll work with our biologists to guide our design&#x2F;experiment&#x2F;analyze cycle towards getting the most impactful biological information from the most rapid and cost-effective experimental approaches. This includes researching, suggesting and testing different statistical and machine learning approaches, along with changing our experimental setup to provide more useful information with every round of exeriments. You’ll set the groundwork for how we’ll design and analyzse thousands of experiments in the coming years.<p>--<p>About Recursion:\nWe work in a beautiful office and lab space set directly at the base of the mountains, overlooking Salt Lake City, situated directly one floor above the drug discovery core at the University of Utah, giving us direct access to millions of dollars of cutting edge lab automation and imaging equipment. We offer competitive pay, health insurance, relocation assistance (working at the office is part of the deal), equity, a location 30 minutes from 5 amazing mountains and ski resorts, and a group of ambitious, talented, happy, awesome people to work with. <a href=\"http://www.recursionpharma.com/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers.html</a>","time":1409757865,"type":"comment"}