{"by":"Tine_Freeletics","id":8267389,"parent":8252715,"text":"Freeletics GmbH - Munich&#x2F;Germany (Start-up company)<p>FREELETICS\nFreeletics is the most efficient and motivating way to become athletic. Anywhere and anytime. No weights or machines. Athletes receive their training plans, connect themselves and compare their workout times via the Freeletics app and website. We count more than 1,500,000 registered users around the globe. And thousands more every day. We are growing. Rapidly. And this is just the beginning.<p>Hard work, passion and an awesome team. The chance of your life. Wanna see for yourself? Great, because …<p>WE ARE LOOKING FOR A TECHNICAL OPERATIONS ENGINEER (M&#x2F;F)\nAs part of our operations team you make sure Freeletics services scales with its users. You will contribute to a lean, friendly engineering team that values collaboration, constant improvement, and positive feedback.<p>Please note: We also have openings for Full-Stack Software developers or solely for backend and frontend developers and iOS Developers, too.<p>• Job type: Full-time\n• Location: Munich, Germany<p>THIS COULD BE YOUR SAMPLE PROJECTS\n• Implement monitoring for the Freeletics infrastructure from system health to business metrics.\n• Automate application deployment, server provisioning and generally everything that can be automated.\n• Develop and improve internal tooling to streamline technical operations processes.\n• Continuously work on improving performance and reliability of Freeletics services.<p>YOUR PROFILE\nYou are a smart character who is willing to work into new fields and values constant improvement. In addition you know how to allocate your time effectively and have a hands-on approach on solving hard problems.<p>YOUR QUALIFICATIONS (the more the better)\n• Excellent knowledge and understanding of linux&#x2F;unix systems with solid administrator experience.\n• Good knowledge and understanding of server hardware.\n• Solid scripting skills (ruby, perl, python, shell).\n• Experience deploying Ruby and Rails applications in production.\n• Familiarity with Chef, Puppet or other configuration management tools.\n• Experience in managing and tuning PostgreSQL servers.\n• Experience with open-source monitoring tools like Nagios, Cacti, Ganglia, Graphite, StatsD.<p>WHY WORK AT FREELETICS\n• Attractive compensation\n• Use of latest technologies and development environments, daily and automated builds\n• Individual budget for further training&#x2F; education&#x2F; conferences\n• The chance of playing a crucial role in a fast growing company\n• A team of smart and extremely motivated co-workers\n• No walls, no limits, no bureaucracy, just unlimited potential\n• Self-fulfillment, fun, and a great atmosphere\n• Social activities (food, drinks, events) and team Freeletics training<p>SOME STATS ABOUT US\n• Founded in mid-2013\n• 30+ employees\n• 1,500,000+ members\n• Global reach with 160+ countries\n• Six digit weekly revenue\n• 30% month-on-month growth in 2014\n• More than 200k followers on Facebook\n• Active in six social networks (Facebook, Instagram, Twitter, Tumblr, Vine, Pinterest)\n• Available in 5 global languages (English, German, Spanish, French, Portuguese)<p>If this sounds interesting to you, we would love to hear from you!\nPlease include everything that you believe is relevant: your GitHub&#x2F;Stackoverflow profile, CV, code samples, links to personal projects, etc. and send it to talents@freeletics.com","time":1409825159,"type":"comment"}