{"by":"timdev2","id":8269604,"parent":8252715,"text":"NYC - Full Stack Engineer w&#x2F; PHP Focus<p>===========<p>Quick Intro<p>===========<p>I&#x27;ve been consulting for a great organization for several years, and they&#x27;re looking to bring someone on full-time.  I&#x27;ll continue to be involved to support, advise, and even do some work.<p>Personally, I think this is a great opportunity for someone in the NYC area who&#x27;s burned out on freelancing and wants a few years of solid pay + benefits, while helping others.<p>If you&#x27;re interested email tim at substr($myUserName, -1).com with an intro, resume, and the usual assortment of relevant links.<p>====================================<p>The Bullet-Point-Ridden Long Version<p>====================================<p>A well-funded, NYC non-profit is seeking a full-time junior-to-mid-level full-stack web applications developer to support several web applications.<p>The ideal candidate has a solid skills and experience (&gt;= 3 years) developing database-driven web applications, and is also capable on the client-side.  Linux and AWS experience is a plus, but not required.<p>This is an on-site position in a midtown office near Grand Central.  You’ll be working directly with senior staff to maintain and extend several web-based apps (some public-facing, some internal).<p>You will be the sole technical staff member, though you’ll collaborate with, and receive guidance and support from long-time external consultants who have been supporting this organization for several years (one of whom is responsible for this job posting).<p>You’ll primarily iterating on existing platforms, but with the prospect of doing some greenfield development as well.<p>This is an excellent opportunity to grow your skills in a supportive environment.<p>We currently use:<p><pre><code>  * Modern PHP  \n  * MySQL\n  * Redis\n  * Memcached\n  * AWS (EC2, RDS, ELB, R53, S3)\n  * VPSes (debian)\n  * Ruby&#x2F;Rails (old: 2.3) for an internal-facing app.\n  * Salt and Ansible (we&#x27;ll be picking a winner soon)\n</code></pre>\nRequirements:<p><pre><code>  * 3+ years experience developing database-driven web applications.\n  * Significant experience with modern PHP.\n  * A strong understanding of SQL and relational databases.\n  * Competency with front-end technologies (HTML5, Javascript &amp; CSS).\n  * Some experience managing linux-based servers from the command line (basic bash scripting, cron configuration, package management, etc).\n  * Strong written and verbal communication skills.\n  * Ability to collaborate with non-technical colleagues, in their language, manage their expectations, and provide working solutions.\n</code></pre>\nExtra points for:<p><pre><code>  * Experience with AWS services.\n  * Experience with configuration management tools like Ansible, Salt, Chef or Puppet\n  * Experience writing and consuming web services, RESTful and otherwise.</code></pre>","time":1409852764,"type":"comment"}