{"by":"kevinold","id":8275823,"parent":8252715,"text":"Multiple Openings for Ruby on Rails and Senior JavaScript Developers - Coupa, San Mateo or REMOTE - Fulltime<p>See our official postings here:<p><a href=\"http://www.coupa.com/openings/73-ruby-on-rails-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coupa.com&#x2F;openings&#x2F;73-ruby-on-rails-developer</a><p><a href=\"http://careers.stackoverflow.com/jobs/67201/senior-javascript-developer-coupa-software\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;67201&#x2F;senior-javascrip...</a><p>We have plenty of other openings in all areas.  See: <a href=\"http://www.coupa.com/careers/openings\" rel=\"nofollow\">http:&#x2F;&#x2F;www.coupa.com&#x2F;careers&#x2F;openings</a><p>If you&#x27;re in the Bay Area, please join us for an Open House at Coupa Software for Ruby on Rails Engineers. September 10th, 2014 6:00 pm to 8:00 pm. Let us know if you will be attending via this event page! <a href=\"http://on.fb.me/1o7lp3H\" rel=\"nofollow\">http:&#x2F;&#x2F;on.fb.me&#x2F;1o7lp3H</a><p>About Coupa<p>San Francisco Business Times and Silicon Valley Business Journal have named Coupa Software one of the top 50 companies to work for in the Bay Area.<p>Do you want to work for a company that The Wall Street Journal named one of the top 50 new start-up companies or the Business Insider states is one of the 25 Enterprise Startups To Bet Your Career on?  Coupa is building a world-class company of experienced professionals and we could be looking for you.<p>Coupa is emerging as one of the hottest Cloud Applications companies.  Already managing $10+ billion in spending for worldwide enterprises, Coupa is recognized as the next generation leader of Spend Management solutions. With Coupa, the global enterprise is able to manage expenses, encourages smarter spending with innovative tools, provide real time views, and makes recommendations for organizational improvement.<p>If interested, please send your resume to careers@coupa.com.  Please be advised, inquiries or resumes from recruiters will NOT be accepted.","time":1409945223,"type":"comment"}