{"by":"twog","id":5637910,"parent":5637663,"text":"  \nCampus Bellhops is seeking a dominant force as our CTO &#38; leader of our technology program to join the team as partner in Chattanooga, TN.  Meaningful equity &#38; salary with full benefits means we want you to be around for a while to help us build something great.<p>You:<p>* You are a generalist able to tackle a wide variety of problems and opportunities that come our way<p>* You thrive in a startup environment (lots of uncertainty, few processes or infrastructure)<p>* You love dealing with multiple programming languages, web services, analytics, databases etc and plumbing them all together<p>* You like rapid development, quick turnarounds and responding to changing requirements<p>* You feel right at home in a full stack environment<p>* You enjoy doing something that nobody else has done before<p>Us:<p>* We are hustlers, hard-workers, doers, and problem solvers<p>* We value the user experience<p>* Python is our main development language, and Django is our framework of choice<p>* We like open source, and open source our work where possible<p>* We like HTML5/CSS/JS and other emerging web technologies<p>* Some technologies we currently use are MongoDB and Google AppEngine<p>* Some tools we currently use are git + Github, New Relic, and Mandrill<p>What is Campus Bellhops?<p>College students need more than just a resume... they need a proven track record. Campus Bellhops selectively recruits, trains and brands a large student workforce at Universities across the country. We bring our Bellhops to the marketplace through Campusbellhops.com, where our customers go to reserve our student ‘Bellhops’ for moving help and other specialized services. Bellhops are given access to our online system allowing them to claim and execute jobs that fit their own schedule. Our customer’s complete individual reviews that link to the Bellhops’ online profile, empowering Bellhops to prove their fundamental business principles through a real life track record. We will market these merit based online profiles to potential employers looking for future professionals.<p>Check out our video:<p><a href=\"http://www.youtube.com/watch?v=JpH1Li3huho\" rel=\"nofollow\">http://www.youtube.com/watch?v=JpH1Li3huho</a><p>Contact us:<p>Get in touch at matt (at) campusbellhops.com","time":1367416871,"type":"comment"}