{"by":"davefp","id":5637850,"kids":[5638299,5638193],"parent":5637663,"text":"Shopify - Ottawa, Toronto and Montreal<p><a href=\"http://shopify.com/careers\" rel=\"nofollow\">http://shopify.com/careers</a><p>Shopify is looking to grow the team responsible for building the future of Shopify. We’re in search of back-end developers with a passion for solving hard problems with performant code. If you are interested in creating great products, building new features and improving the existing Shopify features, then please apply!<p>Developing Shopify<p>Shopify is the longest continuously developed Rails app on the planet and we care a great deal about code quality. Shopify, in contrast to most other rails shops, always runs on the latest rails version. Many core rails features have been developed within Shopify and have later been added to the Rails framework. We often go back and improve core parts of the Shopify codebase to make it better or more lean. We can do this because we have a positively massive unit test coverage which will immediately sound the alarm when something goes wrong.<p>We ship on quality instead of on time. When a feature is ready we deploy it immediately to everyone or use an internal system to roll it out to a certain percentage of customers. Various teams deploy new code many times throughout the day.<p>Shopify's production scale is massive. We host tens of thousands of online stores and regularly see hundreds of millions of requests a day. When you push out new code tons of people will see what you made within seconds. Operating on this level is hard but incredibly rewarding.<p>Responsibilities:<p>* Write back-end code in Ruby and Go.<p>* Work with a world class design and product team.<p>* Providing beautiful and fast code that improves the code-base of our products in meaningful ways.<p>* Use TDD to write rock-solid code, utilizing our huge test suite to make changes with confidence.<p>* Rapidly fix bugs or take your time to solve hard problems well.<p>* Deploy code to hundreds of servers and tens of thousands of customers in your first week.<p>* Never stop learning. Shopify is an environment of constant personal growth.<p>Qualifications and Desired Skills:<p>* Know Rails or be ready to learn it quickly.<p>* Proficiency with UNIX commands.<p>* Knowledge of relational databases and SQL, we use MySQL.<p>* Strong commitment to quality.<p>* Experience building and scaling user-focused web application.<p>* Being awesome and having a love for Shopify - Major Plus!","time":1367416353,"type":"comment"}