{"by":"danielsamuels","id":5637813,"parent":5637663,"text":"Onespacemedia - Cambridge, UK.\n<a href=\"http://www.onespacemedia.com/\" rel=\"nofollow\">http://www.onespacemedia.com/</a><p>---<p>Junior/middle-weight web developer<p>Are you an internet-obsessed design-savvy coder? Interested in being part of a friendly, dynamic team in a central Cambridge studio? We want to talk to front or back end developers who are creative, organised and love all things web. Ideally you'll have some or all of the following skills:<p>Knowledge of writing standards-compliant, high-performing HTML5 and CSS web pages.\nExperience of working with popular web libraries.\nWe use Django and jQuery, but you can learn these on the job.\nGood knowledge of at least one programming language.\nWe work primarily in Python and Javascript, but are happy for you to learn these on the job too.\nAn understanding of database programming and design. Familiarity with *nix based operating systems.\nAwareness of popular web APIs, such as Google Maps, Twitter and Facebook.\nMore important than relevant experience is the drive to learn and expand your skill set. If you've got a commitment to excellence and can demonstrate an aptitude for programming then we want to hear from you. In return you'll receive a competitive salary, full training and your own top of the range laptop (we work predominantly on Macs but we can let the odd Windows machine slip through the net!).<p>What you can expect to work on<p>Expect to work on a wide range of challenging projects. We don't have a cookie cutter approach to the web and push the design and technical envelope on all our work. Recent projects have included: an application that manages, filters and analyses radio spectrum data from a series of nationally-located nodes; a responsive website for a high-end safari and Africa travel company; a large website and online admin system to manage the ever-changing attractions and events for an interactive science centre; and a website/application that tracks, maps and graphs the progress of University spin-out companies. Most of our projects are responsive and we're as committed to the front-end user experience as we are to what's happening under the hood.<p>How we work<p>As a team we listen, learn, plan, design, build, test and deliver together. Whilst different people are responsible for their own part of a project, we all understand the importance of the chain and support each other to get things done. You'll be expected to manage your own workload and you won't ever have a project manager breathing down your neck. Our process is front-loaded with in-depth research and discovery rounds in which both developers and designers participate. This keeps scope creep to a minimum and deadlines and budgets realistic. We don't subscribe to unnecessary bureacracy and keep things streamlined and agile. You'll get to talk to clients too - we all share the successes and the challenges of a project together.<p>Learning<p>The web is constantly evolving so we expect you to as well. Experimentation and learning new skills is part of the fabric at Onespacemedia. Need some books or course materials? No problem. Want to try out some new techniques on a test project? No problem. Something you want to tell the world about a technology or trend? Blog about it on the website. We expect our team members to be passionate and knowledgeable about their field of expertise.<p>Lifestyle<p>Working at Onespacemedia is fun. We do serious work for serious clients but that doesn't mean we can't enjoy it. Expect plenty of laughter, music, company lunches, trips to the pub and impromptu ping pong battles. Just ten minutes walk from the station and ten minutes walk from the centre of Cambridge, the office is located just of Mill Road, the cultural heart of Cambridge (and probably the closest thing you can get to a London street outside of the capital). We're surrounded by green spaces, pubs, shops and cafés (including the legendary Hot Numbers). We've even got parking spaces. We operate a flexitime scheme too so those of you who are commuting from out of town don't have to spend four hours a day stuck in a traffic jam to and from work.<p>How to apply<p>Please send CV, covering note and links to any websites or applications you have created, or been involved with, to jobs@onespacemedia.com. We are open to enquiries from individuals seeking part-time and full-time work.","time":1367415990,"type":"comment"}