{"by":"btucker","id":5637871,"kids":[5640495],"parent":5637663,"text":"Brattleboro, VT / Cambridge, MA<p>User Interface Designer<p>Green River (<a href=\"http://www.greenriver.com\" rel=\"nofollow\">http://www.greenriver.com</a>) is looking for a designer to join our team. We're a Southern Vermont-based consultancy which was founded in 2000. We started writing production apps in Rails in '05 and have grown to a team of nine developers, two project managers, and a UX designer. We focus in the areas of Education, Health and the Environment. We work on many great projects such as a scoring system Starbucks uses to facilitate the inspection of 90% of the farms they buy coffee from[1], an archive of all the LEED certified buildings in the world[2], and storytelling software for people with memory loss[3].<p>If these types of projects sound interesting, we'd love to hear from you. You'd have the option of either working out of our beautiful Vermont office overlooking the Connecticut River, joining our new Cambridge-based team, working remotely, or some combination thereof.<p>We're looking for a team member who will:<p><pre><code>    * Work directly with clients to design their software using storyboards, mocks, \n      etc.\n    * Sketch, prototype, and implement user interfaces for tricky problems\n    * Design graphics and information visualizations\n    * Contribute to existing codebases and designs\n    * Communicate effectively with clients and developers\n    * Manage implementation of visual and interaction design\n    * Stay engaged with the latest technologies\n    * Think about &#38; share ideas for improving how we do things at Green River\n</code></pre>\nRequired Skills and Experience<p><pre><code>    * Solid understanding of user interaction design to maximize usability on \n      a variety of devices\n    * Experience producing semantic, responsive design, HTML, CSS, and JavaScript\n    * Experience working with developers to ensure seamless integration of front-end \n      and back-end functionality\n    * Experience designing for mobile\n    * Excellent communication skills\n\n</code></pre>\nEmail us: jobs@greenriver.com<p>-Ben<p>[1]: <a href=\"http://www.starbucks.com/responsibility/sourcing/coffee\" rel=\"nofollow\">http://www.starbucks.com/responsibility/sourcing/coffee</a><p>[2]: <a href=\"http://gbig.org/\" rel=\"nofollow\">http://gbig.org/</a><p>[3]: <a href=\"http://www.timeslips.org/\" rel=\"nofollow\">http://www.timeslips.org/</a>","time":1367416537,"type":"comment"}