{"by":"prophetjohn","id":5637741,"parent":5637663,"text":"Austin, TX | Full-time, Intern | Software Engineer<p>Come pair with me at mobi!<p>We're seeking talented, full-stack software engineers that are smart and get things done. We're most excited about finding seniors, but all experience levels are welcome. We're looking for candidates in, or willing to relocate to, Austin, TX.<p>mobi is a B2B mobile fleet logisitics solution. We help companies with mobile fleets service their customers better and faster by optimizing service routes and analyzing GPS data. This means we also help save fuel, tires and brake pads to keep the world a little bit more green.<p>Our tech stack contains a non-trivial amount of all of the following technologies:\nJava (Spring/MyBatis/Hibernate)\nRuby (Sinatra and maybe Padrino or Rails soon)\nJavaScript (AngularJS/jQuery)\nSQL (T-SQL and maybe Postgres or Mongo soon)<p>We're not dogmatic about the tech we use. We believe strongly in using the tool that helps us accomplish the task in the best and fastest way possible.<p>We don't expect you to be familiar with all of the technologies we use. There is a very strong learning culture at mobi. Therefore we do expect you to be willing (nay, excited) to learn about the tech we use that you don't know and to teach us about the tech <i>you</i> use that <i>we</i> don't know. We also expect you to be comfortable with test driving the code you write, with a pair, the large majority of the time. Of course, working in pairs doesn't <i>always</i> make sense, nor does TDD, and we're comfortable with those exceptions.<p>mobi offers competitive salary; competitive ping pong tournaments; free soda, snacks and beer; unlimited time off as needed; great views from our downtown office; monthly company get-togethers to celebrate our accomplishments<p>If you're interested, my personal email is in my profile. Here's an explanation of roughly what kind of interview process you could expect: <a href=\"https://news.ycombinator.com/item?id=5441267\" rel=\"nofollow\">https://news.ycombinator.com/item?id=5441267</a>","time":1367415128,"type":"comment"}