{"by":"ejdyksen","id":5637683,"kids":[5637989,5641194,5637801],"parent":5637663,"text":"Mutually Human - Grand Rapids, Michigan<p><a href=\"http://www.mutuallyhuman.com/\" rel=\"nofollow\">http://www.mutuallyhuman.com/</a><p>---------------------------------------<p>We are a small team of software craftsmen (10 of us right now) passionate about making people's lives better through software.<p>A little bit about us:<p><pre><code>  - We write custom software of all shapes and sizes for clients all over the US\n  \n  - Though everyone here is fluent in Ruby, we're more concerned with using the \n    right tool for the job. In the past two months, I've worked with Objective-C,\n    Javascript (Backbone+PhoneGap), and a little bit of Java and C#.\n  \n  - We practice a sustainable pace. We recognize that we each have lives, activities, \n    and families outside of work. Late nights and &#62; 40 hour weeks are rare by design.\n  \n  - We're agile, but not dogmatic about it. Our process evolves to suit our needs.\n  \n  - We offer competitive salaries, health/vision/dental insurance, 401(k) + match, \n    quarterly profit sharing, weekly catered lunches, and a top-floor office with\n    snacks, guitars, and your choice of standing or sitting desks.\n</code></pre>\nA little bit about Grand Rapids:<p><pre><code>  - 2.5 hours from Chicago, 2.5 hours from Detroit, and less than an hour to the beach.\n  \n  - Lots of great beer. Founders Brewery (a mile from our office) has 3 beers in the\n    Beer Advocate top 15. HopCat is a “World Class” bar on BA. \n    Just look here: http://beeradvocate.com/beerfly/city/43\n  \n  - Affordable housing. If you’re renting anything larger than a breadbox in the \n    Bay Area or NYC, you can afford a house here (or a much nicer rental). I bought \n    a nice house with a mortgage payment drastically lower than the rent of my \n    1 bedroom apartment in Mountain View.\n  \n  - A growing economy driven by technology, healthcare, and a growing list of startups. \n    The energy here around the growth in technology and the support for entrepreneurs \n    is infectious.\n</code></pre>\nA little bit about you:<p><pre><code>  - You love writing software, and you have a few years of experience doing it.\n  \n  - You learn new stuff quickly. You’ve used a lot of technologies, but you’re not\n    afraid to use more. It would be nice if you use and love Ruby, but not required.\n  \n  - You believe software is written for humans, not computers.\n  \n  - You want to come into work every day and enjoy the people you work with.\n</code></pre>\nIf you're interested, send me your resume/CV and a little bit about why you’re interested:<p>ej@mutuallyhuman.com","time":1367414443,"type":"comment"}