{"by":"joelg87","id":5638268,"kids":[5641831,5639014,5650759,5638783,5639177],"parent":5637663,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - Anywhere in the world (we're a distributed team of 11 people across the US, UK, Hong Kong and Sydney).<p>I'd love for you to come join Buffer for the fun ride. We have over 650,000 users and are on a $1.3m+ annual revenue run rate. There are some super interesting challenges ahead, as we are looking to pass a million users in 2013. We are expecting even faster growth in the coming months through our mobile efforts.<p>We need help on 2 areas right now:<p>1. Android:<p><pre><code>    - Android is our second highest source of signups for Buffer, only\n      trailing behind Web which was our original platform.\n    - our users love the app, which has a 4.3 rating on Google Play.\n    - the app has 100k+ total downloads and 3k daily active users.\n    - we work with Google Play, Kindle and Blackberry stores.\n</code></pre>\n2. Full stack:<p><pre><code>    - we get 1,500-2,000 signups per day on the web\n    - we have 160,000 weekly active users for our Chrome extension\n    - 4,500 API clients. Most popular: Feedly, IFTTT, Pocket, Instapaper\n    - we ship to production multiple times a day\n    - we have a data-driven process, with Einstein, our custom\n      built a/b testing framework\n    - ideally, experience in: PHP (Codeigniter)/Python, MongoDB,\n      Backbone.js Javascript, CSS, HTML\n\n</code></pre>\nWe're a small team of driven hackers and happiness heroes (our support people). Just like you, we're excited and passionate about engineering challenges and have some interesting architecture and scaling problems we work on.<p>If you're interested in coming on board, you will:<p><pre><code>    - work closely myself on Product and Sunil on technical\n      architecture\n    - ship to thousands of users and iterate quickly\n    - work with our metrics team to make smart changes\n    - be friendly and comfortable talking directly to customers\n      on issues and features\n    - be a happy, positive-minded and kind person who has a great\n      approach in dealing with others\n    - be a Buffer user (would be awesome, it’s cool if not)\n    - be anywhere in the world, and if you'd like, you have help and\n      support from us to move to where you want to be\n    - have experience working with another startup before (would\n      be awesome, it’s cool if not)\n</code></pre>\nSome aspects of Buffer culture that makes us a little different:<p><pre><code>    - we are totally transparent. We raised $450k, we currently\n      have 650k users and generate $110k/mo. Ask me anything else!\n    - within the company, all salaries and equity are open and we\n      have a formula for the distribution.\n    - we're all very focused on self improvement - we have daily\n      standups where we discuss our current improvements. This\n      could be waking up earlier, starting public speaking, blogging,\n      exercise, learning a language, etc.\n    - culture deck: http://www.slideshare.net/joelg2/buffer-culture-01-16707113\n</code></pre>\nSalary: 88k-110k depending on location (living costs) and experience.<p>Equity: 0.5-1%<p>If this sounds fun, let's chat. Send a note to Sunil (our CTO) about yourself, why you’re interested in Buffer, and any relevant links (Github profile, Android Apps, projects and background): thenexthacker@bufferapp.com<p>- Joel (Founder/CEO)","time":1367419833,"type":"comment"}