{"by":"troysultan","id":5638855,"parent":5637663,"text":"Grooveshark (grooveshark.com) - Senior PHP Developer - FT @ Gainesville, Fl HQ - email: troy@grooveshark.com<p>Grooveshark's Florida HQ is looking for a Senior PHP Developer to join us in rebuilding our PHP team and efforts. This leader will take charge of rebuilding our high quality, extensible, and scalable codebase. Can you handle leading one of the most talented dev teams in the southeast?<p>THE JOB:<p>Maintain existing PHP code and API.\nCreate new features and improve upon existing ones.\nImprove on the speed, cleanliness, and security of existing code.\nIdentify and eliminate bottlenecks.\nIdentify and implement new technologies and strategies for scaling purposes. (This means freedom to adopt new technologies you take a liking to and can vouch for.)\nAssist with code reviews for both current and prospective employees.\nWork with cool technologies like: memcached, MongoDB, Gearman, Redis, custom chat server developed in-house, hadoop and plenty more (experience with this tech not mandatory, but interest is!)<p>THE PERSON:<p>Enjoy writing high quality, easy to read, self-documenting code. Passion for learning about new technologies.\nHigh attention to detail.\nHigh LOC/bug ratio.\nAble to follow coding standards.\nWell versed in best practices &#38; security concerns for web development.\nMore pragmatic than idealistic.\nExperience developing on the LAMP stack (able to set up a LAMP install with multiple vhosts on your own.)\nExtensive experience with SQL.\nSome experience with Javascript, HTML &#38; CSS (though you won’t be required to write it.)\nSome experience with lower level languages such as C/C++.\nExperience with version control software.\nSense of humor.\nLove for music.<p>BONUS POINTS:<p>Well read in Software Engineering practices.\nExperience with an SQL database and optimizing queries for high concurrency on large data sets.\nExperience with noSQL databases like MongoDB, Redis, memcached, Nginx, Gearman,  - RabbitMQ, ActiveMQ, etc.\nExperience working on large scale systems with high volume of traffic.\nUseful contributions to the open source community.\nExperience with browser compatibility weirdness.\nExperience with Smarty or other templating systems.\nLaser Tag enthusiast.<p>PERKS:<p>Make-your-own work schedule.\nIn-house chef providing free meals everyday (including vegetarian.)\nFree laundry service.\nTickets to shows, concerts, and events.\nThe ride of your life!","time":1367424988,"type":"comment"}