{"by":"hyoogle","id":5638111,"parent":5637663,"text":"Likeable Local - Portland, Maine preferred, NYC/Boston also possible\nWe are seeking both Full Time and Summer Internships!<p>Likeable Local is a tech-startup-spinoff of the award-winning agency Likeable Media, and we are looking for Software Engineering Summer Interns and Software Engineers that will have the opportunity to jump right in and be on a small team developing features that  will be visible and impactful and used immediately.<p>We are looking for people that work hard, seek out new things, and love challenges, problem solving, and learning.  You want to be a substantial contributor and are interested in the “full stack” of technologies from details of server configuration, back-end, front-end, and mobile platforms.<p>Summer Interns: want to spend a summer in Portland, Maine?  (Our development all happens up here at <a href=\"http://www.thinktankportland.com/\" rel=\"nofollow\">http://www.thinktankportland.com/</a> ).  We are a close-knit, work-hard, play-hard team and we'll be doing at least one trip to the Likeable Local headquarters in NYC and also one Boston field trip for the summer (a Red Sox game outing) so we're planning to balance out the hard work and awesome learning experiences with some team fun as well!<p>Likeable Local offers an integrated software solution that allows small businesses to create, enhance and manage their social media presence.  Likeable Local was founded in 2012 and has a deployed product that integrates with Facebook and Twitter.  The software is sold on a subscription basis, allowing for attractive recurring revenue economics, and is already being used by a growing customer base in its initial vertical, dentists, as a result of a strategic partnership with Henry Schein.<p>You can apply here: <a href=\"http://likeablelocal.theresumator.com/apply/0HOlJC/Software-Developer-FullTime-Internship-Positions.html\" rel=\"nofollow\">http://likeablelocal.theresumator.com/apply/0HOlJC/Software-...</a>\nor just email me: hugh@likeable.com !","time":1367418570,"type":"comment"}