{"by":"lobasaurusrex","id":5638978,"kids":[5639004],"parent":5637663,"text":"Austin, TX (On-Site or Remote with Occasional On-Site)<p>Ember Endeavour for the Effervescent<p>MyTennisLessons.com<p>A bootstrapped company with over $100K in revenue (and now a part of the Austin Capital Factory accelerator). One awesome startup house in Austin, TX. A boxer-pug puppy named Heidi Klum. And an awesome team of six friends and colleagues.<p>We run a marketplace where students can purchase lessons online or over the phone with a nationwide network of tennis instructors. SEO is our game and over 75% of our customers come from organic traffic. Why tennis? Our founders met on the University of Connecticut tennis team and have been instructors themselves. We ran the business manually and with thousands of static pages for a whole year while teaching ourselves to code and eventually adding another rails developer to the team.<p>Summer nears and our application has come a long way. It works. But we want it to do more than work. We want it to provide an amazing experience, for our students, for our instructors, and for ourselves as we continue to build, test, and iterate. We want an Ember App.<p>Here’s some reasons why:\n-We sell lessons for individuals or groups of 2-6 in pre-set ‘lesson packages’, each with their own per-lesson-price. Which should be displayed as the student chooses their options. With one line of code.\n-Our existing tennis court location manager and schedule availability features are just calling to be Emberified\n-Happiness is a readable code base\n-Page loads are for suckas\n-And more<p>Think you can help get us there? Let us know. We’re a laid back group that enjoys working hard and generating value. Ideally we’d like to find another team member with some experience and looking to explore a new adventure. If you’re interested, send an e-mail introducing yourself and providing some links to code samples/contributions to michael@mytennislessons.com.<p>P.S. And yes, we know there’s other types of fitness professionals out there who could use a similar service. Coming soon to a website near you ; )","time":1367425947,"type":"comment"}