{"by":"djgrant","id":5639146,"parent":5637663,"text":"KashFlow, London - Front-end developer<p><a href=\"http://www.kashflow.com/blog/front-end-developer-vacancy/\" rel=\"nofollow\">http://www.kashflow.com/blog/front-end-developer-vacancy/</a><p>At KashFlow we are not shy of taking the road less travelled. Right now we are redefining how SaaS products get delivered by building a first-of-its-kind application.<p>Bucking the common trend to build multiple native apps, which we feel is the antithesis of SaaS development, we are building a responsive single page web application. We don’t know of any other large scale apps (certainly none in this sector) that are targeting so many devices with a single codebase. But we are not about sticking with the pack.<p>That’s where you come in. We’re looking for the Indiana Jones of web development, a front-end dev who can navigate through the multi-platform/device/browser jungle that is the modern web.<p>You’ll be joining a team of passionate web geeks in our London office working for a profitable, fast growing startup. We’re not dependant on rounds of VC funding to stay afloat and your work will quickly find it’s way into the hands of thousands of existing users.<p>What you will bring to the team is technical expertise building interactive UIs and a wealth of experience making web applications work across different devices and browsers. Bonus points if you’ve got experience working in a client side application architecture as well.<p>You are obsessed about details. You do a sneaky victory dance whenever you knock 7ms off render time. You do more than just make things work. You come up with ingenious and elegant solutions, and you understand the quirks that make browsers behave differently. Although design isn’t necessarily your thing, you still work tirelessly to achieve pixel perfection.<p>You’re someone who stays up-to-date with what’s happening at the leading edge of web development. You easily formulate your own ideas and are able to make clear arguments for your opinions.<p>Core Skills<p>* JavaScript<p>* HTML/CSS<p>* RWD<p>* Code profiling, perf and optimisation<p>* Tooling (e.g. Chrome DevTools, the Command Line)<p>* Best practises (be prepared to write them)<p>Bonus points!<p>* Client side application frameworks, i.e. Backbone.js (hint: we use Backbone.js)<p>* Scrum/Agile<p>* Version control<p>* SASS<p>* REST (API, not sleeping at your desk)<p>Type: Permanent<p>Hours: Mon-Fri, 9:00-17:30<p>Salary: DOE<p>Benefits: Private medical insurance, 21 days paid holiday<p>You need to be ambitious and able to turn a list of problems into a list of solutions. We’re a fun loving office so a good sense of humour is expected, not to mention all four of the attributes listed at <a href=\"http://www.kashflow.com/blog/i-p-e-a-the-four-attributes-you-need-to-work-in-a-startup/\" rel=\"nofollow\">http://www.kashflow.com/blog/i-p-e-a-the-four-attributes-you...</a>.<p>If you think this is you, then send me an email (daniel kashflow com) with your CV, a link to your GitHub profile, salary expectations and a covering letter explaining why you want the role, as well as what you bring to the table.<p>Please note: NO AGENCIES.","time":1367427404,"type":"comment"}