{"by":"mattnguyen","id":5639654,"kids":[5640277],"parent":5637663,"text":"Tapjoy - SAN FRANCISCO<p>About Us:<p>Tapjoy is a mobile advertising and monetization platform whose unique Mobile Value Exchange model allows users to select personalized advertisements with which to engage for virtual rewards or premium content. Tapjoy helps unlock mobile joy by empowering more than one billion mobile users who choose to watch videos, subscribe to services, install applications and participate in other types of advertisements in exchange for virtual rewards they can use in their favorite apps. Tapjoy’s turnkey in-app advertising platform helps developers acquire cost-effective, high-value new users and monetize their applications, while its powerful advertising marketplace lets brand advertisers reach a global mobile audience spanning more than 20,000 applications. Tapjoy is backed by top-tier investors, including J.P. Morgan Asset Management, Rho Ventures, North Bridge Venture Partners, InterWest Partners and D.E. Shaw Ventures. Headquartered in San Francisco, the company also has offices in New York, Boston, Los Angeles, Chicago, Atlanta, Santa Barbara, London, Paris, Dusseldorf, Beijing, Shanghai, Seoul and Tokyo. For more information, please visit www.tapjoy.com.<p>Please email matthew@tapjoy.com to apply and put \"HN\" in the subject line.<p>---------------------<p>DevOps Engineer<p>Responsibilities:<p>Tapjoy is a rapidly growing company with strong revenues and solid market share, and is currently seeking an experienced DevOps Engineer to help architect, build and monitor our applications and systems infrastructure.  This is a high-impact role in a fast-paced organization that is poised for massive growth and success.  We value those with exceptional technical skills who want to work with others in a fun, challenging and ever-changing environment.  Essential duties and responsibilities may include, but are not limited to, the following as additional roles and/or focus will be needed as the company and department continues to grow and evolve:<p>Define and implement automated system installation/configuration procedures in a Linux environment\nImplement and deploy scripts/tools to facilitate error free and repeatable software deployment processes\nContribute to planning efforts for disaster recovery, capacity expansion, component upgrading and system hardening\nIdentify problems and inefficiencies in the current environment and making strategic recommendations for future improvements\nProduce and maintain documentation on installations, incidents, and procedures\nHelp with log collection and analysis\nTroubleshoot performance issues\nContribute expertise in specific technical areas to the team as a whole\nAd hoc projects depending on needs of Engineering team\nQualifications:<p>B.S., M.S. or Ph.D. in Computer Science or equivalent\nStrong Systems Administration skill set in a Linux-based environment (Ubuntu)\nAdvanced scripting language experience with Ruby;  Python or Perl are also okay\nConsiderable knowledge of web application infrastructure and Amazon Web Services preferred\nPractical object-oriented programming experience (Git/Github)\nSelf-starter, able to tackle projects from start to finish without a lot of hand-holding\nComfortable collaborating with other engineers<p>---------------------<p>Frontend Engineer<p>Responsibilities:<p>Tapjoy is seeking a Front End Software Engineer.  Our team is a small collaborative highly talented group with a number of interesting technical challenges that will excite either the best of mobile front end application developers or the bright upstart.  Essential duties and responsibilities may include, but are not limited to, the following as additional roles and/or focus will be needed as the company and department continues to grow and evolve:<p>Work closely with the design, product and engineering teams to define and develop the company’s next-generation mobile-optimized web applications\nUsing the latest web technologies, work closely with our UI/UX designers to translate product specs/mocks into fully functional user interfaces.  You’ll get to drive our HTML5-based cross-platform technology\nBuild and maintain extensible cross-browser/cross-device front end code.  Tens of millions of users will see and use what is built overnight\nRequirements:<p>B.S., M.S. or Ph.D. in Computer Science or equivalent\nSolid experience in building cross-browser web applications using HTML, CSS and JavaScript\nSolid understanding of object-oriented JavaScript.  Experience with design patterns a plus\nExperience with Ruby on Rails (highly desired), SQL and unit/functional testing\nExperience with building JSON/AJAX web services\nWorking knowledge of current web standards such as HTML5 and CSS3\nWorking knowledge of front end optimization and performance techniques\nProficiency with Photoshop\nExperience developing mobile-optimized web applications, (i.e. iOS or Android apps) a plus<p>---------------------<p>Sales Engineer<p>This Sales Engineer will be responsible for enabling customer success by ensuring that customer environments are integrated and go live with the Tapjoy platform within 24 hours.  This is a key client-facing role that is the point-of-contact for providing post-sales solutions, resolving technical challenges and finding the answers to open issues during the integration process and ongoing account technical support.  A secondary responsibility is to work closely with the Developer Relations and Sales organizations to provide pre-sales technical support to help close new customer accounts.  Essential duties and responsibilities may include, but are not limited to, the following as additional roles and/or focus will be needed as the company and department continues to grow and evolve:<p>Answering support tickets/requests from iOS and Android developers integrating Tapjoy's ad products\nServe as \"Subject Matter Expert\" for all Tapjoy ad products internally and externally\nAssist in writing and updating Tapjoy's external developer focused documentation\nManage and troubleshoot integration issues on an on-going basis with our partner network \nWork closely with the product, engineering and QA teams to provide customer feedback and help guide development of new products and features \nSupport sales/account management teams with technical questions and issues, including demos, Q&#38;A and sales tools\nDevelop best practices in the mobile advertising and monetization space and help Tapjoy partners optimize their apps\nRequirements:<p>A technical degree from 4 year university (e.g. computer science, engineering, math, etc)\n2 years experience in a technical support or customer service role\nExcellent written and verbal communication skills\nSolid partner management skills from a previous customer-facing role or as an engineer with external responsibilities\nWell organized with strong attention to detail\nMust be able to excel working cross-functionally, supporting multiple groups within the company\nSelf-starter, someone who manages multiple projects simultaneously and drives to completion\nFlexibility, resourcefulness and the ability to thrive in a dynamic, fast-paced environment\nExperience explaining concepts over the phone and writing technical concepts for many different audiences.\nThe capacity to quickly absorb new concepts and technologies\nDesired Skills:<p>Internet advertising and/or software company background\nWorking knowledge of Objective-C and Java preferred\nUnity, PhoneGap and Adobe Air experience\nExperience in writing SQL queries\nBonus Points:<p>You've developed and released an app in the iOS App Store or Google Play Store\nYou've integrated Tapjoy into a mobile app in the past\nOther:<p>Minimal travel.  Most work is conducted on the phone, via email and online\nThis is a position that reports to the Business Development team, not the Engineering team.<p>-------------------","time":1367431330,"type":"comment"}