{"by":"dayjah","id":5639922,"parent":5637663,"text":"Twitch.tv / YC / great investors / great partnerships / CEO is a YC board member / crazy growth / cool industry / Downtown San Francisco<p>Many positions! Help us continue to push watching both pro and personal video gaming main stream. We've hit on a strong product market fit and we're growing hand over fist right now. As such we have need for:<p>- backend engineers[1]<p>- product engineers[2]<p>We're analytical about the work that we do and you should be too. You should also care about getting things done right, and be pragmatic about when to choose speed over quality, if you opt for the former you're the type of engineer that makes a note that you shorted on quality and you'll come back and fix that up.<p>We keep small engineering teams (usually no more than 10 people per team), this permits us to own what we work on. It is one of the best things about working here in my experience!<p>The low down on the positions:<p>[1] - Backend Engineers<p>With 30m MAU (last published number... it is bigger now!) our backend engineers work to keep our service humming along with five nines of uptime. Your work would include not only improving core pieces of infrastructure but also envisaging new pieces that we do not have yet that will help take us to the next level. Some examples of things that have been done recently:<p>- migration to ruby 1.9<p>- built out a new IRC chat server which handles ~1000 qps. Best thing here is we slotted this in and no one noticed (except that chat was more stable, etc).<p>- Created a brand new API to access our data, this is used by Activision (Call of Duty: Black Ops II), EA (EA origin) and PlanetSide II, Smite, amongst a wide array of other game devs.<p>- Replaced a core piece of infrastructure used to let us know what streams are live, and what content they have on them. Again, this has been done without anyone noticing - its main win was taking us from needing 8 app servers to being able to handle all the load on one, but we run a couple of resilience.. naturally<p>We've a bunch of other coolness in the pipeline.<p>[2] - Product Engineers<p>One of the reasons we're growing so fast is that we're starting to churn out high quality features and general product improvements. There is still so far to go, the twitch you see now is as a result of dedicating much of our engineering work to scaling, in that time we've hired some kick ass product engineers and they're starting to push us forwards.  Some things we've worked on recently:<p>- migrating site over to emberjs<p>- \"Turbo\" - ad free watching on all channels<p>- key product improvements: vod watching, vod creation<p>- new flash player - faster, less resource intensive, easier to build new features on<p>- payment provider integrations - aiming to make it as easy to pay in various geos as is possible.<p>We've a bunch of other coolness in the pipeline! (yes, there is an echo in here...).<p>Feel free to hit me up if you're interested / have questions / want a tshirt, etc, I head up our engineering team: ossareh at twitch.tv","time":1367433427,"type":"comment"}