{"by":"normamulligan","id":5639435,"parent":5637663,"text":"Avego (www.Avego.com) - Cork, Ireland<p>We have a growing and dynamic web applications development team and are looking for a real hot-shot who has the experience, and the drive, to join this fast-paced, high performance development team.  If you’re an experienced web developer who thrives on producing wicked, real user solutions, and you’re intrigued by companies that produce awe-inspiring solutions that change the user’s world, then we should meet.<p>What the job is about: \nWorking with REST-ful API’S to develop web applications; this is a JavaScript intensive position that requires excellent knowledge of the DOM, cross browser intricacies and user interface design.  Strong web application design and development experience is essential, involving client and server-side MVC frameworks.  This role requires the ability to work across various team environments and use of strong communication skills to interact with clients as needed.  The ideal candidate will be committed to:<p>•\tLearning new technologies and techniques\n•\tAdopting the best and most applicable aspects of these emergent technologies and techniques to Avego’s web development projects\n•\tKeeping abreast of emerging trends in the web industry<p>What we’re looking for: \n•\t 4 years  + with core web technologies (HTML5, Javascript, Ajax, DOM, CSS3)\n•\t4 years + server-side web frameworks (one or more of Java, NodeJS, PHP, Rails, Grails, etc)\n•\tExposure to Design Patterns\n•\tExperience with refactoring and code quality \n•\tKnowledge of web standards, principles and practices\n•\tUnderstand the intricacies and insanities of cross-browser development\n•\tAbility to work independently from assignment through completion\n•\tAn eye for design and layout\n•\tUsability experience<p>And what’s desirable:<p>•\tJavaScript library experience (jQuery, Backbone, YUI, Prototype, Mootools, ExtJS, etc..)\n•\tGrails, Struts, Spring MVC\n•\tJSP, GSP\n•\tFamiliarity with Eclipse<p>Additional Information<p>Please note that any applicants must successfully complete and pass a technical assessment before an interview is given. Examples of previous work are essential. Any examples you have of your development, especially where those include Javascript and HTML5 technologies, should be highlighted, as we highly value seeing real development projects.<p>Eligibility Requirements\n•\tApplicants must have legal authorisation to work in Ireland.  We will consider sponsoring applicants for employment permits, depending on their experience level, relevant to this position\nTo apply: \nPlease send your CV, in strict confidence, to norma.mulligan@avego.com and we will be in touch.","time":1367429862,"type":"comment"}