{"by":"willholley","id":5639310,"parent":5637663,"text":"Bluewire Technologies - Bristol, UK\n<a href=\"http://www.bluewire-technologies.com/\" rel=\"nofollow\">http://www.bluewire-technologies.com/</a><p>We are a small (currently 6), established team building innovative software for health professionals in the UK. There are many interesting challenges around data modelling, UI / UX, scaling, mobile, security - it's an exciting space to be in! We're passionate about providing healthcare workers with world-class clinical software, and we're in it for the long-term. The working environment is relaxed, but we get things done. We'll give you great kit and support you working from home as and when you want to. Salary is competitive and depends on the candidate.<p>We're always interested to hear from any talented engineers, but specifically we have a need for:<p>A front-end / mobile engineer. You would suit this position if:<p><pre><code>  - You've worked on at least one web project of significant complexity.\n  - You know what jQuery, backbone and SASS are and when they are useful.\n  - You know how to architect for performance and can reason about trade-offs.\n  - You are already building mobile web applications or keen to learn.\n  - You like to take responsibility for UI design and improving the user experience.\n  - You've led a small development team before or have an interest in taking a step in that direction.\n</code></pre>\nA lead devops / sysadmin:<p>You'd be responsible for deploying, monitoring and tuning our web-application on customer servers - currently 40 servers over 14 sites with an expectation that this will increase significantly in the next 18 months. At the moment this task is performed by a member   of the development team and we are now reaching a scale where we need somebody in a dedicated role. You'd be responsible for scheduling and deploying builds to staging and production environments, \"owning\" the the release management processes and working with our developers to troubleshoot performance / reliability problems as they arise. You'd suit this position if:<p><pre><code>  - You understand how to administer SQL Server and use the performance profiling tools.\n  - You can troubleshoot IIS and understand how it interacts with ASP.NET. \n  - You know how to use Windows performance counters to diagnose problems.\n  - You're a methodical problem solver and enjoy working with customers.\n  - You appreciate the relationships between people and task automation.\n</code></pre>\nIf this sounds like you, shoot me an email: will@bluewire-technologies.com","time":1367428951,"type":"comment"}