{"by":"natemeagher","id":5639865,"parent":5637663,"text":"New York, NY - Animoto<p>We're Animoto, a video creation platform that automatically produces stunning music videos using images, video clips, and music.  Here are our current openings:<p>Software Engineer - Front End\nAnimoto is looking for a well-rounded front-end engineer who is passionate about developing beautiful user interfaces using the very latest in web technologies, with a keen eye for design details and a strong grasp of best practices.  Full details: <a href=\"https://hire.jobvite.com/j?bj=o8jnXfwv&#38;s=Blog\" rel=\"nofollow\">https://hire.jobvite.com/j?bj=o8jnXfwv&#38;s=Blog</a><p>Software Engineer – Platform\nWe're looking for great software engineers to build out the Animoto Platform.  These services operate at scale to power internal applications such as Animoto.com, the Animoto iPhone app, the Animoto Facebook app in addition to external APIs.  We want to significantly expand the Platform's capabilities in 2013 and need excellent engineers to help.  Full details: <a href=\"https://hire.jobvite.com/j?aj=oOsoXfwl&#38;s=Blog\" rel=\"nofollow\">https://hire.jobvite.com/j?aj=oOsoXfwl&#38;s=Blog</a><p>Software Design Engineer in Test\nWe're looking for someone who loves to write software to break software, but isn't above doing some manual testing, too.  Want to fuzz our rendering engine?  Want to do some model-based testing of Animoto.com?  Want to rip open all the tiny cracks in our infrastructure to see what bursts into flames?  Then we want you.  Full details: <a href=\"https://hire.jobvite.com/j?aj=ovvoXfw5&#38;s=Blog\" rel=\"nofollow\">https://hire.jobvite.com/j?aj=ovvoXfw5&#38;s=Blog</a><p>Software Engineer - Mobile:\nWe're looking for talented mobile software engineers who want to work on cutting edge problems in the video, image and service-oriented architecture domains!  In the process, be an integral part of a team that is rapidly innovating how users create and share their memories through video.  A strong background in Computer Science is highly desirable, as is a background building iOS and Android apps in the past.  Full Details: <a href=\"https://hire.jobvite.com/j?aj=ohQnXfwb&#38;s=Blog\" rel=\"nofollow\">https://hire.jobvite.com/j?aj=ohQnXfwb&#38;s=Blog</a><p>Software Test Engineer:\nAnimoto is looking for testers who would love to find new ways to break everything from our website to apps to our rendering engine and more!  We need testers who will be comfortable inside the engineering team, working with teams throughout the rest Animoto, and listening to customers to find new ways to improve the test team and the product in general.  Full details: <a href=\"https://hire.jobvite.com/j?aj=ovvoXfw5&#38;s=Blog\" rel=\"nofollow\">https://hire.jobvite.com/j?aj=ovvoXfw5&#38;s=Blog</a>","time":1367432954,"type":"comment"}