{"by":"infer","id":5639869,"parent":5637663,"text":"Palo Alto, CA - Infer, Inc.<p>We are Infer. We use a wide array of data science techniques -- machine learning, information retrieval, entity reconciliation, you name it -- to help companies do more with their customers.<p>We want to bring this type of data intelligence into the enterprise space. Companies like Google and Facebook are developing very fancy algorithms and pushing the state of the art to bring amazing insights into... which cat video you should click on next? Incredible smarts are being applied for seemingly trivial things in the consumer space, while in the enterprise space, decision-making is still mostly gut-driven, at most supplemented by a few Excel charts. This shouldn't be. Enterprise companies, who are solving important problems and paying salaries, whose survival depends on allocating their limited resources optimally, need to be brought forth to the cutting edge. They need to leverage their data better. They need to make their decisions smarter.<p>This is what we do. We identify problems that are common across companies and are ripe for more intelligence, and we build end-to-end solutions that alleviate those pain points and create value. Our growing list of paying customers include Box, Yammer, Zendesk, Jive, Tableau and Rackspace, and we're just getting started.<p>And we're excited to have recently raised $10 million in Series A funding, led by Redpoint Ventures, with participation from Andreessen Horowitz, Social+Capital Partnership, Sutter Hill Ventures, Nexus Venture Partners, and many esteemed angel investors:<p><a href=\"http://www.businessweek.com/articles/2013-04-24/infer-promises-more-sales-through-better-math\" rel=\"nofollow\">http://www.businessweek.com/articles/2013-04-24/infer-promis...</a><p>We're building an amazing team with folks from MIT, Berkeley, Stanford, Google Research, Microsoft Research, IBM Research, Yahoo Research and Palantir, so if you're an engineer eager to work on a product that will provide real value and alleviate some real pain points for its users, and if you're hungry to help us grow and shape our young startup, please check out <a href=\"https://www.infer.com/careers.html\" rel=\"nofollow\">https://www.infer.com/careers.html</a> and drop us a note!<p>(PS: Oh yeah, the next cat video for you is this one: <a href=\"http://www.youtube.com/watch?v=A-u8sLbBcnk\" rel=\"nofollow\">http://www.youtube.com/watch?v=A-u8sLbBcnk</a>)<p>Thanks for reading.","time":1367432995,"type":"comment"}