{"by":"glaugh","id":5639266,"parent":5637663,"text":"Statwing<p>Front End Engineer<p>Radically improving the UI for data analysis is the core challenge of our company. As our first hire and only front-end specialist, you'll drive the function and feel of our UI, creating entirely new ways of interacting with data. You’ll meet weekly with the designer of the TiVo UI (an advisor of ours) to sketch out solutions to extremely challenging usability problems, which you'll then implement. You'll code in HTML, CSS/LESS, Ruby, and Coffeescript, using Bootstrap, Backbone, Underscore, jQuery, and d3. And as the first hire, you’ll earn significant equity and help shape our culture.<p>The ideal candidate:<p>. Excited about taking responsibility and ownership over big pieces of the product<p>. Comfortable with UI and UX challenges. Graphic design skills are a bonus (we currently have none)<p>. Interested in data analysis<p>. An extremely talented programmer, skilled with front end tools like HTML, CSS, and Javascript/Coffeescript<p>. Familiarity with the other tools listed above is a bonus<p>. Deeply concerned with system reliability, code quality, and front end architecture<p>. Open to asking for help, taking feedback, collaborating, and generally being a team player<p>. Humor. Has a sense of it.<p>Back End Engineer<p>Statwing's users demand larger data, more complex analyses, and faster interaction. We'll need to optimize regression, graph, and dozens of other statistical algorithms to efficiently handle wildly diverse datasets. Those analyses will sit on a robust data-handling system that finishes analyses before our users even know they need them. And Statwing's deep interaction and data exploration needs to feel like it's happening locally even when it's not.<p>The ideal candidate:<p>. Excited about taking responsibility and ownership over big pieces of the product<p>. Comfortable with efficiently handling and processing relatively large amounts of data.<p>. Interested in data analysis.<p>. Very comfortable with Python. Some experience with Clojure is a bonus.<p>. An extremely talented programmer, skilled in dealing with performance tradeoffs and bottlenecks.<p>. Deeply concerned with system reliability, code quality, and back end architecture.<p>. Open to asking for help, taking feedback, collaborating, and generally being a team player.<p>. Humor. Has a sense of it","time":1367428606,"type":"comment"}