{"by":"lsc","id":5640565,"kids":[5640648,5642290,5640854,5641461,5642411,5641481,5713522],"parent":5637663,"text":"So, uh, I'm looking for an entry-level sysadmin/data-center monkey.  You could call this an intern type position, but I don't care if you are in school or not.<p>Prgmr.com rents virtual private servers, dedicated servers, and datacenter space.  Right now, we have 3 full-time folks, counting me, and two part-timers but I'm the only hardware person, and only two of us are local.<p>So, there are several catches.  the first?  I can't afford a full time person for at least two months.   If you are willing to show up and work between then and now?  $15/hr on a 1099.  After those two months (and after I'm done paying for twice the co-lo I need)  we can talk about going full time W2.  (prgmr.com pays for Kaiser, if you are full-time)<p>Now, I do have an arrangement with a local refurbished server and network hardware dealer;  I give him a good entry level person, he'll hire them full time with health insurance and stuff (for a little more than I'm paying;  not a lot more, this is definitely still entry-level pay.)  and he'll rent you back to me on a per-day basis at a discount (sort of as a referral bonus to me.)   - so that's one way you can make this full-time before I stabilize prgmr.com.   Note, he's based out of mountain view, and I'm in Santa Clara and all of this is very much hands-on work.<p>So yeah, what I need is someone I can teach how to handle my layer-1.   I need my shit wired up, I need it wired up neatly (I can train you in cable lacing, but the neater you are, the better.)   I need all my ports labeled inside my network gear (I can show you how to do this; Serial ain't rocket science.)  and inside my PDUs.<p>This would be pretty good for someone studying up on their CCNA or something;  I probably have obsolete hardware I could give you for your lab, too.<p>I need someone I can train up to set up my IPMI out of band access.  Again, I can train, it's not hard.    Again, experience using the command line helps a lot.<p>I also need someone who can handle racking/stacking servers, dragging servers to the car and back.  You need to be able to safely lift 50lbs, (and more importantly, you need to ask for help when you /can't/ lift safely.  pester the security guys;  they will usually help, and if not, call me.)  and you need transportation that can handle 50lb servers.  (meh, if you have transportation, we can probably work something out with the hauling.  I've got an old van I loan people.)<p>You need to be able to handle ssh, and ssh with public key authentication with minimal help from me.<p>So, the way I usually do this is that people email me, we go back and forth a few times (I won't hire you if you can't communicate via email... sorry, just one of my things.)  then next time I need help I call you up.   You show up and work.  I pay you (check, but if you want we can drop by the bank and get it cashed for you same day... just when I pay cash the accountant gets mad at me)   If you do well and I need help again, i call you back;   At these rates, (and especially with this (lack of) stability) it's not fair to expect you to interview for free.<p>So yeah.  Entry level.    If you seem teachable, I don't care if you are currently unemployed.<p>I demand honesty, but not loyalty;  by that, I mean I'm realistic. I'm not going to be angry if you move on to a better paying job quickly.<p>Especially at first, while we're just doing 'as needed' gigs?  I'm understanding about your schedule;  I don't demand you drop everything for me.  (Once you go full time, we'll have to talk more about this.   I do eventually want someone besides me to be hardware on-call, but I understand that needs to be worth your time, and this offer probably is probably not good enough to get you to let me drag your ass out of bed at 2am.)","time":1367440042,"type":"comment"}