{"by":"davidjnelson","id":5640597,"parent":5637663,"text":"Proximic, Palo Alto, CA<p>Building \"The Bloomberg of the Online Advertising Ecosystem\": Proximic is setting the new golden standard of real-time Data Services in display advertising and we are delivering big data insights and solutions for marquee customers in the industry. Proximic specializes in Contextual and Brand Protection Data to improve ad targeting, and Audience Interest Data to improve predictive modeling. Our non-linguistic contextual profiling technology called Pattern Proximity™ along with our Dynamic Category Matching™ engine provides the most granular, accurate and actionable data in the market.<p>Proximic is a privately funded company based in Palo Alto, backed by successful investors. We are a team consisting of industry veterans and smart people who love making a difference in the industry, are thrilled with the current opportunities in the ad tech and data space, and enjoy what we do. We're looking for talented, motivated and impactful people to help our business grow!\nCome help us scale in the marketplace.<p>Java Engineer<p>We are looking for a dynamic contributor to Proximic's core development team, who enjoys building innovative technology and applications designed for huge scale and effectiveness. Work with us to create game-changing products for the advertising data space, that have immediate market impact with large, well-known customers. This position is full-time and based in our main office in downtown Palo Alto, CA. Applicants must be suitable for immediate employment.<p>Responsibilities<p>- Develop extensible, scalable, reliable software for distributed processing/ querying and responsiveness<p>- Propose and test improvements to ad targeting, optimization, brand protection and test algorithms<p>- Understand and affect the product direction related to data-driven applications that emotionally excite and financially benefit our customers<p>- Adhere to modern development processes (task breakdown &#38; estimation, code reviews, unit tests, version control, ...)<p>- Participate in the full development cycle from scoping to implementation within realistically aggressive time frames<p>Requirements<p>- B.S. Computer Science or equivalent experience preferred - M.S. or Ph.D. a plus<p>- 3+ years experience of in server side development of multithreaded, complex, scalable systems<p>- 5+ years of systems-level/core Java\nStrong experience in building high performance applications and using different caching techniques in real world situations<p>- Proven track record of excellent coding skills to write reliable / clean and maintainable software<p>- Structured thinker, effective communicator, excellent programming and analytic skills<p>- Good understanding of algorithms, data structures, performance optimization techniques, and object-oriented programming in Java<p>- Experience in online advertising systems (display or SEM), computer linguistics, applied statistics and/or machine learning a plus<p>- Start-up-comfort: wear many hats in a fast-paced environment, willing and eager to learn and design new technologies; must be flexible in approach<p>- Highly self motivated, proactive, hardworking innovator with a \"team-first\" attitude<p>Contact jointeam@proximic.com and mention that you saw our post on hacker news.","time":1367440423,"type":"comment"}