{"by":"elemeno","id":5640304,"parent":5637663,"text":"DictateIT - London (North), UK - Fulltime<p>We're the UK's largest provider of digital dictation services to the NHS, having processed over 120 million lines of dictated letters and patient notes in the last year over more than two dozen hospitals and NHS Trusts using the platform we've built that covers everything from dictation caption through to voice recognition and outsourced transcription and then to digital signing and distribution. As we go forward we're using our platform as a way to give hospitals better tools to manage their patient information and records and help the NHS work more efficiently, as well as seeing what other services we can build using our large corpus of medical documents as a starting point.<p>I'm building a small but dedicated team of developers who are excited about what we're trying to do and interested in taking on new challenges while trying to bring innovation and disruption to health care in the UK. We're profitable and at the point where our growth is rapidly accelerating - we've winning tenders left, right and centre and all of our current clients are adding more users and departments to our current deployments.<p>Our current platform is front to back C# - WCF, ASP.NET MVC, WinForms and WPF, with SQLServer on the backend.<p>I'm looking for solid C# and ASP.Net developers from Junior to Senior level, though having specific C# experience is secondary to being willing to learn quickly and being passionate about technology as long as you've got other languages you're strong in.<p>Having experience in DB design and query tuning would be of special interest as we're dealing with high volumes of patient information and 100Gb+ datasets on some of our sites and we want to keep our system running as fast as possible!<p>We're looking to hire several developers, offering between £25k-£50k depending on skill set and experience. If you're interested or you've got any questions, drop me an e-mail at tech.recruitment@dictate.it and I'll do my best to answer anything you ask!","time":1367437221,"type":"comment"}