{"by":"londont","id":5641684,"parent":5637663,"text":"ZenPayroll<p>UX Designer, Full Time, San Francisco - funded $6.1M<p><a href=\"http://www.zenpayroll.com\" rel=\"nofollow\">http://www.zenpayroll.com</a><p>jobs at zenpayroll.com<p>-----------<p>We're building the future of payroll. We launched in 2012 (<a href=\"http://zenpayroll.com/press\" rel=\"nofollow\">http://zenpayroll.com/press</a>) and raised $6.1M in our first round of financing so we could focus on building a long term foundation for the company. Our investors include the CEOs of Dropbox, Yelp, Yammer, Box, among others, as well as Google Ventures and Salesforce (full list at <a href=\"http://zenpayroll.com/investors\" rel=\"nofollow\">http://zenpayroll.com/investors</a>). We currently have a product that our customers love, and we're processing millions of dollars in payroll every month. Our founders are second time entrepreneurs from Stanford who have had two prior exits. We're hungry to build something truly great and we're in this for the long haul.<p>At ZenPayroll, you will:<p>(1) Be an owner of what you build.<p>(2) Conceptualize, design, and build product experiences that make users smile.<p>(3) Design a product that processes millions and millions of dollars in payroll.<p>(4) Understand customer pain points, come up with solutions, and then prototype, iterate, and launch frequently.<p>(5) Design and build landing pages, email campaigns, icons, infographics, and application features.<p>If solving a real pain point for millions of people gets you excited, we'd love to speak with you.<p>To apply, send a note to jobs [at] zenpayroll [dot] com and include your (1) portfolio, LinkedIn, GitHub, resume, and/or any project/portfolio pages. (2) a note on why you are interested in ZenPayroll, and (3) share with us something you've done which you are most proud of and why.<p>This job is located in San Francisco, CA. You must be local or willing to relocate (we'll cover the cost).","time":1367453761,"type":"comment"}