{"by":"timv","id":5643065,"parent":5637663,"text":"Sydney (Darlinghurst), Australia<p>SiteTour is looking for a full-time developer to join our team.<p>We're a small startup - currently it's 2 full-timers (1 business, 1 tech [me]) plus some freelancers, advisors and partners. We're building a platform for the out-of-home advertising industry (billboards, bus shelters, buses, shopping centre panels, etc)<p>Our current tech stack is Java (GWT/Spring/Hibernate), Geoserver, AWS (EC2, S3, RDS), MySQL; but it's not set in stone.<p>It's a full stack analysis+development role, taking changes from requirement through to testing, from front-end through to the database, and also assist in providing operational support for the live site.<p>We have lots of opportunities that we're working through, and things are pretty fast-paced, so we need someone who is happy to receive requirements that are very loosely defined, flesh them out, produce a design (either in your head, or on paper depending on the size of the work) and then see it through development and testing.<p>We're based in Darlinghurst (Sydney, Australia) and we're looking for someone who can be physically present in the office, but there's plenty of flexibility (we're happy to have a mix of work in the office/work from home). Sorry, we're not set up to sponsor overseas applicants at this time.<p>The things we care about (in rough order)<p>- Good cultural fit. It's a small team so we'll be seeing a lot of each other, and we want that to be something we're all happy about<p>- A team player who can work with minimal supervision. We're busy and everyone's got a lot on their plate, so we want to be able to help each other out, but we also need everyone to be able to pick up their own work and run with it.<p>- Happy to work full stack &#38; full life-cycle. One day might be spent brainstorming how we want some end-user features to work, and the next day spent neck deep in code. If you like that sort of variety, that's a good thing.<p>- Happy to work with our technology stack, and able to productive quickly. I don't care too much whether you have GWT or AWS experience, as long as you're happy to work with it, and happy to put the effort in to get up to speed fast. Obviously if having experience makes those things easier.<p>In return we can offer<p>- Flexible work arrangements. Both of us (the 2 full-timers)  have young kids, so if you're in a similar situation we're happy to talk about how we can accommodate.<p>- A chance to do Java development in Sydney without working for a bank/telco/consultancy. Those who work in Sydney will know that there's only a handful of interesting companies, and the rest is big corporate dev work (I know, I've done lots of it). If you've got a Java skillset but want to break out of that world, then here's an opportunity.<p>- A fun office environment. We share office space with a couple of like-minded companies, and I think it's a fun place - hopefully you will too.<p>Feel free to ask questions here, or email me<p><i>User:</i> tim<p><i>Domain:</i> sitetour.com.au","time":1367478866,"type":"comment"}