{"by":"sean9999","id":5663015,"parent":5637663,"text":"# Full Stack Javascript Developer ( Toronto, In-house preferred but remote ok )<p>## Job Description<p>SJC is looking for a full-stack developer to work on a large and interesting problem within a well tuned environment. You will be working in a small, high efficiency team of developers to create a next generation product relationship and information management platform. This is a very fast-paced role and we need energetic individuals that can work independently to build components for a large scale web application. This is a great career opportunity to grow with a company, and get your hands dirty working with big datasets, solving real problems. Good tools, issue management, and test-driven coding methods will be used to maximize developer happiness.<p>## Responsibilities<p>- Understand the business requirements by working with product owners and key business stakeholders\n- Engage with the software development team in system design discussions\n- Continually evaluate, learn and improve your skills as a software developer\n- Code stuff<p>## Skills &#38; Requirements<p>- Good grokking of javascript ( the stack will be node.js &#38; MongoDB &#38; MySQL &#38; HTML5 &#38; CSS3 )\n- Proficiency with frontend technologies i.e. HTML5/CSS/Javascript (Twitter Bootsrap, JQuery)\n- Familiarity with version control (git)\n- Must possess excellent written and interpersonal communication skills and be able to effectively communicate with all levels of the organization.\n- Team player-ness\nEducation/Experience\n- Bachelor’s or Master’s degree in CS, Engineering, or equivilant experience.<p>## About Us<p>St-Joseph Content (SJC), a division of St. Joseph Communications Inc., is one of the largest multichannel content provider in North America. Pi Media, a division of St. Joseph Content, creates effective, creative content for clients who are interested in single or multichannel advertising. This includes retail flyers, catalogues, web content, and in-store POS, including digital signage.<p>contact me, sean: smacdonald@stjosephcontent.com","time":1367855891,"type":"comment"}