{"by":"sean9999","id":5663032,"parent":5637663,"text":"# ￼DevOps Engineer ( Toronto, In-house )<p>## Job Description<p>SJC is looking for a DevOps engineer who is conversant in cloud technologies to help us create a well-tuned environment using smart, Service Oriented Architecture. You will be working in a small, high efficiency team of developers to create a next generation product relationship and information management platform.<p>This is a very fast-paced role and we need energetic individuals that can work independently to build components for a large scale web application. This is a great career opportunity to grow with a company, get your hands dirty in all aspect of cloud services, Big Data and web development.<p>## Responsibilities<p>• Learn, implement or adapt new technologies to help our team with deployment and maintenance activities\n• Identify scaling issues with our current environments and recommend solutions for increased reliability and performance\n• Deliver continued support, reliability and uptime for our products, developers and customers.\nTechnical Skills\n• Bash or another Linux shell environment • Mongo DB\n• Git &#38; Github\n• LAMP\n• AWS services\n• Ubuntu Server\n• PHP and Node.js are nice-to-haves<p>## Skills &#38; Requirements<p>• You are a problem solver and have a strong opinion on the “right way” to engineer solutions\n• You have 1 - 2 years experience maintaining and optimizing applications in a live environment\n• You take pride in creating systems that scale well and can boast great uptime\nEducation/Experience\n• Bachelor’s or Master’s degree in CS, Engineering or a related portfolio of professional experience<p>## About Us\nSt-Joseph Content (SJC), a division of St. Joseph Communications Inc., is one of the largest multichannel content provider in North America. Pi Media, a division of St. Joseph Content, creates effective, creative content for clients who are interested in\n￼single or multichannel advertising. This includes retail flyers, catalogues, web content, and in-store POS, including digital signage.<p>contact me, sean: smacdonald@stjosephcontent.com","time":1367856097,"type":"comment"}