{"by":"aew","id":5669038,"parent":5637663,"text":"Stealth Financial Services Startup - Sao Paulo, Brazil, or wherever you need to be.<p>We are a seed stage, technology-driven financial startup backed by Sequoia Capital and Kaszek Ventures.  Our initial focus is providing Brazilian consumers with a disruptively smooth credit card experience, backed by machine learning-based underwriting.  We are building an agile technology company to challenge the local banking establishment.<p>We are in early development and there are lots of interesting problems to work on.  We are excited to meet people with different areas of technical focus - there is no single ideal profile.  Further, there are natural roles for people with different levels of expertise, from architect to engineer (front end, back end, mobile) to summer intern.<p>You will have a meaningful chance to shape architecture, process, and culture while building a company on the leading edge of the cloud.  We believe in good team chemistry, enthusiasm for creating things, and our surprising capacity to learn new things when we stay humble and open-minded.<p>Relevant technologies / frameworks / concepts:<p>* Modern web frameworks (Rails, Sinatra, Express, etc.)<p>* iPhone, Android<p>* Front-end JavaScript MVC (Ember.js, Angular.js)<p>* Functional programming (e.g., Clojure, Erlang)<p>* JVM (Java, Scala, JRuby)<p>* Statistical computing (R, machine learning)<p>* RESTful JSON API-based modular architecture / service oriented design<p>* Messaging architectures (RabbitMQ)<p>* SQL databases (PostgreSQL, MySQL)<p>* NoSQL databases (Redis, Mongo, Cassandra, HBase, Riak)<p>* Test driven development (TDD) - automated unit / functional / integration testing<p>* Continuous Integration (Jenkins, Travis)<p>* Managing cloud infrastructure as code (e.g., Linux, Amazon EC2 with Chef)<p>Portuguese a plus but not required.<p>If any of this sounds interesting, send us an email at ola@eosbank.com.br and we’ll follow up.  Thank you.","time":1367944448,"type":"comment"}