{"by":"wschroed","id":5709416,"parent":5637663,"text":"The Genome Institute at St. Louis, MO<p>Title<p>Business &#38; Technology Applications Analyst II (this is not an entry-level position)<p>Job Description<p>The Genome Institute at Washington University has an opening for a talented software engineer in the Bioinformatics group. The position will work with an experienced group of software engineers to develop software supporting the tracking of laboratory data and analysis processes to support large scale genomic research projects.<p>The Genome Institute has been at the forefront of genome research since its inception in 1993 and has been a part of major scientific projects such as the Human Genome, 1000 Genomes and TCGA (The Cancer Genome Atlas) Projects. The Genome Institute is a world-leader in the generation and analysis of genomic sequence data and uses this data to extend biological knowledge of the human genome and provide clinically relevant sequence analysis aimed at understanding human diseases (such as cancer and Alzheimer's disease). In addition, the Institute fosters public understanding of genomic science through various educational and outreach efforts.<p>Job Qualifications<p>The ideal candidate has a talent and love for writing software, is interested in developing that skill, and applying it in a production environment. The candidate will be expected to learn new things on a regular basis, think critically, and collaborate with other developers across groups. The environment is fast-paced and a person who likes to get things done will find a lot of opportunity.<p>Design, testing, debugging, and problem analysis are a regular part of the work. Skills in abstract software design, object-oriented architecture, relational data modeling, and web interface design will be used frequently, which will require thorough knowledge of each concept. The applicant will use these skills to develop software that will: interface with people and/or laboratory equipment, process and analyze large data sets on a compute cluster, and provide intuitive web based interfaces to the specifications of the laboratory managers and technicians.<p>Proficiency in dynamically typed languages (Perl, Ruby, Python, Lisp, etc.) is a plus, but not required. Understanding of relational databases and SQL will be helpful. Experience with web technologies such as HTML, CSS, Javascript and approaches such as REST and AJAX is an asset. Regular work will be done in GNU/Linux and other UNIX-like development environments. Familiarity with open source technologies, version control software such as git, and programming in a network environment are also assets.<p>Certification or degree in computer programming from a technical school or college plus two years of relevant work experience required. Additional relevant programming experience may be substituted on a year-for-year basis for required education.<p>You can also send questions and resumes directly to me.","time":1368578402,"type":"comment"}