{"by":"dagss","id":6827706,"parent":6827554,"text":"mCASH - Oslo, Norway<p>Payments done right. We integrate with banks, merchants, webshops and apps to allow purchases and person-to-person transfers. We launch in Norway early next year together with several big chains and have plans for several other countries. We have a licence to operate from the Financial Supervisory Authorities of Norway (EU-based). We&#x27;re 17 people and growing, last transaction value (June this year) of $18m USD, serious financial backing in place. Our owners and board of directors include Harald Andersen (founder of Point, Northern Europe’s largest provider of payment card terminals) as well as Rune Fjeldstad (former CEO of Nets, which operates the debit card infrastructure of Norway and Denmark).<p>Product video: <a href=\"http://youtu.be/VkIM6BFiWaA\" rel=\"nofollow\">http:&#x2F;&#x2F;youtu.be&#x2F;VkIM6BFiWaA</a><p>We have a strong team on backend development (Python + Google App Engine) and merchant&#x2F;bank integration, but so far development of our app has been outsourced. We now need to bring this effort in-house.<p>We&#x27;re looking for an expert iOS and&#x2F;or Android developer to head up our app development. This is a rare opportunity to completely re-think a whole class of human interactions--people pay for stuff every day. Now you have the opportunity to redesign and reengineer that experience. You will be given free reins. You may choose to build on or to scrap our existing codebase. You will have strong opinions about how the app should look and feel, and will make consensus-based decisions together with our graphic designer and our backend and systems developers. We have the funding available to make additional hires to work together with you, or hire in consultants, as needed.<p>Salary: 450k-800k NOK = 75K-130K USD &#x2F; year + benefits (paid vacation, pension saving program, etc.).<p>Ownership: Stock options for 0.6-1.5% of the company.<p>Please email jobs@mcash.no to apply.<p>We are also scaling up on backend&#x2F;systems programming and integration with banks&#x2F;merchants. See <a href=\"http://mcash.no/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;mcash.no&#x2F;jobs</a> for more details (these will be brought up to date with respect to compensation soon).<p>(An English website is not up just yet, but we have several non-Norwegian-speaking employees and most communication internally is in English. Ask us anything. Norwegian site at <a href=\"http://mcash.no\" rel=\"nofollow\">http:&#x2F;&#x2F;mcash.no</a> )","time":1385913003,"type":"comment"}