{"by":"spicyj","id":6827556,"kids":[6827735],"parent":6827554,"text":"If you could work anywhere, what would you do?<p>- Wouldn&#x27;t you want to work towards genuinely making the world a better place?<p>- Wouldn&#x27;t you want to work in a close-knit team alongside some of the brightest engineers in the industry?<p>- Wouldn&#x27;t you want to work on solving interesting problems that haven&#x27;t been solved before?<p>---<p>At Khan Academy, I truly believe that you can find all of those things and more. We&#x27;re a small, 50-person nonprofit tech startup making a big difference in the world. A few weeks ago, we found this great story through the fascinating blog &quot;Humans of New York&quot; – please take a moment to read it:<p><a href=\"http://www.humansofnewyork.com/post/64412654576/i-struck-up-a-conversation-with-him-and-he\" rel=\"nofollow\">http:&#x2F;&#x2F;www.humansofnewyork.com&#x2F;post&#x2F;64412654576&#x2F;i-struck-up-...</a><p>This is just one story, but every month we hear about hundreds of lives that we&#x27;ve transformed, and there are thousands more we don&#x27;t hear about.<p>Lots of people know us for Sal&#x27;s videos, but we also have hundreds of videos by other teachers and a huge library of math practice exercises. Our 100,000+ practice problems have been done over 1.5 billion times total. That&#x27;s a huge number.<p>This gives us the ability to study learning in a way that no one has previously been able to do. We&#x27;ve run tests which show that students learn more when they&#x27;re advanced quicker by a custom machine-learning algorithm [1]. As I write this we&#x27;re running dozens of A&#x2F;B tests to learn what we can do to make people learn more, from testing how review scheduling affects accuracy to simply testing different teaching styles.<p>Whether you&#x27;re a machine learning guru or you take pride in perfecting UI details for a dropdown menu [2], we have something for you. You&#x27;ll be working alongside a small team with the best in the business – though we have &quot;celebrity&quot; devs like jQuery creator John Resig and Google&#x27;s first employee (and former Director of Technology) Craig Silverstein, we have many more you haven&#x27;t heard of but who are just as awesome.<p>---<p>I&#x27;m going to put in a special plug for mobile: Around 20% of our traffic comes from phones and tablets but we have only two people (me and one other person) working on our apps right now. Our iOS app is fairly basic, but it already has a few million downloads. We want to make it awesome. If you&#x27;re a mobile developer we can build a great team around, <i>please</i> reach out. You can&#x27;t find this sort of opportunity in very many places.<p>We&#x27;re hiring engineers (web, mobile, data science), product designers, a community manager, and more. Oh, and if you want to have a great summer (or fall or spring) building real features for real users, we&#x27;re hiring interns too.<p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> directly (say you saw us on HN!) or feel free to email me at alpert+HN@khanacademy.org with any questions.<p>[1]: <a href=\"http://derandomized.com/post/51729670543/khan-academy-machine-learning-measurable-learning\" rel=\"nofollow\">http:&#x2F;&#x2F;derandomized.com&#x2F;post&#x2F;51729670543&#x2F;khan-academy-machin...</a><p>[2]: <a href=\"http://bjk5.com/post/44698559168/breaking-down-amazons-mega-dropdown\" rel=\"nofollow\">http:&#x2F;&#x2F;bjk5.com&#x2F;post&#x2F;44698559168&#x2F;breaking-down-amazons-mega-...</a>","time":1385911356,"type":"comment"}