{"by":"makmanalp","id":6827638,"parent":6827554,"text":"Custommade (<a href=\"http://www.custommade.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.custommade.com&#x2F;</a>) - Cambridge, MA<p>Full-time devs. Frontend Backbone.js &#x2F; jquery. Backend Python work, would likely be working with Django. Looking for more senior people, as well as a tech lead for the team. Also, QA people.<p>We&#x27;re a two-sided marketplace that does matchmaking between professional artisans &#x2F; craftsmen and buyers. You post your dreams, we find someone to make it real. People come up with some crazy ideas like a custom made quidditch set &#x2F; proposal ring: <a href=\"http://blog.custommade.com/portfolio/a-very-harry-potter-proposal/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.custommade.com&#x2F;portfolio&#x2F;a-very-harry-potter-pro...</a> Or and r2d2 engagement ring: <a href=\"http://blog.custommade.com/portfolio/r2d2-engagement-ring/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.custommade.com&#x2F;portfolio&#x2F;r2d2-engagement-ring&#x2F;</a> Or a portal one: <a href=\"http://blog.custommade.com/portfolio/not-your-typical-engagement-ring-custom-jewelry-for-gamers/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.custommade.com&#x2F;portfolio&#x2F;not-your-typical-engage...</a> We&#x27;re a small, tightly knit eng team. Boilerplate about stack &#x2F; team here: <a href=\"http://engineering.custommade.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.custommade.com</a> Various Engineering Positions open: <a href=\"http://www.custommade.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.custommade.com&#x2F;careers&#x2F;</a><p>-------------------<p>We&#x27;re funded by Google Ventures and a ton of others: <a href=\"http://www.crunchbase.com/company/custommade-ventures\" rel=\"nofollow\">http:&#x2F;&#x2F;www.crunchbase.com&#x2F;company&#x2F;custommade-ventures</a> so paying you well is not an issue. We recently raised an 18 million series B! We&#x27;re growing, and with that comes scaling challenges. But it&#x27;s all part of the fun. We have a great team and a great environment that focuses on customers and product development. When I&#x27;m working on product stuff, I get to collaborate with product &#x2F; UX &#x2F; support people day to day to build a product that meets a real business need, and makes everyone happy. But when I just need to bang out some code, people leave me alone. When I&#x27;m working on platform or architectural stuff, I get great advice and feedback from my coworkers. Expressing opinions and having discussion is encouraged. Friday afternoons are refactoring &#x2F; innovation day to scratch your good code itch. Work &#x2F; life balance is great. Bureaucracy is at a minimum.<p>Devs get a macbook pro, a huge thunderbolt display, and an Aeron chair.<p>We love contributing to Open Source, here is a list of what we&#x27;ve released so far, with more to come: <a href=\"https://github.com/SawdustSoftware\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;SawdustSoftware</a> We also regularly participate in and sponsor the Boston Python group, which is the largest python user group in the world. I&#x27;ve spoken there twice so far. We also often help stream the event for them, check it out here: <a href=\"http://www.youtube.com/bostonpython/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;bostonpython&#x2F;</a> Tech blog here: <a href=\"http://engineering.custommade.com/sawdustsoftware/\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.custommade.com&#x2F;sawdustsoftware&#x2F;</a><p>You&#x27;re a low-ego programmer who is always learning, has pushed code to production innumerable times, and doesn&#x27;t cringe at the prospect of collaborating with a team of non-techies every so often. You know the modern web stack well, and specialize in at least one part of it. Get in touch with our hiring person at ellen -at- custommade-dot-kom. Let her know \nthat &quot;Mali&quot; sent you.<p>==================<p>If you have any eng-related questions, you can figure out how to get to my email.","time":1385912274,"type":"comment"}