{"by":"divideby0","id":6828156,"parent":6827554,"text":"Spantree - <a href=\"http://www.spantree.net/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spantree.net&#x2F;jobs</a> - Chicago, IL<p>We&#x27;re Spantree, a small, nimble boutique consultancy based mostly in Chicago. We&#x27;re looking for another smart person to join our team in the West Loop of Chicago. This candidate should enjoy learning new things and solving hard problems.<p>We work almost exclusively with open source software and we&#x27;re not shy about jumping into third-party code to figure things out.  You should be motivated to submit pull requests and hunt down project committers on Twitter and IRC when you&#x27;re stuck.<p>Some of our favorite day-to-day technologies include Groovy, Grails, Elasticsearch, Drools, MongoDB, Backbone.js&#x2F;Marionette, CoffeeScript and Puppet.<p>Our clients range from small and scrappy startups to large hospital networks and software as a service providers. Historically, most of the stuff we&#x27;ve worked on has not been public-facing: it&#x27;s either guarded behind the client&#x27;s firewall, neatly tucked away as a library or jammed into the minds of the developers we&#x27;ve mentored. But we&#x27;re starting to diversify from &quot;behind-the-scenes&quot; work to more early-stage product development.<p>Fundamentally, we like to work on tools that helping people make better decisions. This can take the form of a search engine to help people find interesting stuff to do on a Saturday night, a complex workflow management system for evaluating health insurance claims or a matchmaking and scheduling system to help people book face-to-face meetings at conferences.<p>We&#x27;re looking for generalists who can quickly go from problem to working solution and communicate effectively with our peers and clients along the way. While we have a very strong technical stack already, you don&#x27;t expect new hires to be an expert in everything right away.  In general, though, we&#x27;re looking for people with the following qualifications:<p>* One or more fun languages: Ruby, Python, Groovy, Clojure, PHP, CoffeeScript, etc.<p>* One or more boring languages: Java, C++, C#, etc.<p>* One or more web frameworks: Grails, Rails, Django, SpringMVC, Play, CakePHP, etc.<p>* One or more databases: SQL, NoSQL, NewSQL, we like it all.<p>* HTML, CSS, JavaScript and at least one framework<p>* Git, or a colorful excuse for not knowing it.<p>* The typical software development toolchain: text editors, IDEs, step debuggers, issue trackers, etc.<p>If you&#x27;d like to learn more, please email jobs@spantree.net to  set up a Google Hangout.","time":1385918413,"type":"comment"}