{"by":"St-Clock","id":6828479,"parent":6827554,"text":"Auto123 - Montreal, Canada - 2 Backend and 1 Frontend Developers<p>== Who we are ==<p>We&#x27;re a team of 10 highly-trained but still fun developers building a new car dealership web platform that&#x27;s going to power the web sites of our hundreds of clients across Canada.<p>We&#x27;re working closely with a product team (marketing, design) and a production team (HTML programmers).<p>== Why it&#x27;s interesting? ==<p>- Build a high-performance responsive web framework that is heavily customizable<p>- Connect to 10 legacy DBs and render a page under 50 ms<p>- Build a platform, work on API usability and interact with users to improve it<p>- Work on the automated deployment and monitoring of hundreds of web sites and web applications each week<p>If your pupils dilated at least once while reading, it would be interesting for both of us to work together :-)<p>== How we do it ==<p>- The infra team uses puppet, Fabric, nginx, and uWSGI.<p>- The backend team uses Django, celery, PostgreSQL, redis, memcached.<p>- The frontend team uses SASS, Compass, Backbone.js, and a heavily modified version of Twitter Bootstrap.<p>We love code reviews, daily standup meetings, campfire, contributing to open source, and paying for education (code school anyone?).<p>We hate long meetings, code without test, vendors selling things we did not build yet.<p>== Perks ==<p>- A ping pong table and some nerf guns (if that&#x27;s your thing).<p>- Research and Development (we have a research grant with McGill University)<p>- A big office with wooden floors, brick and stone walls, located in the Old Montreal.<p>- Boring but important stuff like health insurance!<p>If you are interested, contact me at bdagenais@auto123.com with your resume and optionally, your github profile. Bonus points for bribes like github stars on my personal (<a href=\"https://github.com/bartdag/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;bartdag&#x2F;</a>) or industrial repositories (<a href=\"https://github.com/auto123/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;auto123&#x2F;</a>).","time":1385922588,"type":"comment"}