{"by":"hyoogle","id":6828092,"parent":6827554,"text":"Likeable Local - Portland, Maine - Social Media Tools for Small Businesses<p><a href=\"http://www.likeablelocal.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.likeablelocal.com&#x2F;</a><p>We at Likeable Local are looking to grow our team and seeking two talented and motivated software engineers. One immediate role would be perfect for someone who is great with numbers and analytics. The other role is better suited towards someone who loves working in the front-end and loves making things look and interact beautifully- with html, javascript, and css. In both cases the engineers should love building cool things, learning, and social media.<p>We are in Portland, Maine which is atypical for Hacker News, but is a great place to live! We aren&#x27;t looking for remote workers at this time.<p>We are a tech-startup-spinoff of the award-winning (NYC-based) agency Likeable Media, and we are looking for people that are willing to jump right in and be on our small team (currently 3 other full-time developers) creating features that will be visible and impactful and used immediately.<p>We are hard-working and smart, and we love to solve challenging problems. We use a lot of node.js, javascript, python, and django.<p>You love being a substantial contributor and are interested in the “full stack” of technologies from details of server configuration, back-end, front-end, and mobile platforms. You are self-disciplined, self-directed, but also detail-oriented in your communication about what choices you make and what you are doing.<p>Likeable Local offers an integrated software solution that allows small businesses to create, enhance and manage their social media presence. Likeable Local was founded in 2012 and has a deployed product that integrates with Facebook and Twitter. The software is sold on a subscription basis, allowing for attractive recurring revenue economics, and is in use by dentists, dry cleaners, florists, and jewelers and we continue to expand.<p>Interested? Email me at hugh@likeable.com and lets connect!","time":1385917602,"type":"comment"}