{"by":"sparkman55","id":6828853,"parent":6827554,"text":"Rinse ( <a href=\"http://www.rinse.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rinse.com</a> ) - San Francisco, CA Rinse is a very early-stage startup (we are only 4 people currently) looking to bring technology to the dry-cleaning industry. The industry is ripe for innovation! We&#x27;re building mobile apps, tackling scheduling and dispatch problems, and scaling a service at over 10% week-on-week growth for months now.\nI know &#x27;app for laundry&#x27; is a tech cliché right now, but we&#x27;re definitely encountering real demand. The problem is real, and we&#x27;re solving it.<p>The team is very strong, with an HBS grad who grew up in a dry-cleaning family heading operations, and a Stanford GSB grad with direct consumer startup experience heading customer acquisition. I&#x27;m Stanford CS&#x2F;EE, have built a few teams at various startups, and am just starting to build the technology and team to support this (very viable) business. The tech stack is Heroku &#x2F; Python &#x2F; Django &#x2F; Celery &#x2F; Phonegap &#x2F; JQuery &#x2F; Backbone &#x2F; Twilio currently, but obviously there is plenty of opportunity to influence technology decisions early on, and plenty of opportunity to learn new technologies as well. We expect the next couple of hires to own entire new efforts, and have their hands in wide-ranging parts of our entire business.<p>We&#x27;re looking for a Web Developer or Front-end Developer to develop interfaces for our customers, tools for our personnel, and visualizations for our managements. Ideally, this person would also have an active role in the design process as well, either leading design or working with our contract designer.<p>We&#x27;re also looking for a Director of Marketing. Rinse is a quintessential B2C business, with plenty of opportunities for online advertising, offline collateral, partnerships, and &#x27;growth hacking.&#x27; We&#x27;re building a scalable business model and the technology to support it, now help us scale the business. Please see a job description at <a href=\"http://bit.ly/1dLJigo\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1dLJigo</a> - The sky&#x27;s the limit!<p>Finally, if anyone in San Francisco is looking to make a few extra dollars part-time, Rinse is hiring part-time Associates to help us deliver clothes. We pay $25 per hour for a handful of hours per week. Perhaps it would be a way for some of you bootstrapping startups to earn a little extra cash? To apply to the Driver &#x2F; Associate position, fill out this web form: <a href=\"https://docs.google.com/a/rinse.com/forms/d/1kWZYu1kg1r8kxdD..\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;a&#x2F;rinse.com&#x2F;forms&#x2F;d&#x2F;1kWZYu1kg1r8kxdD...</a>.<p>Hacker News has definitely been our most successful recruiting channel. Thank you! Feel free to contact me at sam@rinse.com with questions, comments, or applications.","time":1385926780,"type":"comment"}