{"by":"tzaman","id":6828397,"parent":6827554,"text":"Codeable (<a href=\"https://codeable.io\" rel=\"nofollow\">https:&#x2F;&#x2F;codeable.io</a>) - REMOTE<p>We&#x27;re looking for a seasoned Rails developer with extensive knowledge not only on Rails but on building APIs in particular. Our product is an online outsourcing platform for WordPress, called Codeable. It&#x27;s built from two main components: AngularJS for the frontend (yes, we&#x27;re building a single page app) and Rails as the API endpoint.<p>With everything we do, we strive for quality, so we have a full money-back guarantee to clients and all our contractors are hand-picked to ensure only the best guys are working on small tasks that WordPress-based website owners get solutions to their problems in a timely manner and the solution is the best possible.<p>Requirements:\n- You love programming\n- You love learning new and exciting technologies and approaches\n- You practice TDD\n- You don&#x27;t compromise when it comes to quality of code\n- You&#x27;re keen on Scrum&#x2F;Agile approach to development\n- You have an internet connection :)\n- You&#x27;re a team player, there&#x27;s no &quot;me&quot; at Codeable\n- A Skype account since we&#x27;ll do most of the communication with it<p>Why work for Codeable?\n- We offer a competitive salary\n- We&#x27;re a small, but passionate team of developers\n- Your work will have an immediate and measurable impact\n- You can work from home, favourite coffee bar or anywhere you prefer\n- We follow agile methodology, so you won&#x27;t be bothered during sprints\n- You&#x27;ll have a say in most tech decisions we make<p>Our tech stack:\n- Rails API backend (with the most commonly used gems, such as Devise)\n- AngularJS frontend with SCSS stylesheets\n- Hosted on Heroku + our own servers\n- Websockets for realtime browser to service communication\n- RSpec for testing + continuous integration\n- Paypal + Paymill for payment processing\n- Redis, PostgreSQL for data storage<p>Send an application to tomaz@codeable.io and include your past, Rails-related references","time":1385921633,"type":"comment"}