{"by":"bjudson","id":6828634,"parent":6827554,"text":"We run a network of alternative weekly magazines &#x2F; websites in several mid- to large-sized markets in the United States. Our publications cover local news, politics, and culture with a brash, liberal slant. They also host events such as music awards and cocktail festivals in their respective markets, to which employees are offered complimentary tickets. We offer full health coverage (including vision &amp; dental) and 401k.<p>* Python&#x2F;Django web developer *<p>In this position, you will lead a small team to build a single web publishing platform for our network of alternative weekly papers from the ground up. You will be responsible for making high-level architectural decisions, as well as day to day coding, testing, and deployment. Our goal is to have a flexible, modern news and events platform that provides a great reader experience while simplifying management for our editorial and sales (advertising) staff. Once the system is built, your team will work with our writers and editors to help develop custom, engaging reader experiences such as immersive stories and interactive data features.<p><a href=\"http://careers.stackoverflow.com/jobs/43653/django-python-web-developer-news-media-san-antonio-current-co\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;43653&#x2F;django-python-we...</a><p>* Front-end developer &#x2F; designer *<p>In this position, you will join a small team to build a web publishing platform for our network of alternative weekly papers from the ground up. You will be responsible for designing the user experience and implementing the design using JavaScript best practices. Our goal is to have a flexible, modern news and events platform that provides a great reader experience while simplifying management for our editorial and sales (advertising) staff. Once the system is built, your team will work with our writers and editors to help develop custom, engaging reader experiences such as immersive stories and interactive data features.<p><a href=\"http://careers.stackoverflow.com/jobs/43678/front-end-developer-designer-san-antonio-current-co\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;43678&#x2F;front-end-develo...</a>","time":1385924344,"type":"comment"}