{"by":"pixelmonkey","id":6829344,"parent":6827554,"text":"Parse.ly (parsely.com) - Remote (EST &#x2F; CST preferred)<p>We&#x27;re a fully distributed team (see <a href=\"http://bit.ly/distributed-teams\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;distributed-teams</a> for a post by me, the CTO) -- which is to say, a merit-based, technology-forward, super-bright team of Pythonistas who happen to collaborate using the same methods of major open web projects like Wikipedia, Wordpress, Ubuntu, and Mozilla.<p>We just closed a $5M series A round. As a result, we&#x27;re looking to expand our engineering team. We are looking for full-stack engineers, back-end data engineers, and front-end data visualization interaction designers.<p>If you&#x27;re focused on the backend, you should have experience with high write performance DBs (e.g. Redis, Cassandra), large-scale log analysis (e.g. Hadoop, Pig, Hive), and big distributed cloud systems (e.g. &gt;20 node cloud deployments). That will mean you&#x27;ll hit the ground running here.<p>For the front-end, you should know modern web and mobile design principles and be particularly excited by d3.js and its associated ecosystem.<p>You&#x27;d be joining the company at a great time. Our engineering team is still small enough that we feel like an elite task force, but unlike two years ago, we are making millions in revenue and have a ridiculous amount of data to draw insight out of on behalf of our customers.<p>You should be an expert in a mainstream programming language, preferably Python or JavaScript. You should be willing to learn, or already know, technologies like Tornado, MongoDB, Redis, Solr, Postgres, Cassandra, Pig, Storm, and Amazon Web Services. You should be extremely handy at a UNIX command line, possessing all the skills of a sysadmin.<p>Also, if you happen to be an experienced software engineer who wants to end up in a role with a mixture of product management, customer interaction, and individual contributions to the code, we have just the position for you. Let us know -- we&#x27;re looking for you.<p>If you join us, you&#x27;ll be part of a well-funded and high-revenue SaaS analytics company that is rewriting the rules of online media. Our software aggregates data on over 5 billion pageviews per month of traffic, and we work with major media companies as customers, such as The Atlantic, Arstechnica, Mashable, The New Republic, MIT Technology Review, and many more.<p>Apply by sending a (short!) cover letter to work@parsely.com. Mention this HN post and say you&#x27;re looking for Andrew.<p>Include links to online portfolio, Github, LinkedIn, or any similar services, if you have them. If you have a Python code example that you think expresses your Python coding style, that would also be a good thing to send along (as plain attachment, Github Gist, or similar).","time":1385932117,"type":"comment"}