{"by":"nilgradisnik","id":6829657,"parent":6827554,"text":"Layer (<a href=\"https://layer.com\" rel=\"nofollow\">https:&#x2F;&#x2F;layer.com</a>) San Francisco, CA<p>The Internet needs an open communications layer -- cross-platform and free from an advertising-supported business model. At Layer, we’re on a mission to deliver it. We’re hiring iOS, Android, backend, Web and systems engineers, as well as designers.<p>We have problems to solve that you’ll have a hard time finding elsewhere.  Here’s why:<p>We’re building our own network.  We need fine-grained control over latency and geographic distribution.  We’ll be running our own AS (62862), peering at major exchanges, and purchasing transit from high-quality providers.<p>We’re running our own hardware.  This goes to latency again: by owning our own routers, by being particular about what switches run behind them, and by provisioning memory and persistent storage specific to our application, we can deliver a better experience to our customers.  We can also deliver at lower cost.<p>We’re designing our software for high availability.  Losing a datacenter will not impact the availability of our service.<p>We’re building our mobile SDKs to provide a complete solution: offline message buffering, cross-device handling of push notifications, cross-device message sync, respectful battery consumption, and in front of it all, a simple api.<p>We care about documentation: <a href=\"https://layer.com/docs/ios\" rel=\"nofollow\">https:&#x2F;&#x2F;layer.com&#x2F;docs&#x2F;ios</a>.  Our docs are the first experience developers will have with Layer.<p>We care about design.  We won’t be releasing our own apps - that’s up to our customers - but we’ll be open sourcing beautiful example apps that build on our SDKs.<p>We care about security and privacy.  Securing the transport is only the first step.  When we don’t have the keys we can’t access the data.  (In theory.  Security is hard.)<p>Today we&#x27;re a team of engineers and designers passionate about communications. We’re on a mission to make communications better through every product -- mobile or web -- that people use and love.  We hold the power to dramatically improve the way 2 billion+ Internet users communicate.<p>We’re well funded and have already assembled an early team that shows we mean business. We’ve started and built world-class companies and highly scalable Internet infrastructure and invented protocols used by millions.<p>Get in touch: jobs at layer dot com","time":1385936240,"type":"comment"}