{"by":"PaulMest","id":6829130,"parent":6827554,"text":"San Francisco (preferred) &#x2F; Remote OK<p>Looking for Senior Engineer to join founding team and help us build out the engineering discipline.<p>== About the Company ==<p>We are an early stage&#x2F;stealth team with previous experience from Facebook, Google, YouTube, and Microsoft, that have come together to build a marketplace at the intersection of technology, brands, and entertainment with solid backing from prominent Silicon Valley investors. We&#x27;ve invested and worked with companies and individuals like Uber, Path, FundersClub, 500 startups, YCombinator, Dropbox, Firespotter Labs, Philz Coffee, Snoop Dogg, Britney Spears, Mark Cuban, P&amp;G, American Airlines, and more.<p>== Desired Skills &amp; Experience ==<p>We are a very early stage startup and need to rapidly prototype and test our ideas every day. The ideal candidate is driven, analytical and understands how to build the simplest features to validate an idea.  Great if you&#x27;re also active in the Ruby community.  You will be the technical backbone putting together our customer facing site and helping us build the infrastructure to ensure we can enable a team to ship reliable software everyday.<p><pre><code>  5+ years experience as a software engineer\n  3+ years experience with Ruby on Rails\n  Fluent in Javascript, HTML, and CSS\n  Experienced in Heroku and managing live site environments\n  Postgres and query optimization is a plus\n</code></pre>\n== A typical day includes ==<p><pre><code>  Rapidly prototyping features to address usability test feedback using Ruby on Rails, JavaScript, HTML&#x2F;CSS\n  Building backend features to empower business team to manage live site’s content\n  Pushing code multiple times per day to staging&#x2F;production\n  Hacking in a co-working space in SF [3+ days&#x2F;week] unless it is WFH Wednesdays\n  ~15 minutes of agile meetings to address blocking issues\n  Going from idea-&gt;code-&gt;staging-&gt;production using JIRA&#x2F;GitHub&#x2F;Heroku\n</code></pre>\n== Interested? ==<p>Contact paul@close.co.  I’d appreciate it if you&#x27;d include your resume, examples of sites you’ve worked on, and GitHub profile.","time":1385929655,"type":"comment"}