{"by":"erso","id":6829605,"parent":6827554,"text":"DaisyBill - 34 W 15th Street, NYC - <a href=\"http://www.daisybill.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.daisybill.com</a><p>Senior Ruby&#x2F;Rails&#x2F;JS developer, full-time and local only<p>DaisyBill does workers&#x27; compensation e-billing for the state of California.<p>We&#x27;re a small company with 5 people in NYC and 2 in California.<p>Workers&#x27; Comp is a vastly underserved part of the medical billing trade which has been a struggle for all parties involved: the injured worker, the practice that performs services on the injured worker, and the insurance companies that handle the claims&#x2F;bills. Electronic billing aims to make the situation better.<p>Effective October 18, 2012, all claims administrators (insurance companies, self-insured employers, et al) for California workers compensation claims are required to be able to receive bills electronically.<p>DaisyBill is the facilitator for practices to take advantage of this new law, allowing them to enter in the information about services rendered, seeing both what they should charge for the services and what they should expect to be paid (as these are not always the same). DaisyBill manages the entire billing process, both sending the bill electronically and managing the responses about the status of the bill, including when it was paid and how much. As a result of using DaisyBill, practices are paid more quickly and accurately than when they submit bills via paper&#x2F;snail mail. We&#x27;re talking 15 days instead of 60, 90, or more. This makes practices more likely to take on injured workers as patients, an obvious benefit for all parties.<p>--<p>We&#x27;re looking for someone to help us with a new product&#x2F;revenue stream we&#x27;re going to be developing shortly. This product is a new fee calculator as the current one is expiring after the new year. We&#x27;re also going to be integrating with third party billers that are currently unable to submit workers comp bills electronically. There is no shortage of work to be done and there is a lot of money to be made.<p>I&#x27;m Kris, the CTO and sole developer at DaisyBill. Previously I was at ThoughtWorks, then Pivotal Labs. I decided to get out of consulting and into a product company because I wanted to own the product I was working on. DaisyBill is the only company out of many I considered that has a solid business plan with an intent to make a lot of money and do some good in the process.<p>I&#x27;m looking for a senior developer that is experienced with Ruby, Rails, and JavaScript. The stack we currently run is Rails 3.2&#x2F;PostgreSQL 9.2 on Heroku. I&#x27;d like to rewrite the site using AngularJS at some point in the near future, so Angular experience is a plus. We also don&#x27;t have a designer, so having an eye towards good UX&#x2F;UI is also a plus. We use Git and I&#x27;d expect any new hire to either already know Git quite well or be unafraid of it and be able to be brought up to speed quickly. I currently develop on an iMac with MacVim, and most people in the office use a standing desk.<p>You would be pairing reasonably regularly for the first few weeks but be expected to work independently not long after joining, asking questions as necessary. We also do a loose form of TDD: I typically like to sketch out an idea before trying to bake it in with tests. I also don&#x27;t test every line of code. I believe in being pragmatic about testing. We use RSpec and Jasmine.<p>I do interviews similarly to the way they&#x27;re done at Pivotal: After chatting about what you&#x27;re looking for in a position I&#x27;d have you come in and pair on some code. I care a lot about the interview process allowing the candidate to suss out whether the work environment and the actual work is what they&#x27;re interested in. I don&#x27;t do conference room whiteboard programming.<p>I don&#x27;t have a degree, and I don&#x27;t expect you to have one, either. I don&#x27;t necessarily care about how long you&#x27;ve been a developer, either. I care about the quality of your code today and your approach to solving problems. If you&#x27;re capable and can show it, I&#x27;m interested.<p>You may reach me at khicks@daisybill.com.<p>Cheers.","time":1385935552,"type":"comment"}