{"by":"henrygarner","id":6833182,"parent":6827554,"text":"Likely - Shoreditch, London, UK. Full Time &amp; Contract.<p>Clojure + Hadoop + Cascalog + Clojurescript + Redshift + Lambda Architecture <a href=\"http://likely.co/\" rel=\"nofollow\">http:&#x2F;&#x2F;likely.co&#x2F;</a>\nFounded in 2011, Likely is at the forefront of social media data collection and analysis having helped companies such as Coca-Cola and the British Government develop highly engaging, relevant presences online.<p>We analyse billions of social interactions – such as follows, shares and comments – to better understand how people cluster around things they are passionate about. By looking at brands as a collection of “passion points”, we have found that it is significantly easier to discover the people that are most likely to engage with a brand’s content and understand what content will resonate most with them.<p>We&#x27;re looking for:\nSoftware Developers. We have a sophisticated Clojure data engine at the core of our business that has been built according to Lambda Architecture principles on top of AWS. This excellent foundation drives our data business, our client work and powers our products. We are looking for developers to join our talented team to help us reap the rewards of this architecture with further data-driven products as we scale our business.<p>A front-end focused Developer. We are looking to enhance our front end capability with an experienced front end developer. This is fantastic opportunity to develop responsive, highly visual applications which present our company&#x27;s primary asset - our insights - to our customers. You will be working on our new products and will have the opportunity to develop and shape our front end capabilities from the ground up.<p>Both roles will be working closely with the CTO but will be given the responsibility and flexibility to design and build systems as part of a small, highly focused development team. In return we offer:<p>• A competitive basic salary<p>• 10% of time dedicated to hack-day projects<p>• An excellent working environment with ample opportunity for progression<p>• Open to flexible working<p>• 30 days holidays per year<p>• A company commitment to quality technology and external training<p>Please email henry@likely.co (yes, just .co!) or contact us through our website.","time":1385986226,"type":"comment"}