{"by":"makerstudios","id":6835778,"parent":6827554,"text":"[NOTE - We are hiring both Full-stack and Frontend positions]<p>Maker Studios - Los Angeles, CA - Full-Stack Web Engineer - All Levels<p>Join the team at Maker Studios, a next-generation digital video studio&#x2F;network. &quot;Maker&quot; has rolled-up a set of the largest and most influential YouTube channels and talent into a new network model.  The Company currently represents 50,000+ channels, and delivers 1.5 billion video views per month. Maker has an established reputation for guiding content creators in maximizing views and courting brands. Additionally, the Technology group within Maker innovates with world-class web engineering and design practices to produce high-quality apps and tools that connect content with eyeballs and usher content creators to new levels of mastery.<p>What does Maker build? We develop talent-facing web applications at high scale that connect YouTube content creators with each other, with our channel-management pros, and with tech such as ad optimization and alternative distribution targets. We also build internal web apps, APIs, and a handful of public-facing video&#x2F;content sites for our top talent. Here are some of the technologies we use:<p>Frontend:\nCSS3 - cross-browser  positioning, efficient selectors, reflow vs repaint, transitions&#x2F;animations.\nJS - able to avoid libraries and write native code for Ajax requests, DOM traversal, event binding&#x2F;delegation, ready states. Constructors and lambdas.\nHTML5 - familiar with Web Sockets, Local Storage, Session Storage. Bonus: Web Components.\nLibraries: Bootstrap&#x2F;Foundation, Knockout&#x2F;Ember&#x2F;Angular, jQuery&#x2F;Zepto, Underscore, Grunt.js, SASS&#x2F;LESS, CoffeeScript\nOpen Source: has released at least a few personal projects. Bonus: popular&#x2F;starred repos.\nBackend: Node&#x2F;Express, Python&#x2F;Django,, Ruby&#x2F;Rails, NginX\nTesting: CircleCI, Cucumber, Mocha\nDeployment: Capistrano, Fabric, Dotcloud, AWS, CloudFlare\nVirtual Machines: Vagrant, Docker\nSearch: CloudSearch, ElasticSearch, Lucene\nSQL: Mysql, RedShift &#x2F; Postgres\nNoSQL: Redis, Memcache, MongoDB, Neo4j, Hive&#x2F;Hadoop, Cassandra&#x2F;Riak\nLinux: Bash&#x2F;Shell scripting<p>Want more reasons to work at Maker? The engineering environment is exceptional. Maker&#x27;s CTO is a computer scientist himself who still codes regularly, and we have a very programmer-friendly workplace:\nYou decide the technology  - The engineer who&#x27;s writing the code has the final vote on which technologies get used. We use APIs to cross-connect our projects with ease, which also enables us to use different languages in different projects.\nFlexible work hours - come in as early or late as you want, as long as your total hours are on par with your peers; what really matters is the quality and quantity of your code commits.\nCode intelligently - We hack, but we also care about sharing code with each other, so we talk about readability and complexity, we develop all modules as though they&#x27;ll one day be open-sourced, and we believe in small tools used cleverly, at scale.\nOpen Source friendly-  Besides using mostly open-source tools, we&#x27;ve open-sourced several internally developed tools on <a href=\"https://github.com/MakerStudios/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;MakerStudios&#x2F;</a>, and more are coming.\nGreat benefits - We have amazing investors and we want healthy, enthusiastic employees, so we offer our engineers a highly competitive salary, top-notch health&#x2F;dental&#x2F;vision coverage, 401(k), and stock options.<p>Inquiries:  geoffrey.plitt@makerstudios.com","time":1386011777,"type":"comment"}