{"by":"timcorreia","id":6836756,"parent":6827554,"text":"Trulia - San Francisco, Full time, (H1B transfers)<p>Innovation happens every day.  <a href=\"http://youtu.be/YJHsr2ep1cw\" rel=\"nofollow\">http:&#x2F;&#x2F;youtu.be&#x2F;YJHsr2ep1cw</a>.<p>Trulia is one of the largest real estate search platforms in the United States with over 40 million visitors across our platform every month. We&#x27;re solving interesting problems and building cool things in nearly every software engineering discipline.<p>We&#x27;ve got lots of interesting and large scale projects to tackle including:\nBuilding our next generation of APIs (for both internal and external consumption)\nCreating new mapping and data visualization experiences\nImproving our web experience using a JS MVC framework and our new OOCSS library (similar to Bootstrap)\nInnovating on our top ranked mobile apps\nDiving deep into the terabytes of housing and user data we have in order to tailor custom experiences for our users\nOur core web stack is a pretty traditional LAMP stack, but we use a ton of other technologies as well including: Python, Java, Hadoop, Solr&#x2F;Lucene, CouchDB, Backbone (though we are currently exploring other JS frameworks as well), d3.js, Sass, Git, and a whole lot more.<p>I&#x27;ve been an engineer at Trulia for over four years now and can honestly say that it is a really fun company to work for. There&#x27;s a great culture of letting people run with projects that really interest them and drive the entire engineering organization forward.<p>The perks are fantastic: \ngreat health benefits\nunlimited vacation\nmonthly transportation and &quot;well being&quot; allowances,\nlots of happy hours\nkegs on two out of three floors\nstocked kitchens, \nquarterly hack weeks to name a few<p>You can checkout all the open positions and apply here - <a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qzZ9Vfwm&amp;nl=1&amp;page=Jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?c=qzZ9Vfwm&amp;...</a><p>If you have any questions or want to chat you can also email me at tim[at]trulia.com","time":1386020688,"type":"comment"}