{"by":"doctoboggan","id":6837234,"parent":6827554,"text":"Enthought, Inc, <a href=\"https://enthought.com/company/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;enthought.com&#x2F;company&#x2F;careers&#x2F;</a> Full Time in Austin, TX<p>Enthought is looking to hire for two different roles: DevOps and Scientific Developer. We mostly develop in Python, but will consider candidates with a strong C&#x2F;C++ background.<p>Senior Software Developer<p>-----------<p>We are seeking exceptional senior software engineers to join the product development team in our Austin, Texas headquarters. The product is a hybrid desktop &#x2F; web services platform for building advanced technical computing and visualization applications. The successful candidate will help guide the architectural growth of the product, drive continued feature development, and continue to improve the richness and robustness of the platform.<p>Applicants should have a BS, MS, or PhD degree with a strong background in computer science, as well as real experience developing quality software, either commercial or open source.  While strong technical skills are required, we tend to weigh &quot;really smart&quot;, &quot;highly productive&quot;, and &quot;dedicated to developing quality products&quot; more heavily than any specific skill set or degree.<p>Desired Skills and Capabilities<p>4+ years of programming experience in both high- and low-level programming languages such as Python and C++.\nExpertise with Python and the Python ecosystem\nSolid understanding of software and computer architecture\nStrong background in creating robust applications and user-centric interfaces\nExperience with databases, concurrent and multi-threaded programming, and distributed systems are all big pluses\nBS, MS or PhD in engineering, computer science, mathematics or related technical discipline. Equivalent experience also considered.\nA passion for computers, software, and programming<p>Scientific Developer<p>-------------------------<p>Enthought is currently seeking Scientific Software Developers. Our developers participate in the development of scientific and technical applications involving GUIs, 2D and 3D graphics, workflow and pipeline architecture, and numerical algorithms for our proprietary products and for customer applications. Some travel may be required.\nDesired Skills and Capabilities:\n(Required) Bachelor&#x27;s Degree in Computer Science or other scientific or engineering field with preferably an M.S. or Ph.D. degree.\n(Required) Minimum 2 years of technical lead or development experience with 4 years being preferred\nAbility to understand a problem domain and then conceive of and implement an intuitive user interface geared toward the scientist or engineer user.\nDiscipline, pride, and professionalism to write readable, documented, and unit-tested code that serves as an example to those who study your work\nStrong work ethic and commitment to satisfying the customer.\nExperience with Python, and a strong understanding of how to apply its capabilities to develop GUIs, work flow frameworks, and elegant scientific applications.\nStrong understanding of statistics, optimization, image processing, signal processing, or other similar area.<p>We find that a scientist will thrive at Enthought if their passion for software is as deep and ingrained as their scientific interests.\nPlease visit us at <a href=\"https://enthought.com/company/careers/\" rel=\"nofollow\">https:&#x2F;&#x2F;enthought.com&#x2F;company&#x2F;careers&#x2F;</a> to learn more about our open positions, our values, and what kind of developer fits best at Enthought.\nInterested? Send a resume and cover letter to jobs@enthought.com or you can contact Jill Cowan at jillc@enthought.com","time":1386025058,"type":"comment"}