{"by":"madh","id":15824900,"parent":15824597,"text":"Facebook | Solutions Engineer | Menlo Park, NYC, Seattle, Austin, London, Dublin, Tokyo, Hong Kong, Singapore, Buenos Aires | Onsite<p>Solutions Engineers at Facebook spend roughly half their time working with product engineering teams and writing production code. The other half of their time is spent working directly with partners to develop and execute their Facebook technology strategy.<p>We find that this setup is great for engineers that want to spend more time on the business side of things or have more people interaction while still being hands on with code.<p>This allows large advertisers to work directly with people at Facebook that have a knowledge of the ads codebase, and Solutions Engineers can implement great suggestions made by partners.<p>More about the role is available at <a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;life&#x2F;solutions-engineering-at-facebook\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;life&#x2F;solutions-engineering-...</a> .<p>Job listings are available at <a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;search&#x2F;?q=solutions%20engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;search&#x2F;?q=solutions%20engin...</a> .<p>Facebook | Solutions Engineering Manager | Paris | Onsite<p>We also have a great opportunity for an engineering manager that would like to support a team in Paris. You would support a distributed team, so some travel would be required. Roughly half the time would be spent on people management, with the other half on Solutions Engineering work.<p>We are looking for someone fluent in French.<p>We will consider a very experienced tech lead that would like to make the transition into people management.<p><a href=\"https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1200000LSzEFEA1&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.facebook.com&#x2F;careers&#x2F;jobs&#x2F;a0I1200000LSzEFEA1&#x2F;</a><p>If you would like to apply or have any questions, feel free to send me an email at hiten@fb.com .","time":1512145840,"type":"comment"}