{"by":"petetnt","id":15827772,"parent":15824597,"text":"Motley | Multiple developers (JavaScript) | Helsinki, Finland | <a href=\"https:&#x2F;&#x2F;motley.fi\" rel=\"nofollow\">https:&#x2F;&#x2F;motley.fi</a><p>Motley is a strategy, design, storytelling and technology company from Helsinki, Finland. We are working with some of the biggest and most exciting clients in Finland and we are looking for multiple developers to join our team.<p>As a frontend developer you write lots of JavaScript (specifically React), but you aren’t afraid to dive into WordPress and you can find your way around e-commerce store frontends of SaaS products such as Shopify. Use your extensive knowledge of modern frontend development to deliver new exciting products for our clients and learn new things by contributing to our own inner processes, libraries and best practices! You also get to help your co-developers by triaging bugs and troubleshooting issues.<p>As a full-stack &#x2F; backend developer you know enough of modern software development to contribute everywhere: you get to do architecture planning, project planning, backlog writing and you’re fluent in agile and lean methodologies. And of course you get to write tons of awesome code: we mainly work with NodeJS on the backend, but we also have lots of experience on building backends with Python, PHP, Ruby-On-Rails, Scala and other server side languages.  As our ideal candidate you should also be familiar with cloud services, continuous integration and delivery, relational and NoSQL databases and you should love working with Unix-y servers.<p>Likewise, if you don’t know all our core stack techs, it’s no biggie as long as you can learn them quickly and enthusiastically.<p>Most importantly, you should have an understanding of modern software development methodologies.  You should have been doing this for long enough that you know how to choose the right tools, techs and methods for the job. And you should have a great track record in getting the job done from start to finish.<p>Sounds good to you? Shoot us a mail at jobs@motley.fi and put HN on the title. Can&#x27;t wait to hear from you!","time":1512164245,"type":"comment"}