{"by":"dandigangi","id":15824992,"kids":[15826753],"parent":15824597,"text":"Javascript (ES6), React JS Developer ---- Mid to Senior Level Position ---- Chicago, IL<p>I&#x27;m the senior JS engineer at Drivin. Look forward to hearing from you.<p>This is NOT a remote position. We&#x27;re also not currently looking for recruiting help! Thanks!!<p>Email: ddigangi@drivindealer.com<p>Drivin, a KAR Auction Services company, is looking for an exceptional web software engineer to join our front end engineering team. At Drivin, you will have the opportunity to build cutting edge, B2B applications within the automotive industry. You will be joining a diverse, passionate, and experienced team of engineers who write Javascript like it’s nobody’s business.<p>If you are a JavaScript engineer who loves to solve problems, implement best practices, clean code is important to you, and enjoy collaborating with like-minded engineers, we’d love to talk with you.<p>Great salary, great benefits, and great perks\n(incl. food stipends, free drinks, pool table, education support, and more!)<p>Required Experience\n- 3-5+ years of professional website front end development experience\n- Fluent in JavaScript (incl. ES6) and ReactJS (we will test you!)\n- Writing automated tests with tools like Jest, Mocha, Sinon, etc.\n- Active understanding of semantic HTML and the DOM\n- Able to build website layouts to design without the aid of CSS frameworks\n- Responsive design techniques using CSS and building flexible layouts (incl. browser compatibility)\n- Interacting with JSON APIs, shaping data, managing application state\n- Working with Git and Github, comfortable on the command line<p>Preferred Skills\n- ReactJS + Redux; Designing Redux first applications\n- Webpack, Grunt, Gulp, or similar (production experience!)\n- LESS &#x2F; SCSS\n- Jest + Enzyme testing frameworks\n- Node.js development\n- Experience in Node, Java, Python environments\n- Working in continuous integration &#x2F; dev-ops environments (Jenkins, AWS, etc.)","time":1512146486,"type":"comment"}