{"by":"ILIKEPONIES","id":15826029,"parent":15824597,"text":"Underdog.io | New York, NY | <a href=\"https:&#x2F;&#x2F;underdog.io\" rel=\"nofollow\">https:&#x2F;&#x2F;underdog.io</a> | Full-Time | ONSITE<p>Underdog.io is hiring a backend engineer. This role will have ownership over backend and DevOps on our Python (Flask) and JS-based stack. Underdog.io is a small, revenue-funded company where everyone’s contribution and decision-making is directly impactful. Ideal candidates have the skills and initiative to think deeply about everything from code quality to internal processes to the broader market in which we operate.<p>Specifically, we’re looking for someone with:<p>-- Server-side development experience in Flask or a similar framework (Django, Express, etc.)\n&gt; Client-side development experience, preferably using a JS library like React or AngularJS<p>-- A deep understanding of HTTP and RESTful API design<p>-- Familiarity with SQL databases (we use PostgreSQL) and general data modeling practices<p>-- Experience managing AWS environments and working with DevOps tools (Jenkins, Docker, etc.)<p>-- A desire to contribute to open-source projects<p>Historically, we’ve had a lot of success with contract-to-hire agreements as a way to test mutual fit before entering into a full-time arrangement; we’d prefer to fill this role in the same way.<p>Link to our Github: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;underdogio\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;underdogio</a><p>Link to the job post: <a href=\"http:&#x2F;&#x2F;blog.underdog.io&#x2F;post&#x2F;164786052312&#x2F;backend-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.underdog.io&#x2F;post&#x2F;164786052312&#x2F;backend-engineer</a><p>Email jobs+eng@underdog.io if you’re interested in learning more!<p>---<p>Because we&#x27;re still a small team, we&#x27;re not able to accommodate recent bootcamp graduates. No recruiters or dev shops, please. =&#x2F;<p>Keywords: New York City, Brooklyn, Developer, Dev, Engineer, Python, Flask, Node.js, Ruby, Sinatra, PostgreSQL, Elastic Search, Open Source, <a href=\"https:&#x2F;&#x2F;underdog.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;underdog.io&#x2F;</a>","time":1512153194,"type":"comment"}