{"by":"cbanek","id":15825320,"kids":[15825703,15826334,15825442,15826336,15826434,15830602,15831965],"parent":15824597,"text":"Large Synoptic Survey Telescope | Senior Web Developer | Tucson, AZ | Relocation Available<p><a href=\"https:&#x2F;&#x2F;www.lsst.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lsst.org&#x2F;</a><p>Our dynamic universe is a wondrous thing - bring it to millions as a Senior Web Developer at LSST!  In this role, you will create the public interactive portal for this high profile project.<p>While the telescope is under construction in Chile, the education and public outreach team (EPO) is getting started and we need your expertise and experience to start us off on the right foot in terms of both design and technology.  We&#x27;re looking for someone with a strong sense of UX and clean web design, both on desktop and mobile, to help tell the complex story of our changing universe. This portal will contain astronomical images, movies, and interactive widgets such as a Sky Viewer and a stream of objects in the universe being discovered at any given moment.​  As the first full time employee to work on the portal, your contributions will be key to our success.<p>Our multidisciplinary team is based in Tucson on the campus of the University of Arizona and contains astronomers,  engineers, as well as education and communication specialists.  Don&#x27;t worry if you don&#x27;t know much about astronomy - you&#x27;re our key demographic!<p>We provide a great work environment and benefits, with private offices, 24 days of vacation per year, and excellent medical, dental, and vision insurance. Professional development is highly encouraged with tuition reimbursement for classes on campus, as well as trips to professional conferences.  You choose your own equipment, both computer and ergonomic.<p>Feel free to reach out to me directly with any questions (cbanek@lsst.org).<p>Apply here:\n<a href=\"https:&#x2F;&#x2F;rn11.ultipro.com&#x2F;SPA1004B&#x2F;JOBBOARD&#x2F;JobDetails.aspx?__ID=*17B31A6D49F443EF\" rel=\"nofollow\">https:&#x2F;&#x2F;rn11.ultipro.com&#x2F;SPA1004B&#x2F;JOBBOARD&#x2F;JobDetails.aspx?_...</a>","time":1512148607,"type":"comment"}