{"by":"kylixz","id":15826503,"parent":15824597,"text":"Chesapeake Technology Intl. (<a href=\"http:&#x2F;&#x2F;ctic-inc.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ctic-inc.com&#x2F;</a>) | Software Engineer (Any level) | Full-time, U.S. Only | Camarillo, Santa Barbara, Denver, NoVA, SoMD, REMOTE<p>We are looking for software engineers. We&#x27;re predominantly a JVM shop distributed around the country. The culture is flexible and supports staying current in your career -- for example, many of us have attended conferences like StrangeLoop, have subscriptions to ACM or Safari Books, or have pursued graduate programs with CTI&#x27;s assistance.  We won&#x27;t whiteboard you. Check out our interview process here by searching for &quot;Chesapeake Technology&quot;: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;poteto&#x2F;hiring-without-whiteboards\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;poteto&#x2F;hiring-without-whiteboards</a><p>CTI is building the next-generation cyber and electronic warfare platform comprising hardware, firmware, software, and user interfaces. We are a rapidly growing company, with remote work policies and flexible schedules. We offer competitive salaries and an excellent benefits package.\nCTI&#x27;s platform extends beyond Electronic Warfare-related hardware and software. Data management, from collection to transfer to storage and analysis, is a critical element in transforming information into actionable and intuitive visual intelligence. The mid-level Software Engineer is a position that will work as part of a team to architect, implement, and deploy innovative technologies to support both military and commercial users. We strive to use the right technology for a given problem and foster a learning environment.<p>Sample projects:<p>* Architect and build a cutting edge platform of APIs and services for desktop, mobile, and web applications to control airborne UAV payloads.<p>* Architect a system to allow 3rd parties providing services such as computer-aided vision, machine learning, and data analysis to have access to customer controlled information securely<p>* Build the service that ingests streams of data from various sensors in real-time and correlates with other feeds\n* Build out a data warehouse to analyze large amounts of telemetry and sensor data<p>* Create immersive 3D visualizations for cyber security and radio frequency domains.<p>If you are interested, please apply to any of the locations closest to you:<p>Santa Barbara, CA - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=3&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=3&amp;source=ycomb...</a><p>Camarillo, CA - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=5&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=5&amp;source=ycomb...</a><p>California, MD - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=7&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=7&amp;source=ycomb...</a><p>Sterling, VA - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=6&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=6&amp;source=ycomb...</a><p>Denver, CO - <a href=\"https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=4&amp;source=ycombinator\" rel=\"nofollow\">https:&#x2F;&#x2F;cticinc.bamboohr.com&#x2F;jobs&#x2F;view.php?id=4&amp;source=ycomb...</a><p>Thanks!","time":1512156254,"type":"comment"}