{"by":"jdleesmiller","id":15825448,"parent":15824597,"text":"Overleaf (www.overleaf.com) | REMOTE | Ops Engineer &amp; Growth Hacker<p>We&#x27;re hiring for two positions at Overleaf, which is an online LaTeX editor with over 2 million registered users. We help academics collaborate more effectively and make LaTeX easier to work with. We recently acquired ShareLaTeX.com and are merging the two platforms into Overleaf v2.<p>1. Ops Engineer: We want to migrate our infrastructure to Google Cloud&#x2F;AWS&#x2F;Docker from our current setup based around Chef-server running on Linode. The technologies we currently use and will still need to support before any migration include Ubuntu, Redis, MongoDB, Haproxy, Nginx, Node.js, Jenkins and Docker. The Ops job will involve responsibilities like:<p>- Modifying our Node.js services to work with different architectures as they evolve<p>- Improving auto-scaling for our LaTeX compiling backend<p>- Management &amp; maintenance of our infrastructure<p>- Improving our CI and deployment process<p>- Testing and improving our backup &amp; backup verification process, and emergency procedures<p>- Keeping our emergency monitoring services tested and up to date<p>- Improving and automating the Docker build process of our open source and onsite package<p>- Being on call to deal with out of hours emergencies<p>2. Growth Hacker: We are looking for a data-driven and technically savvy marketer to:<p>- Develop and test new content, propositions, landing pages and experiences<p>- Drive conversions and improve our funnel analysis<p>- Drive engagement and make sure churn stays low<p>- Monitor and improve our search engine rankings (no black hats)<p>- Integrate content from Overleaf v1 and ShareLaTeX for the combined &#x27;v2&#x27; website<p>- Work with our CEO and CMO to shape our online marketing strategy for both B2B and B2C<p>- Work with our development team to make sure that we are collecting the data we need<p>Some reasons you&#x27;d enjoy working with us:<p>- Around 80% of our codebase is open-source and we’re big fans of Free Software.<p>- Working hours can be flexible to your needs. Applicants in or near GMT preferred.<p>- We’re agile (with a lowercase a). We test thoroughly (unit and acceptance), we have a CI build process, a full staging environment to play with, and we automate as much as possible.<p>- Remote is a first class citizen, all founders and employees work remotely. We get everyone together in London every few months for valuable face to face time.<p>Send us an email with a CV and cover letter: jobs@overleaf.com","time":1512149226,"type":"comment"}