{"by":"JED3","id":15827102,"parent":15824597,"text":"Pathlight (<a href=\"https:&#x2F;&#x2F;www.pathlight.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pathlight.com&#x2F;</a>) | San Francisco, CA | Full-time | Onsite<p>Managing a team of people is no easy task (as any pointy-haired boss will make sure to let you know). Managing an organization of hundreds or thousands of people is several orders of magnitude more difficult. Strategy is often impossible to orchestrate, implementing any amount of change happens at a glacial pace. Keeping an organization on the same path becomes a near-impossible task. Pathlight offers up a solution to this monumental problem through what we call management automation.<p>Pros:<p><pre><code>  - Green field development  \n  - Real world problems. The kind that companies pay $100K+ to solve\n  - Experienced founders. This is our 2nd startup - our first was acquired in 2013\n  - Well-funded and well-run. Series A, low burn. Capital efficiency is important to us\n  - Product market fit. Companies already using it every day\n</code></pre>\nCons:<p><pre><code>  - Very early. Very uncertain\n  - We’re not going to match your offer from Facebook\n  - No free lunches, gym memberships, massages, etc. But, we do have several flavors of La Croix\n  - We play Yacht Rock on Fridays\n\n</code></pre>\nOur top priority is in finding a Lead Data Engineer, if this sounds anything like you, I&#x27;d love to hear from you:<p><pre><code>  - Have experience with data pipelining, warehousing, ETL (bonus: Presto, Spark, Redshift)\n  - Not shy of SQL (bonus: PostgresQL, Hive)\n  - Proficient in Python (bonus: Django, Celery)\n  - Have experience modelling data (bonus: sklearn, numpy, pandas)\n</code></pre>\nWe are also looking for Full-Stack Engineers, Product Managers, Designers, and more. To apply, visit <a href=\"https:&#x2F;&#x2F;www.pathlight.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pathlight.com&#x2F;careers&#x2F;</a> for more information or email careers[at]pathight.com","time":1512160262,"type":"comment"}