{"by":"majogu","id":15826583,"parent":15824597,"text":"FreeAgent, Edinburgh and REMOTE (UK-only)<p><a href=\"https:&#x2F;&#x2F;www.freeagent.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.freeagent.com</a><p>At FreeAgent we help freelancers and micro-businesses be more successful by putting them in control of their company finances.<p>We have built an award-winning online accounting product that offers full end-to-end compliance, from time tracking to tax return filing. We&#x27;re based in beautiful Edinburgh and we&#x27;re growing from strength to strength with over 52,000 paying customers and strong YoY growth. Our NPS is off the charts (69!) - customers love what we do!<p>We&#x27;re a growing team of over 130 people, and recently became a public company listed on AIM ($FREE.L). The majority of our team are based in Edinburgh but we have staff distributed across the UK. If you want to help us make small businesses awesome at doing their finances, we&#x27;re have great opportunities in our product and engineering team. Our stack is currently Ruby&#x2F;Rails, JavaScript, React.js, MySQL, RabbitMQ, Elasticsearch, SmartOS.<p>We currently have senior full-stack, operations and data platform engineers vacancies available. Senior engineers at FreeAgent have the opportunity to provide technical leadership and help to grow their teams. We like to work with people who show initiative and continually seek to improve themselves, their teammates, and our codebase. Our product teams are small and cross functional, enjoying a great degree of responsibility. We invest in our platform (code health, scalability, security) as well as working on new features.<p>You can apply directly via the website – <a href=\"https:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.freeagent.com&#x2F;company&#x2F;careers</a> – or feel free to get in touch with me directly: maria [at] freeagent [dot] com.<p>(We are looking for UK-based full-time staff and contractors only right now)","time":1512156775,"type":"comment"}