{"by":"willempienaar","id":15829910,"parent":15824597,"text":"GO-JEK | Singapore | Backend Engineer | On-site - Full-time | Salary is negotiable | Relocation Available<p>=== Who We Are ===<p>GO-JEK is Indonesia’s first and leading unicorn startup providing ride-hailing and on-demand services ranging from transportation, logistics, payment, food delivery and much more. Operating in more than 50 cities in South-East Asia’s largest economy, we aim to champion innovation to bring lasting social impact.<p>=== Who We Are Looking For ===<p>Backend Engineers<p>We are looking for strong Backend Engineers to join our Data Science team in Singapore. You&#x27;ll work closely with Data Scientists in taking our ML models into production. You&#x27;ll design and develop a highly scalable, reliable and fault tolerant core platform to enable new features on our big data and micro-services oriented architecture. You will be involved in all the steps from designing the cloud architecture to application development to creation of ML and data pipelines.<p><pre><code>  - Engineers with Backend, Machine Learning, or Full-stack experience\n\n  - Exposure to architectural patterns of a large, high-scale web application (e.g. well-designed APIs,\n  high volume data pipelines, efficient algorithms)\n\n  - Engineers who have experience with web best practices such as A&#x2F;B testing, test coverage\n\n  - Full-stack engineering experience in any of the following languages: C&#x2F;C++, Java&#x2F;Scala, Go, Python, Ruby&#x2F;Ruby on Rails\n\n  - Pipeline design&#x2F;implementation with Large Distributed Databases (Hive&#x2F;Spark preferred)\n\n  - Working knowledge of relational databases and query authoring (SQL)\n\n  - Love to use and develop open source technologies (e.g. Kafka, Hadoop, Hive, Presto, and Spark)\n\n  - An eye for automation and instrumentation\n\n  - Experience with build automation and continuous orchestration tools Gitlab&#x2F;Jenkins\n</code></pre>\nOur current stack includes: Google Cloud Platform, Kubernetes, Gitlab&#x2F;CI, Scala, Python, Go, Tensorflow, XGBoost, Kafka, Flink, Spark, Elastic Search, PostgreSQL, Redis, Ansible.<p>=== How To Apply ===<p>Interested applicants, please drop me a mail at willem.p@go-jek.com with Hacker News and the position title in the subject line and your CV&#x2F;resume attached.","time":1512184256,"type":"comment"}