{"by":"saratateno","id":15827843,"kids":[15830769,15832079,15827855],"parent":15824597,"text":"Happity | REMOTE (UK-BASED) | FLEXIBLE | £35-50k | Full-Stack Lead Developer | <a href=\"https:&#x2F;&#x2F;www.happity.co.uk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.happity.co.uk</a><p>Happity is a family friendly startup with a big mission. We’re looking for a talented full-stack developer to join us on our journey, helping new parents escape loneliness on the days spent as sole carer for a young child.<p>60% of mums go a whole day without adult interaction and a staggering 90% of new mums admit to feeling lonely. Yet there is a plethora of baby and toddler friendly activities on their doorstep waiting to be discovered. Singing, comedy, dancing - did you know there’s even a bring-your-baby coding class? Happity helps parents to find and book these activities. Fast.<p>As our first technical hire, you will play a key role in shaping Happity and have ownership over the tech function of the business. We are looking for an experienced developer to help us build a cutting-edge platform managing real-time bookings with social features.<p>We are a startup that fully embraces both the benefits and challenges of remote, flexible working and is passionate about promoting gender equality and parenting rights for dads.\nWe’re open to considering a job-share or part-time work if appropriate, and share options as part of the compensation package. We have already raised angel investment and the backing of Ignite Accelerator. Our beta site launched in a pocket of South East London and rapidly grew to over 5,000 monthly users.<p>If you&#x27;d like to learn more, feel free to drop me a line sara [at] happity.co.uk<p>I look forward to hearing from you!<p>Current Stack: Rails, Postgres, AWS, Heroku<p>Jobs page: <a href=\"https:&#x2F;&#x2F;happity.breezy.hr&#x2F;p&#x2F;deed7afde7f201-full-stack-lead-developer-parenttech--flexible-remote--uk-based\" rel=\"nofollow\">https:&#x2F;&#x2F;happity.breezy.hr&#x2F;p&#x2F;deed7afde7f201-full-stack-lead-d...</a>","time":1512164698,"type":"comment"}