{"by":"borski","id":15825358,"parent":15824597,"text":"Tinfoil Security | Security and Software Engineer | Mountain View, CA, United States | ONSITE, Full-time | <a href=\"https:&#x2F;&#x2F;www.tinfoilsecurity.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tinfoilsecurity.com&#x2F;jobs</a><p>We provide companies of all sizes with security tools that can be used by their developers and DevOps teams. Our goal is to reduce the time it takes to find and fix vulnerabilities and make it a part of the building process.<p>We hook security into CI and testing frameworks and have security tests run alongside unit, regression, and integration tests. Using the same techniques as malicious hackers, we systematically test all the access points. As we find vulnerabilities we’ll stick them right back in front of developers, either in a simple checklist format or by integrating into their issue tracker of choice, instantly notifying developers when there&#x27;s a threat and giving step-by-step instructions, tailored to their software stack, to eliminate it.<p>We&#x27;re working to make the internet a more secure place. This means building things that have never been built before: you&#x27;ll need to quickly learn new concepts and apply them to your work. We value speed, but we value stability more.<p>You&#x27;ll be in charge of large projects, in many different domains. This might involve anything from distributed systems to static analysis or information architecture.<p>Our software stack is primarily Elixir, Ruby, and Go, but we&#x27;re advocates of choosing the best tool for the job. If something like Elm is going to help you solve a problem more effectively then we want you to convince us of that.<p>Qualifications<p>* A drive to learn and push your limits\n* An interest in security and an appreciation for privacy\n* Passion. We don&#x27;t care in what, but we want you to make us excited about something you care about\n* A pride in your work. We treat our work as a craft, and aren&#x27;t done with a new feature until we&#x27;re proud of it","time":1512148785,"type":"comment"}