{"by":"cullenking","id":15828678,"parent":15824597,"text":"Ride With GPS | Portland, OR | Four separate roles: Backend software engineer, dev ops, mobile UI&#x2F;UX focused engineer, front-end engineer | Full-time, ONSITE | <a href=\"https:&#x2F;&#x2F;ridewithgps.com\" rel=\"nofollow\">https:&#x2F;&#x2F;ridewithgps.com</a><p>We are a small, bootstrapped and profitable business focusing on providing software for cyclists and organizations serving cyclists. We are a team of 14 full-time and on-site employees, roughly split half and half between engineering+design and support. We have a comprehensive pair of mobile apps that integrate into our web based service, allowing users to record and navigate their bike rides, as well as a website that allows our users to create and discover new rides.<p>We are looking to grow our development team. Currently that means a backend developer, a backend dev with extensive devops experience, a UX oriented mobile dev with both iOS and Android experience, and a front end engineer with React or other similar experience. For all roles, we prioritize skills over specific framework knowledge. For example, this means we understand a competent developer who is familiar with django or other MVC frameworks can become an effective rails developer in a short period of time.<p>Our team is comprised of various types of cyclists, some more passionate than others, and all enjoying a mix of biking related activities. MTB &#x2F; Adventure &#x2F; Road &#x2F; Race &#x2F; Commute are all well represented, and we respect a wide variety of bicycling experience. We offer excellent work&#x2F;life balance, competitive salaries, and love to support our employees with anything cycling related. We provide excellent fully covered health&#x2F;vision&#x2F;dental, a 10% matched 401k, and a bike budget to spend after your first 90 days. We are family friendly (a third of our team have kids) and offer paid maternity&#x2F;paternity leave.<p>Contact careers@ridewithgps.com for details. Please include a resume and a brief email based cover letter explaining your experience in the industry, as well as your personal experiences with cycling.<p>Thanks!","time":1512170537,"type":"comment"}