{"by":"rprabhu","id":15830247,"parent":15824597,"text":"athenahealth | Lead Member of Technical Staff | Chennai, India | Full-time<p>athenahealth is a US-based leading products &amp; services provider offering cloud based solutions to physician practices and hospitals on Medical Billing &amp; Revenue Cycle Management, Electronic Health Records, Patient Engagement, Access and Care Coordination, Population Health Management, Order Transmission, Epocrates and other point-of-care mobile applications.Our mission is to be healthcare providers’ most trusted service, helping them do well doing the right thing.<p>I&#x27;m part of the Analytics team at Chennai and we work very closely with our teams at Watertown and Bangalore. We have very exciting opportunities with data. We have tons of data and would like to make the best use of it by building a robust and scalable platform for clients to get the most value out of it via reports, dashboards, data exports and Machine Learning.<p>We are looking for Senior Developers that can work as an individual contributor. Following is what we expect from them:<p>Deep experience in the following areas:<p><pre><code>    1) Data ingestion &#x2F; migration &#x2F; streaming. Experience in building or optimizing systems focused on migrating data from across datastores. Experience in solving performance and scalability issues in data processing, data governance, data quality.\n\n    2) Data Warehouse &#x2F; data modelling skills. Experience in designing warehouse schema for client apps to query data suited for reports and dashboards with realtime accuracy.\n\n    3) Writing complex SQL queries (analytical, modelling, window functions) and SQL performance tuning.\n\n    4) Knowledge on different types of data-stores like columnar, graph, distributed databases etc (example: Neo4j, Cassandra, Redshift, Snowflake).\n\n    5) Micro services. Conceptualizing, building and deploying. Working with infrastructure teams to define volume requirements and facilitate setting it up on a cloud environment (AWS as an example)\n\n\n    6) Knowledge on programming in any programming languages - Java &#x2F; Perl &#x2F; python &#x2F; node\n</code></pre>\nDesirable:<p><pre><code>    7) Understanding of containers (Docker), DCOS\n</code></pre>\nIf you are interested, please email me at &lt;my HN handle&gt;@athenahealth.com","time":1512190757,"type":"comment"}