{"by":"emmacollett","id":15841189,"parent":15824597,"text":"Epoch Capital | Senior Software Engineer (C++) | London, UK | ONSITE &amp; FULL-TIME | <a href=\"http:&#x2F;&#x2F;epochtradinggroup.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;epochtradinggroup.com&#x2F;</a><p>Epoch Capital is a proprietary trading firm.<p>With offices in London &amp; Sydney, Epoch Capital has attracted a world class team of portfolio managers, traders, developers, quants &amp; operational staff. After more than 10 years, we’re well established, still breaking our own performance records, much more experienced yet we’ve never lost our bootstrapping, startup, go get ‘em attitude.<p>We have always viewed trading as the ultimate sport. While many of our competitors will survive or even taste short term success, the ones that thrive in the long-term understand it takes teamwork and relentless effort to beat the market, year in, year out. We thrive because our exceptionally talented people, through teamwork, are at the right place at the right time with the right strategy. Our technology, trading and operations teams all work closely together allowing us to build nimble, tailored solutions of fulfil our trading requirements.<p>What your main responsibilities will be…<p>- Design, implement and test low-latency algorithmic trading software in C++.\n- Work closely with Quants and Traders to provide solutions for algorithmic trading including: alpha signals, price discovery, smart order routing, algorithmic execution, anonymous market making, analytics and research tools.\n- Build, deploy and operate trading systems in a production environment.\n- Work with the Application Support team on trading system documentation, diagnosis of production incidents and their resolution.<p>Senior Software Engineers only please. Must have a deep knowledge of C++, STL and Boost and derivatives market knowledge.<p>Epoch offers; pension matching scheme, insurances, 25 days leave (plus bonus leave), catered lunches, in house masssages etc.<p>If you are intersted, please apply here: <a href=\"http:&#x2F;&#x2F;epochtradinggroup.com&#x2F;current-job-opportunities&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;epochtradinggroup.com&#x2F;current-job-opportunities&#x2F;</a>","time":1512356740,"type":"comment"}