{"by":"taigamotors","id":15848435,"parent":15824597,"text":"Taiga Motors | Montreal | Full-time | Salary + Stock Option | Embedded System | GUI<p>Taiga Motors is a Montreal, Canada based startup developing the world&#x27;s first production fully-electric snowmobiles. We believe in pure exhilaration– in vehicles that outperform everything else out there without sacrificing the environment.<p>At Taiga, we are uniting innovative and adventurous minds to form a team that isn&#x27;t afraid to tackle the industry&#x27;s toughest problems. Our approach is simple: we start from a clean sheet and push the frontiers of technology until we end up with elegant and powerful solutions.<p>We work fast, dream big, relentlessly chase perfection, and believe that snow days are best enjoyed outside the office.<p>We are looking for a talented software developer to join our team to build a sleek, integrated user interface that showcases our vision of the next generation of snowmobiles. As the lead designer of our user experience, this is a great opportunity to leave a huge impact with every line of code you write.<p>The job responsibilities include: •\tDesigning the UI firmware for the snowmobile dashboard •\tDesigning the UI for the accompanying iOS and Android apps •\tSetting up a backend to monitor and track vehicle data remotely through your API •\tManaging remote OTA updates and releases with a focus on security and scalability<p>We are looking for a candidate with the following qualifications: •\tA knack for creative design and UI layout •\tExperience in writing Linux GUI applications, bonus points if it was for embedded Linux •\tExperience with both iOS and Android development •\tBackend experience including database design and management<p>Additional experience in any of the following areas is a major asset:<p>•\tEmbedded systems development and testing •\tInformation security •\tAutomotive industry development practices •\tWeb development •\tInfrastructure&#x2F;internal tools development<p>If you think you’re a fit for this position, don’t hesitate to reach out to us at careers@taigamotors.ca.","time":1512428922,"type":"comment"}