{"by":"thsowers","id":15860894,"parent":15824597,"text":"Gem Plumbing &amp; Heating | Software Developer | Lincoln, RI | Fulltime | ONSITE<p>Gem Plumbing &amp; Heating is a growing company that has been recognized for setting the standard for excellence in on-time, high quality, and friendly customer service. We are as committed to our team members as we are to our customers, offering competitive pay. We are currently looking for a Software Developer in the Rhode Island area.<p>As a part of Gem’s software development team, you’ll help with projects involving the development and maintenance of Gem’s proprietary field services iOS application, in service for over 150 field techs today. You may also be involved with related back-office features, in use for Gem’s call center, customer service and dispatch functions, and with quality engineering and testing.<p>What you’ll get from being a part of Gem’s software development team:<p>* A chance to put your skills in practice, and work with in-demand languages such as node.js and swift.<p>* Gain experience developing real-world solutions for a growing and profitable business<p>* Have fun coding in an agile and collaborative way, with a talented team<p>* Enjoy a professional workplace culture that puts people first.<p>This is a unique opportunity that combines the excitement of working with a small team who are doing cool things with the equally valuable business experiences from working for a large local business that is growing and thriving.<p>Qualifications:<p>* Expert with Node, HTML&#x2F;CSS&#x2F;JS, noSQL databases, VCS (we use git)<p>* Experience with Linux, Swift, Rust, Meteor is a plus<p>* Experience with creating applications that utilize API’s<p>* Front and back end web development experience is a plus<p>* Ensure the technical feasibility of UI&#x2F;UX designs<p>* Strong communications skills<p>* Collaborative, hard-working, and diligent<p>Apply at <a href=\"https:&#x2F;&#x2F;workforcenow.adp.com&#x2F;jobs&#x2F;apply&#x2F;posting.html?client=..\" rel=\"nofollow\">https:&#x2F;&#x2F;workforcenow.adp.com&#x2F;jobs&#x2F;apply&#x2F;posting.html?client=...</a>.\nor feel free to email your resume directly &#x2F; contact me at: tsowers __at__ gemplumbing.com (mention HN)","time":1512566983,"type":"comment"}