{"by":"musicoin-team","id":15904059,"kids":[15922515],"parent":15824597,"text":"Musicoin | UI&#x2F;UX Designer, Front-End Engineer | Full Time, Part Time |Remote<p>Musicoin is a decentralised platform that leverages the power of blockchain technology in empowering musicians to take full ownership of their content and finances. Our platform is built on a transparent Peer-to-Peer network powered by programmable smart contracts to enable fair remuneration for all musical content and services. Our long-term vision is to develop an open ecosystem where outside providers can build music related goods and services on top of the Musicoin platform. Musicoin is the world’s first cryptocurrency designed specifically for Music and you can be a part of that revolution.<p>The Musicoin platform is powered by the $MUSIC currency, which forked off from Ethereum to form a standalone chain in March, 2017. We didn’t have an ICO and prefer our products speak for themselves. The beta version of our app can be found over at <a href=\"https:&#x2F;&#x2F;musicoin.org\" rel=\"nofollow\">https:&#x2F;&#x2F;musicoin.org</a><p>We are looking for motivated front-end engineers and UI designers who would like to work on our desktop wallet and front-end frameworks. We are an open team and welcome people from all sorts of backgrounds.<p>We also have a bounty program for specific issues related to our Open Source program and the terms for the same can be found over at <a href=\"https:&#x2F;&#x2F;musicoin.org&#x2F;bounty\" rel=\"nofollow\">https:&#x2F;&#x2F;musicoin.org&#x2F;bounty</a> and at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;Musicoin&#x2F;desktop&#x2F;blob&#x2F;master&#x2F;BOUNTY.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Musicoin&#x2F;desktop&#x2F;blob&#x2F;master&#x2F;BOUNTY.md</a>. A wider selection of all the projects under the program can be found over at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;Musicoin&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Musicoin&#x2F;</a>.<p>Feel free to drop a message at team@musicoin.org anytime if you’re interested. Thanks and enjoy music!","time":1513069729,"type":"comment"}