{"by":"jvoorhis","id":2719607,"parent":2719028,"text":"Portland, OR - PHP Fog<p>PHP Fog is the leading platform-as-a-service built specifically for PHP. We have spent a lot of energy iterating on feedback from our users (over 2000 detailed surveys) to build a really great product that appeals to a large and growing user-base (over 14,000 people have signed up and growing). On top of that, we have put together a team of exceptionally talented developers. We are O’Reilly authors, open-source contributors and we enthusiastically ship code.<p>But we are growing fast, and we need your help. Want to join a winning team and have influence on the direction of an up-and-coming internet super-startup? Here are some of the benefits we provide:<p>We offer competitive compensation, and meaningful equity stake is a given.<p>We are comfortable with remote work – we are based in Portland, OR which has an awesome open-source community, but if you don’t live here already, that is ok.<p>Plenty of good developers didn’t go to college, didn’t finish college, or went to a community college – we don’t care as long as you are smart and especially if you are pragmatic.<p>We are not technology bigots: we use Ruby, PHP, Python, Bash and many other technologies internally at PHP Fog, as such we don’t care what language you are good at, we will train you in a new language if necessary to bring you up to speed with our tech stack.<p>Instead of listing job requirements, we will instead list some of some of the technologies we use internally to get things done:<p><pre><code>  * AWS, Linux, Systems automation\n  * PHP, Ruby, Python, Erlang, Bash\n  * Mysql, Redis, Mongodb\n  * Apache, Varnish, Nginx, HAproxy\n  * Git\n  * HTML5, beautiful markup, sustainable CSS\n</code></pre>\nHere are some of the roles we are looking to fill:<p><pre><code>  * Web developer – send your resume to dev-jobs@phpfog.com\n  * Systems engineer - send your resume to systems-jobs@phpfog.com\n  * Designer – send your resume to designer-jobs@phpfog.com\n  * Support – send your resume to support-jobs@phpfog.com\n  * VP of Marketing and Sales – send your resume to marketing-jobs@phpfog.com\n  * VP of Business Development – send your resume to bizdev-jobs@phpfog.com\n</code></pre>\nIf you don’t fit one of these roles but still want to join our team, send your resume to jobs@phpfog.com and tell us why you think you are a good fit.","time":1309545674,"type":"comment"}