{"by":"calbear81","id":2720691,"parent":2719028,"text":"Mountain View, CA (Full time, H1B welcome)<p>Room 77 (www.room77.com) - hotel room search engine, Launch winner - We're looking for software engineers and UI/UX designers to help us build a better hotel search engine.  We've got massive amounts of proprietary data and a whip smart engineering team from Google, Facebook, and the usual suspects.<p>Software Engineers (multiple positions)<p>Who you are:<p>* Superstar coder, self-motivated, focused, and interested in making a big impact as an early employee of a fast-paced startup<p>* BS, MS or PhD in Computer Science or a related field<p>* Passionate about travel<p>What you’ll do:<p>* Build upon Room 77’s first public product with powerful new features<p>* Design algorithms to enable the world's fastest and most feature-rich travel search engine (primarily with C++, Javascript, PHP and Python)<p>* Revolutionize the way people travel<p>For all other positions and to learn a bit more about why you should work with us, check out our jobs page here: <a href=\"http://www.room77.com/jobs.html\" rel=\"nofollow\">http://www.room77.com/jobs.html</a><p>Engineers, hit us up at jobs+engw@room77.com.  All other positions, try jobs@room77.com.<p>Cool facts about Room 77<p>* We just secured a series B of $10M+.  Hotel search and the lodging industry is ripe for disruption and we've got a unique product, proven technology, and a team that's been around the block a few times.<p>* We launched February 2011 at the LAUNCH conference in SF and won Best Startup.  We were also Audience Favorites at the Startup Showcase at Web 2.0.<p>* We just inked our lease on the 3rd floor of a building one block off Castro in the heart of downtown Mountain view right below Tasty Labs (hi Tasty Labs!)<p>* We're backed and advised by some serious heavyweights in the industry including the founder and ex-CEOs of Expedia and Hotwire as well as by technical wizards like Rasmus Lerdorf.<p>* We are H1B friendly and relocation friendly.<p>* We work hard but we respect healthy work life balances.  We try to have fun together as well.","time":1309566805,"type":"comment"}