{"by":"DGutmann","id":2720064,"kids":[2721077,2720802],"parent":2719028,"text":"London/Cambridge UK\nDisruptive B2B start-up is looking for Technical Co-Founder<p>I developed a concept of a web-based platform that puts the 21st century into market research by utilising smartphone applications and their developer communities.<p>Since pitching to industry experts I have received great interest and been asked to apply to an incubator who would like to support me and a small team to develop the concept further.<p>-----------------------------------------------------<p>I'm looking for a hands-on technical co-founder who can help me turn my mock-ups into an MVP over the next three months and then on to launch and beyond. Suitable frameworks exist in open-source format, which can be built upon (up to you).<p>If you are a self-motivated developer who likes the idea of disrupting a large market then please get in contact for more information! Experience and track record of bringing a customer focused product to market and start-up experience is a huge bonus.<p>----------------------------------------------------<p>With my science background (PhD), I'm somewhat technical but I won't be an idiot and list the different technologies I think you will need. This is of course up to you and you alone will decide on the stack and direction that it takes.<p>As your partner I will be charge of product design, business development, sales and marketing. I am driven by my vision, I work extremely hard and I will do whatever it takes to take us to the next level. I also see our partnership as a great opportunity to learn more programming and to eventually contribute some code myself.<p>I can offer co-founder equity as well as a negotiable salary (based on us getting into the incubator). I am not expecting you to rush into this partnership head-on. If you are also doing some freelance work on the side (etc.), I am flexible enough to work around that until we have pocketed the incubator funding.<p>If you are a cool dude and you want to know more then contact me at dapgutmann@gmail.com","time":1309552754,"type":"comment"}