{"by":"shawndumas","id":7162483,"parent":7162197,"text":"Yahoo (Ads &amp; Data) -- Front-End Engineers<p>Fulltime - Bay Area<p>Big things are happening here at Yahoo: EmberJS, jQuery, Bootstrap, Underscore, Bower, Grunt, qUnit (yes, at Yahoo)<p>We want Front-end engineers who are excited about the bleeding edge of web application development.<p>We&#x27;ve started a big push to change our tech-stack and are making ambitious single page applications. We are just about to launch Yahoo&#x27;s first EmberJS app Ad Manager Plus. It was announced [1] at Marissa&#x27; CES keynote. It&#x27;s incredibly ambitious, highly visible, full of big data, and directly impacting the success of Yahoo.<p>You’re awesome because:<p><pre><code>  - Someone in your life is jealous because you love JavaScript maybe too much\n  - You want to build single page applications with Ember\n  - Imperfectly written code keeps you from sleeping at night\n  - Canary isn’t a bird to you; it’s a playground of wonderful new toys\n  - You could develop back-end stuff, but your keen understanding of user interaction is what sets you apart from the crowd\n  - You’re badass when working alone, but unstoppable when working with a team that’s firing on all cylinders\n  - You like working with a functional style because forget verbosity\n</code></pre>\nWe’re awesome because:<p><pre><code>  - We have other UI leaders just like yourself\n  - We have the camaraderie of a startup, with all the nice perks of a big company\n  - The projects you’ll work on are incredibly ambitious, highly visible, full of big data, and directly impacting the success of Yahoo.\n  - We have disowned Internet Explorer’s first 8 children\n</code></pre>\nsdumas [at] yahoo-inc [dot] com<p>----------------------------<p>[1]: <a href=\"http://www.adweek.com/news/advertising-branding/yahoo-reboots-ad-business-attempt-own-ad-tech-154812\" rel=\"nofollow\">http:&#x2F;&#x2F;www.adweek.com&#x2F;news&#x2F;advertising-branding&#x2F;yahoo-reboot...</a>","time":1391277392,"type":"comment"}