{"by":"helloshow-","id":7162567,"parent":7162197,"text":"Lead Developer- Rails + AngularJS\n(Ft. Lauderdale or Remote)<p>Hello Show is modernizing a key workflow for real estate agents. The current market for real estate technology is vastly underserved and Hello Show is building the tools agents need and deserve.<p>We have an expert team, we have great investors, and we are ready to hire an A+ technical lead. Working with us will not only be an opportunity for professional and personal growth, but an opportunity to become an innovator and thought leader in a rapidly evolving industry.<p>With our product in development, we already have beta customers who have fallen in love and are anxious to sign up now!  We are building a great product because we are obsessed with validation, user experience, and testing. We are a results and data driven team, and use Agile&#x2F;SCRUM processes to build.<p>Skills &amp; Requirements:<p>- Ruby on Rails expert\n- Javascript expert\n- Experience with Angular.js or similar frameworks, and Node.js\n- Expert writing and interfacing with APIs\n- Strong HTML 5 and CSS skills\n- Focus on test driven development\n- Appreciation for Web Accessibility and how that should translate to code.\n- Insane attention to detail\n- Desire and ability to continuously learn and implement new technologies\n- Effective communication with team members, focusing on project requirements, capabilities, and schedule\n- Love of building products that people love<p>If you are not driven and a life-long learner, this is not the job for you!<p>Your competitive salary will be supplemented with stock options. You are also welcome to work remotely.<p>--<p>To apply, send an email to join@helloshow.com.  Be sure to reference the job posting and where you came across it.  Please provide any information that will help us in our decision process (resume, portfolio, github, etc…).  If you seem like a good fit, we will want you to come by for a face-to-face interview or chat on skype.  We are looking forward to hearing from you.","time":1391278308,"type":"comment"}