{"by":"blader","id":7162253,"parent":7162197,"text":"San Francisco - Heyday - <a href=\"http://hey.co\" rel=\"nofollow\">http:&#x2F;&#x2F;hey.co</a><p>We are building a lifelog for people to remember and share the story of their lives, automatically, beautifully, and privately. Two months ago, we launched here on Hacker News [ <a href=\"https://news.ycombinator.com/item?id=6858373\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=6858373</a> ]. Here&#x27;s what some of you guys said:<p>- &quot;Wow. I rarely download this stuff. But the fact that it claims to be automatic piqued my interest. After downloading it I can say that my first impression is shocked. Shocked that I really liked it.&quot;<p>- &quot;This is very well done. This could crush Facebook. Not in the short term but if you create a timeline that is more personally valuable to people they will be far more likely to use it and share it with friends and family. Your timeline is already far more interesting then my &quot;Wall.&quot;<p>- &quot;Why is it free? I would&#x27;ve paid for this.&quot;<p>- &quot;I have been looking for this. I&#x27;ve been so desperate for this I&#x27;ve been contemplating creating it myself.&quot;<p>We&#x27;re looking for mobile engineers (iOS - hard problems include making our sync engine fast&#x2F;reliable, fast&#x2F;intuitive search for memories, surfacing important memories in the background, UI performance, and doing it all without using a lot of battery), systems engineers (Python, Devops, Puppet&#x2F;Chef - hard problems include delivering accurate geocoding for memories, reliable syncing, and building systems to monitor and scale all of it automatically), and data scientists (R&#x2F;Matlab&#x2F;SPSS, Python, SQL, statistics, machine learning - hard problems include using ML to improve accuracy of geocoding, building growth and retention models, all while guaranteeing user anonymity and privacy).<p>We will fly you out for interviews and relocate you to San Francisco if you aren&#x27;t here already. A lot of our team work remotely from time to time, but we haven&#x27;t found full time remote employees to work out well for us since we collaborate so closely together in real time.<p>Please email me directly at siqi at hey dot co (8 hour SLA for a response). I&#x27;m also happy to answer questions here.<p>Fun fact: 33% of our engineering team found us through Who’s Hiring threads here.","time":1391275183,"type":"comment"}