{"by":"kgreene2","id":7162809,"parent":7162197,"text":"Chicago, IL - DevOps and Build Automation Engineer @ Spantree - <a href=\"http://www.spantree.net\" rel=\"nofollow\">http:&#x2F;&#x2F;www.spantree.net</a><p>===<p>Systems Management: Vagrant, Puppet, AWS<p>Build Automation&#x2F;CI: Gradle, Grunt, Jenkins, Sonar, Maven, Cordova<p>Test Automation: JUnit&#x2F;Spock, Selenium, Mocha.js<p>Web Tier: Java 7, Nginx, Tomcat, Jetty, JBoss, Grails, Redis, RabbitMQ, Node.js, Varnish<p>Data stores: MongoDB, Elasticsearch, Postgres, Redis, Couchbase, Neo4J<p>===<p>Spantree is a boutique software engineering firm based (mostly) in Chicago. We&#x27;re looking for our very first DevOps engineer to join our team in the West Loop.<p>This candidate should enjoy learning new technologies and solving hard problems. Ideally, we&#x27;re looking for someone that can whip or systems engineering stack into shape, taking over cross-cutting systems work that we each handle on our individual projects. Our existing team of 7 are mostly programmers. We&#x27;ve had to learn tools such as Vagrant, Puppet and AWS to make our lives easier, but we&#x27;re growing to the point where we could really use someone who lives and breathes this stuff.<p>We work quite a bit with OSS and we&#x27;re not shy about jumping into other people&#x27;s code to figure things out. We constantly hunt for smarter ways to do things, so we&#x27;re often experimenting with emerging tech with little or no documentation. You should be motivated to submit pull requests and hunt down project committers on Twitter and IRC when you&#x27;re stuck.<p>===<p>Who are you?<p>===<p>* A nice person<p>* An effective communicator face-to-face, on the phone, and over the web<p>* A pragmatic engineer that can quickly go from problem to solution to working software<p>* A lazy programmer who leverages test, build, and deployment automation wherever possible<p>* An confident teacher of what you know and a humble student of what you don&#x27;t<p>* An altruist who wants to participate in open-source projects<p>===<p>What do we work on?<p>===<p>Our clients range from small and scrappy startups to large enterprise companies. We have 3-7 projects going at any point in time. We tend to focus on greenfield development, building web applications from the ground up. We also work on integrating the old with the new, bringing technologies like Elasticsearch, Grails and Drools to large companies. Helping people make better decisions is the central theme of most of our projects. This can take the form of a search engine to help people find interesting stuff to do on a Saturday night, a complex rules-oriented workflow management system for evaluating health insurance claims, helping people find the right doctor, or a matchmaking and scheduling system to help people book face-to-face meetings at conferences.\nIn the next year or two, we also plan to get into product development, taking our experiences solving the same sort of problems for multiple clients and rolling them into a generic framework which we plan to open source and support directly for our clients and the rest of the world.<p>===<p>We offer full health, vision and dental for our full-time employees. 401K. Free snacks and often free lunches as well. Big monitors and top-of-the-line equipment. We also have a shiny new office treadmill.<p>Drop us a line at jobs@spantree.net and tell us a bit about yourself. If you have a resume or CV, feel free to pass that along as well. Github and LinkedIn profiles are also helpful. We&#x27;re looking forward to hearing from you!","time":1391280762,"type":"comment"}