{"by":"tectonic","id":7162748,"parent":7162197,"text":"San Francisco - Mavenlink - <a href=\"http://mavenlink.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mavenlink.com</a> - <a href=\"http://mavengineering.com\" rel=\"nofollow\">http:&#x2F;&#x2F;mavengineering.com</a><p>Senior Web Application Developer<p>Mavenlink provides consultants, independent professionals, and services firms with a suite of simple, thoughtful tools to run their businesses profitably. We’re replacing cumbersome and expensive business processes that are currently handled by a hodge-podge of Excel, aging competitors, and repetitive human tasks. Our users love us (and pay us) because we make consultants and their clients happier and more efficient at doing their jobs.<p>Our roadmap is clear, both due to strong relationships with our customers, and due to our founders’ experience in the services industry. With each month, we find our product moving further and further upmarket as it tackles increasing complexity and scale. We’re looking for more smart people to help us build business software that’s both powerful and easy to use.<p>Who<p>We’re looking for senior engineers who enjoy teaching and learning from others. You are passionate about writing maintainable, reusable, well-tested code. You enjoy pairing and applying TDD when appropriate. You don’t shy away from diving into a large (but very well tested!) Rails application to refactor it into components and services. You’re excited to work on a team creating intuitive UIs in Backbone.Marionette and CoffeeScript, developing reusable JSON APIs, and extracting and releasing open source components.<p>It’s hard to measure experience in years meaningfully, but you should have a strong background in Ruby and Ruby on Rails, as well as JavaScript and ideally CoffeeScript. We’d expect something on the order of 2-3 years of full-time Ruby experience.<p>Experience in the following would help you get up to speed and start committing on day one:<p>* RSpec and Jasmine<p>* CoffeeScript<p>* Sass and modular CSS<p>* Backbone &#x2F; Backbone.Marionette<p>* API design<p>Benefits and Work Environment<p>* We offer competitive salary, benefits, equity, and a fun and casual work environment.<p>* Because we pair most of the time, we work regular, predictable hours, starting at 9:30am with a brief morning stand-up, and ending at 6pm. We won’t ask you to stay late or work weekends except in truly exceptional situations. We care about work-life balance.<p>* We send interested employees to conferences to speak or just to learn. The whole 16 person engineering team has attended GoGaRuCo (Golden Gate Ruby Conference) here in San Francisco two years running, and we’ve given talks at a number of Ruby conferences.<p>* Our development workflow is a combination of pairing and soloing, with pull requests and code review.<p>* We use Pivotal Tracker to break down and estimate features and Travis for continuous integration of our test suite.<p>* We’ve seen the benefits of test-driven, high-quality code first hand, and we know what happens when code spikes turn into production code and become unmaintainable. You will have full-buyin from the team to spend time testing and writing maintainable code.<p>* We always striving to have the most enjoyable and productive environment. We conduct periodic team retrospectives where we discuss what’s working, what’s not working, and how we can improve everyone’s experience.<p>* We’re located in downtown San Francisco, two blocks from the Embarcadero BART.<p>Apply<p>Send your resumé, GitHub profile, or other examples of your work to jobs@mavenlink.com<p>Ask us questions! We believe that you should always ask probing questions about a company’s trajectory, funding, and plans when considering employment, especially at a startup. Please, ask us anything! We strive for operational transparency.","time":1391280246,"type":"comment"}