{"by":"bjelkeman-again","id":7162898,"parent":7162197,"text":"Akvo is a rapidly-growing, entrepreneurial non-profit foundation with a big mission. Our tools are already positively disrupting the ways that development aid is allocated and reported in a sector that has been historically adverse to change.<p>Akvo’s staff are based in multiple locations. We have a head office in the centre of Amsterdam with hubs in London, Stockholm, Washington DC, Nairobi and New Delhi. We also have people working from home in numerous other locations around the world. Where you are is not as important as who you are and what you can contribute.<p>We think job satisfaction comes, more than anything else, from working with great people on exciting projects. Akvo’s team is like no other, with motivated and talented people whose diverse backgrounds converge to accomplish shared objectives.<p>Open positions<p>UI designer &#x2F; developer<p>If you are a UI designer &#x2F; developer with startup experience wanting to contribute to make the world better, please read on!<p>  We are seeking a skilled, self-motivated, pro-active and energetic UI developer &#x2F; designer with a sense for data visualization. Reporting to the lead designer, your primary responsibility will be to create and ensure a consistent, usable, and beautiful UI throughout our software platform, which includes web applications, desktop applications and mobile &#x2F; tablet applications.<p> You have to be able to adapt to a fast changing environment where multi-tasking is a must. You will be required to design and develop functional user interfaces as well as keeping the brand consistent across the organization and a range of different products.<p>Being part of a continuously growing team is essential to maintain and improve the quality of our work.  <p>Akvo creates and runs open source internet and mobile services that make it easy to bring international development work online. We focus on project and programme dashboards, reporting, monitoring, evaluation and making data easier to share.<p>Headquartered in Amsterdam, Akvo is a non-profit foundation that works with more than a thousand organisations around the world.  We are looking for someone to be based in Helsinki (primary), Stockholm or Amsterdam. You must have a work permit already to work in one of these locations.<p>  Please send your CV along with a cover letter to loic@akvo.org<p>Web developer, based in Amsterdam, Netherlands<p>Akvo is hunting for the right full-stack developer to complement our existing technical team. We are experiencing a huge demand for our suite of open source software products, and need to increase our capacity as a team to be able to continually meet the expectations of our working partners.<p>To be suitable for this position you need to have experience working in modern Web Frameworks (such as Python&#x2F;Django), in addition to an interest in and an understanding of the latest and upcoming web development strategies and solutions. You should feel confident in delivering complete code based solutions to provided problems and documenting the work that you do.<p>We’re looking for someone eager to accept a challenge, and willing to enhance and improve their own skills while continuing to contribute to the group effort. Due to working in a globally distributed team, you should be an active communicator with the flexibility to encompass the variety of culture and working styles.<p>Core skills: Python&#x2F;Django, Java, HTML&#x2F;CSS, SQL, Ubuntu.\nPlease send your CV along with a cover letter to adrian@akvo.org<p>Software Developer<p>We are looking to hire a software developer to join our Akvo FLOW team.\nAkvo FLOW is one of our core software products. It is a Java based open source platform to collect, manage, analyse and display geographically-referenced monitoring and evaluation data. (Learn more about the Akvo Platform)<p>We have some fun, and interesting, problems to solve and we want you to help us fix them: How can we maintain and extend a complex tool with a lot of moving parts (a mobile Android app, a Web platform, map displays) while keeping it simple and enjoyable for people to use? Double down when they need to be able to use it in areas of the world with low, or inadequate, web and mobile connectivity? How to move towards a service oriented architecture, upgrading one component at a time, while keeping services running?<p>You’ll be working with our international team, based out of Amsterdam, Stockholm, Helsinki or remote at UTC to UTC+2.<p>Responsibilities:<p>•Design, develop and support open source Java based web applications&#x2F;services\n•Support the development and release process\n•Work with legacy code as well as new developments\n•Work with multiple languages Java, JavaScript, Clojure<p>Requirements:<p>•Experience with developing Java based web applications\n•Experience with JavaScript (MVC frameworks)\n•Experience with web technologies (HTML5&#x2F;CSS3)\n•Some experience with Clojure and&#x2F;or functional programming is desirable\n•Ability to work in a distributed team in a self-disciplined manner is expected\n•DVCS (git)<p>You must have a work permit already to work in one of these locations. Please send your CV along with a cover letter to ivan@akvo.org.","time":1391281695,"type":"comment"}