{"by":"uberc","id":7162232,"parent":7162197,"text":"New York City -- Grasshopper NYC looking for business co-founder for interactive game table venture<p>As part of our mission to revitalize face-to-face play for the 21st century, Grasshopper NYC has created a beautiful interactive game table that has potential as a standalone product and business. We are now looking for a business co-founder and leader to unlock this potential.<p>We’re looking for someone who knows the relevant entertainment markets (including both traditional at-home game consoles and the out-of-home entertainment market); is skilled at business and strategic planning; has experience getting integrated hardware&#x2F;software products to wide distribution; can get us the right industry partners; can lead fundraising as needed; has executive management potential; and is generally a excellent person who is fun and inspiring to work with.<p>Our game table is being featured this month at IndieCade East, the annual independent games festival, at New York’s Museum of the Moving Image. We think it’s both gorgeous and ergonomically unique, comfortably sitting up to 6 players with plenty of leg room. (Design has been led by a cutting-edge architecture firm headed by MIT&#x2F;Harvard architecture professors.) Technically, it’s a smart combination of open-source and proprietary software, including our own game framework built on Unity3D. (The core table engineering was led by an MIT Media Lab expert in multi-touch tables.) Unlike many interactive tables, it’s cool and smooth to the touch and is seamless and spill-proof; having a cocktail or beer at the table is encouraged by design. We already have around a dozen games working on the table -- ranging in stage from alpha to polished, some our own, some from third-parties indie game developers.<p>In short, we think we’ve created a special product that enables a unique and wonderful face-to-face game experience -- bringing the best of digital technology into a fully present, truly social interaction. Now we’re looking for a co-founder to turn an exceptional product into an exceptional business.<p>Additional background: the founder and creative director of Grasshopper NYC is an MIT engineer with a track record of product and business innovation in new media, including high-level executive positions in business news and as as a product management director at Google. A blog post in Gamasutra, a leading games industry website, noted that Grasshopper NYC is being talked about as “the coolest thing happening in the New York game industry at the moment.”<p>Interested? Email Ien Cheng at ien@grasshoppernyc.com.","time":1391275030,"type":"comment"}