{"by":"ryanshow","id":7162589,"parent":7162197,"text":"Perkville (Rockridge, CA) - REMOTE OK - <a href=\"http://perkville.com\" rel=\"nofollow\">http:&#x2F;&#x2F;perkville.com</a><p>Hi there! We’re Perkville, a startup that’s all about customer loyalty. Using Perkville, small and medium-sized businesses painlessly set up rewards programs. Customers earn points for interacting with a business, and can redeem those points for perks -- a free t-shirt or private lesson, for example. And we do this with a minimum of pain on the part of the customer and business. \nWe’ve been around since 2010, and are based out of Rockridge, CA. We have experience from eBay, LinkedIn, and Yahoo! Our solution is used by hundreds of thousands of users, and we’re growing fast.<p>We’re seeking a full stack engineer who’s fluent in the Django framework.<p>Requirements:\nYou have at least two years of experience developing web applications with Python&#x2F;Django ● \nYou’re fluent in the front end technologies of the web -- HTML, CSS, Javascript ● \nYou’re experienced with front-end frameworks that make web development a bit easier -- e.g., LESS, jQuery, Bootstrap\nYou feel right at home with DVCS software such as git or mercurial ● \nYou’re experienced with application-oriented database management -- creating tables, optimizing queries, etc. ● \nYou have a track record of writing clean, wonderful, and maintainable code ● \nYou’re a learner, great communicator, and passionate about making awesome, fast, useful applications<p>In addition, experience with the following is a definite plus:\nTest driven development ● \nLinux ● \nJinja2 ● \nuWSGI ● \nNginx ● \nMySQL ● \nRedis<p>Perks for You:\nWe’re pre-Series A, which means we’re still small, and that gives you an opportunity to have a huge impact. We can promise a nice salary, a great stock package, and a fantastic experience. More benefits are planned as we grow.<p>If interested, send an email to jobs@perkville.com with a 1 page résumé<p>We look forward to hearing from you!","time":1391278528,"type":"comment"}