{"by":"narsil","id":7163971,"parent":7162197,"text":"Kloudless (<a href=\"https://kloudless.com\" rel=\"nofollow\">https:&#x2F;&#x2F;kloudless.com</a>) - SF Bay Area (Berkeley)<p>Front-End Developer - Full Time<p>TO APPLY: email work@kloudless.com<p>Kloudless is hiring! We are a well-funded ($1M+) startup located in Berkeley, helping people work across cloud services easier. We launched earlier in May on the stage of TC Disrupt NYC and have ramped up with 20% growth month-over-month. We&#x27;re backed by leading Silicon Valley angel investors such as David Sacks of Yammer and Tim Draper from DFJ.<p>With our latest round of funding, we are looking for a passionate and experienced Front-End Developer to lead our client-facing application development.<p>YOU<p>- A solid foundation in software development, with strong competencies in data structures, algorithms and software design patterns.<p>- Passionate about elegant solutions. Non-DRY, spaghetti code and the like should trigger panic attacks.<p>- Excellent JavaScript knowledge and experience with client side MVC frameworks such as Backbone.js, Underscore.js, Ember, Knockout or Angular<p>- Excellent knowledge of current web standards: HTML5, CSS3, and responsive design.<p>- Experience working with preprocessors (CoffeeScript, Sass, Less or Compass).<p>- Experience with a dynamic deployment process (git version control, code reviews, bash scripts).<p>- Experience building and shipping code to production countless times.<p>- A good eye for design... no need to be a graphic designer, but need to know what a good UI looks like, and like to create a great user experience. Any design experience is a plus.<p>Essential: Drive to contribute at every stage in delivering the best software: brainstorming for roadmap, architecture, implementation, testing, shipment and maintenance.<p>HOW WE WORK<p>We operate on the mentality of mutual trust for all of our projects. We have a flat team structure, and we expect everyone’s opinions when making decisions or brainstorming. The dev team has strong experience in web application development, distributed computing, machine learning and systems management. We love open source and have contributed to several projects including our own. Our backend technology consists of Django, PostgreSQL, MongoDB, Storm, ElasticSearch, nginx, puppet, plenty of Python, a dash of Ruby and some Java and Lua for flavor.<p>PERKS<p>- Macbook, external monitor, whiteboard desk and any other equipment you need<p>- All the food&#x2F;drink you could stuff your face with.<p>- Great location: We’re in the heart of Downtown Berkeley, half a block from BART and there’s a great selection of restaurants nearby as well.<p>- On-the-Kloud team lunches&#x2F;dinners.<p>- Team outings<p>- Subsidized gym membership<p>- Covered public transportation cost of traveling to office<p>- Monthly allowance to spend on cool stuff you want in the office<p>TO APPLY<p>Shoot us an email at work@kloudless.com with your resume and&#x2F;or any relevant links (Github, LinkedIn, Dribbble, personal websites, portfolio, etc.). If you can point us to an application you shipped that we could check out, that would be great!","time":1391297853,"type":"comment"}