{"by":"RichardPrice","id":7163745,"kids":[7164879],"parent":7162197,"text":"Academia.edu, San Francisco, CA<p>Academia.edu is trying to improve the way that scientific publishing works. Here is the current way it works. A scientist does some experiments and writes up a paper. He sends it to a journal who sends it out to two or three peer reviewers. They peer review it, which means writing a page of comments on it, and recommending either accepting or rejecting it. Usually you get a few journal rejections and the average time-lag between finishing the paper and its being published is 12 months. Then the paper is behind a paywall and people have to pay $35 to read it.<p>Our view of scientific publishing is that when you finish the paper you should post it immediately on the internet. Peer review should be done post-publication, and it should be done by the community, reddit-style, not by just two or three people. We believe peer review will be more robust that way. And the paper should be openly and freely accessible for anyone to read, along with the data and any accompanying materials like source code.<p>We believe that this will speed up science, and accelerate research into curing diseases, reducing infant mortality, and discovering clean energy amongst other things.<p>We are a mission-driven team based in San Francisco. We have raised $17 million from Khosla ventures and Spark Capital. Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot; Over 7 million academics have joined Academia.edu, and 800k plus join up each month.<p>If you are a mission-driven person then you may enjoy the atmosphere at Academia.edu and the problems we are working on.<p>We are looking to hire full stack software engineers. Technologies we use include Ruby, Rails, Postgres, Mongo and Varnish. Our office is in downtown San Francisco. For more information, visit <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>. If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1391293406,"type":"comment"}