{"by":"amitt","id":7163444,"parent":7162197,"text":"San Francisco - Red Hot Labs - <a href=\"http://www.redhotlabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redhotlabs.com</a><p>We&#x27;re on a mission to revolutionize how mobile developers harness their data.  Our product, still in beta, functions as the central hub for all the services mobile developers already use.  By weaving together the data from these disparate services, we gain a comprehensive view of the app and are uniquely positioned to deliver insights and value back to the developer.<p>This isn&#x27;t our first trip around the block.  Our previous startup was acquired by Zynga and our core technology turned into FarmVille and the rest of Zynga’s most successful games.  It was a wild ride and now we’re full steam ahead on a new adventure.<p>We&#x27;re looking for passionate, energetic, highly talented engineers to join our team.  By becoming a foundational member of our team you will help shape the direction of our product, company and culture.  We’re believe in constantly challenging ourselves to learn new things and would love to teach you what we know and learn from you as well.<p>We want all members of the team to be full-stack engineers and well-rounded individuals.  But, we&#x27;re especially excited about the following profiles:<p>Senior Product Engineer: You&#x27;ve built products from concept all the way to maturity.  You&#x27;re as opinionated and influential about product as you are about coding.  You&#x27;re a master at JS&#x2F;CSS&#x2F;HTML and customer facing technologies. Bonus points if you’re on-top of your front-end frameworks like Angular (which we use!), Ember, or Meteor.<p>Senior Systems Engineer: You&#x27;ve architected and scaled backend systems to millions of users.  You&#x27;ve put out every kind of fire and learned a lot in the process. You understand the tradeoffs of different data stores, server architectures, and low-level services.<p>Senior Data Engineer: You&#x27;ve built models which extract insights or predictions from large, living datasets.  You can engage with a dataset in an unfamiliar domain, grasp the dynamics of the system and impress subject area experts with your result.<p>Stupendous Junior Engineer: You don&#x27;t have years of working experience, but you have handful of mind-blowing personal or school projects.  You were among the best students at a top tier engineering university. Your TA&#x27;s and classmates gush about your code.<p>Does this sound like you? Send us an email at: jobs@redhotlabs.com<p>Or, learn a little more about us here: <a href=\"http://www.redhotlabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redhotlabs.com</a>","time":1391289742,"type":"comment"}