{"by":"jpitzo","id":7164368,"parent":7162197,"text":"San Francisco (relocation possible) - HouseCanary -<a href=\"http://housecanary.com\" rel=\"nofollow\">http:&#x2F;&#x2F;housecanary.com</a><p>Looking for UX&#x2F;UI designer and Frontend Developer<p>Over the past year we brought together real estate experts, economists, and Statistics PhD’s to build a big data platform to accurately forecast real estate values up to 36 months into the future for all 381 US counties (MSA&#x27;s) and 25,000 major zip codes.  We forecast at this level as real estate truly is local, and we’ve found there are huge differences in how markets move between zip codes in a county.  Our forecasts have over 90% accuracy forecasting housing prices up to 3 years out for most US real estate markets.  We have back-tested these models for accuracy over the past 40 years, so that we can have confidence in calling the major market turns, and also understand where we are in the cycle and the likely future returns.<p>We are currently working with sophisticated institutions such as homebuilders, land investors, mortgage banks, etc. to use these forecasts.<p>We will be building housecanary.com into a full consumer oriented website in early 2014.  We want to provide property owners in the US with a simple and accurate forecast for what is likely to happen to their home&#x27;s value over the next few years (at a zip code level), given that a home represents most people&#x27;s single largest investment in life. There are many people who want to better understand and plan for future price swings, similar to how they manage the rest of their financial assets, however currently, there is insufficient information available to consumers.  We can now provide 80M US households with powerful data&#x2F;forecasts only the largest banks and hedge funds had access to historically.<p>Positions available:<p>UI&#x2F;UX Designer - Our ideal designer will be able to build beautiful and simple web sites, help out with product design and implement the designs in HTML and CSS.  However being able to code is not required, just a huge plus.  We’re building very data driven products, so experience working on analytic heavy sites is also a plus.<p>Frontend developer - Our frontend is compiled statically (hosted on s3 and cloudfront) and all data is pulled via angular from our API.  Our graphs are built using d3.js, we use SASS as our css preprocessor and grunt for our builds and deployment.  Our ideal frontend developer will have prior experience with angular and prior experience building out analytic driven sites<p>We’re a small but growing team, so your work will have large impact of the future success of the company.  And as one of our first hires you will rewarded with meaningful equity in the company.<p>We have an office in the SOMA neighborhood of San Francisco. We cover health, dental and vision for all of our employees.  Please note, we’re currently only looking to hire people who are located in the US or have US work authorization.<p>If interested please email joey@housecanary.com","time":1391304727,"type":"comment"}