{"by":"skrebbel","id":7165666,"parent":7162197,"text":"Izooble - Eindhoven, The Netherlands<p>Looking for an experienced full-stack web developer.<p>At Izooble, we believe that the best programmers are all-rounders. We&#x27;re currently in the going through a total rebuild of our architecture and technology, while we&#x27;re re-targeting our app to the web. You would be involved in all aspects of this responsive, mobile-first web application. We are re-inventing product search, which means a large amount of challenging problems related to data and search technology. The vast majority of technical decisions on both the front-end and the back-end are still to be made, so you will be able to have a major influence on the Izooble app and business.<p>The dev team is small, currently consisting of 6 people, including 3 great interns.<p>What we&#x27;re looking for in a candidate:<p><pre><code>    * Allrounder: a wish to do both front-end and back-end programming.\n    * Experience with at least 2 programming languages and a wish to learn more. \n    * A strong interest in software design and architecture. \n      Demonstrable experience with architecture, or a deep desire to learn.\n    * We care deeply about a good user experience, and we expect that you can \n      think along.\n      with the designers and concept developers on this.\n    * Interest in coaching and supporting interns. Bring good engineering \n      practices with you and teach them to the team.\n</code></pre>\nIzooble is a Social Recommendation Platform for products in which people use their social networks to ﬁnd, share and buy products online. With Izooble, users get 100% personalized search results and 100% relevant content in their wall, without privacy issues and free of advertisements.<p>We&#x27;re organised as a distributed company, currently with people in the Netherlands, Portugal and Poland. Anyone with a permit to work in the EU can apply, as long as they&#x27;re willing to come over to Eindhoven every month or so.<p>More info on <a href=\"http://izooble.com/jobs.html\" rel=\"nofollow\">http:&#x2F;&#x2F;izooble.com&#x2F;jobs.html</a>","time":1391340176,"type":"comment"}