{"by":"marksc","id":7166595,"parent":7162197,"text":"Senior Windows Software Engineer | Duo Security | Ann Arbor, Michigan (Relocation strongly preferred)<p>(<a href=\"https://www.duosecurity.com/company/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.duosecurity.com&#x2F;company&#x2F;jobs</a>)<p>Duo Security&#x27;s hosted two-factor authentication service brings strong, scalable security to organizations of any size. Duo&#x27;s unique, high-availability architecture provides centralized management, self-service enrollment, and interactive secondary login through an intuitive web interface, eliminating the high costs, complexity, and confusion associated with traditional two-factor systems. Every day, over 1,000 organizations in 80+ countries around the world rely on Duo for their security.<p>Duo Security is based in Ann Arbor, Michigan, and is a privately held company whose investors include Google Ventures, True Ventures, Resonant Venture Partners, and Radar Partners. Read more about Duo&#x27;s investors.<p>About Duo &#x2F; Co-Founder Bios: <a href=\"https://www.duosecurity.com/company/about\" rel=\"nofollow\">https:&#x2F;&#x2F;www.duosecurity.com&#x2F;company&#x2F;about</a><p>-----------------------------------<p>Our ideal candidate is an experienced Windows developer. Experience with security products a big plus, as is experience working on B2B and SaaS products.<p>Job duties:<p>* Integrate Duo with all things Windows including Active Directory, ADFS, Exchange Server, IIS, and Remote Desktop Services.<p>* Help us build and deliver cloud-based 2FA services for two-factor authentication as part of a high performance development team.<p>* Handle field escalations, related to Windows integrations, when fronttline support escalates support requests.<p>Main qualifications:<p>Windows development experience<p>* C++ (e.g. Win32 API, COM, MFC)<p>* C#, .NET<p>* Windows Installers (e.g. WiX)<p>Secondary qualifications:<p>* Experience with Windows security APIs and technologies<p>* Experience with development and administration of Active Directory, ADFS, Exchange Server, IIS, and Remote Desktop Services<p>* Experience with Python development<p>* Mobile development for Windows Phone, iOS, or Android<p>You also...<p>* Care about contributing to an amazing work culture and environment<p>* Are comfortable with the rapid, unpredictable nature of a tech startup<p>* Don&#x27;t believe you have to live on a coast to work for a high-growth, tech startup<p>-----------------------------------<p>Excited? We can&#x27;t wait to hear from you!<p><a href=\"https://www.duosecurity.com/company/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.duosecurity.com&#x2F;company&#x2F;jobs</a>","time":1391360970,"type":"comment"}