{"by":"uaydin","id":7166365,"parent":7162197,"text":"Join&#x27;em, TX\n-----\nJoin’em is the first community-powered marketplace to provide an easy, fun and collaborative way to leverage the collective buying power of like-minded shoppers with quality merchants. Our core proposition is based on WePower™ to enable groups to shop, share and beat down the prices on thousands of brand name products and services.<p>We are open to all levels(junior, mid and senior):<p>==================\nBack End Developer\n==================<p>Responsibilities:\nYour work will span many areas of the Join&#x27;em platform, including but not limited to:<p>- Playing with large datasets\n- Developing our RESTful APIs\n- Working on machine learning (such as recommendation systems)\n- Developing dashboards\n- Scaling applications across distributed machines\n- Requirements<p>- Fluent in python language\n- Write great code, view it as a craft, and be proud of what you do at your job\n- Experience using Git<p>Pluses:<p>- Have a college degree in Computer Science or equivalent experience\n- Experience with a good portion of our technology stack\n- Experience in working in i18n projects supporting non-Latin languages (as we expend future markets)\n- Familiarity with standards and guidelines; including: Unicode, CLDR, ICU, PEP 8 etc..)\n- Experience in A&#x2F;B testing\n- E-commerce experience<p>Our stack:\nYou will work with a broad and bleeding-edge back-end technologies, including but not limited to:<p>- Python and Django\n- PostgreSQL\n- MongoDB\n- Redis\n- Amazon Web Services\n- Third party apps (such as Braintree, Optimizely, Twilio, Paypal etc..)<p>===================\nFront End Developer\n===================<p>Responsibilities:\nYour work will span many areas of the Join&#x27;em platform, including but not limited to:<p>- Developing device agnostic &amp; responsive frontend code\n- Work with creative and production team to bring ideas to life\n- Code HTML marketing campaign emails<p>Requirements:<p>- Must be able to communicate well with designers and developers\n- Solid understanding of core front-end web technologies (HTML5, CSS3, JavaScript)\n- Understanding of emerging UI&#x2F;UX concepts\n- Experience with jQuery\n- Responsive design experience\n- Experience using Git<p>Pluses:<p>- Experience with Bootstrap, Backbone.js, AngularJS\n- Experience with LESS CSS pre-processor\n- Experience in A&#x2F;B testing\n- Experience in template engines such as Django, Jinja, or Smarty\n- E-commerce experience<p>These are full-time position based in our Dallas, TX office. Relocation assistance may be available.<p>Please email your resume to dev.hr@joinem.com.","time":1391356955,"type":"comment"}