{"by":"ilz","id":7166937,"parent":7162197,"text":"Blue Apron (New York, NY): Software Engineer<p>Blue Apron (<a href=\"http://www.blueapron.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blueapron.com</a>) is an NYC-based startup delivering original recipes and premium, seasonal ingredients needed to prepare them, in exactly the right proportions. We&#x27;ve raised $8M from First Round Capital and Bessemer Venture Partners, among others. Forbes recently named us one of the hottest startups of 2013 [1].<p>Since launching in late 2012, we&#x27;re now delivering over 350,000 meals each month nationwide. Our product is growing quickly, and we want to work with talented, passionate individuals that will help us enhance the experience of cooking at home.<p>Our engineers solve problems for both customers and members of the Blue Apron team. We evaluate, design, and implement new features to provide more enjoyable experiences for our users. We collaborate to understand and overcome unique supply-chain, scheduling, and logistics challenges. We listen to the needs of our internal teams and build tools that bring harmony to complex operational workflows.<p>Our stack: Ruby on Rails, RSpec, PostgreSQL, HAML, Bootstrap, SASS, JQuery, AJAX, Git, Heroku<p>About you:<p>- You&#x27;ve taken features or products from concept to completion and have experience working with production web applications.<p>- You communicate your ideas clearly, and are capable of designing and implementing complex, scalable solutions.<p>- You want to build software that has impact on the lives of customers and coworkers alike.<p>- You are always learning and are excited at the prospect of mastering new technologies and techniques.<p>- You write tests to improve the quality and reliability of your code.<p>- You help teammates improve when reviewing their work and appreciate feedback when they reciprocate.<p>This role comes with health insurance, a flexible vacation policy, and competitive salary and equity. To apply, please submit a short email outlining your experience and why you are interested along with your resume to jobs@blueapron.com.<p>[1] <a href=\"http://www.forbes.com/pictures/emjl45himd/blue-apron-4/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;pictures&#x2F;emjl45himd&#x2F;blue-apron-4&#x2F;</a>","time":1391366527,"type":"comment"}