{"by":"kingrolo","id":7169910,"parent":7162197,"text":"London, UK. REMOTE partly okay, but some meetings in London required. Part time 3&#x2F;4 days a week also a possibility.<p>Wildfish - <a href=\"http://wildfish.com\" rel=\"nofollow\">http:&#x2F;&#x2F;wildfish.com</a><p>We&#x27;re a London based consultancy, working exclusively with Django. Thus far it&#x27;s just been myself and a collective of freelancers, for some 13 years now, but now I&#x27;m looking to put together a permanent team to take things to the next level, maybe starting with you :).<p>As the first permanent developer besides me (also a Django specialist) you&#x27;ll get a chance to help shape how we do pretty much everything. Most of the day to day will be working on developing and maintaining new and existing client web apps and sites, but there&#x27;ll also be time for our own product ideas, as well as open source work and blog posts.<p>Everything&#x27;s results focused. As such you&#x27;ll be free to work from home as much as you want, meeting up occasionally, so long as things get done and the clients are happy.<p>Some of the things we use, which it would be good for you to know some of:<p>- Python&#x2F;Django [Essential]<p>- HTML&#x2F;CSS&#x2F;Javascript [Essential]<p>- Twitter Bootstrap<p>- Git &#x2F; Github<p>- PostgreSQL<p>- Ubuntu Linux Server Administration<p>- TDD, django-webtest<p>- Jenkins, django-jenkins<p>- Salt, Linode<p>I&#x27;m imagining I&#x27;m looking for someone who has at least 2 years of Django experience, experience in an agency&#x2F;consultancy environment would be a bonus, but if you can demonstrate that you know your stuff, for example with open source contributions, or code examples, then that&#x27;s fine too.<p>You&#x27;ll be working autonomously a fair bit, so it&#x27;s important that you&#x27;re the sort of person who has attention to detail and can read requirements carefully.<p>Would also be open to considering either part time work, or possibly part equity, please mention when getting in touch if any of these are of interest. Also let me know what sort of money you&#x27;re looking for. Please mail work@wildfish.com.<p>Thanks :)","time":1391424360,"type":"comment"}