{"by":"imethan","id":7172440,"parent":7162197,"text":"Voltaiq - SF, NYC, or REMOTE - Full Time - <a href=\"http://voltaiq.io\" rel=\"nofollow\">http:&#x2F;&#x2F;voltaiq.io</a><p>Software Developers — Deployment&#x2F;Front-end&#x2F;Full Stack<p>Battery performance is the key bottleneck slowing the adoption of electric-vehicles, renewable energy, and longer lasting more powerful mobile electronics. Voltaiq is developing a powerful web-based data analytics and visualization platform to enable better, longer-lasting batteries and other energy devices. Our core team is comprised of masters and PhD-level energy engineers, computer scientists, and machine learning experts. We have early customer revenue, and funding from the National Science Foundation and U.S. Department of Energy.<p>Voltaiq is looking for creative, experienced, and extremely talented software developers to join our team in the San Francisco Bay Area or New York City. These will be our first hires, so you’ll be getting in on the ground floor of a fast-paced, customer-focused, product-driven startup. Your duties will encompass the full stack, from development through deployment.<p>We are looking to fill three positions immediately, and will give preference to those with a broad knowledge base and a strong desire to learn. Currently, we’re looking for:<p>* Deployment Specialist<p>* Front-end Developer<p>* Full Stack Web Developer&#x2F;Generalist<p>Desired Tech Skills:<p>* Strong coding skills in one or more of the following: Python, Java, C&#x2F;C++, Go.<p>* Front-end development experience: Coffeescript, Sass, Backbone&#x2F;Underscore, Handlebars, Highcharts, D3.<p>* Solid understanding of a web deployment stack: Cookies, sessions, websockets, asset management.<p>* Experience using ZeroMQ or a similar asynchronous messaging system.<p>* Strong command of Linux and deployments on Amazon Web Services.<p>* Deployment experience: Salt Stack, Fabric, Nginx, uWSGI.<p>* Knowledge of Git and experience committing to a team code repository.<p>* Experience with MongoDB, managing mongo instances, and the mongo aggregation framework.<p>Other Prerequisites:<p>* Undergraduate degree in Computer Science, Engineering, Physical&#x2F;Biological Sciences, Math or a related discipline. Advanced degree strongly preferred.<p>* Intuitive grasp of fundamental concepts and quantities in energy and power.<p>* At least 3 years of experience developing and shipping software.<p>* Willingness to travel occasionally for in-person meetings, conferences, and deployments.<p>* Strong team player with the ability to help build and work as a cohesive team.<p>Compensation: Competitive salary plus equity and full benefits\nLocation(s): SF Bay Area, NYC<p>Email us a resume at jobs@voltaiq.io","time":1391451388,"type":"comment"}