{"by":"stanshch","id":7193371,"parent":7162197,"text":"The Area: Software Engineering<p>Axial’s engineers develop technology to drive the transformation and democratization of modern capital markets. In addition to leveraging and building search technology to transform an entire industry, our engineers use their skills to advance our data, social and other technology-driven product strategies and initiatives.<p>The Role<p>As a Front-End Engineer at Axial, you’re responsible for developing and refining the client-facing HTML, Javascript and CSS portions of our platform. We’re a tight-knit team here so collaboration is a must. You&#x27;ll be building technology hands-on with a small product and design team, and be responsible for prototyping and creating responsive and elegant UIs to drive site engagement and manageability.<p>You’ll also be working to help us improve our service aggregators, applications templating, and client-side libraries, and to extend and improve the power and scale of the Axial platform. You will be challenged to deconstruct designs into fine-grained, distributed modules capable of reuse in any portion of our platform.<p>You’ll be challenged to engineer great, sustainable technology at high speed, but that’s okay ‘cause you’re a champ.<p>The benefits of being an Axialite ...\nwe are building something very important\nthe team you&#x27;re joining is pretty darn good and getting better with every new hire\nwe pay people what they&#x27;re worth, not what we can get away with\nstocked and ever-expanding technical library onsite\nstocked fridge and bottomless coffee\nbike-friendly\ngood location w&#x2F; roof in the Flatiron\nDesired Skills and Experience\nWe look for technologists who:<p>- Are expert at working with JavaScript, HTML, and CSS\n- Are intimately familiar with browser quirks\n- Love creating well-crafted interfaces and elegant web UI’s\n- Communicate and collaborate well<p>Bonus points for:<p>- Bootstrap, jQuery, or Django\n- Experience developing in *NIX environments\n- Experience with a non-JavaScript programming language (python, php, ruby, perl, sh)<p>Reach out to stan@axial.net with your resume if interested in hearing more.","time":1391726069,"type":"comment"}