{"by":"swarrentek","id":7215057,"parent":7162197,"text":"Chantilly, VA (no remote) - H1B &amp; INTERNS WELCOME<p>Ruby on Rails &amp; Android Developer<p>TekMasters is looking for a Developer to join our dynamic Visa Application Project. We’re working on creating a better system to streamline the Visa process and get ready rid all the shops that are charging people a lot of money to process Visa applications internationally. We’re developing an international VISA application that is being launched in over 48 countries which is written in Ruby on Rails. This year, we’re looking to launch an Android native app to enable users to access the application via their phone which will empower users to understand the process and apply quicker and cheaper.  Our project supports the Department of State and US Embassies and is fully funded until February 2020. That means even if there’s a government shutdown, we’re not affected.<p>This project has a huge impact on all people seeking to work on a temporary or permanent basis and to date, received over 1.9 million views per day. Due to the large enterprise level environment, we are focused on continuing our Agile methodology, bringing it to government contracts to ensure that users have the best experience with our apps, and there’s less chance of bugs.<p>We’re looking for junior developer with a passion for technology who want to learn a variety of different languages and have a passion for development; before, during, and after graduation from college. If you have either Ruby on Rails or Android, and a willingness to learn the other, you are more than welcome to apply.<p>-\tIdeally 1+ years in either of the following: RoR or Android.\n-\tYou must be familiar with a Linux Ubuntu environment, and have the ability to write code on a Mac. \n-\tYou do not need to be a US citizen or have a security clearance to work on this project, however, this does require you to work on site in Chantilly, VA the majority of the time.<p>For more information, contact Shannon at swarren@tekmasters.com or call 703-349-5698.","time":1392081877,"type":"comment"}