{"by":"eflglobal","id":7217954,"parent":7162197,"text":"Lima, Peru -AND- Boston, MA -- Full Stack Junior Developer Fellowship opportunity!<p>---<p>About Entrepreneurial Finance Lab:<p>EFL&#x27;s mission is to expand access to finance in emerging markets by equipping banks with better tools to measure credit risk. Built with the aim of tackling a 2.5 trillion dollar financing gap for small and medium enterprises (SMEs) around the world, EFL&#x27;s digital psychometric credit assessment evaluates small business owners on key elements of entrepreneurship in a scalable and automated manner. This breakthrough technology helps banks provide financing to market segments previously out of reach, and helps bring the developing world&#x27;s most capable, yet previously unbankable, entrepreneurs into the formal financial fold. After spinning off from a research initiative at the Harvard Kennedy School&#x27;s Center for International Development, EFL now works with leading financial institutions across Africa, Asia, and Latin America, and has facilitated over $240 million in lending to SMEs. We’ve been recognized and endorsed by leading development organizations such as the IFC, Inter-American Development Bank, and the G-20.<p>---<p>About the Fellowship:<p>The two-year Global Technology Fellowship provides an opportunity for young, driven individuals with a background in computer science and software engineering to gain exposure to a quickly growing and highly accredited startup in the field of emerging market technology. Your mission will be to tackle engineering challenges at the intersection of data science and software development.  We are re-engineering our infrastructure and will need help in designing for growth.  The Fellowship will be based in Lima, Peru and Boston, MA for the duration of the first year, and you will also have the opportunity to engage with EFL clients in Latin America, Africa, and Asia. We at EFL view first-hand exposure to emerging markets as an essential component of the fellowship and guarantee at least six weeks of on the ground experience within your first year.<p>Projects you may be asked to take on in your first year are:<p>Web Development\n•      Enhancements to the EFL Web App to meet new customer feature needs (Django and JQuery)\n•      Implementation of automated continuous integration (Git, Jenkins, and AWS)<p>Scoring Systems\n•      Enhancements to support faster asynchronous scoring and reporting needs (Celery)\n•      Enhancements to async infrastructure configuration to support redundancy (AWS and Celery)<p>UX&#x2F;UI Projects\n•      Android Mobile tools development (Android)\n•      Enhancements to the EFL Web App (Django&#x2F;CSS&#x2F;XHTML)<p>R&amp;D Projects\n•      Mobile, GIS, and Social scoring enhancements to the core EFL algorithm (NoSQL, R)<p>Client Integration Projects\n•      Enhancements to the EFL REST API (Python) \n•      Client integration projects (varies)<p>Based on your contributions in your first year,  EFL will offer you a position for a second and final year of the fellowship. This position may be a continuation of one of the projects you worked on in year one, or it may be a new opportunity in one of our global markets. Your success in both years of the fellowship will depend on your ability to learn quickly in situations that are foreign, to think critically through complex challenges, to take initiative as opportunities present themselves, and to execute efficiently and effectively.<p>Additional Fellowship Opportunities:<p>As a Global Technology Fellow, you will have the opportunity to engage with EFL’s senior leadership to gain exposure to other areas of the business including sales, project management, credit modeling and statistics.  You’ll be joining a tight-knit corps of EFL Fellows with an array of skillsets and shared ambitions in the field of emerging market technology, and will have access to leading practitioners of development economics. Fellows are highly encouraged to utilize these resources during their time with EFL. For more information on current and past Fellows, visit eflglobal.com&#x2F;efl-fellowship.<p>---<p>Qualifications:<p>Required Qualifications:\n•      BA&#x2F;BS in Computer Science, Software Engineering or equivalent degree\n•      Solid experience in one of Python, Ruby or PHP, a modern MVC framework (Django, Ruby-on-Rails, Spring, etc)\n•      Some experience with JQuery&#x2F;CSS&#x2F;XHTML\n•      Experience with one major RDBMS system: MySQL, Postgres, Oracle, or MSSQL\n•      Proficiency with Git\n•      Proficiency with at least one major OOP language C++, Java, or C#\n•      Proficiency with Linux, Apache\n•      Work and&#x2F;or travel experience in emerging markets in Africa, Latin America, and&#x2F;or Asia<p>Desired Qualifications:\n•      A self-starting, entrepreneurial nature, as well as the ability to take on leadership roles and manage many projects at once.\n•      Foreign language ability (preferably Spanish and&#x2F;or Portuguese)\n•      Proficiency with REST and&#x2F;or SOAP web services\n•      NoSQL experience\n•      Experience with Matlab, R, NumPy etc\n•      Design skills (InDesign, Photoshop, Fireworks, etc)\n•      Advanced proficiency in Microsoft Word, PowerPoint, and Excel.<p>---<p>How to apply:<p>Email a cover letter and resume to Darrell Grissen at careers@eflglobal.com. Please save both in a single word document or PDF entitled “LastName.FirstName-TechFellowship” (e.g., “Smith.John-TechFellowship”) Applications without cover letters will not be considered.  In the cover letter, please touch on who you are, why EFL and why this position.  We are looking for a real person, not credentials; you’ll be a member of a small, growing team, so be yourself! Applications will be accepted until March 21, 2014.","time":1392131790,"type":"comment"}