{"by":"baggu","id":7226176,"parent":7162197,"text":"San Francisco, CA<p>We&#x27;re open to meeting potential INTERNs, but this job requires a full-time on-site (not REMOTE) commitment. We have no experience with H1B, but would be open to it for the right person. Cutting to the chase:<p>BAGGU (baggu.com) is looking for a well-rounded developer to help us continue to build web-based software tools at our studio in San Francisco.<p>It may seem out of place on HN since we&#x27;re not VC funded, and we make physical products — but technology has been a big part of BAGGU since the beginning. Our website, content management and ordering systems are developed internally. There is a constant dialogue between designers and developers. We build things that suit our needs, and solve problems quickly. Product design, graphic design, photography and interactive all happen in-house. We are a small, close-knit team. It’s a fun and collaborative environment.<p>Our stack is composed of Node.js, Redis and CouchDB on the backend, with Backbone, JQuery and Less (compiled and minified, of course) on the client. Most of our JavaScript is written in CoffeeScript. We use Git and are deployed on Amazon infrastructure. We love building things from scratch, and we’d love to find someone who could lead us toward releasing our tools as open source.<p>Familiarity with components of our stack is important, but most important is that you are disciplined, self-motivated, and fit well into a collaborative creative environment. We’re happy to take on someone technically adept who can learn quickly. You don’t need a CS degree, but you need to both eagerly solve problems that are thrown at you and lead the development of larger projects.<p>To give you a feel for it, these are some examples of things you could be working on:\n- You figure out that ordering system doesn’t seem to be consuming orders via Redis fast enough. Time to get in there and figure out why.\n- It would be convenient if wholesale customers had a portal they could use to process payment. Lay out a roadmap for making this happen, then impliment.\n- View rendering on the client is sometimes too slow. Explore some options for server-sided rendering with some quick mock-ups so we can evaluate a timeframe for making it happen.<p>We are a small business that values a healthy work life balance. There’s plenty to do, but we prefer to get it done at a consistent pace. No weekends and very rare late nights.<p>Qualified applicants will submit a CV and cover letter that detail their relevant experience and related projects. Get in touch with it@baggu.com","time":1392229509,"type":"comment"}