{"by":"geoffreydgraham","id":7234075,"parent":7162197,"text":"Atlanta, GA - GuildQuality - Remote in USA or here in the ATL<p>---<p>If you&#x27;re a Web Application Developer who likes to build and ship; values freedom, flexibility, and empowerment; loves working with the best tools; values working alongside supportive people who care about and respect you; gets jazzed by the notion that your work will have an immediate, visible, and significant impact on the health of the business; longs for an opportunity to be a part of an award-winning work environment where friendliness is a core requirement for every role, and everyone is focused on measurable results; and is awesome; then we would like to speak with you about joining our team.<p>We&#x27;re looking for Web Application Developers who have 10,000+ hours of PHP, PHP frameworks, and high-performance web applications; a friendly disposition, a love of learning, and an interest in building great products for real customers; and a readiness to immediately begin building cool new stuff from the ground up.<p>GuildQuality - <a href=\"http://www.guildquality.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.guildquality.com</a> - is a profitable, fast-growing SaaS business that helps the very best homebuilders, remodelers, and home improvement contractors in North America deliver an exceptional customer experience. Our clients (we call them &quot;Guildmembers&quot;) are small and mid-sized companies, representing a “best of the best” in the residential real estate and construction industry.<p>Ours is a big market and it’s getting bigger: we&#x27;re squarely at the intersection of reputation, real estate, and home improvement. We&#x27;re doing tons of great stuff in this space, and we&#x27;d like to have more wonderful people on the team to help us accelerate our pace of innovation.<p>About our work environment, culture, and benefits:\n• We have 24 full-time, committed, friendly, and resourceful people on our team.\n• Most of our team works here in our Midtown Atlanta office, and about 10 people work remotely.\n• We&#x27;re profitable and growing rapidly.\n• We dig things like craftsmanship, design, and data.\n• We have a Results Oriented Work Environment (ROWE).\n• We don&#x27;t monitor sick days or vacation days. When someone needs time off, they take it.\n• We have very few meetings, but lots of communication.\n• People work from wherever and whenever they&#x27;re most productive.\n• We&#x27;re open-book. That means everyone has a clear understanding of how the business is performing.\n• Employment benefits include great health insurance, long term disability insurance, and life insurance.\n• The company matches SIMPLE IRA contributions, up to 3% of salary.\n• We have excellent retreats, where we roll up our sleaves and everyone digs into strategizing about the future of the company, and then we throw down and have a great time.\n• Every single person in the company moves our needle. We have no dead weight getting in the way, no negative attitudes bringing people down, and no bureaucracy dragging on our progress.\n• Regardless of the job description and requisite skills, we only hire folks who are friendly, committed, and resourceful. No prima donnas, no personal agendas, no politics – just a focus on doing great work.\n• In September, the Atlanta Business Chronicle rated GuildQuality among the Top 5 Best Places to Work in Atlanta.<p>Here&#x27;s a brief talk I gave about how we work at GuildQuality:\n<a href=\"http://geoffreygraham.com/2013/12/29/empowerment-trust-and-freedom-in-the-workplace/\" rel=\"nofollow\">http:&#x2F;&#x2F;geoffreygraham.com&#x2F;2013&#x2F;12&#x2F;29&#x2F;empowerment-trust-and-f...</a><p>If you think you might be a fit, we would like to speak with you. Email us at careers@guildquality.com, and include whatever details you think convey a good picture of who you are and what you’ve done. Thanks!","time":1392323445,"type":"comment"}