{"by":"BJanecke","id":11815811,"parent":11814828,"text":"Red Comet Labs | South Africa | Javascript Developer | REMOTE<p>HOW WE WORK<p>Project-based work for clients. The majority of our work involves working with clients to build excellent applications. Tools and technologies we use include: React.js, Redux, D3.js, CouchDB, PouchDB and Node.js.\nRemote work. We currently have developers in Joburg and Cape Town and we’re committed to remote work. Although we’d like to keep the team in South Africa for the meantime, there’s the potential for you to work from anywhere in the world.\nSmall team of smart developers. You’d be working with developers who are really making their mark in their area of specialisation. Because we’re a small team, you’ll be able to gain experience in the entire application development process – frontend and backend development, design, UX, devops, testing, project management – whatever you’re keen on.\nFlexible contracting&#x2F;employment structure. We realise everyone wants to work in a different way, so if you’re the right fit, we’re happy to structure a working relationship that suits both you and us, whether that’s full time employment, or a more flexible contracting arrangement.\nWe aim for a calm, organised working environment where work forms a part of a balanced life. If we’re working through the night or over weekends, then we’ve done something horribly wrong. This means we work hard during our working time, plan carefully and keep the focus on getting things done well.<p>HOW TO APPLY<p>Send an email to garren@redcometlabs.com in which you explain why you’d be suitable for this position. Please include:<p>A link to your GitHub profile\nA concise CV, edited to highlight how your skills would fit this role (no Matric marks required!)<p><a href=\"http:&#x2F;&#x2F;www.redcometlabs.com&#x2F;work-for-red-comet-labs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.redcometlabs.com&#x2F;work-for-red-comet-labs&#x2F;</a><p>[edit] formatting","time":1464798932,"type":"comment"}