{"by":"itwasntandy","id":11815583,"parent":11814828,"text":"Aetion | New York, NY | Systems Engineer (DevOps) | ONSITE | <a href=\"http:&#x2F;&#x2F;www.aetion.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.aetion.com</a> | <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;aetion&#x2F;jobs&#x2F;189540?t=6ngjm3#.V08G3GMtpmM\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;aetion&#x2F;jobs&#x2F;189540?t=6ngjm3#.V0...</a><p>Aetion provides a leading-edge analytics platform for rapid-cycle analytics of real-world healthcare data that our customers use to generate real-time evidence on the effectiveness, safety, and value of healthcare interventions. With this essential evidence in hand, our customers can make the smart, value-driven decisions needed to transform healthcare.<p>Aetion practices DevOps - where both systems and software engineers are involved in the day to day management and support of Aetion&#x27;s platform. The primary difference in the roles is one of focus - the systems team builds the infrastructure and tooling to support the platform, and the software team builds the Aetion application platform.<p>Our distributed platform is hosted both in AWS and also on customer premises. This poses some challenges and part of the role is helping with application design to ensure suitability for all environments.<p>We use Chef for automation to ensure that a small team of operational staff can easily handle our large and growing estate and use Docker for containerization to ensure consistency across deployment environments.<p>With health data in our platform, security is paramount. Whilst our platform uses de-identified data, we still target technical compliance with HIPAA regulations, as a basis for our security polices<p>More detail here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;aetion&#x2F;jobs&#x2F;189540?t=6ngjm3#.V08G3GMtpmM\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;aetion&#x2F;jobs&#x2F;189540?t=6ngjm3#.V0...</a>","time":1464797493,"type":"comment"}