{"by":"kbuchanan","id":11817248,"parent":11814828,"text":"Banzai Inc. - Provo, Utah | Full-time | Onsite<p>Position<p>Banzai is seeking a full-time, mid to senior level Graphic, Web or UX designer to assume the Lead Designer role.<p>About Banzai<p>For 10 years, Banzai has built premium, online financial literacy software for over 10,000 schools nationwide, at no cost. In turn, hundreds of community banks and credit unions sponsor Banzai’s software on behalf of the schools.<p>Tens of thousands of educators, and many hundreds of thousands of students, use Banzai in class, and at home, on desktop and mobile devices. Banzai has won national education awards and features prominently in many state educational departments’ recommended resources.<p>Qualifications<p>* Familiarity with professional design tools (e.g. Adobe Creative Suite, Sketch, etc.)<p>* Experience designing websites and apps: Banzai builds mobile and desktop applications, as well as the marketing sites to promote them.<p>* Experience building prototypes: The ability to produce likenesses of finished products, and test ideas before they are built. The closer a prototype comes to mimicking a real product (via HTML, CSS, or prototyping software like Principle, Invision, Framer, etc.) the better.<p>* Graphic design experience: An appreciation for the role of decoration and pleasing aesthetics in addition to building usable, intuitive products. The position will involve, at times, designing marketing collaterals.<p>* Love of solving design problems – a desire to make educational software better for students.<p>Benefits<p>* Competitive salary<p>* Full healthcare benefits (company pays 100% of premiums)<p>* Small team: enjoy significant autonomy and decision making<p>* 401(K) employer contributions<p>* Flexible vacations<p>* Life and disability insurance<p>* Cell phone and service<p>Apply and more details: <a href=\"http:&#x2F;&#x2F;jobs.teachbanzai.com&#x2F;jobs&#x2F;designer&#x2F;web&#x2F;ux&#x2F;graphic&#x2F;2016&#x2F;05&#x2F;28&#x2F;lead-designer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.teachbanzai.com&#x2F;jobs&#x2F;designer&#x2F;web&#x2F;ux&#x2F;graphic&#x2F;201...</a>","time":1464808053,"type":"comment"}