{"by":"mkong1","id":11818004,"parent":11814828,"text":"GiveCampus - www.givecampus.com | Washington, DC | Full-time | Onsite&#x2F;SF bay area<p>We are working to revolutionize the way that schools raise money and engage their constituents. Our mission is to ensure that schools have the resources they need to deliver the highest-quality education possible, and that education is affordable and accessible to everyone. We’re backed by some of the world’s top investors, including Y Combinator, and we’ve achieved 5X growth over the last six months. 2-3 new schools join our network every week, and we’re expanding our team to support their efforts and continue innovating. You can read more about what we do, and how we do it, in The Washington Post (<a href=\"https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;19&#x2F;colleges-are-going-online-to-crowdsource-donations-and-theyre-raising-millions&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.washingtonpost.com&#x2F;news&#x2F;grade-point&#x2F;wp&#x2F;2016&#x2F;04&#x2F;1...</a>).<p>We’re a small company, so we’re looking for people who are hungry and want to have a huge impact. Hustlers who are willing to learn new things and who demonstrate extraordinary resourcefulness--who don’t believe in “impossible.” Problem solvers who take initiative, challenge assumptions, and think outside the box. Team players who take responsibility and never blame others.<p>Who we are looking for:<p>- Ruby and Rails expert \n- Comfortable working on the front-end and back-end, but skews toward the back-end. \n- Enjoys building new features, from idea to supporting it in production \n- Passionate about education<p>We are a team of four, and are really excited to bring high tech to the education space.<p>Please email careers@@givecampus.com to apply.<p>We are based in Washington, DC, and are looking for people here, in the SF Bay Area, or someone willing to move to DC.","time":1464813948,"type":"comment"}