{"by":"makmanalp","id":11815253,"parent":11814828,"text":"Center for International Development at Harvard | UI &#x2F; UX designer &amp; Frontend Engineer | Cambridge, MA (Boston area)<p>---<p>You:<p>We&#x27;re looking for FULLTIME and ONSITE dataviz-oriented designers and frontend engineers. We&#x27;re specifically looking for designers and frontend engineers who have experience working on data and visualization heavy sites and projects, though the job isn&#x27;t <i>purely</i> dataviz.<p>We&#x27;re currently taking the summer &quot;off&quot; from client-based projects to focus on playing with some of our more pie-in-the-sky ideas and prototyping some of them! We would love for you to join us! If that sounds intriguing, please read on!<p>US:<p>At CID, we study why certain countries seem to stagnate and others seem to develop successfully. We believe that the differences in development between countries can be explained by differences and changes in knowhow and capabilities. Countries with a lot of knowhow tend to grow faster, and countries with knowhow in one area tend to develop in closely related industries first (just as we predicted!). We try to observe and study these concepts in real world data (such as international trade data), and ask related questions: Does this hold true at the within-country level? Can we observe knowhow developing in a location over time? Is it possible to grow a new capabilities and industries in a country out of nowhere? Is there a way to predict the next best investment for a country?<p>We work with governments to do research on their interesting datasets, we build tools to visualize and open up that data to policymakers and the public, and sometimes we provide them with actionable policy advice.<p>A recent example of a visualization tool we recently launched for the government of Colombia: <a href=\"http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col\" rel=\"nofollow\">http:&#x2F;&#x2F;www.datlascolombia.com&#x2F;#&#x2F;?locale=en-col</a>\nIt&#x27;s also all open source on github here: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;cid-harvard&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;cid-harvard&#x2F;</a><p>For more details on the positions, please see these SO posts:\n<a href=\"http:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;116754&#x2F;ui-ux-and-visualization-designer-growth-lab-center-for-international\" rel=\"nofollow\">http:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;116754&#x2F;ui-ux-and-visualization...</a>\n<a href=\"http:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;116574&#x2F;front-end-web-developer-center-for-international\" rel=\"nofollow\">http:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;116574&#x2F;front-end-web-developer...</a><p>Interview Process:<p>Our interview process starts with a short, casual phone screen to make sure we&#x27;re on the same page. Then we delve into a longer interview (in person or skype, etc) that changes based on your specialty, but usually involves some sort of short basic skills test, a more &quot;soft&quot; portion that involves going over your work experience and a show and tell session that involves you describing in depth a major project you worked on (requirements, motivations, thought processes, tools, demo and code samples if possible, technical decisions, difficulties etc!).<p>Please send a resume, short blurb on why we might be a good match, and work that you&#x27;re proud of to: andrea underscore hayes at hks dot harvard dot edu - and it is helpful if you mention that you came through this post.<p>Thank you!<p>~Mali (email in profile if you want to contact directly)","time":1464795542,"type":"comment"}