{"by":"fsargent","dead":true,"id":11815395,"parent":11814828,"text":"Senior Backend Engineer (Scala) at SeamlessDocs - full time, onsite in SoHo, New York, NY<p>SeamlessDocs specializes in digitizing and automating business and government forms and PDFs.  The platform is like Google Docs for PDFs.  It allows anyone to easily convert any PDF into a fillable, mobile friendly cloud version that can be completed and eSigned from any device.  Then it builds a database in real time of the info collected and has workflow and process automation tools.<p>Due to its government focus, SeamlessDocs has been able to continue to differentiate itself as THE standard in government forms as well as through its government sales funnel expertise.  This allows them to avoid repetitive admin tasks and data entry; cutting costs and increasing efficiency.<p>--<p>Our ideal candidate has strong experience with Scala and writing stable, scalable backend services. Bonus points for experience with additional backend languages such as OCaml, Haskell, Go, C++ (with preference towards functional languages). Candidate should also have experience leading a team of engineers.<p>. You are actively engaged in software development communities, Open Source projects or projects of your own; where coding in collaboration with other engineers is a necessity. The principles of Agile development, coding standards, unit testing, documentation and communication are second nature. You’ll be successful at SeamlessDocs if you are able to look at existing code, which isn’t always pretty, and say – I love a challenge and I know how to turn that into something beautiful. You follow design patterns that lead others to more elegant solutions.<p>Responsibilities<p>•\tDevelop efficient web services and APIs. \n•\tParticipate in daily code deploys while working on individual or team projects. \n•\tTake ideas and concepts from the business and turn them into tangible components of the site. \n•\tParticipate in thorough code reviews with a goal of illustrating quality engineering practices and to produce the highest quality code possible.<p>Skills &#x2F; Experience​<p>• Strong software engineering fundamentals. Interested in Scala not because it&#x27;s the &#x27;hot new thing&#x27; but because its type safety and functional nature enables stable growth and beautiful code. \n•\tExperience using PostgresSQL \n•\tExperience working with large data sets (data mining, data analytics, data manipulation and reporting) \n•\tKnowledge&#x2F;experience with Agile software methodology \n•\tExperience working with a production environment with zero or very minimal downtime<p>www.seamlessdocs.com&#x2F;jobs\nFeel free to reach out to me at felix@seamlessdocs.com","time":1464796339,"type":"comment"}