{"by":"rdl","id":11815452,"parent":11814828,"text":"CloudFlare <a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;</a> | San Francisco, CA; London, UK; Singapore, SG; Urbana-Champaign, IL; Austin, TX | VISA, ONSITE<p>CloudFlare is building a better Internet -- performance and security optimization at the edge. Our long term goal is to give every site the same performance, security, and reliability that major sites like Google and Facebook accomplish, without any specialized network hardware or complicated administration. We enhance millions of sites, including this one. We&#x27;re hiring for a variety of roles -- started 2015 at 128, ended around 220, doubling again in 2016.<p>This is a perfect time to join -- product market fit is established, but there&#x27;s a lot of great engineering, product, sales, and support work to be done.<p>We&#x27;ve publicly said we&#x27;re profitable and on track for long term independent success. You may wish to check out our blog to see the kinds of engineering work we do. (<a href=\"https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.cloudflare.com&#x2F;</a>).<p><a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> has a listing of positions.<p>We&#x27;re always hiring for operations&#x2F;SRE, sales, general systems engineering (mostly in Go, nginx, and network, as well as DNS at scale), and web development.<p>Specific roles we&#x27;re keen to hire include:<p>0) Great operations&#x2F;SRE staff: operating our system at scale (80+ datacenters around the world, 24x7 coverage, &gt;4 million sites) requires highly competent, hard-working, and communicative engineers.<p>1) Product designer(s) -- we&#x27;re looking for great talent to help build UX for new products, and to improve the interface and user experience of our existing products. We have a range of customers, from consumers with a single blog all the way through some of the largest sites on the Internet, and designing interfaces which work well for all of these users is a big challenge -- are you up to it?<p>2) Great front-end engineers -- building new UI&#x2F;UX to expose controls and data to customers is an increasing portion of what we do. Our current front-end stack is Backbone + Marionette with Browserify and Sass. Our new projects are using React + Redux + Babel + css-modules, and generally adopting Higher Order Components. We&#x27;re also starting the process of re-imagining our main WWW Front-end stack with a migration to Redux.<p>3) Systems Engineer -- looking for people to help serve even more traffic, build infrastructure for security and robustness, and contribute back to open source projects. We make extensive use of nginx, lua&#x2F;luajit, and ssl-at-scale.<p>4) Really interested in people who want to help fix problems for Internet publishers (articulate what those are and how you think you could help)\n(Also -- We&#x27;re particularly interested in people with Mandarin experience; we have a joint venture with Baidu, and want to make the experience for both Chinese Internet users and Chinese sites abroad as great as it can be.)\nThe interview process is a phone screen with a recruiter, then one or two technical interviews by phone, then a full day of onsite interviews. We are trying to shorten the period between interviews (it has dragged on due to very busy hiring managers, in the past), so please ping the internal recruiter at any time if you feel things have stalled. Generally we get an answer back to candidates within a week of the on site interview.<p>If you&#x27;re interested, please apply through the\n<a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> link","time":1464796613,"type":"comment"}