{"by":"sourishkrout","id":11818647,"parent":11814828,"text":"Sauce Labs | Senior Eng, REST API | San Francisco, CA or Vancouver, BC | full-time, ideally on-site but open to remote<p>Sauce Labs, a successful and rapidly growing startup building high availability software testing tools for developers and enterprises, is looking for passionate Senior Software Engineers to add to its API team.<p>The Role:\nWork on a cross-functional project team and participate in shaping the technical direction to deliver high fast and high availability APIs for consumption by our own services and customers.\nParticipate in the entire development lifecycle, from planning through implementation, documentation, testing, and deployment, all the way to monitoring.\nProduce high quality, maintainable code with great test coverage.\nMake intelligent choices for the adoption of new technologies based on your extensive experience.\nEnable massive scalability of our API while ensuring no negative consequences on our upstream data sources and perfect user experience on the customer side, including graceful degradation of data consumption.\nProtect our systems and our data from exploits, DDOS attacks, or other security loopholes.<p>You:\n6+ years of software development experience, with significant time spent in backend web API development.\nSolid understanding of the underlying technologies that power fast, safe, and rich web experiences, from HTTP to SSL to WebSockets, and especially API principles like rate limiting, caching, streaming, etc...\nDemonstrated focus on testing and performance.\nDeep knowledge of modern Python and asynchronous programming paradigms.\nPassion for engineering great products with stellar user experiences.\nIntimate involvement with developer communities and open source web technologies from servers to front-end frameworks.<p>Please apply at: <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;&#x2F;CompanyJobs&#x2F;Careers.aspx?k=Apply&amp;c=qDz9Vfw0&amp;j=ouwM2fwy\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;&#x2F;CompanyJobs&#x2F;Careers.aspx?k=Apply&amp;c=...</a><p>In case you&#x27;re curious more positions open at <a href=\"https:&#x2F;&#x2F;saucelabs.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;saucelabs.com&#x2F;careers</a>","time":1464819078,"type":"comment"}