{"by":"davereg","id":11816457,"parent":11814828,"text":"Shady Hill Studios | Full Stack Laravel&#x2F;PHP Developer | Medford, MA (Boston Area), Austin, TX | Full Time (min. 6 month contract) | REMOTE<p>Looking for a full-time contractor to work on a 6 month project. The client is a spinoff of an established company looking to create an innovative web application in the travel technology space. We are assembling a small, multi-disciplinary team to build the beta version of the application.<p>The application will involve a healthy mix of technologies. The backend is being built with Laravel 5 and a PostgreSQL database. The system will rely on data from various sources including third party APIs, user generated content, and an internal dataset. The fronted is being built with Backbone and will have interactive features including real time chat and live updates via web sockets.<p>As a full stack developer, this position will help lead the design and implementation of the backend code base. This will include design patterns for the internal data relations, fetching and caching third party resources, and implementing a service layer for the fronted code base. As part of a small team, a willingness to experiment with new technologies and methods as well as contribute to other parts of the stack will be critical for success.<p>Required Skills:\n\t3-5 Years of PHP Development\n\t2+ Years of Laravel Experience\t\n\tWorking Knowledge with PostgresSQL or MySQL\n\t\t- Familiarity with ORM based queries\n\t\t- Comfort writing customer queries\n\tExperience using git in a team setting\n\tWorking knowledge of javascript\n\tAbility to self-direct\n\tStrong communication \n\tUnderstanding of RESTful fundamentals<p>Preferred Skills:\n\tStrong foundation in HTML5\n\tWorking knowledge of jQuery, Underscore and&#x2F;or Backbone\n\tExposure to web sockets\n\tComfortable with Linux Server Environments<p>Candidate should be located in or able to work in North American timezones. A weekly workshop&#x2F;status meeting will be expected during initial phases of development (compensated).<p>Our interview process typically consists of one to two virtual interviews (Hangout&#x2F;Skype)<p>Contact me at david@shadyhillstudios.com","time":1464802765,"type":"comment"}