{"by":"itsdevlin","id":11818735,"parent":11814828,"text":"Constructor.io | San Francisco, CA | Onsite | Full-Time<p>Constructor.io is building the future of search. There are many parts of a search interface — from autocomplete to analytics to recommendations — that every website currently has to rebuild (often poorly) from scratch. At Constructor.io, we want to change all that, let people stop re-inventing the wheel, and offer them outstanding search and search enhancement features in a form that&#x27;s dead simple to integrate.<p>Offering that simplicity is challenging. We have to hide bleeding-edge NLP and machine learning behind an easy-to-use interface. And to do that, we need clever engineers with a mind for turning complex algorithms into delightful user interfaces.<p>We’re looking to add a few members to the team as soon as we can find the right person. Key needs are:<p>- Senior Javascript &amp; Rails Engineer\n-- Deliver the next generation of search enhancement services to our customers. You&#x27;ll build new features into our Javascript client and help develop our customer-facing website in Rails.<p>- Senior Full Stack Engineer\n-- Develop outstanding back-end performance to power intuitive user interfaces. You&#x27;ll be building front-end search features and configuring search engines to deliver lightning-fast performance.<p>- Data Scientist &#x2F; Engineer\n-- Build search and discovery features using massive amounts of click data. Your goal will be to help make our customers&#x27; websites awesome and bring our customers more revenue. You&#x27;ll develop algorithms to improve search efficiency, deliver recommendations, and power self-learning search results.<p>If you&#x27;re interested in joining the team, please send your resume and&#x2F;or LinkedIn and&#x2F;or Github profile, ideally including links to source code of projects you’ve worked on, to jobs@constructor.io and we’ll do our best to reply within a few business days. We’ll usually start with a technical interview over the phone or via video chat, followed by an in-person interview at our offices.","time":1464819880,"type":"comment"}