{"by":"lachenmayer","id":11815972,"kids":[11818685],"parent":11814828,"text":"Boiler Room | London | Web Developer (full-stack) | full time, ONSITE<p><pre><code>        =  =\n     =        =\n    =  BOILER  =\n    =   ROOM   =\n     =        =\n        =  =\n</code></pre>\n# Description<p>Boiler Room is the world’s leading community of underground music fans. We live-stream DJ sets and live gigs from music hubs such as London, Berlin, New York, Paris, LA and &gt;60 other cities to music lovers all over the world. It started as a webcam taped to a warehouse wall in East London - in five years Boiler Room has grown to become the online home of underground music, and also a complex broadcasting and editorial platform in its own right.<p>You’ll be an essential part of our product team currently consisting of 3 developers and 2 designers. You should have strong opinions about how web development should be done in 2016, and you should be able to come up with and implement new ideas for consuming &amp; sharing online music experiences. Going forward, we have some really exciting ideas around peer-to-peer audio and video streaming - interest and&#x2F;or expertise in that area would definitely be a strong plus.<p>You&#x27;ll be working in our river-side office in Wapping, East London, and you’ll of course be able to go to and invite your friends to the exclusive parties being live-streamed on the site.<p># Stack&#x2F;Keywords<p>React, Redux, ImmutableJS, CSS Modules, WordPress, Docker microservices, RethinkDB<p># Technical requirements<p>- Strong understanding of modern JavaScript (ES6&#x2F;7)<p>- Up-to-date knowledge of current &amp; upcoming web technologies, especially relating to streaming audio &amp; video content<p>- Working understanding of &#x2F; willingness to learn PHP &amp; WordPress<p># Nice to have<p>- Interest in functional &amp; functional reactive programming concepts (eg. Elm, Haskell)<p>- Familiarity with Event Sourcing &#x2F; CQRS concepts<p>- Passion for underground music culture<p># Get in touch!<p>Email me at harry.l+hn@boilerroom.tv with links to your GitHub and&#x2F;or your CV :)","time":1464799827,"type":"comment"}