{"by":"tamerito","id":11817695,"parent":11814828,"text":"Nickelodeon Games - Game Engineer | Full Time | LA or NYC<p>Nickelodeon Games is looking for a talented, self-motivated, and innovative individual with a passion for gaming and technology.  We are currently seeking a Game Engineer to work on existing and future gaming projects. Deep understanding and knowledge of game development fundamentals and sharp programming skills are required.<p>Overview and Responsibilities\n  - Design and implement game features and components\n  - Research and investigate new technologies and how they can be used for our games\n  - Quickly iterate through different proof of concepts and prototypes\n  - Participate in game performance optimizations (rendering, loading, memory usage, and file size optimizations, etc.)\n  - Troubleshoot and solve critical issues on game projects\n  - Effectively communicate project status to extended games team\n  - Write tools to automate reoccurring tasks during the project life cycle\n  - Write high quality code and unit tests and conduct regular cross-team code reviews<p>Basic Qualifications\n  - Solid foundation in data structures, algorithms, and object-oriented programming\n  - Experience working with game engines and frameworks (Unity, Unreal, Sprite Kit, libGDX, etc.)\n  - Proven capability in problem solving and ability to come up with innovative solutions\n  - Experience with profiling, along with performance optimization (memory leaks, performance analysis, etc.)\n  - Ability to work with a cross-functional team including artists, designers, QA, etc.\n  - Excellent written and verbal communications skills<p>Additional Qualifications\n  - Experience developing native applications on iOS and&#x2F;or Android\n  - OpenGL, OpenAL, Box2D, and Shader programming\n  - Network protocols and patterns (HTTP, REST), programming and debugging\n  - BS degree in Computer Science or equivalent work experience<p>tamer[dot]eskander[a_t]nick[dot]com","time":1464811555,"type":"comment"}