{"by":"browseatwork","id":11817543,"kids":[11818807],"parent":11814828,"text":"San Francisco&#x2F; London&#x2F; Barcelona&#x2F; Madrid&#x2F; Sydney | TokBox | Product Managers for 1) Developer Experience and 2) Vertical Solutions, Product Marketing Manager, BizDev Managers in 1) Healthcare and 2) Education | 98% Onsite and mostly in San Francisco, remote for the right fit<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;</a><p>TokBox does embedded communications powered by WebRTC. We make it easy for developers to embed real-time video, voice, and more into their applications and websites. We build a platform and SDKs, and have great clients from individual developers to massive players in tech, entertainment, education, and many other industries (customers include Mozilla, the Minerva Project, Chegg, esurance, Major League Baseball, Double Robotics, and Fox Sports). We&#x27;ve been doing real-time communications for over 8 years. We were acquired by Telefonica 3 or so years ago. It hasn&#x27;t changed the culture much, and has helped us reach more customers around the world.<p>The product is industry leading, but the people make this place where I work. It&#x27;s an awesome group of 90 or so people- nice, smart, skilled. We are laid back and have a sense of humor. Minimal politics. Good salary and benefits, relaxed, enjoyable environment!<p>We&#x27;re looking for a PMs who want to build a strong developer experience (PMs, evangelists, and engineers encouraged to apply!), a PM to manage the platform, someone with product and&#x2F;or marketing experience to do product marketing, as well as people with strong experience in either healthcare or education for business development.<p><a href=\"https:&#x2F;&#x2F;tokbox.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;tokbox.com&#x2F;careers</a><p>or<p><a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZMiQhwF</a><p>Come join us!","time":1464810404,"type":"comment"}