{"by":"jocatalin","id":11817282,"kids":[11817809,11817324],"parent":11814828,"text":"Container Solutions | <a href=\"https:&#x2F;&#x2F;container-solutions.com\" rel=\"nofollow\">https:&#x2F;&#x2F;container-solutions.com</a> | Amsterdam, London, Zurich, REMOTE<p>We are looking for engineers who want to join a supportive, relaxed and experimental environment where they can express their skills. Container Solutions is a premium software consultancy &amp; research company that focuses on programmable infrastructure. We encourage entrepreneurial people; in the last year several projects that started in Container Solutions grew as independent companies.<p>We are looking currently for:<p>Systems Developers - Implement immutable infrastructure architecture &amp; write code for leading open source projects: Hashicorp tools, Mesos (frameworks), K8s and own projects.<p>Application Developers - Write applications for drones, e-commerce, big data and data science as well as for IoT devices<p>Support Engineers - Provide support for the systems we have built and installed. These systems include DC&#x2F;OS, Mesos and K8s.<p>UI&#x2F;UX Developers - Create beautiful and usable interfaces and are especially interested in building GUIs for distributed systems. Should have an affinity with design thinking and from the beginning, are expected to lead ideation sessions.<p>All our engineers are expected to share their knowledge at conferences and within the company. Switching between projects&#x2F;roles is common, people can choose the project they’re most interested in.<p>We’re active in the open-source area (mainly where we have offices) via: meetups (Docker, Hashiconf, Software Circus), conferences (our own conference in Amsterdam: <a href=\"https:&#x2F;&#x2F;www.software-circus.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.software-circus.io</a> ), workshops, code (Minimesos: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;ContainerSolutions&#x2F;minimesos\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;ContainerSolutions&#x2F;minimesos</a>  ), books (Using Docker: <a href=\"http:&#x2F;&#x2F;shop.oreilly.com&#x2F;product&#x2F;0636920035671.do\" rel=\"nofollow\">http:&#x2F;&#x2F;shop.oreilly.com&#x2F;product&#x2F;0636920035671.do</a> )<p>Ask me anything you wanna know and check our career page: <a href=\"http:&#x2F;&#x2F;container-solutions.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;container-solutions.com&#x2F;careers&#x2F;</a> Read about culture here: <a href=\"http:&#x2F;&#x2F;container-solutions.com&#x2F;space-beyond-culture&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;container-solutions.com&#x2F;space-beyond-culture&#x2F;</a>","time":1464808332,"type":"comment"}