{"by":"coroutines","dead":true,"id":11818197,"kids":[11818512],"parent":11814828,"text":"Location: Oakland, California (neighboring San Francisco across the bay..)<p>Relocation?: Yes (with assistance) - San Francisco, San Diego, Sacramento, Seattle, Portland, Chicago, New York City<p>Resume&#x2F;CV:<p>Word: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;open?id=0B-KnHM7a2EJ8SGJxSzIyd1FVUVE\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;open?id=0B-KnHM7a2EJ8SGJxSzIyd1FVUV...</a><p>PDF: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;open?id=0B-KnHM7a2EJ8enB3ZVRXcFl1eTQ\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;open?id=0B-KnHM7a2EJ8enB3ZVRXcFl1eT...</a><p>Email: coroutines@gmail.com<p>Github: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;blitmap\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;blitmap</a><p>Languages Used Daily: Coffeescript, ES6&#x2F;ES7 Javascript, Lua, C<p>Infrequent Languages: Python, Ruby, Moonscript, Perl, PHP, C++<p>Looking For: remote Coffeescript (backend&#x2F;frontend) work - or QA Testing and Technical Customer Support &#x2F; TSE<p>Hi,<p>I&#x27;m Jonathon -<p>I&#x27;m looking for anything and everything Coffeescript. It is the language I enjoy most and I want to work with it everyday doing something I can be passionate about! I&#x27;m looking for my first real programming gig after 5 years of sysadmin work - I would welcome any opportunity to prove my worth (bring on your coding exercises and take-home projects!). I have a background working with the IRC protocol, low-level networking, and preparing documentation for projects mostly. I love writing integrations for Slack and gaining experience on the frontend side of things. Bots and building APIs are a particular curiosity. :-)<p>I think I can do my best work if I have a personal interest in the mission of the company I might join. I am of course a gamer so I would be thrilled to work for Twitch or Steam, but I also have an interest in doing some good for the public. I have an interest in companies like Watsi, the No-Starch Press, and Clever. I actually work as a reservist for FEMA because I want to help the world somehow.  If you&#x27;re a humanitarian project, an educational institution, or are working to improve access to taxpayer-funded government data (open gov): I would love to hear from you!<p>I look forward to seeing what you do! - thank you for your time :-)","time":1464815586,"type":"comment"}