{"by":"bobzoller","id":11816620,"parent":11814828,"text":"Various | <a href=\"https:&#x2F;&#x2F;www.goodeggs.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.goodeggs.com&#x2F;</a> | San Francisco | Full-time<p>Good groceries, delivered.<p>Good Eggs lets folks like you shop local, organic produce, meat and fish, and delicious staples for next-day delivery in the San Francisco Bay Area.  We&#x27;ve built an entirely new supply chain that is changing the way folks feel connected to the groceries they buy every week.<p>Apply online: <a href=\"http:&#x2F;&#x2F;careers.goodeggs.com&#x2F;open-positions&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.goodeggs.com&#x2F;open-positions&#x2F;</a><p># Why Good Eggs?<p>We&#x27;re a mission-driven Certified B Corp, earnestly working to funnel more of the $50B US grocery spend into sustainable, local food producers. Our office is very unique: 50k sqft warehouse with another 10k of (quieter) office space. No ivory towers here -- we&#x27;re all in this together. We have chefs on staff that cook amazing lunches we all enjoy family-style every day. Continuous improvement is baked into the company DNA, and can be seen just as well on the warehouse floor as in the engineering teams. Our interview process is short and transparent: a phone screen, a technical phone interview, and an onsite. The whole process could take &lt; 1 week. Low stress, very collaborative and conversational, not algorithms at a whiteboard.<p># Senior DevOps Engineer | Onsite or Remote<p>The Delivery Engineering team supports the culture of DevOps at Good Eggs. We build shared tools and services that enable every team to deploy, monitor, and maintain their own production environments. The work we do helps our peers move faster, deliver more, and break less. We&#x27;re software engineers with a soft spot for operations, automation, and the libraries that help us build applications.<p>You&#x27;ll report to me, and have ground-floor influence over technical decisions and roadmap. This is a senior role -- you should be a strong software engineer and have &gt; 5 years of relevant experience to draw from. We&#x27;re currently building a bespoke PaaS using the latest tech like Docker, Amazon ECS, Kubernetes, CoreOS, etc. Our philosophy is open source by default, and we&#x27;re coding mostly in Node and Go.<p># Senior Software Engineer | Onsite<p>If you are a full-stack web developer or have significant experience building e-commerce and logistics systems and want to apply your talents to building a better food system, we’d love to hear from you.<p>We run a mature Agile engineering process complete with test-driven development, pair programming and continuous deployment of features throughout the day. We’re building next-generation web and mobile applications with JavaScript across the stack, including Node, Mongo, React, Angular, and a wealth of other tools from the rapidly-evolving JavaScript ecosystem. We are happy to train the right person to work in this environment.<p># Principal Software Engineer | Onsite<p>We&#x27;re looking for engineers who are interested in a multidisciplinary engineering environment, and who are excited by building high-scale software that interfaces with every aspect of Good Eggs, including website ordering, operations, and customer service. Our team is a great opportunity to widen your perspective of what it takes to make a large just-in-time commerce and logistics company tick.<p>We run a mature Agile engineering process complete with test-driven development, pair programming and continuous deployment of features throughout the day. Our core platform is built on Node, Mongo, React, and Angular. We&#x27;re in the process of expanding into new domains, including iOS application development and software that runs on embedded devices in our hub (IoT), and are looking for senior engineers who can help build our architecture, mentor junior teams, and grow our teams.<p>[edit styling]","time":1464803630,"type":"comment"}