{"by":"arunmib","id":11820652,"parent":11814828,"text":"RideCell(YC W12) - Android Engineer - San Francisco, CA<p>RideCell is reimagining and re-architecting transportation in cities, communities, and on campuses across the world. Our software platform automates some of the hardest operational tasks involved in running a transportation system such as matching supply to dynamic demand, efficient dispatch and routing, and combining multiple service models such as on-demand, fixed-route, car-sharing, and beyond.<p>We are a small team with big personalities and big goals!<p>Learn more at <a href=\"http:&#x2F;&#x2F;ridecell.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ridecell.com</a><p>About You:<p><pre><code>    * B.S. or M.S. Computer Science or related experience\n\n    * 3+ years of object-oriented software development experience\n\n    * 2+ years mobile application development at the user interface and system levels\n\n    * Proficient knowledge of the android SDK\n\n    * Gradle build system expert &amp; ability to maintain multi flavor project\n\n    * Proficiency with Google API&#x27;s (maps, places, gcm most important)\n\n    * Knowledge of RESTful implementation in android and communicating with backend API&#x27;s\n\n    * Proficiency with android lifecycle events in activities and fragments\n\n    * At least 1 application in the Play Store\n\n    * Must be willing to work on-site in our San Francisco office\n</code></pre>\nGreat to Have:<p><pre><code>    * Knowledge with 3rd party injection libs (android annotations, butterknife, dagger etc...)\n\n    * Knowledge of android development patterns, preferebly MVP or MVVP\n\n    * Knowledge of websockets\n\n    * Other languages to know (python, js, cocoa, swift, c++)\n</code></pre>\nNext Steps:\nTo get started, apply at <a href=\"http:&#x2F;&#x2F;ridecell.com&#x2F;careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;ridecell.com&#x2F;careers.html</a> or email us at jobs@ridecell.com with your resume. If you can include a link to your GitHub &#x2F; code samples and&#x2F;or links to any deployed software you&#x27;ve worked on, we&#x27;ll prioritize the conversation.","time":1464847432,"type":"comment"}