{"by":"shutty","id":11836503,"kids":[11840267],"parent":11814828,"text":"Findify | EU, Remote | full-time<p>We are looking for a junior to mid-level Frontend developer to join our stellar engineering team and help us bring our offering to the next level. Findify is an intelligent, on-site search engine for online stores, and we’re making search smarter. We are using machine learning and big data to provide accurate &amp; relevant search results. By improving product findability, end-consumers can find what they’re looking for, and we can help online merchants increase their revenue between 10-30%.\nOur engineering environment<p>What we’re looking for:\nThe most important thing we are looking for in a candidate is proven passion for programming and problem solving: a Github&#x2F;Stackoverflow account, an interesting project you can share, or a blog you write will go a long way.\nWe are a distributed team, so you can work from anywhere you want, as long as it’s 2 hours +&#x2F;- from GMT+2. (The timezone is an important requirement for us at this stage)\nIt’s really important to us that you have the ability to adapt to the company’s work processes using the agile-scrum methodology, and using tools such as Trello and Slack. Not only because of our remote working culture, but even more so because of this, you need to be really awesome at communicating, and to be organized and self-driven.\nOh, and you need to want to have fun.<p>The basics:\n– HTML5, CSS3\n– SASS or LESS\n– Experience with responsive design\n– Angular.js, React.js\n– Git\n– Good eye for design<p>Beyond the basics (what would really impress us):\n– Understand the difference between two-way and one-way UI data binding\n– Understand commonJS modules and&#x2F;or ES6 modules\n– Understand passing by value&#x2F;reference in JS\n– Experience with Typescript<p>To apply for this position\nIf you’re interested in joining our team, and you have the skills, please get in touch with your CV and work samples! Also, be sure to give us an idea of what kind of person you are in addition to your skills, because cultural fit is as important to us as your front end development abilities!\nJoinUs+Frontend@findify.io","time":1465051629,"type":"comment"}