{"by":"aseemk","id":4463961,"parent":4463689,"text":"New York, NY - {Backend || DevOps} Engineers - Node.js, Neo4j, Heroku, EC2<p>---- About us ----<p>Hello, we are FiftyThree (<a href=\"http://www.fiftythree.com/\" rel=\"nofollow\">http://www.fiftythree.com/</a>). We're the company behind Paper, an iPad app for freeform writing/sketching/drawing.<p>Paper has done well: among other things, it won this year's Apple Design Award for iPad, it's had nearly 3 million downloads, and it's used and loved by creatives at top-notch companies everywhere, including Apple, Nike, Pixar, and more.<p>But Paper is just the beginning for us. Our goal is to bring creation tools into the post-PC era, and we think there's a huge opportunity there. Mobile and tablets are changing everything.<p>We like to say that Paper is “where ideas begin”; we're now building a service to “bring ideas together”. Think something like a GitHub for ideas and creations. We have a great team of developers and designers spanning iOS and web, but we’re looking for 2-3 more developers to join us. That’s where we hope you’ll come in.<p>---- About you ----<p>We're looking for great backend or devops engineers to help us build this service. The role is flexible depending on your prior experience, passion, and expertise.<p>E.g. perhaps you love algorithms and performance engineering. Great — let's design an efficient activity feed for our users. (It's a fun graph problem.)<p>E.g. or perhaps you love devops and infrastructure. Perfect — help us setup a high-availability database cluster with master-slave replication.<p>E.g. or perhaps you love data and metrics. Right on — help us get great instrumentation and analytics in place so we can monitor early and monitor often.<p>Whatever your specifics, you'll work across a diverse set of tools. We currently use Node.js (and we write primarily CoffeeScript) with Neo4j (a graph database). We deploy on a mix of Heroku and Amazon EC2. And we use GitHub and Trello to keep track of it all.<p>You don't need prior experience with any of these directly, but you should have some history of building or scaling websites or services like ours. Even better if you can show depth and passion somewhere. Of course, strong engineering skills and an ability to learn quickly are a must.<p>You'll be just our second backend engineer, so you'll help set the tone for culture, process, and workflow. And if we succeed, you'll certainly help shape the company's future and direction, as well.<p>---- Sound good? ----<p>If this sounds interesting to you and you think you fit the bill, drop us a line at mailto:jobs@fiftythree.com. We look forward to hearing from you.<p>You can also learn more through our more general jobs page: <a href=\"http://www.fiftythree.com/jobs\" rel=\"nofollow\">http://www.fiftythree.com/jobs</a>","time":1346513218,"type":"comment"}