{"by":"ila","id":4463706,"kids":[4464823],"parent":4463689,"text":"Madrid, Spain<p>Back End Developer / Full time<p>-----<p>Guildda wants to empower companies and individuals to transact in a new way, by disrupting an archaic industry. As Guildda’s Back End Engineer you will be responsible for delivering an amazing, secure, stable, fast experience to our users.<p><i>==Attributes of successful candidates will include==</i><p>- You are a full-stack developer<p>- Understands the entire LAMP stack and can contribute to any part of it<p>- Expert knowledge of server-side languages Python, Ruby, Java or C/C++<p>- Excellent knowledge of RDBMS systems; ideally MySQL<p>- Security obsessed<p>- Love your version control (Git)<p>- Likes getting hands dirty with 3rd party APIs<p>- Enjoys prototyping and iterating stuff<p>- BS or MS degree in Computer Science or a related technical field Back End Engineer<p>- Accountability, honesty, responsibility, flexibility… and a sense of fun and playfulness<p><i>==Responsibilities of the position will include==</i><p>- Build from scratch the entire technology architecture<p>- Be efficient writing code: less is more<p>- Design and implement Guildda’s core service<p>- Build a fault tolerant platform<p>- Work with frontend engineers to plan and implement new ideas and features<p>- Find and fix performance and reliability issues<p>You should aim to make working on Guildda just as fun and simple as using it. Few things make you happier than disrupting industries with as few lines of code as possible.<p><i>==What we offer==</i><p>- Pick your own gear (Mac/PC, OS, editor, etc.)<p>- Flat organisational structure and no bs<p>- Competitive salary + bonus<p><i>==Want to apply?==</i><p>To apply, please send an email with your resume (all in PDF, no LinkedIn URLs please) to the following address jobs@guildda.com with the job’s title as the subject line. Bonus points if you included a link to your Github repository and/or web applications.","time":1346508468,"type":"comment"}