{"by":"2arrs2ells","id":4464749,"parent":4463689,"text":"Clever (YC S12) is hiring a full-stack engineer in San Francisco to hack education<p>Steve Jobs described education as one of the final frontiers still untouched by modern technology. Clever (<a href=\"https://getclever.com\" rel=\"nofollow\">https://getclever.com</a>) is building the data platform needed to for great software to make its way into the classroom. Just like Stripe has made it simple for developers to build payment processing into their apps, Clever has made it easy for developers to build applications for schools using student data.<p>We're a small team of highly technical hackers with deep experience in education. Since releasing the Clever APIs in June, we've signed up the most innovative education companies as partners and deployed our platform to over 1,000 schools. Clever moves data for over 350,000 students every day, and that number is growing rapidly.<p>Our growth has created some exciting problems around scalable systems, innovative APIs, and big data sets. We're looking to add a versitile engineer to the team to take on a wide range of technical challenges.<p>Things we're looking for:<p>+ Experience with consuming and/or creating RESTful Hypermedia APIs<p>+ Experience with a variety of languages (we use the best tool for the job, everything from Node.js to bash scripts)<p>+ Experience scaling up systems on AWS<p>+ Passion for changing education<p>What Clever offers:<p>+ Competitive salary + significant equity stake in well-funded company<p>+ A chance to revolutionize education<p>+ Flat &#38; close-knit engineering team with lots of peer code review &#38; pair programming<p>+ Great benefits - healthcare, dental, beautiful office<p>To apply, email us at jobs+n@getclever.com, where n is the number of students in the Clever sandbox API data set with a last name that begins with the letter 'V'.<p>Send us one or more things from [resume, github profile, recent side projects, linkedin URL, Stack Overflow profile, etc], and let us know how you solved our 'puzzle.'<p>This job is located in San Francisco, CA. You must be local or willing to relocate.","time":1346526590,"type":"comment"}