{"by":"seldo","id":4464226,"kids":[4465559,4464809,4464488],"parent":4463689,"text":"San Francisco, CA. Full time. H1B okay.<p>50% of traffic is now driven by social media, and referrer information is increasingly useless with mobile clients and HTTPS. Traditional web analytics doesn't work for social traffic. So awe.sm is building full-featured social media conversion tracking and analytics.<p>Right now and in the medium term, we're providing immediate value to our customers by giving them firm numbers on the ROI of their social media efforts, in terms of dollars, signups, pageviews or any other metric they pick. Our APIs allow app developers to easily integrate social features into their products and easily present the analyzed data back to their own customers, without having to build their own processing clusters and workflows.\nLonger term, we want to know what's important on the Internet, and we believe that instrumenting social behavior is the way to do that.<p>We're looking for back-end engineers who are interested in learning how to handle large volumes of data for aggregation, geo analysis, and graph analysis, in close to real time. We're currently in transition from a mixed stack of PHP and Ruby to JVM languages -- we believe in simple parts loosely coupled, and also in picking the right tool for the job, so you genuinely have the power to shape the stack you work on.<p>We're also looking for front-end developers to continue to build out our GUI, which is a backbone JS app built on top of the same APIs our customers use.<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 13 people right now. We have a cool new office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1346517483,"type":"comment"}