{"by":"dchudz","id":4464726,"parent":4463689,"text":"Kaggle\nSan Francisco\nDeveloper<p><a href=\"http://kaggle.theresumator.com/apply/3s1xdU/Developer.html?source=HN\" rel=\"nofollow\">http://kaggle.theresumator.com/apply/3s1xdU/Developer.html?s...</a><p>As a Kaggle developer, you'll be building the platform that helps solve many of the most valuable problems in data science. You'll guide the development of tools that automate the process of setting up a competition, verifying winning models, and integrating those models into our customers' operations. The tools you will develop go the heart of Kaggle's mission and technology offering.<p>On a typical day, you will:<p>* use whatever machine and monitors you want.<p>* write code for our back-end using the latest version of C#, ReSharper, ASP.NET MVC, and Azure. Front-end developers use tools like jQuery, LESS, and often experiment with other tools like backbone.js.<p>* work on new code and tests in your own git branch.<p>* Develop and own entirely new features on our site.<p>* push your code to production (often every day) and see how our users use it<p>* follow the pulse of what’s happening in our company-wide chat room (today we discussed a cool paper on statistics in baseball)<p>* discuss new evaluation metrics and other data science-y concepts with the data science team<p>* participate in and learn from whiteboard sessions on things like how Gradient Boosting Machines work<p>* optimize pages based on profile stats<p>* investigate new tools, books, etc, to see if they might help make your development work better. Get whatever tools you need that help: no painfully long corporate approval required<p>* work with our data science guys to detect and mitigate suspicious activity on the site<p>* work with our designer on creating new views on the website.  He’ll make it look nice so you can focus on functionality in the model and controller. You're also encouraged to make the front-end look great if you like doing that.<p>* write code for back-end processing such as data analysis and submission scoring","time":1346526095,"type":"comment"}