{"by":"designofc1","id":4465494,"parent":4463689,"text":"Irvington, NY 10533. Front end developer for CMS site. On-site contract assignment for two months, possibly more.  <p>Front end developer for CMS site of approximately 150 pages.  Must have substantial experience working with HTML5, CSS, stylesheets and building templates for CMS.  <p>Architecture and design is ready to go. Many templates to build and pages to populate.  <p>We need the selected developer to spend time with us on-site in our office in Irvington, NY, 10533 under oversight of a senior developer. If our developers achieve full satisfaction with their communication and interaction with you, your capabilities and initial development work, this may only be required for the first few weeks and occasionally during the assignment.<p>We will provide a description of the project and will request an hourly cost or full assignment bid.   This is a full time requirement of a minimum of 35 hours per week.<p>Send resume (or links to your professional profile). Provide links to sites you have developed that demonstrate relevant experience.<p>Recruitment professionals need not apply.  <p>Your Location: \nTri-state area: New Jersey, Connecticut or New York within 40 miles of the Zip Code 10533.<p>English Level:\nFluent in written and verbal English.<p>Independent Contractors Only\nWho We Are\nTDO Communications is a technologically deep full service brand and multi channel marketing communications agency.<p>We provide our clients with the research and evaluation, thinking and creativity, marketing and technology, analytics, accountability and service they need to reach or exceed their business objectives. \nWe are vastly experienced in branding and integrated marketing, with deep roots in web and browser-delivered design and development, SEO, SEM and other online marketing. \nWe are bound by principle and practical experience to deliver quality and business results.\nWe partner with progressive clients.<p>Our riverfront offices, in Westchester, NY are easily accessed from I287, I684, The Sawmill Parkway, Merritt Parkway, TZP and MTA Metro North, Hudson Line local out of Grand Central. (stopping 100 feet from our door.  )<p>www.TDOinc.com\nemail: joe@TDOinc.com","time":1346541885,"type":"comment"}