{"by":"RJaswa","id":4465150,"parent":4463689,"text":"San Francisco/Palo Alto: iOS, Ruby on Rails, Generalists<p>Email info@orbesquare.com<p><i>What we do: Or Be Square -- <a href=\"http://orbesquare.com\" rel=\"nofollow\">http://orbesquare.com</a> -- (as in 'be there or be square') is a mobile and web application that helps people discover events and activities they love and plan them with their friends.<p></i>Who: we're a small, passionate, fun group of guys that write code everyday, have worked at Bessemer Venture Partners/Microsoft/Amazon, and went to school at Berkeley/Princeton/MIT.<p><i>Why now: The beauty of our situation is that you get all the excitement and responsibility of being at an early stage company with huge potential, but you get to avoid much of the associated downside because we've already raised a bunch of money and get to spend lots of time with amazing advisors and investors who have helped make companies like Dropbox, Ticketmaster, Amazon Recommendations, Disney, ShoeDazzle, Playdom, etc., the amazing businesses they are today.<p>You'll get to be an instrumental part of the company that delivers what we and our supporters believe could, really, be one of the most important products in a person's life in the future.<p></i>What we've built:<p>(1) Sophisticated and scalable service-oriented architecture<p>(2) A sanitized, curated database of most of the events in the U.S.<p>(3) A recommendation engine that learns about user interests by crunching data from Spotify, Facebook, etc.<p>(4) Clever social functionality that neatly folds together Facebook, Twilio and more.<p>(5) Ticketing feature (with our API partner SeatGeek) that will immediately deliver material revenue when we launch<p>(6) An alpha front-end that gets slicker everyday<p>*What we can offer: competitive compensation, meaningful early stage equity stakes, deep technical problems, shiny aluminum toys to hack on, and a lot of fun.<p>If you're interested please shoot us an email at info@orbesquare.com!","time":1346533914,"type":"comment"}