{"by":"cmatthias","id":4465206,"parent":4463689,"text":"Cambridge, MA (Kendall Square) (on-site, no remote)<p>Software Engineer/Senior Software Engineer at Cogo Labs (<a href=\"http://www.cogolabs.com/\" rel=\"nofollow\">http://www.cogolabs.com/</a>)<p>Cogo Labs is a company that creates companies, kind of like an incubator with a twist: all of our ideas/startups come from within the company. We don't offer investment in outside startups. Thus far we have had two major ($100MM+) acquisitions, and a handful of smaller ones, and we are anticipating more in the near future. Typically, once a startup we are incubating gets off the ground, we hire employees into that startup and assist them with whatever they need to make the company successful. Cogo Labs itself has around 40 full-time employees now in our office in Kendall Square in Cambridge, MA.<p>I'm looking for a software engineer or senior software engineer to join my team. You should have a degree in CS or a similar field, and experience developing for the web, as most of our startups are web properties. Specific experience in Ruby, Rails, and/or Python are a plus, but not absolutely necessary. I'm more concerned with finding smart people than finding people with specific skills.<p>I am currently developing new features for a web site that we run that gets &#62;50k unique visitors per day, and you'd be assisting in this effort. I can be more specific if you're invited for an interview.<p>We are big on metrics and analysis -- there are grids of monitors (we call them \"NOC walls\") all over the office showing up-to-the-minute stats about all of our properties. I can code up a new feature, deploy it, and walk over to one of the NOC walls and literally watch my change affect traffic on the site, or revenue, or profit. It's a really fun place to work. Benefits and perks are great as well (see <a href=\"http://cogolabs.com/careers\" rel=\"nofollow\">http://cogolabs.com/careers</a> for more info).<p>If you're interested, shoot me an email (cmatthias at cogolabs.com) with your resume and a brief cover letter (be sure to mention you saw this post on HN). Bonus points for including a link to your github page or other code repository where I can see some code you've written.","time":1346534922,"type":"comment"}