{"by":"sbisker","id":4465572,"parent":4463689,"text":"<i></i><i>[Interested in what we do? Come say hi to us and play with our API [<a href=\"http://dev.locu.com/\" rel=\"nofollow\">http://dev.locu.com/</a>] at the TechCrunch Disrupt Hackathon [<a href=\"http://techcrunch.com/events/disrupt-sf-2012/event-info/\" rel=\"nofollow\">http://techcrunch.com/events/disrupt-sf-2012/event-info/</a>] in San Francisco next weekend! -sbisker]</i><i></i><p>San Francisco, CA - Senior Front-End Engineer at Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We have recently launched Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>), our first product, which helps restaurants better manage their online presence.<p>We have more exciting ideas for our data than we have resources to build them. Your job will be to help us change that.<p>We're looking to hire a Senior Front-End Engineer. Generalists and \"desingineers\" would also do well in this position, as we have plenty of work to do on those fronts as well - but significant front-end experience is crucial. You should feel comfortable making major front-end architecture decisions and being a company-wide advocate for building intuitive, responsive interfaces that surprise and delight.<p>Guidelines (requirements is such a strong word):<p><pre><code>  4+ years of experience building rich, interactive websites\n\n  Experience leading or managing an engineering team a plus - if you don't have it,\n  we'll give you a chance to mentor and grow as an leader.\n\n  Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills. \n  (For better or worse, we fully support IE8 - that's where small business owners are, \n  at least for a little while.) \n\n  Experience in proper UI engineering, particularly in Javascript. The deeper your JS\n  experience, the better. \n  (Framework experience (Backbone, Handlebars, etc) and opinions about when \n  they should and shouldn't be used is a +.)\n\n  Ability to go out of your comfort zone and write a server-side controller if no one \n  else is around is a + \n  (Experience with Python / Django in particular is a ++.)\n\n  A good sense of design and/or an ability to work with designers \n  (We won't make you \"design all the things\", but being able to draw on past \n  experience designing dashboards and other user interfaces is a +.)\n  \n</code></pre>\nSpecial note for Generalists and Desingineers<p><pre><code>  We know you like to strike your own unique balance. So don't sweat the reqs and just \n  show us what you've got.\n  We want you to be able to do what you love, the way you're best able to do it. :)\n  \n</code></pre>\nInterested? Drop us a line at jobs@locu.com. Please specify \"Senior Front-End Engineer - HN\", in the subject of your letter. Learn more about us at <a href=\"http://www.locu.com/about/jobs/\" rel=\"nofollow\">http://www.locu.com/about/jobs/</a><p>PS: Like most startups, we're always on the lookout for exceptional talent of all sorts. So if you feel you're a particularly strong fit for what we do or how we do it, check out our other descriptions at <a href=\"http://www.locu.com/about/jobs/\" rel=\"nofollow\">http://www.locu.com/about/jobs/</a>.<p>-------------------------------------<p><i></i><i>Founded a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best angel investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 17 people with very diverse backgrounds, and growing.</i><i></i>","time":1346544109,"type":"comment"}