{"by":"bscoperecruiter","id":4474991,"parent":4463689,"text":"BrightScope is looking for exceptional full-time software engineers/developers to expand our dev team. Are you someone who is tired of working for big technology companies where you are buried in layers of bureaucracy, wait months or years between product releases or don’t have a say in what you build? Do you want to get in on the ground floor of a rising data and analytics company?<p>If you can figure out the toughest problems, love learning new things, and want to play a major role in the success of a growing startup, join us in building something great.<p>BrightScope is full of passionate, smart people that want to change the world for the better. As our products and services gain in popularity, we need more developers to help build our platform.<p>BrightScope is full of passionate, smart people that want to change the world for the better.<p>Responsibilities to include:<p>Developing new features and improving core business software assets and applications\nHelping develop critical parts of our analytics platform and client-facing applications, delivered via a SaaS model over the web\nCoordinating with the project team<p>Requirements:<p>Solid command of your favorite programming language\nSQL experience (MySQL preferred), with a strong grasp of data modeling in large applications\nUnderstanding of MVC frameworks\nExperience with unit and functional testing, and preferably test-driven-development\nA self-starter attitude and an ability to break large problems down quickly\nExtreme attention to detail\nExcellent written and verbal communication skills<p>Experience working with any of the following is desired:<p>Amazon's Web Services: EC2, S3, Route53, RDS, etc.\nKnowledge of *nix is a huge plus (we use Ubuntu on our servers)\nDistributed applications\nDesigning for scale: algorithmic and efficiency concerns, etc.\nMVC frameworks (we use Django) \nWeb services (SOAP, REST)\nAgile development processes\nJIRA or other bug tracking systems\nKnowledge of source control\nExperience working with automated testing tools in Python or another language (Python unittest, nosetest, etc))<p>You will:<p>Improve the efficiency and stability of the systems and applications that power our solutions\nStart with ideas, design products and features, help architect a technical solution, then build, test and launch it\nBe an integral member of the development team and shape our future<p>We will:<p>Make sure you have what you need to be happy and productive\nCompensate you with a mixture of cash and equity\nMake great teammates united around the company mission<p>Interested and qualified candidates should send their resumes directly to jobs@brightscope.com with \"Software Engineer\" in the subject line. Local candidates are a bonus.","time":1346772828,"type":"comment"}