{"by":"Robingow","id":4476495,"parent":4463689,"text":"Mountain View, Ca: Software Engineer<p>What we do: Addepar is recreating the infrastructure that powers global wealth management. Addepar's technology increases efficiency, transparency, and sophistication within the global investment industry, thwarting fraud and furthering meritocracy in one of the most important areas of the global economy.<p>Engineers form the core of our culture and team. At Addepar, we value software design, reliability, and user experience. We're looking to create a product and brand that inspires people and aligns incentives in the most important industry in the world. Help us invent the tools to run global finance.<p>What our engineers do:<p>- Optimize for performance, functionality, and stability. \n- Revisit and improve existing features, rethinking previous assumptions. Nothing is ever done. \n- Troubleshoot customer deployment issues requiring rapid identification and fixes. \n- Build massive datasets of the world's public and private financial graph, designing and developing tools and architectures to simplify the process. \n- Identify current software and design weaknesses, and help to develop solutions. \n- Apply theoretical expertise in computer science to real world problems.<p>Requirements:<p>- Technologist, by education or trade, with a fundamental understanding of Computer Science. \n- Experienced in concurrent programming, and developing low-latency/high-throughput software. \n- Personal projects or open source contributions you want to show off. \n- [Bonus] Deep proficiency in Java and/or Javascript.<p>We dress comfortably at the office, eat together, and play team sports together. We've been known to throw impromptu midnight parking lot BBQs (we built a bonfire once, but it didn't end well) and host movie nights in back of our building. Every Thursday evening, we break away from work to play a game of Innovation, Settlers of Catan, Dominion, or one of the many other games in the engineering pit. We don’t believe in excessive meetings, process or excessive contemplation; everyone is empowered and expected to make decisions.<p>Learn more: careers.addepar.com<p>Email: R2 (at) addepar dot com.<p>Interns and H1-Bs welcome.","time":1346792338,"type":"comment"}