{"by":"jerrythompson","id":8681944,"parent":8681040,"text":"Woven Digital, Inc. | Contract, Full-Time | REMOTE (US Only) or LOCAL<p>Headquarters: Culver City, CA<p>Link to current openings:  <a href=\"http://jobs.woven.com/apply\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.woven.com&#x2F;apply</a><p>★ Fullstack Engineer<p>★ Web Developer - Frontend<p>★ Mobile Developer - Android<p>★ Mobile Developer - iOS<p>★ PHP &#x2F; Wordpress Developer (VIP level)<p>★ MySQL DBA<p>=============<p>Fullstack Engineer<p>* Bachelor&#x27;s degree in CS or equivalent experience<p>* 3+ years experience in designing, developing and delivering engaging user experiences on public facing web sites<p>* Strong experience and advanced knowledge of PHP, MySQL, HTML5, JavaScript, CSS3. Other languages a plus.<p>* Experience with MySQL replication<p>* Experience working with APC cache, memcache, CDNs<p>* Experience with analytics and ad serving software such as Google Analytics, Adsense, Google Publisher Tags, Optimizely, etc.<p>* Must be able to gather requirements, design, code and test independently as well as collaborate with the team<p>* Be able to engage in long-term technical planning and influence the direction of the company&#x27;s infrastructure<p>* Develop, maintain and optimize secure and scalable multi-tier web applications<p>=============<p>Web Developer - Frontend<p>* 3+ years of web development experience<p>* Expert jQuery, Angular JS, Backbone JS, Ember JS and all things Javascript HTML5 &amp; CSS3<p>* Ability to create library and APIs that enable modular, extensible design and development<p>* Well experienced in developing user interfaces<p>* Optimize page performance and designs for mobile devices and desktop<p>=============<p>Mobile Developer - Android<p>* 3+ years of Android application development experience<p>* Experience with OOP, Eclipse, Android ADT and SDKs<p>=============<p>Mobile Developer - iOS<p>* 3+ years of iOS application development experience<p>* Deep knowledge of Objective-C, Swift, Cocoa, Xcode<p>=============<p>PHP &#x2F; Wordpress Developer<p>* Ability to develop Wordpress VIP level PHP code<p>* At least 3+ years of Wordpress experience<p>* Experience with Wordpress plugin development<p>=============<p>MySQL Database Administrator<p>* MySQL schema design<p>* Develop and support MySQL database replication<p>* Monitor and optimize MySQL database performance and capacity planning<p>* Table indexing, locking, query analyzing<p>* Troubleshoot database issues; maintain database systems availability and scalability.<p>* Develop and optimize database design for new applications<p>=============<p>All candidates must have experience with agile dev and source control (Git or SVN), experience with highly scalable&#x2F;availability sites and be able to analyze, troubleshoot and problem solve with minimal supervision.  You will work closely with the Publisher Technology team and your work will touch millions of people every month.<p>Salaries and rates are competitive.  Additional benefits for FT employees.","time":1417451802,"type":"comment"}