{"by":"channel4","id":8681145,"parent":8681040,"text":"The Channel 4 Data Planning &amp; Analytics PhD Scholarship 2015 – London, UK<p>An opportunity to work with cutting-edge data science technologies while carrying out pioneering research at University College London.<p>This five-year scholarship programme is giving two graduates the opportunity to study for a PhD in Statistics at UCL, fully funded by Channel 4. To learn more about the faculty and research at UCL, please visit: <a href=\"http://www.ucl.ac.uk/statistics/research\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ucl.ac.uk&#x2F;statistics&#x2F;research</a> \nAt the same time, a salaried role with Channel 4’s Data Planning and Analytics team will provide practical real-world experience. Right now the team’s cutting-edge projects include working with the Hadoop stack, developing in R and Python, machine learning algorithms and data mining toolkits.<p>––––––Data Planning and Analytics at Channel 4––––––––––<p>We’re passionate about data and unlocking its value. We apply advanced analytics techniques, machine learning and artificial intelligence to better understand our audiences. That way, we can build stronger relationships with them and shape our future programming around their behaviours and preferences.<p>It’s a pioneering approach: applying analytics in the broadcast industry at this scale has never been done before. So you’ll be part of a team that’s helping to reshape the media landscape – and ensuring that Channel 4 is at the forefront of the evolving world of connected viewing.<p>––––––––What will you be involved in?–––––––––––––––––––<p>It’s a fast-paced industry, so things are changing all the time. Principally though, you will be contributing to large-scale projects across any number of areas – like employing data visualisation to map the content universe. We can then answer questions like “which other shows would a male Made in Chelsea viewer be interested in?”<p>––––––––The future––––––––––<p>There will be opportunities to progress within Channel 4 – and potentially to fast-track to a more senior leadership role. Alternatively, you may choose to use the experience and knowledge you’ve gained to build an academic career.<p>–––––––What are we looking for?––––––––––<p>It goes without saying that you’ll share our passion for data. You will be equally fascinated by what we can learn from it. For qualifications, you’ll need a 1st class or high upper 2nd class BSc degree or an MSc with Merit or Distinction in mathematics, statistics, computer science or a related quantitative discipline. Ideally you should also bring some practical experience gained in a commercial setting.<p>To find out more and register your interest (by 15 December 2014), visit<p><a href=\"http://jobs.channel4.com/pages/job_search_view.aspx?preview=preview&amp;jobId=2885\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.channel4.com&#x2F;pages&#x2F;job_search_view.aspx?preview=...</a><p>Closing date: 5 January 2015.<p>Our commitment to diversity doesn’t end with our programming.","time":1417444623,"type":"comment"}