{"by":"a_bergie","id":8681897,"parent":8681040,"text":"SnapEngage - Berlin, Germany or Boulder, CO - Front-End&#x2F;UX Software Engineer<p>This position is a full-time software engineer based in either our Boulder, CO or Berlin office (and work from your home office 2 days per week). As a frontend &amp; UX software engineer at SnapEngage, you&#x27;ll work with a small, agile, distributed and passionate team. You’ll develop new, exciting features for the SnapEngage live chat and customer engagement solution, writing front end code that runs and looks beautiful in desktop and mobile browsers.<p>What you&#x27;ll do:<p><pre><code>  * Lead UI&#x2F;UX projects\n  * Create appealing and functional UI with millions of daily mobile and desktop views\n  * Be hands-on in implementing designs\n  * Research and promote new technologies to help improve our development processes\n  * Contribute ideas to improve our service and software\n  * Maintain and improve existing functionality\n  * Spend a few hours a week chatting with customers to keep a pulse on customer issues and maintain a customer-centric focus\n  * Participate in daily stand-up meetings with our global team\n</code></pre>\nAbout you:\nYou are a wizard when it comes to designing great user interfaces and implementing them in JavaScript, HTML and CSS. You are a quick learner, a dedicated team player and have a relentless positive attitude. You are authorized to work in the USA or Germany, have excellent written communication skills in English (additional languages a plus) and would enjoy working cross-culturally.<p>Additionally, you:<p><pre><code>  * Exhibit a mastery of JavaScript frameworks like Backbone, Underscore, D3\n  * Have the ability to write clean, efficient code\n  * Can demonstrate experience with Google AppEngine, GWT or Eclipse (a big plus)\n</code></pre>\nAwesome benefits of working at SnapEngage:<p><pre><code>  * Work from home part of the week\n  * Employee Gain-share plan\n  * Yearly team building trip to exotic locations\n  * Opportunity to make great ideas come to life\n  * Work with an amazing multicultural team\n</code></pre>\n<a href=\"https://snapengage.com/jobs/front-end-and-ux-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;snapengage.com&#x2F;jobs&#x2F;front-end-and-ux-software-engine...</a><p>SnapEngage is a fast-growing live chat solution for the web. We are an Internet startup born of the TechStars program in Boulder, CO with offices in Boulder, USA and Berlin, Germany. All SnapEngage employees have a stake in the company’s success and enjoy an exceptional work-life balance. Our employees embrace a good challenge and enjoy providing the best customer service in the biz. SnapEngage is self-funded, profitable and deeply committed to creating products that make peoples’ lives better by changing the way companies interact with their customers.\nCome chat with us now at <a href=\"http://snapengage.com\" rel=\"nofollow\">http:&#x2F;&#x2F;snapengage.com</a> if you&#x27;re interested!","time":1417451371,"type":"comment"}