{"by":"andrem","id":8681440,"parent":8681040,"text":"Madrid, Spain | Mediatech Solutions | Full time preferred, contract possible | EU Visa required<p>* DevOps Engineer - see <a href=\"http://www.mediatechsolutions.es/join-the-team/openings/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mediatechsolutions.es&#x2F;join-the-team&#x2F;openings&#x2F;</a> for this and additional openings<p>### What?<p>We are a platform provider in the real money online gaming space. Our solution deals with lots of money and game transactions and we integrate with many content providers that our customers can then pick and choose from to offer as their solutions. Our customers all work in highly regulated markets so there are quite a few laws that we must adhere to in our day to day work.<p>### How?<p>We use a full C#.Net stack and related technologies - IIS, SQL Server and Windows Server. Performance is king so we tend to get fairly low level in the code. We are working in Scrum and you will be working side by side with all kinds of engineers - developers, testers and other ops people. Everyone contributes an individual piece to the bigger puzzle of our development cycle.<p>### Why?<p>We need experienced DevOps Engineers to join the team and help us building a shippable platform that gives us details on what is happening before it happens. The supporting tools we use are flexible and don&#x27;t have to run on Windows or C#. If you have always wanted to implement DevOps solutions that will be tested in scale (not Google&#x2F;Facebook, but rather financial institution) we can offer you an exciting environment to work in.<p>### More!<p>Architecture as code, dashboards, automatic deployments, performance measurements, working with dev, working with testers. Create from scratch, enhance, improve. If you always wanted to setup a DevOps lifecycle with the building blocks you chose - this could be an opportunity for you.<p>We are in northern Madrid and are ideally looking for full time people, if you want to just check out Madrid for a few months we can maybe talk as well but it&#x27;s not our preferred option. Also - we need presence in the office so unfortunately no remote work :( If you want to practice your Spanish you will get ample opportunity but our official language is English.<p>Salaries are competitive within Europe&#x2F;Spain but are not Silicon Valley level.<p>Shoot me an email if you are interested with a rundown of your previous experience - my name is Andre and I am the Technical Director, email me at jobs_hn@mediatechsolutions.es","time":1417447173,"type":"comment"}