{"by":"mmattax","id":8681548,"parent":8681040,"text":"Formstack - <a href=\"http://www.formstack.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.formstack.com</a> - REMOTE<p>Be our first DevOps hire!<p>Formstack is an 8 year old company with its roots in Indianapolis. Our customers span 110 different countries, and our employees live and work across the U.S. and the globe.  We have employees in: Oklahoma City, Charlotte, Raleigh, Chicago, Los Angeles, Cynthiana, Krakow Poland, Bethlehem, PA, Atlanta, Bloomington, and Indianapolis. We provide a remote work environment that is flexible and provides great freedom for those who can perform. With that said, relocation is not required if outside Indianapolis.<p>What You&#x27;ll Do:<p>You&#x27;ll be our first dedicated DevOps hire. You&#x27;ll be in charge of maintaining production servers and the applications that run on them. You&#x27;ll ensure that our MySQL databases are not only performant, but being backed up properly. You&#x27;ll be in charge of ensuring that we have the redundancies and policies in place to support the high availability of our applications. You&#x27;ll work with our engineering team to ensure the software that we build can scale.<p>How You Qualify for the Job:<p>- 3-5 years experience as a system administrator or DBA.<p>- Strong experience scaling the LAMP stack<p>- Strong experience with large MySQL databases (300GB+)<p>- Strong understanding of networking and systems architecture.<p>- Automation: CHEF, Puppet, Ansible, Fabric,  Docker, or other configuration management software<p>Extra Credit Qualifications:<p>- Experience with AWS (EC2, EBS, RDS)<p>- Experience with Elasticsearch<p>- A love for Vim<p>- Language experience with PHP or Python<p>What Formstack Offers:<p>- Remote environment<p>- Medical, Dental, Vision as well as company-paid Disability and Life Insurance Benefits.<p>- 401k with matching company contribution<p>- Friday Lunch (Indianapolis Office)<p>- The most up-to-date technology, including company-issued Macs, the latest software and other tools needed to excel at your job<p>- Company-paid conferences and extended learning<p>- Yearly company gatherings<p>- Generous PTO<p>Apply at <a href=\"https://formstack.applicantpro.com/jobs/143526-25843.html\" rel=\"nofollow\">https:&#x2F;&#x2F;formstack.applicantpro.com&#x2F;jobs&#x2F;143526-25843.html</a><p>Questions? Email me at michael@formstack.com","time":1417448160,"type":"comment"}