{"by":"blakeweb","id":8681793,"parent":8681040,"text":"Senior Python Data Scientist and Senior Software Engineer - Recursion Pharmaceuticals<p>Question for you: What&#x27;s the most challenging, impactful, rewarding set of computational problems you could be working on, that will really change lives?<p>We’re a small and fast-growing biotech startup with an amazing set of advisors including the Broad’s Anne Carpenter, and we&#x27;re using high throughput genetic perturbation experiments in human cells, automated image segmentation and quantitation of hundreds of features for every cell, and machine learning and statistics to find new treatments for rare genetic diseases faster than anyone has previously thought possible. If that sounds like a lot of biology, don’t worry—you’ll be up to speed in a week or two. Just know this: there are more than 5,000 rare genetic diseases, in total affecting more than 10 million people in the US alone, and only a handful are treatable. We aim to find treatments for 100 of them in the next 10 years. See who we are at <a href=\"http://www.recursionpharma.com/team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team</a><p>We’re looking for exceptional computational scientists to help lead our analysis efforts, with the following criteria:<p>- Native-level fluency in probability, statistics and modeling; several years of experience in statistics, machine learning, and software development solving problems using lots of data, ideally using python’s scientific stack; thorough understanding of fundamentals of machine learning such as cross-validation and learning curves, plus an ability to explore new types of data independently and get an effective guess as to what sorts of models and assumptions make sense as a starting point.<p>- A track record of outstanding projects, publications, or presentations that demonstrate successful application of the above talents.<p>- Motivation to tackle some of the most challenging data problems around, to work with other sharp and highly-motivated individuals with diverse backgrounds, and to make lots of patients’ lives dramatically better.<p>- Biology background not required; intellectual curiosity and motivation to learn is critical.<p>- Key tools and skills (not all required): python, machine learning, sklearn, ipython, data science, pandas, interactive analysis, linux fluency, bioinformatics (definitely not required)<p>More details and how to reach us: <a href=\"http://www.recursionpharma.com/lead-python-data-scientist.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;lead-python-data-scientist.ht...</a><p>More openings including software engineering roles: <a href=\"http://www.recursionpharma.com/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers.html</a><p>Recursion Pharmaceuticals is based in Research Park at the edge of the mountains overlooking Salt Lake City, Utah. Gorgeous hiking&#x2F;running&#x2F;biking is literally out our back door, and it&#x27;s half an hour to 5 top ski resorts.","time":1417450536,"type":"comment"}