{"by":"voleon","id":8681993,"parent":8681040,"text":"Voleon Capital - Berkeley, CA - VISA - Full-Time Roles: (a) backend software engineers (b) software engineer - data infrastructure.<p>The firm researches and deploys machine learning and statistical trading strategies that are designed to generate attractive returns without being dependent on the performance of the overall market. Join a team of under 30 people that includes a professor at a premier university as well as over ten PhDs and two MBAs from top schools, led by the founder and CEO of a successful Internet infrastructure technology firm. The firm’s offices are within walking distance from BART and from the UC Berkeley campus in downtown Berkeley, California. We have a casual and collegial office environment, weekly catered lunches, and offer competitive benefits packages.<p>BACKEND SOFTWARE ENGINEER<p>Technology-driven investment firm employing cutting-edge machine learning techniques seeks an exceptionally capable software engineer. You will architect and implement new production trading systems, machine learning infrastructure, data integration pipelines, and large-scale storage systems.<p>We seek candidates with a proven track record of writing correct, well-designed software, solving hard problems, and delivering complex projects on time. You should preferably have experience designing and implementing fault-tolerant distributed systems. Experience with building large-scale data infrastructure, stream processing systems, or latency-sensitive programs is a bonus.<p>We are growing rapidly. Willingness to take initiative and a gritty determination to productize are essential.<p><i>Qualifications:</i><p>• Experience developing with C&#x2F;C++&#x2F;Python&#x2F;Go in a Linux environment with a focus on performance, concurrency, and correctness.<p>• Experience working in TCP&#x2F;IP networking, multithreading and server development.<p>• Experience working with common Internet protocols (IP, TCP&#x2F;UDP, SSL&#x2F;TLS, HTTP, SNMP, etc.)<p>• Experience architecting and designing highly-available critical systems.<p>• Experience architecting and designing large-scale data management infrastructure.<p>• Experience working in large codebases and building modular, manageable code.<p><i>Useful Skills:</i><p>• Experience with debugging and performance profiling, including the use of tools such as strace, valgrind, gdb, tcpdump, etc.<p>• Experience with build and test automation tools.<p>• Experience working with well-defined change management processes.<p>• Has experience hunting down RDBMS performance problems, understands indexing options, can read an execution&#x2F;explain plan, has some experience with ORM and optimization at the code layer, etc.<p>• Experience with messaging queues (such as RabbitMQ and Redis), as well as distributed caching systems.<p>SOFTWARE ENGINEER, DATA INFRASTRUCTURE<p>Fast-growing science- and technology-driven company seeks a Senior Deployment&#x2F;DevOps Engineer. You will work with the RnD, Software, Infrastructure and Trading teams to develop, test, deploy, and manage research, operational and production software.<p>Focus areas for the position include creating software infrastructure for our research department and production trading systems, implementing and automating back office and reporting systems, as well as supporting the next generation of our compute and storage hardware systems. We seek a candidate who can bring both development and operations skills to rework existing software infrastructure and guide testing&#x2F;automation of new and ongoing deployments.<p><i>Qualifications:</i><p>• Experience writing Python code in a Unix environment<p>• Experience working with mission critical RDBMS, performance and fault tolerance.<p>• Industry experience as a software engineer<p>• Automated deployment and virtualization (Ansible, KVM, Jenkins, etc.)<p>• Experience with debugging and performance profiling, including the use of tools such as strace, valgrind, gdb, tcpdump, etc.<p><i>Useful Skills:</i><p>• Monitoring and network management (Nagios, Logstash, Graphite, Cacti, etc.)<p>• Knowledge of distributed systems, cluster computing, and fault tolerance<p>• Experience making commits on open-source technology<p>• Familiarity with cluster management and job queuing systems (Chronos, Luigi, Oracle grid engine, Mesos, etc.)<p>• Experience in operations for highly available services<p><i>To Apply:</i> Send a cover letter and resume to working@voleon.com; reference the name of the position you are applying for.","time":1417452199,"type":"comment"}