{"by":"karlwmacmillan","id":8681656,"parent":8681040,"text":"Rakkoon (<a href=\"http://www.rakkoon.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.rakkoon.com</a>) - Baltimore, MD [REMOTE or LOCAL]<p>We are a startup with a strong mission - helping parents be better parents in a mobile and social world. We want to be a force for good and help parents who are currently struggling. At the same time, we are a business that aims to be around for the long time. We want to be healthy and profitable at a pace that is sustainable.<p>We want the best people, wherever you currently live. We are open to remote candidates or people that want to work in the Baltimore, MD &#x2F; Washington, DC areas. We are all hard workers, but want people to have thriving personal lives. We want the best performance from people, not the most hours. It&#x27;s simply not possible to be at your most creative while working too many hours and not having the flexibility you need to live your lives.<p>Rakkoon was founded by three parents with a long history of leadership in successful companies. We know what it takes to create a successful business that treasures its employees. We&#x27;ve found a strong group of investors that believe in our mission and our vision for creating a great company. We would be honored if you would consider working with us.<p>We are looking for technical hire #1 with deep knowledge of networking and HTTP-based APIs who is also enthusiastic about all aspects of developing a consumer-facing product aimed at helping parents in the mobile+social world. We value computer science fundamentals (we will be doing deep packet inspection at scale after all), a strong sense of product design, and enthusiasm for shipping product as part of a small team. Typical tasks will include contributing to our core traffic inspection capability to extract information from network traffic generated by apps on mobile devices, analysis of data (including social network analysis), development of user-facing apps for parents (responsive website for now and moving to iOS and Android Apps soon), and support of the product in a production environment (aka DevOps).<p>Skills we are interested in:\n* Strong knowledge of networking (low-level IP, HTTP, and VPNs).\n* Strong computer science fundamentals. We will be collecting large amounts of data and doing interesting analysis.\n* DevOps experience (Linux definitely - Google Cloud Platform experience is very welcome).\n* Our current stack includes Google App Engine (Python &#x2F; Javascript),  Google Compute Engine (Python), iOS (Objective C - we&#x27;re tempted by Swift, but not yet!), and Android (Java). As we scale up we will likely add another, higher-performance langue to the backend. Maybe Go, but you can help us make that decision.","time":1417449172,"type":"comment"}