{"by":"jjarmoc","id":8681786,"kids":[8681963,8684267,8681805],"parent":8681040,"text":"-- .- - .- ... .- -. ---    ... . -.-. ..- .-. .. - -.--<p>Matasano Security - Chicago. New York City. Sunnyvale. \nJob Title: Application Security Consultant<p>-- .- - .- ... .- -. ---    ... . -.-. ..- .-. .. - -.--<p>Once a professor shared a piece of career advice with me.  &quot;Don&#x27;t call yourself a coder,&quot; he said, &quot;anyone can learn to code, but programming takes real skill.&quot;  His words have stuck with me since.  Coding was, in his description, the mere act of producing something a computer can interpret and act upon.  Programming, however, seeks elegance and simplicity through considered design and thought that transcends the code itself.  While both take skill, the goals are different and they can be thought of as distinct disciplines.<p>Application Security, I&#x27;ve come to believe, is yet another discipline with a slightly different focus.  &#x27;Coders&#x27; focus almost exclusively on iterating until they achieve a desired result. &#x27;Programmers&#x27; might test and refine to improve performance and reduce resource consumption. But with an Application Security perspective, we instead look at unintended functionality and edge cases that give rise to problems; &#x27;What if&#x27; scenarios involving abuse cases that weren&#x27;t part of the original design.  It&#x27;s yet another way of looking at the same application, with a different goal and different outcome.<p>At Matasano, we don&#x27;t build software, we break it.  We find, exploit, document, and prioritize flaws so the application&#x27;s developers can address them.  We identify when security controls are effective, and note areas for improvement.  We review use cases, identify abuse cases, and help guide future development efforts. We work across a wide variety of applications ranging from simple web apps, to complex hardware appliances. From HTTP to proprietary encrypted protocols, and everything in between.  As a team, we&#x27;re as comfortable with ROP chains and memory corruption vulnerabilities as Cross-Site Scripting and SQL Injection.  As individuals, we excel in our areas of focus while cross-training and broadening our skills.  We&#x27;re among the leaders in our industry and community, and give back through research, tools, and practice environments.<p>If improving the state of software security while kicking up some dirt in the process seems like fun, check us out.  If you&#x27;re fueled by pride of finding unexpected solutions, we have plenty of challenging problems for you. If you&#x27;re not content to be a &#x27;coder&#x27; and long for something more fulfilling, get in touch.<p>-- .- - .- ... .- -. ---    ... . -.-. ..- .-. .. - -.--<p>careers@matasano.com or www.matasano.com for more info<p>-- .- - .- ... .- -. ---    ... . -.-. ..- .-. .. - -.--<p>Curious about Crypto?  - www.cryptopals.com\nMesmerized by Memory Corruption? - www.microcorruption.com<p>-- .- - .- ... .- -. ---    ... . -.-. ..- .-. .. - -.--","time":1417450477,"type":"comment"}