{"by":"kedargj","id":8681082,"parent":8681040,"text":"McKinsey Digital Labs (part of McKinsey &amp; Co) - San Francisco, New York City.<p><i>We’re looking for Architects, Full Stack Engineers and Front End Developers.</i><p>—————ABOUT MCKINSEY DIGITAL LABS————————<p>McKinsey Digital Labs is the in-house client focused digital delivery group of McKinsey &amp; Company. MDL combines user-centered design with unparalleled business knowledge and world-class agile development skills to deliver impactful digital experiences. We are a team of passionate designers, architects and developers solving tough problems for our clients.<p>We deliver service design concepts, experiential prototypes and production-ready apps to transform our client’s businesses. Despite being part of a large, multinational organization, MDL works more like a small startup company.<p>—————————<p>We’re looking for FRONT END DEVELOPERS.<p>As Front-End Developer at MDL, you will work in small teams in a highly collaborative way, use the latest technologies and enjoy seeing the direct impact from your work.<p>You’ll create both rapid prototypes, usually in a couple of days to 3 weeks, as well as full-scale applications typically within 2 to 3 months, by working collaboratively and iteratively through design and development. You will need to deliver fully functioning web-based and mobile applications that meet the business goals and requirements of our clients. As a Front-End Developer at MDL you’ll contribute to the architecture across the technology stack, from databases to native apps.<p>Do you have the passion and experience to…?<p><pre><code>   -Build prototypes and products using agile development methodologies.\n   -Build with Javascript MVC frameworks (e.g., Angular JS, Backbone, etc.)\n   —Create responsive&#x2F;adaptive applications for mobile devices using HTML5&#x2F;\n   —CSS with familiarity in backend technologies. (e.g. Phonegap, Python, Objective-C, etc.)\n   —Write and utilize RESTful API services and performance tuning applications.\n   —Use relational and non-relational data stores in your applications. (e.g., MongoDB, CouchDB, Cassandra, etc.)\n\n</code></pre>\nIn your work, do you…?<p><pre><code>   —Demonstrate excitement about the impact of emerging &#x2F; disruptive technologies.\n   —Solve problems by processing complex information and presenting it clearly and simply.\n   —Provide technical excellence (whilst adhering to Agile software engineering practices such as DRY, TDD, CI) and leadership&#x2F;mentorship.\n   -Want to unleash their inner self-starter and work in an environment that fosters entrepreneurial minds.\n   -Play an active role in the community, i.e. speaking at conferences, blogging, contributing to open source projects, etc.\n</code></pre>\nWe are committed to having a meritocratic and transparent hiring process.<p>In order to proceed to the next stage of the interview process, we want to make sure that you are genuinely excited about McKinsey Digital Labs and are able to solve the types of challenges we face.<p>If you are, please start this application by taking one of the below challenges so that the managers at McKinsey can evaluate your key competencies before the interview.<p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-154/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a><p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-160/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a>","time":1417444126,"type":"comment"}