{"by":"mfontani","id":8681646,"parent":8681040,"text":"The Register - Server Side Perl Developer &#x2F; Sysadmin [LOCAL]<p>Situation Publishing, owner of The Register (www.theregister.co.uk), is looking for a full-time software developer&#x2F;sysadmin to work on server side Perl code and Debian-based servers.<p>You&#x27;ll work in our Edinburgh office, doing a combination of software development and on-going maintenance and tasks such as log reporting, server monitoring, applying software updates and system tuning to ensure the availability and quality of our online presence.<p>Required skills<p>- Excellent English, communication skills, and the legal right to work in the UK.<p>- Experience writing Perl, or excellent skills in a similar language and be happy to bend them to working with Perl<p>- Debian&#x2F;Ubuntu experience and comfort with the shell<p>- Good knowledge of Apache<p>- Comfort using software revision control (e.g. Git)<p>- Comfort using SQL (“raw” and through abstractions like DBIx::Class)<p>Desired skills<p>- Debian package management, and day to day system administration<p>- MySQL and Postgres<p>- (valid) HTML, Javascript and CSS<p>- Familiarity and experience with server virtualisation<p>- Testing and monitoring<p>- Mail servers (e.g. Exim)<p>Broadly put, we favour open source: we use Debian&#x2F;Ubuntu, Perl, Apache, Exim, MySQL &amp; Postgres in our stack. We rely heavily on Git for process and revision control. We sometimes write our own tools. Our business is on the web, so while HTML, Javascript, and CSS skills are not required they are desirable and you would be expected to become familiar with them over time.<p>Our Edinburgh tech team is small, focused and has a good degree of autonomy, so you need to be able to produce great work without a carrot or stick and be comfortable communicating with the wider business via email, phone, instant messaging and online tools such as Wikis and Google Docs.<p>See <a href=\"http://jobs.perl.org/job/19066\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.perl.org&#x2F;job&#x2F;19066</a> for more info &amp; link to apply","time":1417449057,"type":"comment"}