{"by":"cwhiten","id":8681874,"parent":8681040,"text":"Solink - Ottawa, ON, Canada (Local, relocate) - <a href=\"http://solinkcorp.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;solinkcorp.com&#x2F;</a><p>Send resumes&#x2F;questions to: cwhiten@solinkcorp.com<p>———————<p>About us:<p><pre><code>  Solink is a video and data intelligence company based out of Ottawa, Canada. For over three years, Solink has developed a comprehensive video intelligence platform to address pressing issues in the areas of security, marketing, compliance and operations. The business applications developed by our team have been largely client driven to ensure relevance and usability. Solink leverages video analytics to refine and expedite contextual data from “Big Data” to aid decisions makers.\n</code></pre>\n——————————————————————<p>About you:<p><pre><code>  You like to code.  You code for work or school and you code in your spare time.\n\n  You have an amazing ability to mash different technologies together\n\n  You believe in the best tool for the customer and the situation:  you are comfortable working in a mixed tech environment, Windows Server, Linux, iOS, Android, cloud, on-premise, Java, C#, Ruby, etc\n\n  All modesty aside, you are a pretty awesome coder in some kind of common language or framework\n\n  You work smarter AND harder and you have a passion for learning and improvement\n\n  You like tidy code.  You understand the value of style and find commenting to be satisfying.  It makes you angry when control and view logic mingle\n\n  You are test-driven and you like to have a nice thick quilt of unit tests in order to sleep at night\n\n  You use tools and frameworks.  You write your own tools when necessary and your first instinct is to check and see how other people have already solved this problem. \n\n  You like clarity; you are honest, realistic and you don’t mind pointing out the elephant in the room.\n\n  You like people, you like working with people, and people like working with you.\n</code></pre>\nBonus Points:<p><pre><code>  Accepted answers on SO\n\n  Contributed to a recognized OS project\n\n  HTML5, MVC, RoR, CSS, JavaScript and JavaScript libraries: JQuery, D3.js, etc.\n\n  IP cameras and Network video recorders, \n\n  Video codecs and transcoding\n\n  Amazon Web Services or other cloud-based development\n\n  OpenCV or other image processing libraries\n\n  Highly scalable, high-perfomance distributed computing\n\n  ElasticSearch, Solr, Druid.io, Apache Storm, Hadoop, Logstash, Splunk</code></pre>","time":1417451202,"type":"comment"}