{"by":"nixy","id":8681299,"parent":8681040,"text":"Stockholm, Sweden | Accedo.tv | Web developer (Javascript)<p>SENIOR SOFTWARE ENGINEER (Professional Services, Stockholm)\nAccedo.tv is looking for experienced Web Developers who want to join our talented development team at Professional Services in our headquarters in Stockholm.<p>At Accedo you will be part of a diverse and multi-disciplined development team, gaining exposure to cutting-edge technologies and get the opportunity to work with some of the largest global media brands in the industry e.g. Netflix, HBO, Fox, Viaplay, Spotify amongst other. Working in a highly collaborative and international environment, you will help transform requirements and designs into high performing feature rich applications on a wide variety of web based platforms and devices.<p>Role Responsibilities\n- Develop web applications to match customer specifications\n- Take on the role as lead engineer in projects, serving the project team with engineering leadership as well as driving technical discussions with customer\n- Integrate applications with services and systems\n- Exercise expertise in performance, architecture and software design to deliver compelling end user experiences\n- Collaborate closely with other teams (e.g. UX design and products) as needed\n- Technical documentation (project-centric as well as intranet-centric where e.g. our developer knowledge base is a key part of daily work)\n- Take part in the recruitment process<p>Role Requirements\n- MSc or BSc degree in Computer Science\n- At least 5 years professional experience of working with modern web development\n- Proven experience of having had a leading role in development projects (lead engineer, system&#x2F;solution architect or equivalent)\n- Experience with multiple modern programming languages (e.g. Java&#x2F;Groovy, JavaScript, C#)\n- Extensive experience with JavaScript&#x2F;HTML4-5&#x2F;CSS with an emphasis on rich clients (UI-centric apps) &amp; integration with web services\n- Experience with some of the more renowned JavaScript frameworks (AngularJS, Famo.us, jQuery, RxJs, Meteor et al.)\n- Experience with server-side development&#x2F;scripting (Node.js, Java, PHP etc.)\n- Very good understanding of the web ecosystem (hosting, app&#x2F;web server, network protocols, consumer device&#x2F;browser)\n- Highly proficient with source code management (Git&#x2F;Bitbucket&#x2F;GitHub)\n- Familiarity with Agile processes, Continuous Integration &amp; Test Driven Development is a plus\n- Experience in the TV&#x2F;Media industry (Streaming services, Connected TV, IPTV) is a plus but not a necessity<p>Personal Qualities\nOn a personal level we expect you to be highly motivated and capable of initiating as well as completing tasks to meet deadlines and exceed customer satisfaction. As an ambitious team player you should share information and knowledge throughout the organization. You love your field of work and enjoy keeping up-to-date on technology (general industry news as well as bleeding edge). Maybe you have an interesting hobby-project going on? If so, we’d love to see it!<p>Good communication skills and a service minded approach is important. Excellent English communication skills are required, with additional languages being a plus.<p>Interested?<p>Please send your application with a short personal introduction and CV to careers-europe@accedo.tv\nPlease state ‘Senior Software Engineer PS STHLM’ in your application.<p>About Accedo.tv<p>Accedo is the global market leader in TV application solutions. Accedo provides applications, tools and services to media companies, consumer electronics and TV operators globally, to help them deliver the next-generation TV experience. Accedo’s cloud-based platform solutions enable customers to cost-efficiently roll out and manage application offerings and stores for multiple devices and markets.<p>Accedo is a privately held company founded in 2004 by telecom and media entrepreneurs Michael Lantz and Fredrik Andersson. Accedo is headquartered in Stockholm, Sweden with branch offices in London, Madrid, Palo Alto, New York, Los Angeles, Hong Kong and Sydney.","time":1417445795,"type":"comment"}