{"by":"UnderTheRadarKS","id":8681329,"kids":[8681538],"parent":8681040,"text":"Kansas City, USA area (Overland Park&#x2F;Olathe), Experienced C&#x2F;C++ Window Developer<p>We&#x27;re a tiny team working on Windows-based network and server monitoring products.  You&#x27;ll wear many hats including a lot of development, some QA, some customer support (great way to stay tuned in to customer pain points), maybe a bit of web dev...?<p>We have a firm no asshole rule -- life is too short to deal with egos.  If you have to work for a living, this a nice place to spend the day.  Calm, fairly quiet, professional, and very friendly.  You&#x27;ll be working very closely with me (owner&#x2F;developer).  Not looking for a yes-man -- if you \ndisagree, please speak up and defend your point.  We try very hard to do what is right when coding, dealing with customers, etc.<p>The company is boot strapped and profitable, which means no investors to tell us what to do.  We release code when it&#x27;s ready, not based on an arbitrary deadline.  We&#x27;re small, but customers (and competition) think we&#x27;re big (that&#x27;s why the company name isn&#x27;t mentioned here -- contact me via profile and I&#x27;ll send you to the website).<p>We work pretty much 8-5 Monday through Friday, hour for lunch, yada yada yada.  When we go home, we leave work at work.<p>I&#x27;m afraid we can&#x27;t sponsor visas, greencards, etc.  We&#x27;re looking for local candidates at this time.<p>Required: \n* Great attention to detail.  Your work will be seen by thousands of customers.  We never ship with known bugs.\n* Gets things done!  Looking for the best mix of speed and quality that we can find :)\n* Great C&#x2F;C++ skills with Visual Studio (Win32)\n* Very comfortable writing performant and robust multi-threaded code\n* Great debugging skills\n* Good understanding of network concepts (DNS, DHCP, HTTP at protocol level, SNMP, etc)\n* Comfortable editing HTML in notepad (i.e. not dependent on a fancy editor)\n* Basic Javascript skills\n* Good communication skills.  After implementing a feature, you&#x27;ll need to write a page of documentation about it for customers.  You&#x27;ll also talk with customers, and with the rest of the team as we discuss features, design and implementation.\n* Quick learner - the project is large and your help will be very appreciated<p>Very nice to have: \n* QT experience (hoping to someday port Windows client app to QT for use on iOS and Android as well as Windows)\n* Linux programming and admin experience\n* Python (it&#x27;s embedded in our app and used a bit -- would be nice to use more)\n* CSS -- would be nice to have someone with an eye for design\n* Comfortable with SQL\n* Experience using VMWare ESX or Hyper-V\n* D3.js exposure<p>Nice to have: \n* Experience with MFC.  Mostly just for simple dialogs\n* ASP.NET experience\n* C# experience<p>Technologies used:\n* MS SQL Server and SQLite\n* C&#x2F;C++ (Visual Studio 2012)\n* .NET (C#)\n* STL and some Boost\n* CEF (Chromium embedded browser)\n* IPWorks\n* libssh2\n* OpenSSL\n* Python\n* ASP.NET (website)\n* AmCharts and DotNetCharting\n* Sencha (ExtJS)","time":1417446071,"type":"comment"}