{"by":"itsdrewmiller","id":8681568,"kids":[8682164],"parent":8681040,"text":"NGP VAN - Boston MA or Washington, DC - Software Engineers, DevOps Engineer, Data Developers<p>NGP VAN is the world’s leading political technology firm, providing campaign and organizing technology to Democrats, progressives, and non-partisan organizations. We offer an integrated platform that combines the best fundraising, compliance, organizing, and new media products available. We are a rapidly growing company that built the voter contact and volunteer management tools used by Obama for America. Nearly every State Democratic Party in the country distributes our VoteBuilder tools to Democrats up and down the ticket, and we provide industry-leading organizing tools for labor unions, environmental groups, pro-choice advocates, civil rights activists, and international political parties across the world. Our fundraising and compliance software is used by the vast majority of Democratic candidates from the Presidential level on down, and our fast-growing new media platform has recently become the most-used platform by Democratic campaigns as well.<p>All of the positions in the title are available in either Boston or DC.<p>The positions offers competitive compensation and a strong benefits package. NGP VAN prides itself on being a progressive workplace; we have a fun and inclusive company culture, where we value teamwork, professional development, and work-life balance.  We have your usual tech company perks whether you are a veteran or just getting started in your career, including blowing off steam on a softball field, food and drinks in the office on Fridays while watching team demo videos, generous parental leave, enjoying periodic company retreats to warm places with beaches (just got back from Puerto Rico), and casual Friday every day.<p>Company Site: <a href=\"http://ngpvan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;ngpvan.com</a><p>Hit me up at dmiller at ngpvan dot com for more info or to apply.","time":1417448330,"type":"comment"}