{"by":"wwarren","id":8681593,"parent":8681040,"text":"ANDROID LEAD ENGINEER (full time, local area preferred)<p>SceneDoc - <a href=\"https://scenedoc.com\" rel=\"nofollow\">https:&#x2F;&#x2F;scenedoc.com</a> - Greater Toronto Area, Canada<p><pre><code>  What We Do\n  -----------------------------\n</code></pre>\nSceneDoc is a smartphone&#x2F;tablet-based software platform which provides law enforcement and public safety personnel a highly secure, accurate and consistent means of documenting crime, accident and other incident scenes.<p>Our platform is comprised of a highly configurable mobile application together with cloud-based backend and administration system<p><pre><code>  What we&#x27;re looking for\n  -----------------------------\n</code></pre>\nA highly motivated Android expert who can manage the development of our Android mobile offering (onshore&#x2F;offshore team). The app you help to create will be in the hands of front line law enforcement and public safety officers documenting real incident scenes.<p>We&#x27;re looking for people with the ability to really hone in on the security aspects of our platform and help to ensure that our app is rock solid, stable, secure and as bug-free as possible.<p>You&#x27;ll be working closely with the engineering teams for the server side and the iOS application so ensure that the platform is consistent. You&#x27;ll be helping to make big decisions that affect the roadmap of all our core product offerings.<p><pre><code>  Our tools\n  -----------------------------\n\n  - Git&#x2F;GitHub\n  - Jenkins for builds and CI\n  - Apache Thrift for our API\n  - Java\n  - Toolchain&#x2F;IDE up to you!\n\n  Location&#x2F;Environment\n  -----------------------------\n</code></pre>\nAll our engineering people work remotely 2 days per week and work together at &quot;The HiVE&quot; in Burlington (<a href=\"http://burlingtonhive.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;burlingtonhive.com&#x2F;</a>) the rest of the time (on average). We&#x27;d prefer someone who can also handle this arrangement.<p>Email me at will.warren@scenedoc.com if interested, I&#x27;d love to talk to you!","time":1417448585,"type":"comment"}