{"by":"isojon","id":8681139,"parent":8681040,"text":"iOS &amp; Full Stack positions (full time)<p>Thirty Labs  |  <a href=\"http://thirtylabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;thirtylabs.com</a>  |  New York, NY (Flatiron) - A new company that builds companies<p>Contact: jd@thirtylabs.com for more info.<p>[What We Do]<p>We create companies collaboratively. Working in Thirty Labs means the opportunity to create multiple prototypes, apply lean methodologies, and join the founding team of a product that genuinely excites you.<p>We got started as a partnership between Betaworks (the original startup studio in NY), Fred Seibert (the first Creative Director of MTV, Producer of Adventure Time), and Advancit Capital, to tackle the ridiculous number of opportunities in consumer video.<p>Studio teams consist of two Engineers and one UX&#x2F;Designer. We are intensely collaborative within this team and are looking for passionate, product focused Engineers.<p>[iOS]<p>- Excellent Objective-C skills, Swift experience.<p>- Exceptional ability to command and implement every facet of an App, from business logic, potentially complex signal processing, networking, store, UI and back again.<p>- Solid experience with mobile video.<p>- 5+ years of relevant work experience.<p>- Great communication skills and strong love of collaboration.<p>- Passion for growing your skills, tackling interesting work and challenging problems.<p>- Experience with DSP a major plus.<p>- Solid experience with C++ &amp; C, a plus.<p>- Experience building simple server-side APIs to feed your App data a plus.<p>[Full Stack]<p>- Strong knowledge of front-end development; JavaScript&#x2F;CSS&#x2F;HTML.<p>- Strong knowledge of Ruby and&#x2F;or Python.<p>- Strong knowledge of Rails and&#x2F;or Spring frameworks.<p>- 5+ years of relevant work experience.<p>- Exceptional software engineering knowledge; OO Design Principles.<p>- Great communication skills and strong love of collaboration.<p>- Passion for growing your skills, tackling interesting work and challenging problems.<p>- Experience deploying to cloud environments a plus.<p>- Experience in test first development and pair programming a plus.","time":1417444586,"type":"comment"}