{"by":"bijanv","id":8681369,"parent":8681040,"text":"EventMobi - Toronto, Canada (Full time, no-remote)<p>=================<p>Looking to hire Web &amp; Mobile (Mobile Web &#x2F; Cordova) Software Engineers, QA Managers, Engineering Team Leads. Email me at bijan@eventmobi.com<p>==================<p>We at EventMobi develop an event technology platform to help events &amp; conferences create their own mobile apps, event registration, live polling, gamification, and more to manage their events more easily.<p>We’re not your typical startup, we’re completely self-funded with a team of ~55 in Toronto and Berlin and yet with no outside capital we’re massively profitable and on an incredible growth path with companies like Intel, Disney and the LinkedIn using us for their event app needs.<p>We use a distributed SOA architecture exposed through a (Python) RESTful API to feed our Node &amp; AngularJS applications – from our mobile apps, to the app-building services, real-time chat &#x2F; mapping services and tons more.<p>In the past year we’ve more than tripled our growth &amp; our software now services 5000+ events and millions of users worldwide. We’re expecting that growth to continue again (while still being bootstrapped with no funding) and if you are interested in helping us scale, and meet the next set of challenges, let’s chat!<p>We&#x27;re a very fast-paced company, and we need energetic, creative individuals looking for an opportunity to grow with a young startup, get your hands dirty, and provide your insight in all aspects of cloud services, mobile and web development, and help with every aspect of a startups’ technology infrastructure. Hopefully you also have some familiarity with our tech stack - Python, AngularJS, NodeJS, MySQL, Redis, WebSockets, RSpec, Docker, Ansible as our main tools.<p>You can get to know us better through our video <a href=\"http://www.eventmobi.com/careers/#video\" rel=\"nofollow\">http:&#x2F;&#x2F;www.eventmobi.com&#x2F;careers&#x2F;#video</a> or you can email me to chat more in detail! bijan at eventmobi com","time":1417446454,"type":"comment"}