{"by":"mikepk","id":8682494,"parent":8681040,"text":"Web Programmer, Developer, Hacker | Smarterer | Boston, MA | mikepk@smarterer.com | Full Time<p>Smarterer (a Pluralsight company) - <a href=\"http://smarterer.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;smarterer.com&#x2F;</a>\nOne of Entrepreneur Magazine&#x27;s Brilliant 100 - <a href=\"http://www.entrepreneur.com/article/233888\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entrepreneur.com&#x2F;article&#x2F;233888</a><p>Make a difference. Change the world. Have fun. Do something important.<p>Smarterer gives people unprecedented understanding of what they know and what their teams and organizations know.<p>We are looking for creative web programmers, developers and hackers to join our product team. Ideally you are a versatile technologist who loves to build web products, especially (but not exclusively) if you have Python experience. Our stack is primarily Python, SqlAlchemy, Backbone and CoffeeScript.<p>Smarterer is doing something unique and important. We&#x27;re approaching a point where traditional university credentialing isn&#x27;t enough. Skills are changing too quickly and what makes someone effective in a role or job is evolving. New roles appear daily that no (or few) traditional universities have courses for. People are acquiring more and more skills through non-traditional means. Companies are finding it increasingly difficult to close the &quot;skills gap&quot;.<p>How do you show what you know?<p>Smarterer has created an innovative, machine learning, crowd-sourced testing system that will disrupt how people think about skills. Don’t let our name fool you, while our system is fun, our unique, patent-pending, technology is also deeply rooted in scientific modern testing theory.<p>Smarterer is enabling a revolution: in how the enterprise manages their teams and talent, in the changing job marketplace, and in the way people measure their own skills and share that knowledge.<p>We were recently acquired by Pluralsight (<a href=\"http://pluralsight.com\" rel=\"nofollow\">http:&#x2F;&#x2F;pluralsight.com</a>)! <a href=\"http://blog.smarterer.com/pluralsight-acquisition/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.smarterer.com&#x2F;pluralsight-acquisition&#x2F;</a> Still driving to the same vision but now with a partner that really gets it!<p>Interested? Contact me at mikepk@smarterer.com","time":1417456395,"type":"comment"}