{"by":"cairo140","id":8682362,"parent":8681040,"text":"TATCHA • WEB SOFTWARE ENGINEER • SAN FRANCISCO, CA<p>Email careers@tatcha.com.<p>-----<p>ABOUT US<p>TATCHA is a young, innovative luxury beauty company based in San Francisco with a focus on E-Commerce excellence. We&#x27;re growing our web team to build out the next generation of innovative features for our website and tech ecosystem to delight our customers all around the world.<p>-----<p>ABOUT OUR TECHNOLOGY<p>• Modern LAMP&#x2F;PHP stack\n• ExpressionEngine and Magento\n• Grunt&#x2F;Compass&#x2F;SASS asset pipeline\n• jQuery&#x2F;Angular.js frontend<p>-----<p>ABOUT THE POSITION<p>TATCHA is a small and growing company, so you would be joining as a key member of the team, owning features from inception to deployment to maintenance, and being responsible for major parts of our web infrastructure.\nOn our web team, you would be deploying features to our customers on a daily basis. Here&#x27;s an example of some of the challenges we&#x27;re building for right now:<p>• Introducing live interactive audio and video skin consultations and checkout assistance in the browser.\n• Building and iterating on beautiful interactive brand introduction web experiences on desktop and mobile.\n• Revising our fragment and full-page caching structure to deliver static and catalog pages lightning fast.<p>-----<p>SKILLS AND REQUIREMENTS<p>• 4+ years of professional experience building websites and web apps\n• Fluency in HTML&#x2F;CSS&#x2F;Javascript, ideally also in Bootstrap, jQuery, and Angular.js\n• Familiarity with Grunt asset pipeline or comparable frontend frameworks (Sprockets, Rails, etc.)\n• Experience with full LAMP stack or comparable (e.g., RoR) environment\n• Proficiency in maintaining a modern webdev pipeline or willingness to learn; our pipeline includes scrum, Trello, git (BitBucket), Cloudflare, zero-downtime rollouts, and sync and setup scripts<p>-----<p>We&#x27;re looking for creativity, intelligence, and initiative, and we care about that much more about that than experience with our specific stack. If you&#x27;re interested in joining a fantastic team to own and build our next generation of web experiences, please write to us at careers@tatcha.com.","time":1417455311,"type":"comment"}