{"by":"Michael_Docker","id":8682183,"parent":8681040,"text":"Docker - San Francisco\nI&#x27;m hoping people are somewhat familiar with Docker... but if not:\nAt Docker Inc, we believe that containerization is the next big thing, the tool which will be part of every developer and sysadmin toolbox. What&#x27;s &quot;containerization&quot;? The name comes the LXC technology (Linux Containers), and the technique is also known as &quot;Lightweight Virtualization&quot;.<p>That&#x27;s why we recently launched Docker (<a href=\"http://www.docker.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.docker.com&#x2F;</a>) &amp; Docker Hub (<a href=\"http://hub.docker.com\" rel=\"nofollow\">http:&#x2F;&#x2F;hub.docker.com</a>), an Open Source tool enabling anyone to run those Linux Containers very easily &amp; a community Hub for the community to organize, share and create images publicly as well as privately. Containers boot 1000x faster than virtual machines; their disk and memory footprint are also much lower; and they work on virtually all current platforms (from physical servers to public cloud instances). We think that they are the future of virtualization, and will soon become ubiquitous.<p>Convinced? Then fork the repo on github (<a href=\"https://github.com/docker/docker\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;docker&#x2F;docker</a>) and have a look at the code. Not convinced? Then check the website (<a href=\"http://www.docker.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.docker.com&#x2F;</a>), which contains more details, demos, and screencasts. Excited about this? Then join our engineering team!<p>We&#x27;re hiring for:\n- Python (Django, Flask, Twisted, etc.) Web Engineers\n- Go (golang) \n- FE (javascript, ideally react.js)\n- Security Engineering<p>As well as many other positions. If you think  you&#x27;d be a great fit for Docker, I&#x27;d love to check out your profile. \nwww.docker.com&#x2F;company&#x2F;careers or jobs@docker.com<p>Cheers,\nMichael\nDir. Technical Recruiting","time":1417453613,"type":"comment"}