{"by":"tharshan09","id":8682858,"parent":8681040,"text":"BroadConnect - Downtown Toronto, Canada - Graduate&#x2F;Co-Op&#x2F;Full-Time<p>SUMMARY<p>Our engineering department functions like an independent startup, with financial backing from an established company with a healthy bottom line.<p>We&#x27;re looking for someone to help with front end development - notably, visualization of data generated from our back end and big data team.<p>Experience with Angular, D3 and REST is an asset, but your eagerness and ability to learn trumps all!<p>You should consider yourself a full stack engineer, despite focusing on front end, as our dev culture strives to have everyone learn a bit of everything.<p>DETAILS<p>We are hiring full stack engineers (DevOps experience is greatly valued)<p>About Us<p>The parent company is a telecom provider with offices and subsidiaries in Canada, USA and UK. Our software engineering group functions more or less as a startup of the parent company, addressing specific pain points in the telecoms industry. We apply lessons and tactics from the fast the fast moving consumer web to bring great UI&#x2F;UX to the enterprise space.<p>We are small engineering team looking to expand rapidly by hiring smart people. Our focus is on keeping up with best practices and staying DRY. We strive to create a great culture where learning is just as important as “doing” (i.e. grunt work).<p>About You<p>You are software engineer with a desire to improve yourself. You enjoy working on challenging tasks but also knows that some grunt work needs to be done from time to time. You are ideally a full stack engineer who is as comfortable with the frontend as the backend. You enjoy reading up on best practises and keeping with the fast past world of web development. You should strive to write production ready code (DRY), but would be willing to go back to refactor when you feel it&#x27;s necessary.<p>Technology Stack<p>- Python&#x2F;Django<p>- AngularJS<p>- Redis<p>- Postgres<p>You will get to work with us in the heart of downtown Toronto on University Avenue. If this sounds interesting, please contact me: terryhong@gmail.com","time":1417459752,"type":"comment"}