{"by":"diafygi","id":8682429,"parent":8681040,"text":"Python&#x2F;Javascript Developer | UtilityAPI | Oakland, CA | daniel@utilityapi.com | Clean Energy sector<p>==Company Description==<p>We are a white-label SaaS that is used by solar and energy efficiency companies to collect their customer&#x27;s utility bill and usage data automatically. Our service enables these companies to provide instant quotes and continuous monitoring of their customers savings, which lowers soft costs and accelerates the sustainable energy industry.<p>==Job Description==<p>You will be in charge of writing tools, scripts, and libraries that translate utility data formats to our API format. Often these utility data formats are complex and unique to each utility (pdf bills, xml data, csv data, etc.), so you will need to be very clever in collecting and parsing a huge variety of formats. Also, these scripts can break unexpectedly when utilities change their interfaces, so being able to update them quickly is important. We don&#x27;t get paid by our clients unless our service actually works.<p>You will be working alongside me, Daniel Roesler, and my co-founder, Elena Lucas, in our office at the SfunCube in downtown Oakland. Our current codebase is written and maintained by me. It&#x27;s well organized, documented, and tested, and I will continue code along with you.<p>The SfunCube is a space specifically dedicated to solar software companies, and the community there is fantastic. We have a roof deck, and all the desks are solar panels! Our building is right around the corner from the 19th St BART stop, so commuting from pretty much anywhere in the bay area is easy.<p>==Experience Required==<p>No years of experience, education, or certification requirements, but you do need to be able to convince me that you know and have experience with:<p>* PGP (encryption)<p>* Javascript (not JQuery, vanilla javascript)<p>* Python (vanilla python)<p>* Django (web framework)<p>* Celery (task queue)<p>* Redis (caching)<p>* PostgreSQL (database)<p>* Ubuntu&#x2F;Linux (server OS)<p>* Other (side projects, hackathons, hobbies, stuff you do for fun)<p>==Compensation==<p>Depending on experience and ability, our salary range is $80k-$120k with 1-2% stock options (I hate it when job postings don&#x27;t include salary). If you are located outside of the bay area, we will also pay moving expenses.<p>==How To Apply==<p>Email me a cover letter and a GnuPG v1 PGP-encrypted pdf resume. Please include links to your github, bitbucket, or personal side project website (for reference, mine is daylightpirates.org).<p>==For Solar Skeptics==<p>In the last few years, the solar industry reached &quot;grid parity&quot;, which means that the unsubsidized installed cost is now cheaper than buying power from the grid. That&#x27;s why this industry is the fastest growing industry in the country. This isn&#x27;t some subsidy-dependent industry anymore. We work hard and we make real money (while conveniently also saving the planet).","time":1417455855,"type":"comment"}