{"by":"taggartbg","id":8682848,"parent":8681040,"text":"Insightpool - Atlanta, GA\n<a href=\"http://insightpool.com\" rel=\"nofollow\">http:&#x2F;&#x2F;insightpool.com</a><p>COMPANY<p>Insightpool is the audience cultivation and conversion platform used by the world’s most innovative companies. Insightpool’s platform intelligently predicts the ideal people and precise actions to drive measurable impact. Through proprietary predictive analytics technology, Insightpool leverages demographic data, identifies and activates brand advocates to optimize network effects and real ROI conversion. Launched in 2013, Insightpool is headquartered in Atlanta, Georgia. Our technology is deployed by the world’s biggest brands, including Coca-Cola, The Home Depot and Warner Brothers.<p>PRODUCT<p>A collection of services including a Rails API, a Flux &#x2F; React client, various Go workers all tied together with Sidekiq, a handful of data science projects, and a few others make up our platform.  We love experimenting with new technologies and are always looking towards the future.<p>YOU<p>Insightpool&#x27;s Engineering team is working on big problems; the kind of challenges that give you bragging rights, but we&#x27;re nowhere near finished. Our greatest accomplishments are still waiting for you to build them. We&#x27;ve got a huge vision for what&#x27;s ahead, but as the team is still quite small, you&#x27;ll be owning entire efforts. Not only will you be joining talented teammates, but you&#x27;ll be both a trailblazer and a mentor to many engineers to come. Right now, we&#x27;re looking for people that can fill the gaps in technology when they find them. Having strong beliefs in loosely coupled applications, using the right technologies for the job, and delivering scalable and robust software solutions.<p>If you&#x27;re experienced in web technologies and passionate about problem solving and building a product, check out our listing here: <a href=\"http://www.insightpool.com/careers?gh_jid=20542\" rel=\"nofollow\">http:&#x2F;&#x2F;www.insightpool.com&#x2F;careers?gh_jid=20542</a>","time":1417459697,"type":"comment"}