{"by":"cce_","id":8682099,"parent":8681040,"text":"<p><pre><code>    ##\n    ## AppNeta - Providence, RI and Boston, MA\n    ##   application performance monitoring startup seeks engineers interested\n    ##   in making the web faster\n    ##\n</code></pre>\nAppNeta is an application performance company that strives to elegantly answer questions about performance that developers and users face each day.  We make TraceView, which enables distributed tracing (like X-Trace, Google Dapper, or Twitter Zipkin) for all major web servers, frameworks, languages, and browsers, and provide a service that collects and analyzes that data to provide beautiful charts, graphs, heatmaps, and request detail that help our customers better understand their application performance in real time.<p>We are currently looking for full-stack and backend-focused engineers who are interested in building innovative performance tools and helping us scale to meet our ever-increasing faucet of customer traffic -- we currently process tens of thousands of events per second.  Our frontend is built with D3.js and Angular, and our backend is almost entirely Python, a bit of C++, MySQL, RabbitMQ, EC2, DynamoDB, Google BigQuery, S3, SQS, Hadoop, Celery, SQLAlchemy, etc.<p>We sit atop mountains of data and strive to provide intelligent, actionable insights for our customers about the performance of their app&#x27;s code &amp; servers. Processing &amp; visualizing it all at scale is a big challenge, and we’re looking for talented engineers to help us.  We&#x27;re especially interested in engineers with experience dealing with large amounts of data in Python.<p>TraceView grew out of a Google-Ventures-funded startup called &quot;Tracelytics&quot; and continues as a tight-knit, smart team backed by a strong, growing company that is investing heavily in our product&#x27;s future.  Our application engineering team is made up of several engineers each in Boston and Providence, with our instrumentation team based in Vancouver.<p>For more info: <a href=\"http://www.appneta.com/about/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.appneta.com&#x2F;about&#x2F;careers</a>\nor contact me: Chris Erway, Chief Architect (cce@appneta.com)","time":1417452983,"type":"comment"}