{"by":"hectorals","id":8682407,"kids":[8682983],"parent":8681040,"text":"Senior Software Engineer - C++ | Ripple Labs | Remote within \nthe US (select states) | careers@ripple.com<p>=======<p>Named one of the 50 Smartest Companies by MIT Technology Review, Ripple Labs is an 80 person startup backed by prominent investors, such as Google Ventures, Andreessen Horowitz, Lightspeed Venture Partners and IDG Capital Partners. The original developers of the Ripple protocol, we now support its growth by contributing code to the open-source software, as well as recruiting and developing tools for financial institutions and payment networks to use Ripple.<p>Ripple is an Internet protocol that interconnects the world’s financial systems to enable the real-time, secure transfer of funds in any currency. As settlement infrastructure, Ripple transforms and enhances today’s financial systems. Ripple unlocks assets and provides access to payment systems for everyone, empowering the world to move value like information moves today.<p>The open source rippled peer-to-peer payment server is the high performance solution that puts the power of payments in the hands of individuals. We’re in need of talented developers to help scale the technology. It’s written in C++, multi-threaded, and uses much of the modern idioms of C++. Prospective candidates should be ready to solve complex problems and able to produce polished code the entire world will see and subject to security audits.<p>Our new C++ developer will play an integral role working with the current team to maintain, watch over, and develop new features for the Ripple Protocol. At it’s heart, Ripple a high performance peer-to-peer decentralized payment server and we’re after passionate individuals to nurture the core of our technology, bringing Ripple to the next level.<p>This is remote based position. You must be based in or willing to be based in California, Nevada, Texas, Oregon, Washington, New York or Florida.<p>=======<p>What you look like:<p>A long work history developing with C++ (10+ years is ideal)<p>Experience writing APIs and accompanying documentation.<p>Anyone who can claim to be a master of template metaprogramming<p>History of developing high-traffic, high-volume distributed applications<p>A hacker mentality is strongly preferred, no degree necessary, only skills and experience<p>Bonus Skills:<p>Expert at understanding and writing C++ templates<p>Knowledge of boost::asio socket programming<p>Experience with synchronization in multithreaded applications<p>Worked on other open source C++ projects on GitHub (proud of your code and want to share it)<p>Has worked with C++ programmers in a team setting<p>=======<p>What we offer:<p>Competitive salary and equity\nFully paid medical and dental insurance for employees, 50% contribution for spouses and dependents\nTake time off when you need it - unlimited vacation policy\nIndustry-leading maternity and paternity leave policies\nWork with some of the best - early Bitcoin pioneers and cryptographers, ex-NASA engineers, ex-Fed regulators\nThe opportunity to change the way we transact<p>=======<p>Please email careers@ripple.com for more details.","time":1417455636,"type":"comment"}