{"by":"jdotjdot","id":8682789,"parent":8681040,"text":"Campus Job || New York, NY || www.campusjob.com&#x2F;joinus || joinus@campusjob.com<p>Hiya! We&#x27;re Campus Job, the first and largest online marketplace for college students to find part-time jobs and internships during the school year, and for businesses to find students to hire for short-term work. The website (soon to include a mobile app) launched 3 months ago, and we&#x27;ve since garnered tens of thousands of student users (across over 1100+ schools), and 20K+ job listings across 500+ companies. Campus Job has received some great press (from both national and campus-specific outlets) and launched a student-made promo video (<a href=\"http://bit.ly/1oiSobe\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1oiSobe</a>). The NY-based company is now five full-time employees, and over 150 Campus Reps, but we&#x27;re looking to grow to a team of ten by the end of December. Come help students get meaningful part-time work and change their lives for the better!<p>Email us at joinus@campusjob.com, and please tell us your favorite cheese!<p>Engineering philosophy:<p>* All of our decisions are data-driven * Obsessed with user experience and design * Continuous deployment * Everything revolves around making a beautiful product that helps people<p>Our Culture and Office:<p>* We focus on making students&#x27; lives better; everything else comes second * We work hard and move very quickly  * Obsessed with user experience and feedback * Fanatical customer support * Strong focus on learning new technologies, code review, and pair programming * Free lunch on Fridays if you eat with the team * Beautiful office overlooking Union Square * We all love cheese!<p>=========================<p>Senior AngularJS developer<p>* Significant experience with AngularJS and love of diving deep into the framework * Skilled web developer (HTML, CSS3) * UX and design sensibilities (portfolio a plus) * Experience with mobile optimization * SASS * Knowledge of git or other version control tools * Nice-to-have: Adobe Photoshop and&#x2F;or Illustrator * You love college!<p>=========================<p>Backend Engineer<p>* Significant experience with Python and Django * Experience with SQL (query optimization even better) * At least 2 years&#x27; work experience at a startup or tech company * Basic or better web development skills (you should be able to put up a web page) * Experience with or building REST APIs * Experience with Django Rest Framework or DevOps is great to have * Experience with data science and analysis is also a plus * You love college!<p>=========================<p>Junior Front-end Engineer and Designer<p>* Expertise with HTML and CSS * Javascript expertise a plus * AngularJS expertise even more of a plus * Great design and UI sensibilities (please send your portfolio!) * You obsess over creating the best possible user experience * You love college!<p>=========================<p>iOS engineer<p>* Significant experience with building native iOS apps * Great eye for design and UX * You&#x27;re obsessed with performance and creating an unparalleled user experience * You love college!","time":1417459076,"type":"comment"}