{"by":"erex78","id":8682438,"kids":[8682746],"parent":8681040,"text":"Mapsense Position: Backend Engineer<p>Keywords: INTERN, VISA, FULLTIME.\nMinimum education: Bachelor&#x27;s degree in CS&#x2F;EECS.\nMinimum experience: 2 years.\nUseful to know: Java, Maven, ZooKeeper, MongoDB, Lucene, Git.<p>Tone A (professional):<p>The backend team at Mapsense is a small but highly motivated group building scalable tools for geodata analysis. We&#x27;re looking for an independent, experienced backend engineer to join our team and and contribute while learning the infrastructure. An ideal candidate would be comfortable with designing and implementing web APIs; building and testing autoscaled services; and being productive, professional, and personable on a daily basis.<p>Tone B (nerdy):<p>There&#x27;s a word to describe the freezing of a machine that executes billions of electronic instructions per second, then examining its memory&#x27;s contents bit, by, bit: debugging. If hitting breakpoints sends chills down your spine, you&#x27;re probably cut out for backend engineering at Mapsense. Hack away at the backend of a complex but intuitive geodata analysis API, implemented as a distributed, autoscaled nexus of modern open source technologies. And in case joining a team of intelligent, highly motivated code ninjas isn&#x27;t enough, we have one more guarantee: consider boredom a thing of the past.<p>Tone C (cute):<p>The one thing that sets Mapsense apart from all the other geodata startups is the sheer popularity of our cute office dog, Amos. To be honest, our backend engineering team is a little jealous of all that attention. They&#x27;ve already developed a versatile but highly intuitive API for geodata ingestion and analysis, all while placing massive emphasis on documentation, testing, and teamwork. But to really shine, they need some help! Will you be the next independent, experienced engineer to join the backend ranks and help surpass Amos&#x27; renown once and for all?<p>Tone D (challenging):<p>Tired of companies living off of boring CRUD APIs with a single, static database? So are we. The backend engineering team at Mapsense is building a distributed, scalable backend architecture to support the ingestion and analysis of massive amounts of geodata, but writing well-designed, documented, and fully tested code isn&#x27;t easy. That&#x27;s why we&#x27;re only hiring highly motivated, independent engineers to join a tiny backend team always willing to commit to quality. It won&#x27;t be easy, but nothing worth doing ever is.<p>Tone E (meaningful):<p>Help Mapsense revolutionize the process of geodata analysis by joining our backend engineering team in developing an incredibly versatile tool with use cases in a variety of industries, from climate to marketing to military. You&#x27;ll have the opportunity to jump into a robust, scalable system built on the latest open source backend technologies, and work with a motivated group of engineers. Expect to grow from interesting engineering problems every day while transforming the world one data set at a time.","time":1417455961,"type":"comment"}