{"by":"aglp2010","id":8682083,"parent":8681040,"text":"LastPass || Headquarters: Fairfax, VA near Washington, DC || www.LastPass.com&#x2F;jobs<p>Hey there! We&#x27;re looking for energetic, driven, talented engineers to join us at LastPass. LastPass is the leading password manager, and we produce an award-winning product that helps millions around the world solve their password security problems. We’re a nimble, passionate team. We work hard, continuously challenging ourselves to grow. We’re a leader in our space and product innovation is at the core of our mission. Founded in 2008, we’re a growing, profitable, startup-style software company.<p>Perks include:<p>* Great location – we’re situated in Fairfax, VA near the nation’s capital.<p>* A new, branded office next to an area with plenty of restaurants, cafes, and shopping<p>* Energetic, start-up environment<p>* Fully stocked refreshments &amp; snacks, as well as catered lunch every Wednesday<p>* Great benefits package, including health plan and 401K with company match<p>* Flexible holidays – including your birthday off!<p>* Accessible by public transport (bus and metro)<p>Link to current openings: <a href=\"https://lastpass.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;lastpass.com&#x2F;jobs</a><p>Please send your resume to jobs@lastpass.com.<p>=============<p>Software Engineer, iOS<p>* B.S. in Computer Science or related technical field or equivalent experience<p>* Experience with mobile web application development<p>* Very comfortable with unit testing and rapid release cycles<p>* Rapidly create prototypes, synthesize feedback and develop a production quality release candidate<p>* Development experience in Objective-C<p>* Experience integrating iOS Apps with APIs and other web services via REST<p>* Deep knowledge of the most used frameworks, like UIKit, Foundation, MapKit, Social, CoreGraphics, CoreData<p>* Strong understanding of the Apple Human Interface Guidelines for iOS<p>* Experience in using the principal iOS Design Patterns\n* Understanding of certificates, encryption, publishing and other security based concepts<p>* Experience collaborating with designers on vision execution<p>* Passionate about creating 5 Star Apps &amp; Experiences to a wide customer base<p>* An active and enthusiastic LastPass user (we won’t judge you on how long you have used LastPass, but you should join before submitting your resume!)<p>* Proximity to Fairfax, VA (DC Metro Area)<p>=============<p>Software Engineer, MacOS<p>* B.S. in Computer Science or a related field or equivalent experience<p>* Skilled Objective-C, Cocoa GUI programmer<p>* Experience with unit testing and rapid release cycles<p>* Experience working with WebKit and web technologies such as JavaScript, CSS, HTML5<p>* Rapidly create prototypes, synthesize feedback an develop a production quality release candidate<p>* Experience with CoreData and&#x2F;or SQL databases<p>* Passionate about creating 5 Star Apps &amp; Experiences to a wide customer base<p>* An active and enthusiastic LastPass user (we won’t judge you on how long you have used LastPass, but you should join before submitting your resume!)<p>* Proximity to Fairfax, VA (DC Metro Area)<p>=============<p>Front End Web Developer<p>* B.S. in Computer Science or a related field or equivalent experience<p>* Work closely with designers and user experience analysts on bringing mockups or wireframes through development to final delivery. This includes graphics optimization and the use of HTML, CSS, JavaScript, jQuery, AJAX, and XML. Knowledge of PHP is also a huge plus.<p>* Develop and maintain landing pages for campaigns as well as working on our company website and framework.<p>* Develop and maintain the production, graphical, and compression standards for the highest possible quality, navigational ease, consistency in look and feel, and content architecture of our websites.<p>* Experience with Responsive Web Design<p>* Solid experience with testing and developing across multiple browsers while maintaining a consistent experience<p>* Optimize for better performance across all the browsers, regions and languages we support<p>* Visual implementation and reviews of pages to make sure every detail is correct<p>* An active and enthusiastic LastPass user (we won’t judge you on how long you have used LastPass, but you should join before submitting your resume!)<p>* Proximity to Fairfax, VA (DC Metro Area)<p>* Please include a portfolio or links to examples of your work.<p>=============<p>Software Engineers, Junior and Senior<p>* B.S. in Computer Science or a related field or equivalent experience<p>* A command of these technologies: Javascript, HTML, CSS, PHP<p>* C++ is a nice bonus<p>* Experience on several platforms (At minimum Windows and Mac or Linux) — LastPass builds for 12 major platforms, covering a number of versions for many of them<p>* An active and enthusiastic LastPass user (we won’t judge you on how long you have used LastPass, but you should join before submitting your resume!)<p>* Proximity to Fairfax, VA (DC Metro Area)<p>=============<p>Regional Sales Director (San Francisco, CA)<p>* 5+ years of experience selling security products and&#x2F;or web-based services to technical, operational and&#x2F;or security buyers.<p>* An extensive professional network in the security and IT space.<p>* A consistent track record of quota achievement.<p>* A demonstrated ability to run a sales territory, including prospecting, opportunity management and forecasting.<p>* The ability to build executive relationships, articulate product and business strategies, create demand and close deals.<p>* The ability to effectively source and market to prospect lists, and initiate deals through cold outbound prospecting efforts.<p>* Strong relationship management, communication and presentation skills.<p>* Strong technical aptitude.<p>* Location: Home office in the San Francisco metro area","time":1417452851,"type":"comment"}