{"by":"dford87","id":8682734,"parent":8681040,"text":"InfoScount - San Francisco, CA <a href=\"http://infoscout.co/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;infoscout.co&#x2F;careers</a><p>* Who we are<p>Have you ever wondered who eats Spam? Or how about whether or not those new flavors of Red Bull actually get more people to buy Red Bull versus just giving existing Red Bull drinkers more flavors to choose from? Wish you knew why people pay more for Calvin Klein shirts than Ralph Lauren? And has Best Buy really turned into Amazon&#x27;s showroom?<p>You&#x27;re not alone. Those brands &amp; retailers wonder about those questions and thousands more that InfoScout is uniquely positioned to answer. Thanks to more than 1-million users of our Receipt Hog, Shoparoo, ReceiptBin and Out of Milk apps, InfoScout captures more information about American&#x27;s shopping patterns across all retailers than any other company. We do this by incentivizing app users to snap pictures of their shopping receipts and answer related surveys to understand the &#x27;why behind the buy&#x27;. Our use of computer vision, crowdsourcing &amp; big data analytics allow us to extract insights at a scale and depth never before possible for clients like Procter &amp; Gamble, Anheuser Busch, Walmart &amp; Visa.<p>* Senior Mobile Backend Engineer<p>We are looking for a self-starting engineer with a deep desire to learn &amp; previous experience developing web applications ground-up.<p>The ideal candidate for this role is comfortable across the stack knowing their way around server-side web frameworks, leveraging relational databases to get the job done, tweaking web servers, building cross-device UX &amp; building scalable APIs in Python (or other scripting language). We believe that mobile&#x2F;web experiences are the future, and we&#x27;re building a team that has deep engineering chops to take on some of the most ambitious projects.<p>To help accomplish this goal, you will have the environment to execute on your vision, the tools you need to rapidly iterate through your ideas and a dedicated team to help make you and your work better.  In addition to writing quality software, we&#x27;re looking for individuals who also enjoy the other aspects of building a new company: designing features, making good product decisions, programming at all levels of the stack, and the wearing of many hats.<p>* Requirements<p>- BS or MS in Computer Science or equivalent work experience\n- Experience with server-side development, especially Python\n- Execellent knowledge of javascript, CSS, HTML and full server-side web stack experience.\n- Intimate understanding of REST and building scalable APIs\n- Intimate knowledge of relational databases (MYSQL a plus)\n- Experience with multithreaded programming\n- Experience developing, releasing, and supporting backend code\n- Excellent problem solving, critical thinking, and communication skills","time":1417458592,"type":"comment"}