{"by":"JPMorganAthena","id":8683643,"kids":[8726539],"parent":8681040,"text":"JPMorgan New York &#x2F; London<p>JP Morgan is seeking a very hands-on, business-focused data scientist&#x2F;developer, who enjoys working through hard technical problems to join the Core Athena team, a highly skilled development team building and supporting the core of JPMorgan’s innovative in-house front office platform.<p>What is Athena? A modern trading and risk management system that empowers developers and engages traders through a rich development framework sitting on a globally integrated data fabric.<p>The suite of pricing and risk management tools that traders and salespeople use every day have historically been “big iron” platforms with limited interaction. Athena is designed as a unified environment based on modern architectural components: a fast and replicated object-oriented database; a powerful dependency graph; and Python and C++ for development.<p>The team has global, cross-business delivery and support responsibility, and emphasizes technical excellence and business focus.  We work closely with front-office, quant and other tech teams to deliver excellent solutions to the trading desk<p>Responsibilities include but are not limited to:<p>-Work on signal processing library in Athena \n-Integrate Athena Charting Framework with python pandas plotting functionality \n-Work with data science team on equity trading signals project\n-Will work closely with quant and tech teams across fixed income businesses<p>This position requires very strong development skills across platforms and languages.<p>The team works mostly in C++ and Python, so experience in either of these is a plus, but not essential.<p>Excellent engineering&#x2F;CS&#x2F;math schools&#x2F;education are preferred<p>Job functions range from hard core low-level C++ development to business specific problem solving, real-time pricing, electronic trading, deal modeling, etc.<p>To apply:<p><a href=\"https://jpmchase.taleo.net/careersection/2/jobdetail.ftl?job=140117697\" rel=\"nofollow\">https:&#x2F;&#x2F;jpmchase.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job...</a>","time":1417466574,"type":"comment"}