{"by":"bradfa","id":8683723,"parent":8681040,"text":"<a href=\"http://www.omni-id.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.omni-id.com</a> Rochester, NY, USA, Fulltime<p>Email me: andrew dot bradford at omni dash id dot com<p>* Systems Analyst *<p>Performs detailed analysis of Omni-ID’s customer processes to define the software and hardware requirements required to automate their workflows using the ProVIEW Solution. The System Analyst acts as the interface between the Omni-ID team and the customer to develop the customer requirements specification, the final test plan and the customer acceptance plan.<p>* Systems Test Engineer *<p>Responsible for the functional test, verification and quality assurance of the system test activity for ProView solutions. Performs analyses to evaluate customer’s operational needs to define system performance requirements, integrate technical parameters and assure compatibility of all physical, functional and program interfaces. Assists with and&#x2F;or performs various analyses to optimize total system of systems and&#x2F;or system architecture. Assists with analyses for affordability, safety, reliability, maintainability, testability, human systems integration, survivability, vulnerability, susceptibility, system security, regulatory, certification, product assurance and other specialties quality factors into a preferred configuration to ensure mission success.<p>* Senior Software Engineer &#x2F; Architect *<p>Duties include contributing in each area of the software development lifecycle, focusing on designing, coding and debugging application modules. The candidate should be familiar with using the Microsoft .NET&#x2F;C# programming language, SQL Database – schema and query design, Web Server, RIA Services, and workflow engine design (i.e. event bus, message queues, rules engines), and other technologies typically found in N-Tier business applications. Additional duties include requirements analysis, code analysis, software code reviews, identification of code metrics, system risk analysis and system reliability analysis, software modeling and simulation, graphical user interface design, supporting, maintaining and documenting software functionality, integrating software with existing systems, and identifying and evaluating new technologies for implementation.<p>Projects include advanced N-Tier Workflow Management system design in asset management and highly configurable workflows in manufacturing environments utilizing “Internet-of-Things” technologies built on very advanced RFID, active radio, and visual display hardware components.","time":1417467378,"type":"comment"}