{"by":"tripadvisor","id":8683847,"parent":8681040,"text":"TripAdvisor, Newton and Boston, MA; Palo Alto, CA\nEmail me at egaffen@tripadvisor.com or engjobs@tripadvisor.com or click here:\n<a href=\"http://www.tripadvisor.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tripadvisor.com&#x2F;careers&#x2F;</a><p><i></i> Senior Software Engineer <i></i>\nDo you play with APIs to build websites just for fun? Do you find it thrilling to write code that is seen by tens of millions of people? If this sounds like you, we&#x27;d love to talk to you.<p>Sound good...? Here&#x27;s what you will work on:\nTouch code at every level – from the UI, to the servlets and backend services, down to the database \nBe responsible for the code quality on your team\nMentor more junior developers\nDevelop key features on the back-end and front-end of the web site\nDevelop every level of these user-facing products using: Java, JavaScript, SQL, HTML, CSS, and several open-source technologies on the Linux platform\nWork within engineering, marketing, and our content teams to lead our continuing initiatives to maintain high content quality<p><i></i> Senior Software Engineer, Commerce <i></i><p>The commerce team builds the infrastructure that drives TripAdvisor&#x27;s advertising!  \nWe work on a diverse set of systems including our own high performance ad server, partner feed processing system and click processing infrastructure.  \nWe use the right tool for the right job including Java, Ruby and Hadoop.   Working on the commerce team you will get to work on critical systems while you will learn how internet advertising works at the world&#x27;s largest travel web site.\nDo you have a proven track record of delivering high quality results, while thriving in a quickly paced environment?<p>If this sounds like you, we&#x27;d love to talk to you.<p><i></i> Technical Manager - Mobile Booking Platform <i></i><p>Technical Manager – Mobile Booking Platform\nTripAdvisor is looking for a Technical Manager to lead the team that is building a new platform that will enable our mobile users to book a hotel, with any of our OTA partners, without leaving TripAdvisor. \nIn this role you will be responsible for management and technical direction of the team that is building the back end systems that support this new platform.","time":1417468485,"type":"comment"}