{"by":"JJMalina","id":8683155,"parent":8681040,"text":"ChatID (New York, NY) <a href=\"http://chatid.com\" rel=\"nofollow\">http:&#x2F;&#x2F;chatid.com</a><p>ChatID is a quickly growing platform for brands and consumers to directly communicate via chat across any website and on any device. Our chat product is live for select brands on Walmart.com, Sears.com and Newegg.com<p>Our current openings:<p>* Frontend Engineer - we&#x27;re building real-time communication interfaces for mobile and desktop web using Backbone.js, XMPP, and BOSH<p>* Client Services Engineer - work with frontend and client services to help technically support new and existing clients<p>* Data Engineer - help us build a data pipeline and analytics service to give our clients insights into chat and consumer behavior on retailers. (this one isn&#x27;t listed yet but if you&#x27;re familiar w&#x2F; Python and skilled in SQL, and NoSQL, please reach out to us)<p>* You can find full job descriptions for these openings at <a href=\"https://chatid.gethired.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;chatid.gethired.com&#x2F;</a> as well as other non-technical openings we have<p>About the company:<p>- We&#x27;re 16 people mostly based in NYC, but also SF and Austin<p>- NYC office is in Flatiron between Union Square and Madison Square<p>- Newegg.com recently awarded us a 2014 Eggie award for &quot;Best Marketing Platform&quot;<p>- We like contributing to open source <a href=\"https://github.com/chatid\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chatid</a><p>Technologies we use:<p>- Lua and Prosody [<a href=\"https://prosody.im/\" rel=\"nofollow\">https:&#x2F;&#x2F;prosody.im&#x2F;</a>] an open source XMPP server started by two of our cofounders, one of which is a member of the XMPP council<p>- CoffeeScript, Backbone.js, Require.js, Angular.js, D3, SASS&#x2F;LESS<p>- Python, Flask, PostgreSQL, InfluxDB, RabbitMQ<p>- Chef for infrastructure automation, but we&#x27;re working on switching over to using Ansible and Docker<p>Sound interesting? Send us an email at careers@chatid.com and feel free to reach out to me if you have any questions: jeremiah@chatid.com","time":1417462542,"type":"comment"}