{"by":"gumby","id":8684855,"parent":8681040,"text":"castAR is looking for looking for hot MEs, EEs, robot &#x2F; vision and gaming hackers in Mountain View.<p>We are a small, dedicated team of 10 hackers with experience in building hardware, software and successful companies.  If you&#x27;re a GNU hacker you might know me, or you may know one of our founders, Jeri Ellsworth, renowned hacker and maker.  We are building a fun, no bull, buzzword-free business.<p>We make amazing AR glasses that make a 3D, holographic world that springs from your table, wall or other objects.  Unlike VR, these images are part of your world: you see them mixed in with real objects and other people so you can work or play together.  You can move around freely and look at virtual objects from all sides.  Since you look at a normal distance, we don&#x27;t have the near eye issues (distortion, nausea etc) of VR and since our glasses are open and light you can wear them and play for hours.  (You can also play VR games as well).  Our focus is not only the big &quot;AAA&quot; games -- it&#x27;s in our DNA to support social, user-generated content and make it possible for hackers to do things we can&#x27;t imagine ourselves.  We have a lot of fun things in our pipeline.<p>We make and are shipping real hardware (yes, to paying customers).  To date we&#x27;re funded by our kickstarter (2.5X subscribed -- one of the first to exceed a million) and three large angels (so no high-priced, VC-diluted options yet).<p>If you enjoy hard work on fun engineering problems, come join us on the ground floor as we build the next great user experience.<p>Check out our web site <a href=\"http://technicalillusions.com\" rel=\"nofollow\">http:&#x2F;&#x2F;technicalillusions.com</a> or our kickstarter at <a href=\"https://www.kickstarter.com/projects/technicalillusions/castar-the-most-versatile-ar-and-vr-system\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kickstarter.com&#x2F;projects&#x2F;technicalillusions&#x2F;cast...</a><p>You can write to us at jobs[at]technicalillusions.com","time":1417477591,"type":"comment"}