{"by":"chris_webster75","id":8687336,"parent":8681040,"text":"Lead .Net Engineer - Astar Pets<p>Location: London, UK <a href=\"https://www.AstarPets.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.AstarPets.com</a><p>==========<p>What we Do<p>==========<p>Conceived by founders of ASOS and ACHICA Astar Pets is all about creating a fantastic experience for people who love their pets by bringing together products, services and information so they can find everything they need in a single destination lifestyle portal. To do this we&#x27;ve built a bespoke .Net marketplace e-commerce platform, written in C# using Raven DB and also integrated a classifieds services proposition into the main eCommerce proposition.<p>We&#x27;ve just closed a $500k fundraising round and having built up the largest range of products in the UK (over 11,000 products) and a strong services business (over 2000 services) we&#x27;ve seen sales accelerate well ahead of plan into xmas positioning us for fantastic growth and success in 2015.<p>========================<p>Technical Specifications<p>========================<p>The platform has been written from the ground up to include all the features you expect from a modern eCommerce site, with the additional features critical to Marketplaces baked right in. Platform highlights<p>- Built around RavenDB, a “2nd generation” document database written in and designed for .net. If you haven’t heard of it it’s well worth checking it out – it’s a real joy to use and really reduces the friction involved<p>- Dependency Injection used throughout<p>- Flexible CMS to allow custom injection of content where required<p>- Little ceremony involved; features are added with the minimum work required to get them working and working cleanly<p>- Quick and easy configuration and deployment stories<p>- Payments processed with Stripe (also a joy to use)<p>- Git used for version control<p>=======================<p>What we are Looking For<p>=======================<p>We&#x27;re looking for a Senior .Net Engineer who can take control of the existing platform and then architect, design and implement both new features and completely new user experiences as we expand the experiences and geographical reach of the site. You&#x27;ll have a wide remit to select which technologies we use to integrate the new functionality to create a fantastic customer experience.<p>===========<p>Our Culture<p>===========<p>We&#x27;re a newly established team of five Chris as CEO, Zoe, leading the buying, Mike the marketing, Emma the services and John keeping us honest on the finances, each experts in our own areas and all motivated by a desire to shake up the status quo, do new things and create great experiences for our customers and build a company turning over tens if not 100s of millions in a few years time that sets new standards for how customers shop online. As our lead Engineer you&#x27;ll become a key part of defining our destination and charting the course by which we get there<p>==========<p>Next Steps<p>==========<p>Check us out at <a href=\"https://www.AstarPets.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.AstarPets.com</a> and then email us on Chris@AstarPets.com Look forward to hearing from you.","time":1417531881,"type":"comment"}