{"by":"kedargj","id":8691926,"parent":8681040,"text":"McKinsey Digital Labs (part of McKinsey &amp; Co) - San Francisco, New York City.<p>—————ABOUT MCKINSEY DIGITAL LABS————————<p>McKinsey Digital Labs is the in-house client focused digital delivery group of McKinsey &amp; Company. MDL combines user-centered design with unparalleled business knowledge and world-class agile development skills to deliver impactful digital experiences. We are a team of passionate designers, architects and developers solving tough problems for our clients.<p>We deliver service design concepts, experiential prototypes and production-ready apps to transform our client’s businesses. Despite being part of a large, multinational organization, MDL works more like a small startup company.<p>—————————<p>We’re looking for UX Designers.<p>Role:<p>We are looking for an entrepreneurial self-starter who is self-motivated, but can also collaborate in a multi-functional team. As a designer you should be curious and creative about web and mobile design with a keen eye for  UI&#x2F; UX dynamics. You should have the ability to get things done, while also collaborating in teams.<p>It is a plus if you are interested in creating and interpreting data visualizations.<p>Do you have the passion and experience to…?<p><pre><code>   -Design consumer web quality products for mobile devices to achieve our client’s business and operational goals.\n   -Conduct and analyse user research and testing sessions.\n   -Quickly grasp user requirements and behaviors to translate them into requirements for building and refining prototypes.\n   -Collaborate with developers to build prototypes and present them to the client.\n</code></pre>\nIn your work, do you…?<p><pre><code>   -Appreciate critical feedback – give it, receive it and seek it.\n   -Obsess over details – UI consistency, microinteractions, and even project plans.\n   -Organize your thought process and communicate effectively – especially when articulating design decisions.\n   -Thrive working cross-functionally and with other designers.\n   -Be passionate about technology, data, design, users or anything really…we love passion!\n</code></pre>\nAdditional Info:<p>Work Authorisation: This position is open to all applicants currently in the United States.<p>Relocation Benefits: Applicants will receive relocation benefits.<p>Salary: Negotiable based on experience.<p>We are committed to having a meritocratic and transparent hiring process.<p>In order to proceed to the next stage of the interview process, we want to make sure that you are genuinely excited about McKinsey Digital Labs and are able to solve the types of challenges we face.<p>If you are, please do apply by taking one of the below challenges so that our managers at McKinsey can evaluate your key competencies before the interview.<p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-148/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a><p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-149/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a><p><a href=\"https://www.gapjumpers.me/questions/mckinsey-digital-labs/qs-150/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gapjumpers.me&#x2F;questions&#x2F;mckinsey-digital-labs&#x2F;qs...</a>","time":1417581352,"type":"comment"}