{"by":"flumignan","id":8692102,"parent":8681040,"text":"I work in Stanford&#x27;s central IT department <a href=\"https://itservices.stanford.edu/\" rel=\"nofollow\">https:&#x2F;&#x2F;itservices.stanford.edu&#x2F;</a> and I&#x27;m hiring a full time, permanent Linux DevOps and Systems&#x2F;Cloud Administrator.<p>There are a couple parts to this position. Primary responsibilities will be to participate among a team of sysadmins helping to manage &lt; 100 Linux systems for different departments and schools across campus: configuring, building, packaging, virtualizing, clustering, patching, maintaining, networking, provisioning, tweaking, scripting, scanning, monitoring, migrating, tuning, debugging, and troubleshooting all sorts of Linux systems.<p>The second part of the job is also really nifty. We&#x27;ll be building API-driven solutions from our SaaS investments; expand the containerization of Drupal (and eventually WordPress, maybe others) in AWS; architecting and building out interrelated services across any given cloud ecosphere (for example, tying together RDS, S3, EC2, ELB, CloudFormation, etc); migrating traditional datacenter systems into the cloud — eg, Amazon Web Services, Google Compute Engine, Azure, OpenStack. You&#x27;ll get to work with different departments, schools, researchers.<p>Working at a fancy-pants university is different. We work for the greater good. There will be no IPO. We don&#x27;t really move fast and we try not to break things (but we love clever solutions). We&#x27;re a brogrammer-free zone. We have sane, flexible working hours. We have a beautiful campus, smart people and nice benefits <a href=\"http://uhr.stanford.edu/stanford-sweeteners\" rel=\"nofollow\">http:&#x2F;&#x2F;uhr.stanford.edu&#x2F;stanford-sweeteners</a> but there&#x27;s no free dry cleaning, no kombucha bar, no free organic meals. People really like working here, and they stick around for a while. We like all sorts of candidates, especially the curious and excitable.<p>If this is something interesting, or you want to know more, email me (Noah Abrahamson) at jobs-abrahamson@stanford.edu. Here&#x27;s the official posting: <a href=\"https://stanford.taleo.net/careersection/jobdetail.ftl?job=65049\" rel=\"nofollow\">https:&#x2F;&#x2F;stanford.taleo.net&#x2F;careersection&#x2F;jobdetail.ftl?job=6...</a> with more info.","time":1417586153,"type":"comment"}