{"by":"lljf1983","id":8699444,"parent":8681040,"text":"Checkout the hottest software engineering jobs in Michigan: <a href=\"http://meetmaestro.com/culture/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;meetmaestro.com&#x2F;culture&#x2F;careers</a><p>Senior iOS App Developer<p>Maestro is seeking full-time Cocoa&#x2F;CocoaTouch Software Engineers to build custom iOS and OS X applications. Qualified individuals will be just as passionate about enhancing the user experience as they are about creating clean, efficient, and extensible code.<p>KEY RESPONSIBILITIES<p>Collaborate with strategists, designers and other developers to come up with the best solutions for each project\nEstimate relative work-effort of solutions on potential contracts\nManage time appropriately and communicate clearly to help manage work expectations\nEnsure that new code is maintainable through code-reviews and providing feedback to other developers\nMentor and teach other iOS developers (including student interns)\nJOB QUALIFICATIONS<p>REQUIRED<p>Experience and familiarity with Cocoa&#x2F;CocoaTouch Frameworks and Xcode.\nDeep understanding and experience with CoreData, CoreAnimation, CoreGraphics, and UIKit\nFamiliarity with the C-level APIs (e.g., CGPDF, CFContext)\nExperience with Asynchronous Networking APIs and consumption of RESTful web services\nVersion control system (preferably git, but subversion, mercurial, and the like also welcome)\nExperience and understanding of the localization frameworks (Apple Developer Internationalization Guide)\nAbility to accurately represent designs with code\nStrong software architecture knowledge and skills\nDESIRED<p>Experience developing in C\nExperience working with lower-level frameworks (e.g., AVFoundation, Accelerate, AddressBook)\nWorking knowledge of ReactiveCocoa (and familiarity with functional reactive programming)\nUnderstanding of the MVVM design pattern\nExperience with using Cocoapods, MOGenerator, AFNetworking, and MEFrameworks\nExperience with SceneKit&#x2F;OpenGL ES\nFamiliarity with enterprise app distribution\nKeen understanding of the code signing process and App Store submission\nCOMPENSATION<p>Base salary is dependent on experience and talent level\nCompensation package includes medical and dental insurance, prescription drug coverage, FLEX benefits and the option for disability insurance.\nADDITIONAL COMMENTS<p>Maestro is seeking to fill a full time position based out of Kalamazoo, MI, however we are open to remote employment options as well.\nLooking for the right combination of talent, chemistry, character, and passion\nPlease submit your resume and a non-trivial, working example of a complete project (NDA can be set up to protect your work, but we must see your code in action).  Access via github (or other online repository) is preferred.","time":1417704727,"type":"comment"}