{"by":"OscarPedroso","id":8735886,"parent":8681040,"text":"Z80 Labs - Buffalo, NY<p>Hi all,<p>I&#x27;m Oscar and I&#x27;m the founder of GradFly, &quot;Elance for open hardware projects&quot;.  This started a year ago out of Startup Weekend where we were finalists.  Since then, we&#x27;ve pitched live at TC Disrupt NY, Startup Fest, and recently finished a Series A fundraise (pitched to 30+ investors).<p>My short bio:<p>About this time last year, GradFly was only a couple months old.  I raised a small seed round, incorporated the business (which I thought had no legs), and had just brought on our first hire.  I&#x27;ve been checking out Reddit for some time and have received some good feedback from the rapid prototyping community which will contine to grow.<p>What is GradFly?<p>We are building an online community and repository for hardware&#x2F;software projects - from Arduino, Raspberry Pi, 3D printing, drones, version control for PCBs,  to designs in sync with code, etc. Basically, hardware and software developers join forces to work on specific hardware projects. (Say John Smith posts a project to have two arduinos communicate using WiFi Direct and he is seeking help on the WiFi part while he focuses on the motor controller stuff.)  He is willing to pay $350 to have someone work with him in parallel and speed up the project. Anyone can submit a project. We help faciliate connections and find resources, talent, and example projects to help with products or concepts that the community is trying to create.<p>Current stats: (We are still a very young company)<p>Based in Buffalo, NY\n400+ users (mostly early adopters);\nSome revenue but recently changed models to accomodate user growth;\nTeam of 2;\nCurrently part of Startup Next Toronto (Sponsored by Google Entrepreneurs);\nWaitlisted at TechStars NYC this past summer. (Made top 15);\nPartners with maker spaces, fablabs, diybio communities, and garage type groups;\nJust finished raising $700k.  (raised  $200k last year)<p>As you can see, I&#x27;m pretty transparent about things like this.  I like to keep everyting out in the open.<p>My Background:<p>Worked in Western NY for the last five years before founding GradFly.  Started in grants, college admissions, and makerspaces before throwing in the towel to become founder.  Learned to code Python on CodeAcademy and have since been improving over time. Just started tinkering with Arduino and Hummingbird. I row and swim competitvely to keep my sanity. I also speak Spanish and French.<p>Who I&#x27;m looking for:<p>Up until now, I&#x27;ve relied mostly on part-time and student developer talent to help me build GradFly. I&#x27;ve been grateful but with this recent fundraise, I need to raise the bar a tad bit.  I&#x27;m looking for folks who can and want to commit full-time to an early-stage company with room for growth and various opportunities.  I&#x27;m also looking for individuals that are passionate about where the open hardware&#x2F;software movement is heading. It&#x27;s hard to try and explain it to someone if they&#x27;re not immersed in it already. I&#x27;ve done the whole remote thing and it didn&#x27;t work out - therefore I&#x27;m looking for someone who would be willing to relocate given the right package and circumstances. I can be flexible for someone who is very curious and wants to spend a little of time figuring out a move like this.<p>All in all, I&#x27;m looking for three people:<p>1) Lead Engineer, potential CTO - (Backend) - The site is Python backend in flask using s3 for asset storage along with rabbitmq and celery for messaging and tasks. We are using redis and Postgres for temp storage&#x2F;caching and database respectively.  Currently on github using wrecker for CI and builds to deploy to heroku - where everything is hosted. We&#x27;re looking for someone who is familiar with these stacks yet is willing to push the envelope and try new things. The foundation is there, now we just need to build on top of it.<p>2) Frontend Engineer&#x2F;Designer - Frontend is built with grunt and is split between foundation and bootstrap templates with jinja2.  Styling is done in less and stylus, and we&#x27;re using plain old JavaScript and jquery.  The design on the site currently lacks but it&#x27;s only uphill from here. We have ideas about what we&#x27;d like to see but we&#x27;re open to different kinds of aesthetics out there.<p>3) Marketing&#x2F;Business Dev - Really looking for someone who has an understanding of this space and knows how to build a community and identify the right channels for hypergrowth.  So far we&#x27;ve been presenting at all types of events (makerfaires, trade showes, fablabs), reaching out to influencers, and spreading more awareness about ourselves.  The person who joins us on this end would continue to help us address the number one pain point we&#x27;re addressing.  Must be willing to travel across US, Europe, and Asia.<p>PM me with your portfolio.  Really looking forward to connecting with anyone that this might resonate with.<p>Thanks in advance for reading. I know this was long.<p>Oscar<p>@oscar_pedroso\noscar at gradfly dot co","time":1418318226,"type":"comment"}