{"by":"chriscrossley","id":8739193,"parent":8681040,"text":"Line-Up - <a href=\"http://lineupnow.com\" rel=\"nofollow\">http:&#x2F;&#x2F;lineupnow.com</a>\nLondon - Full-time, permanent.<p>Python Developer and Junior Python Developer<p>==============<p>About Us<p>Line-Up powers event discovery. Our World-leading automated event listings technology powers our iPhone app and ‘what’s on’ for global media brands.<p>- Over 25 million API requests per month across our growing network\n- One of the UK’s top events apps, launched in May 2014 and featured in Apple’s ‘Best New Apps’ 4 times\n- Our technology powers ‘what’s on’ for over 70 titles including household names: Magic FM, London24, Manchester Evening News, Irish Mirror and Daily Record\n- Seedcamp London winners and funded by top angel investors\n- Based at Warner Yard in Clerkenwell\n- We eat cake and drink beer on Fridays<p>==============<p>What we&#x27;re looking for:<p>Maker Mentality\nAre you focused on the ‘doing’; the creation of new software that you have designed and developed to engage and delight the end user?<p>Best in Show\nDoes the thought of the next release being used by millions keep you striving for higher standards? Are you keen to learn and flex your Python muscles?<p>Team Player\nSure, you love to code. Do you also seek and expect critical review of your work from your teammates? Will you be equally generous with praise and guidance for your talented peers?<p>==============<p>Skills &amp; Experience we&#x27;re looking for:<p>Python Developer &#x2F; Junior Python Developer<p>1 – 2+ years of experience in Python development &#x2F; Knowledge and experience of Python\nStrong Knowledge of HTML&#x2F;CSS\nStrong knowledge of SQL\nDegree in Computer Science or equivalent\nStrong knowledge of web technologies\nA passion for processes and best practice\nStrong, analytical approach to problem solving<p>Nice to haves:<p>Knowledge of Flask framework\nKnowledge of Elastic Search\nExperience working on REST APIs\nExperience with AWS<p>==============<p>How to apply<p>Send a CV, your Github details and links to projects you’ve worked on to: info(at)lineupnow.com","time":1418376184,"type":"comment"}