{"by":"shamidzade","id":17665082,"parent":17663077,"text":"Software Developer Position at Hala Systems (REMOTE, US-Based)<p>We are looking for a solid software engineer with experience developing single page, serverless web apps using Node. Our existing systems and current development uses AWS, so while not required, AWS experience is a big plus. This is a full-time remote position, with some limited travel. The candidate is expected to have previous remote experience or feel confident in their ability to supply the appropriate work environment, including a sufficient internet connection, appropriate workspace, and other typical remote&#x2F;home office needs. We expect availability during most of the typical work day in US time zones. This is a contract-to-hire position. The start date is ASAP.<p>Hala is a social enterprise working to transform the nature of protection and accountability in the world’s toughest places by democratiz-\ning advanced defense, sensing, and artificial intelligence technology. Hala is currently saving lives, reducing trauma, and improving<p>resilience for millions of people.\nWe are a team of 21 working together around the world to solve hard problems. Founded by a rocket scientist, an ex-diplomat, and an\nexpert in using technology for good, we hail from leading educational, research, and business institutions (including Stanford, MIT,\nWharton, Cambridge, UCL, Imperial, LBS, MIT-Lincoln Laboratory, Johns Hopkins Applied Physics Lab, Deloitte, Booz, and the\nWorld Bank) and are united by a mission to create a sustainable business that provides massive social impact.<p>We are looking for a solid software engineer with experience developing single page, serverless web apps using Node. Our existing sys-\ntems and current development uses AWS, so while not required, AWS experience is a big plus. This is a full-time remote position, with<p>some limited travel. The candidate is expected to have previous remote experience or feel confident in their ability to supply the appro-\npriate work environment, including a sufficient internet connection, appropriate workspace, and other typical remote&#x2F;home office needs.<p>We expect availability during most of the typical work day in US time zones. This is a contract-to-hire position. The start date is ASAP.<p>More info: <a href=\"https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;18Rqfq7kzmxPfFcFNo8VOuOAKFS5xpzoy&#x2F;view\" rel=\"nofollow\">https:&#x2F;&#x2F;drive.google.com&#x2F;file&#x2F;d&#x2F;18Rqfq7kzmxPfFcFNo8VOuOAKFS5...</a>","time":1533146360,"type":"comment"}