{"by":"rwalker","id":17663243,"parent":17663077,"text":"Apple, Inc. | Cupertino<p>We’re perfectionists. Idealists. Inventors. Forever tinkering with products and processes, always on the lookout for better. Whether you work at one of our global offices, offsite, or even at home, a job at Apple will be demanding. But it also rewards bright, original thinking and hard work. And none of us here would have it any other way.<p>Where do you see yourself at Apple?<p>-- Siri -- Apple’s Siri is looking for exceptional engineers, designers, and project managers well versed in machine learning, natural language, speech recognition, server automation, and&#x2F;or mobile software development. Siri is used on countless iOS, tvOS and watchOS devices and handles over a billion requests per week.<p>If you’re passionate about Music, Home automation, Productivity, or one of a variety of our open positions, you’ll be right at home. Note that we have offices in Ottawa, Canada and Cambridge, UK too!<p>Apply online or send a resume to brittanyd@apple.com.<p>-- SEAR -- Security Engineering &amp; Architecture is looking for talented engineers to help define the security properties and architecture of Apple’s next generation operating systems. You will contribute to the entire system, from the lowest levels of the device to the services off-device which work together to protect our users. As an engineer you&#x27;ll majorly impact the design and implementation for all our platforms affecting hundreds of millions of users&#x27; privacy and security. We’re hiring for both the User Secrets team and the Trusted Execution team.<p>Apply online (<a href=\"https:&#x2F;&#x2F;jobs.apple.com&#x2F;us&#x2F;search?job=113644011&amp;openJobId=113644011#&amp;ss=%22SEAR%20-%22&amp;t=0&amp;so=&amp;pN=0\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.apple.com&#x2F;us&#x2F;search?job=113644011&amp;openJobId=113...</a>) or send a resume to lha@apple.com.<p>-- Numbers -- The Numbers team is looking for dynamic software engineers with the drive and desire to deliver beautiful and engaging consumer productivity applications on macOS, iOS, and the web. Engineers on our team work closely with other engineers, human interface designers, and different groups across Apple to make a major impact on software used and loved by millions of people to get things done at home, in their communities, and at their jobs.<p>Apply online (<a href=\"https:&#x2F;&#x2F;jobs.apple.com&#x2F;us&#x2F;search?job=113586008#&amp;openJobId=113586008)or\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.apple.com&#x2F;us&#x2F;search?job=113586008#&amp;openJobId=11...</a> send your resume to dibiase@apple.com.<p>-- FEAR -- Apple&#x27;s Fraud &amp; Security (FEAR) team, which is responsible for combating fraud and abuse for Apple Services, is looking for software engineers to build large scale distributed systems. We are hiring for senior and junior engineer roles. Senior engineers should have 5+ years working on distributed systems, and junior engineers should have a strong data structure and algorithm background, and proficiency in a statically type language such as Java, C++, Scala.\nIf interested send your resume to fear-eng-hiring@group.apple.com with [HN] in the email subject.","time":1533136678,"type":"comment"}