{"by":"cwkoss","id":17665914,"parent":17663077,"text":"DefenseStorm | DevOps Engineer, Senior Software Engineer, Junior Software Engineer | Full-Time | ONSITE | Seattle | <a href=\"https:&#x2F;&#x2F;www.defensestorm.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.defensestorm.com&#x2F;</a><p>At DefenseStorm, we help detect and stop cyberattacks on banks and credit unions.<p>Networks make a lot of logs - some of them are very important but there is huge volume of noise.  We ingest all of our customers’ network logs, and then customers can quickly search through them, set alerts, investigate threats, and generate reports. Our tools make it easy to track and demonstrate compliance with financial cybersecurity regulations and guidelines - which has shortened many of our customers’ arduous ~3 month audit preparations to just a couple weeks.  Our customers are very happy, which makes work more fun.<p>  I actually got hired here through an HN Who’s Hiring post about 3 years ago!  <p>Junior and Senior Software Engineers:  Our stack is primarily Java, Elasticsearch, AWS, Angular, Typescript, Postgresql.  Dev-ops and cybersecurity experience are ideal, but not required. We’re big on code review - use phabricator.  Have great monitoring and a nice CI system so deployment is mostly painless while still being safe.   Really good engineering culture: you will learn and become a better programmer by working with this team - I have.    <p>DevOps Engineer: Our stack is microservices running on AWS, Elasticsearch and Postgresql. We use Chef and Terraform to manage it all and Sensu, InfluxDB, and Grafana to monitor it. We&#x27;re big on automation and Infrastructure as Code and have a CI&#x2F;CD pipeline for infrastructure changes. Working at a startup is fun - you get to wear many hats and work up\tand down the stack. We love open source, both using it and contributing back to projects.  <p>Dog friendly office.  Every Tuesday we do a ‘Topic Sync’ to share knowledge on technical topics for an hour - nice way to continue learning.  Keg, espresso machine, wall of snacks. Free lunches on Wednesday.  Have had some cool guest speakers in the cybersecurity space, and we send some team members to DEFCON and other security conferences each year to stay on top of new developments.  It’s a fun place to work.  Relocation expenses are available for Senior and DevOps Engineer candidates.   <p><a href=\"https:&#x2F;&#x2F;www.defensestorm.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.defensestorm.com&#x2F;careers&#x2F;</a><p>Email jobs [at] defensestorm.com to apply.","time":1533150677,"type":"comment"}