{"by":"andjd","id":17663271,"parent":17663077,"text":"Stationhead | Multiple Positions: iOS developer, Backend Engineer | ONSITE in Brooklyn, NY | Full-time | 100K - 140K + equity<p>Hi, I’m Andrew DeFranco, a senior engineer at Stationhead.  We’re building a music-focused social network fighting back against algorithmically generated playlists and soulless corporate radio. We’re creating a democratized platform people connect with their music, their favorite artists, and each other.  One of our founders is an actual rockstar, and we have artists and industry executives lauding us as the future of music streaming.<p>We are a small team of 5 developers working collaboratively in a diverse and inclusive workplace, and our dev team has a wide range of backgrounds—including self-taught hackers and bootcamp grads.  We&#x27;re looking for some passionate people to help us grow onsite at our picturesque Williamsburg, New York office.  You&#x27;d be a great fit for our team as a . . .<p>Backend API Engineer if you:<p><pre><code>  * have at least 1-2 years experience with at least one MVC web framework like Laravel, Ruby on Rails, Django, or Express\n\n  * have experience integrating with third party JSON APIs\n\n  * have at least 1-2 years experience  working with relational databases, including:\n\n    • Writing and debugging queries, both in raw SQL and using an ORM\n\n    • Designing schema that are idiomatic and efficient\n\n  * write clear, maintainable, and well-tested code\n</code></pre>\nContact: andrew@stationhead.com<p>iOS Developer if you:<p><pre><code>  * have at least 2 years experience creating iOS applications in Swift\n \n  * have experience digesting web services and REST APIs\n \n  * have experience building UI components programmatically\n\n  * can use iOS tooling to diagnose and fix bugs and performance issues\n\n  * have a strong grasp of OOP fundamentals and design patterns\n\n  * write clear, maintainable, and well-tested code\n</code></pre>\nContact: cody@stationhead.com<p>Be sure to tell us your favorite band when you send us an email :)<p>You can see our full job listings at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;stationhead&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;stationhead&#x2F;jobs</a>","time":1533136830,"type":"comment"}