{"by":"gwyner","id":17667740,"parent":17663077,"text":"Fluent Forever | REMOTE | Full-time Contract | $70-110k + equity | Automation Engineer | <a href=\"http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;</a><p>The Fluent Forever mobile application is the most successful crowdfunded app in history, and for good reason: we are about to build the most powerful language learning platform in the world. We are looking for key team members who want to help us ship an amazing product, and then actively help us make it even better. We also want people who believe in the same things we do about what makes an awesome team (<a href=\"https:&#x2F;&#x2F;fluent-forever.com&#x2F;pfard&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;fluent-forever.com&#x2F;pfard&#x2F;</a>).<p>We are full-stack TypeScript running on Node.js&#x2F;Express in AWS with a SQL back-end. We are building iOS and Android mobile clients using React Native and our web site is using React. We need somebody who can fully handle mobile and web automation, API testing, and stress testing. Any experience related to improving our build process, cloud deployment, test environments, tool development, or analytics would be a plus.<p>If you have solid experience shipping quality software in every stage of the software development lifecycle and you are ready to step into a bigger role, want to have a larger impact on a project, or want to push your skills with new challenges, this may be a great fit for you.<p>Core Skills &amp; Experience:\n- A special blend of curiosity, passion, and technical expertise\n- Strong software development skills, including solid data structures and algorithms knowledge\n- Experience testing relational databases\n- Experience designing and implementing automation for SaaS solution\n- Ability to create automation and tools from scratch\n- Experience testing web services including performance, scalability and reliability testing\n- Excellent TypeScript&#x2F;Javascript skills (Node.js + Express is a big plus)\n- Experience shipping professional software product(s) through the entire SDLC\n- Excellent English language communication skills (written and spoken)<p>Preferred Skills &amp; Experience:\n- 5+ years of QA experience including 3+ years of SDET&#x2F;Automation&#x2F;Development experience\n- Amazon Web Services, REST, SQL, JSON, bash, telnet, SSL, globalization\n- Ability to assist with cloud infrastructure, build systems, and operations is a big plus<p>Apply here: <a href=\"http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fluent-forever.com&#x2F;careers&#x2F;</a>","time":1533163315,"type":"comment"}