{"by":"technojunkie","id":17664568,"parent":17663077,"text":"Circonus | Golang and Perl Software Engineers, Technical Writer | Remote | Full-time | <a href=\"https:&#x2F;&#x2F;www.circonus.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.circonus.com&#x2F;</a><p>Circonus is a super-scalable data analytics platform for operational time series data.  Think ops and engineering data enabled by a cost-effective and powerful data science platform; visualize any data, in any application, from any system, in real ­time. Our SaaS and On-­Premise solutions enable companies to combine monitoring, alerting, event processing, and predictive analytics into a unified solution.<p>Listen to one of our CEO Theo&#x27;s talks to get an idea of what Circonus does: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qh4hLIWqw6Q\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qh4hLIWqw6Q</a><p>We are a 100% distributed and remote company, mostly across the US as well as Europe. You are also welcome to work from the Maryland office; most employees work from home.<p>We build web software using technologies such as C, C++, Lua, Java, Ruby, Go, Perl, JavaScript, jQuery, HTML, Scss.<p>1) Go (Golang) Software Engineer<p>Significant real-world experience in server-side development with Go and related frameworks<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;32e94960-c5e8-43c6-9746-9dc2e4ef1112\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;32e94960-c5e8-43c6-9746-9dc2e...</a><p>2) Perl Software Engineer<p>Strong server-side development experience with Perl and working knowledge of mod_perl<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;f21d2a10-7f34-42b9-9b90-08bf55ed9a2c\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;f21d2a10-7f34-42b9-9b90-08bf5...</a><p>3) Technical Writer<p>Fluency producing documentation targeted at developers or operations teams, for our highly technical audience, creating eBooks, guides, primers and tutorials, user manuals and training materials, whitepapers and reference guides<p><a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;6877dd19-9dec-4fd8-948f-c2e923e056ea\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;6877dd19-9dec-4fd8-948f-c2e92...</a><p>Full job listings: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus</a><p>All of our positions include a discretionary PTO policy, health insurance, gym reimbursement, a generous 401K, the opportunity for a bonus and more.","time":1533143861,"type":"comment"}