{"by":"ab553","id":17667446,"parent":17663077,"text":"RPX Corp. | San Francisco, CA | Multiple Roles | ONSITE<p>RPX Corporation is the leading provider of a comprehensive suite of solutions to help companies manage the risks and costs that arise at any stage of their intellectual property program.<p>I work full-time on the tech side at RPX. If any of the positions below interest you, just send your CV to my personal address at craigsanders262@gmail.com and I&#x27;ll get it into the hiring manager&#x27;s hands. Cheers.<p>- Senior Developer: Python, Machine Learning, Data Science.\nResponsible for helping build state of the art technologies using Machine Learning and NLP solutions and applying the analysis into UI development. In this position, you will get to play many roles, touch many parts of our system, and have a significant impact on our products.<p>- Manager, Data Analytics.\nYou&#x27;ll analyze and visualize data, uncovering legal and legal&#x2F;business trends, to answer questions from RPX customers, internal groups, press, and academics. This role provides a rare opportunity for quantitative and qualitative analysis in a rapidly growing and exciting industry.<p>- Manager, Market Intelligence.\nWorking closely with Client Services, Litigation Intelligence and Product Management teams to research business and legal trends across consumer electronics, e-commerce and software, financial services, media content and distribution, mobile communications, networking, automotive, and semiconductor market sectors. This role provides a unique opportunity for quantitative and qualitative analysis in a rapidly growing and exciting industry.<p>- IP Analyst, RPX Consulting.\nRPX Consulting is an early-stage venture started within RPX Corporation whose purpose is to help technology companies optimize their own patent programs. We are seeking engineers, scientists, data scientists, patent attorneys&#x2F;agents, and former patent examiners to join our Intellectual Property (IP) Consulting &amp; Advisory Services team as a Patent Analyst. In this role, you will utilize data analysis to craft summary reports of findings.<p>Other open positions:\n- Workplace Assistant and Receptionist \n- Senior Patent Engineer, Semiconductor Technology","time":1533160819,"type":"comment"}