{"by":"justin","id":17668043,"parent":17663077,"text":"Atrium | DevOps Engineer, Senior Software Engineer, Mid-Level Software Engineer | San Francisco, CA | Full-time | ONSITE | www.atrium.co<p>Our tech stack: React, Vue, and GraphQL on the front end, Ruby on Rails on the back with some Node+typescript.  Postgres database, hosted on AWS.  Mostly python on our ML side.  Looking for very smart engineers who want to build a unique web app whose end users are in the same room as you.<p>Laws are the operating system on top of which all businesses operate. Without legal infrastructure, businesses and individuals would not be able to transact with trust that their counterparties will be held accountable. This trust has set the stage for a high degree of economic growth in America, and as laws have become more complex over time, interpreting and advising on the law has become an increasingly specialized profession.<p>Along with the law, regulation has also increased as a mechanism to assure the quality of legal professionals. Consequently, a massive legal industry has risen, and navigating the law has become an opaque, slow, and expensive process. Because of the regulatory hurdles in forming startup law firms, competition in providing legal services is soft, and technology and process improvements for clients do not happen as quickly as in other industries. Today, business managers do not have transparency into legal projects, and often view legal as a blocker to the goals they want to accomplish.<p>Atrium’s vision is to democratize and organize enterprises’ access to legal data, legal advice, and legal work. We will achieve this vision by combining the expertise of a full service law firm with the technology development processes and growth ambitions of Silicon Valley. This will enable transparent, fast, and cost competitive legal services for corporations.<p>Atrium has the potential to be a hugely impactful company that brings corporate legal services to the 21st century.","time":1533166602,"type":"comment"}