{"by":"BCharlie","id":17665028,"parent":17663077,"text":"GE Power | Sr Cyber Security Engineer &#x2F; Programmer | Atlanta GA, Schenectady NY, Cincinnati OH, Greenville SC, Glen Allen VA, Van Buren MI (Others may be considered) | onsite | <a href=\"https:&#x2F;&#x2F;jobs.gecareers.com&#x2F;ShowJob&#x2F;Id&#x2F;59338&#x2F;Sr-Cyber-Security-Engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.gecareers.com&#x2F;ShowJob&#x2F;Id&#x2F;59338&#x2F;Sr-Cyber-Securit...</a><p>Job number: 3148791<p><i></i>About us<i></i>:\nGE Power is building industrial IoT and analytics to help Power the world more efficiently. I lead the Secure DevOps team at GE Power, focused on helping the business build secure software through automation and deep security expertise.<p><i></i>About the role<i></i>: \nThis is a role for a great programmer who loves security, or a great security professional who loves programming. We are happy to train security skills if coming from a programming background with a security interest. The focus of the role is on building security tooling for other development teams. Some examples we are working on today: a two factor auth library in Java, A webhook for code analysis in Java&#x2F;Spring, and a framework for automating security scans across networks and systems in Go.<p>We also consult with other teams to build product security features, threat model, implement CI&#x2F;CD, or train development teams on secure coding practices.<p>Our goal is to enable our product teams to ship daily code while maintaining a very high level of security. Our product threat model adversaries include everything from common malware all the way up to targeted nation states attempting electrical grid and generation disruption.<p>Main technologies: Java with Spring is the most frequently used today, but we also use or support Node, Go, Python and C&#x2F;C++ for various projects.<p>If this sounds interesting, apply at the link above or reach out to me and I will be glad to answer any questions.","time":1533146059,"type":"comment"}