{"by":"shakefon","id":17669187,"parent":17663077,"text":"Walmart Labs (<a href=\"https:&#x2F;&#x2F;www.walmartlabs.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.walmartlabs.com</a>) | Carlsbad, CA | FrontEnd Tools Engineer | Full Time | Onsite<p>I&#x27;ve been a developer for quite some time, and professionally for over 12 years. Like many of you, I&#x27;ve been frustrated with the software development process and the manual toil we have around that process - we want to solve problems in software, not in the way we write, test and deploy it!<p>That&#x27;s why I&#x27;m excited by what my team at Walmart Labs does - the Developer Experience Tools team exists to create an amazing experience for the developer both within the Walmart Organization and outside with our Open Source contributions (see: <a href=\"http:&#x2F;&#x2F;testarmada.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;testarmada.io&#x2F;</a>).<p>I&#x27;m hiring right now, for a Staff level engineer to work on an exciting, full-featured set of UIs (portals, dashboards, configuration wizards) and associated tools and services.<p>We use javascript , nodejs, reactjs, redux and graphql heavily, but we&#x27;re very much of the opinion that you should use the right tool for the job so there are no unnecessary limitations.<p>Our Carlsbad office is AWESOME, and the location - reasonably close to San Diego, right next to the ocean - is pretty fantastic.<p>If you’d like to find out more or just chat about the role, message me here - or you can apply here: <a href=\"https:&#x2F;&#x2F;careers.walmart.com&#x2F;us&#x2F;jobs&#x2F;1016758BR-staff-software-engineer-sunnyvale-ca\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.walmart.com&#x2F;us&#x2F;jobs&#x2F;1016758BR-staff-software...</a><p>Would be amazing to speak to folks who want to find cool ways to take all the hassle out of developing software. I don&#x27;t care if you have a degree or not.<p>You&#x27;d be joining a great team with some excellent fellow engineers. No recruiters please, No agencies. Please reach out if you are interested in the role for yourself!<p>dstevens@walmartlabs.com if email is how you prefer to ask questions.","time":1533183191,"type":"comment"}