{"by":"jacques_chester","id":17668356,"parent":17663077,"text":"Pivotal | Engineers, Designers, Product Managers, Data Scientists, Pre&#x2F;Post-Sales Engineers, Ops, Sales, Admin | Locations worldwide | ONSITE<p>Pivotal&#x27;s goal is to transform the way the world builds software. We mean it.<p>We value aptitude over alma mater, empathy over a list of APIs. It doesn&#x27;t matter whether your resumé says PHP or PhD: if you&#x27;re smart, empathetic and know some stuff, we want to work with you.<p>We have many offices worldwide including SF, NYC, Toronto, London, Denver, Palo Alto, Dublin, Tokyo, Sydney (pivotal.io&#x2F;locations) and more. We have two main divisions: Pivotal Labs and R&amp;D.<p>-- <i>Pivotal Labs</i> helps clients to become better at product development. For engineering we are rigorously agile. We pair program and TDD every line of code outside-in. Our product managers are focus on value and validation, our designers keep the user foremost in our minds. The goal is to teach the teachers. Our engineers pair with client engineers, often we pair designers and product managers as well. We have a growing data science practice. More broadly our services division includes field, data science, educators, app replatformers, even I lose track.<p>Not many people get to transform how people think and work. Why not you?<p>-- <i>R&amp;D</i> is a big tent these days, encompassing two major cloud platforms (Pivotal Application Service &amp; Pivotal Container Service), Pivotal Tracker, Spring Framework, Greenplum, Apache HAWQ (incubating), Gemfire &#x2F; Apache Geode, BOSH and Concourse. We&#x27;re adding Pivotal Function Service this year. We dogfood the cutting edge of our technology on our own commercial cloud, Pivotal Web Services, run by our awesome CloudOps team. We&#x27;re the majority contributors to the Cloud Foundry project and we&#x27;re a platinum CNCF member with rapidly-growing contributions to the k8s ecosystem. There is a lot happening right now and there are greenfield platform opportunities.<p>Not many people get to work on such systems. Why not you?<p>-- <i>Generally</i><p>At our offices we have free breakfast, weekly tech talks, excellent benefits and competitive pay. You&#x27;ll work with competent people, kind people and go home at the same time every day. Ping pong isn&#x27;t mandatory, but it&#x27;s popular. I think west-coast ping pong is harder to beat, but east-coast style is more entertaining to watch. The NYC beer fridge has more IPAs than I prefer but I guess that&#x27;s life in paradise.<p>-- <i>Applying</i><p>To see open jobs, go to pivotal.io&#x2F;careers. To apply, please go to my referral link: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;xiy346\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;xiy346</a>, or mention my name in the application form.<p>You can also email me at jchester+hn-aug18@pivotal.io if you have questions. I won&#x27;t reply to copypasta. I may not be able to reply immediately, as I am just an engineer here. These help me earn a referral bonuses, which I appreciate.","time":1533170263,"type":"comment"}