{"by":"tellic_nyc","id":17663365,"parent":17663077,"text":"tellic | New York, NY (NYC) | Full-Time | Onsite\nBecome a member of the core team that is bringing next-generation data technologies to the world&#x27;s top pharmaceutical companies. tellic is shaping $150 billion of pharmaceutical R&amp;D decisions using cutting-edge data science technology. This is a chance to get in on the ground level at one of NYC&#x27;s fastest-growing tech startups in the white-hot space of life science AI. At tellic, we value culture as much as technical craft. Our values include creating a highly collaborative team of A+ players who build cool stuff that drives a real business impact. In fact, the name tellic means &quot;deliberate, with an outcome, and with impact.&quot;<p>tellic offers:\n• Opportunity to transform an entire industry at a self-funded, profitable startup with massive growth potential • Very competitive compensation package including base salary, bonus, and LLC equity plan • Fun, inclusive culture that celebrates diversity and respects individuals and their contributions • Competitive medical&#x2F;dental&#x2F;vision coverage • 3 weeks of paid vacation + 15 holidays • Discounted corporate gym membership • Beautiful office with kitchen<p>Data Engineer:<p>• Create and maintain optimal data pipeline architecture • Assist in converting R&amp;D projects to production-ready Python code • Architect scalable solutions that can handle data at the petabyte level • Work with the Data Science, DevOps and Product teams to design product solutions that seamlessly function in our internal environments and customer sites<p>Requirements:<p>• BS in Computer Science or equivalent experience (MS is a plus) • 5+ years of experience supporting data science pipelines in Python • Cloud experience required (GCP a plus) • Hands-on experience supporting Big Data technologies (e.g., Hadoop, Spark) • Experience scaling data science routines for high-throughput processes at the terabyte level • Developing and testing full stack production Python systems • Willingness to assist DevOps as needed • Experience building and optimizing Big Data data pipelines, architectures, datasets, and machine learning models • Google-certified professional a plus (we will support ongoing GCP training and certifications) • Experience working with large volumes of structured and unstructured data in a machine learning environment • Some startup experience<p>Senior DevOps Engineer:<p>• Design, develop, and support scalable, redundant infrastructure on GCP using technologies like Python and Airflow • Seamlessly integrate with our customers’ technologies (AWS, on-prem Hadoop, etc.) • Improve existing infrastructure to incorporate the latest technology, best practices, and cross application integrations • Day-to-day collaboration with data scientists to influence design and architect solutions in modern serverless environments<p>Requirements:<p>• BS in Computer Science or equivalent experience (MS is a plus) • 10+ years total experience • 4+ years of experience in DevOps with heavy experience supporting production Python environments • Hands-on experience with operations support (e.g. job monitors, error handling, environment creation) • Hands-on experience supporting Big Data technologies (e.g., Hadoop, Spark, Docker) • Hands-on experience working with standard Big Data indexing and search technologies • 1-2 years of cloud experience desired (GCP a plus) • Leader and problem solver who thrives at the challenge of building DevOps from the ground up • Team player with excellent interpersonal skills • Some startup experience<p>Applicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future. Send resumes to careers@tellic.com","time":1533137262,"type":"comment"}