{"by":"jfarmer","id":17663570,"parent":17663077,"text":"Strive Talent | Full-stack Engineer + Front-end product engineer | FULL-TIME ONSITE | San Francisco, CA | <a href=\"https:&#x2F;&#x2F;www.strivetalent.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.strivetalent.com&#x2F;</a><p>Hey HN! I&#x27;m Jesse, the head of engineering at Strive Talent. My email is jesse@strivetalent.com.  Previously, I co-founded Dev Bootcamp (acquired by Kaplan) and Everlane.<p>Strive Talent is a seed-stage, mission-driven startup dedicated to giving everyone a fair shot at a great career. Right now we help companies around the US staff sales and customer support jobs with candidates that would typically be overlooked. A typical hiring manager spends ~6 seconds per resume to evaluate whether a candidate should be given an interview. Instead, we administer a combination of cognitive tests, work-sample tests, and phone screenings, which allow us to evaluate a candidate according to the traits that actually determine their ability to do the job.<p>Our team is small, but we&#x27;re well-funded: <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2018&#x2F;01&#x2F;24&#x2F;stressing-aptitude-over-achievement-strive-talent-pitches-a-new-way-to-hire&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2018&#x2F;01&#x2F;24&#x2F;stressing-aptitude-over-ac...</a><p>If you&#x27;re interested, please send a resume and a paragraph explaining what it is about Strive that resonates with you to: jesse@strivetalent.com<p>Strive is a great place to join if any of the following are true:<p>• You care about connecting people with dignified livelihoods.<p>• You care about people getting jobs based on their ability to do the work, and not their pedigree.<p>• You want to come in to work each day and be able to ask, &quot;How many people got a better job yesterday because of us?&quot;<p>• You want to join an early-stage startup where there are still a lot of open product and technical questions.<p>Our core platform is built using Rails, React, PostreSQL, and other standard moving parts. Experience is those technologies isn&#x27;t required, but evidence of skill and adaptability are.","time":1533138384,"type":"comment"}