{"by":"dberg","id":17666447,"parent":17663077,"text":"iHeartRadio | NYC | OnSite | Full-Time<p>Scala, React, Node, Data Eng, Python, Mobile, Android, iOS, Data Science, SRE<p>iHeartRadio is the No. 1 all-in-one digital audio service with over 800 million downloads; it reached its first 20 million registered users faster than any digital service in Internet history and reached 80 million users faster than any other radio or digital music service and even faster than Facebook.<p>We are seeking passionate, motivated and skilled engineers looking to make a major impact on the music world. We have a great work&#x2F;life balance, free lunch on Fridays, Bagels on Thursdays, collaborative open floor space, in-office performances from up and coming artists and a bike room. We also believe heavily in open source and being engaged in the wider tech community.<p>You can also read about us at <a href=\"http:&#x2F;&#x2F;tech.iheart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.iheart.com</a><p>Please apply at <a href=\"http:&#x2F;&#x2F;jobs.iheart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.iheart.com</a> or email us at recruitment@iheartradiocareers.com<p>Software Engineer, Web - Along with Facebook and Netflix, iHeartRadio is one of the largest React applications around. We are small, focused team committed to produce our best work. We are undertaking a major re-architecture of the iHeartRadio website&#x2F;Web application, and just open-sourced a number of modules [1] as part of this effort. We intend to contribute increasingly more to the React open-source community.<p>Mobile Engineers - Android and iOS - Come work on our flagship mobile applications using best of breed frameworks solving real problems at scale. You will also be \nactively engaged with our Home and Consumer Electronics products such as Chromecast, Roku, XBOX, etc.<p>Data Engineer - Seeking engineers with a passion for solving large data problems. Our data platform helps provide insights and analytics, reporting, business intelligence and many other functions for the business. We rely on tooling such as Hadoop, Hive, Kafka, Redshift, Airflow, Spark.<p>Software Engineer , Scala - Come work with a world class engineering team who is very active in the Scala community. We have an Akka Cluster based microservice framework and we are doing some really exciting things at scale using AWS, Docker and a variety of other tooling.<p>Python Engineer  - Work with our content and ingestion engineering teams to figure out how to manage millions of music tracks at scale. Working with our open source Henson framework you will help build the backbone of our core ingestion infrastructure that manages all of our music, talk and podcast infrastructure, encoding infrastructure as well as search and advanced catalog heuristics.<p>Data Science - Come work with our world class Data Science team on building the future of music personalization. We are doing a ton of work with collaborative filtering, matrix factorization, building neural networks with acoustical analysis and a ton of other new and exciting research.<p>SRE - Work with our SRE team focused on scaling all aspects of the iHeartRadio infrastructure leveraging AWS, K8S, Docker, HAProxy, Fastly, Prometheus , Go, Python and help build all the tooling and infrastructure automation needed to automate all parts of the environment.  Software Engineers who love infrastructure will thrive in this environment.","time":1533153963,"type":"comment"}