{"by":"sunilsea","id":17667511,"parent":17663077,"text":"Readyfire | Fullstack Software Engineer | SF (onsite) | Fulltime<p>Do you want to shape the future of sports wagering?<p>Readyfire is a San Francisco based startup funded by Bullpen Capital (investors in gaming leaders Zynga &amp; FanDuel), and we are looking for great Full Stack engineers to add to our team. We&#x27;re looking for motivated self-starters that thrive in a fast moving environment. Bonus if you are a sports fan and have familiarity with fantasy sports, daily fantasy, sportsbooks and other sports related games.\nThis is an opportunity to become a core member of our team and help us shape the company from the ground up.<p>The Position:<p>We want to make sports wagering accessible to all sports fans, including the most casual of fans who have never wagered on a game before. There are over 140M adult sports fans in the US. Less than 20% have ever wagered on sports online. We need the right full stack engineer to build compelling products with innovative UI&#x2F;UX to turn them from uninitiated into core users of our product.<p>As one of the early members of our team you&#x27;ll have a major influence on our core product and the long term company vision. You&#x27;ll work closely with all members of the team in a high energy environment.<p>You&#x27;re the right candidate for this role if you: \n- Have strong proficiency in JavaScript&#x2F;ES6\n- Have experience with and good understanding of the React stack. Node&#x2F;React&#x2F;Redux&#x2F;React Native \n- Have proven ability to work in a fast paced environment to turn mockups&#x2F;prototypes in to well engineered applications. \n- Ability and willingness to work on all parts of the stack as needed. \n- Experience with building application that can scale using Google Cloud Services and Amazon AWS<p>Nice to haves: \n- Experience with firebase\n- Love of sports \n- Previous experience with Daily Fantasy Sports or gaming\n- Previous experience with implementing virtual currencies in games.<p>Email your resume to : jobs@readyfire.co","time":1533161311,"type":"comment"}