{"by":"somid3","id":17664998,"parent":17663077,"text":"Los Angeles | CTO &#x2F; Head of Engineering | $50k - $150k and&#x2F;or 5% to 20% equity | Early Stage<p><i>High-level pitch of product</i>\nRenters get 15% of their rent back, landlords get responsible long term renters.<p><i>Product</i>\nColibrin has developed a patent-pending &quot;Renter Fund&quot; technology which applies time-tested behavioral economic models, similar to credit card cash-back programs or airline points, to create a mutually beneficial outcome for both renters and their landlords. Renters that use Colibrin&#x27;s &quot;Renter Fund&quot; can receive up to 15% of their cumulative rent payments back when they move out if they reside in a property for a minimum number of years. Landlords and real estate investors that use Colibrin&#x27;s Renter Fund can receive higher than average returns since their properties will have lower vacancy rates, lower management fees, lower repair costs, and higher cash-flows -- resulting in a higher NOI.<p><i>Why us?</i>\nWe are from MIT Sloan, one of the largest real estate holding families in Beverly is in our advisory group, the family that discovered fuzzy logic at MIT is one of our investors. We have a product that can scale quickly, decentralize real estate ownership, and creates a win-win scenario for our market participants.<p>The other co-founder studied at UC Berkeley and MIT Sloan, has been a software developer and product manager. We already have strong interest from renters and landlords. We are at the early stage and are expecting our valuation to grow 100x in the coming years. We can provide you a dedicated office area.<p><i>Your title</i>\nCTO &#x2F; Head of Engineering &#x2F; Co-founder<p><i>Description</i>\nLead all things software development. You will be our first co-founder.<p><i>Skills</i>\n- Backend: Java and Play Framework (optional), MySQL\n- Frontend: HTML, Javascript, any framework\n- Business accumen<p><i>Salary &#x2F; Equity</i>\n- To start $50k per year as contractor\n- After 3-months and completion of first web application salary can increase to $150k per year\n- The company is currently valued at $2m, and you will receive 5% to 15% vested across four years.<p><i>To apply</i>\n- Email your resume to this post or to jobs at colibrin dot","time":1533145928,"type":"comment"}