{"by":"euqinom","id":17663832,"parent":17663077,"text":"Geckoboard | London, UK | Software Engineers | Full-time | VISA | Onsite<p>At Geckoboard, we&#x27;re helping companies all around the world make use of their data by enabling them to easily build TV dashboards that align their teams on the things that matter most. Our product integrates with almost 100 applications and our customer include the likes of Slack, Dashlane, and Skyscanner.<p>We&#x27;ve been busy reimagining the way our customers get their data in Geckoboard and have a lot of interesting and creative work to do to shape their experiences. Right now, we&#x27;re looking for curious problem solvers to help us on this journey.<p>---<p>Openings:<p>Backend Go Developer | <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;geckoboard&#x2F;27c7e6ff-a02a-4221-a02f-e1921dc8c804\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;geckoboard&#x2F;27c7e6ff-a02a-4221-a02f-e19...</a><p>Senior Front-End Developer | <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;geckoboard&#x2F;c857d2a3-d784-4d7e-a72e-486b829e6dba\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;geckoboard&#x2F;c857d2a3-d784-4d7e-a72e-486...</a><p>---<p>Looking for a junior front-end developer role? (full-time)<p>Get in touch with your CV and a short introduction about yourself by emailing me (Monique) at people@geckoboard.com! :) \nNote: Our junior positions are only open to people based in London with right to work in the UK.<p>---<p>A little about Geckoboard:\nWe&#x27;re a small but growing 40 person start up in Shoreditch passionate about making data useful! We have a strong culture with a focus on building a great product our customers love, work life balance and personal development. And as a growing company there are lots of opportunities internally.<p>These roles would be a great fit for you if you&#x27;re passionate about working as part of a cross-functional team (of developers, designers, QA testers and product managers), enjoy learning from others through pair programming and peer review and sharing what you know. (As an example, none of us knew Go or React.js a short time ago, but now they are key parts of our stack)!<p>Read more about our values and the team at: <a href=\"https:&#x2F;&#x2F;www.geckoboard.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.geckoboard.com&#x2F;careers&#x2F;</a> or <a href=\"https:&#x2F;&#x2F;www.glassdoor.co.uk&#x2F;Reviews&#x2F;Geckoboard-Reviews-E878996.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.glassdoor.co.uk&#x2F;Reviews&#x2F;Geckoboard-Reviews-E8789...</a>","time":1533139809,"type":"comment"}