{"by":"SEJeff","id":17664319,"parent":17663077,"text":"Jump Trading | <a href=\"http:&#x2F;&#x2F;jumptrading.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jumptrading.com</a> | Security Engineer | Chicago | full-time<p><a href=\"https:&#x2F;&#x2F;jumptrading.com&#x2F;apply.html?gh_jid=1166399\" rel=\"nofollow\">https:&#x2F;&#x2F;jumptrading.com&#x2F;apply.html?gh_jid=1166399</a><p>As a Security Engineer, you will evaluate and implement solutions and policies related to information security.  In this role, you will be responsible for day-to-day operations of corporate firewalls, network access controls, DLP, vulnerability scanners, and other information security systems.<p>What you&#x27;ll do:<p>Implement, manage, and monitor network security devices such as firewalls, network access control, network device auditing, network forensics, behavior auditing, IDS&#x2F;IPS, and DLP services.\nInvolved in Threat Hunting exercises and take a purple team approach to security in the environment.\nCollaborate with vendors and relevant IT groups related to information security.\nAutomate existing processes and procedures to create a highly resilient security infrastructure.\nPerform relevant vulnerability and risk assessments.\n Implement and make recommendations for Information Security policies and standards at the network, server, and endpoint levels.\nAssist in performing investigations of anomalous activity and creating actionable reports to senior management.\nSkills you’ll need:<p>3-5 years of experience working in information security, or 4+ years working in Network, Windows, or Linux systems administration.\nDemonstrated success implementing and maintaining effective information security practices.\nStrong understanding of information security regulations (NIST 800-53, GDPR, NYDFS, etc)\nExperience with Python and exposure to HTML, CSS, Twitter Bootstrap and JavaScript.\nUnderstanding of networking technologies and protocols: TCP&#x2F;IP, BGP, OSPF and IPSEC VPN\nExperience with enterprise firewalls, network switches&#x2F;routers, IPS and IDS. Palo Alto Networks experience strongly preferred.\nSIEM technology experience preferred, Splunk proficiency strongly preferred.\nFamiliarity with DLP and data classification technologies.\nFamiliarity with NAC (network access control) technologies\nExperience with securing cloud based applications.\nPassionate about high-quality of work and continuous improvement.\nCCNA, PCNSE, G-PEN, GCFA and GCFE or other networking certifications preferred.  BS Degree in CS, Mathematics, Engineering or Equivalent Experience\n If you are currently a student or recent graduate, please see our Campus postings which offer both intern and full-time opportunities.","time":1533142423,"type":"comment"}