{"by":"beemboy","id":17667788,"parent":17663077,"text":"Mason America | Backend, Devops, Full Stack, Android&#x2F;Embedded Software Engineers | Seattle | Full Time | <a href=\"https:&#x2F;&#x2F;www.bymason.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bymason.com</a><p>We&#x27;re building &quot;mobile infrastructure as a service&quot; that enables businesses to automate deployment of their own Android-based device ecosystems. Think AWS but for devices.<p>We&#x27;re pretty small at the moment, have revenue, and are poised to grow. We&#x27;re looking for people to take on the following engg roles:<p>* Ownership of our backend architecture (currently Node.js on AWS)\n* Ownership of our devops story (involving both backend services as well as Android build infrastructure among other things)\n* Own and evolve our Android fork (Mason OS) and help unify it across a variety of devices (a la LineageOS&#x2F;CyanogenMod)\n* Build end to end web apps to realize features around large-scale device management, ordering, inventory management, etc.<p>Our tech spans the gamut from Android OS customization, apps, CLI tools, backend services, devops and web dashboards all the way through to device provisioning automation and optimal sourcing of hardware through our network of manufacturers.<p>We&#x27;re looking for engineers that have 2+ years of direct, hands-on experience in the space you&#x27;re applying for, or in a related area that translates over.<p>Please include your resume and a cover letter answering (in brief) &quot;Why you?&quot; and &quot;Why Mason?&quot;. You can contact us directly at (hiring -at- bymason.com); we&#x27;ll personally review your application. Please know that we look at all resumes but may take a little time to shortlist as we are a small hands-on team.<p>Our process: Phone interview =&gt; Work on take-home&#x2F;async problem and&#x2F;or share your existing body of work =&gt; In-person =&gt; Offer. We adjust&#x2F;shorten based on the candidate.","time":1533163821,"type":"comment"}