{"by":"ryangabbard","id":17663733,"kids":[17663754],"parent":17663077,"text":"USC Information Sciences Institute | Research Programmer | Waltham, MA | Marina del Rey, CA | REMOTE | Full-time | isi.edu<p>The University of Southern California Information Sciences Institute (ISI) is one of the nation’s largest, most successful university-affiliated computer research institutes. ISI’s VISTA center (<a href=\"https:&#x2F;&#x2F;www.isi.edu&#x2F;centers&#x2F;vista&#x2F;overview\" rel=\"nofollow\">https:&#x2F;&#x2F;www.isi.edu&#x2F;centers&#x2F;vista&#x2F;overview</a>) performs research in natural language processing (NLP), computer vision, biometrics, optical character recognition (OCR), and speech and text analytics.  Much of our software is open-source and we publish in top conferences.<p>Some of our current and upcoming projects include:<p>- Creation of a new Python open source information extraction toolkit to enable reasoning and experimentation using diverse document interpretations<p>- Detecting and counteracting social engineering attacks<p>- Construction of knowledge bases from text, images, audio, and video which can represent multiple hypotheses about the state of the world<p>- Automatic extraction of events, entities, and causal and temporal relations between them (who did what to whom, when, and why?) from text<p>- Improving cross-language information retrieval (searching for English concepts in foreign-language documents) for text in low-resource languages (e.g. Swahili, Tagalog)<p>- Automatic generation of fictional stories<p>As a part of our team, you’d help execute these and other research projects.  Key requirements are the ability to learn new technologies rapidly and to communicate technical ideas clearly.<p>Open positions:<p>- For junior software engineers&#x2F;new graduates with a background or interest in NLP: <a href=\"https:&#x2F;&#x2F;usccareers.usc.edu&#x2F;job&#x2F;waltham&#x2F;research-programmer-i-natural-language-processing&#x2F;1209&#x2F;7676089\" rel=\"nofollow\">https:&#x2F;&#x2F;usccareers.usc.edu&#x2F;job&#x2F;waltham&#x2F;research-programmer-i...</a> (Waltham, MA)<p>- For early-career software engineers with a background or interest in NLP:\n  <a href=\"https:&#x2F;&#x2F;usccareers.usc.edu&#x2F;job&#x2F;waltham&#x2F;research-programmer-ii-natural-language-processing&#x2F;1209&#x2F;8329656\" rel=\"nofollow\">https:&#x2F;&#x2F;usccareers.usc.edu&#x2F;job&#x2F;waltham&#x2F;research-programmer-i...</a> (Waltham, MA)<p>- For experienced generalist software engineers, no NLP background required: <a href=\"https:&#x2F;&#x2F;usccareers.usc.edu&#x2F;job&#x2F;waltham&#x2F;research-programmer-ii&#x2F;1209&#x2F;8758704\" rel=\"nofollow\">https:&#x2F;&#x2F;usccareers.usc.edu&#x2F;job&#x2F;waltham&#x2F;research-programmer-i...</a> (Waltham, MA; Marina del Rey, CA; or remote within US)","time":1533139270,"type":"comment"}