{"by":"joeclef","id":17670334,"parent":17663077,"text":"Namshi.com | Dubai |Sr Backend Engineers &amp; Cybersecurity Engineer | Full-time | Onsite | Visa + Relocation assistance | <a href=\"https:&#x2F;&#x2F;namshi.com\" rel=\"nofollow\">https:&#x2F;&#x2F;namshi.com</a><p>Founded in 2011, Namshi is the biggest fashion e-commerce retailer in the Middle East.<p>My name is Joe, a backend engineer here at Namshi. During the past 2 years, I have really enjoyed working as part of the tech team. In particular, I love:\n1- Working with empathetic and smart managers, both technical and non-technical.\n2- The various opportunities to make an impact.\n3- Opportunities to take ownership.\n4- Working as a team where one supports each other.\n5- No politics or BS meetings :slightly_smiling_face:<p>Sr. Backend Engineer<p>====================<p>As a Sr. Backend Engineer, you’ll be tasked to work on a spectrum of services ranging from our customer-facing APIs to tools that power our logistics infrastructure. We are a very pragmatic and experienced team, so from time to time, you will see engineers busy TDDing on a feature, whereas at other times we’re straight to live. We pride of being a heterogeneous team that’s experienced to know how and when to abstract.<p>Security Engineer:<p>==================<p>As a Security Engineer, you’ll be tasked with running internal assessments, ranging from pentesting our cloud infrastructure to social engineering around the office, review our security policies and define the best strategy to improve our posture. In addition to that, you will be actively collaborating with external researchers through our HackerOne program, which is going to be directly under your responsibility. On top of this, as the months will go by, you will probably spend time training both our technical and non-technical staff to raise awareness and make sure we got the basics covered.<p>We have a microservice architecture where we use tools such as Node.js, Python, Go, AWS, Docker, Kubernetes, Google Cloud, React, Redis etc.<p>To apply please send an email with your resume to work-in-tech@namshi.com. Or you can also email me directly at joe.jean@namshi.com.","time":1533204000,"type":"comment"}