{"by":"xaragmbh","id":17670087,"parent":17663077,"text":"Xara | Berlin, Germany | Backend Developer | Full-time | Visa | Onsite | www.xara.com<p>This is your opportunity to work on a product that will be used by millions of people, and to contribute to the most amazing web-based creative tool being developed today. A team of 30 developers is building a new slick product, using the very latest, state of the art web technologies: Javascript, HTML5, CSS and WebGL for only the newest browsers and touch devices. We also use Node.js, React, Vanilla JS, Git, Mocha, Karma and TeamCity.<p>About you:<p>Solid commercial experience (3 years +) with:\nServer-side programming, Linux configuration, TDD and continuous integration, JavaScript and Node.js, Advanced Bash programming, NOSQL (Redis and MongoDB are required), TSDB, Docker, GIT.<p>- A solid understanding of cloud deployment strategies and scalable architectures - A desire to work on world-leading web software products - Highly motivated, with a positive attitude to work and the ability to learn quickly - Good trouble-shooting skills with the perseverance to solve problems - Able to work productively, both autonomously and as part of a dynamic team<p>Some nice to have experience:<p>Good knowledge of the most common web servers &#x2F; load balancers (Apache, Nginx, HAProxy), Experience with ELK and Grafana, Experience with AWS or GCP, Experience with Kubernetes, Commercial experience with high-volume scalable architectures, an interest in online security<p>For You:<p>- Exciting work with high responsibility - Work in a startup with the ability to have an impact - We promote professional development - Highly motivated and friendly colleagues<p>Are you interested in new exciting challenges, while working in a young and dynamic environment in Berlin? Please get in touch with us: jobs@xara.com or through <a href=\"http:&#x2F;&#x2F;www.xara.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.xara.com&#x2F;jobs&#x2F;</a>","time":1533199623,"type":"comment"}