{"by":"JaakkoP","id":17670824,"parent":17663077,"text":"Flightpath Finance | Full Stack Engineer | Baltimore, Los Angeles, San Antonio, REMOTE | Full-time | $100-$130k | 1-3% | Paid vacation, healthcare and 401k matching<p>Interested in being part of a dynamic team at a funded, revenue-generating startup that will change the way tech companies forecast and run their business? Flightpath is building a Connected Financial Model for fast growing SaaS companies to build and keep their forecasts up to date.<p>We are looking for a strong, creative Full Stack Engineer to work closely with the CTO and the founder. As employee #4 your work will matter A LOT.<p><i>The Stack:</i><p>React web app with Redux&#x2F;Apollo<p>Node.js<p>HTML5&#x2F;CSS (modules)<p>Docker<p>Graphql<p>Typescript<p><i>We’re looking for:</i><p>- Experience with Node.js<p>- Experience with PostgreSQL, MySQL or other RDBMS. (PostgreSQL preferred)<p>- Experience designing RESTful APIs<p>- Deep understanding of how to write scalable software\n- A solid grounding in Computer Science fundamentals, data structures, algorithms, and deftness at object-oriented design and systems architecture<p>- Passion for creating great products and solving unique problems<p><i>As part of our team, you’ll enjoy:</i><p>- Healthcare, 401K with matching, four weeks of vacation and gym &amp; commuter benefits<p>- Ultimate flexibility setting your work environment. We’re open to remote employees in North America, or employees officing with one of us in Los Angeles, Baltimore or San Antonio.<p>- Flightpath embraces diversity. We believe the foundation of our dynamic and pioneering approach to finance starts with a fair and inclusive culture. We encourage everyone to apply –  regardless of gender identity, race, color, religion, sex, sexual orientation, national origin, genetics, disability, age, veteran status, or any other characteristic.<p>- And more, see the Angellist post<p>Apply through Angel List jobs at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;l&#x2F;2bosiH\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;l&#x2F;2bosiH</a> or by emailing your resume to jaakko  at_here flightpathfinance.com, with &quot;HN&quot; on the subject line.","time":1533211826,"type":"comment"}