{"by":"finn_blackwood","id":17672585,"parent":17663077,"text":"Pentair | Raleigh, NC USA | IoT Data Scientist | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;www.pentair.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pentair.com&#x2F;</a><p>We are looking for an innovative Data Scientist to define and inform data collection and utilization for Internet of Things applications within Pentair. Our group needs strong technical knowledge and experience in extracting actionable insights from data through externally available data sources as well as internally maintained stores. The ideal candidate would be skilled in approaching data from the perspectives of device optimization, support and maintenance, as well as an end user&#x27;s point of view. They would be able to combine acquired domain knowledge with applicable statistical methods to give process visibility and understanding as well as rational justification for new opportunities. They must have adept ability using a variety and changing set of data tools as new technologies become viable. The right candidate will have a passion for deriving meaning from the available data.<p>Role Tasks:<p>* Work with domain experts and support engineers to identify opportunities for data collection or application.<p>* Curate and analyze data from multiple sources to discover actionable insights into operations, maintenance, and utility.<p>* Assess viability of emerging techniques and technologies<p>* Guide model development and deployment<p>Role Qualifications:<p>* Strong problem solving skills and internal drive for solutions<p>* Experience using computer languages such as Python and SQL to access and manipulate data<p>* Experience defining data architectures<p>* Knowledge of advanced data techniques from decision trees to neural networks and ability to use them with discretion<p>* Strong communication skills to help coordinate multiple initiatives<p>Please contact me at finn.blackwood@pentair.com","time":1533226193,"type":"comment"}