{"by":"taamoore","id":17701022,"parent":17663077,"text":"Congressional Innovation Fellow | TechCongress | Washington, D.C. | Full-Time |ONSITE<p>TechCongress places technologists to work in Congress through a one-year Congressional Innovation Fellowship to inject tech expertise into the policymaking process. Fellows have worked on everything from Russian meddling in the 2016 elections, encryption, biometric privacy, autonomous vehicle and drone regulations, the OPM and Equifax breaches, and the Facebook &#x2F;&#x2F; Cambridge Analytica hearings.<p>As a Congressional Innovation Fellow you will:<p>-Work with TechCongress to choose a placement with a Member or Congress or Congressional Committee and report directly to a senior staffer (like a Chief of Staff or Staff Director) in that office from January 2019 to December 2019.<p>-Perform duties similar to other Congressional staff by applying your experience in technology to a variety of work, including:<p>&gt;&gt;Researching relevant policymaking (on issues like encryption, autonomous vehicle regulations, health IT, government hacking, privacy, open data, cyber&#x2F;data security and many others).<p>&gt;&gt;Helping educate Members and staff about these issues.<p>&gt;&gt;Researching legislation.<p>&gt;&gt;Preparing for and organizing Committee hearings, markups, or investigations.<p>What we’re looking for in our Fellows:<p>-A technical background or ability, with experience working in or studying the technology sector.  Training can be formal (college, graduate school, the military) or informal (self-trained).<p>-Great interpersonal and communications skills.<p>-Ability to explain technology to those that aren’t as familiar with technology tools or concepts.<p>-Ability to thrive in a fast-paced, collaborative environment.\nCommitted to helping get Members of Congress and Congressional staff up to speed on technology issues.<p>Apply through September 9, 2018: <a href=\"https:&#x2F;&#x2F;www.techcongress.io&#x2F;apply\" rel=\"nofollow\">https:&#x2F;&#x2F;www.techcongress.io&#x2F;apply</a>","time":1533584581,"type":"comment"}