{"by":"libbyboyd","id":17756675,"parent":17663077,"text":"The Trade Desk | Lead, Senior and Software Engineers | London, Seattle, Bellevue | On-site | Full-Time -<p><a href=\"https:&#x2F;&#x2F;www.thetradedesk.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thetradedesk.com</a> (applications please apply on our website)<p>The Trade Desk has become the fastest growing demand-side platform (DSP) in the industry by offering agencies and their advertisers a best-in-class technology platform that focuses on delivering meaningful and relevant engagement with consumers.<p>With integrations into every major advertising exchange, we handle well over 8- 10 million queries per second and growing – that&#x27;s more page views and queries than Facebook, Google Search, and Google&#x27;s entire network of websites combined – all serviced in single-digit-ms response times. Are you interested in working with big data? Do you want to push the edges of scale and responsiveness? It doesn&#x27;t get much bigger or faster than this!<p>You might be a great fit for The Trade Desk development team if:<p>You are a senior full-stack SOA engineer &#x2F; generalist. Experience and (just as important) interest in working in a variety of layers and technologies within a SOA is a must for our team. This includes (walking down the stack): AngularJS SPA development, MVC-based web architecture, external RESTful APIs, distributed (and in our case, highly scaled) request handling services, no-SQL and relational SQL databases, big data processing (e.g. data bus architecture, Hadoop &#x2F; MPP data warehouse, etc.), and data visualization (e.g. Tableau). Experience in all these layers is not strictly required, but we do like to see experience working in more than one, as well as eagerness to work on projects that might slice through them all (because they often will).<p>You lead with humility and confidence. Our engineers have the opportunity (and are expected) to exercise a high degree of leadership and expertise in their daily work, having strongly held and defensible ideas, and advocating for what they believe is right. But they also need to be eager to hear differing opinions, adept at identifying and evaluating tradeoffs, willing to be proven wrong, and quick to walk through fire to help out their follow teammates.\nYou have 6+ product-driven software development experience using a modern, object-oriented language. Memory-managed languages are best -- .e.g. C#, Java, Python, Ruby, etc. We do a lot of development in C#&#x2F;.NET, but specific experience here is not required.<p>*We are hiring for all levels of Software Engineering professionals and highly encourage recent Computer Science graduates to apply.","time":1534242475,"type":"comment"}