{"by":"capkutay","id":8543962,"parent":8542892,"text":"WebAction in Downtown Palo Alto - Full Time Hiring Front-End Developers and Platform Engineers - Remote OK<p>Jobs@WebAction.com<p>WebAction is a streaming analytics company based in the San Francisco Bay Area.<p>Our goal is to make real-time, predictive analytics simple. Every component of our platform is controlled by a web-based drag and drop app designer and&#x2F;or a declarative, SQL-like language. This enables our customers to focus on rapidly solving their business challenges, rather than being consumed in building out big data infrastructure. As a culture, we love challenges and strive to improve our product everyday.<p>===Front-end&#x2F;UI developer position===<p>With the power of the WebAction platform, our mission is to build new visual interaction models that combines real-time analytics and predictive computations. This means we want to streamline the process of bringing data into our platform, transforming it, visualizing it, and applying predictive models.<p>Our front-end stack includes HTML&#x2F;CSS, JS&#x2F;JQuery, Backbone, D3. Given that, all candidates should have 10+ years of Javascript experience and an MBA from a top school (just kidding).<p>If interested, feel free to reach out to me john@webaction.com<p>===Big Data Platform Engineers===<p>We value building out our software frameworks in house. This includes a real-time event processing engine (streaming engine similar to twitter storm), distributed query processing engine, and fault-tolerant clustering software. We&#x27;ve already hit some milestones including linear scalability and multi-node recovery. As a Platform Engineer, you will work on hitting NEW milestones in scalability and speed. Our stack is based on mostly based on java frameworks built in-house and some we leverage (like ZMQ for messaging). You should be interested in search and storage engines like cassandra, hbase, elasticsearch, messaging frameworks like kafka, flume, and event processing engines like storm and spark.<p>===More about WebAction===<p>Its founded by a team of Silicon Valley executives with multiple successful exits in the enterprise (our CEO has sold 1 company to Lockheed and 2 companies to Oracle). We&#x27;ve raised north of $11m since 2013 and our advisors&#x2F;board have done amazing things like creating the Apple logo and founding one of the top VC firms in Silicon Valley. With every product release, we delight our customers and engage new ones at an ever-growing rate.<p>If this sounds interesting, shoot your resume to HR at jobs@webaction.com. If you have questions for me, feel free to send a message to john@webaction.com","time":1414865214,"type":"comment"}