{"by":"ninetax","id":8543042,"kids":[8544098,8543715,8543309],"parent":8542892,"text":"The Climate Corporation (San Francisco, Seattle, Full time, INTERN&#x2F;H1B) - <a href=\"http://climate.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;climate.com&#x2F;careers</a><p><pre><code>   ===========================\n   ====== What we do =========\n   ===========================\n</code></pre>\nOur mission is to build great software for farmers.<p>We use a combination of weather monitoring, agronomic modeling, satillite imagery, and weather simulation to provide data and insights to those farmers.<p><pre><code>   =================================    \n   ===== Who we’re looking for =====       \n   =================================\n</code></pre>\nWe&#x27;re hiring full-time employees and interns across many teams.<p>Work is split across groups focusing on web applications for farmers and agents, risk and insurance policy management, internal platform and data services, and scientific modeling and research, with roles for:<p>1. Software Engineers, particularly anyone interested in building (i) entirely new, large-scale distributed data services for scientific computing (we use Clojure); and (ii) web applications (Clojure, Rails, Python, Javascript, and iOS) used by farmers to manage weather risk.<p>2. Quantitative researchers in statistics&#x2F;ML, stochastic optimization, remote sensing, atmospheric physics, and agronomics. Our goal is to forecast statistical distributions of crop yield for any piece of arable land, synthesizing satellite images, digital elevation models, weather data, agricultural statistics, and geological surveys into multiscale models that underly our data services.<p>3. Experienced technical team leads, operations engineers, product managers, and designers to pull all this together into a compelling product. The scale and interdisciplinary nature of the work drive a lot of cross-collaboration within the company, supported by a pressing need to build durable solutions to some very hard and important problems.<p><pre><code>   ===========================    \n   ====== Why I love it ======    \n   ===========================\n\n – I think Climate is poised to make a huge impact on farming. \n – I am surrounded by a group of super smart people that care about the work we are doing.\n – I get to tackle challenging problems everyday.\n</code></pre>\nI am on the satillite imagery team and I am really excited about the work we&#x27;ve been doing, I am happy to talk in length about it over email at skhalsa@climate.com.<p><pre><code>   ===========================    \n   ====== Other details ======    \n   ===========================\n</code></pre>\n– Competitive salary\n– Excellent benefits\n– Stocks\n– Other crazy perks (massages!)<p>We also have something called sprintbicals where anyone can work on an independent project for some time (we are in the midst of redesigning this)<p>Here&#x27;s the company site for the job postings\n<a href=\"https://hire.jobvite.com/j?bj=o7B8Wfww&amp;s=hackernews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?bj=o7B8Wfww&amp;s=hackernews</a><p>If you want to take the fast track, just shoot me an email at skhalsa@climate.com. I am happy to answer questions, or put you in contact with people who can answer your questions.","time":1414850524,"type":"comment"}