{"by":"sqs","id":8543630,"parent":8542892,"text":"✱ Sourcegraph - San Francisco (SoMa, 2nd &amp; Howard) - Full-time<p>Sourcegraph is building a collaboration app for programmers and dev teams, with intelligent code search, review, and analysis at its core. Google, Facebook, and Microsoft devs already rely on internal tools similar to Sourcegraph, and we’re bringing them to every other company and programmer in the world. Thousands of developers each week use Sourcegraph for code search, review, and usage examples at <a href=\"http://sourcegraph.com\" rel=\"nofollow\">http:&#x2F;&#x2F;sourcegraph.com</a>.<p>Just like GitHub, Sourcegraph is always free for open source. But we’re starting to work with a hundreds-long waiting list of customers who have signed up to use Sourcegraph on their internal company codebases (which is how we’ll make money).<p>We’re looking for outstanding generalist engineers who will help build all parts of Sourcegraph: the distributed build workers (Go+Docker), the web app and API (Go+React+PostgreSQL), the git&#x2F;hg data store (<a href=\"https://sourcegraph.com/github.com/sourcegraph/vcsstore\" rel=\"nofollow\">https:&#x2F;&#x2F;sourcegraph.com&#x2F;github.com&#x2F;sourcegraph&#x2F;vcsstore</a>), and our source code analysis engine (open source for Java&#x2F;Go&#x2F;Python&#x2F;Ruby&#x2F;JavaScript at <a href=\"https://srclib.org/\" rel=\"nofollow\">https:&#x2F;&#x2F;srclib.org&#x2F;</a>).<p>You’ll join our team of 4 (ex-Stanford&#x2F;Google&#x2F;Palantir&#x2F;top creative agency&#x2F;Hacker School) at our spacious, sunny office in SoMa (SF) and work in a culture that values respect, our users, high-quality products, clean code, good tests, frequent deploys, and open-source code. We’re well funded, have a mandatory vacation policy, cater all meals, offer generous comp with equity, and provide lots of other great benefits.<p>We think that someday, virtually all developers and teams will be using Sourcegraph for code search and review. Try it out at <a href=\"https://sourcegraph.com\" rel=\"nofollow\">https:&#x2F;&#x2F;sourcegraph.com</a>, and join us to make it happen: hi@sourcegraph.com (more info at <a href=\"http://themuse.com/companies/sourcegraph\" rel=\"nofollow\">http:&#x2F;&#x2F;themuse.com&#x2F;companies&#x2F;sourcegraph</a>).<p>- Quinn (co-founder, sqs@sourcegraph.com)","time":1414859688,"type":"comment"}