{"by":"jennifer_scroll","id":8543457,"parent":8542892,"text":"Head of Technology - F&#x2F;T | Scroll Media, Inc. | Mumbai, India \n-----------------------------------------<p>Help power the next generation of publishing by joining Scroll Media, a venture-backed digital media company focused on the intersection of editorial and technology. Our first offering is a digitally-native news publication, <a href=\"http://scroll.in/\" rel=\"nofollow\">http:&#x2F;&#x2F;scroll.in&#x2F;</a>, which brings readers top political and cultural news in an elegant, responsive newsfeed.<p>Next up in the pipeline are a series of products that use robust algos and stunning design to efficiently create publications on niche topics like entrepreneurship, healthcare, design, and more! You can learn more about our core tech here (<a href=\"http://blog.scroll.in/tech/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.scroll.in&#x2F;tech&#x2F;</a>) and our machine learning projects here (<a href=\"http://blog.scroll.in/scroll-machine/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.scroll.in&#x2F;scroll-machine&#x2F;</a>).<p><i>What we&#x27;re looking for</i> \nThe Head of Technology will lead the planning, engineering, and execution of Scroll’s product development plan. S&#x2F;he will drive the conceptualization and day-to-day management of simultaneous products, analytics, and a small (but growing) team of engineers. S&#x2F;he is responsible for delivering finished products that meet design and development timelines, performance, quality and cost specifications.<p>Ideal candidate should demonstrate the following:\n• The ability to contribute to, drive, and deliver on the company’s product roadmap\n• Fluency in Python, JavaScript; AngularJS a major plus\n• Capacity to dissect long-term plans into manageable tasks, and delegating those tasks based on skill matching\n• Excellent communication skills and ability to interact with all levels of engineers\n• 5+ years of experience building, directing, and motivating teams of engineers\n• A bachelor’s degree in engineering, computer science, or related field<p><i>Who we are</i>\nWe are a tiny team of enthusiastic newshounds, culturists, and tech aficionados. Our team consists of a serial entrepreneur, a book author, alums from MIT, Harvard, McKinsey, The Wall Street Journal, Yahoo, ex-editors from reputed Indian newspapers and people with great experience building multiple startups.","time":1414857188,"type":"comment"}