{"by":"jnenglish","id":8544479,"parent":8542892,"text":"Inferess - San Francisco, CA (both roles allow: INTERN)<p>### About Us<p>We are a vibrant, young company with a mission to be the leading provider of of intelligent, market moving information for professionals and corporations, so that they can be pro-active and make smarter, faster and profitable decisions.<p>You are always flooded with trivial or redundant information, but often miss the one story you needed most. Inferess offers a solution.<p>Can floods in Thailand affect a semiconductor manufacturer in South Korea? Would it possibly affect a storage manufacturer in Silicon Valley? Not only will the users receive critical event updates about the company they are tracking, they will also receive pertinent news that will affect the companies they seek.<p>### Positions<p>Software Engineer, Backend\n----------------------------------------\nYou will be focused on a wide range of backend projects powering some of the most important services such as Search, Data Mining and Graph Algorithms. We follow service-oriented architecture and Java, Scala are the main part of our stack. Successful candidate should have expertise in developing high volume, minimal latency web applications. Coding skills in Python are a plus.<p>- Strong Java and&#x2F;or Scala experience\n- Strong CS fundamentals, including good working knowledge of classic algorithms and data structures\n- Experience with Hadoop&#x2F;Hive&#x2F;Pig is a big plus\n- Exposure to architectural patterns of large, high-scale web applications\n- Rigor in A&#x2F;B testing, test coverage, and other best practices<p>Software Engineer, Search\n----------------------------------------\nYou will be focussed on building the next generation of Search features and infrastructure, constantly striving towards Improving the quality of our search results and conversion rate, and tacking the challenges in contextual information discovery and personalization. Successful candidate must have a strong Java and&#x2F;or Scala background, in-depth expertise in Lucene and real-world experience working with large, custom search systems.<p>- Real-world expertise with Information Retrieval, Machine Learning, Recommendation Systems\n- Strong Java experience\n- Experience with Hadoop&#x2F;Hive&#x2F;Cascading\n- In-depth Lucene expertise\n- Strong CS fundamentals, including good working knowledge of classic algorithms and data structures\n- Rigor in A&#x2F;B testing, automated testing, and other engineering best practices\n- Exposure to architectural patterns of large, high-scale web applications<p>Read more at: <a href=\"http://inferess.com/jobs.html\" rel=\"nofollow\">http:&#x2F;&#x2F;inferess.com&#x2F;jobs.html</a><p>Contact us at careers@inferess.com","time":1414873621,"type":"comment"}