{"by":"helloshow","id":8544921,"parent":8542892,"text":"Product Manager\nFort Lauderdale, FL<p>Hello Show is a new real estate application that is transforming the way real estate agents communicate and schedule. The application has created an easy to use scheduling and showing process for all parties involved through a secure mobile messaging platform, property detail organizer, route planner, and an automated agent-to-agent scheduling system. The team has worked tirelessly with real estate agents to streamline and automate the current process of using endless paper, phone calls, emails, and texts to communicate. The result is an exceptional tool kit that is built for the way Realtors work.<p>On the verge of launching, we are funded and have already secured major contracts with customers.  Responses and feedback have ranged between &quot;How do I get this product right now?&quot; to &quot;This is absolutely amazing!&quot;  We are obsessed with the user experience and delighting our customers.<p>We are looking for a top-notch Product Manager who will lead the continuous and rapid development of the Hello Show platform.  You will manage and lead all aspects of product research, product development, and user experience.  You will interface with our remote development and design team, interview users, and work with our sales and marketing team to ensure the delivery of the highest quality product.  Everything we do is an experiment, and you must be excited to challenge your assumptions and prove ideas with data.<p>You will be joining an amazing team: one of the top Realtors in South Florida, 2 of the top 100 Ruby on Rails contributors, a market research expert, a seasoned startup operations veteran, a world class-designer, and 3 additional senior engineers.  Fortunately, the team needs to grow!<p>Responsibilities:<p>• Plan and lead the development of new features, bugs fixes, and product releases \n• Develop deep empathy and understanding of our users and their experiences\n• Conduct research interviews and user testing sessions to plan and iterate the application\n• Translate research results into actionable items and product plans \n• Ensure the highest quality of user experience through rigorous testing and product experimentation\n• Become an expert in all aspects, trends, and competitors within the real estate tech industry\n• Perform QA and customer support regarding issues, feedback, and product satisfaction \n• Make our users incredibly productive and make them love our product \n• This is a startup - you will have the opportunity to contribute to every aspect of the company!<p>Qualifications:<p>• Have an insane attention to detail\n• Be a UX fanatic and be focused on always simplifying processes\n• Have clear and effective communication skills\n• Be self motivated, especially without a clear direction or objective\n• Know when to outsource, and when to build internally\n• Understand software development and project management methodologies \n• Experience reading and writing contracts is a plus\n• Experience with design or mockup tools is a plus (Sketch, Photoshop, Balsamiq, etc.) \n• Understanding real estate transaction processes is a plus\n• Must thrive under pressure and lead by example\n• Competent in managing a complex product and leading a remote team\n• Minimum 3 years project management experience of mobile&#x2F;web applications\n• Have a learner’s mindset and love developing new skills<p>To apply, send an email to team at helloshow.com with “Project Manager” in the subject.","time":1414882382,"type":"comment"}