{"by":"minichate","id":8544055,"parent":8542892,"text":"FreshBooks - Toronto, Canada - Software Developer (Full Stack)\n<a href=\"http://www.freshbooks.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freshbooks.com&#x2F;jobs&#x2F;</a><p>FreshBooks is seeking skilled full stack developers who have experience with web application frameworks and JavaScript frameworks as well as client-side performance optimization. With us, you will help build brand new features and update existing ones in our consumer-facing cloud accounting application. We build a product that helps our users earn their living and we’re proud of that. If you’re committed to great work and great teamwork, and are constantly looking for ways to improve the systems you’re responsible for, we’re dying to meet you.<p>Right now, we’re hiring all the way from junior developers to the architect level. No matter your level of experience, if it’s a natural fit, we have a place for you to shine and grow.<p>We are versatile...<p>Most of our software is written in PHP, Python, and JavaScript. We also use tools and technologies like Ember.js, RabbitMQ, Redis, Elasticsearch, Puppet, and Jenkins CI. We believe in using the best tool for the job (while maintaining a slight bias toward the tools the team knows the best). While we value experience with the tools above, we know that smart developers are great learners, too.<p>We collaborate...<p>We work in an open environment; no cubicles or offices. We closely follow Agile Scrum and rely on collaboration for success. We also collaborate across the office; regular hackoffs are a part of our culture. Developers join forces with coworkers across the company to pitch and prototype projects that improve our product, our culture, or are just plain fun.<p>We ship...<p>Shipping is at the forefront of our engineering practice. We rely on continuous integration and use automated testing to ensure our product is always shippable.<p>We value our people...<p>We recognize and reward ingenious work. We all have real lives, and respect their balance. We all have a voice that is heard throughout the company. We always make time for fun, and have one of the most unique, employee-led cultures out there. Join the FreshBooks choir or a class in the gym, organize a gaming night, teach a dev lunch and learn, or use a paid volunteer day to share your skills with the community.<p>Salaries are competitive and compensation packages include stake in the company.<p><a href=\"http://www.freshbooks.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freshbooks.com&#x2F;jobs&#x2F;</a>","time":1414866462,"type":"comment"}