{"by":"brandonthejames","id":8545767,"parent":8542892,"text":"99Gamers.com (Mountain View, CA) – <a href=\"https://www.99gamers.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.99gamers.com</a><p>Open positions: iOS Engineer, Full Stack PHP Developer - Full-time<p>----------------------------------------------------<p>Based in Mountain View, 99Gamers is changing the way we trade video games. To take 99Gamers to the next level we are looking for a developers who want to join our team.<p>----------------------------------------------------<p>About 99Gamers<p>Born off a Reddit post, 99Gamers is a trusted community marketplace for gamers to buy and sell video games. With more than 118,000 members, $1,100,000 worth of games sold and 44,000 games available to buy, 99Gamers is the easiest way for gamers to get the most value out of their video games. 99Gamers is currently taking part in 500 Startups&#x27; Batch 11. Check out our videos on YouTube.<p>----------------------------------------------------<p>Join a small, quickly growing startup working to push the marketplace space forward. You’ll help us get there. We’re looking for engineers&#x2F;hackers who can learn&#x2F;grow with the company on the go. Being apart of a small team, you will have ownership and responsibility for product development.<p>You should place a very high personal value on culture. We’re looking for a mellow coder with an insane work ethic. At 99Gamers, you’ll make a huge impact. You’ll be responsible for creating tools that will help shape our growing community.<p>We’re looking for people who love the internet &amp; gaming as much as we do.<p>----------------------------------------------------<p>We&#x27;re also looking for a product designer and community manager. See more about the positions here: <a href=\"http://goo.gl/qC13Y0\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;qC13Y0</a><p>If interested, send a resume along with a brief note about why you think you’d be a good fit at 99Gamers to brandon@99gamers.com. If you have any questions, feel free to ask.","time":1414907069,"type":"comment"}