{"by":"Gyffindor","id":8549033,"parent":8542892,"text":"Gata Labs Inc - Toronto, ON. Looking for Full Stack Devs, Android&#x2F;iOS Devs - Able to work at our office in Downtown Toronto (at least 2-3 days&#x2F;week). More Info: <a href=\"https://www.gatalabs.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gatalabs.com&#x2F;careers</a><p>-- Who We Are --<p>Gata Labs is a Toronto based Platform-as-a-service (PaaS) company aiming to change the way consumers and businesses interact. With deep backgrounds in the localized technology space, Gata Labs builds mobile based solutions for the service industry and their clients.<p>-- Who you Are --<p>- You have enough expertise in your area (2-4 years experience) to hit the ground running fast and contribute to our codebase\n- Eager to learn about new technologies and go beyond your current experience\n- You are passionate about the future of your field\n- You work hard, and stay humble\n- Completely Optional: You are a Beast at Ping Pong (Obligatory post: <a href=\"https://twitter.com/Uberflip/status/525278007229837312/photo/1\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;Uberflip&#x2F;status&#x2F;525278007229837312&#x2F;photo...</a>)<p>-- The Positions --<p>- Full Stack Developer: Responsible for development and infrastructure of Gata Labs&#x27; web technologies. Must be familiar with MEAN stack development (Javascript, Node.js, HTML5 &amp; CSS3, Angular.js, CofeeScript)<p>- Android Developer - Responsible for the development, testing, and deployment of new application features on our Android products. Strong knowledge of Java for Android and familiarity with developing native Android Apps<p>- iOS Developer - Responsible for the development, testing, and deployment of new application features on our iOS products. Experience developing iOS Apps. Using one or more of Java, Objective C&#x2F;Xcode, JavaScript, HTML5.<p>-- How to Apply --<p>Send us your Resume&#x2F;Cover Letter and a Portfolio of past projects to careers@gatalabs.com. Please see our website (www.gatalabs.com) for more information","time":1414981368,"type":"comment"}