{"by":"YelpEngineering","id":8564077,"parent":8542892,"text":"Software Engineer - Infrastructure (San Francisco)<p>Yelp’s Infrastructure team designs, implements, and maintains scalable software architectures that are at the heart of our technology.  We do everything from build performance monitoring tools, to design APIs and develop libraries.<p>Is building large scale distributed systems, debugging systems and optimizing network performance is a way of life for you? Does helping enable hundreds of engineers to safely and quickly deploy their features into production get you excited? While serving millions of active Yelp users? If so, come join the team that is the glue that connects Yelp’s feature teams to their underlying software infrastructure - in the data centers, up in the cloud, or anywhere in between.<p>You will\nDesign, build and deploy software systems that run 24&#x2F;7 at increasing scale\nDevelop custom tools and automate processes to find answers to challenging questions and reveal the unknown\nWrite code, document, participate in code reviews, and mentor other engineers<p>Requirements\nStrong knowledge of systems and application design, with an understanding of operational and reliability trade-offs\nSolid foundation in data structures, algorithms and complexity analysis\nStrong understanding of Linux or Unix-like operating systems\nSolid understanding of fundamental protocols like TCP&#x2F;IP, HTTP, DNS\nStrong understanding of web technology\nFluency in Python, C, C++, Java, or a similar language\nAbility to work well with and able to influence many personality types at all levels of the organization\nExcellent written and interpersonal communication skills<p>Pluses\nExperience building distributed systems\nExperience at a large-scale consumer internet site\nExperience with configuration a management tool (Puppet, Chef, Ansible, Salt, CFEngine), monitoring (Nagios, Sensu, Monit), metrics (Graphite, statsd)\nExperience with AWS\nExperience with web frameworks<p>Apply here:  <a href=\"http://www.yelp.com/careers?jvi=oWxPZfw1,Job\" rel=\"nofollow\">http:&#x2F;&#x2F;www.yelp.com&#x2F;careers?jvi=oWxPZfw1,Job</a>","time":1415219356,"type":"comment"}