{"by":"sian_OK","id":8566720,"parent":8542892,"text":" ======================================================<p>Cool Functional Tech Team | London, UK | Front and Back End roles\n   ======================================================<p><pre><code>  SCALA DEVELOPER\n  FRONT END DEVELOPER (HTML, CSS, JS)\n</code></pre>\nEntrepreneurial lifestyle company going through a stage of rapid growth and looking for a strong developers to join the ultra-techy team and work on 100% Greenfield work.<p>Java developers with an interest in Functional Programming considered for Scala role also.<p><pre><code>  * Relaxed, dress down atmosphere and cool Central London HQ\n  * Awesome techy team getting quality code live quickly \n  * Work from home Fridays, relaxed core hours\n</code></pre>\nRole:<p>Looking for strong developers who relish technical challenges to join a start up currently taking the lifestyle and brands market by storm. You will take features through from concept to implementation, and love working with different technologies.<p>If you are fed up of slow-moving red tape culture where you can&#x27;t get code live daily then this role is for you!<p>SCALA DEVELOPER:<p><pre><code>  * Scala\n  * OR strong Java with personal Scala projects\n  * Ability to write unit and automation tests for your code\n  * Experience with the Agile development process\n</code></pre>\nFRONT END:<p><pre><code>  * Strong HTML, CSS\n  * Javascript experience (we work with Angular, but don&#x27;t mind if you haven&#x27;t)\n  * Experience with modular CSS approach (i.e. OOCSS, SMACSS, etc)\n  * Implemented software designs\n</code></pre>\nBenefits:<p><pre><code>  * Strong salary plus bonus and equity\n  * Shares in a company with huge trajectory\n  * Office in one of London&#x27;s most iconic buildings\n  * Laid back working environment with quality team\n\n</code></pre>\nIf you&#x27;re looking to join London&#x27;s coolest tech team, then please get in touch with: sian.robertson [at] oxfordknight.co.uk","time":1415277525,"type":"comment"}