{"by":"alexchantastic","id":8575447,"parent":8542892,"text":"X15 Software | <a href=\"http://x15soft.com\" rel=\"nofollow\">http:&#x2F;&#x2F;x15soft.com</a> | San Francisco, CA | Full time Front-end Developer (AngularJS, SASS, D3)<p>Please send resumes&#x2F;questions to alex@x15soft.com.<p><pre><code>  About Us\n  =============================\n</code></pre>\nX15 Software is a revolutionary large-scale machine and log data management company. Our flagship product provides a highly scalable, open and modern platform that combines search and analytic query capabilities. With best-in-class developer productivity and the lowest total cost of ownership, X15 Software is the new global standard for enterprise-wide machine data efforts.<p>We’re looking for a talented and innovative front-end developer to help us build intuitive and elegant user interfaces for big data search, visualization, and exploration. Working with technologies like AngularJS, node, SASS, Foundation, D3, Atmosphere, and a sophisticated set of RESTful&#x2F;real-time APIs, you’ll develop and enhance platform features, improve user experience, and prototype visualization interfaces that help our users manage and understand their big data.<p><pre><code>  You are\n  =============================\n</code></pre>\n* A strong proponent of web standards, usability, and simplicity<p>* Interested in the latest developments in front-end technologies, standards, and tooling<p>* An advocate for clean, testable, reusable code<p>* Able to self-direct, take ownership of feature development, learn and adapt<p><pre><code>  You&#x27;ll get to\n  =============================\n</code></pre>\n* Collaborate with a small, talented team of designers and developers to build beautiful, fast, robust user interfaces with the latest technologies and techniques<p>* Influence architecture, tooling, technology stack, and product design<p>* Work in a relaxed, quality-focused environment with an internationally-distributed team of experts<p><pre><code>  Skills &amp; Requirements\n  =============================\n</code></pre>\n* Familiarity with modern, object-oriented development concepts and best practices<p>* Strong expertise in AngularJS development<p>* Comfort with version control systems (Git)<p>* Experience with OOCSS, SASS, CSS3<p>* Familiarity with Javascript visualization tools and libraries (D3, vega, Highcharts)<p>* Experience interacting with web services and RESTful APIs<p>* Local to SF Bay Area &#x2F; Peninsula preferred","time":1415406645,"type":"comment"}