{"by":"ameryz07","id":8586216,"parent":8542892,"text":"AppLovin - Palo Alto, CA<p><a href=\"https://applovin.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;applovin.com&#x2F;jobs</a><p>Role: Software Engineer (UI)<p>AppLovin is the fastest growing mobile advertising technology company. We enable brands to acquire and re-engage customers on mobile. Our mobile marketing platform moves beyond targeting and segmenting to use customized ad creative, data and predictive models to deliver dynamic mobile advertising. Our automated media buying technology makes it easy for brands to acquire new customers profitably while also helping them re-engage their pre-existing users and drive higher conversion rates in a measurable way. AppLovin offers dynamic ads to over a billion consumers each month and works with 300+ world-class brands including OpenTable, Hotels.com, eBay, Spotify, GREE, Zynga, and Groupon.<p>Our TechCrunch article: <a href=\"http://bit.ly/UDGsTq\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;UDGsTq</a><p>Acquisition of Moboqo (German Mobile Ad startup): <a href=\"http://tcrn.ch/1C1qq4E\" rel=\"nofollow\">http:&#x2F;&#x2F;tcrn.ch&#x2F;1C1qq4E</a><p>As a member of our UI team, you’ll be responsible for creating beautiful and functional user experience. You will extend your mastery of Javascript, work on clean &amp; maintainable code and spend 10% of your working hours experimenting with new tools. This is a full-time position.<p>About you:<p>- You love to program, solve problems and build stuff\n- Have advanced knowledge of Javascript, CSS3 and HTML5\n- Have good knowledge of PHP Have experience with JS libraries like angular or jQuery mobile\n- Have a solid knowledge of web debugging tools (Firebug or Chrome Developer Console)\n- Have a minimum of a BS and&#x2F;or MS in Computer Science<p>Perks:\n- Free medical, dental, and vision insurance\n- Daily lunches&#x2F; Fully stocked kitchen\n- Free public transit&#x2F; Free laundry service\n- Free gym membership\n- Stock Options &amp; 401k matching\n- Fun company parties and events\n- Autonomy to make decisions in a rapidly growing company\n- Great Vacation Time - work hard and take time when you need it!<p>Interested? Please reach out to amery.zhen@applovin.com!","time":1415652002,"type":"comment"}