{"by":"pdnell","id":14238724,"parent":14238005,"text":"Ogilvy | Creative Technologist &amp; Web Developer | Washington, DC | ONSITE | Fulltime | ogilvy.com<p>Ogilvy&#x27;s Center for Innovation and Creative Technology is seeking a highly driven creative thinker with web development experience to join and help grow its Creative Technology team. As a Creative Technologist at Ogilvy Washington, you’ll be working across projects with huge impact that span the private and government sectors. You aren’t just helping clients sling product, you’ll help them change the world – whether it be working on projects that encourage behavior change, helping improve customer experience, or creating empathy through immersive storytelling. We are a cognitively diverse team of creatives building award-winning campaigns. We’re on top of current trends, always learning, pushing each other, and having a blast along the way.<p>Responsibilities<p>- Building responsive web applications using some of the following: PHP, MySQL, HTML, CSS, JavaScript, js, React.js, Vue.js, aframe.js, MongoDB, WordPress, Drupal\n- Using git for version control, branching and merging according to industry best practices\n- Participating in code reviews\n- Prototyping iOS and Android apps, web apps, Raspberry Pi apps, Arduino Apps\n- Eating bagels on Bagel Monday\n- Learning new programming languages, platforms, and mediums\n- Participating actively in the DC tech community\n- Building sweet experiential Beer Carts on Thursdays\n- Be one of the go-to people for questions about cutting-edge technologies and how to best use them<p>Qualifications<p>- BA&#x2F;BS in Computer Science, Interaction Design, Experience Design, Software Development or professional equivalent or certification\n- Experience building production-quality websites using HTML, CSS, JavaScript, PHP, MySQL\n- Experience developing HTML Emails\n- Adobe Creative Suite&#x2F;Creative Cloud\n- Experience building and maintaining production websites in content management systems (CMS)\n- Insatiable desire for learning new things<p>Interview process: Screening call, onsite&#x2F;video conference interviews with the team, team likes you, receive offer.<p>Apply here: <a href=\"https:&#x2F;&#x2F;uscareers-ogilvy.icims.com&#x2F;jobs&#x2F;1323&#x2F;creative-technologist-and-web-developer&#x2F;job?hub=15&amp;mobile=false&amp;width=1012&amp;height=500&amp;bga=true&amp;needsRedirect=false&amp;jan1offset=-300&amp;jun1offset=-240\" rel=\"nofollow\">https:&#x2F;&#x2F;uscareers-ogilvy.icims.com&#x2F;jobs&#x2F;1323&#x2F;creative-techno...</a>","time":1493654726,"type":"comment"}