{"by":"iamnafets","id":14238309,"kids":[14238713],"parent":14238005,"text":"Amazon New Product Demand Forecasting | Seattle | Full-Time | On-Site ($130-$250+ depending on experience)<p>Amazon&#x27;s New Product Demand Forecasting team is responsible for one of the most challenging problems in supply chain optimization: predicting sales for products that have no sales history. This is a uniquely creative space in Forecasting requiring our machine learning models to capture both the nuances of the global consumer marketplace as well as customer behavior on Amazon.<p>Our team works closely with research scientists to invent new ways to make use of novel data, solve hard engineering problems around scaling and performance in predicting for tens of millions of products, and iterate quickly in order to stay on the cutting edge.<p>I&#x27;m looking for an experienced software developer (sorry, no university hires at this time!) that is comfortable with big data and machine learning and can:<p>* Design systems that provide a stable base for innovation in a rapidly changing business<p>* Improve Forecasting algorithms through data-driven analysis and experimentation in our Scala&#x2F;Spark environment<p>* Optimize for scalability and performance of both distributed computations and near-metal C++ code<p>* Learn quickly and keep up with a rapidly changing machine learning and big data landscape<p>* Communicate their ideas clearly with all members of a diverse team<p>If this sounds interesting, as the hiring manager I&#x27;d love to chat or buy you coffee. Email me (Stefan) at smai@ (amazon.com) with your resume and a brief introduction. (Interview process is 1 phone screen and onsite interview with whiteboard coding and behavioral questions about your experience.)<p>P.S. Big shout out and thanks to the HN community for the &quot;Who is hiring?&quot; threads! I&#x27;ve gotten to meet or email with nearly 100 very talented engineers and scientists (and hired several) over the last 2 years. I&#x27;m now down to 1 more opening on my team. I&#x27;ll say this: if you think you&#x27;re not qualified -- send me an email anyways. I&#x27;ve been flabbergasted with the number of strong engineers who preface their email with &quot;I&#x27;m probably not a fit&quot;. Imposter syndrome is real -- send me an email anyway and let&#x27;s at least have a chat!","time":1493652620,"type":"comment"}