{"by":"kobigurk","id":14239438,"kids":[14246428],"parent":14238005,"text":"QED-it | Zero Knowledge Proofs for Blockchains | Looking for strong developers | Full-time, ONSITE or REMOTE | <a href=\"http:&#x2F;&#x2F;qed-it.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;qed-it.com&#x2F;jobs</a> | Tel Aviv<p>If you’re looking to join a small, experienced team doing Big Things © :-)<p><i>Why join QED-it</i><p>* We’re at the heart of the private Blockchain industry. The founders built and sold successful businesses in the space, and are focusing on privacy as the key to blockchain deployment, impacting industries from banking to space &amp; defense.<p>* We are tackling the hardest and most interesting problems in the blockchain space - solve the consensus&#x2F;privacy paradox, using zero-knowledge-proofs. ZKP is a new technology, with deep roots in the Israeli academic world.<p>* We are funded by smart money from top tier angels, and have assembled a team of experts in cryptography, computer science, security and distributed systems.\nWe are looking for C++, algorithms and backend developers<p>- take a look at <a href=\"http:&#x2F;&#x2F;qed-it.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;qed-it.com&#x2F;jobs</a> for detailed descriptions.<p><i>About you in general</i><p>* You have at least 3 years of work experience in tech roles<p>* Entrepreneurial spirit and a hands-on mentality<p>* Diverse environments and programming languages experience<p>* Good communication skills and able to quickly adapt to new challenges when needed<p>* Ideally you previously worked in a startup and&#x2F;or in a dynamic environment<p>* Excellent analytical, logical and critical thinking skills<p>* You enjoy work in a fluctuating environment, dealing with (some) uncertainty<p>* Without using Google, you know what Q.E.D. means, possibly even 2 different meanings\nWhat you get<p>* Competitive full-time compensation<p>* A front seat at a rapidly expanding, global technology company in an exciting, emerging industry<p>* Great office location in Tel Aviv<p>* Sharp, motivated co-workers who can’t wait to meet you :-)<p>To get in touch, send your CV&#x2F;drop an email to jobs@qed-it.com, we promise it will be worth your time...","time":1493659107,"type":"comment"}