{"by":"rubiquity","id":14238533,"parent":14238005,"text":"MotionMD | Software Developers (Ruby&#x2F;Rails) | San Diego, CA | Remote (US only), Contract<p>MotionMD is a clinical workflow application for Orthopedic practices. We help automate the paperwork for healthcare billing and inventory management so that doctors can spend more time delivering great care to the patient. MotionMD is a small software team inside of DJO Global, a 40 year old Orthopedic bracing and surgical company. We are not a startup! :-)<p>The development team works remote all across the US with team members in every US time zone. The app is built using Ruby (2.3) and Rails (4.2, soon 5.0!) with primarily Backbone and Bootstrap on the front end. Our Rails app is going on 9 years old and is very well maintained and continuously undergoing new feature development. This is not legacy software!<p>We’re looking for people who value writing and reading maintainable code and enjoy working on software that makes an impact. We&#x27;re open to anyone with at least 1 year of professional work in Ruby&#x2F;Rails.<p>Our app is deployed on AWS and makes use of a lot of neat tools such as Terraform, Ansible, and Packer.<p>We’re looking for people with the following traits:\n- An approach to problem solving that always starts and ends with the customer in mind<p>- Ability to clarify or gather additional requirements<p>- Familiar working with other people&#x27;s code that might not be well understood and taking the initiative to understand the problem and make it better<p>- Uses frustrating code or development tools as an opportunity to make them better<p>Here are some of our upcoming challenges:<p>- Incrementally refactoring a significant amount of Backbone and CoffeeScript to something (TypeScript? ES6 + Flow?) more maintainable<p>- Helping our implementation team speed up the process of onboarding new customers<p>- Implementing a search index solution for encrypted patient data<p>Please email richard.bishop@djoglobal.com if you’re interested!","time":1493653752,"type":"comment"}