{"by":"bramgeenen25","id":14239082,"kids":[14268325],"parent":14238005,"text":"Wevolver  |  Senior skilled Full Stack Developer  |  REMOTE &amp; ONSITE  |  Amsterdam  |  Full Time<p>• Javascript (Angular&#x2F;React)<p>• Python (Django)<p>• Postgres<p>• Git<p>• AWS<p><i>I’m Bram Geenen, co-founder of Wevolver. \nIf you are skilled and keen on making a big positive impact then our team might be a great place for you!</i><p>Wevolver = ‘Github for Hardware’\nEngineers globally use our platform to collaborate on open source or private hardware projects. Think brain-controlled robotic arms, electric urban transportation, and laser 3D printers.\nBy enabling anyone, anywhere to develop hardware we aim to generate more innovation and empower people to create and solve challenges.\nWevolver is mission-driven: we prioritize making a positive impact on people&#x27;s lives and we are a transparent organization, heavily involved in open source.<p>Since our launch in 2014 we have build a great community of hardware developers, and the Wevolver platform (and to be more precise; the incredible work of our users) has been honored with awards such as the SXSW Innovation Award. Fast Company listed Wevolver in the 2016 Top Most Innovative Webplatforms, in between Facebook, Slack, and IBM Watson.<p>We are now developing a powerful version control system for hardware projects to take Wevolver to the next level. That’s where you come in.<p>ROLE:\nWork closely with our founders, developer, and community manager on functionality that directly impacts Wevolver’s growth. You’ll have autonomy and will be strongly involved in all major decisions. Furthermore:<p><pre><code>  • architect and improve performance of our API and web-platform,\n  • develop new features in a collaborative and test-driven environment,\n  • maintain our databases and servers.\n  We are currently on Angular 1 and will either upgrade or move to React (a decision which you can influence)\n</code></pre>\nSalary range: $40K – $120K · 2.0% – 7.0% (depending on location &amp; experience)<p>Job details: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;Zwkh4X\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;Zwkh4X</a><p>Contact: info@wevolver.com<p><i>Looking forward to hearing from you! On behalf of the Wevolver team;</i>\n<i>Bram Geenen</i>","time":1493656796,"type":"comment"}