{"by":"mike_sri","id":14242631,"parent":14238005,"text":"SRI International | Software Engineer | Menlo Park, CA | ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;www.sri.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sri.com</a><p>SRI’s Center for Health Sciences Neuroscience Program is seeking a Software Engineer (full time) who will contribute to the development and maintenance of an open-source data management system supporting multi-modal, large scale data of multi-center neuroscience studies. The engineer will interface with imaging and computer scientists to scale up the software platform from supporting a single study to several projects concurring simultaneously. This will require creating robust monitoring systems of backend and frontend, designing and performing stress tests, configuring databases, and developing processing pipelines and web-interfaces for data collection, analysis, and distribution. This position provides the opportunity for the applicant to enhance his or her skill set while participating in state-of-the-art software system development within a multi-disciplinary team, whose goal is to advance data science aimed at identifying biomedical phenotypes of neuropsychiatric disorders.<p>Partnered with the Department of Psychiatry at Stanford University, the Neuroscience Program is federally funded to perform multidisciplinary and translational research focusing on substance abuse, sleep, HIV, and adolescent brain development by combing machine learning with imaging technology. Imaging studies are performed on MR imaging systems on the SRI site and in collaboration with other centers, such as the National Consortium on Alcohol and Neurodevelopment in Adolescence (NCANDA) and NIH’s Big Data to Knowledge (BD2K) initiative. The research program is interdisciplinary and consists of clinicians, computer scientists, physicists, psychologists, and statisticians, with appointments at SRI International or Stanford.<p>Qualifications\n•    Bachelor or Masters in computer science or related field.\n•    At least 3 years of experience in software development on Linux platforms\n•    Excellent coding skills in Python and Bash scripting; hands-on experience with REST APIs is preferred.\n•    Extensive experience in developing scalable backends and frontends. Full-stack skills are appreciated.\n•    Hands-on experience in database management preferable with MySQL and PostgreSQL.\n•    Knowledge of XNAT, REDCap, Docker Containers, and cloud computing is a plus<p>SRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Employment with SRI International is contingent upon the satisfactory completion of a background check.<p>For more information about the position or to apply please visit\n<a href=\"https:&#x2F;&#x2F;jobs.brassring.com&#x2F;tgwebhost&#x2F;jobdetails.aspx?jobId=2799495&amp;PartnerId=25653&amp;SiteId=5461&amp;type=mail&amp;JobReqLang=1&amp;recordstart=1&amp;JobSiteId=5461&amp;JobSiteInfo=2799495_5461&amp;gqid=0\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.brassring.com&#x2F;tgwebhost&#x2F;jobdetails.aspx?jobId=2...</a><p>or go to <a href=\"https:&#x2F;&#x2F;www.sri.com&#x2F;careers&#x2F;search-jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.sri.com&#x2F;careers&#x2F;search-jobs</a> and enter Auto Req ID 1453BR","time":1493680441,"type":"comment"}