{"by":"ridewithus","id":14245357,"parent":14238005,"text":"Thunderhead | Mobile Engineer | Manchester, NH, US | Full-time | ONSITE <a href=\"https:&#x2F;&#x2F;www.thunderhead.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thunderhead.com&#x2F;careers&#x2F;</a><p>Thunderhead is a privately owned software company, who since launching in 2004, has become a recognized global leader in the customer engagement market. With its cloud-based, intuitive ONE Engagement Hub, Thunderhead joins up web, mobile, in-store and contact center customer experiences giving brands a multi-dimensional understanding of customer journeys and enabling actionable conversations in real time.<p>We are looking for a talented Mobile Engineer to join an agile development organization to develop and deliver enterprise-grade mobile products, which connect to Thunderhead’s existing Cloud solutions. We are looking for someone to join us and help build SDKs that the world’s best app engineers would be excited to use in their apps.<p>Our current iOS SDK codebase in is Objective-C so you will have a great deal of experience building native mobile apps and&#x2F;or libraries on iOS using Objective-C. \n•\tYou care about quality and you know what it means to ship high quality code&#x2F;products \n•\tYou have a deep understanding of the Cocoa Touch APIs \n•\tYou have an understanding of what makes life easier for mobile developers\n•\tYou are creative, open to experimentation and never shy to push the boundaries of what’s possible<p>Our careers page: <a href=\"https:&#x2F;&#x2F;www.thunderhead.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thunderhead.com&#x2F;careers&#x2F;</a><p>Job post and online application: <a href=\"https:&#x2F;&#x2F;www.thunderhead.com&#x2F;available-roles&#x2F;mobile-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thunderhead.com&#x2F;available-roles&#x2F;mobile-engineer&#x2F;</a><p>Please mention “HN: Who is hiring?” when you apply.<p>Got any questions? Please email us: ridewithus [at] thunderhead [dot] com","time":1493722203,"type":"comment"}