{"by":"frequent","id":14241077,"kids":[14241095],"parent":14238005,"text":"NEXEDI | Lille&#x2F;Munich&#x2F;Paris&#x2F;Plovdiv | ONSITE | 4&#x2F;12 months INTERNS<p>We are looking for new colleagues to help improve our FOSS software solutions and contribute to research and industrial projects. If you are passionate about open source software and like one of our topics on <a href=\"http:&#x2F;&#x2F;www.nexedi.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nexedi.com&#x2F;jobs</a> get in touch with us! Candidates will do a programming challenge followed by an interview. We&#x27;re currently looking for:<p><pre><code>    - Nexedi | Web Mesh Network JavaScript Developer | Lille | INTERN    \n\n    - Nexedi | Artificial Language Processing Python Developer | Lille | INTERN    \n\n    - Nexedi | Connected Cars JavaScript Developer | Lille | INTERN  \n\n    - Nexedi | Site Reliability Python Developer | Paris | INTERN   \n\n    - Nexedi | Out-Of-Core Numpy Python Developer | Munich | INTERN  \n\n    - Nexedi | Big Data Machine Learning Python Developer | Lille | INTERN     \n\n    - Nexedi | Linux JavaScript Port Developer | Lille | INTERN  \n\n    - Nexedi | AI Business Bot Python Developer | Munich | INTERN  \n\n</code></pre>\nAbout Nexedi: We are a small international team of about 30 programmers (headquarters in Lille, France) creating free software since 2001. We run our own stack with ERP5 (Business Suite), SlapOS (Cloud Deployment) and Wendelin (Big Data&#x2F;Machine Learning) being the main solutions for which we provide customization services (our code is free, our time isn&#x27;t). We have time to tinker, need to think out-of-the-box&#x2F;ram&#x2F;space and work mostly autonomous. We all use Chromebooks, our hierarchy is as flat as the area around Lille, our offices are paperless and we have no meetings. We mostly hack in Python and (vanilla) JavaScript. If you&#x27;re looking for fame or gain, we&#x27;re not the right place. For purpose and leverage, we might be worth considering. Join us!","time":1493669524,"type":"comment"}