{"by":"mlent","id":14247953,"parent":14238005,"text":"SumUp | Fullstack Javascript Engineer | Berlin | ON-SITE, Visa | <a href=\"http:&#x2F;&#x2F;sumup.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;sumup.co.uk</a> (or <a href=\"http:&#x2F;&#x2F;sumup.de\" rel=\"nofollow\">http:&#x2F;&#x2F;sumup.de</a> if you speak German already!)<p>I am looking for someone who loves JavaScript to join the team. Our fullstack position is frontend-heavy, so it&#x27;s also perfect for someone who is UI&#x2F;UX-oriented but also wants to become better rounded. It can also work for someone who is traditionally a backend-er and wants to see what all the hype in the frontend is about. Our base expectation is a solid foundation in programming, and we&#x27;re off to a great start. You&#x27;ll fit in perfectly to our team if:<p>- You not only love coding, but also take the time to reflect on the benefits and drawbacks of your tools, be they frameworks, languages, or processes.<p>- You strive for clean code, but also know how to make your &quot;shortcuts&quot; easy to delete in a crunch.<p>- You know what to test, why to test it, and how to write flexible tests that won&#x27;t break with minor changes.<p>- You&#x27;re comfortable with Linux and know how to get things done on the command line, including on remote servers.<p>- You&#x27;re not afraid to use Google or ask for help when something is beyond your grasp.<p>- You care about user interaction, usability, and of course – making the interface beautiful.<p>- In general, technology excites you and you strive to learn something on a daily basis!<p>We&#x27;re working on an Angular 1.6 app, and transitioning sections of it to React. An ideal team mate would have familiarity with both frameworks, but a solid foundation in one is sufficient.<p><a href=\"https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;373611\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;373611</a><p>-----<p>SumUp | Junior Frontend Developer | Berlin | ON-SITE, Visa | <a href=\"http:&#x2F;&#x2F;sumup.co.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;sumup.co.uk</a><p>The junior developer position is for someone who wants to grow into being more technical, but is already starting with a solid foundation in HTML, CSS, and programming fundamentals. This position is perfect for someone who finds the fullstack job description exciting, but needs to get some more experience before taking the leap.<p><a href=\"https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;477384\" rel=\"nofollow\">https:&#x2F;&#x2F;sumup.workable.com&#x2F;jobs&#x2F;477384</a><p>-----<p>Note for both positions: If you are not an EU citizen, we can sponsor your visa, but please consider that our hiring process involves on-site interviewing and on-site trial work!","time":1493743283,"type":"comment"}