{"by":"dillonforrest","id":14242636,"parent":14238005,"text":"RankScience (YC W17) | San Francisco, CA | Full Time | On-site only | Salary + Equity + Benefits + 15 day minimum vacation policy<p>We&#x27;re hiring for an engineer focused on product at RankScience! Junior- or entry-level experience okay. On-site at RankScience HQ in San Francisco (no remote). Our office is at 17th &amp; Valencia in the Mission!<p>Why this role matters to RankScience:<p>- Scalability: This role enables our company to scale to 50 customers, and then to 500 customers, and then 5000 customers.\n- Bleeding-edge business model: This role enables our unique business model to have the scalability of a product company while also charging at the price point of an agency.\n- Software eating the world: We want to change the way people think about acquiring search traffic, and this role will help our software eat the search marketing industry.<p>What you will gain from this role:<p>- Breadth of product exposure: We have lots of software to build to interface with many different types of users or other services. We think that 1-2 years at RankScience right now will offer more learning than 1-2 years at most other companies.\n- Distributed systems expertise: This role will work with many if not all of the services that we have in our infrastructure. We expect this role to provide plenty of opportunity to develop broad distributed systems skills.\n- Create outsized impact on a growing startup: We’re looking for team members who want to play a huge role in a startup pursuing hypergrowth.\n- The ability to create bleeding-edge technology: We have some unique tech that has never been built before, and we want to continue building even more unique tech. After your time at RankScience, you’ll be able to build anything you want.<p>Responsibilities: Build software to interface with all of the following...<p>- Our CDN servicing 1,000 requests per second\n- Our SEO managers to implement thousands of concurrent A&#x2F;B tests and automated SEO changes\n- Our customers to gain visibility into our tech\n- Other services within the RankScience stack<p>About RankScience: We sell SEO software. We&#x27;re funded by Y Combinator. We&#x27;re almost 10 people now and are focusing on building out our product!<p>Our TechCrunch coverage: <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;02&#x2F;07&#x2F;rankscience-wants-to-replace-your-seo-staff&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;02&#x2F;07&#x2F;rankscience-wants-to-repla...</a><p>Our CEO Ryan Bednar on the IndieHackers podcast: <a href=\"https:&#x2F;&#x2F;www.indiehackers.com&#x2F;podcast&#x2F;011-ryan-bednar-of-rankscience\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indiehackers.com&#x2F;podcast&#x2F;011-ryan-bednar-of-rank...</a><p>If interested, please email dillon@rankscience.com with a cover letter and a resume&#x2F;LinkedIn!","time":1493680469,"type":"comment"}