{"by":"danielmorozoff","id":14240061,"parent":14238005,"text":"Vidrovr Inc. | Research Engineer | NYC | Full Time | <a href=\"http:&#x2F;&#x2F;vidrovr.com\" rel=\"nofollow\">http:&#x2F;&#x2F;vidrovr.com</a><p>About Vidrovr: \nVidrovr can index, search, and recommend video content in a cost-effective, automatic, and accurate manner. It was founded by two former PhD Students in the Digital Video and Multimedia Lab at Columbia University and is advised by Prof. Shih-Fu Chang, of Columbia Engineering. The team has published and patented foundational research in machine learning, computer vision, multimodal information processing, and multimedia. Vidrovr addresses three key market needs: 1. Domain and customer specific automatic metadata generation for videos, 2. Video Content Management solutions that enable automatic placement and recommendation of video clips for digital products, and 3. Automatically linking and sourcing visual social media content that is relevant to a particular video or online article before it is published. Vidrovr is currently looking to build a team to commercialize and enhance the core technologies that have already been developed. Vidrovr just completed Techstars NY and was named as one of the winners of the prestigious Publicis90 competition, which entails investment and mentorship from Publicis Groupe. Vidrovr was awarded a National Science Foundation Small Business Innovation Research Grant to develop a unified multimodal framework for video understanding leveraging context and existing metadata. Check out the Vidrovr website for more information.<p>Job Description: \nThe ML&#x2F;CV Research Engineer position at Vidrovr can be described as follows: \n- The RE will take part in building a unified framework for processing and combining multimodal sources of information for video understanding. \n- The RE will lead the development real-time video and data analysis pipelines to handle large amounts of data, which could be social media streams, online articles, and&#x2F;or images and video content. \n- The RE will manage the technical development of the product and work closely with business development to ensure that the technical design and aspects of the system meet business needs. \n- All of the computing systems and interfaces will be built and maintained on Amazon Web Services.<p>Job Requirements: \n- M.S. in CS, EE, Stats or other quantitative field (Ph.D. highly preferred) \n- 5+ years experience working with and designing large and real time data analytics systems, and a documented history of code or research accomplishments. \n- Proven research or documentable system development building state-of-the-art multimedia algorithms (Computer Vision, Data Mining, Machine Learning, etc.) \n- Highly proficient in at least one of the following programming languages: Python, C++, or Java. (Experience in Python preferred) \n- Friendly, hard-working, collaborative, and able to multitask are musts in an early-stage start-up, like Vidrovr. \n- The candidate must be excited about developing and being influential in creating the corporate culture at an early stage start-up, and implementing engineering policies and best practices, company-wide.<p>We are hiring for more generalist positions as well.<p>Feel free to reach out at contact@vidrovr.com","time":1493662933,"type":"comment"}