{"by":"tonyleask","id":14242595,"parent":14238005,"text":"Dictionary.com | Senior Software Engineer (Full Stack) | Oakland, CA | Onsite Fulltime, VISA Friendly | Salary (depends on experience) + Annual Bonus + Great Benefits<p>We are passionate about building great products and are inspired by the possibility of unlocking the power of language through technology. We are enthusiastically creating a high performance, collaborative culture. We are searching for a driven individual who shares this mentality to join our team..<p>We’re looking for engineers who have mastered modern technology framework, and with them, you love to build and launch products at consumer scale. You believe in Agile based development strategies, and have a strong preference for TDD&#x2F;BDD, or similar development methodologies. You balance out-of-the box thinking and pragmatic execution, and have a strong track record of continuously improving great software.<p>Technical needs:\n- Mastery of at least one modern backend stack (PHP, JavaScript, Ruby)\n- Understand both SQL and NoSQL\n- Experience engaging with product owners, quality engineers and other teammates<p>Benefits:\n- Unlimited vacation\n- Competitive salary plus bonus\n- Great benefits (medical, dental, vision, 401k matching, legal insurance, pet insurance)\n- Unlimited snacks&#x2F;drinks, frozen yogurt and beer\n- Relocation assistance (if moving to the SF Bay Area)\n- Close to many public transit options (BART, Ferry, AC Transit)\n- Subsidized dollars towards public transit or parking garage\n- Tuition Reimbursement<p>For full job description and to apply, visit: <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;k9SPYg\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;k9SPYg</a> (or e-mail jobs@dictionary.com)<p>About our company: <a href=\"http:&#x2F;&#x2F;content.dictionary.com\" rel=\"nofollow\">http:&#x2F;&#x2F;content.dictionary.com</a>\nFor more jobs, visit: <a href=\"http:&#x2F;&#x2F;content.dictionary.com&#x2F;about&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;content.dictionary.com&#x2F;about&#x2F;careers</a>","time":1493680163,"type":"comment"}