{"by":"dkislyuk","id":14243756,"parent":14238005,"text":"Visual Search at Pinterest | Software Engineer | Full time or students (part-time) | San Francisco | visual search &#x2F; deep learning &#x2F; full stack engineering<p>Visual Search team at Pinterest is looking for engineers to work on applied computer vision products, with a focus on large-scale image retrieval, ranking &#x2F; search quality, object detection, and visual embedding learning. The team is composed of backend engineers, and we work on everything from building scalable search infrastructure, to building out a visual search platform to help our partners, to applying and developing the latest advances in deep learning to visual discovery products used by hundreds of millions of users, such as the recently launched Pinterest Lens. We also recently started powering the visual search component of Samsung&#x27;s Bixby AI. Our team&#x27;s mission is to build the fastest and most relevant visual search engine possible, which requires solving challenging problems in infrastructure, search ranking, visual representation, fine-grained recognition, training embeddings which capture taste&#x2F;style, billions-scale visual object graphs, etc. Our progress in this area is summarized in our recent paper: <a href=\"https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;1702.04680.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;arxiv.org&#x2F;pdf&#x2F;1702.04680.pdf</a>. Publication from the team is encouraged, and we hire anywhere on the spectrum of research scientist to full-stack hacker. We&#x27;re a small team within Pinterest with direct ownership of both product and modeling &#x2F; visual search infra, presenting a unique opportunity to learn or mentor a wide range of problems.<p>If you are interested, please send your resume directly to dkislyuk@pinterest.com. We are looking for strong Python&#x2F;C++ coders, willingness to hack on large-scale visual search systems and learn quickly. Familiarity with developing deep learning models and frameworks such as Caffe&#x2F;Tensorflow is preferred, but if you&#x27;re willing to learn we can teach.","time":1493695904,"type":"comment"}