{"by":"jetcom","id":14240587,"parent":14238005,"text":"Iterable (<a href=\"https:&#x2F;&#x2F;iterable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;iterable.com&#x2F;</a>) - San Francisco, CA - ONSITE<p>Come join Iterable. We&#x27;re 54 people bringing the growth hacking tools that consumer internet companies like Google&#x2F;Twitter&#x2F;Facebook build internally to other large-scale companies. We aim to build the best user growth engine on the planet.<p>Our team is from Twitter&#x2F;Google&#x2F;Palantir&#x2F;Salesforce&#x2F;CMU&#x2F;MIT&#x2F;Harvard&#x2F;UC Berkeley, and one of our top-level goals is to build a uniquely fun and growth-oriented company culture. This is an opportunity to join a super-fast growing startup, in a huge market and with a great team, while it&#x27;s still early.<p>If you&#x27;re interested in coming on board, you can help with some challenges we face:<p><pre><code>  - Scale our messaging API\n  - Design and write performant, asynchronous interfaces\n  - Write software to build machine learned user models\n  - Make data visualizations for our email and user data\n  - Design an immutable deployment infrastructure for our platform</code></pre>\nSome aspects of our culture that make us different:<p><pre><code>  - We are all very focused on self improvement\n  - Our company has egalitarian and transparent values (work when you want, on what you want)\n  - We are chill &amp; empathetic people\n  - The company is completely transparent</code></pre>\nTechnologies you&#x27;ll work with:<p><pre><code>  - Scala\n  - Elasticsearch\n  - Postgres\n  - Redis\n  - AngularJS\n  - Play Framework\n  - RabbitMQ\n</code></pre>\nWork with us at our new office at 3rd &amp; Harrison in SF. If this sounds like a fun opportunity for you, email us at aXRzYXVuaXhzeXN0ZW0raG5AaXRlcmFibGUuY29t or take a look at our open positions here: <a href=\"https:&#x2F;&#x2F;iterable.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;iterable.com&#x2F;company&#x2F;careers</a>","time":1493666329,"type":"comment"}