{"by":"im_down_w_otp","id":14240129,"parent":14238005,"text":"PolySync Technologies | Chaos Engineer &amp; Distributed Systems Engineer | Portland, OR | Fulltime | ONSITE&#x2F;REMOTE | <a href=\"https:&#x2F;&#x2F;polysync.io\" rel=\"nofollow\">https:&#x2F;&#x2F;polysync.io</a><p>PolySync is working to build the most advanced safety-critical runtime for autonomous vehicles. Working with our existing customers across the industry (automotive OEMs, tier 1 &amp; 2 suppliers, and silicon makers) PolySync is pioneering the best-practices for process, architecture, and implementation for software interfaces that tie together the sensor and control capabilities of autonomous vehicles. PolySync&#x27;s engineering efforts focus on three key performance indicators: high-assurance, fault-tolerance, and mechanical sympathy. Join us and help shape the definition of safety and reliability in this emerging mobility marketplace. Email us at jobs@polysync.io to get things rolling (pun intended).<p>---<p><i>Chaos Engineer</i> - We&#x27;re looking for someone to help us advance the state-of-the-art in chaos testing and auto-remediation&#x2F;recovery for our on-vehicle fail-operational runtime.<p>- Ideally you&#x27;re especially skilled at characterizing the operational semantics of a physical system and measuring them against expected behaviors and the known limits imposed by physics.<p>- When you see something new your first thought is, &quot;I wonder what catastrophic way this thing fails to do what it promises to do.&quot; and your second thought is, &quot;How can I prove how broken it is and then fix it so that it&#x27;s no longer lying to me?&quot;<p>- The sight of a by-wire vehicle bucking about &amp; spazzing out as its perception sensors and control actuators drop in and out of operation fills you with a sanguine zen instead of paralyzing anxiety.<p>---<p><i>Distributed Systems Engineer</i> - We&#x27;re looking for someone to help us improve the distributed architecture and implementation of our on-vehicle autonomy middleware.<p>- Ideally you maintain a healthy distrust of wall-clock time and your wristwatch displays a dotted-version-vector-set tracking all the instances in your life you received a response to the question, &quot;Hey, what time is it?&quot;<p>- You see the insights derived from the CAP theorem as living on a spectrum, but you&#x27;re keenly aware of where the bright lines are drawn which keep you from offering specific guarantees, and you step over them with deliberate and well communicated intent.<p>- At all times you assume _any system_ is in a degraded state and you work well within the constraints of continual uncertainty while ensuring that high-level behavioral properties are stable.<p>---<p>We place a high emphasis on expressing and fostering a growth mindset both in the engineering team and throughout the company. We believe that cultivating improvement and growth as individuals &amp; professionals, with the support of our peers and the support of company leadership, is the best way for us to improve and grow as a business.<p>If that paints a picture of how you approach things, then send us a message to start the conversation. jobs@polysync.io<p>We currently use C, C++, Python, Elixir, and Rust in our development efforts. Existing experience in any or all of those is helpful. A willingness to become an expert in them is essential.<p>PolySync Technologies&#x27; singular vision is to simplify and accelerate the development of self-driving cars. Founded in 2013, the company has developed a software platform that enables automakers and autonomous vehicle startups to seamlessly build, test, and deploy safe driverless vehicle applications. Our team of 26 is building the future of the software-defined car currently in Portland, OR and Detroit, MI.","time":1493663279,"type":"comment"}