{"by":"OscarPedroso","id":14250109,"parent":14238005,"text":"Thimble.io | Marketing Director | Buffalo, NY | Onsite | Full time<p>What we do: Thimble teaches beginners the basics of building electronics by providing a monthly subscription kit and curated instructions. (Imagine building a new robot or quadcopter every month) We’ve built 16+ engaging kits, each with an intuitive web interface and video tutorials. Examples of projects include a WiFi-robot, LED cube, robotic arm, alarm clock, weather station, quadcopter, etc. You can find us at <a href=\"https:&#x2F;&#x2F;www.thimble.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thimble.io</a>.<p>Traction: We launched on Kickstarter during February ‘16, and raised just shy of $300,000 with close to 1,800 backers. And we delivered! :)  We started shipping in December ‘16 and have been growing significantly every month since then. We are currently delivering our kits in all 50 states and 7 continents. (Our Kickstarter can be viewed here in case you&#x27;re curious: <a href=\"http:&#x2F;&#x2F;kck.st&#x2F;1QodNaL\" rel=\"nofollow\">http:&#x2F;&#x2F;kck.st&#x2F;1QodNaL</a>) Since Kickstarter, we&#x27;ve launched our own online store and have decent monthly recurring revenue.<p>As you might imagine, we&#x27;ve reached a pivotal point in our startup company and we&#x27;re currently looking to hire someone to run our marketing department. This is an essential hire for us as this person will run the entire department (data-driven marketing&#x2F;advertising: digital and traditional ad buys, earned media, interactive content and ad copy creation). We&#x27;ve been doing this ourselves but have been half-assing it and need someone who can own it and push us forward.<p>Qualifications: \n--3-5 years experience in digital marketing across all disciplines with an emphasis on media buying, campaign tracking&#x2F;optimization, content marketing and influencer marketing<p>--Being data-driven and kind of a data-geek; clear understanding of data, analytics, metrics and statistics<p>--Maker&#x2F;DIY &quot;I can do this&quot; attitude or familiar with Maker Movement<p>--Being social and understanding users&#x27; behaviors.  Having great customer relations skills<p>--Graphic&#x2F;web design skills (comfortable with HTML&#x2F;CSS, vector and raster graphics)<p>--A&#x2F;B testing and data analytics experience<p>--Editing and copywriting skills<p>--Knowledge about both inbound and outbound marketing<p>--Being curious and creative<p>--Being relentless in pursuit of growth<p>--Willing to learn<p>If this sounds like something you might be interested in, please reach out to us at oscar at thimble dot io. We&#x27;re three guys at the moment and looking for someone that wants to grow and be a part of something big and meaningful. Thanks in advance for reading! :-)","time":1493755763,"type":"comment"}