{"by":"mands","id":14256326,"parent":14238005,"text":"NStack | London, UK | Full time | Onsite &amp; Remote | Functional Programmers and Full-Stack Devs | <a href=\"http:&#x2F;&#x2F;nstack.com\" rel=\"nofollow\">http:&#x2F;&#x2F;nstack.com</a> &#x2F; <a href=\"http:&#x2F;&#x2F;www.github.com&#x2F;nstack&#x2F;nstack\" rel=\"nofollow\">http:&#x2F;&#x2F;www.github.com&#x2F;nstack&#x2F;nstack</a><p>NStack lets data analysts to do sophisticated data work in the cloud without a team of engineers. To accomplish this, we’re a building a platform for composable, data-driven microservices, using a mixture of Haskell and low-level Linux systems tech (including containers, systemd, IPC, with some typed DSLs, systems code, and distributed systems thrown in). Our aim is to use the fundamental lessons of programming languages and operating systems to provide an abstraction over infrastructure - think Bash for containerised microservices.<p>We’re looking for both talented backend&#x2F;systems programmers -- preferably with some knowledge of typed functional languages and *NIX systems programming -- and smart generalists &#x2F; full-stack developers to join our team to make this a reality. It’s a challenging role, working on hard problems, and offers the chance to work with a top technical team and shape a company and product from an early stage.<p>NStack is funded by top-tier investors from the West Coast, the founders are both technical and ex-YC &#x2F; academia, and our team is lucky enough to include world-class talent for the problem we&#x27;re solving. Salaries are competitive and include generous stock options. We&#x27;re generally hiring onsite, however remote within Europe is also possible for the right candidate. We’re looking at a range of positions and experience levels - whether you’ve just left uni or been hacking for 20 years, if you’re interested please get in touch.<p>Any questions please comment, reach out via jobs@nstack.com, or <a href=\"https:&#x2F;&#x2F;angellist.com&#x2F;nstack&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angellist.com&#x2F;nstack&#x2F;jobs</a>\nCheers!","time":1493824265,"type":"comment"}