{"by":"ramikhalaf","id":14250021,"parent":14238005,"text":"Workpop | Front End Engineer, Android Engineer | Santa Monica, CA | ONSITE VISA RELOCATION | www.workpop.com | 5+ openings<p>Workpop is looking for mission driven, talented, and passionate front-end software engineers to join our growing team. You work where design meets code. You know HTML5, CSS3, and JavaScript like the back of your hand. You&#x27;re passionate about experimentation, innovation, and playing around with the latest front-end technologies. You write clean, compatible, powerful user interfaces with speed. Bonus points if you are passionate about understanding your audience, and dreaming up ways to build great experiences for them. As a core member of our growing team, you&#x27;ll work closely with the rest of our design, engineering, product, team to turn ideas into tangible user experiences. You&#x27;ll combine your keen design sense, stellar front-end chops, and the right technologies, to realize these ideas and validate them with users. Your wizardry will translate design concepts into living, breathing prototypes and finished products. We are a JavaScript shop: React, Meteor, node.<p>As an Android developer at Workpop, you will work with our team of talented engineers to design and build the next generation of our mobile applications. This position offers an inspirational space to create, collaborate, and drive future development.<p>Workpop is the world&#x27;s first Applicant Hiring System that doesn&#x27;t just track applicants, but delivers the best candidate experience required to win in today&#x27;s competitive talent market.  While typical hiring software focuses on tools to simply screen candidates, Workpop knows that top candidates are evaluating employers on their application and hiring process. Through modern design that showcases the brand and intuitive software that encourages candidate interaction rather than hindering it, Workpop helps companies attract and hire the best. Our advanced technology automates sourcing, removes friction and engages candidates from the moment they see your job post. Our user-friendly screening tools empower managers and collaborators to meaningfully communicate with applicants and to make thoughtful decisions faster.  And our paperless onboarding system drastically reduces costs while allowing new hires to contribute immediately on day one of the job.  With Workpop, you don&#x27;t track applicants; you engage and hire them.<p>You can apply here \n<a href=\"https:&#x2F;&#x2F;www.workpop.com&#x2F;jobs&#x2F;BLxXLZqX3GixjQkG3\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workpop.com&#x2F;jobs&#x2F;BLxXLZqX3GixjQkG3</a>\n<a href=\"https:&#x2F;&#x2F;www.workpop.com&#x2F;jobs&#x2F;yjy8q9ykvm6WDzjXQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workpop.com&#x2F;jobs&#x2F;yjy8q9ykvm6WDzjXQ</a> \nand mention hackernews, or reach out to me at &#x27;rami&#x27; at &#x27;workpop.com&#x27;","time":1493755201,"type":"comment"}