{"by":"sshrinivasan","id":14260650,"kids":[14261668],"parent":14238005,"text":"Zymeworks Inc. (www.zymeworks.com) | Web Application Developer | Vancouver, BC | ONSITE<p>Process: Telephone conversation -&gt; Small code review task -&gt; On-site interview (with optional Skype call if outside Vancouver)<p>We are looking for a web application developer with expertise in data visualization, user interface design and browser based tools to join our software team. This is an ideal opportunity for an individual who enjoys working with diverse teams of scientists and software developers to contribute towards our research platform. There is great scope for learning and professional development within a collegial and inclusive team. This position will report to the Group Lead of the Software Development Team.<p>We expect you to have…<p>-- Proven experience with interactive web application development<p>-- A good grasp of web standards and browser technology<p>-- A working knowledge of HTTP, REST and the nuances of API design<p>-- Experience with our software stack or equivalent technologies<p>-- Proficiency in English, spoken and written<p>Duties:<p>-- Create browser-based visualization, UI and data analysis tools tailored to our scientists&#x27; R&amp;D needs.<p>-- Collaborate with scientists and developers to condense complex requirements, design prototypes and deploy production grade software for internal users.<p>-- Participate in peer code reviews, regression testing and systematic deployments.<p>-- Experiment with new technologies and ideas to enhance the maintainability, simplicity and robustness of our platform.<p>Our Stack:<p>-- React, AngularJS, D3, and Elm<p>-- Python<p>-- PostgreSQL<p>-- Go and Elixir<p>Zymeworks is a fast growing, clinical-stage biotechnology company developing protein therapeutics for the treatment of cancer using computational technologies. We develop molecular simulation algorithms, data analysis and visualization pipelines, bioinformatics and machine learning applications, as well as high performance computing infrastructure for our scientific tools.","time":1493849314,"type":"comment"}