{"by":"BCharlie","id":14264350,"parent":14238005,"text":"GE Power | Sr. Software Security Programmer | Atlanta, GA USA | <a href=\"http:&#x2F;&#x2F;www.ge.com&#x2F;careers&#x2F;opportunities?keyword=2749772\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ge.com&#x2F;careers&#x2F;opportunities?keyword=2749772</a><p><i></i>About us<i></i>:\nWe&#x27;re a new team of software engineers focused on helping the business build secure software on GE&#x27;s Predix platform (predix.io).<p><i></i>About the role<i></i>:<p>We build security tools for development teams (CI&#x2F;CD security plugins, platform scanners, log aggregators), security focused libraries (2 factor authentication, OAuth wrappers, encryption wrappers), and anything else that might help our teams be more secure.<p>We also embed directly with product teams as security focused developers - ensuring user stories around security are being implemented, teaching developers about secure coding, and building the most sensitive parts of our critical applications.<p><i></i>Technology focus areas<i></i>:\nGE is a big company, and we support teams that use all sorts of languages, frameworks, and technologies. The most frequent technologies we work with are:<p>* Java with SpringBoot\n * Angular\n * Polymer\n * Node<p>Other languages I am seeing more of: Python, Ruby, Elixer, Go\nWhen we build internal tooling, we pick the best tools for the job.<p><i></i>What we look for<i></i>:\nGreat programmers who love security and understand secure coding. Experience with the technologies listed above, CI&#x2F;CD, TDD, and general development best practices is key.<p>If you love to code, understand how to find, exploit, and fix vulnerabilities in web apps, and want to help us build security tooling and improve app, I&#x27;d love to chat!<p><i></i>Apply<i></i>\nYou can find the full job posting at <a href=\"http:&#x2F;&#x2F;www.ge.com&#x2F;careers&#x2F;opportunities?keyword=2749772\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ge.com&#x2F;careers&#x2F;opportunities?keyword=2749772</a>, or go to ge.com&#x2F;careers and search for job number 2749772<p>You can also just reach out to me with questions!","time":1493901634,"type":"comment"}