{"by":"GeocachingHQ","id":14276543,"parent":14238005,"text":"Geocaching | UX&#x2F;UI Designer | Seattle, WA, USA | Full-time, On-site<p>Interview includes 2 phone screens, an exercise, Skype interview for candidates who aren&#x27;t in the Seattle area + on-site interview for all candidates.<p>Relocation available. Award winning benefits package and a 6 year in a row &quot;Best Place to Work&quot; winner from Outside Magazine.<p>About Geocaching HQ:\nWe are the global headquarters for the game of geocaching. Our apps and Geocaching.com website allow a global community of more than 10 million people to join in a real-world treasure hunt.<p>Position overview:\nWe want to maximize the ease-of-use for all of our products, so our users can spend less time figuring out how our applications work and more time playing outside. The UX&#x2F;UI Designer for Web will assist in all phases of product development, including research, ideation, validation and high-fidelity visual design.<p>We need you to make the cool, innovative things that will turn Geocaching into a trend-setter on the international stage.<p>What you’ll do:\n- Work as a critical member within a team of product owners, producers and developers to deliver world-class experiences\n- Create what it takes to articulate the design, including whiteboard sketches, user flows, wireframes, interactive prototypes, animations and redlines\n- Interview users, gather requirements from stakeholders, present your designs, and explain the reasoning behind design decisions\n- Contribute to the growth of the UX team through critiques, brainstorms, discussions and recommendations<p>What we’re looking for:\n- 5+ years of practical UX and UI design experience\n- B.A. and&#x2F;or Master&#x27;s degree in HCI or related field\n- Strong illustration and animation skills are a HUGE PLUS\n- A portfolio or sample work that clearly demonstrates successful implementation of user-focused design solutions\n-Solid understanding of interaction design fundamentals and best practices for responsive design\n- Awareness of HTML&#x2F;CSS&#x2F;JavaScript technologies and how design choices translate into development\n- Passion for the outdoors and gaming, especially in the online&#x2F;mobile sphere.<p>Apply at www.geocaching.com&#x2F;jobs.","time":1494015601,"type":"comment"}