{"by":"jangid","id":14271494,"parent":14238005,"text":"Optimizory | Product Evangelist | NOIDA, India | ONSITE, SALARY: 350k-500k INR + bachelor accommodation, <a href=\"http:&#x2F;&#x2F;www.optimizory.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.optimizory.com&#x2F;</a><p>Optimizory was created with a vision of building innovative products, which address key problems faced by the target segment. We are now proud owners of two segment leading products vREST and RMsis.<p>We strongly believe that people are the key constituents of a great company and hence look forward to working with people with diverse ideas, a lot of energy and a deep expertise in their domain.<p>The culture in the company is very informal with lots of flexibility in all respects and you get to work with some of the brightest people in the industry.<p>This role is all about delivering a usable Requirements Management product to the market and enabling the end user of the product to use the product. The person in this role will be a part of the product management team. The key requirements of this role are as follows:<p><pre><code>  - Understanding the product in details\n  - Understanding the Requirements Management Tools market and customer needs\n  - Testing the product from end user viewpoint\n  - Resolving customer queries\n  - Giving presentations &#x2F; providing solutions to the users\n  - Simulating customer scenarios and issues, which can be addressed by the development team\n</code></pre>\nThe person in this should possess the following<p><pre><code>  - A degree in Computer Science or equivalent with a decent understanding of the subject\n  - Should be able to quickly understand, install and use unfamiliar software\n  - Willingness to interact with customers and managing two-way communication\n  - High energy and eagerness to quickly resolve customer issues\n</code></pre>\nPlease note that this is not a sales job. It is not exactly marketing but the role is quite similar. It is all about interacting with users, acquiring domain knowledge and helping the users to adopt the product. One of the most critical positions in the company.<p>The selection process has three stages — (1) Online Programming Test (2) Video Chat (3) Onsite Interview.<p>To apply, send your resume to career@optimizory.com","time":1493965556,"type":"comment"}