{"by":"GeocachingHQ","id":14276554,"parent":14238005,"text":"Geocaching | Senior Front End Developer | Seattle, WA, USA | Full-time, On-site<p>Interview includes 2 phone screens, Skype interview for candidates who aren&#x27;t in the Seattle area + on-site interview for all candidates.<p>Relocation available. Award winning benefits package and a 6 year in a row &quot;Best Place to Work&quot; winner from Outside Magazine.<p>About Geocaching HQ: We are the global headquarters for the game of geocaching. Our apps and Geocaching.com website allow a global community of more than 10 million people to join in a real-world treasure hunt.<p>Position overview: As a senior front end developer, you architect large-scale, enterprise-level web applications and help define the standards for web development on geocaching.com. You are comfortable leading projects, sharing your technical and architectural expertise, and working side-by-side with designers and backend engineers. You have a passion for building modular, componentized UIs  and an uncanny ability to spot reusable patterns from miles away. You work closely with UX&#x2F;UI designers to prototype and ship new features, develop fast, responsive, and highly interactive mobile-first web experiences, and collaborate with backend engineers to define data contracts and API requirements. You perform peer reviews with other developers, document everything, and lead by example by writing code that is scalable, modular, and robust.<p>Qualifications + Required Skills:\n- Expert knowledge of HTML, CSS, and writing CSS at scale.\n- Expert knowledge of JavaScript. You are equally comfortable writing vanilla object-oriented JS and working within a framework.\n- Extensive experience architecting complex UIs from the ground up using modern JavaScript frameworks (Backbone and React&#x2F;Redux a big plus).\n- Expert in building progressively-enhanced, mobile-first web apps using modular, unit-testable components.\n- Proficiency with NodeJS-based tools such as Gulp, Grunt, and Webpack.\n- Expert knowledge of front end performance, cross-browser&#x2F;device quirks, and how to work around them.\n-Solid understanding of UX best practices and accessibility standards, and a commitment to putting the user first.<p>Bonus Points:\n- Experience with TDD or client-side unit testing frameworks.\n- Experience with section 508 compliance, particularly in the context of SPAs.\n- Experience working with localization&#x2F;internationalization.\n- Proficiency using Git in an Agile development team setting.<p>Apply at www.geocaching.com&#x2F;jobs","time":1494015741,"type":"comment"}