{"by":"ff_","id":14689452,"kids":[14692994],"parent":14688684,"text":"KSF Media | Fullstack Software Engineer | Helsinki, Finland | ONSITE<p>KSF Media is not a startup, but a 150 years old end-up. Our five newspapers are national, regional and local. Four of them are published in Swedish, the minority language of Finland. \nHufvudstadsbladet is our best known brand <a href=\"https:&#x2F;&#x2F;www.hbl.fi\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hbl.fi</a>. All of our newspaper titles have their corresponding digital brands. Our portfolio includes also brands like Ratata (blogging platform), Faktapp (learning app), plus a few more.<p>Our digital operations are constantly growing and we are therefore looking for another Fullstack Developer to join our team of 6.\nSomeone that can add technical debt to every layer of our stack ;-)\nSomeone that will help us tame the legacy monoliths (before you ask, it’s Python, PHP, Java, JS, and some more langs) and write some good, reliable, tested, small new services in the clouds.\nFor writing the new stuff we&#x27;re open to everything as long as you document it and we&#x27;re able to pair program (currently JS, Python, Clojure, and I’d love to pair program some Haskell too).\nThe position is full-time.<p>Watch our short pitch about saving the Media Industry and possibly winning Nobel Prizes: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;6Cl92_FYQ8k\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;6Cl92_FYQ8k</a><p>More info about the opening here: <a href=\"https:&#x2F;&#x2F;custom.hbl.fi&#x2F;custom&#x2F;static&#x2F;embed&#x2F;hbl&#x2F;job-ad.html\" rel=\"nofollow\">https:&#x2F;&#x2F;custom.hbl.fi&#x2F;custom&#x2F;static&#x2F;embed&#x2F;hbl&#x2F;job-ad.html</a><p>Applying:<p>Humans involved: mail me at fabrizio dot ferrai at ksfmedia dot fi, or DM me at @fabferrai<p>No humans involved: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;F-kingExcellent\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;F-kingExcellent</a>","time":1499099150,"type":"comment"}