{"by":"sz4kerto","id":14689887,"parent":14688684,"text":"Patients Know Best | Generalist Java developer | REMOTE | Full Time<p>We are looking for experienced Java generalists to work on our Electronic Patient Portal and Integrated Digital Care Record system.<p>PKB integrates data flows across multiple organizations across the healthcare system, while putting the patient in control of her data. We&#x27;re building something that actively, directly, improves the lives of people in general -- not selling more stuff, helping others sell more stuff, or making comfortable people a bit more comfortable. We are a fully remote team with a dozen developers, spread across half a dozen countries within a few hours of GMT (for shared working hours -- we are mostly looking for people in the EU&#x2F;ECC to make the monthly meetings more feasible).<p>Keywords that describe our stack: Postgres, Wildfly, Spring Boot, Dropwizard, Docker, Prometheus, Grafana, Pagerduty, Jira, Confluence, Bitbucket, Teamcity, Ansible, Vagrant, Java 8, Selenium, Arquillian.<p>Environment: we are all remote, there is no central office. We communicate primarily through chat (Slack) and issue tracking (JIRA), as needed over phone (Slack, join.me and similar, Skype, etc.) and we meet up once in a month in person for a day or two – usually in London.\nYou can use any OS&#x2F;IDE&#x2F;editor you like – whatever makes you productive. The only hard requirement is that you can run Docker containers and git somehow. We have devs running Windows, OS X and Linux.<p>You should ..<p>- be a good communicator, able to understand others and explain yourself clearly and concisely; knowing how to chase the best ideas in a discussion, not just push your own.<p>- be proactive and motivated, comfortable asking for help when you&#x27;re stuck and making constructive suggestions when you see something that could be working better.<p>- be able to prioritize well and strike the right balance between hacking things together hastily and completely disappearing for two months while refactoring the persistence layer.<p>- understand both the technical priorities and the business priorities underpinning them.<p>- be conscious of risk, have seen successful and failed projects, and have a good sense of what is going to work and what is going to fail.<p>Apply here: <a href=\"https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;6D05E74BAC\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workable.com&#x2F;j&#x2F;6D05E74BAC</a>","time":1499102394,"type":"comment"}