{"by":"rogik","id":14689333,"kids":[14720629],"parent":14688684,"text":"People.ai, Inc. | Engineering&#x2F;Sales&#x2F;Customer Support | SF |  ONSITE |  <a href=\"https:&#x2F;&#x2F;people.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;people.ai</a><p>People don’t quit their jobs, they quit their managers. Everyone has had a manager that makes them want to call in sick. Everyone has had a manager who regularly forces their team to chase their own tail doing meaningless work.<p>Why? Because most managers manage their teams blindly. They don&#x27;t hire, coach and promote based on data. Instead, they make decisions based on their gut. These decisions are made because managers don’t have the data to make smarter, more informed decisions when it comes to managing.<p>Not anymore. At People.ai we’re helping managers make decisions about their team based on data, not intuition. We’re starting with sales teams because they’re a particularly notorious black box. No manager today can definitively say what makes a “top performer” better than a “low performer.” People.ai is solving this dilemma by making sales management transparent and building the world’s first predictive sales management platform, powered by AI.<p>People.ai was part of the YC S’16 batch, launched the product in July of this year and was the first company in the batch to raise a Series A. Less than three months after our launch we’re already being used by sales teams at 50+ blue chip companies including Rubrik, Gainsight, Mulesoft and Optimizely.<p>We have a 10+ person team and are actively looking for Senior Front-end and Back end Engineers to join us. Our team needs someone with full-stack&#x2F;backend development experience as well as a deep background in Python, Linux, AWS, REST APIs and machine learning. Salesforce API experience is a plus!<p>Our Sales team is looking for Enterprise Account Executives and Sales Development Representatives.  A background in on-demand&#x2F;SaaS, CRM, SFA or marketing software sales is strongly preferred. You must have a proven record of consistently meeting and exceeding quota in a fast-paced, competitive sales environment.<p>Our Customer Success team is looking for a Customer Support Manager.  This person will be responsible for managing customer support requests via email, chat and phone and helping to build a world-class customer support organization. Prior experience with Zendesk, Intercom, Jira, Salesforce Service Cloud, etc. is a plus!<p>This isn’t just another job. Your input will be incredibly important as we’re currently shifting from to a microservices architecture. You’ll have an opportunity to make a major impact on a number of our microservices and ML&#x2F;big data infrastructure as we are turning our MVP into a massively scalable product.  Find out what makes us special in this blog, We the People: Why You Should Join People.ai.<p>Work out of our SOMA&#x2F;San Francisco offices. We offer a competitive salary with equity, health benefits, a cool company culture, lunches, free snacks and drinks. No remote applicants.<p>Join us as we work towards quantifying people management!<p>Apply here: <a href=\"https:&#x2F;&#x2F;peopleai.workable.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;peopleai.workable.com&#x2F;</a>","time":1499098327,"type":"comment"}