{"by":"patv","id":14689415,"parent":14688684,"text":"Vitally | Senior Javascript Engineer (First Hire) | New York | Onsite<p>Vitally.io is looking for a first engineering hire to join us as we go though Techstars this summer.<p>What we&#x27;re looking for: An ideal teammate for us is a front-end focused senior developer who is quick learning and adaptable. We&#x27;d like you to initially own a good amount of our front-end and dive in where ever else is needed (back-end, devops, etc).\nOur tech stack is evolving quickly, but we&#x27;re building the front-end in React&#x2F;Redux + Typescript, the backend in Node + Typescript w&#x2F; Postgres + Redis, and will be hosting on AWS. Experience with any of those technologies is a plus, but we&#x27;re open to speaking with strong engineers who we know will pick things up quickly. Any experience building data-intensive applications is also a plus.<p>As we grow, you&#x27;ll be able to take a significant leadership role within our engineering team. You&#x27;ll also have the opportunity to be a member of the team as we go through the Techstars NYC summer session, working alongside some of the most promising startups and talented entrepreneurs in New York.<p>A little bit about us: Vitally is an early stage startup building an analytics platform to help Customer Success teams quantify and target their engagement. We&#x27;re still in stealth mode, but we&#x27;re backed by Techstars and are moving quickly.\nJamie (CEO) is a repeat entrepreneur with proven success as the former CTO&#x2F;co-founder of Pathgather (another Techstars startup). Patrick (CTO) is an MIT engineer with experience managing high-value customer relationships with some of the largest banks and hedge funds in the world. We value transparency, diversity, giving back, and questioning convention and we&#x27;re building a company that does the same. If that sounds interesting, we&#x27;d love to speak with you.<p>You can reach me at patrick@vitally.io","time":1499098870,"type":"comment"}