{"by":"coolphoenix","id":14689828,"parent":14688684,"text":"Stellenticket GmbH | Ruby on Rails Full Stack Developer | Berlin, Germany | ONSITE, INTERNS, VISA, SALARY:50k EUR, <a href=\"https:&#x2F;&#x2F;www.stellenticket.de&#x2F;?lang=en\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stellenticket.de&#x2F;?lang=en</a><p>We are looking for a full stack Ruby on Rails developer to work with us here in our Berlin office. Stellenticket is a completely self funded TU Berlin startup from 2009, being profitable since the beginning. We develop and provide web software as a service for mostly German universities (B2B). Our two main products, Stellenticket Jobportals and Congeno (a CRM) are already in use in production since 2010 (Jobportals) and 2016 (Congeno), but are still constantly improved. Besides those two projects we use several smaller Rails apps ourselves to organize our work (like a simple time tracker and a task manager). We also have some other products in our pipeline where we need your help to develop and finally release them into production until the end of the year.<p>Our software is currently based on Ruby on Rails 5.1.x and we usually use the following stack:<p><pre><code>  - Slim or Haml as the HTML template engine for simple views  \n  - Vuejs 2.x for complex views (keyword: webpacker)\n  - SCSS\n  - Simple SCSS framework like Bourbon with Bitters (*no* Bootstrap or so)\n  - Database: PostgreSQL\n  - Rspec for unit tests\n  - Capybara with Selenium for browser and feature tests\n</code></pre>\nYou will join a small developer team which currently consists of one full time developer and two part time (student) developers, so you can be sure you will have a big impact in the team. With it comes some responsibility, though, because it will be your job to bring the development of your project forward at every stack level, be it the backend, database, frontend or CSS. You will constantly learn new things during your work, because nobody can be an expert in all those fields - but you can improve always.<p>We try to release usable prototypes with minimum functionality fast, so our products are in use and we get feedback fast, and then gradually develop them further.<p>Project code is completely hosted on our self run Gitlab instance, including automatic CI run after every push, linting with Rubocop (and some other linters depending on the stack used), automatic deploys to staging and production environments, and review of every merge request by at least one other developer.<p>If you are interested, please e-mail your resume to Markus Doits, apply@stellenticket.de, with the keyword &quot;HN RoR 2017-07&quot;. If you have any questions, feel free to contact us too.","time":1499101986,"type":"comment"}