{"by":"victorNicollet","id":14689394,"parent":14688684,"text":"Lokad | Front-end developer | Paris, France | ONSITE <a href=\"https:&#x2F;&#x2F;www.lokad.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lokad.com</a><p>Quantitative Supply Chains are the future: where every possible future gets a probability, and where every possible decision gets an economic score. Lokad&#x27;s goal is to make this future a reality. We have a very specific point of view on how Supply Chains should be managed (see our Quantitative Supply Chain Manifesto on our website: <a href=\"https:&#x2F;&#x2F;www.lokad.com&#x2F;quantitative-supply-chain-manifesto\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lokad.com&#x2F;quantitative-supply-chain-manifesto</a>).  By combining Big Data and state-of-the-art machine learning, we help companies do more with their Supply Chains, their inventories and their production capacities than classical methods would ever allow.<p>While we’ve spent a lot of effort on technology in terms of forecasting, data crunching and cloud computing, there is ample room for improvement regarding how the whole product is packaged and used by our customers. We are currently engaging in a vast revamping of our graphical identity, User Interface, dashboards, etc. As a Front-End Engineer, your role is to help us with this challenge.<p>You would contribute features and improvements to the components of our online IDE, such as the code editor, the file management interface and the dashboard system.<p>We are looking for candidates with the following skills and qualities:<p>- Experience (ideally, at least 2 years) building single-page applications in JavaScript, using any framework, though knowledge of React&#x2F;Redux is appreciated<p>- Knowledge of TypeScript is a plus.<p>- Knowledge of C#, .NET or ASP.NET Core would be a bonus but is not strictly required - training will be available.<p>- Candidates must be self-motivated and driven to achieve results with a “hands on” attitude.<p>- Decent communication skills and the willingness to engage in conversations with our Business Data Analyst team to understand the needs of the end users. We are trying our best to build an IT team that is not cut off from the rest of the company and that is knowledgeable about the product, the company and the business in general. We believe that, at the end of the day, it makes a real difference in the quality of the results produced.<p>Your day-to-day work will involve Visual Studio and Git.<p>The role is office based. We are located in the very heart of Paris, France (50m from Place d&#x27;Italie). Our offices are quiet (no open spaces), well-stocked with drinks and snacks, as well as double or triple monitors to make sure that you feel comfortable within your work environment.<p>You can reach me (Victor Nicollet, CTO) at victor.nicollet@lokad.com","time":1499098753,"type":"comment"}