{"by":"dogas","id":14689804,"kids":[14690245],"parent":14688684,"text":"ConvertKit | Senior Full-stack Rails Engineer | REMOTE, www.convertkit.com<p>The engineers at ConvertKit are smart, highly motivated and highly productive developers who care greatly about the craft of coding. We champion learning, bettering ourselves, and teaching to the rest of the team.<p><i>About ConvertKit</i><p><pre><code>  * We are a fully remote company, scattered across 8 states and 4 countries.\n  * Bootstrapped, profitable, and growing very (very!) quickly. [1]\n  * We put a high emphasis on work &#x2F; life balance, and we value and strive for 40 hour work weeks. There aren&#x27;t set hours, but there&#x27;s a lot to get done!\n  * We have a positive, vibrant, and genuine culture. [2]\n  * Working with Nathan Barry is super awesome!!\n  </code></pre>\n<i>About the role</i><p><pre><code>  * You&#x27;ll be part of our awesome engineering team, helping to build our product. We primarily use Rails, Mysql, Redis and Sidekiq to get the job done. \n  * We&#x27;re facing real (fun) scaling challenges because of our incredible growth. Ideally</code></pre>\nyou&#x27;ve been there, done that before.\n  * We&#x27;re also looking for someone who cares deeply about writing clean, maintainable, well-tested code, and generally tends to leave code in a better state than when you encounter it.<p><i>Requirements</i><p><pre><code>  * Significant (5+ years) full-stack Rails experience and scaling a Rails app for rapid growth.\n  * We don&#x27;t have a separate infrastructure team.  You must be comfortable with helping to run, scale, troubleshoot and maintain a large production app that sends 250+ Million emails a month.\n</code></pre>\nMore info + how to apply here:  <a href=\"https:&#x2F;&#x2F;convertkit.workable.com&#x2F;jobs&#x2F;466250\" rel=\"nofollow\">https:&#x2F;&#x2F;convertkit.workable.com&#x2F;jobs&#x2F;466250</a><p>[1]: <a href=\"https:&#x2F;&#x2F;convertkit.baremetrics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;convertkit.baremetrics.com&#x2F;</a><p>[2]: <a href=\"https:&#x2F;&#x2F;charlimarie.com&#x2F;2017&#x2F;02&#x2F;06&#x2F;finding-my-place\" rel=\"nofollow\">https:&#x2F;&#x2F;charlimarie.com&#x2F;2017&#x2F;02&#x2F;06&#x2F;finding-my-place</a>","time":1499101839,"type":"comment"}