{"by":"adambratt","id":14690583,"parent":14688684,"text":"Indio | San Francisco | ONSITE | Full-time | Lead Frontend Engineer<p>Indio (<a href=\"http:&#x2F;&#x2F;www.useindio.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.useindio.com</a>) is getting way too many customers and we need some team members to help us handle the bountiful harvest!<p>We&#x27;re really looking for a talented lead front-end engineer!<p>What we&#x27;re looking for:<p>- You’re ready to help lead front-end development for our broker product<p>- You’ve played with all the major JS frameworks and can debate React vs Angular for hours<p>- You enjoy learning about how customers use what you build just as much as figuring out how to architect it<p>- You’re interested in joining a seed stage company that’s experiencing rapid growth and needs help keeping it all under control<p>- You live in the Bay area or want to move here soon<p>We’re an insure tech startup… but we’re trying a different twist than the standard “repackage an insurance product for millennials with sweet marketing”.<p>You see.. we really like the veterans. The insurance brokers who have been in this industry for years and are now seeing insure tech flip their world upside down. These brokers know more about insurance than any of us could ever hope…but they need our help!<p>They’re behind the times and desperately looking for solutions that allow them to compete again!.We’re building the software that can turn any existing insurance broker into a tech savvy company. We’ve helped insurance agencies of all sizes earn their stripes in the insure tech world by giving them powerful platforms they can use to give their clients a better experience.<p>And just like our customers, we’re veterans too! Our team has prior acquisitions under our belt and we’re hungry for more. We’re YC and 500 Startups alumnus, and have a tech first culture.<p>We love delighting our customers and know you will too. Come on board and let’s superpower the insurance world!<p>Email: adam@useindio.com","time":1499108579,"type":"comment"}