{"by":"bnewbold","id":14697225,"parent":14688684,"text":"Internet Archive | San Francisco, CA | PM, SRE, Book Curator | Full Time, ONSITE<p>The Internet Archive is a US-based non-profit which has been backing up the web and pursuing &quot;Universal Access to All Knowledge&quot; for more than 20 years. Some of our larger projects include the Wayback Machine, a national news TV archive, openlibrary.org, and archive-it.org. We own an operate all of our digital compute and redundant storage hardware, including our data center real estate, and run a predominantly free&#x2F;open source software stack. We have some remote employees, but the majority of engineers work full time from our beautiful headquarters in the Richmond district of San Francisco (the roles below are on-site, though exceptional and travel-flexible remotes are welcome to apply anyways).<p>As of July 2017 we are actively hiring for:<p>- Manager Site Reliability &amp; Infrastructure<p>- Hardware Design Engineer, for our custom book scanning pipeline<p>- Curator of Books &amp; Linked Data, who will improve our book cataloging, metadata management, and scan prioritization process<p>- Project Manager for an existing 5-engineer team developing and operating a successful production Python&#x2F;Django web application (no listing for this yet, contact me)<p>- ... and more!<p>The Internet Archive is an equal opportunity employer and additionally encourages applicants from all educational and career backgrounds. As a mission-driven non-profit we do not compete with Silicon Valley market rates, but we do pay a livable Bay Area salaries, provide full benefits including paternal leave, and our employees have the freedom to discuss their work publicly. Our funding is stable, we have weathered several tech bubbles, and intend to be operating well through the 21st century.<p>Applications and more information at <a href=\"http:&#x2F;&#x2F;archive.org&#x2F;about&#x2F;jobs.php\" rel=\"nofollow\">http:&#x2F;&#x2F;archive.org&#x2F;about&#x2F;jobs.php</a>, or contact me directly and I will route your message internally.","time":1499190363,"type":"comment"}