{"by":"fenguin","id":14692112,"parent":14688684,"text":"Poynt | <a href=\"https:&#x2F;&#x2F;poynt.com\" rel=\"nofollow\">https:&#x2F;&#x2F;poynt.com</a> | Palo Alto, CA (ONSITE)<p>Software Engineer: Web, Mobile, and Data<p>Poynt is building the payment terminal and commerce platform of the future. Some of the largest merchants, developers, banks, and resellers in the world are key partners on this platform, and we aim to provide an incredible level of insight and control to each of these parties over their highly unique use cases and concerns.<p>Our real-time data pipeline ingests, normalizes, and aggregates billions of events from our apps and Smart Terminal, and deliver instant insights and trigger alerts on web&#x2F;mobile apps for each of our customer types. We constantly tread the line between performance and scalability, using many different backend tools and optimizations to produce the most useful yet fastest interfaces and alerts.<p>Your role in Web, Mobile &amp; Data will be to create these tools to empower each of our customer types: building best-in-class management and data products in the backend, and elegant yet powerful interfaces in the frontend, to help them optimally run their respective businesses.<p>YOU SHOULD HAVE:<p>* Mastery of JavaScript and least one common Web framework: Node.js&#x2F;Express, Sinatra, Flask<p>* Significant experience developing, optimizing, and deploying scalable, highly performant web applications<p>* Familiarity with asset pipelines, build tools, testing, continuous integration<p>* Experience building single-page web apps using modern frameworks, e.g. Ember.js, AngularJS, React, etc.<p>* Experience working with data pipeline, warehousing, and analytics tools (Spark, Hadoop, Elasticsearch, Redshift) a plus<p>* Experience developing mobile apps (iOS, Android, mobile web) a plus<p>Please apply at <a href=\"https:&#x2F;&#x2F;hire.withgoogle.com&#x2F;public&#x2F;jobs&#x2F;poynt&#x2F;view&#x2F;P_AAAAAACAAADDb3zSNHrj3G\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.withgoogle.com&#x2F;public&#x2F;jobs&#x2F;poynt&#x2F;view&#x2F;P_AAAAAAC...</a>","time":1499123149,"type":"comment"}