{"by":"julbaxter","id":14691494,"parent":14688684,"text":"Montreal, Canada | Software Developer for Robotic CAD&#x2F;CAM | ONSITE<p>Company Description: Hypertherm Robotic Software Inc. specializes in developing programming software for robotics. We develop applications and value added solutions in the CAD&#x2F;CAM (Computer Aided Design, Computer Aided Manufacturing) domain specifically catering to industrial robotics. Our main software product, Robotmaster, is an industry trend setting approach to software technology for graphically programming industrial robots. For more information please visit our web site: <a href=\"http:&#x2F;&#x2F;www.robotmaster.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.robotmaster.com</a>.<p>Job Description: You will be joining a dynamic team of robotics researchers, developers and applications engineers to develop robot programming software that facilitates graphical programming of industrial robots. You will also be contributing to architecture and interface design. Some initial tasks will include:\n- Developing CAD&#x2F;CAM applications for robotics using C++, C# as well as APIs from component providers;\n- Developing graphical components using OpenGL for visualization and simulation of 3D objects (robots, 3D CAD models, etc…);\n- Integrating our software with various CAD&#x2F;CAM packages using relevant SDK (Software Development Kit);\n- Designing and developing contemporary user interfaces using C# comprised of WPF controls;\n- Contributing in the development, extension and maintenance of the infrastructure to support continuous delivery.<p>Performance-oriented pay and a corresponding opportunity for individual and professional development are guaranteed in our dynamically growing, privately owned company.<p>Required Qualifications:\nBachelor of Software Engineering and&#x2F;or pertinent software development and architecture experience;\nVery good knowledge of C#, .NET, and object oriented programming;\nA Self starter and a very motivated person is required that can work independently as well as within the framework of a team;\nKnowledge or interest in robotics, CAD&#x2F;CAM software, OpenGL and applied math would be a strong asset;\nKnowledge and experience with developing applications using WPF and XAML would be an asset;\nKnowledge of AI techniques is a plus.<p>email me at julien@robotmaster.com","time":1499116856,"type":"comment"}