{"by":"The_Sponge","id":14690269,"parent":14688684,"text":"Credit Karma | San Francisco, Charlotte, LA | Full Time, ONSITE | <a href=\"https:&#x2F;&#x2F;creditkarma.com\" rel=\"nofollow\">https:&#x2F;&#x2F;creditkarma.com</a><p>Credit Karma&#x27;s mission is to make financial progress possible for everyone. We have over 70 million US members and are a true mission-oriented business, a rare case where our incentives are aligned with our users - we succeed by helping our members attain financial progress.<p>We&#x27;re growing very rapidly right now, and have tons of opportunities for people to solve hard problems while helping people grow their financial progress. Let&#x27;s unpack that:<p>Opportunities: On the backend, we&#x27;re transitioning to a microservice based environment based on Scala&#x2F;JVM, using Twitter-born libraries such as Finagle. We&#x27;re also unifying our data model into GraphQL to help bring separate but related services and verticals together. On the frontend, we&#x27;re rebuilding our various components in React using modern web technologies while still keeping an emphasis on stability. We also have data teams using BigQuery and Kafka to injest and understand.  We&#x27;re also hiring security engineering, test engineering, machine learning engineering  and basically any other position you might expect to find at an optimistically growing company. All of that combined means that whatever your technical passion, we probably have a spot for you to contribute!<p>Financial Progress: Honestly, this is the best part. I know working at every company has its ups and downs, but at the end of the day, being able to say &quot;My work helps people. When they thrive, so do we.&quot; is fantastic. When our users grow financially, they start migrating to better financial products to suit their new needs, and we want to be there the whole way to guide them.<p>We have a lot to do, and a lot to solve, and we&#x27;d like help! \n<a href=\"https:&#x2F;&#x2F;www.creditkarma.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.creditkarma.com&#x2F;careers</a>","time":1499105719,"type":"comment"}