{"by":"airesume","id":14697479,"kids":[14697776],"parent":14688684,"text":"* Machine Learning&#x2F;Deep Learning Professional | Global but we are based in the USA | 110% REMOTE :) | <a href=\"https:&#x2F;&#x2F;airesume.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com</a><p>* Data Scientist | Global but we are based in the USA | 110% REMOTE :) | <a href=\"https:&#x2F;&#x2F;airesume.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com</a><p>* Content Marketer | Global but we are based in the USA | 110% REMOTE :) | <a href=\"https:&#x2F;&#x2F;airesume.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com</a><p>* Growth Professional | Global but we are based in the USA | 110% REMOTE :) | <a href=\"https:&#x2F;&#x2F;airesume.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com</a><p>* Amazing Graphic Designer | Global but we are based in the USA | 110% REMOTE :) | <a href=\"https:&#x2F;&#x2F;airesume.com\" rel=\"nofollow\">https:&#x2F;&#x2F;airesume.com</a><p>We are a small team of developers&#x2F;engineers focused on revolutionizing the way people find and get jobs using artificial intelligence. We all know getting jobs is going to get tougher and one day we will be competing against AI so help us build an AI that can level the playing field for humans! We already have an amazing product and your skills will help us make it even greater!<p>Get in on the ground floor of an amazing opportunity to work with a great team of developers and engineers while still being able to work on your own side projects and explore&#x2F;expand your expertise anyway you want, your growth is our goal! We encourage people to continue learning and we pay for it!<p>Take a vacation ANYTIME for as long as you like, PAID! We encourage digital nomadship (whether for a few weeks, months or even years if you like) as often as you want! We also have families so staying put is cool too, but we have traveled with kids before and highly recommend it!<p>Please email jobs@airesume.com with your resume and why you are interested in [a.i.] RESUME as well as a cool story you can share! Impressing us is always a plus :)<p>No matter what happens we wish you good luck with your job search!","time":1499193148,"type":"comment"}