{"by":"hganesan","id":14690024,"parent":14688684,"text":"TowerView Health | Philadelphia, PA | Full-Time and Contract | Remote and In Office | Front-End Engineering | <a href=\"http:&#x2F;&#x2F;towerviewhealth.com\" rel=\"nofollow\">http:&#x2F;&#x2F;towerviewhealth.com</a><p>TowerView Health is a rapidly growing startup in Philadelphia looking for a passionate, user-focused front-end engineer&#x2F;contractor to help us scale up our software platform for medication management.<p>We help chronically ill patients manage complex medication regimens in their home. We partner with pharmacies that send patients customized pre-sorted medication trays that insert into our custom-designed smart pillbox. Our pillbox can sense when medication is removed and send patients and&#x2F;or their caregivers automated reminders. Explainer Link: <a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;vWaBJVrSOiE\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;vWaBJVrSOiE</a><p>Our patients love us because we take away the complexity of managing medications and our customers love us because we keep patients healthy and out of the hospital. We sell to health insurance companies and hospital systems and are poised to scale to over 25K patients in the next 2 years. We&#x27;ve been recognized by Forbes and the Medical Design Excellence Awards, and are committed to providing patients peace of mind when it comes to their medication.<p>Experience in&#x2F;with: Angular 1.x, Node, React, HTML, CSS<p>Projects we want to build: \n * data visualization dashboards for nurses to target their care to patients\n * easy-to-use web apps to streamline medication filling and reconciliation\n * internal operations tooling to create seamless experiences for our patients<p>We&#x27;re a small, flexible team looking for someone able to own projects from start to finish.<p>Shoot me an e-mail at hareesh@towerviewhealth.com if you have any questions or just want to learn more about the company.","time":1499103491,"type":"comment"}