{"by":"tonyleask","id":14693863,"parent":14688684,"text":"IAC Publishing Labs (was Ask.com) | Sr. Engineer, Front-end Platform | Oakland, CA | ONSITE, FTE, VISA, SALARY:DOE, <a href=\"http:&#x2F;&#x2F;www.iacpublishinglabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.iacpublishinglabs.com</a><p>We are looking for a Software Engineer to join the Front-end Platform team. We develop the platforms, services, and frameworks that enable other developers to build our world-class digital properties. Our backend services manage incoming requests and marshall data to the front-end, and the libraries and tools we build are used to create modern and maintainable front-end applications.<p>We often find ourselves spearheading new technologies and processes for the entire dev org (eg. containerization, continuous-delivery). While focused on web developers, you’d be working with multiple teams in a culture that values collaborative, pragmatic solutions.<p>Technologies: - Advanced JavaScript Skills (ES6, OO&#x2F;functional, Node.js, etc.) - Experience building frameworks and APIs - Passion for high performance, scalability and developer efficiency<p>Benefits: - Unlimited vacation - Competitive salary plus bonus - Great benefits (medical, dental, vision, 401k matching, legal insurance, pet insurance) - Unlimited snacks&#x2F;drinks, frozen yogurt and beer - Relocation assistance (if moving to the SF Bay Area) - Close to many public transit options (BART, Ferry, AC Transit) - Subsidized dollars towards public transit or parking garage - Tuition Reimbursement<p>For full job description and to apply, visit: <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;8aIGuA\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;8aIGuA</a> (or e-mail jobs@ask.com)<p>About our company: <a href=\"http:&#x2F;&#x2F;iacpublishinglabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;iacpublishinglabs.com</a> For more jobs, visit: <a href=\"http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings\" rel=\"nofollow\">http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings</a>","time":1499148543,"type":"comment"}