{"by":"ibisnetworks","id":14690165,"parent":14688684,"text":"Ibis Networks | C&#x2F;C++ Engineer | Honolulu, HI | REMOTE and ONSITE<p>Ibis Networks, Inc. is looking for a C&#x2F;C++ programmer with a strong track record in developing firmware and micro controller code, for projects involving an IoT portfolio of products.  You will be a key contributor to expanding our portfolio of IoT devices for plug-load energy management.<p>You will join a distributed team of hardware and software engineers working to build enterprise-level technology for monitoring and optimizing energy use at the plug-level for buildings and campuses.<p>Ibis Networks is a distributed team, with some of our software team working from our Honolulu headquarters and locations in and around Seattle, WA and in the Bay Area.  We are open to remote workers given our distributed team, and would also welcome sometime to our offices in Honolulu or the Bay Area.<p>If you are experienced at working as part of a distributed team, are capable of writing clearly and using tools like Slack to effectively communicate, you’ll work well with our team.  You may rarely be asked to travel to Honolulu for company meetings and work sessions, but otherwise, we’re interested in talking to self-motivated people who are happy to work on interesting technology problems from a variety of locations.<p>Requirements:<p>C&#x2F;C++<p>Firmware and micro controller development<p>Network programming<p>Strong knowledge of TCP&#x2F;UDP, application level protocols<p>Transport layer encryption (SSL&#x2F;TLS)<p>Understanding of REST API development<p>A working knowledge of Netburner appliance development is strongly desirable, with experienced Netburner developers receiving priority for hiring.<p>Other desirable skills:<p>I2C and&#x2F;or SPI<p>BACnet&#x2F;IP<p>Ruby on Rails<p>Some familiarity with cloud-based architectures and services (e.g, AWS, Heroku)<p>More info at: <a href=\"http:&#x2F;&#x2F;ibisnetworks.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;ibisnetworks.com&#x2F;</a><p>If interested, please email your resume at careers+hn@ibisnetworks.com","time":1499104703,"type":"comment"}