{"by":"izyda","id":14692574,"parent":14688684,"text":"Coatue Management | New York, NY &#x2F; Menlo Park, CA | Infrastructure Engineer &#x2F; Front-End Engineer | Fulltime<p>Coatue Management is a hedge fund based in New York City.<p>We&#x27;re in the middle of building a market intelligence platform based on non-traditional data (ie. non-financial data). We look for creative sources of data (everything from e-commerce pricing to satellite data - typically realtime and granular), use it to model key firm and economic metrics. If you&#x27;re interested in large scale data pipelines or Bayesian statistics, we have interesting challenges.<p>Data Engineer:<p><pre><code>    - Experience in using and tuning Spark on large datasets (&gt;10TB) for batch processing\n\n    - Preferably has experience with AWS EMR and&#x2F;or has used Scala for data engineering\n\n    - Keywords: Scala, Spark, Redshift, Docker\n</code></pre>\nAlgorithmist:<p><pre><code>    - Experience in Scala (or any other functional language e.g. Haskell, F#, OCaml)\n\n    - Strong algorithms and data structure background e.g. competitive programming\n\n</code></pre>\nFront End Engineer:<p><pre><code>    - We&#x27;re currently looking for a front-end engineer to build out interactive dashboards. You would work with both the data scientists who generate output, and the investment staff that consumes it, to build the most effective visualizations possible.\n\n    - Example dashboards include tracking the historical accuracy of various datasets compared to the firm metrics they measure, drilling down into the constituents of a macroecnomic measurement, and visualizing economic data with spatial and temporal dimensions\n\n    - This role offers the opportunity to take ownership of the architecture and tech stack, and it offers freedom and creativity\n\n    - Keyword skills: Bootstrap, D3.js, Chart.js, Plotly.js\n</code></pre>\nData Scientist:<p><pre><code>    - Experienced at SQL or Spark, strong at a scripting language e.g. R, Python\n\n    - Keen to not only do ad hoc data diving but also build automated tools for repeating that analysis.\n\n    - Employs best practices of software engineering in data science work (ie. Git, DRY etc.)\n\n</code></pre>\nEmail us if you&#x27;re interested or want to learn more: hr [at] coatue.com","time":1499128317,"type":"comment"}