{"by":"worldadventurer","id":14691862,"parent":14688684,"text":"engageSPARK | Cebu, Philippines | ONSITE, REMOTE, FULLTIME, VISA, Code4Good <a href=\"https:&#x2F;&#x2F;www.engageSPARK.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.engageSPARK.com</a><p>engageSPARK, a social enterprise, is the world&#x27;s EASIEST Platform that empowers professionals (marketing, sales, hr, operations, project managers, etc) at NGOs &amp; Businesses to easily &amp; quickly build interactive Automated Phone Calls (IVR) and 2-Way SMS campaigns in any country. We&#x27;re especially focused on emerging markets, where 66% have no Internet and another 15% who have smartphones can&#x27;t afford data plans regularly. Interactive automated phone calls are the most cost effective and scalable way to engage anyone anywhere with any mobile phone. People opt in by sending an SMS, doing a Missed Call, sending a FB message or others, which trigger an automated call back to them.<p>Customers such as Google, Facebook, Intel, UNICEF, Noora Health (YC W14) Asian Development Bank, International Rescue Committee, Innovations for Poverty Action, MedAir, Mercy Corps, and US Institute for Peace use the engageSPARK platform to interact with people for a variety of use cases, including social change in the areas of Agriculture, Health, Finance, Elections, and Disaster Planning &amp; Response, as well as for sales, marketing, customer feedback, and operations.<p>We&#x27;ve recently raised funding by 500 Startups and other investors. Forbes says we&#x27;re &quot;A Leading Startup&quot; and a &quot;Notable Social Enterprise&quot;. Since launch two years ago, engageSPARK has become the global leader in our space - we&#x27;ve already been used in 125+ countries.<p>Adventure Fellowship (1 year): <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;YA8ENR\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;YA8ENR</a> | Senior JS-UI Dev: <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;pXPUfx\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;pXPUfx</a> | Full-Time Full Stack: <a href=\"http:&#x2F;&#x2F;goo.gl&#x2F;Pljcgr\" rel=\"nofollow\">http:&#x2F;&#x2F;goo.gl&#x2F;Pljcgr</a><p>Our stack: Go (GoLang) Microservices, Python&#x2F;Django, Java, Docker, Redis, Thrift, PostgreSQL, CouchDB, AWS, Android<p>Located in tropical Cebu Island, Cebu City is the second largest city in the Philippines. It’s a safe place to live with a variety of malls, restaurants, shops, beaches, and activities such as scuba diving, running, hiking, rock climbing, and snorkeling. It has a busy international airport with cheap flights to domestic and regional destinations. Check out Google Images: <a href=\"https:&#x2F;&#x2F;www.google.com&#x2F;search?safe=off&amp;site=imghp&amp;tbm=isch&amp;source=hp&amp;biw=1104&amp;bih=639&amp;q=cebu+philippines&amp;oq=cebu&amp;sout=0&amp;sa=X\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;search?safe=off&amp;site=imghp&amp;tbm=isch&amp;s...</a><p>Email us at Jobs at engageSPARK.com","time":1499120183,"type":"comment"}