{"by":"bfe","id":14690522,"parent":14688684,"text":"<a href=\"https:&#x2F;&#x2F;x-r.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;x-r.ai</a> | AI engineer | Portland, Oregon | Full-time | REMOTE | <a href=\"https:&#x2F;&#x2F;x-r.ai&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;x-r.ai&#x2F;careers</a><p><a href=\"https:&#x2F;&#x2F;x-r.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;x-r.ai</a> is applying AI to accelerate technology development - initially by applying AI to accelerate patent attorney work to reduce the time and resources required to resolve patent disputes and to shut down patent trolls.<p>We are developing an AI-powered work platform for patent attorneys to do all their work on which will replace the inefficient decades-old software they currently use, and make their work dramatically faster, more efficient, and more thorough.  We have a handful of enterprise customers, who spend billion-dollar-scale per year on patents, in our private pro beta free trial, and they are getting rapidly more excited and asking us how quickly we can take more of their work and how soon we can expand coverage for their work in Europe and Asia.<p>We are targeting for x-r.ai to become the indispensable platform that all patent attorneys need to work competitively.  Under our anti-troll license, any non-practicing entity and their outside law firms, and anyone who sues a startup for patent infringement and their outside law firms, will be banned from using x-r.ai, while startups sued for patent infringement and their outside law firms can use x-r.ai pro for free.  Once we reach our target capabilities, it will be impossible for any patent attorney to work for a troll or for someone who sues a startup and ever be able to do their job cost-effectively again.<p>Help us revolutionize a giant market and lift a burden from the entire tech world by fixing patents with software.<p>I just started x-r.ai in April and we are still a very small team; all positions currently come with significant equity.  We&#x27;re based in beautiful, affordable Portland, Oregon and will also be doing in-person interviews in the Bay Area and Seattle&#x2F;Redmond regularly, including in SF, SV, and Berkeley before and after the Deep RL bootcamp at Berkeley in late August.  Work in-person in Portland at least occasionally is preferred, but we will evaluate case-by-case for the right people.  Successful applicants should show evidence of high levels of drive, intelligence, and team fit, and interesting machine learning applications they&#x27;ve developed.  So far our back-end is all python ML ecosystem but we&#x27;re starting to get into lua as well.  We&#x27;re working to incorporate bleeding-edge deep learning architectures just released in the past few weeks, and to build a great AI engineering team ready to go after more verticals to accelerate development of new technology and to work toward artificial general intelligence.  Apply via email on <a href=\"https:&#x2F;&#x2F;x-r.ai&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;x-r.ai&#x2F;careers</a> and&#x2F;or via scoutsavvy.co.  Thanks much.","time":1499108060,"type":"comment"}