{"by":"Anna_at_Baydin","id":14691672,"parent":14688684,"text":"Mountain View, CA | Senior Engineer | ONSITE, FULL TIME<p>At Boomerang (Baydin inc), email and personal productivity software are a never ending stream of exciting, customer-life-changing challenges. We&#x27;re looking for veteran engineers who want to use knowledge gleaned from years of working in software development teams to help us overcome them!<p>We have apps that millions of customers use every day (and pay for), and the infrastructure to support them efficiently and reliably at a reasonable cost. Our technology choices prioritize solving real user problems - when possible, we try to minimize complicated architecture and dependencies, but when it was necessary, we built our own hybrid machine learning architecture that shares computational load between the client and the server.<p>We need your judgment and experience to help us shave months of development time off critical projects, help us keep the servers alive a few extra nights a year, and mentor our newer engineers so they can learn some of that judgment and experience from you.<p>You&#x27;ll be able to work at an expert level in one of the languages or frameworks we use at Boomerang (JS, Angular, Python, Django, Swift, or the Android dialect of Java). You&#x27;ll be able to share stories of mistakes you&#x27;ve made and learned from in past work, and you&#x27;ll be able to identify the same mistakes as they are being made here. You already know how to interface with a product team, support team, marketing team, and leadership team to make everything run more smoothly.<p>You can differentiate between when new platforms, frameworks, and design patterns solve real problems and when they&#x27;re just shiny objects, and even more importantly, know how to communicate that knowledge to everyone who needs to know it. You&#x27;re comfortable expressing your thoughts clearly in writing. You&#x27;re collaborative and enjoy teaching people what you know, but also are receptive and open when something you know just ain&#x27;t so.\nIn return, you&#x27;ll work in an environment that welcomes responsibility, where your work will help millions of people focus on the most rewarding parts of their jobs, and as part of a friendly, fun, elite team.<p>Requirements (position is full-time, on-site at our Mountain View office):<p>* A computer science or engineering degree from an accredited university with 6+ years of experience professionally developing software as part of strong engineering teams\n* OR 8+ years of experience professionally developing software as part of strong engineering teams, with very strong knowledge of computer science fundamentals\n* Deep knowledge of one of the technologies we use at Boomerang (see above)\n* An interest in productivity software\nTo apply, please send the following to i.want.to.work@baydin.com:\n* Your resume\n* A link to your Github (if available)\n* A cover letter that includes a paragraph about why you&#x27;re excited about what we do.","time":1499118638,"type":"comment"}