{"by":"danielmorozoff","id":14702846,"parent":14688684,"text":"Frontend Designer&#x2F;Developer | New York, USA | ONSITE<p>About Vidrovr: \nVidrovr can index, search, and recommend video content in a cost-effective, automatic, and accurate manner. It was founded by Joseph Ellis and Daniel Morozoff, two former PhD Students in the Digital Video and Multimedia Lab at Columbia University and is advised by Prof. Shih-Fu Chang, of Columbia Engineering. The team has published and patented foundational research in machine learning, computer vision, multimodal information processing, and multimedia. Vidrovr addresses three key market needs: 1. Domain and customer specific automatic metadata generation for videos, 2. Video Content Management solutions that enable automatic placement and recommendation of video clips for digital products, and 3. Automatically linking and sourcing visual social media content that is relevant to a particular video or online article before it is published. Vidrovr is currently looking to build a team to commercialize and enhance the core technologies that have already been developed. Vidrovr was recently named as one of the winners of the prestigious Publicis90 competition, which entails investment and mentorship from Publicis Groupe. Vidrovr was awarded a National Science Foundation Small Business Innovation Research Grant to develop a unified multimodal framework for video understanding leveraging context and existing metadata. Vidrovr is backed by Techstars, and was part of the 2017 New York City Winter Cohort. Check out the Vidrovr website for more information. Please forward a CV with relevant publications&#x2F;projects, work experience, and academic experience to contact [at] vidrovr.com if you are interested, include “Front End Engineer&#x2F; Designer Job Opening” in the title.<p>Lead design of the Vidrovr video management system web \nplatform, which includes but is not limited to:<p>Front-end development utilizing latest technologies: \nHTML5&#x2F;CSS3, React, \nUtilize backend data to pass information to front end. Familiarity with back end \npython&#x2F;scala&#x2F;java stacks \nDjango 1.10 \nPlay Framework 2 \nJetty 9 \nUser centered UI&#x2F;UX design and implementations \nCreate wireframes and UI&#x2F;UX flows \nImplement designs in prototype mockups \nPrioritize feature additions \nLink feedback from users of the system<p>Designing the user workflow and interface for the following features: \nVidrovr video search and indexing webpage \nVidrovr video tools suite, including the iframe-embeds. \nCollaborate with management on the direction of the company’s secondary products using experience learned from interacting with users. \nPublication suite, social media to video linking, word press plug-in, etc. \nMarket research and user studies to evaluate trends in the industry and help shape the near-term product roadmap of Vidrovr.","time":1499266527,"type":"comment"}