{"by":"GeocachingHQ","id":14703962,"parent":14688684,"text":"Geocaching | Senior Android Developer | Seattle, WA | Full-time, ONSITE (with remote options), Relocation Offered for Out-of-State Candidate<p>Perks: 6 Time Winner of &quot;Best Place to Work&quot; from Outside Magazine, Health Insurance Premiums covered 100%, Unlimited Ski Lift Tickets, Outdoor Gear Closet, and great work&#x2F;life balance.<p>www.geocaching.com&#x2F;careers<p>About Geocaching HQ:\nWe are the global headquarters for the game of geocaching. Our apps and Geocaching.com website allow a global community of millions of people to join in a real-world treasure hunt.<p>Our mission (and yours should you choose to accept it) is to inspire and enable discovery, exploration and adventure. Basically, everyone’s job here is to enable millions of people to have fun outside. How cool is that?<p>What you’ll do:\nWe are seeking a skilled Senior Mobile Developer to join the team that creates and maintains the suite of Geocaching apps for iPhone, Android and Windows Phone. The team is currently embarking on the reinvention of the way Geocaching is played on mobile devices. We’re seeking a developer who can quickly join in, come up-to-speed on the project and provide technical direction and leadership to a growing team.<p>What we’re looking for: \n- A proven track record of successfully delivering multiple iterations of Android apps to the public with rave reviews \n- A strong foundation of object-oriented programming skills and deep familiarity with computer science topics including data structures and algorithms \n- Ability to keep up with rapidly changing platforms and awareness of the latest advances on the Android platform. - A keen sense of the risks, rewards and trade-offs when making technical decisions \n- Mentorship and guidance to other developers \n- Love of a self-organizing, agile software development team and enthusiasm for Scrum rituals \n- Ability to Identify opportunities to improve the team’s processes and practices \n- Understanding of the importance of selling your ideas and building consensus within the team and the company \n- Enjoyment of close collaboration, both within and outside the team \n- Total ownership over the quality of his or her work and fluency in development practices that minimize bugs, including Test Driven Development and test automation \n- Sense for good UX practices and enjoys working with our UX team to create experiences that delight our customers<p>Apply today at www.geocaching.com&#x2F;careers.<p>Interview process includes 1st Phone Screen w&#x2F; HR, 2nd Phone Screen w&#x2F; hiring team, Skype Interview (if out of state), and In-person Interview.","time":1499273114,"type":"comment"}