{"by":"GeocachingHQ","id":14703941,"parent":14688684,"text":"Geocaching | UX&#x2F;UI Designer | Seattle, WA | Full-time, ONSITE (with remote options), Relocation Offered for Out-of-State Candidates<p>Perks: 6 Time Winner of &quot;Best Place to Work&quot; from Outside Magazine, Health Insurance Premiums 100% paid for, Unlimited Ski Lift Tickets, Outdoor Gear Closet, and great work&#x2F;life balance.<p>www.geocaching.com&#x2F;careers<p>About Geocaching HQ\nWe are the global headquarters for the game of geocaching. Our apps and Geocaching.com website allow a global community of millions of people to join in a real-world treasure hunt.<p>Our mission (and yours should you choose to accept it) is to inspire and enable discovery, exploration and adventure. Basically, everyone’s job here is to enable millions of people to have fun outside. How cool is that?<p>Position Overview: \nWe want to maximize the ease-of-use for all of our products, so our users can spend less time figuring out how our applications work and more time playing outside. \nThe UX&#x2F;UI Designer for Web will assist in all phases of product development, including research, ideation, validation and high-fidelity visual design.<p>We need you to make the cool, innovative things that will turn Geocaching into a trend-setter on the international stage.<p>What you&#x27;ll do: \n● Work as a critical member within a team of product owners, producers and developers to deliver world-class experiences \n● Create what it takes to articulate the design, including whiteboard sketches, user flows, wireframes, interactive prototypes, animations and redlines \n● Interview users, gather requirements from stakeholders, present your designs, and explain the reasoning behind design decisions \n● Contribute to the growth of the UX team through critiques, brainstorms, discussions and recommendations<p>Apply today at www.geocaching.com&#x2F;careers.<p>Interview process includes 1st Phone Screen w&#x2F; HR, 2nd Phone Screen w&#x2F; hiring team + portfolio review, Skype Interview (if out of state), and In-person Interview.","time":1499272962,"type":"comment"}