{"by":"ionescuac","id":14710394,"parent":14688684,"text":"Praetorian | Austin, Texas<p>Praetorian is different. We are a collective of highly-technical engineers focused on helping our clients solve their most difficult security problems. Rather than break things over and over, our goal is to have an actual impact in making the world a better place. 100% privately owned and self-funded, we are focused on doing the right thing over short term profits. Where other companies pay lip service to vision statements and principles, we are unwaveringly guided by our core values, which are:<p><pre><code>  * Put the client first - Solving their problem is why we are here.\n  * Mind the details - A disciplined process achieves results.\n  * Be humble - The needs of the many outweigh the needs of the one.\n  * Follow the data - Good data improves judgement and informs decisions.\n  * Performance matters - We achieve excellence in everything we do.\n  * Orient to action - Make decisions. Make mistakes. Just take the initiative.\n  * Default to open - Speak candidly, maintain your integrity, and spread truth.\n  * Support your team - It’s about the person to your left and the person to your right.\n  * Lean forward - Enduring success in this field requires innovation and reinvention.\n  * Follow your passions - Our best work is realized when our vocation is our avocation.\n</code></pre>\nAlthough small, we are growing rapidly, with 50% YOY growth for the past three years. That growth is based on fantastic clients and their support. Our annual net promoter score is consistently over 80%. By comparison, Apple is typically in the mid 70s, and Amazon is usually in the high 60s.\nWe are looking for experienced engineers that share our values. We offer our staff a generous benefits package, including:<p><pre><code>  * Competitive salaries\n  * Quarterly bonuses, 4% 401k matching, stock options\n  * Health insurance, and options for vision, dental, ADD, Short term disability, and life\n  * 20% Bench time for research, tool development, or training\n  * Flexible vacation policy\n  * Low travel requirements. Seriously. No more than 20% for those in network security and nearly 0% for those * in application security.\n  * Company contributions to training and conferences\n  * Opportunities for rapid growth and advancement based on merit.\n</code></pre>\nIf you’d like to learn more or apply for an open position, please visit our career page at: <a href=\"https:&#x2F;&#x2F;www.praetorian.com&#x2F;company&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.praetorian.com&#x2F;company&#x2F;careers</a>. Take a look at our tech challenges too, as we’ll ask you to complete one early in the interview process: <a href=\"https:&#x2F;&#x2F;www.praetorian.com&#x2F;challenges&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.praetorian.com&#x2F;challenges&#x2F;</a>","time":1499349135,"type":"comment"}