{"by":"harrietCleo","id":17664806,"parent":17663077,"text":"Cleo | Backend Engineer, Ruby (Senior &amp; Mid) | London | Full-time | Onsite<p>Cleo is an AI assistant that helps over 400,000 people in the UK, US and Canada feel great about their money. We&#x27;re one of the fastest growing startups on the planet backed by the founders of Skype, Transferwise and Zoopla.<p>We&#x27;re looking for a pragmatic tenured engineer that can help us deliver an amazing product at scale. You&#x27;ll work within a bright experienced team of 5 backend engineers and a wider engineering team of 8 growing to 16 over the next year.<p>We want Cleo to be known for being one of the best engineering organisations anywhere and hope you&#x27;ll make a big contribution to building that culture.<p>What you&#x27;ll be working on:<p>- Product. 90% of your time will be building new features and improving existing ones. We love getting features into users’ hands early, learning and iterating. We&#x27;re exceptionally data driven.<p>- Bank data API integrations. We use various third party services for banking data aggregation and plan on integrating more more providers throughout this year.<p>- Payments. From paying friends to saving automatically, you’ll write code that moves money safely.<p>You:<p>- have the experience and (battle scars) to know when to over and when to under engineer.<p>- can reduce complex problems to simple solutions consistently.<p>- enjoy making those around you better engineers.<p>- are excited by what we&#x27;re building at Cleo.<p>- are product-focused and care about making our users’ lives better.<p>You will:<p>- get to work at one of the fastest growing, venture-backed startups anywhere in the world. We have gone from 200,000 users in February to over 400,000 in June.<p>- work with one of the smartest, dedicated and passionate teams in Europe.<p>- have a genuine impact on the tens of thousands talk to Cleo each day. We make a positive difference to quality of life.<p>For this and other job roles, please see: <a href=\"https:&#x2F;&#x2F;meetcleo.recruiterbox.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;meetcleo.recruiterbox.com&#x2F;</a>","time":1533144944,"type":"comment"}