{"by":"contingencies","id":17668069,"parent":17663077,"text":"Infinite Food | Mechanical Design Engineers &#x2F; Electrical Engineers &#x2F; Operations Researchers &#x2F; Food Safety and Quality Manager &#x2F; Engineering Architect | Zhuhai, China | VISA &#x2F; REMOTE &#x2F; Full-time &#x2F; Part-time | <a href=\"http:&#x2F;&#x2F;infinite-food.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;infinite-food.com&#x2F;</a><p>Infinite Food will define and dominate a new segment of global food retail based upon a wholly owned and operated network of service locations powered by advanced robotics. Consumers  order via smartphone and receive personalized hot meals automatically cooked from fresh ingredients and packaged, ready for pickup from our 2m² footprint machines within only three minutes. 10-20x faster than delivery, with true 24x7x365 operation and service in any language, our Series A venture aims to launch 300 locations across three markets in 2019. We are a Zhuhai-based, Zhuhai&#x2F;Shenzhen&#x2F;Hong Kong&#x2F;BVI registered company with two and a half years of IP currently seeking:<p>(1) Mechanical Design Engineers with fluency in Solidworks. Working language is English, Mandarin or regional languages well regarded. Broad range of interesting work focusing on automation and industrial products, rapid prototyping and iteration with supporting electrical, software, logistics and machine learning engineers. Experience with CFD (heat, fluid and airflow modeling), electrical and food safety regulation in any market, production in thermoform, injection molding, blow molding, extrusion well regarded. New, spacious, modern office in central Zhuhai. Physical presence encouraged but not a daily requirement.<p>(2) Electrical Engineers. Rapid prototyping of PCBs for robotic &#x2F; mechatronic systems design iteration, plus opportunities in power systems design, power supply quality monitoring, energy storage systems evaluation, induction system efficiency enhancement, actuation component specification and evaluation, motion control systems, test harnesses, manufacturing process control, environmental monitoring, etc.<p>(3) Operations Researchers. Opportunity to get involved creating, shepherding and managing fast-growing greenfield operations processes using the latest technology with supporting software and machine learning engineers. Areas include manufacturing and real time perishable goods logistics networks as well as network planning and spatial configuration of new sites.<p>(4) Food Safety and Quality Manager. Background in microbiology, chemistry, software or operations research, national or international experience in the food safety industry well regarded. Initial jurisdiction will be mainland China but global knowledge will be critical as we move from domestic through regional and global markets. Interface with manufacturing, design and government relations teams, author and run world first automation systems for food safety and traceability.<p>(5) Engineering Architect. Numerous novel and substantial systems ideal for cross-disciplinary (mechanical&#x2F;industrial&#x2F;production) engineer-architect. Interesting work will provide opportunity to apply and combine principles from systems thinking, traditional architecture, industrial solutions, portability and modularity. Scope includes both finished systems and systems-of-systems.<p>For all positions: Mandarin speakers well regarded, but Chinese knowledge is not required. Clear written technical communication in English is mandatory. Skills and experience first, qualifications a distant second. We respect execution.<p>Email in profile, please include &#x27;Candidate: &lt;job title&gt;&#x27; in subject. No recruiters.","time":1533166958,"type":"comment"}