{"by":"cgc0","id":17664157,"kids":[17664660],"parent":17663077,"text":"Williams PanLab for Precision Psychiatry and Translational Neuroscience | Research Data Analyst and Engineer | Stanford, CA; Remote possible | Full-time, Visa | <a href=\"http:&#x2F;&#x2F;williamspanlab.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;williamspanlab.com&#x2F;</a><p>The PanLab for Precision Psychiatry and Translational Neuroscience is searching for a Research Data Analyst and Engineer to build and improve upon our treatment prediction software pipeline, which will help guide an individual to the depression&#x2F;anxiety treatment that is most effective for them. Our pipeline is the first of its kind and currently outputs the different ways brain circuitry can become dysfunctional. The candidate will use machine learning and statistical techniques in our large datasets to analyze the outputs of our current pipeline and create new treatment prediction models.<p>The PanLab is a research group at Stanford University that aims to use brain imaging to improve our understanding and treatment of mental health conditions. Our current projects focus on depression and anxiety, with research that embraces individual differences. We use a variety of tools such as MRI, EEG, behavioral testing, genetics, symptoms, and daily functioning data, in order to match an individual with the best treatment for them, whether that is an antidepressant, psychotherapy, TMS, lifestyle changes, etc.<p>We are looking for a candidate with strong data analysis and software engineering experience, but no neuroimaging experience is required! As we are a 30-person team of psychiatrists, neuroscientists, doctors, clinical psychologists, and data scientists, the ability to communicate technical ideas across a range of experiences is vital. Most importantly, we seek someone self-motivated, imaginative, and genuinely excited to dig into our datasets and to explore novel, reliable, and effective ways to help individuals suffering from mental illness.<p>Read more about our research: <a href=\"http:&#x2F;&#x2F;williamspanlab.com&#x2F;our-research\" rel=\"nofollow\">http:&#x2F;&#x2F;williamspanlab.com&#x2F;our-research</a><p>Our publications: <a href=\"http:&#x2F;&#x2F;williamspanlab.com&#x2F;publications\" rel=\"nofollow\">http:&#x2F;&#x2F;williamspanlab.com&#x2F;publications</a><p>Interested? Email us your CV to bstavel@stanford.edu","time":1533141510,"type":"comment"}