{"by":"fleming_Citizen","id":17667648,"parent":17663077,"text":"Citizen | Senior Engineers (iOS &#x2F; Front End &#x2F; Backend) | Full-time | New York, NY | 125k - 170k | ONSITE | citizen.com<p>Citizen is a Series A startup, backed by Sequoia Capital, located on Grand St. in New York City.<p>Info about Citizen<p>What we do:<p>Our vision is to protect people by keeping them informed of all crimes happening near them in real time, using a variety of sources correlated with their location and concerns. We have a host of challenges we are working on like mobile video streaming, tuning distributed systems to support bursting from 100&#x27;s to nearly 400k active users, and digital signal processing just to start. While a young startup, we&#x27;re already growing quickly in NYC with over 3% of the city already have downloaded our app. We have expanded service to San Fransico, with more cities to be brought online in the months to come.<p>Our Stack: Kubernetes on GCP, MySQL, Redis, Kafka, Firebase, Go, Node, React.js, Swift (iOS), Java (Android)<p>Three of our open roles:<p>Senior iOS Engineer - <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;citizen&#x2F;38dea578-b6db-4386-9b0a-dadb7a76b250\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;citizen&#x2F;38dea578-b6db-4386-9b0a-dadb7a...</a><p>Senior Backend Engineer - <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;citizen&#x2F;34b01f0c-366d-4c34-a195-b4c3620d4162\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;citizen&#x2F;34b01f0c-366d-4c34-a195-b4c362...</a><p>Senior Frontend Engineer - <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;citizen&#x2F;44d4eb8d-097f-40f4-a162-37edb2caef56\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;citizen&#x2F;44d4eb8d-097f-40f4-a162-37edb2...</a><p>If you would like to learn more about one of Citizen&#x27;s open roles before you apply, feel free to reach out to me directly - stephen(at)citizen.com<p>Note: Citizen offers a competitive benefits package including medical, dental, vision, flexible spending accounts, paid time off, company holidays, stock option plan, commuter benefits, and various wellness perks.","time":1533162444,"type":"comment"}