{"by":"rheadiekuk","id":17663415,"parent":17663077,"text":"Ajenta | Edinburgh, UK | Front-End Developer | Full-time | Onsite | <a href=\"https:&#x2F;&#x2F;ajenta.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ajenta.net&#x2F;</a><p>Ajenta are working with clients all over the world to create innovative communication tools that are changing the way people collaborate. With a growing client base from healthcare and education to large enterprise, Ajenta are at the forefront of the future of communication technology.<p>We are seeking talented front-end developers at all experience levels to help build innovative video communication solutions.<p>This is a truly exciting opportunity to join a dynamic and highly skilled company during a period of high growth. You’ll have the opportunity to work on a cutting-edge application, solving problems including collaborative tools, data workflows and social networking aspects, solving the interoperability problem with WebRTC based video-conferencing and providing real-time performance and usage metrics on our services, while improving code quality and maintainability as a team.<p>Essential:\nStrong JavaScript, ES6 skills.\nExcellent HTML5, CSS, Sass knowledge.\nExperience with React\nAbility to write clean and maintainable code\nExperience with Version control (Git)<p>Desirable:\nKnowledge of Javascript bundlers (Webpack, Rollup)\nExperience working with REST APIs\nExperience of React Native\nBasic knowledge of SQL databases (ideally Postgres)\nHave an understanding of AWS and Docker<p>Benefits:\nOpportunity to shape the future of our products and our markets.\nWork in a futuristic office, that provides staff fruit and quality coffee.\nGreat location in Edinburgh, based at the Shore in Leith.\nCompetitive salary and benefits £25-28K DOE<p>For more info <a href=\"https:&#x2F;&#x2F;ajenta.net&#x2F;job&#x2F;front-end-developers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ajenta.net&#x2F;job&#x2F;front-end-developers&#x2F;</a> or email jobs@ajenta.net","time":1533137516,"type":"comment"}