{"by":"ahlatimer","id":17663160,"parent":17663077,"text":"Contract Simply (YC S17) | Austin, TX | Product Manager | Full-Time | Onsite<p>Contract Simply (<a href=\"https:&#x2F;&#x2F;contractsimply.com\" rel=\"nofollow\">https:&#x2F;&#x2F;contractsimply.com</a>) is looking for a Senior Product Manager in Austin or is willing to relocate.<p>ABOUT US<p>Contract Simply is building the first A.I., machine learning platform for the $900B US construction lending market. We help banks manage their large and complex construction loan portfolio using intelligent automation and integrated payments. Unlike a typical loan, a construction loan isn’t a single payment. Instead, it’s broken up into monthly payments called draws. That monthly draw process is complicated, with many stakeholders and hundreds or thousands of documents. Currently, all of this is managed with excel spreadsheets, PDFs, emails, and paper checks.<p>Our software helps lenders, developers, and other stakeholders produce and process this documentation automatically, leading to fewer errors, faster payments, and more profitable loans.<p>We’re currently small (10 employees), YC-backed, and are already working with several of the largest lenders in the industry. You’d be working directly with the founders in a company that values being purposeful, efficient, authentic, transparent, curious, and agile.<p>ABOUT YOU &#x2F; THE ROLE<p>We’re looking for a product manager who is happy to take ownership of the product lifecycle and who is not afraid to get their hands dirty. Your key responsibilities will be to set the medium-term vision and strategy of the product and communicate that strategy to all of the relevant participants and stakeholders.<p>We offer competitive pay and benefits, plus equity. Our culture is open, transparent, and fun. We work hard, but also take time for our families, friends, and hobbies.<p>If you&#x27;re interested, please contact me at andrew@contractsimply.com. You can also read more about the job and requirements at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;contract-simply&#x2F;jobs&#x2F;322111-sr-product-manager\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;contract-simply&#x2F;jobs&#x2F;322111-sr-product-mana...</a>","time":1533136136,"type":"comment"}