{"by":"blocher","id":17666536,"parent":17663077,"text":"Fireman Creative | Paid Web Development Intern | Pittsburgh, PA | Onsite  | Full or part time <a href=\"http:&#x2F;&#x2F;firemancreative.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;firemancreative.com&#x2F;</a> | <a href=\"https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;job&#x2F;7f575c93\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;job&#x2F;7f575c93</a><p>Fireman Creative is seeking a ambitious, self-starter as an web development intern.  The ideal candidate will be a college student or recent graduate.  If you’re interested in teaming up non-profits that make a difference as well as large national companies to deliver winning solutions in a fun, fast-paced environment—we want to talk.  This is a great opportunity to work with great clients while learning modern web development.<p>We will consider candidates with some experience in two or more of these technologies:<p>- PHP\n- WordPress theming and plugin development\n- Relational databases such as MySQL\n- Basic server administration\n- CSS,  SASS, HTML, AJAX, and JavaScript\n- A love of creative problem solving\n- Familiarity with PHP frameworks like Laravel or Symphony\n- Object oriented programming concepts and the MVC pattern\n- Familiarity with JavaScript frameworks like Vue.js, Angular or React\n- iOS or Android development\n- Comfort working on tight deadlines and in a team environment and going the extra mile when a deadline looms\n- In general, a nice person to be around who enjoys tackling challenges and learning new skills<p>About Fireman Creative:<p>Fireman Creative is an innovative design and technology agency in Pittsburgh, PA.  We are 15 years young, but have never lost the entrepreneurial and drive feel of a startup.   We work in a recently restored 19th century firehouse, a jewel in the Point Breeze neighborhood.<p>We’ve built sites and apps that focus on establishing communities large and small: major homebuilders and developers including affordable housing, community centers across North America, environmental groups, social service providers, and world-leading technology innovators.  No two days at Fireman Creative are alike.  If you are ready for a high-paced challenge, we want to talk. Fireman Creative is an equal opportunity employer.<p>To apply, please visit: <a href=\"https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;job&#x2F;7f575c93\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;job&#x2F;7f575c93</a>","time":1533154567,"type":"comment"}