{"by":"jor-el","id":17669001,"parent":17663077,"text":"Gemalto Pte Ltd | Singapore | Mobile Security Researcher&#x2F;Pentester | Singapore Full-time | ONSITE| Visa&#x2F;Relocation<p>Position: Mobile Security Researcher&#x2F;Pentester (Android and iOS)<p>Job Description:<p>Gemalto provides mobile platform solutions to various industries, including governments and banks, across the globe. This role is very specific to mobile platforms- Android &amp; iOS. The core responsibilities are:<p>- Perform pentesting on mobile products\n- source code reviews\n- Risk Assessment\n- Researching on new attack and defense techniques for mobile applications.\n- Act as consultant to internal teams and provide advise for best security practices, applied crypto, authentication, secure programming etc.\n- Reverse Engineering mobile application (native, Java, ObjC).<p>Desired Skillset:\n- Understanding of the attack paths on mobile applications\n- Understanding about common OS exploits: Jailbreaking&#x2F;Rooting&#x2F;Flashing a device, custom kernels, custom ROMs, hooking frameworks\n- Comfortable with ARM&#x2F;Aarch64 assembly .\n- Knowledge of classic attacking techniques: data cloning, reverse engineering, traffic interception, hooking, debugging (like gdb, jdb, other tools like Burp suite, Substrate, Frida, Cycript, IDA etc.)\n- Knowledge of iOS&#x2F;Android security frameworks – their implementation and mitigation controls\n- Knowledge about applied cryptography and best practices.\n- Experience with reversing obfuscated code (C, Java, ObjC) using tools&#x2F;techniques like symoblic execution, unicorn etc, is a plus.<p>It is a small well managed team, with challenging work and mostly involves working independently. Training and attending conferences opportunity is provided.<p>If you are interested to learn more about the role, feel free to contact me at vikas.gupta@gemalto.com.<p>On Linkedin: <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;729732099&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;729732099&#x2F;</a>","time":1533179474,"type":"comment"}