{"by":"eric0908","id":17663669,"parent":17663077,"text":"Sysco LABS | Machine Learning, Senior Software Engineers, Product, UI, UX | Austin, TX | Onsite | Fulltime<p>Sysco LABS is a technology-focused division within Sysco Foods (distributes to 500k restaurants globally, $55bil&#x2F;yr revenue), dedicated to reimagining foodservice through innovation. An extension of Sysco’s longstanding commitment to deliver exceptional products and services to the foodservice industry, Sysco LABS leverages customer and market intelligence, data-driven insights and agile technology development to rethink the entire foodservice ecosystem. Sysco LABS’ innovations will improve everything from the ordering process, delivery, inventory, pricing and automation to the in-restaurant customer experience. Operating with the mindset of a startup and backed by the authoritative expertise of an industry leader, Sysco LABS’ mission is to enhance the Sysco customer experience and consistently deliver revenue growth, cost savings and new innovations through technology.<p>Our team is currently looking for an experienced Machine Learning Engineer to build and implement data models and that solve real-world transportation and logistics problems at scale. see: ~5k delivery trucks on the road per day, ~100k deliveries to customers per day. Please contact me at eric.adleman@sysco.com with any questions about that position, or any of the other roles below.<p>Machine Learning Engineer: new position, e-mail resume&#x2F;cv and brief summary to eric.adleman@sysco.com<p>Product Manager, Search: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3A7h1kwO\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3A7h1kwO</a><p>Search Software Engineer: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3R7h1kw5\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3R7h1kw5</a><p>Senior Software Engineer: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3BzJxjwe\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3BzJxjwe</a><p>Quality Engineer: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3SWh1kwV\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3SWh1kwV</a><p>UX Researcher: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3cS4Cjwy\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3cS4Cjwy</a><p>UI&#x2F;UX Designer: <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3nmzWkw3\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3nmzWkw3</a><p>ctrl+f: austin, texas, java, python, ml, ai, machine learning, logistics, delivery, aws","time":1533138893,"type":"comment"}