{"by":"bensummers","id":17665944,"parent":17663077,"text":"Haplo | London | ONSITE | Graduate Software Engineer<p>Are you graduating this summer? Haplo will help you get the best possible start to your career as a software developer.<p><a href=\"https:&#x2F;&#x2F;haplo-services.com&#x2F;jobs&#x2F;new-graduates\" rel=\"nofollow\">https:&#x2F;&#x2F;haplo-services.com&#x2F;jobs&#x2F;new-graduates</a><p>Every year, new graduates join our team, and they ship working features to our clients within their first two weeks. We support their growth in a direction which suits them, whether that&#x27;s a focus on writing code, taking a client-facing role, or developing a particular specialism.<p>We can do this because we&#x27;ve really thought about how to build a team, and a way of developing software, that can enable someone at the beginning of their career to realise their potential as quickly as they can.<p>Joining us will give you a wide range of experience across the full software development lifecycle, and you&#x27;ll make an important contribution to your team.<p>You&#x27;ll be building hosted products used by universities to manage their research:<p>* PhD Manager is our market leading system to manage PhD programmes, helping everyone work together and PhD researchers to complete their doctorate.<p>* Ethics Monitor enables universities to ensure that all research is safe and ethical.<p>* Haplo Research Manager brings together the full lifecycle of research, from the start of the project to the publication of results.<p>Our products are written on top of our open source platform, designed for building applications which manage large amounts of semi-structured data with a polished user experience.<p>While ideal, a computer science degree isn&#x27;t essential, as long as you&#x27;ve written software as part of your degree or outside your studies. You&#x27;ll mainly be working in server-side JavaScript, but don&#x27;t need to have used this before.<p>Haplo is an equal opportunities employer, and our inclusive team welcomes colleagues from all backgrounds: <a href=\"https:&#x2F;&#x2F;haplo-services.com&#x2F;about&#x2F;who\" rel=\"nofollow\">https:&#x2F;&#x2F;haplo-services.com&#x2F;about&#x2F;who</a><p>You must have a right to work in the UK.","time":1533150863,"type":"comment"}