{"by":"ComputerGuru","id":17664169,"parent":17663077,"text":"NeoSmart Technologies | full and part-time positions | REMOTE only<p>NeoSmart Technologies is the world leader in disaster recovery. We&#x27;ve reverse engineered the entire Windows bootup procedure from BIOS POST to the login screen [0], and have developed automated tools to rebuild the entire thing from scratch with nary a user intervention: <a href=\"https:&#x2F;&#x2F;neosmart.net&#x2F;EasyRE&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;neosmart.net&#x2F;EasyRE&#x2F;</a><p>We&#x27;re also the authors of the wildly famous EasyBCD [1] bootloader modification freeware, and numerous other system-related utilities. We fully embrace all types of technology, and ship code written in C, C++, C#, Rust, ASP.NET, ASP.NET Core, HTML&#x2F;CSS, JavaScript, TypeScript, and more.<p>We are currently hiring for the following positions:<p>1) Researchers with a knack for experimentation and writing to expand our wiki of system errors by purposely breaking Windows virtual machines and then seeing what it takes to fix them. Example: <a href=\"https:&#x2F;&#x2F;neosmart.net&#x2F;wiki&#x2F;ntldr-is-missing&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;neosmart.net&#x2F;wiki&#x2F;ntldr-is-missing&#x2F;</a> and <a href=\"https:&#x2F;&#x2F;neosmart.net&#x2F;wiki&#x2F;ntdetect-failed&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;neosmart.net&#x2F;wiki&#x2F;ntdetect-failed&#x2F;</a><p>The findings of your feedback would be used to both improve the automated repair process of tools like EasyRE and to directly benefit others searching for solutions online.<p>2) ASP.NET Core full-stack developers<p>We have a number of legacy ASP.NET MVC projects we would like to port to ASP.NET Core as well as new ASP.NET Core-based projects with frontends written in plain CSS&#x2F;HTML + TypeScript (so not react or vue.js-based). These include our online ecommerce platforms, custom cms, software hosting system, and more.<p>3) C# developers with XAML design experience<p>We are looking to port a number of legacy .NET Framework 2.0 apps to either WPF or UWP, and are looking for talented desktop software developers to help us make the switch. We also have a number of open-source NuGet packages that need some love, including further documentation.<p>Email me if you&#x27;re interested. mqudsi@neosmart.net<p>[0]: <a href=\"https:&#x2F;&#x2F;neosmart.net&#x2F;wiki&#x2F;mbr-boot-process&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;neosmart.net&#x2F;wiki&#x2F;mbr-boot-process&#x2F;</a><p>[1]: <a href=\"https:&#x2F;&#x2F;neosmart.net&#x2F;easybcd&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;neosmart.net&#x2F;easybcd&#x2F;</a>","time":1533141573,"type":"comment"}