{"by":"jackm","id":17666014,"parent":17663077,"text":"Duolingo | Senior Android Engineer | Full Time | ONSITE | Pittsburgh, PA<p>## Email jack [at] duolingo [dot] com to apply<p>An Android expert who will help millions of people learn on a mobile device.<p>Duolingo software engineers develop next-generation education technology that changes how over 120 million people around the world learn. We’re looking for engineers who bring fresh ideas from all areas in computer science, including natural language processing, machine learning, large-scale system design, and iOS &amp; Android mobile app development. As an Android software engineer, you will work on a specific project critical to Duolingo’s needs, with opportunities to switch teams and projects as our fast-paced startup grows and evolves. You will develop applications primarily in Java and using the Android SDK. We need our engineers to be versatile, display leadership qualities and be enthusiastic to tackle new problems across the full-stack as we continue to innovate.<p>Duolingo | Software Engineer, iOS | Full Time | ONSITE | Pittsburgh, PA<p>## Email jack [at] duolingo [dot] com to apply<p>Build your engineering career and help us shape the future of education.<p>Duolingo is the most popular language learning application in the world, with over 200 million users and hundreds of billions of data points. We are passionate about educating our users, making fact-based decisions, and finding elegant solutions. If this sounds like you, then come help us build the next-generation learning company!<p>As a software engineer, you will work on a specific project critical to Duolingo’s needs, with opportunities to switch teams and projects as our fast-paced startup grows and evolves. We need our engineers to be versatile, display leadership qualities, and be enthusiastic to tackle new problems as we continue to innovate.<p>Duolingo | Operations Engineer (DevOps) | Full Time | ONSITE | Pittsburgh, PA<p>## Email jack [at] duolingo [dot] com to apply<p>Continuously improve Duolingo’s infrastructure through automation and monitoring.<p>As an operations engineer, you will use and develop cutting-edge tools to enable growth and stability across all Duolingo services and platforms.","time":1533151245,"type":"comment"}