{"by":"benjammin23","id":17664151,"parent":17663077,"text":"At Willow &amp; Everett, we believe that life is short, so everyone should be spending their time doing what they love and making a difference. We are comprised of 3 different online direct-to-consumer brands that all focus on “Home Happiness” and bringing the most value to customers. We obsess over product quality and our customers, and strive to build the best relationship with them.<p>Our brands: Willow &amp; Everett specializes in tea, coffee and Cold Brew, having just completed a $150k+ Kickstarter and was featured on the Tim Ferriss Show. Emma + Ollie is a baby brand that focuses on products that combine aesthetics with function. PetHonesty is a soon-to-be-launched pet brand that seeks to bring transparency and the highest quality in various pet products and supplements.<p>Your Role\nAs we continue to grow, we’re looking for a key player to lead our digital marketing efforts. This person will oversee all our off-Amazon traffic and conversions. They will be owning our customer assets, developing relationships and producing ROI with our email, text, and messenger lists. They will be implementing and overseeing Facebook ads and funnels, increasing website sales, split-testing and measuring results on everything they do.<p>This person will learn the ins and outs of our business, and will be working with and managing world-class contractors for various roles--if you don’t have experience with something, you’ll either learn it or manage a world-class contractor to implement it. You’ll be working with our close-knit team at the downtown WeWork in Austin, where we work and play hard.<p>The impact you&#x27;ll make will be tremendous--this is a unique opportunity to roll up your sleeves and grow a company with a small but dedicated team. We believe in achieving win-wins, and would love to share in the upside we all create together :)<p>For more info:<p><a href=\"https:&#x2F;&#x2F;willow-and-everett.workable.com&#x2F;jobs&#x2F;750158\" rel=\"nofollow\">https:&#x2F;&#x2F;willow-and-everett.workable.com&#x2F;jobs&#x2F;750158</a>","time":1533141481,"type":"comment"}