{"by":"yochannah","id":17670141,"parent":17663077,"text":"Department of Genetics University of Cambridge | Cambridge, UK | Research Software Engineer (Fixed Term)| Full-time | Visa | Onsite | <a href=\"http:&#x2F;&#x2F;intermine.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;intermine.org&#x2F;</a> + <a href=\"http:&#x2F;&#x2F;www.stormtherapeutics.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.stormtherapeutics.com&#x2F;</a><p>This is a unique opportunity for an enthusiastic and talented software engineer to work on an innovative collaboration in the form of an Innovate UK Knowledge Transfer Partnership (KTP), between University of Cambridge and STORM Therapeutics. The key objective of this role is to develop an analysis platform using the data warehouse InterMine to help STORM advance their cancer research. The KTP program aims to develop future business leaders and thus offers excellent training (dedicated annual budget), supervision and mentoring.<p>Required skills and experience:<p>Degree in computer science, bioinformatics or a related discipline, or equivalent experience; Familiarity with managed languages (such as Java) and&#x2F;or dynamic scripting languages (such as Python, Perl); Experience with databases, ideally PostgreSQL; Experience or interest in web front-end development (HTML, CSS, JavaScript); Ability to work on Linux systems and use the command line; Exceptional communication, problem-solving and critical thinking skills; Ability to work and communicate effectively as part of a diverse multi-disciplinary team of programmers, biologists, chemists.<p>Desired skills and experience:<p>Experience with build tools, unit tests and continuous integration; Experience with version control, in particular Git; Some awareness of modern bioinformatics best-practices; Knowledge of some different biological file formats, e.g. GFF3, OBO<p>STORM Therapeutics (www.stormtherapeutics.com) is a drug discovery company focused on RNA epigenetics, developing small-molecule inhibitors of RNA-modifying enzymes for the treatment of cancer. This project aims to provide STORM with sophisticated tools to view and interrogate pertinent data on target genes&#x2F;proteins and to perform advanced bioinformatic analyses and visualisation.<p>InterMine (intermine.org) is the world-leading advanced platform for biological data integration developed by the Micklem Lab, within the Department of Genetics at the University of Cambridge. Working on InterMine will give you the chance to contribute directly to a popular open-source tool suite, used by dozens of top open science-oriented bioinformatics groups worldwide. As a mature Java-based tool, InterMine has a stable code base with a rich set of well-tested web services and API endpoints to power data analysis and applications.<p>The successful applicant will be employed by the University of Cambridge although embedded at STORM Therapeutics, with regular time also spent within the Cambridge academic team..<p>Informal enquiries should be directed to Julie Sullivan (j.sullivan@gen.cam.ac.uk) or Hendrik Weisser (hendrik.weisser@stormtherapeutics.com).<p>To apply online for this vacancy, please visit: \n<a href=\"http:&#x2F;&#x2F;www.jobs.cam.ac.uk&#x2F;job&#x2F;18260&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobs.cam.ac.uk&#x2F;job&#x2F;18260&#x2F;</a>","time":1533200450,"type":"comment"}