{"by":"coolphoenix","id":17679396,"kids":[17682900],"parent":17663077,"text":"Stellenticket GmbH | Berlin, Germany | Full- or part-time Ruby on Rails and vue.js developers | REMOTE and ONSITE | <a href=\"https:&#x2F;&#x2F;www.stellenticket.de&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stellenticket.de&#x2F;</a><p>We are a small soft­ware com­pany of 12 people. Since 2010 we are a service provider for universities in Germany (for example Technische Universität Berlin, Technische Universität Dresden, Leipzig Universität Hannover and many more). We develop web based service according to the needs of our clients and focus on user experience and new technology – something usually not seen in university software.<p>We are looking for <i></i>Ruby on Rails backend developers<i></i> and <i></i>vue.js frontend developers<i></i>.<p>Some of our projects: An applicant tracking system, a task manager, a customer relationship management tool and an internship database.<p>Our usual backend stack is:<p>- Ruby on Rails 5.x<p>- Postgresql 10.x<p>- fast_jsonapi<p>- Swagger<p>For frontend we use:<p>- vue.js 2.x (with the whole ecosystem)<p>- sometimes bootstrap 4.x as a basis<p>- eslint and stylelint<p>We are looking for experienced developers (at least 12 month experience). Work can be done remotely or onsite – in case of onsite we can offer a nice working place in Prenzlauer Berg, Berlin and alternatively in Heiligensee, Berlin. It can be full- or part-time with a minimum of 15 hours per week and usually we strive for a permanent employment if things work out well. Salary is based on your experience and in the range of 50.000 to 80.000 € (in case of regular full time employment, with holidays etc. included).<p>If you are passionate about your work and love programming as we do, feel free to send your application to:<p>apply@stellenticket.de, Mr. Markus Doits, reference: HN 08.2018<p>Please include the usual details, your preferred working area and the editor you usually use for coding.<p>I&#x27;m one of the founders and still one of the main coders, so feel free to get in contact with me if you have any questions.<p>-- Markus","time":1533300874,"type":"comment"}