{"by":"schlanda","id":17674103,"parent":17663077,"text":"Business Insider |DevOps Engineer, Backend Engineer, Release Engineer | New York, NY | Onsite | Fulltime<p>Insider Inc. is the publisher of INSIDER, Markets Insider, and 17 international editions of Business Insider, including the flagship NY-based US edition. The company pioneered a digital-native approach to news and information that is social and mobile at its core, for an ambitious and curious global audience that grew up with digital. The company launched in 2007, and in ten years, Business Insider has grown to become the most favorite business news brand in the world, when measured by reach. Insider Inc. reaches a global audience of several hundred million readers and viewers. The company also offers a subscription research service, Business Insider Intelligence (BII), that provides in-depth insight, data, and analysis of digital topics. Every year the company hosts IGNITION, an influential media and technology conferences. Insider Inc. is a subsidiary of Axel Springer SE. We are always looking for talented, curious and motivated individuals to join our growing team.<p>Come join our growing Engineering team!<p>Backend Engineer: Work on php and go applications on our Story Creation, Engagement, Monetization, or Delivery teams.<p><a href=\"https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;backend-engineer-cbRdmSemGr6lUUeMg-44q7\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;ba...</a><p>Devops Engineer: Build out our CI&#x2F;CD platform, improve system and application observability, manage our cloud-based infrastructure, and write code (VCL) on the edge with our CDN.\n<a href=\"https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;devops-engineer-d-A7HMI1Sr6kIvdG1ZS6tF\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;de...</a><p>Senior Devops Engineer: <a href=\"https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;senior-devops-engineer-aieaV8I1Sr6iWpeMg-44q7\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;se...</a><p>Release Engineer: Manage our releases, automate and improve our release pipeline, and work closely with developers to maintain high release confidence.<p><a href=\"https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;release-engineer-byijqWI1Wr6kIvdG1ZS6tF\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.jobscore.com&#x2F;careers&#x2F;businessinsider&#x2F;jobs&#x2F;re...</a>","time":1533234495,"type":"comment"}