{"by":"ellenhitt","id":17698263,"parent":17663077,"text":"Become an early stage team member of a Venture Capital backed startup that is reimagining the dental experience. We are searching fora skilled and experienced Full Stack Developer who is passionate about delivering the best possible experience to both patients and dental staff.You need to be highly skilled, disciplined, entrepreneurial, and comfortable in a fast paced environment. Work with amazing people in a culture where we recognize each other’s wins and celebrate together!<p>You will manage both front-end and back-end development to develop a completely new web platform for patients to interact with a more modern dental experience\nOwn the entire application lifecycle from its technical design, implementation, deployment into the appropriate infrastructure, and ongoing operational monitoring, maintenance, and iterative tech and functional improvement.\nYou will create responsive web design for both desktop and mobile formats\nYou will work together with designers to develop desirable &#x2F; functional front end UX\nYou will be creating a stable and flexible database structure that will enable us to rapidly build and test new product features and which can scale as we iterate on the product and add members to the technical team\nYou will be implementing best-in-class tracking and analytics to ensure that we’re learning from new features that we continuously deploy and A&#x2F;B test behind feature flags\nYou will be integrating external APIs to deliver desired patient experience (e.g., scheduling, webchat, etc.)<p>BS in Computer Science is preferred\nMust live in NYC area\n4+ years of experience as a Full Stack Developer\nFluent and obsessive about results across the stack - from front end pixel perfect HTML, CSS, and rich interaction experiences to building performant backend API behaviors and evolvable data schemas. Framework agnostic but the ideal candidate has an excellent foundation in modern Javascript toolchains and relevant frameworks such as React&#x2F;Angular&#x2F;Vuejs and server side tech and frameworks such as Nodejs, Python, Java and relevant API frameworks\nExperience with CMS frameworks\nAbility to troubleshoot and debug code\nUnderstanding of web development process, from technical design, development, deployment to monitoring and improvement\nFamiliarity with layout requirements\nUnderstanding of SEO standards\nBelieves in unit and integration testing as a first class requirement of high quality software development.\nExcellent communication and interpersonal skills to collaborate with internal teams and external resources\nAbility to translate requirements into a finished project\nAbility to perform independently while handling multiple project and tasks concurrently and timely\nAbility to make technical design decisions and collaborate with team members to create technical solutions\nCuriosity for continuously learning and perfecting your programming craft\nHigh level of integrity and dependability with a strong sense of urgency and results-orientation\nFamiliarity with HIPAA compliance a plus\nWe can’t wait to hear from you! e-mail, ellen@juxtapose.nyc","time":1533568216,"type":"comment"}