{"by":"jamesor","id":17709776,"kids":[17762872],"parent":17663077,"text":"Discovery Digital Media | Client Engineering | Fulltime | New York, NY | ONSITE | <a href=\"https:&#x2F;&#x2F;www.discovery.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.discovery.com</a><p>ABOUT US:<p>We are a small, but mighty team, working at the cross roads of technology and entertainment to bring content from iconic television brands to our audiences over the Internet in the most entertaining ways we can imagine and build. As television changes, our mission remains true to the principles that founded Discovery – every day we seek to ignite people’s curiosity to engage, entertain and enlighten the world around them through amazing viewing experiences.<p>We deploy applications for each of our network brands: Discovery, TLC, Velocity, Science Chanel, Investigation Discovery, Animal Planet, American Heroes Channel, Destination America, Discovery Life, Discovery Familia and Discovery en Español.<p>CLIENT PLATFORMS:<p><pre><code>  - React JS (Responsive Web, Xbox One, Samsung SMART TV, more)\n  - React Native (iOS, Apple TV, Android, Fire TV, Android TV)\n  - Roku\n</code></pre>\nOPEN POSITIONS:<p>For our UI Team we are looking for a group of talented (possibly self-taught) front-end engineers who have a solid design background. Maybe you went to school for design and then later discovered coding. You fell in love with implementing rich jank-free user experiences and are passionate about squeaking out rendering performance on under powered devices.<p>Client Engineering Manager, UI Team\n<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;Discovery-UI-Manager\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;Discovery-UI-Manager</a>\nThis role will be responsible for growing, mentoring and leading a team of client engineers to build TV Everywhere applications with best-of-breed UX across current and future platforms.<p>Sr. Software Engineer I, UI Team\n<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;Discovery-Sr-UI-Engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;Discovery-Sr-UI-Engineer</a>\nLeverage Storybook to build rich UI components to be used by our React JS and React Native applications.","time":1533670158,"type":"comment"}