{"by":"starrettbw","id":17700450,"parent":17663077,"text":"Starrett Bytewise Development | Columbus, GA | Software Engineer II | Full Time | Onsite<p>Who is Starrett-Bytewise?<p>Starrett-Bytewise is a growing company that is an industry leader in designing and building laser-based, non-contact measurement equipment.  Based in Columbus, Georgia, with a worldwide presence, Starrett-Bytewise has an in-house technical team that designs the mechanical, electrical, and sensor components for our systems as well as develops all of our own software.  We value challenge in the work place and seek out those with a tinkering mindset and a passion for what they do.<p>What Are We Looking For?<p>We’re looking for a software developer with two to five years’ experience in C++&#x2F;C# that is seeking a new challenge.  You should be comfortable working with complex algorithms, be well versed in object oriented design, have a strong background in signal processing, and know the fundamentals of GUI frameworks.  You will need a B.S. in Software Engineering, Computer Science, Mathematics, Electrical Engineering, or equivalent discipline.  A Master’s Degree within one of these fields is a significant advantage.  You may need to travel every once in a while (up to 10%), including internationally.  Most importantly, you should be someone that is looking to push the boundaries and test your skills on a daily basis.<p>The job?<p>We’ve got a pretty complex source code that we want to modernize.  You would take a little time to familiarize yourself with it and how it works then start a ground-up rebuild of the code.  Rewrite, rework, cut-and-paste, slash-and-burn, we don’t care - but here’s the catch - our software is the best in our industry and you’re going to be held to a very high standard for performance, functionality, and user friendliness.  Our customers expect a lot from us and we will deliver on that.  The re-write is intended to increase our technical edge over the competition and ensure long-term product success.  Once you’re done with the re-write, you’ll begin adding new features and functionality to keep the product in its leadership position.<p>What’s in it for you?<p>- Living in beautiful Columbus, Georgia with a low cost of living<p>- Highly competitive compensation<p>- Health and disability insurance plan<p>- Profit sharing<p>- 401k with employer matching<p>- Employee stock purchase plan<p>Email: resumes.bytewise@starrett.com","time":1533581561,"type":"comment"}