{"by":"ajeezy","id":17700090,"parent":17663077,"text":"Telaria | Software Engineer | Mountain View, CA | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;telaria.com\" rel=\"nofollow\">https:&#x2F;&#x2F;telaria.com</a><p>Telaria (NYSE: TLRA), (formerly Tremor Video), is the leading independent data-driven software platform built to monetize and manage premium video inventory with the greatest speed, control, and transparency, wherever and however audiences are watching.<p>Our engineering team is a full stack organization dedicated to working hard and having fun. The Product team hands us the roadmap, and we make it happen from design to build to production to keeping our revenue-critical systems up and running. We&#x27;re close to the customers and have the reward of seeing our work being used immediately. We take pride in the reliability and scalability of our platform, as well as our pace of implementation. We are a small and efficient team building out a solution in a new space with lots of green field ahead of it. Our office is located right in downtown Mountain View (close to Caltrain).<p>We are looking for a Software Engineer (1-3 years experience) to help us build tools and enhance our platform, which, processes 5+ billion events and generates multiple TBs of data per day. Candidates should be passionate about growing as an engineer, learning different technologies, contributing to the full stack, and solving complex problems revolving around real-time decisioning and large data systems.<p>Tech: Java, Javascript, Other scripting (python&#x2F;perl&#x2F;etc.), SQL, Solr, Big Data technologies, and AWS tools (EC2, S3, RDS, Redshift, DynamoDB, EMR)<p>Some Perks:<p>* Competitive benefits and compensation (including 401k matching, etc.)<p>* Flexible work environment (and vacation policy)<p>* Great office location<p>* Weekly team lunches<p>* Awesome people to work with ;)<p>If interested, please visit and apply here: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;telaria&#x2F;jobs&#x2F;1245480\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;telaria&#x2F;jobs&#x2F;1245480</a>","time":1533579396,"type":"comment"}