{"by":"adzuci","id":17728523,"parent":17663077,"text":"MassMutual Data Science | Boston | OnSite | Full-Time\nPython, Scala, R, Hadoop, Data Engineering, Data Science, SRE<p>Interested in joining a high performing team that creates knowledge from data and builds systems that solve hard problems?<p>Learn more about us at <a href=\"https:&#x2F;&#x2F;datascience.massmutual.com&#x2F;science\" rel=\"nofollow\">https:&#x2F;&#x2F;datascience.massmutual.com&#x2F;science</a>.<p>Please apply at <a href=\"https:&#x2F;&#x2F;datascience.massmutual.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;datascience.massmutual.com&#x2F;careers</a> or email digital-hiring@massmutual.com<p>Data Scientist - MassMutual’s Advanced Analytics group is seeking exceptional, highly motivated and self-directed Data Scientists. In this role, you will perform data-driven research, problem solving, and algorithm development through the systematic application of mathematics, statistics and computer science as well as cutting edge data technologies.<p>Data Engineer - Seeking engineers with a passion for solving large data problems. Our data platform develops creative and scalable solutions to difficult technical problems. We rely on tooling such as Hadoop, Kafka, Spark, Python, and Scala.<p>Data Architect - You will be implementing large scale data solutions based on ecosystems ranging over a wide range of persistence platforms such as Vertica, Postgres, Spark and cloud-based storage layers and infrastructure.  The members of the team work with fellow engineers and enterprise stakeholders to develop and maintain data models and metadata system including data registration, dataset cataloging and associated services to support data-driven systems<p>Site Reliability Engineer - Work with our SRE team focused on scaling all aspects of our infrastructure leveraging AWS, K8S, Swarm, Jenkins, Prometheus, Go, and Python. In this role, you will help design and build out the company&#x27;s digital infrastructure, supporting customer facing web and mobile applications as well as the firm&#x27;s enterprise data platform.<p>Project Manager - Come help deliver innovative, data-driven products and enhancements aimed at transforming the insurance industry.","time":1533848908,"type":"comment"}