{"by":"jpcody","id":12406556,"parent":12405698,"text":"Senior Software Engineer | AcademicWorks | Austin, TX | Onsite (Relocation Available)<p>----<p>Solve hard problems that truly matter with a team that&#x27;s smart, experienced, and kind.<p><i>The Company:</i> A small-and-growing (45 members) company using technology to improve access to higher education<p><i>The Department:</i> A 3-member product engineering team within a 10-member engineering department<p><i>Technical Details:</i> Rails, AWS, Postgres, Elasticsearch, Cassandra, Redis, Memcached, and some internal tooling in Go<p>----<p>You find pragmatic solutions to difficult problems, work well with others, and take ownership of entire features from planning to production. Preferably, you&#x27;re proficient with some of our technical stack, and you&#x27;ll make the entire team better by being an individual contributor, a teacher, and an occasional foil.<p>We&#x27;re piling up accolades for workplace happiness and company growth. We take a lot of pride in accomplishing disproportionately big tasks, and to do that we treat engineers like professionals with clear expectations and regular feedback. Our company values are kindness and respect, engagement, and obsession with our clients&#x27; experience, and we all strive to exhibit those daily.<p>----<p>The Interview Process: You&#x27;ll talk to me (Product Engineering Manager), talk to our CTO, do some remote coding to chat code, come on-site and pair, meet the team, and meet a founder.<p>----<p>jcody@academicworks.com<p><a href=\"https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Reviews&#x2F;AcademicWorks-Reviews-E460933.htm\" rel=\"nofollow\">https:&#x2F;&#x2F;www.glassdoor.com&#x2F;Reviews&#x2F;AcademicWorks-Reviews-E460...</a><p>More details: <a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;jpcody&#x2F;f1187d6d0828d6620633f8f6a3b3d6da\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;jpcody&#x2F;f1187d6d0828d6620633f8f6a3b3d...</a>","time":1472746821,"type":"comment"}