{"by":"eli","id":12407941,"parent":12405698,"text":"Industry Dive | <a href=\"http:&#x2F;&#x2F;industrydive.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;industrydive.com&#x2F;</a> | Washington, DC | onsite | Multiple Openings<p>Industry Dive is a profitable, four-year-old digital media company. We publish business news and original analysis for 2 million executives in 12 industries. We&#x27;ve been named a &quot;best place to work&quot; in 2015 and 2016 by the Washington Business Journal.<p><pre><code>    = TECHNICAL PROJECT MANAGER =\n</code></pre>\nAs our development team grows, we need to keep improving our workflow and processes to keep us efficient. We&#x27;re looking for a project manager to help us up our game and to keep projects on track. Previous experience with agile design methodologies a plus.<p><pre><code>    = PYTHON DEVELOPER =\n</code></pre>\nWe&#x27;re looking for a fulltime developer with previous experience developing backend web systems, especially in Python&#x2F;Django. There is some flexibility here and exact job duties can be tailored for the right person. Bonus points for applicants with experience in any of the following: CSS&#x2F;HTML&#x2F;JS, SQL, native iOS&#x2F;Android development.<p><pre><code>    = DATA ENGINEER =\n</code></pre>\nWe need help extending our Airflow[0] based data pipeline that aggregates data from many sources (email, web analytics, ad server impressions, etc) and ties it together in a way that enables us to make smarter, data-driven business decisions. The ideal candidate has some experience with ETL pipelines and Data Warehousing. Experience with both relational and object databases is a plus.<p>[0] <a href=\"http:&#x2F;&#x2F;airflow.incubator.apache.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;airflow.incubator.apache.org&#x2F;</a><p>This is a new position and hasn&#x27;t yet been published on industrydive.com.<p><pre><code>    = To Apply =\n</code></pre>\nAll positions report to the CTO (that&#x27;s me!). Feel free to contact me directly with any questions: eli@industrydive.com<p>To apply, email hr@industrydive.com with a cover letter and resume.<p>Additional details at <a href=\"http:&#x2F;&#x2F;industrydive.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;industrydive.com&#x2F;jobs&#x2F;</a>","time":1472756306,"type":"comment"}