{"by":"stunder","id":12408935,"parent":12405698,"text":"Hart | Orange County, CA | ONSITE | <a href=\"https:&#x2F;&#x2F;hart.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hart.com</a><p>Hello, its Eric (eric@hart.com) from Hart.  Happy first of the month.  I come in here every month and post the jobs we are looking for.  Right now we are looking for several open positions.  We look for highly talented technical enterprise level engineers and staff to meet the requirements of our partners in the healthcare world.  We keep things very casual around the office, with our own professional chef, drinks, and snacks, your own custom workspace, insurance packages, 401K perks that can’t be touch, and I can’t even list all the perks here.  Anyways this month we are looking for the following positions.<p>SCALA Data Engineers!!! - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;mj6wpb\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;mj6wpb</a>  we can’t wait to talk to you if Scala is the game you are playing<p>Node.JS Engineer - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;3fujn5\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;3fujn5</a> We love the Node people in the community.  If you want to join a crew of your Node Brothers and Sisters to push this incredible product stack into the healthcare industry then this job is for you.<p>Product Owner (Agile) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;m6f5g1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;m6f5g1</a> I don’t own too much in my personal life but if I really wanted to own something it would be the responsibility of managing some great products.<p>Software Developer Engineer in Test (SDET) - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ld86pr\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ld86pr</a> I have to admit I hang out with these guys a bunch and beat them in video games a lot.  If you can please come here and give me some competition that would be outstanding.<p>Application Support Engineer - <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;gkdm0r\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;gkdm0r</a> if you like to be client&#x2F;customer facing and helping out our incredible clients we want to talk to you.  We need you to be the bridge between our products and the customers.","time":1472764476,"type":"comment"}