{"by":"OmarIsmail","id":12407367,"kids":[12407398],"parent":12405698,"text":"San Francisco - Streak (<a href=\"https:&#x2F;&#x2F;www.streak.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.streak.com&#x2F;careers</a>) |  Profitable and growing | Tech Leads (Backend, Mobile and Front-End) | ONSITE | H1-B Transfers welcome<p>Here are the hard problems you&#x27;ll work on here at Streak:<p>Sales Autopilot<p>We want to do for salespeople what autopilot did for pilots. We will suggest to sales professionals the actions they need to take next to close deals. They&#x27;ll instead need to monitor our &quot;autopilot&quot; system and manually override only when needed. Unlike most AI startups, we can actually build this - we have 100M+ datapoints of sales professionals manually closing deals to make the training actually possible.<p>Email Graphs<p>We&#x27;re building systems to better understand how organizations communicate with one another. Email is currently siloed into individual user inboxes, we&#x27;re building a graph database containing every email message in our users&#x27; inboxes to give them insights into how their company communicates with their customers.<p>Reverse Engineer Gmail<p>We strive for deep integration with Gmail, because that&#x27;s where our users live. Our integration has to be seamless, deep, performant, resilient and secure. It&#x27;s such a hard problem, even our competitors use our tech (InboxSDK). We&#x27;re doing it next for Inbox, Calendar, and more.<p>Outside of the hard problems you&#x27;ll also have a very large impact, not just on our organization but on our customers. We have the best of both worlds: we&#x27;re small (6 eng) so no meetings and other big company BS, but are profitable (millions in revenue) with a wide variety of customers that use Streak everyday for hours at a time.<p>Tech Stack:<p>Backend is 95% Java and 5% Go (and growing) on Google App Engine (<a href=\"https:&#x2F;&#x2F;cloudplatform.googleblog.com&#x2F;2015&#x2F;04&#x2F;Streaks-Top-6-T...\" rel=\"nofollow\">https:&#x2F;&#x2F;cloudplatform.googleblog.com&#x2F;2015&#x2F;04&#x2F;Streaks-Top-6-T...</a>).\nFront-end is React + in-house framework for handling data synchronization.\nFull automated end-to-end test coverage of all our features along with a growing set of unit tests to handle edge cases. If it&#x27;s green you can deploy with confidence.","time":1472752039,"type":"comment"}