{"by":"unatajobs","id":12406055,"parent":12405698,"text":"Unata | DevOps Engineer | Toronto, ON | ONSITE<p>What are we looking for?<p>Unata is looking for a DevOps Engineer to help automate our development and deployment processes, centralize the capture and analysis of our ever growing logs, and automate our monitoring systems hooked up to our various client deploys. You will develop and manage automation code to improve our software development practices and the health of our deployments.<p>This is an amazing opportunity for you to design our automation from the ground up, working closely with our team of developers and data scientists to ultimately build solutions that power slick mobile and web applications, personalized content services, and robust integrations with retailer data systems.<p>Who are we?<p>We are building the retail experience of the future. We work with large retailers to power their digital experiences, while personalizing each shopper’s content and offers based on their purchase history. We’re connecting the physical shopping experience with the best of the digital world.\nUnata’s digital marketing platform consists of state of the art data analysis systems, award-winning mobile and web applications, and machine learning technologies. We hold ourselves to the highest standards; our work has won awards from Apple and many industry publications.<p>Requirements, requirements, requirements<p>You have experience implementing and maintaining developer, deployment, and analysis tools.\nYou have been part of a team that built and shipped real software. You know… flappy bird clones… all that jazz.\nYou understand engineering best practices: automated testing, version control systems, documentation, continuous integration, duct tape redundancy, etc.\nYou feel at home (cd ~) in a Unix development environment.\nYou can clearly communicate complex technical concepts: “Set the Geiger Powerlantern to 3!”\nYou can demonstrate and talk about your willingness to learn new things. Like that new reactive microservice framework everyone’s been deploying on docker lately.<p>What are you waiting for?<p>Send us a note at jobs@unata.com with a copy of your resume, let us know why you’re a great fit for the position.","time":1472743893,"type":"comment"}