{"by":"burgessl27","id":12409258,"parent":12405698,"text":"Cloudreach | Edinburgh, UK| Full-Time | Onsite | DevOps roles<p>First of all, a bit about us!<p>Cloudreach is an idea that started out in a London pub. We’re now a global cloud enabler and partner with the very best cloud platforms (AWS, Azure, Salesforce). We have hubs in Europe and North America, with more certified technical staff than anyone else in the world. Cloudreach works on challenging technical projects such as data centre migrations, data analytics, and managing digital estates. This is not your average company; we keep our feet on the ground and our heads in the cloud.<p>We are looking for Dev Ops Leaders, Dev Ops Lead and Dev Ops Engineer for our amazing office in Edinburgh who have a passion for operations and are keen to further their career in a fast growing company. We subscribe to the concept of &quot;DevOps&quot;, where we use development skills in the operational environment in order to increase service quality. Typically our customers use an extensive array of technology running on either Linux or the Microsoft stack. The intent is to fix or work around the root cause of operational issues, so that they do not re-occur.<p>We are looking for:<p>For engineers, 3- 5 years ops experience and (depending on the role) at least 12 months leadership experience<p>Excellent technical knowledge with some or all of our partner solutions (Alert Logic, AWS, Microsoft Azure, Chef, BitDefender, CloudEndure and many others) and be able to present and articulate these concepts to both technical and non-technical audiences.<p>Scripting and Automation experience of Operating Systems and Services<p>Solid understanding of current and future best practices for IT operations and how to adapt these to support the delivery of cloud based Operational services at a global scale (e.g. DevOps, Bimodal, ITIL and others).<p>Our Cloudy Perks include:<p>MacBook Pro, big screen monitor and your choice of smartphone\nUnique ‘cloudy’ culture where we work hard and play hard\nUncapped holidays.....seriously.\nWorld-class technical training and career development opportunities through our Cloudy University including AWS Professional Certifications, Microsoft Certifications and more!\nFully stocked in-office kitchen and team ‘cloudy’ lunches, taking over a restaurant every Friday.There are also cool office amenities like a pool table, foosball, and Xbox on the big screen TV.\nQuarterly parties around Europe and an annual kick off event in a cool destination. Last year, it was in Spain!<p>If you would like to have a chat and hear more about the role or Cloudreach please contact me at louise.burgess@cloudreach.com","time":1472767842,"type":"comment"}