{"by":"jaegerpicker","id":12407435,"parent":12405698,"text":"Vet&#x27;s First Choice | Lead Developer | Portland, Maine | ONSITE | Full-time<p>I&#x27;m the software developer manager for this team and I&#x27;m looking to hire a lead dev. We are mostly tech agnostic in our lead positions because we believe leadership is less about tech skill set and more about leadership skills. That said here is a list of tech the team regularly uses and works on: Legacy stack: php, Java Spring, mysql, sqs, elastic search, redis, Angular \nNew app stack: Scala, node.js, kafka, Spark, mysql, redis, DynamoDB, mysql, React&#x2F;Redux, Java<p>This position is mostly aimed at the new stack but will need to interact and fix the old stack from time to time.<p>Feel free to reach out to me with questions scampbell at vetsfirstchoice . com<p>While we do regularly work remotely we do require that you are in the Portland Area and most days in the office.<p>Here is the full job description:<p>Vet&#x27;s First Choice is looking for a Lead eCommerce Developer to help build our platform of the future. We are changing the Veterinary market and are building a new platform to accelerate that process. It&#x27;s a fast paced, fun environment with huge growth potential. We are looking for an experienced technical lead developer in the eCommerce domain. We value technical innovation, clean well tested code, and the ability to scale quickly in our applications. We have many interesting challenges ahead of us in the coming years, so you should be excited and motivated by creative problem solving while maintaining technical excellence. The eCommerce team prefers developers with experience in multiple technology stacks and developers willing to choose the best tool for the job. This position will work closely with the eCommerce Manager&#x2F;Architect on large strategic efforts while also leading the rest of the team of developers in day to day issues and support.  We strongly believe in servant leadership and being agile with a large premium placed on developer happiness. You should be an opinionated, always growing developer committed to mentoring more developers. Examples of technologies we are exploring: Kafka, Event Steaming, Functional Programming, Universal Applications but we are more interested in what you are trying to learn.<p>Type of Experience we are looking for:<p>6+ years as a software developer\neCommerce and StoreFront development\nExperience with high volume public facing web applications\nComplex distributed systems communication (Queues, Event Streaming, etc..)\nCollecting detailed analytics\nDesigning technical solutions and documenting them\nLeading other talented developers \nMigrating from a Legacy system<p><a href=\"http:&#x2F;&#x2F;vetsfirstchoice.applytojob.com&#x2F;apply&#x2F;hPaUfc&#x2F;ECommerce-Lead-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;vetsfirstchoice.applytojob.com&#x2F;apply&#x2F;hPaUfc&#x2F;ECommerce...</a>","time":1472752478,"type":"comment"}