{"by":"iencheng","id":12406999,"parent":12405698,"text":"Happy Dogs NYC (happydogsnyc.com) | Django web app developer | PART-TIME 10-20 hours&#x2F;week | REMOTE OK<p>Love Django, web development, and dogs?<p>Happy Dogs NYC, a thriving multi-location dog daycare business in New York City founded by two MIT alums, is looking for a Django developer for new feature development, general code maintenance, and bug-fixing for a Django web app which is the backbone of our operations, including internal workflow, customer relationship management, social media integration, and payment processing. The app has more than 50k lines of code.<p>You will under the supervision of the original programmer of the website, who is an MIT computer science graduate who was previously a product director at Google, and you will receive a thorough handover on the project from the current programmer (who also happens to be an MIT grad). There will be regular code reviews for code style and quality.<p>Requirements:\n-- Several years of hands-on experience with Django\n-- A love of Python\n-- Class-based views, multiple inheritance, monkeypatching? -- no problem\n-- Skill with Javascript\n-- Good taste in programming\n-- Postgres and MongoDB experience (including PyMongo)\n-- Strong software development practices\n-- Experience with unit testing\n-- Unix sysops&#x2F;devops knowledge a plus\n-- Experience with celery and Redis a plus\n-- Great verbal and written communicator\n-- Strong independent problem-solving skills\n-- A knack for understanding business requirements\n-- Excellent attitude -- enjoyable to work with<p>Hours are flexible -- likely to around 10 to 20 hours a week. This will be an open-ended gig -- with the intention of working together for at least a year.<p>The position is suitable for both a seasoned Django programmer and for a more junior programmer looking to build on their existing skills and learn from code reviews. Pay will be commensurate with skill level and experience.<p>To apply, please email ien@happydogsnyc.com and include a CV and some recent code samples (ideally from a Django project) that demonstrate how you think and write in code, as well as your hourly rate.","time":1472749572,"type":"comment"}