{"by":"akashatwork","id":12407968,"parent":12405698,"text":"Bloomberg * New York City * Full Time * Onsite<p>I lead the Data Infrastructure team for Bloomberg Structured Products and we are always looking for talented engineers to join our team. Structured Products is a team of ~120 engineers and we have positions open across our team - for people looking to get involved on the finance aspect of things to people interested in just tech. Our technology stack is built using Python, C++ and JavaScript but experience with those languages is not necessary. Nor do we require any prior experience in finance but a general aptitude for finance is welcome.<p>Ongoing projects:<p>⁃ Migration to a new service-oriented architecture serving billion+ requests per day. We have access to a cluster of hundreds of very powerful Linux machines to serve data, run simulations and provide a plethora of analytics to clients both internal and external.<p>⁃ Maintaining the Bloomberg Asset Backed Security database - includes writing cashflow models for thousands of securities and ingesting data from dozens of ‘trustee’ websites.<p>⁃ UI overhaul - as we migrate to the new infrastructure we are also rewriting the entire suite of Bloomberg Functions available through the Bloomberg Terminal.<p>Why us?<p>⁃ Bloomberg is one of the best places to work if you have any interest in financial technology<p>⁃ The Asset-backed Security industry went through a radical transformation since the sub-prime crisis (highly recommend reading The Big Short). Most firms now demand clean and accurate data and there are a very few places in the world that can deliver solutions at the same scale as us.<p>⁃ The Structured Product team is a really fun place to be in. We are a bunch of people who really enjoy working with each other and we greatly value hard-work and innovation.<p>Note that I represent just one group at Bloomberg. There are tons of other opportunities available and I’m willing to help you search for the right spot in the company. Our biggest engineering offices are in New York City, Princeton and London.<p>You can search for all our job openings at <a href=\"https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;search\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;search</a><p>Direct links to job openings from the Structured Products team:<p><a href=\"https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49549\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49549</a><p><a href=\"https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49548\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49548</a><p><a href=\"https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49547\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bloomberg.com&#x2F;job&#x2F;detail&#x2F;49547</a><p>Please email me at ashah237@bloomberg.net for any further questions (put hackernews in the subject line to help me find them). But don&#x27;t send me resumes on that email - submit it using one of the job links above.","time":1472756526,"type":"comment"}