{"by":"jtheory","id":12407490,"kids":[12407957],"parent":12405698,"text":"Patients Know Best, REMOTE-only. Full-time, with occasional exceptions. Core working hours: within a few hours of GMT (current IRL span: Costa Rica to Bangalore).<p>See my other posts for more depth on work-life balance (&amp; hiring working parents = many of us), building something that improves life&#x2F;health, our culture (collaboration and good communication, not competition).<p>Superb communication skills required -- we all need to be highly articulate, clear, and at ease talking through complicated concepts with each other (skills talking with strangers: useful, but not an everyday requirement). Sometimes remote work tools are (nearly) flawless, but with some bad luck you might be explaining something complicated over a choppy connection with a punishing 3-second delay and a marching band in the background.<p>If you&#x27;re interested in PKB&#x27;s growth, funding, profitability, contracts, etc., ask -- our CEO is also active on HN. Or Google us. I&#x27;m in the CTO role.<p>We&#x27;re hiring on &amp; off -- currently we&#x27;re on hold for full-stack devs; but our lead frontend engineer is going to be motorcycling up the South American coastline in a few months, so we need to hire someone with a front-end focus.\nWe need: solid JavaScript skills and you know, the normal front-end skillset; a little behind the times because we need to support IE8+.<p>Bonus points for JSP experience (the backend is pretty solidly Java-based at present), HighCharts.  We&#x27;re in PoC stage for front ends that build on our REST API (to escape the Java-based stuff entirely).<p>Bonus points (all positions) for experience in the medical world (as an intelligent patient counts!), as well as some history building things from scratch.<p>More details (and to submit an application): <a href=\"https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.patientsknowbest.com&#x2F;careers.html</a>","time":1472752866,"type":"comment"}