{"by":"unatajobs","id":12406074,"kids":[12406101],"parent":12405698,"text":"Unata |  Data Science Engineer  |  ONSITE<p>What are we looking for?<p>Unata is looking for an engineer to help scale our platform to support millions of shoppers across multiple retail partners around the globe. You’ll work with our team of developers and data scientists to build solutions that power slick mobile and web applications, personalized content services, and robust integrations with retailer data systems.\nTLDR; we want you to help us experiment, build and iterate on our machine learning technology while being a kickass engineer.\nWho are we?<p>We are building the retail experience of the future. We work with large retailers to power their digital experiences, while personalizing each shopper’s content and offers based on their purchase history. We’re connecting the physical shopping experience with the best of the digital world.\nUnata’s digital marketing platform consists of state of the art data analysis systems, award-winning mobile and web applications, and machine learning technologies. We hold ourselves to the highest standards; our work has won awards from Apple and many industry publications.<p>Requirements, requirements, requirements<p>Solid grasp of computer science concepts: data structures, algorithms, and programming paradigms. We are very keen on implementing red-black trees here at Unata.\nExcellent understanding of machine learning systems.\nUnderstands and implements engineering best practices: automated testing, version control systems, documentation, continuous integration, duct tape redundancy, etc.\nFeels at home (cd ~) in a Unix development environment.\nCan clearly communicate complex technical concepts.\nHas built and shipped real software. You know… flappy bird clones… all that jazz.\nCan demonstrate and talk about their willingness to learn new things. Like that new reactive microservice framework everyone’s been deploying on docker lately.<p>What are you waiting for?<p>Send us a note at jobs@unata.com with a copy of your resume, let us know why you’re a great fit for the position.","time":1472743975,"type":"comment"}