{"by":"prateekj","id":12409454,"parent":12405698,"text":"Pluto AI | Palo Alto, California | Full Stack Developer | ONSITE<p>WHAT ARE WE LOOKING FOR?<p>We are looking for a full stack developer with at least 3 years of experience to join our team. This is an opportunity to spearhead the development of our water analytics platform and pioneer the overall architecture.<p>WHAT IS PLUTO?<p>We are enabling our customers to analyze and understand the real time data coming from connected devices like sensors and smart meters. Our analytics engine digs deep in to the data to uncover actionable insights. The platform provides real time alerting and a command center view of consumption trends, leakage, overallocation, conditional monitoring, and many more things. The platform has to process high volumes of real time data coming from our customers.<p>WHY US?<p>Our goal is to develop a Deep Learning platform to prevent the wastage of water, our planet&#x27;s most essential natural resource. We are looking for somebody who knows how to get things done. If we end up liking each other, this could be the beginning of a beautiful friendship!<p>WHAT DO YOU NEED TO KNOW?<p>A couple of things to note about this role: \n- Experience with a backend framework like Django \n- Experience with a frontend framework like AngularJS \n- Our stack is built using a combination of Python and Javascript, so familiarity with these languages is necessary \n- Working knowledge of databases (Postgres, MongoDB, Influx)<p>WHAT&#x27;S IN IT FOR YOU?<p>- We like solving hard problems. You will be working on cutting edge data science problems. \n- Since you will be one of the first few people in the company, you will have a tremendous impact on our strategy and culture. \n- You’ll have the opportunity to drive the architecture and design of our platform. Since this work is largely self-driven, you’ll have the opportunity to get really hands-on.<p>If you think you are up to it, feel free to ping us at founders@plutoai.com.","time":1472770409,"type":"comment"}