{"by":"Naveg","id":12409097,"parent":12405698,"text":"Alloy | San Francisco, CA and Vancouver, BC | Full-time, Onsite | <a href=\"http:&#x2F;&#x2F;alloy.ai\" rel=\"nofollow\">http:&#x2F;&#x2F;alloy.ai</a><p>Over $20 trillion worth of goods are manufactured, transported, and sold each year - the things we use, wear and eat every day. The global supply chain is one the world&#x27;s largest economic engines, but it struggles to keep up with its own complexity.<p>The manufacturers, distributors, and retailers that make up this complex network are limited by the information they posses. They struggle to track and respond to supply and demand as their product travels from production to consumer. Those who try rely on 40-year-old data standards, lots of manual Excel work, and hordes of human middleware.<p>At Alloy, we’re set to change all this. We provide the first comprehensive, low-latency view of demand and inventory across all distribution channels. Our platform connects manufacturers, suppliers, distributors, and retailers, allowing companies to track their products down to the store shelf and better respond to end-consumer demand.<p>We are early stage, well funded by leading VCs, and growing. Our small team has diverse backgrounds and experience in analytics, large-scale enterprise software, and retail and financial technology. Culture really matters to us: we value diversity in all forms and strive to foster integrity, respect, and open communication.<p>We&#x27;re committed to make enterprise software inspiring. We use Google Cloud Platform, Postgres, Redis, Python, Java and React, all wrapped in strong design.<p>== About You ==<p>You thrive in a small team where you can build technology from the ground up. You love to pick up new tech, get good at it fast and do something creative with it.<p>You don’t shy away from even the most challenging problems and are relentless in always looking for better solutions. You are self-motivated and enjoy working with others towards a common objective. Building software is the means to an end: you want to change the way an entire industry operates.<p>As an engineer at Alloy, you’ll do any or all of the following:<p>* Model parts of the supply chain and develop features that bring them together<p>* Automate the collection, parsing, and storage of huge volumes of data<p>* Design a flexible but blazing-fast analytics framework that powers instant insights<p>* Build beautiful, easy-to-use apps that our customers love to use<p>* Dive into server provisioning, deployment, automation, and monitoring<p>We would love to hear from you - send me a note at evan@alloy.ai","time":1472765774,"type":"comment"}