{"by":"iglookid","id":12406227,"kids":[12410966,12422993],"parent":12405698,"text":"Locus | Full Time | ONSITE, VISA (Bangalore, India) | <a href=\"https:&#x2F;&#x2F;locus.sh&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;locus.sh&#x2F;</a> | careers@locus.sh<p>Locus is hiring back-end and front-end devs. At Locus we have an ambitious goal of Scheduling &amp; Tracking the World transport movement. We are aware of how audacious the goal is, but we have made our initial strong footholds and have the path to move forward. Founded by a team of ex-AWS engineers, comprising of graduates from premier Indian Tech&#x2F;Science Institutes (IIT&#x2F;BITS-Pilani&#x2F;TIFR), Locus is funded and mentored by the most respected investors and ex-entrepreneurs and have product validation with actual paying customers. Engineers: We have always maintained a small, but high-caliber engineering team, and we are now looking to make a couple of additions.<p>We are tech stack agnostic. We would prefer to have a look at your GitHub repo or a mobile app that you have built, over your academic&#x2F;educational qualification. We are a founding team of engineers, and understand that good engineering is part science part art, we would like to provide you the tools for the science and the time for the art. We are expanding the team to build the next version of our true multi-tenant platform with a few thousand events happening per second.<p>While we have pizza, beer, whisky, drones, oculus rifts, raspberry PIs on the house, the biggest perk we provide you is a remarkable team. We would love to spend our most productive years, around people with great intellect and unbridled enthusiasm. In the spirit of keeping you at your productive best, we give you free fully furnished housing with internet, food &amp; laundry taken care of, and your choice of tech gear.<p>Read more about what we value and our work culture at <a href=\"https:&#x2F;&#x2F;locus.sh&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;locus.sh&#x2F;careers</a>","time":1472744792,"type":"comment"}