{"by":"goo","id":12408062,"parent":12405698,"text":"Zoomforth (<a href=\"https:&#x2F;&#x2F;zoomforth.com\" rel=\"nofollow\">https:&#x2F;&#x2F;zoomforth.com</a>) | Full Stack Engineer | San Francisco or REMOTE | Full-time<p>Hey HN readers!<p>We&#x27;re looking for a talented engineer to join us in building a communications product for salespeople, recruiters, and marketers. We have a stable and growing base of customers. We&#x27;re unlocking some real opportunity with this, and we need help.<p>We make it possible for companies to build websites that serve as resources in their conversations with people -- &quot;Squarespace for business teams&quot;.<p>For example, in our sales use case, the company may build a &quot;pricing sheet&quot; page. The salesperson can send that link out, and when their prospects arrive on the page, their activity is tracked, and we can send notifications back to the sender.<p>From an engineering perspective, examples of product challenges we wrestle with are as follows:<p>- improving the flexibility and intuitiveness of our page creation process\n- storing and serving multimedia assets on behalf of our customers (including video)\n- tracking and reporting on the behavior of our customers&#x27; page visitors\n- defining and addressing specific user personas and their permissions<p>The technology tools we use to build our site include AWS, Python (Pyramids, Celery), Backbone.js, React.js, LESS, and others.<p>For collaboration and workflow we use Vagrant, Gulp, CircleCI, Slack, Email, Asana, and other tools as needed.<p>You would be our 3rd engineer, so you would have a big effect on both the engineering culture and the product we make.<p>We are committed to making or company somewhere that supports remote employees -- if you&#x27;ve worked effectively as a remote employee (or perhaps run a small team of them), that&#x27;s a plus. Right now, only our designer is remote, and we want to build on that.<p>If this sounds exciting to you, please apply at <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;forms&#x2F;GTyISOOjTJhSoUMj1\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;forms&#x2F;GTyISOOjTJhSoUMj1</a><p>Thanks!","time":1472757238,"type":"comment"}