{"by":"jgrodziski","id":12406787,"parent":12405698,"text":"Deolan | Paris | Full-Time | System Administrator, DevOps | <a href=\"http:&#x2F;&#x2F;www.deolan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.deolan.com</a><p>Since 2007, Deolan runs a data platform dedicated to the air transport industry : flight informations, passenger data, messages. We are developing innovative solutions aiming to digitalize transport related data for airlines, airports, tour operators and every stakeholders of the travel industry.<p>Everyday we handle hundred of thousands messages: flight data and passenger informations, special meals orders worldwide. Héraklion, Cancun, New York, and even Limoges airports are typical destinations we work with 24&#x2F;7. Our team is built with more than 30 people with various profiles: IT specialists, Airline operation experts, creative graphic designers and efficient sales. They share a common passion for aircraft and our customers. The team has a clear target: digitalize air transport operations and transform the travel industry. Our values: team spirit, respect, eager to learn, understand and share key business issues. Our practices: agility and fun!<p>Your mission: join the IT team, assist our lonely system administrator to:\n- Provide, install, configure and run the hardware infrastructure\n- Contribute to maintain and improve the current infrastructure\n- Document your achievements\n- Keep an eye on innovations and new solutions\n- Provide support to our developpers on projects (needs, setup, deployments etc.)<p>What about the IT environment? Physical servers, cloud based services, with :\n- Linux\n- AWS\n- Docker\n- Salt-stack\n- Git\n- Cisco asa\n- Checkpoint\n- JIRA&#x2F;Confluence\n- Relational and document database (Mongo, EsasticSearch), and coming soon graphs\n- WebSphere MQ<p>Our offices are located near République in Paris, with dense public transport access including metro, bus, bikes, and even feet. Anyway you will be welcome! The team has a great sense of humour, our offices are luxurious and coffee never stops flowing.<p>Payroll based on experience.<p>Send us an email at jobs@deolan.com (<a href=\"http:&#x2F;&#x2F;www.deolan.com&#x2F;job-opening&#x2F;admin-system-paris.html#en\" rel=\"nofollow\">http:&#x2F;&#x2F;www.deolan.com&#x2F;job-opening&#x2F;admin-system-paris.html#en</a>). Explain us what you do, where you worked before and why you would add value to the Deolan team. Just add your résumé. We will get back to you as soon as we can.","time":1472748255,"type":"comment"}