{"by":"yoloswagins","id":12416755,"parent":12405698,"text":"Homelight | San Francisco | Onsite | fulltime | <a href=\"https:&#x2F;&#x2F;www.homelight.com&#x2F;about-us#careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.homelight.com&#x2F;about-us#careers</a> | Sr. Fullstack Developer<p>Current Interview Process: call with recruiter, engineering phone screen, onsite, team lunch, reference check, offer.<p>I applied via the link on the careers page, but if you have any questions, you can email me at eunoia.github+hnwh3@gmail.com. When you apply, make sure to mention you saw this hackernews post.<p>We&#x27;re a small team of 7 engineers. Our stack is Ruby on Rails(4), and Postgresql hosted on Heroku. The javascript is well written, and we don&#x27;t use any frameworks. We&#x27;ve got reasonable test coverage, and a very empathetic culture.<p>We&#x27;re looking to hire a head of product with marketplace experience, and entrepreneur mentality. You&#x27;ll be building a product team from the ground up.<p>The next engineer we&#x27;re looking for is a Sr. Fullstack Developer.<p>You are an experienced web developer. You take pride in your work, writing clean, maintainable code. You also prioritize and build what’s necessary to accomplish the business objectives at hand. You roll up your sleeves and do whatever is necessary to push the company forward. You have strong back-end skills, but are also comfortable with front-end work and can drive a feature from PSD to functional product.<p>You Have<p>* A GitHub account (or portfolio) that rocks<p>* Projects that you can point to that you personally (not your team) built<p>* 2+ years of Ruby-on-Rails experience<p>* 5-10 years of web development experience, ideally some of which is in a startup environment<p>* An understanding of web analytics, A&#x2F;B testing, and agile development methods<p>* An outstanding academic background; CS degree preferred<p>What You&#x27;ll Do Here<p>* We&#x27;re looking for a full stack engineer to help us build amazing products.<p>* We&#x27;ve got a full slate of interesting projects and need an exceptional engineer to help us create innovative technology that will change real estate.<p>* You&#x27;ll be working on mission critical projects, both on our internal tools and on our customer facing products, and will be able to help shape our engineering culture as we grow.<p>You Want<p>* Your work to matter - to be critically important to your team’s success<p>* To work on a small team that gets sht done but also likes to have fun<p>* To build cool technology that will transform an industry and forever change the way people buy and sell real estate","time":1472855664,"type":"comment"}