{"by":"Waleedasif322","id":12410741,"parent":12405698,"text":"Nexhealth - Nexhealth.com | So-Ho, NY | ONSITE | full-time | Backend, Dev-Ops and Frontend roles | VC funded<p>The final startup that will take care of a doctor&#x27;s appointment booking needs and pain points with huge plans for healthcare: Connect people with their doctors and become the number one name people think of when they want to connect to their doctors.<p>Hiring process: phone screen, coding assignment, in-person interview<p>Product: Web app dashboard for staff members at a clinic to manage appointments, check-ins, payments, and messages. Mobile app for patients. Automated appointment reminders, recalls, recare, and invites to get the app. Product is integrated with staff workflow &#x2F; Electronic medical record system.<p>Problem: Patients call to book appointments, forget about their appointments, overall clumsy way to communicate in 2016. Providers find it hard to manage patients and get them back into the clinic.<p>The big plan: Going all the way - build out a network of providers and make healthcare truly interoperable.<p>Demand: We&#x27;re hiring because we can&#x27;t keep up with customer demand. Investors and healthcare big-shots both see the value in what we are trying to build.<p>We&#x27;re looking for mid-level to senior engineers who want to own the product from inside out.<p>Backend: Looking to port over monolithic REST Ruby on Rails API  app into microservices. Currently looking into new languages to use especially functional languages like Scala, Haskell etc. You should have experience building out backend service API&#x27;s and writing all types of test code. Should be able to read and understand Ruby.<p>Frontend: Currently AngularJS, looking to rewrite entire frontend in your choice of technology (React.js?)<p>Dev-ops: Looking to migrate from PaaS Aptible to AWS. Should have knowledge of ECS, ELB, RDS, ElasticCache, VPC, CloudFormation, CloudSearch.<p>Extra points if you have experience with NLP, Search or Machine Learning. Also If you have deal with HL7 before.<p>contact waleed@nexhealth.com to apply.<p>Waleed CTO &amp; Co-founder","time":1472788769,"type":"comment"}