{"by":"Robin_Message","id":12412461,"parent":12405698,"text":"Firefly Learning | Developers and a Frontend and Backend Lead | London UK | ONSITE<p>Firefly Learning is an award-winning EdTech company that works to bring teachers, parents and students together, enabling greater collaboration, intuitive workflows and rich resource creation, while saving teachers time. We’re used by hundreds of leading schools globally, including 8 of the top 10 UK Independents.<p>We&#x27;re looking for strengths like:<p>◦ Skill in web development: you’ll have the skill to understand existing code and technical tradeoffs, and to help design new systems. You have a solid understanding of how web apps are built and how the whole stack from IP to React fits together. You’re aware of the state of the art of the industry, in things such as the SOLID principles, the ports and adapters pattern, and the various agile methodologies.<p>◦ Balancing conflicting priorities: we want a product that is well engineered but not over-engineered. We have existing bugs, a long feature list, and new projects we’d like to start. We have new technologies and techniques we want to make use of.<p>◦ Clear communication: you can work closely with others and help your team communicate with the wider business. You’ll be able to form strong working relationships with the rest of the technical leadership team, the product team, and delivery manager. You know how to help your team participate in practices like sprint planning, estimation, retrospectives, and squads&#x2F;cross-functional teams.<p>◦ In the lead roles, experience of coaching other developers, sharing best practice as well as either having experience of or a desire to lead a small team of developers.<p>In terms of experience, we need you to be comfortable with a web platform. Our server-side code is written in C# and our web front end has a fair bit of Javascript, so you’ll need to know one of these or be able to pick them up.<p>We work pretty generally, so experience of any of the following would be a positive: React, iOS, shell scripting, infrastructure automation, building API integrations, and databases (particularly SQL Server).<p>We offer competitive salaries dependent on experience. We’re committed to everyone’s professional development, so we offer a flexible training budget for you to spend on attending training courses or other events, as well as brown bag talks and Kaizen weeks for self-improvement and experimentation. In addition to this we offer 25 days holiday (plus bank holidays and 3 days over Christmas and New Year), 3% employer pension contributions and discounted gym membership.<p>So, if you’ve got an interest in education and a desire to learn your craft alongside others making the same journey, we want to hear from you. Drop me an e-mail (robin at fireflylearning.com) or apply on our website – <a href=\"http:&#x2F;&#x2F;fireflylearning.com&#x2F;join-our-team&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;fireflylearning.com&#x2F;join-our-team&#x2F;jobs</a>","time":1472818393,"type":"comment"}