{"by":"tijs","id":12411617,"parent":12405698,"text":"Florin - <a href=\"https:&#x2F;&#x2F;florinapp.com\" rel=\"nofollow\">https:&#x2F;&#x2F;florinapp.com</a> | Product Developer | Full-time | Amsterdam, NL | ONSITE<p>Our team is shipping an app that takes the pain out of payments. It’s called Florin and helps students share, split or pay bills based on someone&#x27;s phone number. We believe there’ll soon be a time where money transfers itself. Help our team build that world of smart money and less hassle. If you see this too, we should talk.<p>You would be responsible for building all our client applications for mobile and web. That means mostly working with Florin co-founder Bas. The job is for someone who’s into more than purely coding.<p>We’ll ask you to come up with creative solutions for both hard programming, animation as well as UX problems. You love working with Javascript, but also know how to deal with its shortcomings. You’ll occasionally need to dive into Objective-C or Java code to deal with native bridges for React Native.<p>Stack: Javascript, React.js &amp; React-native, Node, Redis<p>==Team==<p>Founders: Bas de Vries and Andre Woons. Started programming and founded their first startup in their teens<p>Designers: Coen van Hasselt, <a href=\"https:&#x2F;&#x2F;dribbble.com&#x2F;Florinapp\" rel=\"nofollow\">https:&#x2F;&#x2F;dribbble.com&#x2F;Florinapp</a><p>Engineers: You&#x27;ll be the first engineering employee beyond the founding team<p>Backed: Florin is one of the startups in the Backspace startup studio program<p>==Interview==<p>Skype call with me (Tijs from Backspace) and Andre (Florin CTO) [1 hr] &gt;&gt; In-person [1 hr] &gt;&gt; Second Interview and (paid) coding excercise &gt;&gt; Go or No Go<p>==Apply==<p>Full job description and application form here: <a href=\"https:&#x2F;&#x2F;florin.homerun.co&#x2F;product-developer&#x2F;en\" rel=\"nofollow\">https:&#x2F;&#x2F;florin.homerun.co&#x2F;product-developer&#x2F;en</a><p>– Tijs Teulings, Technologist at Backspace startup Studio, <a href=\"https:&#x2F;&#x2F;backspace.studio\" rel=\"nofollow\">https:&#x2F;&#x2F;backspace.studio</a>","time":1472803185,"type":"comment"}