{"by":"startupcvs","id":12444424,"parent":12405698,"text":"Developer (m&#x2F;f) | StartupCVs | Berlin | Fulltime, Onsite, Regular<p>As a startup for startups we operate in the center of the ecosystem. We are an international team of highly motivated people from various backgrounds. In a short period of time, we were able to win well-known startups and digital companies as our clients and established our brand in the Berlin startup scene. We are determined to grow further, our mission is to become the number one platform that connects talent with top startups. Currently we are expanding our IT team to tackle new challenges.<p>What we are looking for:<p>• Experience with Ruby, Python or PHP<p>• Experience with HTML5, CSS and JS frameworks<p>• Excitement about thoroughly building a sustainable architecture<p>• Degree in Computer Science or several years of relevant work experience<p>• Good communication skills, e.g. ability to talk about technical topics and express design decisions<p>• Motivation to join our share-knowledge culture and to add to existing knowledge<p>• Willingness to work in an agile environment<p>• Motivation for DevOps tasks is a bonus<p>Our environment:\nYou will have direct impact on the product and see your code deployed to production within days after joining. We use Rails in the Backend on Postgres and ElasticSearch, communicating via a json API to the Frontend, which is written in React and uses related frameworks such as redux and browserify. We offer a great opportunity for professional growth in a multicultural environment. While having a focused work environment the doors to other departments are always open. You will work directly with and report to the CTO.<p>Our office is located in the heart of Berlin at Hackescher Markt: central, easy to reach and ideal to go out for lunch, ice-creams or after work beers. We take care of you by offering drinks, fruits, salads and cakes. If all the food got too much, you can use a bed for power naps. We also invite you to participate in our interdisciplinary trainings, our reading club or games &#x2F; e-sports evenings.<p>If you’re interested, send your application to applications@startupcvs.com or upload your CV on <a href=\"http:&#x2F;&#x2F;www.startupcvs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.startupcvs.com</a>","time":1473263835,"type":"comment"}