{"by":"ladon86","id":6310519,"kids":[6311896],"parent":6310234,"text":"ClassDojo<p>FULLTIME in SAN FRANCISCO, CA<p>ClassDojo is used by over 15mm teachers and students to manage behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We&#x27;re an edtech startup with funding some of the biggest names in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we&#x27;re one of the fastest growing education companies of all time. We&#x27;re the only non-YC company that Paul Graham has ever invested in. We&#x27;ve built a product that makes a real difference and gets huge engagement with millions of kids, and we&#x27;re about to take it to the next level, hopefully with you on board. We have a strong team, an extremely comfortable and relaxed environment and great salary + benefits. If you&#x27;re a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------\n\n  https:&#x2F;&#x2F;classdojo.wufoo.com&#x2F;forms&#x2F;join-classdojo&#x2F;  \n\n  --------------------------    \n</code></pre>\nOr email jobs@classdojo.com. You can read about the work and environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.classdojo.com&#x2F;jobs</a><p>--------------------------<p>We&#x27;re particularly looking for:<p><pre><code>  * Frontend Engineer  \n</code></pre>\n--------------------<p>What&#x27;s the role?<p>--------------------<p>At the core of ClassDojo is a node.JSON API built on node.js which makes use of multiple services and handles hundreds of requests per second. The frontend web application talks to this API, and it&#x27;s a single page app that uses our own (soon to be open-sourced) JS framework - mojo.js - which combines the best bits of Backbone, Ember and Angular. That means great templating with powerful and efficient data-binding, but plenty of flexibility to build apps quickly. You&#x27;ll work on this and other awesome tools, and you&#x27;ll build a lot of user-facing features that go out to millions of kids around the world every day. It&#x27;s pretty rare to have impact like this, and as much freedom as we&#x27;ll give you.<p>Everyone on our team agrees that this is the most exciting phase of the company that we&#x27;ve seen, and we&#x27;re growing so quickly that we&#x27;re all very eager to meet and work with you!<p>--------------------<p>What skills are we looking for?<p>--------------------<p>* This is primarily an engineering role, rather than being design or CSS focused. We&#x27;d like you to be really strong on JavaScript fundamentals, up-to-date with modern JS engineering, and familiar with advanced DOM manipulation.\n* Having said that, some minimal design chops would be cool...\n* ...but not essential. We do have designers.\n* A good sense of product and a desire to have a creative role in designing product features is important to us.\n* You love building things well and building them quickly - like us!<p>The best way to show this off is to point to things you&#x27;ve built. We&#x27;d love to see personal projects which demonstrate the above.<p>Is this you? Apply here: <a href=\"https://classdojo.wufoo.com/forms/join-classdojo/\" rel=\"nofollow\">https:&#x2F;&#x2F;classdojo.wufoo.com&#x2F;forms&#x2F;join-classdojo&#x2F;</a>","time":1378046193,"type":"comment"}