{"by":"Bootvis","id":6310675,"kids":[6310761],"parent":6310234,"text":"Veneficus, Rotterdam, The Netherlands, No Remote<p>-----<p>Back-end Web Developer<p>We are looking for an ambitious addition to our team who would like to be involved with the development of our web tools. Within Veneficus we are increasingly developing web applications to present our analysis. Some recent examples are:<p>- VF Survey (<a href=\"http://www.vfsurvey.nl/demo/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.vfsurvey.nl&#x2F;demo&#x2F;</a>)<p>- Web2Docx (<a href=\"http://web2docx.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;web2docx.com&#x2F;</a>)<p>- World Sea Trade Mode (<a href=\"http://www.veneficus.nl/en/demos/wstm/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.veneficus.nl&#x2F;en&#x2F;demos&#x2F;wstm&#x2F;</a>)<p>In this position you will be involved with many ideas where you take on the role of web developer. The focus will be on the development of the back-end. You should estimate the feasibility of (new) ideas, and you are responsible for translating these ideas to web tools.<p>Basically, this is a job where you will be working with the latest technologies and where you will have many responsibilities as well as plenty of freedom to develop yourself.<p>Job profile<p>Required experience:<p>- Work experience as a back-end developer<p>- Experience using Python and Django<p>- Database &#x2F; SQL expertise<p>Personal qualities:<p>- Independent and able to work with accuracy<p>- Attention to details<p>- Translation of business ideas to web applications<p>- Modular and structured programming<p>Pros:<p>- Linux command line knowledge<p>- Experience in developing apps for smart phones<p>- Open source or other code for inspection<p>- Knowledge of a client side MVC framework<p>We offer<p>- Entrepreneurial and dynamic working environment<p>- Good fixed salary depending on experience<p>- Personal bonus plan<p>- Possibility of education and training<p>- Own initiative and ideas are rewarded with us<p>- Nice working atmosphere among a highly educated and young team with high ambitions<p>Interested?<p>Are you the person we are looking for? Then please send your CV, motivation letter and portfolio or project you are proud of to recruitment@veneficus.nl. Would you like to know more about Veneficus and this job, please contact Robbert Bos via telephone +31 10 40 47 333.","time":1378048509,"type":"comment"}