{"by":"sunils34","id":6310417,"kids":[6310440,6310619,6312318],"parent":6310234,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bufferapp.com</a>) - REMOTE (We&#x27;re a small distributed team of 12 people across the US, UK, Hong Kong, Taiwan, Sweden and Australia)<p>I&#x27;d love for you to come join Buffer for the fun ride. We have just under 1 million users and are on a $2m annual revenue run rate. There are some super interesting challenges ahead, as we&#x27;re just about to pass 1 million users (any day now). We are expecting even faster growth as we focus on Buffer for business.<p>We&#x27;re looking to expand our engineering team with the following open positions.<p>* Backend&#x2F;DevOps Engineer<p>* Front-end Engineer<p>Here are some key stats about our technology and scale.<p><pre><code>    - we have over 150k monthly active users.\n    - 6000+ API clients. Most popular: Feedly, IFTTT, Pocket, Instapaper\n    - we release changes several times a day\n    - we have an entirely data-driven process, with Einstein and Buffer-Metrics, our custom built a&#x2F;b testing and metrics tracking framework.\n    - Some of the tech we work with: PHP, Python, MongoDB, AWS (Elastic Beanstalk, Elasticache, SQS), Backbone.js, Grunt.js, Android, iOS.\n</code></pre>\nMore stats and stack details here: <a href=\"http://overflow.bufferapp.com/2013/08/01/scaling-buffer-in-2013/\" rel=\"nofollow\">http:&#x2F;&#x2F;overflow.bufferapp.com&#x2F;2013&#x2F;08&#x2F;01&#x2F;scaling-buffer-in-2...</a><p>We&#x27;re a small team of driven hackers and happiness heroes (our support people). Just like you, we&#x27;re excited and passionate about engineering challenges and have some interesting architecture and scaling problems we work on.<p>If you&#x27;re interested in coming on board, you will:<p><pre><code>    - work closely myself on technical architecture and Joel on product.\n    - ship to thousands of users and iterate quickly\n    - work with our metrics team to make smart changes\n    - be friendly and comfortable talking directly to customers on issues and features\n    - be a happy, positive-minded and kind person who has a great approach in dealing with others\n    - be a Buffer user \n    - be anywhere in the world, and if you&#x27;d like, you have help and support from us to move to where you want to be\n    - have experience working with another startup or building side projects before (would be awesome, it’s cool if not)\n</code></pre>\nSome aspects of Buffer culture that makes us a little different:<p><pre><code>    - we are totally transparent. We raised $450k, we currently have 1 million users and generate $160k&#x2F;mo. Ask me anything else!\n    - within the company, all salaries and equity are open and we have a formula for the distribution.\n    - we&#x27;re all very focused on self improvement - we have daily standups where we discuss our current improvements. This could be waking up earlier, starting public speaking, blogging, exercise, learning a language, etc.\n    - here&#x27;s our culture deck: http:&#x2F;&#x2F;www.slideshare.net&#x2F;bufferapp&#x2F;buffer-culture-03\n</code></pre>\nSalary: 88k-110k depending on location (living costs) and experience. (<a href=\"http://99u.com/articles/15527/the-age-of-salary-transparency\" rel=\"nofollow\">http:&#x2F;&#x2F;99u.com&#x2F;articles&#x2F;15527&#x2F;the-age-of-salary-transparency</a>)<p>Equity: 0.5-1%<p>If this sounds fun, let&#x27;s chat.  Send me a note about yourself, why you’re interested in Buffer, and any relevant links (Github profile, projects and background): \n<a href=\"http://jobs.bufferapp.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.bufferapp.com</a><p>- Sunil (CTO)\nthenexthacker@bufferapp.com","time":1378044774,"type":"comment"}