{"by":"pankajrisbood","id":6310267,"parent":6310234,"text":"Zendrive -- Full time, onsite, San Francisco, CA  ( <a href=\"http://www.zendrive.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zendrive.com</a> )<p>Face it. Driving Sucks. No one wants to be a bad driver. No one wants to drive more than necessary, especially not in traffic. No one wants to over pay for gas, insurance or a new vehicle. And everyone wants to prove they are better driver than most.<p>We&#x27;re bringing big-data to driving and we&#x27;re surfacing insights about all of these topics  to drivers in a fun and interactive way.  We&#x27;re building something new, that combines best of both quantified-self and game mechanics. It&#x27;s going to be useful, fun and rewarding. And we&#x27;ll be disrupting a couple of industries in the hundreds of Billions of dollars.<p>A small team of ex-Google and ex-Facebook product and engineering folks working on solving a problem that touches hundreds of millions of lives. We are backed by leading angel and seed investors in valley. Join us to work on a problem that everyone can understand and will make a meaningful, positive impact on the world (while building a multi-billion dollar business). Craft a beautiful product that everyone can use. Including your mom!<p>For all positions apply online at <a href=\"http://www.zendrive.com/#careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zendrive.com&#x2F;#careers</a><p>---------------\nProduct Designer&#x2F; Art Director<p>Role: \n* Define the design process and drive execution around usability, design and user research. \n* Lead our design-driven process of rapid iterations in user research, discovery and feature definition. \n* Provide creative direction and vision, all the way from branding and identity, through customer value props, down to the product flows on pixel and interaction level. \n* Contribute to high-level, strategic product direction in close collaboration with engineering.<p>Ideal Candidate:\n* Strong portfolio of product design that has been built and shipped to users, especially in mobile. \n* Proven ability to execute on visual and interaction details. \n* Ability to spec, wireframe and build UX and UI for features and interactions. \n* Experience working on projects involving Game Mechanics and&#x2F;or Data Visualization.<p>Bonus:\n* Being efficient with creating wireframes and interaction prototypes, yet also capable of diving deep to polish and conceptualize rich animations. \n* Experience working with an agile engineering team and across time zones. \n* Experience in using game mechanics and consumer psychology. \n* Experience with driving engagement and organic growth through interaction. \n* Understanding of usability and design frameworks for both iOS and Android.<p><a href=\"http://www.thesourcery.com/jobs/574\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;574</a><p>---------------<p>Senior iOS Engineer<p>Role:\n* Work with core team dedicated to create a beautiful app from the ground up with custom native user interfaces.\n* Take a leadership role, with ability to deeply influence product and design, as well as culture of young company. Build a superstar mobile hackers team.\n* Analyze, identify, and optimize performance bottlenecks and reliability.\n* Conquer challenges of using location services, and sensors while optimizing for battery.<p>Ideal Candidate:\n* Has helped build and ship at least one iOS application professionally. We&#x27;re less concerned with how many years of experience you have than with your iOS chops. \n* Is very comfortable with iOS technologies (Objective C, Cocoa, iPhone SDK - iOS 5 + 6, iOS 7) and environment. \n* A CS degree OR 4+ years mobile experience.\n* Comfortable with TDD and a paranoid about code quality.<p>Bonus:\n* Previous startup experience, ability to prototype and move fast. \n* Strong UI&#x2F;UX sense and experience implementing game mechanics and&#x2F;or dynamic infographics a plus. \n* Sound judgment for balancing scrappiness and long-term code maintainability. \n* Experience with battery optimization and location APIs.<p><a href=\"http://www.thesourcery.com/jobs/575\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;575</a><p>-----------------","time":1378042175,"type":"comment"}