{"by":"luu","id":6310343,"kids":[6312075,6310570,6311811,6312202,6311949,6311136,6310500,6311880],"parent":6310234,"text":"Google - Madison, WI. Sorry, no remote work, but Google does sponsor visas. All levels of experience welcome. We&#x27;ve recently hired an ACM fellow, as well as a new college grad.<p>Of course Google is hiring. So, why I posting this? Every time I tell someone I&#x27;m working at Google in Madison, they&#x27;re shocked that there&#x27;s an office in Madison, and I often hear people complaining about the lack of interesting technical work in Madison. There&#x27;s fun technical work in Madison, I promise.<p>I&#x27;m working on a hardware&#x2F;software co-design project that&#x27;s attacking a fundamentally hard problem, which started as a 20%-time project. There are a couple other hardware projects in the office; most hardware projects start as prototypes of crazy ideas, and go from there. The majority of people here are doing low-level systems programming, usually networking related, and a handful of people are doing data analysis (call it big data, if you like) to figure out how to optimize Google&#x27;s next generation hardware and software platforms. I&#x27;m sorry I can&#x27;t describe projects in much more detail -- Google is pretty secretive about what goes into datacenters.<p>The office is small (just under 30 people), and manages to avoid any bureaucracy you might expect from a big company. The work is interesting enough that in the five year history of the office, only one person has left (and he retired to a ranch in Nebraska). Feel free to email me (see profile) if you have any questions.<p><a href=\"https://www.google.com/about/jobs/search/#!t=jo&amp;jid=45087&amp;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;about&#x2F;jobs&#x2F;search&#x2F;#!t=jo&amp;jid=45087&amp;</a><p><a href=\"https://www.google.com/about/jobs/search/#!t=jo&amp;jid=2069001&amp;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;about&#x2F;jobs&#x2F;search&#x2F;#!t=jo&amp;jid=2069001&amp;</a><p>Edit: Interesting to see this downvoted. If you&#x27;re downvoting this, I&#x27;d be curious to know why. Because Madison is in the middle of nowhere and you don&#x27;t care about Madison? Because you don&#x27;t like big companies? Because you&#x27;re cynically trying to push your job post above this one? Because you think job postings need bullet points?","time":1378043459,"type":"comment"}