{"by":"happy_buckazoid","id":6311360,"parent":6310234,"text":"SMSgrupp, Stockholm, Sweden, Remote&#x2F;Relocate\nLead iPhone developer and Lead Android developer<p>SMSgrupp is a free tool for group communication that works on all mobile phones, regardless of model or age. It is used by hundreds of thousands of ordinary people sending millions and millions of messages. Increasingly, those message are being sent from smartphones, and your job will be to make sure that our messaging app competes with the very best. We are now rebuilding from the very start and want you in from the beginning. You will be the one who leads this effort in close collaboration with our backend engineers, operations team, and designers.<p>The main quality we’d like to see in a candidate is simply the ability to ship solid code. And enjoy doing it. If you have iPhone apps in the app store, and a proven track record of delivering quality code on tight deadlines, that counts for more than any number of impressive degrees.<p>Since it&#x27;s a lead developer we are looking for we will expect you to want to be working full time together with us in our office Stockholm.<p>We look for:\nSolid knowledge of tools and language (Objective-C, iPhone&#x2F;iPad SDK, Cocoa etc or Java, Android SDK etc respectively)\nStrong understanding of software engineering principles and object-oriented concepts.\nPride in writing simple and beautiful code.\nProduct sensibility and understanding of interaction design.\nSolid understanding of database concepts and experience with SQLite.\nUnderstanding of computer security (authentication, basic cryptography, networking principles).\nNot scared of saying “I have no idea how to do this, but I’ll learn”.\nEnglish speaking and writing skills (Swedish is a plus but not needed).\nA sense of humor and a light heart.<p>About us\nWhen the 2010 edition of the Stockholm &quot;24 Hour Business Camp&quot; started SMSgrupp was still just an idea. A simple but innovative idea: Why not use SMS, a channel that almost everyone has access to for many-to-many communication and thereby cover the need for people to communicate in a group? Now we are expanding our operations across three continents and growing quickly. Given that we five devs in the team  you will be a critical part to our operation :).<p>Our new offices are situated near the water in central Stockholm, at Götgatan just beside Slussen.<p>If this piques your interest, drop us a mail and say hi at jobs at smsgrupp dot se. We would love to hear from you!","time":1378058653,"type":"comment"}