{"by":"karlkatzke","id":6311063,"parent":6310234,"text":"Sentry Data Systems - Offices in Deerfield Beach, FL, Indianapolis, IN, or Austin, TX + REMOTE anywhere else in the US.<p>Overview: <a href=\"http://www.sentryds.com/company/employment/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sentryds.com&#x2F;company&#x2F;employment&#x2F;</a> - We process medical data for auditing and compliance. We&#x27;re an essential part of making certain medicare programs work for underserved populations who wouldn&#x27;t otherwise be able to afford the prescriptions they were given by doctors.<p>Right now, we&#x27;re working on our next generation products. The current generation has been wildly successful, and we&#x27;ll continue to improve them, but we&#x27;re expanding our offerings and our teams.<p>We offer a modified version of 20% time for developers and other people in the Technology group to work together to incubate projects that are designed to solve pain points that we know of. Many of these projects, if successful, will become formal projects and some may even be released to open-source. For now, as a company, we hack on these things as a group every Friday.<p>Specific positions:<p><i></i>Frontend Web Engineer<i></i> - Influence the visual design of our next-generation products. <a href=\"http://www.sentryds.com/wp-content/uploads/sds_frontend_webengineer.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sentryds.com&#x2F;wp-content&#x2F;uploads&#x2F;sds_frontend_webe...</a><p><i></i>QA<i></i> - Quality Assurance is a huge part of our operations and you&#x27;ll get to work with some very smart people. <a href=\"http://www.sentryds.com/wp-content/uploads/sds_qualityassurance_analyst.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sentryds.com&#x2F;wp-content&#x2F;uploads&#x2F;sds_qualityassura...</a><p><i></i>Project Management<i></i> - We&#x27;ve got several new projects in the works, and we&#x27;ve recently added project management to help oversee them. <a href=\"http://www.sentryds.com/wp-content/uploads/sds_project_manage_director.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sentryds.com&#x2F;wp-content&#x2F;uploads&#x2F;sds_project_manag...</a> (This position may not allow remote work.)<p><i></i>Programmer<i></i> - Our developer focus right now is PHP, Ruby, Javascript, Oracle SQL, and other languages as needed. There&#x27;s a bunch of different things scattered throughout the environment and a lot of opportunities to influence what directions we take in the future.<p>There are several other positions that are either administrative, business, or healthcare functions; please click through the overview link above to see them.","time":1378054322,"type":"comment"}