{"by":"martinshen","id":6311148,"parent":6310234,"text":"UpOut - SoMA San Francisco. No Remote.<p><i>Merchant Relations 3 Month Internship</i><p>UpOut is a discriminating guide to the best weird parties, underground culture and unique happenings in your city. Our mission is to help make that epic night out, perfect first date or relaxing afternoon happen. We are a small passionate team started by two best friends in their dorm room. We&#x27;ve been through Tandem&#x27;s incubator and are backed by some of Silicon Valley&#x27;s best investors.<p>What You&#x27;ll Do\nSince the early days of UpOut, we&#x27;ve worked to help the culture maestros of San Francisco, the event organizers. These awesome people put together the events and activities that define the culture of our beautiful city. As part of the Merchant Relations Team, you&#x27;ll focus on building strong lasting relationships with local merchants. You will work directly with merchants to help make their events amazing. Although your core competency will be in creating persuasive promotion campaigns, you&#x27;ll also use our vast event expertise to advise them in their event making decisions. Your core responsibilities will be:<p>- Advise event organizers. You&#x27;ll be working one on one with event organizers suggesting better event names, images and putting together promotion plans.\n - Learn and perform analysis. Use data to build better processes within the Merchant Relations team. You&#x27;ll be able to affect the tools we build, the process and more.\n - Research the event business. Read, think and write about the event industry to get insider insights into the business. Of course, you&#x27;ll also go to a ton of events.<p>You have great communication skills, attention to detail and boatloads of creativity. You&#x27;re that friend who plans for everyone else. Previous sales experience is a huge plus. You&#x27;re hungry to learn more and think that a small (but fast growing) team is the best place to do that.<p>This is a paid full time 3 month internship (2 weeks training + 10 weeks work). A full time position may be offered at the end of the internship based on performance.<p>Please apply at <a href=\"http://www.jobscore.com/jobs/upoutinc/merchant-relations-intern/dRhbrCeRmr440SeJe4e_S2\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs&#x2F;upoutinc&#x2F;merchant-relations-int...</a>","time":1378055422,"type":"comment"}