{"by":"rwincek","id":6311611,"parent":6310234,"text":"Canaan Partners (www.canaan.com) - Investment Analyst - Menlo Park CA<p>Canaan Partners is seeking an analyst who is energetic, passionate about technology, and intellectually curious to join its Menlo Park, CA Information Technology team.<p>The analyst role is a 2-3 year position that is traditionally followed by business&#x2F;graduate school or an operational role. The analyst, working directly with Canaan’s senior IT investment professionals, will have the following responsibilities:<p>•\tAssessment, analysis, and due diligence of potential investments<p>•\tEvaluation of business plans<p>•\tIdentification of new investment areas and development of investment theses<p>•\tPreparation of advisory meeting presentations<p>•\tDevelopment and management of data sets and sources<p>•\tSourcing of new deals<p>The candidate should possess:<p>•\t1-3 years work experience at a startup or other tech company. A year or two of management consulting or investment banking prior is desirable, but not necessary<p>•\tDeep knowledge of and interest in Information Technology. Our team covers a broad landscape from mobile apps and social media to enterprise SaaS, datacenter infrastructure, and hardware (and everything in between). While the firm has a Health Care team, this role is specifically for the Information Technology team<p>•\tActive network in the Bay Area startup community. Strong preference will be given to candidates who are already in the Bay Area<p>•\tA personality that is data-driven, creative, and analytical. We have a lot of unstructured, proprietary data and want to think up new ways to use it<p>•\tAn undergraduate degree in engineering, math, computer science, physical science, or related field from a top university. This is a pre-MBA position<p>•\tStrong interpersonal skills<p>•\tAbility to work in small team environment<p>•\tWillingness to articulate opinions on investment decisions<p>Company Description:\nCanaan Partners is an early stage Venture Capital firm with offices in Menlo Park, New York, Connecticut, India, and Israel. Founded in 1987, the firm is currently investing its ninth fund, Canaan IX, a $600M vehicle raised in early 2012. With $3.5B under management, the firm is committed to catalyzing the growth of innovative companies in the internet, mobile, enterprise, digital media, and health care industries. Current Canaan portfolio companies include Lending Club, Kabam, Zoosk, WibiData, The RealReal, Tremor Media (NYSE: TRMR), Skybox Imaging, Cardlytics, Prime Sense, Bharat Matrimony, and Soasta. Past successes include Virsto (acquired by VMWare), DoubleClick (acquired by Google), SuccessFactors (acquired by SAP), Acme Packet (NASDAQ: APKT), Active Network (NYSE: ACTV), ID Analytics (acquired by LifeLock), Advanced BioHealing (acquired by Shire), and SandForce (acquired by LSI) among others. For more information, please visit www.canaan.com.<p>Please reach out to rwincek [at] canaan [dot] com","time":1378062207,"type":"comment"}