{"by":"dominiek","id":6311943,"kids":[6311958],"parent":6310234,"text":"Bottlenose (<a href=\"http://bottlenose.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bottlenose.com</a>) - LA or NYC preferred. Will require frequent trips to Amsterdam (the Netherlands). Remote might be possible.<p>We are looking for Big Data Engineers, Data Hackers and Machine Learning Pragmatists. Example job description here: <a href=\"http://bottlenose.com/jobs/senior-big-data-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;bottlenose.com&#x2F;jobs&#x2F;senior-big-data-engineer</a>. But if you are hungry for challenges in the intersection of Big Data &#x2F; Machine Learning. Talk to us. Contact me at dominiek at bottlenose dot com (Recruiters NOT OK).<p>Bottlenose is headquartered in LA with a large part of the development team in Amsterdam. Technologies we use: Cassandra, Storm, Hadoop, MongoDB, Node.js.<p>Our Vision:<p>The Stream. It&#x27;s what matters now. From email to tweets, from forum postings to customer complaints, from enterprise social to automated systems monitors, the drivers for business are now in vortex of voices reflecting markets, internal morale, innovation, brand equity, product acceptance, politics and threats. Rational intend has shifted to irrational actions. Understanding the past bares no guarantee for the future. Understanding what&#x27;s actionable in streams after-the-fact is expensive. Even dangerous.<p>This new paradigm requires new tools and methods that can make sense out of the stream and understand human emotion. Bottlenose’s core technology - StreamSense -  creates a virtual mind map of everything people pay attention to. It is a new kind of database to derive powerful new insights. StreamSense gives organizations the emotional intelligence that they didn’t have before. It allows them to sense what people are feeling and to anticipate the unknown unknowns - both the good and the bad.<p>Attempts at creating machine understanding of our world like the Semantic Web and the Knowledge Graph have failed due to two fundamental flaws: 1) A model of the world is not something that should be derived from documents written by experts; 2) In order to build a ‘global brain’ you need to understand human emotion and human intend.<p>Bottlenose’s ultimate mission is to create a global artificial brain. This global consciousness is build out of a continuous stream of human conversation and attention. By analyzing these vast amounts of data and by analyzing the emotions around it, we build up a mental model of the world. We think this will give us a shot at creating an incredibly powerful Artificial General Intelligence.","time":1378066359,"type":"comment"}