{"by":"rvivek","id":6311690,"parent":6310234,"text":"Interviewstreet (<a href=\"http://www.interviewstreet.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.interviewstreet.com</a>) - Mountain View &amp; Bangalore, part of YC S2011.<p>Interviewstreet&#x27;s recruit product helps companies hire programmers using coding challenges. A ton of top technology companies like Facebook, Amazon, Adobe, Walmart-Labs, Evernote, Box, Quora and many more are our customers and it has proved to be insanely effective (saving ~50-60 hours for every developer hired)<p>We are a team of 25, well-funded by top-tier investors (YC, Khosla Ventures, Jawed Karim, SV Angel) and are growing really really fast. That statement of fast growth might sound cliched, but our revenues grew by 210% (yes!) last month and we have a ton of enterprise deals in the pipeline to keep up that momentum.<p>Meanwhile, we also launched a new product (hackerrank.com) to create a community of programmers in different domains of Computer Science - AI, ML, Image processing, security, etc. The aim is to build a place to get every problem solver in the world and add an engaging layer on the top - contests, jobs, prizes, office hours (Eg: hackerrank.com&#x2F;quora) from companies who are our customers already.<p>2 years from now you can imagine us to be in a position to have 20-30k technology companies using our recruit product and 100-150k active programmers on hackerrank making it effectively a hugely powerful platform to connect programmers with right opportunities (jobs, contests, cash prizes to solve real-world problems, learning a new domain, inventing a new technique to solve a problem and many more) in the fastest way. And when this happens, it will help ship products faster thus accelerating the pace of the world.<p>It&#x27;s a tough mission ahead but we are all geared up. Everyone is so passionate and hardworking that sometimes from an external view, you might find it hard to differentiate a founder from an employee.<p>Both the products are built by the same team and we are hiring for all the roles - PM, hacker, sales, marketing (hackerrank.com&#x2F;careers)<p>E-mail me: vivek [at] interviewstreet (or) vivek [at] hackerrank if you&#x27;d like to know more.","time":1378063311,"type":"comment"}