{"by":"hemantv","id":6312169,"parent":6310234,"text":"Optimizely - SF &#x2F; Amsterdam , CA. H1B&#x2F;Workpermit Welcome!<p>631 Howard Street ( Very near to Montgomery St. BART Station )<p>We are the fastest growing startup in valley[1]. We have tons of openings at all levels do checkout Openings. I am specifically looking for iOS Engineers in my team.<p>We are looking for good VP of Eng. Let me know if you fit the bill, I can get you introduced to our cofounder.<p>You can apply directly on job openings site [2] or send me your resume and brief introduction ( optional ) I can get you referred through internal portal.<p>Awesome Benefits<p>- Very competitive salary with equity compensation and a 401(k) \n- Free Clipper card to cover your commute and convenient bike storage \n- A shiny, new MacBook Pro or Air, a 30&quot; monitor, and any other gear you&#x27;d like \n- Full health, vision, and dental coverage for you and your dependents \n- Free gym membership to any Crunch Fitness in San Francisco \n- A fun work environment with frequent team outings, video games, and ping pong Paid holidays and unlimited vacation days. We don&#x27;t count sick days either. \n- Catered in-office lunch and dinner on weekdays and a fully stocked kitchen \n- Easily accessible office location with BART, Muni and Caltrain steps away<p>We also have friday guest program, where I can invite you to office for our weekly company wide event, that might be good place to see our progress and what cool things we are doing. Feel free to ping me for invite even if you are not looking for job.<p>my email hemant &lt;at&gt; optimizely [dot] com &#x2F; fameoflight [at] gmail &lt;dot&gt; com<p>-Hemant<p>[1] <a href=\"http://www.zdnet.com/optimizely-on-pace-to-grow-faster-than-any-other-saas-company-in-history-7000013814/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zdnet.com&#x2F;optimizely-on-pace-to-grow-faster-than-...</a>\n[2] <a href=\"https://www.optimizely.com/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.optimizely.com&#x2F;jobs</a>","time":1378069958,"type":"comment"}