{"by":"ayers","id":6314056,"parent":6310234,"text":"Who we are:\n<a href=\"http://www.intelligentreach.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.intelligentreach.com</a><p>Intelligent Reach is a market leading on-line Digital marketing agency and technology vendor.  Through direct client relationships with leading retailers such as Debenhams, House Of Fraser, Argos, Shop Direct, Carphone Warehouse, Halfords and through top media agency partnerships Intelligent Reach manages and optimises over £3bn in client revenue across Shopping Comparison, Affiliates, Marketplaces (eBay, Amazon and Play), Paid Search and Display channels. Intelligent Reach now has over 75 clients in the UK, US, Germany, France and Australia and is growing at a phenomenal rate.<p>==================================<p>Currently looking to fill two developer roles, one senior and one junior:<p>London (Victoria), UK | Full-time | Software Developer (Full stack, with main focus on the front end.<p><i>You will be joining a small(6) but highly productive development team.  This will be a high impact role building out new features and enhancements to our platform.  You will be reporting directly to the technical co founder while working alongside other developers and QA to deliver high quality work.  Some benefits of working at Intelligent Reach are;</i><p>-<i>Casual office environment</i><p>-<i>Fresh fruit</i><p>-<i>Unlimited Nespresso</i><p>-<i>Flexi time</i><p>-<i>Indoor football Fridays</i><p><i>Advantageous to have experience with SQL Server Analysis Server and MDX queries.</i><p><i>JavaScript | jQuery | HighCharts | TypeScript |\nASP MVC 4 | C# .Net 4.5 | MS SQL Server 2012| SSAS | SSIS | MS Testing Framework |\nTFS 2012</i><p>==================================<p>Applying:<p>When applying please put in the subject: Developer HN Sep 2013<p>jobs@intelligentreach.com<p>I am one of the developers you will be working with, so please feel free to contact me personally with any questions or to find out more about the role.\nsteve.ayers@intelligentreach.com","time":1378110172,"type":"comment"}