{"by":"lamplightr","id":6316832,"kids":[6323013],"parent":6310234,"text":"Toronto - Uken Games Software Developer (full time)<p>Uken is looking for talented software engineers to become members of our core development team.<p>You&#x27;d be working on meaningful things like:<p>- creating performant, cross-platform games;<p>- building game features that are deployed weekly to our millions of players;<p>- writing beautiful, maintainable code with extensive test coverage.<p>Your background should include:<p>- proven software engineering skills;<p>- excellent understanding of web architecture;<p>- the ability to communicate clearly;<p>- an appetite to learn, grow, and take on increasingly more responsibility;<p>- a strong desire to build something that people really want.<p>It&#x27;d be a big plus if you have:<p>- experience developing games;<p>- experience building applications for mobile platforms;<p>- contributed to an open source project (include your github profile);<p>- experience with the technologies we use: ruby on rails, objective-c, javascript, nginx, mysql, linux.\nWe believe in a fun &amp; meaningful work environment:<p>- you&#x27;ll be equipped with a MacBook Pro&#x2F;Air, 27&quot; monitors, iOS&#x2F;Android device;<p>- stock options and competitive salaries;<p>- full health, dental, vision coverage;<p>- snacked-filled kitchen and booster juice breaks;<p>- catered breakfast, lunch, and dinner;<p>- convenient location downtown Toronto<p>About Us<p>Uken is one of the only true cross platform gaming companies around. We build fun social and mobile games that make people stare, smile, jump, and feel awesome inside. We have a quirky nerdy culture that fosters creativity, collaboration, quality ideas, and a data driven mindset. We believe in moving quickly and improving constantly and that mantra is reflected in the weekly updates we make to our games and internal technologies. We have an appetite for pushing technical boundaries and we’ve done exactly that with HTML5. We work on products that are used by millions of people everywhere and we’re just getting started.","time":1378151917,"type":"comment"}