{"by":"jballanc","id":6318008,"parent":6310234,"text":"Burnside Digital (<a href=\"http://www.burnsidedigital.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.burnsidedigital.com&#x2F;</a>) -- Portland, OR or REMOTE (anywhere in the world)<p>We&#x27;re a consulting shop focused mostly on Ruby, Rails, and Mobile development. Currently, we&#x27;re hiring for a number of different positions. Feel free to email jobs@burnsidedigital.com and get in touch!<p>---<p>* Front-End Developer<p><pre><code>    - Translate visual designs, user experience flows and content into functional and engaging interfaces.\n    - Produce standards-compliant code while adhering to best practices in order to create efficient code from a structure, performance, scalability, SEO and design standpoint.\n    - Approach each project as an opportunity to improve the work designed, not just simply execute it.\n    - Act as a resource to the producers during scoping and scheduling of projects.\n    - Contribute to quality assurance testing including design and functionality bug tracking and resolution, browser&#x2F;operating system testing and accessibility testing.\n    - Stay connected and engaged in the digital community to expose new technologies to the rest of the agency.\n    - Always choose the right way over the easy way.\n    - 3+ years experience as a front-end developer\n    - Excellent HTML&#x2F;CSS, JavaScript skills\n    - Experience with JavaScript frameworks such as jQuery, Angular.JS, Backbone\n    - Experience integrating front-end code with back-end technologies, especially Ruby on Rails\n    - Experience with responsive design and mobile Web site development\n    - Ability to develop pixel perfect implementations of Photoshop comps\n    - Ability to resolve cross-browser compatibility issues\n    - Experience working with version control systems (Git&#x2F;Subversion)\n    - An eye for elegant UI and commitment to retaining the design integrity of each project\n    - Excellent English verbal communication for daily scrum\n</code></pre>\n* UI&#x2F;UX<p><pre><code>    - Drive User Interface and User Experience design across a variety of Web and mobile products\n    - Create an intuitive and cohesive look, feel, and overall user experience for our products\n    - Continuously innovate and revamp our products to keep us at the top of the market\n    - First and foremost, an excellent eye for design - you should know great Web UI when you see it, and be able to explain why it&#x27;s great (even if you didn&#x27;t create it!)\n    - Photoshop expertise (and in your other favorite design tools) and be fluent in wireframing to create a quick proof of concept or detailed visual treatment for complex tools\n    - Working knowledge of HTML&#x2F;CSS (bonus if you can cut up your own comps)\n    - Self-motivation to jump in quickly without a lot of direction and learn by asking the right questions\n    - Finally, a solid portfolio of Web application design - we want to see that you&#x27;ve built great Web interfaces, not just great Web sites\n</code></pre>\n* iOS Developer<p><pre><code>    - Prior knowledge of Objective C, and Mac development or iOS development\n    - Objective-C based projects you&#x27;ve worked on that you can share with us (do not need to be in an app store)\n    - Prior work experience as a software engineer\n    - Understanding of scalability, systems engineering, and algorithms\n    - Experience building apps against a REST api\n    - Great product sense and design sense\n    - Knowledge of the following iOS frameworks: Core Data, Core Graphics, Core Animation\n    - Experience with Web development, ability to work on backend development as well\n    - Experience working on large-scale or popular iOS apps\n    - Understanding of memory management, C&#x2F;C++ development\n    - Excellent English verbal communication for daily scrum\n</code></pre>\n* Android Developer<p><pre><code>    - Strong experience with Android development\n    - Successful released apps in the Android Market (please include names)\n    - Good understanding of Java and best programming practices for Java environments\n    - Prior work experience as a software engineer\n    - Understanding of scalability, systems engineering, and algorithms\n    - Experience building apps against a REST API\n    - Great product sense and design sense\n    - Experience building apps in the general reading space, such as eBooks, news, and PDF apps\n    - Experience with Web development, ability to work on backend development as well\n    - Experience working on large-scale or popular Android apps\n    - Excellent English verbal communication for daily scrum\n</code></pre>\n* Ruby on Rails Developer<p><pre><code>    - 5+ years Web development experience\n    - Experience designing and building back-end solutions using Ruby on Rails, or Node.js (Most of our full-stack apps are Rails)\n    - Practical understanding of HTML5 and CSS3.\n    - Experience implementing designs in standards compliant HTML &amp; CSS with thought given to accessibility and SEO.\n    - Experience with test driven development in JavaScript, RoR.\n    - Solid understanding of cross-browser&#x2F;platform issues and solutions.\n    - Experience using JS Frameworks&#x2F;Libraries (jQuery, Bootstrap.js, Backbone.js, Underscore.js).\n    - Passion for good design and usability on the Web.\n    - Experience building responsive Web sites.\n    - Unix admin skills and hosting experience\n    - Excellent English verbal communication for daily scrum</code></pre>","time":1378168016,"type":"comment"}