{"by":"royka118","id":6320775,"parent":6310234,"text":"CloudfindHQ a start up based in Bath, SouthWest UK<p><a href=\"http://cloudfindhq.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;cloudfindhq.com&#x2F;</a><p>Looking for Django&#x2F;Python&#x2F;Web developers\nAs well as anyone with salesforce and machine learning experience.<p>----\nCurrently a small team, just got some major funding and looking to expand.<p>Doing exciting stuff with natural language processing. To change the way people use the cloud<p>---\nDescription from job advert<p>As a key member of our growing team, you will be critical to the success of our company, working closely with the two founders, who have developed the beta.<p>Your role will involve technical architecture, software design, development (frontend, web app and data analysis), automated testing, and deployment.<p>Current Stack: Python, Django, JavaScript, PostgreSQL, Linux and EC2.  We develop on Mac with vim&#x2F;PyCharm, Git, and Linux VMs (and of course you can choose your own IDE).<p>Product: The backend integrates with REST APIs for cloud storage, applying advanced algorithms to determine relevant tags that make sense to our users.   Our UI uses responsive design for HTML5 browsers and we will expand to mobile apps and HTML5-centric desktop apps.<p>You will be involved in choosing the best available technologies as required, possibly including Redis, Celery, RabbitMQ, WebSockets, Sass&#x2F;Less, JavaScript frameworks, and CoffeeScript.<p>We’re also interested in developers with experience of the Salesforce Force.com platform, including Apex&#x2F;Visualforce as well as off-platform integration via REST&#x2F;SOAP APIs.  We don’t require Python experience if you fit this profile, as long as you are keen to learn Python.<p>One unique aspect of this role is the option to move into advanced algorithm development, working with specialist developers and our mathematician&#x2F;CEO.  Our incremental analysis backend uses algorithms such as natural language processing, machine learning, etc to improve our auto-tagging performance, while also staying CPU and I&#x2F;O efficient so that new files are indexed ASAP.  (However, we are also interested in pure web app developers!)<p>This is a chance to create a world-changing web app with cutting edge technologies, without moving to Silicon Valley.","time":1378214703,"type":"comment"}