{"by":"osterwood","id":6320941,"parent":6310234,"text":"Carnegie Robotics -- Pittsburgh, PA -- Local -- Full Time -- US persons only<p>We are a 3 year-old spin-out of Carnegie Mellon and have 25 employees. Most employees are seasoned hardware and software engineers and we push hard. Some of our work is related to landmine&#x2F;IED detection robots, other work is related to smart sensors (cameras, lasers and various combinations). We have both research projects in a variety of robotic sensor areas as well as production efforts underway.<p>One of our sensors was recently selected to be the sensor head for the upcoming DARPA Robotics Challenge (<a href=\"http://spectrum.ieee.org/automaton/robotics/humanoids/darpa-unveils-atlas-drc-robot\" rel=\"nofollow\">http:&#x2F;&#x2F;spectrum.ieee.org&#x2F;automaton&#x2F;robotics&#x2F;humanoids&#x2F;darpa-...</a>)<p>We are hiring for the following roles, each includes a brief description of the work you would be doing:<p><i></i> Junior Mechanical Engineer <i></i>\n- Mentored by our senior mechanical engineers\n- Lots of CAD work (SolidWorks) and designing everything from rugged housings to drivetrains to test fixtures.  \n- Lots of 3 axis and 5 axis machined part design.  Some weldment and sheet metal parts design.\n- Assist with testing of mechanical components<p><i></i> Embedded Software (junior or senior) <i></i>\n- Work on low level control loops for hardware\n- Perception &amp; planning logic\n- We have software on everything from Atmel microcontrollers to Atom based computers to rugged i7 computers to GPUs to FPGAs<p><i></i> FPGA Programmer <i></i>\n- Accelerate our smart sensor development efforts\n- Bring new stereo and computer vision algorithms to FPGAs inside our existing and upcoming products<p><i></i> System Electrical Engineer <i></i>\n- Design control, data, &amp; power infrastructure inside our large payloads and platforms\n- Design test rigs and breadboards for products under development and for production acceptance testing<p>Please contact my username @carnegierobotics.com","time":1378216543,"type":"comment"}