{"by":"manndog","id":6325061,"parent":6310234,"text":"Boston, MA - Cognii - NLP Research Engineer<p>Want to build the &quot;Siri for Education?&quot; Cognii is an ed-tech startup that is on a mission to transform the education with the help of artificial intelligence technologies. Based in Boston as part of LearnLaunchX accelerator and started by Vlingo&#x2F;Nuance alumni, we are seeking very bright and talented research engineers to advance our natural language processing technology for educational assessments. You will have the opportunity to work with the experienced team towards developing compelling products and services for the growing customer demand. Some of the responsibilities include:<p>• Design and implement algorithms for educational assessments<p>• Data preprocessing and analysis for model building<p>• Write different scripts and tools to measure the performances of algorithms<p>• QA and maintenance of the system<p>• Contribute to technical documentation of data analysis systems, solutions and results<p>You should have experience and background in following areas with a strong commitment to developing practical applications<p>• natural language understanding<p>• machine learning<p>• syntactic and semantic analysis<p>• textual entailment and assessment<p>• large scale data modeling<p>• information extraction and filtering<p>• educational technology experience is a plus<p>If you feel that writing programs to process a few words long input is boring and want the challenge of processing a few sentences long input, then Cognii would love to talk to you! As part of the early team, you will get a hands on experience in a startup with significant equity based compensation.\nDesired Skills &amp; Experience<p>• MS or PhD in computer science or related discipline<p>• Strong background in statistical modeling, NLP and machine learning<p>• Extensive experience programming in C&#x2F;C++, Java<p>• Proficiency with SQL, Ruby, Python, Octave, Shell scripting, Git, AWS EC2<p>• Experience in analyzing data using statistical&#x2F;psychometric techniques<p>• Demonstrate a willingness to learn and apply a wide range of technologies<p>• Strong written and verbal communication skills<p>Experience with scalable web app development and deployment is a plus<p>• RESTful API design<p>• Server design and configuration<p>Please send your application to jobs@cognii.com with the subject &quot;[HN] - Your Name&quot;","time":1378259044,"type":"comment"}