{"by":"andrewgioia","id":6355597,"parent":6310234,"text":"TeachBoost (Brooklyn, NY) - <a href=\"http://teachboost.com\" rel=\"nofollow\">http:&#x2F;&#x2F;teachboost.com</a> - Local preferred, remote negotiable<p>We&#x27;re a growing education technology startup in NYC looking for a full time developer. We need someone (preferably a few years experience but we&#x27;re open to all backgrounds) who can develop new features and small projects, handle bug fixes, and work with and learn from our lead programmer. Right now we need help with front end development, mysql&#x2F;database tuning, and back end&#x2F;application development--if you can handle any two we&#x27;d love to meet you!<p>Because we&#x27;re in education and love working with schools, teachers, and principals, it&#x27;s important that you have a passion for it as well or are comfortable working with schools and institutional users (and going heads up against large institutional competitors).<p>There&#x27;s 5 of us right now spanning dev, sales, support, and ops: 3 in NYC, 1 in Philly, and 1 in Seattle. We&#x27;re open to a remote developer but have a preference for being NYC or Brooklyn-based. We&#x27;re early stage and bootstrapped and you&#x27;ll have the opportunity to not only help make better teachers but get meaningful equity, own projects from the beginning, work in a casual environment with a small group of friendly people, and help build a company.<p>A little bit about us, you, and what you&#x27;d be doing:<p>* We&#x27;re a web-based app with a stack built on: PHP, MySQL, javascript, mongodb, nginx; our frameworks include jQuery, CodeIgniter, and Trunk<p>* Ideally you have 1+ years experience working on web apps or startup experience, know how to use mercurial&#x2F;version control, and have demonstrated knowledge of HTML, CSS, javascript, and modern standards-compliance<p>* You should learn new languages and technologies quickly, be innovative, enjoy challenges, and have a great work ethic<p>* Projects will include new feature development, bug fixes, cross-compatibility testing, iPad and tablet optimization, database optimization and load balancing, and larger independent projects you&#x27;d like to work on and dream up<p>Drop us a line at jobs@teachboost.com!","time":1378755049,"type":"comment"}