{"by":"ILIKEPONIES","id":9127391,"parent":9127232,"text":"————— underdog.io ——— Soho, NYC ——— <a href=\"https://www.underdog.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.underdog.io</a> —————<p>We’re (<a href=\"https://www.underdog.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.underdog.io</a>) looking to make our first hire, a Lead Software Engineer, in New York City.<p>Today, we&#x27;re a curated two-sided marketplace for talent. We help growing startups hire amazing people across all verticals at a fraction of the cost of traditional recruiting firms. We started underdog.io because we experienced the pain of hiring first-hand, having worked at top startups in NYC.<p>We&#x27;re currently live in NYC, but we&#x27;ve had serious requests to open in 10 other cities. While the plan is to scale the recruiting piece quickly, the bigger vision is not as focused on recruiting. We&#x27;re moving towards building a defensible network between companies while building candidate-facing tools.<p>In the interest of full transparency, it&#x27;s a big job with lots of positives and negatives.<p>The Good:<p>• Traction (<a href=\"https://medium.com/@joshuagoldstein/our-first-four-months-building-underdog-io-904dd9831644\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@joshuagoldstein&#x2F;our-first-four-months-bu...</a>) after a few months.<p>• Proven business model - we&#x27;re making significant money every month. In fact, we&#x27;re making enough to pay market rate, and we haven&#x27;t raised money yet.<p>• Full technical autonomy. We&#x27;ve built our internal CMS and tools with Python&#x2F;Flask, Node.js, PostgreSQL, Elastic Search, S3, etc. but you&#x27;re in charge of choosing the technologies going forward.<p>• Work out of Founder Collective&#x27;s (a well-known VC) space in SoHo.<p>The Bad:<p>• Less structure and certainty than a funded startup.<p>• Only full-time developer until we build an engineering team.<p>Email chris@underdog.io to apply.<p>Sorry, we can&#x27;t sponsor visa candidates.<p>Keywords: New York, NYC, Developer, Dev, Python, Flask, Node.js, PostgreSQL, Elastic Search, S3, <a href=\"https://www.underdog.io/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.underdog.io&#x2F;</a>","time":1425224223,"type":"comment"}