{"by":"koz1000","id":9127628,"parent":9127232,"text":"AMETEK Vehicle Instrumentation Systems (Grand Junction, CO, USA or West Chicago, IL, USA) (<a href=\"http://ametek.com/Careers/home.aspx\" rel=\"nofollow\">http:&#x2F;&#x2F;ametek.com&#x2F;Careers&#x2F;home.aspx</a>)<p>We are a world leader in the design and manufacture of precision instrumentation, dashboard displays, industrial&#x2F;commercial controls and display systems.  This position is in Grand Junction, CO, but we will also consider candidates in the Chicago area who prefer to work in our West Chicago, IL office.<p>You will help to establish effective graphic design processes to develop graphic tools to simulate our\nproducts and to help improve design quality. You will also provide support for existing product line software platforms.<p>ESSENTIAL DUTIES AND RESPONSIBILITIES include the following:<p>• Create graphical user interfaces on multiple OS environments for all our existing and future controller products\n• Port Linux distributions for new product platforms as needed\n• Create instructions for graphical user interface and document programming tasks\n• Work independently with minimum supervision. Participate in hardware&#x2F;software design reviews<p>Position Requirements<p>• Bachelor’s Degree in Electrical or Electronics or Computer Science Engineering or equivalent. Masters a plus.\n• A minimum of 3+ years of graphical user interface design experience\n• Experience in Embedded operating systems-- Linux, Android, kernel level experience a plus.\n• Experience in Windows programming\n• Experienced in C&#x2F;C++ programming\n• Experience with HMI tools required, such as VAPS XT, QT, Java, Altia, etc. VAPS XT is a big plus.\n• Experienced with file system and compressed image conversion.\n• Knowledge of segment LED, LCD, and touch screen technology.\n• Experienced in software for embedded systems, Freescale MPC, iMX6 and NXP 1788 a plus\n• Excellent at documenting design, test and measurement results.\n• Experience with a variety of Engineering tools &amp; Office tools needed in an Engineering Product Development environment\n• Experience with source code version control &#x2F; sharing systems\n• Excellent communication skills, both oral and written<p>If you are interested, mail me at {Louis.Koziarz @ ametek.com}","time":1425226944,"type":"comment"}