{"by":"TheTaO","id":9127411,"parent":9127232,"text":"They say if a butterfly flaps in Tibet, it changes the wind in Seattle. We say THAT&#x27;S TOO LONG TO WAIT. And that&#x27;s why we go out and buy a fan, so we don&#x27;t have to wait on some stupid butterfly to wake up and flap. We alter the wind IMMEDIATELY. BECAUSE THAT&#x27;S THE SORT OF PEOPLE WE ARE!!!<p>Are you like us? Do you enjoy working on challenging problems that directly impact and empower customers at a massive scale? Are you interested in innovating and engineering services and website platforms that power our business operations? Are you sick to death of empowering some no-good butterfly? DO YOU WANT TO STICK YOUR HEAD OUT OF THE WINDOW AND SCREAM &quot;I&#x27;M PASSIONATE ABOUT FRONT END AND BACK END DEVELOPMENT AND I&#x27;M NOT GOING TO TAKE IT ANY MORE&quot;?!?!? If so, maybe this is your kinda place, yeah? Yeah. YEAH. YEAH.<p>In this job, you’ll learn: that Mr. Tibetan Butterfly isn&#x27;t so bad, really. He&#x27;s just a butterfly trying to get by in the world. In fact, you two would really get along. Maybe you should go get a few drinks together some weeknight. Watch the game. You know, talk it out.<p>Intangible benefits: A chance to build great software for customers. Have you ever touched software? Huh? If you said yes, you&#x27;re WRONG. You touched the device on which the software is stored. Just like a story. Or a poem. Or song. Or your memories of childhood.<p>Potential hazards: If you start talking about poems and songs and your memories of childhood too much, someone&#x27;s gonna punch you in the arm. So just be warned.<p>If Woot were a superhero team, you’d be: yeah, funny thing. There aren&#x27;t yet a lot of superheroes who got their powers after being bitten by a mobile app. But the moment a hero like that shows up? That&#x27;ll be you. That&#x27;ll be you all the way.<p>Worst part of the job: when the butterfly shows up drunk and starts ranting about how people don&#x27;t take him seriously as a weather controlling device. He&#x27;ll try to convince you that HAARP is just twenty billion butterflies strapped to a board. Just smile and nod. Smile and nod.<p>Make sure you bring: a custom printed purple shirt that reads &quot;I got tricked into wearing this by the guy who writes the job descriptions.&quot; Wear it. Show it off to everyone. They&#x27;ll totally be checking for it too. snicker<p>Basic Qualifications:<p>•Bachelor’s Degree in Computer Science or related field<p>•3+ years professional experience in software development<p>•Strong understanding of computer science fundamentals, including object-oriented design, data structures, algorithm design, problem solving, and complexity analysis<p>•Proficiency in, at least, one object oriented language such as C#, C++ or Java<p>•Solid knowledge of website fundamentals such as Javascript, HTML, XML, and CSS<p>Preferred Qualifications:\n•Experience crafting automated unit, integration, functional, and regression tests<p>•Experience developing RESTful APIs with ASP.NET MVC<p>•Experience refactoring code and evolving architectures<p>•Experience with distributed computing and enterprise-wide systems<p>•Knowledge of professional software engineering practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations<p>•Experience in communicating with users, other technical teams, and management to collect requirements, describe software product features, and technical designs<p>Tl;dr: Woot is looking for full-stak developers in Seattle.\nPM me if you are interested.","time":1425224520,"type":"comment"}