{"by":"diafygi","id":9127721,"kids":[9129655,9130300],"parent":9127232,"text":"Javascript Developer | UtilityAPI.com | Oakland, CA | daniel@utilityapi.com | Solar job<p>==Description==<p>We are a white-label SaaS that is used by solar and energy efficiency companies to collect their customer&#x27;s utility bill and usage data automatically. You will be in charge of writing tools, scripts, and libraries that collect utility data from utilities. Often these utility data formats are complex and unique to each utility (pdf bills, xml data, csv data, etc.), so you will need to be very clever in collecting and parsing a huge variety of formats. Also, these scripts can break unexpectedly when utilities change their interfaces, so being able to update them quickly is important. You will be working in our office at the SfunCube in downtown Oakland. Our current codebase is well organized, documented, and tested.<p>==Experience Required==<p>No years of experience, education, or certification requirements, but you do need to be able to convince me that you know and have experience with:<p>* Javascript (not JQuery, vanilla javascript)<p>* Regular Expressions (we use them heavily)<p>* Python (basic knowledge)<p>* PGP (basic usage)<p>* Other (side projects, hackathons, hobbies, stuff you do for fun)<p>==Compensation==<p>$100k-$120k depending on experience.<p>==How To Apply==<p>Email me a cover letter and a PGP-encrypted pdf resume. Please include links to your github, bitbucket, or personal side project website (for reference, mine is daylightpirates.org).<p>==For Solar Skeptics==<p>In the last few years, the solar industry reached &quot;grid parity&quot;, which means that the unsubsidized installed cost is now cheaper than buying power from the grid. That&#x27;s why this industry is the fastest growing industry in the country. This isn&#x27;t some subsidy-dependent industry anymore. We work hard and we make real money (while conveniently also saving the planet).","time":1425228245,"type":"comment"}