{"by":"jjarmoc","id":9127813,"kids":[9162147,9128765],"parent":9127232,"text":".................................................................................................................<p>MATASANO SECURITY - Chicago. New York City. Sunnyvale.<p>Application Security Consultant<p>Full-Time or Internship, work visa sponsorship available<p>..............*________________________________________________________<p><pre><code>   &lt;Mission Impossible theme plays&gt;\n</code></pre>\nThis thread will, no doubt, be dominated by posts with laundry lists of requirements.  Many employers will introduce themselves by describing what they want from you.  At Matasano, we&#x27;re a little different.  We like to start by telling you about us.  This month, I want to try to do that by drawing analogy to Mission Impossible.<p>What made the original show so great is exactly what was lost in the &#x27;Tom Cruise takes on the world&#x27; reboot. The original 1960&#x27;s and 70&#x27;s Mission Impossible was defined primarily by a team working together against all odds to achieve their objective.  It acknowledged that what they were doing was improbable, and more so for a solo James Bond or Tom Cruise character. As a team though, each character an expert in their particular focus area, the incredible became credible -- the impossible, possible.<p>Working at Matasano is a bit like working for the Impossible Missions Force (IMF).  No, we&#x27;re not taking out thinly veiled cold war era Soviet stand in villains, preventing the rise of the third reich, or being tasked with gathering evidence against criminals &quot;outside the reach of conventional law enforcement.&quot;  But in many cases, we&#x27;re given tight timelines and tasked with difficult objectives.  To the uninitiated, what we do is often seen as impossible, but _together_ we do it every day.<p>Imagine you (and your team) have a month to circumvent a real world cryptographic system designed and sold for Fortune 500 companies to protect their most sensitive intellectual property.  Maybe you&#x27;re given a week to investigate and undercover flaws in a brand new Ruby on Rails application.  You might find yourself facing a never-before-seen client&#x2F;server application, implementing a proprietary binary protocol, and having to figure it out and attack it.  You could end up drawing on binary reverse engineer skills, or reviewing Java code.  But whatever the &#x27;mission&#x27;, you won&#x27;t be alone.  You&#x27;ll be part of a team of experts, each bringing their own skill set to the team.<p>We don&#x27;t have very much call for demolitions experts, special effects makeup artists, or champion weightlifters.  Like the IMF, we&#x27;re looking for people with diverse backgrounds who each bring something unique to the team. There&#x27;s little in computing that isn&#x27;t useful for an Application Security Consultant.  We need Reverse Engineers. Developers of all backgrounds, Cryptographers, Electrical Engineers, you name it.  We&#x27;re as likely to hire a Mathematics PHD as a college drop out.  Many of our best employees have little formal information technology background.  In short, we come from a variety of backgrounds, but share one common trait -- We&#x27;re curious about nearly everything, and have a wide base of knowledge, but have achieved mastery over one (or more) disciplines.  These are the sorts of people the IMF built their team from, and they&#x27;re the sort of people who we&#x27;re looking for at Matasano.<p>Your mission, should you choose to accept it, is to visit www.matasano.com&#x2F;careers to learn more and contact us.  In the enclosed dossier, you&#x27;ll find links to www.cryptopals.com and www.microcorruption.com which may be of interest.  Further intelligence is available at the chargen.matasano.com blog, and you can always contact careers@matasano.com with any remaining questions.  As always, should any member of your team be caught or killed, the Secretary will disavow all knowledge of your actions.<p>This isn&#x27;t Mission Difficult, it&#x27;s Mission Impossible.  Difficult should be a walk in the park for you.<p>This tape will self destruct in five seconds.  Good luck.<p>________________________________________________________________--(BOOM)","time":1425229421,"type":"comment"}