{"by":"whichdan","id":9127835,"parent":9127232,"text":"Society of Grownups - <a href=\"https://www.societyofgrownups.com/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.societyofgrownups.com&#x2F;careers</a> - Boston, MA (Washington Square, Brookline)<p>As a Senior Software Engineer, you’ll be a key member of our team by being an advocate for unit and integration testing as we build out brand new financial education software from the ground up.<p>We’re a small team of talented developers looking for someone with a history of shipping scalable production-ready code in a highly collaborative environment. Our entire team comes from different backgrounds with different levels of experience, and we’re looking for a friendly engineer who can focus on helping us become better testers and developers. In that capacity, you’ll also work closely with our QA Lead to write integration tests, while keeping a keen eye on the user experience of our platform.<p>As our testing infrastructure becomes more robust, you’ll shift into writing isomorphic Javascript applications in Node.js and Ember. We’re a flat team with a high level of autonomy and personal responsibility, so the code you write will almost always be the direct result of an idea that we came up with -- together. You’ll have a rare opportunity to take ownership of the software you develop, and rely on your instincts and intuition to deliver a world-class experience to our grownups.<p>What you’ll do:<p>- Ensure that we’re using the best tools for unit and integration testing<p>- Help each developer figure out a personal workflow for testing<p>- Author code using Javascript and Ruby, while occasionally pair programming<p>What we’re looking for:<p>- Significant experience with unit testing and integration testing<p>- Strong knowledge of Javascript, SQL, and atleast one other programming language<p>- Experience with, or a desire to, mentor other developers<p>We offer very competitive compensation, a fantastic benefits package, flexible hours + WFH, and a level of individual trust, respect, and autonomy rarely found in most engineering teams.<p>Interested? Send us any questions, or a <i>brief</i> cover letter + resume to careers@societyofgrownups.com","time":1425229646,"type":"comment"}