{"by":"tparikh","id":9128448,"parent":9127232,"text":"Location: Almaden CA, Austin TX, Dublin OH, Littleton MA, New York NY, Pittsburgh PA, Rochester MA, Raleigh MC, Yorktown Heights NY<p><a href=\"http://www.ibm.com/watsonjobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ibm.com&#x2F;watsonjobs</a><p>Experience a world-class internship program! You’ll work on cutting-edge cognitive computing technology, grow your expertise through experiential learning, and have an opportunity to demonstrate your talent.<p>Internships Opportunities for Undergrad and Masters Students<p>Tools Developer - SWG-0691285\nYou’ll specialize in designing, developing, and testing tools that enable Watson to work with large datasets, domain experts to train the systems and developers to consume cognitive capabilities. You’ll also be developing capabilities that make the Watson development team more productive and efficient in its solution delivery.<p>Java Developer - SWG-0694944\nYou’ll be well versed in Java Object Oriented (OO) programming with experience in systems development, distributed computing and linux development. Experience and conceptual understanding in highly available systems, performance engineering, parallel processing and web application development is also advantageous.<p>Solution Engineer&#x2F;Tech Lead - SWG-0695086\nYou’ll facilitate the building of a Watson Solution for a particular customer including achieving the performance needed for success. You’ll work primarily with the Customer, Watson Lab Services Leadership and Watson Core Development to help deliver a signature Watson solution.<p>Performance Engineer - SWG-0710282\nYou’ll use your expertise in tools, methodologies and practices to ferret out any performance issues in Watson cloud based solutions. You’ll think preventive best practices, but can also isolate and solution esoteric performance problems on many different products.<p>User Interface Developer -SWG-0710499\nUI Developers are graphic and interaction developers who have an eye for clean, intuitive development. You have the drive to create the best experience for the users and thrive as part of a cross-functional team in a highly collaborative environment<p>Software Engineer&#x2F;Cloud Developer - SWG-0713425\nYou’ll bring Watson solutions to the cloud with your experience in cloud development, large scale systems design&#x2F;implementation, and service oriented architecture design&#x2F;implementation. We’re looking for Cloud Developers, Cloud Infrastructure Deployment Engineers, Cloud Operations and Support Engineers, Cloud Security Analysts and Cloud Extensions Programmers.<p>I&#x27;m available for any questions you might have at tparikh [at] us [dot] ibm [dot] com","time":1425237352,"type":"comment"}