{"by":"tmjobs","id":9129046,"parent":9127232,"text":"Ticketmaster&#x2F;Live Nation - Software Engineer - Los Angeles &#x2F; West Hollywood, United States<p>Ticketmaster is looking for a strong Software Engineer who can thrive in a fast paced environment to join the newly minted Distributed Commerce team.  We are building products that will enable third parties to sell verified tickets off-site, on many of the largest platforms and websites in e-commerce and online media. As a key member of a small, dedicated business unit, you will be responsible for developing new technology solutions that are completely independent from legacy systems. These scalable solutions will look to sell more than 6M+ tickets in 2015, utilizing transactional and content APIs, leveraging robust data and content schemas, as well as developing SDKs and transactional widgets that will empower partners to build consumer products which sell more tickets for concerts, sports and family events while increasing the exposure of the Ticketmaster brand.<p>Qualifications:<p>- 5+ years professional hands on software development experience, with 3+ years specifically utilizing Java and 2+ years of web services applications&#x2F;systems experience<p>- Experience building and maintaining scalable Rest APIs<p>- Hands-on experience to search utilities like Solr, Lucene and Elastic Search<p>- Strong knowledge about Relational and NoSQL databases especially HBase, Cassandra<p>- Exposure to open source frameworks for distributed computing and big data like Hadoop, Hive, Storm, Tez<p>- Scripting skills, e.g. Python, shell, etc. is a plus<p>- Experience with an open source development environment using tools and platforms such as Spring, Maven, Git, Eclipse, JIRA<p>Apply directly to Ticketmaster:\n<a href=\"https://livenation.tms.hrdepartment.com/jobs/6178/Software-Engineer-Distributed-Commerce-JavaHollywood-CA\" rel=\"nofollow\">https:&#x2F;&#x2F;livenation.tms.hrdepartment.com&#x2F;jobs&#x2F;6178&#x2F;Software-E...</a>","time":1425246886,"type":"comment"}