{"by":"hargettp","id":9129171,"parent":9127232,"text":"Full-Stack Web Developer, Ruby On Rails | True Link Financial | SoMa, SF<p>You’ll help lead the development of our Rails-stack world-facing site’s interface. It’s a cardholder website (think online banking) designed to be friendly, simple, usable, and not terrible in the way every other online banking experience is. It also is the interface to customize our insanely powerful card processing and fraud detection system. To our knowledge it’s the first ever consumer-facing interface to a fraud detection system.<p>There’s a lot of abstract thinking in presenting these concepts to the user. The technology is complex under the hood – think about Twilio or Stripe as comparable. We’re building a simple client for a simple API that wraps an extremely complex integration with a legacy system. Twilio didn’t make the SMS system simple, they wrote powerful software that wraps the complexity.<p>We’re offering a competitive salary and benefits, a meaningful equity stake, lunches &amp; snacks, and the opportunity to work with a talented, mission-driven team.<p>We’re looking for someone who:<p>* Believes in True Link’s social mission<p>* Is passionate about simplicity but comfortable with complexity<p>* Has a good eye for design<p>* Is excited to iterate based on extensive user-driven development and testingIs fluent and productive in Rails and javascript<p>* Java and AWS experience is a plus – we do processing and accounting in Java and can’t host on Heroku for security reasons<p>Because of the stage of the company we unfortunately cannot consider candidates with minimal experience (e.g. recent dev bootcamp graduates). We need people that have professional experience working as an engineer. We are also only looking to make an in-house, full-time hire here in San Francisco and cannot support part-time, remote, or contract work at this time.<p>To apply for a job, email jobs@truelinkfinancial.com.","time":1425248759,"type":"comment"}