{"by":"knyttan","dead":true,"id":9129005,"parent":9127232,"text":"KNYTTAN | Django, javascript, python, fullstack | London, UK - <a href=\"http://www.knyttan.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.knyttan.com</a><p>KNYTTAN is a full-stack startup revolutionising fashion design and retail through on demand manufacturing and are the first platform for made-on-demand knitwear. We do this with industrial knitting machines that we hacked to turn them into 3D printers for clothes.  We design our own products, curate the work of a collection of designers and provide tools for any individual to create their own design.<p>This is a unique opportunity to be in at the beginning - to work with a plaform in it’s earliest stages in a well funded creative, digital business in an attractive market.<p>On top of that, we just graduated the Techstars London W14 cohort.<p>We&#x27;re hiring 2-3 people over the coming months for our three key technical areas : \n• E-commerce platform \n• designer tools (the future &#x27;photoshop&#x27; for clothes) \n• machine control and process automation (of industrial on-demand production)<p>RELEVANT SKILLS\n5 years experience of the following:\n• Javascript &#x2F; html &#x2F; CSS\n• Python &#x2F; Django &#x2F; flask &#x2F; SQL &#x2F; SQLalchemy\n• Webserver configuration\n• AWS\n• Git or mercurial\n• QA and testing\nExperience in either process automation &#x2F; e-commerce platforms a bonus.<p>Position is full time, based in London. Pay is £50k+ depending on experience (plus a free digitally knitted sweater or two).<p>You are an entrepreneurial, self starter with experience delivering global systems that interface with the real world. An innovator with a bias to action, good communication skills and an obsessive eye for detail.<p>We are a small, extremely ambitious and growing team with ambitions to change the garment industry forever.<p>To apply email jobs@knyttan.com with your CV and a short note on why this is your dream role. Please include “Senior Developer” in the subject line.","time":1425246044,"type":"comment"}