{"by":"gaustin","id":9138430,"parent":9127232,"text":"Decisiv - Remote, US<p>Headquarters: Glen Allen, VA<p>Why work with us?<p>We&#x27;re a small, passionate, agile team of developers. We work remotely via Campfire, Jira, Confluence, and Hangout. We meet regularly during the year to enjoy some time together and stay connected to the rest of the Decisiv management team and the service and sales groups.  We&#x27;re flexible, autonomous, and strongly committed to delivering a valuable service with a great user experience. We work hard but sustain a healthy work&#x2F;life balance.<p>Your experience should show some or all these:<p><pre><code>    Work with Ruby and Rails\n    Huge success in API (RESTful) development\n    UI&#x2F;UX design with a modern JavaScript Framework\n    Test or behavior-driven development and CI\n    Object design, data modeling and software architecture skills\n    Understanding of business requirements and acceptance criteria\n    Selection of new technologies with creativity and due diligence\n\n</code></pre>\nIt’s great if your experience also demonstrates:<p><pre><code>    Deep SQL or no-SQL skills\n    Integrating with external systems\n    Developing significant libraries, algorithms or adapters\n    Managing complexity in large applications\n    Leadership of project, team or process\n\n</code></pre>\nWe&#x27;d love to see your Github account, code samples, or anything that shows your work. If such are unavailable, we can give you a short coding exercise. If you provide an example design document or README (or even an email) demonstrating thought and communication that&#x27;s helpful too. So drop us a line and tell us about yourself!<p>Candidates must be located in the United States and be able to work legally in the United States. Absolutely no companies - only individual developers who want to join a team and are looking for long term employment.<p>To apply send resume&#x2F;CV and cover letter to jobs@decisiv.net","time":1425399242,"type":"comment"}