{"by":"erikwiffin","id":9144016,"parent":9127232,"text":"Research Square - Durham, North Carolina and remote - www.researchsquare.com<p># About Us<p>Research Square (est. 2004) helps researchers succeed through our world-class technology enabled services.  We are home to the American Journal Experts, Rubriq, and JournalGuide brands, which provide solutions that help researchers communicate their work so they can get back to making discoveries. Research Square is a dynamic company with a global reach, located in the West Village area of Durham, NC.<p>We have challenging opportunities for bright, hardworking, and self-motivated developers. The focus of this role will be on the back end, with occasional front-end work, utilizing PHP &amp; MySql.  We are looking for mid- to senior-level developers who exhibit personal humility and who strive to enable the success of their team  in our fun and collaborative environment.<p>We do agile development running 2-week sprints.   You will have time to write your unit tests, your code will be reviewed by peers, and it will be pushed to production on a weekly basis.  What you create will get used!<p># Software Engineer<p><a href=\"http://researchsquare.theresumator.com/apply/lCMdO2/Software-EngineerPHP.html\" rel=\"nofollow\">http:&#x2F;&#x2F;researchsquare.theresumator.com&#x2F;apply&#x2F;lCMdO2&#x2F;Software...</a><p>As a developer you will be working on a variety of projects for both internal and external clients, including building web applications, APIs, search and social integration tools, and data analysis tools; maintaining existing PHP code; optimizing MySQL queries; and developing custom PHP solutions.  For this position, we are seeking applicants with 3+ years of PHP development experience.<p>Requirements<p><pre><code>  + 3+ years of PHP or OOP development\n  + 3+ years experience with relational databases\n  + Understanding of MVC design principles\n  + Familiarity with Git or other DVCSes\n  + BS in Computer Science or equivalent experience\n</code></pre>\nBonus Points<p><pre><code>  + Experience with multiple programming languages\n  + Experience with Zend Framework &#x2F; Slim Framework\n  + Experience with Agile Development\n  + Experience with Doctrine\n  + Experience with JSON, REST and APIs\n  + Experience with JavaScript (jQuery)</code></pre>","time":1425475684,"type":"comment"}