{"by":"jays","id":9147468,"parent":9127232,"text":"Naked Apartments<p>Full Stack Rails Engineer | REMOTE | Full Time | Anywhere, USA<p>Naked Apartments has set out to simplify renting, starting in NYC. We’re a small team, growing fast, and already taking a big bite out of Craigslist’s juicy NYC revenues, but we’ve set our sights on much bigger goals.<p>Our team is optimized for developer impact and freedom.<p>* A TRULY REMOTE job. We’ve taken Jason Fried’s TED talk [1] to heart and built an entirely distributed team, including even our CEO. This isn’t a remote bait-and-switch job, we have no physical office for employees to report to.<p>* Flexible work schedules. Work the times that work best for you. Our team cares about what gets done, not about how many hours you stare at your screen.<p>* No wire frames, pixel perfect designs, or 35 page specs handed down from out of touch product managers. We trust our engineers to help define business needs and shape them.<p>* Engineers get to take an idea from conception all to way to production, coupled with a team support system to get feedback and iterate until you’ve built a something we’re all proud of.<p>* Friendly, funny, energetic co-workers.<p>* Our company is profitable and growing.<p>We want team members we can trust, who not only care deeply about well written and tested code, but our business as well. Be ready to learn, grow, and help the team do great things together.<p>Send us an email, we’d love to hear from you: jobs@nakedapartments.com<p>* <a href=\"http://www.nakedapartments.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nakedapartments.com</a><p>* <a href=\"http://www.nakedapartments.com/about/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nakedapartments.com&#x2F;about&#x2F;jobs</a><p>[1] <a href=\"http://www.ted.com/talks/jason_fried_why_work_doesn_t_happen_at_work.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ted.com&#x2F;talks&#x2F;jason_fried_why_work_doesn_t_happen...</a>","time":1425504309,"type":"comment"}