{"by":"seemac","id":9147940,"kids":[9148693],"parent":9127232,"text":"Shippable (Seattle, WA) is looking for MEAN Stack programmers (Node.js, Angular.js) with 2+ years progressive software development experience and passionate about developing sophisticated enterprise&#x2F;cloud technology applications. (hiring in Bangalore, India also)<p>Education: BS in Computer Science or equivalent.  Solid foundation in computer science, with strong competences in operating systems, computer networks, data structures, algorithms and software design<p>Experience: Coding large systems and great debugging skills. Writing unit tests and testable code. At least one scripting language, such as JavaScript, Python, Node.js or Angular.js<p>Nice to have: Working knowledge of Docker, MongoDB, and RabbitMQ<p>About Shippable: Shippable is focused on a disruptive new vision- make software development frictionless, fast, and high quality.<p>Shippable is a leading continuous delivery platform that enables customers to innovate faster without compromising on quality.  Our company’s mission is to address the challenges and opportunities of developing software applications across multiple teams and to bring enterprise grade CI&#x2F;CD to all businesses.  More than 35,000 developers and over 4000 businesses are using Shippable to `ship quality code faster`.<p>We are a well-funded startup (Techstars alumnus) focused on containerizing the application development lifecycle.  Shippable reduces friction between Dev and Ops by enabling seamless shipping lanes for applications from code to production.  We heavily leverage Docker containers to achieve this and we are the first company to run Docker in production.<p>Apply at <a href=\"http://shippable.theresumator.com/apply\" rel=\"nofollow\">http:&#x2F;&#x2F;shippable.theresumator.com&#x2F;apply</a> or Email us at resumes@shippable.com<p>Visit us at <a href=\"http://www.shippable.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.shippable.com&#x2F;</a>","time":1425509170,"type":"comment"}