{"by":"Leif_Hustler","id":9202006,"parent":9127232,"text":"Berlin, Germany - DreamCheaper is looking for a lead developer and a CTO.<p>DreamCheaper.com is a service that reduces the price of hotel reservations after(!) they&#x27;ve been booked. Users simply forward their booking confirmation via email to hotel@dreamcheaper.com and we continuously check across hundreds of sources if the room they booked is available cheaper anywhere. If so, we rebook it. As a result they sleep in the same room they initially booked, but pay less. <p>Please check out <a href=\"http://techcrunch.com/2015/03/10/dreamcheaper/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;03&#x2F;10&#x2F;dreamcheaper&#x2F;</a> for more info.<p>Due to a tremendous boost in demand we’re looking for an experienced CTO to set up a small team and help us scale and improve our efficiency.<p>Your Tasks:<p>* You set up and lead an international team of dedicated developers and have an eye on the back- and front-end development process<p>* You are responsible for the development &amp; growth of our team<p>* You shape our vision from both the business- and technology perspective and add new features by working closely with the founding team<p>Your Haves:<p>* At least 4 years of relevant experience (travel industry is a +)<p>* Deep knowledge of Symfony2 and API technologies (REST, SOAP…) &amp; web scraping<p>* Excellent communication skills, and the ability to recruit and lead international teams<p>* Passionate about clean code<p>* Self-driven &amp; result oriented<p>* Most importantly: You’re passionate about the idea itself and growing this startup to disrupt the industry!<p>* You are based in – or are willing to move to – Berlin, Germany<p>We offer:<p>* Flat hierarchies<p>* International team<p>* Room for your own ideas<p>* The opportunity to contribute to an amazing product and disrupt the hotel industry<p>* A salary adequate to your experiences and skills<p>Please get in touch if you&#x27;re interested: info@dreamcheaper.com","time":1426324700,"type":"comment"}