{"by":"sbutala","id":16738427,"parent":16735011,"text":"BOX.COM | Sr. Software Engineer, Full Stack, Box Notes | HQ -\nRedwood City | Full-Time | ONSITE<p>Box Notes is a collaborative business note-taking tool that makes it easy for our 54 million+ users to create and collaborate on content in real-time. Our mission is to build the world’s best business collaborative note-taking product.<p>We have some interesting and exciting challenges that we need help with which include scaling our backend infrastructure to support complex realtime features on Box Notes. Examples include rethinking high availability of the system, moving to containerized backend components and working on reliability of the system as we work fanatically to grow our user base.<p>Example Projects: Box Notes team recently launched a whole new way of collaborating with your team by launching Inbox, Differences, Presence and Templates. <a href=\"https:&#x2F;&#x2F;blog.box.com&#x2F;blog&#x2F;box-notes-inbox-presence-differences&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.box.com&#x2F;blog&#x2F;box-notes-inbox-presence-differenc...</a> Exciting part is that these features were innovations from past Hackathons from the engineers on the team!<p>Who you are:<p>* You are experienced in Node.js, Javascript, React<p>* You have 3-5+ Years of relevant work experience<p>* You are passionate about solving hard problems using data-driven solutions<p>* You act like an owner and strive to do work you&#x27;re proud of, both technically and in your team interactions<p>* You are able to inspire other people to work with you, and you enjoy mentoring and coaching junior engineers<p>* And more importantly you like to be in a fun tight-knit team. :)\n<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;swaroopbutala&#x2F;status&#x2F;950965608950071296\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;swaroopbutala&#x2F;status&#x2F;950965608950071296</a>\n<a href=\"https:&#x2F;&#x2F;www.instagram.com&#x2F;p&#x2F;BZEyC_glPv6&#x2F;?taken-by=box\" rel=\"nofollow\">https:&#x2F;&#x2F;www.instagram.com&#x2F;p&#x2F;BZEyC_glPv6&#x2F;?taken-by=box</a><p>Job details &amp; application: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;boxinc&#x2F;jobs&#x2F;840116\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;boxinc&#x2F;jobs&#x2F;840116</a> or feel free to reach out directly at swaroop@box.com","time":1522697856,"type":"comment"}