{"by":"muinc","id":16735860,"parent":16735011,"text":"M U INC | Senior Data Engineer (aka &quot;Director of I&#x2F;O Bound Stuff&quot;) | Austin, TX | ONSITE | Full Time<p>We are a small independent startup (fully funded by our MVP&#x27;s proceeds) focused on managing, enriching and presenting large and complex Energy Data.<p>Our technical capabilities translate DIRECTLY into commercial success, we are thus obsessed with coupling Engineering Excellence with Pragmatism. We strive to continuously &quot;co-optimize&quot; architecture and technical decisions with the company&#x27;s long term business strategy.<p>Our MVP has been extremely successful. We are actively looking for someone ready to develop and take charge of our next generation Data Platform.<p>We&#x27;ve fallen in love with Martin Kleppmann&#x27;s &quot;Building Data-Intensive Applications&quot; book and his &quot;Turning the database inside-out...&quot; [0] talk. You will be building a Kappa Architecture from scratch. This platform will become the data backbone of our business, supporting most of what we do.<p>This is the stack we already have and&#x2F;or envision:<p><pre><code>  - Apache Kafka\n  - Python\n  - Rust\n  - Docker&#x2F;Kubernetes\n  - LMDB&#x2F;RocksDB\n</code></pre>\nYou will report directly to the CEO (aka Chief Nerd Officer) and become a member of our small core team. Our success and your success will be extremely aligned as you will be making substantial contributions to our business (data is critical for us).<p>This is an ONSITE position only here in Austin, TX. We have a nice office in Downtown, with a gym, treats and all... but that&#x27;s probably not the reason why you would love it :p At any rate, let&#x27;s talk! Email us at hello@m-u-inc.com<p>[0] <a href=\"https:&#x2F;&#x2F;www.confluent.io&#x2F;blog&#x2F;turning-the-database-inside-out-with-apache-samza&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.confluent.io&#x2F;blog&#x2F;turning-the-database-inside-ou...</a>","time":1522685595,"type":"comment"}