{"by":"TDMLB101","id":16739194,"parent":16735011,"text":"BAMTech Media | New York, NY | Software Engineer or Senior Software Engineer: Media Services; Senior Software Engineer: Stream Security || ONSITE or REMOTE, Full time<p>Join our team and help us drive the cord-cutting revolution! BAMTech isn’t just about streaming Baseball – we also manage NHL, Fox Sports Go, WWE, Eurosport, and several other content providers. You would be helping a team whose services act as the linchpin for video playback, handling new challenges of scale and speed in a rapidly growing industry. The company is aggressively expanding to meet increased demand, and you would be getting in on the ground floor of this new opportunity. You would help the team create new designs to meet our scaling demands, build out services in cloud infrastructure providers with exposure to AWS EC2, S3, Dynamo, and Kinesis, and help the team introduce new processes to scale. If you like tinkering with new technologies, have experience with high scale systems, or simply want to gain exposure to new tools, this team is a great fit. You’d be helping the team embrace microservices architecture with an emphasis on non-blocking, highly concurrent programming. Experience with Scala&#x2F;Play&#x2F;Akka is highly preferred, but not a requirement. With strong CS fundamentals and an entrepreneurial attitude, you’d be an asset to our team.<p>We are also seeking a Senior Engineer with C#&#x2F;.NET experience to join our Stream Security team. This team is responsible protecting our content, with projects that span a wide variety of security concepts including studio grade DRM. We&#x27;re looking for a candidate with C#&#x2F;.NET experience but also an openness to expand into Scala. This is a unique opportunity in a high visibility team with significant impact.<p>PM me to apply.<p>Read more here: <a href=\"https:&#x2F;&#x2F;www.bamtechmedia.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bamtechmedia.com&#x2F;</a>","time":1522702546,"type":"comment"}