{"by":"moss_whitney","id":16739542,"parent":16735011,"text":"Triggr Health | Full Stack and Data Engineers | Chicago, IL | ONSITE | Full-time<p>Triggr Health is the first predictive system of care for addiction recovery. We are a world-class team of engineers, designers, doctors, and researchers from institutions such as Stanford, Google, UCSF School of Medicine, UPENN, Northwestern, and Rackspace. We are currently working with many of the top treatment providers, government initiatives, health systems, and academic research programs in the world. Our core platform utilizes phone sensors and phone data to predict the state of an individual’s recovery in real-time, enabling the right care to be delivered proactively the moment it is needed.<p>Imagine if you could predict risk factors that lead to regressive behavior, such as when someone is angry; when they are experiencing a craving; when they are not sleeping well; or when they are falling off their continuing care plan. Now imagine doing all of this without self-reported data. We are building apps on both Android and iOS, a customer-facing web application, a robust web services API, machine learning-driven analytics, and large-scale data processing.<p>Our tech stack includes NodeJS and MongoDB on the backend, Backbone on the frontend, React Native, Swift and Java for mobile, and Python 3 for machine learning.<p>To apply, contact us at talent@triggrhealth.com with a resume, why you are interested in this position, why you want to be a part of solving this problem, and a picture of your favorite dog or cat breed (bonus points if it’s yours!).\nSr Full Stack Engineer Jr Full Stack Engineer Data Engineer\nFull job descriptions here: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;triggr-health&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;triggr-health&#x2F;jobs</a><p>We are a highly driven, mission-oriented team that enjoys working hard, has fun together, and embraces quirkiness. At Triggr Health we value diversity and endeavor to treat everyone with respect, no matter their age, gender, race, ethnicity, or sexual, cultural or ideological preferences.","time":1522704557,"type":"comment"}