{"by":"voidray","id":16739734,"parent":16735011,"text":"Tempo Automation | Full-Stack Software Engineer | SF | Full-Time | ONSITE | <a href=\"https:&#x2F;&#x2F;www.tempoautomation.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tempoautomation.com</a><p>Tempo operates a factory in SF to produce printed circuit boards extremely quickly - in doing so, we give our customers the physical equivalent of a fast compiler, enabling them to turn their designs into real products significantly faster than they could before. Our customers build rockets, drones, medical devices, and much more - working at Tempo means you can accelerate all of these industries at once.<p>Providing a system to produce circuit boards quickly and correctly means we&#x27;re both a software shop and an advanced manufacturer. Our software team is still pretty small (6 engineers) which means any new hires will still have an outsize impact on the direction of our technology, and on the company as a whole.<p>We love hiring strong generalists who take initiative and act as part-time PMs when they&#x27;re working on projects.<p>Some projects you might work on:<p><pre><code>  - Offering real-time, automated manufacturing feedback based on certain parameters of our customers&#x27; designs. Think linting for hardware.\n\n  - Optimizing our factory processes with machine learning and scheduling algorithms.\n\n  - Encoding the three-dimensional structure of each order&#x27;s components (e.g. resistors, capacitors) for our assembly robots, in order to speed up assembly and ensure minimal manufacturing defects.\n\n  - Optimizing our automated optical inspection machine to make it faster than any in the industry.\n\n</code></pre>\nWe&#x27;re also excited to be moving into a MUCH larger factory (&gt;4x the floor space) in SoMa in a couple months, which means you&#x27;ll see that space evolve from nothing into an enormous, high-tech manufacturing complex.<p>If you&#x27;re interested, please apply at <a href=\"https:&#x2F;&#x2F;www.tempoautomation.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.tempoautomation.com&#x2F;careers</a> or send a note to george [at] tempoautomation [dot] com.","time":1522705951,"type":"comment"}