{"by":"technojunkie","id":16736234,"parent":16735011,"text":"Circonus | Software Engineers | Remote, Full-time | <a href=\"https:&#x2F;&#x2F;www.circonus.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.circonus.com&#x2F;</a><p>Circonus is a software company that is changing the way the world monitors both IT infrastructure and the business it powers. Our SaaS and On-­Premise solutions enable companies to combine monitoring, alerting, event processing, and predictive analytics into a unified solution. Visualize any data, in any application, from any system, in real ­time.<p>Listen to one of our CEO Theo&#x27;s talks to get an idea of what Circonus does:\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qh4hLIWqw6Q\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qh4hLIWqw6Q</a><p>We are a 100% distributed and remote company, mostly across the US as well as Europe. You are also welcome to work from the Maryland office; most employees work from home.<p>We build web software using technologies such as C, C++, Lua, Java, Ruby, Go, Perl, JavaScript, jQuery, HTML, Scss<p>Circonus is seeking to fill two roles.<p>* Technical Account Manager - Customer service role as an expert in all things Circonus to build and maintain relationships <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;5342c10c-ae13-45f6-816f-cfbee20ee252\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;5342c10c-ae13-45f6-816f-cfbee...</a><p>* Perl Senior Software Engineer - Strong server-side development experience with Perl and working knowledge of mod_perl with Unix and RDBMS experience <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;0d485785-a66d-4de5-897e-969256caa9b7\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;circonus&#x2F;0d485785-a66d-4de5-897e-96925...</a><p>All of our positions include a discretionary PTO policy, health insurance, gym reimbursement, a generous 401K, the opportunity for a bonus and more.","time":1522687408,"type":"comment"}