{"by":"biodave","id":16738744,"parent":16735011,"text":"RONIN HEALTH | VP, Engineering | SF Bay Area | Full-time Onsite | $220,000 - $260,000 + Equity | Benefits<p>Ronin Health is a cancer care platform for medical oncologists and their patients. It provides tools and insights for cancer diagnosis, treatment and supportive care.<p>Our multi-million dollar seed round just closed via a prominent tech billionaire and global healthcare company. We are currently working with the a number of the nation’s most recognized oncologists and working with a large cohort of medical records containing tens of millions of patient data points.<p>We’ve been concepting the business for the last 7 months and are now incorporating and hiring the founding team. This is a “green field”, “first in” role. The CEO is hired and other positions are at the offer stage.<p>YOU CAN:<p>- Hire and develop an the best technical talent to create an outstanding engineering team<p>- Build a rock solid technology platform that becomes the de facto daily operating system for clinicians<p>- Innovate algorithms research, machine learning infrastructure, front-end development and QA<p>- Become an invaluable colleague and member of the executive team<p>- Provide technical authority in strategy planning with the board and in enterprise sales engagements<p>- Raise your game and use your talents and years of experience to benefit the sufferers of one of the world’s most terrible diseases<p>YOU HAVE:<p>- 8+ years of VP-level engineering management experience with a track record of running the full engineering organization<p>- Proven ability to rapidly scale engineering organizations at young, high growth companies while maintaining the highest standards of talent, product quality, and culture<p>- Strong organizational management skills, with a toolkit of processes and best practices ready on day one<p>- Extensive track record of developing high-performance healthcare enterprise technologies<p>- Experience with big-data, ML engineering platforms<p>- Strong entrepreneurial drive<p>Please apply via Oxeon Partners, who assisted with the company design, at: ronin@oxeonpartners.com","time":1522699642,"type":"comment"}