{"by":"meego","id":16742679,"parent":16735011,"text":"TestPass | Senior&#x2F;Lead Software Engineer + Full-Stack JavaScript Engineer | Full-time | Paris, France | €50-70k + significant equity stake | www.testpass.fr<p>&#x2F;&#x2F; Product:<p>TestPass helps outdoor companies connect with outdoor enthusiasts by making their equipment easily available for test runs and rental. We solve logistics, scheduling, or payment so brands don&#x27;t have to. We&#x27;re already profitable and work with major brands (Scott, Cannondale, Specialized, Petzl...) across 25 countries.<p>&#x2F;&#x2F; You:<p>a Lead Software Engineer to take ownership of engineering, and a Full-Stack JavaScript Engineer to work and learn alongside. Both positions require proficiency in building and maintaining modern full stack Javascript web applications. Both positions are onsite in Paris, France, and allow some remote work.<p>The ideal candidate for Lead Software Engineer will also have:<p>-a strong all-around software engineering culture (e.g. devops, QA, networking, performance, security)<p>-experience running small-to-average engineering teams and the desire to take a manager role, shaping the culture, tools and processes, and training younger colleagues.<p>&#x2F;&#x2F; Stack:<p>Microservices-based architecture, ES2017, Node+Express, GraphQL, AngularJS, Mongo+Mongoose, Heroku, Sentry,… We maintain a RaspberryPi-hosted embedded version for our clients who use TestPass away from cellular (e.g. mountain glaciers!).\nNext: React&#x2F;Vue, tests+CI, embedded app overhaul<p>&#x2F;&#x2F; Team:<p>We&#x27;re a 4-person team in Paris, France, half of which works remotely: 2x Full-Stack JS, 1x Product Manger, 1x CEO. We have a fast product delivery pipeline and strive to grow an efficient, sane and sustainable work environment with proper work-life balance. Team includes a former pro mountain biker, and a former employee #2 of Stootie (300k MAU, 11M€ raised). Frequent opportunities to travel to outdoor-related destinations (e.g. Swiss Alps, French Riviera, US Rockies) where we attend &amp; support sports&#x2F;outdoor events on a regular basis. Benefits include 5 weeks paid vacation and full health benefits<p>&#x2F;&#x2F; Interview process:<p>Phone call &#x2F; coffee [30 min] &gt;&gt; Interview [2 hrs] + small assignment &gt;&gt; Onsite w&#x2F; team [half-to-full day]<p>&#x2F;&#x2F; Get in touch:<p>Guillaume &amp; Antoine jobs@testpass.fr","time":1522742276,"type":"comment"}