{"by":"jayemery","id":16746229,"kids":[16757847],"parent":16735011,"text":"OANDA | Dev and Team Lead positions within Engineering | Toronto, ON, Canada | jobs.oanda.com<p>OANDA provides Internet-based forex trading and currency information services to everyone, from individuals to large corporations; portfolio managers to financial institutions. We’re looking for experienced developers and creative professionals to join us in our Toronto office on our mission to be the world’s currency authority.<p>We&#x27;re looking to fill the following Toronto-based roles within Engineering:<p>- Front-End Team Lead<p>- Front-End Application Developer<p>- Intermediate&#x2F;Senior Software Developer<p>- Python Developer<p>- Android or iOS Mobile Developer<p>- Business Intelligence Developer<p>- Business Intelligence, Data Engineer (Internship-12 months)<p>Our environment is very open, with Engineering being comprised of multiple small teams working closely together in an agile fashion. We have teams creating high performant systems with sub-millisecond trade execution time. We have teams designing and creating meaningful user experiences on desktop, web and mobile. We have teams that specialize in API design, business intelligence, and quantitative analysis. Whatever you&#x27;re looking for, check out jobs.oanda.com.<p>So why would you want to come work here? Although the company has been around for twenty years, recent hires say the culture feels more like a vibrant start-up. We care about writing and maintaining high quality, modular, testable code. We’re continually looking to advance our process, recently experimenting with GV: Design Sprint. We take pride in holding to a high standard of ethics, working closely with regulators across the globe. We treat customers fairly, how we ourselves would want to be treated. We provide an environment for people to grow in their career and create their own opportunities. Ultimately, we’ve created a platform that our customers actually want to use, and this drives us to make it even better. I’ve been at OANDA for almost 10 years and can say that all of this is only possible because we’re a group of people who genuinely love working together, able to get work done because we’re not plagued by politics or office drama.<p>We also have free coffee, drinks, snacks, catered meals, a games room, training allowance, a retirement savings program, and other benefits. If you’re in Toronto, and any of this sparks your interest, please apply through jobs.oanda.com!","time":1522772384,"type":"comment"}