{"by":"pablito","id":16740790,"parent":16735011,"text":"GoCardless (YC S11) | London | SRE, Data, Backend, Full-Stack, and Pre-sales&#x2F;Solutions Engineers | Onsite | Full-time | Visa<p>GoCardless is building a payments network for the internet. Since 2011 we&#x27;ve been focused on simplifying Direct Debit for small and medium companies (who previously had no access to it) and we&#x27;ve expanded to serve the largest companies (think newspapers, utilities) and connect with existing payment systems in countries all over the world. We already support the UK, Europe and Sweden and are aiming to expand to more countries over the next year.<p>As an engineering team at GoCardless we care most about stable, reliable, understandable code. We rely on automated testing, code review and a culture of frequent constructive feedback. We define and manage our own roadmap and run projects in whatever way works best for us.<p>Our stack: Rails, React, Postgres, Elasticsearch, Docker, Chef, Terraform. We also have a bit of Go (for Infrastructure) and Python (for Data).<p>We love learning new things and contributing back to the community. We open source everything we can[1] and regularly host meetups and hackathons at our wheelchair-accessible office Between Farringdon and Old Street. We have a bi-weekly bookclub within the team and give internal (and external) talks about things that interest us.<p>Interview process: an intro call, one technical video interview, then a couple of onsite interviews (coding exercise and some chats - no whiteboards!)<p>For more info and to apply: <a href=\"https:&#x2F;&#x2F;gocardless.com&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;gocardless.com&#x2F;jobs</a>. If you&#x27;ve got any questions, drop me an email (it&#x27;s in my profile).<p>[1] Notable examples are Statesman (<a href=\"https:&#x2F;&#x2F;gocardless.com&#x2F;blog&#x2F;statesman&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gocardless.com&#x2F;blog&#x2F;statesman&#x2F;</a>) and Coach (<a href=\"https:&#x2F;&#x2F;gocardless.com&#x2F;blog&#x2F;getting-started-with-coach&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;gocardless.com&#x2F;blog&#x2F;getting-started-with-coach&#x2F;</a>)","time":1522715324,"type":"comment"}