{"by":"dmarby","id":16742453,"parent":16735011,"text":"Mullvad | Gothenburg, Sweden | FULL-TIME | ONSITE or REMOTE | Front-end Web Developer&#x2F;Designer<p>Mullvad is a VPN service that helps keep internet users’ online activity, identity, and location private. We are a team fully dedicated to our goal - making internet censorship and surveillance ineffective.<p>We are looking for an experienced front-end developer equipped with both design and programming expertise to further develop Mullvad&#x27;s website.<p>Requirements<p><pre><code>  * You have a few years’ experience developing and designing websites.\n  * You are comfortable with creating a design from scratch, as well as implementing it.\n  * You are capable of collaborating closely with a team of diverse skill sets.\n  * You understand the importance of approaching web design from a UI&#x2F;UX perspective.\n  * You have proficient understanding of cross-browser compatibility issues and ways to work around them.\n  * You are fluent in English.\n</code></pre>\nNice but not necessary<p><pre><code>  * Previous experience in working with Django, Python, Rust, or Go\n  * Javascript frameworks such as Vue or React\n  * front-end build tools, for example Webpack\n  * UI&#x2F;UX design and testing.\n</code></pre>\nBenefits<p>We believe in having a life outside of work. That’s why we offer<p><pre><code>  * flexible working hours\n  * 25 days of annual paid vacation\n  * 300 EUR annually in allowance toward wellness-related activities (friskvårdsbidrag)\n  * the possibility of working remotely for extended periods of time\n</code></pre>\nWe also offer opportunities for growth. Aside from company-initiated opportunities for attending various national and international conferences, you will also have the option to attend one of your choosing per year. In addition, we’ll pay for any reading material that you feel contributes to your professional development.<p>If you’re interested in joining our team, send us an email at jobs@mullvad.net by 15 June 2018.<p>More information and job listings can be found at <a href=\"https:&#x2F;&#x2F;mullvad.net&#x2F;blog&#x2F;tag&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;mullvad.net&#x2F;blog&#x2F;tag&#x2F;jobs&#x2F;</a>","time":1522738920,"type":"comment"}