{"by":"jeffersonheard","id":16740412,"parent":16735011,"text":"Teamworks | Durham, North Carolina | Software Engineers - Mid to Senior, Front End, Back-End (Python Flask, Postgres) \n UX Designer, and others | Onsite<p>See positions and apply here: <a href=\"https:&#x2F;&#x2F;www.teamworks.com&#x2F;company&#x2F;#careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.teamworks.com&#x2F;company&#x2F;#careers</a><p>Teamworks is the software your favorite collegiate and professional sports teams use to collaborate and to help them coordinate everything from athletic practice to team travel events. We provide solutions to over 1400 NCAA Division I teams, dozens of professional teams, and professional athletic associations.<p>&quot;<i>With Teamworks, you have a product which is solely designed for team management. Teamworks puts all their focus on operating your team on a day-to-day basis, which as a DFO is the most valuable tool I could have.</i>&quot;<p>-- Mike Parrish, Assistant A.D., Football, University of Arizona<p>We offer:<p>* High-energy start-up culture<p>* Direct impact on the workflows of major athletic and \ncommercial organizations<p>* Challenging and exciting work environment in a newly renovated downtown office location<p>* Work with dynamic technology and a diverse set of clients<p>* A robust benefits package, including healthcare &amp; dental coverage, 401(k) plus match, free gym memberships, unlimited vacation policy and free parking in downtown Durham.<p>We just raised our series B: <a href=\"https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2018-03-09&#x2F;general-catalyst-leads-funding-round-in-duke-backed-teamworks\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2018-03-09&#x2F;general-c...</a><p>I&#x27;m the Principal Software Developer, Python. If you have a question about our engineering culture, ask me directly, jheard [at] teamworks.com. I&#x27;m happy to chat. If you first saw Teamworks here, make sure to mention that in your cover letter. Thanks!","time":1522711598,"type":"comment"}