{"by":"jdiaz5513","id":16749452,"parent":16735011,"text":"Hinge Health | <a href=\"https:&#x2F;&#x2F;hingehealth.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hingehealth.com</a> | San Francisco | Full Time | ONSITE<p>Hinge Health offers digital delivery of best-practice care for chronic musculoskeletal (MSK) pain without resorting to drugs or surgery. We accomplish this through a program based on three core pillars: exercise therapy, coaching &amp; lifestyle, and education. Exercise is tracked through an Android app and wearable sensors, and a personal health coach adds vital support and motivation.<p>Our results are inspiring and leads to measurable drops in pain and surgery likelihood. Witnessing some of the patient testimonials sits among the most precious moments of working here.<p>We partner with brand-name corporations to offer our kit to their employees, usually covered as part of the overall benefits package. This creates a rare win-win scenario where all people benefit from our continued success – and we&#x27;re growing fast!<p>Tech stack: Amazon, Aptible, Postgres, Redis, RoR, Android, React, and React Native.<p>We&#x27;re looking to hire for two main roles: Ruby on Rails for general backend engineering, and Javascript&#x2F;Typescript for our React and React Native frontends. Previous iOS native experience along with React experience is a huge plus! We do not have an apprenticeship program at the moment, so we will require previous industry experience for either role.<p>Our engineering team is led by people who truly care about doing right by the world, and inhumane practices of all kinds are verboten. In addition we stand strongly by good engineering principles, so concepts like linting and testing are given due respect. Our hiring process does not include whiteboard challenges or algorithm puzzles (see my comment history for my personal thoughts on the subject).<p>Daily wellness sessions and paid-for parkside lunches are among the things that makes the day-to-day here quite a blast!<p>If this sounds inspiring to you I&#x27;d love to talk: julian@hingehealth.com","time":1522790773,"type":"comment"}