{"by":"rebecka_massive","id":16752315,"parent":16735011,"text":"ONLINE INFRASTRUCTURE ENGINEER | Massive Entertainment – A Ubisoft Studio| Malmö, Sweden| Onsite | Full time |<p>Massive Entertainment is a premier producer of games and interactive entertainment for the global market. The studio is located in Malmö, Sweden and fully owned by Ubisoft Entertainment, the world’s third largest independent video game publisher. We are around 480 people from 38 different countries working together to produce major titles such as World in Conflict, Far Cry 3, Tom Clancy’s The Division and our latest Avatar Project.<p>As Online Infrastructure Engineer you will be part of the development team for Tom Clancy’s The Division™ and the new Avatar project. Your primary role will be to make sure the backend server infrastructure can withstand the pressure and flexibility needs of highly anticipated online games. You will work closely with programmers in the team and operators within the Ubisoft group across the globe to help deliver a great online experience for our players.<p>IF YOU KNOW:\n- How unattended OS deployment works or the intricacies of config management (PXE, WDS, kickstart, saltstack et al.)\n- When to apply CAP theorum of highly reliable clustered persistence systems?\n- The difference between authorization and authentication. Additionally, how Active Directory implements them\n- Why you would want to use metrics based monitoring instead of reading log lines<p>YOU WOULD LIKE TO WORK WITH:\n- Global scale deployments\n- A small close knit team\n- Saltstack, python, powershell\n- Windows Server, RHEL, FreeBSD\n- Active Directory, Elasticsearch, PostgreSQL, ZFS, Zabbix and Graphite<p>Interested? For more information and to apply; <a href=\"https:&#x2F;&#x2F;jobs.smartrecruiters.com&#x2F;Ubisoft2&#x2F;743999668226978-online-infrastructure-engineer-live-operations-\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.smartrecruiters.com&#x2F;Ubisoft2&#x2F;743999668226978-on...</a>","time":1522821185,"type":"comment"}