{"by":"TChiring","id":16769009,"parent":16735011,"text":"TrueCar | Santa Monica, CA | Full Time<p>TrueCar is continuing to grow our technology team in 2018. We are hiring engineers with interest in the below positions:<p>* Software Engineers (Rails)<p>* Software Engineers (Rails&#x2F;Platform)<p>* Data Engineers (Java&#x2F;Hadoop)<p>* DevOps &#x2F; Site Reliability &#x2F; Infrastructure Engineers (AWS)<p>* Scrum Masters<p>We acquired the talent of quite a few Carwoo (YCS09) alums a few years ago. We&#x27;ve been around for over 10 years and went public 3+ years ago. The company has big plans for the coming years and is looking for good developers to help us grow. See www.truecar.com&#x2F;careers&#x2F; for the full scoop.<p>* We prefer you work with us in-person in our Santa Monica HQ. We&#x27;ll handle most visa situations.<p>* Benefits are exceptional: Your health premiums are 100% paid for, we match your 401k (up to 3% of your contributions), and give stock packages. We also pay for your gym membership (up to $50&#x2F;month) and have catered lunches every Wednesday.<p>* Our Santa Monica HQ is right by the beach and Third Street Promenade, so expect fresh air, amazing views, and plenty of food options.<p><i>We just completed our first TrueCar Hackathon which our CTO, Tommy McClung, just wrote a blog post about.<p>You can read about it on our technology blog: <a href=\"https:&#x2F;&#x2F;www.drivenbycode.com&#x2F;hack-a-thon-winners&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.drivenbycode.com&#x2F;hack-a-thon-winners&#x2F;</a>\nHere is a video that documented the hackathon as well: <a href=\"https:&#x2F;&#x2F;bit.ly&#x2F;2HcckbM\" rel=\"nofollow\">https:&#x2F;&#x2F;bit.ly&#x2F;2HcckbM</a><p></i> Ruby on Rails, React, AWS, Redis, PostgreSQL, Hadoop, and Elasticsearch<p>* VISAS are handled under the right circumstances.<p>Send an email to me (Brett) (bemma AT truecar.com) with your resume and&#x2F;or GitHub profile. Even if you&#x27;re not applying but just have questions, drop me a line","time":1522964427,"type":"comment"}