{"by":"sidneydekoning","id":16772004,"parent":16735011,"text":"BAMTECH Media | Senior Web developer | ONSITE | Amsterdam, NL<p>BAMTECH is a streaming technology joint venture between The Walt Disney Company, Major League Baseball Advanced Media, and the National Hockey League. BAMTECH handles streaming for numerous partners, some of which include, HBO, MLB, NHL, Eurosport, ESPN, and World Wrestling Entertainment. BAMTECH engineering is headquartered in the Chelsea area of New York, with an office in the SoMo area of San Francisco. The europe headquarters is based in Amsterdam.<p>This position is located Amsterdam, The Netherlands.<p>We are looking for someone with 3 to 5 years experience in HTML&#x2F;Javascript&#x2F;Node JS and is well versed in streaming video and web technologies. Our current technology stack consists of HTML&#x2F;Javascript&#x2F;NodeJS, Bower, NPM, Grunt, Webpack. Plus we use tools like Jenkins, Confluence, JIRA and Slack.<p>What you will be doing:<p>- Create and maintain streaming web apps.\n- Prototype and implement scalable, reliable, and maintainable web apps using our tech stack and our custom frameworks and tools.\n- Enforce code quality through TDD.<p>We offer:\n- Competitive salary\n- Ownership over projects, autonomy to make decisions and propose solutions\n- Flexible hours. Feel free to work from home\n- Family-friendly hours (we encourage a good work-life balance.)\n- 24 days of annual paid vacation\n- A working environment that values equality and diversity, knowledge-sharing and personal&#x2F;professional development\n- Visiting meetups and conferences (National conferences are 100% expenses covered, International conferences 50%)\n- Grow yourself as a developer.\n- Amazing team of developers in different disciplines (Python, Android, iOS)\n- Perks: Cosy office in the north of Amsterdam, weekly catered lunches, fruit, filled fridge, beverages, standing desks, Macbook to code on<p>If you are interested in joining us, and not not only crafting but also enjoying the products you build, feel free to contact us at jobs-eu@bamtechmedia.com or check out <a href=\"http:&#x2F;&#x2F;www.bamtechmedia.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bamtechmedia.com</a> for a peek at what we do","time":1523007032,"type":"comment"}