{"comments":[[{"by":"rarrrrrr","id":2832269,"parent":2831646,"text":"Americas and Europe (remote): SpiderOak is looking for mobile engineering help<p>Since 2006, SpiderOak provides an easy, consolidated free online backup, sync, sharing, access &#38; storage solution for Windows, Mac OS X, and Linux with a zero-knowledge approach to encryption and customer privacy.  (You could think of SpiderOak as Dropbox for power users.)  We use Python, Django, web.py, WSGI, jQuery, PostgreSQL, nginx, 0mq, gevent, with some occasional heavy-lifting help from C, Erlang and Perl.<p>SpiderOak is a distributed, virtual company - we all set our own work schedule and work from home, coffee shops, or anywhere. We coordinate via Wikis, IRC, email, telepathy, and even face-to-face when possible. We don't bother with time sheets or other types of wage accounting -- we're a tight enough group that it would be obvious if someone wasn't doing her or his job.<p>We've noticed that some of the most accomplished people we know don't necessarily have polished resumes. As such, we don't care about formal education, age, gender, geographic location, resume, etc. We like smart people who love what they do and do it really well. Period.<p>If you're interested, please send a introduction letter to team+DDMMYYYY@spideroak.com making the obvious substitutions.","time":1312208723,"type":"comment"},{"by":"lylo","id":2831967,"parent":2831646,"text":"FreeAgent (Edinburgh, UK), intrepid developers of online accounting happiness, have several exciting new permanent openings at all levels on our engineering team:<p>Ruby/Rails Engineer\n<a href=\"http://www.freeagentcentral.com/company/jobs/rubyrails-engineer-product\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/rubyrails-engin...</a><p>Senior Platform Engineer\n<a href=\"http://www.freeagentcentral.com/company/jobs/senior-platform-engineer\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/senior-platform...</a><p>Accounting Engineer\n<a href=\"http://www.freeagentcentral.com/company/jobs/accounting-engineer-platform\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/accounting-engi...</a><p>Ruby/Rails Support Engineer\n<a href=\"http://www.freeagentcentral.com/company/jobs/rubyrails-engineer-support\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/rubyrails-engin...</a><p>Email us at jobs@freeagentcentral.com.  Remote working is a possibility for exceptional candidates.","time":1312204862,"type":"comment"},{"by":"Peroni","id":2831767,"kids":[2831920],"parent":2831646,"text":"London, UK<p>Firstly, I am a recruiter but I'm one of the honest few, have a look at previous submissions for any doubts.<p>The following are permanent positions in London that I am recruiting for. Mention HN when you contact me &#38; I'll happily disclose the company details once I confirm you're not another recruiter!<p>* Ruby Developers (Back-end mainly)<p>* Magento Developer<p>* Python Developers<p>* ColdFusion Developer (West London)<p>CONTRACT:<p>* Android &#38; iOS Devs<p>My email address is in my profile. Please don't forget to mention HN when contacting me.","time":1312201646,"type":"comment"},{"by":"squirrel","id":2831912,"parent":2831646,"text":"London (UK) and Boston (US). H1B<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're hiring developers and other smart folks of many kinds. See <a href=\"https://dev.youdevise.com\" rel=\"nofollow\">https://dev.youdevise.com</a> and <a href=\"http://www.youdevise.com/careers\" rel=\"nofollow\">http://www.youdevise.com/careers</a>.<p>While we don't have remote workers, we do help successful candidates relocate to London or Boston including arranging visas where needed. For example, last year we hired HN readers from Denmark and the US, and we moved a Polish employee to Boston.","time":1312204031,"type":"comment"},{"by":"kaib","id":2832036,"parent":2831646,"text":"Helsinki, Finland<p>Tinkercad is hiring for a number of technical positions (frontend, application, systems programmers, computational geometry, ops): <a href=\"http://dev.tinkercad.com/jobs/\" rel=\"nofollow\">http://dev.tinkercad.com/jobs/</a><p>We are a small team building a cloud based solid CAD for 3D printers. The team has written a bespoke cluster distributed geometry kernel and is looking for people to build the editor as well as the site. I'm an ex-Googler from Mountain View, here is a Tech Talk I did on the core tech a while back: <a href=\"http://www.youtube.com/watch?v=5aY4a9QnLhw\" rel=\"nofollow\">http://www.youtube.com/watch?v=5aY4a9QnLhw</a><p>You can try the product at: <a href=\"http://tinkercad.com\" rel=\"nofollow\">http://tinkercad.com</a><p>The work is very intensive so we like people to be local. However, if you are a good fit and willing to move I'm happy to get you relocated.<p>If you are interested get in touch with kai@tinkercad.com","time":1312205972,"type":"comment"},{"by":"kemayo","id":2833025,"parent":2831646,"text":"Really REMOTE. You don't even have to be in the USA.<p>deviantART (<a href=\"http://www.deviantart.com\" rel=\"nofollow\">http://www.deviantart.com</a>) wants developers. We're fully remote; there's no central office with a devteam located there. We expect all hires to be comfortable working in PHP, JavaScript, CSS, and SQL; we like our developers to be able to hack on any part of the site, rather than being frontend/backend specialists.<p>One exception to all that: there's an Infrastructure Engineer position which is located in Vancouver. It's C++/Java focused, and involves developing backend services used by the rest of the site.<p>We post information about our development process here sometimes: <a href=\"http://dt.deviantart.com/blog/\" rel=\"nofollow\">http://dt.deviantart.com/blog/</a><p>Apply here: <a href=\"http://deviantart.theresumator.com/apply?source=hn\" rel=\"nofollow\">http://deviantart.theresumator.com/apply?source=hn</a>","time":1312216408,"type":"comment"},{"by":"justin","id":2833306,"parent":2831646,"text":"San Francisco, CA<p>Justin.tv / TwitchTV hiring programmers to build the future of competitive gaming.<p>By leveraging our existing video infrastructure, which includes an international CDN and the world’s highest quality live video, Justin.tv has become the world's largest site for live competitive gaming.  We now need developers to join us in building out TwitchTV - our new website dedicated to competitive gaming. Our goal is to connect people around the games they love.<p>We are looking for talented engineers who are excited about the future of gaming.  We are still small, but growing extremely quickly.<p>Interested in learning more?  Email me directly: justin@justin.tv.<p>Justin","time":1312219141,"type":"comment"},{"by":"andraz","id":2833329,"kids":[2834906],"parent":2831646,"text":"Zemanta, Slovenia, EUROPE<p>Zemanta is changing how writing process works. Text editors stayed the same for last 20 years and it's time to make them smarter. Zemanta analyzes text being written in real time and helps the author with suggestions.\nYou can check a basic demo at <a href=\"http://zemanta.com/demo\" rel=\"nofollow\">http://zemanta.com/demo</a><p>We're looking for:<p>* frontend engineer (Javascript): Creating user interface for Zemanta's personal writing assistant\nWhile authors write their text, Zemanta analyzes it and displays suggestions inside their existing CMS. You'll be creating interfaces that integrate smoothly into existing content management systems and provide whole new way to author text. We are looking for combination of knowledge of JavaScript inside browser environment and familiarity with CS foundations like basic algorithms and data structures.<p>* backend research engineer: Research and development in natural language processing and information retrieval. Implementing and evaluating new algorithms in word sense disambiguation, trying out ideas to improve document-to-document search. Languages are Python, C++ and Java. Strong computer science background is a requirement, .<p>* backend infrastructure engineer: Scaling out the crawling infrastructure, help with the tooling for researchers (scaling on Hadoop), constantly improving deployment processes, logging and monitoring.<p>Zemanta’s research and engineering team is in Ljubljana, Slovenia. Our team is international. City is lately becoming a small start-up hub, so there are plethora of events related to tech, business and similar. You’ll have a hack of a time in Slovenia, we promise!<p>Address: jobs@zemanta.com","time":1312219417,"type":"comment"},{"by":"lpolovets","id":2831690,"kids":[2831892,2831734],"parent":2831646,"text":"Los Angeles or Bay Area or Shanghai preferred, but remote work is possible for exceptional candidates. Full-time only. If you're interested in working remotely, you must live in the U.S.<p>Factual aims to be the place where people meet to share, improve, and mash-up data. Our vision is to be an awesome and affordable data provider for startups and developers, so that they can focus on innovation instead of data acquisition.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). Last year we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, SimpleGeo, and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>Ideally you know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p><a href=\"http://www.factual.com/jobs\" rel=\"nofollow\">http://www.factual.com/jobs</a> or you can email me personally at leo -at- factual.com","time":1312200255,"type":"comment"},{"by":"dmarble","id":2833017,"parent":2831646,"text":"Palo Alto, CA LOCAL or REMOTE (full-time preferred)<p>- one advanced full-stack lead architect<p>- web/mobile UI designer<p>We have funding and are testing a restricted beta of our unique idea in the groups and events space, and are planning on launching our real-time product on the web, mobile web, and native mobile to a wide audience soon.<p>We've built a real-time stack of our own that bridges backbone.js &#60;-&#62; socket.io &#60;-&#62; gunicorn+gevent (through nginx) &#60;-&#62; django. As the stack matures, we may release the source. The web application is nearly all single-page architecture. We use coffeescript pretty much everywhere, including our javascript tests.<p>backend:  python, django, gevent, gunicorn, nginx, postgres<p>frontend: coffeescript, jQuery, backbone.js, socket.io, compass<p>We're looking for:<p>1. One advanced web jack-of-many-trades. You know a lot about several things from above and have at least tried your hand at a demo app using the rest. Backend/frontend/deployment. We'll be growing our user base very soon and need knowledge/experience scaling the above technologies. We're on the lookout for locals (or those who can move to the bay) who want senior developer ownership and can be mentors/leaders as we grow.<p>2. Talented web and mobile designers (referrals would also be good). Even with the nifty tech we're building, our app will probably live/die based on making an intuitive UI with fun and easy experience. There are several unique challenges in this product that require novel controls -- creativity is a must. Would be great if you have more than just design skills, but very high quality design is more important than ability to build it.<p>gmail - davidmarble","time":1312216323,"type":"comment"},{"by":"jordinl","id":2831914,"parent":2831646,"text":"Remember you can view the latest \"Who's hiring?\" post at <a href=\"http://hnhiring.com/\" rel=\"nofollow\">http://hnhiring.com/</a>","time":1312204047,"type":"comment"},{"by":"agotterer","id":2831900,"kids":[2833890],"parent":2831646,"text":"New York, NY<p>Lot18 is revolutionizing the way Americans buy wine. We provide a highly curated marketplace for wineries to sell direct to consumers.<p>We are hiring software engineers to join our small but growing 10 person dev team. You can apply by sending your resume and a link to your github to jobs@lot18.com.<p>Why you should work here:<p>- We work with a ton of open source technologies<p>- Well funded. We’ve raised $13.5M from tier one investors.<p>- People actually use our product. Over 400k users have joined since we launched in Nov 2010.<p>- It’s not social media. We have a real business model and do 7 figures a month in transactions.<p>- Benefits: Competitive salary, stock options, medical/dental paid in full, unlimited vacation, plenty of wine, lots of challenges and interesting business/tech problems to solve.","time":1312203871,"type":"comment"},{"by":"RichardPrice","id":2833674,"parent":2831646,"text":"San Francisco, CA<p>Academia.edu is hiring engineers.<p>Academia.edu is a platform for academics to connect and share research. On Academia.edu, academics can upload their papers, tag them with research interests, and distribute them instantly to the News Feeds of everyone following those research interests. On the flip side of this, academics see in their News Feeds in real time all papers that have been uploaded to the site in their research areas.<p>The platform is speeding up the distribution of papers amongst researchers around the world. The goal is for papers to be distributed as quickly within research communities around the world as photos are distributed within friend groups on Facebook.<p>Amongst other technologies, we work with Rails, Redis, MongoDB, Beanstalkd, Varnish, Solr, PostgreSQL, Node.js and Memcached. We currently have 1.9 million unique monthly visitors, and have doubled in traffic in the last 6 months. We like to hire people who:<p>* love engineering and building great products<p>* are intellectually inquisitive and think that speeding up research is a problem worth solving<p>* are fun and friendly<p>We're very happy to handle the H1B application process for foreign applicants. More information about the team, and about how we think about software engineering and product development, is here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. Feel free to email me directly at richard [at] academia.edu","time":1312223168,"type":"comment"},{"by":"chuckharmston","id":2831829,"parent":2831646,"text":"Washington, DC<p>Threespot - <a href=\"http://threespot.com\" rel=\"nofollow\">http://threespot.com</a><p>Threespot is a mid-sized digital communications agency that focuses on the do-gooding world: typically nonprofits, foundations, and government agencies. We're a tight-knit bunch of whip smart folks trying to do great things through our incredible array of clients, which includes: ACLU, Amnesty International, Brookings Institution, Conservation International, Humane Society, Knight Foundation, MacArthur Foundation, National Park Service, Peace Corps, Planned Parenthood, and Smithsonian Institution.<p>In the technology department we're hiring multiple developers for two positions:<p>Front-End Developer: <a href=\"http://www.threespot.com/about/jobs/developer/\" rel=\"nofollow\">http://www.threespot.com/about/jobs/developer/</a>\nWeb Software Engineer/Developer: <a href=\"http://www.threespot.com/about/jobs/sw-engineer/\" rel=\"nofollow\">http://www.threespot.com/about/jobs/sw-engineer/</a><p>Though we're open to candidates with all sorts of backgrounds, I think it's fair to say that we'd prefer backend folks with experience in one or more MVC frameworks, especially Django and Rails.<p>We're also hiring marketing folks, art directors and designers, UX leads, project managers, and more: <a href=\"http://www.threespot.com/about/\" rel=\"nofollow\">http://www.threespot.com/about/</a><p>chuck.harmston@threespot.com","time":1312202668,"type":"comment"},{"by":"jfarmer","id":2833737,"parent":2831646,"text":"San Francisco, CA<p>Hi HN!  I'm Jesse, one of the founders of Everlane.<p><a href=\"http://www.everlane.com\" rel=\"nofollow\">http://www.everlane.com</a><p>We're trying to re-imagine retail online and make it easy to find products that match your taste and style. Right now we're focused on mens fashion, but our ambitions are much larger.<p>pg did a good job of explaining the opportunity, here: <a href=\"http://ycombinator.com/rfs2.html\" rel=\"nofollow\">http://ycombinator.com/rfs2.html</a><p>We're building a members-only club where each month we produce and release a new collection of mens accessories and apparel.  Yes, we're selling our own products, directly to consumers.<p>This lets us offer a tie you'd buy for $80 at Nordstrom's for half that.  To produce in-style products we have a team of curators, run the largest men's fashion Tumblr, and are generally data-savvy people.<p>You can read my (somewhat out of date) blog, here: <a href=\"http://20bits.com\" rel=\"nofollow\">http://20bits.com</a><p>We're well-funded by the most stylish investors around.<p>We offer competitive salary, equity, and benefits.  Our office is in Union Square in San Francisco, CA.<p>If you're a hacker, love data, and/or love style shoot me an email at jesse@everlane.com and get in touch.<p>Also, if you're up to the challenge, here is a little exercise for you: <a href=\"http://static.everlane.com/everlane_exercise.pdf\" rel=\"nofollow\">http://static.everlane.com/everlane_exercise.pdf</a>","time":1312224026,"type":"comment"},{"by":"trimbo","id":2832159,"parent":2831646,"text":"Groupon<p>Palo Alto:<p>- Ruby on Rails developers:  <a href=\"http://www.groupon.com/jobs?jvi=oYNBVfw1,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oYNBVfw1,job</a><p>- Back end engineers:  <a href=\"http://www.groupon.com/jobs?jvi=oPZFVfw8,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oPZFVfw8,job</a><p>- Email infrastructure engineers:  <a href=\"http://www.groupon.com/jobs?jvi=o5xIVfwZ,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=o5xIVfwZ,job</a><p>- Big data infrastructure:  <a href=\"http://www.groupon.com/jobs?jvi=oinzVfwT,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oinzVfwT,job</a><p>- Android engineer:  <a href=\"http://www.groupon.com/jobs?jvi=owxLVfwt,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=owxLVfwt,job</a><p>- iOS engineer: <a href=\"http://www.groupon.com/jobs?jvi=oqzLVfwp,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oqzLVfwp,job</a><p>- Test engineer (performance): <a href=\"http://www.groupon.com/jobs?jvi=oHiwVfwa,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oHiwVfwa,job</a><p>Chicago, IL<p>- Ruby on Rails developers:  <a href=\"http://www.groupon.com/jobs?jvi=oxggVfwI,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oxggVfwI,job</a><p>- Back end engineers:  <a href=\"http://www.groupon.com/jobs?jvi=oQZFVfw9,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oQZFVfw9,job</a><p>And many, many more:  <a href=\"http://www.groupon.com/techjobs\" rel=\"nofollow\">http://www.groupon.com/techjobs</a>","time":1312207318,"type":"comment"},{"by":"bkudria","id":2832472,"kids":[2832898,2833909,2836084],"parent":2831646,"text":"San Francisco, CA - Yammer<p>Yammer is an awesome tech startup masquerading as an enterprise software vendor. We're building an enterprise social network (an internal communication and collaboration tool. Like Facebook.) and we need your help.<p>We build our product with insight and wisdom gained from the consumer social networking space, but we charge enterprise prices (and our customers pay them!) We're fighting some big serious competitors (Salesforce/Chatter, Jive, and VMWare/Socialcast) and this space has never been more exciting.<p>Yammer is really changing the way people get work done. We have actual challenges to overcome and we're doing our best to make a kick-ass product that makes our users happy.<p>Tech we use: Ruby/Rails, Scala, and JavaScript. We have Obj-C and C# stuff too.<p>Some bullet points for you to skim:\n• Amazing group of smart engineers to work with. Really.\n• We hack in Ruby/Rails, Scala/JVM, Javascript/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT/Sharepoint stuff.\n• Competitive compensation. Enough said.\n• Delicious catered lunch and dinner daily, with a 3PM snack cart. Also a fully-stocked beer-and-beverage fridge.\n• Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>Some links for you to read more:\n• Our jobs page: <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a>\n• Our Engineering blog: <a href=\"http://eng.yammer.com/\" rel=\"nofollow\">http://eng.yammer.com/</a>\n• A blog post about why it's so awesome to work here: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.html\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a><p>Feel free to get in touch: bkudria@yammer-inc.com","time":1312211267,"type":"comment"},{"by":"snowmaker","id":2833172,"parent":2831646,"text":"San Francisco, CA<p>Scribd (social publishing, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies. We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)\n* Javascript\n* iOS\n* Machine Learning / Data mining kinds of problems\n* Technical recruiting (yes, we're hiring hackers to do this too!)<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.<p>We're well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very flat organizational structure that gives a lot of product ownership to engineers, and a really terrific team.<p>Last week we launched our first iPhone app, called \"Float\", which hopes to make reading a better experience.  If you're a fan of reading apps like Instapaper and Reeder, you're already familiar with what we're doing.  See <a href=\"http://tcrn.ch/pCwT4c\" rel=\"nofollow\">http://tcrn.ch/pCwT4c</a> for more.<p>Feel free to email me directly: jared@scribd.com<p>Jared<p>ps. H1B no problem","time":1312217685,"type":"comment"},{"by":"ipster","id":2832213,"parent":2831646,"text":"San Francisco, CA / Los Angeles, CA / REMOTE / H1B / TN / INTERN<p>AllTrails is hiring! We're building Yelp for the outdoors - A way to discover hiking trails and outdoor activities around you. Let's get more people exploring the outdoors!<p>Our team was AngelPad incubated, is funded by 500Startups and consists of a team from Google / Microsoft / Facebook and other startups.<p>We have the #1 outdoors app in the Apple store and our android app is launching this month.<p>We're looking for Designers / Front-end Engineers, Back-end Rails Engineers, and Mobile Developers (Android and iOS)<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you.<p>justin@alltrails.com","time":1312208081,"type":"comment"},{"by":"ginkgoo","id":2832006,"kids":[2832030,2832947],"parent":2831646,"text":"Boston, MA - Ginkgo BioWorks is a synthetic biology startup out of MIT that is offering programming internships to develop CAD tools and software to support our platform for genetic engineering of organisms for use in fuels, medicine, and foods.  If you want to work on something other than photo-sharing, this might be for you:\n<a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a> \n<a href=\"https://ginkgo.resumetracker.com/public/job_detail/84\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/84</a>\nkeywords: INTERN, DNA hacker, biotech","time":1312205502,"type":"comment"},{"by":"amirnathoo","id":2832317,"parent":2831646,"text":"London &#38; San Francisco: Javascript, iOS, Bus dev intern<p>WebMynd is doubling revenue every 3 months, team every 6. Join us!<p>Don't build the next social coupons site for pets, apply to solve tough problems for real customers. We're a team of 9, growing fast, who like to work hard, play hard, and make the world a better place for devs.\nWe're hiring Javascript, iOS and IE add-on developers, and a bus devt intern, in London and San Francisco: <a href=\"http://www.webmynd.com/jobs.php\" rel=\"nofollow\">http://www.webmynd.com/jobs.php</a><p>We'll be 15 by the end of the year. We make cross-platform app development simple - it's like HTML5 on speed: <a href=\"http://www.webmynd.com/html5\" rel=\"nofollow\">http://www.webmynd.com/html5</a><p>We're well funded with paying customers, so you'll get proper pay, benefits and recognition. As an international founding team, we've found work trips away to be hugely productive and fun - we're going to Montreal in August and have been to Puerto Vallarta, Barcelona, Vienna, Playa del Carmen and Berlin in the last 12 months.<p>Join us! Email jobs@webmynd.com with links to projects you've worked on and why you'd be great for the role.","time":1312209273,"type":"comment"},{"by":"bijanv","id":2831979,"parent":2831646,"text":"Toronto, Canada<p>EventMobi (<a href=\"http://www.eventmobi.com\" rel=\"nofollow\">http://www.eventmobi.com</a>) is a crazy fast growing startup changing the way attendees experience events, conferences, festivals with smartphones. Hundreds of thousands of attendees have used our platform and hundreds if not millions more will be using it soon!<p>We're looking for a backend web engineer to help us scale our system, optimize our slow code, take our platform to distributed systems and help us build some of the coolest new features being deployed for upcoming events.<p>We're offering stock options for this position on top of our already competitive salaries, this is going to be a core position for our team as we grow!<p>More information can be found here: <a href=\"http://blog.eventmobi.com/eventmobi-is-looking-for-engineers/\" rel=\"nofollow\">http://blog.eventmobi.com/eventmobi-is-looking-for-engineers...</a><p>We're also looking for any interns that want to work with a fun team and get real hands on experience building core features. Experience with PHP and frontend code would be useful!<p>If you have questions, feel free to send them to work@eventmobi.com","time":1312205064,"type":"comment"},{"by":"jerryr","id":2832822,"parent":2831646,"text":"San Francisco, CA - MindTribe Product Engineering, Inc.<p>Hi, I’m MindTribe’s director of Software Engineering. I’m looking for people who enjoy learning and making. We’re a small company, and I’m looking for people with whom I would personally like to work and who want to work with me.<p><i>Here are the tools I use regularly:</i>\nThe C programming language (specifically ISO/IEC 9899:1990);\nEclipse, Make, Subversion, Git, Python;\nLinux, Embedded Linux, Android, iOS;\nARM processors (TI OMAP, TI Stellaris, NXP LPC);\nAtmel AVR/AVR32, Microchip PIC, TI MSP430, Cypress PSoC<p><i>Here is what I enjoy doing at work:</i>\nWriting embedded software that runs on cool hardware;\nFiguring out how to apply agile techniques such as test-riven development to embedded product development;\nReducing regressions and supporting customer development with agile techniques;\nDeveloping embedded libraries for things like USB, TCP/IP, graphics displays, sprites, fonts, encryption, etc.;\nHaving long, dorky conversations with coworkers about programming languages, physics, estimating Facebook’s relative revenue distribution between advertising and games, etc.<p><i>Here is what I enjoy doing outside of work:</i>\nHiking, walking around San Francisco;\nPseudonymous humor blogging;\nCooking and baking;\nPhotography;\nReading. Recently: “Test Driven Development for Embedded C”, “The Clean Coder”, “The Four Steps to the Epiphany”, “The Art of Racing in the Rain”, and “Norwegian Wood”<p>You can see examples of how I’ve applied my tools and passion here: <a href=\"http://mindtribe.com/portfolio/\" rel=\"nofollow\">http://mindtribe.com/portfolio/</a><p>You don’t have to use the same tools and you don’t have to enjoy the same things. But if you’re excited about similar stuff, drop me a line at hn@mindtribe.com to let me know.<p>--Jerry","time":1312214430,"type":"comment"},{"by":"derwiki","id":2835126,"parent":2831646,"text":"San Francisco, CA - Causes<p><a href=\"http://www.causes.com/join_us\" rel=\"nofollow\">http://www.causes.com/join_us</a> ! We're a small engineering team trying to save the world! with Ruby. You get a lot of freedom to work on what YOU think is the most important thing you can do for the company. If that means contributing or starting your own open source project, so be it (<a href=\"http://github.com/causes/\" rel=\"nofollow\">http://github.com/causes/</a> has grown by three new projects in the last month alone)<p>You can apply through the web site or by contacting me, adam&#60;at&#62;causes.com","time":1312244216,"type":"comment"},{"by":"jedberg","id":2833605,"parent":2831646,"text":"Los Gatos, CA<p>I'm looking for people to join me at Netflix and keep the streaming service running worldwide.  You can read the full description here:<p><a href=\"http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr\" rel=\"nofollow\">http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr</a><p>Some highlights:<p>You possess these qualities:<p>- You see the big picture delivering a 24x7 service<p>- You are effective working with multiple teams<p>- You have high standards in everything you do<p>- You can balance multiple tasks<p>You have these skills:<p>- Great communication skills, both verbal and written<p>- In-depth experience operating a 24x7 production environment<p>- Fluent in Linux: RedHat, CentOS, Fedora, Ubuntu<p>- Strong scripting skills in shell, Perl and Python<p>- Familiar with the Java platform, especially JVM configuration<p>- Knowledgeable in Linux packaging tools: rpm, yum, dpkg, apt<p>- Ability to quickly triage problems, determine root cause and drive resolution<p>- Ability to keep a cool head under pressure and effectively participate in system down crisis situations<p>You may even have these skills:<p>- Prior experience with Amazon EC2/S3 or other cloud service providers is a plus<p>- Systems deployment and service management automation tools and methodologies","time":1312222434,"type":"comment"},{"by":"camtarn","id":2831939,"parent":2831646,"text":"Edinburgh, UK - FULL-TIME, INTERN positions available<p>Amazon Development Centre Scotland are looking for candidates for full-time, intern and student summer positions. We've just moved into our shiny new office in the city centre (Waverley Gate, right next to the station).<p><a href=\"http://amazondc.com/\" rel=\"nofollow\">http://amazondc.com/</a><p>We're also hosting TechMeetup Edinburgh this month (Aug 10th) :)<p><a href=\"http://www.techmeetup.co.uk/\" rel=\"nofollow\">http://www.techmeetup.co.uk/</a>","time":1312204537,"type":"comment"},{"by":"jnovek","id":2831915,"parent":2831646,"text":"OwnLocal (YC W10) in Austin, TX<p>Working through newspapers, we make the web less scary for small businesses.<p>We're looking for:<p>- A full-time Web Designer with a strong portfolio that indicates a bold and consistent style.  This designer should be prepared to participate in user-experience changing product decisions.  Good HTML and CSS is a bonus.<p>- A full-time PHP Engineer, with an emphasis on WordPress.  In addition to a strong understanding of PHP and good software engineering principles, this individual will be working on a WordPress modification project and should have some background modifying and/or writing plugins for WordPress.<p>Drop us a note: jobs@ownlocal.com.  We don't care too much about resumes, we'll ask for one later if you look like a good fit.  Instead, tell us about yourself and about some projects that you've done.","time":1312204068,"type":"comment"},{"by":"Aloisius","id":2831889,"kids":[2833023,2833618],"parent":2831646,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 8 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Objective-C engineers for iPad development\n  * Web developers (we're a Django shop)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees. H1B ok.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a><p>Questions - jobs@seatme.com","time":1312203698,"type":"comment"},{"by":"neiljohnson","id":2831854,"parent":2831646,"text":"London<p>OpenMarket are looking for Java developers to work on mobile messaging/payments platforms.<p>We offer hard problems, lots of autonomy, an engineering driven culture and full control over product delivery from design through to deployment.<p>See <a href=\"http://www.mxtelecom.com/uk/careers/roles/softdev\" rel=\"nofollow\">http://www.mxtelecom.com/uk/careers/roles/softdev</a> for more details or contact me directly at neil.johnson //at// openmarket.com","time":1312203144,"type":"comment"},{"by":"famousactress","id":2833055,"parent":2831646,"text":"San Francisco, CA (REMOTE available for the right candidate)<p>Elation EMR ( <a href=\"http://www.elationemr.com\" rel=\"nofollow\">http://www.elationemr.com</a> )<p>We're working on incredibly smart and usable web based tools for physicians.<p>We're angel funded and have an incredible list of investors.<p>We're building with Python, Django, javascript, jQuery, Redis, MySQL, Java, and some other stuff.<p>We're live in a number of practices, and there's still loads of really interesting things to build and make better!<p>We're looking add one or two more people to our incredible team.<p>.<p>Interested?<p>More details here: <a href=\"http://elationemr.com\" rel=\"nofollow\">http://elationemr.com</a>","time":1312216667,"type":"comment"},{"by":"mikebabineau","id":2832464,"parent":2831646,"text":"Redwood Shores, CA (SF Bay Area) - Engineers and more<p>BioWare SF is hiring! Formerly known as EA2D, we are now the online/social arm of the BioWare group.<p>We're working on exciting projects:<p>* Social games for gamers (from BioWare and others)<p>* Games API (web services for online games)<p>We're small (30 people) and scrappy. And we're growing fast: 0-200 servers in the past 8 months. Tech stack is primarily AS3/Java backed by MongoDB, but we're writing more in Python, JavaScript, and Ruby. We have a highly automated infrastructure running on AWS (EC2 w/ELBs and ASGs, EMR, SQS, Beanstalk, etc., plus more than a few super-secret/unreleased Amazon features). Buzzword potpourri includes Chef, node.js, Google App Engine, Hive, Graphite, Tomcat, Spring, Ivy, Hudson, GitHub, Pingdom, Loggly, PagerDuty, and continuous deployment. &#60;3 DevOps. We have a small but growing list of open source projects (see <a href=\"http://github.com/ea2d\" rel=\"nofollow\">http://github.com/ea2d</a> and <a href=\"http://eng.ea2d.com/\" rel=\"nofollow\">http://eng.ea2d.com/</a>).<p>We need platform, systems, and mobile engineers.  Detailed listings are here: <a href=\"https://jobs.ea.com/search/advanced.do?q=bioware&#38;globalRegionID=a1W500000004CClEAM&#38;locationID=a1W500000004CAnEAM&#38;jobCategoryID=\" rel=\"nofollow\">https://jobs.ea.com/search/advanced.do?q=bioware&#38;globalR...</a><p>I lead the platform engineering team. Drop me a line if you're interested: mikeb@ea2d.com","time":1312211164,"type":"comment"},{"by":"baycitizen","id":2834868,"parent":2831646,"text":"San Francisco, CA<p>Do you want to help build one of the world's most innovative news projects? Do you want to become a key member of a small, high-caliber team and work toward a great cause? The Bay Citizen team is redefining the model for journalism and is made up of a talented team of area experts. We need you to join our technology team to help build the future of online journalism with Armstrong - a new, open source platform for news.<p>We are looking for a Senior Python Developer who will play a critical role in developing a robust and flexible publishing platform that powers our 24x7 editorial organization. We will develop new journalism tools and innovative ways for people to interact with news and data from the web, mobile and other distribution platforms.<p>Responsibilities:\n1.  Develop and maintain the publishing platform with a small team\n2.  Take ownership and drive data/visualization projects to conclusion\n3.  Code primarily in Python, HTML, Javascript, and CSS\n4.  Make decisions independently and iterate rapidly\n5.  Be creative and self-motivated<p>Requirements:\n1.  You’re a hacker that gets thing done.\n2.  Strong working knowledge of Django and Python (at least 2 years experience)\n3.  Significant experience with databases (MySQL, PostgreSQL)\n4.  Familiarity with jQuery and/or other Javascript frameworks\n5.  Demonstrated ability to build impressive, non-trivial web applications.<p>Nice-to-haves:\n1.  Experience with Amazon Web Services running Apache, Nginx and memcached\n2.  Development experience consuming or providing web service APIs\n3.  Experience with distributed version control systems (Git, Mercurial)\n4.  Interest in Mobile Application Development (iOS, Android) \n5.  Prior start-up experience.<p>Also, if you’ve built anything interesting outside of work/school, we want to see it. Links to web apps, git repos, portfolios, etc are greatly appreciated.<p>To apply for this position, email brian_kelley@baycitizen.org with your resume and cover letter.<p>Company Description<p>The Bay Citizen is a nonprofit, nonpartisan, member-supported news organization. In collaboration with the UC Berkeley Graduate School of Journalism, The New York Times, and other media organizations serving the Bay Area, our mission is to enhance civic and community news coverage in the Bay Area, stimulate innovation in journalism, and foster civic engagement.","time":1312238842,"type":"comment"},{"by":"remi","id":2831728,"parent":2831646,"text":"Quebec City, Quebec, Canada<p>We are looking for iOS, Android and other mobile developers, as well as Ruby/whatever backend and HTML/CSS/JavaScript frontend developers. We're a team of passionate people working with large companies on exciting and innovative projects, as well as out own homemade products.<p>We are dedicated to building the best place to work at :)<p>Our jobs page, in french : <a href=\"http://vie.mirego.com/fr/emplois\" rel=\"nofollow\">http://vie.mirego.com/fr/emplois</a>","time":1312201047,"type":"comment"},{"by":"steilpass","id":2831764,"parent":2831646,"text":"Cologne, Germany<p>We are building an open ecosystem to exchange digital advertisements: <a href=\"http://adcloud.com\" rel=\"nofollow\">http://adcloud.com</a><p>I am looking mainly for good developers. Language background is not important as long as you have web experience. To drop some current topics: node.js, riak, ec2, couch, php, mysql cluster<p>Ping me &#38; visit <a href=\"http://adcloud.de/dev\" rel=\"nofollow\">http://adcloud.de/dev</a> for more infos.","time":1312201579,"type":"comment"},{"by":"jmulder","id":2832026,"parent":2831646,"text":"Amsterdam, The Netherlands<p>Funda is looking for a full-time User Experience Designer and Front-end Developer. Both positions will be in our current User Experience team, where we already have three designers.<p>Especially for the front-end developer we are looking for someone to head our front-end code, take responsibility and take the quality of the code to the next level. Feeling for interaction design would be an added bonus, as part of your time you'll be working along with our designers.<p>All design (3 people) and development (12 developers) is done in-house. The company itself counts about 50-55 employees.<p>More information: www.funda.nl/vacatures (Dutch)<p>--<p>Funda Real Estate B.V. is the company behind the leading real estate listing website of The Netherlands: funda.nl. We also maintain fundainbusiness.nl for commercial properties, fundalandelijk.nl for agricultural properties, and fundadesk.nl as a back office for Dutch real estate agents.<p>Just for funda.nl we currently average 420,000 unique visits a day, serving about 10 million page views a day. It sure is a challenge with big impact -- working at funda always gives you something to talk about at birthday parties.","time":1312205795,"type":"comment"},{"by":"kgosser","id":2831887,"kids":[2832208],"parent":2831646,"text":"Milwaukee, WI<p>Full time developer. Most of our stuff is in Java, but we have some Lua and other projects as well.<p>HarQen is our company: <a href=\"http://www.harqen.com\" rel=\"nofollow\">http://www.harqen.com</a><p>We're a voice asset management platform. Think of Twilio as only step 1 of 10 to the end goal of making voice a transaction that's actually useful after the call hangs up.<p>kris@harqen.com ---- feel free to email me personally to find out more.","time":1312203687,"type":"comment"},{"by":"mdkess","id":2833237,"parent":2831646,"text":"New York, NY - Broadway Technology<p>Profitable 40 person software company creating a successful trading platform for fixed income securities and others (we are not a hedge fund, we don't trade ourselves). Located right by The Bull on Broadway in Manhattan. Will sponsor TN-1, and some opportunity to work remote.<p><a href=\"http://broadwaytechnology.com/careers\" rel=\"nofollow\">http://broadwaytechnology.com/careers</a>","time":1312218282,"type":"comment"},{"by":"spulec","id":2832359,"parent":2831646,"text":"New York, NY - Yipit<p>Just off raising $6 million, we are looking for the 12th member of the team(when we posted this last month, we were looking for our 8th).<p>Come join us on the ground floor of one of the best startups in New York. Right now, great companies like 10Gen, FourSquare, Hunch, SeatGeek, and YCharts are all here growing together. Silicon Alley is going through a renaissance and you can be part of it.<p>-UI Lead Architect: Our interface sits on top of over 350 daily deal services and is used by hundreds of thousands of people. We need you to own that interface.<p>-HTML5/CSS3/jQuery Developer: All user-facing activity relies on these technologies. We will commit the full resources of the team to supporting you.<p>-Python(Django) Developers: We work with the latest technology including: Amazon Web Services, RabbitMQ, Gunicorn, Nginx, and Git. This should excite you.\nGo to <a href=\"http://yipit.com/about/jobs/\" rel=\"nofollow\">http://yipit.com/about/jobs/</a> to apply. Email steve@yipit.com with any questions.","time":1312209681,"type":"comment"},{"by":"apgwoz","id":2832063,"parent":2831646,"text":"Meetup (<a href=\"http://www.meetup.com/jobs\" rel=\"nofollow\">http://www.meetup.com/jobs</a>) New York, NY, basically, for everything. We're profitable,  have 10% time and quarterly 2 day hackathons, and roof access! Best of all we actually make a difference. Free free to contact me (my email is in my profile) and I can help you from there.","time":1312206255,"type":"comment"},{"by":"dctanner","id":2832175,"parent":2831646,"text":"London, UK<p>Pusher - <a href=\"http://pusher.com\" rel=\"nofollow\">http://pusher.com</a><p>We believe WebSocket communication is going to evolve the way the web works. Our aim is to be the first port of call for developers looking to build realtime functionality.<p>If you share our enthusiasm for the realtime web, want to be part of this grand ideal, and can abide our continued over-use of the word “awesome”, drop us a line.<p>We need developers and ops peeps to work on making the Pusher platform more awesome, and more scalable. Previous experience with distributed systems is essential, whether it be Ruby, Node.js or Erlang.<p>We’re still a smallish team (7 in total) and there are great opportunities for having an influence in something really exciting. We’re based in London (EC1), and we’re looking for people who can work on site with us.<p><a href=\"http://jobs.github.com/positions/fd968a9a-b79d-11e0-95ed-aadcc5809197\" rel=\"nofollow\">http://jobs.github.com/positions/fd968a9a-b79d-11e0-95ed-aad...</a>","time":1312207530,"type":"comment"},{"by":"xkenneth86","id":2832161,"parent":2831646,"text":"Houston, Texas<p>Erdos Miller is looking to hire software and hardware engineers. (www.erdosmiller.com)<p>We are a consulting group located in Houston that specializes in designing electronics and software for the Oil and Gas industry.<p>If you are hardware oriented, we're looking for experience with analog and digital design, micro-controllers, C/ASM development, PCB layout, schematic capture, and Simulation.<p>If you are software oriented we're looking for understanding of basic data-structures, ability to write atleast a couple of a languages, and some past reference-able work. (Hopefully on github or the like.) We primarily develop software in C#/Python/C and LabVIEW.<p>If you're LabVIEW oriented we're looking for a good understanding of hardware I/O, LabVIEW concepts like producer/consumer, and some example work.<p>We really prefer someone to be local, primarily as you'll need access to lots of equipment to get work done.<p>Please email me at ken@erdosmiller.com if you're interested.","time":1312207327,"type":"comment"},{"by":"LiveTheDream","id":2832891,"parent":2831646,"text":"NYC (Manhattan)<p>The Company: Tapad - smart advertising across multiple devices. We're developing very interesting new strategies and tactics for effective advertising in the ever-changing and ever-growing world of consumer devices.<p>The Engineering: The platform is written in Scala, handling tens of thousands of requests per second with 99th percentile response rates under 10ms. Well-informed bidding decisions are made for each one of those requests. We analyze enormous amounts of data to make the system work as efficiently as possible.<p>The People: We're looking for intelligent, creative, energetic people. Experience with any of the following is good: Scala, the JVM, JavaScript, machine learning, statistics, realtime bidding systems.<p>More information: <a href=\"http://www.tapad.com/careers\" rel=\"nofollow\">http://www.tapad.com/careers</a><p>Get in touch: toby at tapad dot com. Put the MD5 hash of the word \"Tapad\" in the subject :)","time":1312215092,"type":"comment"},{"by":"techscruggs","id":2831752,"parent":2831646,"text":"Austin, TX<p>AcademicWorks is a small, funded and rapidly growing startup.  We are working with the latest versions of Postgres, Redis, Rails &#38; Ruby to help college students get scholarships.  You can learn more here: <a href=\"http://www.academicworks.com/rubyist.html\" rel=\"nofollow\">http://www.academicworks.com/rubyist.html</a>","time":1312201444,"type":"comment"},{"by":"AngryParsley","id":2832730,"kids":[2833505],"parent":2831646,"text":"San Francisco, CA - Rackspace<p>Rackspace acquired Cloudkick (YC Winter '09) in December, and we're hiring at our San Francisco office. Openings include Javascript, Python/Django, and Node.js developers.<p>The full list of openings is here: <a href=\"http://rackertalent.com/san-francisco/\" rel=\"nofollow\">http://rackertalent.com/san-francisco/</a>","time":1312213691,"type":"comment"},{"by":"Littleme","id":2831932,"parent":2831646,"text":"San Francisco/Palo Alto/Anywhere<p>Cloudera is hiring -- we have a ton of open positions in areas including business development, engineering, solutions architects, IT, product management, and training. Info is here: <a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a>","time":1312204391,"type":"comment"},{"by":"RyanGWU82","id":2833508,"parent":2831646,"text":"San Mateo, CA<p>PBworks is hiring a VP of Engineering!<p>PBworks is looking to hire a world-class VP of Engineering to direct, manage, and grow our engineering team at PBworks and join a great management team. Candidates should have knowledge and experience with Software-as-a-Service best practices and methodologies, such as frequent deploys, functional testing, and automated rollbacks. Candidates should have at least five years of management experience but still be active programmers with code-review and prototyping level strengths in a modern scripting language (such as Ruby, Python, or PHP) as well as fluency in modern HTML, CSS, and Javascript. Strong preference will be given for LAMP stack proficiency. Extra consideration will be given to candidates with experience hosting software for very large clients and candidates with UX skills.<p>Candidate should have experience building and executing effective agile product development and project management strategies, and continuing to build a top-notch, highly, innovative team. Experience with workspaces and team collaboration software in general and PBworks in particular is a strong plus. Master's in Computer Science preferred.<p>You'll be in charge of one of the most powerful, scalable, popular, and sophisticated hosted collaboration tools in existence: with over 4m users a month, hundreds of terabytes of user data, billions of recorded actions, and a million and a half groups. Our team is small but highly effective; every engineer in the group is capable of working on a wide diversity of projects - from low level systems debugging to SQL optimization, to best practices in modern Javascript and CSS. You'll be redefining the future of how our customers get their work done - everything from collaborative medicine to treat cancer patients to innovative creative teams shaping the next great TV commercial or videogame to university research labs, and even a few un-stodgy law firms.<p>We'd love to have you come help our team win and grow!<p>To apply, email jobs-vpeng+hn@pbworks.com.","time":1312221417,"type":"comment"},{"by":"pashields","id":2831659,"parent":2831646,"text":"Floop - New Haven, CT or remote (us only, northeast preferred) - iOS, Android, OpenGL, Mobile app design (Information Architecture through gradients and icons)\nWe're a funded \"stealth\" startup building what we call a social opinion platform. Our iPhone app will be launching in the next two weeks. We'll be gathering feedback and iterating quickly, so we'll need some help! We're interested in anyone with one or more of the skills listed above. We're low overhead, flexible on hours, and all we really care about is getting shit done.\nPlease submit code/github/portfolio if you are interested. We'll be happy to add you to our testflight before we chat so you can see what we are all about. Good compensation, equity for right person. pat at floop dot com.","time":1312199708,"type":"comment"},{"by":"mahyarm","id":2832851,"parent":2831646,"text":"For everyone saying US only remote, don't forget Canadians (and Mexicans) who are often at the border as far as flight distance and can get TN Visas too.","time":1312214674,"type":"comment"},{"by":"cvinson","id":2833963,"parent":2831646,"text":"Anywhere (we're based in Montreal)<p>Bandzoogle is hiring an Interaction Designer.<p>We build tools that help musicians succeed online.  Our app powers tens of thousands of artist websites and helps them make a living by selling their music and growing their fan base.  We've been “bootstrapped, profitable, and proud” since 2003 and are growing fast.<p>As our design lead, you’ll own the visual Bandzoogle experience -- from the front end to emails to the UX of the app.  We’ve recently revamped our entire codebase to Rails 3 -- now we need you to revamp the look of our app from the ground up.<p>Our 10-member team is spread across Canada, UK and USA; we work where we love to be. Remote work welcome!<p>More details: <a href=\"http://jobs.37signals.com/jobs/9438\" rel=\"nofollow\">http://jobs.37signals.com/jobs/9438</a>","time":1312226956,"type":"comment"},{"by":"PanMan","id":2831904,"parent":2831646,"text":"Amsterdam, NL<p>Both INTERN and full-time positions.\nWe recently launched Skylines at Techcrunch disrupt, and our mission is to organize the world's real time photos. \nWe currently process over a million pictures a day, and generate a lot of data in the process.\nWe're looking for people who can help us scale and analyse this data. Mostly backend developers on various technologies, ranging from SOLR, Hadoop to PHP, MySQL and Redis. \nWe're also looking for a front-end developer to help us build cool products around this data.\nWe're based in the center of beautiful Amsterdam in an active startup community. \nCurrent alpha product at <a href=\"http://skylin.es\" rel=\"nofollow\">http://skylin.es</a>,<p>Questions? Shoot me an email at martijn@skylin.es.","time":1312203933,"type":"comment"},{"by":"yummyfajitas","id":2831731,"parent":2831646,"text":"Pune, India - we are looking for guys/girls who are smart and get things done.<p>We are building a search engine for fashion. We have an office in Model Colony. Currently we are 10 people (CEO, CTO, adviser, web designer, 6 content creators), with lots of work to be done and not enough of us to go around.<p>The main thing we need now is a general purpose developer. In the past month or so I've crunched half a TB of data in hadoop, build an html5/canvas app, and build a system for human oracles to properly categorize our data. We use javascript, python/django, and hadoop, though we really don't care if you've never touched any of those technologies.<p>Contact info is in my profile. Send a link to your github (or similar portfolio) if you are interested.","time":1312201092,"type":"comment"},{"by":"ecaron","id":2831699,"parent":2831646,"text":"LinkUp.com Search Engine - Minneapolis, MN ($5,000 to relocate, $2,000 referral bonus) - Lead PHP developer focusing on new feature developlemnt<p>Recently finished a large round of funding, looking for a 80% onsite developer to lead our small, but amazing, development staff and pursue new features to help jobseekers make their task suck less! Work can involve whatever seems necessary or interesting (from iPhone to Facebook to 2-page standalone domains for a specific feature.) We use git, Solr, many Amazon AWS services - come join our team!!! (Or email eric@linkup.com if you have more questions)<p>Apply at <a href=\"http://linkup.jobs/?&#38;a=showJob&#38;ID=4471\" rel=\"nofollow\">http://linkup.jobs/?&#38;a=showJob&#38;ID=4471</a>","time":1312200447,"type":"comment"},{"by":"dget","id":2832532,"parent":2831646,"text":"New York, NY<p>Coursekit is trying to kill an entrenched incumbent (<a href=\"http://blackboard.com/\" rel=\"nofollow\">http://blackboard.com/</a>) and bring social networking to education, and we want you to help build it.<p>We're looking for an engineer who is excited about joining a young team that's shaking up how education works. We always try using the best tool for the job. For now, we use CoffeeScript, Python, Node.js, Redis, as well as a still-unreleased CoffeeScript framework. If working with these technologies excites you, talk to us.<p>Apply here: <a href=\"http://coursekit.theapplicants.com/j-11-222\" rel=\"nofollow\">http://coursekit.theapplicants.com/j-11-222</a>\nOr if you have any questions, shoot me an email at dan@coursekit.com","time":1312211800,"type":"comment"},{"by":"sim0n","id":2831724,"parent":2831646,"text":"San Francisco, CA<p>BakedCode (YC S11) is hiring both iOS and Backend developers to join our currently 2 man team. We build many types of apps but the product you'd be working on primarily is Interstate which is a project management tool used by the likes of Squarespace, Twitter, Uber, DailyBooth and many more great companies. We work with PHP (5.3.6), MongoDB, Redis, Memcached, NGiNX, and Node.js on Amazon EC2 so the more of those you know the better (for the backend developer position)!<p>You'll of course get great equity, a competitive salary and we can ensure you'll have a great time working with us. More information can be found at <a href=\"http://bakedcode.com/jobs\" rel=\"nofollow\">http://bakedcode.com/jobs</a>","time":1312200967,"type":"comment"},{"by":"StyleOwner","id":2832863,"parent":2831646,"text":"StyleOwner is hiring.  email matt@styleowner.com<p>Where: San Francisco, CA and Ann Arbor, MI<p>Remote / Telecommuters also considered.<p>StyleOwner is looking for highly skilled, top 1% developers (frontend and backend positions available). Salary: highly competitive. www.styleowner.com. A lot of people think we’re going to be the next big thing.<p>Accel Partners has funded us and Bob Pittman (the founder of MTV Networks) recently became an investor. Social media is huge, and the best marketer is a recommendation from a friend or family. So why not combine the two? StyleOwner is empowering the Facebook generation to become entrepreneurs and start their own online store. We’ve partnered with amazing brands to create “the itunes of fashions” and allow our StylEpreneurs to curate their own store, share it with their sphere of influence, and earn 10% commission on everything they sell. We’re reinventing retail — true social selling for the first time.<p>We’ll show you our concept deck and give you a demo of our site and business plan. You show us your Github profile.<p>Our technology stack is primarily ruby on the backend and html/css/js on the frontend. We use backbone.js, sinatra, datamapper, jquery, etc. Experience with git or a willingness to learn is a must.<p>We’re looking for someone who we can pay a top salary plus very nice perks, equity, etc. We want you to join our awesome team and make bring this disruptive form of online shopping to reality. As an added bonus, Sunday is funday at StyleOwner. StyleOwner will pay for your fun on Sundays. Do whatever you love to do: fancy meal, rock climbing, baseball game, day trip etc (as long as it’s legal of course) submit receipts and we will pay up to $250 per Sunday.<p>Our development team is in San Francisco and our main headquarters is in NYC.<p>Please send us a link to your github profile, resume, and some references. We’d love to meet with you, buy you a coffee or a beer, and show you some of our code and figure out if it’s a good fit.<p>We’ll start out with a chat over the phone so that you can ask any questions you may have after reading this posting.","time":1312214794,"type":"comment"},{"by":"danielepolencic","id":2832477,"parent":2831646,"text":"London, UK: Web Developer, PHP developer<p>MadBid.com is looking for a front-end developer to join our young and innovative organization in the heart of London. You'll work with smart and creative people who are passionate about their job. You'll get all the advantages of working in a small team, where you and your expertise will play a key role in the development process. You'll meet exciting challenges ranging from load time optimization to API development and user experience issues.<p><a href=\"http://uk.madbid.com/careers/\" rel=\"nofollow\">http://uk.madbid.com/careers/</a>","time":1312211313,"type":"comment"},{"by":"eekfuh","id":2832967,"parent":2831646,"text":"Salt Lake City, Utah - Solera Networks<p>We are a vc-funded network security forensics company.\nWe have a great engineering team, in an almost all engineering company (80% are engineers).\nWe have the need for some great people, with a wide range of talent. We have needs in kernel development, systems code (C/C++), handle large volumes of data (100's of tB) to web front end interface development.<p>Full benefits. Lots of vacation. Great people to spend your day with.<p><a href=\"http://www.soleranetworks.com/company/careers\" rel=\"nofollow\">http://www.soleranetworks.com/company/careers</a><p>(Also we love Zombies)","time":1312215820,"type":"comment"},{"by":"tonyvt2005","id":2833623,"parent":2831646,"text":"Herndon, VA<p>TroopSwap (<a href=\"http://troopswap.com\" rel=\"nofollow\">http://troopswap.com</a>) is looking for a front-end engineer with experience in Rails and UX design. Full job listing here: <a href=\"http://washingtondc.craigslist.org/nva/eng/2524035341.html\" rel=\"nofollow\">http://washingtondc.craigslist.org/nva/eng/2524035341.html</a><p>We're well funded and currently available in the Hampton Roads, VA market with plans to expand to DC and San Diego soon.  Come join in on the fun and help us reward a life of military service!<p>Contact the engineering team at: \nawesome@troopswap.com","time":1312222623,"type":"comment"},{"by":"jonkelly","id":2833442,"parent":2831646,"text":"Denver, CO<p>This or That (thisorthat.com and QuoteEngine.com) is looking for full-time software developers. We use. JAVA, MySQL, EC2, MongoDB, jQuery, Hibernate, Spring. We have a small, but A+ team, led by an experienced CTO (Hotwire, DoubleClick) and CEO (Oracle, eCoverage, SureHits) who has developed software and had a significant exit. Reasonable work hours and (coming soon) offices with doors for all. Health, dental and vision insurance and (coming soon) profitability.  Please check thisorthat.com/jobs for more info and contact.","time":1312220733,"type":"comment"},{"by":"andrewpbrett","id":2833714,"parent":2831646,"text":"Cake Health is looking for our first full-time employee to help us tackle the huge problem of health care costs in the US. We're in the Bay Area (San Francisco, Mountain View, Palo Alto for the Ctrl+F'ers).<p>The product to date has been built on Ruby on Rails + mySQL + jQuery, so fluency with those is a plus. We're moving on to tackle some larger problems, though, so I'm far more interested in what you've done than what you've done it with.<p>More info at <a href=\"http://cakehealth.com/jobs\" rel=\"nofollow\">http://cakehealth.com/jobs</a>","time":1312223740,"type":"comment"},{"by":"fourk","id":2834957,"parent":2831646,"text":"San Francisco, CA: Focus - (Senior) Engineer<p>Who we are:\nwww.focus.com\nLocated in San Francisco's Financial District, a block away from BART.\nProfitable.\nOffering competitive salary and equity.\nSmall engineering team (&#60;10)<p>Tools we use:\nPython (Django)\nJavascript (jQuery, Backbone.js, Node.js)\nAMQP (RabbitMQ)\nCSS (Blueprint, Sass)<p>What you should be:\nAbove all else: Smart and gets things done.\nWilling to work on-site in San Francisco. Working from home one day a week is cool by us.<p>Contact dmccomas@&#60;our website&#62; for additional information or to apply.","time":1312240611,"type":"comment"},{"by":"durin42","id":2832635,"parent":2831646,"text":"Chicago - Google<p>We're hiring at Google Chicago. It's a great office, and we've got a great group of engineers. Feel encouraged to email me if you want a resume put into the system - my email is in my HN profile. You don't have to move to Mountain View, and you get to play with all the awesome toys we've got and work on huge-scale problems.<p><a href=\"http://www.google.com/intl/ln/jobs/uslocations/chicago/swe/software-engineer-chicago/index.html\" rel=\"nofollow\">http://www.google.com/intl/ln/jobs/uslocations/chicago/swe/s...</a>","time":1312212833,"type":"comment"},{"by":"sogrady","id":2835450,"parent":2831646,"text":"Boston, MA / Portland, ME (REMOTE available) - RedMonk<p>RedMonk is the developer oriented industry analyst shop. We work with clients large (Cisco, Dell, IBM, Microsoft, VMware, etc), small (Cloudera, Eucalyptus, GitHub, Splunk, etc) and foundation (Apache, Eclipse, etc) to help them help developers.<p>We do this by conducting qualitative and quantitative research on developer trends and behaviors, the output of which is aimed at developers and made available to them at no cost. Revenue is derived from helping apply the research findings to our client's individual businesses.<p>The company is small, virtual and distributed, with people in the US, UK and Spain.<p>We're looking for a full time analyst. Required skills include the ability to communicate - rationally - in person and in writing. You should have a reasonable online presence and a passion for developers and the tools they use. And ideally, you'll have training and/or experience in statistics (R) / economics, programming and rich media.<p>Travel is heavy (2 or 3 day trips a couple of weeks a month) for 6 months out of the year. Location is not a hard requirement, but if you're in the greater Boston area that would be ideal.<p>For the right person, this is a great gig: you might not change the world, but you can change the world for developers by helping vendors get it.<p>Send a CV and anything else you believe we should consider to hiring @ redmonk.com.","time":1312252162,"type":"comment"},{"by":"trefn","id":2833787,"parent":2831646,"text":"San Francisco, CA - Mixpanel (YCS09, Sequoia funded)<p><a href=\"http://mixpanel.com/\" rel=\"nofollow\">http://mixpanel.com/</a><p>We're currently 8 people, all engineers.  We're looking for hackers who want to scale.<p>We just built a new data store that lets us process hundreds of millions of items in realtime with unlimited filtering and segmentation, and we want to build lots of products on top of it.<p>It's a fascinating problem space and a fun team.<p>Check out <a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a> to apply","time":1312224713,"type":"comment"},{"by":"eric2701","id":2834562,"parent":2831646,"text":"San Diego, CA: Qualcomm R&#38;D<p>Ready to change the world? We are working on the next computing paradigm: Neuromorphic Computing, literally computers based on the brain. Part of this effort is to create the tool, an IDE, to be used in the design and develop the neural systems based on our technologies. Think Eclipse or XCode for the brain.<p>The tool will be used to design, visualize, run and analyze large neural systems and we want it to be available to everyone so we are putting it on the web. To accomplish this we will be pushing the limits of what can be done in a browser. Utilizing all the latest technologies in HTML5: Canvas, WebGL, etc, to create a rich client side user interface as well as C++ for a high performance backend.<p>Must be familiar with the newest HTML5 Javascript APIs, e.g. WebGL and Canvas, as well as be a master at squeezing all the functionality out of the older APIs.<p>General OO design and C++ experience and a willingness to learn engineering based neuroscience also required.<p>OpenGL, GUI development, familiarity with Agile development practices, and a familiarity with the Linux development environment desired.<p>Apply here:\n<a href=\"https://jobs.qualcomm.com/public/jobDetails.xhtml?requisitionId=1888782\" rel=\"nofollow\">https://jobs.qualcomm.com/public/jobDetails.xhtml?requisitio...</a>","time":1312234095,"type":"comment"},{"by":"im_asl","id":2834583,"parent":2831646,"text":"Mountain View, CA (Intern, Fulltime, H1B): Engineers, QA, PMs, Executive Assistants, Recruiters.<p>About us<p>Addepar is recreating the infrastructure that powers global wealth management. Addepar's technology increases efficiency, transparency, and sophistication within the global investment industry, thwarting fraud and furthering meritocracy in one of the most important areas of the global economy.<p>Our CEO, Joe Lonsdale, is a founder of Palantir Technologies, which is known for revolutionizing technology deployed in intelligence, defense, and finance communities. In his early twenties, Joe helped to build a multi-billion dollar hedge fund, where he was one of the top traders. Our technical team is led by CTO Jason Mirra, and is composed of computer scientists from Stanford, Berkeley, MIT, and Carnegie Mellon. Addepar is supported and advised by a group of international billionaires, and some of the most respected Silicon Valley venture capitalists.<p>If you join Addepar, you’ll be part of a group of talented, motivated and hungry individuals. We don’t believe in excessive meetings, processes or unnecessary contemplation, we’re a group of doers intent on changing one of the largest markets in the world. Our culture is driven by our core values of: measurement, fitness, meritocracy of ideas, alignment, action, creation of value and simplicity. It’s not rare to see half of our team spontaneously grab dinner or drinks after a hard day of work.<p>We keep a beautifully stocked fridge, provide laundry service and catered meals. You’ll learn a lot about finance and best in class programming, and have an opportunity to own a significant piece of the company and product.","time":1312234433,"type":"comment"},{"by":"shennyg","id":2833073,"parent":2831646,"text":"Los Angeles, CA - Full Time, Part Time and contract.<p>SaveFans! is a high-growth, early stage company, that provides a fully-automated, turn-key platform for buyers and sellers to negotiate prices and purchase event tickets.<p><pre><code>  Job Perks\n\n  * Play a big role on a small team\n  * Work closely with founders and executives from some of the largest media companies in America\n  * Leave your fingerprint on a huge industry\n  * Have stock options in a company that is fixing a broken model\n  * Be the first employee for a funded start-up\n\n  Requirements\n  * Experience building web applications \n  * Experience with MVC design patterns and frameworks \n  * Demonstrated fanatical attention to detail \n  * Familiarity with source control systems (Git) \n\n  Pluses\n  * Experience with agile development processes\n  * Appreciation of software development best practices, but knows when it is important to deliver code\n  * Experience with git flow, Vagrant, Memcached, Amazon Web Services\n  * Comfortable working on the command line\n  * SQL optimization chops \n</code></pre>\n<a href=\"http://savefans.theresumator.com/apply/Iui6yk/Web-Engineer.html?source=HN\" rel=\"nofollow\">http://savefans.theresumator.com/apply/Iui6yk/Web-Engineer.h...</a>","time":1312216783,"type":"comment"},{"by":"mitchell","id":2833202,"parent":2831646,"text":"Atlanta, GA - Vitrue<p>We're a social media company building a platform for corporate clients to manage their presences on Facebook/Twitter and the like.  We're primarily a Rails shop.  Having said that, we do have projects in other languages, and we're more than willing to hire someone smart with no Rails experience and bring them up to speed.<p>Stuff we use:  Ruby, Rails, MySQL, PostgreSQL, MongoDB, Node.js, jQuery, AWS/Scalr/Engine Yard, and more.<p>For open positions and a better idea of what we do, take a look at our job page here: <a href=\"http://vitrue.com/jobs\" rel=\"nofollow\">http://vitrue.com/jobs</a> (don't let the site design dissuade you, we're about to change it).  Not every open position is posted, though, so if you're more of a back-end developer, a configuration management type or similar, we'd still love to hear from you.<p>By far, this has been my favorite job that I've ever had -- the corporate culture is very much open, collaborative, and full of change; I'm surrounded by people smarter than I am; and I'm working on interesting/challenging things.<p>You can either apply through the jobs page I linked, or drop me an email at my user name at vitrue.com with questions/comments/resumes/etc..<p>P.S.: This isn't my main account, for reference.","time":1312217943,"type":"comment"},{"by":"kabir_h","id":2832031,"kids":[2832227,2855195],"parent":2831646,"text":"The Echo Nest in Somerville, MA (Davis Square) and London<p>Echo Nest is a music intelligence company that powers music apps with our API, including apps for the BBC and MTV. We've got a killer engineering culture, well-stocked beer fridge and you'll be able to shape the future of music. It's my 4th week here and I love it.<p>App Systems Engineer - London Office<p>Engineer<p>Junior Engineering Intern<p>Music Information Retrieval Scientist<p>QA Manager<p>Senior Engineer<p>Web Developer<p>Web Developer - London Office<p><a href=\"http://the.echonest.com/company/jobs/\" rel=\"nofollow\">http://the.echonest.com/company/jobs/</a>","time":1312205876,"type":"comment"},{"by":"karthikv","id":2833156,"parent":2831646,"text":"SolarCity in San Mateo, CA.<p>We are looking for an Embedded Systems Engineer: <a href=\"http://www.solarcity.com/hr/204/26/Embedded-Systems-Engineer.aspx\" rel=\"nofollow\">http://www.solarcity.com/hr/204/26/Embedded-Systems-Engineer...</a><p>We are a small software team working on some really important problems in the solar/renewable and home energy efficiency space. Come join us if you want to change the world one roof at a time. Email me if you are interested.","time":1312217528,"type":"comment"},{"by":"shadchnev","id":2831809,"parent":2831646,"text":"London, UK. Forward Internet Group: <a href=\"http://www.forward.co.uk\" rel=\"nofollow\">http://www.forward.co.uk</a><p>We're a young entrepreneurial company that bootstrapped its way from its founder bedroom to an almost 200-strong company with very healthy profits in 6 years without any external capital.<p>We are behind uswitch.com, getinvisiblehand.com, omio.com, justcages.co.uk, petvillas.co.uk, forward3d.co.uk, locaria.com etc. You can take a look at who we are and what we do at <a href=\"http://www.forwardtechnology.co.uk\" rel=\"nofollow\">http://www.forwardtechnology.co.uk</a>.<p>We have been doubling our revenues every single year (up to £118m in 2010) and plan to continue to expand. So, we need great people!<p>We're looking for great developers (and many other roles too) to work on a variety of exciting online projects. We use Clojure, Ruby, Hadoop, Node.js, Sinatra etc.<p>Above all we're looking for smart, ambitious, entrepreneurial people. Full job spec is here: <a href=\"http://www.forward.co.uk/careers\" rel=\"nofollow\">http://www.forward.co.uk/careers</a> or here: <a href=\"http://www.forwardtechnology.co.uk/\" rel=\"nofollow\">http://www.forwardtechnology.co.uk/</a><p>Drop me an email at evgeny.shadchnev@forward.co.uk for an informal chat.","time":1312202301,"type":"comment"},{"by":"CoffeeDregs","id":2833314,"parent":2831646,"text":"SF, CA : ROI-DNA web consultancy<p>We're looking for devs to join a rapidly growing web consultancy.  We're a group of friends who came together to help all kinds of web business increase their awesomeness.  Initially, we focused on marketing + strategy, but clients always wanted help with implementation, so we started doing a bit of dev work.  Now we're doing lots of dev work from building mobile apps to simple JS tweaks to full-stack rebuilds to large CMS implementations.<p>Anyways, if you're game to play with lots of different technologies and clients, give a shout.  And we're looking for all kinds of dev help.  We'd love you to join us forever and ever and ever, but we're realistic: consulting is often a temporary thing as you plot the next steps in your career and that's fine with us.  We're also happy to help you increase your runway if you're working on your own thing.  Need awesome design work, some strategy, a bit of social media advice?  We're happy to help you when you help us.<p>More here:\n<a href=\"http://sfbay.craigslist.org/sfc/eng/2516921876.html\" rel=\"nofollow\">http://sfbay.craigslist.org/sfc/eng/2516921876.html</a><p>Web: www.roi-dna.com<p>Email: jobs@roimarketinginc.com [our old domain...]","time":1312219211,"type":"comment"},{"by":"lamby","id":2833308,"parent":2831646,"text":"London, England.<p><a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a><p>Small (7) startup in the gaming space looking for software engineers. Are you the one? You are, if you:<p>* Love agile development, working independently on your own challenges, and together in a team on the bigger vision<p>* Are completely fluent in a scripting language such as Python, Perl, PHP or Ruby and have experience with web frameworks and the MVC concept. We don't require fluency in our current technology stack - great programmers can pick up new technologies.<p>* Have used MySQL or PostgreSQL extensively and you know your way around Apache, nginx or other server. It's a bonus if you have good JavaScript skills (we use jQuery)<p>* Get excited by the idea of scaling web apps to millions of users<p>* Are the best developer in your peer group, and want to be at a place where you are constantly challenged and pushed to become better<p>* Get obsessed about the problem you're solving and don't stop until you've cracked it<p>* Have a thirst to learn new skills and technologies, and can pick things up easily<p>* Want to have fun building lots of new features and get stuff done<p>* Are full of positive energy, relish the thought of being part of a small, fast-moving team and enjoy brainstorming about new ideas","time":1312219167,"type":"comment"},{"by":"danatwork","id":2832332,"parent":2831646,"text":"Washington, DC\nReston, VA<p>We are looking for experienced Java developers.<p><a href=\"http://w.moreover.com/public/company/moreover_jobs-sr_java_dev-2011-04-21.pdf\" rel=\"nofollow\">http://w.moreover.com/public/company/moreover_jobs-sr_java_d...</a><p>Also looking for candidates in London and Dayton, OH.<p>I can tell you it is a small company and you will be able to shape the product and work with interesting technologies.<p>Full time work. No contractors. Office located in Reston Virginia. Email in my profile.","time":1312209463,"type":"comment"},{"by":"andrew93101","id":2832137,"parent":2831646,"text":"Software Engineers (Santa Barbara, CA) (Candidates must be willing to relocate to Santa Barbara.  H1B candidates are welcome.)<p>AppFolio is the fastest growing provider of online property management software. Our company was founded by a team of technology leaders with many years of experience developing Software-as-a-Service applications. We believe that a small group of passionate people can deliver extraordinary results. We believe in focus and know we can only do a few things really, really well. Our company is experienced and built to last.<p>AppFolio software engineers work to build scalable, robust and easy to use solutions to complex business problems. Delivering intuitive and responsive applications over the web requires us to solve both difficult engineering and product design problems.<p>AppFolio wants creative and independent engineers who are comfortable with a high degree of autonomy and an agile, collaborative work environment. If you are a smart, versatile software engineer with a desire to work with the following technologies, we'd love to hear from you:<p>Rails3<p>MySQL<p>Javascript/AJAX/jQuery<p>HTML5/CSS3<p>iPhone (iOS) and Android development<p>SOA/REST/JSON/XML<p>Apache Solr/Lucene search technology<p>Nginx/Passenger<p><i>To apply, please submit your resume to tech.jobs@appfolio.com. No phone calls please.</i>","time":1312207102,"type":"comment"},{"by":"dshah","id":2832340,"parent":2831646,"text":"Boston/Cambridge, MA<p>HubSpot Labs is looking for an experienced Python/Django hacker that can help launch more free tools on grader.com that millions of users will use.<p>We usually don't recruit remote folks, but in this case, I'm making an exception.<p>Drop me a line: dshah {at} hubspot.com<p>p.s.  We've been twice voted the best company to work for in the Boston area.  You should find out why at <a href=\"http://BostonBattle.com\" rel=\"nofollow\">http://BostonBattle.com</a>","time":1312209530,"type":"comment"},{"by":"mdelagra","id":2834154,"parent":2831646,"text":"Evanston, IL<p>At Leapfrog Online we're looking for talented Software Engineers to do web and application development.  We're a tightly knit group of software developers looking to add to our team.  Our engineers perform a mix of Rails and Django development, and we're looking for candidates who have at least two years experience with either framework.<p>Leapfrog Online is the leading independent digital direct marketing firm in the country, developing programs for Fortune 500 marketers to find and convert the right customers. We feature a relaxed, collegial atmosphere, and in our engineering practices we emphasize Agile and Test-Driven Development.  We focus a lot on career development here, and we make sure that all our engineers get continual opportunities to pick up new technologies.<p>If you enjoy using open source software to solve interesting problems, you are our kind of programmer, and we'd like to talk to you.  You can find full job descriptions and contact information here: <a href=\"http://www.leapfrogonline.com/who/careers/\" rel=\"nofollow\">http://www.leapfrogonline.com/who/careers/</a>","time":1312229296,"type":"comment"},{"by":"stephstad","id":2833158,"parent":2831646,"text":"Raleigh, NC; Westford, MA; Mountain View, CA; New York, NY; Tysons Corner, VA (full time): Red Hat<p>Several positions available. Information on open positions at <a href=\"https://careers.redhat.com/ext/search\" rel=\"nofollow\">https://careers.redhat.com/ext/search</a><p>Working at Red Hat means working beyond the borders of obvious and ordinary. This is a global company growing fast and bringing open source into the mainstream.","time":1312217560,"type":"comment"},{"by":"WillyF","id":2832279,"parent":2831646,"text":"Chicago, IL but REMOTE is ok.<p>I'm hiring paid part-timers/interns. Posting here: <a href=\"http://www.onedayonejob.com/blog/hiring/\" rel=\"nofollow\">http://www.onedayonejob.com/blog/hiring/</a><p>One Day, One Job is my one-man show (that won't be just me for much longer) that helps college students find jobs and internships. Check us out: <a href=\"http://www.onedayonejob.com/\" rel=\"nofollow\">http://www.onedayonejob.com/</a>","time":1312208854,"type":"comment"},{"by":"jasoncartwright","id":2831798,"parent":2831646,"text":"Potato are hiring Django/Python developers in London, Bristol and Amsterdam. Freelance preferred, but fulltime available to exceptional candidates.<p>Our clients include Google, PayPal, News Corp &#38; large agencies. We're a 30 person pure webdev house (no designers, no Flash, no account managers, no sysadmins) working almost exclusively on Google App Engine.<p><a href=\"http://p.ota.to\" rel=\"nofollow\">http://p.ota.to</a>","time":1312202119,"type":"comment"},{"by":"buymorechuck","id":2831942,"parent":2831646,"text":"Palo Alto, CA - Flipboard, Inc. H1B<p>We're seeking iOS and web developers with a passion for design and craftsmanship. We're doing crazy things at the intersection of native and web platforms in the name of user experience. If that appeals to you, let me know!<p><a href=\"http://flipboard.com/jobs\" rel=\"nofollow\">http://flipboard.com/jobs</a><p>[[NSString alloc] initWithFormat:@\"%@+HN@%@.com\", @\"charles\", @\"flipboard\"] // is this safe now?","time":1312204558,"type":"comment"},{"by":"dan_manges","id":2832768,"parent":2831646,"text":"Chicago, IL - Braintree<p>We mostly work with Ruby/Rails. Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node, Java, .NET, PHP, and Perl. Braintree is profitable, you'll have standard benefits (health/dental/vision), 401k match, ample vacation, an above market salary, and stock options.<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/inside-braintree/how-we-built-the-software-that-processes-billions-in-payments\" rel=\"nofollow\">http://www.braintreepayments.com/inside-braintree/how-we-bui...</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a> . If you know somebody who might be a good fit, we'll pay you $10,000 for a hired senior dev referral.","time":1312213977,"type":"comment"},{"by":"kylerush","id":2832995,"parent":2831646,"text":"Obama for America - Chicago, IL<p>Obama for America (OFA) is hiring many frontend developers to work on barackobama.com.<p>We are essentially a large startup that hit the ground running in April of this year. We need skilled frontend developers to help us create another groundbreaking information and mobilization site to help re-elect the President.<p>We're looking for developers with experience in HTML5, CSS3, JavaScript, jQuery, jQuery mobile, ExpressionEngine, social APIs, Git, A/B testing and anything else that is necessary to achieve our goal.<p>OFA is a very unique opportunity to work for the President on a high profile site that has tons of traffic. One of the many benefits is working with a very talented design team.<p>If you would like to have a part in helping the President strengthen the country and improve the lives of millions of Americans, contact Kyle Rush (@kylerush OR krush@barackobama.com). Job description/posting here: <a href=\"http://www.authenticjobs.com/jobs/9256/frontend-developer\" rel=\"nofollow\">http://www.authenticjobs.com/jobs/9256/frontend-developer</a>","time":1312216099,"type":"comment"},{"by":"pretzel","id":2831835,"parent":2831646,"text":"London, UK\nQubit group - <a href=\"http://www.qubitgroup.com/join-our-team\" rel=\"nofollow\">http://www.qubitgroup.com/join-our-team</a><p>We're looking to double the size of our company over the next 12 months. We're hiring senior and graduate software engineers in the next quarter, plus a whole bunch of other roles. We're not looking for any skills in particular, just smart people.<p>Qubit Group is a 18 month-old company founded by 4 ex-Googlers. We're in the business of making company's websites perform better, by generating rule-based concrete advice.<p>We've a bunch of huge clients already, and are trying to keep up with growth! It's a busy time and you'll get thrown in the middle of bunch of AI work, doing cloud computing and presenting complex data to clients in a simple actionable manner.<p>It's a fun place to be (not just because we're in the middle of Soho), there's a bunch of perks for everyone and there's both strong leadership from above and freedom for everyone to do things the way they know best.<p>If you are interested, send an email to careers+yc@qubitgroup.com.","time":1312202774,"type":"comment"},{"by":"paraschopra","id":2832329,"parent":2831646,"text":"Delhi, India<p>Visual Website Optimizer <a href=\"http://visualwebsiteoptimizer.com/careers.php\" rel=\"nofollow\">http://visualwebsiteoptimizer.com/careers.php</a><p>We require engineers to work on our LAMP stack based application. We work on scale (1300 requests/second) and use  advanced JavaScript/CSS techniques to make A/B testing work. Join us if you want to make a dent on website optimization space.","time":1312209416,"type":"comment"},{"by":"gyges1","id":2833637,"parent":2831646,"text":"San Francisco, CA\nHeroku needs a Customer Advocate!!!<p>Do you want to work directly with Heroku’s awesome customers on a daily basis? Do you want to help innovate and redefine how technology is sold? Do you have a Technical background but have always wanted to try your hand at Sales? Do you thrive in an entrepreneurial environment?<p>If so, Heroku is looking for technical people with a passion for working with customers to join our Customer Advocate team. If you’re personable, outgoing and charismatic with a background as a developer, SE or a highly technical salesperson we’d love to hear from you.<p>Requirements:\n- Strong technical background\n- Inquisitive disposition\n- Track record of being a top performer\n- Self-starter willing to work in a team\n- College degree<p>Responsibilities:\n- Maximize customer success on our platform\n- Manage inbound sales inquiries\n- Expand existing customer relationships\n- Champion technical &#38; business side issues for customers\n- Align with development partners to co-sell Heroku","time":1312222733,"type":"comment"},{"by":"RyanGWU82","id":2833513,"parent":2831646,"text":"San Mateo, CA<p>PBworks is hiring a Web Software Engineer!<p>We're counting on you to make a big difference in our product.  It's not just an opportunity to make an impact at PBworks, it's a responsibility.  Millions of people will be using your code.<p>You're a jack of many trades: you know your way around a Linux command line and Firebug with equal aplomb; Javascript optimizations and SQL optimizations (and when you shouldn't yet bother with them); the design of MVC frameworks and visual design with CSS. You know how to make something beautiful and approachable soup-to-nuts. You've coded a few projects of your own, maybe some of them have even made the front page of Hacker News, but you're curious to jump into an existing small team that actually has millions of users and do some real, helpful work.<p>Fluency in: HTML5, JavaScript, CSS3, JSON, jQuery, PHP, MySQL, git<p>Bonus for: node.js, Erlang, Perl, bash, Photoshop, Smarty, Prototype, mogilefs, memcached<p>You love: Agile, unit testing, functional testing, rapid prototyping.<p>To apply, email jobs-fwe+hn@pbworks.com.","time":1312221445,"type":"comment"},{"by":"200902","id":2834014,"parent":2831646,"text":"New York, New Jersey, and Boston<p>Cyrus Innovation is hiring developers of all levels.<p>Cyrus is a small (~30 people) XP/Agile consulting firm based in SoHo. We provide XP teams on demand to both startups and enterprise organizations. We care more about your capacity to learn and your enthusiasm for clean code than how many years of experience you have with a given programming language.<p>Our philosophy is based on maintaining a high quality of life for our developers both in and out of work. We offer 40 hour work weeks, 4 weeks per year dedicated to professional development (conferences, workshops, learning a new programming language -- it's up to you), generous compensation and benefits (401(k), medical, dental, vision), and most importantly a casual and transparent environment where your ideas are taken seriously.<p>If you'd like to learn more or are interested in applying, check out the careers section of our website here:<p><a href=\"http://cyrusinnovation.com/workplace\" rel=\"nofollow\">http://cyrusinnovation.com/workplace</a>","time":1312227574,"type":"comment"},{"by":"roobeast","id":2832827,"parent":2831646,"text":"San Francisco, CA - Trulia<p>Work downtown, one block from Montgomery station.  We are looking for skilled backend developers,  particularly search and big data processing skills.  Most of the backend is written in java using hadoop and we leverage lucene/solr for search.  We also have some python based systems and tend to be language/technology agnostic.  The company culture is great, this is not a developer sweat shop and we stick to a no a-holes policy when hiring. Trulia is a technology company focused on helping consumers in the real estate industry. Our business is growing fast and we are profitable.\nFor the backend positions please apply to the senior software engineer using the following link,  we will adjust title/comp accordingly based on your experience.<p><a href=\"http://www.trulia.com/about/careers/Engineering\" rel=\"nofollow\">http://www.trulia.com/about/careers/Engineering</a><p>We have other eng positions open such as front end, mobile, sysadmin and data warehouse also.","time":1312214470,"type":"comment"},{"by":"McBoof","id":2840561,"parent":2831646,"text":"London, England: Pugpig.com looking for iOS, Android and HTML developers. Contract and Perm.<p>Jon here. Co-founder of a new startup in the heart of London focusing on HTML5 based publishing to tablets and mobile devices. If you're a techie nerd, a fan of client side/mobile technologies, and you care about publishing, you're the person we want.<p>Here is our site: <a href=\"http://pugpig.com/\" rel=\"nofollow\">http://pugpig.com/</a>\nAnd an example app in the App Store: <a href=\"http://itunes.apple.com/us/app/pugpig-guide/id441715052?mt=8&#38;ls=1\" rel=\"nofollow\">http://itunes.apple.com/us/app/pugpig-guide/id441715052?mt=8...</a><p>There are currently only 6 of us, 4 of whom are very technical. We're looking for smart people, from graduate to very senior.<p>We've launched the first version of the iOS product, but need help accelerating our Android product and next versions of iOS. We also need people to create beautiful HTML for client publications.<p>Ping @McBoof or @thepugpig on Twitter if you're interested.","time":1312368058,"type":"comment"},{"by":"freyfogle","id":2832663,"parent":2831646,"text":"London (in Clerkenwell near Old Street and Farringdon tube stations)<p>Lokku Ltd, we run property search engine Nestoria.<p>Several full-time roles\n- UX/frontendand \n- online marketing<p>also some part-time/internship roles (paid)<p>we're a small, fun team of internet veterans with a profitable business serving millions of users every month. Join us.<p><a href=\"http://www.lokku.com/jobs/\" rel=\"nofollow\">http://www.lokku.com/jobs/</a>","time":1312213068,"type":"comment"},{"by":"evan2","id":2839437,"parent":2831646,"text":"New York<p>chloe + isabel is an exciting, fashion-forward jewelry start-up based in a beautiful Tribeca office space.   We sell high-quality fashion jewelry via our merchandiser network made up of passionate young women across America; we operate a direct sales model so each one of our merchandisers gets paid a commission for every sale they make.  Most exciting is that c + i is building and utilizing the Internet and web 2.0 technologies to set us apart from our competitors.<p>We are looking for a couple highly skilled Ruby developers to help us architect and build our application. You will be responsible for all aspects of development from bug fixing to feature development.<p>More info: <a href=\"http://www.chloeandisabel.com/colophon/work-at-chloe-and-isabel/ruby-on-rails-developer\" rel=\"nofollow\">http://www.chloeandisabel.com/colophon/work-at-chloe-and-isa...</a><p>If interested, please submit a resume with work samples to techjobs@chloeandisabel.com for consideration.","time":1312334898,"type":"comment"},{"by":"Lisa_O","id":2837666,"parent":2831646,"text":"BrightTag is on the hunt for an amazing senior front-end developer who wants to architect and build innovative, useful and exciting web interfaces. The right person for this role values clean code, wants to be part of an Agile start-up environment and has some serious JavaScript (jQuery) skills along with css3, html5 and some PHP.  Mobile experience? Yes, please. This is a great opportunity to constantly test and improve your skills on a rapidly growing user base.<p>Based in downtown Chicago, we're focused on innovation and shun big company politics and drama.  We're small but growing wisely (21 employees, 11 of us are on the tech team), vc-funded (New World Ventures, Tomorrow Ventures), are working with some very big-name clients and gaining more weekly.<p>Interested?  Show and tell us who you are, what you've done and why you'd be an asset to our team!\nContact me. lokeefe(at)brighttag(dot)com<p>Please NO 3rd party recruiters or outsourcing firms.","time":1312302095,"type":"comment"},{"by":"jqueryin","id":2832544,"parent":2831646,"text":"Skookum Digital Works: Charlotte, NC<p>--- WHO WE ARE ---<p>Skookum Digital Works is a custom mobile and web applications development company. We love working with startups and entrepreneurs; using agile methodologies and the lean startup movement to deliver minimal viable products. Delivery is key, so we look for performers who love taking control of projects and require minimal management.<p><a href=\"http://skookum.com\" rel=\"nofollow\">http://skookum.com</a><p>--- WHO WE WANT ---<p>Skookum Digital Works is hiring both seasoned developers (mid to senior) as well as a junior dev.<p>We do not target specific languages per say, as great programmers have the ability to add tools to their belt as they go. With that being said, we currently seek individuals with any of the following skills:<p><pre><code>  * LAMP/LEMP developers (familiarity with Zend, Kohana, Wordpress, or Drupal preferable)\n  * Node.JS developers (we have live projects and products)\n  * Frontend developers (jQuery/JS/Sass/LESS/CSS/HTML5)\n  * Mobile developers (iOS, iPhone, Android, Blackberry, phonegap)\n  * Familiarity with a VCS (git preferable)\n</code></pre>\nIf you have a skill set outside of the above, don't fret. We're still interested in hearing what you bring to the table. All we ask is that you leave your ego at the door.<p>--- WHAT WE OFFER ---<p><pre><code>  * Competitive salaries\n  * Three weeks paid vacation\n  * Health insurance\n  * Catered Friday lunches (Pizza/Techtalk Fridays)\n  * Once-a-month group outings\n  * Paid continual learning (conferences, classes, etc)\n  * People like you\n  * A growing company\n  * A great location and view (smack dab in the heart of Charlotte, 19 floors up)\n</code></pre>\n--- STILL INTERESTED? ---<p>If interested, contact me directly at corey@skookum.com with your resume and any online links or open source stuff you may have. We love developers who are active in the community.","time":1312211927,"type":"comment"},{"by":"arupchak","id":2833255,"parent":2831646,"text":"Amazon.com - Seattle WA - No remote, but willing to relocate based on experience. H1B is possible, again, depending on experience.<p>I am looking for a strong Systems Support Engineer for our growing team. We like to describe our organization as a Startup within Amazon, as our part of the business is still growing rapidly and our engineers can have a lot of influence on where the product goes. For this role in particular, I am looking for someone with a strong infrastructure/hardware bias to help us make the changes we need to scale our business over the next ten years without having to lift a finger.<p>Job description below. Contact me at ${hn_username}@gmail.com if you have any questions.<p>The Amazon Seller Services team is looking for a great Systems Support Engineer to keep our systems running and our customers happy. You should be comfortable in a Linux environment, be able to automate everything you did yesterday, and willing to troubleshoot and solve new problems on a daily basis. Come join one of the fastest growing teams within Amazon.<p>Responsibilities:<p>-Maintain stability and performance of our systems via tickets during business hours oncall shifts<p>-Diagnose and troubleshoot new production issues that affect our customers<p>-Create and maintain standard operating procedure documents for new issues identified<p>-Automate operational tasks to assist with our scaling needs<p>Requirements:<p>-Proficiency in a scripting language (Ruby, Perl, Python, Shell)<p>-Familiar with SQL databases<p>-Comfortable navigating a Linux environment<p>-Basic understanding of web application architectures<p>Bonus points:<p>-Written a Rails application<p>-Deep knowledge of Oracle databases<p>-Troubleshooting experience<p>-Ticketing experience","time":1312218631,"type":"comment"},{"by":"darrenn","id":2832470,"parent":2831646,"text":"Amazon Route 53 is a highly available and scalable Domain Name System (DNS) web service. Since December 2010, when Route 53 launched, we have been working hard to add new features (<a href=\"http://news.ycombinator.com/item?id=2582674\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2582674</a>), make the service easy to use, and scale our systems. In that time, we've had a big impact on the DNS space, attracting some major customers and filling a gap in the market. Our team is small, nimble, and crazy smart. Working on Route 53 you'll learn tons about networking, DNS, operating a tier-0 service, and growing a business.<p>We've got lots of exciting plans for this year and next and we're looking for developers and managers to help us turn them into reality. See <a href=\"http://aws.amazon.com/route53-jobs/\" rel=\"nofollow\">http://aws.amazon.com/route53-jobs/</a> for details.","time":1312211249,"type":"comment"},{"by":"sciurus","id":2832668,"parent":2831646,"text":"Athens, Ga - EuPathDB<p>EuPathDB is looking for a front-end web developer to help scientists perform dynamic computational experiments on genomic-scale datasets. You'll get to work on innovative interfaces like our strategies system (description: <a href=\"http://bit.ly/ko0Y4b\" rel=\"nofollow\">http://bit.ly/ko0Y4b</a> , source code: <a href=\"http://bit.ly/mUyL3D\" rel=\"nofollow\">http://bit.ly/mUyL3D</a>).\nYou'll need detailed knowledge of Javascript, jQuery, CSS, HTML, Java, JSP, Struts and web services. Knowledge of SQL, Perl, Tomcat and Apache are also desirable. An interest in bioinfomatics and genomics applications is highly desirable and experience a strong plus.<p>View the full job description and apply on our university's website at <a href=\"http://www.ugajobsearch.com/applicants/Central?quickFind=57355\" rel=\"nofollow\">http://www.ugajobsearch.com/applicants/Central?quickFind=573...</a>","time":1312213104,"type":"comment"},{"by":"wbills","id":2833511,"parent":2831646,"text":"Memphis, TN - American Roamer<p>Director of Software Development<p>We are changing the way that the telecommunications industry looks at market intelligence with our in-browser spatial data analysis services. Right now our team is growing and we’re looking for a natural leader with a strong background in software engineering. You should be able to help us scale to meet the growing load on our servers and our developers by fostering an environment where quality code is shipped every day.\nSome technologies we work with: Solr, MongoDB, PostgreSQL, Ruby, Rails, Javascript, OpenLayers, Node.js, Varnish, HAProxy, AWS, and Chef.<p>Also, there's not currently a position posted but we are always on the lookout for great developers/engineers/architects as well.<p><a href=\"http://www.americanroamer.com/careers/job-opportunities/\" rel=\"nofollow\">http://www.americanroamer.com/careers/job-opportunities/</a><p>email: hr@americanroamer.com","time":1312221434,"type":"comment"},{"by":"kschrader","id":2832554,"parent":2831646,"text":"New York, NY - Intent Media<p>Intent Media is building a unique enterprise-class advertising platform. We’re shaking up the e-commerce industry with a big idea: enabling e-commerce publishers to monetize the 97% of visitors who aren’t buying on their sites. Our auction-driven technology platform is easy for e-commerce web sites to implement and contains sophisticated tools for minimizing risk and optimizing results.<p>As a part of the Intent Media engineering team you would help us build out our software and algorithms that continuously analyze millions of data points to solve the problem of who to serve ads to and what the best ads for them are, all while being optimized to run ridiculously fast.<p>Tech: Ruby, Java, and Javascript<p>If you're interested, shoot me an email at kurt@intentmedia.com or check out <a href=\"http://www.intentmedia.com/jobs\" rel=\"nofollow\">http://www.intentmedia.com/jobs</a>","time":1312211985,"type":"comment"},{"by":"covati","id":2834699,"parent":2831646,"text":"Durham, NC United States<p>Currently seeking PHP &#38; Javascript developers who are looking to rock out in the triangle.<p>A very quick note about us: at Argyle Social we have built a Social Media Marketing Software platform that helps marketers to Manage, Measure and Analyze their social media marketing efforts. We are building the best tool out there for marketers looking to prove the value of social media.<p>Do you like waking up in the morning excited about the code you are going to write today? How about being amazed at how awesome the features and products you build look when you're done? Have you always wanted to play with new big data technologies like Hadoop and NoSQL DBs?<p>This isn't just HR BS, we work pretty damn hard to ensure that the dev team is doing interesting stuff and getting to push the envelope with new and interesting technologies. We know that when you are challenged with something fun, you write better code - so that's what we do.<p>We use an Agile development that has evolved over time (and continues to grow with us) to work well with our small, limber team. It has allowed us to build an impressive amount of robust product with very few resources.<p>On the front end we have a very slick, intuitive, and clean UI (check us out at ar.gy). You'll be working with our designer on anything that requires front end work - you'll be in awe of what he can do. On the backend we are building up a pretty huge dataset that we get to rip into. Learn more about our infrastructure at taws.me/2011/05/meeting-1.html<p>Argyle is a Venture backed company that has been operating in the triangle since December of 2009. We have 10 full time employees and an office in downtown durham where the Coke Zero flows like a babbling brook and the gummy bears and Fiber One brownies are plentiful.<p>More details here:\n<a href=\"http://careers.stackoverflow.com/jobs/12851/love-code-you-write-argyle-social\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/12851/love-code-you-wr...</a>","time":1312235710,"type":"comment"},{"by":"phillytom","id":2833855,"parent":2831646,"text":"Conshohocken (Philly suburb), PA<p>Monetate is hiring - local only, happy to relocate.  We've hired some great people that we met through HN.  We're a SAAS provider of testing, targeting and personalization tools (e.g. content targeting, segmentation, A/B testing).  We've got some grad, high-volume customers and we are growing fast.<p><a href=\"http://jobs.monetate.com\" rel=\"nofollow\">http://jobs.monetate.com</a><p>Technically, we write lots of client-side JS for our customer-facing product as well as code that runs on our customers' sites.  We're also looking for backend engineers that want to work on large data and web performance. We work in Python, but experience with that is not a prereq.<p>We have fun problems at scale, great people to work with, and we get instant feedback from our clients on everything we put out! We're having a blast.<p>Please feel free to email me any questions - tjanofsky monetate com","time":1312225361,"type":"comment"},{"by":"robsayshowdy","id":2831996,"parent":2831646,"text":"New York, NY (metro area, office manhattan) - GameChanger - Engineers<p>GameChanger’s software is changing the way amateur sports teams collect, manage and share real-time information.<p>We listen to customers, make quick decisions, trust each other, communicate like crazy and feel lucky to be able to make a positive difference in the lives of thousands of people every day.<p>We need: Talented software engineers who have an aptitude for learning, love building revolutionary products and are (ideally) located in the NYC area.<p>Play with: Sharded MongoDB, gobs of data, Tornado, Django, jQuery, iOS, Android.<p>Apply if you: Know Unix — e.g. git, grep, etc — love code, distrust complexity, work hard, and enjoy sports.<p>Send active links to your Github and LinkedIn profiles, and let us know why you truly would like to work here.<p><a href=\"http://gamechanger.io/careers\" rel=\"nofollow\">http://gamechanger.io/careers</a>\njobs@gamechanger.io or @GCSports","time":1312205324,"type":"comment"},{"by":"jph","id":2832887,"parent":2831646,"text":"San Francisco, CA<p>We're a fast moving startup working on human productivity. We're building on Ruby On Rails 3.1, SQL, NoSQL, Git, and using kanban, pairing, lean UX, and continuous deployment.<p><a href=\"http://handl.it\" rel=\"nofollow\">http://handl.it</a><p>We're seeking senior UI/UX people and senior Rails developers. To contact me directly use joel@handl.it","time":1312215029,"type":"comment"},{"by":"drp","id":2832129,"parent":2831646,"text":"San Francisco, CA<p>HotPads - <a href=\"http://hotpads.com/pages/jobs.htm\" rel=\"nofollow\">http://hotpads.com/pages/jobs.htm</a><p>We're looking for software engineers, web user interface developers and interns of either persuasion. We're a small company looking for driven individuals who want make a big impact on the way people find housing.<p>dpeters@hotpads.com","time":1312207020,"type":"comment"},{"by":"yosho","id":2851321,"parent":2831646,"text":"San Francisco, CA<p>Stealth funded startup in the local/travel space looking for backend engineers. A couple of areas that we're currently working on include smart search and recommendation engines, social and game mechanics, and sorting and filtering capabilities. We will also be expanding into the mobile space shortly.<p>Our tools: Ruby on Rails, MySQL, AWS, Git, nginx<p>The pay is competitive and the equity is generous. If you are an experienced engineer who enjoys being active, than this is the startup for you.<p>More Info: \n- We don't care too much for formal degrees\n- We're very flexible people so let us know how we can benefit each other\n- Our team is small, but growing quickly so now is the time to jump on\n- We are giving away more equity than you're probably used to\n- We are part of a well known incubator in SF\n- Email us to learn more!<p>If interested email dennis@whitehawkventures.com","time":1312571857,"type":"comment"},{"by":"klous","id":2831831,"parent":2831646,"text":"Michigan<p>Benzinga is looking for developers comfortable with PHP/LAMP, Javascript (jQuery), MySQL<p>Also seeking UI/UX designers interested in shaping powerful trading tools.<p>We're a VC-backed media company, delivering actionable trading ideas and real-time news.\n<a href=\"http://www.benzinga.com\" rel=\"nofollow\">http://www.benzinga.com</a><p>We want people who desire to create major changes and work on interesting problems. Our team is building next-generation tools for the financial community in addition to our actionable content.<p>We are a vibrant, high-energy team in beautiful SE Michigan and we promise a few laughs and a great environment. For more on our culture and environment, check-out our blog <a href=\"http://www.benzinga.com/blog/\" rel=\"nofollow\">http://www.benzinga.com/blog/</a><p>We offer top-level compensation and also cover relocation expenses.<p>Email me directly for more information: scott [ at ] benzingapro.com","time":1312202712,"type":"comment"},{"by":"hitch22","id":2838198,"parent":2831646,"text":"Palo Alto, CA - Rails Developer (CTO?) (local preferred, but will consider other U.S.)<p>Stealth start-up focused on a consumer finance vertical that's very large like Mint.com's, but distinctly different and, we believe, more interesting / subject to disruption. The initial site/app is nearly completed and we're close to launch. Our non-local lead developer, pursuant to known prior commitment, became CTO at a local (for him) start-up in an unrelated area. We're looking for an experienced rails developer immediately to fill his shoes to take company to launch and beyond.  Ideally, this role would lead to co-founder / CTO role. Looking for very strong rails / jQuery / MySQL expertise, test-driven development style and entrepreneurial instincts. If interested, please inquire at workfor@finpicture.com.","time":1312309923,"type":"comment"},{"by":"veyron","id":2835769,"parent":2831646,"text":"Rockefeller Center NYC, onsite: #1 looking for #2<p>Bootstrapped prop ultra low latency trading firm (as opposed to a firm which originally had investors and later kicked them out), and I'm willing to cut significant equity.  see <a href=\"http://news.ycombinator.com/item?id=2835656\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2835656</a> for some discussion of what I do.<p>I'm not a traditional finance guy, and I'm definitely not looking for a banking drone.  Most of those tasks are handled by cron anyway.  Sanctity of weekends are preserved.<p>the ideal candidate: mastery, to the level of obsession, with C/Python/coreutils; insatiable curiosity; inquisitive to a fault; chutzpah to challenge every assumption and assertion; calm under pressure; and desire to be involved in every aspect of the business.<p>Windonauts need not apply.<p>Excited?  intransigence123@gmail.com","time":1312258900,"type":"comment"},{"by":"mknoke","id":2838438,"parent":2831646,"text":"Berlin, Germany<p>Looking for experienced and driven Ruby on Rails developers, QA enginers and product managers for a 70+ employee startup in the online gaming / advertising space<p>We offer a developer-friendly environment with a passion to do things the right way, flexible work hours, requirement to work on-site but not all the time, very international team - as a perk we offer German language courses but not needed for work, only a minority of our employees is German.<p>Will help will relocation and work permit as necessary<p>More info here:\n<a href=\"http://www.sponsorpay.com/careers/\" rel=\"nofollow\">http://www.sponsorpay.com/careers/</a><p>One of our ex freelancers' blog post about us after returning to Spain:\n<a href=\"http://fernandoguillen.info/2011/03/05/coding-in-berlin/\" rel=\"nofollow\">http://fernandoguillen.info/2011/03/05/coding-in-berlin/</a>","time":1312314137,"type":"comment"},{"by":"BlueZeniX","id":2833935,"parent":2831646,"text":"Purmerend, The Netherlands (~30 min from Amsterdam)<p>Online Touch is building the next digital publishing platform.<p>We're focused on development now, going to launch a new product with a big splash when we're ready. Our current (somewhat neglected) website hardly does our team justice - <a href=\"http://onlinetouch.eu\" rel=\"nofollow\">http://onlinetouch.eu</a><p>The publishing backend is built using a mix of Scala and Clojure, while frontend web development is done using Clojure and some Ruby. Our database of choice is MongoDB.\nThe viewer and editor applications are written in haXe: targeting javascript, iOS and flash &#62;10.<p>Our office is light and roomy, which we'd like to fill up a bit more. Currently we're a small team of 4 bright hackers, of which 2 work remotely most of the week.<p>There's much interesting stuff to do. Talk to us :-)","time":1312226667,"type":"comment"},{"deleted":true,"id":2832980,"parent":2831646,"time":1312215943,"type":"comment"},{"by":"itay","id":2838164,"parent":2831646,"text":"Splunk, Seattle, San Francisco, Cupertino (H-1B)<p>Splunk is hiring. You can see available positions here: <a href=\"http://www.splunk.com/view/careers/SP-CAAAAGG\" rel=\"nofollow\">http://www.splunk.com/view/careers/SP-CAAAAGG</a><p>We're generally hiring for everything, including core server engineers, dev platform engineers, dev marketing, product management, QA, performance, UI, etc. It's a big space with a lot of opportunity, and we're doing our best to capture it.<p>I work on the Dev Platform team in Seattle, and it's a blast. We're a small team (3 devs, including my manager, VP of Dev Platform), in a great space (across the street from Whole Foods in SLU), and everybody at Splunk is great. Feel free to reach out to me (my email is in my profile) with any questions.<p>We do H-1B, pre-IPO stock, benefits, etc.","time":1312309318,"type":"comment"},{"by":"geddes","id":2832344,"parent":2831646,"text":"New York, NY: The Council on Foreign Relations is hiring a Web Operations Manager.<p>CFR publishes ForeignAffairs.com and CFR.org. We're looking for a broadly skilled web generalist with a background either in web development or server administration. In this role you'll have your finger in both pies :-). CFR is a great place for the intellectual hacker. If you are interested in foreign policy, current events and/or politics, you'll enjoy the opportunity to work alongside the thought leaders that work here.<p>Full job description: <a href=\"http://www.cfr.org/about/career_opportunities/openings.html#756\" rel=\"nofollow\">http://www.cfr.org/about/career_opportunities/openings.html#...</a> \nIf interested send me a note. gmunson (at) cfr (dot) org. No recruiters please.","time":1312209567,"type":"comment"},{"by":"tomnewton","id":2831961,"parent":2831646,"text":"London, UK ( Piccadilly Circus )<p>We're ( social gaming - <a href=\"http://www.iwi.com/\" rel=\"nofollow\">http://www.iwi.com/</a> ) hiring C# .NET, Actionscript, Python and Objective-c/C++ developers.<p>Get in touch! Come build great games played by millions each month. jobs //at// iwi.com - use the subject HN.","time":1312204774,"type":"comment"},{"by":"millie","id":2861680,"parent":2831646,"text":"Sandbox Industries is looking for a Lead Developer / CTO for two of our startups: Lab42 (<a href=\"http://www.lab42.com\" rel=\"nofollow\">http://www.lab42.com</a>) and doggyloot (<a href=\"http://www.doggyloot.com\" rel=\"nofollow\">http://www.doggyloot.com</a>).  Both have existing, well-working platforms built in-house on Ruby/Rails, have recently received venture funding, are generating revenue, and are growing rapidly.<p>Details are here:<p><a href=\"http://sbx.tw/doggylootdeveloper\" rel=\"nofollow\">http://sbx.tw/doggylootdeveloper</a><p><a href=\"http://sbx.tw/lab42developer\" rel=\"nofollow\">http://sbx.tw/lab42developer</a><p>Compensation will include salary + equity. Both positions would be on-site (or mostly on-site) in Chicago.<p>Sandbox is a pretty sweet place to work, if I do say so myself.<p>Millie - millie@sandboxindustries.com","time":1312839289,"type":"comment"},{"by":"dcc","id":2831957,"parent":2831646,"text":"London, Barcelona<p>Pixfizz is looking for ruby, javascript, polyglot developers.\nWe're developing a web2print hosted service. Recently became an HP partner and need new people on the team to work on scaling the system and pushing the enveloppe with our browser based design tool.\nA bootstrapped startup with a sustainable business, we're flexible, open to telecommuting from Europe and the US. You just have to passionate about delivering product and growing the system.\nSome of the tech we're working with: rails, node.js, riak.<p>Junior developers with a real interest in some of the technology are welcome. \nContact me directly daniel@pixfizz.com - <a href=\"http://www.barcelonaonrails.com/jobs/27\" rel=\"nofollow\">http://www.barcelonaonrails.com/jobs/27</a>","time":1312204726,"type":"comment"},{"by":"pushpins","id":2833222,"parent":2831646,"text":"San Francisco, CA - Pushpins<p>Help Us Kill the Paper Coupon!<p>Pushpins – an venture-backed startup founded by two Harvard graduates who have previously started companies focused on retail point of sale systems and commerce analytics.<p>Our goal is to create a massively scalable self-service digital coupon platform to shift the 400 billion paper grocery coupon business to mobile.<p>We have developed and integrated a cloud-based solution into thousands of grocery and drug stores across the country. Our iOS application was the #2 productivity application on iTunes and has been featured by Apple multiple times.<p>We are looking for strong strong object-oriented developers with experience with PHP/Java and MySQL<p>Want to join the team? <a href=\"http://www.pushpinsapp.com/jobs/\" rel=\"nofollow\">http://www.pushpinsapp.com/jobs/</a>","time":1312218116,"type":"comment"},{"by":"rory_k","id":2859213,"parent":2831646,"text":"London, UK<p>C# developer<p>We're looking for a talented .net developer with a few years of experience to join our core product development team. It's a really varied role and with the company expanding there's a lot of room for career growth.<p>You'll have a good comp sci degree or equivalent, really enjoy writing code, and you'll want to work for a small company where what you do makes a difference.<p>We are a small software company creating innovative solutions for the Legal and Financial sectors. We're based in Shoreditch and our products are used by large firms to help them get greater value from online services.<p>Interested? \nemail jobs@priorysolutions.com\nsee <a href=\"http://priorysolutions.com/about/careers.aspx\" rel=\"nofollow\">http://priorysolutions.com/about/careers.aspx</a>","time":1312790616,"type":"comment"},{"by":"thomd","id":2832108,"parent":2831646,"text":"Cambridge and Brighton (UK)<p>Do you want to have a voice in strategy and policy, as well as how you do your work? Would you rather have fun and make a difference than get a giant corporate salary?<p>We are a not-for-profit organisation working in the international development sector who are passionate about using technology for social good. We are looking for smart software developers to join our team.<p>In addition to writing code, you may have opportunities to facilitate and train others, work in developing countries, build solar powered IT labs (or other hardware systems), manage projects, and present at conferences.<p>For details see <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1312206735,"type":"comment"},{"by":"martineschu","id":2837772,"parent":2831646,"text":"Delafield, WI Montage is hiring a permanent full-time employee.\nMontage, a rapidly growing technology company, is hiring a Senior User Experience/Interface Developer.  Design and development of a web-based application for the HR/Recruitment industry. Put your footprint on applications that will be used by millions of users!  Responsible for designing a new web application in ASP.NET MVC3 as well as helping to support an existing ASP.NET web application.  You will be working with product managers, architects and users to enhance the application’s feature set &#38; improve usability &#38; appearance.   C# &#38; ASP .NET 4.0 required. Apply at:  careers@montagetalent.com","time":1312303935,"type":"comment"},{"by":"snikolic","id":2832316,"parent":2831646,"text":"Boston/Cambridge, MA<p>Crimson Hexagon is looking for awesome developers: web developers, backend hackers, and everything in between.<p>We use machine learning to measure public opinion about major brands, politics, etc. using the social web as our datasource. We've collected, indexed, and are constantly mining an archive of over 50 billion web and social media documents, adding another 1+ billion each week. We especially need devs interested in scalability, search, and big data to help us keep up with all of the content we collect (including the full Twitter firehose).<p>Small team (just 4 engineers), mostly Java shop, plenty of free food and beer, just closed a $5mm Series B, and growing fast.<p>Drop me a line at stefan@crimsonhexagon.com","time":1312209269,"type":"comment"},{"by":"morganb","id":2832448,"parent":2831646,"text":"Los Angeles, CA<p>ScoreBig is a USVP and Bain backed company in Hollywood, CA that has raised more than $22 million to build the first consumer-friendly value channel for live event tickets. ScoreBig members pick their price and save up to 60% on sports, concert and theater tickets, while never paying any fees or delivery charges.<p>Check out the following openings and apply at <a href=\"http://careers.scorebig.com/\" rel=\"nofollow\">http://careers.scorebig.com/</a><p>ETL Developer,\nSenior QA Engineer,\nSoftware Engineer,\nSoftware Engineer in Test<p>Check out our flickr feed here for shots of the office and life at ScoreBig: <a href=\"http://www.flickr.com/photos/scorebig\" rel=\"nofollow\">http://www.flickr.com/photos/scorebig</a>","time":1312210892,"type":"comment"},{"by":"assembla","id":2839005,"parent":2831646,"text":"Assembla.is hiring remote Ruby on Rails developers. We are seeking experienced RoR backend developers <a href=\"https://www.assembla.com/search/show_job/888\" rel=\"nofollow\">https://www.assembla.com/search/show_job/888</a>\nand junior RoR devs for application internationalization.<a href=\"https://www.assembla.com/search/show_job/890\" rel=\"nofollow\">https://www.assembla.com/search/show_job/890</a>\nMore positions to be posted in the coming week. \nAssembla offers tools and workspaces to help accelerate software development. We are based in the Boston area with a distributed global development team. We develop with agile methodologies; we move fast.","time":1312324980,"type":"comment"},{"by":"brugidou","id":2831766,"parent":2831646,"text":"Paris, France - (interns accepted, no remote) - Criteo<p>We do a lot of things and use C# (.NET), memcached, hadoop/hive, mongoDB, SQL Server, RabbitMQ...<p>We are looking for great developers, passionate about engineering challenges … looking for the next problem to solve, in a fast-paced environment!\n- BS/MS n computer science or a scientific field \n- Excellent analytical skills/Strong focus on algorithmic thinking \n- Experience in software development (C#, Java or C++) \n- Ability to build high quality code \nAll the job descriptions are also on the French career page  <a href=\"http://www.criteo.com/fr/a-propos/emploi\" rel=\"nofollow\">http://www.criteo.com/fr/a-propos/emploi</a>","time":1312201634,"type":"comment"},{"by":"paxdickinson","id":2833409,"parent":2831646,"text":"New York, NY<p>Business Insider is looking for two awesome experienced backend PHP developers to join the fast-paced and exciting world of being an engineer at a journalism startup.\nWe're looking for some strong PHP developers who have tech chops, a startup mindset, and the ability to work hard and play hard. Business Insider is a great place to work. We're laid back, we don't let bureaucracy get in our way, and we play-ping pong in the office every day. It's honestly one of the best places I've ever worked, personally.<p>More info at link.<p><a href=\"http://www.businessinsider.com/wanted-php-developers-2011-7\" rel=\"nofollow\">http://www.businessinsider.com/wanted-php-developers-2011-7</a>","time":1312220333,"type":"comment"},{"by":"Stealx","id":2834093,"parent":2831646,"text":"TrainSignal: 9 years old, profitable from the start, high growth, Inc. 5000 Fastest Growing Companies for the past few years<p>E-Mail Marketing:\n<a href=\"http://trainsignal.theresumator.com/apply/X2bHvx/Internet-Email-Marketing-Specialist.html?source=HN\" rel=\"nofollow\">http://trainsignal.theresumator.com/apply/X2bHvx/Internet-Em...</a><p>Web Designer/Developer(will pay to relocate to Chicago):\n<a href=\"http://trainsignal.theresumator.com/apply/iqh5vb/Web-DesignerDeveloper.html?source=HN\" rel=\"nofollow\">http://trainsignal.theresumator.com/apply/iqh5vb/Web-Designe...</a><p>Also if you're a freelance web designer specializing in landing pages/product pages also e-mail me.<p>Any questions? iman@trainsignal.com","time":1312228528,"type":"comment"},{"by":"pyre","id":2832791,"kids":[2834607,2835799,2839254,2833126],"parent":2831646,"text":"Anyone hiring in Toronto? (I see one, but there was another thread a couple of days ago where it was suggested that companies are having trouble finding people in Toronto... so I would expect more postings here if that were the case.)","time":1312214217,"type":"comment"},{"by":"robstuttaford","id":2833369,"parent":2831646,"text":"Cape Town, South Africa. REMOTE ok.<p>All round JS centric developer to work on our own SAAS products.<p>We have a thorough job spec on our site: <a href=\"http://www.cognician.com/jobs/software-developer\" rel=\"nofollow\">http://www.cognician.com/jobs/software-developer</a>.","time":1312219824,"type":"comment"},{"by":"spolu","id":2831878,"parent":2831646,"text":"Crowd, France/UK [<a href=\"http://usecrowd.com\" rel=\"nofollow\">http://usecrowd.com</a>]<p>We're looking for our employee #1 (dev) in France/UK with eventual move to the US in the months to come.<p>Want a chance to change the way people see the world live?<p>Drop us a line at team@usecrowd.com","time":1312203588,"type":"comment"},{"by":"mikehummel","id":2833650,"parent":2831646,"text":"New York, NY<p>Lookbooks is a tech-based fashion company providing integrated marketing solutions in the fashion industry.  We are hiring for the following postings:<p>* LAMP Developer:  You are a seasoned LAMP developer with 5 – 7 years experience developing custom applications using MVC frameworks. (<a href=\"http://www.linkedin.com/jobs?viewJob&#38;jobId=1817724\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob&#38;jobId=1817724</a>)<p>* HTML 5 / CSS / JS Developer:  You should live and breath HTML 5, CSS and Javascript with 5 - 7 years experience in a professional environment.  You can take PSD or AI and convert them into well formed HTML.<p>Please send resumes to jobs@lookbooks.com","time":1312222877,"type":"comment"},{"by":"tcc619","id":2832753,"parent":2831646,"text":"Qwiki is looking for backend, android and devops engineers in SF. We are currently using Ruby/Scala for most of the server side code.<p>We are developing a platform to allow people to experience information in a compelling manner(visual, audio, story). We need your help to deliver this experience to the world. There's a lot of interesting challenges(text mining, media processing, scalable and performant services) to be solved.<p>feel free to email me direct at t <i>at</i> qwiki dot com.<p><a href=\"http://www.qwiki.com/about-us\" rel=\"nofollow\">http://www.qwiki.com/about-us</a>\n<a href=\"http://www.qwiki.com/work-here\" rel=\"nofollow\">http://www.qwiki.com/work-here</a>","time":1312213856,"type":"comment"},{"by":"johnnyjustice","id":2831917,"kids":[2832016],"parent":2831646,"text":"Blue Bell, PA<p>iPad Engineer/iOS Application Developer- Full Time<p>Software Engineer/Web Developer – Full Time<p>Software Engineer/Web Developer – Intern  (FALL 2011)<p>Network/LAN Administrator – Intern (FALL 2011)<p><a href=\"http://www.wingspan.com/about/careers/\" rel=\"nofollow\">http://www.wingspan.com/about/careers/</a>","time":1312204077,"type":"comment"},{"by":"sethbannon","id":2833599,"parent":2831646,"text":"New York, NY<p>BlueFusion is seeking a talented and experienced Rails developer who can quickly adapt to new situations and technologies in an entrepreneurial environment. We're a new startup moving fast and developing innovative solutions to unique problems in the political and non-profit sphere. BlueFusion offers the rare opportunity to make a difference in peoples lives while developing cutting edge technology. Become a core member of the team and help lead our vision into the future.<p>Interested in learning more? Email jobs+hn@bluefusion.org or visit <a href=\"http://www.bluefusion.org/jobs\" rel=\"nofollow\">http://www.bluefusion.org/jobs</a><p>H1B friendly.","time":1312222372,"type":"comment"},{"by":"danielhfrank","id":2833206,"parent":2831646,"text":"New York, NY - Software Engineer , fulltime<p>Trendrr is a real-time data processing engine that powers Trendrr.com, Trendrr.tv, and other media experiences. We are a small, lean startup. Our stack is built on open source, and we believe in giving back wherever possible. This is a very small development team, and you will have a hand in everything.<p>For more information about the position see: <a href=\"http://blog.trendrr.com/2011/05/24/software-engineer-wanted-...\" rel=\"nofollow\">http://blog.trendrr.com/2011/05/24/software-engineer-wanted-...</a>. or contact me directly, I am a developer at Trendrr and am happy to answer your questions","time":1312217965,"type":"comment"},{"by":"adjohn","id":2832583,"parent":2831646,"text":"San Francisco, CA / Tokyo, Japan, / Barcelona, Spain<p>Midokura is changing the way you think about networks.<p>We are looking for full time front-end and distributed systems engineers - <a href=\"http://www.midokura.com/careers.html\" rel=\"nofollow\">http://www.midokura.com/careers.html</a><p>We're small international team with offices in three countries.  We have a great team, and looking for a good fit to help us grow and attack more challenging problems.  Check out the descriptions and more about our company here - <a href=\"http://www.midokura.com/careers.html\" rel=\"nofollow\">http://www.midokura.com/careers.html</a><p>Feel free to hit me up at adam &#60;at&#62; midokura.com","time":1312212332,"type":"comment"},{"by":"theflow","id":2833736,"parent":2831646,"text":"Copenhagen, Denmark<p>Podio is hiring a backend developer.<p>We're building our take on the future of work, which is part social collaboration and part empowering users to build their own tools (think HyperCard for the web).<p>You'll be working on our Python based API, which powers our front-end and other clients. We believe strongly in metrics, testing and continuous integration.<p>You take pride in your craft and enjoy learning new technologies. You love to see your code running smoothly on production.<p>More infos:\n<a href=\"http://jobs.github.com/positions/3766e19c-bc4a-11e0-9989-89b62fe44619\" rel=\"nofollow\">http://jobs.github.com/positions/3766e19c-bc4a-11e0-9989-89b...</a>","time":1312224000,"type":"comment"},{"by":"vanhiker","id":2833349,"kids":[2870502],"parent":2831646,"text":"Vancouver, BC<p>SilkStart is looking to expand our team\nUI/UX and Back End Developers - We use mako, html, javascript, jquery, sass for our UI and pylons/mako for our back End<p>If you're interested please get in touch with us at jobs@silkstart.com","time":1312219599,"type":"comment"},{"by":"geraldinelrx","id":2838460,"parent":2831646,"text":"DC-based HelloWallet.com is hiring Java developers and offering a $5,000 referral bonus per hire. Backed by the Rockefeller Foundation, Steve Case, Jean Case and Grotech Ventures, HelloWallet is a financial guidance web app dedicated to boosting the wealth of its members. <i></i><i>We're offering a $5,000 referral bonus for extraordinary Java engineers. Anyone can submit a referral and earn $5k if their referral is hired.</i><i></i> Join us! Awesome team and environment right in the heart of DC. More info: www.hellowallet.com/about-us/jobs/","time":1312314850,"type":"comment"},{"by":"jonbischke","id":2883940,"kids":[2883978],"parent":2831646,"text":"San Francisco, CA (SOMA)<p>RG Labs is hiring: <a href=\"http://www.rglabsinc.com/jobs\" rel=\"nofollow\">http://www.rglabsinc.com/jobs</a><p><i>We operate under the premise that the most important decisions we make are decisions about people (e.g., who to start a company with, who to hire, who to date/marry...)<p></i>We also feel like the Web is in its infancy in terms of helping us to make better decisions based on data and that this space could explode in coming years.<p>*We'd like to be part of that explosion. :)<p>To hear more drop me a line directly at jonbischke at gmail or send us via our contact form. We'd love to tell you more.","time":1313340611,"type":"comment"},{"by":"sokoloff","id":2831980,"parent":2831646,"text":"Lexington, MA - Barcelona - Sydney - Windsor, ON<p>Vistaprint is hiring for a variety of technical positions (dev, ops, DBA, network, PM, data center engineer): <a href=\"http://bit.ly/great-tech-jobs\" rel=\"nofollow\">http://bit.ly/great-tech-jobs</a><p>I've been here a little over 8 years and despite the boring outward impression you may have (and I initially had) of \"Why would printing business cards be interesting?!?\", this is an interesting and challenging place to work, with some of the best colleagues I've ever worked with.<p>We have sponsored H1B in the past, for the ideal candidate.","time":1312205067,"type":"comment"},{"by":"niles","id":2843873,"parent":2831646,"text":"REMOTE\nOur Location: New York City or Los Angeles<p>&#62;&#62; iOS development &#38; Android development (2 location finder apps + 1 bubble-bobble style game = 6 apps total).<p>&#62;&#62; Server and API development (faceted searching with Solr or ElasticSearch, database design with MongoDB or postgres spatial.) You choose the language (python or ruby preferred) and help set the roadmap / timetable.<p>Reasonable, but not generous compensation, however, we have plenty of work through the end of the year at a minimum to keep you busy. Payment via oDesk or PayPal, no visa required.<p>Teams welcome (preferred).","time":1312417187,"type":"comment"},{"by":"jplewicke","id":2833583,"parent":2831646,"text":"Boston, MA (not remote)<p>MDT Advisers - We're a small quant investing fund working with:<p>- machine learning<p>- discrete optimization<p>- C<p>- large datasets<p>You can find a job description at <a href=\"http://www.mdtadvisers.com/careers/qea.jsp\" rel=\"nofollow\">http://www.mdtadvisers.com/careers/qea.jsp</a> . The people, problems, and pay are good, and we aim for sane work-life balance(e.g. 45 hour weeks, private offices).<p>The team and management come from a technical background and don't micro-manage you.  You also would have significant opportunity to work on your own research ideas and projects.<p>You can email me at jlewicke@mdtadvisers.com with any questions you have.","time":1312222234,"type":"comment"},{"by":"ADiMichele","id":2832788,"parent":2831646,"text":"San Francisco, CA - Omada Health Inc - Web Developer\nWe're a brand new startup applying the principles of social-web software to the treatment of a real public health condition (diabetes). We've gotten some great feedback so far (and some funding) so now we just need to build the damn thing (well, a prototype at least).\nIf you consider yourself a smart developer and want to work in the health field (because hey, it's up-and-coming and making a difference is fun) please shoot us an email!\njobs@omadahealth.com","time":1312214185,"type":"comment"},{"by":"krupan","id":2833033,"parent":2831646,"text":"Fusion-io.  We are hiring FPGA and ASIC design and/or verification engineers for both our Salt Lake City and San Jose offices.  Verilog, Xilinx, Altera, Systemverilog, UVM.  We make the fastest non-volatile storage in the world.  Prominent customers of our products are HP, IBM, Dell, Facebook, and Apple.  Smaller team, fast pace, very smart co-workers.<p>We probably have some software (linux device driver, build system, rpm/deb packaging, c and python) positions as well, just not on my team.  Email bmurdock AT fusionio.com.","time":1312216484,"type":"comment"},{"by":"kikin_brian","id":2832290,"parent":2831646,"text":"New York, NY (SoHo)\nkikin Inc - <a href=\"http://www.kikin.com/jobs\" rel=\"nofollow\">http://www.kikin.com/jobs</a><p>- iOS Engineer - <a href=\"http://www.kikin.com/jobs#mobile\" rel=\"nofollow\">http://www.kikin.com/jobs#mobile</a><p>- UI Designer - <a href=\"http://www.kikin.com/jobs#ui\" rel=\"nofollow\">http://www.kikin.com/jobs#ui</a><p>- Fall Engineering Intern - <a href=\"http://www.kikin.com/jobs#hack_intern\" rel=\"nofollow\">http://www.kikin.com/jobs#hack_intern</a><p>- Search Engineer - <a href=\"http://www.kikin.com/jobs#server\" rel=\"nofollow\">http://www.kikin.com/jobs#server</a>","time":1312208918,"type":"comment"},{"by":"andybarton23","id":2832572,"parent":2831646,"text":"Palo Alto, CA<p>Quora<p>We're continuing to build out the core team developing www.quora.com hiring software engineers and product designers: <a href=\"http://www.quora.com/jobs\" rel=\"nofollow\">http://www.quora.com/jobs</a>\nWith less than 30 employees, this is a chance to join at a stage where everyone's work will have a huge impact on the technology, the product, and the culture of the company. A unique opportunity to solve challenging problems and play a big part in building a highly visible consumer internet product.\nandy@quora.com","time":1312212198,"type":"comment"},{"by":"abreckle","id":2852458,"parent":2831646,"text":"Visual.ly, in San Francisco, CA<p><a href=\"http://visual.ly\" rel=\"nofollow\">http://visual.ly</a><p>We are building a next generation data visualization platform and are looking for front-end hackers with demonstrated expertise in all or many of the following to round out our engineering team. 5+ years javascript hacking experience, we use Backbone.js, jQuery, HTML5 and SVG.<p><a href=\"http://visually.jobscore.com/jobs/visually/lead-ui-engineer/dah_g6AUar4kwHeJe4bk1X\" rel=\"nofollow\">http://visually.jobscore.com/jobs/visually/lead-ui-engineer/...</a>","time":1312592121,"type":"comment"},{"by":"krschmidt","id":2831963,"parent":2831646,"text":"Eugene, OR\nCommunity College with an interest in upcoming academic technology and open source searching for:\n* Web Administrator - Moodle, Drupal, LAMP <a href=\"http://jobs.lanecc.edu/applicants/Central?quickFind=51921\" rel=\"nofollow\">http://jobs.lanecc.edu/applicants/Central?quickFind=51921</a>\n* Programmer/Analyst - Oracle, Sungard Banner <a href=\"http://jobs.lanecc.edu/applicants/Central?quickFind=51946\" rel=\"nofollow\">http://jobs.lanecc.edu/applicants/Central?quickFind=51946</a>","time":1312204780,"type":"comment"},{"by":"mmcgrana","id":2833924,"parent":2831646,"text":"San Francisco, CA<p>Heroku is hiring infrastructure engineers across all of our platform teams.<p>We develop a large distributed system that runs and manages thousands of applications in the cloud.  We're looking for engineers who are exited about working on challenging systems at scale.<p>Some specific things we work on:<p>- Dynamic HTTP and Syslog routing: Erlang, Redis<p>- Cloud-wide distributed process management: Ruby, PostgreSQL, AMQP<p>- Containerized process execution: Linux, LXC<p>- Platform substrate management: Ruby, EC2/ELB/S3<p>- Real-time event processing: Clojure<p>If you're interested in learning more, email me directly: mark@heroku.com.","time":1312226509,"type":"comment"},{"by":"Tofusensei","id":2832021,"parent":2831646,"text":"San Francisco, CA (H1B friendly, entry-level OK)<p>ThoughtLeadr (www.thoughtleadr.com) is an angel-funded early stage B2B startup. We're building social media analytics, ad targeting and engagement solutions for content-generation sites (think reddit, not facebook).<p>We're looking to hire a very smart engineer to help build and support our back-end systems. Be prepared to deal with BIG data.<p>Be very comfortable on a linux command line and have a deep understanding of programming concepts.<p>email your resume &#38; sample code to jobs@thoughtleadr.com","time":1312205691,"type":"comment"},{"by":"ashbrahma","id":2832207,"kids":[2832234],"parent":2831646,"text":"Kansas City, MO. H1B<p>Handmark - Mobile Apps developer. www.handmark.com<p>Android Developer: <a href=\"http://handmark.catsone.com/careers/index.php?m=portal&#38;a=details&#38;jobOrderID=567741\" rel=\"nofollow\">http://handmark.catsone.com/careers/index.php?m=portal&#38;a...</a><p>Server Software Engineer: <a href=\"http://handmark.catsone.com/careers/index.php?m=portal&#38;a=details&#38;jobOrderID=346853\" rel=\"nofollow\">http://handmark.catsone.com/careers/index.php?m=portal&#38;a...</a><p>Email is on my profile and please mention HN on the subject line.","time":1312207926,"type":"comment"},{"by":"psota","id":2833219,"parent":2831646,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) is changing the way companies do business across borders. We're VC-backed by the same investors that backed ITA Software, Groupon, Akamai, etc. We're also profitable and have thousands of customers. Hiring in engineering (UI; UX; frontend; backend data mining/ops) and business (marketing, sales, etc.). See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1312218096,"type":"comment"},{"by":"czue","id":2831870,"parent":2831646,"text":"Boston, MA<p>Dimagi is looking for exceptional software developers to join our ranks.  We are a small and growing social enterprise based in Boston but our systems are deployed primarily in rural Africa and Asia.  We offer a fun and stimulating environment, a chance to see the world, and to make a difference in places that need it most.   At Dimagi, you can do right by coding well.<p><a href=\"http://www.dimagi.com/about/careers/\" rel=\"nofollow\">http://www.dimagi.com/about/careers/</a><p>Please reference HN in your application.","time":1312203432,"type":"comment"},{"by":"nicosteeg","id":2834336,"parent":2831646,"text":"Paris, France - Stupeflix [<a href=\"http://stupeflix.com\" rel=\"nofollow\">http://stupeflix.com</a>]<p>We're looking for one front end and one back end engineer to join our team of five and help the world create awesome videos via our web app (available on Youtube.com/create) and our API (producing millions of videos a month). Come work on the GPU rendering engine, pixel-refine an advanced web app, and challenge us on Kinect.\nSend your Kinect Sports highest score to contact@stupeflix.com","time":1312231947,"type":"comment"},{"by":"jeffcody","id":2831895,"parent":2831646,"text":"Indiana (Fort Wayne)<p>Permanent Local is preferred, but will also consider permanent remote and freelance as well.<p>We are looking for both embedded Linux and traditional embedded developers.<p>Some things you'd be working on include first time board bring-up (ARM based processors) with u-boot and Linux, so you need to be comfortable with low-level drivers and Linux porting.<p>Android experience is a plus, some of these Linux ports are also Android ports.<p>My email addresses are in my profile - either email address will work.  Please mention HN in your email.","time":1312203795,"type":"comment"},{"by":"DaveSwift","id":2832298,"parent":2831646,"text":"Boston, MA - Magento Developer - Looking for truly intelligent, fun, passionate PHP developers looking to join a rapidly growing team and solve complex challenges. We primarily work on large scale e-commerce implementations for big brands – i.e. 3M, Scholastic, Crumbs, Griffin Technology, etc.<p><a href=\"http://www.onepica.com/marketing-technology-agency/careers/web-application-developer\" rel=\"nofollow\">http://www.onepica.com/marketing-technology-agency/careers/w...</a>","time":1312209039,"type":"comment"},{"by":"bmj","id":2832105,"parent":2831646,"text":"Pittsburgh, PA<p>Senior Developer: <a href=\"http://www.invivodata.com/aboutus/careers/senior-software-developer/\" rel=\"nofollow\">http://www.invivodata.com/aboutus/careers/senior-software-de...</a><p>Junior Developer: <a href=\"http://www.invivodata.com/aboutus/careers/software-developer-i/\" rel=\"nofollow\">http://www.invivodata.com/aboutus/careers/software-developer...</a><p>I work on the product team (which is hiring the senior dev), and it's really interesting work, with a mix of device and web development.","time":1312206726,"type":"comment"},{"by":"sanjayparekh","id":2835544,"parent":2831646,"text":"We're doing our second Startup Riot career fair in Atlanta on August 10th.  So far there are 17 startups hiring for a total of 182 jobs and 28 internships.  We'll be doing one in Seattle on August 23rd.  Apps to hire for both are now open.  Apps for job seekers in Atlanta are open and Seattle should be open in a few days.<p><a href=\"http://startupriot.com/career-fair-atlanta-august-2011\" rel=\"nofollow\">http://startupriot.com/career-fair-atlanta-august-2011</a>","time":1312254244,"type":"comment"},{"by":"tudorg","id":2832333,"kids":[2836026],"parent":2831646,"text":"Berlin, Germany<p>IPTEGO is looking for C/C++ developers (<a href=\"http://www.iptego.com/jobs/software-developer-cc\" rel=\"nofollow\">http://www.iptego.com/jobs/software-developer-cc</a>) and Field Application Engineers (<a href=\"http://www.iptego.com/jobs/field-applications-engineer\" rel=\"nofollow\">http://www.iptego.com/jobs/field-applications-engineer</a>). No remote work, but we can help you relocate. A bunch of HN lurkers would like to meet you!","time":1312209469,"type":"comment"},{"by":"apinstein","id":2841256,"parent":2831646,"text":"Atlanta, GA<p>TourBuzz is a high-growth startup that develops and markets industry-leading real-estate marketing solutions.<p>If you want to build using leading-edge tools, ship products that people love to use and actually pay for, and work with great people in a learning-oriented environment, we'd love to talk to you.<p><a href=\"http://tourbuzz.theresumator.com/apply/OrCFtE/Senior-Web-Developer.html\" rel=\"nofollow\">http://tourbuzz.theresumator.com/apply/OrCFtE/Senior-Web-Dev...</a>","time":1312381235,"type":"comment"},{"by":"tsewlliw","id":2834230,"parent":2831646,"text":"Austin, TX<p>SmartBear Software - CodeCollaborator<p>Like tools? So do we. We make a tool that makes being a developer better. No matter if you're a angry ClearCase expert, UX crusader, Visual Studio die-hard, Eclipse classloader wank, or Git guru -- you know that someone else looking at your code is good. We aim to keep making that eyeball time more valuable, and more measurable, and help show people in other fields the power of tool assisted review.<p>will.west@smartbear.com","time":1312230342,"type":"comment"},{"by":"wrath","id":2832019,"parent":2831646,"text":"Ottawa, Ontario, Canada<p>Gazaro is hiring 2 full-time Python developers and a QA Engineer.  (<a href=\"http://www.gazaro.com/careers\" rel=\"nofollow\">http://www.gazaro.com/careers</a>)<p>Gazaro specializes in gathering prices from retail products, matching products from different retailers, compiling the data and performing statistical analysis.  We have a consumer based website and an b2b product.<p>Drop me an email careers@gazaro.com attention \"Dominic\" if you're interested.","time":1312205634,"type":"comment"},{"by":"timruffles","id":2832028,"parent":2831646,"text":"Picklive - Real-time fantasy sports gambling, London, UK, in White Bear Yard, funded. Looking for anyone interested in writing Javascript with all the toys (Backbone, Coffee-script, JsTestDriver etc). We use Ruby for our simulation and Rails for our web stuff.<p>Not worried about experience/pieces of paper - come in and we'll write some code together.<p><a href=\"http://picklive.com\" rel=\"nofollow\">http://picklive.com</a> or get in touch via my profile.","time":1312205846,"type":"comment"},{"by":"Matt_Mickiewicz","id":2833536,"parent":2831646,"text":"San Francisco, CA - VP of Marketing<p>99designs is the #1 marketplace for crowdsourced graphic design. We connect passionate designers from around the globe with customers seeking quality, affordable design services.<p>Are you a product-centric marketing gun with a track record of success?\nLooking for an opportunity to unleash your talent and make a difference on a global scale?<p>Then we’ve got the job for you.<p>99designs.com is the #1 online marketplace for crowdsourced graphic design services. With a community of over 100,000 freelance designers and 75,000 customer projects delivered in just 3 years, we’re taking the world by storm. To date we’ve grown 120% year-on-year almost purely on word-of-mouth from customers and designers that rave about our service... and now it’s time to step up a gear.<p>We need a talented marketer to accelerate growth and take our business to the next level. Someone who understands product development intimately (two-sided marketplace experience a real plus), who can craft a holistic marketing strategy and then lead our team of external and internal marketing specialists to execute it.<p>Key Areas of Responsibility:<p>- Setting marketing priorities and directing teams to execute them\n- Working with the design team to improve conversion rates\n- Increasing retention of existing customers with targeted up-sell and cross-sell strategies\n- Increasing referral by encouraging customers to make introductions\n- Increasing new visits by managing PPC and other paid advertising opportunities\n- Increasing new visits through SEO best practice\n- Building out and managing the marketing team\n- Managing PR strategy and executing all initiatives (internal/external)\n- Owning key marketing metrics and reporting to the Board as well as the wider team<p>Ideal Applicant Attributes:<p>- Extensive history in marketing-led product development (5+ years relevant experience)\n- A strong analytics background and a metrics driven approach to marketing\n- Hands-on startup and team building experience\n- Demonstrable track record of acquisition marketing success in a B2B environment\n- SME business market / “Pro Consumer” specialist<p>This job is based out of San Francisco, California, in a very central waterfront location that is also inhabited by other creative web startups such as Automattic (the makers of WordPress), Lab Zero and Dog Patch Labs.","time":1312221736,"type":"comment"},{"by":"cpg","id":2833929,"parent":2831646,"text":"Sunnyvale, CA<p>Looking for kick-ass co-founders for Amahi (profitable early stage) with either:<p>- a strong business development background, current marketing skillz, hopefully with OEM and VAR contacts to boot<p>- a demonstrated strong technical background, with emphasis on Linux, software distribution, servers, web apps, ruby, and RoR<p>- a multi-talented <i>current</i> marketing background<p>Amahi is a profitable early-stage startup making the coolest way to deploy and configure a media and app server","time":1312226578,"type":"comment"},{"by":"ericsilver","id":2832088,"parent":2831646,"text":"Pittsburgh, PA  H1B<p>Pikimal is looking for people interested in NLP, search, and information retrieval.  We've a fast-growing collection of facts, facets, and evolving definitions of common adjectives, but we'd like some help making these assets more useful.<p>We code in Ruby, but have had good experiences hiring people without Ruby experience.  We're also looking for a best-in-class SQL tuner for contract work.<p>You can get in touch with me at eric@pikimal.com","time":1312206531,"type":"comment"},{"by":"qixxiq","id":2831949,"parent":2831646,"text":"Cape Town (ZA)<p>SnapBill - <a href=\"http://www.snapbill.com\" rel=\"nofollow\">http://www.snapbill.com</a><p>We're a small team of five in the billing &#38; website hosting space -- looking for our third developer/sysadmin to help out with our website hosting end (EC2 / Node.js / Python / RoR) and a bit on the billing systems side (PHP &#38; MySQL app)<p><a href=\"http://www.snapbill.com/jobs/developer\" rel=\"nofollow\">http://www.snapbill.com/jobs/developer</a>","time":1312204618,"type":"comment"},{"by":"rmorrison","id":2833183,"kids":[2833904],"parent":2831646,"text":"Palo Alto, CA - Comprehend Systems (YC W11)<p>We're hiring both frontend and backend engineers to help create next-generation reporting and visualization tools for clinical trials. We're striving to improve the clinical trial process, directly helping new drugs get into the hands of patients who need them faster!<p><a href=\"http://www.comprehend.com/about_careers.html\" rel=\"nofollow\">http://www.comprehend.com/about_careers.html</a>","time":1312217835,"type":"comment"},{"by":"knowtheory","id":2831934,"parent":2831646,"text":"Hey guys, I'm just about to finish up my term with Videojuicer (after several years!), and they're looking to hire someone to replace (and extend) my skill set.<p>The tl;dr is that they're looking for someone who fits these qualities:<p>* Lives in London or Brighton (UK), and is happy working remotely<p>* Cares about software craftsmanship (test first TDD, agile development &#38; some pairing)<p>* Cares about open standards and open source software<p>* Solid dev skills in actionscript3 (bonus points for exp w/ video)<p>* Solid dev skills on the JVM (bonus points for Scala)<p>* Happy building in at least one modern interpreted language (Ruby, Python, Javascript)<p>------------------------------------------<p>The full deal is that Videojuicer is a London based technology and media company.<p>We've got a close knit team of devs and all around good guys who have built a unique video experience platform.  We've got a commitment to open web standards, and have even gone to the extent of making our (unfortunately flash-based) video player programmable using Javascript and styleable with CSS3.<p>Much of our player is open sourced and you can find it on our github page (see: <a href=\"https://github.com/videojuicer/smilkit-as3\" rel=\"nofollow\">https://github.com/videojuicer/smilkit-as3</a> and <a href=\"https://github.com/videojuicer/stylekit-as3\" rel=\"nofollow\">https://github.com/videojuicer/stylekit-as3</a> in particular).<p>The cool part about our full stack video serving platform is that we've focused on minimalist ReSTful component design, which has given us the flexibility and power to be able to experiment and build new visual experiences.<p>Our video player in particular is a cool piece of tech and in conjunction w/ our platform lets users build custom interactive experiences w/in the player (again w/ JS &#38; CSS3), and deploy them selectively attached to relevant videos.<p>You can ping jobs@videojuicer.com, or hit up Ted Han (<a href=\"http://twitter.com/knowtheory\" rel=\"nofollow\">http://twitter.com/knowtheory</a> ) or Dan Glegg (<a href=\"http://twitter.com/angryamoeba\" rel=\"nofollow\">http://twitter.com/angryamoeba</a> ) for more info.  Our email addresses are also our first names at videojuicer.com.<p>Also, feel free to ask me anything 'bout the job here if you have questions :)","time":1312204449,"type":"comment"},{"by":"jaos","id":2834796,"parent":2831646,"text":"Pittsburgh, PA (intern, full-time,remote): Timesys<p>We are looking for embedded Linux kernel developers, build system gurus, gnu tool hackers, userspace application developers, and support engineers.<p>In office environment very fun, team oriented with kegerator, video game breakroom, and hilarious water cooler discussions.<p><a href=\"http://www.timesys.com/company/careers\" rel=\"nofollow\">http://www.timesys.com/company/careers</a><p>tell em jaos sent you","time":1312237565,"type":"comment"},{"by":"wmandrell","id":2838591,"parent":2831646,"text":"Los Angeles, CA<p>I have no experience with HTML, CSS, programming, or website design. I was hit with a brilliant idea for a social networking, user review, and local search web site months ago that can create excess income for many of the common talented/skilled that lack the resources.<p>I am on an inexorable hunt for a tech co-founder! I am passionate about my concept and vision. Only the hungry reply.<p>wmandrell.iv@gmail.com","time":1312317171,"type":"comment"},{"by":"tomh","id":2831698,"parent":2831646,"text":"Waltham, MA, local only, no remote. H1B a possibility.<p>OpenClinica is hiring Java Developers (Java EE + Spring + Hibernate + Eclipse + Maven, etc), Inside Sales Associates, Clinical Trial Setup Managers and others.  Check it out here:<p><a href=\"https://www.openclinica.com/openclinica-careers\" rel=\"nofollow\">https://www.openclinica.com/openclinica-careers</a><p>Feel free to contact me if you have questions. (Email in sig)","time":1312200439,"type":"comment"},{"by":"erso","id":2835328,"parent":2831646,"text":"New York, NY &#38;&#38; San Francisco, CA<p>Pivotal Labs is always looking for talented developers. We're an agile Rails/iOS shop and have done work for clients like Twitter and Groupon, not to mention a whole host of startups. We're located in the heart of Union Square at 14th and Broadway.<p>And we just bought a new ping pong table.<p><a href=\"http://pivotallabs.com/jobs\" rel=\"nofollow\">http://pivotallabs.com/jobs</a>","time":1312249227,"type":"comment"},{"by":"dbuizert","id":2832103,"kids":[2833285],"parent":2831646,"text":"This might be an odd location... But is there anyone hiring an Information Security Manager (or junior position)?<p>A lot of the businesses on here only focus on developing and pushing. I have yet to find one that provides that. \nIf there is a business with H1B, please let me know! I am currently looking for one.<p>Down vote if you don't think this is the right location. Could always open a new one.","time":1312206713,"type":"comment"},{"by":"jazzdev","id":2833545,"parent":2831646,"text":"San Francisco, CA &#38; Seattle, WA<p>DocuSign is looking for mobile developers (Objective-C, Java, JavaScript) and back-end developers (C#).  We're a pre-IPO company that's going strong and growing.  For details on our openings see:<p><a href=\"http://www.docusign.com/company/careers\" rel=\"nofollow\">http://www.docusign.com/company/careers</a><p>You can apply and submit a resume through the web site (above).","time":1312221850,"type":"comment"},{"by":"teikametrics","id":2832288,"parent":2831646,"text":"Teikametrics in Boston, MA<p>We're a well financed early stage company and are seeking a talented and passionate Ruby Developer to enhance and improve our e-commerce analytics platform.<p>Please email us at info@teikametrics.com if you're interested.<p>Our full posting is here: <a href=\"https://github.com/bostonrb/bostonrb/wiki/Jobs\" rel=\"nofollow\">https://github.com/bostonrb/bostonrb/wiki/Jobs</a>","time":1312208910,"type":"comment"},{"deleted":true,"id":2831891,"parent":2831646,"time":1312203746,"type":"comment"},{"by":"postwait","id":2832150,"parent":2831646,"text":"Columbia, MD<p>Circonus - <a href=\"https://circonus.com/about/careers\" rel=\"nofollow\">https://circonus.com/about/careers</a><p>Startup. Game on. careers@circonus.com","time":1312207209,"type":"comment"},{"by":"jbapple","id":2835817,"parent":2831646,"text":"Eugene, Oregon, internship possible, noremote, H1B applicants welcome.<p>On Time Systems develops scheduling, routing, and other AI applications. Right now we're looking for engineers for our pilot and driver routing applications. We are actively hiring.<p><a href=\"http://www.otsys.com/newpages/employment.php\" rel=\"nofollow\">http://www.otsys.com/newpages/employment.php</a>","time":1312259923,"type":"comment"},{"by":"sanj","id":2831997,"parent":2831646,"text":"Newton, MA<p>TripAdvisor is hiring developers.  Come push back the boundaries of mobile &#38; social at a company still run by its founder.<p>Read about how we develop here: <a href=\"http://highscalability.com/blog/2011/6/27/tripadvisor-architecture-40m-visitors-200m-dynamic-page-view.html\" rel=\"nofollow\">http://highscalability.com/blog/2011/6/27/tripadvisor-archit...</a>","time":1312205341,"type":"comment"},{"by":"CharleyTodd","id":2831820,"kids":[2831976,2831972],"parent":2831646,"text":"New York City<p>Permanent position.<p>iOS Developer<p>You can check out our team here <a href=\"http://dev.quanticfox.com/our-team\" rel=\"nofollow\">http://dev.quanticfox.com/our-team</a>","time":1312202474,"type":"comment"},{"by":"wikyd","id":2832024,"parent":2831646,"text":"San Francisco, CA -- InternMatch<p>InternMatch is looking to hire a software developer as employee #1.  We are looking for an entrepreneurial developer whose next job description will likely read \"Founder.\"  More details at: <a href=\"http://www.internmatch.com/about/jobs\" rel=\"nofollow\">http://www.internmatch.com/about/jobs</a><p>Contact us at jobs@internmatch.com","time":1312205755,"type":"comment"},{"by":"plusbryan","id":2832626,"parent":2831646,"text":"San Francisco, CA - Sincerely<p>Sincerely is an early-stage, funded, and revenue-generating startup started by two former YC founders (@brezina and @plusbryan). We're a small driven team of 7 developers and designers with two popular apps launched so far: popbooth.com and postagramapp.com.<p>We're looking for talented ios, android, and web (node/php) engineers.<p>bryan@sincerely.com","time":1312212713,"type":"comment"},{"by":"jorgeortiz85","id":2833866,"parent":2831646,"text":"New York &#38; San Francisco - foursquare<p><a href=\"https://foursquare.com/jobs\" rel=\"nofollow\">https://foursquare.com/jobs</a><p>We're hiring for Android, Blackberry, iPhone, front-end and server-side engineers.<p>We're defining (and building!) the future of location products, and we need all the help we can get. Come help us change how people interact with the world around them.","time":1312225515,"type":"comment"},{"by":"derrekl","id":2833216,"parent":2831646,"text":"Los Angeles, CA<p>Washington, DC<p>Taxi Magic<p>Iphone, Android, Ruby engineers: <a href=\"http://taximagic.theresumator.com/\" rel=\"nofollow\">http://taximagic.theresumator.com/</a>","time":1312218067,"type":"comment"},{"by":"thetable","id":2832749,"kids":[2833178,2834567,2871093],"parent":2831646,"text":"Ableton in Berlin is hiring C and Python developers:<p><a href=\"http://www.ableton.com/jobs\" rel=\"nofollow\">http://www.ableton.com/jobs</a>","time":1312213826,"type":"comment"},{"by":"dsr_","id":2832092,"parent":2831646,"text":"Cambridge MA, Kendall Square<p>Smartleaf is looking for a senior sysadmin (Linux), clever devs (especially Ruby), and a marketing research manager.<p>We do a particular kind of SAAS for banks and brokerages: portfolio analysis and management. All our customers like us.<p><a href=\"http://www.smartleaf.com/about/careers\" rel=\"nofollow\">http://www.smartleaf.com/about/careers</a>","time":1312206582,"type":"comment"},{"by":"RandallBrown","id":2832416,"parent":2831646,"text":"Lansing Michigan<p>TechSmith is hiring lots of developer (Mac, Windows, &#38; Mobile), design, and QA positions. We're looking for good all around developers, if you don't know our technologies that's okay as long as you're willing to learn.<p><a href=\"http://www.techsmith.com/company/jobs.asp\" rel=\"nofollow\">http://www.techsmith.com/company/jobs.asp</a>","time":1312210406,"type":"comment"},{"by":"ericb","id":2832476,"parent":2831646,"text":"Waltham MA<p>Coldwell Banker / NRT Insurance<p>We are a small development team looking for Ruby on Rails/Drupal developer (proficiency in one is needed, both a plus).<p>We offer competitive pay, a small flexible environment, but the stability of a large company, rewarding work, and a free gym in the building to boot.<p>Drop me a line on Gmail if you want to hear more. I'm ebeland.","time":1312211293,"type":"comment"},{"by":"freddealmeida","id":2831882,"kids":[2831995,2853273,2831947],"parent":2831646,"text":"Anyone hiring in Japan?","time":1312203613,"type":"comment"},{"by":"mathaix","id":2831899,"parent":2831646,"text":"Boston, MA &#38; Providence, RI:\nMobiquity is looking for Mobile Engineers(iOS, Android), Java Server Engineers and UX Architects. We build Mobile Enterprise applications. We have signed signed some major deals and are looking to double our team.\nemail me at mmathew [at] mobiquityinc.com","time":1312203847,"type":"comment"},{"by":"lukatmyshu","id":2833656,"parent":2831646,"text":"Mountain View, CA San Francisco, CA New York City, NYC\nMeebo\nWork on projects that reach over 185+ million users a month. remote employee's totally cool as well. Check out a list of all of our jobs here <a href=\"http://www.meebo.com/jobs/\" rel=\"nofollow\">http://www.meebo.com/jobs/</a>","time":1312223011,"type":"comment"},{"by":"mathaix","id":2831875,"parent":2831646,"text":"Boston, Providence.\nMobiquity <a href=\"http://www.mobiquityinc.com\" rel=\"nofollow\">http://www.mobiquityinc.com</a> is growing aggressively. Looking for UX Architects, Mobile Engineers(iOS &#38; Android), Server Engineers (Java, Ruby). Email me directly : mmathew [at] mobiquityinc.com","time":1312203503,"type":"comment"},{"by":"josharian","id":2833106,"parent":2831646,"text":"San Francisco (Mission district): <a href=\"https://www.card.io/\" rel=\"nofollow\">https://www.card.io/</a><p>Seeking amazing engineers of all stripes. We work on mobile, payments, computer vision and machine learning -- join us.<p><a href=\"https://gist.github.com/821454/\" rel=\"nofollow\">https://gist.github.com/821454/</a>","time":1312217099,"type":"comment"},{"by":"jamwt","id":2833970,"parent":2831646,"text":"Bump is hiring: <a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a><p>Come work here and help us get every man, woman, and child bumping.  Or just stop by and have a beer:<p><a href=\"http://bumpinterns.posterous.com/bump-for-a-beer\" rel=\"nofollow\">http://bumpinterns.posterous.com/bump-for-a-beer</a>","time":1312226998,"type":"comment"},{"by":"newgrad","id":2846591,"parent":2831646,"text":"San Francisco, CA.<p>Boku is looking for a web developer. Need to be an experienced one. Will be dealing with PHP (Symfony framework), JQuery, HTML, CSS, REST APIs. Mobile UI development experience is a plus.<p><a href=\"http://www.boku.com/about/jobs/\" rel=\"nofollow\">http://www.boku.com/about/jobs/</a>","time":1312474836,"type":"comment"},{"by":"jniemasik","id":2835423,"parent":2831646,"text":"Palo Alto, CA - Telekinetic Medical<p>Save lives and reinvent emergency medicine!\nWe're an incubated startup looking for an iOS developer — read more here: <a href=\"http://www.telekineticmedical.com/jobs/ios.html\" rel=\"nofollow\">http://www.telekineticmedical.com/jobs/ios.html</a>","time":1312251641,"type":"comment"},{"by":"twakefield","id":2835369,"parent":2831646,"text":"Mailgun (YC W11) in San Francisco, CA<p>Mailgun is looking for engineers to help people communicate with machines and each other.  We are a small team and you will help set the trajectory of the company in a very meaningful way.<p>We primarily use Python, Java and MongoDB.<p>Email founders@mailgun.net if interested.","time":1312250062,"type":"comment"},{"by":"jonursenbach","id":2833740,"parent":2831646,"text":"San Francisco (full-time, remote for right fit) - gdgt<p>We're 5 guys right now with an aggressive roadmap, and want to expand to at least 6. Looking for a core engineer.<p>Stack: PHP, NodeJS, JS, jQuery, MySQL, Gearman, Memcache<p>More info at <a href=\"http://gdgt.com/jobs\" rel=\"nofollow\">http://gdgt.com/jobs</a>","time":1312224055,"type":"comment"},{"by":"xal","id":2831987,"kids":[2834425],"parent":2831646,"text":"Shopify in Ottawa, ON<p><a href=\"http://www.shopify.com/careers\" rel=\"nofollow\">http://www.shopify.com/careers</a>","time":1312205260,"type":"comment"},{"by":"christyyyjoy","id":2833265,"parent":2831646,"text":"San Diego, CA - StockTwits<p>Ruby Developer: <a href=\"http://stocktwits.jobscore.com/jobs/stocktwits/ruby-developer-for-fast-growing-social-finance-platform/bRPhl0TU8r4kq5eJe4bk1X\" rel=\"nofollow\">http://stocktwits.jobscore.com/jobs/stocktwits/ruby-develope...</a>","time":1312218746,"type":"comment"},{"by":"lukas","id":2833034,"parent":2831646,"text":"San Francisco (Mission) H1B<p>CrowdFlower<p>We are hiring frontend and backend engineers.  We use Rails, Postgres, Redis, R, etc.<p>Familiarity with Crowdsourcing or machine learning a plus.  Help us give everyone in the world access to jobs.<p>Shoot me an email at lukas at crowdflower.com if you'd like to learn more.","time":1312216498,"type":"comment"},{"by":"boctor","id":2861181,"parent":2831646,"text":"Preferably in Seattle, but remote OK<p>We're looking for an Android developer at Zaarly.<p>We're a fun team.<p>You can see our existing app here: <a href=\"https://market.android.com/details?id=com.zaarly.client\" rel=\"nofollow\">https://market.android.com/details?id=com.zaarly.client</a><p>Hit me up: peter@zaarly.com","time":1312830408,"type":"comment"},{"by":"drusenko","id":2833015,"parent":2831646,"text":"San Francisco, CA -- Weebly is hiring for these impressive business card titles:<p>Spam Domination Engineer<p>Super-senior Front-end Web Developer\n(this position has a fun challenge to solve!)<p>More here:\n<a href=\"http://www.weebly.com/jobs.php\" rel=\"nofollow\">http://www.weebly.com/jobs.php</a>","time":1312216313,"type":"comment"},{"by":"bluejq","id":2832790,"parent":2831646,"text":"Oklahoma City, OK<p>Programmer Analyst - University of Oklahoma<p>Looking for .NET / Web dev / SQL experience.<p><a href=\"https://jobs.ou.edu/applicants/jsp/shared/position/JobDetails_css.jsp?postingId=247097\" rel=\"nofollow\">https://jobs.ou.edu/applicants/jsp/shared/position/JobDetail...</a>","time":1312214213,"type":"comment"},{"by":"bgowttamen","id":2832616,"parent":2831646,"text":"Coimbatore, India - InfaGPS<p>InfaGPS is a Fleet management - Real time fleet tracking and Web based ERP solutions provider for SMB's.<p>We are looking for developers with expertise in Java, .Net \nWrite to us at jobs@infagps.com\nCheck out about us at www.infagps.com","time":1312212661,"type":"comment"},{"by":"amduser29","id":2833385,"parent":2831646,"text":"San Francisco, CA<p><a href=\"http://www.life360.com/jobs\" rel=\"nofollow\">http://www.life360.com/jobs</a><p>Life360 is turning smartphones into the ultimate safety device.  We could use your help giving over 4,000,000 families reassurance and peace of mind.<p>Contact: alex@life360.com","time":1312219980,"type":"comment"},{"by":"milanvrekic","id":2832291,"parent":2831646,"text":"TitanFile is looking for a full time Python/Django developer in Halifax or Waterloo:<p><a href=\"http://www.titanfile.com/blog/python-django-developer-wanted-ui/\" rel=\"nofollow\">http://www.titanfile.com/blog/python-django-developer-wanted...</a>","time":1312208928,"type":"comment"},{"by":"bobx11","id":2835712,"parent":2831646,"text":"Cambridge, MA<p>We are building software to help universities find better students.  We are located in Kendal Square and are looking for iOS and Python hackers that like building product.  Our work:  www.AdmitPad.com<p>Want to hear more?  iheartcode@admitpad.com","time":1312257510,"type":"comment"},{"by":"sethbannon","id":2833659,"parent":2831646,"text":"New York, NY.<p>Want to change the world by disrupting the worlds of politics and philanthropy? So do we, and we're hiring. Details here: <a href=\"http://www.bluefusion.org/jobs\" rel=\"nofollow\">http://www.bluefusion.org/jobs</a><p>Or email jobs+hn@bluefusion.org","time":1312223029,"type":"comment"},{"by":"perlpimp","id":2833167,"parent":2831646,"text":"OnSite: Moscow, Russia, Visa support/accommodation will be provided. 6 month contract, leading to permanent possible in SF / Bay.<p>Ruby on Rails with Javascript(jQuery/Sencha) [Fontend]\nRuby on Rails with PostgreSQL / NoSQL [Backend]<p>pavel.v.zaitsev@gmail.com","time":1312217644,"type":"comment"},{"deleted":true,"id":2831869,"parent":2831646,"time":1312203429,"type":"comment"},{"by":"kamens","id":2835813,"parent":2831646,"text":"Khan Academy (Mountain View, remote is a possibility).<p>We're looking for top-notch developers to help create a free virtual classroom for the world.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1312259750,"type":"comment"},{"by":"BuddhaSource","id":2832082,"kids":[2832897],"parent":2831646,"text":"Mumbai, India.<p>Crumbs is hiring JavaScript &#38; Mobile developer for a communication platform for business &#38; consumers we are building.<p><a href=\"http://crumbin.com/Join-our-team\" rel=\"nofollow\">http://crumbin.com/Join-our-team</a>","time":1312206490,"type":"comment"},{"by":"mindotus","id":2832326,"parent":2831646,"text":"New York City<p>Minus is looking for frontend, backend and mobile devs in our midtown office. More details on <a href=\"http://Min.us/pages/jobs\" rel=\"nofollow\">http://Min.us/pages/jobs</a> ! :)<p>Email me john@minus.com with any questions.<p>Cheers","time":1312209406,"type":"comment"},{"by":"lawnchair","id":2834872,"parent":2831646,"text":"Baltimore, MD\n<a href=\"http://www.millennialmedia.com/about-millennialmedia/careers/\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers...</a>","time":1312238900,"type":"comment"},{"by":"mathnode","id":2832102,"kids":[2832875],"parent":2831646,"text":"London, UK<p>Photobox (www.photobox.com). Looking for a MySQL DBA of moderate to high-level experience.<p>We also need talented developers with Javascript and/or Perl skills. richard.bensley@photobox.com","time":1312206705,"type":"comment"},{"by":"seliopou","id":2832526,"parent":2831646,"text":"Providence, RI<p>Tracelytics is hiring<p>* Software engineer: C/C++ systems hacker and python aficionado.<p>* Product Marketing Manager: contribute to strategy, and execute marketing campaigns<p>Email us: jobs@tracelytics.com","time":1312211711,"type":"comment"},{"by":"rkarumanchi","id":2832853,"parent":2831646,"text":"Flipkart.com, Bangalore<p>US, Western Europe : Amazon.com :: India : Flipkart.com<p><a href=\"http://www.flipkart.com/s/careers\" rel=\"nofollow\">http://www.flipkart.com/s/careers</a>","time":1312214681,"type":"comment"},{"by":"yawniek","id":2832061,"parent":2831646,"text":"Zurich, Switzerland<p>Java Dev for one of the most frequented swiss search engines.<p>You need to have a working permit in switzerland or be from the EU/CH.<p>javadev @  srtnwz.com","time":1312206230,"type":"comment"},{"by":"phatseat","id":2833730,"parent":2831646,"text":"San Diego, CA<p>Pathway Genomics - Backend Web Developer<p>LAMP, Perl, nodejs, tahoe-lafs, MySQL, Postgres, jQuery, Security, Hard Problems, Good People<p>jobs@pathway.com","time":1312223957,"type":"comment"},{"by":"rekcuts","id":2832398,"parent":2831646,"text":"Marlborough, MA<p>Cavium Networks is looking for hardware engineers experienced in verilog, C++, and systemverilog.<p>Contact wstucker@gmail.com","time":1312210169,"type":"comment"},{"by":"jim-greer","id":2832178,"kids":[2832536],"parent":2831646,"text":"San Francisco, CA<p>Kongregate - we're looking for web developers, android developers, online marketing, and biz dev","time":1312207571,"type":"comment"},{"by":"markmsmith","id":2842442,"parent":2831646,"text":"Location: Raleigh, North Carolina<p>Rally Software is looking for passionate developers with experience in building robust and flexible web-based applications.<p>What’s it like at Rally?<p>We pair.  We use Git, Groovy, Grails, Spring, ExtJS, Ruby &#38; MongoDB.  We only use OSs that have pipe &#38; grep.  We drink beer and play LAN games together.<p>What makes Rally a ridiculously good place to work<p><i>- Entrepreneurial Atmosphere:</i> You are in charge of your destiny. The team owns all architectural and framework choices, so if anything is not working, we change it!  Prove a new technology solves a problem and we’ll use it.<p><i>- Hackathons:</i> Had a flash of inspiration for an idea that could help the business?  Unleash your creativity with regular opportunities to prototype with whatever cool new tech you want and present it to the rest of the team.  If they like it enough, it could even become a fully-fledged feature and released as part of the product.<p><i>- No role or tech ruts:</i> Extend your role or create your own.  Work across the entire stack (presentation, middleware, web services &#38; backend) or specialize in an area of interest to you.<p><i>- Learning:</i> Overwhelming encouragement (and sponsorship) for attending and presenting at conferences, meet-ups, writing books, and blogging.  Our experiment-rich culture has us evolving our methodology and tools constantly.<p><i>- Fun:</i> We have a kegerator with a different beer every month, as well as regular video game and table tennis sessions.  Few things compare to hearing your coworkers’ cries from across the office as you frag them at the end of a long day.<p><i>- Copious Awards:</i> Rally was named the Best Company to Work For In Colorado (where our HQ is) for the last four years running and ranked in the top ten Best Places to Work in the U.S. from Outside Magazine.  We opened our North Carolina office in 2009 and are looking to aggressively grow it.  Our product has won numerous awards and was recently recognized by industry analyst Forester Research as offering “the best combination of capability and strategy of Agile ALM tools\".<p>At the end of the day, the main things we’re searching for are talent and passion.  However, experience in certain areas could help you hit the ground running, so here’s our attempt at narrowing things down a bit -<p>Apply if you have ninja skills in:<p>Java, Javascript, and OO design.<p>We upvote you if you also know:<p>Groovy, Grails, Ruby, CSS, ExtJS (or similar JS frameworks), Git (or other distributed SCM), SQL (especially Oracle), MongoDB (or other NoSQL) and Agile methodologies.<p>A taste for beer &#38; thai food, as well as having crazy good hand-eye coordination are also helpful.<p><i>Apply Here:</i> <a href=\"http://www.rallydev.com/careers/available_positions/?category=Engineering\" rel=\"nofollow\">http://www.rallydev.com/careers/available_positions/?categor...</a>","time":1312397428,"type":"comment"},{"by":"genystartup","id":2832645,"parent":2831646,"text":"you can also checkout <a href=\"http://college2startup.com\" rel=\"nofollow\">http://college2startup.com</a> Lots of startups post job openings on there.","time":1312212900,"type":"comment"},{"by":"RyanGWU82","id":2833518,"parent":2831646,"text":"San Mateo, CA<p>PBworks is hiring a Senior Operations Engineer!<p>PBworks is hiring a Senior Operations Engineer who can wear many hats. We're looking for folks who aren't scared of being hands on with everything. Willing to compile a grsecurity Linux kernel? Troubleshoot network packet loss? Scale databases? If you’re able to take on a wide range of responsibility, this position is for you.<p>Your job will be to create an environment where 4 million users and over 1.5 million workspaces can flourish and change the way people work. You'll get the freedom to do the job right, and a fantastic engineering team to back you up. What are you waiting for? Mail your resume and a short paragraph of why you'd like to join to jobs-ops@pbworks.com.<p>What You'll Be Doing:<p>- Physical server management: Managing a cluster of about 70 physical servers in San Francisco. Plus 3 servers in Sacramento. Plus a handful in our office in San Mateo.<p>- Engineering: Developing ops infrastructure tools in PHP, Perl, Ruby, or shell scripts.<p>- Automation: automating deployment with puppet.<p>- Monitoring: using Ganglia and monit to understand what's going on with the systems.<p>- Networking: Running the network infrastructure, including routers, switches, and site-to-site VPNs between the three locations above.<p>- Databases: Managing a handful of MySQL databases: advising developers on schema changes, keeping the databases reliable, and optimizing performance.<p>- Security: Analyzing the systems' security, keeping up with new threats, and recommending and implementing new security technologies and policies.<p>- Email: Ensuring the best possible outgoing email deliverability, and that we don't lose any incoming email.<p>- Office IT: running the office network; operating the employee VPN; occasionally fixing a printer or troubleshooting someone's laptop.<p>- Planning: Monitoring resource utilization trends; budgeting; planning for growth.<p>The Operations Engineer role is extraordinarily wide. If you've got software development experience, there are a variety of customer-facing infrastructure projects that may interest you. If you like NoSQL, there are definitely ways we can add NoSQL databases to optimize performance and developer productivity. We're looking for someone with a wide range of experience and interests, but if you haven't already worked in all these roles, we're here to help you learn.<p>Requirements: 3+ years experience running a production cluster. Debian and SaaS experience strongly preferred.<p>Bonus: Knowledge of PHP, puppet, git, quality programming abilities, computer science chops, and an understanding of SaaS business.<p>Technology: You'll get to solve real business problems with a wide range of technology. Here's a sample of what we work with: Debian Linux, Apache, Nginx, Percona Server (MySQL), memcached, MogileFS, XtraBackup, LDAP, puppet, Ganglia, monit, Perl, Node.js, ejabberd, Vyatta, Amazon Web Services, Solr, Postfix, git.<p>Why we're different: PBworks blurs the lines between operations and development. You'll sit in on every team engineering meeting and have input to decisions at all levels. As part of your job, you'll continue to architect our system to handle failures so you won't get paged when a hard drive fries. We're committed to providing the resources so that these failures don't become emergencies. We value automation and addressing the root cause of issues so they don't happen again.<p>To apply, email jobs-ops+hn@pbworks.com.","time":1312221504,"type":"comment"},{"by":"earthaid","id":2833307,"parent":2831646,"text":"Earth Aid - Boston, MA - Full-time Data &#38; Rails Engineers<p>Earth Aid ( <a href=\"http://earthaid.net\" rel=\"nofollow\">http://earthaid.net</a> ) was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're newly venture-backed by Point Judith Capital as well as strategic and angel investors who have built and scaled some of the most successful businesses today. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We have offices in San Francisco and DC, and we're now consolidating our dev team and HQ into an awesome brand new headquarters in Boston.<p>We empower households to track &#38; contextualize their electric, natural gas, and water utility usage. We value data, clarity, focus and beauty. We are looking for people who do too --- people who want to work on incredibly complex problems and come up with solutions that will change the world. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption.<p>To learn more about our very competitive salaries, excellent benefits, fun company culture, and small arsenal of office helicopter drones, check out: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, and send us an e-mail at jobs at earthaid dot net<p>---<p>Two Highlighted Opportunities in the Boston Office -&#62;<p>Data Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change &#38; the future of energy. Analytics: Use tools like mapreduce, hadoop, and AWS to drive insight into energy usage. Performance: Store the world's energy data in a way that makes it easy for web engineers to create experiences on top of it. Maintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups. Reliability: Build tools that make it easy to know what is happening throughout the system and that allow Earth Aid to be constantly available for our users. Security: Create an infrastructure that both allows us to be certain that our user data is safe while at the same time allow the flexibility to perform analytics and quickly iterate.<p>Ruby on Rails Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change and the future of energy. User Growth: Create a clear and impactful experience that drives us toward many millions of users. Maintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups. Product design: Envision and execution on product features and entirely new products. Visualization: Create beautiful and meaningful visualizations that impact consumer energy usage.","time":1312219157,"type":"comment"},{"by":"veyron","id":2831973,"parent":2831646,"text":"This was posted by rush-tea on the imposter thread from yesterday:<p><a href=\"http://news.ycombinator.com/item?id=2830424\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2830424</a><p>People should be warned about making hiring posts like <a href=\"http://news.ycombinator.com/item?id=2829174\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2829174</a><p>--<p>Looking for a technical co founder who is an avid web application Developer (front and back end) to join our effort in building social networking site.\nWe are currently looking to start a social networking site that has potentials to excel in a market where Facebook dominates, and would like a technical co founder to join this effort.<p>We have a step-by-step plan to launch this site. We have sets of minimum requirement needed to launch and we also need to develop more customized features onto it. That’s where you come in, to customized these features and put the finishing touch on the site. Once the minimum requirements are done, we will launch the site in beta mode. We are hoping to launch the site within couple months after you are on board (the launching time is depending on full time/part time work you are doing as the technical co founder). Then when the YC Winter 2012 program application starts, we are going to apply for the program. Our goal is if we can have few hundreds (or thousands) users base before going into the program, that would be a great achievement.<p>What we need is someone who is strong in web engineering to help us in technical areas and take it to the next level while we are going to do the testing development of the site, business development, funding, user base, marketing, and opportunities. We are looking for help from the following candidate<p>- Can-do attitude, never give up, and love to solve problems (there is always a solution to every problem)<p>- You will be one of the co founder, we are partners. We move forward, fall backward and work together to achieve great things.<p>- software development experience as an web/internet engineer and experience in building back end web engine.<p>- Strong knowledge and proven hands-on experience with PHP, MySQL, Javascript, AJAX, CSS<p>- Desire and ability to learn, excel, and 100% commitment to success.<p>- Must be located in Bay Area (or willingness to relocate) as we will work together day and night to make it happen<p>- Prefer that you are available for full time to develop (as you will be working with one of the co founders on daily basis as he puts his effort full time on this), but we can discuss what you need and required in discussion. What's really important is that you want to work with us, we want to work with you, and we are in it together.\nNice to have (but not required)<p>- Developed a production worthy SaaS application<p>- Experience building large scale applications is desired<p>- Strong desire to work in a startup, prior experience gets bonus points<p>- Knowledge of software development processes (Agile, Scrum) is desired but not necessary<p>All in all, we are looking for a passionate and genius web developer who likes social interaction, build sites, and is always challenged to make something better for the world. When we combine your coding prowess with the vision on where we are going, we can only move forward.<p>A little bit about us.<p>One is a second time entreprenuer, worked at a fortune 50 company prior to this. His educational background is MSc in Electrical Engineering. Expert in creating intuitive user experience, user interaction, and user values. Understand the market and eyeballing opportunities. Passionate about UI, startups, technology. Several years of experience in the wireless engineering and product management domain in wireless and mobile space. He loves to solve problems, creates opportunities, and love challenges. He will devote his time 100% day and night for this effort.<p>One is recent Cal graduate currently working at a startup company. His educational background is BSc in Chemical Engineering.<p>You &#60;insert your profile&#62; :)<p>Why diving in social networking market with Facebook domination?<p>Because we believe that the social networking site has a lot of potential to grow because as of now, it has only Facebook in it, and the market will give us the chance the grow (considering what Google+ has achieve in its first month of its launch, there will be huge growth to make). It's a great task and huge challenge ahead, but hey, if we are looking forward to it, then you must be too (no die attitude).<p>If you are interested in joining us and build a social networking site that offers values, please email us your experience at<p>rush.tea@gmail.com<p>We are going to look at all candidates regardless of background.<p>We are looking forward to great success together. We are open to any suggestions or ideas. :)","time":1312204910,"type":"comment"},{"by":"rush-tea","id":2833940,"parent":2831646,"text":"Mountain View, CA<p>Looking for a technical co founder who is an avid web application Developer (front and back end) to join our effort in building social networking site.<p>We are currently looking to start a social networking site that has potentials to excel in a market where Facebook dominates, and would like a technical co founder to join this effort.<p>We have a step-by-step plan to launch this site. We have sets of minimum requirement needed to launch and we also need to develop more customized features onto it. That’s where you come in, to customized these features and put the finishing touch on the site. Once the minimum requirements are done, we will launch the site in beta mode. We are hoping to launch the site within couple months after you are on board (the launching time is depending on full time/part time work you are doing as the technical co founder). Then when the YC Winter 2012 program application starts, we are going to apply for the program. Our goal is if we can have few hundreds (or thousands) users base before going into the program, that would be a great achievement.<p>What we need is someone who is strong in web engineering to help us in technical areas and take it to the next level while we are going to do the testing development of the site, business development, funding, user base, marketing, and opportunities. We are looking for help from the following candidate<p>- Can-do attitude, never give up, and love to solve problems (there is always a solution to every problem)<p>- You will be one of the co founder, we are partners. We move forward, fall backward and work together to achieve great things.<p>- software development experience as an web/internet engineer and experience in building back end web engine.<p>- Strong knowledge and proven hands-on experience with PHP, MySQL, Javascript, AJAX, CSS<p>- Desire and ability to learn, excel, and 100% commitment to success.<p>- Must be located in Bay Area (or willingness to relocate) as we will work together day and night to make it happen<p>- Prefer that you are available for full time to develop (as you will be working with one of the co founders on daily basis as he puts his effort full time on this), but we can discuss what you need and required in discussion. What's really important is that you want to work with us, we want to work with you, and we are in it together.<p>- Strong desire to work in a startup, prior experience gets bonus points<p>All in all, we are looking for a passionate and genius web developer who likes social interaction, build sites, and is always challenged to make something better for the world. When we combine your coding prowess with the vision on where we are going, we can only move forward.<p>A little bit about us.<p>One is a second time entreprenuer, worked at a fortune 50 company prior to this. His educational background is MSc in Electrical Engineering. Expert in creating intuitive user experience, user interaction, and user values. Understand the market and eyeballing opportunities. Passionate about UI, startups, technology. Several years of experience in the wireless engineering and product management domain in wireless and mobile space. He loves to solve problems, creates opportunities, and love challenges. He will devote his time 100% day and night for this effort.<p>One is recent Cal graduate currently working at a startup company. His educational background is BSc in Chemical Engineering.<p>You &#60;insert your profile&#62; :)<p>Why diving in social networking market with Facebook domination?<p>Because we believe that the social networking site has a lot of potential to grow because as of now, it has only Facebook in it, and the market will give us the chance the grow (considering what Google+ has achieve in its first month of its launch, there will be huge growth to make). It's a great task and huge challenge ahead, but hey, if we are looking forward to it, then you must be too (no die attitude).<p>If you are interested in joining us and build a social networking site that offers values, please email us your experience at<p>rush.tea@gmail.com<p>We are going to look at all candidates regardless of background.<p>We are looking forward to great success together. We are open to any suggestions or ideas. :)","time":1312226725,"type":"comment"},{"by":"pitdesi","id":2831958,"parent":2831646,"text":"Chicago, IL (remote possible) - FeeFighters - Rails Intern<p>(during the school year, as many hours as you'd like)<p>Are you a smart programmer who would like the experience of working on a real-world rails backend for a hot funded startup? FeeFighters is looking for an enthusiastic intern with good coding chops. Ideally, this intern would be an experienced ruby coder, but we’re willing to work with something who wants to pick up ruby and learn in a fast-paced environment. Make no mistake: this is a chance to work on real projects for one of the best startups in Chicago… getting coffee, moving boxes, or any other bullshit are not part of this offer. Spend your time working with a great team, tackling hard problems, and learning what it takes to be a FeeFighter.<p><a href=\"http://feefighters.com/jobs/kickass-rails-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-rails-intern/</a>","time":1312204728,"type":"comment"},{"by":"brikis98","dead":true,"id":2834746,"parent":2831646,"text":"Mountain View, CA (full-time): LinkedIn<p>Engineering positions open across the board. We are building the professional network. Work with Java, Spring, Scala, JRuby, Grails, Node.js, RoR, Hadoop, iPhone, Android, and more. See <a href=\"http://engineering.linkedin.com/\" rel=\"nofollow\">http://engineering.linkedin.com/</a> for more info.<p>* Software Engineer - Applications: <a href=\"http://linkd.in/SWE-Applications\" rel=\"nofollow\">http://linkd.in/SWE-Applications</a><p>* Software Engineer - Mobile Applications: <a href=\"http://linkd.in/SWE-Mobile\" rel=\"nofollow\">http://linkd.in/SWE-Mobile</a><p>* Front End Engineer - Applications: <a href=\"http://linkd.in/Front-End-Engineer\" rel=\"nofollow\">http://linkd.in/Front-End-Engineer</a><p>* Software Engineer - Systems and Infrastructure: <a href=\"http://linkd.in/SWE-SI\" rel=\"nofollow\">http://linkd.in/SWE-SI</a><p>* Research Engineer - Data Analysis, Data Mining, Machine Learning: <a href=\"http://linkd.in/SWE-Data\" rel=\"nofollow\">http://linkd.in/SWE-Data</a><p>* Software Engineer - Tools: <a href=\"http://linkd.in/SWE-Tools\" rel=\"nofollow\">http://linkd.in/SWE-Tools</a><p>* Performance Engineer: <a href=\"http://linkd.in/SWE-Performance\" rel=\"nofollow\">http://linkd.in/SWE-Performance</a><p>* Software Engineer in Test: <a href=\"http://linkd.in/software-engineer-in-test\" rel=\"nofollow\">http://linkd.in/software-engineer-in-test</a><p>* Release QA: <a href=\"http://linkd.in/Release-QA\" rel=\"nofollow\">http://linkd.in/Release-QA</a>","time":1312236604,"type":"comment"},{"by":"jbapple","dead":true,"id":2832324,"parent":2831646,"text":"Eugene, Oregon - fulltime - internship possible - noremote - H1B applicants welcome<p>On Time Systems is a small company that specializes in solving large-scale search and optimization problems. We used to be a research lab at the University of Oregon, but we are now more focused on writing software than writing grant proposals. We're currently looking for software engineers to work on Green Driver (a smartphone app that uses real-time data from traffic signals to help drivers find the fastest route (<a href=\"http://imagreendriver.com)\" rel=\"nofollow\">http://imagreendriver.com)</a>) and ACFP (Advanced Computer Flight Planning), the flight planning system used by the US Air Force for routing cargo planes and tankers worldwide.<p>Although our core IP is in optimization, bringing these solutions to market requires complex client-server applications with challenging network, user interface, and database components. We have code written in Python, Java, C, C++, Objective-C, and other languages. An ideal candidate will have a strong background in algorithms and will be comfortable writing both high-level and low-level code.<p>Benefits include: medical and disability insurance, 401Ks with matching, sabbaticals, massages, a game room (ping pong, billiards, DDR, etc.), relocation package, pick your own hardware, your own office with a window, tuition reimbursement (including flight school if you work on our flight planning software), exercise equipment and locker room, and his and hers company bikes.<p>The work environment is friendly, informal, and intellectual.<p>Send your resume to jobs+hackernews@otsys.com","time":1312209371,"type":"comment"},{"by":"SFRecruiter","dead":true,"id":2870634,"parent":2831646,"text":"San Francisco, CA - Fulltime-  ONSITE - Senior Software Engineer \nSenior Software Engineer, Mobage<p>Rome wasn’t built in a day and neither is the great and mighty social gaming network at ngmoco:).  You will build a platform which hosts over 100 social games and the relationships behind those games. The platform also hosts commerce, advertising, and media streaming services. You’ll be building on top of a revolutionary new javascript development framework that allows for native look-and-feel in both games and applications.<p>Don’t wait for game over, join us now!<p>Responsibilities<p><pre><code>    * Independently spearhead programming and architectural initiatives for the consumer-facing Mobage mobile app, and developer-facing platform API’s.\n    * Collaborate with a group of talented engineers and product folk to create a mind-blowing customer experience for Android/iPhone users and game developers.\n    * Creatively solve a variety of difficult software problems (take your pick) that range in both depth and breadth across our technology stack.\n</code></pre>\nRequirements<p><pre><code>    * B.S. degree in Computer Science, equivalent or higher\n    * Expertise programming in two or more of the following languages (C++, Objective C, Javascript, Actionscript, or Java)\n    * Experience shipping one or more commercial software products\n    * Strong communication and time management skills—the ability to balance high quality work standards against time constraints\n    * Experience programming user interfaces (HTML/CSS/Javascript/XML/Cocoa/.NET/etc.) a plus\n    * Mobile game or application development experience (iPhone, Android, etc.) a plus\n</code></pre>\nPlease contact sdawson@ngmoco.com","time":1313018052,"type":"comment"},{"by":"SFRecruiter","dead":true,"id":2870626,"parent":2831646,"text":"San Francisco Fulltime OR Contract Onsite - Lead Rails Engineer\n ngmoco.com<p>Lead Rails Engineer<p>Come join ngmoco:) and help build the future of mobile entertainment.  We're looking for a talented Ruby on Rails engineer to lead the development of the developer portal for the Mobage Social Entertainment Network.  In this hands on role, you'll help to guide the technology choices and user experience for developers using the Mobage platform.  You'll join the talented group of ngmofo:) engineers building scalable systems in a highly dynamic environment.<p>Requirements:<p><pre><code>    * Experience building modern, scalable web applications\n    * Mad Rails chops\n    * A burning, itching desire to always ship the best possible thing\n    * Experience configuring and deploying applications to production environments\n    * A thorough understanding of web service technologies\n    * Possess the ability and experience required to meet requirements and ship working code on time\n    * Ability to prioritize between what's necessary and what isn't, and explain why\n</code></pre>\nOther Key Attributes:<p><pre><code>    * A passion for social games and social networks.\n    * Comfort working under tight deadlines in a fast-paced environment.\n    * Appreciation for being part of a fast-paced startup environment—an interest in working with a small team to create software used by millions of people every day.\n    * Strong communication and time management skills—the ability to balance high quality work standards against time constraints.\n    * A relentless passion for creating industry leading products and the highest quality user experiences.\n</code></pre>\nPlease contact sdawson@ngmoco.com for details.","time":1313017901,"type":"comment"},{"by":"stolt45","dead":true,"id":2833701,"parent":2831646,"text":"San Francisco, CA<p>Heroku / Cloud Platform Support Engineer<p>Are you a software engineer passionate about web apps and related open source projects? Do you get a serious kick out of tracking down hard-to-pinpoint issues and solving problems for customers? If so, we’d like to talk to you about joining our support team at Heroku.<p>Heroku’s customers are deploying some of the coolest and most innovative web applications today. Your primary responsibility will be supporting them by jumping on trouble tickets, providing basic troubleshooting, identifying root causes, and developing resolutions. While you will be participating in forums and discussions and developing and improving our documentation, you will also be a key person developing sample application, bug fixes, and building and support’s suite of tools. In addition, we highly encourage active participation in open source projects of any language.<p>You should have experience as a software engineer and/or white-box tester; be passionate about helping real customers solve real problems; have a strong background in web application development using technologies such as Ruby, Rails, javascript, Clojure, memcached, and RDBMS such as PostgreSQL and MySQL; and be a well-organized and effective communicator.","time":1312223577,"type":"comment"},{"by":"Mc_Big_G","dead":true,"id":2833112,"parent":2831646,"text":"San Francisco, CA<p>VerticalResponse is hiring for a lot of great positions:<p>* Ruby on Rails Developers<p>* Ruby on Rails Architect<p>* Director of Product Management<p>* Search Engine Marketing (SEM) Analyst<p>* Senior QA Automation Engineer<p>* Online Marketing Specialist<p>* Product Manager<p>* Director of Acquisition Marketing<p>* Senior Financial Analyst<p>* Customer Relations Specialist<p>VR is an established and successful, privately held company in SF for the last 10 years. We work with Rails 3, Git, JQuery, Rspec, backbone.js, Haml, Sass, TDD, pair programming, agile development and other leading technologies (you don't need to have experience with all of these). I've been working there as an engineer for 7 months now and really enjoy it.<p>Occasional work from home is allowed if you have an important appointment or need to keep germs out of the office. We have happy hour on Fridays and the fridge is stocked with a wide variety of beer, so we'll sometimes end the day with a cold brew while we finish pairing on a difficult problem.<p>Apply here: <a href=\"http://jobvite.com/m?3RB34fwj\" rel=\"nofollow\">http://jobvite.com/m?3RB34fwj</a>","time":1312217122,"type":"comment"},{"by":"synacorhr","id":2841172,"parent":2831646,"text":"Buffalo, NY<p>Are you passionate about writing outstanding code?  Do you love working on products that users rave about?  Do you thrive in an environment where creativity is at its finest?  Do you enjoy tackling hard problems and have a track record delivering results?  If you answered “No” to any of these questions there is no need to read on.  Now that we have the attention of the candidates we are really after we are looking for a talented, driven and experienced Senior Engineer rockstar who is looking for an opportunity to team up with other PHP rock stars in an exciting and growing company.  The ideal candidate will have a can-do attitude, passion for technology, and extensive PHP development experience.  So if you are interested in building applications used by millions of people then Synacor is the place for you!<p>Please apply on our website at www.synacor.com/careers","time":1312380171,"type":"comment"},{"by":"maximebf","dead":true,"id":2833792,"parent":2831646,"text":"Paris, France<p>Allmyapps is hiring fulltime web engineers. We are building the first application store for Windows and we are quickly growing. You will be creating new features (social and community features, widgets, etc) to improve people’s experience with their PC.<p>Requirements:\nFluency in: HTML5, JavaScript, CSS3, jQuery, PHP 5.3, PostgreSQL, Redis, Memcache, git\nBonus: Mongodb, Python, Node.js, Linux<p>And of course you are…\nApps-lover, Passionate about the Web\nAnimated by a desire to change the world\nHappy to go to work in flip-flops when it’s hot (no ties allowed)\nVisionary, but also unafraid of getting your hands ‘dirty’ with some operational work\nTop-notch, professional, Self-demanding… and with a sense of Humor!<p><a href=\"http://allmyapps.com\" rel=\"nofollow\">http://allmyapps.com</a>\nEmail: jobs@allmyapps.com","time":1312224743,"type":"comment"},{"by":"synacorhr","id":2841158,"parent":2831646,"text":"Buffalo, NY<p>Synacor is seeking an Engineer that has experience with LINUX and PHP, JSP, ASP, or other language used for building web based applications.  With a moderate level of guidance and direction from management, this Developer will perform Front End / GUI Development, enhancement and maintenance of existing software modules, custom programming for clients and various data manipulation tasks.<p>Please apply on our website at www.synacor.com/careers","time":1312380018,"type":"comment"},{"by":"kevinconroy","dead":true,"id":2831906,"parent":2831646,"text":"Washington, DC<p>GlobalGiving.org is looking for a talented Java developer to help us improve our non-profit fundraising platform which has raised over $48M for grassroots charities in over a hundred countries.<p><a href=\"http://www.globalgiving.org/aboutus/jobs/software-engineer-for-good.html\" rel=\"nofollow\">http://www.globalgiving.org/aboutus/jobs/software-engineer-f...</a>","time":1312203942,"type":"comment"},{"dead":true,"deleted":true,"id":2831905,"parent":2831646,"time":1312203935,"type":"comment"},{"by":"msales","dead":true,"id":2833346,"parent":2831646,"text":"Karlsruhe, Germany - mSALES GmbH - Ruby Developer<p>We're looking for a Ruby Developer (on site, german speaking)<p><a href=\"http://www.msales.com/jobs/ruby-developer\" rel=\"nofollow\">http://www.msales.com/jobs/ruby-developer</a> (in German)<p><a href=\"http://goo.gl/DeBp1\" rel=\"nofollow\">http://goo.gl/DeBp1</a> (the above in English)","time":1312219575,"type":"comment"},{"by":"hezekiah","dead":true,"id":2831677,"parent":2831646,"text":"T-Mobile in Bonn, Germany.","time":1312200100,"type":"comment"},{"by":"ig1","id":2831682,"kids":[2831741,2836360],"parent":2831646,"text":"For UK'ers check-out the job board I run, lots of startups use it to promote their jobs:<p><a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>(Mostly full-time non-remote jobs)","time":1312200147,"type":"comment"}]]}