{"comments":[[{"by":"pchristensen","id":2396144,"parent":2396027,"text":"Groupon is hiring all kinds of computery people in Chicago and Palo Alto - programmers, designers, operations, testing, support, Big Data, performance, managers, etc.<p>Full listings at <a href=\"http://groupon.com/techjobs\" rel=\"nofollow\">http://groupon.com/techjobs</a><p>Most jobs are in both locations, and there's the ability to move or travel as desired.<p>A couple months ago on this thread, I said Groupon was planning on hiring 100 engineers this year, and we're on pace to hit that goal.  The people we hired are so great that instead of work halting to train them, we have increased the rate that we release new features and products and our software quality has improved too.<p>All tech people get a new MacBook Pro and monitor.  We use Ruby on Rails, git, RSpec, Cucumber, Selenium, Jenkins, and lots more good stuff.  We're the biggest player in the daily deal space so we face the biggest technical challenges - tens of millions of users, insane growth, real-time, data-based targeting at scale, defining the hottest new space (deals) on the Internet, etc.<p>Usual official stuff aside, let me share my personal experience.  I started at Groupon four months ago and I'll say that it is better in every way than every job I've ever had.  My coworkers are amazing, we do all that stuff everyone says you're supposed to do (test coverage, automated builds, scope control, regression testing, etc), the atmosphere is so fun (company meetings are the highlight of the quarter), and everything I develop gets used by millions of people, immediately.  My mom actually understands who I work for.  I honestly legitimately love it here.","time":1301665359,"type":"comment"},{"by":"nkohari","id":2396433,"kids":[2397101,2404731],"parent":2396027,"text":"Raleigh, NC - Generalist engineer (development/operations)<p>The AgileZen team at Rally Software is looking to add a few engineers this year. Our app is a SaaS project management system that makes it easy for users to visualize their work.  While Rally's primary business is enterprise software, AgileZen's customers are primarily small teams and startups.<p>We started as a two-founder startup in Ohio in 2009 and were acquired by Rally in 2010. We're now a team of four with intentions of expanding to seven by the end of the year. We think and act very much like a startup, report to the CTO, and operate with relative autonomy within the company.<p>Experience in any development ecosystem (.NET, Java, Ruby, Python) is great, but JavaScript knowledge is a major plus. Our frontend is a whole bunch of JavaScript and CoffeeScript, and we're exploring doing more with Node.JS on the backend. We like people who are good at lots of things, and excellent at a few.<p>Review My App link on HN (from our launch in 2009): <a href=\"http://news.ycombinator.com/item?id=691673\" rel=\"nofollow\">http://news.ycombinator.com/item?id=691673</a><p>More about us at: <a href=\"http://agilezen.com/\" rel=\"nofollow\">http://agilezen.com/</a><p>More about the job at: <a href=\"http://jobvite.com/m/?3ph32fwv\" rel=\"nofollow\">http://jobvite.com/m/?3ph32fwv</a>","time":1301669346,"type":"comment"},{"by":"kaib","id":2396375,"kids":[2396465,2396878],"parent":2396027,"text":"Helsinki, Finland - engineering, computational geometry and distributed systems<p>Tinkercad is a funded startup making a solid modeling web application for artists and makers. The product is currently in closed beta.<p>We work daily with hard problems combining cutting edge research in volumetric models and soft real time distributed systems. Our software stack is written in JavaScript, Go and a bit of C++.<p>Job perks include a near unlimited supply of plastics for the company 3D printers and the opportunity to help bring personal digital manufacturing to the masses.<p>Contact kai at tinkercad dot com and check out the demo at:\n<a href=\"http://tinkercad.com\" rel=\"nofollow\">http://tinkercad.com</a>","time":1301668546,"type":"comment"},{"by":"RichardPrice","id":2397552,"parent":2396027,"text":"Academia.edu is hiring engineers in San Francisco.<p>Academia.edu is a platform for academics to connect and share research. Our goal is to build a hyper-connected academic graph, so every researcher has their entire research community at their fingertips. We currently have 1.5 million unique monthly visitors, and have doubled in traffic in the last 6 months.<p>Here are a few bullet points that sum up the atmosphere in our team:<p>- obsession with exceptional engineering<p>- obsession with building a great web product, and a great user experience<p>- intellectually inquisitive - we like delving into ideas, whatever the ideas are about<p>- fun and friendly - we enjoy each other's company a lot, and have a great deal of respect for each other.<p>We want to continue this atmosphere through the people we hire.<p>Here are some of the technologies we work with: Rails, Nginx, Node.js, Redis, Memcached. We are based in downtown San Francisco. More information about the team, and about how we think about software engineering and product development, is here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>","time":1301684835,"type":"comment"},{"by":"joeshaw","id":2396194,"parent":2396027,"text":"Boston, MA and remote<p>litl - <a href=\"http://litl.com\" rel=\"nofollow\">http://litl.com</a><p>We build simple, maintenance-free, internet-focused computers.  Our first product is called the webbook, and we're working on some follow-up ideas.  Our software team has built a new, Linux-based user interface and a Google App Engine-based server.<p>Our main offices are in Boston and London, but we have many people around the world who work out of their homes.  With all the remote employees -- including software team management -- people are expected to be self-motivating.  Most meetings happen over video conference, and other are by phone.  A couple of times a year most remote employees come to Boston.<p>We're looking for:<p>* QA engineers.  In particular we're looking for people with some programming experience to improve our testing tools and automation.<p>* Software developers. We have a few areas in which we're looking for specialization, but the main thing we care about is that you're really good. Some things we're interested in:<p><pre><code>    - X (core and input and video drivers)\n    - Linux kernel\n    - Linux desktop technologies (Clutter, GTK, window managers, etc.)\n    - OpenGL\n    - Google Chromium codebase\n    - User-space audio/video stacks\n    - Embedded and microcontroller developers\n    - JavaScript runtimes\n    - Software rasterization\n</code></pre>\nYou can email me at joe@&#60;my-HN-username&#62;.org for more info.","time":1301666062,"type":"comment"},{"by":"agotterer","id":2396672,"parent":2396027,"text":"Manhattan, NY<p>Lot18 - A marketplace for wineries to sell direct to consumers. Closed a $3M series A in Nov (led by Firstmark). We are growing really fast and hiring a ton of people. Working on a number of interesting things: recommendations, distributed systems, data analysis and of course building our product. We launched 4 months ago and have over 200k users.<p>Software Engineer - Back-end (<a href=\"http://www.lot18.com/careers#software_engineer_back-end\" rel=\"nofollow\">http://www.lot18.com/careers#software_engineer_back-end</a>)<p>Software Engineer - Application (<a href=\"http://www.lot18.com/careers#software_engineer_application\" rel=\"nofollow\">http://www.lot18.com/careers#software_engineer_application</a>)<p>Front-end Developer (<a href=\"http://www.lot18.com/careers#front_end_developer\" rel=\"nofollow\">http://www.lot18.com/careers#front_end_developer</a>)<p>Mobile Application Developer (<a href=\"http://www.lot18.com/careers#mobile_developer\" rel=\"nofollow\">http://www.lot18.com/careers#mobile_developer</a>)<p>All open positions - <a href=\"http://www.lot18.com/careers\" rel=\"nofollow\">http://www.lot18.com/careers</a><p>-<p>Languages: Python, PHP, Javascript<p>Frameworks: Tornado (Python), custom MVC (PHP)<p>Webserver: Apache and nginx<p>Database: MySQL<p>Monitoring: nagios, graphite, statsD, splunk<p>Hosting: AWS and Slicehost<p>Servers: Ubuntu<p>Etc: git, vagrant, chef, capistrano, RabbitMQ, jQuery<p>----<p>Shameless plug: <a href=\"http://www.startupshiring.com\" rel=\"nofollow\">http://www.startupshiring.com</a> for a list of startups hiring. Many from this page.<p>(edit) formatting","time":1301672696,"type":"comment"},{"by":"guywithabike","id":2396837,"parent":2396027,"text":"San Francisco, CA - Client Services Engineer (70% Ruby, 30% JavaScript/HTML/CSS)<p>CrowdFlower is the hottest thing since disco pants. We're building an entire new industry (really) and solving new problems on a daily basis (really). Read all about us at <a href=\"http://crowdflower.com\" rel=\"nofollow\">http://crowdflower.com</a> Email me at tyson@crowdflower.com if you have any questions — I'm happy to answer any questions you might have. Or, heck, drop by our hot new office in the heart of the Mission district (2111 Mission Street, Suite 302). Let us know if you want to drop by.<p>Here's the official job posting: <a href=\"http://crowdflower.jobscore.com/jobs/crowdflower/client-services-engineer/cl4UAkVeSr37pbeJe4bk1X\" rel=\"nofollow\">http://crowdflower.jobscore.com/jobs/crowdflower/client-serv...</a><p>We're using all kinds of hot buzzwords: Redis, Mongo, Ruote, CoffeeScript, Sass, HTML5, ExtJs, etc. Experience with them is a big plus.<p>We have the usual host of engineer benefits: Shiny new MacBook Pro, 30\" monitors, tight-knit engineering team, comfy chairs, health benefits, a million office plants, and a well-stocked kitchen. We're also surrounded by amazing food. This is the Mission, after all.","time":1301674942,"type":"comment"},{"by":"rudepeklo","id":2396215,"parent":2396027,"text":"I don't give it much chances here, but what the hell:<p>Prague, Czech Republic: C# developer, at least 1 year of experience. Work mainly in location, possible home office once or twice a week.<p>We're developing software that helps users select stuff they would like to buy (mainly electronics, but also push chairs, baby car seats and other stuff).<p><a href=\"http://www.prismastar.com\" rel=\"nofollow\">http://www.prismastar.com</a>, you can contact me directly at k2@prismastar.com","time":1301666269,"type":"comment"},{"by":"comatose_kid","id":2397044,"kids":[2397458,2399982],"parent":2396027,"text":"Mountain View, CA (INTERN and FULLTIME)<p>Bump Technologies (YC S09) is changing the way people connect and share using their mobile devices.  There are huge opportunities ahead, and we are looking for talented hackers.<p>We are currently hiring for both FT and INTERN positions:<p>• mobile developers (iOS, Android, Blackberry, HTML5)<p>• server (beckend engineer, server ops)<p>• designers (visual, interaction)<p>Our team includes some of the smartest and most talented developers and designers in Silicon Valley, and we all share a common goal: to build something people want and have fun doing it.<p>We offer a workplace that will both challenge and fulfill you, by giving you the freedom and flexibility to develop your own solutions in a creative team environment where your contributions will be immediately felt and recognized.<p>Bump was born as a simple iPhone app for swapping contact information, but as our user base grew, so did our vision.<p>We now have more than 30 million downloads (7th most downloaded free iOS app ever), and a vision of changing the way people use their mobile devices.<p>We are backed by major investors including Sequoia Capital and Andreessen Horowitz.<p>Interested?  We'd love to talk to you.<p>Apply here:<p><a href=\"http://bump.theresumator.com/apply?source=HN0401\" rel=\"nofollow\">http://bump.theresumator.com/apply?source=HN0401</a>","time":1301677748,"type":"comment"},{"by":"dguido","id":2396956,"parent":2396027,"text":"New York City, Seattle, and San Francisco - iSEC Partners - Application Security Consultants<p>iSEC Partners is currently looking for Security Researchers and security-focused software developers to fill openings in its application security consulting practice. We are seeking entry, senior and principal level candidates.  Job duties will include project delivery within iSEC consulting engagements and cutting-edge research into current technologies and attacks.<p><a href=\"http://www.isecpartners.com/careers/\" rel=\"nofollow\">http://www.isecpartners.com/careers/</a><p>iSEC Partners is a proven full-service security consulting firm that provides penetration testing, secure systems development, security education and software design verification. iSEC Partners' security assessments leverage our extensive knowledge of current security vulnerabilities, penetration techniques and software development best practices to enable customers to secure their systems against ever-present threats on the Internet.<p>Primary emphasis is placed upon helping software developers build safe, reliable code. Areas of research interest include application attack and defense, web services, operating system security, privacy, storage network security and malicious application analysis.<p>Our goal is to create a new standard for customer satisfaction and become the pre-eminent leader in security consulting, research and tool development.","time":1301676682,"type":"comment"},{"by":"squirrel","id":2396316,"kids":[2402244],"parent":2396027,"text":"London (UK) and Boston US - youDevise, Ltd.<p>We're a 90-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're hiring developers and other smart folks of many kinds. See <a href=\"https://dev.youdevise.com\" rel=\"nofollow\">https://dev.youdevise.com</a> and <a href=\"http://www.youdevise.com/careers\" rel=\"nofollow\">http://www.youdevise.com/careers</a>.<p>While we don't have remote workers, we do help successful candidates relocate to London or Boston including arranging visas where needed. For example, last year we hired HN readers from Denmark and the US, and we moved a Polish employee to Boston.","time":1301667552,"type":"comment"},{"by":"tghw","id":2396385,"parent":2396027,"text":"New York, NY<p>Fog Creek Software - <a href=\"http://careers.stackoverflow.com/jobs/10897\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/10897</a><p>We are currently hiring full time developers. As a programmer at Fog Creek Software, you will help design, develop, and implement the code for our award winning products.<p>Fog Creek Software is a small, entrepreneurial software company in New York City founded in 2000. Our key products are FogBugz, Kiln and Copilot; all three have been very successful. We bootstrapped ourselves without outside investment and have been profitable from the beginning.<p><a href=\"http://www.fogcreek.com/Jobs/Dev.html\" rel=\"nofollow\">http://www.fogcreek.com/Jobs/Dev.html</a>","time":1301668672,"type":"comment"},{"by":"jasonlotito","id":2396109,"kids":[2396284,2396159],"parent":2396027,"text":"Montreal - PHP/MySQL Developer<p>Adult company, many positions available.  High traffic, lots of new products, different areas, including credit card processing.  Don't do one thing, do many things.<p><a href=\"http://gammajobs.com/\" rel=\"nofollow\">http://gammajobs.com/</a><p>Edit: Downvoted, I imagine, because it's an adult company.  If you downvoted this, at least you can have the guts to explain why?","time":1301664950,"type":"comment"},{"by":"johndbeatty","id":2396625,"parent":2396027,"text":"Mountain View, CA (We do H-1Bs and other visas)<p>Clover is building a world-class team in machine learning, distributed systems, front-end, and operations. On staff is a Robocup champ, the former lead engineer for YQL, a rocket scientist turned GPU programmer, and other great engineers. Beyond being really good at what they do, the engineering staff is very friendly. We're not talking publicly about what we're building yet, but we have a well-defined mission, a clear business model, and a killer business team. Our recent Series A is from Sutter Hill Ventures, Andreessen Horowitz, Morado Ventures, and individuals.<p>I'm particularly eager to find an excellent operations/reliability engineer who loves to build and improve tools, a passion for quality and reliability, and a positive, friendly attitude.<p>Also very high on my priority list is a big-data processing engineer to design and build our data pipeline.<p>If you're interested, you can email me directly -- john@clover.com.<p><a href=\"https://www.clover.com/jobs.html\" rel=\"nofollow\">https://www.clover.com/jobs.html</a>","time":1301672086,"type":"comment"},{"by":"ghotli","id":2398318,"kids":[2398695],"parent":2396027,"text":"Memphis, TN - Infrastructure Engineer<p>We design/develop/scale an interactive mapping platform. Our early products were all about superimposing cell phone coverage for carriers on a world map for them to embed in their websites. Now we have a platform for in-browser comparative analysis of arbitrary spatial information. We currently load it up with information about the wireless, cable, and telecom industries.<p>I'm looking for talented engineers who can get down and dirty with optimization, configuration management, distributed systems, and architecture design. Two positions are open currently.<p>Stuff you'll be fooling with: Solr, HDFS, MongoDB, PostgreSQL, Chef, Ruby, Python, and C. Knowledge of Corosync/Heartbeat, ZooKeeper, AMQP, Flume/Scribe, BigTable/Dynamo inspired systems, or Scala is a plus.<p><a href=\"http://www.americanroamer.com/\" rel=\"nofollow\">http://www.americanroamer.com/</a><p><a href=\"http://www.cellmaps.com/\" rel=\"nofollow\">http://www.cellmaps.com/</a><p><a href=\"http://www.mapelements.com/\" rel=\"nofollow\">http://www.mapelements.com/</a>","time":1301696126,"type":"comment"},{"by":"neilk","id":2397845,"parent":2396027,"text":"Planet Earth -- operations engineers, PHP developers, mobile developers, database admins, data analysts, and more<p>Wikimedia Foundation (the non-profit behind Wikipedia).<p>We're hiring lots of people this year. We want people who can work at our scale, love and hate PHP as much as we do, and want to help change the world with a tech staff that can fit around a couple of tables in a Chinese restaurant.<p>Don't underestimate the technical challenges here. After the past couple of successful fundraisers, we are looking at what \"2.0\" means for our software and infrastructure. And what it means to be everywhere in the world, from African villages to Silicon Valley to South Korea, on the devices people will be using in the 21st century.<p>Our main offices are located a couple of blocks from the BART in downtown San Francisco, CA, but we will consider remote candidates from anywhere.<p>There are also a lot of non-tech jobs we're hiring for -- check out the full list.<p><a href=\"http://bit.ly/WikimediaJobs\" rel=\"nofollow\">http://bit.ly/WikimediaJobs</a>","time":1301689174,"type":"comment"},{"by":"smanek","id":2396122,"kids":[2397494],"parent":2396027,"text":"San Francisco, CA<p>Greplin - We're a YC W10 company with interesting problems, smart people, cool tech, huge data, and rapid growth.<p>We help people search their personal information that's online (Gmail, Dropbox, Facebook, LinkedIn, etc). As TechCrunch said, we've \"attacked the other half of web search.\"<p>We're hiring across the board right now - front-end/back-end/generalists/designers/ops/dev-ops: it's all good!<p>Some stuff we like to play with includes Lucene, Tornado, Twisted, Redis, and HBase.<p><a href=\"https://www.greplin.com/jobs\" rel=\"nofollow\">https://www.greplin.com/jobs</a>","time":1301665143,"type":"comment"},{"by":"earthaid","id":2396283,"parent":2396027,"text":"Boston, MA - Ruby/Rails Engineers<p>Earth Aid ( <a href=\"http://earthaid.net\" rel=\"nofollow\">http://earthaid.net</a> ) is newly venture-backed by Point Judith Capital as well as strategic and angel investors who have built and scaled some of the most successful businesses today. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We currently have small offices in San Francisco and Washington, DC, and we're now consolidating our presently distributed dev team and HQ into a brand new office opening in Boston/Cambridge in May!<p>We are looking for people who want to work on incredibly complex problems and come up with solutions that will change the world. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. Why be a cog in the wheel when you can help steer the ship?<p>Learn more about our very competitive salaries, excellent benefits, cool culture, and small arsenal of office helicopter drones at: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, and send us an e-mail at jobs at earthaid dot net","time":1301667093,"type":"comment"},{"by":"ryanb","id":2396864,"parent":2396027,"text":"New York, NY<p>Tutorspree (YC W11) is looking to hire employees #1 and #2. Competitive salary and generous stock options are included, along with the chance to get in on the ground floor of something really big.<p>We're looking for:<p>1) Lead Engineer / Director of Technology \n2) Product Designer\n3) Engineering &#38; Marketing Interns<p>Tools we use: php, mysql, nginx, amazon ec2/s3, git<p>Please reach out to info@tutorspree.com to find out more","time":1301675255,"type":"comment"},{"by":"jfarmer","id":2397988,"kids":[2398912],"parent":2396027,"text":"Everlane - San Francisco, CA (FULLTIME, H1B, INTERNS)<p>Hey HN!  This is Jesse, one of the co-founders of Everlane.<p>Check out our website at <a href=\"http://www.everlane.com\" rel=\"nofollow\">http://www.everlane.com</a>, and my personal blog at <a href=\"http://20bits.com\" rel=\"nofollow\">http://20bits.com</a><p>We're trying to re-imagine retail online and make it easy to find products that match your taste and style.  Right now we're focused on mens fashion, but our ambitions are much larger.<p>pg did a good job of explaining the opportunity, here: <a href=\"http://ycombinator.com/rfs2.html\" rel=\"nofollow\">http://ycombinator.com/rfs2.html</a><p>We're well-funded and building our core team right now.  We need product-loving engineers and product designers who are interested in online shopping and building an experience customers love.  We're also looking for summer engineering interns.<p>Our current stack is Ruby, Rails, MySQL, and Heroku, but smart and hungry beats knowledge of specific languages.<p>If you're interested send an email to jobs@everlane.com telling us why the opportunity is interesting to you, what you're looking for in a startup, and links to your resume, portfolio, github account, side projects, etc.","time":1301690910,"type":"comment"},{"by":"jcoglan","id":2396332,"parent":2396027,"text":"Songkick (YC'07, London) is hiring again. We're a\nsmall company (about 20 people) that's working to improve the live music\nscene for everyone involved. We help fans track their favourite artists so\nthey never miss them live, and we help artists get the word out about\nupcoming shows.<p>In the last year we've seen tremendous growth in our user base and with our\ncommercial partnerships, including integrations with YouTube and Yahoo!\nSearch. We just launched our first major label integration with EMI and are\nworking on plenty more. There's a lot of work to do scaling our team and our\ntechnology stack, making it a really exciting time to join us.<p>If you, or someone you know, is an experienced and fast-learning developer\ninto TDD and scalable web services we'd love to hear from you. We have a\ngreat team that's a joy to work with (you may have met a few of us at\nRuby events), and we have a lot of challenging projects on our roadmap.<p>If you're interested, check out our jobs page at\n<a href=\"http://www.songkick.com/info/jobs\" rel=\"nofollow\">http://www.songkick.com/info/jobs</a> and get in touch with our COO Pete Smith\nat pete@songkick.com","time":1301667750,"type":"comment"},{"by":"wehriam","id":2396415,"parent":2396027,"text":"Distributed team, East Coast:<p>* Django / Front end developer<p>* Python generalist<p>HiiDef, Inc is a consumer web incubator with two rapidly growing properties, <a href=\"http://flavors.me/\" rel=\"nofollow\">http://flavors.me/</a> and <a href=\"http://goodsie.com\" rel=\"nofollow\">http://goodsie.com</a><p>Help us solve the challenges that revolve around top notch user experiences. We're continually building new products and features, scaling infrastructure, and responding to our enthusiastic customers.<p>Team members have flexible hours, top notch hardware, and experienced, talented co-workers invested in their success. We pride ourselves on a results oriented, laid back culture and seek people who can thrive with an exceptional amount of independence.<p>Please contact me directly at johnwehr@hiidef.com","time":1301669042,"type":"comment"},{"by":"sgrock","id":2397115,"parent":2396027,"text":"Portland Oregon - AboutUs.org<p>We're looking for an Agile Software Developer and DevOps Engineer.<p>AboutUs Inc. is based in Portland, Oregon. Our website, AboutUs.org, was launched in 2006 and is now one of the most visited places on the Internet. Our team handles big data like no one else, yet there are just 12 of us working behind the scenes. You might be surprised to learn that we don’t work 80-hour weeks. And you may wonder, “How do they keep such a massive ship afloat without drowning themselves in stress and sweat?” Answering, “Because this place is awesome” would be too ambiguous, so here's a summary:<p><pre><code>    Highly selective hiring\n    An open, relaxed office atmosphere\n    Emphasis on collaboration\n    More windows than walls\n    Ping pong\n    Beer\n    Laughs and more laughs\n    Yoga\n</code></pre>\nIf you want your work to be challenging and your days at the office to be enjoyable, AboutUs is the place for you. Thanks for considering us!<p>More info at: <a href=\"http://www.aboutus.org/careers\" rel=\"nofollow\">http://www.aboutus.org/careers</a>","time":1301678638,"type":"comment"},{"by":"oroup","id":2396461,"parent":2396027,"text":"San Francisco, CA<p>VigLink - Senior Java Developer - <a href=\"http://www.viglink.com/jobs#/senior-java-dev\" rel=\"nofollow\">http://www.viglink.com/jobs#/senior-java-dev</a><p>VigLink monetizes outbound traffic using affiliate programs and links already present in content. We are embarking on a very ambitious optimization strategy that will remind you of AdWords both in initial simplicity and potential economic scale. Technologies you will get to work with: Hadoop, Lucene, Cassandra &#38; Nutch.<p>While the company is not funded by Y Combinator, it has a similar feel - we were part of the Lightspeed Summer Grants program in 2009 and are staffed by small team of young energetic technically-minded people excited to make an impact and already seeing significant distribution and revenue traction. The company is backed by angels like Reid Hoffman and Jeff Clavier and institutions like Google Ventures, First Round Capital and Emergence Capital.<p>Intern and H1B transfers are welcome. Unfortunately we do not yet have the resources to sponsor new H1s.","time":1301669861,"type":"comment"},{"by":"jkvor","id":2396774,"parent":2396027,"text":"San Francisco, CA<p>Heroku is hiring for engineering (Ruby and Erlang), business manager and sales positions: <a href=\"http://jobs.heroku.com/\" rel=\"nofollow\">http://jobs.heroku.com/</a><p>Also, we need some badass Logo hackers: <a href=\"http://blog.heroku.com/archives/2011/4/1/announcing_heroku_for_logo/\" rel=\"nofollow\">http://blog.heroku.com/archives/2011/4/1/announcing_heroku_f...</a>","time":1301674022,"type":"comment"},{"by":"lfittl","id":2396176,"kids":[2396298],"parent":2396027,"text":"Vienna, Austria or Remote: Performance Engineer<p>Vienna, Austria: Linux and C Programming Guru<p>Full time positions, stock option plan available.<p>We're building Platform-as-a-Service for hosting providers, enabling them to offer Heroku-style products.<p><a href=\"http://efficientcloud.com/jobs.html\" rel=\"nofollow\">http://efficientcloud.com/jobs.html</a><p>Drop me a line at l.fittl@efficientcloud.com - Cheers!","time":1301665859,"type":"comment"},{"by":"javan","id":2396134,"parent":2396027,"text":"Chicago, IL (or anywhere) - Rails Programmer @ 37signals<p>Amazing group of people; high-quality, high-traffic apps.\n<a href=\"http://jobs.37signals.com/jobs/8508\" rel=\"nofollow\">http://jobs.37signals.com/jobs/8508</a>","time":1301665305,"type":"comment"},{"by":"techscruggs","id":2396235,"kids":[2396563],"parent":2396027,"text":"Austin, TX - Ruby Programmer\nAcademicWorks - Scholarship Management in a SAAS environment.<p>We are working with a lot of cool technologies:  Ruby 1.9.2, Rails 3.0.5, HTML 5, Jquery 1.5, Postgres 9.0, Redis 2.0 (yeah, yeah, yeah, we'll be upgrading 2.2 soon), Chef, AWS hosting and the list goes on ...<p>We are vigilante about getting the bullshit out of the way and doing what it takes to make coding fun.<p>We value passionate people, but won't sacrifice a healthy work/life balance.<p>We are an early stage, but funded and have more demand for our product than we thought!<p>Contact me if you would like to know more.","time":1301666465,"type":"comment"},{"by":"necrodome","id":2396162,"kids":[2396354],"parent":2396027,"text":"Here is a RSS feed for this thread's parent comments (which are mainly job postings):<p><a href=\"http://whoishiring.heroku.com/rss/2396027\" rel=\"nofollow\">http://whoishiring.heroku.com/rss/2396027</a><p>Thanks to Ronnie Roller (<a href=\"http://ronnieroller.com/\" rel=\"nofollow\">http://ronnieroller.com/</a>) for Hacker News API.","time":1301665607,"type":"comment"},{"by":"vkris","id":2396384,"parent":2396027,"text":"Long Island, New York<p>General Sentiment Inc<p>www.generalsentiment.com<p>We are a fast growing media measurement company.  We use our patented Sentiment Analysis algorithm which came from 6 years of research out of Stony Brook University headed by Prof. Steve Skiena.<p>The only quality we look for an individual is - smartness. If you think you are,  email us.<p>We use AWS, Hadoop, Cassandra, Lucene, Flume and code in Python, Java, Perl and more recently with Scala.","time":1301668657,"type":"comment"},{"by":"JBasker","id":2397148,"kids":[2397917],"parent":2396027,"text":"Etsy, the global marketplace for buying, selling and discovering handmade goods, is hiring across the board in Engineering and Product.<p>We value iterative development, minimal design aesthetics and deep passion for creating the things you care about (whether it's an oak table or a Hadoop cluster).<p>Check us out at www.etsy.com/jobs\n(All positions are local in Brooklyn, New York unless otherwise marked)","time":1301679249,"type":"comment"},{"by":"penningtonj","id":2396735,"kids":[2396815],"parent":2396027,"text":"Philadelphia, PA<p>The Center for Biomedical Informatics at the Children's Hospital Of Philadelphia Research Institute needs a Quality Engineer/Programmer to establish quality assurance as a core competency of our rapidly growing, entrepreneurial R&#38;D software group. We’re looking for a unique individual who is interested in moving beyond typical QA roles and responsibilities, someone who is driven to create new methods for testing complex biomedical software. This need is driven by translation of our successful research applications into clinical practice.\n-\n<a href=\"http://careers.stackoverflow.com/jobs/10507/sr-programmer-quality-engineer-children-s-hospital-of?campaign=List\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/10507/sr-programmer-qu...</a>","time":1301673425,"type":"comment"},{"by":"nethergoat","id":2397233,"parent":2396027,"text":"Redwood Shores, CA (SF Bay Area) - Engineers and more<p>EA2D is hiring!  We're a new, autonomous studio within EA building cross-platform social games for gamers.  We've just launched our first game, Dragon Age Legends:<p><a href=\"http://apps.facebook.com/dragonagelegends/\" rel=\"nofollow\">http://apps.facebook.com/dragonagelegends/</a><p>We need help building:<p>* New features for Dragon Age Legends (big ones: real-time, mobile, etc.)<p>* New games for big-name IP (we have access to the full EA library)<p>* An epic social gaming platform (for both internal and external teams)<p>We're small (30 people) and scrappy.  And we're growing fast: 0-200 servers in the past 6 months.  Tech stack is primarily AS3/Java backed by MongoDB, but we also use Python, JavaScript, and Ruby.  We have a highly automated infrastructure running on AWS (EC2 w/ELBs and ASGs, EMR, SQS, etc., plus more than a few super-secret/unreleased Amazon features).  Buzzword potpourri includes Chef, node.js, Google App Engine, Hive, Graphite, Tomcat, GitHub, Pingdom, Loggly, PagerDuty, and continuous deployment.  &#60;3 DevOps.<p>We need platform, game, systems, and mobile engineers.  We need data people and a Director of Technology.  We need producers, marketing, and designers.  Some of our job listings are posted here: <a href=\"http://www.ea2d.com/jobs/\" rel=\"nofollow\">http://www.ea2d.com/jobs/</a>, but we have positions we haven't even finished writing descriptions for.<p>If you're an A player, drop me a line: mikeb@ea2d.com","time":1301680435,"type":"comment"},{"by":"StyleOwner","id":2396771,"parent":2396027,"text":"San Francisco -- Frontend Engineer (* see info about Macbook Air below)<p>Looking for someone with strong frontend skills (javascript, css, html).<p>You'll be our <i>fourth</i> technical hire.  We have a great blend of highly motivated, smart people and a low stress, positive environment.  And fashion is a very hot area right now.<p>If you are interested, email me at matt@styleowner.com with some info about yourself.  I'll give you an overview of our business plan and next six months trajectory.  Please mention HN for extra points.<p>Caveat:  We are only looking for someone who either lives in the Bay Area or who is willing to move here.<p>* Competitive salary, equity, benefits, and Macbook Air included in compensation package.<p>We're looking to fill this position in the next few days and will take a thoughtful look at all applicants.","time":1301673981,"type":"comment"},{"by":"lylo","id":2396752,"parent":2396027,"text":"Edinburgh/Cambridge, UK (Engineer)<p>FreeAgent is a fast-growing and hugely popular Edinburgh-based company obsessed with building fantastic online accounting software. We're a team of smart people looking for clever, productive Ruby engineers in Edinburgh or Cambridge, UK.<p><a href=\"http://www.freeagentcentral.com/company/jobs\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs</a><p>Our engineering team will be at the Scottish Ruby Conference this week, so if you're going along be sure to grab them for a chat about the role!","time":1301673632,"type":"comment"},{"by":"gracelaw","id":2398885,"parent":2396027,"text":"San Francisco, CA - Flash Engineers / Game Engineers, FTE or Intern<p>Lolapps is a small, but growing social gaming company with respectful peers. We are as dedicated to building a great culture as we are to building great products.<p>We have teamed up with John Romero and launched <a href=\"http://www.facebook.com/RavenwoodFair\" rel=\"nofollow\">http://www.facebook.com/RavenwoodFair</a> in October (11M MAU now and Top 10 Social Game on Facebook.)<p>We only have 17 engineers now and are looking to grow to 30 this year.  People like working here because they are:<p>- working with smart, responsible, and fun people: folks that they actually enjoy doing stuff with outside of work<p>- learning new things, solving hard problems, writing optimized codes and iterating quickly  (Our core technology stack consists of AS3, Python, MySQL, MongoDB.)<p>- making a huge impact with a small and collaborative team in a growing space<p>- building feel good games for millions of people to enjoy<p>- loving the amazing food, free yoga, playing games like it is part of their job...  <a href=\"http://www.flickr.com/photos/lolapps/\" rel=\"nofollow\">http://www.flickr.com/photos/lolapps/</a><p>Want to help us take social gaming to the next level and work on Ravenwood Fair / other new IPs?  We will relocate you to our office in San Francisco.<p>Full listings at:  <a href=\"http://lolapps.com/career/\" rel=\"nofollow\">http://lolapps.com/career/</a>","time":1301709895,"type":"comment"},{"by":"kisielk","id":2396627,"kids":[2397262],"parent":2396027,"text":"Vancouver, BC - Python Software Developer<p>Zymeworks Inc.<p>We're a computational biotechnology company focused on designing antibody therapeutic drugs. We have an in-house protein engineering platform built on Python &#38; C++ that is constantly evolving to meet the needs of our scientists.<p>We're looking for a talented software developer, preferably with Python experience, to further our technology. No prior knowledge of Chemistry, Biology, or Physics is required but it certainly is helpful. Strong problem solving skills and an ability to write clean, high performance, efficient code are a must.<p>See <a href=\"http://zymeworks.com/careers/postings/\" rel=\"nofollow\">http://zymeworks.com/careers/postings/</a> for a full description.","time":1301672102,"type":"comment"},{"by":"mikepk","id":2397131,"parent":2396027,"text":"Boston, MA - Engineers / Technologists / Programmers - not remote<p>Why get drowned out in the Valley / SF when you can work on a sweet consumer web startup in Boston! OK I'll get it out of the way, the weather: well, yeah, there's snow/slush on the ground right now on April 1st (jokes on us), but it does make you appreciate when it is nice out a lot more.<p>We're a new company (<a href=\"http://smarterer.com\" rel=\"nofollow\">http://smarterer.com</a>), recently funded, with some big ideas. Not only are we exploring a space with tons of potential, but we plan on putting \"consumer web\" back on the map in the Boston startup scene.<p>There are just three of us at the moment (and only one tech person: me) so joining now means you get to have a big impact on the product, the company, the vision and the technology.<p>There are lots of interesting product, algorithm, gaming, infrastructure and scaling challenges. We're currently using Python (not Django), but we're not language-religious, anyone who loves web tech, big problems, big systems, design, products and programming might be a good fit.<p>Sorry, no remote right now. The early core team needs to be local to really gel (just from my personal and previous startup experience).<p>if you're interested, email me: mikepk@smarterer.com","time":1301678916,"type":"comment"},{"by":"FainaK","id":2396311,"parent":2396027,"text":"Philadelphia, PA Area- Python/PHP Web Application Developer\nAWeber Communications<p>2 Full time opportunities, developing and maintaining Python web based applications run on Unix based open source platforms.<p>Full details at - <a href=\"http://www.aweber.com/careers.htm\" rel=\"nofollow\">http://www.aweber.com/careers.htm</a><p>Responsibilities\n    •    Developing web based services like AWeber.com, and others.\n    •    Participating in the evolution to Python, SQLAlchemy, and Pylons system wide.\n    •    Utilizing Python, PHP5, Perl, SQL, JavaScript, HTML, and XML.\n    •    Being part of a team that provides 24x7 coverage for the production environment.\n    •    Monitoring the production environment and fixing or escalating problems that arise on production machines.\n    •    Handling project oriented work, including developing and maintaining APIs, creating and maintaining web applications &#38; training others in the production environment.\n    •    Capacity and performance optimization and planning recommendations.\n    •    Designing program models and behaviors.\n    •    Integrating new tools into our processes and suggesting new ways of improving systems.<p>About AWeber\nLocated in Huntingdon Valley, PA AWeber develops and manages an online opt-in email marketing and follow-up service. A growing 100,000+ international customer base access our website 24/7 to manage and send their newsletters to recipients who have specifically opted in on their website to receive that information.<p>Please email with the subject \"Web Application Developer\" a cover letter describing why you feel this is the position for you, salary requirements, your preferred desktop OS and detailed PDF resume.<p>Email- resumes@aweber.com","time":1301667491,"type":"comment"},{"by":"mapleoin","id":2397140,"parent":2396027,"text":"Prague, Czech Republic - SUSE<p>SUSE Studio - Designer and Web Developer - <a href=\"http://susestudio.com/jobs/designer_and_web_developer\" rel=\"nofollow\">http://susestudio.com/jobs/designer_and_web_developer</a><p>SUSE Studio - Package and Appliance Assembly Engineer - <a href=\"http://susestudio.com/jobs/package_and_appliance_assembly_engineer\" rel=\"nofollow\">http://susestudio.com/jobs/package_and_appliance_assembly_en...</a><p>There are a few other jobs in Prague working on different things. There are two free YAST developer and Ruby on Rails developer positions and there is also support. I couldn't find a way to link to them from the careers page however:  <a href=\"http://careers.novell.com/psp/css89prd/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_CE.GBL\" rel=\"nofollow\">http://careers.novell.com/psp/css89prd/EMPLOYEE/HRMS/c/HRS_H...</a><p>Lots of jobs in other parts of the world there as well.<p>The atmosphere is great here, it's laid back, while at the same time you get to work on very big projects and interact with the OpenSUSE community or other big open source projects outside SUSE.<p>If you're applying for one of the jobs in the Prague office, feel free to ask me anything in an email or send your CV for me to forward it to HR.","time":1301679025,"type":"comment"},{"by":"arupchak","id":2397144,"parent":2396027,"text":"Amazon.com - Seattle WA - No remote, but willing to relocate based on experience. H1B is possible, again, depending on experience.<p>I am looking for a strong Systems Support Engineer for our growing team. We like to describe our organization as a Startup within Amazon, as our part of the business is still growing rapidly and our engineers can have a lot of influence on where the product goes.<p>Job description below. Contact me at ${hn_username}@gmail.com if you have any questions.<p>The Amazon Services team is looking for a great Systems Support Engineer to keep our systems running and our customers happy. You should be comfortable in a Linux environment, be able to automate everything you did yesterday, and willing to troubleshoot and solve new problems on a daily basis. Come join one of the fastest growing teams within Amazon.<p>Responsibilities:<p>-Maintain stability and performance of our systems via tickets during business hours oncall shifts<p>-Diagnose and troubleshoot new production issues that affect our customers<p>-Create and maintain standard operating procedure documents for new issues identified<p>-Automate operational tasks to assist with our scaling needs<p>Requirements:<p>-Proficiency in a scripting language (Ruby, Perl, Python, Shell)<p>-Familiar with SQL databases<p>-Comfortable navigating a Linux environment<p>-Basic understanding of web application architectures<p>Bonus points:<p>-Written a Rails application<p>-Deep knowledge of Oracle databases<p>-Troubleshooting experience<p>-Ticketing experience","time":1301679184,"type":"comment"},{"by":"rhoward","id":2396428,"parent":2396027,"text":"Java Development opportunities for Agile Enthusiasts.  Only those with a passion for creativity and innovation as well as a drive for excellence need apply.<p>Pillar Technology is rapidly increasing its team in the Detroit Metro area.  We have multiple projects that need strong agile developers who feel comfortable coaching others on practices like tdd, continuous integration, and pair programming.  We are entering an age where our clients are embracing full Agile transformations and Pillar is at the heart of it.  If you want to be part of these exciting opportunities, please send resumes to rhoward@pillartechnology.com<p>technical skills needed:<p>3+ years experience with Java EE or strong background in other oo languages .<p>web services<p>hands on experience with Test Driven Development, Continuous Integration and pair programming<p>nice to have, but not  necessary<p>experience with portals<p>experience with development mobile applications<p>SOA<p>Company Overview:<p>Over the last 12 years, Pillar has been successfully mentoring clients and implementing software development best practices in a variety of industries. Our Speed to Value (S2V) approach is influenced by Agile Methodologies (XP, Scrum, TDD) and includes practices such as Continuous Integration and Travel Light. This approach has enabled us to deliver measurable business value early and often in software development projects.<p>We strive to offer an exciting work environment that balances learning with delivery, a culture that is fun, fast paced and geared to the success of both the project and the individual.<p>please send resumes to hr@pillartechnology.com","time":1301669250,"type":"comment"},{"by":"trefn","id":2396300,"parent":2396027,"text":"San Francisco, CA<p>Mixpanel - YC S09, real-time web analytics<p>We're dealing with very large volumes of data (&#62; 1B requests per month), using MongoDB, MySQL, Redis, and Python.<p>We're primarily hiring for two roles:<p>* Full-stack web developer (building everything from our internal API's to JS/CSS) <a href=\"http://mixpanel.com/jobs/frontend-engineer\" rel=\"nofollow\">http://mixpanel.com/jobs/frontend-engineer</a><p>* Scalability engineer (help us stay on top of our growth, lots of cool stuff here) <a href=\"http://mixpanel.com/jobs/backend-engineer\" rel=\"nofollow\">http://mixpanel.com/jobs/backend-engineer</a><p><a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a>, apply to jobs@mixpanel.com","time":1301667346,"type":"comment"},{"by":"sybreon","id":2396404,"kids":[2396490],"parent":2396027,"text":"Kuala Lumpur, Malaysia.<p>Aeste - <a href=\"http://www.aeste.my/hiringnow\" rel=\"nofollow\">http://www.aeste.my/hiringnow</a><p>Swimming (and drowning) at the software-hardware boundary.<p>We are currently looking to fill several full-time engineering positions.<p>If you are looking for a place to experience an alternate work culture within Malaysia, feel free to apply. At AESTE, you will be given the opportunity to impact the world in unexpected ways.","time":1301668938,"type":"comment"},{"by":"andrewvc","id":2396595,"parent":2396027,"text":"Santa Monica / Los Angeles, CA: VOKLE, Inc. ( <a href=\"http://www.vokle.com\" rel=\"nofollow\">http://www.vokle.com</a> )<p>Full Time: Flash/Flex developer. If you think dealing with tricky issues with live streaming video is fun, this might be the job for you. We've got massive growth and we deal with that on a large scale. Ideally you're the sort of developer who does more than just flash/flex, and would welcome stepping into other roles (rails dev, ops.) as well.<p>Paid Intern: We're looking to hire a paid intern to hack on our Ruby/Rails site. We're committed to code quality, and believe strongly in testing.<p>About VOKLE:<p>We were started a year and a half ago and have seen fantastic growth. Additionally, we've got a fun stack to work on and a great office environment.<p>You'll be working in Santa Monica, the heart of LA's startup community. We're active members of the community (I'm the organizer of LA Hacker News actually) and this is a great place to be if you want to be a part of it.<p>Contact: andrew@vokle.com","time":1301671672,"type":"comment"},{"by":"jack","id":2398387,"parent":2396027,"text":"Vancouver, BC, Canada<p>Telecommuting is an option.<p>Clio (<a href=\"http://www.goclio.com\" rel=\"nofollow\">http://www.goclio.com</a>) is hiring talented Ruby on Rails developers. We are a fast-growing provider of practice management software for lawyers in small firms. Think of Clio as a mashup of Highrise, FreshBooks, Basecamp, and Harvest tailored to the specific project management needs of lawyers that practice as solos or in small firms (which is, by the way, 80% of lawyers in North America).\nWe're a small, fun-loving and tight-knit team with team members spread across North America. We're looking for team players that also know how to work independently. If you're located in Vancouver, great, but if not please still apply.<p>If you're interested please apply via <a href=\"http://clio.theresumator.com/apply/Lx3Omr/Software-Developer-Ruby-On-Rails.html\" rel=\"nofollow\">http://clio.theresumator.com/apply/Lx3Omr/Software-Developer...</a> or jobs@goclio.com.","time":1301697229,"type":"comment"},{"by":"famousactress","id":2396436,"parent":2396027,"text":"San Francisco, CA   - (Remote considered for the right fit)<p>Elation EMR - We're building incredibly useful web-based tools for physicians. It's a really rewarding and exciting space, and current a team of only five people, so you'd definitely have an opportunity to make a huge difference. We're angel-funded, and have an amazing group of advisors and investors.<p>We're open minded about tools, but right now they include jQuery, Python/Django, MySQL, Redis, Celery, Sphinx.<p>Take a peek at <a href=\"http://elationemr.com\" rel=\"nofollow\">http://elationemr.com</a>","time":1301669433,"type":"comment"},{"by":"davi","id":2398646,"parent":2396027,"text":"I'm hiring a software developer for my group at Janelia Farm Research Campus, in Ashburn, VA. The goal will be to develop workflow for extracting wiring diagrams of neuronal circuits from large-scale serial electron microscopy of brain tissue. You can read about what I'm doing at <a href=\"http://www.hhmi.org/research/fellows/bock.html\" rel=\"nofollow\">http://www.hhmi.org/research/fellows/bock.html</a>, and browse data at <a href=\"http://bit.ly/ga3Cfk\" rel=\"nofollow\">http://bit.ly/ga3Cfk</a>. A detailed writeup of the approach was published a few weeks ago in an article at Nature.<p>I think the ideal candidate could come from a variety of backgrounds -- someone who had previously written or contributed significantly to the development of a game engine could be good, for example. Looking for strong quantitative chops, creativity, and a willingness to do some plumbing in order to make an elegant solution.","time":1301702704,"type":"comment"},{"by":"a-priori","id":2396295,"kids":[2397449],"parent":2396027,"text":"Ottawa (Gatineau), Canada - software developers, software architects, QA, project &#38; development managers, sales.<p>Burlington, Canada - QA.<p>San Jose, California - software architects.<p>Yerevan, Armenia - software developers.<p>Cluj, Romania - software developers.<p>Macadamian, a software development and UX consultancy, is hiring for multiple positions in all of our offices. If you're interested, please contact either myself (mmelanson@macadamian.com) or careers@macadamian.com.<p><a href=\"http://www.macadamian.com/about_us/careers/\" rel=\"nofollow\">http://www.macadamian.com/about_us/careers/</a>","time":1301667311,"type":"comment"},{"by":"petervandijck","id":2396352,"parent":2396027,"text":"Montreal or Canada: Javascript frontent developer, iOS/mobile developer and backend Scala/Grails developers. Full-time, salaried.<p>We're a small startup that's funded. We're building a product in the photo space, not another mobile photo sharing app (however awesome those are), but solving some real problems and looking at the future of photography. We're starting small but thinking big.<p>We're small, lean and awesome to work with, if I say so myself. We're planning an office but for now everyone is working from home. We're only 3 so far, so we're looking to build the initial team.<p>You get a competitive salary and full benefits.<p>We have open-source Fridays, which means you can work on an open source project of your choice on Fridays.<p><a href=\"http://blog.getgush.com\" rel=\"nofollow\">http://blog.getgush.com</a>, or contact me via my HN profile email. Add your Github profile, HN username, OS, blog etc.","time":1301668253,"type":"comment"},{"by":"ewryan","id":2396715,"parent":2396027,"text":"Boulder, CO - Gnip (<a href=\"http://gnip.com\" rel=\"nofollow\">http://gnip.com</a>) - Two engineering positions, multiple sales/marketing positions:\n<a href=\"http://gnip.com/careers\" rel=\"nofollow\">http://gnip.com/careers</a><p>About Gnip:\nGnip's software collects, processes and delivers hundreds of millions of activities a day from a wide variety of social media APIs. Using an agile process with weekly iterations and bi-weekly deployments, we take a pragmatic approach to building our software which requires a broad palette of language experience, framework understanding, and software environments.<p>Technology we use:\nRuby/JRuby/Rails,\nJava,\nAmazon Web Services (EC2/S3/RDS),\nMySQL,\nGit/GitHub<p>Perks:\n  Daily breakfast at work,\n  Ski passes,\n  Open workday tab at two awesome coffee shops (The Cup, The Laughing Goat),\n  Gym membership, \n  In office kegerator","time":1301673181,"type":"comment"},{"by":"equalarrow","id":2396410,"parent":2396027,"text":"San Francisco, CA<p>Limos.com has openings. They are doing 'speed hiring' where you will get an offer letter before you leave. I think that's pretty cool.<p>Right now there are positions open for:<p>Front end html5/css developer\nQA person\nSr. Rails developer.<p>Check out the jobs page: <a href=\"http://www.limos.com/jobs\" rel=\"nofollow\">http://www.limos.com/jobs</a>","time":1301669017,"type":"comment"},{"by":"doscott","id":2396585,"parent":2396027,"text":"Austin, TX (or anywhere for the right person) -- Ruby + Front-End<p>Small team (3).  Bootstrapped. Profitable. 1.5 years old. High Traffic. High Visibility. Good Times.<p>DoStuff Media runs:\n* The social and artist discovery portions of many large music festival websites: Lollapalooza, Austin City Limits, Jazz Fest, and many more\n* Local Entertainment guides in 3 cities (more launching soon): Do512.com (austin), Do312.com (chicago), Do713.com (Houston)<p>We've got a nice piece of local pretty figured out and are growing (revenue/footprint not team) quickly.  Need someone that is fast/good/gets design/likes to have a good time.<p>Pay ain't great to start, but not bad either.  and lots of perks, like vip to festivals.<p>More and contact info at: <a href=\"http://dostuffmedia.com\" rel=\"nofollow\">http://dostuffmedia.com</a>","time":1301671557,"type":"comment"},{"by":"northisup","id":2397919,"parent":2396027,"text":"Skype! Help us fix Mac version 5 :)<p>Also a whole host of backend engineering on huge scale systems (not listed for some reason, ping me)<p><a href=\"http://skypecareers.com/results\" rel=\"nofollow\">http://skypecareers.com/results</a>","time":1301690072,"type":"comment"},{"by":"gduffy","id":2396358,"kids":[2396894],"parent":2396027,"text":"San Francisco, CA<p>Dropcam - Started by two former Xobni employees, we are helping people keep an eye on the things they care about using Wi-Fi cameras with cloud DVR recording.<p>We take in more video than YouTube and are one of the largest video streaming sites on the 'net. We're extremely popular in middle America, check out: <a href=\"https://www.dropcam.com/press\" rel=\"nofollow\">https://www.dropcam.com/press</a><p>Lots of awesome stuff to work on: big data (everyone says this- but trust me, we <i>really</i> mean it!), web/flash, embedded software, video analysis &#38; computer vision, mobile apps. Venture-backed and hiring!<p>Check out <a href=\"https://www.dropcam.com/jobs\" rel=\"nofollow\">https://www.dropcam.com/jobs</a> or email me at greg@dropcam.com.","time":1301668302,"type":"comment"},{"by":"garysieling","id":2396098,"kids":[2397065],"parent":2396027,"text":"Philadelphia, PA (Blue Bell) - Software engineers- Java/C#. \nWe're a small company, and write software for pharmaceuticals &#38; energy companies.\n<a href=\"http://www.wingspan.com/about/careers/\" rel=\"nofollow\">http://www.wingspan.com/about/careers/</a>","time":1301664834,"type":"comment"},{"by":"plnewman","id":2396378,"parent":2396027,"text":"Foster City, CA<p>Rearden Commerce:<p>You: Hacker generalist with some development and some ops experience who enjoys a fun environment.<p>Us: Internal applications team at Rearden Commerce. We build &#38; deploy tools &#38; applications that make the company more productive.<p>Full details at <a href=\"http://www.heyimhiring.com/\" rel=\"nofollow\">http://www.heyimhiring.com/</a> or ptrk@reardencommerce.com","time":1301668562,"type":"comment"},{"by":"willwagner","id":2397205,"parent":2396027,"text":"Palo Alto, CA - SurveyMonkey.com<p>We're looking for Javascript/FrontEnd Developers, Python Developers, and Ops people. We also have some Product Manager and QA positions available.<p>Feel free to email me directly or hit up our jobs page: <a href=\"http://www.surveymonkey.com/jobs/Home_Jobs.aspx\" rel=\"nofollow\">http://www.surveymonkey.com/jobs/Home_Jobs.aspx</a>","time":1301680079,"type":"comment"},{"by":"niyazpk","id":2396439,"kids":[2397027],"parent":2396027,"text":"Bangalore, India (Sorry, no remote).<p>We are looking for JavaScript/UI Developers.<p>We are a well funded ecommerce Startup. We already have a good team working on the technology side.<p>Please get in touch and I will convince you to join us :)<p>(Freshers and interns are welcome too).","time":1301669511,"type":"comment"},{"by":"nixme","id":2397794,"kids":[2399399],"parent":2396027,"text":"San Francisco, CA - Web and Mobile Engineers<p>Manymoon is the #1 app in the Google Apps Marketplace. We have multiple open positions for full-time engineers as we build our new social productivity platform for small businesses.<p>We work primarily in Ruby, Javascript/CoffeeScript, Groovy, MySQL, MongoDB, and Redis and experiment where we see fit. We're also moving aggressively into iPhone and Android development.<p>We're a small team with a cool office in SOMA -- music playing and pets always welcome.<p>Contact me directly with any questions: gopal@manymoon.com<p><a href=\"http://www.manymoon.com/jobs\" rel=\"nofollow\">http://www.manymoon.com/jobs</a>","time":1301688349,"type":"comment"},{"by":"btipling","id":2396537,"parent":2396027,"text":"San Francisco.<p>Cloudkick @ Rackspace. We really need some more front-end engineers. If you're good with JavaScript please give us a call. <a href=\"http://cloudkick.com/careers\" rel=\"nofollow\">http://cloudkick.com/careers</a><p>We're about to move into a brand new office, so it should be fun. Offer a lot of freedom and challenging responsibilities.","time":1301670876,"type":"comment"},{"by":"kola","id":2396446,"kids":[2396790],"parent":2396027,"text":"Palo Alto, CA<p>Mertado (YC W2010) - Help users discover interesting merchandise.<p>We use - MongoDB, MySQL, Python, LAMP.<p>* Frontend Engineers - (APIs, CSS/JS). Help build our web app, Facebook app and our new embedded shopping offering.<p>* Backend engineers - Work on product recommendation engine, custom in house analytics engine, APIs, scalability &#38; build platform to integrate with hundreds of our vendors.<p>* Interns - Web developers, backend developers, marketing.<p>Why talk to us? Awesome team, well funded, really big market opportunity (think Zappos, QVC).<p>Apply - jobs@mertado.com<p>More info - <a href=\"http://www.mertado.com/jobs\" rel=\"nofollow\">http://www.mertado.com/jobs</a>","time":1301669652,"type":"comment"},{"by":"euroclydon","id":2396817,"parent":2396027,"text":"Raleigh, NC<p>Power Analytics Corporation<p>We write software to model and simulate large important power systems, like Micro-Grids and Data Centers, in real time. As a software developer here, you would get to write a lot of new code and work with some very smart engineers.<p>We are looking for a software engineer with experience in electrical power systems or process control who has strong skills building APIs using C# and WCF. Web development knowledge such as Javascript and SVG would be a plus.<p><a href=\"http://poweranalytics.com/\" rel=\"nofollow\">http://poweranalytics.com/</a><p>contact: jpearce at company domain.","time":1301674609,"type":"comment"},{"by":"AntiRush","id":2397510,"parent":2396027,"text":"Have you built your own sweet HTML5 game? At Game Closure, we are building a cross-platform HTML5-based gaming SDK (iOS, Android, and browser for now). Shoot us an email at jobs@gameclosure.com.<p>Located in Palo Alto, CA. We will pay for your travel if we want to interview you.<p>We are hiring for the following positions:<p>Game Developer: Experience building games and knowledge of javascript. Show us your games!<p>Platform Engineer: Deep expertise in some of the following - iOS, Android, WebGL/OpenGL, javascript, HTML5.<p>Network Engineer: Deep expertise in real-time networking technologies on the web.","time":1301684017,"type":"comment"},{"by":"ardit33","id":2397181,"parent":2396027,"text":"Yammer is hiring.   Both server side (Scala, Java, Ruby) front end  (JS),  and especially mobile clients (Android/iPhone/Blackberry).\n<a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>It is great company, with a really fun and awesome environment.<p>shoot an email at ardit33[at_gmail_com]","time":1301679773,"type":"comment"},{"by":"benro","id":2396976,"parent":2396027,"text":"Cedar Rapid, IA - Engineer/Developer<p>Small consulting company providing solutions ranging from Industrial Automation to High Precision Agriculture.  Looking for INTERN s and Full time developers.  Software Development is primarily .NET, but experience with LabView and PLC Programming would be helpful.","time":1301676912,"type":"comment"},{"by":"buymorechuck","id":2396485,"parent":2396027,"text":"Palo Alto, CA - Flipboard\nSeeking iOS, service, and web developers with a passion for design and craftsmanship. (No remote is possible.)<p><a href=\"http://www.flipboard.com/jobs\" rel=\"nofollow\">http://www.flipboard.com/jobs</a><p>[NSString stringWithFormat:@\"%@+HN@%@.com\", @\"charles\", @\"flipboard\"]<p>\"%s+HN@%s.com\" % (\"charles\", \"flipboard\")","time":1301670258,"type":"comment"},{"by":"azanar","id":2398009,"parent":2396027,"text":"Seattle, WA<p>Wetpaint<p>We’re working on a platform of new services and tools aimed at a revolutionary new way of doing publishing. Systems that can spot breaking news, predict the amount of traffic a piece of content will drive and figure out where, when and how to best distribute this content.<p>We are looking for a software developer and a test engineer. Details here: <a href=\"http://www.wetpaint.com/page/jobs\" rel=\"nofollow\">http://www.wetpaint.com/page/jobs</a><p>Feel free to contact me about either of these, or anything else on that page: ecarrel@wetpaint.com","time":1301691146,"type":"comment"},{"by":"nfriedly","id":2396360,"parent":2396027,"text":"San Francisco, CA<p>Sociable Labs - Smarter Facebook Social Plugins - <a href=\"http://sociablelabs.com\" rel=\"nofollow\">http://sociablelabs.com</a><p>We're looking for hackers for front-end, back-end, ops, and more - details here: <a href=\"https://www.jobscore.com/jobs/sociable/list\" rel=\"nofollow\">https://www.jobscore.com/jobs/sociable/list</a><p>We're pushing the limits of what cross-domain AJAX can do and serving millions of visitors per month on a number of well-known websites.<p>Apply at jobscore or send me a note if you have any questions: nathan @ company url.","time":1301668306,"type":"comment"},{"by":"bokchoi","id":2396866,"parent":2396027,"text":"Seattle, WA - java dev, front-end dev, tester, and PM positions available.<p>LabKey is looking for devs, testers, and PMs.  We are a bioinformatics software company and you will play a key role in the creation of a product that allows scientists to integrate, analyze, and share large, complex datasets, accelerating their critical work in fields such as cancer and HIV research.<p>Contact info and more about the positions:\n<a href=\"http://labkey.com/company/careers\" rel=\"nofollow\">http://labkey.com/company/careers</a>","time":1301675263,"type":"comment"},{"by":"alex_c","id":2396087,"parent":2396027,"text":"Toronto - Senior Java/MySQL Developer.<p>You'd be working as part of a small team on a very successful, high-traffic API - I suspect the type of position many HNers would enjoy.<p><a href=\"http://toronto.en.craigslist.ca/tor/sof/2284072232.html\" rel=\"nofollow\">http://toronto.en.craigslist.ca/tor/sof/2284072232.html</a><p>Edit: also hiring for a more junior Mobile/Web Developer position (aimed mostly at new grads).<p><a href=\"http://toronto.en.craigslist.ca/tor/sof/2278675500.html\" rel=\"nofollow\">http://toronto.en.craigslist.ca/tor/sof/2278675500.html</a>","time":1301664652,"type":"comment"},{"by":"tsewlliw","id":2396434,"parent":2396027,"text":"Austin, TX<p>SmartBear, CodeCollaborator team. We do team lunches, and we have fun.<p>Multiple developer openings:<p>Mostly just be smart and adaptable, but specifics in Eclipse/RCP, Visual Studio addins, Web GUI stuff, and version control systems are big wins.<p>QA opening:<p>We like automated testing. I'm the wrong guy for specifics, but I'll hook you up.<p>will.west@smartbear.com","time":1301669370,"type":"comment"},{"by":"bkrausz","id":2398344,"parent":2396027,"text":"GazeHawk is hiring interns and full-timers in Mountain View.<p>We're looking for both web developers &#38; computer vision/machine learning folks.<p>Webdev description: <a href=\"http://www.gazehawk.com/jobs/\" rel=\"nofollow\">http://www.gazehawk.com/jobs/</a><p>CV/ML description: smart person with exposure to ML and a strong desire to expand on it.<p>We're also looking for a blogger/statistics intern.  Come run cool ET studies and then write about them!<p>Email address is in my profile: send me anything to convince me that you're awesome (a resume is a good example).","time":1301696505,"type":"comment"},{"by":"jneale","id":2396318,"parent":2396027,"text":"Camden - London - UK - Full stack Ruby devs<p>We're a rapidly expanding media technology company looking for lots of developers. We have a whole range of technologies working in production including Hadoop, Mongo and Clojure.<p>You can see our main site at <a href=\"http://www.forward.co.uk/\" rel=\"nofollow\">http://www.forward.co.uk/</a>, or our tech site at <a href=\"http://forwardtechnology.co.uk/\" rel=\"nofollow\">http://forwardtechnology.co.uk/</a><p>mailto:jon.neale@forward.co.uk, or jobs@forwardtechnology.co.uk","time":1301667581,"type":"comment"},{"by":"cwebb227","id":2438542,"parent":2396027,"text":"Lead Software Developer for early-stage startup in Santa Monica<p>OVERVIEW\nChowNow is interviewing Lead Software Developer candidates.<p>We're an early-stage startup based in Santa Monica, focused on scaling online ordering to tens of thousands of restaurants in the U.S. and abroad.  We've got a novel approach that involves web apps, Facebook apps, iOS apps, and Android apps.  We're in \"pilot\" stage with over a dozen restaurant locations.<p>We're looking for someone who will lead our software development efforts.<p>RESPONSIBILITIES\nWork side-by-side with co-founders and make technology decisions.\nHands-on development of products.\nHelp build-out and manage development team.<p>REQUIREMENTS\nProduction experience with LAMP stack.\nProficiency using HTML/CSS/Javascript/AJAX.  Experience with Symfony framework is a plus.\nDemonstrated design and UX sensibilities.\nStrong Computer Science fundamentals gained through Bachelor’s degree in CS, related discipline or equivalent industry experience.\nAbility to work in areas outside of your usual comfort zone and get things done quickly.<p>This is a great opportunity to join an early-stage startup as the first full-time technical team member.  Compensation will be a combination of cash and stock options, to be discussed.<p>Please submit resumes to jobs@chownow.com.  Thanks.","time":1302633868,"type":"comment"},{"by":"pashields","id":2396132,"parent":2396027,"text":"New Haven, CT or remote (us only, northeast preferred) - iPhone and/or opengl developer<p>We're a funded stealth startup building what we call a social opinion platform. We'd like to add another developer on our iPhone client. In particular someone with experience build graphical elements on top of opengl and/or quartz would fill a good niche.<p>Please submit code/github/portfolio if you are interested. Good compensation, equity for right person. pat at floop dot com.","time":1301665299,"type":"comment"},{"by":"throwawayappdev","id":2396114,"kids":[2410331],"parent":2396027,"text":"REMOTE - (1) iOS/Mac Developer (2) Java / Android Developer (3) HTML/CSS/JS Developer<p>Highly Profitable Mac/iOS Startup Hiring ($300 to $500/day, or monthly/yearly equivalent)<p>We are one of the leading developers on the iOS and Mac platforms with dozens of successful apps, adding around one million new users per month and doubling our revenues every quarter.<p>You need to be:<p>1. Passionate<p>2. Dedicated<p>3. Awesome at what you do<p>If you have strong experience and a portfolio to back yourself up, then please email us at: throwawayappdev@gmail.com<p>Immediate start available.","time":1301665019,"type":"comment"},{"by":"buro9","id":2396222,"parent":2396027,"text":"London - Java Developer<p>London - Python Developer<p>London - Front-end Web Developer<p>Product creation and incubation as part of Yell Labs. Based near Chancery Lane/Holborn.<p>We want people who can teach us stuff, we promise an environment in which you'll also be learning.<p>Our team is already great, if you want to come in for a short meeting to find out more, please do. We're also good for meeting in pubs post-work, or travelling nearby for lunch if you'd prefer to meet us at your convenience.<p>mailto:david.kitchen@yellgroup.com","time":1301666320,"type":"comment"},{"by":"jonasvp","id":2397814,"parent":2396027,"text":"Kreuzberg, Berlin, Germany - Python (Django) developer - <a href=\"http://www.jonasundderwolf.de\" rel=\"nofollow\">http://www.jonasundderwolf.de</a><p>We're a small web development agency taking on bigger projects. We use Django, FeinCMS, git, PostgreSQL, Fabric to build faster, prettier, and more usable sites for our clients. Looking to start on a product of our own later this year as well.<p>On-site only at this point - Berlin is a great site to be, though!","time":1301688719,"type":"comment"},{"by":"nmueller","id":2397314,"parent":2396027,"text":"Menlo Park, CA - Generalist Ruby Engineer <a href=\"http://www.nearbuysystems.com/company/rubyengineer\" rel=\"nofollow\">http://www.nearbuysystems.com/company/rubyengineer</a><p>Menlo Park, CA - C++/CUDA Engineer <a href=\"http://www.nearbuysystems.com/company/cengineer\" rel=\"nofollow\">http://www.nearbuysystems.com/company/cengineer</a><p>Nearbuy Systems is a year-old startup working on indoor location-based services.  We've got two positions -- a C++/CUDA engineer to work on the \"location\" part and a ruby engineer for the \"services\" side.<p>Our location system fuses together multiple sensor feeds to get 1m accuracy indoors.  It's a highly parallel system with agressive performance requirements and a lot of fun problems.  \"Services\" encompasses a Rails frontend, a large distributed backend, data collection and reporting.  If you like ruby but aren't 100% frontend focused you'll fit right in.<p>We're a small engineering team (currently three people, growing to six).  We practice agile development, love playing with new technologies and know how to have a good time. Experience with something unusual and unrelated to the requirements is a big plus.","time":1301681413,"type":"comment"},{"by":"meterplech","id":2396350,"parent":2396027,"text":"New York, NY.<p>1010data- Want to work with the biggest data possible? Our clients include such massive data producers as the New York Stock Exchange and Dollar General. If you are interested in any of the positions below, email me (it's in my account info).<p>We are hiring in two main areas...<p>1) Developer- want to learn an incredibly cool functional programming language similar to APL? Enjoy thinking list/vectorized (we love people who know Lisp!) or want to learn more about it? Developers build our incredibly fast and flexible platform, find out ways to process terabytes of data in mind-blowing and massively parallelized ways, and solve deeply analytic questions for customers.<p>2) Business Intelligence Developer- Want to combine passion for stat/econ/business and technology? These developers work with clients to get the most out of their data. They create analytic applications built on top of our platform.<p>Also Sys engineers and web applications programmers, but I am not involved in that. Check out <a href=\"http://www.1010data.com/company/careers/current-job-openings\" rel=\"nofollow\">http://www.1010data.com/company/careers/current-job-openings</a>","time":1301668217,"type":"comment"},{"by":"lamplighter","id":2396131,"parent":2396027,"text":"Toronto, full time (no remote)<p>Uken Games - <a href=\"http://www.uken.com/jobs\" rel=\"nofollow\">http://www.uken.com/jobs</a><p>We are a startup (~10 full times) that makes web based games in HTML5 for iOS, Android, BlackBerry and Facebook.  We are growing fast and need talented back-end web engineers to help us scale (Rails &#38; MySQL).  We are also looking for Javascript developers to help us push the edge of what browsers can do.","time":1301665293,"type":"comment"},{"by":"raptrjobs","id":2397647,"parent":2396027,"text":"Location: Mountain View, CA (a couple blocks from 101)<p>Remote: Sorry, no remote work<p>Raptr is adding some exciting products to help our over 6 million users get more out of their video games, and we need some help!<p>We're hiring for frontend web, backend web, and desktop client application software engineer positions.<p>Raptr helps people get more out of their games with useful tools to track gameplay time, compare achievements, enable social interaction, and discovery of games and users.<p><a href=\"http://raptr.com/\" rel=\"nofollow\">http://raptr.com/</a><p>We're looking for folks with a solid CS background, and a good top to bottom understanding of large scale web applications.<p>Backend web positions work on scaling, data, and providing apis to the frontend team (80% PHP, some Python, a tiny bit of legacy Perl).<p>Frontend web team writes html, javascript, and view layer php code using backend apis. Client Application team writes a python + QT application for chat + friends + gameplay tracking.<p>Take a look at the job descriptions at <a href=\"http://raptr.com/info/jobs\" rel=\"nofollow\">http://raptr.com/info/jobs</a> and email me (chris-jobs@raptr.com) with resume for quick consideration if you're interested.","time":1301686020,"type":"comment"},{"by":"gnubardt","id":2396394,"parent":2396027,"text":"Boston/Cambridge, Seattle, INTERN - Java, Rails, Frontend, HTML5 Developers<p>Brightcove - An online video provider, we're rapidly scaling (over 1 billion player requests a week) and need QA &#38; Software engineers.  Our backend is mostly Java &#38; Rails with Flex and HTML5 on the frontend.<p><a href=\"http://brightcove.com/careers\" rel=\"nofollow\">http://brightcove.com/careers</a><p>Send me an email (in profile) if you have any questions!","time":1301668812,"type":"comment"},{"by":"cuantilecorp","id":2396247,"parent":2396027,"text":"(1) C# developer full time in NYC (midtown east)\ndatabase work with sql server, good skills with sql queries and profiling. 2+ years experience. Finance experience a plus. Relaxed work environment, good benefits, hard software problems.\n(2) Flex/Flash developer on a part-time contract basis to do work on a client app. 20-30 hours work.<p>Send resumes and salary/rate requirements to jobs@cuantile.com","time":1301666586,"type":"comment"},{"by":"lbbell","id":2396988,"parent":2396027,"text":"DC Metro Area - Blue Atlas Interactive is looking for talented and motivated web and mobile developers. As a web developer for Blue Atlas, you will have the opportunity to work with contemporary technologies/tools, and be involved in the full life-cycle of projects. We are looking for developers with strong HTML/CSS/Javascript skills.  Experience with server-side technologies is ideal, but we are willing to train the right candidate.<p>If any of the following sound like you, we would love to hear from you:<p><pre><code>    * You're curious - you want to know how it works\n    * Something just feels right about a new book from O'Reilly or Pragmatic Press\n    * You're a developer, but you understand the importance and value of asthetics\n    * You enjoy the process of talking through a solution\n    * You have interests outside of everything web\n</code></pre>\nWill consider permanent or contract.  Must be local to the DC metro area.  U.S. citizenship required.<p>Interested?  Email resume, salary requirements and portfolio examples to hr@blueatlas.com","time":1301677034,"type":"comment"},{"by":"tungwaiyip","id":2397041,"parent":2396027,"text":"Kontagent (San Francisco, CA)<p>We are looking for sales and engineers! <a href=\"http://jobvite.com/m?3rJ72fw3\" rel=\"nofollow\">http://jobvite.com/m?3rJ72fw3</a><p>Kontagent measures people, not pages, and is a leading analytics platform for social application developers. The platform has been built to provide deep social behavior analysis and visualization that provides actionable insights via a hosted, on-demand service. It works with many of the world’s largest developers and brands, tracking thousands of social applications and games with over 100 million monthly active users and over 15 billion messages per month.<p><a href=\"http://techcrunch.com/2011/02/10/facebook-analytics-platform-kontagent-now-tracking-100m-users-15b-messages-per-month/\" rel=\"nofollow\">http://techcrunch.com/2011/02/10/facebook-analytics-platform...</a><p><a href=\"http://venturebeat.com/2011/02/28/kontagent-launches-real-time-social-app-monitoring-system/\" rel=\"nofollow\">http://venturebeat.com/2011/02/28/kontagent-launches-real-ti...</a><p>Email me waiyip.tung at kontagent.com if you need more information.","time":1301677700,"type":"comment"},{"by":"mivok","id":2396334,"kids":[2396574],"parent":2396027,"text":"Columbia, MD - OmniTI<p>Site Reliability Engineer (Systems Administrator), Database Administrator, Web Engineer (Perl or PHP), Project Manager, Javascript Developer, Web Interface Designer<p>See <a href=\"http://omniti.com/is/hiring\" rel=\"nofollow\">http://omniti.com/is/hiring</a> (and <a href=\"http://circonus.com/careers\" rel=\"nofollow\">http://circonus.com/careers</a> for the Javascript Developer Position).","time":1301667783,"type":"comment"},{"by":"Jakob","id":2397016,"parent":2396027,"text":"Munich, Germany - Game Developer<p>Pokermania connects social gaming with world-known artists. We are partly community partly online gaming and have small offices in Cologne and Munich. Cologne travels through the world and returns with the best artists and brands. The other half is the engineering department and sits in Munich. We are technically-driven and develop a social poker platform.<p>The mixture between entertainment industry and software development is fast-paced. But our small team entertains many users simultaneously. The work changes frequently. We love to be responsible for the complete system and scale it to the next level. We are 12/12 on the Joel Test [0] :)<p>As a game developer you will work with us and<p>* expand a system which is easy and scales\n* have very good knowledge of either Python, PHP or JavaScript\n* can work in a unix environment<p>Plusses are<p>* MySQL/XtraDB scaling experience\n* Interest in Poker\n* Active OpenSource contributor<p>[0] <a href=\"http://www.joelonsoftware.com/articles/fog0000000043.html\" rel=\"nofollow\">http://www.joelonsoftware.com/articles/fog0000000043.html</a>","time":1301677371,"type":"comment"},{"by":"pretzel","id":2396599,"kids":[2396678],"parent":2396027,"text":"London, UK<p>Qubit digital - <a href=\"http://www.qubitdigital.com/join-our-team\" rel=\"nofollow\">http://www.qubitdigital.com/join-our-team</a><p>We're looking to double the size of our company over the next 12 months. We're hiring senior and graduate software engineers in the next quarter, plus a whole bunch of other roles. We're not looking any skills in particular, just smart people.<p>Qubit Digital is a year-old company founded by 4 ex-Googlers. We're in the business of making company's websites perform better, by generating rule-based concrete advice.<p>We've a bunch of huge clients already, and are trying to keep up with growth! It's a busy time and you'll get thrown in the middle of bunch of AI work, doing cloud computing and presenting complex data to clients in a simple actionable manner.<p>It's a fun place to be (not just because we're in the middle of Soho), there's a bunch of perks for everyone and there's both strong leadership from above and freedom for everyone to do things the way they know best.<p>If you are interested, send an email to careers@qubitdigital.com.","time":1301671736,"type":"comment"},{"by":"ynn4k","id":2396138,"kids":[2397102],"parent":2396027,"text":"Intelligent App search and discovery startup is looking for:<p>US / India - Business Development/Marketing Manager<p>India - Front end designer, Deployment architect, NLP research engineer.<p><a href=\"http://iapps.in/jobs\" rel=\"nofollow\">http://iapps.in/jobs</a>","time":1301665335,"type":"comment"},{"by":"danielpatricio","id":2396305,"kids":[2397349],"parent":2396027,"text":"Toronto - Backend/Front-end\nPinpoint Social\n<a href=\"http://www.youtube.com/watch?v=XUfRqCem5_M\" rel=\"nofollow\">http://www.youtube.com/watch?v=XUfRqCem5_M</a><p>We have built a self-service platform for building promotions on the world's largest social networks.<p>We are looking for a hacker to add to our hustle. API integrations and the self service usability are our current priorities<p>Say hi at @danielpatricio","time":1301667440,"type":"comment"},{"by":"christyyyjoy","id":2396853,"kids":[2396945],"parent":2396027,"text":"Ruby Developer - San Diego, CA\n<a href=\"http://stocktwits.jobscore.com/jobs/stocktwits/ruby-developer/aw_6hatGir4j2ieJe4bk1X\" rel=\"nofollow\">http://stocktwits.jobscore.com/jobs/stocktwits/ruby-develope...</a><p>PHP / WordPress Developer - San Diego, CA\n<a href=\"http://stocktwits.jobscore.com/jobs/stocktwits/web-developer-wordpress-php/aeDpsssCOr4iC_eJe4bk1X\" rel=\"nofollow\">http://stocktwits.jobscore.com/jobs/stocktwits/web-developer...</a><p>Bookkeeper/Accountant - San Diego, CA\n<a href=\"http://stocktwits.jobscore.com/jobs/stocktwits/bookkeeperaccountant/dcrjw2w-Cr4lNgeJe4bk1X\" rel=\"nofollow\">http://stocktwits.jobscore.com/jobs/stocktwits/bookkeeperacc...</a><p>StockTwits is hiring for three positions in our Coronado, CA office. We're a quickly-growing team that was recently named one of Fast Company's 10 most innovative companies in web: <a href=\"http://www.fastcompany.com/1738656/the-10-most-innovative-companies-in-web\" rel=\"nofollow\">http://www.fastcompany.com/1738656/the-10-most-innovative-co...</a>","time":1301675088,"type":"comment"},{"by":"martharotter","id":2396205,"parent":2396027,"text":"Nomad Editions - New York city area (remote may be an option for this role) <a href=\"http://readnomad.com\" rel=\"nofollow\">http://readnomad.com</a><p>Web Developer for Digital Magazine Startup<p>Nomad Editions, a startup creating digital weeklies for mobile devices, is looking for an awesome web-standards focused HTML/CSS/JS developer to help build our content on top of Treesaver (treesaver.net), one of the most exciting new open source frameworks for digital news and magazine publishing. The developer will be responsible for taking wireframes and translating them into standards-compliant web pages in Treesaver.<p>We're seeking: - Expertise in standards-based web development with HTML/CSS/JS - Ideal candidate would also have design skills - Interest in working with a very exciting company doing something no one else in the digital publishing industry is doing: making digital content look amazing everywhere<p>If you're interested or have questions, please e-mail Martha Rotter at mrotter@readnomad.com","time":1301666171,"type":"comment"},{"by":"dirtyaura","id":2397538,"parent":2396027,"text":"Helsinki, Finland - SUMMER INTERN - Developer or Graphic Designer<p>We are a small startup company creating real social games for the tablet-era. Games that bring people together. We see tablets as new kind of devices that are great for both online &#38; offline social gaming.<p>We are about to release Dust Up for Two - a tactical 2-player space battle for iPad <a href=\"http://huikea.com/dustup\" rel=\"nofollow\">http://huikea.com/dustup</a> . You'll be working with us on a game based on it. Think StarCraft that can be played both online and face-to-face in bars &#38; schools.<p>For internship position, we are looking for coders and graphic designers that are passionated about game design. Read more from <a href=\"http://huikea.com/jobs\" rel=\"nofollow\">http://huikea.com/jobs</a><p>We expect you to work from Helsinki during the summer. It's a great summer city with a lively game development scene. After the summer other arrangements are possible.<p><a href=\"http://huikea.com\" rel=\"nofollow\">http://huikea.com</a>","time":1301684586,"type":"comment"},{"by":"calbear81","id":2397011,"parent":2396027,"text":"Sunnyvale, CA - Software Engineers<p>Room 77 is building the world's first hotel room search engine.  We launched in February 2011 and won \"Best Overall\" startup at the LAUNCH conference and the Audience Choice award at Web 2.0 Expo so we've got a lot of great momentum.<p>We’re looking for superstar engineers to join our team in Sunnyvale, California — the heart of Silicon Valley.  We're well funded and have a roster of superstar investors and angels.<p>Who you are:<p>Superstar coder, self-motivated, focused, and interested in making a big impact as an early employee of a fast-paced startup<p>BS, MS or PhD in Computer Science or a related field<p>Passionate about travel<p>What you’ll do:<p>Build upon Room 77’s first public product with powerful new features<p>Design algorithms to enable the world's fastest and most feature-rich travel search engine (primarily with C++, Javascript, PHP and Python)<p>Revolutionize the way people travel<p>Send us your resume at jobs+engw[at]room77.com or find out more (including our puzzles) at <a href=\"http://www.room77.com/jobs.html\" rel=\"nofollow\">http://www.room77.com/jobs.html</a>","time":1301677337,"type":"comment"},{"by":"dboyd","id":2397226,"parent":2396027,"text":"San Francisco, CA - Ruby/Rails Engineer<p>We are an early-stage, angle-funded startup building the next generation online video marketplace.  We have several significant customers using and profiting from our application.  Founders have had several exits with big players (e.g., IAC and Viacom); we are looking to do it again.<p>We are hiring a Ruby/Rails Engineer.  If you are passionate, have strong opinions, and are not afraid to be critical then we would like to talk to you.<p>We have a small engineering team, and we offer plenty of opportunity to work anywhere in the stack.  Everything from jQuery plugins to cluster management tools will need work.  There are plenty of things to be done, and everything you do will have an immediate and significant impact.  You don't have to be a generalist, but the opportunity is there if you want it.<p>Company Site: <a href=\"http://www.realgravity.com/\" rel=\"nofollow\">http://www.realgravity.com/</a><p>Apply Here: workfor@realgravity.com","time":1301680389,"type":"comment"},{"by":"sifter3000","id":2397161,"parent":2396027,"text":"London, England\nDennis Publishing - Mobile (iOS, Android) developers<p>We're a publishing company building a first class internal team to help us create a range of apps for mobile phones and tablets. We'll be looking at taking our existing brands onto new devices in interesting and exciting ways, as well as launching mobile and tablet software based on completely new ideas.<p>Great central London location, brand new team and lots of opportunity for creative input :)<p>Details: <a href=\"http://www.dennis.co.uk/node/1741\" rel=\"nofollow\">http://www.dennis.co.uk/node/1741</a>, <a href=\"http://www.dennis.co.uk/working-at-dennis/vacancy/1745/ios-mobile-tablet-software-developer\" rel=\"nofollow\">http://www.dennis.co.uk/working-at-dennis/vacancy/1745/ios-m...</a>, <a href=\"http://www.dennis.co.uk/working-at-dennis/vacancy/1747/mobile-tablet-ux-specialist\" rel=\"nofollow\">http://www.dennis.co.uk/working-at-dennis/vacancy/1747/mobil...</a>","time":1301679471,"type":"comment"},{"by":"kreilly","id":2398019,"parent":2396027,"text":"Media6Degrees is looking for Java Engineers in NYC.<p><a href=\"http://media6degrees.com/2010/12/server-side-senior-java-developer/\" rel=\"nofollow\">http://media6degrees.com/2010/12/server-side-senior-java-dev...</a><p>The Server-Side Developer role requires in-depth experience with the following:<p><pre><code>    Server- side Java (5.0, 6 strongly preferred) including multi-threading, concurrency, etc.\n    Application Server or Servlet containers, Tomcat 5.5 or later strongly preferred\n    TDD, Unit, Integration and Functional testing.\n    Strong working knowledge of browsers and web technologies\n    Experience with IoC containers; Spring/Spring MVC strongly preferred\n    ORM; Hibernate strongly preferred\n    JUnit\n    Java Profiler, JProfiler perferred\n    SQL; MySQL 5.1 strongly preferred\n    Continuous Integration; Hudson strongly preferred\n    Maven 2\n    IDE, Eclipse strongly preferred\n    Subversion\n    Linux</code></pre>","time":1301691262,"type":"comment"},{"by":"snprbob86","id":2397009,"parent":2396027,"text":"Seattle<p>Thinkfuse.com<p>A bit about you:<p>- Full-stack developer who really gives a shit<p>- Preference for Rails &#38; Javascript<p>- You'd be employee #4, founding team<p>- Meaningful salary and equity<p>A bit about us:<p>- Big, cool, fun vision for the consumerization of the enterprise<p>- Quirky, clever plan of attack<p>- Two ex-Google/Microsoftdevelopers &#38; one ex-iLike biz/sales/design/manager/everything guy<p>- Funded by an A-team of angels<p>- Headquartered in the Founder's Co-op offices in SLU with nearly 20 other awesome startups<p>Email: brandon@thinkfuse.com","time":1301677325,"type":"comment"},{"by":"ig1","id":2396254,"parent":2396027,"text":"For UK'ers check out:<p><a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>(CoderStack is my company; we have lots of startups recruiting through us though)","time":1301666698,"type":"comment"},{"by":"GVRV","id":2396795,"parent":2396027,"text":"Melbourne, AUS - Generalist Web Dev code monkey [FULL TIME, NO REMOTE]<p>The small web development team within Infoxchange Australia (<a href=\"http://www.infoxchange.net.au/\" rel=\"nofollow\">http://www.infoxchange.net.au/</a>) is looking for a couple of developers. We work on a Debian/Apache/Perl/PHP/PostgreSQL stack on some fairly JS-heavy applications. The team is so small, that it is essentially a startup. You'll be a vital part of the team sure to making important contributions to all aspects of development. Please feel free to contact me if you want more information on the kind of work we do and the applications we develop. Graduates welcome to apply.<p>More information about the job: <a href=\"http://www.jobseeker.org.au/employment/results.chtml?filename_num=366552\" rel=\"nofollow\">http://www.jobseeker.org.au/employment/results.chtml?filenam...</a>","time":1301674351,"type":"comment"},{"by":"DLarsen","id":2396448,"parent":2396027,"text":"Los Angeles area, Ventura, CA (onsite)<p>Connexity - We are looking for a Sr. Software Engineer that ideally has experience developing production-quality code in Scala, and has 3-10 years of experience in the internet industry.   Experience with \"big data\" (Hadoop, HDFS, Hbase, Cassandra, etc.) will put your system at the top of the heap. More than anything, we're looking for a motivated software engineer who wants to learn on the job and have fun doing it.<p>You'll have the opportunity to help drive design decisions as part of our small, driven, entrepreneurial team.  Heaps of interesting work lies ahead of us with behavioral targeting, audience segmentation, and graph generation.<p>Read more at <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1479817\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1479817</a>","time":1301669660,"type":"comment"},{"by":"tariq","id":2396304,"parent":2396027,"text":"Toronto - Web Developer - <a href=\"http://www.kanetix.ca\" rel=\"nofollow\">http://www.kanetix.ca</a><p>Looking for a web developer to join our team who is interested in learning and wants to bring their skills and ideas to the table.<p>info: <a href=\"http://jobs.perl.org/job/13944\" rel=\"nofollow\">http://jobs.perl.org/job/13944</a>","time":1301667424,"type":"comment"},{"by":"maxaf","id":2396146,"parent":2396027,"text":"NYC (Midtown East) - Novus is building a real-time financial analytics platform in Scala. We're looking for functional programmers and other sharp generalists from all walks of life. We are a small product-focused team, move quickly, and take great pride in what we do.<p>E-mail is in my profile.","time":1301665382,"type":"comment"},{"by":"paulitex","id":2397445,"parent":2396027,"text":"Vancouver, BC, Canada - Summer Intern<p>Matygo - Delivering Education. Very young and close to profitable. Founding team looking for first outside help creating a platform to be used across the Province in Fall 2011.<p>If you want to get your hands dirty with some awesome tech (Sproutcore, Scala, iOS), live the startup life and have a real impact on our company and Province let us know.<p>This is a $2000 honorarium / unpaid internship. We know that sucks (we pay ourselves less than minimum wage), and will try to make it worth your effort in every other possible way including but not limited to extensive mentoring / training, referrals, lunches, total freedom over your work, etc...<p>Feel free to contact me directly with any questions: paul@matygo.com<p><a href=\"http://jobs.matygo.com/\" rel=\"nofollow\">http://jobs.matygo.com/</a>","time":1301683103,"type":"comment"},{"by":"liamstask","id":2396800,"parent":2396027,"text":"San Francisco, CA<p>Sifteo - <a href=\"http://sifteo.com\" rel=\"nofollow\">http://sifteo.com</a><p>We're looking for software generalists, but have immediate needs in the frontend realm: designing &#38; implementing the interaction experience with our software, both on the web and within a Qt/WebKit web panel in our desktop software.  This position sits right in the middle of our stack, interacting directly with the user, with the web backend, and with the interface to our hardware.<p>We've just shipped our first units, and need help building out our platform, creating an SDK, and making sure that our users have great experiences.  We're well funded, and have been getting lots of good press.<p>Software: JavaScript/Qt/C++/Python, Rails on the server<p>Drop me a line at liam at sifteo.com with any questions!","time":1301674416,"type":"comment"},{"by":"rbxbx","id":2396125,"kids":[2396148,2396199,2404575],"parent":2396027,"text":"Can't help but feel like this might be a bad day for this thread. You would think people could set aside the jokes in an obviously serious thread such as this one. Unfortunately, as evidenced by some of the submissions already, this seems not to be the case. Ugh.","time":1301665219,"type":"comment"},{"by":"jimkass","id":2396733,"parent":2396027,"text":"Culver City, CA - Contract PHP Engineer<p>We're a small team looking for someone to help us with a specific client project, but it could lead to more.<p>Our web-based digital asset management application uses a PHP backend and javascript front-end that behaves more like shrinkware than web application.<p>We're also expanding our knowledge base into other areas, such as Nodejs and NOSQL, and looking for engineers not just coders.<p>Bottom Line: We want engineers with strong PHP5/Ajax background and a solid grasp on building great web applications.  Read: A team player that can just all round BRING IT!<p>Company Site: <a href=\"http://5thkind.com\" rel=\"nofollow\">http://5thkind.com</a><p>Job post/application here: <a href=\"http://bit.ly/hB4G8h\" rel=\"nofollow\">http://bit.ly/hB4G8h</a><p>p.s. Excellent Foosball skills recommended","time":1301673388,"type":"comment"},{"by":"elliottcarlson","id":2396963,"parent":2396027,"text":"New York, NY - No remote possible, sorry<p>CellDivision is an established MedEd agency. We are 50 people strong, have an easy going culture and interesting projects going on. To get more information about us as a company, please visit <a href=\"http://www.celldivision.com\" rel=\"nofollow\">http://www.celldivision.com</a><p>Technologies we currently leverage:<p>PHP, Perl, Node.JS, haXe, JavaScript, jQuery, NSIS, MySQL, MongoDB, Nginx, Varnish, RabbitMQ, HTML5 Canvas, Mobile Development (iPhone, iPad, Android).<p>We are looking for experienced and enthusiastic developers who can come up with the best way to get something done (whether using our current technology stack or being able to propose why other technologies might be the best fit).<p>Email: carlson at the domain name above.","time":1301676757,"type":"comment"},{"by":"ktraub","id":2396486,"parent":2396027,"text":"Annapolis, MD\nMany Software and Systems Engineering Jobs - Junior thru Sr.\n<a href=\"http://www.arinc.com\" rel=\"nofollow\">http://www.arinc.com</a>\n<a href=\"http://www.arinc.com/careers/index.html\" rel=\"nofollow\">http://www.arinc.com/careers/index.html</a>","time":1301670285,"type":"comment"},{"by":"joshu","id":2397533,"parent":2396027,"text":"Tasty Labs is hiring frontend and backend engineers in Sillicon Valley. We use Python and Java. We are building a way to help people use their social networks to get things done.\n<a href=\"http://tastylabs.com/\" rel=\"nofollow\">http://tastylabs.com/</a>","time":1301684512,"type":"comment"},{"by":"sergei","id":2398661,"parent":2396027,"text":"San Francisco, CA\nClustrix: Systems Developers<p>Clustrix has developed a highly scalable distributed database system from the ground up. We are looking for skilled systems developers to help us with the next generation of Clustrix Database.<p>As a candidate, you should be an experienced C developer and proficient in concurrent and asynchronous system principles.<p>Additionally, experience in any of the following areas is highly preferred. It's a sample of the kinds of problems Clustrix developers are faced with on a daily basis:<p>* Compiler design and implementation\n* Distributed query planning and optimization\n* Distributed concurrency control mechanisms\n* Fault tolerance in distributed systems\n* Distributed transaction management<p>jobs@clustrix.com","time":1301703138,"type":"comment"},{"by":"genemiguel","id":2397731,"parent":2396027,"text":"San Francisco, CA - ENGINEERING<p>Twilio, the web-service API that allows developers to build powerful voice and SMS apps, is hiring aggressively for multiple engineering and non-engineering positions.<p>DevOps Engineer\nLead Software Engineer\nSenior Software Engineer\nSoftware Engineer\nTechnical Customer Advocate\nMobile Developer\nPHP Open Source Developer\nTechnical Customer Advocate\nStartup Talent Manager (Recruiting)\nDeveloper Evangelist\nDirector of Online Marketing\nProduct Manager<p>Why work at Twilio? \n<a href=\"http://www.twilio.com/company/jobs\" rel=\"nofollow\">http://www.twilio.com/company/jobs</a><p>Job listings with descriptions\n<a href=\"http://twilio.jobscore.com/list\" rel=\"nofollow\">http://twilio.jobscore.com/list</a>","time":1301687380,"type":"comment"},{"by":"__mharrison__","id":2396723,"parent":2396027,"text":"Bay Area/SLC, Ut - INTERN, FULLTIME<p>Fusion-IO - Tools Engineer<p>We are growing fast and shipping lots o product.  Python is used all over the place where lower level languages aren't necessary.<p>Tools: Python/Django/JQuery/Postgres/Couchdb/emacs|vim/etc<p>Email: mharrison at fusionio.com (job isn't posted on website)","time":1301673263,"type":"comment"},{"by":"meghan","id":2396402,"parent":2396027,"text":"New York City, San Francisco Bay Area, and Europe<p>10gen, the creators of MongoDB: We are always looking for smart people to join the team. You get paid to work on open source software!<p><a href=\"http://www.10gen.com/jobs\" rel=\"nofollow\">http://www.10gen.com/jobs</a>","time":1301668917,"type":"comment"},{"by":"dawkins","id":2396605,"parent":2396027,"text":"Madrid, Spain<p>C# developer.<p>We help sport clubs with our web based product. You would help us improve it and build features.<p>The position is for our office in Alcobendas but you could do some remote if you want.<p>Right now we are using Git, VS, Windows to develop and apache and linux on the server.","time":1301671801,"type":"comment"},{"by":"dominostars","id":2396747,"parent":2396027,"text":"San Francisco, CA - Rails developer (also Android developer, Product Manager)<p>MedHelp is the largest online health community, with 12 million uniques and growing. We're profitable without having to take VC money, and we're growing without having to pay for traffic.<p>Your general intelligence, work ethic, and personality matter much more than your rails experience. However, the more rails experience the better.<p>Website: <a href=\"http://www.medhelp.org\" rel=\"nofollow\">http://www.medhelp.org</a>\nEmail: Opportunities@medhelp.org\nJob description: <a href=\"http://www.medhelp.org/Jobs/index.htm\" rel=\"nofollow\">http://www.medhelp.org/Jobs/index.htm</a>","time":1301673569,"type":"comment"},{"by":"slloyd_sb","id":2397064,"parent":2396027,"text":"San Francisco, CA<p>Songbird is hiring full time developers for Android, desktop (C++), web services, and build/release. We're also looking for a good technical product manager.<p>Open positions are at <a href=\"http://getsongbird.com/jobs/\" rel=\"nofollow\">http://getsongbird.com/jobs/</a>, and feel free to contact me directly via the email in my profile with any questions.<p>We're currently shipping media players on Windows, Mac, and Android, and we're looking for people who want to help build out a seamless media experience across platforms and devices.<p>The positions are in SF, but we'll definitely figure out how to help get you here if you're looking to relocate.","time":1301677978,"type":"comment"},{"by":"cubes","id":2397216,"parent":2396027,"text":"Eventbrite is hiring in San Francisco.  It's a fun place to work, and we've got lots of openings:\n<a href=\"http://www.eventbrite.com/jobs/\" rel=\"nofollow\">http://www.eventbrite.com/jobs/</a><p>Email cubes@eventbrite.com if you're curious.","time":1301680215,"type":"comment"},{"by":"purzelrakete","id":2396744,"parent":2396027,"text":"Berlin, Germany &#38; San Francisco, California<p>SoundCloud - <a href=\"http://soundcloud.com/jobs\" rel=\"nofollow\">http://soundcloud.com/jobs</a><p>SoundCloud is hiring! Back-end Developers, Front-End Developers, API Developers, VP Eng, Developer Evangelist, Partner Integration Manager, Systems Administrator, and Music Information Retrieval Developer.<p>Founded in late 2007, SoundCloud is an international start-up headquartered in Berlin with smaller satellite offices in London and San Francisco. With the 50+ people onboard, we’ve got 11+ nationalities covered and a range of interests so diverse that you’ll fit in all over the place!","time":1301673539,"type":"comment"},{"by":"pjboudrx","id":2398791,"parent":2396027,"text":"Atlanta, GA. USA - .NET craftsman/woman <a href=\"http://www.opv.com/pio/jobDetails.jsp?site=daxko&#38;jobId=a004000000LnLF8\" rel=\"nofollow\">http://www.opv.com/pio/jobDetails.jsp?site=daxko&#38;jobId=a...</a><p>I'm a dev team lead looking for an agile .NET craftsman/woman to join my elite product team!<p>We collaborate, are learning to be more agile, and work do deliver value to our customers and rewarding careers to our team members! Come join me and my small team in Dunwoody as we make great software.<p>Learn more about the fun, fine folks at Daxko at <a href=\"http://daxkonation.com\" rel=\"nofollow\">http://daxkonation.com</a>","time":1301706717,"type":"comment"},{"by":"wooter","id":2397218,"parent":2396027,"text":"Palo Alto, CA - Criteo (www.criteo.com)\nThe R&#38;D team at Criteo is building the next generation of digital advertising technologies that power billions of ad impressions every month. We are looking for great developers who are passionate about engineering challenges!<p>Currently looking to fill R&#38;D positions:<p>- C#, Java or C++, SQL, HTML, CSS, XML<p>- Must be hard working, team oriented, bright, creative, cooperative, and an exceptional problem solver<p>- Extraordinary analytical skills<p>- Solid understanding and working knowledge of relational databases a plus<p><a href=\"http://www.criteo.com/us/about/careers\" rel=\"nofollow\">http://www.criteo.com/us/about/careers</a>","time":1301680262,"type":"comment"},{"by":"tdonia","id":2396608,"parent":2396027,"text":"Brooklyn, NY (local/salaried) - PHP Developer - Main Street Connect<p>We're a well-funded startup with ambitious plans for local news looking for a problem solver to join our Creative Technology team in DUMBO.  We use Drupal but are more interested in someone smart &#38; adaptable than specific Drupal-domain expertise.  The rest of the Brooklyn team includes a UX Lead, our Creative Director, Product Infrastructure &#38; Ad Operations + a small army of freelancers.  You'll find most of the team lurking about HN.<p>Recommend a book/tell us about a cool project: creative_technology@mainstreetconnect.us","time":1301671834,"type":"comment"},{"by":"ianterrell","id":2396643,"parent":2396027,"text":"San Francisco - Samasource is hiring developers and designer<p>Samasource is a distributed work system similar to Mechanical Turk, but aimed at eradicating global poverty by providing work to the people on the lowest rungs of the economic ladder; those who lost \"the birth lottery.\"  See the TEDx talk our founder gave:  <a href=\"http://vimeo.com/9305118\" rel=\"nofollow\">http://vimeo.com/9305118</a>.<p>We're hiring Rails developers and a designer, and we'll relocate promising candidates to the Bay Area!<p><a href=\"http://www.samasource.org/about/samacareers\" rel=\"nofollow\">http://www.samasource.org/about/samacareers</a>","time":1301672382,"type":"comment"},{"by":"jplewicke","id":2396669,"parent":2396027,"text":"Boston, MA (seeking interns, not remote)<p>MDT Advisers - We're a small quant investing shop working with machine learning, financial analysis, and the hardest dataset in the world. We're mainly hiring for a general analyst position that’s about 60% programming and 40% financial and statistical analysis -- <a href=\"http://www.mdtadvisers.com/careers/qea.jsp\" rel=\"nofollow\">http://www.mdtadvisers.com/careers/qea.jsp</a> . The people, problems, and pay are good, and we aim for good work-life balance(e.g. no 60 hour weeks).<p>You can email me at jlewicke@mdtadvisers.com with any questions you have.","time":1301672675,"type":"comment"},{"by":"AyanK","id":2396418,"parent":2396027,"text":"Pittsburgh, PA<p>Careerimp - We are a young company that develops neat web apps to make applying to jobs easier and to provide insights into the outcome of one's job application as they apply.<p>We code in Ruby on Rails and jQuery. We are looking for a prolific full-time web app developer/engineer or a senior engineer/developer to take us through the next phases of product conceptualization and development, and help us scale. We are are also looking for a summer INTERN for a similar role.<p>More info: <a href=\"http://jobs.rubynow.com/jobs/show/5226\" rel=\"nofollow\">http://jobs.rubynow.com/jobs/show/5226</a>","time":1301669109,"type":"comment"},{"by":"sequoia","id":2396264,"parent":2396027,"text":"NY, NY\n<a href=\"http://www.democracynow.org/about/jobs\" rel=\"nofollow\">http://www.democracynow.org/about/jobs</a> Democracy Now is looking for a contract Ruby developer, if you're into that sort of thing.","time":1301666820,"type":"comment"},{"by":"philfreo","id":2399138,"parent":2396027,"text":"SAN FRANCISCO, CA - (on-site only, we can help relocate)<p>Quizlet (<a href=\"http://quizlet.com/\" rel=\"nofollow\">http://quizlet.com/</a>) - creating a better way to study, over 1 million users, great JavaScript games, voice recognition, text-to-speech audio<p>Check out jobs page for real-time stream of what people are studying: <a href=\"http://quizlet.com/jobs/\" rel=\"nofollow\">http://quizlet.com/jobs/</a><p>Looking for: great back-end (PHP5, Memcached, MySQL, etc.) and front-end (JavaScript/Ajax) developers who want to work on products to help making studying better for 3 million people/month.","time":1301718137,"type":"comment"},{"by":"essrand","id":2397071,"parent":2396027,"text":"I am a data mining engineer at polyvore and we are looking for frontend/backend/generalist/data mining engineers.<p>Below is our official pitch :), I am regular lurker here at HN, you can email me at bhaskar@polyvore.com if you want to know more, or just apply to the jobs link below.<p>Cheers!<p>Polyvore is looking for stellar software engineers to join our team.  If you're at all interested, I'd love to grab coffee or have you stop by our office to meet the team.<p>A little background on the company -- Polyvore is a social shopping platform. Our user community curates and merchandises products from all over the web in the form of digital collages that we call \"sets\". We have about 6.5M unique visitors per month, which makes us one of the largest fashion sites on the web. Our eventual goal is to expand to other product categories.<p>We're a team of 18 people, including a lot of folks from Google and Yahoo.  Our founders are all engineers or have computer science backgrounds, so we're very technical and eng/product-driven.  You can see the profiles of our team members here.  It's also a really fun working environment.  Our Happy Hours activities range from board games to taco trucks to book club (with beer and other equally attractive drinks!).<p>Polyvore has a lot of interesting product challenges and neat technology under the hood.  For example:<p>The Editor -- Our virtual styling tool features pretty nifty JavaScript.<p>Style Analytics -- Our users interact with tons of products on a daily basis (50K clips/day, 35K sets/day), which makes for really interesting data mining opportunities.<p>Monetization -- Think of Polyvore sets as user-generated ads.  There are lots of resonant monetization opportunities.<p>We've also been getting great buzz lately:<p>Polyvore Goes Sky High with Times Square Billboard (about our billboard in Times Square, which we got for free)<p>Fast Company - An Army of Anna Wintours (about our recent partnerships from Fashion Week)<p>TheNextWeb - The Rise of Polyvore: Trendsetting Goes Social (testimonials from our advertisers)<p>The New Yorker - Fashion Democracy (an older article that focuses on our awesome user community)","time":1301678097,"type":"comment"},{"by":"healsdata","id":2396342,"parent":2396027,"text":"King of Prussia (near Philly), PA<p>ReminderMedia is looking to expand our software development team with two entry-level positions. We've recently started adding a ton more JavaScript functionality to our customer interface and are making heavy use of jQuery &#38; JsTestDriver. Additionally, PHP object-oriented work continues as we revisit systems, add tests and make improvements to our custom CRM.<p><a href=\"http://remindermedia.com/careers/search/state/PA\" rel=\"nofollow\">http://remindermedia.com/careers/search/state/PA</a> or email me at jcampbell@remindermedia.com","time":1301667869,"type":"comment"},{"by":"tmarthal","id":2398411,"parent":2396027,"text":"Los Angeles, CA in the Downtown Culver City area.<p>We are looking for an on-site back and/or front end software developer with experience in Java/Groovy, javascript, AWS, mysql&#38;|nosql which isn't afraid of numerical analysis or statistical modeling. We are working on a web analytics optimization platform in an early stage startup. The esoteric job descriptions are listed here: <a href=\"http://www.jumptime.com/jobs\" rel=\"nofollow\">http://www.jumptime.com/jobs</a><p>You can shoot me an email at tom@jump-time.com if it sounds like something you'd be interested in.","time":1301697588,"type":"comment"},{"by":"oh_no_my_eyes","id":2398263,"parent":2396027,"text":"Percolate is hiring. We're an NYC-based startup looking for specialists in Python (Django experience a plus). Our needs include:<p>Interests in scalable web technologies (MapReduce, DB Clustering, Asynchronous Processing, Awesome Search/IR).<p>We are very young and have a prototype site and api (both of which are down for site maintenance atm).<p>Right now the team includes an engineer, a front-end developer, and a mathematician. We feel very strongly about the quality of our product and are excited to bring on smart people who love to build out the web in new ways.<p>will aaaaat percolate derp org","time":1301695157,"type":"comment"},{"by":"ScotterC","id":2396639,"parent":2396027,"text":"New York, NY - \nRuby on Rails back end\nand \nFront end Dev<p>Artsicle is a small team looking to democratize the Fine-Art world.  We're doing this by cutting out the gallery system and allowing customers to rent directly from the artists.  A 'try before you buy' system that allows a greater amount of customers access to a greater amount of art at a more accessible point in the artist's career.<p>interns welcome<p>email scott at artsicle.com if you're interested<p>Post:\n<a href=\"http://blog.artsicle.com/post/4092584802/interns\" rel=\"nofollow\">http://blog.artsicle.com/post/4092584802/interns</a>","time":1301672332,"type":"comment"},{"by":"mkull","id":2396496,"parent":2396027,"text":"Philadelphia, PA - Senior Software Engineer<p>RevZilla.com - <a href=\"http://www.revzilla.com/senior-software-engineer\" rel=\"nofollow\">http://www.revzilla.com/senior-software-engineer</a><p>We are currently looking for a talented developer with Ruby / Rails experience to help with the roll-out of eCommerce related functionality for RevZilla.com<p>RevZilla.com is 4 years old.  It was bootstrapped and profitable with 90 days.  Founded by software developers, we lead with technology &#38; customer experience.  We strive to be the Zappos of the powersports (26 bn) market.","time":1301670362,"type":"comment"},{"by":"dj_axl","id":2398421,"kids":[2398528],"parent":2396027,"text":"Cornerstone OnDemand, which IPO'ed last month. Located in Santa Monica, CA (Los Angeles area). Hiring for ASP.NET / C# / SQL developers. Specifically, Web Software Engineer (.Net/SQL), Software Engineer (WCF/.Net), Senior SQL Database Engineer (SQL Server 2008).<p><a href=\"http://www.cornerstoneondemand.com/careers\" rel=\"nofollow\">http://www.cornerstoneondemand.com/careers</a><p><a href=\"http://www.glassdoor.com/Reviews/Cornerstone-OnDemand-Reviews-E35131.htm\" rel=\"nofollow\">http://www.glassdoor.com/Reviews/Cornerstone-OnDemand-Review...</a>","time":1301697792,"type":"comment"},{"by":"douglasjsellers","id":2397480,"parent":2396027,"text":"Los Angeles (remote/H1B for the right fit) - Ruby on Rails Developers<p>Tired of just not doing evil and actually want to do GOOD?  If so, check out @good worldwide (www.good.is).  GOOD is a small startup in West Hollywood focused on building tools and relationships for people looking to push the world forward.  We are currently looking for some super talented junior and senior software engineers to help us build out a a next generation social entrepreneurial-ship platform.<p>Interested?  Email me at doug &#60;at&#62; goodinc.com","time":1301683591,"type":"comment"},{"by":"usaar333","id":2397597,"parent":2396027,"text":"PiCloud (San Francisco, CA) is hiring software engineers to develop its cloud computing platform.<p>Quick description:\nWe allow developers, scientists, and engineers to leverage the power of the cloud with only a few lines of code.  We do this by abstracting away individual servers, in favor of a simple language-integrated API.<p>We do extensive amounts of systems work, from scheduling algorithms to user sandboxing to bytecode introspection.<p>Apply @: <a href=\"http://www.picloud.com/jobs/\" rel=\"nofollow\">http://www.picloud.com/jobs/</a>","time":1301685452,"type":"comment"},{"by":"ganjianwei","id":2397558,"parent":2396027,"text":"Burlingame, CA (between San Francisco and Palo Alto)<p>TellApart, Inc. is hiring Software Engineers and Machine Learning Engineers among other positions.<p>We're a startup founded by ex-Googlers building a next generation eCommerce customer data platform. If you're interested in big data, distributed systems and machine learning, check us out at <a href=\"http://tellapart.com/who_we_are/\" rel=\"nofollow\">http://tellapart.com/who_we_are/</a><p>Jobs page: <a href=\"http://tellapart.com/jobs/\" rel=\"nofollow\">http://tellapart.com/jobs/</a>","time":1301684901,"type":"comment"},{"by":"thinkcomp","id":2396668,"parent":2396027,"text":"Palo Alto, CA - Think Computer Corporation<p>Intern<p>We're looking for interns with coding skills to help us grow FaceCash (<a href=\"http://www.facecash.com\" rel=\"nofollow\">http://www.facecash.com</a>)<p>E-mail jobs at thinkcomputer.com","time":1301672665,"type":"comment"},{"by":"ctb9","id":2397743,"parent":2396027,"text":"San Francisco, CA - seeking INTERNS, possibly REMOTE<p>equipster.com - we're creating the ultimate shopping engine for outdoor gear.<p>If you're into the outdoors and want to have a huge impact at brand new startup, check us out. We're looking for ambitious hackers willing to take the lead on projects that interest them. Opportunities all over in the stack + mobile.<p>frontend: knockout.js + html5\nbackend: php and python, mySQL (mongoDB soon), solr, htmlunit<p><a href=\"http://www.equipster.com/jobs\" rel=\"nofollow\">http://www.equipster.com/jobs</a>","time":1301687633,"type":"comment"},{"by":"bramcohen","id":2396571,"parent":2396027,"text":"San Francisco, CA - BitTorrent is hiring for a bunch of positions <a href=\"http://www.bittorrent.com/company/jobs\" rel=\"nofollow\">http://www.bittorrent.com/company/jobs</a>","time":1301671373,"type":"comment"},{"by":"cal5k","id":2396377,"parent":2396027,"text":"Toronto, ON - Web / mobile developers<p>PHP, Python, iOS, or Android experience a plus, but we're more interested in hiring awesome engineers/computer scientists and providing training in relevant skills.<p>Work with great clients like The Royal Conservatory and Carnegie Hall, and jump in on a new product we're developing for the educational market. We build web and mobile products for companies, non-profits, and governments.<p><a href=\"http://www.myplanetdigital.com\" rel=\"nofollow\">http://www.myplanetdigital.com</a>","time":1301668555,"type":"comment"},{"by":"simonsez","id":2397470,"parent":2396027,"text":"San Francisco<p>The Usual (<a href=\"http://usual.com/\" rel=\"nofollow\">http://usual.com/</a>) is hiring generalist engineers to work on our back-end (python/django/rabbit/possibly socket.io) application as well as client applications (android, iOS) for mobile/online restaurant ordering. We're looking for smart people who'd like to tackle a variety of problems.<p>We're early stage, in a big space (online restaurant ordering), and have an experienced team. We'd love for you to be a part of it.<p>simon at usual dot com.","time":1301683460,"type":"comment"},{"by":"unwiredben","id":2396706,"parent":2396027,"text":"Sunnyvale &#38; San Francisco, CA<p>HP's Palm GBU is responsible for the development of HP webOS, our premiere mobile operating system for phones, tablets, and more.  It's based on WebKit, JavaScript, and node.js technologies, along with lots of embedded Linux under the hood.  We're currently hiring over 100 positions from junior engineers to senior level specialists.<p>See <a href=\"http://www.palm.com/us/company/careers.html\" rel=\"nofollow\">http://www.palm.com/us/company/careers.html</a>","time":1301673099,"type":"comment"},{"by":"elektrolyte79","id":2397178,"parent":2396027,"text":"San Francisco, CA\nUX LEAD:: Razorfish\n<a href=\"https://jobs-razorfish.icims.com/jobs/8829/job\" rel=\"nofollow\">https://jobs-razorfish.icims.com/jobs/8829/job</a><p>FRONT END WEB DEVELOPER :: Razorfish\n<a href=\"https://jobs-razorfish.icims.com/jobs/8459/job\" rel=\"nofollow\">https://jobs-razorfish.icims.com/jobs/8459/job</a><p>SENIOR FRONT END WEB DEVELOPER :: Razorfish\n<a href=\"https://jobs-razorfish.icims.com/jobs/8516/job\" rel=\"nofollow\">https://jobs-razorfish.icims.com/jobs/8516/job</a>","time":1301679719,"type":"comment"},{"by":"robbowley","id":2405858,"parent":2396027,"text":"7digital (London UK) is hiring developers<p><a href=\"http://about.7digital.net/Careers/DevelopmentTeam/Developer\" rel=\"nofollow\">http://about.7digital.net/Careers/DevelopmentTeam/Developer</a><p>Company:\n7digital is a leading digital B2B media delivery company based in London and operating globally.  We provide Cloud-based services, MP3 music, ebooks and video services to a wide and diverse range of partners around the world.<p>Stack:\nC#, Ruby, JavaScript, ASP.Net MVC, NHibernate, Windsor, StructureMap, OpenRasta, NUnit, RhinoMocks, ReSharper, NDepend, Cucumber, RSpec, Rake, Selenium, Watir,         Git, Subversion, SQL, Solr/Lucene, MogileFS<p>Team:\nYou’ll be joining a team of extremely enthusiastic developers who enjoy what we do. Among other things, Pair Programming, TDD/BDD, Refactoring, and Continuous Delivery are deeply embedded and we’re constantly striving to improve the way we work. We know typing is not the bottleneck, so among other things:<p>* Have around two sessions a week spending time doing things like Katas, Dojos and discussing practices and technologies.<p>* Each get up to two days “innovation time” a month we can use to play with new toys or product ideas.<p>* Attend conferences and community events, both as participants and contributors (we’ve even shown off our processes at events like XPDay 2009 where we got some great feedback).<p>* Regularly retrospect (as teams and the department) on how we can improve the way we work.<p><a href=\"http://about.7digital.net/Careers/DevelopmentTeam/Developer\" rel=\"nofollow\">http://about.7digital.net/Careers/DevelopmentTeam/Developer</a>","time":1301906814,"type":"comment"},{"by":"jackfoxy","id":2396452,"parent":2396027,"text":"Concord, CA\nClient side developer\n<a href=\"http://sfbay.craigslist.org/eby/sof/2286624649.html\" rel=\"nofollow\">http://sfbay.craigslist.org/eby/sof/2286624649.html</a>","time":1301669766,"type":"comment"},{"by":"btilly","id":2397315,"parent":2396027,"text":"Netflix is hiring.  Mostly in Los Gatos, but there are jobs elsewhere as well.  See <a href=\"http://www.netflix.com/Jobs?id=7563\" rel=\"nofollow\">http://www.netflix.com/Jobs?id=7563</a> for a full list of jobs.  (They reached out to me for <a href=\"http://www.netflix.com/Jobs?id=7563&#38;jvi=o4dyVfwu\" rel=\"nofollow\">http://www.netflix.com/Jobs?id=7563&#38;jvi=o4dyVfwu</a> which I could not consider for geographic reasons.)","time":1301681426,"type":"comment"},{"by":"phillytom","id":2396344,"kids":[2397431,2399974],"parent":2396027,"text":"Conshohocken, PA - Monetate<p>We're a SaaS provider of testing, targeting, and personalization tools to internet marketers.  We're currently hiring Javascript engineers for front-end development and backend engineers (we use Python) - and we have fun web and data problems at scale.<p>We're having fun and growing fast.<p>3 people on our team have found us through here and we always look forward to talking to more fellow HNers.<p>Feel free to email me any questions - tjanofsky monetate com","time":1301668072,"type":"comment"},{"by":"junkafarian","id":2396559,"parent":2396027,"text":"London, UK<p>Client Side Developer - <a href=\"http://largeblue.com\" rel=\"nofollow\">http://largeblue.com</a> - <a href=\"http://jobs.github.com/positions/49cd8d1c-4f22-11e0-8fdf-1a9b9f7c0f30\" rel=\"nofollow\">http://jobs.github.com/positions/49cd8d1c-4f22-11e0-8fdf-1a9...</a><p>We're looking for a talented Client side developer with experience in working on exciting web projects using cutting edge tools.<p>Please use the contact details listed on the Github posting","time":1301671192,"type":"comment"},{"by":"cadr","id":2397134,"parent":2396027,"text":"San Francisco, CA - Blurb<p>Blurb lets people tell their stories - currently through print-on-demand books, but increasingly through other venues.<p>We are both established and growing like mad (we were #47 on last year's Inc 500).  We have a great group of people and a lot of fun challenges in the year ahead.<p>We are currently hiring for many positions - front end, Rails, iPhone, and more.<p><a href=\"http://www.blurb.com/join_us\" rel=\"nofollow\">http://www.blurb.com/join_us</a>","time":1301678939,"type":"comment"},{"by":"junkafarian","id":2396489,"parent":2396027,"text":"London, UK<p>Python Developer - <a href=\"http://largeblue.com\" rel=\"nofollow\">http://largeblue.com</a> - <a href=\"http://www.python.org/community/jobs/#large-blue-covent-garden-london-uk\" rel=\"nofollow\">http://www.python.org/community/jobs/#large-blue-covent-gard...</a><p>We're looking for a talented Python developer with experience in working on exciting web projects using cutting edge tools.<p>Please use the contact details listed on the Python Job Board","time":1301670296,"type":"comment"},{"by":"aurumaeus","id":2396237,"parent":2396027,"text":"NYC - Java/Android\nNYC - Obj-C/iOS\nNYC - Python/MongoDB\nNYC - Python/JavaScript/HTML<p><a href=\"http://www.GameChanger.io\" rel=\"nofollow\">http://www.GameChanger.io</a>","time":1301666481,"type":"comment"},{"by":"shafqat","id":2398455,"parent":2396027,"text":"NewsCred is hiring in New York City.<p>Lots of positions, but our main focus is to find engineers who are passionate about information retrieval and big data. So any interest or experience in Solr, Lucene, NLP, Machine Learning, etc would be a great fit for the types of problems we're working on.<p>And we have unlimited vacations!<p>Full listing at <a href=\"http://platform.newscred.com/jobs\" rel=\"nofollow\">http://platform.newscred.com/jobs</a>","time":1301698627,"type":"comment"},{"by":"everytrail","id":2398208,"parent":2396027,"text":"Palo Alto, CA<p>EveryTrail, part of the TripAdvisor Media Group / Expedia, is looking for world-class engineering talent to help bring our mobile apps to the next level. If you are passionate about travel and technology, and you want to play an important role creating the next-generation travel apps, we’d love to hear from you!<p>EveryTrail, based in downtown Palo Alto, was recently acquired by TripAdvisor. With over 40 MM users / month TripAdvisor is the world’s largest travel site. TripAdvisor is part of Expedia, the word’s largest travel company.<p>This situation creates very compelling career opportunities for talented engineers, product managers and designers:<p>* Fast paced start-up environment in Silicon Valley, but with the backing of Expedia, a well-known public company and a huge, global audience of TripAdvisor’s 40 MM users.<p>* Be part of a team whose goal it is to build the very best mobile travel apps. We have a proven track record creating great consumer experiences, but we are still only at the beginning.<p>* Very competitive compensation.<p>We are currently hiring 3 full time developers:<p>- Web: back-end, front-end (PHP, MySQL, CSS, Javascript)<p>- iOS<p>- Android<p>Please send your resume to jobs@globalmotion.com","time":1301694108,"type":"comment"},{"by":"gsiener","id":2396842,"parent":2396027,"text":"New York City, NY<p>Front End engineer @ Profitably<p>We just raised $1.1M, and we are looking to hire our 6th person. Our 3rd co-founder was UX &#38; Visual Design. We couldn't take design more seriously, and we've got cash and equity for you if you're the one.<p>Profitably is business analytics, simplified. More at Profitably.com<p>More on the job at: <a href=\"http://jobs.37signals.com/jobs/8551\" rel=\"nofollow\">http://jobs.37signals.com/jobs/8551</a>","time":1301675004,"type":"comment"},{"by":"bmj","id":2396435,"parent":2396027,"text":"Pittsburgh PA: invivodata<p><a href=\"http://www.invivodata.com/aboutus/careers/product-development-software-developer/\" rel=\"nofollow\">http://www.invivodata.com/aboutus/careers/product-developmen...</a><p>The Products group is small (just three devs in PGH, plus four in Santa Cruz), and we do a mix of web and device/mobile work.  We are mostly a .NET/C# shop, but my current project is heavy on the Javascript.","time":1301669407,"type":"comment"},{"by":"nphase","id":2396524,"parent":2396027,"text":"Chicago, IL<p>Tap Me, Inc. - <a href=\"http://tap.me\" rel=\"nofollow\">http://tap.me</a><p>We are hiring full time web developers, devops, Flash+HTML5 specialists, designers, and potentially other lots-of-hats people. If you're talented, we'd like to talk to you.<p>Tap Me is a funded startup focused on building next gen in-game advertising. We've got a fun and energetic workplace, and we love to think big.<p>You can contact me directly at ws@tap.me","time":1301670728,"type":"comment"},{"deleted":true,"id":2396985,"parent":2396027,"time":1301676979,"type":"comment"},{"by":"bdittmer","id":2396525,"parent":2396027,"text":"San Francisco, CA\nWiseview Research (<a href=\"http://www.wise-view.com\" rel=\"nofollow\">http://www.wise-view.com</a>)<p>We are currently looking for an experienced rails developer and a designer with mobile experience.  We are funded and provide full health benefits.  Currently we are working out of Rocketspace, a pretty cool environment to be in. brian@wise-view.com","time":1301670730,"type":"comment"},{"by":"vgurgov","id":2397881,"parent":2396027,"text":"SEEKING FREELANCERS/INTERNS<p>For videolla.com- we are making serious $$$ on video<p>1) web UI/Designer contract. Rails experience preferred. For redesign of our fast growing startup videolla.com<p>2) Marketing PR hacker intern/freelancer. You will make us famous!<p>If you feel you are 1)+2) you should also apply. Bay Area preferred. Remote is possible for exceptional candidates!<p>If you are interested - you will find a way to get in touch.","time":1301689486,"type":"comment"},{"by":"vanhiker","id":2397299,"parent":2396027,"text":"Vancouver, BC - Front End Web Developer<p>Fulltime and Interns/Co-ops<p><a href=\"http://silkstart.com\" rel=\"nofollow\">http://silkstart.com</a><p>SilkStart is a web-based membership management and social network software product for organizations.  We're looking for front end developers with experience in html/css/jquery. The product is built using pylons and mongodb so python experience is a plus.<p>jobs@silkstart.com","time":1301681257,"type":"comment"},{"by":"cristinacordova","id":2397381,"parent":2396027,"text":"Pulse is hiring for our Palo Alto, CA office. We're looking for full-time in-office iOS and Android engineers as well as interns and part-time folks. We make a news reading app for iPhone, iPad and Android devices. Check out our jobs page here: <a href=\"http://www.alphonsolabs.com/jobs\" rel=\"nofollow\">http://www.alphonsolabs.com/jobs</a>","time":1301682126,"type":"comment"},{"by":"agranig","id":2396331,"kids":[2397513],"parent":2396027,"text":"@Sipwise in Vienna/Austria<p>- Web developer: Perl/Catalyst/MySQL and HTML/CSS/JS<p>- VoIP engineer: OpenSER/Kamailio/OpenSIPS and &#62;3 years of experience in SIP routing<p>- System engineer: HA/Scalability/Mass-Deployment using Corosync, Pacemaker, Git, Perl<p>We develop and integrate carrier-grade VoIP systems for 100k-1Mio end users each at major European ISPs. Send an email to agranig at sipwise dot com.","time":1301667747,"type":"comment"},{"by":"aschobel","id":2397511,"parent":2396027,"text":"Catch.com San Francisco - FT, Intern, Remote<p>We are looking for hackers to join our team in SOMA. We have a bunch of ex-Metaweb and Googlers hacking on:<p><pre><code>  * Android / iOS\n  * JS (Google Closure)\n  * Python (Pylons)and MongoDB.\n</code></pre>\nWe have a crazy amount of users on Android. =)<p>Email me hn@catch.com or <a href=\"http://catch.com/jobs\" rel=\"nofollow\">http://catch.com/jobs</a><p>Danke!","time":1301684022,"type":"comment"},{"by":"billpaetzke","id":2396268,"parent":2396027,"text":"El Segundo, CA - C# Developer<p>Full-stack web developer position in a small, growing startup: Leads360. The main product is a web app for salespeople to manage their leads. There's a lot of interesting technical challenges involved to make our product cutting-edge.<p>I've hired three ex-Myspacers in the past few months and I'm looking for more.<p>Submit to Bill: bpaetzke@leads360.com","time":1301666873,"type":"comment"},{"by":"Sidnicious","id":2397440,"parent":2396027,"text":"NYC - Full-stack JavaScript developer<p>DISTRO.fm is an early-stage startup working to revolutionize how artists distribute their music.<p>We been building over the last few months, but there's lots of work left to do. Our website is a single page application driven by JavaScript, backed by Node.js and MongoDB.<p>Us: <a href=\"http://distro.fm/\" rel=\"nofollow\">http://distro.fm/</a>","time":1301683059,"type":"comment"},{"by":"wemakeit","id":2397521,"parent":2396027,"text":"SourceN - San Jose, CA - A Digital Agency/Venture Incubator that focuses on Mobile Dev, Web Dev, and New Product Dev is hiring Technical Project Managers, Front End Developers and Lead Architects.<p>They need bad ass developers who want to expand their skills across various platforms.<p><a href=\"http://bit.ly/eMo4kA\" rel=\"nofollow\">http://bit.ly/eMo4kA</a>","time":1301684185,"type":"comment"},{"by":"NewMonarch","id":2398962,"kids":[2399059,2399053],"parent":2396027,"text":"San Francisco - Frontend Engineer or Ruby Hacker<p>Storenvy, an awesome online storefront builder and social shopping marketplace is hiring Ruby hackers and a front-end engineer.<p>Think of us as \"Tumblr for online stores\". We're building all kinds of amazing tools that make selling cool stuff on the Internet way more awesome -- from sick drag &#38; drop online store builder interfaces to mobile apps. And we're a small team so you'll have loads of responsibility, autonomy, and big impact on the final product.We have lots of fun, pay well, and are making a meaningful impact in people's lives.<p>For those interested, we were funded be a dream team of investors (First Round, Spark Capital, Kleiner Perkins, CRV, David Cohen (TechStars), John Maloney (Prez of Tumblr) and more. Just closed a $1.5m financing and growing!<p><a href=\"http://www.storenvy.com/jobs\" rel=\"nofollow\">http://www.storenvy.com/jobs</a><p>Thanks! - Jon","time":1301712954,"type":"comment"},{"by":"edruns","id":2398426,"parent":2396027,"text":"Mountain View, CA - PHP Backend Engineer / Web Dev ($5,000 referral bonus, even if you refer yourself!)<p>Friend.ly is a personal Q&#38;A site that makes it fun to get to know your own friends better and also meet new people in your extended social network. As you can see at <a href=\"http://www.appdata.com/gainers/week\" rel=\"nofollow\">http://www.appdata.com/gainers/week</a>, we were one of the fastest growing sites/applications on the Facebook platform last week, and we expect growth to further accelerate as we scale over the next several weeks.<p>We are 10 people (<a href=\"http://www.friend.ly/about\" rel=\"nofollow\">http://www.friend.ly/about</a>) who work in an awesome office in downtown Mountain View, and we are currently looking for a couple more talented engineers to join us. Email jobs@friend.ly if you're interested in learning more!","time":1301697850,"type":"comment"},{"by":"fourk","id":2397410,"parent":2396027,"text":"San Francisco, CA<p>www.focus.com is hiring another senior Django developer. What you should be: smart, use Python, Javascript (jQuery) and CSS (Blueprint/sass) or some combination of these things.\nMust be willing to work on-site in San Francisco. Our offices are about a block from BART's Embarcadero stop.<p>Contact info is in my profile.","time":1301682661,"type":"comment"},{"by":"poutine","id":2396750,"parent":2396027,"text":"Vancouver - Ruby on Rails developer<p><a href=\"http://www.e-xact.com\" rel=\"nofollow\">http://www.e-xact.com</a> a credit card processing company with a rails based infrastructure needs a developer with lots of experience in Ruby.  May consider remote work for Canadians and Americans though has a preference for local.<p>jobs at e-xact.com","time":1301673617,"type":"comment"},{"by":"daten","id":2396324,"parent":2396027,"text":"Silver Spring, MD - Linux System Administrator<p>We're looking to hire a Linux SA to help build and deploy clusters and custom software.  Includes some travel.  Must be eligible for a security clearance.<p>Other available positions listed at <a href=\"http://www.woti.com/jobs.cfm\" rel=\"nofollow\">http://www.woti.com/jobs.cfm</a><p>bschneiders@woti.com","time":1301667650,"type":"comment"},{"by":"nolanbrown23","id":2397572,"parent":2396027,"text":"Millennial Media<p>San Francisco - QA, Support, and Account Managers<p>Baltimore - QA, Support, and Software Engineers<p><a href=\"http://www.millennialmedia.com/about-millennialmedia/careers\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers</a><p>We are venture-backed and a leader in the mobile advertising space. nolan@millennialmedia.com","time":1301685121,"type":"comment"},{"by":"effektz","id":2401315,"parent":2396027,"text":"Denver, Colorado - Ruby on Rails<p>We are looking for 2 Ruby on Rails developers to add to our team. You don't have to be an RoR expert to apply. As long as you're willing to work hard and learn from us. You must be motivated, excited to write code, and want to work at an established startup company.<p>MySQL and jQuery experience is a plus.<p>Our company is an established management system in the MMJ industry. We have been in business for a year and a half, and we are growing like crazy.<p>If you have a solid understand of Ruby on Rails, live in Denver, CO, send me an email and let's talk.<p>alex@twinsoftech.com<p><a href=\"http://www.internmatch.com/internships/6043/ruby-on-rails-developer/ruby-on-rails-developer\" rel=\"nofollow\">http://www.internmatch.com/internships/6043/ruby-on-rails-de...</a>","time":1301788503,"type":"comment"},{"by":"liquimoon","id":2412976,"parent":2396027,"text":"Yaletown, Vancouver, BC - Ruby on Rails Hacker<p>To all Rails hackers, want to work on interesting scalability problems that you only read about? With 28 million monthly unique visitors, Suite101 is a top 100 website in the US according to Quantcast.<p>We are looking for a Ruby on Rails hacker to help us design and develop our new platform. Experience with git, jQuery, Haml, Redis, Postgres a huge plus.<p>New hires get a brand new Macbook Pro and a 24-inch monitor.<p>Our office is located in the trendiest part of Downtown Vancouver. We offer competitive salary and benefit packages for the right candidates.<p>Send your github account and resume/cover letter to jerry-dot-tian-at-suite101-dot-com.<p>More about the job at: <a href=\"http://goo.gl/1NXV4\" rel=\"nofollow\">http://goo.gl/1NXV4</a>","time":1302041450,"type":"comment"},{"by":"scottbessler","id":2396637,"parent":2396027,"text":"Chicago, IL - .net software developer<p>Join our development team working on C#, ASP, WPF, SQL, and more. Looking for frontend or backend, experienced or fresh out of school.<p>Contact sbessler@stratadecision.com with your resume and any extra information to let us get to know you.","time":1301672257,"type":"comment"},{"by":"newy","id":2397878,"parent":2396027,"text":"SOMA, San Francisco, CA - Software Engineers<p>Opzi, YC S10, building an enterprise knowledgebase people will actually use.  All engineer team, we use Ruby, Rails, JS, Node, Backbone (some Python).  We're looking for smart, well-rounded engineers who are interested in building a new type of enterprise software.  In addition, we're on the lookout for a designer with a strong sense of design and ability to work in code.  Hiring for full-time, but will consider interns.<p>Reach out directly to euwyn@opzi.com, or use the link below.<p><a href=\"http://opzi.theresumator.com/apply/OomBZi/Software-Engineer.html\" rel=\"nofollow\">http://opzi.theresumator.com/apply/OomBZi/Software-Engineer....</a>","time":1301689445,"type":"comment"},{"by":"mkuhn","id":2405918,"parent":2396027,"text":"Zurich, Switzerland - Python Developer - REMOTE<p>connex.io is looking for a full-time Python developer to reinforce its team. We produce an address book solution that keeps personal address books clean, complete and up-to-date for the user.<p>Full listing at <a href=\"http://blog.connex.io/connexio-is-looking-for-you-searching-a-fullt\" rel=\"nofollow\">http://blog.connex.io/connexio-is-looking-for-you-searching-...</a><p>About you: You are passionate about what you do and have the following skills:\n- Python Hacker\n- Well versed Linux sysadmin\n- Good understanding of web applications and network security\n- Experience in working with REST APIs\n- (Cassandra Experience is a big plus)","time":1301908916,"type":"comment"},{"by":"patrickxb","id":2398534,"parent":2396027,"text":"Chicago - Software Engineer @ StatHat<p>See the full listing:  <a href=\"http://www.stathat.com/jobs\" rel=\"nofollow\">http://www.stathat.com/jobs</a><p>You're going to be working on all aspects of StatHat: the front end web application, the design and display of quantitative information, the back end distributed system, database storage, configuring servers, optimizing code, writing iOS and Android apps, and continuing to design the evolving architecture of our system.<p>We use whatever language or technology is best to solve the problem. We are open to trying out new technologies, languages, and ideas. This job will be full of learning opportunities and you'll never be bored.","time":1301700285,"type":"comment"},{"by":"janulrich","id":2396871,"parent":2396027,"text":"Vancouver, Canada - Rails Developer<p>Optemo is a fast-paced startup providing software-as-a-service to online retailers. We have a small team where everyone has input on the final product. We are looking for full-time employees and interns as well.","time":1301675312,"type":"comment"},{"by":"mYk","id":2403800,"parent":2396027,"text":"Polyconseil - Paris, France - Django developer<p>We are a small strategy consulting company focused on exploring new fields of activity. We have launched several spin-offs in the past years.<p>We are creating a large scale car sharing service (several thousand electric vehicles), launching in Q4. We are looking for highly productive and motivated developers to join our backend development team.<p>Interns with strong programming skills and learning abilities are welcome.<p>Drop me a line (aymeric.augustin@&#60;company&#62;.fr) or apply online at <a href=\"http://www.polyconseil.fr/careers/\" rel=\"nofollow\">http://www.polyconseil.fr/careers/</a>","time":1301862457,"type":"comment"},{"by":"aonic","id":2411635,"parent":2396027,"text":"UrbanDaddy is hiring two Senior LAMP Engineers in Union Square, NYC.<p>Here's a recent job description: <a href=\"https://gist.github.com/9d91abc30fdb07f7da45\" rel=\"nofollow\">https://gist.github.com/9d91abc30fdb07f7da45</a><p>UrbanDaddy is a leading, exclusive email magazine that covers the latest in restaurants, nightlife, fashion, experiences and products for hip, trend-seeking professionals.  We are looking for a full-time Senior LAMP Engineer to help develop our products in web, email and mobile and channels.<p>Feel free to send an email with your resume and any introduction: hn-engineerjob@urbandaddy.com","time":1302022046,"type":"comment"},{"by":"jim-greer","id":2396219,"kids":[2401745],"parent":2396027,"text":"Portland, OR - Rails Developer - Kongregate","time":1301666294,"type":"comment"},{"by":"amduser29","id":2398050,"parent":2396027,"text":"Life360 - SF - Head of Geolocation<p>Life360 is turning smart phones into the ultimate safety devices.  We currently have close to 2,000,000 registered family members and are adding 20,000 / day on our Family Tracking apps.  We are looking for an awesome geo location dev to help us take advantage of all the location data we have coming in to the system to provide even more value to our users.  So if you are an awesome developer who wants to get their hands dirty working on some really interesting geo location problems, shoot me over an email: alex@life360.com.<p>Cheers,\nAlex","time":1301691604,"type":"comment"},{"by":"thomd","id":2398592,"parent":2396027,"text":"Cambridge or Brighton (UK) - Aptivate<p>We are an established not-for-profit organisation working in International Development. The core of our work is in providing IT services to the sector (think data visualisation and data transparency, knowledge management and mobile devices), though we also work as facilitators and trainers. We're currently looking for skilled web developers who are prepared to participate in all aspects of the organisation.<p>For details <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1301701722,"type":"comment"},{"by":"ksowocki","id":2396339,"parent":2396027,"text":"Ignighter (Techstars '08, NYC) is hiring php developers, designers, and some data engineers.  Details here =&#62; <a href=\"http://ignighter.com/jobs\" rel=\"nofollow\">http://ignighter.com/jobs</a>","time":1301667846,"type":"comment"},{"deleted":true,"id":2397503,"parent":2396027,"time":1301683953,"type":"comment"},{"deleted":true,"id":2397490,"parent":2396027,"time":1301683754,"type":"comment"},{"by":"jprobert","id":2396390,"kids":[2396917],"parent":2396027,"text":"ProCapital Technologies is always looking for amazing engineers.  We're working on some cool technologies around social search and e-commerce.  Email me if you would like further detail.","time":1301668751,"type":"comment"},{"by":"hshah","id":2396583,"parent":2396027,"text":"KISSmetrics is hiring. Ruby engineers, generalists and more. San Francisco Bay Area and Remote: <a href=\"http://kissmetrics.com/jobs\" rel=\"nofollow\">http://kissmetrics.com/jobs</a>","time":1301671538,"type":"comment"},{"by":"bluelu","id":2398329,"parent":2396027,"text":"Trendiction in Luxembourg:<p><a href=\"http://www.trendiction.com/\" rel=\"nofollow\">http://www.trendiction.com/</a> <a href=\"http://blog.trendiction.com/tag/joboffer\" rel=\"nofollow\">http://blog.trendiction.com/tag/joboffer</a><p>No remote.<p>Looking for 3-4 more java developers in the field of: - distributed large scale crawling, content extraction, data analysis - web applications<p>We crawl, analyze (extract article, author, date, theme, sentiment,...) and monitor websites (news, blogs, ...) for our clients.<p>You can contact me directly under t.britz@trendiction.com","time":1301696292,"type":"comment"},{"by":"supernayan","id":2397931,"kids":[2397939],"parent":2396027,"text":"Washington, DC - Audax Health<p>Work in a fun and entrepreneurial environment where dress is casual and flip-flops are encouraged.  We provide the best tools such as brand new Apple computers for every employee.  Collaborate daily with top talent from companies like Zynga, WebMD, Microsoft, Bloomberg, Booz Allen Hamilton, and XM.  Your contributions will directly impact the way millions of people interact with healthcare.<p>Looking for Scala, Web, Cloud, Interface, and Mobile Engineers<p>Contact jobs@audaxhealth.com","time":1301690355,"type":"comment"},{"by":"zwischenzug","id":2396870,"kids":[2397943],"parent":2396027,"text":"West London, UK. Software Developers/Engineers, any skills set, any level of experience.<p>Leading edge software dealing with FTSE-100 companies in a high-performance environment.","time":1301675309,"type":"comment"},{"by":"brugidou","id":2396453,"parent":2396027,"text":"Paris, France - Criteo<p>C#, AS3, Hadoop/Hive, SQL Server\nTwitter: @brugidou","time":1301669769,"type":"comment"},{"by":"SteveOS","id":2398375,"parent":2396027,"text":"Senior software Engineer, Paris, France<p>Mimesis is hiring a senior software engineer preferably with experience with Scala (but it's ok if just truly want to learn Scala).<p>We are building a new 3D universe with strong interaction with Facebook: <a href=\"http://www.mambanation.com\" rel=\"nofollow\">http://www.mambanation.com</a>\nIt is great company, with a really great team of developers.<p>Send me an email at steve.gury@gmail.com if you are interested.","time":1301697003,"type":"comment"},{"by":"nickmolnar2","id":2399013,"parent":2396027,"text":"Thirdi is hiring in Vancouver, BC.<p>Looking for excellent problem solvers, with experience building production web applications. We typically work with the Symfony or Yii PHP frameworks, with a heavy dose of JQuery, but developers are free to choose their tech on a project by project basis.<p>Also looking for a HTML/CSS vet, preferably with some JQuery skills who can help us deliver pixel perfect designs.<p>You can find contact info on thirdi.com.","time":1301714426,"type":"comment"},{"by":"garethdiz","id":2415136,"parent":2396027,"text":"SearchSpring is hiring Web Developers: <a href=\"http://jobsco.re/gwarZZ\" rel=\"nofollow\">http://jobsco.re/gwarZZ</a><p>SearchSpring provides SaaS solutions to E-Commerce retailers including a searchable catalog app for Facebook...<p>Come work with exciting consumer brands that have TONS of Facebook fans!<p>Transform our customers' consumer facing web, mobile and Facebook sites using the latest web-scale technology!<p>Lots of opportunity to work in different areas.","time":1302099449,"type":"comment"},{"by":"derge808","id":2398711,"parent":2396027,"text":"Thank you for asking.  Rackspace.  Rackspace needs developers:  <a href=\"http://rackertalent.com/\" rel=\"nofollow\">http://rackertalent.com/</a>","time":1301704296,"type":"comment"},{"by":"rpuckett","id":2397765,"parent":2396027,"text":"Location: New Orleans\nLEAD DEVELOPER\nLiveset\n<a href=\"http://liveset.com\" rel=\"nofollow\">http://liveset.com</a><p>Liveset is a new digital platform presenting live concert events on the web and mobile devices in handsome HD, with supporting content that provides a more powerful connection between artists and their online fan bases. Liveset brings the concert experience to artists’ fans across the Internet as their show is happening and provides a platform for fans to watch an archived show at their convenience.<p>We’re going to make live shows as easy as Youtube. Our goal is to build a site for music fans that has an equally impressive set of features as MLB.tv. We also need to build out our own proprietary live-streaming platform – we’re currently using livestream.com, and we’d love to talk to you about why we want to replace it (no offense to livestream - they've been great partners).<p>Liveset is a functioning, funded platform that needs help getting to the next level.  The platform was launched on September 29, 2010, and has been very well received.  We’ve done all of the development work through a contract relationship with a talented design and development firm out of New York (@crushlovely), but we want someone as committed as we are to come on board.<p>That means we’re offering a real founder’s spot. We need a Lead Developer, and we’re willing to offer a 20% equity stake to the right person.  The post-money valuation on our last round was $2.5 million (we’ve raised $500,000).  That means we’re offering up to a half-million (on paper, of course) for joining. We know that successful projects are built on talented engineers, and we mean business about bringing you on board.<p>The site is built in Rails.  We need a partner who’s willing and eager to get in on the ground floor and help us build this into the platform we know it can be.<p>Why do you need co-founders if you’re such an awesome developer?  We’re experienced at what we do. One of your partners spent 7 years on the other side of the table at a media-focused private equity firm. Another one has already built a successful video production company and is building another product, with plenty of investor interest. We’ll raise money and keep your bills paid. We’ve already made dozens of connections (maybe you’ve heard of some of the bands on the current site, and you <i>HAVE</i> heard of some of the bands we can’t talk about yet). We’ve made more connections you can’t see: artists, booking agents, venues, managers, labels, sponsors, potential investors, consultants, entrepreneurs, streaming providers, CDN’s, development firms, designers, etc. We know you’ve heard ‘we need a technical co-founder’ like they’re replaceable, and we know better. We know the live streaming concert industry as well as anyone out there.  And we’ve done it all with just 2 people - we’re not an over-funded New York VC-backed startup trying to buy instead of build.<p>We mean it. Get in touch and let us show you what we have to offer. It’ll be fun and profitable, we promise!<p>Plus we’re in New Orleans – and if you were at RubyConf2010, you know how great a city this is. How about a bunch of free live music in one of the best music cities in the world? Awesome food? Great co-workers? We love this town, and we’ll be sure you know it’s impossible not to.<p>Actual-work wise, what we’re looking for:<p>_ Ruby on Rails\n_ Testing frameworks/methodologies (Rspec, Cucumber, etc.)\n_ Streaming media / video experience\n_ Rich Internet Applications (RIA), e.g. Flash, Silverlight\n_ Willingness to move to New Orleans, Louisiana<p>But really, aside from the moving, none of that is as important as what you bring to the table. We’re not looking to give away 20% of an angel-funded company so we can tell you what to do. We’ve also got enough money raised that we can pay you a lot more than ramen money (and you can live like a king in New Orleans for half of what you’d make in California or New York). You don’t need to forgo your IRA contributions for this gig.<p>We are firm about you coming to New Orleans. We’re looking for a true partner. Given our small size and the fact that this is our first in-house developer, we really need you on the ground here with us. We want you there with us on the crazy late nights before a show...  and at the over the top celebration dinners afterwards. We’re fully committed to this (some of that funding is our own money) and want someone who is able to fully commit as well.<p>To learn more about us, watch this video (<a href=\"http://lve.st/gXgqTk\" rel=\"nofollow\">http://lve.st/gXgqTk</a>).  If you’re interested in working with us, email ross.hinkle@liveset.com.","time":1301687944,"type":"comment"},{"by":"yesbabyyes","id":2397855,"parent":2396027,"text":"Stockholm, Sweden<p>Startup in fashion/affiliate marketing looking for summer interns for programming Python, Django, JavaScript.<p>Contact me at linus@hanssonlarsson.se","time":1301689256,"type":"comment"},{"by":"mikeklaas","id":2397675,"parent":2396027,"text":"Zite – Vancouver or San Francisco<p>We just launched a personalized reader app for the iPad that made a big splash (100k downloads in 5 days).  We do hardcore machine learning and large scale data processing.<p>We've got positions open for the backend/ML side of things, as well as the iOS/web side.  Looking for contract designers, as well.<p><a href=\"http://zite.com\" rel=\"nofollow\">http://zite.com</a>","time":1301686484,"type":"comment"},{"by":"binarymax","id":2396726,"parent":2396027,"text":"Needham, MA - Remote a possibility.<p>Node/C/C++ developers<p>Profitable and exciting Healthcare SaaS startup that was acquired, but independent.<p>max.l.irwin -at- googlemail -dot- com","time":1301673301,"type":"comment"},{"by":"remi","id":2398028,"parent":2396027,"text":"Quebec City, Canada<p>We're looking for mobile (iOS and Android) developers as well as Web (Ruby, Rails, Sinatra) developers.<p><a href=\"http://www.mirego.com\" rel=\"nofollow\">http://www.mirego.com</a><p>Also, we have a nice little \"life @ Mirego\" website we built to explain why you should work with us :) → <a href=\"http://vie.mirego.com\" rel=\"nofollow\">http://vie.mirego.com</a>","time":1301691343,"type":"comment"},{"by":"mvs","id":2398478,"parent":2396027,"text":"Berkeley, CA - Ruby on Rails Expert/ Head of Technology.\nPassion for smart, simple, elegant, and clean products a (huge) plus.\n<a href=\"http://www.qohort.com\" rel=\"nofollow\">http://www.qohort.com</a> is a very early stage educational start-up, hoping to change the way people learn. \nEmail: info@qohort.com","time":1301699127,"type":"comment"},{"by":"jbarmash","id":2398247,"parent":2396027,"text":"NYC, NY - Sr. Software Engineer (Java, Groovy/Grails)\nEnergyScoreCards.com - energy efficiency analytics.<p>www.energyscorecards.com","time":1301694801,"type":"comment"},{"by":"BrandonSmith","id":2399797,"parent":2396027,"text":"Phonebooth.com is a hosted phone service. We are hiring UX and Erlang developers.<p>Fulll listings at <a href=\"http://bandwidth.com/about/join/careers.html\" rel=\"nofollow\">http://bandwidth.com/about/join/careers.html</a><p>We use Erlang, PHP, jQuery, git, Selenium, Jenkins, iOS and Android, and more.<p>Apply online at the links above to find out more.","time":1301747901,"type":"comment"},{"by":"styloot","id":2399060,"parent":2396027,"text":"Styloot is solving fun problems in the visual and taste space, for fashion industry. Think of it is as hunch for fashion.  An agile web 2.0 company based in Manhattan and Pune, India. Looking for front end designers and developers.  Sorry no to remote.<p>Questions? info at  stylewok dart calm.","time":1301715952,"type":"comment"},{"by":"ciju","id":2398584,"kids":[2412061],"parent":2396027,"text":"Bangalore, India.<p><a href=\"http://www.videopulp.in/careers.html\" rel=\"nofollow\">http://www.videopulp.in/careers.html</a> (early stage startup)<p>web programming and machine learning (image classification, object recognition etc).<p>at this stage, we dont care much about which language u use, but rather what u can achieve.","time":1301701531,"type":"comment"},{"by":"imoawesome","id":2397700,"parent":2396027,"text":"imo - Palo Alto, CA \nWork with TopCoders, ACM ICPC World Finalists, and IOI medalists.  Open to intern and international candidates.  Looking for SWEs and SWEs specializing in operations: <a href=\"https://imo.im/jobs\" rel=\"nofollow\">https://imo.im/jobs</a>","time":1301686891,"type":"comment"},{"by":"cheriot","id":2398153,"parent":2396027,"text":"OPOWER is hiring in DC and SF: <a href=\"http://opowerjobs.com/engineering\" rel=\"nofollow\">http://opowerjobs.com/engineering</a><p>Junior/Senior/Test Engineers that want to work with Java/Ruby/Mysql<p>Feel free to send me questions. H1B candidates are welcome.","time":1301693241,"type":"comment"},{"by":"alister_b","id":2414676,"parent":2396027,"text":"Peerindex is hiring inter/graduate QA developer(s), based out of London Techhub.  We use (among other things) Mongo and Hadoop on EC2.<p><a href=\"https://gist.github.com/905493\" rel=\"nofollow\">https://gist.github.com/905493</a>","time":1302089334,"type":"comment"},{"by":"bretthellman","id":2396997,"parent":2396027,"text":"Mtn View - CompanyLine, jobs @ Companyline-inc<p>Wanted:\niOS &#38; Rails devs with a CEO mindset","time":1301677113,"type":"comment"},{"by":"amac","id":2396824,"kids":[2397308],"parent":2396027,"text":"Seeking freelancer.<p>Web developer, remote ok.<p>Project is to catalog every product in existence.<p>Database knowledge a bonus.<p>E-mail is in my profile.","time":1301674681,"type":"comment"},{"by":"jmtulloss","id":2398349,"parent":2396027,"text":"Rdio is hiring in San Francisco:<p><a href=\"http://www.rdio.com/careers/\" rel=\"nofollow\">http://www.rdio.com/careers/</a>","time":1301696610,"type":"comment"},{"by":"wenbert","id":2398939,"kids":[2401428],"parent":2396027,"text":"Anyone hiring in New Zealand? My wife and I are in the process of migrating to NZ.","time":1301712265,"type":"comment"},{"by":"benhatten","id":2398398,"parent":2396027,"text":"Washington DC - EverFi<p>We're looking for Rails and Flash Developers.<p>email me - ben at everfi dot com","time":1301697399,"type":"comment"},{"by":"shaynesweeney","id":2416396,"kids":[2416403],"parent":2396027,"text":"Instagram is.<p>We are currently hiring extraordinary engineers and designers who want to build and scale one of the fastest growing companies in the social web. We're in the business of building a new way for people to communicate and share their lives via media on the go. We're looking to grow our team into a world-class group of engineers that want to focus on big, meaningful technical challenges.<p>In a handful of months, Instagram has amassed well over 2.5 million users on the iPhone platform alone. As an Instagram Engineer, you have the unique opportunity to face many different kinds of challenges and touch many different kinds of technologies that allow the service to continue to grow at an increasing rate.<p>We're looking for people who want to face interesting infrastructure challenges. You should be constantly excited by questions like: How do you tackle increasingly vast amounts of data? You should get excited about exploring and implementing sharding and partitioning schemes. You should get a thrill out of processing gigabytes of data to inform product decisions. You should be able to design and implement systems that scale seamlessly with the vast numbers of users that decide to share their lives through images every day.<p>We also face product challenges like how to prioritize, design, and build a compelling product while maintaining simplicity and usability. Our product challenges span different platforms (mobile &#38; web) and you should be comfortable moving between different parts of the system whether that be learning objective-c to contribute to our iPhone client, or writing solid JavaScript to make a web experience immersive and interactive.<p>Instagram is also an incredibly important part of everyone's life that works here. We pull many late nights and weekends, and you should be excited to jump in and make Instagram the primary focus of your life. We put in extra effort because we love Instagram and love to see it flourish and you should want to as well.<p>The bottom line is: we want smart, extremely motivated people who are willing and able to contribute quickly to all parts of Instagram, and who are excited by the challenges we face.<p>Here's a list of characteristics that we're looking for in an engineering candidate:<p>- A college degree in Computer Science or equivalent. \n- A scrappy, entrepreneurial attitude that gets high-quality projects done quickly. \n- Deep understanding, familiarity and skill with programming for the web. \n- Experience in Objective-C and Python is a plus, but not required. \n- Ability to touch many different parts of our system such as: deploying a new set of boxes on EC2, debugging network inefficiencies, implementing optimized graphics algorithms in C or OpenGL, writing optimized SQL queries, writing full python classes, or writing NodeJS applications. Point is: you should be able to pick up new things very quickly. \n- A demonstrated history of intellectual and entrepreneurial exploration. \n- Be able to write elegant, readable, and well-documented code.<p>We're a small team, and we're looking for people to make a big impact. This means you should want to take on lots of responsibility and be able to manage projects independently. You should be able to think critically about a problem, evaluate the solution set, and be able to pick the right course of development given the set of constraints. Of course we're looking for great engineering talent, but it's extremely important to us that everyone our team has a solid product design sense.<p>We truly believe in Instagram's potential to change the world for the better, and we're looking for a select group of individuals up for challenge to see that vision through.<p>Send your resume to jobs@instagram.com and let us know why you think you're a great fit. We're looking forward to hearing from you!","time":1302115835,"type":"comment"},{"by":"pitdesi","id":2396221,"parent":2396027,"text":"Chicago or remote: \nUI/UX designer \n<a href=\"http://feefighters.com/jobs/ui-designer-developer/\" rel=\"nofollow\">http://feefighters.com/jobs/ui-designer-developer/</a><p>(UI people - our site <a href=\"http://feefighters.com\" rel=\"nofollow\">http://feefighters.com</a> normally doesn't look like it does today, I swear!)<p>Also looking for freelance infographic designer (remote)\n<a href=\"http://feefighters.com/jobs/infographic-designer/\" rel=\"nofollow\">http://feefighters.com/jobs/infographic-designer/</a><p>FeeFighters is awesome and is disrupting the shady world of credit card processing. I've been on board for a few months and have enjoyed the hell out of my time here. We've got a bunch of superstars on the team right now and are looking to add another... Join us!","time":1301666312,"type":"comment"},{"by":"ktraub","dead":true,"id":2396494,"parent":2396027,"text":"Annapolis, MD\nMany Software and Systems Engineering Jobs Junior thru Sr.\n<a href=\"http://www.arinc.com\" rel=\"nofollow\">http://www.arinc.com</a>\n<a href=\"http://www.arinc.com/careers/\" rel=\"nofollow\">http://www.arinc.com/careers/</a>","time":1301670345,"type":"comment"},{"by":"gooberdlx","id":2396111,"kids":[2398373],"parent":2396027,"text":"Google - Autocompleter\n<a href=\"http://www.google.com/intl/en/jobs/uslocations/mountain-view/autocompleter/index.html\" rel=\"nofollow\">http://www.google.com/intl/en/jobs/uslocations/mountain-view...</a>","time":1301664976,"type":"comment"}]]}