{"comments":[[{"by":"squirrel","id":2270873,"kids":[2274501],"parent":2270790,"text":"Boston (US) as well as London (UK) - youDevise, Ltd.<p>We're a 65-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're hiring developers and other smart folks of many kinds. See <a href=\"https://dev.youdevise.com\" rel=\"nofollow\">https://dev.youdevise.com</a> and <a href=\"http://www.youdevise.com/careers\" rel=\"nofollow\">http://www.youdevise.com/careers</a>.<p>While we don't have remote workers, we do help successful candidates relocate to London or Boston including arranging visas where needed. For example, last year we hired HN readers from Denmark and the US, and we moved a Polish employee to Boston.","time":1298891295,"type":"comment"},{"by":"astockel","id":2284659,"parent":2270790,"text":"BuzzGenie - Los Gatos - Remote is OK, but must be able to attend on site brainstorming and status meetings near Hwys 17 &#38; 85.<p>BuzzGenie is a social network/news/blog/action Internet portal. We address an individual's need to not only voice their opinions, but to make a difference, enabling them to discuss and blog interests and act on causes, issues, events, topics, and persons of interest while keeping their identity private to the Internet at large. BuzzGenie combines the best features of Facebook, Huffington Post, WordPress, Yelp, and Twitter by integrating the friends feature; recent activity feeds; interest-based news feeds, blogs, and Tweets; and connecting people using an <i>interest-based</i> social graph.  We have a solid revenue model which gets us to profitability in about two years.<p>Looking for LAMP and mobile developers, as well as Unix/Plesk admin.<p>Also looking for activists-bloggers.<p>You will play a key role on a very small team. Since we are at very early stage, you can become a major player in a company that wants to change and improve the way people interact on the things they care about. This is a very hot, competitive space with a potentially huge payout for the team first to get traction in the market. Great achievers will be rewarded accordingly.<p>Benefits of working on site has the additional benefit of three free gourmet meals a day (including Indian/vegetarian), an outdoor patio work area, hot tub, home gym, and unlimited gourmet espresso/cappuccino/coffee (it's a private residence). Imagine upscale 'garage' start-up. Walking distance to park with basketball, tennis courts, running track, and par course. Across Bascom Ave. from Los Gatos Creek trail for walking, running, roller blading, and biking.<p>Have a look at the site and see if it interests you. Helps to have some activist in your blood.<p>Compensation is accomplishment based until funding is closed. Founder's stock available.<p>astockel at buzzgenie com","time":1299170487,"type":"comment"},{"by":"necrodome","id":2279541,"parent":2270790,"text":"Here is a RSS feed for this thread's parent comments (which are mainly job postings):<p><a href=\"http://whoishiring.heroku.com/rss/2270790\" rel=\"nofollow\">http://whoishiring.heroku.com/rss/2270790</a><p>Thanks to Ronnie Roller (<a href=\"http://ronnieroller.com/\" rel=\"nofollow\">http://ronnieroller.com/</a>) for Hacker News API.","time":1299074450,"type":"comment"},{"by":"exline","id":2276178,"parent":2270790,"text":"San Diego, CA.  Remote ok.\nKlatu Networks: A wireless sensor networking startup that focuses in biotech monitoring.  We are a small, bootstrapped, profitable start up.   We are very selective on our hiring so you will only be working with other great engineers.<p>The most important requirements is to be passionate about creating software and be able to quickly grasp new technologies.  Other requirements include strong knowledge of Javacript, experience with Ruby, Java, SQL, Git.<p>Contact me directly if you are interested, email is in my profile.","time":1298998855,"type":"comment"},{"by":"btstrpthrowaway","id":2281255,"parent":2270790,"text":"Cambridge, MA (AO Games)<p>We’re an online retail/games startup based in Cambridge, MA looking for someone to fill a full-time position as a Lead Developer of web applications.<p>We compensate very well, paying market rates or above for real talent. You may choose to substitute some equity for salary, but that is not mandatory. A remote working option is available at the start, though in the long term the job is at Cambridge, MA.<p>We are looking for someone who:<p>- Has experience building complex web apps (think Facebook).<p>- Has experience / enjoys the challenge of optimizing complex, time sensitive, applications.<p>- Has some familiarity with PHP in LAMP (though PHP doesn't need to be your favorite language; I'm looking at you Python/RoR evangelists!)<p>- System / Database administration familiarity is a plus, since this will be helpful for optimization.<p>A little about us: we are a small startup that is highly profitable. We bootstrapped our way to profitability by using minimum money and time (8 months). We are expanding to take on larger challenges and need a great programmer to work with us.<p>Contact me at ao.hiring@gmail.com for more info, or check out our posting here: <a href=\"http://careers.stackoverflow.com/jobs/9293/profitable-startup-looking-full-stack-ao-games-online-retail-games\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/9293/profitable-startu...</a>","time":1299099284,"type":"comment"},{"by":"tungwaiyip","id":2286388,"parent":2270790,"text":"Kontagent (San Francisco, CA)<p>We are looking for sales and engineers!\n<a href=\"http://jobvite.com/m?3zGZ1fwZ\" rel=\"nofollow\">http://jobvite.com/m?3zGZ1fwZ</a><p>Kontagent measures people, not pages, and is a leading analytics platform for\nsocial application developers. The platform has been built to provide deep\nsocial behavior analysis and visualization that provides actionable insights via\na hosted, on-demand service. It works with many of the world’s largest\ndevelopers and brands, tracking thousands of social applications and games with\nover 100 million monthly active users and over 15 billion messages per month.<p><a href=\"http://techcrunch.com/2011/02/10/facebook-analytics-platform-kontagent-now-tracking-100m-users-15b-messages-per-month/\" rel=\"nofollow\">http://techcrunch.com/2011/02/10/facebook-analytics-platform...</a><p><a href=\"http://venturebeat.com/2011/02/28/kontagent-launches-real-time-social-app-monitoring-system/\" rel=\"nofollow\">http://venturebeat.com/2011/02/28/kontagent-launches-real-ti...</a><p>Email me waiyip.tung at kontagent.com if you need more information.<p>Wai Yip Tung","time":1299198699,"type":"comment"},{"by":"harnhua","id":2299531,"parent":2270790,"text":"Looking for a junior Software Engineer - Java in Singapore.\n(Sorry, must be located in Singapore)<p>The team at Plunify is seeking a talented and enthusiastic Java developer to help build a cloud computing platform. Work with the latest Web technologies to bridge the gap between the desktop and the cloud. Most importantly, be passionate about creating great software, be able to learn quickly and be a team player.<p>Your role is to develop, maintain and support Java applications that work with our proprietary platform. Refine and enhance security of existing Java applications. You will also be required to learn and understand how to integrate your applications with various hardware and software systems.<p>Required:\n- BS/MS CS or related majors. (New graduates welcome) \n- Strong programming skills in Java\n- Willingness to learn \n- Fluency in written and spoken English. Any other languages are a bonus!\n- Deep interest in cloud computing\n- Any experience in database/SQL and web scripting technologies, e.g. PHP, Javascript is a plus<p>Get in touch via recruit at plunify dot com!","time":1299549862,"type":"comment"},{"by":"niyazpk","id":2283116,"parent":2270790,"text":"Bangalore, India (Sorry, no remote).<p>We are looking for Java and PHP programmers.<p>We are a well funded ecommerce Startup. We already have an experienced team working on the technology side. Here are some interesting problems in this space: - Scaling - Data Mining/Retrieval - Analytics.<p>Please get in touch and I will convince you to join us :)<p>(Freshers and interns are welcome too).","time":1299134385,"type":"comment"},{"by":"martharotter","id":2282027,"parent":2270790,"text":"Nomad Editions - New York city area (sorry remote not an option for this role) <a href=\"http://readnomad.com\" rel=\"nofollow\">http://readnomad.com</a><p>Web Developer for Digital Magazine Startup<p>Nomad Editions, a startup creating digital weeklies for mobile devices, is looking for an awesome web-standards focused HTML/CSS/JS developer to help build our content on top of Treesaver (treesaver.net), one of the most exciting new open source frameworks for digital news and magazine publishing. The developer will be responsible for taking wireframes and translating them into standards-compliant web pages in Treesaver.<p>We're seeking:\n - Expertise in standards-based web development with HTML/CSS/JS\n - Ideal candidate would also have design skills\n - Interest in working with a very exciting company doing something no one else in the digital publishing industry is doing: making digital content look amazing everywhere<p>If you're interested or have questions, please e-mail Martha Rotter at mrotter@readnomad.com","time":1299110327,"type":"comment"},{"by":"phunware","id":2298567,"parent":2270790,"text":"Phunware - Santa Ana, CA and Austin, TX (sorry, no remote)<p>Phunware is an enterprise branded mobile application infrastructure company that delivers high value, high utility and engaging mobile applications. These applications enable our customers to become a core part of their consumers’ mobile lifestyles.<p>Checkout our high profile apps at <a href=\"http://www.phunware.com\" rel=\"nofollow\">http://www.phunware.com</a><p>Job Opportunities in Austin, TX and Santa Ana, CA locations:<p>* Full-time position – iPhone Mobile Applications Software Engineer<p>* Full-time position – PHP Web Application Engineer<p>* Internships - iPhone Software Developer<p> \nOn-site hires only, no remote or outsourcing.  Full-time qualifications include 3+ years of software engineering in related technologies.  Internships must have proven iPhone development experience.<p> \nSend resumes to kle@phunware.com ","time":1299530224,"type":"comment"},{"by":"elliottcarlson","id":2282801,"parent":2270790,"text":"CellDivision - New York City - Local only, no remote<p>We are an established company - not a startup and not your traditional type of agency you would normally see on here - basically we work in the pharmaceutical/medinfo sector. Just because our standard business is old school - the technologies we use aren't.<p>We are a PHP shop, but make heavy use of MongoDB, Node.js, RabbitMQ, Solr, Haxe and any other technologies that are the new cool thing - but that also are indeed the right tool for the job. Other cool things we are playing with include the Kinect and RFID technology.<p>We are looking for a full time senior PHP developer. You need to be comfortable using our in-house framework and be quick on your toes in coming up with ideas. Ideas are welcome - but be ready to execute on them as well.<p>Send your resume, or any questions you might have to carlson at celldivision com","time":1299125958,"type":"comment"},{"by":"klochner","id":2278456,"parent":2270790,"text":"RentMineOnline (San Francisco, based in the Presidio).<p>We would consider interns, remote, and part-time or full-time.<p>Rails dev: you would be our #2 full-time developer, coding, refining our tech stack as we grow, and helping to coordinate our remote developers. Our current stack is {slicehost,nginx,passenger,rails,delayed_job,MySQL}. We recently upgraded to Rails3, and are adding fun stuff like varnish/redis/memcached next. We also use some amazon services {s3,rds,sdb} and have a fairly deep integration with facebook platform.<p>UX: prototype or jquery with a dash of design sensibility &#38; a knack for user flows. This could be remote or part-time, but we prefer SF-based and are ultimately looking to fill a lead design role.<p>contact me - kevin@, and include #job somewhere in the subject so I don't miss it.","time":1299040393,"type":"comment"},{"by":"ig1","id":2271165,"parent":2270790,"text":"I run CoderStack, a developer job board (currently UK focused) we have lots of startups advertising at the moment:<p><a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a>","time":1298901148,"type":"comment"},{"by":"mpd","id":2282920,"parent":2270790,"text":"Stipple is looking for an engineer. San Francisco, local only. <a href=\"http://stippleit.com\" rel=\"nofollow\">http://stippleit.com</a><p>We do Rails, jQuery, and TDD. Lots of Javascript. We write our own CSS (with SASS/Compass). We move quickly by exploiting the best tools we can find.<p>You would be the #2 engineering hire, and would work with myself and our other engineer.<p>Our awesome office is in South Beach, close to AT&#38;T Park. I'll tell you the story about it when you get here.<p>Please send resumes or questions to mpd at stippleit.com, and include HNJOB in the subject.","time":1299129418,"type":"comment"},{"by":"jplewicke","id":2275837,"parent":2270790,"text":"Boston, MA (not remote)<p>MDT Advisers - We're a small quant investing shop working with machine learning, financial analysis, and the hardest dataset in the world. We're mainly hiring for a general analyst position that’s about 60% programming and 40% financial and statistical analysis -- <a href=\"http://www.mdtadvisers.com/careers/qea.jsp\" rel=\"nofollow\">http://www.mdtadvisers.com/careers/qea.jsp</a> . The people, problems, and pay are good, and we aim for good work-life balance(e.g. no 60 hour weeks).<p>You can email me at jlewicke@mdtadvisers.com with any questions you have.","time":1298994638,"type":"comment"},{"by":"cdrw","id":2279106,"parent":2270790,"text":"London, UK<p>Commercial Security International provide internet monitoring services focused around intelligence gathering, asset and brand protection.<p>We're looking for a developer to join our team working on our MS stack using ASP.NET MVC, jQuery and TDD in an Agile environment.<p>Checkout our website at <a href=\"http://comsechq.com\" rel=\"nofollow\">http://comsechq.com</a> or email: jobs at comsechq.com if your interested.","time":1299062324,"type":"comment"},{"by":"Roedou","id":2282185,"parent":2270790,"text":"Seattle WA: Distilled - Sales Role (Non remote)<p>We're a Search Marketing consultancy; HQed in London UK, we opened a Seattle office in 2010. We work for plenty of large brands - though we have a bunch of startups amongst our client list as well.<p>Looking for a Sales Exec with some experience to join the team and keep us growing fast.<p><a href=\"http://dis.tl/sales-exec\" rel=\"nofollow\">http://dis.tl/sales-exec</a>","time":1299113286,"type":"comment"},{"by":"thomd","id":2275068,"parent":2270790,"text":"UK, Cambridge or Brighton (no remote) - Aptivate<p>We are an established not-for-profit IT consultancy working in the International Development sector. We're looking for multi-skilled web developers willing to participate in all aspects of the organisation.<p>For details <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1298982101,"type":"comment"},{"by":"GavinB","id":2271412,"parent":2270790,"text":"New York City<p>We're looking for an Assistant Project Manager to help build online games for a major publishing company (we're not dead yet!). Game design, wireframes, puzzle creation, customer service, documentation, QA--this position is a little of everything and we'll find a way to use any skill you have.<p>Shoot me an e-mail for further info: gbrown at scholastic.com","time":1298905610,"type":"comment"},{"by":"us","id":2271109,"kids":[2287068],"parent":2270790,"text":"We're a small startup local to the SF Bay Area looking primarily for developers right now and designers in the near term.<p>Ideal candidate would be a PHP dev with JS, jQuery, HTML, CSS, etc. C++, Python, Objective-C, etc are bonuses.<p>We're currently focused on solving an consumer ecommerce experience problem.","time":1298899734,"type":"comment"},{"by":"dlsay","id":2281499,"parent":2270790,"text":"New Jersey early stage startup is looking for locals. Show your NJ love.<p>Hiring software engineers and mobile app developers.<p>Java, JavaScript, AJAX (JQuery, Prototype, ExtJS) with a working knowledge of Spring MVC Framework and a sprinkling of C# wouldnt hurt.<p>jobs@iqtell.com","time":1299102570,"type":"comment"},{"by":"madisjc","id":2277072,"parent":2270790,"text":"Austin, TX (not remote)<p>Quickly growing startup making test and measurement equipment in solar industry. <a href=\"http://www.atonometrics.com/careers/software-engineer\" rel=\"nofollow\">http://www.atonometrics.com/careers/software-engineer</a>","time":1299011600,"type":"comment"},{"by":"krallja","id":2278397,"parent":2270790,"text":"Cheezburger is looking for an Experienced ASP.NET/C# Developer - <a href=\"http://jobs.cheezburger.com/job/detail/4324-experienced-asp-net-c-developer\" rel=\"nofollow\">http://jobs.cheezburger.com/job/detail/4324-experienced-asp-...</a>","time":1299038644,"type":"comment"},{"by":"ynn4k","id":2277787,"kids":[2281207],"parent":2270790,"text":"Intelligent app search and discovery startup is looking for a business development person and a UI designer.\n<a href=\"http://iApps.in/jobs\" rel=\"nofollow\">http://iApps.in/jobs</a>","time":1299022950,"type":"comment"},{"by":"techscruggs","id":2279456,"parent":2270790,"text":"Austin TX<p>Ruby Developer for AcademicWorks<p>More details here: <a href=\"http://www.academicworks.com/careers\" rel=\"nofollow\">http://www.academicworks.com/careers</a>","time":1299072762,"type":"comment"},{"deleted":true,"id":2279454,"parent":2270790,"time":1299072734,"type":"comment"},{"by":"zeroprofit","id":2272792,"kids":[2295423,2300387],"parent":2270790,"text":"i'm looking to hire people with php, jquery, and postgresql skill.","time":1298925423,"type":"comment"},{"by":"BenSchaechter","id":2274446,"parent":2270790,"text":"Palo Alto, California<p>www.GoPollGo.com is a social polling platform and we're looking for rock-solid talent.  Our stack is Ruby on Rails / JQuery / HAML / SASS / MySQL / Nginx / Passenger / Git.  Competitive pay + options.<p>Check out our opportunities:  <a href=\"http://gopollgo.com/about/jobs\" rel=\"nofollow\">http://gopollgo.com/about/jobs</a>","time":1298958299,"type":"comment"},{"by":"robinwarren","dead":true,"id":2275035,"parent":2270790,"text":"Taunton, England (near Bristol)<p>Java developers wanting a great working environment, in Taunton. We've an expanding thick client app, we're already market leading in the UK for public sector and currently looking to expand into other markets and product areas. We hired the last guy who responded to a who's hiring post on HN and now need another excellent dev wanting to work in Taunton.<p><a href=\"http://www.covalentsoftware.com/company/careers.php\" rel=\"nofollow\">http://www.covalentsoftware.com/company/careers.php</a>","time":1298980937,"type":"comment"},{"by":"anthonyu","dead":true,"id":2271417,"parent":2270790,"text":"We are looking for high-scalability data processing, machine learning, ETL, and/or browser-internals/javascript experts. Contract or contract to hire.  Remote or local to Santa Monica, CA.  Typical startup environment.<p>Send your resume with a cover letter to anthonyu at ucla dot edu and mention hacker news.","time":1298905661,"type":"comment"}]]}