{"comments":[[{"by":"timsally","id":3181910,"kids":[3183448,3183644,3183641],"parent":3181796,"text":"MA. Cambridge and the greater Boston area. Full time.<p>I work at MIT Lincoln Laboratory (<a href=\"http://www.ll.mit.edu\" rel=\"nofollow\">http://www.ll.mit.edu</a>), a research and development center run by MIT that does work for the government. My group has about 20 people in it and does application security, reverse engineering, and other low level systems stuff. Knowledge of things like assembly, operating systems, and systems are pluses but not required. It's great if you have some experience in those things, but if you can code I want to talk to you. The pluses:<p>* Extremely difficult and rewarding problems. In the past few weeks my work has had me hacking on a compiler, scaling up databases, reversing malware, etc. We're a really agile and tight knit group.<p>* Awesome workplace culture. We're a 9-5 shop, you pick your laptop, and you can order any books that you need.<p>* We reimburse tuition for classes at MIT. Last semester my office mate took operating systems with Robert Morris. We send you to conferences, including Blackhat and Defcon.<p>* We sponsor relocation and have multiple positions we want to fill.<p>You do need to be a US citizen and you will have to get a security clearance. I'm happy to talk to you about how the clearance process works and answer any questions you have. If you're local I'll buy you a cup of coffee while we talk it over. You really can't waste my time. The first step is to get in touch with me and I can explain to you how our hiring process works.<p>Email: tsally@mit.edu","time":1320154732,"type":"comment"},{"by":"edd","id":3182052,"kids":[3182203,3182362],"parent":3181796,"text":"London, UK - Full Time - <a href=\"http://spider.io\" rel=\"nofollow\">http://spider.io</a><p>At spider.io, we look to catch bad people doing very bad things.<p>We catch botnets, browser emulators, clickjackers, traffic launderers, bots that probe for weakness, bots that learn. At spider.io, we look to distinguish legitimate human website visitors from nefarious automated traffic.<p>It’s a hard engineering problem. It would be a hard problem at toy levels of traffic. We need reverse Turing tests. We need to analyse from the application layer to below the TCP layer. We need clever stateful classifiers, that classify information based on previously received information. And if this isn’t hard enough, imagine doing this across four times the number of messages each day than the number of tweets received by Twitter each day. This is where we’ll be before the year is out. And for us this is just the beginning.<p>If you're an engineer and would like to help us make this happen, check out our careers page: <a href=\"http://spider.io/careers/\" rel=\"nofollow\">http://spider.io/careers/</a>","time":1320156364,"type":"comment"},{"by":"kamens","id":3183199,"parent":3181796,"text":"Mountain View - Khan Academy (full-timers and interns welcome year-round)<p>Our mission is to provide a world-class education to anyone, anywhere. We already have millions of students learning every month, and we're growing quickly.<p>Our students answer over 1.75 million math exercise problems per day, all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>, <a href=\"http://ejohn.org/blog/khan-exercise-rewrite/\" rel=\"nofollow\">http://ejohn.org/blog/khan-exercise-rewrite/</a>), and Sal's videos have been viewed over 88MM times. We're just getting started feeding this data we're collecting back into the product to help our users learn more. If you're interested in data, analytics, and education, this is a dream gig.<p>Plus, it's one of the highest educational impact positions you can imagine.<p>We're hiring all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1320169452,"type":"comment"},{"by":"daeken","id":3182229,"kids":[3183477,3186636],"parent":3181796,"text":"Chicago, New York, Mountain View<p>Matasano Security<p>Do you like to break things?  Was your childhood room full of toys you'd taken apart and put back together in ridiculous ways?  You may be just who we're looking for.<p>At Matasano Security, some of the most interesting companies in the world hire us to break their code/hardware in terrible, terrible ways, and we're looking for people to join the team.  Security experience is great but not required, and we love people with interesting backgrounds and insights.  Above all else, you have to be quick on your feet and be comfortable learning entirely new languages, frameworks, platforms, etc while attacking a product.  You'll be pushed to the very limits of your capabilities and love every minute of it.<p>If this sounds like fun to you (and it is!), check out <a href=\"http://www.matasano.com/careers\" rel=\"nofollow\">http://www.matasano.com/careers</a>","time":1320158545,"type":"comment"},{"by":"pquerna","id":3182348,"kids":[3183046],"parent":3181796,"text":"Rackspace Hosting, San Francisco<p>Rackspace is looking for various roles right now in our new location in SOMA (previously we were in the pre-acquisition Cloudkick Office):<p>* Node.js: For some really sweet distributed systems, looking for good systems programmers who either already hack on node, or can pick it up quickly. (No, no one has 5 years of node.js experience, but using Twisted, EventMachine, Java NIO, or lots of C are good introductions to things you need)<p><a href=\"http://jobs.rackspace.com/job/San-Francisco-Sr-Python-Developer-The-Rackspace-Cloud-Job-CA-94110/1215663/\" rel=\"nofollow\">http://jobs.rackspace.com/job/San-Francisco-Sr-Python-Develo...</a><p>* Frontend Javascript: We are developing Rackspace's next generation of UIs for our customers.  We need great frontend engineers, with a heavy focus on javascript to help us.<p><a href=\"http://jobs.rackspace.com/job/San-Francisco-Front-End-Web-Developer-(Multiple-Openings)-Job-CA-94110/1069996/\" rel=\"nofollow\">http://jobs.rackspace.com/job/San-Francisco-Front-End-Web-De...</a><p>* Python Hacking: We use a mixture of Django and Twisted Python, utilizing many interesting technologies like Libcloud and RabbitMQ.<p><a href=\"http://jobs.rackspace.com/job/San-Francisco-Python-Developer-Job-CA-94110/1318631/\" rel=\"nofollow\">http://jobs.rackspace.com/job/San-Francisco-Python-Developer...</a><p>More general info on our location: <a href=\"http://rackertalent.com/san-francisco/\" rel=\"nofollow\">http://rackertalent.com/san-francisco/</a><p>If interested, check out the links above, or drop me a line, paul.querna@rackspace.com","time":1320159791,"type":"comment"},{"by":"RichardPrice","id":3183510,"parent":3181796,"text":"San Francisco, CA. Full time. H1Bs welcome.<p>Academia.edu is an engineering-focused company whose goal is to revolutionize the way that researchers share research. We are the largest and fastest-growing platform in the world for academics to share research. Over 700,000 academics have signed up, and 90,000 are joining each month. The value that the site provides is that we help academics distribute their papers to a large audience quickly, and we also help them keep up with the latest papers in their field.<p>We have about 2.7 million monthly unique visitors, and that number is doubling roughly every 7 months. The journey is 1% complete - we are just getting going.<p>We're a 6 person team based in downtown San Francisco. We have a strong engineering culture. We're a Rails site, and we also use Redis, MongoDB, Beanstalkd, Varnish, Solr, PostgreSQL, Node.js and Memcached.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>We have raised money from Spark Capital (investors in Twitter, Tumblr and Foursquare), and angels including Mark Shuttleworth (from Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture.<p>For anyone interested to learn more, please email me directly at richard [at] academia.edu.","time":1320173361,"type":"comment"},{"by":"kloncks","id":3181888,"parent":3181796,"text":"San Francisco - Kout (Full-Time &#38; Interns welcome)\n<a href=\"http://www.kout.me\" rel=\"nofollow\">http://www.kout.me</a><p>Kout is part of the latest AngelPad class. Our investors include six ex-Googlers and two top Silicon Valley VC firms.<p>We're looking to hire our first employee. Offering a real equity stake, competitive salary, and a chance to revolutionize eCommerce.<p>Kout is a dead-simple eCommerce platform that enables anyone, anywhere to be a merchant across any platform with ease, elegance and simplicity. We make it fast &#38; easy to both sell items and collect money online and do this by generating a simple one-page checkout that corresponds to a unique URL. We're also doing really cool things with dynamic pricing, payments, as well as social &#38; mobile commerce.<p>We're simplifying eCommerce and removing the barriers to entry, enabling anyone to be a merchant. We'd love to do that with you; let's talk about the details.<p>Contact hany@kout.me. Mention you're from HN :)","time":1320154547,"type":"comment"},{"by":"jnovek","id":3182223,"parent":3181796,"text":"Austin, TX - OwnLocal (YC W10) - INTERN, FULL-TIME<p>OwnLocal is looking for a full-time web designer as well as a full-time software engineer.<p>We're also looking for paid and unpaid software engineering interns in Austin.<p>We have full health coverage, you can work from home most of the week and we have free beer.<p>Check out <a href=\"http://ownlocal.com/company/jobs/\" rel=\"nofollow\">http://ownlocal.com/company/jobs/</a> or apply at jobs@ownlocal.com.  Tell us about projects that you've worked on.  A resume isn't really necessary, but if you send one it may get some mundane details out of the way.","time":1320158458,"type":"comment"},{"by":"agotterer","id":3181920,"parent":3181796,"text":"New York, NY<p>Lot18 (<a href=\"http://www.lot18.com/careers\" rel=\"nofollow\">http://www.lot18.com/careers</a>) is revolutionizing the way Americans buy wine. We built a platform that powers highly curated marketplaces for wineries and epicurean product producers to sell direct to consumers.<p>We are hiring software engineers, front-end developers, product managers, project managers, data scientists and mobile developers. You can apply by sending your resume and a link to your github profile to jobs@lot18.com.<p>Why you should work here:<p>- We work with a ton of great technologies (Python, JavaScript, Tornado, Chef, git, Vagrant, MySQL, Linux, Apache, nginx, HAProxy, Amazon Web Services, Varnish, memcached, Capistrano, RabbitMQ, jQuery and more)<p>- Well funded. We’ve raised $14.5M.<p>- People actually use our product. Over 500k users have joined since we launched in Nov 2010.<p>- We have a real business model and do 7 figures a month in transactions.<p>- Benefits: Competitive salary, stock options, medical/dental paid in full, unlimited vacation, plenty of wine, lots of challenges and interesting business/tech problems to solve.<p>You can apply by sending your resume and a link to your github profile to jobs@lot18.com.","time":1320154839,"type":"comment"},{"by":"josephjrobison","id":3184078,"parent":3181796,"text":"An interesting breakdown of top cities for the jobs right now:<p>San Francisco (City) - 41\nNew York - 15\nLondon - 13\nBoston/Cambridge - 11\nPalo Alto/Mountain View - 10\nSeattle - 9\nChicago - 8\nLos Angeles - 4\nPhiladelphia - 4\nToronto - 4\nBerlin - 4\nAmsterdam - 2","time":1320180631,"type":"comment"},{"by":"jamesjyu","id":3182854,"parent":3181796,"text":"San Francisco, CA - Parse\nSoftware Engineer, Full-time, H1B<p>Parse is building a new layer of services that abstracts the internet away for mobile developers. We need great engineers to join us in this ambitious goal. This isn't some Web 2.0 company flipping bits for ad sales. We have difficult and interesting engineering problems to solve. We need people who will not back down if they have to write a compiler, work in a new programming language, or hack a fast approximate solution to an NP-complete problem.<p>We move fast. We launched our private beta a little over two months after starting the company. Since then we've signed up over 3000 developers and have dozens of production apps in the store running on Parse.<p>We are four very technical cofounders who have been early employees or founders at successful startups. No matter your background, you will learn a lot working with the team at Parse.<p>We offer significant equity, market salary, fully covered health insurance, your choice of equipment, but most importantly the opportunity to reinvent how applications are built.<p>Please get in touch - email jobs@parse.com\nFind out more: <a href=\"https://www.parse.com/jobs\" rel=\"nofollow\">https://www.parse.com/jobs</a>","time":1320165304,"type":"comment"},{"by":"ivanzhao","id":3183246,"parent":3181796,"text":"Inkling, San Francisco, CA<p>Inkling is a publishing startup. We are a new medium, the future of books and publishing (currently with a focus in textbooks on iPad); our platform is so good that completely leaves ebooks in dust, and even most major publishing houses are invested in us.<p>We are pretty much hiring in ANY POSITION - from the JavaScript/Python/Scala/iOS to UI/UX design to marketing to product management. We are Sequoia-backed and just recently secured another round of $17 million funding.<p>The team is lean and flat. Located in the downtown SF, TV-celebrity chef in house, best gym in town, plus generous salary and options.<p><a href=\"http://www.inkling.com/jobs/openings/\" rel=\"nofollow\">http://www.inkling.com/jobs/openings/</a><p>Contact me if you are interested (ivan@inkling.com)","time":1320170095,"type":"comment"},{"by":"physcab","id":3182796,"parent":3181796,"text":"San Francisco, CA - Kontagent<p>Software Engineer, Data Scientist, Account Manager, Sales, Full-time, Part-time, Intern, Contract<p>New Office Pics!!\n<a href=\"http://www.flickr.com/photos/69285966@N05/\" rel=\"nofollow\">http://www.flickr.com/photos/69285966@N05/</a><p>Let's face it, as an engineer you can work ANYWHERE. You are in demand and if you're good you know it. You don't want to take the time to interview unless you know a company will be good for you.<p>At Kontagent, we believe that culture is everything. We have a strong community here and people are excited to come into the office. We're tackling big problems, but more importantly we're having uuuuubber amounts of fun doing it. Honestly, its a blast. Your co-workers will be some of the smartest people you know, but also some of the nicest.<p>We have:<p>- A game room for the Rockband literate<p>- A kitchen stocked with delicious food and drinks<p>- Nerf guns<p>- Wine and Cheese Thursdays<p>- Clients that can't run their businesses without us<p>- A new office with incredible views<p>- Catered lunch daily and team lunch Fridays<p>- Beer<p>- An ACTUAL work-life balance\nRead this for more information: <a href=\"http://bit.ly/n4BWGg\" rel=\"nofollow\">http://bit.ly/n4BWGg</a><p>If interested, contact me at the e-mail listed in my profile.","time":1320164696,"type":"comment"},{"by":"iandanforth","id":3184813,"parent":3181796,"text":"Redwood City, CA - North of Mountain View, South of San Francisco\nFull time. (Also taking interns)<p>Numenta is building a large-scale, next generation distributed analytics engine, based on some pretty cool biologically inspired algorithms.<p>You<p>* Love data\n* Have helped scale a web service\n* Consider yourself a full-stack developer\n* Know JS, Python, Java or C++\n* Care deeply about good design<p>We<p>* Pay well! Give stock!\n* Have a stellar team of proven entrepreneurs\n* Are well funded, pre-launch. (Stealth mode woo!)\n* Are committed to making a huge positive impact in the world<p>You should:<p>Check out our founders book: <a href=\"http://www.amazon.com/On-Intelligence-ebook/\" rel=\"nofollow\">http://www.amazon.com/On-Intelligence-ebook/</a><p>Apply!<p>Resume and cover letter to resume-eng@numenta.com","time":1320193888,"type":"comment"},{"by":"kabir_h","id":3181896,"parent":3181796,"text":"The Echo Nest - Somerville, MA<p>The Echo Nest powers amazing music apps with our API, including apps from the BBC, MTV, iHeartRadio and other music services you use and love.<p>We've got a killer engineering culture, well-stocked beer fridge and you can help shape the future of music. Come meet the whole company and see what it's like this weekend at Boston Music Hack Day: <a href=\"http://boston.musichackday.org/2011/\" rel=\"nofollow\">http://boston.musichackday.org/2011/</a><p>The after party is at our offices and Questlove is playing. How many of your company parties has Questlove played?<p>Jobs:<p>Engineer<p>Junior Engineering Intern<p>Music Information Retrieval Scientist<p>Senior Engineer<p><a href=\"http://the.echonest.com/company/jobs/\" rel=\"nofollow\">http://the.echonest.com/company/jobs/</a>","time":1320154638,"type":"comment"},{"by":"makeramen","id":3183346,"parent":3181796,"text":"Mountain View - drchrono.com (YC W11) [full time and interns]<p>We're looking for more engineers and salespeople to help us revolutionize healthcare through mobile and web interfaces.\nOur stack includes Python/Django, iOS, Android, but you don't need to be an expert, just ready and willing to learn fast!<p>Our product supports thousands of doctors who depend on our systems daily to provide quality care to their patients, iPad in hand.<p>The usual startup benefits included: competitive salary, healthcare, whatever hardware you need to be most productive.<p>email: jobs@[our-domain-name].com<p><a href=\"http://drchrono.com/jobs/\" rel=\"nofollow\">http://drchrono.com/jobs/</a>","time":1320171468,"type":"comment"},{"by":"davidtyleryork","id":3183530,"parent":3181796,"text":"SF, CA - full time<p>Love games? We have a job for you.<p>Betable is looking for a self-motivated, full-stack senior software engineer to join our founding team.  We want someone who is passionate about web development and can help us build a world class platform.<p>Betable is committed to challenging the status quo by building disruptive technology that helps developers monetize their creativity in a very lucrative, proven way.  We expect that millions of people around the globe will engage with this product &#38; that it will transform at least two multi-billion dollar industries - gambling &#38; gaming.<p>The company is backed by Atomico Ventures, the venture capital fund started by the founders of Kazaa, Skype &#38; Rdio, Niklas Zennistrom &#38;  Janus Friis, as well as various top tier angels.  Our Advisory Board includes Chris Larsen, Founder of Prosper and E-LOAN, Roger Dickey, EP/GM at Zynga and Founder of Mafia Wars and Fishville, Owen O’Donnell, CFO of Betfair, CFO of King.com, CFO of the Financial Times and Director of Rank Interactive, and Ash Muarya, Lean startup evengelist and author of, “Running Lean.”<p>We are looking for people who are great coders in any language and are flexible to adapt. We need those with both platform experience to build our API and front end experience to build our suite of consumer facing sites.<p>We offer great compensation, flexible scheduling, and a fun, hard-working startup atmosphere. If you're interested, drop us a line at Tyler@Betable.com to find out more.","time":1320173547,"type":"comment"},{"by":"Aloisius","id":3182490,"parent":3181796,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 13 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Web developers (we're a Django shop)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a><p>Questions - jobs@seatme.com","time":1320161235,"type":"comment"},{"by":"kemayo","id":3183799,"parent":3181796,"text":"Really REMOTE. You don't even have to be in the USA.<p>deviantART (<a href=\"http://www.deviantart.com\" rel=\"nofollow\">http://www.deviantart.com</a>) wants developers. We're fully remote[1]; there's no central office with a devteam located there. We expect all hires to be comfortable working in PHP, JavaScript, CSS, and SQL; we like our developers to be able to hack on any part of the site, rather than being frontend/backend specialists.<p>One exception to all that: there's an Infrastructure Engineer position which is located in Vancouver. It's C++/Java focused, and involves developing backend services used by the rest of the site.<p>We keep posting this ad because we have some open-ended hiring intended to grow the company. Available developers are currently a bottleneck on the projects we can work on, and we'd like to change that.<p>We post information about our development process here sometimes: <a href=\"http://dt.deviantart.com/blog/\" rel=\"nofollow\">http://dt.deviantart.com/blog/</a><p>Apply here: <a href=\"http://deviantart.theresumator.com/apply?source=hn\" rel=\"nofollow\">http://deviantart.theresumator.com/apply?source=hn</a><p>[1]: <a href=\"http://dt.deviantart.com/journal/We-re-all-remote-220038037\" rel=\"nofollow\">http://dt.deviantart.com/journal/We-re-all-remote-220038037</a>","time":1320176372,"type":"comment"},{"by":"transmit101","id":3182239,"parent":3181796,"text":"London:<p>At Mixlr, we’re currently looking to meet developers.<p>Mixlr is a platform for broadcasting and listening to live audio. We launched less than a year ago, and have a large and fast-growing user base including some of the world’s top DJs and radio stations. We also have an interesting and scaleable backend architecture which involves not only Ruby but lashings of Java, C and C++, with heavy usage of Redis and MongoDB.<p>We practice test-driven development, use Puppet to automate our server configuration and live by the mantra of rapid deployment: join us, and you can expect to see your code being put through its paces by thousands of users - within hours (or quite possibly, minutes).<p>We would love to meet developers with:<p>- deep web development knowledge - most likely involving Ruby on Rails.<p>- a strongly test-driven approach to coding.<p>- a love for learning new skills and technologies, and the enthusiasm to break out of Ruby and try their hand at unfamiliar languages and frameworks.<p>- a driving passion not just for coding, but for audio, music and startups as well.<p>For the right person(s), we are able to offer:<p>- A competitive, full-time salary - negotiable dependant on experience.<p>- Meaningful stock options.<p>- Offices a stone’s throw from Old Street tube.<p>- The opportunity to take a leading, hands-on role in building an exciting and ambitious music company.<p>If the above interests you, or you’d like to discuss anything further, then we’d love to talk. Contact me: rob &#60;somehow&#62; mixlr.com.","time":1320158647,"type":"comment"},{"by":"jonbischke","id":3182325,"parent":3181796,"text":"San Francisco, CA (SF/Mission)<p>RG Labs is hiring: <a href=\"http://www.rglabsinc.com/#jobs\" rel=\"nofollow\">http://www.rglabsinc.com/#jobs</a><p>We operate under the premise that the most important decisions we make are decisions about people (e.g., who to start a company with, who to hire, who to date/marry...) We also feel like the Web is in its infancy in terms of helping us to make better decisions based on data and that this space will explode in coming years.<p>We're planning to help detonate that explosion. :)<p>A few things about us:<p>- We have a long backlog of customers waiting to use our product when it launches and a big market in front of us.<p>- We're building an engineering-centric organization and working out of a cool work/live space in the Mission.<p>- We offer outstanding benefits, treat engineers and designers like the VIPs they are and value balance while at the same time working hard and passionately towards our goals.<p>- Our current stack includes Ruby, Rails, MySQL, Resque, and elasticsearch and we'll be diving in soon on Hadoop, graph databases/neo4j and a whole host of other fun stuff.<p>- We're also planning to contribute to open source as much as we can (e.g., <a href=\"https://github.com/rglabs/teleport\" rel=\"nofollow\">https://github.com/rglabs/teleport</a>).<p>- We're funded but also early in our lifecycle so it's a unique opportunity to be a major contributor and help to set the tone for the future for our company.<p>To hear more drop me a line directly at jon@rglabsinc.com or contact us via our website (<a href=\"http://www.rglabsinc.com\" rel=\"nofollow\">http://www.rglabsinc.com</a>). We'd love to tell you more.","time":1320159483,"type":"comment"},{"by":"ipster","id":3182284,"parent":3181796,"text":"San Francisco (preferred) / Los Angeles / NYC / Remote - AllTrails - <a href=\"http://www.alltrails.com\" rel=\"nofollow\">http://www.alltrails.com</a><p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails / outdoor activities around you. We're helping people explore the outdoors and having lots of fun in the process. Camping benefits, anyone?<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book on the team.<p>We have the #1 outdoors app in the Apple store and recently launched our Android app. We reach over a million people a month and have been growing rapidly.<p>We're looking for Designers / Front-end Engineers, Back-end Rails Engineers, and Mobile Developers (Android and iOS). Cross-functional and full-stack developers are preferred.<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you!<p><a href=\"http://www.alltrails.com/jobs\" rel=\"nofollow\">http://www.alltrails.com/jobs</a> or justin@alltrails.com","time":1320159111,"type":"comment"},{"by":"ginkgoo","id":3182195,"parent":3181796,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology<p>Ginkgo BioWorks is an MIT spinout that genetically engineers organisms to solve challenges across a range of industries from renewable fuels to pharmaceutical production.  Stop building soulless web apps and work on something that matters:<p><a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a> <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1320158110,"type":"comment"},{"by":"speek","id":3182097,"parent":3181796,"text":"Boston, MA and the greater Boston area<p><a href=\"http://getzazu.com\" rel=\"nofollow\">http://getzazu.com</a><p>We're looking for developers, both engineer-ey and research-ey, who want to help us build the other (more proactive) half of siri. If siri is pull, we're push (read: we tell you what you need to know before you need to know it).<p>If you're interested, ping me at marc@getzazu.com","time":1320156896,"type":"comment"},{"by":"guiseppecalzone","id":3183064,"parent":3181796,"text":"San Francisco - Full Time - <a href=\"https://www.hellofax.com/info/jobs\" rel=\"nofollow\">https://www.hellofax.com/info/jobs</a><p>HelloFax (YCw11) is hiring full time mobile developers. We're building out the paperless office and the iPhone is going to be a key component of it. We have catering 3x per week, an awesome office in lower haight, and a top notch team. Plus, you'll be building something that people already use and pay for.<p>Email me at joseph at hellofax dot com. Would love to talk more about what we're building.","time":1320167961,"type":"comment"},{"by":"famousactress","id":3182866,"parent":3181796,"text":"San Francisco, CA (REMOTE available for the right candidate)<p>Elation EMR ( <a href=\"http://www.elationemr.com\" rel=\"nofollow\">http://www.elationemr.com</a> )<p>We're working on incredibly smart and usable web based tools for physicians and their patients.<p>We're small (6 fulltime people) angel funded and have an incredible list of investors (<a href=\"http://www.elationemr.com/team/\" rel=\"nofollow\">http://www.elationemr.com/team/</a>).<p>We're building with Python, Django, javascript, jQuery, Redis, NodeJS, MySQL, Java, and some other stuff. Particularly, we're really pushing the envelope when it comes to building rich javascript UIs in browser.<p>We're live in a number of practices, and there's still loads of really interesting things to build and make better!\nWe're looking add one or two more people to our incredible team.\n<a href=\"http://www.elationemr.com/jobs/\" rel=\"nofollow\">http://www.elationemr.com/jobs/</a><p>Drop us a line! - Phill","time":1320165452,"type":"comment"},{"by":"bfung","id":3183355,"parent":3181796,"text":"San Francisco, CA or Arlington, VA.  Full Time<p>OPOWER\n<a href=\"http://opower.com/\" rel=\"nofollow\">http://opower.com/</a>\n<a href=\"http://opowerjobs.com/\" rel=\"nofollow\">http://opowerjobs.com/</a><p>We leverage data and behavioral science to change people's energy consumption habits.  Help the environment through energy conservation and help people save money.<p>Java, Rails, Hadoop - we have a culture where taking initiative and having a good design will result in a system in production.<p>Great perks and a chill yet super productive atmosphere.<p>Open positions vary from associate software engineer to lead to management level.  <a href=\"http://hire.jobvite.com/Jobvite/jobvite.aspx?b=nnvY6hwI\" rel=\"nofollow\">http://hire.jobvite.com/Jobvite/jobvite.aspx?b=nnvY6hwI</a>","time":1320171617,"type":"comment"},{"by":"TamDenholm","id":3181863,"parent":3181796,"text":"fixed link for freelancer edition:\n<a href=\"http://news.ycombinator.com/item?id=3181801\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3181801</a>","time":1320154191,"type":"comment"},{"by":"philbo","id":3182473,"parent":3181796,"text":"London, UK - Software Developer (C#, ASP.NET MVC, NHibernate)<p>Frontier Systems is looking for an experienced software developer to join our team in Soho.<p>We are a small, agile team of developers, committed to shipping quality code in regular iterations. Expect to spend your time writing code, talking about new technology, learning new skills and techniques, and producing systems that you are proud of. If you have ideas about new ways of doing things the likelihood is that you will be able to explore those ideas.<p>See more here: <a href=\"http://www.voiceflex.com/jobs/csharpdeveloper\" rel=\"nofollow\">http://www.voiceflex.com/jobs/csharpdeveloper</a>","time":1320161033,"type":"comment"},{"by":"jqueryin","id":3181881,"kids":[3183589],"parent":3181796,"text":"Skookum Digital Works - Charlotte, NC<p><i>We hire people, not positions.</i><p><pre><code>    Language agnostic, but experience with one or more \n    of the following is preferable:\n\n      * Node.JS\n      * PHP\n      * Ruby\n      * Python\n      * JavaScript \n      * HTML5\n      * CSS3\n      * MySQL\n      * NoSQL (primarily MongoDB, Redis, Couch)\n      * Memcached\n\n    We build MVPs for startups and help make their dreams \n    a reality. We're growing like crazy; bolstering up our\n    development team.\n\n    Lots of perks and lots of cool projects to work on.\n    Check the link for more details. Don't let the \n    job post itself discourage you if you don't have the\n    experience mentioned, it was written specifically with\n    our internal Node.JS team in mind. As mentioned before,\n    we hire talented people and not positions. We're just\n    looking for individuals capable of picking up a language\n    on a whim. If you're a PHP guru, I personally need your \n    help. I'm overloaded with multiple startup projects.\n</code></pre>\n<a href=\"http://skookum.com/jobs/web-application-developer/\" rel=\"nofollow\">http://skookum.com/jobs/web-application-developer/</a><p><pre><code>    If you apply, please contact me so I can vouch for you\n    and hopefully get you to the top of the queue. You can\n    also contact me if you want any additional information\n    on the company. I'll give you the lowdown.\n\n    - corey AT skookum DOT com\n</code></pre>\n<i>(formatted for your reading pleasure)</i><i>","time":1320154446,"type":"comment"},{"by":"andrewpbrett","id":3182234,"parent":3181796,"text":"Cake Health, San Francisco, CA, Full Time<p>Lead Developer and Ruby Developer<p>Cake Health is looking for brilliant people to help us build a platform that can fix the U.S. health care system. We believe that your benefits and care options should be described in simple language, that you should always have immediate access to all of your data, and that you should always know what’s covered by your insurance.<p>Our team has built some great momentum in just the last ten months and the product is now open to the public. We've raised money from some of the top angels and funds in Silicon Valley, and have been featured in Forbes, Wired, TechCrunch, Business Insider, and the Financial Times, to name a few.<p>We have a big vision for where Cake Health can go from here, which is why we're looking to build our team. You will be a critical team member that will have significant responsibility. You are bright, hard-working and resourceful, and most importantly, you are excited by the challenges and opportunity for an early-stage startup to change the world.<p>We’re always eager to talk with anyone who has a sharp mind and a passion for detail. Right now we are particularly interested in hiring relentlessly resourceful software engineers who can deliver on key features and delight our growing user base.<p>Read more at <a href=\"https://cakehealth.com/jobs\" rel=\"nofollow\">https://cakehealth.com/jobs</a>. Send your details to jobs@cakehealth.com.","time":1320158606,"type":"comment"},{"by":"lpolovets","id":3182800,"parent":3181796,"text":"Los Angeles or Bay Area or Shanghai preferred, but remote work is possible for exceptional candidates. Full-time only. If you're interested in working remotely, you must live in the U.S. H1B is okay.<p>Factual aims to be the place where people meet to share, improve, and mash-up data. Our vision is to be an awesome and affordable data provider, so that big companies, startups, and developers can focus on innovation instead of data acquisition.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). Last year we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Loopt, SimpleGeo, and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We currently have about half a dozen job openings, from data engineering to software engineering to system administration. For the software engineering position, you would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p>If you're interested in the Bay Area office, it's just starting up, so you'd have a significant influence on the culture there.<p><a href=\"http://www.factual.com/jobs\" rel=\"nofollow\">http://www.factual.com/jobs</a> or you can email me personally at leo -at- factual.com. Thanks for reading!","time":1320164758,"type":"comment"},{"by":"paulitex","id":3183027,"parent":3181796,"text":"Vancouver, BC, Canada. Intern, co-op student, or fulltime.<p>Matygo is building the best learning experience possible online and working to solve the tech skills shortage. Remember Jane from a few days ago? <a href=\"http://news.ycombinator.com/item?id=3175155\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3175155</a>. That's an example of the type of change we want to enable, around the world.<p>We're looking for Interns/Co-ops or Full-timers interested in learning/working in Android or iOS development.<p>We already have a native apps in the store   (<a href=\"https://market.android.com/details?id=com.matygo.matygodroid\" rel=\"nofollow\">https://market.android.com/details?id=com.matygo.matygodroid</a> and <a href=\"http://itunes.apple.com/us/app/matygo/id448728742?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/matygo/id448728742?mt=8</a>). Our platform evolves quickly and most of our current development hours go into platform &#38; web, so we need some help developing our new features on mobile.<p>We're funded by GrowLab, BDC, and other great investors. Our platform has been in use at UBC, SFU and others for over a year and we have thousands of users.<p>Our other technology includes Sproutcore, Scala, and Rails so if you're really interested in those feel free to reach out as well.<p>email careers@matygo.com\nmore hr-type writing: <a href=\"http://www.matygo.com/careers\" rel=\"nofollow\">http://www.matygo.com/careers</a>","time":1320167431,"type":"comment"},{"by":"mkuhn","id":3181904,"kids":[3184408],"parent":3181796,"text":"connex.io in Zurich, Switzerland<p>We are automating our user's address books by creating one unified address book from all their existing ones. To do so:<p>We are hiring Python Devs both for Core and Frontend development. More about what we are looking for (<a href=\"http://blog.connex.io/connexio-is-looking-for-you-searching-a-fullt\" rel=\"nofollow\">http://blog.connex.io/connexio-is-looking-for-you-searching-...</a>) and what we do (<a href=\"http://blog.connex.io/why-we-replaced-syncml-with-our-own-contact-s\" rel=\"nofollow\">http://blog.connex.io/why-we-replaced-syncml-with-our-own-co...</a>)<p>And we are also looking for a Marketeer - <a href=\"http://blog.connex.io/our-product-is-ready-and-we-need-a-cmo\" rel=\"nofollow\">http://blog.connex.io/our-product-is-ready-and-we-need-a-cmo</a>","time":1320154703,"type":"comment"},{"by":"benfwirtz","id":3182231,"parent":3181796,"text":"Cambridge / London, UK - Full Time - <a href=\"http://handyelephant.com\" rel=\"nofollow\">http://handyelephant.com</a><p>Handy Elephant is building a productivity app for business professionals who have to maintain a large number of relationships across multiple channels (e.g. Phone, SMS, Email, Twitter, LinkedIn, Facebook).<p>We have been accepted into a Silicon Valley based Startup Accelerator and are now looking to extend our team of 4 (Android dev, Web Dev, Web &#38; UX Designer, Marketing) with a Web Lead Developer - more details here: <a href=\"http://handyelephant.com/lead-web-developer-wanted/\" rel=\"nofollow\">http://handyelephant.com/lead-web-developer-wanted/</a><p>Why work for us?<p>- Exciting technology, which sits in the intersection of Social Networks, Mobile apps, Data Warehousing and Social Psychology<p>- Beautiful Location, as our office is in Cambridge with an awesome view. Cambridge is well known for it’s vibrant startup, investor and developer community – and a great place to live. And the best thing: No London Tubes, it's all bikes here!<p>- Spend 10% of your time on “building relationships” like all of us do. That could mean being active in local developer groups, stackoverflow, contributing to an open-source project or writing a blog – it’s your choice.<p>- Optionally , come with us to Silicon Valley next year, to join the start up accelerator, and explore the start-up capital of the world.","time":1320158562,"type":"comment"},{"by":"techscruggs","id":3181890,"parent":3181796,"text":"AcademicWorks in Austin, Tx<p>Ruby, Postgres, Redis, AWS, Chef, Rails3.1, Graphite, Resque, the list goes on.<p>We are funded and exceeding all our projected sales goals.<p>Come work in an environment where you can love what you do!<p><a href=\"http://www.academicworks.com/rubyist.html\" rel=\"nofollow\">http://www.academicworks.com/rubyist.html</a>","time":1320154554,"type":"comment"},{"by":"sciurus","id":3183834,"parent":3181796,"text":"Athens, GA - <a href=\"http://eupathdb.org\" rel=\"nofollow\">http://eupathdb.org</a><p>Do you want to contribute to the fight against malaria and other parasites? EuPathDB is looking for a front-end web developer to help scientists perform dynamic computational experiments on genomic-scale datasets. You'll need to be familiar with Java, Javascript, CSS, HTML, and web services. Knowledge of SQL, Perl, Tomcat and Apache are also desirable. For more information, write to at jobs AT apidb DOT org.","time":1320176690,"type":"comment"},{"by":"thomson","id":3183394,"parent":3181796,"text":"Lookout Mobile Security, San Francisco, CA - Full time \n<a href=\"https://www.mylookout.com/about/careers\" rel=\"nofollow\">https://www.mylookout.com/about/careers</a><p>I'm the data scientist here and like every other company we're looking for good people across the board. Lookout is the current leader in consumer mobile security, and we're aiming to keep it that way. We're a small, well-funded team tackling big problems on small devices.<p>Perks include: competitive salary, benefits, mobile phone of your choice, dream hardware setup of your choice, and a new office space in January when we move (We'll be on two floors at Market and 1st). There's also the standard start-up perks like a well-stocked fridge, craft beers on tap, and the fuzzy feeling that comes with shipping meaningful, net-positive products.<p>For engineering, experience in Rails, iOS, Android, and/or network/mobile security are awesome to have, but not required.<p>For data, it'd be cool if you had experience in SQL, R, Python, or Hadoop. If you're interested in machine learning and implementing it, then I'm interested in a conversation with you.<p>We're also looking for PMs and Lead UX Designers.\nRegardless of whatever job position you're interested in, send me an e-mail with questions, resumes, requests for beer, etc. to thomson.nguyen@mylookout.com. (Response guaranteed!)","time":1320171947,"type":"comment"},{"by":"nelken","id":3182632,"parent":3181796,"text":"Cambridge MA, <a href=\"http://www.outbrain.com/jobs/BO#1\" rel=\"nofollow\">http://www.outbrain.com/jobs/BO#1</a>\nOutbrain is seeking a Research Engineer for its Boston location. We are a startup company providing content recommendations for many premium publisher sites and blogs. In fact, you are more than likely to have seen our recommendation links, and may have clicked on them without realizing we were generating them automatically (for instance on Boston.com, USA TODAY, Slate, and many more). Our goal at Outbrain is to provide readers with the best recommendations possible. As a research engineer you will contribute directly to the algorithms driving these recommendations.<p>You will need a firm foundation in computer science and strong Java development experience, plus background in machine learning. We are looking for a smart engineer, with practical know-how, good work discipline, and willingness to learn and have fun.<p>Requirements:\nExcellent Java implementation skills. Experience with Spring, Tomcat, Hibernate, Solr/Lucene, Mahout.\nBackground in Machine Learning / Statistical Natural Language Processing / Information Retrieval.\nKnowledge of scripting languages a plus (e.g. Python)\nComfort developing on UNIX/Linux.","time":1320162891,"type":"comment"},{"by":"willowgarage","id":3182736,"parent":3181796,"text":"Palo Alto, CA<p>Telepresence Robotics<p><a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>Suitable Technologies is a startup working to create an innovative new product for something called \"remote presence.\" (Another common term is \"robotic telepresence.\")<p>Our first product, in development now, is similar to video chat on a computer you can drive around. Unlike videoconferencing, you’re not stuck to a wall or desk. It becomes your physical presence, anywhere in the world, with the freedom to move and interact with people as if you were there. Our technology has already been seen by millions of people, and we think the potential impact is substantial.<p>We're looking for great engineers and designers. We need help in C++, multimedia, test and verification, web frontend and backend, UI/UX design, electrical, networking, and more. We think this could be a unique opportunity for someone with experience in web or mobile to work on something a little different.<p>We have funding, offer competitive compensation and benefits, and provide perks such as food and ping pong.<p>Candidates must be authorized to work in the U.S.<p>More information is available on our site: <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>Contact: jobs@suitabletech.com","time":1320163975,"type":"comment"},{"by":"davidblondeau","id":3182500,"parent":3181796,"text":"Burligame, CA - Collaborative Drug Discovery (CDD) (<a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>)<p>CDD is growing and financially stable. Our software helps scientists manage, analyze and collaborate around their drug discovery data (chemistry and biology). We are are in a great position to support the evolution towards more collaboration, specialization and distribution in a market that has been historically closed and secretive. The model has been successful with academic labs, small biotech startups and very large collaborations (like the Gates foundation TB initiative or MM4TB in Europe). We are now gaining some traction with government agencies and the big pharmaceuticals.<p>I am hiring a full-stack software developer (<a href=\"https://www.collaborativedrug.com/pages/employment#h-1\" rel=\"nofollow\">https://www.collaborativedrug.com/pages/employment#h-1</a>). As one of three developers, you need to be comfortable working or interested in building expertise at every level of the stack. Experience or interest in system administration and operations is nice to have though not required. We have many projects involving data visualization, data processing, scaling, security, privacy and other software challenges to make our scientific application collaborative, engaging and rewarding.<p>It is perfectly OK if you do not have experience with any of the languages or technologies we currently use (Rails/Ruby/JS/MySQL/Solr...) as long as you can learn those quickly.\nCDD is a great place if you want to have a lot of impact and like to take on projects and responsibilities.<p>If you are interested, contact work@collaborativedrug.com, you will get an answer from one of the developers (we do not have recruiters or HRs).","time":1320161347,"type":"comment"},{"by":"olkie","id":3194011,"parent":3181796,"text":"NYC H1B shopkeep.com<p>The most dangerous labor of all was the twelfth and final mission. Eurystheus ordered Hercules to kidnap the beast called Cerberus who guards the gates of hell - the brazed voiced hound of Hades and a monster not to be overcome and that may not be described, who eats raw flesh, fifty headed, relentless and strong. Near the gates of Acheron, a weaponless Hercules found the beast waiting for him. He resembled a retailer’s point of sale system.<p>You are a Hercules incarnate. Your weapons will include CoffeeScript, Ruby, JVM, Mac/Win/Lin[1], iOS, Android, maybe even a little C. Help us crush the mediocre POS industry incumbents. Multiple headed beasts, they are tired, decadent organizations and veritable deserts upon which the seeds of innovation and creativity find no purchase.<p>ShopKeep is fixing point of sale and becoming the “last mile” for local. A profoundly disruptive solution, we have established a beachhead in a sector in dire need of innovation. A well funded NYC based startup, we are fixing technology depressed, mind numbingly overpriced, and overly complex POS solutions and making them less expensive and highly customizable for both very large and very small customers.<p>Help us as we take this battle to the next level. You will lead the development of our products. Your releases will immediately be running[2] in thousands of actual brick-and-mortar stores. Like this one <a href=\"http://bit.ly/tEn61i\" rel=\"nofollow\">http://bit.ly/tEn61i</a>. And this one <a href=\"http://bit.ly/w1n3vc\" rel=\"nofollow\">http://bit.ly/w1n3vc</a><p>Contact jasonrichelson on github or david@shopkeep.com for more info...<p>[1]Don't worry, the Mac/Win/Lin registers consist almost entirely of cross-platform code \n[2]CI + better auto-updating than Chrome!","time":1320360139,"type":"comment"},{"by":"alex_mallet","id":3182821,"parent":3181796,"text":"Seattle, WA -- AWS Relational Database Service. Full time.<p>We're looking for developers and development managers.<p>The AWS Relational Database Service is one of the fastest-growing AWS businesses, providing super-simple provisioning and management for databases in the cloud. Customers can set up a new database with just a few clicks, and complex administrative tasks like scaling, fail-over, and monitoring are all reliably handled by our control systems.<p>Providing such simplified management for customers comes with the challenge of building sophisticated and reliable control systems. We work on many hard problems: high-performance online transaction processing; partitioned,replicated, real-time, in-memory processing; and large-scale, high-throughput batch jobs. We not only work on deep technical problems, but also use a wide array of technologies, ranging from the various database engines we support(MySQL and Oracle currently) to just about every other AWS service, and many open-source components.<p>Please email a resume to malleta at amazon.com if you're interested.","time":1320165014,"type":"comment"},{"by":"sahil_lmn","id":3183086,"parent":3181796,"text":"Reston, VA (west of Washington, DC) - FULL TIME, INTERN, CONTRACTOR (H1B maybe if already in US)<p>Lucidmedia Networks - <a href=\"http://www.lucidmedia.com\" rel=\"nofollow\">http://www.lucidmedia.com</a><p>Internet ad network startup looking primarily for Java developers (experience with SQL and front-end web experience would be great too). The Internet advertising industry is quite complex behind the scenes and somewhat parallels the structure of the financial markets. We are analogous to a high frequency trading firm, buying page views to serve ads in real-time on exchanges like that of Google or Yahoo. Our server software runs on Spring, MySQL, Redis, and AWS at a glance. We handle at least a billion page impressions a day. Big data, big throughput.\nSmall yet experienced team, catered lunches _everyday_, your choice of Mac or PC (dev team is almost all Mac now), good benefits. Our office has superhero posters all over the walls.<p>Contact me directly at sahil_lmn@yahoo.com.<p>I actually got hired through a HN \"Who is Hiring\" thread. These things do work!","time":1320168203,"type":"comment"},{"by":"grimborg","id":3182676,"kids":[3185925,3184361,3184159],"parent":3181796,"text":"Good ol' Europe is hiring too! We are in Groningen, Netherlands. We are Paylogic and we sell event tickets in high traffic peaks. We have our own Python app and a growing team of developers.<p>Here's what the company says:<p>Paylogic is an extensive Internet application that has to meet the highest standards regarding scalability, availability and security. We always have room for skilled and passionate software developers that want to work with cutting edge Internet technologies in a highly demanding environment and with some of the best Python developers around. Sharing knowledge and having fun are important qualifications of the Paylogic culture!<p>And here's what I, as an Architect and former developer there, say:<p>In the dev team we are driven, nonconformist and imaginative. You don't need to be an expert in Python/Django/SQLAlchemy, but the more you know the better.<p>It's a very nice place to work. Work is interesting, and if you like challenges, you won't be bored. There is no excessive pressure and extra hours are something rare.<p>E-mail: oscar.vilaplana@paylogic.eu","time":1320163333,"type":"comment"},{"by":"NateLawson","id":3182392,"parent":3181796,"text":"Root Labs - Oakland, CA<p>We are a fully-funded startup with a major paying customer, building a web-based service for analyzing and searching code. You will be in charge of building a large, distributed computing system for parsing and indexing code for our search engine. We've been creating the code analysis tools for existing customers, and we need you to build the automation framework to help us scale. We are building something really uncommon for a HN hiring thread, so contact me even if you're just curious!<p>We're solving problems that will have a major impact on the software industry. For example, one goal is that independent, open-source authors have a way to get paid for their work.<p>You'll team up with us to implement solutions to some challenging problems. (But don't worry, you don't already need to be an expert at all of these).<p><pre><code>    * Nearest-neighbor search in high dimension (or knowing how to\n      avoid this by projecting to a lower dimension)\n    * Classifying code by various metrics (structural flowgraph analysis,\n      symbol sequences and frequency, etc.)\n    * Map/reduce deconstruction of complex queries\n    * Distributed computing design, cluster management, software deployment,\n      load balancing \n</code></pre>\nBeing a good programmer is the most important part. We mostly work in Python and C/C++. We use PostgreSQL, Redis, and Riak for a lot of the existing components.<p>You need to understand distributed computing, fault detection and error recovery, messaging, etc. An interest (but not expertise) in low-level details like compilers, operating systems, and reverse-engineering is a good plus.<p>We have much more details and contact info here:<p><a href=\"http://www.rootlabs.com/developer-job.html\" rel=\"nofollow\">http://www.rootlabs.com/developer-job.html</a><p>If you have any questions, you can also just email me at the address in my profile. Thanks!","time":1320160216,"type":"comment"},{"by":"rw","id":3182523,"parent":3181796,"text":"New York, NY (in NoHo on Broadway). Full time and internships.<p>QLabs<p>We're a new type of in-house incubator: we prototype startups by building and launching an MVP every 6-8 weeks. This is like startup boot-camp. Come hack with us on amazing projects, learn everything there is to know about building and launching products and starting companies, all without the painful early-startup salary.<p>We take an aggressive approach to learning and inspiration.  Example: six weeks ago, our team spent the day at MIT's Media Lab, where we learned about biomechatronics, fluid interfaces, and more. Even though our primary tool is Rails, half of us just learned nodejs for a two-week 'sprint project'.<p>The lab started in February of this year, and now has five awesome developers (hailing from Columbia, Disney Imagineering, ITP, NYC Resistor, and more). We're looking to fill position #6.<p>Show us your projects: we love to see an entrepreneurial streak and a diversity of experience.<p>Email me at rw@rwinslow.com if this appeals to you!","time":1320161628,"type":"comment"},{"by":"aginsburg","id":3185484,"parent":3181796,"text":"San Francisco, CA; Full-time; H1Bs welcome<p>Nextdoor -- <a href=\"http://nextdoor.com/\" rel=\"nofollow\">http://nextdoor.com/</a><p>Nextdoor is a private social network for neighborhoods, where neighbors can talk online and help make their community better in the real world.  People are using Nextdoor to find a trustworthy babysitter, organize a garage sale, ask for help locating a lost pet, and exchange many other kinds of help and information with their neighbors.<p>We're a venture-backed startup company of 23 people in downtown SF.  We just launched our product last week, and are looking to grow with a few more key hires--particularly software engineers and product designers.  If you like (some or all of) Python, jQuery, AWS, geospatial data, clean and usable design, a fast-paced startup environment, please take a look at our job opportunities, and we'd love to hear from you.<p><a href=\"http://nextdoor.com/jobs/\" rel=\"nofollow\">http://nextdoor.com/jobs/</a>","time":1320209688,"type":"comment"},{"by":"dabent","id":3182682,"kids":[3183606,3182798],"parent":3181796,"text":"Santa Monica, CA (Los Angeles area) also possibly SF Bay area or other cities, but most jobs are in Santa Monica.<p>TRUECar - Put simply, TrueCar shows consumers how much people actually paid for a particular new car in their area, then guide them to dealers we've certified.  We bring transparency to auto pricing and so far we are getting a solid piece of a huge market.<p>* JAVA - We are looking for talented Java developers and architects to design and build the technology used to power our production websites, APIs, widgets, and internal tools.  This is a chance for you to join a rapidly growing company and build something that's going to to scale to support millions of users/visitors and provide them with all kinds of data.<p>* We're also looking for front-end engineers, QA engineers and even Python/Django folks like me.<p>My story - moved from Atlanta all the way out to Santa Monica after stopping by the TrueCar booth at PyCon 2011.  I started here two months ago and have absolutely loved it.  I'm working with a great team that knows how to develop software and for management who seems to \"get it\" with regards to software developers.<p>We're all in open workspaces that are just blocks from the beach.  My building has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>).  TrueCar has great benefits, including company equity, 100% paid family medical, dental, vision, and a healthy 401k.  They also offer gym membership reimbursement ($50 a month), 12 holidays, career training, 3 weeks PTO and have a kitchen stocked with fruit, snacks and such.  I've honestly never had a job this good.  We're also making money and recently got some really solid investment (<a href=\"http://techcrunch.com/2011/09/07/car-price-comparison-company-truecar-raises-200m-gears-up-for-ipo/\" rel=\"nofollow\">http://techcrunch.com/2011/09/07/car-price-comparison-compan...</a>).<p>If you're interested, send me your resume.  My email is in my profile.","time":1320163385,"type":"comment"},{"by":"mrgordon","id":3183063,"parent":3181796,"text":"San Francisco, CA - Full Time - <a href=\"http://www.crowdflower.com\" rel=\"nofollow\">http://www.crowdflower.com</a><p>CrowdFlower is changing the way work gets done, and we want you to help. Our technology platform takes large, data-heavy projects and breaks them into small tasks that are distributed to a multi-million-person, on-demand workforce around the world. Our technology then aggregates the results while performing continuous quality control, allowing us to deliver best-in-class results in record time.<p>This week we're hosting CrowdConf, the largest conference on crowdsourcing and distributed work, and we have previously published papers about our work with the crowd.<p>Hiring for:<p>- CrowdSourcing Solutions Engineer<p>- Development Operations Lead / Manager / Director<p><a href=\"http://crowdflower.com/about/jobs\" rel=\"nofollow\">http://crowdflower.com/about/jobs</a><p>Feel free to contact me (matt.gordonATcrowdflower.com) with questions or for more information.","time":1320167954,"type":"comment"},{"by":"jedberg","id":3182423,"kids":[3182602],"parent":3181796,"text":"Los Gatos, CA Netflix<p>Looking for Senior SREs.<p>Basically, we're starting a new company to take streaming global and make it so convient that it is better than the free options.<p>I'm looking for people to help make sure that any time someone wants to find and play a movie, they can.<p>We're solving lots of really interesting problems, like how do you maintain a reliable service on hardware that is unreliable and you don't control (Amazon Web Services).<p>Our group also gets to help teach other groups how to build for scale.<p>Come join me!<p>You can get more info here: <a href=\"http://jobs.usethesource.com/item?id=166\" rel=\"nofollow\">http://jobs.usethesource.com/item?id=166</a><p>Or here: <a href=\"http://www.reddit.com/comments/jyaqd/\" rel=\"nofollow\">http://www.reddit.com/comments/jyaqd/</a><p>Or here: <a href=\"http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr\" rel=\"nofollow\">http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr</a>","time":1320160478,"type":"comment"},{"by":"andreshb","id":3182585,"parent":3181796,"text":"Onswipe • New York, NY • Front-End CSS3/JS Engineer (Touch)<p>Come work with a small entrepreneurial team of talented hackers that seek to push the boundaries of the web experience on touch devices.<p>We are looking for someone who loves Javascript, and stays framework agnostic.  Someone who dreams in HTML5 and sees the world in CSS3 Gradients. Previous experience working or experimenting with touch interactions in mobile webkit safari is highly valued.<p>Above all, we need a self starter who wants to be a part of designing and creating excellence.<p>• Relocation Allowance<p>• We sponsor H1B if really talented and can travel to the U.S. for an interview<p>About Onswipe: Onswipe is a publishing and advertising platform for touch enabled devices. We provide a touch-enabled native app-like experience for content on the browser.<p>more info: <a href=\"http://bit.ly/qTYfUa\" rel=\"nofollow\">http://bit.ly/qTYfUa</a><p>Contact me<p>a@onswipe.com","time":1320162320,"type":"comment"},{"by":"jordanlewis","id":3183251,"parent":3181796,"text":"New York, NY - Full Time - <a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a><p>Knewton is looking for software engineers and data scientists with superior problem solving and coding skills.<p>Knewton is poised to revolutionize the practice of education with the worlds most powerful adaptive learning engine. We recently raised the biggest VC round ever for an education company and have now partnered with Pearson to power most of the world's largest publisher's digital products.<p>Knewton was recognized as a Technology Pioneer for 2011 from the World Economic Forum in Davos and was voted one of the top 25 best places to work by Crains New York Business.<p>Go to our jobs page and say hi. <a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a>","time":1320170123,"type":"comment"},{"by":"exogen","id":3182464,"parent":3181796,"text":"Seattle, WA - BigDoor - <a href=\"http://www.bigdoor.com/\" rel=\"nofollow\">http://www.bigdoor.com/</a><p>We're a gamification platform – we make it easy for anyone to add fun, relevant loyalty programs to their site or app. Lots of people are focused on badges and leaderboards – and we do that – but we consider that the simple stuff. We're way ahead of that. We're also working with major brands (a few I can mention: Major League Baseball, MTV, Dell).<p>We're venture-backed, still small but growing fast.<p>Positions:<p>* Full-stack web developer: Python, Django, JavaScript.<p>* Devops: Linux, Apache, MySQL.<p>* MySQL DBA with AWS experience.<p>* Content manager (aka Quest Master): Help our bigger partners create and maintain their virtual economies.<p>Don't be shy: hr@bigdoor.com<p><a href=\"http://www.bigdoor.com/about-us/careers/\" rel=\"nofollow\">http://www.bigdoor.com/about-us/careers/</a>","time":1320160987,"type":"comment"},{"by":"rmorrison","id":3182889,"parent":3181796,"text":"Palo Alto, CA - Comprehend Systems (YC W11)<p>Hiring frontend and backend developers with solid CS skills to help us make cross-datasource visualization and analytics software.<p>email me {my username}@comprehend.com or visit <a href=\"http://www.comprehend.com\" rel=\"nofollow\">http://www.comprehend.com</a>","time":1320165696,"type":"comment"},{"by":"sebilasse","id":3182421,"kids":[3186801],"parent":3181796,"text":"Amsterdam, Netherlands, FULL-TIME - REMOTE options<p>Experienced hacker in one or more: Ruby, Rails, Javascript (jquery, backbone, etc).<p>We answer questions like: how much less co2 is emitted if everybody switched to electric cars. How can you replace nuclear plants with alternatives.<p>We're a charming Dutch (almost grown up) startup, with Central office location, great engineering-driven team. Healthy work-life balance.<p>Our code is both a lot of plain Ruby code, front end code, admin code, glue code. There is something for everyone.<p>You are an experienced hacker, you think lean and pragmatic and solve problems creatively. You're proactive, prefer fixing over complaining. Order of preference: Dutch, Europe, World.<p>send me a mail with short introduction and code samples (ruby, javascript) to u57i942v0n@tempalias.com","time":1320160475,"type":"comment"},{"by":"MBAANDCOMPANY","id":3182188,"parent":3181796,"text":"FT - Lead Java Developer - London - MBA &#38; Company (www.mbaandco.com) is a startup marketplace for high end freelance management consultants and has won multiple awards and has recently been selected as one of the top 10 most disruptive new brands in the UK by Real Business magazine.  Having originally outsourced our development we are now looking for a skilled java developer to help rebuild and refine our existing platform.  With the ability to eventually build and lead a team we are looking for a responsible and enthusiastic developer who enjoys startups and rewards that come with it.  £45k plus equity options based on achievement of goals. If of interest then email daniel@mbaandco.com","time":1320158002,"type":"comment"},{"by":"kevinburke","id":3183620,"parent":3181796,"text":"San Francisco, CA. Full time and internships.<p>Twilio makes it easy for you to build webapps that communicate. We offer a restful API that lets you use your existing web languages and skills to build voice and SMS applications. We focus on building a simple, powerful, pay-as-you-go communications platform so that you can focus on what you do best.<p>We're growing like crazy, and hiring for many positions: <a href=\"http://www.twilio.com/company/jobs\" rel=\"nofollow\">http://www.twilio.com/company/jobs</a>. One of the best ways to get your resume to the top of the pile is to show off an app you build using Twilio.<p>All of our engineering positions are for our San Francisco office, but we are also looking for a Developer Evangelist in London.","time":1320174594,"type":"comment"},{"by":"themcgruff","id":3182206,"parent":3181796,"text":"37signals - Chicago, IL\n(Remote - Work from anywhere)<p>2x DevOps guys or girls.<p><a href=\"http://jobs.37signals.com/jobs/9730\" rel=\"nofollow\">http://jobs.37signals.com/jobs/9730</a>","time":1320158273,"type":"comment"},{"by":"brianjolney","id":3182248,"parent":3181796,"text":"New York, NY - Contract, INTERN<p>Vita Coco (coconut water) - <a href=\"http://vitacoco.com\" rel=\"nofollow\">http://vitacoco.com</a><p>We package and sell the #1 brand of all natural coconut water in the US. Our investors include Madonna, Demi Moore, AROD, &#38; more. We're probably at your local grocery store, drug store, or corner deli!<p>We're seeking a tech generalist, who can own projects such as deploying ipads and developing MVP style applications for our sales team, using NFC/RFID technology along with FB &#38; other social API's to do some really cool physical checkins with our field marketing teams, and lots more.<p>EDIT: Almost forgot, the gig includes all the Vita Coco you can drink!<p>If this sounds like you, email me at bolney@vitacoco.com and let's chat.","time":1320158725,"type":"comment"},{"by":"mattyfo","id":3182240,"parent":3181796,"text":"Baltimore, MD - Full Time &#38; Interns - <a href=\"http://www.mindgrub.com/careers\" rel=\"nofollow\">http://www.mindgrub.com/careers</a><p>I'm an information architect at Mindgrub and I love it. We're a growing agency that has some of the best mobiel and web developers in Baltimore. We've worked on interesting projects for Dell, Geico and other clients. We're currently growing really fast and need to add people to our team in the next six months.<p>We're looking for mobile developers, web developers and design minded folks. We're looking for both full-time and interns. We actually take a lot of interns from UMBC as we're located a mile and half away from the campus.<p>If you're interested please get a hold of me at mforr@mindgrub dot com.<p>Thanks!","time":1320158650,"type":"comment"},{"by":"billpaetzke","id":3183339,"parent":3181796,"text":"Los Angeles <a href=\"http://www.leads360.com\" rel=\"nofollow\">http://www.leads360.com</a><p>OpenVBX Developer | Short-term, remote-friendly, US citizen only<p><a href=\"http://engineering.leads360.com/post/12202543481/openvbx-developer\" rel=\"nofollow\">http://engineering.leads360.com/post/12202543481/openvbx-dev...</a><p>Front-End UI/UX Engineer | Full-time, on-site, H1B-friendly<p><a href=\"http://engineering.leads360.com/post/11740013553/were-hiring-front-end-engineer\" rel=\"nofollow\">http://engineering.leads360.com/post/11740013553/were-hiring...</a><p>QA Analyst | Full-time, on-site, H1B-friendly<p><a href=\"http://engineering.leads360.com/post/11881785761/were-hiring-qa-analyst\" rel=\"nofollow\">http://engineering.leads360.com/post/11881785761/were-hiring...</a>","time":1320171389,"type":"comment"},{"by":"osteele","id":3184705,"kids":[3186902],"parent":3181796,"text":"Nest Labs, Palo Alto, CA<p><a href=\"http://www.nest.com/careers/\" rel=\"nofollow\">http://www.nest.com/careers/</a><p>We make the Nest Learning Thermostat.<p>Nest is a fantastic company, a great group of people, and a dream product (IMO).<p>We're looking for hardware and software engineers; developers, testers, and project and program managers. Web server, web client, firmware, algorithms, mobile, analog hardware, RF hardware—we had an amazing launch and now we're hiring across the company.<p>Nest Labs is a mile from California Ave. and the Caltrain. There's bikes at work, taco truck on Tuesday, and we're within running distance of the Stanford Dish. We work and play hard; we're passionate about what we do. Sound like you?<p>+INTERN +H1B","time":1320191369,"type":"comment"},{"by":"BenS","id":3182956,"parent":3181796,"text":"Downtown Palo Alto, CA - Software Engineer, Data Scientist, Product Designer (Full-time)<p>* We are building a new way for people to share and discover things they love. Pinterest is one of the fastest growing social services in the world.<p>* We are a small team (9) and we are passionate about building a product that hundreds of millions of people use every day. We want to build a company where we can work for years to come.<p>* We ship quickly and iteratively. We care about quality. We take design seriously.<p>* We are well-funded and work hard to create an environment where people can do great work.<p><a href=\"http://pinterest.com/about/careers/\" rel=\"nofollow\">http://pinterest.com/about/careers/</a>","time":1320166595,"type":"comment"},{"by":"kleinsch","id":3182438,"parent":3181796,"text":"McLean, VA (Just outside Washington, DC)<p>Ringio ( <a href=\"http://www.ringio.com\" rel=\"nofollow\">http://www.ringio.com</a> ) - Full Time<p>Ringio provides internet phone service to small businesses to improve the quality of their phone interactions. We're looking for a few great software engineers to help take our product to the next level. If you're interested (or know someone who is), read more and give us your info at <a href=\"http://ringio.wufoo.com/forms/ringio-software-engineer/\" rel=\"nofollow\">http://ringio.wufoo.com/forms/ringio-software-engineer/</a> or email nick AT ringio.com<p>Major areas of development focus:<p>* Modern HTML Applications - We’re very excited about the JavaScript frameworks that have grown in popularity the last few years (like Backbone.js, ExtJS, or SproutCore). We’re interested in using web technologies for our mobile and desktop applications, so if you’re experienced with (or just interested in) JavaScript, CoffeeScript, SCSS, WebSockets, or BOSH, there’s a lot of research and development to be done.<p>* Voice Technology - All calls using Ringio run through our voice systems to enable things like on-hold music, call screening, and transfers. We have a lot of new voice functionality that we’d like to build, as well as technology we’d like to integrate. This is fairly unique to our industry and involves some interesting timing, concurrency, and state management problems.<p>* API Development - Integration with CRM systems and reselling partners requires APIs for large pieces of our platform. We need help expanding our APIs, making sure they’re usable and secure, and testing that they’re working correctly.<p>We’re Looking For People Who Are:<p>* Smart software developers<p>* Familiar with object oriented programming. We use Grails and Java for our major systems. Grails, Groovy, or Java experience isn’t required, but you’ll be expected to get up to speed quickly.<p>* Familiar with Unix/Linux command-line systems. Logging into a Linux server to count the number of ERROR lines in a log file grouped by hour wouldn’t be difficult for you.<p>* Excited about joining a startup<p>* Authorized to work in the US<p>* Able to work from our McLean, VA office (flexibility to work from home sometimes, but most time will be at the office)<p>If you're interested, check out <a href=\"http://ringio.wufoo.com/forms/ringio-software-engineer/\" rel=\"nofollow\">http://ringio.wufoo.com/forms/ringio-software-engineer/</a> or email nick AT ringio.com","time":1320160688,"type":"comment"},{"by":"squirrel","id":3182802,"parent":3181796,"text":"London (UK) and Boston (US). Graduates and interns please!<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're focussed on hiring graduate developers and interns at the moment. See <a href=\"http://devblog.timgroup.com\" rel=\"nofollow\">http://devblog.timgroup.com</a> and <a href=\"http://www.timgroup.com/careers\" rel=\"nofollow\">http://www.timgroup.com/careers</a>.<p>Note we recently changed our name from youDevise to TIMGroup but we're still the same folks!","time":1320164790,"type":"comment"},{"by":"okalex","id":3188856,"parent":3181796,"text":"Portland, OR | Full-Time | AppFog<p>Developers and Designers<p>AppFog (PHP Fog) is the leading platform-as-a-service built specifically for PHP. We have spent a lot of energy iterating on feedback from our users (over 2000 detailed surveys) to build a really great product that appeals to a large and growing user-base (over 15,000 people have signed up and growing). On top of that, we have put together a team of exceptionally talented developers. We are O’Reilly authors, open-source contributors and we enthusiastically ship code.<p>For more details visit <a href=\"http://appfog.jobscore.com/\" rel=\"nofollow\">http://appfog.jobscore.com/</a>","time":1320266840,"type":"comment"},{"by":"benjisg","id":3185651,"parent":3181796,"text":"Want to see all of these jobs mapped out by location?<p><a href=\"http://www.hiringhackers.com/\" rel=\"nofollow\">http://www.hiringhackers.com/</a><p>The postings from this thread have now been made the current data set as of November 1st, 2011 11:20PM PST","time":1320215212,"type":"comment"},{"by":"healsdata","id":3182347,"parent":3181796,"text":"King of Prussia (Near Philadelphia), Pennsylvania. Full Time.<p>ReminderMedia helps businesses solidify their key relationships to drive repeat business and referrals. We currently do this with American Lifestyle magazine, a customizable publication.<p>We're looking for a full-time software developer to help us with our custom CRM, printing software and account interface.<p>Check out our latest posting online here: <a href=\"http://remindermedia.com/careers/show/position/4508\" rel=\"nofollow\">http://remindermedia.com/careers/show/position/4508</a> or email us at itjobs@remindermedia.com","time":1320159787,"type":"comment"},{"by":"ericedge","id":3182338,"parent":3181796,"text":"San Francisco, CA; New York City, NY; Mumbai, India<p>At Flurry we're elbows-deep in the backstage of the smartphone industry, mixing metaphors like nobody's business.<p>Business is booming at Flurry, so we're hiring for a wide range of engineering positions: iOS and Android software, operations, backend software, analytics, and if you're looking for a data scientist opportunity, Flurry is looking for you!<p>Business Development opportunities also abound!<p>Check out our opportunities at <a href=\"http://www.flurry.com/jobs\" rel=\"nofollow\">http://www.flurry.com/jobs</a> and tell 'em Eric sent ya.","time":1320159622,"type":"comment"},{"by":"esalazar","id":3182510,"kids":[3182535],"parent":3181796,"text":"Winston Salem - Developer Employee #1 at Startup\nThis position is for developer employee #1 at a web/mobile consumer internet startup in Winston-Salem (not corporate/B2B - we work for the masses!).   We are <a href=\"http://dittit.com\" rel=\"nofollow\">http://dittit.com</a> (checkout staging.dittit.com also which shows our upcoming beta).<p>Being employee number one means you will wear many hats: coding, going to events, coding, feature planning, coding, etc, etc.  You will work daily with the two founders.<p>We are looking for all the normal things: intelligence, quick learner, etc, but even more important is fit.  Since you will be working with us every day, we want to make sure that you have the same values and likes as us and that you are passionate about creating an awesome product that will change people’s lives and raise mountains of money for charities!<p>Responsibilities\n* Coding!! (front end/backend/mobile/??)\n* A/B testing\n* Unit/TDD/BDD testing\n* Scripting: continuous testing and deployment\n* Ping pong!\n* Other startup stuff<p>Requirements:\n* Code and be able to pick up new languages/libraries/tools fast\n* Decent knowledge of either Mac/Linux/Unix command line (We are a RoR shop which means no windows!).  We can teach you RoR but we don’t want to teach bash.\n* A good fit with the founding team\n* Believe in the project<p>Bonus Points\n* RoR, Javascript, CSS, HTML\n* Other MVC frameworks, Node.js, AWS\n* GIT\n* IOS, Android development","time":1320161475,"type":"comment"},{"by":"fapi1974","id":3194493,"parent":3181796,"text":"SF Bay Area.  Full Time.  Founding Team.  www.cinecandy.com<p>I am the founder of Cinecandy, the world's first Movie Studio As A Service (MSAAS, for cute).  I've spent the past year solo and I am looking for a programmer and a designer.<p>Think of what moviemaking is: a writer, a director, some actors, a post production crew, and ultimately distribution. If you think which parts of moviemaking have been disrupted by technology, really only distribution has. The creation of movies, however, has not!<p>My vision is to completely automate the moviemaking process, from scripting, to directing, acting, post-production, and distribution.  And Cinecandy will make it so easy that anyone can do it, and do it with their friends.<p>The first step in achieving that vision is a tool that will let people easily create group videos with their friends for special occasions.  The example I like to use is the video shown at a wedding by the Best Man while he gives a speech - lots of well-wishing from friends and family in the video.<p>Because this initial set of users will show their videos in public, they are willing to pay for an automatically produced video.  More if it's professionally edited.<p>I sold my last startup (www.gamemaki.com) and had a major flop with an app earlier this year:<p>allthingsd.com/20110425/meet-remember-it-an-iphone-app-born-of-a-hangover/<p>But I ship product and this one has me pretty stoked.  More about me in my HN profile.  Do reach out - I love talking about my baby!","time":1320369160,"type":"comment"},{"by":"dguido","id":3182287,"kids":[3188536],"parent":3181796,"text":"New York City, Seattle, and San Francisco - iSEC Partners - Application Security Consultants<p>iSEC Partners is currently looking for Security Researchers and security-focused software developers to fill openings in its application security consulting practice. We are seeking entry, senior and principal level candidates. Job duties will include project delivery within iSEC consulting engagements and cutting-edge research into current technologies and attacks.<p><a href=\"http://www.isecpartners.com/careers/\" rel=\"nofollow\">http://www.isecpartners.com/careers/</a><p>iSEC Partners is a proven full-service security consulting firm that provides penetration testing, secure systems development, security education and software design verification. iSEC Partners' security assessments leverage our extensive knowledge of current security vulnerabilities, penetration techniques and software development best practices to enable customers to secure their systems against ever-present threats on the Internet.<p>Primary emphasis is placed upon helping software developers build safe, reliable code. Areas of research interest include application attack and defense, web services, operating system security, privacy, storage network security and malicious application analysis.<p>Our goal is to create a new standard for customer satisfaction and become the pre-eminent leader in security consulting, research and tool development.","time":1320159147,"type":"comment"},{"by":"200902","id":3182087,"parent":3181796,"text":"Cyrus Innovation. NYC. Full time.<p>Cyrus Innovation (www.cyrusinnovation.com) is a small (~40 people) NYC-based Agile development consulting firm. As pioneers in Agile methodology, we pride ourselves on being named one of Inc 5000’s fastest growing companies for three consecutive years. We embrace the latest Agile practices, open source tools, and strive for continuous process improvement. We provide XP teams on demand to both start-ups and enterprise organizations. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you.<p>What you can enjoy at Cyrus:<p>- A true 40 hour work week. Period.<p>- Health, Dental, Vision, 401(k)<p>- An annual personal budget and paid time off for professional development<p>- Experience working with languages including Java, Ruby, Groovy, Scala, and Javascript<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. We care more about your desire for clean code than your years of experience. If you’re a talented and hard-working developer who is as enthusiastic about Agile as we are, we would love to hear from you. We are serious about our commitment to our employees and invite you to join our team.<p>If you think Cyrus might be a good fit for you, feel free to send me a message or shoot me an email at mrosenberg@cyrusinnovation.com to set up a time to talk further.","time":1320156720,"type":"comment"},{"by":"andrew93101","id":3183159,"parent":3181796,"text":"Software Engineers (Santa Barbara, CA) (Candidates must be willing to relocate to Santa Barbara. H1B candidates are welcome.)<p>AppFolio is the fastest growing provider of online property management software. Our company was founded by a team of technology leaders with many years of experience developing Software-as-a-Service applications. We believe that a small group of passionate people can deliver extraordinary results. We believe in focus and know we can only do a few things really, really well. Our company is experienced and built to last.<p>AppFolio software engineers work to build scalable, robust and easy to use solutions to complex business problems. Delivering intuitive and responsive applications over the web requires us to solve both difficult engineering and product design problems.<p>AppFolio wants creative and independent engineers who are comfortable with a high degree of autonomy and an agile, collaborative work environment. If you are a smart, versatile software engineer with a desire to work with the following technologies, we'd love to hear from you:<p>Rails 3.1\nMySQL/MongoDB\nJavascript/jQuery/Backbone/CoffeeScript\nHTML5/CSS3/Sass/Asset Pipeline\nSOA/REST/JSON/XML\niPhone (iOS) and Android development\nApache Solr/Lucene search technology\nNginx/Passenger<p>To learn more about working at AppFolio, please visit <a href=\"http://www.appfolio.com/jobs\" rel=\"nofollow\">http://www.appfolio.com/jobs</a>.  To apply, please see <a href=\"http://hire.jobvite.com/j/?aj=oYlWVfwU&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?aj=oYlWVfwU&#38;s=Hacker_News</a>","time":1320169019,"type":"comment"},{"by":"geku","id":3182004,"parent":3181796,"text":"Zurich, Switzerland - Full Time - <a href=\"http://local.ch\" rel=\"nofollow\">http://local.ch</a><p>Work at local.ch, Switzerland's second biggest Website, as a Ruby On Rails software engineer. We search a passionate and experienced frontend developer who complements our great team. Enjoy the possibilities to contribute your ideas and the benefits of living in Switzerland.<p><a href=\"http://local-ch.github.com/rails-software-engineer.html\" rel=\"nofollow\">http://local-ch.github.com/rails-software-engineer.html</a>","time":1320155708,"type":"comment"},{"by":"ktaylor","id":3182274,"parent":3181796,"text":"Chicago and Palo Alto - <a href=\"http://groupon.com/techjobs\" rel=\"nofollow\">http://groupon.com/techjobs</a><p>Groupon is one of the fastest-growing businesses in history.  We (proudly) invented the white-hot social commerce business and are (humbly) the world leader in innovative, local, e-commerce platforms.<p>Ideal applicants are not required to speak in binary code, but should be extremely self-motivated and enthusiastic about building innovative, world-class software, learning, and growing. No stagnation allowed.<p>A smattering of open positions:<p>Software Apprentice - \n<a href=\"http://www.groupon.com/jobs?jvi=o8IYVfwt,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=o8IYVfwt,job</a><p>Software Engineer Ruby on Rails - \n<a href=\"http://www.groupon.com/jobs?jvi=oxggVfwI,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oxggVfwI,job</a><p>Test Engineer - \n<a href=\"http://www.groupon.com/jobs?jvi=oCggVfwN,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oCggVfwN,job</a><p>Senior Product Manager -\n<a href=\"http://www.groupon.com/jobs?jvi=oCQCVfwJ,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oCQCVfwJ,job</a><p>Data Scientist - \n<a href=\"http://www.groupon.com/jobs?jvi=o0BBVfwR,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=o0BBVfwR,job</a><p>Senior MySQL DBA &#38; Performance Engineer -\n<a href=\"http://www.groupon.com/jobs?jvi=ohQtVfwf,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=ohQtVfwf,job</a>","time":1320158992,"type":"comment"},{"by":"LisaG","id":3184201,"parent":3181796,"text":"San Francisco, CA / Los Angeles, CA<p>Are you passionate about Open Source, Net Neutrality and Open Data? Do you want to do work that matters?<p>Join us at Common Crawl and you will work with big data and help ensure the web is truly open.<p>Common Crawl is non-profit that produces and maintains an open repository of web crawl data to give everyone access and we need your help! We're looking for a truly talented data-minded Hadoop/Java engineer to help improve our crawler, API and do data analytics!<p>Contact lisa@commoncrawl.org for more info","time":1320182495,"type":"comment"},{"by":"patrickje","id":3184717,"parent":3181796,"text":"Seattle, WA Full Time in-house - Software Engineer<p>We are an agile shop actively developing and maintaining line-of-business applications that provide our company with a competitive advantage in the marketplace. We strive for continuous improvement and talk to our users daily. We are energetic, fast-paced, smart, and looking for one more team member.<p>We are looking for a developer who can quickly design a creative solution to a complex business problem and then turn around and get it done. We want a developer who will thrive in a highly social environment (We pair. A lot.). We want a developer who will soak up business/domain knowledge just as quickly and eagerly as she/he soaks up technical knowledge.<p>90% of our code has .NET at the heart of it, but don’t sweat it if you are stronger in Java than C#, or MySQL rather than Sql Server. We believe that if you’re a software engineer and you’re smart then you’re capable of learning new languages and technologies. Our applications run the gamut from Winforms to web/MVC to Silverlight to WCF to WPF.<p>Full description posted here:\n<a href=\"http://careers.stackoverflow.com/jobs/14131/creative-net-software-engineer-parametric-portfolio\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/14131/creative-net-sof...</a><p>Feel free to send resumes to pescarcega at paraport dot com","time":1320191632,"type":"comment"},{"by":"amirnathoo","id":3183578,"parent":3181796,"text":"WebMynd is hiring Javascript developers in San Francisco and London.<p>We're working on making writing native mobile apps as easy as writing an HTML5 web app. We are backed by Y Combinator, Ron Conway, 500 Startups, Founders Fund and a syndicate of great angels. We have paying customers.<p>Apply by taking on this challenge:\n<a href=\"https://webmynd.com/jobs-tech/\" rel=\"nofollow\">https://webmynd.com/jobs-tech/</a><p>Learn more about us:\n<a href=\"https://webmynd.com/about/\" rel=\"nofollow\">https://webmynd.com/about/</a>","time":1320174136,"type":"comment"},{"by":"danlash","id":3182177,"kids":[3182762],"parent":3181796,"text":"Atlanta, GA - Full Time - Developer - VersionOne - <a href=\"http://versionone.com\" rel=\"nofollow\">http://versionone.com</a><p>VersionOne produces a leading agile project management software product by the same name. We are a small team that focuses on continuous improvement in our software as well as our process. Our main technology stack is .NET 4 but we use many tools, languages, and platforms including ruby, less, jquery, sammy.js, node.js, asp.net mvc, html5/css3, nhibernate, jenkins, git, and more.<p>We are looking for passionate developers that are comfortable with practices such as pair programming, test driven development and are great communicators. We have a strong dedication to sustainable pace and team building - we have catered lunches 2-3/mo, a keg of craft beer at all times ... let me repeat, a keg of craft beer at all times ... a pool table, table tennis tables, foosball table, arcade, and team events such as paintball and go karts.<p>If you are interested please contact me (a developer) at [dan][.][lash][at][versionone][.][com] or visit our career page here: <a href=\"http://bit.ly/8y8CNx\" rel=\"nofollow\">http://bit.ly/8y8CNx</a> . We also have some open source projects here: <a href=\"https://github.com/versionone/\" rel=\"nofollow\">https://github.com/versionone/</a>","time":1320157825,"type":"comment"},{"by":"brittanyceres","id":3182875,"parent":3181796,"text":"San Francisco start-up, Flite seeks a talented Back End Engineer to lead the architecture, design, and development of a scalable back-end recording, metric, and billing system for our cloud ad platform. You will personally implement key pieces of backend infrastructure, work closely with other engineers, product managers, data scientists, architects, and our services team to ensure successful weekly product delivery &#38; ensure constant refactoring of the codebase to improve quality, maintainability, and reusability.<p>Be a major contributor to an exciting, fast-moving, and creative startup who has been named sfBIG’s ‘Next BIG Digital Startup’ of 2011. Work with cutting-edge technologies like Amazon EC2, Hadoop, Hive, and other great open-source tools to deliver massively scalable solutions. Solve interesting and challenging problems working with a close group of talented engineers. This is a great opportunity to work on a large-scale cloud ad serving and reporting back-end system at a fast growing, Sequoia-funded startup that is leading the change in display advertising.\nFlite is a cloud-based ad platform that enables marketers to deliver ads people love. Our platform allows advertisers, agencies, and publishers to create, serve, and measure ads that are as dynamic as the Web—delivering up to a 10X increase in ROI with ads developed in 1/10th the time.<p>This Job Is For You If: \n•\tYou love to code \n•\tYou appreciate simple, fast, reusable, and elegant software \n•\tYou like working in a fast-paced, agile environment \n•\tYou are good at mentoring and leading engineers \n•\tYou want to be part of a small, close-knit team \n<a href=\"http://www.flite.com/careers\" rel=\"nofollow\">http://www.flite.com/careers</a>","time":1320165504,"type":"comment"},{"by":"ckurdziel","id":3183507,"parent":3181796,"text":"New York, NY. Full time.<p>We’re hiring at Shelby.tv… like lots of other companies.  So why come work with us?  Because you want to put a dent in the universe.  These are some of the things we do at Shelby:<p><pre><code>  Work with (and watch tons of) online video\n  Process updates in real time from a growing list of firehoses\n  Use the best technology for the job (Rails, Mongo, Node, Redis, Beanstalk…)\n  Develop and contribute open source\n  Love the modern web (HTML5, CSS 3, JS, modern browsers)\n  Stay the fuck away from IE &#60; 9 and Flash\n  Love every screen (monitor, tablet, phone, tv, headrest, IMAX)\n  Focus on building an exceptional team that builds something people want\n</code></pre>\nWe're looking for great people that never want to stop improving.  We'd would love to find a bad ass front end person (own the product UI and everything else our community sees) who is looking for a wide range of opportunities &#38; responsibilities.  But these “positions” are buried in this post because they’re more like guidelines.<p>We’re backed by some of the best investors in the game and we hang our hats in our own office at 23rd and Park in NYC (though we’re cool with people working remotely).<p>More info here: <a href=\"http://shel.tv/qWsIxv\" rel=\"nofollow\">http://shel.tv/qWsIxv</a>","time":1320173322,"type":"comment"},{"by":"petervandijck","id":3181864,"kids":[3182290],"parent":3181796,"text":"Montreal, Canada. FULLTIME engineers and designers. Gush.<p>We're a 6-person funded startup. Full-time, top of market salaries for top people, great benefits, great environment. Work from home, the best tools, agile processes.<p>Skills: visual design, qa, Scala, Play!, MySQL, AWS sysadmin, Windows and Mac OSX native apps, iOS, Android, ...<p>Get in touch at jobs+hn@gushhq.com \n<a href=\"http://getgush.com\" rel=\"nofollow\">http://getgush.com</a><p>Seriously, if you're in or around Montreal, get in touch. You won't regret it.","time":1320154199,"type":"comment"},{"by":"winton","id":3183218,"parent":3181796,"text":"Bleacher Report - San Francisco, CA (Financial District). Full time.<p>We are the 4th largest sports web site in the United States, just behind ESPN, Fox Sports, and Yahoo.<p>If you are a Rubyist who is looking to play with a wide variety of technologies, make big decisions on a relatively small team, and work on a site that reaches 20 million people per month, this is your place.<p><a href=\"http://bleacherreport.com/careers/engineering\" rel=\"nofollow\">http://bleacherreport.com/careers/engineering</a>","time":1320169657,"type":"comment"},{"by":"nfriedly","id":3183498,"parent":3181796,"text":"San Francisco, CA<p>Sociable Labs is building the future of social commerce and we're looking for a few more engineers to help. Your technology stack is less important - we're looking for smart people with great communication in a passion for learning.<p>Our product is essentially a more advanced version of facebook's social plugins, with a strong focus on analytics, A/B testing, and ROI. See a couple of examples at <a href=\"http://www.backcountry.com/mens-clothing\" rel=\"nofollow\">http://www.backcountry.com/mens-clothing</a> (\"These people have asked their friends...\" section in the center below the fold) and <a href=\"http://www.active.com/running/stockton-ca/run-and-walk-against-hunger-2011-ik704\" rel=\"nofollow\">http://www.active.com/running/stockton-ca/run-and-walk-again...</a> (\"Connect with friends\" section on the right)<p>We have a modular JavaScript front end that works with the Facebook platform and makes use of cutting edge technologies like localStorage and CORS (cross-domain ajax).<p>Our back end is Java / Jetty / Postgres on Amazon EC2. We're using Guava, Guice, and a number of other interesting pieces to keep clean, testable code. We're also using Apache Hadoop for analytics.<p>We offer competitive pay, great benefits (including the best PTO policy I've ever seen), and an enjoyable working environment.<p>More details about the company and the jobs here: <a href=\"http://www.sociablelabs.com/Careers\" rel=\"nofollow\">http://www.sociablelabs.com/Careers</a><p>I work on the front-end but feel free to ask me questions about anything. If I don't know, I'll get you to the right person. Reply here or email nathan@[company site].com","time":1320173236,"type":"comment"},{"by":"qeorge","id":3182271,"parent":3181796,"text":"Greensboro, NC - Full Time<p>Math Strategies is looking for a .NET developer with experience in Business Intelligence. Must be on-site, but they can help with relocation.<p>This is my father's company, but I'm helping him look (hope that's kosher). They're a small (5 person), very tight-knit team that's been in the field for ~20 years, and everyone helps direct the future of the product.<p>Email george@illuminatikarate.com if you're interested and I'll be happy to pass along more info.","time":1320158966,"type":"comment"},{"by":"_mattb","id":3182986,"parent":3181796,"text":"Fremont, CA - Full Time - <a href=\"http://redwoodsystems.com\" rel=\"nofollow\">http://redwoodsystems.com</a><p>Redwood Systems builds an extremely energy-efficient lighting system and a high-density sensor network for commercial spaces, data centers and schools.  We're looking to hire a generalist web engineer that will work closely with some big customers to build out new and interesting ways to interact with our system and its data.  Some things you might be working on:<p>- spatially-connected visualizations of our internal sensor data (temp, occupancy, ambient light, and more)\n - learning algorithms that adjust lighting policies to save the most energy without disturbing occupants (very Nest-like)\n - building an application to create lighting patterns that direct occupants to a safe exit within a building<p>As always, we're looking for people who get things done, are interested in new technologies and care about our customers.  Get in touch with me, Matt, via mball .at. redwoodsys.com  And see more of our openings here <a href=\"http://redwoodsystems.com/about-us/careers#job-7\" rel=\"nofollow\">http://redwoodsystems.com/about-us/careers#job-7</a> (the one mentioned above is \"Application Engineer\").","time":1320166925,"type":"comment"},{"by":"russcky","id":3188077,"parent":3181796,"text":"Atlanta, GA - Full Time - <a href=\"http://emcien.com\" rel=\"nofollow\">http://emcien.com</a><p>Emcien (<a href=\"http://emcien.com\" rel=\"nofollow\">http://emcien.com</a>) is looking for Technical Services Engineer Candidates to help develop and promote our unique Pattern Based Analytic Applications.\nOur cloud-based Pattern Detection solutions are extremely valuable to Manufacturing, Retail and Security firms and we need candidates\nto join our team to help implement, test and support our clients and prospects.<p>This position is a connection between our Services Group, Engineering Group and Sales Group and is critical for each of their success.\nWhat we are looking for:<p>Strong Skills with: Solid SQL Database experience (loading data, querying data, etc.)\nStrong Oral and Written communication\nSolid PowerPoint experience \nProduct Demonstrations for Customers/Prospects<p>Experience with: Transforming and manipulating data using tools such as SQL, Excel, command line, ETL, etc.)\nOther Web-based tools (project management, search tools, etc.)\nDemonstrations and collaborative sessions via web-conferencing tools<p>Bonus Skills: Product Testing and Customer Support\nDocument Processes and Procedures\nWilling to travel on occasion<p>Email: emcienjobs@emcien.com","time":1320256759,"type":"comment"},{"by":"YakiSauce","id":3183696,"parent":3181796,"text":"New York. Full Time. Sales Position.<p>Wholeshare is a web startup making local and organic food more accessible to everyone.  We help people who live or work near each other organize into groups, which buy directly from wholesale natural food distributors and farmers.  By buying in groups, our customers are able to bypass supermarkets, save 20% to 30% off the retail price, and have the food delivered directly to their communities or workplaces.<p>We're an early-stage startup, and we currently have a working product with passionate customers and recurring revenue. We are based in San Francisco, CA but launched our pilot program with a partner in New York state; accordingly, we're in the process of establishing an East Coast office in upstate New York. We are proud to have received seed funding from several prominent venture capital firms, including Andreessen Horowitz. Wholeshare was founded by three Brown alumni who previously worked together in creating two other startups.<p>Read the full job description here: <a href=\"http://www.wholeshare.com/sales\" rel=\"nofollow\">http://www.wholeshare.com/sales</a><p>Contact us at jobs at wholeshare dot com if you're interested.","time":1320175510,"type":"comment"},{"by":"olkie","id":3188190,"parent":3181796,"text":"NYC H1B<p>The most dangerous labor of all was the twelfth and final mission.  Eurystheus ordered Hercules to kidnap the beast called Cerberus who guards the gates of hell - the brazed voiced hound of Hades and a monster not to be overcome and that may not be described, who eats raw flesh, fifty headed, relentless and strong.  Near the gates of Acheron, a weaponless Hercules found the beast waiting for him.  He resembled a retailer’s point of sale system.<p>You are a Hercules incarnate.  Your weapons will include CoffeeScript, Ruby, JVM, Mac/Win/Lin[1], iOS, Android, maybe even a little C.  Help us crush the mediocre POS industry incumbents. Multiple headed beasts, they are tired, decadent organizations and veritable deserts upon which the seeds of innovation and creativity find no purchase.<p>ShopKeep is fixing point of sale and becoming the “last mile” for local.  A profoundly disruptive solution, we have established a beachhead in a sector in dire need of innovation.  A well funded NYC based startup, we are fixing technology depressed, mind numbingly overpriced, and overly complex POS solutions and making them less expensive and highly customizable for both very large and very small customers.<p>Help us as we take this battle to the next level.  You will lead the development of our products.  Your releases will immediately be running[2] in thousands of actual brick-and-mortar stores.  Like this one <a href=\"http://bit.ly/tEn61i\" rel=\"nofollow\">http://bit.ly/tEn61i</a>.  And this one <a href=\"http://bit.ly/w1n3vc\" rel=\"nofollow\">http://bit.ly/w1n3vc</a><p>Contact jasonrichelson on github or david@shopkeep.com for more info...<p>[1]Don't worry, the Mac/Win/Lin registers consist almost entirely of cross-platform code\n[2]CI + better auto-updating than Chrome!","time":1320258085,"type":"comment"},{"by":"garysieling","id":3181830,"parent":3181796,"text":"Philadelphia, PA suburbs (Blue Bell/Whitpain)\nSoftware Engineer - Full time, Intern\nJava, iOS<p>We're a small, quickly growing company just outside Philly. We have a suite of products, mostly used by big pharma and energy companies. Come join our team and participate in the development of some exciting new products. (Java/.NET/iOS)<p><a href=\"http://www.wingspan.com/about/careers/\" rel=\"nofollow\">http://www.wingspan.com/about/careers/</a>","time":1320153645,"type":"comment"},{"by":"AlexC04","id":3182452,"kids":[3182795,3183506],"parent":3181796,"text":"Klick Inc, Toronto Canada<p>Digital agency. We're just shy of 200 employees and growing. One of Canada's 50 best managed companies. We're looking for Web and Mobile Application developers, Front end web, Project Managers, Senior project managers, Account managers, Reporting analysts, Creative designers.<p>If you're a programmer, we're language agnostic with respect to your past experience, mostly .NET in practice (and rapidly expanding in the mobile space).<p>You can browse the positions at <a href=\"http://www.klick.com/career_opportunities/\" rel=\"nofollow\">http://www.klick.com/career_opportunities/</a> and if you've got any questions, you can email me directly: alex.chesser at gmail<p>I've got a good breadth of experience and honestly believe that employees are treated really well here.  There's a good focus on work-life-balance, weekly paid lunch, lots of free snacks, a bottomless ice cream fridge (careful ... it's delicious and really tempting!)<p>Also - steps from Yonge &#38; Bloor station so pretty good for a commuter (I guess union might be a touch better but oh well).<p>Any questions, email me and I'll tell you all about it.  I can even pass your resume on to HR for you.","time":1320160821,"type":"comment"},{"by":"pwman","id":3182078,"parent":3181796,"text":"Vienna, VA (DC area).  Full time.<p>LastPass / Xmarks<p>Want to play with every new toy that comes out and make apps for them?<p><a href=\"https://lastpass.com/jobs\" rel=\"nofollow\">https://lastpass.com/jobs</a><p>Joe@LastPass.com","time":1320156613,"type":"comment"},{"by":"beck5","id":3182181,"parent":3181796,"text":"London UK - Sys Admin, .Net Devs, JavaScript Devs.<p>7Digital, we have the 3rd largest catalog of music in the world, our API powers Samsung Music, Blackberry, Ubuntu our own website and more. Now also do ebooks powering services like Waterstones. We are established, 7 years old, and profitable. Sustainable work load in a great team.<p><a href=\"http://about.7digital.net/careers\" rel=\"nofollow\">http://about.7digital.net/careers</a>","time":1320157948,"type":"comment"},{"by":"drusenko","id":3183284,"parent":3181796,"text":"San Francisco, CA (Jackson Sq) - Weebly <a href=\"http://www.weebly.com/jobs.php\" rel=\"nofollow\">http://www.weebly.com/jobs.php</a><p>We are hiring front-end and back-end engineers, a MySQL DBA, an Android engineer, an HTML5 mobile engineer, and a UI Designer.<p>From our jobs page:\nWe're a bit different than your average startup. We're a small team that loves what we do. We only hire others who love what they do, too.<p>Even though we're very profitable, we don't hire just for the sake of it; we hire the best people, then trust them: it's the thinking behind our no-limit vacation policy and company credit card for everyone.<p>We love building things and we focus on being productive, not the amount of time you spend in the office. We hate meetings, so we only have one per week.<p>We put a lot of effort into making Weebly a fun place to work for people who like getting things done.<p>Our millions of users love us (check out our blog comments). We have a net promoter score over 80% (higher than Apple's).<p>Running 2% of all of the websites on the Internet presents some very interesting technical challenges. Making a complex task super simple and intuitive is also an ongoing challenge.","time":1320170645,"type":"comment"},{"by":"DanMetcalfe","id":3186456,"parent":3181796,"text":"Saltaire, West Yorkshire (UK) PHP OO MVC developers wanted (full-time on-site only)\n... by fleetondemand.com, a funded start-up developing web apps for the business fleet/motor industry<p>What we're mostly looking for:\n- experience in OO PHP, mySQL and modern javascript use (we use jQuery)\n- team worker, appreciative of customers and users<p>Any of this would be a bonus but not essential:\n- strong cross browser/device HTML &#38; CSS\n- experience in Apache administration, mod_rewrite etc\n- familiarity with version control\n- linux sysadmin\n- web design &#38; illustration skills<p>Joining our dev team, you'd be contributing to current and future work:\n- extending functionality on our app; from business analysis and model design, through to page builds and testing\n- using and contributing to our in-house MVC framework\n- communicating with 3rd party systems using existing APIs or bespoke mechanisms\n- benchmarking, scalability and penetration testing\n- scalability solutions (caching, DB replication, load balancing, noSQL, ....?)<p>Competitive salary based on experience. Interested? Let me know via danm@fleetondemand.com","time":1320239189,"type":"comment"},{"by":"erikapod","id":3185215,"parent":3181796,"text":"Waterloo Ontario Canada, Full Time<p>Kik Interactive is a venture backed startup in Waterloo, Ontario developing products in the mobile space. We are the creators of Kik Messenger, the cross-platform, mobile messenger that went from zero to over a million users in just two weeks and has been growing ever since.<p>We're bringing Silicon Valley to Waterloo with a flexible, creative working environment that's centered on shipping an amazing product.<p>We have:\n* flexible working hours\n* catered meals twice a day from a top restaurant\n* no dress code\n* Fitness room with personal trainers, yoga and other fitness classes\n* A games room with ping-pong and foosball, \n* Regular pizza and beer/sushi and sake/Fun Fridays\n* Pick your tools and toys - whatever you need to do your best<p>We're funded by some of the top venture capital firms in the world (Union Square Ventures, Spark Capital, RRE Ventures).<p>We are looking for \n<i>Software Engineers\n</i>Server Engineers\n<i>UX/UI Designer\n</i>wicked developers who can do anything they put their mind to.<p>email erika @ kik.com if your interested in being a big part of upcoming mobile technologies.","time":1320203513,"type":"comment"},{"by":"kek","id":3184131,"parent":3181796,"text":"New York City, NY<p>Greatist is looking for a passionate web developer who wants to disrupt the health and fitness space. We inspire and inform our readers to make one healthier choice per week by providing them with entertaining, high-quality, relatable content - the Greatist way.<p>We need a smart self-starter who loves simplicity and effectiveness, builds stuff for fun that’s been successful, and wants to take ownership of the technical side of things. Ideally, you’ll be experienced with PHP, WordPress, and Javascript, but that doesn’t matter as much as a desire to learn and grow. Your work will be seen - we had over 250,000 unique visitors last month, and we’re only getting bigger. At Greatist, we believe every team member makes an impact. Passion for health and fitness is a must— we live the life we champion!<p>This is a full-time position in NYC. Send your resume, favorite health and fitness tip, Github profile, and anything else you can think of to opps (at) greatist (dot) com.<p>Email kelli (at) greatist (dot) com if you have any other questions - or just want to swap recipes.","time":1320181374,"type":"comment"},{"deleted":true,"id":3182403,"parent":3181796,"time":1320160300,"type":"comment"},{"by":"ksowocki","id":3197179,"parent":3181796,"text":"New York City - Php Developers @ Ignighter (Techstars '08)\n<a href=\"http://ignighter.com/jobs\" rel=\"nofollow\">http://ignighter.com/jobs</a><p>You will be responsible for product engineering efforts that will be directly used by the millions of users of Ignighter.com. You will work with world-class developers &#38; tools to deliver game-changing global Web 2.0 products. You will use standard web frameworks and technologies, as well as some homegrown ones too.<p>You will be involved in the entire lifecycle of a project, including strategy, vision, design, UX, coding, architecture, and deployment, and you will be expected to deliver clean, testable, well-thought-out code.<p>We're looking for an engineer with 0 - 1 years experience to build new features, squash bugs, improve user experience, and have fun doing it. This is an opportunity with HUGE advancement and upside potential. You WILL wear many hats - If you're killing it, you may even get to travel to Mumbai India #lifeexperience<p>This is an opportunity to join a top notch technical team.","time":1320431538,"type":"comment"},{"deleted":true,"id":3183215,"parent":3181796,"time":1320169647,"type":"comment"},{"by":"alttag","id":3182018,"parent":3181796,"text":"Jive Communications (Orem, UT)<p><a href=\"http://www.getjive.com/careers/\" rel=\"nofollow\">http://www.getjive.com/careers/</a><p>Senior Software Engineer:\n\"The selected candidate would potentially be working throughout the entire stack of the platform from the Linux kernel to call handling logic and web applications. Qualified candidates must have at least intermediate experience with the following:\nLinux\nC/C++\nJava\nRelational Databases (PostgreSQL preferred)\nExperience with any of the following is a plus:\nCassandra\nPBX Platforms\nOpenSIPS/OpenSER\nSIP and RTP\nPython\nWeb Development (HTML, AJAX, CSS)\nXMPP (Jabber)\"<p>Web Application Developer:\n\"Qualified candidates must be well experienced with the following technologies:\nHTML/AJAX/CSS\nPHP\nRelational Databases (we use both MySQL and PostgreSQL)\nOOP\nExperience with any of the following is a plus:\nPython\nDjango\nJava and JSP\nCandidates should come prepared with examples of work they have done. URLs of sites worked on and sample code would be helpful but are not required.\"","time":1320156054,"type":"comment"},{"by":"isb","id":3183429,"parent":3181796,"text":"Seattle - Full time - H1Bs welcome.<p>Amazon Route 53 - <a href=\"http://aws.amazon.com/route53-jobs/\" rel=\"nofollow\">http://aws.amazon.com/route53-jobs/</a><p>We are building and operating a highly available and scalable Domain Name System (DNS) web service. We are looking for great engineers to join our team. Please email your resume to route53-jobs@amazon.com or apply online at the link above.","time":1320172367,"type":"comment"},{"by":"justinsb","id":3182890,"parent":3181796,"text":"FathomDB: San Francisco / Bay Area or remote.  Full-time Software Engineers.<p>FathomDB needs you to build the next-generation relational database.  Fully buzzword-compliant: distributed, fault-tolerant and cloud-ready; more importantly a great engineering project to do the first real redesign of the database since the mainframe.  Your day-to-day is as much research as it is coding, as you'll be implementing things that have never been built that way before, that you probably invented over a team brainstorming session in the morning, maybe even using some insight you gained from your dreams the night before.<p>We work in C++(0x); you'll likely be experienced in C++ or C and an object-orientated language but what's more important is that you want to think and work where there are no signposts, and that you're comfortable doing so.  Experience with distributed systems or databases is a positive indicator, but I'll read and reply to every application to hn.jobs@fathomdb.com","time":1320165696,"type":"comment"},{"by":"ken-everett","id":3183162,"parent":3181796,"text":"Apply:\nPlease submit your resume and link to a github coding sample to: jobs@promantek.com<p>Who We Are:\nPromantek is a bootstrapped, profitable &#38; fast growing business.  Our employee performance software is easy, intuitive and personal with customers in 20 countries around the globe.<p>About You:\nWe’re looking for an experienced Ruby developer with a passion for test driven development practices to join our core team in Seattle.  This is an opportunity to work on small teams of skilled, creative developers / designers who value writing amazing software.<p>Qualified candidates will have:\n- Rails web framework, JavaScript, jQuery, HTML, CSS experience\n- Unit testing (RSpec) experience\n- published gems / plugins on github\n- 5+ years professional software development experience\n- Excellent communication and collaboration skills.   Lose gracefully at foosball to the CEO.<p>Benefits: \n- Health, dental &#38; vision insurance  \t    \n- 401k     \n- Stock Options<p>Details:\n- Full time in our Capitol Hill Seattle, WA office","time":1320169020,"type":"comment"},{"by":"itay","id":3183398,"kids":[3184579],"parent":3181796,"text":"Seattle, WA, San Francisco, CA, Palo Alto, CA and more - Splunk (full-time, H1B, interns)<p>A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people. Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you.<p>I personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>Also, check out our new dev portal which we launched recently: <a href=\"http://dev.splunk.com\" rel=\"nofollow\">http://dev.splunk.com</a>","time":1320172016,"type":"comment"},{"by":"lamplighter","id":3181842,"kids":[3182637],"parent":3181796,"text":"Uken Games in downtown Toronto<p>Uken is looking for talented developers to help us build mobile games in HTML5 and push what is possible in a browser.<p>We are a profitable startup (~25 employees) experiencing massive growth, with over 100,000 players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1320153767,"type":"comment"},{"by":"eventhough","id":3184444,"kids":[3184468],"parent":3181796,"text":"Salesforce.com\nSenior Innovation Developer<p>I work on a very special team in Product Marketing. We build some demonstrations and prototypes that showcase our upcoming technologies. The team is small and we are looking for a senior developer that will help us streamline our development processes and help us build really cool demos.<p>This job is not for everyone. We operate very much like a startup and have lots of space for innovation. Because we are not within R&#38;D we don't have to deal with red tape, bureaucracy, or politics. It's a cool gig...you will get to travel a few times a year.<p>Places we go: London, Paris, New York, Munich, Tokyo, Sydney, Singapore, Boston, Las Vegas, and more...<p>Our headquarters is located in San Francisco near the Ferry Building.<p>Check out the job listing here: <a href=\"http://careers.force.com/jobs/ts2__JobDetails?jobId=a1k70000000609UAAQ&#38;tSource=\" rel=\"nofollow\">http://careers.force.com/jobs/ts2__JobDetails?jobId=a1k70000...</a><p>Send me a message if you are interested.","time":1320186480,"type":"comment"},{"by":"bkudria","id":3183567,"parent":3181796,"text":"San Francisco, CA - Yammer. Fulltime; H1Bs considered.<p>Yammer is an awesome tech startup masquerading as an enterprise software vendor. We're building an enterprise social network (an internal communication and collaboration tool. Like Facebook.) and we need your help.<p>We build our product with insight and wisdom gained from the consumer social networking space, but we charge enterprise prices (and our customers pay them!) We're fighting some big serious competitors (Salesforce/Chatter, Jive, and VMWare/Socialcast) and this space has never been more exciting.<p>Yammer is really changing the way people get work done. We have actual challenges to overcome and we're doing our best to make a kick-ass product that makes our users happy.<p>Tech we use: Ruby/Rails, Scala, and JavaScript. We have Obj-C and C# stuff too.<p>Some bullet points for you to skim:<p>• Amazing group of smart engineers to work with. Really.<p>• We hack in Ruby/Rails, Scala/JVM, Javascript/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT/Sharepoint stuff.<p>• Competitive compensation. Enough said.<p>• Delicious catered lunch and dinner daily, with a 3PM snack cart. Also a fully-stocked beer-and-beverage fridge.<p>• Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>Some links for you to read more:<p>• Our jobs page: <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>• Our Engineering blog: <a href=\"http://eng.yammer.com/\" rel=\"nofollow\">http://eng.yammer.com/</a><p>• A blog post about why it's so awesome to work here: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht..\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a>.<p>Feel free to get in touch: bkudria@yammer-inc.com","time":1320173986,"type":"comment"},{"by":"brandontreb","id":3182440,"parent":3181796,"text":"REMOTE, Portland, New Mexico - <a href=\"http://elctech.com\" rel=\"nofollow\">http://elctech.com</a><p>ELC Technologies is hiring iOS Developoers!<p>We offer all the usual benefits… and if you’re located in Portland, an office with the world’s greatest espresso machine, a team of Kung Fu masters, Eight Ball champions, Nerf Gun Assassins, and world authorities on Dungeons and Dragons.<p>We’re passionate about many things here at ELC, such as:<p>- Creating cross-platform, enterprise level mobile applications with awesome UI/UX.<p>- Having fun, we believe that going to work should carry the same anticipation as that 10 minutes leading up to elementary school recess.<p>- Being Agile, we don’t force-feed one specific process, but pick and choose what is going to work on a per team/per project basis.<p>- Solving real world problems without compromising creativity.<p>Check out this post for the details: <a href=\"http://www.icodeblog.com/2011/10/28/ios-developers-we-are-hiring/\" rel=\"nofollow\">http://www.icodeblog.com/2011/10/28/ios-developers-we-are-hi...</a>","time":1320160697,"type":"comment"},{"by":"hauga","id":3182783,"parent":3181796,"text":"Siemens Ltd., Bangkok Thailand<p>We are looking for a senior web developer to join an existing development team working on an exciting project.<p>- Minimum of 5 years experience in web applications development<p>- Solid knowledge of Ruby on Rails, Ajax, JQuery, X-HTML and CSS<p>- Good knowledge of Object Oriented Programming and Object Relational Mapping<p>- Experience with agile development, and ability to work with minimal supervision<p>- Strong analytical skills, attention to detail, enjoy problem solving and take enormous pride in work<p>- Good English communication skills, both verbal and written<p>- Bachelor degree, major in Computer Science, Computer Engineering, MIS or IT related field<p>Qualified Thai nationals and Local Residents please submit your resume (incl. cover letter), availability, present and expected salary.<p>You can apply via this URL \n<a href=\"https://jobsearch.siemens.biz/career?company=Siemens&#38;career_job_req_id=84128&#38;career_ns=job_listing&#38;navBarLevel=JOB_SEARCH\" rel=\"nofollow\">https://jobsearch.siemens.biz/career?company=Siemens&#38;car...</a>","time":1320164479,"type":"comment"},{"by":"james33","id":3182238,"parent":3181796,"text":"Oklahoma City, OK - Full Time - <a href=\"http://goldfirestudios.com/jobs.php\" rel=\"nofollow\">http://goldfirestudios.com/jobs.php</a><p>We are a small but growing browser-based game studio, developing exclusively in HTML5 and Node.js. We are looking for Javascript developers with a passion for gaming. We are profitable and looking to expand operations.","time":1320158639,"type":"comment"},{"by":"twohey","id":3183388,"parent":3181796,"text":"Ness Computing. Los Altos, CA (H1B applicants welcome)<p>At Ness we're building a personalized search engine which combines personal data about an individual along with signals from their social graph and delivers uniquely tailored results for each query. Our first product focuses on restaurants and has been featured in the App Store since our launch 8 weeks ago.<p>Behind the scenes we're combining collaborative filtering and other forms of machine learning with traditional information retrieval to predict what users will like, explain our prediction to users, and rank what they will want to do in the moment.<p>Doing all this requires well architected, scalable systems for pushing lots of data and answering queries with minimal latency.<p>I know this is only the broadest possible overview and I'd be happy to talk if you'd like to learn more. My email is in my profile.<p>You can see the product at <a href=\"http://www.likeness.com\" rel=\"nofollow\">http://www.likeness.com</a>","time":1320171920,"type":"comment"},{"by":"seldo","id":3183268,"parent":3181796,"text":"San Francisco, CA (Mission) - awe.sm\n<a href=\"http://totally.awe.sm/jobs\" rel=\"nofollow\">http://totally.awe.sm/jobs</a><p>We're hiring front-end and back-end engineers, plus an SRE (think: ops guy who gets to write production code) and a designer.<p>Right now, we help companies track and analyze the way their content spreads over social media, and how that converts into pageviews and dollar sales. Our next phase -- the stuff the new hires will be working on -- is to move beyond merely reporting what's happening into making sense of it, and making actionable predictions based on it. That means event detection and machine learning on big, messy, real-world data sets.<p>Because this is all new dev, we are language and technology agnostic. If you think you can solve these problems, we'll let you pick the best tools for the job. We're looking for curiosity, enthusiasm, and a track record -- you know, \"smart and gets things done\" :-)","time":1320170416,"type":"comment"},{"by":"smadam9","id":3181926,"parent":3181796,"text":"Berlin, Germany - eKomi Ltd. (Full-Time)\neKomi is a leading provider of feedback management, primarily for web shops and services. One of the reasons we’ve been so successfully so quickly in a relatively new field is that we strive to stay up-to-date and provide quality services for our customers empowering them to deliver quality to their customers as well.\nWe are looking for front- and back-end developers to join our growing development team.\nA Variety of Tools We Use -PHP/MySql -jQuery, HTML, CSS -nginx, Apache, Varnish\nThe jobs are located in Berlin, Germany, and they are in-office positions. We have a great team and are looking for the right people to further strengthen our team. For job applicants, please email ramirez@ekomi.de<p>Extra info here: <a href=\"http://berlinstartupjobs.com/companies/ekomi/\" rel=\"nofollow\">http://berlinstartupjobs.com/companies/ekomi/</a>","time":1320154894,"type":"comment"},{"by":"pdabir","id":3184144,"parent":3181796,"text":"San Francisco, CA - Full Time - Boutine, Inc.<p>Boutine is a seed funded startup in the social ecommerce space around fashion. We are redefining the way consumers will shop online using natural behaviors that currently exist when it relates to shopping. We have customers and designers that have already signed up with the platform and are waiting for the launch.<p>We are currently building out the site and expect to launch in 4-5 weeks. We are looking to hire a lead engineer who is an expert in ROR and ideally has experience across the stack. We would like to have this hire on board in the next few weeks.<p>Opportunity includes:\n* Salary and Equity compensation commensurate with experience<p>* Ground floor opportunity and voice in shaping the company -- you will be the TECHNICAL LEAD for the business<p>*Build a team -- we have plans to hire at a minimum 2 more engineers soon with many more to follow and you will be hand selecting your team<p>Contact: pdabir@boutine.com","time":1320181537,"type":"comment"},{"by":"philfreo","id":3203595,"parent":3181796,"text":"San Francisco, CA (SOMA) - FULL-TIME + INTERNS<p>Quizlet.com is redefining how students study from middle school social studies to university-level Arabic to GRE prep. We deploy new stuff daily to our user base of 6 million students and teachers per month. We're a small, scrappy team in San Francisco, working hard to transform how people learn using technology (read our 17,000+ testimonials: <a href=\"http://quizlet.com/testimonials/\" rel=\"nofollow\">http://quizlet.com/testimonials/</a>).<p>We're looking for entrepreneurial engineers who can do it all: cook up great ideas, design, and implement new features, build for huge scale, get deep in the heads of users and create clean user experiences. Do whatever it takes to make a huge impact!<p>You should love coding (we're not religious about specific technologies, but we use PHP, MySQL, Javascript, HTML5, Node.js, Puppet, Git, and Sphinx, among others)","time":1320608528,"type":"comment"},{"by":"bostonvaulter2","id":3183628,"kids":[3201206,3183698],"parent":3181796,"text":"Honolulu, Hawaii - Full-time - <a href=\"http://www.referentia.com/jobs\" rel=\"nofollow\">http://www.referentia.com/jobs</a><p>I work at Referentia (<a href=\"http://www.referentia.com/\" rel=\"nofollow\">http://www.referentia.com/</a>), a small (around 99 people) research and development company that focuses on the Department of Defense. We are mostly a java shop, although I also do OS-level security work. we've been working with a number of open source technologies such as Cassandra, Google GWT, a little Android, and Linux.<p>We have a nice range of benefits (including an Ocean view!) and a nice snack and rec room. The hours are nice and flexible and the general workplace culture is great and I love working with all of my co-workers. Very nice work attier also, I usually wear t-shirt, shorts and \"flip-flops\". We're currently focusing on hiring talented Software and Systems Engineers.","time":1320174729,"type":"comment"},{"by":"earthaid","id":3196431,"parent":3181796,"text":"MyEnergy - Boston, MA - Full-time Data &#38; Rails Engineers, VP Engineering to build the People's Energy Internet<p>MyEnergy ( <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a> ), formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We have small offices in San Francisco and DC, and we're now consolidating our dev team and HQ into an awesome brand new headquarters --- a sunny two-story loft --- in downtown Boston.<p>We empower households to track &#38; contextualize their electric, natural gas, and water utility usage. We value data, clarity, focus and beauty. We are looking for people who do too --- people who want to work on incredibly complex problems and come up with solutions that will change the world. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption.<p>To learn more about our very competitive salaries, excellent benefits, fun company culture, and small arsenal of office helicopter drones, check out: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, (or our new careers page under construction at: <a href=\"http://www.myenergy.com/engineering\" rel=\"nofollow\">http://www.myenergy.com/engineering</a> ) and send us an e-mail at jobs at myenergy dot com","time":1320421123,"type":"comment"},{"by":"pointstechgeeks","id":3193681,"parent":3181796,"text":"Toronto, ON, Canada. Full time and co-ops (intern) welcome.<p>Points.com provides software as a service for reward points, with partners such as Best Buy, Virgin America, Hyatt, and Paypal. You can learn more at: points.com and lifeatpoints.com<p>We're looking for agile software developers to join our software engineering team. We primarily code in Java and Python. We're in an awesome loft-like workspace in downtown Toronto and we run things like a software startup, with ping pong, foosball, sofas, lunch room, a rooftop patio, Friday beer carts, and Nerf guns. Points is well established and traded on the NASDAQ as PCOM.<p>If you're interested, send your resume to careers at points.com with the subject \"agile developer - Hacker News\"!<p>More info on the role here:\n<a href=\"https://www.points.com/static/corporate/career/openings.html\" rel=\"nofollow\">https://www.points.com/static/corporate/career/openings.html</a>","time":1320354023,"type":"comment"},{"by":"alonzosnook","id":3182469,"parent":3181796,"text":"UK - London -  Software Developer<p>We're looking to get some people in here at Revector.  We work with mobile phone operators and run distributed systems that test out their networks.  We have existing (profitable!) products and there are some new products on the drawing board as I speak, so this is a great time to join us.<p>There's plenty to get involved in: Hardware interfaces (VoIP, SMS etc); Intelligent scheduling; Data storage and processing; Front-end presentation.  We're very small, so you can get stuck in and make a big impression.<p>Experience with Python, Shell, MySQL and Redis would be great, but if you're good then you'll have no trouble picking these up.  The positions are listed as graduate ones, but we'd be really happy to hear from people with more experience.<p>The website has a load more info: <a href=\"http://www.revector.com/careers\" rel=\"nofollow\">http://www.revector.com/careers</a>","time":1320161023,"type":"comment"},{"by":"shopkeep","id":3181927,"parent":3181796,"text":"New York City - VP of Engineering &#38; other engineering positions ShopKeep.com. We are rapidly expanding our customer base.  Looking for experienced engineers to tackle some difficult scaling challenges. Some call us the Squareup of NYC and we think you will agree.<p>Message jasonrichelson on github for more details.","time":1320154906,"type":"comment"},{"by":"startupstella","id":3182755,"parent":3181796,"text":"Marketing Intern...Chicago, IL<p>Are you a smart, entrepreneurial marketing and social media protegee who dreams of joining a startup?<p>FeeFighters is looking for a Marketing Intern specializing in social media willing to learn quickly and tweet their heart out. This person will work closely with the FeeFighters marketing team to build buzz and help with our long term marketing strategy. Primary responsibilities will include helping manage social media, blogging, and coming up with creative opportunities to showcase FeeFighters in badass ways. The ideal candidate doesn’t need work experience, but needs to provide evidence of social media chops.<p>Must be: a student located in Chicago\nfor more info: <a href=\"http://feefighters.com/jobs/kickass-marketing-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-marketing-intern/</a>","time":1320164130,"type":"comment"},{"by":"parachuteinter","id":3184524,"parent":3181796,"text":"CONTRACT POSITION - Central America / Seeking Onsite person<p>Explore new horizons in a tropical country, while getting paid. Work full time in the Colonial city of Granada, Nicaragua and experience life with volcanoes, beaches, rainforests and jungles... all in your backyard!<p>Monday to Friday, you'll work with the Parachute team to develop websites, and on the weekends explore a new country.<p>Parachute Web Design is looking for a developer to join our team for a minimum 6-month commitment. We want someone who is ready for a little adventure and who is eager to do great work and learn along with their peers. We are looking for experience in HTML, CSS, JavaScript and preferably in .NET.<p>Get more info and apply at <a href=\"http://jobs.pdnica.com/granada\" rel=\"nofollow\">http://jobs.pdnica.com/granada</a><p>Room and board, plus compensation dependent on experience.","time":1320187813,"type":"comment"},{"by":"jcs","id":3184554,"parent":3181796,"text":"London, UK - Full time - Rangespan<p>Founded by ex-Amazon executives and engineers, Rangespan is an ambitious e-commerce software company that makes it easy for retailers to offer deep product selection. Our values (<a href=\"http://www.rangespan.com/about/values/\" rel=\"nofollow\">http://www.rangespan.com/about/values/</a>) summarise the way we work.<p>We make heavy use Python, Django, MongoDB and AWS to solve complex problems with huge data sets. We take an agile approach to development and are looking for more great developers to join our team. You will have a broad, hands-on role developing extremely high-scale systems and web services for retailers and suppliers.<p>For more information, please see <a href=\"http://www.rangespan.com/jobs/\" rel=\"nofollow\">http://www.rangespan.com/jobs/</a> or email jobs@rangespan.com.","time":1320188318,"type":"comment"},{"by":"superjerca","id":3184601,"parent":3181796,"text":"Bellevue, WA<p>ClassifiedAds.com, Inc<p><a href=\"http://www.classifiedads.com/\" rel=\"nofollow\">http://www.classifiedads.com/</a><p>Linux/PHP Software Engineer<p>We're a small startup but we're one of the largest classified ads websites. Come help us solve interesting challenges in scaling a fast-growing site with over 3 million monthly unique visitors.<p>Email jobs@classifiedads.com","time":1320189489,"type":"comment"},{"by":"lcm133","id":3182133,"parent":3181796,"text":"Washington DC Metro - <a href=\"http://www.sawbuck.com/about/jobs\" rel=\"nofollow\">http://www.sawbuck.com/about/jobs</a><p>VC-backed and thriving real estate website Sawbuck.com is seeking a back-end engineer with c#, xml, sql experience.<p>If you are interested, email me directly if you'd like... lmintzer at sawbuck dot com","time":1320157289,"type":"comment"},{"by":"derwiki","id":3182155,"parent":3181796,"text":"San Francisco, fulltime/internships/H1B<p>Causes - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a><p>At Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, open source contributions encouraged:<p><a href=\"https://github.com/causes/suggestomatic\" rel=\"nofollow\">https://github.com/causes/suggestomatic</a> -- item based collaborative filter<p><a href=\"https://github.com/causes/buffet\" rel=\"nofollow\">https://github.com/causes/buffet</a> -- distributed testing framework for Ruby<p><a href=\"https://github.com/causes/mock_redis\" rel=\"nofollow\">https://github.com/causes/mock_redis</a> -- mock redis Ruby gem<p>Apply through the site or adam@causes.com if interested!","time":1320157538,"type":"comment"},{"by":"ih","id":3184173,"kids":[3184430],"parent":3181796,"text":"Los Altos off Page Mill Rd. Full time. <a href=\"http://www.knowlabs.com/\" rel=\"nofollow\">http://www.knowlabs.com/</a><p>Know Labs is a Silicon Valley-based startup looking to change the\nfuture of education by making it more accessible and less expensive.\nOur first class attracted 160,000 students in 190 countries and was translated into 40 languages.  We're looking for great software engineers to grow our platform..  A few of the tools we use are Python, ngninx,\njQuery, and MySQL so experience with any of these and/or scaling, databases, and system administration is a plus, but we're mainly looking for great\nengineers who believe in improving education and want to have a big\nimpact on both our platform and the world.  Get in touch with us at\njobs@knowlabs.com.","time":1320182051,"type":"comment"},{"by":"puppetrecruiter","id":3194210,"parent":3181796,"text":"Portland, OR.  Full Time.<p>Puppet Labs, creators of Puppet &#38; Puppet Enterprise, your SysAdmin's best friend, is growing!  We are currently hiring for the following positions:<p>* Operations Engineer (Portland, OR only - no remote)\n* Professional Services Engineer (Portland or NYC)\n* Account Manager (Portland, OR only - no remote)<p>Engineer candidates should have strong Unix &#38;/or Linux SysAdmin &#38;/or DevOps backgrounds and enjoy speaking with clients.  Excitement about Puppet is a must, professional experience using Puppet is optional.  Casual work environment, great benefits including stock options, competitive salaries, and awesome opportunity for growth in a rapidly expanding company!<p>To review job postings and apply online, please go to www.puppetlabs.com/jobs<p>Thanks!\nAimee\n@PuppetRecruiter","time":1320363627,"type":"comment"},{"by":"dkhenry","id":3182785,"parent":3181796,"text":"Newark, De (Close to Philadelphia )<p>SevOne<p>We are a Network Performance monitoring company that focuses on speed at scale. It actually really interesting work solving problems involving huge distributed data sets in ways most people don't deal with ( This is not a Hadoop style data )<p>Back End Developer - Mainly C , but also a good deal of SQL and PHP<p>Front End Developer - Mainly Javascript with a good deal of PHP.<p>We are still what I call a small company but we have grown over 500% since I started. The atmosphere is very much what you would find in a small start up and we have worked hard to keep that atmosphere as we have grown. full job descriptions are on <a href=\"http://www.sevone.com/company/careers\" rel=\"nofollow\">http://www.sevone.com/company/careers</a> or E-mail me at dkozlowski@sevone.com","time":1320164487,"type":"comment"},{"by":"xutopia","id":3182067,"parent":3181796,"text":"Boston or Montreal - <a href=\"http://hopper.com/\" rel=\"nofollow\">http://hopper.com/</a>\n---------------------------------------<p>Hopper is hiring exceptionally smart and creative people to help us bring to life new ideas about how online travel should work. We use information extraction, machine learning, distributed computing and custom search algorithms to transform ridiculously huge volumes of data into useful information. And we're building a pretty cool user interface, too.<p>Our team is 12 people strong now, but we want to double that over the next year. So if you think you have something to contribute, then we definitely want to hear from you (jobs@hopper.com). Are you in the Boston area? We're opening a new office in Cambridge soon.","time":1320156522,"type":"comment"},{"by":"bxf","id":3182204,"kids":[3185931],"parent":3181796,"text":"Metro Denver, CO - INTERN, new grad, post-grad (all positions paid)<p><a href=\"http://www.ecocion.com/\" rel=\"nofollow\">http://www.ecocion.com/</a><p>Ecocion builds software to help energy companies stay in compliance with environmental regulations.<p>We're looking for an intern (new grads, post-grads, post-baccalaureates are also welcome) to help us build our new .NET web app.<p>If you have a solid grasp of HTML, CSS, and jQuery UI, then we want to talk to you.<p>If you have all that and you have (or want) some .NET experience, then we really want to talk to you.<p>We're looking for someone who can take some initial guidance and then find the the last 20/30/40% of the solution on their own. This position has tons of growth potential and offers a lot of autonomy for the right person.<p>Contact me directly. Use the email in my HN profile.","time":1320158214,"type":"comment"},{"by":"ganjianwei","id":3183332,"kids":[3189659,3184744],"parent":3181796,"text":"Burlingame, CA (Burlingame is near San Francisco Int'l Airport) - TellApart <a href=\"http://www.tellapart.com/\" rel=\"nofollow\">http://www.tellapart.com/</a><p>We're hiring Software Engineers, senior and junior, as well as Software Engineers specializing in machine learning.<p>We help eCommerce companies \"TellApart\" their high value customers from the rest by collecting and making sense of their customer data.<p>Here are some technical challenges you'll face at TellApart:<p>- Scale--build systems that handle tens of thousands of requests per second under strict latency guarantees on behalf of hundreds of millions of users<p>- Predictive modeling with huge data sets--build predictive models that evaluate hundreds of thousands of features in milliseconds<p>Email me at wei@tellapart.com if you'd like to find out more.","time":1320171340,"type":"comment"},{"deleted":true,"id":3184142,"parent":3181796,"time":1320181532,"type":"comment"},{"by":"thomd","id":3186085,"parent":3181796,"text":"Cambridge and Brighton (UK) - Aptivate<p>We are a not-for-profit organisation who are passionate about using technology for social good. We build websites and tools to support organisations in the international development sector, and we are looking for smart software developers to join our team (particularly in Python/Django).<p>As well as writing code, we often work on the ground in developing countries on projects ranging from delivering technical training to building and deploying resilient hardware systems for power and communications. Each member of the organisation has a voice in strategy and policy decisions.<p>For details see <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1320230505,"type":"comment"},{"by":"siddharthjoshi","id":3184289,"kids":[3187080,3184357],"parent":3181796,"text":"(Seattle + H1B OK)\nMy team at Amazon.com (Customer Service Technology) is hiring SDEs!<p>We are a small team of 7 engineers, but we each develop systems from the ground up, straight from DB design to front-end UI. We deploy new features almost every day.<p>As the team is moving into exciting new projects (machine learning, schedule optimization etc), I encourage you to come join us and be a part of the next generation of Customer Service Technology.<p>Here is the official posting and how to apply: <a href=\"http://www.amazon.com/gp/jobs/129914/ref=j_sr_2_t?ie=UTF8&#38;category=Software%20Development&#38;location=*&#38;keywords=customer%20service&#38;page=1\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/129914/ref=j_sr_2_t?ie=UTF8&#3...</a>","time":1320184039,"type":"comment"},{"by":"colinschlueter","id":3183024,"parent":3181796,"text":"Berlin, Germany - <a href=\"http://www.sofatutor.com/\" rel=\"nofollow\">http://www.sofatutor.com/</a><p>Looking for both Ruby on Rails developers and a frontend developer (ideally also with a Rails-dev background).<p>sofatutor.com is an educational video platform and one of the largest education startups in Germany. We're a small technical team building a fast-growing online platform to help students study for school and university, using Ruby, Rails, Amazon Web Services and a bunch of related tools and services.<p>Full job descriptions (in German) at <a href=\"http://www.sofatutor.com/jobs\" rel=\"nofollow\">http://www.sofatutor.com/jobs</a>, but feel free to contact me directly if you're interested or have any questions (colin@sofatutor.com).","time":1320167368,"type":"comment"},{"by":"kontagentjobs","id":3184818,"parent":3181796,"text":"San Francisco, CA - Kontagent<p>Frontend + backend devs and tech leads<p>Good comp, good perks (free catered lunch, gym membership), great work environment - high aptitude/ low attitude.<p>Check us out: Kontagent.com/careers<p>We provide deep social data pattern visualization and analysis that delivers actionable insights via an on-demand service. Kontagent tracks more than 1,000 social applications, over 150 million monthly active users, and in excess of 15,000 messages every second.  Kontagent is funded by ALTOS Ventures and Maverick Capital, with additional funding from Facebook and other well-known angel investors. Founded in 2007, the company is headquartered in the SOMA district of San Francisco with additional offices in Toronto and London.﻿","time":1320194026,"type":"comment"},{"by":"TommyWu","id":3223461,"parent":3181796,"text":"San Francisco, Lead Python Developer<p>At Tribal Crossing we work on creating games with deep story lines and engaging characters, something missing from most Facebook games today.  Tribal Crossing is looking for a strong software engineer to lead the future development of our backend game engine, refine our custom system for expressing game logic and flow, and develop new games from the planning stage to post-launch.<p>What we're NOT:<p>* We're NOT working in a sweatshop making clones of Zynga games<p>* We're NOT making reskins of Evony, Kingdoms of Camelot, Atlantis, etc<p>* We're NOT letting metrics rule our lives (Star Wars wasn't created through metrics)<p>What we ARE:<p>* We ARE making games that are focused on delivering amazing story lines<p>* We ARE creating characters that players will care about<p>* We ARE building tools that will allow allow content creators to do 1 and 2<p>Why You Should Apply:<p>* TECHNOLOGY: We embrace cutting edge technology if it saves us time in the long run. Ask us about how we wrote our own DSL that in turn generates code for serializing game data and defining API routes. Or perhaps watch our webinar with Membase about how we are able to support millions of users with NO sysadmin and a tiny team. Bigger doesn't always mean better, if you know how to use the right tools.<p>* INNOVATION: We have built a wide range of tools and processes that greatly reduce both low level work and endless cross-functional meetings. By making sure team members are unblocked and focused on high value activities, we're able to spend more time on adding innovation to our games.<p>* IMPACT: We've signed some long term deals with publishers that want to distribute our games on the web and mobile platforms. We are looking for folks that want to join on this initial traction and help take it to the next level. We will be asking for your opinion so be ready to have one.<p>If that sounds interesting, you should apply here: <a href=\"http://www.tribalcrossing.com/jobs/\" rel=\"nofollow\">http://www.tribalcrossing.com/jobs/</a>","time":1320987324,"type":"comment"},{"by":"PanMan","id":3182009,"parent":3181796,"text":"Amsterdam, Netherlands. Both INTERN and full-time positions.<p>We launched Skylines last may at Techcrunch Disrupt, our mission is to organize the world's real time photos. We currently process over two million pictures a day, are ramping up quickly, and generate a lot of data in the process. We're looking for people who can help us scale and analyze this data. Mostly backend developers on various technologies, ranging from Riak, Ruby and Map-Reduce to PHP, MySQL and Redis. We're based in the center of beautiful Amsterdam in an active startup community. Current alpha product at <a href=\"http://skylin.es\" rel=\"nofollow\">http://skylin.es</a>.<p>Questions? Shoot me an email at martijn@skylin.es.","time":1320155831,"type":"comment"},{"by":"Kraln2","id":3187800,"parent":3181796,"text":"MD, Bethesda/DC Area. Full TIme<p>I work at Brivo Systems, LLC (<a href=\"http://www.brivo.com\" rel=\"nofollow\">http://www.brivo.com</a>), a physical access control company. We have the largest private access control instance in the world, and the business is growing at a phenomenal rate. We're looking for a really good J2EE person, preferably with spring and oracle experience. We have great benefits [all the coffee and espresso you can drink, subsidized health, dental, etc] and a relaxed work environment.<p>My email is jeff.katz@brivo.com. Feel free to toss me an email, and I can send you back the 'hr-sanctioned' opening, and if you'd like, put your resume in front of the hiring manager.","time":1320253757,"type":"comment"},{"by":"timsco","id":3181995,"parent":3181796,"text":"Toronto, ON, Canada - Lollipop (<a href=\"http://wearelollipop.com\" rel=\"nofollow\">http://wearelollipop.com</a>)<p>We build websites for ad agencies and are looking for an senior interactive frontend developer (and maybe a bit of backend if you like it). I'll take smart over senior any day though. I'm basically looking for someone that isn't afraid to pick up a new language and dig when they need to. Our clients constantly challenge us, so it's an interesting job, for sure. Not a typical HN starup but you'll learn a lot.<p><a href=\"http://www.wearelollipop.com/2011/10/senior-interactive-developer-wanted/\" rel=\"nofollow\">http://www.wearelollipop.com/2011/10/senior-interactive-deve...</a>","time":1320155595,"type":"comment"},{"by":"adriannered","id":3197533,"parent":3181796,"text":"San Francisco. Full Time<p>Quantitative Researcher<p>The Climate Corporation is looking for experienced hackers, quants, and data scientists to join our Math Team. We leverage big data and cloud computing to tackle real-world problems in machine learning, climatology, and risk management. We work with weather data, forecasts, agricultural statistics, geological surveys, satellite images, and more. Our extraordinary mission is to build a detailed statistical model of all possible weather events everywhere on Earth, so that every weather risk can be comprehensively managed with our insurance products.<p>TO APPLY: <a href=\"http://jobvite.com/m?3fADbfwn\" rel=\"nofollow\">http://jobvite.com/m?3fADbfwn</a>","time":1320437744,"type":"comment"},{"by":"ryutin","id":3181902,"parent":3181796,"text":"CodeRyte - Bethesda, MD<p>CodeRyte (<a href=\"http://www.coderyte.com\" rel=\"nofollow\">http://www.coderyte.com</a>) is an innovative venture-funded healthcare software company located at the Bethesda Metro just minutes from Washington, D.C.   We are a fast-paced and results driven team, offering an intellectually stimulating environment and opportunity for growth and development in a casual atmosphere.  CodeRyte is a premier provider of computer-assisted coding technologies in the healthcare industry.<p>Hiring for:<p>- Senior Database Engineer<p>- NLP Software Engineers (Java)<p>- Software Engineers (Perl)<p>Job descriptions for these positions can be found at:\n<a href=\"http://www.coderyte.com/careers\" rel=\"nofollow\">http://www.coderyte.com/careers</a>","time":1320154674,"type":"comment"},{"by":"apwenchel","id":3182982,"parent":3181796,"text":"Washington, DC\nEverFi, Bringing education to places it is needed the most. We are investing heavily in our products &#38; infrastructure and have a lot of great things in the pipeline.<p>Currently hiring Ruby on Rails devs, Flash peeps, Big Data/Hadoop/Hbase ninjas, a cloud infrastructure sys admin, product managers, and a graphic/interactive designers.<p>Its a very fun, dynamic work environment, we're well-funded (NEA, Eric Schmidt/Tomorrow Ventures, Michael Chasen/Blackboard, Allen&#38;Co) and have fantastic revenue growth.<p>Email engineering-jobs@everfi.com if you want to come by and shout at us and learn about our revolutionary blimp in the cathedral product development methodology.","time":1320166868,"type":"comment"},{"by":"bjallen","id":3183289,"parent":3181796,"text":"Southlake, TX (Dallas-Fort Worth)<p>GetThere / Sabre<p>We're looking for front-end engineers comfortable doing both client-side and server-side work. For us that means HTML/CSS, JavaScript, JSP, Java (or comparable).<p>GetThere is the leading business travel booking application. We operate at a large scale, so your code would be used by millions of people around the world.<p>Submit your resume through the link below, but drop us a line so we know to be on the lookout for it.<p>Although the link below is for a contract position, we have contract-to-hire and full-time positions as well.<p><a href=\"http://sabre.hodesiq.com/jobdescription.aspx?JobID=2668712\" rel=\"nofollow\">http://sabre.hodesiq.com/jobdescription.aspx?JobID=2668712</a><p>b.j.allen@sabre.com","time":1320170698,"type":"comment"},{"by":"12spokes","id":3183894,"parent":3181796,"text":"USA REMOTE. Full time<p>12 Spokes<p>We’re a full-service Ruby software company with team members spanning the United States. We build custom software for big clients and small startups, and we have a growing set of internal projects that we’re building, too (e.g. canaryci.com).<p>Here's why you want to work for us:<p>* We respect your life away from work. We're like the French: a 35-hour work week.<p>* We value people who do things the right way, and we'll give you the time and space to do it. We are committed to BDD.<p>* Everyone on our team works remotely.<p>We've got two open positions now:<p>Ruby developer—BDD is a must!<p>Web designer/front-end developer<p>Read job descriptions here: <a href=\"http://www.12spokes.com/work-with-12-spokes\" rel=\"nofollow\">http://www.12spokes.com/work-with-12-spokes</a>","time":1320177703,"type":"comment"},{"by":"grouptweet","id":3182640,"parent":3181796,"text":"Chicago IL (preferred) or Remote - <a href=\"http://www.GroupTweet.com\" rel=\"nofollow\">http://www.GroupTweet.com</a><p>Just relaunched GroupTweet v2.0.  Need some more PHP(cakephp) talent to help us move onto v3.0.<p>Competitive pay and equity stakes are available for self-starters that demonstrate strong performance. We are a small team, so plenty of opportunities to get in early and shape the future of GroupTweet.<p>We think Twitter can be the foundation for a great group communication platform for all sorts of different verticals. Think something like Yammer, however entirely integrated within the Twitter ecosystem.<p>We have millions of users worldwide. Check us out!<p>Inquiries: jobs@GroupTweet.com","time":1320163013,"type":"comment"},{"by":"blored","id":3182398,"parent":3181796,"text":"Toronto, Ontario, Canada - Web Developer, full time  <a href=\"http://www.poolhouse.ca/\" rel=\"nofollow\">http://www.poolhouse.ca/</a><p>We run Dogbook and Catbook.  We love what we do and offer a lot more than a standard 9-5 job.  The salary is competitive and we are located seconds from Eglinton subway station.<p>We're looking for a smart, hard working individual who loves building consumer applications.  Standard web technology experience is essential PHP, MySQL, Javascript, HTML and CSS.  Mobile app development experience is a plus.<p>If you read HN that's a great start.  We're also offering a $500 referral reward if you know someone who is looking.<p>Email: hn-apply@poolhouse.ca","time":1320160270,"type":"comment"},{"by":"ADevInTheMist","id":3182922,"parent":3181796,"text":"Seattle, WA  Expeditors International of Washington, a Fortune 500 global logistics provider for 35 years.<p>www.expeditors.com<p>Job Postings: <a href=\"http://domino.expeditors.com/expd/careers.nsf/WebJobs_Product_InformationServices\" rel=\"nofollow\">http://domino.expeditors.com/expd/careers.nsf/WebJobs_Produc...</a><p>Looking for Java developers to help us continue our 35 year history of making real money:  <a href=\"http://tinyurl.com/3tagqvc\" rel=\"nofollow\">http://tinyurl.com/3tagqvc</a><p>while living up to our \"no layoffs\" policy:<p><a href=\"http://investor.expeditors.com/annual-reports/2010/EXPD_2010_Letter.pdf\" rel=\"nofollow\">http://investor.expeditors.com/annual-reports/2010/EXPD_2010...</a>","time":1320166057,"type":"comment"},{"by":"vital101","id":3184686,"parent":3181796,"text":"Grand Rapids, MI Full Time<p>DDM Marketing &#38; Communications (<a href=\"http://www.teamddm.com\" rel=\"nofollow\">http://www.teamddm.com</a>) is looking for a full-time developer.  We're heavy users of Javascript &#38; PHP, have a sweet office in downtown, pay for your parking, and there's always beer stocked in the fridge.  We have a lot of traditional web clients, but also write a lot of iOS apps in HTML5 with PhoneGap.<p>If working on the latest and greatest in HTML5 &#38; Javascript sound great to you, check us out.<p><a href=\"http://www.teamddm.com/contact/jobs/web-developer\" rel=\"nofollow\">http://www.teamddm.com/contact/jobs/web-developer</a>","time":1320190935,"type":"comment"},{"by":"dcposch","id":3184796,"parent":3181796,"text":"Addepar in Mountain View\n------------------------<p>We're a young software startup; our goal is to revolutionize finance. Our current focus is on private wealth management, where we already have significant traction. Our CEO, Joe Lonsdale, was a cofounder of Palantir.<p>We offer employees a competitive salary and a significant ownership stake in the company. Summer intern and H1B positions are available.<p>More info - <a href=\"http://addepar.com/careers.php\" rel=\"nofollow\">http://addepar.com/careers.php</a>\nI'm a software engineer here, feel free to email me: dan@addepar.com\nOur hiring director, Tim Tieu, can be reached at: careers@addepar.com","time":1320193474,"type":"comment"},{"by":"hansonjohn","id":3185049,"parent":3181796,"text":"Toledo, Ohio - Full Time<p>Hanson Inc., a Toledo, Ohio based digital agency, is looking to hire a full time Java web application developer.  We are looking for candidates with experience in both the Java platform, and web application development.  You will be working on a small software engineering team developing on a Java/Spring MVC/Tomcat/MySQL/Linux stack.   We prefer local candidates, and are not currently offering relocation assistance.  Hanson offers a full benefit package, including medical and 401k.<p>If you are interested in learning more about the position, please contact us at: hn-eng-careers@hansoninc.com<p>hansoninc.com","time":1320199378,"type":"comment"},{"by":"dustismo","id":3182730,"parent":3181796,"text":"Trendrr.com / Trendrr.tv --  NYC (also remoting from Seattle is a possibility).<p>About Us:\nTrendrr is the real-time data processing muscle behind Trendrr.com, Trendrr.tv, and other media experiences.<p>We’re looking for someone who:<p>* Loves to code<p>* Is entrepreneurial and can work with limited guidance<p>* Can solve challenging problems with elegant solutions<p>* Is interested in big data and real-time processing<p>* Can code in Java and Python<p>* Enjoys learning new technologies and picking up new skills<p>* Is familiar/interested in nosql, especially MongoDB and Redis<p>* Can take direction both in person and remotely<p><a href=\"http://blog.trendrr.com/2011/09/26/trendrr-dev-were-hiring/\" rel=\"nofollow\">http://blog.trendrr.com/2011/09/26/trendrr-dev-were-hiring/</a>","time":1320163963,"type":"comment"},{"by":"ddollar","id":3185337,"parent":3181796,"text":"San Francisco, CA - Heroku<p>We're looking for an active member of the Node.js community to come own Node.js at Heroku. This position involves both contributing to the Node.js open-source community and working to reduce friction for Node.js users on Heroku.<p>If you're excited about the promise Node.js and the future of app deployment, come help us to shape it.<p>Full job description: <a href=\"http://heroku.theresumator.com/apply/gtoHxr/Build-Pack-Maintainer-Nodejs.html\" rel=\"nofollow\">http://heroku.theresumator.com/apply/gtoHxr/Build-Pack-Maint...</a><p>Email: david@heroku.com (please include a link to your Github account)","time":1320205935,"type":"comment"},{"by":"mea36","id":3185233,"parent":3181796,"text":"Remote or Philly<p>Looking for a Django dev with front end experience and a good intuition for UX to work on new features. You should be comfortable with Django, jQuery, CSS, HTML and all that good stuff.\nWe are a marketing service for businesses utilizing QR codes and smartphones. <a href=\"http://www.youtube.com/watch?v=I6c1GuZqNHs\" rel=\"nofollow\">http://www.youtube.com/watch?v=I6c1GuZqNHs</a><p>Ideally we'd like a passionate individual who is genuinely interested in our project.<p>Contact me at mel [at] coupedout [dot] com with your resume, github account and any other fun info you'd like to share.","time":1320204101,"type":"comment"},{"by":"Zuviko","id":3182176,"kids":[3182784],"parent":3181796,"text":"Mexico City - Intern or part-time<p>We have a position open in our small software/web services company. Combo work from home/come in to office (Roma Norte/Condesa area). We're expanding our web services and want someone keen to learn: we're flexible with what tools you choose to use but you should have a decent grounding in Javascript/CSS/PHP(or similar)/MySQL. Good english is important. We really love our industry and are the current leading service provider in our field, working with top clients internationally. Email us at hire.me.mex@gmail.com for info.","time":1320157813,"type":"comment"},{"by":"samcheng","id":3183363,"parent":3181796,"text":"Mountain View, CA - Full Time - <a href=\"http://solumtech.com/careers/\" rel=\"nofollow\">http://solumtech.com/careers/</a><p>Solum gives farmers the information they need to grow crops optimally.  We build automation equipment, have a chemistry lab, and are building a fertility model from our rapidly-growing set of soil data.  This means we have a real impact in producing food while minimizing pollution from fertilizer runoff.<p>We are around 15 people strong and are hiring across many disciplines, including Software Engineering.<p>Drop us an email at jobs@solumtech.com if you are interested!","time":1320171689,"type":"comment"},{"by":"matrix","id":3184698,"parent":3181796,"text":"Salt Lake City, UT. Black Diamond<p>We're hiring .NET software developers to build the next generation of business systems for a very rapidly growing company. This is not a typical corporate gig; we have a very creative environment with lots of freedom. You would be part of a passionate group of people working as part of one of the most unusual environments a developer can find themselves in (you'll occasionally get to ski, climb and hike as part of the job).<p><a href=\"http://www.blackdiamondequipment.com/\" rel=\"nofollow\">http://www.blackdiamondequipment.com/</a>","time":1320191084,"type":"comment"},{"by":"hesamh","id":3183017,"parent":3181796,"text":"Montreal, Canada - VP Engineering, Full-time.<p>Venture-backed start-up with explosive growth looking for core team member (high equity comp).<p>* Design and coordinate build of company's tech across web and mobile<p>* Build a team of rock-star developers (hire and manage 4 direct reports)<p>* Be a though-partner on product and the business vision<p>Need to be driven, a problem-solver (tech and non-tech) and interested in stepping up to a management role.<p><a href=\"http://jobs.startupnorth.ca/job/vp-of-engineering-montreal-qc-canada-urbanorca-376a5a5646\" rel=\"nofollow\">http://jobs.startupnorth.ca/job/vp-of-engineering-montreal-q...</a>","time":1320167273,"type":"comment"},{"by":"tjriley82","id":3183655,"parent":3181796,"text":"NYC, New York - World on a Hanger - Full time (Rails/Mongo)<p>I’m looking for an exceptional Rails developer to help build a niche SaaS application within the fashion space. We’re somewhat distributed (between the US and Europe) but the core management and development team will work out of NYC. You should love to build projects from scratch, choosing the right technologies/languages for the job. You should be a little obsessive over user experience and good design and be happy joining an early stage startup. Founded by YC alums.<p>Email: tom.riley@gmail.com","time":1320174950,"type":"comment"},{"by":"amduser29","id":3182389,"parent":3181796,"text":"SF, CA - Head of Product, Mobile Devs, Frontend Devs\nLife360<p><pre><code>  - a utility used by millions of families\n  - actually wants to make a difference in people's lives\n  - working on some very ambitious goals</code></pre>\nLife360 is not<p><pre><code>  - another photo sharing app\n  - a Groupon clone\n  - built on the FB platform</code></pre>\nLife360 offers<p><pre><code>  - interesting and engaging work\n  - great pay and awesome equity\n  - lots of freedom</code></pre>\nLife360 would love to tell you more<p><pre><code>  - alex@life360.com\n  - http://life360.jobscore.com/list</code></pre>","time":1320160204,"type":"comment"},{"by":"lukatmyshu","id":3185858,"parent":3181796,"text":"New Delhi, India -- Full time.<p>I'm the CTO of a startup being funded by Airtel (largest mobile telephone provider in India) and Softbank trying to attack the mobile application landscape in India.  I was so excited about this I moved to New Delhi from San Francisco :).<p>In particular, we'll be building a free messaging solution for mobile phones.  Expect to work on systems w/ millions of concurrent connections, iOS, Android and other mobile application environments.  If you're looking for a startup in India in this space contact me @ vr@bsb.in","time":1320223054,"type":"comment"},{"by":"nwilkens","id":3182529,"parent":3181796,"text":"Monroe/Dearborn, MI - Full time<p>MNX Solutions (<a href=\"http://www.mnxsolutions.com\" rel=\"nofollow\">http://www.mnxsolutions.com</a>) is based in Monroe MI and provides managed services and consulting for Linux and SAP based systems.<p>2 x SAP basis experts to provide onsite support in Dearborn MI. Knowledge of SAP ECC / SAP XI and 5+ years of experience required.<p>Linux server administrator - Complete detail available at <a href=\"http://www.mnxsolutions.com/jobs\" rel=\"nofollow\">http://www.mnxsolutions.com/jobs</a><p>Send an email to hr@mnxsolutions.com with your details!","time":1320161694,"type":"comment"},{"by":"lawnchair","id":3181947,"parent":3181796,"text":"Baltimore, MD - Millennial Media<p>Software/Systems/QA Engineers<p><a href=\"http://www.millennialmedia.com/about-millennialmedia/careers/\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers...</a>","time":1320155139,"type":"comment"},{"by":"jackdied","id":3185054,"parent":3181796,"text":"Cambridge, MA.  HiveFire, Inc<p>Software Engineer, Engineering Manager, UI/UX Frontend (<a href=\"http://www.getcurata.com/careers\" rel=\"nofollow\">http://www.getcurata.com/careers</a>)<p>Small Django/Python shop.  We make a curation product and have actual customers who pay us actual money (crazy concept, I know).<p>As part of the engineering team you will work on a bit of everything: front end, NLP pipeline, database, devops, support.  And if you're a bowler you can join a bunch of us in the Wednesday night league at Lanes &#38; Games.","time":1320199449,"type":"comment"},{"by":"klous","id":3181928,"parent":3181796,"text":"Benzinga - Metro Detroit, MI with offices in Chicago too. Fulltime developers and designers needed to build next generation financial tools and intelligence. Launched in Jan 2010. Experiencing incredible growth in revenue and headcount, we've outgrown the last two offices. Backed by Lightbank. Skills: PHP, SQL, Drupal. Or strong UI/UX design skills.\nGet in touch: <a href=\"http://jobs.benzinga.com\" rel=\"nofollow\">http://jobs.benzinga.com</a> or scott [at] benzingapro.com","time":1320154915,"type":"comment"},{"by":"davidcuddeback","id":3183999,"parent":3181796,"text":"San Francisco, CA. Full time.<p>Identified (<a href=\"http://www.identified.com/\" rel=\"nofollow\">http://www.identified.com/</a>) is hiring engineers. Our web stack is Ruby on Rails with PostgreSQL, but we're looking for anyone who can code regardless of what languages they already know. We'd rather have smart engineers who are capable of learning new tools. We aren't married to any favorite language. Instead, we emphasize using the right tool for the job.<p>Email: david at identified dot com","time":1320179542,"type":"comment"},{"by":"suhail","id":3182971,"parent":3181796,"text":"Mixpanel is always looking for engineers to either fill out our backend team (working on a real-time data crunching datastore we built in-house) or on our front-end team (building out JS infrastructure to accelerate how fast we can build products for users).<p>Email us at jobs@mixpanel.com or head over to <a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a><p>Check out our dev blog too: <a href=\"http://code.mixpanel.com\" rel=\"nofollow\">http://code.mixpanel.com</a>","time":1320166751,"type":"comment"},{"by":"sixwing","id":3182909,"parent":3181796,"text":"San Francisco, CA (SOMA)<p>OkCupid Labs (<a href=\"http://www.okcupidlabs.com\" rel=\"nofollow\">http://www.okcupidlabs.com</a>) is hiring excellent Ruby developers, data specialists (machine learning + big data), front end developers (javascript, css, less, etc), and designers.<p>We're a new team working on new products and technologies to help connect people, online and off. It's a fun crew with awesome data and challenges to work with.<p>If interested, drop me a line at fitzpatrick AT okcupidlabs dotcom.","time":1320165929,"type":"comment"},{"by":"roobeast","id":3183272,"parent":3181796,"text":"Trulia - Downtown San Francisco<p>Looking for a few good search specialists.  Also looking for a data scientist type with an emphasis on hands on systems level work.  We make good use of solr and hadoop.  \nGreat place to work with challenging and interesting work.<p>Submit through the senior software eng position.  Actual position and title will be based on your experience.<p><a href=\"http://www.trulia.com/about/careers/Engineering\" rel=\"nofollow\">http://www.trulia.com/about/careers/Engineering</a><p>Other positions open.","time":1320170458,"type":"comment"},{"by":"ibdknox","id":3183018,"parent":3181796,"text":"San Francisco - Full Time - <a href=\"https://www.readyforzero.com\" rel=\"nofollow\">https://www.readyforzero.com</a><p>We are a YC funded company that is helping people get out of debt and are looking for Clojure and JavaScript programmers to join in. We're a company of 9 in a beautiful building in the heart of downtown San Francisco.<p>To learn a bit more, check out our jobs page: <a href=\"https://www.readyforzero.com/jobs\" rel=\"nofollow\">https://www.readyforzero.com/jobs</a>","time":1320167283,"type":"comment"},{"by":"stevewilhelm","id":3183329,"parent":3181796,"text":"Palo Alto, CA - Euclid Inc <a href=\"http://euclidelements.com/jobs\" rel=\"nofollow\">http://euclidelements.com/jobs</a><p>Front-end Web DEveloper<p>We are looking to bring on a front-end developer.  This person will be responsible for the core product’s interaction design and implementation.<p>Tools &#38; Experience\nIdeal candidate would have some formal education in computer science, but ability and experience are paramount.<p>Some expected areas of expertise:<p>* Charting libraries/data-visualization systems<p>* CSS, Javascript, JQuery, HTML 5<p>* Ruby or Python a a plus.","time":1320171262,"type":"comment"},{"by":"Mc_Big_G","id":3182826,"parent":3181796,"text":"San Francisco, CA<p>VerticalResponse is hiring developers.<p>VR is an established and successful company. We work with Rails 3, javascript, git, jQuery, RSpec, backbone.js, HAML, SASS, TDD, pair programming, agile development and other leading technologies (you don't need to have experience with all of these). I've been working there as an engineer for almost a year now and really enjoy it.<p>Apply here: <a href=\"http://jobvite.com/m?3RB34fwj\" rel=\"nofollow\">http://jobvite.com/m?3RB34fwj</a>","time":1320165072,"type":"comment"},{"by":"shanmoorthy","id":3182194,"parent":3181796,"text":"Melbourne, Australia - Full Time - <a href=\"http://www.penguin.com.au\" rel=\"nofollow\">http://www.penguin.com.au</a><p>Penguin Books (Australia) is looking for a frontend developer to work on our websites, webapps and mobile apps. We'll reward your awesome client-side programming skills by providing you with books and other literary perks.<p>Read the details and apply at <a href=\"http://www.seek.com.au/Job/20972554\" rel=\"nofollow\">http://www.seek.com.au/Job/20972554</a>","time":1320158104,"type":"comment"},{"by":"chpir","id":3193006,"parent":3181796,"text":"Durham, NC - Junior software engineer - Center for Health Policy and Inequalities Research @ Duke University<p>We are looking for a junior software developer to work with public health researchers at the Center for Health Policy and Inequalities Research (CHPIR). We are part of the Duke Global Health Institute at Duke University.<p>Lots more information: <a href=\"http://bit.ly/chpir-software-developer-job\" rel=\"nofollow\">http://bit.ly/chpir-software-developer-job</a>","time":1320344174,"type":"comment"},{"by":"drp","id":3182806,"parent":3181796,"text":"San Francisco, CA<p>HotPads - <a href=\"http://hotpads.com/pages/jobs.htm\" rel=\"nofollow\">http://hotpads.com/pages/jobs.htm</a><p>HotPads is hiring software engineers and web user interface developers to work in our San Francisco office.  We're a small, lively company building and running a popular map-based housing search engine that's used by millions of people each month, so we need driven individuals who want make an impact on the way people find housing.<p>dpeters@hotpads.com","time":1320164845,"type":"comment"},{"deleted":true,"id":3182532,"parent":3181796,"time":1320161712,"type":"comment"},{"by":"jasonshen","id":3185348,"parent":3181796,"text":"Ridejoy (YC S11) is hiring full-stack engineers in San Francisco!<p>We're building a social transportation startup and changing the way people get around. Starting with long-distance rideshare along the West Coast but our ambitions are much greater.<p>We're well-funded and looking for our first hires to join the team (just the 3 cofounders now) - <a href=\"http://ridejoy.com/jobs?from=hnjobs\" rel=\"nofollow\">http://ridejoy.com/jobs?from=hnjobs</a>","time":1320206194,"type":"comment"},{"by":"danielpatricio","id":3185282,"parent":3181796,"text":"Toronto. Full time.<p>Pinpoint Social is a self service marketing platform for Facebook Pages. We are focused on building a simple to use app and become the Mailchimp of the Facebook marketing world.<p>We are looking to grow our technical team.<p>Our design is sharp, our platform is metrics and performance driven and we have an awesome office in downtown Toronto.<p>Check out - <a href=\"http://pinpointsocial.com\" rel=\"nofollow\">http://pinpointsocial.com</a><p>or drop me a line at daniel@pinpointsocial.com","time":1320204921,"type":"comment"},{"by":"raerae7133","id":3182818,"parent":3181796,"text":"San Francisco, CA - Recurly\nSenior UI developer: <a href=\"http://jobs.github.com/positions/f90d8c4c-f075-11e0-9dce-f2327d684b32\" rel=\"nofollow\">http://jobs.github.com/positions/f90d8c4c-f075-11e0-9dce-f23...</a>\nRails developer:\n<a href=\"http://recurly.jobscore.com/jobs/recurly/ruby-on-rails-developer/d2XqwGrOKr4iezeJe4bk1X\" rel=\"nofollow\">http://recurly.jobscore.com/jobs/recurly/ruby-on-rails-devel...</a>","time":1320164991,"type":"comment"},{"by":"adriannered","id":3197547,"parent":3181796,"text":"San Francisco and Seattle. Full Time.<p>Software Engineers<p>We are growing rapidly and have multiple opportunities available for highly skilled Software Engineers. Candidates will use their strong engineering/analytical skills and personal drive to help us forge the way in this new, fun and fast-growing industry -- a potential multi-billion dollar market.<p>TO APPLY: <a href=\"http://jobvite.com/m?3DBDbfwM\" rel=\"nofollow\">http://jobvite.com/m?3DBDbfwM</a>","time":1320437959,"type":"comment"},{"by":"mmettler","id":3188928,"parent":3181796,"text":"San Francisco, CA - H1B<p>card.io is hiring talented software engineers!<p>We are a well-funded mobile payments start-up. We are building software to enable simple, low-friction transactions on mobile devices. We're working on interesting and challenging problems. We believe in real work/life balance, and generous compensation, benefits, and vacation.<p>Check out: <a href=\"https://gist.github.com/821454/\" rel=\"nofollow\">https://gist.github.com/821454/</a>","time":1320267916,"type":"comment"},{"by":"bentoner","id":3181954,"parent":3181796,"text":"Melbourne, Australia<p>We're hiring INTERNs to do software development.<p>We're a small startup based in Carlton, near The University of Melbourne. You'll be working with us to launch our first product, a tool that makes it easier to coauthor documents.<p>We're mainly looking for maths/CS/physics types who want to work on hard algorithmic problems.<p>See the details at <a href=\"http://contextualsystems.com/jobs/\" rel=\"nofollow\">http://contextualsystems.com/jobs/</a>","time":1320155203,"type":"comment"},{"by":"mefeedia","id":3182066,"parent":3181796,"text":"MeFeedia - Ormond Beach, FL and  Burbank, CA - <a href=\"http://www.mefeedia.com\" rel=\"nofollow\">http://www.mefeedia.com</a><p>REMOTE or Local<p>Web Developers, App Developers, and Designers with a passion for video are needed. Experience in high scalability environments a must. Ability to solve difficult problems with search.<p>Technologies used\n- PHP\n- MySQL\n- Redis\n- Nginx\n- JQuery\n- Sphinx\n- iOS\n- Android (Phone, Tablet, and TV)<p>Contact\njobs@mefeedia.com","time":1320156513,"type":"comment"},{"by":"gducharme","id":3186686,"parent":3181796,"text":"Medidata is a leading provider of software as a service solutions for clinical trial management and execution. We assist our clients who have developed a compound, device, or procedure to prove that it is safe and effective by designing and planning a clinical trial, recruiting participants, executing a trial, collecting data, analyzing the data for safety and efficacy, generating the submission materials, and then submitting those materials to the appropriate regulatory agency for regulatory approval. The Medidata clinical service platform is built on the principles of distributed computing and service oriented architecture.<p>Medidata is located in Manhattan. We have a flexible office culture that allows people to work from home. We value face-to-face communication and use technology to promote that in a distributed environment. We keep teams small and self organizing. We demand quality. We like to ship our code into the cloud frequently using Chef and OpsCode. We are dedicated to agile development. Because we handle sensitive and potentially urgent medical information concerning the health of real people we take testing very seriously. All engineers write tests first.<p>Medidata values innovation and research. We support research projects through innovation time that allows qualifying engineers to devote 15% of their time to individual research projects. We value and support open source software. We expect our engineers to continuously be questioning, researching, simplifying, learning, and improving. The open source world moves fast and we expect all of our engineers to be in the lead.<p>What we are looking for:\nMedidata is looking for Ruby and Rails engineers or for talented engineers interested in learning Ruby and Rails. We expect our Rails engineers to be database savvy and excited to run a query profiler. We want engineers interested in MySql, NoSql, and graph databases. Candidates should not be scared of big O notation and like to consider space and time characteristics of their data structures and algorithms. Candidates will work with Unix, Git, Ruby, Css, Javascript, Chef, Goliath, EventMachine, MySQL, NoSQL, and lots of Cucumber and RSpec. They know HTTP. Candidates care about building simple, intuitive, user experiences. They know REST is more than clean URLs. They want to design small, isolated, highly available, fault tolerant, scalable services. We like our candidates to be curious. Candidates should like to get their hands dirty. They are fanatical about quality. They are fanatical about performance.","time":1320242838,"type":"comment"},{"by":"MartinCron","id":3184161,"parent":3181796,"text":"Seattle, WA. Software Developer. Full Time.<p>We're a startup (EnviroLytical) within a successful established company (EnviroIssues). We make software to help large projects engage with the public in effective and efficient ways.<p>Full posting here:\n<a href=\"http://seattle.craigslist.org/see/eng/2666952134.html\" rel=\"nofollow\">http://seattle.craigslist.org/see/eng/2666952134.html</a><p>Or email me directly: mcron@enviroissues.com","time":1320181879,"type":"comment"},{"by":"JonM","id":3195761,"parent":3181796,"text":"Leeds, UK (no remote) - Pitch Hero Limited<p>Sports website with 1.5MM+ UVs/month, looking for Developer (Frontend &#38; OO PHP) &#38; Mobile Developer (iPhone / Android / Mobile Web). £Competative salary and possible stock options. Small team, big opportunity.<p>Interns and University placement students also considered for the mobile role.<p><a href=\"http://www.pitchero.com/jobs/\" rel=\"nofollow\">http://www.pitchero.com/jobs/</a>","time":1320409500,"type":"comment"},{"by":"Sikul","id":3184742,"parent":3181796,"text":"Riot Games, Santa Monica, CA<p>Come work on the game League of Legends, one of the most popular PC games in the world.<p>We're looking for a lot of things, including Ruby/Rails, Erlang, Java, C++, Flex, and PHP developers.<p><a href=\"http://www.riotgames.com/careers/job-openings-0\" rel=\"nofollow\">http://www.riotgames.com/careers/job-openings-0</a><p>If you're a Ruby, Java, or Erlang developer you can email me directly.  My email is in my profile.","time":1320192388,"type":"comment"},{"by":"zaru","id":3189466,"parent":3181796,"text":"Palo Alto, CA right on University Ave<p>Full time web developer<p>BumeBox.com, a social media marketing platform<p>We are just 6 months old and are 7 people strong.  As a member of the team you will develop production DHTML, CSS, and AJAX apps. Come join us if you want to get in on the ground floor. Bonus points for marketing and social media savvy.<p>Email me directly if interested and be sure to mention HN - nathan@bumebox.com","time":1320277709,"type":"comment"},{"by":"mmattax","id":3183127,"kids":[3184573],"parent":3181796,"text":"Indianapolis, IN. Full Time - <a href=\"http://www.formstack.com/careers.html\" rel=\"nofollow\">http://www.formstack.com/careers.html</a><p>We are an online form and landing page builder. We are growing like crazy and are looking for software developers (We use PHP here), and sys. admin person to work on our server architecture.<p>Email: michael&#60;at&#62;formstack&#60;dot&#62;com","time":1320168596,"type":"comment"},{"by":"pjo","id":3182446,"parent":3181796,"text":"Conshohocken, PA - Monetate (Suburb of Philadelphia, PA)<p>We're hiring at Monetate. We've hired great people from HN.<p>We're a SAAS provider of testing, targeting and personalization tools (i.e. segmentation, A/B testing, MVT). We've got existing high-volume customers.<p><a href=\"http://jobs.monetate.com/\" rel=\"nofollow\">http://jobs.monetate.com/</a><p>* Backend Software Engineers<p>* Front-end Developer<p>* Systems Engineer<p>* Web Production Designer<p>Feel free to contact pat at monetate.com","time":1320160790,"type":"comment"},{"by":"hank808","id":3182847,"parent":3181796,"text":"HP Cloud Services (HPCS) is hiring for various positions in various locations in the US and abroad (UK, India, etc.).  To see the exact positions, visit the HP jobs site at <a href=\"https://hp.taleo.net/careersection/2/jobsearch.ftl\" rel=\"nofollow\">https://hp.taleo.net/careersection/2/jobsearch.ftl</a> and search for keyword \"HPCS\".","time":1320165257,"type":"comment"},{"by":"flippyhead","id":3182462,"parent":3181796,"text":"Seattle, WA (or anywhere)\n<a href=\"http://pathable.com\" rel=\"nofollow\">http://pathable.com</a><p>Looking for designers and front-end coffeescript/javascript developers. We build fantastic social software for the event and conference industry. We're profitable, growing quickly, and offer competitive compensation and full benefits.<p>Apply here: jobs@pathable.com","time":1320160957,"type":"comment"},{"by":"makira","id":3184627,"parent":3181796,"text":"Montreal, Canada.\nWe need a full time MacOS developer.\nIf you're good in cocoa, and know macos x internals, contact me.\n<a href=\"http://jobs.startupnorth.ca/job/programmer-montreal-qc-canada-metakine-f5e3c7f58f/?d=1&#38;source=site_home\" rel=\"nofollow\">http://jobs.startupnorth.ca/job/programmer-montreal-qc-canad...</a>","time":1320190003,"type":"comment"},{"by":"mikek","id":3184356,"parent":3181796,"text":"Mountain View, CA.  Kiwi Crate - Full time.<p>We're a newly launched startup funded by First Round Capital and Seth Goldstein, among others.<p>We've got some specific jobs listed here:<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a><p>We're also always looking to talk to talented people who don't quite fit the description on the jobs page!<p>Email:  jobs@kiwicrate.com","time":1320185011,"type":"comment"},{"by":"mikeklaas","id":3184091,"parent":3181796,"text":"San Francisco (SOMA).  Full-time / H1B<p>CTO of an intelligent iPad news app (<a href=\"http://zite.com\" rel=\"nofollow\">http://zite.com</a>).  Looking for front- and back-end engineers.  Data scientists.  People who care about the future of news reading.<p>We're a growing team and about to move into a killer office on South Park.  email:klaas@zite.com","time":1320180829,"type":"comment"},{"by":"smilliken","id":3183927,"parent":3181796,"text":"San Francisco, CA. Full time.<p>MixRank (YC S11) is crawling the web and indexing ads. We see everything: banners, text ads, placements, keywords, split tests, etc.<p>We're looking for smart engineers to solve big data problems with us.<p>Job post: <a href=\"http://news.ycombinator.com/item?id=3160100\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3160100</a><p>jobs@mixrank.com","time":1320178236,"type":"comment"},{"by":"jsr","id":3184718,"parent":3181796,"text":"California, New York and London - Multiple positions INTERN, REMOTE, H1B welcome<p>10gen is the primary sponsor of the MongoDB open source database. We're hiring rapidly in all roles and we'd love to hire you!<p>Current list of openings here: <a href=\"http://jobvite.com/m?3dFtbfwg\" rel=\"nofollow\">http://jobvite.com/m?3dFtbfwg</a>","time":1320191682,"type":"comment"},{"by":"InfinityX0","id":3182880,"parent":3181796,"text":"Bellevue, WA - Senior Software Engineer - ClassifiedAds.com<p>I don't work directly with this arm of our company, but here's more details on the job description: <a href=\"http://www.classifiedads.com/technical_jobs-ad4787967.htm\" rel=\"nofollow\">http://www.classifiedads.com/technical_jobs-ad4787967.htm</a>","time":1320165565,"type":"comment"},{"by":"darose","id":3183554,"parent":3181796,"text":"New York, NY. Full time.<p>Sense Networks is hiring for a Hadoop-oriented Junior Engineer spot.<p>Details at:  <a href=\"http://jobs.nytm.org/job/junior-software-engineer-back-end-data-team-entry-new-york-ny-sense-networks-inc-159cc98c2a/\" rel=\"nofollow\">http://jobs.nytm.org/job/junior-software-engineer-back-end-d...</a>","time":1320173804,"type":"comment"},{"by":"cientifico","id":3182267,"kids":[3182540],"parent":3181796,"text":"In WOOGA (Berlin) we are always hiring.<p>We develop social games, have more than 30 Million Monthly Users, and use rails, node, erlang, or whatever is good for the case.<p>But could be easier if you just look to all the opportunities in: <a href=\"http://www.wooga.com/jobs/\" rel=\"nofollow\">http://www.wooga.com/jobs/</a><p>40 OPEN POSITONS.","time":1320158895,"type":"comment"},{"by":"psota","id":3182764,"kids":[3183921],"parent":3181796,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers -- UI/UX, frontend, backend data mining/algorithms. Full time and internships available.<p>See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1320164225,"type":"comment"},{"by":"bschaefer","id":3182614,"parent":3181796,"text":"Berlin, Germany - <a href=\"http://1000jobboersen.de\" rel=\"nofollow\">http://1000jobboersen.de</a><p>We're an internet startup shaking up the HR industry in Germany, and we're looking for:<p>* A front end developer<p>* A UI/UX designer<p>* Junior ruby developers<p>* Senior developers<p>I'm one of the lead devs -- drop me a line if you want to know more!<p>Email: bernerd.schaefer@1000jobboersen.de","time":1320162709,"type":"comment"},{"by":"bigtangringo","id":3184950,"kids":[3185078],"parent":3181796,"text":"Phoenix, AZ INTERN REMOTE (US citizens only)<p>I'm a developer/entrepreneur looking for help from a talented intern in building an online pencil-and-paper-style RPG. I also have a handful of other projects that you may end up working on. US timezones preferred. I'll be laying out the high-level architecture, you'll be working with one other part time entry level developer to fill in the pieces.<p>Required familiarity or experience:\nHTML, JavaScript (mostly jQuery), Java, Strong google-fu, Google AppEngine, Google Web Toolkit, GWT-Platform, Pencil and paper RPGs, specifically Dungeons and Dragons 3.5<p>Bonus round:\nNetbeans, Android/iOS, Git or Subversion<p>Compensation:\nYou'll be a 1099 contractor, paid hourly at $7.25/hr, up to 70 hours per month (read: part time), but possibly less.<p>Email to jeff@jeffrodriguez.com, mention \"Zero One Intern\" in the subject:\nResume,  Any projects you're involved in, open source or otherwise. Social profile URLs (Github, Stack Overflow, FB, G+, twitter). Any other information you think might be relevant.<p>Thanks!","time":1320196971,"type":"comment"},{"by":"davejazz","id":3183034,"parent":3181796,"text":"New York City - Full Time - Unruly Media<p>Come work with me in the product department in a (very) fast growing company.<p>Details: <a href=\"http://www.unrulymedia.com/positions/solutions-engineer-new-york.html\" rel=\"nofollow\">http://www.unrulymedia.com/positions/solutions-engineer-new-...</a>","time":1320167493,"type":"comment"},{"by":"yosho","id":3184589,"kids":[3184595],"parent":3181796,"text":"San Francisco, CA. Full Time<p>We're Ravn.com (<a href=\"http://ravn.com\" rel=\"nofollow\">http://ravn.com</a>) looking for front-end developers.<p>We want someone that has:<p>- Great Decision Sense<p>- Deep understanding in HTML, CSS, JS<p>- Attention to Detail<p>- Awesome Personality<p>- Experience with RoR<p>- Self Motivated<p>- Works hard, enjoys startup culture<p>Bonuses:<p>- CS Degree or Engineering Degree<p>- Artistic Ability<p>- Enjoys the outdoors, new activities<p>If interested, please send resumes to hello@ravn.com","time":1320189222,"type":"comment"},{"by":"dlipton","id":3183931,"kids":[3184074],"parent":3181796,"text":"Montreal (or willing to eventually relocate). Full-time<p>Destroy HQ is looking for top-notch Flash and Java developers to work on a new kind of social game. Must love giant robots.<p>More info at <a href=\"http://www.destroyhq.com/\" rel=\"nofollow\">http://www.destroyhq.com/</a>","time":1320178269,"type":"comment"},{"by":"SMcDermott","id":3182876,"parent":3181796,"text":"New York City-- We at Tumblr (East 21st in NYC) are hiring android, ios developers, and senior-level product and platform (php,mysql, java) engineers.  You can e-mail me at sean@tumblr.com if interested<p>thanks\nSean McDermott, Recruiting Manager, Tumblr","time":1320165507,"type":"comment"},{"by":"plnewman","id":3182976,"parent":3181796,"text":"Foster City, California<p>Rearden Commerce<p>I have two software engineering positions open, flexible on level. Please take a look at this and shoot me an email if it sounds interesting: <a href=\"http://www.heyimhiring.com/\" rel=\"nofollow\">http://www.heyimhiring.com/</a>","time":1320166772,"type":"comment"},{"by":"devongall","id":3184200,"parent":3181796,"text":"Waterloo, Ontario (Canada) or the Valley.  Rails Developer. Full Time.<p>We're Vidyard, a YC S11 startup building an online video platform for businesses.  We're looking for back and front-end engineers with significant web-development experience.","time":1320182488,"type":"comment"},{"by":"dshah","id":3182635,"parent":3181796,"text":"HubSpot in Cambridge, MA<p>Looking for web developers (Python/Django and Java).<p>Voted best company to work for in the Boston area, 2 years in a row.<p>See <a href=\"http://BostonBattle.com\" rel=\"nofollow\">http://BostonBattle.com</a> for details (including $10,000 referral bonus)","time":1320162953,"type":"comment"},{"by":"tremendo","id":3197297,"parent":3181796,"text":"Scottsdale/Phoenix AZ, jQuery Mobile Web App developer.<p>Sage Software:\n<a href=\"http://sage.referrals.selectminds.com/jobs/28125?mt=39071_45577_53961\" rel=\"nofollow\">http://sage.referrals.selectminds.com/jobs/28125?mt=39071_45...</a>","time":1320433335,"type":"comment"},{"by":"GavinB","id":3184458,"parent":3181796,"text":"New York City<p>Scholastic (the children's book publisher)<p>- Game Design &#38; Production Intern<p>- Game Art Intern<p>Both are six month paid internships. If you're in school, we're happy to work with you to set up academic credit. Full time preferred, but part time is possible as well.<p>gbrown@scholastic.com","time":1320186656,"type":"comment"},{"by":"rishikhullar","id":3184318,"kids":[3185073],"parent":3181796,"text":"Chicago, IL – Utellit – INTERN, Full time, REMOTE is fine.<p>Utellit is looking for a full time software engineer as well as a full time graphic designer.<p>Utellit is adding voice everywhere to make the ways we communicate more personal.   Here’s an overview that was published yesterday: <a href=\"http://socialmediaclub.org/blogs/from-the-clubhouse/chicago’s-startup-scene-bringing-social-whole-new-level\" rel=\"nofollow\">http://socialmediaclub.org/blogs/from-the-clubhouse/chicago’...</a>.<p>Please apply by emailing me at rishi@utell.it.  Feel free to send your resume but I’m more interested in seeing what you’ve built and having a conversation about it.   Please note that these are unpaid internship positions and that you don’t have to reside in Chicago.<p>Website:  <a href=\"http://utell.it/\" rel=\"nofollow\">http://utell.it/</a>\nContact:  rishi@utell.it","time":1320184413,"type":"comment"},{"by":"gbog","id":3182150,"parent":3181796,"text":"Beijing, China. Douban Inc. (douban.com), 50M active users. Mandarin required.","time":1320157499,"type":"comment"},{"by":"bbperkspot","id":3184370,"kids":[3188862],"parent":3181796,"text":"PerkSpot, Chicago. UX and Design.<p>Help us make employee benefits and insurance less awful!  \n<a href=\"http://www.perkspot.com/web-designer-and-ux-ninja/\" rel=\"nofollow\">http://www.perkspot.com/web-designer-and-ux-ninja/</a>","time":1320185364,"type":"comment"},{"by":"hendler","id":3182391,"parent":3181796,"text":"BetterLesson, Cambridge MA<p>Resources for k-12 teachers. Recently closed Series A.<p>Fulltime, on site, we share a space with two other startups.<p>- Lead UI/UX/Design(production)\n - Developer (LAMP mostly/Scala/AWS)<p>email jonathan.hendler@betterlesson.com","time":1320160208,"type":"comment"},{"by":"gregdetre","id":3182220,"parent":3181796,"text":"iOS - London - full time - Memrise - <a href=\"http://www.memrise.com\" rel=\"nofollow\">http://www.memrise.com</a><p>We're seed-funded, just out of TechStars Boston, and we have thousands of happy users, clamouring to hear about progress on an iPhone app.<p>If you like the idea of a deeply creative, technically demanding role in a company that aims to make all learning fast, fun, mobile and effective, please send an email with CV or questions to jobs at memrise.com.<p>Join us in our mission to give the world a better memory.","time":1320158437,"type":"comment"},{"by":"grandalf","id":3183920,"parent":3181796,"text":"San Francisco, Full Time.<p>Our team boasts a perfect SAT and a black belt in Tae Kwon Do.<p>Join us.  Great salary, great perks. Office in mission. If you want to learn more message me at hackermessages.org","time":1320178099,"type":"comment"},{"by":"bobwaycott","id":3200847,"parent":3181796,"text":"Chattanooga, TN. Full-time, on-site.<p>Small, four-person creative/interactive team at EPB (electric power &#38; fiber optics internet/tv/phone service provider). We're looking for our 5th member.<p>We have a great working environment:<p>* The only employees who aren't stuck in cubicles\n* Wear what you want (I've worn shorts &#38; flip-flops the last 5 mos)\n* Top-of-the-line hardware--no cheap stuff\n* Really smart, creative team members who want to build great products<p>Current team:\n* 1 creative director/designer\n* 1 front-end UI/UX developer (who happens to be a jQuery core dev)\n* 1 back-end developer (who does a lot more than sling code)\n* Me--team lead, interactive director, co-developer, meeting-goer, idea-seller<p>We maintain and build apps/modules for the company's public sites, which presently are Python/Django-based. We've built a few internal apps--relied upon daily for core business operations--in Ruby. We also have a couple random things written in Haskell &#38; Scala which may or may not stick around. We are not married to any single language or platform.<p>We need a great developer comfortable and familiar with Python/Django, Ruby, and Objective-C/iOS above all things. We have a number of interesting projects in the works for each of these platforms. If you are into Android development, that could work, too.<p>We work hard at securing future interesting product work for the team--mobile apps, internal products, MediaRoom application development (for set top boxes), etc.<p>We're looking for a girl or guy who is interested in learning and building great products on any platform, who cares about delivering a fantastic experience for customers and employees alike. Someone capable of self-management, who has opinions on the right way to do things. We collaborate on everything, and are not afraid to hash something out for two hours until we believe we've got it right. We want you to be that kind of person, too.<p>We're the company's first and only creative/interactive team, and we enjoy autonomy in deciding our platforms, languages, technology, etc. We have no overlords who tell us how to do our jobs. You'll find yourself asked to be part of our decision-making on new products.<p>If any of this sounds interesting, we'd love to talk with you (and will probably ask you to meet up for lunch or something).<p>Official job description (apologies for the over-corporate-y-ness of it):\n<a href=\"http://www.epb.net/about/careers/jobs/web-and-ios-developer/\" rel=\"nofollow\">http://www.epb.net/about/careers/jobs/web-and-ios-developer/</a><p>Drop me a line and a CV: waycottb@epb.net.","time":1320525477,"type":"comment"},{"by":"mattculbreth","id":3181846,"parent":3181796,"text":"Endgame Systems in Atlanta<p>Python, Django, jQuery, Cassandra, Hadoop. We're ventured-backed, we do cool stuff, and we use awesome technology and tools.","time":1320153871,"type":"comment"},{"by":"agamrp","id":3182905,"parent":3181796,"text":"Chicago, IL. Backend Engineers at Cloudbot - Full time.<p><a href=\"http://cloudbot.com/jobs\" rel=\"nofollow\">http://cloudbot.com/jobs</a>","time":1320165905,"type":"comment"},{"by":"20","id":3184909,"parent":3181796,"text":"TED Conferences: <a href=\"http://www.ted.com/pages/jobs\" rel=\"nofollow\">http://www.ted.com/pages/jobs</a>","time":1320195952,"type":"comment"},{"by":"kontagentjobs","id":3184814,"kids":[3184930],"parent":3181796,"text":"Kontagent in San Francisco, CA<p>Frontend + backend tech leads and devs.<p>Kontagent is the leading user analytics platform for developers, marketers, product managers and strategic partners across the social and mobile web.<p>Good comp, good perks (free catered lunch, gym membership), great work environment - high aptitude/ low attitude.<p>Check us out: kontagent.com/careers","time":1320193891,"type":"comment"},{"by":"galenward","id":3183254,"parent":3181796,"text":"At Estately we are building the Gmail of real estate to empower consumers to find and buy homes online. We're small and scrappy, but with a huge vision. We're profitable and we serve hundreds of thousands of users a month. Estately is in a unique position to upend the $50+ billion real estate industry with a small, technically-obsessed team.<p>We are actively looking for a new market manager / office manager to do amazing work as part of our team.<p>You can boil legal mumbo-jumbo into a succinct bulleted list and manage 10+ projects with a variety of deadlines moving forward simultaneously. You can figure out how to get a company registered in any state, read a complex set of rules and figure out the cheapest and fastest way to comply, you can assuage grumpy bureaucrats and you are capable at smooth talking your way through red tape. You can also document and organize the results of these efforts.<p>You are a a hyper-organized, detail-oriented, driven person who is interested in wearing a lot of hats to help our startup grow to become huge. You are driven to accomplish a lot and learn a lot very quickly. You are resourceful, upbeat, and enjoy getting things done on a budget (translation: you must be frugal, scrappy, and happy). You have web and computing skills, including maybe a little HTML and a good command of Microsoft Office.<p>You will assist in preparation of legal documents, including: \nPlan, organize, and execute long, multi-step process of setting up each new market\nFind and summarize relevant rules and regulations in various states\nCompose, draft, transcribe, and revise documents and forms as required\nCorrectly calculate fees, prepare checks, and submit to appropriate agency as required<p>When you aren’t moving us into new markets, you’ll have a host of everything-you-need-to-run-a-startup responsibilities:\nGet stuff here: Order, pick-up and assemble new desks, setup printers and computers\nRecruiting: draft job postings, reviewing and phone screen job applicants, schedule interviews and generally find phenomenal candidates for our open positions\nKeep state and local filings up-to-date\nFiling - state filings, employee paperwork\nEvaluating bug reports (no user left behind!): communicating with users to get to the bottom of the problem, documenting it so our developers can fix it and circling back with the user when it’s fixed\nSpreading cheer - be upbeat always and keep things lively. Maybe even help prepare for parties now and then\nEnsure that physical and electronic project files are properly generated and maintained, including\nExec admin – arrange board meetings, do lightweight word/powerpoint/excel prep and whatever else the CEO needs to keep moving quickly<p>Background: \nYou have some professional business experience on your resume, and have a college degree<p>You must be able to work autonomously to drive numerous projects simultaneously and you must be adept at project and information management. You must be comfortable digging deep--both online and on the phone--to determine the laws and rules applicable to our business and follow through on your plan to comply with all such laws and rules while accomplishing Estately’s objectives.<p>Although this is a junior position, you will play a key role at an angel-backed, quickly growing startup. You will report to the CEO of the firm. As good writing skills are important to this job, please include a short (~2 paragraph) plan of attack for helping a user who has written in telling us that the price is wrong on one of the properties on our site.<p>If you are looking for an exciting, demanding job that provides unique experience and gives you a chance to shine, this is a special opportunity.<p>Send me an email at jobs@estately.com.","time":1320170187,"type":"comment"},{"by":"stuffihavemade","id":3206725,"parent":3181796,"text":"REMOTE [Full Time]<p><a href=\"http://www.trackabout.com\" rel=\"nofollow\">http://www.trackabout.com</a><p>apply at <a href=\"http://trackabout.theresumator.com/apply/njfPJu/Senior-WebMobile-NET-Software-Engineer-Telecommute.html\" rel=\"nofollow\">http://trackabout.theresumator.com/apply/njfPJu/Senior-WebMo...</a><p>TrackAbout is a profitable and growing software company providing asset tracking and rental services via the internet using a Software as a Service (SaaS) business model. Our customers use a variety of mobile devices to record the movements of their valuable assets.  Data is stored and made available through our hosted web site and web services. Visit trackabout.com for more information on what we do.<p>We are experiencing high demand for our services and we are growing. We need great people who are interested in playing pivotal roles in the growth of a small company. Our customer base is very dependable and we consider ourselves lucky to be doing well even in this soft economy.<p>We are seeking an exceptional and experienced developer who is truly passionate about technology and the craft of software development.<p>This is a full-time position, not a contract.<p>Our development staff is completely virtual (no office) and each developer works from home. We are not considering applicants outside the U.S.<p>You'll be working on all aspects of the TrackAbout offering including our ASP.NET website and web services, MS SQL Server and developing for various mobile devices. Your responsibilities will include designing and building new features, enhancing existing features, and fixing (gasp) bugs.<p>All members of our development team are dedicated to keeping up with the latest technologies, practices, patterns and tools related to software development. We take time out to share our knowledge with one another and improve both our skills and our distributed development environment. We often experiment with and integrate new tools into our environment. Some of the tools and technologies we're currently using include: ReSharper, Subversion, MassTransit, Jenkins CI, TDD with NUnit, VersionOne, MediaWiki, WCF, RESTful web services, RhinoMocks, Ninject, NHibernate and jQuery.<p>Required Technical Skills:<p><pre><code>    Building web-based applications and web services\n    Object-oriented programming fundamentals\n    C#\n    ASP.NET WebForms (MVC in the future)\n    HTML/CSS/javascript\n    MSSQL programming skills (sprocs, udfs, triggers, indexes, constraints, etc.)\n    XML/XSD/XSLT\n    Experience with SCM/version control\n</code></pre>\nNice-to-Haves:<p><pre><code>    Experience with common OO design patterns\n    Test-driven development (TDD)\n    Mobile device development\n    I18N and L10N development experience\n    Experience in Agile environments\n</code></pre>\nSince this is a work-at-home position, you'll be expected to be able work independently and unsupervised, but with clear goals and direction. We are quality- and results-oriented and we don't micromanage.<p>We look for the following:<p><pre><code>    Passion\n    Solid interpersonal, organizational and task-management skills\n    Insatiable curiosity, a love of learning and a desire to continuously improve\n    Friendliness\n    Team-orientation\n    Fanatical attention to detail</code></pre>","time":1320681536,"type":"comment"},{"by":"mookie","id":3183946,"parent":3181796,"text":"San Mateo, Full Time - SuccessFactors<p>The Jam product is a social collaboration tool in the SuccessFactors Business Execution suite that allows employees to communicate with each other and share information and knowledge, combining leading consumer social media products with enterprise productivity.  The Jam engineering team is looking for a Software Engineer to join our great team. The successful candidate will join a senior team of architects, systems experts, QA professionals, and world-class web developers from both the enterprise and the consumer web markets.<p>If you’re excited about delivering software, this is the team for you.  We ship our software weekly and facilitate this by living test driven development.  This means you get about 50 releases a year to get the code you’ve written in the hands of a user.<p>You will work closely with Operations, Quality Assurance, Product Management, and Customer Support teams to implement, test and deliver new features for the Jam product.  The ideal candidate is a self-starter who is eager to learn and use new technologies to build innovative applications.  Experience administering Linux systems is a must and experience building web applications with Ruby on Rails is a plus.  You will be responsible for coding and delivering new product features using the Ruby on Rails framework, as well as troubleshooting and identifying any issues seen in our production Linux, Apache, Rails and MySQL environments.  A more senior level role is negotiable in this position.<p>Duties and Responsibilities:<p>*\tWork closely with others to develop new features and site improvements<p>*\tSupport new and existing customers using the Jam product by providing bug fixes in a timely manner<p>*\tTroubleshoot Linux environments for Production, Staging, and QA<p>*\tImplement backend server side code in Ruby on Rails and MySQL<p>*\tBuild new features with a Test Driven Development methodology<p>*\tExcel in a highly iterative development process with weekly production releases<p>*\tTake ownership and help test, release, and maintain your code<p>Requirements:<p>*\t3-4 years of experience building software and a proven track record of getting stuff done<p>*\tB.S. Computer Science or related field<p>*\tFamiliar with MySQL, Linux, networking, and storage technology<p>*\tExperience installing, configuring, and administering Linux systems (Debian preferred)<p>*\tGood understanding of object oriented design and various design patterns<p>*\tAbility to understand and master new technologies quickly<p>*\tStrong focus on quality and generating results<p>*\tSelf-disciplined with strong attention to detail<p>*\tExcellent written and oral communications<p>Also a Plus:<p>*\tExperience with Ruby on Rails is preferred<p>*\tExperience building highly available, secure and scalable enterprise products<p>*\tExperienced in test driven development and various application development methodologies from waterfall to agile. SaaS delivery experience is highly desirable.<p>Please apply via:\n<a href=\"https://performancemanager4.successfactors.com/sfcareer/jobreqcareer?jobId=12652&#38;company=sf&#38;username\" rel=\"nofollow\">https://performancemanager4.successfactors.com/sfcareer/jobr...</a>","time":1320178563,"type":"comment"},{"deleted":true,"id":3182728,"parent":3181796,"time":1320163940,"type":"comment"},{"by":"pabloest","id":3182252,"parent":3181796,"text":"San Francisco, CA and London, UK<p>Meraki - <a href=\"http://meraki.com\" rel=\"nofollow\">http://meraki.com</a><p>Meraki is the leader in cloud networking and we have over 18,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://meraki.com/customers\" rel=\"nofollow\">http://meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco.<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>We’re looking to hire in San Francisco and we have a few positions open in London as noted.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical operating data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services for all of those thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you will be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business; we are also growing quickly, with a proven model for our technology, so your work will reach many customers and have a huge impact.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://meraki.com/company/jobs#ui_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#ui_eng</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://meraki.com/company/jobs#bs_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#bs_eng</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://meraki.com/company/jobs#fw_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#fw_eng</a><p>* Hardware Program: passionate for research, product specs, engineering, project management, and manufacturing/quality (ME, EE or similar).\n<a href=\"http://meraki.com/company/jobs#hardware-program-engineer\" rel=\"nofollow\">http://meraki.com/company/jobs#hardware-program-engineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://meraki.com/company/jobs#product_mktg\" rel=\"nofollow\">http://meraki.com/company/jobs#product_mktg</a><p>* Marketing Manager: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr</a><p>* [London] Marketing Manager - Europe: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr_emea\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr_emea</a><p>// Support<p>* Inside Pre-Sales / Technical Support Engineering: sharp, energetic, and pre-sales and technical support engineer who can work closely with many groups within the company, including sales and product management, as well as with engineering to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://meraki.com/company/jobs#tech_support_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#tech_support_eng</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, channel sales, sales engineers, and strategic sales. Our London office is also looking for sales representatives, with a focus on DACH and other areas within Europe, Africa, and Russia.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1320158733,"type":"comment"},{"by":"leeny","id":3182115,"kids":[3182997],"parent":3181796,"text":"San Mateo, CA - Full time - American Efficient (<a href=\"http://www.americanefficient.com\" rel=\"nofollow\">http://www.americanefficient.com</a>)<p>We're currently looking for both front-end and back-end engineers.  If you’re really smart, love to build stuff, and want to work on something that will, in a very real, non-cliche kind of way, make the world a better place, please contact alerner@americanefficient.com.<p>---------------<p><i>FRONT-END</i><p>We’re looking for someone who can become our resident master of HTML, CSS, and JavaScript; essentially you will lord over all things front-end.  The position itself is somewhat open-ended, in that we would love to shape the specific role to accommodate your strengths and interests, within reason.  Some of the kinds of things you'd work on include:<p><pre><code>   * work with the back-end engineering team to create scalable and responsive\n     products that entice end-users to make energy efficient purchases\n   * create beautiful, cutting edge UIs that deliver great user experience to both\n     consumer and enterprise users\n   * build out our UI framework\n   * help build a flexible A/B test framework\n   * be a HTML/CSS/JavaScript resource to our design and back-end engineering teams\n</code></pre>\n<i>Requirements:</i> really solid HTML/JavaScript/CSS, portfolio of sites you've created in the past, ability and interest in staying current with trends and technologies.\n <i>Nice-to-haves:</i> Design ability, PHP, experience with social application development (Facebook, Twitter, etc.)<p>---------------<p><i>BACK-END</i><p>As a back-end generalist, you will work all across our platform on a variety of interesting problems ranging from data mining and search relevance to scaling and architecture.  If you’re really smart, love to play around with the kinds of data retrieval/manipulation challenges that make mere mortals weep, love architecting clever solutions to all manners of design challenges, and would like to define your role based on your strengths in this arena, you are going to love this job.  Essentially, we’re still building out big pieces of our platform, and this could be an awesome opportunity to create something truly meaningful and interesting.  To give you an idea of the kinds of things we’re working on in this realm, take a look at the list below:<p><pre><code>   * out of many potential data sets, which should we display and what order\n     should we display them in?\n   * doing the above really, really fast\n   * architecting and scaling a reporting and analytics system to deliver fast\n     and reliable numbers to drive decisions both internally and for our partners\n   * developing heuristics to do fuzzy data matching between data sets with\n     different structures and formats\n   * feature design, including deciding the depth of customization and balancing\n     tradeoffs of complexity, responsiveness, flexibility in the future, and\n     administrative overhead\n   * database design, including schema, indexes, query optimization, partitioning,\n     and database abstraction\n   * building levels of caching to allow us to scale, including investigation of\n     different caching options and subsequent implementation of caching\n     technologies\n   * building platform infrastructure, which can include A/B testing, reporting,\n     APIs, etc\n</code></pre>\n<i>Requirements:</i> B.S, M.S., or Ph.D in Computer Science or equivalent, experience scaling systems, significant experience w/databases.\n<i>Nice-to-haves:</i> MySQL, PHP, mobile experience<p>---------------<p><i>COMPENSATION &#38; BENEFITS</i><p><pre><code>   * Salary commensurate with experience\n   * Meaningful equity stake in the company\n   * Benefits (medical, dental, vision)\n</code></pre>\n---------------<p><i>THE COMPANY</i><p>American Efficient is a well-funded startup in the clean energy sector.  We’re changing the way consumers and business owners make product choices for their homes and commercial properties - namely tipping decision makers to energy efficient choices through a platform approach.  We're working on hard problems related to big data, platform development, search, mobile, and more.<p>The team includes repeat Internet entrepreneurs who have had tremendous success (Reputation.com, Trialpay) and who hail from MIT, Stanford Engineering, the Stanford Graduate School of Business, Stanford Law, and Penn. Our advisors include a Nobel Prize-winning academic and the VP of Business Development of Groupon who was instrumental in growing that company from one city and ten employees to the group buying giant that it is today.<p>Our office is located in downtown San Mateo, CA, one block from Caltrain.  In the office, you will find, among other things, mandolin-playing interns and a very cute golden retriever puppy.","time":1320157112,"type":"comment"},{"by":"pitdesi","id":3181971,"kids":[3182180],"parent":3181796,"text":"FeeFighters<p>Rails Developers (Chicago or Remote) and a Marketing Intern (Chicago only)<p><a href=\"http://feefighters.com\" rel=\"nofollow\">http://feefighters.com</a><p>Looking for a Rails developer. We’re a startup working like mad to disrupt a multi-billion dollar financial industry and cut out tens of thousands of inefficient middle-men. Customers include Fog Creek/Stack Exchange, Photojojo, Weebly, Kickstarter, Make a Wish Foundation, tons of awesome startups, and even some public companies! And... we're just getting started.<p>We recently launched a new product called Samurai into public beta. (<a href=\"http://samurai.feefighters.com\" rel=\"nofollow\">http://samurai.feefighters.com</a>) It's an all-in-one all-in-one solution for taking payments online. It has come out of the gate swinging - there is a ton of pent-up demand to fix this industry and we're excited at how many people have been interested in our new product. We have a few more tricks up our sleeve and need developers to help build them out!<p>We have passionate users, awesome investors and partners, and products that our customers love. We pay ourselves decent salaries, are generous with equity and we enjoy a very fun and stimulating work environment. Much of the Samurai dev team was early on in another payments startup that grew to be a $2Billion company (including the CIO of that company). Here are bios of some folks that you'll be working with: <a href=\"https://samurai.feefighters.com/about\" rel=\"nofollow\">https://samurai.feefighters.com/about</a><p>We're still finishing up our job description - but here's a start. <a href=\"http://feefighters.com/jobs/rails-ninja-developer/\" rel=\"nofollow\">http://feefighters.com/jobs/rails-ninja-developer/</a>\nEmail josh at feefighters with your interest.<p>Also looking for a marketing intern to help us with social media and PR. Lots of fun stuff!\n<a href=\"http://feefighters.com/jobs/kickass-marketing-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-marketing-intern/</a>","time":1320155376,"type":"comment"},{"by":"mdelagra","dead":true,"id":3182463,"parent":3181796,"text":"Evanston, IL<p>Leapfrog Online is looking for a talented Chicago-area Python engineer to work in our Evanston office. Our Python engineers build and maintain high-traffic web sites using the Django web framework. We offer a great working atmosphere, a strong focus on work-life balance, and tremendous opportunities to learn new skills and technologies. We also have competitive salaries and benefits and close-knit teams who like what they do.<p>As we principally focus on the web, we look for real-world experience using Python application frameworks (such as Django) to build high-traffic web sites and applications. Experience with other languages is welcome. What are the extras we look for? Experience producing and consuming web services (SOAP, REST, XML-RPC); experience working with message-oriented systems (AMQP or other message, pub-sub and task queues such as Celery); deep knowledge of version control systems (especially Mercurial or Git); an interest in non-RDBMS data stores (CouchDB, MongoDB, Redis); knowing what it really means to develop RESTful applications; and, experience with functional and declarative programming models in addition to object-oriented development.<p>If you're a bright, self-motivated engineer who enjoys using open source software to solve interesting problems, you’re our kind of programmer, and we’d like to talk to you. You can apply on our site, where you'll also find full job descriptions and information about Leapfrog Online: <a href=\"http://www.leapfrogonline.com/who/careers/\" rel=\"nofollow\">http://www.leapfrogonline.com/who/careers/</a>","time":1320160968,"type":"comment"},{"dead":true,"deleted":true,"id":3183216,"parent":3181796,"time":1320169647,"type":"comment"},{"by":"symptic","dead":true,"id":3182405,"parent":3181796,"text":"Austin, TX - <a href=\"http://appsumo.com\" rel=\"nofollow\">http://appsumo.com</a><p>AppSumo provides daily deals for web geeks. We're growing and we need some more Sumos around the office who are into startups, having an immediate impact, and burritos. Looking for a range of awesome people:<p>From <a href=\"http://appsumo.com/hireme\" rel=\"nofollow\">http://appsumo.com/hireme</a><p>Python Developer - Build cool stuff (refer someone to this position and get 5 years of Chipotle!)<p>Question: Favorite program to write code in?<p>------<p>Biz-Dev Sumos (2 openings) - Work with awesome companies and people to promote their businesses.<p>Question: Favorite web app today?<p>------<p>Marketing Associate Sumo - Help tell the world about AppSumo.<p>Question: Favorite marketing blog or books?<p>------<p>Design Sumo - Help us look sexy with innovative creatives. See your designs put to the test immediately.<p>Question: What inspires your design?<p>------<p>If you want in, email hireme at appsumo dot com, including the job title in the subject line and your answer to the question.<p>PS: We're a bunch of goofballs who love what we do, so it just might help if you are too.","time":1320160317,"type":"comment"},{"by":"robbiem","dead":true,"id":3182998,"parent":3181796,"text":"New York, NY - Full Time - <a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a><p>Knewton is looking for software engineers and data scientists with superior problem solving and coding skills.<p>Knewton is poised to revolutionize the practice of education with the world’s most powerful adaptive learning engine. We recently raised the biggest VC round ever for an education company and have now partnered with Pearson to power most of the world's largest publisher's digital products.<p>Knewton was recognized as a Technology Pioneer for 2011 from the World Economic Forum in Davos and was voted one of the top 25 best places to work by Crain’s New York Business.<p>Go to our jobs page and say hi. <a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a>","time":1320167055,"type":"comment"},{"by":"Jd","dead":true,"id":3182534,"parent":3181796,"text":"London, Munich and Paris<p>Tquila.<p>We are probably the fastest growing Salesforce partner worldwide and leading in the development of social and mobile apps for the enterprise with extensive use of the Heroku platform.<p>We are looking for:<p>Hungry Devs<p>Badass BAs<p>a few more consultants<p>Depending on your skill set you would either work for our product division or primarily on customer projects -- we have a close relationship with Salesforce and are lining up phenomenal work with flagship customers. If you have any interest in this space you probably already know who we are. If you would like to get some experience with the future of social media as it transforms the enterprise, we are the best in the business<p>Experience in the following areas helpful: Ruby, Force.com, JAVA, Javascript/jQuery","time":1320161722,"type":"comment"},{"by":"burnto","dead":true,"id":3186605,"parent":3181796,"text":"San Francisco, CA<p>Wanted: talented engineering colleagues at card.io - <a href=\"https://www.card.io/\" rel=\"nofollow\">https://www.card.io/</a><p>We are a well-funded mobile payments start-up. We are building software to enable simple, low-friction transactions on mobile devices.<p>We offer interesting and challenging problems, real work/life balance, and generous compensation, benefits, and vacation.<p><a href=\"https://gist.github.com/821454/\" rel=\"nofollow\">https://gist.github.com/821454/</a>","time":1320241721,"type":"comment"},{"by":"jrnachtigal","dead":true,"id":3183187,"parent":3181796,"text":"Many companies are looking for Ruby devs in the Bay Area.<p>We've got an employer-developer speed dating event on November 9th at pariSoma that is free for developers: <a href=\"http://rubydevelopers.eventbrite.com/\" rel=\"nofollow\">http://rubydevelopers.eventbrite.com/</a><p>We're looking for experienced RoR devs.<p>Employers coming include: Square, Demandbase, Pago, Groupon, IndieGoGo, thredUP, Lookout, Tapjoy, and many more.<p>All these positions are SF and Silicon Valley based.","time":1320169354,"type":"comment"},{"by":"jaos","dead":true,"id":3184722,"parent":3181796,"text":"Pittsburgh, PA (intern, full-time,remote): Timesys<p>We are looking for embedded Linux kernel developers, build system gurus, gnu tool hackers, userspace application developers, and support engineers.<p>In office environment very fun, team oriented with kegerator, video game breakroom, and hilarious water cooler discussions.<p><a href=\"http://www.timesys.com/company/careers\" rel=\"nofollow\">http://www.timesys.com/company/careers</a><p>tell em jaos sent you","time":1320191883,"type":"comment"},{"by":"masto","dead":true,"id":3182326,"parent":3181796,"text":"New York City - Full Time - <a href=\"http://mediamath.com/\" rel=\"nofollow\">http://mediamath.com/</a><p>Looking for a Perl developer for a senior position on our platform API team.  It's a great opportunity and a great time to join our engineering team.  If you have the mad skills (that's what the kids say, right?), get in touch with me, cmasto at mediamath.com.  I won't waste your time.","time":1320159495,"type":"comment"},{"by":"nathanfp","dead":true,"id":3182729,"parent":3181796,"text":"Internships are one of the best ways to break into early stage companies.  I have organized a variety of technical internship positions being offered by leading startup and VC backed companies, as well as some interesting NFPs.   All of these positions are currently accepting applicants and available on InternMatch.  Let me know if you have any questions!<p>Early Stage Startups:<p>Tiny Review, Backend/iOS/Frontend dev- <a href=\"http://www.internmatch.com/internships/tiny-review/backendiosfrontend-dev-hacker?i=0&#38;s=0.19334552&#38;page=1\" rel=\"nofollow\">http://www.internmatch.com/internships/tiny-review/backendio...</a><p>Noodle Education, Data Analyst Intern- <a href=\"http://www.internmatch.com/internships/noodle-education/data-analyst-intern--2\" rel=\"nofollow\">http://www.internmatch.com/internships/noodle-education/data...</a><p>Rewardli, Software Engineering Intern- <a href=\"http://www.internmatch.com/internships/rewardli/software-engineering-intern--2\" rel=\"nofollow\">http://www.internmatch.com/internships/rewardli/software-eng...</a><p>Endorse, Software Engineering Intern- <a href=\"http://www.internmatch.com/internships/endorsecom/software-engineering-intern--2\" rel=\"nofollow\">http://www.internmatch.com/internships/endorsecom/software-e...</a><p>Growth Stage Companies:<p>Jive, Associate Software Engineer- <a href=\"http://www.internmatch.com/company/jive/entry-level-engineering-jobs/roles/associate-software-engineer\" rel=\"nofollow\">http://www.internmatch.com/company/jive/entry-level-engineer...</a><p>Yelp, Software Engineer Intern- <a href=\"http://www.internmatch.com/company/yelp/internships/roles/software-engineer-intern\" rel=\"nofollow\">http://www.internmatch.com/company/yelp/internships/roles/so...</a><p>Inkling, iOS Engineering Intern- <a href=\"http://www.internmatch.com/company/inkling/internships/roles/engineering-intern-ios\" rel=\"nofollow\">http://www.internmatch.com/company/inkling/internships/roles...</a><p>Twilio, Software Engineering Intern- <a href=\"http://www.internmatch.com/company/twilio/internships/roles/software-engineering-intern-with-twilio\" rel=\"nofollow\">http://www.internmatch.com/company/twilio/internships/roles/...</a><p>Sequoia Capital, Technical Intern Fellow- <a href=\"http://www.internmatch.com/company/sequoia-capital/internships/roles/technical-intern\" rel=\"nofollow\">http://www.internmatch.com/company/sequoia-capital/internshi...</a><p>Fortune 500:<p>NetApp, Software Engineering Intern- <a href=\"http://www.internmatch.com/company/netapp-inc/software-development/roles/software-engineering-intern\" rel=\"nofollow\">http://www.internmatch.com/company/netapp-inc/software-devel...</a><p>Non-Profit:<p>Kiva, IT, Dvelopment Intern- <a href=\"http://www.internmatch.com/company/kiva/internships/roles/itdeveloper-intern--2\" rel=\"nofollow\">http://www.internmatch.com/company/kiva/internships/roles/it...</a><p>Ashoka, Intern- <a href=\"http://www.internmatch.com/company/ashoka/internships/roles/intern-at-ashoka?i=0&#38;s=50.649593&#38;page=1\" rel=\"nofollow\">http://www.internmatch.com/company/ashoka/internships/roles/...</a>","time":1320163941,"type":"comment"},{"by":"leeny","dead":true,"id":3182116,"parent":3181796,"text":"vvsv","time":1320157113,"type":"comment"},{"by":"robinwarren","id":3181941,"parent":3181796,"text":"$$ hope no one has a problem with me mentioning my site<p>www.jobstractor.com<p>There's about 2000 jobs a week on there. I got an email today from soneone who has already found work through the site so it does work. It's still a work in progress, but improving all the time. Happy job hunting :)","time":1320155108,"type":"comment"}]]}