{"comments":[[{"by":"dmnd","id":3060865,"kids":[3065184,3061362],"parent":3060221,"text":"Mountain View - Khan Academy (full-timers and interns welcome year-round)<p>Our mission is to provide a world-class education to anyone, anywhere. We already have millions of students learning every month, and we're growing quickly.<p>Our students answer over 2 million math exercise problems per day, all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>, <a href=\"http://ejohn.org/blog/khan-exercise-rewrite/\" rel=\"nofollow\">http://ejohn.org/blog/khan-exercise-rewrite/</a>), and Sal's videos have been viewed over 78MM times.<p>Working for Khan Academy is one of the highest educational impact positions you can imagine.<p>We're hiring all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1317497068,"type":"comment"},{"by":"agotterer","id":3060275,"kids":[3060456],"parent":3060221,"text":"New York, NY<p>Lot18 is revolutionizing the way Americans buy wine. We provide a highly curated marketplace for wineries and epicurean product producers to sell direct to consumers.<p>We are hiring software engineers to join our small but growing 10 person dev team. You can apply by sending your resume and a link to your github profile to jobs@lot18.com.<p>Why you should work here:<p>- We work with a ton of awesome technologies (Python, PHP, Ruby, JavaScript, Tornado, Chef, git, Vagrant, MySQL, Linux (Ubuntu), Apache, nginx, HAProxy, Amazon Web Services, Varnish, memcached, Capistrano, RabbitMQ, jQuery and more)<p>- Well funded. We’ve raised $14.5M from tier one investors.<p>- People actually use our product. Over 500k users have joined since we launched in Nov 2010.<p>- It’s not social media. We have a real business model and do 7 figures a month in transactions.<p>- Benefits: Competitive salary, stock options, medical/dental paid in full, unlimited vacation, plenty of wine, lots of challenges and interesting business/tech problems to solve.","time":1317485533,"type":"comment"},{"by":"gcampbell","id":3060417,"kids":[3060767,3060992],"parent":3060221,"text":"San Francisco, CA (SOMA)<p>Twitter is hiring: <a href=\"https://twitter.com/jobs\" rel=\"nofollow\">https://twitter.com/jobs</a><p>Twitter (<a href=\"https://twitter.com\" rel=\"nofollow\">https://twitter.com</a>) is a real-time information network with the mission of connecting people everywhere to the latest information that is interesting and relevant to them. We're hiring across the organization, for a broad range of technical and non-technical positions. Come help us solve some hard problems!","time":1317488255,"type":"comment"},{"by":"tptacek","id":3060258,"kids":[3060484,3061053,3061272,3060299,3060284],"parent":3060221,"text":"I really wish we could figure out a way to stop posting these on Saturday, which guarantees the hiring thread won't be on the front page on a weekday.","time":1317485084,"type":"comment"},{"by":"veyron","id":3060461,"kids":[3060991],"parent":3060221,"text":"Rockefeller Center NYC, onsite: #1 looking for #2<p>Bootstrapped prop ultra low latency trading firm (as opposed to a firm which originally had investors and later kicked them out), and I'm willing to cut significant equity. see <a href=\"http://news.ycombinator.com/item?id=2835656\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2835656</a> for some discussion of what I do.<p>I'm not a traditional finance guy, and I'm definitely not looking for a banking drone. Most of those tasks are handled by cron anyway. Sanctity of weekends are preserved.<p>The ideal candidate: mastery, to the level of obsession, with C/Python/coreutils; insatiable curiosity; inquisitive to a fault; chutzpah to challenge every assumption and assertion; calm under pressure; and desire to be involved in every aspect of the business.<p>Windonauts need not apply (I currently use 2 27\" iMacs in the office)<p>Excited? intransigence123@gmail.com","time":1317488956,"type":"comment"},{"by":"dabent","id":3060852,"kids":[3062187,3061360],"parent":3060221,"text":"Santa Monica, CA (Los Angeles area) also possibly SF Bay area or other cities, but most jobs are in Santa Monica.<p>TRUECar - Put simply, TrueCar shows consumers how much people actually paid for a particular new car in their area, then guide them to dealers we've certified.  We bring transparency to auto pricing and so far we are getting a solid piece of a huge market.<p>We're looking for Python/Django developers, front end developers, Java and Ruby talent, Linux engineers, and an \"EDW SQL DB Developer,\" whatever that is.  There's a lot to do, so if you're a solid developer, there's a chance we have a spot for you.<p>I moved from Atlanta all the way out to Santa Monica after stopping by the TrueCar booth at PyCon 2011.  I started here a month ago and have absolutely loved it.  I'm working with a great team that knows how to develop software and for management who seems to \"get it\" with regards to software developers.<p>The Python team in an open workspace that has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>), and all the Santa Monica offices are blocks from the beach.  They have great benefits, including company equity, 100% paid family medical, dental, vision, and a healthy 401k.  They also offer gym membership reimbursement ($50 a month), 12 holidays, career training, 3 weeks PTO and have a kitchen stocked with fruit, snacks and such.  I've honestly never had a job this good.  We're also making money and recently got some really solid investment (<a href=\"http://techcrunch.com/2011/09/07/car-price-comparison-company-truecar-raises-200m-gears-up-for-ipo/\" rel=\"nofollow\">http://techcrunch.com/2011/09/07/car-price-comparison-compan...</a>).<p>If you're interested, send me your resume.  My email is in my profile.","time":1317496728,"type":"comment"},{"by":"NateLawson","id":3060397,"kids":[3060526],"parent":3060221,"text":"Oakland, CA - Root Labs<p>We are a fully-funded startup with a major paying customer, building a web-based service for analyzing and searching code. You will be in charge of building a large, distributed computing system for parsing and indexing code for our search engine. We've been creating the code analysis tools for existing customers, and we need you to build the automation framework to help us scale. We are building something really uncommon for a HN hiring thread, so contact me even if you're just curious!<p>We're solving problems that will have a major impact on the software industry. For example, one goal is that independent, open-source authors have a way to get paid for their work.<p>You'll team up with us to implement solutions to some challenging problems. (But don't worry, you don't already need to be an expert at all of these).<p><pre><code>    * Nearest-neighbor search in high dimension (or knowing how to\n      avoid this by projecting to a lower dimension)\n    * Classifying code by various metrics (structural flowgraph analysis,\n      symbol sequences and frequency, etc.)\n    * Map/reduce deconstruction of complex queries\n    * Distributed computing design, cluster management, software deployment,\n      load balancing \n</code></pre>\nBeing a good programmer is the most important part. We mostly work in Python and C/C++ although considering Scala or other options for some tasks. We use PostgreSQL, Redis, and Riak for a lot of the existing components.<p>You need to understand distributed computing, fault detection and error recovery, messaging, etc. An interest (but not expertise) in low-level details like compilers, operating systems, and reverse-engineering is a good plus.<p>We have much more details here:<p><a href=\"http://www.rootlabs.com/developer-job.html\" rel=\"nofollow\">http://www.rootlabs.com/developer-job.html</a><p>Ask any questions in the comments, or contact me directly at the address in my profile. Thanks!","time":1317487927,"type":"comment"},{"by":"jonbischke","id":3060260,"parent":3060221,"text":"San Francisco, CA (SF/Mission)<p>RG Labs is hiring: <a href=\"http://www.rglabsinc.com/#jobs\" rel=\"nofollow\">http://www.rglabsinc.com/#jobs</a><p>We operate under the premise that the most important decisions we make are decisions about people (e.g., who to start a company with, who to hire, who to date/marry...) We also feel like the Web is in its infancy in terms of helping us to make better decisions based on data and that this space will explode in coming years.<p>We're planning to help detonate that explosion. :)<p>We have a long backlog of customers waiting to use our product when it launches and a big market in front of us. We're building an engineering-centric organization and working out of a cool work/live space in the Mission. Our current stack includes Ruby, Rails, MySQL, Resque, and elasticsearch and we'll be diving in soon on Hadoop, graph databases/neo4j and a whole host of other fun stuff. We're also planning to contribute to open source as much as we can (e.g., <a href=\"https://github.com/rglabs/teleport\" rel=\"nofollow\">https://github.com/rglabs/teleport</a>).<p>We're funded but also really early so it's a unique opportunity to be a major contributor and help to set the tone for the future for our company.<p>To hear more drop me a line directly at jon@rglabsinc.com or contact via our website. We'd love to tell you more.","time":1317485114,"type":"comment"},{"by":"kemayo","id":3060406,"kids":[3061526,3060867,3062061],"parent":3060221,"text":"Really REMOTE. You don't even have to be in the USA.<p>deviantART (<a href=\"http://www.deviantart.com\" rel=\"nofollow\">http://www.deviantart.com</a>) wants developers. We're fully remote[1]; there's no central office with a devteam located there. We expect all hires to be comfortable working in PHP, JavaScript, CSS, and SQL; we like our developers to be able to hack on any part of the site, rather than being frontend/backend specialists.<p>One exception to all that: there's an Infrastructure Engineer position which is located in Vancouver. It's C++/Java focused, and involves developing backend services used by the rest of the site.<p>We post information about our development process here sometimes: <a href=\"http://dt.deviantart.com/blog/\" rel=\"nofollow\">http://dt.deviantart.com/blog/</a> Apply here: <a href=\"http://deviantart.theresumator.com/apply?source=hn\" rel=\"nofollow\">http://deviantart.theresumator.com/apply?source=hn</a><p>[1]: <a href=\"http://dt.deviantart.com/journal/We-re-all-remote-220038037\" rel=\"nofollow\">http://dt.deviantart.com/journal/We-re-all-remote-220038037</a>","time":1317488091,"type":"comment"},{"by":"mkeblx","id":3060387,"parent":3060221,"text":"Madison, WI - (REMOTE possible)<p>Circuit - <a href=\"http://circuitapp.co\" rel=\"nofollow\">http://circuitapp.co</a><p>Github for hardware. Circuit is a social webapp for designing and building electronic projects (circuit boards), aimed at the exploding Maker/hobbyist market. We're going to disrupt hardware with a tool that makes things 10x easier &#38; faster.\nProgrammer: We are looking for a passionate all-around programmer, experienced with creating advanced frontend interfaces as well as backend systems. Mainly would be doing a large amount of challenging HTML5, Javascript, and using PHP (Cake) &#38; MySQL on the backend. Big bonus points if you have a hardware background: microcontrollers, designing PCBs, tearing things apart, and familiarity with the Maker movement.<p>UI/UX Designer: You: experienced with the design of web applications with a strong emphasis on the UX to make a simple and clean interface. Also wireframe concepts, diagram workflows and create various assets needed for the application.<p>Interested, questions? jobs@circuitapp.co","time":1317487717,"type":"comment"},{"by":"dshankar","id":3060784,"parent":3060221,"text":"Berkeley, CA or San Francisco Bay Area<p>Flotype (creators of popular open source projects like NowJS) is hiring engineers. <a href=\"http://flotype.com\" rel=\"nofollow\">http://flotype.com</a> and <a href=\"http://nowjs.com\" rel=\"nofollow\">http://nowjs.com</a><p>-(very) well-funded company tackling huge technical problems (A16Z, YC etc.)<p>- we build enterprise-grade web infrastructure and sell to startups, corporations and enterprises<p>- we use cutting edge technology and love Node.js<p>- you would be a very early employee that gets a \"whatever you want\" benefits package.<p>The best benefit is honestly working on new technology problems. You get to build massively scalable software, solve highly technical problems, with the awesome startup lifestyle. And you get to test on several 800-core clusters.<p>Open to remote intern h1b fulltime parttime etc.\nEmail us at jobs@flotype.com","time":1317495178,"type":"comment"},{"by":"calbear81","id":3060405,"parent":3060221,"text":"Mountain View, CA<p>Room 77 (room77.com) - REMOTE / H1B Welcome<p>We're building the next generation of hotel search and we're looking for a few good engineers.  We're attacking a $50B online industry that hasn't seen a lot of innovation in the last several years.  We're funded and backed by travel rockstars including the founder of Expedia.<p>Software Engineer - 5 Positions Open - <a href=\"http://www.room77.com/jobs/software_engineer.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/software_engineer.html?s=HackerNe...</a><p>We're looking for software engineers who are smart and can roll up their sleeves to get things done. We don't care what programming language you've used before or what operating system you're familiar with, but we need people with demonstrated passion for programming and problem solving, as well as a hands-on attitude and hacker mentality. Our technology stack is primarily C++ / Javascript / Python / PHP / MySQL, on top of Ubuntu Linux and AWS.<p>iOS/Android Mobile Developer - 2 Positions Open - <a href=\"http://www.room77.com/jobs/mobile.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/mobile.html?s=HackerNews</a><p>UI/UX Designer - 1 Position Open - Help lead the design of a next gen travel search product - \n<a href=\"http://www.room77.com/jobs/ui_ux_designer.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/ui_ux_designer.html?s=HackerNews</a><p>Hacker in Residence - 3 Spots Available - This is an exciting new program to get FREE office space, FREE food, and FREE mentoring from our team of advisors/investors and engineers.  We've got some free space in the new office so we want to bring in some folks who are interested in working on their own projects while spending a few hours a week working on open source projects we are sponsoring.  Our engineering team is happy to help flesh out your project as well and you can always talk to the rest of the team, all of which have built, run, and sold startups. - <a href=\"http://www.room77.com/jobs/hacker.html?s=HackerNews\" rel=\"nofollow\">http://www.room77.com/jobs/hacker.html?s=HackerNews</a>","time":1317488081,"type":"comment"},{"by":"lacker","id":3060853,"parent":3060221,"text":"San Francisco - Parse (<a href=\"http://parse.com\" rel=\"nofollow\">http://parse.com</a>)<p>Parse provides cloud services for mobile developers. Some have called us \"Heroku for Mobile.\" We believe mobile developers shouldn't be writing server code or worrying about servers at all.<p>About Parse:<p>- We move fast. We launched our private beta a little over two months after starting the company. Since then we've signed up over 3000 developers and have dozens of production apps in the store.<p>- We have difficult and interesting engineering problems.<p>- We build products for other developers. You'll be your own customer.<p>- We are four very technical cofounders who have been early employees or founders at successful startups.<p>About you:<p>- You'll be employee #1.<p>- You'll be responsible for architecting and implementing features in their entirety.<p>- You'll write code in Ruby, Objective-C, and Java (so far). You don't need to know these coming in -- we like generalists who can pick up anything.<p>- You'll have the opportunity to grow into a large leadership role.<p>We offer significant equity, market salary, fully covered health insurance, your choice of equipment, etc. We're based in San Francisco and are looking for people that can hack in the office with us.<p>Please get in touch -- email Tikhon at tikhon@parse.com","time":1317496750,"type":"comment"},{"by":"exogen","id":3060448,"parent":3060221,"text":"Seattle, WA<p>BigDoor: <a href=\"http://www.bigdoor.com/\" rel=\"nofollow\">http://www.bigdoor.com/</a><p>We're a gamification platform – we make it easy for anyone to add fun, relevant loyalty programs to their site or app. Lots of people are focused on badges and leaderboards – and we do that – but we consider that the simple, boring stuff. We're way ahead of that. We're also working with some major brands.<p>Positions:<p>2 x developer: Python, Django, JavaScript.<p>1 x sysadmin: Linux, Apache, MySQL.<p>1 x DBA: MySQL.<p>2 x tester: Python a big plus.<p>1 x content manager: Help our partners create and maintain their virtual economies.<p><a href=\"http://www.bigdoor.com/about-us/careers/\" rel=\"nofollow\">http://www.bigdoor.com/about-us/careers/</a>","time":1317488777,"type":"comment"},{"by":"jedberg","id":3061799,"parent":3060221,"text":"Los Gatos, CA\nNetflix<p>Looking for Senior SREs.<p>Basically, we're starting a new company to take streaming global and make it so convient that it is better than the free options.<p>I'm looking for people to help make sure that any time someone wants to find and play a movie, they can.<p>You can get more info here: <a href=\"http://jobs.usethesource.com/item?id=166\" rel=\"nofollow\">http://jobs.usethesource.com/item?id=166</a><p>Or here: <a href=\"http://www.reddit.com/comments/jyaqd/\" rel=\"nofollow\">http://www.reddit.com/comments/jyaqd/</a><p>Or here: <a href=\"http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr\" rel=\"nofollow\">http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr</a>","time":1317521378,"type":"comment"},{"by":"andrewljohnson","id":3060679,"kids":[3061947],"parent":3060221,"text":"Freelance to hire, iOS and Android development, with a focus on mapping apps. All brilliant engineers considered, regardless of skillset.<p>We raised $45K from angels and won a $25K fbFund grant early on (2008), and we're now profitable from sales of apps and royalties from software licensing. We had a killer summer, which is the season for our apps, and we were featured in a slew of press: <a href=\"http://www.gaiagps.com/press\" rel=\"nofollow\">http://www.gaiagps.com/press</a><p>Apply to jobs@gaiagps.com or <a href=\"http://www.gaiagps.com/jobs\" rel=\"nofollow\">http://www.gaiagps.com/jobs</a>","time":1317493286,"type":"comment"},{"by":"ericedge","id":3060395,"parent":3060221,"text":"San Francisco, CA; New York City, NY<p>Flurry needs engineers to help build our burgeoning mobile analytics platform--hiring for server-side software engineers, mobile client programming, operations engineers, a data scientist and more.  Also looking for some non-engineering roles if that's your specialty.<p>More at <a href=\"http://www.flurry.com/jobs\" rel=\"nofollow\">http://www.flurry.com/jobs</a> -- if you think Flurry is perfect for you but don't see an exact fit in any of the roles, don't hesitate to let us know how you could help us grow!<p>Tell 'em Eric sent ya.","time":1317487879,"type":"comment"},{"by":"harper","id":3061231,"parent":3060221,"text":"Chicago, IL - Obama for America (<a href=\"http://barackobama.com\" rel=\"nofollow\">http://barackobama.com</a>)<p>We are looking for QA, iOS, DBA, and DevOps engineers to join our department through November 2012 at our Chicago headquarters.<p>The Obama for America Technology department builds and maintains the software that powers the campaign’s websites and interactive online presence. Our team’s products support the campaign’s efforts to inform voters, organize supporters and raise money.<p>Email us at techjobs@barackobama.com for more info.","time":1317506107,"type":"comment"},{"by":"ropiku","id":3060330,"kids":[3065898],"parent":3060221,"text":"FreeAgent (Edinburgh, UK), a startup making accounting easy and fun. We've just moved to a new office in central Edinburgh.<p>We're looking for developers to join a team of smart, friendly people who value the work/life balance.<p>Ruby/Rails Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/rubyrails-engineer-product\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/rubyrails-engin...</a><p>Senior Platform Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/senior-platform-engineer\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/senior-platform...</a><p>Ruby/Rails Support Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/rubyrails-engineer-support\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/rubyrails-engin...</a><p>Email us at jobs@freeagentcentral.com. We're also open to remote working for exceptional candidates (there's a couple of us who are spread throughout the UK).","time":1317486659,"type":"comment"},{"by":"arfrank","id":3060963,"parent":3060221,"text":"Boulder, CO<p>Simple Energy - TechStars company<p><a href=\"http://www.simpleenergy.com\" rel=\"nofollow\">http://www.simpleenergy.com</a><p>4 Positions: <a href=\"http://www.simpleenergy.com/jobs\" rel=\"nofollow\">http://www.simpleenergy.com/jobs</a><p>* Product Manager (gaming experience pref'd)<p>* Front-End Engineer<p>* Back-End Engineer<p>* SysAdmin/DevOps<p>Simple Energy is making saving energy social, fun, and simple. We change how millions of people save energy by changing how utilities engage their customers. We take real energy data and create social games and contests that drive people to save energy. You could be the fifth member of a funded startup that Mashable recently named one of \"8 Startups that are Changing the World.\" \n<a href=\"http://mashable.com/2011/08/19/startups-for-good/\" rel=\"nofollow\">http://mashable.com/2011/08/19/startups-for-good/</a><p>* Generous moving benefits to beautiful Boulder, CO<p>* Awesome Mac setup<p>* Sweet office w/ standup desks overlooking a creek<p>* Every new employee saves enough energy to power 1,000 homes","time":1317499514,"type":"comment"},{"by":"Littleme","id":3060374,"parent":3060221,"text":"Anywhere in the USA<p>Cloudera - <a href=\"http://www.cloudera.com\" rel=\"nofollow\">http://www.cloudera.com</a><p>We're the leader in Apache Hadoop-based software and services. We're hiring in a ton of positions - check our careers page for details.<p>In particular, I'm looking to grow our certification program and curriculum development department. You'd primarily be working on helping to develop and expand our certification program - we've huge plans for the next year, and we need more staff to make it all happen. If you're smart, technical, able to learn new stuff quickly, a good writer, and able to work on your own initiative, you might be the person I need. Bonus points for having experience of professional certification programs, curriculum development, Hadoop. E-mail me directly: e-mail address is in my profile.","time":1317487514,"type":"comment"},{"by":"claytonm","id":3060555,"parent":3060221,"text":"Seattle, WA - Software Development Engineer<p>AWS ElastiCache <a href=\"http://aws.amazon.com/elasticache/\" rel=\"nofollow\">http://aws.amazon.com/elasticache/</a> - My team is looking for software engineers who are passionate about enabling high performance applications in the AWS cloud.  If you’re interested in building high performance distributed systems and having your work used by thousands of other developers, come join the ElastiCache team and influence the direction of the leading cloud provider.  If you love the service memcached provides and have ideas on how to make it more scalable, available, and performant, ElastiCache is the place to be.  We have several positions for a range of experience levels. If you’re not in Seattle but are up for a change of scenery, Amazon has a great relocation program that makes it extremely easy to join AWS.<p>To apply, send your resume to aws-jobs-elasticache-yc@amazon.com.<p>I’m a founding member of the ElastiCache team and I’ve learned an amazing amount taking an AWS service from concept to launch.  It’s a uniquely exhilarating experience to launch a new AWS service - seeing the system that you’ve worked on for so long available to everyone, watching it grow each day, and learning from your customers.  Knowing that other people’s websites, workflows, systems and components rely on your service working properly pushes you to do the best work you can.  I’m proud of the work we’ve done and I’m very excited about the innovation still ahead of us.<p>Detailed job descriptions :<p><a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137677&#38;category=*&#38;location=*&#38;x=44&#38;y=9\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137677&#...</a><p><a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137679&#38;category=*&#38;location=*&#38;x=44&#38;y=9\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=137679&#...</a><p><a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=133388&#38;category=*&#38;location=*&#38;x=44&#38;y=9\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=133388&#...</a>","time":1317490688,"type":"comment"},{"by":"isb","id":3060740,"parent":3060221,"text":"Seattle, WA - H1Bs welcome<p>Amazon Route 53 - <a href=\"http://aws.amazon.com/route53-jobs/\" rel=\"nofollow\">http://aws.amazon.com/route53-jobs/</a><p>We are building and operating a highly available and scalable Domain Name System (DNS) web service. We are looking for great engineers to join our team. Please email your resume to route53-jobs@amazon.com or apply online at the link above.","time":1317494378,"type":"comment"},{"by":"revertts","id":3060766,"parent":3060221,"text":"Seattle, WA - <a href=\"http://wap-jobs.amazon.com/jobs.html\" rel=\"nofollow\">http://wap-jobs.amazon.com/jobs.html</a> (email is on the page linked)<p>Nearly every team in the Website Application Platform org is currently hiring.  We build the backend components that power amazon.com and many of the subsidiaries/affiliates. \nWe solve difficult problems involving scalable, performant distributed systems  and have a direct effect on customer experience.  If that sounds like you're cup of tea, it might be worth checking out!<p>Also, arcade cabinets, nerf gun fights, and free cereal.  It's a good place to be. :)","time":1317494836,"type":"comment"},{"by":"tialys","id":3060426,"parent":3060221,"text":"Jacksonville, FL<p>Hashrocket is hiring a front end web developer.  Familiarity with Rails is preferred. Really excellent benefits, and really awesome people to work with.<p><a href=\"http://hashrocket.com/people/work-at-hashrocket/front-end-developer\" rel=\"nofollow\">http://hashrocket.com/people/work-at-hashrocket/front-end-de...</a>","time":1317488431,"type":"comment"},{"by":"nosequel","id":3060584,"kids":[3063461],"parent":3060221,"text":"Anywhere:<p>Basho (makers of Riak) are hiring all sorts of people.   See the postings here: <a href=\"http://www.basho.com/company_careers.php\" rel=\"nofollow\">http://www.basho.com/company_careers.php</a><p>Also not listed is the need for an ops/tools type person who can wear many hats.  If you like the term DevOps, consider it a devops position, if not, call it what you wish!<p>If you need to be in an office, we have offices in Cambridge, Ma and SF, otherwise you work where you want to work.","time":1317491356,"type":"comment"},{"by":"barunio","id":3068638,"parent":3060221,"text":"Boston, MA - WegoWise.com<p>WegoWise is an energy analytics company with funding, an enthusiastic and growing user base, an environmentally-conscious mission, a solid business plan, and a motivated team. We're looking for a Ruby on Rails developer to join our team. The work environment is fun and flexible, and the product provides ample opportunities to tackle technical challenges, work with the latest and greatest technologies, and stay at the top of your game.<p><a href=\"http://wegowise.com/careers/developer\" rel=\"nofollow\">http://wegowise.com/careers/developer</a><p>Contact: devjobs@wegowise.com<p>++++++++++++++++++++++++++++++++++++<p>We are looking for mid-level and senior-level developers with web development experience (ideally 1+ years with Ruby). You should be comfortable working with HTML, CSS, and Javascript. Understanding UI concepts is helpful as well.<p>We treat coding as an art, take pride in our work, and think good code should be both functional and elegant. We are Agile, and follow TDD and BDD practices.<p>We listen to our developers, respect them, and give them room to get things done. The work schedule is flexible, and features are thoughtfully planned so we don't rush things out the door.<p>Location is excellent (downtown Boston, near all public transport) and you get 10% open source time.<p>Competitive salaries, health and dental, training and professional development, 401k, etc.<p>If this sounds like a place you'd like to work, get in touch!<p><a href=\"http://wegowise.com/careers/developer\" rel=\"nofollow\">http://wegowise.com/careers/developer</a>\ndevjobs@wegowise.com","time":1317684112,"type":"comment"},{"by":"simulate","id":3060297,"parent":3060221,"text":"Forio Online Simulations (San Francisco, South Beach area)\n<a href=\"http://forio.com/about-forio/careers-at-forio/\" rel=\"nofollow\">http://forio.com/about-forio/careers-at-forio/</a><p>If you're interested in developing rich internet applications and data visualizations around simulations and games for us in San Francisco, I would love to hear from you. We are hiring across the entire stack and looking for client-side and server-side developers.<p>Some of our current projects:<p>- a venture-back tech game/sim for MIT<p>- simulating game-theory style price moves between two competitors for a beverage company in North America<p>- national health simulations with the CDC<p>- several business simulations and games for Harvard Business School Publishing<p>- on-going data visualization, ui and compiler work for our core platform, Forio Simulate <a href=\"http://forio.com/simulate\" rel=\"nofollow\">http://forio.com/simulate</a><p>Benefits:<p>- job security, market salaries - we've been cash flow positive for years<p>- collaborate, share, and learn from other talented developers in a pleasant work place<p>- reasonable work hours - working late nights and weekends is unusual<p>- good software development practices - QA, unit testing, usability testing, git, bug tracking, etc.<p>If you're interested or have questions, email mbean@forio.com and I can direct you to the right people.","time":1317486007,"type":"comment"},{"by":"joshyeager","id":3060727,"parent":3060221,"text":"Frederick, MD\nSwift Software is seeking a talented frontend developer to join the team creating JobTraQ, our flagship product. You’ll work with the rest of the team to create new features and refine our existing user interfaces, to help make our software even more intuitive and exciting for our users. You’ll be working on our main web application as well as our HTML5 mobile interface.<p>To qualify for this position, you must have at least two years of experience as a software developer working on complex web applications that targeted all major web browsers. You do not need a lot of experience as a user interface designer, but you should be excited about developing your talents for usability and user interface design. You should have strong skills in HTML, CSS, and AJAX. Finally, you must be committed to high quality in both your code and the final product.<p>Because this job requires close communication with the rest of our team, you must be able to work in our office in Frederick, MD.<p>If you want to work with a rising team of talented and friendly people who are building a solid and high-quality product, email your resume to resumes@swiftsoftware.com.","time":1317494143,"type":"comment"},{"by":"cristinacordova","id":3061067,"parent":3060221,"text":"Palo Alto, CA - Pulse - <a href=\"http://pulse.me\" rel=\"nofollow\">http://pulse.me</a><p>We're hiring iOS and Web Developers to join our 15-person team. Pulse is an award-winning application that makes it easy to consume news on mobile phones and tablets. Pulse has been named to the Apple’s App Store Hall of Fame, chosen as an Android Editor’s Choice app, selected as one of TIME’s top 50 iPhone apps of 2011, and honored with the Apple Design Award.<p>We're looking for iOS developers to build out the Pulse iPhone and iPad applications, which support millions of users. Each of us is part engineer, hacker and product designer. This role requires existing experience with CocoaTouch and iOS programming. Specifically, we would love to hear about iOS applications you have worked on either professionally or in your free time.<p>We're looking for web developers with expertise in HTML/CSS/Javascript/JSON, extensive knowledge of server-side technologies such as Rails/Python/Django, experience developing web applications following W3C standards and taking into account cross-browser compatibility.<p>Send me an email so we can learn more about you at cristina[at]pulse[dot]me","time":1317502068,"type":"comment"},{"by":"dan_manges","id":3060775,"parent":3060221,"text":"Chicago, IL - Braintree (<a href=\"http://www.braintreepayments.com\" rel=\"nofollow\">http://www.braintreepayments.com</a>)<p>We mostly work with Ruby/Rails. Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node, Java, .NET, PHP, and Perl. Braintree is profitable, you'll have standard benefits (health/dental/vision), 401k match, ample vacation, and an above market salary.<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/inside-braintree/how-we-built-the-software-that-processes-billions-in-payments\" rel=\"nofollow\">http://www.braintreepayments.com/inside-braintree/how-we-bui...</a><p>Apply at <a href=\"http://joinbraintree.com\" rel=\"nofollow\">http://joinbraintree.com</a> or email me if you have any questions (address in profile).","time":1317495019,"type":"comment"},{"by":"physcab","id":3060877,"parent":3060221,"text":"San Francisco, CA -  Kontagent<p>Software Engineer, Data Scientist, Account Manager, Sales, Full-time, Part-time, Intern, Contract<p>Let's face it, as an engineer you can work ANYWHERE.  You are in demand and if you're good you know it.  You don't want to take the time to interview unless you know a company will be good for you.<p>At Kontagent, we believe that culture is everything.  We have a strong community here and people are excited to come into the office.  We're tackling big problems, but more importantly we're having uuuuubber amounts of fun doing it.  Honestly, its a blast.  Your co-workers will be some of the smartest people you know, but also some of the nicest.<p>We have:<p>- A game room for the Rockband literate<p>- A kitchen stocked with delicious food and drinks<p>- Nerf guns<p>- Wine and Cheese Thursdays<p>- Clients that can't run their businesses without us<p>- A new office with incredible views<p>- Catered lunch daily and team lunch Fridays<p>- Beer<p>- An ACTUAL work-life balance<p>Read this for more information:\n<a href=\"http://www.thedatascientist.com/2011/09/21/curiosity-or-why-im-joining-kontagent/\" rel=\"nofollow\">http://www.thedatascientist.com/2011/09/21/curiosity-or-why-...</a><p>If interested, contact me at the e-mail listed in my profile.","time":1317497278,"type":"comment"},{"by":"nosh","id":3060695,"parent":3060221,"text":"New York, San Francisco and London<p>10gen develops and supports MongoDB - and we are looking for good people to help grow product, sales, maketing, support etc. We are hiring for a lot of positions!\nWe're looking to hiring \n- Solution architects\n- Evangelists for Java, Node.js, Ruby, Python.\n- Database engineers\n- Web/Graphic designers\n- Product Marketing \n- Sales &#38; sales engineers\n(and a whole lot more).<p>You can check out our list of open positions here \n<a href=\"http://hire.jobvite.com/Jobvite/Jobs.aspx?b=nq4bNgwd\" rel=\"nofollow\">http://hire.jobvite.com/Jobvite/Jobs.aspx?b=nq4bNgwd</a><p>and please do drop me a line if you are interested - nosh@10gen.com<p>I've been with the company for almost two years now, and have learnt tremendous amounts while having great fun along the way. Here is a post I wrote a couple of months ago about why I work at 10gen:\n<a href=\"http://noshpetigara.com/post/7091732384/why-i-work-at-10gen-on-mongodb-and-why-you-probably\" rel=\"nofollow\">http://noshpetigara.com/post/7091732384/why-i-work-at-10gen-...</a><p>Hope to hear from you!","time":1317493599,"type":"comment"},{"by":"ericboggs","id":3060384,"parent":3060221,"text":"Senior Developer - Argyle Social - Durham, NC, USA<p><a href=\"http://argylesocial.com/careers/durham-nc-software-engineering-job\" rel=\"nofollow\">http://argylesocial.com/careers/durham-nc-software-engineeri...</a><p>Solving complex data problems for online marketers. Closed a $1.2M Series A in Sept. 20%+ month-over-month MRR growth for the past 6 months. Talented, ambitious, experienced team.<p>:)","time":1317487687,"type":"comment"},{"by":"mitchell","id":3061030,"parent":3060221,"text":"Atlanta, GA - Vitrue (<a href=\"http://vitrue.com\" rel=\"nofollow\">http://vitrue.com</a>)<p>We're looking for solid developers, and we have a ton of openings.<p>We're a social media marketing company building a platform for corporate clients to manage their presences on Facebook/Twitter and the like. We're primarily a Rails shop. Having said that, we do have projects in other languages, and we frequently hire people with no Rails experience and bring them up to speed on the job.<p>Stuff we use: Ruby, Rails, PostgreSQL, MongoDB, Node.js, jQuery, Backbone.js, AWS/Scalr/Engine Yard, and plenty more.<p>For open positions and a better idea of what we do, take a look at our job page: <a href=\"http://vitrue.com/jobs\" rel=\"nofollow\">http://vitrue.com/jobs</a> . Not every open position is posted, though, so even if you're not a fan of building customer-facing apps, we might have a place for you.<p>Feel free to either drop me a line or apply direct via the jobs page.","time":1317501099,"type":"comment"},{"by":"jpeyer","id":3061191,"parent":3060221,"text":"Minneapolis, MN / Chicago, IL - The Nerdery (<a href=\"http://www.nerdery.com/workwithme/Py\" rel=\"nofollow\">http://www.nerdery.com/workwithme/Py</a>)<p>Founded by three programming pioneers in 2003, The Nerdery has over 200 interactive pros who’ve collectively made The Nerdery #1 on Biz Journal’s Best Places to Work list. The Nerdery partners with ad agencies, marketers and others with big ideas to imagine and execute web, mobile and social media projects. Through The Nerdery Overnight Website Challenge, volunteers have donated $1.5 million dollars worth of web development services to 57 nonprofits. We've made Inc. Magazine's lists of fast-growing privately owned companies the past three years, so we’re always seeking people (nerds) who crave the kind of workplace culture we’ve created at our Minneapolis and Chicago offices.<p>We're hiring as fast as possible to keep up with Nerd demand, in many different areas  -- iOS &#38; Android, C# ASP.NET, Drupal, ExpressionEngine, Front End, Java, PHP, Python/Django, IA/UX, Interface Designer, QA, sales, and project managers!<p>What are the Perks of working at The Nerdery?<p>+ Developer-oriented workplace<p>+ 85% of staff has development background including senior management<p>+ Casual dress<p>+ FREE breakfast, soda (&#38; juice, tea, coffee, red bull...), beer &#38; snacks!<p>+ Team environment<p>+ Flexible 40 hour work week<p>+ Performance-based bonuses<p>+ Benefits package including a 401k<p>+ Onsite Yoga classes<p>+ Massage service<p>+ Dogs!<p>+ Convenient lunch ordering and delivery - daily<p>+ Arcade games, Chess, Anime, and daily Hacky Sack<p>+ 101 more reasons here: <a href=\"http://blog.nerdery.com/2011/06/101-reasons-i-love-my-job-the-nerdery/\" rel=\"nofollow\">http://blog.nerdery.com/2011/06/101-reasons-i-love-my-job-th...</a>","time":1317505249,"type":"comment"},{"by":"philfreo","id":3060371,"parent":3060221,"text":"San Francisco, CA (SOMA) - FULL-TIME + INTERNS<p>Quizlet.com is redefining how students study from middle school social studies to university-level Arabic to GRE prep. We deploy new stuff daily to our user base of 6 million students and teachers per month. We're a small, scrappy team in San Francisco, working hard to transform how people learn using technology (read our 17,000+ testimonials: <a href=\"http://quizlet.com/testimonials/\" rel=\"nofollow\">http://quizlet.com/testimonials/</a>).<p>We're looking for entrepreneurial engineers who can do it all: cook up great ideas, design, and implement new features, build for huge scale, get deep in the heads of users and create clean user experiences. Do whatever it takes to make a huge impact!<p>You should love coding (we're not religious about specific technologies, but we use PHP, MySQL, Javascript, HTML5, Node.js, Puppet, Git, and Sphinx, among others)","time":1317487371,"type":"comment"},{"by":"mavelikara","id":3060907,"parent":3060221,"text":"San Francisco, CA - AppDynamics (<a href=\"http://appdynamics.com\" rel=\"nofollow\">http://appdynamics.com</a>)<p>AppDynamics is a successful, well-funded startup in Application Performance Management space.  Our product and business model are proving to be quite disruptive in a very large market. Companies like Netflix, Priceline.com, Deutsche Bank, Williams Sonoma, Betfair and Nationwide Insurance are using AppDynamics to ensure the performance and availability of their revenue-critical applications.<p>We are:<p>- Hiring software engineers at all levels<p>- Primarily looking for engineers with experience in Java, C#, C++ or C languages<p>- Prior experience building infrastructure products and frameworks like application servers, message bus, performance management tools etc welcome<p>- Willing to sponsor H1B for the right candidate<p>If you are interested, please email me at bthomas@appdynamics.com.","time":1317498103,"type":"comment"},{"by":"cperciva","id":3060286,"parent":3060221,"text":"<p><pre><code>    Please also see... http://news.ycombinator.com/edit?id=3060222\n</code></pre>\nThat should be s/edit/item/.","time":1317485894,"type":"comment"},{"by":"yawniek","id":3060564,"parent":3060221,"text":"ZURICH, SWITZERLAND, senior rails dev and junior or senior java dev<p>You are a Rails developer and want to work in Switzerland?<p>Work at local.ch, Switzerland's second biggest Website, as a Ruby On Rails software engineer. We search a passionate and experienced frontend developer who complements our great team. Enjoy the possibilities to contribute your ideas and the benefits of living in Switzerland, one of the countries with the highest standard of living.<p>Get more information from our job posting <a href=\"http://local-ch.github.com/rails-engineer.html\" rel=\"nofollow\">http://local-ch.github.com/rails-engineer.html</a>. Just fork it and send a pull request to apply ;-) Or contact Georg Kunz at georg at local.ch<p>more jobs:\n<a href=\"http://local-ch.github.com/\" rel=\"nofollow\">http://local-ch.github.com/</a>","time":1317490895,"type":"comment"},{"by":"Aloisius","id":3060898,"parent":3060221,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 12 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Senior Objective-C engineers for iPad/iOS development\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees. H1B ok.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a><p>Questions - jobs@seatme.com","time":1317497723,"type":"comment"},{"by":"RichardPrice","id":3067633,"parent":3060221,"text":"San Francisco, CA<p>Academia.edu is a platform for sharing research. Fundamentally we are trying to massively speed up the rate at which research whizzes around the world. For people who have just published a paper, we want that paper instantly to get into the hands of people who are interested in it. It often takes 12-24 months for a paper to get through the journal publication cycle, and to get distributed to the relevant research community. We believe that this is a large inefficiency in the research process, and we believe that there is an opportunity to make a huge impact here. We want to bring the time it takes for a paper to be distributed around a given research community down from 12-24 months down to a matter of hours.<p>Right now we have over 600,000 academics signed up, with about 2,000 joining each day. Our monthly uniques are over 2 million. We have about 700,000 papers, with about 80,000 new papers being added per month.<p>Amongst other technologies, we work with Rails, Redis, MongoDB, Beanstalkd, Varnish, Solr, PostgreSQL, Node.js and Memcached.<p>We're a small team of 7 people in San Francisco, backed by venture capital (Spark Ventures) and angel investors (Mark Shuttleworth, founder of Ubuntu, and Rupert Pennant-Rea, Chairman of the Economist, amongst others). We have a very engineering-focused culture. You can read more about our culture here <a href=\"http://academia.edu/hiring/culture\" rel=\"nofollow\">http://academia.edu/hiring/culture</a> and here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>We have a very collaborative culture, where everyone discusses everything going on with the company: engineering, product, revenue, user growth, recruiting. We think that building a successful startup is hard enough that we need to leverage everyone's brain power.<p>We're very happy to handle the H1B application process for foreign applicants. Interns are also welcome to apply; we have an intern program detailed at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. For anyone interested to learn more, feel free to email me directly at richard [at] academia.edu","time":1317670224,"type":"comment"},{"by":"jerryr","id":3060375,"parent":3060221,"text":"San Francisco, CA (25 Kearny St) - MindTribe Product Engineering, Inc.<p>Hi, I’m MindTribe’s director of Software Engineering. I’m searching for people who enjoy learning and making. We’re a small company, and I’m looking for people with whom I would personally like to work and who want to work with me. We're moving from Palo Alto to SF on Nov 1st. And now, besides experienced SENIOR embedded programmers, I am looking for INTERNs and JUNIOR engineers as well. If you enjoyed your microcontroller classes in school, come join us in SF for continuing education.<p>Here are the tools I use regularly: The C programming language (specifically ISO/IEC 9899:1990); Eclipse, Make, Subversion, Git, Python; Linux, Embedded Linux, Android, iOS; ARM processors (TI OMAP, TI Stellaris, NXP LPC); Atmel AVR/AVR32, Microchip PIC, TI MSP430, Cypress PSoC<p>Here is what I enjoy doing at work: Writing embedded software that runs on cool hardware; Figuring out how to apply agile techniques such as test-driven development to embedded product development; Reducing regressions and supporting customer development with agile techniques; Developing embedded libraries for things like USB, TCP/IP, graphics displays, sprites, fonts, encryption, etc.; Having long, dorky conversations with coworkers about programming languages, physics, estimating Facebook’s relative revenue distribution between advertising and games, etc.<p>Here is what I enjoy doing outside of work: Hiking, walking around San Francisco; Pseudonymous humor blogging; Cooking and baking; Photography; Reading. Recently: \"Test Driven Development for Embedded C\", \"The Clean Coder\", \"The Four Steps to the Epiphany\", \"The Art of Racing in the Rain\", \"Norwegian Wood\", \"The Mind's Eye\", and \"Cutting for Stone\".<p>You can see examples of how I’ve applied my tools and passion here: <a href=\"http://mindtribe.com/portfolio/\" rel=\"nofollow\">http://mindtribe.com/portfolio/</a><p>You don’t have to use the same tools and you don’t have to enjoy the same things. But if you’re excited about similar stuff, drop me a line at hn@mindtribe.com to let me know.<p>We're also hiring ELECTRICAL and MECHANICAL engineers!","time":1317487547,"type":"comment"},{"by":"jongos","id":3060840,"parent":3060221,"text":"Washington, D.C. or Philadelphia, PA - metaLayer (<a href=\"http://metalayer.com/careers.html\" rel=\"nofollow\">http://metalayer.com/careers.html</a>)<p>My data vis, visual search technology startup is looking to make three hires. We're an early stage startup currently in DreamIt Ventures incubator in Philadelphia, PA which means you'll get to experience the startup life while surrounded by 14 other startups at the same time.<p>Market Research Assistant - INTERN<p>Senior Software Engineer (Python, Hadoop, PIG) - FULLTIME<p>Business Development/Sales - FULLTIME<p>The details are too long to list here but you can find out more and how to apply at our site - <a href=\"http://metalayer.com/careers.html\" rel=\"nofollow\">http://metalayer.com/careers.html</a>","time":1317496378,"type":"comment"},{"by":"deckster","id":3061895,"parent":3060221,"text":"Portland OR - DECK Monitoring (Full Time Position, On Site)<p>We build energy monitoring software primarily for the solar energy industry. Our mission is to increase the production of solar energy plants around the world, as well as facilitate their development.<p>We are hiring front end developers who are interested in creating compelling data visualizations with cutting edge web programming languages.<p>We don't currently have a position posted for this job on our website, but I wanted to post here before the thread got too old. Please contact us through the email address on this page if you are interested.<p><a href=\"http://www.deckmonitoring.com/company.php\" rel=\"nofollow\">http://www.deckmonitoring.com/company.php</a>","time":1317524349,"type":"comment"},{"by":"bnewbold","id":3061664,"parent":3060221,"text":"NYC - Octopart<p>We build tools to help anybody find and source electronic parts and industrial controls components. Octopart is profitable and has half a million monthly users, but we are just beginning to modernize this industry and impact how \"stuff\" gets designed and made. Our users are engineers, scientists, industrial designers, big companies, little companies, hackers, and students.<p>Looking most urgently for a front ender, an analytics engineer, and a business person, but if you are excited about what we are doing drop us a line: <a href=\"http://octopart.com/jobs\" rel=\"nofollow\">http://octopart.com/jobs</a>","time":1317516692,"type":"comment"},{"by":"puredanger","id":3061095,"parent":3060221,"text":"St. Louis or Washington DC / Maryland area (Full-time)<p>Revelytix (<a href=\"http://revelytix.com\" rel=\"nofollow\">http://revelytix.com</a>) is hiring Clojure developers for full-time, direct employment in St. Louis, Missouri and Baltimore, Maryland USA. We are a relatively small team of developers building semantic technology based, data integration products. We understand that applicants may not have deep Clojure or semantic technology experience, but this is a great place to get it!<p>If you are interested, email a note and your resume to careers _at_ revelytix.com","time":1317503037,"type":"comment"},{"by":"kfonghack","id":3061041,"parent":3060221,"text":"Berkeley - PINC Solutions (full-timers)\nSenior Ruby on Rails Developer\n<a href=\"http://www.pincsolutions.com/page/careers-senior-software-engineer\" rel=\"nofollow\">http://www.pincsolutions.com/page/careers-senior-software-en...</a><p>Interested in making a direct impact on the productivity and economic strength of United States? We are not into marketing, social media, or financial services.   Instead, our products and services enable real productivity gains in this nation’s physical transport logistics.  The return on investment (ROI) for our customers can be demonstrated in months.  We are unique in our market space. We have a strong technology base and great private investor backing.  Our challenge is to grow quickly, deliver consistently, and keep creating striking values.<p>PINC Solutions has a high quality engineering team.  This is not a sweat shop nor is it a playground for geniuses.  We are smart, professional, and industrious people that enjoy working together to bring Internet technologies to real, physical world needs.   Our engineering office is currently located in Berkeley near University of California but we may move to Pleasanton in 2012.  We are looking for a seasoned RoR developer that is passionate about building highly scalable, secure, robust, and high performance SaaS product.<p>If interested, please send a cover letter along with your resume to jobs@pincsolutions.com","time":1317501426,"type":"comment"},{"by":"mdelagra","id":3066254,"parent":3060221,"text":"Evanston, IL<p>Leapfrog Online is looking for a talented Chicago-area Python engineer to work in our Evanston office. Our Python engineers build and maintain high-traffic web sites using the Django web framework. We offer a great working atmosphere, a strong focus on work-life balance, and tremendous opportunities to learn new skills and technologies. We also have competitive salaries and benefits and close-knit teams who like what they do.<p>As we principally focus on the web, we look for real-world experience using Python application frameworks (such as Django) to build high-traffic web sites and applications. Experience with other languages is welcome. What are the extras we look for? Experience producing and consuming web services (SOAP, REST, XML-RPC); experience working with message-oriented systems (AMQP or other message, pub-sub and task queues such as Celery); deep knowledge of version control systems (especially Mercurial or Git); an interest in non-RDBMS data stores (CouchDB, MongoDB, Redis); knowing what it really means to develop RESTful applications; and, experience with functional and declarative programming models in addition to object-oriented development.<p>If you're a bright, self-motivated engineer who enjoys using open source software to solve interesting problems, you’re our kind of programmer, and we’d like to talk to you. You can apply on our site, where you'll also find full job descriptions and information about Leapfrog Online: <a href=\"http://www.leapfrogonline.com/who/careers/\" rel=\"nofollow\">http://www.leapfrogonline.com/who/careers/</a>","time":1317649963,"type":"comment"},{"by":"amduser29","id":3060575,"parent":3060221,"text":"SF, CA - Head of Product, Mobile Devs, Frontend Devs<p>Life360<p><pre><code>  - a utility used by millions of families\n  - actually wants to make a difference in people's lives\n  - working on some very ambitious goals\n</code></pre>\nLife360 is not<p><pre><code>  - another photo sharing app\n  - a Groupon clone\n  - built on the FB platform\n</code></pre>\nLife360 offers<p><pre><code>  - interesting and engaging work\n  - great pay and awesome equity\n  - lots of freedom\n</code></pre>\nLife360 would love to tell you more<p><pre><code>  - alex@life360.com\n  - http://life360.jobscore.com/list</code></pre>","time":1317491212,"type":"comment"},{"by":"lpolovets","id":3061060,"kids":[3061277],"parent":3060221,"text":"Los Angeles or Bay Area or Shanghai preferred, but remote work is possible for exceptional candidates. Full-time only. If you're interested in working remotely, you must live in the U.S. H1B is okay.<p>Factual aims to be the place where people meet to share, improve, and mash-up data. Our vision is to be an awesome and affordable data provider, so that big companies, startups, and developers can focus on innovation instead of data acquisition.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). Last year we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, SimpleGeo, and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We currently have about half a dozen job openings, from data engineering to software engineering to system administration. For the software engineering position, you would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p>If you're interested in the Bay Area office, it's just starting up, so you'd have a significant influence on the culture there.<p><a href=\"http://www.factual.com/jobs\" rel=\"nofollow\">http://www.factual.com/jobs</a> or you can email me personally at leo -at- factual.com. Thanks for reading!","time":1317501909,"type":"comment"},{"by":"jack7890","id":3060352,"parent":3060221,"text":"Web Engineer - SeatGeek - New York, NY<p>We're looking for a hacker who is super-hungry and sees building web apps as more than just a job. We're a data-driven web app that's trying to use analytics and exceptional UX to making buying event tickets a wholly better experience. #Python #Ruby #PHP #MySQL #Redis #MongoDB #Javascript<p>Competitive comp, outstanding benefits, and a kick ass team. Only looking for folks in NYC.\n<a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1317487023,"type":"comment"},{"by":"brevityness","id":3061273,"parent":3060221,"text":"Irvine, CA (Orange County)\nDrink Pass(<a href=\"http://drinkpass.me\" rel=\"nofollow\">http://drinkpass.me</a>) Going out just got easier<p>The position will mainly focus on leading the development of the Drink Pass iPhone/Android application. In particular, we’re interested in individuals with a keen attention to detail, a passion for mobile app development, and an interest in the club and bar scene.<p>&#62; Responsibilities:\nLeading the development of the Drink Pass iPhone/Android applications\nWork together with other team members in QA, Business Development, and<p>&#62; Requirements:\nExperience developing iPhone applications using Objective C, Cocoa, XCode and Interface Builder\nGeneral understanding of web technologies including HTML, CSS, Javascript\nTeam player and hustler who gets things done\nExperience with version control (we use Sourceforge)\nBS/BA in Computer Science, Information Systems, Engineering or related field preferred (let us know what projects you’ve worked on yourself or for a company)<p>&#62; What we offer:\nStock options\nTelecommuting<p>The Drink Pass team consists of 7 people. We like to work in a fast-paced and fun environment. Everyone’s voice is always heard and your contributions will make a huge impact on what we do.<p><i></i>*If you’re interested, email us at jobs@drinkpass.me including your resume and cover letter. In your cover letter, describe your interest in mobile payments and past experience developing for either iOS or Android. Feel free to link to any past projects or work you've done (Github, Sourceforge).","time":1317507131,"type":"comment"},{"by":"borski","id":3060879,"parent":3060221,"text":"INTERN, H1B acceptable<p>Generalist or Backend Engineer<p>Palo Alto - Tinfoil Security (<a href=\"http://www.tinfoilsecurity.com\" rel=\"nofollow\">http://www.tinfoilsecurity.com</a>) - 500startups company<p>About Tinfoil Security:<p>Tinfoil Security is the simplest way to secure your website. To the user, we provide an easy-to-use reporting interface that tells you where we found vulnerabilities, what they are, and provides a step-by-step wizard of how to fix them. Behind the scenes, we're crawling the site looking for every potential input vector and attempting to infiltrate, just like any external hacker would. The catch is we do this non-maliciously and without leaving a trace. Sound interesting?<p>We're looking for incredibly smart guys (or girls) who like to get their hands dirty. If you don't know the answer, find it. If you can't find it, build it; but don't reinvent the wheel. If all the wheels suck though, build a better one.<p>We're revolutionizing the stale and boring security industry, and making website and mobile security accessible to the world, so no business has to continue being the \"low hanging fruit.\" It's absurd that security is only understood by so few developers and business owners in the world, when so much of it is actually pretty simple to understand. We want to change that. Join us.<p>About you:<p>You'll be employee #1.<p>Our entire stack is Ruby at the moment, but we have a strong affinity for Python, Scala, and C, in no particular order. We're of the mindset that you pick the best tool for the job, much as you wouldn't hammer in a nail with a wrench (unless you didn't have a hammer and really needed to get it done fast).<p>You'll be in charge of a large project, and will be given the ability to take charge of it and make it your own. On the flipside, you should be willing to take on that challenge.<p>More than anything else, I can guarantee you'll have a boatload of fun, learn a ton, and produce software people really care about; lots of people.<p>We offer significant equity, market salary, benefits, your choice of equipment, etc. We're based in Mountain View and are looking for people that can hack in the office with us.<p>Please get in touch -- borski@tinfoilsecurity.com -- we'd love to chat. :)","time":1317497337,"type":"comment"},{"by":"nfriedly","id":3061244,"parent":3060221,"text":"San Mateo, CA<p>Sociable Labs is building the future of social commerce and we're looking for a few more engineers to help. A passion for learning, communication skills, and intellectual horsepower are more important to us than what you know.<p>Our product is essentially a more advanced version of facebook's social plugins. See a couple of examples at <a href=\"http://www.backcountry.com/ski\" rel=\"nofollow\">http://www.backcountry.com/ski</a> (\"Ask your friends\" section at bottom) and <a href=\"http://www.active.com/running/palo-alto-ca/marsh-madness-5k-10k-half-marathon-2011\" rel=\"nofollow\">http://www.active.com/running/palo-alto-ca/marsh-madness-5k-...</a> (\"Connect with friends\" section on the right)<p>We have a modular JavaScript front end that works with the Facebook platform and makes use of cutting edge technologies like localStorage and CORS (cross-domain ajax). Our back end is Java / Jetty / Postgres on Amazon EC2.<p>We offer competitive pay, great benefits (including the best PTO policy I've ever seen), and an enjoyable working environment.<p>More details about the company and the jobs here: <a href=\"http://www.sociablelabs.com/careers.htm\" rel=\"nofollow\">http://www.sociablelabs.com/careers.htm</a><p>I work on the front-end but feel free to ask me questions about anything. If I don't know, I'll get you to the right person. Reply here or email nathan@[company site].com","time":1317506306,"type":"comment"},{"by":"joebasirico","id":3060928,"parent":3060221,"text":"Seattle, WA &#38; Boston, MA<p>Be a part of an awesome team of hackers with Security Innovation.<p>We find security issues in some incredibly interesting pieces of software, from web applications to embedded and mobile to desktop and server apps. If you think the world is a scary, insecure place and 0x41414141 makes you smile, please apply!<p>We encourage you to do your own security research and give you time and budget to pursue those topics. We want you to attend and speak at the conferences, write tools, white papers and blog posts on topics of your choosing. Beyond that we have an awesome perks package. You get a ton of freedom to be a rockstar.<p>We have developed or helped develop Blackmamba(<a href=\"http://rootfoo.org/blackmamba\" rel=\"nofollow\">http://rootfoo.org/blackmamba</a>), Firesheep and other cool security tools.<p>We have four positions (and multiple openings) open:<p>- Security Engineer - the pen-testers that find vulns<p>- Lead Security Engineer - a seasoned security professional that can run our new Boston based security team<p>- Sales Engineer - a technical engineer that can help bridge the gap between sales and the engineers<p>- Linux System Engineer - Help build and design the most secure Kiosk system in the world based on some really cool tech.<p>If this sounds up your alley, e-mail me at jobs@securityinnovation.com or find out more about us at <a href=\"http://bit.ly/SICareers\" rel=\"nofollow\">http://bit.ly/SICareers</a>","time":1317498710,"type":"comment"},{"by":"beadomi","id":3077709,"parent":3060221,"text":"Mountain View, CA - Zanbato Group - Full Time/Intern<p>We are looking for world-class software engineers who love to develop in a fast-paced environment, who love solving hard problems and are ready to join a small, fast growing team.  Our technology stack is primarily Django / Python /HTML/CSS and Javascript/jQuery, but if you have previous experience using agile web frameworks, you will fit right in.<p>About us:<p>Zanbato is revolutionizing the market for global infrastructure investments. We are a team of passionate young engineers and entrepreneurs, developing an online marketplace and process management technology for investments in infrastructure projects (toll roads, airports, power plants, etc.). Our technology combines features from online listing services, social networking platforms, and process management tools to support governments, private investors, and their advisors in bringing infrastructure projects to completion. We are still small, under 20 employees, but growing quickly and have some incredible opportunities in the horizon, including a partnership with African Development Bank to create a custom made platform that will further infrastructure development in Africa, a continent with nearly a billion people, who currently face the largest infrastructure gap in the world.<p>We were founded in 2010 by Joe Lonsdale, co-founder of Palantir Technologies, and Dr. Ryan J. Orr, executive director at Stanford’s Collaboratory for Research on Global Projects. We have closed two very successful fundraising rounds and . If you are interested in applying, send an email with your resume to careers@zanbatogroup.com and we'll be in touch shortly.","time":1317850411,"type":"comment"},{"by":"timbucktieu","id":3064217,"kids":[3085509],"parent":3060221,"text":"Mountain View, CA<p>Addepar (addepar.com) is a software company looking to solve challenging problems in the financial industry.<p>We're looking for exceptional engineers to develop our revolutionary technologies. The job description is broad, and you'll do everything from accessing and exploring complex sets of financial data to sculpting the finer points of the user interface. The position is perfect for an engineer who is passionate about coding and enjoys solving difficult problems. If you want to transform an industry, work around the most talented individuals, and be challenged on a daily basis, Addepar will be a great fit.<p>Our CEO, Joe Lonsdale, is a founder of Palantir Technologies, which is known for revolutionizing technology in other key areas of the world's international defense and finance communities. In his early twenties, Joe helped to build a multi-billion dollar hedge fund, where he was one of the top traders. Our technical team is led by CTO Jason Mirra, and is composed of computer scientists from Stanford, Berkeley, MIT, and Carnegie Mellon. Addepar is supported and advised by a group of international billionaires, and some of the most respected Silicon Valley venture capitalists.<p><a href=\"http://addepar.com/careers.php\" rel=\"nofollow\">http://addepar.com/careers.php</a>","time":1317593913,"type":"comment"},{"by":"chrissnell","id":3061219,"parent":3060221,"text":"Software Architects/ Developers needed\nColorado / Remote<p>I'm working on a promising idea for TechStars Cloud (<a href=\"http://www.techstars.com/cloud/\" rel=\"nofollow\">http://www.techstars.com/cloud/</a>).  I'm designing a product around OpenStack technology that will bring cloud storage to the average business.  I'm looking for one or two developers with strong experience building back-end services to join me as co-founders for this venture.  During the TechStars application process, this position is unpaid.  We're working on this project in the evenings, after our full-time jobs.  It's a gamble, I know.  On the other hand, I think that we have a strong idea and if you join me now, we will be dividing our ownership of this venture equally amongst the three or four of us.<p>For now, this product is being worked on remotely.  If selected for TechStars Cloud, we may continue to work remotely or we may converge in San Antonio, TX for the TechStars incubation stage.  Obviously, you must be able to work legally in the US.  No H1B sponsorship available.<p>About me: I have 18 years of experience as an engineer in the Internet industry.  I've spent the last four years working with cloud computing for a major hosting provider.  This idea is the genesis of daily conversations that I have with customers.  It's a product that I think business is screaming for but nobody has perfected yet--and I think I know how to perfect it.<p>If you think you have the chops to take on a project like this, send me your resume and some links to projects that you've worked on, preferably on GitHub or the like so that I can review your contributions.<p>kumogumo@gmail.com","time":1317505885,"type":"comment"},{"by":"neiljohnson","id":3062802,"kids":[3063438],"parent":3060221,"text":"London\nOpenMarket are looking for Java developers to work on mobile messaging/payments platforms.\nWe offer hard problems, lots of autonomy, an engineering driven culture and full control over product delivery from design through to deployment.\nSee <a href=\"http://www.mxtelecom.com/uk/careers/roles/softdev\" rel=\"nofollow\">http://www.mxtelecom.com/uk/careers/roles/softdev</a> for more details or contact me directly at neil.johnson //at// openmarket.com","time":1317562277,"type":"comment"},{"by":"rpierry","id":3066730,"parent":3060221,"text":"Dallas / Austin / REMOTE / Relocate possible<p>projekt202<p>Job Title: Full time consultant - Senior .NET Developer / Architect<p>projekt202 is a small but growing full-service consulting company that combines deep design expertise, a focus on user experience, and a proven technology focus. We integrate applications, human processes, and secure, scalable technology platforms for emotionally rich and intuitive user solutions.<p>We are looking for senior level .NET consultants who are interested in collaborating with our design and user experience experts to deliver compelling applications.  We have worked for clients you have heard of and on products you probably own.  The ideal candidate would conscientiously apply their mastery of .NET to ensure our clients receive applications that are both beautiful and functional inside and out.<p>Things we like: MVC, LINQ, IoC / DI, Agile, Continuous Integration<p>Though we're looking for C# / .NET experts, we also do work in other languages (Ruby, Python, Java for Android, ObjectiveC for iOS), so interest or familiarity with any of those is appreciated.<p>Remote work is a possibility, as is relocation to Dallas or Austin (where are main offices are).  Unlike many other consulting companies, we try to work from our offices rather than the client site so we get an opportunity to actually interact with each other.  We provide small benefits like snacks and drinks and larger ones like really good health insurance that is mostly company paid.  If you are interested, email your resume to join@capturaonline.com (Captura and projekt202 recently merged and we're working on the technology migration)","time":1317657214,"type":"comment"},{"by":"anniewang","id":3063310,"parent":3060221,"text":"Boston, MA - Lead Engineer at Her Campus Media (students welcome to apply for engineering internships)<p>tl;dr Award-winning digital media start-up in Boston seeks an outstanding Lead Engineer to lead all tech development.<p>Her Campus (HerCampus.com) is an online magazine for college women. It also serves as a marketing firm connecting companies to college students in creative ways. We're looking for an outstanding Lead Engineer to join our executive team as a key decision-maker for a new product offering we're building from the ground up.<p>We're a fast-paced team of enthusiastic entrepreneurs with ambitious goals. We've been named to BusinessWeek's 25 Under 25 Best Young Entreprenuers, Inc. magazine's 30 Under 30 Coolest Young Entrepreneurs, and have been featured in the New York Times, Forbes, The Boston Globe, Mashable, and more.<p>This is an opportunity to make a real long-term impact in an early-stage business -- you pick the technologies we'll use. We're serious about this \"Lead Engineer\" title. The ideal candidate will love thinking about where the product should go as well as have the coding skills to build it. We're confident that Her Campus is going to blow it out of the water, so come join us!<p>To learn more, contact me directly:<p>Annie Wang\nCo-founder, Her Campus Media\nannie@hercampus.com","time":1317574698,"type":"comment"},{"by":"twelve45","id":3061145,"kids":[3063453,3080196],"parent":3060221,"text":"San Jose - BVI Networks (bvinetworks.com). INTERN, H1B welcome.<p>If you run an e-commerce website, you probably use google analytics, mixpanel or similar to track your customers and do some funnel analysis, A/B testing etc to optimize your site.<p>If you run a physical retail store though, you're out of luck. How many people walk into my store and leave frustrated, without buying anything? Why isn't my hot new item selling - is no one seeing it, or are they seeing it but not buying because the price is too high? There's no easy way to find answers to these today.<p>Not having cookies or IPs makes tracking in the real-world a real challenge! We primarily acquire data through machine vision algorithms that run against video cameras in the stores and identify and track people, but we also use data from a host of other technologies (RFID, WiFi, Zigbee, etc) to get the full picture.<p>We just closed our series B, and are scaling very fast. We use C/C++, Java, Python and Flex. Our product runs on Linux. We like super-smart generalist hackers who like working on a variety of things - UI development, machine vision algorithms, AI, data mining/analytics on big data (last month we tracked nearly 2M people worldwide!). Hit us up at jobs@bvinetworks.com.","time":1317504398,"type":"comment"},{"by":"mcodik","id":3060481,"parent":3060221,"text":"Seattle WA, H1B welcome. <a href=\"http://www.amazon.com/tradein\" rel=\"nofollow\">http://www.amazon.com/tradein</a><p>My team at Amazon is looking for software engineers to help grow the Amazon Trade-In program: customers send us their used books, video games, movies and electronics in exchange for Amazon gift cards.<p>We're looking for smart engineers that are effective at both frontend and backend work and have a track record of getting things done. Email is in the profile.","time":1317489425,"type":"comment"},{"by":"simonholroyd","id":3064887,"parent":3060221,"text":"SoHo, New York, NY<p>GO TRY IT ON (<a href=\"http://www.gotryiton.com\" rel=\"nofollow\">http://www.gotryiton.com</a>) is a venture backed start-up seeking to transform the social retailing space by giving people real-time answers to the question, \"What should I wear?\"<p>We're looking to hire generalist developers who can build products to bridge the gap between online retail shopping and social networking.<p>We play with:  PHP, MySQL, Javascript, jQuery, iOS, HTML5, Backbone, Sencha Touch, Rails, AWS<p>We make your life easier with: Git, Vagrant, Chef, Capistrano, Macs, and lots of Diet Coke<p>We have: Series A funding from SPA investments and Index Ventures, a small, growing team of very smart people, a brand new office on the 21st floor, and an awesome panoramic city view  \n[n: <a href=\"http://twitpic.com/6udocv\" rel=\"nofollow\">http://twitpic.com/6udocv</a>,\ne: <a href=\"http://twitpic.com/6udp0j\" rel=\"nofollow\">http://twitpic.com/6udp0j</a>,\ns: <a href=\"http://twitpic.com/6udphj\" rel=\"nofollow\">http://twitpic.com/6udphj</a>,\nsw: <a href=\"http://twitpic.com/6udpsx\" rel=\"nofollow\">http://twitpic.com/6udpsx</a>]<p>Email simon@gotryiton.com<p>Or check out: <a href=\"http://www.gotryiton.com/jobs\" rel=\"nofollow\">http://www.gotryiton.com/jobs</a>","time":1317611934,"type":"comment"},{"by":"n8boyd","id":3065388,"parent":3060221,"text":"San Francisco -- Nomic<p>Front-end Developers and a Platform Engineer<p>Nomic is an economic network, a platform for the world's economic relationships.  We are enabling relationships that don't belong on social networks, but which we each depend upon on a daily basis.<p>Nomic is seed funded and we are assembling our founding technical team.  Find out more about our open positions at <a href=\"http://nomic.com\" rel=\"nofollow\">http://nomic.com</a>.<p>Cheers!<p>Nate Boyd, President &#38; Co-founder, Nomic","time":1317626247,"type":"comment"},{"by":"chiamonkey","id":3065667,"parent":3060221,"text":"Rangespan &#60;<a href=\"http://www.rangespan.com&#62\" rel=\"nofollow\">http://www.rangespan.com&#62</a>; (Paddington Area, London, UK)<p>Job Description<p>We're looking for a senior developer to join our team and lead subsequent members. As one of the first technical team-members, you will have broad and hands-on responsibility for development of extremely high-scale systems and web services for retailers and suppliers.<p>Requirements:<p>* Fluency with Python and Django\n* Proficient with MongoDB and MySQL\n* Experience with REST Web Service, Flask and fault-tolerant AWS architectures is a plus\n* Demonstrated experience building a platform from scratch\n* Experience with catalogue systems is a plus\n* A knack for solving problems creatively<p>About Rangespan:<p>Founded by ex-Amazon executives and engineers, Rangespan is an ambitious e-commerce software company that makes it easy for retailers to offer deep product selection. We're solving complex problems with huge data sets.<p>Contact Info:<p>* Contact: Christian Ricci\n* Email: chris@rangepan.com\n* Web: <a href=\"http://www.rangespan.com/jobs/\" rel=\"nofollow\">http://www.rangespan.com/jobs/</a>\n* No telecommuting (full-time, onsite, no contractors, no recruiters)","time":1317636160,"type":"comment"},{"by":"jbapple","id":3060294,"parent":3060221,"text":"Eugene, Oregon, internship possible, noremote<p>On Time Systems is a small company (about 22 employees) that develops AI applications for scheduling and routing. We're currently looking for software engineers to work on Green Driver (a smartphone app that uses real-time data from traffic signals to help drivers find the fastest route (<a href=\"http://imagreendriver.com)\" rel=\"nofollow\">http://imagreendriver.com)</a>) and ACFP, the flight planning system used by the US Air Force for routing non-combat flights. We're looking especially for people with a strong algorithmic background.<p>We have some really nice benefits, including (in addition to the usual ones like medical) sabbaticals, massages, your own office with a window, and 100% tuition reimbursement (including flight school if you work on our flight planning software). We used to be a research lab at the University of Oregon, and the atmosphere maintains some of the academic feel.<p>See <a href=\"http://www.otsys.com/employment.php\" rel=\"nofollow\">http://www.otsys.com/employment.php</a> for more details. Send your resume to jobs+hackernews@otsys.com","time":1317485980,"type":"comment"},{"by":"luv2code","id":3061058,"parent":3060221,"text":"Dallas, TX local candidates only.\n3 positions open on my team:\nScrum Software Engineer for Test, Scrum Product Owner,\nand we're looking for an UX Expert.<p>This is a greenfield javascript/html5 project.  We're building a very advance browser application.  All three positions will be working closely with 4 developers in a team room on a scrum project.<p>Software Engineer for Test:  You should know what a testable application looks like and have experience with and a deep understanding of BDD, DDD, and TDD.  Experience with automated (build driven) testing tools a plus.  Tools we're using currently include: nodejs, jasmine, and psake.  but we expect the candidate to provide guidance, and take charge of making the application testable and tested.<p>Product Owner: Scrum master experience a huge plus.  You would be the face of the team to the rest of the company.  Manage the backlog of work providing guidance regarding priority of feature development.  Work with project management and user groups on defining requirements.  Industry experience in financial trading preferred.  A solid scrum background preferred.<p>UX Expert: Experience building web application interfaces preferred.  You would be responsible for building a user pleasing interface over a very powerful application.  You would also design several alternate interfaces for many different audiences from power users to newbies, from Americans to Zimbabweans, and also many different platforms - Desktop browsers, tablet, phone, windows 8 app store, chrome app store, etc...  Experience with data analysis interfaces preferred (charts, graphs, and tables).<p>We are targeting modern browsers.  We will support IE9+ only. ( potentially IE10+ only).<p>We offer competitive pay and flexible hours.<p>email your resume and contact info to luv2code gmail com","time":1317501882,"type":"comment"},{"by":"kek","id":3064380,"parent":3060221,"text":"New York City, NY<p>Greatist is looking for a passionate web developer who wants to disrupt the health and fitness space. We inspire and inform our readers to make one healthier choice per week by providing them with entertaining, high-quality, relatable content - the Greatist way.<p>We need a smart self-starter who loves simplicity and effectiveness, builds stuff for fun that’s been successful, and wants to take ownership of the technical side of things. Ideally, you’ll be experienced with PHP, WordPress, and Javascript, but that doesn’t matter as much as a desire to learn and grow. Your work will be seen - we had over 250,000 unique visitors last month, and we’re only getting bigger. At Greatist, we believe every team member makes an impact. Passion for health and fitness is a must— we live the life we champion!<p>This is a full-time position in NYC. Send your resume, favorite health and fitness tip, Github profile, and anything else you can think of to opps (at) greatist (dot) com.<p>Email kelli (at) greatist (dot) com if you have any other questions - or just want to swap recipes.","time":1317597937,"type":"comment"},{"by":"DanMetcalfe","id":3065633,"parent":3060221,"text":"Saltaire, West Yorkshire, UK. PHP devs wanted (FULL-TIME, ON-SITE)\n... by fleetondemand.com, a funded start-up developing web apps for the business fleet/motor industry<p>What we're mostly looking for:\n- experience in OO PHP, mySQL and modern javascript use (we use jQuery)\n- team worker, appreciative of customers and users<p>Any of this would be a bonus:\n- strong cross browser/device HTML&#38;CSS\n- experience in Apache administration, mod_rewrite etc\n- familiarity with version control\n- linux sysadmin\n- web design &#38; illustration skills<p>Joining our dev team, you'd be contributing to current and future work:\n- extending functionality on our app; from the system model, through to page builds and testing\n- using and contributing to our in-house MVC framework\n- communicating with 3rd party systems using existing APIs or bespoke mechanisms\n- benchmarking, scalability and penetration testing\n- scalability solutions (caching, DB replication, load balancing, noSQL, ....?)<p>Interested? Want to know more? Hey, where do I send my CV? danm@fleetondemand.com","time":1317635020,"type":"comment"},{"by":"ig1","id":3060838,"kids":[3060951,3060924,3061276],"parent":3060221,"text":"Here's a summary of startup related job boards from around the world, most of them are broadly recruiter free:<p>======================<p>US:<p>Crunchboard <a href=\"http://www.crunchboard.com/jobs/\" rel=\"nofollow\">http://www.crunchboard.com/jobs/</a><p>Startuply <a href=\"http://www.startuply.com/\" rel=\"nofollow\">http://www.startuply.com/</a><p>YC Company Jobs: <a href=\"http://news.ycombinator.com/jobs\" rel=\"nofollow\">http://news.ycombinator.com/jobs</a><p>======================<p>UK:<p>CoderStack (Developer Jobs - run by me) \n<a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>Mind The Product (Product Management Jobs) <a href=\"http://mindtheproduct.com/jobs/\" rel=\"nofollow\">http://mindtheproduct.com/jobs/</a><p>Work in Startups <a href=\"http://www.workinstartups.com/\" rel=\"nofollow\">http://www.workinstartups.com/</a><p>Enternships - (Startup Internships) <a href=\"http://www.enternships.com/en/enternships\" rel=\"nofollow\">http://www.enternships.com/en/enternships</a><p>======================<p>Germany:<p>Berlin Startup Jobs <a href=\"http://berlinstartupjobs.com/\" rel=\"nofollow\">http://berlinstartupjobs.com/</a><p>======================<p>Canada:<p>StartupNorth <a href=\"http://jobs.startupnorth.ca/\" rel=\"nofollow\">http://jobs.startupnorth.ca/</a>","time":1317496368,"type":"comment"},{"by":"sahil_lmn","id":3061245,"kids":[3075924],"parent":3060221,"text":"Reston, VA (west of Washington, DC) - Full Time or Contractor (H1B maybe if already in US)<p>Lucidmedia Networks - <a href=\"http://www.lucidmedia.com\" rel=\"nofollow\">http://www.lucidmedia.com</a><p>Internet ad network startup looking primarily for Java developers (experience with SQL and front-end web experience would be great too). The Internet advertising industry is quite complex behind the scenes and somewhat parallels the structure of the financial markets. We are analogous to a high frequency trading firm, buying page views to serve ads in real-time on exchanges like that of Google or Yahoo. Our server software runs on Spring, MySQL, Redis, and AWS at a glance. We handle about a billion page impressions a day. Big data, big throughput.<p>Small yet experienced team, catered lunches _everyday_, your choice of Mac or PC (dev team is almost all Mac now), good benefits. Our office has superhero posters all over the walls.<p>Contact me directly at sahil_lmn@yahoo.com.<p>I actually got hired through a HN \"Who is Hiring\" thread. These things do work!","time":1317506339,"type":"comment"},{"by":"petitbon","id":3061086,"parent":3060221,"text":"New York, NY | London, UK<p>Medidata Solutions is looking for 2 DevOps Engineers to assists in the configuration, management and deployment of SaaS software using Infrastructure as as Service provided by Amazon Web Services.<p>*nix (Debian/Ubuntu), Ruby, Bash, Chef, Amazon Web Services api, nginx, git, phusion passenger, java, tomcat, EC2, ELB, RDS, S3...<p>contact j p e t i t b o n a t m d s o l d o t c o m","time":1317502657,"type":"comment"},{"by":"asanwal","id":3060477,"parent":3060221,"text":"NYC or Remote (Full-time and Intern)<p>CB Insights (<a href=\"http://www.cbinsights.com\" rel=\"nofollow\">http://www.cbinsights.com</a>)<p>National Science Foundation backed data-as-a-service company...generating real revenue and going after the lumbering dinosaurs in our industry<p>Looking for:<p>- Front end developer<p>- Machine learning/NLP<p>- Data journalist<p>More here - <a href=\"http://www.cbinsights.com/hiring.php\" rel=\"nofollow\">http://www.cbinsights.com/hiring.php</a><p>apply at info@cbinsights.com","time":1317489359,"type":"comment"},{"by":"bkudria","id":3067785,"parent":3060221,"text":"San Francisco, CA - Yammer<p>Yammer is an awesome tech startup masquerading as an enterprise software vendor. We're building an enterprise social network (an internal communication and collaboration tool. Like Facebook.) and we need your help.<p>We build our product with insight and wisdom gained from the consumer social networking space, but we charge enterprise prices (and our customers pay them!) We're fighting some big serious competitors (Salesforce/Chatter, Jive, and VMWare/Socialcast) and this space has never been more exciting.<p>Yammer is really changing the way people get work done. We have actual challenges to overcome and we're doing our best to make a kick-ass product that makes our users happy.<p>Tech we use: Ruby/Rails, Scala, and JavaScript. We have Obj-C and C# stuff too.<p>Some bullet points for you to skim:<p>• Amazing group of smart engineers to work with. Really.<p>• We hack in Ruby/Rails, Scala/JVM, Javascript/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT/Sharepoint stuff.<p>• Competitive compensation. Enough said.<p>• Delicious catered lunch and dinner daily, with a 3PM snack cart. Also a fully-stocked beer-and-beverage fridge.<p>• Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>Some links for you to read more:<p>• Our jobs page: <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>• Our Engineering blog: <a href=\"http://eng.yammer.com/\" rel=\"nofollow\">http://eng.yammer.com/</a><p>• A blog post about why it's so awesome to work here: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.html\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a><p>Feel free to get in touch: bkudria@yammer-inc.com","time":1317672388,"type":"comment"},{"by":"LeBlanc","id":3060380,"parent":3060221,"text":"Palo Alto, CA<p>WePay<p><a href=\"https://www.wepay.com/jobs\" rel=\"nofollow\">https://www.wepay.com/jobs</a> - We're solving a real problem, making tons of money while doing it and are taking PayPal head on. Read our blog post about why we're hiring: <a href=\"http://www.wepay.com/blog/2011/09/29/why-wepay-is-hiring/\" rel=\"nofollow\">http://www.wepay.com/blog/2011/09/29/why-wepay-is-hiring/</a><p>H1B welcome.","time":1317487594,"type":"comment"},{"by":"dougk7","id":3060408,"parent":3060221,"text":"South Africa (Johannesburg or Cape Town)<p>Saidwot (<a href=\"http://www.saidwot.com\" rel=\"nofollow\">http://www.saidwot.com</a>)<p>We are hiring Backend Developers with experience in Python and MySQL or Postgresql. Bonus points for experience with Java, Solr/Lucene or MongoDB.\nWe are also hiring Frontend Developers with experience in PHP, Javascript and HTML.<p>Drop me a mail at my HN username at gmail.","time":1317488110,"type":"comment"},{"by":"bdickason","id":3060290,"kids":[3060312],"parent":3060221,"text":"New York, NY<p>Bookish is hiring Scala and Rails engineers to work on a project that puts Reading Rainbow to shame.<p>Lots of interesting work around recommendations, big big data, ereading, and everything in between.<p><a href=\"http://www.startuply.com/Jobs/Software_Engineers_Scala_Ruby_Rails_Sproutcore_3120_2.aspx\" rel=\"nofollow\">http://www.startuply.com/Jobs/Software_Engineers_Scala_Ruby_...</a>","time":1317485917,"type":"comment"},{"by":"veritas9","id":3061301,"parent":3060221,"text":"A bunch of companies are actively hiring on our platform, CodeEval.com - solve a challenge to get placed in awesome companies!<p><a href=\"http://codeeval.com/public_sc/48/\" rel=\"nofollow\">http://codeeval.com/public_sc/48/</a>  =&#62; Milo (a eBay company)<p><a href=\"http://codeeval.com/public_sc/37/\" rel=\"nofollow\">http://codeeval.com/public_sc/37/</a>  =&#62; Ampush Media<p><a href=\"http://codeeval.com/public_sc/6/\" rel=\"nofollow\">http://codeeval.com/public_sc/6/</a>   =&#62; Factual<p><a href=\"http://codeeval.com/public_sc/45/\" rel=\"nofollow\">http://codeeval.com/public_sc/45/</a>  =&#62; HiGear<p><a href=\"http://codeeval.com/public_sc/12/\" rel=\"nofollow\">http://codeeval.com/public_sc/12/</a>  =&#62; Shopp.ly<p>\\<a href=\"http://codeeval.com/public_sc/10/\" rel=\"nofollow\">http://codeeval.com/public_sc/10/</a>  =&#62; Asana<p><a href=\"http://codeeval.com/public_sc/55/\" rel=\"nofollow\">http://codeeval.com/public_sc/55/</a>  =&#62; lolapps<p><a href=\"http://codeeval.com/public_sc/47/\" rel=\"nofollow\">http://codeeval.com/public_sc/47/</a>  =&#62; deviantart","time":1317507630,"type":"comment"},{"by":"rw","id":3060518,"parent":3060221,"text":"New York, NY (in NoHo on Broadway). Full time and internships.<p>QLabs<p>We're a new type of in-house incubator: we prototype startups by building and launching an MVP every 6-8 weeks.\nThis is like startup boot-camp. Come hack with us on amazing projects, learn everything there is to know about building and launching products and starting companies, all without the painful early-startup salary.<p>We take an aggressive approach to learning and inspiration. Two weeks ago, our team spent an entire day visiting MIT's Media Lab, where we learned about biomechatronics, fluid interfaces, and more. Even though our primary tool is Rails, half of us just learned nodejs for a two-week 'sprint project'.<p>The lab started in February of this year, and now has five awesome developers (hailing from Columbia, ITP, NYC Resistor, and more). We're looking to fill position #6.<p>Show us your projects: we love to see an entrepreneurial streak and a diversity of experience.<p>Email me at rw@rwinslow.com if this appeals to you!","time":1317489996,"type":"comment"},{"by":"Mc_Big_G","id":3060474,"parent":3060221,"text":"San Francisco, CA<p>VerticalResponse is hiring for a lot of great positions:<p>* Ruby on Rails Developers<p>* Ruby on Rails Architect<p>* Director of Product Management<p>* Search Engine Marketing (SEM) Analyst<p>* Senior QA Automation Engineer<p>* Online Marketing Specialist<p>* Product Manager<p>* Director of Acquisition Marketing<p>* Senior Financial Analyst<p>* Customer Relations Specialist<p>VR is an established and successful, privately held company \nin SF for the last 10 years. We work with Rails 3, Git, JQuery, Rspec, backbone.js, Haml, Sass, TDD, pair programming, agile development and other leading technologies (you don't need to have experience with all of these). I've been working there as an engineer for 7 months now and really enjoy it.<p>Occasional work from home is allowed if you have an important appointment or need to keep germs out of the office. We have happy hour on Fridays and the fridge is stocked with a wide variety of beer, so we'll sometimes end the day with a cold brew while we finish pairing on a difficult problem.<p>Apply here: <a href=\"http://jobvite.com/m?3RB34fwj\" rel=\"nofollow\">http://jobvite.com/m?3RB34fwj</a>","time":1317489292,"type":"comment"},{"by":"derwiki","id":3061010,"parent":3060221,"text":"San Francisco, fulltime/internships/H1B\nCauses - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a>\nAt Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, open source contributions encouraged:\n<a href=\"https://github.com/causes/suggestomatic\" rel=\"nofollow\">https://github.com/causes/suggestomatic</a> -- item based collaborative filter\n<a href=\"https://github.com/causes/buffet\" rel=\"nofollow\">https://github.com/causes/buffet</a> -- distributed testing framework for Ruby\n<a href=\"https://github.com/causes/mock_redis\" rel=\"nofollow\">https://github.com/causes/mock_redis</a> -- mock redis Ruby gem\nApply through the site or adam@causes.com if interested!","time":1317500683,"type":"comment"},{"by":"bijanv","id":3060485,"parent":3060221,"text":"Toronto, Canada<p>EventMobi (<a href=\"http://www.eventmobi.com\" rel=\"nofollow\">http://www.eventmobi.com</a>) is growing it's development team and looking to add the few core members that will be crucial to our next stages as a startup.<p>We are the leading mobile platform for the largest and coolest shows and conferences. Clients like Disney, Crocs and Hyatt have used EventMobi to disrupt and enhance the attendee experience at their events. Have a look here at the type of candidate we are looking for: <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1991574\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1991574</a><p>And have a look here about our team: <a href=\"http://blog.eventmobi.com/eventmobi-is-growing/\" rel=\"nofollow\">http://blog.eventmobi.com/eventmobi-is-growing/</a><p>If being on the leading edge of mobile web is something that interests you, then let's chat! Send us an email at work@eventmobi.com","time":1317489486,"type":"comment"},{"by":"jparise","id":3061619,"parent":3060221,"text":"San Francisco, CA (SOMA) - Booyah!<p>We're a mobile games company that focuses on using real-world elements (e.g. location) as part of our entertainment experiences.  We're primarily focused on iOS development right now, but we have a lot of cross-platform (Android, Flash, Mac, PC, etc.) experience in-house as well.<p>We're the game studio that brought you MyTown, Early Bird, DJ Rivals, and Nightclub City.<p>We're current looking for gameplay engineers (<a href=\"http://www.booyah.com/jobs/?id=41\" rel=\"nofollow\">http://www.booyah.com/jobs/?id=41</a>) and a senior systems engineer (<a href=\"http://www.booyah.com/jobs/?id=37\" rel=\"nofollow\">http://www.booyah.com/jobs/?id=37</a>).<p>We're a Mac shop.  Our code lives in git.  Jenkins keeps us honest.  Engineers use whatever other tools they prefer.<p>We also have business, project management, and art openings: <a href=\"http://www.booyah.com/jobs/\" rel=\"nofollow\">http://www.booyah.com/jobs/</a>","time":1317515537,"type":"comment"},{"by":"cliftonk","id":3060922,"parent":3060221,"text":"Dallas, TX - OrgSync - <a href=\"http://www.orgsync.com/careers\" rel=\"nofollow\">http://www.orgsync.com/careers</a><p>We were founded in 2007, have over 200 universities as clients and are growing rapidly to reach our goal of working with the 4,000+ colleges and universities across the United States and Canada. In the future, we will also be entering other markets that can utilize our dynamic and evolving product. We have an exciting and relaxed corporate culture that values team members' contributions and dedication. Come be a part of our growth.<p>Most of our code is written in Ruby and runs on the Rails stack backed by a MySQL database, but we also incorporate other technologies such as Node.js, Memcached and Redis. We use GitHub for version control and our infrastructure is entirely hosted via cloud services.<p>We're hiring:\n- Ruby Developers\n- Front-end Developer\n- Operations Engineer","time":1317498549,"type":"comment"},{"by":"shosui","id":3061738,"parent":3060221,"text":"Boston - Harvard School of Public Health<p>The Hide Lab at the Harvard School of Public Health is looking for an enthusiastic and talented software developer to join our team. We are building an integrated system to store, manage and analyze stem cell data. This is a great opportunity to be involved in cutting edge stem cell research and the open source bioinformatics community.<p>The project uses the Galaxy software framework (<a href=\"http://galaxy.psu.edu/\" rel=\"nofollow\">http://galaxy.psu.edu/</a>) for storing, analyzing, visualizing and sharing genomic data. Galaxy is primarily implemented in Python and makes substantial use of JavaScript for its web-based interface.<p>Interested? See <a href=\"http://www.researchgate.net/job/26994_Bioinformatics_Software_Developer\" rel=\"nofollow\">http://www.researchgate.net/job/26994_Bioinformatics_Softwar...</a> for the complete job description.","time":1317519243,"type":"comment"},{"by":"nwilkens","id":3060383,"parent":3060221,"text":"Monroe MI, or Orlando FL<p>Senior Linux System Administrator<p>We are a small, growing team of expert Linux admins and are looking to bring on our next team member. We work on exciting projects and provide 24×7 monitoring services for our customers.<p>More detail available at <a href=\"http://www.mnxsolutions.com/jobs\" rel=\"nofollow\">http://www.mnxsolutions.com/jobs</a>","time":1317487667,"type":"comment"},{"by":"ladylexy","id":3062435,"parent":3060221,"text":"San Francisco - Foodspotting<p>★ 3 Ruby on Rails Developers (Frontend, Backend &#38; Server Ops Focused)<p>★ 1 UX-Minded iOS Developer<p>Foodspotting is the first and leading mobile app for finding and rating dishes. We're looking for developers who have what it takes to transform Foodspotting from a visual local guide into the \"Pandora for Food.\" As part of a small development team (currently 3 people), you’ll have the opportunity to shape a product and business model from its earliest days -- while eating a lot of great food along the way!<p>You can learn more &#38; apply with one click at:<p>Rails: <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1991095\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1991095</a><p>iOS: <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1991581\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1991581</a><p><a href=\"http://foodspotting.com\" rel=\"nofollow\">http://foodspotting.com</a>","time":1317546893,"type":"comment"},{"by":"geophile","id":3060821,"parent":3060221,"text":"Boston MA - Akiban: <a href=\"http://akiban.com\" rel=\"nofollow\">http://akiban.com</a><p>We're building an open source SQL database system from the ground up, with a radically different approach to storage (not rows, not columns). We're hiring in two areas:<p>- Testing: Build out infrastructure (Python), contribute to system test plan, help write the tests. We're currently using Jenkins and Launchpad, and we're looking for someone to help bring in additional frameworks for testing, or build what's necessary.<p>- Field engineer: We have already located customers who have problems that our technology will solve. The role involves understanding customer schemas and queries, setting them up with our technology, integrate with the customer's systems, and support the customer as they use our products.<p>Check our website for more information on the product, our technology, and details on these positions.","time":1317496036,"type":"comment"},{"by":"bobbyi","id":3060492,"parent":3060221,"text":"San Francisco, CA<p>Affine Systems generates data about online video using computer vision (face recognition, product recognition, scene classification, etc.) for advertisers to use in targeting and filtering their online video campaigns.<p>We did over a million dollars in revenue last year working on campaigns for major brands. We recently raised our B round, led by Crosslink Capital, the investors behind Pandora.<p>We are looking for test-driven engineers to work on an internet-scale video processing pipeline using Python, MySQL, Hadoop, Selenium, ffmpeg and other open source tools. Its goal is to find and ingest videos from web pages and to generate and store metadata about those videos using our vision algorithms written in C++.<p>Please no remote hires. You must be able to work alongside us at our office in San Francisco five days a week.<p>If interested, please contact me (founder/ CTO) at bobby@affinesystems.com<p>Thanks.","time":1317489607,"type":"comment"},{"by":"jwegan","id":3060587,"parent":3060221,"text":"Palo Alto, CA<p>(H1B welcome)<p>Shopkick - <a href=\"http://www.shopkick.com/jobs.html\" rel=\"nofollow\">http://www.shopkick.com/jobs.html</a><p>Shopkick is a startup looking to use mobile to transform retail shopping. Macy's, Best Buy, Target, and Proctor and Gamble are just a few of our partners. We are backed with $20 million in funding from Kleiner Perkins and Greylock Partners. We're still small, but we are growing fast.<p>Here is a recent tech crunch article on us: <a href=\"http://techcrunch.com/2011/09/27/shopkick-by-the-numbers-700m-product-views-7m-product-scans-in-the-past-year-2-3m-users/\" rel=\"nofollow\">http://techcrunch.com/2011/09/27/shopkick-by-the-numbers-700...</a><p>A few of the positions we are hiring for:<p>* Mobile developers (iOS &#38; Android)<p>* Server side developers<p>* User experience designer<p>* Marketing, Customer Service, &#38; more<p>Go to <a href=\"http://www.shopkick.com/jobs.html\" rel=\"nofollow\">http://www.shopkick.com/jobs.html</a> for more details and to apply online.","time":1317491452,"type":"comment"},{"by":"rexreed","id":3061214,"parent":3060221,"text":"Baltimore, MD - Bizelo (<a href=\"http://www.bizelo.com\" rel=\"nofollow\">http://www.bizelo.com</a>)<p>An awesome platform for small-business SaaS apps<p>FULL TIME, CONTRACT, INTERN -- all ok! We do prefer local, but super-highly skilled remote folks are welcome as well.\nSolid PHP, MySQL, MVC/OOP skills wanted / needed!<p>Drop us a note  at team [at] bizelo.com","time":1317505813,"type":"comment"},{"by":"siddharthjoshi","id":3089944,"parent":3060221,"text":"My team at Amazon.com (Customer Service Technology) is hiring SDEs!<p>We are a small team of 7 engineers, but we each develop systems from the ground up, straight from DB design to front-end UI. We deploy new features almost every day.<p>We mostly have Java, with a sprinkling of C++ in our services and use the Perl/Mason framework for our web apps and Dojo/JQuery for Javascript.<p>As the team is moving into exciting new projects (machine learning, schedule optimization etc), I encourage you to come join us and be a part of the next generation of Customer Service Technology.<p>Here is the official posting and how to apply:\n<a href=\"http://www.amazon.com/gp/jobs/129914/ref=j_sr_2_t?ie=UTF8&#38;category=Software%20Development&#38;location=*&#38;keywords=customer%20service&#38;page=1\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/129914/ref=j_sr_2_t?ie=UTF8&#3...</a><p>(Seattle + H1B OK)","time":1318146392,"type":"comment"},{"by":"gavanwoolery","id":3061628,"parent":3060221,"text":"REMOTE, but must live in the US.\nAppstem Media, LLC (I am the CTO) - \n<a href=\"http://www.appstem.com\" rel=\"nofollow\">http://www.appstem.com</a><p>Contract, intern, and salary positions available.  We are a small but rapidly growing and profitable mobile application company.  Work from home, semi-flexible hours.  Referral bonuses for any successful contract leads.  Developers only, CS Degree OR relevant experience required.  We develop for iPhone and Android using native SDKs and platforms like Appcelerator Titanium, PhoneGap, Sencha Touch, and HTML 5.  Other development experience is a bonus.  We have developed for top-tier clients, including Kaiser Permanente, Genentech, Jiffy Lube, Gold's Gym, Lion's Gate Entertainment, and Caesar's Entertainment (owner of Caesar's Palace in Las Vegas and other venues).","time":1317515690,"type":"comment"},{"by":"dget","id":3064189,"parent":3060221,"text":"New York, NY<p>Coursekit (<a href=\"http://coursekit.com/\" rel=\"nofollow\">http://coursekit.com/</a>) is trying to bring social networking to education, and we want you to help build it.<p>We're looking for an engineer who is excited about joining a young team that's shaking up how education works. We always try using the best tool for the job. For now, we use CoffeeScript, Python, Node.js, Redis, as well as a still-unreleased CoffeeScript framework. If working with these technologies excites you, talk to us. We're very detail-focused, and are especially looking for someone who loves working with front-end code (heavy Javascript/Coffeescript, as well as HTML/CSS) to create beautiful interactions/pages.<p>Apply here: <a href=\"http://coursekit.com/jobs\" rel=\"nofollow\">http://coursekit.com/jobs</a><p>Or if you have any questions, shoot me an email at dan@coursekit.com","time":1317593266,"type":"comment"},{"by":"transmit101","id":3060839,"parent":3060221,"text":"London - Mixlr (<a href=\"http://mixlr.com\" rel=\"nofollow\">http://mixlr.com</a>)<p>Web Developer<p>Mixlr is a platform for broadcasting and listening to live audio. We launched less than a year ago, and have a large and fast-growing user base including some of the world’s top DJs and radio stations. We also have an interesting and scaleable backend architecture which involves not only Ruby but lashings of Java, C and C++, with heavy usage of Redis and MongoDB.<p>There's a full job posting here: <a href=\"http://devblog.mixlr.com/post/10237678024/web-developer\" rel=\"nofollow\">http://devblog.mixlr.com/post/10237678024/web-developer</a><p>If you're interested then drop me an email: rob [somehow] mixlr.com<p>(We're hiring a web designer too: <a href=\"http://devblog.mixlr.com/post/10240216505/web-designer\" rel=\"nofollow\">http://devblog.mixlr.com/post/10240216505/web-designer</a>)","time":1317496373,"type":"comment"},{"by":"_arpan_","id":3060723,"parent":3060221,"text":"Sunnyvale, Fulltime/Intern saavn.com<p>H1Bs ok<p>Software Engineers/ Test Engineers/ QA/ System Admin<p>We are a well funded bay area startup and the fastest growing digital media company offering South Asian content.\nWe have some very interesting problems that we are trying to solve. Some examples include large scale audio processing, massive scaling, interesting text processing, digital content delivery on various channel etc.\nOur engineering team is small and you will be having opportunity to make a really big impact on the way how people consume digital media.<p>The exact job posting is here <a href=\"http://startuply.com/Jobs/Senior_Software_Engineer_4089_2.aspx\" rel=\"nofollow\">http://startuply.com/Jobs/Senior_Software_Engineer_4089_2.as...</a><p>Let me know if you have any questions. e- arpan [ a t ] saavn [ dot ] com","time":1317494110,"type":"comment"},{"by":"emiranda","id":3060581,"parent":3060221,"text":"San Francisco Bay Area.<p>Looking for local developers: interns, contractors, and part-timers are welcome.<p>Miranda Bros. (www.mirandabros.com) is a game studio with a focus on mobile games. We are currently making games for Android, check out our first title at <a href=\"http://mirandabros.com/games/\" rel=\"nofollow\">http://mirandabros.com/games/</a>.<p>We are currently looking for the following...<p>- Flex/actionsript developers (big plus if you have experience with Flex Mobile projects and Flex 4.5)\n- Lua programmers, specially if you have experience with the Corona SDK\n- PR/Marketing, we are looking for someone to manage our twitter, facebook, website and make copy.<p>If interested please email us at jobs@mirandabros.com. Mention this thread, and also provide us with a resume and your work experiences.","time":1317491282,"type":"comment"},{"by":"benologist","id":3060362,"parent":3060221,"text":"Palermo, Buenos Aires<p>Playtomic is hiring Android and .NET developers.  This is a tiny team so preferably you'll have experience with a bunch of languages and be strong at a couple of them.<p>We work with a lot of languages, a lot of cool companies and developers, and at a big scale.<p>You can get me at ben at playtomic.","time":1317487202,"type":"comment"},{"by":"kloncks","id":3061069,"parent":3060221,"text":"San Francisco - Kout (Full-Time &#38; Interns welcome)<p><a href=\"http://www.kout.me\" rel=\"nofollow\">http://www.kout.me</a><p>Kout is part of the latest AngelPad class. We're VC-funded and looking to hire our first employee. Offering a real equity stake, competitive salary, and a chance to revolutionize eCommerce.<p>Kout is a decentralized eCommerce platform geared towards micro-merchants. Think of it as an eCommerce version of Square. We focus on simplicity and great design. We're also doing really cool things with payments, dynamic pricing, and deals. We have a few patents pending for our implementation/s.<p>Make no mistake, we're going to disrupt eCommerce. We'd love to do that with you; let's talk about the details.<p>Contact jobs@kout.me or email in my profile. Mention you're from HN :)","time":1317502095,"type":"comment"},{"by":"thomd","id":3061120,"parent":3060221,"text":"Cambridge and Brighton (UK) - Aptivate<p>We are a not-for-profit organisation who are passionate about using technology for social good. We build websites and tools to support organisations in the international development sector, and we are looking for smart software developers to join our team (particularly in Python/Django).<p>As well as writing code, we often work on the ground in developing countries on projects ranging from delivering technical training, to building and deploying resilient hardware systems for power and communications. Each team member has a voice in the strategy and policy of the organisation.<p>For details see <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1317503797,"type":"comment"},{"by":"MirRyan","id":3071875,"parent":3060221,"text":"New York City - ADstruc, Inc. (FE Developers &#38; Designer) H1B friendly<p>Why Work At ADstruc?\nAt ADstruc, we are incredibly passionate about and driven by solving big problems. The Outdoor Advertising Industry is a $6.1B business and operates completely offline. It’s the last remaining ad medium not operating on an online exchange. We are fixing that. ADstruc is building products that help companies buy and sell more efficiently. We are headquartered in a loft space in SOHO, offer competitive salaries, stock options and full benefits. Do you love solving problems and working in the startup environment? If so, come hang out with us.<p><a href=\"http://adstruc.com/jobs\" rel=\"nofollow\">http://adstruc.com/jobs</a>","time":1317748747,"type":"comment"},{"by":"rabedik","id":3060837,"parent":3060221,"text":"Software Engineer, San Francisco CA<p>OcuSpec is a venture backed start-up developing motion control technology that is radically more powerful and affordable than anything currently available. We're seeking smart, passionate people interested in challenging problems and changing the way people interact with machines.<p>Desired Skills/Experience: Software architecture, cross-platform APIs, C/C++, parallel processing (GPU/CPU), computer graphics (openGL/DirectX), real-time systems.<p>This is a great opportunity to work on and take ownership of bleeding edge technology at a early stage. We offer very competitive compensation, great benefits and an office near the Caltrain.<p><a href=\"http://www.ocuspec.com/\" rel=\"nofollow\">http://www.ocuspec.com/</a>","time":1317496349,"type":"comment"},{"by":"smadam9","id":3069962,"parent":3060221,"text":"Berlin, Germany - eKomi Ltd. (Full-Time)<p>eKomi is a leading provider of feedback management, primarily for web shops and services.\nOne of the reasons we’ve been so successfully so quickly in a relatively new field is that we strive to stay up-to-date and provide quality services for our customers empowering them to deliver quality to their customers as well.<p>We are looking for front- and back-end developers to join our growing development team.<p>A Variety of Tools We Use\n-PHP/MySql\n-jQuery, HTML, CSS\n-nginx, Apache, Varnish<p>The jobs are located in Berlin, Germany, and they are in-office positions.  We have a great team and are looking for the right people to further strengthen our team.  For job applicants, please email ramirez@ekomi.de","time":1317717598,"type":"comment"},{"by":"shopkeep","id":3061137,"parent":3060221,"text":"New York City - Full Time - <a href=\"http://ShopKeep.com\" rel=\"nofollow\">http://ShopKeep.com</a><p>Sharp developers on all levels are welcome to apply.  We are currently looking for people who love well written code irregardless of the language.  We are currently working Rails, Node.js, Java, iOs and Android.<p>We are modeling our development shop on the way github.com and fogcreek runs their shops.  Working at ShopKeep will greatly expand your skills because you will be working with some of the best developers in NYC.<p>To Apply send jasonrichelson a message on github.com.  We will look at your contributions to the open source community and get back to you.<p>No emails or calls please only messaging on github. We look forward to talking to you!<p>Jason","time":1317504274,"type":"comment"},{"by":"vyrotek","id":3060856,"parent":3060221,"text":"Provo, Utah - <a href=\"http://Eleutian.com\" rel=\"nofollow\">http://Eleutian.com</a> (<a href=\"http://jobsco.re/pPi8b8\" rel=\"nofollow\">http://jobsco.re/pPi8b8</a>)<p>Eleutian is building the next generation version of their eLearning platform. Eleutian is an international company which currently focuses on virtually teaching live classrooms in Korea, China and Japan.<p><i>Looking for: Sr .Net Developer - Full time, Market salary, Benefits, Stock options</i><p>The platform is built on .Net/C#, ASP.Net MVC 3, SQL Server 2008 and Windows Azure. Putting together a brand new team for this 'greenfield project'. You'll be working on our brand new platform with a small team where your experience and voice will count.","time":1317496848,"type":"comment"},{"by":"andrewhubbs","id":3060332,"parent":3060221,"text":"San Francisco, CA<p>Rally is changing the way fundraising works online.<p>We are hiring full stack web developers looking to make large individual contributions to a very small team. We have a RoR stack, practice TDD heavily and push code daily.<p>If you want to know more contact me at andrew@rally.org","time":1317486703,"type":"comment"},{"by":"dtsingletary","id":3060574,"kids":[3061106],"parent":3060221,"text":"San Francisco, CA (SOMA)\nKlout (<a href=\"http://www.klout.com\" rel=\"nofollow\">http://www.klout.com</a>) is looking for engineers, and lots of them.  \n<a href=\"http://klout.com/corp/careers\" rel=\"nofollow\">http://klout.com/corp/careers</a><p>We have lots of data and are growing wildly.  Great perks in the office, fun people, and lots of opportunities.<p>Klout consists of a team of scientists, engineers, thinkers and dreamers banded together to create a standard where one had never been before. We believe that every person who creates content has influence and our mission is to help individuals understand and leverage their influence.<p>tyler at klout dot com if you'd like to talk more","time":1317491202,"type":"comment"},{"by":"mchadwick","id":3061730,"parent":3060221,"text":"Philadelphia, PA<p>Vistar Media is company building some neat stuff in the \"Digital Out Of Home\" space. Right now, it's just us three founders -- two of which are coming from Invite Media, which was acquired by Google in 2010.<p>We're looking to make our first few engineering hires. Specifically, someone relatively experienced to work on our backend bidding and reporting infrastructure, and someone to focus on the webapp which customers interface with.<p>We have a recuriterbox page at <a href=\"http://vistarmedia.recuriterbox.com\" rel=\"nofollow\">http://vistarmedia.recuriterbox.com</a>, but feel free to contact me directly if you have questions, or would just like to know more.","time":1317518794,"type":"comment"},{"by":"tyrelb","id":3060419,"parent":3060221,"text":"Vancouver, BC:<p>Know Your Advisor is pioneering the way in which Canadian consumer’s research, find and engage with ‘trusted’ financial advisors while providing the definitive on-line platform and tools for the financial advisor community to showcase their capabilities and services.<p>We’re looking for a passionate and energetic Senior Designer / Front-End Developer to help take our product to the next level.<p><a href=\"http://www.techvibes.com/job/senior-designer-front-end-developer\" rel=\"nofollow\">http://www.techvibes.com/job/senior-designer-front-end-devel...</a><p>:)<p>We also have room for more back-end and front-end developers. If you're in the Vancouver area, please email me your interest to tburton@kya.ca.<p>Thanks!","time":1317488279,"type":"comment"},{"by":"mea36","id":3064124,"parent":3060221,"text":"Remote or Philly<p>Looking for a Django dev with front end experience and a good intuition for UX to work on small fixes and features. You should be comfortable with Django, jQuery, CSS, HTML and all that good stuff.<p>We are a marketing service for businesses utilizing QR codes and smartphones.\n<a href=\"http://www.youtube.com/watch?v=I6c1GuZqNHs\" rel=\"nofollow\">http://www.youtube.com/watch?v=I6c1GuZqNHs</a><p>Ideally we'd like a passionate individual who is genuinely interested in our project. The possibility for full-time employment by the end of the year exists, but if that's not your thing, no worries, we won't pressure you into it.<p>Contact me at mel [at] coupedout [dot] com.","time":1317591684,"type":"comment"},{"by":"speek","id":3060807,"parent":3060221,"text":"Boston, MA (Newbury St.)<p>At Zazu (<a href=\"http://getzazu.com\" rel=\"nofollow\">http://getzazu.com</a>), we're creating a ubiquitous information platform that tells you what you need to know before you need to know it -- we run on your mobile devices (and your TV and your coffee maker), monitoring your life to keep you well-informed and well-caffeinated.<p>We're looking for a Few Good Engineers to help us bring our dreams into reality. Right now, we're sitting on the cusp of connected devices, mobile, and big data -- so we've got lots of cool projects that we're working on.<p>Shoot me a message at marc@getzazu.com if you're interested in what we're working on.","time":1317495700,"type":"comment"},{"by":"tariq","id":3068112,"parent":3060221,"text":"Toronto, Canada; Kanetix - <a href=\"http://www.kanetix.ca\" rel=\"nofollow\">http://www.kanetix.ca</a><p>Looking for a developer with both front and back end skills who can get stuff done.<p>Our current web stack: linux, apache, perl, oracle sql, memcached, html/css/js).<p>Similar concept as www.leaky.com and www.coverhound.com, but for Canada and more established--recently acquired by a private equity firm. Offering competitive salary, incentive bonus, profit-sharing, health benefits, RRSP matching, free drinks, and a young and casual work environment.<p><pre><code>  more info: http://www.kanetix.ca/job-website-developer\n  email: kanetix_hr@kanetix.ca</code></pre>","time":1317676680,"type":"comment"},{"by":"srau","id":3063104,"parent":3060221,"text":"San Francisco, Salesforce.com<p>The Core Infrastructure team is looking for exceptional software engineers to with proven ability to design, develop, optimize, and reinvent the infrastructure of a large-scale cloud service.<p><a href=\"http://careers.force.com/jobs/apex/ts2__JobDetails?jobId=a1k7000000061DyAAI\" rel=\"nofollow\">http://careers.force.com/jobs/apex/ts2__JobDetails?jobId=a1k...</a>\n<a href=\"http://careers.force.com/jobs/apex/ts2__JobDetails?jobId=a1k7000000061GYAAY\" rel=\"nofollow\">http://careers.force.com/jobs/apex/ts2__JobDetails?jobId=a1k...</a><p>I would like to chat with you if you are interested. Email me srau@salesforce.com","time":1317570605,"type":"comment"},{"by":"breck","id":3060944,"parent":3060221,"text":"San Francisco, CA - Yuzu Inc. (YC Summer '09) is hiring:<p>- Software Engineers (Full time)<p>- Designers (Full time)<p>- Software Engineering Interns (Paid. Part to Full time)<p>- Design Interns (Paid. Part to Full time)<p>We are a team of 3 driven to create beautiful, simple, products and code that solve huge pains.<p>We love to learn and spend a lot of time reading, teaching and practicing our skill sets.<p>We are fluent in many programming languages and even create our own.<p>We are launching our first product within the next 6 months. It's neat.<p>If this sounds like an intriguing place to work, send an email to breck@yuzuinc.com.<p>If you don't consider yourself an absolute expert coder or designer--not a big deal--apply for an internship position.","time":1317499033,"type":"comment"},{"by":"kabir_h","id":3080596,"parent":3060221,"text":"Somerville, MA and London - The Echo Nest<p>Echo Nest is a music intelligence company that powers music apps with our API, and services like Echoprint, our open source music fingerprinter. Our data powers apps for the BBC and MTV and music services you've used. We've got a killer engineering culture, well-stocked beer fridge and you'll be able to shape the future of music.<p>Jobs:\nEngineer\nJunior Engineering Intern\nMusic Information Retrieval Scientist\nQA Manager\nSenior Engineer\nWeb Developer - London Office<p><a href=\"http://the.echonest.com/company/jobs/\" rel=\"nofollow\">http://the.echonest.com/company/jobs/</a>","time":1317917596,"type":"comment"},{"by":"bxf","id":3095671,"parent":3060221,"text":"Denver, CO - Ecocion, Inc.<p>We're in the environmental compliance business.<p>Seeking INTERN(s) to help with new web project. Legacy DB, everything on top of that is new development.<p>Primarily, we're looking for people who can take some initial guidance and use it to find the last 30/40/50% of the solution on their own. Some .NET exposure would be a big plus. Front-end experience (HTML, JS, CSS, etc.) also a big plus.<p>Internships are paid. Feel free to email me directly (see my HN profile). Full advert here (scroll to bottom):\n<a href=\"http://www.ecocion.com/careers\" rel=\"nofollow\">http://www.ecocion.com/careers</a>","time":1318278585,"type":"comment"},{"by":"mggolladay","id":3063846,"parent":3060221,"text":"Minneapolis, MN<p>Bloom Health is a two year old health care startup with around 50 employees (including 12 developers). Our offices are in downtown Minneapolis and are connected to the skyway.<p>We develop on macbook pros with external monitors, and deploy our solution on Amazon's EC2 platform. Smart and fun people drinking free soda and working with groovy and grails, redis, mysql, continuous integration, test coverage metrics, user stories, distributed version control, etc.<p>Come check us out at gobloomhealth.com and find out why \"Pensions : 401k :: Employer Provided Health Insurance : Bloom Health\"","time":1317585798,"type":"comment"},{"by":"alonzosnook","id":3076727,"parent":3060221,"text":"UK - London - Software Developer<p>We're looking to get some developers in at Revector.  We're a small firm who do services for mobile operators, so we do things with SMS, VoIP etc.  Primarily run with Python, with standard servers and databases, but we're doing things with Redis etc as well.  Solid existing products, and opportunities to be involved in some new opening right from the start.<p>I think the job post calls this a graduate position, but we'll happily consider people with more experience as well.<p><a href=\"http://www.revector.com/careers\" rel=\"nofollow\">http://www.revector.com/careers</a>","time":1317837252,"type":"comment"},{"by":"apaprocki","id":3061040,"parent":3060221,"text":"New York, NY - Bloomberg (Terminal)<p>We embed Javascript/LUA engines and use them to power the terminal, delivering complex data around the world 24/7. We're one of the largest (if not the largest) user of server-side JS in the world. Data is collected from every corner of the world and even generated in-house on GPU farms. We solve complex problems in novel ways. Looking for fellow hackers that want to make a difference in a start-up culture. We are the original NYC startup and as of right now are the #1 provider in job growth in NYC, period.<p>E-mail is in my profile.","time":1317501424,"type":"comment"},{"by":"tkiley","id":3060885,"parent":3060221,"text":"Nashville, TN or\nParksville (Vancouver Island), BC<p>InQuicker seeks a director of marketing. We're looking for a person who can coordinate our online and offline marketing efforts across the United States. We're looking for a person who is effective in online marketing analytics, PPC, SEO, copywriting, and managing agency relationships.<p>We're 100% bootstrapped, with 15 employees and millions in annual revenue right now.<p>Check out our website at <a href=\"http://www.inquicker.com/\" rel=\"nofollow\">http://www.inquicker.com/</a>. If you're interested, email me. My address is in my profile.","time":1317497506,"type":"comment"},{"by":"ttpva","id":3060348,"parent":3060221,"text":"Anywhere, Remote is OK<p>Talkdesk is hiring: <a href=\"http://talkdeskapp.com\" rel=\"nofollow\">http://talkdeskapp.com</a><p>Back-end developer and front-end developer.<p>We are not picky but we work mostly with Node.js, Rails, Backbone.js and MongoDB.<p>email to tiago @ tiagop.org","time":1317486958,"type":"comment"},{"by":"electic","id":3061923,"parent":3060221,"text":"<i></i>* Viralheat Social Media <i></i>*<p>Full-Time Ruby on Rails Developers<p><a href=\"http://jobs.viralheat.com/apply/VStldU/Ruby-On-Rails-Developer.html\" rel=\"nofollow\">http://jobs.viralheat.com/apply/VStldU/Ruby-On-Rails-Develop...</a><p>Full-Time Senior C++ Engineers<p><a href=\"http://jobs.viralheat.com/apply/Pg1hp8/Senior-Software-Engineer-C.html\" rel=\"nofollow\">http://jobs.viralheat.com/apply/Pg1hp8/Senior-Software-Engin...</a><p>Full-time iOS and Android Developers<p><a href=\"http://jobs.viralheat.com/apply/XsZ6uE/Senior-Mobile-Engineer-IOS-Android.html\" rel=\"nofollow\">http://jobs.viralheat.com/apply/XsZ6uE/Senior-Mobile-Enginee...</a>","time":1317525046,"type":"comment"},{"by":"adjohn","id":3060503,"parent":3060221,"text":"San Francisco, CA (SOMA) / Tokyo, Japan<p>Midokura is hiring: <a href=\"http://midokura.com/careers.html\" rel=\"nofollow\">http://midokura.com/careers.html</a><p>We are virtualizing the network and disrupting the industry.  We're a Japan started startup, now distributed across three cities (Tokyo, Barcelona, and San Francisco) and growing rapidly.<p>We're looking for a solid front-end engineer to lead and grow a team focused on making data beautiful and accessible.<p>We're also seeking some low level systems engineers with extensive networking knowledge who will join the core team.<p>Hit me up at adam At midokura.com","time":1317489750,"type":"comment"},{"by":"momoro","id":3060582,"parent":3060221,"text":"Boston / Cambridge, MA - FULL-TIME + INTERNS<p><a href=\"https://www.earthaid.net/\" rel=\"nofollow\">https://www.earthaid.net/</a><p>Earth Aid is building a tool to track energy use and help people use less. We're well funded and growing quickly.<p>Hiring:<p>-- UI Engineer<p>-- Product designer<p>-- Data engineer<p>mischa@earthaid.net","time":1317491350,"type":"comment"},{"by":"dh0913","id":3060628,"parent":3060221,"text":"A Small Orange is hiring Linux system administrators and support people. We're a web hosting company with about 40 people that prides itself on quality customer service and support.<p>All positions at A Small Orange are REMOTE, but if you're in the Research Triangle / Raleigh-Durham area, you are welcome to work from our office in downtown Durham.<p>All positions include competitive pay, insurance, 401k, a variety of other perks (free web hosting), and more.<p>Details can be found at <a href=\"http://jobs.asmallorange.com\" rel=\"nofollow\">http://jobs.asmallorange.com</a>.","time":1317492342,"type":"comment"},{"by":"petervandijck","id":3061139,"parent":3060221,"text":"Quebeq, Canada. Full-time.<p>Gush - <a href=\"http://getgush.com\" rel=\"nofollow\">http://getgush.com</a> We are hiring a bunch of people. We use Scala and Play, and are building a large-scale consumer photo service. We launched last week in private beta.<p>Looking specifically for you if you can do ops like crazy (AWS in your dreams), if you're great at Scala, if you're awesome at CSS + design, or any combination. Also looking for a native Windows developer, and iOS/mobile experience is also always welcome.<p>Get it touch at jobs@gushhq.com. Show us what you've done.","time":1317504288,"type":"comment"},{"by":"kurumo","id":3060460,"kids":[3071935],"parent":3060221,"text":"New York, NY; Skillman, NJ; London, UK; other locations.<p>Bloomberg is hiring, Intern, H1B candidates are welcome.<p><a href=\"http://careers.bloomberg.com/hire/internsearch.html\" rel=\"nofollow\">http://careers.bloomberg.com/hire/internsearch.html</a><p><a href=\"http://careers.bloomberg.com/hire/experiencesearch.html\" rel=\"nofollow\">http://careers.bloomberg.com/hire/experiencesearch.html</a><p>C++, Java, .NET developer positions are available, as well as network engineers, UI designers, sysadmins, etc. Lots of real time and low latency infrastructure work, generally financial domain.","time":1317488955,"type":"comment"},{"by":"shedd","id":3061373,"parent":3060221,"text":"Dublin, Ireland -- BetDash.com -- Ruby on Rails dev &#38; Front-end dev<p>If you're looking for all the great perks of a startup plus the advantages of being within a large company, please check us out and say hello.  We're a startup that was recently acquired by Paddy Power and we're continuing to operate as a standalone business unit within the larger organization.  We're taking sports betting social and having a blast doing it.<p>Rails, Ruby, Redis, Sencha Touch, git<p>More info: <a href=\"http://workwithpaddy.com/\" rel=\"nofollow\">http://workwithpaddy.com/</a>","time":1317509410,"type":"comment"},{"by":"jasonlbaptiste","id":3062182,"parent":3060221,"text":"Onswipe - NYC<p>Engineers can work anywhere they choose, but they should choose somewhere with hard problems.  We reach one of the largest audience of iPad readers in the world and have worked with publishers like the New York Times and Slate.  Come push the boundaries of what's possible in the browser.<p>We're hiring for two main tech positions:<p>Backend - Mongo + Node\nFrontend - Javascript in a touch environment.  Come work on Swipecore, our JS framework for touch interactions.<p>Linky:  <a href=\"http://blog.onswipe.com/jobs\" rel=\"nofollow\">http://blog.onswipe.com/jobs</a>","time":1317535013,"type":"comment"},{"deleted":true,"id":3060343,"parent":3060221,"time":1317486895,"type":"comment"},{"by":"jb_anypresence","id":3098789,"parent":3060221,"text":"Reston/Sterling, VA - AnyPresence (<a href=\"http://anypresence.com\" rel=\"nofollow\">http://anypresence.com</a>)<p>We're a small venture-backed enterprise mobile application startup. The founders' previous venture had a successful exit.<p>We're currently using Ruby, Rails, Coffeescript, Mongo, and a whole lot more. We're big fans of testing too. If you're in the DC area, interested in startups, and have some ruby experience we'd love to hear from you.<p>Email a little bit about yourself and your resume to jbozek@anypresence.com if you are interested.","time":1318344825,"type":"comment"},{"by":"squirrel1024","id":3061271,"parent":3060221,"text":"Redwood City, CA - Nimsoft<p>We have a great mix of the startup atmosphere and the stability and benefits of a large enterprise.  If working with closures and prototypes is second nature to you, and you get excited about tools like coffeescript, backbone.js, scss, websockets, etc...then we would love to talk to you.  Java experience on the back-end is a huge plus, and we also have several Java-centric positions on our API and middleware teams.<p>Send the resume and/or any sample work to stanislav dot mitranic at nimsoft dot com.<p>P.S. H1B welcome.","time":1317507107,"type":"comment"},{"by":"softwaregravy","id":3060599,"parent":3060221,"text":"Los Angeles, CA<p><a href=\"http://www.thinknear.com\" rel=\"nofollow\">http://www.thinknear.com</a> ThinkNear is redefining how local merchants reach and attract customers and advertise on Mobile.  We're funded by IA Ventures, Google Ventures, Qualcomm, and more.<p>We're super early stage, so you'll have the opportunity to do everything and own large chunks of our technology and product.<p>Right now, we're looking specifically for a mid-level Rails engineer.<p><a href=\"http://thinknear.jobscore.com/list\" rel=\"nofollow\">http://thinknear.jobscore.com/list</a>","time":1317491678,"type":"comment"},{"by":"justinxreese","id":3060388,"parent":3060221,"text":"Durham, NC<p>Automated Insights, formerly known as StatSheet, is looking for these positions:<p>- Ruby Developer<p>- UI Designer<p>- Part Time Web Content Editor<p>Read more : <a href=\"http://automatedinsights.com/careers\" rel=\"nofollow\">http://automatedinsights.com/careers</a>","time":1317487724,"type":"comment"},{"by":"epall","id":3060606,"parent":3060221,"text":"Hayes Valley, San Francisco, CA<p>(winter interns welcome)<p>2bkco - <a href=\"http://2bkco.com/\" rel=\"nofollow\">http://2bkco.com/</a><p>We're a small team looking to bring on a designer/developer to help perfect our pre-launch social product. We love participatory media, social media, the things that people create. We love connecting people all over the world. We want to build something meaningful. Founded by Caterina Fake, of Flickr and Hunch, we're well funded and growing carefully.<p>If you're interested, get in touch with us at jobs@2bkco.com!","time":1317491768,"type":"comment"},{"by":"kordless","id":3060603,"parent":3060221,"text":"San Francisco, Downtown - JavaScript Software Engineer<p><a href=\"http://logg.ly/jobs\" rel=\"nofollow\">http://logg.ly/jobs</a><p>Do you love logs?  Loggly has over 1,000 deployed users and a ton of cool partners including Heroku, EY, and Amazon.<p>If you are looking for a challenge and are sick and tired of working on the same old web technologies, look no further.  We're building a massively scalable time series search and processing engine which we'll use to heat up servers in the kitchen so we can cook bacon on them.","time":1317491710,"type":"comment"},{"by":"abreckle","id":3067035,"parent":3060221,"text":"Visual.ly is a funded startup hiring full-time developers in San Francisco, CA<p><a href=\"http://visual.ly\" rel=\"nofollow\">http://visual.ly</a><p>We are building a next generation data visualization platform and are looking for front-end and full-stack developers with demonstrated expertise in all or many of the following to round out our engineering team. 5+ years javascript, we use Backbone.js, jQuery, HTML5 and SVG.<p><a href=\"http://visual.ly/about/jobs/\" rel=\"nofollow\">http://visual.ly/about/jobs/</a>","time":1317660435,"type":"comment"},{"by":"dmaincrash","id":3060319,"parent":3060221,"text":"Northern Virginia On-Site Full Time<p>Simulation services company seeking C++ developers for 3D / 2D visualization, first order physics and statistical sensor modeling, UI and application integration, and distributed computing. Fast moving environment where a small group of developers are responsible for design, development, QA, and technical support. In business since 1995, with continuous growth since and a current backlog. Reach us at careers@kinex.com.","time":1317486525,"type":"comment"},{"by":"nmb","id":3062401,"kids":[3095806],"parent":3060221,"text":"San Francisco - Lookout Mobile Security<p>Full-time or intern<p>Lookout is the leader in consumer mobile security. We're a small, well-funded team tackling big problems on small devices. We're hiring across the board; go here to get a sense of some available positions: <a href=\"https://www.mylookout.com/about/careers\" rel=\"nofollow\">https://www.mylookout.com/about/careers</a><p>Experience in Rails, iOS, Android, and/or network or mobile security are awesome to have, but not required.<p>nbhat@mylookout.com","time":1317545423,"type":"comment"},{"by":"nixme","id":3060989,"parent":3060221,"text":"San Francisco, CA - Do (<a href=\"http://do.com\" rel=\"nofollow\">http://do.com</a>)<p>We're a small team of developers and designers working to build great tools for small businesses.<p>We're hiring developers and designers at any level for backend + frontend web, and mobile (iOS and Android).<p>Tech: Ruby. Lots of Javascript/Coffeescript. Backbone. PostgreSQL, Redis, Solr. iOS. Android.<p>And we're a Salesforce company. Solid funding, great benefits, competitive comp.<p>I'd love to chat if you're interested - gopal@do.com","time":1317500112,"type":"comment"},{"by":"burnto","id":3061300,"parent":3060221,"text":"San Francisco, CA<p>Wanted: talented engineering colleagues at card.io - <a href=\"https://www.card.io/\" rel=\"nofollow\">https://www.card.io/</a><p>We are a well-funded mobile payments start-up. We are building software to enable simple, low-friction transactions on mobile devices.<p>We offer interesting and challenging problems, real work/life balance, and generous compensation, benefits, and vacation.<p><a href=\"https://gist.github.com/821454/\" rel=\"nofollow\">https://gist.github.com/821454/</a>","time":1317507623,"type":"comment"},{"by":"heyjonboy","id":3061260,"parent":3060221,"text":"Chicago, IL - ParkWhiz (<a href=\"http://www.parkwhiz.com\" rel=\"nofollow\">http://www.parkwhiz.com</a>)<p>We're looking for back end developer who wants to join a small team and have a big impact. We work mainly in the LAMP stack, and offer a competitive salary, benefits, and stock options.<p>More info is available at <a href=\"http://www.parkwhiz.com/about/jobs/backend-developer/\" rel=\"nofollow\">http://www.parkwhiz.com/about/jobs/backend-developer/</a>","time":1317506838,"type":"comment"},{"by":"vibhavs","id":3060338,"kids":[3060494],"parent":3060221,"text":"Mountain View, CA<p>Maginatics Inc. is hiring: <a href=\"http://maginatics.com/jobs.html\" rel=\"nofollow\">http://maginatics.com/jobs.html</a><p>We are currently in stealth but looking for smart, hands-on developers with a strong background in algorithms, distributed systems, storage systems, security, and Infrastructure-as-a-Service (IaaS) systems. If this sounds like it's up your alley, we would love to hear from you at\njobs@maginatics.com.","time":1317486800,"type":"comment"},{"by":"oonny","id":3060403,"parent":3060221,"text":"New York, NY - Full Time. \nTouchstorm - We distribute video and are the leaders in editorial videos. We are looking for a Sr. PHP web application developer. More details here: \n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=2020244\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=2020244</a>\n<a href=\"http://www.touchstorm.com\" rel=\"nofollow\">http://www.touchstorm.com</a>","time":1317488045,"type":"comment"},{"by":"blored","id":3108433,"parent":3060221,"text":"Dogbook and Catbook (Toronto, Ontario) is looking for a quick learning Developer.  PHP, MySQL, HTML, CSS, JSS.  Our team is small and we like to move quickly.  For more info check out:<p><a href=\"http://www.meshjobs.com/job/web-developer-toronto-on-canada-40-poolhouse-enterprises-6108717467/\" rel=\"nofollow\">http://www.meshjobs.com/job/web-developer-toronto-on-canada-...</a><p>$500 referral rewards for helping us find someone.","time":1318534190,"type":"comment"},{"by":"rmorrison","id":3061708,"kids":[3063428],"parent":3060221,"text":"Palo Alto - Comprehend Systems (YC W11)<p>Hiring Java developers (both frontend and backend). Help us make next-generation, cross-datasource reporting and visualization software. You'll also be writing software to improve people's lives, since our first product helps bring new cures and treatments to market faster.<p>to learn more: <a href=\"http://www.comprehend.com/careers\" rel=\"nofollow\">http://www.comprehend.com/careers</a>","time":1317518068,"type":"comment"},{"by":"kunalmodi","id":3062393,"parent":3060221,"text":"San Francisco - Thirst<p>We are a well funded startup based in San Francisco transforming how people interact with and learn from social media with a strong emphasis on NLP and machine learning. We are looking for excellent engineers with strong experience in NLP, Rails, or mobile development.<p>If you are interested in interning or working full time (you will be employee #1), email us at jobs@usethirst.com","time":1317544892,"type":"comment"},{"by":"sx","id":3060737,"parent":3060221,"text":"Mountain View, CA\nPattern Insight (<a href=\"http://patterninsight.com\" rel=\"nofollow\">http://patterninsight.com</a>). We are profitable and growing fast. Customers are some of the biggest technology companies<p>* Full time Software Engineers (H1B as well)<p>* Interns (paid)<p>* Sales Engineers<p><a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a> email: jobs@patterninsight.com","time":1317494314,"type":"comment"},{"by":"bobhaigler","id":3060420,"parent":3060221,"text":"San Francisco, CA<p>1life Healthcare / One Medical Group  -  <a href=\"http://onemedical.com\" rel=\"nofollow\">http://onemedical.com</a><p>We're a startup healthcare company with practices in SF, NY, Washington DC.<p>Looking to add to our software development team.  Some REMOTE work is ok, but we meet in SF weekly (Bay Area based team).  Looking for Rails / Javascript / CSS developers, iOS and Android a plus.<p>mail me at bhaigler@1life.com","time":1317488285,"type":"comment"},{"by":"gnubardt","id":3060339,"kids":[3060509],"parent":3060221,"text":"Cambridge MA &#38;  Seattle WA\nBrightcove - brightcove.com/careers<p>We're an online video platform (the second largest source of video traffic after youtube) looking to hire DevOps &#38; QA engineers, as well as product managers.<p>We're large enough to face cool scaling problems but still feel like a startup.<p>Send me an email if you've any questions (in profile or sneubardt@brightcove), i'm a software engineer and love it!<p>INTERN","time":1317486860,"type":"comment"},{"by":"nelken","id":3061634,"parent":3060221,"text":"Cambridge, MA -- Outbrain<p>Outbrain is a startup providing content recommendations for many premium publisher sites and blogs. We're looking for an engineer with strong Java skills and background in ML to help develop the algorithms behind our recommendations. \n<a href=\"http://www.outbrain.com/jobs/BO#1\" rel=\"nofollow\">http://www.outbrain.com/jobs/BO#1</a>\njobs@outbrain.com","time":1317515788,"type":"comment"},{"by":"lukas","id":3060641,"parent":3060221,"text":"We're hiring lots of positions at crowdflower.  We've built the largest crowd sourced workforce and are growing quickly (team, revenue, etc.).  We're based out of the mission in San Francisco but we can do remote in some cases and h1b is no problem.  We also love interns.  Most critical positions are full-stack ruby engineer and dev ops.<p>Email me at lukas@crowdflower.com.","time":1317492636,"type":"comment"},{"by":"senith","id":3060427,"kids":[3063467],"parent":3060221,"text":"<a href=\"http://graduatetutor.com/\" rel=\"nofollow\">http://graduatetutor.com/</a> - INTERN, REMOTE (PART TIME/FREELANCE)<p>We are looking to develop a widget that can be placed on partner websites. We want to provide online tutoring assistance through the widget. Developer must evaluate the best language after understanding and researching the partner technologies used.","time":1317488432,"type":"comment"},{"by":"jackfoxy","id":3061055,"parent":3060221,"text":"San Francisco<p>VP Engineering<p>Mad River Entertainment has an alpha site and a couple of rounds of focus groups behind it, soon to be in beta. You will take over the team of 2 LAMP techies and build it out. Looking for that rare combination of leadership and tech ability.<p>Competitive early stage salary plus early stage stock options. This is my bro's company. It is for real. jobs@madriverent.com","time":1317501762,"type":"comment"},{"by":"Stealx","id":3091928,"parent":3060221,"text":"Chicago, IL - Rockstar Front &#38; Backend Developer -  TrainSignal<p>Want To Move to Chicago? Moving costs &#38; bonus!\n10 year old company, 4 years in a row on Inc. 5000 list and profitable year over year!<p>Have front-end skills with backend experience? A variety of tools we use -PHP/MySql -jQuery, HTML, CSS -nginx &#38; Apache<p>Highly competitive salary &#38; benefits.<p>iman@trainsignal.com for more info","time":1318210981,"type":"comment"},{"by":"hybridsoul5","id":3060465,"parent":3060221,"text":"Boston, MA Wayfair (formerly CSN stores)<p>Our mission is to make Wayfair your favorite place online to buy anything for your home.The company is expanding rapidly and we just took in $165 mil in funding. We have a lot of positions open.<p><a href=\"http://www.wayfair.com/careers#dept=engineering\" rel=\"nofollow\">http://www.wayfair.com/careers#dept=engineering</a>","time":1317489093,"type":"comment"},{"by":"colinhowe","id":3069725,"parent":3060221,"text":"London - Conversocial<p>We make a SaaS platform that helps companies do a better job of customer service and marketing on Facebook and Twitter (and other social networks soon)<p>We're looking for someone to automate breaking what we make and tell us we're rubbish :)<p><a href=\"http://www.conversocial.com/jobs#testing\" rel=\"nofollow\">http://www.conversocial.com/jobs#testing</a>","time":1317711328,"type":"comment"},{"by":"drobertduke","id":3060950,"parent":3060221,"text":"Palo Alto, CA - Box.net<p>We are building the next generation of enterprise collaboration software and growing quickly.  Hiring all positions.<p><a href=\"http://box.net/company/careers/\" rel=\"nofollow\">http://box.net/company/careers/</a>\n<a href=\"http://www.crunchbase.com/company/box-net\" rel=\"nofollow\">http://www.crunchbase.com/company/box-net</a>","time":1317499148,"type":"comment"},{"by":"timharding","id":3062381,"parent":3060221,"text":"London, UK - Product/Marketing Manager, Well Informed Ltd.<p>Come and work directly with the founders running the business side our successful, profitable, SaaS business.<p><a href=\"http://blog.theorytestpro.co.uk/2011/08/01/were-hiring-online-marketing-producer/\" rel=\"nofollow\">http://blog.theorytestpro.co.uk/2011/08/01/were-hiring-onlin...</a>","time":1317544484,"type":"comment"},{"by":"benradler","id":3109605,"parent":3060221,"text":"REMOTE Freelance Website Designers (Front-end).  Have a good sized project that start right away.  Must be able to create design comps/mocks, and convert them to fluid HTML/CSS with valid markup.<p>Plus points if you live in San Francisco.<p>Please contact me here: <a href=\"http://bit.ly/rjHiui\" rel=\"nofollow\">http://bit.ly/rjHiui</a>","time":1318557715,"type":"comment"},{"by":"martian","id":3060571,"parent":3060221,"text":"San Francisco - Software Engineer<p>Thumbtack.com is an marketplace startup that connects people with local service professionals.<p>Great team, well-backed, offices in SOMA, a personal chef who cooks daily meals for us.<p>Learn more at <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Or email chris at thumbtack for more info.<p>[edited with contact info]","time":1317491128,"type":"comment"},{"by":"jaxn","id":3060546,"parent":3060221,"text":"Remote (Full or Part Time)<p>Bizen.com is looking for sales professionals / account managers.<p>We make intelligence simple for restaurants and franchises. While we are a new company, our product has been very well received by our initial customers; we believe we have a good product/market fit.<p>If you would like to know more, email me at jackson@bizen.com","time":1317490566,"type":"comment"},{"by":"ashbrahma","id":3060478,"parent":3060221,"text":"H1-B - Kansas City -<p>Social Mobile Apps Company - <a href=\"http://www.OneLouder.com\" rel=\"nofollow\">http://www.OneLouder.com</a> - 5 Million users across our Mobile apps.<p>Looking for the following: \n-Interested in being an iOS developer\n-UI/UX Designer with web development skills<p>No remote. If interested, contact me @ ashwins at handmark dot com","time":1317489362,"type":"comment"},{"by":"tedroden","id":3061065,"parent":3060221,"text":"Fancy Hands. We're hiring Python Devs in NYC, Marketing folks, and QA/Support/Community Managers. All positions are full time and on site in NYC.<p>Some good positions for folks who aren't on HN too, so please forward along to friends.<p><a href=\"http://www.fancyhands.com/jobs\" rel=\"nofollow\">http://www.fancyhands.com/jobs</a>","time":1317502042,"type":"comment"},{"by":"apgwoz","id":3061496,"parent":3060221,"text":"New York City - Meetup<p>We're looking for mobile devs (iOS and Android) as well as backend and front end engineers. For more information: <a href=\"http://www.meetup.com/jobs\" rel=\"nofollow\">http://www.meetup.com/jobs</a> or contact me directly andrew@meetup.com<p>Meetup is growing, profitable and a great place to work.","time":1317512844,"type":"comment"},{"by":"gambeht","id":3060674,"parent":3060221,"text":"REMOTE (San Francisco)<p>PlayCoMO - <a href=\"http://itunes.apple.com/us/app/pet-fair/id429367771?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/pet-fair/id429367771?mt=8</a><p>We're a fast growing mobile gaming company looking for talented people to join our team.<p>User Acquisition Analyst<p>C++ Game Engineer<p>Data Analyst/Scientist<p>Data Engineer<p>Server Engineer<p>Interns (all positions)<p>To apply, email: jobs [at] playcomo [dot] com","time":1317493233,"type":"comment"},{"by":"jrosenblatt","id":3069497,"parent":3060221,"text":"Yale-based Food Ordering Platform hiring part-time awesome programmers for free sandwiches and money.\nWe have already launched and are making money but are improving and expanding.<p>Seeking good people with experience in django and/or javascript+frontend development.<p>Email judd@aya.yale.edu for more info","time":1317705341,"type":"comment"},{"by":"l_adams","id":3061627,"parent":3060221,"text":"Chicago - Narrative Science<p>Hiring VP of Eng, python developers, great writers.  See <a href=\"http://www.narrativescience.com/careers.html\" rel=\"nofollow\">http://www.narrativescience.com/careers.html</a> for details.<p>Also looking for engineering interns.<p>Must be in Chicago or willing to move here.","time":1317515641,"type":"comment"},{"by":"psota","id":3060482,"parent":3060221,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers -- UI/UX, frontend, backend data mining/algorithms. See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1317489451,"type":"comment"},{"by":"grandalf","id":3060870,"parent":3060221,"text":"The company where I work is hiring.  I'll spare you the marketing copy. The team is great. Office in the mission district in SF.  Great pay too fwiw.  email me at mmmurf at gmail if interested.  stop by and meet us and read our code.","time":1317497120,"type":"comment"},{"by":"arram","id":3060930,"parent":3060221,"text":"San Francisco, CA - ZeroCater.com<p>We make it easy for companies to feed their people. Think Pandora for food. We're hiring developers, outside sales people, and a visual designer.<p><a href=\"http://www.zerocater.com/jobs\" rel=\"nofollow\">http://www.zerocater.com/jobs</a>","time":1317498731,"type":"comment"},{"by":"modoc","id":3060665,"kids":[3087985],"parent":3060221,"text":"Boston, MA<p>#1 - Paid Intern/Co-Op<p>* Marketing/Biz Dev/Sales part-time<p>* Write blog posts, white papers, researching leads and competitors<p>* Fortune 1000 B2B sales and biz dev<p>#2 - Full time salary + benifiets<p>* JBoss/Linux support/developer<p>* ATG or similar IOC experience desired.<p>* Mix of handling support issues, doing development, etc...<p>Ping me:  devon@sparkred.com with any questions!","time":1317493029,"type":"comment"},{"by":"inovica","id":3060633,"parent":3060221,"text":"Remote or UK (Newcastle or St. Albans offices) - Front End Developer<p><a href=\"http://www.inovica.com/blog-job-opportunity-front-end-developer-post-67-1.html\" rel=\"nofollow\">http://www.inovica.com/blog-job-opportunity-front-end-develo...</a>","time":1317492455,"type":"comment"},{"by":"kitko","id":3066830,"parent":3060221,"text":"San Francisco- Wikia is Hiring!\nFull Time\nPositions:  Sr. Front-End Engineer (JavaScript) and Med/Sr. Web Application Engineer (LAMP).\n<a href=\"http://www.wikia.com/Hiring\" rel=\"nofollow\">http://www.wikia.com/Hiring</a>","time":1317658397,"type":"comment"},{"by":"steilpass","id":3060287,"parent":3060221,"text":"Cologne, Germany<p>At Adcloud we do some awesome high performance web work with our adservers and we need help from great software developers: <a href=\"http://adcloud.com/de/dev/\" rel=\"nofollow\">http://adcloud.com/de/dev/</a><p>Ping me for more info.","time":1317485904,"type":"comment"},{"by":"wildmXranat","id":3061178,"parent":3060221,"text":"Toronto(Markham), Canada<p>PHP, solid OOP, MVC, Symfony framework a plus.<p>Carlton Group - In rewards recognition market with a nice list of very big clients. Contact me via email. <a href=\"http://carlton.ca\" rel=\"nofollow\">http://carlton.ca</a>","time":1317504947,"type":"comment"},{"by":"ADhuna","id":3060602,"parent":3060221,"text":"Sunnyvale, CA\nInfoaxe - <a href=\"http://www.infoaxe.com/infoaxehiring.html\" rel=\"nofollow\">http://www.infoaxe.com/infoaxehiring.html</a>\nSoftware Engineer\nWe're changing the way people browse the internet.","time":1317491690,"type":"comment"},{"by":"kriscarle","id":3068267,"parent":3060221,"text":"Alexandria, VA (Washington DC area) Full-Time<p>Looking for web developers to work on web mapping and GIS applications (ExtJS, OpenLayers, MapServer, JavaScript, C#, Java, Oracle PL/SQL, ArcGIS)<p>Send me an email at kris.carle@syncadd.com","time":1317678682,"type":"comment"},{"by":"jason_trenouth","id":3060698,"parent":3060221,"text":"Cambridge UK, C++ / Java, NLP, big data, search :-<p><a href=\"http://www.linguamatics.com/welcome/company/jobs/uk_senior_developer.html\" rel=\"nofollow\">http://www.linguamatics.com/welcome/company/jobs/uk_senior_d...</a>","time":1317493618,"type":"comment"},{"by":"graiz","id":3061906,"parent":3060221,"text":"Boston, MA - Raizlabs is looking for full time iOS and Android developers.  <a href=\"http://www.raizlabs.com/inside/available-jobs/\" rel=\"nofollow\">http://www.raizlabs.com/inside/available-jobs/</a>","time":1317524539,"type":"comment"},{"by":"randall","id":3060309,"parent":3060221,"text":"REMOTE! Castfire is hiring!<p><a href=\"http://careers.stackoverflow.com/jobs/13663/senior-php-lamp-developer-castfire\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/13663/senior-php-lamp-...</a>","time":1317486274,"type":"comment"},{"by":"GavinB","id":3060382,"parent":3060221,"text":"New York City / NYC<p>Design Intern with experience or training in 3D modelling. Help us build an adventure game with historically accurate characters and buildings.<p>This is a 6 month paid internship.<p>gbrown@scholastic.com","time":1317487610,"type":"comment"},{"by":"kitko","id":3066749,"parent":3060221,"text":"San Francisco- Wikia is Hiring!<p>Sr. Front-End Engineer (JavaScript) and Med and Sr. Web Application Engineer (LAMP).<p><a href=\"http://www.wikia.com/Hiring\" rel=\"nofollow\">http://www.wikia.com/Hiring</a>","time":1317657402,"type":"comment"},{"by":"prayag","id":3060704,"parent":3060221,"text":"MobileWorks (YCS11) is hiring Platform engineers/Platform interns <a href=\"http://www.mobileworks.com/jobs.html\" rel=\"nofollow\">http://www.mobileworks.com/jobs.html</a><p>Berkeley, CA","time":1317493710,"type":"comment"},{"by":"lawnchair","id":3060580,"parent":3060221,"text":"Baltimore, MD<p>Millennial Media is hiring!<p><a href=\"http://www.millennialmedia.com/about-millennialmedia/careers/\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers...</a>","time":1317491277,"type":"comment"},{"by":"andyfleming","id":3060810,"parent":3060221,"text":"OOP Web Developer at Variable Action, Inc.<p><a href=\"http://variableaction.com/company/employment/\" rel=\"nofollow\">http://variableaction.com/company/employment/</a>","time":1317495763,"type":"comment"},{"by":"hank808","id":3071180,"parent":3060221,"text":"The HP Cloud is hiring.  Go here:  <a href=\"https://hp.taleo.net/\" rel=\"nofollow\">https://hp.taleo.net/</a> and search for HPCS.  Thanks!","time":1317740546,"type":"comment"},{"by":"petervandijck","id":3071541,"parent":3060221,"text":"Gush, in Canada, lots of full-timers (Scala, Win, Mac, iOS, JS, design).<p>See <a href=\"http://getgush.com/jobs\" rel=\"nofollow\">http://getgush.com/jobs</a>","time":1317744509,"type":"comment"},{"by":"simonk","id":3061094,"parent":3060221,"text":"Vancouver, BC - (Full time)<p>Python/Django developer to work on Rhino Accounting (www.rhinoaccounting.com).<p>Email simon@rhinocloud.com please put HN in the subject.","time":1317502984,"type":"comment"},{"by":"garysieling","id":3061001,"parent":3060221,"text":"Philadelphia, PA\nInterns and Full Time Engineers\nHiring both Java and IOS developers\n<a href=\"http://www.wingspan.com/about/careers/\" rel=\"nofollow\">http://www.wingspan.com/about/careers/</a>\nWingspan Technology builds enterprise software for pharmaceuticals and other regulated industries. We're growing quickly, and there are lots of opportunities to work on different things.","time":1317500420,"type":"comment"},{"by":"nemesisj","id":3061466,"parent":3060221,"text":"Scotland based training ERP company hiring web devs: www.Administrate.co<p>(Telecommuting globally OK)","time":1317511887,"type":"comment"},{"by":"pabloest","id":3060327,"parent":3060221,"text":"San Francisco, CA and London, UK<p>Meraki - <a href=\"http://meraki.com\" rel=\"nofollow\">http://meraki.com</a><p>Meraki is the leader in cloud networking and we have over 18,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://meraki.com/customers\" rel=\"nofollow\">http://meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco.<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>We’re looking to hire in San Francisco and we have a few positions open in London as noted.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical operating data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services for all of those thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you will be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business; we are also growing quickly, with a proven model for our technology, so your work will reach many customers and have a huge impact.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://meraki.com/company/jobs#ui_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#ui_eng</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://meraki.com/company/jobs#bs_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#bs_eng</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://meraki.com/company/jobs#fw_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#fw_eng</a><p>* Hardware Program: passionate for research, product specs, engineering, project management, and manufacturing/quality (ME, EE or similar).\n<a href=\"http://meraki.com/company/jobs#hardware-program-engineer\" rel=\"nofollow\">http://meraki.com/company/jobs#hardware-program-engineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://meraki.com/company/jobs#product_mktg\" rel=\"nofollow\">http://meraki.com/company/jobs#product_mktg</a><p>* Marketing Manager: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr</a><p>* Marketing Events Manager: highly organized, energetic, and creative person to execute our fast-paced events program.\n<a href=\"http://meraki.com/company/jobs#events_mktg\" rel=\"nofollow\">http://meraki.com/company/jobs#events_mktg</a><p>* [London] Marketing Manager - Europe: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr_emea\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr_emea</a><p>// Support<p>* Inside Pre-Sales / Technical Support Engineering: sharp, energetic, and pre-sales and technical support engineer who can work closely with many groups within the company, including sales and product management, as well as with engineering to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://meraki.com/company/jobs#tech_support_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#tech_support_eng</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, channel sales, sales engineers, and strategic sales. Our London office is also looking for sales representatives, with a focus on DACH and other areas within Europe, Africa, and Russia.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1317486644,"type":"comment"},{"by":"leftnode","id":3060799,"parent":3060221,"text":"Dallas, TX - SpeedFC (<a href=\"http://www.speedfc.com\" rel=\"nofollow\">http://www.speedfc.com</a>)<p>The company I work for, SpeedFC, is looking for some excellent PHP developers to build our ever growing team. We're currently a team of 11 developers with 4 team leads and 7 developers (I'm a team lead but do plenty of development too).<p>We do end to end e-commerce. We handle the websites of our clients (you may touch on this, but not often), the backend warehouse software (what you'll be working on), customer service, and fulfillment. We own 100% of our code, it's all written in house so you'll definitely have a chance to work on new products with fresh code. Now, you will also have to work on old projects with old code. Comes with the territory.<p>Our stack is full Linux, Apache, Postgres, and PHP. Even if you're not familiar with Postgres, but have a good PHP and SQL database background, still apply.<p>Why you would want to work here<p>We work with a tremendous amount of data and ensuring it's correct at all times is a difficult job. So, if you're in for a challenge, working here is great. Now, there are some downsides. We have an old codebase, largely untested and undocumented. You'll have to work on some stuff that will want to make you tear your hair out.<p>That is now changing! All code developed on my team is unit tested, documented through tests, and fresh PHP5.3+. We do code reviews, demo days, and have an official QA department. Also, right now my team is about to start working on a difficult and far reaching data synchronization problem. Thus, if you want to be a member on a project building code from scratch and \"doing it the right way\", now would be a great time to join my team.<p>Another nice aspect of the job: if you think something needs to be done, write up a short document explaining why and the benefits it will have, submit it to the bosses and get it approved. The executives are more than willing to let you work on fresh projects that will help the company.<p>Mix the good with the bad, and overall it's a good place to work. They just built us our own custom private office for developers only so other employees can't come bug you easily.<p>We won't help you relocate, unfortunately.<p>Availability - Now<p>Benefits<p>Health, Dental, and Vision. You don't start off with an incredible amount of PTO, and Christmas time is pretty nuts around here, but they say they're working on it, so we'll see what happens.<p>I will be your team lead. I won't be your boss. I won't know your salary, for example. I like working closely with my team members and bouncing ideas off them. I'm more than open to using different technologies where they fit and moving away from PHP where necessary.<p>Email me vcherubini@speedfc.com with your resume attached. I'll be doing the interviews, and I keep them very much functional and not theoretical. You won't have to bust out your college text books to remember what a red/black tree is, I want to know your past and current projects, and have a good discussion about you as a software developer, not an algorithm memorizer.","time":1317495519,"type":"comment"},{"by":"kkgupta","id":3105230,"parent":3060221,"text":"Software Development Engineer – Developer Platforms<p>Amazon Web Services (AWS) is looking for a rock-star frontend developer to build world-class user interfaces for our customers. If you’re a web developer, application engineer, and you have the skills to create highly interactive and well-designed web interfaces, then Amazon Web Services is looking for you.\nAmazon is on the forefront of developing cutting-edge cloud technologies for use by individuals and businesses of all sizes. We want someone who can explore challenging new areas and come back with new best practices for web application development that other developers should be following. You should be fanatical about delivering designs and components that create a great developer experience making developers wildly more productive than they were before. You should be able to deconstruct complicated application and prototype designs to come back with how to deliver a solution faster, cheaper, and more predictably.<p>Responsibilities\nOur engineers own their work from beginning to end. You will be responsible for a myriad of steps from design and implementation, to launch and support. This position will require interaction between several stakeholders including members of our engineering team, application designers, managers, and engineers on other teams. You will review the UI and API designs of your peers, as well as fix bugs and troubleshoot operational issues as they occur.<p>Basic Qualifications:\n•\tStrong OO design and coding skills in Java and Javascript. \n•\tDemonstrated passion for user experience design and improving usability\n•\tExperience translating design mockups and prototypes into working application designs\n•\tExperience building large-scale web applications using JavaScript and Ajax\n• 3-5 years of software development experience.\n• Bachelor’s degree – preferably in computer science or a similar degree.\n• Should be genuinely excited about technology, have a strong interest in learning about and playing with the \nlatest technologies. Must be a self-starter and motivated.<p>Preferred Qualifications:\n•\tExperience with asynchronous web frameworks like GWT\n•\tHave developed or supported an operationally critical web service\n•\tFamiliarity with scripting languages such as Perl, PHP, Ruby, or Unix shell scripting<p>To apply, send your resume to aws-jobs-db-console[At]amazon.com<p>I'm one of the core member of the Database services console team and have learned an amazing amount by taking an UI design to launch. It’s a uniquely exhilarating experience to launch new web interfaces - seeing that interfaces you’ve worked on has such a profound effect on thousands of businesses, watching it grow each day, and learning from your customer. Knowing that millions of people rely on it pushes you to do the best work you can. I’m proud of the work we’ve done and I’m very excited about the milestones still ahead of us.<p>For more information on Amazon Web Services, please visit <a href=\"http://aws.amazon.com\" rel=\"nofollow\">http://aws.amazon.com</a>","time":1318463050,"type":"comment"},{"by":"earthaid","id":3063028,"parent":3060221,"text":"Earth Aid - Boston, MA - Full-time Data &#38; Rails Engineers<p>Earth Aid ( <a href=\"http://earthaid.net\" rel=\"nofollow\">http://earthaid.net</a> ) was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're newly venture-backed by Point Judith Capital as well as strategic and angel investors who have built and scaled some of the most successful businesses today. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We have offices in San Francisco and DC, and we're now consolidating our dev team and HQ into an awesome brand new headquarters in Boston.<p>We empower households to track &#38; contextualize their electric, natural gas, and water utility usage. We value data, clarity, focus and beauty. We are looking for people who do too --- people who want to work on incredibly complex problems and come up with solutions that will change the world. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption.<p>To learn more about our very competitive salaries, excellent benefits, fun company culture, and small arsenal of office helicopter drones, check out: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, and send us an e-mail at jobs at earthaid dot net<p>---<p>Two Highlighted Opportunities in the Boston Office -&#62;<p>Data Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change &#38; the future of energy. Analytics: Use tools like mapreduce, hadoop, and AWS to drive insight into energy usage. Performance: Store the world's energy data in a way that makes it easy for web engineers to create experiences on top of it. Maintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups. Reliability: Build tools that make it easy to know what is happening throughout the system and that allow Earth Aid to be constantly available for our users. Security: Create an infrastructure that both allows us to be certain that our user data is safe while at the same time allow the flexibility to perform analytics and quickly iterate.<p>Ruby on Rails Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change and the future of energy. User Growth: Create a clear and impactful experience that drives us toward many millions of users. Maintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups. Product design: Envision and execution on product features and entirely new products. Visualization: Create beautiful and meaningful visualizations that impact consumer energy usage.","time":1317568820,"type":"comment"},{"by":"craigfollett","id":3060971,"parent":3060221,"text":"Toronto, Ontario, Canada<p>Senior Ruby on Rails Developer<p><a href=\"http://www.uniiverse.com/jobs\" rel=\"nofollow\">http://www.uniiverse.com/jobs</a><p>ABOUT UNIIVERSE\nEver wonder what it was like to work at Facebook or Google when it was just five people? Imagine building a web platform that will change the way people think and improve live their lives.<p>Uniiverse is an exciting startup building a person-to-person marketplace for services and activities – the ‘eBay for Time’. Our primary dimensions are: temporal, local and social. We have developed a revolutionary concept that leverages the existing social graphs to allow people to save time, share and discover passions and build the world’s ‘trust graph’.<p>Uniiverse is seeking a talented Ruby Developer to lead the development of core elements of our platform.<p>TIMEFRAME\n• You will join us full time during Fall 2011 – we are quite flexible on timelines<p>RESPONSIBILITIES\nOwn product sprints for front and back-end build-out of Uniiverse's technology platform, e.g.:\n• Thought partner and shape design and functionality of our product\n• Drive development of back-end technology (e.g. billing systems, proprietary recommendation algorithms)\n• Lead development of key front-end functionality (e.g. calendarization, jQuery widgets, etc.)\n• Implement analytics, tools, and admin panels\n• Build test cases in parallel to development, design and implement A/B testing environments<p>TECHNOLOGIES WE LOVE\n• Ruby on Rails + MongoDB\n• JavaScript / jQuery; AJAX / JSON\n• HTML5 / CSS3 + HAML / SASS<p>REQUIREMENTS\n• Proficient in Ruby on Rails 3\n• Familiar with MongoDB, Linux, Amazon Web Services (AWS), OAuth, Facebook Graph API\n• Experienced in JavaScript, jQuery, HTML and CSS (HAML and SASS)\n• Excited about BDD, automated deployment, fixing bugs, and shipping code\n• Keen eye for clean, simple design aesthetics, and usability\n• An independent, fast-learning, self starter who takes ownership over solving ambiguous problems\n• Energetic, passionate (does not matter about what!), and driven\n• Believes strongly in The Joel Test<p>BONUS IF YOU ARE…\n• Proficient in mobile development (iOS / Objective-C)\n• Savvy with machine learning / natural language processing / recommendation algorithms\n• Experienced in developing accounting and billing systems<p>APPLICATION\nPlease email jobs@uniiverse.com with your CV, links to your GitHub, LinkedIn, Twitter, and technical blog<p>BENEFITS\nLearn how to build a massively scalable social web application in a sexy technology stack. Get paid to work in a fast-paced, fun, start-up environment. Build valuable references.<p>ABOUT US \nOur team is comprised of experienced, talented and passionate people with deep expertise in strategy, technology and web and app development. We'd be excited to tell you more about us and our vision during an initial conversation.<p>REFERRAL BONUS\n$1,000* if the person you recommend is hired.<p>* Payable for full time employee hires (i.e. contractors and freelancers excluded), for this particular dev position, after the completion of any probationary period, if applicable. Does not apply to candidates with whom Uniiverse was already in contact.","time":1317499657,"type":"comment"},{"by":"mikebabineau","dead":true,"id":3060782,"parent":3060221,"text":"Redwood Shores, CA (SF Bay Area) - Engineers and more<p>BioWare SF is hiring! Formerly known as EA2D, we are now the online/social arm of the BioWare group.<p>We're working on exciting projects:<p>* Social games for gamers (from BioWare and others)<p>* Game APIs (web services for online games)<p>We're small (30 people) and scrappy. And we're growing fast: 0-200 servers in the past 8 months. Tech stack is primarily AS3/Java backed by MongoDB, but we're writing more in Python, JavaScript, and Ruby. We have a highly automated infrastructure running on AWS (EC2 w/ELBs and ASGs, EMR, SQS, Beanstalk, etc., plus more than a few super-secret/unreleased Amazon features) and Google App Engine. Buzzword potpourri includes Chef, node.js, Hive, Graphite, Tomcat, Spring, Maven, Hudson, GitHub, Pingdom, Loggly, PagerDuty, and continuous deployment. &#60;3 DevOps. We have a small but growing list of open source projects (see <a href=\"http://github.com/ea2d\" rel=\"nofollow\">http://github.com/ea2d</a> and <a href=\"http://eng.ea2d.com/\" rel=\"nofollow\">http://eng.ea2d.com/</a>).<p>We need backend and systems engineers, artists, PMs, and more. Detailed listings are here: <a href=\"https://jobs.ea.com/search/advanced.do?q=bioware&#38;globalRegionID=a1W500000004CClEAM&#38;locationID=a1W500000004CAnEAM&#38;jobCategoryID=\" rel=\"nofollow\">https://jobs.ea.com/search/advanced.do?q=bioware&#38;globalR...</a><p>I lead the platform team. Drop me a line if you're interested: mikeb@ea2d.com","time":1317495149,"type":"comment"},{"dead":true,"deleted":true,"id":3067786,"parent":3060221,"time":1317672388,"type":"comment"},{"by":"BenSchaechter","id":3060267,"parent":3060221,"text":"Palo Alto, CA -- <a href=\"http://gopollgo.com/about/jobs\" rel=\"nofollow\">http://gopollgo.com/about/jobs</a><p>GoPollGo is looking for talented Rails developers to help us innovate in the polling/survey space.  This will be employee #3 and is a full-time salaried position with options.  We're also looking for a stellar visual graphic designer -- full time salaried w/ options as well.<p>No remote workers right now -- sorry.","time":1317485274,"type":"comment"},{"by":"Kirchart123","dead":true,"id":3060878,"parent":3060221,"text":"Phyton developer .. Remote .. We got selected for startupchile 2nd round (guali.com.mx) .. Email me at soporte@guali.com.mx if interested","time":1317497296,"type":"comment"},{"deleted":true,"id":3060466,"kids":[3060500],"parent":3060221,"time":1317489093,"type":"comment"}]]}