{"comments":[[{"by":"avar","id":4053817,"parent":4053076,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there currently working on search and relocated over there about a year and a half ago, and have been very happy with it.<p>We have people from all over the world relocating to work with us and are very well set up to handle relocation and visa issues, most of the people working in IT are expats so we've got a lot of experience with bringing people in.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline (PCLN) group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.<p>We use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it.\nWe're also very open to open sourcing code that doesn't contain any business logic, I've personally been involved in open sourcing a few of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and a few CPAN modules.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers. Everything we do is aimed at solving problems for our customers, if it doesn't help our customers we're not interested in doing it.<p>You don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before. The sort of people we'd like to hire are good technically, excellent at communication, and can acquire a good sense of how they fit into the big picture.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume, I've posted in a similar thread here a couple of times before and have already helped get one person hired, many others have had or are having interviews, and I've fielded a bunch of questions from would-be applicants. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent.","time":1338563502,"type":"comment"},{"by":"hurdleress","id":4055887,"parent":4053076,"text":"San Francisco Bay Area (South SF, CA); Counsyl is Hiring Engineers (H1B and others welcome to apply)<p>Apply online: <a href=\"http://bit.ly/Counsyl_Engineering_HN\" rel=\"nofollow\">http://bit.ly/Counsyl_Engineering_HN</a><p><i>About Counsyl</i><p>Over the last few years, we've grown from a dorm room startup to become one of the largest clinical genome centers in the world. Our pre-pregnancy genomic test is now prescribed by physicians for more than 1% of all births in the United States.<p>As you might imagine, handling this kind of volume puts us in terra incognita. Our situation is similar to the one faced by Amazon in the 90s, before anyone knew how to scale an operation with such highly interconnected physical and informational components.<p>To solve the problems associated with scaling the medical genome, we hire generalists rather than specialists. Our engineers are pragmatists who know when to use machine learning and when to use a simple regex, and understand in what sense those approaches are at different ends of a continuum. Many did not have a bioinformatics background before they joined, but all had strong fundamentals in data structures and algorithms.<p>Experience in general means little to us as genomics is a young field; working code means quite a lot more. If this sounds like your kind of company, we invite you to apply.<p><i>About you</i><p>You should have a BS, MS, or PhD in Computer Science (or equivalent) and significant independent programming experience as demonstrated by Github account, personal web page, or prior employment.<p>You should also be a generalist, interested in rotating through the engineering team and working in one or more of these areas:<p>- Genomics: design, validate, and optimize clinical genomic assays for rare Mendelian variants<p>- Machine Learning and Data Science: extract meaning out of one of the largest clinical genomic datasets in the world<p>- Robotics: automate and scale our backend to do more clinical sequencing and genotyping than anyone has ever done before<p>- UI/UX: design the first widely adopted user interface for the medical genome<p>- Clinical Integration: solve the wide variety of practical issues associated with translating genomics into a clinical context<p>- Infrastructure: build and deploy the hardware and software systems that support secure, large-scale computations on genomic datasets<p>From a skills perspective, you should have familiarity with several of the following technologies. We obviously don’t expect you to know everything on the list, but you should be nodding to yourself by the end of it.<p>- Python: Django, Numpy, Scipy, Cython<p>- HTML/CSS/JS: Coffeescript, Backbone.js, Twitter Bootstrap 2, HTML5 APIs, Chrome Web Inspector<p>- C++: STL, gcc/g++, Boost, C++11<p>- Functional Programming: Haskell, underscore.js, functional reactive programming<p>- Data Science and Visualization: GNU GSL, CUDA, Netlib/LAPACK, graphviz, R, Matlab, Matplotlib, Numerical Recipes<p>- DevOps/System Administration: Amazon Web Services, Puppet, nginx, nagios, Apache, Fabric<p>- APIs: REST, JSON, SOA, and all that jazz<p>- Biological Databases: NCBI, UCSC, 1000 Genomes, Hapmap, UK10K<p>- Sequencing/Computational Biology: OLB, samtools/pysam, pygr, galaxy/bxpython, kent utilities<p>- Unix/Linux: bash/zsh, emacs/vim, git, GNU toolchain<p>- PostgreSQL: psycopg2, hstore, replication<p>- Security: skipfish, SSL, fuzz testing, preventing XSS &#38; SQL injections<p>Again, please consider these guidelines, not absolutes. For example, if you know Chef, we figure you can learn Puppet, and if you know Ruby, we figure you can learn Python.<p>In general, you should enjoy taking care of the practical last mile problems needed to actually achieve a societal ROI on the world's multibillion dollar investment in the Human Genome Project.<p>What you'll do:<p>- Move fast without breaking things :)\n- Start in the areas you're familiar with, and grow to work on the full stack\n- Work closely with a small, tight-knit team\n- Develop algorithms and code for all aspects of clinical genomics, from machine learning to supply chain optimization to insurance billing\n- Quite literally save lives with your keyboard<p>What you'll get:<p>- Competitive compensation and start-up equity package\n- Excellent health insurance\n- Catered meals every day plus a fully stocked fridge\n- Gym access to work it off\n- MacBook Pro, 30\" monitor, iPad, iPhone, and all the gadgets you need<p>Apply online: <a href=\"http://bit.ly/Counsyl_Engineering_HN\" rel=\"nofollow\">http://bit.ly/Counsyl_Engineering_HN</a>","time":1338585962,"type":"comment"},{"by":"drags","id":4054055,"parent":4053076,"text":"SF - Rails - HALF-TIME-ISH :)<p>I've mentioned before that we have a couple of engineers who work half-time-ish (and do their own things the rest of the time) and it got some positive feedback: <a href=\"http://news.ycombinator.com/item?id=3850480\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3850480</a><p>We're ready to hire a couple more in this vein, so if it sounds interesting let me know!<p>=========<p><i>Advantages for you:</i><p>- you get 2-3 extra weekend days for fun and profit<p>- we provide health insurance and all that jazz<p>- if some weeks you don't have lots to do and want to work more, and other weeks you have lots to do and want to work less, we can be flexible<p>- we're profitable and growing! so if you decide \"wow I really love Verba and want to spend every waking moment there\" we can make that dream come true<p><i>Advantages for us:</i><p>- you have more time to learn new things, meet new people and generally be a friendlier, happier, more knowledgeable person in our workplace<p>- we can hire faster with less anxiety (instead of the \"<i>gulp</i> i just committed $100k/yr\" feeling, we have the \"<i>smaller gulp</i> i just committed $50k/yr\" feeling :)<p>- you get to be a part of what we're doing, we get to hear about all the cool stuff you're doing, and that can only lead to good things for both of us<p>Anyway, I've included our spiel and \"what we're looking for\" summary below, so shoot me an email if you're interested (ragalie@verbasoftware.com).<p>========<p>The college textbook market is currently being disrupted. Verba helps college bookstores transform themselves so that they a) understand and embrace the power of the nets, b) become agents of change in the textbook industry instead of agents of reaction and c) continue to make a healthy profit.<p>We're a B2B company working with just about 200 colleges and universities, and we're looking for people familiar with Ruby, Rails, MySQL and JS who can help us grow faster. We (thankfully) don't have too many scaling problems, but we have a ton of opportunities (product and partner-based) that we could move on much faster with a few more hands on deck. The ideal person has strong Rails knowledge, solid testing practices, a good head for architecture and knows enough JS to help out on front-end.<p>Be sure to check out our website (<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http://www.verbasoftware.com</a>) so you can read all about our current products and hear people say nice things about us.","time":1338565673,"type":"comment"},{"by":"decklin","id":4053165,"parent":4053076,"text":"Sonian (Newton, MA) - Full time, local or remote<p>We're a funded (recently closed Series C) email archiving startup with many large corporate customers. We are looking for an additional engineer for our operations (or \"devops\" if you prefer) team, to take us from merely using configuration management and automated deploys to delivering our internal services as dependable, multi-IaaS-portable tools that empower everyone from support engineers to Clojure backend developers to solve customer issues without paging us and use our monitoring API to automatically spin up instances to process work.<p>We have offices outside of Boston (Newton), but our dev and ops teams are mostly remote, and we meet over VOIP and pair-program in tmux.<p>Some highlights of what we do:<p><pre><code>  +   We manage hundreds of compute instances across multiple clouds, including over a petabyte of data.\n  +   We write the code to help facilitate deploying our application to new public clouds.\n  +   We automate everything we possibly can\n  +   We build up awesome applications, and then opensource them (Perhaps you've heard of our monitoring framework Sensu - https://github.com/sensu )\n  +   We build applications to manage every aspect of our compute and storage infrastructure, from deploying code, to provisioning systems on multiple clouds, to securing access control.  For every problem - there is a code solution.\n  +   We have an awesome time working together on technologies that very few (if any) other companies are doing today.\n  +   We have days where all we do is hack on a specific project (http://blog.petecheslock.com/2012/02/13/why-your-company-should-have-internal-hackdays/) - leave the day-to-day tasks for the next day.\n  +   We meet up 2-3 times a year in Boston - with the rest of the company.\n</code></pre>\nWhat are we looking for in a new member of our team?<p><pre><code>  +   Excitement, energy and a willingness to learn something new.\n  +   The ability to take a task from idea to code to testing to deploy (all within a short amount of time).\n  +   Bring new ideas around project or processes to the team - if we like it - we'll do it.\n  +   You can work from home, from our Newton, MA headquarters, or your local coffee shop.  Anywhere with Internet access.\n  +   You'll be part of an on-call rotation with the rest of our team.\n  +   Flexible person who can work by themselves or pair with their team to teach or learn.\n</code></pre>\nWhat are some things you should know or have worked with before? (Some, many or all)<p><pre><code>  +   Ruby (must know or want to learn)\n  +   Not required, but pluses: Python (used by some parts of our infrastructure), Clojure (used by our backend team)\n  +   Chef (or other configuration management systems), Fog\n  +   Rails, Sinatra (both also used by our front-end team)\n  +   Git or other DVCS\n  +   System administration with Ubuntu (includes security, logging, monitoring, web/SQL admin, etc, etc)\n  +   Knowledge of Openstack (especially Swift) is a plus\n  +   A love for making complex configuration and systems simple via automation\n  +   Continuous Deployment, Agile Development/Kanban\n  +   Contributing to open source\n</code></pre>\nInterested? - Contact pete.cheslock@sonian.com or <a href=\"https://twitter.com/petecheslock\" rel=\"nofollow\">https://twitter.com/petecheslock</a>, and let him know you saw this post. Please include a short summary of why you think you would be a good fit, resume/blog/etc, and a link to a Github account or other code samples.","time":1338556161,"type":"comment"},{"by":"BenS","id":4053422,"parent":4053076,"text":"Palo Alto, CA - Full time, local, relocation<p>Pinterest is hiring engineers and designers. We're still a small team (~35 people). You can read what it's like to work at Pinterest here:<p><a href=\"http://www.quora.com/Pinterest/What-is-it-like-to-work-at-Pinterest\" rel=\"nofollow\">http://www.quora.com/Pinterest/What-is-it-like-to-work-at-Pi...</a><p>Millions of people use Pinterest to discover things they love. For many people, Pinterest has replaced Google as their first place to find things to buy, food to cook, and places to visit.<p>We have hard problems to solve at scale in areas like search, recommendations, and product design. We're still a young company so every person has a big impact and knows everyone else's name.<p><a href=\"http://www.pinterest.com/about/careers\" rel=\"nofollow\">http://www.pinterest.com/about/careers</a>","time":1338559847,"type":"comment"},{"by":"streeter","id":4054641,"parent":4053076,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to help solve an important problem? We are looking for extraordinary people who want to make a difference solving immensely challenging problems for an industry in need of innovative solutions. If you’ve ever wanted to use your technical skills and other talents as a force for good, here’s your chance.<p>We’ve made it extremely easy to teach online. We think that it should take someone five minutes to create a five minute lesson, and it is a principle that has guided us along the way. Teachers and students love what we have built and use our app and website every day. We were part of the first cohort of Imagine K12 and are looking to grow the team rapidly.<p>We are looking to make our first hires. If you want to change the world and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or email jobs@educreations.com<p>We are looking for:<p><pre><code>    Full-stack Engineer (Python)\n    Lead Mobile Engineer (Objective C/Cocoa)\n    Lead Visual Designer\n    Technical Interns</code></pre>","time":1338572700,"type":"comment"},{"by":"carterschonwald","id":4054370,"kids":[4055057],"parent":4053076,"text":"NY,NY (remote might be possible too, if you're sufficiently awesome and a good communicator)<p>Wellposed is a (very) small NYC based R&#38;D firm that supports itself with a mix of products and consulting.  We only build products (or consult for clients) if there is a kernel of challenging research grade computer science / math / engineering to be done.<p>Tech We use: for our own projects, Haskell. For JVM based clients, Scala. For iOS related work, some blend of obj-c and rubymotion (though Haskell might be viable in the near future). Also computers, those are important. (these are just the main tools. We believe in the right tool for the right job)<p>Current general areas we are working in:<p>• Machine Learning/Data Analysis/Mathematical Modeling (we think that there is plenty of room for improvement over current tools in this space, both in how the data is handled and how the analytics are performed)<p>• DSP as applied to both sound and radio, in conjunction with some interesting questions about how to do robust fast peer to peer sharing on mobile devices over a local network and/or via a custom rf transport layer. (there is more than one project in this blurb)<p>• mathematical modeling of the traffic dynamics of the modern city. (and several other projects in our queue are in the operations research/optimization space).<p>• a few of our projects also have a wee bit of hardware/device design components that are needed to make the deliverable wellposed.<p>• every other interesting area as the opportunity arises.<p>these are just the projects on our deck now, both it and the roster of great organizations we work with are growing and we hope to grow to.<p>If you are demonstrably awesome in at least one area, and would like to learn about at least 50% of the other areas, lets chat! (Of course, we're a small enough business that we'll also need to get along and communicate well).<p>if you'd like to get the conversation started, \nshoot an email to jobs atsign wellposed dot com, with subject: wellposed gigs\nand tell us a little bit about yourself, with some blend of resume, cover letter and/or links to previous work. [note that we're looking to hire for mid-late summer, not next week, and likewise I will reply to every email within a day (or week at most)]<p>I look forward to hearing from you!","time":1338569166,"type":"comment"},{"by":"afarrell","id":4053280,"parent":4053076,"text":"Panjiva (Cambridge, MA: right above the Kendall Ⓣ) - Full time, Intern, H1B<p>We're small, fast, and profitable. \nOur mission? Make it easier to do trade across borders. Setting up a production line and looking for a valve supplier that won't flake out on you? Use us to search for suppliers (or buyers) of any goods that go into or out of US ports and see credit reports, corporate responsibility audits, and customs records. Then, use us to reach out to them, communicate, and close the deal.<p>We're looking for exceptional software designers and engineers who can solve hard problems and design beautiful systems for our users. As a designer, you'll need experience both sketching out concepts and building them. As an engineer, you'll need experience with full-stack web application development, both server-side and client-side: A given day’s checkins may include performance tweaks to our backend data processing pipeline, an updated multivariate landing page test, a parsing expression grammar for a new data source, upgrades to our deployment infrastructure to make better use of our CDN, or new parallelizing queries to make Panjiva search faster. We're growing quickly, so our ideal candidates are ready to grow and learn just as fast in order to take the lead on critical projects.<p>We work in ruby on rails, but will teach you if you're coming from another platform.<p>If you're interested, email me at andrew@panjiva with your resume and a link to something cool that you've made.","time":1338557904,"type":"comment"},{"by":"jesstess","id":4053473,"parent":4053076,"text":"Cambridge, MA or REMOTE. Full-time.<p>The Ksplice group at Oracle<p>Does writing Python clones of your favorite childhood computer games sound like a fun weekend project? Would you hack on an old-school graphics demo that fits into a DOS MBR in your free time? Have you ever told a joke whose punch line was a git command? If you answered yes to any of the above, we want to hear from you!<p>About us<p>We are a small, tight-knit team of 12 women and men excited to work on technology that most people will tell you is impossible: updating an operating system kernel while it is running. Our product, Ksplice Uptrack, is a subscription service for Linux that provides completely non-disruptive, rebootless kernel updates. (You can read more about the underlying technology at <a href=\"http://www.ksplice.com/paper\" rel=\"nofollow\">http://www.ksplice.com/paper</a>)<p>Our open positions<p>Kernel engineer: Help us bring Ksplice to new Linux distribution releases, build rebootless kernel updates, and improve and scale the infrastructure around distributing them to our users.<p>Full-stack engineer with strong Python experience: Help us bring the Ksplice Uptrack client to new Linux distribution releases, improve our server infrastructure, and develop and extend our REST API and Django-based web interface.<p>If this technology excites you, let's talk! Feel free to direct questions to me at jessica.mckellar@oracle.com or to jobs@ksplice.com. Oracle is an equal opportunity employer.","time":1338560406,"type":"comment"},{"by":"stochastician","id":4053437,"kids":[4054323],"parent":4053076,"text":"Prior Knowledge (SF), Full Time, Intern<p>P(K) is a small team in downtown San Francisco pushing the frontiers of probabilistic machine learning to the masses. Our first product is Veritable, a predictive database. We like to think of it as a database for things you don't (yet) know.<p>We're passionate about discovering the hidden causes behind data, and are currently split pretty evenly between machine learning experts, scalable systems engineers, and people used to working with horribly messy, complex, and sparse data. We're backed by Peter Thiel's grou, Founders Fund, who share our commitment to long-term technical innovation.<p>One of our interns backed out last-minute (due to issues with his NSF fellowship) so we also have an open slot for the summmer!<p><a href=\"http://priorknowledge.com/join-us/\" rel=\"nofollow\">http://priorknowledge.com/join-us/</a> describes a bit more about what we're looking for, and you can always e-mail me (jonas@priorknowledge.com) for more info! Or swing by our offices at the intersection of 3rd and Market to meet the team.","time":1338559962,"type":"comment"},{"by":"joelg87","id":4053228,"kids":[4062343],"parent":4053076,"text":"You can be anywhere (we travel - UK, SF, currently Hong Kong, next stop Tel Aviv, then back to SF).<p>We're Buffer, a smarter way to share - <a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a><p>Looking for devops - PHP (CodeIgniter), MongoDB, beanstalkd, Apache/nginx on Debian.<p>We have just two focuses - building an awesome product and wowing our users through outstanding, speedy, helpful and fun support. We work hard to focus completely on these two things.<p>We have over 200,000 users, great revenue and the most amazing investors and advisors: <a href=\"http://angel.co/buffer\" rel=\"nofollow\">http://angel.co/buffer</a><p>We care most that the whole team has a great day, every day. We work hard and make a lot of progress. We also talk a lot about happiness and improving ourselves.<p>Sound fun? Whether you're interested in the role or want to say hello, drop me an email directly: joel@bufferapp.com","time":1338557218,"type":"comment"},{"by":"twakefield","id":4054925,"kids":[4055019],"parent":4053076,"text":"San Francisco (Union Square) - Full Time<p><i>Run Marketing / Developer Evangelism at Mailgun (YC W11)</i><p>Mailgun's growth to date has been entirely organic. We are now looking for someone to build and run our marketing efforts.<p>We are looking for someone that:<p>- Knows how to sell a BMW to people who think their Ford Pinto is good enough.<p>- Has a technical background and wants to make the world a better place for other developers.<p>- Believes in data driven decision making over intuition.<p>- Has experience building scalable lead generation channels.<p>- Can write engaging content about technical topics.<p>- Enjoys attending meetups/hackathons/conferences and discussing hard problems with other smart people.<p>- Likes traveling.<p>We offer:<p>- Competitive salary and benefits.<p>- Meaningful equity.<p>- A complete marketing greenfield with the freedom to create your own strategies and implement them.<p>- The confidence and satisfaction that comes with marketing the best product in the field.<p>- The self-fulfillment of knowing you were essential to the success of Mailgun and all of the fame and fortune that comes with it.<p>About Mailgun:<p>- YC W2011 company, funded by SV Angel, Paul Bucheit, Yuri Milner and other top-tier investors.<p>- Located in San Francisco (Union Square).<p><i>Email jobs@mailgun.net if interested.</i>","time":1338575941,"type":"comment"},{"by":"dman","id":4053800,"parent":4053076,"text":"Enthought - www.enthought.com<p>Python development for scientific applications, financial applications and Python toolset development. Enthought has offices in Austin, New York, Cambridge, Mumbai. If you use Python and love numpy / scipy then Enthought would be a great place for you. Come work with numpy / scipy hackers on solving interesting scientific analysis and data visualization problems. Also we are building the next generation of Python development tools, so there is no shortage of interesting problems to work on. Send applications to jobs@enthought.com and mention that you saw this on the hacker news Feb 2012 thread. Looking forward to working with some of you. If you have any questions about Enthought, what jobs are on offer and what problems keep us up at night feel free to reach out to me at dsharma at enthought dot com","time":1338563392,"type":"comment"},{"by":"snowmaker","id":4053518,"parent":4053076,"text":"Scribd (social publishing, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired TWO people from these \"Who is Hiring\" threads ... it really works!!<p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript<p>* iOS<p>* Machine Learning / Data mining kinds of problems<p>* Back-end problems: scalability, web crawling, analytics<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.<p>We're well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>Looking for full-time and INTERN hires (junior year or older).  H1B and relocation are no problem.<p>See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1338560848,"type":"comment"},{"by":"StaceyW","id":4053393,"parent":4053076,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B<p>At our core, we're a technology company applying our talents to the domain of finance.  We've created a system that combines artificial intelligence and keen human insight—a system that's constantly improving and advancing.<p>We're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology.  We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you! stacey.winning@twosigma.com<p><a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1338559590,"type":"comment"},{"by":"benhedrington","id":4053360,"parent":4053076,"text":"Best Buy (Minneapolis, MN) - Full time, strong in HQ presence required, team growing quickly working on more flexible officing as they grow.<p>Best Buy is looking for an entrepreneurial minded Product Manager to be key part of our fast growing \"Digital Experience Team\" business; focused on producing a diverse array of Mobile and wider digital products; to help envision new digital tools to deliver Best Buy's strategic goal of 'making technology work for you'. This role will bring to life new digital products that empower consumers to learn, explore, and engage with consumer electronics across Best Buy's digital and physical touch points.<p>Official job post: <a href=\"http://www.bestbuy-jobs.com/job/Richfield-Product-Line-Manager-Mobile-Digital%2C-Emerging-Platforms-Job-MN-55423/1611712/\" rel=\"nofollow\">http://www.bestbuy-jobs.com/job/Richfield-Product-Line-Manag...</a><p>I am the hiring manager, willing to talk over email, phone, etc. No need to go through the machine to simply learn more.\nben dot hedrington at bestbuy.com or <a href=\"http://linkedin.com/in/benhedrington\" rel=\"nofollow\">http://linkedin.com/in/benhedrington</a>","time":1338559123,"type":"comment"},{"by":"KB","id":4054457,"parent":4053076,"text":"Cambridge, MA - Full time Engineers at Crashlytics (<a href=\"http://www.crashlytics.com\" rel=\"nofollow\">http://www.crashlytics.com</a>)<p>Frontend, Backend, iOS and Android. Mobile apps crash over 1 billion times a day - let's do something about it!<p>Crashlytics is mobile crash reporting and analysis as a service. If you're interested in the intersection of great UX, scalable systems, the mobile internet, and big data analytics we want to talk to you!<p>We're an early stage startup looking for truly talented engineers with a passion for clean code and great products. Our team is fast, smart and independent -- with previous startup success.<p>We're small and growing rapidly, so it's important to us to have a great company culture to support that growth.\nWe offer all of the usual startup perks: snacks in the kitchen, flexible work schedule, top-of-the-line gear (Macbook Air, Thunderbolt display, iPad/Android Tablet), etc.\nAdditionally, we feel strongly that it's the culture created by shared values that really makes Crashlytics a great place to work.<p>Here's a brief look at a few of the things we value:<p>We focus on the modern web - We don't support IE6, so you'll never have to worry about it!\nWe love feedback - you’ll be able to connect directly with customers who are using what you’re building and use their input to make the product better.\nWe’re self-directed - We trust you to manage your own schedule, vacation, etc. without complex policies or forms to fill out.\nWe ship - we're huge fans of TDD, build/measure/learn, and are moving towards continuous deployment.\nWe give back - We encourage open source contributions and community participation.\nWe’re hyper technical - Deep understanding and optimization are in our soul - what can your code accomplish in 18ms?<p>Interested? Say hello to us at jobs at crashlytics dot com","time":1338570355,"type":"comment"},{"by":"mindcrime","id":4053465,"parent":4053076,"text":"OSI - Chicago, IL / Durham, NC<p>Open Software Integrators is hiring, especially in Chicago.  We're looking for senior consultants and senior developers to staff our Brand Spanking New office here in Chicago (headquarters is in Durham, NC).<p>OSI specializes in helping our clients build and deploy solutions using F/OSS packages, with a big emphasis on Java related technologies:  Spring, Hibernate/JPA, JBoss, Tomcat, etc.  We also have a focus on NoSql technologies, including MongoDB and Hadoop.  In addition to green-field development we offer training, research, and remote support as well.<p>OSI was founded by a former JBoss guy, who originally wrote Apache POI, and we have a long history of commitment to supporting Open Source Software.  The company has a really cool, laid-back culture, some seriously smart and talented people to work with, and is generally a great place to work.  Anyone who's interested, feel free to shoot me an email and I'll get your info to the right people.  prhodes (at) osintegrators (dot) com","time":1338560282,"type":"comment"},{"by":"ih","id":4053535,"parent":4053076,"text":"Palo Alto (California and El Camino), Engineers, Full Time<p>Udacity is leading the way in massively open online courses by delivering quality higher education to people all around the world. We have new and exciting technology and classes in the pipeline and we need great engineers to help shape this movement.<p>Check us out at <a href=\"http://www.udacity.com/\" rel=\"nofollow\">http://www.udacity.com/</a> and <a href=\"http://www.udacity.com/jobs\" rel=\"nofollow\">http://www.udacity.com/jobs</a> and feel free to send me a message if you're interested/have questions ih@udacity.com.","time":1338560972,"type":"comment"},{"by":"epi0Bauqu","id":4053338,"parent":4053076,"text":"DuckDuckGo (Paoli, PA) - LOCAL OR REMOTE.<p>Android and Front-end. <a href=\"http://help.duckduckgo.com/customer/portal/articles/216387\" rel=\"nofollow\">http://help.duckduckgo.com/customer/portal/articles/216387</a>","time":1338558824,"type":"comment"},{"by":"dpryan","id":4053476,"parent":4053076,"text":"ByteLight (Cambridge, MA) - Full time, local, relocation<p>We're a funded, early stage start-up creating a revolutionary indoor GPS platform using LED lights.  We're looking for an experienced full-stack software engineer to join our team as a senior developer.  While the majority of our work is in software, we aren't afraid of blowing stuff up (our most recent addition to the team was a blast shield).<p>Candidates must have the experience and skills necessary to design and build a product platform from the ground up including server architecture, REST APIs, back office applications, automated testing, deployment procedures, and supporting a stable platform while evolving it.<p>We're looking for people with the following skills/experience:<p>-Multiple years creating database-driven web applications<p>-Strong in Ruby, Rails and front-end technologies (HTML, CSS, JS)<p>-A generalist that can work full stack: from database to front end<p>-Modern software engineering tools and disciplines such as version control, TDD ,continuous integration, and agile process<p>-Mature with lots of passion for creating great software<p>-A great work ethic and the ability to consistently deliver high quality work<p>-A need to be challenged, wear lots of hats, and create something great<p>If you're a fan of game changing technology, and not afraid of the occasional explosion, email me at dan@bytelight.com.  Also check out our complete list of job postings at <a href=\"http://www.bytelight.com\" rel=\"nofollow\">http://www.bytelight.com</a>.","time":1338560411,"type":"comment"},{"by":"mehuln","id":4053571,"parent":4053076,"text":"Palo Alto, CA (moving to city post-summer), Full-Time, Interns (Summer &#38; Fall) : <a href=\"http://flutterapp.com\" rel=\"nofollow\">http://flutterapp.com</a><p>Flutter (YC W12, A16z, NEA funded) is looking for folks interested in innovating, designing, and solving some tough problems.  We recognize gestures over the webcam, and our first app Flutter has been very well-received - check it out on Mac App Store.  We are looking for folks interested in computer vision, machine vision, using JavaScript to integrate gestures into browsers both computers and tablets.<p>Here's our link to iTunes Mac App Store page: <a href=\"http://itunes.apple.com/us/app/flutter/id522248613?mt=12\" rel=\"nofollow\">http://itunes.apple.com/us/app/flutter/id522248613?mt=12</a><p>We're looking for:\n- JavaScript Engineer, Node.js, jQuery\n- C or C++ Engineer\n- Python Engineers\n- Hadoop/MapReduce with Machine Learning\n- Writing API &#38; SDK\n- Gaming Engineer - Design and build gesture based games\n- Visual Designers - this is a unique challenge to design UI for gestures based interaction world.\n- Interaction Designers<p>We are still a small team, so you will have opportunity to set direction of the company both eng/product wise.  You will learn, you will be challenged, you will have to strain your brain, and in many cases, solve problems that seem impossible!  If you're up for challenge than send an email to jobs [at] flutterapp.com.","time":1338561554,"type":"comment"},{"by":"e1ven","id":4053176,"parent":4053076,"text":"Waltham, Ma (Near Boston)<p>SavingStar is looking for Ruby web developers to help us transition the world away from paper coupons, and enable a digital couponing future.<p>If you can intelligently discuss page vs. fragment caching, if scaling a website to millions of users sounds like fun and if you enjoy a fast paced, flexible environment with challenges to spare, we might be a good fit. We're specifically looking for people who are \"Full Stack\", from the database to the view, and everything in between.<p>We're looking for someone who has experience creating web apps at Scale (Rails preferred), works well in a Unix Env (Mac/Linux), and enjoys working in a fast-paced, startup environment.<p>Our primary database is MongoDB, so NoSQL/Schema-less experience is great.<p>Shoot me an email ;)","time":1338556310,"type":"comment"},{"by":"RichardPrice","id":4055098,"parent":4053076,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>Almost every technological and medical innovation in the world has its roots in a scientific paper. Science drives much of the world’s innovation. The faster science moves, the faster the world moves.<p>It's widely held that science is too slow, and too closed. We are working on changing that, and re-inventing the way that scientists communicate. The stakes are high. If the inefficiencies in science can be removed, we may be able to accelerate science by a factor of 2, leading to a huge impact for humanity.<p>For more on the problem Academia.edu is solving, see the guest post on TechCrunch last Sunday on 'The Future of Science' by Academia.edu's founder, Richard Price <a href=\"http://techcrunch.com/2012/04/29/the-future-of-science/\" rel=\"nofollow\">http://techcrunch.com/2012/04/29/the-future-of-science/</a>\nAcademia.edu has over 1.3 million registered users, and over 3.5 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,500 academics join each day.<p>We recently raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We need talented engineers to come and help us with the mission. We have a strong engineering culture. We're an 11 person team based in downtown San Francisco. The site is in Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ tools for scientists to share their work faster and more openly<p>★ algorithms to mine our data, and to find out what research is trending in real time<p>★ back-end infrastructure to scale the site on AWS<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture.<p>There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1338577641,"type":"comment"},{"by":"dale-ssc","id":4066137,"parent":4053076,"text":"Socialserve.com - Charlotte, NC - on-site or remote<p>We need a system administrator and a developer!  <a href=\"http://www.socialserve.com/jobs/\" rel=\"nofollow\">http://www.socialserve.com/jobs/</a><p>Socialserve.com is a 501(c)(3) non-profit that has been around for more than a decade developing and operating a variety of web-based software for governments and other non-profits, starting with our popular housing database product at <a href=\"http://www.socialserve.com/\" rel=\"nofollow\">http://www.socialserve.com/</a>. We take pride in focusing on the needs of our users and providing excellent value to our customers.  Our customers love our work and constantly want us to do more for them.<p>We're a small company using Macs on the desktop and Linux on our servers with a bevy of open source software including Python, PostgreSQL, PostGIS, Apache, Git, and Asterisk.<p>System administrator position:<p>You'll be responsible for:<p>* Supporting our Linux servers including web, database, mail, and file servers<p>* Supporting users with Mac desktops and laptops<p>* Supporting our networks<p>* Automating tasks as much as possible<p>* Maintaining relevant documentation<p>We're looking for someone with:<p>* Experience administering Linux servers and the services running on them including e-mail (SMTP/IMAP), web, and NFS services<p>* Networking experience, including a solid knowledge of common protocols like TCP/IP, HTTP, and SMTP<p>* Programming abilities, including shell scripting, so you can automate your job (Python experience is a plus since that's our primary development language)<p>* Excellent communication skills<p>Developer position:<p>We need developers to create and maintain a variety of web-based applications.  Our developers typically work solo or in small teams with a lot of flexibility to design and implement projects however they see fit.  While we're not strict adherents to any single software development methodology, we gladly incorporate processes that produce better software and happier developers including continuous integration, automated testing, and code reviews.<p>We're looking for developers with good knowledge of SQL, web development, basic Unix/Linux usage, and general computer science topics. Knowledge of Python is preferred, though may not be strictly necessary as we've found it pretty easy to pick up as long as you have experience in a couple other languages.<p>If you're interested in either of these positions please send your résumé to employment@socialserve.com!<p>Only candidates with a legal right to work in the United States, and no recruiters, please.","time":1338846571,"type":"comment"},{"by":"myenergy","id":4053454,"parent":4053076,"text":"MyEnergy - Boston, MA - FULL TIME: Data &#38; Rails Engineers, Frontend Devs, and Designers - <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a><p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Frontend Devs to craft and implement amazing and dynamic experiences in our user-facing platform =&#62; <a href=\"https://www.myenergy.com/careers/frontend_developer\" rel=\"nofollow\">https://www.myenergy.com/careers/frontend_developer</a><p>* Data Engineers &#38; Scientists to embark upon ambitious projects leveraging machine learning and AI =&#62; <a href=\"https://www.myenergy.com/careers/data_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/data_engineer</a><p>* and UI Designers (in Boston, or Irvine, CA) to make the whole of the user experience astounding =&#62; <a href=\"https://www.myenergy.com/careers/ui_designer\" rel=\"nofollow\">https://www.myenergy.com/careers/ui_designer</a><p>We're HQ'ed in a conveniently located, sunny two-story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1338560176,"type":"comment"},{"by":"mattlong","id":4054666,"parent":4053076,"text":"Crocodoc’s (YC W10) next-generation HTML5 document viewer reaches tens of millions of users, and our business is growing fast.  Our company was founded by four MIT-educated engineers who have been working together for four years. As we evolve Crocodoc, we’re pushing browsers and mobile devices to the limit and are solving incredibly difficult challenges along the way. Crocodoc's clients include top web companies like Dropbox, LinkedIn, and Yammer.<p>We're looking to expand our talented team. Come join us!<p>Open positions:<p><pre><code>  * Senior Developer\n  * Business Development\n  * Sales and Marketing\n  * Administration and Support\n</code></pre>\nYou can find the job descriptions here: <a href=\"https://crocodoc.com/jobs\" rel=\"nofollow\">https://crocodoc.com/jobs</a>. If you are interested in working at Crocodoc, email jobs@crocodoc.com and tell us why you’d be a perfect fit.","time":1338572972,"type":"comment"},{"by":"brandonb","id":4054267,"parent":4053076,"text":"San Francisco, CA | H1B ok<p>Sift Science uses machine learning to predict user behavior. To start with, we're predicting whether a user about to use a stolen credit card on a web site. There's $4B in credit card fraud per year, and it literally drives online merchants out of business. We're helping our customers take a stand, building a machine learning and data visualization system to detect the bad guys before they strike.<p>We have a strong team of six engineers, including five ex-Googlers and two ex-CTOs. We recently raised an angel round from top investors and we'd love to bring on:<p><pre><code>  * Amazing engineers with expertise in machine learning, data visualization, NLP, and/or scaling distributed systems.\n\n  * An awesome product designer with expertise in data visualization\n</code></pre>\nIf that sounds exciting, shoot us a resume at jobs@siftscience.com!","time":1338567853,"type":"comment"},{"by":"sascea","id":4053405,"parent":4053076,"text":"Sascea (Toronto, Canada) - Full Time, Local<p>We're a self funded startup (funded by existing clients) thats been in business for 1yr.  We have internally built a platform for the rapid development of enterprise SaaS.  Focused entirely on the business market, we are creating web &#38; mobile business apps for our customers. We also dedicate some time to work with local charities and provide them with better systems.<p>We dev mostly in JavaScript; working with NodeJS, MongoDB, jQuery.<p>We're looking for junior, intermediate, experienced developers to help grow out our team.  Our team is relatively small, but super talented.  Everyone is fun to work with.<p>If you think this is a fit for you, email info@sascea.com and include HN: Hiring in the subject line!  Thanks!","time":1338559697,"type":"comment"},{"by":"mlinsey","id":4054746,"parent":4053076,"text":"Crowdbooster is looking for a full-stack engineer in Palo Alto, CA.<p>We've built the best way for businesses to get fast, actionable data about their social media accounts. Tens of thousands of businesses use us every day, including Fortune 500 companies, advertising agencies, coffee shops, sports teams, rappers, politicians, and more.<p>Some more things about us:<p>-We have a legit technical team including two Stanford engineers with backgrounds in machine learning, human-computer interaction, and databases.<p>-We believe in simplicity, minimalism, and creating things that are a joy to use.<p>-We're here to help businesses use social media to build real relationships, not spam, and we’ll never compromise on that.<p>-We're funded by some of the best early-stage investors in the valley, including SV Angel, Charles River Ventures, Y Combinator, and several early investors and employees of Facebook, Twitter, and Slide.<p>What we'd like to see from you:<p>-While your peers might describe you as a rockstar, the term embarrasses you. We love rockstars (many of them are Crowdbooster users!), but we've made a conscious decision to have a culture that revolves entirely around our product, not our egos.<p>-You've wrestled with big data before. Crowdbooster requires storing terabytes of data, extracting insights using statistical learning techniques, and making it available to our users in real-time.<p>-That said, you like working at every level of the stack, not being pigeonholed as a backend developer.<p>-You care a lot about the products you ship, and don't need a manager or \"product guy\" to motivate you to get every detail right.<p>-You're familiar with several parts of our stack, and willing to learn the rest. We use Python, Django, MySQL, Redis, Memcached, jQuery, Protovis, RabbitMQ, Celery, HAProxy, EC2, git, and more.<p>-You have projects of your own to show us. It doesn't matter whether it's an open source project, a startup idea, or just a really fun toy project. Just as long as you shipped it.<p>If this fits you, email jobs@crowdbooster.com","time":1338573949,"type":"comment"},{"by":"lpolovets","id":4053418,"parent":4053076,"text":"* We love Clojure programmers! *<p>Factual is hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai. Remote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our Palo Alto office recently opened so new hires would have a huge impact on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1338559793,"type":"comment"},{"by":"matrix","id":4053251,"kids":[4093684,4071377],"parent":4053076,"text":"Salt Lake City UT - Black Diamond (blackdiamondequipment.com)<p>BD is one of the iconic outdoor industry brands - we make equipment for rock and alpine climbing, skiing, and other outdoor sports. We're not in the software industry, but working here is far more fun than I ever had in that industry. BD has a smart, driven software team that is helping the company grow internationally at double-digits every year.<p>I'm looking for someone with strong SQL and development skills to join my team in a role that's part business analyst and part developer. This is not your typical corporate position - this is an opportunity to play a significant and highly visible role in the company.<p>You don't need to ski or climb to work here, but it's a plus!","time":1338557443,"type":"comment"},{"by":"200902","id":4053580,"parent":4053076,"text":"Cyrus Innovation - Boston, MA<p>Senior Developer<p>Cyrus Innovation (www.cyrusinnovation.com) is a Boston and NYC-based Agile development consulting firm that was founded in 2003. Since then, we have grown into a 45 person company that has never needed outside seed money and believes quality people, practices, and code are the foundation of success. For almost a decade we have been Agile pioneers that have helped both start-ups and enterprises embrace the latest technologies (Rails, Java, Scala, node.js, Groovy, MongoDB, HTML5) and strive for continuous process improvement.<p>So what makes Cyrus different from everyone else aside from competitive compensation, generous vacation, and other great benefits?\n - We believe in strict 40 hour work weeks. No late nights or weekends. Period.\n - We only hire 1% of all applicants and are not afraid to let the bad ones go\n - We give you 40 hours a quarter and a budget to learn and make yourself a better developer\n - We have a diverse set of clients that allow for you to work on many different projects\n - We like to have fun! (Bagel Fridays, Hackfests, Game Nights, and fridge full of beer!)<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. Because happy developers produce the best work, we do everything we can to find, hire and keep the most talented minds in our industry. Whether we are building web applications and products, introducing new technologies and development practices, or just helping a great team get their work done, our spirit of joyful collaboration inspires everything we touch. We are serious about our commitment to our employees and invite you to join our team.<p>If you are interested in learning more or would like to apply for a position, send an email with your resume and cover letter to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1338561648,"type":"comment"},{"by":"jordanlewis","id":4053269,"kids":[4053456],"parent":4053076,"text":"Knewton: New York (NYC) - FULLTIME, INTERN, H1B\n<a href=\"http://knewton.com\" rel=\"nofollow\">http://knewton.com</a><p>We're a funded startup seeking passionate software engineers interested in machine learning, distributed systems, and \"big data\" problems.<p>Investors include Peter Thiel (Founder's Fund), Reid Hoffman, and Pearson, a leader in educational publishing. We were recognized as a Technology Pioneer for 2011 by the World Economic Forum in Davos and one of the top 25 best places to work by Crain’s New York Business.<p>We have about 80 employees right now. We pay full market salaries plus stock options, and you can take as much vacation as you need. Hours are typically 40-50 per week.\nOur product is an adaptive learning platform, which means we use machine learning and \"big data\" techniques to deliver an individualized education to each student. Our eventual goal is to make a high-quality, adaptive education available to everyone in the world. The product is used by Arizona State University right now, and we recently signed a deal with Pearson to power many of their products.<p>We're looking for new members of our technical team who are interested or have experience in:<p>* Using technology to democratize education.<p>* Machine learning and data mining, including approaches such as probablistic graphic models (PGMs), Support Vector Machines (SVMs) and Monte Carlo Markov Chains.<p>* The Java Virtual Machine (JVM) internals and performance optimization.<p>* Big data processing using NoSQL techniques like Cassandra, Hadoop, Hive<p>* Designing, implementing, and maintaining fault-tolerant service-oriented architectures that scale horizontally<p>* Thrift (the RPC protocol).<p>* Cloud computing (Amazon Web Services, Unix) and distributed systems.<p>Interested? Take a look at our job posts here <a href=\"http://jobs.knewton.com/\" rel=\"nofollow\">http://jobs.knewton.com/</a>.","time":1338557724,"type":"comment"},{"by":"eisokant","id":4055101,"parent":4053076,"text":"Web developer for Tyba in Madrid, Spain (www.tyba.com)<p>(EU only)<p>Job description:<p>Do you think CVs are outdated and LinkedIn doesn't do a good job at presenting yourself professionally online? We do! At Tyba we have launched in March a website that let students and young professional easily create their page and show visually their curriculum, their personality and their portfolio with a creative but professional design. We want them to have a website they are proud of, they like to play with and that they can spread around , show to employers or that employers find when they google their name. \nWe want to give recruiters the possibility to browse through high-quality profiles and have a better overview of who they will hire or request for an interview.<p>We work with a freemium model and give the users the possibility to upgrade for TheirName.com and for additional features such as themes against a monthly or yearly fee.<p>We are lucky do all that from a bright and comfortable office located in the thriving and sunny city of Madrid, in the beautiful neighborhood of Salamanca.<p>We are now seeking an oustanding developer to join our international team of gifted talents. Our developers are responsible for exploring Tyba's potential and growing its user base, helping  them to get hired and companies to find talents. This is an amazing opportunity to be part of an exciting project, to grow with the company and have an impact on numerous people's lives.<p>Responsibilities<p>At Tyba, you will work on a fast evolving product  within our small team and together with our developer Tristan, our designer Zuri, our Manager Eiso and occasionally with our back-end developer Parminder located in the US.<p>Our work atmosphere is that of a startup, casual. Everybody is aware and sometimes involved in the startup different aspects : the sales to the public and to universities, our high-level customer service, the decision making and the product development.<p>As one of the two developers, you will have the chance to have a major impact on the product. We have a long list of small to large features and improvements we would like to implement and that you will work on. New ideas will be also coming on the way from the whole team. We will constantly test the product, try to get as much feedback as possible and think about ways to make it better.<p>On the technical aspect we use the best tools we find out there to date to develop the product. We work mainly with PHP on the server side, JavaScript using the jQuery library on the client side and MySQL for the database. We might have to use Python or Ruby on the server side in the future.\tOn the back end we run our nginx server with Amazon Web Services (EC2) and we store our files using their Content Delivery Network S3.<p>We work with several APIs, especially Google Analytics and Google Charts APIs to display the users' website analytics. Facebook API to allow the user to connect to Tyba with Facebook and to share or post content on Facebook. Namecheap and DNS Made Easy APIs to buy and propagate domains chosen by the users. In the future we will certainly use others. Since all of them have good libraries, there is usually a fast learning curve.<p>We use Github for version controlling to have a nice and clear workflow.<p>To give you an idea of what we are doing on a daily basis, here is a list of recent projects our developer has been working on:<p>- Creating a referral system that allow the user to select their Facebook friends who they want to post on their walls. We use a unique link for each user and award points for new visitors or users brought. \t\t\n- Building a search tool that allow users and potentially recruiters to browse through the users profile according to specific criteria.\n- Creating an expanding work module that let the user upload presentations, videos, documents or create an image gallery to illustrate their work experience.<p>Requirements<p>- Engineering or scientific studies.\n\t- Fluency in English.\n\t- Rigorous programming skills, the knowledge of a strict object-oriented languages such as C++ is a big asset.\n\t- Good knowledge of PHP, JavaScript (jQuery), AJAX and MySQL. Having worked with Github and with Google or Facebook APIs is an asset.\n\t- Fast learner, you should be willing to pick up a new programming language if we need it.\n\t- Showing flexibility in the work development, you should not be scared to restart part of the project from scratch if we realize there are better ways to go do it.\n\t- Being exited about the product, it can be in a critical way of course but you should believe in the potential of our startup.\n\t- Dedicated to make the Product better and get users excited about it.\t\n\t- Hard-working, good communicator and having excellent abstraction and critical skills.<p>To apply please create a profile on <a href=\"http://tyba.com\" rel=\"nofollow\">http://tyba.com</a> and send us your Tyba site with a cover letter. You can either upload your CV on your Tyba site or send it to us separately.","time":1338577665,"type":"comment"},{"by":"thingsilearned","id":4053865,"parent":4053076,"text":"SOMA San Francisco, CA - Full time<p>Chartio is hiring front, backend and sales/support engineers.  We're building a new interface to data bringing analytics into the hands of a whole new group of people. We've got a talented and passionate team and need to expand.<p><a href=\"http://chart.io/jobs\" rel=\"nofollow\">http://chart.io/jobs</a><p>Send resumes to jobs@chart.io","time":1338564021,"type":"comment"},{"by":"bdimcheff","id":4053768,"parent":4053076,"text":"Olark - YC S09 - Ann Arbor, MI (<a href=\"http://olark.com/jobs\" rel=\"nofollow\">http://olark.com/jobs</a>) is looking for a DevOps engineer.<p>We're growing fast and we need somebody to help our infrastructure keep up.  We're profitable and you'd be #12 on the team.<p>You'd be doing infrastructure automation with puppet, helping us scale our messaging infrastructure so we can grow, and building tools to help us monitor our servers and our business.<p>For the curious, we use: Python, Ruby/Rails, Thrift, ejabberd, rabbitmq/amqp, mysql, mongodb, couchdb, redis, node, and more!<p>Check out the link above for more info on the position and to apply.","time":1338563145,"type":"comment"},{"by":"mikebabineau","id":4055078,"parent":4053076,"text":"Rumble - SF Bay Area (Redwood Shores)<p>We're a new, well-funded startup making and publishing AAA games for browser and mobile. We're making real games for a large audience. Not ultra casual, not niche-y.<p>Our first title is a cooperative multiplayer 3D action-RPG. Think Diablo on Facebook. But free-to-play, and no big download. No obscure plugins, either -- we use Flash, but you wouldn't believe it. Adobe says they've never seen a higher-quality in Flash.<p>Seriously, check out our trailer: <a href=\"https://www.rumblegames.com/kingsroad\" rel=\"nofollow\">https://www.rumblegames.com/kingsroad</a><p>We're in closed beta. Let me know if you want to give it a test drive.<p>Rumble is backed by Google Ventures and Khosla Ventures ($15mm series A). We have one of the strongest founding teams the gaming industry has ever seen. (No, really: <a href=\"https://www.rumblegames.com/about/our-team\" rel=\"nofollow\">https://www.rumblegames.com/about/our-team</a>)<p>We're both a developer and publisher of games, and we need help on both sides. If you want to develop the next generation of top-quality games, or you want to build and scale infrastructure to 1mm+ concurrent players, this is for you.<p>Positions: <a href=\"https://www.rumblegames.com/careers\" rel=\"nofollow\">https://www.rumblegames.com/careers</a><p>Engineers<p>* Platform -- Java/Groovy/Grails/AWS (esp. Senior/Architect)<p>* Web -- HTML+CSS+JS+(PHP/Python/Ruby)<p>* Game -- Flash+AS3/Java/C/C++/C#<p>* Data -- Hadoop/R+ML/Stats<p>Other<p>* Producers<p>* Product Managers<p>* Analysts<p>* Artists<p>* Designers<p>Drop me a line if you're interested: mike.babineau@rumblegames.com","time":1338577422,"type":"comment"},{"by":"jesseendahl","id":4055023,"parent":4053076,"text":"C&#38;T Publishing is looking for a Mac IT/IS Specialist in Concord, CA (East Bay--about 45 minutes from San Francisco).<p>About You: You have a passion technology, love to problem-solve, have a desire to grow and continue to improve your skill set, and understand how IT can impact the big picture. You have strong analytical and troubleshooting skills, especially under pressure. You have great communication skills with both technical and non-technical colleagues. Finally, you have a love for technology combined with curiosity and dedication. If this sounds like you, then you should apply.<p>About Us: We are an established craft book publishing company that understands the value of great IT. We are an all Mac environment, with some exceptions. We are an equal opportunity employer.<p>Description: The IT/IS Specialist person's primary area of responsibility is to support the staff by maintaining their computers and the servers that they work from, so that they can accomplish their work utilizing the tools provided as efficiently and productively as possible.<p>Ongoing Goals: Maintain computer systems (hardware and software) ensuring that all operate at maximum efficiency, and ensure that all data is accessible and secure.<p>Duties &#38; Responsibilities: This position is authorized to recommend purchases, make approved purchases and install approved hardware and software.<p>• Solve day-to-day help desk issues.<p>• Ensure all IT infrastructure and configurations are documented, create SOPs for help desk issues and position tasks, and post SOPs on file sharing server.<p>• Cross-train staff members to handle IT issues in absence.<p>• Software/hardware recommendations and make approved purchases.<p>• Maintain company hardware and software purchasing records and system inventory.<p>• Create annual IT budget with monthly and departmental breakdown. Reconcile actual spending with budget at end of each month and at end of year.<p>• Software updates, installation and troubleshooting for ~50 client computers and 4 servers.<p>• Perform hardware installations including replacing RAM and hard drives.<p>• Maintain all back-ups (tape and cloud) and hand off tapes to manager for offsite storage every week.<p>• Ensure that all servers, storage devices, internet, phone system, VPN access and firewall are operational.<p>• Troubleshoot printing devices as necessary.<p>• Responsible for new employee onboarding. Ensure that all accounts (email, file sharing, etc.), phone, and computer are work-ready by new employee start date.<p>• Reset all passwords, clear off and back up staff-member computer when employees leave the company.<p>• Maintain and troubleshoot PRI/VOIP based phone system (Fonality).<p>• Maintain filesharing server: FreeBSD/ZFS/Netatalk/LDAP.<p>• Work on strategic objectives and other duties as assigned.<p>• Must be available on-call for highly critical IT issues.<p>Knowledge &#38; Experience<p>Education/Experience: CS degree or 1-3 years experience.<p>Requirements:<p>• Thorough knowledge of OS X (10.6--10.7) required. We are an almost exclusively Mac based environment, so this is an absolute must.<p>• Experience with Mac based computer imaging.<p>• Some command line experience.<p>Pluses:<p>• Experience with imaging and/or configuration management software such as JAMF suite, Puppet, DeployStudio, or Radmind.<p>• Experience with FreeBSD.<p>• Apple Certified Technician.<p>• Experience with Nagios.<p>• Experience with HTML, CSS, and XML.<p>• Experience with Adobe CS Suite a plus--especially InDesign.<p>• Experience with Filemaker a plus.<p>• Experience with Acumen (4D) a plus.<p>• Experience with Universal Type Server or other font server software a plus.<p>Physical Requirements:<p>• Able to talk and hear.<p>• Able to work on computer for 40 hours per week.<p>• Able to walk up to 1 mile per day.<p>• Able to stand up to 2 hours per day.<p>• Able to lift up to 40 pounds (think 27\" iMac, or a server).<p>Please contact Jesse Endahl about this position by emailing it-position@ctpub.com<p>Please attach your resume, along with a cover letter outlining why you are the right person for this job.<p>Compensation: 40 hours per week. $40,000 - $45,000 annual compensation, plus benefits.","time":1338576954,"type":"comment"},{"by":"danberger","id":4057982,"parent":4053076,"text":"Social Tables is!<p>Social Tables, a DC-based, venture-backed startup is looking for an experienced Engineer to join our growing team. We’re rendering dust templates through our Node backend and writing frontend SVG and HTML5. The ideal candidate...<p>- Has at least 5 years software architecture experience.\n- Holds a computer science, computer engineering, or comparable degree.\n- Loves building beautiful, well-designed products.\n- Enjoys teamwork and realize its a competitive advantage.\n- Lives startups and be excited by the higher reward they may bring.\n- Thrives in environments that foster entrepreneurship and personal growth.<p>About our software<p>Social Tables is changing the way events are planned and attended. Our software platform helps event and meeting professionals design and manage their events. It has social features that allow their guests to interact beforehand or afterwards. It has been used to add 80,000 guests for over 2,000 events and has been featured in over 40 publications.<p>About us<p>We are a team of 5 working out of DC's first tech accelerator, The Fort, two blocks away from the White House. Our advisors include some of the most recognized pros in the industry and we're backed by top-notch angels from the Mid-Atlantic.<p>How to Apply:<p>We're serious about compensation: salary and equity commensurate with experience. Shoot me a note (dan@socialtables.com), a note with a couple lines about yourself and your LinkedIn page so we can get the conversation started. Thanks!","time":1338642461,"type":"comment"},{"by":"jasonshen","id":4055100,"parent":4053076,"text":"We're hiring our first engineer at Ridejoy (YC S11), a community marketplace for sharing rides.<p>We care deeply about working with the best. So we are looking for a friendly engineer with an itch to tackle a huge unsolved problem in order to make the world a better place. We have cash, revenue, and a growing community of users who love us.<p>We've raised $1.3M in seed funding we're located in San Francisco in SOMA between Caltrain and BART.<p>Interested? Learn more, and apply here: <a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a>","time":1338577658,"type":"comment"},{"by":"dmarble","id":4053856,"parent":4053076,"text":"Spurfly - Palo Alto, CA or Arlington, VA - LOCAL or REMOTE<p><pre><code>    • Designer (Android and iOS primarily, as well as web)\n\n    • Front-end developer for desktop web and/or mobile web\n</code></pre>\nIf you happen to be both of the above, that'd be awesome. Help us scale and meet demand for real-time location-aware planning. Our focus is on groups and events (\"spur of the moment, on the fly\"). We've launched the first version of our iOS app and are working on a web and Android version.<p>The founders are straight shooters who value clear communication and getting stuff done. We're obssessed with creating a product that fills what we see as a major hole in social networking software -- helping people more efficiently connect in real-life with close networks so they can spend more of their time building and enriching real relationships.<p>Technologies:<p><pre><code>    • frontend: coffeescript, jQuery, backbone.js, socket.io, compass\n\n    • backend: python, django, gevent, gunicorn, nginx, postgresql\n</code></pre>\nImmediate front-end needs include many web design tasks and coffeescript/js templates for our single-page architecture web site. We're also on the lookout for a good mobile app designer to help us design our first Android release and update our iOS app UI as we gather feedback from users.<p>Support what's going to potentially be a wild ride as we do launch events over the next few months.<p>gmail - davidmarble (main tech guy on the founding team)","time":1338563940,"type":"comment"},{"by":"urlwolf","id":4089768,"parent":4053076,"text":"Berlin (Germany), CTO/ lead developer<p>We are a funded (seed) startup working on a customer analytics tool for online retailers.We are two people looking for a head of development / CTO. We have offices in Berlin, funding for one year and the package includes very generous shares for the right candidate. We use lean startup methods, and can systematically test hypotheses on any market. Hundreds of customer interviews already done. Our approach is the ‘startup of startups’, that is, iterate fast and discard what doesn’t work, even if the new product looks like a completely new application (and startup!).<p>What we do:<p>-----------<p>Customer Lifefitime Value (CLV) is the mythical ‘magic number’, the amount of money a particular customer will ever bring in. Knowing your CLV makes it trivial to:\n- optimize marketing spend for different inbound channels.\n- identify your highest value customers, \n- identify those in danger of never coming back.<p>Most shops have a ‘gut feeling’ of what their CLV is, but no way of knowing for sure. Yet this is the number that would make the largest impact to their bottom line, if only it was possible to have it. Ah! Predicting the future is hard, right?<p>It turns out CLV can be computed with surprising accuracy (10% error) at the individual level. At Fluidshopping, we use sophisticated bayesian models to estimate CLV. We look beyond what has happened in the past (which you get with say google analytics). CLV changes often, due to your marketing actions, season, or changes in the market. We retrain our models weekly to reflect those changes, and then suggest the actions that would make the largest impact (email campaigns, popups with offers triggered by user behavior on your site, etc).<p>Requirements:<p>-------------<p>You can apply with any language. But we need code samples. Let us see something you build; please explain what it does and how to run it if it’s not obvious. We prefer github projects. Do not send code samples that do not make sense out of context. We are looking for a difficult problem you solved, or a common problem that you solved in a novel way.<p>You need to be within 5 years of your last academic appointment, or graduation. That is, if you graduated from university more than 5 years ago, you are not eligible. You can also apply if you had a job in research settings within the last 5 years. We do not care about you having a title, but we are funded by the government, and they do. They want to see someone with a compSci-related title. We are really sorry in advance if the requirement excludes you, a great hacker who doesn’t have a title.<p>Responsibilities:<p>-----------------<p>Your responsibilities will be to work on new key features, help us scale, contribute to the product and optimize performance. You’ll be the CTO in an agile development environment. Customer interviews tell us our solution attacks a very obvious pain point for online retailers, a large market that is ripe for disruption. As a CTO, you will make decisions to make sure our solution ‘just works’ for clients. We have excellent talent for both front-end and back-end development, so you are free to concentrate on the problems that matter most (architecture, models, etc). But of course, in a small team you will need to write production-quality code yourself.<p>Nice to have:<p>------------<p>Mongo or similar NoSQL db\nJavaScript, Backbone.js, node if you have used it in production\npython/django, ruby/rails or any other web framework\nFamiliarity with HTML5 (websockets)\nR or any other data-friendly language with lots of libraries\nFamiliarity with probability theory and modeling<p>Perks:<p>------<p>Work from home (optional)\nStock options in two-digit range\nDog\nTerrace with barbecue\nIn the center of the Berlin startup ecosystem\nContinuous deployment, strong testing culture<p>contact: jobs@fluidshopping.com","time":1339288073,"type":"comment"},{"by":"ipster","id":4053166,"parent":4053076,"text":"AllTrails - Consumer / Outdoors<p>FULLTIME Rails / Mobile Engineers, Community Manager, Sales Account Executives<p>San Francisco (preferred) / Los Angeles / NYC / Remote / H1B\n<a href=\"http://alltrails.com\" rel=\"nofollow\">http://alltrails.com</a><p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people rediscover the outdoors and having lots of fun in the process. Camping benefits, anyone?<p>We just launched our brand new site in partnership with National Geographic (<a href=\"http://alltrails.com/partners/national_geographic\" rel=\"nofollow\">http://alltrails.com/partners/national_geographic</a>) and have the #1 outdoors app in the Apple and Android stores (try searching for 'Hiking').<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book on the team.\nWe're looking for exceptional full stack Rails and mobile developers (Android and iOS). We're also hiring for a community manager and sales folks.<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you!<p><a href=\"http://alltrails.com/jobs\" rel=\"nofollow\">http://alltrails.com/jobs</a> or jobs@alltrails.com","time":1338556164,"type":"comment"},{"by":"trefn","id":4054864,"kids":[4055139],"parent":4053076,"text":"San Francisco, CA<p>FULLTIME<p>Mixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http://mixpanel.com</a>) is the most advanced advanced analytics platform available for web &#38; mobile applications. We're making millions in revenue, we're cash-flow positive, and we're growing like crazy (on track to hit 7 billion events this month, up from 5 last month). We also just raised a $10M round from Andreessen Horowitz.<p>We're hiring for a number of positions, but I'd like to highlight a few:<p>1. Solutions Architect - hybrid support/sales/marketing/engineering role. Really awesome for developers who want to do more client-facing stuff. See <a href=\"http://mixpanel.theresumator.com/apply/Eoh3qJ/Solutions-Architect.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/Eoh3qJ/Solutions-Arch...</a><p>2. Backend/ops engineer - we have a large amount of infrastructure (~200 servers) for a company our size &#38; need someone to manage it. This role is all about automation. See <a href=\"http://mixpanel.theresumator.com/apply/Xm0tLy/Software-Engineer-Operations.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/Xm0tLy/Software-Engin...</a><p>3. Office manager - looking for someone super smart &#38; organized to keep the wheels greased around here. No job post yet, but you can email me directly.<p>If you're interested, please email me - tim@mixpanel.com.","time":1338575280,"type":"comment"},{"by":"zg","id":4054521,"parent":4053076,"text":"LONDON -- Web Developers (front and back-end)<p>TrialReach is a VC-backed startup solving a huge problem in the healthcare industry.<p>Our recent (tongue-in-cheek) recruitment video: <a href=\"http://www.youtube.com/watch?v=VyRxOTJXBII\" rel=\"nofollow\">http://www.youtube.com/watch?v=VyRxOTJXBII</a><p>• This is a company you can be proud to be a part of.<p>• You’ll be working alongside a small but highly talented multi-disciplinary team.<p>• Our gorgeous riverside offices in Richmond provide a change from the urban jungle whilst being just 10mins from the tube.<p><i>The Role:</i><p>Our stack is Linux/Postgres/Python/Django. One day you might be translating visual designs into HTML, the next day you might be working our search and patient matching algorithms. The one certainty we can offer you is that you’ll never be bored.<p>Ideally we're looking for people to work on our whole stack, but we're also happy to talk to front-end (HTML/CSS/JS) specialists.<p>If you don't have experience with Python but have worked on something similar (Ruby, PHP etc) then that's fine too!<p><i>Where do I apply?</i><p>We're happy to consider full or part-time applicants as wells as students looking for internships. You must have the right to work in the UK.<p>We're starting interviewing candidates from next week, so if you're interested, please get in touch - zeshan at trialreach.com","time":1338571179,"type":"comment"},{"by":"francesca","id":4054032,"kids":[4054150],"parent":4053076,"text":"New York, NY/Palo Alto, CA/London UK - Software Engineers - Fulltime<p>10gen(With a recent funding round from NEA, Sequoia, USV, Flybridge funded) are looking for C++ engineers to work on the MongoDB kernel, building new features for MongoDB, working with MongoDB users such as foursquare, eBay and craigslist. We are also looking for Java engineers to work on our Applications team and Ruby, Python, Node.js and PHP engineers to work on our drivers team.<p>More details and how to apply 10gen.com/careers","time":1338565474,"type":"comment"},{"deleted":true,"id":4053147,"parent":4053076,"time":1338555955,"type":"comment"},{"by":"bijanv","id":4054364,"parent":4053076,"text":"Toronto, Canada - Full-time<p>EventMobi - <a href=\"http://eventmobi.com\" rel=\"nofollow\">http://eventmobi.com</a><p>We're a self-funded team of 16 (5 engineers) and we develop a platform that allows event planners to create mobile apps for their own attendees.<p>We're looking for talented and experience engineers to help build out new architecture and features, help manage / scale our infrastructure and innovate our mobile experience. We take testing, well architected code very seriously and are always looking at ways to incorporate new tech into our platform (we're using backbone to build offline capable mobile web apps, node and socket.io to enable real-time communication between attendees / push notifications, Redis based caching for a few features, etc)<p>Check out <a href=\"http://eventmobi.theresumator.com\" rel=\"nofollow\">http://eventmobi.theresumator.com</a> for the positions we're looking for and more detail!<p>In more detail EventMobi is the leading mobile platform for shows and conferences, having been used by over 700 events, nearly 2 Million users, and are served in 7 languages across 5 continents. Clients like Disney, Intel, Motorola amongst others have used EventMobi to disrupt and enhance the attendee experience at their events.","time":1338569077,"type":"comment"},{"by":"vrikhter","id":4054942,"parent":4053076,"text":"NextPunch / B2B SaaS / Sales [Manager] (first sales hire)<p>San Francisco, CA.<p>NextPunch (<a href=\"http://www.nextpunch.com\" rel=\"nofollow\">http://www.nextpunch.com</a>) is a product for businesses with mobile service employees to keep track of where their employees are working from, what they're working on, and the hours they are working.<p>With 21 MILLION mobile service employees in the US, our market is an extremely large and fragmented SMB market.  We're looking for our first sales hire to help educate the market about our product!  We've gotten great responses from our early [paying] customers and eager to go get more.<p>About the job:<p>- Work directly with founder (me) to build sales process.<p>- Heavy focus on one vertical to start and then build sales process for different vertical markets.<p>- Expect to start hiring for sales team in the next 4-6 months.<p>- Set compensation structure, quotas, and operational process for all new sales hires.<p>About you:<p>- A couple years experience in selling B2B SaaS products.<p>- Experience with SMB market.<p>- Managed a team of 2-10 sales people.<p>- Experience with setting compensation models (nice to have).<p>send email directly to vladik at nextpunch dot com. Thanks!","time":1338576157,"type":"comment"},{"by":"jarnold","id":4053402,"parent":4053076,"text":"FULLTIME Python Engineers, Systems Engineers\nSan Francisco (preferred)\nSwiftStack - <a href=\"http://swiftstack.com\" rel=\"nofollow\">http://swiftstack.com</a><p>SwiftStack is building out large-scale object storage systems based on the OpenStack Swift project. Our customers are top 5 web properties and fortune 50 enterprises who want something that works like AWS S3 / Rackspace Cloud Files -- but provide it as an in-house offering. SwiftStack provides a distribution of OpenStack Swift and controller software to manage a deployment.<p>We are looking for engineers at all levels of the 'stack'. Python is the lingua-franca. Our management controller uses django, zeromq, graphite and all the math required to run a distributed storage system. To build the runtime component we are well versed in linux tuning, systems programming, load balancing, authentication, and filesystems.<p>We're big contributors to open source. Not just in OpenStack, but also the tools we use to deliver our product. Check out our github page: <a href=\"https://github.com/swiftstack\" rel=\"nofollow\">https://github.com/swiftstack</a><p>Please email me at joe@swiftstack.com if you're interested. Thanks!","time":1338559680,"type":"comment"},{"by":"mbeebe","id":4055152,"parent":4053076,"text":"Mountain View, CA - Matterport is looking for a Full-stack Web Developer and Computer Vision Engineer<p>Web Developer:<p>Scanning is only half of the Matterport experience. What happens after scanning — viewing, annotating, and publishing scanned 3d content — is essential to giving users a seamless and pleasurable experience.<p>The Work:<p>Build out the Matterport website and server infrastructure, including both the database of scanned 3D content and the user interface for browsing it. You would be the first web developer we hire, so you will have a chance to set your choice of language, framework, and best practices for web development at Matterport.<p>Preferred Skills:<p>Well-versed in Ruby on Rails.<p>Past experience scaling a website from inception to large numbers of users while maintaining reliable performance.<p>Past experience doing user experience design for new categories of product.<p>---<p>Software Engineer with Computer Vision &#38; Algorithms focus:<p>A creative Engineer who can invent new algorithms, not just apply known techniques. There are still big, interesting problems to solve which are central to our product.<p>The work:\nYou will be working on 3D alignment and mesh reconstruction algorithms, improving robustness and quality. The ideal candidate is comfortable with messy data and uncertain results.<p>Preferred skills<p>Past experience in computer vision or a related field such as machine learning.<p>Experience with high-performance code (optimization, parallelization, CUDA) is a plus.<p>Very comfortable coding in C++.<p>---<p>A bit about us:\nMatterport (YC W12) creates a low-cost easy-to-use 3D scanner that lets you turn reality into 3D models.<p>We scanned Y Combinator shortly before demo day -- you can see the scanning process and the automatically generated 3D model on our demo video starting at 0:40  <a href=\"http://matterport.com/#video\" rel=\"nofollow\">http://matterport.com/#video</a><p>We're proud to be creating something incredibly <i>useful</i>.  This is going to become a vital tool for the millions of professionals who work with 3D spaces on a daily basis, including construction companies, film studios, building operators, real estate companies, industrial engineers, remodelers, architects, retail designers, insurance companies, and more.  Our site is being deluged by requests for new uses for the system every day.<p>We're starting our beta testing program with several large companies, and we've already finished raising a very sizable seed round.<p>We are all experienced founders and were previously early employees at PayPal and Google.  We like to work hard and get stuff done.  We are intellectual and curious.  We know how to communicate and get along. We have fun. We feature a brogrammer-free workplace. :-)<p>Most of all, we're driven to change the world in a deep and meaningful way.<p>We feel that it's worth giving larger than typical equity compensation for early employees -- we want you to do really well if the company does really well.<p>jobs@matterport.com - put a 1 in the subject for the vision position or a 2 for the web development position.","time":1338578155,"type":"comment"},{"by":"mikeryan","id":4053994,"parent":4053076,"text":"San Francisco, CA<p>A Different Engine is looking for a UI Engineer and INTERN in our San Francisco office.<p>ADE is a small interactive agency with offices in San Francisco and New York who focuses on designing and building the next generation of user applications for our customers. We build apps that run in web browsers, on mobile devices and on emerging platforms such as connected TVs.   We're looking to expand our team.<p>A UI Engineer will work with our design and development teams in building applications across a variety of platforms. They’re apprentice craftsmen who take the vision from our design team and turns it into a reality for our clients.<p>This is a junior or entry level UI engineer  (Freelancer? Drop us a line too...)<p><i>Here’s what’s cool about working for us.</i><p>1.  You’ll have fun.  We’re fun and we work with fun clients like NBC, CBS, the UFC.  We might have some late nights but we’ll keep it interesting.<p>2. You’ll become a better software engineer.   There’s really no choice, from project to project you might be working in Javascript and HTML to pure Javascript, you might need to hack together a php script and then update some Objective-C. We don’t expect you to know how to do all this when you start, but you’ll learn.  That’s how we’ve done it.<p>3. You’ll ship.  Again small shop, fast projects that ship. You will  be able to show your friends an app on TV or your mobile device and say, “I built that”.<p>4. If there’s a platform out there you want to learn (Xbox, Nodejs, iOS, Android?) we’ll probably give you chance to learn it.  We work on the cutting edge and we aren’t tied to large legacy systems. This gives us the ability to use whatever tools we like. We use Redis, Nodejs, Websockets etc.  In particular we do a lot of work on embedded platforms using WebViews (and will likely do more as Moore’s law keeps going on mobile devices) so HTML5 skills are great<p><i>Here’s a few things that we can’t provide.</i><p>1. An Exit. We’re not a startup, we’re an agency so there’s no big exit. That being said we do do bonuses at the end of the year based on how well we’ve done.<p>2. Stable work on a single project working on a single language or framework.    Again not what we do, we tend to do short 2-6 month engagements on projects for our clients we design an app, build it and then ship it.  We do it right and we do it fast.<p>3. A lot of management overhead.  We’re small (tiny really - you’d be one of our first hires) so we can’t watch over you all the time. Best if you’re somewhat self-sufficient.<p><i>Nice to have?</i><p>Here’s some skills that will help you get this job (a few of these would be nice).<p>1. \tHTML - in particular its good to know new HTML5 display elements.<p>2. \tCSS(3)<p>3. \tJavascript - this is our primary language. But we’re \nnot snobby about it.<p>4. \tObjective-C<p>5. \tAndroid<p>Think you’ve got what it takes? Drop us a line!  Please if your resume isn’t long take some time to write us a quick note or cover letter telling us why you’re the right person for this job and why you’re interested.<p>jobs@adifferentengine.com","time":1338565134,"type":"comment"},{"by":"capkutay","id":4054766,"kids":[4067567],"parent":4053076,"text":"WebAction (<a href=\"http://www.webaction.com\" rel=\"nofollow\">http://www.webaction.com</a>) - Full Time or Intern in Palo Alto, CA (Downtown Palo Alto)<p>WebAction is a start-up looking to fill the gap between big data and transaction data. We have our initial funding and we are now building out our core engineering team. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today.<p>We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>Skills you should have or at least be interested in learning:<p>Large-scale distributed systems,\nHighly available, highly scalable architectures,\nHadoop (MapReduce / Pig / Zookeeper),\nData Serialization (Avro / Thrift / Protocol Buffers),\nBytecode generation and injection,\nNoSQL / BigData (MongoDB / Cassandra / HBase),\nReal-time messaging (0MQ / Kestrel / Kafka or similar),\nReal-time event processing,\nContinuous Queries<p>If you are interested in joining, email us at jobs@webaction.com","time":1338574314,"type":"comment"},{"by":"uniwiz","id":4076025,"parent":4053076,"text":"Bottomline Technologies - Portsmouth, NH / South Portland, ME / Wilton CT - Full Time local<p>Position: Sr. System Administrator<p>The Senior Systems Administrator will be an integral part of the team that is responsible for the installation, configuration and maintenance of mission critical SaaS applications providing payment and legal spend management services. This position will be a key role for the SaaS team, providing technical leadership, driving execution of complex technical initiatives, and providing proactive communication and documentation.<p>You:<p>- Demonstrated technical leadership experience evaluating and recommending process and infrastructure improvements.<p>- Excellent communication and document skills.<p>- Proven experience in driving infrastructure projects in a matrixed organization<p>- Management of Linux and Windows hosts on virtual and physical Intel platforms. Management of associated storage and backup infrastructure.<p>- Management of software commonly found in an SaaS application infrastructure, such as Apache, Tomcat, Weblogic, IIS, Active Directory, DNS, SMTP, etc.<p>- Demonstrated experience managing operational security and stability of SaaS applications.<p>- Support of 24x7 SaaS web applications including on-call<p>-----------------------------------------------------------------------------<p>Position: Application Engineer<p>The Applications Engineer is part of an autonomous, fast-paced team that works to ensure successful software deployments across Bottomline’s suite of SaaS/cloud solutions. This position will combine a strong technical background with great organizational and communication skills to ensure successful deployments with minimal manual effort. They will bring a sense of urgency to troubleshooting, identifying root cause, establishing priorities, and closing issues, as well as working with internal teams to appropriately respond to customers’ needs.<p>You:<p>- 2-3 years of related experience or proven technical skills automating processes and procedures.<p>- Understanding of standard concepts, best practices and procedures for Release Engineering.<p>- Experience and understanding of change management processes.<p>- Knowledge and experience in scripting languages such as shell, Perl and Python.<p>- Experience with Apache, Tomcat, Lotus Notes, WebLogic, WebSphere, IIS, MSSQL, DB2, Oracle<p>- Experience supporting and troubleshooting server operating systems, web servers, application servers, and database systems.<p>- The ability to configure and deploy Java applications in a SaaS environment.<p>- Strong attention to detail with excellent organization skills as well as excellent written and verbal skills<p>-----------------------------------------------------------------------------<p>To apply: Send an email to zmitrovic@bottomline.com with your resume and couple lines about yourself.","time":1339014478,"type":"comment"},{"by":"vecima","id":4053372,"parent":4053076,"text":"Saskatoon, SK, Canada - Vecima Networks (www.vecima.com)<p>Software Developer (full-time, no remote)<p>Embedded C developer in Linux userland applications.  Vecima does full-stack development in-house including: metal works, PCB design, FPGA development, Micro-controller development and Linux kernel and userland development.  Work in a small software team in conjunction with the above larger cross-functional team to bring Cable products to market.<p>E-mail: human.resources@vecima.com<p>--\nVecima Networks designs and manufactures products that enable broadband access to cable, wireless and telephony networks. With global deployments, a proven product library and a team of more than 600 employees worldwide, we provide our customers with advanced solutions.<p>Vecima's extensive Research and Development initiatives result in pioneering technology and intellectual property that flows directly into our cutting edge product design and manufacturing. We pride ourselves on innovative solutions and our continually expanding library of designs.","time":1338559310,"type":"comment"},{"by":"sbisker","id":4053633,"parent":4053076,"text":"<i>[We've modified this posting from last month to put a focus on our new San Francisco office in Lower Nob Hill, where we'll be doing most of our hiring. We're also happy to announce a $4M Series A from the likes of General Catalyst, SV Angel, Lowercase Capital and Lightbank, to name a few. <a href=\"http://techcrunch.com/2012/04/23/data-focused-locu-raises-4m-series-a-from-general-catalyst-lowercase-lightbank-sv-angel/\" rel=\"nofollow\">http://techcrunch.com/2012/04/23/data-focused-locu-raises-4m...</a>  -sbisker]</i><p>San Francisco, CA - Full Time or Intern Web Developer at Locu (<a href=\"http://www.locu.com\" rel=\"nofollow\">http://www.locu.com</a>)<p>Front-enders, \"desingineers\" and full-stack all welcome for this position - as long as you enjoy hacking on cool new products and features. :D (We're not explicitly recruiting for pure backend or pure design positions right now, but we're open to resumes there as well - see <a href=\"http://locu.com/#jobs\" rel=\"nofollow\">http://locu.com/#jobs</a> for details. If you're a perfect fit, we'll find a way to make it work.)<p># Exceptional software engineering talent<p># Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills, or the ability to learn quickly<p># Experience with Python / Django is a plus<p># Previous experience building rich, interactive websites<p># Basic design skills (Photoshop), ability to work with designers<p># Experience in designing dashboards and user interfaces is a plus<p># Previous start-up experience is a plus<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We are about to launch MenuPlatform &#60;<a href=\"http://www.menuplatform.com&#62;\" rel=\"nofollow\">http://www.menuplatform.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>Interested? Drop us a line at jobs@locu.com. Please specify which position you're applying for, as well as \"HN\", in the subject of your letter. Learn more about our open positions at <a href=\"http://www.locu.com/#Jobs\" rel=\"nofollow\">http://www.locu.com/#Jobs</a><p>-------------------------------------<p>Founded less than a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best angel investors in the country.<p>We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 10 people with very diverse backgrounds, and growing.","time":1338562070,"type":"comment"},{"by":"sethbannon","id":4053521,"kids":[4053899],"parent":4053076,"text":"Want to save the world with your code / design?<p>Join our NYC social good for-profit. We're venture backed by some of NYC's top investors, have quickly growing revenue streams, and are helping great non-profits do what they do better.<p>Check out our openings here: <a href=\"http://jobs.amicushq.com/\" rel=\"nofollow\">http://jobs.amicushq.com/</a><p>New York, NY. Fulltime.","time":1338560869,"type":"comment"},{"by":"amacinho","id":4056902,"parent":4053076,"text":"Junior Research Engineer, Crimson Hexagon, Boston, MA.<p>Do you have excellent programming skills in Java and at least one of the following languages: Python, Ruby, or R? And an interest/demonstrable knowledge in machine learning, data mining, and statistics?<p>We are looking for a Junior Research Engineer who will be part of our research team. You will be responsible to research, investigate and test new technologies for big data storage, processing, and analytics. In particular, you will build scalable systems that can efficiently process petabytes of data, build and maintain storage systems that are continuously updated and require holding tens of billions of records each with millions of fields. You will work closely with the research scientists in a challenging and nurturing environment.<p>Requirements:<p>Successful candidates will be able to demonstrate achievement in some or all of the above, and you will also be heavily evaluated for your attitude, approach and other intangibles.  With that, more definitive criteria for the ideal candidate follow:<p>* Working with large datasets<p>* Unix command line tools<p>* MapReduce paradigm, Hadoop and HDFS<p>* HBase, Cassandra, MongoDB or similar key-value storage systems<p>* Social media, Web application development<p>Above all, we are looking for an engineer with a strong passion for working with large social datasets, who is not afraid of getting his/her hands dirty and who never gets tired of trying and learning new technologies. Our research team provides a spirited, supportive and creative environment where we can learn from each other and build the next-generation social media analytics frameworks.<p>If we have triggered your interest, send us your resume and cover letter telling us why you would like to be part of our team. Be sure to provide concrete examples of your programming skills, such as sample codes that solve your favorite toy problems, demos, web applications you built, public code repositories such as GitHub where you contribute to open source projects. If such examples are not available tell us that, and instead provide short descriptions of previous projects you have been involved in previous jobs or during your education. This is our Van Halen Brown M&#38;M’s test. Please be sure to provide this extra information along with your application.<p>We look forward to seeing if you have what it takes to achieve something extraordinary with Crimson Hexagon!<p>For details: <a href=\"http://www.crimsonhexagon.com/junior-research-engineer/\" rel=\"nofollow\">http://www.crimsonhexagon.com/junior-research-engineer/</a>","time":1338607377,"type":"comment"},{"by":"paolodona","id":4055665,"parent":4053076,"text":"Dublin - Full time - Ruby On Rails Developer &#38; Lead Developer<p>We're a young and dynamic startup and are looking for  a talented developer capable of delivering large scale/high traffic webapps.<p>The developer will lead and play a critical role in the growth of the systems.<p>We're looking for:<p>+ 3/4+ Years Ruby/Ruby on Rails development\n+ Strong OO / Design patterns / refactoring skills\n+ Proficient in Javascript Prototype/jQuery\n+ Ability to scale high traffic web applications\n+ HTML/CSS design from scratch\n+ Good database design skills, SQL/MySQL\n+ Ajax / Memcached\n+ Git/GitHub – source code version control\n+ TDD/BDD with Rails/Rspec/Cucumber\n+ Experience with queuing systems, NoSQL databases, advanced caching &#38; key-value storage engines<p>Required skills:<p>+ Self starter &#38; self motivated – keeps up with the latest trends &#38; technologies\n+ Experience in designing/maintaining Rails applications in production\n+ Ability to be pragmatic and implement the right solution according to the business requirements / deliver within agreed timescales\n+ Ability to lead a team and manage/mentor junior developers<p>Why is Homestays.com a great place to work for:<p>We’re a young, well funded, startup and we just started growing. It’s a great environment with a friendly and supportive team, and this is an opportunity to join the team very early, so you get to contribute to the success of the company and shape how the technology stack will grow.<p>It’s an environment in which developers can do their best without the burden of heavy processes or hierarchies. You’ll get to work closely with the investors and the business side of the company to put you in the position to deliver the best code and architecture possible.<p>The Ideal Candidate:<p>+ Is passionate about clean, concise code that is readable and easy to maintain.\n+ Has designed and developed his own projects or products and understands what it takes to bring a product to life.\n+ Has a great GitHub profile – proven track record\n+ Has extensive experience with non relational databases (couchdb/mongodb), queuing systems, key-value storage engines (Redis/Riak)\n+ Can program in different languages\n+ Is entrepreneurial &#38; excited to make things happen quickly\n+ Has a strong work ethic. We’re a small team and you will be expected to work hard.\n+ Is a nice person, easy to work with<p>How to apply:<p>Send an email to jobs@homestays.com<p>Include a resume, and links to any projects (personal or commercial) and link to your github account &#38; personal blog if you have one.","time":1338583549,"type":"comment"},{"by":"dtwhitney","id":4055740,"parent":4053076,"text":"Full-Stack Web Developer / Boulder, CO<p>Pellucid Analytics is looking for several full-stack web developers in Boulder to work with us on building our quantitative finance application. We're a JVM/Java/Scala shop, and you'll have the opportunity to work with the full TypeSafe Stack, focused mainly on The Play Framework, building both a standard browser based application as well as a mobile application for the iPad. We're an Agile/Lean shop, which means we're dedicated to lean principles throughout the company as a whole - there will be no struggle trying to sell these principles to management. Also if you've taken any of the advanced computer science courses through Stanford, like Machine Learning or Probabilistic Graphical Models, and you're interested in seeing how those are applied to the financial world, Pellucid Analytics is for you.<p>To give you a better idea of what you'll be working on, we're a quantitative financial analytics company called Pellucid Analytics. Our product is going to make it easy for a team of investment bankers to pull together a massive number of analytics and visualizations from our quantitative analysis, focused on either a specific company or industry, and arrange the data and visualizations into a presentation that fits the story they are trying to tell. Our clients engage with a different Fortune 500 company every day of the week where a different analytics presentation is needed. These presentations are put together by a small team and can be as large as 100 pages long, so the ease with which our analysis can be put together is our highest priority.<p>Experience Requirements\n* 5+ years of JVM Development\n* A Desire to learn Scala and other JVM languages\n* 5+ years of Linux use\n* 5+ years of web development (HTML/CSS/JavaScript)\n* Experience with many varieties of databases, i.e. relational, non-relational, column-oriented, graph-based\n* Experience with git (our ideal candidate makes frequent, small commits)\n* Experience working with Amazon Web Services\n* Experience working with wireframes and comps<p>Experience Pluses\n* Bachelors Degree in Computer Science or a related field\n* Experience with Scala\n* Experience with the TypeSafe Stack\n* Experience with the Play Framework\n* Experience working with continuous deployment\n* Finance Experience<p>Please respond with a resume and links to previous work to jobs at pellucid dot com","time":1338584360,"type":"comment"},{"by":"alfredp","id":4053426,"parent":4053076,"text":"Oyster.com, the Hotel Tell-All - NYC, New York - Full time, local<p>Oyster's expert hotel investigators visit hotel properties in-person, take every photo, and write objective reviews. We currently have over 3000+ hotels on our website and there a lot more to come! We've been on TV and have been written up by The New York Times. We are in partnership with the Travel Channel and have appeared on location with Hotel Impossible.<p>On the technical side, we are looking to fill the following roles:\n- Engineering Manager\n- Senior Software Engineer\n- Data Analyst<p>We largely use python and some C++ in the backend, with Postgresql being our db of choice. Have you checked out our beautiful iPad app? Apply here: <a href=\"http://www.oyster.com/about/jobs/\" rel=\"nofollow\">http://www.oyster.com/about/jobs/</a><p>If you have any questions, feel free to email alfred at oyster dot com.","time":1338559893,"type":"comment"},{"by":"jerryr","id":4054647,"parent":4053076,"text":"San Francisco, CA (25 Kearny St) - MindTribe Product Engineering, Inc.<p>Hi, I’m MindTribe’s CTO. I’m searching for people who enjoy learning and making embedded systems. MindTribe is a small company, and I am looking for people with whom I would personally like to work and who want to work with me and my team. We've moved from Palo Alto to SF and we're finally settled into our new location. Now, besides experienced SENIOR embedded software engineers, I am looking for JUNIOR engineers as well. If you enjoyed your microcontroller classes in school, come join us in SF for continuing education.<p>Here are the tools I use regularly: The C programming language (specifically ISO/IEC 9899:1990); Eclipse, Make, Subversion, Git, Python; Linux, Embedded Linux, Android, iOS; ARM processors (TI OMAP, TI Stellaris, NXP LPC); Atmel AVR/AVR32, Microchip PIC, TI MSP430, Cypress PSoC<p>Here is what I enjoy doing at work: Writing embedded software that runs on cool hardware; Figuring out how to apply agile techniques such as test-driven development to embedded product development; Reducing regressions and supporting customer development with agile techniques; Developing embedded libraries for things like USB, TCP/IP, graphics displays, sprites, fonts, encryption, etc.; Having long, dorky conversations with coworkers about programming languages, physics, DIY sous-vide setups, whether it should be called \"firmware\" or \"software\", etc.<p>Here is what I enjoy doing outside of work: Hiking, walking around San Francisco; Pseudonymous humor blogging; Cooking and baking; Photography; Reading. Recently: \"Test Driven Development for Embedded C\", \"The Clean Coder\", \"The Four Steps to the Epiphany\", \"Norwegian Wood\", \"The Mind's Eye\", and currently \"Sealab: America's Forgotten Quest to Live and Work on the Ocean Floor\"<p>You can see examples of how I’ve applied my tools and passion here: <a href=\"http://mindtribe.com/portfolio/\" rel=\"nofollow\">http://mindtribe.com/portfolio/</a><p>I ask that you bring some C and microcontroller experience--other than that, you don't have to use the same tools and you don't have to enjoy the same things. But if you're excited about similar stuff, drop me a line at hn@mindtribe.com to let me know.<p>We're also hiring ELECTRICAL and MECHANICAL engineers!","time":1338572757,"type":"comment"},{"by":"victoriastodden","id":4055385,"parent":4053076,"text":"RunMyCode (<a href=\"http://runmycode.org\" rel=\"nofollow\">http://runmycode.org</a>) - Full Time, New York or REMOTE<p>Change the future of scientific collaboration and publishing at RunMyCode.org. We are hiring two fulltime engineers to expand a prototype platform that enables scientists to openly share the code and data that reproduces their research publications. We are founded by top professors from Columbia University and HEC Paris. We are looking for:<p>* back-end infrastructure to scale the site on AWS, both for users and for scientific publications;<p>* C++, and experience in scientific languages such as R, S+, Matlab, python a plus;<p>* possible outreach to the scientific community and citizen science groups if interested.<p>If this sounds exciting to you, email your CV and cover letter to Victoria Stodden vcs@stanford.edu","time":1338580433,"type":"comment"},{"by":"xyzzyb","id":4080790,"parent":4053076,"text":"PhishMe (Chantilly, VA) - Full time, local or remote<p>We're growing our Rails development team by one. We're a cool team that's (so far) entirely remote.<p>Details:<p>PhishMe is seeking a motivated individual to join its software development team. While our primary SaaS web application is a Ruby on Rails project, the successful candidate will be well-rounded in various languages with solid, hands-on Rails experience.<p>This is a full time position working for PhishMe, Inc. Outsourced or software development contractors should not apply.<p>Qualifications<p>Successful applicants must have:<p><pre><code>    1 - 2 years of professional development experience with Ruby or Python.\n    Must be fluent in the fundamental components of web application development.\n    Thorough understanding of source control management. You should know how (and when) to make branches, how to merge changes, resolve conflicts, etc.\n    Able to work on a team, independently when necessary, to escalate problems when appropriate, and to thrive in a small business environment.\n    Good oral and written communication skills.\n</code></pre>\nBonus!<p>The following attributes are preferred, but not required on day-one:<p><pre><code>    BS or BA in computer science, management/computer information systems, or related field.\n    Able to research, debug, and resolve cryptic error messages.\n    Experience writing triggers and stored procedures, when necessary.\n    Solid customer support experience (retail, help desk, consulting, etc.).\n    Familiarity with Moonshine, Capistrano, and/or Shadow Puppet.\n    Ability to do simple image creation and manipulation with the GIMP or Photoshop.\n    Mobile application development (iPhone and Android).\n</code></pre>\nCompensation<p><pre><code>    Competitive salary + stock\n    Pick your workstation and OS\n    Retirement plan with 3% company match\n    Health, vision, dental, telecommuting expense reimbursement, etc.\n    Peers that enjoy appropriate use of internet memes e.g. &#60;facepalm&#62; vs. &#60;double facepalm&#62;\n    Enjoy your nights and weekends!\n</code></pre>\nApply at <a href=\"http://phishme.com/careers.php#senior_developer\" rel=\"nofollow\">http://phishme.com/careers.php#senior_developer</a>","time":1339096414,"type":"comment"},{"by":"johnkoscielak","id":4094685,"parent":4053076,"text":"1 point by johnkoscielak 0 minutes ago | link | edit | delete<p>Mobile Developer\nLocation: Malvern PA<p>Job summary:<p>Us: The emerging technologies group at FIS; the world’s largest global provider dedicated to banking and payments technologies.<p>You: Mobile developer, hacker, innovator.<p>Job: Work with a talented team of architects, U/X engineers and thought leaders to assist with ongoing proof of concepts and research.<p>General duties and responsibilities: • Researches, tracks and understands new technologies to provide technical leadership in developing service applications and analyzing business requirements as they pertain to intranet and external Internet-based systems. • Builds applications • Provides written design documents, test plans and test results. • Manages, develops, integrates and implements related applications components, including front-end development, server-side development and database integration. • Plays a direct role in programming, maintenance, technical support, documentation and administration of the applications. • Establishes and communicates standards to manage cost and ensure continuity of applications. • Suggests technical alternatives and improves/streamlines processes and systems • Completes project assignments and special projects commensurate with job expectations • Conducts planning, analysis and forecasting activities to plan projects and tasks • Performs other related duties as assigned.<p>Requirements: Bachelor's degree in Computer Science, Engineering or a related discipline; or equivalent combination of education and experience that is required for the specific job level. Post-graduate education is desired.<p>ADA Disclaimer: In developing this job description care was taken to include all competencies needed to successfully perform in this position. However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation. All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.<p>EEO/AA Employer<p>Please contact John Koscielak at john.koscielak@fisglobal.com<p>414-357-9199<p>www.fisglobal.com","time":1339424310,"type":"comment"},{"by":"cadr","id":4054281,"parent":4053076,"text":"San Francisco, CA - Blurb<p>Blurb lets people tell their stories - currently through print-on-demand books, but increasingly through other venues.<p>We are both established and growing like mad (we were #47 on last year's Inc 500). We have a great group of people and a lot of fun challenges in the year ahead. We just launched a bevy of new products (our iPhone app is getting great reviews).<p>We play with fun tech: Ruby, Rails, ember.js, git, RSpec, Cucumber, Haml, SASS, RabbitMQ, Puppet, Obj-C, and more. We have great benefits, a great work/life balance, and we're in a great location close to the BART, CalTrain, and lots of food options.<p>We are currently hiring for many positions - front end, back end, QA and more - at all levels.<p><a href=\"http://www.blurb.com/about/jobs\" rel=\"nofollow\">http://www.blurb.com/about/jobs</a>","time":1338567963,"type":"comment"},{"by":"donohoe","id":4055888,"parent":4053076,"text":"New York, Backend and Frontend Developers &#38; Designer. Full-time.<p>I'm hiring for a number of positions for a new global business site from Atlantic Media. We're based in NYC with an office in Soho. Each role is a hands-on position and you will be working closely with other developers on your team and editorial. There is the opportunity to work on a large number of fun and challenging problems as the site and team grow.\nBackend Developer - Expert level Django/Python or WordPress/PHP experience. You will work with other developers to build a solid backend and devise solutions for our unique set of editorial and application needs. Expertise optimizing code for high traffic sites a must (scalability, caching etc).<p>Frontend Developer - We're not beholden to any JS framework (yet) but lets assume jQuery as a start point. Emphasis on building solid user experiences and web applications. Focus on new and emerging \"HTML5\" technologies and APIs (localStorage, geo, offline) and a view to mobile first.<p>Design - Looking for a strong design lead to work with product and dev (we're all on the same team, literally). You'll be given wide creative voice and actively encouraged to push in new directions as opposed to traditional methods.\nYou’ll be working with other great minds from Atlantic Media, WSJ, NiemanLab, Gawker and many others. The cast is assembling.<p>Interested? You should be. I’m not leaving the West Coast just for the bagels.<p>Take a look at the postings linked below from Atlantic Media’s site.<p>Use those as a guide and feel free to contact me directly: md@qz.com<p><pre><code>  Web Designer\n  http://bit.ly/IyjuA7\n\n  Mobile/Frontend Developer\n  http://bit.ly/JlE8dn\n\n  Senior Developer\n  http://bit.ly/IyjBvC\n</code></pre>\nGet in touch. Traditional resume is fine but bonus points:<p>- Links to your work on GitHub or other public repos<p>- StackOverflow profile<p>- Links to websites or services where you've had a primary development role.<p>For Design, any work on Dribbble or other portfolio platform is great. Please draw attention to any mobile work or UI ideas you've explored.<p>Only job enquires please. I'm not interested in your consulting company services or recruitment agency at this time. Thanks.","time":1338585968,"type":"comment"},{"by":"dcreemer","id":4054351,"parent":4053076,"text":"Palo Alto, CA; (or potentially New York, NY).<p>Flipboard [1] is hiring. We have specific openings listed on our jobs page [1], but are always looking for great engineers of all sorts, and can sponsor H1B visas if needed. We're located in downtown Palo Alto, just a short distance from Stanford University and Caltrain. IMHO we have an ambitious, clear vision that we have been executing against since the beginning, and we have an amazing, diverse, honest and passionate team. Not a day goes by that I don't learn here -- it's really an amazing place to work.<p>[1] <a href=\"http://flipboard.com\" rel=\"nofollow\">http://flipboard.com</a><p>[2] <a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qB89Vfwx&#38;s=Indeed&#38;page=Jobs\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qB89Vfwx&...</a>","time":1338568850,"type":"comment"},{"by":"dabent","id":4054857,"kids":[4055681],"parent":4053076,"text":"Los Angeles, CA - Full time<p>TrueCar is changing the way people buy and sell cars. We are well funded, earning revenue and growing. Most of our code is in Python, Java and Javascript.  We have a great work environment and some great problems to solve.  I love it here.<p>We have several openings right now.  If one sounds like it might be a fit, shoot me an email (address is in my profile)<p>* Senior Manager of Search Engine Marketing -  Responsible for the day-to-day management of the internal paid search program.  This includes everything from keyword expansion to weekly reporting as well as strategy and leading search meetings.  The ideal candidate will be well versed in the fundamentals of search and the ability to understand a purchase funnel and where it makes sense to drive investment.   3-5 years of search engine marketing experience required.ce building database-driven, web-based systems in a Linux environment.<p>* Senior Linux Systems Engineer - Will be involved from the design stage through production troubleshooting, from DNS to networking to application behavior and ultimately responsible for making sure our production systems are reliable and perform well. Redhat Linux administration, including configuration, troubleshooting, and automation. At least 5 years of experience with Linux/UNIX system administration.<p>* Director of Core Data Engineering - Lead major software and testing efforts on back end Core Data platform.  Work with CTO to define strategic direction for our data platform that drives our all of our products.  Proven success implementing Hadoop.<p>More positions:<p>* Java Architect<p>* Senior Java Developer<p>* Senior .NET Developer<p>* BI SQL Analyst<p>* Data Analyst (SAS/SQL - Looking for an MS in Statistics, Econometrics, Operations Research, Data Mining, or Math)<p>* Front End Developer<p>* Front End Engineer/Designer<p>* Statistician/ Data Mining Specialist<p>* Vice-President, Partner Development<p>I found TrueCar at PyCon, relocated across the country to join them in the fall and haven't regretted it once. Come join me by the beach: <a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>","time":1338575239,"type":"comment"},{"by":"wkral","id":4054827,"kids":[4058561],"parent":4053076,"text":"Vancouver, B.C., Canada<p>Twenty Year Media, we're an early stage funded startup, and we're trying to change how you find movies to watch.<p>We're currently looking for a full-stack generalist developer. Someone with a good work ethic and a willingness to learn new things. We follow an 80/20 rule for functional over OO programming.<p>The stack:<p><pre><code>    * Python\n    * Flask\n    * Redis\n    * Riak\n    * Linux\n    * uWSGI\n    * Nginx\n    * Javascript/HTML\n</code></pre>\nWith aspirations towards mobile development in the future. You don't have to know everything up front as long as you can pick it up quickly. If you're interested please send your github, bitbucket or anything else you're proud of to william@20yearmedia.com with a bit about why you might be a good fit for us.","time":1338574977,"type":"comment"},{"by":"kittkat","id":4075863,"parent":4053076,"text":"Jana (Boston,MA)-Full time\nFull-Stack Web Developers, Head of Engineering, Web Development Interns, Associate Product Manager (Mobile and Facebook), PR Specialist, etc.<p>We are a well funded startup that is building a new style of marketing and advertising company focusing on underserved, understudied communities in high-growth markets. We are actively recruiting individuals who share our passion for making a lasting, positive global impact while growing a thriving, exciting business.<p>We are changing century old industries in the developing world through cutting edge mobile technology. We help big players (like the World Bank, The Economist, Unilever) get feedback from hard to reach groups in days instead of months and test innovative products with the push of a button. We have a powerful mobile rewards platform to send free airtime minutes to more than 2.1 billion people around the world. We're earning revenue in 50 countries and have raised almost $10M from premier VC investors.<p>Our teams bursts with talent from MIT, Harvard, Stanford and Google but we're pretty relaxed, except during weekly Settlers of Catan battles in the office, ice-cream runs on Wednesdays or beer runs every Friday.<p>Interested in global + mobile + data? <a href=\"http://jana.com/about-us/careers/\" rel=\"nofollow\">http://jana.com/about-us/careers/</a><p>On the Web Developer front: \n    Early stage means you'll have major influence\n    We love Open Source (CouchDB, Flask, and more)\n    Roots from the MIT Media Lab\n    Global Impact (Asia, Africa, Latin America)\n    We gather and analyze massive amounts of data<p>Good candidates have:<p><pre><code>    Experience across the entire open source stack\n    UI/UX implementation, web design\n    Experience with web frameworks\n    Experience with Python - or very strong in at least two other web-related languages\n    3+ years of software development\n    Demonstrable analytic ability\n    Passion for web software development\n    Ability to both learn from and teach other engineers\n</code></pre>\nAny questions you can email me at katrina at jana.com","time":1339012695,"type":"comment"},{"by":"julianwa","id":4053587,"parent":4053076,"text":"FiftyThree (New York, NY and Seattle, WA) - creators of Paper for iPad<p>At FiftyThree we build tools for mobile creation. Two months ago, we launched Paper , the simplest and most beautiful way to create on the iPad. Within two weeks, Paper was downloaded 1.5 million times and used to generate over 7 million creations.<p><a href=\"http://www.fiftythree.com\" rel=\"nofollow\">http://www.fiftythree.com</a><p>Our ambition is no less than to change the way people create, and we're just getting started. We're building world-class engineering teams in NYC and Seattle — spanning hardware, software, and services — to take on this challenge.<p><a href=\"http://www.fiftythree.com/jobs\" rel=\"nofollow\">http://www.fiftythree.com/jobs</a><p>We look forward to hearing from you!","time":1338561699,"type":"comment"},{"by":"sofuture","id":4053474,"parent":4053076,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas Networks (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\". Yes, your day job will be writing code. But that's the only similarity to a big company software job. You'll be challenged to take big ideas and turn them into concrete testable hypotheses. Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>More details and how to apply: <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1338560408,"type":"comment"},{"by":"ryen","id":4053758,"parent":4053076,"text":"Coffee Meets Bagel - San Francisco, CA. Full time - Experienced Python/Django web developer\nCoffee Meets Bagel ( <a href=\"http://coffeemeetsbagel.com\" rel=\"nofollow\">http://coffeemeetsbagel.com</a> ) is a new innovative online dating startup making waves in New York and Boston and looking to expand to the west coast soon. We've recently been featured in TechCrunch, Glamour, BostInno, and several other major blogs and publications.<p>About the Job: We're looking for an experienced Python/Django web developer to join our early stage team as we scale our service in terms of geography and users, apply machine learning techniques to our algorithms, refine our revenue model, and continue to keep our customers happy. You will have an opportunity to work with and learn from a highly experienced technical advisor and great engineers. This is a market with huge opportunity and we will look to you for best practices around architecture, deployment and scaling the service to millions of people.<p>Requirements: - 2+ Years of Python development experience with some knowledge of Django or similar web frameworks. You will be able to contribute to our Django code base from Day 1. - A strong knowledge of the fundamentals of networking, operating systems, and security. - A Bachelors Degree in Computer Science or Computer Engineering or related discipline from a 4-year program. - Agile. Intelligent. Creative. Problem-solver. Startup lover. You like finding and working with outstanding engineers and want to help us build an awesome engineering team.<p>Bonus: - Experience building back-end systems on a high-traffic, low-latency web site. - Knowledge in Machine Learning/Graph Theory/Large-scale Data Analysis is a plus - Experience working with, and contributing to open source software projects is a plus—show us your github account or other online projects if available.<p>*Also looking for engineering interns, front-end developers, and marketing/PR intern.\n<a href=\"http://coffeemeetsbagel.com/jobs/\" rel=\"nofollow\">http://coffeemeetsbagel.com/jobs/</a>","time":1338563072,"type":"comment"},{"by":"mquirion","id":4054829,"parent":4053076,"text":"Baltimore, MD / New York City, NY<p><a href=\"http://www.lotame.com/about-lotame/marketing-technology-jobs\" rel=\"nofollow\">http://www.lotame.com/about-lotame/marketing-technology-jobs</a><p>Lotame is hiring across the board. Web app devs, data scientists, big data devs, infrastructure, support, QA, account exec, etc...<p>We've created a SaaS solution that enables publishers, brands, and marketers to manage all of their audience data from any data source (web, mobile, CRM, off-line retail, etc...).<p>Great, challenging environment where you get recognized for doing great work.  It's a complex industry that lets you use all the big buzzwords in day-to-day conversation without feeling ridiculous.<p>If interested, e-mail me at my HN username at lotame dot com.","time":1338574981,"type":"comment"},{"by":"bb_mn","id":4102305,"parent":4053076,"text":"JAMF Software - Full Time - Minneapolis, MN and Eau Claire, WI<p>JAMF Software is the creator of the Casper Suite, the only suite of client management software developed exclusively for the Apple platform. We help thousands of customers to manage their Macs and iOS devices, and we're fortunate to work in a space that is evolving and growing at a fast pace. This is a great place to work, and we're conveniently located on the top floor of the Grain Exchange in downtown Minneapolis.<p>We're looking for a driven web developer (Symfony/Zend, jQuery, HTML5, CSS, PHP) to join our team. In this position, you will hit the ground running and help us build a better website, evolve and mature our development process, and integrate with internal and external systems using a variety of APIs. You'll also probably suggest some things we haven't thought of yet.<p>RESPONSIBILITIES<p>• Collaborates with communications team to create and publish timely, accurate information about products and offerings<p>• Manages and improves development and production environments<p>• Evolves development process to maturity through the use of content versioning systems, deployment tools, backup systems and increased redundancy<p>• Integrates with external systems (for example, Salesforce) using APIs<p>• Measures the success of web initiatives and campaigns<p>• Increases efficiency, improves processes and leverages emerging capabilities<p>We are growing quickly and are also hiring for a number of other positions, including Software Engineer (Objective-C or Java), Software Engineer - Test, and QA engineers. All jobs are listed on our careers page: <a href=\"http://www.jamfsoftware.com/about/careers\" rel=\"nofollow\">http://www.jamfsoftware.com/about/careers</a>.<p>Interested? The first step is to check out our careers page and submit your resume to our recruiting team. If you could mention that you saw the job posting here, I would appreciate it. I've asked them to keep their eyes open for resumes that mention HN.","time":1339529543,"type":"comment"},{"by":"defrex","id":4055642,"kids":[4055831],"parent":4053076,"text":"Toronto, Canada (King St. W.) - Django Developer - <a href=\"http://shopcastr.com\" rel=\"nofollow\">http://shopcastr.com</a>\nShopcastr is a social marketplace for independent retailers and local shoppers. We’re backed by Mantella Venture Partners and are seeing great early traction. We have a solid team so far and need someone to help make up the foundation of the company as we grow.\nWe’re looking for a developer with some Python and Django chops who isn’t afraid to pick up new skills when needed (we use CoffeeScript and SASS, for example). We’re looking for someone self-taught, though we won’t hold it against you if you’ve also been to school.\nEmail us at aron@shopcastr.com with whatever you think we need to see before following up with you.","time":1338583294,"type":"comment"},{"by":"kabir_h","id":4054090,"parent":4053076,"text":"Cambridge, MA - Shareaholic makes tools for publishers and users to help them find and share the best content on the web. We're a small, funded startup (with killer investors: Dave McClure, Dharmesh Shah, General Catalyst) that reaches 300 million unique users via 200K publishers. We've got an awesome team culture that avoids bureaucracy and gives everyone a meaningful chance to contribute. Everyone codes, even our marketing person.<p>We're hiring a Product Designer, Front End Developer and looking for a DevOps contractor:\n<a href=\"http://www.shareaholic.com/careers\" rel=\"nofollow\">http://www.shareaholic.com/careers</a><p>Feel free to email me direct if you're interested or have questions: kabir at shareaholic dot com.","time":1338566048,"type":"comment"},{"by":"nurey","id":4053803,"kids":[4053881],"parent":4053076,"text":"Quandl.com (Downtown Toronto, Canada) – Full Time, Local<p>We are a funded startup about to launch an intelligent search engine for numerical data. \nWe use Github for source control and you will have an opportunity to open source the code you write.\nWe also use Pivotal Tracker, IRC, and Jenkins for continuous integration.\nWe use the best tools money can buy. You get a sizeable budget to setup your work environment. Aeron chair? 27'' Thunderbolt Display? Basketball net? You got it!<p>You are an exceptional full-stack RoR software engineer. \nYou love RSpec, TDD, Ruby and Javascript. You understand the architectural difference between Angular, Ember and Backbone.<p>Email to jobs at quandl dot com with subject RoR.","time":1338563407,"type":"comment"},{"by":"gozman","id":4053930,"parent":4053076,"text":"Appifier, Montreal (Canada) - Seed Funded<p>We're hiring a full-time iOS developer who wants to help bring visibility, discoverability and monetization to the millions of blogs and online publishers across the web by creating awesome mobile/tablet app experiences for them.<p>Details on our job posting are here:<p><a href=\"http://matchfwd.com/opportunities/ios-developer-extraordinaire-in-montreal-quebec-ca\" rel=\"nofollow\">http://matchfwd.com/opportunities/ios-developer-extraordinai...</a><p>Send your resume to jobs@theappifier.com\nCompensation is a fair mix of salary and equity.<p>We prefer local candidates or anyone who can relocate but are willing to consider remote working for the right dev.","time":1338564526,"type":"comment"},{"by":"muntzen","id":4053443,"parent":4053076,"text":"Atlanta, GA - MailChimp (<a href=\"http://mailchimp.com\" rel=\"nofollow\">http://mailchimp.com</a>)<p>Software Engineer<p>+++++ What we're looking for +++++<p>* Solid engineers.  We don't care about pedigree or what languages or stacks you've worked in, we just want great engineers.  In fact, if you don't want to \"polish up the ole resume\" and want to send code instead, that's great with us (though we'll take a resume in lieu of code).<p>* Developers who will thrive without explicit supervision or constant guidance.<p>* Developers located anywhere, but willing to work in Atlanta.  We allow for flexible hours and some telecommute options, but you've got to be in the office here in downtown Atlanta on a regular basis.  Relocation is an option.<p>+++++ Why it's great to work here +++++<p>* While we agree that PHP isn't the world's greatest language (<a href=\"http://blog.mailchimp.com/ewww-you-use-php/\" rel=\"nofollow\">http://blog.mailchimp.com/ewww-you-use-php/</a>), it's our main language and our framework allows us to get a lot done without feeling the pain of PHP.<p>* We do use other languages also, such as python, C and more - <a href=\"http://blog.mailchimp.com/language-at-mailchimp/\" rel=\"nofollow\">http://blog.mailchimp.com/language-at-mailchimp/</a><p>* Our scale is interesting and fun and just keeps growing - <a href=\"http://blog.mailchimp.com/mailchimp-numbers/\" rel=\"nofollow\">http://blog.mailchimp.com/mailchimp-numbers/</a><p>* We are allowed to be creative.  We're actually required to.  Without process, managers, and meetings getting in the way, we get to concentrate on what we love to do without barriers - <a href=\"http://www.fastcocreate.com/1679207/creative-cultures-mailchimp-grants-employees-permission-to-be-creative\" rel=\"nofollow\">http://www.fastcocreate.com/1679207/creative-cultures-mailch...</a><p>Email us at engineer-hiring@mailchimp.com","time":1338559999,"type":"comment"},{"by":"phillytom","id":4053515,"parent":4053076,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>Monetate is a SAAS provider to internet marketers. We do real-time DOM modification on our clients’ sites to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>About us:<p>* Founded in 2008<p>* Funded by First Round and OpenView<p>* Market comp<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Use the source - Google Closure to Python, Hadoop and Mahout to Solr and Lucene - we're open source across our stack<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of deep problems to work on<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.  Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a> and see more about our open jobs at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http://monetate.com/jobs/</a><p>We've hired great people from HN in the past.<p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1338560823,"type":"comment"},{"by":"rujulz","id":4058724,"parent":4053076,"text":"Cincinnati, OH - INTERN Frontend/Backend Django Developers for FlightCar (backed by The Brandery):<p>Frontend:<p>We're looking for someone who has an eye for design and can realize their designs with code. Strong working knowledge of CSS, HTML, and Javascript is a must. Graphic Design Skills is a huge +, Django is a +<p>Backend:<p>We're looking for someone who can setup a server blindfolded and who has a strong working knowledge of Django (Python) and Javascript.<p>What will the experience be like?<p>A lot of learning and a lot of work, accompanied with a lot of fun--expect the sort of environment you had seen in The Social Network, except now there are 12 other teams in the building with brilliant programmers and designers for you to learn from and teach. We also have top notch mentors, thanks to the Brandery, as well as a world class design firm, a bank team, and a legal team, along with dedicated support server side.<p>If selected for the position, you'll be working at The Brandery from late June until school starts. Depending on the specific dates you work, you'll get $1-3k upfront, along with $4-6k promised upon us receiving our next round of funding, and a little bit of equity, a bonus we give so that you'll have a vested interest in our company (imagine how much that'll be worth if we hit it big!). Not to mention, you'll have free housing in an awesome house with the rest of the team and the opportunity to network with some of the most brilliant entrepreneurs in America--think of it as a way to get your foot in the door of the startup scene.<p>Since we're in the early stages of development, we cannot publicly disclose our business model, but we're working to disrupt an industry and we think we can hit it big.<p>Send shrig94@gmail.com a resume and a portfolio of previous works if you're interested!","time":1338661204,"type":"comment"},{"by":"davidblondeau","id":4057388,"parent":4053076,"text":"Burligame, CA - Collaborative Drug Discovery (CDD) (<a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>)<p>CDD is growing and financially stable. Our software helps scientists manage, analyze and collaborate around their drug discovery data (chemistry and biology). We are are in a great position to support the evolution towards more collaboration, specialization and distribution in a market that has been historically closed and secretive. The model has been successful with academic labs, small biotech startups and very large collaborations (like the Gates foundation TB initiative or MM4TB in Europe). We are now gaining some traction with government agencies and the big pharmaceuticals.<p>We are hiring two full-stack software developers (<a href=\"https://www.collaborativedrug.com/pages/employment#h-1\" rel=\"nofollow\">https://www.collaborativedrug.com/pages/employment#h-1</a>). As one of the core developers, you need to be comfortable working or interested in building expertise at every level of the stack. Experience or interest in system administration and operations is nice to have though not required. We have many projects involving web development, data visualization, data processing, scaling, security, privacy and other software challenges to make our scientific application collaborative, engaging and rewarding.<p>It is perfectly OK if you do not have experience with any of the languages or technologies we currently use (Rails/Ruby/JS/MySQL/Solr...) as long as you can learn those quickly. CDD is a great place if you want to have a lot of impact and like to take on projects and responsibilities. We offer market salary and meaningful equity.<p>If you are interested, contact work@collaborativedrug.com, you will get an answer from one of the developers.","time":1338621626,"type":"comment"},{"by":"keyajay","id":4054972,"parent":4053076,"text":"San Francisco, CA - Chief Data Scientist // Rails Engineer<p>ElectNext translates political data into tools that help build a more informed, engaged and effective democracy. Starting with voting, we are building the database on your candidates and facilitating your access to it with matching technology, so that you can easily vote your values all the way down your ballot. Like OkCupid for elections.<p>Most importantly, we are looking for people who can’t wait to deliver breakthrough technology in the service of a more informed and participatory democracy.<p>Specifically, we are looking for:<p>1) A Chief Data Scientist to found and run our data lab. You have: PhD-level mathematics, statistics or computer science; deep familiarity with Bayesian statistics, predictive algorithms and machine learning; statistical programming especially R; Ruby on Rails.<p>2) A full stack rails engineer with a passion for big data and back end architecture. Ready to take on a big role on a small team as we expand our platform through a critical growth stage.<p>Please contact: keya at electnext dot com with a link to your github or other code samples, and tell us why what we're doing resonates with you.<p>A bit more about ElectNext: we are a 3-person, funded, SF- and NYC-based startup. We won the O’Reilly Web 2.0 startup showcase (2011 NYC) and were a GovFresh “best civic startup” of 2011. We have spoken at TEDx and Ignite, and Wharton and Harvard Business Schools. We have been featured in TechCrunch, FastCompany, the Huffington Post and the O’Reilly Radar. We provide data and technology to The Economist, Comcast, The Philadelphia Inquirer, the National Constitution Center and others. Our advisors include both past presidential candidates and first Facebookers. We launched in November.","time":1338576467,"type":"comment"},{"by":"newhouseb","id":4055927,"parent":4053076,"text":"San Francisco, IOS Developer. Full Time.<p>We’re inventing a new kind of photography for when photos just aren’t enough. Close your eyes and imagine your favourite memory - say christmas morning as a kid. You’re probably not thinking of a rectangle in a void (i.e. a picture), nor are you thinking of a moving rectangle in a void (i.e. a movie), you’re probably thinking of an entire world that you’re standing in the center of. We make an IOS app that allows you to save this entire moment into a seamless spherical photograph called a bubble that you can save and share with others.<p>We’re a small, three person team - the intern who made Yelp’s Monocle, a designer from Cooper Union and a computer vision genius. We raised $2 million in a heavily oversubscribed round of funding from August Capital. We spoke at TED (sorry, no video!), have offices on union square in San Francisco and have an app that has an unparalleled ability to induce uncontrolled smiles of glee when people first see it.<p>We’re looking for someone to be our point person for IOS development. We actually all have IOS experience (and really cool app in progress), but we’re looking for someone to grab the bull by the horns and focus on IOS full time (as the two engineers are focused on computer vision and ‘all the other boring engineering’ respectively). You’ll be a pretty big deal at our company. We’re pretty lucky in that our technology spans everywhere from advanced computer vision to WebGL and HTML5 to Python, PostgreSQL and Memcached to low-level run-loop optimizations for UI responsiveness and Core Animation magic.  It's a lot of fun.<p>Send me an e-mail at ben@bubb.li","time":1338586476,"type":"comment"},{"by":"silent_void","id":4053136,"parent":4053076,"text":"Wuaki.tv, Barcelona, Spain. <a href=\"http://jobs.wuaki.tv\" rel=\"nofollow\">http://jobs.wuaki.tv</a> : Several open positions: Rails Developer, DBA, SysAdmin... We are building a Video On Demand Platform for web and Connected Devices. We have launched in Spain, but we are growing and expanding the team and project Internationally. We are a young and funny team. We look for a team builder, with strong knowledge of Rails that will bring more “power and muscle” to the team. Someone that knows how to deal with pressure and work with a multidisciplinary team. The position is full-time job in our Barcelona offices.","time":1338555761,"type":"comment"},{"by":"timanglade","id":4054143,"parent":4053076,"text":"Apigee (Palo Alto, REMOTE, H1B) — Java Developers and Mobile Developers<p>Apigee is the API company. We are helping thousands of developers build API-driven applications every day. Our technology powers the APIs of Netflix, X.com, GameSpy, ConstantContact, and hundreds of others.\nWe are actively hiring for <a href=\"http://usergrid.com/\" rel=\"nofollow\">http://usergrid.com/</a>, our Mobile Backend-as-a-Service. Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is about to enter Public Beta. We are built on top of Jersey, Jackson and Cassandra (we gutted a lot of the latter and built our own indexing system, query system, storage format and multi-tenancy strategy on top of it).<p>We are looking for Java Developers to join our Core team and help us overcome the next generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>We are also looking for Mobile developers proficient in at least one of iOS, Android &#38; JavaScript+HTML5, who want to become an expert at all three, and help make it easier to write mobile apps without a backend team.<p>We offered catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>Want to apply? Have some questions? Want to join but don’t match either position? Then get in touch; I joined them this year and I’m loving it ➝ tim@apigee.com","time":1338566485,"type":"comment"},{"by":"seldo","id":4054283,"parent":4053076,"text":"San Francisco, CA (Mission District) - awe.sm<p>We're looking for front-end, back-end, and full-stack engineers. (H1B okay)<p>We're building conversion tracking for social media -- \"SendGrid for sharing\", if you like.<p>Most sites and apps are currently doing a really poor job of measuring where social traffic comes from, and how valuable it is in terms of page views, signups and sales. We save people from reinventing the wheel by providing a set of APIs to integrate into their application that make it easy to generate shares and track the performance of different networks and campaigns. The APIs are written in Ruby and PHP right now, sitting on top of a mixture of MySQL and Redis, but we are pretty language-agnostic and pick the right tool for the job. The back-end challenges are all about taking lots of data and processing it scalably, as fast as possible.<p>We also have a GUI, a modern Javascript single-page app written using Backbone that sits on top of our APIs. It's all about allowing custmers to explore their data and find what's important.<p><a href=\"http://totally.awe.sm/jobs\" rel=\"nofollow\">http://totally.awe.sm/jobs</a><p>We're currently 13 people, with a goal of 14-16, of which 8 will be engineers. We have a great location in an awesome neighbourhood with an amazing view ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) and have catered lunches, full health, vision and dental coverage.<p>We use an internal IRC server for team communication. If that makes you say \"yay!\" then you will definitely fit in.","time":1338567975,"type":"comment"},{"by":"zinxq","id":4053858,"parent":4053076,"text":"Palo Alto, CA - H1B - Full Time<p>Funded (Series A) start-up building first engineering team.\nLooking for Software Developers across the stack.<p><a href=\"http://www.refresh.io/jobs\" rel=\"nofollow\">http://www.refresh.io/jobs</a><p>jobs@refresh.io<p>You're a crack-shot software engineer. Not necessarily because of where you went to school, but because simply put - you love this stuff. You know at least one mobile/web-related computer language cold. Whether it's Objective-C, Ruby, Java Javascript, or others - we're not too concerned about which one because no matter which one (or ones) we end up using, you'll not only be able to pick it up fast, you'll be excited about doing so.<p>You understand the latest technology. From NoSQL to Backbone to Node.  You aren't technically religious and gain as much satisfaction in picking the right tool for the job as you do implementing it.<p>You've built stuff. Web sites. Mobile apps. Whatever. You can show us. You can't wait to show us. You're not only excited of what users can do with it, you're proud about how it's implemented and to a technical audience, and you can't wait to talk about it.<p>As part of the first engineering team, you're excited by the prospect of working with smart people. Because you're smart and you know it - and you know that working with other smart people simply makes you better (all the while making them better too). As a bonus, being part of this initial team gives you the opportunity to strongly affect future engineering hires - insuring the caliber of the team.<p>You live within commuting distance to Palo Alto, CA or are willing to relocate (paid).","time":1338563962,"type":"comment"},{"by":"LauraSeeker","id":4101742,"parent":4053076,"text":"Seeker Solutions - Full time - Victoria, BC and Vancouver, BC - Canada<p>At Seeker Solutions, we build solutions to real-world business issues using natural language processing and machine learning. Our development teams support existing solutions, build new projects and enhancements, and research cutting-edge natural language processing techniques. As we expand our client base into several new industries, we're undergoing a major growth stage.<p>We're currently hiring the following positions:\n* Software Development Team Lead [Victoria]\n* Software Architect [Victoria]\n* Software QA Analyst [Victoria]\n* Senior Software Developer [Vancouver]\n* System Operations Engineer [Vancouver]\n* Intermediate/Senior Software QA Analyst [Vancouver]<p>We are primarily Java-based, with heavy use of Hadoop/HBase, although our research team mostly works in Python, and our processes are fairly agile. Our offices are full of happy people who enjoy awesome perks (Nerf gun fights, bringing dogs to work, gym memberships, a well-stocked kitchen, plus more) and are passionate about what they do. If you're not in our area and are open to moving, Victoria and Vancouver are beautiful cities, boasting vibrant cultural scenes and nearby locations for skiing and surfing.<p>If you're ready to help shape the future of our company and bring new NLP solutions to market, please check the full job postings and apply online via <a href=\"http://seekersolutions.com/careers\" rel=\"nofollow\">http://seekersolutions.com/careers</a> -- feel free to contact me (laura.bowles@seekersolutions.com) if you have any questions.","time":1339523460,"type":"comment"},{"by":"goodside","id":4055336,"parent":4053076,"text":"OkCupid -- New York, NY<p>Three positions:<p>* Product Designer<p>* Software Engineer<p>* Data Scientist<p><a href=\"http://www.okcupid.com/careers/we-are-hiring\" rel=\"nofollow\">http://www.okcupid.com/careers/we-are-hiring</a>","time":1338580032,"type":"comment"},{"by":"maxaf","id":4053647,"parent":4053076,"text":"Novus (New York, NY - Midtown East): hiring hacker generalists<p><a href=\"https://www.novus.com/\" rel=\"nofollow\">https://www.novus.com/</a><p>At Novus we're building the next generation of real-time financial analytics platforms. We use Scala, Akka, and MongoDB, and are looking for bright, motivated, eager to learn, and eager to add value hackers. There's no particular skill set that we require other than a good combination of depth &#38; breadth, a keen eye for great design, ability to reason about code, and simply build things.<p>If you're interested, let's talk! E-mail me: max at novus dot com","time":1338562141,"type":"comment"},{"by":"zuvikomx","id":4053272,"parent":4053076,"text":"SEEKING FREELANCER OR INTERN: Mexico City<p>We're expanding our web services and want someone keen to get their feet really wet with Javascript front-end development with a focus on both desktop and mobile. You've got experience with JQuery and maybe you're in love in Python. If you want to play with MapReduce, write an API, scale web services and work with real-time data, there's a lot of fun yet to be had. We really love our industry and are the current leading service provider in our field, working with top clients internationally. Email us at hire.me.mex@gmail.com with some work you've done.","time":1338557785,"type":"comment"},{"by":"nikhilpandit","id":4060287,"parent":4053076,"text":"Grubwithus (YC W11) - Venice, CA - fulltime<p>Grubwithus helps users meet awesome people over tasting menus at top restaurants. We are looking for engineers to help us build features and provide a great experience for our users. Specific positions:<p>BACKEND DEVELOPER POSITION<p>Requirements<p><pre><code>  - Strong experience with server-side programming (preferably in Ruby on Rails)\n  - Example projects that demonstrate this ability\n  - Strong background in computer science fundamentals\n</code></pre>\nGood to Haves<p><pre><code>  - Experience with deep social-network integration, recommendation engines, payment systems, analytics systems\n  - Experience with building an API for a web-service\n  - jQuery / CSS experience in a production environment\n</code></pre>\nLink to apply: <a href=\"http://grubwithus.theresumator.com/apply/7r1rjn/Developer-Backend.html\" rel=\"nofollow\">http://grubwithus.theresumator.com/apply/7r1rjn/Developer-Ba...</a><p>FRONT-END DEVELOPER POSITION<p>Requirements<p><pre><code>  - Proficient in jQuery and CSS\n  - Strong understanding of UI and UX\n  - Example projects that demonstrate this\n</code></pre>\nGood to Haves<p><pre><code>  - Ruby-on-Rails experience in a production environment\n  - Experience with deep social-network integration\n  - Personal projects that showcase ability to design and implement great UI / UX\n  - Experience with Illustrator or other design tools\n</code></pre>\nLink to apply: <a href=\"http://grubwithus.theresumator.com/apply/pVmZt1/Developer-Frontend.html\" rel=\"nofollow\">http://grubwithus.theresumator.com/apply/pVmZt1/Developer-Fr...</a>","time":1338708289,"type":"comment"},{"by":"rileywatkins","id":4053993,"parent":4053076,"text":"InstaEDU — Software Engineers — San Francisco, CA<p>InstaEDU is an on-demand video tutoring marketplace. We're making personal study help accessible and affordable for everyone.<p>We just raised a $1.1M seed round (<a href=\"http://techcrunch.com/2012/05/30/instaedu/\" rel=\"nofollow\">http://techcrunch.com/2012/05/30/instaedu/</a>) and we're looking for ambitious full-stack engineers who love working on a wide variety of challenges to join our team. As we transition from prototype to a global web application, we need new teammates to help develop key features, scale our infrastructure, and take an algorithmic approach to improving product effectiveness. This is a unique opportunity to play a major role on a small team and help millions of students get personal academic attention.<p>Our tech stack includes Python/Django, JavaScript, and MySQL. We also use a number of third-party APIs such as TokBox, Facebook Chat, and Firebase.<p>Benefits:<p>* Small team where everyone has a major impact<p>* Competitive salary with great equity compensation<p>* Casual, open office environment<p>* Medical, dental and vision insurance<p>* Downtown San Francisco location close to awesome food and easy transit<p>Requirements:<p>* Extremely strong Python programming skills<p>* Proficient with HTML, CSS, and JavaScript<p>* Passion for InstaEDU’s product and mission<p>* BA/BS degree with a strong academic record (or equivalent work experience)<p>Send your resume, GitHub profile, blog, and/or any projects that you're proud of to jobs@instaedu.com. If you're awesome, we want to hear from you!","time":1338565130,"type":"comment"},{"by":"urgeio2","id":4054823,"parent":4053076,"text":"BERLIN/GERMANY, FULL-TIME, LOCAL<p>We have several open positions, you find all of them on <a href=\"http://urge.io\" rel=\"nofollow\">http://urge.io</a> with full text, requirements and contact email<p>OPEN POSITIONS:<p>=&#62; Lead Software Engineer Ruby on Rails<p>=&#62; Lead Software Engineer UI/UX/Frontend<p>=&#62; Lead Software Engineer iOS<p>=&#62; Lead Software Engineer Android<p>=&#62; Lead Software Engineer Node.js<p>=&#62; Head of Operations<p>URGE IO, a startup headquarted in Berlin-Mitte, is building a consumer online product with groundbreaking technologies in the field of AI and Natural Language Processing. The product has launched and we are growing fast—currently showing an organic traffic growth of 2.1x per month, having already more than 400 #1 positions on Google SERPs while providing content in 17 languages including Chinese.<p>We offer:<p>=&#62; Be with an amazing team and top-notch architects<p>=&#62; Contribute to a cutting-edge product employing newest technologies from day one<p>=&#62; Be right in the center of Berlin-Mitte, one of the coolest neighborhoods and startup communities<p>=&#62; Be part of Europe's new tech hub Berlin and a vibrant ecosystem of smart people and many career opportunities<p>=&#62; A top salary<p>=&#62; Help and bonus on relocating/moving to Berlin<p>=&#62; A long-term perspective at a fast growing company<p>=&#62; Perfect software development environment<p>=&#62; Work on a Mac<p>Please find all the job positions with full text and requirements on <a href=\"http://urge.io/jobs\" rel=\"nofollow\">http://urge.io/jobs</a>","time":1338574958,"type":"comment"},{"by":"squirrel","id":4055383,"parent":4053076,"text":"Notting Hill, London, England.<p>Our web application is at the heart of our busy e-commerce business; every day it serves millions of product images and handles thousands of purchases - but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, we have a mix of Linux, Windows, and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. We expect developers to be generalising specialists, ready at the drop of a hat to refine an algorithm, write a tricky integration test, tune a SQL query, or discuss feature nuances with a product manager. Our team is growing to five developers and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us.<p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homewares and lifestyle categories, many familiar from the high street. The company has about 55 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.","time":1338580397,"type":"comment"},{"by":"aliya_bhatia","id":4057034,"parent":4053076,"text":"Dash Technologies, Inc. seeking lead front-end web engineer - Part time/Remote are lovely<p>What if, instead of scribbles on a clipboard, teachers could instantly translate a fleeting thought to call a parent into a playlist in their phones?<p>Check out what we’ve done to solve this pain point at <a href=\"http://aliyabhatia.posterous.com/private/tunrgdjyaI#!/slideshow\" rel=\"nofollow\">http://aliyabhatia.posterous.com/private/tunrgdjyaI#!/slides...</a><p>As Lead Engineer, you would:<p>-\tBuild a product that teachers and principals are begging to see in their classrooms and schools\n-\tWork with an Emmy Award-winning designer to develop web portals, mobile apps, and our main website \n-\tManage a team and build a company<p>What we are looking for:<p>-\tExperience integrating web and mobile APIs into web development\n-\tA passion for education and education technology\n-\tDemonstrated ability to manage a team \n-\tExcellent communication skills\n-\tA discriminating eye and willingness to vet options and make the right decision for the product\n-\tAn “all-hands-on-deck” mentality and willingness to support in any area needed\n-\tStrong preference for candidates with past experience in mobile development\n-\tAt least 15 hours per week to devote to Dash’s development needs<p>To apply:<p>-\tSend a resume, cover letter, and links to portfolio pieces to Dash founder Aliya Bhatia at aliya_bhatia@mac.com\n-\tQualified candidates will undergo between 1 and 3 interviews with various members of Team Dash for fit, team chemistry, and domain expertise","time":1338611370,"type":"comment"},{"by":"MattRogish","id":4053663,"parent":4053076,"text":"FundingGates (<a href=\"http://fundinggates.com/jobs/\" rel=\"nofollow\">http://fundinggates.com/jobs/</a>) - NYC - Ruby on Rails, JavaScript (Ember.js), or Django experts! <i>Local (or relocatable to NYC) only.</i><p>Looking for <i>senior</i> Ruby on Rails, JavaScript rich client, or Django developers for our young, privately-funded startup (no plans to take any more $$). You'd be engineer #1 aside from the CTO (me). We're building technology to help disrupt the small/medium business recevables space. Our software will help mom-and-pops collect money that is owed to them; without us, their options are pretty bleak (try and recover themselves or go to the guy around the corner who will do the proverbial \"baseball-bat on kneecaps\" ploy).<p>Requirements are: Super smart, amazing at Ruby on Rails OR JavaScript OR Django. You must be willing to attend and/or present at meetups, conferences, etc. and represent Funding Gates so that other awesome folks want to work here, so you must have great written and verbal communication skills.<p>Our company is optimized for developer happiness, have unlimited vacation and a Results Only Work Environment (<a href=\"http://www.gorowe.com\" rel=\"nofollow\">http://www.gorowe.com</a>), and is run by folks that know how to treat developers. See one of my submissions:<p><a href=\"http://news.ycombinator.com/item?id=3729302\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3729302</a><p>Contact rogish at fundinggates.com with your github, stackoverflow, etc.<p>Thanks!!<p>--<p>Matt","time":1338562264,"type":"comment"},{"by":"Aloisius","id":4054285,"parent":4053076,"text":"San Francisco, CA - SeatMe<p>SeatMe is hiring! We're a cozy 15 person <i>restaurant reservation startup</i> in downtown San Francisco and we need your help! We're in search of:<p><pre><code>  * iOS developers (Objective-C for iPad and iPhone)\n</code></pre>\nWe offer a very competitive salary, benefits, moving costs, equity options, regular company dinners at restaurants around SF, catered lunches and an awesome culture for all full-time employees.<p><a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a> or email jordan@seatme.com!","time":1338567980,"type":"comment"},{"by":"kevbo","id":4055824,"parent":4053076,"text":"Evanston, IL<p>Junior Python Test Engineer at Leapfrog Online<p>We're the leading independent digital direct marketing firm in the country, developing programs for Fortune 500 marketers to find and convert the right customers. We build complex app ecosystems with frameworks like Django and Rails sitting on top, with a mound of open source software supporting them.<p>We're looking for a junior-level Python Developer to join our Test Engineering team, writing functional, integration, and unit tests in Python for our Django-powered business platform. As part of the Operations team, we also do light system administration and help write monitoring tools.<p>Requirements: an intense attention to detail, a love of learning, a passion for problem-solving, and a good attitude and sense of responsibility. You should also have experience with Python (or be willing to transition from another dynamic language like Ruby or PHP); be comfortable working on a *nix command line; and have general knowledge about HTML, CSS, and JavaScript. Experience with mobile device testing is a plus.<p>We're committed to agile and open source; we use packages like mechanize, twill, Selenium (including Selenium Grid), and nose every day.<p>Interested? If so, we offer a competitive salary plus an incentive and benefits package, and a close-knit team who likes what they do and has fun doing it. If you think you're a good fit for this position, apply with your resume and salary history. kboers (at) leapfrogonline.com","time":1338585257,"type":"comment"},{"by":"hellopat","id":4100857,"parent":4053076,"text":"COMPANY (Philadelphia, PA)\nOneTwoSee\n<a href=\"http://www.onetwosee.com\" rel=\"nofollow\">http://www.onetwosee.com</a>\npclark@onetwosee.com<p>A funded social television startup focusing on companion applications.<p>BASIC DESCRIPTION (Front End Developer)\nCut up and implement layouts from our graphic designer.  This isn't just building static web pages from mock-ups.  Our pages display real-time data via AJAX and involve complex behaviors and animations.  Many of our designs involve implementing custom meters and graph widgets based on statistical data from our application server. You must be able to implement these using HTML5, CSS, and Javascript.<p>NECESSARY SKILLS\nExpert level knowledge in HTML, CSS, and Javascript.\nExpert at troubleshooting and building around cross-browser/cross-platform inconsistencies.\nExperience with, but not total reliance on, Javascript libraries and CSS frameworks (e.g. jQuery, Twitter Bootstrap, etc).\nHand code your HTML, CSS, and Javascript.\nMake mobile-friendly versions of pages using CSS media queries.\nGeneral knowledge of Photoshop.\nGood design and UX sense.\nExperience with version control software.  Preferably git.\nLove discovering and applying new technologies and techniques.<p>BONUS\nExperience with compiled CSS systems like Less and Sass.\nExperience with NodeJS and the ExpressJS framework.\nExperience with backbone.js.\nExperience building vector graphic widgets with RaphaelJS or, even better, your own library.","time":1339514208,"type":"comment"},{"by":"alexgandy","id":4055542,"parent":4053076,"text":"6fusion - Raleigh, NC.<p>6fusion is an innovative Utility Metered Cloud company that has emerged in this new era of utility computing with a refreshing vision for the future, cutting-edge technologies and a unique commercial business model.<p>We're looking for:<p>1) Front-End Developers (<a href=\"http://www.6fusion.com/company/careers/job-description-front-end-developer/\" rel=\"nofollow\">http://www.6fusion.com/company/careers/job-description-front...</a>)<p>2) Full-Stack Engineers<p>3) QA Engineers<p>Email jobs@6fusion.com for more information.","time":1338582136,"type":"comment"},{"by":"brianmwang","id":4053308,"parent":4053076,"text":"New York, NY - Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>)<p>iOS Developer<p>Who We're Looking For\n- Considerable experience building and shipping iOS apps.<p>- You are obsessed with delivering a great user experience.<p>- You work well with small, tight-knit teams.<p>- You prioritize strong communication above all else. A team that stays in sync is a team that gets shit done.<p>About Us\nFitocracy is a fitness social network powered by game mechanics to make exercise a more addictive, accessible experience for all. Nearly half a million people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We turn life into the ultimate RPG where you are the hero that levels up, beats quests, and finds the best version of yourself.<p>We aim to provide the motivation, information, and community necessary to \"re-wire\" people's brains so they make sustainable, impactful changes in their lives.<p>We are a small, 6-person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups and Eniac Ventures. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p>Contact<p>Email me at brian@fitocracy.com","time":1338558350,"type":"comment"},{"by":"axylone","id":4054256,"parent":4053076,"text":"Seattle, WA - ExtraHop Networks - Software Engineers, Testing Engineers, Support Engineers, Sales Engineers, and more.<p>ExtraHop is a ~4 year old, fast growing startup building network appliances for application analysis.  Think HTTP/DB/memcache/NAS/etc processing times for all the servers in a datacenter, all by passively watching the network.<p>I'm a software engineer at ExtraHop and here's why I love my job:<p>1. The team is amazing and everyone makes a difference. The two founders, Jesse and Raja, designed and built BigIP v9 when they were at F5 Networks before founding ExtraHop, and are still very much involved in engineering. It's a great working environment and we have a lot of fun.<p>2. Hard problems at all levels.  We parse a bunch of different protocols at 10Gbps by writing high-performance multithreaded C and our own linux kernel drivers.  Our datastore handles 200,000 inserts a second with 10MB/s of data.  Our UI has a ton of charts and tables, with data going through django and tornado.  We use python, C, javascript, flex (slowly moving to a new UI with html5 + javascript), and a modified yacc+bison for some of our protocol parsers. You can hack anything from C to the front-end design and anywhere in between.<p>3. Our customers love it.  It's awesome to see problems diagnosed and solved with our box.<p>jobs@extrahop.com<p><a href=\"http://www.extrahop.com/company/jobs/\" rel=\"nofollow\">http://www.extrahop.com/company/jobs/</a>","time":1338567724,"type":"comment"},{"by":"derwiki","id":4054830,"parent":4053076,"text":"San Francisco, fulltime systems/ops and engineering, Causes - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a><p>At Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 12-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, etc. Ways we're trying to make ourselves better engineers:<p>- deliberate practice with our tools. If you are a vim user, we have the programmer who wrote Command-T on staff and he's a great person to learn from - every changeset gets pushed to Gerrit where it waits to get a +1 from our build suite (that runs in 3 minutes) and a +1 from a human reviewer<p>- over the last 4 months, we've upgraded from Rails 2.1 to 3.2.3 and are using the static asset pipeline, SASS/Compass, and HAML. We're the largest site I know of on Rails 3.2.<p>- everyone is encouraged to take one hour from their day to learn about something they wouldn't otherwise<p>- every story is scoped so that it can be completed in less than a day. We don't branch, we just work on top of master. We've found that the closer we stay to master, the less needless work we create for ourselves<p>Causes is a great place to better yourself and better the world. We're particularly looking for a systems/ops/network engineer to help wrangle our colo. Apply through the site or adam@causes.com if interested!","time":1338574981,"type":"comment"},{"by":"ruckusred","id":4071392,"parent":4053076,"text":"MoviePass is looking for an authoritative Dev Leader, with the ability to collaborate across departments. You are confident inheriting legacy code that needs improvement. Testing frameworks should be part of your daily workflow - preferably RSpec/Cucumber/Web as well as Continuous Integration (both setup and use). You have experience with:<p>'separation of concerns', 'skinny controllers / fat models', 'progressive enhancement'\nExternal API's - producing/consuming XML-based data feeds\nPayment gateways and e-commerce solutions.\nCreating mobile sites\nNot required but a big plus -<p>Experience deploying/managing apps on EngineYard\niOS or Android Develop experience\nRequired Skills:<p>Must have excellent communication skills - both verbal and written, able to articulate ideas\nAble to break a job into smaller tasks and accurately estimate time to complete overall project\nAble to plan and develop a coherent system across various platforms - desktop, mobile, mobile apps\nHTML5 &#38; CSS3 - best practices and graceful degradation\nShould be very comfortable with Javascript/JQuery/Ajax\nGit - should be comfortable with not only basic usage, but more advanced features as well i.e. push/pull branches, gitflow, etc.<p>We're located in NYC, SoHo area.<p>Send your info to kristina@moviepass.com or apply via our website - <a href=\"http://moviepass.theresumator.com/apply\" rel=\"nofollow\">http://moviepass.theresumator.com/apply</a>","time":1338936495,"type":"comment"},{"by":"davedd","id":4053849,"parent":4053076,"text":"Remote.<p>This position is remote and affords a semi-flexible working schedule.<p>Job Position: Senior Security Support “Ninja” Analyst<p>Description: As a Senior Analyst you will be responsible for:<p>-Handling our most complex security cases (hacked servers, broken sites, hidden malware, etc)<p>-Troubleshooting broken websites (WordPress, Joomla, osCommerce, Magento, vBulletin, Drupal, and more)<p>-Direct engagement with the research team to expand our engine<p>-Queue wrangler, engaging with Junior staff and streamlining processes<p>As you might imagine, its not all unicorns and rainbows we’re looking for a technical type and specifically someone with the following traits:<p>-Advanced Linux experience – CLI<p>-Server hardening and security experience (using firewalls, NIDs, HIDs, etc)<p>-Experience with log analysis, malware analysis or forensics a big plus<p>-System administration experience with WordPress, Joomla, ,etc osCommerce or other CMSs<p>-Shell scripting required<p>-PHP and C coding experience useful, but not required.\n-Open source and community participation and contributions a plus<p>*We love to see active community engagement. If you’re already assisting on forums (WordPress.org, open source project, github, stackoverflow, stopbadware) please include your account name as a reference<p>Link: <a href=\"http://sucuri.net/company/employment\" rel=\"nofollow\">http://sucuri.net/company/employment</a>","time":1338563880,"type":"comment"},{"by":"gommm","id":4054903,"parent":4053076,"text":"Web Age Corp is looking for developers in Shanghai, China.<p>We're a small company doing mostly consulting in Ruby on Rails and Python in order to fund our own products eventually. Most of our customers are new startups that want to build an MVP and test the market, so it's pretty exciting! We get to see a project from the very beginning.<p>Our work environment is relaxed and flexible. Working from home is ok (although we do think that meeting a few times a week in the company is helpful).<p>When it comes to technical decisions, you get a real say and we will really listen to you, we don't just want drones that take no initiative and are content to follow orders when they really think it's wrong.<p>What we're looking for:<p>- You like learning new technologies, when you see a new framework like Meteor or Derby, you get excited and try to play with it to form an opinion.<p>- You like to be given a lot of freedom and taking initiative. You don't expect someone to tell you everyday what needs to be done.<p>- You've got experience in Python or Ruby (but frankly if you don't and have a lot of experience in Clojure, OCaml, Lisp, Go, Dart, any other language, still contact us)<p>- You can show us some projects you've shipped. It can be anything: a fun weekend project, an open source project, ...<p>If you're interested and want to learn more, contact us at jobs@webagecorp.com<p>We're also interested in Interns.","time":1338575739,"type":"comment"},{"by":"bostonpete","id":4053555,"parent":4053076,"text":"Burlington, MA - Exa (www.exa.com)<p>We've got a number of positions open, but I'll focus on the position in my group. We're a small team doing ongoing development (C++, Qt, multi-platform) on the preprocessor for our flagship CAE simulation product while simultaneously ramping up the design effort for the next generation of the product, which will expand its scope significantly.<p>Here's the description of this position: <a href=\"http://exa.com/sr-sweenng-cae-c.html\" rel=\"nofollow\">http://exa.com/sr-sweenng-cae-c.html</a>","time":1338561352,"type":"comment"},{"by":"j8weeks","id":4064269,"parent":4053076,"text":"Seattle (Kirkland), WA<p>ServiceNow is hiring in all areas. My group is looking for:<p>* Strong software developers primarily with Python and Scala experience to work on distributed systems, advanced complex event processing (CEP) and real time analytics (e.g. Storm, Esper, RabbitMQ, Zookeeper, NoSQL).<p>* A UI/UX engineer with a strong javascript, HTML5, CSS background to work with libraries and tools such as D3, Cubism, Crossfilter.<p>* Motivated systems engineers looking to integrate distributed data centers and related tooling into a seamless, autonomic, industry-leading operation. Puppet and Python experience helpful.<p>ServiceNow has filed for IPO, and is a positive, egalitarian and progressive work environment with a strong customer focus. Here are some relevant links:<p><a href=\"http://www.forbes.com/sites/markfidelman/2012/04/12/the-25-highest-rated-ceos-that-are-hiring-now-chart/\" rel=\"nofollow\">http://www.forbes.com/sites/markfidelman/2012/04/12/the-25-h...</a>\n<a href=\"http://www.zdnet.com/blog/btl/service-now-aims-for-higher-profile-doubling-of-revenue/55221\" rel=\"nofollow\">http://www.zdnet.com/blog/btl/service-now-aims-for-higher-pr...</a><p>Hiring page here:\n<a href=\"http://newton.newtonsoftware.com/career/CareerHome.action?clientId=8aa00506334a02da01334beeedb23712\" rel=\"nofollow\">http://newton.newtonsoftware.com/career/CareerHome.action?cl...</a>","time":1338821946,"type":"comment"},{"by":"jcstauffer","id":4053346,"parent":4053076,"text":"Woburn, MA - True Fit (<a href=\"http://jobs.truefit.com/\" rel=\"nofollow\">http://jobs.truefit.com/</a>)<p>True Fit, the global leader in fit personalization, delivers proven fit software to retailers selling footwear &#38; apparel online, allowing retailers to personalize their catalog to each consumer’s personal fit and style preference.<p>Americans spend $300 billion on clothing and footwear every year, but less than 10% of that is purchased online and 40-60% of those products are returned. Our software is proven to dramatically reduce the number of products returned, increasing the confidence of shoppers so that they become buyers, dramatically improving conversion rates and driving huge value for our retail partners.<p>Led by a team of Software, Apparel, and Retail veterans, we are getting a ton of traction: We are currently live at Macys and Nordstrom, have hundreds of brand partners, and were recently profiled by WSJ (behind paywall, but see video here: <a href=\"http://online.wsj.com/video/82F25EDC-59F6-4330-BD76-96924F5D5359.html\" rel=\"nofollow\">http://online.wsj.com/video/82F25EDC-59F6-4330-BD76-96924F5D...</a>).<p>We are looking for Ops, SW, and Machine Learning engineers (see <a href=\"http://jobs.truefit.com/\" rel=\"nofollow\">http://jobs.truefit.com/</a> for detailed job descriptions), but we're expanding quickly and always interested in meeting smart people.","time":1338558946,"type":"comment"},{"by":"gtuhl","id":4053316,"parent":4053076,"text":"Atlanta, GA - Full time, local, relocation possible<p>MailChimp is looking for infrastructure engineers to join our team. This is a full time position in Atlanta that will help build, support, and monitor the infrastructure our company depends on.  We handle tremendous volume and support millions of users that love our products.<p>We are looking for people with independent troubleshooting skills, strong experience with Linux, and a desire to monitor and automate everything.<p>- Linux experience, especially at higher server counts<p>- Scripting and coding<p>- Familiarity with pieces of our primary stack (nginx, apache, php, memcache, mysql)<p>- Experience building high volume systems is a big plus<p>- Strong experience with mysql is a huge plus (sharding, replication, HA)<p>MailChimp is a self-funded and profitable Atlanta-based company that is growing fast.  We offer competitive salaries, exceptional benefits and perks, phone plan coverage, coffee, snacks, top tier equipment, and an environment that empowers engineers to have a big impact.  We work in small teams, there are no project managers, no product managers, and engineers are trusted to work autonomously and make good decisions.<p>Also, in addition to the above, I am looking for somebody with tremendous networking and colo experience.<p>You can email me directly at infrastructurejob@mailchimp.com","time":1338558541,"type":"comment"},{"by":"eblah","id":4055528,"parent":4053076,"text":"Online Commerce Group is looking for a PHP developer in Montgomery, AL.<p>Job Description and Responsibilities\nWith big initiatives planned in 2012, Online Commerce Group is looking for a driven, motivated PHP software programmer with experience distributing and supporting enterprise level software.<p>Desired Technical Skills<p>+ Object oriented design, design patterns, and data structures<p>+ Experience with PHP<p>+ Strong demonstrated RDBS experience with at least one of the following: SQL Server, Oracle, or MySQL<p>+ Working knowledge of at least one JavaScript framework (eg: Prototype.js, jQuery) along with strong Ajax experience is a plus<p>+ Experience working with a version control system; GitHub is a plus<p>+ Experience in releasing a software related package<p>Ideal candidates are those who possess the following attributes:<p>+ Those who are PASSIONATE about their work and desire to learn and grow in their craft<p>+ Those who think outside the box of conventional thinking<p>+ Those asking and answering the question: “How can we make this easier to use?”<p>+ Those who love semantics and well-structured code<p>+ Looking to bring networking and connectivity to the current team<p>+ Those with great character who are servants to those around them<p>+ Those who believe the impossible is possible<p>E-mail justin@onlinecommercegroup.com if interested.","time":1338581913,"type":"comment"},{"by":"Hovertruck","id":4053845,"parent":4053076,"text":"Chartbeat is hiring in NYC (Meatpacking District). H1B possible.<p>We're a real-time analytics platform focused on providing data to the people on the front line (people who can take immediate action), rather than the analysts in the back office. Our stack is Python (django/tornado), C, MongoDB, and Google Closure for our JavaScript needs. Hiring engineers,  designers, support, sales... Pretty much everything.<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1338563823,"type":"comment"},{"by":"petermorano","id":4054967,"parent":4053076,"text":"TrainSignal is looking for a JavaScript developer in Schaumburg, IL (Chicago)<p>Help us craft beautiful, engaging, user-friendly websites and mobile applications. In this role, you’ll work closely with the development team to implement client-side solutions to support our user experience initiatives. You’ll be primarily focused on building and maintaining a scalable, lean framework responsible for loading data and handling user interactions after the DOM is loaded.<p>You are a successful candidate if you are an innovative developer, a team player, and are eager to create interactions that engage our users. Additionally, you have a working knowledge of modern JavaScript frameworks and technologies, such as Backbone.js, Ember.js, Require.js, Node, SignalR or Video.js. Also, you admire the beauty of JSON, both visually and conceptually,<p>The ideal candidate has a passion and vision for conceptualizing and communicating interactions to the development team and business stakeholders. Working directly with other application developers to integrate client-side interactions with application data through API calls.<p><a href=\"http://trainsignal.theresumator.com/apply/wD8RD7/JavaScript-Developer.html\" rel=\"nofollow\">http://trainsignal.theresumator.com/apply/wD8RD7/JavaScript-...</a>","time":1338576430,"type":"comment"},{"by":"garysieling","id":4053148,"parent":4053076,"text":"Philadelphia, PA (Blue Bell)\nFull-time, Intern - Software Engineers &#38; Operations<p>Join a small, but rapidly growing technology company in the Philadelphia suburbs. We're building a hosted, cloud-based offering for clinical trials (Java/Postgres). The engineering group is very self-directed and is experimenting with new technologies ranging from an iPad client to Scala.<p><a href=\"http://www.wingspan.com/careers/\" rel=\"nofollow\">http://www.wingspan.com/careers/</a>","time":1338555959,"type":"comment"},{"by":"jackfoxy","id":4054379,"parent":4053076,"text":"San Francisco<p>Senior Web Designer<p>Do you have a passion for design?<p>Do have the desire to create something unique that will allow people to interact and share worldwide?<p>Do you have the ability to take massive library of online content and present it simply yet with style and élan – like the elegant interface of an Apple product combined with the visceral excitement of a Ferrari?<p>If you answered yes to all of the above, this is an opportunity you should check out.<p>We are creating something big and exciting.  It has to do with media, games and sharing.<p>Looking for a senior UI and UX designer to work at a tech start-up in San Francisco<p>HTML, CSS, HTML5, experience in Mobile a plus<p>5+ years of experience in professional web development<p>Compensation is a combination of salary and pre-A Round equity<p>We are a small, tight, dedicated team.<p>You will be getting in on the ground floor and building something big.<p>We are going redefine how people play and interact with digital media.<p>We are still in stealth mode – we can provide more details to qualified candidates who sign an NDA<p>For more info, please contact Clint O’Conner at clinto@product-pro.com\nPlease send a resume, and tell us who/what are your major design influences and why?","time":1338569371,"type":"comment"},{"by":"smellypantsman","id":4053634,"kids":[4053842],"parent":4053076,"text":"Cambridge, UK<p>AllYearbooks is looking for one or two talented full-stack developers to help us build our Node.js single-page collaborative, real-time web-app (phew... bit of a mouthful that one!) for creating real, hard-copy printed yearbooks.<p>You'll be using: node.js, coffeescript, html5 canvas, backbone, jquery, ubuntu servers, redis, postgresql etc etc.<p>More at: <a href=\"http://allyearbooks.co.uk/jobs/dev\" rel=\"nofollow\">http://allyearbooks.co.uk/jobs/dev</a>","time":1338562071,"type":"comment"},{"by":"JaneStreet","id":4054810,"parent":4053076,"text":"Jane Street - New York (H1B ok), London, Hong Kong<p>Jane Street is looking to hire great software developers, researchers, and system administrators with an interest in functional programming.  OCaml, a statically typed functional programming with similarities to Haskell, Scheme, Erlang, F# and  SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business,  supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.<p>The atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.<p>Apply here: <a href=\"http://janestreet.com/apply\" rel=\"nofollow\">http://janestreet.com/apply</a>","time":1338574800,"type":"comment"},{"by":"chrisdinn","id":4054227,"parent":4053076,"text":"mDialog - Toronto, ON - Local<p>At mDialog, our product powers video delivery for some of the largest, most well-known brands in the world and helps bring the most popular shows to connected devices like the iPhone, iPad, Apple TV, Android, and Roku. We partner with the most successful device manufacturers and are considered thought leaders in the future of television broadcasting. We believe we are at the dawn of new age in broadcasting and are the technology leaders enabling the shift.<p>We're looking for developers willing to help us unleash the power of Scala and Akka (<a href=\"http://akka.io\" rel=\"nofollow\">http://akka.io</a>), two core technologies powering the mDialog platform. While there aren't yet many experienced Scala developers, we have successful team members with backgrounds in Ruby, C#, C++ and, of course, Java. At mDialog you will gain experience with functional programming, distributed systems, messaging and adaptive bitrate video streaming. If you've got a passion for software you'll succeed on our dev team, regardless of your current day-job language.<p>If you're interested, please visit <a href=\"http://www.mdialog.com/careers.html\" rel=\"nofollow\">http://www.mdialog.com/careers.html</a> or email cdinn@mdialog.com.","time":1338567434,"type":"comment"},{"by":"jmburros","id":4053458,"parent":4053076,"text":"GetGlue is hiring in NYC - full time, local, relocation.<p>GetGlue is an awesome place to work. We are focused on innovation and value speed and iteration. We are looking for smart, passionate people who love building things to join our team. We offer a competitive salary, full medical/dental benefits, 401k, 3 weeks vacation, gym reimbursement, and other cool perks.<p>With over 2M users, GetGlue is building one of the largest social networks for entertainment. We have also partnered with 75 major television networks and 10 movie studios. GetGlue is based in New York City and backed by prominent venture capital firms. GetGlue won Mashable's 2011 Breakout Startup of the Year award and has been covered by CNN, LA Times, Wall Street Journal, Wired, Fast Company, Billboard, and many other publications.<p>You can email us at jobs at getglue dot com.<p>Mobile Engineer: <a href=\"http://getglue.com/jobs/mobile_engineer\" rel=\"nofollow\">http://getglue.com/jobs/mobile_engineer</a>\nPython Engineer: <a href=\"http://getglue.com/jobs/python_engineer\" rel=\"nofollow\">http://getglue.com/jobs/python_engineer</a>\nData Scientist: <a href=\"http://getglue.com/jobs/data_scientist\" rel=\"nofollow\">http://getglue.com/jobs/data_scientist</a>","time":1338560213,"type":"comment"},{"by":"smackjer","id":4058023,"parent":4053076,"text":"Terrible Labs is looking for a Lead UI/UX Designer to help us build great apps and an even greater team!<p><a href=\"https://sites.google.com/a/terriblelabs.com/careers/\" rel=\"nofollow\">https://sites.google.com/a/terriblelabs.com/careers/</a><p>You’ll collaborate closely with our clients and our world-class development team to craft gorgeous, intuitive experiences that people are thrilled to use.<p>You’ll teach. You’ll learn. You’ll create.<p>You’ll build and lead a world-class design team.<p>You should have experience in web and graphic design, typography, UX, and mobile. Ideally you’re an expert at HTML5, CSS3, Sass, and maybe even some JavaScript or CoffeeScript.<p>ABOUT TERRIBLE LABS<p>Terrible Labs is a Boston-based consultancy that builds web and mobile apps for some pretty awesome clients. We specialize in Ruby on Rails and HTML5. We just got started in 2011 but have already built a great brand and have big plans for the future!<p>We offer all employees a competitive salary, 100% paid health and dental insurance, a take-what-you-need PTO policy, a gym membership, RailsCasts Pro subscription, Intelligent.ly stipend, and we'll pay your smart phone bill (even though we don't expect you to be on call 24/7).","time":1338644145,"type":"comment"},{"by":"JackHerrick","id":4055920,"parent":4053076,"text":"Palo Alto or REMOTE in PST timezone<p>wikiHow<p>Software Engineer<p>wikiHow is the world's how to manual. Think \"Wikipedia for hot-to instructions\". Over 30 million users a month. Here is why working at wikiHow is unlike anything else in Silicon Valley:<p>* We are profitable and offer a profit sharing plan.\n* We are self-funded. We have not accepted VC or angel money. We don't chart our strategy based on the whims of investors.\n* We don't think working crazy startup hours is productive or healthy. We have rich lives outside of work. \n* Our team is gender balanced. 50% female, 50% male. \n* We like walking. We have a few treadmill desks and we all have FitBits.\n* Our small, cohesive team loves to innovate. \n* We take wikiHow's educational mission seriously. We put our mission above short term business goals. \n* We all work from home one day a week. \n* We work in a homey downtown Palo Alto office, 2 blocks from Caltrain and University Avenue.\n* wikiHow is one of the top 200 sites on the web. Over 30 million readers a month. Your mom will use and love your product. \n* We're delightfully quirky. But you probably figured that out already.<p>Email me, the founder directly, Jack@wikiHow.com","time":1338586421,"type":"comment"},{"by":"rb2k_","id":4053616,"parent":4053076,"text":"Burlington, MA - Acquia (www.acquia.com)<p>Lots of open positions. The team I work with is looking for an automation engineer (<a href=\"https://www.acquia.com/careers/job-listing/automation-engineer\" rel=\"nofollow\">https://www.acquia.com/careers/job-listing/automation-engine...</a>). Lots of internal and external tooling with Ruby on EC2 in a CI environment for web-based products. Some of the buzzwords: Ruby, Cucumber, Capybara, Jenkins, EC2, S3, Varnish, NginX. We're basically looking for somebody who knows their way around linux and the web stack from DNS to XPATH.<p>There are another cool job openings going in the same general direction:<p><a href=\"https://www.acquia.com/careers/job-listing/cloud-sys-engineer\" rel=\"nofollow\">https://www.acquia.com/careers/job-listing/cloud-sys-enginee...</a><p><a href=\"https://www.acquia.com/careers/job-listing/cloud-software-engineer\" rel=\"nofollow\">https://www.acquia.com/careers/job-listing/cloud-software-en...</a><p>Feel free to reach out before uploading your resume using the page<p>p.s. also hiring marketing/sales/... <a href=\"https://www.acquia.com/careers/open-positions\" rel=\"nofollow\">https://www.acquia.com/careers/open-positions</a>","time":1338561986,"type":"comment"},{"by":"ladon86","id":4053892,"parent":4053076,"text":"ClassDojo<p>FULLTIME or INTERN in PALO ALTO, CA<p>ClassDojo is used by thousands of teachers to manage students’ behavior in the classroom, using real time feedback and rewards that can also be shared with parents.\nWe're an edtech startup funded by some of the biggest names in the valley, and we're one of the fastest growing education companies of all time. PG has invested in us, but we didn't do YC.<p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board.<p>If you're a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n  https://classdojo.wufoo.com/forms/join-classdojo/  \n  --------------------------\n</code></pre>\nOr email jobs@classdojo.com<p>You can read about the work and environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a>  \nWe are looking for:<p><pre><code>  Lead Software Engineer  \n  Lead Front-end Developer  \n</code></pre>\nIf you think you're a good developer but don't fit into those buckets, get in touch anyway.<p>Cheers,  \nLiam","time":1338564242,"type":"comment"},{"by":"jyeung001","id":4053400,"parent":4053076,"text":"CareCloud: Miami, FL - FULLTIME, INTERN (<a href=\"http://www.carecloud.com\" rel=\"nofollow\">http://www.carecloud.com</a>)<p>What we do: CareCloud’s mission is to create a digital ecosystem by leveraging cutting-edge technology to connect a disjointed healthcare industry and ultimately improve the healthcare experience for patients, providers and healthcare professionals. We’re disrupting the status quo and giving medical practices elegant, easy-to-use software solutions to increase profitability and productivity.<p>If you are passionate about technology, obsessed over user experience and thrive on solving complex problems, we want to meet you.<p>We're looking for talented front-end and back-end developers to join our team.  Some of the basic requirements are:\n* JS/HTML/CSS of course\n* Experience with Ruby, Ruby on Rails a plus\n* Understand design/architectural patterns (mvc, factories, singletons, etc)\n* Experience working with Source Control systems (git, mercurial, etc)\n* Some experience working in agile development environments<p>Interested? contact me at <a href=\"https://twitter.com/jyeung001\" rel=\"nofollow\">https://twitter.com/jyeung001</a> for more details.","time":1338559675,"type":"comment"},{"by":"gnubardt","id":4054235,"parent":4053076,"text":"Brightcove - Boston, MA; Seattle, WA\n<a href=\"http://brightcove.com/careers\" rel=\"nofollow\">http://brightcove.com/careers</a><p>We're hiring Software &#38; Systems engineers in Boston &#38; Seattle to help build and scale our video publishing platform.  We use Java, Clojure, Node, Rails &#38; Groovy to build the service that streams over 750 million videos a month (second most after youtube).<p>We just moved our headquarters to a LEED Platinum building on the Boston waterfront (5 minutes from South Station), complete with the Aeron chairs at every desk, plentiful whiteboards, an R&#38;R area and fully stocked kitchen.  We have frequent social gatherings (from board games to a company wide talent show) and offer excellent benefits (health, vision, dental, life, 401k, unmetered vacation).<p>i've been here for 4 years and love it!  There's a really great culture of nice people who are wicked smart.  Send me an email if you have any questions!<p>We're also hiring Account Directors in DC, Atlanta &#38; London, Technical Support Engineers in Boston &#38; London, a Sales Director &#38; Engineer (Atlanta &#38; London, respectively), and a Product Designer in Seattle.","time":1338567483,"type":"comment"},{"by":"slawomir","id":4063539,"parent":4053076,"text":"Poland, Warsaw<p>Business operations<p>Cam on Duty (<a href=\"http://camonduty.com\" rel=\"nofollow\">http://camonduty.com</a>) is innovation-driven startup that combines technology with great user experience. You'll join team that is focused on creating great product and changing the way people use webcams.<p>This role will require creating high level strategies and executing them.  You'll help find out where Cam on Duty should be headed, and help us to get there.<p>You'll work directly with all parts of the Cam on Duty team - product, engineering, design to help company to grow. You'll help identify the right partners, negotiate and close business agreements.<p>Responsibilities:<p>* Identify and company’s biggest challenges<p>* Create analyses on strategic decisions and execute them<p>* Continually refine those decisions as environment changes<p>Requirements:<p>* Analytical with ability to process information<p>* Great organizational skills<p>* Outstanding communication skills<p>* Ability to execute concrete action plans<p>* Comfortable working with minimal guidance<p>* Passion for technology<p>* Great skills in Excel<p>Email: ssadziak@bluesoft.net.pl","time":1338810337,"type":"comment"},{"by":"gsiener","id":4054284,"parent":4053076,"text":"C3 (fka Efficiency 2.0) - New York (NYC)\nSenior Rubyist/Craftsman - Be proud of your code and our mission <a href=\"http://bit.ly/N3QiHT\" rel=\"nofollow\">http://bit.ly/N3QiHT</a><p><i></i>About Us<i></i><p>We're building the future of energy efficiency. C3 (formerly Efficiency 2.0) is a NYC-based startup tackling the world's biggest problem - the conservation of our planet - and we are getting results. We offer consumers personalized advice, tools to help track progress and rewards for reducing their energy consumption. We are a multi-disciplinary team of motivated energy scientists, technology engineers practicing agile development, and energy gurus working to shape the future of energy efficiency.<p><i></i>What We’re Looking For<i></i><p>The right person for the job will have a strong commitment to engineering excellence and a drive for continuous process improvement. The other engineers on your team come to you for help with their problems because of your deep technical knowledge and your ability to distill complex business logic into a clean, maintainable set of classes and algorithms.<p>Want to hear more? Email me at Graham.Siener at C3energy dot com","time":1338567976,"type":"comment"},{"by":"leeny","id":4054313,"parent":4053076,"text":"TrialPay - Mountain View, CA (F/T, will cover relo)<p>For the last 5 years, we've been quietly changing the world of online advertising. We work on getting users to try new products and services, install new mobile apps, play new games, and visit new stores by giving them stuff that they already want for free.<p>We're looking for strong back-end engineers and people who like playing with data (we have a lot).<p>aline@trialpay.com","time":1338568435,"type":"comment"},{"by":"adambrod","id":4060117,"parent":4053076,"text":"Tagit (Mountain View, Ca) - Full Time, Local<p>Tagit needs a backend developer who is passionate about working in a startup! We are currently re-designing and re-vamping our website and mobile apps.<p>-<p>Ideally you are:<p>• A CodeIgnitor wiz (or can port PHP to Ruby or Node).<p>• You can use and maintain MySQL<p>• “The Big Lebowski” is on your top 10 list<p>• Are passionate about the startup culture<p>-<p>It would be awesome if:<p>• You are knowledgeable in web scaling<p>• You enjoy beer and/or coffee<p>• You can maintain a web server<p>• You know how to port MySQL to something like MongoDB<p>-<p>We are currently using CodeIgnitor PHP, and MySQL. We are also very open to migrating to more easily scalable technologies in the future, such as MongoDB, Rails, Padrino, &#38; Node.js.<p>We can potentially offer free housing in Mountain View. Payment/salary is negotiable according to experience, skill set, and overall passion for what you do<p>If this sounds like you, contact adamb@playtagit.com<p><a href=\"http://playtagit.com\" rel=\"nofollow\">http://playtagit.com</a><p><a href=\"http://angel.co/tagit\" rel=\"nofollow\">http://angel.co/tagit</a>","time":1338700036,"type":"comment"},{"by":"AdamGibbins","id":4055244,"parent":4053076,"text":"London, UK and Boston, MA - Full time.<p>TIM Group, previously youDevise.<p>We're a 100 person financial web development firm looking for developers and Linux system administrators.\nWe like JVMs, pairing, dashboards, metrics and SSD/Xeon powered workstations.<p>We've been known to sponsor Visa's.<p><a href=\"http://www.timgroup.com/careers/current-vacancies\" rel=\"nofollow\">http://www.timgroup.com/careers/current-vacancies</a>","time":1338579170,"type":"comment"},{"by":"curtis","id":4053909,"parent":4053076,"text":"Redwood City, CA<p>Tidemark Systems (<a href=\"http://www.tidemark.net\" rel=\"nofollow\">http://www.tidemark.net</a>, note \".net\") is hiring.  We're looking for backend and UI developers and a whole bunch of other positions as well.  The jobs page is at <a href=\"http://tidemark.net/company/careers\" rel=\"nofollow\">http://tidemark.net/company/careers</a>.  The company is well-funded but it's still in the very early growth phase.<p>Tidemark is building a cloud-based business analytics system, which is way more interesting than it might sound.<p>We've had a particularly difficult time finding good UI developers.  Our UI is web-based but we initially focused on the iPad as our primary platform.  Now we're generalizing the UI for laptop and desktop use.  We're using Sencha Touch for iPad and Ext-4 for the other platforms, and most of our client code is in CoffeeScript.  We're really pushing the frameworks beyond what they were intended to do, so we're looking for people who know really know the ins and outs of developing rich UIs with JavaScript/CoffeeScript, the HTML DOM, and CSS.<p>If this sounds interesting, my email is on my profile page.","time":1338564340,"type":"comment"},{"by":"amrox","id":4055038,"parent":4053076,"text":"San Francisco, CA (INTERN, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>We build wonderful educational games in San Francisco. If you are nice and want to help us make splendid products, we'd love to heard from you.<p>We're hiring in lots of areas! Here are a few:<p>* Backend engineer: So much data, so little time! If you can extract the signal from the noise, and want to improve the way people learn through our products, let's talk! Experience with scaling multiplayer games or web services is a huge plus.<p>* Mobile engineer: You build pocket-sized awesomeness on iOS and/or Android. We make games that teach people stuff. The perfect combination! We have plenty of fun and challenge projects for both mobile app and game developers.<p>* UI designer: We believe that great design is essential to build products people love. If you live to make jaw-dropping UI experiences (web and/or mobile), this is the place to be!<p>Email us at jobs@mindsnacks.com\nMore details: <a href=\"http://www.mindsnacks.com/careers/\" rel=\"nofollow\">http://www.mindsnacks.com/careers/</a>","time":1338577081,"type":"comment"},{"by":"chrisjconlin","id":4077353,"parent":4053076,"text":"2tor, New York City, FULL-TIME<p>Contribute to building the future of online education! Looking for everything from Javascript engineers to create tools that make the online learning experience engaging to those interested in building infrastructure that keeps data flowing between the components of our application to graduation software stack.<p>Some things you should be familiar with:<p><pre><code>  * Salesforce. Yes, a platform famous for it's click around declarative interface, \n    but also very powerful for building workflows and business processes when you know\n    how to code for it.\n  * Most of the tools we work with: Java, Python, Javascript, Unix/Linux (bash or zsh), \n    git, MySQL, MongoDB.\n  * You've worked closely or directly with AWS. Most importantly EC2, ELB, S3, \n    and CloudFront.\n  * Working with and building elegant HTTP-based APIs\n  * Working in small teams to build smart, beautiful web applications \n    that are a pleasure to use.\n</code></pre>\nSee full job description and apply here:<p><a href=\"http://jobvite.com/m?3kg3lfwI\" rel=\"nofollow\">http://jobvite.com/m?3kg3lfwI</a>","time":1339037011,"type":"comment"},{"by":"smilliken","id":4055501,"parent":4053076,"text":"San Francisco - Engineer<p>MixRank (YC S11) is a search engine for ads; we crawl the web and index ads, placements, keywords, landing pages, and pretty much everything that makes up an advertiser's campaign. With all of the data we collect, we provide competitive intelligence and analytics to advertisers, agencies, and ad networks. Along with this comes many interesting technical challenges, like scaling web crawlers, distributed analytics, and training predictive models to make intelligent recommendations to our customers.<p>We're looking for engineers that are interested in things like big data, web crawling, distributed analytics, and machine learning.<p>jobs@mixrank.com<p><a href=\"http://techcrunch.com/2011/06/30/want-to-see-which-ads-perform-best-yc-backed-mixrank-is-a-spy-tool-for-adsense/\" rel=\"nofollow\">http://techcrunch.com/2011/06/30/want-to-see-which-ads-perfo...</a>\n<a href=\"http://techcrunch.com/2011/12/13/display-ad-data-intelligence-startup-mixrank-raises-1-5m-from-mark-cubam-500-startups/\" rel=\"nofollow\">http://techcrunch.com/2011/12/13/display-ad-data-intelligenc...</a>","time":1338581638,"type":"comment"},{"by":"toponium","id":4053962,"kids":[4061329],"parent":4053076,"text":"Boston, MA -- Full-time\nLuckyLabs<p>Our motto is \"If you're going to squander your life, please, do it with us.\" And we feel the same way about our careers. So if you, like us, are excited about devoting your brief, precious time on Earth making mindless entertainment for the vast messy mass of humanity, you have found the best place to do it. Welcome!<p>We are committed to producing the finest \"snackable entertainment\" ever to clog a router or cause a traffic snarl. (Of course we don't advocate playing our games while driving. Just at red lights. And maybe stop signs, depending on the intersection. Or just pull over, will ya?)<p>We are looking for smart, talented software engineers, app developers, creative designers and social-media/marketing geeks. Experience helpful but not required.  More details here <a href=\"http://angel.co/luckylabs#recruiting\" rel=\"nofollow\">http://angel.co/luckylabs#recruiting</a><p>If you want to have massive fun and stimulation creating apps and content that provide massive fun and stimulation to the human race, please let us know... jobs@luckylabs.com","time":1338564825,"type":"comment"},{"by":"finken","id":4054975,"parent":4053076,"text":"Park City, Utah - earthmine inc. - Full-Time - <a href=\"http://www.earthmine.com\" rel=\"nofollow\">http://www.earthmine.com</a><p>We’re looking for:<p>* Lead Software Engineer - immediate need for development in C# with .NET<p>More details:<p>* <a href=\"http://www.earthmine.com/Company?Jobs\" rel=\"nofollow\">http://www.earthmine.com/Company?Jobs</a><p>* <a href=\"http://www.youtube.com/user/earthmine\" rel=\"nofollow\">http://www.youtube.com/user/earthmine</a><p>* Being based in Salt Lake or Park City you’ll of course have the opportunity to leverage the powder rule: we’ll see you in the office at noon because a foot of fresh fell the night before.<p>Us:<p>earthmine collects, processes, and delivers high-resolution, 3D street-level panoramas. How are they 3D?  Every non-sky pixel in the panorama has a 3D coordinate: latitude, longitude and elevation.  earthmine data is powering applications ranging from innovative local search and augmented reality to 3D mapping, GIS and asset management systems.<p>Interested?<p>* contact me directly: josh [dot] finken [at] earthmine [dot] com","time":1338576499,"type":"comment"},{"by":"stevewilhelm","id":4054123,"parent":4053076,"text":"UI/UX Designer, Palo Alto, CA, Euclid, euclidelements.com,<p>Help Euclid digitize the physical world.  Through innovative sensor technology and data engineering, we’re arming brick and mortar retailers with a new class of analytics to help them improve their profitability and shopping experience.<p>The dataset we’re providing is revolutionary, and we want our product experience to be just as special.  Current retail business intelligence tools are clunky, ugly, and tedious.  Euclid wants to break to mold by delivering insights AND a beautiful and effortless product experience.<p>The Product Designer will work closely with the Product and Engineering teams to create this experience.  Primary responsibilities will include prototyping and designing user interfaces, producing gorgeous visual design, and delivering production ready assets.  The Product Designer will also help make sure the product is well represented on our website and in our marketing collateral.<p><a href=\"http://euclidelements.com/about-us/jobs\" rel=\"nofollow\">http://euclidelements.com/about-us/jobs</a>","time":1338566313,"type":"comment"},{"by":"twohey","id":4053288,"kids":[4059564],"parent":4053076,"text":"Los Altos, CA -- Ness (likeness.com) -- Local, H1B<p>Ness Computing's mission is to make search personal. By combining its understanding of human nature with its expertise in search, recommendations and social networking, Ness delivers experiences that are more deeply personal than ever before.<p>Ness is looking for an eager, fast-learning iOS developer with a passion for creating software that delights users. We’re looking for someone who wants to help push the platform to its limits, with implementation approaches beyond even Apple’s first-party apps.<p>You are someone who shares our love of beautifully designed, immersive products. You are detail-oriented, believe the little things matter, and won't consider a task complete until everything is just right. These qualities are more important than experience, but practice implementing user interfaces and iOS applications is a plus. An ideal candidate will know Objective-C and Cocoa Touch well, but is always ready to learn more.<p>If this sounds like something you'd like to help build, please shoot me an email.","time":1338557994,"type":"comment"},{"deleted":true,"id":4054388,"parent":4053076,"time":1338569479,"type":"comment"},{"by":"jwegan","id":4054900,"parent":4053076,"text":"Palo Alto, CA<p>(H1B welcome)<p>Shopkick - <a href=\"http://www.shopkick.com/jobs.html\" rel=\"nofollow\">http://www.shopkick.com/jobs.html</a><p>Shopkick is cross-retailer loyalty platform with over 4 million users. Macy's, Best Buy, Target, Old Navy, General Mills, and Proctor &#38; Gamble are just a few of our partners. We are backed with $20 million in funding from Kleiner Perkins and Greylock Partners. We're still small, but we are growing fast.<p>Here is a recent Times article on our national rollout with Target: <a href=\"http://moneyland.time.com/2012/05/25/scan-this-target-encourages-shoppers-to-scan-items-with-smartphones-nationwide/\" rel=\"nofollow\">http://moneyland.time.com/2012/05/25/scan-this-target-encour...</a><p>A few of the positions we are hiring for:<p>* Mobile developers (iOS &#38; Android)<p>* Server side developers<p>* Data engineers<p>* Marketing, Customer Service, &#38; more<p>Go to <a href=\"http://www.shopkick.com/jobs.html\" rel=\"nofollow\">http://www.shopkick.com/jobs.html</a> for more details and to apply online.","time":1338575725,"type":"comment"},{"by":"suhail","id":4053972,"parent":4053076,"text":"Mixpanel is hiring Solutions Architects: Support, Sales, Marketing, and Engineering. You wear 4 hats and talk to customers every single day and actually <i>help</i> them.<p><a href=\"http://mixpanel.com/jobs/\" rel=\"nofollow\">http://mixpanel.com/jobs/</a><p>We're in beautiful San Francisco and are still under 15 people.<p>$11M+ raised by Andreessen Horowitz, Max Levchin, Sequoia, etc.","time":1338564941,"type":"comment"},{"by":"daveambrose","id":4054549,"parent":4053076,"text":"Mountain View, CA - FT + Internships, Product for Mobile + Social @ Travelzoo<p>Help 25 million subscribers push boundaries on local commerce, deal publishing and media via mobile and new social tools. We're looking for smart, forward-looking entrepreneurs who have a passion for local, traveling and scratching their own itch.<p>We're a small team (group of folks who previously built/sold companies) where everyone gets their hands dirty in guiding product, solving big problems at scale and makes an impact each quarter for our shareholders (Travelzoo is public on the NASDAQ).<p>What we offer:<p><pre><code>  * Top salary \n  * Great perks, like the Travelzoo Experience (eat your own dogfood on any of our deals published throughout the world!)\n  * Medical, Dental, Vision\n  * Excellent career advancement opportunities\n</code></pre>\nIf you're interested, drop me a line (dambrose at travelzoo dot com) or apply on our Careers page: <a href=\"http://www.travelzoo.com/jobs/\" rel=\"nofollow\">http://www.travelzoo.com/jobs/</a>","time":1338571614,"type":"comment"},{"by":"shakefon","id":4054788,"parent":4053076,"text":"Las Vegas, NV\n(+1 position in San Francisco, CA)<p>Zappos (<a href=\"http://www.zappos.com\" rel=\"nofollow\">http://www.zappos.com</a>) is an online retailer, a subsidiary of Amazon.com and has multiple positions open. I'm not a recruiter, I'm a current employee and I can speak honestly to the work environment here being a great place to be.<p>For technical people concerned by public images of the crazy offices with parades and so on, that is not the environment you will work in. In our building, you will be free to express yourself and you'll have a great time, but it's a place you can concentrate and learn from others too.<p>Front-End Developers there are 3 positions open right now: <a href=\"http://jobvite.com/m?3omIlfwx\" rel=\"nofollow\">http://jobvite.com/m?3omIlfwx</a><p>Lots of other opportunities including Information Security, Data Architect, Java Engineers, Software Engineering Manager &#38; Senior Developer:<p><a href=\"http://jobvite.com/m?36nIlfwg\" rel=\"nofollow\">http://jobvite.com/m?36nIlfwg</a>","time":1338574581,"type":"comment"},{"by":"elliottcarlson","id":4053816,"parent":4053076,"text":"New York, NY<p>Lot18 (<a href=\"http://www.lot18.com\" rel=\"nofollow\">http://www.lot18.com</a>) is revolutionizing the way people buy wine and epicurean products online.<p>Hiring:<p>* Software Engineers<p>* Frontend Engineers<p>* QA Engineer<p>* Data Engineers<p>Why you should work here:<p>- We work with a ton of great technologies: Python, gevent, gunicorn, Tornado, JavaScript, Chef, git, Vagrant, PHP, MySQL, Linux, Apache, nginx, HAProxy, Amazon Web Services, Varnish, memcached, Capistrano, jQuery and more.<p>- Well funded. We’ve raised $45M from NEA, Accel &#38; FirstMark.<p>- People actually use our product. Over 1M registererd users since we launched in Nov 2010.<p>- We have a real business model and process 7 figures a month in transactions.<p>- Benefits: Competitive salary, stock options, medical/dental paid in full, unlimited vacation, plenty of wine, dev kegerator, foosball/ping pong lots of challenges and interesting business/tech problems to solve.<p>Apply by emailing anthony@lot18.com.","time":1338563499,"type":"comment"},{"by":"rslifka","id":4056829,"parent":4053076,"text":"Sharethrough - <a href=\"http://www.sharethrough.com/engineering\" rel=\"nofollow\">http://www.sharethrough.com/engineering</a>\nSan Francisco, ~Ferry Building, Full Time, Great Relo Package (we've done Canada and Australia; we're pretty good at it :)<p>Sharethrough is...<p>- A technology company fixing what's broken about video advertising (<a href=\"http://techcrunch.com/2012/05/12/5-ways-native-monetization-is-changing-silicon-valley/\" rel=\"nofollow\">http://techcrunch.com/2012/05/12/5-ways-native-monetization-...</a>).\n- Working with brands like Old Spice, Xbox and MLB.\n- On modern, great tech responsibly (Rails 3.2.5, Backbone, Hadoop, Cascading, etc.).  Sorry, no MongoDB!\n- Well-funded with continuous investment in engineering (training, materials, conferences, etc.!).\n- One of the \"2011 Best Places to Work in the Bay Area\".\n- Serious about bringing on great people.  We'll turn around an offer in as little as 24 hours.<p>Give me a shout directly - rslifka@sharethrough.com<p>Rob","time":1338605278,"type":"comment"},{"by":"bri3d","id":4054552,"parent":4053076,"text":"Boulder, Colorado - Full-time Rails, iOS, Android development at Gloo.<p>Gloo is an exciting platform which changes the way people enrich and strengthen their most important relationships, and allows champions of strong relationships, families, and marriages to deliver their ideas and content to those seeking them.<p>Looking for skilled developers with an interest in developing an early-stage product. Rails, iOS, or Android experience a large plus. Fun, experienced, small team, both on the business and dev sides, and plenty of opportunities to contribute to open-source and try out cutting-edge technology. We're very modern: iOS 5 app (blocks + GCD! View Controller containment!), IE6-free web frontend using HAML and SASS, Rails 3 + Postgres 9 backend.<p>Well-funded. Competitive salary, design your own workstation / development setup, fun but heads-down startup environment.  Nice office in downtown Boulder (West End of Pearl Street).<p>Interested? jobs at tangogroup dot com.","time":1338571690,"type":"comment"},{"by":"BraintreeR","id":4055763,"parent":4053076,"text":"Chicago, IL - Braintree - FULL TIME Developers<p>Braintree helps businesses process credit card payments by providing a merchant account, payment gateway, recurring billing and credit card storage. We're unlike others in the industry; we think and do things differently.<p>Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node.js, PHP, Java, .NET, Perl, and Objective-C<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a> .","time":1338584654,"type":"comment"},{"by":"kpete","id":4053748,"parent":4053076,"text":"TurboVote! (<a href=\"http://blog.turbovote.org/2012/05/were-still-growing-know-a-developer/\" rel=\"nofollow\">http://blog.turbovote.org/2012/05/were-still-growing-know-a-...</a>)<p>Must love Rails and democracy (maybe not in that order). We're based in Brooklyn but have a remote developer in Denver who would love to expand the satellite \"office\"...","time":1338563002,"type":"comment"},{"by":"cvb","id":4086277,"parent":4053076,"text":"BorderJump (Nashville, TN) - LOCAL or REMOTE, relocation assistance<p>Director of Software Development<p>We're a well-funded startup building an easy way for U.S. merchants to sell globally, connecting the best shipping and logistics providers with extensive localized payment services. We're looking for an experienced engineer to lead our development team.<p>Responsibilities include: designing platform applications and RESTful APIs, supervising code deployment, conducting code reviews, mentoring junior developers, and planning for security, reliability and scalability of cloud-based services.<p>Required experience: Python/Django, PHP/CodeIgniter, MySQL and SOAP/REST.<p>We have flexible hours, a great work environment and talented coworkers.<p>Find more info at <a href=\"http://www.borderjump.com/jobs/\" rel=\"nofollow\">http://www.borderjump.com/jobs/</a> or email me directly: chuck.bryant [at] borderjump.com","time":1339191421,"type":"comment"},{"by":"peterure","id":4054792,"parent":4053076,"text":"London, UK<p>BetStars is a seed stage startup working on a social football competition for mobile and facebook.\nThis is an exciting project with a strong concept - aiming for a large potential market.<p>We're looking for a back end software developer to build the structure and work with our designer/ front end developer and marketing guys.<p>This is in exchange for an equity stake. 5 team members are already on board and have broadly defined the core product. The role could work in conjunction with a day job, if you're prepared to put the time in.<p>You should have experience of creating software apps using the latest technologies, be London based and be up to speed on social media developments - and like football!<p>If you have a the right background and are interested in our project then please get in touch.<p>pete at betstars .co.uk<p><a href=\"http://betstars.co.uk/\" rel=\"nofollow\">http://betstars.co.uk/</a>","time":1338574630,"type":"comment"},{"by":"scottw","id":4054418,"parent":4053076,"text":"Provo/Orem, Utah - BetterLinux/BetterServers<p>Well-funded startup, full benefits. We're looking for Linux kernel hackers, QA engineers, and full-stack engineers. We use a lot of different technologies, so the ability to learn new things quickly is the most important skill. We're small (currently 20-ish employees) and we love foosball and table tennis. Lots of free sodas and food in the breakroom, etc. It's a nice gig :)<p>For Linux kernel hackers:<p>- familiarity with cgroups, scheduling algorithms, etc\n- exceptional C skills<p>For QA engineers:<p>- knowledge of TAP\n- solid Perl skills\n- ability to think like a customer and look at our products with fresh eyes<p>For full-stack engineer:<p>- working knowledge of HTML/CSS/Javascript\n- solid Perl skills\n- familiarity with Mojolicious a plus\n- Python/PHP skills also comes in handy\n- REST API design skills<p>Email résumé to scott@betterlinux.com.","time":1338569961,"type":"comment"},{"by":"gyardley","id":4053894,"parent":4053076,"text":"Le Mans, France or New York City, with possible remote work for the right candidate.<p>Jirafe (<a href=\"http://www.jirafe.com\" rel=\"nofollow\">http://www.jirafe.com</a>) provides customer intelligence, analytics, and insight for ecommerce businesses, so they can make more money. Thousands of merchants use our analytics tools, from small sites to massive department store chains.<p>We're hiring Scala developers, Symfony2 developers, systems engineers, scalability experts, and more - see <a href=\"http://jirafe.com/jobs\" rel=\"nofollow\">http://jirafe.com/jobs</a> for the full list. Our development's centered in France, but we'd be delighted to work with you in NYC as well - we could use a strong development lead here to help build out a local engineering team.<p>If you're interested, mail jobs@jirafe.com. Any questions, you can shoot them my way - my email's in my profile.","time":1338564257,"type":"comment"},{"by":"davidandgoliath","id":4054597,"parent":4053076,"text":"Anywhere, anywhere.\nFused.com is seeking sysadmins with a hint of dev. (Devops?)<p>fused.com/careers.php\nEquity available, bootstrapped, no desire to exit anytime soon. ~40 hours or less of work per week. Prefer to keep things operating top-notch so you can have hobbies instead of fighting fires? You may fit in well :)","time":1338572251,"type":"comment"},{"by":"markvoelker","id":4054838,"parent":4053076,"text":"Cisco (RTP, NC preferred but location flexible)<p>Systems Test Engineer - Massively Scalable Data Center Architecture<p>We're looking for an engineer to join our Massively Scalable Data Center team in the Systems Development Unit.  Help develop scale-out data center architectures (network, compute, storage, operations, distributed app workloads, etc), build them in the lab, and test them to validate the design.  Work in a small team on a mix of technologies including Software Defined Networking (SDN), Big Data, network overlays, routing/switching, DevOps tools, open source software, distributed systems, and more at scale.  Raleigh-Durham, NC preferred but other locations (New York, Boston area, San Jose, Seattle, REMOTE) available to well qualified candidates.  For more information and/or to submit a resume, contact mvoelker at cisco dot com.","time":1338575069,"type":"comment"},{"by":"sink","id":4056264,"parent":4053076,"text":"Bookish is hiring in NYC - full time, local<p>Bookish aims to be the main destination for consumer book discovery and news. We are a small company, well connected to the publishing industry, comprised of editors and software developers located in the Flatiron district.<p>We are looking for software developers who are passionate about books and the future of publishing.<p>We have a startup culture with a small, intense dev team. We believe in strong opinions, varied backgrounds, rapid prototyping, and taking risks. Along with books, we are excited about new technologies and innovative solutions to problems involving large, rich data sets, machine learning, and an immersive user experience.<p>We are using Scala, Akka, MongoDB, and ZeroMQ as part of our tech stack.<p>Sounds fun and interesting? Shoot me an email: scott [at] bookish [dot] com","time":1338591056,"type":"comment"},{"by":"sgrock","id":4054124,"parent":4053076,"text":"Portland, OR/San Francisco - <a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a><p>New Relic is growing and we're looking to add several Ruby, Java, .NET, and Devops Engineers to our teams. If you want to join our fun dynamic company, give us a shout.<p>We are passionate, possibly even crazy, about application performance management (APM). Our mission is to make web applications run better, to make the internet more productive, and to make life easier for developers and devops. We are turning the APM marketplace upside down by providing SaaS products that deliver high-value functionality previously only available through enterprise software. We are well above 24,000 customers. And with your help we’ll get to 10x that number.<p>[H1B] is fine. Usually no [REMOTE] but we have made exceptions.","time":1338566315,"type":"comment"},{"by":"felipellrocha","id":4055495,"parent":4053076,"text":"Comics Headquarters is looking for developers, designers, writers and artists! We are looking for our first employees. We are based in Dallas, TX. Interns ok. Remote ok.<p>More details at this page:\n<a href=\"http://comics-headquarters.com/page/jobs/\" rel=\"nofollow\">http://comics-headquarters.com/page/jobs/</a>","time":1338581525,"type":"comment"},{"by":"triggit","id":4053334,"parent":4053076,"text":"Triggit, Inc.<p>San Francisco, CA - Full-Time - NO REMOTE - H-1B friendly<p><a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a><p>Triggit, a San Francisco ad technology startup, leverages massive amounts of data to do ad retargeting in real time. We currently see 150,000 requests/sec (yes, per second) and about 15 billion ad impressions per day. We have interesting engineering challenges and an ownership-based, meritocracy culture. Engineers also get their own office with a door.<p>Available positions:<p><pre><code>  Senior Engineer: Ad Serving Systems (C/C++, Redis, ØMQ)\n\n  Ruby on Rails Developer (SLIM, SASS, Rails 3.2, Redis, PostgreSQL)\n\n</code></pre>\nWe're hiring very aggressively.  You can apply via:  <a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a>","time":1338558803,"type":"comment"},{"by":"xentac","id":4076478,"parent":4053076,"text":"Oprius Software - Victoria, BC, Canada - Full Time, remote<p>Position: Chief Technical Officer<p>Oprius' Chief Technical Officer is responsible for the maintenance and development of the Oprius web-based software.<p>Oprius is a CRM web app designed specifically for individual sales people.  It is designed to be approachable by people without a lot of computer experience and yet still powerful.  It tracks contacts, appointments, calls, tasks, and emails; lets users create complex sales processes; and includes a powerful phone assistant for use during calls.<p>This position is a work-from-home/telecommute position.<p>Find out more and apply at <a href=\"http://oprius.theresumator.com/apply/ZuOK64/Chief-Technical-Officer.html\" rel=\"nofollow\">http://oprius.theresumator.com/apply/ZuOK64/Chief-Technical-...</a>","time":1339020743,"type":"comment"},{"by":"zkirill","id":4054590,"parent":4053076,"text":"Nutrivise - Mountain View - (full time, intern, frontend)<p>We're turning the problems of nutrition, health, and weight-control on their head by inverting the current standard for how software helps people decide what to eat. Current market solutions are broken and tedious and we're building a way for people to be healthy and achieve their goals without preventing people from living their normal\nday-to-day lives.<p>We are an engineering driven company of 5 who are very product driven and love building things that solve peoples' problems. Our stack is Python (Flask) and MongoDB on the backend and we use a modern combination of HTML, CSS, and JavaScript on the frontend. People who have portfolios, interesting projects, or funny little hacks will be noticed the most.<p>Contact us via chris at nutrivise.com!","time":1338572162,"type":"comment"},{"by":"martian","id":4054330,"parent":4053076,"text":"San Francisco<p>Software Engineer, Front-end and back-end engineers<p>Thumbtack is hiring awesome software engineers to transform the way services are bought and sold online. We're Amazon for services. A quarter of a million small businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. We're well on our way to being profitable and growing quickly.<p>Our team is young and passionate and dedicated to good engineering. We have extensive benefits, including a in-house chef, a gorgeous office in SOMA, and money to spend on Thumbtack services every month.<p>Our delicious food culture was recently the top story on Inc.com.<p>Apply at <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Or email chris at thumbtack with any questions.","time":1338568574,"type":"comment"},{"by":"alenlpeacock","id":4054556,"parent":4053076,"text":"Salt Lake City, Utah, Full Time Software Engineers at Space Monkey (<a href=\"http://spacemonkey.com\" rel=\"nofollow\">http://spacemonkey.com</a>)<p>Space Monkey is changing how the world stores data, forever. Winner of the 2012 Launch Festival (<a href=\"http://techcrunch.com/2012/03/08/space-monkey-launch/\" rel=\"nofollow\">http://techcrunch.com/2012/03/08/space-monkey-launch/</a>)<p>Some of the deep tech we're working on: immensely distributed systems, p2p (DHTs, NAT traversal, fairness mechanics, etc), distributed filesystems (and local interfaces to them via FUSE et al), hardcore crypto, mobile, web, and much more. We use a lot of python, but also C/C++ and Go.<p>If you think you might fit in on a team of super bright, hyper-productive folks, please drop us a line at our jobs@ email address.","time":1338571700,"type":"comment"},{"by":"zds","id":4056622,"parent":4053076,"text":"Codecademy is looking for designers and developers of all stripes in NYC.<p>We're the easiest way to learn to code and we reach millions of students all over the world.  Help us teach them to be future readers of Hacker News (and developers too!).<p>jobs@codecademy.com or codecademy.com/jobs","time":1338599771,"type":"comment"},{"by":"victoriastodden","id":4055337,"parent":4053076,"text":"New York, full-time, REMOTE<p>Change the future of scientific collaboration and publishing at RunMyCode.org. We are hiring two fulltime engineers to expand a prototype platform that enables scientists to openly share and reproduce the code and data that underlies their research publications. We are founded by top professors from Columbia University and HEC Paris. We are looking for:<p>* back-end infrastructure to scale the site on AWS, both for users and for scientific publications; \n* C++, and experience in scientific languages such as R, S+, Matlab, python a plus; \n* possible outreach to the scientific community and citizen science groups if interested.<p>If this sounds exciting to you, email your CV and cover letter to Victoria Stodden vcs@stanford.edu","time":1338580034,"type":"comment"},{"by":"tdonia","id":4055680,"parent":4053076,"text":"Tribeca, New York City - Frontend/PHP Developer for The Daily Voice<p>We're looking for someone that's passionate about HTML/CSS/JS to join our technology team and help us publish local news for our growing audience.<p>Important:<p><pre><code>  HTML / CSS - semantic, crossbrowser and crossdevice markup\n  JS - jQuery\n  PHP - 5.3+\n  SQL\n  Git or other source control\n\n</code></pre>\nNice to have:<p><pre><code>  Drupal (API and/or module development experience, for 6 or 7)\n  SASS or LESS experience\n  JS Lint\n  Objective C\n  Unit Testing\n  Profiling code\n  A/B or Multivariate Testing\n\n</code></pre>\nInterested?<p><pre><code>  Send your résumé and/or github links\n  Recommend a book\n  Tell us about a cool project\n\n</code></pre>\nGet in touch: travis@dailyvoice.com","time":1338583697,"type":"comment"},{"by":"GaiaAir","id":4055521,"parent":4053076,"text":"REMOTE/NYC, INTERN<p>Travtar is an online travel startup our mission is to make it easier for travelers to choose accommodations that keep all your travel companions' needs in mind. Our beta (Travtar.com) is live and I hope that you will poke around and have a look.<p>Right now we are looking to expand our (tiny) team to a Tech Lead (with the possibility of eventually assuming the CTO role). Although it would be good to have someone who knows Python/Django and machine learning/algorithms, it is more important to us to find someone who is a fast learner and a problem solver. Compensation will be equity.<p>We are also looking for a UX Intern to work closely with our Lead Designer.<p>If you're interested, contact hr [at] travtar [dot] com.","time":1338581876,"type":"comment"},{"by":"nbclark","id":4054986,"parent":4053076,"text":"DoubleDutch (mobile, social, enterprise apps)\nSan Francisco, CS<p>We've already racked up an impressive client list:<p><pre><code>  Cisco, HP, Adobe, TED, Macworld, RightNow, ...\n</code></pre>\nand are looking for senior caliber developers to help us shape the future of the company.<p>Specifically we are looking for:<p><pre><code>  senior iOS and senior Android developers,\n  who want to own a significant part of our mobile development.\n</code></pre>\nWe offer:<p><pre><code>  competitive salary, generous equity + benefits,\n  and have already gained significant traction.\n</code></pre>\nIf interested, please contact me at nclark@doubledutch.me, or visit <a href=\"http://doubledutch.me/jobs\" rel=\"nofollow\">http://doubledutch.me/jobs</a>","time":1338576577,"type":"comment"},{"by":"stevem_newrelic","id":4054808,"parent":4053076,"text":"New Relic has revolutionized app performance analytics with an enterprise-grade SasS offering.  And as a result is growing like crazy.  Oh, and is certifiably a Best-Places-to-Work (#2 in SF)!<p>If you are a talented Ruby, Java, or PHP engineer or QA specialist, and you want to work in Portland OR or San Francisco, you can find out more and apply at\n<a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a><p>We are also looking for \n * Very talented software managers in Portland\n * A Ruby-skilled Web Developer in San Francisco.<p>Please tell us about why you are the right person to help drive growth AND contribute to our fabulous work environment.  We look forward to hearing from you!","time":1338574774,"type":"comment"},{"deleted":true,"id":4055304,"parent":4053076,"time":1338579765,"type":"comment"},{"by":"dhyasama","id":4053511,"parent":4053076,"text":"New York, NY - Local, full-time and intern<p>Rallyverse is hiring a full-time back-end dev and a front-end intern. We are a team of six and growing and signing paying customers.<p><a href=\"http://rallyverse.com/jobs\" rel=\"nofollow\">http://rallyverse.com/jobs</a>","time":1338560782,"type":"comment"},{"by":"meganelacarte","id":4081623,"parent":4053076,"text":"E la Carte (Palo Alto, CA) - Front End Engineer (local - FT or contract), User Interface Graphic Designer (local - FT or contract), &#38; National Account Executive (local FT)<p>E la Carte's Presto touch-screen tablets increase restaurant efficiency and profitability, as well as guest interaction by enabling guests to browse appetizing pictures of the entire menu, place orders, split checks, make payments, and play interactive games – all from the comfort of their restaurant seats without having to wait!<p>We're backed by Y-Comb, SV Angel, &#38; Lightbank (Groupon). Small tight-knit team working out of a house in downtown Palo Alto.<p>For details on the jobs, go to www.elacarte.com/about","time":1339107283,"type":"comment"},{"by":"memoryhole","id":4063032,"kids":[4065341],"parent":4053076,"text":"3D Avatar School (Hong Kong) - Full time, part time, contract, local or remote<p>We are an expanding Hong Kong-based startup that is harnessing 3D gaming technology for language education. In our online virtual environments, teachers and students learn together by participating in games and activities. We are very passionate about what we do and work in a very exciting space.\nOur team is highly distributed, agile, and we know how to have fun. We currently need experienced:<p>* LAMP Developers<p>* C++/OpenGL Developers<p>* C# Developers<p>* Linux Systems Administrators<p>If you are interested, please send your CV to our HR director, William Lee: william.lee@3davatarschool.com","time":1338795450,"type":"comment"},{"by":"ganjianwei","id":4055379,"parent":4053076,"text":"TellApart in Burlingame, CA.<p>Predictive analytics for ecommerce retailers. Hiring software engineers--generalists, machine learning specialists, storage specialists.<p>- We use machine learning to predictively model online shopping behavior and use that data to power smarter marketing applications for top ecommerce sites\n- Featured in a Amazon Web Services Case study (<a href=\"http://aws.amazon.com/solutions/case-studies/tellapart/\" rel=\"nofollow\">http://aws.amazon.com/solutions/case-studies/tellapart/</a>)\n- Funded by Greylock and Bain Capital Ventures\n- Ex-Google founding team<p>Contact me at wei@tellapart.com if you'd like to learn more.<p>We sponsor H1Bs.","time":1338580379,"type":"comment"},{"by":"kateray","id":4053836,"parent":4053076,"text":"scroll kit (<a href=\"http://scrollkit.com\" rel=\"nofollow\">http://scrollkit.com</a>) - Ruby/JS developer (NYC) and designers (freelance, intern, or fulltime, potentially remote)<p>We want to teach the web to make the web, by building a tool that makes website creation as intuitive as drawing.<p>We're a seed-funded two-person team, so anyone who comes in at this point will be getting their fingerprints all over the product.<p>Email hey at scrollkit dot com. We'd like to see some projects you've done before, and learn about what you care about making. Our jobs page: <a href=\"http://www.scrollkit.com/s/127\" rel=\"nofollow\">http://www.scrollkit.com/s/127</a>","time":1338563715,"type":"comment"},{"by":"flippyhead","id":4053720,"parent":4053076,"text":"JavaScript / Ruby Developers REMOTE WORKING ENCOURAGED<p>We're hiring JavaScript and Ruby developers to help us build social software for conferences and events. We're based in Seattle but you can work from anywhere. Full benefits, great salary and equity. Our team includes core backbone.js committers and we're working on some fantastic open source projects in support of the same. We've been profitable for over a year and are growing quickly.<p><a href=\"http://www.pathable.com/careers-at-pathable/\" rel=\"nofollow\">http://www.pathable.com/careers-at-pathable/</a><p>Apply here:<p><a href=\"http://jobsco.re/ADjuWq\" rel=\"nofollow\">http://jobsco.re/ADjuWq</a>","time":1338562700,"type":"comment"},{"by":"mattsears","id":4053243,"parent":4053076,"text":"Littlelines (Dayton, OH) - Full time, local.<p>We're looking for rails and front-end developers to work with us in our new headquarters. We're a small and talented team of  designers and developers that love making clients happy.<p>You'll have the opportunity to learn, hone your skills, and contribute valuable work to real projects.<p>We work exclusively on Rails web applications, so some familiarity with Rails views and how a Rails project is set up is a plus. Ideal candidates will be able to work with us at our headquarters.<p>Send us an email: jobs@littlelines.com.<p><a href=\"http://littlelines.com\" rel=\"nofollow\">http://littlelines.com</a>","time":1338557389,"type":"comment"},{"by":"klochner","id":4053976,"parent":4053076,"text":"RentMineOnline - San Francisco, CA (SOMA)<p>Come transform the apartment industry with us.  We are former Seedcamp and FBFund participants, currently profitable, looking for our third on-site engineer to join our team of 7 (with a few additional developers in Belarus).<p>We're currently looking for full-stack Rails developers, and a lead designer as well.<p><pre><code>  - Our stack is {ubuntu, nginx, unicorn, ree, rails 3.07, jquery+coffeescript} \n  - We develop on macbooks, either an air or pro+SSD\n  - We use git and deploy at will\n  - We promote a flat development hierarchy\n</code></pre>\nemail: jobs@rentmineonline.com (subject: HN Job Post)","time":1338564988,"type":"comment"},{"by":"c4urself","id":4055864,"kids":[4059099],"parent":4053076,"text":"Mountain View, CA<p>Nimbula<p>Core Engineer - Distributed Systems Team<p>Cloud Computing is turning into one of the most significant technology trends of the last decade. Nimbula (www.nimbula.com) was founded by cloud computing pioneers (with team members from VMware, Amazon Web Services, and Cisco) and backed by Sequoia Capital and Accel Partners to deliver the benefits of public clouds on private infrastructure. With Nimbula, customers can both provision their own private clouds, while also leveraging the capabilities of public clouds.<p><a href=\"https://nimbula.com/company/careers/\" rel=\"nofollow\">https://nimbula.com/company/careers/</a>","time":1338585737,"type":"comment"},{"by":"esigler","id":4057553,"parent":4053076,"text":"San Francisco, CA - Minted<p>Frontend &#38; backend developers needed!<p>Minted is a social commerce site, crowd-sourcing graphic designs and art from around the world. Behind the scenes, we're running Python on MySQL running in EC2 and Rackspace environments.<p>We provide competitive compensation, generous benefits, and a brightly lit office environment that's 5 minutes walking distance from the Ferry Building in downtown San Francisco. We're backed by Benchmark Capital &#38; IDG Ventures, among others.<p>See <a href=\"http://www.minted.com/jobs\" rel=\"nofollow\">http://www.minted.com/jobs</a> for more, or send me an email at eric@minted.com","time":1338626071,"type":"comment"},{"by":"jann","id":4053289,"parent":4053076,"text":"pocketvillage, Berlin (Germany) - Full time &#38; intern - Python<p>We're developing solutions for travelers to discover and book activities &#38; tours and ways for small operators to be found by travelers.<p>We are 5 founders (2 tech, 3 non-tech) and are now looking for additional engineers (Python, full-stack) to join us. As one of our first employees, you'll have the chance to influence the product and the company in many ways!<p>Interested? Have a look at <a href=\"http://blog.pocketvillage.com/careers/\" rel=\"nofollow\">http://blog.pocketvillage.com/careers/</a> or contact me at: jann@pocketvillage.com or @JannKleen on Twitter","time":1338558015,"type":"comment"},{"by":"adam1010","id":4072439,"parent":4053076,"text":"RentStuff.com -- Chicago, IL -- Full Time PHP Developer for a venture-backed start-up working out of 1871 in Chicago (in the Merchandise Mart)<p><a href=\"http://www.rentstuff.com/jobs/php_dev\" rel=\"nofollow\">http://www.rentstuff.com/jobs/php_dev</a><p>We connect people that are looking to rent stuff (anything from bikes to cameras to construction equipment) with rental shops that have those items. We also function as a marketplace for individuals to rent out their stuff to others.<p>Intimate, small team environment with lots of authority and great perks!<p>Mysql, jQuery, Bootstrap, LAMP, EC2, AWS, Javascript, FT, Full-Time","time":1338957359,"type":"comment"},{"by":"Jun8","id":4053968,"kids":[4058722,4059543],"parent":4053076,"text":"Chicago, IL<p>FULLTIME, for Motorola Solutions, Inc. Not having H1B is not problem, we'll apply, but must be in the US.<p>Our multimedia analytics team is looking for an all-around good hacker, good with C and C++. Knowledge of OpenCV, machine learning, and computer vision is a plus but is not necessary. The responsibilities range from designing and implementing prototypes on Linux to quickly throwing together a web server and a Android client for a demo.<p>We have a <i>great</i> work/life balance, great atmosphere, cutting edge technology and great benefits.<p>For more details and a formal job description contact me.","time":1338564895,"type":"comment"},{"by":"sciurus","id":4055908,"parent":4053076,"text":"Athens, GA<p>At EuPathDB, we're providing scientists with online research tools to help them decipher parasites that infect hundreds of millions of people worldwide. We need a sysadmin with lots of linux knowledge, solid scripting skills, and a willingness to occasionally get hands-on with hardware. Languages and technologies in heavy use include apache, java, jenkins, libvirt/kvm, nagios, puppet, perl, rpm, tomcat, and just about every bioinformatics tool and relational database you can think of.<p>There will be a posting at <a href=\"http://jobs.eupathdb.org/\" rel=\"nofollow\">http://jobs.eupathdb.org/</a> shortly.","time":1338586263,"type":"comment"},{"by":"philippb","id":4055317,"parent":4053076,"text":"San Francisco, SOMA. Fulltime first hire, &#62;3m downloads<p>We at KeepSafe are two co-founders who are looking for our first engineering hire. We have over 3m downloads and a killer retention.\nWhen you're interested to join a smal and successful startup where you have impact and server a lot of users, we should talk.\nJob post: <a href=\"http://dl.dropbox.com/u/620820/SF%203m%2B%20Startup%20first%20hire.pdf\" rel=\"nofollow\">http://dl.dropbox.com/u/620820/SF%203m%2B%20Startup%20first%...</a><p>Salary, equity + benefits. (and yes, we already raised money and have it in the bank)<p>Contact us at jobs@getkeepsafe.com","time":1338579847,"type":"comment"},{"by":"jachwe","id":4053358,"parent":4053076,"text":"~sedna GmbH, Berlin , Fulltime, local, Frontend Developer\n--------\nInfos on what we're doing on <a href=\"http://www.sedna.de\" rel=\"nofollow\">http://www.sedna.de</a><p>No conventional Web Development. :-)<p>(edited for proper link)","time":1338559117,"type":"comment"},{"by":"blo","id":4055957,"parent":4053076,"text":"San Francisco, CA (SOMA) - Backend and/or Frontend + Design engineers - Full time<p>Stealth - consumer web and mobile<p>--<p>We are a stealth, funded startup focused on improving how people fundamentally browse and interact with online services. Our new web-based experience combines UI/UX innovation with data algorithms to allow users to accomplish tasks in a more usable, efficient, and social manner.<p>We work mainly with JS (jquery and node.js) and HTML5. Mobile developers should be familiar with iOS/Android.<p>Curious? Contact [my username] at alum.mit.edu. Including your portfolio is preferable!","time":1338586726,"type":"comment"},{"by":"bentlegen","id":4054802,"parent":4053076,"text":"San Francisco, CA<p>Disqus (YC07) is hiring front and back-end engineers in San Francisco.<p>On the front-end, you'll be pushing the boundaries of what's possible with distributed JavaScript. We're currently deploying what might be the world's most trafficked Backbone.js app - over a half-billion visits per month.<p>On the back-end, you'll be help scale the web's largest Django app as part of a tight-knit team of pros.<p>If that interests you, send me an email: ben at disqus dot com. Or check out our jobs page: <a href=\"http://disqus.com/jobs\" rel=\"nofollow\">http://disqus.com/jobs</a>","time":1338574724,"type":"comment"},{"by":"anandiyer","id":4062373,"parent":4053076,"text":"San Francisco, CA - Full time, local<p>We're a tech company based in SF, backed by some of the best investors in the valley and we are trying to revolutionize the sports industry. We're a group of product minded engineers and designers and we're expanding our team with developers. We're a Django/Python shop hosted on Google App Engine, and our mobile apps have been consistently rated as some of the best in the AppStore. We have millions of users, and we're still growing.<p>If this sounds exciting to you, and you want to join our team, drop us a note - jobs@onsports.com","time":1338775945,"type":"comment"},{"by":"melissatrahan","id":4096449,"parent":4053076,"text":"San Francisco - full time<p>Massive Health is a small start-up of just 12 people that's based in San Francisco, and combined our team has previously shipped products to over half a billion people. Led by cofounder and CVO Aza Raskin, we're using this consumer product expertise to improve healthcare by creating beautiful tools that deliver useful insights for getting and staying healthy. We've already launched an app called The Eatery, and there's lots more to come. <p><a href=\"http://massivehealth.com/jobs\" rel=\"nofollow\">http://massivehealth.com/jobs</a>","time":1339443395,"type":"comment"},{"by":"jaos","id":4066720,"parent":4053076,"text":"Timesys Pittsburgh, PA (intern, full-time,remote)<p>We are a small, fast, profitable company providing embedded Linux solutions to big and small customers all over the world.<p>We are looking for embedded Linux kernel developers, build system gurus, gnu tool experts, userspace application developers, and support engineers.<p>We have a great team, a fun office environment, and a lot of interesting problems to solve.<p><a href=\"http://www.timesys.com/company/careers\" rel=\"nofollow\">http://www.timesys.com/company/careers</a>","time":1338856187,"type":"comment"},{"by":"AdamN","id":4056319,"parent":4053076,"text":"NY - Python<p>You will work with the best 13 person team of developers in the city.  Onsite only.<p>Just email me directly: adam@yipit.com<p>We sponsor visas and will help with relocation.","time":1338592042,"type":"comment"},{"by":"markvoelker","id":4053436,"parent":4053076,"text":"Cisco (location flexible, RTP, NC or San Jose, CA preferred)<p>Cisco is hiring OpenStack solutions engineers, QA, and developers.  Multiple business units and the Office of the CTO.  Raleigh-Durham, NC and San Jose, CA preferred for some openings, but locations flexible including REMOTE work for well qualified candidates.  Search for keyword OpenStack on <a href=\"http://www.cisco.com/careers\" rel=\"nofollow\">http://www.cisco.com/careers</a> or send inquiries/resumes to openstack-jobs@cisco.com.","time":1338559958,"type":"comment"},{"by":"clay","id":4058693,"parent":4053076,"text":"Rally.org - San Francisco<p>Building tools to help non-profits, charities, and other organizations fundraise and spread their message better.<p>Looking for:<p><pre><code>  - Full stack web developers (Rails, Capistrano, chef, etc)\n  - Data Scientists (machine learning, visualization, and front-end web development)\n</code></pre>\nOur jobs page has more info <a href=\"https://rally.org/jobs\" rel=\"nofollow\">https://rally.org/jobs</a><p>Email me at clay.woolam@rally.org and I'll get you connected","time":1338660516,"type":"comment"},{"by":"btfh","id":4078567,"parent":4053076,"text":"London, Full-time<p>Chaffinch is hiring a junior web developer with knowledge of some or all of the following:<p>HTML, CSS, Javascript, jQuery, Coffeescript, Jade, Stylus, Handlebars, Backbone, Underscore, Node, Express, PHP, CodeIgniter, Amazon AWS.<p>Remote work is possible, but working from our offices in East London is preferred.<p>Please send relevant links (e.g. portfolio, github, live work) and at least one code sample of something you're proud of to jobs@chaffin.ch","time":1339071252,"type":"comment"},{"by":"emcienjobs","id":4053757,"parent":4053076,"text":"Atlanta, GA - Emcien - Full Time, No H1B, No Remote<p>Software Engineer for Complex Web Applications<p>We are open to training someone with expertise in a non-Ruby language who demonstrates mastery of web development concepts, experience with complex application architectures, or is somewhat amusing.<p><a href=\"https://jobs.github.com/positions/502652e6-a9a5-11e1-95e7-0599ab24122b\" rel=\"nofollow\">https://jobs.github.com/positions/502652e6-a9a5-11e1-95e7-05...</a>","time":1338563036,"type":"comment"},{"by":"jgilliam","id":4053666,"parent":4053076,"text":"Los Angeles, CA<p>NationBuilder is hiring developers and a designer. We build tools for leaders, mostly focused on politics right now.<p>We're backed by Andreessen Horowitz, Sean Parker, and many others.<p><a href=\"http://nationbuilder.com/jobs\" rel=\"nofollow\">http://nationbuilder.com/jobs</a><p>Our stack is Ruby/Rails/Postgres/Redis/Mongo, details here: <a href=\"http://dev.nationbuilder.com/about\" rel=\"nofollow\">http://dev.nationbuilder.com/about</a>","time":1338562277,"type":"comment"},{"by":"argvzero","id":4054608,"parent":4053076,"text":"Basho is hiring!  Many (&#62;20) positions, many locations:<p><a href=\"http://bashojobs.theresumator.com/\" rel=\"nofollow\">http://bashojobs.theresumator.com/</a>","time":1338572434,"type":"comment"},{"by":"rjsjr","id":4065880,"parent":4053076,"text":"SoFi <a href=\"http://sofi.com/\" rel=\"nofollow\">http://sofi.com/</a> is fixing Student Loans with better rates, alumni investment, and great social integration.  We're looking for Engineers, QA, and DevOps to come work with an experienced startup engineering team and build great products.  Located in the beautiful Presidio with free shuttle to downtown.  Contact me at rseymour@sofi.com for more information.","time":1338842630,"type":"comment"},{"by":"jlevetin","id":4055360,"parent":4053076,"text":"RoR developer for green tech startup (Durham, NC) Full Time, Remote, H1B<p>A green tech, well funded startup is looking for an RoR developer to join the team. We help businesses and individuals reduce their power bills using smart electric meters. Our algorithm analyzes overall meter data, calculates individual appliance usage, and makes appropriate recommendations. Beta users (in 18 states and counting) have cut electric bills by as much as 50%. You'll have the opportunity to contribute to a new company and steer the evolution of its consumer facing website.<p>Is this you?<p>* True hacker mindset<p>* Ruby on Rails developer with aptitude for creating an elegant user experience<p>* Can code dynamic web apps using CSS and Javascript<p>* Degree in Computer Science or Engineering<p>* Any experience level, provided you have the programming \nchops<p>Nice to haves<p>* iPhone/iPad/Android development<p>* Python<p>Benefits:<p>* Help save the planet with smart, passionate, and eco-friendly engineers<p>* Competitive compensation blending equity and salary<p>* Retirement and healthcare<p>* Rural setting on six acres with hiking trails and an on-site dog<p>* Relocation, remote development, and H1B sponsorship possible<p>Interested?<p>To apply visit:<p><a href=\"http://www.elmtalent.com/apply-open-position/?job_id=ETG08001\" rel=\"nofollow\">http://www.elmtalent.com/apply-open-position/?job_id=ETG0800...</a><p>Please include a cover letter or (preferably) a link to an RoR site you crafted","time":1338580257,"type":"comment"},{"by":"mrlebowski","id":4070838,"parent":4053076,"text":"TheFind.com is also openings for UI engineers also, in Mountain View/San Francisco, CA.<p>Here's are the full reqs: \n<a href=\"http://startuply.com/Jobs/Web_UI_Architect_2519_2.aspx\" rel=\"nofollow\">http://startuply.com/Jobs/Web_UI_Architect_2519_2.aspx</a><p><a href=\"http://startuply.com/Jobs/Web_UI_Engineer_2519_1.aspx\" rel=\"nofollow\">http://startuply.com/Jobs/Web_UI_Engineer_2519_1.aspx</a>","time":1338930022,"type":"comment"},{"by":"singlow","id":4055274,"parent":4053076,"text":"Austin, TX - Fahrenheit Marketing - Full time<p>We're looking for a junior/intermediate level web developer with a few projects under her/his belt. Most of our projects are in PHP, many in Drupal. This is a full time permanent position with a couple of experienced developers on the team offer guidance and plenty of opportunities to learn new things.<p>jobs@fahrenheitmarketing.com","time":1338579458,"type":"comment"},{"by":"coffeemug","id":4055062,"parent":4053076,"text":"RethinkDB (rethinkdb.com) is looking for a full-time Bash/Python/Perl hacker in Mountain View.<p>We're bringing continuous integration to what traditionally has been thought of as a <i>really</i> long release cycle, and we need someone with the chops to build the tools to do it. E-mails jobs@rethinkdb.com. Not a single person who joined RethinkDB regretted it to date.","time":1338577281,"type":"comment"},{"by":"vpayette","id":4056284,"parent":4053076,"text":"Seattle, WA (Belltown), Full Time, early stage startup<p>2 positions open:<p>- Web UI designer. Microsoft stack. Lean startup, Small team, you'll have immediate impact<p>- Systems engineer to install our server at clients sites and do general IT support for our office.<p>If interested, send your resume to vpayette@hotmail.com and I'll fill you in on the details.","time":1338591435,"type":"comment"},{"by":"ngvrnd","id":4056179,"parent":4053076,"text":"Kiva Systems is hiring in North Reading, MA.\nA great place to work, a transformative technology, robotic excellence in concept and execution.   Full time positions.\nSee the web site <a href=\"http://www.kivasystems.com/about-us-the-kiva-approach/careers-at-kiva/\" rel=\"nofollow\">http://www.kivasystems.com/about-us-the-kiva-approach/career...</a>","time":1338589588,"type":"comment"},{"by":"sitespect","id":4055602,"parent":4053076,"text":"BOSTON, MA<p>SiteSpect.com is hiring for a handful of engineering and analyst positions.  We're a web analytics/optimization startup, located in downtown Boston.  Please see <a href=\"http://www.sitespect.com/careers.shtml\" rel=\"nofollow\">http://www.sitespect.com/careers.shtml</a> for all position listings.<p>Thanks for reading!","time":1338582843,"type":"comment"},{"by":"olegp","id":4053573,"parent":4053076,"text":"Mobile Backstage (Helsinki, Finland)<p>Looking for a web developer with Java, MySQL experience &#38; interest in infrastructure and cutting edge technologies such as server side JavaScript.<p><a href=\"http://www.mobilebackstage.com/server_programmer.php\" rel=\"nofollow\">http://www.mobilebackstage.com/server_programmer.php</a>","time":1338561561,"type":"comment"},{"by":"sontek","id":4056823,"parent":4053076,"text":"We are looking for graphic designer/UX expert.<p><a href=\"https://gist.github.com/2838122\" rel=\"nofollow\">https://gist.github.com/2838122</a> - Our official job posting.<p>Small start-up bootstrapping in Santiago, Chile because we got accepted to <a href=\"http://startupchile.org\" rel=\"nofollow\">http://startupchile.org</a>","time":1338605175,"type":"comment"},{"by":"cr4zy","id":4054977,"parent":4053076,"text":"Scottsdale ~ AZ ~ mobile / machine learning / python<p>~ YOU will be the 5th employee and carry major weight, because we need you to.<p>~ Extremely ambitious gameplan<p>~ Open to full and partial telecommute<p>~ New and best Apple hardware<p>~ $80k and up<p>~ Will pay moving expenses<p>cquiter@gmail.com","time":1338576533,"type":"comment"},{"by":"dgurney","id":4053838,"parent":4053076,"text":"New York, NY.<p>Concert Window is bringing the live concert experience online. We are fully funded, working out of General Assembly, and already selling to paying customers.<p>We're bringing on a lead developer. Rails preferred. Love of music is a big plus.<p>Contact dan@concertwindow.com","time":1338563720,"type":"comment"},{"by":"rsoto","id":4054273,"parent":4053076,"text":"We are a marketing agency in Mexico City and we are looking for a webdev/hacker to build amazing web products.<p>There's a small landing on what we do and what we're looking in the following link: <a href=\"http://bit.ly/buscamoshacker\" rel=\"nofollow\">http://bit.ly/buscamoshacker</a>","time":1338567863,"type":"comment"},{"by":"wifast","id":4054881,"parent":4053076,"text":"Palo Alto, CA - Full-Time, Generalist Eng at WiFast. H1-B OK.<p>We are making internet access more affordable, ubiquitous,  and fast.<p>Our founding engineers come from Google, Facebook and Apple.  Our team is 5-strong, experienced, and well-funded.<p>Come say hi. jobs@wifast.com","time":1338575527,"type":"comment"},{"by":"mikek","id":4054136,"parent":4053076,"text":"Kiwi Crate - Mountain View, CA<p>We have the following open positions, and more:<p>* Front End Developer<p>* Web Designer<p>* Web Developer Intern<p>* Business Analyst<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1338566361,"type":"comment"},{"by":"joshfraser","id":4055624,"parent":4053076,"text":"Torbit in Sunnyvale CA \nLots of open positions including:<p>- JavaScript developer<p>- Go developer<p>- Big data engineer<p>- Front end developer<p>- Performance engineer<p><a href=\"http://torbit.com/jobs\" rel=\"nofollow\">http://torbit.com/jobs</a>","time":1338583093,"type":"comment"},{"by":"mrlebowski","id":4055493,"parent":4053076,"text":"TheFind.com is looking for iOS developers in Mountain View/San Francisco, CA.<p>Here's the full post: <a href=\"http://pastebin.com/j4DWSzyr\" rel=\"nofollow\">http://pastebin.com/j4DWSzyr</a>","time":1338581520,"type":"comment"},{"by":"bwb","id":4059534,"parent":4053076,"text":"Two Jobs for Perl Devs :)<p>Work from home, 100% remote!<p>Full listing at:\n<a href=\"http://jobs.perl.org/job/16056\" rel=\"nofollow\">http://jobs.perl.org/job/16056</a><p>Thanks, Ben","time":1338679924,"type":"comment"},{"by":"georgespencer","id":4053784,"parent":4053076,"text":"We're looking for Rails developers with good commercial experience who want to make a dent in the Universe. Based in London. Competitive salary. Contact zetter+hn@gmail.com.","time":1338563249,"type":"comment"},{"by":"amduser29","id":4054806,"parent":4053076,"text":"Life360, San Francisco SF, CA<p>Director of Engineering: come help us scale out our engineering team as we scale out our user base past 20 million users.<p>alex@life360.com","time":1338574757,"type":"comment"},{"by":"davvid","id":4090633,"parent":4053076,"text":"Walt Disney Animation Studios, Burbank, CA<p><a href=\"https://careers.disneyanimation.com/job_groups\" rel=\"nofollow\">https://careers.disneyanimation.com/job_groups</a>","time":1339321234,"type":"comment"},{"by":"elietoubi","id":4055245,"parent":4053076,"text":"Unpakt is looking for a senior rails developer and a head of product\nmore info here\n<a href=\"https://www.unpakt.com/jobs\" rel=\"nofollow\">https://www.unpakt.com/jobs</a>","time":1338579187,"type":"comment"},{"by":"htilford","id":4055589,"parent":4053076,"text":"Ensighten, Cupertino CA<p>Multiple Fulltime local positions<p><a href=\"http://ensighten.com/company/careers\" rel=\"nofollow\">http://ensighten.com/company/careers</a>","time":1338582678,"type":"comment"},{"by":"Skeletor","id":4056410,"parent":4053076,"text":"drchrono is hiring amazing hackers, designers, SEM marketers, and sales people!  See more here: <a href=\"https://drchrono.com/jobs\" rel=\"nofollow\">https://drchrono.com/jobs</a><p>We sponsor H1B, hiring full time and remote work is an option for most positions.","time":1338593841,"type":"comment"},{"by":"vduquette","id":4053593,"parent":4053076,"text":"(Toronto, Canada) - Full Time, Local<p>Desperate developer seeks accomplice to stave off lonliness. Passionate and comitted ruby developer looking for lasting code-relationship. Must be willing to commit code changes, and be okay with sharing a repository. Brogrammer tendencies a nice bonus, but not required.<p>vince@sprouter.com","time":1338561788,"type":"comment"},{"by":"sharksandwich","id":4053599,"parent":4053076,"text":"ecoScorecard - Atlanta, Ga<p>We're a fast-growing startup focused on making green building easier. We're looking for an excellent Rails developer with an interest in sustainability. email stuart at ecoscorecard dot com","time":1338561830,"type":"comment"},{"by":"tikhon","id":4054622,"parent":4053076,"text":"Parse <a href=\"https://parse.com/jobs\" rel=\"nofollow\">https://parse.com/jobs</a>","time":1338572535,"type":"comment"},{"by":"ryguytilidie","dead":true,"id":4054410,"parent":4053076,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>It's widely held that science is too closed, and too slow. We are trying to change that. We believe that faster sharing of research will lead to an acceleration in research innovation: faster innovation in medicine, biology, engineering, economics, and other fields. Faster sharing in biology and medicine, for example, could lead to cancer being solved 12 months before it otherwise would have been, which would lead to millions of lives being saved.<p>Academia.edu has over 1.3 million registered users, and over 3.7 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,000 academics join each day.<p>We need talented engineers to come and help us accelerate the world's research. We believe that there is a chance to make a big impact.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We have a strong engineering culture. We're a 10 person team based in downtown San Francisco. The site is Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture. There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1338569894,"type":"comment"},{"by":"zukhan","dead":true,"id":4072302,"parent":4053076,"text":"FULLTIME or INTERN. Offices in San Francisco, Boston, and Menlo Park.<p>Delphix (www.delphix.com) is a data virtualization company that does for databases what VMware did for servers - this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud. We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience. Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded? Are you interested in working on the Data, the next big problem in Data Center? Do you thrive on solving difficult technical challenges? Do you take pride in writing beautiful code with a strong attention to detail? Then we are looking for you! Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between. Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1338954482,"type":"comment"},{"dead":true,"deleted":true,"id":4053115,"parent":4053076,"time":1338555444,"type":"comment"},{"by":"kristjan","dead":true,"id":4054459,"parent":4053076,"text":"San Francisco, CA - <a href=\"https://singly.com/jobs\" rel=\"nofollow\">https://singly.com/jobs</a>: Full-time Platform Engineers and Lead Developer Evangelist<p>Hi, HN! Thanks for the nearly 10,000 hits yesterday [1]; that was a blast for us. Each dollar of the $10,000 prize in our app challenge this weekend [2] is now dedicated to one of you.<p>Singly is hiring a lead developer evangelist and horde of generalist engineers to build a cross-service API that provides merged, normalized and deduplicated data from all of your personal sources (Facebook, Foursquare, Fitbit, email, text messages, you name it). We recently closed $7MM in funding, which we're using to expand the team and ramp up developer outreach, as well as put on huge events like this weekend. Mega bonus points you've got tons of experience building or heavily consuming APIs, but if you're smart and like burritos, let's chat.<p>Apply through <a href=\"https://singly.com/jobs\" rel=\"nofollow\">https://singly.com/jobs</a> or kristjan@singly.com. Or, just come hang with us in #singly on irc.freenode.net and at our monthly happy hours [3].<p>Happy hunting!<p>[1] <a href=\"http://news.ycombinator.com/item?id=4048324\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4048324</a>\n[2] <a href=\"https://singly.com/appchallenge\" rel=\"nofollow\">https://singly.com/appchallenge</a>\n[3] <a href=\"http://www.meetup.com/Singly-Happy-Hour/events/65360972/\" rel=\"nofollow\">http://www.meetup.com/Singly-Happy-Hour/events/65360972/</a>","time":1338570414,"type":"comment"},{"deleted":true,"id":4054812,"parent":4053076,"time":1338574827,"type":"comment"},{"by":"brryant","dead":true,"id":4055082,"parent":4053076,"text":"Vungle is looking for a mobile engineer to lead development efforts on both the iOS and Android platforms<p>We're also looking for talented back end engineers that can build big-data infrastructure<p>MOBILE:\n- You don't have to know what fast enumeration is on iOS\n- You have, however, developed mobile applications on the side or for another company.\n- You don't have to understand what HLS is\n- You do have to have deep knowledge of JSON, HTTP, and ability to work with APIs\n- You know what good SDKs look like, and will take the time to design/implement one, knowing that your code will be present on MILLIONS of devices.<p>We're looking for INTERN, REMOTE, and our immigration lawyers are the best at acquiring H1B visas, (or others).<p>BACKEND:\nWe're scaling our infrastructure to handle 100m+ API requests a day, and are looking for people that have experience working on software stacks that are internet-scale.\n- You have a deep understanding of networking and the UNIX operating system (ubuntu).\n- You also want to be apart of a great engineering culture and learn how to push the limits of node.js, mongodb, and redis.<p>Oh by the way, you may also become the next character in Mashable's web TV series, Behind The Launch: mashable.com/behind-the-launch/<p>Apply at jobs@vungle.com","time":1338577457,"type":"comment"},{"by":"jsatok","dead":true,"id":4055196,"parent":4053076,"text":"Toronto, Canada - AppHero (<a href=\"http://apphero.com\" rel=\"nofollow\">http://apphero.com</a>)<p>AppHero is looking for engineers to join our team.<p>About you:<p>- Passionate about building disruptive products that solve big problems<p>- Excited by the opportunity to learn new things and question norms<p>- Self starter who enjoys thinking outside the box<p>- Entrepreneurial spirit and are interesting in taking an active role in growing AppHero<p>- Experience using Java to build applications<p>- Interested in working on the backend for web and mobile apps<p>About us:<p>- VC funded by top investors from Toronto and New York<p>- Building a product to help people discover the best apps by providing personalized recommendations<p>- Small team with diverse experience<p>- Work from a bright, modern, open concept office at Yonge and Eglinton in Toronto<p>Feel free to reach out if you're interested: jordan (at) apphero (dot) com<p>More info: <a href=\"http://apphero.com/careers\" rel=\"nofollow\">http://apphero.com/careers</a>","time":1338578579,"type":"comment"},{"dead":true,"deleted":true,"id":4054105,"parent":4053076,"time":1338566170,"type":"comment"},{"by":"bentaber","dead":true,"id":4055708,"parent":4053076,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour.<p>We're looking for developers and engineers up and down the stack at all levels.","time":1338583982,"type":"comment"},{"by":"axiom","dead":true,"id":4058656,"parent":4053076,"text":"Toronto, Ontario<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>) is hiring for a few roles: designer, sysadmin/infrastructure developer, general web developer. We also hire interns so please feel free to apply for that as well (paid of course.)<p>We're a profitable education startup that helps make class more engaging. We've got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>Our dev team is in Toronto but we've also got an office in San Francisco so if you're really good we would be open to having someone work from there.<p>Send your resume/github account to mike at tophatmonocle dot com.","time":1338659928,"type":"comment"},{"by":"starzia","dead":true,"id":4076389,"parent":4053076,"text":"Chicago, IL - Vaporstream, Inc. - full time local<p>Our well-funded and fast-rising messaging startup is looking top tech talent and we've got lot's to offer:\nall-star colleagues, a sweet salary, and a swank office on the <i>97th</i> floor of the Willis Tower.  In a nutshell, we need<p>* Systems Engineers: Linux, networking, datacenter operations, etc.  Make our stuff work.<p>* Quality Assurance: Break our stuff and and then let's fix it.<p>* General Software Engineers: We've got a lot of work in the hopper and need all kinds of programming skillsets.<p>To apply, email stephen.tarzia@vaporstream.com.","time":1339019248,"type":"comment"},{"by":"melissatrahan","dead":true,"id":4096451,"parent":4053076,"text":"San Francisco - full time<p>Massive Health is a small start-up of just 12 people that's based in San Francisco, and combined our team has previously shipped products to over half a billion people. Led by cofounder and CVO Aza Raskin, we're using this consumer product expertise to improve healthcare by creating beautiful tools that deliver useful insights for getting and staying healthy. We've already launched an app called The Eatery, and there's lots more to come. <p><a href=\"http://massivehealth.com/jobs\" rel=\"nofollow\">http://massivehealth.com/jobs</a>","time":1339443397,"type":"comment"},{"by":"googoobaby","id":4062042,"parent":4053076,"text":"Anything in Seattle that's not Amazon?","time":1338766593,"type":"comment"}]]}