{"comments":[[{"by":"nemesisj","id":4858031,"parent":4857714,"text":"Administrate (<a href=\"http://www.getadministrate.com/\" rel=\"nofollow\">http://www.getadministrate.com/</a>) in Edinburgh, Scotland.<p>We're looking for 2 full time developers.  Remote work is OK, but we're also moving into some fantastic offices at the Edinburgh Tech Cube (<a href=\"http://www.techcu.be\" rel=\"nofollow\">http://www.techcu.be</a>) with spectacular views of Arthur's seat and the Meadows.<p>Job description can be found on our about page (<a href=\"http://www.getadministrate.com/about\" rel=\"nofollow\">http://www.getadministrate.com/about</a>) and we're using a combination of technologies:<p>- Crufty old PHP (being refactored), and newer PHP (Doctrine)<p>All new development is being done with:<p>- Python, SQL Alchemy, Flask, and AngularJS<p>- Bootstrap UI framework<p>We're looking for smart people that get things done using the above techs.<p>We're growing really quickly, have a small team, a challenging product that's mission critical for our clients, and we're located in one of the most beautiful cities in the world with remote workers across the Central Belt of Scotland.<p>If you're outside the EU, we can look into visa sponsorship in very special cases, but this can be a long and difficult process, particularly for the UK.<p>Email me if interested, my name is John: jjp@getadministrate.com","time":1354378638,"type":"comment"},{"by":"carlio","id":4857797,"parent":4857714,"text":"LaterPay - Munich, Germany - remote and relocation help possible<p>Django Developer, Python Developer<p>LaterPay is a startup looking to change the way we pay for content online. The idea is micropayments, but the twist is that you pay after you accumulate €5, rather than paying into a 'wallet' up front.<p>We have a couple of positions open for python developers, and as we are still very small, those positions have a lot of scope for responsibility and choosing your own focus. We have a lot of Django work, so there's also a possibility to join as a Django specialist, especially if you also grok HTML/CSS/JavaScript. Other technologies we use include Tornado, Cassandra, Redis, and our code lives on github. Experience with these is a bonus but not necessary!<p>If you are interested, drop us an email with a resume and some code to look at - jobs@laterpay.net","time":1354374442,"type":"comment"},{"by":"mrkurt","id":4858195,"parent":4857714,"text":"MongoHQ (SF Bay, remote doable)<p>We do database operations and hosting, and just closed our A-round. We're hiring to solve a lot of different problems, but especially looking for help with:<p><i>Backend engineering</i> - If your ideal work day involves building software to run across hundreds of systems and care about databases, you are someone we want to talk to. We have everything from server level monitoring/control agents to protocol proxies to backend metrics systems that need love.<p><i>Operations/devops</i> - If you have used chef/puppet or similar, get irritated about \"snowflakes\" (one off servers), and have a sometimes irrational desire to automate everything, you are someone we want to talk to. We are one of the companies where operations is the product, so work on the backend systems will often make its way in front of users.<p><i>[Whatever you do well]</i> - If you have some combination of skills that you think we need, let us know why we should be thinking about them.<p>----------------------------------------------<p>Our tech \"stack\" is largely node.js/Ruby/Mongo/Redis and we've experimented with Go/Erlang/(other databases). We generally believe in using the right tool for a give job. If you want to  tackle a particular problem with OCaml, for instance, you probably won't face much friction.<p>We have an office right next to the Caltrain in San Mateo (15 mi south of SF) and are willing to let people work remotely if they desire. We will also cover relocation for good people. Our priority is \"people who get things done, sometimes in anger\" and almost everything else is negotiable.<p>If you're interested, email hello@mongohq.com and ask us some questions (or tell us a story). If you want to talk to me directly, mrkurt@gmail.com","time":1354381023,"type":"comment"},{"by":"josh2600","id":4858089,"kids":[4858222],"parent":4857714,"text":"2600hz (<a href=\"http://www.2600hz.com\" rel=\"nofollow\">http://www.2600hz.com</a>) in San Francisco, CA.<p>We're the cloud telecom company. We build the stack that powers many of the biggest telecom architectures in the world.<p>Looking for multiple core developers. Remote work is ok, but definitely prefer local to SF. We have an amazing office in Downtown San Francisco full of people who really care about building amazing open-source technology.<p>Some of the things we work with<p>* ERLANG (Major Bonus points if you &#60;3 Erlang)<p>* RabbitMQ<p>* FreeSWITCH<p>* BigCouch<p>* Chef<p>* Kamailio<p>* WebRTC<p>We're looking for someone who's hardcore, with a good sense of humor and is passionate about making a real difference in the global communications paradigm. Most of the core logic is written in Erlang, so having that skillset would be very much appreciated, but we know that hardcore coders come in all shapes and sizes so if the desire is there we're happy to teach (we actually teach Erlang all over the US).<p>If you're interested in learning more about how 2600hz, drop us a line at info@2600hz.com. We're growing like a weed and would love to add some serious engineering talent.","time":1354379305,"type":"comment"},{"by":"will_critchlow","id":4858013,"parent":4857714,"text":"London: Junior / Graduate Python Developer<p>Distilled is looking for a graduate developer to join our growing Python team in our London office. We currently have the following largely Django based projects:<p>- DistilledU - a feature rich online SEO training platform - our latest project that came out of beta in June this year and is being well received by the SEO industry.<p>- Distilled Store - an online store we’ve built from scratch to sell conference tickets and videos.<p>- Internal Tools - building a range of tools, from quick hacks to fully functional tools, pulling from APIs and various data sets.<p>- Distilled website - currently a Wordpress site that we’ve got grand plans for turning into something far more awesome based on a Django CMS and blogging platform called Mezzanine that we will fully integrate with DistilledU and Distilled Store.<p>- Distilled Tools - our internal reporting system and tool for managing freelance writers.<p>You’ll gain experience in Agile development practices and work in an open, fun and collaborative environment. Please apply at the URL below.<p>Requirements:<p>- Python - some experience, not necessarily commercial.<p>- Frickin smart - you will need an uncanny ability to get stuff done.<p>- Passion for self improvement - technologies move quickly, we’ll expect you to keep up. - Evidence of getting things done - you’ll probably have a number of side projects.<p>About the company<p>Distilled is a search marketing company with a big and ever growing reputation. We have worked with some of the biggest brands in the world, and are known in the industry as experts in what we do. We are 100% owned by the two directors, with offices in London, Seattle and New York. Employees number 52 in total, with London being the biggest office. We like to have fun, with things like Beer o’clock every Friday, regular company outings and a meeting room that is largely used for 4 player Mario Kart.<p>For more info and to apply: <a href=\"http://www.distilled.net/graduate-junior-python-developer/\" rel=\"nofollow\">http://www.distilled.net/graduate-junior-python-developer/</a>","time":1354378427,"type":"comment"},{"by":"adrr","id":4859122,"parent":4857714,"text":"\"Write Code, Shave the world\"<p>Dollar Shave Club<p>Santa Monica, CA - Full Time<p>We are looking for a fullstack developer to join us as we write a new e-commerce platform that handles all aspects of our subscription business including logistics, inventory, analytics and fulfillment.   We just closed a $10 mm round and with that capital we are making significant investment into our technology to help us expand into new markets, improve logistics, and expand our internal business intelligence offering.<p>Development Environment\n- Continuous integration and deployment with Jenkins, Ant Build scripts and Capistrano<p>- Scrum based development with one week sprints.<p>- New development with RoR, Bootstrap, JQuery, Resque, DynamoDB<p>- Best development and collaboration tools including Jetbrain's IDEs, Newrelic, Sumologic, HipChat<p>Sound interesting or want more information send an email to todd@dollarshaveclub.com","time":1354398410,"type":"comment"},{"by":"stephenhuey","id":4858367,"parent":4857714,"text":"HealthPost - Houston, Texas<p>Join a small team solving real problems for the healthcare industry! Customers love our products, and we're constantly dreaming up new solutions to transform patient access and empower healthcare professionals.  In our zero-bureaucracy company you'll be able to ship code quickly, and we offer the opportunity to work on diverse technical needs, e.g. both consumer-facing UIs as well as internal tools for healthcare professionals, integration APIs to interact with hospital systems and other solutions in the industry, and scaling concerns due to our rapid growth.  You'll enjoy competitive compensation and groundbreaking projects!<p>Although we prefer experience with Ruby on Rails, jQuery and other JavaScript frameworks, we'll certainly consider any talented developers who are excited about making a difference in healthcare.  Reach out to me at stephen.huey@healthpost.com if you want to join this successful startup already deploying to large hospital systems around the country!","time":1354384381,"type":"comment"},{"by":"jamesjyu","id":4858433,"kids":[4859146],"parent":4857714,"text":"Parse - San Francisco, CA - F/T<p>We are hiring on all fronts:<p>* Software Engineer<p>* Site Reliability Engineer<p>* Web Engineer<p>* Solutions Architect<p>* Developer Evangelist<p>* Inside Sales Representative<p>We're building the mobile application platform, and we're growing like crazy. We're now powering over 40,000 apps, including big names like The Food Network, Armani, The Travel Channel, Toms Shoes, and Band of the Day.<p>We will dominate mobile, and we're a small, smart, and passionate team swinging for the fences with many happy customers. Come join us!<p><a href=\"https://parse.com/jobs\" rel=\"nofollow\">https://parse.com/jobs</a>","time":1354385299,"type":"comment"},{"by":"wensing","id":4860218,"parent":4857714,"text":"Stormpulse - Full-time in Austin, TX<p>(We are patio11's first angel investment!)<p>Position: Full-Stack Polymath<p>Relevant tech: Python, MySQL, Postgres, AWS, Backbone, Bootstrap.<p>* Able to rapidly gain (and enjoy gaining) new expertise in a previously-foreign, non-technical domain (e.g. weather, earthquakes, wildfires, solar flares)<p>* Derive joy from seeing huge leaps forward in the customer experience<p>* Mastery in a non-technical discipline (i.e. you are not only a great developer, but also a master at jazz music, mountain climbing, chess, skiing ... something that has taught you how to think beyond a keyboard).<p>* Ability to collaboratively apply the design principles of Stormpulse to new projects<p>* Not satisfied with a compromise -- always pursue the possibility that two seemingly contradictory goals can be simultaneously achieved through great feats of design / engineering<p>* Derives pleasure from the final aesthetic<p>Come learn why businesses like Honda benefit from our technology.<p>Competitive salary, benefits, stock options.  Email: founders@stormpulse.com.<p>Thanks!","time":1354426372,"type":"comment"},{"by":"salar","id":4858002,"parent":4857714,"text":"Amsterdam, the Netherlands. Interns OK, no remote work.<p>Silk (www.silkapp.com) is looking for a DevOps engineer, and front-end and full-stack engineers: <a href=\"http://jobs.silkapp.com/\" rel=\"nofollow\">http://jobs.silkapp.com/</a><p>We're building a product that makes it easy for people to create sites with content that is easy to query, visualize and share. On a deeper level, our vision is to bring the semantic web to the masses and build an amazing company around that.<p>We're working on many interesting and challenging problems, with a custom-built Haskell graph-database on the back-end and a cutting-edge Functional Reactive client-side framework in Javascript on the front-end. The team is still small (~11 people), so you'll be able to make a large impact. We are well-funded by top-tier VCs and located in the city center of Amsterdam.","time":1354378254,"type":"comment"},{"by":"ipster","id":4858500,"parent":4857714,"text":"AllTrails and AllSnow<p><a href=\"http://alltrails.com\" rel=\"nofollow\">http://alltrails.com</a> <a href=\"http://allsnow.com\" rel=\"nofollow\">http://allsnow.com</a><p>FULLTIME Rails / iOS / Android Engineers / Designers<p>San Francisco (preferred) / Los Angeles / NYC / Remote / H1B<p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people rediscover the outdoors and having lots of fun in the process. Camping and snowboarding benefits, anyone?<p>We just launched our brand new site in partnership with National Geographic (<a href=\"http://alltrails.com/partners/national_geographic\" rel=\"nofollow\">http://alltrails.com/partners/national_geographic</a>) and have the #1 outdoors app in the Apple and Android stores (try searching for 'Hiking'). We also have the #1 Snowsports app on iPhone.<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book, and a core committer to Homebrew on the team. We're looking for exceptional full stack Rails and mobile developers (Android and iOS) and designers.<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you! <a href=\"http://alltrails.com/jobs\" rel=\"nofollow\">http://alltrails.com/jobs</a> or jobs@alltrails.com","time":1354386542,"type":"comment"},{"by":"dubisaweapon","id":4858080,"parent":4857714,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B<p>Did you know there's a company based in Soho that has enough technology to be considered among the world's Top 250 supercomputing sites? One that imports over 5TB of data every single day, and has alumni from Google, Intel, and Microsoft?<p>You might think I'm talking about some stealth-mode startup, but I'm talking about where I work: Two Sigma Investments. At our core, we're a technology company applying our talents to the domain of finance. We've created a system that combines artificial intelligence and keen human insight — a system that's constantly improving and advancing.<p>We're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology. We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you!<p>Dave Hahn dave.hahn@twosigma.com <a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1354379137,"type":"comment"},{"by":"beekay","id":4858383,"parent":4857714,"text":"Khan Academy - Mountain View, CA\nFull-time and intern, designers and devs<p>We're a non-profit whose mission is to provide a world-class education to anyone, anywhere. We're scaling quickly. Our students answer over 2 million math problems per day (over 800mm total so far), all generated by our open source exercise generation framework (<a href=\"https://github.com/Khan/khan-exercises\" rel=\"nofollow\">https://github.com/Khan/khan-exercises</a>), and our videos (now from a variety of authors including Sal) have been viewed over 200mm times. We're tracking all that data and using it to customize each student's experience as well as building brand-new tools like our new programming environment (<a href=\"http://ejohn.org/blog/introducing-khan-cs/\" rel=\"nofollow\">http://ejohn.org/blog/introducing-khan-cs/</a>). We could use your help. Working for Khan Academy is one of the highest educational impact positions you can imagine, and we've been called by Wired one of the best places to work in Silicon Valley: <a href=\"http://news.ycombinator.com/item?id=4157078\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4157078</a>. We're hiring designers and all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead. <a href=\"http://www.khanacademy.org/careers\" rel=\"nofollow\">http://www.khanacademy.org/careers</a>","time":1354384559,"type":"comment"},{"by":"jlm382","id":4858138,"parent":4857714,"text":"San Francisco, CA | inDinero (S10) seeks Lead Developer (indinero.com)<p>inDinero has been hauling for about two years now, growing to over a thousand paying business customers, and we're looking for a lead developer!  Both founders (Andy and Jessica) studied computer science before starting the company, and they wrote most of the initial code until product launch.  Today, the company has five full-time developers scattered across the globe, and we're looking for a tech lead who can oversee our team and it's growth as we go from five to thirty.<p>What will happen day-to-day?<p>Spec out new product features with our design team /// Improve our engineering workflow /// Get feedback from team on how we can speed up their work /// Make sure the test suite runs faster and is continuously running /// See that all devs get their technical questions answered promptly /// Update the dummy databases that our developers test code on.<p>Prioritize long-term structural improvements to make to our infrastructure /// Upgrading Rails /// Using something like mongo to track events /// Make sure the servers will scale /// Ensure high security /// Audit code base every quarter /// Refactor and modularize key parts of our code base.<p>Skills we're looking for:\n<i>Ruby on Rails, 1+ years\n</i>Java, 2+ years\n<i>HTML/CSS/Javascript\n</i>Sysadmin experience (Debian)<p>Interested?  Shoot a note over to jobs@indinero.com with why you'd be perfect for the role!","time":1354380031,"type":"comment"},{"by":"kloncks","id":4858541,"parent":4857714,"text":"- Ribbon (<a href=\"https://www.ribbon.co\" rel=\"nofollow\">https://www.ribbon.co</a>) is hiring. Full time in San Francisco. Front-end Developers, Designers, Rails Devs.<p>- Looking to add to our team of five. Ribbon is building a frictionless payments and ecommerce platform that does the transaction wherever the buyer is. Imagine purchasing an item without leaving Facebook, or buying directly from within the Twitter stream, or through email. That's what we're building for consumers, businesses and developers in an elegant way with a huge focus on design. Looking for someone excited at the stage we're at - dealing with first customers, ramping up traction, figuring out new product direction and features - and also excited about the challenges we'll face, like making payments simplified for consumers and dealing with huge technical issues with fraud and building payments infrastructure.<p>We went through AngelPad in the fall and raised a big seed round from great investors. Awesome office in San Francisco, penthouse floor with views of twin peaks and the ballpark in soma.<p>- Some recent press coverage for more details:<p><a href=\"http://techcrunch.com/2012/11/20/ribbon-a-bit-ly-with-payments-brings-simplified-checkout-to-any-platform/\" rel=\"nofollow\">http://techcrunch.com/2012/11/20/ribbon-a-bit-ly-with-paymen...</a><p><a href=\"http://gigaom.com/2012/11/20/shopping-everywhere-ribbon-turns-the-entire-web-into-a-store/\" rel=\"nofollow\">http://gigaom.com/2012/11/20/shopping-everywhere-ribbon-turn...</a><p>Contact hackernews@ribbon.co if interested.","time":1354387345,"type":"comment"},{"by":"benhedrington","id":4857823,"parent":4857714,"text":"Best Buy (Minneapolis, MN) - Full time, strong in HQ presence required to start. Team growing quickly working on more flexible officing (possibly west coast, remote) as we grow.<p>Best Buy is looking for an entrepreneurial minded Product Managers to be key part of our fast growing Digital Experience and Mobile team focused on producing a diverse array of Mobile and digital products on the go, online or in-store. This role will bring to life new digital products that empower consumers to learn, explore, and engage with consumer electronics across Best Buy's digital and physical touch points.<p>Official job post: \n<a href=\"http://www.bestbuy-jobs.com/job/Richfield-Senior-Product-Line-Manager-Digital-Experience-Team-Job-MN-55423/1968965/\" rel=\"nofollow\">http://www.bestbuy-jobs.com/job/Richfield-Senior-Product-Lin...</a>\n<a href=\"http://www.bestbuy-jobs.com/job/Richfield-Product-Line-Manager-Mobile-Digital%2C-Emerging-Platforms-Job-MN-55423/1611712/\" rel=\"nofollow\">http://www.bestbuy-jobs.com/job/Richfield-Product-Line-Manag...</a><p>I am the hiring manager, willing to talk over email, phone, etc. No need to go through the machine to simply learn more. ben dot hedrington at bestbuy.com, ben at hedrington dot com or <a href=\"http://linkedin.com/in/benhedrington\" rel=\"nofollow\">http://linkedin.com/in/benhedrington</a>","time":1354374929,"type":"comment"},{"by":"sugarbear","id":4858646,"kids":[4859133],"parent":4857714,"text":"Disqus - San Francisco, CA<p>Disqus is building the largest conversation platform on the internet. Our embedded comment service sees more than 6bn pageviews monthly, but we're working on more than just comments (check out <a href=\"http://allthingsd.com/20121130/the-future-of-disqus-aims-at-better-discovery-trolls-not-welcome/\" rel=\"nofollow\">http://allthingsd.com/20121130/the-future-of-disqus-aims-at-...</a>).<p>Our core technologies include javascript with backbone.js, python / django, cassandra, and postgres - though we're always experimenting with new stuff.<p>We're a small engineering team, and we need your help to grow. Here are some of our open positions:<p>* Full-stack Web Engineer. Build the future of disqus.com, focusing on: user features, the moderator dashboard, real-time analytics, and payments for new signups and advertising.<p>* Software Engineer - Infrastructure. Use Python to scale and improve our core architecture, hack on our constantly evolving API, and increase our system reliability.<p>* Core JavaScript Engineer. Work on our widely distributed embedded commenting platform / Backbone.js application (reaching millions of users daily).<p>* Operations Engineer. Help improve uptime and speed up our response times in our backend infrastructure. We're on dedicated hardware running postgres, cassandra, redis, and memcache. Lots of freedom and exposure to all aspects of our stack here.<p>* Automations Engineer. Automate all the things, specifically our testing, packaging, deployments. Work on building new tools to speed up development and improve code quality.<p>We've got a strong culture of open source (<a href=\"https://github.com/disqus/\" rel=\"nofollow\">https://github.com/disqus/</a>) and passionate voices in the community (e.g. <a href=\"https://github.com/dcramer/\" rel=\"nofollow\">https://github.com/dcramer/</a> &#38; <a href=\"https://github.com/benvinegar/\" rel=\"nofollow\">https://github.com/benvinegar/</a>).<p>If you're interested in joining us (even if you have a passion that doesn't match up with the postings above), drop me a line: mike@disqus.com","time":1354389291,"type":"comment"},{"by":"lazyjones","id":4858682,"kids":[4861244],"parent":4857714,"text":"Geizhals in Vienna, Austria is looking for senior and lead web/full-stack developers (INTERN).<p>We currently use mostly Perl (mod_perl, PSGI/Plack and Mojolicious), PostgreSQL, Redis, Apache, Gearman, as well as JavaScript, C, Java/JSP, PHP for minor projects, but as an experienced lead developer you would build/expand a team based on sound technology decisions yourself.<p>We're a small (hc: 53), privately-owned and profitable company running one of the oldest and most popular price comparison websites in the German speaking area (built in 1997, incorporated in 2000) and several smaller sites, looking to build a strong, experienced development team to bolster our efforts for current and future projects.<p>German is not strictly required, but helpful. English is mandatory. Strong team skills and a hands-on mentality are absolutely required. You <i>must</i> have experience building large, complex, high-performance websites, implementing A/B-testing and working with medium-sized, mixed (not only dev) teams.<p>If you want to make a difference and enjoy one of the highest living standards in the world, let us know at: jobs@geizhals.at<p>Salaries for these positions will typically be in the range of €56K-80K/y.","time":1354389974,"type":"comment"},{"by":"pbiggar","id":4858604,"parent":4857714,"text":"San Francisco or remote fulltime (in a US time zone)<p>CircleCI: designers, frontend, backendend engineers.<p>At CircleCI (<a href=\"https://circleci.com\" rel=\"nofollow\">https://circleci.com</a>), we're building Heroku for Continuous Integration. We're taking a boring concept and making it revolutionary.<p>We have traction and revenue and funding. Our customers love us, because we move quickly and provide amazing support. All employees talk to customers and are on support rotation.<p>We're written in Clojure. We eat our own dogfood, DevOps, A/B test, do Continuous Deployment and Customer Development.<p>The frontend is a fat javascript client, using HamlCoffee, Less and Knockout.<p>Backend engineers should know Clojure or another 'weird' language (Haskell, Scala, Scheme, etc), and Linux Devops (C compilation model, make, packaging).<p>We're looking for: designers that can write HTML &#38; CSS, Frontend Engineers and Backend Engineers.<p>We're still a small team, so you'll have a large impact on company culture, direction, and product. We're highly influenced by Valve's Employee handbook, and flat cultures like those of Stripe and GitHub.<p>Contact us at jobs@circleci.com. Include samples of awesome stuff you've done.","time":1354388520,"type":"comment"},{"by":"joelg87","id":4858092,"kids":[4860219,4858373],"parent":4857714,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - San Francisco<p>Hope you are having a fantastic weekend.<p>I'd love for you to come join Buffer for the fun ride. We're a small team of 7, we have over 400,000 users and are about to hit a $1M annual revenue run rate. There are some super interesting challenges ahead and just around the corner we're expecting even faster growth through some interesting things we're launching.<p>2 key areas we're looking for help with:<p>- JavaScript (+HTML5, CSS, Backbone.js) to lead our webapp and browser extension development<p>- DevOps (we're PHP/MongoDB on AWS Elastic Beanstalk, and it's been put together by a couple of full stack hackers so there will be a lot that could be improved!)<p>If you're interested in coming on board, you will:<p>- work primarily with myself and my co-founders Leo and Tom<p>- be a happy, positive-minded and kind person who has a great approach in dealing with others<p>- be a Buffer user (would be awesome, it’s cool if not)<p>- be friendly and comfortable helping our users<p>- be based in or willing to move to San Francisco<p>- have experience working with another startup before (would be awesome, it’s cool if not)<p>You’ll be amongst people who are striving for success and pushing themselves forward each and every day. Everyone here seems to progress at an incredible pace, we want to do everything to make that happen for you as well. Whether you want to start speaking, blogging, learning marketing or have other areas of personal growth, you’ll have my personal support and the whole team as a resource too.<p>Great salary and equity - $85k-$140k, 0.5-1.5%.<p>If this sounds fun, let's have a chat. I'm looking forward to it! I'm Joel, drop me an email directly - joel@bufferapp.com.","time":1354379375,"type":"comment"},{"by":"timanglade","id":4857745,"kids":[4859173,4860283],"parent":4857714,"text":"Apigee (Palo Alto, REMOTE, H1B) — Developer Advocates, Java Developers, Mobile Developers.<p>Apigee is dedicated to powering the API &#38; Mobile revolutions. We are helping thousands of developers build API-driven infrastructure and mobile apps every day. Our technology is used at Gilt, Getty Images, Tout, Walgreens, OnStar, eBay, GameSpy, Citrix, AT&#38;T, Pearson, ConstantContact, Best Buy, Dell, Comcast and hundreds of others.<p>We offer catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>We are actively hiring for App Services (our Mobile Backend-as-a-Service technology). Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is currently in open Beta. We are built on top of Jersey, Jackson and Cassandra (we gutted a lot of the latter and built our own indexing system, query system, storage format and multi-tenancy strategy on top of it).<p>Our newest open position is Developer Advocate. Our developer advocates partner up with indie developers &#38; startups to ensure they have a successful launch on our platform; meet people from all walks of life from around the world and help them build apps and APIs; bring feedback from the trenches to the product. This is not solutions architecture or community bootstrapping. This is about helping our existing, vibrant community of indie developers into being even more successful than they already are without our help :) (More details here: <a href=\"http://apigee.com/about/jobs/developer-advocate\" rel=\"nofollow\">http://apigee.com/about/jobs/developer-advocate</a>)<p>We are also looking for Java Developers to join our Core team and help us overcome the next-generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>Finally, we are looking for Mobile developers with at least 1 year experience in one of iOS, Android or JavaScript+HTML5 development to work on our SDKs and a range of exciting mobile apps.<p>Want to apply? Have some questions? Want to join but don’t match either position? Then get in touch! ➝ tim@apigee.com","time":1354373316,"type":"comment"},{"by":"jon-wood","id":4858282,"parent":4857714,"text":"Hubbub - London or Remote - Full time<p>Hubbub is saving independent food shops by letting people order online when they can't get to the shops themselves. We mask the complexity of ordering from lots of separate shops and allow customers to place a single order online and receive all their weekly shopping in one go. It's good for the shops because it lets them reach a wider audience, and it's good for our busy customers because it allows them to support their local community.<p>We're looking for two developers, who will double the size of our current team, to work on our Rails based website and supporting applications. Ruby experience is a plus, but we're very happy to take on people without direct experience if they know how to learn - our second developer hadn't written any Ruby before starting with us.<p>More details, including how to apply, are at <a href=\"http://apply.hubbub.co.uk/\" rel=\"nofollow\">http://apply.hubbub.co.uk/</a>","time":1354382619,"type":"comment"},{"by":"yesimahuman","id":4858425,"parent":4857714,"text":"Codiqa.com<p>Madison, WI - Full time, (REMOTE possibly)<p>We are looking for our first engineer hire to help us build the future of HTML5 app creation tools in the cloud.<p>Codiqa makes it easy for anyone to build HTML5 mobile apps with an intuitive and powerful drag-and-drop builder. You may have also heard of our Twitter Bootstrap interface builder called Jetstrap (<a href=\"http://jetstrap.com/\" rel=\"nofollow\">http://jetstrap.com/</a>), which makes it easy to build HTML5 desktop websites and responsive sites.<p>Both products fit into our dream of making it easy for people to build applications with web technologies and with minimal coding required.<p>We are looking for a generalist that loves Javascript or CoffeeScript but can handle backend development too (we use Python). We also have a specific exciting opportunity in front of us that we would love you to join us for (I'll share details if we chat).<p>If interested, please send an email to me at  max AT codiqa DOT com.","time":1354385224,"type":"comment"},{"by":"davidw","id":4857796,"parent":4857714,"text":"Padova, Italy: the company I'm consulting for needs a front-end/UX guy.  The ideal person is someone who lives in the world of Javascript, and knows JQuery, as well as something like Backbone.js, keeps abreast of the latest developments in HTML5/CSS, and <i>also</i> has a good eye for design.  Bonus points for knowing your way around a Linux server, and having some Rails knowledge.<p>The company is <a href=\"http://www.centervue.com/\" rel=\"nofollow\">http://www.centervue.com/</a> and it's a pretty cool outfit.  They make devices that take pictures of your retina, amongst other things.  The team I work with are great guys, and smart hackers.  However, we don't have a lot of UX sense, and we could also use some more front-end power on the team, which is where you come in.  Email davidw@dedasys.com if you're interested.","time":1354374377,"type":"comment"},{"by":"dsj12","id":4858129,"parent":4857714,"text":"One Kings Lane (<a href=\"http://onekingslane.com\" rel=\"nofollow\">http://onekingslane.com</a>) in San Francisco, CA.<p>We just moved into an historic warehouse building on 9th and Market downstairs from Twitter. We plan to add dozens of engineers, data analysts/scientists, and more (including non-technical roles) as we grow from &#62;$200M in revenue this year toward profitability: <a href=\"https://www.onekingslane.com/corporate/careers/tech/\" rel=\"nofollow\">https://www.onekingslane.com/corporate/careers/tech/</a><p>Our platform is barely a year old, mostly Ruby on Rails, Hadoop/MongoDB, Redis, Node.js, PHP/Zend Framework, jQuery, iOS/Objective-C. Our stack has enough variety that you can start contributing immediately with what you do know, while continuing to expand your skills into areas you want to know.","time":1354379964,"type":"comment"},{"by":"kapilvt","id":4858835,"parent":4857714,"text":"Canonical / Ubuntu<p>Seeking senior web/frontend developer (html5, css3, yui app/backbone style, TDD) [fulltime remote work]. Building next-generation of opensource orchestration and deployment tools.<p><a href=\"https://ch.tbe.taleo.net/CH03/ats/careers/requisition.jsp?org=CANONICAL&#38;cws=1&#38;rid=482\" rel=\"nofollow\">https://ch.tbe.taleo.net/CH03/ats/careers/requisition.jsp?or...</a>","time":1354393225,"type":"comment"},{"by":"kentf","id":4857915,"parent":4857714,"text":"Dev Ops, Mobile, Front End, Back End - Toronto / San Francisco / Remote<p>Top Hat Monocle<p>www.tophatmonocle.com<p>Come to Top Hat and solve Real Time, Large Scale problems.  We are a venture backed and disrupting the education industry and want you to join us!<p>Great salary, stock, benefits, work from Toronto / San Francisco office, or if you are amazing you can work remotely.<p>* Front End Developer<p>JS, Backbone, HTML, HAML, CSS, SCSS<p>* Dev Ops<p>AWS, RabbitMQ<p>* Back end<p>Python, Django, C++<p>* Mobile<p>Android, iOS, Windows Phone<p>Contact kent@tophatmonocle.com for more details!","time":1354376623,"type":"comment"},{"by":"zedwill","id":4858081,"parent":4857714,"text":"Madrid, Spain. Full time.<p>Node.js software developer<p>Candidates need to be based in Madrid, Spain.<p>We offer the possibility of working partly remotely.<p>MediaSmart is an startup solving problems in mobile advertising. Work is fun and fresh. You will work in real time bidding, performance advertising, and mobile tracking. Our tech stack is Node.js for the application layer, a No-SQL backend for persistente, and Express+Backbone.js for the user interface. Knowledge of iOS/Android development is a plus.<p>More info and contact information available at:<p><a href=\"http://www.mediasmart.es/es/pdf/developer.pdf\" rel=\"nofollow\">http://www.mediasmart.es/es/pdf/developer.pdf</a><p>When applying, please add you saw this offer in HN","time":1354379137,"type":"comment"},{"by":"kluikens","id":4857901,"parent":4857714,"text":"San Francisco, CA.<p>FreedomCP (<a href=\"http://freedomcp.com/\" rel=\"nofollow\">http://freedomcp.com/</a>)<p>We're sysadmins/developers using our backgrounds in computer security and network research to automate the management of cloud servers and the web applications running on them.<p>What we need help with right now:<p><pre><code>  Front-end engineer: Javascript · Security   ($80-$100k, 1.0%-2.0%)\n  Back-end engineer: Python · Security        ($80-$100k, 1.0%-2.0%)\n</code></pre>\n<a href=\"https://angel.co/freedomcp#recruiting\" rel=\"nofollow\">https://angel.co/freedomcp#recruiting</a><p>Or email me: kevin [at] [domain] :)","time":1354376440,"type":"comment"},{"by":"Yoric","id":4859004,"kids":[4859114],"parent":4857714,"text":"Mozilla (<a href=\"http://careers.mozilla.org\" rel=\"nofollow\">http://careers.mozilla.org</a>), everywhere in the world. Employees, contractors, interns, local or remote.<p>We build Firefox. We build Firefox OS. We push open source, open standards and the open web. We teach web literacy to turn consumers into actors.<p>Enough said?","time":1354396144,"type":"comment"},{"by":"zukhan","id":4860441,"parent":4857714,"text":"FULLTIME or INTERN. Offices in San Francisco, Menlo Park, and Boston<p>Delphix is a data virtualization company that is doing for databases what VMware did for servers - this is a massive market, and we are on track for similar success. We're looking for software generalists to help build our full stack, from the operating system and filesystem, to the Java management stack, and the GUI.<p>The engineering team at Delphix is composed of the inventors and architects of the VMware platform, ZFS filesystem, DTrace, Oracle RAC, DataGuard, and Flashback.<p>We've built an engineering culture where anyone with a good idea can have a voice and drive unique projects. Whether it's developing new abstractions in the filesystem, designing an architecture to interoperate with a novel database, or developing a new cloud paradigm for virtualizing data, there is no lack of hard problems and opportunities at Delphix.<p>The Delphix platform has already established itself as the premier platform for structured data management in the enterprise world. In our first year of selling, we added 50 large corporate customers, including many from the fortune 500 (Proctor &#38; Gamble, RBS, Fidelity, Deutsche Bank, Comcast, Staples, Qualcomm, among others). Year 2 revenue is growing at 300%.<p>Check out our technical blog at <a href=\"http://blog.delphix.com\" rel=\"nofollow\">http://blog.delphix.com</a>.<p>News coverage: <a href=\"http://www.prnewswire.com/news-releases/delphix-raises-25-million-in-series-c-funding-157445155.html\" rel=\"nofollow\">http://www.prnewswire.com/news-releases/delphix-raises-25-mi...</a>","time":1354432485,"type":"comment"},{"by":"kloutlaw","id":4858434,"parent":4857714,"text":"Klout is hiring in San Francisco, CA (H1B is fine)<p>We’re looking for a seasoned product engineer to help us deliver great user experiences at great speeds. Our web applications stack is focused on JavaScript, driven by node.js on the server and Backbone.js on the client. You’ll be working with talented designers, platform engineers, and scientists to bring our 9 billion data signals to our customers, who are a mixture of brands and social media users like you.<p>Apply here if this sounds like you: <a href=\"http://bit.ly/11gKHU9\" rel=\"nofollow\">http://bit.ly/11gKHU9</a><p>We're also looking for a seriously-talented operations engineer to help us create cutting edge systems and tools to manage, maintain and monitor all aspects of the Klout production, staging, and development environments.  Our environment is an intense combination of modern software and tried and true technologies including and leveraging Hadoop, Hbase, MongoDB, ElasticSearch, MySQL, HAProxy, redis, memcached, Node.js and Scala.  We'll challenge your scalability chops with our high volume consumer site traffic coupled with the Big Data challenges of processing over 9 billion data signals a day for over 400 million users on multiple petabyte clusters.<p>Apply here if this sounds exciting: <a href=\"http://bitly.com/SAkkFL\" rel=\"nofollow\">http://bitly.com/SAkkFL</a>","time":1354385299,"type":"comment"},{"by":"leeny","id":4858407,"parent":4857714,"text":"TrialPay - San Francisco - F/T<p>TrialPay is looking for someone to own the user-facing portion of our product. Basically, you should think like a PM, have the vision of a world-class designer, and code like a beast.<p>Asking for one person to be able to do all of these things is ambitious, sure, but you’d be working on some pretty amazing stuff.  We put a huge premium on beautiful UIs, clean re-usable front-end code, and amazing user experience. This focus has helped us become a leader in the online advertising space, and with over 100mil+ impressions per day coming from all over the world, we conduct UI A/B tests at massive scale.  Our front end is going to be your science experiment.<p>We also have some pretty amazing projects for you to work on and own.  Specifically, TrialPay is changing the way people shop by bridging the gap between the online and offline worlds.  Here’s an early demo of what we’re doing:<p><a href=\"https://instore.trialpay.com/landing/?offer_id=3503426114533148569&#38;reward=10+Credits&#38;activation_subid=2345&#38;click_id=1234\" rel=\"nofollow\">https://instore.trialpay.com/landing/?offer_id=3503426114533...</a><p>Basically users get instant rewards online for offline actions, and for the first time, brick and mortar businesses can determine the efficacy of their online campaigns (social media, pay-per-click advertising, etc.) at a granularity that’s never been possible before.  You’d be making significant contributions to the user-facing portion of this new product as well as that of our other initiatives in the mobile and social spaces, from initial design to prototyping and implementation.","time":1354385024,"type":"comment"},{"by":"lhnz","id":4857924,"parent":4857714,"text":"We R Interactive - London, UK<p>Come and make games with us!<p>We're blending a mix of game, film and TV production to create innovative social games.<p>We care a lot about building high quality games are are looking to hire some junior to mid-level software engineer generalists to come to our office in Clerkenwell and work on both server-side and iOS game development.<p>We'd love to hear from you if:<p>* You are collaborative and upbeat with a strong work ethic. We have a lively, busy atmosphere in an open plan setting and we want somebody that will relish working in this type of environment.<p>* You're interested in taking a real-time stream of real-world data and turning it into a game. ;)<p>* You are well-versed in game development on iOS or would like to work on our back-end services. We're currently using a wide range of technologies including PHP, Cassandra, Unity, Redis, and Node.js.<p>* You have a passion for gaming and are motivated by a strong desire to make great games. Be prepared to learn rapidly as part of a team that is focused on excellence in games development.<p>* You believe you have good intuition on product design.<p>* You feel like you there is anything else that you could offer us!<p>I currently work there and can be contacted on sebastiani+hn@werinteractive.com. Feel free to drop me an email with any questions or your CV and any relevant development accounts (github, stackoverflow.) The email which will get you directly to the lady that handles recruitment is estellar+hn@werinteractive.com","time":1354376743,"type":"comment"},{"by":"ledwards","id":4858288,"parent":4857714,"text":"SideTour - New York, NY<p>SideTour is looking for a Senior Rails Developer. This an amazing opportunity to be part of the early engineering team at one of New York’s most promising startups. You’ll have the chance to contribute to the next version of our product from the ground-up and shape the growth of the emerging peer-to-peer experiences and activities market.<p>Our team is small - you'd be the fourth full-stack web developer. Our stack is Ruby on Rails, Javascript, HTML, CSS, Postgres and a sprinkling of Redis on Heroku. We're serious about agile development very much in the style of Pivotal Labs - pair programming, BDD/TDD, continuous integration. This is a great job for you if you're looking for a haven to practice agile software development, or if you want to learn.<p>The rest of the team is awesome. You will love the cofounders, our host development, support, and marketing team members - all early in their careers and very driven.<p>Take a look at our site: <a href=\"http://www.sidetour.com\" rel=\"nofollow\">http://www.sidetour.com</a> and the job listing: <a href=\"http://www.sidetour.com/jobs#tech\" rel=\"nofollow\">http://www.sidetour.com/jobs#tech</a><p>No need to apply through the web form. Just email me. lee@sidetour.com","time":1354382729,"type":"comment"},{"by":"ladon86","id":4858205,"parent":4857714,"text":"ClassDojo<p>FULLTIME in SAN FRANCISCO, CA<p>ClassDojo is used by over 4mm teachers and students to manage behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We're an edtech startup with $1.6mm in funding some of the biggest names in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we're one of the fastest growing education companies of all time. Paul Graham invested in us, but we didn't do YC.<p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board. If you're a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n\n\n  https://classdojo.wufoo.com/forms/join-classdojo/  \n\n\n  --------------------------    \n</code></pre>\nOr email jobs@classdojo.com. You can read about the work and environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a>\nWe are looking for:<p><pre><code>  * Full Stack Engineer  \n\n\n  * Front-end Engineer  \n</code></pre>\nIf you think you're a good developer but don't fit into those buckets, get in touch anyway.","time":1354381178,"type":"comment"},{"by":"paulitex","id":4858529,"parent":4857714,"text":"Learndot – Vancouver, BC, Canada or San Francisco, CA<p><a href=\"http://www.learndot.com/\" rel=\"nofollow\">http://www.learndot.com/</a><p>Full-time, Intern, or Remote.<p>Learndot builds beautiful learning centers for organizations. Our goal is to help make the world a smarter place. We've been creating learning technology for 3 years, are alumni of the GrowLab accelerator in Vancouver, and were recently profiled by TechCrunch as an up and coming player to watch. Our business model is SaaS, we are B2B, are revenue-focused, and growing very quickly.<p>Both founders are developers and we care about creating great work environments, providing flexibility and autonomy, and helping everyone grow to continuously become better at their craft. We are currently a team of five fulltime.<p>Core technologies: Client-side Javascript (we use Sproutcore), Scala (all server-side code).<p>To apply email prlambert@learndot.com with [HN] in the subject line. Open positions:<p>1) Lead Quality Assurance Engineer. \nWe are making our first QA hire. looking for someone who can grow to lead a QA team, can cultive a processes for quality throughout the entire development pipeline, is exciting about continuous deployment, and can build the infrastructure for high-quality automated and manual testing procedures.<p>2) Front-End (JS) or Full Stack Engineer (JS + Scala).\nWe are looking for a great javascript developer who will work directly with our CTO and Designer in building our core application across multiple devices. Learndot is a thick-client JS app using Sproutcore. Our backend API is written in Scala. The ability or desire to work in Scala is a bonus, but our immediate needs are on the JS-side.","time":1354387070,"type":"comment"},{"by":"wferrell","id":4858314,"parent":4857714,"text":"Palo Alto, CA - Sherpa<p>We're building predictive intelligence into your smartphone.<p>We provide users just the information they need right as they need it and simplify task completion on the iPhone. From telling you 20 minutes before you leave for work that there is a major accident on your typical route, to automatically surfacing key information at the right location -- like your hotel reservation as you approach your hotel -- we simplify your life and help you focus on what's important.<p>It is really only in the past year that what we are doing has become possible on a large scale. This is because background location is now available and with it we are able to build models of the user and connect key bits of information to the user's current state (think position).<p>We would love to show and tell you more!<p>We're looking for great people to join our small startup backed by top VCs.<p>Specifically:<p>Backend Software Engineers<p>The deep technology problem we face is information retrieval and machine learning. The user models we build help us make predictions and determine how and when to present information.<p>iOS Engineers<p>We’re looking for iOS engineers that can build beautiful experiences and effects, and squeeze performance out of the system.<p>Please email me at wferrell AT getsherpa.com with your resume.","time":1354383346,"type":"comment"},{"by":"dale-ssc","id":4862962,"parent":4857714,"text":"Socialserve.com -- Charlotte, NC -- local or remote<p>We're looking to add a developer to our small team to write and maintain our ever-growing stable of web-based Python applications for governments, non-profits, and the public.<p>Reasons to work for us:<p>* Developers are at the heart of our business.  We have a flexible, no-nonsense environment where you can get real work done.<p>* Developers make our technology decisions.<p>* We enjoy programming and take pride in our craft.  We strive to develop software that our users love to use.<p>* Python is our primary language and we develop on OS X and Linux.<p>* We love and use open source software, such as PostgreSQL, PostGIS, Git, and Asterisk.<p>* We're a 501(c)(3) non-profit making software that helps governments and other non-profits help people in need.<p>We're typically most impressed by candidates who have:<p>* A desire and talent for solving problems with software<p>* A strong curious streak and a love for learning<p>* Solid written and verbal communication skills<p>* Experience with a few different programming languages<p>* Experience with relational databases and SQL<p>* Familiarity with web standards and technologies<p>* At least a bachelor's degree, preferably in computer science<p>We'd love to hear from you.  Please send a résumé to employment@socialserve.com or read more at <a href=\"http://www.socialserve.com/jobs/\" rel=\"nofollow\">http://www.socialserve.com/jobs/</a>.<p>This is an FTE position.  No recruiters, job boards, etc. please.","time":1354489446,"type":"comment"},{"by":"goronbjorn","id":4858602,"parent":4857714,"text":"Los Altos, CA<p>Box (Box.com), specifically platform: developers.box.com, box.com/platform<p>You can find all of our recent awesome news here: <a href=\"http://www.crunchbase.com/company/box\" rel=\"nofollow\">http://www.crunchbase.com/company/box</a><p>Hiring for two positions:<p>- Platform Engineer<p>You'll be building and designing APIs on the Box platform from front to back. Box is an enterprise software company, but we build and design our APIs to be on par with the best consumer APIs out there e.g. Twilio, Stripe, etc (you can see our documentation here: developers.box.com/docs). All experience levels are welcome to apply.<p>- Associate Product Manager<p>Ideal for someone looking to get into product management that may not have experience as a PM already. You'll work with all areas of the company (engineering, sales, marketing, business development, other PMs) to determine what direction to take the Box platform in and figure out what the necessary steps are to get to that direction from a product perspective. As you'll be working with APIs, a strong technical background is necessary (i.e. you have enough technical clout to be an engineer)<p>If you are interested in either or both, please contact me directly: sean@box.com","time":1354388418,"type":"comment"},{"by":"subwindow","id":4858593,"parent":4857714,"text":"Damballa is hiring in Atlanta, GA or possibly remote for the right candidate.<p>Damballa offers a line of security appliances for enterprises and ISP customers. The appliance identifies unknown and hidden threats long before traditional security solutions by monitoring network communications and doing a wealth of analysis and correlation on this data.<p>We're looking to hire multiple people for each of the following positions:<p>- UI/UX/Front-end engineer. Javascript (CoffeeScript), CSS, Rails. Designing and implementing customer interfaces. We have many challenges with distilling huge quantities of information down into digestible bites.<p>- Back-end engineer. C, Ruby. High-performance deep packet inspection and analysis.<p>- R&#38;D Developer. Ruby, Clojure, C, Python, Java. Working with processing, storing and analyzing huge quantities of information using Hadoop, Couch and Cassandra.<p>- Also hiring for DevOps, Technical PM, Malware Researchers and more. Read about them at <a href=\"https://www.damballa.com/company/employment.php\" rel=\"nofollow\">https://www.damballa.com/company/employment.php</a>.<p>Email me if interested at epeterson@damballa.com. I'm an engineer, not a recruiter or HR person.","time":1354388231,"type":"comment"},{"by":"jasoncartwright","id":4858301,"parent":4857714,"text":"Potato is a 65-person developer-lead agency based in London, UK with offices in Bristol, Amsterdam, Sydney &#38; San Francisco. Our clients include Google, PayPal, a number of startups and other agencies such as BBH &#38; Mother.\nWe're hiring for a variety of positions in a variety of locations, freelance &#38; full time, including:<p>Senior Django Developer, London - <a href=\"http://p.ota.to/jobs/senior-django-developer-london/\" rel=\"nofollow\">http://p.ota.to/jobs/senior-django-developer-london/</a><p>Django Developer, London - <a href=\"http://p.ota.to/jobs/django-developer-london/\" rel=\"nofollow\">http://p.ota.to/jobs/django-developer-london/</a><p>Django Developer, Bristol - <a href=\"http://p.ota.to/jobs/django-developer-bristol/\" rel=\"nofollow\">http://p.ota.to/jobs/django-developer-bristol/</a><p>UX Designer, Bristol - <a href=\"http://p.ota.to/jobs/ux-designer-bristol/\" rel=\"nofollow\">http://p.ota.to/jobs/ux-designer-bristol/</a><p>Studio Manager, London - <a href=\"http://p.ota.to/jobs/studio-manager-london/\" rel=\"nofollow\">http://p.ota.to/jobs/studio-manager-london/</a><p>More at <a href=\"http://p.ota.to/jobs/\" rel=\"nofollow\">http://p.ota.to/jobs/</a>","time":1354383034,"type":"comment"},{"by":"f00biebletch","id":4858315,"parent":4857714,"text":"Skype - Palo Alto<p>We are a startup unit inside Skype inside MS delivering very large scale services to transform portions of the Skype P2P network into a server based system.  While we work in MS and engineer systems with C++/C#/Azure and nosql backends, our team is a *nix-centric group of hackers who have used erlang, rabbit, mongo, redis, etc, etc in production systems.<p>While we are not a startup, our org is run by a serial entrepreneur with multiple exits who just likes to get things done, and our culture reflects that.  We also have the usual suspects of catered lunches, dogs barking in the office, free caltrain, and even a good bit of node.js lurking around.<p>We need hackers and engineers who know how to balance beauty with pragmatism to get systems shipped, and who find deep joy in creating beautiful systems that make a real difference in the world.<p>Contact f00biebletch at gmail.com if interested, this is the best corporate opportunity you'll ever find - stable funding, creative thinkers, risk taking encouraged, no politics, just delivering great systems.","time":1354383351,"type":"comment"},{"by":"almog","id":4858860,"parent":4857714,"text":"Tel Aviv, Israel.<p>We're a well funded Ruby shop that try to make online payments easier.<p>We're looking for a full-stack web developers or experienced engineers who'd like to learn Ruby and other technologies we're currently using, here are some of them:\nRails, Sinatra (for our API), Coffeescript (♥), Konacha (Mocha + Chai), Cucumber, SASS, HAML, Bootstrap, Chef + Vagrant (Devops are most welcomed), Jenkins, Gitlab, Postgres and Redis.<p>Our engineering workflow is collaborative, we do pair-programming on a daily basis.<p>The team has an enjoyable and collaborative culture, we do pair-programming all the time (yes, even remotely with tmux)\nWe emphasize good communication, great engineerding, automating ALL the things, professional development (get things done for one) and believe that a developer should not only do but also learn, at work, not just in his free time.<p>Local based engineers only but if you're located in Europe / North America and want an interesting relocation, don't hesitate we already have two relocated developers onboard.<p>Drop me a line at almog.tunel@gmail.com","time":1354393775,"type":"comment"},{"by":"eli","id":4858768,"parent":4857714,"text":"Industry Dive - Mobile-first B2B news and intelligence - Washington, DC - FULLTIME &#38; INTERN<p>We publish news and intelligence for business professionals in a variety of industries. All our content is optimized to look good on mobile devices. Check out <a href=\"http://www.educationdive.com\" rel=\"nofollow\">http://www.educationdive.com</a> or <a href=\"http://www.utilitydive.com\" rel=\"nofollow\">http://www.utilitydive.com</a> to get a feel for what we're doing.<p>We are seeking to hire a full-time Online Marketing Manager as well as a Marketing Intern, Python Development Intern, and Web Design Intern. More details here <a href=\"http://www.industrydive.com/jobs/\" rel=\"nofollow\">http://www.industrydive.com/jobs/</a> or send me an email.<p>Bonus for HN readers: It's not yet posted anywhere, but we are also seeking to hire a full-time Writer/Editor who can contribute content and help oversee freelancers. At the risk of sounding crass, it's probably a great fit for a recently laid off Living Social writer.<p>Email is in my profile.","time":1354391792,"type":"comment"},{"by":"metra","id":4859667,"parent":4857714,"text":"Taproot Foundation is looking for pro bono part time developers and designers in the Bay Area, New York, DC, Los Angeles and Chicago.<p>Taproot volunteers support local nonprofits. Web developers are responsible for the coding and implementation of website projects. Graphic designers are responsible for the visual design elements of a website project and assist in creating site maps and wireframes. Projects require 3-5 hours per week over the course of 6 months.<p>Taproot Foundation is a nonprofit organization that makes talent available to other nonprofits that are working to improve society. We engage technology, design, strategy, marketing and HR management professionals on pro bono projects, called Service Grants that benefit local nonprofits.<p>My name is Adam, feel free to ask me any questions, adam AT taprootfoundation DOT org. Apply at <a href=\"https://www.taprootfoundation.org/giveprobono/apply.php\" rel=\"nofollow\">https://www.taprootfoundation.org/giveprobono/apply.php</a>","time":1354410620,"type":"comment"},{"by":"nrh","id":4858859,"parent":4857714,"text":"Spotify, NYC and Stockholm, for...lots of stuff!<p>- SRE<p>- Backend Infrastructure<p>- Machine Learning<p>- Mobile iOS and Android<p>- Team lead positions for most of the above<p>- Lots of things not-mentioned (<a href=\"http://www.spotify.com/se/jobs/\" rel=\"nofollow\">http://www.spotify.com/se/jobs/</a>)<p>On the backend, we have an (extremely) service-oriented architecture written primarily in python and java with smatterings of C++ and others thrown in.  Storage is Postgres or Cassandra.  Messaging is zmq and protobuf and a few other interesting things.<p>On the frontend, we do hybrid native+CEF for most platforms.<p>We have (I think, anyway) a pretty interesting approach to how we work, which you can read some more about here: <a href=\"http://de.scribd.com/doc/113617905/Scaling-Agile-Spotify\" rel=\"nofollow\">http://de.scribd.com/doc/113617905/Scaling-Agile-Spotify</a> and here: <a href=\"https://hep.cat/d/nrh-how-we-work.pdf\" rel=\"nofollow\">https://hep.cat/d/nrh-how-we-work.pdf</a><p>We're looking for experienced developers, no junior roles, sorry.<p>Apply on the website, but mention HN and get bumped to the top of the resume pile!","time":1354393770,"type":"comment"},{"by":"iconfinder","id":4858104,"parent":4857714,"text":"Iconfinder - Copenhagen, Denmark<p>Full-time developer<p>IconFinder is looking for an awesome full-time code slinger to join our development team and jump straight into moving our core platform forward. Being both a search engine and an e-commerce marketplace for icons, we're looking for a hacker with a passion for all things Web.<p>We're working full steam on providing not only the best search experience but also the best shopping experience for icons. At the heart of our platform is a young Django application backed by a PostgreSQL database and an elasticsearch cluster, which is used by more than 2.5 million people every month.<p>We're looking for an inspired, self-motivated and creative developer, who wants to make a dent and inspire others to do the same. As we've only just scratched the surface of our ideas and the opportunities Iconfinder holds, we're looking for a savvy colleague to help us move Iconfinder ahead even faster.<p>Need to have<p>At least two years of professional Python web development experience.\nSolid frontend expertise including experience using HTML5, CSS and JavaScript.\nExperience in working on database-driven (PostgreSQL or MySQL) web applications using open source MVC-esque frameworks (Django, Rails, etc.), and running them in production on Linux systems using open source stacks (nginx, memcached, Redis, the lot.)\nAn unquenchable thirst for knowledge and a solid amount of professional pride.\nAn eye and love for design.\nNice to have<p>Knowledge about Django.\nA relevant degree, like computer science or graphic/web design.\nSemi-mad design skills.\nAppreciation for great coffee.\nInterested?<p>Please send your resume and/or GitHub profile etc. to jobs@iconfinder.com. If you have additional questions, feel free to call Martin at: +45 61 69 67 81.<p>Our offices are in Copenhagen, Denmark. We are currently working from the office sharing space, Founders House.","time":1354379565,"type":"comment"},{"by":"kylecsteele","id":4858132,"parent":4857714,"text":"Software generalist to join us in Austin at top accelerator. Help us finish building in 3 months and launch product at sxsw, then consider staying with us afterwards. Here's stack: <a href=\"http://doccaster.blogspot.com/2012/11/no-turkeys-allowed.html\" rel=\"nofollow\">http://doccaster.blogspot.com/2012/11/no-turkeys-allowed.htm...</a>","time":1354379983,"type":"comment"},{"by":"pepsi_can","id":4857889,"parent":4857714,"text":"OwnLocal (YC 2010) - Full time in beautiful Austin, Texas.<p>We're saving local newspapers by enabling their online revenue. And we're having success.<p>Our tools include Ruby on Rails, Cucumber, Javascript, Mysql, Redis, Amazon Web Services and Git.<p>Check us out:<p><a href=\"http://ownlocal.com/company/jobs/ruby-systems-engineer/\" rel=\"nofollow\">http://ownlocal.com/company/jobs/ruby-systems-engineer/</a>","time":1354376221,"type":"comment"},{"by":"jedberg","id":4858740,"parent":4857714,"text":"Netflix -- Los Gatos, CA<p>Looking for a couple of SREs to fill out our team.  The job is a combination of architecture, coding and evangelism of best practices.  Our team writes monitoring and alerting tools, runs reliability exercises and also act as call leaders for outages.<p>Skills required:  Ability to code.  We use mostly Python, so experience there is a plus.  Good communication, calm under pressure and the ability to quick grasp how all the pieces of a large complex system fit together.<p>Check out our github page (<a href=\"https://gitub.com/netflix\" rel=\"nofollow\">https://gitub.com/netflix</a>) for some examples of the type of stuff our team and our sister teams write.<p>Mail talent@netflix.com if you're interested and mention that you saw the post on Hacker News.<p>Netflix is also hiring for a lot of our teams.  Check out our jobs page (<a href=\"http://jobs.netflix.com/jobs.html\" rel=\"nofollow\">http://jobs.netflix.com/jobs.html</a>) for the list.","time":1354391267,"type":"comment"},{"by":"thackerhacker","id":4861965,"parent":4857714,"text":"ASOS (Camden Town, London) - Senior .net Developers - ASOS Marketplace<p>ASOS is a leading and fast growing online fashion retailer.  ASOS Marketplace launched 2 years ago with the aim of building a \"Global Fashion Democracy\"; a platform to allow anyone, anywhere to sell fashion.  It was a greenfield project and has been carefully cultivated inside and out to provide a great experience for buyers, sellers, its developers and business users alike.<p>Marketplace is now at a turning point and 2013 is going to be a big year for the site.  We're looking for talented C# devs to help us take it to the next level.<p>In many ways we operate like a startup.  We use:<p>- ASP.NET MVC\n- SQL Server\n- MongoDb\n- Solr\n- NServiceBus\n- Castle Windsor\n- JQuery\n- agile - with a lower case \"a\"<p>Sound interesting? Apply at <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=4270875\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=4270875</a>","time":1354472385,"type":"comment"},{"by":"ssc","id":4858755,"parent":4857714,"text":"Anywhere<p>REMOTE; FULLTIME; H1B, E3, etc. are all possible!<p>SSC Group LLC is hiring a developer with Rails experience.<p>====&#62;<p>We run adult entertainment websites. Our company is profitable and growing.<p>Some things we use every day and love: Linux, Git, GitHub, Vim, nginx, Varnish, Unicorn, Rails, PostgreSQL, Redis, Javascript, and probably others.<p>====&#62;<p>* We allow full time telecommuting.<p>* We work normal hours.<p>* We pay for coworking/office space if you want it.<p>* We have offices in Los Angeles if you want to work on-site.<p>* We allow our developers to contribute to open source.<p>* We get to pick our tools and technologies on new projects.<p>* We take you to RailsConf if you want to go.<p>* We pay competitively.<p>* Our company owners are technical and understand how development works (refreshing!)<p>* We have a Hubot in our Campfire.<p>====&#62;<p>You should be fluent with Rails and know your way around a Linux server. You should also be comfortable working with adult material.<p>If you're interested, we want to hear from you!<p>Drop us a line and show us one of your projects, a GitHub/StackOverflow profile, or anything else you're proud of.<p>jobs@sscgroupllc.com<p>Experience with high-traffic web sites and TDD/BDD are pluses.","time":1354391544,"type":"comment"},{"by":"ashearer","id":4858878,"parent":4857714,"text":"Providence, RI (full-time) or remote (part-time)<p>Care Thread provides secure mobile messaging and team-based collaboration solutions for healthcare providers in hospitals. Care Thread's mobile and web apps deliver real-time information detailing patient status and treatment to every member of the care team, addressing communication gaps to eliminate unnecessary costs and reduce medical errors.<p>Our products are built around a real-time messaging and notification framework, using tools including node.js, Python, CoffeeScript, RabbitMQ, and PostgreSQL.<p>We're looking to expand our team by adding web front-end developers, mobile developers, and back-end developers, as well as a system administrator who's comfortable with PostgreSQL databases, Amazon Virtual Private Cloud, and VPNs.<p>If you'd like to build the next generation of healthcare software, please contact us at jobs@carethread.com.","time":1354394003,"type":"comment"},{"by":"smcguinness","id":4857888,"parent":4857714,"text":"Frisco, TX (North Texas)\nFront-End Web Application Developer<p>JavaScript/jQuery/Backbone, Asp.NET / C#, Entity Framework / SQL<p>You’ll be an integral part of a small engineering team with many years of experience. We’ll expect you to learn quickly and make critical and significant contributions. Currently, we’re working on some tools for our customer service team and will soon start on developing a more mobile friendly version of our website.<p>We currently develop in JavaScript/jQuery/Backbone, but you’ll need to also be comfortable with Asp.NET / C# to support our existing website. Strong CSS/HTML skills a must and you should have a keen eye for design and usability. Participate in a 24/7 on-call support rotation and provide technical support to our customer service team.<p>If you’re interested, we’d love to see your work. It could be anything from a side project or your github profile.","time":1354376201,"type":"comment"},{"by":"sweis","id":4859481,"parent":4857714,"text":"PrivateCore in Menlo Park, CA is looking for a full-time memory management researcher:<p><a href=\"http://www.privatecore.com/careers/memory-management-researcher.html\" rel=\"nofollow\">http://www.privatecore.com/careers/memory-management-researc...</a><p>Our secure hypervisor requires innovative solutions to challenging memory-management problems. We are looking for motivated systems researchers to design and implement novel resource-management mechanisms and policies.<p>We'd expect a good candidate to have:<p>- Several years experience in computer systems R&#38;D focused on operating system kernels or hypervisors.<p>- Demonstrated ability to innovate, evidenced by relevant publications, patents, or shipped products.<p>- Expert knowledge of virtual memory, paging, and related low-level system internals.<p>PrivateCore is venture-backed and our team is currently 6 full-time engineers from VMware, Google, WindRiver, IBM, and the intelligence community.","time":1354406042,"type":"comment"},{"by":"casualjim_","id":4858307,"parent":4857714,"text":"Server engineer @ Wordnik<p>Fulltime (remote possible), SF Bay Area<p>Wordnik is looking for a senior level engineer to help develop our public and private API system. You will help build out our Application cluster, which requires nuts-and-bolts knowledge of high-performance application stacks.<p>Required Experience\nHigh-performance programming experience using Java, Scala preferred.<p>Expert in OO design and \"practical abstraction\"<p>Deep knowledge of multi-threading programming, understanding of Java Concurrency framework, Scala Akka framework<p>Asynchronous programming with Akka, Comet or Websockets<p>Experience with GIT, ANT, Ivy, Maven, sbt<p>Exposure to ORM techniques, document storage engines  \nJAXB/Jackson annotation mapping<p>Working experience with Linux and Mac OSX<p>You'll Do Even Better With:<p>Scalatra experience<p>Configuration/tuning Jetty, Netty<p>MongoDB/other non-relational database production experience<p>Development experience with a high-traffic, consumer Internet application/platform<p>Interested? send a note to ivan@wordnik.com explaining why you're the person we're looking for.","time":1354383136,"type":"comment"},{"by":"lylo","id":4858919,"parent":4857714,"text":"<p><pre><code>    Edinburgh, UK. Ruby developers, Data Scientist\n    LOCAL / REMOTE\n    ----------------------------------------------\n</code></pre>\nFreeAgent, one of the most popular SaaS cloud accounting web apps on the planet, is looking for Rubyists to come and work on our flagship app and related products, as well as a Data Scientist to play with a huge amount of interesting data.<p><a href=\"http://www.freeagent.com/company/jobs\" rel=\"nofollow\">http://www.freeagent.com/company/jobs</a><p>Both roles are based in Edinburgh, but there is the option for Rubyists to work remotely if you're a self-starter who has successfully developed and scaled large web apps like FreeAgent.<p>Edinburgh is one of the most amazing cities in the world, we offer a fantastic career package and you'll get to work with some of the smartest engineers around.<p>Drop us a line at jobs@freeagent.com - would love to hear from you!","time":1354394837,"type":"comment"},{"by":"nmatsakis","id":4858254,"parent":4857714,"text":"A9\nFulltime in Palo Alto, CA\n<a href=\"http://a9.com/-/company/jobs.jsp\" rel=\"nofollow\">http://a9.com/-/company/jobs.jsp</a><p>We're a subsidiary of Amazon that develops and operates the services that power Amazon Product Search, Visual Search, and Advertising Technology. Most of our open positions are for experienced systems programmers and administrators, but there are are also many positions for UI engineers, data analysts, technical program managers, engineering managers and others.  Some positions below, (see the link above for more):<p>Software Engineer, Search Relevance\nFront End Engineer, Search Analytics\nSenior Software Engineer, Visual Search\nSenior Engineering Manager, Optimization &#38; Analytics, Ad Technology\nUser Interface Designer\nMobile Business Development Manager, Ad Technology\nSenior Technical Data Analyst - Search Analytics","time":1354382106,"type":"comment"},{"by":"eksurfus","id":4858522,"parent":4857714,"text":"SameGoal | FRONT END ENGINEER - CLOSURE LIBRARY, full time in Milwaukee WI (remote via video conference ok)<p>Hey HN! We're a bootstrapped, profitable start-up looking for talented Front End Engineers to help pioneer a web-based, semi-structured document authoring platform.<p>SameGoal currently provides an online form completion and management system for K12 special education, already used to author over 1 million documents. Over the next twelve months, we will be expanding our market nationally. Additionally, we consider this product a proof of concept application for a more general enterprise solution.<p>Come join our team:  <a href=\"http://careers.stackoverflow.com/jobs/27751/front-end-engineer-google-closure-library-samegoal?a=wMPaOxq\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/27751/front-end-engine...</a>","time":1354386959,"type":"comment"},{"by":"harel","id":4858477,"parent":4857714,"text":"London, UK - Glow<p>Glow is on a rapid growth curve and are currently looking to assemble a super team of great developers to work in our West End office. We’ll do everything we can to make you feel at home.\nWe have fun challenges to offer, playing with big data, scalability, machine learning, analytics, user interface and we're always willing to learn new things.<p>We cook with Python, Javascript, a large dose of other cutting edge technologies and a healthy mix of social and advertising APIs.<p>If you think you can hack it, we'd love to hear from you. You can apply using the \"apply\" button below or email to careers@thisisglow.com<p>A bit more info: <a href=\"http://careers.stackoverflow.com/jobs/27261/python-javascript-developers-a-social-glow-digital-media\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/27261/python-javascrip...</a>","time":1354385998,"type":"comment"},{"by":"ajaykam","id":4858497,"parent":4857714,"text":"Mountain View, CA - Wedding Party www.weddingpartyapp.com<p>1. We’re building a company that’s bringing mobile technology to the massive ($100bln) wedding industry. (there are over 2.5M weddings and 300M guests a year in the US alone)<p>2. We’ve seen tremendous growth and are currently working on some technically interesting multi platform and scaling challenges. There are also big data challenges on the horizon.<p>3. We’re a small team of 5 and you will have a huge material impact on the growth of the company.<p>4. We’re on Rails 3.2, Objective C, Java. We use Coffeescript, Underscore, Haml, and Sass. We test with RSpec, Capybara and Selenium.<p>5. We work at an awesome office near downtown Mountain View and have a diverse and wicked smart team.<p>Learn more here: www.weddingpartyapp.com/jobs<p>If you’re interested, email us at jobs@weddingpartyapp.com","time":1354386476,"type":"comment"},{"by":"bensummers","id":4858077,"parent":4857714,"text":"London, UK - <a href=\"http://www.oneis.co.uk/\" rel=\"nofollow\">http://www.oneis.co.uk/</a><p>We're looking for the third member of our team: someone who can help us in just about every aspect of building and deploying a complex web application.<p>We've created an interesting Platform for quickly building \"information applications\". It excels in handling masses of semi-structured information, and our users find it delightful to use.<p>ONEIS is a bootstrapped company founded in 2006, is profitable, and has lots of exciting customers and opportunities. We need your help to make the most of this exciting time.<p><a href=\"http://www.oneis.co.uk/jobs\" rel=\"nofollow\">http://www.oneis.co.uk/jobs</a><p>My email address is in my profile if you've any questions, or would like an informal chat and demo.","time":1354379125,"type":"comment"},{"by":"mattdeboard","id":4858252,"parent":4857714,"text":"Courseload - Indianapolis, IN - Remote OK for right candidate, relocation offered<p>Courseload, Inc., is looking for smart, motivated and disciplined software developers who want to work someplace they can make an enormous difference in post-secondary education by bringing down costs and increasing accessibility.<p>Our tech stack is mostly Javascript &#38; Python, with some C# services being replaced gradually by Clojure (JVM variety). New hires will join our very small product development team and have the chance to make an immediate impact.<p>You can either visit <a href=\"http://courseload.com/jobs\" rel=\"nofollow\">http://courseload.com/jobs</a>, email careers@courseload.com or contact me at the email listed in my profile if you have any questions.","time":1354382081,"type":"comment"},{"by":"ryporter","id":4857738,"parent":4857714,"text":"Palo Alto, CA. Full time. H1B okay.<p>AMA Capital trades billions of dollars per day in the foreign exchange markets.<p>We are all engineers, and we all do a little bit of everything. We design and implement our own trading strategies and infrastructure, down to the networking code that ties us in to financial markets. We are a very small team (currently, I am the only employee) and are looking to add one or two engineers in the coming months who will focus on strategy or on infrastructure.<p>No experience or specific knowledge of finance is required. However, you do need to be interested in financial markets and to be able to carefully implement your strategies in C++.<p><a href=\"http://amacapital.net/careers.html\" rel=\"nofollow\">http://amacapital.net/careers.html</a>","time":1354373243,"type":"comment"},{"by":"jot","id":4857857,"parent":4857714,"text":"UK, London £40,000 - £60,000 CTO / Lead Developer<p>You’re a Python, Ruby or PHP web developer, and you’re bored of hearing about photo-sharing apps. You’ve always imagined putting your skills to use and making a real difference to the world.<p>Marblar needs your skills, and we want to put them to excellent use supporting over 10,000 scientists around the world already bringing about the next scientific revolution.<p>Here’s how Marblar is different to most other startups vying for your interest:<p>- We’ve launched (and even had a little TechCrunch coverage to boot)<p>- We’ve been revenue positive since day 1<p>- We’ve now got the backing of some investors who wants us to succeed not just for the money they’ll make, but because they love science as much as we do<p>- We already have a tonne of users using our product, and we’re learning from them every day<p>- We have several customers - from top Universities, to top tier law firms to learned scientific societies.<p>- We’ve got the hustle and we need your tech skills to match it.<p>Our team is made up of PhD students from a range of scientific disciplines, but don’t let that put you off. Our less academic advisors tell us their IQ levels jump a few notches after spending a day with us, but we know our limitations and we want you to join us as our web technology expert.<p>Your role will be to help us learn even more from our users and devise and implement solutions to their problems that can be iterated fast. We love making decisions on data, and we believe everything is an experiment.<p>Please e-mail hello@marblar.com with the subject “Look at my marbles”. No need for a CV if you don't have one, just give us some links to examples of your work and tell us why you'd like to work with us.<p>Salary: £40,000 - 60,000 based on experience + meaningful equity.<p>Benefits: Your choice of hardware and a generous training budget.<p>Find out more about what we do at <a href=\"http://marblar.com\" rel=\"nofollow\">http://marblar.com</a>","time":1354375733,"type":"comment"},{"by":"late2part","id":4862411,"parent":4857714,"text":"LOCAL OR REMOTE Candidates\nSunnyvale, CA USA or elsewhere (Europe, Asia remote workers okay)<p>WANTED:  AIRHEADS THAT LIKE TO PLAY IN THE CLOUD<p>We are a group of expert airheads looking to play in the cloud space with creative engineers like us.<p>Aruba Networks (www.arubanetworks.com) is known as the biggest small company, and we’re looking for great people to help us build great things to delight our customers.<p>We are looking for:<p>•\t<i>DevOps Engineers</i>: to help build the infrastructure as code systems that power the dynamic and reliable online systesms.  Our stack is AWS, Rackspace, Openstack, and others; with Ubuntu, Chef, and many other technologies including New Relic, Thousand Eyes, and (yes, this will be an occasionally on-call position) Pager Duty.<p>•\t<i>UI/Front-End Developers</i>:  to build visually stunning interfaces to allow intuitive and efficient use of our services and systems<p>•\t<i>Web Application Developers (back-end)</i>:  Build reliable scalable systems with technologies like postgres, redis, mongodb, cassandra, python, flask, celery, and others<p>•\t<i>QA Engineers</i>:  to help prevent problems so that everything runs smoothly with no bumps so we can continue to delight our customers<p>We’re located in Sunnyvale, easily accessible by Caltrain and VTA Lightrail and will help with relocation to the Bay Area.<p>We’re a charming group as seen in this video:  <a href=\"http://www.youtube.com/watch?v=8iXH_dv4BCs&#38;feature=youtu.be\" rel=\"nofollow\">http://www.youtube.com/watch?v=8iXH_dv4BCs&#38;feature=youtu...</a> .<p>Do you want to be a real airhead and help shape the future of wireless Ethernet?  If so, come join us.<p>Please mail hn-jobs@arubanetworks.com with:<p>•\tTell us the theoretical bandwidth of 802.11ac<p>•\tAn Intro Letter – tell us why we should hire you, how you get stuff done, and if you’re fun to be around or not<p>•\tA resume or CV<p>•\tA list of projects or accomplishments – links to github very much appreciated!","time":1354480858,"type":"comment"},{"by":"bartab4u","id":4861383,"parent":4857714,"text":"GoSpotCheck (<a href=\"http://www.gospotcheck.com\" rel=\"nofollow\">http://www.gospotcheck.com</a>) in Denver, CO<p>We help businesses better engage their teams to capture intelligence via their mobile phones. \nWe work with companies that have large, distributed field teams that are responsible for capturing \ninformation and producing reports from the field. We have a great set of investors and customers on board and have significant traction.<p>We're looking for a Lead Mobile Developer to join our growing team and take the lead role in building our mobile product.  Full job description can be found on our about page (<a href=\"http://www.gospotcheck.com/about\" rel=\"nofollow\">http://www.gospotcheck.com/about</a>)","time":1354461158,"type":"comment"},{"by":"jsanzz","id":4857805,"parent":4857714,"text":"HopStop\nNew York City | Full time | H1B okay.<p>HopStop provides public transit directions in hundreds of US, Canadian and European markets. Our iPhone, iPad, and Android apps are all ranked in the top 10. We have millions of users and are growing quickly - which is where you come in.<p>We're looking for passionate iOS and Android developers to help ramp-up our mobile development. In spite of our success to date, we're still a small development team and as a result we're very nimble and hands-on, so you'll have a lot of ownership and an opportunity to make a big impact as we continue to build-out the best public transit app experience. If interested, please send your resume to: jobs at hopstop dot com.","time":1354374597,"type":"comment"},{"by":"avibryant","id":4858619,"parent":4857714,"text":"Etsy - Remote - Hadoop<p>I'm looking to expand the team that makes Etsy's big data infrastructure awesome, reliable, and easy to use, supporting search, personalization, analytics, and many other product teams throughout Etsy. We work primarily in Scala and Ruby on top of Hadoop and Cascading. We have a strong culture of investing in developer tools and open sourcing them when they're ready: check out <a href=\"https://github.com/etsy\" rel=\"nofollow\">https://github.com/etsy</a> for examples of what we're contributing to. It doesn't matter where you live, though being in the same time zone as the continental US would be an asset. Ping me at avi@etsy.com if you're interested.","time":1354388708,"type":"comment"},{"by":"kaib","id":4858353,"parent":4857714,"text":"San Francisco, CA - Tinkercad<p>We are hiring fulltime Systems, Frontend and Application Software Engineers.<p>Tinkercad makes the leading cloud-based 3D CAD solution. Our secret sauce is building scientific supercomputer clusters and giving designers direct browser access to massive amounts of raw power. Day to day problems involve low latency distributed systems, computational geometry and a state of the art HTML5/WebGL client. Our problems are non-embarrassingly parallel and asymptotic complexity starts at O(n^3).<p>The team hails from places like Google/Crytek and we are backed by top VCs. You will deploy code on your first day. Free access to 3D printers.<p>Mail me at kai@tinkercad.com if you are interested.","time":1354384108,"type":"comment"},{"by":"Robingow","id":4858492,"parent":4857714,"text":"Addepar is Hiring - Engineers - Mountain View, Ca<p>Who we are: Phenomenal engineers rebuilding the infrastructure that powers global finance. Current technology in the space is super bad, extra broken, and so opaque, scandals like Bernie Madoff can go on for a decade while $64billion vanishes from the economy effecting, endowments, institutions, and notable individuals. We're a close knit team trying to solve this, and having a great time doing it. We play sports, go on trips, and eat our meals together.<p>What we aren't: A place to share your \"current POV,\" a game to build a virtual farm, or an app to check the ski report or weather.<p>Join us: Careers.addepar.com<p>Or email R2@addepar.com","time":1354386406,"type":"comment"},{"by":"ericbogs","id":4858083,"parent":4857714,"text":"Stereotypes (<a href=\"http://stereotypes.fm\" rel=\"nofollow\">http://stereotypes.fm</a>) in Austin &#38; New York is a new social music startup, with two technical cofounders (ex-Shazam/Google/Etsy/Yahoo).<p>We're looking to hire<p>* Full-stack Web Engineers (PHP, jQuery, MySQL)<p>* UX Designer (social, music, consumer experience)<p>to join us in Austin for 3 months as we prepare for launch at SXSW, with the possibility to continue on in NYC after.<p>Details: <a href=\"http://blog.stereotypes.fm/its-time-were-hiring/\" rel=\"nofollow\">http://blog.stereotypes.fm/its-time-were-hiring/</a>\nStereotypes: <a href=\"http://stereotypes.fm\" rel=\"nofollow\">http://stereotypes.fm</a>","time":1354379167,"type":"comment"},{"by":"connoryikes","id":4858289,"parent":4857714,"text":"Yikes Corp  ||  Tokyo, Japan /  San Francisco  /  Geoflexible  ||  CTO<p>Yikes is a social media content creation company. Businesses need daily text content for their Facebook pages, Twitter feeds, and blogs. We create that content at scale, hassle-free. Our customers are some of the largest ad agencies and brands in the world. We’re growing quickly and so far have managed to finance our own growth with our profits, but we’re looking to fundraise soon.<p>There are 2 people on the core team, and we coordinate a team of freelance writers who create all the content which we then sell to our customers. At the moment we’re doing this all by hand, and we need a generalist-type full-stack engineer to give our company some much-needed tech muscle.<p>The thing we need short-term is a web application which allows for content (text + links + images) to be input by our employees and passed through a workflow chain which ends at our customers. The thing we need long-term is a mechanism which allows our customers to be intelligently paired up with employees who would be a good fit for them- and also uses analytics from Facebook + Twitter + anything else to help us learn more about how to provide our customers with awesome, effective, engaging content. This is going to involve a lot of iteration and that’s why we need a new core member of our team instead of an outsourced partner or contractor etc. This is a green-field proposition: you can work with whatever tech tools you like. You’d be the guy or gal in charge and we will stay out of your hair about that kind of stuff.<p>We are two dudes from the US who’ve spent a lot of time in Japan – I live in SF now and my partner is in Tokyo. A lot of our clients are in Japan because that’s where we started, but we’re scaling up in the US now too. You can work from wherever you want, Tokyo included.<p>To make sure this works for everybody, we’d like to do a 3-month trial period starting in January wherein we’d pay you a monthly salary- and then, assuming everyone’s happy, you’d get a substantial grant of stock (co-founder level). This is pre-financing, so you’d be getting in on the ground floor.<p>TL;DR: We’re good at business and sales but we suck at tech, come and work with us, #hacktheplanet. Email jobs@yikes.jp with a resume or github link or both.","time":1354382743,"type":"comment"},{"by":"mknoke","id":4858650,"parent":4857714,"text":"Berlin, Germany<p>Looking for product managers (with/without experience) and Ruby on Rails developers. Our company is helping to monetize mobile&#38;online games, we get a couple million users per day (growing fast).<p>We offer a friendly environment with a passion to do things the right way, flexible work hours, requirement to work on-site but not all the time, very international team - only a minority of our employees is German.<p>Will help will relocation and work permit as necessary, this has become very easy.<p>More info here: <a href=\"http://www.sponsorpay.com/careers/\" rel=\"nofollow\">http://www.sponsorpay.com/careers/</a>","time":1354389348,"type":"comment"},{"by":"wangthony","id":4857819,"parent":4857714,"text":"Tobi // Brisbane, CA (near San Francisco) // Senior Software Engineers (FT, local)<p>What you should know about us:<p>o Learn/use Ruby on Rails / Postgres / Git<p>o We built our own platform to optimize everything: social, mobile, ecommerce, warehouse operations, etc.<p>o Engineers make key decisions - no managers, PMs, or “business people”<p>o Startup culture without the BS<p>o Proven, tangible business model (we sell clothes)<p>o Huge market in a fun space (fashion)<p>o Profitable and growing, but still small team &#38; early stage<p>o Self-funded - no VCs, no board politics<p>o Profit sharing bonus plan paid out 2x/year<p>==&#62; LEARN MORE: engjobs@tobi.com or <a href=\"http://eng.tobi.com\" rel=\"nofollow\">http://eng.tobi.com</a>","time":1354374763,"type":"comment"},{"by":"paulhuck","id":4858378,"parent":4857714,"text":"Rev\nFull Time Web Development in San Francisco, CA<p>Rev is a San Francisco based, venture backed startup founded in late 2010 with the goal of disrupting the freelance work space by creating a superior platform to manage and perform online work. To do this we build best-of-breed, customized tools for each service we provide so that our freelancers are at their most productive.<p>We are looking for creative engineers to help us build out our web and mobile platforms. Candidates must be willing and able to learn about the industries we work in, become experts on the problems facing our workers and customers, and build the tools they require utilizing the best technology mix for each task. Currently, our web-based platform primarily uses a Microsoft based stack (C#, ASP.NET MVC, and SQL Server). While an existing knowledge of these technologies is a plus, we realize that a great engineer can learn these on the job - more important is the ability to learn and adapt.<p>At Rev it isn't enough to be able to produce great code, we want you to be able to produce great ideas and shape the future of our product. Engineering is a crucial part of our DNA, and you will have a large role in building and shaping the company. We encourage our engineers to continuously explore new technologies and services, and promote development through monthly brown-bag events and hack-days.<p>For more info, or to apply visit: <a href=\"https://foxtranslate.recruiterbox.com/jobs/10883\" rel=\"nofollow\">https://foxtranslate.recruiterbox.com/jobs/10883</a>","time":1354384509,"type":"comment"},{"by":"jenrobinson","id":4910437,"parent":4857714,"text":"Big Frame | Lead Full Stack Engineer | Los Angeles, CA<p>Big Frame is looking for an experienced full stack engineer to lead the development of our client-facing product. The Lead Engineer will be a talented technologist who loves to create things and has demonstrated experience building professional-grade software from the ground up. You will be one of the first technical employees of the company with big responsibilities and the opportunity to make a direct and visible impact on scaling the business.<p>You will:<p>Play a pivotal role in defining our technology stack; drive the development schedule and lead the implementation of our core product; build an in-house technical team while directing outsourced designers and developers; attract and develop engineering talent as we grow; be part of an awesome team in sunny Los Angeles (LA location is a must).<p>About Us<p>Big Frame is a growing media company representing some of the most prominent producers on YouTube.  We provide marquee online talent with marketing and production resources to create original content and integrated marketing campaigns. We raised $3M+ earlier this year. <a href=\"http://www.crunchbase.com/company/big-frame\" rel=\"nofollow\">http://www.crunchbase.com/company/big-frame</a><p>To Apply<p>View the full description and requirements at <a href=\"http://bigfra.me/jobs\" rel=\"nofollow\">http://bigfra.me/jobs</a>. Send us a brief note including your resume, LinkedIn and/or Github profile at jobs@bigfra.me.","time":1355325763,"type":"comment"},{"by":"salsf","id":4858169,"parent":4857714,"text":"San Francisco, CA │ ePantry │ Founding Engineer<p>We launched in August and were seeded behind a vision of making it easier for busy people to be responsible in how they buy household products.  Highlights below:<p>*  Customer Problem: People want to buy (and not run out of) “the right” household products, but busy people don’t want to put time into finding sustainable toilet paper<p>*  What We Do: “Dollar Shave Club” for name-brand, “green” household consumables ($24+bn TAM), with an emphasis on flexibility and customer service<p>*  Customer Value Proposition: 5 min registration = A) never run out of TP, B) never overpay, C) always get products good for people &#38; the earth<p>*  Customer Archetype: ~35 y/o female, kids, busy; “green,” but SUV; Whole Foods, but 365 (private label); iPhone, but not techy; Gilt often, but Gucci rarely<p>*  Our Challenge: Create the most convenient platform in the world for a set of household products with unique purchasing patterns (not a shopping cart site…)<p>*  Competition: Selling a niche product better than Amazon has a surprising track record.  e.g. Alice, Dollar Shave Club, Manpacks, Quidsi, Zappos<p>*  Traction: Initial revenue in November through an offline product version.  Backlog for &#62;$150,000 run rate bookings through offline version in first 45 days of availability (by mid-Jan).<p>*  Full Time Team: Stu (Biz/PM): Advisor &#38; raised &#62;$2m @ 4 start-ups, &#62;$100m invested in tech, employee #2 twice; Jordan (Mktg): Goodby, Doritos, TD Ameritrade<p>*  Seeders : The entrepreneurs behind companies like Hotwire, CitySearch, Friendster, Cater2.me, Everfi, Vincraft, Augusta Columbia, and Toro IP<p>*  Stage: Funded. Prototype of product being tested compulsively now to acquire alpha users.  Lean startup methodology.<p>*  Founding Engineer: A fully empowered co-founder with strong opinions, understanding of lean &#38; MVP tradeoffs, full stack ownership, and a long term vision<p>*  What You Get: Competitive cash, generous equity, full benefits, flexible/fun environment, passionate team, leave the world better than you found it<p>I would love to grab a coffee/beer and brainstorm about the challenges/opportunities ahead.  sl@epantry.com","time":1354380452,"type":"comment"},{"deleted":true,"id":4858141,"parent":4857714,"time":1354380051,"type":"comment"},{"by":"jmeyerssf","id":4862048,"parent":4857714,"text":"Flurry - San Francisco - Senior Software Engineers for Advertising, Platform, and Front-end.<p>We have outstanding opportunities for experienced, enthusiastic Senior Software Engineers to build innovative products as we rapidly expand delivery of our big data services for the booming mobile app marketplace. You can assume a role as a key contributor of highly valued, high-profile functionality for our primary product offerings.<p>This is your chance to expand your expertise in leading-edge technologies and distributed infrastructures as you solve challenging problems as part of a dedicated team that takes great pride in our work. This is a terrific opportunity for a seasoned software engineer with expertise in large scale infrastructures that emphasize reliability, availability, consistency, security, and performance.<p>See the job descriptions and apply online here:<p><a href=\"http://jobvite.com/m?3IlJAfw6\" rel=\"nofollow\">http://jobvite.com/m?3IlJAfw6</a>\n<a href=\"http://jobvite.com/m?3vlJAfwT\" rel=\"nofollow\">http://jobvite.com/m?3vlJAfwT</a>\n<a href=\"http://jobvite.com/m?3MkJAfw9\" rel=\"nofollow\">http://jobvite.com/m?3MkJAfw9</a><p>Flurry has built the largest mobile network reaching more than 700 million unique monthly users on tablets and smartphones. Its app measurement and advertising platform is used by more than 80,000 media companies and independent developers that have published more than 250,000 applications on the Flurry network. The company is very well funded, has built a remarkable revenue stream, and is pre-IPO and cash flow positive.","time":1354474058,"type":"comment"},{"by":"playhard","id":4857891,"parent":4857714,"text":"WalletKit (Mountain View, CA and Chennai, India).\nWe are looking for python and javascript hackers in India to work for our growing global startup.<p>WalletKit is the easiest SaaS platform for businesses to create,manage and deliver to its customers digital Boarding passes,Tickets,Store cards and Coupons for mobile wallets like Apple passbook and Google Wallet<p>We are funded by 500startups and part of current accelerator batch.\nMore details at <a href=\"http://walletkit.com/jobs\" rel=\"nofollow\">http://walletkit.com/jobs</a>","time":1354376244,"type":"comment"},{"by":"jal","id":4861803,"parent":4857714,"text":"Senior Web Front-End Developer | Sunnyvale, CA (near Caltrain) | Full Time | H1B<p>Bracket Computing is a stealth-mode startup, focused on cloud computing technology. We've just raised a sizable Series A from three tier 1 venture capital firms.<p>We're looking for a senior web front-end developer... We already have awesome full-time user experience and graphic designers. The senior web front-end role is all about owning and driving the architecture and design of our web front-end.<p>We are looking for a senior software engineer who is both passionate about web app development and can guide the front-end contributions of a team of 6 full-stack developers. We lean towards a modern, single-page web app with a RESTful API-based back-end, using a JavaScript-driven web app stack, e.g. Bootstrap/Backbone/Underscore/JQuery. This role offers substantial ownership of the company's product &#38; vision.<p>Bracket's engineering team currently has less than 20 developers, mostly senior engineers from NetApp, IronPort, Data Domain, VMware, and Facebook. We're working on a very hard technology and problem space, and also like having fun at the same time. :-) As a well funded startup, we have great perks. We also have a dog friendly office and BBQ patio.<p>We are in stealth mode currently. Qualified candidates will meet with the founder/CTO for more details.<p>Please send resumes/CVs to jobs@brkt.com","time":1354469186,"type":"comment"},{"by":"maxprogram","id":4858429,"parent":4857714,"text":"Atlastory, Inc. | Salt Lake City, UT | Full time<p>About: Atlastory visualizes history on a map, allowing users to explore the world through space and time. It’s like Google Maps with the ability to look 10, 50, or 1,000 years in the past. This is an application that has the potential to change the way people around the world learn history and interact with the past. This is a seed-stage startup with funding.<p>Job: this is an employee #1 position for a generalist back-end developer. You will be involved in developing the back-end map rendering, data organization, and system buildout. We use Ruby, Python, Node.js. You should have experience with DevOps/AWS products, database design (SQL, Postgres, etc.), HTML5/JS/front-end a plus. Most of all this set of problems requires someone who can learn as they go &#38; figure things out that have never been done before. A few of the problems you'll be working on:<p>* PROBLEM: How to design a git-like system for collaboratively editing data that spans the history of the world.<p>* PROBLEM: How to organize a huge amount of GIS data so that it can be easily accessed, fed into an image renderer, backed-up, etc.<p>More details in the full posting here: <a href=\"https://docs.google.com/document/d/1bbbWWp7oPHcwbrqKlgJrp7i1PEySkye78p2bUCzxgNg/edit\" rel=\"nofollow\">https://docs.google.com/document/d/1bbbWWp7oPHcwbrqKlgJrp7i1...</a>","time":1354385240,"type":"comment"},{"by":"peawee","id":4858629,"parent":4857714,"text":"REMOTE WORK!<p>SpiderOak is hiring a JavaScript / HTML5 engineer for work anywhere in the world. We're working on pushing the boundaries with encryption in the browser, and we need someone to help push with us into the future. We're a stable, bootstrapped company and looking now to expand people's expectations of the cloud.<p>See more at <a href=\"https://spideroak.com/blog/20121114130321-now-hiring-javascript-html5-engineer\" rel=\"nofollow\">https://spideroak.com/blog/20121114130321-now-hiring-javascr...</a> .","time":1354388913,"type":"comment"},{"by":"SatvikBeri","id":4860931,"parent":4857714,"text":"Lattice Engines is looking for front-end and back-end developers in Boston, MA. (<a href=\"http://www.lattice-engines.com/\" rel=\"nofollow\">http://www.lattice-engines.com/</a>)<p>Lattice is revolutionizing sales and marketing through the power of Machine Learning. Our Big Data for Sales platform, salesPRISM, delivers real-time, predictive and actionable insight to sales and marketing professionals wherever they are so they can engage the most receptive customers in the most compelling ways. Fortune 5000 companies such as ADP, Dell, EMC and SunTrust rely on Lattice to generate 75 percent more pipeline, triple conversion rates, and double win rates.<p>Reporting to the Director of Engineering, you will join a team of engineers that designs and builds a world class, highly scalable, 'Big Data' Predictive Analytics SaaS platform. In this hand's on role you will design and implement innovative, elegant and incredibly easy to use solutions to challenging product requirements. The successful candidate will have broad product experience building rich web-based applications and UIs. The candidate will also have strong collaborative and communication skills and able to work in a fast paced agile/SCRUM environment.<p>To apply: <a href=\"http://jobvite.com/m?3ZmrCfw8\" rel=\"nofollow\">http://jobvite.com/m?3ZmrCfw8</a>","time":1354449033,"type":"comment"},{"by":"streeter","id":4859751,"parent":4857714,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons. Our top-100 app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some passionate people to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel Partners, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1354412662,"type":"comment"},{"by":"dannydalal","id":4858164,"parent":4857714,"text":"Evidence.com - Seattle and Santa Barbara<p>Hiring smart, passionate dev, test, and PM to join our small team.<p>Enjoy working close to the customer and close to the revenue? Looking for something lower risk than a \"regular\" startup but just as fun and agile ? Not so keen on being part of a large corporate machine ? Really enjoy making the world a better place ? Want your work to impact lots of lives ? Want serious and liquid equity upside ? Enjoy the entire end to end stack from hardware to video to saas to mobile to desktop ?<p>Well we have a killer opportunity :)<p>Evidence.com is a funded and profitable SaaS \"startup\" inside Taser.com providing secure digital evidence ingest, management, and sharing. Our product actually saves lives, reduces tax payer expenses, and increases public safety. Seriously. Everyone tends to behave when they are on video (check out the videos on our homepage evidence.com)<p>Our investors/advisors include early stage investor/advisor to FaceBook, DropBox, AirBnB, and other $1B startups.<p>We have a greenfield opportunity to serve and disrupt an under-served industry, and our customers love our product!<p>We are looking for any of: embedded, c, c++, c#, android, qt, and iOS experience. That said, we hire for smarts and cool/fun before we hire for skills.<p>Please send resumes or LinkedIn profile to me: Danny at taser.com<p>For fun, also include your favorite interview question :)","time":1354380338,"type":"comment"},{"by":"davidrudder","id":4857908,"parent":4857714,"text":"Louisville, CO - Sr. Software Developer\nApplicants must be local.<p>Requirements - Java, some php, MySQL, experience working in a startup or small-company environment.<p>Responsibilities - Help develop new website features, extend backend operations.<p>Door to Door Organics is an online grocer specializing in organic, local and natural foods.<p>Please send cover letter and resume to jobs@doortodoororganics.com.  Visit our website at <a href=\"http://colorado.doortodoororganics.com\" rel=\"nofollow\">http://colorado.doortodoororganics.com</a>","time":1354376555,"type":"comment"},{"deleted":true,"id":4858122,"parent":4857714,"time":1354379867,"type":"comment"},{"by":"RKlophaus","id":4858184,"parent":4857714,"text":"FiveStreet is a fast growing, funded startup in Washington, DC.<p>Looking for a well-rounded software engineer to work alongside our CTO. We need a resilient generalist who can solve problems. You should expect to wear many hats (both technical and non-technical) and have an interest in learning about the residential real estate industry.<p>We're heavily influenced by Hacker News &#38; Lean Startup.<p>Candidates in the Washington, DC metro area preferred.<p><a href=\"http://gist.io/4182514\" rel=\"nofollow\">http://gist.io/4182514</a>","time":1354380766,"type":"comment"},{"by":"tburch","id":4857784,"parent":4857714,"text":"Mobiplug - Boulder, CO<p>We're hiring for the following: - Mobile Engineers - Mobile UX Designer - Mobile UI Designer - Cloud Platform Engineers - Embedded Linux Gateway / Protocol Engineers<p>For more information see our jobs web site at <a href=\"http://jobs.mobiplug.co\" rel=\"nofollow\">http://jobs.mobiplug.co</a><p>About Mobiplug: Mobiplug is a Boulder, CO based startup that’s bridging the digital and physical worlds in a way that just works, to make life more awesome. Our team is building and designing an affordable all-in-one home monitoring and control solution that connects thousands of off-the-shelf electronics in your life with the smart phone in your pocket. We’re a TechStars Boulder 2012 graduate and were recently funded by Foundry Group. We thrive on great coffee, cool technology, inspired design, and our team's ability to tackle difficult problems with creative solutions.<p>Benefits: A great salary and a creative environment are not all that we have to offer. Every team member receives full healthcare benefits (for you and your entire family), free downtown Boulder parking, and cool home electronics to use in your own home. We’re located in Downtown Boulder just a half block from Pearl Street mall, offering great food and after-work fun within walking distance of the office.","time":1354373962,"type":"comment"},{"by":"bijanv","id":4858342,"parent":4857714,"text":"EventMobi - Toronto, Canada - Fulltime<p>EventMobi (<a href=\"http://www.eventmobi.com\" rel=\"nofollow\">http://www.eventmobi.com</a>) is the leading mobile web platform that allows event planners to create engaging apps for their event or conference in only a few minutes. Our mobile event guides, real-time interactivity features and the first ever social / gaming layer customized for conferences and tradeshows have been used by over 1000 events, 2 Million users, and are served for events in 8 languages across 5 continents.<p>We’re not your typical startup, we’re completely self-funded team of 16 and yet with no outside capital we’re massively profitable and on an incredible growth path with companies like Intel, Disney and the Olympics IOC using us for their mobile event app needs.<p>-----------------------------<p>We're to grow our engineering team as our platform expands and we're looking for start-up minded software engineers who want to build extremely fast and see their code in production and in use by millions of people right away! We use a lot of new tech (Node.js, MongoDB, Backbone.js, Redis) in production and we're trying to innovate what is possible one the mobile web.<p>We're also looking for more experienced engineers to help us build our core platform as we add on other features and services. This means helping architect our multi-tiered API, our data consistency solutions syncing data between multiple devices and global nodes, architecting our scaling solutions, etc.<p>To have a better look, check out our careers page!\n<a href=\"http://www.eventmobi.com/about/careers/\" rel=\"nofollow\">http://www.eventmobi.com/about/careers/</a>","time":1354383849,"type":"comment"},{"by":"capkutay","id":4858925,"parent":4857714,"text":"WebAction (<a href=\"http://www.webaction.com\" rel=\"nofollow\">http://www.webaction.com</a>) - Full time or intern in Palo Alto, CA (Downtown Palo Alto). Seeking UI developers and Platform Engineers.<p>WebAction is a start-up looking to fill the gap between Big Data and transaction data. We have just closed our Series A round and we are getting ready to launch our product. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today. We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>UI or front-end Developers should be well-versed in HTML, CSS, JavaScript, and jQuery. You should be interested in Data Visualization libraries such as D3 or processing. Strong programming fundamentals and experience with languages like Java/C/C++ is a huge plus. Experience developing native iOS apps would also be strongly desired, but not a requirement.<p>For the Platform Engineer position, you should have or at least be interested in learning: Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested, email us at jobs@webaction.com. In your message, mention \"Hacker News\" and feel free to let us know about your passions or any technologies that excite you. We look forward to hearing from you.","time":1354394971,"type":"comment"},{"by":"rohamg","id":4858888,"parent":4857714,"text":"DevDojo - Vancouver, BC and San Francisco, CA<p>Hiring full-time: designers, developers, engineers of various experience levels (from intermediate to C-suite). Must have: a curious mind and passion for shipping great product.<p>We help fast-growing startups build and scale engineering/product teams in beautiful Vancouver, Canada. We work with a variety of platforms and technologies and are looking for creative problem-solvers to join our fast-growing design and development teams. We play mainly with Ruby, Node, Backbone as well as resque, MongoDB, Redis, Heroku, HTML5, C++, Java, Mono/C#, Obj-C. We're increasingly looking for mobile engineers with a deep CS background, as well as folks with experience in Hadoop, machine learning, cross-cloud search and sync, enterprise-grade security and integrations. Candidates contact: hn@do.je<p>Our clients include the world's largest adventure ecommerce portal, a fast-growing mobile cloud infrastructure company, a venture-backed SoLoMo startup, and an enterprise-scale collaboration and workflow management company. If you're a fast-growing company that wants to build twice the engineering team at half the cost, shoot me an email too. We're actively exploring opening an East Coast presence. contact: r@do.je","time":1354394185,"type":"comment"},{"by":"glou","id":4858142,"parent":4857714,"text":"Quirky.com - Full Time - NYC and SF<p>Quirky is a social product development company where people from all around the world submit invention ideas to our website. With the help of our passionate community, we select the best ideas each week to develop together and try to bring them to market. If an idea actually makes it, then everyone who helped along the way gets a piece of the pie. You can find our products at retailers such as Target and Bed Bath &#38; Beyond.  Our mission is to make invention accessible.<p>Quirky is a rails shop, and we work with lots of fun technologies like AWS, mongo, iOS and heroku to name a few. We're a small team that works on lots of big, fun and interesting problems. We've got a brand new, fully custom office space in Chelsea (and currently working on a new one in SF). Oh and we also had a reality show on the Sundance Channel last year. VC backed by Andreessen Horowitz and Kleiner Perkins among others.<p>We're looking to hire rockstar rails, front end, back end and mobile developers.<p>More details here: <a href=\"http://www.quirky.com/about/careers\" rel=\"nofollow\">http://www.quirky.com/about/careers</a><p>If interested, shoot me an email greg at quirky dot com.<p>Relocation is definitely available for well qualified candidates (I moved from SF to NYC to work here!)","time":1354380091,"type":"comment"},{"by":"dochtman","id":4857960,"parent":4857714,"text":"Rotterdam, The Netherlands, <a href=\"https://kentyde.com/\" rel=\"nofollow\">https://kentyde.com/</a><p>KenTyde is a hedge fund startup with a 3-year track record. We're looking for a full-time developer to become the 5th member of our team (no remote). We mostly use Python to develop our own trading platform, on top of Linux, CouchDB, Redis and ZeroMQ. Mastery of the Dutch language would be a big plus; experience with the finance world is not a requirement.","time":1354377695,"type":"comment"},{"by":"dmor","id":4858453,"parent":4857714,"text":"Referly - San Francisco - F/T<p>Referly is looking for an entry-level web developer, either recently out of college or switching to the software development role full time for the first time.  You should have some front-end development experience with HTML/CSS (more skills are fine of course) and be prepared to learn the rest on the fly.<p>You will work primarily in PHP, HTML/CSS, and Javascript and our small team of 5 (all coding) will make sure you ramp quickly, ship public-facing features, and have a ton of fun doing it.  We have a track record of helping talented ambitious people get started as developers through our intern program and we love to coach, teach, and learn with you.<p>Our company makes it easy for individuals to express their expertise and make product recommendations, and when they generate online sales they get rewarded for it.  For businesses we provide simple tools for running a dead-simple Dropbox style referral program \"refer a friend and you each get $10\" through our API.  We graduated from YC this summer (2012).<p>We are happy to talk to more experienced engineers as well, but I'm putting this role out there front and center because I hope some inexperienced folks who might be daunted by the level of competition in the Bay Area will be excited that we are supportive of  their \"new-ness\" and send us a note.  You can apply by emailing jobs@refer.ly (goes to me, just helps to filter) with a bit more info about yourself.<p>You can see our full list of hiring needs here: <a href=\"http://refer.ly/jobs\" rel=\"nofollow\">http://refer.ly/jobs</a><p>Marketing Interns, iOS Developer, Web Developer, Senior Engineer (e.g. could manager entire engineering team)","time":1354385578,"type":"comment"},{"by":"Flemlord","id":4858734,"parent":4857714,"text":"FinFolio - Denver, CO<p>Hiring self-motivated full time WPF/C#/SQL and HTML/JavaScript developers. We are a small startup technology company that makes software for large professional wealth managers and financial institutions. We are self-funded but the founder (me) comes from the financial service startup world.<p><a href=\"http://www.finfolio.com/Pages/Careers.aspx\" rel=\"nofollow\">http://www.finfolio.com/Pages/Careers.aspx</a><p>Contact mattabar @ the above website if interested. Thx.","time":1354391162,"type":"comment"},{"by":"vietor","id":4868755,"parent":4857714,"text":"Cielo24, Santa Barbara, California. \nOffice in downtown Santa Barbara.<p>We build crowd/machine hybrid systems, currently focusing on media captioning solutions and seeing significant penetration and revenue in the online education vertical. You've never heard of us, but you've probably seen our work if you've looked at online education.<p>We're looking for:\nPython backend developer(s) (Django/RabbitMQ/Celery/Postgres stack), building both workflow management systems, including operational dashboards and analytics, and backend ASR and machine learning based text recommendation systems.<p>Web frontend developer(s) for basic HTML5/JQuery/Bootstrap type sites, and custom HTML5 based work tools (for example, a video caption editor).<p>INTERN: Dev internet with strong enthusiasm for python or web frontend development. Analytics intern who would like to help develop quality metrics, and analyze output quality from various workflows, ASR engines, and other partners.<p>We have a very small online presence currently, only a minimal retail site at www.oneclicktocaption.com, but are doing significant monthly revenue through direct b2b channels. Revenue is growing as fast as dev can build out scale and capabilities to support it.<p>Email: jobs@cielo24.com","time":1354580052,"type":"comment"},{"by":"slicedata","id":4862656,"parent":4857714,"text":"Slice Data builds machine learning applications for non-technical users to help their businesses more effectively capture and retain customers. We're very early-stage - pre-Series A and just started selling our product this summer - but we already have a good set of customers (Fortune 500s down to SMBs) and hit profitability early on. We're also very fortunate to be backed by some top-tier investors including Andreessen-Horowitz and Sutter Hill.<p>We've been able to do this while keeping the team small - we're comprised of folks from MIT, Berkeley, Google Research, Microsoft Research, IBM Research, and Yahoo Research - but we're always keeping an eye out for great people. On the technology side, we manage a sizable amount of valuable/confidential business and web crawled data. Given the traction, we're now looking for folks strong in engineering and statistics who want to get in early and grow with the company.<p>RESPONSIBILITIES<p>- Analyze and understand customers' data and pain points to develop new product features and new products<p>- Build predictive models using sophisticated algorithms to help customers prioritize and succeed<p>- Develop data mining algorithms to extract useful signals from the web and other data sources<p>QUALIFICATIONS<p>- BS/MS/PhD in Computer Science, Statistics, Math or related fields<p>- Ideally experience with analyzing data sets, formulating data problems, and building machine-learned models<p>- Familiarity with Python, Java, or R preferred<p>CONTACT<p>- <a href=\"https://www.slice-data.com\" rel=\"nofollow\">https://www.slice-data.com</a><p>- hiring@slice-data.com","time":1354484999,"type":"comment"},{"by":"domainfactory","id":4866029,"parent":4857714,"text":"Munich, Germany (full-time)\nWeb-Developer (domainfactory GmbH)<p>Hello Everyone,<p>we are looking for support of our development department at domainfactory GmbH.<p>domainFACTORY is one of the leading hosting providers in the German-speaking area, offering high quality hosting and cloud services as well as dedicated server solutions and domain registration services to its more than 150,000 customers.<p>Apart from our control panel with 60 categories (e.g. FTP accounts, SSH accounts, order system, reseller features etc.) our development team maintains and extends an internal administration menu, another control panel for our cloud servers, reseller systems, invoice generation and all system based software for domain registration.<p>You’re extremely proficient in PHP and no one can fool you when it comes to JavaScript, CSS3 and HTML5? You are as well fluent in German? Then apply to us for the job as (Frontend) Web Developer now!<p>For details, have a look at our Webite: <a href=\"http://www.df.eu/de/unternehmen/jobs/\" rel=\"nofollow\">http://www.df.eu/de/unternehmen/jobs/</a><p>Please send your application papers including your salary indication as well as your earliest starting date to Felix Stellmacher (Head of Development Department) by email to devjobs@df.eu.","time":1354551073,"type":"comment"},{"by":"ILIKEPONIES","id":4858415,"parent":4857714,"text":"Brooklyn, NY | bondsy | Ruby on Rails BACON-end Developer<p>----------------------------<p>bondsy.com is growing faster than our Founder’s beard, so we’re looking for a killer Ruby on Rails BACON-end Developer to join us.<p>If you f@cking love coding to a point that it almost hurts.  If you love developing to make people feel good, to make them smile.  If you love breaking down a problem to its core, only to build it back up again.  If you’re always looking for a different way to do things.<p>If you hate long meetings and bureaucracy. If you want to work at a place where lunch time is sacred (No joke, at bondsy we strongly encourage our team to take a break and have a great time over lunch. Sometimes over dinner as well, we won't lie. We work hard, but we have a good time.).<p>If you want all that, every single piece of that, we’d love to talk to you.<p>---------------------------<p>* An experienced Rails developer with mastery of all of our back-end stack elements, including Ruby, Rails, Git, Redis, PostgreSQL, and Heroku<p>* Interested in taking ownership of the server-side component of our product<p>* A good communicator who can collaborate closely with technical and semi-technical team members to design and implement RESTful APIs and architectures. Ideally you will have experience creating systems that scale for long-term growth.<p>---------------------------<p>bondsy is a graduate of Techstars NYC Spring 2012 class.  Our investors include Thrive Capital, Betaworks, Chris Dixon, Josh Stylman, Peter Hershberg, Patrick Keane, Jared Hecht and Steve Martocci.<p>---------------------------<p>Get at us jobs@bondsy.com!","time":1354385114,"type":"comment"},{"by":"cyan","id":4859870,"parent":4857714,"text":"<p><pre><code>  +*******************************************************+\n  |                      TenderTree                       |\n  | San Francisco - Front-End/Back-End/Mobile Engineers   |\n  +*******************************************************+\n</code></pre>\nTenderTree is on its way to becoming the next AirBnB. We allow families to find trusted caregivers near them at half the cost of a traditional agency. It's a HUGE $80B market that's massively screwed up.<p>We’re growing crazy fast - we’ve done over $100,000 in care in under 4 months in our private beta. And everyone’s taking notice; we’ve been featured by top media outlets such as NBC, Wired magazine, Forbes, TechCrunch, VentureBeat and others.<p>We are profitable and have been generating revenue from day one (how many startups can say that out here?) We recently closed a round of seed financing of $1.3M to ramp up our growth. We're backed by 500 Startups.<p>We're hiring web and mobile developers. Here are the requirements:<p><pre><code>  * Ability to code FAST and pick up new stuff quickly\n\n  * Raw intelligence - kinda self explanatory\n\n  * Hunger - this isn’t a 9 to 5 job; we’re disrupting a $100B industry\n\n  * Determination - you will walk through walls to make shit happen\n\n  * Hacker mentality - are you good at hacking or reverse engineering systems?\n</code></pre>\nNice to Have<p><pre><code>  * RoR, git, heroku background\n\n  * JS background\n</code></pre>\nNot Required<p><pre><code>  * Any specific number of years of experience - you could be straight out of college or have 10 years of experience. We're open to both.\n\n  * Any specific language or platform knowledge\n\n</code></pre>\nTo apply, send an email to andy@tendertree.com with a short description of why you're interested in TenderTree.","time":1354415939,"type":"comment"},{"by":"koblas","id":4857859,"parent":4857714,"text":"TubularLabs (Sunnyvale, CA) - Analytics Engineers and General Engineers.<p>Key technologies: Storm, Python, Tornado.<p>About Tubular: We're building tools to help YouTube channel develop their audiance.  What this means is that \nwe're helping channels, programs and network increase their view base.  We've recently closed a real series A \nround and have customers lined up to use our products.<p>Glad to provide more details via email - david@tubularlabs.com","time":1354375764,"type":"comment"},{"by":"danielepolencic","id":4898704,"parent":4857714,"text":"Which? (<a href=\"http://www.which.co.uk/\" rel=\"nofollow\">http://www.which.co.uk/</a>) - London, UK<p>At Which?, we believe that individuals can be as powerful as the organisations they have to deal with in their daily lives. We engage in advocacy campaigns on various consumer protection issues and aim to promote informed consumer choice in the purchase of goods and services, by testing products, highlighting inferior products or services, raising awareness of consumer rights and offering independent advice.<p>But for us, that's not enough. We want to look after consumers wherever and whenever they are to help them make the right decisions. So, we're currently revamping our digital presence by building a better infrastructure to support our products. As an example of what we've been up to, we recently launched <a href=\"http://university.which.co.uk\" rel=\"nofollow\">http://university.which.co.uk</a> which is a new mobile-friendly website designed to help students make more informed decisions about their higher education choices.<p>The biggest challenge we face is designing and building a very broad range of other products in a more service-oriented and cross-platform manner. This will mean that there is a lot of starting from scratch, and having to decide upon the right tool for the right job (we're currently into Nodejs, Ruby, Java and PHP).<p>So if you are a great team player and you are into designing service oriented application, playing with large volume of data aggregation or you just love to solve challenging problems, we'd like to hear what you think. We are hiring front-end and back-end developers.<p>We're a diverse, sociable team, and you'll have the opportunity to make a big impact on the company and its future success.<p>Feel free to email us at recruitment@which.co.uk for more information.","time":1355142251,"type":"comment"},{"by":"pragone","id":4858347,"parent":4857714,"text":"New York - Full time or intern Rails devs<p>Aidin's mission is to bring transparency to the healthcare system and empower patients with data to make more informed decisions on where they receive care.  We're backed by the best institutional investors in both consumer internet <a href=\"http://techcrunch.com/2012/06/15/aidin-seed-round/\" rel=\"nofollow\">http://techcrunch.com/2012/06/15/aidin-seed-round/</a>. Aidin was born out of Blueprint Health (3% acceptance rate), a Techstars affiliated healthcare IT accelerator.  We're surrounded by amazing talent as we currently reside in Dogpatch Labs (<a href=\"http://dogpatchlabs.com/\" rel=\"nofollow\">http://dogpatchlabs.com/</a>), a highly selective co-working space housing the best startups in New York.<p>As a software engineer on a small team, you'll touch on every aspect of the technology related to the company. It’s a broad job description and we’re looking for someone who loves being part of a fast-paced, constantly evolving work environment where your opinions and decisions will seriously affect our technical direction. We’re looking for a technology generalist with interest in specializing as necessary - It's more important that you love learning and can adopt new languages/frameworks/APIs very quickly.<p>There are few companies poised to actually make an impact on people's lives, but Aidin is one of them.  Join a team of people committed to leave a lasting impression on a part of healthcare that one day, we too will rely on. We couldn't be any more excited about what we're doing, and so is the tech community! <a href=\"http://techcrunch.com/2012/10/10/meet-the-three-most-fund-able-health-companies-from-the-dc-to-vc-showcase/\" rel=\"nofollow\">http://techcrunch.com/2012/10/10/meet-the-three-most-fund-ab...</a><p>For more info email  mike@myAidin.com, or feel free to contact me (info in profile)","time":1354383946,"type":"comment"},{"by":"jdavid","id":4858187,"parent":4857714,"text":"San Francisco, CA - Addvocate<p><a href=\"http://addvocate.com\" rel=\"nofollow\">http://addvocate.com</a><p>\"Employees should be your strongest Addvocates.  We build tools that make it easy for teams and groups to tell large collaborative social media stories.  Employee's matter. :)\"<p><pre><code>    - Python/ MongoDB\n    - iOS &#38; Android\n    - Javascript( HTML5, Firefox Addons, Chrome Ext.)\n</code></pre>\nWe are a friendly bunch, and we are looking for highly skilled and friendly people to work with.  Many of us left the Midwest 4 years ago to make a great product and company here in SF, after diverging into various roles and companies we have gotten the gang back together, so to speak. Our CEO had one successful exit, and is an ex. Salesforce Director. Other members have worked/ written core libraries for Twitter &#38; MySpace, and have worked for Kabam, inboxQ and Microsoft.  We are still building the core team.<p>If you are looking to get in on the ground floor of a fast passed Enterprise Social Media team, this is the team to join.  We have fun projects ranging from mobile, big data, analytic, machine learning and large Javascript Apps.  We are trying to ship weekly, while maintaining the quality needed for an enterprise app.  We want to bring the best of the consumer web to the Enterprise.<p>Tell us what you have worked on and what you would love to work on.  Many of us go to conferences and hackathons to prototype new ideas.  Some are related to our core business and sometimes they are just created for fun.<p>If you are a smart, ambitious developer, who likes to ship code, we would like to meet you.<p>Cheers,<p>Here's to many great hacking sessions to come.<p>Justin <a href=\"http://twitter.com/@jdavid\" rel=\"nofollow\">http://twitter.com/@jdavid</a>","time":1354380800,"type":"comment"},{"by":"cdolan92","id":4897515,"parent":4857714,"text":"Sequoia Waste Solutions (Pittsburgh, PA)\nFull Time. Remote OK. Local Preferred. H1B Sponsorship available<p>Sequoia Waste Solutions, a Pittsburgh area startup looking to disrupt the $60 billion waste industry, is looking for a kick-ass developer. We need someone who is willing to transform our vision of a tech-infused dumpster into a beautiful, defensible product.<p>A little about the company : we've been in operation for 1.5 years, have hundreds of clients in over 10 states, and are cash flow positive. Currently, we're a 10 man team, and we're about to close another round of funding. We use the best technology required for our jobs, and are open to remote team members.<p>You will be an integral part of a small development team, tasked with improving upon 1 year of database, CRM, iOS, and customer portal development. Essentially, we need to sure up what is currently a fully functional proof of concept, and prepare it for a nation-wide launch.<p>&#60;-- Requirements --&#62;<p>Leadership experience.<p>A keen eye for UX.<p>Capable of handling the behind the scenes frameworks, and also deliver gorgeous, retina-ready &#38; responsive applications.<p>Preferably, you have a cool project, website, or demo that you could send in.<p>Currently, we've done development in PHP, iOS, and VisualForce/Ajax (Salesforce/Force.com). We're looking to get away from Salesforce as the backend to our customer portal and develop our own, pulling data from our own database. License fees are getting out of hand!<p>&#60;-- To apply --&#62;<p>Email resumes and any relevant work to &#60;resumes@sequoiawaste.com&#62; , or through our website, at <a href=\"http://sequoiawaste.com/opportunities#view3\" rel=\"nofollow\">http://sequoiawaste.com/opportunities#view3</a>","time":1355113731,"type":"comment"},{"by":"bendilts","id":4857937,"parent":4857714,"text":"Lucidchart - Salt Lake City, UT<p>Lucidchart is a rapidly growing tech startup looking for great backend software engineers to join us at our headquarters in Utah. At Lucidchart, we build killer graphical web applications requiring highly available, secure and scalable backend services. Talent and ability to learn are more important than years of experience.<p>You may have seen Lucidchart demoed during the second Google I/O 2012 keynote: <a href=\"http://t.co/sd6GgZvy\" rel=\"nofollow\">http://t.co/sd6GgZvy</a>\nWe're hiring BACKEND SOFTWARE ENGINEERS. Lucidchart runs with various decoupled services in a Linux environment using Scala, PHP, MongoDB and MySQL. At Lucidchart, your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly reliable and scalable.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Scala or Java * PHP * MySQL or other relational database * NoSQL databases (MongoDB especially desirable) * Opscode Chef or Puppet * Cloud computing (AWS)<p>We're also hiring FRONTEND SOFTWARE ENGINEERS. We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Javascript * Google Closure compiler/library * CSS/HTML/DOM manipulation * jQuery * node.js * Native app development on Android and/or iOS * Facebook APIs<p>All applicants email resumes to jobs@lucidchart.com.","time":1354377165,"type":"comment"},{"by":"rokahnhn","id":4867787,"parent":4857714,"text":"Edyt (<a href=\"http://edyt.com\" rel=\"nofollow\">http://edyt.com</a>) is in Alameda CA, an island in the San Francisco Bay.\nOn-site full-time ideal; remote considered for senior devs with particularly relevant skills.<p>Edyt is a National Science Foundation startup providing browser-based, collaborative authoring/reviewing software for enterprises. We've received a five-year contract (with optional five-year extension) to extend TeamPatent, a patent-specific customization of Edyt, for the European Patent Organization. TeamPatent will be the centerpiece of this influential IT project worth over $100m.<p>Edyt is currently seeking front-end, back-end, and full-stack developers to contribute and grow with us. We perform complex processing on a JavaScript front-end client and increasingly use Node.js on the back-end so expertise or willingness to become expert in JavaScript is a huge plus. We also use Python and PostgreSQL on Linux infrastructure to support semantics, search, and collaborative document stores.<p>We offer a collaborative environment with ample opportunities to integrate and extend open source, work with others who live and breathe code, and travel internationally. You MUST be passionate about web software as you’ll need to quickly learn our technologies and become an individual contributor who mentors others. Expect to argue over the merits of various approaches at both technical and product levels.<p>We’re located in Alameda, a lovely island in the San Francisco Bay. Alameda is great for families, with tremendous walking neighborhoods (Our office has walk score of 98!), and a 20 minute bus ride to downtown San Francisco providing a unique combination of small town atmosphere with metropolitan opportunities.<p>Edyt holds the potential to be a career-making project with enormous intellectual scope and market potential. Please join us!","time":1354568575,"type":"comment"},{"by":"equark","id":4857988,"parent":4857714,"text":"Sense (<a href=\"http://www.senseplatform.com\" rel=\"nofollow\">http://www.senseplatform.com</a>, <a href=\"http://angel.co/sense\" rel=\"nofollow\">http://angel.co/sense</a>) - San Francisco<p>Sense is a next-generation platform for data analysis, statistical modeling, and business analytics.  We're building amazing technology and need help at all parts of the stack.<p>We're a tiny company of three.  You will be a core team member building amazing technology in a fast paced, drama free, intellectually stimulating, environment.  Competitive salary and equity.<p>= Lead Full Stack Web Developer =<p>* Experience building highly interactive, client-side, web applications (Backbone/AngularJS/Ember/etc).<p>* Deep knowledge of JavaScript / NodeJS.<p>* Experience building large systems on AWS.<p>* Highly productive and independent.<p>= Lead UI Designer =<p>* Fluent in Adobe Creative Suite.<p>* Pixel perfect design for print, mobile, and web UI.<p>* Ability to lead entire UI design and branding effort.<p>* Knowledge of JavaScript/HTML/CSS a plus but not required.<p>* Interest in data visualization a plus.<p>= Senior Technical Developer =<p>* Deep knowledge of numerical and statistical computing and familiarity with existing tools R/Matlab/SAS/SPSS/Stata.<p>* Experience building big data systems.<p>* Fluent in C++.<p>* Knowledge of JavaScript/V8/NodeJS a plus.<p>* Love of Bayesian statistics and MCMC samplers a plus.<p>* Experience with OpenCL and LLVM a plus.<p>* PhD a plus but not required.<p>Email: tristan@senseplatform.com","time":1354378098,"type":"comment"},{"by":"btfh","id":4857758,"parent":4857714,"text":"London, Full-time<p>Chaffinch is hiring a junior web developer.<p>Our current eco-system includes: Backbone, Coffeescript, Jade, Stylus, Handlebars, Node, Express, WebSockets, Git, Mocha, Google Maps API and Facebook API among other things.<p>If you're familiar with any of these, or looking to learn them, we'd love to hear from you.<p>Please apply via our API, details here: <a href=\"http://chaffin.ch/careers\" rel=\"nofollow\">http://chaffin.ch/careers</a>","time":1354373504,"type":"comment"},{"by":"blo","id":4858877,"parent":4857714,"text":"Stealth - San Francisco, CA (SOMA) - Full Time<p>About us: web / mobile - funded stealth, not a X-for-Y startup<p>Looking for: Engineers (Full-stack / Frontend or Backend) | Mobile (iOS) Developers | Search Engineers | Designers<p>---<p>We're a team of engineers and designers (MIT, Cornell, ex-Microsoft/Google/etc) working on technology that helps users access their favorite online services and accomplish tasks in a more usable, efficient, and social manner. Our goal is to make an essential utility that people use everyday.<p>We're funded by many notable investors (you've definitely heard of them - many are top 25 on AngelList). We haven't announced our product or funding anywhere so we can focus on building.<p>If you're looking to get into an earlier stage startup (more equity, ownership, ...) that solves complex problems, then come find out what we're up to.<p>We work mainly with JS (jquery and node.js). Mobile developers should be familiar with iOS/Android. We prefer designers have technical and UX backgrounds.<p>Curious? Send your portfolio (github, dribbble, resume, etc.) to [my username] at alum.mit.edu.","time":1354393985,"type":"comment"},{"by":"seldo","id":4858969,"parent":4857714,"text":"San Francisco, CA. Full time. H1B okay.<p>Sharing over social media is driving an ever-increasing percentage of web traffic, and becoming more central to the adoption and spread of every type of application. But app developers are flying blind -- not only are traditional web analytics very bad at tracking social traffic due to the rise of mobile clients and increasing prevalence of HTTPS, but even when they have the numbers, they don't have actionable data.<p>That's the problem awe.sm solves: our platform tracks sharing behavior and results, and ties them back into meaningful metrics -- whether thats page views, signups, or a dollar value in sales. Our APIs and drop-in integrations allow developers to integrate social data deeply into their products without needing to reinvent the wheel (and our wheel is really shiny).<p>We're an engineering-driven team building products primarily for other developers, so we're passionate about providing an amazing experience for developers. To help us get there, we're looking for a Developer Experience Lead, which you might also call a Platform Evangelist. By that we mean somebody who will own the experience a developer has using our product: somebody who understands deeply how to get the most out of awe.sm, and has the communication skills to get that information to developers. That will mean representing awe.sm at hackathons, conferences and other developer events, and being the primary point of contact for developers building on our platform on Stack Overflow and other forums. We want you to find the pain points before our customers do, and feed that information back to the engineering team, so we can adapt our product to real-world needs.<p>This is an unusual role, combining technical talents with public speaking and writing skills, but for the right person it's a dream job, and there's no role more critical to our growth right now.<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 14 people right now. We have a cool office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1354395716,"type":"comment"},{"by":"saumil07","id":4863651,"parent":4857714,"text":"LocBox, San Francisco. Frontend Engineer, Rails Developer, Data Scientist, Inside Sales Representative. Relocations Welcome, H1B Transfers Welcome.<p>More at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a> and <a href=\"http://www.techcrunch.com/2012/10/31/locbox-series-a/\" rel=\"nofollow\">http://www.techcrunch.com/2012/10/31/locbox-series-a/</a>.<p>I’m CEO at LocBox (<a href=\"http://www.getlocbox.com\" rel=\"nofollow\">http://www.getlocbox.com</a>) and we are looking to work with great folks that share our mission - empowering local businesses to generate sustainable revenue from their best customers. We want to do it with Data, Algorithms and Design in a space that has traditionally lacked all three but is finally turning the corner (and fast).<p>Most local businesses resort to unsustainable daily deals or boring Email Marketing to acquire and retain customers. We reject that status quo and our hundreds of (paying) customers agree. We’ve also developed a new search/crawl/tech-centric way of acquiring our own customers and disagree with the obsolete feet-on-street Sales model. The company is very small but generating material and predictable revenue; net revenue growth has exploded in the last quarter.<p>Our tech team is 3 at the moment and the company as a whole is 9 fulltime folks; we're looking to at least triple the tech team size in the next 6 months. The tech stack is standard-issue Rails/HTML/CSS/JavaScript and is deployed on AWS. The product and tech team operates on weekly sprints and there's a decent bit of Halo-playing and beer-drinking at the completion of sprint milestones.<p>We also just launched with a $5.1M Series A in the press w/ TechCrunch, AllThingsD, GigaOm and VentureBeat.<p>Ready to talk to us? I'm saumil at getlocbox dot com and at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a>.","time":1354503268,"type":"comment"},{"by":"xtracto","id":4865576,"parent":4857714,"text":"Guadalajara, Mexico (Ooyala: <a href=\"http://www.ooyala.com/\" rel=\"nofollow\">http://www.ooyala.com/</a> ). We are looking for at least 5 full time developers for Ooyala's GDL.<p>As a skill set we only look for great devs no mattering the programming languages they know. If you think you have what it takes to work in a Silicon Valley company (Ooyala is based in Mountain View, California) but want to live in Mexico then Ooyala is the perfect bet.<p>The openings are for 2 groups: Internal tooling and Analytics applications (<a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qIc9VfwI&#38;s=Reddit&#38;nl=1&#38;page=Job%20Description&#38;j=oUVKWfwf\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qIc9VfwI&...</a> ) and Professional Services  (<a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qIc9VfwI&#38;s=Reddit&#38;nl=1&#38;page=Job%20Description&#38;j=ojuVWfwo\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qIc9VfwI&...</a> ).","time":1354546110,"type":"comment"},{"by":"WeGreen","id":4865976,"kids":[4865979],"parent":4857714,"text":"Berlin, Germany. We are looking for a Junior Software Architect (full-time).<p>The job offer in english: \n(<a href=\"http://wegreen.de/uploads/media_items/job-offer_junior-software-architect.original.pdf\" rel=\"nofollow\">http://wegreen.de/uploads/media_items/job-offer_junior-softw...</a>)<p>Job offer in german:\n(<a href=\"http://wegreen.de/uploads/media_items/weihnachten-schneemann-1.original.jpg\" rel=\"nofollow\">http://wegreen.de/uploads/media_items/weihnachten-schneemann...</a>)<p>About the Company:<p>WeGreen is the first comprehensive search engine for sustainability and enables Internet users to consciously seek for sustainably produced commodities. The traffic light for sustainability shows in a neutral and reliable way, if the production of commodities is matching with the principles of ecology and fair trade and suggests the location where they can be purchased. However, since the whole green world is growing constantly and because we have a very ambitious agenda for the near future we need your support.","time":1354550599,"type":"comment"},{"by":"wahnfrieden","id":4858765,"parent":4857714,"text":"Canvas Networks // NYC // FULLTIME<p>Canvas Networks (USV Funded) is looking for an iOS tech lead to join a small, close team building the rich-media community platform of the future. We're working on some new innovations in mobile, and we want someone to help us build it. This is a lead iOS engineer position for you to grow into as we grow our iOS efforts.<p>To help us iterate and continue momentum, we practice continuous deployment to the extent possible, which presents some unique challenges with native Objective-C / Cocoa apps. On our backend servers, we ship twenty times a day – Apple makes things more complex but it's a spectrum we're interested in improving.<p>Free lunch, flexible hours, one of the biggest arcades in Manhattan (3 cabinets!), competitive salary and full benefits (health, dental, vision), take-what-you-want vacation.<p>Our office is in Union Square, Manhattan. If you don’t live in New York City, we’ll pay to fix that.<p>Shoot an email to jobs@canv.as with your resume, portfolio, and github if you have one.","time":1354391728,"type":"comment"},{"by":"arram","id":4858190,"parent":4857714,"text":"ZeroCater - San Francisco, CA - is hiring for most positions, including Lead Developer, VP of Sales, Account Managers.<p>Whether or not you're on the job market, you're invited to join us for lunch at our North Beach office. Just email me to mention you're dropping by. My email is a at zerocater.<p><a href=\"http://www.zerocater.com/jobs/\" rel=\"nofollow\">http://www.zerocater.com/jobs/</a>","time":1354380906,"type":"comment"},{"by":"bratsche","id":4857780,"parent":4857714,"text":"OrgSync (Dallas, full-time) -- Ruby/Rails developers<p>We're hiring Ruby/Rails developers at OrgSync. We're also open to smart non-Ruby people who are interested in getting into Ruby and Rails. Our latest hire is a Python guy who had never done Ruby before.<p><a href=\"http://www.orgsync.com/job_openings/ruby-developer\" rel=\"nofollow\">http://www.orgsync.com/job_openings/ruby-developer</a>","time":1354373878,"type":"comment"},{"by":"willwagner","id":4858166,"parent":4857714,"text":"SurveyMonkey - Palo Alto, CA: Sr. Web Application Developer<p>We're looking for a of solid software engineer that can help us build out our next generation survey platform. This position will require a lot of heavy-lifting using JavaScript to write  client-side applications using our own internal framework, jQuery, and Mustache.  A solid understanding of front-end technologies that can work at a large scale is required; some experience with python would be great but not a requirement.<p>SurveyMonkey is a great place to work.  We're big enough to offer competitive salaries and great benefits but small enough that you feel like your contribution and ideas can make the company successful.  We have a great team of engineers with big ambitious plans but we need a few more core engineers to get the job done.<p>You can apply directly at: <a href=\"http://www.surveymonkey.com/mp/job-listings/\" rel=\"nofollow\">http://www.surveymonkey.com/mp/job-listings/</a><p>or email me directly at:  will@surveymonkey.com","time":1354380367,"type":"comment"},{"by":"curtis","id":4858514,"parent":4857714,"text":"<p><pre><code>  +--------------------------------+\n  | Redwood City, CA - UI Engineer |\n  +--------------------------------+\n</code></pre>\nTidemark Systems (<a href=\"http://www.tidemark.net\" rel=\"nofollow\">http://www.tidemark.net</a>, note \".net\") is hiring.<p>Like everybody else in the industry, we're finding hiring to be a difficult problem.  For those of us on the UI team it's been an extra challenge -- there are lots of people out there who have experience with toolkits like jQuery, Ext, Sencha Touch, and a whole bunch of other ones, some of which we've never heard of.  But we're not simply using frameworks, we're pushing them well beyond what they were intended to do.  So if you've got relevant framework experience, that's great.  But we really need engineers that are good at the basics: JavaScript, DOM, HTML, and CSS.  You'll also need to be decent at UI design and user experience.  If you're not just good but great at either of these things (or both!), that's awesome, but we also need you to be able to write code.  This isn't just a run of the mill web dev job.  This is actual, hard core software engineering, it just happens that the stuff we're (the UI team) doing is all running in the browser.<p>Tidemark is building a hosted business analytics system, which is way more interesting than it might sound.  The company is well-funded and we have people with decades of experience in the field.<p>We've got a bunch of other openings (see <a href=\"http://tidemark.net/company/careers\" rel=\"nofollow\">http://tidemark.net/company/careers</a>)<p><pre><code>    * UI Engineers\n    * Director Corporate Communications\n    * Product Support Engineer\n    * Director of People Operations\n    * Operations Engineer\n    * Graphic Designer - Web Developer Emphasis\n    * Enterprise Account Executive\n    * Application Tier Developer\n    * Computation Engine Developer\n</code></pre>\nIf any of these positions sound interesting, my email is on my profile page.","time":1354386784,"type":"comment"},{"by":"maxaf","id":4859082,"parent":4857714,"text":"New York, NY (Midtown East) - full time. <a href=\"https://www.novus.com/careers.php\" rel=\"nofollow\">https://www.novus.com/careers.php</a><p>Novus is seeking generalist hackers to help us build the real-time financial analytics platform that helps institutional investors take better care of capital.<p>We're using Scala, Akka, MongoDB and a slew of other open source tech. Novus offers a productive and gratifying work environment that fosters learning &#38; collaboration, and promotes shipping often and doing the right thing as often as possible.<p>We give back to the community by means of our open source projects. Check out <a href=\"http://nvd3.org/\" rel=\"nofollow\">http://nvd3.org/</a> (beautiful SVG graphs) and <a href=\"http://novus.github.com/salat/\" rel=\"nofollow\">http://novus.github.com/salat/</a> (fast Scala-MongoDB serialization) for some of our internal libs that we've made available to everyone.<p>If you're interested in knowing more about us, shoot me an e-mail: max at novus dot com","time":1354397667,"type":"comment"},{"by":"snowmaker","id":4863049,"parent":4857714,"text":"Scribd - San Francisco, H1B, INTERN are welcome<p>Scribd (social publishing &#38; eBooks, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired THREE full-time people and several interns from these \"Who is Hiring\" threads, including one just last month ... it really works!!<p>We're looking for people who want to work with:\n* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript (we recently switched to Coffeescript and are loving it)<p>* iOS<p>* Android<p>* Machine Learning / data mining / recommendations<p>* Back-end problems: scalability, web crawling, big data, analytics<p>* DevOps and web infrastructure<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you. We've hired people from these threads with everywhere from 0 to 10 years of experience.<p>We're profitable, very well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>We're working on a giant new product launch now that we're really excited about. If you're interested in eBooks, I'd love to tell you about it.<p>Generally we're looking for full-time and INTERN hires (junior year or older) who want to move to SF. H1B and relocation are no problem.<p>See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1354490684,"type":"comment"},{"by":"vide0star","id":4876403,"parent":4857714,"text":"Smarkets, London, Software Engineer, Python &#38; Erlang<p>Smarkets is disrupting the global betting industry by offering a modern betting exchange with significantly lower transaction fees than the competition. We're a well-funded company with a small, agile development team. We've handled over £200 million of bets since launching in 2010.<p>Our office near Old Street in London is shared with other exciting startups and has a pool table, foosball table, and fully stocked fridge.<p>We're heavily driven by user-focused design and a focus on technology and engineering as a first class discipline.<p>We write our software in Python and Erlang, and rely heavily on asynchronous programming techniques and REST. We build on a modern, open-source software stack which includes Linux, Vagrant, Flask, Eventlet, PostgreSQL, RabbitMQ, ElasticSearch, Graphite, Chef, and Git.<p>For more info:\n<a href=\"https://smarkets.com/about/jobs/engineering\" rel=\"nofollow\">https://smarkets.com/about/jobs/engineering</a>","time":1354718489,"type":"comment"},{"by":"jslatts","id":4858865,"parent":4857714,"text":"Major League Soccer, New York City, NY<p>We are Major League Soccer Digital, headquartered in NYC. We are a small team of developers who build and maintain Major League Soccer’s web, mobile-web, and content services. Most of our existing platform is built on a Drupal/PHP/MySQL stack, though we are investing heavily in Node.js, Redis, and Couchbase for our new products. We are not language snobs. We are hackers and doers. We are dedicated full stack developers who believe in using the right tools to create amazing experiences for our fans.<p>We have \"official\" job descriptions below, but we are interested in anyone who has a passion for technology and sports and the technical chops to push our team forward, be that in Dev, Ops, or QA.<p><a href=\"http://www.mlssoccer.com/jobs#sr_dev\" rel=\"nofollow\">http://www.mlssoccer.com/jobs#sr_dev</a><p>and<p><a href=\"http://www.mlssoccer.com/jobs#web_dev\" rel=\"nofollow\">http://www.mlssoccer.com/jobs#web_dev</a><p>If you are interested, email us at mlsjobs@mlssoccer.com.","time":1354393879,"type":"comment"},{"by":"artag","id":4858218,"parent":4857714,"text":"YourMechanic | Mountain View<p>Hey Guys - YourMechanic is hiring for several positions. We are a team of 5.  We are making the process of fixing and maintaining cars super easy (mechanic comes to you, total transparency, 30% lower cost).<p>We are looking for:<p>* VP, Marketing (e-commerce or marketplace background, expertise in SEM, display, running large campaigns with budgets of several million dollars per year)<p>* Engineers (2 positions, full stack, ruby, coffeescript with backbone.js, posgresdb and redis, iOS and Android)<p>* Community Manager (must love interacting with people, comfortable with cold calling, super organized)<p>* Operations Manager<p>* Interns (marketing &#38; engineering)<p>We were in YC W2012 batch and the winner of TC disrupt. We are funded by an awesome group of investors (www.angel.co/yourmechanic). You will be joining a small team on the ground floor, a team that is disrupting a $150B market.<p>To start the conversation, please email art@yourmechanic.com. thanks!<p><a href=\"https://www.YourMechanic.com\" rel=\"nofollow\">https://www.YourMechanic.com</a>","time":1354381424,"type":"comment"},{"by":"phillytom","id":4858759,"parent":4857714,"text":"Monetate - Conshohocken, PA (Philly suburbs)  No remote, but we will help you with relocation.<p>Monetate helps internet marketers make their site more relevant.  We turn data in action on our clients' sites by doing real-time data analysis and DOM modification to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users' problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on<p>* Open source - Google Closure, Python, Hadoop, Mahout, Solr and Lucene - we're open source across our stack<p>About us:<p>* Founded in 2008<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>* Market rate salaries<p>* Funded by First Round and OpenView<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a><p>We've hired great people from HN in the past.<p>Please feel free to email me with any questions - tjanofsky at monetate com","time":1354391598,"type":"comment"},{"by":"eikenberry","id":4860077,"parent":4857714,"text":"Janrain in Portland, OR, US.\nOn site. We take interns and are actively hiring.<p><a href=\"http://janrain.com/about/careers/\" rel=\"nofollow\">http://janrain.com/about/careers/</a><p>Devops, Developers, QA and related.<p>The company is still young, just getting out of start up mode. Lots of different technologies and problems to work on. Multiple teams to move between to find your place.","time":1354422342,"type":"comment"},{"by":"henrik_w","id":4858484,"parent":4857714,"text":"Symsoft - Stockholm, Sweden<p>We are seeking a passionate and experienced software developer to help develop our real-time and transaction intensive telecom products.\n<a href=\"http://www.symsoft.com/about-symsoft/careers/1480051-1205-senior-software-developer\" rel=\"nofollow\">http://www.symsoft.com/about-symsoft/careers/1480051-1205-se...</a>","time":1354386155,"type":"comment"},{"by":"kreeger","id":4857955,"parent":4857714,"text":"Andrews McMeel Universal / Universal Uclick, Kansas City, MO, looking for a full-time software engineer.<p>We're an awesome, closely-knit tech department with a core web / design / scripting / app development group of 7 people, looking for an 8th. We work on websites like GoComics.com, Dilbert.com, Doonesbury.com, and ThePuzzleSociety.com. As you may have deduced, we're a comic and editorial syndicate with focuses on both B-to-B and B-to-C channels. We own syndication rights to Dilbert, Peanuts, Calvin &#38; Hobbes, Garfield, FoxTrot, and tons more.<p>You gotta know your POSIX/UNIX environment, you gotta love building and scaling websites, and you gotta love learning and incorporating new things. We use a lot of Ruby and Perl, along with some Java, Node, and Objective-C.<p>Hit us up at <a href=\"http://www.amuniversal.com/amu/AMU_Careers.htm\" rel=\"nofollow\">http://www.amuniversal.com/amu/AMU_Careers.htm</a>!","time":1354377610,"type":"comment"},{"by":"80j0TL2C","id":4857986,"parent":4857714,"text":"Aperto AG, Berlin, Germany<p>Aperto AG provides digital communication services. The company develops Websites and offers other multimedia services for customers; integrated brand communication strategies for customers in various sectors, such as the automotive industry, consumer electronics, media, service providers, associations, and foundations in Germany and internationally; and telephone language services and mobile applications as full-value, standalone dialogue media, value-added services, or as part of interactive campaigns. It also engages in the planning, development, and implementation of integrated measures, campaigns, and projects; provides strategies and brand management services; advises clients on online ...<p>We are in search of:<p>Senior Developer TYPO3/ Drupal<p>Senior Developer Java<p>Systems Engineer<p>IT-Consultant Java<p>IT Projektmanager<p>IT Manager<p>Technical Projectmanager Java<p>Technical Projectmanager Junior<p>Junior Developer Java<p>and many, many more. Send us an email!<p><a href=\"http://www.aperto.de/start.html\" rel=\"nofollow\">http://www.aperto.de/start.html</a>","time":1354378060,"type":"comment"},{"by":"qking","id":4860533,"parent":4857714,"text":"CERN, Geneva, Switzerland. C language software engineer.<p>Work on real-time embedded software for the magnet power supply control system for all of CERN's particle accelerators. For full details and to apply online please visit: <a href=\"https://ert.cern.ch/browse_www/wd_portal.show_job?p_web_site_id=1&#38;p_web_page_id=10656\" rel=\"nofollow\">https://ert.cern.ch/browse_www/wd_portal.show_job?p_web_site...</a><p>Employment conditions: <a href=\"https://hr-recruit.web.cern.ch/hr-recruit/general/Employment-conditions_2012_GB.pdf\" rel=\"nofollow\">https://hr-recruit.web.cern.ch/hr-recruit/general/Employment...</a><p>Starting salary: 95kSF - 109kSF per year<p>Deadline for applications: 6th January 2013<p>Applicants must have the nationality of a CERN member State: <a href=\"https://ert.cern.ch/browse_www/wd_portal.show_page?p_web_site_id=1&#38;p_text_id=10\" rel=\"nofollow\">https://ert.cern.ch/browse_www/wd_portal.show_page?p_web_sit...</a>","time":1354435976,"type":"comment"},{"by":"rattab","id":4871544,"parent":4857714,"text":"Montreal(MTL), Canada(CAN)<p>* Datacratic (<a href=\"http://datacratic.com\" rel=\"nofollow\">http://datacratic.com</a>, <a href=\"http://datacratic.com/site/careers\" rel=\"nofollow\">http://datacratic.com/site/careers</a>)<p>The team is made up of engineers, and scientists and we are creating a real-time data platform that allows developers to easily and efficiently create sophisticated, predictive, machine-learning applications.<p>Our systems deal with the aggregation of tens of thousands of network events per second, updating complex internal data structures, and scheduling and executing machine learning models. All of this on 16 or more CPU cores with hard real-time constraints.<p>* C++ Software Developer (<a href=\"http://datacratic.theresumator.com/apply/zIk4Dc/C-Software-Developer-Developpeur-Logiciel-C.html\" rel=\"nofollow\">http://datacratic.theresumator.com/apply/zIk4Dc/C-Software-D...</a>)<p>We're looking for someone to help write the real-time machine learning platform onto which all our products are built.<p>We are pushing the limits of what a machine can do in both memory size and processing capacity and we need someone who can help us push them further.<p>We love C++11 and we make extensive use of Boost, ZeroMQ and Linux system calls.<p>* Software Developer (<a href=\"http://datacratic.theresumator.com/apply/BM6u6M/Software-Developer-Dveloppeur-Logiciel.html\" rel=\"nofollow\">http://datacratic.theresumator.com/apply/BM6u6M/Software-Dev...</a>)<p>We are looking for generalist software developers to work on the productization of our applications: creating systems and processes for configuration and control, reporting and visualization, monitoring and deployment, as well as working with our clients to adapt our technology to their needs and develop new features as appropriate.<p>We value personal initiative, accountability and collaboration. We're committed to mentoring and we expect you to walk out the door a better developer than when you walked in.","time":1354637529,"type":"comment"},{"by":"AdamGibbins","id":4857934,"parent":4857714,"text":"Boston, MA.\nTIM Group (previously youDevise) are hiring a Senior Linux Sysadmin.<p>We're a 100 person market leading financial software firm with offices in Boston, New York, London and Hong Kong.  Rated one of the fastest growing tech companies in the UK by The Sunday Times (<a href=\"http://www.fasttrack.co.uk/fasttrack/leagues/dbtechDetails.asp?siteID=3&#38;compID=3219&#38;yr=2012\" rel=\"nofollow\">http://www.fasttrack.co.uk/fasttrack/leagues/dbtechDetails.a...</a>).<p>We're a continually iterating self managed team doing awesome things with Puppet, MCollective, Ruby, Graphite, Logstash, KVM, MySQL, MongoDB, JVMs and continuous deployments.<p>We'd love to talk to you, please get in contact with any questions.<p><a href=\"http://www.timgroup.com/careers/current-vacancies/system-administrator-linux\" rel=\"nofollow\">http://www.timgroup.com/careers/current-vacancies/system-adm...</a>","time":1354377120,"type":"comment"},{"by":"Singletoned","id":4860772,"kids":[4862453],"parent":4857714,"text":"Newman Online.  London, UK.<p>We are looking for a Python Developer.  We allow plenty of home working, but if you do come into the office, you get free tickets to the cinema we work above (and free barista made coffee).<p>There's a lengthy description at <a href=\"https://jobs.github.com/positions/9f7647ee-3c66-11e2-961a-fb3a8870608d\" rel=\"nofollow\">https://jobs.github.com/positions/9f7647ee-3c66-11e2-961a-fb...</a> but in short we want someone with a lot of Python, who isn't scared by legacy code, and who doesn't require managing.  We offer a lot of flexibility and freedom for the right candidates.<p>Development is run by developers, so we use sexy technologies when they are appropriate.  We let people choose what they want to work on, but sometimes we all have to chip in on the grotty stuff.<p>Do checkout the advert or email us at jobs@newmanonline.org.uk with any questions.","time":1354443821,"type":"comment"},{"by":"f00biebletch","id":4859241,"parent":4857714,"text":"Skype - Palo Alto<p>Skype is looking for a big data engineer to help instrument and analyze the gargantuan P2P network that is Skype.  Nosql, hadoop, map/reduce, node.js are the main drivers, although there will be integration with azure and esoteric legacy systems to keep it real.  We need a solid, open minded engineer who has worked with all kinds of distributed systems and is not afraid of big challenges.<p>You'll need to be able to anaylze, interpret, publish, and present complex problems and solutions to a wide variety of people.  You'll be involved in the ground floor of Big Data at Skype, so you'll need to be able to find paths to success in a sea of confusion and conflicting priorities.<p>You should really dig machine learning, data mining, stats, and math in general and understand the fuzziness of \"answers\" in the real world.<p>Contact f00biebletch at gmail for info.","time":1354400687,"type":"comment"},{"by":"rvivek","id":4859043,"parent":4857714,"text":"Product hackers at HackerRank.com (Mountain View,CA). Full time.<p>Our goal is to build an engaging platform for hackers to solve interesting real world challenges in all domains of Computer Science<p>We have a dedicated, core group of users since we launched in beta. We're hiring a Product Hacker to focus on two important metrics - Engagement (time spent and interaction) and Retention (churn factor). We listen to our users a lot and been doing a bunch of experiments on our site - bot-vs-bot games, real-world challenges from companies, etc. which has made thousands of users happy. Imagine if you grew this number by 100x or 1000x? Software is eating the world and if all the world's problem solvers come together at a single place, it will be the most valuable place EVER built. We are looking for a Product hacker to help us push features (or kill features) to reach the goal. The Product Hacker is the bridge between the user and the product and works with everyone in the team (designers, founders, engineers)<p>Job Responsibilities<p>-- Analyzing engagement and retention metrics, feedback from users and base product decisions on them<p>-- Detailed product specifications that'll help designers and hackers to execute them and make it live<p>-- Coding some components of the product<p>What are we looking for?<p>--You have coded extensively in the past and continue to build stuff for fun<p>-- You understand the way hackers think and what they enjoy, and you are able to translate ideas into how it should reflect on the website<p>-- Explicit mention of some of the earlier products you've worked on - what changes you made and how they affected the business value<p>-- Experience working in user growth teams in the past<p>-- You are very numbers obsessed and the first thing you wake up to is an analytics dashboard<p>How to apply?<p>-- Send an e-mail to hackers [at] hackerrank.com with your profile","time":1354396964,"type":"comment"},{"by":"mlinne","id":4864790,"parent":4857714,"text":"Berlin, Germany - Fulltime - stylemarks<p>We’re a small, international and ambitious team of developers, product and business guys rethinking the way how people buy and sell things. We're building a product in a multi-billion euro market, and have a clear path to revenue.<p>Currently we are looking for an iOS specialist who is above all, a quick learner and seek out the latest in tooling, iOS open source or clang features.<p>We are also part of the newly launched Hubraum Accelerator, based in Berlins famous betahaus and are closing our seed round in two weeks. Our team includes a successful serial entrepreneur, a senior backend developer (10y+) as well as an iOS Developer (4yrs+).<p>Full job description can be found at <a href=\"http://stylemarks.de/jobs\" rel=\"nofollow\">http://stylemarks.de/jobs</a><p>If this sounds interesting email me at marc@stylemarks.de<p>Applications outside of Europe are encouraged.","time":1354530186,"type":"comment"},{"by":"kitcar","id":4857827,"kids":[4874201],"parent":4857714,"text":"Canada (Toronto) - Looking for co-founder / CTO to lead development on a advertising optimization product. Strong computer science + statistical analysis skills are a must, ideally with previous experience building out low-latency transactional-type systems. Previous experience in ad-tech is not necessary, although would be beneficial.<p>You will be joining a team which has already built+sold a company in the online ad space, and has been working in the industry for 10+ years (and accordingly is very well positioned to succeed with this new venture). We are bringing an unusually advanced approach to online media buying, previously only seen in the financial markets.<p>Sound interesting? Email me a paragraph breakdown of why you're interested &#38; why you think you're a good candidate to the email listed on my profile.","time":1354375006,"type":"comment"},{"deleted":true,"id":4858520,"parent":4857714,"time":1354386885,"type":"comment"},{"by":"davidrangel","id":4859189,"parent":4857714,"text":"Palo Alto, CA | Full time | Core Mobile Engineer<p>Corona Labs - <a href=\"http://coronalabs.com/\" rel=\"nofollow\">http://coronalabs.com/</a><p>We are looking for a Core Engineer to help build out Corona SDK, the leading mobile development platform. Corona is used by hundreds of thousands of developers worldwide to build apps for iOS, Android, Kindle and NOOK. We are a small team that moves quickly and ships new code on a daily basis.<p>The Core Engineer will help build out the platform, add new features and support new underlying mobile platforms. Our overarching goal is to provide the best platform for developers to efficiently build high-quality cross-platform mobile apps.<p>More info on the position here:\n<a href=\"http://www.coronalabs.com/about/jobs/core-engineer/\" rel=\"nofollow\">http://www.coronalabs.com/about/jobs/core-engineer/</a>","time":1354399953,"type":"comment"},{"deleted":true,"id":4858012,"parent":4857714,"time":1354378405,"type":"comment"},{"by":"jaymod","id":4867337,"parent":4857714,"text":"Epoxy (<a href=\"http://epoxy.tv\" rel=\"nofollow\">http://epoxy.tv</a>) in Venice, CA (Los Angeles; full time ideal, intern, remote and h1b considered)<p>Senior Full-Stack Engineer, Senior Front-End Engineer and more<p><a href=\"http://epoxy.tv/jobs\" rel=\"nofollow\">http://epoxy.tv/jobs</a><p>Epoxy builds exceptional software for online video creators and viewers. Our tools help YouTubers and networks optimize their businesses and deepen the relationship with their audience. Our channel experiences provide viewers with new ways to connect with and experience the content they love.<p>Epoxy was founded by designers, engineers and entrepreneurs who are passionate about product and solving problems. Our backgrounds include Stanford, Brown, IDEO, Adobe, Mixpanel, Google/YouTube and Team Downey.<p>There are a number of senior engineering positions we'd like to hire for specifically, but we're absolutely interested in hiring smart people who don't exactly fit any of those particular positions. In general, we look for:<p>* BS or MS in Computer Science, a related degree from a top-tier program or the equivalent experience and mastery in industry<p>* Substantial real-world engineering experience with products shipped<p>* Strong, well articulated opinions on product design and engineering issues along with genuine flexibility and enthusiasm for approaches other than your own<p>* Preference for fast-moving markets, products, teams and the sometimes-ambiguous and fickle nature of early-stage startups<p>* High personal value on culture and culture fit in a job<p>* Deep sense of personal product ownership and long-term interest in developing technical and soft skills<p>We're building on a thoroughly modern stack including Ruby on Rails, node.js, Backbone.js, MongoDB, and friends.<p>Sound like something for you? Check out more complete descriptions at <a href=\"http://epoxy.tv/jobs\" rel=\"nofollow\">http://epoxy.tv/jobs</a> or drop us a line at jobs@epoxy.tv. Thanks!","time":1354563242,"type":"comment"},{"by":"gregcmartin","id":4859308,"parent":4857714,"text":"THREAT STREAM is hiring in NYC  <a href=\"http://www.threatstream.com/contact/\" rel=\"nofollow\">http://www.threatstream.com/contact/</a><p>We are looking for developers front and back end with chops in:<p>Python,Django,Flask,ExtJS,MySQL,MongoDB, Bootstrap UI<p>We are information security company providing actionable threat intelligence to large enterprise and government to put an end to malware and targeted threats.<p>We are also hiring security analysts if you like researching malware, have a reversing background or attribution the actors behind the threats (osint/linkanalysis/etc)<p>Contact us if you want to work with some of the smartest talent in the world, and friendly, laid back personalities.  We are also located in Meat Packing, NYC next to the Google campus and Chelsea Market (Foodie heaven).  Oh and we encourage you to bring your dog to work =)","time":1354402362,"type":"comment"},{"by":"wadenick","id":4885523,"parent":4857714,"text":"SF / Bay Area — 24 full-time roles at Atlassian, makers of JIRA and Confluence, Stash and Bitbucket, and more.<p>We're hiring a lot of great people. Our software for software developers is used by over 23,000 organizations. If you can dream it; JIRA and Confluence, Bamboo and Bitbucket help you plan it, build it, and launch it. Yes, there's 24 open roles in SF: <a href=\"http://atlassian.com/company/careers/?tab=sf\" rel=\"nofollow\">http://atlassian.com/company/careers/?tab=sf</a> ...such as<p>Product Marketing — JIRA;\nProduct Marketing — Developer Tools;\nProduct Manager — Marketplace;\nDev Team Lead — Bitbucket;\nDeveloper Advocate;\nWeb Developer;\nTechnical Writer;\nand about 17 more.<p>Dogs are welcome. Beer is free. And there's 450 other passionate hackers and doers in a fast-growing company. Wanna join?","time":1354855810,"type":"comment"},{"by":"witten","id":4858663,"parent":4857714,"text":"EnergySavvy - Seattle, WA<p>EnergySavvy is looking to add to an amazing development team working with cutting-edge, modern technologies. Do you love working on challenging software implementation problems? Do you spend your free-time learning new programming languages and contributing to open-source projects? If so, you'll thrive in EnergySavvy's quick-paced, collaborative atmosphere.<p>We're a small but rapidly growing software company with the mission of transforming how energy efficiency is delivered by combining user experience and software technology to deliver software-as-a-service solutions our customers and users love. Our software helps people make their houses more energy efficient, addressing a major source of energy waste in this country that impacts our energy independence and contribution to global climate change.<p>As a software engineer at EnergySavvy, you'll work with Django, Python, jQuery, nginx and  PostgreSQL, and deploy your creations early and often to live customers.<p>Requirements:<p>* You're passionate about learning web technologies, and have experience with modern engineering techniques (Mercurial/Git, staging, continuous integration, etc)<p>* You have a Computer Science degree or equivalent with a strong foundation in data structures and algorithms<p>* You have programming experience in one or more of C/C++, Python, Ruby, Javascript, C#/Java<p>About EnergySavvy<p>EnergySavvy is a Seattle-based software company focused on energy efficiency. EnergySavvy's flagship product, Optix, is an energy efficiency management system that helps utilities achieve their cost-effective savings goals. Optix drives program success by engaging customers, streamlining stakeholder interactions and providing real-time analytics.<p>We have a great team, wonderful customers, supportive investors, and we are growing quickly in a massive and important space. We are an investor-funded company with real customers, real revenues and a reality-based plan to scale. Learn more about EnergySavvy's company and culture.","time":1354389584,"type":"comment"},{"by":"Katelyn","id":4882052,"parent":4857714,"text":"Care.com (<a href=\"http://www.care.com\" rel=\"nofollow\">http://www.care.com</a>) in Boston, MA.<p>We're looking for mobile UI designer to help grow our mobile application team from the ground up, and play a big role in designing and defining mobile web and mobile app experiences for our Karoo and care.com apps.<p>Ideal candidates will have strong portfolios of work that demonstrate beautiful and thoughtful product design and a passion for designing simple and intuitive mobile web and mobile application interfaces.<p>You'll also be working on an awesome team in a fast-paced, iterative and entrepreneurial environment.  Email or tweet me if interested, my name is Katelyn: friedsonkatelyn@gmail.com, <a href=\"http://twitter.com/kfriedson\" rel=\"nofollow\">http://twitter.com/kfriedson</a>","time":1354807345,"type":"comment"},{"by":"aawecler","id":4861849,"parent":4857714,"text":"New York, NY Software Engineer, Engineering Manager ,Test Engineer\nYodle's mission is to help small businesses across the US and Canada grow their business.  Yodle's engineering team builds the technology that allows us to deliver on our mission.\nYodle's team of 40+ engineers powers a company serving 35000+ customers and will do $130Million in revenue this year.  \nFind out more about yodle, our engineering team and the roles available on our careers site and try out some of our puzzles if you feel like a fun challenge : <a href=\"http://www.yodlecareers.com/departments/technology/\" rel=\"nofollow\">http://www.yodlecareers.com/departments/technology/</a>\napply through our careers site or you can email me : awecler at yodle too.","time":1354470122,"type":"comment"},{"by":"bliscio","id":4857920,"parent":4857714,"text":"NYC - DaisyBill.com - Full time Senior Ruby Developer.<p>Our development process is collaborative and emphasizes sustainable coding practices like domain-driven design, test-driven development, pair programming, continuous integration, and smart design decisions. We have state-of-the-art continuous integration and continuous deployment infrastructure.<p>Currently we are working out of Pivotal Labs NYC, but very soon we will be moving into our own loft in Union Square.<p>You may be a good fit if you:<p>- Have 3+ years experience with Ruby on Rails\n- Experience with test-driven development (\"TDD\")\n- Interest in (or experience with) pair-programming\n- Have strong grounding in OOP and SOA principles\n- Git/Github experience<p><a href=\"http://www.daisybill.com/careers/1\" rel=\"nofollow\">http://www.daisybill.com/careers/1</a>","time":1354376683,"type":"comment"},{"by":"rootedbox","id":4858356,"kids":[4858724],"parent":4857714,"text":"CHICAGO - COYOTE - We went from 0 to a billion in revenue in 6 years.. So we're pretty much hiring in every type of position you can think of to keep up with growth. Come join us.\n<a href=\"http://www.coyote.com/careers/\" rel=\"nofollow\">http://www.coyote.com/careers/</a>","time":1354384177,"type":"comment"},{"by":"akh","id":4859463,"parent":4857714,"text":"RightScale (<a href=\"http://www.RightScale.com\" rel=\"nofollow\">http://www.RightScale.com</a>) in Edinburgh, Scotland<p>RightScale is the leading cloud management platform; it's used by the likes of Zynga and Associated Press to manage and automate infrastructure across public and private clouds (AWS, MS Azure, Google Compute Engine, Eucalyptus, OpenStack, CloudStack etc). RightScale recently opened an office in Edinburgh by acquiring PlanForCloud.com and is expanding the team. We're based in the TechCube (<a href=\"http://www.techcu.be\" rel=\"nofollow\">http://www.techcu.be</a>) and are looking for:<p>- Security Engineer<p>- Software Test Engineer<p>- UI Designer<p>- Senior Software Engineer<p>More info here: <a href=\"http://www.planforcloud.com/pages/recruitment.html\" rel=\"nofollow\">http://www.planforcloud.com/pages/recruitment.html</a>","time":1354405594,"type":"comment"},{"by":"cyberco","id":4887253,"parent":4857714,"text":"INTERN: Software engineer at Paylogic (Groningen, The Netherlands)<p><i></i>Job Description<i></i>:<p>As a Software engineer you will be working on many technical challenges of a fast growing, highly available online ticketing system in a international (English speaking) team of over 15 friendly Python experts. Paylogic has a professional software development environment to ensure maximum quality and a minimum of distraction. Paylogic strives to give software engineers as much freedom and responsibility as possible. Salary is in line with market and experience.\nPython is Paylogic's tool of choice and it is used for everything from the ORM database layer (SQLAlchemy) to DevOp scripts to managing large clusters in the cloud (AWS), and for web apps (Django, Flask) to continuous integration tools (Jenkins).<p><i></i>Requirements<i></i><p>You are an experienced, passionate and professional software developer with a hacker mind-set and a love for open source and Python. You are pragmatic and positive and expect the same from your environment. You have the social and technical skills to inspire others. You have studied computer science or something similar. A working permit for The Netherlands is not required but would be handy. It would be great if you have experience with highly available and highly scalable web applications, database techniques or cloud computing.<p><i></i>About Paylogic<i></i><p>Paylogic is a successful, international ticketing company from The Netherlands. Her service has to meet the highest standards regarding scalability, availability and security. The technological standard within the company is high. As is the humor standard. The development department is situated in an office at the center Groningen, one of the liveliest towns in The Netherlands. World class science, bars and culture right next door. Every year in May Paylogic organizes pygrunn (.nl), a renowned high-tech developer conference about/for Python and its friends.<p><i></i>Contact<i></i>: \nHarmen Zijlstra - jobs@paylogic.nl\n<a href=\"http://corporate.paylogic.nl/en/jobs/\" rel=\"nofollow\">http://corporate.paylogic.nl/en/jobs/</a>","time":1354893744,"type":"comment"},{"by":"advinture","id":4858625,"parent":4857714,"text":"Arc90 - New York, NY - Local or remote<p>Java/JVM Developer: <a href=\"http://arc90.com/jobs/java-developer/\" rel=\"nofollow\">http://arc90.com/jobs/java-developer/</a><p>Python Web Developer: <a href=\"http://arc90.com/jobs/python-web-developer/\" rel=\"nofollow\">http://arc90.com/jobs/python-web-developer/</a>","time":1354388831,"type":"comment"},{"by":"amund","id":4858445,"kids":[4858554],"parent":4857714,"text":"Trondheim, Norway | Python developer | freelance/remote<p>contact: jobs@atbrox.com\n--\nkeywords: Tornado, Python, REST/websocket apis, big data/hadoop<p>see <a href=\"http://atbrox.com\" rel=\"nofollow\">http://atbrox.com</a> and <a href=\"http://atbrox.com/about/\" rel=\"nofollow\">http://atbrox.com/about/</a>","time":1354385467,"type":"comment"},{"by":"innonate","id":4866777,"parent":4857714,"text":"Picturelife <a href=\"https://picturelife.com/\" rel=\"nofollow\">https://picturelife.com/</a> (Chicago, IL - H1Bs considered and NYC considered)<p>We're founded by YC alum (iminlikewithyou/OMGPOP founder) Charles Forman, Threadless founder Jacob DeHart, and NY Tech Meetup director Nate Westheimer.<p>Picturelife is a beautiful and seamless way to backup and retrieve your entire life of photos, no matter where they live or where they've been posted.<p>We've started with a small and incredibly accomplished group of engineers, and that's how we're going to keep growing.<p>We're currently adding one person for these positions (making each team a team of two):<p>- Senior Javascript Engineer<p>- Senior Designer<p>- Senior Mobile Engineer<p>These jobs posted here:<p><a href=\"https://jobs.github.com/companies/Picturelife\" rel=\"nofollow\">https://jobs.github.com/companies/Picturelife</a>","time":1354557736,"type":"comment"},{"by":"statik","id":4917608,"parent":4857714,"text":"PARTTIME / REMOTE - Massachusetts or Northeastern USA.<p>Small distributed team at a bootstrapped and profitable healthcare software company (8 people). We make tools that help people diagnosed with mental illness get their lives back, very fulfilling work. Looking for a part time finance director as we grow from 1M to 10M in revenue. Remote OK, troublemakers OK. I've worked remotely for 10 years at a variety of companies, and this crew is great, a very pleasant team to work with. We have one SaaS product written in Rails and are launching a second. <a href=\"https://www.patdeegan.com/blog/posts/finance-director-job-opening\" rel=\"nofollow\">https://www.patdeegan.com/blog/posts/finance-director-job-op...</a>","time":1355427204,"type":"comment"},{"by":"jhodge","id":4859039,"parent":4857714,"text":"Boston (Metro-Burlington,MA) - H1B fine<p>Principal or Sr SW Eng - App Dev C++ Complex eng analysis fluid dynamics SW dev. OK so EXA is already public (after 21 years of hard work), but new product dev, small teams,&#38; you can soar if you know how. Various level jobs on this team available. Pls check out:<p><a href=\"http://exa.com/sr_sweengr_appdev_c.html\" rel=\"nofollow\">http://exa.com/sr_sweengr_appdev_c.html</a><p>SW Eng - App Dev C++ - Good opportunity to keep advancing by contributing what you know you can. View:<p><a href=\"http://exa.com/sweng_appdev_c.html\" rel=\"nofollow\">http://exa.com/sweng_appdev_c.html</a><p>Intern or Recent Grad (BS or MS) - Same as above more mentoring. View:<p><a href=\"http://exa.com/sweng_appdev_c.html\" rel=\"nofollow\">http://exa.com/sweng_appdev_c.html</a><p>Send Resumes to sweajobs@exa.com.\nThanks!","time":1354396935,"type":"comment"},{"by":"pixitha","id":4860157,"parent":4857714,"text":"Software Engineer - LAMP\nCompany:\tEdgeCast Networks, Inc.\nCity:\tSanta Monica<p>EdgeCast is looking for a LAMP developer with experience developing vertically through the whole stack. The ideal candidate is comfortable as an independent sole contributor wearing many hats: programming to system administration to business analysis to customer service. If you’ve always been the type of deeply technical developer with a natural curiosity to get under the hood and tweak every layer in the stack, while keeping the customer’s business objectives clearly in mind and gunning for tight deadlines, then this is the opportunity you’ve been seeking.<p><a href=\"http://jobvite.com/m?3VfqCfwW\" rel=\"nofollow\">http://jobvite.com/m?3VfqCfwW</a>","time":1354424691,"type":"comment"},{"by":"bluelu","id":4858335,"parent":4857714,"text":"Trendiction, Luxembourg, Europe.<p>We are crawling messageboards, news and blog sites on the web.<p>We are constantly looking for new team members (Full time):<p>* Production Operations / Systems Engineering\n* Big data engineers\n* Front end engineers<p><a href=\"http://www.trendiction.com/\" rel=\"nofollow\">http://www.trendiction.com/</a>","time":1354383753,"type":"comment"},{"by":"bobbonifield","id":4858418,"parent":4857714,"text":"QuickLeft - Boulder, CO<p>We're a web and mobile software consultancy in sunny Boulder, CO.  We work with a lot of different types of clients, but our focus is on early stage startups, helping to refine their business models and push an MVP out the door.<p>We're looking for a couple senior or mid-level devs that hava a strong background in Ruby and Javascript.<p><a href=\"http://quickleft.com/careers/senior_web_developer\" rel=\"nofollow\">http://quickleft.com/careers/senior_web_developer</a>\n<a href=\"http://quickleft.com/careers/web_developer\" rel=\"nofollow\">http://quickleft.com/careers/web_developer</a><p>We're also looking for another designer if you're into pretty things.<p><a href=\"http://quickleft.com/careers/designer\" rel=\"nofollow\">http://quickleft.com/careers/designer</a>","time":1354385156,"type":"comment"},{"by":"user1241320","id":4858191,"parent":4857714,"text":"Beintoo needs a few skilled (full time) hands in Milano, Italy.<p>We're currently looking for on experienced JS developer and a full stack java web developer.<p>More info:<p>- <a href=\"http://goo.gl/5Kpnx\" rel=\"nofollow\">http://goo.gl/5Kpnx</a><p>- <a href=\"http://goo.gl/bJkdY\" rel=\"nofollow\">http://goo.gl/bJkdY</a><p>Keep in touch info+hn@beintoo.com","time":1354380981,"type":"comment"},{"by":"willf","id":4858557,"parent":4857714,"text":"Wordnik (San Mateo, California) has lots of jobs available, as we build out [Related Content](<a href=\"http://wordpress.wordnik.com/\" rel=\"nofollow\">http://wordpress.wordnik.com/</a>) and other interesting new projects:<p>* Product Manager\n* Product Marketing Manager\n* Marketing Manager\n* iPad Visual Designer\n* iPad Interaction Designer\n* Full-Time Web and Mobile Designer\n* iOS Developer\n* Frontend Hacker\n* Server Engineer\n* Business Development Associate\n* Machine Learning Expert\n* Computational Linguist\n* Analytics and Data-Mining Expert<p>Check out the details at <a href=\"http://www.wordnik.com/jobs\" rel=\"nofollow\">http://www.wordnik.com/jobs</a> or feel free to contact me directly at will@wordnik.com","time":1354387581,"type":"comment"},{"by":"dschnurr","id":4858376,"parent":4857714,"text":"FindTheBest<p>FindTheBest is an unbiased, data-driven decision engine. We collect, organize and present data in a consumer-friendly format so our users can quickly make informed decisions. Each month, 13M+ users view our content on 800+ products and services across 10 verticals. We're backed by Kleiner Perkins Caufield Byers, and our founder/CEO previously started DoubleClick (sold to Google for $3.1B). Located in Santa Barbara (Silicon Beach), we're a fast-growing, fun place to work.<p>We're currently looking for Software Engineers and Frontend Developers. If you're interested you can learn more on our website: <a href=\"http://www.findthebest.com/jobs\" rel=\"nofollow\">http://www.findthebest.com/jobs</a>","time":1354384482,"type":"comment"},{"by":"hyperionab","id":4858250,"parent":4857714,"text":"Sencha - hiring PM, dev, test, evangelists, sales engineers, basically everything. \nFull Time (including H1B) in Redwood City, CA (94063). We're at 101 and Woodside, and there's a regular shuttle from the Redwood City Caltrain station.<p>We build tools, frameworks, and cloud services for people making web and hybrid apps for desktop and mobile. We help developers build these apps using HTML5, JavaScript and CSS and typically sell to mostly the enterprise but also consumer on the mobile side.<p>If you're interested, just shoot me a email aditya@sencha.com. Incomplete list of jobs here: <a href=\"http://sencha.com/company/careers\" rel=\"nofollow\">http://sencha.com/company/careers</a>","time":1354382057,"type":"comment"},{"by":"ryansapper","id":4918535,"parent":4857714,"text":"San Francisco (Financial District) - Full Time - Will Relocate - iOS<p>Causes.com engineers are an elite, close-knit A-Team of big thinkers, night owls, and weekend rock climbers. Every day our programmers take on a series of tech challenges together; walk around the Causes.com office and you'll see developers pairing together and sharing tips. To unwind, you'll find them playing ping-pong, enjoying a cold beer or two from the Keg-a-rator, giving quick tech talks, and releasing their own open-source projects. If you're wildly talented with a desire to do meaningful work, we want to hear from you.<p>Causes is looking for the first iOS developer to join our team. This is a rare opportunity to have your code impact millions of people all over the world. Causes is the world's largest platform for civic engagement and activism. We are working to empower anyone, anywhere to build movements for change by bringing together like-minded friends and supporters to take strategic collective action that produces a measurable, real-world impact. Come work with work a group of first-class engineers who are constantly trying to improve themselves and the people around them.<p>Responsibilities<p>-Help design and build our first iOS application<p>Requirements<p>-You built an iOS application that is on sale in Apple's App Store<p>-You find fulfillment in building great products<p>-You thrive in a collaborative environment and are eager to learn from and teach others on the team<p>-You have at least three years of experience building iOS applications<p>-You have at least three years of experience building web applications<p>-Fluent in a *nix development environment<p>Bonus Points<p>-Experience with UX design<p>-Fluent in a high level language such as Ruby, Python, PHP, or Javascript<p>-You have contributed to an open source software project<p>To apply, send your resume, code samples, and relevant links to jobs@causes.com; use \"Mobile Dev-HN\" as the subject line. For more information visit our careers page at www.causes.com/jobs","time":1355438065,"type":"comment"},{"by":"oebs","id":4858735,"parent":4857714,"text":"Berlin, Germany: Adspert (Bidmanagement GmbH) <a href=\"http://www.adspert.de/\" rel=\"nofollow\">http://www.adspert.de/</a><p>We're hiring:<p>* Python developers for both web application as well as backend services development.<p>* Experienced Javascript developers for complex frontend applications.<p>We're a small (~6 devs) but pretty competent team working on interesting problems. We got a complex system of several applications and services, which share their data mainly through Postgres (totalling ~2TB data at the moment, growing every day by a few GB).<p>If you're looking for a nice place to work in the center of Berlin, friendly colleagues and a fun environment, without overtime or weekend work, write to jobs@adspert.de.","time":1354391179,"type":"comment"},{"by":"jabrams","id":4868777,"parent":4857714,"text":"San Francisco<p>Nuzzel is a new social news startup founded by me, the founder of Friendster and Founders Den.<p>We are looking for a SysAdmin/DevOps engineer, and iOS engineer.  This will be employee #2 and #3!<p><a href=\"http://beta.nuzzel.com/passion\" rel=\"nofollow\">http://beta.nuzzel.com/passion</a>\n<a href=\"http://techcrunch.com/2012/11/08/nuzzel-funding/\" rel=\"nofollow\">http://techcrunch.com/2012/11/08/nuzzel-funding/</a><p>We just closed $1.7 million in seed funding from 500 Startups, Andreessen Horowitz, Charles River Ventures, IDG Ventures, SoftTech VC, and angel investors like Eric Ries, Gil Penchina, James Hong, Max Levchin, Michael Birch, Naval Ravikant, Philip Kaplan, and Rick Marini.","time":1354580411,"type":"comment"},{"by":"kittkat","id":4883163,"parent":4857714,"text":"Jana - Boston, MA: Full Stack Developers, Python Developers, Interns<p>Jana’s looking to hire web developers at all levels to expand our engineering team. Can you help us push the envelope of how the modern web can interact with mobile phones?<p>For more info and to apply check out our website: www.jana.com<p>We are:\nJana, a small Boston-based startup, focuses on people in the developing world.  We came out of the MIT Media Lab. We help large multinational organizations like P&#38;G, Unilever, and the United Nations connect with consumers in emerging markets like India, Indonesia, Brazil and Nigeria. Jana meets these consumers where they're at, which is often the mobile web on their low-end phone. We work at a global scale: through partnerships with more than 235 mobile operators in more than 100 countries Jana can send airtime rewards to more than 3.48 billion people. (Video on what we do-<a href=\"http://bit.ly/UGwFom\" rel=\"nofollow\">http://bit.ly/UGwFom</a>)<p>We want:\nWe’re hiring software engineers to work on both our back-end and front-end challenges. We are python end-to-end, hosting our servers in Amazon’s cloud. Our challenges tend to be systems-level ones, as we engineer the ability to reliably connect with individuals on the other side of the world.<p>We are looking for people who are passionate about what we are trying to accomplish: making a direct connection to developing world consumers using mobile technology.<p>We offer:\nWe provide a fun, relaxing, productive work environment. Our office is on Boylston Street in Boston’s Back Bay. We offer benefits like 401k, medical and dental, and perks like an in office lounge with a Wii. For fun we play ping pong or Settlers of Catan. We try to accommodate employee wants, be it snacks, beer for the beer fridge, Wii game suggestions, kickball league sign up, etc. (although I’m still having trouble getting 2 unicorns and world peace).<p>Apply Directly:\n<i>Full Stack Web Developer <a href=\"http://jobsco.re/Rwi6X6\" rel=\"nofollow\">http://jobsco.re/Rwi6X6</a>\n</i>Python Developer <a href=\"http://jobsco.re/OVBhqL\" rel=\"nofollow\">http://jobsco.re/OVBhqL</a>\n*Web Developer Intern <a href=\"http://jobsco.re/Tqohbj\" rel=\"nofollow\">http://jobsco.re/Tqohbj</a>","time":1354820085,"type":"comment"},{"by":"spoiledtechie","id":4858240,"parent":4857714,"text":"RDNation.com<p>VA, INTERN and REMOTE work.<p>Looking for a marketing Intern.  Help sell our product.  The pay is comparable as we are still in early stages, but its on your own time and in your own location.<p><a href=\"http://rdnation.com/hiring\" rel=\"nofollow\">http://rdnation.com/hiring</a>","time":1354381905,"type":"comment"},{"by":"cheeeeep","id":4868708,"parent":4857714,"text":"Hello! TASER International (www.taser.com) is looking for a few full time software developers to work on our Evidence.com (www.evidence.com) video evidence management solution.<p>The environment is start-uppy and driven; we want stellar engineers who like getting things done in a friendly, collegiate, low-politics environment. TASER has more equity upside than large companies and none of the \"lottery tickets\" of early stage start-ups. Familiarity with Amazon web services is a plus. We have offices in Santa Barbara and Phoenix, with an additional office opening in Seattle.<p>If interested or want more information, please email danny@taser.com. Thank you!","time":1354579332,"type":"comment"},{"by":"johnfilleti","id":4882156,"kids":[4882811,4882243],"parent":4857714,"text":"Care.com (Matrix, Trinity Ventures funded) is looking for an iOS dev lead to join a small, fast-paced mobile team within care.com to lead development for iPhone and iPad devices.<p>This is a lead iOS engineer position for you to grow into as we grow our iOS efforts. Candidates should also have experience using web services, XML, REST, AJAX and other integration technologies.<p>You'll be leading dev efforts for Karoo, and for our Care.com branded app that's not in market, and still in its infancy stages.<p><a href=\"https://itunes.apple.com/us/app/karoo/id544368641?mt=8\" rel=\"nofollow\">https://itunes.apple.com/us/app/karoo/id544368641?mt=8</a><p>Email me if interested: jfilleti@care.com","time":1354808688,"type":"comment"},{"by":"rada","id":4887349,"parent":4857714,"text":"Minneapolis: Web/Mobile Engineer/Developer.<p>Looking for one good developer to join our team. Great environment (think start-up within a large stable company), truly great small team and outstanding life-work balance/schedule (no overtime, summer hours, etc).<p>Our stack is: PHP, MySQL, C#, Javascript (plain/JQuery/JQuery Mobile), HTML5, iOS, Android, Selenium. Any combination of those skills is fine.<p>Full time onsite Minneapolis (Eden Prairie) only, no sponsorship.<p>Email me at <a href=\"http://i.imgur.com/jg46D.png\" rel=\"nofollow\">http://i.imgur.com/jg46D.png</a>. I am happy to answer any fellow developers' questions but please, no recruiters. Thanks!","time":1354894994,"type":"comment"},{"by":"spooneybarger","id":4857999,"kids":[4858216,4858057],"parent":4857714,"text":"The Ladders - New York City<p>Looking for full time on site developers.<p>We hire people, not skills.<p>Some stuff we use/do across our company:<p>Java, Scala, Backbone.js, Storm, RabbitMQ, Puppet, Sass, Responsive Design, Objective-C and on and on.<p>Ideal candidates probably have at least 5-7 years experience<p>Here is \"job description\", if you are interested, you can email me directly: sallen@theladders.com<p>--<p>We’re looking for a few good programmers to join our team and help us achieve our mission of “the right person for the right job.”<p>Instead of giving you a list of buzzwords to describe the role, we’ll tell you about a project we started recently:<p>A few months back, a small team of engineers and designers at The Ladders got together to design a new product. We started off by interviewing some of our customers to learn about their needs.  Using that information, we held design studios and brainstorming sessions to flesh out what the actual features and user experience would be like.<p>On the front-end, we decided to build a new Javascript-powered rich UI using responsive design techniques. Many people are working on responsive design for content-based sites, but few are doing it for browser-based applications.<p>On the back-end, we designed an Event Driven Architecture that makes use of Event Sourcing. Instead of updating a relational database in-place when things change, we store a series of discrete application events. We can then replay those events to create the state of the world at any point in the past, right up to the present. (Yes, we’ve built a time machine!)<p>Does this sound like the sort of thing you’d like to do? If it is, we’d like to hear from you.<p>In return for your passion and commitment to code quality, you’ll enjoy an awesome work environment with perks like:\nUnlimited vacation days!  Yes, unlimited!\nQuarterly hackathons\nA game room and a well-stocked kitchen\nExciting events including holiday parties, picnics, talent shows, pumpkin carving and more\nCompany sponsored athletic teams\nCompetitive salary, bonus and stock options\nHealth/Dental/Vision Insurance, 401K","time":1354378194,"type":"comment"},{"deleted":true,"id":4862024,"parent":4857714,"time":1354473706,"type":"comment"},{"by":"adparadox","id":4858316,"parent":4857714,"text":"The Motley Fool<p>FULLTIME/INTERN in WASHINGTON, DC METRO<p>The Motley Fool is always hiring passionate developers who want to help the world invest better. We write our code primarily in C# and Python, but will use anything if it helps us achieve our mission.<p>We are currently enrolling developers in a unique tryout program; details are here: <a href=\"http://culture.fool.com/2012/11/09/do-you-have-what-it-takes/\" rel=\"nofollow\">http://culture.fool.com/2012/11/09/do-you-have-what-it-takes...</a>, or learn more about our awesome culture on our blog: <a href=\"http://culture.fool.com/\" rel=\"nofollow\">http://culture.fool.com/</a>.","time":1354383397,"type":"comment"},{"by":"peterlai","id":4859110,"parent":4857714,"text":"Crocodoc (YC W10)<p>San Francisco, CA | Full time | Director of Product<p>## Description<p>Crocodoc’s HTML5 document collaboration platform reaches tens of millions of users, and our business is profitable and growing fast. Our customers include Dropbox, LinkedIn, and Yammer, and we're funded by investors including YC, SV Angel, 500 Startups, and top angels from Silicon Valley.<p>Right now we're inundated with sales inquiries from SMB customers who want to embed documents within their web and mobile applications. We’re looking for a multifaceted candidate to take charge of our SMB product and blow it out of the water. This is a key leadership role with enormous growth potential.<p>## Responsibilities<p>- Talk to LOTS of prospective customers (both product managers and developers)<p>- Develop our SMB product offering<p>- Optimize our pricing plans and product tiers<p>- Develop a scalable sales process and design a self-service experience<p>- Develop user acquisition strategy (everything from inbound marketing to direct sales)<p>- Qualify leads, own our sales pipeline, and close lots of deals<p>TL;DR: you must be capable of growing our SMB product like crazy while wearing many hats in the process.<p>## Qualifications<p>- World-class ability to communicate with clients and develop customer relationships<p>- Experience with SaaS and/or B2B technology solutions<p>- Basic technical experience (you’ve written a web app) required<p>- Sales experience (you’ve closed deals before) strongly preferred<p>- Startup experience (you can set own agenda and thrive in a fast-paced environment) a plus<p>- Product experience (you understand principles of UI and UX) a plus<p>- Product marketing experience (you’ve been responsible for user acquisition) a plus<p>This is a tremendous opportunity to own an entire product from soup to nuts. If you think you'd be a great fit, please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.","time":1354398173,"type":"comment"},{"by":"jnazario","id":4858754,"parent":4857714,"text":"Invincea Labs -- Fairfax/Arlington<p><a href=\"http://www.invincea.com/the-invincea-team/employment/\" rel=\"nofollow\">http://www.invincea.com/the-invincea-team/employment/</a><p>immediate openings<p>i'm hiring for two \"research engineer\" positions, think \"software engineer who loves solving science problems and dealing with shifting requirements\". C, C++, Python. algorithms, malware analysis familiarity, automation, etc. US citizens, clearance and/or clearable. no relo assistance.<p>i'm also seeking an IT person: sysadmin, devops role. clearance needed, experience in working with secured equipment (e.g. in a secure facility) strongly desired.","time":1354391507,"type":"comment"},{"by":"okstr","id":4891095,"parent":4857714,"text":"Pair App, by TenthBit. (San Francisco)<p>Hey guys, we're looking to hire a full-time:<p>- iOS developer<p>- Android developer<p>- Web developer<p>If you don't know what Pair is, it's a messaging app for couples. At this point we're processing 700k messages a day between couples and and have some awesome new ideas we're working on. Drop us a line if you're interested. We're open to relocating people to the Bay Area to keep the team in the same place.<p>Check out <a href=\"http://tenthbit.com/jobs\" rel=\"nofollow\">http://tenthbit.com/jobs</a> for details, or send us a message directly to jobs@tenthbit.com for web developer positions.<p>You can also send me an email directly to oleg(at)tenthbit.com","time":1354953577,"type":"comment"},{"by":"garysieling","id":4858588,"parent":4857714,"text":"Wingspan Technology, Philadelphia, PA (Whitpain)<p>Full-Time, Software Engineers, Operations, Postgres or Oracle DBAs<p>We're a quickly growing enterprise software company in the suburbs north of Philadelphia, servicing the pharma and energy industries. We have a series of client-funded products, primarily Java and some .NET, some are web-based installable products, and one new SaaS product. While much of our current code base is Java, we're currently investigating tools for the next generation of our tech stack (e.g. Scala/Clojure, and various UI frameworks).<p>Contact- gsieling@wingspan.com\nwww.wingspan.com","time":1354388152,"type":"comment"},{"by":"frederickcook","id":4860163,"parent":4857714,"text":"Moveline (NYC)<p>Senior Software Engineer (<a href=\"https://angel.co/l/6HTt2\" rel=\"nofollow\">https://angel.co/l/6HTt2</a>)<p>Stack: nodejs/mongodb/backbonejs<p>The moving industry has always built software to make it's job easier. Moveline believes in building software to make our customers lives easier.<p>We practice continuous deployment, which means we write tests for everything. Our designers and developers work directly with each other, letting us quickly implement and test new designs and features.<p>Feel free to contact our team directly chris@moveline.com, adam@moveline.com, kelly@moveline.com, or fred@moveline.com if you are interested.","time":1354424881,"type":"comment"},{"by":"traviskuhl","id":4858236,"parent":4857714,"text":"Team Coco (teamcoco.com)\nLocation: Burbank, CA\nPosition: Web Developer, Full Time\nDetails: <a href=\"http://teamcoco.com/content/web-developer\" rel=\"nofollow\">http://teamcoco.com/content/web-developer</a>","time":1354381817,"type":"comment"},{"by":"paulaminc","id":4865401,"parent":4857714,"text":"Boston, MA Full-time, On-site Developer\nRuby, Python, Java or front-end web development\n-Job Details:  <a href=\"http://ripariandata.com/jobs/#section1\" rel=\"nofollow\">http://ripariandata.com/jobs/#section1</a>\n-Riparian Data is a Boston-based startup spun out of SoftArtisans, a 15 year-old software company. Our mission: use big data technologies to make enterprise software smarter, faster, and friendlier. Our recipe for success: supremely talented employees, lean development, boundless pluck, and a close-knit, collaborative environment.","time":1354543914,"type":"comment"},{"by":"3pt14159","id":4857792,"parent":4857714,"text":"Toronto, ON. Local only.<p>500px - The worlds best photos.<p>Developer: Work with awesome stuff (zerorpc, numpy, scipy, rails, backbone, iOS/OSX, even windows 8) lots of apps, lots of ownership and movement. Work with some killer designers. $60k-100k ~.25% in stock options.<p>Designer: design awesome stuff. $55k-90k, ~.25% in stock options.<p>QA awesome person. Please. Save us. We have 10 products and one current QA awesome person. Similar range to a dev.<p>Data hero: whip up reports for the bosspersons and build out your coding skill around lots of smart people. A good roll for someone that loves the OK Cupid blog posts.<p>My email is in my profile. :)","time":1354374283,"type":"comment"},{"by":"dougb","id":4870105,"parent":4857714,"text":"kWantera, Pittsburgh PA, fulltime\nWe are an energy management startup in Pittsburgh's Strip District.\nWe are changing the way that businesses buy electricity in the wholesale\nmarkets. See <a href=\"http://www.kwantera.com\" rel=\"nofollow\">http://www.kwantera.com</a> for more info.<p>- Frontend Developer - js, jQuery, D3, NVD3.<p>- Backend Developer - Python, Flask, Java, MongoDb, MySQL, interest in Scala.<p>- DevOps - Linux, AWS, Whirr, Python, MongoDb, MySQL.<p>- QA - Python<p>- Data Scientist - forecasting, MATLAB, R, Python, NumPy.<p>We are a small dedicated group of people trying to distupt the\nenergy procurement market.<p>Email me if interested: dbalog@kwantera.com","time":1354612342,"type":"comment"},{"by":"joshyeager","id":4862660,"parent":4857714,"text":"Swift Software - Frederick, MD (Near DC) - Software Engineers for Product Development and Professional Services<p>Are you tired of commuting to DC or Northern Virginia? Swift Software is a growing product-centered technology company seeking talented developers to join our development and proserv teams in Frederick, MD. Our flagship product is JobTraQ, a task management and workflow system that offers vastly more flexibility and power than any other product in our market segment, and is significantly less expensive and easier to configure than big \"BPM\" suites like MetaStorm and Lombardi. These advantages are allowing us to disrupt both markets.<p>Product developers will create new features in JobTraQ and enhance existing functionality. You’ll help us build advanced visual design and administration tools, augment the product’s business intelligence capabilities, improve performance and scalability, and use customer feedback to enhance all parts of the system.<p>Proserv developers will work with our mid-market and enterprise customers and our business analysts to design and implement software solutions that build on JobTraQ's capabilities. Our implementation and customization projects are usually one week to two months long, so you’ll enjoy a wide range of work on interesting problems for clients in many regions and industries. Recent projects have included a touchscreen system for warehouse tracking, integration with accounting systems, complex custom finance and billing reports, and automatic data synchronization.<p>Both teams have an enjoyable and collaborative culture in a creative environment. We interact positively and openly and emphasize learning and professional development. These attributes have enabled us to produce an industry-leading product with a globally recognizable and satisfied client base. Our environment is relaxed and fun, we play everything from Total Annihilation to Alien Swarm at our game nights, and we equip everyone with new quad-core Thinkpads with SSDs and dual monitors. Our policies and benefits are family-friendly, with generous vacation time, good health insurance options, and flexible work schedules.<p>For more information about these positions, see the links below. If you are interested in either one, email your resume to resumes@swiftsoftware.com.<p><a href=\"http://www.jobtraq.com/jobs/se227-software-engineer-product-development.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se227-software-engineer-product-...</a><p><a href=\"http://www.jobtraq.com/jobs/se152-software-engineer-professional-services.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se152-software-engineer-professi...</a>","time":1354485016,"type":"comment"},{"by":"onsports","id":4862026,"kids":[4862241],"parent":4857714,"text":"San Francisco, CA. Full-time. H1B is fine.<p>OnSports is revolutionizing the sports world. We're a fast-growing, well backed startup and are focused on building social, design forward, mobile apps for the ever expansive sports market. The opportunity ahead of us is huge and we're looking for the right team members to join us.<p>We love what we do and we love what we are building. A challenging problem is what excites us.<p>We are looking for:<p>* iOS Developer<p>* Python/Django Developer<p>* Android Developer<p>* Product Designer<p>Join us. Email jobs@onsports.com<p>Read more about us and our team at <a href=\"http://www.onsports.com/company/\" rel=\"nofollow\">http://www.onsports.com/company/</a>","time":1354473774,"type":"comment"},{"by":"emilis_info","id":4858505,"kids":[4858926],"parent":4857714,"text":"PriceOn (in VILNIUS, Lithuania, Europe) is looking for full-time DEVELOPERS:<p>- JavaScript<p>- .NET<p>- iOS<p>- Android<p>We are offering flexible working conditions, good salary, lots of opportunities to use your wide experience and learn new things. You will join a small team that currently has 2 developers.<p>We are building a platform for optimizing everyday shopping experience -- web and mobile apps for finding best prices, sales, optimizing expenses, etc. Recently funded and expanding.<p>Technologies we use: Amazon cloud services, ElasticSearch, RabbitMQ, CouchBase, PostgreSQL, nginx, Node.js, LESS CSS, Jekyll, Git, Mercurial.<p>Send an email to: emilis@priceon.lt","time":1354386641,"type":"comment"},{"by":"dhyasama","id":4858030,"parent":4857714,"text":"Rallyverse, New York, NY - Web dev and/or designer<p>We're a funded team of ten in the Nomad area of NYC working on making social media easier for brands and marketers. We're looking for full-time help on the front-end. Some combination of code (HTML, CSS, JS) and visual design is necessary, but the exact ratio is open. Basically, we're looking to hire the most talented person, wherever you may fall on the dev/design spectrum. Back-end chops are a plus but not required.<p>We found our last hire on HN. Let's keep the ball rolling!<p>Email Jason at jason@rallyverse.com.","time":1354378625,"type":"comment"},{"by":"danwalmsley","id":4866977,"kids":[4874606],"parent":4857714,"text":"NationBuilder (<a href=\"http://nationbuilder.com\" rel=\"nofollow\">http://nationbuilder.com</a>) in Los Angeles, California<p>We're looking for talented Rails and Javascript developers, project managers and designers.<p>Fun office in downtown LA packed with great developers building new kind of product - a \"Community Organising System\" (COS) with the goal of empowering leaders and creators around the world.<p>We're backed by Andreessen-Horowitz and Sean Parker, among others.<p><a href=\"http://dev.nationbuilder.com/jobs\" rel=\"nofollow\">http://dev.nationbuilder.com/jobs</a><p>Email jobs@nationbuilder.com.","time":1354559718,"type":"comment"},{"by":"chrisjwilson","id":4870278,"parent":4857714,"text":"Rotterdam, Netherlands, full time, part time or intern: <a href=\"http://planspot.com/\" rel=\"nofollow\">http://planspot.com/</a><p>We're looking for talented developers to work in our well-funded fast-moving startup which is developing an all-in-one event marketing platform.<p>Job description here: <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=4151144\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=4151144</a><p>We're looking for smart people, regardless of experience or the tech they've used in the past.<p>Email me if interested: chris@planspot.com","time":1354617510,"type":"comment"},{"by":"TallGuyShort","id":4858123,"parent":4857714,"text":"Cloudera - Palo Alto, San Francisco, and others.<p><a href=\"http://www.cloudera.com/content/cloudera/en/about/careers.html\" rel=\"nofollow\">http://www.cloudera.com/content/cloudera/en/about/careers.ht...</a>","time":1354379869,"type":"comment"},{"by":"pgambling","id":4858099,"parent":4857714,"text":"PROS (prospricing.com) - Houston, TX<p>Check out our job postings, many positions available.<p><a href=\"http://linkd.in/VlYtVb\" rel=\"nofollow\">http://linkd.in/VlYtVb</a><p><a href=\"http://linkd.in/VgqdGO\" rel=\"nofollow\">http://linkd.in/VgqdGO</a>","time":1354379474,"type":"comment"},{"by":"twago","id":4858603,"parent":4857714,"text":"twago (<a href=\"http://www.twago.com\" rel=\"nofollow\">http://www.twago.com</a>) is hiring in Berlin, Germany:<p>- Principal DevOps Engineer<p>Our small team is seeking a new colleague to help us deliver and run the next generation of our web platform.<p><a href=\"http://www.twago.com/blog/principal-devops-engineer/\" rel=\"nofollow\">http://www.twago.com/blog/principal-devops-engineer/</a>\njoin-our-team[_at_]twago.com<p>twago is Europe's leading platform for connecting clients with contractors.<p><i>Interviews available immediately for qualified candidates with right-to-work in Germany / EU</i>","time":1354388475,"type":"comment"},{"by":"mbesto","id":4881576,"kids":[4898359],"parent":4857714,"text":"Xoomworks (<a href=\"http://www.xoomworks.com\" rel=\"nofollow\">http://www.xoomworks.com</a>) in London, UK.<p>We're looking for a UX/UI designer to help grow our mobile application team. We specialize in delivering mobile for the enterprise, so a keen interest in making super ugly stuff (I'm looking at you Windows user icon guy in blue shirt) look sexy is key.<p>Things you'll do:\n- Run UX discovery sessions \n- Create wireframes/mockups\n- Create graphics for mobile UI<p>If interested, my name is Mike: michael.bestvina [AT] xoomworks [DOT] com","time":1354799333,"type":"comment"},{"by":"ianterrell","id":4858310,"parent":4857714,"text":"Data Scientists, Mobile Game Engineers, Big Data Engineers, Ruby on Rails Developers, Tech Writers, QA -- you name it!<p>FULLTIME jobs at ngmoco:) in SAN FRANCISCO, CA!<p>ngmoco:) makes social games. Some are more fun than others. But with your help, maybe they could all be super fun. :)<p>Apply here: <a href=\"http://www.ngmoco.com/careers/positions/engineering\" rel=\"nofollow\">http://www.ngmoco.com/careers/positions/engineering</a><p>I've been there a month, and it's a fun environment. Feel free to email me (in profile) any questions you have.","time":1354383248,"type":"comment"},{"by":"steverb","id":4857954,"parent":4857714,"text":"Cellular Sales - Knoxville, TN<p>Help us make the process of selling a cellphone easy. Along the way you'll get to deal with the challenges of replacing a fast growing companies legacy software without bothering the customers and sales people.<p>We're looking for junior/mid-level developers, a configuration/release manager, and a leader for our QA department.<p>We use mostly .NET, but we're also exploring our options and no technology is off the table.<p>Contact steve.barbour@cellularsales.com","time":1354377579,"type":"comment"},{"by":"adahm","id":4859704,"parent":4857714,"text":"Minneapolis, MN: Web Developer<p>Fast Horse seeks a front-end web developer to lead digital production on a wide variety of projects. We need a go-getter who can offer and implement innovative web design, UX and UI ideas. Candidate must be able to code standards-compliant sites and social applications.<p>Responsibilities \n• Create standards-compliant websites\n• Help design and build custom Facebook tabs and various other social applications\n• Customize and create WordPress templates\n• Provide valuable input on web design, user experience and user interface for digital development projects\n• Implement SEO best practices on all projects\n• Communicate effectively with colleagues and clients\n• Develop cost estimates for digital projects<p>Skills &#38; Experience\n• Proven track record of coding standards compliant sites\n• Strong focus on front-end design and modern web/mobile design\n• Familiarity with implementing responsive design\n• Strong understanding of APIs\n• Experience in building social applications interfacing with Facebook and Twitter\n• Project management – including the ability to set and meet deadlines and budgets\n• Problem analysis – thoroughly defining challenges and solutions\n• Resourcefulness– integrating creative knowledge with business realities\n• Openness to new ideas and influences\n• Curiosity to seek out new techniques and innovations\nIntangibles\nWe value initiative, a sense of humor, risk-taking and flexibility.\nYou also need to have a thick skin and a long fuse to thrive in a creative, open, fast-paced environment<p>Workplace/Compensation\nFast Horse has been named as one of Minnesota’s Best Places to Work by both The Mpls/St. Paul Business Journal and Minnesota Business Magazine, and was named to the The Mpls/St. Paul Business Journal’s “Fast 50″ list honoring the fastest-growing companies in the Twin Cities.\nWe offer a highly flexible workplace, where Fast Horse staffers are untethered by a designated office or desk. We call it “hotdesking.” Our building is set up to facilitate communication and collaboration, and our people are offered the flexibility work wherever they desire, whether that’s at the office, at a coffee shop, at home, or anywhere else where they feel creative and productive. We offer highly competitive salaries and benefits, including a cafeteria healthcare plan, a SIMPLE IRA, and incentive compensation opportunities.<p>To apply for this position, email your resume and a link to your portfolio to info@fasthorseinc.com","time":1354411522,"type":"comment"},{"by":"shopbopdev78","id":4858308,"parent":4857714,"text":"Shopbop.com  - Madison, WI USA<p>- Software Development Managers\n- Senior Software Developers\n- Software Engineers<p>Primarily a Java-based e-commerce platform, heavily investing in SOA architecture and scalable sytems.  Experiencing rapid business growth and seeking to support that growth by building out our development team.<p><a href=\"http://www.shopbop.com/ci/aboutShopBop/careers.html\" rel=\"nofollow\">http://www.shopbop.com/ci/aboutShopBop/careers.html</a>","time":1354383193,"type":"comment"},{"by":"meganelacarte","id":4873093,"parent":4857714,"text":"E la Carte (www.elacarte.com) Palo Alto, CA\nWe develop tablets for restaurants that allow guests to browse the entire menu with pictures, place orders, and pay their check whenever they want - without having to leave their seats!<p>Openings: Backend &#38; Frontend Software Engineers and a Sales Coordinator<p>Stack: Python, Django, JavaScript, HTML5, tablets, 3rd party POS integration, web<p>More info: www.elacarte.com/jobs<p>Or feel free to ping me at megan (at) elacarte.com","time":1354653037,"type":"comment"},{"by":"dbreunig","id":4858332,"parent":4857714,"text":"PlaceIQ is hiring a data scientists, a systems/dev ops software engineer, a junior software engineer, and a product lead.<p>Based in New York, PlaceIQ aggregates and organizes location-based data to better understand the context of a place and time. We've got great momentum, top-shelf clients and partners, and tons of interesting data to play with!<p><a href=\"http://www.placeiq.com/jobs/\" rel=\"nofollow\">http://www.placeiq.com/jobs/</a>","time":1354383710,"type":"comment"},{"by":"grotm001","id":4921154,"parent":4857714,"text":"EquityLancer - <a href=\"http://equitylancer.com/\" rel=\"nofollow\">http://equitylancer.com/</a><p>If you're looking for start-up jobs or jobs that are guaranteed to contain equity, then EquityLancer is the ideal place to find those opportunities (<a href=\"http://equitylancer.com/\" rel=\"nofollow\">http://equitylancer.com/</a>) - simply sign up as an equitylancer and find the job that meets your desired criteria.","time":1355496915,"type":"comment"},{"by":"philfreo","id":4858161,"kids":[4860015],"parent":4857714,"text":"Elastic - MOUNTAIN VIEW, CA<p>Looking for great hackers to join our (4 person) dev team working on sales communication software Close.io (<a href=\"http://close.io/\" rel=\"nofollow\">http://close.io/</a>)<p>JavaScript (Backbone.js), Python (Flask) + MongoDB. We do a lot of open source work: <a href=\"https://github.com/elasticsales\" rel=\"nofollow\">https://github.com/elasticsales</a><p>Also looking for a great designer!<p>Send me an email at phil@elasticsales[dot com]","time":1354380282,"type":"comment"},{"by":"cybernytrix","id":4860274,"parent":4857714,"text":"Early stage startup - San Francisco - Full Time, H1B OK<p>You - Super smart Django Developer, Python Developer<p>Livemagic's Replay is a mobile and web service that enables users to capture and share their favorite TV moments from live sports, reality, and prime time TV shows. Using the Replay mobile app, users can capture TV video clips, add comments, and share on Facebook, Twitter and with the Replay community.","time":1354427866,"type":"comment"},{"by":"skyfallsin","id":4858217,"parent":4857714,"text":"Kicksend (S1!, Mountain View, CA)<p>Hiring:<p>- Android Lead<p>- Mac Desktop Lead<p>Email me at pradeep@kicksend if you're passionate about shipping beautifully crafted product to massive international markets.","time":1354381393,"type":"comment"},{"by":"Lightbody","id":4861891,"parent":4857714,"text":"New Relic - Portland, OR - Technical Product Manager<p>We are hiring a bunch of engineers in Portland and SF, but I'm specifically looking for technically-minded product managers to help us focus our product line in various communities like .NET, PHP, Java, Python, Ruby, and Node. More details at <a href=\"http://bit.ly/UhAl1a\" rel=\"nofollow\">http://bit.ly/UhAl1a</a>","time":1354470879,"type":"comment"},{"by":"steilpass","id":4858647,"kids":[4884020],"parent":4857714,"text":"Agile Software Developers in Cologne, Germany.<p>We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://adkla.us\" rel=\"nofollow\">http://adkla.us</a>","time":1354389299,"type":"comment"},{"by":"orta","id":4857765,"parent":4857714,"text":"Art.sy - New York City - iOS Developers and Web Developers<p><a href=\"http://art.sy/job/developer\" rel=\"nofollow\">http://art.sy/job/developer</a>","time":1354373631,"type":"comment"},{"by":"kepano","id":4858079,"parent":4857714,"text":"Los Angeles, could be remote.<p>Lumi (<a href=\"http://lumi.co\" rel=\"nofollow\">http://lumi.co</a>)<p>iOS Lead Developer<p>Developing the new version of Lumityper for iOS. Our app complements our light-sensitive dye products, Inkodye. The app makes it easy mock-up t-shirt designs and order the supplies to print them yourself.<p>* Experience working with image processing / filters<p>* Tying in external APIs<p>* E-commerce/Stripe integration<p>Show us your work: jobs@lumi.co","time":1354379134,"type":"comment"},{"by":"Peroni","id":4860741,"parent":4857714,"text":"globaldev - London, UK: Ruby Engineers &#38; Ruby on Rails Developers - Permanent &#38; Contract<p><a href=\"http://globaldev.co.uk/jobs\" rel=\"nofollow\">http://globaldev.co.uk/jobs</a><p>With a portfolio of over 7,500 sites, we’re the largest social network you’ve probably never heard of. One of the world’s leading social discovery and dating companies, we’re the Facebook for people who haven’t met yet – enabling people to find new friends and partners online for fun and adventure in real life.<p>We’re looking for 2-3 expert Ruby engineers &#38; RoR Developers to help us build a series of major enhancements to our dating platform and infrastructure over the next 12 months.\nIt's a fantastic place to work where you'll be surrounded by incredibly talented developers working on big data problems and we are working hard to ensure we provide the best environment for Ruby/RoR Devs in London.<p>Contact me directly in confidence: sbuckley@globaldev.co.uk","time":1354442687,"type":"comment"},{"by":"hal_eisen","id":4858404,"parent":4857714,"text":"Oakland, CA - Ask.com<p>Our SEM team operates as a quasi-startup business unit within the larger company<p>We're looking for senior java software engineers: <a href=\"http://bit.ly/TyAos4\" rel=\"nofollow\">http://bit.ly/TyAos4</a><p>We have a Hadoop-based analytics system, and an automated bidding system.  Future growth includes machine learning for bidding, and many scaling challenges!","time":1354384969,"type":"comment"},{"by":"cllns","id":4858015,"kids":[4858323],"parent":4857714,"text":"Wayfair - Boston, MA<p>Join the team creating an e-commerce platform on track to become a household name for online home sales.<p>We currently have 16 open engineering positions, for all levels.<p>Learn more here: <a href=\"http://www.wayfair.com/careers#dept=engineering&#38;section=opportunities\" rel=\"nofollow\">http://www.wayfair.com/careers#dept=engineering&#38;section=...</a>","time":1354378450,"type":"comment"},{"by":"lamplightr","id":4858645,"parent":4857714,"text":"Toronto, Full time, Uken Games<p>Uken is looking for extremely talented developers to help us build amazingly fun mobile games.<p>We are a team of 45 passionate people, experiencing massive growth, with hundreds of thousands of players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>More info at <a href=\"http://uken.com\" rel=\"nofollow\">http://uken.com</a>","time":1354389266,"type":"comment"},{"by":"weston","id":4858481,"parent":4857714,"text":"isocket - Burlingame, CA or NYC - F/T<p>The web's best publishers (like TechCrunch, VentureBeat, Gawker, GigaOM, &#38; Mashable) use <a href=\"http://isocket.com\" rel=\"nofollow\">http://isocket.com</a> to sell ads on our marketplace <a href=\"http://buyads.com\" rel=\"nofollow\">http://buyads.com</a>.<p>We just rased $8 million and are now on a hiring spree:  <a href=\"http://bit.ly/TUn4d2\" rel=\"nofollow\">http://bit.ly/TUn4d2</a><p>•Engineering - Including a VP of Engineering\n•Sales &#38; Marketing - Including a VP of Marketing\n•Ad Ops<p>Our HQ is in Burlingame, 50 yards from the CalTrain station.  Our office is a short commute for both San Francisco and the South Bay (Palo Alto, Mountain View, etc.).<p>•No cubicles\n•Dogs allowed in the office\n•We have remote-controlled helicopters<p>Apply here:  <a href=\"http://www.isocket.com/jobs\" rel=\"nofollow\">http://www.isocket.com/jobs</a>.","time":1354386079,"type":"comment"},{"by":"RichardPrice","id":4858612,"parent":4857714,"text":"San Francisco, CA. Full time. Remote is fine too.<p>Academia.edu is a social platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>Many people think that science is too closed, and too slow. We are trying to change that. There are 4 things we are trying to achieve with Academia.edu - ways in which we are trying to re-shape and accelerate science:<p>- Instant distribution. Right now there is a 12 month time-lag between submitting a paper to a journal, and the paper being published. We need to remove that time-lag and introduce instant distribution of scientific ideas.<p>- Better peer review. Right now the peer review process takes 12 months to complete, and only surfaces the opinions of two academics - academics who may be biased, uninformed about the subject area, or just in a bad mood when writing the review. 2 people is too small a sample size. We need a faster and more robust peer review system, one that surfaces the opinions of the entire scientific community, across a variety of dimensions, and in real-time.<p>- Multi-media. Right now, scientists only share papers in PDF form. We need to bring about a science where scientists are incentivized to share data-sets, code, videos, blog posts, and comments on all these media. Right now 50% or more of the world’s scientific output does not get shared, because the system of credibility metrics only rewards one kind of format, the paper. We need to change this.<p>- Open access. We need to bring about a world where a villager in India has the same access to the world’s scientific output as a professor in Harvard. When you open up access to the world’s scientific literature to the 2.5 billion people who are online right now, magical things may happen.<p>It's an exciting time for science. Science is transitioning from a 17th century way of sharing ideas, based on the journal system, to a faster system of sharing ideas on the web. Science is a foundational part of global growth: almost every innovation in medicine and technology has its roots in a science paper.<p>We need talented and passionate engineers to help us accelerate science. We have made a good start: 1.9 million academics have joined Academia.edu, and 4,000 join each day.<p>We're a 12 person, engineering-driven, team based in downtown San Francisco. Technologies we use include Rails, PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd. We have raised $6.7 million from Spark Capital, True Ventures, Mark Shuttleworth (founder of Ubuntu), and others.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. We are looking to hire a range of positions:<p>* full stack engineers\n* growth engineer (optimizing our growth and retention channels)\n* iOS engineer<p>There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. There is more on TechCrunch about our mission here <a href=\"http://techcrunch.com/2012/02/05/the-future-of-peer-review/\" rel=\"nofollow\">http://techcrunch.com/2012/02/05/the-future-of-peer-review/</a> (The Future of Peer Review) and here <a href=\"http://techcrunch.com/2012/04/29/the-future-of-science/\" rel=\"nofollow\">http://techcrunch.com/2012/04/29/the-future-of-science/</a> (The Future of Science)<p>We want to hire world class engineers. We want you to join us in building the future of science whether you are based in San Francisco, New York, Delhi, or Beijing. Remote work is fine. We will handle re-location, including visas, if you would like to re-locate, but re-location is not necessary.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1354388601,"type":"comment"},{"deleted":true,"id":4865947,"parent":4857714,"time":1354550268,"type":"comment"},{"by":"Hovertruck","id":4858128,"parent":4857714,"text":"Chartbeat is hiring across the board in NYC, H1B possible. Core technologies are Python, C, MongoDB, and JavaScript (using Google's Closure library).<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1354379959,"type":"comment"},{"by":"kravtsovd","id":4862466,"kids":[4862997],"parent":4857714,"text":"REMOTE. Marketing manager with experience in the U.S. market and IT projects  <a href=\"http://rizzoma.com\" rel=\"nofollow\">http://rizzoma.com</a>.<p>Rizzoma.com it's a communication tool with new contextual paradigm.<p>email: kravtov.d@rizzoma.com","time":1354481666,"type":"comment"},{"by":"wjohnald","id":4858370,"parent":4857714,"text":"<a href=\"http://careers.stackoverflow.com/jobs/27279/web-developer-generalist-kollabora?a=wefw8ec&#38;searchTerm=kollabora\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/27279/web-developer-ge...</a>","time":1354384401,"type":"comment"},{"by":"dlokshin","id":4857844,"parent":4857714,"text":"AlpineReplay (Remote, anywhere)\nJunior iOS Engineer\nCompany: We make action sports measurable, sharable, and comparable. If you like to play outside, you should come work with us.\nEmail is in my profile","time":1354375433,"type":"comment"},{"by":"jasonmoo","id":4876932,"parent":4857714,"text":"Vimeo – NY, NY (Chelsea)<p>Check out all our jobs: www.vimeo.com/jobs<p>PHP Engineers (full-stack &#38; backend)<p>iOS Engineer<p>DevOps Engineer<p>Data Operations Engineer<p>Marketing Web Designer<p>Stuff we use: PHP, Python, MySQL, Mongo, Redis, AWS, Solr, Hadoop, nginx, node, Vertica. And pretty much any mobile platform.","time":1354724370,"type":"comment"},{"deleted":true,"id":4858188,"parent":4857714,"time":1354380852,"type":"comment"},{"by":"benjlang","id":4857852,"parent":4857714,"text":"In Israel.<p>MyPermissions - <a href=\"https://mypermissions.com/careers\" rel=\"nofollow\">https://mypermissions.com/careers</a><p>Familio - <a href=\"http://familio.com/jobs\" rel=\"nofollow\">http://familio.com/jobs</a>","time":1354375667,"type":"comment"},{"by":"duanefields","id":4863672,"parent":4857714,"text":"Tastemade - Austin, TX - iOS Dev, Bonus points for experience with video capture, processing, and editing. Free cookies. Email jobs@tastemade.com if interested.","time":1354503643,"type":"comment"},{"by":"jsl","id":4857788,"parent":4857714,"text":"Stack Builders is hiring Ruby and Clojure developers in NYC and Colombia, South America.<p><a href=\"http://stackbuilders.com\" rel=\"nofollow\">http://stackbuilders.com</a>","time":1354374096,"type":"comment"},{"by":"trimbo","id":4858270,"parent":4857714,"text":"Radius Intelligence - San Francisco, CA - Full Time<p>We need:<p>* Production Operations / Systems Engineering<p>* Full Stack Engineers<p>* Front End Engineers<p>* Test Engineers<p>* UX/designers<p><a href=\"https://radiusintel.com/jobs\" rel=\"nofollow\">https://radiusintel.com/jobs</a>","time":1354382424,"type":"comment"},{"by":"mmurph211","id":4858010,"parent":4857714,"text":"Boston, MA - Vestmark<p>Front End Engineer (entry level) <a href=\"http://jobs.37signals.com/jobs/12109\" rel=\"nofollow\">http://jobs.37signals.com/jobs/12109</a>","time":1354378382,"type":"comment"},{"by":"mikek","id":4858098,"parent":4857714,"text":"Kiwi Crate - Mountain View, CA<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1354379471,"type":"comment"},{"by":"bartonfink","id":4861906,"parent":4857714,"text":"Mapquest.com<p>Primarily in Denver, CO and Lancaster, PA, but we're a relatively distributed\ncompany so go ahead and ask if you live somewhere else. As an AOL subsidiary,\nwe've got employees who work out of AOL offices around the world so it wouldn't\nbe unheard of to work from e.g. Seattle or New York if you decide Denver's just got\ntoo much sunshine. I've also been told we will sponsor an H1B.<p>Over the past year, MapQuest has brought on an almost entirely new management\nteam to shake things up and change the direction of the company from answering\nthe ? \"How do I get there?\" to answering the more interesting ? \"Where do I want to\ngo?\" We've released two new products in the last year (Discover and Local, formerly\nknown as Vibe) and are aggressively working on creating an engineering-driven\nculture that actually builds things people might want to use instead of polishing\nproducts that were cool in 2004. We've had a banner year, and are looking to hire\nengineers as well as product managers to continue this upward trend.<p>Among the technical roles we're looking to fill are several Ruby developers at\nvarying levels of expertise to help develop new products as well as one Java\ndeveloper to work with our data team and revamp various backend services\n(i.e. search, geocoding and a data ingestion service that populates our location\ndatabases). Ever since Valve leaked their company handbook, the phrase \"T shaped\"\nhas been been thrown around a lot by upper management, so you'll need to be\nable to do full-stack development. We do a lot of pair programming right now, so if\nyou've got experience doing that, it'd be a big plus. We're particularly interested in\nsomeone who's got very deep Rails experience to serve as a sort of tech lead, but we\nhave many positions open for Rails people so if you'd be interested at all drop a line.<p>Product is looking to bring on people with some combination of travel industry\nknowledge and mobile applications to help get the company past maps and\ndirections. Most of our product people have development experience, so you'll be\nexpected to be able to \"talk shop\" with the engineers you work with, but your day-\nto-day responsibilities aren't going to be producing code as much as producing\nideas, pitching them to the rest of the company and helping the engineers and\ndesigners see them through to completion.<p>I can definitively say that MapQuest is among the best places I've ever worked. The\noffice space is fantastic (Downtown Denver right off the 16th Street Mall) and the\nnew management team is very serious about doing things right as we try to pivot\nthe company away from directions and into product development. The brand is\npractically a household name, the product team is happy to listen to engineers for\nfeedback or ideas, and we've got the interesting position right now of being able to\nwork like a startup except with a large pre-build audience (I've been told that we\nhad 40M UV's on a brand new product this past Thursday, for example). You can\nread the company postings here (<a href=\"http://company.mapquest.com/careers/\" rel=\"nofollow\">http://company.mapquest.com/careers/</a>) but I'd really enjoy being able to answer ?'s directly. My e-mail is in my profile and please\nfeel free to contact me personally if you have further ?'s, want to chat, or anything\nelse. Happy holidays, and hope to hear from some of you soon!","time":1354471156,"type":"comment"},{"by":"0xa","id":4858362,"parent":4857714,"text":"Tumblr, New York, NY (NYC, Manhattan): FULL TIME Software Engineers (Scala, Java, Go), PHP Developers, Database Engineers (MySQL), and a Site Reliability Engineering Lead (Linux, Nginx, HBase, HAProxy, Memcached, and OpenTSDB)<p>Tumblr is actively hiring experienced engineers at every layer of our technology stack.  We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility.  We work in an open, friendly and positive environment that encourages intellectual curiosity, a love for open source, and empowering millions of users to create and explore content. I'll highlight a few positions here, but you can see an awesome photo of Tommy the Pomeranian with Mayor Bloomberg, our great benefits, and the complete listing of open positions at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): Writing generic, reusable services in Scala or Go, you'll design, code and grow a blazingly fast platform for our PHP application.  Being a productive coder with architecture common sense is a must, but expertise in Java or JVM tuning is a plus.<p>* Database Engineer (<a href=\"http://bitly.com/U0VK2P\" rel=\"nofollow\">http://bitly.com/U0VK2P</a>): You'll scale and organize our data persistence layer to a level few sites can match.  We'll love your MySQL expertise and eye for efficiency.<p>* Search Engineer (<a href=\"http://bitly.com/TcOdt8\" rel=\"nofollow\">http://bitly.com/TcOdt8</a>): Real-time search and analysis is your forte.  Using your large-scale experience with building and innovating search backends, you'll tune our evaluation algorithms and expand the software infrastructure.<p>* Site Reliability Engineering Lead (<a href=\"http://bit.ly/Uyy04u\" rel=\"nofollow\">http://bit.ly/Uyy04u</a>): As the team lead, you are an inspiring software developer with a passion for the highly performant, fault-tolerant, massively distributed systems that make Tumblr fast, reliable and available for hundreds of millions of visitors and tens of millions of users.<p>* Product Engineer (<a href=\"http://bit.ly/ToF7Ya\" rel=\"nofollow\">http://bit.ly/ToF7Ya</a>): You're a versed engineer and perfectionist with good taste, ready to take ownership of entire features of our PHP application.<p>About Tumblr:<p>Founded by David Karp in New York City in 2007, Tumblr is a microblogging platform that allows users to effortlessly share anything. Tumblr now hosts over 70 million blogs with over 30 billion posts to date. Our pageview to engineer ratio is 0.5 billion PV per month to 1 engineer. This means every line of code every developer writes has a huge impact. We are focused on building tools and technologies that will advance the state of the art in dealing with massively scaled websites as we quickly grow past 50,000 requests and 1,400 posts per second. We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1354384303,"type":"comment"},{"by":"akshxy","id":4857771,"kids":[4858968,4866862],"parent":4857714,"text":"Rails Hacker/ Chief Technical Officer<p>Mumbai, Helsinki, San Francisco<p>What’s in it for you?<p>Early mover advantage as we are still a small start-up and building a growth team like those at Quora, Facebook, Slideshare. You will be our first full-time Ruby Developer with your key responsibility being to own anything back-end related. You will be part of the new product team and work closely with our Front-End &#38; UX/UI team. Opportunity to work with really talented engineers, designers and growth hackers to build products that you will be proud of. Culture of high performance, flexibility and responsibility with hack days every other weekends. Your views will be heard because we strongly believe everybody plays a critical role. Work exchange platform if you like balancing multiple projects. Enjoys beer/wine/etc… nothing like a cold beer down the pub after work on a Friday<p>Compensation<p>Salary plus equity package,\nOpportunities to travel and attend/speak at industry events,\nSubsidized membership Gym, swimming pool.\n100% Paid Medical, Dental &#38; Vision benefits, \nCatered hot lunches and breakfasts!\nAfter 6 months you will have the opportunity to work from home once a week.\nAn awesome team who love what they do!<p>Requirements<p>5 years of programming experience with at least 3 years of Ruby and Rails experience,\nGithub profile,\nHelp make UI and UX decisions,\nExperience building and scaling applications with Ruby on. Rails.\nExperience with jQuery, Backbone, or similar JS frameworks, \nRESTful web service API development.\nExperience using and/or building APIs.\n <p>Bonus points if,<p>You blog,\nYou have startup experience,\nYou are familiar with hackathons,\nYou have knowledge of Agile Development Methodology,\nYou know top 30 things you want to do in life,\nYou meet deadlines and you do it all before lunch.<p>Company Overview<p><a href=\"http://sugardoctor.in/\" rel=\"nofollow\">http://sugardoctor.in/</a><p>Sugar Doctor is India's 3.0 healthcare company. The founders are industry veterans with more than 15 years of experience and were the first ones to come up with a specialized diabetes treatment centre in India in 1996. Till date our founders have treated over 150,000 patients from countries like India, US, Qatar, Oman, Saudi Arabia, Yemen, UAE, Iraq, South Africa, Ethiopia, Tanzania and Kenya and still leading the charts. \nUnleash your talent for impacting the life of 347 million people worldwide who have diabetes. Join our team of doctors and growth hackers.<p>How to apply<p>Email us-\takshay@sugardoctor.in<p>Know someone who might be interested? Spread the word and earn $300 if we end up hiring you or someone you refer.","time":1354373709,"type":"comment"},{"by":"jordo37","id":4858616,"parent":4857714,"text":"San Francisco | Fullstack Engineer, Backend Engineer and Frontend Developer | Perfect Audience<p>What We Do: We've built the world's first and easiest Facebook ad retargeting solution, and we have much more ambitious plans. We believe advertising is a critical part of the internet economy, and want to help small business and publishers succeed with solutions that just work.<p>Who We Are: We're a team of four, split between some of us doing the selling and the rest of us doing the building. We want to bring in more designers and developers to help us keep building new features as fast as we can. Ideally these folks will be ready to dive into anything, pitching in when fires come up. But, they will also own some piece of the product where we need expertise.<p>Traction: We are increasing our revenue by 25% every week and it's going to do nothing but accelerate with some big clients we have lined up in the coming months.<p>What we look for in teammates: \nSmart, really smart \nEager to join a growing startup \nHas a “maker” attitude \nGood at communicating (ready to discuss features, bugs, architecture, etc.) \nLanguage never trumps experience - but if you know Rails, Mongo and Javascript things will go faster \nAppreciation for puns and movie quotes \nExperience in advertising is a HUGE plus<p>Backend Engineer\nAbout the Position: We're looking for someone to be the primary backend person at Perfect Audience. This person will guide us as we think about restructuring our data storage and help us prepare for more data influx and more demanding data analysis and visualization.\nWhat we are looking for: \nSolid understanding of database paradigms and architecture\nAbility to look at a series of customer or team needs and help us pull together the right technology, queries and optimizations \nAbility to cover DBA or Sys Admin needs is awesome<p>Full Stack Engineer\nAbout the Position: We're a team of full-stack engineers who enjoy database design, application logic, and standards-based frontends. We are always looking for more smart generalists to come join us. This is a chance to work on every facet of a successful web app and grow your engineering skillset.\nWhat we are looking for: \nSolid software development foundation \nAbility to architect, develop, and test key infrastructure\nUnderstanding of performance and design tradeoffs, without compromising quality\nExperience scaling up webapps and services for rapid growth is a plus<p>Front End Designer / Developer\nAbout the position: We regularly get complimented on our design and interface, but we don't want it to just be better than the enterprise tools - we want it to be delightful. We want a skilled individual to come in and own the design and user experience.\nWhat we are looking for: \nSomeone as comfortable editing masks in Photoshop as tweaking CSS in a text editor \nInnate understanding of, and instinct for, design and user experience \nExperience seeking input from end users \nAbility to carry design from ideation and wireframes all the way through solid HTML, CSS and Javascript \nExperience with enterprise or B2B tools is a plus<p>Contact us at jobs@perfectaudience.com","time":1354388655,"type":"comment"},{"by":"akshxy","id":4857779,"kids":[4857801],"parent":4857714,"text":"User Experience Designer/ Chief Architect<p>Mumbai, Helsinki, San Francisco<p>What’s in it for you?<p>Early mover advantage as we are still a small start-up and building a growth team like those at Quora, Facebook, Slideshare.\nOpportunity to work with really talented engineers, designers and growth hackers to build products that you will be proud of.\nCulture of high performance, flexibility and responsibility with hack days every other weekends. \nYour views will be heard because we strongly believe everybody plays a critical role.\nWork exchange platform if you like balancing multiple projects. \nEnjoys beer/wine/etc… nothing like a cold beer down the pub after work on a Friday.<p>Compensation<p>Salary plus equity package. \nOpportunities to travel and attend/speak at industry events.\nSubsidized membership Gym, swimming pool.\n100% Paid Medical, Dental &#38; Vision benefits. \nCatered hot lunches and breakfasts!\nAfter 6 months you will have the opportunity to work from home once a week.\nAn awesome team who love what they do!<p>Requirements<p>Experience- 3 to 5 years.\nDribble profile or portfolio link.\nKnowledge of HTML5, CSS3, Javascript, Jquery.\nIn-house means work and office at one place and therefore can adjust in our startup family.\nWe expect you to be Dustin Moskovitz and not Eduardo Saverin.\nSense of humor. We work hard but it shouldn’t feel that way.\nIndependent, self-starter who can hit the ground running from day one.<p>Bonus points if,<p>You blog,\nYou have startup experience,\nYou are familiar with hackathons,\nYou have knowledge of Agile Development Methodology,\nYou know top 30 things you want in your life,\nMeet deadlines and you do it all before lunch,<p>Key Responsibilities<p>Creating parallax scrolling websites,\nDeveloping UI drag and drop,\nDesign goodies like a Github store, \nCreating dynamic Infographics,\nInternal promotional materials for print and video,\nDeveloping e-commerce and transaction based applications,\nExtending JavaScript frameworks, Developing UI Controls, Plugins and Widgets.<p>Company Overview<p><a href=\"http://sugardoctor.in/\" rel=\"nofollow\">http://sugardoctor.in/</a><p>Sugar Doctor is India's 3.0 healthcare company. The founders are industry veterans with more than 15 years of experience and were the first ones to come up with a specialized diabetes treatment centre in the country in 1996. Till date our founders have treated over 150,000 patients from countries like India, US, Qatar, Oman, Saudi Arabia, Yemen, UAE, Iraq, South Africa, Ethiopia, Tanzania and Kenya and still leading the charts. \nUnleash your talent for impacting the life of 347 million people worldwide who have diabetes. Join our team of doctors and growth hackers.<p>How to apply<p>Email us\takshay@sugardoctor.in<p>Know someone who might be interested? Spread the word and earn $300 if we end up hiring you or someone you refer.<p>Good designers follow the rules. Great designers understand the rules and then bend them in ways that make products even better for users.","time":1354373876,"type":"comment"},{"by":"flangston","id":4859748,"kids":[4859755],"parent":4857714,"text":"PayByGroup - Senior Developer/Engineer - H1B accepted<p>To apply email joinus@paybygroup.com.<p>ABOUT PAYBYGROUP<p>We're a team of execution-loving dreamers that are backed by prominent angels and VCs, including 500 Startups.  We help people plan and pay together for activities they've always wanted to do with friends and family: from vacations to season tickets. We integrate directly with merchant websites but are in semi-stealth mode so we haven't revealed much publicly.  Our traction has wildly exceeded our expectations; merchants and users alike LOVE our service.  In a nutshell, we're making people's lives better by making collaborative payments a reality on the web.<p>THE POSITION<p>You would be the first full-time, on-shore member of our technical team besides our CTO, who is a badass PhD in machine learning. We're looking for someone that loves building things that improve people's lives.  Do you want to build the next photo-sharing app? Move on to the next job posting please!<p>You will be working to architect and implement many core elements of our platform and shape the direction of the product. You also have the potential to gain status as... wait for it... a co-founder!  Yup, that is how much we value this new potential team member.<p>YOUR SKILLS<p>We're looking for someone who has felt the pain we solve and understands the challenge of getting friends and family together for trips, concerts, and other meaningful life moments and adventures. We are a team of organizers ourselves and maintain a tight feedback loop between our users and how we build the product.<p>We want someone that loves solving challenging problems, from how to architect our merchant integrations to how to optimize the user experience.  Our vision is HUGE.  Like, call-me-and-let-me-tell-you-all-about-it huge.  We're going for a home run and aren't looking back. YOLO!<p>Rails, HTML/CSS, and Javascript are must-haves.<p>Any mobile dev or UX experience is gravy but not required.<p>Speaking of gravy, you must also like cookies, pies, and other bountiful fruits of the best kitchen appliance ever: the oven.  They make frequent appearances at our office.<p>THE GOODS<p>We offer $80-120K and 0.1-2.0% equity commensurate with experience and you can set your preference for salary vs. equity. We're looking for folks who are in it for the long haul as part of a close knit team. Job hoppers need not apply.<p>Extra Perks: What do you dream of?  Work retreats in Tahoe with lunch breaks on the slopes... sweet tech / desk setup... dogs at the office... all of the above! It's all on the table or already done. Let us know what we haven't thought of.<p>THE TEAM<p>We're an experienced founding team with previous start-ups under our belts and a great balance of business and technical chops. Why waste your time with first-timers that don't know what they're doing?  Come learn, grow, and share in fame and fortune with a team that is quickly putting its stamp on world.","time":1354412635,"type":"comment"},{"by":"myenergy","id":4858248,"parent":4857714,"text":"MyEnergy - Boston, MA - FULL TIME: Rails Engineers, Frontend Devs, Designers, and Account Managers (and more!) - <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a><p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers (and others!) to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, has been named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet.<p>We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* DevOps Engineers to scale and deploy our infrastructure, while contributing within our applications as well =&#62; <a href=\"https://www.myenergy.com/careers/devops_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/devops_engineer</a><p>* Frontend Devs to craft and implement amazing and dynamic experiences in our user-facing platform =&#62; <a href=\"https://www.myenergy.com/careers/frontend_developer\" rel=\"nofollow\">https://www.myenergy.com/careers/frontend_developer</a><p>* and Account Managers to support all the fine folks and entities using MyEnergy all across the country =&#62; <a href=\"https://www.myenergy.com/careers/account_manager\" rel=\"nofollow\">https://www.myenergy.com/careers/account_manager</a><p>We're growing very fast and extending our business, and we're also always interested in hearing from driven individuals who think they may have what it takes to help us advance the mission and the business of MyEnergy in ways we may not have thought of or otherwise yet planned to implement. You'll need to be based in Boston, and full of good ideas and the energy to advance them =&#62; <a href=\"https://www.myenergy.com/careers/create_position\" rel=\"nofollow\">https://www.myenergy.com/careers/create_position</a><p>We're HQ'ed in a conveniently located, sunny two-story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1354382036,"type":"comment"},{"by":"urgeio","id":4858170,"kids":[4859016,4862602,4858180,4861099],"parent":4857714,"text":"BERLIN/THE FACTORY, VARIOUS FULLTIME ENGINEERING &#38; BIZDEV POSITIONS<p>Top 5 reasons why you should move to Berlin, now:<p>1. Lowest livings costs with highest quality of living. Stay in gorgeous, perfectly renovated apartments in pre-WWII residential buildings with high ceilings, right in the middle of the center and pay a fraction of costs of any other capital (even cheaper than any Eastern European capital). No need for a car—Berlin has one of the densest subway nets and wide streets make biking fun.<p>2. A vibrant and fast growing ecosystem of smart people. A vast number of new software talents, founders, software companies and VCs are moving to Berlin every day (Twitter, Google, Soundcloud, Early Bird and many more).<p>3. People here are open-minded, outgoing, mix well and international—no need to learn German, everyone speaks English. Making new friends is a matter of days. Visit tons of networking and startup events.<p>4. Easy work permissions—Europeans do not need any and can work from day one and the rest applies for the hassle-free Blue Card.<p>5. Berlin's night life is unmatched, huge and changing every day (plus ridiculously cheap). Berlin has got some of the most dazzling, naughty, and original clubs on the face of the Earth.<p>Berlin is calling and getting the new tech hub of Europe. If you are passionate about building great software, we’d love to talk with you. If you don't live in Berlin yet, we could help to fix that.<p>=&#62; <a href=\"http://urge.io/jobs\" rel=\"nofollow\">http://urge.io/jobs</a>","time":1354380476,"type":"comment"},{"by":"squirrel","dead":true,"id":4857809,"parent":4857714,"text":"Notting Hill, London, England.<p>Our web application is at the heart of our busy e-commerce business; every day it serves millions of product images and handles thousands of purchases - but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, we have a mix of Linux, Windows, and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. We expect developers to be generalising specialists, ready at the drop of a hat to refine an algorithm, write a tricky integration test, tune a SQL query, or discuss feature nuances with a product manager. Our team is growing fast and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us; we're hiring for all technical roles.<p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homeware, and lifestyle categories, many familiar from the high street. The company has about 80 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.","time":1354374657,"type":"comment"},{"by":"arosenappnexus","dead":true,"id":4866089,"parent":4857714,"text":"New York City, New York - AppNexus Inc. (<a href=\"http://www.appnexus.com/\" rel=\"nofollow\">http://www.appnexus.com/</a>)\nFull Time, Experienced Remote Employees will not be turned away<p>At AppNexus, we are building the world’s best advertising technology platform. Our ad server processes 800k ad requests per second at peak time and 40 billion ads daily under strict latency requirements. Adhering to complex targeting and valuation logic, our bidder decisioning engine processes hundreds of thousands of bid requests a second. Our highly resilient log distribution system delivers over 15 terabytes of records daily to our data management framework.<p>AppNexus is on a fantastic growth trajectory. We are one of the best funded startups in NYC and we are in a position to expand our engineering teams in 2013. We welcome top talent across the board, from UI and API engineers to data services, Analytics and User Experience professionals. For example, we are looking for:<p>Ad Server Engineer:\n- 2+ years developing production-level code\n- Outstanding programming and debugging skills in C/C++ (we are selectively open to exceptionally strong Java developers as well)\n- Excellent problem solving skills\n- Fluency with data structures, embedded and distributed systems, and algorithms<p>For more information on open positions check out our Engineering careers page (<a href=\"http://careers.appnexus.com/teams/software-engineering/\" rel=\"nofollow\">http://careers.appnexus.com/teams/software-engineering/</a> ). To see what some our best and brightest have been up to, see our techblog here: (<a href=\"http://techblog.appnexus.com/\" rel=\"nofollow\">http://techblog.appnexus.com/</a> )<p>If you have any questions, please email me (Aaron) directly arosen at appnexus . com.","time":1354551646,"type":"comment"},{"by":"bentaber","dead":true,"id":4857734,"parent":4857714,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour. We're looking for developers and engineers up and down the stack at all levels.","time":1354373139,"type":"comment"},{"by":"lpolovets","dead":true,"id":4858784,"parent":4857714,"text":"Factual is currently hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai.<p>Remote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our new Palo Alto office is still small, so new hires would have a huge impact on the culture there.<p>You can email me personally at leo@factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1354391970,"type":"comment"},{"by":"malandrew","dead":true,"id":4857719,"parent":4857714,"text":"San Francisco, Full-time. No remote work.<p>famo.us - we are the company making HTML5 web apps performant. Go to <a href=\"http://famo.us/\" rel=\"nofollow\">http://famo.us/</a> in a modern browser on desktop and mobile devices to try out our stress test demo built on our JavaScript engine.<p>We are all engineers. Our CEO, Steve Newcomb, is a founder and the former CEO of Powerset (which now powers Microsoft Bing). Om Malik just called us his current favorite startup:\n<a href=\"https://twitter.com/om/status/273081831014952961\" rel=\"nofollow\">https://twitter.com/om/status/273081831014952961</a><p>All positions, except PR/Marketing require very solid HTML, CSS and JavaScript experience, but even for that position it is a huge plus. We're looking for:<p><pre><code>  Senior front-end engineer                $100k—$175k  0.25—1.0%\n  Mid front-end engineer                    $90k—$125k   0.1—0.5%\n  Junior front-end engineer                 $75k—$100k  0.1—0.25%\n  Famo.us Template Design Engineer          $90k—$150k   0.1—0.5%\n  3D and/or Physics Game Engine Engineer   $100k—$175k  0.25—1.0%\n  Documentation Writer                      $75k—$125k   0.1—0.3%\n  PR/Marketing/Social Media                  $60k—$90k   0.1—0.5%\n</code></pre>\nIf you don't know JavaScript like the back of your hand, but are an excellent polyglot programmer that believes web apps are the future and you have skills that you believe would be valuable to us, please apply.<p>Our new office will be at 3rd and King St in SoMa, right across the street from AT&#38;T park and one block from the CalTrain station.<p>Please read Steve's essay \"Cult Creation\" if you are serious about applying: \n<a href=\"http://blognewcomb.squarespace.com/essays/2010/10/14/cult-creation.html\" rel=\"nofollow\">http://blognewcomb.squarespace.com/essays/2010/10/14/cult-cr...</a><p>Apply via AngelList: <a href=\"https://angel.co/famo-us#recruiting\" rel=\"nofollow\">https://angel.co/famo-us#recruiting</a><p>If you have any <i>questions</i>, email me at andrew+jobs@famo.us","time":1354372761,"type":"comment"},{"by":"biodave","dead":true,"id":4858033,"parent":4857714,"text":"<i></i> Rails Engineer at One Medical Group in San Francisco, CA <i></i><p>Come re-invent health. Make a difference in people's lives.<p>Fully agile Rails, Javascript shop with lean UX design, continuous deployment and other good such.<p>You'll work on challenges ranging from health visualizations, clinical workflows, mobile tools and lifestyle engagement apps.<p>One Medical is a next-generation network of high-tech primary care practices designed to reinvent what health care should be in the modern era.  Using innovative technology and process redesign, patients receive a convenient, accessible and transparent health care experience that’s unlike any other.<p>Apply Here:\n<a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?nl=1&#38;k=Apply&#38;j=oZtTWfw1&#38;s=LinkedIn\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?nl=1&#38;k=...</a>","time":1354378670,"type":"comment"},{"by":"davidblondeau","dead":true,"id":4858750,"parent":4857714,"text":"Burlingame, CA (next to the San Francisco airport)<p>Collaborative Drug Discovery (CDD - <a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>) is the first real SaaS informatics platform. Every day, scientists around the world use CDD to manage, analyze and collaborate around their data. This type of collaboration is crucial to research on under-funded diseases like Tuberculosis and Malaria and strategic for many players in the industry. Our long list of customers includes academic labs, biotechs, pharmas, government agencies and worldwide foundations like the Bill &#38; Melinda Gates foundation.<p>We think the world has seen too many ugly scientific applications. We care about usability and details. Our team ships code quickly and iteratively. We think design and community management are as important as great technology.<p>We believe a few great people can make a big difference. We strive to embody our name and empower every CDD employee to do their best work. This means working collaboratively, and giving every person ownership and responsibilities.<p>++Senior Software Engineer++<p>As an engineer, you will have a huge impact on how we design, build and deliver our application. You should be a generalist and enjoy working across the software stack. Our current technologies include Ruby (Rails), MySQL, Javascript, Java, and Solr.<p>We look for engineers who love finding efficient, thoughtful, and highly useable solutions to a variety of technical and product challenges. You should strive to write efficient, maintainable code and you should enjoy fast iterations.<p>Sample projects include:<p>* Designing a flexible model and flow that allow scientists to invite collaborators and selectively share data with them.<p>* Building and maintaining an API for third party developers and integrations.<p>* Developing interactive graphical representations for the analysis of chemical and biologic data.<p>* Optimizing import, export and computation of large data sets.<p>To apply, please contact work@collaborativedrug.com with your resume, cover letter, and links to things you’ve built.","time":1354391451,"type":"comment"},{"by":"kylecsteele","dead":true,"id":4858158,"parent":4857714,"text":"Software generalist to join us in Austin at top accelerator. Help us finish building in 3 months and launch product at sxsw, then consider staying with us afterwards. Here's stack: <a href=\"http://doccaster.blogspot.com/2012/11/no-turkeys-allowed.html\" rel=\"nofollow\">http://doccaster.blogspot.com/2012/11/no-turkeys-allowed.htm...</a>","time":1354380263,"type":"comment"},{"by":"n9com","dead":true,"id":4858631,"parent":4857714,"text":"FIPLAB - Full time remote iOS/Mac developer<p><a href=\"http://www.fiplab.com/aboutus/careers/\" rel=\"nofollow\">http://www.fiplab.com/aboutus/careers/</a><p>Work with us on building apps used by millions. 400k+ daily active users / 10 million+ app downloads to date. Growing revenues by 300% year on year. Partnered with the biggest names in tech.","time":1354388951,"type":"comment"},{"by":"amund","dead":true,"id":4858446,"parent":4857714,"text":"Trondheim, Norway | Python developer | freelance/remote<p>contact: jobs@atbrox.com\n--\nkeywords: Tornado, Python, REST/websocket apis, big data/hadoop<p>see <a href=\"http://atbrox.com\" rel=\"nofollow\">http://atbrox.com</a> and <a href=\"http://atbrox.com/about/\" rel=\"nofollow\">http://atbrox.com/about/</a>","time":1354385471,"type":"comment"},{"by":"psota","dead":true,"id":4868824,"parent":4857714,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers--UI/UX, frontend, backend data mining/algorithms.  See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1354581168,"type":"comment"}]]}