{"comments":[[{"by":"lutorm","id":3652270,"kids":[3652986],"parent":3652041,"text":"I have a plea for those posting: <i>Please</i> tell me <i>what</i> you do so I know if that's something I'm interested in.<p>Example (not personal, you were just the top post right now): \"Etsy.com is hiring all kinds of positions from engineering to design to marketing. Come join an awesome team...\"  I have no idea what you do or why that should interest me.<p>As opposed to: \"Lot18 (<a href=\"http://www.lot18.com\" rel=\"nofollow\">http://www.lot18.com</a>) is revolutionizing the way people buy wine and epicurean products online.\" Thank you, now I know whether I should continue reading based on whether that's something that interests me.","time":1330613674,"type":"comment"},{"by":"200902","id":3652360,"kids":[3652456],"parent":3652041,"text":"Cyrus Innovation - New York, NY or Boston, MA<p>Ruby Developer (Full Time)<p>Cyrus Innovation is a profitable and growing Agile software development company that was founded in 2003. With offices in Boston and New York City, we provide on-site XP teams to start-up and enterprise level companies and create custom web based applications on the back end side. As we continue to grow in both locations, we are looking for people who are equally passionate about Agile and programming to join our great team!<p>What we offer:\n- Great pay and benefits (health, dental, vision, 401(k))\n- Generous vacation, sick time policy, and 1 month of paid time off for professional development\n- No / minimal travel\n- The opportunity to have a real voice in critical design decisions\n- 40 hour work weeks for great work/life balance<p>You will enjoy:\n- Working with a true XP team (TDD, pair programming, continuous integration, daily stand-ups)\n- Working alongside bright and analytical developers\n- Working with the latest technology (Ruby on Rails, Scala, Node.js, MongoDB)\n- Collaborating on all stages of software development from design to implementation<p>What we’re looking for:\n- Experience working with Ruby or Java (3 years or more) and some exposure to Agile methodologies\n- Team oriented work demeanor\n- The desire to learn from and mentor fellow employees\n- The ability to adapt to various cultures and environments\n- A true demonstrable passion for coding<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. We care more about your desire for clean code than your years of experience. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you. Our commitment to our employees is unparalleled and we invite you to join our team.<p>To apply for a position please send a resume to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1330614767,"type":"comment"},{"by":"agotterer","id":3652116,"parent":3652041,"text":"New York, NY<p>Lot18 (<a href=\"http://www.lot18.com\" rel=\"nofollow\">http://www.lot18.com</a>) is revolutionizing the way people buy wine and epicurean products online.<p>Hiring:<p>* Software Engineers (primarily Python)<p>* Frontend Engineers<p>* Director of Engineering<p>* Data Engineers<p>Why you should work here:<p>- We work with a ton of great technologies: Python, gevent, gunicorn, Tornado, JavaScript, Chef, git, Vagrant, PHP, MySQL, Linux, Apache, nginx, HAProxy, Amazon Web Services, Varnish, memcached, Capistrano, jQuery and more.<p>- Well funded. We’ve raised $45M from NEA, Accel &#38; FirstMark.<p>- People actually use our product. Over 1M registererd users since we launched in Nov 2010.<p>- We have a real business model and process 7 figures a month in transactions.<p>- Benefits: Competitive salary, stock options, medical/dental paid in full, unlimited vacation, plenty of wine, dev kegerator, foosball/ping pong lots of challenges and interesting business/tech problems to solve.<p>Apply by emailing jobs@lot18.com.","time":1330611315,"type":"comment"},{"by":"apaprocki","id":3652084,"kids":[3652129,3656837],"parent":3652041,"text":"New York City / London - Bloomberg LP (<a href=\"http://www.bloomberg.com/careers\" rel=\"nofollow\">http://www.bloomberg.com/careers</a>)<p>We aggregate, scrub, produce, analyze, distribute all of the data in the world that drives our market economies. We know how to process data efficiently and at an enormous scale. We apply the same principles of dealing with market data to other sectors such as government, law, and even sports. We hire people that thrive on challenges and can hack on systems to meet these challenges in the best way possible.<p>We run our own datacenters, containing the biggest/best hardware available in the world. We run one of the largest private networks in the world and connect to more primary data sources than anyone else. Incoming market data rates exceed 45+ billion messages a day.<p>If these challenges interest you, check the listings online for something that sounds interesting, apply mentioning me, and/or e-mail me to get in contact.","time":1330610967,"type":"comment"},{"by":"phillytom","id":3652167,"kids":[3652840,3652773],"parent":3652041,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>We're hiring at Monetate. We've hired great people from HN.<p>We're a SAAS provider of testing, targeting, merchandising, agile content tools, primarily in internet marketing. We're funded by First Round  and OpenView (among others).<p><a href=\"http://jobs.monetate.com/\" rel=\"nofollow\">http://jobs.monetate.com/</a><p>* We're looking for backend engineers who want to work on data and real-time API problems at scale.<p>* We're also hiring front-end developers who want to help build and test experiments and own our client facing UI. You should be experienced in working with production-quality cross-browser HTML/CSS and Javascript with and without frameworks.<p>* Also hiring in QA and project management<p>We have fun problems at scale, great people to work with, and we get instant feedback from our clients on everything we put out! We're having a blast.<p>Feel free to email me with any questions - tjanofsky monetate com","time":1330612198,"type":"comment"},{"by":"kungfooey","id":3652222,"kids":[3652294],"parent":3652041,"text":"Stratasan (stratasan.com) - Nashville, Tennessee<p><i>Python Developer</i><p>Prior experience with other web-stack languages is fine (Ruby/Rails, PHP, Perl, etc), as long as you're willing to learn Python. Remote is an option for the right candidates, but we have a strong preference for someone local or willing to relocate.<p>We're a small startup in the healthcare sector. We take data from public and private sources and allow healthcare companies (hospital systems, non-profits, etc) to look at markets from multiple angles. Our biggest competitor is Thomson Rueters. More information on our full job post on GitHub: <a href=\"https://gist.github.com/1827430\" rel=\"nofollow\">https://gist.github.com/1827430</a><p>Currently our team consists of two developers (and an intern), with 20+ years of programming experience between us. We are lazy developers, so we like to do things correctly the first time around (this means unit tests, readable code, etc.) so we can go home and be with our families.  Rockstars, ninjas, and studs need not apply. If this sounds like a good fit for you, email us. We would prefer a mid- to senior-level developer, but if you're a junior and looking for mentorship in the trade, we still want to talk to you.<p>You can email jobs@stratasan.com, or email me directly at brian@ (same domain).","time":1330613019,"type":"comment"},{"by":"diego","id":3652508,"parent":3652041,"text":"My team at LinkedIn (Search) is hiring engineers and engineering managers. We are in Mountain View, CA. Full-time only, and we can sponsor H1B. We are building reusable infrastructure, some of which we'll probably release as open source according to the LinkedIn tradition (see my blog post about it, <a href=\"http://diegobasch.com/open-source-and-big-data-two-things-i-love-ab\" rel=\"nofollow\">http://diegobasch.com/open-source-and-big-data-two-things-i-...</a> )<p>Apply here:<p><a href=\"http://www.linkedin.com/jsearch?keywords=search+engineer&#38;company=linkedin&#38;searchLocationType=I&#38;countryCode=us&#38;page_num=1&#38;pplSearchOrigin=MDYS&#38;sortCriteria=R\" rel=\"nofollow\">http://www.linkedin.com/jsearch?keywords=search+engineer&#38...</a><p>Or contact me if you prefer. My email is in my profile.","time":1330616480,"type":"comment"},{"by":"TimothyFitz","id":3652301,"parent":3652041,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\".<p>Yes, your day job will be writing code. But that's the only similarity to a big company software job.<p>You'll be challenged to take big ideas and turn them into concrete testable hypotheses. Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>More details and how to apply <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1330614053,"type":"comment"},{"by":"kristjan","id":3653306,"parent":3652041,"text":"San Francisco, CA - <a href=\"http://singly.com\" rel=\"nofollow\">http://singly.com</a>, Node.js\nInfrastructure and Frontend Engineers, Full time, Remote OK<p>Singly, sponsoring The Locker Project (<a href=\"http://lockerproject.org\" rel=\"nofollow\">http://lockerproject.org</a>), is building an open source data locker to put you in control of the information you have on N services, and an application platform to make it all useful. We believe end-users should have absolute power over how their data is stored and used, and developers should be able to build on it without setting up servers or authing infinity service (we do it for you). We've just launched to developers (come play!) and are looking for people who {heart} data and want to charge through scaling and design iterations with us.<p>Apply through <a href=\"https://singly.com/#About-WorkWithUs\" rel=\"nofollow\">https://singly.com/#About-WorkWithUs</a> or kristjan@singly.com, or just come hang with us in #lockerproject on Freenode.","time":1330626251,"type":"comment"},{"by":"mdelagra","id":3652605,"parent":3652041,"text":"Leapfrog Online is looking for a talented Chicago-area Python engineer to work in our Evanston office.  Our Python engineers build and maintain high-traffic web sites using the Django web framework. We offer a great working atmosphere, a strong focus on work-life balance, and tremendous opportunities to learn new skills and technologies. We also have competitive salaries and benefits and close-knit teams who like what they do.<p>As we principally focus on the web, we look for real-world experience using Python application frameworks (such as Django) to build high-traffic web sites and applications. Experience with other languages is welcome. What are the extras we look for? Experience producing and consuming web services (SOAP, REST, XML-RPC); experience working with message-oriented systems (AMQP or other message, pub-sub and task queues such as Celery); deep knowledge of version control systems (especially Mercurial or Git); an interest in non-RDBMS data stores (CouchDB, MongoDB, Redis); knowing what it really means to develop RESTful applications; and, experience with functional and declarative programming models in addition to object-oriented development.<p>If you're a bright, self-motivated engineer who enjoys using open source software to solve interesting problems, you’re our kind of programmer, and we’d like to talk to you. You can apply on our site, where you'll also find full job descriptions and information about Leapfrog Online: <a href=\"http://www.leapfrogonline.com/who/careers/\" rel=\"nofollow\">http://www.leapfrogonline.com/who/careers/</a>","time":1330617756,"type":"comment"},{"by":"eapen","id":3655631,"parent":3652041,"text":"San Jose, CA - Milo.com, part of eBay<p>Milo's goal is to list every product on every shelf in every store. We have a noble goal of trying to help shoppers find products in store. Surprisingly, the vast majority of people still do most of their shopping in stores and we help them shop wisely. How? We show you the different pricing options and the distances to stores so you can decide if it is cost- and time-effective to go shop at a local store or use other options. In my opinion, we complement eBay shopping pretty well.<p>I joined this team as a data engineer a few months back and really enjoy the work environment. We still retain the startup culture (read more on the website) and also get the benefits of the larger company (eBay), which includes technical expertise and operational support.<p>We are currently looking for data engineers (and quite a few other positions as well). I work on the data team and we get to do a variety of interesting and technically challenging projects. You get to learn how the different pieces of the puzzle fit together and interact with different teams. I have the joy of working with some really smart people. I can honestly say, I look forward to going to work every day after having worked from home for the past couple of years at my previous job.<p>But, I have to warn you, once you get a taste of Milo, you may not want to go anywhere else...<p>Oh... and we mainly use Python and we are going to Pycon as well. Check out the website for more: <a href=\"http://milo.com/jobs\" rel=\"nofollow\">http://milo.com/jobs</a><p>PS. Feel free to shoot me an email if you have any questions.","time":1330670475,"type":"comment"},{"by":"dabent","id":3653413,"parent":3652041,"text":"Santa Monica, CA (Los Angeles Area), also Austin, TX<p>TRUECar - Put simply, we bring transparency to auto pricing and so far we are getting a solid piece of a huge market.  We just hired someone from an HN Who's Hiring post here last month and he's loving it so far.<p>* Java - Build our core framework.  We're looking for architects who can solve hard scaling and big-data problems and developers who are smart and get things done.<p>* Python - Build our websites using Python with Django and Flask.<p>* Front-End engineers - HTML/CSS/JavaScrpt/jQuery.<p>* QA Engineers - Find the bugs I create.<p>* Database Developers - We store a lot of data on car sales, etc, and need people that can handle large scale date with a high volume of traffic.<p>* Non-Technical - We're also looking for account managers (in Santa Monica), area sales managers (in various cities).  Contact me for details.<p>As I mentioned, we just hired an excellent front-end developer from the \"Who's Hiring\" thread last month.  He's loving it here as am I.  I found TrueCar at PyCon 2011 - come visit us at PyCon 2012!<p>The Python team in an open workspace that has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>), and all the Santa Monica offices are blocks from the beach.  They have great benefits, including company equity, 100% paid family medical, dental, vision, and a healthy 401k.  They also offer gym membership reimbursement ($50 a month), 12 holidays, career training, 3 weeks PTO and have a kitchen stocked with fruit, snacks and such.<p>If you're interested, send me your resume.  My email is in my profile.","time":1330627503,"type":"comment"},{"by":"equark","id":3652766,"parent":3652041,"text":"Remote / New York City / San Francisco / Cambridge MA<p>Sense - A next-generation platform for data and statistics.<p><a href=\"http://www.senseplatform.com\" rel=\"nofollow\">http://www.senseplatform.com</a>.<p>We're a small, early stage startup with a huge vision for data and statistics.   We're working on extremely hard and intellectual stimulating problems and have an amazing bit of core technology. Join a team of three, including 2 PhDs.<p>We are looking for a Lead Designer and have an ongoing need for quantitatively oriented developers of all stripes.<p>Quantitatively-Oriented Developers:<p>- Degree in computer science, statistics, or quantitative field.  PhD or masters a major plus.<p>- Language polyglot and willingness to hack Javascript, C++.  LLVM, OpenCL a plus.<p>- Familiarity with big data ecosystem (NoSql, Hadoop, Graphlab, Spark, Mesos).<p>- Experience with technical computing and data analysis tools (R/SAS/SPSS/Stata/Matlab)<p>- Desire to improve how organizations use data and statistics.<p>Lead Designer:<p>- Experienced UI designer to drive our product vision.<p>- Pixel-perfect aesthetic.<p>- Interest and experience in data visualization.<p>- Knowledge of Javascript a major plus but not required.<p>- Love science.<p>Competitive salary and opportunity for significant equity.  Flexibility in terms of location for the right candidate, although NYC preferred.<p>Sound interesting, email: tristan@senseplatform.com","time":1330619469,"type":"comment"},{"by":"dmarble","id":3653520,"parent":3652041,"text":"Palo Alto, CA - Full-stack Web Developer - LOCAL or REMOTE (full-time preferred)<p>We're one of the thousands of startups doing social networking. Our focus is on groups and events.<p>We've built a real-time stack of our own that bridges backbone.js &#60;-&#62; socket.io &#60;-&#62; gunicorn+gevent &#60;-&#62; django. The web application is nearly all single-page architecture, with both web and mobile making use of an API. We use coffeescript pretty much everywhere.<p><pre><code>    * backend: python, django, gevent, gunicorn, nginx, postgres\n\n    * frontend: coffeescript, jQuery, backbone.js, socket.io, compass\n</code></pre>\nWe're looking for an advanced full-stack web developer. You know a lot about several or all of the above. Backend/frontend/query optimization/deployment.<p>We'll be growing our user base very soon -- we've amassed a small army of interns at most colleges around our initial metro launch area and need knowledge/experience optimizing and scaling the above technologies. We're on the lookout for those who want senior developer ownership and can be mentors/leaders as we grow.<p>I'll be at PyCon.<p>gmail - davidmarble","time":1330629056,"type":"comment"},{"by":"lpolovets","id":3652462,"parent":3652041,"text":"Palo Alto or Los Angeles or Shanghai strongly preferred, but remote work is possible for exceptional U.S. candidates. Full-time only. H1B is okay for very strong, non-remote applicants.<p>Factual's vision is to be an awesome and affordable data provider, so that developers, startups, and big companies can focus on innovation instead of data acquisition. We believe in openness and transparency rather than proprietariness and obfuscation.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). In late 2010, we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Newsweek, Loopt, and Blekko. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We have job openings for software engineers of all levels. You would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NLP, algorithm design, or Hadoop.<p>If you're interested in the Bay Area office, it just opened in December of 2011 and is very small, so you'd have a significant influence on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1330616044,"type":"comment"},{"by":"hseikaly","id":3652590,"parent":3652041,"text":"The New York Times R&#38;D Lab<p>New York, NY<p><a href=\"http://www.nytlabs.com\" rel=\"nofollow\">http://www.nytlabs.com</a><p>Full time positions in a startup environment with the NYT.\nThe New York Times R&#38;D team works to innovate around new technologies, anticipating consumer behaviors, and building new interfaces for the news. We are also working on ideas incubated in the lab and taking them to market.<p>Data Scientist : <a href=\"https://t.co/Z7prmS27\" rel=\"nofollow\">https://t.co/Z7prmS27</a><p>Front-End Engineer : <a href=\"http://t.co/ZFENuz0t\" rel=\"nofollow\">http://t.co/ZFENuz0t</a><p>Back-End Engineer : <a href=\"http://t.co/gTNlhjrO\" rel=\"nofollow\">http://t.co/gTNlhjrO</a><p>QA Engineer : <a href=\"http://t.co/dIkzHnj1\" rel=\"nofollow\">http://t.co/dIkzHnj1</a><p>Linked Data Scientist : <a href=\"http://t.co/tf3EfZ8j\" rel=\"nofollow\">http://t.co/tf3EfZ8j</a><p>Sales/Biz Dev Manager : <a href=\"http://bit.ly/zJsyg3\" rel=\"nofollow\">http://bit.ly/zJsyg3</a><p>Sales Associate : <a href=\"http://bit.ly/yomeBy\" rel=\"nofollow\">http://bit.ly/yomeBy</a>","time":1330617562,"type":"comment"},{"by":"jwegan","id":3652948,"parent":3652041,"text":"Palo Alto, CA<p>(H1B welcome)<p>Shopkick - <a href=\"http://www.shopkick.com/jobs.html\" rel=\"nofollow\">http://www.shopkick.com/jobs.html</a><p>Shopkick is cross-retailer loyalty platform with over 3 million users. Macy's, Best Buy, Target, Old Navy, General Mills, and Proctor &#38; Gamble are just a few of our partners. We are backed with $20 million in funding from Kleiner Perkins and Greylock Partners. We're still small, but we are growing fast.<p>Here is a recent techcrunch article on us: <a href=\"http://techcrunch.com/2012/01/24/location-based-shopping-app-shopkick-now-3-million-users-strong/\" rel=\"nofollow\">http://techcrunch.com/2012/01/24/location-based-shopping-app...</a><p>A few of the positions we are hiring for:<p>* Mobile developers (iOS &#38; Android)<p>* Server side developers<p>* User experience designer<p>* Copywriter<p>* Marketing, Customer Service, &#38; more<p>Go to <a href=\"http://www.shopkick.com/jobs.html\" rel=\"nofollow\">http://www.shopkick.com/jobs.html</a> for more details and to apply online.","time":1330621733,"type":"comment"},{"by":"bfung","id":3653569,"parent":3652041,"text":"OPOWER  -  Arlington, VA  -  San Francisco, CA<p><a href=\"http://opower.com/\" rel=\"nofollow\">http://opower.com/</a>\n<a href=\"http://opowerjobs.com/teams\" rel=\"nofollow\">http://opowerjobs.com/teams</a><p>Mostly Full-time.<p><a href=\"http://jobvite.com/m?3GtsgfwB\" rel=\"nofollow\">http://jobvite.com/m?3GtsgfwB</a><p>We're especially, but not limited to, looking for Product Managers and Software Engineers to build new features and scale out existing ones.<p>We leverage data and behavioral science to change people's energy consumption habits. Help the environment through energy conservation and help people save money.<p>Java, Rails, Hadoop, smatterings of many other things (scala, python, perl) - we have a culture where taking initiative and having a good design will result in a system being used by other people. Great perks and a chill yet super productive atmosphere.","time":1330629640,"type":"comment"},{"by":"ivanzhao","id":3652736,"parent":3652041,"text":"Inkling, San Francisco, CA<p>Inkling is a publishing startup. We are a new medium, the future of books and publishing (currently with a focus in textbooks on iPad); our platform is so good that completely leaves ebooks in dust, and even most major publishing houses are invested in us.<p>We are hiring engineers of all kinds, from the JavaScript/Python/Scala/iOS to interns. We are Sequoia-backed and just recently secured another round of $17 million funding.<p>The team is lean and flat. Located in the downtown SF, TV-celebrity chef in house, best gym in town, plus generous salary and options.<p><a href=\"http://www.inkling.com/jobs/openings/\" rel=\"nofollow\">http://www.inkling.com/jobs/openings/</a><p>Contact me if you are interested (annemarie@inkling.com)","time":1330619138,"type":"comment"},{"by":"joelg87","id":3652130,"kids":[3652369,3652370],"parent":3652041,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) is looking for PHP and Android developers - Remote, Hong Kong or San Francisco.<p>We're building a widespread consumer product which users really love and shout about. We're a tiny team of 3, but we already have 130,000 users and are profitable.<p>You can work from wherever you are, or wherever you want to be. We care most that you enjoy your work. We're in Hong Kong right now, and we'll be in San Francisco later in the year. You can join us, or work remotely.<p>More details: <a href=\"http://angel.co/buffer/recruiting\" rel=\"nofollow\">http://angel.co/buffer/recruiting</a> and apply from there or email me directly: joel@bufferapp.com","time":1330611622,"type":"comment"},{"by":"healsdata","id":3652250,"kids":[3652317,3653626],"parent":3652041,"text":"King of Prussia, Pennsylvania (near Philadelphia, PA) - ReminderMedia is currently looking for entry-level and senior developers plus a web designer to work on our PHP-based applications.<p>We're currently in the midst of moving our CRM from a homebrew framework to Symfony2, improving test coverage, and \"measuring everything\" so that we can boost performance and usability.<p>Feel free to contact me directly at jcampbell@remindermedia.com or visit our careers page here: <a href=\"http://remindermedia.com/careers/search/state/PA\" rel=\"nofollow\">http://remindermedia.com/careers/search/state/PA</a>","time":1330613395,"type":"comment"},{"by":"chrismueller","id":3654540,"parent":3652041,"text":"Los Angeles, CA (or San Francisco, or Brea...or remote!)<p>DreamHost (www.dreamhost.com) is a successful web hosting company with over 300,000 customers. We’ve been in business since 1997 and offer our clients shared hosting, virtual private servers, dedicated hosting, and domain registration. DreamHost is currently building out our hosted cloud computing products (cloud compute and cloud storage) and we’re also the creators and primary sponsors of the open source project, Ceph. DreamHost is also an awesome place to work and we’re looking for great people to join our team!<p>Hiring:\n* Wordpress Hacker\n* Tech Support QA/Satisfaction Manager\n* QA Engineers\n* Data Center Operations Administrators\n* Linux Systems Administrators and Engineers\n* And many more...<p>Why should I bring my talents to DreamHost you ask?\n* We've got an excellent work environment.\n* We strongly believe in the importance of a work/life balance.\n* Our company is democratic, and strives on creative collaboration.\n* We are working on projects that we believe are important to the future of technology and our world.\n* Our entire organization (read: family) is under 150 people, so you get to see the fruits of your labor.<p>Apply by emailing your resume to 'chris.mueller@dreamhost.com' or directly on our site at <a href=\"http://dreamhostcareers.silkroad.com/\" rel=\"nofollow\">http://dreamhostcareers.silkroad.com/</a>","time":1330643189,"type":"comment"},{"by":"joeshaw","id":3652111,"parent":3652041,"text":"Woven - <a href=\"http://woventheapp.com\" rel=\"nofollow\">http://woventheapp.com</a> - Boston, MA, USA or REMOTE (also extraordinary INTERNs)<p>We are working to bring all of your digital photos, no matter where they are, back into the forefront of your life.  Our manifesto is described in detail here: <a href=\"http://blog.woventheapp.com/2012/01/17/our-photo-manifesto/\" rel=\"nofollow\">http://blog.woventheapp.com/2012/01/17/our-photo-manifesto/</a><p>We are a small and geographically distributed team.  Our backend is written in Python using Flask and we use Mongo and Redis for storage.  People have thousands and thousands of photographs and we're already beginning to deal with interesting challenges in scaling, and we expect things to become more challenging and fun as we grow.  We have viewer apps for Android and iOS and will be expanding upon that soon.<p>An incomplete list of positions we are hiring for is here: <a href=\"http://blog.woventheapp.com/careers/\" rel=\"nofollow\">http://blog.woventheapp.com/careers/</a> but to summarize them:<p>* Backend Engineer (DevOps)<p>* iPhone Engineers<p>* Test Engineers<p>* Project Managers<p>In addition I think we would be interested in people with experience in areas like Android development, Windows and Mac application development, machine learning, and image processing.<p>If you'd like to learn more, feel free to email me at joe@&#60;my hn username&#62;.org.  Visit the careers page linked above to apply.","time":1330611272,"type":"comment"},{"by":"rgrieselhuber","id":3653292,"parent":3652041,"text":"Mountain View, CA or Tokyo, Japan office (remotes considered)<p>Ginzametrics - <a href=\"http://www.ginzametrics.com\" rel=\"nofollow\">http://www.ginzametrics.com</a><p>We're hiring: Full Stack Developer<p>What we do:<p>Ginzametrics is an SEO and inbound marketing management platform for the enterprise market.<p>Our customers are large ecommerce, tech, agencies and media companies who have complex SEO operations, often in many countries around the world.<p>What we're looking for:<p>We're a small team building a big product for demanding customers. Almost all of us (including me, the CEO) contribute to building the product every day. We're looking for one more developer who can code on the entire stack of our application. On any given day, we are improving our web crawlers, rewriting analytics modules or hacking with JavaScript on our new (soon to be released) UI. We need another great person to help us grow.<p>Ideally, you'll have some background in at least one or two of the following:\nbuilding a big data analytics product, large-scale web crawling, social network platforms &#38; APIs (Facebook, Twitter, etc.), online marketing and advertising, international customers.<p>Why you should work with us:<p>We exist in a great, underserved market that is growing quickly. We're the only company in our space that actually delivers on the promise of enterprise scale and sophisticated functionality. We're well-funded and have solid revenues from awesome customers. Our team is small, scrappy and energetic. We'd love to hear from you.","time":1330626050,"type":"comment"},{"by":"brookevd","id":3654502,"parent":3652041,"text":"San Francisco (Union Square)<p>Justin.tv is building the ESPN of gaming in Twitchtv.<p>TwitchTV is growing FAST, adding millions of users every month.  We are looking for talented engineers who have experience building websites at scale. (bit.ly/AnPTwI)<p>We’re a small team with big ambitions, an intense passion for our work, and a no bullshit atmosphere.  We're looking for great people to join an already world class team.<p>Either apply via the link above, or feel free to email me directly at brooke@twitch.tv if you have questions.","time":1330642383,"type":"comment"},{"by":"DavidChouinard","id":3652169,"kids":[3652277,3652208],"parent":3652041,"text":"FlightAware (flightaware.com) — Houston, TX (no REMOTE, no H1B)<p><i>Front-end (UI/UX) Developer</i><p>Here’s a profile of us from 37signals (we do flight tracking software, 2M+ pageviews a day): <a href=\"http://37signals.com/svn/posts/2780-bootstrapped-profitable-proud-flightaware\" rel=\"nofollow\">http://37signals.com/svn/posts/2780-bootstrapped-profitable-...</a><p>We have very interesting data visualization and UI problems and your work will reach millions of users. We've also released a bunch of open source projects. You get top-of-the-line Apple gear and our kitchen is always stocked with snacks and beverages, including a free (!) beer kegerator. We’re a fun, high-caliber team that trusts you and gives you the freedom to be brilliant.<p>We’ve been around for a while, but we’re still growing like mad. Compensation is very competitive.<p>Who you are:<p>• You have a trail of cool projects you’ve worked on, including some you’ve written to scratch your own itch.<p>• You obsess over the design of everyday things, from door knobs to teapots or light switches.<p>• You have a passion for software and desire to change the world.<p>• You have excellent implementation skills, including deep expertise in Javascript (jQuery).<p>• You enjoy working on tricky UI problems with equally smart people.<p>You can apply on our website: <a href=\"http://flightaware.com/about/careers/position/frontend_developer\" rel=\"nofollow\">http://flightaware.com/about/careers/position/frontend_devel...</a> or shoot me an email: david.chouinard@flightaware.com","time":1330612219,"type":"comment"},{"by":"nfcam","id":3652679,"parent":3652041,"text":"London, UK – remote ok, but local much preferred<p>Our web start-up, which indeed is innovative and focuses on providing students with course media at cheapest prices, looks for a Web Developer to become our Technical Director.\nWe got accepted into an accelerator programme and already have customers and a working prototype / “Minimum Viable Product”.\nWith your help, we want to develop the full product. You would start with your own distinct modules, and your responsibilities can then increase from there.<p>Technical Skills: \n- Java or other OOP experience \n- Google Web Toolkit (... would be ideal!) \n- Knowledge of SQL<p>Location and Timing:\nThe accelerator programme will last from April to June in London,UK. This will be an intense time of focused working, and a physical presence would be preferable especially then. However, we are open to discuss remote work, in case you can provide the corresponding references of previous work you have done<p>Contact Nils:  \nnfrers \"at\" gmail.com<p>Please include in your note:\n- whether you have a webdesigner you are working with\n- what work arrangement you are offering (Full-time employee, part-time employee, freelance / limited time contract work)\n- what remuneration option you would prefer: (flat fee for work scope, flat rate per month, hourly rate, stock options only)","time":1330618544,"type":"comment"},{"by":"nkohari","id":3652340,"parent":3652041,"text":"AgileZen (Rally Software) - Raleigh, NC<p><i>Interaction Designer</i><p>We build AgileZen (<a href=\"http://agilezen.com\" rel=\"nofollow\">http://agilezen.com</a>), a lightweight project management tool that helps individuals and small teams visualize their work and communicate more effectively.<p>We're looking for someone with a great design aesthetic to help us improve both our marketing site and our application's UI. The ideal candidate will have experience with graphic design, information architecture, user experience and will be an expert in web technologies like HTML and CSS.<p>The position is likely contract-to-hire, but we're willing to skip right to the hire step if you're particularly awesome. :) We're mainly looking for someone in the Raleigh-Durham area that can work out of our office in downtown Raleigh at least a few days a week.<p>AgileZen was co-founded by my wife Niki and me in 2009, and was acquired by Rally Software in 2010. We're now a tight-knit, cross-functional team of 8 people, and we think of ourselves as a small startup inside of a larger company. We're dedicated to helping startups and small teams become better at what they do.<p>If you think you might be interested in working with us, get in touch with Niki at: niki@agilezen.com","time":1330614541,"type":"comment"},{"by":"LisaG","id":3653337,"parent":3652041,"text":"San Francisco CA (remote okay)<p>Crawl Engineer and Big Data Enthusiast<p>We're looking for someone enthusiastic about open source, net neutrality, open data and keeping the web truly open. Common Crawl is dedicated to building and maintaining an open repository of web crawl data in order to enable a new wave of innovation, education and research. If you're looking to do work that matters, come join us!<p>We're set to do amazing things this year, and there is no better place to hone your big data skills than helping us manage and process our 50 TB corpus. Plus, you'll be working within a passionate community and have the chance to interface with plenty of talented researchers, educators, startup folks, and an incredible advisory board.<p>Responsibilities<p><pre><code>  * Improve the stability, scaling, and visibility of our distributed web crawler\n  * Use, improve, and extend our post-crawl, Hadoop-based data processing pipeline \n  * Design and build mechanism for specification and execution of custom crawls\n</code></pre>\nDesired Skills &#38; Experience<p><pre><code>  * You can architect and code for a system with tens of billions of documents\n  * Strong coding ability in Java \n  * Strong coding skills in at least one scripting language (Python, Ruby, Perl...)\n  * In-depth knowledge of HTTP and are familiar with web crawlers\n  * You have development and administrative experience with Hadoop and HDFS\n  * Ops experience with Linux or other UNIX\n  * Some familiarity with AWS, including one or more of EC2, S3, EBS, and EMR\n  * Like to build useful, thorough documentation of code and systems\n  * Self-starter wiling to take ownership of projects\n</code></pre>\n<a href=\"http://www.commoncrawl.org\" rel=\"nofollow\">http://www.commoncrawl.org</a>","time":1330626558,"type":"comment"},{"by":"jdvolz","id":3652897,"parent":3652041,"text":"San Francisco SOMA area: Shop It To Me <a href=\"http://shopittome.com/jobs\" rel=\"nofollow\">http://shopittome.com/jobs</a><p>Seeking: Full time employees<p>About Us:  Do you like pleasing over a million people every single day?  We use Rails and a magic dust sprinkling of JRuby to ensure all our subscribers get the very best deals on apparel from around the internet.<p>Perks:<p>- Work with awesome programmers.  Not a day goes by that I don't learn something new.<p>- Interesting problems: usually in the form of high email volume challenges.<p>- A predisposition to A/B testing and using ideas that come from anywhere.  My offhanded remarks sometimes make it into production A/B tests!<p>- We're profitable and we have been since 2007.<p>- A diverse team: want to work with smart non-programmers?  We have them in spades.<p>Requirements:<p>- Predisposition towards action<p>- Eagerness to learn<p>- Experience with our stack: Ruby on Rails, JRuby, MySQL, Javascript et al.<p>- Strong object orientated knowledge<p>- Fluid communication skills (both written and spoken)<p>Get started:<p>Email Josh at jvolz@shopittome.com.  Include a Github link (or other code examples) and your standard resume.  In the email tell me two things:  [1] why you are interested in Shop It To Me and [2] Why you think you're a good fit with us.<p>Millions of our customers are waiting for your good ideas.","time":1330621177,"type":"comment"},{"by":"bkudria","id":3654071,"kids":[3654316],"parent":3652041,"text":"Yammer is hiring engineers in SF and London, and a bunch of other non-engineering positions in London/NYC/AUS/elsewhere. Full jobs listing at <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>Yammer is basically a social network for the enterprise, but Yammer isn't just where you <i>talk</i> about work, it's increasingly where you <i>do</i> work.<p>Large corporations are really inefficient and hierarchical and Dilbert-y, and we build software that treats every employee as an empowered human being. We have a success-story video on our site from Supervalu, a large retail store chain in the US, and their CTO tells a story about how Yammer <i>literally</i> changed the way they do business. In the old world, store managers would report their intelligence up the managerial chain, the upper management would try to synthesize everything, and 3 months later a \"report\" would be issued that told everyone how to best try to do their jobs. After Yammer, store managers would just talk to each other over Yammer, learn directly what was successful and what wasn't, and as a side effect, let the upper management gain invaluable visibility into day-to-day operations. When we say Yammer \"breaks down silos\" and \"enables horizontal communication\", this is what we mean. Sure, Yammer is just like Facebook, but we're so much more than that. Corporations don't share cat pictures, they turn into efficient business machines.<p>Supervalu testimonial video: <a href=\"https://www.yammer.com/customers\" rel=\"nofollow\">https://www.yammer.com/customers</a>\nIn fact, Supervalu isn't the only company that has changed the way they work due to Yammer. We have tons of examples at that link. Yammer is used by 85% of the Fortune 500.<p>Yammer is expanding. We just raised an 85MM round, reflecting a valuation that puts on right up there in the enterprise software space. We're growing quickly and we need strong capable solid engineers to help us. We have an excellent technical platform but we need to scale more. This is where you come in. We're looking for engineers of all stripes, be it Ruby/Rails, JS/Node, Java/Scala, Obj-C/iOS/Android, or other. Again, full list at <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>If you're remotely interested in solving real engineering problems at scale, for a serious application, I urge you to get in touch. My email is bkudria@yammer-inc.com, and you can ask me any questions about Yammer that you'd like.","time":1330636401,"type":"comment"},{"by":"sebilasse","id":3652587,"parent":3652041,"text":"Amsterdam, Netherlands, Part/Full-time, remote work possible.\n--------------------<p>The Energy Transition Model (ETM) is looking for an experienced developer in one or more: Ruby, Rails, Javascript (jQuery, backbone.js, CoffeeScript, etc). You follow the 20%/80% rule, prefer to re-use then to program and seemlessly switch from big picture to implementation details.<p>We answers questions like: \"If everybody switched to electric cars, how many solar plants have to be built?\". It is used by governments, companies, teachers to evaluate strategies dealing with events like peak oil, diminishing gas reserves and new technologies.<p>Quintel develops the ETM and is a charming Dutch (grown up) startup, with a central office in the center of Amsterdam. Our engineering-driven team (91% engineers, PhDs etc) get the work done during office hours, so that we can enjoy our evenings, sometimes together with afterwork-beers. The atmosphere goes from professional consultancy to monkey house in no time.<p>Our codebase has something for everyone. 30% plain Ruby, 30% Javascript, 30% Rails and 10% other code. We have good code, bad code, tested code, untested code. We have DSLs (for our non-programmers), API, fast ec2 instances for calculations. Things we did before: Git as a database, custom query language to extract data from the model, massive processing within a rails request (think thousands of ruby objects calculating energy flows). Visualizations with Raphael.<p>You are an experienced developer, you think lean and solve problems creatively. You're proactive, fix first, complain later. You live in (ordered by preference): Netherlands, Europe, World. You'll work the first months onsite, thereafter you may go abroad and work remote (again). Current dev team has an international background: Italian, British, Dutch, Swiss, US.<p>Reactions to: dennis@quintel.com","time":1330617531,"type":"comment"},{"by":"olivercameron","id":3653416,"parent":3652041,"text":"Palo Alto/Menlo Park, CA - Lead Designer - Full Time<p>Everyme is looking for a lead designer. We're building the true social network, backed by the address book. We do an incredible amount of intensive computations, but everyone we have showed the product to is surprised by how we've managed to keep the UI beautiful, simple and focused. We like to think we're a dream home for a designer, as every one of our 5 engineers all implement PSDs to the pixel. We're looking for someone who has designed iOS/Mac apps before, and has a keen eye for pixel perfection.<p>You'll be challenged on a daily basis to make our complex algorithms look simple to the end user. MG Siegler wrote a great post on us, which has a little more info about Everyme[1]. We've raised $1.5m from CrunchFund and others (Andreessen Horowitz, Greylock, SV Angel).<p>To apply, please email oliver at everyme dot com with some of your previous work.<p>1. <a href=\"http://parislemon.com/post/11647475506/your-true-social-network\" rel=\"nofollow\">http://parislemon.com/post/11647475506/your-true-social-netw...</a>","time":1330627571,"type":"comment"},{"by":"Mantrout","id":3653348,"parent":3652041,"text":"Seattle WA (Full time, H1B)\nAmazon Web Services (AWS) \nAlthough AWS has MANY open positions, this one is mine and I'm very excited about it. Very new team, about to make our 1st production release within the month.<p>We're focused on better tools for cloud developers. I want the experience of developing on AWS to be magical: less manual touch points, less upfront investment to get started, and overall happier users of AWS. If you're the kind of person that writes little scripts to make your job easier, or entire tool chains, then I'd love to talk with you.<p>We're programming in Java and Ruby, we use Git, and we're really excited about what we'll do next.<p>Here are the job descriptions:\n<a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=166013\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=166013</a>\n<a href=\"http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=166014\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/ref=j_sq_btn?keywords=166014</a><p>Happy to chat, you can reach out to me at troutman@amazon.com","time":1330626682,"type":"comment"},{"by":"bijanv","id":3652641,"parent":3652041,"text":"Toronto, Canada<p>EventMobi is looking for talented Backend Engineers, Front-end junkies and Support Genius passionate about being in the mobile space! (<a href=\"http://eventmobi.theresumator.com/\" rel=\"nofollow\">http://eventmobi.theresumator.com/</a>)<p>The internet is being reborn on mobile and we at EventMobi are using it to revolutionize the events industry.\nEventMobi is the leading mobile platform for shows and conferences, having been used by over 500 events, 1 Million users, and are served in 5 languages across 5 continents. Clients like Disney and Motorola have used EventMobi to disrupt and enhance the attendee experience at their events.<p>Yet we're still only 4 engineers, looking to build up our core team as we scale.<p>Our backend stack uses Nginx, Redis, Jenkins on Amazon services and our mobile apps run on Backbone.js, Handlebars, Node.JS and Socket.IO. We love using new tech and looking for developers that love playing around with all parts of the stack!<p>If you feel this is a place you would fit well in, email me at work@eventmobi.com","time":1330618104,"type":"comment"},{"by":"wdewind","id":3652216,"kids":[3653592,3652970],"parent":3652041,"text":"New York, Brooklyn, NYC - Etsy.com is hiring all kinds of positions from engineering to design to marketing.  Come join an awesome team, our last engineering hire was Rasmus Lerdorf, creator of PHP.  My contact info is in my profile if you have any questions, otherwise <a href=\"http://www.etsy.com/careers\" rel=\"nofollow\">http://www.etsy.com/careers</a>","time":1330612928,"type":"comment"},{"by":"qba","id":3652412,"kids":[3654881,3655645],"parent":3652041,"text":"Since no one posted this traditional post yet, here goes:\n(just copied robinwarren's post from last month)<p><a href=\"http://www.maxmasnick.com/guides/jobs/\" rel=\"nofollow\">http://www.maxmasnick.com/guides/jobs/</a><p>======================<p>World wide:<p>Github <a href=\"http://jobs.github.com\" rel=\"nofollow\">http://jobs.github.com</a><p>Jobs Tractor (Developer Jobs - run by me) <a href=\"http://jobstractor.com/\" rel=\"nofollow\">http://jobstractor.com/</a><p>======================<p>US:<p>Crunchboard <a href=\"http://www.crunchboard.com/jobs/\" rel=\"nofollow\">http://www.crunchboard.com/jobs/</a><p>Startuply <a href=\"http://www.startuply.com/\" rel=\"nofollow\">http://www.startuply.com/</a><p>YC Company Jobs: <a href=\"http://news.ycombinator.com/jobs\" rel=\"nofollow\">http://news.ycombinator.com/jobs</a><p>======================<p>UK:<p>CoderStack <a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>Mind The Product (Product Management Jobs) <a href=\"http://mindtheproduct.com/jobs/\" rel=\"nofollow\">http://mindtheproduct.com/jobs/</a><p>Work in Startups <a href=\"http://www.workinstartups.com/\" rel=\"nofollow\">http://www.workinstartups.com/</a><p>Enternships - (Startup Internships) <a href=\"http://www.enternships.com/en/enternships\" rel=\"nofollow\">http://www.enternships.com/en/enternships</a><p>======================<p>Germany:<p>Berlin Startup Jobs <a href=\"http://berlinstartupjobs.com/\" rel=\"nofollow\">http://berlinstartupjobs.com/</a><p>======================<p>Canada:<p>StartupNorth <a href=\"http://jobs.startupnorth.ca/\" rel=\"nofollow\">http://jobs.startupnorth.ca/</a>","time":1330615455,"type":"comment"},{"by":"takrupp","id":3653182,"parent":3652041,"text":"Constitution Group - Quant Trading Recruitment Firm\nRemote / New York / Contract or Full Time<p>We are looking for a C++ developer to help us source and vet candidates.  We would be open to either a contract / hourly basis or a full time hire with commission.  There is definite partnership / equity potential as well, if interested.<p>We are a recruitment firm focused on the quant trading market.  We work with many of the systematic prop trading firms, hedge funds and banks to hire top development, quant and trading talent.  Our firm was started in 2009, and is small, very candidate focused and technology forward.<p>We have an office in NY, but would be open to someone working remotely (Ill be working out of the Dominican Republic next year, for fun).<p>Great opportunity for someone personable who likes reviewing code more than writing code, but would still want to pull in over $100k per year with a lot of life flexibility.  If interested, email trent.krupp@constitutionllp.com","time":1330624701,"type":"comment"},{"by":"vsprabhakara1","id":3653343,"parent":3652041,"text":"SF / Bay Area, FULL-TIME &#38; INTERN<p>beRecruited.com (<a href=\"http://berecruited.com\" rel=\"nofollow\">http://berecruited.com</a>) is disrupting the high school to college athletic recruiting market.  We connect high school students to college coaches across the country, helping students earn scholarships.  We're the largest company in the space, with room still to grow.<p>We're 3 YC founders, we've got over 1 mm registered users, revenue via our freemium service, and plenty of funding from relevant investors.  We're relaunching the site in just a few weeks, and this is a chance to get on board and drive meaningful product development and influence what we do next.<p>We're a small team of 5 looking to add another full-stack RoR developer.<p>Definitely get in touch if you: \n* Combine a strong overall computer science background with a passion for web development, particularly Ruby on Rails\n* You're equally at home writing complex SQL queries, architecting scalable rails services, and building beautiful html/css/javascript interfaces\n* You've demonstrated your abilities writing top-quality web or open source software\n* You have a strong product sense and excellent technical judgement.<p>Here's some recent articles about how we're improving people's lives every day.\n*  <a href=\"http://www.utsandiego.com/news/2012/jan/30/help-for-reaching-the-next-level/\" rel=\"nofollow\">http://www.utsandiego.com/news/2012/jan/30/help-for-reaching...</a>\n*  <a href=\"http://www.nydailynews.com/sports/high_school/2011/09/22/2011-09-22_site_helps_make_matches_between_athletes_coaches.html\" rel=\"nofollow\">http://www.nydailynews.com/sports/high_school/2011/09/22/201...</a>\n*  <a href=\"https://news.ycombinator.com/item?id=3540289\" rel=\"nofollow\">https://news.ycombinator.com/item?id=3540289</a><p>More detail here:  <a href=\"http://howto.berecruited.com/pages/jobs\" rel=\"nofollow\">http://howto.berecruited.com/pages/jobs</a>\nOr email us directly and mention you're from HN: jobs@berecruited.com","time":1330626651,"type":"comment"},{"by":"justin","id":3652769,"parent":3652041,"text":"Exec is hiring in SF. We are an on demand outsourced labor force.<p>We just launched yesterday to generous press coverage. But that's not what is important; what is important is that we are %100 focused on building the product to provide the best customer experiences possible. That means better algorithms for worker dispatch, great UI to communicate a complicated value proposition, and better customer service and operations tools.<p>The team is four people right now. We are looking for a very small number of highly talented people that we enjoy working with. I've been in startups for 8 years and have seen many mistakes. I've made many myself. This startup I'm not going to make any of the same mistakes: we're going to make entirely new ones ;)<p>Job posts here: <a href=\"http://iamexec.com/hiring\" rel=\"nofollow\">http://iamexec.com/hiring</a><p>Join us and invent the future of work. What you do has impact. Those who take the risk will reap the reward.","time":1330619513,"type":"comment"},{"by":"aawecler","id":3652703,"parent":3652041,"text":"New York City<p>At Yodle (www.yodle.com/careers), our mission is simple: We help local businesses succeed. With a combination of rapidly-developing technology, thoughtful data analysis, and expert levels of service, we make online marketing accessible to local businesses. We made the Inc500 list two years in a row and still growing.<p>We have a clear career path in tech for people interested in team leadership and as senior individual contributors.<p>At Yodle, you have an opportunity to make a significant impact because our engineers are provided business problems and asked to design solutions to solve those problems as opposed to being told to build widgets.<p>Hiring<p>-Senior Software Engineer\n-Team Lead\n-Software Engineer in Test\n-IT Analysts<p>Apply by emailing a solution to one of our puzzles or try the apply button attached to one of our job descriptions<p><a href=\"http://www.yodle.com/yodle-careers/departments/technology/\" rel=\"nofollow\">http://www.yodle.com/yodle-careers/departments/technology/</a>","time":1330618806,"type":"comment"},{"by":"ivyirwin","id":3652857,"parent":3652041,"text":"Austin, TX (No Remote, No H1B)\nLooking for Jack-of-all-trades developer (PHP)<p>I run a one-man (plus consultants) web development company (shadyhillstudios.com) in Austin, TX that is growing rapidly. Projects include working with data startups in Silicon Valley, building institutional CMS websites, and custom web applications. I'm looking to hire someone interested in touching all aspects of the business – from project specifications and wire-framing through design development and backend programming to client relations and code maintenance. Only requirement is that you are familiar (1-2 years experience) with OOP and PHP/MySQL. If you have interest in the other stuff, I will help teach you the business. Shoot me an email to learn more or talk options.<p>If anyone wants to meet up to discuss collaboration or work opportunities during SXSW, feel free to send me an email.","time":1330620646,"type":"comment"},{"by":"dman","id":3653351,"parent":3652041,"text":"Enthought - www.enthought.com\nPython development for scientific applications, financial applications and Python toolset development.\nEnthought has offices in Austin, New York, Cambridge, Mumbai.\nIf you use Python and love numpy / scipy then Enthought would be a great place for you. Come work with numpy / scipy hackers on solving interesting scientific analysis and data visualization problems. Also we are building the next generation of Python development tools, so there is no shortage of interesting problems to work on. Send applications to jobs@enthought.com and mention that you saw this on the hacker news Feb 2012 thread. Looking forward to working with some of you.\nIf you have any questions about Enthought, what jobs are on offer and what problems keep us up at night feel free to reach out to me at dsharma at enthought dot com","time":1330626689,"type":"comment"},{"by":"MatthewB","id":3652944,"parent":3652041,"text":"San Francisco/Bay Area<p>Come be the third cofounder (one biz + one hacker so far) at Teamly.com (<a href=\"http://www.teamly.com\" rel=\"nofollow\">http://www.teamly.com</a>). Teamly is a SaaS tool for helping teams be more effective/productive at work. We have very active users, paying customers, and tons of user feedback/data.<p>We are at an awesome point right now - we are about to close our first seed round and have been accepted into a great accelerator program.<p>We are looking for an awesome hacker to join our team as third cofounder. The two main factors we're looking for are technical expertise and more importantly passion/dedication for startups and our niche.<p>Teamly is built on RoR, mysql, chef, less, javascript/jquery, aws, rspec/cucumber, and yml.<p>If you're a hacker with these skills and a passion for startups that  makes your friends and family think you're a little crazy, we'd love to talk to you.<p>matt@teamly.com","time":1330621693,"type":"comment"},{"by":"Aloisius","id":3653324,"parent":3652041,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 13 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Web developers (we're a Python/Django/jQuery/Backbone shop)\n  * iOS developers (Objective-C for iPad and iPhone)\n  * QA Lead (automation/bug squashing dev)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a>","time":1330626442,"type":"comment"},{"by":"shammond42","id":3654107,"parent":3652041,"text":"The health care system doesn't work for patients. But you can help change that. Cambridge, MA based PatientsLikeMe is improving patients' lives by focusing on the sharing of real-world patient data.<p>We've proven our concept and are now looking for several Senior Engineers to join our team as we change the world.<p>As a Senior Engineer, you will be responsible for enhancing, maintaining, and optimizing patientslikeme.com. Not only should you enjoy writing well organized and well tested code, but you should also enjoy working with a brilliant group of teammates and stakeholders to solve hard problems in both software engineering and science.<p>See <a href=\"http://www.patientslikeme.com/about/careers/1-experienced-ruby-on-rails-developers\" rel=\"nofollow\">http://www.patientslikeme.com/about/careers/1-experienced-ru...</a> for more details.","time":1330636864,"type":"comment"},{"by":"ladon86","id":3652895,"parent":3652041,"text":"ClassDojo\nFULLTIME or INTERN in PALO ALTO, CA<p>ClassDojo is used by thousands of teachers to manage students’ behavior in the classroom, using real time feedback and rewards that can also be shared with parents.<p>We're an edtech startup funded by some of the biggest names in the valley, and we're one of the fastest growing education companies of all time.\nIf you're a strong JavaScript hacker who wants to use node.js to change the world, apply here:<p><pre><code>  --------------------------  \n  https://classdojo.wufoo.com/forms/join-classdojo/  \n  --------------------------  \n</code></pre>\nOr email jobs@classdojo.com<p>You can read about the work and environment here:\n<a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a><p>We are looking for:<p><pre><code>  Lead Software Engineer (node.js) \n\n  Lead Front-end Developer</code></pre>","time":1330621141,"type":"comment"},{"by":"lyime","id":3655742,"parent":3652041,"text":"San Francisco / remote.<p>Picplum is the easiest way to send photo prints. <a href=\"https://www.picplum.com\" rel=\"nofollow\">https://www.picplum.com</a><p>* Picplum (YC S11) is hiring engineering and design interns. On-going and summer.<p>* Things you will most likely work on<p>- API's<p>- Work with the founders on designing and implementing Picplum features and products.<p>- Write and test new/existing code, push it live.<p>- Wire-framing, prototyping and testing UI of features.<p>- Write on the Picplum blog about features that you build.<p>- Chat with customers, learn how they use the product. Make it better.<p>- Hack on fun ideas and experiments using Picplum and 3rd Party APIs. (Lolcat photos print button?)<p>* Picplum.com Stack<p>Heroku, AWS, Git, Rails 3.2, Sinatra, Padrino, Postgres/mysql, Mongo and Redis<p>Javascript / Coffeescript, jQuery, Backbone.js, Handlebars.js, Raphaël.js<p>Image analysis and processing (make it faster)<p>* Perks<p>- Paid Internship<p>- Be one of the first hires.<p>- Learn and hack with the founders.<p>- Apple Equipment and audiophile gear!<p>=&#62; email founders@picplum.com","time":1330673028,"type":"comment"},{"by":"ih","id":3653345,"parent":3652041,"text":"Palo Alto (California and El Camino), Engineers, Full Time<p>Udacity is leading the way in massively open online courses.  We started with <a href=\"http://www.ai-class.com\" rel=\"nofollow\">http://www.ai-class.com</a> and took the lessons learned from that experience to build <a href=\"http://www.udacity.com/\" rel=\"nofollow\">http://www.udacity.com/</a>, a website delivering quality higher education to people all around the world.  We have new and exciting technology and classes in the pipeline and we need great engineers to help shape this movement.  Check us out at <a href=\"http://www.udacity.com/\" rel=\"nofollow\">http://www.udacity.com/</a> and feel free to send me a message if you're interested/have questions ih@udacity.com.","time":1330626675,"type":"comment"},{"by":"bitsweet","id":3653683,"parent":3652041,"text":"Coderwall (YC W12) is hiring in SF.<p>We have one mission, build something developers love and want to use everyday. We are a very small team looking for talented full-stack engineers #1 and #2. You'll have the opportunity to significantly influence the future of the product and company culture. If you enjoy taking high level goals and objectives and shaping them on your own into meaningful software, you'll like it here. We use ruby, redis, nodejs, mongodb, and whatever other tools are appropriate for the problem.<p>We are offering a significant equity stake to find someone that is invested in the product and vision of making life better for developers. If you want to learn more about what we have planned, email me at mdeiters@coderwall.com","time":1330631110,"type":"comment"},{"by":"proximiant","id":3652656,"parent":3652041,"text":"Mountain View, CA<p>Sr. Backend/Server Engineer at Proximiant (<a href=\"http://proximiant.com\" rel=\"nofollow\">http://proximiant.com</a>)<p>Full Time<p>Skills:<p>- Proficiency in Python<p>- Django framework experience<p>- Amazon Web Services experience<p>- Linux System Administration (comfortable at the Linux command line)<p>- Apache or nginx<p>- MySQL or PostgreSQL<p>- HTML, CSS, JavaScript<p>Also Hiring:  Data Scientist and Software Engineer<p>About Us:<p>Proximiant is about building the Google Adwords of the offline world. How? We've created the world’s first Touch&#38;Go digital receipts product, which allows us to understand consumer spending at a level of detail that was never possible before. We are seeking exceptionally talented and driven individuals, who are passionate about building a disruptive product and have an interest in working for a fast-paced startup. Our office is located in downtown Mountain View.<p>To apply, please send your resume to jobs@proximiant.com","time":1330618298,"type":"comment"},{"by":"dekayed","id":3652752,"parent":3652041,"text":"San Francisco<p>Join the team at Archimedes and help us hack healthcare.  We're looking for a Senior Software Engineer with extensive Java experience.<p>Website: www.archimedesmodel.com\nContact: salexander@archimedesmodel.com<p>About us:<p>Archimedes has developed a full-scale simulation model of human physiology, diseases, behaviors, interventions, and healthcare systems. By using advanced methods of mathematics, computing, and data systems, the Archimedes Model enables researchers, administrators, and policymakers to run clinically realistic virtual trials on any population and create compelling evidence to make decisions in health and economic outcomes research, policy creation, clinical trial design, and performance improvement.","time":1330619339,"type":"comment"},{"by":"micahalles","id":3652558,"parent":3652041,"text":"Detroit, MI &#38; Grand Rapids, MI<p>Software Developer<p>Atomic Object (<a href=\"http://atomicobject.com\" rel=\"nofollow\">http://atomicobject.com</a>) is a software product consultancy that builds web, desktop, mobile, and embedded software in small teams using the best tool for the job.<p>We've slowly grown to ~30 makers (mostly developers) in Grand Rapids, MI over the last 10 years. We're opening an office in Detroit, and are currently looking to hire a few more developers who:<p>* love to teach, share, and learn<p>* are on the cutting edge of applied comp-sci<p>* work well in small tightly-knit teams in open environments<p>* get excited about providing the best experience for users<p>* want to be challenged<p>Apply at <a href=\"http://atomicobject.com/jobs\" rel=\"nofollow\">http://atomicobject.com/jobs</a><p>INTERN and H1B welcome; No REMOTE, please.","time":1330617148,"type":"comment"},{"by":"jdrock","id":3652731,"parent":3652041,"text":"Houston/Austin TX - Full Time - <a href=\"http://www.datafiniti.net\" rel=\"nofollow\">http://www.datafiniti.net</a><p>Datafiniti is a small startup building the first search engine for data.  We crawl the entire web, collecting data on businesses, places, people and things and then normalize all of that data into a single, searchable database.<p>We're looking to add a talented and passionate User Interface Developer to our tight-knit team.  The UI Developer will be responsible for building elegant interfaces to super-massive amounts of data.<p>To apply, email careers@datafiniti.net.<p>More info available at <a href=\"http://www.datafiniti.net/index.php/careers\" rel=\"nofollow\">http://www.datafiniti.net/index.php/careers</a>","time":1330619082,"type":"comment"},{"by":"jeremy_degroot","id":3652148,"kids":[3652359],"parent":3652041,"text":"Durham, NC or Remote<p>Bronto Software is looking for a number of engineers to expand our multi-channel e-commerce focused marketing platform (why yes, I did steal this copy from Marketing).  Java, PHP, UI/UX and especially DevOps disciplines are all welcome.  Sense of humor, excellent taste in music and beer, and mad foosball skills are all a plus.  Follow the link for current openings.<p><a href=\"https://careers-bronto.icims.com/jobs/search?ss=1&#38;searchKeyword=&#38;searchLocation=&#38;searchCategory=&#38;searchRadius=5&#38;searchZip\" rel=\"nofollow\">https://careers-bronto.icims.com/jobs/search?ss=1&#38;search...</a>","time":1330612017,"type":"comment"},{"by":"nikoftime","id":3652864,"parent":3652041,"text":"Join Nulu in redefining the way the world learns languages!(San Diego, CA)<p>JOB DESCRIPTION: We are an innovative and fast-growing startup in San Diego developing technology that will transform how consumers around the world gain fluency in foreign languages. We've garnered significant market traction in the US and are looking to expand internationally in the very near future.<p>We are a small team with big ambitions!  You'll be joining a team that knows how to launch successful products, and working with us to build tools that are going to change the world.  Ideally, you have an exceptionally strong web applications development background, and you are familiar with Python (bonus points if you've worked with Django) or Ruby on Rails.<p>As an early employee, you'll be joining our CTO and developers as an integral part of our engineering team. You'll have a major influence in the products we build, the technologies we adopt, and the culture of our company.<p>Our current software stack includes Ruby, jQuery, HTML5, HAML, RSPEC, MySQL, and git, running on an EC2 Deployment of Ubuntu instances.  If your background doesn't match up perfectly with our stack, but you're excited about what we're doing and learn quickly, we want to talk.<p>If you write awesome code, have a great eye for detail and care deeply about everything from the product architecture to its front-end design, get in touch with us to learn more about how we're changing the world.<p>To apply, send your resume to David Allison: david@nululanguages.com.  If you have a Github account, please send a link as well.<p>JOB REQUIREMENTS:<p>Must have 3+ years of hands on coding experience developing high volume and/or e-Commerce websites using technologies such as: Ruby on Rails or Python with Django, jQuery, HTML5/CSS, HAML, RSPEC, SQL, git/github, EC2 Deployment, etc.\nPersonality Traits: versatile, can adapt to new programming languages quickly, entrepreneurial\nCan write top-notch, cross-browser compatible, and W3C standards compliant code (Don't worry, we're not targeting old versions of IE)\nComfort using source-code version control: experience specifically with Git is a plus\nExperience testing your code with testing frameworks<p>COMPENSATION: Competitive salary (DOE) + meaningful equity","time":1330620681,"type":"comment"},{"by":"mb22","id":3652825,"parent":3652041,"text":"Redwood City, CA - Full Time - Inflection\nInflection is in the public records space. We collect data and build beautiful applications that use this data. We have 3 different product lines and that allows our employees to work on different challenges every day. We have a search product, a genealogy product and an identity management product.\nWe are looking for all types of smart folks, and specifically a QA Manager, a data architect and a search engineer. \nWe have a program for on-boarding fresh graduates (<a href=\"http://inflection.com/careers/class-of-2011.html\" rel=\"nofollow\">http://inflection.com/careers/class-of-2011.html</a>) and helping them find what they are most interested in doing. We are particularly proud of this.\nRecently named on of the top 100 Data Innovators: <a href=\"http://data2summit.com/top-100\" rel=\"nofollow\">http://data2summit.com/top-100</a>\nWe know how to make money. We've always been profitable, more millions in revenue than people in the office!\nWe get design and UX, we recently hired Peter Merholz, founder of Adaptive Path: <a href=\"http://venturebeat.com/2012/01/09/merholz-strays-from-path/\" rel=\"nofollow\">http://venturebeat.com/2012/01/09/merholz-strays-from-path/</a>\nCheck out our beautiful website for company culture: <a href=\"http://inflection.com/careers/\" rel=\"nofollow\">http://inflection.com/careers/</a>\nEmail me directly mbaird@inflection.com if you are interested. Thanks!","time":1330620188,"type":"comment"},{"by":"mikebabineau","id":3652900,"parent":3652041,"text":"Rumble Games - Redwood Shores, CA (SF Bay Area)<p>We're making games that will change the world of online play. We have a phenomenal team and top-notch investors:<p>* <a href=\"http://www.linkedin.com/company/2326673?trk=CIWidgetCompany\" rel=\"nofollow\">http://www.linkedin.com/company/2326673?trk=CIWidgetCompany</a><p>* <a href=\"http://www.crunchbase.com/company/rumble\" rel=\"nofollow\">http://www.crunchbase.com/company/rumble</a><p>And we're looking for more extraordinary people:<p>* <a href=\"http://www.rumblegames.com/careers/\" rel=\"nofollow\">http://www.rumblegames.com/careers/</a><p>Drop me a line: mike.babineau@rumblegames.com","time":1330621240,"type":"comment"},{"by":"seldo","id":3653304,"parent":3652041,"text":"San Francisco, CA (Mission District)<p>awe.sm are building a social media analytics platform. Lots of companies have the same use-case: they need to track their content as it travels through Twitter and Facebook, and capture how much traffic that generates them, and ultimately how much money that makes them, e.g. in purchases, signups or page views. We do all of that for them, so they don't have to reinvent the wheel. We have a bunch of APIs and big-data crunching to make it possible, and we're getting bigger and faster and adding features all the time.<p>We're hiring 2x front-end engineers, and 2x back-end engineers:<p><a href=\"http://awe.sm/jobs\" rel=\"nofollow\">http://awe.sm/jobs</a><p>For front-end: we have a web app written in Backbone.js, and are looking for people who are (or want to be) great at JavaScript, and are already great at CSS.<p>For back-end: we are more concerned with \"smart and gets things done\" than your actual language set, but big data and high-performance real-time systems should be interesting to you. Currently we have systems written in PHP, Ruby (on Sinatra) and a fair amount of Bash.<p>We're a team of 10, rising to 14 once we hire you people. Our perks include offices with an awesome view ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) at 22nd and Mission, catered lunch 3x a week, and a company IRC server, which should tell you a lot about the kind of devs we are.","time":1330626221,"type":"comment"},{"by":"Cdestefano2004","id":3653465,"parent":3652041,"text":"Avenue100 Media Solutions- Woburn/Cambridge MA<p>We are looking for a Software Engineer to join our team. Awesome place to work, laid back, flexible, extremely talented cast.<p>Our company is a leading analytics-based performance marketing company that helps institution acquire qualified customers. We are experts in the art and science of education digital marketing. Our sites are seen by nearly 30 million visitors annually.<p>Our engineers work with the research, sales, and traffic teams to build solutions to their toughest problems and rapidly deploy tools to keep our business ahead of the competition. Our small teams are solely responsible for their projects. This allows each engineer a high level of independence and flexibility, but also demands responsible project and resource management.<p>Built by data driven MIT scientists, our successful startup company has transformed into becoming one of the major players in the online education space. We need highly motivated, independent thinkers that want to make an impact on the business while not having to wait for a successful exit. Our compensation plans are highly competitive and we prefer short-term bonuses over any unclear or hazy equity package.'<p>Why us?\n-Excellent pay/benefits/and bonus\n-Laid back environment/flexible schedule\n-Gym/cafeteria on-site\n-Ping Pong table/video games\n-Free snacks\n-Company outings<p>If you are interested please send a resume to cdestefano@avenue100.com<p>Experience with atleast Ruby, Python, or Java is desired.","time":1330628195,"type":"comment"},{"by":"wiredd","id":3652174,"parent":3652041,"text":"Santa Monica, CA - Full Time and Interns - <a href=\"http://www.ziprecruiter.com\" rel=\"nofollow\">http://www.ziprecruiter.com</a><p>ZipRecruiter is looking to expand our 3 person engineering team.  We are small (12 full time employees), growing rapidly, bootstrapped and profitable.<p>We help employers and recruiters distribute their jobs online and screen their applicants.  We have a large number of paying customers and job seekers using our service.  You will be working directly with the company co-founders and will have the opportunity to lead significant projects.  We pay market competitive salaries and offer generous equity and cash bonuses.  I think we're more laid back than the average startup and more fun than the average BigCo - we're fans of 37signals and we emulate a lot of what they talk about.<p>We're looking for the type of people who want to someday start their own internet company, and we're happy to help mentor employees who want to do this.<p>Job requirements:<p>- excellent software design and development skills\n- experience with general web development and programming in a Linux environment\n- some experience with Perl and SQL (not necessary for interns)<p>Technologies we use:<p>Perl, Catalyst, MySQL, Apache, Solr, Redis, jQuery, Selenium, AWS, Linux<p>If you're interested, email dev+jobs@[our-domain] or apply here:\n<a href=\"http://www.ziprecruiter.com/job/Software-Engineer/67c7dd54/\" rel=\"nofollow\">http://www.ziprecruiter.com/job/Software-Engineer/67c7dd54/</a>","time":1330612257,"type":"comment"},{"by":"toddml","id":3652142,"parent":3652041,"text":"Bitly - <a href=\"http://bitly.com\" rel=\"nofollow\">http://bitly.com</a> - New York, NY<p>bitly helps you collect, organize, shorten and share links. We are currently reinventing how people discover and share content on the web.<p>Hiring:<p>Infrastructure Engineers<p>Application Engineers<p>Frontend Engineers<p>Systems Administrators/DevOps<p>We work at massive scale, using a straightforward/well reasoned stack of open source software components.  We are predominantly a Python/C shop, but we prize passion, problem solving ability, and intelligence over any specific language background.<p>Apply at jobs@bitly.com or visit bitly.com/jobs to learn more.","time":1330611832,"type":"comment"},{"by":"rubergly","id":3653199,"parent":3652041,"text":"For a pleasant view of this thread (and previous threads), see <a href=\"http://news.ycombinator.com/item?id=3653146\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3653146</a>","time":1330624906,"type":"comment"},{"by":"Sikul","id":3655104,"parent":3652041,"text":"Santa Monica, CA | Riot Games<p>Riot Games makes League of Legends, one of the most popular games in the world.  We need your help engineering our software delivery pipeline that delivers game content every 2 weeks on a massive scale across the globe.<p>You should work at Riot because:<p>* The problems we solve are not only interesting, they are done so at scales many companies never see.<p>* We use excellent, up-to-date technologies. We're using Ruby, Chef, Rails, and Erlang to manage our software delivery.<p>* We have a strong focus on automated test coverage and best practices, including doing BDD with Cucumber.<p>* We're exploding! Last July we announced that we have 15 million registered League of Legends players.  Four months later, we announced that we reached 32 million registered players. Imagine how many we have now!<p>* We have a startup culture.  We recently came out of startup mode and have had no trouble at all maintaining the best parts of startup culture. Maintaining culture is a huge focus at Riot.<p>* We are encouraged to play video games at work every day!<p>Interested? Great!  You can find the official job posting here <a href=\"http://goo.gl/XIgQ9\" rel=\"nofollow\">http://goo.gl/XIgQ9</a><p>Please send your cover letter and resume directly to the email in my profile so we know you applied from the awesomeness that is HN.  Also, feel free to email me if you have any questions about working at Riot or in the games industry as a whole.  We look forward to hearing from you!","time":1330656093,"type":"comment"},{"by":"spiffyman","id":3653781,"parent":3652041,"text":"Austin, TX and Denver, CO<p>MapMyFitness has openings for a ton of positions[1], including:<p><pre><code>  * DevOps engineers\n  * iOS/Android devs\n  * GIS devs\n  * Front- and back-end web devs\n  * Sales\n  * Client management\n</code></pre>\nWe're a well-funded and fast growing start-up. We're building the future of fitness applications on both the web and mobile. Our mobile apps are consistently rated at 4+ stars on the iTunes and Android app stores. And we have more than 7 million users -- and growing at more than 15,000/day.<p>Almost all of our backend stuff is done in Python and Django, with a dash of legacy PHP we all get to maintain every now and then. We're using MySQL, PostGIS, and MongoDB to work with enormous datasets. The JS side of the house is building awesome stuff with jQuery, Backbone, and Node. You can check out our engineering hiring PDF here[2].<p>Benefits are solid (e.g., full medical/dental for you and 50% for your dependents, a $500/year fitness stipend, stock options). And we're HQ'ed in downtown Austin, only a few blocks away from the best partying or working out of your life. Check us out.<p>[1]: <a href=\"http://www.mapmyfitnessinc.com/company/work-for-us/\" rel=\"nofollow\">http://www.mapmyfitnessinc.com/company/work-for-us/</a><p>[2]: <a href=\"https://mapmyfitness.box.com/s/6hao6x1ayo16ize00r9r\" rel=\"nofollow\">https://mapmyfitness.box.com/s/6hao6x1ayo16ize00r9r</a>","time":1330632568,"type":"comment"},{"by":"lojack","id":3653001,"parent":3652041,"text":"Cleveland, OH\nIntern/Freelance/Remote<p>Babl Media (<a href=\"http://www.bablmedia.com\" rel=\"nofollow\">http://www.bablmedia.com</a>) is an early stage innovation agency. We're currently looking for skilled Python developers who are capable of delivering pixel perfect front-end experiences. Experience with mobile web, django, flask, and CI systems are all bonuses.<p>For remote workers, we're looking for someone who can come into the office at least once a week so they should be at least relatively local to Cleveland. Qualified students and interns are also a possibility. We are also willing to provide free housing if thats desired.<p>About Us:<p>We are a very early stage consulting company that primarily works with startups and small businesses. We've been around for less than a year and have been growing in leaps and bounds. We are highly recommended by our clients and have positioned ourselves as experts in our area. We also work closely with the area incubators, so we are constantly around entrepreneurs and startups. Our team is currently three people including two designers and myself, the CTO. You would essentially be the first technical hire. We are very flexible with commitment (full-time/part-time/freelance/etc) and are willing to offer equity along with pay.<p>If you're interested please email robert[at]bablmedia.com with a resume and a little about yourself.","time":1330622344,"type":"comment"},{"by":"spicyj","id":3652483,"kids":[3653339],"parent":3652041,"text":"Khan Academy (Mountain View) - full-timers and interns welcome year-round<p>Our mission is to provide a world-class education to anyone, anywhere. We already have millions of students learning every month, and we're growing quickly.<p>Our students answer over 2 million math exercise problems per day, all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>, <a href=\"http://ejohn.org/blog/khan-exercise-rewrite/\" rel=\"nofollow\">http://ejohn.org/blog/khan-exercise-rewrite/</a>), and Sal's videos have been viewed over 125 million times. We're just getting started feeding this data we're collecting back into the product to help our users learn more (<a href=\"http://david-hu.com/2011/11/02/how-khan-academy-is-using-machine-learning-to-assess-student-mastery.html\" rel=\"nofollow\">http://david-hu.com/2011/11/02/how-khan-academy-is-using-mac...</a>). If you're interested in data, analytics, and education, this is a dream gig.<p>Plus, it's one of the highest educational impact positions you can imagine. We're hiring all types of devs -- mobile, frontend, backend, data analyst, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1330616239,"type":"comment"},{"by":"danlash","id":3652759,"parent":3652041,"text":"Atlanta, GA - Full Time - Developer - VersionOne - <a href=\"http://versionone.com\" rel=\"nofollow\">http://versionone.com</a><p>VersionOne produces a leading agile project management software product by the same name. We are a small team that focuses on continuous improvement in our software as well as our process. Our main technology stack is .NET 4 but we use many tools, languages, and platforms including ruby, less, jquery, sammy.js, node.js, asp.net mvc, html5/css3, nhibernate, jenkins, git, and more.<p>We are looking for passionate developers that are comfortable with practices such as pair programming, test driven development and are great communicators. We have a strong dedication to sustainable pace and team building - we have catered lunches 2-3/mo, a keg of craft beer at all times ... let me repeat, a keg of craft beer at all times ... a pool table, table tennis tables, foosball table, arcade, and team events such as paintball and go karts.<p>If you are interested please contact me (a developer) at [dan][.][lash][at][versionone][.][com] or visit our career page here: <a href=\"http://bit.ly/8y8CNx\" rel=\"nofollow\">http://bit.ly/8y8CNx</a> (email is better). We also have some open source projects here: <a href=\"https://github.com/versionone/\" rel=\"nofollow\">https://github.com/versionone/</a>","time":1330619387,"type":"comment"},{"by":"dale-ssc","id":3654364,"parent":3652041,"text":"Charlotte, NC, USA; remote candidates welcome<p>Socialserve.com is looking for developers to work on a variety of projects.  We're a 501(c)(3) non-profit that has been around for more than a decade developing and operating a variety of web-based software for governments and other non-profits, starting with our popular housing database product at <a href=\"http://www.socialserve.com/\" rel=\"nofollow\">http://www.socialserve.com/</a>.  We take pride in focusing on the needs of our users and providing excellent value to our customers.<p>We're a handful of developers who get our job done using Macs on the desktop, Linux on our servers, and a bevy of open source software including Python, PostgreSQL, PostGIS, Apache, and Git.  While we're not strict adherents to any single software development methodology, we gladly incorporate processes that produce better software and happier developers including continuous integration, automated testing, and code reviews.<p>We're looking for developers with good knowledge of SQL, web development, basic Unix/Linux usage, and general computer science topics.  Knowledge of Python is preferred, though may not be strictly necessary as we've found it pretty easy to pick up as long as you have experience in a couple other languages.<p>Interested?  Contact us at employment@socialserve.com.","time":1330640533,"type":"comment"},{"by":"vtrac","id":3656584,"parent":3652041,"text":"Austin, TX / NYC, NY / London, UK<p>Bazaarvoice is hiring for a bunch of positions - big data software engineers, front-end engineers, DevOps, etc. Ping me for more info.<p>Here's the DevOps spec:<p><i>Who We Want</i>: Bazaarvoice serves traffic on some of the biggest websites on the internet. Every day our content is served to tens of millions of people making tens of thousands of requests per second, resulting in tens of thousands of gigabytes of traffic. Our request logs alone add up to almost 1TB daily. If the thought of doubling these numbers excites you, we'd love to hear from you.<p><i>Responsibilities</i>: \n* Develop internal tools and processes to maintain stability and performance of our infrastructure \n* Work with Development teams to build applications in an Operationally sustainable way \n* Design cross-datacenter, world-wide systems with a high availability mindset \n* Research, analyze and propose new technology solutions for Bazaarvoice's infrastructure \n* Make things go faster\nSkills and Experience Necessary for the Role: \n* Bachelor's degree in CS, EE or MIS; or equivalent experience \n* 5+ years experience with LAMP development/administration \n* Hands-on scripting with shell &#38; Python/Ruby/Perl \n* Thorough understanding of TCP/IP networking &#38; DNS \n* Excellent project management, communication, prioritization and analytical skills \n* Strong customer service mindset<p><i>Technologies</i>: \n* Linux \n* Tomcat \n* Solr/Lucene \n* MySQL \n* Amazon Web Services (EC2, S3, VPC)<p><i>Bonus experience</i>: \n* Puppet/Chef \n* Hadoop/BI/Big Data \n* Cassandra/Riak \n* OpenStack/Eucalyptus \n* Open source contributions","time":1330697040,"type":"comment"},{"by":"aguynamedben","id":3653511,"parent":3652041,"text":"San Francisco, CA or Portland, OR - FULLTIME or INTERN - Engineers and business people<p>Urban Airship is hiring all kinds of engineers and business people in San Francisco and Portland. We have a travel program between the cities, so you'd get to know 2 badass cities.<p>Urban Airship helps mobile developers send push notifications at high volumes across iOS, Android, Blackberry, WP7, Kindle, etc.<p>- 10 billion push notifications sent. We're sending about 2.5 billion per month now. We sent 150M push notifications in a 24 hour period just this week.<p>- Our systems are engineered to send about 50,000 push notifications per second. We want to \"light up a stadium in a second\".<p>- We have huge customers like The New York Times, ESPN, USA Today, Groupon, LivingSocial, BET, etc.<p>- We're about 65 people and just raised $15M from Intel, Verizon, and SalesForce.<p>- Working on advanced segmentation of users to send smarter push notifications.<p>- Great, hardworking leadership, one of the most important things in a startup.<p>- Ping pong showdowns. Lagunitas keg and bourbon in the office. Fun, connected, smart, and badass co-workers that are 100% startup.<p>The formal job listings are here: <a href=\"http://urbanairship.com/company/jobs/\" rel=\"nofollow\">http://urbanairship.com/company/jobs/</a> but we're hiring smart engineers with a broad range of skills.<p>Hit me up at ben (at) &#60;companyname&#62; (dot) com if you're interested!","time":1330628954,"type":"comment"},{"by":"dolinsky","id":3654446,"parent":3652041,"text":"New York, NY (Tribeca/Soho border)<p>TigerTrade (<a href=\"https://tigertrade.com\" rel=\"nofollow\">https://tigertrade.com</a>) is revolutionizing the way global sourcing is done online.<p>Hiring:<p>Frontend Engineers - <a href=\"http://bit.ly/wkZ7yg\" rel=\"nofollow\">http://bit.ly/wkZ7yg</a><p>Backend Engineers  - <a href=\"http://bit.ly/wDmSbU\" rel=\"nofollow\">http://bit.ly/wDmSbU</a><p>Both positions will be first hires and work directly with me to build out our product offering across multiple delivery platforms (web/mobile/api/carrier pigeon) and reach a global market of buyers/suppliers/service providers. This is an amazing opportunity for someone who wants to have a large amount of responsibility and say in not only what is built, but how we go about building it (Lean + sprint.ly + validation === fun).<p>Currently the stack includes a custom build of Nginx, PHP5.3 (lithium), MongoDB, Redis, memcached combo, and that grows as our needs will. Local sandboxes are configured using Chef, Vagrant, VirtualBox, git - and it comes with a MBP w/ display(s) of your choosing to boot.<p>If you're passionate and smart (and know Python/Java), there's going to be a huge opportunity for some serious data analysis, recommendation and visualization as we build out our discovery engine based on the huge amounts of manifests, trade documents, behavioral and product data that we aggregate from and about our industry.<p>We're funded, we're growing, we enjoy working with each other (but we like to go home at the end of the day as well), and we'd love to hear from you.<p>techjobs@tigertrade.com","time":1330641573,"type":"comment"},{"by":"lamby","id":3652295,"parent":3652041,"text":"London, England. <a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a><p>Small (4) startup in the gaming space looking for software engineers. Are you the one? You are, if you:<p>* Love agile development, working independently on your own challenges, and together in a team on the bigger vision<p>* Are completely fluent in a scripting language such as Python, Perl, PHP or Ruby and have experience with web frameworks and the MVC concept. We don't require fluency in our current technology stack - great programmers can pick up new technologies.<p>* Have used MySQL or PostgreSQL extensively and you know your way around Apache, nginx or other server. It's a bonus if you have good JavaScript skills (we use jQuery)<p>* Get excited by the idea of scaling web apps to millions of users<p>* Are the best developer in your peer group, and want to be at a place where you are constantly challenged and pushed to become better<p>* Get obsessed about the problem you're solving and don't stop until you've cracked it<p>* Have a thirst to learn new skills and technologies, and can pick things up easily<p>* Want to have fun building lots of new features and get stuff done<p>* Are full of positive energy, relish the thought of being part of a small, fast-moving team and enjoy brainstorming about new ideas<p>See <a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a> for more. You can see some of our code at <a href=\"http://code.playfire.com/\" rel=\"nofollow\">http://code.playfire.com/</a>","time":1330613990,"type":"comment"},{"by":"sinzone","id":3652249,"parent":3652041,"text":"Mashape (<a href=\"http://mashape.com\" rel=\"nofollow\">http://mashape.com</a>) - San Francisco<p>Java/Play/Scala Engineer<p>We're building the App Store of APIs.<p>Mashape provides a world-class marketplace to manage, distribute and consume any kind of API in the world, both cloud and internal, both existing or just born, targeting every developer, company or organization committed into the Internet.<p>We're a small, passionate team. We think we're revolutionizing the way data and services are distributed and consumed and we’re backed by top tier VCs in the world such NEA, Index Ventures, Charles River Ventures and Ignition Partners; as well as outstanding angels such Jeff Bezos (Amazon CEO) and Eric Schmidt’s (Google President) Innovation Endeavors.<p>You can email me or hackers@mashape.com<p>More info: <a href=\"http://blog.mashape.com/become-a-mashaper-were-looking-for-a-frontend\" rel=\"nofollow\">http://blog.mashape.com/become-a-mashaper-were-looking-for-a...</a><p>We have one of the biggest stack for a small startup in Silicon Valley - Including: Java, Play framework, Ruby, Python, Obj-C, PHP, Erlang, node.js, Javascript, Memcached  MongoDB, SimpleDB and DynamoDB, HTML5/CSS3 with LESS, Git, Maven, Linux/CentOS. Soon we'll add Scala and .NET and C#.  As we scale we're going to use Hadoop, Lucene/Sphinx, Redis and a bunch of other amazing technologies. Tech challenges? Well, all the API calls pass through a proxy, the Mashape proxy, so scaling this shit to billion of calls/month while keeping a latency under 100ms or storing and analyzing the huge of amount of data that pass through it every second won't be easy.","time":1330613394,"type":"comment"},{"by":"kathyaalberts","id":3654278,"parent":3652041,"text":"Glooko in Palo Alto, CA is an innovative Silicon Valley startup with a unique solution for people with diabetes. Our products enable users with smart phones to easily collect and view the information needed to help them successfully control their blood glucose levels. Our mission is helping people with diabetes live life while effortlessly managing their diabetes.<p>Senior UI Engineer<p>You’re a talented front end web developer with a passion for implementing awesome interfaces and creating the best experience for our users. In this role you will:<p>•Architect and optimize client side code using Javascript, CSS, and HTML\n•Collaborate with peer engineers, designers and product managers to define and implement new features\n•Collaborate with backend engineers to optimize scalability, network efficiency, and deployment procedures\n•Assist in designing user interfaces with strong social media integration\n•Stay up-to-date with client side web technologies and proactively suggest architecture changes and new coding practices<p>Your Skills<p>•5 -6 years experience in JavaScript, HTML and CSS\n•Development experience for a consumer-based website highly preferred\n•Able to create clean and maintainable code from mock ups\n•Work closely with and incorporate feedback from other engineers, and product managers\n•Keep up with evolving web standards (HTML5, CSS3), and best practices\n•Strong communication skills including the ability to communicate complex information to diverse audiences both speaking and in writing\n•BS degree in computer science/engineering or equivalent experience. Graduate degree is a plus<p>Please email resumes to: kathy@glooko.com","time":1330639480,"type":"comment"},{"by":"gnubardt","id":3653702,"parent":3652041,"text":"Brightcove - Boston, MA, Seattle, WA\n<a href=\"http://www.brightcove.com/en/company/careers\" rel=\"nofollow\">http://www.brightcove.com/en/company/careers</a>\nFULLTIME &#38; INTERN<p>We're an online content platform delivering the most video streams (after Youtube). Join us if you're a smart &#38; nice person who wants to work with a group that operates at massive scale, yet still feels like a small company.<p>We are hiring (and growing) like crazy! Looking for: Senior Engineers with experience in video transcoding, EC2 or Rails.  Also for Software Engineers for our Javascript HTML5 video player team or for our distribution backend.<p>Also hiring Account Managers, Customer Solution Specialists, a Director of Alliances &#38; Channels, an Inside Sales Manager &#38; a Video Production Intern.<p>We deploy continuously, use Java, Ruby/Rails &#38; MongoDB (though we're starting to use NodeJS &#38; Erlang in some projects).<p>We offer a competitive salary, benefits &#38; unmetered vacation time (in the US).  Moving to a new HQ on the Boston waterfront in a couple of weeks <a href=\"http://articles.boston.com/2011-07-05/business/29739856_1_boston-properties-locations-firm\" rel=\"nofollow\">http://articles.boston.com/2011-07-05/business/29739856_1_bo...</a><p>Contact me if you have any questions! sneubardt at brightcove","time":1330631474,"type":"comment"},{"by":"derwiki","id":3653187,"parent":3652041,"text":"San Francisco, fulltime/internships/H1B\nCauses - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a>\nAt Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, etc.<p>Ways we're trying to make ourselves better engineers:<p>- deliberate practice with our tools. If you are a vim user, we have the programmer who wrote Command-T on staff and he's a great person to learn from<p>- every changeset gets pushed to Gerrit where it waits to get a +1 from our build suite (that runs in 3 minutes) and a +1 from a human reviewer<p>- actively upgrading our version of Rails, and not stopping until we hit bleeding edge. We hit Rails 2.3.14 last week and hope to hit 3.0.11 within the month<p>- everyone is encouraged to take one hour from their day to learn about something they wouldn't otherwise<p>- every story is scoped so that it can be completed in less than a day. We don't branch, we just work on top of master. We've found that the closer we stay to master, the less needless work we create for ourselves<p>Causes is a great place to better yourself and better the world. Apply through the site or adam@causes.com if interested!","time":1330624793,"type":"comment"},{"by":"meganelacarte","id":3669434,"parent":3652041,"text":"E la Carte - Palo Alto, CA - Software Engineers, FT &#38; Interns<p>E la Carte (www.elacarte.com) is revolutionizing the restaurant industry with our Presto touch-screen tablets, which enable guests to browse appetizing pictures of the entire menu, place orders, split checks, make payments, and play interactive games – all from the comfort of their restaurant seats without having to wait.<p>We're not just building an ephemeral website or apps - we're building an actual tablet as a platform and amazing software for restaurants across North America! Your grandmother will use this product.<p>Join our tight-knit team of 30 (~10 Engineers from MIT, Microsoft, and Amazon) in our Palo Alto house and help us scale up this fast-growing company. You'll wear lots of hats, have immense room for professional development and growth, and be able to make a huge impact on our product and organization.<p>Our favorite tools are Python and C++, but our platforms are complex and we learn new technologies daily.<p>Most of our engineers get their hands on a variety of projects, although we could use specialization in the areas of Test, Tools, UI, and Back End. We even have opportunities for Interns and a Lead - just reach out!<p>View complete details on our company and openings at www.elacarte.com/jobs","time":1331002336,"type":"comment"},{"by":"brandnewlow","id":3653803,"parent":3652041,"text":"NowSpots, with offices in Mountain View and Chicago, is building an app platform for advertising so that businesses of all shapes and sizes can make ad campaigns that are as awesomely effective as their social media marketing.<p>We're looking for an account manager to join our team and juggle customer support, closing sales, setting up campaigns, and much more.  You are a one-man logistical wrecking ball.<p>We're also looking for a director of biz-dev to help build partnerships and get our stuff out there.<p>We've raised a sizeable seed round and are growing swiftly.  We're looking for the next brain to add to the menagerie.<p>What we do: Imagine you're in a band and you want to promote your upcoming shows.  You'll probably post about it on Facebook and Twitter, but you'd never consider advertising...because it's a pain in the butt and there's no ROI.<p>But what if you had a widget featuring the Youtube video your band made last weekend, a feed of your upcoming shows, and a few cuts from SoundCloud?<p>And what if you could show that widget to people in your city who are into music wherever they're at across the web?<p>And what if you could see how many times people listened to your songs and what sites played them the most?<p>And what if...<p>You get the idea.  We're hacking the ad industry and looking for fellow crazy people to join up!<p>hello@nowspots.com","time":1330632804,"type":"comment"},{"by":"embwbam","id":3652460,"parent":3652041,"text":"i.TV (<a href=\"http://corp.i.tv\" rel=\"nofollow\">http://corp.i.tv</a>) is creating a world-class engineering team here in Provo, Utah. Among other things, we work when we're most productive, choose our tasks, avoid meetings and distractions, provide any equipment, go to conferences, test our code, automate, have an interesting market and fun product, and constantly improve. We pay above-market salaries, have excellent benefits, and generously share ownership. Each person on the team is good enough to help us improve.<p>i.TV is about making TV better by delivering interesting content to your phone/iPad/laptop in sync with what's on your TV. It's a huge opportunity to both improve the usefulness of TV and to create a place for TV advertisers to engage with the audience. We have successfully launched several products, including our popular iOS and Android Guides, and work with many national partners including Time Inc and Aol. We are well funded, and are close to launching a new product that will revolutionize the way we watch TV.<p>We use Node.js, MongoDB, HTML5/JS/CSS, iOS, and Android, but overall programming skill is most important than any particular specialty.<p>Please contact Sean Hess at jobs@i.tv","time":1330616020,"type":"comment"},{"by":"motti","id":3654643,"parent":3652041,"text":"London, UK<p>FULLTIME or INTERN<p>REMOTE or onsite in our London offices, or some hybrid arrangement.\nWe are building CopyCopy (<a href=\"http://www.copycopy.cc/\" rel=\"nofollow\">http://www.copycopy.cc/</a>) - a cross-platform productivity tool that makes it simple to transfer anything between phones and desktop computers.<p>We use:<p>• Java (for Android, BackberryOS, GWT and in our homegrown lightweight Java server)<p>• C++ (for Win32, Qt, Android NDK and Objective-C++)<p>• Python (occasionally) to string bits together<p>• Objective-C (iPhone and Mac)<p>• JavaScript (web frontend work and browser extensions)<p>• Redis<p>We are a young startup headed by experienced engineers, and moving fast towards the first launch. You will have the opportunity of working on self-contained projects from spec to release to consumers. Our Git repositories, code review and Project Management tools are geared towards remote working and we are open to flexible working conditions. We urgently need full-timers and interns (paid).<p>Equity on top of salary for the right candidate.<p>We are happy to consider remote workers who are located in timezones +/-3 hours from London or you can work in our new North West London offices.\nApply now to find out about our \"secret sauce\" that will make CopyCopy the simplest way of transferring anything between devices.\nJust send your CV to jobs@copycopy.cc now!","time":1330644920,"type":"comment"},{"by":"dseigle","id":3654305,"parent":3652041,"text":"Santa Barbara, CA - Full Time and Intern - Engineering and Business Development - <a href=\"http://findthebest.com\" rel=\"nofollow\">http://findthebest.com</a><p>WHY WORK FOR FINDTHEBEST?<p>FindTheBest is a rapidly growing Internet start-up lead by DoubleClick founder Kevin O’Connor and backed by Kleiner Perkins—the same venture capital firm that has invested in Twitter, Zynga and Square. Michael Arrington at Tech Crunch heralded it “A winner!”<p>FindTheBest is a powerful tool for making quick and informed decisions. Our unique data-driven content platform curates and distributes high quality content across over 700 categories, ranging from sports to gadgets to education.\nWorking for FindTheBest gives you a ground floor opportunity to experience a start-up with a huge idea and impressive traction run by successful industry veterans from game-changing companies like DoubleClick and Google.<p>Our combination of an experienced and dedicated management team, our mission to help users make quick and informed decisions, and a hardworking—and fun!—team, ensures an exciting and collaborative work environment.<p>If you're the type of person who thrives on working on massive ground-breaking ideas, is smart, highly passionate and prepared to work hard—but also loves to pull a few pranks—you'll love working at FindTheBest.<p>All positions can be found at <a href=\"http://www.findthebest.com/jobs\" rel=\"nofollow\">http://www.findthebest.com/jobs</a><p>Looking for:<p>Web and Graphic Designer\nFront End Web Developer/Engineer\nSoftware Developer/Engineer\nFront End Web Developer/Engineer\nSoftware Developer/Engineer Paid Internship\nProduct Management Paid Internship\nBusiness Development Paid Internship","time":1330639792,"type":"comment"},{"by":"gruen","id":3653320,"parent":3652041,"text":"New York City - QLabs<p>QLabs rapidly produces new web properties every 8 weeks. We're growing teams for the following portfolio projects:<p><pre><code>  http://huntsy.com - Jobhunter's CRM (subdomain's beta if you want to see it in action)\n  http://framey.com - Put a video Recorder on any website. \n  http://brom.ly - Find *all* of the events! (API Product.)\n</code></pre>\n...and we're looking for the following roles for each project:<p>Marketing Associate (NYC) — Solid understanding of web technologies and a strong ability to market them with a keen eye towards social technologies and effective ad spend. Healthy budgets allocated.<p>Software Engineer Ruby on Rails (NYC. Remote OK) — Current on latest RoR technologies and common gems. Typical production stack:<p><pre><code>  Rails 3.1/3.2 w/Asset Pipeline, HAML and SASS\n  EC2 + Heroku\n  Redis\n  Chef (we forked a lot of cookbooks and the cluster is re-deployable in minutes)\n</code></pre>\nCandidates: send a 50-word note to work@qlabs.com and include any pdf resumes, portfolio, etc. that you think would be useful.<p>Also of note, we have a beautiful office on Bond and Broadway, stocked with free and nutritious snacks.<p>Tags: REMOTE, FULLTIME, H1B, AGILE, RAILS, INTERN (yes, we offer internships).","time":1330626419,"type":"comment"},{"by":"jszumski","id":3652503,"parent":3652041,"text":"Richmond, VA; Washington, DC; Charlotte, NC<p>iOS, Android, Java, and .NET engineers<p>CapTech Consulting (<a href=\"http://www.captechconsulting.com/careers/jobs\" rel=\"nofollow\">http://www.captechconsulting.com/careers/jobs</a>)<p>CapTech helps our Fortune 500 clients solve interesting problems in mobile, web services, and traditional desktop software.  Join a thriving mobile development group and help design some of the most popular App Store and Marketplace software.","time":1330616416,"type":"comment"},{"by":"glou","id":3653030,"parent":3652041,"text":"Quirky.com - Full Time - NYC<p>Quirky is a social product development company where people from all around the world submit invention ideas to our website. With the help of our passionate community, we select the best ideas each week to develop together and try to bring them to market. If an idea actually makes it, then everyone who helped along the way gets a piece of the pie. You can find our products at retailers such as Target and Bed Bath &#38; Beyond.<p>Quirky is a rails shop, and we work with lots of fun technologies like AWS, mongo, iOS and heroku to name a few. We're a small team that works on lots of big, fun and interesting problems. We just moved into a brand new, fully custom office space in Chelsea (might be the coolest office you'll find in NYC). Oh and we also had a reality show on the Sundance Channel last year.<p>We're looking to hire rockstar rails and front end developers. More details here:\n<a href=\"http://quirky.theresumator.com/apply/\" rel=\"nofollow\">http://quirky.theresumator.com/apply/</a><p>If interested, shoot me an email greg at quirky dot com. Relocation is available for well qualified candidates (I moved from SF to NYC to work here!)","time":1330622781,"type":"comment"},{"by":"benhatten","id":3652166,"parent":3652041,"text":"Washington, DC (Georgetown)<p>EverFi - EDTech Startup backed by NEA, Tomorrow Ventures, Michael Chasen and more.  Creating learning platforms for k12 thru college with a major big data component.  We're hiring for:\n* Software Engineers(Ruby on Rails)\n* UX/UI\n* Sys Admin\n* Product Managers\n* Account Managers<p>Check out our job page here <a href=\"http://everfi.me/A5KvMG\" rel=\"nofollow\">http://everfi.me/A5KvMG</a>  or get in touch at HN@everfi.com","time":1330612181,"type":"comment"},{"by":"kek","id":3652539,"parent":3652041,"text":"NYC, New York<p>Greatist is looking for a technical leader.<p>Passionate about building products that help inspire &#38; inform the world to make healthy choices? We’re looking for a brilliant technologist with passion, vision, strong people skills, and killer dev chops excited about making a genuine and lasting difference in the health &#38; fitness space. Someone who builds stuff for fun that’s been successful and (ideally, though not necessarily) works out now &#38; then. Someone who wants to share the Greatist vision and transform it. This position is full time &#38; based in NYC.<p>Interested? Please send (a) your favorite health &#38; fitness tip as well as (b) a resume and/or links to your online footprint &#38; project work to kelli at greatist dot com. Show us what you can do, tell us why it matters, and convince us you’re passionate about the same space we are.<p><a href=\"http://www.greatist.com/careers/#techleader\" rel=\"nofollow\">http://www.greatist.com/careers/#techleader</a><p>For more details, read here: <a href=\"http://www.derekflanzraich.com/2012/02/looking-for-technical-leader/\" rel=\"nofollow\">http://www.derekflanzraich.com/2012/02/looking-for-technical...</a>","time":1330616927,"type":"comment"},{"by":"smilliken","id":3653653,"parent":3652041,"text":"San Francisco - Engineer<p>MixRank (YC S11) is looking for a generalist hacker who will work with us to make online advertising less annoying, more relevant, and more effective. We want to bring the same kind of predictive analytics investment banks use to online advertising. Think of this as one giant optimization problem, with tremendous rewards if we can get it right.<p>We're currently a team of 4, but looking to grow the team over the next year. Some of the technologies we use every day include Python, PostgreSQL, Javascript, Git, Bash, and Linux; experience in any of these is great, but we also like generalists that can pick up new things quickly. Big data, machine learning, and analytics experience is encouraged.<p>jobs@mixrank.com<p><a href=\"http://techcrunch.com/2011/06/30/want-to-see-which-ads-perform-best-yc-backed-mixrank-is-a-spy-tool-for-adsense/\" rel=\"nofollow\">http://techcrunch.com/2011/06/30/want-to-see-which-ads-perfo...</a>\n<a href=\"http://techcrunch.com/2011/12/13/display-ad-data-intelligence-startup-mixrank-raises-1-5m-from-mark-cubam-500-startups/\" rel=\"nofollow\">http://techcrunch.com/2011/12/13/display-ad-data-intelligenc...</a>","time":1330630816,"type":"comment"},{"by":"klochner","id":3653350,"parent":3652041,"text":"RentMineOnline - San Francisco<p>We bring resident referral programs online leveraging leading social networking sites.<p>Our company services the multi-family residential real estate market and has been in business for 5 years. In 2011, RentMineOnline was voted the \"Best New Company in Apartment Marketing,\" and has participated both in SeedCamp (2008) and FbFund (2009) incubator programs.<p>We are looking for talented and energetic engineers of all skill levels to help us grow our company. As a member of a small team (2 in-house developers and 4 remote), you will have the opportunity to see an immediate impact from your efforts in all areas of our business.<p>How we operate:<p><pre><code>    Our server stack is Rails 3, REE, passenger, nginx, MySQL, redis, and ubuntu\n    On the front end we use jquery, jquery-mobile, and prototype \n    Our code lives on github.\n    We integrate with Amazon Services, Facebook Platform, LinkedIn and Twitter.\n    We deploy daily, often multiple times a day\n    We're always evaluating technologies that can help \n      us operate better, faster, and smarter.\n</code></pre>\nDesired Skills &#38; Experience<p>What you need:<p><pre><code>    Strong work ethic\n    Ability to write clean code and tests\n    Exerience with a web framework - Rails preferred but not required\n    Understanding of relational databases - \n       you should know how to write a non-trivial join or select\n    At least some shell experience - a command line shouldn't be foreign to you \n</code></pre>\nNice things to have:<p><pre><code>    1+ years of rails development\n    Experience maintaining your own server\n    You've rebased more than a few git branches\n    Facebook platform development\n    Intermediate statistics/machine-learning</code></pre>","time":1330626686,"type":"comment"},{"by":"hswolff","id":3652930,"parent":3652041,"text":"New York City, New York - GetGlue - <a href=\"http://getglue.com/\" rel=\"nofollow\">http://getglue.com/</a> - Fulltime<p>Positions and how to apply (directions in footer):<p>Web Developer\n<a href=\"http://getglue.com/jobs/web_developer\" rel=\"nofollow\">http://getglue.com/jobs/web_developer</a><p>Java Engineer\n<a href=\"http://getglue.com/jobs/java_engineer\" rel=\"nofollow\">http://getglue.com/jobs/java_engineer</a><p>iPhone / JavaScript Developer\n<a href=\"http://getglue.com/jobs/javascript_developer\" rel=\"nofollow\">http://getglue.com/jobs/javascript_developer</a><p>About us:<p>GetGlue is a social network for entertainment. Users check-in and share what they are watching, listening to and reading with friends; get fresh recommendations, exclusive stickers, discounts and other rewards from their favorite shows and movies.<p>GetGlue is a recognized leader in social television and second screen applications. GetGlue has 2M users that checked-in over 100M times in 2011. 75 major networks and 10 movie studios use GetGlue to promote their shows and movies to fans.<p>Based in NYC, GetGlue has received funding from Union Square Ventures, RRE Ventures, Time Warner, Rho Ventures, and a number of prominent angel investors.","time":1330621548,"type":"comment"},{"by":"wferrell","id":3653736,"parent":3652041,"text":"San Francisco/Remote - Seeking Full Time - Designer and iOS &#38; Web Developers<p>EmbarkAir is looking for great people. Today, we are building the best way to book a flight on your phone. We've taken the arduous process of today that requires 8 screens and 31 actions and reduced it to 4 beautiful screens and 8 simple touches. See the app at <a href=\"http://embarkair.com\" rel=\"nofollow\">http://embarkair.com</a>. But the vision for tomorrow is to allow people to be productive anywhere. To do what RIM originally did for email for all common tasks. And what the iPhone did for the mobile web. We believe phones will soon become our primary devices, yet many tasks are still too difficult to complete on a phone today. There is too little personalization, too much data for the little screens and too many steps to complete a transaction.<p>Booking a flight is the first task we have solved and the big vision is to build a platform that is the best way to complete complex tasks. Period. Our beta testers love the app and booking experience and we are gearing up for a wider release in the near future.<p>I'm looking for a lead designer -- someone with a keen eye and experience creating clean simple interfaces. Our focus is on eliminating steps and reducing the number of touches -- while making information  clear and easy to digest.<p>I'm also looking for an iOS or backend developer -- someone with experience developing in iOS, an interest in simplicity and creating beautiful interactions and a snappy app. On the backend, we are a python shop -- nginx, tornado, mysql. Someone that likes to get their hands dirty working with 3rd party APIs and optimizing for speed!<p>We are offering a decent salary, significant equity and a chance to lead this new company.<p>To learn more and apply please email me at wferrell@embarkair.com","time":1330631881,"type":"comment"},{"by":"gtuhl","id":3652934,"parent":3652041,"text":"MailChimp, Atlanta, GA, Full Time<p>I am looking for Infrastructure Engineers to join the team.  We support hundreds of servers, millions of customers, and send billions of emails every month with a small team that prefers automation over manpower.<p>MailChimp offers extremely competitive pay, unmatched benefits, and a culture that empowers engineers to work autonomously with large budgets and significant resources.  We use top of the line equipment to support impressive volume in an international, 24/7 environment.<p>I am looking for two types right now.  Generalists or somebody that can hit both of these are especially welcome:<p>- Devops, server guys that can write code and contribute to our automation tools, expertise with databases is a large plus given those are our largest machine type.<p>- Network Engineers, people who absolutely understand and love working with high end networking gear, setting up colocation environments, etc.<p>We will cover relocation expenses completely for the right candidate and can offer compensation appropriate for any level of experience.<p>If any interest email infrastructurejob@mailchimp.com and it will come directly to me.","time":1330621598,"type":"comment"},{"by":"anandiyer","id":3653388,"parent":3652041,"text":"San Francisco, CA<p>OnSports (<a href=\"http://www.onsports.com\" rel=\"nofollow\">http://www.onsports.com</a>, jobs@onsports.com ) is revolutionizing the sports world. We're a fast-growing mobile-first startup and we are catering to sports fans by letting them create and participate in discussions about the teams and players they love. We love what we do and we love what we are building. Everyone discusses product and is empowered to build what they think is right for our users, the fans. Challenging problems excite us and we value engineering.<p>We're looking for a product minded iPhone Developer to join our team. We're still very early in our product's lifecycle and growing rapidly. You'll be joining our team at an early stage where you can influence product decisions and grow the company.<p>Requirements:\n. Must have developed and built at least one brag-worthy iOS application\n. Must have an entrepreneurial and product oriented mindset<p>Perks:\n. Work with a talented team in the heart of SF amongst the most exciting startups in the world\n. Free meals<p>Join us and change the game! Email jobs@onsports.com","time":1330627194,"type":"comment"},{"by":"jayp","id":3652461,"kids":[3653422],"parent":3652041,"text":"Mountain View, CA. Both Full-time and Interns. <a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Pattern Insight is a booming startup making code and log analysis tools for a customer base that includes many titans of the tech industry. The data mining and static analysis technologies present in our product have strong research roots, as we grew out of PhD research done at the University of Illinois at Urbana-Champaign. Relatedly, our core engineering team has a strong academic background, and as a whole, published over 100+ articles in peer reviewed journals and conferences.<p>We are looking to expand our engineering team in sunny California. As stated above, we are also looking for a handful of interns. For more specific requirements, please see our career page: <a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Come join us, we are still tiny and looking for people ready and willing to make decisions that shape our future.","time":1330616035,"type":"comment"},{"by":"fuzzylizard","id":3653712,"kids":[3653956],"parent":3652041,"text":"Toronto, ON, Canada - QA Lead, Software Testers - Full Time<p>Nulogy.com (<a href=\"http://www.nulogy.com\" rel=\"nofollow\">http://www.nulogy.com</a>), is revolutionizing the co-packing world by developing SaaS applications for our packaged world. We are looking for professional software testers who are passionate about delivering quality software that helps meet, and exceed, our customers needs.<p>Nulogy.com is a Ruby on Rails software development shop. We have embraced Agile software methodologies and believe in the idea of being a little better tomorrow than we are today. And we are looking for people who are passionate about quality to help us build up our QA team. We are looking for a QA Lead and for software testers.<p>We are looking for smart, passionate people dedicated to delivering quality software and who are willing to leave their ego at the door. We love differing ideas and debates, but we are a team and we succeed or fail based on the strength of that team.<p>If this sounds like ideal environment for you, sends us an email and your resume to grow@nulogy.com.","time":1330631572,"type":"comment"},{"by":"typpo","id":3653363,"parent":3652041,"text":"Mountain View, CA - fulltime or intern<p>Room 77 - <a href=\"https://www.room77.com\" rel=\"nofollow\">https://www.room77.com</a><p>We're changing travel search by giving people full transparency in their search for a perfect hotel stay. Using the staggering amount of data we've collected and analyzed, we'll actually find and request the best hotel room for you.\nSome projects you'll work on:<p>- computer-generating views from any room in the world<p>- building the first deep-text hotel search engine (eg. search \"eiffel tower views\" in Paris or \"jetted bathtub\" in New York)<p>- super-fast search across all major providers (we show Expedia results faster than Expedia)<p>- finding better ways to extract and expose data like hotel freebies and fees<p>...and many other things that contribute to a fast, easy travel planning experience.<p>If you're interested in information retrieval, machine learning, NLP, or computer visualization, you'll have a great time solving brand new problems and creating a genuinely improved and useful hotel search.<p>Check out our jobs page: <a href=\"https://www.room77.com/jobs.html?s=HN\" rel=\"nofollow\">https://www.room77.com/jobs.html?s=HN</a>","time":1330626874,"type":"comment"},{"by":"daxhuiberts","id":3652732,"parent":3652041,"text":"Amsterdam, the Netherlands – Publitas.com (full-time)<p>We’re looking for Ruby on Rails developers and mobile web developers to help us create our next generation publishing and distribution system for retail e-commerce worldwide.<p>Publitas has been in business for 5 years now with a crew of 20 dedicated people helping retailers increase their reach and conversion by creating an amazing shopping experience for customers. We make it incredibly easy to publish and distribute exceptional digital catalogs with integrated mobile, e-commerce and social media features.<p>Our stack runs completely on AWS and has over seven million visits per month. The new system is being developed on Ruby on Rails 3.2 and the mobile web app is using CoffeeScript, Sass and Zepto.js. Being experienced in either Ruby on Rails or mobile web development is great. Being experienced in both is even better!<p>Contact me or take a look at <a href=\"http://www.publitas.com/en/company/careers/developer\" rel=\"nofollow\">http://www.publitas.com/en/company/careers/developer</a> for more information.","time":1330619091,"type":"comment"},{"by":"pretzel","id":3652057,"parent":3652041,"text":"The internet is important. For the UK economy it is very important: contributing over 10% of GDP. At QuBit we are working to make the internet better. We want to make each company we work with as profitable as possible by processing online data intelligently. And we need your help.<p>We are looking for Front End Developers, Customer Solutions Engineers and a DevOps / Systems Engineer. You'll need a degree in Computer Science or similar discipline from a top university, the flair to do well in a dynamic growth-phase start up and an Open Source state of mind.<p>Front End Developers need to have skills in JavaScript, HTML, CSS and cross browser debugging. Any experience of the Back End or UI / UX design will be a major plus. We use tools like Backbone, Redis and Nodejs on the Front End side, and would love to hear from you if you do too.<p>Customer Solutions Engineers have all the skills of the Front Enders, with the ability to be client facing. You'll be dealing with major players in the eCommerce space and helping to troubleshoot and solve problems on their websites. In depth knowledge of server-side coding and web design would be really beneficial here.<p>Our DevOps / Systems Engineer is going to help us optimize our platform. We're looking for someone with crossover Sys Admin and programming experience. You'll be autoscaling our use of Amazon Web Services and maintaining our networks and systems including a Hadoop cluster.<p>We're looking at graduate, junior, mid-level and senior people for these hires. If your kung fu is the best let us know, we'd love to hear from you. Send a CV to careers@qubitdigital.com and maybe you'll be joining our team in London's Soho and enjoying life at Wired's start up of the week: <a href=\"http://www.wired.co.uk/news/archive/2012-02/28/startup-of-the-week-qubit\" rel=\"nofollow\">http://www.wired.co.uk/news/archive/2012-02/28/startup-of-th...</a>","time":1330610435,"type":"comment"},{"by":"stevenkovar","id":3652624,"parent":3652041,"text":"Austin, TX<p>AppSumo (<a href=\"http://appsumo.com\" rel=\"nofollow\">http://appsumo.com</a>) provides tools, software, and educational courses to professionals wanting to get to the next level. Our goal is to turn every Wantrepreneur into a successful Entrepreneur.<p>Hiring:<p>* Director of Growth<p>* Design Sumo<p>* Python Developer<p>* Customer Advocate<p>* Fanatical Taco Eaters<p>Why you should work here:<p>- We are making a difference. We love getting emails out of the blue like these:<p>+ \"Thanks. Love the service BTW. I'm a huge knowledge junkie and AppSumo has been incredible for improving my projects.\"<p>+ \"The reason for the email is I wanted to express a chunk of gratitude, and here's why: I started a sports nutrition company last year, but never really saw the momentum I wanted until I focused on email list building, modeled [from one of your courses].\"<p>- We're bootstrapped and profitable<p>- We test EVERYTHING. We encourage creative, quirky ideas as much as we do logic and efficiency; especially when both are combined.<p>- Benefits: Tacos, competitive salary, equity, challenging work, working with a close-knit team, more tacos.<p>Also see <a href=\"http://appsumo.com/hireme\" rel=\"nofollow\">http://appsumo.com/hireme</a> Apply by emailing hireme@appsumo.com","time":1330617917,"type":"comment"},{"by":"tow21","id":3653887,"parent":3652041,"text":"London/UK, on-site<p>Timetric (<a href=\"http://timetric.com\" rel=\"nofollow\">http://timetric.com</a>) are looking for a Javascript engineer.<p>We're trying to make the world a better place by making data more accessible, and we believe modern web technologies are the best way to do that.<p>The work we do is highly visible in digital media and around the world, and we believe strongly that there are real, hard, problems to be solved in making data visualizations that are both beautiful and - just as important - highly usable.<p>Right now we've got deep and burning need for a Javascript engineer to help us build out our visualization frameworks and design. We've got a lot of great code at the moment; heavy use of Backbone.js to keep the codebase manageable, and we're actively ensuring that we're not held back by legacy browser support. But we've got a lot more that we want to do, and we need your help.<p>* You should be able to think yourself into the user's mind and understand the difference between making complex\noperations seem simple, and treating the user like a moron.<p>* You should have a healthy respect for the issues involved in making rich and usable applications over an asynchronous, unreliable network - and also for the rewards that come from doing it right where few others can.<p>* You should have strong opinions on web usability and design, and be unafraid to express them.<p>* You need to have rock solid JS skills, and a robust understanding of modern HTML and CSS implementations.<p>* You should be used to working in a collaborative environment where everything is run through version control and every line of code is reviewed.<p>* And if you've got a github profile with a portfolio of work for us to look at, we'd be over the moon.<p>Apply to jobs@timetric.com","time":1330634020,"type":"comment"},{"by":"biciblomquist","id":3658104,"parent":3652041,"text":"Social TV / Mobile Gaming Startup in New York, NY, San Francisco, CA and Los Angeles, CA is looking for Software Engineers (Java, Python/PHP, Scala, node.js, C/C++ for Audio Engineering), Web Engineers (Native JavaScript, Ruby on Rails), Mobile Engineers (iOS, iPhone, iPad and Android), Linux System Engineers (Amazon EC2 experience preferred), and Quality Engineers. Full-Time Employees preferred but consultants are okay too. Onsite work is preferred but we're flexible.<p>So, I work for Function(x), a technology driven media company that just launched its first product dubbed Viggle at the end of January 2012. Viggle is the first of its kind rewards/loyalty program for watching TV (I know what you're thinking, someone hadn't done that yet? Apparently not).<p>Viggle allows individuals with smartphones (we've launched an iOS app, an Android app is in the works) to check into your favorite TV shows and get great, REAL rewards such as movie tickets, music, gift cards and much, much more; all just for watching the TV shows you love.<p>As you probably know by now, we're hiring across the board and tackling some pretty interested engineering challenges.<p>Think real-time audio ingestion (\"audio thumbprint\" technology), real-time traffic spikes in users as they check-in to their favorite tv-shows, mobile networking issues, etc.<p>You may also have the chance to work on the \"next\" Function(x) product too.  We can't give away that secret sauce just yet.<p>Here's a link to the Viggle app - <a href=\"http://viggle.com/\" rel=\"nofollow\">http://viggle.com/</a><p>Here's a link to our corporate website (we're are still in start-up mode even thought we're publicly traded) - <a href=\"http://www.functionxinc.com/\" rel=\"nofollow\">http://www.functionxinc.com/</a><p>And here's some press that we've been getting (shameless self promotion isn't bad if it's the last thing you mention, right?) - <a href=\"http://www.functionxinc.com/press/\" rel=\"nofollow\">http://www.functionxinc.com/press/</a><p>If you're interested, check out all our job descriptions here - <a href=\"http://hire.jobvite.com/j/?bj=omXZVfwX&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=omXZVfwX&#38;s=Hacker_News</a><p>Or you can reach out to me at leifrecruiter \"at\" functionxinc \"dot\" com<p>Or at the following two phone numbers: +1-646-619-1327 or +1-516-220-0197<p>Thanks,<p>Leif Blomquist","time":1330718463,"type":"comment"},{"by":"blackcomb","id":3653120,"kids":[3653311],"parent":3652041,"text":"Vancouver/SF/Remote - Blackcomb Games<p>We are a young mobile games studio looking for talented software engineers (front-end, back-end, or both) to join our team.  Game and mobile experience helpful, but not necessary.<p>Requirements: \n* Ability to build and learn quickly<p>* High motivation to work without supervision<p>* Maintain high-quality code<p>* BS in CS or related field, solid fundamentals in data structures, algorithms and design<p>Bonus Skills:<p>* Published iOS, Android, Facebook or web application<p>* Cocos2D, Unity3D<p>Technologies We Currently Use:<p>* Ruby/Rails<p>* MySQL<p>* Javascript<p>* Node.JS<p>* Objective-C<p>* Java<p>jobs@blackcombgames.com","time":1330624025,"type":"comment"},{"by":"mevansmm","id":3652659,"parent":3652041,"text":"NYC, New York, NY<p>Mediamorph (<a href=\"http://mediamorph.com\" rel=\"nofollow\">http://mediamorph.com</a>) is a fully funded, revenue generating company creating end-to-end solutions for media companies to manage reporting and rights.  We have contracts with the largest companies in the media business and are continuing to expand at a breakneck pace.<p>We are looking for full-time Java engineers of all skill levels who are interested in taking ownership of product development as well as working with clients.  You'll be designing systems to parse and analyze huge amounts of transactional data and present it to our customers so that they can drive business decisions.  Java, Postgres, HTML5, JavaScript, MongoDB.<p>We're also looking for a UX engineering to redesign our entire product.  It was created by engineers and it shows.  You'll have total freedom to design in a way that you think is best.<p>Finally, we're looking for a full-time UI developer to do day-to-day UI development work.<p>Email me directly at mason@mediamorph.com.","time":1330618321,"type":"comment"},{"by":"bantic","id":3652715,"parent":3652041,"text":"(New York/remote) MegaPhone Labs (<a href=\"http://bit.ly/mp_ruby\" rel=\"nofollow\">http://bit.ly/mp_ruby</a>): a Manhattan-based startup that designs and develops interactive TV applications and games. Our apps let tens of thousands of simultaneous viewers use their phones/PCs to interact with TV shows in realtime.<p>We're hiring someone to own the http stack (in a company of diverse technologies), which currently is about 80% ruby, 15% node.js, with other technologies (mongo, redis, ec2, backbone, coffeescript, websockets) sprinkled in.<p>Email jobs+ruby@megaphonelabs.com to apply.\nJob description: <a href=\"http://bit.ly/hn_mp_ruby\" rel=\"nofollow\">http://bit.ly/hn_mp_ruby</a><p>We are funded and have 7-figure revenue but are still quite small. We're about to hit our inflection point, and that's why we need you.<p>What we’re offering: We’ll pay you what you’re actually worth, provide full healthcare, commuter benefits, your own office with a view and a door, Netflix vacation policy (take some), and equity.","time":1330618957,"type":"comment"},{"by":"neodude","id":3655578,"parent":3652041,"text":"San Francisco, CA\nPivotal Labs - FULLTIME, REMOTE, H1B.\nWe're one of the best agile development consultancies around. We're looking for sharp, empathetic software developers, mainly working on web (Rails, JS) and mobile (iPhone, Android) projects. Past clients include Groupon, Twitter, Google, Gowalla. We also build Pivotal Tracker, an agile project management tool.\nYou don't have to be an expert in Rails or the mobile frameworks to get a job here - as long as you are pleasant to work with and willing to learn, that's good enough. Since we pair every day, you'll pick up what you need to know very quickly. After just a month at Pivotal I felt I had improved leaps and bounds as a developer and learnt a tremendous amount about Rails that I didn't know before.\nGive me a ping - thomas@pivotallabs.com. Read more about how we work: <a href=\"http://pivotallabs.com/jobs/welcome\" rel=\"nofollow\">http://pivotallabs.com/jobs/welcome</a>","time":1330668754,"type":"comment"},{"by":"svec","id":3652480,"parent":3652041,"text":"Boston, MA<p>Ember is hiring a Support Engineer:<p><a href=\"http://www.ember.com/company_career.html?id=507\" rel=\"nofollow\">http://www.ember.com/company_career.html?id=507</a><p>At Ember we make chips and software for low power wireless networks. We do all of the software, from the lowest level embedded firmware, through the complete Zigbee/802.15.4 networking stacks, all the way to the developer and debug tools used to actually test and deploy our chips/networks. We do all of the hardware too: chip and board design, as well as the development tools our customers use.<p>Our support engineers get their hands dirty with all levels of customer support: hardware, software, networking, you name it, you get to learn about it, and help customers work with it!<p>Ember is a great place to work. I know, most people and companies say that, and they may be right, but I know for sure that I'm right! We're a small-ish company, and we really enjoy working with each other.<p>Please email me with any questions about the job or Ember: hnmarch2012@saidsvec.com","time":1330616216,"type":"comment"},{"by":"snikolic","id":3652490,"kids":[3692276],"parent":3652041,"text":"Boston/Cambridge, MA<p>Crimson Hexagon is actively looking for:<p>1) An awesome UI/UX developer who writes smart HTML/CSS and appreciates both beautiful design and beautiful Javascript.<p>2) An intern who is a PhD student in machine learning, computational linguistics, or statistics with strong programming skills and an interest in the social sciences.<p>3) Any hackers generally interested in machine learning, distributed systems, and big data.<p>We use proprietary machine learning algorithms to measure public opinion about major brands, politics, etc. using the social web -- including the full Twitter firehose -- as our datasource. We make our findings available to our customers via a beautiful web product. We've collected, indexed, and are constantly mining an archive of over 100 billion web and social media documents, adding another 2+ billion each week.<p>Small and tight-knit team (7 engineers, 2 research scientists), plenty of free food and beer, impressive customer list, $5mm+ in funding, and growing fast.<p>Drop me a line at stefan@crimsonhexagon.com","time":1330616316,"type":"comment"},{"by":"lt_kije","id":3658128,"parent":3652041,"text":"Madison, WI, USA - Linux Operator (fulltime, no remote)<p>I'm leaving my awesome job in the University of Wisconsin Department of Physics at the end of this month and I want you to take over.<p>Our group operates a large (&#62;=1PB disk, &#62;=2500 cores) analysis facility that physicists from Wisconsin and around the world use to search for the Higgs boson (we're part of the CMS collaboration at the LHC). We work with peers at universities across the US and Europe to provide dozens of PB and millions of hours of computing each day. We write programs, share our code, optimize systems, distribute computing and occasionally rack hardware.<p>We like Python, Perl, Mercurial, shell tricks, SSH, Jabber, Ganglia, Apache and Nginx, Varnish and Squid, Scientific Linux (it's like Centos), APIS, (more) metrics, (fewer) alerts, CFEngine, Hadoop, Condor, KVM and libvirt, AFS and FUSE. We're reflexively open:<p><pre><code>    http://hg.hep.wisc.edu/\n    http://ganglia.hep.wisc.edu/ganglia\n</code></pre>\nYou don't need to have worked with many or any of the above, but you're excited about learning (or teaching us why your way works better). You're familiar with running a Linux system and wonder what breaks when you run hundreds of them. Repetitive tasks irritate you; open-ended problems pique your interest. You look forward to learning from colleagues with deep knowledge of C and systems programming; distributed computing; statistics and data analysis; and Indian food. You've been looking for a job where you're free to choose the right tech for the problem at hand and you itch to justify the choice empirically. Most of all, you're curious.<p>The position hasn't yet been officially listed, but I'd love to talk to you. Please feel free to email me at wcmaier@hep.wisc.edu or grab me on IRC (lt_kije on freenode). If you're a student, we'll take you on as a student hourly until you graduate. Otherwise, the university only likes to hire people with a BS/BA.","time":1330718782,"type":"comment"},{"by":"JacobAldridge","id":3653059,"kids":[3681975],"parent":3652041,"text":"Reading, UK, Intern (Paid)<p>Shirlaws business coaching is looking for a paid intern (possibly recent graduate or sandwich course student) to add (more) fun to our UK team. Suited to a business / marketing individual with initative who wants to learn more about business in the real world, and take responsibility for activities like social media, events, etc.<p>Our team of coaches (including me) apply pretty nifty business frameworks to help entrepreneurs grow their business (whatever that means for them).<p>We want to learn from you. And you'll also be able to take our coach development training program, and see our business material first hand. We'll work with you to design the specific six or 12 month (ish) program to suit your needs. Could be excellent grounding if you consider yourself entrepreneurial but aren't quite sure how to get started.<p>See www.shirlawscoaching.co.uk for more details about our business, or email me (see my profile) with any questions or to learn more about the role.","time":1330623140,"type":"comment"},{"by":"BraintreeR","id":3653041,"parent":3652041,"text":"Chicago, IL - Braintree<p>FULL TIME or INTERN Engineers<p>Braintree helps businesses process credit card payments by providing a merchant account, payment gateway, recurring billing and credit card storage. We're unlike others in the industry; we think and do things differently.<p>We mostly work with Ruby/Rails, but consider ourselves polyglots. Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node.js, PHP, Java, .NET, Perl, and Objective-C<p>More about our people, practices, and software: \n<a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a> .","time":1330622932,"type":"comment"},{"by":"zuzanka16","id":3667134,"parent":3652041,"text":"C++/Qt Software Engineer - London<p>Mendeley is recruiting an experienced C++ software engineer. You will be joining a small team of engineers developing our flagship cross-platform desktop application with 2 million user sessions per month. Your core task will be to help build a high quality application, including a great front end in Qt and web technologies. You'll work closely with our UX design team, and bring experience with client/server technologies, preferably with rich clients. You'll have worked in a leadership role in an Agile (preferably XP) environment, either as a technical or a team lead. You'll play a key role in developing both the software and the processes that will deliver the best reference manager on top of our amazing data set.<p>Please see details at <a href=\"http://www.mendeley.com/careers/london-cpp-qt-software-eng/\" rel=\"nofollow\">http://www.mendeley.com/careers/london-cpp-qt-software-eng/</a>","time":1330966165,"type":"comment"},{"by":"tomh-","id":3652139,"parent":3652041,"text":"Amsterdam, Netherlands - Netsociety<p>Netsociety is searching for a pro-active, goal-oriented and innovative person who is motivated to work in a young team of developers. As a developer you will be working on challenging projects with big data using distributed index systems.<p>The job is an outstanding opportunity for young technology-oriented individuals eager to learn latest technologies, distributed computing, develop their experience and meet lots of challenges!<p>Profile:<p>- Knowledge in .NET, C# 3.0 or higher. Skills in working with LINQ/Entity Framework, SQL Server, WCF would be considered as an advantage<p>- University degree or current enrollment in University program (computer science, information technology)<p>- Solution-oriented attitude and eager to learn<p>- Good comprehension of English<p>Netsociety offers:<p>- Flexible working time<p>- Young and motivated team<p>- Good salary<p>- Covering of travel costs<p>- Lots of fun :-)<p>The position is open for Dutch as well as international residents.<p>For more information please visit <a href=\"http://www.netsociety.nl/en/vacancies/net-developer\" rel=\"nofollow\">http://www.netsociety.nl/en/vacancies/net-developer</a>","time":1330611768,"type":"comment"},{"by":"vshastry","id":3653226,"parent":3652041,"text":"San Francisco Bay Area (Menlo Park) - ETRADE Developer evangelist<p>We're creating a new platform to help developers and institutions build creative solutions to address the massive unsolved problems in the financial services industry. The group is going to be run like a startup inside the larger company - very small and fast iterations.<p>We're looking for folks to help us evangelize the platform - talk to developers about their needs and translate them into improvements on our side, work with developers as they integrate our API into their solutions, and be the voice of ETRADE as we work with the community to build great product.<p>You should have experience creating applications or platforms, ideally including experience in mobile platforms and common HTTP Web Services protocols, including XML-RPC, SOAP and REST.<p>You can learn more / apply at <a href=\"http://bit.ly/wHz8F0\" rel=\"nofollow\">http://bit.ly/wHz8F0</a> or ping me - I run the team. Thanks!","time":1330625166,"type":"comment"},{"by":"garysieling","id":3652079,"parent":3652041,"text":"Greater Philadelphia (Whitpain/Blue Bell). Full time, Interns.<p>Wingspan Technology has a series of enterprise software products for integration between Sharepoint &#38; Documentum, and SaaS verticals. We're working on some big projects and new products and growing fast.<p><a href=\"http://www.wingspan.com/careers/\" rel=\"nofollow\">http://www.wingspan.com/careers/</a>","time":1330610874,"type":"comment"},{"by":"johnnyg","id":3653214,"parent":3652041,"text":"Houston, TX, System Administrator, Full Time (NO REMOTE)<p>We support a family of CPAP websites including CPAP.com, CPAPtalk.com, HMSSleep.com and CPAPDropShip.com. We sell CPAP equipment, manage a CPAP forum and provide outsourced services to other CPAP providers.<p>We have a two person IT team with chops looking to add a third of similar skill. The newest portion of our business is growing fast and we are beefing it up to scale.<p>XenServer/Nexenta SANs supports a stack including PHP/MySQL/jQuery/RabbitMQ/Asterisk<p>Three HNers freelance with us on the coding side, but we prefer local Sys Admins to remote.  GM is a coder and manages the team.<p>1 on 1 skype sessions with people working here now for unfiltered Q&#38;A are available on request.<p>Phone interviews are done remotely with an etherpad clone and take 30 min to an hour. No harm in scheduling and interview, looking at the hard questions and taking a pass.<p>If interested, please email times good for you to johnny@cpap.com.","time":1330625021,"type":"comment"},{"by":"jtmcmc","id":3664636,"parent":3652041,"text":"Menlo Park / Bay Area, CA<p>We are Badgeville a fast growing exciting startup that is about allowing websites to better engage with their users through among other things gamification! We use rails on the backend and have both a javascript and REST API.<p>See an article in NYTimes about us and one of our partners samsung <a href=\"http://www.nytimes.com/2012/02/05/business/employers-and-brands-use-gaming-to-gauge-engagement.html?_r=1\" rel=\"nofollow\">http://www.nytimes.com/2012/02/05/business/employers-and-bra...</a> and a recent tech crunch article on us <a href=\"http://techcrunch.com/2012/01/10/badgeville-proves-gamification-is-here-to-stay-as-recyclebank-others-buy-in/\" rel=\"nofollow\">http://techcrunch.com/2012/01/10/badgeville-proves-gamificat...</a><p>We are looking for a number of jobs you can see the list: <a href=\"http://badgeville.jobscore.com/list\" rel=\"nofollow\">http://badgeville.jobscore.com/list</a><p>In particular we are looking for \nTechnical Support Engineers - Act in a customer facing role, helping to assist clients integrate Badgeville's javascript and REST APIs with their websites. Programming experience in at least one language is required with knowledge of javascript a big plus.<p>and<p>Technical Account Managers - You will own a client's technical implementation of the Badgeville platform, architecting an appropriate solution. You will be in charge of both educating the client, developing relationships with the customer development teams and working with our producers to build the most successful possible implementation of our product.<p>See the full job description for Technical Account Managers at <a href=\"http://badgeville.jobscore.com/jobs/badgeville/technical-account-manager/d0LsT4oVOr4BiceJe4bk1X\" rel=\"nofollow\">http://badgeville.jobscore.com/jobs/badgeville/technical-acc...</a><p>Feel free to email me at justin@badgeville.com if you have any questions about what we do, any of the jobs listed or what color you should dye your hair.","time":1330905047,"type":"comment"},{"by":"ginkgobioworks","id":3666948,"parent":3652041,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology<p>Ginkgo BioWorks is a small, fast paced MIT startup that genetically engineers organisms that make the world better. Come learn how to re-program DNA to create fuel producing bugs! Help us use state of the art technologies to create a production pipeline for organism engineering!<p>Relevant skills: Creativity, Drive, Commitment, and some programming skills.<p>What you will learn: synthetic biology, metabolic engineering, computer aided manufacturing of modified genomes, modeling of cells, bioinformatics, robotics automation, software engineering, UI/UX, Ruby/Rails, database, and more.<p>For more, see: <a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a><p>Apply here: <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1330963594,"type":"comment"},{"by":"LiveTheDream","id":3653896,"parent":3652041,"text":"Tapad - New York, NY (Chelsea)<p>We make mobile and cross-platform advertising smart and effective.<p>We built a real-time advertising platform that handles tens of thousands of requests per second. We are improving and scaling that all the time, as well as building tools that bring real value to mobile advertising, such as desktop-to-mobile retargeting and rich analytics.<p>Main languages in use at the moment are Scala for the heavy lifting, Ruby (on Rails), and JavaScript for UIs. We deploy constantly, and we have a <i>lot</i> of data to play with. Engineering drives the company, which is now pushing 20 full-timers.<p>If you are smart, productive, and like working with great people on a high performance system, I want to talk to you!<p>We are hiring for backend, front-end, and big data engineers. Drop me a line to chat: toby at tapad dot com . Link to github account or a personal website with some of your projects is a major plus.","time":1330634135,"type":"comment"},{"by":"bentaber","id":3653310,"parent":3652041,"text":"Boulder, CO<p>Markit On Demand, <a href=\"http://jobs.markitondemand.com/\" rel=\"nofollow\">http://jobs.markitondemand.com/</a><p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour.<p>We're looking for developers and engineers up and down the stack at all levels.","time":1330626358,"type":"comment"},{"by":"apgwoz","id":3652420,"parent":3652041,"text":"New York, NY - Software Engineer - Full-time<p>OkCupid is hiring engineers. <a href=\"http://www.okcupid.com/careers/we-are-hiring\" rel=\"nofollow\">http://www.okcupid.com/careers/we-are-hiring</a>. In addition to OkCupid.com proper, there's another group building brand new things in the social space. Same application process for both.","time":1330615548,"type":"comment"},{"by":"vital101","id":3652331,"parent":3652041,"text":"DDM (teamddm.com) - Grand Rapids, MI<p>PHP/Javascript Developer<p>This position is part of a full-service marketing firm with a nimble interactive group. The team works to create and develop effective, hard-working mobile apps, scalable websites, and web-based applications. This is a fast-paced, creative and flexible environment — your contributions (code, ideas and preferences) will immediately and directly affect the solutions we provide.<p>We're especially looking for someone who can supplement and advance our app development efforts, so an advanced understanding of Javascript is a must - and some Objective-C experience is a huge plus.<p>Check out <a href=\"http://www.teamddm.com/about-team-ddm/join-our-team/web-developer-javascript-php-mysql\" rel=\"nofollow\">http://www.teamddm.com/about-team-ddm/join-our-team/web-deve...</a> or email me directly at jacks at teamddm.com with \"Hacker News\" in the subject line.","time":1330614419,"type":"comment"},{"by":"scraplab","id":3668161,"parent":3652041,"text":"London, UK. Full time.<p>Front-end Developer at Newspaper Club.<p><a href=\"http://www.newspaperclub.com\" rel=\"nofollow\">http://www.newspaperclub.com</a><p>We help anyone make and print their own newspapers. We believe the web is too important to be left to screens, and that newsprint is a highly evolved technology too. We build things that combine the two, using each medium for what it's best at.<p>We're looking for a great front-end developer to work alongside our co-founder and engineer (me, @tomtaylor) and form the start of a tight knit development team.<p>You'd be our first engineering hire, and we're looking for someone with solid Javascript experience, but happy to get stuck in across the whole stack. Enthusiasm and attitude count for more than lines on the CV.<p>If you're interested, drop us a line at jobs@newspaperclub.com, with a note about yourself and links to things you think we'd find interesting (eg. Github account, CV, portfolio).","time":1330978585,"type":"comment"},{"by":"jack","id":3652442,"parent":3652041,"text":"Vancouver, BC<p>Clio (<a href=\"http://www.goclio.com\" rel=\"nofollow\">http://www.goclio.com</a>) provides web-based practice management, time &#38; billing and client collaboration tools for lawyers.<p>We are fresh off of raising a $6m financing round, and are looking to add to our kick-ass team.<p>We are hiring:<p>* Ruby on Rails Developers \n  <a href=\"http://clio.theresumator.com/apply/K7A6Tc/Software-Developer-Ruby-On-Rails.html\" rel=\"nofollow\">http://clio.theresumator.com/apply/K7A6Tc/Software-Developer...</a><p>* Mobile Developers   \n  <a href=\"http://clio.theresumator.com/apply/Z6lII4/Software-Developer-Mobile.html\" rel=\"nofollow\">http://clio.theresumator.com/apply/Z6lII4/Software-Developer...</a><p>* UI Designers\n  <a href=\"http://clio.theresumator.com/apply/9qO3Ul/UI-Designer.html\" rel=\"nofollow\">http://clio.theresumator.com/apply/9qO3Ul/UI-Designer.html</a><p>We offer a flexible and fun work environment, competitive salary and benefits, and awesome co-workers.","time":1330615806,"type":"comment"},{"by":"beck5","id":3652673,"parent":3652041,"text":"7digital .Net &#38; JavaScript devs, Sys Admin - London UK<p>7Digital is electronic media company (music and books), our API powers Samsung Music, Blackberry, Ubuntu our own website and loads more. Now also do ebooks powering services like Waterstones. Loads of interesting problems including scaling an API to serve 170,000+ requests per hour, processing and serving hundreds of TB's of data world wide while innovating. You get 10% of your time to innovate with, regular katas/dojo's. We are established, 7 years old, and profitable, 70+ people based in main old street office, ~45 of which are technical jobs. Fantastic work mentality, we always work the right way even if it takes a little longer, i.e. we don't cut corners on quality. <a href=\"http://about.7digital.net/careers\" rel=\"nofollow\">http://about.7digital.net/careers</a>","time":1330618456,"type":"comment"},{"by":"kola","id":3654666,"parent":3652041,"text":"Palo Alto, CA<p>(H1b Welcome)<p>Groupon recently acquired Mertado (YC W2010) to build Groupon Goods. The Groupon Goods team is hiring a number of engineers to help build a discovery-based e-commerce platform and unique user experiences to delight our consumers.<p>Some of our open positions -<p>* Software Engineer Backend - <a href=\"http://www.groupon.com/jobs?jvi=oPZFVfw8,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=oPZFVfw8,job</a>\n* Software Engineer Frontend - <a href=\"http://www.groupon.com/jobs?jvi=ogoSVfwb,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=ogoSVfwb,job</a>\n* E-Commerce Architect - <a href=\"http://www.groupon.com/jobs?jvi=o7f2Vfw3,job\" rel=\"nofollow\">http://www.groupon.com/jobs?jvi=o7f2Vfw3,job</a><p>We use - Ruby on Rails, MySQL, JavaScript, Redis, CoffeeScript, Backbone.js and more.<p>Other jobs @ Groupon: <a href=\"http://www.groupon.com/jobs\" rel=\"nofollow\">http://www.groupon.com/jobs</a>","time":1330645470,"type":"comment"},{"by":"cristinacordova","id":3653285,"parent":3652041,"text":"Palo Alto, CA (across the street from the downtown Palo Alto Caltrain station) - Full-Time<p>We're looking for people to fill the following roles on our 18-person team:<p>Backend Engineer, iOS Engineer, Web Engineer, Android Engineer, Data Scientist, Product Designer<p>Pulse makes the most downloaded news application for iPhone, iPad, Android and Windows Phone. At Pulse, you will work closely with a close team of experienced engineers. Each of us is part engineer, hacker and product designer. Pulse was originally founded in the Stanford Design School. Beautiful, user-centric design is at the heart of our product and work. We recently raised a Series A round of funding led by NEA and Greycroft.<p>Find out more about us here: <a href=\"http://www.pulse.me/jobs/\" rel=\"nofollow\">http://www.pulse.me/jobs/</a> and feel free to find out more about us at cristina@pulse.me","time":1330625948,"type":"comment"},{"by":"LStechrec","id":3652775,"parent":3652041,"text":"Washington, DC or REMOTE - LivingSocial is looking for passionate Rubyists! <a href=\"http://bit.ly/A8S6l6\" rel=\"nofollow\">http://bit.ly/A8S6l6</a><p>We’re on the hunt for candidates who can make software languages bend to their will.  Due to our high traffic, there are technical scaling challenges that few companies experience.  As a member of our skilled team, you will build and maintain applications deployed to millions of users.  This is a fast-paced agile environment where code you write today will be live on our site tomorrow (Continuous Deployment FTW!)  and we need the best and the brightest to help us build better, more robust applications.  We’re not saying it’s going to be easy but if you enjoy building awesome products that are widely known/used this might just be the opportunity for you.","time":1330619565,"type":"comment"},{"by":"KoryFerbet","id":3653128,"parent":3652041,"text":"Seattle WA, Permanent positions.\nCurrently working with five different companies all looking for PHP developers.\n- The worlds largest video chat platform. It's used to host \"cam girl\" sites so anyone interested must be okay with adult entertainment.\n- Casual Gaming company is looking for an eCommerce developer to build out their online platform\n- Profitable startup in the project management SAAS space.\n- Company that focuses on education. Hosts study guides, book summaries, quizzes, etc..\n- Heavily funded social network/eCommerce company<p>These are all full time permanent positions and job descriptions can be found at <a href=\"http://www.bullhornreach.com/company/jobs\" rel=\"nofollow\">http://www.bullhornreach.com/company/jobs</a>.<p>You can apply via that link or send me an email for more information Kory@imatch.com","time":1330624123,"type":"comment"},{"by":"antgoldbloom","id":3654978,"kids":[3669121],"parent":3652041,"text":"Kaggle - San Francisco, CA\nWe're looking for:\n* Product Manager\n* VP Engineering\n* Data scientists\n* Developers (REMOTE)<p>More information at <a href=\"http://www.kaggle.com/careers\" rel=\"nofollow\">http://www.kaggle.com/careers</a><p>Kaggle has just closed a large Series A ($11.25m). Our early employees will help shape Kaggle's direction and grow along with the company. Regardless of the position, you should have a strong interest in data science and the intellectual curiosity to engage with competition clients from a wide variety of fields.\nKaggle is aiming to build a meritocratic marketplace that will change the way data science gets done. Read more at: <a href=\"http://www.businessweek.com/magazine/kaggles-contests-crunch..\" rel=\"nofollow\">http://www.businessweek.com/magazine/kaggles-contests-crunch...</a>.","time":1330652303,"type":"comment"},{"by":"bobbyi","id":3652436,"parent":3652041,"text":"San Francisco, CA<p>Affine Systems generates data about online video using computer vision (face recognition, product recognition, scene classification, etc.) for advertisers to use in targeting and filtering their online video campaigns.<p>We did over a million dollars in revenue over the last two years working on campaigns for major brands. We recently raised our B round, led by Crosslink Capital, the investors behind Pandora.<p>We are looking for test-driven engineers to work on an internet-scale video processing pipeline using Python, MySQL, Hadoop, Selenium, ffmpeg and other open source tools. Its goal is to find and ingest videos from web pages and to generate and store metadata about those videos using our vision algorithms written in C++.<p>If interested, please contact me (founder/ chief engineer) at bobby@affine.tv<p>Thanks.<p>ITERN and H1B are welcome. No REMOTE hires, please.","time":1330615732,"type":"comment"},{"by":"matthanger","id":3653277,"parent":3652041,"text":"Indianapolis IN (full time, local)<p>Courseload <a href=\"http://courseload.com/\" rel=\"nofollow\">http://courseload.com/</a><p>We are a funded startup seeking our third software engineer. We deliver e-textbooks and digital course materials with the goal of reducing costs to students and improving educational outcomes. Meet some of our team: <a href=\"http://www.youtube.com/watch?v=47Tx21C-7G0\" rel=\"nofollow\">http://www.youtube.com/watch?v=47Tx21C-7G0</a><p>We're ~75% front-end (JavaScript/CoffeeScript) and ~25% back-end (Python). We iterate quickly and release often, and have a strong devops mentality.<p>We're looking for a professional with strong front-end skills, attention to detail, and the proven ability to ship. If you think you can help improve the educational experience for students and instructors then let's talk. matt @ courseload.com","time":1330625827,"type":"comment"},{"by":"squirrel","id":3653409,"parent":3652041,"text":"London (UK) and Boston (US).<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development.<p>We use Java, Scala, and some Groovy; we always write tests first and pair on most coding tasks. Developers have Linux workstations with at least two monitors. We have weekly lightning talks that cover finance and technical topics. We have \"real\" 10% time for relevant projects prioritised by developers.<p>Some of you may know us from our sponsorship of Hacker News meetups in London. See <a href=\"http://devblog.timgroup.com\" rel=\"nofollow\">http://devblog.timgroup.com</a> and <a href=\"http://www.timgroup.com/careers\" rel=\"nofollow\">http://www.timgroup.com/careers</a> for more about us.<p>Note we recently changed our name from youDevise to TIMGroup but we're still the same folks!","time":1330627450,"type":"comment"},{"by":"cadr","id":3653138,"parent":3652041,"text":"San Francisco, CA - Blurb\nBlurb lets people tell their stories - currently through print-on-demand books, but increasingly through other venues.<p>We are both established and growing like mad (we were #47 on last year's Inc 500). We have a great group of people and a lot of fun challenges in the year ahead. We just launched a bevy of new products (our iPhone app is getting great reviews).<p>We play with fun tech: Ruby, Rails, ember.js, git, RSpec, Cucumber, Haml, SASS, RabbitMQ, Puppet, Obj-C, and more.\nWe have great benefits, a great work/life balance, and we're in a great location close to the BART, CalTrain, and lots of food options.<p>We are currently hiring for many positions - front end, back end, QA and more - at all levels.<p><a href=\"http://www.blurb.com/join_us\" rel=\"nofollow\">http://www.blurb.com/join_us</a>","time":1330624300,"type":"comment"},{"by":"jsherry","id":3652382,"parent":3652041,"text":"New York, NY<p>CB Insights is a National Science Foundation-backed company using publicly available data sources to assess the health of private companies: <a href=\"http://www.cbinsights.com/\" rel=\"nofollow\">http://www.cbinsights.com/</a> <a href=\"http://www.cbinsights.com/mosaic/\" rel=\"nofollow\">http://www.cbinsights.com/mosaic/</a><p>We are seeking a software engineer who is proficient in PHP and MySQL, and has an overall passion for big data.  Pluses include experience plugging data in JS-based charting libraries (such as amCharts), building APIs and integrating third-party APIs.<p>We've already hired 4 engineers in 2012, so we're growing aggressively.  If this sounds like you we'd love to hear from, so please shoot us a resume and a note expressing your interest to career@cbinsights.com.","time":1330615005,"type":"comment"},{"by":"jedberg","id":3652996,"kids":[3653027],"parent":3652041,"text":"Los Gatos, CA Netflix<p>Looking for Senior SREs.<p>Basically, we're acting like a new company to take streaming global and make it so convient that it is better than the free options.<p>I'm looking for people to help make sure that any time someone wants to find and play a movie, they can.<p>We're solving lots of really interesting problems, like how do you maintain a reliable service on hardware that is unreliable and you don't control (Amazon Web Services).<p>Our group also gets to help teach other groups how to build for scale.<p>Come join me!<p>You can get more info here:<p><a href=\"http://jobs.usethesource.com/item?id=166\" rel=\"nofollow\">http://jobs.usethesource.com/item?id=166</a><p>Or here: <a href=\"http://www.reddit.com/comments/jyaqd/\" rel=\"nofollow\">http://www.reddit.com/comments/jyaqd/</a><p>Or here: <a href=\"https://signup.netflix.com/Jobs?id=oHxbWfw5\" rel=\"nofollow\">https://signup.netflix.com/Jobs?id=oHxbWfw5</a>","time":1330622313,"type":"comment"},{"by":"awaljobs","id":3656154,"parent":3652041,"text":"Django Contractor, London, UK<p>The company and the position originally founded in 1997, AWAL has empowered independent artists and labels to take control of their own destinies and bypass the gatekeepers of the old music industry allowing anyone to sell their music digitally.<p>We're a small team of dedicated individuals who are passionate about music.<p>Your day-to-day responsibilities will be building features, fixing bugs, maintaining servers and greasing the cogs of the platform.<p>This is a full-time freelance role starting ASAP.<p>You\nYou like to get things done, get your hands dirty and dive into code. You favour the command line where possible. You care about the quality of your code as much as you care about the quality of its results. Hopefully you'll be able to provide links to things you've worked on and example code.<p>You'll need to be eligible to work in the UK and in commutable distance of our London office.<p>What you'll get<p>- competitive day rate<p>- comfortable working environment in a music studio in north-west London<p>Skills we want to see\n - Django/Python (2/3+ years commercial experience)<p>- Postgres<p>- good knowledge of HTML/CSS (though you don't have to be a front-end expert)<p>- some JS/jQuery<p>- version control (preferably git or mercurial)<p>- basic *nix server administration<p>Bonus skills<p>- administering Xserve/OS X Server<p>- a standards-driven, semantic approach to HTML/CSS<p>- functional and/or unit testing<p>Applying\n - send a cover letter<p>- details of availability<p>- your CV, including references<p>- sample URLs to sites and code (e.g. GitHub/Bitbucket) you've worked on<p>- to techjobs@awal.com<p>Recruitment agencies: Please don't call or email. If we need you we'll get in touch. Promise!","time":1330685385,"type":"comment"},{"by":"davedd","id":3652669,"parent":3652041,"text":"REMOTE - Sucuri (sucuri.net): Junior (Security) Support analyst:<p>Description: As a Junior Support Analyst you will be required to troubleshoot web site security issues (learn to fix them), analyse and decode malware, patiently engage with clients, and learn a lot about security :)<p>We employ manual and automated techniques to analyze, decode, and fix web-based malware. The right candidate will have the opportunity to learn and apply these techniques in their day-to-day duties. If you like the challenge of fixing broken websites and reversing the effects of malware, then you’ll love this job.<p>Email: dd@sucuri.net\nLink: <a href=\"http://blog.sucuri.net/2012/02/sucuri-hiring-junior-support-analyst.html\" rel=\"nofollow\">http://blog.sucuri.net/2012/02/sucuri-hiring-junior-support-...</a>","time":1330618395,"type":"comment"},{"by":"jdavid","id":3652297,"parent":3652041,"text":"San Francisco, CA ( Market and California )<p>Twitvid is a leading social video network with millions of users, millions of videos, hundreds of millions of video views, and over 150 use our service to broadcast their videos to their millions of followers.  We have Celebrities using our service to break down the barriers; making the internet just that more intimate.<p>At Twitvid we found a product that people like, and now we are looking for smart engineers to make it better.<p>If you are a smart engineer, we want you.  Don't worry too much about this role in specific, we have a number of needs as a backend engineer, javascript, and as3.<p><a href=\"http://ongig.com/jobs/twitvid/Back-end-Developer--twitvid-Financial-District\" rel=\"nofollow\">http://ongig.com/jobs/twitvid/Back-end-Developer--twitvid-Fi...</a>","time":1330614009,"type":"comment"},{"by":"wildcog","id":3653865,"parent":3652041,"text":"San Francisco Bay Area / NYC. Onsite. Full-time or Contract.<p>We work for you. We are agents for professional engineers. The \"Top 100\" technology companies in the world are hard to get into. Almost impossible. We provide an alternate path. We listen to what you want. We guide you through the broken hiring process. Advise you on how each company works. What they look for. How they interview. What their offers mean.<p>We are Wildcog. Companies like Tumblr, Twitter and Apple do not work with recruiters. They do work with us. We want to work with you.<p>We are working for Software Engineers, Data Scientists and Devops. W are working with brilliant early-stage startups and the top companies on the web.<p><a href=\"http://wildcog.com\" rel=\"nofollow\">http://wildcog.com</a> - hn@wildcog.com - 415-683-1231","time":1330633704,"type":"comment"},{"by":"rdmirza","id":3674149,"parent":3652041,"text":"Position: Interactive/graphic designer<p>We’re looking for an exceptional Interactive / Graphic Designer with a strong design portfolio to join our San Francisco development team. We take on very ambitious projects, and we need a daring visionary, excited to conceive new possibilities, re-imagine what doesn’t work, and improve what’s been successful.<p>The Designer will work together with the creative, tech and strategy teams designing cutting-edge user interfaces for web, mobile apps, software &#38; applications. This position will also be deeply involved in branding work for both client &#38; internal projects.<p>We are looking for a strong creative who’s passionate about design and eager to create experiences that inspire interaction and conversation. We’re growing fast and are seeking a contributor who‘s excited for an entrepreneurial adventure and is looking to make an immediate impact.<p>We're looking for:<p>* A minimum of 3 years of relevant studio / agency experience. Experience working within varied design teams (Web / App/ UX / ID) a plus.<p>* Formal education in graphic design; a bachelor’s degree (or beyond) is preferred.<p>* Fluent with Adobe CS, including Illustrator, Photoshop, and InDesign. CSS/Javascript and HTML skills are a definite plus.<p>* Experience in user interface design and usability<p>Bonus points:<p>* Significant experience with mobile apps (iOS, Android, or WebOS)<p>* Experience with branding &#38; graphic chart projects<p>* Experience in creating wireframes and flow through<p>About us:\nfaberNovel helps large organizations think and act like startups. We combine technology, design and emerging trends to invent new products, services, and experiences. Founded in 2003, faberNovel has grown into a team of 70 passionate business, design and technology experts based in Paris, San Francisco, New York and Moscow. From conception to realization, we make things happen.<p>To apply, send your resume &#38; portfolio to: larapagnier@fabernovel.com","time":1331091417,"type":"comment"},{"by":"finken","id":3653314,"parent":3652041,"text":"Berkeley, CA - earthmine inc. - INTERN and Full-Time - <a href=\"http://www.earthmine.com\" rel=\"nofollow\">http://www.earthmine.com</a><p>We’re looking for:<p>* Lead Web Developer (front and back-end)<p>* Lead Mobile Developer (immediate need for iOS dev.)<p>More details:<p>* <a href=\"http://www.earthmine.com/Company?Jobs\" rel=\"nofollow\">http://www.earthmine.com/Company?Jobs</a><p>Us:<p>earthmine collects, processes, and delivers high-resolution, 3D street-level panoramas.  How are they 3D?  Every non-sky pixel in the panorama has a 3D coordinate: latitude, longitude and elevation.  earthmine data is powering applications ranging from innovative local search and augmented reality to 3D mapping, GIS and asset management systems.<p>Interested?<p>* contact me directly: josh [dot] finken [at] earthmine [dot] com<p>* or, <a href=\"http://www.earthmine.com/contactus\" rel=\"nofollow\">http://www.earthmine.com/contactus</a>","time":1330626381,"type":"comment"},{"by":"britman","id":3656563,"parent":3652041,"text":"LONDON, UK - based in kennington close to the Oval cricket ground.<p>My team are building out our next generation Cloud based sports pricing platform (more: <a href=\"http://www.sportingsolutions.com/products/c2e\" rel=\"nofollow\">http://www.sportingsolutions.com/products/c2e</a>).<p>Full job specs can be seen here:\n<a href=\"http://careers.stackoverflow.com/jobs/16736/senior-developer-c-sharp-net-cloud-platform-team-sporting-solutions\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/16736/senior-developer...</a>\n<a href=\"http://careers.stackoverflow.com/jobs/16928/senior-user-interface-developer-html5-sporting-solutions\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/16928/senior-user-inte...</a><p>Any questions or CV's to abritcliffe [at] sportingindex.com\nCheers.","time":1330696565,"type":"comment"},{"by":"bobwaycott","id":3653037,"parent":3652041,"text":"Chattanooga, TN<p>Small interactive shop that focuses on both client projects and our own products.<p>Looking for front-end &#38; back-end developers. Python and Ruby are our primary server-side languages for current &#38; upcoming work. We have a heavy amount of development work that comes from SF-area clients (most recent clients include Teak (www.teakdigital.com) and Snapfish (just finished building photosuite.snapfish.com)).<p>Our products include markup.io, showoff.io, and nextroomapp.com (an iOS app &#38; web-based service), though they've suffered an unfortunate amount of neglect this past year. We're trying to build up a good team to both change that and work on some new products, too.<p>Looking for both freelancers and girls/guys who want to be part of a creative team long-term.<p>bob@thisismedium.com","time":1330622918,"type":"comment"},{"by":"nkoren","id":3653148,"parent":3652041,"text":"I'm looking for a London-based lead developer/technical Co-founder. This is for a web-based collaborative transport planning platform, with elements of simply CAD/GIS built on top of Google Maps. Not to be immodest, but we're seriously aiming to change the way that cities are designed. Un-funded as of yet, but expect funding within 6 weeks, so time to start collecting CVs.<p>You need to be a Javascript God, with experience in deploying large, complex, UI-intensive web applications. Experience in CAD / GIS / Drawing / 3D Modelling applications is very desirable, but being a quick learner is even more important. You also need to be a good project manager in an agile development environment, with excellent people skills.<p>Email me at nkoren@gmail.com.","time":1330624423,"type":"comment"},{"by":"SatvikBeri","id":3652200,"parent":3652041,"text":"Lattice Engines (www.lattice-engines.com) - Manhattan, NY<p><i>Analytics Engineer</i><p>As the Analytics Engineer, you will use SQL and analytics tools to transform business requirements into actionable data &#38; analytics.  You are adept at solving unforeseen problems in a creative manner.  You thrive in a fast-paced and dynamic environment.  You fluently convey complex ideas to colleagues and customers.<p>Responsibilities \nExecute data analysis, ETL, and data mining to support customer deployments\nConfigure enterprise Big Data analytics platform and tools\nWork closely with a customer delivery teams with mixed backgrounds (business &#38; sales, mathematics &#38; predictive analytics, database &#38; data management)\nSolve problems arising from dynamic data and changing customer requirements\nQualifications\nStrong knowledge of SQL (via SQL Server, MySQL, Oracle, etc.)\nBS degree in a technical discipline such as math, physics, computer science, operations research, engineering with relevant intern experience; advanced degree preferred\nExperience delivering business insights from data using pivot tables, advanced excel models, or business intelligence tools\nExperience with analytics tools such as SAS, SPSS, R, or MATLAB\nStrong project and time management, as well as written and communications skills\nAbout Lattice Engines<p>Lattice Engines is revolutionizing B2B sales and marketing by transforming Big Data into big sales for F5000 companies worldwide. Its predictive selling platform, salesPRISM, overcomes the limitations of CRM and arms front-line sales pros with real time, actionable insight to engage the most receptive customers in the most persuasive ways.  More than 100,000 sales pros at companies like ADP, Dell and VMware rely on Lattice Engines every day to achieve peak sales productivity.  Lattice Engines is privately held and backed by Sequoia Capital with headquarters in San Mateo, CA. Learn more at www.lattice-engines.com and follow @Lattice_Engines.<p>To apply, go to <a href=\"http://jobvite.com/m?3IArgfwJ\" rel=\"nofollow\">http://jobvite.com/m?3IArgfwJ</a> or send me an e-mail at sberi@lattice-engines.com with the subject line \"Hacker News\"","time":1330612745,"type":"comment"},{"by":"sciurus","id":3654235,"parent":3652041,"text":"Athens, Ga - EuPathDB\nEuPathDB is looking for junior and senior front-end web developers to help scientists perform dynamic computational experiments on genomic-scale datasets. You'll get to work on innovative interfaces like our strategies system (description: <a href=\"http://bit.ly/ko0Y4b\" rel=\"nofollow\">http://bit.ly/ko0Y4b</a> , source code: <a href=\"http://bit.ly/mUyL3D\" rel=\"nofollow\">http://bit.ly/mUyL3D</a>). You'll need detailed knowledge of Javascript, jQuery, CSS, HTML, Java, JSP, Struts and web services. Knowledge of SQL, Perl, Tomcat and Apache are also desirable. An interest in bioinfomatics and genomics applications is highly desirable and experience a strong plus.<p>Email jobs@apidb.org if you're interested.","time":1330638741,"type":"comment"},{"by":"abhishektwr","id":3654155,"parent":3652041,"text":"Cotton On is hiring Python/Django engineers in Geelong(Melbourne Area), Australia. We are looking for one mid-level and one junior developer. Local candidates are most welcome. For right candidates we are open for 457 sponsorship (which unlike US H1B takes max 3 weeks), but if you are eligible for working holiday visa you can start as quickly as this month.<p>Based in Geelong, a beautiful city which is 45 mins drive from Melbourne. Cotton On provides bus service for daily commuters based in Melbourne.<p>Freelance gigs are possible.<p>Send your cv with cover at: cottonon.django.error@gmail.com<p>Or apply to job portal,<p><a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=COTTON&#38;cws=1&#38;rid=7093\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=COT...</a>","time":1330637577,"type":"comment"},{"by":"robertsosinski","id":3653716,"parent":3652041,"text":"Jersey City, NJ - Full Time Engineers<p>Ticket Evolution (ticketevolution.com) is the engineering backbone of the open ticket market.  We build tools and an API that helps ticket brokers buy and sell event tickets from each other and to customers.  Chances are if you bought a ticket online, it was from a website that uses our system.<p>Our systems use Ruby on Rails, Postgres and Redis (with Resque) for queueing, JavaScript and BackBone.js.  We also have a lot of interesting challenges, such as scaling out an API that provides ticket inventory throughout the internet, guaranteeing orders are always processed correctly, and building responsive web-based applications.<p>If this sounds like fun, please send me an email at rsosinski@ticketevolution.com.","time":1330631642,"type":"comment"},{"by":"martian","id":3652935,"parent":3652041,"text":"San Francisco<p>Software Engineer, Front-end Developer<p>Thumbtack is hiring awesome software engineers to transform the way services are bought and sold online. We're Amazon for services. A quarter of a million small businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. We're well on our way to being profitable and growing quickly.<p>Our team is young and passionate and dedicated to good engineering. We have extensive benefits, including a in-house chef, a gorgeous office in SOMA, and money to spend on Thumbtack services every month.<p>Our delicious food culture is currently the top story on Inc.com.<p>Apply at <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Or email chris at thumbtack with any questions.","time":1330621603,"type":"comment"},{"by":"agtilden","id":3653583,"parent":3652041,"text":"Manhattan (Flatiron)/New York City<p>The Higher Gear Group writes the easiest to use CRM software in the automative space.<p>What We Believe<p>* What you know is not nearly as interesting as what you can know.<p>* Everybody fails before they succeed. Some people fail faster than others.<p>* Being clear is better than being clever.<p>What We Do<p>* We build easy to use CRM software.<p>* Your work will impact the daily life of 30,000+ current end users.<p>* We try to get a little better every day.<p>* We're building high quality systems using Python, AMQP,  and SqlAlchemy<p>Who We Are Hiring<p>We're looking for people with:<p>* Solid programming experience in a UNIX/Linux environment<p>* Language expertise with Python and to a lesser extent Java<p>* In-depth knowledge of RDBMS/SQL<p>* Experience with a DVCS like mercurial or git<p>* You really must be able to execute on ideas, take ownership \nand get things done<p>Medical Benefits, 401K, tools to do the job, and a casual work environment.<p>Apply by sending email to itjobs@highergear.com","time":1330629780,"type":"comment"},{"by":"jroll","id":3653780,"parent":3652041,"text":"Mountain View - drchrono.com (YC W11) [full time and interns]\nWe're looking for more engineers and salespeople to help us revolutionize healthcare through mobile and web interfaces. Our stack includes Python/Django, iOS, and Android, but you don't need to be an expert, just ready and willing to learn fast!\nOur product supports thousands of doctors who depend on our systems daily to provide quality care to their patients, iPad in hand.\nThe usual startup benefits included: competitive salary, healthcare, whatever hardware you need to be most productive.\nemail: jobs@[our-domain-name]<p>Take our hacker test at <a href=\"http://bit.ly/qbKAut\" rel=\"nofollow\">http://bit.ly/qbKAut</a>","time":1330632565,"type":"comment"},{"by":"kevinburke","id":3653338,"parent":3652041,"text":"San Francisco, CA<p>Twilio is hiring. Want to call/text message your users, or build a product around phones? Instead of writing horrible interface code to text message or call users, people use Twilio's REST API to take care of the messages and get back to doing what they do best - building great web apps.<p>We are growing like crazy and hiring for lots of positions - see a full list here: <a href=\"http://www.twilio.com/company/jobs\" rel=\"nofollow\">http://www.twilio.com/company/jobs</a>. Two good ways to get your resume to the top of the pile: build a Twilio app, and mention this HN post in your cover letter.<p>Remote considered for Developer Evangelist, Marketing and Support positions, but not for engineering.","time":1330626560,"type":"comment"},{"by":"balabanovic","id":3657459,"parent":3652041,"text":"London, UK - Lead Mobile Dev (permanent)<p>State (<a href=\"http://state.it\" rel=\"nofollow\">http://state.it</a>) is building a global opinion network - a massive-scale new social web startup.  We've got a great team coming together in London, we didn't launch yet so you get to be in at the beginning, and we've got some fantastic technical challenges up ahead.<p>We're looking for a strong lead developer to build our mobile apps and eventually our mobile team - starting with iOS and moving onto Android as well.  More info at <a href=\"http://jobs.state.it\" rel=\"nofollow\">http://jobs.state.it</a>.  Send us your published apps to demonstrate your experience.<p>Remote work not OK - we gain a lot from sitting together.","time":1330709819,"type":"comment"},{"by":"danielsju6","id":3653616,"parent":3652041,"text":"Paid interns (on-site) wanted for Boston start-up.<p>Come kick-ass in Coolidge corner with the Raizlabs Team (<a href=\"http://www.raizlabs.com/\" rel=\"nofollow\">http://www.raizlabs.com/</a>) to hack on AppBlade (<a href=\"https://appblade.com\" rel=\"nofollow\">https://appblade.com</a>) a start-up in the mobile application distribution space; built in Ruby on Rails. This is a paid position that has the real possibility of getting you onboard with salary/benefits.<p>Familiarity with programming and web-development would be appreciated. Ideal candidates are interested/experienced in Rails, can handcode HTML/CSS, Objective-C, and ready to kick some ass in the mobile space.<p>Hit me up at james.daniels@raizlabs.com.","time":1330630204,"type":"comment"},{"by":"kloncks","id":3653206,"parent":3652041,"text":"San Francisco<p>New York<p>Kout - http//www.kout.me<p>FULLTIME, INTERN<p>* Backend (PHP, Ruby/Rails)\n* Frontend (Javascript, jQuery)\n* Designers (Strongly prefer those that came turn their PSD designs into actual pages with HTML/CSS)<p>Young strong venture-backed startup seeking first \nemployee/s. Expect market salaries and equity.<p>Kout is an eCommerce version of Square that allows you to sell across multiple mediums (social networks, blogs, emails, mobile, offline, etc without any of the hassles. Comes complete with payments.<p>Creating the simplest way to sell online. Disrupting an industry (eCommerce and - in a way - payments) that hasn't been innovated in ten years.<p>Backed heavily by some of the best VCs in the valley. Email me directly (hany@kout.me); mention you're from HN.","time":1330624957,"type":"comment"},{"by":"spalladino","id":3656587,"parent":3652041,"text":"Buenos Aires, Argentina<p>Manas Technology Solutions <a href=\"http://www.manas.com.ar/\" rel=\"nofollow\">http://www.manas.com.ar/</a> is hiring experienced Web Apps Developers<p>At Manas we develop complex web applications, with a strong focus on technology applied to humanitarian work in collaboration with InSTEDD, but also with other clients from different domains.<p>Most of our work is focused on web apps, with interaction via SMS and voice, but we also work on mobile and desktop apps.<p>We enjoy using the appropriate tool for each project, working in Java, .NET or, most frequently, Ruby.<p>Learn more about the position (in Spanish) at <a href=\"http://man.as/workwithus\" rel=\"nofollow\">http://man.as/workwithus</a>","time":1330697111,"type":"comment"},{"by":"davidandgoliath","id":3653979,"parent":3652041,"text":"Telecommute/remote. 1-3 month contracts initially, long-term with equity available for the right individuals afterwards.<p>Seeking linux sysadmins for a web hosting operation. We've been in operation just short of a decade, have 2,000 odd clients including many fortune 500 operations: <a href=\"http://fused.com/careers.php\" rel=\"nofollow\">http://fused.com/careers.php</a><p>Reasonable salaries, equity available (we're bootstrapped, 100% self-funded) and profitable.<p>In pursuit of those whom like automation, performance and optimization. LAMP stack with hints of puppet, nginx, varnish. Ability to code is also a must, though language of choice is almost entirely irrelevant.","time":1330635234,"type":"comment"},{"by":"flippyhead","id":3653382,"parent":3652041,"text":"JavaScript / Ruby Developers\nREMOTE WORKING ENCOURAGED<p>We're hiring JavaScript and Ruby developers to help us build social software for conferences and events. We're based in Seattle but YOU can work from anywhere. Full benefits, great salary and equity. Our team includes core backbone.js committers and we're working on some fantastic open source projects in support of the same (come meet us at JsConf this year). We've been profitable for over a year and are growing quickly.<p><a href=\"http://www.pathable.com/careers-at-pathable/\" rel=\"nofollow\">http://www.pathable.com/careers-at-pathable/</a><p>Apply here:<p><a href=\"http://jobsco.re/ADjuWq\" rel=\"nofollow\">http://jobsco.re/ADjuWq</a>","time":1330627149,"type":"comment"},{"by":"emilepetrone","id":3652113,"parent":3652041,"text":"Urban Airship!    SF &#38; Portland - Funded by Intel, Salesforce, Verizon<p>Do you want to work on a product that reaches hundreds of millions of users a year?<p><a href=\"http://urbanairship.com/company/jobs/\" rel=\"nofollow\">http://urbanairship.com/company/jobs/</a>","time":1330611292,"type":"comment"},{"by":"ritchiea","id":3652265,"parent":3652041,"text":"New York, Manhattan, NYC. CharityBuzz is seeking developers of various skill levels and a project manager. CharityBuzz is a luxury auction platform where the majority of revenue from our transactions go to our charitable partners. Right now we're making a major move from contracting development to building a top notch engineering team so this is a great opportunity have an impact on a growing organization that is excited about its developers. Email me personally via aritchie at charitybuzz . More info here: <a href=\"http://www.charitybuzz.com/jobs\" rel=\"nofollow\">http://www.charitybuzz.com/jobs</a>","time":1330613609,"type":"comment"},{"by":"lamplighter","id":3655152,"parent":3652041,"text":"Uken Games in downtown Toronto<p>We are a profitable startup (~30 employees) experiencing massive growth, with hundreds of thousands of players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>Uken is looking for talented developers to help us build mobile games in HTML5 and push what is possible in a browser.  In addition to web developers and Javascript gurus, we are looking for backend engineers to help us with building out our infrastructure, scaling, and crunching big data.  Technologies we use include Rails, Nginx, Chef, MySQL, Redis, and backbone.js.<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1330657395,"type":"comment"},{"by":"blo","id":3654287,"parent":3652041,"text":"San Francisco, CA (SOMA) - Full Time\nMobile / Front-end engineers, Full-stack (node.js) engineers<p>Stealth - consumer web and mobile<p>--<p>Do you find yourself using Google to navigate websites that you commonly use, or end up with many browser tabs trying to accomplish some task? We're innovating along how people interact with online services and designing a new web-based experience that allows users to accomplish tasks in a more usable, efficient, and social manner.<p>We work mainly with Javascript (jquery and node.js) and HTML5. We also need mobile developers familiar with iOS/Android.  Our office in San Francisco overlooks the Embarcadero.<p>Curious? Contact [my username] at alum.mit.edu.","time":1330639586,"type":"comment"},{"by":"junkafarian","id":3652548,"parent":3652041,"text":"Large Blue (<a href=\"http://largeblue.com\" rel=\"nofollow\">http://largeblue.com</a>) - London, UK<p>We're looking for:<p>- a Mid-Senior Software Engineer (Python) with 3+ years professional experience in delivering high quality web applications<p>- a Producer / Project Manager with experience in delivering technical / web based projects<p>About Large Blue:<p>- We're a creative digital agency based in London<p>- Delivering projects like <a href=\"http://openideo.com\" rel=\"nofollow\">http://openideo.com</a> and <a href=\"http://designmuseum.org\" rel=\"nofollow\">http://designmuseum.org</a><p>- Working on a variety of projects with a wide range of clients<p>- Utilising modern web technologies in a progressive development team<p>Drop us a line on careers@largeblue.com with your CV","time":1330616990,"type":"comment"},{"by":"talonx","id":3656074,"parent":3652041,"text":"Hyderabad/India/Full time/No REMOTE<p>SocialTwist is looking for a Developer-Operations engineer who will work with our cloud-based systems to make it scale to ever growing demands, solve problems on processing huge amounts of data, contribute to designing distributed systems and work on monitoring, measuring and scaling our infrastructure. This could just be the place for you if you love a fast-paced challenging work environment which keeps you perpetually pushed out of your comfort zone.<p>More details here - <a href=\"http://jobs.hasgeek.com/view/dkjwm\" rel=\"nofollow\">http://jobs.hasgeek.com/view/dkjwm</a><p>Email careers (at) socialtwist (dot) com","time":1330683159,"type":"comment"},{"by":"BrandonMTurner","id":3652667,"parent":3652041,"text":"Boston, MA (No remote) - Full Time - <a href=\"http://www.loseit.com\" rel=\"nofollow\">http://www.loseit.com</a><p>= About Lose It! =<p>Lose It! is a popular iPhone / Android / Website application that changes people's lives by helping them manage their weight.<p>8M+ iPhone Downloads (currently top 10 in Health category)<p>500k+ Android Downloads (very new, currently top 15 in Health category)<p>2M Website enabled users (connecting to our website is optional)<p>2M Uniques per month across all platforms<p>8.5M+ pounds of weight have been lost by website enabled users (Estimated ~20M pounds lost across all users)<p>8k messages betweens users that opted into social features per day<p>450M+ foods logged by website enabled users<p>Current Team - 1 CEO (technical), 1 Developer (me), 1 Business Dev, 1 Community Manager<p>Current Stack - GWT, MySQL, Java (server side and Android), AWS, Objective C (iPhone), Membase<p>Current Tools - Intellij, Git, Navicat, New Relic, CloudBees, Asana<p>= Who we are looking for =<p>Lose It! is looking for new members (we have more then one spot open) for our product team to help us build our next generation of products. We believe that small teams of well rounded people can do great things, so we're looking for someone that can contribute to all phases of building a great product. We believe that iterating on our products with customers is the best way to build something great, so we'd like someone who enjoys talking to customers and making them happy (and maybe even helping to change their lives).<p>As a software engineer at Lose It!, you'll be an early member of the team that is building the core product, the most complete and effective weight loss software spanning mobile devices and the web. You should have a passion for and a proven track record of building products that delight users.<p>= Who to contact =<p>{first name} at loseit.com - If you think you would be a good fit send me an email with anything (resume, cover letter, github account, maybe just a simple 'hello'. I'll read anything and everything you send).","time":1330618382,"type":"comment"},{"by":"kstenerud","id":3652364,"parent":3652041,"text":"San Francisco. <a href=\"http://www.mindsnacks.com/careers/\" rel=\"nofollow\">http://www.mindsnacks.com/careers/</a><p>Looking for: QA Lead, UI Designer, Android Engineer, Backend Engineer, Mobile/Web Generalist Engineer, Intern (Engineer, Content, Marketing). H1B OK.<p>We build fun games for brains in San Francisco. We're a small &#38; talented team. We hate boring. Our investors are awesome. If you are nice and want to help us make splendid products, we'd love to hear from you!<p>We want to change the way people learn. We think education is unnecessarily associated with blandness, and want to shake things up with fun at MindSnacks.","time":1330614786,"type":"comment"},{"by":"sgrock","id":3652563,"parent":3652041,"text":"New Relic - Portland OR/San Francisco (<a href=\"http://newrelic.com/jobs\" rel=\"nofollow\">http://newrelic.com/jobs</a>)<p>We make the best application performance monitoring solution out there.  It gives you deep visibility in production apps running on Ruby, PHP, Python, Java, and .NET (with more platforms coming soon.)  We take our company culture seriously, hiring top notch people, stressing work life balance, and solving tough problems.<p>We're looking for several technical positions (check out the jobs page) and are looking for engineers with skills in Ruby, Node, Python, C, PHP, .NET (to name a few). H1B welcome.<p>Thanks","time":1330617203,"type":"comment"},{"by":"Qworg","id":3653846,"parent":3652041,"text":"Pittsburgh, PA/No Remote/Fulltime<p>Do you have a passion for building things?  Do you love making your work \"go\" in the real world?  Do you want to build big robots?  The National Robotics Engineering Center is hiring computer scientists, electrical engineers and mechanical engineers of all types.<p>I'm more than happy to talk about my experience here, you can email jobs@rec.ri.cmu.edu, or you can check out this job posting (one of many): <a href=\"https://cmu.taleo.net/careersection/2/jobdetail.ftl?lang=en&#38;job=8462\" rel=\"nofollow\">https://cmu.taleo.net/careersection/2/jobdetail.ftl?lang=en&...</a>","time":1330633380,"type":"comment"},{"by":"Boldewyn","id":3652623,"parent":3652041,"text":"Germany, Regensburg - part-time or intern<p>Kinetiqa is a small but well-established web development company in southern Germany.<p>We're looking for an intern or part-time web developer to aid our team in several projects, e.g. HTML wireframing for large websites, development on our PHP-based CMS or extending several Django applications. Unfortunately, German language is a must. Apart from that we're very flexible and open.<p><a href=\"http://www.kinetiqa.de/Werkstudentin-Softwareentwicklung-gesucht.o331.html\" rel=\"nofollow\">http://www.kinetiqa.de/Werkstudentin-Softwareentwicklung-ges...</a><p>or contact me directly, m.strehl @ kinetiqa.de","time":1330617894,"type":"comment"},{"by":"isuttle","id":3652467,"parent":3652041,"text":"Orange County, Southern California<p>a2z Research and Development, an Amazon.com company, is seeking a Software Development Engineer in Test to lead our test automation efforts for SDKs and services being built to help game developers better monetize their games.  Great company, fun culture, challenging work, and fantastic people.  For more info see <a href=\"http://www.amazon.com/gp/jobs/128556/ref=j_sr_2_t?ie=UTF8&#38;category=%2A&#38;location=US%2C%20CA%2C%20Lake%20Forest&#38;keywords=&#38;page=1\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/128556/ref=j_sr_2_t?ie=UTF8&#3...</a>","time":1330616086,"type":"comment"},{"by":"hello-yoshi","id":3654853,"parent":3652041,"text":"Toronto, ON (Remote Workers welcome) - Slightly Crazy Web/Mobile Developer (<a href=\"http://www.myplanetdigital.com/careers\" rel=\"nofollow\">http://www.myplanetdigital.com/careers</a>)<p>We are change agents. With offices in Toronto and Chicago, Myplanet is a rapidly growing provider of technical and creative services for web and mobile platforms. Along with a top-notch user experience/interactive team, some of our main specialties include the Drupal Social Publishing Platform, the Magento E-Commerce platform, mobile development for Android and iPhone devices, PHP and Python-based web applications and integrating weird legacy systems (hello RPG code, how did you get in there?).\nOur clients range from large public companies to startups, non-profits and government agencies. On any given day, we work on projects ranging from building creative new web and mobile experiences, to launching startups for clients, to helping clients understand and plan for adoption of new interactive technologies. We are, in essence, one part technology specialist, one part interactive agency, and one part business model incubator.<p>We like to work on things that matter with people who care.<p>About the position<p>You'll be tasked with building important systems for interesting clients, with plenty of technical challenges and opportunities to learn as you go. You'll work in a Scrum team, primarily in PHP to start - you'll also likely learn how to build complex systems in Drupal through our 2 month intensive training program with world re-known Drupal experts.<p>About you<p>A background in Computer/Software Engineering or Computer Science is strongly preferred, but we're open if you can demonstrate you know your stuff and have a nonconventional degree. We're looking for 1-2yrs experience (if you're fresh out of school get in touch anyway). Double points if you have startup experience.\nWe mostly work in PHP, but diverse language experience is a plus. It's more important that you're smart and driven than that you're a PHP expert. If you've played around with iOS development, HTML5, Python, Ruby/Rails 3, Android dev, Facebook app dev, etc., those are all positives.<p>Learn more - <a href=\"http://www.myplanetdigital.com/careers\" rel=\"nofollow\">http://www.myplanetdigital.com/careers</a>","time":1330648872,"type":"comment"},{"by":"rjsjr","id":3653070,"parent":3652041,"text":"San Francisco, CA.  Full time.<p>Social Finance <a href=\"http://sofi.org/\" rel=\"nofollow\">http://sofi.org/</a> is fixing Student Loans with better rates, alumni investment, and great social integration.  We're looking for a range of Software Developers and Product Managers to come work with an experienced startup engineering team and build great products.  Backed by Eric Schmidt and Steve Anderson, we're located in the beautiful Presidio and have a free shuttle from downtown.<p>Apply online at <a href=\"https://sofi.resumetracker.com/public\" rel=\"nofollow\">https://sofi.resumetracker.com/public</a>","time":1330623295,"type":"comment"},{"by":"mikeinterviewst","id":3652878,"parent":3652041,"text":"Mountain View (Remote OK for first couple of months)<p>InterviewStreet (YC '11) is solving technical hiring through interesting, practical problems (like Stripe's recent CTF). You'd be employee #7.<p>We're looking for:<p>* Campus Coordinator (non-technical): <a href=\"http://blog.interviewstreet.com/2012/02/help-interviewstreet-connect-with-student-programmers/\" rel=\"nofollow\">http://blog.interviewstreet.com/2012/02/help-interviewstreet...</a><p>* UX / UI designer: <a href=\"https://news.ycombinator.com/item?id=3553649\" rel=\"nofollow\">https://news.ycombinator.com/item?id=3553649</a><p>For both, send an email to mike+recruiting@interviewstreet.com","time":1330620960,"type":"comment"},{"by":"mcdowall","id":3703325,"parent":3652041,"text":"Kensington, London<p>Large publishing title in the UK.  We're expanding our development teams across our two titles following relaunching both sites, we'd like individuals with a passion to work on a high traffic site and be able to think on their feet in a high paced environment.<p>Seeking - Web Developer x2<p>* Advanced JS - Developing products/widgets/microsites within the escenic content management system<p>* HTML 4/5 - Working on commercial solutions with premium brands across both titles<p>* XML - We consume and send out a number of feeds, an excellent understanding of XML is needed<p>Others - CSS / XHTML / Ajax / RSS<p>Feel free to email me - jameskmcdowall@gmail.com","time":1331735667,"type":"comment"},{"by":"kabir_h","id":3654090,"kids":[3666781],"parent":3652041,"text":"Cambridge, MA - Shareaholic makes tools for publishers and users to help them find and share the best content on the web. We're a small, funded startup (Dharmesh Shah and Dave McClure) that reaches 270 million unique users via 200K publishers. We've got an awesome culture that avoids bureaucracy and gives everyone a meaningful chance to contribute. Even our Marketing folks code.<p>We're hiring Web Developers with Javascript and MVC chops. We'd love it if you knew Python, Ruby or even C though. We're all generalists that typically attack full stack products.","time":1330636612,"type":"comment"},{"by":"jack7890","id":3652372,"parent":3652041,"text":"New York, NY -- Web Engineer -- Fulltime -- SeatGeek<p>SeatGeek is the web's largest search engine for live event tickets.  Think \"Kayak for sports/music/theater tickets.\"<p>Our dev team currently has seven people.  We're looking to add one or two more.  We're specialization-agnostic.  Most of our current guys are pretty full stack, so wherever in the web stack you like to spend your time, we can find a place for you.<p>We're using lots of Python these days.  A bit of Ruby and PHP too.<p>More details here: <a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1330614863,"type":"comment"},{"by":"mistertim","id":3655947,"parent":3652041,"text":"London, UK (or Remote for the right candidate, with a UK work visa)\nLikely Ltd are looking for developers to work on some interesting social media analytics problems. I'm leaving at the end of the month, but it's a great place to work - at the moment we need people with experience in any or all of: Ruby, Erlang, Java, Hadoop (Mapreduce and Hbase). If you have any machine learning or statistical computing skills that'd be a definite bonus. If you're iterested, please send your details to Henry, our CTO, at henry@likely.co Thanks!","time":1330679250,"type":"comment"},{"by":"thomd","id":3653197,"parent":3652041,"text":"Cambridge and Brighton (UK) - Aptivate<p>Come and do Good Work with us!<p>We are a not-for-profit organisation focusing on IT in international development. We care about having a positive social impact, and we believe that IT can do a lot to empower, inform and connect people all over the world.<p>We're looking for web development, devops and project management skills. If you fit any or more of these roles and are interested in the international development sector we might be a good match.<p><a href=\"http://www.aptivate.org/vacancies\" rel=\"nofollow\">http://www.aptivate.org/vacancies</a>","time":1330624846,"type":"comment"},{"by":"gdb","id":3653793,"parent":3652041,"text":"Stripe, San Francisco<p>We make it easy to accept payments online. Now you can too--we're looking for designers and engineers to help us fix payments on the web. Ping me at gdb@stripe.com if you're interested.","time":1330632734,"type":"comment"},{"by":"buholzer","id":3652827,"parent":3652041,"text":"Mountain View CA / H1B\nComplete Genomics, Human Genome Sequencing &#38; Analysis Service<p>We are a small team working on next generation applications in the field of Genomics. \nIf you want to help make an app that could have a measurable, positive impact on the lives of people, then join our team.<p>Front-end Engineer\n<a href=\"http://bit.ly/z6mgP7\" rel=\"nofollow\">http://bit.ly/z6mgP7</a><p>Data Visualization Engineer\n<a href=\"http://bit.ly/y5RDQs\" rel=\"nofollow\">http://bit.ly/y5RDQs</a><p>Backend Engineer\n<a href=\"http://bit.ly/AffSlB\" rel=\"nofollow\">http://bit.ly/AffSlB</a>","time":1330620209,"type":"comment"},{"by":"sshingler","id":3652157,"parent":3652041,"text":"London, UK.<p>Wildfire App.<p>Ruby Developers. Mid to Senior.<p>More details here: <a href=\"http://lists.lrug.org/pipermail/chat-lrug.org/2012-January/006846.html\" rel=\"nofollow\">http://lists.lrug.org/pipermail/chat-lrug.org/2012-January/0...</a>","time":1330612140,"type":"comment"},{"by":"plnewman","id":3653149,"parent":3652041,"text":"Foster City, CA\nRearden Commerce perfects commerce by connecting buyers and sellers in the most meaningful and relevant manner possible.<p>We have several positions open, but I personally am hiring a developer for internal applications. We work mostly in Python on a wide variety of projects, and have a great team. More here: <a href=\"https://careers-reardencommerce.icims.com/jobs/2053/job\" rel=\"nofollow\">https://careers-reardencommerce.icims.com/jobs/2053/job</a><p>Feel free to contact me at ptrk@reardencommerce.com","time":1330624425,"type":"comment"},{"by":"simonw","id":3653233,"parent":3652041,"text":"UX and Graphic Designer, Old Street, London, Full Time or Contract (no remote)<p>Lanyrd helps people get more out of conferences and professional event. We provide tools that help people discover the most appropriate conferences for them and navigate the event while they are there.<p>We're YC Winter 2011, we've raised our seed round and we're looking for a design person to round out our product team.<p>Full job description here: <a href=\"http://lanyrd.com/about/jobs/designer/\" rel=\"nofollow\">http://lanyrd.com/about/jobs/designer/</a>","time":1330625291,"type":"comment"},{"by":"andrewparker","id":3653181,"parent":3652041,"text":"Companies that have been funded by Spark Capital (and thus are venture-backed and can afford market salaries) have all their aggregated open jobs listed in one place: <a href=\"http://sparkcapital.com/jobs/\" rel=\"nofollow\">http://sparkcapital.com/jobs/</a><p>Includes job openings from Twitter, Tumblr, OMGPOP and other popular web services.  Please feel free to ping me directly with questions: andrew@sparkcapital.com, but know that Im not the hiring manager for any of these positions.","time":1330624657,"type":"comment"},{"by":"mehuln","id":3654958,"parent":3652041,"text":"Flutter.io - Palo Alto - Full-time, Interns, &#38; Contractors (JavaScript Only)<p>We are gesture based start-up using only buil-in webcam to bring Kinect like experience on your computer.  See our demo video at <a href=\"http://flutter.io\" rel=\"nofollow\">http://flutter.io</a>.<p>Looking for:<p><i></i>*JavaScript - Full-Time and/or Contract\nC++ Eng\nPython/Django\nHCI Designers\nComputer Vision and Machine Learning<p>We're small team with big dreams! Get in touch with us if you would like to work on challenging tech problems.<p>Email at jobs[at]Flutter[dot]io","time":1330651641,"type":"comment"},{"by":"etrgreg","id":3653771,"parent":3652041,"text":"New York, NY<p>ExpandTheRoom, a boutique creative agency, is looking for full-time Mobile Developers (Windows Phone 7, iOS) as well as PHP Developers and UX Designers. We have a truly excellent team of developers and designers, and a fun work environment and culture. We'd also consider internships.\nIf you're interested, check the site - <a href=\"http://www.expandtheroom.com/jobs\" rel=\"nofollow\">http://www.expandtheroom.com/jobs</a> or contact us at iwannawork@expandtheroom.com","time":1330632376,"type":"comment"},{"by":"wangthony","id":3653604,"parent":3652041,"text":"Brisbane, CA (just south of SF) - Web / Software Engineers (FT, local preferred)<p>Tobi [<a href=\"http://www.tobi.com\" rel=\"nofollow\">http://www.tobi.com</a>] is building the next generation online fashion shopping experience.<p>4 reasons why you should talk to us:<p>1. Technology: Ruby on Rails, Postgres, other goodies<p>2. Business: huge market and a fun domain<p>3. Team: small, tight-knit, experienced, highly effective<p>4. Career Growth: own large sections of the codebase and work on interesting projects<p>Learn more at <a href=\"http://eng.tobi.com/\" rel=\"nofollow\">http://eng.tobi.com/</a>","time":1330630067,"type":"comment"},{"by":"cbreish","id":3652159,"parent":3652041,"text":"Greater Philadelphia (Conshohocken) Full Time<p>Senior Microsoft and Infrastructure Systems Administrator at Cognis<p>Cognis is a Managed Information Technology Service Provider, helping to improve the return on investment in technology procurement and implementation, and increasing the value delivery of IT to the organizations that it serves. Cognis proactively works with clients to align its’ services with our client’s technology goals, thus providing all the resources of an in-house IT department at a fraction of the cost. Targeted clients include small and medium sized businesses looking to augment their existing IT support or outsource all of their IT needs.<p>This position requires a blend of skills.​  We are looking for a senior level Microsoft Systems Administrator with demonstrated experience supporting the infrastructure and systems within a 100 server Microsoft Environment.​  Core responsibilities include supporting VMware 3.​5/​4.​1, and Dell SANS, Windows Server 2003 /​ 2008 R2 64-bit, Active Directory, Data Backup, Disaster Recovery, UPS Power Management.​<p>You will be the key person responsible for supporting a full range of customers, including 20 user professional service firms upwards of 350 user medical practice networks.​  Additionally, you will handle all Tier 2 and above Help Calls dealing with your areas of responsibility and be part of a three-person team backing up the Help Desk when needed for Tier 1 calls.​<p>All of our IT positions are highly visible; therefore, you must have excellent customer service and communication skills.​  From time to time you will be required to make presentations at various company meetings.​<p>This is a great opportunity to be involved in all aspects of supporting small to medium sized companies with opportunities for growth and advancement.​  You will be part of a five person IT Team and must be able to work well independently as well as part of a team.​  You must be creative and willing to constantly look for ways to improve our workflow and processes.​  From time to time you will be assigned projects and work with other members of IT to accomplish common goals and initiatives.​<p>Please apply at Monster.com: <a href=\"http://jobview.monster.com/Sr-Microsoft-Infrastructure-Systems-Administrator-Job-Conshohocken-PA-US-106808248.aspx\" rel=\"nofollow\">http://jobview.monster.com/Sr-Microsoft-Infrastructure-Syste...</a>","time":1330612150,"type":"comment"},{"deleted":true,"id":3666876,"parent":3652041,"time":1330962447,"type":"comment"},{"by":"tudorg","id":3654455,"parent":3652041,"text":"Berlin, Germany. IPTEGO is building a VoIP (and not only) monitoring and troubleshooting product that is changing the way operators are running their networks. We're currently looking for Frontend/Javascript developers, C developers and Python developers. No remote work, but we can help you relocate, and Berlin is an awesome city! <a href=\"http://www.iptego.com/company/jobs\" rel=\"nofollow\">http://www.iptego.com/company/jobs</a>","time":1330641671,"type":"comment"},{"by":"matoe","id":3652718,"parent":3652041,"text":"Mountain View, California<p>SOFTWARE ENGINEER / WEB DEVELOPER / FRONT-END DEVELOPER<p>Kiwi Crate is a subscription service that delivers curated hands-on projects to kids. The company was founded in 2011 by executives from eBay, PayPal, YouTube &#38; Baby Center and is backed by leading investors.<p>JOBS: <a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>\nTEAM: <a href=\"http://www.kiwicrate.com/team\" rel=\"nofollow\">http://www.kiwicrate.com/team</a>","time":1330618964,"type":"comment"},{"by":"roobeast","id":3652211,"parent":3652041,"text":"San Francisco, CA - Trulia<p>Trulia is still growing at a rapid clip.  Lots of interesting scaling and fun data challenges.<p>We are looking for a data scientist type with very hands on coding skills not just analysis.<p>Search engineer well versed in search internals or heavy use of solr/lucene<p>Core data pipeline engineer to work with complex data workflows in hadoop<p>Other eng positions on the front-end and mobile apps too.<p>Great company culture, apply at <a href=\"http://www.trulia.com/jobs\" rel=\"nofollow\">http://www.trulia.com/jobs</a>","time":1330612882,"type":"comment"},{"by":"kunalmodi","id":3653412,"parent":3652041,"text":"Thirst Labs - San Francisco - Full Time &#38; Intern\nWe are applying NLP &#38; Machine Learning techniques to augment how you consume and read Twitter.<p>We are looking for Rails developers (familiarity with AWS is a plus), Mobile Developers (ideally iOS at the moment) and NLP Engineers/Researchers.<p>We are backed by influential VC's and Angels, and we are located on Market St., right off Montgomery Bart. If you are interested, email us at jobs at thirstlabs.com","time":1330627491,"type":"comment"},{"by":"ianl","id":3652146,"parent":3652041,"text":"Halifax, Nova Scotia, Canada<p>GoInstant (<a href=\"http://www.goinstant.com\" rel=\"nofollow\">http://www.goinstant.com</a>)<p>GoInstant is a venture-backed startup building a unique co-browsing tool that allows two or more people to surf the web at the same time. It requires no downloads, plugins or installs. People connect in 3 seconds or less and share a web experience in real-time.<p>Hiring:<p>* Senior QA Engineer<p>* Senior Web Developer<p>* Web Developer<p>Apply at <a href=\"http://www.goinstant.com/jobs\" rel=\"nofollow\">http://www.goinstant.com/jobs</a>","time":1330611923,"type":"comment"},{"by":"Hovertruck","id":3652529,"parent":3652041,"text":"Chartbeat is hiring in NYC (Meatpacking District).<p>We're a realtime analytics platform focused on providing data to the people on the front line (people who can take immediate action), rather than the analysts in the back office. Our stack is Python (django/tornado), C, MongoDB, and Google Closure for our JavaScript needs. Hiring engineers and designers of all sorts. :)<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1330616758,"type":"comment"},{"by":"tialys","id":3652140,"parent":3652041,"text":"Chicago, IL<p>Hashrocket is looking to grow our Chicago office. We're specifically looking for experienced Ruby/Rails developers.<p>Want to get paid open source time and work with a small, dedicated group of developers? Email jobs+chicago at hashrocket.com. See our Github post for more detail: <a href=\"https://jobs.github.com/positions/2adac242-5cca-11e1-9778-925464e6a060\" rel=\"nofollow\">https://jobs.github.com/positions/2adac242-5cca-11e1-9778-92...</a>","time":1330611812,"type":"comment"},{"by":"jashmenn","id":3653767,"kids":[3653839],"parent":3652041,"text":"San Francisco - Full Time - Engineers - ifttt<p>We're hiring! <a href=\"http://ifttt.com/jobs\" rel=\"nofollow\">http://ifttt.com/jobs</a> or email me: nate@ifttt.com<p>Ruby / iOS / Evented Systems","time":1330632354,"type":"comment"},{"by":"steilpass","id":3652984,"parent":3652041,"text":"Agile Software Developers in Cologne, Germany.<p>Although we have been bought we still feel and work like a startup. We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://adkla.us\" rel=\"nofollow\">http://adkla.us</a>","time":1330622133,"type":"comment"},{"by":"Matt_Mickiewicz","id":3652704,"parent":3652041,"text":"99designs is disrupting the graphic design industry through its groundbreaking crowdsourcing model.<p>We've paid out over $30 million to designers around the world, and hosted over 100,000 design contests. We're hiring for a DevOps engineer and Product Manager in San Francisco, with several additional job openings in beautiful Melbourne Australia:<p><a href=\"http://99designs.com/about/jobs\" rel=\"nofollow\">http://99designs.com/about/jobs</a>","time":1330618836,"type":"comment"},{"by":"dksaarth","id":3652164,"parent":3652041,"text":"Cape Town, South Africa<p>Senior System Administrator<p>We are a small but rapidly growing SaaS company providing semantic based enterprise management software, and we are looking for smart developers as well as a senior sysadmin. We are a fun company doing disruptive / interesting things in a boring market. Looking for permanent people but are flexible with our arrangements. Give us a shout if you are interested at jobs@thoughtexpress.com","time":1330612174,"type":"comment"},{"by":"jasonshen","id":3652867,"parent":3652041,"text":"Ridejoy (YC S11). San Francisco, CA. Full time.<p>Lead designer and engineer number one.<p>Interested in fundamentally changing the way people travel or, as one of our users said, \"restoring people's faith in humanity\"? We're doing just that - by building a friendly community marketplace for sharing rides.<p>We deeply care about building a great company and developing the people on our team.<p><a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a>","time":1330620809,"type":"comment"},{"by":"mikebo","id":3653308,"parent":3652041,"text":"Seattle, WA<p>Familiar turns your many devices into social picture frames. More at <a href=\"http://familiar.com/\" rel=\"nofollow\">http://familiar.com/</a><p>We're hiring software engineers who like building user facing products. We use a wide variety of technologies from CoffeeScript to Objective-C, so lots of opportunity to learn something new.<p>If you're interested in hearing more about what we're up to, my e-mail is mike [at] familiar-inc.com","time":1330626323,"type":"comment"},{"by":"zsombor","id":3652961,"parent":3652041,"text":"New York City or Remote - seeking developers and application designers.<p>About us:  Harvest is a time tracking and invoicing application. We’re independent and profitable, with our customers as our only investors. Each day we come together to listen to our users, solve problems and continue to improve our service.<p>Read more at: <a href=\"http://www.getharvest.com/careers\" rel=\"nofollow\">http://www.getharvest.com/careers</a>","time":1330621919,"type":"comment"},{"by":"apliiq","id":3653175,"parent":3652041,"text":"Apliig.com is a custom clothing company that is disrupting the way people experience shopping and product customization online.  We're looking for a lead developer to join our team and position our platform for scale. Great chance to join a start up at the early stage with a proven product and doubling rev year over year. Could lead to a CTO role. Check us out - www.apliiq.com/jobs","time":1330624622,"type":"comment"},{"by":"merrillmartin","id":3654931,"parent":3652041,"text":"San Francisco, CA \nQA Engineer II - Fulltime<p>Seeking person with Ruby on Rails, open source automation software, web service or SaaS applications.  Strong manual testing and interest in developing automation skills.<p><a href=\"https://careers-reardencommerce.icims.com/jobs/2009/job\" rel=\"nofollow\">https://careers-reardencommerce.icims.com/jobs/2009/job</a> \nIf you have questions or interest, please contact me.<p>Merrill.Martin@deem.com","time":1330650923,"type":"comment"},{"by":"jamesjyu","id":3653046,"parent":3652041,"text":"San Francisco, CA<p>(H1B welcome!)<p>Come join the Parse team in making the most powerful mobile platform in the world. We've raised a Series A and have one of the best teams in the valley solving challenging platform and infrastructure problems.<p>We use MongoDB, Ruby, Objective-C, Java, Javascript, and much more.<p>Positions:\n* Software Engineer\n* Designer\n* Evangelist\n* SRE<p>More details: <a href=\"https://www.parse.com/jobs\" rel=\"nofollow\">https://www.parse.com/jobs</a><p>jobs@parse.com","time":1330622969,"type":"comment"},{"by":"sshconnection","id":3654917,"parent":3652041,"text":"We are looking for an awesome Rails developer to help us take the online auto industry by storm. You'll join a great engineering and design team that's working hard to bring car-buying into the 21st century. The features you create will help turn the mostly terrible experience of buying a new car into a wonderful experience for our customers. Responsibilities\nWork with Michael, Erik, Scott, Rimas, Tim, Andrew, and Patrick to create a world class set of products. We're a small team (just 5 engineers and 2 designers), but we work smart and get a lot done. Here's some of the cool stuff we're working on right now: a queuing system to optimize our operations across the country, an iOS app, and a stealth web crawler.<p>We do story-driven development, so you'll get the chance to work on any or all of this stuff if you so choose.<p>Qualifications<p>- Deep knowledge of Rails and everything that goes along with it (MVC, REST, relational database design/SQL)<p>- Solid grasp on modern web application design using Javascript, HTML, CSS<p>- Experience with version control systems (we use Git/Github)<p>- Solid testing methodologies and willingness to write comprehensive tests before release<p>You get extra bonus points for:<p>- Extensive Javascript experience outside of JQuery (e.g. Backbone)<p>- Ability to write complex SQL<p>- Understanding of good RDBMS design. Experience optimizing queries.<p>- Experience with memcached, sphinx, and nginx<p>- Story-driven development<p>- Web service/API development (REST)<p>- Experience with iOS development (Objective-C)<p>- Ability to play ping-pong skillfully and/or drive a go-kart furiously<p>Perks<p>- Full Benefits (medical, dental, vision, 401k)<p>- 17 days of PTO (vacation)<p>- $5,000 to buy anything you want to get your work done (must include an Apple computer of some sort)<p>- A substantial amount of equity in the company<p>If you're interested, send an email with your résume and something interesting about yourself to scott@carwoo.com.<p>We're based in Silicon Valley, but if you live outside the Valley, we still really want to talk to you (we'll pay for your flight, hotel, and meals when you come interview with us).","time":1330650495,"type":"comment"},{"by":"LStechrec","id":3652788,"parent":3652041,"text":"Washington, DC - LivingSocial is looking for Web App QA with Automation skills!<p>We’re looking for a Software Quality Assurance Engineer to take a lead role in software testing for LivingSocial’s large scale ecommerce applications.  In this role, you’ll apply expertise in evolving test frameworks and methodologies to ensure the quality and reliability of our rapidly expanding systems.","time":1330619720,"type":"comment"},{"by":"lxfontes","id":3652327,"parent":3652041,"text":"Sandvine<p>Lots of positions all over the world. awarded 'best workplaces in Canada' 4 times :)<p>* Waterloo, ON, Canada (headquarter)<p>Director of Software - Engineering Team<p>Embedded engineers (FreeBSD,C,C++)<p>Network Support<p>Quality Assurance engineer (TCL)<p>* Bangalore, India<p>Embedded engineers (FreeBSD,C,C++)<p>Performance engineers (get what those embedded engineers \ndid, and make it fly!)<p>EzChip engineers (Ezdesign, Ezdriver, EzSim, NPsl)<p>Java engineers (jboss, soap)<p>Technical writer<p>* UK (office location: London)<p>Sales engineer<p>* Latin America<p>Sales engineer<p>more at <a href=\"http://www.sandvine.com/careers/\" rel=\"nofollow\">http://www.sandvine.com/careers/</a>","time":1330614343,"type":"comment"},{"by":"mikek","id":3653153,"parent":3652041,"text":"Mountain View, CA.<p>Kiwi Crate is an innovative eCommerce company that sparks kids’ creativity and curiosity through offline and online materials and inspiration.<p>We are starting to build our technology team and are looking for a talented Software Engineer interested in contributing to the very early stages of a startup.<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1330624473,"type":"comment"},{"by":"bluejq","id":3652383,"parent":3652041,"text":"Oklahoma City, OK<p>Programmer Analyst - University of Oklahoma<p>We manage pharmacy benefits for Medicaid members in OK. Looking for .NET / SQL Server experience. Using the latest ASP.NET MVC, C#, jQuery, and some non-web as well.<p><a href=\"https://jobs.ou.edu/applicants/jsp/shared/position/JobDetails_css.jsp?postingId=254735\" rel=\"nofollow\">https://jobs.ou.edu/applicants/jsp/shared/position/JobDetail...</a>","time":1330615008,"type":"comment"},{"by":"leeny","id":3652668,"parent":3652041,"text":"TrialPay - Mountain View, CA - F/T<p>For better or for worse, online advertising is here to stay. Whether it's done right is up to you.<p><a href=\"http://www.trialpay.com/about/jobs/\" rel=\"nofollow\">http://www.trialpay.com/about/jobs/</a> (or email aline at trialpay)<p>keywords (for the scraper and the ctrl-f contigent): php, c, ec2, big data, mobile, constraint optimization, distributed and cloud computing","time":1330618390,"type":"comment"},{"by":"mikeburrelljr","id":3655563,"parent":3652041,"text":"GetHired.com, a funded Palo Alto, CA based start-up that connects job seekers and employers using video and voice, is hiring!<p>Watch a quick video to learn more about what we do:  <a href=\"http://youtu.be/_3tqC8WYK-g\" rel=\"nofollow\">http://youtu.be/_3tqC8WYK-g</a><p>PHP Engineers, apply here:  <a href=\"https://gethired.com/apply/111\" rel=\"nofollow\">https://gethired.com/apply/111</a>","time":1330668201,"type":"comment"},{"by":"eloisius","id":3681860,"parent":3652041,"text":"Atlanta<p>Emcien is looking to hire a Ruby on Rails engineer or someone  experienced with a similar framework. We do pattern detection and analysis in manufacturing, retail and social media.<p>We have a posting here: <a href=\"https://jobs.github.com/positions/1011ea28-5e53-11e1-9833-05794f8ce838\" rel=\"nofollow\">https://jobs.github.com/positions/1011ea28-5e53-11e1-9833-05...</a>","time":1331243658,"type":"comment"},{"by":"spacemanaki","id":3652209,"parent":3652041,"text":"Flurry, SF and NYC<p><a href=\"http://www.flurry.com/about-us/jobs.html\" rel=\"nofollow\">http://www.flurry.com/about-us/jobs.html</a><p>Our analytics and advertising SDKs are in tons of apps on Android, iPhone, and Windows, and we're dealing with more and more data every day. We're hiring for web, backend, mobile and ops roles (sales and business roles too if you're interested)<p>aki at flurry dot com","time":1330612875,"type":"comment"},{"by":"devinfoley","id":3652680,"parent":3652041,"text":"San Francisco, CA - Developer at 3taps<p>We need a good developer (or two or three). We make search and communication apps in iOS, Android, Ruby and Python. Our current project is <a href=\"http://anoni.com\" rel=\"nofollow\">http://anoni.com</a>.<p>It's a very relaxed environment, flexible on hours and telecommute. We get to use all the latest toys like Node.js, Redis, Mongo, etc.<p>Send me an email!","time":1330618556,"type":"comment"},{"by":"curtis","id":3654833,"parent":3652041,"text":"Redwood City, CA<p>Tidemark has open positions for User Interface Developers, Application Tier Developers, and Computation Platform Developers.  <a href=\"http://tidemark.net/company/careers\" rel=\"nofollow\">http://tidemark.net/company/careers</a><p>Tidemark is a well-funded but still relatively small startup in the Enterprise Performance Management/Business Analytics space.","time":1330648499,"type":"comment"},{"by":"paradox95","id":3653121,"parent":3652041,"text":"Path - San Francisco - <a href=\"http://path.com/jobs\" rel=\"nofollow\">http://path.com/jobs</a><p>Looking for server/infrastructure engineers, mobile engineers (probably any platform but especially Android and iOS) and ops engineers. User relations, product managers and designers, and other position available I'm sure.<p>Email jobs[at]path[dot]com\nTell them Travis sent you.","time":1330624054,"type":"comment"},{"by":"mickeyben","id":3652137,"parent":3652041,"text":"we're hiring a remote community manager for <a href=\"http://letitcast.com\" rel=\"nofollow\">http://letitcast.com</a>","time":1330611736,"type":"comment"},{"by":"lgierth","id":3652091,"parent":3652041,"text":"SoundCloud (Berlin, Germany) is looking for Backend, ActionScript, iOS, Android, Mobile Web, MIR, and Search Developers as well as Software Architects and Systems Engineers. Also looking for Systems Engineers in San Francisco.<p><a href=\"http://soundcloud.com/jobs\" rel=\"nofollow\">http://soundcloud.com/jobs</a>","time":1330611008,"type":"comment"},{"by":"js2","id":3653016,"kids":[3653162],"parent":3652041,"text":"Mountain View, CA<p>The RockMelt browser is based on Chromium and integrates with Facebook to make browsing a more social experience. Help us make it better.<p>Positions:<p>* Mac developer (Objective C/C++)<p>* Windows developer (C++)<p>* Javascript developer with C++ experience<p>* Visual designer<p>More details on each position at <a href=\"http://www.rockmelt.com/jobs.html\" rel=\"nofollow\">http://www.rockmelt.com/jobs.html</a><p>jay@rockmelt.com","time":1330622628,"type":"comment"},{"by":"bobx11","id":3655417,"parent":3652041,"text":"Boston/Cambridge: Python Web Engineers<p><a href=\"http://www.matchbox.net\" rel=\"nofollow\">http://www.matchbox.net</a><p>When universities need to identify the right students to admit, they use our software and services to make a more informed decision.  We build using Django and iOS.<p>To talk to a developer about it:  jsullivan (at) matchbox.net","time":1330663558,"type":"comment"},{"by":"moteur-diesel","id":3654055,"parent":3652041,"text":"www.toogonet.com<p>Site is crap, i know. Didn't have time to do it properly.<p>French startup, founded&#38;located in Bolivia, la Paz!<p>we mainly do webdev (jQuery frameworks, Php, sql&#38;mongodb-though not much yet -_-, ... open to everything exciting!apart porn) for a tourism software project, actually used by 10 clients.<p>Quick expansion the following months. The team is leaded by a french engineer who did succeed in tourism and now started 1y ago his own application for this industry.<p>languages:\nEnglish: mandatory; \nSpanish: you'll learn it here, don't worry;\nFrench: then, we will have to love you.<p>Any position welcome, though no intern. Not for discrimination or anything, this is just cause costs of bringing people from outside the country are expensive.We'd love to hear from people interested in staying in a foreign country for a year or 2.Gain experience, have freedom!","time":1330636189,"type":"comment"},{"by":"aduric","id":3660993,"parent":3652041,"text":"Kitchener, Ontario, Canada<p>Desire2Learn (www.desire2learn.com)<p>Revolutionize education! We're a fast growing company on the lookout for great talent.<p>We're looking for many roles (more information: <a href=\"http://www.desire2learn.com/careers/\" rel=\"nofollow\">http://www.desire2learn.com/careers/</a> or send me an email: aduric@gmail.com).","time":1330805352,"type":"comment"},{"by":"graiz","id":3652540,"parent":3652041,"text":"Raizlabs (<a href=\"http://raizlabs.com\" rel=\"nofollow\">http://raizlabs.com</a>) is hiring software developers who build awesome mobile applications. We focus on iPhone, iPad and Android. We are also looking for designers who obsess about the details.  We're located in Boston.","time":1330616944,"type":"comment"},{"by":"jank66","id":3652924,"parent":3652041,"text":"Karlsruhe, Germany: Blue Yonder<p>Seeking: Full time employees<p>About: Predictive Analytics / Big Data / Data Visualization<p>Looking for: Django/Python/Mongrel2/d3.js Rockstar<p><a href=\"http://www.djangojobs.org/developers/gig-for-djangopythonmongrel-rockstar/\" rel=\"nofollow\">http://www.djangojobs.org/developers/gig-for-djangopythonmon...</a>","time":1330621538,"type":"comment"},{"by":"mikelaming","id":3652688,"parent":3652041,"text":"London, UK - Enternships<p>Enternships is looking for ruby / python developers: <a href=\"http://www.enternships.com/en/enternships/5323-enternships-seeking-talented-developer-enternships-hq\" rel=\"nofollow\">http://www.enternships.com/en/enternships/5323-enternships-s...</a>","time":1330618604,"type":"comment"},{"by":"codybrown","id":3652541,"parent":3652041,"text":"Come make advanced website publishing accesible to the world.<p>scroll kit is hiring a third team member in NYC.<p><a href=\"http://scrollkit.com/s/127\" rel=\"nofollow\">http://scrollkit.com/s/127</a><p>Check out out what we've built so far: <a href=\"http://scrollkit.com/\" rel=\"nofollow\">http://scrollkit.com/</a>","time":1330616963,"type":"comment"},{"by":"psota","id":3654368,"parent":3652041,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers--UI/UX, frontend, backend data mining/algorithms. See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1330640650,"type":"comment"},{"by":"johnpaulhayes","id":3652699,"kids":[3655741],"parent":3652041,"text":"Popcap Games Inc\nDublin - <a href=\"http://bit.ly/zYNTWy\" rel=\"nofollow\">http://bit.ly/zYNTWy</a>\nAll Location: <a href=\"http://bit.ly/A3FrwE\" rel=\"nofollow\">http://bit.ly/A3FrwE</a><p>I'm a software engineer working out of the Dublin office and loving it!","time":1330618760,"type":"comment"},{"by":"GavinB","id":3652131,"parent":3652041,"text":"New York, NY<p>Assistant Project Manager, Game Development. This job is part project management and part game design. Help us build adventure games that tie to bestselling book series for kids. Shoot an e-mail gavinobrown@gmail.com if interested.","time":1330611625,"type":"comment"},{"by":"mlntn","id":3652600,"parent":3652041,"text":"OPENLANE - Mesa, AZ\nSoftware Developer II - PHP, MySQL, etc<p><a href=\"http://tbe.taleo.net/NA11/ats/careers/requisition.jsp?org=OPENLANE&#38;cws=4&#38;rid=702\" rel=\"nofollow\">http://tbe.taleo.net/NA11/ats/careers/requisition.jsp?org=OP...</a>","time":1330617696,"type":"comment"},{"by":"stevederico","id":3672836,"parent":3652041,"text":"SEEKING WORK - iOS Developer<p>iOS Developer located in San Francisco. App Development, Cocoa Touch, Objective-C.<p>Portfolio: <a href=\"http://www.bixbyapps.com\" rel=\"nofollow\">http://www.bixbyapps.com</a>\nPhone: 415-997-9706\nEmail: Steve@bixbyapps.com","time":1331067475,"type":"comment"},{"by":"n0rb3rt","id":3652251,"parent":3652041,"text":"Nokia Location &#38; Commerce (formerly NAVTEQ) -- Chicago, IL and globally<p>100+ open positions in Chicago alone, mostly engineering<p><a href=\"http://corporate.navteq.com/careers.htm\" rel=\"nofollow\">http://corporate.navteq.com/careers.htm</a>","time":1330613445,"type":"comment"},{"by":"talonx","id":3683096,"parent":3652041,"text":"Hyderabad/IN/No Remote/Full time<p>SocialTwist is looking for a DevOps engineer @our Hyderabad, India office. Details - <a href=\"http://jobs.hasgeek.com/view/dkjwm\" rel=\"nofollow\">http://jobs.hasgeek.com/view/dkjwm</a>","time":1331272609,"type":"comment"},{"by":"cbarr","id":3652714,"parent":3652041,"text":"Several Positions (12) - Los Angeles, CA area &#38; Plano, TX area.<p><a href=\"http://www.fonality.com/company/careers\" rel=\"nofollow\">http://www.fonality.com/company/careers</a><p>I can answer any questions cbarr@fonality.com","time":1330618952,"type":"comment"},{"by":"outside1234","id":3652424,"parent":3652041,"text":"Palo Alto, CA<p>Nest Labs (www.nest.com) - Startup with iPhone pedigree that has reinvented the thermostat already and we are only getting started.<p>Come work with us on our Android app.  Send your resume to jose@nestlabs.com","time":1330615593,"type":"comment"},{"by":"joshuaxls","id":3653219,"parent":3652041,"text":"For the best collection of startup jobs—many with equity and salary data—see <a href=\"http://angel.co/jobs\" rel=\"nofollow\">http://angel.co/jobs</a>. Here's all of YC's listings:<p><a href=\"http://angel.co/y-combinator/recruiting\" rel=\"nofollow\">http://angel.co/y-combinator/recruiting</a><p>And of course we're always recruiting at AngelList in SF:<p><a href=\"http://angel.co/angellist/recruiting\" rel=\"nofollow\">http://angel.co/angellist/recruiting</a>","time":1330625117,"type":"comment"},{"by":"dogas","id":3652546,"parent":3652041,"text":"Seattle/Philly/Remote<p>Join the team of happy hackers at PipelineDeals! We’re looking for a talented Rails developer in the Seattle or Philly area (remote work ok, for the right type of individual)<p>About us:<p>PipelineDeals is a web-based CRM platform specializing in getting sales teams organized. We're 6 years old, boostrapped, profitable, and proud. We built the company from the ground up with no external investments other than our own, and we are our own bosses. Now we have tens of thousands of customers in nearly 100 countries. You would be the 11th person to join our growing team!<p>Perks:<p>- Join a tightly-knit small team of very talented coders to help drive the product.<p>- We are very progressive with the technology we use. Chef, kiji-ruby, authlogic, Backbone.js, Coffeescript. We implement the things we find promising, and encourage all developers to help bring ideas to the table. Let your voice be heard and your opinion be respected!<p>- Our team is very test- and spec-driven. We typically use a peer-review model to ensure that none of us are going off the deep end with a solution. We are striving towards continuous deployment. We have our CI server run our test suite upon each push to the remote repo. We measure almost everything.<p>- You are encouraged to contribute to open source, and we have open source Fridays!<p>- Relish in the fact that the projects you will be working on will be used directly by thousands of our customers worldwide!<p>- Reimbursement for conferences or meetups you would like to attend, books you want to buy, screencasts you want to watch.<p>- Great benefits package, a competitive salary, and lots of room for growth. Our goal is to ensure you are comfortable so you will be productive.<p>Requirements:<p>- Must have at least a year of experience working directly with ruby, either with a company, or via open source. Past contributions to open source projects, or maintaining your own, are looked very highly upon.<p>- At least a year’s experience working with Rails, either your own or at a previous company.<p>- Experience with jQuery, Backbone.js, Coffeescript\n- Solid familiarity with git or other distributed version control system.<p>- Enough SQL to understand what rails is doing in the backend.<p>- A good sense of humor is a strict requirement. Company culture is very important to us, and we are absolutely NOT a bunch of straight-laced, profit-driven, cubicle-sitting curmudgeons.<p>- Remote work OK, but it is highly preferable if you are located around the Philadelphia or Seattle area. You will be expected to be at the office sometimes. We do get lonely.<p>Check out the site, play with the demo. <a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a><p>Interested? Email a link to your Github account (or resume) to Grant Ammons at grant@pipelinedeals.com. We look forward to hearing from you!","time":1330616976,"type":"comment"},{"by":"thspimpolds","id":3652595,"parent":3652041,"text":"We are hiring developers of all types who love mobile.  www.sessionm.com","time":1330617628,"type":"comment"},{"by":"YairR","id":3652614,"parent":3652041,"text":"TweetMyJobs.com and Internships.com are currently recruiting for summer interns onsite. Both sites also operate in the social recruiting world and list many job opportunities. Good luck to all.","time":1330617817,"type":"comment"},{"by":"sycr","id":3652474,"kids":[3652654],"parent":3652041,"text":"Anyone in Toronto?","time":1330616160,"type":"comment"},{"by":"jaredrhine","id":3653242,"parent":3652041,"text":"Xtranormal, <a href=\"http://www.xtranormal.com/\" rel=\"nofollow\">http://www.xtranormal.com/</a><p>San Francisco near Montgomery BART<p>Xtranormal allows people everywhere to tell animated stories in full 3D using web, desktop, and mobile tools. We need web/mobile application developers, designers, and operations people to help create our next generation of amazing ways to create and share movies. We're growing, have a great team, and get to do cool thing like Big Lebowski partnerships: <a href=\"http://www.xtranormal.com/big_lebowski\" rel=\"nofollow\">http://www.xtranormal.com/big_lebowski</a><p>To apply for any of these positions or for more information, please email jobs@xtranormal.com and you'll get straight to the hiring manager. Postings are available at <a href=\"http://www.xtranormal.com/jobs/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/</a><p>Positions:<p>* Senior Web Applications Engineer<p><a href=\"http://www.xtranormal.com/jobs/se-frontend/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/se-frontend/</a><p>Build full browser-based applications using heavy JavaScript and the classic HTML/CSS/DOM stack. We have mostly jQuery but are flexible. Our backend is Python+Django+MySQL+celery. You'd have heavy involvement in our web-based movie creation tool, with drag-and-drop, video integration, and all sorts of interesting browser challenges. You'd provide a senior perspective on the evolution of our codebase and help lead refactors, APIs, and new modules.<p>* Operations Manager/Lead Systems Engineer<p><a href=\"http://www.xtranormal.com/jobs/ops-sysadmin/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/ops-sysadmin/</a><p>Hands-on Linux cloud+colo production operations. Own the full stack, with an interesting mix of not-just-Web production systems. EC2, chef, Apache, Python+Django, Nagios, collectd, and lots of other modern tools. Be willing to participate in pager rotation. We enjoy a close collaboration between development and operations. We're always looking to improve our systems and have lots of flexibility to replace pieces that aren't doing well for us any more, as we grow.<p>* iOS Mobile Applications Engineer<p><a href=\"http://www.xtranormal.com/jobs/se-ios/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/se-ios/</a><p>Break open our mobile experience by translating our rich movie-making toolset onto the iOS platform. Should have a portfolio of demoable applications for iPhone and iPad, with a focus on interactive applications.<p>* Web and Graphics Designer<p><a href=\"http://www.xtranormal.com/jobs/ux-designer/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/ux-designer/</a><p>Develop interaction and graphical treatments for a wide variety of Xtranormal products and initiatives.  Integrate web usability, typography, user experience, and project constraints to produce great user experiences in collaboration with our engineering and product teams.<p>For all positions, we have benefits that include:<p>* Comprehensive benefits package\n* Ability to participate in stock option plan\n* SF/BART-able location","time":1330625446,"type":"comment"},{"by":"kathyaalberts","id":3654255,"parent":3652041,"text":"Tout in San Francisco, CA is the leading network for real-time video status updates (Touts)<p>Tout is breaking new ground by combining social networking with the power of video to deliver a revolutionary experience for users, celebrities, and brands. We are changing how people interact, delivering a rich social sharing experience in full color, sound, and motion.<p>Tout is a precocious toddler in Internet years, less than a year old but cruising toward proficiency in Big Data and massive video delivery, and playing in the sandbox with big celebs and brands. Our favorite toys are Ruby on Rails, Node.js and the Amazon cloud, though we're already very good at sharing.<p>We are definitely the only startup with its entire history captured in a series of fifteen second videos.\nOur eminently accessible office is in startup central down here in South Beach/SOMA, where we are in the midst of a noisy playground of other unruly startups and have access to an ever-changing variety of lunch trucks.<p>We have a Ron Jones original on the wall, beer in the fridge, and top shelf tequila within a hundred yards. We have ping pong. Duh. We have a kitchen that makes it so you don't have to have one of your own. We have all of these things. But we don't have you.<p>DevOps Engineer<p>We’re seeking a highly motivated DevOps engineer who will manage server and application infrastructure on the AWS platform, including developing tools for configuration management, code deployment, continuous integration, automated testing and monitoring. You will need strong skills in implementing and managing high availability, mission critical infrastructure, and should be a dedicated problem solver who can multi-task and prioritize tasks in a fast-paced and demanding environment.<p>The ideal candidate will have experience in both system engineering /administration and software development, with a focus on building back-end systems like monitoring, automation and management tools.<p>Responsibilities<p>• Build and maintain tools that will help us test, deploy, measure, monitor and scale our applications and infrastructure\n• Oversee and perform server and application deployment including release management\n• Help to continuously improve our processes and tools to ensure the best possible experience for our users, from availability to performance and reliability\n• Monitor and maintain our systems, including being part of a 12x7 on-call rotation and escalation path  \n• Collaborate with other engineers to to optimize application and infrastructure for performance, reliability, failover, and scale<p>Minimum Candidate Qualifications\n• 3+ years of experience supporting a real-time, 24x7 production web environment. 3+ years of Linux administration experience.\n• Strong written and verbal communication skills; ability to organize and prioritize tasks.\n• Proficiency with one or more scripting languages: shell, Perl, Python, Ruby, or equivalent.\n• Experience with NoSQL systems (MongoDB, Cassandra, Riak, CouchDB, etc.)\n• Comfortable in a start-up environment where innovation and change are the norm.\n• Experience using configuration management systems (Chef, Puppet, CFEngine, etc.)\nAdditional Candidate Qualifications\n• BA/BS in Engineering or Computer Science highly preferred, other degrees considered when accompanied by appropriate technical aptitude\n• Experience using and managing Node.js, and Ruby on Rails\n• Experience with version control systems such as git\n• Experience with cloud based deployments.  Production experience with AWS systems is a big plus\n• Experience with the design and deployment of large-scale infrastructure projects a big plus<p>Please email resumes to: katherine@tout.com.","time":1330639068,"type":"comment"},{"by":"joelesler","id":3653930,"parent":3652041,"text":"<a href=\"http://blog.snort.org/2012/02/vulnerability-research-team-is-hiring.html\" rel=\"nofollow\">http://blog.snort.org/2012/02/vulnerability-research-team-is...</a><p>The Vulnerability Research Team is hiring, we want YOU.<p>Have you ever written a Snort rule?  or wanted to?<p>Like messing about in the newest vulnerabilities or malware?  Like writing exploits?  Enjoy challenges like \"Here's a file that crashes -application- , figure out why\"?  Want to work with us to design what is next in Snort?  ClamAV?  Razorback?  Or any of the above topics?<p>We want you.<p>Let me talk about what I like.<p>The smartest people I've ever met all in one room.  We get to bounce ideas off of each other, figure out strange ways of fixing a problem, and come up with a solution.  That means anything from controlling EIP to how to write a rule to compare two things from two different streams using flowbits.<p>We pride ourselves in doing things not only better than the competition, but in the open too.<p>We work hard.  We play hard.  For instance, today, during break, we played kickball (remember that?) with a big yoga ball, and the ball got stuck in a tree.  Yours truly climbed said tree and retrieved the ball.  Then I came back inside and pulled apart some malware.  Beware of nerf darts, RFI readers, and the 6lb sand-filled ball of doom.<p>Like working in an environment where it doesn't matter how you wind up at the result, as long as you get the correct results?  Tired of being told what OS to use?  Like debating the merits of C, perl, or ruby?  Have a strong opinion between bash and zch?<p>If there's a problem that we don't have a solution for, we invent one.  Last thing we invented resulted in patents that have our people's name on them.<p>Working on next years projects this year.<p>Being the best.<p>When you write protection for a vulnerability or malware here, you cover IDS/IPS, a NGFW, and two antivirus systems.  You protect networks from endpoint to border and into the cloud.<p>If you gag when you hear the word cloud or synergy.<p>Vegetarian?  Paleo? Meat eater?  There is someone here that will sympathize with you.<p>Working for the fastest growing company in security\nHonestly there's way too many things to list.<p>Our currently open job listings are here.\n<a href=\"https://sourcefire.silkroad.com/epostings/index.cfm?fuseaction=app.welcome&#38;category_id=14174&#38;company_id=15640&#38;version=1&#38;startflag=1&#38;parent=VRT%20%28Vulnerability%20Research%20Team%29&#38;levelid1=14174\" rel=\"nofollow\">https://sourcefire.silkroad.com/epostings/index.cfm?fuseacti...</a><p>But that's not even the complete list.  We're a growing company, with lots of projects under our purview, and we need people, both junior and senior to be able to fill these roles.<p>If you like Snort, or ClamAV, or think you can learn, and want to learn, shoot us your resume at research [at] sourcefire [dot] com.<p>Challenge yourself.  Challenge us.","time":1330634556,"type":"comment"},{"by":"itay","id":3653508,"parent":3652041,"text":"Seattle, San Francisco, Cupertino (and other places), FULL-TIME, INTERN, H1B<p>A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people. Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>For example, my project for the past couple of months has been to develop our new Node.js/Browser SDK, including pulling some of our propietary UI components and sharing them with the world. We also do a lot of work with customers to best help them use Splunk. One of the projects I was involved in included analyzing social data using Splunk (like Twitter/Foursquare).<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you. I personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>I wanted to highlight a few specific positions we're looking for:<p>* Dev. Platform Software Engineer: This is the team I work on. We strongly believe that there is a use for Splunk outside of logging, and we're enabling the usage of the technology for dealing with large quantities of data, whether it's for social network analysis, cloud management or anything in between. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oHkCVfwi\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oHkCVfwi</a><p>* Cloud Software Engineer: we're developing the next stage of our product, which is a hosted version of Splunk in the cloud, with all the benefits you'd expect (like automatic elastic scaling). Come help us make this a reality: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL</a><p>* Hadoop Software Engineer: Usage of Hadoop is exploding to do batch-oriented processing on massive quantities of data. We think there is a lot of value to be had by combining the power of Splunk and Hadoop, and we're developing solutions to make this possible. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS</a><p>* Software Engineer in Test: Splunk is a complex machine, deployed in a distributed manner, many times being used for different things. Our testing team is top notch, and helps us deliver quality releases. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe</a><p>* Windows QA Engineer: Splunk is putting a lot of effort into making Splunk &#38; Windows to be a match made in heaven. We need people to help us make sure we're getting everything quite, because details matter. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oLpdWfw3\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oLpdWfw3</a><p>* Server Sustaining Engineer: Splunk is a very customer-focused company, and it's important that customers are happy with the products. The sustaining team is in charge of making sure that after major releases, we can keep customers happy for a long time. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=obAdWfwE\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=obAdWfwE</a>","time":1330628899,"type":"comment"},{"by":"alexsolo","id":3653167,"parent":3652041,"text":"San Francisco, CA<p>PagerDuty - <a href=\"http://www.pagerduty.com\" rel=\"nofollow\">http://www.pagerduty.com</a><p>FULLTIME, INTERN<p>* Software Engineers (<a href=\"http://www.pagerduty.com/jobs/engineering/software-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/software-engineer</a>)<p>* Front-end Engineers (<a href=\"http://www.pagerduty.com/jobs/engineering/frontend-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/frontend-engineer</a>)<p>* Operations / Devops Engineers<p>* Software Engineering Intern<p>What we do:<p>At PagerDuty, we're building an alerting and incident tracking system that helps IT operations groups detect and respond to high-severity issues.<p>You know how there are thousands of monitoring systems out there? We don't do monitoring. Instead, we plug into all of the existing monitoring systems and handle the people part of the equation: alerting (via phone, SMS, email), on-call scheduling for teams, auto-escalation of critical alerts, and incident tracking.<p>Our current product helps IT ops people know about critical problems as quickly as possible, collaborate as a team to fix problems quickly, and help track and improve incident response performance over time. Our vision is to expand into the event management space. This means treating data from monitoring tools as events and intelligently filtering and correlating events across monitoring tools in order to reduce the noise. It's like spam filtering for events: a critical problem, such as a bad deploy, will automatically alert the entire team via phone call, while a minor issue like a server going down in a fleet of 20 will only generate a low-priority email alert.<p>Why you should work with us:<p>We are different than many startups out there: we charge money for a product. Companies love our product; that's a lot to say for a system that frequently wakes our users up in the middle of the night. Our revenue is growing steadily at more than 10% month-over-month since we launched in Jan 2010. Our customers include: Netflix, National Instruments, VMWare, NBC Universal, Square, Heroku, and 37signals. We're also fairly early stage (11 people, pre-series A). This combination means you'll get a market-rate salary plus a decent chunk of stock in a company that has already figured out its business model.<p>We have very interesting technical challenges. Our biggest challenge is engineering a system that never ever goes down. Since our customers rely on us to deliver their critical alerts, we are not allowed to go down ever. This means we've had to engineer a distributed system across multiple data centers that can survive a single data-center outage without skipping a beat. We're not done: we have a lot more work to do to ensure our system reaches the level of telephony reliability (five-nines). If you like engineering distributed fault-tolerant systems, join us.<p>To apply, please send your resume to jobs@pagerduty.com.","time":1330624563,"type":"comment"},{"by":"driedyam","id":3652997,"parent":3652041,"text":"Are you looking for a chance to do agile development? Do you want to immerse yourself in extreme programming using test driven development? Then Social Chorus is for you.<p>Halogen Media Group merged with YouCast Corp. to collaborate in forming a powerhouse of technology, Social Chorus (<a href=\"http://socialchorus.com\" rel=\"nofollow\">http://socialchorus.com</a>), that measures social reach through paid and earned media through influencer distribution. Our technology stack is up to date with current standards.<p>On to our development practices. We are on Rails 3.1.1 with deployment on Heroku and test driving EVERYTHING with Rspec, Jasmine, and Selenium. We are running Jenkins on our Amazon EC2 cloud for our continuous integration tests and firing it off on every push to Github. Every Monday we have an internal planning meeting that includes the dev team along with our project manager to go over upcoming features, stories that need discussion, and story estimation. Why stories? To manage the project and all the components that drive its development we use Pivotal Tracker, the collaborative, lightweight agile project management tool, brought to you by the experts in agile software development. Mornings start with stand-ups to go over the previous day's work, work for the current day, or any blockers anybody might have. Pair programming and green tests make the day fly by with the gratification of clean code without broken windows. Our analytics module runs in the cloud, hitting nginx, aggregating all data into our sharded MongoDB database. Like to map/reduce over extremely large data sets? Sweet.<p>Perks. Our development is fueled by a fully stocked kitchen and beer bashes at least once a month. Team dinners, ski/snowboard trips, lunchtime crosswords, Giants games, are some of the enjoyable company sponsored events. Halloween and Christmas parties also keep us busy as the holidays get closer. On top of that, we have competitive salaries and a semi-annual bonus plan.<p>Currently we are boot-strapping with Pivotal Labs at their office at 875 Howard St. Upon the end of our engagement with them, which tentatively concludes at the end February, we are moving back to our home base located in SOMA, China Basin, right next to AT&#38;T Park to join the rest of the team. Come join our team and show off your Ruby on Rails chops!<p>Responsibilities<p>* Test Drive everything<p>* Push out awesome code<p>* Pair well with each other<p>* Constantly stay up to date with technology<p>Experience<p>* Ruby on Rails<p>* RSpec<p>* CSS<p>* JavaScript<p>* Database Architecture<p>* Heroku is a plus<p>Skills<p>* Ruby on Rails<p>* RSpec<p>* CSS<p>* JavaScript<p>* Database Architecture<p>* MongoDB is a plus<p>* NGINX is a plus<p>* Amazon EC2 is a plus<p>Education<p>* BS Computer Science or equivalent<p>Please contact jobs@socialchorus.com ATTN:chris","time":1330622330,"type":"comment"},{"by":"dogas","id":3652496,"parent":3652041,"text":"Seattle/Philly/Remote<p>Web Operations Engineer (DevOps) at PipelineDeals (<a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a>)<p>PipelineDeals LLC is looking for a\nfull-time Operations Engineer to join our team. You will be managing all services running at PipelineDeals.com, from developer testbeds to the very product our thousands of customers use. We need an individual to help build and maintain the supporting infrastructure for the services and to be responsible for running a superior service for our customers.  Ideally, you'd be located either in Seattle or the Philadelphia area, but remotes are also welcome to apply.<p>About us:<p>PipelineDeals is a web-based CRM platform specializing in getting sales teams organized.  We're 6 years old, boostrapped, profitable, and proud.  We built the company from the ground up with no external investments other than our own, and we are our own bosses.  Now we have tens of thousands of customers in nearly 100 countries.  You would be the 11th person to join our growing team!<p>Environment:<p>We believe strongly in metrics, testing, continuous integration, and working fluidly and harmoniously with our engineering and product teams. Everything we write is designed for simplicity and maintainability. We take security very, very seriously.  All our code runs in the cloud (AWS).<p>Skills and Requirements:<p>You should have:<p>- Advanced experience in systems administration, packaging and installer technologies.<p>- Experience with Amazon EC2 and the AWS stack (we use fun stuff like S3, ELB, ElastiCache, EBS, IAM).<p>- Experience with Chef, Puppet or another configuration management system (we use Chef).<p>- Experience administering MySQL and InnoDB deployments.<p>- Firm grasp of TCP/IP networking.<p>- Strong written and verbal communication skills.<p>- Excellent organizational skills.<p>- Strong analytical and troubleshooting skills, under pressure.<p>- Have opinions on the right way to do things, and are comfortable sharing them, respectfully.<p>It would be great if you have any of the following:<p>- Experience developing and documenting plans, policies and procedures in support of IT security, disaster recovery, and business continuity planning.<p>- Experience deploying and running build and test automation tools (we use Buildbot, Cucumber and Jasmime).<p>- Knowledge of web application server configuration (Nginx and Unicorn).<p>- Familiar with source control systems such as Git.<p>If interested, please email Grant at grant@pipelinedeals.com.","time":1330616379,"type":"comment"},{"by":"bendilts","dead":true,"id":3652666,"parent":3652041,"text":"Salt Lake City, UT. - <a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http://www.lucidchart.com</a><p>LucidChart is an HTML5 diagramming application that proves web apps don't need to be pale imitations of their full-featured desktop counterparts. Real-time collaboration and full versioning history aren't our only advantages; users tell us they like LucidChart because it's faster, easier, and smoother than Visio and Omnigraffle.<p>We need great engineers who want to work in a Silicon Valley startup, but would rather live 15 minutes from the ski resorts in Utah. We have one of the largest Javascript codebases on the Internet supporting LucidChart's client, and are using Scala, PHP, node.js, MongoDB, and MySQL to power our servers. Experience in one or more of these areas is helpful, but we're most interested in people with inhuman problem solving skills.<p>We currently have 8 full-time employees, including 5 engineers. That ratio reflects the focus of our organization -- we are a software company, and we live or die on the strength of our engineering team. We think we have the strongest engineering team in Utah, and want to add at least 3-5 people this year.<p>All hires are made by unanimous decision of the current team. If you join us, you can know that everyone here wants you here.<p>Send resumes, github profiles, or whatever else might be relevant to jobs at lucidchart dot com.","time":1330618376,"type":"comment"},{"by":"urgeio","id":3653322,"parent":3652041,"text":"BERLIN, GERMANY, FULL TIME/FREELANCE/REMOTE<p>VERSUS IO, <a href=\"http://versus.io\" rel=\"nofollow\">http://versus.io</a><p>VERSUS IO or 'The Google of Comparisons' offers product comparisons in natural language generated from raw data. The pilot with cell phones is online and generated already strong traction: 2,1x avg. growth per month, 400+ first places on Google and rolled-out in 17 languages incl. Chinese. We are using RoR 3.2, PostgreSQL, HAML, SASS, Redis, Coffee, YML, Github and some magic code creating natural text and narrative content in different languages.<p>We are looking for:<p>=&#62; Lead Software Engineer Ruby on Rails<p>=&#62; Lead Software Engineer Frontend<p>=&#62; Software Engineer Interns<p>We offer:<p>=&#62; Be with an awesome team and top-notch architects<p>=&#62; Contribute to a cutting-edge product employing newest technologies<p>=&#62; Be right in the center of Berlin-Mitte, one of coolest neighborhoods and startup communities<p>Berlin is calling!\nIf you are passionate about building great software, we’d love to talk with you. If you don't live in Berlin yet, we could help to fix that.<p>To apply or if you have any questions, just send us an email with your CV and a short note about yourself to:<p>ramin (at) urge (dot) io","time":1330626424,"type":"comment"},{"by":"Cdestefano2004","dead":true,"id":3653467,"parent":3652041,"text":"Avenue100 Media Solutions- Woburn/Cambridge MA<p>We are looking for a Software Engineer to join our team. Awesome place to work, laid back, flexible, extremely talented cast.<p>Our company is a leading analytics-based performance marketing company that helps institution acquire qualified customers. We are experts in the art and science of education digital marketing. Our sites are seen by nearly 30 million visitors annually.<p>Our engineers work with the research, sales, and traffic teams to build solutions to their toughest problems and rapidly deploy tools to keep our business ahead of the competition. Our small teams are solely responsible for their projects. This allows each engineer a high level of independence and flexibility, but also demands responsible project and resource management.<p>Built by data driven MIT scientists, our successful startup company has transformed into becoming one of the major players in the online education space. We need highly motivated, independent thinkers that want to make an impact on the business while not having to wait for a successful exit. Our compensation plans are highly competitive and we prefer short-term bonuses over any unclear or hazy equity package.'<p>Why us?\n-Excellent pay/benefits/and bonus\n-Laid back environment/flexible schedule\n-Gym/cafeteria on-site\n-Ping Pong table/video games\n-Free snacks\n-Company outings<p>If you are interested please send a resume to cdestefano@avenue100.com","time":1330628213,"type":"comment"},{"by":"benihana","id":3652172,"parent":3652041,"text":"Bronto - <a href=\"http://bronto.com\" rel=\"nofollow\">http://bronto.com</a> - Durham, NC.<p>A marketing platform specializing in email. Our clients include Etsy, Trek, Sam Adams, and Armani Exchange to name a couple. We provide a web app with which allows our clients to send email, SMS, and social (facebook/twitter) marketing content to their customers.<p>- PHP software engineers<p>- UI/UX engineer<p>- Production software engineer (first-responder handling bug code)<p>- PHP software engineering manager<p>App is written in Zend PHP. The back-end data comes from a mix of MySQL via PHP and Hbase and Cassandra via Java. 10/12 on the Joel test (3 and 12 not included), code reviews, CI, automated unit tests, solid QA team.<p>The engineering management is fantastic, and the company culture is great - we usually have paid for activities monthly, free beer weekly, and foosball daily.","time":1330612240,"type":"comment"},{"by":"Anirak","dead":true,"id":3652281,"parent":3652041,"text":"Boston, MA - 829 Studios (<a href=\"http://829llc.com\" rel=\"nofollow\">http://829llc.com</a>)<p>829 Studios a web development studio specializing in integrated marketing.  We have expanded rapidly over the last year and continue to grow.  We are looking to hire for two positions.  Candidates must be in the Boston area.<p><i>Python/Django Developer</i><p>We are looking for a developer who is experienced in Python/Django or willing to learn, so long as you have experience in other web-based languages such as PHP or Ruby.<p><i>ASP.net Developer</i><p>We are looking for someone who is already experienced in ASP.net as well.<p>Please email Dan at dellis [at] 829llc.com with any questions or to apply.","time":1330613807,"type":"comment"},{"by":"wcbracken","dead":true,"id":3652576,"parent":3652041,"text":"Louisville, KY area - Director of IT - Data Management for multi-thousand person customer contact company.<p><a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=2637014\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=2637014</a><p>Director of IT, Data Management, leads the overall implementation of business intelligence initiatives, overseeing data warehouse and data mart development and operations by practicing expertise in the DW/DM life cycles, including designing,developing, deploying, and governing all facets of the data warehouse including dimensional and relational models.","time":1330617346,"type":"comment"},{"by":"ginkgoo","dead":true,"id":3652273,"parent":3652041,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology.<p>Ginkgo BioWorks is a well-funded MIT spinout that genetically engineers organisms that make the world better. Stop building soulless web apps and work on something that matters: <a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a><p>apply here: <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1330613698,"type":"comment"},{"by":"golovast","dead":true,"id":3653477,"parent":3652041,"text":"Los Angeles, CA (Encino more specifically). Full time, on-site.<p>Sr. Linux Systems Admin/Engineer. We are looking for a jack-of-all-trades type. Someone who is comfortable with a lot of different technologies and stacks.Apache/Nginx/MySQL/Mongo/Tomcat.EC2 experience is a huge plus.<p>About the company: we do online market research and a lot of data analysis. More info here: <a href=\"http://www.usamp.com/\" rel=\"nofollow\">http://www.usamp.com/</a><p>Contact email: devops@usamp.com","time":1330628373,"type":"comment"},{"by":"garysieling","dead":true,"id":3652080,"parent":3652041,"text":"Greater Philadelphia (Whitpain/Blue Bell). Full time, Interns.<p>Wingspan Technology has a series of enterprise software products for integration between Sharepoint &#38; Documentum, and SaaS verticals. We're working on some big projects and new products and growing fast.<p><a href=\"http://www.wingspan.com/careers/\" rel=\"nofollow\">http://www.wingspan.com/careers/</a>","time":1330610874,"type":"comment"},{"by":"recruiter","dead":true,"id":3652069,"kids":[3652197],"parent":3652041,"text":"Business Applications Sales Executive\nResponsible for a multi-state region in the Pacific Northwest/West coast. Selling products and services to mid market companies. Includes but not limited to: MAS90, Accpac, MAS500, X3, HRMS solutions, Enterprise Content Management, Web solutions, Infrastructure and Managed Services.","time":1330610655,"type":"comment"},{"by":"hello-yoshi","id":3652489,"kids":[3653417,3653679],"parent":3652041,"text":"Toronto, ON - Slightly Crazy Web/Mobile Developer (<a href=\"http://www.myplanetdigital.com/careers\" rel=\"nofollow\">http://www.myplanetdigital.com/careers</a>)<p>We are change agents. With offices in Toronto and Chicago, Myplanet is a rapidly growing provider of technical and creative services for web and mobile platforms. Along with a top-notch user experience/interactive team, some of our main specialties include the Drupal Social Publishing Platform, the Magento E-Commerce platform, mobile development for Android and iPhone devices, PHP and Python-based web applications and integrating weird legacy systems (hello RPG code, how did you get in there?).<p>Our clients range from large public companies to startups, non-profits and government agencies. On any given day, we work on projects ranging from building creative new web and mobile experiences, to launching startups for clients, to helping clients understand and plan for adoption of new interactive technologies. We are, in essence, one part technology specialist, one part interactive agency, and one part business model incubator.<p>We like to work on things that matter with people who care.<p>===================================================================================================<p>About the position<p>You'll be tasked with building important systems for interesting clients, with plenty of technical challenges and opportunities to learn as you go. You'll work in a Scrum team, primarily in PHP to start - you'll also likely learn how to build complex systems in Drupal through our 2 month intensive training program with world re-known Drupal experts.<p>About you<p>A background in Computer/Software Engineering or Computer Science is strongly preferred, but we're open if you can demonstrate you know your stuff and have a nonconventional degree. We're looking for 1-2yrs experience (if you're fresh out of school get in touch anyway). Double points if you have startup experience.<p>We mostly work in PHP, but diverse language experience is a plus. It's more important that you're smart and driven than that you're a PHP expert. If you've played around with iOS development, HTML5, Python, Ruby/Rails 3, Android dev, Facebook app dev, etc., those are all positives.<p>===================================================================================================<p>Learn more - <a href=\"http://www.myplanetdigital.com/careers\" rel=\"nofollow\">http://www.myplanetdigital.com/careers</a>","time":1330616312,"type":"comment"}]]}