{"by":"blader","id":4463705,"kids":[4465633,4465257,4466209,4464728,4465251,4466667],"parent":4463689,"text":"San Francisco: product generalists and systems generalists.<p>What we do: subscription based social hyperlocal mobile gamified dating discovery engine with loyalty coupons. For the enterprise.<p>Just kidding.<p>We're a stealthy team of technical generalists filling a hole in the universe by building software that enriches the human experience. Everyone on our team codes and contributes on every level, front to back. We've all built web scale products and scaled them to millions of daily active users with zero marketing spend.<p>The world is becoming a different place: everyone is going to be carrying around a network connected super computer with ambient sensors in their pockets. We can see the future that is enabled by these devices. We are making that future happen.<p>Real talk: We've been running our prototype for 3 months now and we all use it multiple times a day, every day. Every person we've showed it to has asked us if they can have it. Every single person who's had it installed has gotten mad when our testflights expire.<p>We are well funded by a long list of top tier investors: <a href=\"http://angel.co/herelabs\" rel=\"nofollow\">http://angel.co/herelabs</a><p>We're looking for a select few product generalists (designer hackers with mobile expertise) and systems generalists (systems automation, machine learning, distributed computing) who can come in and contribute at speed on day one, and who are world class at more than one thing.<p>Ideal candidates are brilliant, fearless, and passionate individuals who are uncompromising in their pursuit of building an incredible product that will positively affect the lives of every human being every day.<p>As teammates we value commitment and accountability; honing our craft; building tools to create leverage; and seeking to learn from and understand each other.<p>We are offering founding team equity and competitive salaries. Retina Macbook Pro (or Air) &#38; 30 inch monitor are standard issue. Office space in the heart of the SoMa district in beautiful San Francisco. Willing to relocate. Willing to fly you in for interviews. Willing to tell you our stealthy secrets.<p>We are not your typical San Francisco stealth startup. We are NOT another me-too-social-local-sharing app. We DON'T sell condoms by subscription. We are NOT the place to share photos of your dog taking a leak. There will be NO gamification.<p>Life is short. Build stuff that matters.<p>Email siqi at herelabs.com. Interns and H1Bs welcome.","time":1346508463,"type":"comment"}