{"by":"wehriam","id":4464747,"parent":4463689,"text":"New York City + Remote | Full Time | Open to Covering Relocation Costs<p>Designers | Community Managers | Developers<p>Four out of five people report a negative experience when buying a new car and most new car sales departments lose money. Tred helps solve these problems by allowing consumers to configure the perfect new car, then working with dealerships to find it at a great price.<p>We are pre-release, angel-funded, and backed by some of the biggest names in the industry, including the former CEO of General Motors.\nWe are looking for independent thinkers ready to build a company from the ground up. It would be great if you love cars - but you should love people more.<p>* Designers: Your portfolio should include click and touch interfaces. You want to write production level HTML and CSS.<p>* Community managers: You excel at marketing and support. You are excited about inventing and exploring technical solutions.<p>* Developers: You have strong front-end web skills and will rock our Node.js + Backbone.js based platform. You enjoy communicating with a diverse product team.<p>We are a small team with a diverse background:<p>* John Wehr, former CTO of <a href=\"http://flavors.me\" rel=\"nofollow\">http://flavors.me</a> and <a href=\"http://goodsie.com\" rel=\"nofollow\">http://goodsie.com</a><p>* Grant Feek, former private equity associate, former BMW sales, Harvard MBA<p>* Lead Investor Rick Wagoner, former CEO of General Motors<p>Where we are:<p>* We have been working out of <a href=\"http://generalassemb.ly/\" rel=\"nofollow\">http://generalassemb.ly/</a> in New York for the last six months<p>* The founders are based in Seattle until November<p>* We are actively looking for office space in the New York area<p>Email johnwehr@tredsite.com with \"Hacker News\" in the subject line. Please include:<p>* A quick introduction<p>* Your portfolio, resume, or Github account<p>* Any other materials you'd like us to see<p>Please also free to contact me on gtalk at johnwehr@gmail.com or Skype at 'wehriam'","time":1346526577,"type":"comment"}