{"by":"amacinho","id":4464084,"parent":4463689,"text":"Research Engineer, Crimson Hexagon, Boston, MA.<p>Do you have excellent programming skills in Java and at least one of the following languages: Python, Ruby, or R? And an interest/demonstrable knowledge in machine learning, data mining, and statistics?<p>We are looking for a Junior Research Engineer who will be part of our research team. You will be responsible to research, investigate and test new technologies for big data storage, processing, and analytics. In particular, you will build scalable systems that can efficiently process petabytes of data, build and maintain storage systems that are continuously updated and require holding tens of billions of records each with millions of fields. You will work closely with the research scientists in a challenging and nurturing environment.<p>Requirements:<p>Successful candidates will be able to demonstrate achievement in some or all of the above, and you will also be heavily evaluated for your attitude, approach and other intangibles. With that, more definitive criteria for the ideal candidate follow:<p>* Working with large datasets<p>* Unix command line tools<p>* MapReduce paradigm, Hadoop and HDFS<p>* HBase, Cassandra, MongoDB or similar key-value storage systems<p>* Social media, Web application development<p>Above all, we are looking for an engineer with a strong passion for working with large social datasets, who is not afraid of getting his/her hands dirty and who never gets tired of trying and learning new technologies. Our research team provides a spirited, supportive and creative environment where we can learn from each other and build the next-generation social media analytics frameworks.<p>If we have triggered your interest, send us your resume and cover letter telling us why you would like to be part of our team. Be sure to provide concrete examples of your programming skills, such as sample codes that solve your favorite toy problems, demos, web applications you built, public code repositories such as GitHub where you contribute to open source projects. If such examples are not available tell us that, and instead provide short descriptions of previous projects you have been involved in previous jobs or during your education. This is our Van Halen Brown M&#38;M’s test. Please be sure to provide this extra information along with your application.<p>We look forward to seeing if you have what it takes to achieve something extraordinary with Crimson Hexagon!<p>For details: <a href=\"http://www.crimsonhexagon.com/junior-research-engineer/\" rel=\"nofollow\">http://www.crimsonhexagon.com/junior-research-engineer/</a>","time":1346515306,"type":"comment"}