{"by":"ismarc","id":4464762,"parent":4463689,"text":"Invodo, Looking for Senior Software Engineer\nAustin, TX, remote strongly unlikely\n(I'm going to copy-paste pieces from the job posting, but if you'd like more information or are just curious about what we're doing, drop me a line at mbrace@invodo.com).<p>What we do:\nInvodo helps businesses sell more through the power of video. As a full-service video solution, Invodo creates high-quality video at scale, delivers it through retail-focused technology, and publishes to Facebook, YouTube and retail channel partners to expand the impact. The Invodo video solution increases conversion rates, reduces returns and drives site traffic for clients including Internet 500 retailers and major manufacturers.<p>Invodo is an early-stage company so as a Senior Software Engineer you will play an incredibly important role in the success of both our clients and Invodo.<p>Software Engineers are expected to take ownership of substantial software modules, assist with technical product design, and contribute to the software engineering process at Invodo. The development will be concentrated on our core content management system and analytics platform (my.invodo.com). This customer-facing application software is written in Java/GWT using Hibernate and MySQL backend services.<p>Nearly all of our infrastructure services are written using Scala while the web application is currently written in Groovy (historical artifact at this point).  It's hard to cover everything we do technology-wise in a short post, but we have our own player, make heavy use of CDNs for content distribution, our own analytics system and platform as well as an end-to-end workflow management tool used internally and externally for the video production, management and hosting process (the latter is where we're looking to hire).<p>The entire engineering team is less than 20 people, including operations, professional services and management.  There are currently 9 developers (if I'm counting correctly) and all of the work the engineering department does is recognized throughout the company.<p>Feel free to send your resume/github/project urls to mbrace@invodo.com or ismarc31@gmail.com.","time":1346526895,"type":"comment"}