{"by":"calbear81","id":4464359,"parent":4463689,"text":"Mountain View, CA - Room 77 Hotel Search - Software Engineers (Full Stack), Mobile Developers (Android, iOS), Lead Designer, Marketing/Data Analyst, SEM/Email Analyst - H1B welcome<p>What we do and who we are looking for:<p>It's simple - we want to build the world's best hotel search engine.  Best place to search (fastest, most relevant, most results), best place to research (data insight, recommendations), and the best place to shop (metasearch engine, finds lower prices from more sources worldwide).<p>Travel is a big market and there hasn't been much innovation in the last ten years.  We were founded on the belief that consumers deserve to get transparency and a fair deal and we believe that tackling hotel search is a great way to help travelers make more informed decisions and save some moolah.  It's not the sexiest space to be in but the travel space is the 2nd largest commerce category and we think we can own a piece of the pie through a better product.<p>Our engineering team is 15+ and growing and we're hungry for more talent because we've got big problems to solve. We look for people who work comfortably across the entire stack.  We run on Ubuntu, AWS and no specific language knowledge is necessary though we use a lot of C++, PHP, and Javascript.  We don't believe in micromanagement so you'll need to be someone who is self-motivated, not scared off by things you've never done, and willing to make mistakes and know when to ask for a helping hand.  Most of our engineering comes from Google, Facebook, Yandex and other top tier companies as well as top tier schools.<p>On the marketing side, we need some firepower to get the word out there and build smart ways to analyze and optimize the paid traffic we're getting.  If you think it would be fun to compete in SEM against larger, more well-funded companies and you don't find it at all scary, we want to talk to you.  If you've done large scale email program build outs (things like automated price alerts, segmentation), we want to talk to you.<p>What's it like working at Room 77?<p>We're located a stone throws away from Red Rock Coffee in the heart of Downtown Mountain View.  We're a diverse bunch and we like to do a lot of team events.  Lunches are catered and we have a keg on tap, standard valley benefits apply including equity and competitive compensation.  You also get a travel stipend and a travel agent card to get massive savings when you take some R&#38;R.<p>Who believes in us?<p>We've raised $13 million to date from VCs like General Catalyst, PAR, and Sutter Hill and companies like Concur (TripIt).  We're lucky to have both angels and advisers that have started companies like Expedia, MTV, HotelTonight, Nor1, and Zillow.  We're well connected to the industry so you don't have to worry about us having to bang on doors to get to the right folks, all we need to focus on is building a killer product that makes people fall in love with us.<p>If you think this sounds interesting or you just want us to buy you a coffee when you're in Mountain View, reach out to us.  Engineering positions, check out <a href=\"https://www.room77.com/jobs/software_engineer.html?s=hackernews\" rel=\"nofollow\">https://www.room77.com/jobs/software_engineer.html?s=hackern...</a> . Marketing/Analyst positions, send resumes/portfolios to jobs@room77.com or reach out to me directly: roger@room77.com.","time":1346519846,"type":"comment"}