{"by":"myenergy","id":4464058,"parent":4463689,"text":"MyEnergy - Boston, MA - FULL TIME: Rails Engineers, Frontend Devs, Designers, and Account Managers (and more!) - <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a><p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers (and others!) to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, has been named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet.<p>We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Frontend Devs to craft and implement amazing and dynamic experiences in our user-facing platform =&#62; <a href=\"https://www.myenergy.com/careers/frontend_developer\" rel=\"nofollow\">https://www.myenergy.com/careers/frontend_developer</a><p>* and Account Managers to support all the fine folks and entities using MyEnergy all across the country =&#62; <a href=\"https://www.myenergy.com/careers/account_manager\" rel=\"nofollow\">https://www.myenergy.com/careers/account_manager</a><p>We're also interested in hearing from driven individuals who think they may have what it takes as a sort of \"comms hacker\", building from scratch, strategizing, and single-handedly executing a new interdisciplinary public communications operation for MyEnergy. You'll need to be based in Boston, and full of good ideas and the energy to advance them =&#62; <a href=\"https://www.myenergy.com/careers/create_position\" rel=\"nofollow\">https://www.myenergy.com/careers/create_position</a><p>We're HQ'ed in a conveniently located, sunny two-story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1346514806,"type":"comment"}