{"by":"rdamico","id":4464988,"parent":4463689,"text":"San Francisco, full time.<p>If you've ever viewed a PDF or Office document on sites like Dropbox, Yammer, or LinkedIn, you've seen Crocodoc (YC W2010) in action. We convert documents to HTML5 so they can be embedded into any web or mobile app. But that's just the beginning.<p>We've developed the world's most advanced web-based document viewing and collaboration technology for Microsoft Office and PDF files, built on open standards such as HTML5 and CSS3. We're processing millions of documents each month, are backed by top-tier investors, and are profitable and growing quickly.<p>If you want to help push the limits of what's possible with HMTL5 and CSS3, 10x a fast-growing business, and build new products that change the way people collaborate and get work done, email co-founder Peter Lai (peter at crocodoc dot com) to apply.<p>Open positions:<p>* Senior Developer<p>* Business Development<p>* Director of Growth<p>* Inside Sales<p>For more information, see <a href=\"http://crocodoc.com/jobs\" rel=\"nofollow\">http://crocodoc.com/jobs</a> and <a href=\"http://crocodoc.com/about\" rel=\"nofollow\">http://crocodoc.com/about</a>.<p>---<p>About Crocodoc:<p>* Growing Fast<p>Crocodoc converts millions of documents to HTML5 each month for top web companies like Dropbox, LinkedIn, and Yammer. The company is profitable and growing fast.<p>* Talented Team<p>Crocodoc was founded by four MIT engineers who have been working together for four years. As we evolve Crocodoc, we’re pushing browsers and mobile devices to the limit and are solving incredibly difficult challenges along the way.<p>* Great Culture<p>At Crocodoc, we work hard and are passionate about what we do...in and out of the office. Our tight-knit team enjoys working from exotic locations, hanging out with each other at the office, and playing heated games of Settlers of Catan.<p>* Awesome Benefits<p>Your happiness and health is our priority. We offer competitive salaries, stock options, health insurance, an unlimited hardware budget, commuter benefits, and relocation assistance.<p>---<p>Recent press:<p>* HTML5 Start-Up Crocodoc Signs Up Dropbox, LinkedIn and SAP as Paying Customers\n<a href=\"http://allthingsd.com/20120501/html5-start-up-crocodoc-signs-up-dropbox-linkedin-and-sap-as-paying-customers/\" rel=\"nofollow\">http://allthingsd.com/20120501/html5-start-up-crocodoc-signs...</a><p>* Crocodoc’s HTML Document Viewer Infiltrates the Enterprise\n<a href=\"http://www.xconomy.com/san-francisco/2012/07/12/crocodocs-html-document-viewer-infiltrates-the-enterprise/\" rel=\"nofollow\">http://www.xconomy.com/san-francisco/2012/07/12/crocodocs-ht...</a><p>* Crocodoc Debuts HTML5 Document Embedding Technology; Partners With Dropbox, Yammer, SAP\n<a href=\"http://techcrunch.com/2012/05/01/crocodoc-debuts-html5-document-embedding-technology-partners-with-dropbox-yammer-sap/\" rel=\"nofollow\">http://techcrunch.com/2012/05/01/crocodoc-debuts-html5-docum...</a>","time":1346530856,"type":"comment"}