{"by":"danwalmsley","id":4465373,"kids":[4465688],"parent":4463689,"text":"NationBuilder.com<p>Downtown Los Angeles, Full Time, software developers and designers.<p>NationBuilder is a Community Organising System.<p>All the great positive changes in society have been driven by the millenia-old art of Community Organising. Moses, Martin Luther King Jr and Ghandi were Community Organisers.<p>The Internet provides the sheer reach to grow new movements faster than before, but the tools have been difficult to integrate and use, or they have been directed towards throwing animated cows rather than bringing people together to solve problems.<p>NationBuilder seeks to bring the power of community organising to the web for the lowest possible price so that grass-roots leaders can assemble followers in real-time, at scale, to create positive social change at a pace and scale that has never been seen before. Fundamentally, it brings together your web site, social integration, communications, and CRM in one place.<p>We are already changing US politics, but that is just the beginning. We seek to empower everyone in the world who wants to be a leader to build their community, whether they're a film-maker, a blogger, a grandma, a political dissident, a small business owner, or all of the above.<p>To do this, we have assembled a world-class team of Ruby on Rails hackers. Everyone is a full-stack developer and committed to the highest possible standards of excellence. Unlike everyone else in this space, we are fundamentally a tech company - not a consultancy, a think-tank, or the tech wing of a political party.<p>We practice continuous deployment. Committed code can be pushed to production in less than 5 minutes - and that INCLUDES running the full test suite on our CI platform.<p>We practice promiscuous pairing. You will be working directly with great people who know the product inside and out.<p>You will be using the latest Retina Macbook Pro or Macbook Air, working in one of the coolest spaces in Downtown LA with access to the best restaurants, arts, culture and weather in the US. The cost of living is low and the lifestyle is great. There is an epic 2-level restaurant/bar on our roof.<p>We have a real product with thousands of customers, yet our tech team is just 11 people. Anyone who joins today will have a massive influence on the product and market.<p>Our recent Series A was led by Andreessen Horowitz and Sean Parker, and angel investors include Chris Hughes. Sean Parker and Ben Horowitz are on our board, and our co-founders Jim Gilliam and Jesse Haff built Brave New Films and took on the Iraq War and Walmart while creating an entirely new model of film financing and distribution.<p>If all this sounds interesting, get in touch. Check out <a href=\"http://nationbuilder.com/jobs\" rel=\"nofollow\">http://nationbuilder.com/jobs</a> and then email jobs@nationbuilder.com.<p>Thanks,<p>Dan Walmsley<p>VP of Engineering, NationBuilder.com","time":1346538990,"type":"comment"}