{"by":"mirz","dead":true,"id":4477392,"parent":4463689,"text":"Los Angeles: Porn Star Developer<p>We are an angel funded startup looking for hard working porn star to join our production.<p>You should have tremenous coding stamina which results in voluminous output. You should be able to go all night for hours on end and not get bored.<p>You will get very little direction, so it is expected that you know what you're doing - like it's instinctual for you.<p>We are a small team so you should be prepared to wear a variety of hats such as server repair man, pool cleaner and pizza delivery guy.<p>You should be good with people. We often begin the day programming by ourselves, but sometimes end up pair programming (or even small groups!) by the end of the day.<p>We are proponents of testing. If your code fails a test you will be prohibited from doing any new programming (especially with others) until the bug is cleared up.<p>We are a company of finishers. If we start a project we keep at it until it's done!<p>We expect a ton of users when we release. This thing is going to explode - we'll be all over HackerNews!<p><i></i><i></i><i></i><i></i><i></i><p>Real talk:<p>Swagsy is a socially driven marketplace where celebrities share the products they love. <a href=\"http://investors.swagsy.com\" rel=\"nofollow\">http://investors.swagsy.com</a><p>This isn't another \"I have an idea can you build it for me\" Craigslist ad. Our product is built and in private beta. We are launching with some of the biggest celebrities in the world. And we have a pipeline of brands that are ready to ship.<p>We have A-list advisors, have raised Angel and will close Series A soon.<p>We are looking for a talented Senior Magento Developer for Swagsy.<p>The ideal candidate: \n- loves Magento like it was their first born \n- is brilliant, fearless, and passionate<p>Expect talented, motivated, intense, and interesting teammates.<p>Email mlulic at swagsy. Interns and H1Bs and TNs welcome.","time":1346807792,"type":"comment"}