{"by":"mmaunder","id":11816319,"parent":11814828,"text":"Wordfence | REMOTE | Senior node.js dev with security focus | Seattle, WA<p>Wordfence | REMOTE | Security Analyst :­ Forensics and Remediation | Seattle, WA<p>Do you want to work in information security from anywhere on the planet?<p>Wordfence is a fast growing information security company. You will be working for us remotely. Full-time positions have great benefits including medical, dental, 21 days PTO and 401K.<p>We are a small team (about 20 people) of full-time employees and a handful of contractors. We&#x27;re fast moving, nimble, self-managing and work in a relaxed atmosphere. Rather than working for a mega-corp, you will be working in a company where your work has real impact in the fun high-growth stages of our evolution.<p>We use apps like Slack, github, teamspeak and Fogbugz for our workflow. Each team member is World-class at what they do. We have flexible working hours and we are a diverse team ranging in age and location from Washington to Maine to Florida and international locations like Sweden and Greece.<p>All positions involve a trial contract of approximately 2 weeks with a minimum commitment of 10 hours per week. You will be paid for this time and it will be used to evaluate whether both parties want to pursue working together.<p>If you want to work in cyber security this may be your dream job. Awesome team, fast growing company, work from anywhere in one of the most exciting fields in tech right now.<p>You can apply for either of the positions listed above by visiting us at the link below. Note that our application process is a bit different from other companies. If you&#x27;re applying as an analyst, we will be creating a virtual &#x27;hacked&#x27; machine for you to perform a forensic analysis test on. If you&#x27;re applying as a node.js dev, you will be required to submit source code as part of the application process. We&#x27;d love to hear from you!<p><a href=\"https:&#x2F;&#x2F;www.wordfence.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.wordfence.com&#x2F;careers&#x2F;</a>","time":1464802005,"type":"comment"}