{"by":"truongor17","id":11815268,"kids":[11818371],"parent":11814828,"text":"Keen IO (<a href=\"https:&#x2F;&#x2F;keen.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;keen.io&#x2F;</a>) | San Francisco Bay Area + Remote USA | Full Time<p>----- About Keen IO -----<p>Keen IO is an API platform that lets developers collect and study custom events at a massive scale.<p>Our Mission = Turn Explorers into Discoverers.<p>We value: introspection, continuous learning, personal agency, honesty, and empathy. It&#x27;s a work in progress!<p>----- Platform Generalist Engineers -----<p>(SF Bay Area or Remote US only) Keen IO is seeking engineers to join our team. We build and nurture an Analytics API that processes user data and queries around the clock, across diverse industries. Whether it’s gaming, e-commerce, advertising, publishing, or IoT, our platform aims to make Analytics so easy for developers that they can focus entirely on their product. Our challenge is to scale with a constantly growing data deluge and evolve along with our user’s needs. Skills: Cassandra, Java, Scala, Tornado, Zookeeper, Storm, Kafka<p>----- UX Engineer -----<p>(SF Bay Area) Keen IO is seeking a UX Engineer to join our team. Our team is focused on shaping the interactive environment where anyone can put our APIs to work and get value out of our platform. We do this through apps and interfaces like our Explorer, Dashboards, and Dataviz SDK. Our customers&#x27; expectations for both technical capability and quality have never been higher than they are right now.<p>Languages: JavaScript (ES6), CSS3 and HTML5; experience with Python is a plus<p>----- Consultative Sales Representative &amp; Sales Development Opportunities -----\n(SF Bay Area Only) Be one of the first Sales Representative and SDRs for a fast-growing, Sequoia-backed, cloud analytics platform. Our Cross-Vertical Practice is a small, cross-functional team (marketing, sales, sales engineering, data science) tasked with growing our business across all verticals.<p>For questions, please contact us at humans@keen.io or visit us our career page (<a href=\"https:&#x2F;&#x2F;keen.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;keen.io&#x2F;careers&#x2F;</a>).","time":1464795611,"type":"comment"}