{"by":"davepeck","id":11816156,"kids":[11817654,11821260],"parent":11814828,"text":"GetCloak.com | Software Engineer | Hourly Contract | Remote (we&#x27;re in Seattle)<p>Cloak is a VPN network, and a set of apps (currently for iOS and OS X) designed to connect to this service.<p>We are looking for a senior Android contractor to help us get our native Android app off the ground, and to get us in great position to grow our Android presence for many years to come.<p>Right now there are just two of us developing the service. We differentiate Cloak by (1) providing a beautiful minimal UI and features like auto-secure that allow the VPN to fade into the background, (2) actually caring about the secure construction of our apps, our APIs, and our VPN network, and (3) going the extra mile, and then another, for our customers.<p>Our ideal candidate has:<p>1. Deep experience architecting complex new Android applications, and an innate understanding of the pieces that need to be put together to provide an experience that matches our current iOS and OS X apps.<p>2. A keen sense of how they might build and interact with OpenVPN under the app&#x27;s hood, how they can implement auto-secure reliably, how they can gracefully handle captive portal networks, etc.<p>3. A curiosity about VPN networking, and an attention to detail to ensure that every security-critical decision the app needs to make -- from credential storage to networking configuration -- is made well.<p>4. Experience with modern Android development tools and practices: for example, our ideal candidate is running Studio 2.1 right now (and might be playing with 2.2 canaries), is perhaps wary of using Fragments, already planned to start this app with appcompat, has played with or even used dagger2, retrofit and rxjava, butterknife, etc.<p>5. Ideally, a love of graceful UI designs, and a willingness to make pixel-detail changes or tweak animation curves when it just doesn&#x27;t feel right.<p>This is a meaty project and we think it will be a fun challenge for the right candidate. We expect it will take real time to put together; our guesstimate is 4 full-time months, +&#x2F;-1.5, but we&#x27;ll work with you to refine this.<p>We also expect we&#x27;ll be working with you along the way to guide development and fill in blanks should it become necessary.<p>Interested? Please get in touch with me! dave[at]getcloak[dot]com","time":1464801070,"type":"comment"}