{"by":"pbnjay","id":11815700,"parent":11814828,"text":"Stridatum LLC | Lead Developer | Charlotte, NC or REMOTE | FT<p>Stridatum is a small development agency based just outside of Charlotte in Concord, NC. We like to geek out on cool data and beautiful code. You are responsible for designing, implementing, and maintaining projects that our agency builds for customers. Your primary responsibility will be an Internet-of-Things (IoT) platform for wireless lighting controls. This spans the gamut on HTML&#x2F;JS, JSON APIs, databases, backend RPC, data aggregation, and interactions with mobile applications (just to name a few).<p><i>Requirements</i><p>- 2+ years of web application&#x2F;API development experience. (HTML, JS, JSON)<p>- BS in Computer Science or equivalent work experience. (4+ years development experience)<p>- No Visas - You must be able to work in the US.<p><i>Preferred Experience</i><p>- 2+ years Go programming (highly preferred)<p>- PostgreSQL databases<p>- RPC&#x2F;Microservices<p>- iOS&#x2F;Android dev (Obj-C, Swift, Java)<p>Backend written in Golang, but if you are experienced we can help you make the jump.<p><i>Benefits</i><p>- Pay based on experience, starting at 60k for minimum candidate, but plenty of upward room for the right person.<p>- Work from home (Although we will have meetings in person occasionally).<p>- Equipment, Retirement plan and benefits available.<p>- Relocation assistance to Charlotte available.<p>To apply, send an email to jobs at stridatum dot com. Let us know if you are willing to relocate to the Charlotte area (big plus) or want to be remote. Include a link to your github, bitbucket, gitlab, or other online code profile. Call out the specific code you&#x27;re most proud of. We&#x27;ll send over a quick &quot;code interview&quot; project similar to a homework assignment, if you complete it within the time allotted (&lt;1 week), we&#x27;ll pay a small amount for your time. If we continue the process, there will be a 2nd phase of development on the same project, again paid if completed on time. If we continue, we&#x27;ll chat on the phone and see whats next&#x2F;make an offer.","time":1464798138,"type":"comment"}