{"by":"netbret","id":11817949,"parent":11814828,"text":"Fitbit | San Francisco, CA | Full-time | Onsite<p>We started our journey in 2007—as a team of two with one big idea. Today, that idea has become a movement. Fitbit is now a publicly-traded company creating award-winning products and services that are available across the globe. We’re transforming the way the world sees health &amp; fitness. In fact, the Fitbit Community has taken enough steps to walk from the Sun to Pluto. Our culture combines the spirit of startup with the perks of being public—offering a competitive benefits package and amazing perks like free lunches, Friday happy hours, on-site fitness classes and more. As part of our team, you’ll have the opportunity to grow your career, contribute your ideas to life-changing products and services, and—above all—have fun doing it.<p>What You&#x27;ll Do:<p>• Create engaging yet computationally efficient interactive data visualizations that are optimized for mobile devices with touch screens. This is an area of user interfaces for which there is no established solution; we aim to set the standard.<p>• Overcome the hurdles of distributed systems to build native mobile clients that are tolerant of transient connectivity. We aim for our mobile clients and sensor devices to function together as normally as possible even when there is no connection to the internet.<p>• Exploiting low power communication technologies to make the internet of things a reality. We have been on leading edge of consumer deployment for both wearable sensors and Bluetooth Low Energy.<p>• Crafting beautiful mobile user experiences that allow users to intuitively accomplish any task. Our mobile clients are a vital part of the user interface to the Fitbit platform.<p>Roles:<p>Software Engineer - <a href=\"https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#jobs&#x2F;op0O2fwZ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#jobs&#x2F;op0O2fwZ</a><p>iOS Engineer - <a href=\"https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#jobs&#x2F;o40O2fwE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#jobs&#x2F;o40O2fwE</a><p>Android Engineer - <a href=\"https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#jobs&#x2F;oS1O2fwt\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#jobs&#x2F;oS1O2fwt</a><p>Think you’ve found your fit?","time":1464813493,"type":"comment"}