{"by":"samsunghires","id":11818950,"parent":11814828,"text":"Samsung Research America | Mountain View, CA | ONSITE | Full Time<p>Samsung KNOX™ is a comprehensive, secure mobile solution for both work life and personal life.  It addresses the mobile security needs of enterprise IT without invading an employee’s personal privacy.  Samsung KNOX enables employees to use their favorite personal mobile devices at work as well as enabling enterprises to allow personal use of company devices.  KNOX adapts to the model that fits your life.<p>Samsung Pay is a new era of mobile payment and e-commerce. Samsung Pay allows consumers to transition to secure mobile payments at nearly all merchant locations. To date, mobile wallets have had extremely low acceptance with merchants utilizing conventional magstripe terminals. With Samsung Pay, consumers can now utilize their mobile devices to pay at existing point-of-sale terminals.<p>Come join the Samsung KNOX and Samsung Pay teams and help us define and develop the future role of security and productivity for mobile devices and services!<p>We are hiring for multiple roles within KNOX and Pay:<p>* Security Research Engineers for the KNOX Security Team: <a href=\"https:&#x2F;&#x2F;samsungresearchamerica.applytojob.com&#x2F;apply&#x2F;JlR5zr&#x2F;Security-Research-Engineer-Security\" rel=\"nofollow\">https:&#x2F;&#x2F;samsungresearchamerica.applytojob.com&#x2F;apply&#x2F;JlR5zr&#x2F;S...</a><p>* System Security Engineers: <a href=\"https:&#x2F;&#x2F;samsungresearchamerica.applytojob.com&#x2F;apply&#x2F;Sqq0O3&#x2F;System-Software-Engineer-Rkp\" rel=\"nofollow\">https:&#x2F;&#x2F;samsungresearchamerica.applytojob.com&#x2F;apply&#x2F;Sqq0O3&#x2F;S...</a><p>* Software Engineers across the Android device stack, Web&#x2F;Cloud Engineers, Product&#x2F;Program Managers, QA Engineers: <a href=\"https:&#x2F;&#x2F;samsungresearchamerica.applytojob.com&#x2F;apply&#x2F;UOlBRT&#x2F;Software-Engineer-Knox-And-Pay\" rel=\"nofollow\">https:&#x2F;&#x2F;samsungresearchamerica.applytojob.com&#x2F;apply&#x2F;UOlBRT&#x2F;S...</a>","time":1464821698,"type":"comment"}