{"by":"Nelkins","id":11815215,"parent":11814828,"text":"Jet.com | <a href=\"https:&#x2F;&#x2F;jet.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jet.com&#x2F;</a> | Hoboken (very close to NYC) | Dublin | Kansas City | Full-time | Onsite<p>90k - 215k, plus equity<p>^^ That figure is derived from our comp table, which is freely available among employees, and from the positions we&#x27;re hiring for on the careers page (that is to say, there are positions that pay more than that but I don&#x27;t see any postings for them on the careers page)<p>----------<p>(From our careers page)<p>We need super smart engineers from all levels to help us build one of the best engineered e-commerce platform in the world (big talk we know, but that is our goal!). Our engineers combine creativity, curiosity, and drive to continuously perfect and revolutionize Jet from the inside out. We are looking to bring more intellectually curious engineers who are passionate about technology in general (Jet is a technology first company and prides itself on its culture of learning and knowledge sharing and we want all our engineers to be as passionate as we are!)<p>Our platform is largely an event driven platform implemented via a microservice architecture. The platform runs on Microsoft Azure and uses a large number of technologies and middle ware. The bulk of backend code is written in a functional style (F#) and our system of record is an event sourced system (essentially a log of all actions on the platform). We use a mix of Kafka, Redis, Elastic Search, Azure SQL, Event Store and Azure Storage for our data stores. About 50% of the platform runs on Linux and the rest Windows (although we move into more containerization we will see a shift towards Linux).<p>----------<p>I&#x27;ve been working at Jet since mid-February, and I can honestly say this is the best job I&#x27;ve ever had.  It personally checks off every single box I could have a for a dream job:<p>- Insanely fast-growing startup.  We&#x27;re the fastest startup to reach a billion dollar valuation, for whatever that&#x27;s worth.<p>- Functional programming in F#.  Never been more productive coding.<p>- Tech talks and workshops all the time.  I&#x27;m learning more than I ever have.<p>- Transparent compensation structure.  You can&#x27;t see everyone&#x27;s salary per se, but we have a comp table where you can look up what the salary is for a given position.<p>- Extremely competent management.  It feels like they really care about employees&#x27; happiness here, we&#x27;ve got experienced people at the helm, and it is amazing to see what a company can look like when you have a fantastic management team bringing their A-game.  Really, it&#x27;s incredible to have to try hard to find something to complain about.<p>- All the trappings of modern startup life.  Free gym membership, lots of free food, etc.<p>We&#x27;re hiring people of all different types of experience for all different types of roles.  More information about specific roles can be found here: <a href=\"https:&#x2F;&#x2F;jet.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jet.com&#x2F;careers&#x2F;</a>.  You can apply on the individual role pages.<p>If you have any questions (commuting from NYC, about Hoboken, what&#x27;s going on in the company, anything really), feel free to ask here or send a message to &quot;nat&quot; at the domain that I work on.","time":1464795379,"type":"comment"}