{"by":"metatype","id":11817816,"parent":11814828,"text":"Pivotal | Software Engineer, Distributed Systems | Portland, OR | onsite<p>Pivotal is looking for a few great engineers to join our GemFire&#x2F;Apache Geode engineering team. Apache Geode (currently in incubation) is a distributed, in-memory, and transactional datastore designed to provide very high throughput with predictable latency. GemFire is built on Apache Geode and is deployed throughout the world by demanding customers serving mission-critical applications in financial, telecommunications, retail, and transportation industries.<p>You have a passion for large distributed systems to manage data on a massive scale. You love building highly concurrent systems that are also fault tolerant and extremely reliable. You follow current trends in topics such as stream processing and in-memory computing. You’d really like to believe there’s a way to defy the CAP theorem and get consistency, availability, and partition tolerance all in the same system (even if no one else has managed to do that yet). Above all, you love shipping software as a member of a collaborative team.<p>At Pivotal, our mission is to enable customers to build a new class of applications, leveraging big and fast data, and do all of this with the power of cloud-independence. Pivotal’s offering includes the Big Data Suite, the most complete approach to enterprise data lakes and advanced analytics; Pivotal Cloud Foundry, the industry leading Platform as a Service product; and world leading ultra-agile application development through Pivotal Labs. Open source is an important part of our strategy. Many of our products are already open source; those that are not will be soon.<p>The GemFire&#x2F;Apache Geode engineering team at Pivotal tackles challenges that come with massively parallel distributed systems operating at extreme scale to achieve incredibly low latency transactions. We delve into areas like stream processing, query optimization, parallel function execution, scalable distributed data structures, fault-tolerance paradigms, and peer-to-peer messaging. Here at Pivotal you&#x27;ll be working on hard problems with a collaborative team, accelerating your growth as an engineer.<p>Apply at <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?k=Job&amp;su=f8XaVfwU&amp;c=qm69Vfwg&amp;j=oLn61fwZ\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;CompanyJobs&#x2F;Careers.aspx?k=Job&amp;su=f8...</a> or email abaker[_a_t_]pivotal[_d_o_t_]io.","time":1464812583,"type":"comment"}