{"by":"0xa","id":11815340,"parent":11814828,"text":"Kensho: Boston, MA (Cambridge) FULL TIME, ONSITE<p>We are making financial analysis faster, accessible, intuitive and beautiful through our partnerships with Goldman Sachs and CNBC. We&#x27;re small, hungry, and have hoppity-hops in the office. To get our attention, share a project with us that shows:<p>Software Engineers:<p>UI, infrastructure or SRE specialists.  Inside tip: High velocity problem-solving and coding are essential.<p>Machine Learning Engineers:<p>Advanced machine learning, NLP or modeling techniques at scale. Notable research and data science experience expected. Inside tip: Demonstrate multiple years of data science research, ability to explain nuances of sophisticated models and excellent ability to optimize.<p>UI Designers:<p>Your portfolio of data visualizations, workflows or UI designs. Inside tip: Make data beautiful, intuitive and informative.<p>Hiring process:<p>We&#x27;re a small team who will interview very few candidates. We start with looking at the source for projects mentioned in your resume and&#x2F;or cover letter. Then, depending on you, the role, and the projects you shared, we&#x27;ll talk to you via phone&#x2F;hang out&#x2F;in person (if local). We&#x27;ll likely do some live coding or design presentation, ideally on your computer, extending something you have created. We also have take-home challenges if you don&#x27;t have deep enough projects to share, or maybe interviews aren&#x27;t your thing. Lastly we bring you to Cambridge to interview us in person and go more in depth. Again, please bring along something you are passionate about and that you&#x27;d like to extend and discuss.<p>Our Stack:<p><pre><code>  * python, pandas, numpy, scipy, scikit-learn, nltk, et al.\n\n  * Javascript, React, d3, canvas\n\n</code></pre>\nPlease say hello at <a href=\"https:&#x2F;&#x2F;www.kensho.com&#x2F;#&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.kensho.com&#x2F;#&#x2F;careers</a>","time":1464796014,"type":"comment"}