{"by":"hwatson","id":11821886,"parent":11814828,"text":"Judo Payments | Angel, London, United Kingdom | Full-time<p>Judo makes buying the things we want faster, simpler and more secure. As Europe’s leading secure in app and mobile first payments platform, we’re riding an unstoppable wave as smartphones change the way we engage in commerce.<p>We sit at the intersection of mobile, SaaS and payments, three of the fastest growing and most interesting sectors of the global economy. Our customers - big brands and innovative Startups - win awards because of our outstanding people.<p>Founded by serial financial technology entrepreneurs in 2012, Judo is backed by leading VC and hedge fund investors.<p>We&#x27;re looking for:\n- DevOps\nHelp design, build and maintain our IT infrastructure to meet our growing needs. Monitor and maintain our production platform keeping all components in top working order. Automate all the things; help us scale quickly by automating all the daily chores leaving you to focus on infrastructure improvements. Strong Microsoft Active Directory knowledge, including associated functions such as Group Policy, DNS etc. Experience of Microsoft Windows Server 2008 &#x2F; 2012 &amp; Linux. High level of automation using Octopus&#x2F;ssh&#x2F;powershell&#x2F;bash. Experience of Docker. Experience of PCI.<p>- Postgres DBA Developer\nExperience of working on very high transactional load in always on mode. Experience with highly volatile load profiles. At least 2-4 years of administering large PostgreSQL databases. Experience in performance tuning &#x2F; index maintenance, able to meet and assist the needs of the Development teams using PostgreSQL as its backend database. Designing and Managing PostgreSQL database schemas. Experience in Security access control. Experience with version control. Experience with 24x7 zero downtime database management. Experience with Java and high-available web applications. Knowledge of fault detection and resolution processes. Ability to communicate effectively to different levels of technical and non-technical audiences. Implement Database Change Controls. Experience supporting BI internally and for customers. Experience of, or willing to learn alternative database technologies (NoSQL) such as Mongo, Redis, Cassandra.<p>Our stack is based on C#&#x2F;ASP.NET MVC, jQuery&#x2F;Angular, RabbitMQ, and MS SQL Server&#x2F;PostgreSQL.<p>If you&#x27;re interested, please email lindy.roberts@judopayments.com for more details.","time":1464870117,"type":"comment"}