{"by":"codeinthehole","id":11872061,"parent":11814828,"text":"Octopus Energy | Hammersmith, London, UK | On-site | Full-time<p>We are a new, tech-focussed energy supplier for the UK market, and we&#x27;re looking for programmers (especially with Python experience) to join us.<p>We&#x27;re building a modern, event-driven infrastructure for interacting with both consumers (via the web, mobile apps and smart-meters) and the industry (eg data flows, consumption forecasting, trading on the wholesale market).<p>On the server-side, we mainly use Python. Our public site is powered by Django and the Django-REST-framework amongst other things - we also use Pandas, Numpy and Jupyter for analysis and forecasting.<p>We use AWS heavily, employing most of the Hashicorp toolset (Vagrant, Packer, Consul, Terraform). See, for example, <a href=\"http:&#x2F;&#x2F;tech.octopus.energy&#x2F;2016&#x2F;05&#x2F;05&#x2F;django-elb-health-checks.html\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.octopus.energy&#x2F;2016&#x2F;05&#x2F;05&#x2F;django-elb-health-chec...</a><p>On the client-side, we use React and SASS. For our mobile apps, we use React Native.<p>This is a great opportunity for several reasons:<p>* We have lots of difficult design challenges to solve. The UK energy market is complicated and process-heavy - there&#x27;s an awful lot of domain modelling that we need to get right.<p>* We have difficult technical problems to solve. With the advent of smart meters, we&#x27;ll soon be processing millions of meter readings a day. We need the right technology in place to handle this smoothly as well as feeding data into a machine learning pipeline that models and predicts consumption.<p>* There&#x27;s a great opportunity for disruption in the UK energy market. The big suppliers still dominate, but are not exactly popular. The energy landscape is changing as we move to more disaggregated forms of generation, with less predictability, more dynamism and smarter technology.<p>* You&#x27;ll be working for a company that is genuinely helping to make the world a better place. We&#x27;ll be helping move people onto using greener technology and consuming energy from renewable sources. This will all help transition the UK towards a lower carbon future.<p>We just launched the UK’s cheapest 100% green tariff:\n<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;octopus_energy&#x2F;status&#x2F;740819168749031424\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;octopus_energy&#x2F;status&#x2F;740819168749031424</a><p>Our offices are in Hammersmith. We&#x27;re open to some remote working but not 100% remote at this early stage of the company.<p>Apply via talent@octopus.energy<p><a href=\"https:&#x2F;&#x2F;octopus.energy\" rel=\"nofollow\">https:&#x2F;&#x2F;octopus.energy</a><p><a href=\"https:&#x2F;&#x2F;tech.octopus.energy\" rel=\"nofollow\">https:&#x2F;&#x2F;tech.octopus.energy</a>","time":1465503618,"type":"comment"}