{"by":"chrishar","id":11902792,"parent":11814828,"text":"Red Ivy Capital  |  Founding Full Stack Engineer  |  Stamford, CT or US REMOTE<p>Red Ivy is a quantitative trading firm (CTA) focused on fully automated trading strategies to deliver uniquely uncorrelated returns for our clients. We’re a high energy, distributed team with passion for the intellectual challenge that the financial markets provide. The firm currently has 5 employees (including 3 devs), and is running trading strategies in Europe, the US and Japan with approx. $40M under management.  That said, we’re still bootstrapping and in self-funded startup mode. All employees have substantial equity and you would be the same. This opportunity is not for everyone, but we’re on the verge of breakout and the rewards may be VERY substantial.<p>We give strong preference to those with financial market experience (or strong passion) over engineers with no experience or interest in the financial markets. If you want a front-row seat to how professional money management and automated futures trading happens in 2016, this is it.<p>We’re looking for a well rounded full stack engineer that’s comfortable in the database, PHP code, or can bust out some basic web UI as required. Our stack is: Linux &#x2F; Apache &#x2F; MySQL &#x2F; PHP &#x2F; Bootstrap &#x2F; Angular, with a little .NET &#x2F; C# &#x2F; C++ &#x2F; Python (machine learning) thrown in for good measure.  Our primary need is on the Linux&#x2F;Apache stack, but broader experience is always a plus.<p>We need someone that takes ownership over what they’re working on, and can work independently to bring projects to closure. PS, like many posters here, we don&#x27;t really care where you went to school or what other companies you&#x27;ve worked for either. We care about passion and pride in your work.<p>Our process: Skype chat with selected candidates, one technical interview (discussion), 1-2 follow-on interviews with other founders.\nInterested?  Send me a resume&#x2F;Linked-In&#x2F;Git or anything else that introduces who you are and what you do:  chrishar -=at=- redivycap -=dot=- com","time":1465919319,"type":"comment"}