{"by":"rpuckett","id":2397765,"parent":2396027,"text":"Location: New Orleans\nLEAD DEVELOPER\nLiveset\n<a href=\"http://liveset.com\" rel=\"nofollow\">http://liveset.com</a><p>Liveset is a new digital platform presenting live concert events on the web and mobile devices in handsome HD, with supporting content that provides a more powerful connection between artists and their online fan bases. Liveset brings the concert experience to artists’ fans across the Internet as their show is happening and provides a platform for fans to watch an archived show at their convenience.<p>We’re going to make live shows as easy as Youtube. Our goal is to build a site for music fans that has an equally impressive set of features as MLB.tv. We also need to build out our own proprietary live-streaming platform – we’re currently using livestream.com, and we’d love to talk to you about why we want to replace it (no offense to livestream - they've been great partners).<p>Liveset is a functioning, funded platform that needs help getting to the next level.  The platform was launched on September 29, 2010, and has been very well received.  We’ve done all of the development work through a contract relationship with a talented design and development firm out of New York (@crushlovely), but we want someone as committed as we are to come on board.<p>That means we’re offering a real founder’s spot. We need a Lead Developer, and we’re willing to offer a 20% equity stake to the right person.  The post-money valuation on our last round was $2.5 million (we’ve raised $500,000).  That means we’re offering up to a half-million (on paper, of course) for joining. We know that successful projects are built on talented engineers, and we mean business about bringing you on board.<p>The site is built in Rails.  We need a partner who’s willing and eager to get in on the ground floor and help us build this into the platform we know it can be.<p>Why do you need co-founders if you’re such an awesome developer?  We’re experienced at what we do. One of your partners spent 7 years on the other side of the table at a media-focused private equity firm. Another one has already built a successful video production company and is building another product, with plenty of investor interest. We’ll raise money and keep your bills paid. We’ve already made dozens of connections (maybe you’ve heard of some of the bands on the current site, and you <i>HAVE</i> heard of some of the bands we can’t talk about yet). We’ve made more connections you can’t see: artists, booking agents, venues, managers, labels, sponsors, potential investors, consultants, entrepreneurs, streaming providers, CDN’s, development firms, designers, etc. We know you’ve heard ‘we need a technical co-founder’ like they’re replaceable, and we know better. We know the live streaming concert industry as well as anyone out there.  And we’ve done it all with just 2 people - we’re not an over-funded New York VC-backed startup trying to buy instead of build.<p>We mean it. Get in touch and let us show you what we have to offer. It’ll be fun and profitable, we promise!<p>Plus we’re in New Orleans – and if you were at RubyConf2010, you know how great a city this is. How about a bunch of free live music in one of the best music cities in the world? Awesome food? Great co-workers? We love this town, and we’ll be sure you know it’s impossible not to.<p>Actual-work wise, what we’re looking for:<p>_ Ruby on Rails\n_ Testing frameworks/methodologies (Rspec, Cucumber, etc.)\n_ Streaming media / video experience\n_ Rich Internet Applications (RIA), e.g. Flash, Silverlight\n_ Willingness to move to New Orleans, Louisiana<p>But really, aside from the moving, none of that is as important as what you bring to the table. We’re not looking to give away 20% of an angel-funded company so we can tell you what to do. We’ve also got enough money raised that we can pay you a lot more than ramen money (and you can live like a king in New Orleans for half of what you’d make in California or New York). You don’t need to forgo your IRA contributions for this gig.<p>We are firm about you coming to New Orleans. We’re looking for a true partner. Given our small size and the fact that this is our first in-house developer, we really need you on the ground here with us. We want you there with us on the crazy late nights before a show...  and at the over the top celebration dinners afterwards. We’re fully committed to this (some of that funding is our own money) and want someone who is able to fully commit as well.<p>To learn more about us, watch this video (<a href=\"http://lve.st/gXgqTk\" rel=\"nofollow\">http://lve.st/gXgqTk</a>).  If you’re interested in working with us, email ross.hinkle@liveset.com.","time":1301687944,"type":"comment"}