{"by":"dogas","id":3784147,"parent":3783657,"text":"Seattle/Philadelphia/Remote<p>Web Operations Engineer (DevOps) at PipelineDeals (<a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a>)<p>Work at a well-established small company that’s almost 6 years old, bootstrapped, profitable, and proud!  PipelineDeals LLC is looking for a full-time Operations Engineer to join our team. You will be in charge of managing all services running at PipelineDeals.com, from developer testbeds to the production infrastructure that tens of thousands of customers use. We need an individual to help build and maintain the supporting infrastructure, as well as ensure a top-notch experience for our customers.<p>Environment: We use leading-edge tech for our product -- Percona MySQL 5.5, Xtrabackup, Redis, Kiji-ruby, HAProxy, and Chef to manage it all.  We are very progressive about our technology use and are always striving to deliver the fastest and most reloable experience for our customers.  We believe strongly in metrics, testing, continuous integration, and working fluidly and harmoniously with our engineering and product teams. Everything we write is designed for simplicity and maintainability. We take security very, very seriously.  All our code runs in the cloud (AWS).<p>You should have:<p>- At least 2 years experience in a systems-related role, supporting and maintaining multiple mission-critical *NIX servers.<p>- Advanced experience in systems administration, packaging and installer technologies.<p>- Experience with Amazon EC2 and the AWS stack (we use fun stuff like S3, ELB, ElastiCache, EBS, IAM).<p>- Experience with Chef, Puppet or another configuration management system (we use Chef).<p>- Experience administering MySQL and InnoDB deployments.<p>- Firm grasp of TCP/IP networking.<p>- Strong written and verbal communication skills.<p>- Excellent organizational skills.<p>- Strong analytical and troubleshooting skills, under pressure.<p>- Have opinions on the right way to do things, and are comfortable sharing them, respectfully.<p>It would be great if you have any of the following:<p>- Experience developing and documenting plans, policies and procedures in support of IT security, disaster recovery, and business continuity planning.<p>- Experience deploying and running build and test automation tools (we use Buildbot, Cucumber and Jasmime).<p>- Knowledge of web application server configuration (Nginx and Unicorn).<p>- Familiar with source control systems such as Git.<p>If interested, please email Grant at grant@pipelinedeals.com.","time":1333298248,"type":"comment"}