{"by":"archonsystems","id":3788319,"parent":3783657,"text":"We're a fast-paced, creative, software startup team working on an exciting new web app (tell you more about that in person).<p>Unlike most startups that starts with nothing, we're proven and profitable. We have already developed a product, inFlow Inventory, for small businesses that's #1 in its class with 300,000+ installs in 60 countries. But the new product that we are making is even more exciting!<p>We're looking for world-class talents to join us, kick ass, and have fun here in beautiful Toronto, Canada.<p>Check us out at <a href=\"http://www.archonsystems.com\" rel=\"nofollow\">http://www.archonsystems.com</a>!<p>Some of our job benefits:<p>* top market salary: our target is better than 75% of comparable companies<p>* stock options<p>* work from home at least 2 days a week ; flexible office hours<p>* all-expenses-paid conferences<p>* 50% subsidized gym memberships and school courses<p>* top-notch computers ; beautiful office ; awesome people to work with<p>* make a difference: you'll be the first 10 members of a rapidly growing startup<p>A sample of our other members background:<p>* ex Googler @ Silicon Valley who previously graduated #1 in U Waterloo math faculty<p>* ex developer and designer for Mozilla (organization that made Firefox)<p>* ex lead developer of another web 2.0 company<p>* ex marketer who won international marketing competition twice, beating out Fortune 500 companies<p>* and other great people!<p>===============================================<p>WEB APPLICATION DEVELOPER @ Toronto (rails with backbone)<p>===============================================<p>As our Web Developer, you will be working on our new Secret Stealth Project. You will be responsible for programming in an entire feature from front-end to back-end. You will also focus on getting the usability and look &#38; feel <i>right</i> in order for our users to have the best experience possible.<p>You should have:<p>* Ability to complete an entire feature from HTML/CSS/JS to RoR to SQL<p>* Care deeply about UI (both usability and look &#38; feel)<p>* Serious skills with HTML / CSS / Javascript<p>* Hands-on experience with Ruby on Rails and SQL<p>* 1+ year of software development experience<p>* Bachelor degree or higher<p>Nice to have (but not necessary):<p>* HTML5, SCSS<p>* jQuery, jQUI, Backbone, CoffeeScript<p>* MySQL<p>* web/graphic design<p>Other stuff we'd be happy to hear about:<p>* Experience with business systems (accounting, inventory, CRM, etc.)<p>* Experience designing and building web applications (not just websites)<p>* Experience with social media (blogging, Twitter, hardcore Facebooking)<p>* Open-source or recreational coding projects<p>Email us your resume at jobs@archonsystems.com!","time":1333377619,"type":"comment"}