{"by":"johnrball","id":13542223,"parent":13541679,"text":"MM.LaFleur |Senior Software Engineer| Full Time (Onsite) NYC<p>MM.LaFleur is a fast-growing professional womenswear company based in New York City. We aim to be the go-to wardrobe solution for modern women of purpose. How? By delivering luxury-quality clothing via a seamless, direct-to-consumer stylist experience. We&#x27;re a varied group of go-getters who are all passionate about reimagining the way women shop and dress for work. We have a validated market and die-hard fans, a quickly growing revenue stream, and a whip-smart and energetic team. We take our work (but never ourselves) very seriously. We’re data obsessors who like nice clothes. We truly believe we can do it better and faster and smarter and have more fun.  They are one of the faster growing e-commerce companies!<p>What will you do?\nHerein lies your opportunity:\n* Build an integrated CRM, marketing, and sales system with a combination of custom and third-party tools. Take our proven customer data-centric sales model and make it more efficient and scalable.\n* Define product and choose technologies as we grow, starting with a “free the data” architecture overhaul.\n* Help hire a team of engineers, both in-house and contract.<p>What skills do you have?\n* Know PHP backwards, forwards, and upside down. MySQL, HTML, CSS, and Javascript, too. Magento? Great!\n* Be good at (or ready to learn) commerce platform management and development.\n* Love the entire stack, from devops to cross-browser styling to A&#x2F;B testing marketing campaigns to internal tooling.\n* Desire to set the foundation for an awesome engineering culture and help build the team.\n* Be excited about analytics and data-driven decisions.\n* Appreciate UX and the designers and engineers that make it possible.\n* Heart startups—you like flexibility and ownership; you move quickly and (sometimes) break things; you appreciate process, but don’t mind if it doesn’t exist sometimes.<p>Please feel free to reach out directly at john.ball@mmlafleur.com<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;mmlafleur&#x2F;jobs&#x2F;134873#.WJIPNrYrLUJ\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;mmlafleur&#x2F;jobs&#x2F;134873#.WJIPNrYr...</a>","time":1485967284,"type":"comment"}