{"by":"jerrytsai","id":13548039,"parent":13541679,"text":"Townsquared | San Francisco, CA | Full-time | ONSITE | <a href=\"https:&#x2F;&#x2F;townsquared.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;townsquared.com&#x2F;</a><p>Townsquared is the only online network that allows local businesses and independent professionals to connect privately. Members have access to all of the other businesses in their local neighborhood to ask and answer questions, post events, find partners, and ultimately build thriving businesses.<p>We are a Series B funded startup (Sierra Ventures, Intuit, August Capital, Floodgate, among others) in the heart of San Francisco with a diverse team of driven people working at the intersection of cutting­-edge design, complex technology, and social good. We offer the ability to help build a product that enables economic change and affects people in a real way.<p>We&#x27;re hiring for many roles including:\n• Data Engineer: <a href=\"https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;data-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;data-engineer&#x2F;</a>\n• Full Stack Engineer: <a href=\"https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;full-stack-engineer-levels&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;full-stack-engineer-levels&#x2F;</a>\n• Front End Engineer: <a href=\"https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;front-end-engineer-all-levels&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;front-end-engineer-all-leve...</a>\n• VP or Director of Marketing: <a href=\"https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;vp-of-marketing&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;townsquared.com&#x2F;blog&#x2F;job&#x2F;vp-of-marketing&#x2F;</a><p>Please apply here <a href=\"https:&#x2F;&#x2F;townsquared.com&#x2F;join-our-team&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;townsquared.com&#x2F;join-our-team&#x2F;</a><p>The interview process involves submitting a resume, a phone screen in which you will be expected to work on a coding problem, and a half-day interview that would include interviews with several people and also a technical challenge (i.e., working on a different coding problem). We may pair-program with you on these challenges.<p>If you have questions, you may email me at what you think my first name is (at) townsquared.com. I may not answer right away; please be patient.<p>If you decide to apply, please be aware that, at this moment, if you choose to upload your resume as a PDF file, there is no notification of a successful upload. We’ll fix that soon. If you send in an application without a resume, we’ll let you know that you need to forward one anyway.<p>You may claim you were referred by a “Team Member”, but you should email me to let me know.","time":1486008523,"type":"comment"}