{"by":"johnrball","id":13542365,"parent":13541679,"text":"Mansa Gaming| Front End Engineer| Full Time| New York| Onsite<p>Mansa Gaming Ltd is a startup in the iGaming industry. We operate and build the platform for an online casino in European markets. We launched in December 2015 and have rapidly grown into a profitable company since then with over 800% revenue growth over the last 6 months.<p>As a company, we leverage our founders&#x27; past iGaming experience as well as Silicon Valley technology background to create a scalable platform and first-rate user experience. Our offices are located in New York City and the beautiful island of Malta, heart of the European iGaming industry.<p>Job Description\nOur goal is to have a small, closely knit engineering team that is able to have an outsized impact. This means leveraging the latest technologies and writing easy to maintain code. We prioritize shipping new features and product improvements while still building our platform in a way where we do not become overburdened with technical debt. We want team members who show initiative and take responsibility for the production systems they work on.<p>Your responsibilities will include:\nBuild both client and server side features for our player facing web app\nIntegrate player facing API with backend services\nParticipate in design and code reviews\nCollaborate effectively with designers during implementation\nQualifications\nExpert knowledge of Javascript, HTML and CSS\nA solid understanding of recent Javascript frameworks and tools (React, Backbone, Gulp, Less&#x2F;Sass)\nDemonstrated design and UX sensibilities\nProficiency in a least of one the following: PHP, Python, Node, Ruby \nExperience with a SQL dialect (e.g. MySQL)\nKnowledge designing and maintaining JSON-based RESTful APIs\n2+ years of professional experience\nBachelor&#x27;s degree or equivalent<p><i></i>If you’re looking for a new challenge, enjoy working in a small team, and want to be part of the revolution in iGaming, send us a message to  john@grayscalable.com","time":1485968177,"type":"comment"}