{"by":"blakeweb","id":13547312,"parent":13541679,"text":"Recursion Pharmaceuticals | SLC, Utah | Onsite, full-time<p>Recursion is a startup with about 40 people, generating rich biological data at a pace comparable to the biggest institutions anywhere doing biology and disease research. We have literally millions of images from experiments we conducted in our lab, and we generate terabytes more each week. We’ve gotten more than $2M in multiple grants from the NIH, and last fall closed a $15M series A led by Lux Capital. We’re using imaging experiments to turn human cell experiments into massive amounts of rich biological data so we can find treatments using ML and data science for many diseases as fast as possible.<p>Hiring:<p>* Software engineering: Full-stack Software Engineer - Front-end Software Engineer - Machine Learning Engineer<p>* Data science: Data Analyst - Data Scientist - Applied Mathematician - ML Researcher - Computational Biologist<p>* Technical HR Specialist&#x2F;Manager - Technical Team Development Operation (New--if these posts aren&#x27;t up yet, feel free to apply via Data Scientist and call out your interest in these positions)<p><a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;careers</a> for more details and to apply.<p>Logistics: Salt Lake City, Utah. Hiking&#x2F;running&#x2F;biking is literally out our back door, and it&#x27;s half an hour to 5 ski resorts. Competitive pay, health insurance, relocation assistance (onsite is required), equity, a top-caliber team, and help make a massively positive impact. Happy to sponsor&#x2F;extend visas, but you need to already be authorized to work in the US--we can’t handle the lottery at this stage.<p>Tech: Data science: python scientific stack (pandas, numpy, scikit-learn, matplotlib, bokeh, etc). Software engineering: go, python, angular.js, react, javascript on aws and gce. Deep learning (e.g. convolutional networks) we&#x27;re mainly using the python frameworks (keras, theano, tensorflow, etc).<p>Our team of ~40: <a href=\"http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team\" rel=\"nofollow\">http:&#x2F;&#x2F;www.recursionpharma.com&#x2F;team</a>","time":1485999644,"type":"comment"}