{"by":"beemboy","id":13549161,"kids":[13586019],"parent":13541679,"text":"Mason | Senior Software Engineer (Backend, Frontend) | SEATTLE | <a href=\"http:&#x2F;&#x2F;www.bymason.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bymason.com</a><p>WHO ARE WE? We&#x27;re Mason, a YC (W16) company building mobile deployment infrastructure for companies to build solutions atop their own Android-based device ecosystem (think kiosks, package scanners, medical devices). We want to make something customers want and won&#x27;t think twice about paying for. Check out our video: <a href=\"https:&#x2F;&#x2F;www.bymason.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bymason.com&#x2F;</a>.<p>WHAT ARE WE BUILDING? Imagine a customer simply editing configuration to automagically build and deploy their own custom version of Android with their own in-house apps onto thousands of their own devices -- all actively tracked, managed and updated via dashboards. Our vision is to enable privately owned+managed device fleets with backing services.<p>WHO ARE YOU? In general, you&#x27;re an engineer with 2+ years of experience and&#x2F;or a CS background, and the right attitude (<a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;uPi6Y4\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;uPi6Y4</a>). More specifically, we&#x27;re looking for a backend and a frontend engineer. If the idea that you will experiment, learn, build, <i>ship</i>, and grow with the rest of us appeals to you, contact us! Note: Unfortunately we&#x27;re unable to handle H1Bs at the moment.<p>WHAT WORK? \nBackend engineer: You&#x27;ll architect, design and build our budding backend services. This involves picking the right technologies, implementation, testing, automation, scaling, and what not. We use Node.js and Python right now, but are open to change. More: <a href=\"https:&#x2F;&#x2F;anthology.co&#x2F;job&#x2F;j-4w10pxb3&#x2F;senior-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;anthology.co&#x2F;job&#x2F;j-4w10pxb3&#x2F;senior-software-engineer</a>\nFrontend engineer: You&#x27;ll be our UI maven, building out our dashboards and visualizations that are critical for our product. More: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;masonamerica&#x2F;jobs&#x2F;171409-frontend-developer-ui-ux\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;masonamerica&#x2F;jobs&#x2F;171409-frontend-developer...</a><p>WHY MASON? We&#x27;re a small company aspiring to build very large things. We&#x27;re 11 people now and looking to grow. Your perks:\n-  This is not a &quot;ground floor&quot;, more of a &quot;foundation&quot; opportunity. You will define, build and ship software that will shape the core Mason product.\n-  We value diversity of thought, being and experience.\n-  A fully stocked pantry, and an actual kitchen.\n-  Dogs welcome.<p>WHERE? We&#x27;re based in SEATTLE, one of the few YC-backed ones from out here. We have sweeping views of Cap Hill and Lake Washington (<a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;photos&#x2F;9uwwVav54cS6qtGY8\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;photos&#x2F;9uwwVav54cS6qtGY8</a>), and ample parking.<p>PROCESS: 30 minute chat (in person or Hangouts) -&gt; offline coding and work sample evaluation -&gt; on-site interview -&gt; offer. We delete parts of this workflow if it&#x27;s evident you could be The One. We do our best to respond to everyone individually no matter the outcome. Don&#x27;t hesitate to write to us!","time":1486026680,"type":"comment"}