{"by":"dkuebric","id":13543617,"parent":13541679,"text":"Tracelytics | Boston&#x2F;Cambridge&#x2F;Providence | Full Time | Onsite<p>I&#x27;m the co-founder of Tracelytics, a distributed tracing product that&#x27;s used by engineers at companies like Kayak, HubSpot, Care.com, etc to monitor their production apps.  We&#x27;re hiring and if you might be interested in working on technical software with big data viz, you should check us out!  I&#x27;ve excerpted the job post below.  (Our team is small--15--but distributed; we&#x27;re also hiring for different roles in SF and Vancouver.)<p>--<p>The Trace team in Cambridge, MA is looking for a senior software engineer who specializes in web applications with sophisticated data visualizations. We make a tool that allows software engineers to monitor the performance of their web applications even when they are distributed across multiple technologies and on multiple hosts (<a href=\"https:&#x2F;&#x2F;traceview.solarwinds.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;traceview.solarwinds.com&#x2F;</a>).<p>Our team consists of about 15 engineers distributed across offices in Cambridge, Providence, RI, and Vancouver. We&#x27;re a smart, experienced, and opinionated bunch who care a lot about shipping well-engineered code that makes our users happy and care very little about who&#x27;s smartest or best at winning arguments. Our team size and relative independence give us the flexibility and agility of a startup but our parent company, SolarWinds, provides the financial stability and resources we need to do high quality engineering.<p>This position is located at our office in the Cambridge Innovation Center (CIC) in Cambridge&#x27;s Kendall Square. The CIC is convenient to the Red Line and features many great perks including community events and classes, well-stocked kitchens, and an energetic atmosphere amid lots of startups. Also ping pong tables.<p><a href=\"http:&#x2F;&#x2F;solarwinds.jobs&#x2F;cambridge-ma&#x2F;senior-full-stack-software-developer&#x2F;9C011255E05D4F95A677BB515F7BACD3&#x2F;job&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;solarwinds.jobs&#x2F;cambridge-ma&#x2F;senior-full-stack-softwa...</a>","time":1485974832,"type":"comment"}