{"by":"dtran","id":13547735,"kids":[13547882],"parent":13541679,"text":"PRX is reinventing PR (public relations, not pull requests, although we create a lot of those too) for companies by making it on-demand, transparent, and affordable. Unlike working with traditional PR agencies that cost tens of thousands of dollars a month and endless hours of meetings, companies can launch a campaign with by signing up on our site and manage everything through our dashboard.\nPRX is looking for a full-stack software engineer to join our team in building and scaling our platform to tens of thousands of businesses and hundreds of thousands of journalists and bloggers and using ML to disrupt a very old-school industry.<p><i>Responsibilities</i><p>- You&#x27;ll ship code to PRX’s core product<p>- You&#x27;ll develop new features and improve our PR platform, which our PR managers use to conduct campaigns for our clients<p>- You&#x27;ll work on our crawling engine that indexes millions of articles across the web and scrapes information to our media targeting system<p>- You&#x27;ll use a wide range of technologies including React, Redux, Django, SCSS, PostgreSQL, ElasticSearch, Github and Git Flow, Redis, Celery, Heroku, lots of AWS services (RDS, SQS, S3, Cloudfront, ElastiCache)<p><i>Qualifications</i><p>- You have experience writing and maintaining code shipped to real users, whether for work or a side project.<p>- You have experience in writing web software and are comfortable working across the stack. However, it&#x27;s okay to be stronger or have a preference for backend or frontend, as long as you&#x27;re willing to learn.<p>- You have a firm grasp on CS fundamentals<p>- You are able to learn new concepts and technologies quickly<p><i>Valued, but not required</i><p>- Experience in our specific technologies. PRX is primarily built in Python using Django with Postgres and ElasticSearch on the backend and React + Redux and SCSS on the frontend.<p>- Experience in Numpy, Scipy and ML or NLP<p>Apply at <a href=\"https:&#x2F;&#x2F;prxco.workable.com&#x2F;jobs&#x2F;413395&#x2F;candidates&#x2F;new\" rel=\"nofollow\">https:&#x2F;&#x2F;prxco.workable.com&#x2F;jobs&#x2F;413395&#x2F;candidates&#x2F;new</a>","time":1486004636,"type":"comment"}