{"by":"pbh101","id":13545205,"parent":13541679,"text":"IMC | Chicago, IL | Full-time, INTERNS | ONSITE | Software Engineer, FPGA Engineer<p>We are actively hiring talented engineers to grow our trading operations across the world. Entry-level, junior, and experienced. For intern&#x2F;entry-level software roles, prior experience in Java or C++ helpful but not strictly necessary. Also actively hiring entry-level, intermediate, and senior FPGA engineers. Prior financial industry knowledge helpful but by no means required.<p>We are building, optimizing, and scaling high-frequency trading systems. It&#x27;s fun and challenging. We have a very open and collaborative culture and you will find yourself working closely with traders, quants, network and system engineers, and other devs. We release code nightly and generally have a quick iteration loop: your &#x27;clients&#x27; are frequently the coworkers sitting next to you, so you can work closely together to get to a solution. You&#x27;ll learn a lot, and hopefully we&#x27;ll learn a lot from you :)<p>I lead our dev onboarding team where we focus on getting you the knowledge and insight to be effective at IMC. Despite kicking up our growth rate, we regard a highly interactive and in-depth training and mentoring process to be critical to our growth. A typical day finds me reviewing a lot of code and discussing design and implementation with the rest of the team, as well as fostering the onboardees&#x27; relationships with the rest of the organization.<p>INTERNSHIPS: We’ve found the best and most educational internship experiences come from working on production code. Our interns spend the summer working with our full-time software developers on their projects. Learn a ton from real code reviews and find out how building software together in a continuous-delivery environment is different from typical one-off homework assignments.<p>IMC is a leading derivatives market-marker with offices across the world and was founded in Amsterdam in 1989. <a href=\"https:&#x2F;&#x2F;www.imc.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.imc.com</a><p>Apply for internships and entry-level (“graduate”) positions at <a href=\"https:&#x2F;&#x2F;www.imc.com&#x2F;us&#x2F;careers&#x2F;graduates&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.imc.com&#x2F;us&#x2F;careers&#x2F;graduates&#x2F;</a>.<p>Apply for all roles at <a href=\"https:&#x2F;&#x2F;www.imc.com&#x2F;us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.imc.com&#x2F;us&#x2F;careers&#x2F;</a>.<p>Interview process: online technical assessments, phone and onsite interviews.<p>If you have specific questions for me, my email is in the profile (put HNJOB in the subject line).","time":1485983303,"type":"comment"}