{"by":"benrict","id":13542103,"kids":[13556036],"parent":13541679,"text":"OpenDataSoft (<a href=\"https:&#x2F;&#x2F;www.opendatasoft.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.opendatasoft.com</a>) | Paris, France | Full-time, on site<p>OpenDataSoft (founded in 2011, 40 employees nowadays) is developing a SaaS platform that aims to make it very easy for anyone to create a data portal (which can be a public open data portal, a private internal data sharing space, or anything in between), and at the same time build a wide catalog of public easy-to-use data. You can see the public half of our work here (<a href=\"https:&#x2F;&#x2F;data.opendatasoft.com&#x2F;explore&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;data.opendatasoft.com&#x2F;explore&#x2F;</a>).<p>We&#x27;re hiring:<p>Front-end Engineer (Senior or Junior) : help us build easy-to-use UIs to make data publishing intuitive; also help us re-build entirely our front-end stack this year (from AngularJS 1 to ...?)<p>Back-end Engineer (Senior or Junior) : we like to add a few 0s every year to our data processing performance metrics; help us make our Python stack faster and more resilient!<p>Technical Consultant : you like to hack around a platform (and talk to the R&amp;D team about it), and to help customers become autonomous on a product (which sometimes means teaching a bit of HTML)<p>Being an Engineer at OpenDataSoft means being able to &quot;drive a feature home&quot;, from the design and implementation choices to the documentation and advanced support. If you like contributing to a product and making impactful choices, we may be a great fit for you!\nWe may look like a startup, but we have sensible working hours, a sane growth rate, and a very very low turnover. However, we still like beer, weird jokes, and food (a lot).<p>You can find more information and contact us on our website: <a href=\"https:&#x2F;&#x2F;www.opendatasoft.com&#x2F;company&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.opendatasoft.com&#x2F;company&#x2F;jobs&#x2F;</a><p>If you&#x27;re in Paris and would like to know more about us while drinking a beer, that&#x27;s possible too!","time":1485966701,"type":"comment"}