{"by":"ecosystech","id":13542649,"kids":[13546360],"parent":13541679,"text":"<p><pre><code>   Eco (kojikondo@stanford.edu) | Frontend Engineer | Palo Alto, Los Angeles\n   Eco (kojikondo@stanford.edu) | Backend Engineer | Palo Alto, Los Angeles\n   Eco (kojikondo@stanford.edu) | Web Developer | Palo Alto, Los Angeles\n</code></pre>\nWe&#x27;re a web startup based in Silicon Valley and we&#x27;re seeking web developers with deep knowledge and interests in social sciences, humanities, and various web subculture. We&#x27;re building a platform and infrastructure for a robust and diverse economic ecosystem that&#x27;ll facilitate hundreds of millions of people to derive income from focusing on their passions full time: a unity of work and life.<p>We feel that the web is not as magical in 2017 as it was in 2009 (Yes, 2009 specifically was a magical year for the web). We understand the practical possibilities that have not been realized: we&#x27;re working together to realize those possibilities.<p>We don’t believe that “being busy is a badge of honor” and that one must work long hours to be productive. We want to create a fun environment where people love to learn and explore. Our goal of unity with work and life is inherent in all facets of our startup, both in our product and though our culture.<p>Contact<p>Please address inquiries to Dave at the following address: kojikondo@stanford.edu<p><pre><code>  · Web developers can send a portfolio or Github link.\n  \n  · Resumes (optional); in our experience, resumes convey little about the applicants.\n  \n  · In the email please include responses to the two questions enumerated below:\n  \n  1. What about our company intrigues or resonates with you from our short description?\n  \n  2. If you had no economic concerns and could choose any activities and life trajectories, \n  what life would you want to live and what activities would you want to do? *(There are no wrong answers.)</code></pre>","time":1485969599,"type":"comment"}