{"by":"DenisM","id":13547069,"parent":13541679,"text":"Seattle, WA, ONSITE ONLY<p>We&#x27;re building a communication hub for manufacturers and retailers, so that they can exchange all kinds of information related to the goods being traded. This hub will gradually take over all other communication methods such as Excel&#x2F;FTP&#x2F;Email&#x2F;Dropbox towards Cloud&#x2F;Mobile. As well, it will allow to repurpose a customer&#x27;s data for a number of additional products for them. We&#x27;re aiming for scale of tens of thousands of manufacturers, this is not a consultancy gig.<p>We&#x27;re looking someone who can empathize with how the users are running their business, and who can employ technical skills and wits to build a better workflow for those users. This is a Principal-level position, you would need to own the outcome in it&#x27;s entirety. Your scope of responsibility will start with optimizing individual workflows for our customers, a combination of features to remove a given thorn in customer&#x27;s side, and it will progress to entire products. All the way from interviewing representative customers to mass-deployment.<p>There is no shortage of work:<p><pre><code>  - E-Commerce integration\n  - EDI integration\n  - Mobile development\n  - Interaction design\n  - Generating print material\n  - Payment processing\n  - User analytics (for our customers to track *their* customers)\n  - Email campaign orchestration and tracking (ditto)\n  - Data visualization (ditto)\n  - Logging\n  - C# business logic\n  - Modern web front-end, likely React or Vue.js\n</code></pre>\nAbout us:<p><pre><code>  - Opportunities: A huge area of responsibility. Pick two if you dare.\n  - Family-friendly: Sane hours, generous vacations.\n  - Benefits: Health.\n  - Financial security: Enough pay so you don&#x27;t have to worry about it.\n  - A stake in success: Meaningful stock option grant. Really.\n  - Profitable\n</code></pre>\nCan you get things done? Please contact denis@amptab.com","time":1485996853,"type":"comment"}