{"by":"RichardPrice","id":13546229,"parent":13541679,"text":"Academia.edu | Full Stack Engineer | San Francisco, CA | Onsite<p>Academia.edu is addressing two problems:<p>- Open access. The goal here is to put every academic pdf ever written on the internet, available for free.<p>- The reproducibility crisis. It has emerged over the last few years that 65-90% of the scientific literature is not reproducible. What this means is that if you try to reproduce the experiments described in a paper, 65-90% of the time you will not get the same findings. This is known as &quot;the reproducibility crisis&quot;<p>With regard to open access, Academia allows academics to upload papers to Academia, and make them freely available. Academics have uploaded about 16 million pdfs to Academia.edu, and upload about 1 million a month. About 30 million people come to Academia each month to access and share papers.<p>With regard to reproducibility, we think the way to solve the reproducibility crisis is to build a new peer review system that (a) crowd-sources peer review from the academic community and (b) provides credit to material that journals don&#x27;t publish (data-sets, code, replications, failed replications).<p>Academia has built a recommendation system which is the basis of our approach to (a) and (b). We realize that addressing reproducibility is a huge challenge. We need mission-driven engineers to come and help us. We have raised $28 million from Tencent, Khosla Ventures, Spark Capital, and True Ventures. Bijan Sabet from Spark Capital writes &quot;We believe open science is really important. We believe Academia.edu is going to have a profound impact on the world.&quot;<p>We are looking to hire full stack software engineers. Technologies we use include Ruby, Rails, Postgres, DynamoDB, React. Our office is in downtown San Francisco. For more information, visit <a href=\"http:&#x2F;&#x2F;academia.edu&#x2F;hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>. If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1485989711,"type":"comment"}