{"by":"josh_carterPDX","id":13541906,"kids":[13542827],"parent":13541679,"text":"BrightWork | <a href=\"https:&#x2F;&#x2F;brightwork.io\" rel=\"nofollow\">https:&#x2F;&#x2F;brightwork.io</a> | Portland, OR | Full time | Onsite<p>BrightWork is a serverless API micro services platform making it easier for Developers and Teams to build their applications faster using the skills they already have. They write a small amount of javascript to a manifest and they can have a RESTful API up and running within minutes. This enables the Developer to focus on their frontend without having to worry about infrastructure in a serverless environment. The platform is scalable, reliable, and the pricing is predictable for the customer and recurring for BrightWork.<p>You’re a developer that loves Javascript, NodeJS and web frameworks (Angular, React). One who is passionate about building tools that make the lives of other developers easier. You must be able to follow the direction of the senior management team and turn the roadmap into a reality. Ideally you are good at both backend and frontend development, are a ninja coder with aspirations to be a leader. Willing to take direction and provide direction and leadership to junior team members. You have an entrepreneurial mindset and take ownership of projects and&#x2F;or tasks to see them through to completion. You also have opinions and aren&#x27;t afraid to bring them to the table.<p><i>Requirements</i> \nThe position will require that you have experience with NodeJS, RESTful API, MongoDB or similar database. At least 3 years of development experience. Unit testing with Mocha&#x2F;Chai or similar. Understanding of good software engineering patterns and practices, OOP vs functional, etc. Experience using Git for source control is required.<p><i>Bonus Points</i> \n- MEAN stack, HTML, CSS, SASS experience is preferred. \n- Experience with ES6. \n- Agile development experience and continuous integration&#x2F;delivery practices desired. \n- DevOps tools experience (Docker, Chef, Puppet, Vagrant) is desired.<p><i></i>Please no 3rd party recruiters or agencies<i></i><p><i></i>This is on site in Portland, Or. Local candidates or persons willing to relocate to Portland only (no relocation compensation included).<i></i><p><i></i><i>May be required to travel</i><i></i><p>Apply at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;brightwork-1&#x2F;jobs&#x2F;146020-full-stack-javascript-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;brightwork-1&#x2F;jobs&#x2F;146020-full-stack-javascr...</a>","time":1485965770,"type":"comment"}