{"by":"d3dtn01","id":13545863,"parent":13541679,"text":"Genome Medical | VP of Engineering | San Francisco Bay Area | REMOTE<p>WHO IS GENOME MEDICAL\nGenome Medical, Inc. is an early-stage company using telemedicine to integrate genomic medicine into everyday health care.  Founded by personalized medicine pioneers Dr. Randy Scott, Dr. Robert Green, and Lisa Alderson, our goal is to bridge the growing gap between available genome technology and current medical practice.  As genetic information becomes increasingly important in medicine, there are too few experts to meet the growing demand for interpretation. We are addressing this challenge by creating a scalable, efficient model for lifelong genome-centered health care.   Our network of clinical genomics experts provides consultations to both patients and physicians.  To learn more, please visit www.genomemedical.com or find us on Twitter.<p>ROLE\nWe are searching for an engineering leader who will work with product management  to transform our already launched, speed-to-market product offering into the envisioned experience that Genome Medical was founded upon. You will be reporting directly to the CEO and will be responsible for overall engineering function.<p>RESPONSIBILITIES\n- Oversight for all aspects of software development and technology operations including product engineering, platform engineering, rapid prototyping and QA\n- Develop and maintain detailed technical and data architectures that will ensure rapid scaling of the business and creation of strategic assets\n- Create clinical support tools and knowledge databases for efficient, scalable genome-centered care\n- Manage off-shore engineering team\n- Liaise closely with Product team\n- Oversight for IT-related issues including internet access, VoIP phones, email and other collaboration tools<p>QUALIFICATIONS AND EXPERIENCE\n- Bachelor’s degree required; Master’s degree preferred\n- Demonstrated success building web and mobile products\n- Prior experience managing teams of engineers\n- Demonstrated success managing off-shore resources \n- Passionate focus on continual improvement of process and people\n- Experience scaling products, processes and people in a mission-critical software development environment\n- Proven ability to interact with and instill confidence in a diverse set of stakeholders<p>We are located in the South Bay of the San Francisco Bay area.  This position affords the opportunity for both remote and onsite work.   If interested, please submit your resume to  info@genomemedical.com.","time":1485986988,"type":"comment"}