{"by":"gault8121","id":13547019,"parent":13541679,"text":"Quill.org | New York City, NY NYC | ONSITE | Fulltime &amp; Interns<p><a href=\"https:&#x2F;&#x2F;Quill.org\" rel=\"nofollow\">https:&#x2F;&#x2F;Quill.org</a> is hiring a fulltime Javascript developer and a machine learning intern.<p>Our open source web app helps low-income K-12 students become sharp writers. Quill is now being used by 200,000 students from 2,000 schools across the country, and we are a non-profit funded by foundations such as the Bill &amp; Melinda Gates Foundation, Google.org, and the AT&amp;T Foundation.<p>We are looking for developers who are passionate about helping tens of millions of students improve their writing skills. The developer’s primary responsibilities will be developing features and the user interface, optimizing code for speed and scale, and working with members of our teacher and developer community. You should have a passion for making education more accessible, experience in building single-page web applications, fluency in Javascript, experience working with CSS &#x2F; SCSS, and an understanding of RESTful web services. We use React, Ruby on Rails, Heroku, Firebase, Postgres, and Angular. It&#x27;s also a plus if you have an interest in mobile web development, natural language processing, and&#x2F;or machine learning technology. Quill is focused on foundational skills, and we are using NLP technology to build an increasingly more complex set of tools.<p>To see how writing instruction is a game changer for students, please check out this Atlantic article:<p><a href=\"https:&#x2F;&#x2F;theatln.tc&#x2F;2aJnEfU\" rel=\"nofollow\">https:&#x2F;&#x2F;theatln.tc&#x2F;2aJnEfU</a><p>We’re a small team of four working in the Financial District of New York City, and you will be joining as our fourth engineer. Our entire team is self-taught, and we value resourcefulness over previous experience. This is a full-time role on-site in the Financial District of New York City, and we cannot sponsor a visa. To apply, send us a resume, and links to your blog, projects, Github, and any other resources that might help us understand your background and skills.<p>Email Peter at jobs@quill.org<p>To learn more about Quill, check out these links:<p>- <a href=\"https:&#x2F;&#x2F;quill.org&#x2F;play\" rel=\"nofollow\">https:&#x2F;&#x2F;quill.org&#x2F;play</a><p>- <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;writing-with-quill\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;writing-with-quill</a><p>- <a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;Quill_org\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;Quill_org</a>","time":1485996404,"type":"comment"}