{"by":"lechuckcaptain","id":13549072,"parent":13541679,"text":"Fresenius Medical Care | Software developer | Vaiano Cremasco, Milan (Italy) | ONSITE, FULLTIME, <a href=\"http:&#x2F;&#x2F;www.freseniusmedicalcare.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freseniusmedicalcare.com</a><p>Fresenius Medical Care, world’s leading provider of products and services for people with chronic kidney failure, has an immediate opening for a Software developer. We are seeking a talented .NET developer to join our team of Software developer based in Vaiano Cremasco (Italy).<p>You will be responsible for building .NET application using C# + Microsoft SQL Server. Technologies includes WPF and WCF. The focus is to the full application stack including front-end, back-end and database development. Your primary responsibility will be to design and develop these layers of our applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Team is working using agile methodologies (SCRUM-BUT). A commitment to collaborative problem solving, sophisticated design is a must. The application is a Medical Device software class I, where quality is essential and where is needed to follow all Medical Device related IEC standards.<p>Skills:<p>•\tStrong knowledge of .NET framework<p>•\tProficient in C# with a good knowledge of their ecosystems<p>•\tStrong knowledge of Microsoft SQL Server T-SQL language<p>•\tFamiliarity with Microsoft SQL Server basic administration skills<p>•\tUnderstanding of Windows Communication Foundation<p>•\tStrong understanding of object-oriented programming<p>•\tSkill for writing reusable libraries and components<p>•\tFamiliar with various design and architectural patterns<p>•\tKnowledge of concurrency patterns<p>•\tFamiliarity with Windows Presentation Framework<p>•\tKnack for writing clean, readable, and easily maintainable code<p>•\tUnderstanding of Common Language Runtime (CLR), its limitations, weaknesses, and workarounds<p>•\tProficient understanding of Microsoft Team Foundation System<p>•\tKnowledge of Web development is also preferred but not strictly required<p>•\tFluent in English, Italian would be a plus<p>Experience:<p>•\tC# + Microsoft SQL Server professional use  minimum of 5 years<p>•\tExperience implementing automated testing platforms and unit tests<p>Other information:\nLocation: Vaiano Cremasco (Italy)\nWillingness to travel up to 10% of the time<p>Email me (marco.pagliari) at (fmc-ag.com) with your resume and a brief introduction.","time":1486025336,"type":"comment"}