{"by":"PelotonTech","id":13546654,"parent":13541679,"text":"Big Data Infrastructure Engineer, Cloud &amp; Mobile WLAN&#x2F; Autonomous Vehicle -Peloton Technology<p>Full-time, Onsite, Mountain View, CA\nGoLang&#x2F;Java&#x2F;C++<p>APPLY HERE:  <a href=\"http:&#x2F;&#x2F;peloton-tech.com&#x2F;careers&#x2F;?gh_jid=505358\" rel=\"nofollow\">http:&#x2F;&#x2F;peloton-tech.com&#x2F;careers&#x2F;?gh_jid=505358</a><p>The Automated Vehicle Data Infrastructure Engineer, Cloud will develop key systems that interact with mobile fleets of vehicles. This includes systems to sync large quantities of data from and to each vehicle, the management of data in the cloud scaling to the petabyte range, and coordination apps providing key operational data to the vehicles.<p>Qualified candidates have a strong background in developing large-scale server systems interacting with many thousands of mobile clients in real time. Understanding of the issues of intermittent connectivity, security, bandwidth optimization, priority queues, and large-scale data movement are critical to this role. Additionally, a strong understanding of location-based computation will be a key asset for this engineer.<p>KEY QUALIFICATIONS:<p>5+ years industry experience building hosted (cloud or colo-based) back-end systems, with deep understanding of systems that scale and are highly resilient to node failure<p>Well versed in current data marshalling, compression, and communication methodologies.<p>Current in building secure web services in the cloud\nExperience with AWS (Amazon Web Services) deployment or similar highly desired.<p>Knowledge of fault-tolerant message routing platforms (RabbitMQ, ActiveMQ, ZeroMQ or similar)<p>Experience with wireless networking, especially ad-hoc networking protocols (MANETs and VANETs)<p>Knowledge of stream processing technologies (Kafka, Storm or similar)<p>Fluent in leading edge software languages and tools; passionate about test driven, agile development; committed to tight collaboration and continuous integration (CI)<p>Preferred languages: Go, C++, Java<p>BSCS or equivalent experience","time":1485993043,"type":"comment"}