{"by":"ocs_datajobs","id":13550607,"parent":13541679,"text":"Olympic Channel | Software Architect, Data Systems Engineer | Madrid | On-site | Temporary through 2020 &amp; Full-time, permanent<p># Software Architect (<a href=\"https:&#x2F;&#x2F;olympicchannelservices.com&#x2F;ocs_jobs&#x2F;software-systems-architect&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;olympicchannelservices.com&#x2F;ocs_jobs&#x2F;software-systems...</a>)\nWe are looking for an experienced Software Architect to make intuitive high level decisions for software development and the operational availability of bespoke software platforms. He&#x2F;she will see the “big picture” and create solid architectural approaches for software design and implementation that will either be placed to the market for third parties to build and deliver and&#x2F;or be used to guide internal sw development teams.<p>A great software architect has a strong computer science background and excellent IT skills. We seek a person experienced in software designing that possesses ability to develop a unified vision for software characteristics and functions, a vision that should lead to implemented software solutions that will satisfy the OCS constituents requirements for the short and the long term.<p># Data Systems Engineer (<a href=\"https:&#x2F;&#x2F;olympicchannelservices.com&#x2F;ocs_jobs&#x2F;data-systems-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;olympicchannelservices.com&#x2F;ocs_jobs&#x2F;data-systems-eng...</a>)\nThe Olympic Channel is seeking to fill a permanent position as Data Systems Engineer to work in the Digital Development &amp; Network unit, as part of the Technical department.<p>The Data Systems Engineer will coordinate all of the Olympic Channel’s data infrastructure activities and is responsible for the security and service quality levels, manage the design, implementation, operation and support of the applications infrastructure within the Olympic Channel and ensures that all services are produced and maintained at the required quality levels.<p>---\nPlease feel free to apply online or reach out directly with questions or resumes at datajobs [at] olympicchannel.com -- please put HN in the title!","time":1486045089,"type":"comment"}