{"by":"brown4","id":13551890,"parent":13541679,"text":"Endgame’s security platform enables organizations to hunt for adversaries within their networks and secure their most valuable assets. We are characterized by a high degree of autonomy and flexibility, intellectual engagement, and a competitive compensation structure that rewards performance. We work within a fast-paced, driven, and flexible work environment that allows for both professional growth, as well as unwinding through team events like weekend family brunches, happy hours, and outdoor activities. Endgame values engagement within the tech community. We provide opportunities for open source contributions, speaking at meetups or conferences, and participating in our technical blog<p>Senior Back-end Engineer (DC - Arlington, VA)  <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mXjqiwP\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mXjqiwP</a> - Solid experience using Python and relational databases to make web applications - Familiarity with queuing systems like RabbitMQ&#x2F;AMQP, Kafka, ActiveMQ, AWS SQS, ZeroMQ, etc. - Knowledge of HTTP and ability to make a RESTful web application - Experience using Linux and developing applications that run on Linux (Ubuntu, CentOS, etc) - Familiarity with search servers like ElasticSearch or SOLR - Experience with service oriented architecture, micro services and containerization - Experience with or desire to learn golang<p>Senior Software Engineer (Front End)  <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mXjqiwP\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3mXjqiwP</a> - Endgame’s Front End Engineering team is looking for a Senior Front End Engineer to be part of a cross-functional team working with designers, product managers, and engineers across multiple phases of the product lifecycle. Our Front End team builds responsive and elegant interfaces while maintaining a solid enthusiasm and passion for cutting-edge technologies. Our Front End Engineers embrace modern JavaScript frameworks and libraries, develop rapid prototypes, and iterate on features to optimize user interaction. Front End Engineers at Endgame use innovative UI architectures and designs, setting the bar high to produce compelling interfaces and creative visualizations.<p>Automation Engineer  <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3gYjqiwK\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3gYjqiwK</a> Endgame is seeking a talented Automation Engineer to build, administer, and improve our automated testing frameworks customized to our unique security products. Our software development process leans heavily on this continuous integration environment to perform automated software builds and tests against a wide range of operating systems and configurations. This action packed and dynamic environment requires the flexibility to work independently, take initiative to lead projects, while also collaborating with the team to expedite the creation and deployment of our security products.<p>Or checkout <a href=\"https:&#x2F;&#x2F;www.endgame.com&#x2F;career-openings\" rel=\"nofollow\">https:&#x2F;&#x2F;www.endgame.com&#x2F;career-openings</a> and email me if anything looks interesting jbrown[@]endgame.com","time":1486053713,"type":"comment"}