{"by":"relouleco97","id":13550583,"parent":13541679,"text":"Technical Project Manager - REMOTE - Anywhere<p>CodeMyViews Summary:\nwww.codemyviews.com \nCMV exists to make software development better for everyone involved – developers included. We believe in a fully managed development process where our team handles the entire software development workflow from Project Management to Coding &amp; Execution. Clients work with us because they love our hands on approach, senior engineering team, and get-it-done culture. Developers love us because when you work at CMV, every project you start on is fully spec’d out and defined in such a way that you can do what you love – write code. We’re a fully remote team, so you can work anywhere, anytime. We value smarts, hard work, and diversity which is why we hire only the best from all over the world.<p>Job Description:<p>Our Technical Project Manager role at CMV means you will work with our great team of engineers, designers, product managers, and our CTO to deliver the best code for clients along with an amazing customer experience. Your day to day will primarily involve managing a variety of software projects, organizing workflows, interfacing with developers, managing clients, and being an overall badass that keeps operations moving smoothly. You will work closely with our team developers and VP of Engineering who will be doing the day to day coding on the project.<p>This is a remote position that can be done from anywhere with a solid internet connection, and we hope, some coffee. During the year we like to get together as a team, like last year’s trip to Amsterdam &amp; St. Petersburg. Join us soon – we’re thinking Indonesia this year!<p>Requirements &amp; Responsibilities:<p>Insanely organized, but nice about it\nExperience working remote\nExperience managing large and small software projects\nClient service experience a plus\nTechnical skill – you may not code every day, but you could if you needed to\nCan move fast while maintaining highest quality\nIdentify development issues and blockers and devise smart solutions\nHelp to mentor &amp; onboard new team members\nAt least 3 years of software project management experience\nYou must be a top individual contributor to do great at CMV.<p>To apply: <a href=\"https:&#x2F;&#x2F;codemyviews.com&#x2F;careers&#x2F;technical-project-manager\" rel=\"nofollow\">https:&#x2F;&#x2F;codemyviews.com&#x2F;careers&#x2F;technical-project-manager</a>","time":1486044881,"type":"comment"}