{"by":"mookerji","id":13553435,"kids":[13567572],"parent":13541679,"text":"<p><pre><code>  Swift Navigation | SF | Hardware&#x2F;Infrastructure&#x2F;Scientific Software Jobs | INTERNS &#x2F; VISA\n\n  Swift Navigation is looking for firmware, scientific tooling, and infrastructure\n  software engineers to work with us on high-precision GPS receivers\n  (https:&#x2F;&#x2F;github.com&#x2F;swift-nav&#x2F;). We&#x27;re shipping this week (!) the world&#x27;s first\n  low-cost, multi-constellation, inch-accurate satellite navigation receiver for\n  autonomous vehicle applications. Questions? Email Buro (mookerji@swiftnav.com)\n  or Margaret (jobs@swiftnav.com) or apply to https:&#x2F;&#x2F;jobs.lever.co&#x2F;swift-nav.\n\n  + Firmware (Production embedded programming on the Zynq platform, FPGA-based\n    DSP, C, C++, Python, VHDL, real-time Linux).\n\n  + Scientific Python Tooling (production scientific Python for product\n    prototyping, testing, and analysis).\n\n  + Web and internal platform infrastructure (front ends, rear ends, services,\n    production programming, Haskell, Python, JS, C++, containerized distributed\n    workflows, etc. etc. etc.).\n \n  + Interns with interesting project experience in any of the above, or interested\n    in hacking together hardware&#x2F;software demos for new applications, integrating\n    UAV autopilots.\n\n  Our interviews have a few steps: an intro phone call, technical phone screen or\n  take home problem, and an onsite. Our technical interviews aim to fairly assess\n  your skills and also preview our own day-to-day work.\n\n  Satellite navigation is a rich problem space! Our 40 (??!) person group in the\n  Civic Center neighborhood of San Francisco is spread across analog&#x2F;RF&#x2F;digital\n  hardware design and embedded systems, statistics, satellite navigation,\n  functional programming, and web infrastructure. Our work is highly\n  interdisciplinary with an environment emphasizing effective communication,\n  collaboration, and inclusion with a flexible working policy.</code></pre>","time":1486062307,"type":"comment"}