{"by":"richardaj","id":13561809,"parent":13541679,"text":"Pingman Tools | Boise, ID | ONSITE | Full-time | Senior Software Developer, C#, ASP.NET, Win, macOS, iOS, Android, Xamarin, Cloud<p>You love building and architecting great products, playing with new technologies, and learning something new every day. You can find several solutions to any problem. You love to celebrate accomplishments - and you live to celebrate often. You are &quot;one&quot; with C based languages (C#, C++, Java, Objective-C, Perl, Python, JavaScript) and are ready to embrace C# as your tool of choice. You&#x27;re eager to turn your knowledge into a user experience that everyone admires. You&#x27;re currently looking for more challenge, more flexibility, more responsibility or more fun at work.<p>We&#x27;re a small team based in downtown Boise, ID (near the river, greenbelt, 10 great lunch spots, and as many great bars), and we&#x27;re looking for a quick, mentally energetic software developer to join our growing team. We&#x27;ve been building great network troubleshooting tools for years, and have a whole pile of new releases and great projects that need your help. We have earned thousands of happy and enthusiastic customers from every major aerospace and broadband provider to gamers worldwide. We&#x27;re taking a proven product and scaling it to meet the needs of more users on whatever platform they use. There&#x27;s a lot of territory to cover and lots of places for you to contribute based on your strengths.<p>If you think you&#x27;re a fit with us then check out more about us at:<p><a href=\"https:&#x2F;&#x2F;www.pingman.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.pingman.com</a><p>Then send a brief resume with an introduction letter to:<p>ednamode@pingman.com<p>You will receive a simple e-mail challenge, then we will have &quot;get to know each other&quot; phone call which is followed by a on-site interview and code test for the best candidates.  And we hope you are one!<p>About Pingman Tools\nAt Pingman Tools, our goal is to make network troubleshooting suck less. We help individuals and companies &quot;See the network, pinpoint the problem&quot;, including gamers, VoIP users, stock traders, ISPs, ASPs, and anyone that uses or provides network service. We have a fun and focused gang of sharp, diverse, hard-working individuals growing our brand and tools in an environment of respect, passion, and ongoing amusement.\nWe are a Boise, Idaho-based company, growing with new products, services, and team members. If you&#x27;re looking to help make a difference in a company, architecting and developing existing and new software in .NET&#x2F;Xamarin (in addition to a host of other technologies), our downtown Boise, ID office may be a great place for you.","time":1486145318,"type":"comment"}