{"by":"taylorbuley","id":13564625,"parent":13541679,"text":"McNaughton Newspapers | Digital revenue coordinator | Fairfield, Davis, Placerville, Winters, Georgetown, CA (&amp; remote considered) | Systems department<p>I&#x27;m working to build up the digital side of a family newspaper company. Join me for hard, but rewarding, work building for news and other local businesses in Northern California.<p>As CTO I hit the reset button on digital strategy in 2015 and we&#x27;re now seeking a profit-minded #2 to help with our abounding digital growth, reporting to me. Everyone in the family wants to move the business forward and we&#x27;re limited by our digitally-dedicated resources, not bureaucracies or lack of imagination. The position would represent the 1st employee fully focused on digital operations. Revenue support is the obvious first area we&#x27;re expanding.<p>I&#x27;ve got a fixed salary budget that can scale to match experience. Ideally I&#x27;ll find a partner with a history and desire to tackle major revenue responsibilities:<p>* WordPress management (marketing pages, SEO, forms)<p>* DFP management (trafficking)<p>* Campaign management (landers, display&#x2F;text creatives, spec ads)<p>* Salesperson support (help requests, FAQs&#x2F;documentation, walk-throughs)<p>* Reporting (revenue and analytics, Excel&#x2F;Google Sheets)<p>* Prospecting (research and analysis)<p>* Salesperson support (help requests, FAQs&#x2F;documentation, walk-throughs)<p>* Customer support (Google Slides presentations, capability marketing, advertiser onboarding)<p>* Ecommerce (products, discounts)<p>* 3rd party revenue management (Affiliate, ad networks, placements, audiences&#x2F;cookies)<p>The challenge: We&#x27;re reaching more people than ever before, but 9 out of 10 our customers don&#x27;t pick up a newspaper. How do we make money from a growing digital audience commensurate with print revenues that appear to be in secular decline? Our business is worth fighting for. Join the fray!<p><a href=\"https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;jobs&#x2F;mcnaughton-newspapers-inc-07b5d5e9&#x2F;digital-revenue-coordinator-f1ab7b98\" rel=\"nofollow\">https:&#x2F;&#x2F;www.ziprecruiter.com&#x2F;jobs&#x2F;mcnaughton-newspapers-inc-...</a>","time":1486167554,"type":"comment"}