{"by":"dbRM","id":13592314,"parent":13541679,"text":"Rails Machine  |  DevOps &amp; SRE  | Full-Time | Remote | Hiring Junior to Senior Levels<p><a href=\"http:&#x2F;&#x2F;railsmachine.com\" rel=\"nofollow\">http:&#x2F;&#x2F;railsmachine.com</a><p>We give our customers the ability to reach out to us like they would an internal DevOps team!<p>As DevOps&#x2F;SRE at Rails Machine, you will ensure our customer’s applications are available, fast, and secure. Our customers need the best service, support, and products, and we need you to help us deliver.    You’ll work with virtualization and container technologies (Xen, Openstack, Docker, and Kubernetes) and setup high availability data clusters (MySQL Galera, PostgreSQL replication, Redis failover, ElasticSearch clustering, Memcached, MongoDB etc.). You&#x27;ll manage application instances built with Ruby-on-Rails and Elixir&#x2F;Phoenix (to name a few) and layer on management, orchestration, monitoring, and alerting for fleets of instances. If you’ve ever wanted to work at a scale that few companies do, you’ll find the right challenge here at Rails Machine!<p>Responsibilities:<p>* Manage availability and performance problems for customers<p>* Pair with other SREs and Systems Administrators, mentor junior staff<p>* Author blog posts and participate in the community as a Rails Machine representative<p>* Create and maintain system architecture, design, and implementation<p>Minimum Qualifications :<p>* Proficient in Ruby with additional experience in C&#x2F;C++, Python, Elixir, Java, or JavaScript preferred<p>* Experience with config management or automation framework (like Chef, Puppet, Ansible, Capistrano)<p>* Experience maintaining production infrastructure on a Linux environment<p>* Intermediate Ubuntu system administration skills<p>* Strong DevOps experience and customer service skills<p>* Self Motivated and Diligent.<p>* Ability to participate in on-call&#x2F;pager rotation<p>* U.S. Residents Only<p>Interested?   Tell us what you&#x27;ll bring to the team by emailing hiring@railsmachine.com !","time":1486498414,"type":"comment"}