{"by":"acketon","id":13636326,"parent":13541679,"text":"Boston University | Lead Designer | Boston, MA USA<p>Interactive Design is a piece of Boston University’s award-winning Creative Services group. We are looking for both designers and developers.<p>Currently hiring: Lead Designer, Web Developer II, Web Producer.<p>Lead Designer:\nIf you’re passionate, conscientious and love to concept, design, prototype, test, &amp; launch interactive projects from large websites to editorial stories to mobile applications, this is a place for you. You’ll work closely with a team of copywriters, project managers, photographers, and developers while ensuring the project meets high standards of quality and addresses the client’s strategic goals. All while being around some really nice people.<p>What you’ll do:<p>You’ll work on designing interactive projects of many different sizes and complexities. For some of our largest, and most immersive projects you’ll take the lead and create great sites like the College of Communications (<a href=\"http:&#x2F;&#x2F;www.bu.edu&#x2F;com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bu.edu&#x2F;com</a>), or Questrom School of Business (<a href=\"http:&#x2F;&#x2F;www.bu.edu&#x2F;questrom\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bu.edu&#x2F;questrom</a>). You’ll design stories like this one about searching for new physics at the LHC (<a href=\"http:&#x2F;&#x2F;www.bu.edu&#x2F;research&#x2F;articles&#x2F;new-physics-large-hadron-collider-cern&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bu.edu&#x2F;research&#x2F;articles&#x2F;new-physics-large-hadron...</a>) or explain climate change lessons from Venice (<a href=\"http:&#x2F;&#x2F;www.bu.edu&#x2F;bostonia&#x2F;fall14&#x2F;lessons-from-venice&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bu.edu&#x2F;bostonia&#x2F;fall14&#x2F;lessons-from-venice&#x2F;</a>).<p>*   Participate in all aspects of the interactive design process: Information Architecture, Wireframing, Prototyping, User Experience, Visual Design, and Frontend markup.<p>*   Collaborate with developers to build complex functionality.<p>*   Supervise the work of collaborating team members to ensure that client and institutional branding objectives are achieved;<p>*   Maintain a state-of-the-art understanding of current and emerging tools and technology.<p>*   Design both small to large university sites and longform, highly interactive, narrative editorial stories for several in-house editorial channels.<p>*   Create great design, while still having a life beyond the office.<p>See full descriptions and apply: <a href=\"http:&#x2F;&#x2F;www.bu.edu&#x2F;interactive-design&#x2F;join-our-team&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bu.edu&#x2F;interactive-design&#x2F;join-our-team&#x2F;</a>","time":1487002337,"type":"comment"}