{"by":"entee","id":18358090,"parent":18354503,"text":"Lumiata | Onsite | San Mateo | Software Engineer - Data Platform, Junior Sysadmin<p>We&#x27;re a medical technology company using machine learning and massive amounts of patient data to improve how the healthcare system works. Our tools process millions of patient records to predict what kinds of medical risk and problems will befall a patient and other medically relevant parameters. Join us to learn about the many intricacies of medical data, how to handle very large volumes of patient records, and how to build pipelines to operationalize cutting-edge machine learning models. We have developed a product major healthcare players want to buy and now need to turn it into something big that will streamline how healthcare works, come help us build it out!<p>Software Engineer: We work mostly in Python and Scala. Main technologies include Spark, TensorFlow, Airflow and Hadoop among others. We’re always trying new things, and you will be part of making those decisions. We’re looking to build more robust pipelines to transform raw, often human-entered data into standards-compliant forms, and to deploy a wide variety of machine learning&#x2F;AI models in a scalable, traceable manner.<p>We need several engineers at different levels of experience. We look for independence, a strong sense of craft, and solid technical skills.<p>Interview Process:<p>1.) Phone screen for resume<p>2.) Short take-home problem<p>3.) Phone conversation about take-home<p>4.) Onsite with us<p>Junior Sysadmin: We are also looking for someone who knows their way around a Linux command line, has a basic understanding of computer networks, and is comfortable addressing memory&#x2F;hard drive&#x2F;other hardware issues in a datacenter environment. This is an entry-level position for someone wanting to learn about a whole variety of systems.<p>Odds and ends: mostly onsite in lovely downtown San Mateo but flexible hours. Free lunch, ~25 employees, growing in a field that really affects people&#x27;s lives. Diverse work environment with good, friendly people.<p>Please apply at <a href=\"https:&#x2F;&#x2F;lumiata.bamboohr.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;lumiata.bamboohr.com&#x2F;jobs&#x2F;</a> and contact hr at lumiata.com with any questions.","time":1541104115,"type":"comment"}