{"by":"Kerrick","id":18356807,"parent":18354503,"text":"Second Street | St. Louis, MO, USA<p>Second Street is an audience engagement software platform that is used by over 3,000 media companies and marketers. Some of our leading-edge products include online contests, ballots, polls, quizzes, sweepstakes, email, audience insights, and more. We are seeking tech-savvy professionals who are passionate about our industry, learn quickly, and are motivated to succeed.<p>You will be a member of our cross-functional product development team which is made up of designers, testers, and software engineers. We are responsible for a suite of long-lived products that receive constant innovation, feedback, iteration, maintenance, and new feature development.<p>Software engineers at Second Street are fully involved in every part of the process, from planning, to developing, to testing, to launch. We care deeply and we do things right: version control, automated testing, code reviews, and occasional pair programming. We also focus on work-life balance, including a flexible schedule and work-from-home opportunities, so you won’t be burning the midnight oil here.<p>We currently have multiple open positions:<p>---<p>Senior Front-End Software Engineer (Remote OK)<p>We use Ember.js (including Ember Data and ember-cli) to build most of our applications, backed by a RESTful JSON API. We utilize the latest JavaScript features, including stable TC39 proposals supported by Babel. We use Sass and PostCSS for our stylesheets, and organize our components with BEM. We also have a few TypeScript projects, including some Node.js services.<p>More Information and How to Apply: <a href=\"http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-senior-front-end-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-senior-front-end-dev...</a><p>---<p>Senior Back-End Developer (ONSITE)<p>Responsibilities include, but are not limited to:<p>- The design, development and implementation of web based software and media tools<p>- Creation of .Net (C#) code with close integration of MS SQL tables and stored procedures<p>- Provide technical analysis, design, programming, testing, documentation and maintenance support<p>- Adhere to application development standards to ensure re-usability, maintainability, reliability, extensibility and ease-of-use for clients and end users<p>More Information and How to Apply: <a href=\"http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-back-end-software-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;info.secondstreet.com&#x2F;now-hiring-back-end-software-de...</a>","time":1541096172,"type":"comment"}