{"by":"kevinwuhoo","id":18359059,"parent":18354503,"text":"10x Genomics | Software Engineers, QA, DevOps | San Francisco &amp; Pleasanton, CA | Onsite or Remote (US Only)<p>We&#x27;re a biotech company developing novel software, hardware, and biochemical systems to give scientists new methods of discovering the mechanisms behind cancer and immunology. We&#x27;re steadily growing our software team of 13 engineers (including myself), 4 QA engineers, and 1 designer.<p>Two days ago, we were found to be the #1 fastest-growing private company on the SF Business Times top 100 list. We&#x27;ve had &quot;an eye-popping 2,044 percent spike in revenue, to more than $71 million in 2017 from $3.3 million in 2015&quot; [1]. Additionally, earlier this month, we hired Justin McAnear as our CFO who was previously Tesla&#x27;s VP of global finance [2].<p>You can find out more about our massively parallel pipelines as well as our visualization software at <a href=\"https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;support.10xgenomics.com&#x2F;</a>. We manage our pipelines with Go, develop analysis code using Rust and the NumPy&#x2F;SciPy stack, and drive our front-end applications with React&#x2F;Redux. No previous biological experience is required, but if you&#x27;re interested there are an abundance of opportunities to learn! You&#x27;ll work with a team who are alums of YC, Google, Facebook, 23andMe, MIT, Harvard, Caltech, and more.<p>We&#x27;re currently hiring for all types of software roles including full stack, front end, back end, infrastructure, UI, and QA engineers. You can see the full listing at our careers page: <a href=\"https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;</a>. Feel free to email me if you think you&#x27;re a good fit for these, or really any role at our company, or if you just want to chat. You can reach me at kevin.wu@10xgenomics.com or @kevinwuhoo. I strive to reply to all emails, regardless of whether they&#x27;re informational or job applications!<p>[1]: <a href=\"https:&#x2F;&#x2F;www.bizjournals.com&#x2F;sanfrancisco&#x2F;news&#x2F;2018&#x2F;10&#x2F;30&#x2F;fast-100-2018-10x-genomics-gene-imaging-tools.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bizjournals.com&#x2F;sanfrancisco&#x2F;news&#x2F;2018&#x2F;10&#x2F;30&#x2F;fas...</a><p>[2]: <a href=\"https:&#x2F;&#x2F;www.axios.com&#x2F;teslas-former-finance-chief-becomes-cfo-of-biotech-startup-1538754701-de3b7ce4-1af2-4500-b07d-180d5d252055.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.axios.com&#x2F;teslas-former-finance-chief-becomes-cf...</a>","time":1541111543,"type":"comment"}