{"by":"lsemel","id":18355451,"parent":18354503,"text":"Muck Rack | New York or Remote | <a href=\"https:&#x2F;&#x2F;muckrack.com\" rel=\"nofollow\">https:&#x2F;&#x2F;muckrack.com</a><p>Muck Rack is looking for a talented individual to join our fast-growing tech startup in New York. Our mission is to make journalists, PR pros and marketers more successful. Muck Rack offers tools that help media professionals find and contact the most relevant journalists for their stories, and monitor how their stories perform.<p>You’ll be working alongside the CTO and engineering team, and with product managers and designers, to execute major technical projects on Muck Rack, lead the building of new features, and help shape our engineering culture and processes.<p>Our tech stack includes Python, Django, Celery, SASS, Redis, Elasticsearch, Rabbitmq, Nginx, Gunicorn, Varnish, and Ansible.<p>You&#x27;ll be successful if you:<p>- Have significant experience working on a complex, high-traffic site, particularly at a startup or software-as-a-service company.<p>- Have extensive experience with Django, Python, and other software in our tech stack, with a willingness to learn in those areas where you have less experience.<p>- Enjoy working with and collaborating with designers, UX experts, and product managers to create outstanding features.<p>- Have experience leading other engineers to ship major features on schedule.<p>- Enjoy helping others grow as developers and become successful.<p>- Take pride in the quality of the code you write. Your code is readable, testable, and understandable six months later. You adhere to the Zen of Python.<p>- Are able to manage complexity in a large project, and incur technical debt only after considering the tradeoffs.<p>- Work well in a fast-paced development environment with testing, continuous integration and multiple daily deploys.<p>- Can work well with remote developers.<p>- Are interested in journalism, news, media or social media.<p>More info: <a href=\"https:&#x2F;&#x2F;muckrack.com&#x2F;job&#x2F;14&#x2F;senior-software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;muckrack.com&#x2F;job&#x2F;14&#x2F;senior-software-engineer</a> or email jobs@muckrack.com","time":1541088835,"type":"comment"}