{"by":"BeeswaxIO","id":18358159,"parent":18354503,"text":"Beeswax | Sr. Software Engineer (Distributed Systems) | New York, NY | Onsite<p>Beeswax is an easy to use, massive scale and high availability advertising platform founded by industry veterans who worked together at Google. We’re well funded by leading VCs, such as RRE and Foundry Group, and are rapidly expanding our customer list and our engineering team. We offer our customers the most extensible and transparent advertising system in the world and process millions of transactions per second.<p>We believe in using the right tools for the job so our products are built in a variety of languages including C++, Java, Javascript, and Python. While engineers tend to specialize in their specific domains everyone on our team needs to have a solid understanding of computing fundamentals and modern approaches to building high scale and high-quality software.<p>As our newest team member you will:\n-Design, build and own our core infrastructure for servings ads and managing bids\n-Collaborate with engineers, product managers, designers and data scientists to evolve these services to provide new experiences for our customers as well as meet our ever-growing scale\n-Do fun tasks like reviewing code, writing design docs and closing JIRA tickets<p>Ideal candidates will have:\n-5+ years of working on backend systems at strong software companies\n-Significant experience with Java, C++, Python and databases\nExperience with software architecture, performance, scaling, data modelling, and API (or apiary) design\n-An understanding of what it means to build systems at scale - if you love articles on highscalability.com you’ll fit right in\n-A strong grasp of software architecture (either through a degree or from learning it themselves)\n-An ability to think about and tackle problems analytically\nComfort in a Linux ecosystem<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;beeswax&#x2F;jobs&#x2F;683888\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;beeswax&#x2F;jobs&#x2F;683888</a>","time":1541104554,"type":"comment"}