{"by":"jakebol","id":18356866,"parent":18354503,"text":"TileDB, Inc. | Software Engineers | Cambridge, MA or REMOTE (US) | <a href=\"https:&#x2F;&#x2F;tiledb.io\" rel=\"nofollow\">https:&#x2F;&#x2F;tiledb.io</a><p>TileDB, Inc. is looking for new team members to help develop the future of big data storage. For emerging and growing fields such as genomics, earth science, imaging, and financial analysis, the volume of data is increasing and TileDB is meeting the challenge head on. Data in these areas is well represented as multidimensional dense &#x2F; sparse arrays, and the open-source TileDB data management software is a novel, cutting edge solution for array storage.<p>TileDB, Inc. is backed by Nexus Venture Partners and Intel Capital.<p>Our team combines software engineering expertise with scientific domain knowledge to develop the open-source TileDB array data management software, and we are looking for talented and motivated engineers for the following positions:<p>- Full Stack Web Developer: Production experience with Kubernetes, payment gateways, and React or Vue.js for frontend work.<p>- JVM &#x2F; Spark Engineer: Deep experience with Spark, Scala, Java, native JVM extensions &#x2F; JNI, Maven packaging and the SBT build system.<p>- Bioinformatics Software Engineer: Strong C++ skills, experience with R or Python. Genomics data engineering &#x2F; analysis with FastQ, VCF, BAM formats, bcftools, htslib, GATK, Hail.<p>Additionally interested candidates with strong C++ skills and experience developing database &#x2F; data management solutions are welcome to apply.<p>TileDB GitHub organization: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;TileDB-Inc</a><p>TileDB has been featured on HN: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=15547749</a>.<p>Our headquarters are located in Cambridge, MA. To cope efficiently with the different time zones and hiring processes, priority will be given to candidates that are located in the US, and are US citizens or permanent residents.<p>Apply at <a href=\"https:&#x2F;&#x2F;tiledb.workable.com\" rel=\"nofollow\">https:&#x2F;&#x2F;tiledb.workable.com</a> or contact us directly: careers@tiledb.io","time":1541096515,"type":"comment"}