{"by":"legothief","id":18359584,"parent":18354503,"text":"Senior Growth Data Analyst (Remote) at Drops<p>If you have a soft spot for bootstrapped, profitable companies with a meaningful product, and you want to use your data analyst &#x2F; growth skills for good, you’ll like this.<p>About us:<p>Drops’ goal is to turn language learning into a delightful game while ensuring effective learning. Our app is in the Appstore for 3 years, teaches 31 languages, was featured by both the App Store and Play Store multiple times - Editors&#x27; Choice on the Play Store - and the company is still run by the founders. We are a small, super-capable remote team mainly spread across Europe. We’re working synchronously, so time zones matter for us. We communicate via Slack, Git and Trello and have a release twice a week. We want to be the no.1 app for vocabulary learning and we are getting there quickly with our current user base of 7 million, a monthly active of &gt;800,000 and an average store rating of 4.7.<p>You can find us here: <a href=\"http:&#x2F;&#x2F;drops.app.link&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;drops.app.link&#x2F;</a><p>About you:<p>You’ll be responsible for improving the quantity, quality and reliability of the multivariant tests we run.<p>You’re a no-nonsense person, who is comfortable taking ownership of all aspects of our analytics &amp; growth funnel, who has experience in working at a product company, and who can bring us insights, initiatives and execution that will help us grow.<p>We want everyone to see the big picture: this means you already pushed your boundaries outside of the strict data realm, and are knowledgeable about mobile and web growth frameworks, ASO, SEO, best practices regarding retention and monetization.<p>We’re building a small, but super capable team. You’re naturally more interested in the fate of the product &amp; driven to grow professionally, than in managing people.<p>We are looking for a missionary rather than a mercenary.<p>Apply here: <a href=\"https:&#x2F;&#x2F;drops.workable.com&#x2F;jobs&#x2F;840725\" rel=\"nofollow\">https:&#x2F;&#x2F;drops.workable.com&#x2F;jobs&#x2F;840725</a>","time":1541116715,"type":"comment"}