{"by":"thenewwazoo","id":18355222,"parent":18354503,"text":"Zipcar | <a href=\"https:&#x2F;&#x2F;www.zipcar.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zipcar.com</a> | San Mateo, CA | ONSITE Full-time (VISA) | Firmware&#x2F;Embedded C&#x2F;C++ and Rust<p>Zipcar is the world’s largest shared-mobility company. We are expanding our engineering team at our SFBA office in San Mateo, and we are looking for passionate, innovative people to help develop our next-generation telematics platform, and keep tens of thousands of in-the-field devices humming. Best of all, you can push the state of the art while you do it with Rust!<p>We are in the early stages of a green-field redesign of our in-car telematics platform, and are making a big play to write the firmware in Rust. We have support from upper management to open-source what we can (a sampling of the repos is here[1]), and are legitimately pushing the cutting edge of what&#x27;s achievable. It&#x27;s _incredibly_ exciting, and you can join us in building first-of-their-kind secure IoT devices. Beacuse it&#x27;s a new and growing language, we&#x27;re also realistic about letting our people grow into Rust expertise, and value flexibility over resume bullet points.<p>The rest of our stack is bare metal C on PIC and RTOS C++ on ARM, with Java on the server&#x2F;data ingestion side, so you&#x27;ll need to be at-least-conversant all the way up the stack. When we say &quot;full stack&quot;, we mean it! :)<p>What will you be doing it for? Building connected-car technology for multiple product lines, including Zipcar and Avis. By putting our massive fleets behind an API, we are aiming to be the AWS of transportation.<p>Example of our connected car work for Avis: <a href=\"https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-avis-budget-grp-tech-kansascity&#x2F;avis-tests-fully-connected-wireless-car-fleet-in-kansas-city-idUSKBN1DU0IE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.reuters.com&#x2F;article&#x2F;us-avis-budget-grp-tech-kans...</a><p>Overview of our partnership with Waymo: <a href=\"https:&#x2F;&#x2F;www.theverge.com&#x2F;2018&#x2F;8&#x2F;21&#x2F;17762326&#x2F;waymo-self-driving-ride-hail-fleet-management\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theverge.com&#x2F;2018&#x2F;8&#x2F;21&#x2F;17762326&#x2F;waymo-self-drivi...</a><p>News about our partnership with Lyft: <a href=\"https:&#x2F;&#x2F;money.cnn.com&#x2F;2018&#x2F;08&#x2F;06&#x2F;investing&#x2F;avis-budget-lyft-partnership&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;money.cnn.com&#x2F;2018&#x2F;08&#x2F;06&#x2F;investing&#x2F;avis-budget-lyft-...</a><p>Mission-driven. Small team. Flexible working conditions. No worries about funding. :)<p>I have never been happier at a job; this place is great. I build solutions that breathless news articles (still!) talk about happening in the future. I help to move the state of the art in embedded Rust. I&#x27;d be one of your peers, and I&#x27;m happy to answer questions off-the-record (hn profile address) or on (bmatthews!zipcar,com)<p>[1] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;thenewwazoo?utf8=%E2%9C%93&amp;tab=repositories&amp;q=&amp;type=source&amp;language=rust\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;thenewwazoo?utf8=%E2%9C%93&amp;tab=repositori...</a>","time":1541087780,"type":"comment"}