{"by":"xeonoex","id":18357151,"kids":[18370983],"parent":18354503,"text":"UiPath | Multiple Positions | NYC, Houston, DC, more across the globe.<p>We started small, in 2005, with a handful of developers driven by an enduring ambition to build the best technology they possibly could. We had our ups and downs, of course, but we got through everything and learned from each experience.<p>We are now a “unicorn” company, born in Romania, reaching a global footprint. We remain humble and embrace everything that brought us to where we are today. It’s this encouragement to try - without fearing failure - that has built a best-in-class platform which exceeds the expectations and demands of our customers.<p>Today, we take pride in being the most widely used RPA platform in the world and the largest RPA developer community ready to make an impact on the world. We are aware that making information available means keeping the fast pace and opening the door to next challenges, so part of our product is open-use.<p>We are a global team of bright people who want to thrive in an environment of flexibility and ownership. We are not afraid to take risks and challenge the status quo, transforming the way we look at work today.<p>Our ethos is to create an environment where you can be completely authentic and free to speak your mind, while creating products we are all proud of. Our projects aim to have a worldwide impact and for that we value the trustworthy work relationships one can build. A healthy flow of smart ideas can ensure further leaps ahead.<p>At UiPath, you have the possibility to disrupt the world of automation, working with passionate people around the world.<p>We have an excellent culture and offer competitive salary and great benefits.<p>You can view our job openings here:<p><a href=\"https:&#x2F;&#x2F;www.uipath.com&#x2F;company&#x2F;jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uipath.com&#x2F;company&#x2F;jobs</a><p>But please message me and I will get your resume in the right hands. :)","time":1541098239,"type":"comment"}