{"by":"paladin314159","id":18357134,"parent":18354503,"text":"Amplitude Analytics | San Francisco, CA (SOMA) | <a href=\"https:&#x2F;&#x2F;www.amplitude.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amplitude.com</a> | ONSITE<p>We help companies build better products by providing analytics for understanding user behavior. We believe that the future of product development is in smart, easy-to-use analytics that helps you make good decisions and invest in the right areas. We&#x27;re a 200-person company (30 engineers), and we raised our Series C last summer. We&#x27;ve gotten incredible traction helping customers like Square, Capital One, Dropbox, Twitter, Twitch, and Adidas change the way they build products. We were recognized in Wealthfront&#x27;s Career-Launching Companies (<a href=\"https:&#x2F;&#x2F;blog.wealthfront.com&#x2F;2018-wealthfront-career-launching-companies-list&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.wealthfront.com&#x2F;2018-wealthfront-career-launchi...</a>) and Forbes&#x27; Next Billion-Dollar Startups (<a href=\"https:&#x2F;&#x2F;www.forbes.com&#x2F;next-billion-dollar-startups&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.forbes.com&#x2F;next-billion-dollar-startups&#x2F;</a>).<p>We have many open positions that can be found here (we&#x27;re growing fast!): <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;amplitude\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;amplitude</a>. In particular, we&#x27;re looking to expand the engineering team with the following positions:<p>* Senior Product Engineer<p>* Senior Software Engineer, DevOps<p>* Senior Software Engineer, DevSecOps<p>* Senior Data Scientist - Causal Inference<p>Our tech stack consists of Java, Python, Redis, Kafka, PostgreSQL, Elasticsearch, Docker, SaltStack on the backend and JavaScript, React, Flux, Highcharts, d3 on the frontend. We&#x27;ve got a number of challenging technical problems to solve thanks to being in the analytics space, and we&#x27;re looking for people who are passionate about the intersection of technology and product to help us take the next step. You can find more examples of the work we do on our blog: <a href=\"https:&#x2F;&#x2F;amplitude.engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;amplitude.engineering&#x2F;</a><p>Also, we don&#x27;t do whiteboard interviews! Bring your laptop, and be prepared to write code the way you expect to on the job -- in a familiar working environment with access to the internet. If this sounds exciting to you, please reach out to us at careers@amplitude.com or apply directly through <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;amplitude\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;amplitude</a>.","time":1541098132,"type":"comment"}