{"by":"johnumbaugh","id":18356348,"parent":18354503,"text":"CareEvolution | Healthcare Software Developers | Ann Arbor, MI | REMOTE OR ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a><p>Note: this job is open to US Residents only.  Foreign nationals can apply but only if you live within the US.<p>What CareEvolution does actually matters. Our HIEBus software platform helps patients attain better health outcomes.<p>We are looking for software developers to help build out our platform, to author realtime healthcare data adapters to ingress data from hundreds of data sources, to craft the next generation of healthcare apps, and to be technical sherpas helping customers connect to us.<p>We are an intentionally small, flat organization.  A big part of your work at CareEvolution is figuring out, for yourself (but with our help), what are the most important things to work on.  We&#x27;ve designed our organization to promote creativity, innovation, and focus on solving some of the hardest challenges in healthcare.<p>We&#x27;d love to talk to you if you&#x27;re passionate about this domain, and we&#x27;re especially interested in chatting with you if have experience with healthcare technologies like CDA&#x2F;CCD&#x2F;CCDA, PIX, XDS, XCPD, XCA, XDR, HL7, and FHIR.<p>* <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;about&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;about&#x2F;</a><p>* <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;careers&#x2F;</a><p>* <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;workplace&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;workplace&#x2F;</a><p>Submit resumes to resume@careevolution.com<p>We also invite everyone to build a sample application against our FHIR endpoint.  This small project will give you a taste of what we do at CareEvolution, and will let you demonstrate your skills in a very concrete and relevant way.  We want to stress that doing the challenge is optional, and your hiring chances will not be adversely affected if you elect not to participate.  Work&#x2F;life fusion is a core value at CareEvolution, and we respect that life circumstances may prevent even awesome candidates from tackling something like this outside of working hours.  We just think it’s a fun way for you to get to know us, and vice-versa.<p>If you are interested in building a FHIR app against our endpoint, here are some useful links:<p>* FHIR info page: <a href=\"https:&#x2F;&#x2F;fhir.careevolution.com&#x2F;Master.Adapter1.WebClient&#x2F;fhir\" rel=\"nofollow\">https:&#x2F;&#x2F;fhir.careevolution.com&#x2F;Master.Adapter1.WebClient&#x2F;fhi...</a><p>* Documentation: <a href=\"http:&#x2F;&#x2F;fhir.docs.careevolution.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fhir.docs.careevolution.com&#x2F;</a><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.","time":1541093538,"type":"comment"}