{"by":"pixelmonkey","id":18355462,"parent":18354503,"text":"Parse.ly | Growth &amp; Data Lead | Remote | Fully Distributed Team | <a href=\"https:&#x2F;&#x2F;parse.ly\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly</a><p>Parse.ly is the web&#x27;s attention engine. As a measurement layer running across the web, Parse.ly quantifies how visitors respond to online content. Our products are then used by the web&#x27;s biggest brands and publishers to understand audience attention across the internet in real-time. Our flagship product is Parse.ly Analytics (<a href=\"https:&#x2F;&#x2F;parse.ly&#x2F;analytics\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly&#x2F;analytics</a>), and is already used by over 400 enterprise customers (<a href=\"https:&#x2F;&#x2F;parse.ly&#x2F;customers\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly&#x2F;customers</a>).<p>But, Parse.ly is just getting started. We just launched Parse.ly Currents (<a href=\"https:&#x2F;&#x2F;parse.ly&#x2F;currents\" rel=\"nofollow\">https:&#x2F;&#x2F;parse.ly&#x2F;currents</a>), a new product that helps people understand internet-wide trends and how content&#x2F;attention flows online.<p>As the Growth &amp; Data Lead for Parse.ly, you&#x27;re someone who loves data, growth, and marketing, and you want to take a B2B software company out of its successful niche and across the chasm into the broader market. You are comfortable with remote &amp; fully distributed teams. To excel here, you&#x27;ll work with designers and web developers as collaborators, and be able to leverage data-oriented growth marketing strategies, such as launching search engine optimized public products built atop Parse.ly&#x27;s data, or important sharing features in our existing sites and products.<p>You are the kind of person who&#x27;d enjoy the books &quot;Hacking Growth&quot;, &quot;Traction&quot;, &quot;Four Steps to the Epiphany&quot;, and &quot;High Growth Handbook&quot;. For bonus points, you also care about SaaS enterprise sales. For example, you are the kind of person who enjoyed Dan Pink’s &quot;To Sell is Human&quot;.<p>In this role, you&#x27;d run a small team of designers and developers that owns the core experience of Parse.ly’s public website, technical documentation, knowledge base, emails&#x2F;newsletters, data studies, and blog. You&#x27;ll have an opportunity to ship new features to any of these projects, with a goal of growing sign-ups (and customers) for these products. From a technical standpoint, you&#x27;ll be data savvy, know some SQL, and be comfortable working with designers&#x2F;developers, who themselves are comfortable with a modern JavaScript and Python development stack. You&#x27;ll also use analytics tools like Google Analytics, MixPanel and yes, even, Parse.ly itself, to understand engagement of our visitors, and to position us for more growth in new channels like organic search, social sharing, data-driven press, and free (self-service) data products.<p>If you&#x27;re someone who loves data, growth, and marketing, this job is for you. If you are a former startup founder seeking to relocate to an established startup, but want to continue the path of deploying lean growth techniques, this role may be especially suited for you.<p>Apply here:<p>Email work@parsely.com with a couple paras describing why you&#x27;re interested, a link to any portfolio&#x2F;projects you think may be relevant, and&#x2F;or your resume or LinkedIn profile. Make sure to mention HN and the &quot;Growth &amp; Data Lead&quot; role. Also, please list your timezone, working hours, and location. Note that though we can hire from most locations, we will prioritize those near US&#x2F;Eastern timezone, due to the timezone makeup of this team.<p>^ A note on our fully distributed team. The mission of our lean distributed team is described here: <a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission</a>. We happily skip commutes by working out of our ergonomic home offices. We expect you to be comfortable with this setup, and collaborating with people primarily over Zoom&#x2F;GMeet, GitHub, Slack, and email. The cool thing is, this lets you set up your ideal work environment; here&#x27;s a photograph of mine running two full-screen Parse.ly Analytics dashboards on my monitors: <a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a>.","time":1541088882,"type":"comment"}