{"by":"chrstphrhrt","id":18358950,"kids":[18373219],"parent":18354503,"text":"OpenMessage | Senior Software Engineers | <a href=\"https:&#x2F;&#x2F;openmessage.io\" rel=\"nofollow\">https:&#x2F;&#x2F;openmessage.io</a> | NYC | Full-time | ONSITE or REMOTE if willing to relocate to NYC | $90-$130k + 0.1-2.5%<p>Hello fellow engineers and future teammates,<p>We are making advances in the field of applied conversational experiences for messaging. Our platform implements true mixed-initiative dialog, which is not possible with stock AI frameworks or services. Being able to fuse realistic human-like conversation design (&quot;character&quot;) and NLP&#x2F;ML with the ubiquity of SMS&#x2F;MMS (and RCS&#x2F;Business Chat soon) is why I personally get out of bed in the morning as an engineer at OM.<p>It&#x27;s also nice that goal-oriented conversations are like little conversion funnels, which makes for deeply meaningful metrics. If you&#x27;re into analytics, this is the lifeblood of our prioritization and decision making so there is a lot of interesting and impactful stuff to do there.<p>If you&#x27;re into massive scaling and operations, we are currently humming along at hundreds of messages per second and have a roadmap to get to millions in the next few months. We need your help to get there.<p>For the design-inclined, one of our major features is the conversational composer frontend with previews&#x2F;canvas drawing etc. that will evolve according to what the messaging channels can support in terms of content types and interaction. Messages are personalized in different ways.<p>We are hooking commerce functionality into the conversations as well. Buying products this way is a lot of fun as a user. Thanks to our design, we can kick off any kind of API calls as a natural part of the conversation without adding complexity to the codebase.<p>Our current tooling is a mix of Python, Node, PostgreSQL, Redis, Elasticsearch, and Docker. We are exploring Go for some things and prefer smaller abstractions, less frameworks, minimal dependencies, and leveraging purpose-built components. We value orthogonality and safety as design principles. Creativity is best applied to data structures and decoupling.<p>We are strongly motivated by inclusiveness of all genders, faiths, origins and backgrounds and are careful about ensuring a harmonious and respectful team culture with space for every voice and safety in mutual vulnerability. We value work life balance, boundaries, and privacy as well. No jerks or brogrammers, but freaks and geeks are always welcome!<p>There is a small code challenge that checks for data manipulation techniques. No silly puzzles or whiteboarding. Existing open source code can be submitted as an alternative if applicable.<p>Email me at chris@openmessage.io to set up a call. Thanks!","time":1541110455,"type":"comment"}