{"by":"cleblanc","id":18354819,"parent":18354503,"text":"Arthrex | Senior DevOps Engineer | Remote<p>We are looking for a talented and passionate Senior DevOps Engineer who wants to make an impact in the medical space. With over 35 years of experience in the orthopedic industry, Arthrex is dedicated to providing safe and reproducible solutions for health care professionals. This is an opportunity to make an immediate and lasting impact on the processes and infrastructure that power our software development team.<p>We write our applications in a wide range of languages such as Go, Ruby and do mobile development for both iOS and Android. As a DevOps Engineer, you would be working alongside other engineers to design tools that assist in the development of applications, but also allow development teams to deploy and run their applications in production. We use tools such as Amazon Web Services, Docker, CircleCI, Datadog, GitHub and much more. You&#x27;ll work closely with the development teams to make sure that you&#x27;re providing the best possible platform to make their products successful.<p>Quality is of utmost importance to Arthrex and should therefore be important to applicants. Our software developers follow coding best practices, champion standards, and always push themselves and others for continuous improvement in everything they do. We are looking for a true team player who likes to work in a co-located team environment where cross-functional collaboration is highly valued. We invest in our team members and provide an environment where everyone feels challenged and can grow professionally. We are looking for professionals who are ready to have a long-term career perspective, feel fulfilled by the work they are doing, and contribute to our mission of Helping Surgeons Treat Their Patients Better™.<p>About You:\nPassionate about software development\nStrive for continuous improvement in everything you do\nHas a track record of building infrastructure in a cloud environment and successfully running production applications\nThrive in a co-located team environment where cross-functional collaboration is highly valued\nFollow coding best practices, champion standards, and always strive for continuous improvement in everything you do\nLooking to join a company that will invest in your professional growth<p>Strong knowledge and experience with Linux server administration<p>Experience with AWS VPC, EC2, ECS, RDS, and beyond.<p>Experience with automation tools<p>Experience with Docker<p>Experience with logging and performance monitoring<p>Strong knowledge and experience with POSIX shell scripting (e.g. Bash) and other languages such as Ruby and Python\nExperience with relational databases such as PostgreSQL\nComfortable using Git<p>Enjoy two conferences per year, and ~4 trips to the Naples FL HQ, with 100$ meal budget while away from home.<p>Send your resume to cleblanc@arthrex.com","time":1541085983,"type":"comment"}