{"by":"agotterer","id":18356439,"parent":18354503,"text":"Common | Senior Software Engineer, Senior Frontend Engineer, Engineering Manager | New York City, NY | Full-time | Onsite<p>Common is a technology-driven property manager building a better shared housing experience. More Americans than ever are living with roommates. We keep the good parts of shared housing while removing the annoyances. Being a Common member means never having to worry about cleaning, moving furniture, or splitting the bills. Common members know their neighbors, meet new people, and save money. We currently operate coliving and traditional apartments in New York City, Chicago, San Francisco, Seattle, Washington, D.C., and have new cities opening soon.<p>On the tech side we are on a mission to create software that delights our members through community and access to services that enrich the living experience. In additional to the technology we provide our members, we are also building technology to scale property management, operations, and logistics for our internal stakeholders. Our digital product charter is to build software to support the next 100,000 members living in Common.<p>Common was founded by General Assembly co-founder Brad Hargreaves and has raised over $65MM in venture funding.<p>I&#x27;m hiring for multiple positions and would love to chat if you are interested in our mission:<p>Senior Software Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common&#x2F;jobs&#x2F;4114701002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common&#x2F;jobs&#x2F;4114701002</a><p>Senior Frontend Engineer: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common&#x2F;jobs&#x2F;4114729002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common&#x2F;jobs&#x2F;4114729002</a><p>Engineering Manager: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common&#x2F;jobs&#x2F;4114710002\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common&#x2F;jobs&#x2F;4114710002</a><p>All Open roles: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;common</a>","time":1541094047,"type":"comment"}