{"by":"g-clef","id":18354656,"parent":18354503,"text":"King &amp; Union | Python developer | Washington, DC | ONSITE + HOME FULL-TIME<p>The point: We are an information security&#x2F;threat intelligence company. Our goal is to make the threat intelligence process run more smoothly and help organizations share threat data better. Our solution pulls threat information (both our own and via external APIs) into a graph (visual and graph db) and enables real-time collaboration and sharing of the information on the graph. (If you&#x27;re aware of the tools, think of combining Google docs with a graph editor like Maltego and mix in some process automation.)<p>What we&#x27;re looking for: We&#x27;re looking for a mid&#x2F;advanced back-end developer for the back-end of our web-based application. Security experience isn&#x27;t needed, we&#x27;ve got that covered already. Our backend is built with Django&#x2F;Django Channels&#x2F;Redis. Our UI connects to the backend with a mix of REST and WebSockets (we&#x27;re using websockets for real-time collaboration work). Ideally, the person we&#x27;re looking for would be comfortable doing both the Python and Django side of things as well as some command line work (we have a data repository that we also maintain). We will also be working on designing and implementing a (possibly quite large) graph DB in the near future.<p>Perks of the job: early round shares, competitive salary, 401k, &amp; healthcare benefits. Also, we work from home a lot and our focus is on getting the work done, not on attendance or face time.<p>A bit about us: We are a pre-A-round startup. We have a working product and paying customers, so we&#x27;re in a good spot financially. We are based in Alexandria, VA but do a lot of working from home, and tend to meet up in Alexandria once a week or so. We have staff doing some of these roles already but we&#x27;re looking to accelerate our pace.<p>We encourage all who are interested to contact us. You can reach me at: aaron@kingandunion.com","time":1541085129,"type":"comment"}