{"by":"eastbaydev","id":18359749,"parent":18354503,"text":"Storj Labs | Sr. Software Engineer, Senior Technical Writer, UX Survey Panelists | Atlanta, GA. Salt Lake City, UT| Full-time | REMOTE<p>* Technical Writer: Salt Lake City or Atlanta\n* Senior Software Engineer, backend: Alanta\n* Sr. Technical Writer: SLC<p>Also seeking\n* Engineers to answer survey questions about their usage of cloud object storage. <a href=\"https:&#x2F;&#x2F;atikhbana.typeform.com&#x2F;to&#x2F;iKVvGB\" rel=\"nofollow\">https:&#x2F;&#x2F;atikhbana.typeform.com&#x2F;to&#x2F;iKVvGB</a>\n(not a full-time job, just me doing a solid for our UX designer by throwing it in ;-D there is compensation though, and it only takes about an hour of your time. We&#x27;ll mail you a PDF of our findings as well. )<p>Storj develops an open-source, decentralized cloud storage platform called Storj (pronounced storage) that is disrupting the cloud storage market. Rather than storing files in a data center, Storj works by encrypting and partitioning files, then sending the shards to a network of devices contributed by our global community—with active storage nodes on every continent except Antarctica. We rent unused hard drive space from users all over the globe, operating active storage nodes on every continent (except Antarctica). Our core target is selling to software developers and channel partners who get higher quality, privacy, and security at 1&#x2F;6th the price. We are laying the groundwork for the future of decentralization and web 3.0.<p>Headquartered in Atlanta, Storj is a global company with North American employees in California, Washington, Utah, Michigan, and Georgia, and European employees in Germany and Bulgaria.<p>Most of our engineering team sits in Atlanta, where the company was founded. We&#x27;re in the Atlanta Tech Village, Buckhead. The bulk of our marketing team is in our downtown Salt Lake City office at the Impact Hub co-office building located at 150 S. State Street.<p>Apply for research slots here: <a href=\"https:&#x2F;&#x2F;atikhbana.typeform.com&#x2F;to&#x2F;iKVvGB\" rel=\"nofollow\">https:&#x2F;&#x2F;atikhbana.typeform.com&#x2F;to&#x2F;iKVvGB</a><p>Apply for full-time openings here: <a href=\"https:&#x2F;&#x2F;www.storj.io&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.storj.io&#x2F;careers</a>","time":1541118282,"type":"comment"}