{"by":"gabeh","id":18356834,"parent":18354503,"text":"Havenly (<a href=\"https:&#x2F;&#x2F;havenly.com\" rel=\"nofollow\">https:&#x2F;&#x2F;havenly.com</a>) | Software Engineers and DevOps | Denver, CO and REMOTE | Full-time<p>Havenly provides interior design services, all online, at an extremely accessible price point. For a flat fee starting from $79, we set you up with your own personal interior designer, matched exclusively to your style, who works with you virtually to decorate your room. You can purchase any of the products your designer suggests for you through us, all in one place, at the best price. We deliver your room to your door.<p>We are a personalization layer over the furniture e-commerce experience. We take the customer&#x27;s style and inspiration data to help designers design the space, and we continue to provide customized suggestions for products to spruce up their space. We&#x27;re the easiest way to decorate your home.<p>This is an exciting time at Havenly, our tech team is growing rapidly and I&#x27;m looking to augment the team with senior technologists who have been successful in scaling consumer products! I&#x27;m looking for full-stack engineers, engineers passionate about managing reasonably large amounts of heterogeneous ecomm data (10M+ SKUs from 400+ retailers) and systems engineers who like their infrastructure as code.<p>I&#x27;m looking for people who want to make a big impact in an environment free of BS and focused on outcomes. Good fits in the product development team tend to crave ownership over their area of the product and prefer not to just be told what code to write. Productive cross function collaboration with product, design, marketing, and business operations should be something that excites you. We do not shy away from our desire to set a very high bar when it comes to who we hire onto our team.<p>Stack: AWS, PHP, React, iOS&#x2F;Swift<p>If this sounds interesting to you, please introduce yourself: gabe@havenly.com","time":1541096341,"type":"comment"}