{"by":"victorquinn","id":18355228,"parent":18354503,"text":"# HackerNews Post\t\nKnotel | multiple positions | New York, NY | onsite | Full-time | <a href=\"https:&#x2F;&#x2F;knotel.com\" rel=\"nofollow\">https:&#x2F;&#x2F;knotel.com</a><p>Knotel is a fast growing commercial real estate startup that is inventing new ways to get things done in a traditional industry. Led by veteran founders, Knotel creates custom headquarters for companies without any of the headaches. Whether for 20 or 500 people, for 6 months or 6 years, Knotel provides businesses the flexibility and design they need in office space so they can focus on their work.<p>Most companies no longer maintain their own server hardware because AWS offers more flexibility and obviates the need to have hardware on-site and IT folks managing and maintaining uptime. At Knotel we think we can provide something similar for office space -- allowing companies to have the ability to scale up and down like cloud servers and freeing them from the responsibility of managing space by having to find people to take over their long leases, do space build outs, hiring their own with facilities management, etc.<p>As a result, we have a ton of interesting tech challenges all up and down the stack. We are working on a canonical data model for storing all of the information on spaces so we can increase operational efficiency and transparency across the company. We are building internal tools to increase our efficiency as a company. We are rolling out a data pipeline and ensuring all data flows into our data warehouse so everyone across the company can report on their key metrics. We are integrating with hardware in the physical space to track information like usage, temperature, and we are figuring out solutions for smart access control. We&#x27;re looking to use computer vision to understand office utilization and flow within the office.<p>In brief, we have a ton of interesting problems to solve.<p>We&#x27;re growing our engineering team in NYC significantly, starting with some key roles.<p>Today we&#x27;re hiring a whole bunch of roles:<p>- Lead Full Stack Engineer <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;91ad31da1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;91ad31da1</a>\n- Data Engineer <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;d5c41fd31\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;d5c41fd31</a>\n- Senior DevOps Engineer <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;e43371b81\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;e43371b81</a>\n- Full Stack Engineers <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;a0d117a21\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;a0d117a21</a><p>Any questions, feel free to email me victor [at] knotel dot com","time":1541087784,"type":"comment"}