{"by":"haircuttedfreak","id":18354938,"parent":18354503,"text":"Bungalo | Senior Full Stack Developer, Full Stack Developer, Data Engineer | Austin, TX | Full time | ONSITE | <a href=\"https:&#x2F;&#x2F;bungalohomes.com\" rel=\"nofollow\">https:&#x2F;&#x2F;bungalohomes.com</a><p><a href=\"http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;</a><p>Bungalo is looking for Full Stack Developers to help build the Bungalo website, backend, and mobile apps. You will work on creating new features for <a href=\"https:&#x2F;&#x2F;bungalohomes.com\" rel=\"nofollow\">https:&#x2F;&#x2F;bungalohomes.com</a> and other internal applications that make Bungalo go. We are also building mobile apps using React Native. You will work with our design, product, and marketing teams to architect, implement, and ship high quality products.<p>We are also looking for a Data Engineer to tackle complex business problems by collecting raw data and converting it into meaningful and actionable insights. You will work to build our data warehouse and pipelines and use BI tools to create reports and visualizations. You will collaborate with all departments to architectect, implement, and ship high quality data products.<p>Bungalo is a new venture that provides consumers with an all-in-one home buying experience, guiding them through every step of the process. We are building a consumer brand whose goal is to change the way homes are bought and sold.  Bungalo Engineering is doing some interesting stuff. We are building a modern backend on cloud infrastructure. The website and other internal tools are built with React.js, REST APIs, and document databases. Our iOS and Android apps will be the command center for customer’s home shopping experience. And finally, our BI and data science team will work to optimize every step of the Bungalo home buying and selling process.<p>We are a small, fast growing team and you’ll have the opportunity to help shape the culture and how we build software. We are looking for engineers that like to move fast and work with a sense of urgency. We take pride in our team and our work.<p>Senior Full Stack Developer <a href=\"http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;p&#x2F;1256c764e513-senior-full-stack-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;p&#x2F;1256c764e513-senior-full-s...</a>\nFull Stack Developer <a href=\"http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;p&#x2F;8f0be63b18d8-full-stack-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;p&#x2F;8f0be63b18d8-full-stack-de...</a>\nData Engineer <a href=\"http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;p&#x2F;fb5d039e961f-data-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.bungalohomes.com&#x2F;p&#x2F;fb5d039e961f-data-engineer</a>","time":1541086580,"type":"comment"}