{"by":"johnpjoseph","id":18356394,"kids":[18357529],"parent":18354503,"text":"At Ondaka we’re all about visual, industrial, intelligence. Our mission is to help our heavy industry &amp; critical infrastructure customers access mission-critical information quickly and efficiently by building intensely visual data management tools and services that empower them.<p>Why Ondaka:<p>Our Bay area team (Berkeley, Cornell, Queen’s &amp; Yale) is developing the next generation of industrial SaaS products that will help everyone from riggers and roughnecks to engineers and executives improve safety and increase profitability at critical infrastructure sites the world over. Using the techno magic of photogrammetry, our platform serves up hyper-realistic representations of sites and equipment as-built and layers them with contextually relevant information. If you’ve never gotten over your childhood love of big machines doing big jobs, but are mature enough to recognize the value that big data brings to this equation, you should drop what you’re doing right now and apply. Having a baby? Text us between contractions! We all have kids and we can help…PUSH! Interviewing for another job? Stand up and walk out, we’re better! Robbing a bank? Call the cops and turn yourself in, seriously what were you thinking?<p>What we&#x27;re looking for:<p>Backend Developer (Node.js &amp; MongoDB) (Onsite): <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;ondaka&#x2F;jobs&#x2F;427679-backend-developer-node-js-mongodb\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;ondaka&#x2F;jobs&#x2F;427679-backend-developer-node-j...</a><p>iOS Developer (Onsite): <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;ondaka&#x2F;jobs&#x2F;427683-ios-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;ondaka&#x2F;jobs&#x2F;427683-ios-developer</a><p>Computer Vision &#x2F; Machine Learning Engineer (Onsite&#x2F;Toronto&#x2F;Remote): <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;ondaka&#x2F;jobs&#x2F;427693-computer-vision-machine-learning-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;ondaka&#x2F;jobs&#x2F;427693-computer-vision-machine-...</a>","time":1541093759,"type":"comment"}