{"by":"cardine","id":18355538,"parent":18354503,"text":"Cortx | Senior Full Stack Software Engineer, Software Engineer (Artificial Intelligence Focus) | Baltimore, Maryland | Full Time, Onsite <a href=\"http:&#x2F;&#x2F;cortx.com\" rel=\"nofollow\">http:&#x2F;&#x2F;cortx.com</a><p>Cortx is a small, fast-growing, and profitable natural language processing startup located in Baltimore, Maryland. Cortx sits at the intersection of research and business - we take cutting-edge research and transform it into high-impact products which are mainly sold using a SaaS model. Some example products we are working on include:<p>- A newspaper comprised entirely of robot authors<p>- A marketing consultant that uses AI to provide actionable advice to clients<p>- A machine proofreader that automatically corrects bad grammar<p>The current business we are building is Perfect Tense (<a href=\"https:&#x2F;&#x2F;www.perfecttense.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.perfecttense.com</a>). Perfect Tense allows webmasters to add grammar correction to their website with a single line of code.<p>As an AI focused Software Engineer you will improve our grammar corrector&#x27;s ability to detect and correct different and complex grammar mistakes, both with deep learning models and more traditional approaches. You will be primarily working with Scala and Python (TensorFlow).<p>As a Senior Full Stack Software Engineer you will lead the Full Stack team that is building the grammar correction interface. You will be working across the entire Ruby on Rails + React stack, and will be heavily exposed to all of the AI&#x2F;NLP work being done.<p>Our interview process involves a quick coding screen, a more intensive Skype interview, and a final onsite interview.<p>You can see more info here <a href=\"http:&#x2F;&#x2F;cortx.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cortx.com&#x2F;careers&#x2F;</a> or you can contact us at jobsatcortxdotcom - make sure to mention that you found us on HN!","time":1541089201,"type":"comment"}