{"by":"ishwarn","id":18355666,"parent":18354503,"text":"Abl Schools | Multiple positions (engineering, data science) | San Francisco |Full-time | ONSITE | www.ablschools.com<p>Technology has made the world more connected, fundamentally changing how we live, work and interact; yet traditional schools have not evolved to prepare students for the 21st century. Replacing textbooks with tablets won’t be enough. We believe schools need a new foundation. That’s why we’re building a web-based school scheduling platform, that allows administrators to put master schedules and daily calendars into a single cloud-based system. We are creating the next generation of software for all K12 schools to fundamentally change how they design, measure and improve their schools. We are also a company that deeply values diversity in every way.<p>View openings, including sales, engineering, customer success, and design on our site: <a href=\"https:&#x2F;&#x2F;ablschools.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ablschools.com&#x2F;careers&#x2F;</a><p>--------------------------------------------------<p>Personal note: I&#x27;ve been on the Abl engineering team for a little over a year and I love it. The mission and the team make coming into work _awesome_. We have a diverse team, we&#x27;re well funded, we have experienced leadership... I could go on. The interview process is, in my opinion, very fair. You won&#x27;t be asked to white board and we understand that the process is just as much the candidate getting to know the company as it is the other way around.<p>If you have any questions, feel free to reach out to me - my contact info is in my profile.<p>--------------------------------------------------<p>Sr. Data Scientist:<p>The Role<p>We are looking for an experienced Data Scientist, and in this role, you will help schools understand the impact operational changes have on their students and staff. You’ll collaborate with a team of product designers, engineers, and school leaders to build software features that help schools overcome complex logistical challenges.<p>As a Data Scientist at Abl, your work will immediately improve equity in and operations of schools across the country. You will collaborate with product designers to determine what to build and prototype, with engineers to deploy software into production use, and with our schools team to provide decision support for K12 principals who are implementing novel solutions to complex scheduling problems.<p>Recent data science projects include:<p>Defining and calculating measures of inequity for students within a school schedule\nBuilding recommendations for course placement in a schedule\nProposing and prototyping algorithms for supporting team teaching best practices\nDeveloping metrics and visualizations for student tracking<p>The Team<p>Our product research and development team is small, passionate, and inclusive. You will be the second Data Scientist at Abl and will work across the product and business.<p>As a data team, our goal is to produce software and insights that are proactive, guiding our peers and school leaders towards the right thing to do next, rather than taking a reactive view or simply describing what has been done. For the current stage of our business, our domain, and our customers, we have found that a bias towards reproducible, and more easily interpretable models and metrics is more useful than attempting to ruthlessly optimize an algorithm.<p>Responsibilities<p>+ Build underlying systems that power our data-driven products (e.g., recommendation engines, constraint solvers, and predictive models)<p>+ Consult directly with school leaders to work on complex problems within Abl’s product using your research and rapid prototyping skills to push new features into production<p>+ Perform data profiling, complex sampling, and statistical modeling<p>+ Design and develop tailored data models for K12 schools<p>+ Identify incomplete data, improve the quality of data, and integrate data from several data sources<p>+ Work on the challenge of combining data from across schools and districts, who all store things differently, so that we can measure our impact in aggregate<p>+ Determine how to evaluate equity, or fairness, for students and for teachers<p>+ Propose metrics for evaluating the overall quality of a schedule and methods for comparing multiple schedules’ ability to meet school leader priorities<p>+ Find trends and insights in complex, human-generated school data<p>Qualifications<p>+ Strong programming skills (e.g., Python, R, and&#x2F;or JavaScript)<p>+ Proficiency in writing SQL queries<p>+ Ability and desire to present complex findings in a simple, approachable way for non-technical audiences (e.g., in writing, through reporting tools, and at in-person presentations)<p>+ Experience with cleaning, structuring, and transforming data via ETL processes<p>+ Ability to design and deploy machine learning algorithms and models<p>--------------------------------------------------<p>Sr. Front-End Engineer:<p>Your Impact<p>+ Work collaboratively with the Product and Design team to understand the experiences and pain points of schools, teachers, and students<p>+ Define and build compelling new products and exciting new features that give educators insights that will enable them to optimize how they use their resources<p>+ Use your extensive knowledge of front-end technologies to build high-quality designs that are scalable<p>+ Manage code review, increase performance, and communicate best front-end engineering practices<p>+ Create a first of its kind interface that will progress K-12 schools and their communities<p>Qualifications<p>+ Experience with Javascript frameworks such as React, Backbone, Angular etc.<p>+ You should have a great feel for user experience and an eye for beautiful designs<p>+ Bring a deep understanding of best practices in design, optimization, interaction, and usability<p>+ Familiarity with the whole web stack, including protocols and web server optimization techniques<p>--------------------------------------------------<p>Sr. Backend Engineer<p>Qualifications<p>+ B.S. degree in computer science or equivalent work experience<p>+ Strong fundamentals in algorithms, data structures, and software engineering<p>+ Familiarity with server-side frameworks like Ruby on Rails<p>+ Experience building large scale distributed systems and networked services<p>Your Impact<p>+ Help set the direction of our company and product<p>+ Measurably improve student outcomes<p>+ Improve the lives of teachers<p>+ Help spread new, innovative school models<p>+ Give schools greater visibility into how they use their time and resources, enabling them to better support their students and teachers<p>--------------------------------------------------","time":1541089813,"type":"comment"}