{"by":"laurynas","id":18361869,"parent":18354503,"text":"GOM | Braunschweig, Germany (ONSITE) | Full-time | VISA* | Senior Backend, Junior-Mid Backend&#x2F;Frontend |<p>*Visa may be an option but the candidate would have to exceed expectations<p>Here at GOM (<a href=\"https:&#x2F;&#x2F;www.gom.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.gom.com&#x2F;</a>) we develop software and hardware for metrology (measuring things very precisely with the use of cameras and lasers)\nOur software is sold as a package that our customers can use in their environment and measuring size from a simple coffee cup to a full size car<p>We are doing some research projects to bring new technologies into the company which the roles are for.<p>We are looking for a senior developer to help lead the small backend development team and be able to deal with tasks that have performance requirements.\nand 1-2 Junior to Mid level developers to improve their skills as software developer and contribute to development of frontend or backend software<p>Senior Backend&#x2F;Database Developer\nYou would be another senior developer on the team to implement features and looking to solve performance related tasks with large amounts of 3D data.\nShould contribute to the architecture of the C# side and Database side.\nOur development stack is currently C# .net core 2.1 with Azure SQL (Dapper)+Azure Storage.\nIdeal candidate would have good programming language knowledge, good database knowledge, problems solving and helping junior developers learn<p>Junior-Mid Frontend&#x2F;Backend Developer\nYou would be working on either frontend or backend team to implement features. Willing to learn and improve your programming skills.\nKnowledge of react&#x2F;typescript or C# will improve chances but not required.\nOur Backend stack is C# .net core 2.1 with Azure SQL (Dapper)+Azure Storage\nOur Frontend stack is react+redux+typescript\nIdeal candidate would have understanding of programing language, be able to problems solve, understanding of SOLID+OOP principals.<p>To apply please email cv and other relevant information: l.orlovicius@gom.com","time":1541153782,"type":"comment"}