{"by":"troquerre","id":18360211,"parent":18354503,"text":"Namebase | Frontend Engineer | San Francisco | REMOTE | ONSITE\nNamebase is a top-level domain registrar and exchange for the Handshake blockchain. Namebase makes it easy for anyone to buy&#x2F;sell Handshake coins (HNS) and use their HNS to register TLDs.<p>-- Why should you care?\nThe internet wasn&#x27;t built to handle the scale it supports today. The DNS we rely on is supported by ducktape solutions that fail to serve the security and reliability needs of today&#x27;s internet. For instance, compromised Certificate Authorities threaten SSL (<a href=\"https:&#x2F;&#x2F;www.expressvpn.com&#x2F;blog&#x2F;certificate-authority-vulnerability&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.expressvpn.com&#x2F;blog&#x2F;certificate-authority-vulner...</a>), and domains get seized for arbitrary reasons, even for good actors (<a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;zoho&#x2F;status&#x2F;1044249648993525760?s=20\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;zoho&#x2F;status&#x2F;1044249648993525760?s=20</a>).<p>Handshake fixes these issues by letting anyone register secure, censorship-resistant TLDs on the blockchain. More details can be found in the whitepaper <a href=\"https:&#x2F;&#x2F;handshake.org&#x2F;files&#x2F;handshake.txt\" rel=\"nofollow\">https:&#x2F;&#x2F;handshake.org&#x2F;files&#x2F;handshake.txt</a>.<p>Namebase is driving adoption of Handshake&#x27;s DNS by making it easier to use and more powerful.<p>We are looking for an experienced frontend engineer to join our team of 4 including 2 engineers.<p>We don&#x27;t require experience with our tech stack, just the motivation and ability to learn. For more details on the role, email me and I&#x27;d love to tell you more - Tieshun, tieshun at namebase.io, Namebase CEO<p>Website: <a href=\"https:&#x2F;&#x2F;namebase.io\" rel=\"nofollow\">https:&#x2F;&#x2F;namebase.io</a><p>P.S. we&#x27;re also looking for our first marketing lead. Ping me if you&#x27;re interested!","time":1541125147,"type":"comment"}