{"by":"ekoczwara","id":18362600,"parent":18354503,"text":"Energotest | Gliwice (Poland) | Full Time | ONSITE | Senior Software Engineer | <a href=\"http:&#x2F;&#x2F;www.energotest.com.pl&#x2F;index&#x2F;kariera\" rel=\"nofollow\">http:&#x2F;&#x2F;www.energotest.com.pl&#x2F;index&#x2F;kariera</a><p>Energotest is a modern and well organized engineering company with a team of distinguished specialists. Many of them have managed or co-managed: design, assembly supervision, post-assembly tests, start-up of devices and electrical power engineering systems, practically in all newly erected or modernized power plants, combined heat and power plants, substations and industrial plants in Poland and abroad.<p>The Energotest R&amp;D department team is looking for a senior developer who would be willing to take part in setting new directions in the development of systems for the broader &quot;Industry 4.0&quot;. The person will help us change the world of automation systems, face the task of creating tools for engineers and firmware for devices manufactured by Energotest. Working together in the R&amp;D department, we are happy to share our knowledge, but the ability to independently solve problems and look for information will be a desirable skill. If you have skills that do not meet all of the following requirements, but enter other areas of programming and feel that they will help develop our project or make it a unique product, we will gladly talk to you. Currently we are building a device (based on embedded Linux) and some tools to configure it (with C++&#x2F;Qt).<p>Essential skills: GNU&#x2F;Linux, Git, Bash, C++, Boost, Qt<p>Nice to have (in random order):<p>* Python (and Boost.Python)<p>* Experience with embedded Linux (yocto)<p>* Modern C++ (C++11, C++14, C++17)<p>* Functional programming (Haskell, Erlang)<p>* Web technologies (Elm, PureScript)<p>Extra notes:<p>* It doesn&#x27;t harm if you also know MFC, C#, Delphi and Windows in general<p>* Official language in Energotest is Polish<p>* Remote work is partly possible (1 day&#x2F;week)<p>If you want to avoid the recruitment path, take on the challenge available here: <a href=\"https:&#x2F;&#x2F;energotest.github.io&#x2F;Challenge&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;energotest.github.io&#x2F;Challenge&#x2F;</a>","time":1541163097,"type":"comment"}