{"by":"mchannon","id":18360237,"parent":18354503,"text":"Beckman Coulter Life Sciences | JavaScript or C# Engineers | SW Oregon | Full-time | Onsite<p>BC makes actual hardware products.  This group makes boxes that sniff air and tell you how clean it is.  Useful for microchip makers and especially drug companies.<p>We’re not a startup, which means you don’t have to deal with 20-something hotshots who have something to prove, all the while writing code for products that nobody will ever want.  We don’t work 12-hour days while pretending to have unlimited personal time.  It’s a mature company that treats its employees with respect and pays them well.  And it makes actual stuff that gets built and shipped out the door.<p>It also wants to stay relevant with the latest technologies and needs your skills to keep up with the workload.  We have 14 openings right now.  The average employee here is probably over 35, and over a decade of service.<p>Salary range?  I’m getting paid more here than I ever did in California, and my annual take-home starts with a 2.  You don’t have to take a pay cut to move here.  And holy @#$% does it go far.<p>Imagine, living in a small city with a surprising array of big-city amenities, beautiful mountains everywhere, where almost everyone’s nice, most men wear beards, and you can afford a house with a yard on a single income.  Maybe like the town you grew up in.  We’re 4 hours from Portland, so don’t worry about getting too much of that scene unless you want to.<p>After grinding it out in the SF bay area dystopia for years, I felt like I’d died and gone to heaven when I took this job.  If you do well on your resume and phone screen, BC will fly you out for a daylong onsite, which is really useful if you’re on your last dime after getting sucked dry by California rents.  How about leaving that scene behind?<p>We want talent, and we don&#x27;t get hung up on irrelevant details.  Email me at &lt;username&gt;@beckman.com.","time":1541125497,"type":"comment"}