{"by":"amyjeanbruce","id":18366108,"parent":18354503,"text":"Bandwidth is hiring a Denver Software Development Manager and Senior Software Engineers!<p>Denver Dev Mgr - <a href=\"https:&#x2F;&#x2F;www.bandwidth.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=1210142\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bandwidth.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=1210142</a><p>RALEIGH Sr. Software Engineer - <a href=\"https:&#x2F;&#x2F;www.bandwidth.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=1382832\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bandwidth.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=1382832</a><p>DENVER Sr. Software Engineer -<a href=\"https:&#x2F;&#x2F;www.bandwidth.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=1306755\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bandwidth.com&#x2F;careers&#x2F;openings&#x2F;?gh_jid=1306755</a><p>Why work for Bandwidth? Look at all the great things we have to offer!<p>• The Whole Person Promise: We make a “Whole Person” promise to our team. You can have both meaningful work PLUS a full life at Bandwidth. We focus on accomplishing our mission as “whole people.” That means we take care of our people—in body, mind and spirit.<p>• Health: We pay 100% for benefits coverage including Medical, Dental, Vision, Prescription, Life and Disability.<p>• Fitness: 90-minute fitness lunch with a paid gym membership with shuttle service available for workouts. Onsite cardio gym, locker room&#x2F;showers, classes, and sponsored sports and leagues. Nutritionist and personal trainer on site.<p>• Volunteer: We love our neighbors and we have a program dedicated to volunteer opportunities called Bandwidthcares! Every month, we&#x27;ll visit a local charity to do volunteer work for a couple of hours. If a cause moves you, we encourage you to lead a volunteer team or internal event to help that cause!<p>Find out more by going to our career portal: <a href=\"http:&#x2F;&#x2F;bandwidth.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;bandwidth.com&#x2F;careers&#x2F;</a><p>Reach out to Amy at abruce@bandwidth.com with any questions! :)","time":1541187935,"type":"comment"}