{"by":"yfarraatx","dead":true,"id":18363276,"parent":18354503,"text":"Machine Learning Infrastructure Software Architect | Alegion | Austin | Full-time | H-1B Visa Xfer | Onsite | Relo<p>We are looking for a Machine Learning Infrastructure Software Architect who will be responsible for designing, deploying, and enhancing a cloud-based infrastructure for machine learning experiments, which will be used as research testbed that can efficiently move vetted capabilities to production deployment. As the ML Software Architect, you will design and implement data integration with Alegion’s production platform, and you will perform data preparation and comparative evaluations of various ML approaches on a variety of data types at scale. The ML Software Architect possesses extensive experience in evaluating, integrating and deploying machine learning algorithms in a SaaS software platform.<p>At Alegion, we are transforming how enterprises execute on Artificial Intelligence and Machine Learning projects, while transforming the way people work. Our AI enablement platform integrates human intelligence at scale into the creation of high-quality training data, the validation and scoring of AI models and real-time exception handling. We do this through our advanced data and task management platform and our growing network of on-demand trained human data specialists. By combining human intelligence and artificial intelligence, Alegion processes large-scale and complex data tasks provide the context, emotion and humanity that machine intelligence cannot achieve while delivering the highest quality results, at scale, and at the most effective cost.<p>Send resumes to: jobs@alegion.com or apply at <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;791461990&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;791461990&#x2F;</a><p>Company Web Site: <a href=\"https:&#x2F;&#x2F;alegion.com&#x2F;company&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;alegion.com&#x2F;company&#x2F;</a>","time":1541169190,"type":"comment"}