{"by":"peterhochung","id":18383809,"parent":18354503,"text":"Group Nine Media (Thrillist, NowThis, Seeker, The Dodo)<p><a href=\"https:&#x2F;&#x2F;www.groupninemedia.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.groupninemedia.com&#x2F;</a><p>Group Nine Media is the parent company of four mission-driven, category-leading brands covering food, drink and travel (Thrillist), news and entertainment (NowThis), animals and activism (The Dodo) and science, tech and exploration (Seeker). We&#x27;re one of the world&#x27;s largest digital-first media companies, boasting over 5 billion video views every month, meaning that the work you do here will be impactful and geared towards informing our readers on topics that matter.<p>ONSITE in NY, NY software engineer, consumer experience.<p><a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;groupninemedia&#x2F;jobs&#x2F;1032075\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;groupninemedia&#x2F;jobs&#x2F;1032075</a><p>Some of the questions&#x2F;considerations you might face in this role might include:<p>How do we implement impactful designs with web performance and clean, concise code in mind?\nAs Group Nine Media grows, how do we continue to build our codebase in a sustainable and scalable way?\nHow can we collaborate effectively with the Design and Product teams to make informed technical decisions and find creative solutions for each project?\nShould we use an existing library or write our own?\nThese are the main technologies and tools that we use on our team:<p>Client-side: JavaScript ES6, React.js, CSS3 (SASS)\nServer-side: CakePHP, PHP7\nBuild: Webpack, NPM\nWorkflow: GitHub, Jira, Confluence<p>How to apply\nYour application should include a resume that clearly shows us why you’re our ideal candidate. Optionally, if you do not check off every bullet point in this job description but feel like you’d be a great fit for this role, apply anyway and attach a cover letter and elaborate on why you want to join us and any skills you have that we didn’t mention that you think will contribute to your success in this role. Hope to hear from you soon!<p>We offer great benefits such as medical, dental, vision, matching 401(k), PTO, company paid AD&amp;D, life insurance, short and long-term disability, and much more!","time":1541436783,"type":"comment"}