{"by":"ewa","id":18383080,"parent":18354503,"text":"INTERCOM | Dublin (Ireland), London (UK) and San Francisco (USA)\nFull Time | ONSITE | SaaS | <a href=\"https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.com&#x2F;careers&#x2F;</a><p>- SENIOR SOFTWARE ENGINEER <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;df1addcd1\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;df1addcd1</a><p>- SYSTEMS ENGINEER (DEVOPS) <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;8bfba8f41\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;8bfba8f41</a><p>- SENIOR SECURITY ENGINEER: <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;8cbb6f751\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;8cbb6f751</a><p>- PRINCIPAL SOFTWARE ENGINEER <a href=\"https:&#x2F;&#x2F;grnh.se&#x2F;f44555431\" rel=\"nofollow\">https:&#x2F;&#x2F;grnh.se&#x2F;f44555431</a><p>Intercom builds a suite of messaging-first products and we ship fast. We are looking for a Principal Engineer to lead a group of high-performing teams that fuel our  growth. Our teams in San Francisco build and maintain our Messenger (our flagship product) our go-to-market expertise, and our on-boarding experiences, ensuring new customers are set up for success when they start using Intercom. In terms of technology, we’re not prescriptive, though we have established patterns that have served us well as we’ve scaled to billions of requests per month.<p>We&#x27;re also hiring engineers in Dublin and London to work on our product and build message delivery rules and composer, our app framework or our database models and user storage, to name a few. Our devops and security teams are busy ensuring scalability and security of our infrastructure.<p>ABOUT US: We&#x27;re a $1.3+ billion company, nearly 600 people and over 25k+ customers including Microsoft, Spotify, Stripe, Airbnb, Hootsuite, Yahoo, and over 500M monthly conversations sent on our platform reaching over a billion people worldwide.<p>TECH: Ruby on Rails application with an Ember.js frontend. We use MySQL, MongoDB and Amazon’s DynamoDB for most of our storage. Our web messenger is built on React.<p>Questions? Want a chat? Get in touch at ewa@intercom.com or check out our blog: <a href=\"https:&#x2F;&#x2F;www.intercom.com&#x2F;blog&#x2F;category&#x2F;engineering&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.com&#x2F;blog&#x2F;category&#x2F;engineering&#x2F;</a>","time":1541432192,"type":"comment"}