{"by":"heidivalor","id":18384525,"parent":18354503,"text":"ValorWater.com | San Francisco | Full-time | Onsite | SENIOR SOFTWARE ENGINEER (Python) | <a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;software-engineer-back-end-at-valor-water-analytics-inc-922404736&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;software-engineer-back-en...</a><p>Write code with purpose! Valor Water Analytics seeks a talented, diligent software engineer to help transform the water utility industry. Come join our small team of scientists, engineers and economists working collaboratively in a startup-like environment. Through the deployment of software, data analysis, and artificial intelligence, we have recently begun to solve conundrums that have persisted in the industry for decades. We expect to scale up our customer base and data lake by 10-100x in the next year. In addition to contributing to the mission of our company, you will have opportunities for career growth and learning.<p>Responsibilities include:<p>* Design new apps, micro services, and backend infrastructure to help achieve company goals<p>* Expand and improve existing solutions<p>* Test new code and expand test coverage of existing code<p>* Troubleshoot complex systems<p>* Analyze problematic data sets<p>* Identify performance enhancements and optimize for scale<p>* Follow latest software engineering techniques and trends<p>Qualifications include:<p>* Minimum of 3 years relevant industry experience<p>* Degree in computer science, engineering, mathematics, or a related field<p>* Fluent in Python, Ruby, Elixir, or similar<p>* Experienced in writing database-backed applications including complex SQL queries<p>* RESTful API service development<p>* Amazon Web Services<p>* Unit testing<p>Apply and mention: Hacker News\n<a href=\"https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;software-engineer-back-end-at-valor-water-analytics-inc-922404736&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs&#x2F;view&#x2F;software-engineer-back-en...</a><p>Or email hsmith [at] valorwater [dot] com","time":1541441716,"type":"comment"}