{"by":"benforged","id":15149089,"kids":[15155007],"parent":15148885,"text":"Markforged | Super Full-Stack Software Engineer | Boston, MA or San Francisco, CA | Onsite | Full-time or college intern | $100K+ and equity<p>I&#x27;m head of software at Markforged (<a href=\"http:&#x2F;&#x2F;markforged.com\" rel=\"nofollow\">http:&#x2F;&#x2F;markforged.com</a>). We are on a mission to unlock the next 10x innovation in design and manufacturing. We build the world&#x27;s best 3D printers to liberate mechanical engineers from decades-old, slow processes.<p>We broke ground in 2014 with the world&#x27;s first continuous carbon fiber 3D printer, and this year with the world&#x27;s first sub-$100K metal printer. Our products are impeccably engineered and customers love us for it — our $70K printer has an NPS score of 85. We have plenty of funding, 7-digit annual revenue, and a low burn rate.<p>We have 4 software engineers and are looking for a few more.<p>Our software stack:<p>* Webapp - Express.js &#x2F; AWS backend, AngularJS &#x2F; WebGL frontend, Electron for optional desktop client, all sanely-linted CoffeeScript<p>* Computational geometry engine for part slicing - Written from scratch in CoffeeScript and C++. Runs on EC2, in-browser, or on desktop client<p>* Printer touchscreen application - Node Webkit &#x2F; AngularJS + Python -&gt; migrating to Electron &#x2F; VueJS + Python, all on top of a custom Debian image on a BeagleBone<p>* Printer firmware - embedded C on a custom board<p>Our team is all super full-stack. We generally distribute software tasks based on individual interest. As our 5th software engineer, you will have tons of project ownership. Your ideas will influence the company&#x27;s direction. You will do interdisciplinary work on physical systems and learn from best-of-the-best engineers across MatSci, Mech-E, EE, and SW, mostly MIT grads.<p>To succeed here, you need to be a quick learner and have a passion for software engineering. You don&#x27;t need prior experience with 3D printing or our software stack, you can pick up those skills on the job.<p>If interested, please apply online at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;markforged&#x2F;6cd283d8-0926-4e81-8e7c-636dfd683527&#x2F;apply\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;markforged&#x2F;6cd283d8-0926-4e81-8e7c-636...</a> (full-time) or <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;markforged&#x2F;aaf2f2d3-27aa-42ce-96b4-0bd21d909977&#x2F;apply\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;markforged&#x2F;aaf2f2d3-27aa-42ce-96b4-0bd...</a> (intern)","time":1504278981,"type":"comment"}