{"by":"nsamuell","id":15148959,"kids":[15148972],"parent":15148885,"text":"Pathgather - <a href=\"http:&#x2F;&#x2F;pathgather.com\" rel=\"nofollow\">http:&#x2F;&#x2F;pathgather.com</a> - ONSITE - New York, NY (NYC)<p>Pathgather is a fully-funded enterprise learning SaaS startup (Techstars) focused on helping employees advance their careers by learning new skills. Our talent development platform is used by some of the largest companies in the world (HP, Visa, Qualcomm, etc.) to (1) aggregate learning content from both public (e.g. Udacity) and private (e.g. internal learning systems) catalogs, (2) empower employees to share what they&#x27;re learning and mentor each other, and (3) track employee progress towards career goals. We&#x27;ve got real revenue, real customers, and a real opportunity to make learning better for employees everywhere. We&#x27;re still small (~23 employees) but we&#x27;re growing our product &amp; engineering teams quickly and are adding positions across the spectrum.<p>Right now, we&#x27;re focused on finding a great Product Manager to join the team. If you&#x27;ve got demonstrated experience (~4 years) managing great enterprise SaaS products, let&#x27;s get in touch.  Check out the job details below:<p>* PRODUCT MANAGER (4+ years, enterprise SaaS, Scrum, JTBD): <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather&#x2F;0b5baaca-50b4-414e-95b2-9277020d2bbe\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather&#x2F;0b5baaca-50b4-414e-95b2-927...</a><p>Additionally, if you&#x27;re an experienced engineer (~4 years), are passionate about learning, and want to join a growing team, let&#x27;s get in touch. Check out our careers page for details on other positions (<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather</a>), or contact me (neville@pathgather.com, CTO) to get started. If you can, please include &quot;Hacker News&quot; in the subject line so I don&#x27;t miss it - email is a pretty noisy communication protocol...","time":1504278425,"type":"comment"}