{"by":"pixelmonkey","id":15149457,"parent":15148885,"text":"Parse.ly | Software Engineer | Remote | Full-Time<p>What&#x27;s Parse.ly? We&#x27;ve built a real-time content measurement layer for the entire web. Our analytics platform helps digital storytellers at some of the web&#x27;s best sites, such as Arstechnica, The New Yorker, TechCrunch, The Intercept, Mashable, and many more. In total, our analytics system handles over 65 billion monthly events from over 1 billion monthly unique visitors.<p>Parse.ly is a fully distributed team, as described here: <a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission&#x2F;?utm_campaign=sep2017_job&amp;utm_source=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;4736&#x2F;mission&#x2F;?utm_campaign=sep201...</a><p>Our entire stack is in Python and JavaScript, and our team has innovated in areas related to real-time analytics, building some of the best open source tools for working with modern stream processing technologies. Our UX&#x2F;design team has also built one of the best-looking dashboards on the planet, using AngularJS and D3.js. You can see some screenshots: <a href=\"http:&#x2F;&#x2F;parse.ly&#x2F;tour?utm_campaign=sep2017_job&amp;utm_source=hn\" rel=\"nofollow\">http:&#x2F;&#x2F;parse.ly&#x2F;tour?utm_campaign=sep2017_job&amp;utm_source=hn</a><p>Our distributed team is best-in-class and we happily skip commutes by working out of our ergonomic home offices. Here&#x27;s a photograph of mine running two full-screen Parse.ly dashboards on my monitors: <a href=\"https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73\" rel=\"nofollow\">https:&#x2F;&#x2F;flic.kr&#x2F;p&#x2F;v1NZ73</a><p>To see an example of how we work, check out the blog post, &quot;Whatever It Takes&quot;: <a href=\"https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;46&#x2F;whatever-it-takes&#x2F;?utm_campaign=sep2017_job&amp;utm_source=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.parse.ly&#x2F;post&#x2F;46&#x2F;whatever-it-takes&#x2F;?utm_campaig...</a><p>We are growing fast and we have five open positions on the product team:<p>- UX Engineer<p>- Data Engineer<p>- Machine Learning Engineer<p>- Infrastructure Engineer<p>- Success Engineer<p>Each role is described in depth in this Github gist: \n<a href=\"https:&#x2F;&#x2F;gist.github.com&#x2F;amontalenti&#x2F;0a9b3af3adf7d135409110582edc66d1\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;amontalenti&#x2F;0a9b3af3adf7d13540911058...</a><p>If any of these roles sound appealing, then please send a cover letter, CV&#x2F;resume, and optionally links to projects or code, to the email address here: work@parsely.com.\nPlease specify the exact role in which you&#x27;re interested. Also mention that you&#x27;re coming from the &quot;HN Who&#x27;s Hiring&quot; thread. Note that though Parse.ly is fully distributed team, we prioritize candidates in ET&#x2F;CT&#x2F;MT timezones (or close) and who have past experience working remotely.","time":1504280753,"type":"comment"}