{"by":"felixjendrusch","id":15149163,"parent":15148885,"text":"xbrid | Senior Machine Learning Engineer, Senior Backend&#x2F;DevOps Engineer, Data Scientist, iOS Engineer | Berlin, Germany | ONSITE, FULL-TIME | <a href=\"http:&#x2F;&#x2F;xbird.io\" rel=\"nofollow\">http:&#x2F;&#x2F;xbird.io</a><p>xbird is a medical AI company developing ways to use smartphones and wearable devices to predict and prevent health risks. We are a 10-person, interdisciplinary team on the mission of saving 1 million lives by 2020. Our current solution focuses on detecting and preventing hypoglycemia for diabetes patients. We recently updated our open positions:<p>- Senior Machine Learning Engineer: We are looking for a Senior Machine Learning Engineer that will help us build the intelligence behind our systems. You will apply the latest machine learning algorithms to improve the lives of people and to help doctors in their diagnosis. | #python, #pandas, #keras, #tensorflow | <a href=\"https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;C2E95CE7BE\" rel=\"nofollow\">https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;C2E95CE7BE</a><p>- Senior Backend&#x2F;DevOps Engineer: We are looking for a Backend and DevOps Engineer who will be working on our data processing infrastructure. You will implement solutions that reliably handle massive streams of data, use the latest algorithms to continuously analyze that data, and provide meaningful insights to patients and doctors. | #python, #docker, #kubernetes, #redis, #numpy | <a href=\"https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;71F01814F5\" rel=\"nofollow\">https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;71F01814F5</a><p>- Data Scientist: We are looking for a Data Scientist (Full Stack) that will help us analyze mobile data in order to deploy scalable solutions. Your daily tasks will range from building predictive models to setting up a data storage system; they will include the analysis of health indicators and sensor data, as well as delivering a reliable and well-crafted software solution. | #python, #pandas, #keras, #tensorflow | <a href=\"https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;4F19B529D5\" rel=\"nofollow\">https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;4F19B529D5</a><p>- iOS Engineer: We are looking for an iOS Engineer to join the mobile team and support our endeavor. The mobile team is responsible for passively collecting sensor data, such as accelerometer data and location data, and delivering that data to our cloud-based machine learning. | #ios, #watchos, #objective-c, #healthkit | <a href=\"https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;0FFE5002A0\" rel=\"nofollow\">https:&#x2F;&#x2F;xbird.workable.com&#x2F;j&#x2F;0FFE5002A0</a><p>To learn more or apply, please check the aforementioned links. If you have any questions, do not hesitate to contact me: felix@xbird.io.","time":1504279347,"type":"comment"}