{"by":"lwakefield","id":15149377,"parent":15148885,"text":"Tictail | Growth Engineer | NYC, New York | Full-time | ONSITE<p>We here at Tictail are building the world&#x27;s most used and loved e-commerce platform. Tictail was founded five years ago in Stockholm, Sweden, where the platform was built from the ground up to support independent brands across the world in running their business. Since then Tictail has built a marketplace to support our brands, opened an office in NYC and grown to support hundreds of thousands of brands and millions of products.<p>Our frontend is built on top of React, Express, and Webpack where we work hard to stay on the bleeding edge. Our backend is largely written as Flask services in Python where we use technology like PostgreSQL, ElasticSearch, Redis, nginx, HAProxy, and Chef. Everything runs on top of AWS. Above all, we value the right tool for the job.<p>Who we are looking for:<p>* You are comfortable moving across, up, down, in and out of the stack - but we don&#x27;t expect you to be a specialist in everything<p>* You take pride in your work but care most of all about getting your code in front of users<p>* You care about building something real – something that helps people all over the world grow their own business from their passion<p>We are also hiring for non-engineering roles in NYC and you can see more positions <a href=\"http:&#x2F;&#x2F;tic.tl&#x2F;2gwWsap\" rel=\"nofollow\">http:&#x2F;&#x2F;tic.tl&#x2F;2gwWsap</a>:<p>Tictail | Growth Analyst | NYC, New York | Full-time | ONSITE<p>Please apply to your preferred location and position here: <a href=\"http:&#x2F;&#x2F;tic.tl&#x2F;2gwWsap\" rel=\"nofollow\">http:&#x2F;&#x2F;tic.tl&#x2F;2gwWsap</a> and then email me at lawrence+hnsept17@tictail.com and I will make sure that we give it the proper HN treatment :)<p>For engineers, our interview process usually involves a phone screening, a take home task followed by an onsite interview where we will talk about the task and do a little pair programming.","time":1504280293,"type":"comment"}