{"by":"Nedforce","id":15149020,"parent":15148885,"text":"Nedforce | The Netherlands (Amsterdam &#x2F; Enschede) | ONSITE | Senior Developer | ca. EUR 55,000 | <a href=\"https:&#x2F;&#x2F;www.nedforce.nl\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nedforce.nl</a><p>We are looking to strengthen our IT team with a senior Ruby on Rails developer.\nYou will be working with a team of 3-6 professionals, who develop, test and maintain applications for web, tablet and phone.  Your main focus on will be on the architecture and programming of the new and existing applications built on the  framework of Ruby on Rails such as the internet based media application for the NPO (Nederlandse Publieke Omroep) and supporting the other Ruby programmers.<p>Tasks:\n- Architecture and programming of Ruby on Rails applications;\n- Managing further development of our suite of compliance applications;\n- Developing scenarios for new &#x2F; existing applications and features;\n- Work with other team members to integrate their work into in the applications;<p>For this role we are looking for a motivated person preferably graduated or academic level in IT who is looking for a leading role in between the business and IT and complies with the following qualifications: \n- 5 years commercial experience in web development, preferably some years as project leader\n- Minimum of 3 years commercial experience in Ruby on Rails projects\n- Thorough understanding of HAML, SASS&#x2F;SCSS, CSS(3), JavaScript  and jQuery\n- Thorough understanding of SQL, relational databases and PostgreSQL\n- Preferably  knowledge of UNIX&#x2F;LINUX hosting technologies (virtualization, web servers, etc.)\n- Known with Agile methodologies, test&#x2F;behavior driven development.\n- English proficiency is a must, any other language is beneficial;\n- Strong analytical skills, detail-oriented and result-driven;\n- Pro-active attitude and taking ownership;\n- You are enthusiastic about our core values: simplicity, passion and innovation.<p>What we offer:\n- Salary indication: ca. €55.000,- plus,  depending on skills and experience\n- Depending on qualification Nedforce offers competitive remuneration package including participation in share option scheme.\n- Location Amsterdam and Enschede.\n- Work on first class creative projects for media and compliance products for the financial and service sector.\n- Flexible working hours and location.\nSend your curriculum vitae and motivation to join our team to info@nedforce.nl.","time":1504278653,"type":"comment"}