{"by":"wskemper","id":15149806,"parent":15148885,"text":"ViaSat | Software Engineer, viasat.io Platform | Dublin, Ireland | Full-Time <a href=\"https:&#x2F;&#x2F;www.viasat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.viasat.com</a><p>ViaSat is on a mission to be the world’s first global ISP. From Denali to Uluru, JetBlue 190 to Air Force One, and everywhere in between, our technology delivers Internet access no matter where life’s journeys take you. We’re shaping the future of global connectivity, and we want your help!<p>My team builds the viasat.io Platform, a suite of foundational network and security services that every group at ViaSat uses to build and protect their products. We also serve as advisors for other engineering teams, helping them make better use of cloud technologies and practices.<p>On any given day, you may be walking colleagues through the finer points of VPC design, or presenting a workshop on developing against viasat.io’s APIs. You might be adding DNSSEC support to our DNS service, automating TLS certificate validation across the entire network, or deploying our services to a new continent. Our challenges and our products are always evolving, which leaves little chance you&#x27;ll ever get bored.<p>We are looking for engineers who are proficient with multiple languages, and are familiar with existing IaaS and PaaS products like AWS, OpenStack, or Marathon. We also need our team members to be good communicators and people-friendly, as our daily work involves interfacing with many people all around the company. An engineering degree or equivalent experience is necessary.<p>You&#x27;d get bonus points for having a strong security background, in-depth knowledge of networking, or previous work experience building globally-distributed applications.<p>This engineer will be our first European hire; most of the team operates out of the US.  You&#x27;ll be working with ViaSat&#x27;s European engineering teams to bring them to the cloud, just as we&#x27;re doing with our US teams as well.<p>Email stephan.kemper@viasat.com if you&#x27;re interested!","time":1504282535,"type":"comment"}