{"by":"donmcc","id":15149628,"parent":15148885,"text":"ProsperWorks | ( Web &#x2F; Server &#x2F; Mobile ) Software Engineer | San Francisco, CA, US | Full-time | ONSITE <a href=\"https:&#x2F;&#x2F;www.prosperworks.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.prosperworks.com&#x2F;careers</a><p>At ProsperWorks, we&#x27;ve built the CRM that sales teams love to use. We integrate\ntightly with Gmail, G Suite and RingCentral to give our users up-to-the-minute\ndata without a lot of manual data entry. We have thousands of paying customers,\ntop-tier investors, real revenue and we&#x27;re growing fast.<p>We&#x27;re looking for experienced software engineers to join us. You will work\nclosely with our small cross-functional teams of developers, QA analysts,\nproduct managers and designers. We work steadily, collaboratively and\niteratively to ship software to customers every two weeks.<p>Our server is Ruby on Rails, our web client is Ember and we have native Android\nand iOS apps. Like most mid-stage startups, we&#x27;re in the process of paying down\ntechnical debt as we build a solid foundation to serve us through our &quot;hockey\nstick&quot; growth. We&#x27;re committed to automated testing, refactoring and improving\ncode quality; we want every commit to leave the code a little better than we\nfound it while shipping compelling new features to our users every sprint.<p>Our interview process consists of a phone screen followed by a half day on-site\ninterview of three 45 minute sessions covering algorithmic thinking, system\ndesign&#x2F;architecture and hands-on coding, then a talk with an engineering manager\nabout culture, fit and career goals. We’re respectful of candidate’s time, so we\ntry to extend offers within a couple of working days.<p>Our careers page: <a href=\"https:&#x2F;&#x2F;www.prosperworks.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.prosperworks.com&#x2F;careers</a><p>Our job listings: <a href=\"https:&#x2F;&#x2F;hire.withgoogle.com&#x2F;public&#x2F;jobs&#x2F;prosperworkscom\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.withgoogle.com&#x2F;public&#x2F;jobs&#x2F;prosperworkscom</a><p>Mention “HN: Who is hiring?” in your cover letter.<p>Questions? Email me! I’m don at prosperworks.","time":1504281607,"type":"comment"}