{"by":"JannikOnWheels","id":15157479,"parent":15148885,"text":"EDEKA Food Tech Projects | Full-Stack Software Engineer | Berlin, Germany | ONSITE | Full-time | €50k - €90k<p>As the innovation team inside the EDEKA group we work on thrilling challenges as well as new growth opportunities inside the food industry. For that purpose, we develop user-centric product innovations and new services. As a team within the EDEKA hierarchy we shape the daily life of up to one million customers and more then 300.000 colleagues in our 12.000 grocery stores. To make sure our ideas tackle the right problems, we strongly believe in a prototype- and test-driven development approach with continuous user engagement.<p>You want ...\n* To leverage user-centric design methods and rapid prototyping to develop and evaluate new ideas in the food tech industry?\n* To apply your full skillset to create and enhance new software MVPs on the basis of modern technologies?\n* To work with curious and enthusiastic colleagues?<p>Your skillset\n* You like to tackle exciting tech and business challenges.\n* You always have an eye for the needs, wishes and problems of the customer.\n* „Full-Stack Developer“ is not just a marketing term for you: You love to learn and work with new technologies in a productive setup.\n* You have a hands-on and getting-things-done mentality and would like to work in a startup environment.\n* You don’t know much about the food industry? No problem, we will help you with that! ;-)<p>Our offering\n* Culture: Work inside an interdisciplinary team which vouches for each other.\nOur team motto: “We act like family. We play like a sports team.”\n* Terms: Flexible working times, home-office und sabbatical-options as well as a workplace in the heart of berlin.\n* Personal development: Participation at conferences, mentoring from our network as well as non-tech und tech trainings.<p>INTERNS are also welcome.<p>Interested? Send us your CV: ftp@edeka.de","time":1504377179,"type":"comment"}