{"by":"Fomite","id":15153454,"parent":15148885,"text":"Postdoc | Washington State University | Pullman, WA | Full-Time | Onsite<p>The Lofgren Lab in the Paul G. Allen School for Global Animal Health at Washington State University is seeking a postdoctoral research associate to support an ongoing research project on the dynamics of healthcare-associated infections. The postdoctoral research associate will have access to an extensive infection surveillance database and will be working with a diverse team of biomedical and computer science researchers working to understand how the stochastic dynamics of infections within hospitals impacts surveillance, intervention evaluation, and clinical care.<p>Responsibilities of the position include the mentoring of graduate and undergraduate students in the lab; the analysis of datasets; the design, implementation, and analysis of mathematical models of disease transmission; and the preparation of manuscripts and conference abstracts. The specific focus of the postdoctoral research associate can be tailored to their interests and expertise but will likely include the implementation and analysis of stochastic network models of disease transmission addressing a broad range of clinically-driven questions, including surface decontamination, hand hygiene, antimicrobial stewardship, and active surveillance.<p>Requirements: It is recommended candidates should have a PhD or equivalent degree in Epidemiology, Biostatistics, Mathematical Biology, Disease Ecology, or a related field at time of hire, as well as good written and oral communication skills and the ability to work collaboratively across disciplines. Candidates who have not yet completed their PhD but have a scheduled defense date in the near future may be considered.<p>Preferred Qualifications: Experience with mathematical or simulation models of infectious diseases; fluency in Python, Julia, or R programming languages; and an interest in the control of healthcare associated infections.<p>This position is initially a one-year appointment with yearly extensions possible depending on progress and performance, and&#x2F;or available funding.<p>Start Date: 1&#x2F;1&#x2F;2018 or as soon as possible<p>Salary per Month: Commensurate with qualifications and experience<p>To apply for this position at Washington State University, Pullman, Washington, please visit www.wsujobs.com to apply. Candidates will need to include a cover letter, CV and contact information for three references with the online application. WSU is an equal opportunity and affirmative action educator and employer.<p>If you have questions regarding this position, please contact Dr. Eric Lofgren at elofgren@vetmed.wsu.edu","time":1504312947,"type":"comment"}