{"by":"caseus515","id":15153584,"parent":15148885,"text":"Preferred Networks | AI Research and Engineering positions | Tokyo &amp; San Mateo, California | ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;</a><p>We are a growing startup with about 100 members based in Tokyo, Japan, focusing on applying deep learning to industrial problems such as autonomous driving, robotics, and bio-healthcare. We also love open source; we are actively developing the deep learning framework Chainer (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;chainer&#x2F;chainer\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;chainer&#x2F;chainer</a>).<p>We have 500+ GPUs available for our R&amp;D and a larger GPU cluster is coming soon. We recently received an investment of $95 million from Toyota: <a href=\"http:&#x2F;&#x2F;newsroom.toyota.co.jp&#x2F;en&#x2F;detail&#x2F;18012355&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;newsroom.toyota.co.jp&#x2F;en&#x2F;detail&#x2F;18012355&#x2F;</a><p>We seek experienced engineers and researchers with expertise in AI-related topics, such as autonomous driving, robotics, optimization, bio-healthcare, NLP, machine learning, deep learning, reinforcement learning, computer vision, anomaly detection, simulation, sensor fusion, edge devices, embedded programming, compiler development, networks, HPC, microprocessor design, software engineering, software testing, CI, cloud services, etc.<p>We have a very western-style working environment with competitive salaries and benefits in the heart of Tokyo. Ability to communicate in either English or Japanese is OK. We have a flat hierarchy so you can expect your opinion to count. Experience a Silicon Valley-like culture - while living in Japan! We are mainly hiring for our Tokyo office, but some positions are also available at our San Mateo office in California.<p>More job details and application instructions can be found at <a href=\"https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;www.preferred-networks.jp&#x2F;en&#x2F;job</a>","time":1504314935,"type":"comment"}