{"by":"kelseyah","id":15157815,"parent":15148885,"text":"Paloma | CTO | New York City | Onsite &#x2F; Local | Full-time<p>We&#x27;re building marketing software for messaging platforms – kind of like MailChimp but for building &amp; sending conversations through Facebook Messenger.<p>The backstory: After the election I put together a team to build a Messenger &#x27;bot&#x27; to help people call Congress, CallParty.org, which launched in March. To power it we built a dashboard for segmenting and sending content (a bit like a MailChimp for Messenger) which got some businesses and investors interested. So we took 100k in angel funding and formed Paloma as a Public Benefit Corp to further build out an end-to-end marketing software for messaging platforms, and are working on our beta that will be launching in the fall. From there we&#x27;ll either raise a seed or participate in YC&#x27;s winter class and then raise a seed.<p>The team is me and two of the engineers from CallParty who are on contract and insanely talented. I have a background in design and designing marketing software, have hopped around startups the past few years, did YC two summers ago for one of them, and have built a few &#x27;bot&#x27; type experiences. Our next key hires are folks to head up tech, sales and marketing.<p>The platform is API-driven with a focus on integrations to CRMs and various data sources, and includes tools for audience management, conversation building &amp; scheduling, and analytics. It&#x27;s being built primarily in python with a javascript front-end.<p>We&#x27;re looking for someone to lead technical development who is:<p>* nice<p>* smart<p>* down for some really hard stuff<p>* good at communicating and making decisions rapidly<p>* excited about building tools for people<p>* interested in conversation &#x2F; messaging<p>* great at vetting, hiring and leading other devs<p>* excited about contributing to the growth of what is now a very small company<p>... probably some other stuff because really there&#x27;s a lot to do.<p>If you&#x27;re into it let&#x27;s chat! email in profile.","time":1504381246,"type":"comment"}