{"by":"callmevlad","id":15152367,"kids":[15154982],"parent":15148885,"text":"Webflow | Frontend &amp; Backend Engineers | San Francisco | ONSITE or REMOTE | Full Time | $100k-$160k + equity<p>Heya HN! We launched here almost 5 years ago [0], and now we&#x27;re looking to add a few more engineers across the stack to round out our team.<p>On the frontend, we really push the boundaries of what&#x27;s possible in the browser. Here are some examples of the types of visual tools we build here: [1] [2] [3] [4] - and that&#x27;s just scratching the surface. Our frontend stack is based on React, Flux, Redux, Flow, Immutable.js, GraphQL, Apollo, CSS-in-JS, etc.<p>On the backend, we run an entire hosting platform that scales to millions of requests across hundreds of thousands of websites and applications. There&#x27;s a healthy mix of Node.js, GraphQL, MongoDB, Redis, Rancher, Terraform, Docker - and whole slew of AWS services (we love Lambda!).<p>Most of us work remotely (across 10 countries, primarily US and EU timezones), and we have a strong design-and-engineering-driven culture. We all care deeply about building powerful tools for the open web platform to empower millions more people to create for the web, because learning to code is so hard that only 0.25% of the world knows how to to do it. If you&#x27;ve ever seen Bret Victor&#x27;s &quot;Inventing on Principle&quot; talk (google it!) and really resonated with it, this is the team for you!<p>We&#x27;re stable, cash flow positive (so no need ask VCs for $$$), and building a product which truly changes people&#x27;s lives (there are thousands of people across the world now making a living using Webflow to build professional sites [6] for others).<p>We&#x27;re looking for senior-level engineers that have had significant experience building production SaaS applications, but we also consider more junior-level engineers who have a track record of learning quickly.<p>If you are interested, send me a personal note (email in my profile) - I&#x27;d love to chat more!<p>[0] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=5407499\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=5407499</a><p>[1] <a href=\"http:&#x2F;&#x2F;3d-transforms.webflow.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;3d-transforms.webflow.com&#x2F;</a><p>[2] <a href=\"https:&#x2F;&#x2F;webflow.com&#x2F;feature&#x2F;interactions-v2\" rel=\"nofollow\">https:&#x2F;&#x2F;webflow.com&#x2F;feature&#x2F;interactions-v2</a><p>[3] <a href=\"https:&#x2F;&#x2F;webflow.com&#x2F;designer\" rel=\"nofollow\">https:&#x2F;&#x2F;webflow.com&#x2F;designer</a><p>[4] <a href=\"https:&#x2F;&#x2F;www.flexboxgame.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.flexboxgame.com&#x2F;</a><p>[5] <a href=\"https:&#x2F;&#x2F;webflow.com&#x2F;hosting\" rel=\"nofollow\">https:&#x2F;&#x2F;webflow.com&#x2F;hosting</a><p>[6] <a href=\"https:&#x2F;&#x2F;webflow.com&#x2F;discover&#x2F;popular\" rel=\"nofollow\">https:&#x2F;&#x2F;webflow.com&#x2F;discover&#x2F;popular</a>","time":1504299830,"type":"comment"}