{"by":"nathanbarry","id":15153104,"parent":15148885,"text":"ConvertKit (<a href=\"http:&#x2F;&#x2F;convertkit.com\" rel=\"nofollow\">http:&#x2F;&#x2F;convertkit.com</a>) | Senior Full-stack engineer | Remote | Full-time<p>Convertkit is looking for a Senior Rails engineer with significant Javascript experience. Come join our amazing, rapidly growing company!<p>About the team\nThe engineers at ConvertKit are smart, highly motivated and highly productive developers who care greatly about the craft of coding. We champion learning, bettering ourselves, and teaching to the rest of the team.<p>About ConvertKit\n- We are a fully remote company, scattered across 8 states and 4\ncountries.\n- Bootstrapped, profitable, and growing very quickly.\n- We put a high emphasis on work &#x2F; life balance, and we value and strive for 40 hour work weeks. There aren&#x27;t set hours, but there&#x27;s a lot to get done!\n- We have a positive, vibrant, and genuine culture.<p>About the role<p>You&#x27;ll be part of our awesome engineering team, helping to build our product. We primarily use Rails, Mysql, Redis and Sidekiq to get the job done. We&#x27;re facing real (fun) scaling challenges because of our incredible growth. Ideally\nyou&#x27;ve been there, done that before.<p>We&#x27;re also looking for someone who cares deeply about writing clean, maintainable, well-tested code, and generally tends to leave code in a better state than when you encounter it.<p>About you<p>You’re a perfect fit for this role if you’ve got experience developing software, love pragmatic OO design for its long-term cost benefits, and testing. Clean code is not just a phrase for you. Given our high rate of growth, you&#x27;ll need to have strong knowledge of scaling Rails applications up.<p>We&#x27;re a 100% remote company, so you should be autonomous, self-driven, and remote-disciplined.<p>Apply here: <a href=\"https:&#x2F;&#x2F;weworkremotely.com&#x2F;jobs&#x2F;5185-senior-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;weworkremotely.com&#x2F;jobs&#x2F;5185-senior-full-stack-engin...</a>","time":1504308477,"type":"comment"}