{"by":"madmax108","id":15152448,"parent":15148885,"text":"BloomReach | Backend&#x2F;Fullstack Engineer | Bangalore | Full Time | Onsite | <a href=\"http:&#x2F;&#x2F;bloomreach.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bloomreach.com</a><p>BloomReach brings businesses the first open and intelligent Digital Experience Platform (DXP), designed to accelerate the path to conversion, increase revenue, and grow customer loyalty.<p>The Engg team at BloomReach owns and leads the design and development of our core technology components that serve over 20% of e-commerce users in U.S.<p>A few of our latest Bangalore-based projects:<p><pre><code>  • Product Search for billions of interactions and millions of products\n\n  • A Distributed, highly scalable content indexing system\n\n  • Real time auto-complete system\n</code></pre>\nWhat you would have done :<p><pre><code>  • Got yourself a B.Tech&#x2F;M.Tech or equivalent degree in Computer Science\n\n  • Built software solutions for 2-6 years dabbling in backend first languages, such as C&#x2F;C++, Java, Scala, Python.\n\n  • Loved designing and analyzing applications end to end, which communicate with each other via services and APIs\n\n  • Used map-reduce or large-scale data processing (e.g Hadoop), Linux serving systems, databases\n\n  • Maintained distributed systems at significant scale in a production environment.\n\n  • Have fun stories of how you broke systems (and how you then fixed them) :)\n\n  • Brownie points for being an Open Source contributor.\n</code></pre>\nMore details:<p>Full Stack Engg: <a href=\"https:&#x2F;&#x2F;www.bloomreach.com&#x2F;en&#x2F;about&#x2F;careers&#x2F;development&#x2F;full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomreach.com&#x2F;en&#x2F;about&#x2F;careers&#x2F;development&#x2F;full...</a><p>Backend Engg: <a href=\"https:&#x2F;&#x2F;www.bloomreach.com&#x2F;en&#x2F;about&#x2F;careers&#x2F;development&#x2F;software-engineer-backend\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bloomreach.com&#x2F;en&#x2F;about&#x2F;careers&#x2F;development&#x2F;soft...</a><p>If this is you and you can prove it, we’re interested in talking to you about joining our top-flight engineering team. To get the conversation started, send along a cool piece of code, a link to something you’ve built or a hack that you’re proud of to ZGFtYXlhbnRpLmdob3NoQGJsb29tcmVhY2guY29t . We can’t wait to have a look.","time":1504300634,"type":"comment"}