{"by":"brown4","id":15150986,"parent":15148885,"text":"Endgame’s security platform enables organizations to hunt for adversaries within their networks and secure their most valuable assets. We are characterized by a high degree of autonomy and flexibility, intellectual engagement, and a competitive compensation structure that rewards performance. We work within a fast-paced, driven, and flexible work environment that allows for both professional growth, as well as unwinding through team events like weekend family brunches, happy hours, and outdoor activities. Endgame values engagement within the tech community. We provide opportunities for open source contributions, speaking at meetups or conferences, and participating in our technical blog.<p>Senior Software Engineer (Front End)  | San Francisco, CA  |  Full-Time | Onsite |<a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3rTr1jwA\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3rTr1jwA</a><p>Endgame’s Front End Engineering team is looking for a Senior Front End Engineer to be part of a cross-functional team working with designers, product managers, and engineers across multiple phases of the product lifecycle. Our Front End team builds responsive and elegant interfaces while maintaining a solid enthusiasm and passion for cutting-edge technologies. Our Front End Engineers embrace modern JavaScript frameworks and libraries, develop rapid prototypes, and iterate on features to optimize user interaction. Front End Engineers at Endgame use innovative UI architectures and designs, setting the bar high to produce compelling interfaces and creative visualizations.<p>Senior Site Reliability Engineer | San Francisco, CA  |  Full-Time | Onsite | <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3NTr1jwW\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3NTr1jwW</a><p>Site Reliability Engineer | Arlington, VA |  Full-Time | Onsite | <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZTr1jw8\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3ZTr1jw8</a><p>Endgame is seeking a Senior Site Reliability Engineer to build solutions that enhance availability, performance, and stability of Endgame’s bleeding edge security platform and supporting systems.  You will be automating repetitive work and develop solutions that operate at scale, ensuring your own technology efforts directly improve the reliability of our products. Our teams are empowered and expected to improve Endgame’s products to truly deliver a reliable experience to customers. Members of the SRE team also support, deploy, and provide enhancements to the application infrastructure and act as a successful partner within our Engineering, Research &amp; Development, and Product teams. You will be encouraged to bring fresh ideas and new perspectives to the position, while demonstrating versatility when faced with evolving requirements. You will work within a collaborative, flexible, start-up development environment while being offered opportunities to lead and expand your skill-set. Help us push our technology forward and leverage your expertise in networks and systems to shape the future of our products.","time":1504289358,"type":"comment"}