{"by":"jyw","id":15150230,"parent":15148885,"text":"Zeus | Full-stack  or Frontend Engineer | San Francisco, CA | On-site | Fulltime | zeusliving.com<p>At Zeus, we&#x27;re changing the experience of renting a furnished home. Traditionally, renting a furnished home involves either paying exorbitant rates or a grueling, soul-sucking search on Craigslist. We believe the best way to fix this process is not to make another rental search site, but to own the entire stack so we can control the whole experience. From fast and easy booking on our website to a friendly welcome when you check in, Zeus ensures your stay is convenient and seamless.\nZeus has raised over $3M in seed financing from Bowery Capital, Initialized Capital, Floodgate, and Google Ventures. The Zeus founders have all had previous exits and have worked in real estate and technology for over 10 years.<p>We are looking for a full-stack senior engineer who can run projects and help establish the foundation of our team. You&#x27;ll primarily be working on web development. Your projects will be split between our public-facing website that our tenants and landlords use and the custom software that runs our internal operations.<p>We are also looking for a frontend engineer to focus on building our UI. You will set the foundation for the front-end code base and ensure it is performant and maintainable. We want someone who wants to work with world-class designers and PMs to build an amazing user experience.<p>We currently have a small engineering team of 4. We are looking for pragmatic engineers who communicate well and get things done. We like to ship things fast and iterate quickly. Our stack is AWS, Postgres, Rails, JQuery, and Bootstrap. It&#x27;s not required you know any of these technologies as long as you&#x27;re willing to learn.<p>Apply here if interested: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;zeus</a>","time":1504284954,"type":"comment"}