{"by":"me551ah","id":15150035,"kids":[15150186,15152363],"parent":15148885,"text":"Flock | Android Developer | Delhi&#x2F;Gurgaon, India | OnSite | Full Time<p>Flock is currently the most powerful messaging platform which allows developers to write UI driven apps rather than bots. We believe that enterprise communication requires integration with the tools and workflows that a company uses and flock aims to integrate them all to streamline communication. HTML5 apps rather than bots make up the flock platform which is what makes us richer compared to our competitors slack, Microsoft teams etc.<p>The Android app is one of the platforms on top of which html5j&#x2F;s based FlockOS apps can run. From inside of the native app we expose various javascript functions via java to FlockOS ( via JavaScriptInterface) so as to make them more performant. We have support for multiple accounts, multiple teams and custom fields to manage a team ! The android project spans over 80 modules and is still rapidly growing.<p>We heavily use Data Binding , Kotlin and Dependency Injection. To improve connection times on mobile we even replaced TLS with our own protocol to reduce RTT times. Since Android Studio is so slow, we have setup remote builds using mainframer on our build machine ( which has a Dual 6 core processor , 32 gigs of Ram and 4 hard disk’s in Raid 0). All compilation happens remotely which makes compiling the 80 module project a breeze ( Incremental builds take &lt; 10 seconds ). We are writing all new modules and code in Kotlin.<p>Perks include a butler who will make juices&#x2F;sandwiches&#x2F;snacks for free, we have a well stocked pantry and fridge(everything inside is also free). We have a Xbox in office ( any overwatch&#x2F;titanfall&#x2F;fifa fans in here? ) a pool table, table tennis, foosball and a hammock to sleep on. We also provide medical insurance for you and your dependents ( including parents and in-laws ) and free cab service to office ( via Uber for Business ).<p>We are looking for experienced android developers with good knowledge of android internals. We are looking for candidates who have good skills in code design and can write elegant code.Experience in Kotlin will will be a huge plus. We are also open to candidates who have worked in any OOP langugage.<p>Please email your resume to : ajit.dh@flock.com","time":1504283773,"type":"comment"}