{"by":"jslaybaugh","id":15150418,"parent":15148885,"text":"Brushfire | Front End Web Developer | Fort Worth | Full-time | Remote<p>We are Brushfire and we are here to provide churches, ministries, and not-for-profit organizations with world-class event management tools, service, and support. We specialize in events of varying complexity including customizable registration forms as well as general admission and assigned seat ticketed events and compete directly against the largest event management companies in the world. We now have over twenty team members across four states and thrive in a distributed work environment with no physical central office.<p>We&#x27;re looking for a Front End Web Developer who is<p>* driven to create captivating and interactive web experiences,\n* skilled in layout and has an eye for attention to detail,\n* familiar with web application development patterns and practices,\n* experienced in building published, high quality web sites and applications,\n* stimulated by collaborating with a team to define, design and ship new features.<p>Qualifications:<p>* One or more years of experience coding web applications using HTML&#x2F;CSS&#x2F;Javascript and some server-side language (Ruby&#x2F;PHP&#x2F;Node&#x2F;etc — ASP.net is preferred).\n* One or more years of experience with mobile responsive design using popular frameworks such as Bootstrap, jQuery, etc.\n* Familiarity with consuming HTTP Web API’s.\n* Familiarity with distributed version control systems such as git&#x2F;svn&#x2F;etc (Git&#x2F;Github preferred).\n* Ability to communicate fluently, pleasantly, and effectively—both orally and in writing, in the English language—with customers and co-workers.\n* Passion, integrity, and energy<p>Qualified applicants should check us out at brushfire.com and apply here <a href=\"https:&#x2F;&#x2F;authenticjobs.com&#x2F;jobs&#x2F;29679&#x2F;front-end-web-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;authenticjobs.com&#x2F;jobs&#x2F;29679&#x2F;front-end-web-developer</a>","time":1504286122,"type":"comment"}