{"by":"jsonar","id":15152997,"parent":15148885,"text":"Vancouver,Canada | jSonar | ONSITE | Full-time<p>Versatile Linux technologist (Release-Engineer&#x2F;Dev-Ops&#x2F;Sysadmin)<p>jSonar is expanding it’s team and looking for a jack-of-all-trades technologists that can develop solutions quickly, troubleshoot issues, maintain, enhance and create software-packages, while maintaining an operational development environment.\nWe are a highly successful start-up in the Big Data&#x2F;NoSQL space, our solutions are used by the world’s largest companies. We know you will not be familiar with some of these technologies – and that’s OK – we will teach you. It is more important to us that you have the right “gut feel”, that you’re motivated and love to expand your knowledge.\nThis is a full-time position and you must reside in the Vancouver area as you will be working in our downtown office.<p>Ideal Candidate Qualifications<p>* Technologist that wants to use the best technology to implement successful solutions; you want to make a difference\n* Linux and networking experience – you should be comfortable with installation and administration of Linux environments and with networking concepts\n* Knowledge of virtualization and server administration (AWS, VMWare, VirtualBox, Docker, Kubernetes)\n* Knowledge of deployment, upgrades and version management of software packages on Linux\n* Working knowledge of Python and shell commands. It’s good if you’ve been hacking as a hobby\n* Coding experience (Mandatory); the interview process will include a coding challenge\n* Experience working with DB systems\n* You like to tinker and have an innate interest in technology.\n* Ability to learn quickly – we will throw tons of technologies at you and you will need to figure it out.\n* Excellent communication skills, both written and verbal.\n* Your friends describe you as independent and reliable.\n* You thrive in a versatile and dynamic team environment.\n* Always ready to help others and be helped.\n* You can drive your own boat: the ability to fearlessly use the resources at fingertips to resolve technical challenges especially when you don&#x27;t know the answer.<p>Need to be eligible to work in Canada in order to apply for this position.\nPlease send your resume and cover letter providing a short description of how your experience matches the requirements for this position to jobs@jsonar.com.","time":1504307089,"type":"comment"}