{"by":"akh_217","id":15150110,"parent":15148885,"text":"BetterCloud | Database Architect | Atlanta, GA | Full-time | On-site<p>BetterCloud is the first SaaS Application Management and Security Platform, enabling IT to centralize, orchestrate, and operationalize day-to-day administration and control for SaaS applications. Every day, thousands of customers rely on BetterCloud to centralize data and controls, surface operational intelligence, enforce complex security policies, and delegate custom administrator privileges across SaaS applications.<p>Requirements\n<i>4+ years experience with database design and query optimization\n</i>4+ years of experience with managing a high performance and high availability RDMBS, MYSQL preferred (i.e. Master&#x2F;Secondary clusters, backup&#x2F;restore, disaster recovery, high qps, etc.)\n<i>2+ years experience Java programming (jdbc best practices, connection pooling, and experience with Hibernate&#x2F;iBatis)\n</i>2+ years of experience with automating database cluster set-ups, migrations, backups, scaling, and recoveries for our cloud-based Big Data clusters (Percona MySQL, ElasticSearch, Redis, and Kafka).\n<i>2+ years of experience with automating server setup with Chef&#x2F;Ansible on AWS, GCP, or Azure\n</i>1+ years of Kafka experience - high availability, upstream checkpointing via compaction\n<i>Experience with multiple datastores, understand the pros&#x2F;cons for a given use cases, and able to make database recommendations based on team needs\n</i>Strong knowledge of JVM operations - memory management, threading, and JMX\n<i>Experience with enterprise monitoring of data services (master election, replication status, connection drops, slow queries, memory, cpu, and queries per second)\n</i>Colleagues describe you as self-driven, fast-learning, and hardworking<p>Plus Skills\n<i>Cassandra experience - setup, config, keyspace and table design\n</i>ElasticSearch experience -  Multi-cluster, multi-terabyte indices\n<i>Container orchestration tools (i.e. Mesos&#x2F;Kubernetes&#x2F;Nomad, etc.)\n</i>Hadoop Setup and Maintenance\n*Experience with Spark&#x2F;Flink&#x2F;Storm<p>You can apply here: <a href=\"https:&#x2F;&#x2F;www.bettercloud.com&#x2F;job-board&#x2F;790281&#x2F;?gh_jid=790281\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bettercloud.com&#x2F;job-board&#x2F;790281&#x2F;?gh_jid=790281</a>\nOr send your resume directly to abigail.horne@bettercloud.com","time":1504284198,"type":"comment"}