{"by":"jessmartin","id":15152767,"parent":15148885,"text":"First | Data Platform Engineer | Durham, NC | Onsite, Remote, Full-time, <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;first&#x2F;jobs&#x2F;797852#.WanaCtOGNN0\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;first&#x2F;jobs&#x2F;797852#.WanaCtOGNN0</a><p>--<p>First is a venture-funded startup at the intersection of artificial intelligence and real estate tech. We identify when people are going to move, and develop products to change the game for real estate professionals.<p>As an early member of a growing team, you’ll have significant ownership, input, and influence over the work that we do, and how we do it. You will be uniquely positioned to work alongside our Data Science and Product teams, bridging these cross-functional groups to make sure our data is flowing smoothly. You will build tools and conduits to help our data scientists easily access data gathered from our systems as well as outside sources. In turn, you’ll work with other software developers to integrate results from data science and machine learning into our services. You can help identify areas where data can help solve problems for our customers, and help build those solutions.<p>* You are an efficient architect. You are good at identifying bottlenecks and weak points in the data flow. You envision a better architecture, and relentlessly improve existing systems to be more efficient, reliable, scalable and easily accessible for data storage, backup and pipelines.<p>* You are a hybrid engineer. You are able to cross data operation and application software boundaries to provide system-wide support to various teams on the platform. You are skilled at Python, have extensive experience working with various databases (such as PostgreSQL) and are very familiar with AWS services (EC2, EMR, S3, RedShift, RDS, Athena).<p>* You understand distributed systems. You can build cohesive systems from small pieces, tools, and services that coordinate and communicate through the cloud.<p>* You have worked with teams scaling projects that deal with large amounts of data. You are well-equipped with big data knowledge and tools (Hadoop, Spark, Hive etc) and can design creative solutions for moving and operating large-scale data efficiently. You will provide easy access to all data at different stages of the pipeline to all teams that need it.<p>* You embrace automation. You take pride in providing support and building robust internal diagnostic tools, micro-services and other engineering solutions that other teams can either use directly or as Lego blocks to build their own applications on the platform.<p>* You are super proactive. You understand that as a platform engineer, you need to be up to date on what other departments are working on, and anticipate needs from data science team and product engineering team well in advance. You are capable of making intuitive decisions about what services and tools need to be in place before they are desperately needed.<p>* You love learning. You are curious and eager to learn about new areas that you may not have experienced yet. You enjoy playing with new technology and exploring new solutions that might come handy in providing better platform support to the team.<p>Come work with us. Change the real estate industry. Learn and grow every day.<p><a href=\"http:&#x2F;&#x2F;first.io\" rel=\"nofollow\">http:&#x2F;&#x2F;first.io</a> | <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;first&#x2F;jobs&#x2F;797852#.WanaCtOGNN0\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;first&#x2F;jobs&#x2F;797852#.WanaCtOGNN0</a>","time":1504303833,"type":"comment"}