{"by":"bdmorgan","id":15150152,"parent":15148885,"text":"Motorola Solutions is growing in Salt Lake City and Seattle and we are looking for DevOps and Platform engineers, as well as a Software Engineering Manager to join our team. The Cloud Infrastructure team is responsible for the development and operations of critical cloud infrastructure and platform services, in support of Motorola Solutions&#x27; public and hybrid cloud-based Software as a Service (SaaS) solutions for public safety customers. This team is part of Motorola Solutions’ Software Enterprise division, which offers secure, reliable and efficient team communications, workflow and operational intelligence solutions for mission critical public safety and enterprise markets throughout the world. Our services leverage Cloud Computing infrastructure on AWS to build at scale.<p>We offer great benefits and the ability to work with cutting-edge technologies, all while delivering mission-critical solutions that literally do change the world.<p>The Cloud Infrastructure team is responsible for:<p>* Design and implementation of a continuous integration&#x2F;continuous delivery (CI&#x2F;CD) pipeline into multiple public cloud regions<p>* Development and operation of common platform services that can be leveraged by our SaaS solutions moving forward<p>* Overall reliability and security of these services and the environments they are run in<p>* Monitoring and support for these platform and infrastructure services, as well as metrics collection and reporting related to them<p>Email me at bryan.morgan@motorolasolutions.com if you&#x27;re interested or please pass on to someone you think might be.<p>We&#x27;re now hiring for the following positions in Seattle and Salt Lake City (Engineering in both, Manager just in SLC).<p>* Software Engineering Manager: <a href=\"https:&#x2F;&#x2F;lnkd.in&#x2F;eTHC-zD\" rel=\"nofollow\">https:&#x2F;&#x2F;lnkd.in&#x2F;eTHC-zD</a><p>* Software Engineers - Cloud Platform: <a href=\"https:&#x2F;&#x2F;lnkd.in&#x2F;eBEcEGm\" rel=\"nofollow\">https:&#x2F;&#x2F;lnkd.in&#x2F;eBEcEGm</a><p>* DevOps Engineers - Cloud Platform:  <a href=\"https:&#x2F;&#x2F;lnkd.in&#x2F;ed4qjYw\" rel=\"nofollow\">https:&#x2F;&#x2F;lnkd.in&#x2F;ed4qjYw</a>","time":1504284427,"type":"comment"}