{"by":"sleuthy","id":15150372,"kids":[15152218],"parent":15148885,"text":"Paylock [<a href=\"http:&#x2F;&#x2F;paylock.com\" rel=\"nofollow\">http:&#x2F;&#x2F;paylock.com</a>] | Remote | Full-time | Senior Backend Engineer<p>We&#x27;re growing steadily and to meet new demands, we’re developing new products that motorists and city employees will rely on to ease their parking concerns. To do that, we&#x27;re scaling our fully remote, distributed, agile team which is interested in being hyper-productive but not working long hours to do so.<p>This position is for a full-time, REMOTE Senior Backend Software Engineer with 5+ years of experience.  This engineer will work semi-autonomously and as a part of a small, but growing, team to design, architect, implement, test, deploy, and maintain web-based, back-office software which runs our business, as well as significant portions of our customers&#x27; as well as on-the-street (usually literally) mobile software.<p>For starters, you&#x27;ll need a solid foundation in Object-Oriented Design. We are looking for someone who is highly familiar with our stack: C#, SQL Server, .NET.  Developers on our team also work on and develop database schemas, so you should have experience (and proficiency) with that as well. Since most of what we&#x27;re doing is web-based, it helps to have some background with HTML, CSS, and JavaScript, and knowing how the Internet works work can&#x27;t hurt you. If you understand that much, you probably know a lot about many other things and are constantly adding to your repertoire. In fact, you might not even be able to stop yourself. That&#x27;s a characteristic we really, really dig: fast, eager, creative learners.<p>The kinds of things you might find yourself working on are:<p>-Building and&#x2F;or extending a RESTful web api for an AngularJS web application<p>-Database tuning and rewriting&#x2F;extending&#x2F;creating SQL stored procedures<p>-Designing and building business management tools (to help our business and our clients&#x27;)--things like dashboards, alerts, and other &quot;knowledge radiators&quot;<p>-Building and&#x2F;or rebuilding a data movement pipeline (we do lots of data integrations with our clients and other 3rd parties)<p>-Mobile apps for our in-the-field and on-the-road workforce, and for motorists<p>-Tools for us, the developers, to make our own lives easier<p>Apply with resume and description(s) of your greatest achievements to dsoudah[at]paylock.com.  Include Hacker News in the subject line.","time":1504285837,"type":"comment"}