{"by":"michaeloutwest","id":15150935,"kids":[15150945],"parent":15148885,"text":"HintMD | Senior Software Engineer | Pleasanton, CA | Full Time | ONSITE<p><a href=\"https:&#x2F;&#x2F;hintmd.com\" rel=\"nofollow\">https:&#x2F;&#x2F;hintmd.com</a><p>HintMD is a well-funded high technology start-up in the healthcare industry. Our platform enables physicians to curate treatment plans for patients, and deliver the convenience to help patients achieve results. We enable consumers to fully engage within the aesthetic industry, know what is right for them, and stay compliant with a personalized plan that guides them through each step on their journey to be their best.  We are a revenue generating business that is actually growing!<p>We are looking for talented full-stack&#x2F;generalist engineers to join our world class, results driven team. This is an opportunity to make a big impact in a small team and to have fun.  It’s way better than those boring big-corporate red-tape meetings-all-the-time-sucks-the-life-out-of-you jobs.<p>We use Java and Python on the back end, and GraphQL&#x2F;Apollo with React&#x2F;Redux on the front end.<p>You will:<p>* Design, code and ship new features on our web app at high velocity and high quality with well-structured and secure code.<p>* Troubleshoot debug, and fix issues in production and non-production environments<p>* Coach and mentor peer engineers to become great developers and recommend best practices and tools.<p>* Help with DevOps and IT tasks as necessary.<p>* Have fun<p>As a key member of our growing team, we expect you to align and extend our culture. We’d like you to teach us new things, improve our systems and processes, show passion for what you do and bring intellectual honesty and resourcefulness.<p>We believe that healthy people fuel healthy culture. We offer health, dental and vision benefits, as well as three weeks paid vacation per year at the minimum. When you join the team, you also become an owner – yes, we offer equity – this way we all are winning!<p>If this sounds like the kind of work you would love to be doing, reach out to us and let’s chat about how we can combine forces!<p>Email us directly at jobs@hintmd.com, or find more info on our website: \n<a href=\"http:&#x2F;&#x2F;hintmd.com&#x2F;careers&#x2F;#engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;hintmd.com&#x2F;careers&#x2F;#engineer</a>","time":1504289050,"type":"comment"}