{"by":"analen","id":15150379,"parent":15148885,"text":"Lead of ML at Jungla | Bay Area, CA | Full-time<p>Jungla’s mission is to ensure we all find meaningful answers to the increasing number of questions we ask of our genomes as patients. Personalized medicine depends upon accurately finding and interpreting our genetic differences. While technological advances have revolutionized our ability to find these differences, genetic tests often fail to interpret these differences, leading to inconclusive results and clinical uncertainty. This is both a limitation of existing data and approaches. Jungla’s strategy unites experts in functional genomics, computational biophysics, and machine learning to develop proprietary solutions for genetic interpretation. The guiding principles at Jungla are rooted in knowledge generation, performance, scalability, and transparency. Our team strives to make genetic tests more useful, faster, and less expensive.<p>What You&#x27;ll Do: At Jungla, you will help patients better leverage their genomic information across a wide-array of genetic and genomic tests. To achieve this, you will develop new models and systems that learn from diverse and increasingly complex computational and experimental data types. In addition, you will help establish and promote a culture of engineering excellence.<p>Opportunity: Ownership and Direction; Engineering Excellence; Technical Development; Improve Healthcare<p>Let&#x27;s Talk If: You know deep learning: Tensorflow (preferred), (py)Torch, Caffe, Theano, etc.;<p>You are passionate about driving insights from data;<p>You care about code;<p>You own your work.<p>Why You&#x27;ll Love Working at Jungla: We combine competitive compensation and benefits with the opportunity to work on challenging and worthwhile problems. You will work with an interdisciplinary team at the interface of computer science, biophysics, and genomics, developing elegant technological solutions to improve patient care.<p>Mission-Driven Organization; Values-Driven Culture; Team &amp; Growth.<p>Send your details to MLjobs@oxeonpartners.com","time":1504285882,"type":"comment"}