{"by":"mebassett","id":15168843,"parent":15148885,"text":"London | Full-time | ONSITE<p>Trivium Real Estate Ltd<p>We&#x27;re a young, investor-backed data-mining startup. We provide fast and accurate analysis of documents related to real estate investments. We&#x27;re currently four people, and recruiting experienced engineers to help build out our MVP.<p>Like any startup we eager to ship quality code to improve our customers&#x27; daily lives.  But more than that, we have a strong focus on continued learning &amp; development for ourselves, manifested in our support for tech conferences for our trade.  We hope to attract like-minded people.<p>### Front End Engineer | £45-55k DOE + Equity<p>Our front-end app is completely new, and you&#x27;ll be writing the first few lines of code while working with data engineers and scientists.  You&#x27;ll also be working with our founders and partner companies; we hope you&#x27;ll bring an eagerness to learn and empathise with our users and customers.<p>Since this is &quot;greenfield&quot;, we aren&#x27;t married to any particular framework or stack and are interested in what you bring.  We do have a strong bias towards functional programming, however.<p>More than anything else, we&#x27;re looking for someone with experience in shipping front end user interfaces into production.<p>Requirements\n* Professional experience shipping production front end apps in javascript + your favourite framework.\n* Comfortable working with customers and clients and able to empathise with their needs.\n* Knowledge of at least one functional programming language.<p>### Data&#x2F;Software Engineer | £50-60k DOE + Equity<p>We&#x27;re recruiting an experienced software engineer to help us on our data mining infrastructure.\nThis role is a mix of traditional back-end engineering for web and mobile apps with exposure to machine learning and data-mining techniques.<p>Requirements\n* Professional experience shipping applications in Python\n* Familiarity with regression, classification, and ranking algorithms\n* Knowledge of at least one of: Racket, Rust, Julia, Clojure, Haskell, or OCaml<p>Contact me (info in profile) or email us at careers@triviumre.com","time":1504538649,"type":"comment"}