{"by":"SJES","id":15219115,"parent":15148885,"text":"SOFTWARE INSTALLATION DEVELOPER | 100% REMOTE | RAISING THE FLOOR - US\nThis is a contract position for 6 months.<p>THE POSITION\nYou will help a team of bright and talented developers located across continents who are passionate about our vision, that of radically improving the access to technology. How? By helping to develop associated system that supports the “portability” of user preferences across any platform or device -- that makes it easier for anyone to be able to have the technology they encounter automatically change into a form they can understand and use. We are looking for a talented software engineer to lead and develop one of the associated systems of GPII called Installation on Demand (IoD). This system will allow GPII to install and use Assistive Technology (AT) software on demand, whenever required by a user.<p>WHAT YOU WILL DO<p>- Become a member of a small development team building applications and tools around GPII.<p>- Develop an Installation on Demand  (IoD) system that stores and provisions Assistive Technology and other software on Windows computers.<p>- Integrate IoD with mainstream open source software distribution systems (Chocolatey, Homebrew, PackageKit, etc.)<p>- Work in and contribute to an open source project.<p>- Be involved in all of the phases of the IoD project, from project inception to release phase.<p>WHAT WE ARE LOOKING FOR<p>- 3+ years experience in developing installation software - particularly in systems where users do not have admin privileges.<p>- 3+ years of experience developing in one or more programming languages on a daily basis (e.g., JavaScript, Go, C&#x2F;C++).<p>- 3+ years of experience in systems programming.<p>- Experience with software distributions and&#x2F;or complex software deployment systems.<p>- Experience with cloud computing and storage platforms (AWS, etc.).<p>- Experience with large scale and globally-distributed deployments.<p>- Experience advocating for the end-user through all of the phases of the product development process.<p>- Experience working successfully with a remote distributed team.<p>- Able to work independently to complete tasks on schedule without close supervision.<p>- Highly motivated, self-directed, and able to thrive in ambiguity.<p>This is a 6-month contract positions. \nTo apply, send resume or CV to jobs@raisingthefloor.org","time":1505143027,"type":"comment"}