{"comments":[{"by":"tptacek","id":2950422,"kids":[2952377,2951576,2953853],"parent":2949787,"text":"Chicago, New York, San Francisco Bay Area<p>Matasano Security<p>Job Title: They look and before them is a pale horse, and its rider was named memory corruption, and hell followed close behind.<p>We're looking for people who can do Ruby. And C. And Python. And Java. And Scala. And asynchronous network code. And MySQL. And Redis. And C++. And MongoDB. And Riak. And Berkeley DB. And kernel drivers. And x86 assembly. And Objective C. And block ciphers. And digital signatures. And hash functions. And iOS development. And template metaprogramming. And ARM assembly. And MIPS assembly (yes really). And FIX protocol. And market order management systems. And Android systems programming. And Javascript. And Rails. And Django. And statistics. And linear algebra. And graph theory. And SAT solvers. And signal processing. And software radio. And soldering. And hardware debugging.<p>Knowing all that on day one would sure be nice, but it's enough for us that you (a) can code well in something and (b) <i>want to do all that stuff</i>.<p>We're looking for someone who could work at any of the largest or best software companies in the world, so we can work with them at all of the largest and best software companies in the world. Matasano Security is one of a small number of firms that specializes in software security. People contract us to beat the living shit out of their code before they ship it to customers. So a vindictive streak is helpful, but not required.<p>I wrote down everything I could think of about our hiring process here:<p><a href=\"http://www.matasano.com/careers\" rel=\"nofollow\">http://www.matasano.com/careers</a><p>Full benefits. Market comp. Infinite free books from Amazon. Smart coworkers.<p>My contact information is in my profile.","time":1314891305,"type":"comment"},{"by":"kamens","id":2951118,"kids":[2958226],"parent":2949787,"text":"Mountain View - Khan Academy\n(full-timers and interns welcome year-round)<p>Our mission is to provide a world-class education to anyone, anywhere. We already have millions of students learning every month, and we're growing quickly.<p>Our students answer over a million math exercise problems per day, all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>, <a href=\"http://ejohn.org/blog/khan-exercise-rewrite/\" rel=\"nofollow\">http://ejohn.org/blog/khan-exercise-rewrite/</a>), and Sal's videos have been viewed over 74MM times.<p>Working for Khan Academy is one of the highest educational impact positions you can imagine.<p>We're hiring all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1314900913,"type":"comment"},{"by":"jgrahamc","id":2949825,"kids":[2949837],"parent":2949787,"text":"Remember that for all month round \"Who's hiring?\" there's my HN-inspired and recruiter free site UseTheSource: <a href=\"http://jobs.usethesource.com/\" rel=\"nofollow\">http://jobs.usethesource.com/</a>","time":1314882313,"type":"comment"},{"by":"Aloisius","id":2950952,"parent":2949787,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 12 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Objective-C engineers for iPad development\n  * Web developers (we're a Django shop)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees. H1B ok.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a><p>Questions - jobs@seatme.com","time":1314898504,"type":"comment"},{"by":"3pt14159","id":2950769,"parent":2949787,"text":"Lots of companies are hiring in Toronto.\nThe Mantella companies are all pretty good: <a href=\"http://mantellavp.com/category/jobs/\" rel=\"nofollow\">http://mantellavp.com/category/jobs/</a><p>And of course FreshBooks never stops hiring. I've heard they are also OK with contractors too: \n<a href=\"http://www.freshbooks.com/careers/\" rel=\"nofollow\">http://www.freshbooks.com/careers/</a><p>I've heard the Jet Cooper is hiring a front end dev (though they don't normally post jobs):\n<a href=\"http://www.jetcooper.com/\" rel=\"nofollow\">http://www.jetcooper.com/</a><p>Then there is The Working Group:\n<a href=\"http://www.theworkinggroup.ca/\" rel=\"nofollow\">http://www.theworkinggroup.ca/</a><p>Nulayer is an awesome (funded) product company with hardcore ruby devs:\n<a href=\"http://nulayer.com/\" rel=\"nofollow\">http://nulayer.com/</a><p>Unspace is looking for more devs (that's where ragenwald works):\n<a href=\"http://unspace.ca/\" rel=\"nofollow\">http://unspace.ca/</a><p>Mozilla is hiring for their new, better-in-all-ways office, though you basically need to know someone that works there.","time":1314896339,"type":"comment"},{"by":"donmullen","id":2951680,"parent":2949787,"text":"Durham NC (main office) - REMOTE full-time and contractors<p>Relevance, Inc.<p><a href=\"http://thinkrelevance.com\" rel=\"nofollow\">http://thinkrelevance.com</a><p><a href=\"http://thinkrelevance.com/jobs\" rel=\"nofollow\">http://thinkrelevance.com/jobs</a><p>We are Clojure/core (<a href=\"http://clojure.com\" rel=\"nofollow\">http://clojure.com</a>).<p>Relevance has been voted as one of the Best Places to Work in the Triangle (Triangle Business Journal).  We have a fantastic work environment that includes 20% Fridays (work on open source, giving back to the community, or internal projects), and a fantastic benefits package.<p>Relevance is increasingly a virtual company and have many remote full-time developers around the country.  We're now opening up the project manager positions to being remote as well.<p>Come work with some of the best Ruby/Rails and Clojure developers on solving interesting, hard problems that make a difference.","time":1314909839,"type":"comment"},{"by":"yummyfajitas","id":2950119,"kids":[2950679],"parent":2949787,"text":"Pune, India - we are looking for a general purpose developer who is smart and gets things done.<p>We are building a search engine/knowledge representation system for fashion.<p><a href=\"http://styloot.com/parametric_search/search/dress-search\" rel=\"nofollow\">http://styloot.com/parametric_search/search/dress-search</a><p>The best way to describe working here is to describe my last month: I built a document classifier (based on max entropy), a backbone.js app, fixed bugs in django-tyrant-cache and started building a NoSQL database which supports color-based queries (\"find all the items with color similar to #df3426\" [1]). Your job will be to do similar things.<p>(If all that stuff sounds out of your league, it sounded out of mine too, until I got started.) We use javascript, python/django, hadoop, and haskell, though we really don't care if you've never touched any of those technologies.<p>Contact info is in my profile. Send a link to your github or other work you've done if you are interested. Here is our github: <a href=\"https://github.com/styloot\" rel=\"nofollow\">https://github.com/styloot</a><p>[1] We aren't jumping on a silly NoSQL bandwagon. It's very easy to compute l^p distances on RGB records in your favorite SQL database, but RGB doesn't map very well to human perception of color.","time":1314887117,"type":"comment"},{"by":"ropiku","id":2950003,"parent":2949787,"text":"FreeAgent (Edinburgh, UK), intrepid developers of online accounting happiness<p>We're looking for developers to join a team of smart, friendly people who dig that work/life balance.<p>Ruby/Rails Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/rubyrails-engineer-product\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/rubyrails-engin...</a><p>Senior Platform Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/senior-platform-engineer\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/senior-platform...</a><p>Accounting Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/accounting-engineer-platform\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/accounting-engi...</a><p>Ruby/Rails Support Engineer <a href=\"http://www.freeagentcentral.com/company/jobs/rubyrails-engineer-support\" rel=\"nofollow\">http://www.freeagentcentral.com/company/jobs/rubyrails-engin...</a><p>Email us at jobs@freeagentcentral.com. We're also open to remote working for exceptional candidates (there's a couple of us who are spread throughout the UK).","time":1314885109,"type":"comment"},{"by":"squirrel","id":2949884,"kids":[2950069,2951178],"parent":2949787,"text":"London (UK) and Boston (US). H1B<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're hiring developers and other smart folks of many kinds. See <a href=\"https://dev.youdevise.com\" rel=\"nofollow\">https://dev.youdevise.com</a> and <a href=\"http://www.timgroup.com/careers\" rel=\"nofollow\">http://www.timgroup.com/careers</a>.<p>While we don't have remote workers, we do help successful candidates relocate to London or Boston including arranging visas where needed. For example, last year we hired HN readers from Denmark and the US, and we moved a Polish employee to Boston.<p>Note we recently changed our name from youDevise to TIMGroup but we're still the same folks!","time":1314883250,"type":"comment"},{"by":"benologist","id":2949851,"kids":[2965486],"parent":2949787,"text":"Palermo, Buenos Aires, Argentina<p>Playtomic is casual gaming analytics and services.  We're funded and ready to start scaling up our team.<p>Looking for .NET, Android and iOS developers.<p>If you want to work on a site that deals with a ridiculous volume of data generated by over 300,000 <i>concurrent</i> people playing the games we track (and that number's going to get a lot bigger this year!) then you're going to love this.  We're using tons of C#, SQL Server, and a growing amount of MongoDB, and I'm open to using what you're best at if it works.<p>Android and iOS devs will be maintaining, further developing and supporting our APIs for those platforms, and should have completed a game or two.  If you love making games you'll love working on Playtomic because it won't interfere too much.<p>ben at playtomic.com","time":1314882769,"type":"comment"},{"by":"snowmaker","id":2950499,"kids":[2954146],"parent":2949787,"text":"San Francisco, CA (H1B, INTERN no problem)<p>Scribd (social publishing, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p><i></i> We've hired TWO people from these \"Who is Hiring\" threads ... it really works!!! <i></i><p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript<p>* iOS<p>* Machine Learning / Data mining kinds of problems<p>* Product managers, from web or mobile backgrounds<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.<p>We're well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very flat organizational structure that gives a lot of product ownership to engineers, and a really terrific team.<p>Last month we launched our first iPhone app, called \"Float\", which hopes to make reading a better experience. If you're a fan of reading apps like Instapaper and Reeder, you're already familiar with what we're doing. See <a href=\"http://tcrn.ch/pCwT4c\" rel=\"nofollow\">http://tcrn.ch/pCwT4c</a> for more.<p>Feel free to email me directly: jared@scribd.com<p>Jared","time":1314892336,"type":"comment"},{"by":"mkeblx","id":2950695,"parent":2949787,"text":"Madison, WI - (REMOTE possible)<p>Circuit - <a href=\"http://circuitapp.co\" rel=\"nofollow\">http://circuitapp.co</a><p>Github for hardware. Circuit is a social webapp for designing and building electronic projects (circuit boards), aimed at the exploding Maker/hobbyist market. We're going to disrupt hardware with a tool that makes things 10x easier &#38; faster.<p>Programmer: We are looking for a passionate all-around programmer, experienced with creating advanced frontend interfaces as well as backend systems. Mainly would be doing a large amount of HTML5, Javascript, and using PHP (Cake) &#38; MySQL on the backend. Big bonus points if you have a hardware background: microcontrollers, designing PCBs, tearing things apart, and familiarity with the Maker movement.<p>UI/UX Designer: You: experienced with the design of web applications with a strong emphasis on the UX to make a simple and clean interface. Also wireframe concepts, diagram workflows and create various assets needed for the application.<p>Interested, questions? jobs@circuitapp.co","time":1314895185,"type":"comment"},{"by":"ghotli","id":2950079,"kids":[2968060],"parent":2949787,"text":"Memphis, TN<p>American Roamer (<a href=\"http://www.americanroamer.com/\" rel=\"nofollow\">http://www.americanroamer.com/</a>)<p>We track all the cell phone coverage in the world and have been for 20 years. Our cellmaps product line has been used to build interactive coverage maps for carriers and an in-browser spatial analysis tool for comparing primarily wireless and cable datasets. We're a small company with a small engineering team but we're dealing with engineering at scale as our infrastructure is rendering and pushing out millions of map tiles a day.<p>Our business and products are growing rapidly and we're looking for someone with significant software engineering experience to come in as a mentor in the position of director of software development. You'll be a major player during our shift from a data company to a software company.<p>Some technologies we use that you may find interesting: aws,  node.js, solr, mongodb, javascript, ruby, c, rails, chef, and others.<p>Email us at hr@americanroamer.com if you're interested.","time":1314886500,"type":"comment"},{"by":"nikibeth","id":2950074,"parent":2949787,"text":"Raleigh, NC - AgileZen (<a href=\"http://agilezen.com\" rel=\"nofollow\">http://agilezen.com</a>)<p>Internet Marketing Specialist for the AgileZen product at Rally Software<p>We’re looking for someone awesome to run all the marketing activities for our product. This role will have a lot of variety and freedom, so we need someone who can wear a lot of hats and is a self-starter. The responsibilities for this position will include: guiding changes to our current marketing website, running pay-per-click campaigns, communicating with customers via email, spreading the word about the product using social media, and organize materials for conferences and events.<p>We're a small team that likes to work hard, but have fun too. We have a keg in the office and we play video games to blow off steam, so if this environment seems like a good fit for you, check out the full job description (<a href=\"http://t.co/T2WJRjw\" rel=\"nofollow\">http://t.co/T2WJRjw</a>) and apply!","time":1314886450,"type":"comment"},{"by":"harper","id":2950426,"parent":2949787,"text":"Chicago, IL - Obama for America (<a href=\"http://barackobama.com\" rel=\"nofollow\">http://barackobama.com</a>)<p>We are looking for QA, iOS, DBA, DevOps and Data Science engineers to join our department through November 2012 at our Chicago headquarters.<p>The Obama for America Technology department builds and maintains the software that powers the campaign’s websites and interactive online presence.  Our team’s products support the campaign’s efforts to inform voters, organize supporters and raise money.<p>Email us at techjobs@barackobama.com for more info.","time":1314891395,"type":"comment"},{"by":"yoavlurie","id":2950326,"kids":[2950341,2972947],"parent":2949787,"text":"Boulder, CO -- TechStars company Simple Energy -- <a href=\"http://www.simpleenergy.com\" rel=\"nofollow\">http://www.simpleenergy.com</a><p>4 Positions: <a href=\"http://www.simpleenergy.com/jobs\" rel=\"nofollow\">http://www.simpleenergy.com/jobs</a><p>* Product Manager (gaming experience pref'd)<p>* Front-End Engineer<p>* Back-End Engineer<p>* SysAdmin/DevOps<p>Simple Energy is making saving energy social, fun, and simple. We change how millions of people save energy by changing how utilities engage their customers. We take real energy data and create social games and contests that drive people to save energy. You could be the fifth member of a funded startup that Mashable recently named one of \"8 Startups that are Changing the World.\" <a href=\"http://mashable.com/2011/08/19/startups-for-good/\" rel=\"nofollow\">http://mashable.com/2011/08/19/startups-for-good/</a><p>* Generous moving benefits to beautiful Boulder, CO<p>* Awesome Mac setup<p>* Sweet office w/ standup desks overlooking a creek<p>* Every new employee saves enough energy to power 1,000 homes","time":1314890041,"type":"comment"},{"by":"bilalhusain","id":2949854,"parent":2949787,"text":"New Delhi, India; onsite developers<p>Looking for passionate developers and designers to work with insanely talented people on relatively simpler problems.<p>developer:<p>* node/express developer (priority o/w: scala/haskell/erlang/ocaml &#62; python/ruby/perl &#62; java/c# in addition to exposure to good web frameworks like spring, rails, django, lift. Strictly, no f#. British php will be considered!)<p>* optionally, mongodb skills<p>designer:<p>* proficient in css3/html5/backbonejs development<p>* optionally, comfortable with coffeescript<p>location: New Delhi / Gurgaon, India<p>contact: bilal@bilalhusain.com<p>catch:<p>* the candidate has to be physically present for a coding session in Delhi NCR<p>* developer starts with Rs.40K/month salary","time":1314882814,"type":"comment"},{"by":"mikebabineau","id":2950516,"parent":2949787,"text":"Redwood Shores, CA (SF Bay Area) - Engineers and more<p>BioWare SF is hiring! Formerly known as EA2D, we are now the online/social arm of the BioWare group.<p>We're working on exciting projects:<p>* Social games for gamers (from BioWare and others)<p>* Game APIs (web services for online games)<p>We're small (30 people) and scrappy. And we're growing fast: 0-200 servers in the past 8 months. Tech stack is primarily AS3/Java backed by MongoDB, but we're writing more in Python, JavaScript, and Ruby. We have a highly automated infrastructure running on AWS (EC2 w/ELBs and ASGs, EMR, SQS, Beanstalk, etc., plus more than a few super-secret/unreleased Amazon features) and Google App Engine. Buzzword potpourri includes Chef, node.js, Hive, Graphite, Tomcat, Spring, Maven, Hudson, GitHub, Pingdom, Loggly, PagerDuty, and continuous deployment. &#60;3 DevOps. We have a small but growing list of open source projects (see <a href=\"http://github.com/ea2d\" rel=\"nofollow\">http://github.com/ea2d</a> and <a href=\"http://eng.ea2d.com/\" rel=\"nofollow\">http://eng.ea2d.com/</a>).<p>We need backend and systems engineers, artists, PMs, and more. Detailed listings are here: <a href=\"https://jobs.ea.com/search/advanced.do?q=bioware&#38;globalRegionID=a1W500000004CClEAM&#38;locationID=a1W500000004CAnEAM&#38;jobCategoryID=\" rel=\"nofollow\">https://jobs.ea.com/search/advanced.do?q=bioware&#38;globalR...</a><p>I lead the platform team. Drop me a line if you're interested: mikeb@ea2d.com","time":1314892481,"type":"comment"},{"by":"lpolovets","id":2950350,"parent":2949787,"text":"Los Angeles or Bay Area or Shanghai preferred, but remote work is possible for exceptional candidates. Full-time only. If you're interested in working remotely, you must live in the U.S. H1B is okay.<p>Factual aims to be the place where people meet to share, improve, and mash-up data. Our vision is to be an awesome and affordable data provider, so that big companies, startups, and developers can focus on innovation instead of data acquisition.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). Last year we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, SimpleGeo, and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We currently have about half a dozen job openings, from data engineering to software engineering to system administration. For the software engineering position, you would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p>If you're interested in the Bay Area office, it's just starting up, so you'd have a significant influence on the culture there.<p><a href=\"http://www.factual.com/jobs\" rel=\"nofollow\">http://www.factual.com/jobs</a> or you can email me personally at leo -at- factual.com. Thanks for reading!","time":1314890365,"type":"comment"},{"by":"BryanCrow","id":2951048,"parent":2949787,"text":"WonderHowTo.com Seeks Tech Blogger/Moderator (Work Remotely)<p>WonderHowTo is a place for both tech geeks &#38; amateurs to gather and learn about what's new, and how to make the most of it.<p>We need a writer/community admin to help answer community questions, cover the latest hot releases on the web, mobile, &#38; desktop, and write in-depth tutorials to help non-technical people learn everything from how to secure their wifi network to controlling their privacy on Facebook. You should have deep technical knowledge, yet be able to write accessible and interesting articles that regular users can follow and find interesting.<p>This candidate would head up an all-things-tech World as a community admin (learn more about WonderHowTo Worlds here), and should be capable of:<p>- Keeping an active forum going\n- Writing interesting, joe-user readable tutorials\n- Posting latest news in software, apps, privacy issues, &#38; helpful tricks on getting things done faster\n- Build a following on the site &#38; across the nerdier social networks (ex: Google+)<p>Please note: Candidate must be savvy with both OS X, &#38; Windows (*nix would be a plus), confident in troubleshooting tech-related issues, have strong writing skills, and participate in tech forums/blogs.<p>Option to work remotely... from anywhere!<p>TO APPLY<p>Please send the following to rmansur@wonderhowto.com:<p>Your resumé, plus 1-2 writing samples, preferably on the topic at hand. Please show proof/link to online communities you're active in.","time":1314899843,"type":"comment"},{"by":"kabir_h","id":2949878,"parent":2949787,"text":"Somerville, MA and London - The Echo Nest<p>Echo Nest is a music intelligence company that powers music apps with our API, and services like Echoprint, our open source music fingerprinter. Our data powers apps for the BBC and MTV and music services you've used. We've got a killer engineering culture, well-stocked beer fridge and you'll be able to shape the future of music.<p>App Systems Engineer - London Office<p>Engineer<p>Junior Engineering Intern<p>Music Information Retrieval Scientist<p>QA Manager<p>Senior Engineer<p>Web Developer - London Office<p><a href=\"http://the.echonest.com/company/jobs/\" rel=\"nofollow\">http://the.echonest.com/company/jobs/</a>","time":1314883205,"type":"comment"},{"by":"jack7890","id":2949911,"parent":2949787,"text":"Web Engineer - SeatGeek - New York, NY<p>We're looking for a web engineer who is super-hungry and sees building web apps as more than just a job. We're a data-driven web app that's trying to use analytics and exceptional UX to making buying event tickets a wholly better experience.  #Python #Ruby #PHP #MySQL #Redis #MongoDB #Javascript<p>Competitive comp, outstanding benefits, and a kick ass team. Only looking for folks in NYC.<p><a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1314883632,"type":"comment"},{"by":"nfriedly","id":2951434,"kids":[2951534],"parent":2949787,"text":"San Mateo, CA<p>Sociable Labs is building the future of social commerce and we're looking for a few more engineers to help. A passion for learning, communication skills, and intellectual horsepower are more important to us than what you know.<p>Our product is essentially a more advanced version of facebook's social plugins. See a couple of examples at <a href=\"http://www.backcountry.com/ski\" rel=\"nofollow\">http://www.backcountry.com/ski</a> (\"Ask your friends\" section at bottom) and <a href=\"http://www.active.com/running/modesto-ca/the-cancer-awareness-run-and-ride-2011?int=29-12\" rel=\"nofollow\">http://www.active.com/running/modesto-ca/the-cancer-awarenes...</a> (\"Connect with friends\" section on the right)<p>We have a modular JavaScript front end that works with the Facebook platform and makes use of cutting edge technologies like localStorage and CORS (cross-domain ajax). Our back end is Java / Jetty / Postgres on Amazon EC2.<p>We offer competitive pay, great benefits (including the best PTO policy I've ever seen), and an enjoyable working environment.<p>More details about the company and the jobs here: <a href=\"http://www.sociablelabs.com/careers.htm\" rel=\"nofollow\">http://www.sociablelabs.com/careers.htm</a><p>I work on the front-end but feel free to ask me questions about anything. If I don't know, I'll get you to the right person. Reply here or email nathan@[company site].com","time":1314906013,"type":"comment"},{"by":"mattculbreth","id":2949883,"kids":[2949930],"parent":2949787,"text":"Atlanta, GA<p>Venture-backed security software company. Two kinds of opportunities:<p>* Python, Cassandra, Hadoop. Big data, map reducing it to find interesting stuff related to security and the web.<p>* Python, Django, jQuery and JavaScript. Making really cool UIs to help people analyze all that big data we find.","time":1314883217,"type":"comment"},{"by":"RichardPrice","id":2951306,"parent":2949787,"text":"San Francisco, CA<p>Academia.edu is a platform for sharing research. Fundamentally we are trying to massively speed up the rate at which research whizzes around the world. For people who have just published a paper, we want that paper instantly to get into the hands of people. For people who are following research, we want our News Feed to deliver them the latest papers in their fields in real time. <p>Right now we have over 550,000 academics signed up, with about 2,000 joining each day. Our monthly uniques are over 2 million. We have about 700,000 papers, with about 80,000 new papers being added per month. Amongst other technologies, we work with Rails, Redis, MongoDB, Beanstalkd, Varnish, Solr, PostgreSQL, Node.js and Memcached.<p>We're a small team of 7 people in San Francisco, backed by venture capital (Spark Ventures) and angel investors (Mark Shuttleworth, founder of Ubuntu, and Rupert Pennant-Rea, Chairman of the Economist, amongst others). We have a very engineering-focused culture. You can read more about our culture here <a href=\"http://academia.edu/hiring/culture\" rel=\"nofollow\">http://academia.edu/hiring/culture</a> and here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>We have a very collaborative culture, where everyone discusses everything going on with the company: engineering, product, revenue, user growth, recruiting. We think that building a successful startup is hard enough that we need to leverage everyone's brain power.<p>We're very happy to handle the H1B application process for foreign applicants. For anyone interested to learn more, feel free to email me directly at richard [at] academia.edu","time":1314903844,"type":"comment"},{"by":"timsally","id":2950843,"parent":2949787,"text":"Lexington/Boston/Cambridge, MA. Full time and summer internships.<p>I work at MIT Lincoln Laboratory (<a href=\"http://www.ll.mit.edu\" rel=\"nofollow\">http://www.ll.mit.edu</a>), a research and development center run by MIT that does work for the government. My group has about 20 people in it and does application security and reverse engineering. Knowledge of things like assembly, operating systems, and systems are pluses but not required. It's great if you have some experience in those things, but if you can code I want to talk to you. The pluses:<p>* Awesome workplace culture. We're a 9-5 shop, you pick your laptop, and you can order any books that you need.<p>* We provide a lot of training. We send you to conferences, including Blackhat and Defcon. We also reimburse tuition at MIT. Last semester my office mate took operating systems with Robert Morris.<p>* We sponsor relocation and have multiple positions we want to fill immediately.<p>You do need to be a US citizen and you will have to get a security clearance. I'm happy to talk to you about how the clearance process works and answer any questions you have! If you're local I'll buy you a cup of coffee while we talk it over. You really can't waste my time.<p>Email: tsally@mit.edu","time":1314897314,"type":"comment"},{"by":"willowgarage","id":2950599,"parent":2949787,"text":"Palo Alto, CA (willing to consider relocation or remote work) <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>Telepresence Robotics<p>Suitable Technologies is a startup working to create an innovative new product for something called \"remote presence.\"  (Another common term is \"robotic telepresence.\")<p>Our first product, in development now, is similar to video chat on a computer you can drive around.  Unlike videoconferencing, you’re not stuck to a wall or desk.  It becomes your physical presence, anywhere in the world, with the freedom to move and interact with people as if you were there.  Our technology has already been seen by millions of people, and we think the potential impact is substantial.<p>We're looking for great engineers and designers.  We need help in C++, multimedia, web frontend and backend, UI/UX design, electrical, networking, and more.  We think this could be a unique opportunity for someone with experience in web or mobile to work on something a little different.<p>We have funding and offer competitive compensation.<p>More information is available on our site: \n<a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>Contact:\njobs@suitabletech.com","time":1314893660,"type":"comment"},{"by":"cristinacordova","id":2951045,"parent":2949787,"text":"Palo Alto, CA - Pulse - <a href=\"http://pulse.me\" rel=\"nofollow\">http://pulse.me</a><p>We're hiring iOS and Web Developers to join our 14-person team. Pulse is an award-winning application that makes it easy to consume news on mobile phones and tablets. Pulse has been named to the Apple’s App Store Hall of Fame, chosen as an Android Editor’s Choice app, selected as one of TIME’s top 50 iPhone apps of 2011, and honored with the Apple Design Award.<p>We're looking for iOS developers to build out the Pulse iPhone and iPad applications, which support millions of users. Each of us is part engineer, hacker and product designer. This role requires existing experience with CocoaTouch and iOS programming. Specifically, we would love to hear about iOS applications you have worked on either professionally or in your free time.<p>We're looking for web developers with expertise in HTML/CSS/Javascript/JSON, extensive knowledge of server-side technologies such as Rails/Python/Django, experience developing web applications following W3C standards and taking into account cross-browser compatibility.<p>Send me an email so we can learn more about you at cc[at]alphonsolabs[dot]com","time":1314899759,"type":"comment"},{"by":"alanpeabody","id":2950021,"parent":2949787,"text":"Draker Labs (<a href=\"http://drakerlabs.com/company/jobs\" rel=\"nofollow\">http://drakerlabs.com/company/jobs</a>), Burlington, VT (REMOTE okay for some positions and candidates)<p>Current openings include :<p>* QA engineer<p>* Web application architect<p>* Web development team lead<p>* Business technical analyst<p>Near term future openings include :<p>* Web application developers (REMOTE okay for exceptional candidates)<p>* QA engineers<p>* DBA<p>* Dev Ops<p>What is Draker?<p>Our CEO says: “Draker provides data acquisition, monitoring and control of large scale solar plants.  Draker has achieved 300+% growth in the North American commercial solar market over the past two years, and expects continued exponential growth from expansion into the utility scale market.”<p>Our company goal is to make solar a viable option in the US and world wide, and to make enough money to support ourselves doing it.<p>As a developer I consider us the NewRelic/GA of PV monitoring. We are facing challenges such as scaling, storing and processing an ever increasing quantity of data, creating a compelling and dynamic user experience for a complex problem, and working with real time data.<p>This job means something and most people are here to help make that difference. This is an industry that matters and a unique opportunity.<p>Some of the technologies we are using:\nRuby, Rails 3, SASS, Resque, Backbone, jQuery","time":1314885461,"type":"comment"},{"by":"dan_manges","id":2950261,"parent":2949787,"text":"Chicago, IL - Braintree (<a href=\"http://www.braintreepayments.com\" rel=\"nofollow\">http://www.braintreepayments.com</a>)<p>We mostly work with Ruby/Rails. Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node, Java, .NET, PHP, and Perl. Braintree is profitable, you'll have standard benefits (health/dental/vision), 401k match, ample vacation, an above market salary, and stock options.<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/inside-braintree/how-we-built-the-software-that-processes-billions-in-payments\" rel=\"nofollow\">http://www.braintreepayments.com/inside-braintree/how-we-bui...</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a> or email me (address in profile).","time":1314889130,"type":"comment"},{"by":"jerryr","id":2950305,"parent":2949787,"text":"San Francisco, CA (25 Kearny St) - MindTribe Product Engineering, Inc.<p>Hi, I’m MindTribe’s director of Software Engineering. I’m searching for people who enjoy learning and making. We’re a small company, and I’m looking for people with whom I would personally like to work and who want to work with me.<p>Here are the tools I use regularly: The C programming language (specifically ISO/IEC 9899:1990); Eclipse, Make, Subversion, Git, Python; Linux, Embedded Linux, Android, iOS; ARM processors (TI OMAP, TI Stellaris, NXP LPC); Atmel AVR/AVR32, Microchip PIC, TI MSP430, Cypress PSoC<p>Here is what I enjoy doing at work: Writing embedded software that runs on cool hardware; Figuring out how to apply agile techniques such as test-driven development to embedded product development; Reducing regressions and supporting customer development with agile techniques; Developing embedded libraries for things like USB, TCP/IP, graphics displays, sprites, fonts, encryption, etc.; Having long, dorky conversations with coworkers about programming languages, physics, estimating Facebook’s relative revenue distribution between advertising and games, etc.<p>Here is what I enjoy doing outside of work: Hiking, walking around San Francisco; Pseudonymous humor blogging; Cooking and baking; Photography; Reading. Recently: “Test Driven Development for Embedded C”, “The Clean Coder”, “The Four Steps to the Epiphany”, “The Art of Racing in the Rain”, “Norwegian Wood”, and \"The Mind's Eye\".<p>You can see examples of how I’ve applied my tools and passion here: <a href=\"http://mindtribe.com/portfolio/\" rel=\"nofollow\">http://mindtribe.com/portfolio/</a><p>You don’t have to use the same tools and you don’t have to enjoy the same things. But if you’re excited about similar stuff, drop me a line at hn@mindtribe.com to let me know.<p>We're also hiring Electrical and Mechanical engineers!","time":1314889606,"type":"comment"},{"by":"jmlacoda","id":2949831,"kids":[2950343],"parent":2949787,"text":"Philadelphia, PA<p>Lacoda is building a loan management web application and having an awesome time doing it. Our team is currently 3 people: 1 Pythoner, 1 JavaScripter and 1 lending guru. We need 2 more programmers to join our team!<p>We're looking for a Python programmer and a JavaScript programmer.<p>We're using Google App Engine for our backend and Backbone.js for our frontend.<p>Send an email to josh@lacoda.com and let's get to work!","time":1314882401,"type":"comment"},{"by":"bkudria","id":2967874,"parent":2949787,"text":"San Francisco, CA - Yammer<p>Yammer is an awesome tech startup masquerading as an enterprise software vendor. We're building an enterprise social network (an internal communication and collaboration tool. Like Facebook.) and we need your help.<p>We build our product with insight and wisdom gained from the consumer social networking space, but we charge enterprise prices (and our customers pay them!) We're fighting some big serious competitors (Salesforce/Chatter, Jive, and VMWare/Socialcast) and this space has never been more exciting.<p>Yammer is really changing the way people get work done. We have actual challenges to overcome and we're doing our best to make a kick-ass product that makes our users happy.<p>Tech we use: Ruby/Rails, Scala, and JavaScript. We have Obj-C and C# stuff too.<p>Some bullet points for you to skim:<p>• Amazing group of smart engineers to work with. Really.<p>• We hack in Ruby/Rails, Scala/JVM, Javascript/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT/Sharepoint stuff.<p>• Competitive compensation. Enough said.<p>• Delicious catered lunch and dinner daily, with a 3PM snack cart. Also a fully-stocked beer-and-beverage fridge.<p>• Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>Some links for you to read more:<p>• Our jobs page: <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>• Our Engineering blog: <a href=\"http://eng.yammer.com/\" rel=\"nofollow\">http://eng.yammer.com/</a><p>• A blog post about why it's so awesome to work here: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.html\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a><p>Feel free to get in touch: bkudria@yammer-inc.com","time":1315356197,"type":"comment"},{"by":"kemayo","id":2951264,"parent":2949787,"text":"Really REMOTE. You don't even have to be in the USA.<p>deviantART (<a href=\"http://www.deviantart.com\" rel=\"nofollow\">http://www.deviantart.com</a>) wants developers. We're fully remote; there's no central office with a devteam located there. We expect all hires to be comfortable working in PHP, JavaScript, CSS, and SQL; we like our developers to be able to hack on any part of the site, rather than being frontend/backend specialists.<p>One exception to all that: there's an Infrastructure Engineer position which is located in Vancouver. It's C++/Java focused, and involves developing backend services used by the rest of the site.<p>We post information about our development process here sometimes: <a href=\"http://dt.deviantart.com/blog/\" rel=\"nofollow\">http://dt.deviantart.com/blog/</a>\nApply here: <a href=\"http://deviantart.theresumator.com/apply?source=hn\" rel=\"nofollow\">http://deviantart.theresumator.com/apply?source=hn</a>","time":1314903224,"type":"comment"},{"by":"klochner","id":2950954,"parent":2949787,"text":"San Francisco, CA - in the Presidio<p>RentMineOnline (SeedCamp '08, FBFund '09)<p>We're profitable, growing, and looking for Rails developers, ideally people who are familiar with as much of the full web stack as possible.  Come join our tight team and see an immediate impact from your work.<p>Our ideal candidate can: (ordered by decreasing importance)<p><pre><code>  - add a new controller action + *decent* view code\n  - write AR model code with unit tests (we use rspec)\n  - write moderately complex SQL joins\n  - read/understand/refactor existing code\n  - code against a documented 3rd party api\n  - add an AJAX option to a controller action (jQuery)\n  - optimize an inefficient SQL query/table\n  - resolve a bad git merge\n  - know the likelihood of pulling a red ball out of an urn\n     (kidding, but prob/stats are important)\n  - research new tools/technologies\n  - edit server config files (nginx)\n  - administer ubuntu servers</code></pre>","time":1314898519,"type":"comment"},{"by":"hitch22","id":2950866,"parent":2949787,"text":"Palo Alto, CA - Rails Developer (CTO /co-founder?) (local preferred, but will consider other U.S.)<p>Stealth start-up focused on a consumer finance vertical that's very large like Mint.com's, but distinctly different and, we believe, more interesting / subject to disruption. The initial site/app is nearly completed and we're close to launch. Our non-local lead developer, pursuant to known prior commitment, became CTO at a local (for him) start-up in an unrelated area. We're looking for an experienced rails developer immediately to fill his shoes to take company to launch and beyond.  Ideally, this role would lead to co-founder / CTO role. Looking for very strong rails / jQuery / MySQL  expertise / experience, test-driven development style and excitement about transforming an industry in a way that helps a lot of people. If interested, please inquire at workfor@finpicture.com.","time":1314897697,"type":"comment"},{"by":"merchenta","id":2949895,"parent":2949787,"text":"London, England (UK)<p>Merchenta powers real-time behavioural retargeting for eCommerce retailers.<p>Looking for good Java/Scala developers. Ideally core Java experience in a non-J2EE environment and frameworks such as Spring or Guice and Hibernate.<p>Experience with machine learning and big data approaches a definite plus.<p>We could be open to remote depending on where you're based.<p>contact: careers@merchenta.com","time":1314883426,"type":"comment"},{"by":"jhull","id":2949983,"parent":2949787,"text":"Boston, MA (Ft Point Channel / Innovation District)<p>Buzzient Inc.<p>Harvests, analyzes and integrates social media data with enterprise applications. We are a SaaS application that also has the ability to push data to other apps to allow social customer service, erp and lead gen to happen (in enterprise apps such as Salesforce, Oracle CRM, Siebel, Interactive Intelligence)<p>We are a Python, jQuery, Linux shop and use the following libs and tools for dev: SQLAlchemy, Boto, Werkzeug, Fabric, Buildbot, Selenium, Git, JIRA, SVN. Developers work on DevOps, scrapers, NLP algorithms, testing tools and our front end. You get to do it all. The following skill set is also recommended <a href=\"http://i.imgur.com/wBhlk.gif\" rel=\"nofollow\">http://i.imgur.com/wBhlk.gif</a><p>Our Dev Team is less than 5 FT and we are looking to grow. See our job posting here <a href=\"http://bit.ly/pbvtFe\" rel=\"nofollow\">http://bit.ly/pbvtFe</a>","time":1314884586,"type":"comment"},{"by":"akharris","id":2949906,"parent":2949787,"text":"New York - Tutorspree (YCW11 - www.tutorspree.com)<p>We're building the marketplace for local tutoring. We're backed by some of the best investors in the world.<p>Looking to hire an engineer (PhP) and a designer. More info here: <a href=\"http://startups.hackruiter.com/tutorspree\" rel=\"nofollow\">http://startups.hackruiter.com/tutorspree</a>","time":1314883547,"type":"comment"},{"by":"veyron","id":2951602,"parent":2949787,"text":"Rockefeller Center NYC, onsite: #1 looking for #2<p>Bootstrapped prop ultra low latency trading firm (as opposed to a firm which originally had investors and later kicked them out), and I'm willing to cut significant equity. see <a href=\"http://news.ycombinator.com/item?id=2835656\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2835656</a> for some discussion of what I do.<p>I'm not a traditional finance guy, and I'm definitely not looking for a banking drone. Most of those tasks are handled by cron anyway. Sanctity of weekends are preserved.\nthe ideal candidate: mastery, to the level of obsession, with C/Python/coreutils; insatiable curiosity; inquisitive to a fault; chutzpah to challenge every assumption and assertion; calm under pressure; and desire to be involved in every aspect of the business.<p>Windonauts need not apply.<p>Excited? intransigence123@gmail.com","time":1314908647,"type":"comment"},{"by":"mmedia","id":2951277,"parent":2949787,"text":"Millennial Media has some awesome development jobs available in Baltimore, Washington DC, and San Francisco.  Check us out at \n<a href=\"http://www.millennialmedia.com/about-millennialmedia/careers/\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers...</a><p>Cutting edge Mobile technology!!","time":1314903433,"type":"comment"},{"by":"agotterer","id":2950220,"parent":2949787,"text":"New York, NY - Lot18 (<a href=\"http://www.lot18.com\" rel=\"nofollow\">http://www.lot18.com</a>)<p>Hiring Python and PHP engineers. (<a href=\"http://www.lot18.com/careers#software_2\" rel=\"nofollow\">http://www.lot18.com/careers#software_2</a>)<p>We believe building a strong engineering culture is the key to building a great company and product. Part of that vision is working with the best tools, many of which are open source. Here's a taste: Python, PHP, Ruby, JavaScript, Tornado, Chef, git, Vagrant, MySQL, Linux (Ubuntu), Apache, nginx, HAProxy, Amazon Web Services, Varnish, memcached, Capistrano, RabbitMQ, jQuery and more! Every piece of code that gets released to production is reviewed first to ensure high code quality, coding standards and continued learning. Our engineering team is 10+ and growing.","time":1314888585,"type":"comment"},{"by":"msales","id":2949799,"parent":2949787,"text":"Karlsruhe, Germany - mSALES GmbH - Ruby Developer<p>We're looking for a Ruby Developer (preferably on site, german speaking)<p><a href=\"http://www.msales.com/jobs/ruby-developer\" rel=\"nofollow\">http://www.msales.com/jobs/ruby-developer</a> (in German)<p><a href=\"http://goo.gl/DeBp1\" rel=\"nofollow\">http://goo.gl/DeBp1</a> (the above in English)","time":1314881934,"type":"comment"},{"by":"wehriam","id":2951342,"parent":2949787,"text":"Distributed team, East Coast seeks Python generalists.<p>HiiDef, Inc is a consumer web company with two rapidly growing properties, <a href=\"http://flavors.me/\" rel=\"nofollow\">http://flavors.me/</a> and <a href=\"http://goodsie.com\" rel=\"nofollow\">http://goodsie.com</a><p>Help us solve the challenges that revolve around top notch user experiences. We're continually building new products and features, scaling infrastructure, and responding to our enthusiastic customers.<p>Team members have flexible hours, top notch hardware, and experienced, talented co-workers invested in their success. We pride ourselves on a results oriented, laid back culture and seek people who can thrive with an exceptional amount of independence.<p>Please contact johnwehr@hiidef.com - Looking forward to hearing from you!","time":1314904544,"type":"comment"},{"by":"cadr","id":2951103,"parent":2949787,"text":"San Francisco, CA - Blurb<p>Blurb lets people tell their stories - currently through print-on-demand books, but increasingly through other venues.<p>We are both established and growing like mad (we were #47 on last year's Inc 500). We have a great group of people and a lot of fun challenges in the year ahead. We just launched a bevy of new products (our iPhone app is getting great reviews).<p>We play with fun tech: Ruby, Rails, SproutCore, git, RSpec, Cucumber, Haml, SASS, RabbitMQ, Puppet, Obj-C, and more.<p>We have great benefits, a great work/life balance, and we're in a great location close to the BART, CalTrain, and lots of food options.<p>We are currently hiring for many positions - front end, back end, API, Rails, iPhone, and more.<p><a href=\"http://www.blurb.com/join_us\" rel=\"nofollow\">http://www.blurb.com/join_us</a>","time":1314900618,"type":"comment"},{"by":"Littleme","id":2950048,"kids":[2951488],"parent":2949787,"text":"Palo Alto/San Francisco/Anywhere (USA). Cloudera. <a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a><p>Lots of openings for engineers, ops, business development...<p>In particular, I'm looking for someone else to work with me on curriculum development and certification (you can work from anywhere in the US). If you can take technical subjects and make them interesting and comprehensible, you're the person I'm looking for. You'll have a technical background, and ideally you'll know Java in some depth. Bonus points for knowing Hadoop, HBase, or similar technologies, and/or for having experience in the certification field. Apply via the Web site or contact me directly (e-mail in my profile).","time":1314885981,"type":"comment"},{"by":"arupchak","id":2950735,"parent":2949787,"text":"Amazon.com - Seattle WA - No remote, but willing to relocate based on experience. H1B is possible, again, depending on experience.<p>I am looking for a strong Systems Engineer for our growing team. We like to describe our organization as a Startup within Amazon, as our part of the business is still growing rapidly and our engineers can have a lot of influence on where the product goes. For this role in particular, I am looking for someone with a strong infrastructure/hardware bias to help us make the changes we need to scale our business over the next ten years without having to lift a finger. We are moving more and more of our applications and services to AWS technologies and we are looking for someone to help lead this initiative.<p>Job description below. Contact me at ${hn_username}@gmail.com if you have any questions.<p>The Amazon Marketplace team is looking for a great Systems Support Engineer to keep our systems running and our customers happy. You should be comfortable in a Linux environment, be able to automate everything you did yesterday, and willing to troubleshoot and solve new problems on a daily basis. Come join one of the fastest growing teams within Amazon.<p>Responsibilities:<p>-Maintain stability and performance of our systems via tickets during business hours oncall shifts<p>-Diagnose and troubleshoot new production issues that affect our customers<p>-Create and maintain standard operating procedure documents for new issues identified<p>-Automate operational tasks to assist with our scaling needs<p>Requirements:<p>-Proficiency in a scripting language (Ruby, Perl, Python, Shell)<p>-Familiar with SQL databases<p>-Comfortable navigating a Linux environment<p>-Basic understanding of web application architectures<p>Bonus points:<p>-Written a Rails application<p>-Deep knowledge of Oracle databases<p>-Troubleshooting experience<p>-Ticketing experience<p>-Worked with AWS EC2 or RDS","time":1314895831,"type":"comment"},{"by":"rabedik","id":2951295,"parent":2949787,"text":"Software Engineer, San Francisco CA<p>OcuSpec is a venture backed start-up developing motion control technology that is radically more powerful and affordable than anything currently available. We're seeking smart, passionate people interested in challenging problems and changing the way people interact with machines.<p>Desired Skills/Experience: Software architecture, cross-platform APIs, C/C++, parallel processing (GPU/CPU), computer graphics (openGL/DirectX), real-time systems.<p>This is a great opportunity to work on and take ownership of bleeding edge technology at a early stage. We offer very competitive compensation, great benefits and an office near the Caltrain.<p><a href=\"http://www.ocuspec.com/\" rel=\"nofollow\">http://www.ocuspec.com/</a>","time":1314903762,"type":"comment"},{"by":"bitsweet","id":2951177,"parent":2949787,"text":"Anywhere - McKinsey &#38; Company's Application Development Group<p>Looking for software engineers that care about quality software and want to work in small, mainly autonomous development teams. You'll have the freedom to try new ideas, experiment and be expected to constantly learn and grow.<p>Desired Qualities:<p>* Disdains repetition and automates annoying tasks<p>* Balances beauty and pragmatism in your designs and code<p>* Has contributed to open source projects, participated in some technical community, or has written or spoken in public about your area of interest<p>* Improves our development process by proposing tools and approaches<p>* Relentless at refactoring and improving code quality<p>Email work_for_it_appdev@mckinsey.com with link to github account, blog, or other online community participation","time":1314901750,"type":"comment"},{"by":"pjo","id":2950271,"parent":2949787,"text":"Conshohocken, PA - Monetate<p>We have fun problems at scale - real-time decision making plus web scale data. We have hired people from HN before and are always looking to meet new people.<p>We sell SAAS to internet retailers allowing them to test site content, target to visitor segments, and personalize web experiences.<p>Currently hiring for positions here: <a href=\"http://monetate.com/about/jobs/\" rel=\"nofollow\">http://monetate.com/about/jobs/</a> - primarily product engineers, front-end developers.<p>We work primarily in Python and Javascript but are looking for talented engineers of any background who like solving new problems.<p>We are backed by First Round Capital and are growing quickly.<p>Please feel free to email: tjanofsky at monetate.","time":1314889207,"type":"comment"},{"by":"thomd","id":2950330,"parent":2949787,"text":"Cambridge and Brighton (UK) - Aptivate<p>We build websites, web services and run in-country training programmes for the international development sector. We are looking for smart software developers to join our team.<p>As well as writing code, our developers get to work on the ground in developing countries on projects ranging from delivering technical training, to building and deploying resilient hardware systems for power and communications. Each team member has a voice in strategy and policy of the organisation.<p>For details see <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1314890082,"type":"comment"},{"by":"jonbischke","id":2950295,"parent":2949787,"text":"San Francisco, CA (SOMA)<p>RG Labs is hiring: <a href=\"http://www.rglabsinc.com/jobs\" rel=\"nofollow\">http://www.rglabsinc.com/jobs</a><p>We operate under the premise that the most important decisions we make are decisions about people (e.g., who to start a company with, who to hire, who to date/marry...)\nWe also feel like the Web is in its infancy in terms of helping us to make better decisions based on data and that this space could explode in coming years.<p>We're planning to be part of that explosion. :)<p>To hear more drop me a line directly at jonbischke at gmail or send us via our contact form. We'd love to tell you more.","time":1314889508,"type":"comment"},{"by":"jplewicke","id":2951238,"kids":[2966836],"parent":2949787,"text":"Boston, MA (not remote)<p>MDT Advisers - We're a small quant investing fund working with:<p>- machine learning<p>- discrete optimization<p>- C<p>- large datasets<p>You can find a job description at <a href=\"http://www.mdtadvisers.com/careers/qea.jsp\" rel=\"nofollow\">http://www.mdtadvisers.com/careers/qea.jsp</a> . The people, problems, and pay are good, and we aim for sane work-life balance(e.g. 45 hour weeks, private offices).<p>The team and management come from a technical background and don't micro-manage you. You also would have significant opportunity to work on your own research ideas and projects.<p>You can email me at jlewicke@mdtadvisers.com with any questions you have.","time":1314902813,"type":"comment"},{"by":"marcin","id":2950432,"parent":2949787,"text":"Warsaw (Poland)<p>Front-end developer (HTML+CSS on Python). LinkFindr helps people use their social networks to drive business much like Facebook helped Ivy League students leverage their friendships to get laid. We integrate 4 networks, index thousands of contacts and evaluate connections based on real interaction - then we help people find the right introductions to desired contacts.<p>More info about us, and how to get in touch at <a href=\"http://linkfindr.com/linkfindr/default/about\" rel=\"nofollow\">http://linkfindr.com/linkfindr/default/about</a>","time":1314891570,"type":"comment"},{"by":"mncaudill","id":2950273,"parent":2949787,"text":"San Francisco, CA - Flickr<p>We recently had our 6 billionth photo uploaded and we (the engineers) just built and rolled-out the new geofences feature. Engineers really get to make a difference at Flickr on a daily basis. <a href=\"http://code.flickr.com/blog/2011/08/30/in-the-privacy-of-our-homes/\" rel=\"nofollow\">http://code.flickr.com/blog/2011/08/30/in-the-privacy-of-our...</a> (That's my kitchen.)<p>We're hiring backend engineers, designers, and operations. Drop me a line at caudill -at- yahoo-inc.com if you're interested. I'd love to talk to you.","time":1314889273,"type":"comment"},{"by":"toponium","id":2949992,"parent":2949787,"text":"Boston, MA (Greater Boston Area) <a href=\"http://www.comperiosearch.com/\" rel=\"nofollow\">http://www.comperiosearch.com/</a><p>The Comperio team is currently looking for talented individuals to join our Greater Boston team. Junior and Senior Software Engineers are needed to customize our search technology to fit specific projects of our high-end customer base. We offer an exciting environment, challenging work and a competitive salary to the right individual. These are full time, salaried positions.<p>Position: Senior Consultant\nLocation: Boston, MA\nSummary: Software development, professional services, custom architecture\nCompensation: $80-100k<p>Position: Junior Consultant\nLocation: Boston, MA\nSummary: Software development, professional services and support, requires excellent communication skills, fast-paced work environment\nCompensation: $60-80k<p>Required competencies and skills:\n- Bachelor’s/Master’s/PhD in Computer Science or work experience equivalent\n- Excellent written and verbal communication skills\n- Strong problem solving skills\n- Interest in learning new technologies. Must have experience with or be willing to quickly learn: Java, .NET, Python; XML, HTML, PHP, JavaScript; Bash, PowerShell; Oracle, MySQL, MS SQL Server; Maven, Eclipse, SVN, CVS\n- Candidates with experience in SharePoint, FAST ESP, and/or Agile development processes (specifically SCRUM) preferred<p>Contact me: dana.ford@comperiosearch.com with questions or resumes","time":1314884742,"type":"comment"},{"by":"mdelagra","id":2951406,"parent":2949787,"text":"Evanston, IL<p>Leapfrog Online is looking for a talented Chicago-area Python engineer to work in our Evanston office. Our Python engineers build and maintain high-traffic web sites using the Django web framework. We offer a great working atmosphere, a strong focus on work-life balance, and tremendous opportunities to learn new skills and technologies. We also have competitive salaries and benefits and close-knit teams who like what they do.<p>As we principally focus on the web, we look for real-world experience using Python application frameworks (such as Django) to build high-traffic web sites and applications. Experience with other languages is welcome. What are the extras we look for? Experience producing and consuming web services (SOAP, REST, XML-RPC); experience working with message-oriented systems (AMQP or other message, pub-sub and task queues such as Celery); deep knowledge of version control systems (especially Mercurial or Git); an interest in non-RDBMS data stores (CouchDB, MongoDB, Redis); knowing what it really means to develop RESTful applications; and, experience with functional and declarative programming models in addition to object-oriented development.<p>If you're a bright, self-motivated engineer who enjoys using open source software to solve interesting problems, you’re our kind of programmer, and we’d like to talk to you.  You can apply on our site, where you'll also find full job descriptions and information about Leapfrog Online: <a href=\"http://www.leapfrogonline.com/who/careers/\" rel=\"nofollow\">http://www.leapfrogonline.com/who/careers/</a>","time":1314905492,"type":"comment"},{"by":"hercynium","id":2951085,"kids":[2969248],"parent":2949787,"text":"Akamai Technologies is looking for software, QA, network and systems engineers in the following locations:<p><pre><code>  Cambridge, MA, USA\n  San Mateo, CA, USA\n  Bangalore, India\n</code></pre>\nWe're also hiring for many other roles in these locations as well as many other places around the globe.<p>I've been working here for just over a year as a Sr. Software Engineer, and this is just a great place to work. The company is <i>very</i> technology driven, creativity is encouraged, and while we are very robust and careful in our practices and procedures, (especially operations and release management) I feel like  developers and managers are given a lot of independence to make important technical decisions, which leads to giving us the ability to really make a difference with every thing we do. That's something special to have in a company of this size, IMO.<p>So, the careers page is here: <a href=\"http://www.akamai.com/careers\" rel=\"nofollow\">http://www.akamai.com/careers</a><p>I know my group is looking for skilled SQA engineers, but company-wide we need everything from battle-hardened linux admins to C++ gurus, to Java/Perl/Python hackers and everything in between. My own group develops in Clojure. My co-worker is currently prototyping algorithms in Haskell.<p>Since I do get a referral bonus, don't forget to send them my name if you submit a resume!<p><pre><code>  (bash -c 'echo moc\\!iam@k@ diff@css | tr \" @!\" \"@a.\" | rev')</code></pre>","time":1314900223,"type":"comment"},{"by":"remi","id":2950425,"parent":2949787,"text":"Quebec City / Montreal, Quebec, Canada<p>We are looking for iOS, Android and other mobile developers, as well as Ruby/whatever backend and HTML/CSS/JavaScript frontend developers.<p>We are a team of passionate people working with large companies on exciting and innovative projects, as well as our own homemade products.<p>We are dedicated to building the best place to work at :)<p>We have a small website listing our available positions as well as showing pretty pictures of our environment: <a href=\"http://vie.mirego.com/en\" rel=\"nofollow\">http://vie.mirego.com/en</a>","time":1314891393,"type":"comment"},{"by":"dialtone","id":2951203,"parent":2949787,"text":"San Francisco, CA. Full time.<p>I work at AdRoll (<a href=\"http://www.adroll.com\" rel=\"nofollow\">http://www.adroll.com</a>), a rapidly growing, well-funded startup based in downtown San Francisco. We are adding to a small team of smart, driven and friendly people who are passionate about taking on new challenges. We are mainly a Python shop but we also work with Erlang and Java.<p>We are building the platform to bring the cutting edge of exchange advertising to the masses. We work with many great YC startups like Hipmunk, WePay, MixRank, Minomonster, Humble Bundle, Olark and many many more, we also work with other non-YC companies like Tom's Shoes and American Apparel and over 2000 active other advertisers. We've been on a rocket ship ride, and 2011 is looking even brighter.<p>Our infrastructure is currently hosted on EC2 across 3 regions and multiple availability zones in each region.<p>We come with all the good features of startups: full ownership of projects you feel passionate about, the laptop you want, a competitive set of benefits (medical/dental/vision, 401k, equity, paid time off, pool room, beer on tap, snacks and more), the need to solve new and interesting problems. We can sponsor relocation and even H1B if we love you.<p>We are looking for developers with: good experience and the ability to learn new things rapidly, love Open Source and take lots of initiative.<p>If you are awesome, you know ec2, hbase, hive, redis, cassandra, python, erlang and java it would be even better.<p>Email: valentino@adroll.com","time":1314902079,"type":"comment"},{"by":"danberger","id":2950138,"parent":2949787,"text":"Social Tables (<a href=\"http://www.socialtables.com/\" rel=\"nofollow\">http://www.socialtables.com/</a>), a DC/NYC- (I'm in dc but ready to move back to my hometown of nyc) based startup, is looking for a CTO. My co-founder had to leave because he couldn't quit his job (boooo). I went all in and quit mine a few months ago (freeeeeedommm!!).<p>Social Tables is a web-based seating chart designer for weddings and other events with assigned tables. We help event/wedding planners create floorplans and assign their guests seats. We're called Social Tables because we have a social feature that lets guests meet who they'll be sitting with beforehand. We have a tested product, over 1,000 users, brand awareness, and deep industry expertise. In other words, we know our stuff and people love our product (we save an event planner 4 hours per event). We've been self-funded to date and are currently talking to interested angels.<p>Like I said, I'm looking for a CTO (understanding of Rails is a must, love for SproutCore is a big plus). You should have that startup fire burning in your belly, ridiculous drive (e.g. you like some degree of risk), appreciation of test-based development, and passion for learning new things.<p>If you're at all interested or just want to shoot the shit, send me a quick note: dan@socialtables.com - I love meeting new people and helping others out.","time":1314887348,"type":"comment"},{"by":"kevbo","id":2952048,"parent":2949787,"text":"Evanston, IL<p>Junior Python Test Engineer at Leapfrog Online<p>We're the leading independent digital direct marketing firm in the country, developing programs for Fortune 500 marketers to find and convert the right customers. We build complex app ecosystems with frameworks like Django and Rails sitting on top, with a mound of open source software supporting them.<p>We're looking for a junior-level Python Developer to join our Test Engineering team, writing functional, integration, and unit tests in Python for our Django-powered business platform. As part of the Ops team, we also do light system administration and help write monitoring tools.<p>Requirements: an intense attention to detail, a love of learning, a passion for problem-solving, and a good attitude and sense of responsibility. You should also have experience with Python (or be willing to transition from another dynamic language like Ruby or PHP); be comfortable working on a *nix command line; and have general knowledge about HTML, CSS, and JavaScript.<p>We're committed to agile and open source; we use packages like mechanize, twill, Selenium, nose, and PyQT every day.<p>Interested? If so, we offer a competitive salary plus an incentive and benefits package, and a close-knit team who likes what they do and has fun doing it. If you think you're a good fit for this position, apply with your resume and salary history. kboers (at) leapfrogonline.com","time":1314915649,"type":"comment"},{"by":"belokor","id":2956034,"kids":[2956078],"parent":2949787,"text":"San Francisco, CA\nVenuetastic (YC W11) is hiring a full-time generalist engineer (INTERN, REMOTE)! (<a href=\"http://venuetastic.com/jobs\" rel=\"nofollow\">http://venuetastic.com/jobs</a>)<p>Remember when the travel industry was stuck in the olden times but now you buy all of your plane tickets online? We're doing the same thing for the event industry and would love to have you join us!<p>The job posting is reproduced below in its entirety but we care most about your personality, being sharp and having a \"getting things done\" attitude.  \nIf you're intrigued, get in touch via jobs@venuetastic.com<p>We're looking for a team member who can work across the full stack - frontend, backend, or sysadmin work. Encouraging knowledge transfer is a high priority for us: we believe that any engineer should be able to patch a hole in any part of our stack.<p>You'll be involved as much or as little in the product discussions as you'd like to be, and work with a team that believes in moving quickly, pushing often, and wasting as little time as possible.<p>Technologies we use include: Ruby, PostgreSQL, Git, Solr, Heroku + EC2, and a bit of MongoDB. Familiarity with any or all of these is a plus but not required - experience with equivalent technologies will be fine.<p>All positions offer competitive compensation, generous equity packages, healthcare, flexible hours, a fun team dynamic and beautiful 28th floor views.","time":1315007330,"type":"comment"},{"deleted":true,"id":2950301,"parent":2949787,"time":1314889565,"type":"comment"},{"by":"revorad","id":2959358,"parent":2949787,"text":"Shopping search engine startup in London, UK (INTERN, REMOTE)<p>I'm building a shopping search engine, focused on helping people decide what to buy from hundreds of product options. This is not another cute mobisociofoto app. This is a business which solves a problem for a lot of people, and has a business model from day one.<p>I am rapidly building out the first version of the product as per my vision, but need help with various supporting tasks to speed up the development. The current stack is Ruby on Rails, MySQL, jQuery hosted on a VPS.<p>I need help with:<p><pre><code>    Setting up new Linux servers, including VPS and AWS\n    Getting data feeds from various UK retailers and affiliate networks\n    Scraping sites which do not have data feeds\n    Building systems for speeding up manual editing and correction of product data\n    Building backend admin tools\n    Documenting everything in a wiki\n</code></pre>\nYou'll get real responsibility and real power to do things the way you think is right. I'm a solo founder, so I expect you to learn, teach and document infrastructure stuff to help me focus on the core product.<p>I expect a good standard of work, so you're not expected to work for free. You'll get paid in cash, books and gadgets. And beer :-)<p>If I like working with you, I will offer you a job down the line.<p>My email is in my profile. Please get in touch for more details and tell me about yourself.","time":1315142894,"type":"comment"},{"by":"modoc","id":2949953,"parent":2949787,"text":"Boston, MA (Greater Boston Area)\n<a href=\"https://www.sparkred.com\" rel=\"nofollow\">https://www.sparkred.com</a><p>Java/Jboss/Linux:  We're a profitable enterprise hosting startup seeking a Java/J2EE/JBoss developer who knows their way around Linux to assist with everything from code development, to support ticket handling, to troubleshooting, performance tuning, and more.  You can work from home, but need to be in the Boston area for occasional face-to-faces (and we may be getting office space near Burlington at some point).  We pay well, good benefits, cool team, lots of flexibility.<p>Sales/Marketing/Intern:  We're also looking for a paid co-op/intern to work (possibly part time) on our sales, marketing, and account management efforts.  Learn the ins and outs of working at a fast paced tech startup, and learn first hand how to sell to and deal with Fortune 500 executives.  Research into sales opportunities and competitors, authoring white-papers and PR releases, \"happiness\" management for existing customers, and more.  We're really looking for someone with some education or big ideas on how to effectively sell and market our company.  We're all tech-heads and need another perspective.  This could turn into high paid full time work, if the co-op proves to be valuable/productive.<p>Contact me: devon@sparkred.com with questions or resumes<p>Thanks!","time":1314884067,"type":"comment"},{"by":"ygyasi","id":2951311,"parent":2949787,"text":"San Francisco, CA - Triggit<p>Job Title: Sales Director<p>Triggit is hiring a senior sales professional to take on the role of Sales Director. Candidate must have a proven track record in digital media sales and have existing relationships with advertisers and their ad agencies. Candidate will be responsible for direct sales to companies of varying sizes, including ad agencies.<p>Commission and Equity package will be very aggressive and encourage groundbreaking strategy, concepts, and sales.<p>Requirements:\n    * 5+ years of integrated media/digital sales and or agency experience.\n    * Strong understanding of core developments in digital media sales and underlying technologies. Have existing relationships with advertisers, agencies, and media buyers. You should be able to close deals today with a phone call.\n    * Ability to understand and communicate Triggit’s core business propositions and technologies.\n    * Identify and close deals with digital brands and advertising agencies to achieve Triggit’s and individual’s quarterly and annual sales goals.\n    * Excellent sales skills with a proven track record of success negotiating, closing and delivering complex, high revenue, deals (6-figure +).\n    * Comfort working in a fast paced, rapidly changing, start-up environment.\n    * Ability/willingness to travel as needed.<p>To Apply:<p>Please submit a Resume and Cover Letter answering the following question to jobs@triggit.com:<p><pre><code>   1. If you were to start selling at Triggit tomorrow, who would be your first sales client, and why?</code></pre>","time":1314903961,"type":"comment"},{"by":"seanieb","id":2950449,"parent":2949787,"text":"San Francisco, CA<p>Dropbox<p><a href=\"http://www.dropbox.com/jobs\" rel=\"nofollow\">http://www.dropbox.com/jobs</a><p>- Intern - Software Engineer\n- IT Engineer\n- Site Reliability Engineer\n- Software Engineer\n- Technical Support Engineer","time":1314891780,"type":"comment"},{"by":"alexhektor","id":2950092,"parent":2949787,"text":"JDownloader - Nuremberg (Bavaria), Germany - full time, lots of perks<p><a href=\"http://makeyourappwork.com\" rel=\"nofollow\">http://makeyourappwork.com</a><p>Who you'll be a part of: We're the developers of JDownloader, the market leading download management tool with over 15 million happy users. On top of that, we work on client-side applications for some of the top 200 websites worldwide.<p>With only 3 people, we're still a relatively small, but highly motivated team with high aspirations, great opportunities and an extremly optimistic outlook on the future. Joining us, you'll have the opportunity to experience rapid growth right when it's happening while actively being a part of building and growing a big company.<p>What you'll do: As (Senior) Java Developer, you're in charge of diverse responsibilities and work on them either alone or in teams. You're responsible for parts of JDownloader, but on top of that will also have your own projects or products, for which you take the lead developer role.<p>Because we usually don't have strict deadlines or draconic specifications, we expect you to prioritize and get things done by yourself. You should feel cozy in your code, but also keep an eye on things like SEO strategy, project- and product management as well as user interface and experience. Your own ideas and innovations for projects, features or products are more than welcome and will actively be supported.<p>Send your resume, links to your current/past projects, github/social profiles (HN for example :)) or whatever you think we should know about you to e-mail@appwork.\nWe're looking forward to working with you :)","time":1314886689,"type":"comment"},{"by":"healsdata","id":2949908,"parent":2949787,"text":"King of Prussia, Pennsylvania (near Philadelphia)<p>ReminderMedia currently has three open positions.<p>* Sys-Admin INTERN - Looking for someone with some exposure to Linux to work primarily on helping us convert to Puppet.<p>* Front-End Developer (We use jQuery and JsTestDriver)<p>* PHP Developer (We use  Zend Framework, Doctrine)<p>For more information, check out <a href=\"http://remindermedia.com/careers/search/state/PA\" rel=\"nofollow\">http://remindermedia.com/careers/search/state/PA</a> or email me directly at jcampbell@remindermedia.com","time":1314883593,"type":"comment"},{"by":"jimle_uk","id":2951204,"parent":2949787,"text":"Kuala Lumpur, Malaysia - MobileApps.com\nRemote/Interns<p>Hi HN! Long time lurker, first time poster! I'm posting this on behalf of MobileApps.com.<p>We're looking for exceptional and talented web designers/developers to join our frontend team.<p>Ideally, you'll be:<p>1) Interested in working for a startup aimed at shaking up the mobile apps industry.<p>2) OK with working remotely, getting things done to high standards and making yourself accountable (and please be available over skype)<p>3) A strong graphics/ui/ux designer (we like pixel perfect, dribbble, metalabdesign) with HTML/CSS/Javascript skills to match (think JQuery, closures in js and if you've dabbled in node.js that'll be a huge plus!) Just fyi, we mainly use Java on the backend but soon we'll be doing all sorts of crazy stuff with node.js, redis, mongodb, you name it.<p>4) Available to meetup in Kuala Lumpur or Penang occasionally for good times and durian (may involve actual meetings).<p>5) creative, self-starter, great personality and positive mindset.<p>6) Looking forward to doing android/ios development in the near future.<p>You'll be working with me to completely revamp MobileApps.com and build an awesome platform and a fairer deal for mobile/tablet app developers and users all over the world.<p>I'll be honest, it's a huge challenge and we're a small team - this position is for someone who can offer commitment more than anything else. If you are this person, please do not hesitate to contact me with your portfolio/sample work + code at jimmyle @ mobileapps.com (Jimmy Le, Lead designer &#38; frontend developer, MobileApps.com).","time":1314902085,"type":"comment"},{"by":"jrlevine","id":2952086,"parent":2949787,"text":"New York, NY - News.me<p><a href=\"http://www.news.me/jobs\" rel=\"nofollow\">http://www.news.me/jobs</a><p>We're hiring for:<p>- Senior iOS Engineer\n- Front End Developer\n- Software Engineer (Python)<p>What we're about:<p>At News.me we're on a mission to create a new type of news product. We're building a product that will be fundamentally social, span multiple devices, and accommodate a variety of reading styles.<p>We believe in a Web organized around people, not pages; where discovery is social and happens across platforms. New devices like the iPhone and iPad are completely altering the way that users interact with content. They offer tremendous opportunities to create experiences that are personal and human. The news experience must be re-imagined for this level of intimacy.<p>We live, eat, sleep and breathe this stuff and want to work with brilliant people who care as deeply as we do about what we are trying to build. If that sounds like you, get in touch!<p>Here's what some people are saying about News.me:<p>\"News.me is pushing the edge of what a social news stream looks like\" (TechCrunch)<p>\"An Eye Opening App...Seeing the online world through different peoples' perspectives is a remarkably unique way to experience news consumption.\" (ReadWriteWeb)<p>We are building a world-class team and are looking for people who want to:\n- Get in on the ground floor of a well-capitalized startup with a big vision\n- Collaborate with a small team on all aspects of product and business model strategy\n- Engineer a beautiful experience that touches millions of people\n- Explore the boundaries of emergent devices","time":1314916404,"type":"comment"},{"by":"krupp","id":2950207,"parent":2949787,"text":"San Francisco, CA - Songbird\nCross-platform media player spanning from desktop to mobile. Crafting a flexible and integrated music experience for the future.<p>Senior Product Manager\nSenior Program Manager\nSenior Software Engineer - Desktop<p><a href=\"http://hire.jobvite.com/Jobvite/jobvite.aspx?b=nQb7SgwL\" rel=\"nofollow\">http://hire.jobvite.com/Jobvite/jobvite.aspx?b=nQb7SgwL</a>\n<a href=\"http://getsongbird.com/jobs\" rel=\"nofollow\">http://getsongbird.com/jobs</a>","time":1314888376,"type":"comment"},{"by":"lamby","id":2949920,"parent":2949787,"text":"London, England.\n<a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a><p>Small (7) startup in the gaming space looking for software engineers. Are you the one? You are, if you:<p>* Love agile development, working independently on your own challenges, and together in a team on the bigger vision<p>* Are completely fluent in a scripting language such as Python, Perl, PHP or Ruby and have experience with web frameworks and the MVC concept. We don't require fluency in our current technology stack - great programmers can pick up new technologies.<p>* Have used MySQL or PostgreSQL extensively and you know your way around Apache, nginx or other server. It's a bonus if you have good JavaScript skills (we use jQuery)<p>* Get excited by the idea of scaling web apps to millions of users<p>* Are the best developer in your peer group, and want to be at a place where you are constantly \nchallenged and pushed to become better<p>* Get obsessed about the problem you're solving and don't stop until you've cracked it<p>* Have a thirst to learn new skills and technologies, and can pick things up easily<p>* Want to have fun building lots of new features and get stuff done<p>* Are full of positive energy, relish the thought of being part of a small, fast-moving team and enjoy brainstorming about new ideas","time":1314883698,"type":"comment"},{"by":"qhfgva","id":2954422,"parent":2949787,"text":"RightNow Technologies <a href=\"http://www.rightnow.com\" rel=\"nofollow\">http://www.rightnow.com</a> Bozeman, MT<p>As a Developer, you will be a part of the team that comprises technical design and software development of Core Infrastructure Services (CIS), the Python based software infrastructure layer upon which the RightNow application service resides.<p>The CIS layer requires a high performance, scalable, fault tolerant architecture. CIS is the interface between the RightNow application and the cloud hosting environment. CIS provides services such as installation/configuration, software upgrades, database replication, file attachment storage, and deferred job processing.<p>Requirements<p>* Strong Python knowledge\n* Strong Linux / Systems experience\n* Strong MySQL<p>About the company<p>RightNow is one of the largest SaaS venders in the world. We serve billion+ page views every month and have hundreds of terabytes of customer data. The scale of our solution is challenging and we need to develop innovative solution to meet our growing demands.<p>Contact Info:<p>* Web: <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=RIGHTNOW&#38;cws=1&#38;rid=1562\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=RIG...</a>\n* No telecommuting","time":1314977265,"type":"comment"},{"by":"b0sk0","id":2950324,"parent":2949787,"text":"We hack all day on AdGear (www.adgear.com), a modern ad platform for publishers, agencies, networks, and bid/exchange optimizers.<p>We're based in Montreal, Canada, right beside Sq Victoria metro downtown (Red Bull is upstairs).  We're privately funded, revenue generating, and profitable.<p>I'm looking to get in touch with devs working with and interested in one or more of the following:<p>- Erlang\n- node.js\n- Cassandra in multi-data-center environments\n- Rails, and ruby in general\n- C, especially high performance http server hacking\n- xp and interest in building high performance real-time analytics systems<p>And if you are:<p>- Someone who \"loves the problem\" and gets off on solving it, even/especially if it hasn't already been solved\n- Someone not afraid to be scrappy to get things done, but who can balance that well with doing things properly<p>Please: not looking for freelancers nor freelancing shops.  We want someone willing to join our small but growing engineering team full-time.  Ideally located in MTL or surrounding regions, but if the above is right up your alley and you're not here, get in touch with me anyway, maybe it'll make sense to work with you anyway. :-)<p>You can reach me at bosko@bloom-hq.com if you're still reading. :-)","time":1314889976,"type":"comment"},{"by":"ksowocki","id":2953790,"parent":2949787,"text":"New York NY (Union Square) - PART + FULL TIME PHP Devs @ Ignighter.com<p>Into startups?  Are you a computer science major?  Want to learn to run a startup from the best in the biz?   Ignighter is hiring part time PHP developers.  We'll pay you a handsome hourly rate, you'll work at our office right on Union Square Park in Manhattan, and since we're Techstars alumni, you'll get to meet the best folks in the startup-game when you attend their happy hours and other events with us.  We offer a laid back but get-shit-done environment for you to spend 20 - 30 hrs/week solving the problem of social dating in the 21st century with us.  \"But what are the perks?\", you ask! Well, every Friday at HQ we have Beer Thirty.  We have an office stereo that 90% of the time is manned by someone with great taste in music.  The other 10% of the time, it's manned by my partner, Dan.   Sound too good to be true?  It's not.  Want social proof? Check us out @ <a href=\"http://techcrunch.com/2011/02/10/group-dating-startup-ignighter-raises-3-million/\" rel=\"nofollow\">http://techcrunch.com/2011/02/10/group-dating-startup-ignigh...</a> , <a href=\"http://www.inc.com/30under30/2011/profile-adam-sachs-kevin-owocki-and-dan-osit-founders-ignighter.html\" rel=\"nofollow\">http://www.inc.com/30under30/2011/profile-adam-sachs-kevin-o...</a> and <a href=\"http://www.nytimes.com/2011/02/20/business/20ignite.html?_r=1&#38;pagewanted=all\" rel=\"nofollow\">http://www.nytimes.com/2011/02/20/business/20ignite.html?_r=...</a> then check out the open positions:<p><a href=\"http://www.ignighter.com/Jobs-PHP-Developer-Part-Time/\" rel=\"nofollow\">http://www.ignighter.com/Jobs-PHP-Developer-Part-Time/</a><p><a href=\"http://www.ignighter.com/Jobs-Senior-Front-End-Developer/\" rel=\"nofollow\">http://www.ignighter.com/Jobs-Senior-Front-End-Developer/</a>","time":1314965115,"type":"comment"},{"by":"20thr","id":2950292,"parent":2949787,"text":"Helsinki, Finland - Blaast (<a href=\"http://blaast.com\" rel=\"nofollow\">http://blaast.com</a>)<p>Rocking mobile -- making it fun and accessible for millions of users and thousands of new developers.<p>Looking for various positions, from platform/backend, to operations, frontend and developer tools. We work with Scala, Java and Javascript. We are lean and fast. We deploy multiple times per day.<p><a href=\"http://blaast.com/jobs\" rel=\"nofollow\">http://blaast.com/jobs</a>","time":1314889472,"type":"comment"},{"by":"randall","id":2996913,"parent":2949787,"text":"Castfire is hiring!<p>We’re looking for someone (telecommute!) who enjoys coming up with innovative solutions to large scale problems. Ideally, our candidate would have experience with systems at scale and extensive knowledge of LAMP. We do enjoy using new technologies (Redis in production) and would like to find someone who can balance the bleeding edge with tried and true.<p>Castfire is looking for a senior engineer to join our team. Our product is a large scale system for managing, transcoding, assembling, and serving audio and video assets. Some of our clients include CBS, AOL, ESPN, Major League Soccer, NFL teams among others. Millions of people interact transparently with Castfire’s technology to consume audio and video. Chances are, you’ve interacted with our technology without knowing it.<p>Wanna apply? We spent the cash to be on Stack Overflow, so we might as well use it. :)<p><a href=\"http://careers.stackoverflow.com/jobs/13663/senior-php-lamp-developer-castfire?a=g8Quf4Y\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/13663/senior-php-lamp-...</a><p>Also, if you wanna talk, feel free to hit me up on Twitter (@randallb) and I'll dm you my phone number.","time":1316018781,"type":"comment"},{"by":"ctborg","id":2950646,"parent":2949787,"text":"Vancouver, BC, Canada.  <a href=\"http://www.wishpond.com/\" rel=\"nofollow\">http://www.wishpond.com/</a><p>Wishpond is the leading local product search engine creating the next chapter in online and social shopping. Wishpond empowers shoppers to find products from nearby retailers, and opens new marketing realms for local and independent retailers.<p>We're looking for passionate developers who take pride in their work and deliver high-quality results.<p>Requirements:\n- Experience building and deploying Ruby on Rails applications\n- Front end experience with jQuery, Javascript, CSS, and HTML\n- Excellent problem solvers\n- Good communication skills and a team player<p>Nice to Have:\n- Experience with scaling web applications\n- Familiarity with administration and manipulation of MySQL relational databases\n- Proficiency Competence working with *nix operating systems<p>Sounds interesting? We use the shiniest technologies to power our vision:\n- Highly scalable cloud based infrastructure\n- Rails, Python\n- Mobile App Development\n- Creating new industry API's for other developers to leverage and productize our offering\n- Large scale content ingestion engine<p>- Sound interesting? Apply to careers@wishpond.com","time":1314894441,"type":"comment"},{"by":"jbapple","id":2950279,"parent":2949787,"text":"Eugene, Oregon, internship possible, noremote, H1B applicants welcome.<p>On Time Systems is a small company that develops scheduling, routing, and other AI applications. We're currently looking for software engineers to work on Green Driver (a smartphone app that uses real-time data from traffic signals to help drivers find the fastest route (<a href=\"http://imagreendriver.com)\" rel=\"nofollow\">http://imagreendriver.com)</a>) and ACFP, the flight planning system used by the US Air Force for routing non-combat flights. We're looking especially for engineers with a strong algorithmic background.<p>We have some really nice benefits, including (in addition to the usual ones) sabbaticals, massages, your own office with a window, and 100% tuition reimbursement (including flight school if you work on our flight planning software). We used to be a research lab at the University of Oregon, and the atmosphere maintains some of the academic feel.<p>See <a href=\"http://www.otsys.com/newpages/employment.php\" rel=\"nofollow\">http://www.otsys.com/newpages/employment.php</a> for more details. Send your resume to jobs+hackernews@otsys.com","time":1314889373,"type":"comment"},{"by":"neiljohnson","id":2951766,"parent":2949787,"text":"London<p>OpenMarket are looking for Java developers to work on mobile messaging/payments platforms.<p>We offer hard problems, lots of autonomy, an engineering driven culture and full control over product delivery from design through to deployment.<p>See <a href=\"http://www.mxtelecom.com/uk/careers/roles/softdev\" rel=\"nofollow\">http://www.mxtelecom.com/uk/careers/roles/softdev</a> for more details or contact me directly at neil.johnson //at// openmarket.com","time":1314911274,"type":"comment"},{"by":"svec","id":2965944,"parent":2949787,"text":"Boston, MA and Cambridge, England<p>Ember is hiring (at least) four people right now.<p>--<p>Boston, MA jobs:<p>Dev Tools Software Engineer: <a href=\"http://ember.com/company_career.html?id=489\" rel=\"nofollow\">http://ember.com/company_career.html?id=489</a><p>QA Manager: <a href=\"http://ember.com/company_career.html?id=482\" rel=\"nofollow\">http://ember.com/company_career.html?id=482</a><p>--<p>Cambridge, England jobs:<p>Digital ASIC Designer: <a href=\"http://ember.com/company_career.html?id=488\" rel=\"nofollow\">http://ember.com/company_career.html?id=488</a><p>IC Engineer: <a href=\"http://ember.com/company_career.html?id=487\" rel=\"nofollow\">http://ember.com/company_career.html?id=487</a><p>--<p>Ember is the best place I've ever worked, and most of my coworkers agree.<p>The Boston Biz Journal agrees too; we were one of the top 25 places to work in Boston: <a href=\"http://www2.bizjournals.com/boston/events/2011/best_places_to_work/bbj-best-places-to-work-small-business.html\" rel=\"nofollow\">http://www2.bizjournals.com/boston/events/2011/best_places_t...</a><p>Employees are not required to understand proper semicolon usage, but it's a plus.<p>Ember is a technically interesting and socially healthy place to work. You should check us out!<p>Email me at hnjobsSept2011@saidsvec.com for more info.","time":1315323421,"type":"comment"},{"deleted":true,"id":2950320,"parent":2949787,"time":1314889957,"type":"comment"},{"by":"nanoanderson","id":2950025,"kids":[2950116],"parent":2949787,"text":"New York, NY (Tribeca/South Village) -- New York Magazine (<a href=\"http://nymag.com/\" rel=\"nofollow\">http://nymag.com/</a>)<p>Tons of openings! Here are a few I think you'll find interesting. We're working on the web and in mobile, and as @khoi said: \"IMHO NYMag.com is the best online print mag out there\". All details listed at <a href=\"http://nymag.com/newyork/jobs/\" rel=\"nofollow\">http://nymag.com/newyork/jobs/</a><p>* Senior Interaction Designer (design things like the Neighborhoods 2010 finder: <a href=\"http://nymag.com/realestate/neighborhoods/2010/65355/\" rel=\"nofollow\">http://nymag.com/realestate/neighborhoods/2010/65355/</a>)<p>* UI Engineer (that's what I do!)<p>* IA/UX Designer<p>* CTO (seriously, can't believe people aren't chomping for this one)<p>* QA Engineer (we've only got one, come help him out!)<p>* Back-end Engineer (Java, working with Day/Adobe CQ, help feed data to the front-end kids like me!)<p>* Integrated Marketing Manager (for all the biz people on HN, we need your help too!)<p>Check the listings at <a href=\"http://nymag.com/newyork/jobs/\" rel=\"nofollow\">http://nymag.com/newyork/jobs/</a> for details on who to contact and with what information.","time":1314885562,"type":"comment"},{"by":"asanwal","id":2950776,"parent":2949787,"text":"New York, NY (full-time)<p>CB Insights / Chubbybrain (cbinsights.com | chubbybrain.com)<p>We're National Science Foundation backed and looking for 3 positions.<p>1.  Front-end web developer - must love data visualizations<p>2.  Machine learning expert - find signals on private company health in a variety of unstructured, semi-structured and structure info sources<p>3.  Data journalist - If you have a way with words and a way with data..<p>Ping me (Anand) directly at asanwal@cbinsights.com","time":1314896397,"type":"comment"},{"by":"megamark16","id":2950797,"parent":2949787,"text":"Kansas City, Missouri<p>Salva O'Renick<p>UX Developer<p>Responsibilities include front-end development for client projects and internal initiatives, researching new technologies,  driving user experience across multiple platforms and maintaining existing applications. Proven work experience is required.<p>Position requirements include familiarity with current front-end coding frameworks and languages, standards based development, semantic markup, cross-browser support and degradation techniques, usability and accessibility standards, search engine optimization (SEO) and prototyping techniques. Applicants need to also be comfortable working with content management systems and in an agile development process.<p>Ideal candidates will have a passion for development, driving excellence and on continuous learning and knowledge sharing. Strong team work skills, self organization and good time management are required and expected. Strong skills in HTML, CSS, JavaScript (jQuery) are required.<p><i>Strong Plus</i><p>XHMTL, HTML 5.0, CSS<p>Javascript, jQuery<p>Web Design<p>Experience with Django templates<p><i>Plus</i><p>Experience working with a 960 grid system<p>Experience developing CMS templates<p>Experience with Django and Python development<p>Experience with common PHP frameworks (Expression Engine, Drupal, Wordpress)<p>GIT version control or any proficiency working in source control<p>Flash Animation<p>UX Practices (wire frames, user personas, information architecture)<p>Apply online here: <a href=\"http://www.uncommonsense.com/careers-form/\" rel=\"nofollow\">http://www.uncommonsense.com/careers-form/</a>","time":1314896752,"type":"comment"},{"by":"justin","id":2951987,"parent":2949787,"text":"San Francisco, CA<p>Justin.tv/TwitchTV growing FAST - all teams hiring!<p>Want to work in the video game industry without having to work for a video game publisher?  We are opening awesome new offices in downtown SF and are looking for passionate, entrepreneurial individuals to join us.<p>See our openings at <a href=\"http://www.twitch.tv/jobs\" rel=\"nofollow\">http://www.twitch.tv/jobs</a><p>Or feel free to email me directly if you have questions.<p>justin@twitch.tv","time":1314914384,"type":"comment"},{"by":"jgh","id":2951235,"parent":2949787,"text":"Roseville, CA (near Sacramento). Full Time Mobile Game Developer.<p>Company:<p>5th Planet Games is a company built on a core of hardworking, knowledgeable and dedicated professionals that know what it takes to get the job done.  Having launched several successful Facebook games over the last year with over half a million users worldwide,  5th Planet is poised to move into an era of growth and profitability, unmatched in today’s market. With an entrepreneurial spirit, 5th Planet provides a fast paced and competitive environment in which strong developers flourish while given the opportunity to grow their own skills. At 5th Planet, we are gamers that build games that we love to play!<p>Job Summary:<p>The Mobile Game Developer plays a crucial role in day to day success, market position and overall atmosphere of 5th Planet Games.   This position assists in the creation, development, maintenance and improvements of multi-layered, custom, dynamically driven mobile games and web solutions.<p>Full job posting: <a href=\"http://bit.ly/nmp6Yj\" rel=\"nofollow\">http://bit.ly/nmp6Yj</a>","time":1314902667,"type":"comment"},{"by":"kek","id":2950360,"parent":2949787,"text":"Greatist is looking for a passionate web developer who wants to disrupt the health and fitness space. We inspire and inform our readers to make one healthier choice per week by providing them with entertaining, high-quality, relatable content - the Greatist way.<p>We need a smart self-starter who loves simplicity and effectiveness, builds stuff for fun that’s been successful, and wants to take ownership of the technical side of things. Ideally, you’ll be experienced with PHP, WordPress, and Javascript, but that doesn’t matter as much as a desire to learn and grow. Your work will be seen - we had over 200,000 unique visitors last month, and we’re only getting bigger. At Greatist, we believe every team member makes an impact.<p>This is a full-time position based in our awesome new office near Madison Square Park in NYC.<p>Send your resume, favorite health and fitness tip, Github profile, and anything else you can think of to opps (at) greatist (dot) com.<p>Email kelli (at) greatist (dot) com if you have any other questions - or just want to swap recipes.","time":1314890530,"type":"comment"},{"by":"bwb","id":2952726,"parent":2949787,"text":"Remote (Anywhere In The World)<p>Job 1: Lead Backend Developer (Perl (Moose) + XML-API)<p>WebPub is a 14 month old startup working to build an App store for websites. We have built a Perl backend that allows us to manage a wide variety of files on top of a FTP layer, and then on top of that built an xml-api so that developers can make use of it as well as our applications. Currently we are working on building out the marketplace so that we can build economies and eco-systems around specific scripts like WordPress, Magento, Drupal so that designers/developers can sell their work, and end users can easily buy and install themes and add-ons, plus install them with just 1 click.<p>If interested email me at Ben@Webpub.com. We are going to make the web easier and more secure.<p>Job 2, 3 and 4: \nTitle: Web Hosting Tech Support\nSite5.com is looking for level 2 and 3 tech support to provide support to end users for cPanel web hosting. This requires a through knowledge of cPanel, hosting topics, English, and customer service.\n*Email -&#62; Careers@Site5.com","time":1314932571,"type":"comment"},{"by":"jim-greer","id":2951377,"parent":2949787,"text":"Remote, San Francisco or Portland<p>Kongregate - leading social gaming portal for core gamers (14.5M monthly uniques, solidly profitable with revenue growing rapidly)<p>Android developers, Rails developers, Director of Virtual Goods, Director of Developer Relations<p>I'm the cofounder and CEO<p><a href=\"http://www.kongregate.com/pages/jobs\" rel=\"nofollow\">http://www.kongregate.com/pages/jobs</a> (or contact me - jim at kongregate)","time":1314905091,"type":"comment"},{"by":"dmuino","id":2950667,"parent":2949787,"text":"Los Gatos, CA - Netflix<p>I'm looking for a frontend developer for my team. Your main job would be to help develop a very interactive infrastructure monitoring system. We have lots and lots of metrics about our systems. We'd like to be able to present them in a useful format, make it easy to troubleshoot production issues, aggregate on different dimensions, slice and dice them, zoom in on interesting events, expand clusters into individual nodes, save your work into your custom dashboard, etc.<p>I'm mostly looking for a strong developer who knows javascript well (or a language that compiles to javascript) and is familiar with tools or frameworks that will make your job easier (think Backbone, Knockoutjs, Spine, JavascriptMVC, etc.).<p>Netflix is a great environment for engineers where the emphasis is on agility and there are no rules about what tools or technologies you use to get your job done. You know what's best and we trust you.<p>If this sounds interesting to you please email me at dmuino @ netflix.com","time":1314894758,"type":"comment"},{"by":"sahil_lmn","id":2968396,"parent":2949787,"text":"Reston, VA (west of Washington, DC) - Full Time (H1B maybe)<p>Lucidmedia Networks - <a href=\"http://www.lucidmedia.com\" rel=\"nofollow\">http://www.lucidmedia.com</a><p>Internet ad network startup looking primarily for Java developers (experience with SQL and front-end web experience would be great too).  The Internet advertising industry is quite complex behind the scenes and somewhat parallels the structure of the financial markets.  We are analogous to a high frequency trading firm, buying page views to serve ads in real-time on exchanges like that of Google or Yahoo.  Our server software runs on Spring, MySQL, Redis, and AWS at a glance.  We handle about a billion page impressions a day.  Big data, big throughput.<p>Small yet experienced team, catered lunches everyday, your choice of Mac or PC (dev team is almost all Mac now), good benefits.  Our office has superhero posters all over the walls.<p>Contact me directly at sahil_lmn@yahoo.com.<p>I actually got hired through a HN \"Who is Hiring\" thread.  These things do work!","time":1315370678,"type":"comment"},{"by":"aarki","id":2951539,"parent":2949787,"text":"Mountain View/Sunnyvale, CA<p>Aarki is a mobile advertising network, working closely with mobile developers to provide more relevant advertising with a better user experience. For us more relevant advertising means people can get great applications for free and see only a small amount of interesting ads, and developers can get paid for their efforts.<p>We are still a very early stage startup, so small team, compelling equity offerings, diverse and interesting problems to work with.<p>Looking for:<p>1) frontend developers to do a lot of advanced development in JS for mobile phones \n<a href=\"http://aarki.com/jobs#javascript_mobile_engineer\" rel=\"nofollow\">http://aarki.com/jobs#javascript_mobile_engineer</a><p>2) backend developers; we are mostly a Python shop but all backgrounds are welcome if you can find the right tool for new problems and solve them:\n<a href=\"http://aarki.com/jobs#generalist_engineer\" rel=\"nofollow\">http://aarki.com/jobs#generalist_engineer</a><p>Emails sent to jobs-at-aarki.com will get directly to company founders.","time":1314907687,"type":"comment"},{"by":"gabrtv","id":2951345,"parent":2949787,"text":"Boulder, CO - OpDemand<p>OpDemand is a software company with a mission to make IT operations departments efficient and responsive through automation. Our Command &#38; Control technology (C2) makes it simple to deploy and manage complex distributed systems in the cloud. Our web console and command-line tools are unlike anything on the market.<p>OpDemand is looking for skilled Python developers to join our team and help scale our core infrastructure. Members of the core engineering team must be capable of:<p>* Writing asynchronous/event-driven code (Twisted)<p>* Following guidelines for REST and resource-oriented architecture<p>* Maintaining comprehensive suites of automated tests (in-memory, server-to-database, HTTP end-to-end)<p>* Orchestrating cloud APIs to provide functional distributed systems<p>More details here:\n<a href=\"http://opdemand.theresumator.com/apply/P5Bh7b/Python-Developer.html\" rel=\"nofollow\">http://opdemand.theresumator.com/apply/P5Bh7b/Python-Develop...</a><p>Gabriel Monroy, CTO\n<a href=\"http://www.opdemand.com\" rel=\"nofollow\">http://www.opdemand.com</a>","time":1314904570,"type":"comment"},{"by":"suhail","id":2950455,"parent":2949787,"text":"Mixpanel is hiring. We write Python, C, and serious amounts of Javascript.<p>You can find our jobs page at <a href=\"http://mixpanel.com/jobs/\" rel=\"nofollow\">http://mixpanel.com/jobs/</a><p>We're moving into a new office today: <a href=\"http://farm5.static.flickr.com/4037/4426180253_21043a8ab9_b.jpg\" rel=\"nofollow\">http://farm5.static.flickr.com/4037/4426180253_21043a8ab9_b....</a>","time":1314891850,"type":"comment"},{"by":"ygyasi","id":2951348,"parent":2949787,"text":"San Francisco - Triggit<p>Job Title: Sr. Reporting Engineer<p>We are looking for a Senior Reporting Systems Engineer (Java, Scala, Clojure, etc) to lead Triggit’s reporting efforts for our real time bidding platform. You will work alongside a team of successful entrepreneurs and experienced developers in constantly pushing the boundary of innovation and possibility.<p>Requirements:<p><pre><code>    * Many years experience with Java\n    * One or more years with one other JVM based language (Scala, Clojure, etc.)\n    * Some experience with RDBMS and SQL\n    * Experience with Hadoop\n    * Experience with developing reports over complex data at scale\n    * Experience with information visualization is preferred\n    * All Candidates should have strong communication skills, consider themselves a curious high level thinker\n</code></pre>\nTo Apply:<p>Please submit a Resume &#38; Source Code examples of your work, (If this isn’t possible, you may also submit an online portfolio of your work), to jobs at triggit dot com.","time":1314904645,"type":"comment"},{"by":"calbear81","id":2951584,"parent":2949787,"text":"Mountain View, CA (Remote, H1B welcome) - Room 77<p>Are you a superstar coder?  Prefer to work on cool new technology rather than me-too websites?  Enjoy working with world-class engineers?  Come join Room 77, where you can make a big impact as an early employee of a fast-paced startup.<p>Room 77 ( <a href=\"http://www.room77.com\" rel=\"nofollow\">http://www.room77.com</a> ) is building the world's best hotel search engine, featuring room-level information that cannot be found anywhere else.  Combining state-of-the-art search engine technology with the latest developments in 3D rendering, we’re building innovative products to perform fast meta search and compute virtual views out of each hotel room.<p>Quick facts:<p>- Founded in 2009; currently at approximately 20 employees<p>- Fully funded (Series B) by leading VCs and prominent investors, including founder of Expedia<p>- Based in Silicon Valley (downtown Mountain View, California, two blocks from Caltrain station)<p>- Winner of multiple awards including “Best Startup” at 2011 Launch conference and “Audience Favorite” at Web 2.0 Startup Expo<p>We’re looking for software engineers who are smart and can roll up their sleeves to get things done.  We don’t care what programming language you’ve used before or what operating system you’re familiar with, but we do need people with demonstrated passion for programming and problem solving, as well as hands-on attitude and hacker mentality.  Years of programming experience is almost always required, and a degree in computer science helps, too (although the latter isn’t a strict requirement).  In case you’re curious about our technology stack, we use primarily C++ / Javascript / Python / PHP / MySQL, with Ubuntu Linux and Amazon Web Services.<p>We’ll offer you:<p>- Generous cash / equity package with significant upside potential<p>- Free lunch<p>- Medical, dental and vision benefits<p>- 401K match<p>- Travel agent ID card giving you industry insider discounts at many hotels and theme parks<p>- Relocation and immigration assistance, if needed<p>- A unique learning experience as part of a well-funded startup company<p>- A chance to make a big difference, and a fun place to work!<p>Join us and be part of the next revolution that’ll change how people travel. Talk to us at jobs@room77.com","time":1314908350,"type":"comment"},{"by":"Sam_10gen","id":2951415,"parent":2949787,"text":"New York, San Francisco<p>10gen develops MongoDB, and offers production support, training, and consulting for the open source database.<p>10gen was founded by former DoubleClick Founder and CTO Dwight Merriman and former DoubleClick engineer and ShopWiki Founder and CTO Eliot Horowitz. Dwight and Eliot began development on MongoDB in 2007, drawing upon their experiences building large scale, high availability, robust systems.<p>10gen is led by seasoned executives and technologists with senior leadership experience at many of the worlds leading technology companies, including two executives and four senior engineers with over 50 years combined experience at Oracle. 10gen is backed by leading venture capital firms who invested in established leaders like Oracle, Cisco and Apple as well as rapidly growing internet companies like Zynga and Twitter.<p>We are hiring all types of developers ---<p><a href=\"http://www.10gen.com/jobs\" rel=\"nofollow\">http://www.10gen.com/jobs</a>","time":1314905630,"type":"comment"},{"by":"Mc_Big_G","id":2951955,"parent":2949787,"text":"San Francisco, CA<p>VerticalResponse is hiring for a lot of great positions:<p>* Ruby on Rails Developers<p>* Ruby on Rails Architect<p>* Director of Product Management<p>* Search Engine Marketing (SEM) Analyst<p>* Senior QA Automation Engineer<p>* Online Marketing Specialist<p>* Product Manager<p>* Director of Acquisition Marketing<p>* Senior Financial Analyst<p>* Customer Relations Specialist<p>VR is an established and successful, privately held company in SF for the last 10 years. We work with Rails 3, Git, JQuery, Rspec, backbone.js, Haml, Sass, TDD, pair programming, agile development and other leading technologies (you don't need to have experience with all of these). I've been working there as an engineer for 7 months now and really enjoy it.<p>Occasional work from home is allowed if you have an important appointment or need to keep germs out of the office. We have happy hour on Fridays and the fridge is stocked with a wide variety of beer, so we'll sometimes end the day with a cold brew while we finish pairing on a difficult problem.<p>Apply here: <a href=\"http://jobvite.com/m?3RB34fwj\" rel=\"nofollow\">http://jobvite.com/m?3RB34fwj</a>","time":1314913929,"type":"comment"},{"by":"jarz","id":2952792,"parent":2949787,"text":"Indianapolis, IN\nRaleigh, NC\nRemote<p>Aprimo has lots of technical openings right now and more to come! We're a software company HQ'd in Indianapolis focused on improving the marketing segment. Our solutions range from customer-hosted applications into SaaS/cloud offerings.<p>Development happens using a full Microsoft-oriented stack with C#, SQL Server, IIS, ASP.NET, etc. Our application is totally web-based, so Javascript experience helps.<p>Development / SW engineering positions typically are located in either Indy or Raleigh, but there are exceptions. Also have QA and test engineer positions.<p>Technical consultants are remote, just have to live within the region they support (West, South, other cardinal directions).<p>There are even some INTERNATIONAL opportunities (China, Czech Republic).<p>Looking for a DBA role? Awesome, we've got openings for that too. Databases experience with the following appreciated: SQL Server, Oracle, DB2, Teradata.<p>Feel free to email me (tim - jarz.net) for information.","time":1314934283,"type":"comment"},{"by":"cybernytrix","id":2950700,"parent":2949787,"text":"Palo Alto, CA\nWe are a small lab focused on creating the next generation of movie and TV recommendation technologies that go beyond traditional 5-star explicit rating systems. We have two engineering positions open, one for a Java developer and another with skills in scripting/Python and Linux administration. You will get an opportunity to work on the latest and greatest Machine Learning algorithms and build innovative prototypes that impact a newly created business unit. In addition, you will have opportunity to participate in conferences, CES every year.\nPlease send you resume (if you are awesome!). H1B OK, no remote. Email me (cybernytrix@gmail.com) for more information or see <a href=\"http://www.technicolor.com/en/hi/technology/research-and-innovation-centers\" rel=\"nofollow\">http://www.technicolor.com/en/hi/technology/research-and-inn...</a>.","time":1314895286,"type":"comment"},{"by":"essrand","id":2951331,"parent":2949787,"text":"Mountain View, CA - Polyvore, H1B<p>Polyvore is hiring all types of developers --mobile, frontend, backend, data mining, generalists… polyvore.com/jobs<p>Polyvore is a social shopping platform with over 10M uniques/month. Our goal is to build a style site that's endlessly browseable, instantly shoppable, and caters to every niche of taste. Our approach is to build platforms and tools that harness the creativity of our user community, empowering them to define trends and express their style.<p>We're well-funded by Benchmark Capital and Matrix Partners AND became profitable this year. With 10M uniques/month, we are the largest fashion site on the web with plans to expand into other categories. Named 50 Best Websites of 2011 <a href=\"http://www.time.com/time/specials/packages/article/0,28804,2087815_2088173_2088187,00.html\" rel=\"nofollow\">http://www.time.com/time/specials/packages/article/0,28804,2...</a>","time":1314904302,"type":"comment"},{"by":"fskilroy","id":2950505,"parent":2949787,"text":"Job Description:\nFull time - on site\nIf you are an expert at developing high-performance, MVC standards-compliant interactive web applications using Linux/Apache/MySQL/PHP (using the Zend framework), we want to talk to you!\nThe ideal candidate has the ability to write and understand PHP as well as being able to work under pressure in a dynamic environment. The candidate should be comfortable facing development challenges with enthusiasm while also researching and proposing new technologies in their field.\nMinimum Job Requirements:\n3-5 years experience developing code for standards-compliant, MVC web applications\nPHP5 (Object Oriented)\nMySQL 5\nVersion control (SVN)\nLinux OS shell environment and utilities\nXML and RSS standards\nZend framework\nBonus Job Qualifications:\nXHTML/HTML5, CSS\nStored procedures \nJavascript and knowledge of JS libraries such as JQuery\nExperience and understanding of AJAX methodologies\nExperience with third party APIs, particularly Facebook Open Graph and Amazon Web Services\nMemcached\nAbout Us:\nThe Orchard is an independent music and video distributor specializing in comprehensive digital strategies for content owners.\nWe partner with companies of all sizes, from major independent record labels to management firms to production companies, to make their music and videos available across more than 100 unique digital outlets across 230 countries, as well as physical retailers across North America and Europe. But, that’s not all. We work with our clients to maximize their revenue through pricing strategies and sales promotions, provide the latest and greatest digital marketing tools, and offer products like sophisticated sales analytics to help them run their businesses efficiently and effectively.\nWhy Work for Us:\nYou will be a core member of a small development team. You will have an enormous impact to shape applications being developed by a leader in the music industry. We offer good benefits and a great work environment for our developers.<p>To apply, please email theorchardjobs@gmail.com with the following:\nCover letter\nResume\nSalary requirements\nNo recruiters, please.","time":1314892399,"type":"comment"},{"by":"yanowitz","id":2949852,"parent":2949787,"text":"Anywhere, USA<p>Looking for a developer.<p>Sanebox, start up for handling email overload.   Stack is Ruby, Rails, Mysql as well as interacting with IMAP, WebDav and EWS.<p>Full job post: <a href=\"http://blog.sanebox.com/post/9564725105/sanebox-is-looking-for-a-great-software-engineer\" rel=\"nofollow\">http://blog.sanebox.com/post/9564725105/sanebox-is-looking-f...</a>","time":1314882786,"type":"comment"},{"by":"ygyasi","id":2951335,"parent":2949787,"text":"San Francisco, CA - Triggit<p>Inside Sales<p>About You:\n# You know you can sell.    And you enjoy it\n# You’re a hungry self-starter with a relentless work ethic who doesn’t want or need to be micromanaged.\n# You’re motivated by making large quantities of money.  And you’ll work for it. OTE is $100K+ for top earners.\n# You’re never afraid to pick up a phone and cold call.  And you’re relentless enough that you’ll never quit.\n# You understand that finding the right person to talk to is as important as saying the right thing.   And you’ll pound the pavement, or weave the Internet, to source the right lead.\n# You’re fascinated by technology.  And selling groundbreaking ideas and products excites you.<p>Requirements:\n# 2+ years of integrated media/digital sales and or agency experience, or a way to prove you don’t need it.\n# Ability to understand and communicate complex technologies. \n# You understand Triggit’s core business propositions and technologies. And will be ready to communicate this understanding during your first call.\n# You can identify and close deals with digital brands and advertising agencies to achieve Triggit’s and individual’s quarterly and annual sales goals.\n# Excited to work in a fast paced, rapidly changing, start-up environment.\n# Ability/willingness to travel as needed. .\n# College degree with a solid GPA or equivalent work experience.<p>To Apply:<p>Please submit a Resume and Cover Letter answering the following questions to jobs at triggit dot com:<p>When our CEO Zach was 16 he rode his bike from Minnesota to the Atlanta Olympics and traded enough pins, and scalped enough tickets, to pay for his entire trip and deposit $5G into his bank account to boot.   What’s your sales story?<p>Compensation:\n# Role is contract-to-hire with aggressive commission structure, but solid base pay.\n# Pay is competitive with entry level at Google etc, and when hired full-time, package will include stock equity, 401k, health/dental/vision insurance, commuter benefits, plus breakfast and lunch every day.","time":1314904431,"type":"comment"},{"by":"rspeer","id":2953367,"parent":2949787,"text":"Boston - Luminoso (<a href=\"http://lumino.so\" rel=\"nofollow\">http://lumino.so</a>)<p>We're looking for a Python developer with experience in natural language processing. We're a text understanding research and consulting company, spun out from the MIT Media Lab.<p>Businesses accumulate large piles of disorganized text, from social media, surveys, knowledge bases, and customer feedback, and they want a computer system to quickly tell them what's in that text so they can make business decisions. We do that, with natural language processing tools that scan text for known meanings while learning new ones.<p>We work with open source projects. We use NLTK and NumPy a lot. We're in a nice co-working space with a mindblowing view of the Boston waterfront.<p>Send your resume to hiring@lumino.so. We also encourage you to send us a link to your GitHub, Bitbucket, or wherever you collaborate on code.","time":1314952103,"type":"comment"},{"by":"brackin","id":2949929,"parent":2949787,"text":"We're a Daily deals sites for Design Resources.<p>We've got about 20,000 users. Selling from eBooks to Photoshop resources and icons. We're looking for Freelance Designers to create some design resources for us.<p>Like UI Kits, icons, photoshop resources, themes, templates, etc. More of an opportunity than a job. When you have spare time you can create some resources for us and make some extra money.<p>Earning most of the revenue from the deal, the deals can make from hundreds to more than $1000 (of course we can never promise anything as it all depends on the size of the market and quality of the work).<p>You have complete creative freedom, work when ever you want and you have as much time as you want. No age or location restrictions as you work from where you want.<p><a href=\"http://getdealy.com/creative\" rel=\"nofollow\">http://getdealy.com/creative</a>\nandrew [at] getdealy.com","time":1314883829,"type":"comment"},{"by":"david_lieb","id":2954669,"kids":[2954839],"parent":2949787,"text":"Mountain View, CA<p>Bump (YC, Sequoia, a16z)<p>iOS, Android, back-end development<p>Work on the 7th most popular mobile app of all time with more than 50 million downloads.  A hint of some of the new things we're working on: <a href=\"http://bu.mp/labs\" rel=\"nofollow\">http://bu.mp/labs</a><p>Learn more at <a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a>","time":1314981592,"type":"comment"},{"by":"winasaurus","id":2951042,"parent":2949787,"text":"San Jose, CA (Campbell)<p>UI/UX Designer (FULL TIME, INTERN)<p>Winasaurus is looking for a designer for web and mobile.  We are a 4-person startup (2 biz guys, 2 developers) who are making web and iPhone apps to help small local businesses reach out to customers.<p>You get to figure out how to make the UI beautiful and the functionality flow like water--you'll handle the designing, Photoshopping, HTML/CSSing, jQuerying, user testing, etc..  We care first and foremost about katana-like elegance of functionality, and only secondarily about flash--but we're hoping you bring both.<p>We'll make the rest of the business model and tech stack work, though if you are interested in entrepreneurship or code we love teaching and building a kickass team together.<p>Let us know if you're interested, please include some portfolio action to: elliot@winasaurus.com<p>Looking forward to hearing from you!","time":1314899733,"type":"comment"},{"by":"famousactress","id":2951571,"parent":2949787,"text":"San Francisco, CA (REMOTE available for the right candidate)<p>Elation EMR ( <a href=\"http://www.elationemr.com\" rel=\"nofollow\">http://www.elationemr.com</a> )<p>We're working on incredibly smart and usable web based tools for physicians.<p>We're small (5 fulltime people) angel funded and have an incredible list of investors (<a href=\"http://www.elationemr.com/team/\" rel=\"nofollow\">http://www.elationemr.com/team/</a>).<p>We're building with Python, Django, javascript, jQuery, Redis, MySQL, Java, and some other stuff. Particularly, we're really pushing the envelope when it comes to building rich javascript UIs in browser.<p>We're live in a number of practices, and there's still loads of really interesting things to build and make better!<p>We're looking add one or two more people to our incredible team.<p><a href=\"http://www.elationemr.com/jobs/\" rel=\"nofollow\">http://www.elationemr.com/jobs/</a><p>Drop us a line!\n- Phill","time":1314908219,"type":"comment"},{"by":"DGutmann","id":2960385,"parent":2949787,"text":"Cambridge UK\nB2B (stealth) start-up is looking for Technical Co-Founder<p>I’m a Postdoc at the University of Cambridge. I work extremely hard and am interested in product and business development. I'm looking for a hands-on technical co-founder to help me build an MVP and successful company.<p>The idea is a web-based platform that puts the 21st century into market research by utilising smartphone applications and their developer communities.<p>I’ve pitched the idea to industry experts and received great feedback. I’ve since been accepted into an incubator and need to find a second developer to join me (salaries committed for one year plus founder equity).<p>If you’re a self-motivated developer who likes the idea of disrupting a large market then please get in contact, whatever your experience and preferred technologies.<p>Get in touch - d.gutmann@pojonow.com","time":1315172374,"type":"comment"},{"by":"jasonlbaptiste","id":2950720,"parent":2949787,"text":"Onswipe - NYC<p>Come work with myself, @markbao, and some of the best engineers in the world working on touch, JS, nodejs, and HTML5.<p>Openings here:  <a href=\"http://blog.onswipe.com/jobs\" rel=\"nofollow\">http://blog.onswipe.com/jobs</a><p>Short list of what we're looking for:<p>- Front end JS devs (hiring 2)\n- Back end node, php, and mongo knowledge (hiring 1)","time":1314895635,"type":"comment"},{"by":"dtsingletary","id":2956188,"parent":2949787,"text":"San Francisco, CA<p>Klout<p>We're looking for Engineers! A few of them! Great ones who are cool and get stuff done and want to be part of a fast growing company.<p>We are the standard for influence.  We have a lot of technical problems to solve.<p><a href=\"http://klout.com/corp/careers\" rel=\"nofollow\">http://klout.com/corp/careers</a><p>It's a fun place to work. Everyone is smart and knows their shit.<p>Most of the engineering is in java/hadoop/nosql, depending on your position. We'd love someone with NLP experience for the Research engineer position.<p>Feel free to contact me at tyler at klout.com  (or through HN).<p>The boiler:\nKlout consists of a team of scientists, engineers, thinkers and dreamers banded together to create a standard where one had never been before. We believe that every person who creates content has influence and our mission is to help individuals understand and leverage their influence.","time":1315012546,"type":"comment"},{"by":"kungfooey","id":2950113,"parent":2949787,"text":"Nashville, TN<p>BorderJump<p>Need a Senior Python developer to both maintain the existing project and help guide the company from the tech side. Experience with Ruby or PHP would be great! More job description here: <a href=\"http://bit.ly/qxcZCU\" rel=\"nofollow\">http://bit.ly/qxcZCU</a><p>Email Chuck Bryant, chuck dot bryant at borderjump.com","time":1314887076,"type":"comment"},{"by":"jcs","id":2953584,"parent":2949787,"text":"London, UK - Rangespan<p>Founded by ex-Amazon executives and engineers, Rangespan is an ambitious e-commerce software company that makes it easy for retailers to offer deep product selection. Our values (<a href=\"http://www.rangespan.com/about/values/\" rel=\"nofollow\">http://www.rangespan.com/about/values/</a>) summarise the way we work.<p>We make heavy use Python, Django, MongoDB, MySQL and AWS to solve complex problems with huge data sets. We take an agile approach to development and are looking for world-class developers to join our team. You will have a broad, hands-on role developing extremely high-scale systems and web services for retailers and suppliers.<p>Positions available:<p>* Senior Software Developer<p>* Data Scientist<p>For more information, please see <a href=\"http://bit.ly/nKvh5n\" rel=\"nofollow\">http://bit.ly/nKvh5n</a> or email jobs@rangespan.com.","time":1314958857,"type":"comment"},{"by":"derwiki","id":2950920,"parent":2949787,"text":"San Francisco, fulltime/internships/H1B<p><a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a><p>At Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, open source contributions encouraged:<p><a href=\"https://github.com/causes/suggestomatic\" rel=\"nofollow\">https://github.com/causes/suggestomatic</a> -- item based collaborative filter<p><a href=\"https://github.com/causes/buffet\" rel=\"nofollow\">https://github.com/causes/buffet</a> -- distributed testing framework for Ruby<p><a href=\"https://github.com/causes/mock_redis\" rel=\"nofollow\">https://github.com/causes/mock_redis</a> -- mock redis Ruby gem<p>Apply through the site or adam@causes.com if interested!","time":1314898226,"type":"comment"},{"by":"itay","id":2951595,"parent":2949787,"text":"Splunk, Seattle, San Francisco, Cupertino (H1B)<p>Splunk is hiring. You can see available positions here: <a href=\"http://www.splunk.com/view/careers/SP-CAAAAGG\" rel=\"nofollow\">http://www.splunk.com/view/careers/SP-CAAAAGG</a><p>We're generally hiring for everything, including core server engineers, dev platform engineers, dev marketing, product management, QA, performance, UI, etc. It's a big space with a lot of opportunity, and we're doing our best to capture it.<p>I work on the Dev Platform team in Seattle, and it's a blast. We're a small team (3 devs, including my manager, VP of Dev Platform), in a great space (across the street from Whole Foods in SLU), and everybody at Splunk is great. Feel free to reach out to me (my email is in my profile) with any questions.<p>We do H-1B, pre-IPO stock, benefits, etc.","time":1314908535,"type":"comment"},{"by":"rory_k","id":2981405,"parent":2949787,"text":"London, UK<p>C# developer<p>We're looking for a talented .net developer with a few years of experience to join our core product development team. It's a really varied role and with the company expanding there's a lot of room for career growth.<p>You'll have a good comp sci degree or equivalent, really enjoy writing code, refactoring, delivering software, and you'll want to work for a small company where what you do makes a difference.<p>We are a small software company creating innovative solutions for the Legal and Financial sectors. We're based in Shoreditch and our products are used by large firms to help them get greater value from online services.<p>Interested? email jobs@priorysolutions.com \nor see <a href=\"http://priorysolutions.com/about/careers.aspx\" rel=\"nofollow\">http://priorysolutions.com/about/careers.aspx</a>","time":1315655137,"type":"comment"},{"by":"brevityness","id":2990457,"parent":2949787,"text":"Irvine, CA (Orange County)<p>Drink Pass(<a href=\"http://drinkpass.me\" rel=\"nofollow\">http://drinkpass.me</a>) Going out just got easier<p>&#62; Position\nSeeking software engineering INTERNS excited about disrupting the fast growing world of mobile payments<p>Drink Pass lets patrons at a bar or club order drinks from their phone. Our most prominent competitor is TabbedOut. We are a 7-person team looking to add 2-3 developers.<p>The software engineer intern position offers the opportunity to work in a fast-paced tech environment.<p>&#62; Qualifications<p>Required experience with: MS SQL Server, .NET, SVN, iPhone/Android app development<p>Education: Bachelor's/Master's/PhD in Computer Science or work experience equivalent.<p>&#62; Contact info\nInterested? Send me an email including your resume, work samples(online portfolio or Github profile) to tony@drinkpass.me","time":1315901207,"type":"comment"},{"by":"rw","id":2951230,"parent":2949787,"text":"New York, NY (in NoHo on Broadway). Full time and internships.<p>QLabs<p>We're a new type of in-house incubator: we prototype startups by building and launching an MVP every 6-8 weeks.<p>This is like startup boot-camp. Come hack with us on amazing projects, learn everything there is to know about building and launching products and starting companies, all without the painful early-startup salary.<p>One of our upcoming field trips is an all-day visit to MIT's Media Lab.<p>The lab started in February of this year, and now has five awesome developers (hailing from Columbia, ITP, NYC Resistor, and more). We're looking to fill positions #6 and #7.<p>Show us your projects: we love to see an entrepreneurial streak and a diversity of experience.<p>Our one steadfast requirement is that we definitely need you to know Rails.<p>Email me at rw@rwinslow.com if this appeals to you!","time":1314902565,"type":"comment"},{"by":"dget","id":2952444,"parent":2949787,"text":"New York, NY<p>Coursekit is trying to kill an entrenched incumbent (<a href=\"http://blackboard.com/\" rel=\"nofollow\">http://blackboard.com/</a>) and bring social networking to education, and we want you to help build it.<p>We're looking for an engineer who is excited about joining a young team that's shaking up how education works. We always try using the best tool for the job. For now, we use CoffeeScript, Python, Node.js, Redis, as well as a still-unreleased CoffeeScript framework. If working with these technologies excites you, talk to us.<p>Apply here: <a href=\"http://coursekit.theapplicants.com/j-11-222\" rel=\"nofollow\">http://coursekit.theapplicants.com/j-11-222</a> Or if you have any questions, shoot me an email at dan@coursekit.com","time":1314924338,"type":"comment"},{"by":"bijanv","id":2966720,"parent":2949787,"text":"Toronto, Canada<p>EventMobi - Front End Developer for Web and Mobile!<p>Full description: <a href=\"http://blog.eventmobi.com/hiring-front-end-developers/\" rel=\"nofollow\">http://blog.eventmobi.com/hiring-front-end-developers/</a><p>EventMobi is the leading mobile platform for events and we're looking for a front-end web and mobile developer to help us build out the next generation of mobile web apps. Disney, Crocs, Hyatt and Caesar's Palace among others have used EventMobi to disrupt and enhance the attendee experience at their events.<p>Being comfortable with Javascript, HTML5 and CSS3 will help and you should be excited about playing around with tools like Backbone, Handlebars and Zepto!<p>Send an email to work@eventmobi.com if you're interested and we can talk!","time":1315334990,"type":"comment"},{"by":"martian","id":2951452,"parent":2949787,"text":"San Francisco - Thumbtack<p>Engineers wanted. We use Python and PHP. Interesting problems include machine learning and classification, website scaling, in-house analytics and experimenting, and making a beautiful and engaging user experience. Other technologies we use are Mongo, Postgres and Postgis, Puppet, EC2 and other Amazone Web Services, Twilio.<p>Our product helps people find and book local services -- everything from handymen and cleaners to wedding DJs and French lessons. If you've worked with small businesses before, bonus points.<p>Email chris at thumbtack if you have any questions.<p><a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>PS: we have an awesome office in SOMA with a chef who cooks for us every day.","time":1314906251,"type":"comment"},{"by":"_arpan_","id":2955113,"parent":2949787,"text":"Sunnyvale, Fulltime/Intern\nsaavn.com<p>H1Bs ok<p>Software Engineers.<p>We are a well funded bay area startup and the fastest growing digital media company offering South Asian content.<p>We have some very interesting problems that we are trying to solve. Some examples include large scale audio processing, massive scaling, interesting text processing, digital content delivery on various channel etc.<p>Our engineering team is small and you will be having opportunity to make a really big impact on the way how people consume digital media.<p>The exact job posting is here\n<a href=\"http://startuply.com/Jobs/Senior_Software_Engineer_4089_2.aspx\" rel=\"nofollow\">http://startuply.com/Jobs/Senior_Software_Engineer_4089_2.as...</a><p>Let me know if you have any questions. \ne- arpan [ a t ] saaavn [ dot ] com","time":1314988468,"type":"comment"},{"by":"dlowe","id":2950446,"parent":2949787,"text":"San Francisco, CA / Montreal, QC or REMOTE<p>Xtranormal (<a href=\"http://www.xtranormal.com/\" rel=\"nofollow\">http://www.xtranormal.com/</a>) is looking for someone who loves to build for the web and is happy owning projects and products from detailed definition through implementation (front- &#38; back-end) and maintenance.<p>We're a 25ish-person, largely technical company with small offices in Montreal and SF. We're very open to remote hires.<p>We're using python/django, mysql, javascript/jquery, flex, VB.Net (!), and so on and so forth. Specific technical aptitude is far less important than a willingness to learn and a desire to build great stuff on the web.<p>Contact me by email (in profile) to chat about it!","time":1314891741,"type":"comment"},{"by":"carols10cents","id":2951788,"parent":2949787,"text":"Pittsburgh, PA - Careerimp (Resunate.com)<p>I'm a dev here, feel free to email me (carol at careerimp.com) if you have any questions.<p>Official job posting:<p>Fulltime Rails Dev<p>Careerimp is changing job searching, making it possible for jobseekers to gain insights into their application as they apply. Right now, we enable users to create a damn good resume with Resunate (resunate.com).<p>We code in Ruby on Rails and jQuery. We expect you to have a very strong foundation in programming and several projects behind you in developing web software. You should be someone who hates bugs to be found in your code, so you test it like crazy before deploying it. You are disciplined in development and can contribute in our transition to a more disciplined development culture. You like working with a designer to help style your features, and have a good eye for usability and aesthetics. You like to take skeletal user stories and flesh out the solution space. You think in graphs and algorithms, and are not afraid of complexity. You are bubbling with feature ideas.<p>There are a couple of major projects you will be working on with the team in the near future:<p>a) Developing an API for other apps to easily communicate with us \nb) Developing analytical tools for career centers \nc) Developing a utility for jobseekers to discover skills to improve \nd) Develop mechanisms to improve our matching engine\ne) Develop interesting social features that leverage social network APIs<p>We work in a designer space in Uptown Pittsburgh (between downtown and Oakland, across from South Side), which is co-inhabited by a giant poodle and other interesting tech companies. We like being co-located while working, and expect the same of you.<p>Friday afternoons you work on whatever you feel like. Seriously. We brew freshly ground single origin coffee at least twice a day. We will pay you comparable salary to companies our size, pay for half your health and dental insurance, and may provide you stock options.<p>Interested? Contact us at careers@careerimp.com<p>Note: This is a full-time position (40+ hrs/wk). Part-time contractors need not apply.","time":1314911631,"type":"comment"},{"by":"TimLangley","id":2950006,"parent":2949787,"text":"Manchester (UK) [and global - happy to consider remote working]<p>Looking for javascript (in particular backbone.js developers)<p>We're an early stage VC backed company in the web-analytics / big data space.<p>tim@canddi.com\n<a href=\"http://canddi.com\" rel=\"nofollow\">http://canddi.com</a>","time":1314885225,"type":"comment"},{"by":"jeffarena","id":2949917,"parent":2949787,"text":"New York, NY\nGateGuru, a seed-funded startup, is looking for a talented mobile developer with some Rails experience.  Full details here: <a href=\"http://gateguruapp.com/careers/\" rel=\"nofollow\">http://gateguruapp.com/careers/</a>","time":1314883686,"type":"comment"},{"by":"dabent","id":2952972,"parent":2949787,"text":"Santa Monica (Los Angeles Area), California<p>I started at TRUECar this week and just love it.  TRUECar is growing fast and is looking for Python/Django and Java developers.<p>They're big enough to avoid the perils of early-stage startups, but certainly small enough to be nothing like a BigCo.  Enjoy great perks like 100% paid family medical, gym membership reimbursement, equity and offices that are just blocks from the beach (my chair has a beach view, here's a shot from the window nearby: <a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>).<p>If you're interested, send an email to the address in my profile.","time":1314939602,"type":"comment"},{"by":"mdkess","id":2950236,"parent":2949787,"text":"Broadway Technology, New York, NY (right by The Bull! Also right by Fog Creek).<p>We're a small, profitable ~40 company revolutionizing fixed income and foreign exchange trading by creating a very fast trading platform (don't worry though - we don't trade ourselves, we're very much a software company). We're hoping to grow a lot! Positions are available for developers as well as consultants! Some opportunity to work remote, also, profit sharing for the win. See <a href=\"http://www.broadwaytechnology.com/careers\" rel=\"nofollow\">http://www.broadwaytechnology.com/careers</a>, and mention Hacker News if you decide to apply!","time":1314888738,"type":"comment"},{"by":"mea36","id":2950818,"parent":2949787,"text":"Remote or Philly<p>Looking for a part-time Django dev with front end experience and a good intuition for UX to work on small fixes and features. You should be comfortable with Django, jQuery, CSS, HTML and all that good stuff.<p>We are a marketing service for businesses utilizing QR codes and smartphones.<p><a href=\"http://www.youtube.com/watch?v=I6c1GuZqNHs\" rel=\"nofollow\">http://www.youtube.com/watch?v=I6c1GuZqNHs</a><p>Ideally we'd like a passionate individual who is genuinely interested in our project.  The possibility for full-time employment by the end of the year exists, but if that's not your thing, no worries, we won't pressure you into it.<p>Contact me at mel [at] coupedout [dot] com.","time":1314897017,"type":"comment"},{"by":"scootklein","id":2950926,"parent":2949787,"text":"Durham NC<p>ReverbNation<p>Job Title: Full-stack RoR developer<p>Looking for full-stack ruby on rails developers to join our main office in Durham, North Carolina. Job responsibilities include work on our main web property (<a href=\"http://www.reverbnation.com\" rel=\"nofollow\">http://www.reverbnation.com</a>) as well as looking into mobile web technologies (html5, css, js) and bridge technologies for native mobile apps (PhoneGap). Development organization currently has 12 members, up from 6 just 11 months ago.<p>Company is doing really well financially, 43 staff members up from 20 just 11 months ago. Definitely long on money and short on resources at this point.<p>Contact info is in my profile.","time":1314898273,"type":"comment"},{"by":"AndrewCallahan","id":2951756,"parent":2949787,"text":"New York, NY<p>BlueFusion is seeking a talented and experienced Rails developer who can quickly adapt to new situations and technologies in an entrepreneurial environment. We're a new startup moving fast and developing innovative solutions to unique problems in the political and non-profit sphere.<p>BlueFusion offers the rare opportunity to make a difference in peoples lives while developing cutting edge technology. Become a core member of the team and help lead our vision into the future.<p>Interested in learning more? Email jobs+hn@bluefusion.org or visit <a href=\"http://www.bluefusion.org/jobs\" rel=\"nofollow\">http://www.bluefusion.org/jobs</a><p>H1B friendly.","time":1314911048,"type":"comment"},{"by":"Stealx","id":2962773,"parent":2949787,"text":"Chicago(relocation assistance) - TrainSignal<p>Role: E-mail Marketing Specialist<p>We're looking for an e-mail marketing rockstar. Come manage all aspects of our e-mail marketing from creative design, testing to analytics. We want you to help us grow out our lead generation through e-mail marketing, personalization and targeted/scheduled/triggered e-mails.<p>Full benefits, 401k, will pay relocation costs to Chicago and a great salary!<p>More info &#38; apply at:\n<a href=\"http://trainsignal.theresumator.com/apply/X2bHvx/Email-Marketing-Specialist.html?source=hackernews\" rel=\"nofollow\">http://trainsignal.theresumator.com/apply/X2bHvx/Email-Marke...</a>","time":1315243085,"type":"comment"},{"by":"eekfuh","id":2950459,"parent":2949787,"text":"Salt Lake City, Utah - Solera Networks<p>We are a vc-funded network security company. We have a great engineering team, in an almost all engineering company (80% are engineers). We have the need for some great people, with a wide range of talent. We have needs in kernel development, systems code (C/C++), coders to handle large volumes of data (100's of tB) all the way to web interface development.<p>Full benefits. Lots of vacation. Great people to spend your day with.\n<a href=\"http://www.soleranetworks.com/company/careers\" rel=\"nofollow\">http://www.soleranetworks.com/company/careers</a>\n(Also we love Zombies)","time":1314891925,"type":"comment"},{"by":"camtarn","id":2950715,"parent":2949787,"text":"Edinburgh, UK - FULL-TIME, INTERN positions available<p>Amazon Development Centre Scotland are looking for candidates for full-time, intern and student summer positions.<p><a href=\"http://amazondc.com/\" rel=\"nofollow\">http://amazondc.com/</a><p>We're settling into our shiny new office in the city centre (Waverley Gate, right next to the station) and just added a Dreamcast with House of the Dead to our game room, alongside the Wii, Xbox and SNES. Last month we held TechMeetup Edinburgh here, which was really fun :)<p><a href=\"http://www.techmeetup.co.uk/\" rel=\"nofollow\">http://www.techmeetup.co.uk/</a>","time":1314895534,"type":"comment"},{"by":"swapna","id":2951777,"parent":2949787,"text":"Mountain View, CA - Simply Hired<p>8 to 10 open positions (<a href=\"http://www.simplyhired.com/a/our-company/careers\" rel=\"nofollow\">http://www.simplyhired.com/a/our-company/careers</a>), notably:<p>- PHP/Python/Django<p>- Hadoop/Hive/Big data type stuff &#60;-- we have an aching need for this and it's a team of 0.1 right now. Opportunity for impact here<p>- Machine learning analyst or scientist &#60;-- also a huge opportunity<p>- program/project/product manager and marketing positions as well<p>We have an office in SF downtown near the Ferry Building if that suits you. Interviews are conducted in MV.<p>Email me swapna at simplyhired","time":1314911405,"type":"comment"},{"by":"BenS","id":2951096,"parent":2949787,"text":"Pinterest (www.pinterest.com) is hiring engineers, interns and product designers in Palo Alto.<p>We are a small team founded by folks from Google &#38; Facebook. We are building a product that is growing quickly and is beloved by millions: <a href=\"http://www.alexa.com/siteinfo/pinterest.com#\" rel=\"nofollow\">http://www.alexa.com/siteinfo/pinterest.com#</a><p>You can read more here: <a href=\"http://www.pinterest.com/about\" rel=\"nofollow\">http://www.pinterest.com/about</a>, or get in touch with me directly. ben@pinterest.com.","time":1314900532,"type":"comment"},{"by":"easel","id":2950428,"parent":2949787,"text":"Washington DC / Full-time / Remote possible<p>WiserTogether provides decision support tools for medical consumers (you!). Better decisions reduces costs for your employer and increases quality of care for you. Come join us and make a difference.<p>Hiring Front-end / Back-end developers. Python, Django and JS. You need to know how to use git with a team and develop on osx/linux. Excellent compensation (including equity) and a great team.<p>email me direct with a github profile and resume or linkedin. erik.labianca -at- wisertogether.com","time":1314891489,"type":"comment"},{"by":"jrheard","id":2950457,"parent":2949787,"text":"San Francisco, CA (INTERN as well as full-time):<p>Yelp is hiring: <a href=\"http://yelp.com/careers\" rel=\"nofollow\">http://yelp.com/careers</a><p>We're primarily looking for hackers, product managers, and sysadmins.","time":1314891878,"type":"comment"},{"by":"jprobert","id":2951052,"parent":2949787,"text":"DBs, Dataminers, Developers<p>Philadelphia, PA<p>Cliq is a big data company focused on social search.  We are a small group and currently have 3 great developers.  We need DBs, dataminers and architects to help us scale the company as we're dealing with billions of data points and social edges.  We're free spirited and funded company and you can check out an Alpha version of our site at <a href=\"http://www.cliqsearch.com\" rel=\"nofollow\">http://www.cliqsearch.com</a>.<p>Please email resumes to jason@cliqsearch.com.","time":1314899866,"type":"comment"},{"by":"sahillavingia","id":2951279,"parent":2949787,"text":"San Francisco Bay Area, CA - Gumroad<p>We want to make selling stuff online as easy as sharing a link. Kind of like Square, but for digital goods.<p>Probably the earliest stage startup on here. It's just me. You'll be super involved, have a ton of impact, and will have a sizable chunk of the company. You'll also have face-time with all of our awesome investors. I'll help you start your next company when you're ready to take the leap for yourself.<p>Contact me using the email in my profile if you're interested.","time":1314903460,"type":"comment"},{"by":"im_asl","id":2950993,"kids":[2951644],"parent":2949787,"text":"Mountain View, CA<p>Addepar<p>Addepar is recreating the infrastructure that powers global wealth management. Addepar's technology increases efficiency, transparency, and sophistication within the global investment industry, thwarting fraud and furthering meritocracy in one of the most important areas of the global economy.<p>Current openings: \n-Engineer\n-Forward Deployed Engineer\n-Interaction Designer\n-Visual Designer\n-System Admin\n-PM\n-QA Engineer<p>Please check out careers.addepar.com or email me at adam (at) addepar.com","time":1314899004,"type":"comment"},{"by":"aurumaeus","id":2950415,"parent":2949787,"text":"GameChanger!\n<a href=\"http://gc.io/careers\" rel=\"nofollow\">http://gc.io/careers</a><p>* Front End Coder (Python, jQuery, Backbone, LESS)<p>* Back End Coder (Python, MongoDB, Redis, Fun)<p>* iOS/Android - (Obj-C/Java/Scala(?))<p>* DevOps - unix hacker<p>(NYC, baby)","time":1314891235,"type":"comment"},{"by":"robobenjie","id":2951416,"parent":2949787,"text":"Mountain View - Anybots Inc<p>Take over the world with robots. We build telepresence robots and we are looking for all kinds of hackers. Robot code (especially streaming video, networking, BSD wifi), webcode (front end, back end), sourcing engineer (finding cheaper, better components for the next version).<p>We are a small team with lots of freedom. We use Python, Node.js, along with C, C++, javascript.<p>Write to us at jobs@anybots.com and include a link to cool projects you have done.","time":1314905631,"type":"comment"},{"by":"amitrathore","id":2952028,"parent":2949787,"text":"Like Lisp? Like the JVM? Like data?<p>We're a 3-year old Clojure startup called Runa, and we're disrupting the eCommerce space. We've only taken a series A, and we're revenue positive, and will be profitable in a few months.<p>We have some top Clojurians working for us, and are looking for people across the stack to focus on Big Data, Machine Learning, scalability, etc. Check us out at <a href=\"http://www.WorkAtRuna.com\" rel=\"nofollow\">http://www.WorkAtRuna.com</a>","time":1314915269,"type":"comment"},{"by":"jason_tko","id":2953116,"parent":2949787,"text":"Tokyo, Japan<p>MakeLeaps - On a mission to improve small business owners lives.<p>We're currently looking for Python/Django programmers. We're looking for interns as well.<p>Telecommuters are fine. Starting off with contract, moving to permanent positions.<p>Perks: We run the local Hacker News meetups in Tokyo, where you may join for free and drink as much beer as you like. If you do very well, there's also potential for you to be moved to Japan to work from our office in Tokyo.<p>Please apply to jobs at makeleaps.com.","time":1314943972,"type":"comment"},{"by":"barce","id":2951188,"parent":2949787,"text":"Los Angeles, West Hollywood, Machinima.com, Full-time employment<p>We are hardcore gamers that love producing the best videos of the top players in the gaming scene. FPS, MMOs and Ruby are 3 things you should love.<p>If you've got ruby skills and if you are also good at working with a scalable system with the intention of getting more performance out of it, let us know.<p><a href=\"http://www.machinima.com/\" rel=\"nofollow\">http://www.machinima.com/</a>","time":1314901859,"type":"comment"},{"by":"abreckle","id":2950310,"parent":2949787,"text":"San Francisco, CA Visual.ly<p>We are small and nimble team building a consumer-friendly data visualization tool and are looking for few front-end hackers with demonstrated expertise in all or many of the following and a passion for data visualization to round out our core engineering team.<p>* Javascript, Backbone.js &#38; jQuery \n* CSS3 \n* HTML5 \n* SVG<p>Learn more: <a href=\"http://visual.ly/about/jobs\" rel=\"nofollow\">http://visual.ly/about/jobs</a>","time":1314889682,"type":"comment"},{"by":"beermann","id":2951202,"parent":2949787,"text":"Madison, WI - StudyBlue<p>We're a quickly-growing startup trying to fill several positions as we hit some big milestones this year. Excellent candidates will be excellently compensated.<p>Available positions:\nSenior Application Developer,\nCommunity Manager,\niPhone Developer,\nAndroid Developer,\nInteractive Designer<p>For more information: <a href=\"http://company.studyblue.com/about/jobs/\" rel=\"nofollow\">http://company.studyblue.com/about/jobs/</a>","time":1314902045,"type":"comment"},{"by":"drp","id":2950417,"parent":2949787,"text":"San Francisco, CA<p>HotPads - <a href=\"http://hotpads.com/pages/jobs.htm\" rel=\"nofollow\">http://hotpads.com/pages/jobs.htm</a><p>We're hiring software engineers and web user interface developers to work in our new office in San Francisco's Mission District.  We're a small, lively company running a popular map-based housing search engine, so we need driven individuals who want make an impact on the way people find housing.<p>dpeters@hotpads.com","time":1314891242,"type":"comment"},{"by":"inovica","id":2950520,"parent":2949787,"text":"Newcastle, UK (REMOTE or INTERN).  - Designer wanted<p>We are looking for a good designer to join our team developing a few different applications. See www.competitormonitor.com as one example of what we're doing. Your location is not important to us as we are used to working with people from around the world. Our current team is UK, Russian and Argentinian, so we welcome everyone :)<p>Contact me at the email address in my profile<p>Ade","time":1314892551,"type":"comment"},{"by":"yanavery","id":2952480,"parent":2949787,"text":"Montreal, Quebec, Canada<p>TradeInsight (MEI Group). Sell More. Spend Smarter.<p>Current open positions are the following :<p>1) Java Developer\n2) Quality Assurance Analyst\n3) User Experience Designer\n4) Senior Customer Support Developer\n5) Product Marketing Manager<p>Great working environment, great team, great company!<p>For more details, check out <a href=\"http://www.tradeinsight.com/aboutus/careers\" rel=\"nofollow\">http://www.tradeinsight.com/aboutus/careers</a>","time":1314925274,"type":"comment"},{"by":"erohead","id":2950682,"parent":2949787,"text":"inPulse (YCW11/Mountain View/Hardware-ish) seeks 1st full-time Android Dev [H1B, TN, Interns are good!)<p><a href=\"http://www.getinPulse.com\" rel=\"nofollow\">http://www.getinPulse.com</a>\nLocation: Mountain View, CA<p>Help us design and build intuitive and hackable wearable electronics. Our first product is inPulse, a $149 smartwatch. inPulse connects via Bluetooth to our smartphone (BB + Android) apps which acts as a conduit for watchapps, notifications and alerts.<p>We're looking for an experienced Android dev to help us improve our nascent app and spearhead integration with a cloud backend.<p>Almost everything is done in-house: architecture design, schematic/PCB layout, embedded drivers/firmware, Android and Blackberry app dev, industrial design...\nWe push updates out over the air, flinging code to watches worldwide.<p>You'd be our 3rd employee which comes with multi-% stock options and a competitive salary. Flex work schedules, constant BBQs and food/beer come with the territory.<p>To apply, please send examples of apps you've worked on and your role in those projects to eric AT getinpulse.com","time":1314894972,"type":"comment"},{"by":"cliftonk","id":2949892,"parent":2949787,"text":"Dallas, TX<p>Looking for Frontend + Backend Developers<p>Backend is Rails, MySQL, NodeJS and Redis<p><a href=\"http://www.orgsync.com/careers\" rel=\"nofollow\">http://www.orgsync.com/careers</a>","time":1314883411,"type":"comment"},{"by":"jackfoxy","id":2951497,"parent":2949787,"text":"Concord, CA.<p>www.agentachieve.com<p>.NET, C#, SQL Server, javascript, jquery<p>Big app (it does a lot). You must do server side, client side, and SQL. Web forms, but we only use the parts of web forms that work. You do the rest of client side stuff in what works (often \"real\" AJAX, not the MS interpretation).<p>This is a contract position. Min 6 months, probably longer. Send resume and requirements jofox at corelogic dot com.","time":1314906960,"type":"comment"},{"by":"BvS","id":2950336,"parent":2949787,"text":"Berlin, Germany - Full time- RoR (<a href=\"http://www.betterplace.org\" rel=\"nofollow\">http://www.betterplace.org</a>)<p>Full description (English): <a href=\"http://www.betterplace.org/en/jobs\" rel=\"nofollow\">http://www.betterplace.org/en/jobs</a><p>Related Video (German): <a href=\"http://www.youtube.com/watch?v=tK82l8pZpzQ\" rel=\"nofollow\">http://www.youtube.com/watch?v=tK82l8pZpzQ</a>","time":1314890240,"type":"comment"},{"by":"iampims","id":2951130,"parent":2949787,"text":"San Francisco, CA – Formspring\n25M users, 3.5B responses, growing fast.<p>Looking for Front-end, Software and Systems engineers.<p>We’re having fun solving challenging problems.<p>Buzzword dump: Cassandra, Riak, Kestrel, Thrift, AWS, mobile…<p>We’re in SOMA, and regularly hosting Meetups (Riak and Cassandra)<p>email: tim (a) formspring (dot) me<p>twitter: @pims<p>edit: full description here <a href=\"http://about.formspring.me/jobs\" rel=\"nofollow\">http://about.formspring.me/jobs</a>","time":1314901043,"type":"comment"},{"by":"bentlegen","id":2950983,"parent":2949787,"text":"San Francisco, CA<p>Disqus<p>We're still only 20 people, so it's a terrific time to join our team, especially if you're interested in scaling problems (we serve over 500m uniques per month) or writing high performance third-party JavaScript (our commenting widget is installed on hundreds of thousands of websites).<p>More here: <a href=\"http://disqus.com/jobs\" rel=\"nofollow\">http://disqus.com/jobs</a>","time":1314898880,"type":"comment"},{"by":"lamplighter","id":2950093,"parent":2949787,"text":"Uken Games in downtown Toronto<p>Uken is looking for talented developers to help us build mobile games in HTML5 and push what is possible in a browser.<p>We are a profitable startup (~20 employees) experiencing massive growth, with over 100,000 players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1314886691,"type":"comment"},{"by":"martinshen","id":2952788,"parent":2949787,"text":"San Francisco - UpOut<p>UpOut helps people discover fun... now. We got into a great incubator and now we're looking for a third man to join our team. Salary + Substantial equity.<p>We're looking for good developers ideally with iOS/Android experience or an interest getting into it. Candidates should want to help shape the product and company.<p>email me at martin at UpOut.com if interested.","time":1314934197,"type":"comment"},{"by":"levonjlloyd","id":2951842,"parent":2949787,"text":"Long Island, NY - General Sentiment\nFull-time positions\nJobs: Software Engineer - User Interface and Software Engineer - Systems<p>We're looking to build out our UI team and add to our team of systems programmers.<p><a href=\"http://www.generalsentiment.com/jobs-at-generalsentiment.html\" rel=\"nofollow\">http://www.generalsentiment.com/jobs-at-generalsentiment.htm...</a>","time":1314912503,"type":"comment"},{"by":"JBerlinsky","id":2950050,"parent":2949787,"text":"Anywhere, USA. Intern/Remote/We'll-work-it-out.<p>CommonPlace USA is looking for people to fill two opporunities:<p>* A front-end web developer to work with our existing RoR tech stack<p>* A back-end developer to hack on our tech stack.<p>The stack consists of RoR, Sinatra, Backbone.js, PostgreSQL, and Redis.<p>Shoot me an e-mail (in profile) with your Github profile, resume, epic poems, or whatever else you have to show :)","time":1314886087,"type":"comment"},{"by":"Tofusensei","id":2951456,"parent":2949787,"text":"San Francisco, CA.<p>Follow us on twitter at @ThoughtLeadr<p>ThoughtLeadr is an angel-funded early stage B2B startup. We're building social media analytics, targeting and engagement solutions for content-generation sites (think reddit, not facebook).<p>We are located in SOMA in San Francisco and are looking for candidates to work out of SF. We'll pay relocation expenses for the right candidate.<p>--<p>Opening #1: Web Developer<p>You should be accomplished and comfortable designing web front-ends. You should have at least <i>some</i> experience with some of the following technologies (not all, that would be pretty nuts!):<p>HTML/XHTML/CSS<p>JavaScript<p>Raphael.js<p>D3.js<p>Node.js or Python<p>Please send your resume and links to sample code/sites/portfolio to jobs@thoughtleadr.com<p>--<p>Opening #2: Designer<p>Mandatory:<p>Must be able to translate high-level concepts into elegant user experience design<p>Must be able to create user work flows, interaction models, and screen designs<p>Must be able to do elegant data visualization<p>Strong Adobe Creative Suite skills<p>Uber-comfortable with a white board<p>Pluses:<p>Portfolio of well-designed web projects<p>Strong visual design skills (knowledge of topography, color, use of color)<p>Ability to prototype HTML, CSS, and Javascript<p>Please send resume &#38; portfolio link to jobs@thoughtleadr.com<p>--<p>Opening #3: Linux Administrator<p>We're looking to hire a very smart Linux admin to help support our back-end systems. Be prepared to deal with BIG data and tons of servers.<p>You should be ultra-comfortable on a Linux CLI. In particular, Ubuntu. You should have at least <i>some</i> experience with some of the following technologies (not all, that would be pretty nuts!):<p>Opscode<p>Chef<p>Puppet<p>MongoDB<p>Riak (NoSQL)<p>Distributed Task Queues<p>nginx<p>ruby or python<p>email your resume to jobs@thoughtleadr.com<p>Thanks!","time":1314906277,"type":"comment"},{"by":"RandallBrown","id":2951457,"parent":2949787,"text":"Okemos, MI<p>TechSmith is a software company that specializes in screen capture software. We make Camtasia, Snagit, Jing, and more. We have a variety of fulltime and internship opportunities in development, management, and sales.<p><a href=\"http://www.techsmith.com/company/jobs.asp\" rel=\"nofollow\">http://www.techsmith.com/company/jobs.asp</a>","time":1314906291,"type":"comment"},{"by":"jshen","id":2950257,"parent":2949787,"text":"Burbank, CA (Los Angeles) - Disney<p>Hiring backend an frontend engineers. We're doing ruby on rails (jruby), and we're pushing the envelope on the client side (css3, html5, etc). We have an amazing office, amazing benefits, and a small team that isn't corporate in any way. Oh, and we have a pension :)<p>Contact Me: jay.donnell@digisynd.com","time":1314889094,"type":"comment"},{"deleted":true,"id":2950738,"parent":2949787,"time":1314895846,"type":"comment"},{"by":"nwilkens","id":2951564,"parent":2949787,"text":"Monroe, MI<p>www.mnxsolutions.com - Linux Server Management<p>MNX Solutions manages the Linux infrastructure for growing companies. We are hiring Linux system administrators for mid-level and senior positions.<p>More detail available on our website:\n<a href=\"http://www.mnxsolutions.com/jobs\" rel=\"nofollow\">http://www.mnxsolutions.com/jobs</a>","time":1314908083,"type":"comment"},{"by":"lukatmyshu","id":2951043,"parent":2949787,"text":"Mountain View, CA San Francisco, CA New York City, NYC\nMeebo\nWork on projects that reach over 185+ million users a month. remote work is totally cool as well. Check out a list of all of our jobs here <a href=\"http://www.meebo.com/jobs/\" rel=\"nofollow\">http://www.meebo.com/jobs/</a>","time":1314899747,"type":"comment"},{"by":"roobeast","id":2951218,"parent":2949787,"text":"San Francisco, CA Downtown - Trulia<p>Looking for a few experienced search engineers and some distributed data processing folk.  Java, python, hadoop, solr and lots of other stuff.<p><a href=\"http://www.trulia.com/jobs\" rel=\"nofollow\">http://www.trulia.com/jobs</a> (front end and other positions also available)","time":1314902346,"type":"comment"},{"by":"psota","id":2950318,"parent":2949787,"text":"Cambridge, MA\nPanjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>)\nHiring engineers -- UI/UX, frontend, backend data mining/algorithms. See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1314889890,"type":"comment"},{"by":"alain94040","id":2950541,"parent":2949787,"text":"Paris, France<p>EVE makes hardware emulation boxes that let hardware engineers debug their Verilog RTL and embedded developers boot Linux on new chips before tape-out.<p>Looking for C++ developer with some digital circuit experience, EECS background preferred.<p>Contact alain at eve-team dot com.","time":1314892900,"type":"comment"},{"by":"ckluis","id":2949946,"parent":2949787,"text":"Dunedin, FL (near Tampa/Clearwater)<p>Devs with strong: ASP.NET, SQL, javascript skills<p>www.mintek.com //website relaunching in two weeks<p>We build large-scale enterprise quality products.  We move mountains for our customers.  And all our applications have a mobile component.<p>Email me at chris.kluis@mintek.com","time":1314883998,"type":"comment"},{"by":"apgwoz","id":2949952,"parent":2949787,"text":"New York, NY - Meetup<p>We're looking for backend and UI people as well as a Sysadmin and someone who knows (MySQL, HDFS/Hbase, MogileFS) backwards and forwards (and maybe even sideways).<p>We've got a great office culture, have periodic hackathons and are growing quickly.","time":1314884065,"type":"comment"},{"by":"tedroden","id":2950739,"parent":2949787,"text":"Fancy Hands - NYC<p>Hiring<p><pre><code>  - 2 Python based engineers for Google App Engine.\n  - 1 Front End (JS, etc)\n  - 1 Marketing \n</code></pre>\nDefinitely willing to work with engineers remotely, but would prefer you to be in NYC.<p>Email me for more info, etc: tedroden @ fancyhands","time":1314895862,"type":"comment"},{"by":"prayag","id":2950723,"parent":2949787,"text":"MobileWorks (YCS11) is looking for idealist, enthusiastic and capable engineers and engineering interns in San Francisco. <a href=\"http://www.mobileworks.com/jobs.html\" rel=\"nofollow\">http://www.mobileworks.com/jobs.html</a>","time":1314895681,"type":"comment"},{"by":"amduser29","id":2950876,"parent":2949787,"text":"San Francisco, CA<p><a href=\"http://www.life360.com/jobs\" rel=\"nofollow\">http://www.life360.com/jobs</a><p>Life360 is turning smartphones into the ultimate safety device. We could use your help giving over 4 million families reassurance and peace of mind.<p>Contact: alex@life360.com","time":1314897846,"type":"comment"},{"by":"dcprep","id":2953170,"parent":2949787,"text":"Washington DC / SF Bay Area<p>Looking for a talented back end, Rails engineer who wants cofounder status and equity level (and get paid). We've been accepted into a top accelerator program - we are legit.  Learn more:<p>www.NextBigTechStartup.com","time":1314945785,"type":"comment"},{"by":"gregorymichael","id":2951482,"parent":2949787,"text":"Chicago, IL<p>Table XI<p>We are hiring Ruby, PHP and Perl developers.<p>We build custom e-commerce and data-management apps.<p>We offer flexible hours (people come in between 9am and 2pm), gourmet lunches cooked in-house, and we occasionally take corporate retreats to Costa Rica.<p>Email: jobs@tablexi.com","time":1314906682,"type":"comment"},{"by":"robinduckett","id":2954337,"parent":2949787,"text":"Cardiff, Wales, United Kingdom<p>Mon Motors Group<p>Job Title: Junior Developer<p>We're looking for a junior PHP developer, experience with Drupal, Smarty / Dwoo, Javascript, Node.js, Linux Server config, all plusses.<p>Contact robin.duckett@monmotors.com","time":1314975799,"type":"comment"},{"by":"namityadav","id":2951222,"parent":2949787,"text":"Groupon is hiring in Palo Alto, CA &#38; Chicago, IL<p><a href=\"http://www.groupon.com/jobs\" rel=\"nofollow\">http://www.groupon.com/jobs</a><p>Design, UX, Data Analyst, Android, iOS, Web-apps (Rails), Testing, ...","time":1314902391,"type":"comment"},{"by":"Aqua_Geek","id":2950150,"parent":2949787,"text":"Washington, DC - AKQA, Inc.<p>We're looking for a Senior iOS Developer and a Mobile Architect: <a href=\"http://www.akqa.com/career\" rel=\"nofollow\">http://www.akqa.com/career</a>.","time":1314887574,"type":"comment"},{"by":"emiranda","id":2950473,"parent":2949787,"text":"www.mirandabros.com<p>We make mobile games for ios and android. We are seeking Flash/Flex developers (big plus if you used Flex 4.5), Lua developers (Corona SDK), and Game Designers.<p>We prefer to work with someone local (we are located in the San Francisco Bay Area) but wouldn't mine trying something remote.<p>If you are interested please shoot us an email at admin@mirandabros.com, please include a resume. If you worked on games in the past, please include links to them.<p>Thanks!","time":1314892117,"type":"comment"},{"by":"icecommander","id":2951493,"parent":2949787,"text":"Palo Alto, CA - About.me (parent company is Aol)<p>Help make public identity on the web more beautiful.<p>We're looking for Javascript and Python developers.<p>Email me with your information: luke@about.me","time":1314906853,"type":"comment"},{"by":"hess","id":2950792,"parent":2949787,"text":"San Francisco (Possibly remote)<p>Non-technical positions\n-Business Development<p>We are a deal site for small businesses.  Early stage - equity available.<p>www.efbuys.com\nPlease email jesse at efbuys.com","time":1314896682,"type":"comment"},{"by":"smoovej","id":2951182,"parent":2949787,"text":"Jobs posted by all TechStars alumni companies:  <a href=\"http://www.techstars.org/jobs/\" rel=\"nofollow\">http://www.techstars.org/jobs/</a>","time":1314901792,"type":"comment"},{"by":"jedberg","id":2950551,"parent":2949787,"text":"Los Gatos / San Francisco Bay Area\nNetflix<p>I'm hiring for my team (although there are a ton of other jobs too)<p>The description is a little light on programming, but it really is more programming than sysadmining.<p>Netflix is a very open environment -- any engineer can push code to production pretty much any time with almost nothing in the way.  There is no release manager or schedule.  Maintaining reliability in this environment is a fun challenge!<p>Our team has three main goals:<p>* Write tools to help the other engineers know when it is safe to deploy.<p>* Create monitoring tools to detect issues before users do, fix them automatically if possible, and if not, contact the right people as quickly as possible.<p>* Take charge of outages and lead the calls until they are resolved and then follow up to make sure the root cause has been found and fixed.<p>So if this sounds like something interesting to you, you can send your resume to me at jedberg@netflix.com, and if you have any questions about the job, feel free to comment here (but don't email for questions, because I'd rather answer them here were everyone can see the answer).<p>Here's a discussion about the job on reddit:<p><a href=\"http://www.reddit.com/comments/jyaqd/\" rel=\"nofollow\">http://www.reddit.com/comments/jyaqd/</a><p>Here is the full job description from the jobs site:<p>Netflix is the world's leading streaming video service, and our growth is accelerating. At Netflix, we are upgrading our cloud management tools and pushing the limits of using cloud-based technology, powering our explosive (and soon to be international) growth while presenting new challenges to build a reliable service with ephemeral commodity hardware in an engineer friendly environment..<p>As a member of the Cloud Solutions team, you will manage, support and operate the company’s cloud environment.  You will build tools to monitor, automatically fix and/or proactively notify service owners of problems before customers notice.  You will drive incident resolution and follow through on finding root causes and getting them fixed.<p>You are an expert in distributed, highly concurrent, web-scale systems that are fault-tolerant and run 24x7 with unparalleled availability. You are a talented devops engineer and you thrive on managing and maintaining a reliable environment that others depend on.<p>You possess these qualities:<p>* You see the big picture delivering a 24x7 service<p>* You are effective working with multiple teams<p>* You have high standards in everything you do<p>* You can balance multiple tasks<p>You have these skills:<p>* Great communication skills, both verbal and written<p>* In-depth experience operating a 24x7 production environment<p>* Fluent in Linux: RedHat, CentOS, Fedora, Ubuntu<p>* Strong scripting and programming skills (we’re going to ask you to write code on the whiteboard)<p>* Familiar with the Java platform, especially JVM configuration and JMX<p>* Knowledgeable in Linux packaging tools: rpm, yum, dpkg, apt<p>* Ability to quickly triage problems, determine root cause and drive resolution<p>* Ability to keep a cool head under pressure and effectively participate in system down crisis situations<p>You may even have these skills:<p>* Expertise in one or more of the following: Java, Python, Ruby, Perl, shell<p>* Prior experience with Amazon EC2/S3 or other cloud service providers<p>* Building systems deployment and service management automation tools<p>* Familiarity with large scale systems and methodologies<p>If this sounds interesting then we want to hear from you!","time":1314893035,"type":"comment"},{"by":"200902","id":2951030,"kids":[2951660],"parent":2949787,"text":"New York, NY<p>Job Title: Developer | Rails / Java / XP<p>Cyrus Innovation (www.cyrusinnovation.com) is a small (~30 people) NYC-based Agile development consulting firm. As pioneers in Agile methodology, we pride ourselves on being named one of Inc 5000’s fastest growing companies for three consecutive years. We embrace the latest Agile practices, open source tools, and strive for continuous process improvement. We provide XP teams on demand to both start-ups and enterprise organizations. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you.<p>Cyrus will bring to you:\n- the chance to create complex software solutions you will be proud of\n- the opportunity to work alongside bright, analytical, and experienced programmers\n- a true XP environment: TDD, pair programming, continuous integration, and lightweight design\n- direct interaction with clients to gather and analyze business requirements\n- experience and collaboration on all levels of software development from design to implementation\n- experience working with Java, Ruby, Groovy, Scala, and Javascript\n- an opportunity to have a real voice in critical design decisions<p>You will enjoy:\n- a week-long training course by Jim Shore attended by the entire company\n- a true 40-hour work week with no / minimal travel\n- an energized, yet casual work environment\n- full benefits including medical, dental, vision, 401(k) matching\n- an efficient organization where your opinion really matters\n- an annual personal budget and paid time off for professional development (conferences, workshops, etc.)\n- weekly kaizen (process improvement) sessions\n- knowledge-sharing brown bag sessions\n- daily stand ups\n- a company wide hackfest at our quarterly company meeting<p>You will bring:\n- a true, demonstrable passion for coding, both in and out of the office\n- a team oriented work demeanor and a desire for both teaching and learning\n- an outside the box approach to problem-solving\n- a strong enthusiasm and knowledge for XP\n- the desire and ability to learn new technologies quickly\n- experience with Object Oriented programming \n- knowledge of design patterns and refactoring<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. If you’re a talented and hard-working developer who is enthusiastic about Agile, we would love to hear from you. We are serious about our commitment to our employees and invite you to join our team.<p>If you are interested in learning more or would like to apply for a position, send an email to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1314899551,"type":"comment"},{"by":"garysieling","id":2969421,"parent":2949787,"text":"Philadelphia\nWingspan Technology<p>We're looking for Java and iOS (iPad) engineers. We write enterprise software for pharmaceuticals and others.\n<a href=\"http://www.wingspan.com/about/careers/\" rel=\"nofollow\">http://www.wingspan.com/about/careers/</a>","time":1315402330,"type":"comment"},{"by":"WadeWilliams","id":2950748,"parent":2949787,"text":"Phoenix, AZ, Full Time - Some Telecommuting if you're the best.<p>Job Title: Front End Developer<p>Local Motors (www.local-motors.com) is a auto industry game changer. Using our website, anyone can participate in co-creating amazing new vehicle designs. After building the Rally Fighter (www.rallyfighter.com) and the XC2V for DARPA (<a href=\"http://www.local-motors.com/lmBuild.php?c=11185\" rel=\"nofollow\">http://www.local-motors.com/lmBuild.php?c=11185</a>), now Local Motors is producing a new web site which will leverage co-creation and gaming to bring America the next generation of automobiles.<p>Are you positive, supportive and inspiring to others?<p>Do you get things done? Are you independent, and yet take direction well?<p>Are you passionate enough to work in a start-up?<p>Do you get excited about cool new interfaces and ways of interacting with the web?<p>Do you want to be a part of changing our world in a meaningful way?<p>You may be a recent graduate with relevant school projects or endless hours of relevant tinkering behind you. You may have a couple of years experience under your belt developing slick user interfaces. Either way, you are both talented and organized.<p>Our playground:<p>LAMP, HTML5, CSS3, Javascript, jQuery, SVN,<p>Responsibilities:<p><pre><code>    Implement public facing pages\n    Help make UI and UX decisions\n    Build reusable CSS/JS frameworks to simplify development\n    Participation in general internet engineering needs of the company\n\n\n</code></pre>\nRequirements:<p><pre><code>    Smart\n    Gets things Done\n    Exceptional proficiency using HTML5/CSS/Javascript/jQuery/AJAX in a production environment\n    In depth knowledge of browser compatibility\n    Familiarity with Object Oriented Programming\n    Demonstrated design and UX sensibilities\n    Strong CS fundamentals gained through Bachelor’s degree in CS, HCI or related discipline or equivalent industry experience\n    Personal projects that show and aptitude for front-end engineering and product design sense\n    Ability to work in areas outside of their usual comfort zone and get things done quickly\n    Knowledge of SVN\n\n\n</code></pre>\nDesirable:<p><pre><code>    Excellent Knowledge in SEO and Internet Marketing\n    Experience using object oriented PHP\n    Experience with PHPMyAdmin\n\n    Experience using MySQL in a production environment\n\n\n</code></pre>\nBenefits<p><pre><code>    Competitive salaries\n    Vacation days &#38; time off\n    Medical coverage\n    70 Degree winter days in Phoenix, AZ\n    An active working environment with brilliant designers, engineers and technology experts\n    Much more...</code></pre>","time":1314895987,"type":"comment"},{"by":"paulitex","id":2950435,"parent":2949787,"text":"Vancouver, BC, Canada. full post: <a href=\"https://www.matygo.com/careers\" rel=\"nofollow\">https://www.matygo.com/careers</a><p>Matygo takes the traditional university classroom and explodes it across time, space, and social dimensions. We've reexamined the problems historically addressed by an LMS[1] and built a globally accessible free system for university instructors that makes learning more efficient, removes redundancies in teaching, builds social and content graphs, and has already gained traction internationally.<p>We're a small founding team (two, both technical, plus an HN-hired intern) with a huge ambition to revolutionize one of the largest and most important industries on earth. We are seeking a developer and a marketing communicator. These will be our key first hires and will be expected to lead teams in the near future.<p>By far, the most important qualification is culture fit.<p>See the story of William Kamkwanba from one of our first blog posts (<a href=\"http://blog.matygo.com/post/518849458/announcing-the-matygo-alpha\" rel=\"nofollow\">http://blog.matygo.com/post/518849458/announcing-the-matygo-...</a>) for our guiding philosophy.<p>Matygo is a GrowLab company (<a href=\"http://www.growlab.ca/\" rel=\"nofollow\">http://www.growlab.ca/</a>), backed by top investors. We are still in the first quarter of the program - joining now means being able to go through most of the program including the trip to SF, Demo Day, Under the Radar conf, and meeting a ton of people.<p>Developer:<p>- We play with fun tech: our backend is a custom framework in Scala and our web frontend is Sproutcore. We need someone who can rock them both: Javascript experience is essential, and Scala would be fantastic (but Java + some functional is sufficient).<p>- Very comfortable with all levels of the web stack. Can implement a feature front-to-back from our db (schema design, mysql) to the css and js that makes our app hum. Rest, http, and tcp understanding essential.<p>- Good software engineering skills including testing (e.g. unit vs. integration - when to use which?), system design, and agile techniques.<p>Marketer:<p>- Great communication skills: Will be responsible for everything from our A/B testing our landing page and social media to partner and customer engagement channels.<p>- Familiarity with lean startup and customer development approaches.<p>- Possess the ability, drive, and vision required to play a key part in developing and executing Matygo's user acquisition strategy. We go direct to instructors (and students, in the near future).<p>- Sales and presentation/public speaking experience would be fantastic.<p>For both positions:<p>- Creative. Bonus points for side hobbies like music, photography, design, or any other creative expression.<p>- Desire to work startup hours and understand the commitment, responsibility, and rewards that come with being a first employee of a high growth startup.<p>- See 'how to apply': <a href=\"https://www.matygo.com/careers\" rel=\"nofollow\">https://www.matygo.com/careers</a><p>[1]<a href=\"http://en.wikipedia.org/wiki/Learning_management_system\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Learning_management_system</a>","time":1314891600,"type":"comment"},{"by":"pitdesi","id":2950278,"parent":2949787,"text":"INTERN - looking for a PR/Marketing intern at <a href=\"http://feefighters.com\" rel=\"nofollow\">http://feefighters.com</a><p>We're in Chicago, you don't have to be, though it would be preferred. We've had great luck hiring programming interns from HN and have already hired a social media/marketing intern. We could use a Public Relations intern too.<p>Here's the job description for the marketing intern that we already filled... We haven't written a PR intern description yet but it would be similar, but with more Public Relationsy stuff.\n<a href=\"http://feefighters.com/jobs/kickass-marketing-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-marketing-intern/</a><p>Press is a big part of what we do, for driving traffic to the site and SEO purposes. We have been able to get great press on our own (<a href=\"http://feefighters.com/press\" rel=\"nofollow\">http://feefighters.com/press</a>) and fired 2 different PR firms we were working with. Another aspect of PR is figuring out where we should be on the internet - responding in forums etc. Drop me a line if you're interested- email is in my profile.","time":1314889369,"type":"comment"},{"dead":true,"deleted":true,"id":2950323,"parent":2949787,"time":1314889967,"type":"comment"},{"by":"andrewpbrett","dead":true,"id":2950507,"parent":2949787,"text":"Cake Health is looking for our first full-time employee to help us tackle the huge problem of health care costs in the US. We're in the Bay Area (San Francisco, Mountain View, Palo Alto for the Ctrl+F'ers).<p>The product to date has been built on Ruby on Rails + mySQL + jQuery, so fluency with those is a plus. We're moving on to tackle some larger problems, though, so I'm far more interested in what you've done than what you've done it with.<p>More info at <a href=\"http://cakehealth.com/jobs\" rel=\"nofollow\">http://cakehealth.com/jobs</a>","time":1314892434,"type":"comment"},{"by":"mmedia","dead":true,"id":2951278,"parent":2949787,"text":"Millennial Media has some awesome development jobs available in Baltimore, Washington DC, and San Francisco.  Check us out at \n<a href=\"http://www.millennialmedia.com/about-millennialmedia/careers/\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers...</a><p>Cutting edge Mobile technology!!","time":1314903460,"type":"comment"},{"by":"officiallyrad","dead":true,"id":2950936,"parent":2949787,"text":"New York City<p>Fast Society - www.fastsociety.com<p>We're building an awesome social experience platform and looking for:<p>- Android developer<p>- C++ programmer (3d and game design experience)<p>- Mobile &#38; Web Designers<p>- PHP junior developer<p>More info at <a href=\"http://fastsociety.com/jobs/\" rel=\"nofollow\">http://fastsociety.com/jobs/</a> or email andy@fastsociety.com","time":1314898362,"type":"comment"},{"by":"hockeybias","dead":true,"id":2950101,"parent":2949787,"text":"Becuase its on everybody's mind, for the sake of clarity, let it be known that HockeyBias.com (<a href=\"http://hockeybias.com\" rel=\"nofollow\">http://hockeybias.com</a>) is not currently hiring (and will resume posting by the end of the month).","time":1314886845,"type":"comment"}]}