{"comments":[{"by":"Macca","id":2162015,"kids":[2164221,2162975,2162417,2162032,2163727,2163101],"parent":2161360,"text":"SpaceX, Los Angeles.  Working remotely is not an option for new-hires.  In December we became the first private organization to put a spacecraft into orbit and return it safely (highlights: <a href=\"http://spacex.com/multimedia/videos.php?id=57\" rel=\"nofollow\">http://spacex.com/multimedia/videos.php?id=57</a>).  The other entities who've done this are all governments or governmental collaborations.  SpaceX is continuing our expansion. Want to write code that lives on the International Space Station or controls our vehicle while it visits? Want to help humanity colonize Mars? Drop us a line, we're hiring. Visit spacex.com/careers for more info.  For reasons relating to ITAR, you must be a US citizen or permanent resident.","time":1296491026,"type":"comment"},{"by":"timcederman","id":2162441,"kids":[2162547,2163012,2162879,2162951,2162965,2164557],"parent":2161360,"text":"I'm curious as to how helpful these threads have been to both seekers and employers.  Has anyone found a job through one of these threads?  Do employers get meaningful applications?","time":1296496585,"type":"comment"},{"by":"pchristensen","id":2162193,"kids":[2166745],"parent":2161360,"text":"Groupon (Chicago, Palo Alto)<p>Groupon is still hiring developers.  We have an aggressive hiring plan for the rest of the year.  All job openings are at <a href=\"http://groupon.com/jobs\" rel=\"nofollow\">http://groupon.com/jobs</a>.  The jobs are all cooler than the posts make them sound - we're working on that.<p>Location:  We have offices in Chicago and downtown Palo Alto.  A unique thing about our dev team is that for most jobs, it doesn't matter which office you work out of.  Both offices have most jobs, people travel between offices as needed or desired, and we have good teleconferencing practices.<p>Upcoming projects:<p>- scaling for big, big traffic growth<p>- Big Data work around personalization and more<p>- lots of new projects, both internal and public<p>- Most work is in Rails but previous Rails knowledge isn't a requirement.  Previous awesomeness is a requirement though.<p>Benefits:<p>- job security, market salaries - we're making money and just raised $1B<p>- talented and excited coworkers - there's energy here I haven't felt at any other place<p>- good development practices - increasing test coverage, requirements planning, post-mortems and retrospectives, etc<p>- laser powered cat mascot<p>- visa assistance and relocation on a case-by-case basis<p>If you're interested or have questions, email me at peterc@groupon.com and I can direct you to the right people.","time":1296493343,"type":"comment"},{"by":"kamens","id":2161568,"kids":[2161618,2183512,2161657],"parent":2161360,"text":"khanacademy.org - Mountain View, CA - remote is a possibility<p>Hiring full-time devs and dev interns. Non-profit trying to change education. Backed by Gates Foundation and Google.<p>ben+HN@khanacademy.org for more info","time":1296485174,"type":"comment"},{"by":"sachinag","id":2162003,"parent":2161360,"text":"Cambridge, MA (sorry, no remote)<p>Blueleaf.com -- looking for interns:<p>Marketing Engineer Intern: ideal for someone who wants to be a founder someday; lots of A/B testing implementation, making APIs do things they weren't designed to do, implementing crazy ideas from Dir of Mktg (me) and CEO<p>Director of Content: you will write a lot about investments/investing, find others who will write for us about said topics, link to yet others who write on said topic, and generally start putting us out there (consistent with our corporate voice, which we know but isn't public yet)<p>Marketing Intern: your standard social media douchebaggery, AdWords/landing page testing, and other \"flood the funnel\" activities<p>No job posting to link to, but I'm at sachin@blueleaf.com","time":1296490826,"type":"comment"},{"by":"squirrel","id":2161655,"parent":2161360,"text":"Boston (US) as well as London (UK) - youDevise, Ltd.<p>We're a 65-person financial-software firm committed to learning and improvement as well as great web software and agile development. We're hiring developers and other smart folks of many kinds. See <a href=\"http://www.youdevise.com/careers\" rel=\"nofollow\">http://www.youdevise.com/careers</a> and <a href=\"https://dev.youdevise.com\" rel=\"nofollow\">https://dev.youdevise.com</a>.<p>While we don't have remote workers, we do help successful candidates relocate to London or Boston including arranging visas where needed. For example, last year we hired HN readers from Denmark and the US, and we moved a Polish employee to Boston.","time":1296486664,"type":"comment"},{"by":"malbiniak","id":2162929,"parent":2161360,"text":"The Nerdery (Minneapolis - HQ, Chicago - satellite office). <a href=\"http://www.nerdery.com/jobs\" rel=\"nofollow\">http://www.nerdery.com/jobs</a><p>Hi HN. We're not a product/platform company, and aren't in SV, but we do have one hell of a culture, myriad projects, and an unending pipeline of new work. To support that growth, we're planning on adding an additional 100 people during 2011. If you're interested, have questions, or send in a resume, please let me know. I want to make sure anyone coming from HN stands out in our application pool. matt.albiniak at nerdery d0t com<p>Most common thing heard around The Nerdery - \"I learned more here in 3 months than I've learned anywhere else.\" Dog friendly, caffeine provided, developer owned and operated.<p>We have immediate openings for:<p>* Front End Dev - JS knowledge required, jQuery experience preferred.<p>* C# ASP.NET Developer - ASP.NET MVC preferred<p>* PHP Developer - Zend<p>* Actionscript Developer - AS3<p>* IA/UX Designer - previous FED experience<p>* Software Project Manager - you make juggling look easy<p>* IT Systems Technician - we're tech-centric. Not so much \"can you install this\" as much as \"need ____ provisioned.\"<p>* iOS Developer - please hurry.<p>* ExpressionEngine Developer - see above.<p>Oh, and if you're not a great developer but understand tech (like me), we're hiring in sales, too.","time":1296503896,"type":"comment"},{"by":"nathanh","id":2161785,"kids":[2164907],"parent":2161360,"text":"Hirelite.com is on a mission to put headhunters out of business by hosting speed interviewing events where developers and companies conduct 20 interviews over video chat in 2 hours.<p>We have a few upcoming web-based events:<p>- For SF Bay Area/Silicon Valley jobs on Tuesday, 2/15<p>- For NYC jobs on Tuesday, 3/1<p>- For Boston jobs on Wednesday, 3/9<p>- We're considering hosting an event focused on remote jobs. Would that be of interest?<p>If you're interested in participating, feel free to email me any questions or sign up on <a href=\"http://www.hirelite.com\" rel=\"nofollow\">http://www.hirelite.com</a>. We have spaces available for both developers and companies.","time":1296488612,"type":"comment"},{"by":"nixme","id":2163025,"kids":[2163728],"parent":2161360,"text":"Salesforce (San Francisco, CA) is hiring across all organizations: <a href=\"http://www.salesforce.com/company/careers/\" rel=\"nofollow\">http://www.salesforce.com/company/careers/</a><p>But we have an <i>immediate need</i> for a badass developer on our Product Marketing Demos team. We regularly use the latest technologies and platforms to build product prototypes, demonstrations, and visualizations that effectively communicate our product line.<p>To give you an idea, in the past three months alone, our team has used Ruby, Coffeescript, Backbone, Raphael, Java/Android, and Obj-C/iOS to build apps demoed across the world in front of over 30,000 people at our global events.<p>So if you like experimenting with upcoming technologies and want to make that part of your job description, email me at gopal.patel@salesforce.com<p>...And we work in downtown SF right along the embarcadero -- some of the best views of the bay and city.","time":1296505612,"type":"comment"},{"by":"YammerMel","id":2163072,"kids":[2163348,2163220,2163701,2163492],"parent":2161360,"text":"YAMMER helps turn the mayhem of the corporate world into return-on-investment unicorns and leveraged-employee-engagement butterflies.\nWe are a medium sized start-up that is battling several big enterprise software companies in this space. So yes, our target customers are in the enterprise space BUT we are turning this space upside down with our viral approach and how we build solutions for the user (which doesn’t include an army of salesmen). We are solving consumer type problems but also monetize like enterprise software. (i.e. real revenues with fewer users)<p>What's in it for you?:<p>-GOOD catered Lunch and Dinner daily<p>-Fancy Apple Hardware of your choice (you can have a PC if you REALLY want one)<p>-Amazing group of smart engineers (sounds cliche, but we really do have smart people here :D )<p>-Ability to have influence without authority.<p>-Working with technologies like Scala, Rails, and advanced JavaScript<p>-Wine and Whiskey Connoisseurs onsite at your disposal<p>-Our CEO is David Sacks, and yes, he is responsible for making the movie, \"Thank You for Smoking\".<p>-Top of the market Start-up Compensation (we pay to play)<p>Check us out! <a href=\"https://www.yammer.com/about/jobs\" rel=\"nofollow\">https://www.yammer.com/about/jobs</a>","time":1296506385,"type":"comment"},{"by":"holman","id":2162081,"parent":2161360,"text":"GitHub — San Francisco, CA. Remote's doable, although we dig SF'ers.<p>We're looking for someone to help us out with GitHub's Enterprise product, Firewall Install. Basically we want to add 22 units of awesome to it, at a minimum. See our job page for details and to apply, or feel free to ping me at @holman if you have super special questions.<p><a href=\"http://jobs.github.com/positions/93a9f09a-2a4e-11e0-9546-9a4b942b77d5\" rel=\"nofollow\">http://jobs.github.com/positions/93a9f09a-2a4e-11e0-9546-9a4...</a>","time":1296491814,"type":"comment"},{"by":"benji-york","id":2161779,"parent":2161360,"text":"Canonical is continuing to grow.  Most of the technical positions are remote.  It's a great place to work.  Tell them Benji sent you. <a href=\"http://webapps.ubuntu.com/employment/\" rel=\"nofollow\">http://webapps.ubuntu.com/employment/</a>","time":1296488531,"type":"comment"},{"by":"smanek","id":2161819,"kids":[2166770],"parent":2161360,"text":"San Francisco, CA<p>Greplin - We're a YC W10 company with interesting problems, smart people, cool tech, and huge data. What more could you want?<p>We're hiring across the board right now - front-end/back-end/generalists/designers/ops/dev-ops: it's all good!<p>We help people search their personal information that's in the cloud (Gmail, Dropbox, Facebook, LinkedIn, etc). As TechCrunch said, we've \"attacked the other half of web search.\"<p><a href=\"https://www.greplin.com/jobs\" rel=\"nofollow\">https://www.greplin.com/jobs</a><p>Sorry, no remote work.","time":1296488929,"type":"comment"},{"by":"StyleOwner","id":2162587,"parent":2161360,"text":"StyleOwner (San Francisco) is hiring for two positions.  If interested please get in touch <i>today</i> if possible.<p>We're a small, venture funded startup in the fashion space (very hot right now). Looking for one frontend and one backend engineer.<p>Benefits: Competitive pay, small team atmosphere, you get to have a big impact on our success.  Dev team located in SF.  Currently we work from home / coffee shops &#38; meet in person one day a week for a hack session / coffee.<p>Two postings:<p><a href=\"http://jobs.37signals.com/jobs/8105\" rel=\"nofollow\">http://jobs.37signals.com/jobs/8105</a><p>and<p><a href=\"https://jobs.github.com/positions/a06703dc-1e86-11e0-8f66-2007d7f370a5\" rel=\"nofollow\">https://jobs.github.com/positions/a06703dc-1e86-11e0-8f66-20...</a><p>The ideal candidates are comfortable on a small team, write solid, clean code, and are able to handle a loosely structured environment.  Please send a link to your portfolio or github profile, etc.  For a shortcut to apply, just email matt@styleowner.com.","time":1296498661,"type":"comment"},{"by":"agotterer","id":2162373,"kids":[2196204,2169034,2169027,2168379],"parent":2161360,"text":"Lot18 - New York City<p>We are revolutionizing the wine e-commerce experience. We're an agile, early stage, venture backed technology startup. Our company is a great place for smart, hard working people who want to make a difference and help change the wine world.<p>Engineers - <a href=\"http://www.lot18.com/careers#web_engineer\" rel=\"nofollow\">http://www.lot18.com/careers#web_engineer</a><p>Designers - <a href=\"http://www.lot18.com/careers#web_designer\" rel=\"nofollow\">http://www.lot18.com/careers#web_designer</a><p>All careers - <a href=\"http://www.lot18.com/careers\" rel=\"nofollow\">http://www.lot18.com/careers</a><p>---<p>P.S.\nCheck out <a href=\"http://www.startupshiring.com\" rel=\"nofollow\">http://www.startupshiring.com</a> for an aggregated list of startup jobs from many of the companies on this thread. If you're company isn't listed, please add a request. <a href=\"http://www.startupshiring.com/add\" rel=\"nofollow\">http://www.startupshiring.com/add</a>.","time":1296495538,"type":"comment"},{"by":"kshashi","id":2162821,"parent":2161360,"text":"TheFind (<a href=\"http://www.thefind.com\" rel=\"nofollow\">http://www.thefind.com</a>), Mountain View<p>TheFind is solving fundamental problems in information extraction and search by using applied machine learning. We successfully crawl and extract products from a billion web pages. We currently have 25MM+ users visiting thefind.com every month, and are growing 100% YOY.<p>Our goal is to build a product focussed on all aspects of the shopping process like comprehensive selection, price comparison, coupons, product reviews, sentiment analysis, shopping at local stores, eco-friendly shopping, hot trends, shopping based on your personal and friend's tastes, mobile shopping etc.<p>If you've worked on things like information extraction, search relevance, text mining, big data etc. and would love to architect solutions to challenging problems, please email our CTO at kshashi _AT_ thefind _DOT_ com","time":1296502204,"type":"comment"},{"by":"flyosity","id":2162134,"parent":2161360,"text":"Bronto Software - Durham, NC (remote is possible)<p>We build complex marketing software. PHP on the frontend (Zend Framework and custom components) and Hadoop/Cassandra on the backend. Lots of huge data challenges &#38; tons of servers. You'd be joining a big Engineering team with a ton of smart people.<p>- Looking for a web software engineer with deep experience with PHP and MySQL.<p>- Looking for an engineering manager to run the new team working on new cool stuff.<p>Both positions shown here: <a href=\"http://bronto.com/company/careers\" rel=\"nofollow\">http://bronto.com/company/careers</a><p>Bronto's a great company and the Engineering department is especially fun. The environment is great: 20' ceilings in an old tobacco warehouse, exposed 100-year old beams, gigantic windows, open floor plan. Foosball, lots of free drinks, snacks and food. Lots of freedom to build great stuff, no micromanagement.","time":1296492551,"type":"comment"},{"by":"felideon","id":2161966,"parent":2161360,"text":"Ft. Lauderdale, FL  -- non-remote (worth the relocation!)<p>MCNA Dental Plans --  Looking for heads down engineers with Lisp experience or exposure.<p>Health care probably doesn't sound too interesting but this industrial-strength business application is being re-written from scratch in Common Lisp. The system being built includes a hybrid relational and graph database on Postgres, quasi-natural-language driven production rule systems, rich internet application (using Lisp to wrap/drive qooxdoo), and great graphics!<p>Did I mention working with 6 other awesome Lispers?<p>Original job post:  <a href=\"http://lispjobs.wordpress.com/2010/12/22/lisp-developer-mcna-fort-laurderdale-florida/\" rel=\"nofollow\">http://lispjobs.wordpress.com/2010/12/22/lisp-developer-mcna...</a><p>Email me (look in profile) if you have any questions or you want a softer intro to the hiring manager.","time":1296490364,"type":"comment"},{"by":"akeefer","id":2162415,"parent":2161360,"text":"Guidewire Software - San Mateo, CA (mid-peninsula in the Bay Area, for non-natives)<p>We do core systems for insurance companies.  No longer a startup (we're about 9 years old), but still privately held and doing very well financially.<p>The core work is in Java, but the platform is mostly a proprietary stack, including the Gosu language that we've recently open-sourced (<a href=\"http://gosu-lang.org\" rel=\"nofollow\">http://gosu-lang.org</a>) and are still actively developing.<p>We need developers on our applications and our platform, as well as product managers and QA.  <a href=\"http://www.guidewire.com/careers\" rel=\"nofollow\">http://www.guidewire.com/careers</a> for more details.<p>Feel free to e-mail me directly (akeefer@guidewire.com) if you're interested or have any questions (I'm the tech lead on our platform team).","time":1296496187,"type":"comment"},{"by":"lecha","id":2161868,"kids":[2162871],"parent":2161360,"text":"Hopper - Montreal <a href=\"http://hopper.travel\" rel=\"nofollow\">http://hopper.travel</a><p>Hopper is a search engine for making trips. We use information extraction, machine learning, distributed computing and custom search algorithms to transform ridiculously huge volumes of data into useful information. Interested? Get in touch.<p>For more info about us, check out <a href=\"http://nextmontreal.com/product-market-fit-hopper-travel-fred-lalonde/\" rel=\"nofollow\">http://nextmontreal.com/product-market-fit-hopper-travel-fre...</a>","time":1296489480,"type":"comment"},{"by":"techsupporter","id":2162111,"parent":2161360,"text":"I know it's not in the traditional vein of what people look for at HN, but Microsoft is hiring for Commercial Technical Support in Dallas (Irving) TX, Charlotte NC, and (I think) Fargo ND.  There are openings in a variety of groups (SharePoint, Windows OS, SQL, IIS, Exchange) and for a variety of positions (Support [Escalation] Engineer, which is phone-based, and Escalation Engineer, which is debug/code-based).<p>Note: I work for Microsoft in CTS, though I'm posting on my own.","time":1296492212,"type":"comment"},{"by":"pquerna","id":2161743,"parent":2161360,"text":"Rackspace - San Francisco<p>As part of acquiring Cloudkick (YC W09), Rackspace is building out its first bay area office.<p>Most of these positions are working with the Cloudkick team.<p>Looking specifically for:<p><pre><code>  - Javascript people, who can help build a \n    fully client side application.\n\n  - Python &#38; Node.js people for expanding our \n    backend services (Cassandra experience is a plus)\n\n  - General C/C++/Lua for work on our agent\n    and monitoring systems.\n</code></pre>\nIf these interest you, drop me ( pquerna@cloudkick.com ) a line.<p>More specific positions are also up on the racker talent site:<p><a href=\"http://jobs.rackspace.com/search/?q=san+francisco\" rel=\"nofollow\">http://jobs.rackspace.com/search/?q=san+francisco</a>","time":1296488057,"type":"comment"},{"by":"jplewicke","id":2161764,"kids":[2162375,2171360],"parent":2161360,"text":"Boston, MA (not remote)<p>MDT Advisers - We're a small quant investing shop working with machine learning, financial analysis, and the hardest dataset in the world. We’ve got two main types of positions that we’re hiring for: a dedicated developer position, and a general analyst position that’s about 60% programming and 40% financial and statistical analysis -- <a href=\"http://www.mdtadvisers.com/careers/qea.jsp\" rel=\"nofollow\">http://www.mdtadvisers.com/careers/qea.jsp</a> . The people, problems, and pay are good, and we aim for good work-life balance(e.g. no 60 hour weeks).<p>You can email me at jlewicke@mdtadvisers.com with any questions you have.","time":1296488395,"type":"comment"},{"by":"NetMonkey","id":2161805,"kids":[2161954],"parent":2161360,"text":"Copenhagen, Denmark<p>- Looking for full-time iPhone/iPad developer.<p>You must have good experience with the platforms as you will initially be responsible for creating the app from scratch without any in-house expertise.\nSome decent knowledge of networking and possibly C is also necessary as the app will interface with an extensive backend.<p>- UX designer<p>If you are capable of making great looking vector graphics and know / can quickly learn to draw in Flash then we may have a full time position available.<p>- Info<p>Remoting is not an option currently. We are willing to look into helping with relocation for the right person, but we prefer locals at this stage.<p>Send an email to jonas at enwire dot dk with a short info about yourself.","time":1296488806,"type":"comment"},{"by":"magicseth","id":2162843,"kids":[2162863,2162876,2162913],"parent":2161360,"text":"Bump (Mountain View, CA)<p>Come work with me!!! I do iPhone magic at Bump.<p>We are hiring lots of positions in iPhone, Android, Web Dev (HTML etc), Systems Engineerings, Algorithms, and Designer positions too.<p><a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a>","time":1296502513,"type":"comment"},{"by":"ptornroth","id":2162133,"parent":2161360,"text":"San Francisco, CA  (Remote's a possibility, too)<p>Elation EMR - <a href=\"http://www.elationemr.com\" rel=\"nofollow\">http://www.elationemr.com</a><p>We're building web based tools that improve the lives of physicians and their patients. We're a small, angel-funded team with some really incredible people on board ( <a href=\"http://elationemr.com/aboutus.html\" rel=\"nofollow\">http://elationemr.com/aboutus.html</a> ), and we're looking to add one or two more engineers to complete core of our technical team.<p>As one of our first hires, you'll play a key role in shaping the company and culture, architecting the foundations of a very complex system, and designing the experience for a highly demanding user. No healthcare experience is needed, but you should be excited about building technology that has the potential to deeply impact people's lives.<p>Our tech stack is still growing but currently includes Python, Django, MySQL, jQuery, and Java. A few more details here: <a href=\"http://elationemr.com/jobs.html\" rel=\"nofollow\">http://elationemr.com/jobs.html</a><p>Don't hesitate to be in touch!","time":1296492510,"type":"comment"},{"by":"roobeast","id":2162474,"parent":2161360,"text":"Trulia (Downtown San Francisco)<p>Fastest growing real estate search site.<p>Looking for multiple solid back-end developers, a data scientist or two, an engineer with email systems experience, front end php/javascript types if experienced, and at least one data warehouse engineer and one sysadmin.<p>Ongoing and upcoming work:<p>Efficient scaling of multiple systems<p>Creating new products out of all the real estate data we have access to.<p>Integrating new sources of interesting data many of which are geospatial in part.<p>Excellent opportunity to work with cutting edge tech (we save the bleeding edge stuff for prototyping) and work in an environment where your work can have an immediate impact on the business.<p>The back end is mostly java with bits of python,  the front end is lamp based.  We make heavy use of open source where we can.<p>Not all the positions are posted all the time so if you don't see one of the ones mentioned, just apply for one of the other engineering positions and put in the cover letter part what you are actually interested in.\n<a href=\"http://www.trulia.com/jobs\" rel=\"nofollow\">http://www.trulia.com/jobs</a>","time":1296497017,"type":"comment"},{"by":"lpolovets","id":2161990,"kids":[2211303],"parent":2161360,"text":"Los Angeles, CA and Silicon Valley, CA -- Factual<p>Working remotely is a possibility for exceptional engineers, but in-person is highly preferred.<p>Factual aims to be the place where people meet to share, improve, and mash-up data. We have an awesome team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). We recently raised a Series A from Andreessen-Horowitz, and our customers include Facebook (we provide some of their Places data) and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is great place to be.<p>We're looking for awesome Java generalists. Bonus points for experience with MapReduce, developing NoSQL datastores and/or machine learning.<p><a href=\"http://www.factual.com/jobs\" rel=\"nofollow\">http://www.factual.com/jobs</a><p>You can also email me personally at leo -at- factual.com","time":1296490606,"type":"comment"},{"by":"lovitt","id":2162064,"parent":2161360,"text":"SB Nation is a media/technology startup in Washington, DC. We're hiring Ruby developers and visual designers (local preferred, remote considered):<p><a href=\"http://www.sbnation.com/jobs/developer\" rel=\"nofollow\">http://www.sbnation.com/jobs/developer</a><p><a href=\"http://www.sbnation.com/jobs/designer\" rel=\"nofollow\">http://www.sbnation.com/jobs/designer</a><p>We're a network of 290+ sports news sites &#38; communities. As newspapers are shutting down their sports sections, we're quietly reinventing the media model with profitable, high-quality, innovative coverage by and for fans. Our investors include Accel Partners, Allen &#38; Company, Comcast Interactive Capital, and Khosla Ventures. We get around 16 million unique visitors every month.<p>Our small product team develops the custom publishing and community platform (built on Rails) that powers the sites. The interesting problems we face range from editorial analytics, to social distribution, to scaling the system to handle our rapid growth.<p>Here are some of the humans you'd be working with: \n<a href=\"http://www.flickr.com/photos/mlovitt/4507489423/in/set-72157623699958119/\" rel=\"nofollow\">http://www.flickr.com/photos/mlovitt/4507489423/in/set-72157...</a><p>And some recent press:<p>* Why sports is driving innovation in journalism: <a href=\"http://markcoddington.com/2010/10/08/why-sports-has-taken-the-lead-in-newsroom-innovation/\" rel=\"nofollow\">http://markcoddington.com/2010/10/08/why-sports-has-taken-th...</a><p>* NY Times profile: <a href=\"http://www.nytimes.com/2010/06/07/business/media/07fans.html\" rel=\"nofollow\">http://www.nytimes.com/2010/06/07/business/media/07fans.html</a><p>* Harvard's Nieman Journalism Lab: <a href=\"http://www.niemanlab.org/2010/06/sb-nation-ceo-on-how-were-fans-of-teams-not-sports-t-v-shows-not-t-v-and-what-that-means-for-news/\" rel=\"nofollow\">http://www.niemanlab.org/2010/06/sb-nation-ceo-on-how-were-f...</a>","time":1296491586,"type":"comment"},{"by":"buymorechuck","id":2161479,"parent":2161360,"text":"Palo Alto, CA - <i>Flipboard</i><p>Seeking iOS and web developers with a passion for design and craftsmanship. (No remote is possible.)<p><a href=\"http://www.flipboard.com/jobs\" rel=\"nofollow\">http://www.flipboard.com/jobs</a><p>[NSString stringWithFormat:@\"%@+HN@%@.com\", @\"charles\", @\"flipboard\"]","time":1296483696,"type":"comment"},{"by":"newhouseb","id":2162145,"parent":2161360,"text":"Bubbli - Palo Alto, CA.  Remote not a possibility at this stage.<p>We're a very well funded augmented reality startup co-founded by myself (who created Yelp Monocle) and my co-founder, a designer from NYC.  We're going to be closing a big round in the next few days and are soft launching at TED (the real one) next month.  John Doerr also told us he's just seen the future when he saw our demo, if that means anything to you.<p>We're looking to hire a computer vision engineer, front-end engineer, and back-end engineer.  You'll potentially be our first employee - and we'll be paying well.<p>For an intro see <a href=\"http://bubbli.co/intro\" rel=\"nofollow\">http://bubbli.co/intro</a><p>For more about the jobs see <a href=\"http://blog.bubbli.co/jobs\" rel=\"nofollow\">http://blog.bubbli.co/jobs</a><p>For a bit about some internal tools see <a href=\"http://blog.bubbli.co\" rel=\"nofollow\">http://blog.bubbli.co</a><p>Shoot me an e-mail @ ben@bubbli.co","time":1296492746,"type":"comment"},{"by":"gsiener","id":2161515,"parent":2161360,"text":"Hi all.  I curate the NYC StartupDigest Jobs list -- email me if you'd like to see your posting included.","time":1296484359,"type":"comment"},{"by":"20thr","id":2162288,"parent":2161360,"text":"Blaast is building a cloud-powered mobile OS, designed around web technology. We're disrupting the medium by building a platform that offers a native-like user experience: our apps are beautiful, fast and always up to date. We get there by leveraging our cloud platform to offer features that you don't see in today's mobile devices.<p>Our product has stirred the interest of a few big players and we're close to land our product into the hands of millions of users. We are a team of 15 young guys from around the world, based in Helsinki, Finland, and funded by experienced guys including the co-founders of Skype.<p>We are looking for brilliant software engineers that are looking to work into new disruptive technology. Our platform is based on Java and Javascript (node.js).<p>To apply ping us at jobs@blaast.com.","time":1296494453,"type":"comment"},{"by":"nfriedly","id":2161716,"parent":2161360,"text":"Sociable Labs is hiring several positions including sysadmins, front-end developers, and back-end developers.<p>I work on the front end, we do a lot of cross-domain ajax and work with the FaceBook JS SDK. I'm looking for at least one more front-end developer who knows JS inside and out. Experience with FB's new JS SDK is, obviously, a benefit.<p>Our back-end is Java / Jetty / PostgreSQL running on Amazon EC2.<p>We do basically a more advanced version of Facebook's Social Plugins for a number of large websites.<p>We're located in the San Francisco area. Remote work is an option; I work remote from Ohio right now.<p>Everyone works from home on Fridays, and the office is generally a pretty fun place every time I've been out to visit.<p><a href=\"http://www.sociablelabs.com/\" rel=\"nofollow\">http://www.sociablelabs.com/</a><p>Contact nathan @ above website if you're interested.","time":1296487575,"type":"comment"},{"by":"hyyypr","id":2162095,"parent":2161360,"text":"Location: Paris, France.<p>A stealth Mode well-funded startup writing highly disruptive Internet software is looking for :<p>A C++/Web Application security developer.<p>Ensuring that security risks are known/evaluated and that prevention techniques are identified, implemented and applied.<p>An UI/UX designer<p>Developing creative UI solutions for large scale C++ and Web applications.<p>A MacOS X, Cocoa, C++ Qt developer<p>porting our applications (Desktop and Web browser plugins) \nto the Mac OS X.<p>email me at jobs&#60;at&#62;kwift&#60;dot&#62;com","time":1296491969,"type":"comment"},{"by":"vide0star","id":2163759,"parent":2161360,"text":"Smarkets in London: <a href=\"http://smarkets.com\" rel=\"nofollow\">http://smarkets.com</a><p>Real-time trading platform. Python frontend, Erlang backend.<p>Smarkets is one of the Wall Street Journal’s Top 10 Tech Startups to watch in Europe and was shortlisted for the Startups Awards.","time":1296518425,"type":"comment"},{"by":"phillytom","id":2162330,"parent":2161360,"text":"Conshohocken, PA (outside of Philadelphia)<p>Monetate - jobs.monetate.com<p>SaaS provider of testing, targeting, and personalization tools for online retail stores.<p>Open Positions:\n * backend engineers -  work on data and web problems at scale in Python.<p>* front-end developers - build and test experiments on our client facing UI. You should be experienced in working with production-quality cross-browser HTML/CSS and Javascript with and without frameworks.<p>We're small, profitable, and growing fast while still having fun (happy hours, free lunch everyday, group cycling, running). We've hired people through these postings (3 now!) and look forward to interviewing fellow HNers.<p>Feel free to email me any questions - tjanofsky monetate com","time":1296495060,"type":"comment"},{"by":"cristinacordova","id":2162446,"parent":2161360,"text":"PULSE - Downtown Palo Alto, CA (across the street from Caltrain) - We build Pulse News an awesome newsreader for iPhone, iPad and Android. \nWebsite: <a href=\"http://www.alphonsolabs.com/jobs\" rel=\"nofollow\">http://www.alphonsolabs.com/jobs</a><p>We're hiring iOS engineers. We would love for you to come by and get to know our 7 person team. You will have a large amount of control and impact and have an extremely engaged user base to answer to! Shoot us an email at jobs@alphonsolabs.com<p>iOS - Ideally, you have already developed and launched an app in the store. You prototype features rapidly and iterate on design even more rapidly – while writing clean code.","time":1296496634,"type":"comment"},{"by":"svec","id":2161610,"kids":[2161780],"parent":2161360,"text":"Boston, MA; not remote.<p>Ember has a couple of openings for firmware/embedded and manufacturing engineers: <a href=\"http://www.ember.com/company_careers.html\" rel=\"nofollow\">http://www.ember.com/company_careers.html</a><p>We make low power wireless chips and the software that makes them useful.<p>Ember is a <i>fantastic</i> place to work, email me directly at emberFeb2011@saidsvec.com if you're interested.","time":1296486004,"type":"comment"},{"by":"trunnell","id":2163113,"kids":[2163129],"parent":2161360,"text":"Netflix has many open positions in Los Gatos, CA.<p><a href=\"http://www.netflix.com/Jobs\" rel=\"nofollow\">http://www.netflix.com/Jobs</a><p>HTML5, javascript, iOS, Android, Silverlight, Security Architect,  J2EE, QA and more.  See the jobs page for the full list and hit the link to apply.<p>There is a startup-driven culture at Netflix that rewards risk-taking and high performance.  It's a great place to push the bleeding edge,  whether you build client software (lots of A/B behavioral testing) or server software (as one of the larger users of AWS, we're breaking new ground all the time).  Come help invent the future of movie and TV watching.","time":1296506995,"type":"comment"},{"by":"thinkcomp","id":2162007,"parent":2161360,"text":"Palo Alto, CA - Think Computer Corporation<p>We run the FaceCash (<a href=\"http://www.facecash.com\" rel=\"nofollow\">http://www.facecash.com</a>) mobile payment system, which is being deployed nationwide. We have apps on iPhone, Android, and BlackBerry, and we're always looking for top people to help out. Merchants love us because we're cheaper (and we give them a free POS system), and consumers love the integrated coupons. Apply on our corporate site at:<p><a href=\"http://www.thinkcomputer.com/corporate/jobs/index.html\" rel=\"nofollow\">http://www.thinkcomputer.com/corporate/jobs/index.html</a><p>or e-mail me at aarong at thinkcomputer.com.","time":1296490949,"type":"comment"},{"by":"SpikeGronim","id":2162670,"parent":2161360,"text":"Wavii is hiring in Seattle, WA.<p>We need frontend developers to work on a rapidly iterating consumer facing website.<p>We are also hiring backend developers interested in natural language processing and the infrastructure needed to support large scale data processing.<p>TechCrunch coverage:<p><a href=\"http://techcrunch.com/2010/07/21/time-to-meet-wavii-the-super-stealth-super-awesome-startup-based-in-seattle/\" rel=\"nofollow\">http://techcrunch.com/2010/07/21/time-to-meet-wavii-the-supe...</a><p><a href=\"http://techcrunch.com/2011/01/17/wavii-waviimania-investors/\" rel=\"nofollow\">http://techcrunch.com/2011/01/17/wavii-waviimania-investors/</a><p>jobs@wavii.com","time":1296499964,"type":"comment"},{"by":"takrupp","id":2161639,"parent":2161360,"text":"Los Angeles, CA - Quant Trading Firm - Not remote, must be authorized to work in the US.<p>One of my clients is looking for a network programmer.  The developer will be responsible for low level, low latency feed handlers (from market data providers) and in improving/developing drivers for their distributed computing infrastructure.<p>Position is very competitive, but no former financial knowledge or experience needed.  Must know C++ and socket (TCP/UDP) programming very well.  They will look at junior to senior people, and can pay very well.<p>Email trent.krupp@constitutionllp.com for more info.","time":1296486416,"type":"comment"},{"by":"mace","id":2162562,"parent":2161360,"text":"MochMedia (San Francisco, CA) - <a href=\"http://www.mochimedia.com/jobs/\" rel=\"nofollow\">http://www.mochimedia.com/jobs/</a><p>Mochi is hiring engineers (Python, Javascript and Erlang). We bulid highly distributed and reliable systems to help independent game developers distribute and monetize over 30,000 casual games across the web.<p>We also love open source and have contributed back to the community with simplejson, mochiweb, mochikit and other projects.<p>Benefits/perks:<p>- Competitive Salary, Robust Medical Benefits &#38; 401k<p>- 20% Mochi Labs R&#38;D Time<p>- Equity in Shanda Games Limited (NASDAQ: GAME)<p>- Catered Family Style Lunches 2x Per Week<p>- $3,000 Education Budget","time":1296498280,"type":"comment"},{"by":"david927","id":2161534,"parent":2161360,"text":"Kongoroo.com is offering a Business Development co-founder role.<p>(About us, quickly: Kongoroo is the front-page of the web for kids.  Parents submit sites, which are vetted and filtered for age and interests, and popularity bubbles sites to the top.)<p>The site still has work to do but we should still make the soft launch date at the end of February.  We need help to execute this right.  If you're interested or experience in Bus. Dev. please contact me at the email in my profile. We prefer if you're from the SF Bay Area, but we're open to other locations.","time":1296484670,"type":"comment"},{"by":"christyyyjoy","id":2162333,"parent":2161360,"text":"San Diego, CA - StockTwits<p>We're looking for a Senior Ruby Developer to join the team in Coronado: <a href=\"http://stocktwits.com/jobs#rd\" rel=\"nofollow\">http://stocktwits.com/jobs#rd</a><p>---------------------------------------------<p>New York, NY - Apartment Therapy<p>They haven't posted a job description yet, but I'm leaving my front-end developer/web designer position, so they'll be hiring soon. Email me at cgurga@gmail.com if you want me to send along the job posting once it's up =) Local is preferred (I'm leaving because I took a job with StockTwits now that I live in California).","time":1296495124,"type":"comment"},{"by":"wmoxam","id":2162192,"parent":2161360,"text":"Savvica - Toronto, ON (must be on site)<p>We're looking for a Design Lead and a Senior Developer (<a href=\"http://savvica.com/jobs\" rel=\"nofollow\">http://savvica.com/jobs</a>)<p>We are India’s leading educational marketing and recruitment services company. We work with universities and colleges primarily in the US, Canada, UK and India to recruit Indian students for their programs. Savvica operates learnhub.com, studyplaces.com, and jumbotest.com, reaching more Indian students than any other education-focused sites in India.","time":1296493322,"type":"comment"},{"by":"tocomment","id":2161631,"parent":2161360,"text":"Gaithersburg, MD - A payment processing software company I used to work for is hiring an internal applications developer. You'd be working with Python<i>, SQL Server</i>, IIS and other technologies to automate internal processes.<p>They'd prefer someone local but working remotely might be ok.<p>They're open to hiring anywhere from entry level to senior.  It's the type of job where either role would work.<p>Email me (in profile)<p>* As long as you can demonstrate some programming skill, and resourcefulness, they're happy to train you in Python, and SQL Server.","time":1296486357,"type":"comment"},{"by":"jdfreefly","id":2162263,"parent":2161360,"text":"Successfactors (Redwood City, CA)<p>Formerly cubetree.com.  Recently acquired by SuccessFactors.  We're no longer a startup but we still have that startup feel.  We push code on a weekly basis and we've got a very strong, talented and well connected team.<p>We work in ROR with a mysql backend and CSS and Javascript on the front.  We're building a secure and global social platform for businesses.<p>If you're interested send me your resume (john@cubetree.com) and a brief description about what kind of a position you're looking for.","time":1296494083,"type":"comment"},{"deleted":true,"id":2161510,"parent":2161360,"time":1296484288,"type":"comment"},{"by":"rbxbx","id":2161682,"kids":[2162742,2162434,2162435],"parent":2161360,"text":"We're hiring at Hashrocket.<p><a href=\"http://hashrocket.com/jobs\" rel=\"nofollow\">http://hashrocket.com/jobs</a><p>Ruby, Agile, Pair Programming (all the time!), open source time, benefits, a team of super smart and quite enjoyable people to be around, and a pretty office at the beach to boot.<p>We're also open to apprentices/internships, if you're interested feel free to email jobs@hashrocket.com and if you have any questions you can contact me personally robert@hashrocket.com or @rbxbx on twitter.<p>Cheers :)","time":1296487066,"type":"comment"},{"by":"jack7890","id":2162069,"kids":[2162130],"parent":2161360,"text":"New York, NY<p>SeatGeek - Data-driven search for event tickets<p>Looking for a frontend developer (Javascript/HTML/CSS) to have complete ownership over that part of our web app.  An eye for design and Photoshop skills are a plus.<p>On-site only.  Drop me a line if you're interested: jack@seatgeek.com","time":1296491617,"type":"comment"},{"by":"joelbirchler","id":2162684,"parent":2161360,"text":"DECK Monitoring (Eugene, Portland) is looking for senior Ruby and JavaScript developers. We do renewable energy monitoring software.<p>You should rock at: JavaScript, Ruby, Rails 2, HTML/CSS, MySQL, RSpec and testing, version control, basic math.\nIt'd be cool if you knew: haml/sass, git, jQuery, linux (Debian), ActionScript 3, Cucumber, Rails 3, Sinatra, foosball, agile/scrum/xp<p>Email your resume or a short intro to careers@deckmonitoring.com.","time":1296500274,"type":"comment"},{"by":"yume","id":2163933,"parent":2161360,"text":"Redwood City, CA - YuMe is hiring (www.yume)\nA full list of our job openings is on our web site:\n<a href=\"http://www.yume.com/content/open-positions\" rel=\"nofollow\">http://www.yume.com/content/open-positions</a><p>Technical Openings in our Redwood City HQ:<p>* Principal Software Engineer<p>* Senior Data Analytics Engineer<p>* Senior Database Engineer<p>* Senior Software Engineer -  Ad Management System<p>* Senior Systems Administrator (Windows)<p>* Senior Systems Engineer (Linux)<p>About YuMe:<p>YuMe is a video advertising technology company that makes professional video profitable for publishers and effective for advertisers. Its robust ACE™ technology powers both its premium ad network and its industry leading advertising management platform solution, ACE for Publishers. YuMe’s premium ad network aggregates the best in video content, representing over 600+ Premium publishers including MSN, NBC and Fox News. And with more than 1.6 billion video streams and 90 million unique viewers, YuMe serves over 30 million in-stream video ads per day. As a result, YuMe gives publishers and advertisers unprecedented reach, brand safety, contextual relevance, controlled syndication, and consistent delivery across all digital media platforms–Web, downloads, mobile, and IPTV.  YuMe is a privately held company headquartered in Redwood City, CA and backed by Accel Partners, BV Capital, DAG Ventures, Khosla Ventures and Menlo Ventures.  This is a rare opportunity to be part of an organization that is shaping the future of digital media!<p>For more information, visit www.yume.com, follow @yumevideo on twitter (www.twitter.com/yumevideo), or become a fan of YuMe on Facebook at www.facebook.com/yumevideo.","time":1296522021,"type":"comment"},{"by":"drusenko","id":2162851,"parent":2161360,"text":"Weebly (San Francisco, CA)<p>We're looking for 2 front-end developers. There's a puzzle at <a href=\"http://www.weebly.com/jobs.html\" rel=\"nofollow\">http://www.weebly.com/jobs.html</a> -- see if you can solve it under 30 minutes<p>(Remote is not a possibility)","time":1296502617,"type":"comment"},{"by":"JonM","id":2161594,"parent":2161360,"text":"Leeds, UK (no remote) - Pitch Hero Limited<p>Sports website with 1MM+ UVs/month, looking for frontend designer / developer. £30k+ and possible stock options.<p><a href=\"http://www.pitchero.com/jobs/\" rel=\"nofollow\">http://www.pitchero.com/jobs/</a>","time":1296485777,"type":"comment"},{"by":"subelsky","id":2163098,"parent":2161360,"text":"A buddy of mine is hiring PHP/Drupal folks in Maryland:<p>el <a href=\"http://www.unleashed-technologies.com/about-us/resumes/mid-level-developer\" rel=\"nofollow\">http://www.unleashed-technologies.com/about-us/resumes/mid-l...</a><p><a href=\"http://www.unleashed-technologies.com/about-us/resumes/developer-internship\" rel=\"nofollow\">http://www.unleashed-technologies.com/about-us/resumes/devel...</a>","time":1296506846,"type":"comment"},{"by":"qixxiq","id":2161460,"kids":[2161487],"parent":2161360,"text":"Cape Town, South Africa (no remote) -- SnapBill<p>It seems there are a few South Africans around this site so giving it a shot. We're a small growing startup in the recurring billing space that just launched last week (www.snapbill.com).<p>We've got big plans and are pushing to get a lot into the system as soon as possible but need a little bit of help. Shoot me an email if you're interested.","time":1296483333,"type":"comment"},{"by":"drallison","id":2164200,"parent":2161360,"text":"Maxeler Technologies (<a href=\"http://www.maxeler.com\" rel=\"nofollow\">http://www.maxeler.com</a>) is hiring for Palo Alto, CA and London, England. (no remote)<p>Application acceleration engineers to work with client applications to deliver order of magnitude speedups. You'll be involved in every stage of accelerating applications, from analyzing multi-million line code bases through developing new algorithms, to implementing complete solutions running on FPGA, GPU, or other technologies.<p>You will need a degree or equivalent professional qualification in Computer Science or a related discipline as well as experience in some of the following:\n » High performance software development in C/C++ or FORTRAN.\n » Program analysis and transformation\n » Compiler design and implementation\n » Computer architecture / digital circuit design.\n » Working with scientific software code in HPC application \ndomains such as computational finance, seismic processing, life sciences or fluid dynamics.","time":1296528417,"type":"comment"},{"by":"h3h","id":2162306,"parent":2161360,"text":"Austin, Texas / On-site only / Gowalla Incorporated<p>A fun company with interesting problems, stellar designers and an unrelenting focus on great user experience. We're looking for an iOS developer, Ruby developers, an operations engineer and a BlackBerry developer.<p>I moved to Austin last year to join Gowalla and I love both.<p><a href=\"http://gowalla.com/jobs\" rel=\"nofollow\">http://gowalla.com/jobs</a>","time":1296494744,"type":"comment"},{"by":"curtischambers","id":2162498,"parent":2161360,"text":"Uber (San Francisco, CA)<p>We're hiring engineers for all kinds of roles, including mobile development (iOS, Android), infrastructure (node.js and Python), as well as engineering-oriented data analysts (we've got LOTS of data to mine).  Extra points if you can do all of the above.<p>More info here:  <a href=\"http://www.uber.com/jobs\" rel=\"nofollow\">http://www.uber.com/jobs</a>","time":1296497311,"type":"comment"},{"by":"tungwaiyip","id":2162845,"kids":[2172200,2203437],"parent":2161360,"text":"Kontagent (San Francisco, CA)<p>We are looking for developers and sales:<p><a href=\"http://www.kontagent.com/jobs/\" rel=\"nofollow\">http://www.kontagent.com/jobs/</a><p>I've joined the startup a few weeks ago as a developer. We are pursuing multiple initiatives and I excited to start contributing right away. Our technology stack includes JavaScript, Python, Django, MySQL, data warehousing, etc. Free group lunch is served daily.<p>Remote a possibility for top notch people. Some developers comes in San Francisco every few weeks or every few months.<p>Kontagent measures people, not pages, and is a leading analytics platform for social application developers. The platform has been built to provide deep social behavior analysis and visualization that provides actionable insights via a hosted, on-demand service. It works with many of the world’s largest developers and brands, tracking thousands of social applications and games with over 70 million monthly active users.","time":1296502553,"type":"comment"},{"by":"aschobel","id":2162323,"parent":2161360,"text":"Catch.com (San Francisco)<p>We are looking for hackers to join our team in SOMA. We have a bunch of ex-Metaweb and Googlers hacking on:<p><pre><code>  * Android / iOS\n  * JS (Google Closure)\n  * Python (Pylons)and MongoDB.\n</code></pre>\nWe have a crazy amount of users on Android. =)<p><a href=\"https://catch.com/jobs\" rel=\"nofollow\">https://catch.com/jobs</a>","time":1296494984,"type":"comment"},{"by":"beermann","id":2162616,"parent":2161360,"text":"StudyBlue (Madison, WI) is hiring for the following positions:<p>Marketing Manager<p>Front End Web Developer<p>Senior Applications Developer<p>iPhone Developer<p>Android Developer<p>Network Operations Director<p>QA Engineer<p>We're a funded startup out in the midwest (they do exist) building educational tools for high school and college students.<p>For more info: <a href=\"http://company.studyblue.com/about/jobs/\" rel=\"nofollow\">http://company.studyblue.com/about/jobs/</a>","time":1296499091,"type":"comment"},{"by":"nethergoat","id":2162047,"kids":[2162544],"parent":2161360,"text":"EA2D - Redwood Shores, CA (SF Bay Area)<p><a href=\"http://www.ea2d.com\" rel=\"nofollow\">http://www.ea2d.com</a><p>We're a small, autonomous studio within EA building social games for gamers.  Our first monetized title, Dragon Age Legends, is about to enter closed beta and has been generating a lot of buzz (<a href=\"http://pc.ign.com/articles/114/1146553p1.html\" rel=\"nofollow\">http://pc.ign.com/articles/114/1146553p1.html</a>).<p>Our Platform team is looking for mid to (very) senior engineers. You would be responsible for building the platform on which all EA2D games will run, from the pages that serve the HTML to the suite of game servers supporting them.  Analytics, social network integration, shared services (REST), scaling, real-time stateful and stateless game servers -- this would all be your domain.<p>Our stack is primarily Java with MongoDB on the backend, but we're becoming increasingly polyglot (Python, Ruby) in the middle tier.  We're hosted on EC2 (w/auto-scaling and on-demand environments) and practice continuous deployment.  A sampling of the tech we use: Chef, git (GitHub), Hudson (now Jenkins?), ant, ivy, SQS, S3, EMR, Loggly, PagerDuty, Mixpanel, Kontagent, NginX, Tomcat, Hive, and Google App Engine.  We contribute code back to the open source projects we use, and we've even started open sourcing our own (<a href=\"https://github.com/EA2D\" rel=\"nofollow\">https://github.com/EA2D</a>).<p>The Platform team is small and young -we're still building out the initial implementations of many services- so you would have a tremendous impact on our architecture and direction.<p>We're a tight-knit team with lots of whiteboards, so you'd need to be on-site.  On the plus side, EA's campus is fantastic - we have a stellar gym, cafeteria, theater, shuttle service to Caltrain, soccer field, volleyball and basketball courts, tournament-quality foosball tables, and much more.<p>Drop me a line if you're interested, mikeb@ea2d.com<p>We've already hired two people from previous HN \"Who's Hiring?\" threads, so you'd be in good company!","time":1296491483,"type":"comment"},{"by":"mattyfo","id":2162010,"parent":2161360,"text":"Baltimore, MD<p>We're global ad agency working on some cool digital projects. We could use another solid front-end developer. Drop me an email at matthew.forr -at- eurorscg.com","time":1296490991,"type":"comment"},{"by":"MediaSquirrel","id":2162318,"parent":2161360,"text":"SpeakerText (San Francisco)<p>SpeakerText is hiring Rails developers (employee #2) to work out of our new office overlooking Market Street in downtown SF (no remote work, sorry). We sell \"transcription in the cloud\" powered by a hybrid of AI &#38; crowdsourced labor, with a heavy focus on video.<p>Upcoming projects:<p>-Scaling<p>-Scaling<p>-Scaling<p>-Improving our autonomous QA system<p>Responsibilities:<p>30% RoR development<p>30% Front end coding (HTML/CSS/jQuery)<p>30% Backend Server Management (EC2, Apache, Linux)<p>10% Plotting world domination with the founders<p>Compensation includes a competitive salary, healthcare, and stock options.<p>CTO’s note: If you want lots of structure and a product manager telling you exactly what to do &#38; how to do it, this is not the job for you. If you’re a technical badass and know you want to start your own company one day, this job is perfect.<p>More info: <a href=\"http://speakertext.com/jobs/rails_hacker\" rel=\"nofollow\">http://speakertext.com/jobs/rails_hacker</a>","time":1296494877,"type":"comment"},{"by":"ericsilver","id":2162242,"parent":2161360,"text":"Pittsburgh, PA (no remote) <a href=\"http://pikimal.com/jobs\" rel=\"nofollow\">http://pikimal.com/jobs</a>\nWe're looking for Semantic Web and Ruby Developers but if you're a strong developer who doesn't know Ruby yet that's no obstacle. We have extremely flexible hours, collaborative coder DNA, good tools, a strong team to work with, and great health care.<p>Pikimal is working to change how people use the web to make decisions. Once users tell us what's important to them, we can tell them what's best for them. Since all of our recommendations are based solely on facts, users receive results separate from marketing.<p>Please include a link to public code you've written or your Github repo when you apply. Feel free to reach out directly to my first name @pikimal.com","time":1296493861,"type":"comment"},{"by":"cogg","id":2161706,"parent":2161360,"text":"Santa Monica, CA (next to the beach) - TrueCar/Zag - not remote<p>Profitable company still in startup phase: doubling revenue every year and need to scale like crazy.<p>Looking for full-time Rails, Django and Java (Spring) developers. Also looking for System Engineers (must be able to script).<p>leaderswanted@zag.com","time":1296487402,"type":"comment"},{"by":"dctanner","id":2162617,"parent":2161360,"text":"Remote from US timezone or onsite at London (UK) office.<p>Pusher - <a href=\"http://pusherapp.com/\" rel=\"nofollow\">http://pusherapp.com/</a><p>We're doing awesome stuff with Websockets to provide realtime browser push as a service. People with ace Ruby skills and a keen interest in realtime messaging should drop us a line (jobs@)<p>Panda - <a href=\"http://www.pandastream.com/\" rel=\"nofollow\">http://www.pandastream.com/</a><p>Cloud video encoding service. Checkout <a href=\"http://jobs.github.com/positions/64dc8f0c-23e1-11e0-97e7-85d62e2c96a2\" rel=\"nofollow\">http://jobs.github.com/positions/64dc8f0c-23e1-11e0-97e7-85d...</a> for more info.<p>Contact me if you have any questions or are interested: damien@pusherapp.com/pandastream.com","time":1296499095,"type":"comment"},{"by":"BBonifield","id":2161787,"kids":[2163182,2162558],"parent":2161360,"text":"Anything in the Boulder or Austin area?","time":1296488642,"type":"comment"},{"by":"alchemyapi","id":2161676,"parent":2161360,"text":"AlchemyAPI (Denver, CO) is hiring C++ developers, front-end developers, and a community manager.<p>We do natural language processing, artificial intelligence, and semantic web stuff.  Growing rapidly, profitable, w/ an amazing team.  Our platform uses semantic technology to analyze hundreds of millions of documents monthly for customers across multiple industry verticals.<p><a href=\"http://www.alchemyapi.com/company/jobs.html\" rel=\"nofollow\">http://www.alchemyapi.com/company/jobs.html</a><p>Highly creative work environment employing big data analysis, advanced AI research, and fun 20% time projects (Kinect-powered 3d visualization apps, mobile OCR+NLP tech, robots, etc).","time":1296486971,"type":"comment"},{"by":"azeemansar","id":2162001,"kids":[2162326],"parent":2161360,"text":"New York City, NY - IAC Mobile (<a href=\"http://www.iac.com\" rel=\"nofollow\">http://www.iac.com</a>)<p>We're hiring a few iOS and backend software engineers to work on new mobile ventures in a very startup-y environment.<p>Email me for more info: azeem.ansar@iac.com","time":1296490758,"type":"comment"},{"by":"dshah","id":2162161,"parent":2161360,"text":"Cambridge, MA (sorry, no remote)<p>HubSpot is hiring web developers (Java/Python/PHP)<p>We're also paying $10,000 as a referral bonus if you help us find an awesome developer.  Details at <a href=\"http://BostonBattle.com\" rel=\"nofollow\">http://BostonBattle.com</a>","time":1296492881,"type":"comment"},{"by":"amduser29","id":2162170,"parent":2161360,"text":"Life360 - San Francisco, CA (Local Preferred)<p>We are building the next generation of family safety and security apps.  We are currently focused on a suite of location-based apps, but we have a lot of cool things in the pipeline.  We are absolutely blowing up right now in terms of user adoption and we could really use your help to scale out the business.  Our only real requirement is that you are a wickedly smart hacker.<p>There is an awesome referral bonus for all of our open jobs (Android, iOS, and PHP).<p>See more at our jobs page:\n<a href=\"http://life360.jobscore.com/list\" rel=\"nofollow\">http://life360.jobscore.com/list</a><p>Or, contact me directly:\nalex@life360.com<p>Cheers!","time":1296492942,"type":"comment"},{"by":"MarkSWeiss","id":2166374,"parent":2161360,"text":"Magnetic is a NYC online ad startup using search to target display advertising anywhere on the Web.<p>- Great mix of hard problems: low-latency serving, big data crunching, semantic analysis, elegant customer UI.<p>- Great mix of technologies: Ruby, Rails, MongoDB, Hadoop.<p>- Great team, including leading NYC Rubyist and technical founder with DoubleClick and Yahoo! pedigree.<p>- Perfect time to join: small engineering team, ownership of major parts of system, second-phase startup successful so far and building for next phase of growth.<p>- Competitive salary, excellent benefits, options. Perks include great views, pool table, after-hours beer and plenty of snacks.","time":1296581774,"type":"comment"},{"by":"levonjlloyd","id":2162347,"parent":2161360,"text":"Location: Long Island, NY\nCompany: Silverline\nRemote: No\nDescription: We are starting a new company using Hadoop and related technologies to improve data infrastructure at large financial institutions.  We already have a flagship client funding the development and are looking for talented developers with experience building Hadoop based systems.  This is an excellent opportunity for an entrepreneurial  developer to get in on the ground floor of this new company!!.\nIf you have any quetions or are interested, drop me an email:\nlevon@generalsentiment.com","time":1296495286,"type":"comment"},{"by":"will_critchlow","id":2161498,"kids":[2161589],"parent":2161360,"text":"London, UK (no remote) -- Distilled<p><a href=\"http://www.distilled.co.uk/blog/distilled/introduce-awesome-win-a-helicopter/\" rel=\"nofollow\">http://www.distilled.co.uk/blog/distilled/introduce-awesome-...</a><p>Apply:\n<a href=\"http://www.distilled.co.uk/company/jobs/search-consultants.html\" rel=\"nofollow\">http://www.distilled.co.uk/company/jobs/search-consultants.h...</a><p>We are hiring SEOs (the good kind). If you want to help our clients <i></i>deserve<i></i> to rank better, come work with us.<p>If you know someone, refer them and win a frickin' quadricopter!<p>[If you are in Seattle, WA, there's a good chance we'd like to speak to you too...].","time":1296484024,"type":"comment"},{"by":"lcm133","id":2163280,"parent":2161360,"text":"Sawbuck.com is seeking to hire front-end (html, css, js) and back-end (c#, xml, sql) engineers. Full details here:\n<a href=\"http://www.sawbuck.com/about/jobs\" rel=\"nofollow\">http://www.sawbuck.com/about/jobs</a><p>These jobs are located in Washington DC. If you are a stud front-end designer/coder, working remotely IS a possibility.<p>VC-backed and growing real estate website with a just-released iPhone app:<a href=\"http://www.sawbuck.com/iphone\" rel=\"nofollow\">http://www.sawbuck.com/iphone</a><p>If you are interested, email me directly if you'd like... lmintzer at sawbuck dot com","time":1296509834,"type":"comment"},{"by":"andrewwatts","id":2162767,"kids":[2163145],"parent":2161360,"text":"TrueCar (Santa Monica, CA)<p>We're looking for back-end and front-end engineers.<p>Most open positions are for Python and Django developers looking to help us build out new features on our website, create apis and scale them.  We also have RoR positions in Santa Monica and San Francisco, as well as front-end Javascript positions.<p>Benefits include: exciting work environment with competitive salaries, full medical, dental and vision coverage and 401K.  Relocation is available on a case-by-case basis.<p><a href=\"http://www.truecar.com/hiring.html\" rel=\"nofollow\">http://www.truecar.com/hiring.html</a>","time":1296501581,"type":"comment"},{"by":"thibauld_","id":2161684,"parent":2161360,"text":"<a href=\"http://allmyapps.com\" rel=\"nofollow\">http://allmyapps.com</a> is looking for a VP of Marketing in the San Francisco Bay Area.\nNot sure a lot of marketing guys hang out there but who knows...  let's say that if someone responds here, I'll take it as a good point :)\nAllmyapps is the first independent application store for Windows. Job desc can be found here: \n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1332191\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1332191</a>","time":1296487116,"type":"comment"},{"by":"blacksmythe","id":2166145,"parent":2161360,"text":"Calient Networks (no remote, should be willing to relocate to Santa Barbara CA) www.calient.net<p>Hiring for several positions.<p>1. Software Engineer: Deliver fast-track software solutions for Tier 1 Data Center Customers and Telco Equipment Partners, beginning from product definition, development, and validation through deployment.<p><pre><code>  The successful candidate should be capable of developing real-time embedded \n  software including implementation and integration.\n\n   - 5+ years in designing and developing embedded software development using \n  embedded operating systemS (RTOS / embedded Linux)\n\n  - Experience with SNMP would be useful\n\n  - Experience with high availability systems would be very helpful\n</code></pre>\n2. DSP Software Engineer<p><pre><code>  - Develop and test control of MEMS with an embedded\n      PowerPC or DSP processor.\n\n  - Work closely with hardware engineers\n</code></pre>\n- Familiar working with embedded Linux<p><pre><code>  - Should understand resonance frequency, Fourier transforms,\n\t    and have some understanding of control theory.\n</code></pre>\n3. Manufacturing Software Engineer<p><pre><code>  - Apply machine learning to manufacturing automation of complex system.\n\n    Presently manufacturing data interpretation requires a highly intelligent person.\n\tThe software needs to perform diagnostics to allow an average person\n\tto manage the manufacturing process.\n\n  - Must have a passion for manufacturing in volume</code></pre>","time":1296578752,"type":"comment"},{"by":"earthaid","id":2179741,"parent":2161360,"text":"Earth Aid - <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>\nOpenings in San Francisco, Washington D.C., Providence &#38; Cambridge<p>Looking for rails developers to change the world!<p>Knowledge &#38; Experience<p><pre><code>    * You have a love of computers, software engineering, architecture design, and application development.\n    * You consider solving computer science and engineering problems your craft, and are always seeking to hone your skills.\n    * You are mathematical in your approach to problems and are highly analytical.\n    * You are independent and driven. You will be given areas to manage and lead, and need to be able to do it without close supervision.\n    * You have at least 2 years of professional experience in software development.\n    * You have demonstrated success in a deadline driven environment.\n    * You have interest in energy efficiency (working experience in this area is a plus).\n    * You have strong interpersonal, communication, and facilitation skills.\n</code></pre>\nTechnologies Used<p><pre><code>    * Languages: Ruby, JRuby, Java\n    * Database: SQL, MySQL\n    * Operations: Amazon EC2/ELB, Heroku\n    * MVC Frameworks: Rails/Django\n    * Source Control: Git/SVN\n    * Gems/Libraries: Devise, Celerity\n    * Testing: RSpec, Factory Girl, Cucumber\n</code></pre>\nTools Used<p><pre><code>    * Application IDEs / Editing Tools: Textmate, Netbeans\n    * Social Network Platforms: Facebook, Twitter\n    * Cloud-Computing Management Systems: AWS Tools\n    * Source Management: Github</code></pre>","time":1296833820,"type":"comment"},{"by":"rancar2","id":2161734,"parent":2161360,"text":"Architecting and implementing custom solutions for ECM and BPM products from EMC, IBM, Pegasystems, and others at Fortune 500 companies.<p>Main offices are DC, NYC, and Boston with remote possibilities for the right candidate. Absolutely great place to work:<p><a href=\"http://triteksol.com/careers.html\" rel=\"nofollow\">http://triteksol.com/careers.html</a><p>The things you need to possess most are: intelligence, sociable, and a person of good character with a preference to those who are just plain nice.<p>If you have questions, contact me at rcarlton at triteksol.com","time":1296487918,"type":"comment"},{"by":"ashearer","id":2162156,"parent":2161360,"text":"Waltham, MA and Providence, RI. Some non-remote time desired.<p>We're an early-stage healthcare startup seeking web application developers (Python/Django) and UI/UX design talent.<p>Contact: Andrew.Shearer, at myrozi.com.","time":1296492823,"type":"comment"},{"by":"mtsmith85","id":2171786,"parent":2161360,"text":"New York, NY<p>Thrillist - We're a leading men's lifestyle newsletter.<p>We're looking for a jQuery developer who's also an experienced PSD-chopping, HTML-cleaning, CSS guru to write clean, lightweight code and keep our pages SEO-friendly. You'll be owning the frontend of our site, and helping us to make it lean and mean. This position reports directly to the Director of Technology.<p>Requirements:\n - Minimum 2+ years of experience doing front-end work for a web-based business or web-focused agency\n - Minimum 2 years experience with Javascript/jQuery/Prototype/etc\n - Able to hand-code efficient tableless CSS layouts\n - Up-to-date understanding of SEO best practices\n - Strong dedication to cross-browser and cross-platform compatibility\n - Capable in Photoshop<p>Nice-to-haves:\n - Familiarity with the pitfalls of HTML email design a huge plus\n - Git or SVN knowledge\n - Flash skills a bonus\n - Knowledge of Drupal theming a plus<p>We've got a bunch of fun applications in development. You'll work hard, and you'll learn a lot. Compensation commensurate with experience.<p>*Candidates MUST be available to work from our offices in Soho, NYC (though we're flexible about telecommuting a few days a week). No offshore/remote (sorry). Principals only, no recruiters please.<p>Join up: send resume and cover blurb with salary requirements to techjobs@thrillist.com with 'Interface Developer' in the subject line.<p>Read more: <a href=\"http://www.thrillist.com/jobs/#interface_developer\" rel=\"nofollow\">http://www.thrillist.com/jobs/#interface_developer</a>","time":1296676091,"type":"comment"},{"by":"imoawesome","id":2162902,"parent":2161360,"text":"imo is hiring!  Based in Palo Alto, CA, we are a small startup founded and funded by one of the first ten employees at Google. Our current team consists of top TopCoders, ACM ICPC World Finalists, and medalists of the International Olympiads in Informatics. We work on challenging projects that we choose from the ground up that have direct impact on our users. You can view all openings here: <a href=\"https://imo.im/jobs.html\" rel=\"nofollow\">https://imo.im/jobs.html</a>","time":1296503427,"type":"comment"},{"by":"sgrock","id":2163550,"parent":2161360,"text":"AboutUs.org in Portland, Oregon<p>We're building website analytics tools for small business owners and website operators:<p><a href=\"http://www.aboutus.org/careers\" rel=\"nofollow\">http://www.aboutus.org/careers</a>","time":1296514658,"type":"comment"},{"by":"wallacrw","id":2167003,"parent":2161360,"text":"San Francisco, CA (SoMa)<p>Early stage, well-funded web startup with SoMa office seeks talented developer as lead engineer. This is a core position; you will have a chance to influence every element of the company's technology, and you will receive a salary, options, and a desk in an office in SoMa.  Must be local.<p>We're keeping our business plan under wraps, but the gist is that we're building a platform that will help local and state governments raise new money from an existing public resource. Read the paper: the time is ripe for this idea, local governments are going bankrupt all over the country. They are desperate for new solutions (see Governor Brown's State of California speech last night), and we will offer them a solution that will raise millions at the local level.<p>If you like novel solutions to hard problems, saving the US from bankruptcy and working at a company with a massive profit potential and an incredibly well-connected advisory board and investor roster, then tell me what you can bring to the table:<p>wallacrw&#60;at&#62;yahoo.com.<p>Must have several years' experience building scalable web applications, with a preference for folks interested in auction theory. You'll have to demonstrate that you can take an idea and implement it from the ground up, and that you can work closely in a small team as a co-founder.","time":1296589441,"type":"comment"},{"by":"usaar333","id":2163094,"parent":2161360,"text":"PiCloud (San Francisco, CA) is hiring engineers, marketers, and salespeople.\n<a href=\"http://www.picloud.com/jobs/\" rel=\"nofollow\">http://www.picloud.com/jobs/</a><p>We're developing a cloud computing platform for general computation.  Engineers work with a variety programming languages (python, c/c++, java), distributed systems, and data stores.<p>We're a growing seed stage firm, so you'd be playing a large role in our company. Unfortunately, remote is not a possibility.","time":1296506770,"type":"comment"},{"by":"gobrien","id":2162943,"parent":2161360,"text":"YuMe is hiring in product, engineering, BD and sales.<p>Product and engineering openings are in Redwood City, CA and Chennai, India.  Remote not a possibility.<p>Sales and BD openings in Redwood City, New York City, LA, Chicago, and Seattle.<p>We're a profitable video advertising technology company backed by Accel Partners, BV Capital, DAG Ventures, Intel Capital, Khosla Ventures, and Menlo Ventures.<p><a href=\"http://www.yume.com/content/careers\" rel=\"nofollow\">http://www.yume.com/content/careers</a>.","time":1296504180,"type":"comment"},{"by":"joshuaxls","id":2161775,"parent":2161360,"text":"San Francisco — stealthy startup in SF hiring seasoned Ruby/Rails developers. Telecommuting is okay some of the time, but you must be able to come into our SoMa office regularly. We pay market salaries and give nice chunks of equity despite being well funded.<p>What are some of the perks? Well, we're spending this week in the Dominican Republic coding on the beach. Come join us on our next work trip! Contact the address in my profile.","time":1296488469,"type":"comment"},{"by":"jonshea","id":2163403,"parent":2161360,"text":"Foursquare (NYC, SF): <a href=\"http://foursquare.com/jobs/\" rel=\"nofollow\">http://foursquare.com/jobs/</a><p>We have positions coding for our mobile clients (iPhone, Android, BlackBerry) and our server team. Our server code is all in Scala (booyah functional programming). It’s a superb team in fun work environment, full of exciting projects, and with an amazing dataset.<p>Feel free to send me an email at the same username, or apply through the web page.","time":1296511614,"type":"comment"},{"by":"cal5k","id":2161664,"parent":2161360,"text":"Toronto, ON - Myplanet<p>We're hiring for practically everything - and we really need to add some great developers to our team. We're a fun place to work and we've been on a pretty ridiculous growth clip over the last two years.<p>Check out our blog post with the job descriptions here:<p><a href=\"http://www.myplanetdigital.com/digital_strategy/blog/myplanet-hiring-billion-people\" rel=\"nofollow\">http://www.myplanetdigital.com/digital_strategy/blog/myplane...</a>","time":1296486792,"type":"comment"},{"by":"macov","id":2161825,"kids":[2162041,2162274],"parent":2161360,"text":"Nobody in VA, DC? Feds pay too much to start a company?","time":1296489015,"type":"comment"},{"by":"bharatvasan","id":2169797,"parent":2161360,"text":"Basis (mybasis.com) - Health/Fitness Startup in San Francisco<p>We are a team of alums from places like Google, Microsoft, EA and NASA building a product to improve the health and quality of people's lives. We're looking for smart, seasoned people who want to build interesting stuff, solve large problems and save the world :-) So, ping us at jobs@mybasis.com if you're local to the Bay Area (no remotes pls).<p>A couple of roles we're looking for:<p>PHP (Zend) Lead (<a href=\"http://bit.ly/eB7dVK\" rel=\"nofollow\">http://bit.ly/eB7dVK</a>) -- Design, implement, and maintain major portions of the server architecture and data visualization apps. Create and maintain the various APIs used by BASIS’s web and mobile applications.<p>Native App (Win/OS X) Developer (<a href=\"http://bit.ly/dE2N0g\" rel=\"nofollow\">http://bit.ly/dE2N0g</a>) -- Develop a critical component of our infrastructure -- the native application (Windows 7, Vista, XP and OS X) that talks to our USB/Bluetooth-connected device and our web back-end. Evolve the drivers, SDK and APIs that enable our team and 3rd party developers to access data from our platform.<p>What we can offer:<p>- awesomeness all around, on team and product<p>- an early stage opportunity where you can exercise your creative muscles without big company politics<p>- competitive compensation, early-stage stock and the stability of a venture-backed company<p>- a unique gizmo (the Basis Band) that no one else has and all sorts of cool office perks that make you happy<p>If you care about building a product that can improve the health of millions millions and analyzing the world’s single largest repository of vital signs, we want you.<p>Ping us at jobs@mybasis.com!","time":1296643994,"type":"comment"},{"by":"jbenz","id":2162303,"parent":2161360,"text":"eRetailing (Columbus, Ohio) (Sorry, no remote)<p>This is actually not a technical position but a marketing post.  Specifically, we need someone who will get their hands dirty in Google Adwords and Analytics on a daily basis.  See more here:<p><a href=\"http://www.techlifeohio.com/blogs/open-position\" rel=\"nofollow\">http://www.techlifeohio.com/blogs/open-position</a><p>Find links to our sites here:<p><a href=\"http://eretailing.com/\" rel=\"nofollow\">http://eretailing.com/</a>","time":1296494717,"type":"comment"},{"by":"tarvaina","id":2163111,"parent":2161360,"text":"Leonidas (Tampere, Finland) is looking for passionate programmers. No remote unless you convince us otherwise.<p>We are serial entrepreneurs for hire. A client gives us one week and a vision, and we try to create as much magnificence as we can in that time. And then if it's feasible and the client wants us to, we take it all the way to a finished product.<p><a href=\"http://leonidasoy.fi/\" rel=\"nofollow\">http://leonidasoy.fi/</a>","time":1296506988,"type":"comment"},{"by":"goatforce5","id":2161776,"kids":[2162901],"parent":2161360,"text":"Avid Life Media - Toronto, ON<p><a href=\"http://www.avidlifemedia.com/careers.html\" rel=\"nofollow\">http://www.avidlifemedia.com/careers.html</a><p>Ruby devs, designers, customer support and accountants.<p>For you rubyists: Interested in hearing from you regardless of whether you meet our requirements in the above Senior Ruby Developer position. We have a 'junior'(/intermediate/whatever) role open too. On-site only. jamie.wilson@avidlifemedia.com","time":1296488471,"type":"comment"},{"by":"chrismjohnson","id":2164501,"parent":2161360,"text":"CollegeHumor (New York, NY - no remote) is looking for both Front-End and Back-End developers.  <a href=\"http://www.chmedia.com/jobs\" rel=\"nofollow\">http://www.chmedia.com/jobs</a><p>Work on challenging problems and have a good laugh while doing it. Our sites reach over 12 million users every month and we're growing.<p>If interested, apply at the above link. Questions? Shoot me an email chris.johnson@connectedventures.com.","time":1296536887,"type":"comment"},{"by":"jjolma","id":2162409,"parent":2161360,"text":"Animoto is hiring in New York, San Francisco and remote.  Animoto is a video creation platform that automatically produces stunning music videos using images, video clips, and music.<p>We are hiring for multiple roles including software engineers, testers, product managers.<p><a href=\"http://animoto.com/blog/category/company/jobs/\" rel=\"nofollow\">http://animoto.com/blog/category/company/jobs/</a><p>Email devjobs at animoto for more details.","time":1296496077,"type":"comment"},{"by":"xyzzyb","id":2162157,"parent":2161360,"text":"Bandwidth.com / Broadband.com - Cary, NC (no remote)<p>We're hiring for quite a few positions: <a href=\"http://bandwidth.com/about/join/careers.html\" rel=\"nofollow\">http://bandwidth.com/about/join/careers.html</a><p>Everything from web programming to tech support to billing to sales.<p>I started with the company as a web programmer a little more than two months ago. Great so far: nice people, great work environment, fun atmosphere.","time":1296492825,"type":"comment"},{"by":"seanb","id":2180430,"parent":2161360,"text":"St Cloud, MN (An hour west of Minneapolis)\nNo remote, unfortunately.<p>eBureau  (<a href=\"http://www.ebureau.com\" rel=\"nofollow\">http://www.ebureau.com</a>, <a href=\"http://www.apple.com/business/profiles/ebureau/\" rel=\"nofollow\">http://www.apple.com/business/profiles/ebureau/</a>)<p>We're looking for a (junior) programmer.  Must be comfortable on a unix-like OS (we use OS X and FreeBSD), and able to take on projects involving C, C++, Objective-C, PHP and SQL.  You'd be part of a small group of developers, and have a lot of independence.  We use git and SVN.<p>Email me (seanbillig@ the URL above) links to code you've written in any language if available, eg. github, bitbucket, personal website, etc, and we'll have an informal chat.  Attach a resume and cover letter for HR.<p>We're also looking for a mid-level account manager/sales support person.  Brief HR description: Account Manager - Finance is a mid-level position. It requires a B.S. in finance or accounting, strong analytical skills, and work experience in a similar role.  Send resumes to jobs at ebureau.com","time":1296843117,"type":"comment"},{"by":"apike","id":2162805,"parent":2161360,"text":"Steam Clock Software (Vancouver, BC).<p>We're hiring a generalist as person #3 for our iOS app development shop. We need someone who can do awesome visual design for iOS as well as pick up some programming as needed. Currently we're profitable doing 1/2 App Store products and 1/2 contracting work, moving to mostly product sales in the future.<p>Interested in going for a beer? Email allen at steamclocksw.com.","time":1296501889,"type":"comment"},{"by":"GavinB","id":2162166,"parent":2161360,"text":"New York City - must be on-site.<p>A little bit of game design, a little bit of project management, a little bit of community management--a lot of fun. No programming required, but familiarity with web and game development is a plus. Interest in games, especially RPGs and puzzlers, is a must.<p>Full time freelance in NYC for an established book publishing company. It's fairly entry level.<p>gbrown at scholastic dot com","time":1296492906,"type":"comment"},{"by":"ruff","id":2161536,"parent":2161360,"text":"Location Labs (<a href=\"http://www.locationlabs.com/jobs.php\" rel=\"nofollow\">http://www.locationlabs.com/jobs.php</a>)<p>Emeryville, CA (super short/BART ride from SF--No remotes)<p>Back-end devs (Python, Java, Ruby), Front-end devs (JavaScript, CSS, HTML5), Mobile devs (Android, iPhone, Blackberry, BREW), Product Managers, UX Designers<p>And more... Company is growing very rapidly in an incredibly exciting space.","time":1296484733,"type":"comment"},{"by":"spradels","id":2163571,"parent":2161360,"text":"Cyan (Petaluma, CA)<p><a href=\"http://www.cyanoptics.com/company/careers\" rel=\"nofollow\">http://www.cyanoptics.com/company/careers</a><p>email:  jobs@cyanoptics.com<p>We have openings for software developers in Petaluma, Vancouver, Dallas, and options for remote work.<p>You’ll have the opportunity to work with Python, Django, Cassandra, RabbitMQ, Google Web Toolkit (GWT), HTML5, and WebGL on small team in a fast-paced environment.","time":1296515088,"type":"comment"},{"by":"martharotter","id":2168659,"parent":2161360,"text":"Nomad Editions - New York (sorry remote not an option for this role)<p><a href=\"http://readnomad.com\" rel=\"nofollow\">http://readnomad.com</a><p>Developer for Digital Magazine Startup<p>Nomad Editions, a startup creating digital weeklies for mobile devices, is looking for an awesome web-standards focused HTML/CSS/JS developer to help build our content on top of Treesaver (treesaver.net), one of the most exciting new open source frameworks for digital news and magazine publishing.<p>The developer will be responsible for taking wireframes and translating them into standards-compliant web pages in Treesaver.<p>We're seeking: \n- Expertise in standards-based web development with HTML/CSS/JS\n- Experience with source control (Git or SVN)\n- Ideal candidate would also have design skills\n- Interest in working with a very exciting company doing something no one else in the digital publishing industry is doing: making digital content look amazing everywhere<p>If you're interested or have questions, please e-mail Martha Rotter at mrotter@readnomad.com","time":1296614496,"type":"comment"},{"by":"_mattb","id":2166541,"parent":2161360,"text":"Redwood Systems -- Fremont, CA (sorry, no remote)  <a href=\"http://redwoodsystems.com\" rel=\"nofollow\">http://redwoodsystems.com</a><p>We're a 50 person startup that makes an LED lighting controller and sensor system for commercial buildings.  Our system saves a lot of energy and we get a ton of sensor information that's lately been leading to some interesting analyses and visualizations..  We're putting physical systems on the web and it's pretty exciting!  There are Engineering openings in our UI, Embedded C++, Test, and Sales Applications groups <a href=\"http://redwoodsystems.com/about-us/careers\" rel=\"nofollow\">http://redwoodsystems.com/about-us/careers</a>.  We're also looking for summer interns if you're still in school (contact me directly).<p>I'm relatively new and it's an awesome time to work here.  We have big name clients in the valley and we're constantly working with them to make a better product.","time":1296584305,"type":"comment"},{"by":"petervandijck","id":2167630,"parent":2161360,"text":"Developers in Montreal.<p>Hiring developers in Montreal. Full-time job with benefits, we pay well, and you get to work on startup-y projects (ie. agile, small teams, etc.) You get lots of freedom, ownership (projects are starting from scratch, no legacy projects here) and little corporate crap.<p>Specifically looking for:<p>- Javascript person: you should be really good at javascript, jquery etc. You'll be writing from scratch a gmail-like browser app (simpler though), using something like Sammy js, accessing data from a json backend api. When applying, show me something you've done in this spirit.<p>- Windows, Mac developers. You'll write a Dropbox-like app that runs on Windows and/or Mac. (It's pretty different from Dropbox but that's the closest I found.) Make sure it doesn't crash or slow down the computer. Make it Just Work. Show me something you've done when applying.<p>You must be located in Montreal. Contact info in my account info.","time":1296597763,"type":"comment"},{"by":"flignats","id":2182257,"parent":2161360,"text":"SF Bay Area\nSkillAddiction is seeking its first CTO!<p>SkillAddiction hosts skill gaming tournaments where players compete for cash and prizes.  We've been online since 2009 and growing strongly in the skill gaming sector.  We've awarded over $300,000 in cash and prizes to our players and hosted over 750,000 skill gaming tournaments.<p>We're expanding our team for the first time and looking for an All-Star developer ready to make an impact on thousands of active users.  Our brand is currently being re-imagined (not the service, just the look and feel), revenues are growing, and our industry is hot!  Anyone interested, please get in touch with us directly - jobs@skilladdiction.com OR<p>Take a look at our job post over at StartupHire  - <a href=\"http://www.startuphire.com/job/chief-technology-officer-117038\" rel=\"nofollow\">http://www.startuphire.com/job/chief-technology-officer-1170...</a>","time":1296873193,"type":"comment"},{"by":"GavinB","id":2162297,"parent":2161360,"text":"New York City or remote.<p>We need a flash game developer--someone who can take an idea like \"parachuting onto an island\" or \"cracking a safe\" and work with us to turn it into a clever game. Close enough to NYC to work on-site or pop in for meetings would be great, but we would also consider remote workers.<p>gbrown at scholastic dot com","time":1296494587,"type":"comment"},{"by":"Titanous","id":2161712,"kids":[2162949],"parent":2161360,"text":"Ottawa, ON - Shopify<p><a href=\"http://www.shopify.com/careers\" rel=\"nofollow\">http://www.shopify.com/careers</a><p>We're hiring for a ton of positions including Developer Advocate and Software Engineer (Core, Data, QA, Tools, UI).<p>We have a great work environment, love open source, and are profitable and growing really fast (fastest in Ottawa, in fact).","time":1296487461,"type":"comment"},{"by":"jbr","id":2163916,"parent":2161360,"text":"IA Ventures is looking for an unpaid VC intern in NYC.  I'm not affiliated with them, but I thought it was a cool opportunity.<p><a href=\"https://spreadsheets1.google.com/viewform?formkey=dHVKUzBYYk8xdG04cXVVYWlWU3l5OXc6MA&#38;ifq\" rel=\"nofollow\">https://spreadsheets1.google.com/viewform?formkey=dHVKUzBYYk...</a>","time":1296521821,"type":"comment"},{"by":"tomh","id":2161888,"parent":2161360,"text":"Waltham, MA - no remote<p>Akaza Research, makers of OpenClinica, are hiring senior QA and sales positions: <a href=\"https://openclinica.com/openclinica-careers\" rel=\"nofollow\">https://openclinica.com/openclinica-careers</a><p>Go ahead and send me a message at thickerson at akazaresearch.com if you have questions about the company.","time":1296489650,"type":"comment"},{"by":"greenie","id":2161633,"parent":2161360,"text":"We're hiring! If you're interested in web developement and semantic anaylsis (and you live in the UK!) then take a quick look at:\n<a href=\"http://idioplatform.com/2011/01/rockstar-developers-wanted/\" rel=\"nofollow\">http://idioplatform.com/2011/01/rockstar-developers-wanted/</a><p>P.S. we have AR.Drones :)","time":1296486375,"type":"comment"},{"by":"wangthony","id":2168049,"parent":2161360,"text":"Tobi (South San Francisco, CA + Portland, OR; no remote)<p>Tobi [<a href=\"http://www.tobi.com\" rel=\"nofollow\">http://www.tobi.com</a>] is an online fashion boutique headquartered in the SF area.  We have a small but strong core team, and are looking to add more talented engineers who want to build the next generation online fashion shopping experience.  We view ourselves as an Internet product + technology company that happens to do fashion, and our team and strategy reflect that.  Our stack is Ruby on Rails and Postgres, but we don't require previous RoR experience (none of us had it when we started, so that wouldn't be fair, now would it?).<p>If you are interested in solving interesting tech problems in a fun space with great visibility, then get in touch with me at anthony@tobi.com.  Thanks HN!","time":1296603695,"type":"comment"},{"by":"shadchnev","id":2169703,"parent":2161360,"text":"Forward Internet Group in London, UK: <a href=\"http://www.forward.co.uk\" rel=\"nofollow\">http://www.forward.co.uk</a><p>We're a young entrepreneurial company that bootstrapped its way from its founder bedroom to a 150-strong company with very healthy profits in 6 years without any external capital.<p>We are behind uswitch.com, getinvisiblehand.com, omio.com, justcages.co.uk, petvillas.co.uk, forward3d.co.uk etc.\nYou can take a look at who we are and what we do at <a href=\"http://www.forwardtechnology.co.uk\" rel=\"nofollow\">http://www.forwardtechnology.co.uk</a>.<p>One of our guys created statefulapp.com during the recent Rails Rumble (been on the frontpage of HN), many others contribute to open source.<p>We have been doubling our revenues every single year (up to £118m in 2010) and plan to continue to expand. So, we need great people!<p>We're looking for great developers (and many other roles too) to work on a variety of exciting online projects. We use Clojure, Ruby, Hadoop, Node.js, Sinatra etc.<p>Above all we're looking for smart, ambitious, entrepreneurial people. Full job spec is here: <a href=\"http://www.forward.co.uk/careers\" rel=\"nofollow\">http://www.forward.co.uk/careers</a> or here: <a href=\"http://www.forwardtechnology.co.uk/\" rel=\"nofollow\">http://www.forwardtechnology.co.uk/</a><p>And it's fun to work here: you choose the hardware you want, you buy the books you need, the hours are flexible, no dress code, free classes (language, music and even poker), the people are reasonable and the entertainment budget is generous: for example the entire company hangs out in Las Vegas night clubs and casinos for 4 days every December and we've recently returned from Disneyland in Paris (birthday celebrations).<p>To find out more email me at evgeny.shadchnev@forward.co.uk with your CV.<p>p.s. sorry, all our devs are on-site, we don't hire remote devs. Also, given the recent changes to the immigration laws in the UK, it will be very challenging (maybe even impossible) for us to arrange a visa unless you're an EU national or already have a work permit.","time":1296640647,"type":"comment"},{"by":"srehnborg","id":2161913,"parent":2161360,"text":"Bandwidth.com/Phonebooth.com - Raleigh/Cary, NC  No remote work.<p>Senior Web and Database Programmer<p>System Admin<p>Web Developer - Phonebooth Mobile<p>QA Engineer - Phonebooth.com<p>Technical Support Engineer - Phonebooth.com<p>Details at:\n<a href=\"http://bandwidth.com/about/join/careers.html\" rel=\"nofollow\">http://bandwidth.com/about/join/careers.html</a><p>Contact me with any questions.  Email in profile","time":1296489851,"type":"comment"},{"by":"thesash","id":2162964,"parent":2161360,"text":"InTheMO (Los Angeles, New York)<p>Come work with us on solving the problem of local discovery.<p>We're hiring for a variety of positions including web and mobile developers, biz dev, and designers.<p><a href=\"http://www.inthemo.com/homepage/careers.aspx\" rel=\"nofollow\">http://www.inthemo.com/homepage/careers.aspx</a>","time":1296504536,"type":"comment"},{"by":"cameldrv","id":2163033,"parent":2161360,"text":"Kammeyer Development is looking for iOS, Android, and Java developers to help us work on transforming physician to physician communication.  Must be local to Austin, TX, and we will start on an hourly contract basis.  Contact kammeyer at kammeyer.org.","time":1296505674,"type":"comment"},{"by":"texodus","id":2161944,"kids":[2162766],"parent":2161360,"text":"Benchmark - NYC Financial Analytics<p>Looking for excellent developers of all shapes &#38; sizes;  we work in Ruby, JS, Scala, C, Java, Matlab primarily but have a vast landscape of software projects in the works.  Drop me a line at andrew.stein@benchmarksolutions.com","time":1296490145,"type":"comment"},{"by":"davidmat","id":2161987,"kids":[2167320],"parent":2161360,"text":"Long shot, but anything in Central/Eastern Europe?","time":1296490588,"type":"comment"},{"by":"dawson","id":2170219,"parent":2161360,"text":"Cambridge Healthcare, Cambridge, UK (remote considered)<p>We are a healthcare start-up, creating a unique and innovative healthcare application framework and marketplace. We are working in partnership with the NHS and will pilot regionally, then deploy nationally.<p>We're looking for a CTO and or Senior Engineer, who thinks that a Ruby/Rails 3 and Amazon RDS stack with AMQP and Distributed Memory Caching is cool, but not enough.<p>Competitive salary and employee stock options.<p>For more information please don't hesitate to get in contact, email and Skype in profile. The sites are <a href=\"http://nhs.info\" rel=\"nofollow\">http://nhs.info</a> and <a href=\"http://about.nhs.info\" rel=\"nofollow\">http://about.nhs.info</a>","time":1296654935,"type":"comment"},{"by":"bluelu","id":2161842,"parent":2161360,"text":"Luxembourg, Europe<p>Trendiction -  Collecting and parsing web data (message boards, blog posts, comments).  Searching for 2 more java developers. No remote work.<p><a href=\"http://blog.trendiction.com/tag/joboffer\" rel=\"nofollow\">http://blog.trendiction.com/tag/joboffer</a>","time":1296489211,"type":"comment"},{"by":"jasoncartwright","id":2162637,"parent":2161360,"text":"Potato (London,UK)<p>Hiring Python, Django web developers in London, UK. Clients include Google and PayPal.<p><a href=\"http://www.potatolondon.com/people/jobs/python-web-developer-london/\" rel=\"nofollow\">http://www.potatolondon.com/people/jobs/python-web-developer...</a>","time":1296499389,"type":"comment"},{"by":"semerda","id":2163303,"parent":2161360,"text":"Coupons, Inc. (Mountain View)<p>I'm looking for brilliant and innovative \"Front End Engineer\" and \"Senior Software Engineer\".<p>Create world-class software tools and help build the platform for our cutting-edge online consumer coupons product.<p>Email me: esemerda_AT_couponsinc_DOT_com","time":1296510248,"type":"comment"},{"by":"doorty","id":2161529,"kids":[2162811,2162229,2161720,2162302,2162619,2162915],"parent":2161360,"text":"Who is hiring in San Francisco?","time":1296484592,"type":"comment"},{"by":"eprice","id":2163594,"parent":2161360,"text":"Web developer, Walker Art Center (Minneapolis, MN; not remote)<p>Looking for a creative and committed problem solver to help develop our new website and maintain multiple existing sites.<p>Django/Python, Linux administration, Apache, MySQL, HTML5, jQuery, etc...<p>jobs@walkerart.org","time":1296515528,"type":"comment"},{"by":"philjr","id":2172865,"parent":2161360,"text":"Pleasanton, CA (East Bay)<p>Dublin, Ireland<p>Workday - ERP space - Hiring Infrastructure / Systems Engineers<p>Working on some interesting problem sets, with large groups of data and some very progressive Java technology. All Linux (CentOS) based, we're really looking for some talented people to help out on the Linux side of things. We're kinda looking for Linux or general *nix whizzes with production experience and with a broad range of skills.<p>We're interested in a candidates with appropiate visa / working permits in either Ireland or the US and are willing to relocate the right candidate(s) (no remote)<p>Email me - philip dot reynolds at workday dot com for more info!","time":1296691824,"type":"comment"},{"by":"kyleslattery","id":2162693,"parent":2161360,"text":"Viddler (Bethlehem, PA, remote works too)<p>We're looking for a Rails developer. We're growing pretty quickly, so we need some extra hands to help build out new products and services. Email jobs@viddler.com if you're interested.","time":1296500435,"type":"comment"},{"by":"mentat","id":2163307,"parent":2161360,"text":"Mocana (San Francisco, CA)<p>Interested in embedded security? Have C / Network / RTOS skills? Mocana is hiring into a variety of positions.<p><a href=\"http://www.mocana.com/careers.html\" rel=\"nofollow\">http://www.mocana.com/careers.html</a>","time":1296510271,"type":"comment"},{"by":"poolhouse","id":2162601,"parent":2161360,"text":"Poolhouse Enterprises (Toronto) is hiring a Web Developer.  Front end, CSS, HTML, Javascript, PHP and knowledge of the Facebook APIs a plus.<p><a href=\"http://www.poolhouse.ca\" rel=\"nofollow\">http://www.poolhouse.ca</a>","time":1296498820,"type":"comment"},{"by":"marcelcorso","id":2161937,"parent":2161360,"text":"Amsterdam - The Netherlands\n<a href=\"http://shuffler.fm\" rel=\"nofollow\">http://shuffler.fm</a><p>We are looking for a full time dev. That wants to code ruby, python, javascript. We are a small music startup.<p>email: marcel at tone dot fm","time":1296490051,"type":"comment"},{"by":"kevindication","id":2161746,"kids":[2162466],"parent":2161360,"text":"Looks like we've got quite a few positions open: <a href=\"http://www.woti.com/jobs.cfm\" rel=\"nofollow\">http://www.woti.com/jobs.cfm</a><p>Feel free to ping me if you want to know if you're likely to be a good fit.","time":1296488141,"type":"comment"},{"by":"sandipagr","id":2163254,"parent":2161360,"text":"We, TriTek Solutions (triteksol.com), are looking for lot of programmers/consultants. You can chose between DC and NYC.<p>Contact me at sagrawal@triteksol.com. New grads are especially welcome.","time":1296509464,"type":"comment"},{"by":"trefn","id":2162899,"kids":[2163096],"parent":2161360,"text":"Mixpanel (San Francisco, CA)<p>We're looking for frontend engineers, a designer, and backend/data engineers.<p>We're also hiring interns!<p><a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a>","time":1296503406,"type":"comment"},{"by":"reedlaw","id":2163132,"parent":2161360,"text":"Research Triangle Park, NC (or remote, anywhere) - <a href=\"http://www.smashingboxes.com/\" rel=\"nofollow\">http://www.smashingboxes.com/</a><p>Work with me and a few others building and maitaining Ruby on Rails applications. We are a small firm doing mostly client work from big projects to small in a variety of fields from academic to fitness. Looking for full-time remote workers or college interns.<p>Contact me at reed at smashingboxes dot com.","time":1296507344,"type":"comment"},{"by":"ilamparithi","id":2165504,"parent":2161360,"text":"Chennai. India (On-site)<p>We are Valued Epistemics Pvt Ltd.  (<a href=\"http://www.vepl.com\" rel=\"nofollow\">http://www.vepl.com</a>), providers of <a href=\"http://www.GREedge.com\" rel=\"nofollow\">http://www.GREedge.com</a> an online academy that provides training for the GRE exam.<p>For more details, have a look at our careers page at : <a href=\"http://www.vepl.com/careers-rd.html\" rel=\"nofollow\">http://www.vepl.com/careers-rd.html</a>","time":1296569523,"type":"comment"},{"by":"adellecharles","id":2162481,"parent":2161360,"text":"Carbon Ads - Remote - Front End Web Developer\n<a href=\"http://jobs.37signals.com/jobs/7990\" rel=\"nofollow\">http://jobs.37signals.com/jobs/7990</a>","time":1296497088,"type":"comment"},{"by":"notJim","id":2162295,"parent":2161360,"text":"New York City, ThinkEco<p>We're looking for engineers (software, front-end, electrical) to help work on our user-friendly energy-saving technology. Currently, all of our software is on the .Net (4.0) platform.<p>For more details, see our jobs page: <a href=\"http://thinkecoinc.com/careers.aspx\" rel=\"nofollow\">http://thinkecoinc.com/careers.aspx</a>. You can email me directly at david % thinkecoinc ' com","time":1296494570,"type":"comment"},{"by":"n9com","id":2161685,"parent":2161360,"text":"iOS/Mac Developer (Remote Possible, but London preferred)\n£30k plus possible stock options<p>We're a profitable &#38; fast growing mobile app startup. 2 hires this month already. Well known in London / mainstream press exposure / our apps are adding 500k to 1M new users each month.<p><a href=\"http://www.fiplab.com/aboutus/careers/\" rel=\"nofollow\">http://www.fiplab.com/aboutus/careers/</a>","time":1296487119,"type":"comment"},{"by":"billpaetzke","id":2162178,"parent":2161360,"text":"Leads360 - El Segundo, CA<p>Looking for software engineers who know: C# and SQL Server. Knowledge of other web technologies is nice, too.<p>bpaetzke@leads360.com","time":1296493109,"type":"comment"},{"by":"CptMauli","id":2205859,"parent":2161360,"text":"TH4 Systems, Munich, Germany (remote work is unfortunately not possible)<p>We develop tank farm management software and more.<p>We are looking for a versatile individual with a strong Java background. If you have any background in automation that would be a big plus (but it is no requirement).<p>You can drop me a line at juergen dot rose at th4-systems dot com","time":1297420772,"type":"comment"},{"by":"niyazpk","id":2188259,"parent":2161360,"text":"Bangalore, India (Sorry, no remote).<p>We are a well funded ecommerce Startup. We already have an experienced team working on the technology side.<p>We are looking for good Java and PHP programmers.<p>Here are some interesting problems in this space:\n- Scaling\n- Data Mining/Retrieval\n- Analytics<p>Please get in touch and I will convince you to join us :)<p>(Freshers and interns are welcome too).","time":1297068702,"type":"comment"},{"by":"witten","id":2182652,"parent":2161360,"text":"Seattle, WA<p>EnergySavvy - We make energy efficiency easy for homeowners. We're passionate about doing it with well-designed, accurate and easy to use software.<p>We're hiring back-end and front-end web developers. We use Python and Django.<p><a href=\"http://www.energysavvy.com/jobs/\" rel=\"nofollow\">http://www.energysavvy.com/jobs/</a><p>Absolutely no robots.","time":1296889737,"type":"comment"},{"by":"dustingetz","id":2161666,"parent":2161360,"text":"Blue Bell, PA (greater Philadelphia)<p>Full stack web engineer<p>Small team, technical leadership, enterprise clients, family-oriented workplace<p>dgetz@wingspan.com","time":1296486802,"type":"comment"},{"by":"mprny","id":2162449,"parent":2161360,"text":"Tinychat - New York City.<p>Looking for website lead engineer: nginx,apache,php,mysql,perl,memcache.<p>jobs@tinychat.com","time":1296496651,"type":"comment"},{"by":"kreem","id":2179761,"parent":2161360,"text":"Nelnet Business Solutions - Lincolnshire, IL is hiring entry-level Java web developers.<p>See <a href=\"http://www.nelnetbusinesssolutions.com/\" rel=\"nofollow\">http://www.nelnetbusinesssolutions.com/</a>.","time":1296834184,"type":"comment"},{"by":"jqhacker","id":2165400,"parent":2161360,"text":"WOTI (Washington, DC; on site)<p>Ours is a small team of 3 in a company of about 150, on a small but involved ground-up project that's just starting to take on beta users.  It's a web app that pulls together data from many sources and presents an easy-to-navigate graphical summary.  We use mostly Python (2.7) in a Unix environment.  On the back end, we munge a few TB of data using Python, Hadoop and Pig, and some in-house distributed Unix tools.  The processed data goes into Solr/Lucene, is served up by CherryPy and Genshi, and presented by jQuery in IE7, IE8, Firefox 3.5+ and some COTS viz software.  A lot of the job is extracting the juicy bits from various data sources -- e.g., personnel databases and news articles -- then normalizing, aggregating, and indexing it.  The challenge is that it's way too much data for a single system, so we need to parallelize the process on dozens of systems.  We also need to think about how the data is organized to keep search and retrieval fast.  And of course you want an intuitive, powerful front end for all that functionality.<p>A bit about the work environment: we heart open source.  We have nice dual-monitor workstations running RHEL 5 with root; you're free to set up your dev environment how you like (as long as it's secure).  You can be as back-end or front-end as you like, or mix it up.  We all try to do a bit of everything. We have proper sysadmins to help, but end up doing a lot of the server and network configuration ourselves; that way we get it right, plus we kinda like it.  We take security seriously.  Mercurial for version control; Jira for project management; just starting with Scrum for process.  You get a real office with a real window, shared with one person.  The job is a government contract, but in a fairly agile R&#38;D environment (though a startup it ain't).<p>Eight-hour days with a half hour for lunch, whatever hours work for you as long as you're in between 10-3.  Overtime is very rare; no comp time.  There's a basic but serviceable gym and a good walking loop.  It's South of the beltway on the Maryland side, a short commute with no traffic from Alexandria, Arlington, Suitland, or Southeast D.C.  Unfortunately there is no public transportation that comes this way.  Occasional local travel.  Pay is about average for the area.  Benefits and vacation are pretty good.  There are opportunities to move to other projects within the company if you get bored with this one.  And if this particular job ain't your cuppa but you like what you hear generally, drop us a resume anyway; we have several locations in the metro area and are always looking for good people.<p><a href=\"http://woti.com/jobs.cfm\" rel=\"nofollow\">http://woti.com/jobs.cfm</a> (The \"Scripting Genius\" posting)","time":1296566944,"type":"comment"},{"dead":true,"deleted":true,"id":2162124,"parent":2161360,"time":1296492403,"type":"comment"},{"by":"spudlyo","dead":true,"id":2162697,"parent":2161360,"text":"Blue Gecko - Seattle, WA (remote from anywhere)<p><a href=\"http://www.bluegecko.net\" rel=\"nofollow\">http://www.bluegecko.net</a><p>Blue Gecko is a remote DBA services company.  We're looking for intermediate to expert MySQL or PostgreSQL DBAs. Although our headquarters is in Seattle, many of our DBAs work at home full time, and our corporate culture is configured to accommodate remote workers. Since we operate 24/7 we need folks in every timezone.<p>Drop me a line if you're interested, my email address is in my profile.","time":1296500473,"type":"comment"},{"by":"phlux","id":2194059,"parent":2161360,"text":"<a href=\"http://startupdigest.com/classifieds/\" rel=\"nofollow\">http://startupdigest.com/classifieds/</a><p><a href=\"http://www.quora.com/jobs\" rel=\"nofollow\">http://www.quora.com/jobs</a><p><a href=\"http://www.eventbrite.com/jobs/\" rel=\"nofollow\">http://www.eventbrite.com/jobs/</a><p><a href=\"http://foursquare.com/jobs\" rel=\"nofollow\">http://foursquare.com/jobs</a><p><a href=\"https://www.airbnb.com/jobs\" rel=\"nofollow\">https://www.airbnb.com/jobs</a><p><a href=\"http://www.cloudera.com/company/careers\" rel=\"nofollow\">http://www.cloudera.com/company/careers</a><p><a href=\"http://www.squareup.com/\" rel=\"nofollow\">http://www.squareup.com/</a><p><a href=\"http://exchange.causes.com/jobs\" rel=\"nofollow\">http://exchange.causes.com/jobs</a><p><a href=\"http://www.quora.com/Union-Square-Ventures\" rel=\"nofollow\">http://www.quora.com/Union-Square-Ventures</a><p><a href=\"http://www.indeed.com/jobs?q=company:%28adaptiveblue+OR+10Gen+OR+oddcast+OR+AMEE+OR+Boxee+OR+BugLabs+OR+Clickable+OR+Covestor+OR+Disqus+OR+Twilio+OR+Etsy+OR+Flurry+OR+Foursquare+OR+HeyZap+OR+Indeed+OR+Infongen+OR+Meetup+OR+Oddcast+OR+%22outside.in%22+OR+%22Bug+Labs%22+OR+pinchmedia+OR+%22pinch+media%22+OR+%22Return+Path%22+OR+Simulmedia+OR+%22Stack+Overflow%22+OR+StackOverflow+OR+Targetspot+OR+Tracked+OR+Twitter+OR+Tumblr+OR+Wesabe+OR+%22Work+Market%22+OR+Zemanta+OR+Zynga%29&#38;l=california\" rel=\"nofollow\">http://www.indeed.com/jobs?q=company:%28adaptiveblue+OR+10Ge...</a><p><a href=\"http://tastylabs.com/\" rel=\"nofollow\">http://tastylabs.com/</a><p><a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a><p><a href=\"http://j.mp/vrvjbs\" rel=\"nofollow\">http://j.mp/vrvjbs</a><p><a href=\"http://www.appmakr.com/hiring\" rel=\"nofollow\">http://www.appmakr.com/hiring</a><p><a href=\"http://www.stumbleupon.com/jobs\" rel=\"nofollow\">http://www.stumbleupon.com/jobs</a><p><a href=\"http://www.path.com/jobs\" rel=\"nofollow\">http://www.path.com/jobs</a><p><a href=\"http://www.inkling.com/jobs/\" rel=\"nofollow\">http://www.inkling.com/jobs/</a><p><a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p><a href=\"http://www.meebo.com/jobs/openings/\" rel=\"nofollow\">http://www.meebo.com/jobs/openings/</a><p><a href=\"http://bloomreach.com/careers\" rel=\"nofollow\">http://bloomreach.com/careers</a><p><a href=\"http://tellapart.com/who_we_are/\" rel=\"nofollow\">http://tellapart.com/who_we_are/</a><p><a href=\"http://www.topprospect.com/jobs/50\" rel=\"nofollow\">http://www.topprospect.com/jobs/50</a><p><a href=\"http://www.kiva.org/jobs\" rel=\"nofollow\">http://www.kiva.org/jobs</a><p><a href=\"http://expensify.com/jobs\" rel=\"nofollow\">http://expensify.com/jobs</a><p><a href=\"http://www.twilio.com/company/jobs\" rel=\"nofollow\">http://www.twilio.com/company/jobs</a><p><a href=\"http://www.uberapp.com/jobs\" rel=\"nofollow\">http://www.uberapp.com/jobs</a><p><a href=\"http://www.campfirelabs.com/jobs\" rel=\"nofollow\">http://www.campfirelabs.com/jobs</a><p><a href=\"http://plancast.com/jobs\" rel=\"nofollow\">http://plancast.com/jobs</a><p><a href=\"http://www.kabam.com/jobs.php\" rel=\"nofollow\">http://www.kabam.com/jobs.php</a><p><a href=\"http://twitter.com/positions.html\" rel=\"nofollow\">http://twitter.com/positions.html</a><p><a href=\"http://gdgt.com/jobs/\" rel=\"nofollow\">http://gdgt.com/jobs/</a><p><a href=\"http://1000memories.com/jobs\" rel=\"nofollow\">http://1000memories.com/jobs</a><p><a href=\"http://evernote.theresumator.com/apply\" rel=\"nofollow\">http://evernote.theresumator.com/apply</a><p><a href=\"http://www.rethinkdb.com/jobs\" rel=\"nofollow\">http://www.rethinkdb.com/jobs</a><p><a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a><p><a href=\"http://milo.com/jobs\" rel=\"nofollow\">http://milo.com/jobs</a><p><a href=\"http://shopkick.com/jobs.html\" rel=\"nofollow\">http://shopkick.com/jobs.html</a><p><a href=\"http://www.surveymonkey.com/jobs/Home_Jobs.aspx\" rel=\"nofollow\">http://www.surveymonkey.com/jobs/Home_Jobs.aspx</a><p><a href=\"http://www.samasource.org/about/samacareers\" rel=\"nofollow\">http://www.samasource.org/about/samacareers</a>:<p>Jobs@roost.com<p><a href=\"http://branchout.com/about/jobs#st\" rel=\"nofollow\">http://branchout.com/about/jobs#st</a><p><a href=\"http://altiused.com/careers\" rel=\"nofollow\">http://altiused.com/careers</a><p><a href=\"http://www.infoaxe.com/infoaxehiring.html\" rel=\"nofollow\">http://www.infoaxe.com/infoaxehiring.html</a><p><a href=\"http://www.qwiki.com/work-here\" rel=\"nofollow\">http://www.qwiki.com/work-here</a><p><a href=\"http://fitbit.theresumator.com/apply\" rel=\"nofollow\">http://fitbit.theresumator.com/apply</a><p><a href=\"http://typekit.com/jobs\" rel=\"nofollow\">http://typekit.com/jobs</a><p><a href=\"http://www.gogobot.com/jobs\" rel=\"nofollow\">http://www.gogobot.com/jobs</a><p><a href=\"http://www.zendesk.com/careers\" rel=\"nofollow\">http://www.zendesk.com/careers</a><p><a href=\"http://jobsco.re/a9Z7Je\" rel=\"nofollow\">http://jobsco.re/a9Z7Je</a><p><a href=\"http://www.sugarinc.com/Web-Software-Engineer-8476531\" rel=\"nofollow\">http://www.sugarinc.com/Web-Software-Engineer-8476531</a><p><a href=\"http://www.payvment.com/careers/\" rel=\"nofollow\">http://www.payvment.com/careers/</a><p><a href=\"http://bo.lt/jobs\" rel=\"nofollow\">http://bo.lt/jobs</a><p><a href=\"http://badgeville.jobscore.com/\" rel=\"nofollow\">http://badgeville.jobscore.com/</a><p><a href=\"http://www.manymoon.com/jobs\" rel=\"nofollow\">http://www.manymoon.com/jobs</a><p><a href=\"http://jobs.sequoiacap.com/\" rel=\"nofollow\">http://jobs.sequoiacap.com/</a><p><a href=\"http://coupons.com/\" rel=\"nofollow\">http://coupons.com/</a><p><a href=\"http://about.vast.com/about/jobs/ui-designer/\" rel=\"nofollow\">http://about.vast.com/about/jobs/ui-designer/</a><p><a href=\"http://www.storenvy.com/jobs\" rel=\"nofollow\">http://www.storenvy.com/jobs</a><p><a href=\"http://www.playdom.com/about/jobs\" rel=\"nofollow\">http://www.playdom.com/about/jobs</a><p><a href=\"http://opowerjobs.com/san-francisco\" rel=\"nofollow\">http://opowerjobs.com/san-francisco</a><p><a href=\"http://www.asterdata.com/about/careers.php\" rel=\"nofollow\">http://www.asterdata.com/about/careers.php</a><p><a href=\"http://quizlet.com/jobs/\" rel=\"nofollow\">http://quizlet.com/jobs/</a><p><a href=\"http://www.atlassian.com/about/careers/\" rel=\"nofollow\">http://www.atlassian.com/about/careers/</a><p><a href=\"http://formativelabs.com/jobs.html#developer\" rel=\"nofollow\">http://formativelabs.com/jobs.html#developer</a><p><a href=\"http://www.cloudflare.com/join-our-team.html\" rel=\"nofollow\">http://www.cloudflare.com/join-our-team.html</a><p><a href=\"http://cotweet.com/jobs\" rel=\"nofollow\">http://cotweet.com/jobs</a><p><a href=\"http://awesm.jobscore.com/list\" rel=\"nofollow\">http://awesm.jobscore.com/list</a><p>Hotel Tonight<p>Crowdcast<p>engineyard<p>yume<p>baycitizen<p>bitTorrent<p>Replicon<p><a href=\"http://www.tunerfish.com/about/careers\" rel=\"nofollow\">http://www.tunerfish.com/about/careers</a><p><a href=\"http://www.idle-games.com/careers.htm\" rel=\"nofollow\">http://www.idle-games.com/careers.htm</a><p><a href=\"http://www.metaswitch.com/careers/experienced-professionals/\" rel=\"nofollow\">http://www.metaswitch.com/careers/experienced-professionals/</a><p><a href=\"http://mixbook.jobscore.com/\" rel=\"nofollow\">http://mixbook.jobscore.com/</a><p><a href=\"http://www.dropcam.com/jobs\" rel=\"nofollow\">http://www.dropcam.com/jobs</a><p><a href=\"http://jobs.appcelerator.com/\" rel=\"nofollow\">http://jobs.appcelerator.com/</a><p><a href=\"http://www.whispersys.com/jobs.html\" rel=\"nofollow\">http://www.whispersys.com/jobs.html</a><p><a href=\"http://www.ariasystems.com/careers/\" rel=\"nofollow\">http://www.ariasystems.com/careers/</a><p><a href=\"http://syapse.com/jobs\" rel=\"nofollow\">http://syapse.com/jobs</a><p><a href=\"http://www.ixl.com/jobs\" rel=\"nofollow\">http://www.ixl.com/jobs</a><p><a href=\"http://nationalfield.org/jobs\" rel=\"nofollow\">http://nationalfield.org/jobs</a><p><a href=\"http://appdynamics.com/about-us-careers.php\" rel=\"nofollow\">http://appdynamics.com/about-us-careers.php</a><p><a href=\"http://tubemogul.com/about/jobs\" rel=\"nofollow\">http://tubemogul.com/about/jobs</a><p><a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=JobListing&#38;c=qHV9Vfwq&#38;v=1\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=JobListin...</a><p><a href=\"http://www.taulia.com/page/careers\" rel=\"nofollow\">http://www.taulia.com/page/careers</a><p><a href=\"http://www.box.net/company/careers/job_openings\" rel=\"nofollow\">http://www.box.net/company/careers/job_openings</a><p>jobs@wikinvest.com<p><a href=\"http://www.srpoints.com/jobs\" rel=\"nofollow\">http://www.srpoints.com/jobs</a><p><a href=\"http://www.ooyala.com/careers\" rel=\"nofollow\">http://www.ooyala.com/careers</a><p><a href=\"http://www.github.com/playhaven/jobs\" rel=\"nofollow\">http://www.github.com/playhaven/jobs</a><p><a href=\"http://www.bizzy.com/jobs\" rel=\"nofollow\">http://www.bizzy.com/jobs</a><p><a href=\"http://www.jasperwireless.com/company/careers.html\" rel=\"nofollow\">http://www.jasperwireless.com/company/careers.html</a><p><a href=\"http://www.lolapps.com/career/\" rel=\"nofollow\">http://www.lolapps.com/career/</a><p><a href=\"http://www.skimlinks.com/careers\" rel=\"nofollow\">http://www.skimlinks.com/careers</a><p>Vator Jobs<p><a href=\"http://www.truecar.com/hiring.html\" rel=\"nofollow\">http://www.truecar.com/hiring.html</a>","time":1297189335,"type":"comment"}]}