{"comments":[{"by":"lkrubner","id":2057833,"kids":[2057848,2058208,2057915,2057838],"parent":2057704,"text":"In New York City there are a lot of jobs. I went to 3 job interviews and got offers from 2. All 3 had tests of my programming skill, though the 3rd was ruthless about minor syntax errors. For instance, the guy talking to me asked me how to find all of the Apache servers running on a server. He just wanted the number. I typed:<p>ps aux | grep apache | wc -l<p>but this wrongly included the command I was typing. We were working on their dev server and I was typing the commands into the terminal. I got back 12 when the real answer was 11. He eventually showed me what I should have typed:<p>ps aux | grep apache | grep -v grep | wc -l<p>The grep -v screens out the line I had just typed which had \"grep apache\" in it. Of course, there are other ways to do this, but this was the first thing I thought of. Of my error, I thought that was somewhat minor, but this guy had recently been hired to clean up a sloppy programming department, so he was looking for programmers who were flawless.<p>The other 2 tests at the other 2 jobs covered the usual questions (write a JOIN statement, write a sub-query, what is the difference between GET and POST?). On one of the interviews, 2 programmers came in to talk to me and they gave me a short PHP script which was working but which was badly written. They asked me how I would re-write it. Easy enough.<p>My sense is there is a lot of hiring going on in New York City. Possibly not enough local talent to fill all the jobs, but the businesses are here for other reasons (other than programming talent) so I think eventually programming talent from elsewhere will get drawn to New York City. There are some cities in the USA that are in deep economic decline, and will probably remain so for the next 5 years, so perhaps some of the programmers from those cities will migrate to New York City.","time":1293901121,"type":"comment"},{"by":"tptacek","id":2058365,"kids":[2058559,2058866,2060163,2058989,2058471],"parent":2057704,"text":"Chicago (or remote)<p>Matasano Security<p>LEAD SOFTWARE DEVELOPER<p>YOU BRING: experience in a key role shipping a web-based product, systems programming chops, comfort with performant network code. Interest, but not not necessarily expertise, in web security.<p>WE BRING: deep and commanding mastery of software security, a fun product†, a customer list, a small team with a minimal viable working offering, a profitable and growing company with a 5 year track record and nice offices†† in NYC, Chicago, and SFBA.<p>†<i>web scale, big(ish) data, search, security; we're a Rails/Ruby/EventMachine shop. We don't care if you already know Ruby.</i><p>Full-time in-house non-consulting dev. Health, dental, 401k, commute, &#38;c.<p>HN is one of our best hiring vectors (ask 'yan, 'wglb, and 'daeken). We hire two roles: vulnerability researchers and software developers. HN has killed for security researchers. Not so much for developers. Ironic!<p>Just mail me: tqbf at matasano dot com.<p>††<i>here's Chicago, on top of one of the coolest buildings in the city, with Intelligentsia Coffee and a serviceable bar on the first floor: <a href=\"http://img228.imageshack.us/g/img0226yl.jpg/\" rel=\"nofollow\">http://img228.imageshack.us/g/img0226yl.jpg/</a> </i>","time":1293914430,"type":"comment"},{"by":"jasonfried","id":2057885,"parent":2057704,"text":"37signals is hiring two Rails programmers:\n<a href=\"http://jobs.37signals.com/jobs/7905\" rel=\"nofollow\">http://jobs.37signals.com/jobs/7905</a><p>Chicago preferred, but we hire the best we can find no matter where you live.","time":1293902741,"type":"comment"},{"by":"jeffbarr","id":2057871,"kids":[2058066,2059999,2058071,2058993],"parent":2057704,"text":"The Amazon Web Services team is hiring for on-site positions in Seattle (WA), Luxembourg, Tokyo, Herndon (VA), and Cape Town (South Africa), Dublin (Ireland), and Slough (UK). We don't offer remote work, but some of the positions do include relocation assistance.<p>I've scraped our official job site and used the data to create a tag cloud of the jobs at <a href=\"http://awsmedia.s3.amazonaws.com/jobs/all_aws_jobs.html\" rel=\"nofollow\">http://awsmedia.s3.amazonaws.com/jobs/all_aws_jobs.html</a> . I'm still working on the styling.<p>The official AWS job site is at Our official job site is <a href=\"http://aws.amazon.com/jobs\" rel=\"nofollow\">http://aws.amazon.com/jobs</a> .<p>There are too many types of jobs to list here. We need developers, business developers, managers, solutions architects, trainers, and technical support.","time":1293902255,"type":"comment"},{"by":"akalsey","id":2057952,"parent":2057704,"text":"We're hiring Java wizards to work on the core of Tropo. <a href=\"http://tropo.com/\" rel=\"nofollow\">http://tropo.com/</a><p>Bay Area preferred, but we'd also love to talk to you if you're located near any other large US city or technology hub (Seattle, Boulder, Austin, Chicago, Boston, NYC, Philly, etc). We're already a distributed team (China, London, Orlando, Philly, Phoenix, and Bay Area) so we're adept at working remotely.<p>Job description at <a href=\"http://www.careerbuilder.com/JobSeeker/Jobs/JobDetails.aspx?IPath=QAKV&#38;ff=21&#38;APath=2.21.21.0.0&#38;job_did=J8B4H86NQZTHRD18DWV\" rel=\"nofollow\">http://www.careerbuilder.com/JobSeeker/Jobs/JobDetails.aspx?...</a><p>We're also looking for a NOC engineer in Las Vegas. <a href=\"http://www.careerbuilder.com/JobSeeker/Jobs/JobDetails.aspx?IPath=QAKV&#38;ff=21&#38;APath=2.21.21.0.0&#38;job_did=JB97TR6FRBW0Q8MN85N\" rel=\"nofollow\">http://www.careerbuilder.com/JobSeeker/Jobs/JobDetails.aspx?...</a>","time":1293904506,"type":"comment"},{"by":"xlpz","id":2057846,"kids":[2057853],"parent":2057704,"text":"We are looking for good hackers with experience in free software. We work on WebKit (maintainers of the GTK+ port), networking, multimedia, javascript, etc. Working remotely is perfectly possible.<p>The company is Igalia (<a href=\"http://www.igalia.com\" rel=\"nofollow\">http://www.igalia.com</a>), and we have a sort of cooperative structure (no bosses, all major decisions taken democratically).<p>If it sounds like your kind of thing, the email is in my profile.","time":1293901511,"type":"comment"},{"by":"ccheever","id":2059557,"parent":2057704,"text":"Quora is hiring in Palo Alto, CA.<p>Quora is a question and answer site focused on really high quality, authoritative content.  The service has a lot of traction and is growing very quickly, especially recently.\nWe are hiring software engineers and product designers.<p><a href=\"http://www.quora.com/about/jobs\" rel=\"nofollow\">http://www.quora.com/about/jobs</a><p>For software engineers, we are mostly looking for generalists--who will work on scaling the service as we grow, including work on our real time web framework LiveNode, building and improving rich web application itself, and building new tools and features.<p>Product designers design and implement the interactions and visuals for the site.<p>We are also planning on building out our mobile experience more, so anyone interested in iOS or Android should apply.<p>The company is well funded by Benchmark.<p>E-mail jobs@quora.com or if you want to get in touch with me directly ccheever@quora.com","time":1293949394,"type":"comment"},{"by":"ahuibers","id":2058801,"kids":[2062492],"parent":2057704,"text":"Bump is hiring in Mountain View, CA (soon maybe SF/SOMA as well), mostly local.<p>Our immediate needs are: Operations, HTML5 development, Android development, Design, R&#38;D including someone who knows both CS and prob/stats.<p>WHY SHOULD YOU WORK AT BUMP?\nWe have enormous traction (25M), a breathtaking pipeline, and a clean codebase.  We may already have and are definitely building one of the best mobile shops in the bay area.  Our senior founder (me) has 10 years of startup experience and is an engineer obsessed with making Bump the best place for engineers and designers to produce great things: this includes compelling work in a professional yet very informal environment, above-market pay/equity/benefits,  minimizing meetings, high quality food and special events, company-wide carte blanche Amazon prime account, surf team.  We are 15 people growing to 30 and now is a great time to join us.<p><a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a>, mail hackernews@ourdomain to get special treatment.  Tech is iOS/ObjC, Android, Python, Scala, C, Haskell, Redis, MongoDB.  Funding is YC, Sequoia.  We are near Caltrain (Castro).","time":1293924427,"type":"comment"},{"by":"bretpiatt","id":2057954,"kids":[2058236],"parent":2057704,"text":"San Francisco Bay Area, CA / Austin, TX / San Antonio, TX<p>I'm hiring devops integration consultants that want to work on OpenStack helping enterprises and service providers deploy solutions based on it (it is posted as only San Antonio on the job listing but all 3 locations are great, Bay Area would actually be ideal).<p><a href=\"http://jobs.rackspace.com/job/San-Antonio-Linux-Cloud-Integration-Consultant-The-Rackspace-Cloud-Job-TX-78218/1042024/\" rel=\"nofollow\">http://jobs.rackspace.com/job/San-Antonio-Linux-Cloud-Integr...</a><p>Rackspace is also hiring for many positions: <a href=\"http://jobs.rackspace.com/content/map/\" rel=\"nofollow\">http://jobs.rackspace.com/content/map/</a>","time":1293904552,"type":"comment"},{"by":"x5315","id":2059011,"parent":2057704,"text":"I'm surprised nobody's mentioned this.<p>Twitter is hiring in San Francisco. I just started there.<p>Here's a list of the positions available: <a href=\"http://twitter.com/positions.html\" rel=\"nofollow\">http://twitter.com/positions.html</a>.<p>I wasn't originally going to post this, but i saw this <a href=\"http://mashable.com/2011/01/01/twitter-jobs-2/\" rel=\"nofollow\">http://mashable.com/2011/01/01/twitter-jobs-2/</a> and thought it might be worth adding.","time":1293929939,"type":"comment"},{"by":"stanleydrew","id":2057887,"kids":[2088299,2059029],"parent":2057704,"text":"Twilio is hiring. We've got a lot of interesting problems to solve and are looking for senior/junior/intern software engineers. We use php, python, java, nginx, twisted, mysql, redis, appengine, and a bunch of other stuff I'm forgetting. Check out <a href=\"http://www.twilio.com/jobs\" rel=\"nofollow\">http://www.twilio.com/jobs</a> or email me at andrew@twilio.com.","time":1293902788,"type":"comment"},{"by":"lethain","id":2058461,"parent":2057704,"text":"Digg is hiring on-site in San Francisco (Potrero hill) for frontend and backend developers, with a preference for people who work all the way up and down the stack. We're willing to take chances on newer developers who seem like a good fit, and also want veteran engineers who will to come in and challenge our assumptions and shake things up.<p>We're working at a scale where performance and data storage decisions start to matter. We're working with a modern stack (Redis, Python, PHP, RabbitMQ, gevent, Hive, etc), and the team we've put together is truly fantastic. 2010 was a topsy turvy year for us, but setbacks build character, and there are many reasons to be excited about where we are going. :)<p>Job specs are at jobs.digg.com , and feel free to send questions/resumes my way at wlarson@digg.com . If you're interested but concerned about the press or trajectory of Digg, definitely send an email my way, and I will send some of my optimism your way!","time":1293916383,"type":"comment"},{"by":"pchristensen","id":2058512,"parent":2057704,"text":"Groupon (Chicago or Palo Alto) wants to hire 25 devs in January 2011.<p>Great developers.  We develop in Rails but we'd rather hire a smart, motivated, skilled developer and teach them Rails than hire any Rails dev and hope they turn out to be awesome.  Lots of problems to solve in data mining, personalization, scaling, business support tools, etc.  My first month here I released code supported millions of dollars of deals.<p>Good coding practices, weekly releases, code reviews, pair programming as needed, MacBook Pros + Cinema monitor for all devs, etc.  Full benefits, real (not startup-sized) salaries.<p>Contact peterc@groupon.com with any questions and I can connect you to the right people.","time":1293917504,"type":"comment"},{"by":"jobsatraptr","id":2057989,"parent":2057704,"text":"Location: Mountain View, CA (a couple blocks from 101)<p>Remote: Sorry, no remote work<p>Raptr is hiring for frontend web, backend web, and desktop client application software engineer positions.<p><a href=\"http://raptr.com/\" rel=\"nofollow\">http://raptr.com/</a><p>We help people get more out of their (video) games. (Finding games, tracking playtime &#38; achievements across multiple platforms, etc.)<p>We're looking for folks with a solid CS background, and a good top to bottom understanding of large scale web applications.<p>Backend web positions work on scaling, data, and providing apis to the frontend team (80% PHP, some Python, a tiny bit of legacy Perl).\nFrontend web team writes html, javascript, and view layer php code using backend apis.\nClient Application team writes a python + QT application for chat + friends + gameplay tracking.<p>Take a look at the job descriptions at <a href=\"http://raptr.com/info/jobs\" rel=\"nofollow\">http://raptr.com/info/jobs</a>, and email me (chris-jobs@raptr.com) with resume for quick consideration if you're interested.","time":1293905855,"type":"comment"},{"by":"kristoffer","id":2059844,"kids":[2098785,2089257,2089255],"parent":2057704,"text":"Gothenburg, Sweden (I wonder what hitrate that will get on HN?)<p>At Aeroflex Gaisler we are looking for a talented embedded hacker that will create software for our system-on-chips based on our own LEON (SPARC32) processor. Previous experience with real time operating systems (e.g. VxWorks, RTEMS), device drivers, and other low level hacking is necessary.<p>We are also looking for someone interested in developing simulators for our systems. Computer architecture and C/C++ skills needed. Qt a plus.<p>Toolchain wizardry (GCC, Clang/LLVM) is always a bonus!<p>Drop me a line at $HNusername@gaisler.com if above sounds interesting.","time":1293964866,"type":"comment"},{"by":"tocomment","id":2057709,"parent":2057704,"text":"Gaithersburg, MD - A payment processing software company I used to work for is hiring an internal applications developer.  You'd be working with Python, SQL Server, IIS and other technologies to automate internal processes.<p>They'd prefer someone local but working remotely might be ok.<p>Email me (in profile)","time":1293895010,"type":"comment"},{"by":"dlo","id":2058699,"parent":2057704,"text":"Do you hack on a programming language after work? Do you read Lambda the Ultimate religiously? This job opening will appeal to the many programming languages enthusiasts here on Hacker News, particularly to the subset that has an accompanying interest in secure code.<p>Fortify Sofware has an opening on its static analysis team. Our products help companies write secure code. Please email me at dlo@fortify.com to make inquiries.<p>We are based in San Mateo. But we will consider outstanding remote workers.","time":1293922215,"type":"comment"},{"by":"coffeemug","id":2058386,"parent":2057704,"text":"Mountain View, CA. RethinkDB (<a href=\"http://www.rethinkdb.com/jobs\" rel=\"nofollow\">http://www.rethinkdb.com/jobs</a>).<p>Hard systems problems. Fun people. Good pay. A chance to build something meaningful and own a significant chunk of the company. Tired of rails-based clones? Join us, together we will rule the [database] universe.<p>This is everything we stand for: <a href=\"http://news.ycombinator.com/item?id=1747713\" rel=\"nofollow\">http://news.ycombinator.com/item?id=1747713</a>","time":1293914974,"type":"comment"},{"by":"troels","id":2057923,"kids":[2057948],"parent":2057704,"text":"Copenhagen, Denmark. Remote not possible and we can't help with relocation.<p>I've just been hired as CTO for a well-funded startup, Greenwire. We recycle used consumer electronics (Primarily mobile phones) and send them for refurbishment and resale.<p>I'm looking for a developer to help me build the IT infrastructure. We'll be working on LAMP technology, probably PHP.<p>Have a read at <a href=\"http://greenwiregroup.com/\" rel=\"nofollow\">http://greenwiregroup.com/</a>","time":1293903903,"type":"comment"},{"by":"nigelk","id":2058389,"parent":2057704,"text":"Puppet Labs is trying to rock the DevOps/Sysadmin world with our model-driven approach to config management.<p>We're based in Portland, OR, and aren't looking for remote workers as yet.<p>We're looking for both Core Developers and Pro Services Engineers, and no matter what, you'll be working with open source software and a highly engaged user community, as well as on a project that is included in most of the major *nix distributions in one way or another.<p>Puppet itself is written entirely in Ruby, so strong experience in Ruby is great, but experience in an equivalently flexible language is fine too.<p>We've recently moved into our new offices:\n<a href=\"http://twitpic.com/3ckay1\" rel=\"nofollow\">http://twitpic.com/3ckay1</a>\n<a href=\"http://twitpic.com/3cksg3\" rel=\"nofollow\">http://twitpic.com/3cksg3</a>\n(things are more organized than that now :)<p>Portland is freaking awesome.<p>I moved up here recently after working for Google in the Bay Area, and I couldn't be happier.  Cheap rent, amazing food and beer, huge bike culture and a city full of incredibly friendly and nice people.<p><a href=\"http://www.puppetlabs.com/company/jobs/\" rel=\"nofollow\">http://www.puppetlabs.com/company/jobs/</a>","time":1293915009,"type":"comment"},{"by":"bkrausz","id":2058604,"parent":2057704,"text":"Mountain View, CA<p>GazeHawk (YC S10)<p>Web Engineer, second hire<p>Full description at <a href=\"http://gazehawk.com/jobs/\" rel=\"nofollow\">http://gazehawk.com/jobs/</a><p>Long story short: we do cool things with Javascript!","time":1293920077,"type":"comment"},{"by":"donohoe","id":2058100,"parent":2057704,"text":"The New York Times is looking for a Snr Software Engineer and sys admin in NYC<p>Follow this link and choose 'Production' for Major Department:\n<a href=\"http://nyti.ms/webjobs\" rel=\"nofollow\">http://nyti.ms/webjobs</a><p>Email me if you apply and I can help ensure your resume gets seen directly or answer questions you might have.<p>Not advertised there are Web Developer roles (CSS/HTML/JS/PHP/etc) - email me (my HN username @ nytimes.com)","time":1293908650,"type":"comment"},{"by":"shaver","id":2058685,"kids":[2058862,2073491,2058746,2059740],"parent":2057704,"text":"tl;dr: Mozilla is hiring, and we have many different kinds of positions open.  Main offices are in Mountain View, Toronto, Auckland, Paris; remote work very much a possibility, esp for people with experience doing it.  I know most about engineering, but the fullish list is off <a href=\"http://www.mozilla.com/en-US/careers\" rel=\"nofollow\">http://www.mozilla.com/en-US/careers</a><p>Platform engineers: the native-code guts of Firefox, you could work on things ranging from network protocols to scripting performance, 3D graphics to parallelism, performance tuning to debugging and instrumentation.  And you get to deliver new web capabilities to about half a billion people.  Want to make contentEditable not suck?  Want to fix the CSS layout model so people don't miss tables?  Want to make Flash and Silverlight sweat more bullets?  Us too.<p>Firefox engineers: 2011 is going to be a very exciting year for Firefox, and we have lots of ambitious work planned.  There is lots systems work as we move to a multi-process model, as well as lots of \"app logic\" and more traditional front-end stuff.  Client-side web skills map well, and we want to make them map even better; you can help with that too.<p>Web developer tools: we're going to be significantly increasing our investment in developer tools, to improve the web development experience dramatically.  Package up the complexities of the web platform and make it grokkable to everyone from a grade-schooler to jeresig.<p>Engineering management: we need more people who know how to make developers successful and satisfied, and get joy out of doing it.  Our engineering organization spans the globe, has a scope as broad as the web itself, and competes against the biggest software companies in the world.<p>Developer infrastructure: we run a large software operation on open source tools, and want to make everything from crash reporting to bugzilla to mercurial to the build system work better.  Take the hard information problems of software development, make web apps and other tools to help understand and solve them.  If you have partially automated your breakfast routine, and want to play with some pretty large-scale data, this could be a lot of fun.<p>Security: program management and penetration testing both.  Your purview is security at the full breadth of the web.<p>Web development, apps big and small: top-25 web properties (without ads), software update systems for 420M+ users, demos for new web technologies, crash analytics systems backed by dozens of Hadoop nodes.<p>Mozilla is a non-profit organization chartered to improve the web.  We pay competitive salaries, have great benefits, and work in the open.  Wake up every morning glad you get to do the right thing!","time":1293921898,"type":"comment"},{"by":"lovitt","id":2058354,"parent":2057704,"text":"SB Nation is a media/technology startup in Washington, DC. We're hiring Ruby developers and visual designers (local preferred, remote considered):<p><a href=\"http://www.sbnation.com/jobs/developer\" rel=\"nofollow\">http://www.sbnation.com/jobs/developer</a><p><a href=\"http://www.sbnation.com/jobs/designer\" rel=\"nofollow\">http://www.sbnation.com/jobs/designer</a><p>We're a network of 290+ sports news sites &#38; communities. As newspapers are shutting down their sports sections, we're quietly reinventing the media model with profitable, high-quality, innovative coverage by and for fans. Our investors include Accel Partners, Allen &#38; Company, Comcast Interactive Capital, and Khosla Ventures. We get around 16 million unique visitors every month.<p>Our small product team develops the custom publishing and community platform (built on Rails) that powers the sites. The interesting problems we face range from editorial analytics, to social distribution, to scaling the system to handle our rapid growth.<p>Here are some of the humans you'd be working with: <a href=\"http://www.flickr.com/photos/mlovitt/4507489423/in/set-72157623699958119/\" rel=\"nofollow\">http://www.flickr.com/photos/mlovitt/4507489423/in/set-72157...</a><p>And some recent press:<p>* Why sports is driving innovation in journalism: <a href=\"http://markcoddington.com/2010/10/08/why-sports-has-taken-the-lead-in-newsroom-innovation/\" rel=\"nofollow\">http://markcoddington.com/2010/10/08/why-sports-has-taken-th...</a><p>* NY Times profile: <a href=\"http://www.nytimes.com/2010/06/07/business/media/07fans.html\" rel=\"nofollow\">http://www.nytimes.com/2010/06/07/business/media/07fans.html</a><p>* Harvard's Nieman Journalism Lab: <a href=\"http://www.niemanlab.org/2010/06/sb-nation-ceo-on-how-were-fans-of-teams-not-sports-t-v-shows-not-t-v-and-what-that-means-for-news/\" rel=\"nofollow\">http://www.niemanlab.org/2010/06/sb-nation-ceo-on-how-were-f...</a>","time":1293914165,"type":"comment"},{"by":"tkiley","id":2058026,"kids":[2061859],"parent":2057704,"text":"InQuickER (YC W08 reject ;-]) is hiring on Vancouver Island, British Columbia (Parksville/Nanaimo area, onsite preferred but not required).<p>We are bootstrapped, profitable, and proud by 37signals' definition. Today we are an 8-person team, and we're looking to add another senior ruby/rails developer and a user acquisition engineer.<p>Contact tyler@inquicker.com.","time":1293906809,"type":"comment"},{"by":"doorty","id":2057764,"kids":[2057914,2057814],"parent":2057704,"text":"I would be interested to hear from YC companies (or companies at SF incubators) that are looking for tech co-founders.","time":1293897744,"type":"comment"},{"by":"amduser29","id":2058462,"parent":2057704,"text":"San Francisco<p>You: First and foremost, a talented hacker. Secondly, PHP/MySQL experience or mobile experience.<p>Us: Life360. We are turning mobile phones into the ultimate family safety devices.<p>Contact: alex@life360.com<p>Cheers.","time":1293916396,"type":"comment"},{"by":"c4urself","id":2057967,"parent":2057704,"text":"Changer is small and growing company and is hiring in Leidschendam, Netherlands. Contact us at <a href=\"http://www.changer.nl\" rel=\"nofollow\">http://www.changer.nl</a>. We're looking for someone who loves building web applications. We use Python/Django and .NET/MVC.","time":1293905078,"type":"comment"},{"by":"timr","id":2058705,"parent":2057704,"text":"Yelp is hiring software engineers, product managers and designers right now, along with lots of other kinds of jobs:<p><a href=\"http://www.yelp.com/careers\" rel=\"nofollow\">http://www.yelp.com/careers</a><p>Or email me (my HN login at yelp.com), particularly if you're interested in search and data mining.","time":1293922310,"type":"comment"},{"by":"aaronkaplan","id":2062971,"parent":2057704,"text":"The work week is just starting on the east coast of the US and this has already dropped to 123rd place. Maybe it wasn't such a good idea to post it over the weekend, particularly a holiday weekend.<p>On the other hand, it got more posts than last month's, so maybe I'm wrong.","time":1294059194,"type":"comment"},{"by":"hshah","id":2058027,"kids":[2058334],"parent":2057704,"text":"We're always looking for people to join our team at KISSmetrics...<p><a href=\"http://www.kissmetrics.com/jobs\" rel=\"nofollow\">http://www.kissmetrics.com/jobs</a>","time":1293906839,"type":"comment"},{"by":"dogas","id":2057999,"parent":2057704,"text":"PipelineDeals (<a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a>) is looking for a full-time senior sysadmin to maintain our production stack, hosted on amazon ec2.<p>If load balancing, Mysql clustering, maintaining dozens of servers, working with a great group of smart guys, and having an endless supply of fun and interesting projects to work on sounds like your cup of tea, drop me a line.<p>grant@pipelinedealsco.com<p>PipelineDeals is 5 years old, bootstrapped, quite  profitable, and steadily growing.  We are based in Seattle and Philadelphia.   Remote applicants no problem!","time":1293906090,"type":"comment"},{"by":"NateLawson","id":2059158,"parent":2057704,"text":"Root Labs<p>SF Bay Area<p>Software developer<p>We're building a system software product with a web frontend. Security experience not necessary, but deep understanding of scalability, compilers, algorithms, databases, etc. is. Built from components including Python/C/Ruby/Redis.<p>Instead of a job posting, we've got a description of the types of projects we do in addition to developing this product to give you a flavor for our office. (It also has a link to the job description at the end).<p><a href=\"http://rdist.root.org/2009/10/23/just-another-day-at-the-office/\" rel=\"nofollow\">http://rdist.root.org/2009/10/23/just-another-day-at-the-off...</a><p>Email me: nate / rootlabs.com<p>Thanks.","time":1293934070,"type":"comment"},{"by":"intridea","id":2064457,"parent":2057704,"text":"Intridea is looking for someone to run one of our flagship products. More details here <a href=\"http://news.ycombinator.com/item?id=2064402\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2064402</a>","time":1294084855,"type":"comment"},{"by":"DanBlake","id":2058472,"parent":2057704,"text":"NYC - Tinychat is looking for a hardcore server admin. We use nginx, apache, php, mysql and other linux junk. \nThis would be a senior position, so expertise is required.<p>jobs@tinychat.com - pay/equity based on experience.","time":1293916590,"type":"comment"},{"by":"sx","id":2057835,"parent":2057704,"text":"Pattern Insight is hiring in Mountain View CA. We are looking for software engineers, QA engineers and tech sales:<p><a href=\"http://patterninsight.com/about/careers.php\" rel=\"nofollow\">http://patterninsight.com/about/careers.php</a><p>We are building search products for semi-structured data.<p>We are cash flow positive and growing fast. Our customers are some of the biggest tech companies in the world. That said, we are still early and looking for people that want to be part of the core team and shape our future.<p>Contact us at: jobs@patterninsight.com","time":1293901304,"type":"comment"},{"by":"mikeytown2","id":2058104,"parent":2057704,"text":"Datasphere is hiring php, java, .net, and front end hackers. We are an ignition backed company.<p><a href=\"https://datasphere-openhire.silkroad.com/epostings/index.cfm?fuseaction=app.allpositions&#38;company_id=16315&#38;version=1\" rel=\"nofollow\">https://datasphere-openhire.silkroad.com/epostings/index.cfm...</a><p>We are headquartered in Bellevue, Washington and led by a team of Internet veterans with backgrounds from Amazon.com, IMDb, Microsoft, RealNetworks, AltaVista, Trendwest and other leading companies.","time":1293908794,"type":"comment"},{"by":"js2","id":2058010,"parent":2057704,"text":"RockMelt is hiring a variety of positions - <a href=\"http://www.rockmelt.com/jobs.html\" rel=\"nofollow\">http://www.rockmelt.com/jobs.html</a><p>Mountain View, CA preferred. jay@rockmelt.com","time":1293906415,"type":"comment"},{"by":"daveambrose","id":2057919,"parent":2057704,"text":"Scoop St. in New York City is hiring sales and social media savvy folks who are passionate about discovering their city. We believe in the power of group buying online today and our team has been working in the space over the last two years, as things were really getting started.<p>NYC metro preferred but remote positions for social media is possible. See <a href=\"http://www.scoopst.com/jobs\" rel=\"nofollow\">http://www.scoopst.com/jobs</a> or email dave@scoopst.com","time":1293903816,"type":"comment"},{"by":"jehirsch","id":2063968,"parent":2057704,"text":"Syapse is looking to add some key people to our team (Syapse.com/jobs).<p>Syapse is Salesforce.com for product development, focused on the biomedical space.<p>We were started at Stanford, and are based in Palo Alto. Our goal is to accelerate biomedical product development by organizing biological results, and enabling scientific project management and collaboration. We utilize semantic technologies and biomedical ontologies to deliver scientifically intelligent web applications to biomedical companies of all sizes.<p>Our customers include a number of prominent biotech, pharma, and diagnostics companies in the fields of biologics, biomarkers, and molecular diagnostics. Our team is a multidisciplinary group of successful entrepreneurs, developers, and scientists. We have started twelve companies worth $15 billion, and created foundational web technologies such as the first e-commerce, webmail, and document management applications, and the Netscape Enterprise Server platform.<p>Syapse is looking to hire biology-savvy Web Application Developers, Web Interface Designers, and Python Server Developers. Our main technology stack is HTML, JS, Apache, Python / Django, and MySQL.<p>For more information about the positions, and information about how to apply, here: Syapse.com/jobs.","time":1294077337,"type":"comment"},{"by":"natrius","id":2058510,"parent":2057704,"text":"Austin, TX; on-site.<p>We're looking for experienced developers to join our team at The Texas Tribune. We're a non-profit, online news organization that covers state politics and policy in Texas. State and local governments spend more money than the federal government in America, yet far less attention is paid to what's going on outside of D.C. We aim to fix that.<p>We're currently working on improving and open-sourcing our CMS to allow other similar organizations to get off the ground much more quickly. We also build data apps that help our readers visualize, browse, and search through various data that the government puts out[1]. It's fun, fulfilling, and well-compensated work.<p>If you're interested, email me at nbabalola@texastribune.org. Include GitHub and HN usernames if you have them.<p>[1] Some examples:<p>Government Employee Salaries: <a href=\"http://www.texastribune.org/library/data/government-employee-salaries/\" rel=\"nofollow\">http://www.texastribune.org/library/data/government-employee...</a><p>Prison Inmates: <a href=\"http://www.texastribune.org/library/data/government-employee-salaries/\" rel=\"nofollow\">http://www.texastribune.org/library/data/government-employee...</a><p>Elected Officials: <a href=\"http://www.texastribune.org/directory/\" rel=\"nofollow\">http://www.texastribune.org/directory/</a>","time":1293917484,"type":"comment"},{"by":"supernayan","id":2058172,"parent":2057704,"text":"AudaxHealth is hiring Software Engineers: <a href=\"http://audaxhealth.com/?page_id=16\" rel=\"nofollow\">http://audaxhealth.com/?page_id=16</a><p>Washington, D.C.<p>Corporate is boring. Startups = fun!<p>jobs@audaxhealth.com","time":1293910194,"type":"comment"},{"by":"arupchak","id":2058833,"parent":2057704,"text":"Amazon.com Seller Services - Seattle WA - No remote, but willing to relocate based on experience.<p>I am looking for a strong Systems Support Engineer for our growing team. We like to describe our organization as a Startup within Amazon, as our part of the business is still growing rapidly and our engineers can have a lot of influence on where the product goes.<p>Job description below. Contact me at ${hn_username}@gmail.com if you have any questions.<p>The Amazon Services team is looking for a great Systems Support Engineer to keep our systems running. You should be comfortable in a Linux environment, be able to automate everything you did yesterday, and willing to troubleshoot and solve new problems on a daily basis. Come join one of the fastest growing teams within Amazon.<p>Responsibilities:<p>-Maintain stability and performance of our systems via tickets during oncall shifts<p>-Diagnose and troubleshoot new production issues that affect our customers<p>-Create and maintain standard operating procedure documents for new issues identified<p>-Automate operational tasks to assist with our scaling needs<p>Requirements:<p>-Proficiency in a scripting language (Ruby, Perl, Python, Shell)<p>-Familiar with SQL databases<p>-Comfortable navigating a Linux environment<p>-Basic understanding of web application architectures<p>Bonus points:<p>-Written a Rails application<p>-Deep knowledge of Oracle databases<p>-Troubleshooting experience<p>-Ticketing experience","time":1293925365,"type":"comment"},{"by":"randfish","id":2058490,"kids":[2068301],"parent":2057704,"text":"Seattle, WA - SEOmoz is hiring a product manager with mad wireframing/product design skills - <a href=\"http://seattle.craigslist.org/see/sof/2120238146.html\" rel=\"nofollow\">http://seattle.craigslist.org/see/sof/2120238146.html</a><p>We're also hiring engineers - <a href=\"http://seattle.craigslist.org/see/sof/2091255814.html\" rel=\"nofollow\">http://seattle.craigslist.org/see/sof/2091255814.html</a>","time":1293916993,"type":"comment"},{"by":"ccoop","id":2057786,"parent":2057704,"text":"I'm looking for a tech co-founder for an education software start-up. Location will be either Boulder or SF.<p>Interested in learning more?<p>Contact me: letsdobigthings [at] gmail","time":1293898934,"type":"comment"},{"by":"Andaith","id":2057796,"parent":2057704,"text":"Between Bath and Bristol, possibly relocating to Bath, England.<p>Looking for a PHP developer to join a small web design agency.<p>Email: andrew [AT] moresoda [DOT] co [DOT] uk","time":1293899406,"type":"comment"},{"by":"buro9","id":2058004,"kids":[2058757],"parent":2057704,"text":"Yell Labs in London, UK is still hiring (slowly but surely).<p>We're currently looking for great developers with Java and/or Python skills.<p>We mostly make web apps and mobile apps and the backend services for these.<p>It's all full time, London based, salaried... a regular job but in a buzzing product development environment. We're all very understanding of side-projects and actually encourage it.<p>Contact david.kitchen@yellgroup.com","time":1293906215,"type":"comment"},{"by":"cheriot","id":2058135,"kids":[2059000],"parent":2057704,"text":"OPOWER is hiring in DC and SF: opowerjobs.com/engineering<p>(we're a Java shop)<p>Feel free to send me questions.","time":1293909432,"type":"comment"},{"by":"phillytom","id":2058428,"parent":2057704,"text":"Monetate - Conshohocken, PA (Philly suburb)<p>Local only. Will relocate for the right person but no remote.  We've hired 2 great people from HN.<p>We're a SAAS provider of testing, targeting and personalization tools (i.e. segmentation, A/B testing, MVT) to internet retailers. We've got existing high-volume customers. We're small, profitable, and we're growing fast. We're funded by First Round Capital. <a href=\"http://jobs.monetate.com/\" rel=\"nofollow\">http://jobs.monetate.com/</a><p>* We're looking for backend engineers who want to work on data and web problems at scale in Python.<p>* We're also hiring front-end developers who want to help build and test experiments and own our client facing UI. You should be experienced in working with production-quality cross-browser HTML/CSS and Javascript with and without frameworks.<p>We have fun problems at scale, great people to work with, and we get instant feedback from our clients on everything we put out! We're having a blast.<p>Feel free to email me any questions - tjanofsky monetate com.","time":1293915774,"type":"comment"},{"by":"locandy","id":2058137,"parent":2057704,"text":"SF Bay Area<p>Location Labs is a fast growing start-up that's doing lots of interesting things around location-based services.  The whole gamut of work: Ruby, Python, Obj-C, Java; both server-side and mobile (iPhone, Android)<p><a href=\"http://location-labs.com/jobs.php\" rel=\"nofollow\">http://location-labs.com/jobs.php</a><p>QA, UX design, and product management roles as well","time":1293909463,"type":"comment"},{"by":"marcinw","id":2058076,"parent":2057704,"text":"We have several positions available in New York City AND London. If you have an interest in breaking stuff, can code in C, Java, C#, Python, or whatever, come talk to us! Send me an email at &#60;my yc username&#62; @ gdssecurity.com<p><a href=\"http://www.gdssecurity.com/g/ca.php\" rel=\"nofollow\">http://www.gdssecurity.com/g/ca.php</a>","time":1293908158,"type":"comment"},{"by":"tudorg","id":2057925,"kids":[2058877],"parent":2057704,"text":"Berlin, Germany. No telecommuting but we can help with relocation. At IPTEGO we're a bunch of HNers that would like to meet you.<p>We're a well funded company doing an analytics and troubleshooting product for next generation networks (NGNs). We use C/C++, python and javascript. Please email jobs@iptego.com and mention HN somewhere.","time":1293903933,"type":"comment"},{"by":"tednaleid","id":2058503,"parent":2057704,"text":"We've got a development opening for a full time position at my startup, Bloom Health.<p><a href=\"http://gobloomhealth.com/jobs/software-engineer\" rel=\"nofollow\">http://gobloomhealth.com/jobs/software-engineer</a><p>Bloom Health is a VC funded startup with about 20 employees (including 5 developers currently).<p>Our offices are in downtown Minneapolis and are connected to the skyway.  100% remote working isn't an option currently, but we're flexible enough that working from home a day or two a week isn't a problem.<p>We develop on macbook pros with external monitors, and deploy our solution on Amazon's EC2 platform.  Smart and fun people drinking free soda and working with groovy and grails, continuous integration, test coverage metrics, user stories, distributed version control, etc.  All the things you'd want and expect in a startup, plus a business model that actually has a shot at paying off as an added perk.","time":1293917259,"type":"comment"},{"by":"buymorechuck","id":2058011,"parent":2057704,"text":"Palo Alto, CA - Flipboard: Web Developer<p>We are looking for developers with interest and experience working on web tech and know how browsers tick.<p>Flipboard Pages is one example of our HTML5 auto-pagination, auto-layout framework for making the web beautiful.<p><a href=\"http://flipboard.com/jobs\" rel=\"nofollow\">http://flipboard.com/jobs</a> or drop me a line.","time":1293906423,"type":"comment"},{"by":"apgwoz","id":2058300,"parent":2057704,"text":"Meetup.com, New York, NY--no remote. We're hiring developers, QA folks and also someone to manage our data repositories (MySQL, MogileFS, HBase). <a href=\"http://www.meetup.com/jobs\" rel=\"nofollow\">http://www.meetup.com/jobs</a> if you're interested.","time":1293913174,"type":"comment"},{"by":"petewailes","id":2057895,"parent":2057704,"text":"A client of mine is looking to hire a lead developer (LAMP) to start an internal dev team. The site is <a href=\"http://www.oakfurnituresolutions.co.uk/\" rel=\"nofollow\">http://www.oakfurnituresolutions.co.uk/</a><p>Message me for details. Bristol (UK) location preferred.","time":1293903039,"type":"comment"},{"by":"drewvolpe","id":2059411,"parent":2057704,"text":"Boston, no remote work<p>Locately (early-stage startup, funded by Hacker Angels)<p><a href=\"http://www.locately.com/\" rel=\"nofollow\">http://www.locately.com/</a><p>Our software analyzes location data from mobile phones to understand where people go. We then sell this research to large retailers (Target, Costco, ...), \"out of home\" advertisers (ie, billboards), and city planners and developers.<p>We're looking to add two engineers.  We use some Java and lot of Python (with Scipy), though if you don't know these that's fine, we just care about hiring good hackers.<p>You get to work here:\n    <a href=\"http://plixi.com/p/60698580\" rel=\"nofollow\">http://plixi.com/p/60698580</a><p>Email me directly:  drew+hn@locately.com","time":1293943094,"type":"comment"},{"by":"jaaron","id":2058080,"parent":2057704,"text":"Los Angeles funded startup: web developer and visual designers.<p>Still in stealth, but launching within next 6 months.  We have 15 people worldwide and are well funded.  Actual LA office is in Santa Monica and we need people on site there. Looking for a lead web developer, ideally with exceptional JavaScript skills (not just playing around with JQuery), and we're looking for another senior visual designer.<p>It's a great team and if you're in the area or willing to relocate to LA, it's a fantasic opportunity to have the startup experience while not sacrificing competitive pay.  Email &#38; twitter in my profile.","time":1293908283,"type":"comment"},{"by":"mcfunley","id":2059037,"kids":[2103157,2059887,2063695],"parent":2057704,"text":"Etsy.com is hiring in Brooklyn, Berlin, San Francisco, and Hudson, NY. This should explain everything:<p><a href=\"http://vimeo.com/13214706\" rel=\"nofollow\">http://vimeo.com/13214706</a><p>Feel free to email me directly with questions, resumes, etc.","time":1293930712,"type":"comment"},{"by":"mustafakidd","id":2058075,"parent":2057704,"text":"We Are Mammoth is hiring a .NET developer: <a href=\"http://blog.wearemammoth.com/2010/12/were-hiring-net-developer.html\" rel=\"nofollow\">http://blog.wearemammoth.com/2010/12/were-hiring-net-develop...</a><p>We're in Chicago.","time":1293908070,"type":"comment"},{"by":"gommm","id":2057928,"kids":[2058188],"parent":2057704,"text":"I'm hiring Rails programmers in Shanghai.. Also looking for interns.<p>Email is in my profile","time":1293904029,"type":"comment"},{"by":"thinkcomp","id":2057884,"parent":2057704,"text":"Think Computer Corporation, Palo Alto, CA<p><a href=\"http://www.facecash.com\" rel=\"nofollow\">http://www.facecash.com</a><p>We're looking for iPhone, Android and BlackBerry developers to continue developing our mobile payment system.","time":1293902582,"type":"comment"},{"by":"brentoids","id":2075637,"parent":2057704,"text":"Localot Research. We are 6 PhDs and 4 engineers, working on some very cool machine learning / natural language processing / data analytics problems that need a lot of scaling.  Our strongest need is for experienced developers, but we are growing and will need more statistician/ML/NLP/math people and sys-admins.  We have an espresso maker (and coffee machine).<p>We have multiple positions available.  We want great people who think big, <a href=\"http://www.localot.com/jobs.html\" rel=\"nofollow\">http://www.localot.com/jobs.html</a>.","time":1294328156,"type":"comment"},{"by":"eof","id":2058339,"parent":2057704,"text":"Burlington, VT<p>Eatingwell.com<p>We are looking for a smart, entry to mid level programmer.   Geeks are treated well in this media company, this is the last position in a department that will have grown by 300% in the last 9  months by the time you get there.<p>Php for our existing site and apps, everything new is python.  If you can think well, I don't care what your resume looks like.  Lots of room for growth in this very profitable company, you report to a programmer, great benefits, food, dog friendly office, rural office setting.","time":1293914007,"type":"comment"},{"by":"chipmunkninja","id":2060066,"parent":2057704,"text":"Adylitica is hiring software development interns for iOS, web apps, WP7, or Android development.  We do contract and boutique mobile app development.<p>We're based in Beijing, and will help you take care of everything you need to come out and work with us.  It's a super fun city with tonnes to do and great food to boot.<p>Our website's pretty bland, but feel free to get in touch with us:<p><a href=\"http://adylitica.com/work_with_us.html\" rel=\"nofollow\">http://adylitica.com/work_with_us.html</a>","time":1293978942,"type":"comment"},{"by":"icco","id":2059524,"parent":2057704,"text":"San Luis Obispo, CA<p>iFixit.com is hiring Software Developers, Designers and a Marketing Director.<p><a href=\"http://www.ifixit.com/info/jobs\" rel=\"nofollow\">http://www.ifixit.com/info/jobs</a><p>I'm a software developer there and love it. Mainly a LAMP shop, but really awesome people and incredibly flexible. Kyle (our CEO) is very approachable, and we are a bootstrapped 30 person startup. If you're interested in having a huge impact on the world of repair and gadgets, come check us out.","time":1293947519,"type":"comment"},{"by":"dshah","id":2059561,"parent":2057704,"text":"HubSpot is hiring in Cambridge, MA<p>We're a software company that delivers marketing software for small businesses.  We reach millions of users every month.<p>We were voted one the best company to work for in the Boston area this year (Google was #2).<p>We use a combination of Java, Python and PHP.  We're one of the top 1,000 most trafficed websites in the U.S. -- so we've got some interesting software challenges.<p>I'm the founder/CTO.  You can email me directly at dshah {at} hubspot {dot} com.","time":1293949519,"type":"comment"},{"by":"kiscica","id":2059209,"kids":[2059444],"parent":2057704,"text":"1010data is hiring in NYC.  Standard black-and-white descriptions of the current job openings are at <a href=\"http://www.1010data.com/company/careers/current-job-openings\" rel=\"nofollow\">http://www.1010data.com/company/careers/current-job-openings</a> (warning: links on that page are to PDFs) and you can find out what we do at <a href=\"http://www.1010data.com/company\" rel=\"nofollow\">http://www.1010data.com/company</a>, but here's a little extra color especially for HN:<p>(1) We are looking for someone (v. 'Infrastructure Engineer') who'd be excited to take on the challenge of helping to run, and ultimately running, a rapidly expanding cluster of hundreds of high-performance servers at several datacenters.  The environment is pretty unconventional (99.4% proprietary software, for example, and we prefer to use an \"exotic\" language - K - even for infrastructure purposes); I'd say it's much more comparable to academic/scientific clusters than to your typical web application company.  So that kind of background wouldn't hurt!  At the same time, though, you need to know Windows, 'cause we don't use Linux yet, and you need to know Linux, 'cause we will sooner or later, and you need to be really au courant on the standard datacenter stuff (networking, firewalls, security, backup and replication, racking hardware, receiving -- and making  -- urgent phonecalls at inconvenient times, etc.).  As you can imagine, this is a bit of a hard job to fill... you need to be highly experienced (because we need your experience to support the serious growth we're in the middle of) and yet have an extremely flexible mindset (since we do things in such an atypical way).  But if you're the right person to fill it, the rewards will be substantial.  Be <i>the</i> guy in charge of hundreds of some of the hardest-working servers out there: 1010data is the fastest analytical database on the planet, and our customers are pounding the cluster 24/7...<p>(2) We are also looking for a 'Web Application Developer'.  But again, the dry job posting belies the fact we need something a bit unconventional.  What we really mean by this is a <i>hacker</i> who just happens to <i>really love hacking in JavaScript</i>.  This is, I sense, a rare combination.  But it <i>does</i> exist (we have verified examples at 1010data).  We are developing cutting-edge browser-based interfaces to aforementioned fastest analytical database on the planet and since JS is the Language of the Browser... well, that's probably why you, JavaScript Hacker, chose JS.  Right?  Oh, you say it's because it's kind of an awesome language in its own right?  OK, well, whatever the reason: if you hack JS and want to develop cutting-edge browser-based interfaces for manipulating and visualizing large datasets... please, please apply for this job.  You're going to love it at 1010data.<p>(3) We are looking for a 'Systems Developer'.  We're not 100% sure how to define this, to be honest, but to paraphrase Justice Stewart, we'll know you when we see you.  You need to know a lot about Windows internals, but ideally also Unix/Linux, since one of the major projects you'll be involved in will be a gradual environment shift.  You'll be diagnosing performance issues.  You'll be trying to wring more speed from our already very efficient cluster.  You'll be writing code (bonus! in an exotic language!) to move data around, to do logging and performance reporting, and who knows what else.  You're going to be the guy we all go to when it comes to the low-level arcana, so you're very familiar with the Way Things Work.  You know who you are.  Let us know too.<p>If you think any of the above is you... then write to jobs@1010data.com and mention that you saw Adam's post at HN.<p>1010data, by the way, is a fantastic place to work.  We've got a whole floor in a grand old midtown building populated with a small but growing bunch of very dedicated, very smart, very happy people.  We're growing fast, so there's a lot of energy, and you'll be working hard, but what you do will <i>matter</i>.  No one is doing superfluous work at 1010.  Your stuff will be <i>used</i>.  You get all the startup excitement, but without the startup risk - 1010's a well-established company; we've been around since before the turn of the century.  Which, these days, is almost as long as it sounds!","time":1293935604,"type":"comment"},{"by":"AnneM0101","id":2072270,"parent":2057704,"text":"EnergySavvy.com is looking for front and back end developers. EnergySavvy's goal is to make home energy efficiency easier for homeowners, so if you're interested in cleantech, this might be a good fit. Check out <a href=\"http://www.energysavvy.com/jobs/\" rel=\"nofollow\">http://www.energysavvy.com/jobs/</a>","time":1294258249,"type":"comment"},{"by":"rdschouw","id":2059277,"parent":2057704,"text":"NYC<p>Shapeways (create / sell personal designed products / 3D printing) is looking for her Manhattan office talented BACKEND and FRONTEND DEVELOPERS. We use LAMP stack with some Java stuff. Please see our job page at <a href=\"http://www.shapeways.com/jobs\" rel=\"nofollow\">http://www.shapeways.com/jobs</a><p>Salary / equity based on experience","time":1293938075,"type":"comment"},{"by":"gnubardt","id":2057826,"parent":2057704,"text":"Brightcove (an online video platform) is currently hiring in Cambridge, Seattle and London.<p><a href=\"http://brightcove.com/careers\" rel=\"nofollow\">http://brightcove.com/careers</a><p>I work in Engineering and it's a blast!  We're mostly using java and flex with python at times, but the scale we operate at means it's always interesting.","time":1293900771,"type":"comment"},{"by":"svec","id":2063786,"parent":2057704,"text":"Ember is hiring in Boston, MA!<p>We're looking for embedded/firmware, QA, and ops right now.  It's a great place to work. I've only been here a short while, but I love it so far!<p>Email me at: emberJan2011 [and then the at sign] saidsvec.com<p><a href=\"http://www.ember.com/company_careers.html\" rel=\"nofollow\">http://www.ember.com/company_careers.html</a>","time":1294074646,"type":"comment"},{"deleted":true,"id":2057889,"parent":2057704,"time":1293902825,"type":"comment"},{"by":"abailer","id":2066951,"parent":2057704,"text":"Arlington, VA looking for a Sr Software Engineer and a Software Engineer for online, content-driven health site.  Check out the postings at <a href=\"http://www.healthcentral.com/about/careers/\" rel=\"nofollow\">http://www.healthcentral.com/about/careers/</a>!","time":1294150368,"type":"comment"},{"by":"pquerna","id":2058246,"parent":2057704,"text":"Rackspace (now with more Cloudkick'ers) is hiring.<p>Lots of open positions in San Francisco, most are for parts of the Cloudkick team:\n<a href=\"http://jobs.rackspace.com/search?q=%22san+francisco%22\" rel=\"nofollow\">http://jobs.rackspace.com/search?q=%22san+francisco%22</a>","time":1293911737,"type":"comment"},{"by":"jdenglish","id":2059356,"parent":2057704,"text":"Energid Technologies is hiring robotics and machine vision engineers with C++ expertise for our new lab in Burlington, MA, and remote work.  <a href=\"http://www.energid.com/contact.htm\" rel=\"nofollow\">http://www.energid.com/contact.htm</a>","time":1293941012,"type":"comment"},{"by":"tomh","id":2066288,"parent":2057704,"text":"Waltham, MA (no remote)<p>Akaza Research LLC is looking for a Software Quality Assurance Lead.  Contact me for more details.<p><a href=\"https://www.openclinica.org/page.php?pid=607\" rel=\"nofollow\">https://www.openclinica.org/page.php?pid=607</a>","time":1294128165,"type":"comment"},{"by":"MPSimmons","id":2058841,"parent":2057704,"text":"We are.<p>We need java developers with math backgrounds, as well as operations folks.<p><a href=\"http://www.investoranalytics.com/risk-transparency/careers\" rel=\"nofollow\">http://www.investoranalytics.com/risk-transparency/careers</a>","time":1293925489,"type":"comment"},{"by":"plnewman","id":2058697,"parent":2057704,"text":"Foster City, Ca\nRearden Commerce is hiring a devops engineer to focus on building our deployment platform, primarily in Python. For details, please contact me, my email address is in my profile.","time":1293922186,"type":"comment"},{"by":"aresant","id":2058314,"parent":2057704,"text":"In San Diego hiring full time LAMP developer for conversion voodoo, hiring Ruby contractor (20hrs a week long term). Both require in office, no remote sorry - email me via profile for details.","time":1293913459,"type":"comment"},{"by":"anonymoushn","id":2059020,"parent":2057704,"text":"imo.im is hiring software engineers, operations engineers, visual designers, marketers, and software engineering interns.<p><a href=\"https://imo.im/jobs.html\" rel=\"nofollow\">https://imo.im/jobs.html</a>","time":1293930180,"type":"comment"},{"by":"dawson","id":2106999,"parent":2057704,"text":"Cambridge, UK. Healthcare startup looking for two Ruby on Rails developers (salary plus options), see <a href=\"http://about.nhs.info/\" rel=\"nofollow\">http://about.nhs.info/</a>","time":1295100153,"type":"comment"},{"by":"thenayr","id":2102272,"parent":2057704,"text":"Las Vegas based startup <a href=\"http://www.sescout.com\" rel=\"nofollow\">http://www.sescout.com</a> is hiring web developers (PHP,HTML,CSS,etc).<p>Must be local.  Email - hiringATsescout.com","time":1294971898,"type":"comment"},{"by":"ksowocki","id":2058835,"parent":2057704,"text":"(NYC-based)<p>Ignighter is hiring PHP developers.  Both junior and senior levels.<p><a href=\"http://www.ignighter.com/jobs\" rel=\"nofollow\">http://www.ignighter.com/jobs</a> , jobs at ignighter.com","time":1293925396,"type":"comment"},{"by":"arasakik","id":2059159,"parent":2057704,"text":"A Thinking Ape is currently looking for extremely talented software developers to join our core team in Vancouver, BC, Canada: www.athinkingape.com/jobs","time":1293934187,"type":"comment"},{"by":"martian","id":2058343,"parent":2057704,"text":"Thumbtack is hiring engineers in San Francisco. <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a>","time":1293914029,"type":"comment"},{"by":"cal5k","id":2102632,"parent":2057704,"text":"Toronto<p>WEB/MOBILE DEVELOPER (we have no titles, actually, but this is the best description we could figure)<p>About us: Small company, about 15 folks, with offices in Chicago, Toronto, and Hyderabad (India). We specialize in disruptive technologies and business models, and we bring that knowledge to companies and organizations that are established and need to adapt or perish. We grew 300% last year, expecting the same this year, and this is a really exciting time to be with the company. You can feel electricity in the air around our offices.<p>We work with a variety of systems - we build pretty advanced platforms on Drupal (we're one of the only Enterprise Drupal partners in Canada), we build things from scratch with PHP/CodeIgnter, we build apps with Objective-C, etc. If you want to learn how to build wicked stuff and want to start a company somewhere down the line, this is a great place to work. Hell, you're even encouraged to work on a potential startup in your 15% time.<p>About you: Background in computer/software engineering or computer science is preferred, but we're open if you can demonstrate you know your stuff and have a nonconventional degree. We're looking for 1-2yrs experience (if you're fresh out of school get in touch anyway). Double points if you have startup experience.<p>We mostly work in PHP, but diverse language experience is a plus. It's more important that you're smart and driven than that you're a PHP expert. If you've played around with iOS development, HTML5, Python, Android dev, Facebook app dev, etc., those are all positives.<p>About the position: You'll be tasked with building important systems for interesting clients, with plenty of technical challenges and opportunities to learn as you go. You'll work in a Scrum team, primarily in PHP to start - you'll also likely learn how to build complex systems in Drupal.<p>If you're a startup guy/gal, you'll learn a lot just by being in our environment. You'll collide with amazingly smart developers, designers, analysts, and business folk - all of whom are constantly formulating new business models and thinking radical thoughts about the future. Bonus points if you like to endlessly philosophize.<p>Perks: Benefits (drug, dental, massage, etc.), 15% time (take a half day a week to build awesome stuff), relocation (if you're not located in the GTA), technical books (if you want 'em, you can have 'em), conferences, training.<p>Pay: We have a saying that goes like this: \"Hire 5 people who can do the work of 10 and get the pay of 8\". We want smart, driven developers, and we pay what it takes to get them.<p>How to apply: Email dustin (at) myplanetdigital (dot) com","time":1294981669,"type":"comment"},{"by":"JaredM","id":2064662,"parent":2057704,"text":"Nashville TN - No Remote<p>Big global company, smaller shop here in town.  C/C++ software engineers.<p>Great place to work :)<p>Shoot me an email if intersted jantix5ATgmailDOTcom","time":1294088537,"type":"comment"},{"by":"bconway","id":2061571,"parent":2057704,"text":"Sendza - central MA<p>Software engineers (any of the following: HTML/CSS/JS, PHP, Java, Python, iPhone Dev)<p>bconway - at - sendza dot com","time":1294013271,"type":"comment"},{"deleted":true,"id":2057824,"parent":2057704,"time":1293900687,"type":"comment"},{"deleted":true,"id":2059207,"parent":2057704,"time":1293935566,"type":"comment"},{"deleted":true,"id":2059203,"parent":2057704,"time":1293935442,"type":"comment"},{"by":"arn","dead":true,"id":2058682,"parent":2057704,"text":"AppShopper.com is looking for a full time PHP/MySQL developer (Remote employees welcome).  It will cover both backend/frontend maintenance as well as new features. We are a very popular App Store index and price tracker and are growing in popularity with both the website and our iPhone App.  We are trying to take it to the next level, and require additional developer resources.  We're bootstrapped and profitable.<p>AppShopper is part of a small family of websites including MacRumors.com and TouchArcade.com. If you are interested, please contact me at arn@normalkid.com.","time":1293921805,"type":"comment"},{"dead":true,"deleted":true,"id":2064419,"parent":2057704,"time":1294084219,"type":"comment"},{"dead":true,"deleted":true,"id":2064403,"parent":2057704,"time":1294083910,"type":"comment"},{"by":"dawson","dead":true,"id":2103366,"parent":2057704,"text":"I've got a small job, PSD to CSS if anyone is interested (need it done today), email in profile.","time":1295010731,"type":"comment"}]}