{"comments":[{"by":"joshu","id":2719873,"parent":2719028,"text":"Tasty Labs, Mountain View CA<p>We're building a social network designed for getting things done rather than socializing.<p>We're looking for:<p><pre><code>  * Infrastructure engineers: Python, MongoDB, Tornado, Java\n  * Product engineers: The above, plus javascript, html5, etc.\n  * Search engineer: Machine Learning, Information Retrieval, maybe some Hadoop, etc.\n  * Mobile engineer: iPhone or Android\n  * UX/Designer: strong at UX or visual design.\n</code></pre>\nTasty Labs was founded by:<p><pre><code>  * Joshua Schachter (founder of delicious)\n  * Nick Nguyen (lead for Mozilla Add-ons, previously at del.icio.us and Yahoo! Answers)\n  * Paul Rademacher (formerly TL Google Maps, built the original gmap mashup, housingmaps.org)\n</code></pre>\nWe are VC backed by Andreessen Horowitz and Union Square Ventures. We are in downtown Mountain View, so there are great lunch opportunities (good food is important to us.) We offer strong salaries and significant equity.<p>Visit us at <a href=\"http://tastylabs.com/\" rel=\"nofollow\">http://tastylabs.com/</a> or email jobs@tastylabs.com","time":1309549555,"type":"comment"},{"by":"kamens","id":2720094,"parent":2719028,"text":"Mountain View (intern, full-time, remote): Khan Academy<p>Help us change the world of education.<p><a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qd69Vfw7&#38;s=HN&#38;nl=1&#38;page=Job%20Description&#38;j=o0HMVfw8\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qd69Vfw7&...</a><p><a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qd69Vfw7&#38;s=HN&#38;nl=1&#38;page=Job%20Description&#38;j=o2DNVfw7\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qd69Vfw7&...</a>","time":1309553299,"type":"comment"},{"by":"dmarble","id":2720593,"parent":2719028,"text":"Palo Alto, CA or REMOTE (full-time preferred)<p>Looking for intermediate to advanced full-stack coders and a designer with additional skills.<p>We're just days from launching a restricted beta of our unique idea in the groups and events space, and are planning on launching our real-time product on the web, mobile web, and native mobile to a wide audience in a month or two. Our dev team is all remote right now, but it'd be great if you were local to the peninsula or willing to relocate at some point in the coming months.<p>We've built a real-time stack of our own that bridges backbone.js &#60;-&#62; socket.io &#60;-&#62; gunicorn+gevent (through nginx) &#60;-&#62; django. As the stack matures, we may release the source. The web application is nearly all single-page architecture. We use coffeescript pretty much everywhere, including our javascript tests.<p>* backend: postgres, redis, python, django, gevent + gunicorn<p>* frontend: coffeescript, jQuery, backbone.js, socket.io, compass<p>I'm looking for:<p>1. Advanced web jacks-of-many-trades. You know a lot about several things from above and have at least tried your hand at a demo app using the rest. Backend/frontend/deployment. We'll be growing our user base very soon and will need some deployment automation skills (chef or puppet + fabric) and knowledge/experience scaling the above technologies. Note: we have a great lead architect right now, but are on the lookout for locals (or those who can move to the bay) who want senior developer ownership and can be mentors/leaders as we move towards having more of a local presence.<p>2. Talented web app designers (referrals would also be good). Even with the nifty tech we're building, our app will probably live/die based on making an intuitive UI with fun and easy experience. There are several unique challenges in this product that require novel widgets -- creativity is a must. Would be great if you have more than just design skills, but very high quality design is more important than ability to build it.<p>gmail - davidmarble","time":1309563688,"type":"comment"},{"by":"bkudria","id":2719476,"kids":[2719492],"parent":2719028,"text":"San Francisco, CA - Yammer<p>Yammer is a cool tech startup masquerading as an enterprise software vendor. We're building an enterprise social network (think Facebook, but for your company. Also, better.) and we need your help. We build our product with insight and wisdom gained from the consumer social networking space, but we charge enterprise prices (and our customers pay them!) We're fighting some big serious competitors (Salesforce/Chatter, Jive, and VMWare/Socialcast) and this space has never been more exciting. Yammer is really changing the way people get work done. We have real challenges to overcome and we're doing our best to make a kick-ass product that makes our users happy.<p>Tech we use: Ruby/Rails, Scala, and Node/JS. We have Obj-C and C# stuff too.<p>Some bullet points for you to skim:<p>• Amazing group of smart engineers to work with. Really.<p>• We hack in Ruby/Rails, Scala/Java, Javascript/JQuery/Node.js/Adobe AIR, Obj-C for iOS, and some MSFT/Sharepoint stuff.<p>• Competitive compensation. Enough said.<p>• Delicious catered lunch and dinner daily, with a 3PM snack cart. (Really.) Also a fully-stocked beer-and-beverage fridge.<p>• Fancy Apple hardware of your choice (you can have a PC if you really want one.)<p>Some links for you to read more:<p>• Our jobs page: <a href=\"https://www.yammer.com/jobs\" rel=\"nofollow\">https://www.yammer.com/jobs</a><p>• Our Engineering blog: <a href=\"http://eng.yammer.com/\" rel=\"nofollow\">http://eng.yammer.com/</a><p>• A video of a talk given by Coda Hale and Ryan Kennedy about how we use Riak at Yammer: <a href=\"http://blog.basho.com/2011/03/28/Riak-and-Scala-at-Yammer/\" rel=\"nofollow\">http://blog.basho.com/2011/03/28/Riak-and-Scala-at-Yammer/</a><p>• A blog post about why it's so awesome to work here: <a href=\"http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.html\" rel=\"nofollow\">http://eng.yammer.com/blog/2011/5/31/shameless-recruiting.ht...</a><p>Feel free to get in touch: bkudria@yammer-inc.com","time":1309544060,"type":"comment"},{"by":"arram","id":2719380,"kids":[2719581],"parent":2719028,"text":"San Francisco, CA<p>ZeroCater<p>Come build a Food AI (FAI).<p>We make it easy for companies to feed their people. We generate a set of custom orders across local restaurants and automatically arrange delivery, then optimize the selections with customer feedback. Think smart playlists for food.<p>We have openings for hackers and a designer.\n<a href=\"http://www.zerocater.com/jobs\" rel=\"nofollow\">http://www.zerocater.com/jobs</a>","time":1309542907,"type":"comment"},{"by":"jvoorhis","id":2719607,"parent":2719028,"text":"Portland, OR - PHP Fog<p>PHP Fog is the leading platform-as-a-service built specifically for PHP. We have spent a lot of energy iterating on feedback from our users (over 2000 detailed surveys) to build a really great product that appeals to a large and growing user-base (over 14,000 people have signed up and growing). On top of that, we have put together a team of exceptionally talented developers. We are O’Reilly authors, open-source contributors and we enthusiastically ship code.<p>But we are growing fast, and we need your help. Want to join a winning team and have influence on the direction of an up-and-coming internet super-startup? Here are some of the benefits we provide:<p>We offer competitive compensation, and meaningful equity stake is a given.<p>We are comfortable with remote work – we are based in Portland, OR which has an awesome open-source community, but if you don’t live here already, that is ok.<p>Plenty of good developers didn’t go to college, didn’t finish college, or went to a community college – we don’t care as long as you are smart and especially if you are pragmatic.<p>We are not technology bigots: we use Ruby, PHP, Python, Bash and many other technologies internally at PHP Fog, as such we don’t care what language you are good at, we will train you in a new language if necessary to bring you up to speed with our tech stack.<p>Instead of listing job requirements, we will instead list some of some of the technologies we use internally to get things done:<p><pre><code>  * AWS, Linux, Systems automation\n  * PHP, Ruby, Python, Erlang, Bash\n  * Mysql, Redis, Mongodb\n  * Apache, Varnish, Nginx, HAproxy\n  * Git\n  * HTML5, beautiful markup, sustainable CSS\n</code></pre>\nHere are some of the roles we are looking to fill:<p><pre><code>  * Web developer – send your resume to dev-jobs@phpfog.com\n  * Systems engineer - send your resume to systems-jobs@phpfog.com\n  * Designer – send your resume to designer-jobs@phpfog.com\n  * Support – send your resume to support-jobs@phpfog.com\n  * VP of Marketing and Sales – send your resume to marketing-jobs@phpfog.com\n  * VP of Business Development – send your resume to bizdev-jobs@phpfog.com\n</code></pre>\nIf you don’t fit one of these roles but still want to join our team, send your resume to jobs@phpfog.com and tell us why you think you are a good fit.","time":1309545674,"type":"comment"},{"by":"earthaid","id":2720100,"parent":2719028,"text":"Earth Aid - Boston, MA - Full-time Data &#38; Rails Engineers<p>Earth Aid ( <a href=\"http://earthaid.net\" rel=\"nofollow\">http://earthaid.net</a> ) was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're newly venture-backed by Point Judith Capital as well as strategic and angel investors who have built and scaled some of the most successful businesses today. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer. We have offices in San Francisco and DC, and we're now consolidating our dev team and HQ into an awesome brand new headquarters in Boston.<p>We empower households to track &#38; contextualize their electric, natural gas, and water utility usage. We value data, clarity, focus and beauty. We are looking for people who do too --- people who want to work on incredibly complex problems and come up with solutions that will change the world. We want the best and the brightest. People who work hard and play hard. People who want to make an impact. This is an opportunity to not only work with a dynamic group of people, but also the opportunity to build a platform that's revolutionizing the way we look at energy consumption.<p>To learn more about our very competitive salaries, excellent benefits, fun company culture, and small arsenal of office helicopter drones, check out: <a href=\"http://www.earthaidjobs.com\" rel=\"nofollow\">http://www.earthaidjobs.com</a>, and send us an e-mail at jobs at earthaid dot net<p>---<p>Two Highlighted Opportunities in the Boston Office -&#62;<p>Data Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change &#38; the future of energy.\nAnalytics: Use tools like mapreduce, hadoop, and AWS to drive insight into energy usage.\nPerformance: Store the world's energy data in a way that makes it easy for web engineers to create experiences on top of it.\nMaintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups.\nReliability: Build tools that make it easy to know what is happening throughout the system and that allow Earth Aid to be constantly available for our users.\nSecurity: Create an infrastructure that both allows us to be certain that our user data is safe while at the same time allow the flexibility to perform analytics and quickly iterate.<p>Ruby on Rails Engineer: Problems You'll Tackle<p>Energy Efficiency: Build a product that can have an impact on climate change and the future of energy.\nUser Growth: Create a clear and impactful experience that drives us toward many millions of users.\nMaintainability: Take what's useful from XP and agile to make sure that we're writing awesome code using practices like BDD, pair programming, and daily standups.\nProduct design: Envision and execution on product features and entirely new products.\nVisualization: Create beautiful and meaningful visualizations that impact consumer energy usage.","time":1309553430,"type":"comment"},{"by":"mattdennewitz","id":2719373,"kids":[2721051],"parent":2719028,"text":"Pitchfork (<a href=\"http://pitchfork.com\" rel=\"nofollow\">http://pitchfork.com</a>) in Chicago, IL.<p>We're looking to add a full-time developer to help build and develop Pitchfork and its affiliates. You'll work out of our Chicago office with our small dev staff, assisting with every aspect of Pitchfork and directly impacting how our three million loyal readers use the site.<p>We're looking for the devops sort, those with an interest in working on all aspects of the site. We run on Django, and lovelovelove Python. You don't have to be a Django developer, though.<p>You, and you working here:<p>- You should love music. Love it.\n- You'll come into a fast-growing, fast-paced work environment with a lot of autonomy. Being a self-starter is clutch.\n- The idea of your work reaching Pitchfork's three million readers should be exciting.\n- We have tons and tons of ideas, and pride ourselves on not letting good ideas go to waste. A big part of your job will be not only helping us implement these ideas, but contributing and implementing your own.<p>If you're interested, shoot a resume and some code examples to mattd [at] domain in first line. Feel free to hit me up with any &#38; all questions, too.","time":1309542835,"type":"comment"},{"by":"andybarton23","id":2719400,"parent":2719028,"text":"Palo Alto, CA\nQuora, Inc.<p>Quora is hiring! We're building out the core team: <a href=\"http://www.quora.com/about/team\" rel=\"nofollow\">http://www.quora.com/about/team</a> with talented engineers and product designers.<p>Open to varying levels of experience including new grads, and we're open to H1B sponsorship.<p>For more info, check out: <a href=\"http://www.quora.com/jobs\" rel=\"nofollow\">http://www.quora.com/jobs</a><p>email andy@quora.com","time":1309543173,"type":"comment"},{"by":"Aloisius","id":2719044,"kids":[2719487],"parent":2719028,"text":"San Francisco, CA<p>SeatMe is hiring! - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a>\nSeatMe is a 7 person funded, pre-launch startup based in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help!<p><pre><code>  * Objective-C engineers for iPad and iPhone development\n  * Django web developer\n  * Server engineers (especially data sync experts)\n  * Designers (web &#38; mobile)\n  * Product Manager (not on the website yet!)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a VERY competitive salary, benefits, moving costs and equity options for all full-time employees. H1B ok for senior positions.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a><p>Questions - jordan@seatme.com","time":1309538646,"type":"comment"},{"by":"flyosity","id":2719212,"kids":[2719367],"parent":2719028,"text":"Durham, NC (fulltime, remote is possible)<p>Bronto Software: awesome marketing &#38; analytics web software used by companies like Trek, Armani, Roku, Etsy, Timex and tons more. Looking for engineers to work on BIG data and BIG scalability scenarios. We use Cassandra, Hadoop, HBase and MySQL to manage over 100,000,000 data transactions a day.<p>We're a growing company (here's a news article from a few weeks ago outlining just how much we're growing... new offices, too! <a href=\"http://cl.ly/7Fj8\" rel=\"nofollow\">http://cl.ly/7Fj8</a>) and the Engineering group is filled with smart people. I'm the User Interface Architect here, come check us out.<p><a href=\"http://bronto.com/company/careers\" rel=\"nofollow\">http://bronto.com/company/careers</a>","time":1309540775,"type":"comment"},{"by":"janj","id":2719316,"kids":[2720814],"parent":2719028,"text":"San Francisco, CA<p>Help build the most popular mobile apps for the cruise vacation industry. Before you dismiss this as fluff with no technical challenges check out what we're working on. We are associating tens of thousands of Facebook ids with booked cruises across all cruise lines. Besides the obvious chat features (which will be available with the next updates) we want to let cruisers know who in their social graph will be on board with them or landing at their next port from another ship and so on. We are working with the largest port promotions provider to get our users relevant discounts at their next duty-free locations. We'll be providing lead generation and cruise search results for one of the most prestigious cruise travel agencies in the industry. These are just some of the few opportunities we wanted to say yes to right now.<p>Looking for iPhone, Android and server engineer (currently in Python). Full-time, intern, freelancer, whatever you can offer to help us get stuff done.<p>We are post launch, continuous deployment no funding (ask for details if interested). You'd be joining 1 2/3 developers and a business guy working out of a coffee shop. Your role would be as big as you'd want it to be.<p>Apply or ask questions at jobs@shipmateapp.com","time":1309542108,"type":"comment"},{"by":"shennyg","id":2719817,"parent":2719028,"text":"Los Angeles, CA - Full Time<p>SaveFans! is a high-growth, early stage company, that provides a fully-automated, turn-key platform for buyers and sellers to negotiate prices and purchase event tickets.<p><pre><code>  Job Perks\n  * Play a big role on a small team\n  * Work closely with founders and executives from some of the largest media companies in America\n  * Leave your fingerprint on a huge industry\n  * Have stock options in a company that is fixing a broken model\n  * Be the first employee for a funded start-up\n\n  Requirements\n  * Experience building web applications \n  * Experience with MVC design patterns and frameworks \n  * Demonstrated fanatical attention to detail \n  * Familiarity with source control systems (Git) \n\n  Pluses\n  * Experience with agile development processes\n  * Appreciation of software development best practices, but knows when it is important to deliver code\n  * Experience with git flow, Vagrant, Memcached, Amazon Web Services\n  * Comfortable working on the command line\n  * SQL optimization chops \n</code></pre>\n<a href=\"http://savefans.theresumator.com/apply/Iui6yk/Web-Engineer.html?source=HN\" rel=\"nofollow\">http://savefans.theresumator.com/apply/Iui6yk/Web-Engineer.h...</a>","time":1309548612,"type":"comment"},{"by":"DGutmann","id":2720064,"kids":[2721077,2720802],"parent":2719028,"text":"London/Cambridge UK\nDisruptive B2B start-up is looking for Technical Co-Founder<p>I developed a concept of a web-based platform that puts the 21st century into market research by utilising smartphone applications and their developer communities.<p>Since pitching to industry experts I have received great interest and been asked to apply to an incubator who would like to support me and a small team to develop the concept further.<p>-----------------------------------------------------<p>I'm looking for a hands-on technical co-founder who can help me turn my mock-ups into an MVP over the next three months and then on to launch and beyond. Suitable frameworks exist in open-source format, which can be built upon (up to you).<p>If you are a self-motivated developer who likes the idea of disrupting a large market then please get in contact for more information! Experience and track record of bringing a customer focused product to market and start-up experience is a huge bonus.<p>----------------------------------------------------<p>With my science background (PhD), I'm somewhat technical but I won't be an idiot and list the different technologies I think you will need. This is of course up to you and you alone will decide on the stack and direction that it takes.<p>As your partner I will be charge of product design, business development, sales and marketing. I am driven by my vision, I work extremely hard and I will do whatever it takes to take us to the next level. I also see our partnership as a great opportunity to learn more programming and to eventually contribute some code myself.<p>I can offer co-founder equity as well as a negotiable salary (based on us getting into the incubator). I am not expecting you to rush into this partnership head-on. If you are also doing some freelance work on the side (etc.), I am flexible enough to work around that until we have pocketed the incubator funding.<p>If you are a cool dude and you want to know more then contact me at dapgutmann@gmail.com","time":1309552754,"type":"comment"},{"by":"lovitt","id":2720267,"parent":2719028,"text":"Washington DC, New York City, or remote.<p>SB Nation is a media/technology startup. You might have seen us discussed on HN as the new home of former Engadget editors Josh Topolsky, Nilay Patel, and friends.<p><a href=\"http://joshuatopolsky.com/post/4327161218/this-is-my-next-project\" rel=\"nofollow\">http://joshuatopolsky.com/post/4327161218/this-is-my-next-pr...</a><p>We're hiring Ruby developers and operations engineers:<p><a href=\"http://www.sbnation.com/jobs/developer\" rel=\"nofollow\">http://www.sbnation.com/jobs/developer</a><p><a href=\"http://www.sbnation.com/jobs/ops_engineer\" rel=\"nofollow\">http://www.sbnation.com/jobs/ops_engineer</a><p>Today, we run a network of 300+ sports news sites &#38; communities. This Fall, we're launching a consumer technology news site led by our new and awesome team of tech journalists. We have a lot to figure out in the meantime. We need your help.<p>Our investors include Accel Partners, Allen &#38; Company, Comcast Interactive Capital, and Khosla Ventures. We get around 22 million unique visitors every month.<p>Some press:<p>* Team From Engadget Makes Jump to SB Nation <a href=\"http://www.nytimes.com/2011/04/04/business/media/04carr.html\" rel=\"nofollow\">http://www.nytimes.com/2011/04/04/business/media/04carr.html</a><p>* Why sports is driving innovation in journalism: <a href=\"http://markcoddington.com/2010/10/08/why-sports-has-taken-the-lead-in-newsroom-innovation/\" rel=\"nofollow\">http://markcoddington.com/2010/10/08/why-sports-has-taken-th...</a><p>* Harvard's Nieman Journalism Lab: <a href=\"http://www.niemanlab.org/2010/06/sb-nation-ceo-on-how-were-fans-of-teams-not-sports-t-v-shows-not-t-v-and-what-that-means-for-news/\" rel=\"nofollow\">http://www.niemanlab.org/2010/06/sb-nation-ceo-on-how-were-f...</a>","time":1309556459,"type":"comment"},{"by":"trefn","id":2719133,"parent":2719028,"text":"San Francisco, CA<p>Mixpanel (YCS09) is looking for amazing engineers to help us scale to enormous amounts of data. We're still very small (7) and we're building some exciting stuff.<p>Looking for:<p><pre><code>  * generalist software engineers\n  * frontend/backend specialists\n  * director of operations engineering\n  * solutions architect (support/marketing/sales)\n</code></pre>\nCheck out <a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a> to apply","time":1309539776,"type":"comment"},{"by":"snowmaker","id":2719933,"parent":2719028,"text":"San Francisco, CA<p>Scribd (social publishing, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.  We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript<p>* iOS<p>* Android<p>* Machine Learning / Data mining kinds of problems<p>* Technical recruiting (yes, we're hiring hackers to do this too!)<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.<p>We're well funded and have a really fun office environment (go-karts + a zipline!).  We've got flexible hours, a very flat organizational structure that gives a lot of product ownership to engineers, and a really terrific team.<p>Feel free to email me directly: jared@scribd.com<p>Jared<p>ps.  H1B no problem","time":1309550566,"type":"comment"},{"by":"jorgeortiz85","id":2719352,"kids":[2719906],"parent":2719028,"text":"New York, NY &#38; San Francisco, CA - Foursquare<p>We're hiring Android and Blackberry developers, data analysts and data scientists, software engineers, and software engineer interns.<p>We're changing the way people interact with the world around them, we have troves of data about where people go and what they do, and we build a mobile app that millions love. If you want to come help us build the future of location products, let us know through our jobs page:<p><a href=\"https://foursquare.com/jobs/\" rel=\"nofollow\">https://foursquare.com/jobs/</a><p>If you have any questions, feel free to email me: jorge@foursquare.com","time":1309542550,"type":"comment"},{"by":"jbapple","id":2720803,"parent":2719028,"text":"Eugene, Oregon - fulltime - noremote - H1B applicants welcome<p>On Time Systems is a small company that specializes in solving large-scale search and optimization problems. We used to be a research lab at the University of Oregon, but we are now more focused on writing software than writing grant proposals. We're currently looking for software engineers to work on Green Driver (a smartphone app that uses real-time data from traffic signals to help drivers find the fastest route (<a href=\"http://imagreendriver.com)\" rel=\"nofollow\">http://imagreendriver.com)</a>) and ACFP (Advanced Computer Flight Planning), the flight planning system used by the US Air Force for routing cargo planes and tankers worldwide.<p>Although our core IP is in optimization, bringing these solutions to market requires complex client-server applications with challenging network, user interface, and database components. We have code written in Python, Java, C, C++, Objective-C, and other languages. An ideal candidate will have a strong background in algorithms and will be comfortable writing both high-level and low-level code.<p>Benefits include: medical and disability insurance, 401Ks with matching, sabbaticals, massages, a game room (ping pong, billiards, DDR, etc.), relocation package, pick your own hardware, your own office with a window, tuition reimbursement (including flight school if you work on our flight planning software), exercise equipment and locker room, and his and hers company bikes.<p>The work environment is friendly, informal, and intellectual.<p>Send your resume to jobs+hackernews@otsys.com","time":1309571625,"type":"comment"},{"by":"willowgarage","id":2719052,"parent":2719028,"text":"Palo Alto, CA<p>Do you like robots?<p>Suitable Technologies is a startup working to create an innovative new product for something called \"remote presence.\"  (Another common term is \"robotic telepresence.\")<p>Our first product, in development now, is similar to video chat on a computer you can drive around.  Unlike videoconferencing, you’re not stuck to a wall or desk.  It becomes your physical presence, anywhere in the world, with the freedom to move and interact with people as if you were there.<p>We're looking to fill a number of roles:<p><pre><code>  * Software Engineer (especially C++)\n  * Mechanical Engineer\n  * Electrical Engineer\n  * UI Designer\n  * Graphic Designer\n  * Supply Chain Manager\n  * Quality Test Engineer\n</code></pre>\nMore information is available on our site: \n<a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a>","time":1309538752,"type":"comment"},{"by":"wehriam","id":2720279,"kids":[2720322],"parent":2719028,"text":"Distributed team, East Coast seeks Python generalists.<p>HiiDef, Inc is a consumer web company with two rapidly growing properties, <a href=\"http://flavors.me/\" rel=\"nofollow\">http://flavors.me/</a> and <a href=\"http://goodsie.com\" rel=\"nofollow\">http://goodsie.com</a><p>Help us solve the challenges that revolve around top notch user experiences. We're continually building new products and features, scaling infrastructure, and responding to our enthusiastic customers.<p>Team members have flexible hours, top notch hardware, and experienced, talented co-workers invested in their success. We pride ourselves on a results oriented, laid back culture and seek people who can thrive with an exceptional amount of independence.<p>Please contact me directly at johnwehr@hiidef.com","time":1309556850,"type":"comment"},{"by":"lamby","id":2720273,"parent":2719028,"text":"London, England.<p><a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a><p>Small (7) startup in the gaming space looking for software engineers. Are you the one? You are, if you:<p>* Love agile development, working independently on your own challenges, and together in a team on the bigger vision<p>* Are completely fluent in a scripting language such as Python, Perl, PHP or Ruby and have experience with web frameworks and the MVC concept. We don't require fluency in our current technology stack - great programmers can pick up new technologies.<p>* Have used MySQL or PostgreSQL extensively and you know your way around Apache, nginx or other server. It's a bonus if you have good JavaScript skills (we use jQuery)<p>* Get excited by the idea of scaling web apps to millions of users<p>* Are the best developer in your peer group, and want to be at a place where you are constantly challenged and pushed to become better<p>* Get obsessed about the problem you're solving and don't stop until you've cracked it<p>* Have a thirst to learn new skills and technologies, and can pick things up easily<p>* Want to have fun building lots of new features and get stuff done<p>* Are full of positive energy, relish the thought of being part of a small, fast-moving team and enjoy brainstorming about new ideas","time":1309556618,"type":"comment"},{"by":"squirrel","id":2719314,"kids":[2720746,2719374],"parent":2719028,"text":"London (UK) and Boston (US). H1B<p>We're a 90-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're hiring developers and other smart folks of many kinds. See <a href=\"https://dev.youdevise.com\" rel=\"nofollow\">https://dev.youdevise.com</a> and <a href=\"http://www.youdevise.com/careers\" rel=\"nofollow\">http://www.youdevise.com/careers</a>.<p>While we don't have remote workers, we do help successful candidates relocate to London or Boston including arranging visas where needed. For example, last year we hired HN readers from Denmark and the US, and we moved a Polish employee to Boston.","time":1309542092,"type":"comment"},{"by":"markbao","id":2719178,"parent":2719028,"text":"Onswipe - New York City, NY - INTERN + H1B + Full-time<p>Onswipe's working on making touch and tablet publishing easy and beautiful, by taking existing content sources and formatting them for touch devices. We've got a number of positions open in New York City.<p><pre><code>  * Frontend touch interface developer with HTML5/Javascript experience\n  * Frontend user interface engineer with CSS3 experience\n  * Data Scientist for looking at our data and making sense of it\n  * Lead PHP engineer for advertising operations\n  * Lead Node.js engineer for backend operations\n  * Senior PHP engineer for myOnswipe and our publisher dashboard\n  * Touch interaction UX designer\n  * Systems administrator\n</code></pre>\nWe're a launched, funded startup in the heart of New York City with about 10 people. The culture here is really important and we make it a high priority. We've got great people working to make the web more awesome on the tablet, and we're looking for more.<p>Apply online - <a href=\"http://blog.onswipe.com/jobs\" rel=\"nofollow\">http://blog.onswipe.com/jobs</a><p>Any questions, do let me know. mark@onswipe.com","time":1309540404,"type":"comment"},{"by":"desiree","id":2720583,"kids":[2720705],"parent":2719028,"text":"SF, Full-Time, RoR Web Dev: Grubly!<p>Grubly connects people who love to cook with people who love to eat. On a very high level, we're like an Airbnb for food.<p>Check out <a href=\"http://www.gogrubly.com/jobs/\" rel=\"nofollow\">http://www.gogrubly.com/jobs/</a> and email Des@gogrubly.com for more information.<p>Come meet other Rails developers for a delicious night of Ruby on SNAILS! Yep-- escargot! There's a first time for everything! To reserve a spot at the table go to\n<a href=\"http://gogrubly.posterous.com/ruby-on-snails\" rel=\"nofollow\">http://gogrubly.posterous.com/ruby-on-snails</a>.","time":1309563561,"type":"comment"},{"by":"sciurus","id":2719626,"parent":2719028,"text":"Athens, GA<p>EuPathDB is looking for a front-end web developer to help scientists perform dynamic computational experiments on genomic-scale datasets. You'll get to work on innovative interfaces like our strategies system (description: <a href=\"http://bit.ly/ko0Y4b\" rel=\"nofollow\">http://bit.ly/ko0Y4b</a> , source code: <a href=\"http://bit.ly/mUyL3D\" rel=\"nofollow\">http://bit.ly/mUyL3D</a>).<p><a href=\"http://www.ugajobsearch.com/applicants/Central?quickFind=57355\" rel=\"nofollow\">http://www.ugajobsearch.com/applicants/Central?quickFind=573...</a>","time":1309545969,"type":"comment"},{"by":"spulec","id":2719781,"parent":2719028,"text":"New York, NY - Yipit<p>Just off raising $6 million, we are looking for our 8th member of the team. Come join us on the ground floor of one of the best startups in New York. Right now, great companies like 10Gen, FourSquare, Hunch, SeatGeek, and YCharts are all here growing together. Silicon Alley is going through a renaissance and you can be part of it.<p>-UI Lead Architect: Our interface sits on top of over 350 daily deal services and is used by hundreds of thousands of people. We need you to own that interface.<p>-HTML5/CSS3/jQuery Developer: All user-facing activity relies on these technologies. We will commit the full resources of the team to supporting you.<p>-Python(Django) Developers: We work with the latest technology including: Amazon Web Services, RabbitMQ, Gunicorn, Nginx, and Git. This should excite you.<p>Go to <a href=\"http://yipit.com/about/jobs/\" rel=\"nofollow\">http://yipit.com/about/jobs/</a> to apply. Email steve@yipit.com with any questions.","time":1309548050,"type":"comment"},{"by":"markmsmith","id":2719586,"parent":2719028,"text":"Raleigh, NC<p>Rally Software<p>We are hiring for both entry-level and senior software engineer positions.  Rally provides an application lifecycle management suite focused on Agile methodologies and delivered as a SaaS web application.  What this translates to day-to-day is exciting &#38; innovative full-stack development, playing with the latest technologies and embracing the challenges of developing a multi-tenant app at  scale.\nOur technology stack currently includes Groovy, Grails, Javascript (ExtJS), Oracle, MongoDB &#38; Git, but we're also interested in Coffeescript, SASS/LESS and NodeJS.<p><a href=\"http://www.rallydev.com/careers/available_positions/?category=Engineering\" rel=\"nofollow\">http://www.rallydev.com/careers/available_positions/?categor...</a><p>We offer competitive salaries, have our own kegerator and regularly play Left 4 Dead &#38; Team Fortress 2 at the end of the day.  If this sounds like your kind of place, please get in touch.","time":1309545444,"type":"comment"},{"by":"SoftwareMaven","id":2720123,"parent":2719028,"text":"Orem, Utah - Remote<p>ClickLock wants to put you in control of securing your data on the Internet. We have a plan to get there and funding to make it happen.<p>We believe strongly in customer development and in staying very lean. We are using Erlang, CouchDB, and JavaScript on the back end and lots of things on the front end, since we will need web, desktop, and mobile clients.<p>We are currently looking for two engineers, one for the front end and one for the back end. I'm looking for intelligent, motivated people and am not interested in buzzword bingo on a resume.<p>These are employees three and four in the company and include equity! If you are especially passionate about helping people secure their online lives, I am fully accepting of remote workers. Send your resume/interesting projects/GitHub page to travis -at- clicklock -dot- com.","time":1309553799,"type":"comment"},{"by":"robobenjie","id":2719646,"parent":2719028,"text":"Mountain View, CA -Anybots Inc<p>Taking over the world with robots. Starting with mobile telepresence.\nWe are a very small team (around 10 people) but have already started shipping our product and are deep into developing the next version as well as pushing new features out to deployed robots.<p>Hiring: back and front end developers (we use Node/JS on the site)<p>General Hackers (we use python and c++ on the robot and C in the embedded boards)<p>email jobs@anybots.com","time":1309546248,"type":"comment"},{"by":"picardo","id":2719399,"parent":2719028,"text":"Patch Labs - New York, NY<p>Platform Engineer (Full time)<p>Patch Labs (<a href=\"http://labs.patch.com\" rel=\"nofollow\">http://labs.patch.com</a>) is building new ways to make life easier for you and your neighbors.<p>About you<p>* You’re smart, and make it happen<p>* You love being part of a small team that solves big problems<p>* You’re pragmatic when architecting solutions to real world challenges<p>* You’re informed by both well established and emerging approaches to solving big problems<p>* You keep the end user in mind, and appreciate the value of developing useful software that scales<p>* You’re Agile where it makes sense, but always sensible, clever and hard-working<p>As a founding member of Patch Labs, you will work closely with a front-end engineer, user experience designer and product manager to create really useful, intuitive software. Specifically, you will:<p>* Architect, build and ship highly-scalable systems, libraries, and frameworks<p>* Code using primarily modern languages (Scala, Clojure, Ruby, etc.)<p>Requirements<p>* Passion for building software that makes life easier<p>* An understanding of the challenges involved in building popular applications at web scale<p>* BS, MS, or PhD in Computer Science or equivalent work experience<p>Ideal experience:<p>* NoSQL solutions (MongoDB, Cassandra, CouchDB, etc.)<p>* Search relevance solutions (scoring functions, query classification, text normalization, etc.) and technologies (Lucene-based, Real-Time search, etc.)<p>* Cloud based services and hosting (AWS EC2, etc.)<p>* Developing APIs and Web Services<p>* Consuming interesting APIs (Twilio, GroupMe, Venmo, Foursquare, Twitter, etc.)<p>* Geo-location, geometry and mapping<p>* Natural Language Processing (NLP)<p>* Mobile development<p>* Open source projects<p>* Comfort with Git<p>What We Offer<p>* A driven, motivated, and talented team that believes in working hard and reaping the rewards<p>* Laid-back office environment in the heart of SoHo<p>* Competitive compensation and excellent benefits<p>Apply: labs@patch.com","time":1309543155,"type":"comment"},{"by":"mindcrime","id":2720713,"parent":2719028,"text":"Chapel Hill / Research Triangle Park, NC<p>Fogbeam Labs<p>Seeking technical and/or non-technical co-founder(s).<p>At Fogbeam Labs, we like to think of ourselves as \"The Next Great Open Source Software Company.\"  We're building awesome information retrieval and knowledge management systems (all open-source, ALv2) using Groovy, Grails, Scala, Java, and many existing open-source tools and libraries:  Lucene, Solr, Mahout, UIMA, OpenNLP, Jena, Droids, Roller, Camel, etc.<p>If you have a passion for open-source software, and are particularly interested in information retrieval, machine-learning, AI, and want to be part of a company that's pursuing a proven business model (selling software to other businesses, for, like, actual money), and want to get in early and become an actual co-founder (with a corresponding equity stake), ping me.<p>NOTE:  Not funded yet, and the current founder (mindcrime) is still working a day job, so another co-founder would not be expected to commit any more than I am... So, basically, 20-30 hours a week (including weekends) until we reach a point where we can pay salaries.  Yeah, we're talking about being a <i>founder</i> here, not an employee.<p>2nd NOTE:  This is not just a pipe-dream or a hobby project, despite the day-job thing. I've just had an excellent customer discovery interview with a very large and well-known bank headquartered here in NC, and they were <i>very</i> responsive to what we're working on.  This and the Customer Discovery we've been doing the past few months strongly suggests that there is real demand for the kind of stuff we'll be doing; and Red Hat (if not others) have proven the open source model.  See, for reference:<p><a href=\"http://www.bloomberg.com/news/2011-06-23/red-hat-sales-to-triple-to-3-billion-in-five-years-ceo-whitehurst-says.html\" rel=\"nofollow\">http://www.bloomberg.com/news/2011-06-23/red-hat-sales-to-tr...</a><p>fogbeam (at) gmail (dot) com","time":1309567673,"type":"comment"},{"by":"nathanh","id":2720329,"parent":2719028,"text":"New York, San Francisco, and Silicon Valley<p>Hirelite is on a mission to put recruitment agencies out of business. We host speed interviewing events over video chat to connect companies and developers directly. We have two upcoming events:<p>For jobs near NYC on 7/13 - Companies participating so far: Findings, Work Market, Etsy, JWed, Hyperpublic, Rent The Runway, Recombine, Yipit, TheLadders, IndustryGraph<p>For jobs near SF/Silicon Valley on 7/12 - Companies participating so far: Moblyng, AdRoll, Wikia, IndieGoGo, Breezy<p>If you're interested in participating as a developer, sign up at <a href=\"https://www.hirelite.com/events\" rel=\"nofollow\">https://www.hirelite.com/events</a>","time":1309557933,"type":"comment"},{"by":"jacoblyles","id":2719453,"parent":2719028,"text":"Palo Alto, CA - Game Closure Inc.<p>JavaScript gaming engineers and networking engineers.<p>Game Closure is using HTML5 technology to revolutionize the social mobile gaming market. With Game Closure, you can use HTML5 to make beautiful games today that run on popular mobile devices and in the browser with no changes to the code.<p>Game Closure values deep engineering skill and a history of execution. If you're an expert in JavaScript, iOS or Android, or real-time networking then we would love to look at your portfolio.<p>We're funded and growing rapidly. We offer full salary and benefits. This is an exciting time to be part of Game Closure.<p>email jobs@gameclosure.com","time":1309543732,"type":"comment"},{"by":"jonbischke","id":2720325,"parent":2719028,"text":"San Francisco, CA (SOMA)<p>RG Labs is hiring: <a href=\"http://www.rglabsinc.com/jobs\" rel=\"nofollow\">http://www.rglabsinc.com/jobs</a><p><i>We operate under the premise that the most important decisions we make are decisions about people (e.g., who to start a company with, who to hire, who to date/marry...)<p></i>We also feel like the Web is in its infancy in terms of helping us to make better decisions based on data and that this space could explode in coming years.<p>*We'd like to be part of that explosion. :)<p>To hear more drop me a line directly at jonbischke at gmail or send us via our contact form. We'd love to tell you more.","time":1309557807,"type":"comment"},{"by":"svec","id":2720083,"parent":2719028,"text":"Boston, MA.<p>Ember is hiring embedded software engineers and QA engineers in Boston: <a href=\"http://www.ember.com/company_careers.html\" rel=\"nofollow\">http://www.ember.com/company_careers.html</a><p>We develop the chips, software, and tools for wireless sensor networks, and we have a ton of fun doing it.<p>We were just voted one of the top places to work in Boston: <a href=\"http://www.bizjournals.com/boston/news/2011/05/03/bbj-announces-best-places-to-work.html\" rel=\"nofollow\">http://www.bizjournals.com/boston/news/2011/05/03/bbj-announ...</a><p>Email me if you’re interested: hnjuly2011@saidsvec.com","time":1309553080,"type":"comment"},{"by":"shantheman","id":2719517,"parent":2719028,"text":"Durham, NC - Spring Metrics<p>We're making web Analytics much, much more interesting and useful.<p>Ruby on Rails dude/dudet, with a healthy serving of HTML/CSS/JS/jQuery and the likes.  If you've got back-end skills too, all the better.<p><a href=\"http://www.springmetrics.com/jobs\" rel=\"nofollow\">http://www.springmetrics.com/jobs</a>","time":1309544494,"type":"comment"},{"by":"wrs","id":2720808,"parent":2719028,"text":"Seattle (or San Francisco) - Product/UX Designer<p>Picture of Health makes tools that help people take care of their loved ones. We are well-funded, self-funded, pre-launch, and small (4 in Seattle, 2 in SF). This is an opportunity to be in the first wave and help define how we do things.<p>We're looking for a product designer who will own design for our web and device software products. We're building consumer services, and having the right design will be critical to our success. This person needs to make sure our products are simple, usable, and successful at solving problems for people. We're primarily looking for interaction design skills, but visual design ability and/or front-end prototyping ability would of course be a plus.<p>The current dev team is me plus three former Hashrocketeers in downtown Seattle. Our stack is Rails; our process is story-based, test-driven, and design-respectful. (We'd love to hear from great developers as well if you're interested -- see <a href=\"http://vurl.me/AZHL\" rel=\"nofollow\">http://vurl.me/AZHL</a>)<p>We'd prefer to keep the dev/design team in Seattle for now, but we could bend this rule for an exceptional person who wants to be in SF.<p>Misc. company facts: My co-founder used to be CEO of Sun Microsystems. We have competitive salary, equity, and benefits. Our Seattle office is in the South Lake Union area. Dogs are welcome. (More facts on request.)<p>Apply: <a href=\"http://vurl.me/BMFE\" rel=\"nofollow\">http://vurl.me/BMFE</a>","time":1309571719,"type":"comment"},{"by":"ksowocki","id":2720311,"parent":2719028,"text":"New York NY - INTERN + FULL TIME PHP Devs @ Ignighter.com<p>Ignighter is the largest and fastest growing group dating site in the world. Ignighter, a 2008 TechStars company, was founded with the vision of revolutionizing the way that twenty-somethings use the Internet to date. Through its group dating model, Ignighter provides a safer, less awkward, more fun approach to online dating. Since its launch, Ignighter has been featured in numerous national publications and media outlets including the NY Times, the Wall St. Journal, NBC, CNBC, Bloomberg TV, the Washington Post, The Philadelphia Inquirer, and Inc Magazine.<p>Ignighter has millions of registered users and is growing by hundreds of thousands of new members each month across the globe. Ignighter just closed on a Series A financing comprised of leading VC funds and angels in the US and India. The company is headquartered in NYC and will soon be launching an office in India.<p>Ignighter was voted \"Best Startup in NYC to work for\" by the management team of the company. Yes, you read that right. And we won in a landslide. We're a small team with big plans for growth in the coming years. As a critical member of our small team, your contributions will be highly impactful. We value our company culture and hope that our future hires will contribute to our hard-working, but fun-loving office atmosphere.<p><a href=\"http://www.ignighter.com/jobs\" rel=\"nofollow\">http://www.ignighter.com/jobs</a>","time":1309557533,"type":"comment"},{"by":"kevbo","id":2734443,"parent":2719028,"text":"Evanston, IL<p>Junior Python Engineer at Leapfrog Online<p>We're the leading independent digital direct marketing firm in the country, developing programs for Fortune 500 marketers to find and convert the right customers. We stake our business directly on the success of our products, our Clients’ business results, and ultimately, their satisfaction.<p>We offer a competitive salary plus an incentive and benefits package; a close-knit team who likes what they do and has fun doing it; and, if that’s not enough, there’s free all-you-can-drink soda, and free bagels on Fridays.<p>We're looking for a junior-level Python Developer to join our Test Engineering team, writing functional, integration, and unit tests in Python for our Django-powered business platform. As part of the Ops team, we also do light system administration and help write monitoring tools.<p>Requirements: an intense attention to detail, a love of learning, a passion for problem-solving, and a good attitude and sense of responsibility. You should also have experience with a dynamic language such as Python, Ruby, or PHP; be comfortable working on a *nix command line; and have general knowledge about HTML, CSS, and JavaScript.<p>We're committed to agile and open source; we use packages like mechanize, twill, Selenium, nose, and PyQT every day.<p>If you think you're a good fit for this position, apply with your resume and salary history. kboers (at) leapfrogonline.com","time":1309967596,"type":"comment"},{"by":"jnovek","id":2719434,"parent":2719028,"text":"OwnLocal in Austin, TX<p>Working through newspapers, we make the web less scary for small businesses.<p>We're hiring:<p>- Ruby systems engineer (<a href=\"http://ownlocal.com/company/jobs/ruby-systems-engineer/\" rel=\"nofollow\">http://ownlocal.com/company/jobs/ruby-systems-engineer/</a>)<p>- Web UI Designer (<a href=\"http://ownlocal.com/company/jobs/web-designer/\" rel=\"nofollow\">http://ownlocal.com/company/jobs/web-designer/</a>)<p>We're also interested in talking to interns who want to pick up Rails.","time":1309543515,"type":"comment"},{"by":"julesbravo","id":2720429,"parent":2719028,"text":"Columbus, OH (full-time, remote): SearchSpring<p>We're a small boot strapped team (profitable) working on the future of e-commerce search. We provide a search service to internet retailers that is second to none.<p><a href=\"http://searchspring.jobscore.com/jobs/searchspring/front-end-web-developer/dGCFWGxbyr4l27eJe4bk1X\" rel=\"nofollow\">http://searchspring.jobscore.com/jobs/searchspring/front-end...</a><p><a href=\"http://www.searchspring.net\" rel=\"nofollow\">http://www.searchspring.net</a>","time":1309559928,"type":"comment"},{"by":"lpolovets","id":2719512,"kids":[2720646,2719982],"parent":2719028,"text":"Los Angeles or Bay Area or Shanghai preferred, but remote work is a definite possibility. Full-time only. If you're interested in remote work, you must live in the U.S. (U.S. citizen living outside of the U.S. <i>might</i> be okay)<p>Factual aims to be the place where people meet to share, improve, and mash-up data. Our vision is to be an awesome and affordable data provider for startups and developers, so that they can focus on innovation instead of data acquisition.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). We recently raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, SimpleGeo, and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>Ideally you know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p><a href=\"http://www.factual.com/jobs\" rel=\"nofollow\">http://www.factual.com/jobs</a><p>You can also email me personally at leo -at- factual.com","time":1309544453,"type":"comment"},{"by":"rmorrison","id":2719617,"parent":2719028,"text":"Comprehend Systems (YC W11), Palo Alto CA<p>We're revolutionizing health care and databases!  You can read more about the position here:<p><a href=\"http://www.comprehend.com/about_careers.html\" rel=\"nofollow\">http://www.comprehend.com/about_careers.html</a>","time":1309545829,"type":"comment"},{"by":"boha","id":2720101,"parent":2719028,"text":"San Francisco, CA<p>Localmind<p>Funded, early startup building awesome realtime, location-based Q&#38;A, with lots of fun stuff in the pipeline.<p><a href=\"http://www.localmind.com/jobs\" rel=\"nofollow\">http://www.localmind.com/jobs</a><p><pre><code>  1) UI/UX Design Lead\n  2) Android Developer\n  3) Community Development Director\n</code></pre>\nI <i>personally guarantee</i> that you will love working with us. How's that for a benefit?","time":1309553477,"type":"comment"},{"by":"jakehow","id":2730520,"parent":2719028,"text":"New York, NY (full-time)<p>Zipmark (<a href=\"http://zipmark.com\" rel=\"nofollow\">http://zipmark.com</a>) is building mobile and alternative payments infrastructure that gives individuals and businesses direct control over their checking accounts, enabling them to transfer funds, pay bills, and settle debts without complex fees, or intermediary stored value accounts.<p>We are looking for:<p>* Full Stack Engineers: We have a diverse set of problems to solve and accordingly work with many technologies: Javascript, Ruby, JVM, Objective-C, Redis, Risk analytics and ML, etc.<p>* UX/Design: We value designers who can build beautiful applications and can actually do work in this medium.  Like a painter or photographer should understand the chemistry of their medium, you should be fluent in the tools of this one. To us that means: HTML5, CSS, JS, Interface Builder, working with templating languages, source control(GIT), etc.<p>Interested? Send us a note: hello@zipmark.com<p>Please, no 3rd party recruiters or outsourcing firms.","time":1309883970,"type":"comment"},{"by":"e1ven","id":2719395,"parent":2719028,"text":"Waltham, MA-<p>We're looking for an Affiliate manager (and any Mongo Experts) here near Boston.<p>If you're a Mongo DBA, and want to work with large and growing datasets, scaling to multi-shard, multi replicaset servers,  I'd love to talk with you.<p>For the Affiliate-\nSavingStar is searching for a star to help take our revolutionary startup to the next level in an important role. We're seeking an experienced affiliate manager (3-5 years experience) to help us revolutionize the grocery coupon industry. As the only national paperless grocery coupon service, we're poised for amazing growth. We want you to help grow our user-base and revenue by recruiting top publishers, monitoring and consulting with publishers to optimize SavingStar's promotion on blogs and websites, and tracking and forecasting affiliate program revenues. Opportunities for amazing growth don't come around too often. This is one of them. Please apply if you have demonstrated past success managing affiliate programs.<p>E-mail me. cdavis@savingstar.com","time":1309543084,"type":"comment"},{"by":"jpbutler","id":2719237,"parent":2719028,"text":"Practically Green - Cambridge, MA<p>We built Practically Green to provide tools, knowledge and motivation to help people make healthy, green changes in their life.<p>The first product we've built is the Practically Green website, launched in closed beta in May 2010, with an open beta last September. The site gives you an assessment quiz, helps you build an action plan to improve and gives you the tools and information to execute the change.<p>We bring in social proof (and social norms) through connections with Facebook friends, neighbors and real-life groups. Our science is rock-solid and our content is compelling. We've incorporated gamification and other behavior-change techniques gently throughout the application. We have an email component, and we're developing a mobile complement.<p>We're looking for:<p>* Director of UX\n* Senior Rails Engineers\n* Entry-Level Rails Engineers.<p>More information here: <a href=\"http://practicallygreen.com/jobs\" rel=\"nofollow\">http://practicallygreen.com/jobs</a>","time":1309541219,"type":"comment"},{"by":"GavinB","id":2719293,"parent":2719028,"text":"New York City/NYC\nArt Director/Creative Lead with experience in either web UI or game design. Video or animation experience a big plus. We build games for kids and teens and need someone who can create designs, lead branding efforts, and direct in-house and freelance designers in building out the games.<p>Send resume and link to portfolio to gbrown@scholastic.com","time":1309541878,"type":"comment"},{"by":"kemayo","id":2719999,"parent":2719028,"text":"Really REMOTE. You don't even have to be in the USA.<p>deviantART (<a href=\"http://www.deviantart.com\" rel=\"nofollow\">http://www.deviantart.com</a>) wants developers. We're fully remote; there's no central office with a devteam located there. We expect all hires to be comfortable working in PHP, JavaScript, CSS, and SQL; we like our developers to be able to hack on any part of the site, rather than being frontend/backend specialists.<p>One exception to all that: there's an Infrastructure Engineer position which is located in Vancouver. It's C++/Java focused, and involves developing backend services used by the rest of the site.<p>We post information about our development process here sometimes: <a href=\"http://dt.deviantart.com/blog/\" rel=\"nofollow\">http://dt.deviantart.com/blog/</a><p>Apply here: <a href=\"http://deviantart.theresumator.com/apply?source=hn\" rel=\"nofollow\">http://deviantart.theresumator.com/apply?source=hn</a>","time":1309551635,"type":"comment"},{"by":"dh0913","id":2720404,"parent":2719028,"text":"A Small Orange is a shared, reseller, VPS, and dedicated web hosting company based in downtown Durham, North Carolina. We have about 35 employees or so now, but we're always looking for great Linux system administrators and technical support people to join our growing team.<p>If you know about Linux and/or web hosting, we want to hear from you. We're hiring from entry level live chat support to senior system administrators, so your current skill level isn't as important.<p>All of our positions are remote, include full benefits, competitive pay, and plenty of other perks. If you're local to Durham, NC, you're also welcome to work from the comfort of our downtown office, but that's up to you.<p>You can read more about what it's like to work for A Small Orange and see our current openings here:<p><a href=\"http://jobs.asmallorange.com/\" rel=\"nofollow\">http://jobs.asmallorange.com/</a>","time":1309559493,"type":"comment"},{"by":"mtsmith85","id":2719390,"parent":2719028,"text":"New York City, New York<p>Thrillist.com, the leading men's lifestyle newsletter, is growing and needs more hands and brains to keep up with our agile, fast-paced development cycle.<p>We're looking for a PHP developer -- Junior level on up. It's a growing start up -- slowly growing into an actual company. We have our main content site, Thrillist, a flash sale site, JackThreads and our new rewards product, Thrillist Rewards. We have an amazingly smart team and a great company culture. We're working on some big updates in the coming months and some really cool internal projects, too. Our technologies are PHP, Mongo, MySQL &#38; Postgres, SOLR and Drupal &#38; CakePHP. I'm the lead developer for Thrillist and have been here almost a year and am loving every minute of it.<p>Email us at techjobs@thrillist.com if you're interested. Do me a favor and let us know you came from HN, too.","time":1309543060,"type":"comment"},{"by":"madmanslitany","id":2719613,"parent":2719028,"text":"New York City, NY - Palantir Technologies<p><a href=\"http://www.palantirtech.com/\" rel=\"nofollow\">http://www.palantirtech.com/</a><p>I haven't officially started work at Palantir yet (and will be in Palo Alto for training once I do), but Palantir is hiring engineers aggressively for its brand-new office in New York City.","time":1309545790,"type":"comment"},{"by":"josharian","id":2720436,"parent":2719028,"text":"San Francisco (Mission): card.io<p>Exciting start-up (just officially launched last week!) doing mobile payments and computer vision, seeking amazing engineers. We love generalists (but won't sniff at expertise).<p><a href=\"https://gist.github.com/821454/\" rel=\"nofollow\">https://gist.github.com/821454/</a>","time":1309559991,"type":"comment"},{"by":"ipster","id":2719251,"kids":[2719415],"parent":2719028,"text":"San Francisco / Los Angeles / NYC / Remote<p>Passionate about the outdoors? AllTrails.com is hiring front-end and back-end engineers.<p>We're the number 1 outdoors site. Founders from Google / Facebook / Microsoft. Well funded and some really exciting things in the pipeline!<p>email: justin@alltrails.com","time":1309541439,"type":"comment"},{"by":"ghotli","id":2719861,"parent":2719028,"text":"Memphis, TN – American Roamer<p>Director of Software Development<p>We are changing the way that the telecommunications industry looks at market intelligence with our in-browser spatial data analysis services. Right now our team is growing and we’re looking for a natural leader with a strong background in software engineering. You should be able to help us scale to meet the growing load on our servers and our developers by fostering an environment where quality code is shipped every day.<p>Some technologies we work with: Solr, MongoDB, PostgreSQL, Ruby, Rails, Javascript, OpenLayers, Node.js, Varnish, HAProxy, AWS, and Chef.<p><a href=\"http://www.americanroamer.com/careers/job-opportunities/\" rel=\"nofollow\">http://www.americanroamer.com/careers/job-opportunities/</a><p>email: hr@americanroamer.com","time":1309549356,"type":"comment"},{"by":"bostonpete","id":2720184,"parent":2719028,"text":"Burlington, MA - C++ software development of engineering desktop products.<p>Exa Corp (www.exa.com) is a CAE software company (primarily used for automotive design). We have a variety of positions open on our website, but I'm particularly focused on filling one spot in my group. Here's the posting:<p><pre><code>   http://exa.com/pages/company/job_postings/11_Swe_Engr_CAE_MA.html\n</code></pre>\nI manage a team of three (including me), which we're looking to grow to support our rapid growth. I hired one developer last week and am looking to add another. Note that the job description lists 5-7 years experience, but that's very flexible.<p>Shoot me an e-mail if you have any interest or want more details -- the e-mail in the posting (swppjobs@exa.com), will come to me.","time":1309555028,"type":"comment"},{"by":"calbear81","id":2720691,"parent":2719028,"text":"Mountain View, CA (Full time, H1B welcome)<p>Room 77 (www.room77.com) - hotel room search engine, Launch winner - We're looking for software engineers and UI/UX designers to help us build a better hotel search engine.  We've got massive amounts of proprietary data and a whip smart engineering team from Google, Facebook, and the usual suspects.<p>Software Engineers (multiple positions)<p>Who you are:<p>* Superstar coder, self-motivated, focused, and interested in making a big impact as an early employee of a fast-paced startup<p>* BS, MS or PhD in Computer Science or a related field<p>* Passionate about travel<p>What you’ll do:<p>* Build upon Room 77’s first public product with powerful new features<p>* Design algorithms to enable the world's fastest and most feature-rich travel search engine (primarily with C++, Javascript, PHP and Python)<p>* Revolutionize the way people travel<p>For all other positions and to learn a bit more about why you should work with us, check out our jobs page here: <a href=\"http://www.room77.com/jobs.html\" rel=\"nofollow\">http://www.room77.com/jobs.html</a><p>Engineers, hit us up at jobs+engw@room77.com.  All other positions, try jobs@room77.com.<p>Cool facts about Room 77<p>* We just secured a series B of $10M+.  Hotel search and the lodging industry is ripe for disruption and we've got a unique product, proven technology, and a team that's been around the block a few times.<p>* We launched February 2011 at the LAUNCH conference in SF and won Best Startup.  We were also Audience Favorites at the Startup Showcase at Web 2.0.<p>* We just inked our lease on the 3rd floor of a building one block off Castro in the heart of downtown Mountain view right below Tasty Labs (hi Tasty Labs!)<p>* We're backed and advised by some serious heavyweights in the industry including the founder and ex-CEOs of Expedia and Hotwire as well as by technical wizards like Rasmus Lerdorf.<p>* We are H1B friendly and relocation friendly.<p>* We work hard but we respect healthy work life balances.  We try to have fun together as well.","time":1309566805,"type":"comment"},{"by":"justin","id":2720700,"parent":2719028,"text":"We're hiring for two teams at our office in SF:<p>TwitchTV: We're looking for engineers excited about building the future of gaming video and competitive esports. We have the largest platform for gaming video on the web and are rapidly growing in a new and exciting space. Read more here <a href=\"http://www.justin.tv/jobs/jobs\" rel=\"nofollow\">http://www.justin.tv/jobs/jobs</a><p>Socialcam: We're building apps that make it fast, easy and fun for everyday users to share video from their iPhone or Android. We think smartphones will displace all other devices as the dominant form of media creation, and Socialcam will be the app people use to create that video. Read more here: <a href=\"http://socialcam.com/jobs\" rel=\"nofollow\">http://socialcam.com/jobs</a>","time":1309567329,"type":"comment"},{"by":"ahochhaus","id":2720308,"parent":2719028,"text":"Milwaukee, WI (H1B)<p><a href=\"http://careers.joelonsoftware.com/jobs#/11923/software-engineer-samegoal\" rel=\"nofollow\">http://careers.joelonsoftware.com/jobs#/11923/software-engin...</a><p>SameGoal is hiring talented software engineers who are experts in distributed systems, C++ and building world-class user-friendly products.<p>Our platform builds on top of many great technologies including:<p><pre><code>   * Mostly C++; some Python\n   * WebKit/Chromium\n   * Closure Tools\n   * Protocol Buffers\n   * LevelDB\n   * Libevent\n</code></pre>\nAdditionally, we use the following tools:<p><pre><code>   * Debian GNU/Linux\n   * Git\n   * Gerrit code review tool\n   * GYP build tool\n</code></pre>\nPlease send a resume to jobs@samegoal.com to apply.","time":1309557520,"type":"comment"},{"by":"eyao","id":2719207,"parent":2719028,"text":"San Mateo, CA (no telecommute)<p>The Playforge is hiring software engineers!<p>We make mobile social freemium games currently focused on the iOS platform. Our first game, Zombie Farm, was Apple's top grossing freemium game of 2010 and continues to remain on the top grossing charts to this day.<p>In this role you will help us design and develop the server infrastructure and game APIs to support the over 15 million players on our social games.<p>Candidates should feel comfortable with PHP, MySQL, and some javascript/css. We will be integrating Redis into our stack soon.<p><a href=\"http://theplayforge.com/jobs.html\" rel=\"nofollow\">http://theplayforge.com/jobs.html</a>\ncontact: jobs@theplayforge.com","time":1309540675,"type":"comment"},{"by":"drags","id":2719923,"parent":2719028,"text":"Verba, San Francisco, CA<p>We help college bookstores decide what to sell to students (print? rental? digital?), who to buy them from, and how much to sell their inventory for. Students get their books for less, local bookstores make more money and everyone's happy.<p>We're hiring a full-time engineer:<p><pre><code>  * Most of our stuff is built on Ruby on Rails\n  * We do a _lot_ of visualization work, so JS skills are a plus\n  * Oodles and oodles of data flow through us, so couchdb/map-reduce/basic \n    statistical knowledge could be leveraged!\n</code></pre>\n<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http://www.verbasoftware.com</a> and email me at admin@verbasoftware.com","time":1309550372,"type":"comment"},{"by":"bpuvanathasan","id":2719719,"parent":2719028,"text":"San Francisco, CA - PagerDuty<p>We are reinventing the stagnant world of IT operations software.  Want a job hacking on a product with a proven market and customers ranging in size from startups to Fortune 500s? We are PagerDuty, a 9-person startup that builds IT operations tool that reduces downtime by helping businesses reliably and rapidly respond to high-severity incidents in real time.<p>We hack using:\n - Ruby\n - Rails\n - jQuery, Backbone.js, Handlebars.js\n - MySQL\n - Linux (Ubuntu)\n - Amazon AWS (EC2, EBS, S3)\n - NGinx\n - Phusion Passenger &#38; Unicorn\n - Postfix<p>Learn more at: <a href=\"http://www.pagerduty.com/jobs\" rel=\"nofollow\">http://www.pagerduty.com/jobs</a>","time":1309547236,"type":"comment"},{"by":"klous","id":2734215,"parent":2719028,"text":"Southfield, MI<p>Full-time: Developers, Web Analytics Analysts, E-commerce Manager. Other positions: writers, business development, and news desk positions.<p>VC backed media startup, focusing on actionable trading ideas and real-time news.<p><a href=\"http://www.benzinga.com\" rel=\"nofollow\">http://www.benzinga.com</a><p>Top-Venture Backed Company Hiring Programming Experts<p>A rapidly growing media company backed by the founders of Groupon is hiring computer and programming experts to help with some enormously exciting projects.<p>Do you want solve difficult problems and build status-quo-shattering products? We are a major media company and your work will not be limited to internal problem-solving.<p>We want people who want to create major changes for the benefit of the world. Just as Groupon empowered society to save money through collective bargaining, we want to help people stay informed and connected like never before.<p>Join us for this exciting, explosive phase of growth. Use your programming skills to their full potential.<p>Some of the skills we are looking for in the developer &#38; e-commerce roles:<p>* Drupal \n* most popular contrib modules (panels, views, cck, etc.) \n* PHP \n* optimizing code \n* theming \n* worked on Drupal sites before \n* MySQL \n* Javascript \n* Git \n* Ubercart<p>If you are familiar in any of these areas, let us know. We are a fun, vibrant, high-energy team in the Michigan area, and we promise a few laughs and baked goods in addition to a very competitive compensation package with benefits!<p>Send your resume + whatever else you'd like to include about yourself. Please send to scott [ at ] benzingapro.com<p>or head here <a href=\"http://www.benzinga.com/careers\" rel=\"nofollow\">http://www.benzinga.com/careers</a> and include Attn: Scott","time":1309964934,"type":"comment"},{"by":"jdrock","id":2719363,"parent":2719028,"text":"Houston, Texas (H1B accepted)<p>80legs is building a next-generation web data platform - a service that will allow anyone to run SQL-like queries on all data available from the web.  We're looking for talented folks to help us :)<p>Positions available:<p><pre><code>  * Data Technical Lead - handling all things data, ML experience a plus\n  * UX Engineer - building a search interface for 1B+ data points\n  * SysOps Engineer - improving back-end performance of a complex infrastructure\n</code></pre>\nMore info at <a href=\"http://www.80legs.com/careers.html\" rel=\"nofollow\">http://www.80legs.com/careers.html</a>.  Feel free to email me at shion -at- 80legs -dot- com.","time":1309542674,"type":"comment"},{"by":"jsherry","id":2719263,"parent":2719028,"text":"CB Insights in New York, NY<p>Front-End Developer (Full-time): <a href=\"http://www.cbinsights.com/jobs/FrontEndDeveloper-CBInsights.pdf\" rel=\"nofollow\">http://www.cbinsights.com/jobs/FrontEndDeveloper-CBInsights....</a><p>CB Insights is a National Science Foundation-backed data company working on difficult problems \nfocused on very large markets.  Although early on in the game we are revenue generating and are \npushing the lumbering dinosaurs in our industry to the brink of extinction.  Our data is frequently \nfeatured in the media which you can see here - <a href=\"http://www.cbinsights.com/press.php\" rel=\"nofollow\">http://www.cbinsights.com/press.php</a>.","time":1309541538,"type":"comment"},{"by":"bluelu","id":2719359,"kids":[2719480,2720257],"parent":2719028,"text":"Trendiction in Luxembourg:<p><a href=\"http://www.trendiction.com/\" rel=\"nofollow\">http://www.trendiction.com/</a> <a href=\"http://blog.trendiction.com/tag/joboffer\" rel=\"nofollow\">http://blog.trendiction.com/tag/joboffer</a><p>No remote.<p>Looking for 1-2 more java developers in the field of: - distributed large scale crawling, content extraction, data analysis<p>We crawl, analyze (extract article, author, date, theme, sentiment,...) and monitor websites (news, blogs, ...) for our clients.<p>If you are interested on medium scale (cluster of &#62; 200 servers), distributed applications), feel free to contact me directly under t.britz@trendiction.com","time":1309542598,"type":"comment"},{"by":"jazzdev","id":2719431,"parent":2719028,"text":"DocuSign - San Francisco, CA &#38; Seattle, WA<p>We're the leading provider of electronic signature services \n(more than 7 of every 10 e-signatures)!<p>We are a pre-IPO company and have openings in San Francisco and Seattle for:<p><pre><code>  * Mobile Developer (iOS)\n  * PlugIn Developer (.NET, GreaseMonkey, Browser plugins)\n  * Integration Engineer (ASP.NET, C#, Web Services)\n  * QA Engineers\n</code></pre>\nYou can send your resume or questions to jd.brennan@docusign.com<p>Job descriptions for these new positions will be on our web site next week: <a href=\"http://www.docusign.com/careers\" rel=\"nofollow\">http://www.docusign.com/careers</a>","time":1309543479,"type":"comment"},{"by":"claytonm","id":2720003,"parent":2719028,"text":"Seattle, WA - Software Development Engineer<p>AWS - My team is looking for software engineers passionate about building new web services. If you’re interested in building high performance distributed systems, come join a new AWS service and influence the direction of the leading cloud provider. We have several positions for a range of experience levels. If you’re not in Seattle but are up for a change of scenery, Amazon has a great relocation program that makes it extremely easy to join AWS.<p>To apply, send your resume to aws-jobs-fast-yc@amazon.com.<p>AWS is an unique mix of startup culture/autonomy combined with the ability to leverage the incredible infrastructure of Amazon/AWS. I’ve worked in AWS for the past year and I’ve learned more in that time than I thought possible. I’m an infrastructure person at heart, and at other companies I’ve worked for, I’m always torn between doing the deep engineering that I love, or working on a more customer focused product. In AWS, they are one and the same. I like having scalability, availability, and performance as core features of the product I’m building. Another thing I love about working in AWS is the impact your work has - your service is used by thousands of developers, and those developers use your service in ways you never imagined, which are then used by millions of people.<p>Detailed job descriptions :<p><a href=\"https://us-amazon.icims.com/jobs/133388/job\" rel=\"nofollow\">https://us-amazon.icims.com/jobs/133388/job</a><p><a href=\"https://us-amazon.icims.com/jobs/137679/job\" rel=\"nofollow\">https://us-amazon.icims.com/jobs/137679/job</a><p><a href=\"https://us-amazon.icims.com/jobs/137677/job\" rel=\"nofollow\">https://us-amazon.icims.com/jobs/137677/job</a>","time":1309551697,"type":"comment"},{"by":"alexhektor","id":2734017,"parent":2719028,"text":"JDownloader - Nürnberg (Bavaria, Germany) - full time:<p><a href=\"http://wemakeyourappwork.com\" rel=\"nofollow\">http://wemakeyourappwork.com</a><p>Who you'll be a part of:\nWe're the developers of JDownloader, the market leading download management tool with over 15 million happy users. On top of that, we work on client-side applications for some of the top 200 websites worldwide.<p>With only 3 people, we're still a relatively small, but highly motivated team with high aspirations, great opportunities and an extremly optimistic outlook on the future. Joining us, you'll have the opportunity to experience rapid growth right when it's happening while actively being a part of building and growing a big company.<p>What you'll do:\nAs (Senior) Java Developer, you're in charge of diverse responsibilities and work on them either alone or in teams. You're responsible for parts of JDownloader, but on top of that will also have your own projects or products, for which you take the lead developer role.<p>Because we usually don't have strict deadlines or draconic specifications, we expect you to prioritize and get things done by yourself. You should feel cozy in your code, but also keep an eye on things like SEO strategy, project- and product management as well as user interface and experience. Your own ideas and innovations for projects, features or products are more than welcome and will actively be supported.<p>Send your resume, links to your current/past projects, social profiles or whatever you think we should know about you to e-mail@appwork.<p>We're looking forward to working with you :)","time":1309962278,"type":"comment"},{"by":"mkeblx","id":2719585,"kids":[2719693],"parent":2719028,"text":"Madison, WI - REMOTE<p>A new funded startup creating an easy to use electronic design webapp for the maker movement.<p>Passionate about making tools that simplify people's lives? We are looking for an all-around hacker, experienced with creating advanced frontend interfaces. Mainly would be doing a large amount of HTML5, Javascript+SVG (Raphael, custom), and using PHP, MySQL on the backend (Cake). Big bonus points if you have a hardware background: microcontrollers, designing PCBs, tearing things apart, and general familiarity with the Maker movement.<p>Interested, questions?\njobs@quasi.co","time":1309545371,"type":"comment"},{"by":"yosho","id":2730968,"parent":2719028,"text":"San Francisco, CA<p>Web Developer/Backend Engineer at an Early Stage Stealth Start-up<p>Helping people discover new experiences.<p>We are a stealth start-up located in San Francisco that helps people find new, unique experiences and activities in their city based on their interests and personality. Our team is focused on building great products that change the way people think about their free time.<p>We are an early-stage VC-funded company looking to bring on excellent talent with competitive salary and equity options. You will have a chance to work directly with the founders and be part of the core team (5-8 people).<p>We are looking for a backend engineer with the ability to build excellent web and/or mobile products. Real-world experience is preferred (this means you have worked on creating web products from start to finish - either in the professional setting or as side projects).<p>Required skills:\n+ Willingness and ability to pick up new programming languages \n+ Ruby on Rails\n+ Javascript/JQuery\n+ CSS/HTML\n+ MySQL\n+ Amazon Web Services\n+ UNIX/Linux\n+ Easy going<p>Bonus points:\n+ Web scraping technologies\n+ node.js\n+ Objective C (iOS dev)\n+ Experience scaling servers (caching/optimization)<p>You will work directly with the CTO, who handles most of the back-end programming, on a daily basis, and deploy product updates on a regular basis. Your responsibilities are primarily Rails programming, but you will be expected to work on whatever is necessary at the time.<p>If you fit the bill, apply with your resume and portfolio.\njobs@whitehawkventures.com","time":1309890775,"type":"comment"},{"by":"famousactress","id":2720402,"parent":2719028,"text":"San Francisco (full-time, remote for right fit) - Elation EMR<p>We're a small angel-funded team working hard to empower physicians and their patients to fundamentally improve healthcare. We'd love to add one more developer to our team before raising more money. It's a really great opportunity to work with us to shape the company and product from the beginning!<p>Our tech stack currently includes javascript, jQuery, Google's Closure Toolkit, Python, Django, Celery, Redis, Haystack, MySQL.<p>Find out more at <a href=\"http://elationemr.com\" rel=\"nofollow\">http://elationemr.com</a>","time":1309559380,"type":"comment"},{"by":"derrekl","id":2720387,"parent":2719028,"text":"Los Angeles, CA and\nWashington, DC Metro Area<p>Ruby Engineer,\nIphone Engineer,\nAndroid Engineer<p>taximagic.com is revolutionizing the taxi industry by building web, mobile, and back end tools for consumers and taxi providers alike. We're a startup, in a growing phase, competing in an exciting red hot space!  We offer stock, 401k, health and competitive salary and we don't expect you to sleep under your desk!<p>Check out our available jobs\n<a href=\"http://taximagic.theresumator.com/\" rel=\"nofollow\">http://taximagic.theresumator.com/</a><p>or email jobs@taximagic.com","time":1309559198,"type":"comment"},{"by":"i34159","id":2719447,"parent":2719028,"text":"CloudFlare (www.cloudflare.com) in San Francisco (H1B)<p>We have built a global network to help make every website faster and more secure. We're looking for the most talented engineers who want to tackle some of the web's hardest problems, see their work positively affect hundreds of millions of people every day, and be a part of a fast-growing, San Francisco-based startup.<p>Tens of thousands of sites worldwide (from Laughing Squid to CrunchGear to Metallica to the Government of Turkey to the IRS of Pakistan) are already using CloudFlare. More than 200 million people will experience a faster, safer Internet because of CloudFlare this month -- and that is only 9 months since our public launch!<p>CloudFlare is an engineering-driven organization. The best ideas win here. We're a small (20) but rapidly growing team. We're looking for talented engineers who get excited about the challenges of working at Internet scale. We are currently actively seeking:<p>Site Reliability / TechOps Engineers, PHP Developers, Data Architects, Technical Customer Supporters, Javascript Performance Wizards, Systems Engineers, NGINX Specialists, and more...<p>Check out some of the jobs we're currently looking to fill at:<p><a href=\"http://www.cloudflare.com/join-our-team.html\" rel=\"nofollow\">http://www.cloudflare.com/join-our-team.html</a><p>Or send us your resume directly to:<p>jobs (at) cloudflare (dot) com<p>You can also learn more about CloudFlare, our culture, and our passionate community by following CloudFlare on Twitter @cloudflare.","time":1309543658,"type":"comment"},{"by":"danielha","id":2719418,"parent":2719028,"text":"San Francisco, CA.<p>We're looking to build the right product team that can take Disqus to what we see as the next act. We're still a small company (~20) with a lot of user reach (~500mm/mo, 45mm users). Incredible, connective experiences is what we're after, and we're game for experimentation.<p>We're hiring for many engineering/design roles, as well as actively searching for super strong product leads to shape the next stage of Disqus.<p>All position at <a href=\"http://disqus.com/jobs/\" rel=\"nofollow\">http://disqus.com/jobs/</a> or hit me up at daniel@disqus.com.","time":1309543402,"type":"comment"},{"by":"nolanbrown23","id":2719507,"kids":[2719931],"parent":2719028,"text":"San Francisco, CA / Baltimore, MD<p>Millennial Media - We are the largest mobile ad network in the US<p>Come work with us to solve big and interesting problems on a large scale. We're hiring Android and iOS engineers as well as a web developer and systems architect. On the business side of things we have positions available in Publisher Services as well as other teams.<p>nolan [at] millennialmedia [dot] com or <a href=\"http://www.millennialmedia.com/about-millennialmedia/careers/\" rel=\"nofollow\">http://www.millennialmedia.com/about-millennialmedia/careers...</a>","time":1309544416,"type":"comment"},{"by":"jlentz","id":2719153,"parent":2719028,"text":"Reston, VA<p>comScore is hiring Software Engineers.<p>In this role you will:<p><pre><code>  * Build large distributed systems that scale well - Your systems will be processing 500 billion new records every month.\n\n  * Be involved in solving challenging technical problems.\n\n  * Participate in ongoing research and evaluation of new related technologies.\n\n</code></pre>\nQualifications<p><pre><code>  * 5+ years experience in server-side Java development.  C++ experience a plus.\n\n  * Strong full-cycle software development experience. High-volume, scalable, robust systems experience a plus.\n\n  * Understanding of distributed systems, data structures, object-oriented programming, multithreaded programming and performance optimization techniques.\n\n  * Hands-on Hadoop experience a plus.\n\n  * Experience with distributed databases (AsterData nCluster, Vertica, Greenplum, etc.) a plus.\n\n  * Proficient in Linux and Windows operating systems.\n\n  * Working knowledge of Linux (CentOS / RedHat a plus) and Windows systems administration.\n\n  * Excellent verbal and written communication skills.\n\n  * Comfortable working as part of a team as well as self motivated enough to define and complete tasks on own.\n\n  * Strong problem solving skills with a can-do attitude. Should be able to thrive with minimal supervision.\n\n  * Prior Agile (Scrum) development experience a plus.\n</code></pre>\nApply online at <a href=\"http://www.comscore.com/Careers\" rel=\"nofollow\">http://www.comscore.com/Careers</a><p>Email me with any questions.","time":1309540110,"type":"comment"},{"by":"far33d","id":2720057,"parent":2719028,"text":"Boston, MA<p>Zynga Boston has a small team working on the next big social game. We're looking for a number of positions in engineering, art, product management, and data analysis.<p>My email is in my profile.","time":1309552674,"type":"comment"},{"by":"brikis98","id":2720636,"parent":2719028,"text":"Mountain View, CA (full-time): LinkedIn<p>Engineering positions open across the board. We are building the professional network. Work with Java, Spring, Scala, JRuby, Grails, Node.js, RoR, Hadoop, iPhone, Android, and more. See <a href=\"http://engineering.linkedin.com/\" rel=\"nofollow\">http://engineering.linkedin.com/</a> for more info.<p>* Software Engineer - Applications: <a href=\"http://linkd.in/SWE-Applications\" rel=\"nofollow\">http://linkd.in/SWE-Applications</a><p>* Software Engineer - Mobile Applications: <a href=\"http://linkd.in/SWE-Mobile\" rel=\"nofollow\">http://linkd.in/SWE-Mobile</a><p>* Front End Engineer - Applications: <a href=\"http://linkd.in/Front-End-Engineer\" rel=\"nofollow\">http://linkd.in/Front-End-Engineer</a><p>* Software Engineer - Systems and Infrastructure: <a href=\"http://linkd.in/SWE-SI\" rel=\"nofollow\">http://linkd.in/SWE-SI</a><p>* Research Engineer - Data Analysis, Data Mining, Machine Learning: <a href=\"http://linkd.in/SWE-Data\" rel=\"nofollow\">http://linkd.in/SWE-Data</a><p>* Software Engineer - Tools: <a href=\"http://linkd.in/SWE-Tools\" rel=\"nofollow\">http://linkd.in/SWE-Tools</a><p>* Performance Engineer: <a href=\"http://linkd.in/SWE-Performance\" rel=\"nofollow\">http://linkd.in/SWE-Performance</a><p>* Software Engineer in Test: <a href=\"http://linkd.in/software-engineer-in-test\" rel=\"nofollow\">http://linkd.in/software-engineer-in-test</a><p>* Release QA: <a href=\"http://linkd.in/Release-QA\" rel=\"nofollow\">http://linkd.in/Release-QA</a>","time":1309564768,"type":"comment"},{"by":"joebasirico","id":2720201,"kids":[2720478],"parent":2719028,"text":"Security Innovation's (<a href=\"http://securityinnovation.com\" rel=\"nofollow\">http://securityinnovation.com</a>) team of amazing hackers is hiring (Boston, MA).<p>I'm looking to hire a couple awesome security professionals for our Boston office. We assess a wide range of really interesting technologies, from web apps to mobile to crypto. You have to have a true passion for security, most of the team does this on their off time and it's all we talk about. If you dream in hex, clickjack for breakfast, exploit XSS, SQLi and CSRF for lunch, Buffer Overflows and Format String Vulns for Dinner and some AuthN/AuthZ hijacking for a midnight snack you're our kind of candidate.<p>You'll have time and budget to do research, go to and speak at conferences, and build tools that will change the internet (We helped develop Firesheep, if you remember that).<p>You can e-mail me directly: jbasirico at securityinnovation dot com for more informaiton.<p>Check out our postings\n<a href=\"http://securityinnovation.recruiterbox.com/\" rel=\"nofollow\">http://securityinnovation.recruiterbox.com/</a> \n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1718329\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1718329</a>\n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=1718256\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=1718256</a>","time":1309555252,"type":"comment"},{"by":"eddylu","id":2719837,"parent":2719028,"text":"Los Angeles, CA - Grubwithus - Fulltime, Intern, H1B<p>Join Grubwithus and be responsible for creating real-life friendships, marriages, business partnerships, and more.<p>We're growing quickly and are looking for all development positions including frontend, backend, mobile, analytics, UX, etc. Our site is built on Rails but as long as you're smart and have good CS fundamentals, come join us.<p><a href=\"http://www.grubwithus.com/jobs\" rel=\"nofollow\">http://www.grubwithus.com/jobs</a>","time":1309548971,"type":"comment"},{"by":"jbarmash","id":2719538,"parent":2719028,"text":"New York, NY - EnergyScoreCards.com<p>We are a data platform for energy efficiency industry (think Mint.com for energy of big buildings).<p>Come work with us - we are at an exciting intersection of energy efficiency / statistics, sustainability, real estate, and finance areas.   Started two years ago and have started seeing the beginning of the hockey stick in the last six months.<p>We are still a fairly small team but hiring aggressively.<p>jean at energyscorecards [dot] com.","time":1309544662,"type":"comment"},{"by":"RichardPrice","id":2719259,"parent":2719028,"text":"Academia.edu is hiring engineers in San Francisco. (Foreign applicants are welcome - we have obtained visas for 4 of our team members so far).<p>Academia.edu is a platform for academics to connect and share research. We are building a hyper-connected academic graph, so every researcher has their entire research community at their fingertips. We currently have 1.9 million unique monthly visitors, and have doubled in traffic in the last 6 months.<p>Here are a few bullet points that sum up the atmosphere in our team:<p>- obsession with exceptional engineering<p>- obsession with building a great web product, and a great user experience<p>- intellectually inquisitive - we like delving into ideas, whatever the ideas are about<p>- fun and friendly - we enjoy each other's company a lot, and have a great deal of respect for each other.<p>We want to continue this atmosphere through the people we hire.<p>Here are some of the technologies we work with: Rails, Nginx, Node.js, Redis, Memcached. We are based in downtown San Francisco. More information about the team, and about how we think about software engineering and product development, is here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>","time":1309541479,"type":"comment"},{"by":"JacobIrwin","id":2766487,"parent":2719028,"text":"San Francisco, USA (from home and office-based work; split)<p>We are looking for a lead developer that has 3-5 years of experience creating mobile/tablet applications for the following three platforms: Android (mobile), iOS (iPhone), and iOS (iPad). Knowledge of recently upgraded “versioning” requirements is essential to this position. Coding/programming experience on Android (tablet) and Blackberry is a plus (but not required).<p>This position will be compensated for generously and the chosen candidate will have the opportunity to lead a team of developers as we continue to scale; this is a salary plus residual-commission paying position. We have a global footprint in the market of custom app development and accordingly the position may grow to encompass development of mobile &#38; tablet apps for customers on several continents.<p><a href=\"http://www.thecreativeappco.com/\" rel=\"nofollow\">http://www.thecreativeappco.com/</a><p>For consideration, please send three (or more) examples (preferably names of apps already published in the marketplace; apps available for us to download and preview), a resume (or school/work history), and any other relevant anecdotes to:<p>Jacob@thecreativeappco.com","time":1310711128,"type":"comment"},{"by":"javery","id":2719247,"kids":[2720196],"parent":2719028,"text":"Adzerk - Raleigh/Durham, NC<p>We are building the next generation of ad serving - fast, adaptable, extensible, and comprehensive. We are looking for super smart engineers who are ready to learn and grow - we don't care what you know now, we care about what you can learn and how quickly.<p>Flexible Hours, Good Pay, Options, Unlimited Vacation, fun technology.<p>Apply here- <a href=\"http://adzerk.com/jobs\" rel=\"nofollow\">http://adzerk.com/jobs</a>","time":1309541348,"type":"comment"},{"by":"cschmidt","id":2719205,"parent":2719028,"text":"Cambridge, MA<p>Percipio Media<p><i>Company:</i><p>Percipio Media applies state of the art predictive modeling and optimization technology to online media activities. Through both life-pathing membership sites and broader media services, Percipio improves online user experience while simultaneously increasing ROI for partners.<p>We spend a seven figure budget each month on SEM traffic, so you'll be in charge of buying a lot of clicks<p>We're a well funded startup, currently 8 people.  You'll get smart coworkers, a private office with a door, health and dental.<p><i>Job:</i><p>Online Media Manager for SEM<p>We run some very high traffic web sites, and need someone to manage our Google and Bing search engine marketing.  We take a very quantitative, data driven approach to driving traffic. We don't just plan campaigns in a spreadsheet. As such we are looking for:<p><pre><code>    * fluency in a scripting language such as Python, Ruby, or Perl\n    * a degree in a quantitative field such as CS, math, engineering, etc.\n    * a good knowledge of SQL\n</code></pre>\nExperience in running SEM traffic is obviously a big bonus, but is not required.<p>Please respond to the email in my profile.","time":1309540655,"type":"comment"},{"by":"ntolia","id":2719151,"parent":2719028,"text":"Mountain View, CA<p>Maginatics is hiring!<p>While we are still in stealth, we are looking for strong systems developers. In general, you need to be smart and hands-on with experience in distributed systems, storage systems, security, algorithms, or Infrastructure-as-a-Service (IaaS) and other cloud systems.<p>Check out <a href=\"http://maginatics.com/jobs.html\" rel=\"nofollow\">http://maginatics.com/jobs.html</a> to apply. We also do H1Bs.","time":1309540071,"type":"comment"},{"by":"Mc_Big_G","id":2719377,"kids":[2720272],"parent":2719028,"text":"San Francisco, CA<p>VerticalResponse is hiring for a lot of great positions:<p>* Ruby on Rails Developers<p>* Ruby on Rails Architect<p>* Director of Product Management<p>* Search Engine Marketing (SEM) Analyst<p>* Senior QA Automation Engineer<p>* Online Marketing Specialist<p>* Product Manager<p>* Director of Acquisition Marketing<p>* Senior Financial Analyst<p>* Customer Relations Specialist<p>VR is an established and successful, privately held company in SF for the last 10 years. We work with Rails 3, Git, JQuery, Rspec, backbone.js, Haml, Sass, TDD, pair programming, agile development and other leading technologies (you don't need to have experience with all of these). I've been working there as an engineer for 7 months now and really enjoy it.<p>Occasional work from home is allowed if you have an important appointment or need to keep germs out of the office. We have happy hour on Fridays and the fridge is stocked with a wide variety of beer, so we'll sometimes end the day with a cold brew while we finish pairing on a difficult problem.<p>Apply here: <a href=\"http://jobvite.com/m?3RB34fwj\" rel=\"nofollow\">http://jobvite.com/m?3RB34fwj</a>","time":1309542866,"type":"comment"},{"by":"allon","id":2719765,"kids":[2719849],"parent":2719028,"text":"Hi All,<p>XPlace (www.xplace.com), Israel's leading freelance marketplace, is hiring a Java Server Expert with guru-level experience in Hibernate, Tomcat, Spring, MySQL.<p>More specifically, we’re looking for a Java expert who knows web development inside-out to help us build the next generation of online marketplace solutions. The developer should have experience creating database-driven solutions and have completed at least one live production website.<p>The developer will work closely with the founding team to define, design, and implement the new products and features. 5+ years working in web development projects in a senior role Good problem solving skills Expert in developing high performance solutions in Java Expert with Open-Source Frameworks including Spring and Hibernate Web server configuration and management for web applications (Tomcat, JBoss, etc.)<p>Experience working with MySQL Server, database design, and writing proper SQL, extensive experience with HTML, JavaScript, and CSS best practices as well as knowledge in software design and common Design Patterns.<p>Please contact us by emailing admin (at) xplace.com.","time":1309547859,"type":"comment"},{"by":"tdonia","id":2719254,"parent":2719028,"text":"Brooklyn, NY<p>Main Street Connect \n<a href=\"http://www.mainstreetconnect.us\" rel=\"nofollow\">http://www.mainstreetconnect.us</a><p>Our Creative Tech team is looking for smart hackers to evolve our product.  We're building a national community news network, so we've got a wide range of work to be done and problems to solve.  We think they're interesting problems.  Mostly in PHP.<p>creative_technology@mainstreetconnect.us","time":1309541461,"type":"comment"},{"by":"kschrader","id":2719187,"parent":2719028,"text":"New York, NY<p>Intent Media is hiring software engineers, devops engineers, and a product manager.<p>Doing lots of cool stuff in Ruby, Java, Javascript, Hadoop, AWS, etc. Lots of data to play with and lots of hard problems to solve.<p>We're in SoHo in NYC in an awesome loft.<p>More info at <a href=\"http://www.intentmedia.com/jobs\" rel=\"nofollow\">http://www.intentmedia.com/jobs</a> or email me at kurt@intentmedia.com","time":1309540482,"type":"comment"},{"by":"jonkelly","id":2719140,"kids":[2719584],"parent":2719028,"text":"Denver, CO<p>This or That (thisorthat.com) is looking for an experienced software engineer. We're using Java, Mongo, jQuery, Hibernate, and Spring.<p>Life at This or That: _private office_ (with a door!), health insurance, very reasonable work hours, full salary and options. And, Denver, the greatest place to live on Earth.<p><a href=\"http://thisorthat.com/pt/jobs\" rel=\"nofollow\">http://thisorthat.com/pt/jobs</a>","time":1309539860,"type":"comment"},{"by":"Cyranix","id":2734840,"parent":2719028,"text":"Hm, seems that kchilek forgot to post our listing. In addition to the info below, you can reach me at andrew.harrison@myedu.com to ask about our development work and company culture.<p>===<p>MyEdu.com - Austin, TX - Fulltime - PHP / JavaScript Developers<p>www.myedu.com<p>MyEdu is an education based company that helps college students plan and manage their college career online using our innovative suite of web applications. Our team is comprised of some of the best developers in Austin and we are seeking a few more to join the group. You must be creative, talented and a high performer who thrives working on projects that will change people’s lives.<p>We are seeking an experienced PHP / JavaScript Developer that has extensive experience in MVC frameworks, Object Oriented Development, agile practices and works well both individually and with a team.<p>Tons of experience the the following would be a major plus: - JQuery - Restful Web Services - Solr - XML/XSLT - NoSql - Document Databases - Memcached<p>Email keith.chilek@myedu.com with your resume and any other relevant material you have.","time":1309972136,"type":"comment"},{"by":"jordan0day","id":2719330,"parent":2719028,"text":"Shawnee, Kansas (suburban Kansas City, Missouri area)<p>Perceptive Software is a leading creator of enterprise content management (ECM) software products and solutions, committed to organic product development and superior engineering. Our flagship product — ImageNow document management, document imaging and workflow suite — is used today by customers across all industries in more than 30 countries worldwide. In 2010, Perceptive Software joined Lexmark International as a stand-alone business unit, and as a result, our presence is rapidly expanding into the global ECM marketplace.<p>I'm a software developer at Perceptive and can say it is by far the best work environment I've been in. We're looking for more smart developers to join us. We're a C++/.NET/Java shop, but previous experience in any of those three isn't strictly necessary, as long as you're willing to learn.<p>Check out our careers online:\n<a href=\"http://www.perceptivesoftware.com/company/careers/northamerica/research-development.psi\" rel=\"nofollow\">http://www.perceptivesoftware.com/company/careers/northameri...</a>","time":1309542303,"type":"comment"},{"by":"jerryr","id":2719443,"parent":2719028,"text":"As of September this year: San Francisco near Market Street<p>Currently: Palo Alto, CA (very close to Caltrain)<p>MindTribe is hiring Electrical, Mechanical, and Software engineers. We're an engineering consultancy in downtown Palo Alto (considering an office in SF very soon though, so if that interests you, let us know). Notable projects include the Aliph Jawbone headset, the Pure Digital Flip (before it was acquired by Cisco). We're looking for thought leaders who will help us bring agile development to physical products in support of our clients' customer development efforts.\n<a href=\"http://mindtribe.com/jobs/\" rel=\"nofollow\">http://mindtribe.com/jobs/</a><p>I'm our Director of Software Engineering and, despite the requirements listed on our website, I'm specifically looking for enthusiastic embedded developers with strong C skills, test-driven development discipline, and agile planning experience--regardless of degree or pedigree. And the agile experience/mindset is more important than intimate knowledge of C. If this excites you, contact me at hn@mindtribe.com.","time":1309543627,"type":"comment"},{"by":"ahuibers","id":2721137,"parent":2719028,"text":"Mountain View, CA -- Bump<p>Bump is the #7 app in US for all time and #3 in Japan with over 40M downloads.  Innovation you create at Bump will push out to &#62;&#62;10 million active users and growing.<p>We are hiring for <i>Applied Mathematics</i> (need to be able to code), Operations, CSS/Javascript, Design, Backend Development, iOS, Android.  We will train on iOS or Android for the right candidate.<p>We work on scaling (using Riak, Redis, MongoDB), performance in a real time probabilistic environment (Python, C, Haskell, and .. math!).  We also have some very challenging design &#38; UX work going on with the core product and new products.<p>We are backed by the twin powerhouse VCs Sequoia and Andreessen-Horowitz.  We are a 25 person company (+11 interns) with a very open culture.  For all you SFers, our office is <i>at</i> the Caltrain station.<p>Check out our dev blog: <a href=\"http://devblog.bu.mp\" rel=\"nofollow\">http://devblog.bu.mp</a><p>hackernews@bu.mp to reach me (Andy) or <a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a>","time":1309587572,"type":"comment"},{"by":"megaduck","id":2719598,"parent":2719028,"text":"IndieGoGo, San Francisco CA<p>H1B okay, No telecommute (sorry)<p>IndieGoGo is a rapidly growing funding platform, based in beautiful San Francisco.  Our site is used by people all over the world to raise money for creative projects, businesses and causes.  Millions of dollars have been contributed to over 25 thousand funding campaigns in over 200 countries.<p>Our customers are passionate about their funding campaigns, and so are we.<p>We're venture backed, and are looking for folks to fill the following roles:<p><pre><code>  * UX Designer\n  * Senior Rails Developer\n  * Junior Rails Developer\n  * Visual Designer/Developer\n  * Product Manager\n</code></pre>\nFor the devs, exposure to functional programming languages is a plus.<p>This is a chance to have a lot of immediate impact on the world, while working with a cool team in a casual atmosphere.<p>More info: <a href=\"http://www.indiegogo.com/careers\" rel=\"nofollow\">http://www.indiegogo.com/careers</a><p>Or, you can contact me directly:\ndavid@indiegogo.com","time":1309545571,"type":"comment"},{"by":"danonet","id":2719707,"parent":2719028,"text":"La Jolla, CA (San Diego, CA) - Nettle, Inc.<p>We are pre-launch so not much to say about the application or market. Actually, the market is large and worldwide, but that's all I can say. Our team is small and very productive. We work in python and use interesting tech such as elastic search, django and zeromq. It is 72 degrees and sunny and the doors to the deck at the office are wide open.<p>Just hired an awesome front end developer who is making great progress with our lead app developer. An API has been released to our external partner.<p>Hiring: One or two software developers with experience in python and relevant modern stack components. Lots of details at <a href=\"http://nettle.com\" rel=\"nofollow\">http://nettle.com</a> . New team members will be working on the infrastructure and programming interfaces for the web and mobile devices.<p>The team members have all been successful in prior organizations and are really the best at what they do. Come join us.<p>email jobs@nettle.com","time":1309547164,"type":"comment"},{"by":"Hovertruck","id":2719188,"parent":2719028,"text":"NYC - Meetup is hiring for just about everything.<p><a href=\"http://www.meetup.com/jobs/\" rel=\"nofollow\">http://www.meetup.com/jobs/</a>","time":1309540487,"type":"comment"},{"by":"seliopou","id":2719772,"parent":2719028,"text":"Providence, RI<p>Tracelytics (<a href=\"http://tracelytics.com\" rel=\"nofollow\">http://tracelytics.com</a>, jobs@tracelytics.com) looking to hire for two positions:<p>* Software engineer, experienced with Cassandra, and an expert in Python and systems programming.<p>* Marketer, experienced in executing online marketing campaigns, and that can contribute to strategy","time":1309547914,"type":"comment"},{"by":"Lisa_O","id":2730205,"parent":2719028,"text":"Chicago, IL (downtown)<p>BrightTag is changing the way data rights management is handled on the Internet. We're looking for a senior front-end developer and a software developer to join our tech team. As part of our tech team, you’ll be using your coding skills to build an amazing product already in use by very large e-commerce sites. We're Agile and work with JavaScript, node.js, Ruby, MongoDB, Java and more.<p>Our management team has a track record of building innovative companies and making successful exits. Our CTO is Eric Lunt (co-founder and former CTO of Feedburner). We are vc-funded.  Our investors include The Pritzker Group and Tomorrow Ventures.<p>We do work and shun big company politics and drama. We believe in our employees having a life outside of work, are big advocates of being involved in the open source community and are just nice people.<p>Interested?  Lokeefe(at)brighttag.com<p>Please, no 3rd party recruiters or outsourcing firms.","time":1309879946,"type":"comment"},{"by":"BvS","id":2730631,"kids":[2735758],"parent":2719028,"text":"Berlin, Germany (full-time and freelancer)<p>Non-profit Startup betterplace.org is looking for a senior and a junior Rails developer.<p>For more information check: <a href=\"http://blog.betterplace.org/de/2011/06/22/betterplace-org-sucht-ab-sofort-senior-rails-entwickler-mw/\" rel=\"nofollow\">http://blog.betterplace.org/de/2011/06/22/betterplace-org-su...</a><p>and: <a href=\"http://blog.betterplace.org/de/2011/06/22/betterplace-org-sucht-auserdem-ab-sofort-junior-rails-entwickler-mw/\" rel=\"nofollow\">http://blog.betterplace.org/de/2011/06/22/betterplace-org-su...</a><p>If your German or your translation skills are good enough to understand the offer, please contact us.<p>For a PHP freelancer opportunity please check: <a href=\"http://blog.betterplace.org/de/2011/06/28/gesucht-fur-die-betterplace-solutions-gmbh-php-webentwickler-mw-als-freelancer-freier-mitarbeiter/\" rel=\"nofollow\">http://blog.betterplace.org/de/2011/06/28/gesucht-fur-die-be...</a>.","time":1309885786,"type":"comment"},{"by":"axiom","id":2719261,"parent":2719028,"text":"Waterloo, Ontario<p>We would consider hiring remote developers, but ideally we want someone who can work in our office with the rest of the team.<p>We are a growing and profitable startup in the education space with 12 employees. Our development team is small and we're still giving very large stock options to anyone who joins (&#62;1%.)<p>We're looking for a generalist - everyone on our team touches front-end, backend and database. You'll be working with javascript and all the usual suspects on the client site (including socket.io) and you'll be working in Python on Django on the server. We're not necessarily looking for someone who knows the specific tech that we use, but mainly someone who's really smart and able to learn quickly.<p>Apply here:\n<a href=\"http://jobs.startupnorth.ca/job/insanely-smart-web-developer-waterloo-on-canada-top-hat-monocle-355bb2c903/\" rel=\"nofollow\">http://jobs.startupnorth.ca/job/insanely-smart-web-developer...</a>","time":1309541482,"type":"comment"},{"by":"JungolHQ","id":2742970,"parent":2719028,"text":"Madison, WI - REMOTE<p>Job Opening: Associate Developer at Jungol, Inc<p>Jungol, Inc is a exciting startup company based out of Madison, Wisconsin.  We’re creating a web application to help organizations connect and team up online.  As one of the select number of companies in Madison’s own seed incubator, we have access to an office right on the capital.  We are going full-force to finish the initial development of our web application and to roll out a beta version in just a few weeks.<p>We're looking for energetic and talented developers to join our team for 3-6 weeks beginning Monday, July 11.<p>TASKS INCLUDE: \nFront-end work,\nBack-end work,\nUX/UI,\nGeneral Design<p>We're using Ruby on Rails, jQuery, and SCSS. We use git for version control, develop locally, and deploy to heroku.<p>If interested, please send your resume to ethan@jungolhq.com with \"Jungol developer position\" in the subject line. We look forward to hearing from you!","time":1310140713,"type":"comment"},{"by":"gregdetre","id":2720120,"parent":2719028,"text":"Memrise - Boston, MA (but remote could work)<p>We're looking for people who dream in either Django, iOS or Javascript and want to help reinvent learning - our CEO's a Grandmaster of Memory, I'm the CTO and a Princeton PhD neuroscientist, and we're busily growing the world's most creative learning community.<p>Yours,\n   Greg Detre - greg@memrise.com","time":1309553754,"type":"comment"},{"by":"covati","id":2723968,"parent":2719028,"text":"Durham, NC - Senior Software Eng @ Argyle Social<p>We are looking for another A-player to help us continue to grow out our Social Media publishing, management, and engagement solution.<p>Are you interested in:\n• Deep integrations with twitter, facebook, google+, wordpress, etc.\n• Working with lots of social, click, and conversion data\n• Going from idea, to mockup, to production in a few weeks\n• Taking the lead on projects that excite you\n• Flexible work schedule, free snacks &#38; drinks\n• Web apps, built in php that provide users easy-to-use and effective marketing tools<p>If that sounds good, then check us out. We are small and efficient team, using agile 2.5 week sprints. We also have an amazing designer who will make everything you build look hot ;)<p>More details at:\n<a href=\"http://argylesocial.com/jobs/durham-nc-software-engineering-job\" rel=\"nofollow\">http://argylesocial.com/jobs/durham-nc-software-engineering-...</a>","time":1309710958,"type":"comment"},{"by":"jon_dahl","id":2719596,"parent":2719028,"text":"San Francisco, CA - Zencoder<p>Zencoder is putting video infrastructure in the cloud. We're growing, our customers love us, and we have the best technology in the industry.<p>Always interested in hearing from awesome people, but we're especially looking for a designer.<p>Web Designer:<p><pre><code>  * beautiful design and CSS a must.\n  * if you can help with javascript, writing, or marketing projects, that's a plus. \n  * Rails experience wouldn't hurt either.\n  * open to experienced designers, early career folks, or interns alike...\n  * ...you just have to be really good.\n</code></pre>\nBenefits include catered lunches, full health/vision/dental insurance, retirement matching, an Aeron chair, a great work environment, and the ability to work for a Y Combinator company that is making a real impact in an exploding industry.<p>More info at <a href=\"http://zencoder.com/jobs/\" rel=\"nofollow\">http://zencoder.com/jobs/</a>.","time":1309545525,"type":"comment"},{"by":"gnubardt","id":2719282,"parent":2719028,"text":"Brightcove - Cambridge, MA &#38; Seattle, WA ;INTERN<p>We're an online video platform with lots of data, lots of traffic and lots of tough problems to solve.  In the time it takes you to read this sentence, the Brightcove player has been loaded over 9,000 times worldwide.  That's over 1 Billion video player requests per week!<p>We develop with java+spring, python, rails &#38; mongodb.<p>We've openings for:<p><pre><code>  * DevOps Systems Engineer\n  * Front End (UI) Principal Software Engineer/ Architect\n  * Principal Software Engineer - Reporting &#38; Analytics (Big Data)\n  * Senior Ruby on Rails Developer\n  * Senior software engineer\n  * [Senior] QA Engineer\n  * QA &#38; Software Engineering Interns\n</code></pre>\nSee the full list and apply online: <a href=\"http://www.brightcove.com/careers\" rel=\"nofollow\">http://www.brightcove.com/careers</a><p>Let me know if you have any questions sneubardt@brightcove.com","time":1309541778,"type":"comment"},{"by":"_mattb","id":2719337,"parent":2719028,"text":"Fremont, CA - Engineers of all sorts, Interns and Full-Time<p>Redwood Systems is building a web-enabled platform for powering and controlling LED lights in commercial spaces and datacenters. Our system collects a large amount of very granular sensor data and we use this information to save energy and increase our clients' productivity. Our engineers work with big-name customers to deliver solutions and shape the direction of our product. It's an awesome time to be working here!<p>We're about 50 people now and are hiring engineers for backend development, sales support, application development, manufacturing, and power systems development. See our full list of openings here: <a href=\"http://redwoodsystems.com/about-us/careers\" rel=\"nofollow\">http://redwoodsystems.com/about-us/careers</a> Interns are being hired in many of the same fields. Feel free to get in touch with me directly -- mball -at- redwoodsys.com","time":1309542365,"type":"comment"},{"by":"apike","id":2719170,"parent":2719028,"text":"Vancouver, BC<p>Steam Clock Software (<a href=\"http://steamclocksw.com/\" rel=\"nofollow\">http://steamclocksw.com/</a>) is hiring an iOS engineer as employee #1. We're a profitable bootstrapped product company focused on consumer apps.<p><a href=\"http://jobs.37signals.com/jobs/9175\" rel=\"nofollow\">http://jobs.37signals.com/jobs/9175</a>","time":1309540303,"type":"comment"},{"by":"anandvc","id":2720657,"parent":2719028,"text":"Bangalore, India (full-time): RoR-based Facebook App Developer<p>Hiring Rails/MySQL/Javascript/CSS/Facebook API expert<p>I have a few facebook apps right now and I need someone full-time to manage, maintain, update and keep improving and growing them. The main app has about a million email permissions and 500k fans. The apps were written in 2007 with Ruby on Rails 1.2.5 and are hosted with two VPS CentOS app servers and a VPS MySQL database server. The server uses HAProxy to distribute the incoming requests among mongrels. Static files are served using apache. Facebook has a new requirement that by September 1, 2011 all apps have to move to the new OAUTH 2.0 authentication system using the Graph API and work with SSL connections.<p>For more details on the requirements and to reach me, please go here:\n<a href=\"http://bit.ly/mi57W0\" rel=\"nofollow\">http://bit.ly/mi57W0</a>","time":1309565601,"type":"comment"},{"by":"llnimetz","id":2720890,"parent":2719028,"text":"San Francisco (Founding Engineer, H1B, Full-Time)<p>rippleQ:  we're applying social and game mechanics within the enterprise so companies get more impact out of their training and development programs.  With rippleQ, companies can crowdsource on-going training support to their employees.<p>We've built our site using a php MVC framework (codeigniter), jquery and mysql.<p><a href=\"http://bit.ly/rippleQengineer\" rel=\"nofollow\">http://bit.ly/rippleQengineer</a><p>We want great engineers who want: \n* founder’s equity \n* to shape product and product development.  \n* some real experience building a company.  \n* meaningful work: (a) help real people rediscover the love of going to work, (b) be part of the democracy in the workplace movement<p>Contact us to hear more about rippleQ.\n<a href=\"http://bit.ly/rippleQengineer\" rel=\"nofollow\">http://bit.ly/rippleQengineer</a>","time":1309575152,"type":"comment"},{"by":"cyen","id":2720382,"parent":2719028,"text":"San Francisco, Venuetastic (YC W11)<p>Looking for a generalist engineer (intern or full-time) to be our first employee. Standard Rails stack, but candidates with experience in equivalent technologies are wholeheartedly welcome as well.<p><a href=\"http://venuetastic.com/jobs\" rel=\"nofollow\">http://venuetastic.com/jobs</a>","time":1309559154,"type":"comment"},{"by":"LukeG","id":2719201,"kids":[2719250],"parent":2719028,"text":"Eventbrite is hiring, and it's awesome here.<p>Unreal team, sick engineers, great problems (scaling, consumer web, data, etc). Come work with the good guys.<p>Check out <a href=\"http://eventbrite.com/jobs/\" rel=\"nofollow\">http://eventbrite.com/jobs/</a><p>We're in San Francisco, CA and H1B friendly for the right folks.","time":1309540624,"type":"comment"},{"by":"benwerd","id":2731124,"parent":2719028,"text":"Austin, TX<p>Java Developer at latakoo: <a href=\"http://latakoo.com/\" rel=\"nofollow\">http://latakoo.com/</a><p>We're looking for a Java developer for cross-platform client-side Internet application with Windows, Mac OS X and Linux editions, with potential for browser plugins and server-side plugins. Must have experience developing with web-based APIs. Interface design and web development experience a plus.<p>This is a freelance contractor position that could turn into full-time if you are the right person. Salary will be based on experience, but is very competitive. You'll be working with one of the world's premier social networking gurus. We're looking for a self-starter with creativity and confidence, but someone with a willingness to listen to others and cooperate with a team. Contact us at 512 502 5666, 972 897 6755 or kate@latakoo.com.","time":1309892990,"type":"comment"},{"by":"chrisaltman","id":2719209,"parent":2719028,"text":"Atlanta, GA\nEmcien\n<a href=\"http://emcien.com/\" rel=\"nofollow\">http://emcien.com/</a>\n<a href=\"http://gabacus.com/\" rel=\"nofollow\">http://gabacus.com/</a><p>Rails Engineers. Work with mathematicians using discrete algebra to recognize patterns in everything from manufacturing data to Twitter.<p>emcienjobs@emcien.com","time":1309540704,"type":"comment"},{"by":"kynphan","id":2731223,"parent":2719028,"text":"Seattle, WA<p>Position: Senior Python developer (full time, non-contract position)<p>- 7+ years experience in development<p>- 4+ years experience developing with Python<p>- very familiar with relational databases and SQL<p>- familiar with HTML/CSS<p>- familiar with Javascript<p>- exposure to ORMs<p>- exposure to PHP<p>Pyramid/Pylons/Django, Rails, or SQLAlchemy experience is a plus but not required. Most work is backend oriented with simple web-interfaces (internal tools).<p>Compensation: Varies by skill level, but we typically pay above the industry average.<p>Benefits: Complete medical/dental/vision coverage.<p>About us: Stripes39 is an internet marketing company started in 2005 by several UW graduates. Today we have over seventy employees and are located in Pioneer Square.<p>Contact us at ky.phan+jobs@stripes39.com","time":1309894772,"type":"comment"},{"by":"dlapiduz","id":2719614,"parent":2719028,"text":"Deerfield Beach, FL - Playwire\nPlaywire is a comprehensive video platform that does everything from encoding to streaming to monetization.<p>We are looking for Ruby on Rails developers for our front end and a Flash developer for our player.<p>Feel free to contact me for more info: dlapiduz@playwire.com","time":1309545804,"type":"comment"},{"by":"goronbjorn","id":2719601,"parent":2719028,"text":"Palo Alto, CA - Box.net<p>Our mission is to enable simple and secure content sharing and collaboration in businesses of all sizes.<p>While the mission is straight-forward, the execution of it has presented Box with a number of interesting challenges:<p>How do you maintain security in the cloud?\nHow do you provide high levels of functionality with an easy-to-use interface?\nHow do you best serve millions of files a day to a global customer base?\nHow do you scale the infrastructure and operate internationally in a cost-effective manner?\nHow do you leverage other services and platforms to enhance the Box experience?<p>We're hiring across the board in Product/Engineering: <a href=\"http://bit.ly/boxjobs\" rel=\"nofollow\">http://bit.ly/boxjobs</a><p>email me if interested in anything: srose@box.net","time":1309545594,"type":"comment"},{"by":"tobyjoe","id":2719797,"parent":2719028,"text":"Control Group is looking for great product developers (and more).<p>iOS/Android, LAMP, JRuby+Rails+Sinatra, HTML5 &#38; CSS, and lots of sensor-based &#38; out of the home work. We help start-ups launch and develop really interesting projects for Fortune companies, VCs, JVs, and indy founders. We pair, we do TDD, we don't work late, and we don't have silos. Everybody loves UX and has a product-oriented mindset.<p>We need senior and junior folks: visual designers, UEDs, devops (especially AWS) folks, coders, product managers, and even some hardware designers/prototypers.<p>We're small (75 folks), 10 years old, privately owned, and based in NYC. The stuff I can't talk about is far more exciting than meets the eye.<p>toby.boudreaux at ControlGroup.com - I'm the CTO and the guy to talk to :)","time":1309548326,"type":"comment"},{"by":"simonrand","id":2731311,"parent":2719028,"text":"Dublin, Ireland (remote an option)<p>UI/UX Designer (Web/Mobile)<p>iorum make Web, Mobile and Social applications. We are looking for a web &#38; mobile user interface/user experience designer to expand our team for an initial contract period of 3 months, with a view to a longer term contract/position.<p>You will: Sketch/conceptualise/refine complete interfaces for web and mobile applications\n- Undertake or oversee interface implementation\n- Work within a small team doing great work on diverse projects across platforms<p>Strong UI design skills, graphic skills and experience with HTML/CSS are all requirements. Experience with JavaScript and/or Ruby (inc. Rails/Sinatra) is a big plus.<p>Full details at <a href=\"http://www.iorum.ie/jobs/\" rel=\"nofollow\">http://www.iorum.ie/jobs/</a>","time":1309896063,"type":"comment"},{"by":"ckurdziel","id":2735146,"parent":2719028,"text":"New York, NY<p>Front End Engineer &#38; Back End Engineer @ Shelby.tv<p>We're a TechStars NYC graduate looking for some badass engineers who meet a few basic requirements:\n     You work with (and watch tons of) online video,\n     Process updates in real time from a growing list of firehoses (twitter, facebook…),\n     Use the best technology for the job (Rails, Mongo, Node, Redis, Beanstalk…),\n     Develop and contribute open source,\n     Love the modern web (HTML5, CSS 3, JS, modern browsers),\n     Stay the fuck away from IE &#60; 9 and Flash,\n     Love every screen (monitor, tablet, phone, tv, headrest, IMAX),\n     and most importantly, focus on building an exceptional team that builds something people want<p>If you're interested, shoot Dan an email at dan+jointheteam@shelby.tv","time":1309975995,"type":"comment"},{"by":"scottblew","id":2739618,"parent":2719028,"text":"San Francisco, CA (full-time) : <a href=\"http://WordsPicturesIdeas.com\" rel=\"nofollow\">http://WordsPicturesIdeas.com</a><p>We are looking for a versatile and multi-talented Web Developer to join our team. Developers support Senior Developers on project development and continually maintain existing projects. They are able to independently research and complete development tasks assigned to them. They are also able to lead small-scale development projects.<p>Key skills/Experience Required:\n* Drupal &#38; Wordpress CMS Platforms (Theme development &#38; maintenance)\n* PHP\n* Javascript (jQuery)\n* CSS &#38; HTML best practice markup skills in a cross browser environment.\n* Familiar with Adobe design suite. Fireworks, Photoshop &#38; Illustrator<p>apply at dev@wordspicturesideas.com","time":1310062664,"type":"comment"},{"by":"abbyc","id":2719734,"parent":2719028,"text":"Clustrix - San Francisco, Software Development Engineer<p>Clustrix has developed a highly scalable distributed\ndatabase system from the ground up. We are looking for skilled systems developers to help us with the next\ngeneration of Clustrix Database. As a candidate, you should be an experienced C developer and proficient in concurrent and asynchronous system principles.<p>Additionally, experience in any of the following areas is highly preferred. It's a sample of the kinds of problems Clustrix developers are faced with on a daily basis:<p>Compiler design and implementation, Distributed query planning and optimization, Distributed concurrency control mechanisms, Fault tolerance in distributed systems, and/or Distributed transaction management.<p>Submit resumes to jobs@clustrix.com.","time":1309547581,"type":"comment"},{"by":"michaelfairley","id":2719552,"parent":2719028,"text":"San Francisco, CA<p>1000memories (YC S10)<p>We're building the Wikipedia of everyone, ever, and we need web engineers and mobile developers to help us do it.<p><a href=\"http://1000memories.com/jobs\" rel=\"nofollow\">http://1000memories.com/jobs</a><p>michael@1000memories.com with any questions","time":1309544854,"type":"comment"},{"by":"bdblack210","id":2731930,"parent":2719028,"text":"Irving, TX (Dallas area)\nTechnical Development Team Jobs.<p>IBG.com, a comprehensive Internet Marketing firm specializing in Marketing and Visibility Solutions for individuals and businesses is moving our corporate headquarters to Irving, TX and we have the following positions available.  Are you interested in a new role?  Do you know someone who is?  We offer competitive pay and benefits.<p>•\tSenior Ruby on Rails Developers\n•\tJr. Ruby on Rails Developers\n•\tUI Designer\n•\tLinux System Administrator\n•\tSEO Manager\n•\tSEO Specialists<p>Send a resume of interest or referrals to bryan@ibg.com<p>Please share this message.<p>Thank you.<p>BTW – In addition to our current product offerings we are working on a well-funded social media application.  Plenty of innovation taking place!","time":1309906835,"type":"comment"},{"by":"jdale27","id":2719712,"parent":2719028,"text":"Palo Alto, CA - DNAnexus<p>We're a startup building the computing platform for the genome era. In the next few years, millions of genomes will be sequenced, and we will provide the software infrastructure to store, analyze, and make sense of these enormous data sets.<p>You: a great hacker, looking to work on a talented team, in a fun environment, on big problems that will make a difference in people's lives.<p>We're hiring for multiple software engineering positions. See <a href=\"https://dnanexus.com/careers\" rel=\"nofollow\">https://dnanexus.com/careers</a> for details.<p>Also, we're offering a fantastic referral bonus: $20,000 plus your full genome sequenced! Check out <a href=\"https://dnanexus.com/careers/referrals\" rel=\"nofollow\">https://dnanexus.com/careers/referrals</a>.","time":1309547198,"type":"comment"},{"by":"matthanger","id":2720796,"parent":2719028,"text":"Indianapolis IN (full time, local)\nCourseload <a href=\"http://courseload.com\" rel=\"nofollow\">http://courseload.com</a><p>We are a funded startup seeking our third software engineer. We deliver e-textbooks and digital course materials with the goal of reducing costs to students and improving educational outcomes.<p>We're ~80% front-end (JavaScript) and ~20% back-end (Python). We use fun tools like CoffeeScript, Mongo and Solr. We don't support IE&#60;9. We iterate quickly and release often, and have a strong devops mentality.<p>We're looking for a professional with strong front-end skills, attention to detail, and the proven ability to ship. If you think you can help improve the educational experience for students and instructors then let's talk. matt @ courseload.com","time":1309571250,"type":"comment"},{"by":"SteveOS","id":2720317,"parent":2719028,"text":"Paris, France - Mimesis-Republic (creator of <a href=\"http://www.mambanation.com\" rel=\"nofollow\">http://www.mambanation.com</a>) (No need to be or speak French)<p>We are looking for a Scala Senior Software Engineer for working on Scalability/Distributed-computing/Cloud computing on your virtual universe. Ideally with experience in Scala or at least knowledges in Java but strong willingness to learn Scala.<p>Mimesis-Republic is young, dynamic and rapidly growing company, mainly composed of talented and passionate engineers. We are building a 3D virtual universe with high graphical quality and strong ties to social networks. In this context, we seek to improve our technology to be able to cope with growing user demands.<p>Email me directly: steve.gury@gmail.com","time":1309557659,"type":"comment"},{"by":"arcanez","id":2731033,"parent":2719028,"text":"Boston, MA<p>Senior Linux Sysadmin/Engineer<p>This position is responsible for management of critical network infrastructure, including our network hardware, SAN, and Linux machines (physical and virtual). You will share emergency 24x7 on call duties and respond to critical outages including on-site work as necessary. As we are a small team, you will also share responsibility for email, support tickets and phone calls from employees and financial advisors. The position reports to the CEO/CIO.<p><a href=\"http://seeker.dice.com/jobsearch/servlet/JobSearch?op=302&#38;dockey=xml/c/5/c5570f1fd76bc9d4895ab039e1217f37@endecaindex&#38;source=19&#38;FREE_TEXT=cantella&#38;rating=99\" rel=\"nofollow\">http://seeker.dice.com/jobsearch/servlet/JobSearch?op=302&#3...</a>","time":1309891624,"type":"comment"},{"by":"dvjohnston","id":2731463,"parent":2719028,"text":"San Francisco, CA<p>Python Web and Backend Developer at Prism Skylabs (full-time, local only)<p>We are a freshly funded company looking to fundamentally transforming how video and the web meet the real world. We're looking for a highly motivated, creative developer to participate in the design and implementation of our system. You'll have an active role in influencing our system architecture, whether you're a junior programmer with fresh ideas or a hardened veteran with years of experience.<p>Requirements: intimately familiar with Python and Django, working knowledge of SQL, comfortable developing in the *NIX environment<p>Also nice if you can write clean, disciplined Javascript and have html canvas and video experience.<p>Contact jobs@prismskylabs.com","time":1309898312,"type":"comment"},{"by":"n9com","id":2719229,"parent":2719028,"text":"FIPLAB - London (Full time) and Remote (Part time)<p>Join a fast growing startup with several successful iPhone and Mac apps (millions of downloads).<p>Requirements:<p>* Strong knowledge of Objective-C, Cocoa and the iOS SDK<p>* Previous experience in developing iPhone/iPad or Mac applications<p>* A thirst for more knowledge and an interest in the latest technologies – e.g. HTML5/Javascript web apps<p>* Ability to quickly work out solutions to roadblocks encountered during development<p>Benefits:<p>* Salary between £30,000 to £40,000 depending on experience<p>* £2,000 to spend on computer hardware<p>* Stock options vesting over 4 years with a one year cliff<p>* Flexible hours<p>* Relaxed and creative environment<p>To apply, please email hello@fiplab.com","time":1309541075,"type":"comment"},{"by":"pashields","id":2719372,"parent":2719028,"text":"Floop - New Haven, CT or remote (us only, northeast preferred) - iOS, Android, OpenGL, Mobile app design (Information Architecture through gradients and icons)<p>We're a funded \"stealth\" startup building what we call a social opinion platform. Our iPhone app will be launching later this month. We'll be gathering feedback and iterating quickly, so we'll need some help!  We're interested in anyone with one or more of the skills listed above. We're low overhead, flexible on hours, and all we really care about is getting shit done.<p>Please submit code/github/portfolio if you are interested. We'll be happy to add you to our testflight before we chat so you can see what we are all about. Good compensation, equity for right person. pat at floop dot com.","time":1309542834,"type":"comment"},{"by":"nwilkens","id":2719456,"parent":2719028,"text":"Monroe, MI  - Linux System Administrator @ MNX Solutions<p>We provide Linux consulting services, 24x7 monitoring, and pro-active support for our customers.<p>Further detail: <a href=\"http://www.mnxsolutions.com/jobs?hn\" rel=\"nofollow\">http://www.mnxsolutions.com/jobs?hn</a>","time":1309543802,"type":"comment"},{"by":"oldmantone","id":2719659,"parent":2719028,"text":"Alpharetta, GA\nGiftRAP Healthcare Solutions<p>Hiring senior engineers to build web/mobile solutions for experienced, profitable player in the rehab medical space. We are a small agile software development shop with a terrific people-centric culture that values great software, great customer service, and a passion for the elderly.<p>We are looking for generalists who have experience in object-oriented anaylsis and design, the Microsoft technology stack, and HTML/JavaScript front-end skills. Come join a team that's building for the future and make your mark writing new enterprise software without supporting legacy applications.<p>Interested? Email jeremey.mcgraw@giftrapcorp.com for more details.","time":1309546414,"type":"comment"},{"by":"rajesht","id":2719305,"parent":2719028,"text":"Mountain View/ San Bruno, CA<p>I work for company called @WalmartLabs. It was previously known as Kosmix and acquired very recently by Walmart. I joined almost 9 months ago, and really loving it so far. We have very fun and social work environment. I like the work we are doing here. You can find more about the vision of the company from Anand's (our Founder) blog <a href=\"http://anand.typepad.com/datawocky/2011/04/retail-social-mobile-walmartlabs.html\" rel=\"nofollow\">http://anand.typepad.com/datawocky/2011/04/retail-social-mob...</a><p>And yes we are looking for more team members who are fun, smart, and share our excitement. You can reach me via rajesh@walmartlabs.com , and we do H1B as well.","time":1309542020,"type":"comment"},{"by":"gsharkhr","id":2719370,"parent":2719028,"text":"Grooveshark is hiring developers (front-end/javascript), designers (web UI), admen (yield optimization/digital sales), and more...check out grooveshark.com/careers for more info or send your resume/cover letter/portfolio to careers@grooveshark.com.<p>-chomp","time":1309542802,"type":"comment"},{"by":"vipulved","id":2719899,"kids":[2720016,2720565],"parent":2719028,"text":"Topsy Labs is hiring hackers in San Francisco.<p>We condense nuance from petabytes of fact.  Often in milliseconds.<p>We hack in Python, Perl, C++, Hadoop.<p>We wrote a distributed RDF store that holds 100B triples, and a search engine from filesystem up that organizes indexes in real-time.<p>We run Topsy.com, Otter API (otter.topsy.com) and we are building some amazing new products in the intersection of social data and search.<p>If you do any two of (C++, Perl, Python, Hadoop) really well, write to me at vipul@topsy.com.<p>Vital stats:  32 people. $30M in funding. 1000+ machine cluster.<p>cheers,\nVipul Ved Prakash\nCo-founder, CEO Topsy Labs","time":1309549972,"type":"comment"},{"by":"jnorthrop","id":2740057,"parent":2719028,"text":"Seacoast, NH (full-time): Web/App Developer for The International Association of Privacy Professionals (<a href=\"https://privacyassociation.org\" rel=\"nofollow\">https://privacyassociation.org</a>)<p>We are the world’s largest association for professionals in the field of privacy and data protection (a fast growing field!). We need help expanding our website, tightly integrating a number of 3rd-party systems and implementing plans for new interactive products; both web-based and for mobile specifically. And generally just helping scale up with our growth!<p>The job is an entry-level position and will be working primarily with PHP and .NET.","time":1310068738,"type":"comment"},{"by":"danielhfrank","id":2730355,"parent":2719028,"text":"New York, NY - Software Engineer , fulltime<p>Trendrr is a real-time data processing engine that powers Trendrr.com, Trendrr.tv, and other media experiences. We are a small, lean startup. Our stack is built on open source, and we believe in giving back wherever possible. This is a very small development team, and you will have a hand in everything.<p>For more information about the position see: <a href=\"http://blog.trendrr.com/2011/05/24/software-engineer-wanted-..\" rel=\"nofollow\">http://blog.trendrr.com/2011/05/24/software-engineer-wanted-...</a>. or contact me directly, I am a developer at Trendrr and am happy to answer your questions","time":1309882175,"type":"comment"},{"by":"klochner","id":2719571,"parent":2719028,"text":"San Francisco, CA - RentMineOnline (FBFund '09, SeedCamp '08)<p>We're revolutionizing the marketing industry for apartment communities.  Our company is small, growing and profitable.<p>We're hiring back-end and front-end developers.<p>Our stack is:<p><pre><code>   * nginx\n   * passenger/rails\n   * memcached\n   * jquery, prototype\n   * amazon rds/sdb/s3\n   * hosted at slicehost\n   * facebook/twitter/linkedin integrations\n</code></pre>\nCome join our team in the Presidio and start pushing code from day 1.  See your work have an immediate and important impact on our operations &#38; bottom line.<p>email  kevin@rentmineonline.com","time":1309545173,"type":"comment"},{"by":"BuddhaSource","id":2728515,"kids":[2732506],"parent":2719028,"text":"Building Consumers &#38; business ecosystem using communication<p><a href=\"http://crumbin.com\" rel=\"nofollow\">http://crumbin.com</a><p>Advanced Python &#38; JS Developers<p>Languages &#38; Framework:<p>+3 Python, Erlang, Javascript\n+2 for any of {C, C#, C++, Objective-C, Java}\nBonus if you're intimate with any one language\n+3 Pyramid / Tornado / Django Nonrel<p>Client Side:\n+3 Rich Experience in building JavaScript RIA\n+3 OO JavaScript\n+3 Design Patterns\n+2 Jquery / Dojo<p>Others:<p>+3 NoSql Database\n+3 Experience building RESTful API's\nBonus Experience in building scalable, realtime Internet applications","time":1309836057,"type":"comment"},{"by":"pushpins","id":2720187,"parent":2719028,"text":"Wait? I can redeem on my phone and money comes off at the register. No scanning of the screen, no codes to enter, it's instant and on the spot? Yep!<p>Pushpins (www.pushpinsapp.com) wants to make sure you never have to clip another paper coupon again.<p>You're smart and we're a venture-backed SF-based company looking for Senior PHP/LAMP Developers to help bring instant savings in thousands of grocery stores. We were the #2 productivity app on iTunes and have been featured by Apple multiple times.<p>If you're interested - shoot us an email at jobs@pushpinsapp.com with favorite cereal. Mine's Fruity Pebbles.","time":1309555067,"type":"comment"},{"by":"apinstein","id":2730786,"parent":2719028,"text":"Atlanta, GA<p>We are looking for a Front-end/Back-end/Product person to take over our hosted Real Estate Search solution.<p>Presently our solution is PHP/Postgres/Javascript but we would consider changing technologies for the v2 version of the product, so please don't let the PHP scare you away :)<p>The company is 8 years old, profitable, and we have a plan to get big fast by leveraging one of our other businesses. But we need a strong dev to work on it FT.<p>See full details at: <a href=\"http://jobs.usethesource.com/item?id=125\" rel=\"nofollow\">http://jobs.usethesource.com/item?id=125</a>","time":1309888221,"type":"comment"},{"by":"justin","id":2719628,"parent":2719028,"text":"San Francisco, CA - Justin.tv<p>Justin.tv is already the world's largest live video website (30 million users, 60 million hours of video / month).  Now we are building the world's largest competitive gaming destination in TwitchTV, and the way the world shares mobile video with Socialcam.<p>We are 29 full time now, but growing quickly. Benefits include catered lunch and dinner, anything you could possibly want for your workstation, full stack ownership, and a fast-paced no bullshit work environment.<p>Learn more at - <a href=\"http://jobs.justin.tv\" rel=\"nofollow\">http://jobs.justin.tv</a>","time":1309546009,"type":"comment"},{"by":"cookingrobot","id":2720567,"parent":2719028,"text":"San Francisco, Seattle<p>Shopobot<p>We're building a fresh approach to online shopping - and were recently funded by Google Ventures and AOL Ventures.<p>Looking for java devs.  Extra bonus if you've done online marketing!<p><a href=\"http://jobs.googleventures.com/jobdetail.php?jobid=70661\" rel=\"nofollow\">http://jobs.googleventures.com/jobdetail.php?jobid=70661</a><p><a href=\"http://jobs.googleventures.com/jobdetail.php?jobid=70662\" rel=\"nofollow\">http://jobs.googleventures.com/jobdetail.php?jobid=70662</a><p><a href=\"http://www.shopobot.com\" rel=\"nofollow\">http://www.shopobot.com</a>","time":1309563140,"type":"comment"},{"by":"drgath","id":2720462,"kids":[2720570],"parent":2719028,"text":"Sunnyvale, CA - Yahoo (YUI)<p>The YUI team at Yahoo is looking for a senior JavaScript engineer.  You don't necessarily have to know YUI, but you should be very familiar with other libraries and be a master at JavaScript &#38; DOM scripting.  We build one of the most widely used JS libraries on the web, so we live, eat, and breath JavaScript.  You should too.<p>Our HQ is in Sunnyvale, CA, so you must be located in the bay area, or be able to relocate.  We'll help out with the relocation if you aren't local.<p>Hit me up if you are interested in hearing more.\nDerek (drg@yahoo-inc.com)","time":1309560539,"type":"comment"},{"by":"mikeocool","id":2731823,"parent":2719028,"text":"New York, NY<p>Python/Django Developer at Nestio: <a href=\"http://nestio.com/jobs/\" rel=\"nofollow\">http://nestio.com/jobs/</a><p>Nestio is looking for smart developers who wanna join our team and help make it easier to find a place to live! You: + Are awesome at Python and Django. Or are really awesome at another language/framework. + Probably also know some front end. + Know how to optimize a SQL query. + Write tests.\n+ Care about UX/Design and love talking product.\n+ Enjoy eating sandwiches.<p>Send us resumes, portfolios, links, jokes, embarrassing photos at jobs@nestio.com.","time":1309904098,"type":"comment"},{"by":"phillytom","id":2719748,"parent":2719028,"text":"Conshohocken, PA - Monetate<p>We're a growth-phase startup building SAAS tools for internet marketers to enable real-time testing and targeting of content on their sites.  We have web services at scale, big data, and tons of interesting browser work.  Our languages are Python and JS, although we're happy to give people the space to learn if that's not your specialty.  We've got great projects to work on and a great team to work on them with.<p>We've hired a number of people we've met through HN.  Please feel free to email directly if you'd like to chat -- tom at monetate dot com.","time":1309547706,"type":"comment"},{"by":"asanwal","id":2719735,"parent":2719028,"text":"New York, NY - CB Insights / ChubbyBrain<p>Front End Developer (full-time)<p>We're a National Science Foundation backed startup that aggregates and analyzes private company and investor data.  We are using this data to tackle some very hard problems in some humongous markets.<p>If you have an interest, aptitude and/or obsession with data visualizations, web development, please take a look at the job description here -<p><a href=\"http://www.cbinsights.com/jobs/FrontEndDeveloper-CBInsights.pdf\" rel=\"nofollow\">http://www.cbinsights.com/jobs/FrontEndDeveloper-CBInsights....</a>","time":1309547590,"type":"comment"},{"by":"cristinacordova","id":2720732,"parent":2719028,"text":"Palo Alt0, CA (full-time): Pulse News<p>We make a news reading application for iPhone, iPad, Android phones and tablets. We're at 4M users and just raised our Series A financing. We're hiring on our iOS, Android, Web, Backend &#38; Business Development teams. For more about us and who we're looking for, see our hiring page: <a href=\"http://www.pulse.me/jobs/#/working-at-pulse\" rel=\"nofollow\">http://www.pulse.me/jobs/#/working-at-pulse</a><p>Feel free to shoot me an email at cc[at]alphonsolabs[dot]com if you have any questions about the positions or want to join us!","time":1309568280,"type":"comment"},{"by":"kevindication","id":2719318,"parent":2719028,"text":"National Harbor area, Maryland<p>Several positions open for Web Developers/Designers and system administrator/engineers. Requires active TS/SCI.<p><a href=\"http://woti.jobs\" rel=\"nofollow\">http://woti.jobs</a>","time":1309542131,"type":"comment"},{"by":"douggaff","id":2719828,"kids":[2720103],"parent":2719028,"text":"Boston, MA - NPR Digital Services<p>NPR Digital Services is a rapidly growing group inside of National Public Radio that builds a variety of web products for NPR and public media member stations. We're a fun office with a great technical group and an awesome location in the Fort Point Channel - Boston's \"Innovation District\".<p>We're building a variety of products on Drupal 7 and we're looking for some awesome Drupal developers or hard-core PHP developers wanting to get into Drupal.<p><a href=\"http://bit.ly/kO3rGf\" rel=\"nofollow\">http://bit.ly/kO3rGf</a>","time":1309548826,"type":"comment"},{"by":"SoulAuctioneer","id":2741680,"parent":2719028,"text":"Tokyo, Japan (full time): Wall Street Associates<p>Looking for an awesome Senior Web Application Developer (C#, OO Javascript, ExtJS, NoSQL, web services) and a QA &#38; Support Technician (a new position so help us design the role!)<p>We're building a CRM web app for the Recruitment Industry, from which we will ultimately extract an application platform. If you like working with cutting-edge tech, passionate geeks, and cake, come talk to us! Deets are here: <a href=\"http://beastcrm.com/about/jobs/\" rel=\"nofollow\">http://beastcrm.com/about/jobs/</a>","time":1310113680,"type":"comment"},{"by":"levonjlloyd","id":2719457,"kids":[2719500],"parent":2719028,"text":"Long Island, NY<p>General Sentiment(<a href=\"http://www.generalsentiment.com\" rel=\"nofollow\">http://www.generalsentiment.com</a>) is currently hiring for 2 positions<p>Software Engineer - Systems\nLooking for a software engineer with a broad base of talents/interests to help improve our back-end systems. We currently use Hadoop, Cassandra, Amazon EC2<p>Software Engineer/UI lead\nWe are looking for someone to help us build up our front-end team.  We currently use Java Struts on the server side.<p>Send email to levon@generalsentiment.com if interested.","time":1309543845,"type":"comment"},{"by":"psota","id":2720236,"parent":2719028,"text":"Cambridge, MA - Panjiva is building a platform that is changing the way companies do business across borders. We're a small entrepreneurial team of MIT computer science grads, and are backed by the same VCs as ITA Software and Akamai. Over a million people use Panjiva every month; we're also profitable and growing fast. Hiring full-time (and interns) in engineering (frontend UI/UX; web; backend data mining/ops) and business (marketing, sales, etc.). See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a> for more info.","time":1309555950,"type":"comment"},{"by":"WorkInKarlsruhe","id":2720800,"kids":[2721740],"parent":2719028,"text":"Any jobs in Karlsruhe, Germany?  I'm sure there are --- the question is, why aren't they reading Hacker News?  Someone in Karlsruhe poke your entrepreneurial friends to post their jobs here.","time":1309571441,"type":"comment"},{"by":"czue","id":2719439,"parent":2719028,"text":"Boston, MA.<p>Dimagi is hiring a Senior Engineer in Boston. We are a small social enterprise that make apps that support healthcare systems in the developing world. We focus on mobile and SMS-based applications.<p>Any excellent programmers welcome to apply. Experience with Python, CouchDB or Android is a plus.<p>Dimagi: <a href=\"http://www.dimagi.com/\" rel=\"nofollow\">http://www.dimagi.com/</a> \nCareers: <a href=\"http://www.dimagi.com/about/careers/\" rel=\"nofollow\">http://www.dimagi.com/about/careers/</a>","time":1309543591,"type":"comment"},{"by":"abreckle","id":2719292,"parent":2719028,"text":"Visual.ly, in San Francisco, CA\nWe are building a next generation data visualization platform and are looking for front-end hackers with demonstrated expertise in all or many of the following to round out our engineering team. 5+ years javascript experience, we use backbone.js, jQuery, HTML5 and SVG.<p>Apply here if interested: <a href=\"http://visually.jobscore.com/jobs/visually/lead-ui-engineer/dah_g6AUar4kwHeJe4bk1X\" rel=\"nofollow\">http://visually.jobscore.com/jobs/visually/lead-ui-engineer/...</a>","time":1309541856,"type":"comment"},{"by":"amirnathoo","id":2720022,"parent":2719028,"text":"London and San Francisco<p>WebMynd has been doubling revenue every 3 months for the past year (while in private beta) and is growing the team fast:<p>* iOS developer<p>* IE developer<p>* Javascript developers (<a href=\"http://www.webmynd.com/jobs\" rel=\"nofollow\">http://www.webmynd.com/jobs</a>)<p>We're making cross-platform app development simple by building a development platform across mobile apps and browser add-ons. Backed by Y Combinator, 500 Startups, Founders Fund and great angel investors.","time":1309552043,"type":"comment"},{"by":"ruff","id":2720702,"parent":2719028,"text":"Emeryville, CA (super short/BART ride from SF--No remotes)<p>Location Labs (<a href=\"http://www.locationlabs.com/jobs.php\" rel=\"nofollow\">http://www.locationlabs.com/jobs.php</a>)<p><pre><code>  * Back-end devs (Python, Java, Ruby)\n  * Front-end devs (JavaScript, CSS, HTML5)\n  * Mobile devs (Android, iPhone, Blackberry, BREW)\n  * UX gurus (usability, designers, tech writers)\n</code></pre>\nCompany is growing very rapidly in an incredibly exciting space--heavy focus in mobile personal security.","time":1309567413,"type":"comment"},{"by":"hc5","id":2731010,"parent":2719028,"text":"San Francisco, CA (111 Sutter st.)<p>Rails engineer, fulltime, onsite<p>Tapjoy is looking for backend Rails engineers to join our current engineering team of 12 (6 backend, 2 frontend, 3 client, 1 designer). The company is 4 years old, profitable, and looking to grow.<p><a href=\"https://www.tapjoy.com/careers/software_engineer\" rel=\"nofollow\">https://www.tapjoy.com/careers/software_engineer</a><p>I would appreciate it if you mention me (hc5) for referral, but no pressure ;)","time":1309891272,"type":"comment"},{"by":"jamiely","id":2733518,"parent":2719028,"text":"Philadelphia, PA: The Wharton School at the University of Pennsylvania<p>The Learning Lab develops and runs simulations for use in the curriculum. We are open to using a variety of technologies. Time is split between project management, in-class support, working with instructors, and development. For more information, see: <a href=\"http://beacon.wharton.upenn.edu/learning/jr-sr-developer/\" rel=\"nofollow\">http://beacon.wharton.upenn.edu/learning/jr-sr-developer/</a>","time":1309954842,"type":"comment"},{"by":"superjerca","id":2736035,"parent":2719028,"text":"Bellevue, WA<p>ClassifiedAds.com, Inc<p><a href=\"http://www.classifiedads.com/\" rel=\"nofollow\">http://www.classifiedads.com/</a><p>Linux/PHP Software Engineer<p>We're a small startup but we're one of the largest classified ads websites.<p>Check us out on Stack Overflow Careers:<p><a href=\"http://careers.stackoverflow.com/jobs/12214/linux-php-software-engineer-classifiedads-com\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/12214/linux-php-softwa...</a>","time":1309988702,"type":"comment"},{"by":"freshfey","id":2720351,"parent":2719028,"text":"Localuncle.com (formerly known as loqize.me) - a location based Q6A site is hiring:<p><a href=\"http://blog.localuncle.com/jobs/\" rel=\"nofollow\">http://blog.localuncle.com/jobs/</a><p>This is what TNW wrote about us: <a href=\"http://goo.gl/nqQdK\" rel=\"nofollow\">http://goo.gl/nqQdK</a><p>Mostly backend, RoR hackers. Dev interns and business guys are also welcome! I intern there as a web dev and I couldn't ask for a better team. Contact me or jobs@localuncle.com","time":1309558382,"type":"comment"},{"by":"guiseppecalzone","id":2719474,"parent":2719028,"text":"San Francisco, CA.<p>HelloFax<p>We're going to be the way that everyone signs documents in the future.<p>-Looking for an all around web developer. Cmfortable with PHP, MySQL, JavaScript (jQuery), HTML, CSS.<p>-Email us at jobs@hellofax.com<p>We're growing fast, already make money and we have a huge vision. If you live elsewhere, we'll help you move to the bay area.<p>Visit us at <a href=\"http://www.hellofax.com\" rel=\"nofollow\">http://www.hellofax.com</a>.","time":1309544045,"type":"comment"},{"by":"sylvinus","id":2719156,"parent":2719028,"text":"Paris, France<p>Joshfire ( <a href=\"http://joshfire.com/company\" rel=\"nofollow\">http://joshfire.com/company</a> ) is looking for :<p>- experienced JavaScript developers<p>- designers (from web to smart objects)<p>We do the open source multi-device framework that was #1 on HN earlier today : <a href=\"http://framework.joshfire.com\" rel=\"nofollow\">http://framework.joshfire.com</a><p>We are kind of cool but come see for yourself...<p>jobs at joshfire.com","time":1309540146,"type":"comment"},{"by":"abreckle","id":2719362,"parent":2719028,"text":"San Francisco, CA\nVisual.ly<p>We are building a next generation data visualization platform and are looking for few front-end hackers with demonstrated expertise in all or many of the following and a passion for data visualization to round out our core engineering team.<p>* Javascript, Backbone.js &#38; jQuery\n* CSS3\n* HTML5\n* SVG<p>Click here to apply:\n<a href=\"http://visually.jobscore.com/list\" rel=\"nofollow\">http://visually.jobscore.com/list</a>","time":1309542641,"type":"comment"},{"by":"remi","id":2720285,"parent":2719028,"text":"Quebec City, Quebec, Canada<p>We are looking for iOS, Android and other mobile developers, as well as Ruby/whatever backend and HTML/CSS/JavaScript frontend developers.<p>We're a team of passionate people working with large companies on exciting and innovative projects, as well as out own homemade products.<p>We are dedicated on building the best place to work at :)<p><a href=\"http://vie.mirego.com/en\" rel=\"nofollow\">http://vie.mirego.com/en</a>","time":1309556966,"type":"comment"},{"by":"dan_manges","id":2719262,"parent":2719028,"text":"Chicago, IL - Braintree<p>We mostly work with Ruby/Rails, but we'd be interested in a person without Ruby experience who is skilled with testing, software / web dev in general, and GNU/Linux.<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/inside-braintree/how-we-built-the-software-that-processes-billions-in-payments\" rel=\"nofollow\">http://www.braintreepayments.com/inside-braintree/how-we-bui...</a>","time":1309541511,"type":"comment"},{"by":"kodeshpa","id":2720033,"parent":2719028,"text":"Do you love music? do you listen music while coding ? Oh ya, then come on, join us . We are TuneIn.com, bringing seamless music experience from mobile, web ,TV  platform to cars.  Write a code to reach million and millions users everyday. Work with music lovers on vast range of products to solve technical problems.<p>Multiple positions available check out at <a href=\"http://tunein.com/careers/\" rel=\"nofollow\">http://tunein.com/careers/</a>","time":1309552150,"type":"comment"},{"deleted":true,"id":2719417,"parent":2719028,"time":1309543394,"type":"comment"},{"by":"heyawanna","id":2740962,"parent":2719028,"text":"Heyawanna Labs, San Francisco CA<p>We're a stealth startup building a platform that allows users to find and share interesting things to do.<p>We're looking for:<p>- Infrastructure engineers: PHP, MySQL<p>- Product engineers: Javascript, Html, CSS<p>- UX/Designers: strong at UX<p>Great Benefits: Paid return flight to San Francisco, accommodation, activities budget, gym membership.<p>Email expressions of interest to jobs@heyawanna.com","time":1310088289,"type":"comment"},{"by":"xpose2000","id":2720161,"parent":2719028,"text":"New York, NY - Lead Architect<p>Popdust is looking for an expert architect/technology lead to join us.<p>Have you built scalable web apps before?\nAre you an expert in PHP?\nDo you know Wordpress and feel right at home customizing it?\nDo you look forward to working with terminal windows?<p>Pluses include:\njQuery/jQueryUI,\nHTML/CSS skills<p>Find out more here: <a href=\"http://popdust.com/jobs/\" rel=\"nofollow\">http://popdust.com/jobs/</a>","time":1309554389,"type":"comment"},{"by":"stephstad","id":2751423,"parent":2719028,"text":"Raleigh, NC; Westford, MA; Mountain View, CA; New York, NY; Tysons Corner, VA (full time): Red Hat<p>Several positions available. Information on open positions at <a href=\"https://careers.redhat.com/ext/search\" rel=\"nofollow\">https://careers.redhat.com/ext/search</a><p>Working at Red Hat means working beyond the borders of obvious and ordinary. This is a global company growing fast and bringing open source into the mainstream.","time":1310402350,"type":"comment"},{"by":"tysone","id":2720277,"parent":2719028,"text":"The New York Times<p>* Software Engineers, Architects<p>* iOS Software Engineers<p>* JavaScript Engineers<p>* Developer Advocate<p>* QA, SEO, Analytics<p>* News Applications (Rails) and Multimedia (JavaScript, Flash/ActionScript)<p>More information: <a href=\"http://bit.ly/nytjobs\" rel=\"nofollow\">http://bit.ly/nytjobs</a> and <a href=\"http://www.nytco.com/careers/index.html\" rel=\"nofollow\">http://www.nytco.com/careers/index.html</a>","time":1309556731,"type":"comment"},{"by":"adjohn","id":2720770,"parent":2719028,"text":"San Francisco, CA<p>Midokura<p>Join a small pre-series A company to develop disruptive networking technologies.  We're a multi-national team on three continents.  Help us build out our SF office.<p>We're looking for Front-end engineers, and Senior Engineers (backend).<p><a href=\"http://midokura.com/careers.html\" rel=\"nofollow\">http://midokura.com/careers.html</a><p>Hit me up if you have any questions or comments: adam@midokura.com","time":1309570112,"type":"comment"},{"by":"buymorechuck","id":2719308,"parent":2719028,"text":"Palo Alto, CA - Flipboard, Inc. H1B<p>We're seeking iOS and web developers with a passion for design and craftsmanship. We're doing crazy things at the intersection of native and web platforms, and if that appeals to you, let me know!<p><a href=\"http://flipboard.com/jobs\" rel=\"nofollow\">http://flipboard.com/jobs</a><p>[[NSString alloc] initWithFormat:@\"%@+HN@%@.com\", @\"charles\", @\"flipboard\"] // is this safe now?","time":1309542042,"type":"comment"},{"by":"yters","id":2720747,"parent":2719028,"text":"I've only seen 2 part time jobs here.  Are part time positions that uncommon?  I'd be interested working for some of these people, but I have another job.","time":1309568797,"type":"comment"},{"by":"gommm","id":2719519,"parent":2719028,"text":"Shanghai, China<p>Looking for an INTERN<p>We are a startup doing consulting on the side to finance our product.\nWe mostly work with Ruby on Rails but also have a new project in Node.js. When something is a better tool for the job, we use it and if you come and convince us that it's the case for a part of your project, we will listen to you. So if you're interested, send an email at intern@webagecorp.com","time":1309544517,"type":"comment"},{"by":"lautenbach","id":2719600,"parent":2719028,"text":"San Francisco, CA - Rexly - iOS team<p>Rexly is creating the best way to discover digital content (music, movies, books, and tv) through trusted friends. We are looking to grow our mobile team by adding an iOS designer and developer in the next 4-6 weeks.<p>our current web product here: <a href=\"http://www.rexly.com/\" rel=\"nofollow\">http://www.rexly.com/</a><p>email to discuss: bradley @ rexly.com","time":1309545588,"type":"comment"},{"by":"lamplighter","id":2719286,"parent":2719028,"text":"Uken Games in downtown Toronto<p>Uken is looking for talented developers to help us build mobile games in HTML5 and push what is possible in a browser.<p>We are a profitable startup (~17 employees) experiencing massive growth, with over 100,000 players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1309541819,"type":"comment"},{"by":"jonursenbach","id":2720483,"parent":2719028,"text":"San Francisco (full-time, remote for right fit) - gdgt<p>We're 5 guys right now with an aggressive roadmap, and want to expand to at least 6. Looking for either a core or test engineer.<p>Stack: PHP, NodeJS, JS, jQuery, MySQL, Gearman, Memcache<p>Ping me at jon@gdgt.com if you want any more info or checkout <a href=\"http://gdgt.com/jobs\" rel=\"nofollow\">http://gdgt.com/jobs</a>","time":1309561135,"type":"comment"},{"by":"dennyabraham","id":2730584,"parent":2719028,"text":"Didn't <a href=\"http://jobs.usethesource.com/jobs\" rel=\"nofollow\">http://jobs.usethesource.com/jobs</a> replace the whoishiring bot?","time":1309884816,"type":"comment"},{"by":"im_asl","id":2720368,"parent":2719028,"text":"Mountain View (Intern, H1B): Addepar<p>Addepar is recreating the infrastructure that powers global wealth management. Addepar's technology increases efficiency, transparency, and sophistication within the global investment industry, thwarting fraud and furthering meritocracy in one of the most important areas of the global economy.<p>Careers.addepar.com","time":1309558786,"type":"comment"},{"by":"aerotrain","id":2730835,"parent":2719028,"text":"Mumbai, India\nDirector UI/UX at Webklipper.<p>Webklipper is building a customer engagement tool for website owners called WebEngage (<a href=\"http://webklipper.com/webengage\" rel=\"nofollow\">http://webklipper.com/webengage</a>). More details about the job - <a href=\"http://jobs.hasgeek.in/view/cn5eh\" rel=\"nofollow\">http://jobs.hasgeek.in/view/cn5eh</a>","time":1309888906,"type":"comment"},{"by":"philfreo","id":2719533,"parent":2719028,"text":"San Francisco, CA<p>Quizlet.com needs a few great developers. We are a small team hoping to make a big difference in education by providing mostly free study tools for students. Close to 2 million registered users. (PHP, JavaScript, etc.)<p><a href=\"http://quizlet.com/jobs/\" rel=\"nofollow\">http://quizlet.com/jobs/</a> or email me (phil@the domain)","time":1309544629,"type":"comment"},{"by":"fourk","id":2730702,"parent":2719028,"text":"San Francisco, CA\nwww.focus.com is hiring another senior Django developer. What you should be: smart, use Python, Javascript (jQuery) and CSS (Blueprint/sass) or some combination of these things. Must be willing to work on-site in San Francisco. Our offices are about a block from BART's Embarcadero stop.\nContact info is in my profile.","time":1309886974,"type":"comment"},{"by":"thomd","id":2720379,"parent":2719028,"text":"Cambridge and Brighton, UK - Aptivate<p>Join us and work for social good. We are looking for smart software developers to join our team and change the way technology is used in the international development community.<p>See <a href=\"http://www.aptivate.org/job-web-developer\" rel=\"nofollow\">http://www.aptivate.org/job-web-developer</a>","time":1309559094,"type":"comment"},{"by":"jaos","id":2720358,"parent":2719028,"text":"Pittsburgh, PA (intern, full-time,remote): Timesys<p>We are looking for Linux kernel hackers, build system gurus, gnu tool hackers, userspace application developers, and support engineers.<p><a href=\"http://www.timesys.com/company/careers\" rel=\"nofollow\">http://www.timesys.com/company/careers</a><p>tell em jaos sent you","time":1309558510,"type":"comment"},{"by":"steilpass","id":2719306,"parent":2719028,"text":"Cologne, Germany<p>Looking for developers. Our attitude:<p>* Being truely agile<p>* Diversity, self-organizing and self-fulfillment<p>* The right tools for the right job<p>* Big Data<p>* Fun at work<p>Look at <a href=\"http://adcloud.de/dev\" rel=\"nofollow\">http://adcloud.de/dev</a> and ping me.","time":1309542031,"type":"comment"},{"by":"sanj","id":2719248,"parent":2719028,"text":"TripAdvisor in Newton, MA<p>Hiring at all levels.  You can read about how we do stuff here:<p><a href=\"http://highscalability.com/blog/2011/6/27/tripadvisor-architecture-40m-visitors-200m-dynamic-page-view.html\" rel=\"nofollow\">http://highscalability.com/blog/2011/6/27/tripadvisor-archit...</a>","time":1309541350,"type":"comment"},{"by":"medwezys","id":2720319,"parent":2719028,"text":"Central London (MAYFAIR), Rails Developer\n<a href=\"http://alphasights.com/rubyjob\" rel=\"nofollow\">http://alphasights.com/rubyjob</a><p>Central London (MAYFAIR), UI Designer / Front End Developer\n<a href=\"http://alphasights.com/designerjob\" rel=\"nofollow\">http://alphasights.com/designerjob</a>","time":1309557718,"type":"comment"},{"by":"lukatmyshu","id":2719668,"parent":2719028,"text":"Mountain View, CA\nSan Francisco, CA\nNew York City, NYC<p>Meebo<p>Work on projects that reach over 185+ million users a month. \nremote employee's totally cool as well.  Check out a list of all of our jobs here <a href=\"http://www.meebo.com/jobs/\" rel=\"nofollow\">http://www.meebo.com/jobs/</a>","time":1309546512,"type":"comment"},{"by":"bobhaigler","id":2719621,"parent":2719028,"text":"San Francisco, CA - 1life Healthcare <a href=\"http://onemedical.com\" rel=\"nofollow\">http://onemedical.com</a><p>We're hiring a couple of Rails developers.  One front-end focused, one general.  Rails/jQuery/CSS...<p>Small team, looking for HN type (amicable) folks.<p>email bhaigler@1life.com","time":1309545881,"type":"comment"},{"by":"moorman","id":2729609,"parent":2719028,"text":"Greater Chicago metro area (full-time)<p>Geeknet - SourceForge, Slashdot, Freshmeat, Thinkgeek<p>Position: System Administrator - F5, Force 10, CentOS, NAS/SAN, datacenter<p><a href=\"https://home.eease.com/recruit/?id=715221\" rel=\"nofollow\">https://home.eease.com/recruit/?id=715221</a>","time":1309870371,"type":"comment"},{"by":"dshah","id":2719887,"parent":2719028,"text":"Cambridge, MA - HubSpot<p>We're a software company looking for Java and Python web developers.<p>For two years in a row, we've been voted the best company to work for in the Boston area.  Come find out why.<p><a href=\"http://jobs.hubspot.com/\" rel=\"nofollow\">http://jobs.hubspot.com/</a>","time":1309549823,"type":"comment"},{"by":"killion","id":2720092,"parent":2719028,"text":"San Francisco (SOMA), CA - Apartmentlist.com<p>We are a small very profitable startup building the first apartment recommender. We are looking for Rails engineers and Hadoop/Hive machine learning experts to join our team.<p>Send me an email if you are interested kyle@apartmentlist.com","time":1309553289,"type":"comment"},{"by":"friism","id":2720956,"parent":2719028,"text":"San Francisco and Copenhagen, Denmark<p>We're looking for superb engineers to help us build Heroku for .NET.<p>More info here: <a href=\"http://blog.appharbor.com/2011/07/02/appharbor-is-hiring\" rel=\"nofollow\">http://blog.appharbor.com/2011/07/02/appharbor-is-hiring</a>","time":1309579018,"type":"comment"},{"by":"kortina","id":2721928,"parent":2719028,"text":"Venmo - we are going to replace credit cards.<p>We're hiring in NYC:<p>* iOS engineers<p>* Android engineers<p>* python / platform engineers<p>Please send some links to apps or projects you have worked on to jobs@venmo.com or email me directly - kortina@","time":1309626899,"type":"comment"},{"by":"RobbieStats","id":2719535,"parent":2719028,"text":"RTP, NC - StatSheet<p>* Ruby Developer \n* Designer<p>Must love sports<p>Email robbie@statsheet","time":1309544635,"type":"comment"},{"by":"rkarumanchi","id":2720710,"parent":2719028,"text":"Flipkart.com, Bangalore<p>In a nutshell, this is what we are currently working towards:   US : Amazon.com :: India : Flipkart.com<p><a href=\"http://www.flipkart.com/s/careers/tech\" rel=\"nofollow\">http://www.flipkart.com/s/careers/tech</a>","time":1309567587,"type":"comment"},{"by":"sogrady","id":2720260,"parent":2719028,"text":"Greater Boston area (intern, part-time, remote)<p>RedMonk, a developer oriented analyst firm, is looking for someone to help with research, lightweight programming and visualization tasks.<p>Ping me - sogrady@redmonk.com - for details.","time":1309556372,"type":"comment"},{"by":"sharksandwich","id":2719406,"parent":2719028,"text":"Atlanta, Ga<p>We're a fast-growing startup focused on making green building easier. We're looking for an excellent Rails developer with an interest in sustainability.<p>email me and mention Hacker News. stuart at ecoscorecard dot com","time":1309543219,"type":"comment"},{"by":"subv3rsion","id":2719342,"kids":[2720336],"parent":2719028,"text":"Portsmouth, NH - PixelMEDIA<p>Many positions open for Developers, Designers, UX, and SEO/PPC<p><a href=\"http://www.pixelmedia.com/company/careers.aspx\" rel=\"nofollow\">http://www.pixelmedia.com/company/careers.aspx</a>","time":1309542408,"type":"comment"},{"by":"namityadav","id":2719666,"parent":2719028,"text":"Groupon is hiring in Palo Alto, CA &#38; Chicago, IL<p><a href=\"http://www.groupon.com/jobs\" rel=\"nofollow\">http://www.groupon.com/jobs</a><p>Design, UX, Data Analyst, Android, iOS, Web-apps (Rails), Testing, ...","time":1309546486,"type":"comment"},{"by":"avivw","id":2743957,"parent":2719028,"text":"New York City\nYodle is looking for a Quantitative Software Developer\n<a href=\"http://hire.jobvite.com/j/?cj=ouwOVfwt&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=ouwOVfwt&#38;s=Hackernews</a>","time":1310157026,"type":"comment"},{"by":"andrewhubbs","id":2732786,"parent":2719028,"text":"San Francisco CA (full-time): Rally<p>Help change the world of charitable giving<p>Hiring Developers and UX Designer<p><a href=\"https://rally.org/corp/careers\" rel=\"nofollow\">https://rally.org/corp/careers</a>","time":1309933440,"type":"comment"},{"by":"Bruce_Adams","id":2720275,"parent":2719028,"text":"Vivisimo, Inc. in Pittsburgh, PA\n* Ruby on Rails 3.0 on JRuby/Tomcat\n* Java\n* C<p><a href=\"http://vivisimo.com/about/careers.html\" rel=\"nofollow\">http://vivisimo.com/about/careers.html</a>","time":1309556656,"type":"comment"},{"by":"ig1","id":2719729,"kids":[2728962],"parent":2719028,"text":"If you're in the UK check out:<p><a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>We've list lots of startup jobs.","time":1309547468,"type":"comment"},{"by":"iampims","id":2730866,"parent":2719028,"text":"San Francisco, CA.<p>Formspring is looking for Engineers (front-end, back-end).\n<a href=\"http://about.formspring.me/jobs\" rel=\"nofollow\">http://about.formspring.me/jobs</a>","time":1309889338,"type":"comment"},{"by":"imnieves","id":2720897,"parent":2719028,"text":"anywhere - any level of commitment : discopedia<p>discopedia is applying the massive amounts of rich, human-written, structured data to two huge problems:\n1) social search\n2) web search<p>We are still very early stage, pre-funding, and lean and mean!  But we are driven by the desire to do something big.  Really BIG, with Wikipedia.<p>If you are interested in working with us (currently equity only) or investing please contact:\nian@discopedia.com","time":1309575587,"type":"comment"},{"by":"knerd1","id":2720726,"parent":2719028,"text":"Knewton. Engineers!! Kickass offices in Union Square. Company that's doing good in this world, working to revolutionize education.<p>jobs (at) knewton (dot) com","time":1309568015,"type":"comment"},{"by":"jes5199","id":2719452,"parent":2719028,"text":"Square in San Francisco, CA\n<a href=\"http://squareup.com/jobs\" rel=\"nofollow\">http://squareup.com/jobs</a>\nRuby, JRuby, Java, devops, design, UX,...","time":1309543719,"type":"comment"},{"by":"yawniek","id":2727996,"kids":[2770697],"parent":2719028,"text":"zurich, switzerland<p>devops/system engineer<p>- you love linux<p>- you can code and understand (ruby, python, java)<p>- you like to talk to developers and help them<p>- you are a developer yourself<p>- you want to bring our platform to the next level<p>- we are the most frequented swiss website (commercial) @ ~3mio uniques<p>- international teams<p>- very skilled teams<p>- for more email me","time":1309816449,"type":"comment"},{"by":"js2","id":2719398,"parent":2719028,"text":"Mountain View, CA - RockMelt is looking for Windows (C++) and Mac (Objective-C++) developers to help build our web browser.<p>jay@rockmelt.com","time":1309543132,"type":"comment"},{"by":"danielepolencic","id":2729212,"parent":2719028,"text":"London, MadBid.com<p>MadBid is the UK's leading pay-to-bid auction site<p>Hiring: back and front end developers (PHP)<p>email jobs@madbid.com","time":1309859077,"type":"comment"},{"by":"ldm5180","id":2719721,"kids":[2721512],"parent":2719028,"text":"LineRate Systems : Denver/Boulder, CO\n<a href=\"http://lineratesystems.com/jobs.php\" rel=\"nofollow\">http://lineratesystems.com/jobs.php</a>","time":1309547285,"type":"comment"},{"by":"nelken","id":2721360,"parent":2719028,"text":"Cambridge, MA: Outbrain Research Intern\n<a href=\"http://www.outbrain.com/jobs/BO#1\" rel=\"nofollow\">http://www.outbrain.com/jobs/BO#1</a>","time":1309599340,"type":"comment"},{"deleted":true,"id":2719288,"parent":2719028,"time":1309541836,"type":"comment"},{"by":"khangtoh","id":2719854,"parent":2719028,"text":"If you are into HTML5 and social games, we are working on a mobile social gaming product and we need you.<p>khang@leftright.co","time":1309549201,"type":"comment"},{"by":"hagyma","id":2720107,"parent":2719028,"text":"Budapest, Hungary<p>Symbler is hiring fanatic Python coders and iOS devs!<p>Apply here: jobs at symbler dot com","time":1309553575,"type":"comment"},{"by":"purzelrakete","id":2719310,"parent":2719028,"text":"berlin: <a href=\"http://soundcloud.com/jobs\" rel=\"nofollow\">http://soundcloud.com/jobs</a>","time":1309542066,"type":"comment"},{"by":"teddyp","id":2719199,"kids":[2719680],"parent":2719028,"text":"NYC - Software engineer.Yodle.com (<a href=\"http://www.yodle.com\" rel=\"nofollow\">http://www.yodle.com</a>)<p>Solve one of the problems correctly and get an interview.\n<a href=\"http://www.yodle.com/careers/job-details/software-engineer-new-york-ny/\" rel=\"nofollow\">http://www.yodle.com/careers/job-details/software-engineer-n...</a><p>• Our software engineers are passionate about technology and programming, they’re smart, no-nonsense developers who move quickly and get things done. The team uses an agile development process, performs code reviews, runs automated unit tests, and has a distinct QA team. Our engineers work in an open, collaborative, team oriented environment.\n• Our engineers work on everything from user-interface, backend, content management to messaging, database systems and web services. Regardless of which components you touch, we’ll want you to be involved in design, coding, testing and running the systems.\n• Our engineers solve a variety of complex and challenging business problems with cutting edge technology.\n• We are constantly innovating! We look at ways to improve our core products, seek out products in the market that can be built better and we have an Innovation Department that addresses the future needs of our industry - our engineers are building the software to meet those needs.\n• Engineers have a high degree of flexibility in choosing which of the many ongoing projects they work on. We have shared ownership of our code base. Anyone can and is expected to work on and improve any piece of code. There are no silos!\n• We explore new technologies and find the best tools for the job. While java is our predominant language, we are using javascript, python, scala and groovy as well.<p>Qualifications\n• 0 to 4 years of experience\n• Excellent coding and design skills. Software that works, is reliable, testable and maintainable should be what you do by default.\n• You enjoy writing software and take pride in what you build.\n• Having programmed in Java will help you get going faster, but your primary languages aren’t as important as being a great programmer.\n• SQL proficiency, particularly with PostgreSQL is a plus\n• Strong communications skills, both written and verbal\n• BA/BS or above from a top Computer Science program\n• You should be able to work daily in our office in New York City<p>Benefits\n• Competitive base\n• Tuition assistance\n• Health/Dental benefits, 401 (K) plan\n• Great work environment - we have fun!\n• Accessible and open-minded leadership\n• Opportunity to work with smart people and learn a lot about one of the fastest growing industries<p>To Apply:\nclick this link and solve one of the two problems.  If you get it right you will get a call.  Good luck.<p><a href=\"http://www.yodle.com/careers/job-details/software-engineer-new-york-ny/\" rel=\"nofollow\">http://www.yodle.com/careers/job-details/software-engineer-n...</a>","time":1309540600,"type":"comment"},{"by":"jlev","dead":true,"id":2719528,"parent":2719028,"text":"Political Non-Profit Hiring Web Developer / Technology Producer<p>Citizen Engagement Laboratory (CEL) is a nonprofit organization that inspires political and social change using technology and digital media. We do this by incubating national online organizing projects like ColorOfChange.org and Presente.org, and running a wide array of issue-based campaigns.<p>CEL is hiring a Web Developer to support all aspects of our organizing work, including design and implementation of new web sites and web applications and maintenance of existing web assets. This person will join two other web developers to join our expanding technology team. We are a django shop, and build custom tools that are on the cutting edge of online organizing.<p>Full listing at <a href=\"http://www.python.org/community/jobs/\" rel=\"nofollow\">http://www.python.org/community/jobs/</a><p>CEL is also hiring a Technology Producer to play the lead project management role for our technology department. We're looking for someone who gets fired up about going from concept to launch in a week, can manage multiple projects at once, is supremely detail oriented, has a deft touch for getting people to meet deadlines, and loves developing systems for better communication and efficiency. The Technology Producer will work closely with two software developers as well as a host of campaigners, strategists, and partners.<p>Full listing at <a href=\"http://sfbay.craigslist.org/eby/sof/2467427022.html\" rel=\"nofollow\">http://sfbay.craigslist.org/eby/sof/2467427022.html</a><p>This is a mission driven organization, and our most successful employees (even technologists) believe strongly in the content of our work. If you want your code to help everyday people to create political and social change, this is the job for you.<p>Location in Berkeley, CA\nContact jobs@engagementlab.org to apply","time":1309544581,"type":"comment"},{"by":"GaryOlson","id":2720609,"parent":2719028,"text":"Richardson, TX<p>College of Engineering  \nComputing Services Manager<p><a href=\"http://www.utdallas.edu/hrm/work/\" rel=\"nofollow\">http://www.utdallas.edu/hrm/work/</a><p><a href=\"http://ecs.utdallas.edu\" rel=\"nofollow\">http://ecs.utdallas.edu</a><p>Work with faculty and staff in Electrical, Mechanical, Material Sciences, BioMedical, Telecom, and Computer Engineering and Computer Sciences in education and research to build and operate our growing computing and network systems.<p>Yes, it's government work and sometimes it is not pretty. But Texas has committed to building first class Universities.\nAlso need Windows System Administrator for Computer Science.","time":1309564060,"type":"comment"}]}