{"comments":[{"by":"marcia","id":3301216,"kids":[3304094],"parent":3300290,"text":"Mountain View - Khan Academy (full-timers and interns welcome year-round)<p>Our mission is to provide a world-class education to anyone, anywhere. We already have millions of students learning every month, and we're growing quickly.<p>Our students answer over 1.2 million math exercise problems per day, all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>, <a href=\"http://ejohn.org/blog/khan-exercise-rewrite/\" rel=\"nofollow\">http://ejohn.org/blog/khan-exercise-rewrite/</a>), and Sal's videos have been viewed over 99 million times. We're just getting started feeding this data we're collecting back into the product to help our users learn more. If you're interested in data, analytics, and education, this is a dream gig.<p>Plus, it's one of the highest educational impact positions you can imagine.<p>We're hiring all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1322770512,"type":"comment"},{"by":"ig1","id":3300706,"kids":[3300824,3300850],"parent":3300290,"text":"Summary of startup related job boards from around the world, most of them are broadly recruiter free:<p>======================<p>US:<p>Crunchboard <a href=\"http://www.crunchboard.com/jobs/\" rel=\"nofollow\">http://www.crunchboard.com/jobs/</a><p>Startuply <a href=\"http://www.startuply.com/\" rel=\"nofollow\">http://www.startuply.com/</a><p>YC Company Jobs: <a href=\"http://news.ycombinator.com/jobs\" rel=\"nofollow\">http://news.ycombinator.com/jobs</a><p>======================<p>UK:<p>CoderStack (Developer Jobs - run by me) <a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>Mind The Product (Product Management Jobs) <a href=\"http://mindtheproduct.com/jobs/\" rel=\"nofollow\">http://mindtheproduct.com/jobs/</a><p>Work in Startups <a href=\"http://www.workinstartups.com/\" rel=\"nofollow\">http://www.workinstartups.com/</a><p>Enternships - (Startup Internships) <a href=\"http://www.enternships.com/en/enternships\" rel=\"nofollow\">http://www.enternships.com/en/enternships</a><p>======================<p>Germany:<p>Berlin Startup Jobs <a href=\"http://berlinstartupjobs.com/\" rel=\"nofollow\">http://berlinstartupjobs.com/</a><p>======================<p>Canada:<p>StartupNorth <a href=\"http://jobs.startupnorth.ca/\" rel=\"nofollow\">http://jobs.startupnorth.ca/</a>","time":1322762851,"type":"comment"},{"by":"sirbumpsalot","id":3302179,"parent":3300290,"text":"Mountain View, CA - backend / iOS / Android Developers. Full time and interns.  Bump Technologies.<p>Can you use Haskell to find the ONE person you bumped out of millions of users in REAL TIME??<p>Can you use blocks to display UIImages on the main thread as data streams in an open socket?<p>Can you build interactions in Android that make iOS developers cry?<p>Are you willing to wait for Scala to compile so that you have a delightful time coding for Android?<p>Do you drool when thinking about distributing 5 terabytes over 9 machines using Riak, python, and not using node.js?<p>Do you like building robots, pushing the limits of what a cell phone can sense, building arduino boards to control kegs, shipping code seen by 65 million users, and working with a small, dedicated, awesome team?<p>If you answered yes to any one of those questions, consider joining the Bump team!  The Bump app is one of the most popular apps of all time.  By simply fist bumping phones with a friend, you can exchange contacts, photos, and more.  We're building out our product and have a lot of cool things in the works.  (yes, a lot of companies say this - I promise that what we're working on will make you say \"wow\")<p>Check out our tech blog and learn more at bu.mp/jobs<p>To apply, use this link <a href=\"http://bump.theresumator.com/apply?source=HN1201\" rel=\"nofollow\">http://bump.theresumator.com/apply?source=HN1201</a> or mention HN in your cover letter.","time":1322787111,"type":"comment"},{"by":"lynngrogan","id":3300601,"parent":3300290,"text":"Durham NC (main office) - REMOTE full-time and contractors\nRelevance, Inc.\nwww.thinkrelevance.com<p>Rails or Clojure Developers, Project Managers<p><a href=\"http://thinkrelevance.com/jobs\" rel=\"nofollow\">http://thinkrelevance.com/jobs</a>\nWe are Clojure/core (<a href=\"http://clojure.com\" rel=\"nofollow\">http://clojure.com</a>).<p>Relevance has been voted as one of the Best Places to Work in the Triangle both 2010 and 2011 (Triangle Business Journal). We were also ranked #739 in this year's Inc 500|5000 list. We have a fantastic work environment that includes 20% Fridays (work on open source, giving back to the community, or internal projects) and a great benefits package.<p>Relevance is increasingly a virtual company and have many remote full-time developers around the country. We're now opening up the project manager positions to being remote as well.<p>Come work with some of the best Ruby/Rails and Clojure developers on solving interesting, hard problems that make a difference.<p>email us: jobs [at] thinkrelevance [dot] com\nInclude Hacker News in the subject line","time":1322761713,"type":"comment"},{"by":"pc","id":3300965,"kids":[3302893,3319879],"parent":3300290,"text":"Stripe.<p>We're based in Palo Alto, CA, and we're hiring full-time engineers and designers. More information at <a href=\"https://stripe.com/jobs\" rel=\"nofollow\">https://stripe.com/jobs</a>. (We especially love solutions to our puzzles.)<p>H1B applicants welcome (almost half of the people at Stripe grew up outside the US). Intern applications also welcome.","time":1322766069,"type":"comment"},{"by":"mbeebe","id":3301950,"kids":[3302211,3302050],"parent":3300290,"text":"Men* wanted for hazardous journey. Low wages, bitter cold, long hours of complete darkness. Safe return doubtful. Honour and recognition in event of success.<p>Matterport is looking for a vision engineer to help build an amazing 3D scanning system.<p>*We are an equal opportunity company, women are strongly encouraged to apply.<p>We are in the YC W12 batch. We are located in Mountain View.  \n<a href=\"http://matterport.com/jobs/\" rel=\"nofollow\">http://matterport.com/jobs/</a>\nemail us at jobs@matterport.com<p>Software Engineer (Computer Vision &#38; Algorithms focus):<p>You’ll be working on our 3D alignment and mesh reconstruction algorithms, improving robustness and quality.  You’ll need to get creative and invent new algorithms, not just apply known techniques.  There are still big, interesting problems to solve that are central to our product.<p>Unlike much of computer science, computer vision is about messy data and uncertain results, so you’ll need to work well with that.  Past experience in computer vision or a related field such as machine learning is preferable.  Experience with high-performance code (optimization, parallelization, CUDA) is a plus.  Our codebase is primarily in C++.","time":1322782517,"type":"comment"},{"by":"jdunck","id":3301697,"parent":3300290,"text":"Mountain View, CA - Engineer, Votizen<p>Elections are pretty broken right now; monied interests fund massive campaigns with precisely researched and broadcasted messaging aiming to convince 51% of voters that the candidate would plausibly serve the voter's interests.<p>The voice of the voter gets drowned out.<p>Votizen changes this by helping you become informed about political topics you care about, not from the campaigns but from knowledgable people you already trust.<p>We want to kill the attack ad and broken campaign promises.<p>We need additional engineers to help us.  More info here:\n<a href=\"https://github.com/votizen/careers\" rel=\"nofollow\">https://github.com/votizen/careers</a><p>Feel free to email me - jdunck@votizen.com - if you'd prefer private discussion.","time":1322778630,"type":"comment"},{"by":"bfung","id":3301077,"kids":[3303041],"parent":3300290,"text":"OPOWER <a href=\"http://opower.com/\" rel=\"nofollow\">http://opower.com/</a> <a href=\"http://opowerjobs.com/\" rel=\"nofollow\">http://opowerjobs.com/</a><p>We leverage data and behavioral science to change people's energy consumption habits. Help the environment through energy conservation and help people save money.<p>Java, Rails, Hadoop, smatterings of many other things - we have a culture where taking initiative and having a good design will result in a system being used by other people.\nGreat perks and a chill yet super productive atmosphere.<p>Open positions vary from associate software engineer to lead to management level.  <a href=\"http://jobvite.com/m?35tBcfw5\" rel=\"nofollow\">http://jobvite.com/m?35tBcfw5</a><p>We were recently got props from forbes! <a href=\"http://www.forbes.com/lists/2011/28/most-promising-companies-11_Opower_WWEQ.html\" rel=\"nofollow\">http://www.forbes.com/lists/2011/28/most-promising-companies...</a><p>Some people applied and I got the referral without me knowing (HR told me), but didn't get past some rounds of interview.  Increase your odds of getting through, contact me and let's chat tech, you'll get a better idea of what kinds of things we're looking for. benson [dot] fung [at] opower [dot] com","time":1322767894,"type":"comment"},{"by":"coffeemug","id":3302248,"parent":3300290,"text":"Be a full time DB Rethinker (rethinkdb.com) - Mountain View, CA.<p>As a core part of the development team you will be applying deep computer science and software engineering knowledge to solving a new breed of data management problems. You will be responsible for enhancing the existing product with state of the art features to address scalability challenges for our customers.<p><i>Core tools:</i> Linux, C/C++, Emacs/vi, gdb, Python.<p><i>Responsibilities:</i><p>* Design, implement, and maintain database internals and distributed systems code.<p>* Implement state of the art algorithms to solve real customer challenges.<p>* Write code that is robust even under the most hostile workloads.<p><i>Skills:</i><p>* Introduction to Algorithms by Cormen and Leiserson is your trusty friend.<p>* Strong understanding of C/C++.<p>* Strong knowledge of at least one additional language (Python, Java, Lisp, etc.)<p>* Experience shipping high quality systems software.<p>* Familiarity with distributed systems is a plus.<p>Send your resume to jobs@rethinkdb.com.","time":1322788521,"type":"comment"},{"by":"ssc","id":3301808,"parent":3300290,"text":"Anywhere<p>REMOTE; FULLTIME; H1B, E3, etc. are all possible!<p>SSC Group LLC is hiring a Rails developer.<p>====&#62;<p>We run adult entertainment websites. Our company is profitable and growing.<p>Some things we use every day and love: Linux, Git, GitHub, Vim, nginx, Varnish, Unicorn, Rails, PostgreSQL, Redis, Javascript, and probably others.<p>====&#62;<p>* We allow full time telecommuting.<p>* We work normal hours.<p>* We pay for coworking/office space if you want it.<p>* We have offices in Los Angeles if you want to work on-site.<p>* We allow our developers to contribute to open source.<p>* We get to pick our tools and technologies. I used Node.js and CoffeeScript for a small project the other day.<p>* We take you to RailsConf if you want to go.<p>* We pay competitively.<p>* Our company owners are technical and understand how development works (refreshing!)<p>* We have a Hubot in our Campfire.<p>====&#62;<p>You should be fluent with Rails and know your way around a Linux server. You should also be comfortable working with adult material.<p>If you're interested, we want to hear from you!<p>Drop us a line and show us one of your projects, or a GitHub/StackOverflow profile, or anything else you're proud of.<p>jobs@sscgroupllc.com<p>Experience with high-traffic web sites, TDD/BDD, statistics or data analysis are all pluses.","time":1322780150,"type":"comment"},{"by":"old-gregg","id":3302648,"parent":3300290,"text":"San Francisco, CA. Full time. We're <a href=\"http://mailgun.net\" rel=\"nofollow\">http://mailgun.net</a> (YCW11) and we're building big-data messaging back-ends.<p>Our brains hurt all the time, we don't serve ads, our customers love us and they pay us money every month. No eyeballs. No ads. No social.<p>C, Python + algos.<p>Send me an email, we love emails: ev@mailgun.net","time":1322799189,"type":"comment"},{"by":"peawee","id":3300416,"parent":3300290,"text":"Anywhere - REMOTE WORK - SpiderOak.com<p>Looking for a PyQt hacker to join us for running the technical aspects of our partnership / whitelabel program.  We are a secure cloud backup/sync provider branching out into partnerships and other deployments requiring customized desktop client builds, and need someone interested in hacking the good hack in code, minor project management, and joining in the occasional sales call (meaning you ought to be as much of an English hacker as Python).<p>For more information about joining us at our scenic $YOUR_OWN_CITY office, please check out:\n<a href=\"https://spideroak.com/jobs\" rel=\"nofollow\">https://spideroak.com/jobs</a><p>Or the direct job post:\n<a href=\"https://spideroak.com/blog/20111130141238-now-hiring-white-label-engineer\" rel=\"nofollow\">https://spideroak.com/blog/20111130141238-now-hiring-white-l...</a>","time":1322759225,"type":"comment"},{"by":"mikepk","id":3300741,"parent":3300290,"text":"Boston, MA Smarterer (<a href=\"http://smarterer.com\" rel=\"nofollow\">http://smarterer.com</a>)\nSmarterer is measuring the world's skills.<p>FULL-TIME\nHiring web developers, both front end and full stack devs. We're interested in (but not limited to) python devs.<p>Lots of interesting scaling, algorithm, and product challenges. You will be a part of the core technical team and have a big impact on the product, technology and culture of the company.<p>We're True Ventures and Google Ventures backed.<p>Details: <a href=\"http://smarterer.com/blog/jobs/web-programmer-developer/\" rel=\"nofollow\">http://smarterer.com/blog/jobs/web-programmer-developer/</a><p>Email mikepk at smarterer with your interest.","time":1322763288,"type":"comment"},{"by":"nixy","id":3300525,"parent":3300290,"text":"Stockholm, Sweden<p>Mountain View, CA<p>Madrid, Spain<p>Hong Kong<p>At Accedo (<a href=\"http://www.accedo.tv/\" rel=\"nofollow\">http://www.accedo.tv/</a>), we're hiring web developers, mainly client side, for work on connected tv platforms such as Samsung, Panasonic, LG, Roku, Boxee etc.<p>These are our current openings. Contact <i>nik at accedo dot tv</i> if you are interested or have any questions. Make sure to add \"HN\" to the subject line :)<p>Junior development engineers<p>Accedo is looking for talented and motivated junior engineering staff for our development centers in Stockholm, Hong Kong, Madrid and Mountain View, California. Experience from TV and Video technologies as well as knowledge about a wide range of programming languages are an extra bonus, but all talented applicants are also welcome. Since we have customers all over the world, language skills are also appreciated.<p>Senior development engineers and project managers<p>We are always looking for experienced staff to strengthen our development centers and provide leadership. A senior development engineer should have several years work experience and knowledge on a wide range of technologies and programming languages. They should also have experience and practice of creating high performing and manageable server side platforms. Interest and experience in developing applications for TV or Mobile device platforms is beneficial.<p>Business development manager<p>Accedo is looking for successful sales and business development managers. In this role, you are the face of Accedo to our customers and drive all sales efforts either directly or through partners. You should have at least 3 years sales experience. You should have a genuine interest in the latest trend in consumer electronics and new media as well as an overall understanding of software development projects.<p>Project or Thesis students<p>Are you a student looking for project or thesis work? Accedo has many exciting projects on next generation TV technology. We are actively looking for Masters and Undergraduate students to perform their thesis projects or internships at our Stockholm and Hong Kong development centers.","time":1322760496,"type":"comment"},{"by":"tlipcon","id":3300604,"parent":3300290,"text":"INTERN or FULLTIME (REMOTE for some positions)<p>Offices in downtown San Francisco, Palo Alto, and Research Triangle Park<p>Cloudera offers enterprises a powerful new data platform built on the popular Apache Hadoop open-source software package. We enhance the storage and processing technologies originally developed by the world’s biggest Web companies, allowing our growing list of global customers to use Hadoop to solve problems and achieve their particular business goals.<p>We're hiring across a number of departments. A few that might be interesting to the HN crowd:<p>- Distributed Systems Engineer, Platform team: get paid to work on open source projects like Hadoop, HBase, Hive, Pig, ZooKeeper, Avro, etc. The work is challenging and impacts hundreds or thousands of companies worldwide, plus you get to collaborate with folks at a number of other companies on a daily basis<p>- Distributed Systems Engineer, Enterprise team: work on monitoring and deployment software that scales to 1000+ nodes. This software needs to collect metrics, generate alerts, search logs, and manage deployment at very high scales.<p>- Senior UI Engineer: build rich web interfaces to simplify the user experience for operators trying to manage 1000-node clusters. JavaScript, CSS, HTML, and a bit of Java.<p>- Software Quality Engineer: help test, validate, and debug the products mentioned above. You will get to drive 100-1000 node test clusters to their breaking point and then dig into what broke.<p>- Customer Operations Engineer: help Cloudera customers solve daily issues they run into when using software in the Hadoop ecosystem. Learn these distributed systems inside and out. Be the Dr House of Hadoop.<p>Our company is currently around 135 people, but growing fast. Our investors are top notch: Accel, Greylock, Meritech, Ignition. Our most recent round was $40m about a month ago, so we are well funded and will compensate you with more than ramen noodles (though we do offer free lunch!).<p>The full list is available here: <a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a><p>Feel free to contact me at todd@the obvious domain.com if you have any questions. Otherwise apply above.","time":1322761738,"type":"comment"},{"by":"mkeblx","id":3300650,"parent":3300290,"text":"Madison, WI - (REMOTE possible)\nCircuit - <a href=\"http://circuitapp.co\" rel=\"nofollow\">http://circuitapp.co</a><p>Github for hardware. Circuit is a social tool for designing and building electronic projects aimed at the exploding Maker/hobbyist market. We're going to disrupt hardware with a tool that makes things 10x easier &#38; faster. Launching Q1 2012.<p>We are looking for a passionate all-around programmer, experienced with creating advanced frontend interfaces as well as backend systems. Mainly would be doing a large amount of challenging HTML5, Javascript, and using PHP (Cake) &#38; MySQL on the backend. Big bonus points if you have graphics programming experience and hardware background: microcontrollers, designing PCBs, tearing things apart, and familiarity with the Maker movement.<p>Interested, questions? jobs@circuitapp.co","time":1322762149,"type":"comment"},{"by":"cristinacordova","id":3300958,"parent":3300290,"text":"Palo Alto, CA (one block from the Caltrain) - FULL-TIME, INTERN, H1B welcome!<p>We're looking for Backend, iOS, Web and Android developers to join our 15-person team. Pulse makes the most downloaded news reading application for iPhone, iPad, Android and Windows Phone. At Pulse, you will work closely with a tight-nit team of experienced engineers. Each of us is part engineer, hacker and product designer.  Pulse was originally founded in the Stanford Design School, and beautiful, user-centric design is at the heart of our product and work. We recently raised a Series A round of funding led by NEA and Greycroft.<p>Find out more about us here: <a href=\"http://www.pulse.me/jobs/\" rel=\"nofollow\">http://www.pulse.me/jobs/</a> and feel free to send your resume to me at cristina@pulse.me","time":1322765917,"type":"comment"},{"by":"ladon86","id":3300803,"parent":3300290,"text":"ClassDojo<p>FULLTIME or INTERN in PALO ALTO, CA<p>We're an edtech startup funded by some of the biggest names in the valley, and we're one of the fastest growing education companies of all time. You're an amazing software engineer who wants to have a real impact on the world.<p>We are helping millions of kids achieve their full potential. We want you to help us do it, with a great team, in an awesome environment, with all the perks.<p>If you're a strong JavaScript hacker who wants to use node.js to change the world, apply here:<p><pre><code>  --------------------------  \n  https://classdojo.wufoo.com/forms/join-classdojo/  \n  --------------------------\n</code></pre>\nOr email <i>jobs@classdojo.com</i><p>We are looking for:<p><pre><code>  Lead Software Engineer (node.js)  \n  \n  Lead Front-end Developer  \n  \n  Lead Visual Designer  \n  \n  Developer internships</code></pre>","time":1322764012,"type":"comment"},{"by":"garry","id":3335520,"parent":3300290,"text":"(good friends of mine -- fantastic profitable startup run by brilliant and fun hackers -garry)<p>--<p>Software Engineer at A Thinking Ape<p>A Thinking Ape is currently looking for an extremely smart and talented Software Engineer to become permanent members of our core team in our downtown Vancouver, BC office. You should be comfortable with designing and implementing applications from beginning to production and enjoy working on massive scale technical problems.<p>Your background should include:<p>Proven software engineering talents\nSolid knowledge and understanding of web architecture\nClear communication in code and in writing\nInterest in metrics and data analysis\nThe itch to make something people want\nand it would be a definite plus if:\nYou are contributing or have contributed to an open source project\nYou have launched your own iPhone app and Facebook app\nRegistered at and regularly read Hacker News (and send us your username if you do)\nExperience with some of the technology that we use including: python, java, objective-c, javascript, apache, linux, memcached, redis, zeromq, mongrel.\nApply by sending a cover letter and resume to:<p>We are still an early stage start-up and as a developer you will have the ability to influence the design and development of nearly everything that we build. You will have to be very comfortable with ownership and management of your projects. As such, you will have the potential to develop into an engineering leadership and management role over time as we grow.<p>All new members of ATA engineering are equipped with a new Macbook Pro, an iOS device, and a high quality design notebook.<p>jobs@athinkingape.com","time":1323463337,"type":"comment"},{"by":"qthrul","id":3302984,"parent":3300290,"text":"Research Triangle Park, North Carolina USA (and worldwide)<p>VCE is making the datacenter simple... with Vblock Infrastructure Platforms <a href=\"http://vce.com\" rel=\"nofollow\">http://vce.com</a><p>VCE is a joint venture startup funded by Cisco, EMC, VMware, and Intel. We're <i>always</i> looking for developers with a passion for accelerating the adoption of converged infrastructure that is simple, effective, and always available. <a href=\"http://vce.com/careers\" rel=\"nofollow\">http://vce.com/careers</a><p>REMOTE - yes\nINTERN - yes<p>I've been riding the rocket here for just over a year (w00t!). I know all the teams that are hiring within VCE. We have developers shipping stuff that is already making huge impact in datacenters around the world and we are growing those teams aggressively. The keyword soup is spec docs, object models, class diagrams, state flows, Subversion, Jenkins, Agile/Scrum, ESB, Hadoop, Pig, Puppet, Chef, Java, C, C++, Perl, Python, RESTful, XML, GWT, iPhone, iPad, etc... etc...<p>Considering the previous \"Where are you\" poll earlier this morning... Here's a paste from our Linkedin job postings for West coast locations as well <a href=\"http://bitly.com/rIHB9k\" rel=\"nofollow\">http://bitly.com/rIHB9k</a> ;-)<p>I've blogged about my time at VCE every 30 days or so as well so you can read my experiences for yourself at VCE <a href=\"http://fudge.org/category/thevce/\" rel=\"nofollow\">http://fudge.org/category/thevce/</a><p>Wanna ride the rocket too?<p>If you want to get an inside leg or if you have any questions drop me a note and your CV at jay.cuthrell@vce.com Subject: HN<p>(if you get an OOO response don't worry I'll reply)","time":1322807790,"type":"comment"},{"by":"ipster","id":3300498,"parent":3300290,"text":"San Francisco (preferred) / Los Angeles / NYC / Remote / H1B - AllTrails - <a href=\"http://www.alltrails.com\" rel=\"nofollow\">http://www.alltrails.com</a><p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people explore the outdoors and having lots of fun in the process. Camping benefits, anyone?<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book on the team.<p>We have the #1 outdoors app in the Apple store (do a search for 'Hiking') and recently launched our Android app. We reach over a million people a month and have been growing rapidly.<p>We're looking for Designers / Front-end Engineers, Back-end Rails Engineers, and Mobile Developers (Android and iOS). Cross-functional and full-stack developers are preferred.<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you!<p><a href=\"http://www.alltrails.com/jobs\" rel=\"nofollow\">http://www.alltrails.com/jobs</a> or justin@alltrails.com","time":1322760183,"type":"comment"},{"by":"squirrel","id":3300893,"parent":3300290,"text":"London (UK) and Boston (US). Graduates and interns please!<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development. Some of you may know us from our sponsorship of Hacker News meetups in London. We're focussed on hiring graduate developers and interns at the moment. See <a href=\"http://devblog.timgroup.com\" rel=\"nofollow\">http://devblog.timgroup.com</a> and <a href=\"http://www.timgroup.com/careers\" rel=\"nofollow\">http://www.timgroup.com/careers</a>.<p>Note we recently changed our name from youDevise to TIMGroup but we're still the same folks!","time":1322765025,"type":"comment"},{"by":"rmorrison","id":3301271,"parent":3300290,"text":"Comprehend Systems (YC W11) is hiring Java developers<p>Palo Alto, CA<p>We're making next-generation database software. Using Comprehend's technology, users can connect and easily query multiple disparate datasources, including RDBS, NoSQL data stores, RESTful APIs, and more. We're looking for both frontend and backend developers.<p>Our first product targets clinical trial data, which is an area where there is a lot of pain and we understand well. The software you will write will directly affect people's lives, helping to get new treatments to market faster.<p>The core technology itself, however, is applicable to every industry, and once we solve this problem for life sciences we're going to solve it universally.<p>We offer benefits, including: Free lunch and dinner, Generous equity, Competitive salary, Gym membership, Healthcare, Top of the line computer setup of your choice: Debian, OS X, Windows, etc, and Flexible vacation time<p>We're hiring entrepreneurial developers only! Learn about startups from the inside.<p>To learn more, visit our website at www.comprehend.com/careers, or send your resume to careers@comprehend.com.","time":1322771460,"type":"comment"},{"by":"famousactress","id":3301182,"parent":3300290,"text":"San Francisco, CA (REMOTE available for the right candidate)<p>Elation EMR ( <a href=\"http://www.elationemr.com\" rel=\"nofollow\">http://www.elationemr.com</a> )<p>We're working on incredibly smart and usable web and mobile tools for patients and their physicians.<p>We're small (6 fulltime people) angel funded and have an incredible list of investors (<a href=\"http://www.elationemr.com/team/\" rel=\"nofollow\">http://www.elationemr.com/team/</a>).<p>We're building with Python, Django, javascript, jQuery, iOS, Redis, NodeJS, MySQL, Java, and some other stuff. Particularly, we're really pushing the envelope when it comes to building rich javascript UIs in browser.<p>We're live in a number of practices, and there's still loads of really interesting things to build and make better! We're looking add one or two more people to our incredible team. <a href=\"http://www.elationemr.com/jobs/\" rel=\"nofollow\">http://www.elationemr.com/jobs/</a><p>Drop us a line! - Phill","time":1322769818,"type":"comment"},{"by":"lpolovets","id":3300369,"kids":[3300644,3319884],"parent":3300290,"text":"Los Angeles or Bay Area or Shanghai preferred, but remote work is possible for exceptional candidates. Full-time only. If you're interested in working remotely, you must live in the U.S. H1B is okay. We also have some summer internship opportunities.<p>Factual aims to be the place where people meet to share, improve, and mash-up data. Our vision is to be an awesome and affordable data provider, so that big companies, startups, and developers can focus on innovation instead of data acquisition.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). Last year we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Loopt, SimpleGeo, and Newsweek. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We currently have about half a dozen job openings, from data engineering to software engineering to system administration. For the software engineering position, you would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p>If you're interested in the Bay Area office, it just opened last weekend, so you'd have a significant influence on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a><p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a>","time":1322758661,"type":"comment"},{"by":"incomethax","id":3300527,"kids":[3301160],"parent":3300290,"text":"Madison, WI - Rails Developer - healthfinch.com<p>We're a Healthcare IT startup working on developing apps and tools that add-on to EMRs to improve patient safety, reduce administrative overhead on clinical staff, and save organizations time and money.<p>We've just finished raising our Series A, and we're looking to hire a couple developers with the right fit.<p>We'll hire an intern for the spring, but only if you're able to go full-time after your internship ends.<p>For developers, knowledge of Rails/Javascript/Coffeescript is a requirement; Interest in working with large amounts of data and analytics is a plus.<p>Nice to haves: Starcraft APM 50+; experience integrating with EMRs; working knowledge of HL7; experience designing and testing RESTful APIs.<p>You can email me and my co-founder directly: jobs <i>at</i> healthfinch.com<p>Please include \"HN\" in the subject line.","time":1322760510,"type":"comment"},{"by":"ivanzhao","id":3301088,"parent":3300290,"text":"Inkling, San Francisco, CA<p>Inkling is a publishing startup. We are a new medium, the future of books and publishing (currently with a focus in textbooks on iPad); our platform is so good that completely leaves ebooks in dust, and even most major publishing houses are invested in us.<p>We are pretty much hiring in ANY POSITION - from the JavaScript/Python/Scala/iOS to UI/UX design to marketing to product management. We are Sequoia-backed and just recently secured another round of $17 million funding.<p>The team is lean and flat. Located in the downtown SF, TV-celebrity chef in house, best gym in town, plus generous salary and options.<p><a href=\"http://www.inkling.com/jobs/openings/\" rel=\"nofollow\">http://www.inkling.com/jobs/openings/</a><p>Contact me if you are interested (ivan@inkling.com)","time":1322768054,"type":"comment"},{"by":"bigmac","id":3301465,"parent":3300290,"text":"Square<p>San Francisco, CA<p>FULLTIME<p>Security Engineer<p>We're looking for security experts excited about securing the future of payments. Security at Square is involved in all aspects of the stack: hardware, mobile, infrastructure, networks, crypto, web, and physical security.<p>Additional note: Dan Boneh (<a href=\"http://www.crypto-class.org/\" rel=\"nofollow\">http://www.crypto-class.org/</a>) is one of our advisors and joins us regularly.  You will have the chance to interact with him and learn from one of the leading researchers in the security industry.<p>Standing invitation to all security folks in the Bay Area or visiting: come have lunch with us at Square.  We'd love to meet you and talk about what you're working on.  It is almost certainly relevant to us.<p>Contact me: mccauley [at] squareup.com","time":1322774975,"type":"comment"},{"by":"makeramen","id":3301992,"parent":3300290,"text":"Mountain View - drchrono.com (YC W11) [full time and interns]<p>We're looking for more engineers and salespeople to help us revolutionize healthcare through mobile and web interfaces. Our stack includes Python/Django, iOS, and Android, but you don't need to be an expert, just ready and willing to learn fast!<p>Our product supports thousands of doctors who depend on our systems daily to provide quality care to their patients, iPad in hand.<p>The usual startup benefits included: competitive salary, healthcare, whatever hardware you need to be most productive.<p>email: jobs@[our-domain-name]<p><a href=\"http://drchrono.com/jobs/\" rel=\"nofollow\">http://drchrono.com/jobs/</a>","time":1322783202,"type":"comment"},{"by":"mdkess","id":3300711,"kids":[3301409],"parent":3300290,"text":"Broadway Technology - New York, NY and Austin, TX.<p>We're a small, fast moving and profitable ~40 person software company revolutionizing fixed income and foreign exchange trading software by creating a very fast trading platform for algorithms and people (to be clear - we’re a software company, not a hedge fund/trading firm). We are hiring top tier consultants and software engineers. Some opportunity to work remote, and profit sharing for the win! Apply at <a href=\"http://www.broadwaytechnology.com/careers\" rel=\"nofollow\">http://www.broadwaytechnology.com/careers</a>","time":1322762945,"type":"comment"},{"by":"bkudria","id":3301555,"kids":[3303437,3302777,3357758,3336828],"parent":3300290,"text":"Hi, you might have heard of the company I work for, Yammer. We were in the news recently, and we're looking to hire in San Francisco.<p>We've got a variety of positions open, but since this is Hacker News, I'll tell you about our engineering team. Every single engineer here is the type of person that can be honest with themselves and others. We like to use tools and technologies because they allow us to build things our customers want, not because we think the tools are cool.<p>Some tools we use: Java. Scala. Ruby, and Rails, Javascript, Node.js, Objective-C, and C#. We like to store things in Postgres, Riak, Vertica, and our super-awesome custom-built distributed feeds DB written on top of BDB JE-HA.<p>If you're the type of engineer who believes in the One True Language To Rule Them All, we're not interested. If you're the type of engineer who doesn't understand how users think, we're not interested. Yammer has a high bar, and we're not willing to compromise on that. If you're confident in your abilities, and you think you can help use take over and <i>change</i> corporate America, let's talk.<p>Yammer is the type of place where you can use whatever resources you can muster to actually change the world. Yammer is used by many many large corporations, with real impact. We have customers inside the valley, outside the valley, and all around the world. We're used by a vast majority of companies in the Fortune 500. We have customers with 10 employees, 100 employees, and 100,000 employees. Or more. We allow those employees to all talk to each other, stay connected with their company, and do their job vastly more efficiently. Our customers stop sending email. Our customers communicate outside their departments, and low-level employees can have frank and honest conversations about their work with C-level executives. A Yammer company is quite different than your average company.<p>Our product is kinda like Facebook, and kinda like Twitter, sure. We're inspired by the best, and we won't hesitate to steal good ideas. But any change we make to our product is tested thoroughly and analyzed intelligently. We like the scientific method. We're not messing around. If you'd like to join a serious team of hard-working and effective engineers with their hearts set on changing how the modern corporation communicates, get in touch.<p>Yammer pays competitively. Yammer offers all the standard perks. Yammer is no longer allowed to host events in certain SOMA drinking establishments.<p>If you have questions, send me an email: bkudria@yammer-inc.com","time":1322776571,"type":"comment"},{"by":"chiamonkey","id":3310890,"parent":3300290,"text":"Software Developer, Rangespan &#60;<a href=\"http://www.rangespan.com&#62\" rel=\"nofollow\">http://www.rangespan.com&#62</a>; (Paddington Area, London, UK)<p>Job Description:<p>Rangespan is looking for python developers to join our growing team. As one of the first technical team-members, you’ll have broad and hands-on responsibility for design and development of extraordinarily scalable systems and web services for retailers and suppliers.<p>Requirements:<p><pre><code>  * BS or MS degree in Computer Science or equivalent\n  * Fluency with Python and Django\n  * Proficient with MongoDB and MySQL\n  * Demonstrated experience building a platform from scratch\n  * Experience with REST Web Service, Flask and fault-tolerant AWS architectures is a ideal\n  * Experience with catalogue systems is a plus\n  * Experience with machine learning algorithms is a plus\n  * A knack for solving problems creatively\n  * An ability to attract additional world-class software developers\n</code></pre>\nAbout Rangespan:<p>Founded by ex-Amazon executives and engineers, Rangespan is an ambitious e-commerce and supply chain software company making it easy for retailers to offer deep product selection. We're solving complex problems with large data sets, machine learning and natural language processing techniques.<p>Contact Info:<p><pre><code>  * Contact: Christian Ricci\n  * Email: chris@rangepan.com or jobs@rangespan.com\n  * Web: http://www.rangespan.com/jobs/\n  * No contract or agency offers\n  * No telecommuting</code></pre>","time":1323014191,"type":"comment"},{"by":"LisaG","id":3300510,"parent":3300290,"text":"San Francisco, CA<p>Are you passionate about Open Source, Net Neutrality and Open Data? Do you want to do work that matters?\nJoin us at Common Crawl and you will work with big data and help ensure the web is truly open.<p>Common Crawl is non-profit that produces and maintains an open repository of web crawl data to give everyone access and we need your help! We're looking for a truly talented data-minded Hadoop/Java engineer to help improve our crawler, API and do data analytics!<p>Contact lisa@commoncrawl.org for more info","time":1322760338,"type":"comment"},{"by":"ashrust","id":3301177,"parent":3300290,"text":"Stealth<p>Fulltime, Mountain View<p>Frontend Developer - JQuery, Javascript, HTML, CSS<p>Nice to have:\nPhotoshop/Illustrator, for slicing and dicing designs\nPython, or a desire to learn quickly (we use Django)<p>We were just accepted in the YC W2012 batch. You would be our first hire.<p>We believe in building wonderful products and taking care of our people. We expect a lot of each other but we wouldn't want it any other way. We're hungry and we need you to be too.<p>If you're interested in being more than a cog in the machine, please drop us a line.<p>contact ash [at] ashrust dot com","time":1322769776,"type":"comment"},{"by":"willowgarage","id":3300509,"parent":3300290,"text":"Palo Alto, CA<p>Suitable Technologies - <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>Suitable Technologies is a startup working to create an innovative new product for something called \"remote presence.\"  (Another common term is \"robotic telepresence.\")<p>We have funding, competitive compensation, and a fun work environment, complete with our own chef, ping pong table, and of course, lots of robots!<p>Our first product, in development now, is similar to video chat on a computer you can drive around.  Unlike videoconferencing, you’re not stuck to a wall or desk.  It becomes your physical presence, anywhere in the world, with the freedom to move and interact with people as if you were there.  Our technology has already been seen by millions of people, and we think the potential impact is substantial.<p>We're looking for great engineers, designers, testers, and more.  We need help in C++, audio and video software and codecs, web frontend and backend, UI/UX design, electrical, and networking.  We think this could be a unique opportunity for someone with experience in web or mobile to work on something a little different.<p>More information is available on our site: \n<a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>Contact:\njobs@suitabletech.com","time":1322760304,"type":"comment"},{"by":"zds","id":3300701,"parent":3300290,"text":"Codecademy (<a href=\"http://www.codecademy.com\" rel=\"nofollow\">http://www.codecademy.com</a>)<p>FULLTIME - NYC OR SF<p>Frontend and Backend Developers and Designers<p>Codecademy is the easiest way to learn to code.  In a few short months, we have hundreds of thousands of users.  Come change the future of education!<p>We work with Rails, MongoDB, JavaScript, and backbone.js, but if you're smart you'll pick all of that up anyway.<p>Email us at jobs (at) codecademy (dot) com or check out codecademy.com/jobs.   Thanks!","time":1322762768,"type":"comment"},{"by":"siberianfruit","id":3300364,"parent":3300290,"text":"San Francisco - Wanelo.com<p>Developers, designers (UX, visual design), full time, part time, interns<p>details (updated as we go): <a href=\"http://bit.ly/vQghbH\" rel=\"nofollow\">http://bit.ly/vQghbH</a><p>We're looking for humans who have the special capacity, drive, patience, curiosity and tenacity to build crazy awesome stuff on the interwebs. Our goal is to have you be our partner in crime/work/play - we like to combine these as much as possible!<p>You will have autonomy and freedom. You will be the driver (not the passenger) of your own destiny and your goals for our startup. You will be passionate about what we're building. You will choose when and how you will get your work done. We will all pretend that you are an adult and do our best to treat you as such.<p>We are an awesomely-sexy mass-reach consumer web social startup with a product that users already love! That's right, when you tell your mom about what you build/design- she'll not only be able to understand it - she'll probably use it herself! We’ve crossed 1M monthly uniques, 140k users, and have hugely ambitious plans to keep creating an experience that users love and to build a business that defines the next generation of ecommerce.<p>email deenav@wanelo.com","time":1322758548,"type":"comment"},{"by":"pjo","id":3300482,"parent":3300290,"text":"Conshohocken, PA - Monetate<p>We're a SAAS provider of testing, targeting and personalization tools (i.e. segmentation, A/B testing, MVT). Our tools include Python, Google Closure, Hadoop, and Hive. Looking for backend, front-end, systems, and web production developers.<p>We've got existing high-volume customers and challenging problems to solve.<p>Check out <a href=\"http://jobs.monetate.com/\" rel=\"nofollow\">http://jobs.monetate.com/</a><p>Feel free to email pat at monetate com.","time":1322760003,"type":"comment"},{"by":"colinschlueter","id":3300834,"parent":3300290,"text":"Berlin, Germany - <a href=\"http://www.sofatutor.com/\" rel=\"nofollow\">http://www.sofatutor.com/</a><p>We're still looking for both Ruby on Rails developers and a strong frontend developer (ideally also with a Rails-dev background). Additionally we're hiring for several positions in our marketing and editorial teams.<p>sofatutor.com is an educational video platform and one of the largest education startups in Germany. We're a small technical team building a fast-growing online platform to help students study for school and university, using Ruby, Rails, Amazon Web Services and a bunch of related tools and services. So far, the team is mostly German, but we're working in English for most stuff anyway and would love to get more people from abroad to join us here in Berlin. (We'll help with the German bureaucracy, residency status etc.)<p>Full job descriptions (in German) at <a href=\"http://www.sofatutor.com/jobs\" rel=\"nofollow\">http://www.sofatutor.com/jobs</a>, but feel free to contact me directly if you're interested, know someone who might be or simply have any questions (colin@sofatutor.com).","time":1322764300,"type":"comment"},{"by":"typpo","id":3301627,"parent":3300290,"text":"Mountain View, CA - fulltime or intern<p>Room 77 - <a href=\"https://www.room77.com\" rel=\"nofollow\">https://www.room77.com</a><p>We're changing travel search by giving people full transparency in their search for a perfect hotel stay.  Using the staggering amount of data we've collected and analyzed, we'll actually find and request the best hotel room for you.<p>Some projects you'll work on:<p>- computer-generating views from any room in the world<p>- building the first deep-text hotel search engine (eg. search \"eiffel tower views\" in Paris or \"jetted bathtub\" in New York)<p>- super-fast search across all major providers (we show Expedia results faster than Expedia)<p>- finding better ways to extract and expose data like hotel freebies and fees<p>...and many other things that contribute to a fast, easy travel planning experience.<p>If you're interested in information retrieval, machine learning, NLP, or computer visualization, you'll have a great time solving brand new problems and creating a genuinely improved and useful hotel search.<p>Check out our jobs page: <a href=\"https://www.room77.com/jobs.html?s=HN\" rel=\"nofollow\">https://www.room77.com/jobs.html?s=HN</a>","time":1322777632,"type":"comment"},{"by":"sahil_lmn","id":3302074,"parent":3300290,"text":"Reston, VA (west of Washington, DC) - FULL TIME, INTERN, CONTRACTOR (H1B maybe if already in US)<p>Lucidmedia Networks - <a href=\"http://www.lucidmedia.com\" rel=\"nofollow\">http://www.lucidmedia.com</a><p>Internet ad network startup looking primarily for Java developers (experience with SQL and front-end web experience would be great too). The Internet advertising industry is quite complex behind the scenes and somewhat parallels the structure of the financial markets. We are analogous to a high frequency trading firm, buying page views to serve ads in real-time on exchanges like that of Google or Yahoo. Our server software runs on Spring, MySQL, Redis, and AWS at a glance. We handle about a billion page impressions a day. Big data, big throughput.<p>Small yet experienced team, catered lunches _everyday_, your choice of Mac or PC (dev team is almost all Mac now), good benefits. Our office has superhero posters all over the walls.<p>Contact me directly at sahil_lmn@yahoo.com.<p>I actually got hired through a HN \"Who is Hiring\" thread. These things do work!","time":1322784559,"type":"comment"},{"by":"rveloso","id":3300656,"parent":3300290,"text":"ThousandEyes (www.thousandeyes.com), San Francisco, Sequoia backed<p>INTERN, FULL-TIME, H1B, GREENCARD<p>ThousandEyes is an early-stage startup in the application performance management (APM) space backed by Sequoia Capital and with offices in San Francisco.<p>The commoditization of the Internet is changing not only the way the applications are delivered, but also the way applications are architected, with the increasing use of cloud services,  SaaS and virtualization. This trend results in loss of control and visibility causing existing solutions to be inadequate and presents new challenges in application performance management for organizations.<p>At ThousandEyes, we believe that one does not have to sacrifice visibility and control when adopting distributed architectures and cloud services. To this end we are building a novel platform that truly understands the infrastructure layer underneath complex distributed applications as well as the end to end application delivery. Our core technology is a combination of active probing by exploiting protocols to extract critical data as well as passive techniques such as capturing traffic to infer network and application metrics. We are a team of radical thinkers and hackers and our core principle is to out innovate our competitors. We are actively looking for like minded people who enjoy hacking protocols and are passionate about disrupting the performance management space through our next generation platform.<p>Open positions:\n* Frontend Software Engineer\n* Java Software Engineer (Full Stack)\n* C/C++ Systems Software Engineer<p>Full details at <a href=\"http://www.thousandeyes.com/company/careers\" rel=\"nofollow\">http://www.thousandeyes.com/company/careers</a><p>To apply please send your cv to jobs@thousandeyes.com together with a paragraph explaining what you can bring to ThousandEyes and a code sample if possible.","time":1322762220,"type":"comment"},{"by":"BenS","id":3302495,"kids":[3302539,3302756],"parent":3300290,"text":"Pinterest (www.pinterest.com/about/careers) is hiring. We are in downtown Palo Alto.<p>Our engineering team is still really small (7) from places like Google, Apple, Quora, Facebook and Yelp. Pinterest is doing billions of PV's each month and is scaling very quickly.<p>We’re looking for great engineers who get excited at the prospect of shipping to millions of users on an a daily basis.","time":1322795080,"type":"comment"},{"by":"axiom","id":3300996,"parent":3300290,"text":"Waterloo (soon to be Toronto), Ontario<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>)<p>Looking for amazing web developers (Python, Django, javascript, NodeJs, CSS, HTML.) Also looking for interns (paid of course.)<p>Good pay, meaningful stock options, and a great work environment.<p>Apply here:\n<a href=\"http://bit.ly/txegcq\" rel=\"nofollow\">http://bit.ly/txegcq</a>","time":1322766719,"type":"comment"},{"by":"aginsburg","id":3300920,"parent":3300290,"text":"San Francisco, CA; Full-time; H1Bs welcome<p>Nextdoor -- <a href=\"http://nextdoor.com/\" rel=\"nofollow\">http://nextdoor.com/</a><p>Nextdoor is a private social network for neighborhoods, where neighbors can talk online and help make their community better in the real world. People are using Nextdoor to find a trustworthy babysitter, organize a garage sale, ask for help locating a lost pet, and exchange many other kinds of help and information with their neighbors.<p>We're a venture-backed startup company of 24 people in downtown SF. We just launched last month, and are looking to grow with a few more key hires--particularly product designers, software engineers, and product managers. If you like (some or all of) Python, jQuery, AWS, geospatial data, clean and usable design, a fast-paced startup environment, please take a look at our job opportunities, and we'd love to hear from you.<p><a href=\"http://nextdoor.com/jobs/\" rel=\"nofollow\">http://nextdoor.com/jobs/</a>","time":1322765446,"type":"comment"},{"by":"twelve45","id":3300629,"kids":[3300845,3304958],"parent":3300290,"text":"San Jose, CA. Intern / Full-time. H1B ok.<p>RetailNEXT (<a href=\"http://bviretailnext.com\" rel=\"nofollow\">http://bviretailnext.com</a>)<p>We are google analytics for the real-world. We use a combination of machine vision (OpenCV + our own algorithms) on standard video cameras, and other inputs like RFID/WiFi data to build a complete picture of what's happening inside a physical retail store. No cookies or IPs to play with in the real-world, so a much harder (and hence much more interesting!) problem.<p>Each month we track nearly 2M people worldwide across our several retail customers (a few are listed on our website). We are fundamentally changing the way retail stores are designed and operated.<p>We use C/C++, Java, Python and Flex. Our product runs on Linux. We like super-smart generalist hackers who are into machine vision, data visualization, AI or data mining/big data analytics. Interested? Drop us a note at jobs@bvinetworks.com.","time":1322761912,"type":"comment"},{"by":"siddharthjoshi","id":3301632,"parent":3300290,"text":"(Seattle + H1B OK)\nMy team at Amazon.com (Customer Service Technology) is still hiring SDEs!<p>We are a small team of 7 engineers, but we each develop systems from the ground up, straight from DB design to front-end UI. We deploy new features almost every day.<p>We mostly have Java, with a sprinkling of C++ in our services and use the Perl/Mason framework for our web apps and Dojo/JQuery for Javascript.<p>As the team is moving into exciting new projects (machine learning, schedule optimization etc), I encourage you to come join us and be a part of the next generation of Customer Service Technology.<p>Here is the official posting and how to apply: <a href=\"http://www.amazon.com/gp/jobs/129914/ref=j_sr_2_t?ie=UTF8&#38;category=Software%20Development&#38;location=*&#38;keywords=customer%20service&#38;page=1\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/129914/ref=j_sr_2_t?ie=UTF8&#3...</a>","time":1322777699,"type":"comment"},{"by":"dlevine","id":3301044,"parent":3300290,"text":"Scaffold<p>FULLTIME in New York City<p>We're building a credit score for all your collaborative activity. We rate people, and determine whether they are\nsafe to deal with in-person on collaborative Peer-To-Peer marketplaces (think AirBnb or Tutorspree). We raised a seed round from a bunch of awesome Angels/VCs. Now we are looking to bring on our first couple engineers - salaried, but since we're early, we can offer a nice amount of equity.<p>Here are the general descriptions of what we're looking for:<p>- Front-end engineer (we do Rails/HAML/SASS/JQuery). Optimally he/she would have some design ability in addition to being able to do the front-end implementation.<p>- Service-layer generalist engineer. We are integrating with and pulling data from a lot of services, so we need\nsomeone to build all of those integrations in a flexible and scalable way.<p>If this sounds interesting, contact us at: jobs@getscaffold.com","time":1322767384,"type":"comment"},{"by":"jdale27","id":3301093,"kids":[3301459],"parent":3300290,"text":"DNAnexus - Mountain View, CA<p>We're a startup building the computing platform for the genome era. In the next few years, millions of genomes will be sequenced, and we will provide the software infrastructure to store, analyze, and make sense of these enormous data sets. Our investors include Google Ventures, TPG Biotech, and First Round Capital.<p>You: a great hacker, looking to work on a talented team, in a fun environment, on big problems that will make a difference in people's lives.<p>We're hiring for multiple software engineering positions. See <a href=\"https://dnanexus.com/careers\" rel=\"nofollow\">https://dnanexus.com/careers</a> for details.<p>Also, we're offering a fantastic referral bonus: $20,000 plus your full genome sequenced! Check out <a href=\"https://dnanexus.com/careers/referrals\" rel=\"nofollow\">https://dnanexus.com/careers/referrals</a>.","time":1322768101,"type":"comment"},{"by":"derwiki","id":3301736,"parent":3300290,"text":"San Francisco, fulltime/internships/H1B<p>Causes - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a><p>At Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, open source contributions encouraged:<p><a href=\"https://github.com/causes/suggestomatic\" rel=\"nofollow\">https://github.com/causes/suggestomatic</a> -- item based collaborative filter<p><a href=\"https://github.com/causes/buffet\" rel=\"nofollow\">https://github.com/causes/buffet</a> -- distributed testing framework for Ruby<p><a href=\"https://github.com/causes/mock_redis\" rel=\"nofollow\">https://github.com/causes/mock_redis</a> -- mock redis Ruby gem\nApply through the site or adam@causes.com if interested!","time":1322779386,"type":"comment"},{"by":"agotterer","id":3300689,"parent":3300290,"text":"New York, NY<p>Lot18 (<a href=\"http://www.lot18.com\" rel=\"nofollow\">http://www.lot18.com</a>) is revolutionizing the way people buy wine and epicurean food online.<p>Hiring:<p>* Software Engineers<p>* Frontend Engineers<p>* QA Engineers<p>* Director of Engineering<p>* Engineer Leads<p>* Product Managers<p>* Project Managers<p>* Data Scientists<p>* Mobile Developers<p>Why you should work here:<p>- We work with a ton of great technologies: Python, JavaScript, Tornado, Chef, git, Vagrant, MySQL, Linux, Apache, nginx, HAProxy, Amazon Web Services, Varnish, memcached, Capistrano, RabbitMQ, jQuery and more.<p>- Well funded. We’ve raised $45M in 3 rounds over the last 12 months. Led by NEA, Accel &#38; FirstMark.<p>- People actually use our product. Over 600k users have joined since we launched in Nov 2010.<p>- We have a real business model and do 7 figures a month in transactions.<p>- Benefits: Competitive salary, stock options, medical/dental paid in full, unlimited vacation, plenty of wine, lots of challenges and interesting business/tech problems to solve.<p>Apply by emailing jobs@lot18.com.","time":1322762585,"type":"comment"},{"by":"KoryFerbet","id":3300951,"parent":3300290,"text":"FULLTIME<p>Location: Seattle<p>Who we need:\n -Open Source Web Application Developers (ideally Ruby, Java, Python, or Perl)\n -iOS Developers\n -4+ years of professional development experience<p>What types of companies:\n-Mobile Call Analytics StartUp.\n-Social Networking/Ecommerce StartUp\n-Carrier Performance Analytic StartUp\n-Daily Deals StartUp\n-Mobile Cloud Synchronization StartUp\n-Web based target advertising StartUp<p>I have job descriptions that can be found for both the StartUps and more established companies at: <a href=\"http://www.bullhornreach.com/user/69443/jobs\" rel=\"nofollow\">http://www.bullhornreach.com/user/69443/jobs</a><p>But as most descriptions are just giant buzz word forms and overly generic elevator speeches I'd love to talk with you about them.<p>How to apply: either through the portal linked above or send a resume to Kory@imatch.com","time":1322765870,"type":"comment"},{"by":"bentlegen","id":3301248,"kids":[3315275],"parent":3300290,"text":"Disqus – San Francisco, CA (YC 07)<p>Looking for JavaScript Engineers, Python Engineers, and more: <a href=\"http://disqus.com/jobs\" rel=\"nofollow\">http://disqus.com/jobs</a>","time":1322771096,"type":"comment"},{"deleted":true,"id":3300402,"parent":3300290,"time":1322759053,"type":"comment"},{"by":"BrandonMTurner","id":3300427,"parent":3300290,"text":"Boston, MA - Full Time - <a href=\"http://www.loseit.com\" rel=\"nofollow\">http://www.loseit.com</a><p>= About Lose It! =\nLose It! is a popular iPhone / Android / Website application that changes people's lives by helping them manage their weight.<p>8M+ iPhone Downloads (currently top 10 in Health category)\n200k+ Android Downloads (very new, currently top 15 in Health category)\n1.5M+ Website enabled users (connecting to our website is optional)<p>1.5M Uniques per month across all platforms\n7M+ pounds of weight have been lost by website enabled users (Estimated ~18M pounds lost across all users)\n8k messages betweens users that opted into social features per day\n450M+ foods logged by website enabled users<p>Current Team - 1 CEO (technical), 1 Developer (me), 1 Business Dev, 1 Community Manager<p>Current Stack - GWT, MySQL, Java (server side and Android), AWS, Objective C (iPhone), Membase<p>Current Tools - Intellij, Git, Navicat, New Relic, CloudBees, Asana<p>= Who we are looking for =<p>Lose It! is looking for new members (we have more then one spot open) for our product team to help us build our next generation of products. We believe that small teams of well rounded people can do great things, so we're looking for someone that can contribute to all phases of building a great product. We believe that iterating on our products with customers is the best way to build something great, so we'd like someone who enjoys talking to customers and making them happy (and maybe even helping to change their lives).<p>As a software engineer at Lose It!, you'll be an early member of the team that is building the core product, the most complete and effective weight loss software spanning mobile devices and the web. You should have a passion for and a proven track record of building products that delight users.<p>= Who to contact =<p>brandon attttttttttttttt loseit.com - If you think you would be a good fit send me an email with anything (resume, cover letter, github account, maybe just a simple 'hello'.  I'll read anything and everything you send).","time":1322759460,"type":"comment"},{"by":"StyleOwner","id":3300553,"parent":3300290,"text":"StyleOwner (San Francisco).<p>We're trying to become the iTunes of fashion.  www.styleowner.com<p>We have a great engineering team in SF and are looking to add one or two amazing engineers (we were too small this year to compete in the Github dodgeball tournament).  email matt@styleowner.com for details.<p>Our stack is ruby/sinatra/datamapper and we also heavily use redis.  Lots of cool scaling related development, as well as backend and frontend stuff.  Developers do not need to know anything about fashion, but any design strengths are certainly a plus.<p>We're funded by Accel and have fantastic investors.  I mention this b/c it matters a lot.<p>Email me and we can chat about the position, look at some of your code, etc.  You can also meet our team, check out our office, etc.  matt@styleowner.com","time":1322760854,"type":"comment"},{"by":"Aloisius","id":3300473,"kids":[3300499],"parent":3300290,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 13 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Web developers (we're a Django/jQuery/Backbone shop)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a><p>Questions - jobs@seatme.com","time":1322759938,"type":"comment"},{"by":"rabedik","id":3300387,"parent":3300290,"text":"Software Engineer, San Francisco CA<p>OcuSpec is a venture backed start-up developing motion control technology that is radically more powerful and affordable than anything currently available. We're seeking smart, passionate people interested in challenging problems and changing the way people interact with machines.<p>Desired Skills/Experience: Software architecture, cross-platform APIs, C/C++, parallel processing (GPU/CPU), computer graphics (openGL/DirectX), real-time systems\n.\nThis is a great opportunity to work on and take ownership of bleeding edge technology at a early stage. We offer very competitive compensation, great benefits and an office near the Caltrain.<p><a href=\"http://www.ocuspec.com/\" rel=\"nofollow\">http://www.ocuspec.com/</a>","time":1322758880,"type":"comment"},{"by":"nethergoat","id":3300415,"kids":[3301277],"parent":3300290,"text":"Rumble - SF Bay Area (Redwood Shores)<p>Engineers, artists, designers, more - <a href=\"http://www.rumblegames.com/careers/\" rel=\"nofollow\">http://www.rumblegames.com/careers/</a><p>Rumble was founded in the summer of 2011 by an all-star team of game industry veterans from Zynga, Activision, BioWare, Blizzard, Playdom, Electronic Arts, Turbine, FooMojo and RockYou, and backed by top investors.  Check out our team: <a href=\"http://www.rumblegames.com/team/\" rel=\"nofollow\">http://www.rumblegames.com/team/</a><p>We are building both high-quality titles and a publishing platform for independent developers.  By combining the best of AAA game design with free-to-play accessibility, we want to change the way people play games.<p>Drop me a line: nethergoat@gmail.com","time":1322759221,"type":"comment"},{"by":"wmeredith","id":3304167,"parent":3300290,"text":"Kansas City - Junior PHP MySQL Web App Developer\nMy agency is hiring an entry level PHP/MySQL developer.<p>We're a WordPress shop (we do some really insane stuff with WordPress) and we're design-driven, so any experience in those areas is a bonus, but not required.<p>We're in a big loft in Rivermarket. We have good hours and beer is in the fridge. Complete job posting is here: <a href=\"http://voltagecreative.com/announcements/hiring-junior-php-mysql-web-app-developer/\" rel=\"nofollow\">http://voltagecreative.com/announcements/hiring-junior-php-m...</a><p>Feel free to PM me directly or send a resume and a link to something cool you’ve built on your own time (doesn't have to be PHP/MySQL related) to devjob_1 [at] voltagecreative [dot] com","time":1322838046,"type":"comment"},{"by":"dh0913","id":3302322,"parent":3300290,"text":"A Small Orange is a shared, reseller, VPS, cloud, and dedicated web hosting company based in Durham, NC. We set ourselves apart from our competitors through customer service.<p>Even though we are based in Durham, we have employees all over the world. Working for us remotely is just fine.<p>We're hiring multiple (full time) positions - Linux system administrators, front line technical support, live chat representatives, sales people, and other positions.<p>Beyond competitive pay, a great work environment, and the chance to work with smart people, we also offer full benefits, free web hosting, a 401k, and more.<p>Full details and application information at <a href=\"http://jobs.asmallorange.com\" rel=\"nofollow\">http://jobs.asmallorange.com</a>.","time":1322790474,"type":"comment"},{"by":"emilepetrone","id":3300472,"kids":[3300901,3300903],"parent":3300290,"text":"San Francisco or Portland, OR - Full Time @ Urban Airship - <a href=\"http://urbanairship.com/company/jobs/\" rel=\"nofollow\">http://urbanairship.com/company/jobs/</a><p>Server Developer (3 openings)<p>Engineer in Test<p>Client Developer (3 openings)<p>Ops Engineer (2 openings)<p>Support Engineer<p>Strategic Platform Sales Director<p>Account Manager<p>Account Development Representative","time":1322759924,"type":"comment"},{"by":"jasonshen","id":3302381,"parent":3300290,"text":"San Francisco, CA. Full-time.<p>Ridejoy (YC S11): a community marketplace for ridesharing. We're restoring people's faith in humanity, come join us: <a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a><p>UX/UI Designer. Community Manager.","time":1322792384,"type":"comment"},{"by":"jhull","id":3302024,"parent":3300290,"text":"Boston, MA (South Station / Innovation District)<p>Buzzient Inc. (Full Time and Part Time)<p>Harvests, analyzes, integrates and buzzwords social media data with enterprise applications. Devs work on ops, scrapers, NLP algorithms, testing tools, APIs and the front end. You get to do it all. The following skill set is also recommended <a href=\"http://i.imgur.com/wBhlk.gif\" rel=\"nofollow\">http://i.imgur.com/wBhlk.gif</a><p>We are a Python, jQuery, Linux shop and use the following for dev: SQLAlchemy, Boto, Computers, Werkzeug, Fabric, Buildbot, Selenium, Keyboards and Git/GitHub.<p>Our Dev Team is less than 5 FT and we are looking to grow. Email Jeff at jobs@buzzient.com","time":1322783761,"type":"comment"},{"by":"sgrock","id":3302369,"kids":[3303152],"parent":3300290,"text":"Portland, OR and San Francisco, CA<p>New Relic - <a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a><p>We are passionate, possibly even crazy, about application performance management (APM). Our mission is to make web applications run better, to make the internet more productive, and to make life easier for developers and devops. We are turning the APM marketplace upside down by providing SaaS products that deliver high-value functionality previously only available through enterprise software. We are well above 12,000 customers. And with your help we’ll get to 10x that number.","time":1322791937,"type":"comment"},{"by":"steve___","id":3300337,"kids":[3300674,3300804],"parent":3300290,"text":"<p><pre><code>  Technical Project Manager\n  Location - Guelph, Ontario\n  http://zsw.ca\n\n  Overview/Qualifications\n  Project management, development monitoring, outsourcing\n  Comfortable in a casual, hands-on, be-yourself environment\n  Enjoy working in a small group\n  Familiar with the Linux environment (eg cli, vim, git)\n  Familiarity with any of python, php, javascript, css, magento or web2py is a plus\n  Willingness to take ownership and responsibility of projects and tasks\n  Possess exceptional organizational skills\n  A bit of an extrovert\n  A generalist/jack of all trades</code></pre>","time":1322758150,"type":"comment"},{"by":"benjisg","id":3302868,"parent":3300290,"text":"Want to see all of these jobs mapped out by location?<p><a href=\"http://www.hiringhackers.com/\" rel=\"nofollow\">http://www.hiringhackers.com/</a><p>The postings from this thread have now been made the current data set as of December 1st, 2011 9:19PM PST","time":1322804147,"type":"comment"},{"by":"nelken","id":3300810,"parent":3300290,"text":"Cambridge MA, Outbrain (<a href=\"http://www.outbrain.com\" rel=\"nofollow\">http://www.outbrain.com</a>) is seeking a full-time Research Engineer. \nOutbrain is a Web-based startup providing content recommendations on a large number of premium publisher sites (e.g. Boston.com USAToday, Slate and many more) and countless blogs.<p>We're looking for a talented engineer to work on some of the most interesting aspects of our recommendation algorithms.<p>You'll need strong Java development skills, plus background in machine learning, information retrieval, or natural language processing.<p>Send your resume to jobs@outbrain.com","time":1322764079,"type":"comment"},{"by":"dbuxton","id":3300344,"parent":3300290,"text":"London or Cambridge (UK) - Arachnys, fresh from angel funding, is looking for our first employee - a backend hacker for machine learning and multilingual nlp on big data sets. We're building multilingual search tools for business research in emerging markets - <a href=\"http://bit.ly/rvdXeu\" rel=\"nofollow\">http://bit.ly/rvdXeu</a>. You'll get a lot of freedom, good salary, options and any kit you want.<p>See <a href=\"http://www.arachnys.com/jobs/\" rel=\"nofollow\">http://www.arachnys.com/jobs/</a> for a fuller description. Applications to founders@arachnys.com.","time":1322758298,"type":"comment"},{"by":"jrheard","id":3301129,"parent":3300290,"text":"Yelp<p>INTERN OR FULLTIME in SAN FRANCISCO, CA<p>I'm a full-stack web developer at Yelp, and I definitely recommend the hell out of working here. We've still got the startup environment (kegs, dog, etc); we're located in downtown San Francisco, half a block from MoMa; we are in a unique position to do great stuff and solve hard problems while helping people find great local businesses.<p>I built our \"Hot New Businesses\" feature - <a href=\"http://yelp.com/openings/sf\" rel=\"nofollow\">http://yelp.com/openings/sf</a> , for instance, you can find it on the homepage and in our mobile apps too - which crunches through our data nightly and generates a list of the most recently opened bars and restaurants in your city, complete with predictions of the day they opened on. It's a really useful feature, and we have so much data that I was able to build it without knowing anything about machine learning, data-mining, etc; imagine the crazy-useful stuff <i>you</i> could do here, if a knucklehead like me could make a feature like this.<p>For more info about what it's like to work here as an engineer, see a Q&#38;A with me at <a href=\"http://officialblog.yelp.com/2011/07/day-in-the-life-of-a-yelp-engineer.html\" rel=\"nofollow\">http://officialblog.yelp.com/2011/07/day-in-the-life-of-a-ye...</a> , or feel free to contact me at jrheard at yelp dot com.<p>Here's a list of our open engineering positions:<p><i>Web Developer</i><p>☆ Develop cool and useful features for our 61M+ monthly visitors<p>☆ Expertise in JavaScript, HTTP, HTML/DOM, and CSS, as well as server-side chops in a language like Python, Ruby, Java, C++, etc. We're on Python, but we're just looking for people who are really good at programming, so no worries if you don't have much Python experience.<p><i>Search and Data-Mining Engineer</i><p>☆ Tackle machine learning and information retrieval problems from our database of 22M+ Yelp reviews<p>☆ Strong grasp of algorithms and data structures; expertise in Python, Java, or C++<p><i>Back-end Engineer</i><p>☆ Build whole systems that are simple and scalable<p>☆ Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++<p><i>Mobile Developer</i><p>☆ Create fun and useful mobile applications for the iPhone, Android, Blackberry platforms and beyond<p>☆ Expertise in C++, Java and other mobile languages<p>To apply, head to <a href=\"http://hire.jobvite.com/j/?aj=oyXeVfwo&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?aj=oyXeVfwo&#38;s=Hacker_News</a> .","time":1322768655,"type":"comment"},{"by":"brendanlim","id":3301104,"parent":3300290,"text":"Kicksend<p>FULLTIME in Mountain View, CA<p>Kicksend was part of the YCS2011 class.  We raised a $1.8 million seed round from some amazing investors. At Kicksend (<a href=\"http://kicksend.com\" rel=\"nofollow\">http://kicksend.com</a>) we're making the act of sharing and receiving files extremely simple and effortless.<p>We're looking for:<p>★ Android Developer<p>★ iOS Developer<p>★ Windows Developer<p>We pay very well, have stellar benefits, emphasize a sane work-life balance as much as possible and offer an equity stake. We’re based out of beautiful Mountain View, a prime startup hub in Silicon Valley.<p><a href=\"http://kicksend.com/careers\" rel=\"nofollow\">http://kicksend.com/careers</a>","time":1322768291,"type":"comment"},{"by":"winton","id":3301189,"parent":3300290,"text":"Bleacher Report - San Francisco, CA (Financial District). Full time.<p>We are the 4th largest sports web site in the United States, just behind ESPN, Fox Sports, and Yahoo.<p>Work on a site that reaches 20 million people per month while getting exposure to a variety of technologies (we routinely play with Rails, Node.js, Redis, eventmachine, and Sinatra). We encourage our employees to contribute to open source as apart of their work at Bleacher Report.<p><a href=\"http://bleacherreport.com/careers/engineering\" rel=\"nofollow\">http://bleacherreport.com/careers/engineering</a>","time":1322769994,"type":"comment"},{"by":"joelbirchler","id":3302880,"parent":3300290,"text":"Eugene, OR. Full time.<p>Deckmonitoring.com is an energy monitoring company specializing in solar PV and green technologies. We are looking for really great people to join our development team.<p>The main application is Ruby on Rails. The client-side application is in active transition from Flash to HTML/JavaScript. We have massive amounts of data coming to us from solar installations all over the world and we display that data on a dashboard in near real-time.<p>Send an intro paragraph and links to sample code to: careers[ at ]deckmonitoring[ dot ]com","time":1322804387,"type":"comment"},{"by":"triggit","id":3301595,"parent":3300290,"text":"Triggit, Inc. San Francisco, CA  \nFull time  –  REMOTE / H1B Welcome.<p>Want to work with hundreds of terabytes of real time data using advanced JVM-based languages like Clojure and Scala, dig into that data with Hadoop, and play with cutting edge platforms like MapR?<p>Triggit, a San Francisco ad:technology startup, is hiring.<p>Ping us @ engjobs@triggit.com and include \"Found via HN\" in the subject.<p>If you're obsessed with distributed systems for processing big data and are intimately familiar with Java and Hadoop, you're going to have a lot of fun.    At Triggit, we pride ourselves on our merit-based, ownership culture.   You get to run your projects, not be run.<p>What You'll Do All Day:\n• Design and Deploy Triggit’s data tools including A/B testing, forecasting, etc.\n• Collaborate with multiple teams to implement requests into the Hadoop Cluster\n• Build and Optimize dozens of reports and create data visualization and storage tools around them\n• Grow and Scale the Hadoop Analytics Platform<p>Additional Openings:\n-  BackEnd Engineer (C/C++ on Linux, Redis)\n-  Platform Engineer (Ruby on Rails, PostgreSQL, Redis)\n-  Sr. Dev Ops<p>Base pay for engineers starts in the six figures, you get to build your own battle station, and every engineer gets an office – with a door.   The position is full time and based in our SOMA, San Francisco, CA office.   We will pay for relocation, and telecommuting will be seriously considered for the right candidate!","time":1322777149,"type":"comment"},{"by":"timbucktieu","id":3300966,"parent":3300290,"text":"Addepar<p><a href=\"http://addepar.com\" rel=\"nofollow\">http://addepar.com</a>\n<a href=\"http://addepar.com/careers.php\" rel=\"nofollow\">http://addepar.com/careers.php</a><p>Interns and Fulltime<p>Silicon Valley (Mountain View, CA)<p>Addepar is a software company looking to solve challenging problems in the financial industry. We're looking for exceptional engineers and designers to develop our revolutionary technologies. The job description is broad, and you'll do everything from accessing and exploring complex sets of financial data to sculpting the finer points of the user interface. The position is perfect for an engineer who is passionate about coding and enjoys solving difficult problems. If you want to transform an industry, work around the most talented individuals, and be challenged on a daily basis, Addepar will be a great fit.<p>Our CEO, Joe Lonsdale, is a founder of Palantir Technologies, which is known for revolutionizing technology in other key areas of the world's international defense and finance communities. In his early twenties, Joe helped to build a multi-billion dollar hedge fund, where he was one of the top traders. Our technical team is led by CTO Jason Mirra, and is composed of computer scientists from Stanford, Berkeley, MIT, and Carnegie Mellon. Addepar is supported and advised by a group of international billionaires, and some of the most respected Silicon Valley venture capitalists.","time":1322766086,"type":"comment"},{"by":"propak2011","id":3304305,"parent":3300290,"text":"Winter Haven, FL - .NET Developer.   Software development company and Microsoft partner is looking for a fulltime permanent software developer to join our team.\nJob Description:  The individual we seek must have a passion for software development and work well as an intricate part of the development team.  Responsibilities include: working with business requirements and specifications, completes detailed design and programming of assigned tasks.  Prepares documentation, develops implementation strategies for software products.<p>Requirements:  Minimum 3+ years Browser programming experience with Microsoft’s .Net framework, SQL/Server, Visual Studio, C#, Visual Basic, VB Script or Java.  Advanced experience with Microsoft’s Access, FrontPage, Office Suite, and Crystal Reports is desired.\nA Bachelor’s degree and Microsoft’s certification is desired.  Must have practical business background, experience with analyzing systems, and information technology experience in a network environment. \nExcellent benefits including, vacation, paid holidays, 401k, medical insurance, group life.  Creative work environment, flexible work hours, and, Competitive Salary. \nFor consideration please email your resume &#38; qualifications to: HResources@ProPakSoftware.com","time":1322840728,"type":"comment"},{"by":"nixme","id":3302121,"kids":[3303045],"parent":3300290,"text":"San Francisco, CA - Do (<a href=\"http://do.com\" rel=\"nofollow\">http://do.com</a>)<p>Do is on a mission to build the best tools for small teams and businesses across the world.<p>We're a small team of developers and designers. Hiring developers and designers at any level for backend + frontend web, and mobile (iOS and Android).<p>Tech: Ruby. Lots of Javascript/Coffeescript. Backbone. PostgreSQL, Redis, Solr. iOS. Android.<p>And we're a Salesforce company. Solid funding, great benefits, competitive comp.<p>I'd love to chat if you're interested - gopal@do.com","time":1322785830,"type":"comment"},{"deleted":true,"id":3300463,"parent":3300290,"time":1322759853,"type":"comment"},{"by":"hundredwatt","id":3300396,"parent":3300290,"text":"Remote - GaggleAMP.com<p>GaggleAMP is hiring part-time software developers and UX designers to help us extend our social amplification platform. On the frontend, we use jQuery and HTML5/CSS3 via HAML templates. Our web application's backend stack is Ruby on Rails 3 with MySQL and Redis.<p>We'll consider hackers with any experience level, intern and up. If interested, send an email with a brief bio and one or more links to past work to jason AT gaggleamp DOT com.","time":1322758994,"type":"comment"},{"by":"crb","id":3300571,"parent":3300290,"text":"London, UK<p>Stoneburn - <a href=\"http://www.stoneburn.com/\" rel=\"nofollow\">http://www.stoneburn.com/</a><p>Stoneburn are a Google Apps, Google Search and Amazon Web Services partner.  We're looking for junior support staff - our ultimate hires would be a year or two out of university, with a system administrator/scripting background and a hacker mentality.  Your primary work will be building our support department for Postini and Google Apps customers, but you'd be expected to be competent enough to help out with any Linux/Windows application we might engineer for our customers and host on AWS.  (Knowing enough about e-mail to tell me what an MX record is would be beneficial, but full training is provided.)<p>As hiring manager I'll be looking out for a cover letter that shows both ambition and the great communication skills you would be expected to display to customers.<p>Depending on your preference for direction, possible career path is into the development or deployment teams.<p>Check the jobs page out at <a href=\"http://www.stoneburn.com/about-stoneburn/jobs\" rel=\"nofollow\">http://www.stoneburn.com/about-stoneburn/jobs</a>.  Instructions on how to apply are on that page, but please put 'HN' in the subject.","time":1322761199,"type":"comment"},{"by":"nfriedly","id":3301980,"parent":3300290,"text":"San Francisco, CA<p>Sociable Labs is looking for a few more solid Java and JavaScript developers to help us build the field of social commerce.<p>We recently launched with a number of happy customers including ruelala.com, active.com, and backcountry.com. Our product is essentially a smarter version of Facebook's Social Plugins.<p>We're building a culture of analytics and testing with a focus on ROI. We're currently expanding our testing infrastructure with the ultimate goal being a continuous deployment production environment.<p>Our backed runs Java/Jetty and postgreSQL on Amazon EC2, our front-end is completely modularized JS that works with Facebook's SDK.<p>We aim for simple, understandable, testable code. We do a lot of code reviews and some occasional pair programming. The code reviews opt-in and generally given priority over anything that isn't urgent.<p>This is without a doubt one of the best environments I've ever worked in.<p>More information on <a href=\"http://www.sociablelabs.com/\" rel=\"nofollow\">http://www.sociablelabs.com/</a> and <a href=\"http://www.sociablelabs.com/Careers\" rel=\"nofollow\">http://www.sociablelabs.com/Careers</a> specifically.<p>I work on the front-end, but feel free to ask me about anything: nathan@[company site].com","time":1322783054,"type":"comment"},{"by":"dabent","id":3300457,"kids":[3301982],"parent":3300290,"text":"Santa Monica, CA (Los Angeles area)<p>TRUECar.com - TrueCar shows consumers how much people actually paid for a particular new car in their area, then guides them to dealers we've certified.  When someone buys from a dealer we've sent them to, we get paid.  We already have solid revenues, are well funded and and are growing rapidly.  We need lots of technical talent to help us grow.<p>* JAVA - We are looking for talented Java developers and architects to design and build the technology used to power our production websites, APIs, widgets, and internal tools.  This is a chance for you to join a growing company and build something that's going  to scale to support millions of users/visitors and provide them with all kinds of data.<p>* Senior Systems Engineers - Got Linux?  Keep our 200+ servers going strong.<p>* Front End - HTML, CSS, JavaScript, etc.  Help build out our main site and our partner sites.<p>* QA engineers - More software, more bugs.  Help us find them.<p>* Statistician/Data Mining Specialist - We need bright people to help us develop statistical pricing models.  SAS/PROC SQL skills are needed.<p>* Python/Django - Our main site is in Django, which means we need serious talent to help it scale and expand as we continue to grow.  Plus, you'll get to work with me.<p>* We also have some non-technical openings for senior positions in marketing, customer retention, HR, finance and accounting.  Email me for details.<p>My story - moved from Atlanta all the way out to Santa Monica after stopping by the TrueCar booth at PyCon 2011.  I started here three month ago and love it.  I'm working with a great team that knows how to develop software and for management who seems to \"get it\" with regards to software developers.<p>The Python team in an open workspace that has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>), and all the Santa Monica offices are blocks from the beach.  They have great benefits, including company equity, 100% paid family medical, dental, vision, and a healthy 401k.  They also offer gym membership reimbursement ($50 a month), 12 holidays, career training, 3 weeks PTO and have a kitchen stocked with fruit, snacks and such.  I've honestly never had a job this good.<p>If you're interested, send me your resume.  My email is in my profile.","time":1322759818,"type":"comment"},{"by":"jack7890","id":3302122,"parent":3300290,"text":"New York, NY -- Full Time, On-site -- SeatGeek<p>We're building a ticket search engine (think \"Kayak for sports/concert tickets\").<p>We're hiring across the entire web stack, but are particularly interested in people who like to work in the middle-to-front end.<p>More info:\n<a href=\"http://seatgeek.com/jobs\" rel=\"nofollow\">http://seatgeek.com/jobs</a>\n<a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1322785833,"type":"comment"},{"by":"klaaspieter","id":3301166,"parent":3300290,"text":"Acclivity NYC (jobs@acclivitynyc.com)<p>PYTHON BACK-END DEVELOPER (Full-time - New York, NY)<p>We’re looking for an experienced Python back-end developer. You’ll be responsible for maintaining and extending Enstore’s existing REST API and Django Stores back-end hosted on AppEngine.<p>Requirements:\nBachelor's degree in computer science or a related field<p>Expert in Python<p>Very good understanding of REST and HTTP<p>Basic knowledge of HTML, CSS &#38; Javascript<p>Work well in a small team with the ability to work \nindependently on significant pieces of functionality<p>Excellent written and verbal communication skills<p>Experience in testing and deploying web services (remote debugging, profiling, load testing, scalable, security)<p>Ability to work on-location in Manhattan<p>Experience with Google AppEngine and Django is a plus<p>UI / UX DESIGNER (Full-time, New York, NY)<p>We’re looking for an experienced user experience and user interface designer. You’ll be at the forefront of our design team responsible for every pixel we put out there. You’ll be working with a talented team of developers that care about design. You will be working on all of our core products.<p>Requirements:\nExperience designing beautiful and easy to use product<p>Work with developers to optimize user interfaces and improve user experience<p>Able to create low-to-medium mockups of desktop, web and mobile interfaces<p>Ability to work on-location in Manhattan<p>You have a strong pixel-level attention to detail<p>Knowledge of HTML, CSS &#38; Javascript is a pre","time":1322769553,"type":"comment"},{"by":"jdvolz","id":3300848,"parent":3300290,"text":"Shop It To Me, Inc. (<a href=\"http://shopittome.com/\" rel=\"nofollow\">http://shopittome.com/</a>)  -- FULLTIME ENGINEERING POSITIONS<p>Location:<p>San Francisco.  We're in the same building as Yammer and Tech Crunch<p>Who we are:<p>Shop It To Me is the #1 online personal shopping service. We recommend 2+ billion products to 3+ million active subscribers every month. We are profitable and growing FAST.<p>Who we need:<p>- Rails / Ruby developers.  Experience and technical excellence in another stack also considered.<p>- Tinkerers: We A/B test everything because those little tweaks add up.<p>- Motivated and self directed people who enjoy making something new.<p>- For more detail check out our jobs page: <a href=\"http://www.shopittome.com/jobs\" rel=\"nofollow\">http://www.shopittome.com/jobs</a><p>What we offer:<p>- Competitive salary &#38; options, medical, dental, vision, a nice selection of free food &#38; drink.<p>- Sweet rig of your choosing, big monitors, Aeron chairs, big windows, high ceilings, brick walls and a quiet work environment.<p>- We even let you choose your operating system (Ubuntu, Windows and Mac represented) and IDE (Vim, Textmate and Sublime represented)<p>- Millions of adoring (mostly female) fans.<p>- Great company social events<p>How to apply:<p>Send a cover letter and resume to Josh (jvolz@shopittome.com)\nPlease include code and english writing samples.","time":1322764493,"type":"comment"},{"by":"flippyhead","id":3300502,"parent":3300290,"text":"Hiring JavaScript/CoffeeScript developers and SASS/CSS3 designers to help us build social software for conferences and events. We're based in Seattle but YOU can work from anywhere. Full benefits, great salary and equity.<p>Do you scoff at those who claim JavaScript is not a “real” language? Have you been hacking a side project just to experiment with Node? Does the idea of moving the entire web framework into the browser excite you? Do you take great pleasure in designing user interfaces that are both functionally elegant and beautiful to look at? Do you obsess over bringing your impeccable sense of aesthetics to how you write code? Do you enjoy discovering how to do things in CSS that most developers thought were only possible using JavaScript? Are you tired of working for short-lived start-ups that think “angel funding” is a business model and “VC Funding” is an exit? Then, my friend, we’ve got the job for you:<p><a href=\"http://www.pathable.com/careers-at-pathable/\" rel=\"nofollow\">http://www.pathable.com/careers-at-pathable/</a>\nor contact us directly careers@pathable.com","time":1322760236,"type":"comment"},{"by":"camtarn","id":3300592,"parent":3300290,"text":"Edinburgh, UK - FULL-TIME, INTERN positions available<p>Amazon Development Centre Scotland are looking for candidates for full-time, intern and student summer positions. We're looking for people with interests that range from interactive UI design to large-scale distributed systems and machine learning. Find us at Waverley Gate, right next to the station.<p><a href=\"http://amazondc.com/\" rel=\"nofollow\">http://amazondc.com/</a>","time":1322761479,"type":"comment"},{"by":"thomson","id":3301400,"parent":3300290,"text":"Lookout Mobile Security, San Francisco, CA - Full time \n<a href=\"https://www.mylookout.com/about/careers\" rel=\"nofollow\">https://www.mylookout.com/about/careers</a><p>I'm the data scientist here and like every other company we're looking for good people across the board. Lookout is the current leader in consumer mobile security, and we're aiming to keep it that way. We're a small, well-funded team tackling big problems on small devices.<p>Perks include: competitive salary, benefits, mobile phone of your choice, dream hardware setup of your choice, and a new office space in January when we move (We'll be on two floors at Market and 1st). There's also the standard start-up perks like a well-stocked fridge, craft beers on tap, and the fuzzy feeling that comes with shipping meaningful, net-positive products.<p>For engineering, experience in Rails, iOS, Android, and/or network/mobile security are awesome to have, but not required.<p>With respect to data, If you're interested in machine learning and implementing it in any language, then I'm interested in a conversation with you. Bonus points if you use plyr.<p>We are also looking for: a lead UX designer, a senior PM, QA, ops, technical recruiter, and a lot more. Check out the link and see if anything interests you.<p>I like it here--everyone here is conscious about how it's very easy to inject FUD into the mobile security space, and we really believe in selling a mobile security product that isn't based on fear, uncertainty, and doubt. If you decide to give us a pass, do find a startup on this page with people you truly enjoy working with--they honestly make all the difference!<p>Regardless of whatever position you're interested in, send me an e-mail with questions, resumes, requests for beer, etc. to thomson.nguyen@mylookout.com.<p>(Response guaranteed!)","time":1322773768,"type":"comment"},{"by":"christeen","id":3301752,"parent":3300290,"text":"Amsterdam, The Netherlands. Part/Full-time<p>iloveyoutool is a brand new game start-up, looking for co-founders and co-builders. Would love to hear from you developers and UX designers. But if you're a total fan of the idea with something else to show for definitely get in touch :)<p>Check out the details here <a href=\"http://iloveyoutool.tumblr.com/jobs\" rel=\"nofollow\">http://iloveyoutool.tumblr.com/jobs</a>","time":1322779643,"type":"comment"},{"by":"nradov","id":3301514,"parent":3300290,"text":"San Jose, CA. Full time.<p>OptumInsight is hiring entry-level software developers to work on our Axolotl <a href=\"http://www.axolotl.com/\" rel=\"nofollow\">http://www.axolotl.com/</a> suite of health information exchange applications. Our products enable sharing clinical data between doctors and other healthcare providers to improve efficiency and deliver better patient care. We mostly use the Java EE stack but have other major tools and platforms as well.<p><a href=\"http://careers.unitedhealthgroup.com/Data/Jobs/Information%20Technology/366654%20Software%20Engineer%20San%20Jose%20CA.aspx\" rel=\"nofollow\">http://careers.unitedhealthgroup.com/Data/Jobs/Information%2...</a><p><a href=\"http://careers.unitedhealthgroup.com/Data/Jobs/Information%20Technology/367875%20Software%20Engineer%20EXCELLENT%20College%20Grad%20Opportunity%20San%20Jose%20CA.aspx\" rel=\"nofollow\">http://careers.unitedhealthgroup.com/Data/Jobs/Information%2...</a><p>(I expect to be hiring higher-level developers as well in a few months but don't officially have those positions open yet.)","time":1322775821,"type":"comment"},{"by":"thefell","id":3302752,"parent":3300290,"text":"Los Angeles, CA ( or REMOTE ). Full time - contract<p>Are you an R Guru?<p>Fellows Statistics Inc. is looking for an R programmer with expert to guru level skills for a contract position. The programmer will be involved in cutting edge R development, dealing with massive data sets, modern statistical algorithms, and user level tools for business analytics. This exciting well-funded project has wide-ranging applicability and will be deployed widely, including in fortune 500 companies. The appointment is full-time, and the contract will last 6-9 months with a likely extension. Compensation is competitive, and commensurate with experience. Telecommuting is expected.<p>Strong knowledge of Statistics is required and candidates with a Masters or PhD in Statistics, Computer Science, or a related field are preferred.<p>Fellows Statistics is a small statistical consulting/programming company birthed from the UCLA Statistics department. Learn more about us at <a href=\"http://www.fellstat.com\" rel=\"nofollow\">http://www.fellstat.com</a><p>Contact:\nIan Fellows\nian@fellstat.com","time":1322801669,"type":"comment"},{"by":"agnokapathetic","id":3301021,"parent":3300290,"text":"HP/ Fortify (Remote)<p>We are hiring Mobile Developers (iOS, Android) with an interest in security or Information Security Generalists with experience in mobile applications to grow our Mobile Application Security team.<p>Benefits:<p><pre><code>  - Competitive Salary and Bonus Structure\n  - Flexible Hours\n  - Work From Home\n  - Low Travel %\n  - Solid Medical/Dental/Vision/Life Insurance\n  - Easy Expense System\n  - Company Phone (or take-over of your personal phone bill)\n  - Unlimited Book Ordering (Amazon) for Consultants\n  - We support our engineers with the hardware they need for \n    research and projects (Macbooks, Servers, Software, etc)\n  - Full Reimbursement for any speaking trip\n  - 2 Paid Security Conferences a year (Defcon/Blackhat Mandatory)\n  - 1 Industry Training &#38; Certification paid per year\n  - Lots of room for advancement and process development\n</code></pre>\nIf you are have written apps for iOS or Android and have an interest in information security contact me at joel.parish@hp.com","time":1322767085,"type":"comment"},{"by":"RichardPrice","id":3300802,"parent":3300290,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>It's widely held that science is too closed, and too slow. We are trying to change that. We believe that faster sharing of research will lead to an acceleration in research innovation: faster innovation in medicine, biology, engineering, economics, and other fields. Faster sharing in biology and medicine, for example, could lead to cancer being solved 12 months before it otherwise would have been, which would lead to millions of lives being saved.<p>Academia.edu has over 800,000 registered users, and over 3 million monthly unique visitors. Both of these metrics have tripled this year. Over 2,500 papers are added to the platform each day, and over 3,500 academics join each day.<p>We need talented engineers to come and help us accelerate the world's research. We believe that there is a chance to make a big impact.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We have a strong engineering culture. We're a 6 person team based in downtown San Francisco. The site is Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture. There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1322764007,"type":"comment"},{"by":"gsiener","id":3300653,"parent":3300290,"text":"New York, NY (aka NYC)\nProfitably: <a href=\"http://profitably.com\" rel=\"nofollow\">http://profitably.com</a>\nVP of Data: <a href=\"http://jobsco.re/vL9OP0\" rel=\"nofollow\">http://jobsco.re/vL9OP0</a><p>Profitably is web-based planning and analysis software for startups and small businesses because Excel can be a real nightmare and you’ve got work to do.<p>On the backend we are running Postgres for persistent storage, MongoDB for document-based storage and ETL staging, and redis for key-value stores and queueing.  All of our calculations live in ruby at the moment, but we need to be smarter about building an elegant/sane data processing world.<p>The appeal of this role is the opportunity to build something users really need that draws from the best aspects of traditional business intelligence, big data, NoSQL, real time analytics, and statistics. Profitably is building the future of BI with a respectful nod to what’s come before, and you will be the tip of the spear.","time":1322762156,"type":"comment"},{"by":"oakenshield","id":3305212,"parent":3300290,"text":"Stealth security startup (YC Winter '12)<p>Mountain View, Full-time. Interns also considered<p>We are looking for our first employee in a kernel / systems /\ngeneralist hacker role. We are  solving a high-impact problem in data\nsecurity. Our product is based on patent-pending research. You will be\ninvolved in all major company decisions, and you will own significant\nportions of the codebase.<p>Skills:<p>* Significant Linux kernel hacking experience. VMM hacking expertise\n(Xen, etc.) also good.<p>* Good understanding of protocols, RPCs, distributed systems, message\npassing, etc.<p>* Also comfortable working on back-end Web-based services in dynamic\nprogramming languages. Experience with front-end code or design would\nbe awesome but is not essential.<p>* Team player and has experience working in dynamic teams before.\nPrevious experience at startups or security companies is great!<p>* Some experience with product development schedules and pipelines.<p>You can reach us at kernelhackerswanted@gmail.com. Please include your\nresume or links to Github/Linkedin.","time":1322852673,"type":"comment"},{"by":"languagehacker","id":3300448,"parent":3300290,"text":"Bay Area (Burlingame): mid-level engineer. Our product is a highly configurable LAMP web application in the high-volume event management space. It's an end-to-end solution, from registration to check-in to reporting. There are also modules for exhibitor registration, session management, housing, and air travel.<p>Our technologies include the Zend Framework, Git, Jira, Hudson, and a highly-available MySQL replication solution. We use agile methodologies to support the product in two monthly maintenance releases, tightly paired to a sprint. If you're familiar with \"A Successful Git Branching Model\", you have a solid idea of how we pair sprints to releases. Our team is distributed between California and Virginia.<p>Some unusual selling points for our business:\n* Engineers spend roughly 10% of their total time traveling in support of events using the software. It's a fun opportunity to see new places, learn new things (we do a lot of major technology conferences), and get a lot of cool conference freebies.<p>* The business is <i>not</i> a startup; it's a small business. You can generally expect to go home on time every day. There is no \"sweat equity\" -- you get paid a fair market value for your time.<p>* We are on the federal holiday schedule. This generally allots a few more days off than your usual small business/startup.<p>* The product is currently fairly stable for the majority of its use cases. You'll have a lot of opportunity to work on enhancements and new features as you become more familiar with how it works.<p>* While we have a daily scrum meeting, we hold it in IRC. That means you have one less meeting to distract you from what you're doing every day, since you can work in parallel.<p>Feel free to check out <a href=\"http://www.aetherquest.com/\" rel=\"nofollow\">http://www.aetherquest.com/</a> to learn more about our company. If you're interested in applying or just have any questions, feel free to email me at relwell@ the domain above.","time":1322759768,"type":"comment"},{"by":"kloncks","id":3301015,"parent":3300290,"text":"Kout<p>Intern or Full-Time (NYC, SF Bay Area)<p>Kout was a part of the latest AngelPad class. Our investors include six ex-Googlers and two top Silicon Valley VC firms, in addition to a nice seed round we're about to close.<p>We're looking to hire our first employee. Offering a real equity stake, competitive salary, and a chance to revolutionize eCommerce.<p>Kout is a dead-simple eCommerce platform that enables anyone, anywhere to be a merchant across any platform with ease, elegance and simplicity. We make it fast &#38; easy to both sell items and collect money online and do this by generating a simple one-page checkout that corresponds to a unique URL. We're also doing really cool things with dynamic pricing, payments, as well as social &#38; mobile commerce.<p>We're simplifying eCommerce and removing the barriers to entry, enabling anyone to be a merchant. We'd love to do that with you; let's talk about the details.<p>Contact hany@kout.me. Mention you're from HN :)","time":1322766979,"type":"comment"},{"by":"itay","id":3332859,"parent":3300290,"text":"A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people. Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you.\nI personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>Some specific areas where we're looking to hire:<p>Frontend engineer - Splunk is doing some awesome frontend development, so if you're interested in the intersection of presenting big data in a human-usable manner, this is a great position.\n<a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ</a><p>Sys Admin: we recently launched Storm, our Splunk in the Cloud offering. We're looking for a sysadmin to help us manage that undertaking. This is a product that just launched, so you could have a big impact here.\n<a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=ou6XVfwc\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=ou6XVfwc</a><p>Sr Developer for Hadoop: Splunk is doing more and more work with Hadoop, and it's a completely new offering for the company and product. We're looking to add more people to the team who are excited about the space and want to improve the Hadoop landscape.\n<a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o792VfwX\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o792VfwX</a><p>Also, check out our new dev portal which we launched recently: <a href=\"http://dev.splunk.com\" rel=\"nofollow\">http://dev.splunk.com</a>","time":1323412466,"type":"comment"},{"by":"motti","id":3301941,"parent":3300290,"text":"London, UK<p>FULLTIME or INTERN<p>REMOTE or onsite in our NW London offices, or some hybrid arrangement.<p>We are CopyCopy (<a href=\"http://www.copycopy.cc/\" rel=\"nofollow\">http://www.copycopy.cc/</a>) - a startup company creating a cross-platform productivity tool that will make it simple to transfer information between phones and desktops.<p>We use:<p>• Java (for Android, BackberryOS, GWT and in our homegrown lightweight Java server)<p>• C++ (for Win32, Android NDK and Objective-C++)<p>• Python (occasionally) to string bits together<p>• Objective-C (in the future)<p>• JavaScript (web frontend work and browser extensions)<p>• Redis<p>We are young and fast-moving. Our product is in its early stages but moving fast towards the first release. You will have the opportunity of working on self-contained projects from spec to release to the masses.<p>Our Git repositories, code review and Project Management tools are geared towards remote working and we are open to flexible working conditions.<p>We urgently need interns (paid), longer term student placements, and full-timers.<p>Send your CV to jobs@copycopy.cc","time":1322782327,"type":"comment"},{"by":"PanMan","id":3300572,"parent":3300290,"text":"Amsterdam, Netherlands. INTERN positions.<p>We launched Skylines last may at Techcrunch Disrupt, our mission is to organize the world's real time photos.<p>We currently process over two million pictures a day, are ramping up quickly, and generate a lot of data in the process. We have some smart engineers working on our backend, on various technologies (from Riak, SQL, Redis and Map-Reduce to PHP, Ruby and Node.js) and are looking for interns who like both building apps on it, or run further analysis.<p>You will be working on real products that will be released, not a mock internship assignment. And you will get to experience how startup life (and Amsterdam) are! We're based in the center of beautiful Amsterdam (Netherlands) in an active startup community. Current alpha product at <a href=\"http://skylin.es\" rel=\"nofollow\">http://skylin.es</a>.<p>Questions? Shoot me an email at martijn@skylin.es.","time":1322761200,"type":"comment"},{"by":"dget","id":3302952,"parent":3300290,"text":"New York, NY\nCoursekit (<a href=\"http://coursekit.com/\" rel=\"nofollow\">http://coursekit.com/</a>) is trying to bring social networking to education, and we want you to help build it.<p>We're looking for an engineer who is excited about joining a young team that's shaking up how education works. We always try using the best tool for the job. For now, we use CoffeeScript, Python, Node.js, Redis, as well as a still-unreleased CoffeeScript framework. If working with these technologies excites you, talk to us. We're very detail-focused, and are especially looking for someone who loves working with front-end code (heavy Javascript/Coffeescript, as well as HTML/CSS) to create beautiful interactions/pages.<p>Apply here: <a href=\"http://coursekit.com/jobs\" rel=\"nofollow\">http://coursekit.com/jobs</a><p>Or if you have any questions, shoot me an email at dan@coursekit.com","time":1322806741,"type":"comment"},{"by":"jwpeddle","id":3305624,"parent":3300290,"text":"Toronto, ON. Full time.<p>G Adventures is a technology-driven adventure travel company in downtown Toronto, and we're looking to expand our software engineering team.<p>Our current stack is Python/Django. We use Macs, deploy to Ubuntu on Apache/Lighttpd, and love experimenting with technology. For example, we recently rolled out a dynamic booking process built on Backbone.js and async data-refreshing with Celery.<p>We love coffee, roti, beer, and foosball. Oh, and of course adventure travel, for which there are generous perks!<p>Great location, themed meeting rooms, regular cultural lunches, tons of merch, technical freedom, and a huge amount of company spirit and staff appreciation.<p>We have multiple positions open, and are eagerly waiting for passionate developers to fill our inbox. Send us an email at ecommerce@gadventures.com<p><a href=\"http://www.gadventures.com\" rel=\"nofollow\">http://www.gadventures.com</a>","time":1322859128,"type":"comment"},{"by":"mmettler","id":3304927,"parent":3300290,"text":"<a href=\"http://card.io\" rel=\"nofollow\">http://card.io</a><p>San Francisco, CA. Full time. H1B applicants welcome.<p>card.io is an early stage mobile payments start-up located in SF's Mission District. We're backed by top-tier investors including Harrison Metal, SoftTech VC, Manu Kumar, Omar Hamoui, and Alok Bhanot. Company founders were early employees at AdMob, and are now building software to enable simple, low-friction transactions on a mobile device.<p>We're tackling interesting, hard technical problems with immediate real world application. We  maintain a work-life balance and have fun. We have generous comp, benefits, and vacation.<p>You should be an amazing engineer, love writing code, love deleting code, and live in the Bay Area.<p>Interested?\nDrop Josh (CTO) or Mike (CEO) an email at jobs@lumberlabs.com, showing us what you've done -- a resume, a letter, an open source project, etc.","time":1322848801,"type":"comment"},{"by":"modoc","id":3301151,"parent":3300290,"text":"Sparkred<p>FULLTIME<p>JBoss Expert/Admin in Boston, MA<p>Spark::red, a managed hosting company for large scale eCommerce sites, is seeking a JBoss expert to join our team.  We're looking for a JBoss admin or experienced developer with at least 5 years of experience to help us grow.  Our typical stack is RHEL, Oracle, JBoss, and Apache, with occasional forays into Redis, Seam, and Postgres.  We host some of the highest traffic sites in the world, work with some of the Fortune 500, and run the best managed hosting offering in the market.  We offer a fast paced and flexible environment where you'll be working with some very smart people solving some very interesting problems for some very big clients.<p><i>Typical Tasks:</i><p>Installing and configuring JBoss servers;  Troubleshooting GC issues;  JVM tuning;  Boss performance tuning and load testing;  Diagnosing errors and issues;  Helping us improve our management and deployment processes.<p><i>Job Requirements:</i><p>5+ years of experience with JBoss;<p>Hands on knowledge of JBoss 4 and 5, preferably both GA and \nEAP versions;<p>Linux knowledge (ssh, scp, tail, ps, bash scripting, etc...);<p>Self managed and motivated;  Experience with Oracle a plus;<p>Experience with Spring, Seam, Struts, ATG, or another Java \nbased DI/IOC framework a strong plus;<p>Willing to learn new tools and platforms;<p>Boston area<p><i>Benefits:</i>\nWork remotely 90+% of the time (occasional in-person \nmeetings in Boston and Burlington);<p>Salary of 80-120k depending on candidate experience;<p>Full medical, dental, vision insurance;\n2+ weeks paid vacation;\nWork with a great team at a growing company;\nPeace of mind: we're a profitable stable company.  We're just \ngetting bigger!<p>If you are interested, please email your resume, cover letter, and any other info you feel is relevant to devon@sparkred.com","time":1322769095,"type":"comment"},{"by":"keecham","id":3301071,"parent":3300290,"text":"Atlanta, GA - The Coupon Doc\nFull-Time<p>The Coupon Doc is a startup that specializes in aggregating and displaying discounts for medications to individuals. We have recently received our first round of seed funding and gained acceptance to an incubator program.<p>We are seeking an individual who can take on the role of CTO in our startup. Qualified applicants should be comfortable with some of the following, and should have a willingness to learn about and supervise items they do not have expertise with: back-end web development (Python/Ruby preferred), front-end development (Photoshop, HTML/CSS), SEO, mobile app development (iOS, Android), and general technology project management.<p>Applicants with significant past project portfolios highly preferred. Compensation will reflect experience of applicant.<p>Please e-mail interest to keecham [at] thecoupondoc.com","time":1322767778,"type":"comment"},{"by":"adjohn","id":3301630,"parent":3300290,"text":"San Francisco, CA Full time.<p>Midokura is building a disruptive virtualized networking platform.  Our mission is to make managing and scaling infrastructure easy.<p>We're an international team with offices in SF, Tokyo, and Barcelona. We love to solve difficult problems, and constantly innovate.  You can find some more information about us at <a href=\"http://midokura.com\" rel=\"nofollow\">http://midokura.com</a> .<p>We're growing out our SF team, and are looking for:<p>★ Senior engineers to work on our core technology in Java, candidates should have solid networking and distributed systems knowledge.<p>★ OpenStack engineer who will be working directly with the open source community, and developing in Python primarily.<p>★ Front-end engineer who will own our front end work, and help us achieve our goals of making managing infrastructure easy.<p>Email adam (at) midokura.com if you have some interest, or questions.<p>Thanks!","time":1322777656,"type":"comment"},{"by":"YohSuzuki","id":3301811,"parent":3300290,"text":"San Francisco, CA - Fulltime<p>ClickTime (www.clicktime.com) is an industry leader in hosted time and expense tracking. From our first customer back in 1997, ClickTime has grown to serve thousands of companies, including Google, GE, and Visa.<p>With only a few engineers, we've managed to create one of the most beautiful, durable, time tracking interfaces out there, and we've done it in a way that we're proud of.<p>Come join us. We're looking for a generalist who can work all across the board and a back-end engineer:<p><a href=\"http://www.clicktime.com/company/jobs-available/Web-Application-Developer\" rel=\"nofollow\">http://www.clicktime.com/company/jobs-available/Web-Applicat...</a><p><a href=\"http://www.clicktime.com/company/jobs-available/Web-Application-Developer-Back-end\" rel=\"nofollow\">http://www.clicktime.com/company/jobs-available/Web-Applicat...</a>","time":1322780203,"type":"comment"},{"by":"exogen","id":3301091,"parent":3300290,"text":"BigDoor<p>Seattle, WA<p><a href=\"http://www.bigdoor.com/\" rel=\"nofollow\">http://www.bigdoor.com/</a><p>We're a gamification platform – we make it easy for anyone to add fun, relevant loyalty programs to their site or app, storing all their virtual economy data with us.<p>Lots of people are focused on badges and leaderboards – and we do that – but we consider that the simple stuff. We're way ahead of that. We're also working with major brands (a few we've worked with this year: Major League Baseball, Nickelodeon, Dell).<p>We're venture-backed, still small but growing fast.<p>Positions:<p>* Full-stack web developer: Python, Django, JavaScript.<p>* DevOps: Linux, Apache, MySQL.<p>* Content manager (aka Quest Master): Help our bigger partners create and maintain their virtual economies.<p>Don't be shy: hr@bigdoor.com (or just check my profile to contact me instead)<p><a href=\"http://www.bigdoor.com/about-us/careers/\" rel=\"nofollow\">http://www.bigdoor.com/about-us/careers/</a>","time":1322768069,"type":"comment"},{"by":"bryantchou","id":3302685,"parent":3300290,"text":"Vungle \nFULLTIME in San Francisco Bay Area<p>www.vungle.com<p>Vungle is looking to hire our first couple engineers to join our growing team. We're looking for NODE.JS and javascript mavens/hackers to build out key backend architecture, as well as  front end dashboards powering our growing set of customers for our mobile advertising platform.<p>We're also looking for people with extensive experience in iOS and Android devices.<p>We've just closed our seed round from an amazing group of VCs and angels, and we're looking to move quickly. If you like working in a smart, fast paced environment where you have complete ownership over the code you deliver, email tech@vungle.com!<p>Also looking for:\n* Product Managers with mobile/advertising experience\n* Account Managers\n* iOS and Android developers\n* Multi-media video specialists and engineers\n* Dev-Ops","time":1322800014,"type":"comment"},{"by":"jesolsen","id":3302693,"parent":3300290,"text":"New York City, full time developer.<p>We are: www.jumpro.pe; an ed-tech startup around since 2009 making tools for teachers (and students).  Opinionated and respected in our space, with passionate users.  Bootstrapped and profitable with influential clients and a relatively complex/mature product.  Funding and significant growth are likely in our near (6mo) future, though we're hiring now either way.<p>You are: our second full-time hire, supplementing an overworked technical founder.  A developer who can handle setting foot in inner city schools on a weekly basis (gotta understand the end users!).  Experience in any specific language/technology is less important to us than your ability to dive in and take ownership of our (somewhat unique) stack.  Passionate about writing good code.","time":1322800170,"type":"comment"},{"by":"chrisd82","id":3301534,"parent":3300290,"text":"GroupTweet.com, Chicago or Remote<p>Full-time, part-time, and contract opportunities are possible.<p>GroupTweet.com is looking for a PHP developer to help take our product to the next level. Opportunities exist to really drive the direction of our product and make an exciting impact. Twitter API experience is a plus. We are experiencing exciting user growth and engagement and are adding new features on a weekly basis.<p>We think adding group functionality to Twitter will open up the platform to a variety of exciting new use-cases. From a Yammer type experience for non-enterprise users to an entirely new way of leveraging the Twitter platform through crowdsourced Twitter accounts.<p>See a little more of our vision at <a href=\"http://www.GroupTweet.com/examples\" rel=\"nofollow\">http://www.GroupTweet.com/examples</a><p>Email: jobs@GroupTweet.com","time":1322776225,"type":"comment"},{"by":"superjerca","id":3336688,"parent":3300290,"text":"Bellevue, WA<p>Senior Software Engineer @ ClassifiedAds.com<p>Core skills: Linux, PHP, MySQL<p>Do you want to join one of Seattle’s top startups, an Inc 5000 Fastest Growing Company?\n<a href=\"http://www.seattle20.com/startup-index.aspx\" rel=\"nofollow\">http://www.seattle20.com/startup-index.aspx</a>\n<a href=\"http://www.inc.com/inc5000/profile/classifiedadscom\" rel=\"nofollow\">http://www.inc.com/inc5000/profile/classifiedadscom</a><p>ClassifiedAds.com is one of the largest classified ads websites, with over 3 million monthly unique visitors. We're a small startup – there are less than 20 of us – but we’re a major player in the online classifieds space.<p>Send your resume to jobs@classifiedads.com<p>Or read more at <a href=\"http://www.classifiedads.com/technical_jobs-ad4787967.htm\" rel=\"nofollow\">http://www.classifiedads.com/technical_jobs-ad4787967.htm</a>","time":1323483933,"type":"comment"},{"by":"mpakes","id":3325627,"parent":3300290,"text":"Coffee Table is looking for an iOS Developer to join our team in changing the world of retail commerce. You’ll be one of the first developers to join our driven, entrepreneurial team. We value independent thinkers and expect everyone to be a major contributor. Catalog shopping is a $270B industry with 20B catalogs sent every year, and we believe that Coffee Table has a unique opportunity to transform the industry by introducing a new, engaging way to shop using mobile devices.<p>Position<p>You must love building beautiful, engaging mobile applications with immersive user experiences. You have a good understanding of mobile app design and development and are eager to contribute in all aspects, from product management, to interface development, performance optimization, mobile-optimized web API design, and more. You appreciate collaboration but are prepared to make good decisions, confidently and independently. You’re thoughtful, but action-oriented, and willing to act outside your comfort zone to get the job done.<p>Requirements<p>- Exceptionally smart<p>- You get things done<p>- Experience with application development in C, C++, Objective-C, Java, or C#<p>Highly Preferred (but not strictly required)<p>- iOS Development experience, ideally with one or more apps in the App Store<p>- Experience with Objective-C, Cocoa Touch, Core Foundation, Core Animation, etc.<p>- Design/UX skills<p>Bonus Skills<p>- Mobile web development<p>- Ruby, Ruby on Rails<p>- JavaScript<p>- HTML/CSS<p>Applying<p>When applying please include the following:<p>- A description of your skill set and background<p>- Link to your Github account, if you have one<p>- Link to your blog and/or any personal site (if applicable)<p>Apply Today! If this describes you (or anyone you know), send your resume or LinkedIn profile to jobs@coffeetable.com.","time":1323288044,"type":"comment"},{"by":"rw","id":3300727,"parent":3300290,"text":"QLabs<p>FULLTIME NYC<p>Executive In Residence<p>QLabs is a recently formed incubator in New York City with funding from the VC arm of a publicly traded company. Our charter is to rapidly build innovative and revenue-generating  businesses. Essentially, we prototype startups by building and launching an MVP every 6-8 weeks.<p>We are currently looking for an Executive In Residence. Your responsibilities will include (but are not limited to) creating and executing on: marketing, PR, BD and social media strategies. You'll be an equal member of the team, informing product-level discussions throughout project\nideation and development (especially as pertains to market fit and revenue potential).<p>Major bonus points if you have hands-on experience at a startup, and know how to grow users and revenue from the ground up.<p>email rw@rwinslow.com to get in touch!","time":1322763126,"type":"comment"},{"by":"epi0Bauqu","id":3301925,"parent":3300290,"text":"Paoli, PA (walking distance off Amtrak/SEPTA) - Paid interns<p>For DuckDuckGo: <a href=\"http://duckduckgo.com/\" rel=\"nofollow\">http://duckduckgo.com/</a><p><a href=\"http://help.duckduckgo.com/customer/portal/articles/216387-hiring\" rel=\"nofollow\">http://help.duckduckgo.com/customer/portal/articles/216387-h...</a>","time":1322782016,"type":"comment"},{"by":"blo","id":3303561,"parent":3300290,"text":"San Francisco, CA (SOMA).  Full time.<p>We are a stealth startup that recently closed funding from well-known investors.  This is an opportunity to join at the earliest stages and help shape product/culture.<p>Do you find yourself using Google to navigate websites that you commonly use, or end up with many browser tabs trying to accomplish some task?  We're innovating along how people interact with online services and designing a new web-based experience that allows users to accomplish tasks in a more usable, efficient, and social manner.<p>To do this, we are looking for engineers/designers passionate about either creating great user experiences, scalable back-end infrastructure, big data analytics, and mobile devices.<p>We work mainly with Javascript (jquery and node.js)<p>Curious? Contact [my username] at alum.mit.edu","time":1322824389,"type":"comment"},{"by":"bdickason","id":3356679,"parent":3300290,"text":"New York, NY Full Time<p>UX Designer @ Shapeways!\n<a href=\"http://www.shapeways.com/jobs/ux_designer\" rel=\"nofollow\">http://www.shapeways.com/jobs/ux_designer</a><p>Shapeways is a marketplace for 3D Printed stuff. We empower artists and designers to 3d print whatever they can dream up in silver, glass, plastic, and eventually any material/color they can dream of!<p>One of the cool things we're working on right now is a set of tools for people that know nothing about 3D Modeling to make awesome stuff on our site. Here's our NYTM presentation of our new Sake Set creator: <a href=\"http://new.livestream.com/channels/283/videos/42956\" rel=\"nofollow\">http://new.livestream.com/channels/283/videos/42956</a><p>We're small and need a rad UX designer to take our site/platform/etc into the modern age.","time":1323965389,"type":"comment"},{"by":"_crazed","id":3302754,"parent":3300290,"text":"New York, NY. Full time. We're <a href=\"http://www.shutterstock.com\" rel=\"nofollow\">http://www.shutterstock.com</a> and looking for some talented \"webops\"/\"devops\" type people capable of scripting and are focused on systems automation. We've got 360 nodes managed by puppet and mcollective. We've got the ability for developers to deploy at any time. We've got real time application stats provided by a zeromq backend and node.js frontend. We're looking to build out additional datacenters and automation tools for the future and could use some more rockstars on our team :)<p><a href=\"http://hire.jobvite.com/Jobvite/Job.aspx?b=nxNm8hwA&#38;o=34&#38;j=o1z3Vfwi\" rel=\"nofollow\">http://hire.jobvite.com/Jobvite/Job.aspx?b=nxNm8hwA&#38;o=34...</a>","time":1322801689,"type":"comment"},{"deleted":true,"id":3301011,"parent":3300290,"time":1322766965,"type":"comment"},{"by":"lcm133","id":3300645,"parent":3300290,"text":"Washington DC Metro FULLTIME <a href=\"http://www.sawbuck.com/about/jobs\" rel=\"nofollow\">http://www.sawbuck.com/about/jobs</a><p>VC-backed and thriving real estate website Sawbuck.com is seeking an Engineer with c#, xml, sql experience.<p>If you are interested, email me directly lmintzer at sawbuck dot com","time":1322762079,"type":"comment"},{"by":"puppetrecruiter","id":3305417,"parent":3300290,"text":"Puppet Labs \nwww.puppetlabs.com/jobs<p>Puppet Labs, provider of IT automation software for system administrators, is growing!<p>* Professional Services Engineers (SysAdmin or DevOps background, works with our clients, travel) in Portland, NY, and London<p>* Operations Engineers (SysAdmin or DevOps background, in-house position, no travel) in Portland, OR.<p>Also always open to Software Developers and Interns (apply via our Future Opportunities job posting) interested in joining our team.<p>Check out recent article on our VC funding!  <a href=\"http://www.datacenterknowledge.com/archives/2011/11/29/puppet-labs-raises-8-5m-from-tech-heavyweights/\" rel=\"nofollow\">http://www.datacenterknowledge.com/archives/2011/11/29/puppe...</a><p>Apply online or email aimee@puppetlabs.com if interested!  (Please no staffing agencies.)","time":1322855708,"type":"comment"},{"by":"justinbischoff","id":3300960,"parent":3300290,"text":"CiiNOW - Streaming Video Game Start-up - Mountain View, CA<p>We are a small well funded start-up with a unique patent protected technology advantage starting a gaming console in the cloud.  If you are thinking of joining a fast paced startup that will build end-to-end cross platform complex system, CiiNOW is just the right place. Multiple positions open in our Mountain View, California office:<p>1) Virtualization Engineers\n2) Video and Graphics Experts: H264, DirectX 9/11, OpenGL.\n3) Low Level C/C++ Windows and MacOS Hackers\n4) Set Top Box Developers with experience working with Service Providers\n5) Java/Javascript developers.\n6) GUI Designers: People with a passion for good website design.<p>Email contact: jobs@ciinow.com, justin.bischoff@ciinow.com","time":1322765998,"type":"comment"},{"by":"dkhenry","id":3300537,"parent":3300290,"text":"Newark, De (Close to Philadelphia, Pa )<p>SevOne<p>We are a Network Performance monitoring company that focuses on speed at scale. It actually really interesting work solving problems involving huge distributed data sets in ways most people don't deal with<p>Back End Developer - Mainly C , but also a good deal of PHP<p>Front End Developer - Mainly Javascript with a good deal of PHP.<p>We are still what I call a small company but we have grown over 500% since I started. The atmosphere is very much what you would find in a small start up and we have worked hard to keep that atmosphere as we have grown. full job descriptions are on <a href=\"http://www.sevone.com/company/careers\" rel=\"nofollow\">http://www.sevone.com/company/careers</a> or E-mail me at dkozlowski at sevone dot com","time":1322760690,"type":"comment"},{"by":"asanwal","id":3302025,"parent":3300290,"text":"New York city - CB Insights (full time and interns)<p>We're an NSF-backed DaaS company generating real revenue.<p>- Front-end web developer\n- Software engineer\n- Data journalist<p>Email - career@cbinsights.com<p>Job descriptions here - <a href=\"http://www.cbinsights.com/hiring/\" rel=\"nofollow\">http://www.cbinsights.com/hiring/</a>","time":1322783766,"type":"comment"},{"by":"bdickason","id":3302721,"parent":3300290,"text":"New York, NY - Shapeways\nHttp://Shapeways.com<p>We build an online service that helps regular people make awesome 3D printed stuff!! We're looking for engineers of all walks (frontend engineers, quality engineers, database engineers) to help us build an awesome 3D marketplace and the tools to build REAL stuff they can hold on their hands.<p>We are a small team of under 20 in NYC with a second office in Eindhoven, NL that currently handles our production. Our investors are USV and Index ventures.<p>Check out our demo from Tuesday at NYTM if you want to know more about what we do: <a href=\"http://new.livestream.com/channels/283/videos/42956\" rel=\"nofollow\">http://new.livestream.com/channels/283/videos/42956</a>","time":1322800653,"type":"comment"},{"by":"stratler","id":3302134,"parent":3300290,"text":"EZofferZ<p>TECHNICAL CO-FOUNDER\n(LA / SoCal)<p>I just launched EZofferz.com a couple weeks ago and am looking for a Technical Cofounder with graphics and web development skills. EZ Offerz is the first site that lets people make an offer on a home without a real estate agent – think of it as the natural extension of Zillow, Trulia, and RedFin.<p>After a ton of successful meetings with some of the biggest VC’s and Angel Investors in Los Angeles, all who love the business model without exception, the feedback has been consistent, “Get yourself a technical cofounder and we will invest!”<p>If you are interested, please don’t be shy…email me! I will outline the revenue model and “pain of the consumer.”<p>Jason Kutasi \njkutasi@ezofferz.com","time":1322786125,"type":"comment"},{"by":"bps4484","id":3300753,"parent":3300290,"text":"American Efficient\nSan Mateo, CA<p>American Efficient is a well-funded startup in the clean energy sector.  We're working on changing the way consumers and business owners buy products by incentivizing energy efficient choices.<p>We're currently looking for both front and back end engineers:<p><a href=\"http://www.americanefficient.com/ae/jobs/?c=frontend\" rel=\"nofollow\">http://www.americanefficient.com/ae/jobs/?c=frontend</a><p><a href=\"http://www.americanefficient.com/ae/jobs/?c=backend\" rel=\"nofollow\">http://www.americanefficient.com/ae/jobs/?c=backend</a><p>If you’re really smart, love to build stuff, and want to work on something that will, in a very real, non-cliche kind of way, make the world a better place, you should apply!","time":1322763447,"type":"comment"},{"by":"apwenchel","id":3300918,"parent":3300290,"text":"EverFi<p>Fulltime, Washington, DC<p>Ruby on Rails Baller, Shot Caller<p>Are you a baller Rails programmer? Love to help kids get ahead in life?<p>EverFi is accepting applications from Ruby on Rails developers who love making great products and bringing critical thinking to real challenges. We work with the largest school districts in the US to make a real difference in their students' success.<p>We offer the chance to work on a great team in a sweet office doing something you can feel good about. Our new office is located in Georgetown 4 blocks from the metro. We have great revenue traction and are backed by heavy hitters like NEA, Eric Schmidt of Google, Michael Chasen of Blackboard and Allen &#38; Co.<p>emails to engineering-jobs@everfi.com","time":1322765386,"type":"comment"},{"by":"jordanlewis","id":3301615,"parent":3300290,"text":"Knewton<p>New York, NY - Union Square<p>We're hiring software engineers, engineering managers, and data scientists with superior problem solving and coding skills.<p>Watch this video: <a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a><p>Knewton is an adaptive learning company that is fundamentally changing the practice of education.\nThis is a gig that comes with millions of users, meaningful machine learning (not ad optimization!), and interesting technical problems to solve.<p>Investors: Founders Fund, FirstMark Capital, Bessemer Venture Partners, Accel Partners, First Round Capital, and prominent angel investors.<p><a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a>","time":1322777343,"type":"comment"},{"by":"robeastham","id":3334240,"parent":3300290,"text":"LOCATION - Central London, UK<p>ROLE - Mid/Senior PHP developer with custom CMS experience...<p>We’re looking for an personable and creative mid-weight/senior web developer to undertake approximately 7-10 days freelance work. This will involve taking some static templates that have already been built using HTML, CSS and jQuery and creating a brand new custom CMS to support the site. The site and CMS will need to support multiple language and so experience with localisation is also  required. Ideally you would use Cake PHP to fulfil these requirements. Editing of the existing templates may be required and/or additional new templates may need to be built and so you will also have strong client-side development skills too. We are keen to get started on this ASAP and get the bulk of the work done before the Xmas break. We hope to choose someone after receiving CV's over the coming weekend (Sat 10th / Sun 11th Dec 2011). Initially you'll work on-site at our offices in Fleet Street but we would not be averse to a least few of the days being worked remotely.<p>REQUIREMENTS<p>•\tAt least 3 years experience in web development<p>•\tSignificant experience of PHP as well as CakePHP<p>•\tExperience architecting and planning web builds<p>•\tA great eye for detail, both visual, textual and in code<p>•\tEffective communicator<p>•\tHTML/CSS/Javascript/jQuery and SQL should be second nature to you<p>•\tIdeally you'll have a good understanding of Git<p>THE COMPANY<p>We’re a young fast growing digital agency based in the Fleet St area of London. There are currently 4 of us and we’re hoping to grow to 5 by the end of the year. We’re an easygoing bunch and we share our offices with a larger firm.<p>REMUNERATION<p>Day rate will be competivie and depend on the individual<p>HOW TO APPLY<p>If you’re interested please send an email to jobs.tinderfields@gmail.com along with a brief cover note containing some links to your work (including github profile) and attach your CV. Don't worry if you've just got lots of GitHub watches and not too many actual projects.","time":1323447535,"type":"comment"},{"by":"zukhan","id":3302056,"parent":3300290,"text":"Delphix - <a href=\"http://www.delphix.com\" rel=\"nofollow\">http://www.delphix.com</a><p>FULLTIME or INTERN.\nOffices in San Francisco, Boston, and Menlo Park.<p>Delphix is a data virtualization company that does for databases what VMware did for servers -  this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud.  We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience.  Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded?  Are you interested in working on the Data, the next big problem in Data Center?  Do you thrive on solving difficult technical challenges?  Do you take pride in writing beautiful code with a strong attention to detail?  Then we are looking for you!  Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between.  Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1322784269,"type":"comment"},{"by":"earthaid","id":3300456,"parent":3300290,"text":"MyEnergy - Boston, MA - FULL TIME: VP Eng, Data &#38; Rails Engineers<p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* a VP Engineering to lead us in tripling our team =&#62; <a href=\"https://www.myenergy.com/careers/vp_engineering\" rel=\"nofollow\">https://www.myenergy.com/careers/vp_engineering</a><p>* Rails Engineers to take ownership of new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Data Engineers &#38; Scientists to embark upon ambitious projects leveraging machine learning and AI =&#62; <a href=\"https://www.myenergy.com/careers/data_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/data_engineer</a><p>* and UI Designers to make the whole of the user experience astounding =&#62; <a href=\"https://www.myenergy.com/careers/ui_designer\" rel=\"nofollow\">https://www.myenergy.com/careers/ui_designer</a><p>We've just opened up our new HQ in a sunny two story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1322759815,"type":"comment"},{"by":"krumjahn","id":3302594,"parent":3300290,"text":"J Plus. Hong Kong. Full time/intern.<p>Ruby developer and designer.<p>Mobile apps for sports. Part of Cyberport's incubation program. Check us out <a href=\"http://www.jpluscorp.com\" rel=\"nofollow\">http://www.jpluscorp.com</a>.<p>If interested, email keith [at] jpluscorp.com","time":1322797563,"type":"comment"},{"by":"kevinburke","id":3302048,"parent":3300290,"text":"San Francisco, CA<p>Twilio is hiring. Want to call/text message your users, or build a product around phones? Instead of writing horrible interface code to text message or call users, people use Twilio's REST API to take care of the messages and get back to doing what they do best - building great web apps.<p>We are growing like crazy and hiring for lots of positions - see a full list here <a href=\"http://www.twilio.com/company/jobs\" rel=\"nofollow\">http://www.twilio.com/company/jobs</a>. Two good ways to get your resume to the top of the pile: build a Twilio app, and mention this HN post in your cover letter.","time":1322784072,"type":"comment"},{"by":"kitko","id":3300932,"parent":3300290,"text":"Wikia<p>FULL TIME in SAN FRANCISCO, CA<p>Sr. Front-End Engineer, Sr. Web Application Engineer (LAMP stack), Sr. Back-End Engineer (Search engine/large scaling).<p>A few highlights about Wikia: \n·We are among the top-50 sites in US and have 55mm global uniques per month. (<a href=\"http://www.quantcast.com/p-8bG6eLqkH6Avk\" rel=\"nofollow\">http://www.quantcast.com/p-8bG6eLqkH6Avk</a> .) \n.Jimmy Wales- Co-Founder of Wikipedia is the same Co-Founder at Wikia. \n·We contribute to and use open-source software. We are based on MediaWiki, the same software used to power Wikipedia, and we contribute to that project.<p>Please email Kit at wikia-inc dot com","time":1322765519,"type":"comment"},{"by":"phillockwood","id":3321165,"parent":3300290,"text":"Xtranormal is looking for full-time Senior Web Engineers to join our seasoned team at our San Francisco HQ (near BART). We're a consumer story-telling company.  We have a web-based app as well as desktop.<p>The candidate must be a strong individual contributor with lead potential, collaborative and takes pride in their work while delivering quality software on time. The candidate will report to the Director of Engineering and will participate in cross-functional projects.<p>Required Technical Skills:<p>HTML5\njQuery\nCSS\nPython or Ruby<p>Additional Helpful Skills:<p>iOS / Objective C\nFlash\nSql\nDjango\nUnix<p>Interested candidates please submit your resume to jobs@xtranormal.com.","time":1323207089,"type":"comment"},{"by":"relaunched","id":3301034,"parent":3300290,"text":"Santa Monica, CA<p>Venture-backed Parking In Motion is seeking Software Engineers / Python Programmers.<p>Send resume to jobs@parkinginmotion.com<p>Job Description<p>Are you interested in making magic using a massive brew of data, code, and creativity? Parking in Motion is looking for energetic, clever people to join our team who can pick up, take over, re-think, hand off, or own just about anything. The range of our systems require you to bring a broad set of skills as well as an eagerness to delve into uncharted territory without fear.  Python, Bash, GIS, AWS, PostGres, OCR, JSON, API, Obj. C, Java and looking for people to explore new technology to solve our complex problems.\nDesired Skills &#38; Experience<p>Requirements:\n3+ Years of production experience\n3 or more programming languages at an expert level\nIdeal candidate must have guru-level experience with 2 or more of:\nDatabases (PostgreSQL, MongoDB, etc)\nPython/Django + Frontend (MooTools, JS, CSS, HTML, etc)\nGrad-school level statistics (also: SAS, R, etc)\nMapping/Geospatial (GEOS, Mapserver/GeoServer,PostGIS,TIGER,etc)\nReliability and Quality (VM, HA, SCM/Build/CI/QA systems, etc)\nMobile Development (iPhone, Android, push notifications, etc)\nInformation Architecture/Visualization<p>Company Description<p>Parking In Motion (PIM) is the leading provider of dynamic and real time parking data, retaining deals with app developers, map makers, and GPS navigation companies. PIM's database is the largest of its kind, offering complete coverage of the US, Canada, and Europe with over 20,000 public parking lots enhanced with rates, hours, entrance points, and occupancy information.\tAdditionally, the database includes on-street meter and sign restrictions in the top 26 US markets.Building on its resources and relationships with operators and municipalities, Parking In Motion serves as an industry leader in providing accurate and instantaneous real time parking information to the world. With its assortment of tech-smart parking tools, PIM's innovative approach to parking makes it easier than ever for motorists to find the best possible place to park. By empowering drivers with intelligent information and an ever-expanding database, Parking In Motion aims to eliminate the stresses of parking once and for all.","time":1322767248,"type":"comment"},{"by":"stevewilhelm","id":3302783,"parent":3300290,"text":"Euclid Elements, Palo Alto, CA. Full time.<p><pre><code>  - Front End Web Developer\n  - Platform Engineer\n</code></pre>\nDetails at <a href=\"http://euclidelements.com/jobs\" rel=\"nofollow\">http://euclidelements.com/jobs</a>","time":1322802232,"type":"comment"},{"by":"iball","id":3300698,"parent":3300290,"text":"Rap Genius, NYC<p>FULL-TIME<p><a href=\"http://rapgenius.com\" rel=\"nofollow\">http://rapgenius.com</a> is a lyrics site with a twist – while you're reading a song's lyrics, you can click interesting or confusing lines to read explanations. anyone can sign up and contribute explanations. good explanations earn you \"Rap IQ\"<p>the eventual goal is to expand into other music genres and eventually take over the entire lyrics space. but the big vision goes beyond music and touches ALL OF TEXT.<p>email ilan@rapgenius.com if you're interested and have chops in any of these areas:<p>ruby on rails\njavascript and jquery\nios / android development","time":1322762739,"type":"comment"},{"by":"GavinB","id":3300956,"parent":3300290,"text":"New York, NY\nINTERN (paid)<p>Game art and game design interns, working on game series that tie in with our book publishing. We primarily work in Unity3D, as well as some flash.<p><a href=\"https://www.scholastic.apply2jobs.com/ProfExt/index.cfm?fuseaction=mExternal.showJob&#38;RID=8399&#38;CurrentPage=1\" rel=\"nofollow\">https://www.scholastic.apply2jobs.com/ProfExt/index.cfm?fuse...</a><p><a href=\"https://www.scholastic.apply2jobs.com/ProfExt/index.cfm?fuseaction=mExternal.showJob&#38;RID=8627&#38;CurrentPage=1\" rel=\"nofollow\">https://www.scholastic.apply2jobs.com/ProfExt/index.cfm?fuse...</a>","time":1322765900,"type":"comment"},{"by":"mea36","id":3301599,"parent":3300290,"text":"Remote or Philly<p>Looking for a Django dev with front end experience and a good intuition for UX to work on new features. You should be comfortable with Django, jQuery, CSS, HTML and all that good stuff.<p>We are a marketing service for businesses utilizing QR codes and smartphones. <a href=\"http://www.youtube.com/watch?v=I6c1GuZqNHs\" rel=\"nofollow\">http://www.youtube.com/watch?v=I6c1GuZqNHs</a><p>Ideally we'd like a passionate individual who is genuinely interested in our project.<p>Contact me at mel [at] coupedout [dot] com with your resume, github account and any other fun info you'd like to share.","time":1322777154,"type":"comment"},{"by":"masnick","id":3301123,"parent":3300290,"text":"Durham, NC - fulltime<p>Duke University, Center for Health Policy and Inequalities Research<p>We're a group of public health researchers looking for a junior software developer to work on the software that runs our research. This is a great opportunity for a developer with an interest in public health, including an interest in possibly traveling to international study sites.<p>More information (and contact info) at <a href=\"http://bit.ly/chpir-software-developer-job\" rel=\"nofollow\">http://bit.ly/chpir-software-developer-job</a>, or contact me directly from my profile.","time":1322768589,"type":"comment"},{"by":"bschaefer","id":3303311,"parent":3300290,"text":"Berlin, Germany, Full Time - HR New Media GmbH<p>We're an internet startup shaking up the HR industry in Germany (and eventually, the world!), and we're looking for:<p>* A front end developer<p>* A UI/UX designer<p>* Junior ruby developers<p>* Senior developers<p>Some of our technologies: ruby, backbone.js, jruby, mongodb<p>Some of our open source work: <a href=\"http://github.com/mongoid/mongoid\" rel=\"nofollow\">http://github.com/mongoid/mongoid</a>, <a href=\"https://github.com/bernerdschaefer/postscript\" rel=\"nofollow\">https://github.com/bernerdschaefer/postscript</a><p>I'm one of the lead devs -- drop me a line if you want to know more!<p>Email: bernerd.schaefer@1000jobboersen.de","time":1322817242,"type":"comment"},{"by":"nisse72","id":3301799,"parent":3300290,"text":"Auckland, New Zealand<p>Endace Technology Ltd - <a href=\"http://www.endace.com\" rel=\"nofollow\">http://www.endace.com</a><p>Software Engineer, fulltime<p>We build network appliances to do live packet capture and traffic analysis at up to 10Gbit/s and use a range of technologies to do so. We are currently looking for a senior developer with experience of C on embedded (but not resource constrained) Linux.<p>Full description here:\n<a href=\"http://www.endace.com/software-engineer-appliance-auckland.html\" rel=\"nofollow\">http://www.endace.com/software-engineer-appliance-auckland.h...</a>","time":1322780093,"type":"comment"},{"by":"ih","id":3300658,"parent":3300290,"text":"Los Altos, CA Full-time<p>Know Labs/Know It (<a href=\"http://www.knowit.com/\" rel=\"nofollow\">http://www.knowit.com/</a>) is a Silicon Valley-based startup looking to change the future of education by making it more accessible and less expensive. Our first class attracted 160,000 students in 190 countries and was translated into 40 languages. We're looking for great engineers who believe in improving education and want to have a big impact on both our platform and the world.<p>Get in touch with me at ih@knowlabs.com if you're interested.","time":1322762255,"type":"comment"},{"by":"amduser29","id":3300662,"parent":3300290,"text":"SF, CA.  Life360 (<a href=\"http://life360.com\" rel=\"nofollow\">http://life360.com</a>)<p>Come help us become the default place families go to stay safe and connected.  We are at the awesome stage where the company is small enough that everyone makes an impact, but we are building apps touched my millions of families.  We offer great pay, equity, and interesting problems to work on.<p>Looking for:\nAndroid / iOS / Geolocation Developers (<a href=\"http://life360.jobscore.com/list\" rel=\"nofollow\">http://life360.jobscore.com/list</a>)<p>Contact:\nalex@life360.com<p>Cheers.","time":1322762326,"type":"comment"},{"by":"housingbook","id":3302077,"parent":3300290,"text":"NYC Social Minded Startup looking for full-time ROR Developer in NYC or [Remote]:<p>We're looking to disrupt the housing industry and the idea of local in general. This idea could help millions of people.<p>Strong ability with custom search is a plus and abilities with gamification is major plus but not a must.<p>We're known to treat those we work with very well and developers comment on our preparedness and kindness.<p>Can't wait to see your work, check us out here:<p><a href=\"http://housingbook.com/blog/?page_id=211\" rel=\"nofollow\">http://housingbook.com/blog/?page_id=211</a>","time":1322784630,"type":"comment"},{"by":"kunalmodi","id":3302669,"parent":3300290,"text":"San Francisco, CA. Full Time and Intern.<p>Thirst Labs is an early stage start up focusing on understanding Social Updates (Tweets, Facebook statuses, etc.). We are looking for excellent (web/mobile/machine learinng/natural language processing) developers to join our team - as an extremely early employee, you will earn a competitive salary and real equity.<p>You can find more information at <a href=\"http://thirstlabs.com/about\" rel=\"nofollow\">http://thirstlabs.com/about</a>.<p>If you are interested, please email us at jobs@thirstlabs.com","time":1322799607,"type":"comment"},{"by":"beck5","id":3300583,"parent":3300290,"text":"7Digital - London UK<p>.NET, JavaScript &#38; Sys Admin<p>We provide digital download services to over 500 partners including Samsung, RIM (Blackberry), HP, Toshiba, Universal Music, EMI, Warner Music, Sony and have delivered millions of digital products in over 25 countries.<p>API serves around 160,000 requests per hour\n16+ million tracks\n2 days of innovation a month, regular Katas/Dojo's. We work in a S.O.L.I.D manor at a sustanable pace.<p><a href=\"http://about.7digital.net/Careers\" rel=\"nofollow\">http://about.7digital.net/Careers</a>","time":1322761283,"type":"comment"},{"by":"Matt_Mickiewicz","id":3301774,"parent":3300290,"text":"SitePoint in San Francisco is looking for a full-time Ad Ops person (send them my way, and get a free trip to Hawaii on me).<p>What You Get:<p>• A casual and flexible work environment<p>• Competitive Base, plus incentive package. Medical/Dental/Vision<p>• Generous vacation and paid holidays<p>• Shiny new MacBook Pro<p>What are you waiting for???  For immediate consideration, please submit your cover letter and resume to Juanita@sitepoint.com with Advertising Operations in the subject line. For additional information about Sitepoint, please visit www.sitepoint.com. EOE","time":1322779840,"type":"comment"},{"by":"drp","id":3300549,"parent":3300290,"text":"San Francisco, CA<p>HotPads - <a href=\"http://hotpads.com\" rel=\"nofollow\">http://hotpads.com</a><p>We're hiring software engineers, web user interface developers and interns to work in our office in the Mission District in San  Francisco.<p>HotPads is a small, lively company building and running an extremely popular map-based housing search engine that's used by millions of people each month.    See more here: <a href=\"http://hotpads.com/pages/jobs.htm\" rel=\"nofollow\">http://hotpads.com/pages/jobs.htm</a><p>dpeters@hotpads.com","time":1322760832,"type":"comment"},{"by":"martian","id":3300925,"parent":3300290,"text":"San Francisco, CA (SOMA)<p>Thumbtack - Marketplace for local services<p>Wrapping up a series A round and expanding rapidly. We're looking to build product and scale web/mobile applications. We're looking for front-end and back-end engineers, as well as interaction designers. If you can program for the modern web and are looking to change the world, this might be a good place for you. Bonus: we also have a phenomenal chef who cooks mouth-watering meals every day.<p>thumbtack.com/jobs or email me: chris at.","time":1322765476,"type":"comment"},{"by":"tedroden","id":3316013,"parent":3300290,"text":"New York City - Full Time (onsite)<p>Fancy Hands is a personal assistant service. We've had a lot of good press, we're growing and we need some help.<p>Specific details: <a href=\"http://www.fancyhands.com/jobs\" rel=\"nofollow\">http://www.fancyhands.com/jobs</a><p>We're looking for:<p>- Python developers (we're on App Engine, but if you know python enough, it's no trouble)\n - Front End Programmers  \n - Designers<p>Fancy Hands is a small, profitable company trying to change the way people work. We'll won't call you a guru, ninja, or rockstar.","time":1323113075,"type":"comment"},{"by":"arn","id":3302256,"kids":[3302646],"parent":3300290,"text":"Richmond, VA. Full time PHP/MySQL programmer for MacRumors.com and related projects. Must be in the local area.<p>Not sure how many richmonders are on hn but we'd love to hear from you.<p>arn@normalkid.com","time":1322788738,"type":"comment"},{"by":"mushmoosh","id":3304564,"parent":3300290,"text":"NYC. Full Time.<p>If you want to work in a fun environment full of intelligent and hard working individuals, then please check out Conductor!<p><a href=\"http://www.conductor.com/about/careers\" rel=\"nofollow\">http://www.conductor.com/about/careers</a><p>I moved here from Austin, TX (4 months ago) to join this company and absolutely adore it.<p>We are hiring Engineers (Java), Account Managers, and Account Executives (Sales).<p>Email me and I will make sure that the right individual reviews your resume:  mkayyal (at) conductor (dot) com.","time":1322844426,"type":"comment"},{"by":"gnubardt","id":3300975,"parent":3300290,"text":"Brightcove\n<a href=\"http://brightcove.com/careers\" rel=\"nofollow\">http://brightcove.com/careers</a>\nFulltime &#38; Intern \nin Cambridge, MA &#38; Seattle, WA<p>We're looking for Product Managers, a Director of Engineering and a QA Engineer.  Also for students for a Software Engineering Internship or coop next year.<p>We're the second largest source of video traffic on the internet and are rapidly growing, yet have managed to maintain a healthy base of nice &#38; smart people.","time":1322766300,"type":"comment"},{"by":"plnewman","id":3300725,"parent":3300290,"text":"Rearden Commerce in Foster City, CA<p>Two mid-career to senior level software engineering positions open in internal applications. We work in Python and whatever other technologies we choose, and take on projects involving deployment automation, test automation and devops-y stuff.<p>Please view my straight to the point job descriptions here: <a href=\"http://www.heyimhiring.com/\" rel=\"nofollow\">http://www.heyimhiring.com/</a>.<p>Feel free to contact with any questions: ptrk@reardencommerce.com.","time":1322763124,"type":"comment"},{"by":"Mc_Big_G","id":3316150,"parent":3300290,"text":"San Francisco, CA<p>VerticalResponse is hiring developers.<p>VR is an established and successful company. We work with Rails 3, javascript, git, jQuery, RSpec, backbone.js, HAML, SASS, TDD, pair programming, agile development and other leading technologies (you don't need to have experience with all of these). I've been working there as an engineer for almost a year now and really enjoy it.<p>Apply here: <a href=\"http://jobvite.com/m?3RB34fwj\" rel=\"nofollow\">http://jobvite.com/m?3RB34fwj</a>","time":1323114581,"type":"comment"},{"by":"mmattax","id":3301612,"parent":3300290,"text":"Indianapolis, IN. Full-time or Internship<p>Formstack (www.formstack.com) is an online form builder used in over 110 countries to collect and manage data. We're looking for passionate software developers to help roll-out features, fix bugs, and scale our infrastructure.<p>Get ready for the buzzwords: Linux, PHP, Python, MySQL, Memcached, Gearman<p>Interested? Lets chat.<p>Email: michael (at) formstack (dot) com\nTweet: @mmattax<p><a href=\"http://www.formstack.com/careers.html\" rel=\"nofollow\">http://www.formstack.com/careers.html</a>","time":1322777292,"type":"comment"},{"by":"pchristmann","id":3338413,"parent":3300290,"text":"iSeatz - New Orleans, LA<p>FULLTIME (willing to consider REMOTE)<p>Looking for Rails developers.  You will build and extend an industry leading ecommerce engine processing millions of transactions each day.  You will be expected to enhance the consumer shopping experiences by improving transactional performance and expanding our product offering by connecting with new supplier web services.  You will be expected to use your programming skills to design and implement web service APIs, implement test coverage in order to ensure the reliability and functionality of our services meet the exacting requirements of our customers.  Each day, you'll have the opportunity to work with developers on your team, business owners and qa analysts as you help to build this functionality in our Ruby on Rails technology stack.<p>We believe our developers deserve the best tools; we will provide you with top of the line laptops and the tools you desire to do your job.  You'll interact with, challenge, and be challenged by our team in an interactive development environment, with plenty of chances to bring your ideas to the senior leadership of our company.<p>If interested, please send resume or query to jobs at iseatz dot com","time":1323548871,"type":"comment"},{"deleted":true,"id":3302119,"parent":3300290,"time":1322785751,"type":"comment"},{"by":"chadhietala","id":3300695,"parent":3300290,"text":"Want (www.wanttt.com), Detroit<p>Want (www.wanttt.com) is looking for a designer to be involved in every aspect of product development. From developing application flows to visual design. As the product designer you will help re-imagine the way people discover and buy products.<p>More Info here:\n<a href=\"http://www.authenticjobs.com/jobs/10649/product-designer\" rel=\"nofollow\">http://www.authenticjobs.com/jobs/10649/product-designer</a>","time":1322762699,"type":"comment"},{"by":"sudonim","id":3301109,"parent":3300290,"text":"ChallengePost - New York, NY<p>Product / UX Designer\n<a href=\"http://jobsco.re/uSNTuZ\" rel=\"nofollow\">http://jobsco.re/uSNTuZ</a><p>ChallengePost is a web platform that connects talented problem solvers with rewarding challenges. Our clients include the Federal Government (Challenge.gov), First Lady Michelle Obama and the USDA, the City of New York (and the NYC BigApps challenge), Thomson Reuters, Samsung, the World Bank and more.","time":1322768377,"type":"comment"},{"by":"jack","id":3302761,"parent":3300290,"text":"Vancouver, BC. Full Time.<p><a href=\"http://www.goclio.com/\" rel=\"nofollow\">http://www.goclio.com/</a><p>Clio is a web-based practice management system targeted specifically at the needs of solo and small firm lawyers.<p>We're one of Vancouver's fastest-growing startups and are hiring developers (Ruby on Rails) and UI / UX Designers.<p><a href=\"http://www.goclio.com/about/career_opportunities/\" rel=\"nofollow\">http://www.goclio.com/about/career_opportunities/</a>","time":1322801814,"type":"comment"},{"by":"cliftonk","id":3302737,"parent":3300290,"text":"Dallas, TX - OrgSync -- Full time<p><a href=\"http://www.orgsync.com/careers\" rel=\"nofollow\">http://www.orgsync.com/careers</a><p>We're a Rails shop that boostrapped out of a house in Austin 4 years ago and have been growing explosively since we moved to an office in Dallas ~ 18 months ago.<p>We're looking for ruby, frontend (backbone.js), and iOS developers. The iOS post is not yet listed, email me for more information: clifton@orgsync.com.","time":1322801041,"type":"comment"},{"by":"codepoet","id":3300774,"parent":3300290,"text":"gateProtect, Hamburg, Germany\nFULLTIME, working permit required, only on-site<p><a href=\"http://gateprotect.com/en-GB/company/jobs.html\" rel=\"nofollow\">http://gateprotect.com/en-GB/company/jobs.html</a><p>gateProtect is a company providing security solutions focused on unified threat management (all-in-one firewalls).<p>Backend Software Engineer:\nHelp us write the control application of a network security device using Clojure. You are an excellent software developer and know many different paradigms from object oriented to functional and used your knowledge to create complex systems in many different languages like C++, Haskell or a Lisp dialect. Prior knowledge of Clojure is not required if you know another Lisp dialect. You also know the details of low lewel systems programming under Linux.<p>Backend Software Test Engineer:\nWrite automated tests that check if the production code is working using Python. A strong understanding of network protocols, related tools and Linux is more important than excellent programming skills.<p>Please contact job@gateprotect.de for more details and mention Hacker News.","time":1322763700,"type":"comment"},{"by":"lvella","id":3304959,"parent":3300290,"text":"San Francisco, CA Full time<p>The medical software industry is experiencing a revolution, and pMDsoft is looking for Software Developers who have the talent and drive to change it forever. You'll have a huge impact on health care in America by using cutting edge technology to change the way that physicians practice medicine.<p>We are small yet fast-growing and profitable company looking for Software Developers and Senior Software Developers to join our team.<p>A developer's career at pMDsoft is nothing like the stereotype of a programmer. In addition to brilliant engineering, it involves high-level decision making; interaction with customers who love using our product; involvement in sales, recruiting and other aspects of the business; and rapid career growth through real mentorship.<p>It's like a startup in that you'll wear many hats, have a lot of responsibility and be part of a small, highly-motivated team. It's not like a startup in that we make our own business decisions. We have a proven and profitable product, extremely happy customers and a team of people as talented as you are. We love what we do. We strive to work like a beautifully engineered German car: fast, efficient and fun<p>Your programming work will focus on extending our Java/JSP Web application, with an emphasis on open source technologies like Linux, Apache, Tomcat, Struts, AJAX/Web Services and MySQL. You'll have opportunities to work on sophisticated native apps for Android, iPhone, iPad, BlackBerry and possibly others.<p>You:\n-bring at least three years of focused, impactful experience as a Web and/or mobile developer... plus a lifetime of curiosity \n-Have intelligence, energy and integrity\n-want to grow your career quickly and start learning management skills\n-lead multiple high-priority projects simultaneously\n-design applications that are intuitive and fun to use\n-communicate fluidly in a team environment\n-find elegant solutions to complex business issues that don't -always involve writing code\n-aren't agoraphobic - travel is fun!<p>We:\n-never set foot in a cubicle farm\n-like to play with sleek machines named after fruits and robots\n-inhabit a historical building in beautiful San Francisco\n-love our work\n-prefer Mac and Linux to... other operating systems\n-prefer to work in person with a small, fast-paced team\n-always search for the next hot thing\n-stock beer, tea and snacks in the office<p>If interested, please send your resume to lvella@pmdsoft.com","time":1322849179,"type":"comment"},{"by":"mikebo","id":3300926,"parent":3300290,"text":"Seattle, WA<p>Familiar turns your computer into a social picture frame.  More at <a href=\"http://familiar.com/\" rel=\"nofollow\">http://familiar.com/</a><p>We're hiring software engineers who like building things.  We use a wide variety of technologies from CoffeeScript to C++, so lots of opportunity to learn something new.<p>If you're interested in hearing more about what we're up to, my e-mail is mike [at] familiar-inc.com","time":1322765477,"type":"comment"},{"by":"iampims","id":3301024,"parent":3300290,"text":"San Francisco, CA – Formspring 27M users, 4B responses, growing fast.<p>Looking for Front-end, Software and Systems engineers.<p>We’re having fun solving challenging problems.\nBuzzword dump: Cassandra, Riak, Kestrel, Thrift, AWS, mobile…<p>We’re in SOMA, and regularly hosting Meetups (Riak and Cassandra)<p>email: tim (a) formspring (dot) me<p>twitter: @pims<p>edit: full description here <a href=\"http://about.formspring.me/jobs\" rel=\"nofollow\">http://about.formspring.me/jobs</a>","time":1322767127,"type":"comment"},{"by":"AaronMell","id":3302695,"parent":3300290,"text":"Oklahoma City, Ok. Plano, Tx. Full Time.  We are <a href=\"http://alkamitech.com/about/careers\" rel=\"nofollow\">http://alkamitech.com/about/careers</a><p>We are trying to turn the financial services industry upside down. Most end user banking software is ugly, slow, and poorly designed. We are trying to change that.<p>We are looking for .Net/MVC developers, UI Developers, and a Senior QA Analyst","time":1322800171,"type":"comment"},{"by":"Stealx","id":3321367,"parent":3300290,"text":"Chicago, IL - Rockstar Front &#38; Backend Developer - TrainSignal<p>Want To Move to Chicago? Moving costs &#38; bonus! 10 year old company, 4 years in a row on Inc. 5000 list and profitable year over year!<p>Have front-end skills with backend experience? A variety of tools we use PHP/MySql, jQuery, HTML, CSS, nginx &#38; Apache.<p>Very highly competitive salary &#38; benefits.<p>Contact me at iman@trainsignal.com for more info","time":1323210108,"type":"comment"},{"by":"mattmiller","id":3300986,"parent":3300290,"text":"Carlsbad, CA<p>We are looking for big data engineers to join our team. We are a small team within a large company building a platform around the Hadoop ecosystem. The company Viasat is in an exciting place: <a href=\"http://www.viasat.com/viasat-1-launch\" rel=\"nofollow\">http://www.viasat.com/viasat-1-launch</a>.<p>If you want to learn more send me an email at matt.miller at viasat dot com.","time":1322766491,"type":"comment"},{"by":"otb","id":3312365,"parent":3300290,"text":"Qwiki<p>=====<p>We're looking for brilliant Front-end engineers and Interactive Developers to create the future of content creation and information experience on the Internet and mobile.<p>Tech stack: Rails, backbone.js, node.js, HTML5/CSS3, ActionScript for legacy support. Scala for backend services.<p><a href=\"http://www.qwiki.com/work-here\" rel=\"nofollow\">http://www.qwiki.com/work-here</a><p>email me (Owen) directly: o at qwiki dot com","time":1323044226,"type":"comment"},{"by":"maxaf","id":3300575,"parent":3300290,"text":"New York, NY<p>Novus - <a href=\"https://www.novus.com\" rel=\"nofollow\">https://www.novus.com</a><p>We're building a real-time financial analytics platform that will help revolutionize how the financial services industry treats and understands its data.<p>Our team uses Scala, MongoDB, Akka, and Unfiltered, but most of all we're proud of our talent.<p>E-mail me for more information: max@novus.com","time":1322761229,"type":"comment"},{"by":"mikek","id":3300484,"kids":[3301629],"parent":3300290,"text":"Mountain View, CA - Kiwi Crate (<a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>)<p>We're a well funded early stage kid-focused e-commerce startup.<p>We have open full time positions for a developer, a marketer, and an inventory specialist.  We're also looking for interns to help with operations and marketing.","time":1322760062,"type":"comment"},{"by":"nwilkens","id":3300547,"parent":3300290,"text":"Monroe, MI<p>MNX Solutions provides server management and consulting services to companies of all sizes.<p>We are looking to fill a few positions:<p>* Senior Linux System Administrator<p>* Senior SAP Basis Administrator (3 openings)<p>If you are in the Orlando FL area, we would be happy to consider this location as well.<p>For full details visit <a href=\"http://bit.ly/mnxdicejobs\" rel=\"nofollow\">http://bit.ly/mnxdicejobs</a>","time":1322760810,"type":"comment"},{"by":"smilliken","id":3302316,"parent":3300290,"text":"San Francisco, CA. Full time.<p>MixRank (YC S11) is crawling the web and indexing ads. We see everything: banners, text ads, placements, keywords, split tests, etc.<p>We're looking for smart engineers to solve big data problems with us.<p>Job post: <a href=\"http://news.ycombinator.com/item?id=3160100\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3160100</a><p>jobs@mixrank.com","time":1322790386,"type":"comment"},{"by":"dougb","id":3304293,"parent":3300290,"text":"Pittsburgh, PA  Full time.<p>MobileFusionInc.com is an 8 person startup looking for a \nfulltime local hardcore Javascript developer for\ndeveloping the front end to our browser based products.\nWe are in the electricity monitoring/management/purchasing business. If you're interested, email doug at the company name.","time":1322840497,"type":"comment"},{"by":"julifischer","id":3300763,"kids":[3300835],"parent":3300290,"text":"San Francisco, CA<p>AppDirect in downtown SF is hiring a Front End/UI Engineer, an Integration Engineer, QA Engineer and DevOps. We're making a huge impact on the SaaS industry for SMBs and Developers alike.<p>Check us out: <a href=\"http://www.appdirect.com/company-careers\" rel=\"nofollow\">http://www.appdirect.com/company-careers</a>","time":1322763621,"type":"comment"},{"by":"wdewind","id":3300388,"parent":3300290,"text":"New York NYC Brooklyn, Etsy.com\n<a href=\"http://www.etsy.com/careers/\" rel=\"nofollow\">http://www.etsy.com/careers/</a>\nTons of positions in Engineering, Product and more.  I am an Engineer there (as are a bunch of other HNers) it is awesome.  Contact info in profile if you have any questions.","time":1322758880,"type":"comment"},{"by":"bobhaigler","id":3302552,"kids":[3306761],"parent":3300290,"text":"San Francisco, CA<p>One Medical Group is hiring Rails engineers and a Front End/UI Engineer.  We're a small Rails team and looking to grow to match the recent expansion of our healthcare business.<p>Send mail to: bhaigler@1life.com\nand check us out at: <a href=\"http://onemedical.com\" rel=\"nofollow\">http://onemedical.com</a>","time":1322796487,"type":"comment"},{"by":"TedBlosser","id":3301978,"parent":3300290,"text":"Box<p>Palo Alto, Full Time.<p>We help businesses manage their content in the cloud - best place I've worked at so far!<p>Ton of openings, from engineering, to product, to sales: <a href=\"https://www.box.com/company/careers/job_openings/\" rel=\"nofollow\">https://www.box.com/company/careers/job_openings/</a><p>Contact me at ted@box.net if you're interested","time":1322783051,"type":"comment"},{"deleted":true,"id":3301594,"parent":3300290,"time":1322777136,"type":"comment"},{"by":"gambeht","id":3302415,"parent":3300290,"text":"REMOTE (San Francisco)<p>PlayCoMO - <a href=\"http://itunes.apple.com/us/app/pet-fair/id429367771?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/pet-fair/id429367771?mt=8</a><p>We're a fast growing mobile gaming company looking for talented people to join our team.<p>UI Engineer (C++)<p>User Acquisition Analyst<p>C++ Game Engineer<p>Data Analyst/Scientist<p>Server Engineer<p>Interns (all positions)<p>To apply, email: jobs [at] playcomo [dot] com","time":1322793251,"type":"comment"},{"by":"kgosser","id":3301711,"parent":3300290,"text":"HarQen<p>We're out of Milwaukee and are looking for a senior software engineer to join the team. Give us a shout if interested!<p><a href=\"http://harqen.com/company/careers/senior-software-engineer-20111201.php\" rel=\"nofollow\">http://harqen.com/company/careers/senior-software-engineer-2...</a>","time":1322778891,"type":"comment"},{"by":"danielpatricio","id":3300685,"parent":3300290,"text":"Pinpoint Social<p>FULLTIME - TORONTO\n<a href=\"http://pinpointsocial.com\" rel=\"nofollow\">http://pinpointsocial.com</a><p>PHP Developer with a dash of Javascript and MongoDB<p>We are working on making social media marketing as easy as email marketing.<p>We are passionate about simple and smart products - built with design in mind.","time":1322762543,"type":"comment"},{"by":"psota","id":3303449,"parent":3300290,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers -- UI/UX, frontend, backend data mining/algorithms.<p>See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1322821084,"type":"comment"},{"by":"elmomalmo","id":3303764,"parent":3300290,"text":"Cardiff, Wales, UK. Full time<p>Xumo (part of Specific Media/MySpace) is hiring TDD evangelists, JavaScript maniacs and clean code junkies to work on smart TV applications.<p>More information available upon request. Please email emalethan [at] xumo dot com","time":1322829599,"type":"comment"},{"by":"jpcody","id":3301598,"parent":3300290,"text":"Ruby Developer for AcademicWorks in Austin, TX<p>We're a small group that loves working together and running a business that's built to last.<p><a href=\"http://www.academicworks.com/rubyist.html\" rel=\"nofollow\">http://www.academicworks.com/rubyist.html</a>","time":1322777153,"type":"comment"},{"by":"kaiwencheng","id":3309049,"parent":3300290,"text":"Mountain View, CA &#38; Los Angeles, CA<p>* Hiring Developers &#38; Developer Interns (Mountain View, CA)<p>* Hiring Sales Professionals &#38; Sales Interns (Mountain View &#38; Los Angeles, CA)<p>* Apply via www.fivestarscard.com/jobs/.  Please indicate HN in subject line.","time":1322950445,"type":"comment"},{"by":"ratko","id":3345296,"parent":3300290,"text":"Toronto, ON, Canada. Full-time.<p>SiteScout is hiring a System Administrator (Linux)<p>More details: <a href=\"http://www.sitescout.com/about/system-administrator-linux/\" rel=\"nofollow\">http://www.sitescout.com/about/system-administrator-linux/</a>","time":1323728985,"type":"comment"},{"deleted":true,"id":3302633,"parent":3300290,"time":1322798853,"type":"comment"},{"by":"alexsolo","id":3300911,"parent":3300290,"text":"San Francisco, CA<p>PagerDuty - <a href=\"http://www.pagerduty.com\" rel=\"nofollow\">http://www.pagerduty.com</a><p>FULLTIME, INTERN<p>* Software Engineers: (<a href=\"http://www.pagerduty.com/jobs/engineering/software-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/software-engineer</a>)<p>* Front-end Engineers (<a href=\"http://www.pagerduty.com/jobs/engineering/frontend-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/frontend-engineer</a>)<p>* Software Engineering Intern<p>What we do:<p>At PagerDuty, we're building an alerting and incident tracking system that helps IT operations groups detect and respond to high-severity issues.<p>You know how there are thousands of monitoring systems out there? We don't do monitoring. Instead, we plug into all of the existing monitoring systems and handle the people part of the equation: alerting (via phone, SMS, email), on-call scheduling for teams, auto-escalation of critical alerts, and incident tracking.<p>Our current product helps IT ops people know about critical problems as quickly as possible, collaborate as a team to fix problems quickly, and help track and improve incident response performance over time. Our vision is to expand into the event management space. This means treating data from monitoring tools as events and intelligently filtering and correlating events across monitoring tools in order to reduce the noise. It's like spam filtering for events: a critical problem, such as a bad deploy, will automatically alert the entire team via phone call, while a minor issue like a server going down in a fleet of 20 will only generate a low-priority email alert.<p>Why you should work with us:<p>We are different than many startups out there: we charge money for a product. Companies love our product; that's a lot to say for a system that frequently wakes our users up in the middle of the night. Our revenue is growing steadily at more than 10% month-over-month since we launched in Jan 2010. Our customers include: Netflix, National Instruments, VMWare, NBC Universal, Square, Heroku, and 37 signals. We're also fairly early stage (11 people, pre-series A). This combination means you'll get a market-rate salary plus a decent chunk of stock in a company that has already figured out its business model.<p>We have very interesting technical challenges. Our biggest challenge is engineering a system that never ever goes down. Since our customers rely on us to deliver their critical alerts, we are not allowed to go down ever. This means we've had to engineer a distributed system across multiple data centers that can survive a single data-center outage without skipping a beat. We're not done: we have a lot more work to do to ensure our system reaches the level of telephony reliability (five-nines). If you like engineering distributed fault-tolerant systems, join us.<p>To apply, please send your resume to jobs@pagerduty.com.","time":1322765280,"type":"comment"},{"by":"purzelrakete","id":3301006,"parent":3300290,"text":"berlin and san francisco<p>soundcloud is hiring like crazy. check soundcloud.com/jobs if you want to work with an amazing team at an engineering driven company.<p>feel free to ask me anything – i'm rany@soundcloud.com.","time":1322766908,"type":"comment"},{"by":"mark_story","id":3302698,"parent":3300290,"text":"Toronto, On. Canada. Full time.<p>Freshbooks is hiring a Build Engineer, developers, and QA Analysts.<p><a href=\"http://www.freshbooks.com/careers/\" rel=\"nofollow\">http://www.freshbooks.com/careers/</a>","time":1322800261,"type":"comment"},{"by":"suhail","id":3301585,"parent":3300290,"text":"Mixpanel is hiring - <a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a><p>We're looking engineers who want to help build product and push our front-end.","time":1322777049,"type":"comment"},{"by":"sanj","id":3300836,"kids":[3301597],"parent":3300290,"text":"TripAdvisor: Newton, MA\nIntern &#38; Fulltime.  No remote, sorry.<p>Also drop me a line if you want to hear about the \"Hacking a Technical Interview\" class we're running.","time":1322764307,"type":"comment"},{"by":"bentoner","id":3302022,"parent":3300290,"text":"Melbourne, Australia<p>We're hiring INTERNs to do software development.<p><a href=\"http://contextualsystems.com/jobs/\" rel=\"nofollow\">http://contextualsystems.com/jobs/</a>","time":1322783730,"type":"comment"},{"by":"tomblomfield","id":3300854,"parent":3300290,"text":"London - VC-backed startup looking for great Ruby/Python devs.<p><a href=\"https://gocardless.com/jobs\" rel=\"nofollow\">https://gocardless.com/jobs</a>","time":1322764643,"type":"comment"},{"by":"thinkcomp","id":3300433,"parent":3300290,"text":"Think <a href=\"http://www.thinkcomputer.com\" rel=\"nofollow\">http://www.thinkcomputer.com</a> - Palo Alto<p>We're looking for JavaScript experts.<p>jobs@thinkcomputer.com","time":1322759507,"type":"comment"},{"by":"ThomPete","id":3300622,"parent":3300290,"text":"If you are a highly talented designer, 80/20 (<a href=\"http://www.8020.com\" rel=\"nofollow\">http://www.8020.com</a>) is hiring.","time":1322761843,"type":"comment"},{"by":"chrislorenz","id":3320551,"parent":3300290,"text":"Looking to join a future-forward technology company with a team full of brilliant, fun, talented people? At GraphEffect we know that choosing the right individual is what builds a great company. So far we have done just that and are looking for more passionate grade A players to join our team. We are shaking up the online ad industry by building a social campaign platform from the ground up. As an official Facebook Marketing API/Tools provider, our work is put in front of some of the most influential people in tech and the response has been great.<p>At GraphEffect we are constantly focused on creating the best user experience possible. To do this we need a rock solid and creative UX designer to help take our product to the next level. This individual needs to live and breathe UX and is extremely detail oriented. You must willing to take risks on ideas and iterate based off of feedback. We aren’t looking to reproduce what other ad tech companies are doing. Our goal is to disrupt the industry.<p>Responsibilites:<p>* Creating beautiful, intuitive and engaging user interfaces and interactions.<p>* Work closely with the Director of Product, Design &#38; Engineering teams to make your ideas a reality.<p>* Organize and standardize design patterns to keep the UI consistent and maintainable.<p>* Think outside the box, constantly come up with inventive ways to approach functional problems using your design skills.<p>* Deep understanding of the effect of online social interaction.<p>* Constantly learning and evolving your craft.<p>* Wireframing, mocking up and presenting your ideas in a cohesive manner.<p>Requirements:<p>* LOVE what you do!<p>* Be a team player, leave your ego at the door (while still  having confidence in your ideas)<p>* Superior Visual Design skills, from typography to shifting pixels.<p>* Compassion for the user, understanding where friction lies and how to design a better solution<p>* Constantly work on reaffirming your ideas by interacting with users and testing actual behavior.<p>* 4 years + Working experience in web &#38; app design.<p>Applications will only be considered if you include examples of past/current work. This job is for co-location only(We are located in Santa Monica, CA), no remote applicants please.<p>Please apply here: <a href=\"http://grapheffect.theresumator.com/apply/1H3w4y/Passionate-UX-Designer.html\" rel=\"nofollow\">http://grapheffect.theresumator.com/apply/1H3w4y/Passionate-...</a><p>Thanks!<p>Chris Lorenz\nDirector of Product\n<a href=\"http://grapheffect.com\" rel=\"nofollow\">http://grapheffect.com</a>","time":1323199058,"type":"comment"},{"by":"thehammer","id":3316585,"parent":3300290,"text":"Braintree - Chicago, IL<p>We're seeking exceptional developers.<p>If this job isn’t right for you, we’ll pay you $5,000 if you refer someone who is hired! Have them contact us or send us their contact information and we will do all of the leg work.*<p>We are growing our development team. Instead of including a list of requirements we want you to understand how we work. If our environment sounds like a place for you, then go to our ‘How to Apply’ section and follow the instructions.<p>How we work<p>We pair...<p>We pair program to write all of our software. We work on Mac Pros with two keyboards and two monitors. We work in an open team room; no cubicles or private offices. Communication is key to our process, and we don't want to hinder it with walls.<p>We test...<p>Testing is at the forefront of our development philosophy. We never need to check our code coverage to know that it's at 100%: with disciplined TDD, no line of code will be written without a test. We don't have a QA team. That might be terrifying when you consider the type of software that we're building, but we're confident that our automated testing is thorough and will catch any regression bugs. We use continuous integration to test every version of every client library against our gateway.<p>We are agile...<p>Agile development methodologies mean different things to different people. For us, the most important part of Agile is doing what works best for the team. We have a story card wall and release a few times a week. We keep the team in sync with daily standups and have a retrospective once a month to discuss things that are going well and opportunities for improvements. We’re pragmatic, not dogmatic. Although we have strong opinions, we're never afraid to try to new things to see if they work and reconsider our positions if the situation warrants it.<p>We are polyglots...<p>Although most of our software is written in Ruby, we don’t confine ourselves to a single programming language. We believe in using the best tool for the job while maintaining a slight bias toward the tools the team knows the best. We’ve written infrastructure components in Python, and we build client libraries for integrating with Braintree in Ruby, Python, Node.js, PHP, Java, and .NET.<p>We value our people...<p>We spend a whole day every two weeks working on whatever we’re interested in, regardless of whether it's relevant to the business. Some examples of the things people have chosen to work on include competing against each other to build a mesh chat client in node.js, contributing to open source projects, and discussing strategies for our Google AI challenge submissions.<p>Salaries are generous and compensation packages include 401k contributions, and ample vacation time.<p>Interested?<p>We're looking for people who are interested in getting in on the ground floor of an incredible opportunity to build amazing software and transform the payments industry.<p>Take a look at some of our blog posts to see some of the problems we face:\n<a href=\"http://www.braintreepayments.com/inside-braintree/how-we-built-the-software-that-processes-billions-in-payments\" rel=\"nofollow\">http://www.braintreepayments.com/inside-braintree/how-we-bui...</a><p>Take a look at some of the code we have on github: <a href=\"https://gihub.com/braintree\" rel=\"nofollow\">https://gihub.com/braintree</a><p>Think you’ve got something to contribute to our exceptional team? We’d like to hear from you!<p><i></i>NOTE: The referrer will receive this bonus only after the candidate is employed at Braintree for at least 60 days after his or her start date. The referrer must also complete and return a w-9 in order to receive the bonus. The referrer is responsible for paying taxes on the referral bonus. Also, to qualify for the referral bonus, the hired candidate must have accepted our offer of employment within two months of your referral.","time":1323120712,"type":"comment"},{"by":"200902","id":3304540,"parent":3300290,"text":"New York City - Full Time - Mid-Level Agile Developer (Rails)<p>Founded in 2003, Cyrus Innovation (www.cyrusinnovation.com) is a small (~40 people) NYC-based Agile development consulting firm. Cyrus believes that quality people, practices and code are the foundation of success, and pride ourselves on being named one of Inc. 5000's fastest growing companies for three consecutive years. We embrace the latest Agile practices, strive for continuous process improvement, and use the latest technologies (Rails, Scala, NoSQL, nodejs, MongoDB, HTML5, Groovy and more). We’ve spent nearly a decade helping enterprises and startups adopt Extreme Programming development practices by working side-by-side to achieve success. Our clients include: Saks Fifth Avenue, Boston Capital, NFL.com and Simon and Schuster. We are looking for creative individuals to join our community who value team work and strive to work with a company that values quality software as much as you.<p>What you’ll do:\n- Create useful solutions to real problems\n- Code in Rails\n- Seek out ways to continuously improve software \n- Test Driven Development, Pair Programming\n- Mentor junior team members and pair with seniors\n- Interact directly with clients and have a voice in critical design decisions\n- Collaborate on all stages of software development from design to implementation<p>What we’ll do for you:\n- No travel\n- A true 40 hour work week\n- Great benefits including health, dental, vision, and 401(k)\n- Compensation ranging from 86K - 101K\n- Bagel Fridays and a kitchen stocked with snacks and beer\n- Annual personal budget and time off for professional development (conferences, workshops, etc.)\n- An energized, yet causal work environment\n- Game nights\n- Hackfests<p>You will bring:\n- 3-5 years of professional experience\n- A true, demonstrable passion for coding, both in and out of the office\n- A team oriented work demeanor and a desire for both teaching and learning\n- The ability to adapt to various cultures and environments\n- A strong enthusiasm and knowledge for XP\n- The desire and ability to learn new technologies quickly\n- Knowledge of design patterns and refactoring\n- Strong understanding and experience working with Ruby on Rails<p>At Cyrus, we strive to continuously enhance our day-to-day methods that keep us at the top of our game and help everyone improve on what they already do so well. Because happy developers produce the best work, we do everything we can to find, hire and keep the most talented minds in our industry. Whether we are building web applications and products, introducing new technologies and development practices, or just helping a great team get their work done, our spirit of joyful collaboration inspires everything we touch. We are serious about our commitment to our employees and invite you to join our team.<p>If you are interested in learning more or would like to apply for a position, send an email with your resume and cover letter to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1322844147,"type":"comment"},{"by":"pabloest","id":3302356,"parent":3300290,"text":"San Francisco, CA and London, UK<p>Meraki - <a href=\"http://meraki.com\" rel=\"nofollow\">http://meraki.com</a><p>Meraki is the leader in cloud networking and we have over 18,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://meraki.com/customers\" rel=\"nofollow\">http://meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco - yes, it's sunny here!<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>We’re looking to hire in San Francisco and we have a few positions open in London as noted.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical operating data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services for all of those thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you will be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business; we are also growing quickly, with a proven model for our technology, so your work will reach many customers and have a huge impact.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://meraki.com/company/jobs#ui_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#ui_eng</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://meraki.com/company/jobs#bs_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#bs_eng</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://meraki.com/company/jobs#fw_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#fw_eng</a><p>* Hardware Program: passionate for research, product specs, engineering, project management, and manufacturing/quality (ME, EE or similar).\n<a href=\"http://meraki.com/company/jobs#hardware-program-engineer\" rel=\"nofollow\">http://meraki.com/company/jobs#hardware-program-engineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://meraki.com/company/jobs#product_mktg\" rel=\"nofollow\">http://meraki.com/company/jobs#product_mktg</a><p>* [London] Marketing Manager - Europe: excellent analytical and communication skills, creativity, and a passion for growing a business, with the ability to run a wide variety of campaigns and activities, from launching new demand generation campaigns, increasing partner productivity, promoting customer evangelism, and running advertising and branding campaigns.\n<a href=\"http://meraki.com/company/jobs#mktg_mgr_emea\" rel=\"nofollow\">http://meraki.com/company/jobs#mktg_mgr_emea</a><p>// Support<p>* [London and San Francisco] Inside Pre-Sales / Technical Support Engineering: sharp, energetic, and pre-sales and technical support engineer who can work closely with many groups within the company, including sales and product management, as well as with engineering to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://meraki.com/company/jobs#tech_support_eng\" rel=\"nofollow\">http://meraki.com/company/jobs#tech_support_eng</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, channel sales, sales engineers, and strategic sales. Our London office is also looking for sales representatives, with a focus on DACH and other areas within Europe, Africa, and Russia.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1322791347,"type":"comment"},{"by":"davidtspf01","id":3301652,"parent":3300290,"text":"Los Angeles, CA. Full time.<p>Software Engineer at ThinkNear<p>ThinkNear is an early stage start-up building solutions for location-aware mobile devices that are going to redefine how advertising works. One of our co-founders was a top-coder at Amazon, where he built a next generation customer targeting engine for Amazon’s credit card program, grew a highly-available payment service from 0-1&#60; million requests per hour, and then owned third party order management handling $10 billion annually.  The other has a top tier business background – experience building startups, formerly at Amazon, Harvard MBA, etc.  We’re funded by top tier VCs.  We have an alpha level product, but need to grow it into a true beta that can scale with the businesses massive growth.<p>We have built an incredible team of overachievers facing hard technical challenges and creating massive opportunity. We’re always looking for ambitious, driven self-starters who want to be on the leading edge of developing technology.<p>Check out our video at www.thinknear.com.<p>Role:<p>We are looking for a top tier software engineer or chronically under-recognized hacker. Along the top of your resume, you could list 30-odd acronyms from SQL to XML and back through the JVM a dozen times, but hate the idea that that’s what companies will evaluate you on. You don’t code, you craft. Your solutions are as elegant as they are simple. You love getting that perfect solution that takes only 4 lines of code instead of an ungodly 6.  At the same time, you can self-manage. When a critical deadline looms you can power through and deliver a reliable solution. You are the go-to guy (or girl) on whatever team you work.<p>Our ideal candidate will be ready to jump into an intense and high-growth start-up environment. You have experience building real products in the real world. We’re generally very focused on raw smarts and experience building awesome stuff.  However, sometimes you just really need in-house expertise. You are our leader when it comes to Gems, Ruby, and Rails. Technically when most people rank themselves from 1-10 on a language, they overestimate by at least 2-5 points -- you are legitimately an 8-9 in Ruby, preferably on Rails.  We are looking for someone capable of owning the whole stack of a project, from HTML/CSS/JQuery through to the database.<p>Final note: this job posting is for one of the first few engineers. You’ll be in a position to shape the direction of the code, the team, the product, and the company. We’re looking for people who are excited by that.<p>Responsibilities:<p>★ Design and code new features and enhancements across all our product offerings\n★ Participate in all aspects of a project life-cycle, from specifications through QA\n★ Collaborate on finding and fixing bugs and scalability/optimization issues<p>Requirements:<p>BS or MS in Computer Science or related field preferred\n2+ years experience building products for fast growing web products, 5+ years preferred; exceptional new grads considered.<p>Strong RoR experience.  Java or C++ also considered.\nExperience developing in Xnix (Mac counts if you use the command line a lot)<p>Comfortable in a small, intense and high-growth start-up environment<p>If you'd like to learn more please email careers at thinknear dot com.<p>Additional opportunities listed at <a href=\"http://careers.thinknear.com\" rel=\"nofollow\">http://careers.thinknear.com</a>","time":1322778113,"type":"comment"},{"by":"Tashtego","id":3301029,"kids":[3302388],"parent":3300290,"text":"Santa Clara, CA\nProgressive Solutions (www.printhq.com and www.frecklebox.com)<p>FULLTIME Software Engineer<p>We are solving hard problems in the worlds of manufacturing, e-commerce, and mass customization. Can you help? We need an on-site programmer (no telecommute) in Santa Clara, CA to work closely with our executive and customer service teams. Initial responsibilities would include supporting internal customers of our technology and helping partners integrate with our online ordering system. You'd report to the director of engineering (that's me!) and be employee #3 in our development group.<p>We are a fun and fast-moving company. We rely heavily on a mix of open source software and applications built on Microsoft's .Net platform, so if you enjoy integrating systems there will be lots of fun opportunities for you. Although we are a small company, we've got big ideas, and you'd get to be involved in some big projects like transforming our production workflow, implementing automated continuous testing, and transitioning to Agile development methodologies.<p>Initial projects you'd be working on include:\n* Assist customers in the use of our XML-based online ordering gateway- add new features, automate testing, update documentation, and troubleshoot\n* Develop extensions to our online document customization engine and e-commerce systems (C#, SQL Server)\n* Troubleshoot and improve our production management scripts (Python, Perl, MySQL)<p>What we're looking for:\n* Experience developing web applications with an object-oriented compiled language such as C# or Java and a framework such as ASP.Net or one of the Java frameworks (Struts, etc.). A little preference is given to people who already know Visual Studio, C#, etc. but good general coding skills are way more important to us than knowledge of a particular toolset.<p>* Experience with an interpreted scripting language such as Python, Ruby, or Perl<p>* Patience and excellent communication skills. You will often be in a troubleshooting role, and you will be helping stressed-out people who just want the software to work already.<p>Our company is growing fast, and the small size of our engineering team means you will get a lot of input as we grow. 10% time means you'll have a chance to work on personal projects that benefit the company or do the refactoring that's been bugging you for weeks. This is a great opportunity for someone who is looking to join a team that is run like a start-up without the long hours and risk. Benefits include health care and participation in our company-wide Ownership Thinking profit sharing plan.<p>Check out our websites at printhq.com and frecklebox.com, and send resumes and cover letters to jobs@printhq.com. If you've got a github profile with public repositories or some cool scripts on gist, you'll be on the top of our stack.","time":1322767215,"type":"comment"},{"by":"pitdesi","id":3300501,"parent":3300290,"text":"FeeFighters<p>INTERN OR FULLTIME<p>Rails Developers or Intern (Chicago or Remote) and a Marketing Intern (Chicago only)<p><a href=\"http://feefighters.com\" rel=\"nofollow\">http://feefighters.com</a><p>Looking for a Rails developer. We’re a startup working like mad to disrupt a multi-billion dollar financial industry and cut out tens of thousands of inefficient middle-men. Customers include Fog Creek/Stack Exchange, Photojojo, Weebly, Kickstarter, Make a Wish Foundation, tons of awesome startups, and even some public companies! And... we're just getting started.<p>We recently launched a new product called Samurai into public beta. (<a href=\"http://samurai.feefighters.com\" rel=\"nofollow\">http://samurai.feefighters.com</a>) It's an all-in-one all-in-one solution for taking payments online. It has come out of the gate swinging - there is a ton of pent-up demand to fix this industry and we're excited at how many people have been interested in our new product. We have a few more tricks up our sleeve and need developers to help build them out!<p>We have passionate users, awesome investors and partners, and products that our customers love. We pay ourselves decent salaries, are generous with equity and we enjoy a very fun and stimulating work environment. Much of the Samurai dev team was early on in another payments startup that grew to be a $2Billion company (including the CIO of that company). Here are bios of some folks that you'll be working with: <a href=\"https://samurai.feefighters.com/about\" rel=\"nofollow\">https://samurai.feefighters.com/about</a>\nWe're still finishing up our job description - but here's a start. <a href=\"http://feefighters.com/jobs/rails-ninja-developer/\" rel=\"nofollow\">http://feefighters.com/jobs/rails-ninja-developer/</a><p>Email josh at feefighters with your interest.<p>Also looking for a marketing intern to help us with social media and PR. Lots of fun stuff! <a href=\"http://feefighters.com/jobs/kickass-marketing-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-marketing-intern/</a>","time":1322760226,"type":"comment"},{"by":"ascendant","id":3300930,"parent":3300290,"text":"Cleveland, OH<p>Mobile Defense - www.mobiledefense.com<p>FULLTIME, INTERN<p>* Mobile Engineers\n* Front-end Engineers\n* Security Engineers<p>Mobile Defense is a rapidly growing mobile security software company based in the Midwest. We are looking for the following candidates to join our team: Rails Developers, Mobile Developers (Android and iOS), and Security Engineers. More info <a href=\"http://www.mobiledefense.com/careers/\" rel=\"nofollow\">http://www.mobiledefense.com/careers/</a><p>Our mobile threat management tools are safeguarding millions of users, we have secured partnerships with OEMs, mobile operators, and Fortune 500 companies. These partnerships have allowed us to remain focused on creating meaningful technology while solving challenging problems in mobile security. Our team is led by engineers, not MBAs. We are working hard to differentiate and provide real security solutions, not snake oil and FUD. If you are interested in being a part of our team, please send your resume to careers@mobiledefense.com","time":1322765507,"type":"comment"},{"by":"jonbischke","dead":true,"id":3301239,"parent":3300290,"text":"San Francisco, CA (SF/Mission)<p>RG Labs is hiring: <a href=\"http://www.rglabsinc.com/#jobs\" rel=\"nofollow\">http://www.rglabsinc.com/#jobs</a><p>We operate under the premise that the most important decisions we make are decisions about people (e.g., who to start a company with, who to hire, who to date/marry...) We also feel like the Web is in its infancy in terms of helping us to make better decisions based on data and that this space will explode in coming years.<p>We're planning to help detonate that explosion. :)<p>A few things about us:<p>- We have a long backlog of customers waiting to use our product when it launches and a big market in front of us.<p>- We're building an engineering-centric organization and working out of a cool work/live space in the Mission.<p>- We offer outstanding benefits, treat engineers and designers like the VIPs they are and value balance while at the same time working hard and passionately towards our goals.<p>- Our current stack includes Ruby, Rails, MySQL, Resque, and elasticsearch and we'll be diving in soon on Hadoop, graph databases/neo4j and a whole host of other fun stuff.<p>- We're also planning to contribute to open source as much as we can (e.g., <a href=\"https://github.com/rglabs/teleport\" rel=\"nofollow\">https://github.com/rglabs/teleport</a>).<p>- We're funded but also early in our lifecycle so it's a unique opportunity to be a major contributor and help to set the tone for the future for our company.<p>To hear more drop me a line directly at jon@rglabsinc.com or contact us via our website (<a href=\"http://www.rglabsinc.com\" rel=\"nofollow\">http://www.rglabsinc.com</a>). We'd love to tell you more.","time":1322770935,"type":"comment"},{"by":"jcs","dead":true,"id":3300439,"parent":3300290,"text":"London, UK - Rangespan<p><i></i>Job Description:<i></i><p>Rangespan is looking for python developers to join our growing team. As one of the first technical team-members, you’ll have broad and hands-on responsibility for design and development of extraordinarily scalable systems and web services for retailers and suppliers.<p><i></i>Requirements:<i></i><p>* BS or MS degree in Computer Science or equivalent<p>* Fluency with Python and Django<p>* Proficient with MongoDB and MySQL<p>* Demonstrated experience building a platform from scratch<p>* Experience with RESTful web services, Flask and fault-tolerant AWS architectures is ideal<p>* Experience with catalogue systems is a plus<p>* Experience with machine learning algorithms is a plus<p>* A knack for solving problems creatively<p>* An ability to attract additional world-class software developers<p><i></i>About Rangespan:<i></i><p>Founded by ex-Amazon executives and engineers, Rangespan is an ambitious e-commerce and supply chain software company making it easy for retailers to offer deep product selection. We're solving complex problems with large data sets, machine learning and natural language processing techniques.<p><i></i>Contact Info:<i></i><p>* <i></i>Contact:<i></i> Christian Ricci<p>* <i></i>Email:<i></i> chris@rangepan.com or jobs@rangespan.com<p>* <i></i>Web:<i></i> <a href=\"http://www.rangespan.com/jobs/\" rel=\"nofollow\">http://www.rangespan.com/jobs/</a><p>* <i></i>No contract or agency offers<i></i><p>* <i></i>No telecommuting<i></i>","time":1322759592,"type":"comment"},{"by":"leeny","dead":true,"id":3300688,"parent":3300290,"text":"San Francisco, CA<p>ClickTime (<a href=\"http://www.clicktime.com\" rel=\"nofollow\">http://www.clicktime.com</a>)<p>I've been an engineer at ClickTime for the past 4 years.  I am hard-pressed to condense all the reasons I love coming to work every day in just a few sentences, but here goes.  With only a few engineers, we've managed to create one of the most beautiful, durable, time tracking interfaces out there, and we've done it in a way that we're proud of.<p>And I get to work with an extremely talented, passionate group of people.<p>Come join us.  We're looking for a generalist who can work all across the board and a back-end engineer:<p><a href=\"http://www.clicktime.com/company/jobs-available/Web-Application-Developer\" rel=\"nofollow\">http://www.clicktime.com/company/jobs-available/Web-Applicat...</a><p><a href=\"http://www.clicktime.com/company/jobs-available/Web-Application-Developer-Back-end\" rel=\"nofollow\">http://www.clicktime.com/company/jobs-available/Web-Applicat...</a>","time":1322762572,"type":"comment"},{"by":"alonzosnook","dead":true,"id":3300950,"parent":3300290,"text":"UK - London -  Software Developer<p>We're looking to get some people in here at Revector.  We work with mobile phone operators and run distributed systems that test out their networks.  We have existing (profitable!) products and there are some new products on the drawing board as I speak, so this is a great time to join us.<p>There's plenty to get involved in: Hardware interfaces (VoIP, SMS etc); Intelligent scheduling; Data storage and processing; Front-end presentation.  We're very small, so you can get stuck in and make a big impression.<p>Experience with Python, Shell, MySQL and Redis would be great, but if you're good then you'll have no trouble picking these up.  The positions are listed as graduate ones, but we'd be really happy to hear from people with more experience.<p>The website has a load more info: <a href=\"http://www.revector.com/careers\" rel=\"nofollow\">http://www.revector.com/careers</a>","time":1322765850,"type":"comment"},{"by":"KoryFerbet","dead":true,"id":3300963,"parent":3300290,"text":"FULLTIME<p>Location: Seattle<p>Who we need:\n -Open Source Web Application Developers (ideally Ruby, Java, Python, or Perl)\n -iOS Developers\n -4+ years of professional development experience<p>What types of companies:\n-Mobile Call Analytics StartUp.\n-Social Networking/Ecommerce StartUp\n-Carrier Performance Analytic StartUp\n-Daily Deals StartUp\n-Mobile Cloud Synchronization StartUp\n-Web based target advertising StartUp<p>I have job descriptions that can be found for both the StartUps and more established companies at: <a href=\"http://www.bullhornreach.com/user/69443/jobs\" rel=\"nofollow\">http://www.bullhornreach.com/user/69443/jobs</a><p>But as most descriptions are just giant buzz word forms and overly generic elevator speeches I'd love to talk with you about them.<p>How to apply: either through the portal linked above or send a resume to Kory@imatch.com","time":1322766054,"type":"comment"},{"by":"arupchak","dead":true,"id":3302674,"parent":3300290,"text":"Amazon.com - Seattle WA - No remote, but willing to relocate based on experience. H1B is possible, again, depending on experience.<p>I am looking for a strong Systems Engineer for our growing team. We like to describe our organization as a Startup within Amazon, as our part of the business is still growing rapidly and our engineers can have a lot of influence on where the product goes. For this role in particular, I am looking for someone with a strong infrastructure/hardware bias to help us make the changes we need to scale our business over the next ten years without having to lift a finger. We are moving more and more of our applications and services to AWS technologies and we are looking for someone to help lead this initiative.<p>Job description below. Contact me at ${hn_username}@gmail.com if you have any questions.<p>The Amazon Marketplace team is looking for a great Systems Support Engineer to keep our systems running and our customers happy. You should be comfortable in a Linux environment, be able to automate everything you did yesterday, and willing to troubleshoot and solve new problems on a daily basis. Come join one of the fastest growing teams within Amazon.<p>Responsibilities:<p>-Maintain stability and performance of our systems via tickets during business hours oncall shifts<p>-Diagnose and troubleshoot new production issues that affect our customers<p>-Create and maintain standard operating procedure documents for new issues identified<p>-Automate operational tasks to assist with our scaling needs<p>Requirements:<p>-Proficiency in a scripting language (Ruby, Perl, Python, Shell)<p>-Familiar with SQL databases<p>-Comfortable navigating a Linux environment<p>-Basic understanding of web application architectures<p>Bonus points:<p>-Written a Rails application<p>-Deep knowledge of Oracle databases<p>-Troubleshooting experience<p>-Ticketing experience<p>-Worked with AWS EC2 or RDS","time":1322799700,"type":"comment"},{"by":"robeastham","dead":true,"id":3343636,"parent":3300290,"text":"LOCATION - Central London, UK<p>ROLE - Mid/Senior PHP developer with custom CMS experience...<p>We’re looking for an personable and creative mid-weight/senior web developer to undertake approximately 7-10 days freelance work. This will involve taking some static templates that have already been built using HTML, CSS and jQuery and creating a brand new custom CMS to support the site. The site and CMS will need to support multiple language and so experience with localisation is also  required. Ideally you would use Cake PHP to fulfil these requirements. Editing of the existing templates may be required and/or additional new templates may need to be built and so you will also have strong client-side development skills too. We are keen to get started on this ASAP and get the bulk of the work done before the Xmas break. We hope to choose someone after receiving CV's over the coming week. Initially you'll work on-site at our offices in Fleet Street but we would not be averse to a least few of the days being worked remotely.<p>REQUIREMENTS<p>•\tAt least 3 years experience in web development<p>•\tSignificant experience of PHP as well as CakePHP<p>•\tExperience architecting and planning web builds<p>•\tA great eye for detail, both visual, textual and in code<p>•\tEffective communicator<p>•\tHTML/CSS/Javascript/jQuery and SQL should be second nature to you<p>•\tIdeally you'll have a good understanding of Git<p>THE COMPANY<p>We’re a young fast growing digital agency based in the Fleet St area of London. There are currently 4 of us and we’re hoping to grow to 5 by the end of the year. We’re an easygoing bunch and we share our offices with a larger firm.<p>REMUNERATION<p>Day rate will be competivie and depend on the individual<p>HOW TO APPLY<p>If you’re interested please send an email to jobs.tinderfields@gmail.com along with a brief cover note containing some links to your work (including github profile) and attach your CV. Don't worry if you've just got lots of GitHub watches and not too many actual projects.","time":1323701007,"type":"comment"},{"by":"deam_roys","dead":true,"id":3302247,"parent":3300290,"text":"Los Angeles CA.<p>Full Time<p>Lead Java Engineer<p>Candidate needs to be strong coding in Java, multi-threading, search algorithm, and database administration.\nCompensation package is a $145k - $165k base salary + bonus(up to 25% of base) and full healthcare benefits.<p>We're one of the fastest growing on-line companies in LA and we're looking for a smart self-motivated individual to join our team.<p>If interested please email your resume to deam@roysandassoc.com or call 310-413-6601.","time":1322788492,"type":"comment"},{"by":"deam_roys","dead":true,"id":3302235,"parent":3300290,"text":"Los Angeles CA.<p>Full Time<p>Lead Java Engineer<p>Candidate needs to be strong coding in Java, multi-threading, search algorithm, and database administration.\nCompensation package is a $145k - $165k base salary + bonus(up to 25% of base) and full healthcare benefits.<p>We're one of the fastest growing on-line companies in LA and we're looking for a smart self-motivated individual to join our team.<p>If interested please email your resume to deam@roysandassoc.com or call 310-413-6601.","time":1322788289,"type":"comment"},{"by":"lamplighter","dead":true,"id":3302361,"parent":3300290,"text":"Uken Games in downtown Toronto<p>Uken is looking for talented developers to help us build mobile games in HTML5 and push what is possible in a browser.<p>We are a profitable startup (~25 employees) experiencing massive growth, with over 100,000 players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1322791537,"type":"comment"},{"dead":true,"deleted":true,"id":3300476,"parent":3300290,"time":1322759952,"type":"comment"},{"dead":true,"deleted":true,"id":3300489,"parent":3300290,"time":1322760087,"type":"comment"},{"by":"msales","dead":true,"id":3300567,"parent":3300290,"text":"Karlsruhe, Germany - mSALES GmbH - Ruby Developer<p>We're looking for a Ruby Developer (preferably on site, german speaking)<p><a href=\"http://www.msales.com/jobs/ruby-developer\" rel=\"nofollow\">http://www.msales.com/jobs/ruby-developer</a> (in German)<p><a href=\"http://goo.gl/DeBp1\" rel=\"nofollow\">http://goo.gl/DeBp1</a> (the above in English)","time":1322761106,"type":"comment"},{"by":"agentargo","dead":true,"id":3302367,"parent":3300290,"text":"Boulder, CO<p>Next Big Sound <a href=\"http://nextbigsound.com/jobs\" rel=\"nofollow\">http://nextbigsound.com/jobs</a><p>We build actionable intelligence for the music industry and looking to add to our engineering team.<p>-Front-end Engineer<p>-Software Engineer<p>-Infrastructure/Scalability Engineer<p>Come join us in beautiful Boulder Colorado!","time":1322791892,"type":"comment"},{"by":"jpcody","dead":true,"id":3301643,"parent":3300290,"text":"Ruby Developer for AcademicWorks in Austin, TX<p>We're a small group that loves working together and running a business that's built to last.<p><a href=\"http://www.academicworks.com/rubyist.html\" rel=\"nofollow\">http://www.academicworks.com/rubyist.html</a>","time":1322778010,"type":"comment"}]}