{"comments":[{"by":"JunkDNA","id":4186046,"parent":4184755,"text":"Philadelphia, PA<p>The Children's Hospital of Philadelphia<p>We're not technically a start-up, but our small group inside CHOP is striving to be a startup within a larger organization.<p>-----<p>We are seeking an experienced software development professional to join our small, highly focused, entrepreneurial R&#38;D application development group within the Center for Biomedical Informatics (CBMi) at The Children's Hospital of Philadelphia. As a member of our team, your technical expertise can have an immediate impact on patient care through our mission to accelerate pediatric research with novel applications and data solutions. Furthermore, your work here has the potential to impact the future of healthcare through our research into software solutions supporting genome-enabled personalized medicine. Our research mission fosters an environment where creativity and exploration of new technologies are promoted and encouraged. <p>Likely candidates should have solid experience and working knowledge in three or more programming languages (Python, JavaScript, or Scala experience is highly desirable) and be comfortable with one or more relational database platforms. <p>Our dynamic academic research environment demands an individual with exceptional written and oral communication skills who can rapidly translate requirements from a variety of disciplines into intuitive, high quality software solutions that support our strategic vision. <p>Candidates with prior experience in the biomedical field, especially using highly complex genomic data and/or data from electronic health records are very desirable. Participation in one or more public open source projects is an added bonus.<p>Full details and application here: <a href=\"http://bit.ly/cbmijob1\" rel=\"nofollow\">http://bit.ly/cbmijob1</a>","time":1341174972,"type":"comment"},{"by":"apaprocki","id":4184977,"kids":[4185127],"parent":4184755,"text":"New York / London - Bloomberg<p><a href=\"http://www.openbloomberg.com/jobs\" rel=\"nofollow\">http://www.openbloomberg.com/jobs</a>\n<a href=\"http://www.bloomberg.com/ux\" rel=\"nofollow\">http://www.bloomberg.com/ux</a><p>There are many jobs open at Bloomberg, but I'm particularly looking for intelligent software engineers and UX professionals to work under the CTO and Infrastructure team in R&#38;D. We do a huge variety of things and we like to run our teams with a startup results-driven feel.<p>We are primary consumers of billions of incoming pieces of data daily and redistribute it to over 180 countries on one of the largest private networks in the world, producing software which provides discovery, analytics, visualization and much more.<p>Contact me if you want to discuss at andrew@ishiboo.com.<p>If you want to chat in person, we are a sustaining sponsor of NYTM and are at all the meetups. I'll be at GothamJS and dotJS later this year. Also, Matt Turck @ Bloomberg Ventures runs the NY Data Business Meetup at our offices every month and I'm almost always there.","time":1341155835,"type":"comment"},{"by":"dget","id":4184859,"parent":4184755,"text":"New York, NY. Fulltime.<p>Lore re-imagined what a class should look like online. We give instructors and students amazingly designed tools to manage their courses – calendaring, file management – and we make it unbelievably easy to interact with one another.<p>Lore is looking for a super-sharp, ambitious engineer who’s able to work across the stack. We’re a passionate team building the world’s largest learning community. You’re a badass coder who loves understanding the whole stack, and jumps on anything – from simple CSS to API performance. Together we will make education more relevant, engaging, and accessible.<p>Everyone at Lore is an artist – from customer service to engineering to user interface design. Changing the way people learn is no small task. To make it happen we need the most creative, dedicated, and detail-minded people on the planet.<p>Lore is built primarily in Python (using Flask) and CoffeeScript. Along the way, we also use MySQL, Redis, node.js, SASS and Compass.<p>Building the best experience for learning opens up a number of interesting technical challenges — to make it immersive, you want see interactions as they happens, and not later.<p>As a note, we're also hiring growth product hackers and JavaScript engineers.<p>If you're interested, shoot us an email at tech-jobs@lore.com, with information about yourself, why you're interested, and links to any work/code you can show off.<p>You can also find more about us and our open positions on our jobs page (<a href=\"http://lore.com/jobs/\" rel=\"nofollow\">http://lore.com/jobs/</a>),","time":1341153958,"type":"comment"},{"by":"streeter","id":4185117,"parent":4184755,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we've made it simple for anyone to teach online. Teachers and students are loving our app and using it to share their knowledge with the world. We were part of the first cohort of Imagine K12 and are looking to grow the team.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineer (Python)\n    Lead Mobile Engineer (Objective C/Cocoa)\n    Lead Visual Designer\n    Technical Interns</code></pre>","time":1341158345,"type":"comment"},{"by":"jedberg","id":4184904,"kids":[4185197],"parent":4184755,"text":"Los Gatos, CA, Netflix<p>We have a ton of jobs open, but I'm particularly looking for Site Reliability Engineers.  After yesterday's Amazon outage, you can see we still have some work to do.<p>Looking for someone who can code who also has experience driving unix.  At the interview we ask you to code on the whiteboard and also tell us how to troubleshoot Linux.<p>Netflix is an awesome place to work with lots of smart people and top of market pay (and free movies!).<p><a href=\"http://jobs.netflix.com/jobsListing.html?id=oHxbWfw5\" rel=\"nofollow\">http://jobs.netflix.com/jobsListing.html?id=oHxbWfw5</a>","time":1341154791,"type":"comment"},{"by":"beaucronin","id":4184993,"parent":4184755,"text":"Prior Knowledge (SF), Full Time, Distributed Systems Developers and Machine Learning Experts<p>P(K) is a small team in downtown San Francisco pushing the frontiers of probabilistic machine learning to the masses. Our first product is Veritable, a predictive database. We like to think of it as a database for things you don't (yet) know.<p>We're passionate about discovering the hidden causes behind data, and are currently split pretty evenly between machine learning experts, scalable systems engineers, and people used to working with horribly messy, complex, and sparse data. We're backed by Peter Thiel's grou, Founders Fund, who share our commitment to long-term technical innovation.<p><a href=\"http://priorknowledge.com/join-us\" rel=\"nofollow\">http://priorknowledge.com/join-us</a> describes a bit more about what we're looking for, and you can always e-mail me (jonas@priorknowledge.com) for more info! Or swing by our offices at the intersection of 3rd and Market to meet the team.","time":1341156191,"type":"comment"},{"by":"wensing","id":4185500,"kids":[4185514,4220109,4220155],"parent":4184755,"text":"Austin, TX or remote - Stormpulse <a href=\"http://stormpulse.com\" rel=\"nofollow\">http://stormpulse.com</a><p>We are a profitable, bootstrapped company disrupting the $1 billion weather business with a unique, counter-intuitive product used by 6 million people last year.  Our clients include many of the world's largest companies--and the White House bunker.  More and more often I can drive down the road, point to a sign or a truck and say 'hey, they use Stormpulse!'.  It's fun.<p>We are designers.  We are independent.  Our mapping and weather data systems have been written from scratch.  We have a vision to take our product far beyond what anyone else has ever seen or imagined in the weather space, which effects every person on the planet.<p>Our platform is written in Python, JavaScript (jQuery, backbone, bootstrap), nginx, Postgres, PostGIS, Flash, haXe, MySQL on Amazon EC2 + S3.<p>We are Matt, Brad, Josh, and Bryan.  Come create with us: founders@stormpulse.com","time":1341164731,"type":"comment"},{"by":"mehuln","id":4184793,"parent":4184755,"text":"Palo Alto/San Francisco, CA, Full-Time,Interns (Summer &#38; Fall) : <a href=\"http://flutterapp.com\" rel=\"nofollow\">http://flutterapp.com</a><p>Flutter (<a href=\"http://flutterapp.com\" rel=\"nofollow\">http://flutterapp.com</a>) is looking for engineers &#38; designers interested in innovating, crafting, and solving very challenging problems.<p>We recognize gestures over the webcam, and our first app Flutter allows you to control iTunes &#38; Spotify using gesture.<p>Check it out on Mac App Store. We are looking for folks interested in computer vision, machine vision, using JavaScript to integrate gestures into browsers both computers and tablets.<p>Here's our link to iTunes Mac App Store page: <a href=\"http://itunes.apple.com/us/app/flutter/id522248613?mt=12\" rel=\"nofollow\">http://itunes.apple.com/us/app/flutter/id522248613?mt=12</a><p>JavaScript Engineer, Node.js, jQuery \nC or C++ Engineer \nPython Engineers\nEngineers with experience in Hadoop/MapReduce with Machine Learning and writing API &#38; SDK - \nGaming Engineer - Design and build gesture based games\nVisual Designers - this is a unique challenge to design UI for gestures based interaction world.<p>We are still a small team, so you will have opportunity to set direction of the company both eng/product wise. You will learn, you will be challenged, you will have to strain your brain, and in many cases, solve problems that seem impossible! I<p>If you're up for challenge than send an email to jobs [at] flutterapp.com.","time":1341152745,"type":"comment"},{"by":"avibryant","id":4185047,"parent":4184755,"text":"Etsy - Remote - Seller Economics<p>We're building tools to understand Etsy's marketplace and help Etsy's 800,000+ active sellers operate better, more efficient businesses. We need hackers who can learn enough economics to ask the right questions, enough about large-scale data analysis to find the answers, and enough about how our users think to present the answers to them in ways they'll understand.<p>Etsy has offices in Brooklyn, NY, but being remote is the default for this team. Contact me at avi@etsy.com if you want to talk.","time":1341157247,"type":"comment"},{"by":"phillmv","id":4185063,"kids":[4185620,4202528],"parent":4184755,"text":"META QUESTION,<p>How hard has it been for you to hire? Curious developer seeks more anecdotes to complement pet theories regarding current labour market.","time":1341157476,"type":"comment"},{"by":"rw","id":4185189,"parent":4184755,"text":"QLabs, New York, NY<p>Front-end developer<p>About us: QLabs is a tech incubator based in Noho, NY. We’re a small group of hackers who rapidly prototype new products every 10 weeks, then test them in the market for long-term potential. Our primary focus is the consumer web, though we experiment across a broad spectrum (e.g. hardware).<p>We have corporate backing, which means competitive salaries, corporate perks, and full benefits.<p>Our management structure is extremely flat: we succeed or fail as a team.<p>Our office is arguably the coolest place to work in New York: It's a 22,000 sq. exposed-brick loft, which we share with Codecademy, Turntable.fm and MoviePass.<p>We’re about to graduate our first product, Huntsy, and are proving an exciting new model for incubating startups.<p>----<p>About you: We are searching for a developer with front-end expertise to join our NYC team.<p>We are constantly vetting and integrating the latest technologies into our development stack, so you may be the person we’re looking for if:<p><pre><code>  You love building interfaces that are sexy, sleek and simple;\n  You have an opinion on backbone.js and/or ember.js*;\n  You’re familiar with CSS3, HTML5 and OO Javascript;\n  You're familiar with Ruby on Rails and/or have MVC experience. \n</code></pre>\nSend your resumé, your github and links to the project(s) you’ve built that you’re most proud of to jobs@qlabs.com<p>[*] Our current project uses ember.js for the entire frontend.","time":1341159652,"type":"comment"},{"by":"olivercameron","id":4185132,"parent":4184755,"text":"Everyme (YC S11) - Full Time - Menlo Park, CA<p>Ruby on Rails Engineer<p>We are looking for people who can work up and down the web stack and who can pick up new languages quickly. If you are a super smart generalist who can work on the servers one day and optimize complex algorithms the next, we want to hear from you. You will be our first non-founder web engineer and will work directly with the founders.<p>Ability to work from our Backbone.js front-end to our Ruby on Rails back-end is a must. Experience with server management and databases is a plus. Some days you will help keep the servers up and others you will be adjusting algorithms and designs that affect 100s of thousands of people.<p>We're currently a tiny team of 5, and have an open and friendly culture, where ideas are encouraged to be shared by everyone. Did I mention that we have a ping-pong table?<p>We're building something incredibly meaningful. Everyme is bringing together families, couples and best friends who otherwise wouldn't communicate. This isn't just another social network, but a significant mission to change how people share. Candidates will hopefully understand and have a passion for privacy, not to mention have an appetite for going up against Goliath.<p>We are well funded by top-tier VCs and angels, including Andreessen Horowitz, Greylock, CrunchFund, SV Angel and more. Come and join our small team of 5, which includes ex-Facebookers, ex-MySpacers, and successful iPhone and Android app developers. We offer market salary, generous equity and awesome perks!<p>To apply, please get in touch with me or email jobs@everyme.com! More roles open at <a href=\"http://everyme.com/jobs\" rel=\"nofollow\">http://everyme.com/jobs</a>","time":1341158592,"type":"comment"},{"by":"rickyyean","id":4187508,"parent":4184755,"text":"We are! We are hiring our first employee at Crowdbooster (YC S2010).<p>We've built the best way for businesses to get fast, actionable data about their social media accounts. Tens of thousands of businesses use us every day, including Fortune 500 companies, advertising agencies, coffee shops, sports teams, rappers, politicians, and more.<p>Some more things about us:<p>-We have a legit technical team including two Stanford engineers with backgrounds in machine learning, human-computer interaction, and databases.<p>-We believe in simplicity, minimalism, and creating things that are a joy to use.<p>-We're here to help businesses use social media to build real relationships, not spam, and we’ll never compromise on that.<p>-We're funded by some of the best early-stage investors in the valley, including SV Angel, Charles River Ventures, Y Combinator, and several early investors and employees of Facebook, Twitter, and Slide.<p>What we'd like to see from you:<p>-While your peers might describe you as a rockstar, the term embarrasses you. We love rockstars (many of them are Crowdbooster users!), but we've made a conscious decision to have a culture that revolves entirely around our product, not our egos.<p>-You've wrestled with big data before. Crowdbooster requires storing terabytes of data, extracting insights using statistical learning techniques, and making it available to our users in real-time.<p>-That said, you like working at every level of the stack, not being pigeonholed as a backend developer.<p>-You care a lot about the products you ship, and don't need a manager or \"product guy\" to motivate you to get every detail right.<p>-You're familiar with several parts of our stack, and willing to learn the rest. We use Python, Django, MySQL, Redis, Memcached, jQuery, Protovis, RabbitMQ, Celery, HAProxy, EC2, git, and more.<p>-You have projects of your own to show us. It doesn't matter whether it's an open source project, a startup idea, or just a really fun toy project. Just as long as you shipped it.<p>If this fits you, definitely email us at jobs@crowdbooster.com","time":1341207679,"type":"comment"},{"by":"asterix","id":4185404,"parent":4184755,"text":"Neo (www.MyNeoLoan.com) - Palo Alto, CA - Full Time - Ruby on Rails Developer<p>Neo provides affordable car loans to consumers new to credit, such as youth and recent immigrants, by assessing their credit risk based on real-time financial and social data as these individuals have not yet built up a credit score. (Yes, it is about time somebody tried this, and we have the chops to do so)<p>We are a team of three, with high profile advisors. We have seed funding from a top VC. Our beta product is ready. We are gearing up to launch our pilot loan program in coming days.<p>We are looking for a serious hacker to join our core team and help us execute our pilot loan program. This is an opportunity to get involved in a cutting edge consumer risk analytics project that aims to disrupt the US credit system. Plus, consumers are our customers, so the project also involves working on all the cool tools consumers expect these days (web, mobile, social, etc). As a very early member of our team, you will have direct input into many of the decisions that will affect the future of our company<p>Drop me a note at navin@MyNeoLoan.com if you are interested.","time":1341163231,"type":"comment"},{"by":"snowmaker","id":4185934,"parent":4184755,"text":"San Francisco, H1B, INTERN are welcome<p>Scribd (social publishing, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired TWO people from these \"Who is Hiring\" threads ... it really works!!<p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript<p>* iOS<p>* Machine Learning / Data mining kinds of problems<p>* Back-end problems: scalability, web crawling, analytics<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.<p>We're very well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>Looking for full-time and INTERN hires (junior year or older). H1B and relocation are no problem.\nSee more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1341172786,"type":"comment"},{"by":"eshvk","id":4185116,"parent":4184755,"text":"StumbleUpon, San Francisco, CA.<p>I have been working in the Applied Research team here @ StumbleUpon for the past 3 weeks and it has been a fun ride so far. They are hiring folks in three different areas (Search and Recommendation, Analytics and Applied Research). We are looking for folks who have been doing a lot of ML( recommendation systems, statistics), search and have experience scaling up (E.g. Hadoop). Refer : <a href=\"http://www.stumbleupon.com/jobs\" rel=\"nofollow\">http://www.stumbleupon.com/jobs</a> for more descriptive details.<p>Although we have been here for a while, we have been doing significant changes to our system which will be an exciting opportunity for some one to own and work on large scale machine learning projects. The company is profitable, has the usual goodies (nice salary, 401K match, gym, Uber/Commute reimbursement etc). Anyways, if any of this sounds interesting to you, email me @ eshvk@stumbleupon.com and I will answer any of your questions and help get you in touch with the right recruiters ASAP.","time":1341158330,"type":"comment"},{"by":"seldo","id":4185773,"kids":[4187854],"parent":4184755,"text":"San Francisco, CA. Full time. H1B okay.<p>With 50% of traffic now driven by social media, and referrer information increasingly useless with mobile clients and HTTPS, traditional web analytics are no longer working. awe.sm is building full-featured social media conversion tracking and analytics.<p>Right now and in the medium term, we're providing immediate value to our customers by giving them firm numbers on the ROI of their social media efforts, in terms of dollars, signups, pageviews or any other metric they pick. Our APIs allow app developers to easily integrate social features into their products and easily present the analyzed data back to their own customers, without having to build their own processing clusters and workflows.<p>Longer term, we want to know what's important on the Internet, and we believe that instrumenting social behaviour is the way to do that.<p>We're looking for back-end engineers who are interested in learning how to handle large volumes of data for aggregation, geo analysis, and graph analysis, in close to real time. Our stack is mostly PHP and Ruby right now (I know, I know) but we believe in picking the right tool for the job and are not afraid to use new tech.<p>We're also looking for front-end developers to continue to build out our GUI, which is a backbone JS app built on top of the same APIs our customers use.<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 13 people right now. We have a cool new office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1341169676,"type":"comment"},{"by":"sofuture","id":4185013,"parent":4184755,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas Networks (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future. Our stack in Python/Django/MySQL/Redis/a whole-lot-of JS/EC2 but we're generalists and looking for the same, so it doesn't matter what specific tools you've used before.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\". Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>Free lunch, flexible hours, one of the biggest arcades in Manhattan (3 cabinets!), competitive salary and benefits, take-what-you-want vacation.<p>More details and how to apply: <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1341156505,"type":"comment"},{"by":"tonydev","id":4184910,"parent":4184755,"text":"Boston, MA. Full Time.<p>Peddl - <a href=\"http://www.peddl.com\" rel=\"nofollow\">http://www.peddl.com</a><p>Jobs -  <a href=\"http://www.peddl.com/jobs\" rel=\"nofollow\">http://www.peddl.com/jobs</a><p>– About Peddl –<p>Peddl makes selling as easy as snapping a photo. With the push of a button, Peddl automatically prices and categorizes whatever it is you’re selling, creating an instant online storefront which accepts credit card payments. Peddl turns the mobile device into the most efficient tool for selling things to the people around you.<p>We’re a small team spun out of the MIT Media Lab set to change the way people think about buying and selling second hand goods online and we aren’t stopping until it’s done. Learn more about the founding team at <a href=\"http://www.terrarium.io\" rel=\"nofollow\">http://www.terrarium.io</a><p>– Current Positions –<p>Back End Engineer:<p>We’re building a next generation transaction platform which brings insanely simple payment to the masses. We care deeply about both external and internal craftsmanship of our products and look for candidates that do too.<p>Android Engineer:<p>We’re looking for a talented front-end engineer to help us create best in class mobile apps for Android and iOS. We care about every pixel and look for candidates that do too.<p>Growth Hacker:<p>We’re looking for an exceptional marketer with a high level of exposure to technology and experience with code. We believe that marketing, product, and engineering work together to make the product market itself.<p>Intern:<p>We are looking for a handful of super smart, passionate interns who have serious interest in local marketplaces. If you’re interested in app development, the mobile web, and have a sense for great design, Peddl has a spot for you.<p>–<p>More information and application instructions can be found at <a href=\"http://www.peddl.com/jobs\" rel=\"nofollow\">http://www.peddl.com/jobs</a>","time":1341154860,"type":"comment"},{"by":"midas","id":4184935,"parent":4184755,"text":"San Francisco, CA - priceonomics.com/jobs\nSoftware Engineer<p>Priceonomics is the price guide for everything. We're a team of four who are passionate about reinventing how people search, discover, and purchase products.<p>Crawling &#38; indexing millions of pages per day is not an easy task, but you're good at it. You enjoy optimizing systems, making them perform faster, and appreciate git commits where more code is removed than is added. Our backend stack currently consists of Postgres, Celery, Django, and ElasticSearch. We need to be able to handle billions of data points, and hope you can build something to that can do much more.<p>Small puzzle with instructions to apply:<p>DJkmoljtnJLtrJ91VTEyL29xMFO0nTymYPOyoJScoPOioJSlDUOlnJAyo25ioJywpl5wo20tq2y0nPO0nTHtp3IvnzIwqPOfnJ5yVPqvo29gVTxtq2yhWl4=","time":1341155310,"type":"comment"},{"by":"larrik","id":4185607,"kids":[4189173],"parent":4184755,"text":"Philadelphia area, PA<p>100% REMOTE positions! (Even local candidates)<p>JBS, Inc is looking for Python/Django developers for a full time position(s). Great salaries, great benefits, paid overtime (every hour over 40), and lots of interesting work. We work in small teams on each project, and there are always a number of projects going at once. Mobile experience (especially iOS) a plus!<p>Job is as a consultant, working for customer projects. (Don't worry, there is NO selling or generating hours by developers. You would be a full-time salaried employee.)<p>We are also looking for C#/.NET developers as well, which is a separate department.<p>If interested, please contact me (Donald) at dmorrone@jbecker.com","time":1341166479,"type":"comment"},{"by":"seanmccann","id":4185111,"parent":4184755,"text":"San Francisco<p>Freedom Freight<p>Rails Developer, iOS Developer<p>Freedom Freight is \"Uber for trucks\". We match shippers (businesses who need freight shipped to their customers by the truckload) with available trucks through live GPS data, similar to Uber's on-demand model of matching  consumers with cabs.<p>We're applying modern technology to an old school market. We're looking to bring Rails and iOS developers on the team. We're a small, flat company and this is a great opportunity to join a great team trying to conquer one of the largest markets in the US.<p>We're also looking for engineering interns.<p>If you think Freedom Freight would be the perfect fit, send an email with your info to sean@freedomfreightusa.com","time":1341158229,"type":"comment"},{"by":"noahbrier","id":4202447,"kids":[4202537],"parent":4184755,"text":"New York, NY. Full time.<p>Percolate is a tool that helps brands create content across social. What makes us unique is that we're the only platform that doesn't already assume a brand knows what to say. To help them figure that out we pull data from across the web and make recommendations on interesting content (whether their own or third-party) that might be interesting at any moment.<p>We're looking for backend and frontend engineers (we run backbone.js alongside our RESTful API) to join the team (the company is 16, product team is currently at 9). On the backend, we're especially interested in folks with good experience working with lots of data and excited to build real-time systems (we run python).<p>Here's a few reasons why you should come work here:\n- You are gonna work in SOHO on Broadway\n- Your chance to work with big data\n- You come in early: We're only-and-a-half a year old\n- As we get bigger, you will be able to focus on what you are good at\n- We are all different and we love it\n- GPL compliant company\n- You choose your workstation\n- You choose your tools\n- No worries, free your mind: NY salary + medical + dental\n- No vacation policy - does not mean no vacation ;)\n- Company invests in you: Fly to PyCon and other conferences\n- We prefer quality over quantity: Focus on clean code and test coverage\n- Your voice will be heard<p>More info at <a href=\"http://percolate.com/jobs\" rel=\"nofollow\">http://percolate.com/jobs</a>\nIf you're interested email us at jobs@percolate.com","time":1341483523,"type":"comment"},{"by":"briandear","id":4184947,"parent":4184755,"text":"NYC, H1B, US Citizen or Resident<p>Paperless Post<p>Front End Developer<p>We're looking for a creative, innovative front-end developer to architect and maintain paperlesspost.com, a site that over 10 million people interact with. Projects involve our main and mobile sites, and range from simple enhancements to weeks-long projects dedicated to completely new features. In this role you will get to work on a visually elegant site that puts a major emphasis and value on the front-end -- your work here will be noticed and appreciated.<p>Responsibilities:\nReceive all front-end tasks, including new projects, current site updates and changes, and bug fixes\nWork with the Product team on project specs, providing input on the overall interface of the existing site and new feature development\nReceive Illustrator files from Design team and slice images, if needed\nConvert design to readable HTML/CSS\nEnsure the site supports older browsers (IE6 and up only)\nCommit your code in the Git repo and hand off for implementation\nUse of CSS3 is encouraged, as the site does not need to look identical in all browsers<p>Requirements:\nProven good judgement when it comes to implementing design\nAbility to make reusable and fast CSS\nSolid knowledge of HTML, CSS, JavaScript, and Web Standards a must\nExperience using Adobe Photoshop and Fireworks\nHaml/Sass, jQuery, and Ruby knowledge a plus\nMac OS X experience a plus\nExcellent communicator and collaborator<p>To Apply:\nPlease send a resume and cover letter to brian@paperlesspost.com","time":1341155477,"type":"comment"},{"by":"briandear","id":4184934,"parent":4184755,"text":"NYC, H1B, US Citizen or resident<p>Paperless Post<p>DBA/Database Operations Engineer<p>We’re seeking a DBA/Database Operations Engineer who brings an operations perspective to database administration and a data perspective to scaling web operations. You love to write code that automates your data infrastructure (from bare metal/bare cloud to taking production traffic, at the \"push of a button\"). You modularize, reuse, and version control that code. You use the latest technologies, but still value uptime, performance, and stability. You follow best practices, but iterate over your projects quickly and smartly.<p>Responsibilities:\nProvision and optimize PostgreSQL infrastructure for rapidly growing consumer web application\nMaintain various staging and production PostgreSQL database instances\n“Infrastructure as code\"\nTroubleshoot production database issues<p>Requirements:\nDatabase administration (PostgreSQL, Redis, pgbouncer)\nLinux systems administration (CentOS, RHEL)\nConfiguration management (Chef, Puppet)\nMonitoring/availability (Nagios)\nTrending/metrics collection (Collectd, Statsd, Graphite)\nWeb/application serving (Apache, Nginx, HAproxy, Rails)\nContinuous integration/deployment (Jenkins, Capistrano)\nScripting (Bash, Ruby)\nVersion control (Git, Svn)\nNetwork administration (DNS, firewall, load-balancing)\nHosting (managed hosting, VMware, Amazon Web Services)<p>To Apply:\nPlease send your resume and cover letter to brian@paperlesspost.com","time":1341155308,"type":"comment"},{"by":"briandear","id":4184951,"kids":[4184972],"parent":4184755,"text":"NYC, H1B, US Citizen or Resident<p>Web Developer<p>We are seeking exceptional Web Developers to join several of our feature teams. This position is ideal for someone who knows Ruby, Rails, and jQuery. You will work with a small feature team on all parts of the development cycle, in many different areas of the code, and on constantly releasing features that millions of people use.<p>Responsibilities\nDevelop and implement new features written both in Ruby and JavaScript\nDevelop maintainable software through various methods, from peer reviews to writing automated tests\nLead and participate in code reviews\nCollaborate with the product, design, QA, and support teams to understand product requirements prior to implementation\nEnsure continuous high product quality through code testing, bug fixing, and feature changes based on consumer feedback<p>Qualifications\n2 years of experience developing in Ruby, Ruby on Rails, and JavaScript\nB.S. / B.A. in Computer Science or equivalent experience\nCreative with excellent problem solving and analytical skills\nPassion for product quality and attention to details\nExperience in and enthusiasm for working with a team of software developers\nAble to and enjoy learning new concepts in a quick time frame and apply them professionally<p>Our Stack:\nRuby and Ruby on Rails\njQuery &#38; Sammy.js\nGit\nPostgreSQL\nLots of bleeding edge tools and technologies: Redis, Node.js, Canvas<p>To apply for this position please send a resume to brian@paperlesspost.com with a brief cover letter included in the body of the email.","time":1341155523,"type":"comment"},{"by":"sashthebash","id":4185109,"parent":4184755,"text":"Berlin, Germany (\"H1B\") - StorageRoom - JavaScript<p>We’re building a cloud-based Content Management platform that’s targeted at developers. We just received funding from prestigious VCs (unannounced).<p>You say Content Management sucks? That’s exactly what we think, and we see a huge opportunity to do something completely different that plays well with HTML5/JS and native mobile apps.<p>The initial version of our platform is already used by hundreds of customers, from major global media companies to small development agencies.<p>It’s now time to throw away the prototype of our API and to build a high-performance solution, from scratch. We want to bring aboard a person who will develop the new JavaScript frontend, public JS SDK and JavaScript server component with us (yes, we’re developers too!).<p>We’re looking for someone who already has a solid experience in writing and testing JavaScript applications and that has a good knowledge of the JavaScript ecosystem (CoffeeScript, Node, Rhino, ClojureScript) and its frameworks (Backbone, Spine etc). You should have a good Computer Science foundation and an authentic interest in working with JavaScript. Experience in functional programming languages will be considered a plus. One of the main jobs besides developing will be to involve the JS community with talks at conferences and interesting prototypes.<p>Interested? Please send your GitHub account and any other interesting links about you to sascha@thriventures.com.<p>P.S.: The only language in the company is English and living in Berlin without any knowledge of German isn't a problem at all.","time":1341158205,"type":"comment"},{"by":"Hovertruck","id":4185216,"parent":4184755,"text":"Chartbeat is hiring in NYC (Meatpacking District). H1B possible.<p>We're a real-time analytics platform focused on providing data to the people on the front line (people who can take immediate action), rather than the analysts in the back office. Our stack is Python (django/tornado), C, MongoDB, and Google Closure for our JavaScript needs. Hiring engineers, designers, support, sales... Pretty much everything.<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1341160234,"type":"comment"},{"by":"zinxq","id":4185218,"parent":4184755,"text":"Refresh, Inc. - Palo Alto, CA - Full Time<p>Front and back-end software engineers<p><a href=\"http://www.refresh.io/jobs\" rel=\"nofollow\">http://www.refresh.io/jobs</a><p>Funded (Series A) start-up building first engineering team. Looking for Software Developers across the stack.\n<a href=\"http://www.refresh.io/jobs\" rel=\"nofollow\">http://www.refresh.io/jobs</a>\njobs@refresh.io\nYou're a crack-shot software engineer. Not necessarily because of where you went to school, but because simply put - you love this stuff. You know at least one mobile/web-related computer language cold. Whether it's Objective-C, Ruby, Java Javascript, or others - we're not too concerned about which one because no matter which one (or ones) we end up using, you'll not only be able to pick it up fast, you'll be excited about doing so.\nYou understand the latest technology. From NoSQL to Backbone to Node. You aren't technically religious and gain as much satisfaction in picking the right tool for the job as you do implementing it.\nYou've built stuff. Web sites. Mobile apps. Whatever. You can show us. You can't wait to show us. You're not only excited of what users can do with it, you're proud about how it's implemented and to a technical audience, and you can't wait to talk about it.\nAs part of the first engineering team, you're excited by the prospect of working with smart people. Because you're smart and you know it - and you know that working with other smart people simply makes you better (all the while making them better too). As a bonus, being part of this initial team gives you the opportunity to strongly affect future engineering hires - insuring the caliber of the team.\nYou live within commuting distance to Palo Alto, CA or are willing to relocate (paid).","time":1341160283,"type":"comment"},{"by":"akh","id":4186220,"parent":4184755,"text":"Edinburgh, UK. ShopForCloud's first employee.<p><i></i>* Quotes we love\n- \"In God we trust; all others must bring data.\" - W. Edwards Deming\n- \"Warning! Notice is given that any person found Pilfering, Stealing, Robbing, or Committing any code without first testing will be summarily hanged.\" - We have this as a big poster in our office<p><i></i>* What technology do we use?\nRuby, Rails, Twitter Bootstrap, jQuery, PostgreSQL, GitHub, Heroku, Amazon Web Services and many open-source codebases. Our simulation software is based on Ali's PhD research.<p><i></i>* Who are we looking for?\nWe are looking for smart Software Engineers who get things done. There's a tone of work to be done; you'll be core member of the engineering team and take part in daily 15-min status meetings. Ideally you should have:\n- Strong computer science fundamentals gained through a degree in computer science or equivalent\n- Experience in developing web applications, and can show us your personal/work projects\n- Experience with a scripting language (Ruby, Python, PHP)\n- Be comfortable developing for and on Linux environments\n- Experience with any of the following is a plus: API design (REST), relational databases, model-view-controller frameworks, and rich client-side applications (Backbone.js etc.)\n- Strong interpersonal and problem-solving skills, with excellent verbal and written communication skills<p><i></i>* What's the next step?\nSounds good? Email us at info@ShopForCloud.com and let's get talking. Feel free to include links to your LinkedIn, GitHub and any project websites.<p>More info here: <a href=\"http://www.shopforcloud.com/pages/recruitment.html\" rel=\"nofollow\">http://www.shopforcloud.com/pages/recruitment.html</a>","time":1341178054,"type":"comment"},{"by":"sameersegal","id":4185278,"parent":4184755,"text":"Artoo - Full Time / Freelance - Bangalore, India<p>HTML5 + Bootstrap | Android | Play! Framework<p>At Artoo we are building inclusive technology for low literate, low income base of the pyramid people. These are people who have never used MS Dos, Windows XP or even iOS. Our technology interfaces need to be completely reimagined and made higly interactive and intuitive. We are working on range of technologies: Android, CouchDB, Play! Framework, AWS, Nginx, etc<p>Recently we discovered the real power of Backbone.js when we built a chat module built into the browser using websockets. Ever since then we have gotten really really excited about Backbone.<p>We need you to revamp our product interfaces. We need your skills to understand how can we modify our WebApp to best leverage HTML5 &#38; Backbone make our technology highly interactive and make it work on really low connectivity (semi-urban and rural india). We then want to work on a few interesting projects that involve Augmented Reality and HTML5 Canvas - more details on this when you join!<p>We are a bootstrapped startup that is really excited about what the internet needs to be to work at the base of the pyramid and how it can become this. Read more on www.artoo.in.<p>If interested, please drop a line at sameer[at]artoo[dot]in","time":1341161274,"type":"comment"},{"by":"seanconaty","id":4186564,"parent":4184755,"text":"San Francisco, CA (full-time)<p>Hearsay Social is hiring for almost all positions. See more at <a href=\"http://hearsaysocial.com/careers/\" rel=\"nofollow\">http://hearsaysocial.com/careers/</a><p>Data Engineer\nGeneralist Software Engineer\nProduct Manager\nUI Engineer / Front End Developer\nUX/UI Software Engineer\nUser Experience/Interaction Designer\nVisual Interaction Designer\nWeb Infrastructure Engineer<p>We are a Django / Python shop so experience here is welcome but not required.<p>Hearsay Social an enterprise web application that helps companies like Farmers Insurance and 24 Hour Fitness manage thousands of Facebook, LinkedIn, Twitter and G+ accounts. These companies know that social is here to stay and that being local is more effective. With Hearsay Social they are able to let their employees go to town on social media in way that makes them feel comfortable and their employees successful.<p>We are located on beautiful Mission Creek in China Basin (close to AT&#38;T Park, Philz Coffee and the CalTrain station) in San Francisco. Perks include the usual start up fare: lunches, ping pong table, foosball, yoga, giant monitors, your choice of computer.<p><a href=\"http://hearsaysocial.com/careers/\" rel=\"nofollow\">http://hearsaysocial.com/careers/</a>","time":1341187130,"type":"comment"},{"by":"lnhaynes","id":4187256,"kids":[4187261],"parent":4184755,"text":"Chicago, IL. Full Time. Remote within Illinois\nLead Software Engineer - Ounce of Prevention Fund (Non Profit)<p>We're looking for a lead software developer to lead up development of our Head Start/Early Head Start web app - the trick is we have an ancient platform that we're looking to replatform, so our \"next generation\" platform has some flexibility around the actual technology but we're moving to a modern framework.<p>We're looking for someone that can help us create the new version - we're ripping out the guts of our old web app, replacing most of it with an off the shelf early childhood education app, and building new, user friendly goodness around it based on the needs of our org.\nWe want to work with cool, high performing people, that give a damn about society.<p>1. Work location can be somewhat flexible (potentially remote most of the time) - but it's easiest for use if they're based in Illinois somewhere.\n2. We have a 37.5 hour work week (and typically stick pretty close to that)\n3. Pay is competitive (non profit doesn't mean we work for free)\n4. This position reports to the CTO and has 2 direct reports, some experience with management of others is a plus","time":1341201813,"type":"comment"},{"by":"danwalmsley","id":4185371,"parent":4184755,"text":"NationBuilder - Full Time - Los Angeles (Downtown), CA<p>Ruby on Rails Engineer - <a href=\"http://dev.nationbuilder.com/jobs\" rel=\"nofollow\">http://dev.nationbuilder.com/jobs</a><p>(Ruby, Rails, MongoDB, PostgreSQL, Redis, Backbone.js, TDD, H1B)<p>NationBuilder is looking for web developers to join our team building the world's first online Community Organising System in downtown LA.<p>We are committed to excellence in engineering - we practice TDD/BDD, pairing, continuous integration/deployment and Scrum-style agile development. One of our favourite things to do is delete code. We're weird like that.<p>We move fast. Any developer can commit and have their code in production in under 20 minutes, including the test suite running. No bureaucracy, no branch-merging with code reviews, no scheduled downtime. Build a feature and get it into thousands of people's hands in under an hour.<p>We have a fun, creative, open culture that encourages free expression and diversity. You won't find brogrammers here, just great people doing their best work.<p>We're well-funded (Andreessen-Horowitz, Sean Parker, Chris Hughes and others) and we're looking to change the world.<p>Just a year after beta, we're already shaking up politics, the non-profit/advocacy sector, and enabling filmmakers and musicians to liberate themselves from old models of marketing and distribution.<p>This journey is just beginning, and an exciting road lies ahead. If you're interested in joining us, we'd love to talk to you.<p><a href=\"http://nationbuilder.com/jobs\" rel=\"nofollow\">http://nationbuilder.com/jobs</a><p><a href=\"http://dev.nationbuilder.com/jobs\" rel=\"nofollow\">http://dev.nationbuilder.com/jobs</a><p>Cheers,<p>Dan Walmsley\nVP of Engineering, NationBuilder","time":1341162691,"type":"comment"},{"by":"nikhilpandit","id":4186049,"parent":4184755,"text":"Grubwithus (YC W'11) - Venice, Los Angeles, CA - Full time (H1-B ok)<p>Grubwithus is built on Ruby on Rails and is looking for backend engineers to help us add new features and build a great experience for our users.<p>Challenges we face:<p>- making sure that we can provide a consistently good experience to our users<p>- building tools to reduce touch points between our operations team and restaurants so that we can scale using technology<p>- building a recommendation system to recommend meals / events to our users<p>- working on performance improvements to improve the speed of the web-app and reduce infrastructure costs<p>Requirements:<p>- strong experience with server-side programming (preferably in Ruby on Rails)<p>- example projects that demonstrate this ability<p>- strong background in Computer Science fundamentals<p>Additionally, experience with any or all of the following is a plus:<p>- jQuery / CSS<p>- building an API on a web-service<p>- integrating with APIs of existing social networks<p>- building recommendation systems<p>- building analytics tools to analyze data<p>If this sounds interesting to you, please apply here: <a href=\"http://grubwithus.theresumator.com/apply/7r1rjn/Developer-Backend.html\" rel=\"nofollow\">http://grubwithus.theresumator.com/apply/7r1rjn/Developer-Ba...</a>","time":1341174988,"type":"comment"},{"by":"maxaf","id":4184823,"parent":4184755,"text":"New York, NY (Midtown East) - full time. <a href=\"https://www.novus.com/careers.php\" rel=\"nofollow\">https://www.novus.com/careers.php</a><p>Novus is seeking generalist hackers to help us build the real-time financial analytics platform that helps institutional investors take better care of capital.<p>We're using Scala, Akka, MongoDB and a slew of other open source tech. Novus offers a productive and gratifying work environment that fosters learning &#38; collaboration, and promotes shipping often and doing the right thing as often as possible.<p>We give back to the community by means of our open source projects. Check out <a href=\"http://novus.github.com/nvd3/\" rel=\"nofollow\">http://novus.github.com/nvd3/</a> (beautiful SVG graphs) and <a href=\"http://novus.github.com/salat/\" rel=\"nofollow\">http://novus.github.com/salat/</a> (fast Scala-MongoDB serialization) for some of our internal libs that we've made available to everyone.<p>If you're interested in knowing more about us, shoot me an e-mail: max at novus dot com","time":1341153479,"type":"comment"},{"by":"smutticus","id":4184900,"parent":4184755,"text":"Do you like packets?<p>Extreme Networks is hiring experienced network engineers in Utrecht, The Netherlands.  We're looking for people that have experience troubleshooting internetworking issues with any vendor(Cisco, Juniper, etc).  UNIX/Linux experience is also welcome.  We're not all that particular on skillset we just want to hire smart, motivated technology generalists.<p>We are a networking equipment manufacturer that makes really fast and really dense ethernet switches.  We're not a startup, but we're also not a large company.  So individual contributors can still have an impact.<p>Our primary product is our custom OS based on Linux that runs on our entire product line.  Your job would primarily be as a customer facing test engineer reproducing and understanding bugs in this OS and associated hardware.  You would work mostly in a lab with packet generators and switches/routers where you would simulate different network conditions and try to make things break.<p>Message me if you're interested.","time":1341154736,"type":"comment"},{"by":"axiom","id":4185265,"parent":4184755,"text":"Toronto, Ontario<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>) is hiring for a few roles: mobile dev (iOS, Android), sysadmin/infrastructure developer (rabbitmq, selenium, fabric, ec2), general web developer (python, django, javascript, node.js.) We also hire interns so please feel free to apply for that as well (paid of course.)<p>We're a profitable (and valley VC funded) education startup that helps make class more engaging. We've got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>Our dev team is in Toronto but we've also got an office in San Francisco so if you're really good we would be open to having someone work from there. If you're not based in Canada or the US but are willing to relocate feel free to contact us, because we do cover relocation expenses and will help you manage the work permit process.<p>Send your resume/github account to mike at tophatmonocle dot com.","time":1341161046,"type":"comment"},{"by":"joeconyers","id":4188554,"parent":4184755,"text":"Soho, New York, NY<p>Songtrust, Full Time, Python / Django Engineer<p>---<p>Songtrust provides the easiest way for songwriters to get paid royalties from the US and abroad. Created by Downtown Music Publishing (Santigold, Mötley Crüe, Mos Def) – Songtrust was recently named a top music Startup by Billboard Magazine.<p>The Job<p>We’re looking for someone to join our small team as a full time backend developer, ideally with a passion for music. Songtrust is a technology driven business and we’re focused on bringing new ideas to an old and broken industry.<p>Some things we use:\nPython / Django, AWS(ec2) + Heroku(PostgreSQL) + Rightscale, Git, JIRA, and whatever works best.<p>We are looking for someone with a couple of years under their belt that has put at least one significant django project into production.<p>Full details here: <a href=\"http://blog.songtrust.com/jobs/python-engineer/\" rel=\"nofollow\">http://blog.songtrust.com/jobs/python-engineer/</a><p>To apply send a note to techjobs@songtrust.com with a link to your github, a resume, a web presence and/or a link to some of your projects.","time":1341232379,"type":"comment"},{"by":"trampey","id":4186077,"parent":4184755,"text":"Toronto, ON - Rails Developer, Full time<p>CommunityLend<p>Job Description<p>•\tBe the 3rd member of our development team\n•\tMake an impact as we build a 21st century loan management system\n•\tHelp us develop our brand new POS system and take on the credit card giants with a responsible alternative\n•\tExposure to all aspects of the business\n•\tSane working hours\n•\tGreat compensation<p>Skills and Requirements<p>•\tInterested in Ruby on Rails and other cutting edge technologies\n•\tVery good at what you do\n•\tNot afraid to think<p>About CommunityLend<p>•\tLocated in downtown Toronto\n•\tIn the 16 months since it launched, our product FinanceIt.ca has processed over 100MM in loans\n•\tWe don’t think like a traditional lender – and have utilized the latest trends in technology to build a simple platform which our customers love\n•\tOur success has gotten us funded recently – we are stable and growing\n•\tWe like to have fun – and hope you will too<p>To Apply: Please send your resume along with links to your previous work to devjobs [at] communitylend.com","time":1341175596,"type":"comment"},{"by":"ryen","id":4185322,"kids":[4187153],"parent":4184755,"text":"Coffee Meets Bagel - San Francisco, CA. Full time - Experienced Python/Django web developer Coffee Meets Bagel ( <a href=\"http://coffeemeetsbagel.com\" rel=\"nofollow\">http://coffeemeetsbagel.com</a> ) is a new innovative online dating startup making waves in New York and Boston and looking to expand to the west coast soon. We've recently been featured in TechCrunch, Glamour, BostInno, and several other major blogs and publications.<p>About the Job: We're looking for an experienced Python/Django web developer to join our early stage team as we scale our service in terms of geography and users, apply machine learning techniques to our algorithms, refine our revenue model, and continue to keep our customers happy. You will have an opportunity to work with and learn from a highly experienced technical advisor and great engineers. This is a market with huge opportunity and we will look to you for best practices around architecture, deployment and scaling the service to millions of people.<p>Requirements: - 2+ Years of Python development experience with some knowledge of Django or similar web frameworks. You will be able to contribute to our Django code base from Day 1. - A strong knowledge of the fundamentals of networking, operating systems, and security. - A Bachelors Degree in Computer Science or Computer Engineering or related discipline from a 4-year program. - Agile. Intelligent. Creative. Problem-solver. Startup lover. You like finding and working with outstanding engineers and want to help us build an awesome engineering team.<p>Bonus: - Experience building back-end systems on a high-traffic, low-latency web site. - Knowledge in Machine Learning/Graph Theory/Large-scale Data Analysis is a plus - Experience working with, and contributing to open source software projects is a plus—show us your github account or other online projects if available.<p>*Also looking for engineering interns, front-end developers, and marketing/PR intern. <a href=\"http://coffeemeetsbagel.com/jobs/\" rel=\"nofollow\">http://coffeemeetsbagel.com/jobs/</a>","time":1341161962,"type":"comment"},{"by":"brianmwang","id":4184906,"parent":4184755,"text":"New York, NY - Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>)<p>iOS Developer<p>Who We're Looking For<p>- Considerable experience building and shipping iOS apps.<p>- You are obsessed with delivering a great user experience.<p>- You work well with small, tight-knit teams.<p>- You prioritize strong communication above all else. A team that stays in sync is a team that gets shit done.<p>About Us<p>Fitocracy is a social network that empowers everyone to reach their next level of fitness. Nearly half a million people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We turn life into the ultimate RPG where you are the hero that levels up, beats quests, and finds the best version of yourself.<p>We aim to connect you to a community that provide the motivation, information, and inspiration needed necessary to \"re-wire\" people's brains so they make sustainable, impactful changes in their lives.<p>We are a small, 6-person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups and Eniac Ventures. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p>We put a lot of time into making sure our iPhone app was beautifully designed and fun to use. We've received thousands of rave reviews in 3 months and we aim to continue building the app into the best social fitness experience available. Download it here: <a href=\"http://itunes.apple.com/us/app/fitocracy-fitness-social-network/id509253726?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/fitocracy-fitness-social-netw...</a><p>Contact<p>Email me at brian@fitocracy.com","time":1341154830,"type":"comment"},{"by":"jsatok","id":4184851,"parent":4184755,"text":"Toronto, Canada - AppHero (<a href=\"http://apphero.com\" rel=\"nofollow\">http://apphero.com</a>)<p>AppHero is looking for engineers to join our team.<p>About you:<p>- Passionate about building disruptive products that solve big problems<p>- Excited by the opportunity to learn new things and question norms<p>- Self starter who enjoys thinking outside the box<p>- Entrepreneurial spirit and are interesting in taking an active role in growing AppHero<p>- Experience using Java to build applications<p>- Interested in working on the backend for web and mobile apps<p>About us:<p>- VC funded by top investors from Toronto and New York<p>- Building a product to help people discover the best apps by providing personalized recommendations<p>- Small team with diverse experience<p>- Work from a bright, modern, open concept office at Yonge and Eglinton in Toronto<p>Feel free to reach out if you're interested: jordan (at) apphero (dot) com<p>More info: <a href=\"http://apphero.com/careers\" rel=\"nofollow\">http://apphero.com/careers</a>","time":1341153812,"type":"comment"},{"by":"alexmic","id":4184913,"kids":[4185141],"parent":4184755,"text":"EDITD, London, UK<p>We are a fashion analytics startup. We help retailers, designers and merchandisers make concrete decisions based on data.<p>Some facts about our product:<p>- We track more than 2 million products across 100+ retailers every day.<p>- We perform color analysis and machine learning to extract information and categorize products correctly.<p>- We do sentiment analysis on millions of fashion-related tweets.<p>- Our web app is built in Backbone.js and our stack is Python, Django, Mongo and ElasticSearch.<p>We need smart hackers to work on product, analytics and data warehousing.<p>We have a nice bright office in Old Street, just off the \"Silicon Roundabout\", we were a Seedcamp 2010 winner and we are backed by great VCs in Europe.<p>All our vacancies are listed at <a href=\"http://editd.com/jobs\" rel=\"nofollow\">http://editd.com/jobs</a>.<p>Get in touch! :-)","time":1341154891,"type":"comment"},{"by":"witten","id":4185219,"parent":4184755,"text":"EnergySavvy - Seattle, WA<p>Back-end Software Engineer<p>EnergySavvy is a clean tech startup in Seattle. We're looking for excellent back-end developers interested in tackling challenging software design and implementation problems. We work with Python, Django, Mercurial, and PostgreSQL, and look for developers with experience or interest in learning these technologies.<p>Working at EnergySavvy means being part of a small team, working with really smart, talented people, and all the other benefits of working for a startup (free lunch and snacks, awesome location, etc). We also highly value work-life balance.<p>You can find our job openings here:<p><a href=\"http://www.energysavvy.com/jobs\" rel=\"nofollow\">http://www.energysavvy.com/jobs</a>","time":1341160285,"type":"comment"},{"by":"zehner","id":4185283,"parent":4184755,"text":"Startup in California\n6 Week contract - $15k + House + Food<p>We are looking for 2-3 Ruby/Rails developers to help finish a very interesting startup project focused on benefiting non-profit organizations. The project is on a tight deadline so we are looking to rent a house and get everyone together under 1 roof. There are a some complex algorithms and features to complete as well as prepping for launch. Location of the house will be flexible based on the developers that are chosen, although somewhere in California is preferred.<p>If you are interested in learning more, please email ruby [at] zehnergroup.com along with your resume and website, blog, or Github URL.","time":1341161360,"type":"comment"},{"by":"Aloisius","id":4185033,"parent":4184755,"text":"San Francisco, CA (Financial District) - SeatMe<p>SeatMe is hiring! We're a cozy 15 person restaurant reservation startup that is passionate about food in downtown San Francisco and we need your help! We're in search of:<p><pre><code>  * iOS developers (Objective-C for iPad and iPhone)\n</code></pre>\nWe offer a very competitive salary, benefits, moving costs, equity options, regular company dinners at restaurants around SF, catered lunches and an awesome friendly culture for all full-time employees.<p><a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a> or email jordan@seatme.com!","time":1341156970,"type":"comment"},{"by":"pubnub","id":4198288,"parent":4184755,"text":"San Francisco, CA<p>PubNub, Inc.<p>We're PubNub, the real-time engine in the cloud that developers use to build massively scalable real-time apps. We've got over 1,000 customers, and process billions of real-time messages each month. We are looking for an exceptional developer to help lead our \"core\" engine development and future technology strategy.<p>★ Enhance our platform and prepare us for trillions of monthly transactions\n ★ Design migration strategies that provide zero downtime for users\n ★ Help build the architecture that meets the needs of our product roadmap beyond our core current feature set\n ★ Explore various hardware &#38; software strategies for milking the best performance out of various system configurations\n ★ 5+ years of experience developing software on core technology frameworks in a high scale environment\n ★ Expertise with C, Javascript, Python, Erlang, and other programming languages\n ★ Real-time systems background, expertise with TCP/IP code stack and other kernel-level systems\n ★ B.S or M.S. in Computer Science... or not... and just impress us by nailing our programming challenge; good programmers don't need college and smart devs figured this out early.<p>Please check out our website <a href=\"http://www.pubnub.com/\" rel=\"nofollow\">http://www.pubnub.com/</a> and apply here: <a href=\"http://pubnub.jobscore.com/job_seeker/apply/load_resume?job_id=c5102iqJWr4zJ4eJe4bk1X\" rel=\"nofollow\">http://pubnub.jobscore.com/job_seeker/apply/load_resume?job_...</a>","time":1341389702,"type":"comment"},{"by":"squirrel","id":4185618,"parent":4184755,"text":"Notting Hill, London, England.<p>Our web application is at the heart of our busy e-commerce business; every day it serves millions of product images and handles thousands of purchases - but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, we have a mix of Linux, Windows, and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. We expect developers to be generalising specialists, ready at the drop of a hat to refine an algorithm, write a tricky integration test, tune a SQL query, or discuss feature nuances with a product manager. Our team is growing to five developers and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us.<p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homewares and lifestyle categories, many familiar from the high street. The company has about 65 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.","time":1341166702,"type":"comment"},{"by":"Instameet","id":4198115,"parent":4184755,"text":"Los Angeles, CA. Full time.<p>Instameet.com is a seed-funded web startup designed to enable people to connect live in video chats around common interests.<p>We're currently looking for a Full-Stack Developer to be tasked with creating the initial site - producing a true minimum viable product based on clear and validated concepts.<p>The ideal candidate will have recently attended a top Computer Science school or have several years of experience coding. You must have a good understanding of how startups operate, exceptional communication skills, strong critical-thinking, and be highly detail-oriented.<p>Compensation begins at up to $100,000 + Equity depending on experience but may be subject to increase with future rounds of financing and as your responsibilities increase. Likewise, this position may eventually transition into a technical leadership role and may be responsible for helping select and lead future technical hires.<p>Note: We are specifically looking for a Full-Stack developer who works with the latest technologies.\nFront-End: HTML5, CSS3, jQuery.\nProgramming Language: Preferably Node.js, Python (Django), or Ruby (Rails).\nDatabase: Preferably MySQL or NoSQL.<p>To apply visit <a href=\"http://www.startupers.com/jobs/instameet-inc/13911/funded-startup-seeks-first-developer\" rel=\"nofollow\">http://www.startupers.com/jobs/instameet-inc/13911/funded-st...</a>\nTo see our other positions visit <a href=\"http://angel.co/instameet\" rel=\"nofollow\">http://angel.co/instameet</a> and press Recruiting","time":1341386948,"type":"comment"},{"by":"smcguinness","id":4206071,"parent":4184755,"text":"Dallas / Ft Worth, TX (Frisco)<p>Call-Em-All (<a href=\"http://www.call-em-all.com/about/jobs.aspx\" rel=\"nofollow\">http://www.call-em-all.com/about/jobs.aspx</a>)<p>We are 12 strong looking to become 15. We are looking for a front-end developer, sys admin (devops) and relationship manager.<p>We are a .NET shop with some linux boxes running some services. We are open to all candidates. We have a great culture and are growing YoY. We just turned 7 too. This is a great environment to be innovative and to work how and on what you want.<p>Looking for local candidates only for now.","time":1341541372,"type":"comment"},{"by":"c0ldfusi0nz","id":4193608,"parent":4184755,"text":"Durham, NC (some remote positions available)<p>Bronto Software provides the leading marketing platform for online and multi-channel retailers to drive revenue through email, mobile and social campaigns. Over 1000 organizations including Party City, Timex, Armani Exchange, Dean &#38; Deluca, and Trek Bikes rely on Bronto to increase revenue through interactive marketing.<p>Some recent Bronto Awards and Accolades:<p><pre><code>    Bronto Software Voted Best Places to Work - 2010, 2011\n    NCTA Software Company of the Year - 2011\n    Customer Service of the Year - 2009, 2010\n    Inc. 5000 fastest growing companies - 2009, 2010, 2011\n    Triangle Business Journal Fast 50 - 2009, 2010, 2011\n    CODiE Finalist - Best Marketing Solution - 2011\n    Healthiest Companies - 2008, 2009, 2010, 2011 \n</code></pre>\nBuilding upon consistent growth since its founding in 2002, Bronto is now in the midst of a period of fast-paced growth as it expands its mission beyond email to become the leading platform for integrated email, mobile and social marketing.<p>We're seeking a number of Software Engineers:<p><pre><code>    * Java Engineer\n    * PHP Engineer\n    * MySQL Performance Engineer\n    * DevOps (production engineer)\n    * QA Manager\n    * Sales Engineer\n    * Systems Administrator\n    * Director of Custom Engineering (integration projects)\n    * Director of Software Development\n    * Vice President of Engineering\n</code></pre>\nMust be eligible to work in US without sponsorship. If you're interested and want to know more, please email me at jameson@bronto.com","time":1341315924,"type":"comment"},{"by":"calbear81","id":4185039,"parent":4184755,"text":"Mountain View, CA (Intern, H1B welcome) - Room 77\nSoftware Engineers, Mobile Devs (iOS, Android), SEM/Analytics Modeler\nSee complete list here: <a href=\"https://www.room77.com/jobs.html\" rel=\"nofollow\">https://www.room77.com/jobs.html</a><p>Room 77 is a VC-backed hotel search engine that aims to bring power and transparency back to consumer.  We're well funded ($10M+ round in 2011) and have a lean and mean team in downtown Mountain View with tech and business veterans from Google, Facebook, and other tech giants.<p>We're looking for software engineers that have no problem working the full stack front to back and don't have any specific language preferences.  We're looking to solve big problems in this space and have tons of interesting and challenging projects for you to work on.<p>Love building algos and driving massive amounts of traffic? We're looking for someone who wants to help lead our SEM traffic acquisition in-house and isn't afraid of huge keyword accounts and building systems to automate analysis and bidding.  We're fairly new at the automation thing so you will help lead the design and spec and even coding (if you can) of this system.<p>Valley-style benefits include free lunches/snacks, stock options, competitive salary, 401k, subsidized medical/dental, travel allowance ($1k per year), hotel discounts (travel agent card), and fun team outings year-round.<p>Questions? Contact roger@room77.com","time":1341157052,"type":"comment"},{"by":"emcienjobs","id":4218026,"parent":4184755,"text":"Atlanta, GA, Fulltime<p>Software Developer for Complex Web Applications (Atlanta)<p>Emcien develops four products wrapped around a patented pattern-detection algorithm. Using the basic concept of detecting nodes and arcs, these applications solve problems in manufacturing, retail, and law enforcement. This computation, plus big datasets, create some complicated problems. Our software engineering team takes algorithms from our research team and embeds them into Ruby on Rails web applications which are hosted on the Amazon Elastic Cloud.<p>We are looking for more developers to join our team. If you mastered the concepts behind web development and have experience dealing with the web stack, Emcien is willing to train you in Ruby on Rails. This position is an excellent opportunity for anyone who wants to make the transition from Java, .NET, Python, Php, or oCaml.<p>Since we are a small, delta-force team of developers, each team member dives into a variety of code. Although you do not have to be an expert in each of these areas, this position will expose you to CoffeeScript, MySql, Amazon RDS, SASS, HAML, Backbone.js, and several other technologies. This means that your skills will advance with the latest ideas and innovations in web development.<p>More information: <a href=\"http://emcien.com/about/careers/\" rel=\"nofollow\">http://emcien.com/about/careers/</a>","time":1341840602,"type":"comment"},{"by":"kilohotel","id":4190732,"parent":4184755,"text":"Las Vegas, NV\nRomotive Inc. <a href=\"http://romotive.com/\" rel=\"nofollow\">http://romotive.com/</a><p>Seeking EE's with manufacturing experience and iOS devs<p>At Romotive, we build smartphone robots that can be controlled from any smart device anywhere in the world. Because software for Romo is distributed through the Apple App Store and the Android Market, our users can download new behaviors and personalities for their robots at the click of a button. We provide continuous support for our dedicated developers through the Romotive SDK, allowing anyone to build and distribute new apps for Romo.<p>We're a venture-backed company that counts Stanford University, Tony Hsieh, David Cohen, David Tisch, Lerer Ventures, and PivotNorth Capital amongst its investor team. We've built thousands of robots in the last few months (in our apartment), and we're setting up distribution agreements with retailers across the US to sell 100,000 robots before Christmas of 2012. The team is comprised of Harvard students, YC founders, iRobot alumni, etc. We're currently located in Las Vegas as part of Tony Hsieh's investment fund, but spend a great deal of our time in Palo Alto / SF.<p>We're looking for funny and brilliant people who design and build awesome hardware and software. We're looking for engineers, designers, and people who love robots. We don't care if you have awesome job offers from every bank and consultancy on the planet. If you match the above description, reach out to us and let us show you why you want to be building robots instead.<p>Reach out to us at founders@romotive.com. We want to meet you.","time":1341260049,"type":"comment"},{"by":"tedpitts","id":4184945,"parent":4184755,"text":"Remote - Telecommute from California, Nevada, Oregon<p>Sr. Software Engineer - .NET / JavaScript / SQL Server<p>Moraware is a small software company making scheduling and estimating software for countertop fabricators. We’re profitable and have been around for over 9 years with no outside investors and no debt.<p>We all work from home, and we're adding a 3rd person to our development team to build new features, products and internal tools.<p><a href=\"http://www.moraware.com/company/careers/\" rel=\"nofollow\">http://www.moraware.com/company/careers/</a>","time":1341155442,"type":"comment"},{"by":"mkumm","id":4185246,"parent":4184755,"text":"Detroit is hiring!<p>Software Engineers (PHP, Ruby, Python, .Net)<p>You can do some quick looks at:\n - Quicken Loans (<a href=\"http://quickenloanscareers.com/\" rel=\"nofollow\">http://quickenloanscareers.com/</a>)\n - Detroit Venture Partner (<a href=\"http://detroitventurepartners.com/dna/family-companies/valleytodetroit/\" rel=\"nofollow\">http://detroitventurepartners.com/dna/family-companies/valle...</a>)\n - Nexcess.net (<a href=\"http://www.nexcess.net/careers\" rel=\"nofollow\">http://www.nexcess.net/careers</a>)","time":1341160754,"type":"comment"},{"by":"kevin1024","id":4190904,"parent":4184755,"text":"Real Geeks (Kailua, Hawaii) - Full Time.<p>Real Geeks is looking for a top-notch software developer to help\nit expand its business. We are a small team with big ideas getting\nready to take the online real estate world by storm.<p>We are looking for someone comfortable with web programming, familiar\nwith scripting languages such as Python and Javascript, knowledgeable about\ndatabase systems (we use MySQL and MongoDB), and willing to learn.\nDesign skills and Javascript / CSS mastery is a plus. We are using\nthe newest open-source technologies to create dynamic websites for the\nreal estate sector.<p>Hundreds of real estate websites running a CMS built in Python+Django with a MySQL datastore\n- Real estate data is all stored in MongoDB, served up over an HTTP API written in Python/Tornado\n- Varnish for our front-end caching as well as load-balancing our MongoDB servers\n- Redis for general caching, non-persistent datastore use and task queue\n- Beanstalkd for a simple task queue\n- Celery for deferred task processing\n- Puppet and Fabric for server administration<p>Real Geeks is based in Kailua, Hawaii on the windward side of the\nbeautiful island of Oahu, and is looking for someone willing to\nrelocate to Hawaii. It would be great if you were up to go surfing\nwith us at the end of a long day of programming.<p>Send your resume to jobs@realgeeks.com","time":1341261855,"type":"comment"},{"by":"rory_k","id":4207050,"parent":4184755,"text":"London, UK. Full time. Priory Solutions - <a href=\"http://priorysolutions.com\" rel=\"nofollow\">http://priorysolutions.com</a><p>Two roles: Senior C# Developer and Junior Javascript/C# developer.<p>We're a small software firm - still a startup mentality but established enough to be making money and we’re growing steadily. We make innovative software to change the way companies work with online subscriptions. It’s a complex technology environment with lots of fun challenges around scalability, user interface, requirements complexity, and more. We get great feedback from our customers allowing us to build things they actually want and really see the change that our products create. We’re the best in our field and we’re looking for enthusiastic developers to join our team, grow your career and help us deliver more value to our clients. We’re based in Shoreditch, with a casual and flexible work environment where you get great tools and support to do the best work you can.<p>You’ll be an enthusiastic developer who loves learning new things and keen to put your skills to work to deliver real value and build software that lots of people use. You’re pragmatic and probably somewhat pedantic like all good developers.<p>If you’re interested send us your CV and a short email to jobs@priorysolutions.com and we’ll be in touch.","time":1341567609,"type":"comment"},{"by":"cybernytrix","id":4187010,"parent":4184755,"text":"SF, H1B ok\nAbout us:\nLiveMagic is a well-funded team of hackers and entrepreneurs that are changing the way people watch TV. Delivering a personalized, mobile app/service for viewing and sharing “best of” TV moments. In addition to representing a ground floor business opportunity, LiveMagic’s system and app platforms present interesting and substantial UX, big data and system engineering challenges.<p>Very strong, iPhone Engineer with experience designing and implementing video streaming and social network features.<p>5+ years of hands on development, with 3+ years in: iOS | ObjC | C++ | Xcode<p>Proficient System skills: Building mobile applications with at least one published app in the iTunes store or enterprise app. Experience working with Code Media, Core Audio, Facebook &#38; Twitter libraries and frameworks.<p>This is a chance to be a core member of the technical team where you can set many of the design standards as we grow this high-quality engineering team. The business has explosive potential and the stakes are high. Your ability to manage the technical trade-offs of design, development and go-to-market will be critical to our success. If you can get excited about the idea of changing how millions of people “watch” TV and thrive in this type of early-stage environment we would like to hear from you.<p>For your hard work, you will be rewarded with strong base salary, early stock options, PTO and Full Benefits. Above all, we offer the opportunity to do the best work of your career. We are currently interviewing candidates. Please send us a note at jobs@livemagic.tv and include your LinkedIn, GitHub, and/or any project pages.","time":1341196688,"type":"comment"},{"by":"kristjan","id":4185840,"parent":4184755,"text":"San Francisco, CA - <a href=\"https://singly.com/jobs\" rel=\"nofollow\">https://singly.com/jobs</a>: Full-time Platform Engineers and Lead Developer Evangelist<p>Singly is hiring a lead developer evangelist and horde of generalist engineers to build a cross-service API that provides merged, normalized and deduplicated data from all of your personal sources (Facebook, Foursquare, Fitbit, email, text messages, you name it). We recently closed $7MM in funding, which we're using to expand the team and ramp up developer outreach, as well as put on huge events like our app challenge last month[1]. Mega bonus points if you've got tons of experience building or heavily consuming APIs, but if you're smart and like burritos, let's chat. Apply through <a href=\"https://singly.com/jobs\" rel=\"nofollow\">https://singly.com/jobs</a> or kristjan@singly.com. Or, just come hang with us in #singly on irc.freenode.net and at our monthly happy hours [2].<p>Happy hunting!<p>[1] <a href=\"http://blog.singly.com/2012/06/13/our-first-big-hack-event-was-a-total-success-heres-how-and-why-we-did-it/\" rel=\"nofollow\">http://blog.singly.com/2012/06/13/our-first-big-hack-event-w...</a> [2] <a href=\"http://www.meetup.com/Singly-Happy-Hour/\" rel=\"nofollow\">http://www.meetup.com/Singly-Happy-Hour/</a>","time":1341170878,"type":"comment"},{"by":"bidgely","id":4246859,"parent":4184755,"text":"Sunnyvale, CA. Bidgely (www.bidgely.com) H1B okay.\nFull Time. Front End Web Developer (Need to be a programmer and deal with databases and sometime code other business logic in PHP/Java/C++).<p>The candidate will be tasked to build everything consumer facing - web, mobile, social apps etc. Build most yourself or outsource some (like mobile apps) and manage the project - be the owner of anything consumer facing.<p>Benefits: \nHigh responsibility, handsome stock options, market competitive salary, health benefits.<p>Company: \nHot startup in energy space funded by Khosla Ventures. \nHigh energy, fun startup environment.\nKnowledge sharing via inter-company talks. Promote self-learning and work on new projects for fast growth of individuals.<p>Requirements: \nPast experience building cool, consumer engaging interfaces. \nWe are looking for developer. Graphics Design is not a requirement, but treated as a plus. \nBS/MS in computer science preferred (not a strict requirement)\nProgramming: Besides front end technologies, should also know databases, PHP, Java or C++ and be able to code any business logic in one of the common languages. \nFast learner + Self starter attitude\nDriven - motivated to work in startup - deliver product/features on time and take charge.<p>Apply at: jobs@bidgely.com","time":1342356766,"type":"comment"},{"by":"mrpibb","id":4219555,"parent":4184755,"text":"San Francisco, CA. Contract<p>The CBS Interactive games group is looking for a talented Javascript engineer to join its team. You'll be working on some of the world's largest and most fun entertainment properties including Gamespot, Giant Bomb and Comic Vine.<p>Who you are\nCandidates should be comfortable writing Javascript projects from scratch, though familiarity with JQuery and other platforms such as Node.js are expected. As we rebuild our CMS platform you'll be building dynamic messaging systems, complicated canvas based image systems and building wiki editing tools for some of the web's most passionate online communities (which means they're brutal!). This is a really fun job for someone who likes building new tech as our Internet-native audience is always hungry for the latest and greatest.<p>Who we are\nWe're a motley crew of experienced programmers and front-end designers that wants to keep our team small and personal. Outside of launching the sites mentioned above, our team members were there for the launches of TV.com, Zazzle, and Bloglines. We run a fairly flat organization within the team and try to ship on schedule.<p>Send us some code\nAlong with your sites please send us some code or small project you're proud of to danny.chi@cbsinteractive.com","time":1341857929,"type":"comment"},{"by":"alanh","id":4185631,"parent":4184755,"text":"San Francisco, CA (no remote)<p>IFTTT is hiring. <a href=\"http://ifttt.com/jobs\" rel=\"nofollow\">http://ifttt.com/jobs</a><p>IFTTT is solving the general problem of giving people control over their data and the services they already use. To get a sense of the solutions people find on IFTTT, browse our Recipes: <a href=\"http://ifttt.com/recipes\" rel=\"nofollow\">http://ifttt.com/recipes</a>. To get an idea of what we might be tackling next, use your imagination and extrapolate from there!","time":1341166866,"type":"comment"},{"by":"jturmel","id":4185056,"kids":[4185572],"parent":4184755,"text":"Oklahoma City, OK metro, YouVersion (remote welcome)<p>YouVersion, The Bible App, is looking for a highly talented, insanely passionate, Jesus follower, who wants to use their skills to impact and change the world as a software engineer and is intimately familiar with Python/PHP, RDBMS, building systems at web scale, and Git.<p><a href=\"http://www.lifechurch.tv/jobs/176-youversion-software-engineer\" rel=\"nofollow\">http://www.lifechurch.tv/jobs/176-youversion-software-engine...</a>","time":1341157416,"type":"comment"},{"by":"bijanv","id":4185352,"parent":4184755,"text":"Toronto, Canada - Full-time\nEventMobi - <a href=\"http://eventmobi.com\" rel=\"nofollow\">http://eventmobi.com</a><p>We're a self-funded team of 16 (5 engineers) and we develop a platform that allows event planners to create mobile apps for their own attendees.<p>We're looking for talented and experience engineers to help build out new architecture and features, help manage / scale our infrastructure and innovate our mobile experience. We take testing, well architected code very seriously and are always looking at ways to incorporate new tech into our platform (we're using backbone to build offline capable mobile web apps, node and socket.io to enable real-time communication between attendees / push notifications, Redis based caching for a few features, etc)<p>Check out <a href=\"http://eventmobi.theresumator.com\" rel=\"nofollow\">http://eventmobi.theresumator.com</a> for the positions we're looking for and more detail!<p>In more detail EventMobi is the leading mobile platform for shows and conferences, having been used by over 700 events, nearly 2 Million users, and are served in 7 languages across 5 continents. Clients like Disney, Intel, Motorola amongst others have used EventMobi to disrupt and enhance the attendee experience at their events.","time":1341162386,"type":"comment"},{"by":"madhkrish","id":4185309,"parent":4184755,"text":"Full-time Senior Graphic Designer at ADstruc, New York, NY.<p>ADstruc (TechStars '10) is looking to hire a full-time Senior Graphic/UX Designer for our New York office. If you love designing clean, simple user interfaces, and love making every pixel count, then come join us!<p>What is ADstruc:<p>ADstruc is currently the leading buying platform for the outdoor advertising industry (includes billboards, telephone kiosks, bus ads, etc.). We help agencies, national brands, and local businesses purchase outdoor media campaigns more efficiently. Our platform also helps outdoor advertising operators manage their inventory online and interact with clients in real-time.<p>What we're looking for:<p>- Entrepreneurial skills. This is an opportunity to be autonomous and have substantial decision-making power.\n- Ability to work in a fast-paced startup environment.\n- Ability to lead and grow a design team.\n- Extensive experience designing web applications.\n- Strong drawing skills and an ability to visualize a range of design solutions quickly.\n- Deep knowledge of typography.\n- Knowledge of HTML, CSS and Javascript is a plus.<p>If you're interested, apply here: <a href=\"http://adstruc.com/jobs/senior_graphic_designer/\" rel=\"nofollow\">http://adstruc.com/jobs/senior_graphic_designer/</a>","time":1341161760,"type":"comment"},{"by":"abdinoor","id":4202969,"parent":4184755,"text":"Boston, MA<p>MIT Startup Seeks Python Developers<p>TL;DR\nEarly VC-backed startup, smart people. Python and web apps. Consumer facing, seriously big market opportunity.\n<a href=\"http://jobsco.re/N0ADHv\" rel=\"nofollow\">http://jobsco.re/N0ADHv</a><p>The idea for Jana got its start at the MIT Media Lab. Now we’ve broken out and are building a company to change the way business is done in the developing world. Jana gives away free mobile airtime in exchange for market research or advertising. To the users of prepaid phones in the developing world, this free airtime is as good as cash. Our goal is to give a 5% raise to 1 billion people by redirecting wasted research and marketing dollars.<p>Currently we are using Python, Flask, CouchDB and Redis. We host everything with Ubuntu on EC2 and other Amazon Web Services. Git makes our codebase easy to work with. Fabric makes deploying fast and consistent. We hire bright developers who can get shit done.<p>Everybody is motivated by money at some level. So we make sure to pay better than other startups and give an equity stake to make sure that the company's success is your success.<p>We do our own hiring, talk with a developer, not a recruiter: <a href=\"http://jobsco.re/N0ADHv\" rel=\"nofollow\">http://jobsco.re/N0ADHv</a>","time":1341495935,"type":"comment"},{"by":"gtuhl","id":4194552,"parent":4184755,"text":"Atlanta, GA.  Full time. Infrastructure Engineer.<p>Job Description<p>MailChimp is looking for engineers to join our team. This is a full time position in Atlanta that will help build, support, and monitor the infrastructure our company depends on.  We handle tremendous volume and support millions of users that love our products.<p>We are looking for people with independent troubleshooting skills, strong experience with Linux, and a desire to monitor and automate everything.<p>Skills &#38; Requirements<p>Linux experience, especially at higher server counts\nScripting and coding (bash, python, ruby)\nFamiliarity with pieces of our primary stack (nginx, apache, php, memcache, mysql)\nExperience building high volume systems is a big plus\nStrong experience with mysql is a huge plus (sharding, replication, HA)<p>About MailChimp<p>MailChimp is a self-funded and profitable Atlanta-based company that is growing fast.  We offer competitive salaries, exceptional benefits and perks, phone plan coverage, coffee, snacks, top tier equipment, and an environment that empowers engineers to have a big impact.  We work in small teams, there are no project managers, no product managers, and engineers are trusted to work autonomously and make good decisions.<p>Email resumes to: infrastructurejob@mailchimp.com","time":1341330345,"type":"comment"},{"by":"kabrummett","id":4229655,"kids":[4230652],"parent":4184755,"text":"Houston, Full time, H1B - High Performance Software Engineer, great compensation<p>Does making software faster get you excited?  Do you relentlessly pursue optimal memory alignment, eliminate unnecessary assembly instructions in the critical path, and create data structures that favor cache coherency?<p>At Quantlab, low-latency is a correctness criterion.  We own and operate one of the fastest trading systems in the world.  It’s so fast we can’t even say how fast it is because our competitors might get jealous.  That said we know it can be faster, and that’s where you come in. You will be working on our ultra-low latency high frequency trading applications. Queues?  Where we’re going we don’t need queues!<p>We’re looking for someone with the following attributes:<p>Passion for software engineering and self-    improvement<p>Evangelist for one or more of TDD, BDD, DDD, continuous integration and delivery, SOLID, Agile and best practices in general<p>A no excuse attitude towards quality<p>Strong understanding of hardware architecture from a performance perspective<p>2-10 years of professional experience in software development<p>Bachelor’s degree in Computer Science or other science subject<p>Here are some words that are important at our company:<p>Test Driven Development (TDD), Domain Specific Language (DSL), Ruby, Python, C++, C#, Factor, Continuous Delivery, Event Driven, Latency, Assembly, Cache Coherency, Polyglot, Pairing, Git, Mercurial, Meta-languages, Meta-programming, Software Developer, Software Architect, Innovate, Great Compensation, Medical Benefits, Ping-Pong, Coffee, Massages, Free Lunch, Berry Pop, Ice Cream.","time":1342020656,"type":"comment"},{"by":"jonbischke","id":4184917,"parent":4184755,"text":"San Francisco (Mission), CA - Full-time - Entelo: <a href=\"http://www.entelo.com/\" rel=\"nofollow\">http://www.entelo.com/</a><p>7 things about us:<p>#1 - We're building a company that Entelo with a mission of changing how companies hire and think about talent acquisition.<p>#2 - It's a big data challenge and very interesting technically and while we're still stealth, we have dozens of paying corporate customers.<p>#3 - The team is small so you'll play an integral role in building something meaningful.<p>#4 - Our stack is a mix of Ruby, Scala, MySQL, Mongo, elasticsearch and a bunch of other goodies. We're trying to open source as much as we can (e.g., <a href=\"https://github.com/rglabs/teleport\" rel=\"nofollow\">https://github.com/rglabs/teleport</a>, <a href=\"https://github.com/gip/resque-telework\" rel=\"nofollow\">https://github.com/gip/resque-telework</a>).<p>#5 - If the notion of \"spray and pray\" recruiting makes you a little nauseous and you want to do something about it, you should contact us. :)<p>#6 - We work out of a beautiful and well-lit loft in the Mission, close to Coffee Bar, Blowfish, Atlas and a host of other cool coffee shops and restaurants.<p>#7 - We're going big on this one.<p>I'm the founder and you can email me directly at jon at entelo dot com or call me at 310-351-7275.","time":1341154906,"type":"comment"},{"by":"adjohn","id":4185899,"parent":4184755,"text":"San Francisco, Tokyo, Barcelona - Full Time Developers <a href=\"http://midokura.com/careers\" rel=\"nofollow\">http://midokura.com/careers</a><p>At Midokura, we're virtualizing the network.  We've spent the last two and a half years building up this technology, and we're gearing up for a big release later this year.  We've got a very ambitious roadmap, with a lot of challenges ahead.<p>We're looking for both core developers to work on our distributed networking services, using mainly Java, Scala, and some low level C.  We integrate our networking solution into open source clouds such as OpenStack, so there is also some open source python opportunities there.<p>We're also looking for front-end developers to work on our network management GUI written in backbone JS.<p>Our roots come from Japan, but we're a global team with offices in Tokyo, San Francisco, and Barcelona.  You'll get chances to visit these awesome cities around the world to work face to face with your team.  We're funded by strategic investors such as NTT, the worlds second largest telecommunications company.<p>We're 20 people now in total, and hoping to grow our awesome team.  Hit me up if you're interested in this space adam at midokura.com","time":1341172034,"type":"comment"},{"by":"abreckle","id":4185790,"parent":4184755,"text":"San Francisco, CA, Full time. H1B okay.<p>Visual.ly is hiring entrepreneurial front and back-end hackers with experience in the following: Python/Flask/MongoDB, Javascript/jQuery/Backbone.js/Less/CSS3.\nCheck out our launch video: <a href=\"http://www.youtube.com/watch?v=AiVKfNeRbPQ\" rel=\"nofollow\">http://www.youtube.com/watch?v=AiVKfNeRbPQ</a><p>More information here: <a href=\"http://visual.ly/about/jobs\" rel=\"nofollow\">http://visual.ly/about/jobs</a>","time":1341170017,"type":"comment"},{"by":"mkbernier","id":4191879,"kids":[4192432],"parent":4184755,"text":"Denver, CO &#38; Boulder, CO<p>I'm a dirty recruiter, run away! ...or don't and see that we do things differently <a href=\"http://bit.ly/ChzDoodles\" rel=\"nofollow\">http://bit.ly/ChzDoodles</a> (goes to reddit)<p>We've got a bunch of jobs and relocation assistance can be made available for the right people!<p>LAMP: <a href=\"http://bit.ly/KPINix\" rel=\"nofollow\">http://bit.ly/KPINix</a>\n.Net/Rails: <a href=\"http://technicalintegrity.com/is-it-possible-that-net-and-rails-developer-exists/\" rel=\"nofollow\">http://technicalintegrity.com/is-it-possible-that-net-and-ra...</a>\nJava: <a href=\"http://technicalintegrity.com/bobsledding-bonanza-boulder-brave-builders-java-badassery/\" rel=\"nofollow\">http://technicalintegrity.com/bobsledding-bonanza-boulder-br...</a>\niOS/Android: <a href=\"http://technicalintegrity.com/build-play-3d-mobile-games-rocky-mountains/\" rel=\"nofollow\">http://technicalintegrity.com/build-play-3d-mobile-games-roc...</a><p>You can see all of our jobs: <a href=\"http://technicalintegrity.com/job-listings/\" rel=\"nofollow\">http://technicalintegrity.com/job-listings/</a><p>We're also offering $1000 for a referral to someone we can hire to one of our jobs. See the cheese doodles link above.","time":1341276555,"type":"comment"},{"by":"glou","id":4185089,"parent":4184755,"text":"Quirky.com - Full Time - NYC<p>Quirky is a social product development company where people from all around the world submit invention ideas to our website. With the help of our passionate community, we select the best ideas each week to develop together and try to bring them to market. If an idea actually makes it, then everyone who helped along the way gets a piece of the pie. You can find our products at retailers such as Target and Bed Bath &#38; Beyond.<p>Quirky is a rails shop, and we work with lots of fun technologies like AWS, mongo, iOS and heroku to name a few. We're a small team that works on lots of big, fun and interesting problems. We just moved into a brand new, fully custom office space in Chelsea (might be the coolest office you'll find in NYC). Oh and we also had a reality show on the Sundance Channel last year.<p>We're looking to hire rockstar rails, front end and back end developers. More details here: <a href=\"http://quirky.theresumator.com/apply/\" rel=\"nofollow\">http://quirky.theresumator.com/apply/</a><p>If interested, shoot me an email greg at quirky dot com. Relocation is available for well qualified candidates (I moved from SF to NYC to work here!)","time":1341157881,"type":"comment"},{"by":"davidblondeau","id":4185821,"kids":[4185882],"parent":4184755,"text":"Burligame, CA - Collaborative Drug Discovery (CDD) (<a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>)<p>CDD is growing and financially stable. Our software helps scientists manage, analyze and collaborate around their drug discovery data (chemistry and biology). We are are in a great position to support the evolution towards more collaboration, specialization and distribution in a market that has been historically closed and secretive. The model has been successful with academic labs, small biotech startups and very large collaborations (like the Gates foundation TB initiative or MM4TB in Europe). We are now gaining some traction with government agencies and the big pharmaceuticals.<p>We are hiring two full-stack software developers (<a href=\"https://www.collaborativedrug.com/pages/employment\" rel=\"nofollow\">https://www.collaborativedrug.com/pages/employment</a>). As one of the core developers, you need to be comfortable working or interested in building expertise at every level of the stack. Experience or interest in system administration and operations is nice to have though not required. We have many projects involving web development, data visualization, data processing, scaling, security, privacy and other software challenges to make our scientific application collaborative, engaging and rewarding.<p>It is perfectly OK if you do not have experience with any of the languages or technologies we currently use (Rails/Ruby/JS/MySQL/Solr...) as long as you can learn those quickly. CDD is a great place if you want to have a lot of impact and like to take on projects and responsibilities. We offer market salary and meaningful equity.<p>If you are interested, contact work@collaborativedrug.com, you will get an answer from one of the developers.","time":1341170462,"type":"comment"},{"by":"salar","id":4188266,"parent":4184755,"text":"Amsterdam, the Netherlands. INTERNs welcome.<p>Silk (www.silkapp.com) is looking for software engineers. We're building a product that makes it easy for people to create sites with content that is easy to query, visualize and share. On a deeper level, our vision is to bring the semantic web to the masses and build an amazing company around that. (More about the product and company: <a href=\"http://gigaom.com/europe/meet-silk-the-semantic-web-for-the-rest-of-us/\" rel=\"nofollow\">http://gigaom.com/europe/meet-silk-the-semantic-web-for-the-...</a> and <a href=\"http://www.guardian.co.uk/news/datablog/2012/may/10/silk-site-data-visualisation-interactive\" rel=\"nofollow\">http://www.guardian.co.uk/news/datablog/2012/may/10/silk-sit...</a>)<p>We're working on many interesting and challenging problems, with a custom-built Haskell graph-database on the back-end and a cutting-edge Functional Reactive client-side framework in Javascript on the front-end.<p>The team is still small (~9 people), so you'll be able to make a large impact. We are well-funded by top-tier VCs and located in the city center of Amsterdam.\nContact us at jobs@silkapp.com.","time":1341225716,"type":"comment"},{"by":"bendilts","id":4186368,"parent":4184755,"text":"Lucidchart - Salt Lake City, UT<p>Lucidchart is a rapidly growing tech startup looking for great backend software engineers to join us at our headquarters in Utah.  At Lucidchart, we build killer graphical web applications requiring highly available, secure and scalable backend services. Talent and ability to learn are more important than years of experience.<p>You may have seen Lucidchart demoed during the second Google I/O 2012 keynote: <a href=\"http://t.co/sd6GgZvy\" rel=\"nofollow\">http://t.co/sd6GgZvy</a><p>We're hiring BACKEND SOFTWARE ENGINEERS. Lucidchart runs with various decoupled services in a Linux environment using Scala, PHP, MongoDB and MySQL.   At Lucidchart, your responsibilities would include enhancing existing  services, building new services, integrating with 3rd party applications and ensuring services are highly reliable and scalable.<p>Requirements:\n* Talent<p>Recommended experience:\n* Have built large products / applications\n* Scala or Java\n* PHP\n* MySQL or other relational database\n* NoSQL databases (MongoDB especially desirable)\n* Opscode Chef or Puppet\n* Cloud computing (AWS)<p>We're also hiring FRONTEND SOFTWARE ENGINEERS. We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements:\n* Talent<p>Recommended experience:\n* Have built large products / applications\n* Javascript\n* Google Closure compiler/library\n* CSS/HTML/DOM manipulation\n* jQuery\n* node.js\n* Native app development on Android and/or iOS\n* Facebook APIs","time":1341181794,"type":"comment"},{"by":"capkutay","id":4206902,"parent":4184755,"text":"WebAction (<a href=\"http://www.webaction.com\" rel=\"nofollow\">http://www.webaction.com</a>) - Full Time or Intern in Palo Alto, CA (Downtown Palo Alto)<p>WebAction is a start-up looking to fill the gap between big data and transaction data. We have our initial funding and we are now building out our core engineering team. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today.<p>We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.\nSkills you should have or at least be interested in learning:\nLarge-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested in joining, email us at jobs@webaction.com","time":1341563444,"type":"comment"},{"by":"aawecler","id":4220581,"parent":4184755,"text":"New York, NY<p>Yodle<p>Yodle's engineering team (there's 40 of us now) is looking for a Lead Engineer for Dev and Test tools development.<p>Yodle helps local businesses across the US and Canada acquire new customers through digital marketing.  We currently work with 30,000+ customers.  We are HQ'd in NYC.<p>Below is some additional info on the role and you can learn more/apply here : <a href=\"http://www.yodlecareers.com/jobs/new-york/lead-engineer/\" rel=\"nofollow\">http://www.yodlecareers.com/jobs/new-york/lead-engineer/</a><p>At Yodle a Lead Engineer is clear technical leader in the organization. Someone who solves the hardest problems. Delivers on the most critical projects. Sees through complexity and simplifies it.  Always a step ahead of everyone else. Widely respected for both quantity and quality of work. Has great intuition for design and architecture. Pragmatic. Defines and spreads best practices. Makes everyone else better. Is right most of the time, but humble enough to collaborate with others and be truly open to their ideas. Contributes to technical vision and direction of Yodle.<p>We have a large and growing code base that’s undergoing a transition to a service architecture. We have multiple feature teams working on high business impact projects, often modifying the same components. Our engineering team is growing. We code predominantly in Java, JavaScript and Python for internal tools and prototypes. We use technologies such as Spring, jQuery, Thrift, Zookeeper, PostgreSQL, MongoDB, Mercurial, Fabric, Graphite/Carbon.  Your challenge is to help keep us moving quickly in the short and long term, by helping set Yodle’s technology and architectural direction, contributing software design expertise, spreading good engineering practices, and leading projects most critical to the business.","time":1341869029,"type":"comment"},{"by":"drl2118","id":4186835,"parent":4184755,"text":"4-week contract to hire position at growing publishing startup<p><i>Who we are:\nWriter's Bloq, Inc. (www.writersbloq.com) is a startup focused on helping great writers get discovered. We want to help talented writers increase their exposure and earn opportunities for publication. We believe too many great writers are being overlooked.<p></i>What we are seeking:\nWe're looking for someone to help our CTO grow our platform and begin developing our app.\n- 2-3 years of web development experience in PHP\n- Proven experience developing iOS applications (please provide examples)\n- Ability to come into our NYC office 5 times/week\n- Full LAMP stack experience or interest: front-end, back-end, database, server<p><i>What we are giving:\n- 7K-8K/month, flexible\n- Will teach you how to write!\n- Will share our clever wit and humor on a daily basis<p></i>When we are doing it:\n- Looking to do phone interviews on Monday-Thursday (7/9-7/12)\n- In person interviews on Monday-Wednesday (7/16-7/19)\n- Starting development by 8/1<p>*How to apply:\n- E-mail team@writersbloq.com with subject line: \"DEVELOPER\" and include your web presence: LinkedIn, Github, Twitter, Blog","time":1341192986,"type":"comment"},{"by":"cindyyim","id":4188575,"parent":4184755,"text":"Hilversum, The Netherlands. Full time, H1B.<p>We are recruiting a Senior PHP Developer at Spil Games! We write software in the morning and see the world use it the same evening. We do portals payment solutions backend logic algorithms performance engineering scalability databases widgets and front-end. The Agile manifesto is our mantra. We use object oriented PHP scalable and powerful Erlang flexible and logical Python slick JavaScript modularized CSS and innovative HTML5. We construct our own tools; from an automated testing framework in Ruby to a sophisticated deployment system in PHP. For APPLYING and the full job description of the job role: <a href=\"http://www.spilgames.com/careers/CandidatesPortalNoLogin/Vacancy.cfm?PortalID=3773&#38;VacatureID=144952&#38;BedrijfID=0\" rel=\"nofollow\">http://www.spilgames.com/careers/CandidatesPortalNoLogin/Vac...</a><p>Who are we?\nSpil Games’ mission is to unite the world in play through a localized global network of online social-gaming platforms tailored to girls, teens and families. These platforms, which include GirlsgoGames (for girls between 8-12) are localized in 15 languages, and entertain more than 180 million monthly active users from around the world each month. These platforms host popular casual and social games which encourage players to connect and challenge themselves and each other while sharing their creativity. Additionally, Spil Games is present on mobile devices through browser-based and native application versions of the company’s targeted social-gaming platforms.<p>Of course this is not the only vacancy we have! Please take a look at all of our current openings: <a href=\"http://www.spilgames.com/careers/job-openings/\" rel=\"nofollow\">http://www.spilgames.com/careers/job-openings/</a><p>Question? -&#62; cindy.yim@spilgames.com. Looking forward to receiving your application!","time":1341232779,"type":"comment"},{"by":"noahjsmith","id":4236768,"parent":4184755,"text":"New York, NY - Full-stack and front-end devs<p>We are currently in private beta and are looking to grow our team, including full-stack and front-end software engineers. There will be phenomenal opportunities for the right candidates to shape this business and their role within it. We are based at General Assembly in NYC's Flatiron District.<p>WHO WE ARE<p>Dwelleo is a communication platform for where you live. Our mission is to make it easy to connect with everyone related to your home and neighborhood. Dwelleo gives each address its own landing page where residents can access building and neighborhood discussion boards; tools to communicate directly with neighbors, groups and building management; and Q&#38;A and review forums.<p>We are at the early stages of building a web application with terrific business potential as well as broad utility and appeal. If we get it right, even your grandmother will use and love Dwelleo.<p>WHAT WE ARE LOOKING FOR<p>We are looking for software engineers with strong experience (or else a passion to get involved in) building consumer-facing web products and an appetite for building something from the ground floor. This includes both UX/front-end developers and full-stack developers.<p>Our current product is built using Java, Spring and Hibernate on the back-end. Knowledge of these is certainly a plus but not essential for someone who's eager to learn.<p>As far as practical arrangements, we are young and scrappy and ready to do what it takes to get the right team focused on building the right product. Ideally, we want people fulltime in NYC. But we are open to considering part-time and remote arrangements initially. Regardless, we will make sure our team is fairly compensated.<p>Please respond to: noah [at] dwelleo.com","time":1342126633,"type":"comment"},{"by":"myenergy","id":4184820,"parent":4184755,"text":"MyEnergy - Boston, MA - FULL TIME: Data &#38; Rails Engineers, Frontend Devs, and Designers - <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a><p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Frontend Devs to craft and implement amazing and dynamic experiences in our user-facing platform =&#62; <a href=\"https://www.myenergy.com/careers/frontend_developer\" rel=\"nofollow\">https://www.myenergy.com/careers/frontend_developer</a><p>* Data Engineers &#38; Scientists to embark upon ambitious projects leveraging machine learning and AI =&#62; <a href=\"https://www.myenergy.com/careers/data_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/data_engineer</a><p>* and UI Designers (in Boston, or Irvine, CA) to make the whole of the user experience astounding =&#62; <a href=\"https://www.myenergy.com/careers/ui_designer\" rel=\"nofollow\">https://www.myenergy.com/careers/ui_designer</a><p>We're HQ'ed in a conveniently located, sunny two-story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot co","time":1341153326,"type":"comment"},{"by":"briandear","id":4184944,"parent":4184755,"text":"NYC, H1B, US Citizen or Resident<p>Paperless Post<p>Mobile Web Developer<p>We are seeking an exceptional Mobile Web Developer to join our new mobile team. In this role you will work closely with our Product and Mobile team to help us shape, design, and build the mobile Paperless Post experience for our mobile customers across a variety of mobile devices, and browsers. This role is a great fit for an experienced web developer who is looking to move into the mobile space. You will tackle design and software architecture challenges as you make the rich Paperless Post web experience live on mobile browsers. The ideal candidate is an excellent programmer, user-focused, and passionate about the mobile opportunities for Paperless Post.<p>Responsibilities:\nDevelop our mobile web application throughout the product lifecycle: code architecture, feature implementation, integration, and code verification\nSolve complex technical problems under system constraints such as performance, form factors, and data service availability\nLead and participate in code reviews\nCollaborate with the product, design, QA, and support teams to understand product requirements prior to implementation\nEnsure continuous high product quality through code testing, bug fixing, and feature changes based on consumers feedback<p>Requirements:\n2 years of experience developing for web/mobile web platforms in JavaScript, HTML, CSS (Ruby, Ruby on Rails a plus)\nB.S. / B.A. in Computer Science or equivalent experience\nCreative with excellent problem solving and analytical skills\nPassion for product quality and attention to details\nMust be a team player and effective collaborator with excellent communication skills\nExperience coding for multiple mobile platforms (Android, BlackBerry, Windows) is a plus<p>To Apply:\nSend your resume to brian@paperlesspost.com","time":1341155429,"type":"comment"},{"by":"ladon86","id":4185173,"parent":4184755,"text":"ClassDojo<p>FULLTIME or INTERN in PALO ALTO, CA<p>ClassDojo is used by thousands of teachers to manage students’ behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We're an edtech startup funded by some of the biggest names in the valley, and we're one of the fastest growing education companies of all time. PG has invested in us, but we didn't do YC.<p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board.\nIf you're a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n  https://classdojo.wufoo.com/forms/join-classdojo/  \n  --------------------------  \n</code></pre>\nOr email jobs@classdojo.com.<p>You can read about the work and environment here:   <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a><p>We are looking for:<p><pre><code>  Lead Software Engineer\n\n  Lead Front-end Developer  \n\n</code></pre>\nIf you think you're a good developer but don't fit into those buckets, get in touch anyway.","time":1341159307,"type":"comment"},{"by":"unwiredben","id":4185355,"parent":4184755,"text":"SF/Sunnyvale,CA: Enyo JS Framework Engineer at HP/Palm<p>I'm the tech lead on the Enyo framework team (<a href=\"http://www.enyojs.com\" rel=\"nofollow\">http://www.enyojs.com</a>).  We're just about to push our 2.0 version out of beta, and we need to staff up to deal with a lot of new work.<p>Enyo came out of work on the mobile tablet UI of the HP TouchPad, but has been rewritten to be a cross-platform mobile &#38; desktop front-end framework, providing a OOP model for building app components and hooking them all together, all released under the Apache 2.0 license.<p>We're working on our Ares web-based editor for Enyo development, as well as expanding Enyo to better work with popular MVC frameworks and building our the UI widget set to include data-bound controls and better data visualization.<p>You'd get a chance to build the tools and code that will power lots of applications, both internally at HP and with lots of independent devs who came up through the webOS world and now are moving to support all the devices out there.<p>Check us out at <a href=\"http://enyojs.com/#jobs\" rel=\"nofollow\">http://enyojs.com/#jobs</a>.","time":1341162420,"type":"comment"},{"by":"LocalPCGuy","id":4185805,"parent":4184755,"text":"Ann Arbor, MI<p>Enlighten is an independent digital marketing agency delivering fully integrated services that drive business value and consumer engagement.<p>A number of technical positions open, see <a href=\"http://www.enlighten.com/about/careers/\" rel=\"nofollow\">http://www.enlighten.com/about/careers/</a><p>VP, Technology &#38; Software Innovation<p><a href=\"http://www.enlighten.com/about/careers/vp-tech\" rel=\"nofollow\">http://www.enlighten.com/about/careers/vp-tech</a><p>We are currently seeking a progressive, creative and strategic technology leader to spearhead software innovation and to manage, mentor and grow an engineering and quality assurance practice with 20+ individuals working across an eclectic range of technologies and platforms. Our team works on projects ranging from developing dynamic websites to mobile applications to enterprise solutions utilizing industry standards. We are mindful of emerging technologies and platforms including but not limited to HTML5, CSS3 and jQuery on the client-side, and .NET, Java and PHP on the server-side. Projects typically utilize a number of technologies including Content Management System, Portal Framework and Mobile / Tablet devices.<p>Senior Web Engineer (C#/.Net experience desired, this is a contract-to-hire opportunity)<p><a href=\"http://www.enlighten.com/about/careers/sr-web-engineer\" rel=\"nofollow\">http://www.enlighten.com/about/careers/sr-web-engineer</a><p>Enlighten is looking for an exceptional, self directed software engineer with 8-10 years of web development experience. You will work alongside an elite team of engineers who are passionate about solving complex interactive challenges on the web.<p>If you'd like to join our team, please e-mail your cover letter and resume to jobs at enlighten.com.","time":1341170216,"type":"comment"},{"by":"sarhus","id":4185083,"kids":[4185294],"parent":4184755,"text":"London - UK<p>Disclaimer: I'm a developer myself, I made this list out of necessity while looking for a job in London last month.<p>Last \"Who is Hiring June 2012\" didn't have any jobs in London!<p><a href=\"http://roundabout.io\" rel=\"nofollow\">http://roundabout.io</a><p>The list is far from comprehensive, but if you're a developer in London you should definitely have a look at it, there are more than 30 startups listed, and not all of them post in this thread.","time":1341157758,"type":"comment"},{"by":"daveambrose","id":4186236,"parent":4184755,"text":"Mountain View, CA + New York, NY - FT + Internships, Product for Mobile + Social @ Travelzoo<p>Help 25 million subscribers push boundaries on local commerce, deal publishing and media via mobile and new social tools. We're looking for smart, forward-looking entrepreneurs who have a passion for local, traveling and scratching their own itch.<p>We're a small team (group of folks who previously built/sold companies) where everyone gets their hands dirty in guiding product, solving big problems at scale and makes an impact each quarter for our shareholders (Travelzoo is public on the NASDAQ).<p>What we offer: <i>Top salary; Great perks, like the Travelzoo Experience (eat your own dogfood on any of our deals published throughout the world!); Medical, Dental, Vision; Excellent career advancement opportunities</i><p>Previous experience in mobile product management or social API development is a big plus.<p>If you're interested, drop me a line (dambrose at travelzoo dot com) with subject [HN July 2012] or apply on our Careers page: <a href=\"http://www.travelzoo.com/jobs/\" rel=\"nofollow\">http://www.travelzoo.com/jobs/</a>","time":1341178460,"type":"comment"},{"by":"manobal","id":4185725,"parent":4184755,"text":"San Francisco (Downtown), CA - Full Stack Generalist - Full Time, Duetto Research (<a href=\"http://duettoresearch.com\" rel=\"nofollow\">http://duettoresearch.com</a>)<p>Duetto Research is bringing world class cloud 'Big Data' technology to the enterprise side of the travel business - a massive industry, ripe for innovation, representing almost 10% of global GDP.<p>We are a small, 5-person team based out of San Francisco. We are very early in to the product development. Your contribution will have a huge impact on the company’s direction and success. We recently raised $2.1 million in Series Seed funding (<a href=\"http://techcrunch.com/2012/04/19/duetto-seed-round/\" rel=\"nofollow\">http://techcrunch.com/2012/04/19/duetto-seed-round/</a>).<p>We use Java server technologies, Big Data and NoSql analytical methods including MongoDB, AWS + Github, modern Javascript-driven web applications (jquery, backbone, underscore, REST).<p>We are looking for a technical generalist who is excited to work on a very diverse set of projects and challenges.<p>If interested send an email with your resume at info at duettoresearch dot com.","time":1341168438,"type":"comment"},{"by":"mm686","id":4185205,"parent":4184755,"text":"72Lux - San Francisco, CA, Full time<p>We’re building an ecommerce platform for digital magazines, blogs and web content publishers. Our hosted platform is targeted at making the web more shoppable. We make it possible for magazines and blogs to feature and sell products from our massive catalog, without linking the users away from the publisher's site.<p>We're 6 people and are angel funded.<p>We're looking for full-stack web engineer. We work on all levels of code from database interaction and core business logic up through html/css/javascript. We practice agile development, use and contribute to open source projects and encourage engineers to architect, implement and deploy your projects from end to end. If you have experience building a high-volume, low-latency, distributed transactional platform, then we're looking for you.<p>Our stack is a mix of: PHP, Ruby on Rails, MySQL, Javascript.<p>If you're interested email mike at 72lux dot com or apply here <a href=\"http://72lux.theresumator.com/apply/tuAVX2/Software-Engineer.html\" rel=\"nofollow\">http://72lux.theresumator.com/apply/tuAVX2/Software-Engineer...</a>","time":1341160043,"type":"comment"},{"by":"dubisaweapon","id":4190803,"parent":4184755,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B<p>At our core, we're a technology company applying our talents to the domain of finance. We've created a system that combines artificial intelligence and keen human insight—a system that's constantly improving and advancing.<p>We're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology. We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you! dave.hahn@twosigma.com","time":1341260733,"type":"comment"},{"by":"briandear","id":4184954,"parent":4184755,"text":"NYC, H1B, US Citizen or Resident<p>iOS Applications Developer<p>We are seeking an exceptional iOS applications developer to join our new mobile team. In this role you will work closely with our Product and Mobile team to help us shape, design, and build the mobile Paperless Post experience for our iOS customers. The ideal candidate is an excellent programmer, user-focused, and passionate about the mobile space and the mobile opportunities for Paperless Post.<p>Requirements:\n2 years of experience developing in Objective-C with the iOS SDK and/or for desktop Mac apps\nExcellent understanding of optimization and performance issues across iOS software layers\nExperience coding for multiple mobile platforms (Android, BlackBerry, Windows) is a plus\nExperience submitting and releasing iOS applications to the Apple App Store is a plus\nCreative with excellent problem solving and analytical skills\nPassion for product quality and attention to details\nMust be a team player and effective collaborator with excellent communication skills<p>To Apply:\nSend your resume to brian@paperlesspost.com","time":1341155556,"type":"comment"},{"by":"arksri","id":4185516,"parent":4184755,"text":"Arktan - Full Time - Front-End Engineer - LOCAL/REMOTE - Menlo Park, CA<p>Arktan is looking for great front-end developers. We work in small and agile teams, and collaborate with product designers to implement features rapidly. We are looking for people with experience working on Javascript and a passion for detail.<p>There are not a lot of boundaries here, so expect to make a big impact. The code we check in today is running in production the same week -- sometimes that day. So we need people that will take pride in the quality of their code.<p>- Undertake HTML, CSS and JavaScript development to create new web functionality that will be used by millions of users.\n- Ensure compatibility of the front-end applications across platforms and browsers\n- Build innovative user experiences with the latest real-time web technologies\n- Work closely with customers on support, feature requests, solutions and deploying software\n- Troubleshoot production issues when necessary<p>Apply here: <a href=\"http://www.arktan.com/about/careers\" rel=\"nofollow\">http://www.arktan.com/about/careers</a>","time":1341164923,"type":"comment"},{"by":"kstenerud","id":4184955,"parent":4184755,"text":"San Francisco, CA (INTERN, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>We build wonderful educational games in San Francisco. If you are nice and want to help us make splendid products, we'd love to hear from you.<p>We're hiring in lots of areas! Here are a few:<p>* Backend engineer: So much data, so little time! If you can extract signal from the noise, and want to improve the way people learn through our products, we want to hear from you! Experience with scaling multiplayer games or web services is a huge plus.<p>* Mobile engineer: You build pocket-sized awesomeness on iOS and/or Android. We make games that teach people stuff. The perfect combination! We have plenty of fun and challenge projects for both mobile app and game developers.<p>* UI designer: We believe that great design is essential to build products people love. If you live to make jaw-dropping UI experiences (web and/or mobile), this is the place to be!<p>Email us at jobs@mindsnacks.com\nMore details: <a href=\"http://www.mindsnacks.com/careers/\" rel=\"nofollow\">http://www.mindsnacks.com/careers/</a>","time":1341155564,"type":"comment"},{"by":"ecopoesis","id":4184870,"parent":4184755,"text":"Charlestown, MA - Fulltime - Tingo<p>Tingo (<a href=\"http://www.tingo.com\" rel=\"nofollow\">http://www.tingo.com</a>) is looking for brilliant, passionate engineers to build the next-generation online travel agency—easy and fun to use, with innovative features to save customers money.<p>Our development process is agile but not dogmatic. We have daily standups, test everything and deploy code each day. We abhor unnecessary process and impediments. Tingo developers take pride in closing bugs, implementing features quickly and solving hard problems.<p>Our offices at Smarter Travel Media in Charlestown, MA are just a block from the Sullivan Square T stop. We have catered lunch on Thursdays and subsidized take-out from local restaurants Monday through Wednesday. During most of the year, we have company-wide Happy Hours on Friday afternoons.<p>We use the best tools money can buy including top of the line Mac or Linux computers, 27+ inch displays and IntelliJ IDEA.<p>Come work at Tingo and disrupt the travel industry.<p><a href=\"http://www.tingo.com/jobs\" rel=\"nofollow\">http://www.tingo.com/jobs</a>","time":1341154183,"type":"comment"},{"by":"capkutay","id":4186146,"parent":4184755,"text":"WebAction - Full Time or Intern in Palo Alto, CA (Downtown Palo Alto)<p>WebAction is a start-up looking to fill the gap between big data and transaction data. We have our initial funding and we are now building out our core engineering team. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today.<p>We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>Skills you should have or at least be interested in learning:<p>Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested in joining, email us at jobs@webaction.com","time":1341176977,"type":"comment"},{"by":"briandear","id":4184938,"parent":4184755,"text":"NYC, H1B, US Citizen or resident<p>Paperless Post<p>Quality Assurance Engineer<p>We are seeking a Quality Assurance Engineer to serve as a liaison between our Product and Engineering teams. In this role you will live between our two top priorities: product-enhancing features and flawless functionality, ensuring that Paperless Post is constantly growing and adding new features without sacrificing quality. We provide a consumer-friendly product that over ten million people interact with, and the successful candidate will be involved in a mix of quality assurance, feature management, and advocacy for our users.<p>Responsibilities\nFully understand project specs, and create and manage tickets for development team\nVet the readiness of features for production via feature testing and regression-testing other areas of the site\nWith Product Managers, discuss bugs and other issues and their effect on specs and deployment goals\nWork closely with the Production Manager toward the goal of optimal production performance by: <i>Ensuring technical quality of projects and features before and after deployment </i>Incorporating solutions for user-facing bugs and usability issues into the feature development process\nPush forward the development of new features, advocate for the fixing of user-facing bugs and usability issues, and ensure the general stability of the products we release<p>Qualifications\nPassion for delivering an extremely high quality product\nPassion for delivering an extremely high quality product\nSuperb communication and organizational skills\nUnderstanding and strong interest in web technologies\nAbility to listen carefully and execute within changing priorities\nKnowledge of software development methodologies and tools\nTrack record of proactive project management a plus<p>To Apply:\nTo apply for this position please send a resume to brian@paperlesspost.com with a brief cover letter included in the body of the email.","time":1341155356,"type":"comment"},{"by":"antgoldbloom","id":4185267,"parent":4184755,"text":"Kaggle - San Francisco<p>Kaggle is a platform for data science competitions, that is changing the way data science is done. We've already solved problems for NASA, Wikipedia, Ford and Allstate (see some of the problems we've solved here: <a href=\"http://www.abc.net.au/catalyst/stories/3296837.htm\" rel=\"nofollow\">http://www.abc.net.au/catalyst/stories/3296837.htm</a>).<p>Kaggle is hiring outstanding developers to join its core team. As a Kaggle developer, you'll be building the platform that helps solve many of the most valuable problems in data science. You'll guide the development of tools that automate the process of setting up a competition, verifying winning models, and integrating those models into our customers' operations. The tools you will develop go the heart of Kaggle's mission and technology offering.<p>More information at <a href=\"http://kaggle.theresumator.com/apply/3s1xdU/Developer.html\" rel=\"nofollow\">http://kaggle.theresumator.com/apply/3s1xdU/Developer.html</a>","time":1341161051,"type":"comment"},{"by":"benshyong","id":4194475,"parent":4184755,"text":"New York, NY.  Full time.  H1B Okay.\nMeddik - Rails developers<p>We're a venture-backed, three-month old startup in New York City that aims to revolutionize the way people discover health information online. Meddik empowers users by providing a health-specific platform where users can ask questions, share content, and learn from the collective experience and insight of people who’ve been there.<p>We’re looking for someone to craft an experience that users will love and break the tradition of health sites being clunky and impossible to use. As one of the first few hires, you will play an important role in helping define company culture and giving feedback in building out the team.<p>We're looking for:<p>Back-end engineer<p>- Test-driven development, Ruby on Rails<p>- Experience with databases and data architecture is a plus<p>- Experience or willingness to learn NLP and machine learning is a plus<p>Front-end engineer<p>- Responsive design<p>- Javascript, CSS<p>- Experience with creating original artwork is a plus<p>To apply, please send a resume, descriptions of your past favorite projects, and a short email about yourself to jobs@meddik.com","time":1341329470,"type":"comment"},{"by":"jdguyot","id":4217403,"parent":4184755,"text":"Paris, France<p>Captain Train - <a href=\"http://capitainetrain.com\" rel=\"nofollow\">http://capitainetrain.com</a><p>We are disrupting the european market of train tickets for more than 150 millions of passengers with three principles: simplicity, speed and customer service. Captain Train is the simplest and fastest way to buy train tickets in France, Germany and soon everywhere in Europe.<p>We are looking for:<p>* iOS Developer: <a href=\"http://capitainetrain.com/jobs#ios\" rel=\"nofollow\">http://capitainetrain.com/jobs#ios</a><p>* Android Developer: <a href=\"http://capitainetrain.com/jobs#android\" rel=\"nofollow\">http://capitainetrain.com/jobs#android</a><p>* RoR/JS Developers: <a href=\"http://capitainetrain.com/jobs#frontend\" rel=\"nofollow\">http://capitainetrain.com/jobs#frontend</a> (we have one of the world's biggest Ember.js app and we contribute a lot to this framework)<p>* Search &#38; Book Engine Developer: <a href=\"http://capitainetrain.com/jobs#engine\" rel=\"nofollow\">http://capitainetrain.com/jobs#engine</a><p>jobs@capitainetrain.com","time":1341827915,"type":"comment"},{"by":"XEKEP","id":4221824,"parent":4184755,"text":"Sunnyvale, CA. ☀ INTERN. \nAutomatiks, Inc.<p>Today the lights are still off for one fifth of World population. Join us for the Summer to help us turn them on.<p>Ok, you’ve made programming a part of your life and love your decision.<p>* You have a project coded by you from start to finish and it was not your school assignment.<p>* You developed for web before and liked it.<p>* You are passionate about intuitive UI, data visualization and want to dive deeper.<p>* You are a quick starter - and by that we mean hours, not days.<p>✰ You feel comfortable with hardware. Not a requirement, but a huge advantage.<p>Please tell us about yourself. Use ascii text only and make sure you addressed the items above. List programming languages you’re fluent in. What’s your favorite? Why?<p>We offer a fast-paced startup environment, a company of fun, passionate and sharp pros, and, possibly, a place to stay for the rest of Summer in the SF Bay Area. We will compensate you competitively.<p><a href=\"http://www.automatiks.net/jobs/\" rel=\"nofollow\">http://www.automatiks.net/jobs/</a>","time":1341889002,"type":"comment"},{"by":"jonkelly","id":4185043,"parent":4184755,"text":"Denver, CO metro (Englewood)<p>This or That Media is looking for a software engineer with experience in Java, Hibernate, and Spring.<p>We are a small team that gets a lot done. We offer health insurance, competitive salary, stock options and private offices. We lack pointless meetings, overhead and cubes.<p>If you are interested, please send your resume to Matt, tech at thisorthat.com","time":1341157146,"type":"comment"},{"by":"dprevite","id":4189417,"parent":4184755,"text":"Chicago, IL. Full time.<p>Lightswitch is looking for an experienced web developer to join our team to help us build our core technology, new website, public API’s, etc. We are ambitiously building a company to solve a tough problem – making custom video production easy and affordable for every small business in America. We are a startup with real revenue and the same committed investors that built Groupon – this is a great opportunity for you to make a huge impact at an early stage company. We have an energetic and highly motivated team and are looking for more of the same.<p>This job is located in Chicago, IL. If you’re interested, send a resume along with a link to your Github profile to technology@lightswitch.com.<p>Your responsibilities<p>Be creative in solving technology problems and disciplined in testing and implementing solutions\nSupport web app and back-end in production<p>What we’re looking for:<p>* A minimum of 5 years experience in web application development with PHP<p>* A minimum of 5 years experience with HTML, CSS, and JavaScript<p>* MVC framework experience<p>* Expertise with jQuery and Backbone<p>* Fluent with SQL<p>* Unit testing<p>* Comfortable with the command line<p>* Experience working with and building RESTful API’s<p>* Attention to detail<p>* Someone who is always learning new technologies and how to improve the ones they already use.<p>* Sense of humor, plays well with others<p>Even better if you have:<p>* Video experience<p>* Active interest in and regular contribution to the development community<p>* Experience managing Linux, Apache, and other server side services<p>* Experience with LESS CSS<p>* Mobile development experience","time":1341245309,"type":"comment"},{"by":"brookevd","id":4190291,"parent":4184755,"text":"San Francisco, CA (Union Square)  Fulltime.  H1Bs are gone for 2012...but if you're good we'll work to figure out something.<p>Justin.tv's TwitchTV is the largest video game broadcasting site in the world and growing FAST.  We are adding over a million users a month, and are looking for talented engineers looking to tackle challenging technical problems at SCALE.<p>Not only have we been growing exponentially (6 million unique visitors in June 2011 to 19 million in June 2012) our engagement has been growing even faster.  Each unique visitor now spends over 75 minutes on average on TwitchTV.<p>You can check out our jobs at twitch.tv/jobs which will give you an idea of the problems we're tackling, but in the end we are just looking for great engineers who we think will increase the quality of our technical discussions and work well with us.<p>Feel free to email me directly if you'd like to set up a time to chat and learn more.  brooke@twitch.tv","time":1341255099,"type":"comment"},{"by":"bentaber","id":4186132,"parent":4184755,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour.\nWe're looking for developers and engineers up and down the stack at all levels.","time":1341176652,"type":"comment"},{"by":"BraintreeR","id":4194124,"parent":4184755,"text":"Menlo Park, CA &#38; Chicago, IL<p>Braintree - FULL TIME Developers<p>Braintree helps businesses process credit card payments by providing a merchant account, payment gateway, recurring billing and credit card storage. We're unlike others in the industry; we think and do things differently.<p>Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node.js, PHP, Java, .NET, Perl, and Objective-C<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a>","time":1341324608,"type":"comment"},{"by":"wayne530","id":4185204,"parent":4184755,"text":"Revinate - San Francisco (Presidio), CA - Full Time - H1B/Resident/Citizen<p>We've built a social media monitoring platform for the hospitality industry that not only aggregates data from a multitude of sources but makes the data easy to consume and actionable. We're a small company (&#60; 30) with a fantastic culture of camaraderie and work/life balance, and we provide an ideal environment for everyone to work efficiently, contribute to the product roadmap and company goals, and most of all to grow. We offer very competitive salaries &#38; benefits, and have many great perks as well.<p>- Senior Operations Engineer\n- QA Engineer (black box)\n- Software Engineers (php/js)\n- Product Manager\n- User Interface Designer<p>For more information or if you're interested, please see <a href=\"http://www.revinate.com/jobs\" rel=\"nofollow\">http://www.revinate.com/jobs</a> or feel free to contact me via email wayne@revinate.com.","time":1341160018,"type":"comment"},{"by":"twp","id":4185576,"parent":4184755,"text":"Lausanne (Switzerland) or Chambéry (France). Full time.<p>Open source Javascript geospatial / web mapping developer. We do open source web mapping, contributing to projects like OpenLayers.<p><a href=\"http://www.camptocamp.com/en/careers/419-developpeur-javascript\" rel=\"nofollow\">http://www.camptocamp.com/en/careers/419-developpeur-javascr...</a>","time":1341165932,"type":"comment"},{"by":"lpolovets","id":4185466,"kids":[4185654],"parent":4184755,"text":"* We love Clojure programmers! *<p>Factual is hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai. Remote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our Palo Alto office recently opened so new hires would have a huge impact on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1341164196,"type":"comment"},{"by":"chauzer","id":4227379,"parent":4184755,"text":"New York, NY - Betterment (<a href=\"http://www.betterment.com\" rel=\"nofollow\">http://www.betterment.com</a>)<p>FULLTIME or INTERN<p>We're a VC funded tech startup simplifying investing and making it accessible to everyone. We're located in SoHo in NYC and launched at TechCrunch Disrupt in May 2010 and won for \"NYC's Biggest Disruptor\". You can also learn more about us by scanning through our press coverage: <a href=\"https://www.betterment.com/reviews/\" rel=\"nofollow\">https://www.betterment.com/reviews/</a><p>Main positions we're looking to fill are:<p>Software Engineers (Java/full stack/generalists): \n* Java, Spring, Hibernate, MySQL\nFrontend Engineers:\n* Javascript, JQuery, Flex, HTML5, Backbone\nMobile Engineers:\n* Android, iOS<p>Email edwin[at]betterment.com or see <a href=\"https://www.betterment.com/about/jobs/\" rel=\"nofollow\">https://www.betterment.com/about/jobs/</a> for more info","time":1341972711,"type":"comment"},{"by":"igurari","id":4185143,"parent":4184755,"text":"San Francisco (SOMA), CA - Full-time Engineers and Lawyers<p>Amicus Labs - <a href=\"http://www.amicuslabs.com\" rel=\"nofollow\">http://www.amicuslabs.com</a><p>We are mapping the legal genome. Using data mining, semantic analysis, machine learning and human computer interface technologies, we are extracting deep meaning from legal documents and creating the most powerful litigation tools in the world.<p>We are seeking both engineers with a strong interest in the law and lawyers with a background in programming.<p>Requirements for engineers: 3+ years of experience developing in Python, Django, and JavaScript (Java a plus). B.S. / B.A. in Computer Science or equivalent experience. Strong interest in U.S. law.<p>Requirements for lawyers: 2+ years in civil litigation. J.D. from a top 10 law school. B.S. / B.A. in Computer Science or equivalent experience.<p>Contact me if you are interested: itai@amicuslabs.com","time":1341158821,"type":"comment"},{"by":"timanglade","id":4185345,"parent":4184755,"text":"Apigee (Palo Alto, REMOTE, H1B) — Java Developers, Mobile Developers and Account Development Representatives<p>Apigee is the API company. We are helping thousands of developers build API-driven applications every day. Our technology powers the APIs of Netflix, X.com, GameSpy, ConstantContact, and hundreds of others. We are actively hiring for <a href=\"http://usergrid.com/\" rel=\"nofollow\">http://usergrid.com/</a>, our Mobile Backend-as-a-Service. Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is about to enter Public Beta. We are built on top of Jersey, Jackson and Cassandra (we gutted a lot of the latter and built our own indexing system, query system, storage format and multi-tenancy strategy on top of it).<p>We are looking for Java Developers to join our Core team and help us overcome the next generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>We are also looking for Mobile developers proficient in at least one of iOS, Android &#38; JavaScript+HTML5, who want to become an expert at all three, and help make it easier to write mobile apps without a backend team.<p>Finally, we are in need of extremely self-motivated individuals to join our team as Account Development Representatives. The Account Development Representative’s primary function is to put Apigee’s sales team in touch with the right people at the right companies. Your role would include: sales territory creation, basic company and prospect research, outbound calling, and introductory appointment setting.<p>We offered catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>Want to apply? Have some questions? Want to join but don’t match either position? Then get in touch; I joined them this year and I’m loving it ➝ tim@apigee.com","time":1341162272,"type":"comment"},{"by":"eliekh","id":4186044,"parent":4184755,"text":"San Francisco, CA. Full Time. <a href=\"http://www.woopra.com/\" rel=\"nofollow\">http://www.woopra.com/</a><p>Woopra is a leading live web analytics and customer engagement service. We have big plans and are looking to grow our team to keep up with our success. We’re building our company with smart, motivated innovators who are excited about the idea of being part of a San Francisco-based, rapidly growing startup.<p>We're based in SF, South of Market facing the Caltrain. We've  been growing very fast and looking to grow our team as well with talented people.<p>We're looking for a Front-End developer lead who has at least a few years of Javascript experience. You'd be leading the front-end UI development.<p>Show us what you've got and tell us what you're looking for.<p>elie@woopra.com or <a href=\"http://www.woopra.com/careers/\" rel=\"nofollow\">http://www.woopra.com/careers/</a>","time":1341174920,"type":"comment"},{"by":"ajohansson","id":4189605,"parent":4184755,"text":"London, UK, Full time<p>A rare opportunity for a Linux/C++/SQL developer to work at the leading edge of live video analytics and big data management!<p>Crowd Vision is an exciting early-stage London-based technology company with ambitious near-term growth plans. The company has a unique software product that automatically analyses crowded scenes from video feeds in real-time to provide actionable intelligence to a wide range of customers.The company is now investing in further developing and optimising the product. R&#38;D plans are in place and include optimisation of architecture, algorithms and user interfaces. In addition a new remote web-based service variant of the product (\"Cloud Vision\") is being designed, developed, tested and productised.<p>The company’s new Tech Hub, now being formed, will be led by the CTO (and the original developer of the software) and include a Hub Project Leader, a Software Developer, and other Technical Support staff focused on product management and technical support to sales and customers. The Tech Hub will be located in central London in a pleasant creative environment intended for tech businesses. There will also be the opportunity for some home/mobile working amongst the team. The Software Developer will be a key member of the Tech Hub and involved in several different projects that require coding skills and experience.<p>The job will be fulltime and based in London. There may be a need/opportunity to travel on a limited basis. The chosen candidate can start immediately if available.<p>The ideal candidate will have: \n• Excellent coding skills in C++ and SQL \n• Solid experience of working in a Linux environment \n• Experience of and/or keen interest in: video processing, data extraction algorithms, big data management, the cloud-based real-time environment, user interfaces \n• Experience of, and respect for, best practice software development standards<p>For more information / to apply:\n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=3314124\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=3314124</a>","time":1341247590,"type":"comment"},{"by":"abuggia","id":4197494,"parent":4184755,"text":"Boston, MA. Full Time\nRails Engineer<p>Localytics offers the most powerful app analytics platform available.  This is an opportunity to create features that will enable the largest app publishers in the world to create better, more valuable mobile applications.<p>As our posting ( <a href=\"http://www.localytics.com/jobs/#rails\" rel=\"nofollow\">http://www.localytics.com/jobs/#rails</a> ) states, we value passion and ability over experience.  If you've built web apps in different technologies and are interested in learning Rails, we'd love to hear from you.  We are considering candidates from a wide range of experience levels but expect the successful candidate to grow into a role that will have a significant impact on the direction of our product and technology.<p>Please send along links or resumes to jobs at localytics dot com.","time":1341373724,"type":"comment"},{"by":"DavidSch","id":4186113,"parent":4184755,"text":"Tomorrow evening we have a number London based companies attending our free event, they're looking for quality developers, see <a href=\"http://www.meetup.com/Find-A-tech-Job-In-London/events/69728542/\" rel=\"nofollow\">http://www.meetup.com/Find-A-tech-Job-In-London/events/69728...</a>","time":1341176310,"type":"comment"},{"by":"baruch","id":4187605,"parent":4184755,"text":"Herzliya (Glil Yam), Israel<p>XtremIO (recently acquired by EMC) is doing Flash-based Tier 1 storage devices that run into the millions of IOPS, We are looking for sharp C developers who'd like to us build the storage and the platform and make it a top notch product.<p>Besides C you need to posses a keen interest in making things great, have a thought about the end-user of the feature. Linux experience is a very important item, different levels of experience are acceptable.<p>We also need a software developer with a knack and interest in hardware to do hardware qualifications, you'll need to understand the hardware (SSDs mostly but also servers and the like) and write software to exercise the shit out of it, see where it fails and help us make sure we use good hardware to build the system.<p>Contact me at baruch.even@xtremio.com","time":1341210100,"type":"comment"},{"by":"jakemcgraw","id":4185112,"parent":4184755,"text":"New York, NY, Refinery29<p>Senior Software Engineer / API Platform<p>We’re looking for an experienced developer who’s seen it all and is ready to try their hand at improving our web application stack and provide tooling support for our growing engineering team. If you have a strong desire to automate, abstract, improve and document a rapidly expanding codebase consider this the opportunity of a lifetime. We need someone to continue refining our web application platform and help us grow.<p>Nice to haves:<p>* Worked with 50+ machine distributed application stacks.<p>* Worked with Varnish or Akamai or other major CDN.<p>* Designed a public API from scratch.<p>* Designed command line tools for automating and exposing common tasks.<p>Hit me up @jakemcgraw or email jake.mcgraw@refinery29.com<p>We're hiring for many positions, see <a href=\"http://the-rig.refinery29.com/jobs\" rel=\"nofollow\">http://the-rig.refinery29.com/jobs</a>","time":1341158245,"type":"comment"},{"by":"rosser","id":4185433,"parent":4184755,"text":"San Francisco, CA - Blurb<p>Blurb lets people tell their stories - currently through print-on-demand books, but increasingly through other venues.<p>We are both established and growing like mad (we were #47 on last year's Inc 500). We have a great group of people and a lot of fun challenges in the year ahead. We just launched a bevy of new products (our iPhone app is getting great reviews).<p>We play with fun tech: Ruby, Rails, ember.js, git, RSpec, Cucumber, Haml, SASS, RabbitMQ, Puppet, Obj-C, and more. We have great benefits, a great work/life balance, and we're in a great location close to the BART, CalTrain, and lots of food options.<p>We are currently hiring for many positions - front end, back end, QA and more - at all levels.<p><a href=\"http://www.blurb.com/about/jobs\" rel=\"nofollow\">http://www.blurb.com/about/jobs</a>","time":1341163723,"type":"comment"},{"by":"jasonchen913","id":4229784,"parent":4184755,"text":"New York, NY - Full Time Role \nFront-End / Web Application Architect (Java)<p>Premier apparel retailer seeks a candidate who is able to lead the architecture effort of a future state UI / Web application architecture that is capable of supporting the latest web development standards, frameworks and technologies as well as being able to integrate easily with best of breed third party applications to provide a flexible, loosely couple front-end architecture for our next generation web platform.<p>The job description can be found below.  If you are interested, please feel free to reach out to me.<p><a href=\"http://www.linkedin.com/jobs?jobId=3338083&#38;viewJob=&#38;trk=job_capjs\" rel=\"nofollow\">http://www.linkedin.com/jobs?jobId=3338083&#38;viewJob=&#38;...</a>","time":1342022416,"type":"comment"},{"by":"jack7890","id":4184864,"parent":4184755,"text":"New York, NY -- Fulltime -- SeatGeek<p>SeatGeek is the web's largest search engine for live event tickets. Think \"Kayak for sports/music/theater tickets.\"<p>Our dev team is currently eight people. We're looking to add one or two more. We're specialization-agnostic. Most of our current guys are pretty full stack, so wherever in the web stack you like to spend your time, we can find a place for you.<p>We're using lots of Python these days. A bit of Ruby and PHP too. And always plenty of JS, supported by backbone. Mongo and MySQL for data.<p>More details here: \n<a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>\n<a href=\"http://seatgeek.com/jobs/ui_developer/\" rel=\"nofollow\">http://seatgeek.com/jobs/ui_developer/</a>","time":1341154045,"type":"comment"},{"by":"martian","id":4188205,"parent":4184755,"text":"San Francisco<p>Software Engineer, Front-end and back-end engineers<p>Thumbtack is hiring awesome software engineers to transform the way services are bought and sold online. We're Amazon for services. A quarter of a million small businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. We're well on our way to being profitable and growing quickly.<p>Our team is young and passionate and dedicated to good engineering. We have extensive benefits, including a in-house chef, a gorgeous office in SOMA, and money to spend on Thumbtack services every month.<p>Our delicious food culture was recently the top story on Inc.com.<p>Apply at <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Or email chris at thumbtack with any questions.","time":1341224127,"type":"comment"},{"by":"aaronbenson","id":4185166,"kids":[4192080],"parent":4184755,"text":"Lightspeed Systems - Full Time - Bakersfield, CA<p>User Interface Designer / Front-end Web Developer<p>Lightspeed Systems is looking for a talented User Interface Designer/Front-end Web Developer to help in creating the user experience for our learning network, My Big Campus (<a href=\"http://mybigcampus.com\" rel=\"nofollow\">http://mybigcampus.com</a>). You will work with our UI director and team of developers to design and implement outstanding User Interfaces. You should be agile, love creatively building, quickly iterating and releasing great stuff in a casual, creative environment!<p><a href=\"http://www.lightspeedsystems.com/about/Careers/UI-Web-Developer.aspx\" rel=\"nofollow\">http://www.lightspeedsystems.com/about/Careers/UI-Web-Develo...</a>","time":1341159245,"type":"comment"},{"by":"mikek","id":4184855,"parent":4184755,"text":"Mountain View,CA\nKiwi Crate<p>Kiwi Crate is an innovative eCommerce company that sparks kids’ creativity and curiosity through offline and online materials and inspiration. We offer kids a delightful, engaging way to explore, create, and learn. We offer a subscription service that delivers curated hands-on projects to kids. We take great pride and ownership in the products we build and in the community of parents and kids we serve. We’re backed by leading investors and were named one of the \"20 Startups to Watch\" by Business Insider. Our offices are located in Mountain View, walking distance to the Caltrain station.<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1341153910,"type":"comment"},{"by":"aterreno","id":4184985,"parent":4184755,"text":"Camden Town, London, UK\nInvisibleHand\nSenior Developer<p>We are real-time price comparison in the browser.<p>With a little help from asyncronous ruby (Goliath), neo4j, mongodb, hadoop and javascript we've found over a billion dollars of savings for our users and won a stack of awards.<p>We ship over 27TB of data every month through AWS, process over 5 billion messages through our reporting system and average 4 million requests on our systems every day.<p>We are 6 hackers in Camden, London, looking for a seventh.<p><a href=\"http://forwardtechnology.co.uk/\" rel=\"nofollow\">http://forwardtechnology.co.uk/</a>\n<a href=\"http://careers.stackoverflow.com/employer/jobs/26878/listing\" rel=\"nofollow\">http://careers.stackoverflow.com/employer/jobs/26878/listing</a>","time":1341156051,"type":"comment"},{"by":"ivanzhao","id":4184978,"kids":[4185895],"parent":4184755,"text":"Inkling, San Francisco, CA<p>Inkling is a publishing startup. We are the future of books and publishing; our platform is so good that completely leaves ebooks in the dust, and even most major publishing houses are invested in us.<p>We are hiring engineers of all kinds, from the JavaScript/Python/Scala/iOS/sysadmin to interns. We are Sequoia-backed and just recently secured another round of $17 million funding.<p>The team is lean and flat. Located in the downtown SF right by the subway, TV-celebrity chef in house, the best gym in town, plus generous salary and options.<p><a href=\"http://www.inkling.com/jobs/openings/\" rel=\"nofollow\">http://www.inkling.com/jobs/openings/</a><p>Please contact annemarie@inkling.com directly if you are interested.","time":1341155875,"type":"comment"},{"by":"buymorechuck","id":4184790,"parent":4184755,"text":"Palo Alto, CA, USA - Flipboard<p>We're seeking web developers, data analysts, and backend service engineers with a passion for designing, crafting, and scaling things. (H1B)<p><a href=\"http://flipboard.com/jobs\" rel=\"nofollow\">http://flipboard.com/jobs</a> or get in touch with me.","time":1341152705,"type":"comment"},{"by":"noodle","id":4185544,"parent":4184755,"text":"Atlanta, GA and Los Angeles, CA -- Fullscreen<p>We're one of the top 5 Networks on YouTube (Nielson listed us as #4 recently), and we're looking for Javascript and Rails developers to expand our underlying technology platform.  We're looking to hire people both to create products from scratch as well as help polish existing ones.<p>We have job postings specific to individual cities, but we're honestly flexible in hiring anyone for any position at any office.  If you have a question about that, drop me an email.<p>For more details, check out <a href=\"http://fullscreen.theresumator.com/\" rel=\"nofollow\">http://fullscreen.theresumator.com/</a>  or email me directly at mitchell at fullscreen.net.","time":1341165399,"type":"comment"},{"by":"davvid","id":4185587,"parent":4184755,"text":"Burbank, CA - Walt Disney Animation Studios<p><i>We &#60;3 Linux, Python, and C++ experts!</i><p><a href=\"https://careers.disneyanimation.com/job_groups/\" rel=\"nofollow\">https://careers.disneyanimation.com/job_groups/</a><p>Contact me via github if you prefer to skip to the front of the line.","time":1341166158,"type":"comment"},{"by":"edmundhuber","id":4186370,"parent":4184755,"text":"San Francisco, CA, full time.<p>Threadflip ( <a href=\"http://www.threadflip.com\" rel=\"nofollow\">http://www.threadflip.com</a> ) is building a new way to discover, buy, and sell fashion.<p>We are looking for seasoned engineers to join our team of three. Our stack is Rails, Memcache, Redis, Postgres on top of AWS. Experience in these technologies is  a plus but we realize that great engineers will learn new tools.<p>We offer:\n* competitive pay and benefits,\n* an office located right off the N at the ballpark,\n* catered lunches and the usual startup perks.<p>We're looking forward to talking to you! Please send your resume and links to personal website or Github account to jobs@threadflip.com .","time":1341181829,"type":"comment"},{"by":"bluelu","id":4217189,"parent":4184755,"text":"Luxembourg, Europe, Fulltime<p>Trendiction - <a href=\"http://www.trendiction.com/\" rel=\"nofollow\">http://www.trendiction.com/</a><p>We are doing large scale crawling and analysis. We have both job openings for raw data crawling/analysis and the front end. It's up to you to chose what you like to do. Our offices are located at the heart of Luxembourg city.<p>We are searching more engineers to expand our team of engineers.<p><a href=\"http://blog.trendiction.com/2012/07/06/we-are-hiring-java-software-development-engineers/\" rel=\"nofollow\">http://blog.trendiction.com/2012/07/06/we-are-hiring-java-so...</a><p>If you have any questions, just contact me directly:\nt.britz@trendiction.com","time":1341821549,"type":"comment"},{"by":"onsports","id":4191336,"parent":4184755,"text":"San Francisco, CA. Full-time. H1B is fine.<p>OnSports is revolutionizing the sports world. We're a fast-growing, well backed startup and are focused on building social, design forward, mobile apps for the ever expansive sports market. The opportunity ahead of us is huge and we're looking for the right team members to join us.<p>We love what we do and we love what we are building. A challenging problem is what excites us.<p>We are looking for:\n* Lead Python/Django Developer\n* Lead Android Developer \n* Lead iOS Developer<p>Join us. Email jobs@onsports.com<p>Read more about us and our team at <a href=\"http://www.onsports.com/company/\" rel=\"nofollow\">http://www.onsports.com/company/</a>","time":1341267464,"type":"comment"},{"by":"sciurus","id":4184877,"parent":4184755,"text":"Athens, GA - Systems Administrator - <a href=\"http://jobs.eupathdb.org/\" rel=\"nofollow\">http://jobs.eupathdb.org/</a><p>At EuPathDB, we're providing scientists with online research tools to help them decipher parasites that infect hundreds of millions of people worldwide. We need a sysadmin with lots of linux knowledge, solid scripting skills, and a willingness to occasionally get hands-on with hardware. Languages and technologies in heavy use include apache, java, jenkins, libvirt/kvm, nagios, puppet, perl, rpm, tomcat, and just about every bioinformatics tool and relational database you can think of.","time":1341154344,"type":"comment"},{"by":"bgentry","id":4185734,"parent":4184755,"text":"San Francisco, CA<p>Heroku is hiring.<p>* CISO (Chief Information Security Officer)<p>* Senior Erlang Infrastructure Developer<p>* Routing Infrastructure Developer<p>* Platform Infrastructure Developer<p>* Billing Software Engineer<p>* Data Infrastructure Developer<p>* Front End Developer<p>* Cloud Platform Support Engineer<p>* Director of Developer Marketing, EMEA<p>* Product Marketing Manager<p>* Technical Marketing Manager<p>Heroku is an incredible place to work. We are owned by, but operate independently of, Salesforce.com.<p>Check out our lunch blog: <a href=\"http://starving-samurai-42.tumblr.com/\" rel=\"nofollow\">http://starving-samurai-42.tumblr.com/</a><p>Or some photos of our work environment: <a href=\"http://www.flickr.com/groups/heroku/pool/\" rel=\"nofollow\">http://www.flickr.com/groups/heroku/pool/</a><p><a href=\"http://jobs.heroku.com\" rel=\"nofollow\">http://jobs.heroku.com</a>","time":1341168677,"type":"comment"},{"by":"avar","id":4184999,"kids":[4200223],"parent":4184755,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there currently working on search and relocated over there about a year and a half ago, and have been very happy with it.<p>We have people from all over the world relocating to work with us and are very well set up to handle relocation and visa issues, most of the people working in IT are expats so we've got a lot of experience with bringing people in.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline (PCLN) group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.<p>We use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it. We're also very open to open sourcing code that doesn't contain any business logic, I've personally been involved in open sourcing a few of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and a few CPAN modules.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers. Everything we do is aimed at solving problems for our customers, if it doesn't help our customers we're not interested in doing it.\nYou don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before. The sort of people we'd like to hire are good technically, excellent at communication, and can acquire a good sense of how they fit into the big picture.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume, I've posted in a similar thread here a couple of times before and have already helped get one person hired, many others have had or are having interviews, and I've fielded a bunch of questions from would-be applicants. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent.","time":1341156328,"type":"comment"},{"by":"melissatrahan","id":4232514,"parent":4184755,"text":"San Francisco - full time<p>Massive Health is a small start-up of just 12 people that's based in SOMA, and combined our team has previously shipped products to over half a billion people. Led by Aza Raskin, we're using this consumer product expertise to improve healthcare by creating beautiful tools that deliver useful insights for getting and staying healthy. Currently looking for an iOS engineer, lead front-end developer and anyone who is passionate about progressing the science of health and health-related data.<p>Want to learn more? www.massivehealth.com/jobs or email melissa@massivehealth.com","time":1342057855,"type":"comment"},{"by":"mindotus","id":4187252,"parent":4184755,"text":"New York, NY<p><a href=\"http://minus.com/pages/jobs\" rel=\"nofollow\">http://minus.com/pages/jobs</a><p>Minus is hiring! We are on a mission to simplify sharing and to create the simplest universal sharing platform.\nWe are seeking tech fanatics, passionate enthusiasts and self-driven individuals in our New York City midtown office.\nPositions<p>We’re looking for full-time, part-time, and interns in the following areas:<p>★ Software engineering<p>Our stack is built on python, django, javascript, jquery, css, and html<p>★ Mobile development<p>iOS and Android developers experienced with deploying consumer apps<p>★ Design<p>Adobe PS, AI, CSS/JS and UX experience\n★ Linux server administration<p>We are fully deployed on AWS currently<p>★ Marketing (Interns only for this position)","time":1341201651,"type":"comment"},{"by":"fawyd","id":4234174,"parent":4184755,"text":"Bern (Flamatt) - Switzerland | Full Time | Scout24<p>Scout24 (<a href=\"http://www.scout24.ch\" rel=\"nofollow\">http://www.scout24.ch</a>) owns the biggest classified sites for cars, jobs and real estates in Switzerland. We are looking for an online marketing manager to join our marketing-team. Experience with Google AdWords, Google Analytics and a strong internet affinity is a plus. Check out <a href=\"http://www.jobscout24.ch/de/job/online-marketing-manager/2306433/\" rel=\"nofollow\">http://www.jobscout24.ch/de/job/online-marketing-manager/230...</a> for more information.","time":1342096109,"type":"comment"},{"by":"carbon8","id":4185679,"parent":4184755,"text":"San Francisco, CA.<p>Byliner Inc. is a publishing company and social network built around great stories. We are an online archive of long form journalism and fiction, as well as a publisher of original stories for iPad, Kindle, and other mobile devices.<p>We use Ruby, MySQL, Redis, Sass and are making the shift to using Backbone and CoffeeScript on the front-end. We also produce ebooks.<p>Looking for both UI and back-end developers. Full Time and/or contract.<p>Also starting to look for a designer for help with static HTML/CSS and graphics on a contract basis.<p>More info: <a href=\"http://byliner.com/jobs\" rel=\"nofollow\">http://byliner.com/jobs</a>","time":1341167646,"type":"comment"},{"by":"LifeAfterCubes","id":4201749,"parent":4184755,"text":"San Francisco or Los Angeles, CA. Full time - This Week In<p>Incredible opportunity for a Business Development / Sales Executive to help shape the future of independent media at the Web TV network ThisWeekIn.<p>Corporate cogs, this isn't the job for you. Fire-in-your-belly entrepreneurs, you'll fit right in.<p>== Responsibilities ==<p>* Drive online advertising sales; meet and exceed sales goals\n * Starting, negotiating, and closing strategic partnership deals\n * Develop strong contacts with agencies and directly with clients\n * Assist in identifying and executing revenue-enhancing strategic partnerships\n * Work with sales management to create strategies to develop new vertical markets\n * Prepare proposals and respond to RFP's quickly, and with a high degree of quality\n * Prepare insertion orders and negotiate contracts to satisfy both the company's and the client's best interests\n * Maintain a thorough understanding of online advertising trends and major initiatives<p>== Requirements ==<p>* Bachelors degree\n * One to five years of sales experience selling for trade shows, print, B2B and/or podcasting\n * Strong organizational skills and the ability to manage your own agenda while working closely with others in a cross-functional role\n * Proven track record of success, with quantifiable results in previous sales positions\n * Excellent written and verbal communication skills, including proposal generation and presentation\n * Desire to work in a team-based, entrepreneurial company\n * Please include a resume and cover letter detailing why you're the best candidate for this position.<p>== About Us ==<p>ThisWeekIn, Inc. is a web television network covering a wide variety of topics from tech to entertainment. Produced out of our Culver City studios, our web shows feature expert hosts and guests who are founders, celebs, comedians, technologists and CEO's -- all keeping you on the bleeding edge of their industries. This position can be based in the LA or San Francisco area.<p>== To Apply ==<p>Please apply via our online form: <a href=\"http://mahalo.theresumator.com/apply/iA1yj0/Techsavvy-Business-Development-Sales-Exec-For-Web-TV-Startup.html\" rel=\"nofollow\">http://mahalo.theresumator.com/apply/iA1yj0/Techsavvy-Busine...</a>.","time":1341462740,"type":"comment"},{"by":"magicpixelgames","id":4221906,"parent":4184755,"text":"Los Angeles, CA - Full Time, onsite positions.<p>Magic Pixel Games (<a href=\"http://www.magicpixelgames.com\" rel=\"nofollow\">http://www.magicpixelgames.com</a>) is a 2-year-old game development company building a team for a next-generation home console game.<p>We're looking for:<p>* An experienced Game Designer to help us build the UX and UI<p>* An experienced Network Programmer (game-side)<p>* An experienced Gameplay Programmer.<p>* An experienced Graphics Rendering engineer.<p>Please see our site at\n<a href=\"http://www.magicpixelgames.com/careers\" rel=\"nofollow\">http://www.magicpixelgames.com/careers</a> for details!","time":1341890222,"type":"comment"},{"by":"blo","id":4185348,"parent":4184755,"text":"San Francisco, CA (SOMA)- Full Time<p>JavaScript Engineers (Frontend, Backend, Search, Design) + Mobile (iOS)<p>Stealth - consumer web and mobile<p>--<p>We are a stealth, funded startup focused on improving how people fundamentally browse and interact with online services. We combine UX/UI innovation with data algorithms to allow users to accomplish tasks in a more usable, efficient, and social manner.<p>We work mainly with JS (jquery and node.js) and HTML5. Mobile developers should be familiar with iOS/Android.<p>Curious? Contact [my username] at alum.mit.edu. Including your portfolio is preferable!","time":1341162340,"type":"comment"},{"by":"sgrock","id":4185199,"parent":4184755,"text":"New Relic, Portland, Or<p>Ruby Instrumentation Engineer<p>New Relic is looking for a talented Ruby engineer to join a team developing what we call the Ruby Agent. The Ruby Agent is the instrumentation library that reports back to New Relic’s world-class application monitoring product.  You probably know it as the newrelic_rpm gem.<p>We’re a very fast growing pre-IPO start-up and we care about our culture.<p>We value:<p>* Work/Life Balance<p>* Respect<p>* Engineer Code Ownership<p>* Experimentation<p>We also have several other positions we're looking to fill.<p>Check out <a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a> for more details.","time":1341159917,"type":"comment"},{"by":"smellypantsman","id":4184975,"parent":4184755,"text":"Cambridge, UK<p>Web developer at <a href=\"http://AllYearbooks.co.uk\" rel=\"nofollow\">http://AllYearbooks.co.uk</a><p>We're looking for one or two talented full-stack developers to help us build our Node.js single-page collaborative, real-time web-app for creating real, hard-copy printed yearbooks.<p>You'll be using: Node.js, CoffeeScript, HTML5 canvas, Backbone.js, jQuery, Ubuntu servers, Redis, PostgreSQL etc.<p>More at: <a href=\"http://allyearbooks.co.uk/jobs/dev\" rel=\"nofollow\">http://allyearbooks.co.uk/jobs/dev</a> (including a fun little code test!)","time":1341155810,"type":"comment"},{"by":"dmpayton","id":4185494,"parent":4184755,"text":"San Diego, CA<p>Web Cube is a CMS+eCommerce platform that powers the website and online stores for a number of large well-known brands.<p><a href=\"http://www.webcubecms.com/our-company/clients/\" rel=\"nofollow\">http://www.webcubecms.com/our-company/clients/</a><p>We're looking for solid Python+Django developers to help grow our platform and take it to the next level.<p><a href=\"http://www.webcubecms.com/blog/2012/06/17/join-our-team-were-looking-software-developers-dja/\" rel=\"nofollow\">http://www.webcubecms.com/blog/2012/06/17/join-our-team-were...</a>","time":1341164585,"type":"comment"},{"by":"dtwhitney","id":4185547,"parent":4184755,"text":"Full Stack Web Developer in New York, NY<p>Pellucid Analytics is looking for several full-stack web developers in New York, NY to work with us on building our quantitative finance application. We're a JVM/Java/Scala shop, and you'll have the opportunity to work with the full TypeSafe Stack, focused mainly on The Play Framework, building both a standard browser based application as well as a mobile application for the iPad. We're an Agile/Lean shop, which means we're dedicated to lean principles throughout the company as a whole - there will be no struggle trying to sell these principles to management. Also if you've taken any of the advanced computer science courses through Stanford, like Machine Learning or Probabilistic Graphical Models, and you're interested in seeing how those are applied to the financial world, Pellucid Analytics is for you.<p>To give you a better idea of what you'll be working on, we're a quantitative financial analytics company called Pellucid Analytics. Our product is going to make it easy for a team of investment bankers to pull together a massive number of analytics and visualizations from our quantitative analysis, focused on either a specific company or industry, and arrange the data and visualizations into a presentation that fits the story they are trying to tell. Our clients engage with a different Fortune 500 company every day of the week where a different analytics presentation is needed. These presentations are put together by a small team and can be as large as 100 pages long, so the ease with which our analysis can be put together is our highest priority.<p>Experience Requirements<p>* 5+ years of JVM Development\n* A Desire to learn Scala and other JVM languages\n* 5+ years of Linux use\n* 5+ years of web development (HTML/CSS/JavaScript)\n* Experience with many varieties of databases, i.e. relational, non-relational, column-oriented, graph-based\n* Experience with git (our ideal candidate makes frequent, small commits)\n* Experience working with Amazon Web Services\n* Experience working with wireframes and comps\nExperience Pluses<p>* Bachelors Degree in Computer Science or a related field\n* Experience with Scala\n* Experience with the TypeSafe Stack\n* Experience with the Play Framework\n* Experience working with continuous deployment\n* Finance Experience<p>Please respond with a resume and links to previous work to jobs at pellucid dot com","time":1341165452,"type":"comment"},{"by":"aaronjg","id":4184832,"kids":[4186197,4204289],"parent":4184755,"text":"Brooklyn, NY Full Time<p>Custora (YC W11) is a customer analytics tool that helps retailers earn more from happier customers.<p>To be a little more specific, we can point to a single retail customer and paint a meaningful portrait with his data: How much he’ll spend, how often he'll make purchases, what types of products he's inclined to buy, his predicted likelihood of returning, and more. Custora also integrates with email marketing providers and customer support systems to fuel a seamless, iterative flow of insights to actions.<p>From Fab.com to Etsy, some of the fastest growing and respected names in retail are using Custora on a daily basis.<p>Who We’re Looking For<p>We’re looking for a developer to join our core team. Our web stack is Ruby on Rails, and our analytics are done in R. Experience with these technologies is a plus, but we’re open to sharp developers with experience building products for the web in general.<p>Where We Are<p>Location-wise, we’re in Brooklyn, NY. We love it. Progress-wise, we’re a YC company from Winter 2011. We’ve recently been featured in the New York Times, GigaOm and BetaKit, and in the last 2 months we’ve had more signups than in the previous 10.<p>Day to Day<p>Here’s a taste of what happened last month:<p>Aaron implemented a Dirichlet Latent Class Multinomial to power customer archetype analysis based on customer purchasing behavior.<p>Martin made dramatic improvements the email marketing part of the product. He made it easier for our clients to launch multiple email tests in parallel, and added four new email providers to our growing list of integrated partners.<p>Jon and David worked together to completely redesign the interface of the application. We moved from an interface that focused on browsing through dashboards to one that delivers answers to specific questions.<p>Outside the office, Corey and Dave manned a booth at a big e-retailer conference and developed a Blackjack-style Custora game to play with prospective clients.<p>What We Offer<p>Our compensation is competitive with anyone on the market. Since you’ll be a core member of the team, meaningful equity is part of the package. We offer comprehensive health coverage, including a dental and vision package. Lunches are paid for and we usually eat as a team. We do happy hours at least twice a month and play bocce ball competitively (sort of). Our vacation policy is based on trust — take what’s needed and keep the rest of the team up to speed.<p>Let’s Chat<p>If you’re interested, apply online at <a href=\"http://www.custora.com/careers\" rel=\"nofollow\">http://www.custora.com/careers</a>","time":1341153653,"type":"comment"},{"by":"drags","id":4185303,"parent":4184755,"text":"SF - Rails/JS - HALF-TIME-ISH :)<p>I've mentioned before that we have a couple of engineers who work half-time-ish (and do their own things the rest of the time) and it got some positive feedback: <a href=\"http://news.ycombinator.com/item?id=3850480\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3850480</a><p>We're ready to hire a couple more in this vein, so if it sounds interesting let me know!<p>=========<p>Advantages for you:<p>- you get 2-3 extra weekend days for fun and profit<p>- we provide health insurance and all that jazz<p>- if some weeks you don't have lots to do and want to work more, and other weeks you have lots to do and want to work less, we can be flexible<p>- we're profitable and growing! so if you decide \"wow I really love Verba and want to spend every waking moment there\" we can make that dream come true<p>Advantages for us:<p>- you have more time to learn new things, meet new people and generally be a friendlier, happier, more knowledgeable person in our workplace<p>- we can hire faster with less anxiety (instead of the \"gulp i just committed $100k/yr\" feeling, we have the \"smaller gulp i just committed $50k/yr\" feeling :)<p>- you get to be a part of what we're doing, we get to hear about all the cool stuff you're doing, and that can only lead to good things for both of us<p>Anyway, I've included our spiel and \"what we're looking for\" summary below, so shoot me an email if you're interested (ragalie@verbasoftware.com).<p>========<p>The college textbook market is currently being disrupted. Verba helps college bookstores transform themselves so that they a) understand and embrace the power of the nets, b) become agents of change in the textbook industry instead of agents of reaction and c) continue to make a healthy profit.<p>We're a B2B company working with just about 200 colleges and universities, and we're looking for people familiar with Ruby, Rails, MySQL and JS who can help us grow faster. We (thankfully) don't have too many scaling problems, but we have a ton of opportunities (product and partner-based) that we could move on much faster with a few more hands on deck. The ideal person has strong Rails knowledge, solid testing practices, a good head for architecture and knows enough JS to help out on front-end.<p>Be sure to check out our website (<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http://www.verbasoftware.com</a>) so you can read all about our current products and hear people say nice things about us.","time":1341161715,"type":"comment"},{"by":"weirdedhimself","id":4185389,"parent":4184755,"text":"Sumo Logic (Mountain View, REMOTE, H1B, INTERN)<p>We build a cloud based log management system, dealing with massive amounts of customer data in a highly scalable, distributed, elastic architecture.<p>Our app is almost fully JVM-based, mostly written in Scala. The frontend uses Backbone.js and JQuery.<p>Open positions include data science, platform/backend and cloud infrastructure. Check out the full details:<p><a href=\"http://www.sumologic.com/company/careers/\" rel=\"nofollow\">http://www.sumologic.com/company/careers/</a>","time":1341162914,"type":"comment"},{"by":"medwezys","id":4184942,"kids":[4199063],"parent":4184755,"text":"London (Mayfair), UK. AlphaSights is looking for a full-time web developer to join a cool and friendly dev team. We mainly use Ruby &#38; friends, more details: <a href=\"http://www.alphasights.com/ruby\" rel=\"nofollow\">http://www.alphasights.com/ruby</a><p>Also, we have a nice interactive code challenge in our application form! <a href=\"http://www.alphasights.com/apply/ruby-developer-london\" rel=\"nofollow\">http://www.alphasights.com/apply/ruby-developer-london</a>","time":1341155387,"type":"comment"},{"by":"birken","id":4185472,"parent":4184755,"text":"Software Engineer - San Francisco, CA - Thumbtack.com<p>We're looking for full time software engineers and mobile engineers.<p>Our delicious company food culture has been featured on Inc.com and inspires many Bay-area startups. We eat family style meals everyday cooked in-house by our gourmet chef.<p>We recently raised a Series A and are growing rapidly. Over 250,000 small businesses have already signed up.<p>We can offer visas if you live abroad and are willing to relocate.\nthumbtack.com/jobs or email dan at thumbtack.","time":1341164328,"type":"comment"},{"by":"jekor","id":4189752,"parent":4184755,"text":"REMOTE<p>deviantART (<a href=\"http://deviantart.theresumator.com/apply/tevH3P/DevOps-Engineer.html\" rel=\"nofollow\">http://deviantart.theresumator.com/apply/tevH3P/DevOps-Engin...</a>)<p>We're serious about the \"Dev\" part of DevOps. Don't apply unless you can show us some of your code. We're constantly building new tools and improving the way we administer our architecture.<p>We're a small, closely-knit, geographically distributed team, and we're looking for one more member.","time":1341249103,"type":"comment"},{"by":"steilpass","id":4201943,"parent":4184755,"text":"Agile Software Developers in Cologne, Germany.<p>Although we have been bought we still feel and work like a startup. We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://adkla.us\" rel=\"nofollow\">http://adkla.us</a>","time":1341468887,"type":"comment"},{"by":"kunalmodi","id":4185073,"parent":4184755,"text":"San Francisco, CA - Fulltime<p>Thirst Labs (thirst.co) is a well funded startup aiming to make consuming social media easier by using natural language technology to understand what is being said.<p>We are looking to fill 3 positions - iOS developer, Rails developer, and Natural Language/Data scientist.<p>We offer competitive salary and equity, benefits, a ton of food and drinks at the office, and a great working environment.<p>Email me at kunal @ thirstlabs.com if interested!","time":1341157606,"type":"comment"},{"by":"nextraq","id":4189304,"parent":4184755,"text":"Atlanta, GA - Full time - UI Developer<p>NexTraq is the next generation of GPS tracking and fleet management web-based solutions.<p>We need HTML5, CSS3, Javascript experts looking to make a huge difference in a small, thriving company. If the term \"responsive web design\" gets your juices flowing, then we want to talk to you!<p>Offering full benefits and competitive salary.<p>Interested? Drop us a line at [app-dev-jobs at nextraq.com] and be sure to mention HN.","time":1341243678,"type":"comment"},{"by":"leeny","id":4191154,"parent":4184755,"text":"TrialPay - Palo Alto, CA (F/T, will cover relo)<p>For the last 5 years, we've been quietly changing the world of online advertising. We work on getting users to try new products and services, install new mobile apps, play new games, and visit new stores by giving them stuff that they already want for free.<p>We're looking for strong back-end engineers and people who like playing with data (we have a lot).<p>aline@trialpay.com","time":1341265010,"type":"comment"},{"by":"CptMauli","id":4206974,"parent":4184755,"text":"Munich, Germany, Full Time (no remote)<p>TH4 SYSTEMS - <a href=\"http://www.th4-systems.com\" rel=\"nofollow\">http://www.th4-systems.com</a><p>We develop tank farm management software, solar farm SCADA systems and more.<p>We are looking for a versatile individual with a strong Java background. If you have any background in automation that would be a big plus (but it is no requirement).<p>You can drop me a line at jobs@th4-systems.com","time":1341565806,"type":"comment"},{"by":"aen1","id":4185592,"parent":4184755,"text":"Can I just say I love these threads? I got multiple interviews and an offer from a great company for an internship from one of them.","time":1341166226,"type":"comment"},{"by":"CodeforAmerica","id":4227228,"parent":4184755,"text":"San Francisco, CA\nCode for America Fellow (Developer)<p>Are you hacker with a huge heart? Code for America is looking for developers to join its 2013 fellowship.<p>In previous years men and women left companies such as Google, Apple, and Microsoft to use their skills to give back.<p>Cities are under greater pressure than ever, struggling with budget cuts and outdated technology. That’s why Code for America is connecting talented technologists with city governments to harness technology, and innovate. Code for America is helping cities keep pace with the communities they serve by creating and implementing new applications and by demonstrating new ways of resolving local challenges. We’re making cities better, and you can help.<p>Join the “Peace Corps for Geeks.”<p>Code for America is now accepting applications for its 2013 fellowship program. If you want to write code while making a difference, this is your opportunity to build apps that will make city governments work better.<p>Why Become a CfA Fellow?\nDuring the 11-month program, you will not only receive a living-wage stipend, travel expenses, and healthcare, but also the training and mentorship to be a leader in business, local government, or both. You'll get:<p>Gov 2.0 Training\nYou will start with a crash course in municipal government and gain practical understanding of the vital intersection of government and technology.<p>Connections \nThe biggest names in the tech industry and the Gov 2.0 movement will provide you with unparalleled networking, mentoring, and support.<p>Professional Development\nWorking closely with other talented individuals, you will develop lasting relationships and learn new skills and language in a fast-paced, startup atmosphere.<p>The Code\nNot only do you decide what language to write in, or what technology to use, it’s all open source, and you’ll be contributing to non-profit GitHub repos.<p>A Labor of Love\nYou’ll not only accomplish a lot and make the world a better place, but you’ll have a lot of fun working with other passionate people. To borrow a line from the Peace Corps, it will be the toughest job you’ll ever love.<p>Code for America fellows are an elite group of individuals using their skills to make a difference.<p>Applications are due July 29, 2012. See codeforamerica.org/fellows for more information.<p>Apply online at: codeforamerica.org/fellows/apply","time":1341969915,"type":"comment"},{"deleted":true,"id":4189046,"parent":4184755,"time":1341240019,"type":"comment"},{"by":"crabasa","id":4185976,"parent":4184755,"text":"San Francisco, Full-time<p>Twilio has several openings on the core engineering team. Our platform is built on a polyglot of technologies, so we're looking for well-rounded developers who are interested in helping to build the next, great global communications platform.<p>A full list can be seen here:<p><a href=\"http://twilio.jobscore.com/list\" rel=\"nofollow\">http://twilio.jobscore.com/list</a>","time":1341173331,"type":"comment"},{"by":"rsaarelm","id":4185048,"parent":4184755,"text":"Helsinki, Finland<p>Umbra Software is looking for C++ programmers to work on computational geometry middleware for AAA video games. There are currently open positions for a graphics programmer, a QA engineer and an infrastructure programmer.<p><a href=\"http://www.umbrasoftware.com/en/company-new/jobs/\" rel=\"nofollow\">http://www.umbrasoftware.com/en/company-new/jobs/</a>","time":1341157256,"type":"comment"},{"by":"almog","id":4186292,"parent":4184755,"text":"Tel Aviv, Israel<p>Us: a profitable Ruby/SASS/Coffeescript shop that try to make online payment suck less.<p>You: a seasoned developer with experience in the above technologies (or: one that's interested in learning them).<p>For more details, contact me at almog.tunel [at] gmail; Please include your CV, github, stackexchange and links to projects or anything awesome you've done.","time":1341179978,"type":"comment"},{"by":"jefbell","id":4191823,"parent":4184755,"text":"Portland, OR.  Full time or short term.<p>Galois is looking for functional programmers, formal methods practitioners, and project leads, interested in either short term or permanent employment.  For more information, see: <a href=\"http://corp.galois.com/careers\" rel=\"nofollow\">http://corp.galois.com/careers</a>","time":1341275334,"type":"comment"},{"by":"caseyf","id":4221170,"parent":4184755,"text":"(Boston or remote)<p>We're hiring a developer at Ravelry.<p>The site has 2 million+ registered users and a healthy amount of traffic but we're a small staff of 4 - you'd be the second developer and you'd work on anything and everything.<p>The catch - you have to be a knitter or crocheter.<p><a href=\"http://ravelry.com/jobs\" rel=\"nofollow\">http://ravelry.com/jobs</a>","time":1341876678,"type":"comment"},{"by":"ryguytilidie","id":4185157,"parent":4184755,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>It's widely held that science is too closed, and too slow. We are trying to change that. We believe that faster sharing of research will lead to an acceleration in research innovation: faster innovation in medicine, biology, engineering, economics, and other fields. Faster sharing in biology and medicine, for example, could lead to cancer being solved 12 months before it otherwise would have been, which would lead to millions of lives being saved.<p>Academia.edu has over 1.3 million registered users, and over 3.7 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,000 academics join each day.<p>We need talented engineers to come and help us accelerate the world's research. We believe that there is a chance to make a big impact.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We have a strong engineering culture. We're a 10 person team based in downtown San Francisco. The site is Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture. There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1341159141,"type":"comment"},{"by":"tlianza","id":4186253,"parent":4184755,"text":"Seattle, WA - Zooppa.com.  Looking for Senior Developer / CTO on a startup that deals in user-submitted videos for contests.  Full stack Rails development.  More info here: <a href=\"http://bit.ly/ZooppaSeniorDev\" rel=\"nofollow\">http://bit.ly/ZooppaSeniorDev</a>","time":1341178963,"type":"comment"},{"by":"_crazed","id":4185600,"parent":4184755,"text":"New York City, Full Time.<p>\"DevOps Engineer\"\n<a href=\"http://www.shutterstock.com/jobs.mhtml?jvi=o1z3Vfwi,Job\" rel=\"nofollow\">http://www.shutterstock.com/jobs.mhtml?jvi=o1z3Vfwi,Job</a><p>If you want to subvert the normal channels (preferred), then just contact me directly via github.com/crazed.","time":1341166344,"type":"comment"},{"by":"gregwebs","id":4184825,"parent":4184755,"text":"Los Altos, CA (near San Antonio Cal Train stop). Full time or contract, remote if you are highly proficient in the skills required (Javascript &#38; CSS).<p>Build the UI for social/interactive TV: <a href=\"http://tunein.yap.tv/jobs\" rel=\"nofollow\">http://tunein.yap.tv/jobs</a>","time":1341153540,"type":"comment"},{"by":"blkcmb","id":4186007,"parent":4184755,"text":"Full-time in Vancouver, BC, Canada<p>Build games for work. Join a small, well-funded team building a cross-platform mobile game engine and fun game titles. Hiring great, passionate people across the board:<p>- Engineering (Backbone.JS, HTML5, Ruby, Node.JS)\n- Game Design\n- Analytics\n- Marketing<p>jobs@blkcmb.com","time":1341174014,"type":"comment"},{"by":"ViktorasJucikas","id":4185455,"parent":4184755,"text":"London, UK - full time<p>YPlan - early team - Generalist Developers<p>Want to be one of the first members of a ground-breaking mobile commerce startup? Join YPlan, a pre-launch stealth startup backed by venture capital and angel investors (unannounced) who helped build the world's most loved mobile, consumer and social companies.<p>At YPlan, we are grabbing a huge, inefficient industry and flipping it on its head through a mobile-only approach. We obsess about simplicity, beauty, great consumer experience and build amazing products by questioning the standard way of doing things. We are looking for an outstanding technology leader who lives and breathes mobile, builds stuff that “just (somehow) works”, genuinely loves to code, and shares our passion for excellence and changing the world for the better.<p>What you'll do:<p>* Develop category defining mobile apps for iOS and Android.\n* Build out and maintain backend systems for data management and analytics.\n* Build a frictionless mobile payment experience for our users.\n* Improve our machine learning technology to aid content discovery and targeting.\n* Implement social integration and sharing.<p>We are looking for Mobile Application Engineers and Backend Engineers who are/have:<p>* Passionate and enthusiastic about changing the world.\n* Have attention to detail and relentless drive for quality.\n* Independent and product-focused, able to work both independently and in larger teams.\n* Passion for maintainable, extensible, testable, and reusable code as well as fast iteration.\nSolid understanding of data structures and algorithms.\n* University degree in Computer Science or related discipline preferred.\n* For Mobile Application Engineers, expert knowledge of iOS SDK/Objective C or Android SDK/Java is a must-have. Interface design expertise and ability to work with UI designers much wanted.\n* For Backend Engineers, experience with high performance, scalable, mission-critical applications, recommendation systems and payment systems prized. Python fluency required, experience with Java or other JVM languages would be an advantage.<p>Remuneration:\nVery attractive including stock options.<p>Location:\nCentral London<p>Why us:\nBe one of the first YPlan team members! You'll have a say in all parts of the company and get to shape our culture and development methodologies. We advocate data-driven decision making, put product quality first, promote open culture and flat hierarchy. You’ll be joining a small team of hard-charging people, who have built and worked with tech startups in the past and are committed to building excellent products.<p>To apply:\nDrop me a line to viktoras@yplanapp.com and let's chat!","time":1341164051,"type":"comment"},{"by":"nfriedly","id":4185763,"parent":4184755,"text":"San Francisco, CA<p>Sociable Labs could use another JS developer. I'll be in Portland for nodeconf through the 4th if you'd like to talk to me about it (company sponsored ;)<p><a href=\"http://sociablelabs.com\" rel=\"nofollow\">http://sociablelabs.com</a><p>nathan@&#60;company site&#62;","time":1341169443,"type":"comment"},{"by":"jbilger","id":4185556,"parent":4184755,"text":"Seattle, WA. Amazon applied machine learning and personalization team<p>I'm always looking for exceptional software developers to join my personalization teams at Amazon:<p><a href=\"http://tinyurl.com/7brqn9n\" rel=\"nofollow\">http://tinyurl.com/7brqn9n</a>","time":1341165598,"type":"comment"},{"by":"nik_peluchetti","id":4185010,"parent":4184755,"text":"At then.ly we are building the best event software on the web and  are looking for PHP / Wordpress Senior Developer working from remote<p><a href=\"http://theseednetwork.com/jobs/\" rel=\"nofollow\">http://theseednetwork.com/jobs/</a>","time":1341156488,"type":"comment"},{"by":"bensummers","id":4184786,"kids":[4184857,4225522,4225530],"parent":4184755,"text":"London, UK. Full time<p>Software craftsman required. Expertise in JavaScript and web development essential.<p>Could you be employee #1? We're looking for a brilliant developer to join two busy co-founders to help take the product and company to the next level.<p>== About you ==<p>You're passionate about producing beautiful, elegant code. You want to work in a company where quality counts, not just out of professional pride, but because great code makes for robust products, rapid development, and a beautiful user experience.<p>You've got a keen interest in security and take it into account in every piece of code you write. You graduated from a good university with a numerate degree, and have developed software in a commercial environment.<p>== About us ==<p>ONEIS solves complicated information management problems for information intensive small and medium organisations.<p>What does that mean? Each of our clients faces a different problem in how to manage the information in their business. Our current clients include consultancies, private health, insurance, training, and a tax information provider. Standard small business tools aren't good enough, but the large enterprise solutions are overkill and user-hostile. We work with our clients to design a customised solution built on our core information management platform, and host their data ongoing.<p>We launched to our first clients three years ago and have steadily built an enthusiastic user base. We're a bootstrapped company, funded entirely by revenue from our clients. With no investors, we can focus solely on producing a great product for happy clients.<p>ONEIS is a collaboration between myself, a developer, and my co-founder, an Information Architect. We've used her expertise to radically rethink how digital information should be managed, and our client satisfaction shows we got it right.<p>== About the role ==<p>You'll start by building server-side JavaScript plugins to implement custom features for our clients. These are quick to write, so you'll work on lots of interesting and varied projects from the start.<p>When you're happy with that, your responsibilities will expand. This will be a bit of everything from developing the core Platform to a spot of systems admin. You may not be familiar with the full stack yet, but you'll be keen to learn it all in a fast-paced environment.<p>== More info ==<p>* We primarily use JavaScript (Rhino interpreter), JRuby and PostgreSQL, and develop on Mac OS X.<p>* Documentation for our JavaScript API: <a href=\"http://docs.oneis.co.uk/dev/plugin\" rel=\"nofollow\">http://docs.oneis.co.uk/dev/plugin</a><p>* Some of our clients talking about the system: <a href=\"http://www.oneis.co.uk/openday\" rel=\"nofollow\">http://www.oneis.co.uk/openday</a><p>* Our jobs page: <a href=\"http://www.oneis.co.uk/jobs\" rel=\"nofollow\">http://www.oneis.co.uk/jobs</a><p>My contact details are in my profile. Send me your CV and an example of code you've written!","time":1341152563,"type":"comment"},{"by":"rms","id":4202518,"parent":4184755,"text":"Berkeley/San Francisco.<p>Singularity Institute, hiring a Communications Director. <a href=\"http://singularity.org/communications-director/\" rel=\"nofollow\">http://singularity.org/communications-director/</a>","time":1341485818,"type":"comment"},{"by":"dawson","id":4207652,"parent":4184755,"text":"London, UK. Full time<p>Ruby on Rails Developer\n<a href=\"http://careers.stackoverflow.com/employer/jobs/29111/listing\" rel=\"nofollow\">http://careers.stackoverflow.com/employer/jobs/29111/listing</a>","time":1341582447,"type":"comment"},{"by":"caroline_leung","id":4185281,"parent":4184755,"text":"BranchOut, San Francisco, Soma<p>FULL TIME software engineer (Backend, Frontend, DB, Search, Mobile)<p><a href=\"http://business.branchout.com/about-jobs\" rel=\"nofollow\">http://business.branchout.com/about-jobs</a>","time":1341161318,"type":"comment"},{"by":"devrim","id":4185081,"parent":4184755,"text":"Koding.com, SOMA, SF<p>We want to date, not hire.<p><a href=\"http://blog.koding.com/2012/06/we-want-to-date-not-hire/\" rel=\"nofollow\">http://blog.koding.com/2012/06/we-want-to-date-not-hire/</a>","time":1341157731,"type":"comment"},{"by":"dawson","id":4214522,"parent":4184755,"text":"London, UK. Full time<p>Front-End Developer\n<a href=\"https://en-gb.howareyou.com/jobs/frontend.html\" rel=\"nofollow\">https://en-gb.howareyou.com/jobs/frontend.html</a>","time":1341754344,"type":"comment"},{"by":"dawson","id":4202692,"parent":4184755,"text":"London, UK. Fulltime UI/UX Designer<p><a href=\"https://en-gb.howareyou.com/jobs/uiux.html\" rel=\"nofollow\">https://en-gb.howareyou.com/jobs/uiux.html</a>","time":1341490075,"type":"comment"},{"by":"dawson","id":4202244,"parent":4184755,"text":"London, UK. Fulltime UI/UX Designer<p><a href=\"https://en-gb.howareyou.com/jobs/uiux.html\" rel=\"nofollow\">https://en-gb.howareyou.com/jobs/uiux.html</a>","time":1341477771,"type":"comment"},{"by":"logn","id":4201888,"parent":4184755,"text":"shi.CR/AY is looking to be the future of online shopping: goods, equity, services.  Join us as employee #2 and work in the downtown LA office.  Must know Java or be willing to learn (all experience levels including unexperienced high shool grads are considered).  Pay is equity only until there's enough money.  dan ----&#62;a.t.&#60;----- shicray.org","time":1341467485,"type":"comment"},{"by":"lizfogcreek","id":4189061,"parent":4184755,"text":"New York, NY. Full Time. Fog Creek Software<p>System Administrator<p>Fog Creek Software is looking for experienced, unstoppable Systems Administrators. On our team, you'll work with top-notch developers and support engineers on the infrastructure behind our SaaS applications like FogBugz On Demand, Kiln, and Trello. You'll build tools and automation that will run the environment while you sip lattes. You'll help tune the infrastructure and help plan for future growth.<p>Requirements<p>At least five years of computing experience. You know the terrain, you know you love it, and you can't stop bragging about it.\nYou have a solid grasp of the programing tools at your disposal and know when to use each one.\nWorking experience with configuration management (Puppet/Chef/CFEngine) and monitoring (Ganglia/Nagios) systems.\nComfortable owning the infrastructure and pragmatically solving problems dealing with complex systems, even when the only error messages are in hex and you're at the far end of a 1200 baud telnet link.\nAt ease wearing lots of hats in a heterogeneous environment. Working with web servers &#38; databases, Windows and Unix, hardware and software.\nExcellent command of written and spoken English.\nPermanent legal right to work in the US (includes TN status).\nWilling to work in our New York City office. No telecommuting.\nBenefits<p>Competitive salary\nFree gym membership\nFree MetroCard\nFree lunch\nFree soft drinks and snacks\nFree DIY lattes\nComprehensive health insurance plan\n401(k) retirement plan with matching\nGenerous parental leave policy\nFlextime\nFour weeks paid vacation\nAll-expense-paid technical conferences\nTo apply, email us at jobs@fogcreek.com, attaching a current resume in HTML, Word, Plain Text, or PDF format. In the body of the email describe how you fit our first five requirements. Your application will be read by a real, live Systems Engineer, so please eschew the non-technical fluff in favor of serious details.<p>About Fog Creek Software<p>Fog Creek Software is a small, entrepreneurial software company in New York City founded in 2000. Our key products are FogBugz, Kiln and Copilot; all three have been very successful. We bootstrapped ourselves without outside investment and have been profitable from the beginning.<p>Fog Creek Software, Inc. does not discriminate in employment matters on the basis of race, color, religion, gender, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, disability, or any other protected class. We support workplace diversity.<p>More Information Here: <a href=\"http://www.fogcreek.com/careers.html\" rel=\"nofollow\">http://www.fogcreek.com/careers.html</a>","time":1341240188,"type":"comment"},{"by":"tluyben2","id":4184988,"parent":4184755,"text":"Faro, Portugal, Full time<p>Experienced frontend (HTML5), Objective-C and/or Java (Android).<p>Interns and/or juniors also welcome to apply. Check my HN profile!","time":1341156108,"type":"comment"},{"by":"talonx","id":4192585,"parent":4184755,"text":"Hyderabad, India. Full time.<p>Details - <a href=\"http://jobs.hasgeek.com/view/tvu8t\" rel=\"nofollow\">http://jobs.hasgeek.com/view/tvu8t</a>","time":1341291170,"type":"comment"},{"by":"dawson","id":4207417,"parent":4184755,"text":"Remote, immediate start.<p>CSS3 IE7/8 Cross-Browser Compatibility one-off project.","time":1341577185,"type":"comment"},{"by":"sharksandwich","id":4184903,"parent":4184755,"text":"ecoScorecard - Atlanta, Ga<p>We're looking for excellent Rails developers to help us improve sustainable building. Email stuart at ecoscorecard dot com","time":1341154788,"type":"comment"},{"by":"sbisker","id":4186116,"kids":[4186826],"parent":4184755,"text":"[These positions are for our new San Francisco office in Lower Nob Hill. We're also happy to announce a $4M Series A from the likes of General Catalyst, SV Angel, Lowercase Capital and Lightbank, to name a few. <a href=\"http://techcrunch.com/2012/04/23/data-focused-locu-raises-4m..\" rel=\"nofollow\">http://techcrunch.com/2012/04/23/data-focused-locu-raises-4m...</a>. -sbisker]<p>San Francisco, CA - Senior Full Time Software Engineers at Locu (<a href=\"http://www.locu.com\" rel=\"nofollow\">http://www.locu.com</a>)<p>We're looking for all sorts - front-enders, \"desingineers\", back-enders and full-stack all welcome for this position. As long as you enjoy hacking on cool new products and features. :D<p>For Back-End<p># Deep understanding of algorithms and complexity\n# Strong linux system administration experience a plus\n# AWS expertise a plus<p>For Front-End<p># Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills\n# Experience with Python / Django is a plus\n# Previous experience building rich, interactive websites\n# A good sense of design and/or an ability to work with designers\n# Experience in designing dashboards and user interfaces is a plus\n# Experience in proper UI engineering and reusable architectures a plus (proper use of prototypes in Javascript, experience with Backbone, and what have you.)<p>For Full-Stack and Desingineers<p># We know you like to strike your own unique balance. So, show us what you've got. We want you to be able to do what you love. :)<p>For all<p># Ideally 4+ years of experience\n# Experience leading or managing an engineering team a plus - we'll give you a chance to mentor and grow as an leader.\n# Exceptional software engineering talent\n# Previous start-up experience is a plus<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We are about to launch MenuPlatform &#60;<a href=\"http://www.menuplatform.com&#62;\" rel=\"nofollow\">http://www.menuplatform.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>Interested? Drop us a line at jobs@locu.com. Please specify which position you're applying for, as well as \"HN\", in the subject of your letter. Learn more about our open positions at <a href=\"http://www.locu.com/#Jobs\" rel=\"nofollow\">http://www.locu.com/#Jobs</a><p>-------------------------------------<p>Founded less than a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best angel investors in the country.<p>We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 10 people with very diverse backgrounds, and growing.","time":1341176346,"type":"comment"},{"by":"cdolan","id":4218056,"parent":4184755,"text":"Pittsburgh, PA, Fulltime, Telecommute<p>Software Engineer - Startup - Sequoia Waste Solutions | www.sequoiawaste.com<p>We want to find an emerging technical developer who can contribute to a venture-backed, self-sustaining startup; someone who can sling code with the best of them but wants broader scope and wants to make an impact — a really big impact.<p>You: ambitious, technical, and adept at managing both the technology and the puzzle pieces behind it. You’ll work with the company leadership on a regular basis, and help refine and expand the company roadmap. Also, be ready to hone your inner air-hockey self.<p>You’ll play a big part in creating and executing the company’s engineering and product roadmaps as well. Just as important, you’ll help define the engineering culture of the company and help us change the world by making waste more efficient. How often do you get to do that?<p>Compensation:<p>We pay competitive salaries, and have bonuses for hitting and beating deadlines. Your compensation will largely be dependent upon experience and skill set. Perhaps most importantly, we offer you the opportunity to gain experience and the chance to substantially change the world by properly merging the waste services industry with cutting-edge technology. Ours is a culture of creating quality products and delivering exceptional service while we disrupt an aging industry model. If you fit that mold, please apply.<p>Requirements &#38; Qualifications:<p>A solid engineer with proven experience, preferably in PHP and/or Ruby\nSome experience with: MySQL, SQL Server, JavaScript, Windows Server\nHave extensive experience with web services\nResourceful, practical and critical thinker.\nBe thorough, have good attention to detail, and display a high level of accuracy\nHigh stress tolerance\nGood team player and fast learner\nSelf-motivated and organized.\nGood communication skills, able to bring forward a vision or opinion.\nA good sense of humor\nBonus: Previous involvement (or outright failure!) at a startup\nWe would like you to be enthusiastic about working here. If this were just a job, we would work for the government. We are willing to accept constructive criticism and make changes, we expect you to do the same. We anticipate that you would be eager to fill a critical and respected role in a startup packed with dedicated and driven people.  We hire people who finish what they start and who are looking for new challenges. Tell us why you would flourish here.<p>Perks:<p>• Quiet working conditions<p>• Competitive Benefits<p>• Suburban Office location (escape city taxes!)<p>• Weekly company ‘get togethers’ and events<p>• Everyone has a solid Cherry desk, Aeron Chair, and 2011/2012 iMacs /w maxed specs, etc.<p>• Full access to a techie’s playground (Our sister company is a full fledged SAS-70 data center for the Pittsburgh/Northeast areas)<p>About Sequoia<p>Sequoia is a Pittsburgh based startup, that is redefining how waste and recycling is handled in the corporate enviornment. Every day, businesses overpay on their waste hauling, due to drastic inefficies in the industry. At Sequoia, we collect, analyze, and present data in a manner that helps us create client-specific plans that reduce trash headed for landfills, and increase recycling. We are closing in on our first year of operation, and are always looking for new and exciting ways to handle and report the awesome data we're collecting. With your help, we'll redesign the waste industry, and reduce the amount of trash heading to landfills. We call it \"saving the world, one line of code at a time\"!","time":1341840930,"type":"comment"},{"by":"johnkoscielak","id":4195054,"parent":4184755,"text":"FIS Global is currently recruiting for a Security Developer<p>FIS is one of the world's top-ranked technology providers to the banking industry. With more than 30,000 experts in 100 countries, FIS delivers the most comprehensive range of solutions for the broadest range of financial markets, all with a singular focus: helping you succeed. Every FIS solution has the strength you need for profitability today, and the power to help you manage whatever comes next.\nFIS is part of the S&#38;P 500. FIS has also been named the number one overall financial technology provider in the world by American Banker and Financial Insights (FinTech 100). \nJob summary:<p>Us: The Architecture Oversight and Framework &#38; Standards teams at FIS; the world's largest global provider dedicated to banking and payments technologies.<p>You: Security developer<p>Job: Work with a talented team of developers and architects to assist with ongoing work related to emerging threats. This is a hands-on position which will focus on implementation of specific security initiatives across the enterprise.<p>General duties and responsibilities:\n• Driving proof of concept, pilot, and implementation support activities for specified initiatives.\n• Researches, tracks and understands new technologies to provide technical leadership in developing service applications and analyzing business requirements as they pertain to intranet and external Internet-based systems.\n• Work with product teams on critical remediation activities\n• Builds applications and framework components\n• Builds custom rules for security code analyzer\n• Provides written design documents, test plans and test results.\n• Manages, develops, integrates and implements related applications components, including front-end development, server-side development and database integration.\n• Plays a direct role in programming, maintenance, technical support, documentation and administration of the applications.\n• Establishes and communicates standards to manage cost and ensure continuity of applications.\n• Suggests technical alternatives and improves/streamlines processes and systems\n• Completes project assignments and special projects commensurate with job expectations\n• Conducts planning, analysis and forecasting activities to plan projects and tasks\n• Performs other related duties as assigned.<p>Requirements:\nBachelor's degree in Computer Science, Engineering or a related discipline; or equivalent combination of education and experience that is required for the specific job level. Post-graduate education is desired.<p>Primary Location US-PA-Malvern PA\nOther Locations US-WI-Milwaukee WI, US-AR-Little Rock AR<p>ADA Disclaimer:  In developing this job description care was taken to include all competencies needed to successfully perform in this position.  However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation.  All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.<p>EEO/AA Employer<p>Please email resumes to john.koscielak@fisglobal.com","time":1341335688,"type":"comment"},{"by":"cybernytrix","dead":true,"id":4187016,"parent":4184755,"text":"SF, H1B ok\nAbout us:\nLiveMagic is a well-funded team of hackers and entrepreneurs that are changing the way people watch TV. Delivering a personalized, mobile app/service for viewing and sharing “best of” TV moments. In addition to representing a ground floor business opportunity, LiveMagic’s system and app platforms present interesting and substantial UX, big data and system engineering challenges.<p>Very strong, iPhone Engineer with experience designing and implementing video streaming and social network features.<p>5+ years of hands on development, with 3+ years in: iOS | ObjC | C++ | Xcode<p>Proficient System skills: Building mobile applications with at least one published app in the iTunes store or enterprise app. Experience working with Code Media, Core Audio, Facebook &#38; Twitter libraries and frameworks.<p>This is a chance to be a core member of the technical team where you can set many of the design standards as we grow this high-quality engineering team. The business has explosive potential and the stakes are high. Your ability to manage the technical trade-offs of design, development and go-to-market will be critical to our success. If you can get excited about the idea of changing how millions of people “watch” TV and thrive in this type of early-stage environment we would like to hear from you.<p>For your hard work, you will be rewarded with strong base salary, early stock options, PTO and Full Benefits. Above all, we offer the opportunity to do the best work of your career. We are currently interviewing candidates. Please send us a note at jobs@livemagic.tv and include your LinkedIn, GitHub, and/or any project pages.","time":1341196764,"type":"comment"},{"by":"anishkej","dead":true,"id":4205672,"parent":4184755,"text":"San Francisco / Redwood City, CA. Full Time<p>Station X is a start-up developing software to extract meaning from mountains of genomic data and make the results accessible to biomedical scientists and clinicians.  The goal is to change the face of clinical research and health care.  We are founded and backed by an ace team of genomics scientists and business people, and have just raised our second round of funding.    We are looking for both the skills and attributes needed to expand and complete our team.<p>We are seeking highly motivated and talented software developers, statisticians, IT/DevOps people, and SQA engineers who love to use bits and pixels to provide insight into the structure and meaning of data.  If you have an interest in building innovative software to store, analyze, and visualize hundreds, thousands, and millions of genomes within seconds, drop us a line.<p>We are currently located in Redwood City, and are starting to look for office space in SF.\n<a href=\"http://stationxinc.com/Station_X/Careers.html\" rel=\"nofollow\">http://stationxinc.com/Station_X/Careers.html</a>","time":1341533254,"type":"comment"},{"by":"mikebabineau","dead":true,"id":4186140,"parent":4184755,"text":"Rumble - SF Bay Area (Redwood Shores)<p>We're a new, well-funded startup making and publishing AAA games for browser and mobile. We're making real games for a large audience. Not ultra casual, not niche-y.<p>Our first title is a cooperative multiplayer 3D action-RPG. Think Diablo on Facebook. But free-to-play, and no big download. No obscure plugins, either -- we use Flash, but you wouldn't believe it. Adobe says they've never seen a higher-quality in Flash.<p>Seriously, check out our trailer: <a href=\"https://www.rumblegames.com/kingsroad\" rel=\"nofollow\">https://www.rumblegames.com/kingsroad</a><p>We're in closed beta. Let me know if you want to give it a test drive.<p>Rumble is backed by Google Ventures and Khosla Ventures ($15mm series A). We have one of the strongest founding teams the gaming industry has ever seen. (No, really: <a href=\"https://www.rumblegames.com/about/our-team\" rel=\"nofollow\">https://www.rumblegames.com/about/our-team</a>)<p>We're both a developer and publisher of games, and we need help on both sides. If you want to develop the next generation of top-quality games, or you want to build and scale infrastructure to 1mm+ concurrent players, this is for you.<p>Positions: <a href=\"https://www.rumblegames.com/careers\" rel=\"nofollow\">https://www.rumblegames.com/careers</a><p>Engineers<p>* Platform -- Java/Groovy/Grails/AWS (esp. Senior/Architect)<p>* Web -- HTML+CSS+JS+(PHP/Python/Ruby)<p>* Game -- Flash+AS3/Java/C/C++/C#<p>* Data -- Hadoop/R+ML/Stats<p>Other<p>* Producers<p>* Product Managers<p>* Analysts<p>* Artists<p>* Designers<p>Drop me a line if you're interested: mike.babineau@rumblegames.com","time":1341176818,"type":"comment"},{"by":"phillytom","dead":true,"id":4185759,"parent":4184755,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>Monetate is a SAAS provider to internet marketers. We do real-time DOM modification on our clients’ sites to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>About us:<p>* Founded in 2008<p>* Funded by First Round and OpenView<p>* Market comp<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Use the source - Google Closure to Python, Hadoop and Mahout to Solr and Lucene - we're open source across our stack<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of deep problems to work on<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.  Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a> and see more about our open jobs at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http://monetate.com/jobs/</a><p>We've hired great people from HN in the past.<p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1341169349,"type":"comment"},{"by":"zukhan","dead":true,"id":4191837,"parent":4184755,"text":"FULLTIME or INTERN. Offices in San Francisco, Boston, and Menlo Park.<p>Delphix (www.delphix.com) is a data virtualization company that does for databases what VMware did for servers - this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud. We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience. Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded? Are you interested in working on the Data, the next big problem in Data Center? Do you thrive on solving difficult technical challenges? Do you take pride in writing beautiful code with a strong attention to detail? Then we are looking for you! Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between. Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1341275600,"type":"comment"},{"by":"luluvise12","dead":true,"id":4186117,"parent":4184755,"text":"London, England<p>QA Test Engineer at Luluvise<p>--<p>Luluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>Job Description<p>You will be working as a key member of an exciting new social networking start-up. Your role will be to work closely with the engineering team and take part in creating and maintaining a full test suite of both automated and manual test plans for our mobile and web applications as well as overseeing and mentoring junior members of the Q&#38;A team.<p>You will be working in a collaborative environment, which is diverse and open-minded.<p>Responsibilities<p>As a QA test engineer at Luluvise, you will use the Luluvise website and mobile applications, like a real user does. You will also use automated tests and tools to test newly developed code as it gets written.<p>•\tCreate and implement test plans with the engineering team\n•\tBlackbox testing of web apps and mobile apps\n•\tCreate automated web front end tests using tools like Selenium and Windmill\n•\tCreate automated mobile application tests<p>Skills &#38; Requirements<p>•\tSuperb attention to detail\n•\tSoftware testing experience\n•\tKnowledge of HTML/CSS and JavaScript\n•\tMobile application testing\n•\tEnthusiastic self-starter\n•\tFamiliar with bug tracking software\n•\tFamiliar with test management software<p>Bonus Points<p>•\tPython scripting<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Apply by sending us your CV to careers@luluvise.com","time":1341176356,"type":"comment"},{"by":"luluvise12","dead":true,"id":4186109,"parent":4184755,"text":"London, England<p>iOS Developer at Luluvise<p>--<p>Overview\nLuluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>Job Description<p>The company is looking for an iOS Developer to join as a key member of the team.  You will be working closely with the CEO, product and engineering teams. You will work in a collaborative environment, which is diverse and open-minded.<p>Responsibilities<p>•\tDevelop, implement, and maintain new features \n•\tEnsure the mobile experience is consistent with overall company/product proposition, including user experience, data handling/retention and feature interaction\n•\tDefine and document mobile experience (site/app/interaction) goals\n•\tDrive mobile testing, usability tests and focus groups – and incorporate feedback into iterations\n•\tResponsible for app store submission/process and mobile go-to-market requirements\n•\tContinually keep the company up-to-date with current best practices in mobile experiences<p>Job Requirements<p>•\tExperience with iOS, Objective C or Cocoa Touch \n•\t1 year minimum experience in mobile application development\n•\tFamiliar with fundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis\n•\tProficiency in, at least, one modern object-oriented language such as Objective C (preferred), C++, or C#\n•\tGood communication skills and team work skills\n•\tMust possess an entrepreneurial mindset and spirit<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Apply by sending us your CV to careers@luluvise.com","time":1341176278,"type":"comment"},{"by":"psota","dead":true,"id":4191517,"parent":4184755,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers--UI/UX, frontend, backend data mining/algorithms.  See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1341270155,"type":"comment"},{"by":"jayniz","id":4185753,"parent":4184755,"text":"Berlin, Germany<p>moviepilot.com is looking for a frontender. We made chaplin.js and work with coffeescript and backbone. &#60;3<p>Contact jobs@moviepilot.com","time":1341169159,"type":"comment"},{"by":"luluvise12","dead":true,"id":4186119,"kids":[4186206],"parent":4184755,"text":"London, England<p>Senior Web Analyst at Luluvise<p>--<p>Luluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>Job Description<p>You will be responsible for implementing and managing effective business measurement processes to ensure that the technical solutions being developed will satisfy the needs of the business.  You will oversee the end-to-end tagging process, from inception and design through implementation and QA.<p>You will be working in a collaborative environment, which is diverse and open-minded.<p>Responsibilities<p>•\tQuickly understands the business issues and data challenges of the business. \n•\tReviews and edits requirements, specifications, business processes and recommendations related to proposed solution. \n•\tWork closely with Creative, Marketing and Commercial teams to drive execution of new features, testing, campaigns and other initiatives\n•\tBe a driving force to identify areas of improvement and innovation based on thorough data analysis\n•\tMonitor, track and evaluate business performance analytics, based on KPI targets and baselines<p>Experience<p>•\tExperience in advanced web analytics methodologies such as experimentation and testing, competitive analysis, surveys and market research; in web, mobile, gaming, Facebook applications.<p>Skills<p>•\tProven ability to work with cross functional teams to drive the implementation of new features as well as resolve operational issues \n•\tFantastic analytical skills, great product instinct\n•\tAn extensive understanding of web analytics platforms and target devices (desktops, mobile, tablet)\n•\tExtensive experience with data collection methodologies and advanced tagging\n•\tExcellent knowledge of Google Analytics and similar tools\n•\tFacebook Insights knowledge is a plus\n•\tOperational start-ups experience is a plus\n•\tProject management skills\n•\tExcellent interpersonal skills and an eagerness to work as a member of a team<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Apply by sending us your CV to careers@luluvise.com","time":1341176399,"type":"comment"},{"by":"luluvise12","dead":true,"id":4186104,"parent":4184755,"text":"London, England<p>Android Developer at Luluvise<p>---<p>Luluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.    Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US. We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few. We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>Job Description\nWe are looking for a super talented Android developer who can lead the development of a world-class Android app for Luluvise.<p>Responsibilities<p>•\tArchitect, build and maintain the Luluvise Android app\n•\tWork closely with our product and design teams to customize the Luluvise experience for the Android platform<p>Skills<p>•\t2+ years experience building Android applications in Java \n•\tExperience in understanding large and complex code bases, including API design techniques to help keep them clean and maintainable\n•\tB.S. or M.S. in Computer Science \n•\tProficient in the following technologies: Java language and related frameworks Multi-Threading and memory management specific to mobile devices Understanding of caching mechanisms\n•\tStrong understanding of Object Oriented programming and data structures  \n•\tExperience writing code for multitasking operating systems  \n•\tSolid understanding of end-to-end SW development tool chains and environments for the different Mobile Application Development environments\n•\tDeep knowledge of the Android OS and applications architecture, system services, sensors, activities, services and fragments lifecycle, layout design and optimization, async tasks and loaders.\n•\tExperience with the Android store (submission/process etc..)\n•\tExperience using Git for source control\nBonus points<p>•\tExcellent communication and organizational skills \n•\tExcellent analytical and problem solving skills  \n•\tExperience with disciplined software release build/deploy processes  \n•\tAbility to work on multiple overlapping projects  \n•\tAbility to work independently with minimal supervision<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Apply by sending us your CV to careers@luluvise.com","time":1341176230,"type":"comment"},{"deleted":true,"id":4184791,"kids":[4184862],"parent":4184755,"time":1341152717,"type":"comment"},{"by":"yesimahuman","id":4185286,"kids":[4185936],"parent":4184755,"text":"INTERN - Madison, WI or remote (unpaid for the time being).<p>Codiqa (<a href=\"http://codiqa.com/\" rel=\"nofollow\">http://codiqa.com/</a>) is a small and growing startup making mobile web development easier and faster for everyone. We have an embedded version of our drag-and-drop tool live directly on <a href=\"http://jquerymobile.com\" rel=\"nofollow\">http://jquerymobile.com</a><p>We are looking for a developer and a stats+marketing intern. As a developer, you will help hack on our Backbone.js drag-and-drop builder and our Python+Django backend.<p>As a marketing intern, you will help us run experiments such as targeted ads and landing page tweaks. You will also help us engage with certain types of users and pitch them on our product's strengths. You will also analyze the results of any experiments and make our marketing more effective.<p>We are bootstrapped, and independence and ownership are a strong part of our core values. We love what we do and we are passionate about changing what it means to have a job. We don't count hours, and we do things our way.<p>Interested? Send me an email at max AT codiqa DOT com","time":1341161418,"type":"comment"}]}