{"comments":[[{"by":"patrickyeon","id":4464014,"kids":[4465022,4466126,4464476,4465401,4465351,4464385,4466249],"parent":4463689,"text":"Because people often ask, these threads <i>do</i> work. I got in touch with <a href=\"http://romotive.com\" rel=\"nofollow\">http://romotive.com</a> after seeing them post in one, and am currently packing up to move to Las Vegas and go work on robots (!) with a great team of kindred spirits, only a few weeks after I first sent them a letter.<p>Good luck to searchers on both sides in finding your own perfect fit.","time":1346514200,"type":"comment"},{"by":"blader","id":4463705,"kids":[4465633,4465257,4466209,4464728,4465251,4466667],"parent":4463689,"text":"San Francisco: product generalists and systems generalists.<p>What we do: subscription based social hyperlocal mobile gamified dating discovery engine with loyalty coupons. For the enterprise.<p>Just kidding.<p>We're a stealthy team of technical generalists filling a hole in the universe by building software that enriches the human experience. Everyone on our team codes and contributes on every level, front to back. We've all built web scale products and scaled them to millions of daily active users with zero marketing spend.<p>The world is becoming a different place: everyone is going to be carrying around a network connected super computer with ambient sensors in their pockets. We can see the future that is enabled by these devices. We are making that future happen.<p>Real talk: We've been running our prototype for 3 months now and we all use it multiple times a day, every day. Every person we've showed it to has asked us if they can have it. Every single person who's had it installed has gotten mad when our testflights expire.<p>We are well funded by a long list of top tier investors: <a href=\"http://angel.co/herelabs\" rel=\"nofollow\">http://angel.co/herelabs</a><p>We're looking for a select few product generalists (designer hackers with mobile expertise) and systems generalists (systems automation, machine learning, distributed computing) who can come in and contribute at speed on day one, and who are world class at more than one thing.<p>Ideal candidates are brilliant, fearless, and passionate individuals who are uncompromising in their pursuit of building an incredible product that will positively affect the lives of every human being every day.<p>As teammates we value commitment and accountability; honing our craft; building tools to create leverage; and seeking to learn from and understand each other.<p>We are offering founding team equity and competitive salaries. Retina Macbook Pro (or Air) &#38; 30 inch monitor are standard issue. Office space in the heart of the SoMa district in beautiful San Francisco. Willing to relocate. Willing to fly you in for interviews. Willing to tell you our stealthy secrets.<p>We are not your typical San Francisco stealth startup. We are NOT another me-too-social-local-sharing app. We DON'T sell condoms by subscription. We are NOT the place to share photos of your dog taking a leak. There will be NO gamification.<p>Life is short. Build stuff that matters.<p>Email siqi at herelabs.com. Interns and H1Bs welcome.","time":1346508463,"type":"comment"},{"by":"spicyj","id":4464076,"kids":[4464561],"parent":4463689,"text":"Khan Academy - Mountain View - (full-time and intern, designers and devs)<p>Our mission is to provide a world-class education to anyone, anywhere. We're scaling quickly.<p>Our students answer over 2 million math problems per day (over 600M total so far), all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>), and our videos (now from a variety of authors including Sal) have been viewed over 180MM times. We're tracking all that data and using it to customize each student's experience. We could use your help.<p>Working for Khan Academy is one of the highest educational impact positions you can imagine and we've been called by Wired one of the best places to work in Silicon Valley: <a href=\"http://news.ycombinator.com/item?id=4157078\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4157078</a>.<p>We're hiring designers and all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/careers\" rel=\"nofollow\">http://www.khanacademy.org/careers</a>","time":1346515209,"type":"comment"},{"by":"benhedrington","id":4463966,"kids":[4464403],"parent":4463689,"text":"Best Buy (Minneapolis, MN) - Full time, strong in HQ presence required to start. Team growing quickly working on more flexible officing (west coast, remote) as we grow.<p>Best Buy is looking for an entrepreneurial minded Product Manager to be key part of our fast growing \"Digital Experience Team\" business; focused on producing a diverse array of Mobile and wider digital products; to help envision new digital tools to deliver Best Buy's strategic goal of 'making technology work for you'. This role will bring to life new digital products that empower consumers to learn, explore, and engage with consumer electronics across Best Buy's digital and physical touch points.<p>Official job post: <a href=\"http://www.bestbuy-jobs.com/job/Richfield-Product-Line-Manager-Mobile-Digital%2C-Emerging-Platforms-Job-MN-55423/1611712/\" rel=\"nofollow\">http://www.bestbuy-jobs.com/job/Richfield-Product-Line-Manag...</a><p>I am the hiring manager, willing to talk over email, phone, etc. No need to go through the machine to simply learn more. ben dot hedrington at bestbuy.com or <a href=\"http://linkedin.com/in/benhedrington\" rel=\"nofollow\">http://linkedin.com/in/benhedrington</a>","time":1346513311,"type":"comment"},{"by":"dubisaweapon","id":4463711,"kids":[4476352,4468774],"parent":4463689,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B<p>Did you know there's a company based in Soho that has enough technology to be considered among the world's Top 250 supercomputing sites? One that imports over 5TB of data every single day, and has alumni from Google, Intel, and Microsoft?<p>You might think I'm talking about some stealth-mode startup, but I'm talking about where I work: Two Sigma Investments.\nAt our core, we're a technology company applying our talents to the domain of finance. We've created a system that combines artificial intelligence and keen human insight — a system that's constantly improving and advancing.<p>We're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology. We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you!<p>Dave Hahn dave.hahn@twosigma.com <a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1346508647,"type":"comment"},{"by":"eoghan","id":4464862,"kids":[4465371],"parent":4463689,"text":"Intercom (<a href=\"https://www.intercom.io/\" rel=\"nofollow\">https://www.intercom.io/</a>) is hiring in San Francisco and Dublin. We're building a product for web businesses. It's all about bringing them closer to their customers, giving them awesome new ways to see them and talk to them. People love it (<a href=\"https://twitter.com/intercom/favorites\" rel=\"nofollow\">https://twitter.com/intercom/favorites</a>).<p>San Francisco, H-1Bs offered:<p>* Head of Marketing<p>* Head of Business Development<p>* Head of Product Design (UX)<p>* Senior Visual Designer<p>Dublin:<p>* Senior Front-end Developer<p>* Senior Ruby Developers<p>We offer zero bullshit perks. Our focus is on producing the best work of our lives. We're turning down acquisition offers. We intend on building something meaningful and being around for a very long time.<p>Talk to me in confidence: eoghan AT intercom DOT io","time":1346528751,"type":"comment"},{"by":"lpolovets","id":4463819,"parent":4463689,"text":"Factual is hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai.<p>Remote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our Palo Alto office recently opened so new hires would have a huge impact on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1346510722,"type":"comment"},{"by":"drags","id":4464667,"parent":4463689,"text":"SF - Rails/JS - HALF OR FULL-TIME<p>I've mentioned before that we have a few engineers who work half-time-ish (and do their own things the rest of the time) and it got some positive feedback: <a href=\"http://news.ycombinator.com/item?id=3850480\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3850480</a><p>We're looking to hire a couple more engineers who are interested in being part of a team but would prefer to work 24-40 hours per week instead of the usual 50+. If it sounds interesting let me know (ragalie@verbasoftware.com)<p>=========<p>About us:<p>The college textbook market is currently being disrupted. Verba helps college bookstores transform themselves so that they a) understand and embrace the power of the nets, b) become agents of change in the textbook industry instead of agents of reaction and c) continue to make a healthy profit.<p>About 225 colleges and universities use our applications to acquire low-cost inventory and price textbooks competitively. Then millions of students visit our white-labeled sites to transparently compare the bookstore's offers against online competitors, and around 80% of students choose to buy from their local bookstore.<p>We're looking for people familiar with Ruby, Rails, MySQL and JS who can help us grow faster. We (thankfully) don't have too many scaling problems on the technical side, but we have a ton of opportunities (product and partner-based) that we could move on much faster with a few more hands on deck, and we're always looking for ways to provide more control to our support team so they can provide top-notch customer service.<p>The ideal person has strong Rails knowledge, solid testing practices, a good head for architecture and knows enough JS to help out on front-end.<p>Be sure to check out our website (<a href=\"http://www.verbasoftware.com\" rel=\"nofollow\">http://www.verbasoftware.com</a>) so you can read all about our current products and hear people say nice things about us. :)","time":1346525022,"type":"comment"},{"by":"knowtheory","id":4464304,"parent":4463689,"text":"Location: Missouri, or Remote<p>DocumentCloud is a 100% open source web based platform allowing journalists to upload, analyze, annotate, and publish primary source documents. We want give journalists the tools to show their audience their source material, not just tell them about it. In addition to the newsrooms worldwide who use DocumentCloud, our open source software projects, such as Backbone.js, Underscore.js, Docsplit, and Jammit, are relied upon by companies such as LinkedIn, Walmart, Foursquare and more. DocumentCloud is run by Investigative Reporters &#38; Editors.<p>DocumentCloud is looking for someone with a combination of the following skills<p>Experience with Ruby and JavaScript; API driven web applications; working on and fostering FOSS; user-centered products; Experience the JVM toolchain; linux administration on Platform as a Service providers such as AWS.<p>What DocumentCloud is building<p>DocumentCloud is growing fast, and we’re looking to accelerate that pace by expanding our tools into other languages beyond English. In the next year we’ll adapt our platform to accommodate multi-language OCR, search indexing, and entity extraction tools.\nDocumentCloud always looks for new ways to present documents and engage readers. We are extending DocumentCloud’s document viewer and annotation tools so that readers can make their own comments and notes on documents.<p>Investigative Reporters &#38; Editors is based in Columbia, Missouri, on the University of Missouri’s campus. DocumentCloud is comfortable operating with a distributed team.<p>You can email us at jobs@documentcloud.org","time":1346518848,"type":"comment"},{"by":"heyfouad","id":4463790,"parent":4463689,"text":"ClassDojo<p>FULLTIME or INTERN in SAN FRANCISCO, CA<p>ClassDojo is used by thousands of teachers to manage students’ behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We're an edtech startup funded by some of the biggest names in the valley, and we're one of the fastest growing education companies of all time. PG has invested in us, but we didn't do YC.<p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board. If you're a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n\n  https://classdojo.wufoo.com/forms/join-classdojo/  \n\n  --------------------------  \n</code></pre>\nOr email jobs@classdojo.com. You can read about the work and environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a><p>We are looking for:<p><pre><code>  * Lead Software Engineer\n\n  * Lead Front-end Developer  \n</code></pre>\nIf you think you're a good developer but don't fit into those buckets, get in touch anyway.","time":1346510192,"type":"comment"},{"by":"bartonfink","id":4463704,"kids":[4463768],"parent":4463689,"text":"Just FYI, it's a holiday weekend in the U.S. this month, so upvoting the story to help keep it around for a larger audience would be a nice gesture.","time":1346508460,"type":"comment"},{"by":"mivok","id":4463947,"parent":4463689,"text":"Fulton, MD or REMOTE<p>Site Reliability Engineer at OmniTI Computer Consulting<p>The OmniTI Ops team is a flexible and progressive group. We work closely with developers, DBAs, and client groups to help them manage availability and performance in the midst of constant changes. We are not risk averse; instead we strive to understand why things fail and understand the true impact of those failures, so that we can empower others. Collaboration is a cornerstone, and we understand that being friendly and outgoing are keys to making that work.<p>See <a href=\"http://omniti.com/is/hiring/site-reliability-engineer\" rel=\"nofollow\">http://omniti.com/is/hiring/site-reliability-engineer</a>","time":1346512995,"type":"comment"},{"by":"eli","id":4464069,"parent":4463689,"text":"Washington, DC: Developer Intern or Jr. Developer (Mobile/Web) at Industry Dive.<p>Industry Dive provides B2B News and Intelligence for your phone. See www.utilitydive.com or www.educationdive.com to see what I mean (check the sites on your phone to see the mobile version).<p>I'm looking for smart, self-motivated people interested in helping develop new products, add features to our Django-based CMS, and help us turn our mobile websites into native apps. This is a great opportunity to work for a growing early-stage startup. Python experience a plus, but not a prerequisite. You must be able to work from our office in Dupont Circle, Washington, DC.<p>Apologies for the brief ad, but I haven't actually posted it anywhere else yet, so HN gets the first crack. Feel free to contact me with any questions or clarifications. eli at industrydive dot com.<p>edit: I believe we're also still accepting candidates for a marketing internship (focused on audience acquisition) for the Fall semester.","time":1346515028,"type":"comment"},{"by":"LisaG","id":4464183,"parent":4463689,"text":"San Francisco: Data Scientist, Crawl Engineer<p>Do work that matters on big data! Common Crawl is an open repository of web crawl data with a corpus of over 100 TB.<p>We’re looking for someone enthusiastic about open source, net neutrality, open data and keeping the web truly open. Common Crawl is dedicated to building and maintaining an open repository of web crawl data in order to enable a new wave of innovation, education and researchWe’re set to do amazing things this year, and there is no better place to hone your big data skills than helping us manage and process our 100 TB corpus.  Plus, you’ll be working within a passionate community and have the chance to interface with plenty of talented researchers, educators, startup folks, and an incredible advisory board.<p>If you’re looking to do work that matters, come join us!<p><a href=\"http://commoncrawl.org/team/jobs/\" rel=\"nofollow\">http://commoncrawl.org/team/jobs/</a>\nEmail lisa (at) commoncrawl.org","time":1346516846,"type":"comment"},{"by":"arohner","id":4465429,"parent":4463689,"text":"San Francisco: fulltime, intern, designers, developers. Remote considered for exceptional candidates.<p>At CircleCI (<a href=\"https://circleci.com\" rel=\"nofollow\">https://circleci.com</a>), we're building Heroku for Continuous Integration. We have traction and revenue. Our customers love us, because we move quickly and provide amazing support. All employees talk to customers and are on support rotation.<p>We're written in Clojure. We eat our own dogfood, DevOps, A/B test, do continuous deployment and customer development.<p>We're looking for: designers that can write their own HTML &#38; CSS, Frontend Engineers and Backend Engineers. The frontend is a fat javascript client, using HamlCoffee, Less and Knockout.<p>Backend engineers should know Clojure or another 'weird' language (Haskell, Scala, Scheme, etc), and Linux Devops (C compilation model, make, packaging).<p>Contact us at founders@circleci.com. Include samples of awesome stuff you've done.","time":1346540350,"type":"comment"},{"by":"shadchnev","id":4464335,"kids":[4464622,4466932,4468258],"parent":4463689,"text":"LONDON, UK.<p>Arguably the most exciting tech position in London.<p>We are Forward Labs, a startup lab in London. We are a dozen guys coming up with new ideas, building prototypes, testing them using lean techniques and forming teams around products that have solid traction. Essentially, we are a well-funded playground. Our goal is to produce 1-2 new businesses a year.<p>We have amazing, driven, entrepreneurial people who have a range of skills, from dev to UX/UI,  marketing etc all within the team. Since we are part of a larger company, Forward (www.forward.co.uk), we also benefit from access to their expertise.<p>Please read more about the role on our website: <a href=\"http://www.forwardlabs.co.uk/jobs/lead-developer-for-various-projects\" rel=\"nofollow\">http://www.forwardlabs.co.uk/jobs/lead-developer-for-various...</a><p>Email me at evgeny.shadchnev@forward.co.uk for details.","time":1346519355,"type":"comment"},{"by":"powdahound","id":4464039,"parent":4463689,"text":"Location: San Francisco, CA<p>HipChat (<a href=\"https://www.hipchat.com\" rel=\"nofollow\">https://www.hipchat.com</a>) - the chat tool used by the smart teams at Quora, Instagram, Tumblr, Wired, Uber and thousands of other companies. Also the people who put the Y U NO guy on a billboard on 101 (<a href=\"http://blog.hipchat.com/2011/06/23/a-tale-of-a-ridiculous-billboard/\" rel=\"nofollow\">http://blog.hipchat.com/2011/06/23/a-tale-of-a-ridiculous-bi...</a>).<p>We're a team of 5 working in Atlassian's beautiful San Francisco office after our acquisition in March. Currently seeking;<p>- An engineer interested in doing application development (desktop and mobile) for any combination of iOS/OSX/Android/Windows. We're moving away from AIR and our users are quite excited about it (<a href=\"http://help.hipchat.com/forums/138883-suggestions/filters/top\" rel=\"nofollow\">http://help.hipchat.com/forums/138883-suggestions/filters/to...</a>).<p>- An engineer knowledgeable in Python, PHP, and web stuff to work on our website and XMPP backend (Twisted Python). You'll also be working with Redis, CouchDB, and MySQL.<p>Since we're a small team inside of Atlassian, you'll have all the benefits and responsibility that working on a small team provides, but also the security and excitement of a larger pre-IPO company. Plus, working on a product that people absolutely love is a wonderful feeling.<p>Full details on our jobs page: <a href=\"https://www.hipchat.com/jobs\" rel=\"nofollow\">https://www.hipchat.com/jobs</a>","time":1346514534,"type":"comment"},{"by":"seanmccann","id":4465499,"parent":4463689,"text":"San Francisco<p>Freedom Freight<p>Rails Developer, iOS Developer<p>The last 50 years has seen the reinvention of almost every major industry except for one: Trucking. Freedom Freight is here to change that by deploying the world's first mobile platform for on-demand freight shipping. Over $30 billion dollars a month is spent trucking freight around the US, without it, the country would grind to a halt overnight. In such a massive market, it's hard to believe that the entire industry today still runs on phones and fax machines, but until now, it has.  This means hundreds of millions of dollars worth of freight capacity goes unfilled every month due to the old-school inefficiencies of the industry. We are changing that.<p>If you're ready to change the trucking industry, send your resume and GitHub profile to sean@freedomfreightusa.com","time":1346542044,"type":"comment"},{"by":"alleynkearney","id":4464430,"kids":[4464986,4464638],"parent":4463689,"text":"New York, NY (Union Square, Manhattan) <a href=\"http://www.jcrew.com/footer/careers.jsp\" rel=\"nofollow\">http://www.jcrew.com/footer/careers.jsp</a><p>Hi HN! J.Crew is expanding rapidly right now both domestically and internationally and we are looking for good devs -- and techies of all kinds actually! -- for our NYC headquarters. (We don't work with recruiters. Sorry, recruiters). My contact info is in my profile if you're interested in finding out more and are in the New York area or are interested in moving here (We don't permit remote work - except with our team in India).<p>Also, <i>please keep in mind</i> that, while you are free to apply for the job listings you can find on our website, if you're good and  have an interest in working for us, at the moment (because of our rapid growth) <i>there is very likely to be another role that can be carved out for you depending on your skills and/or interests</i>. I may be able to help if you fall into the latter category.<p>Some of the perks include 5 weeks of paid time off (to be precise, 25 days of paid time off includes sick days,  personal days and vacation days), half-day summer Fridays (just ending! sob!), free in-house masseuse, Starbucks coffee, balanced gender ratio, clothing discounts that can be as high as 75%, tuition reimbursement, in-house technical training and a really nice office building overlooking Astor Place with views towards lower Manhattan.<p>Regards,<p>Alleyn","time":1346521038,"type":"comment"},{"by":"drusenko","id":4464178,"parent":4463689,"text":"San Francisco: front-end engineers and designers<p>Weebly is a bit different than your average startup. We're a small &#38; profitable team and we make a product that our users are obsessed about.<p>We have 13 million+ users and run roughly 2% of the active websites on the internet.<p>Email jobs@weebly.com or check out more here: <a href=\"http://www.weebly.com/jobs.php\" rel=\"nofollow\">http://www.weebly.com/jobs.php</a>","time":1346516794,"type":"comment"},{"by":"pazimzadeh","id":4464536,"parent":4463689,"text":"New York, NY or remote. Intern developer or Junior developer.<p>Beagle is like Craigslist, but just for college students. We are creating a simple, secure network for students to post and run tasks and errands in their community. getbeagle.com<p>This is a chance to work on something that will be used by thousands of students, and to be one of the first ten team members.<p>All software engineers will be working on one or two of our main projects:<p>#API: Our API is the core that powers everything else. It’s written in Clojure. You’ll be the one actually implementing all the features and exposing them in a developer-friendly way. This is a fun challenge for anyone interested in software design and architecture. We use MongoDB on the backend so it’s best if you are at least somewhat familiar with it.<p>#iOS app: We have a hybrid iOS app, which lets us have a native experience while staying agile, with quick iterations and frictionless deployment. You’ll mostly be working with the Python web app, but will also have to work with the native iOS shell occasionally, too. You’ll have to work closely with the API, as all new features are be added there first.<p>#Website: Our public-facing website is a simple Node.js app. You’ll be working closely with the API to mirror certain features from the iOS app to the website. Familiarity with MongoDB is preferable.<p>Additionally we have some other projects planned like a new administrative interface to the API, and a dashboard that reports key stats we can track.<p>Please contact Julian at julian  at  beagleapp  dot  com.","time":1346522911,"type":"comment"},{"by":"streeter","id":4465407,"parent":4463689,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons.\nOur top-ranked app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some rock stars to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1346539698,"type":"comment"},{"by":"asanwal","id":4463874,"kids":[4510679],"parent":4463689,"text":"CB Insights - NYC (www.cbinsights.com)<p>Data Journalist - looking for someone to lead our data-driven content efforts. If you like Excel pivot tables, are an emerging company/technology junkie and are a decent writer, we'd love to talk.<p>Also looking for a php developer to help us build amazing applications on top of our private comany and investor data.<p>We are National Science Foundation-backed but have taken no investment otherwise.  We have real customers and are profitable.<p>Email me at asanwal@cbinsights.com if interested.","time":1346511851,"type":"comment"},{"by":"wordreference","id":4464550,"parent":4463689,"text":"Vienna, Virginia<p>Come work for WordReference.com, the top website for translation dictionaries.  I have a position open that I think would be a great fit for a reader of Hacker News.  It is for a coder with business sense who will be in charge of nearly all technical aspects of running one of the largest websites in the DC area.<p>This position would be great experience for a person interested in someday launching their own online business.  You would work on nearly all technical aspects of running a large website, and work with me in launching new features.  While we need to work closely together, you can work from home much of the time. (I highly prefer somebody who lives in the Washington, DC area.)  We’ve been around 12 years so we aren't exactly a startup anymore. While there are no stock options, one advantage is that we have sane working hours.<p>Requirements:\n - Ability to code and an interest in creating and running excellent websites.\n - Not religiously opposed to working mostly with C#, JavaScript and MySQL.\n - An interest in or knowledge of foreign languages is a plus.\n - Serious web development experience is a plus.<p>If this sounds like something that you would be interested in, write me through jobs@[our domain name] and I (the founder) will be in touch.","time":1346523102,"type":"comment"},{"by":"prophetjohn","id":4463821,"parent":4463689,"text":"Austin, TX | Senior front-end developer | mobi<p>Come work for a small, meritocratic company and own the front end of our applications.<p>We're looking for someone with solid design skills and the ability to translate their design to semantically correct HTML and CSS. Ideally, you don't rely completely on mockup tools like Dreamweaver and can code the CSS by hand. You should have strong opinions about the correct way to architect the design aspect of a webapp. Have you migrated stylesheets to SASS or LESS, integrated JavaScript unit testing into a continuous build process or other cool stuff that a bunch of backend developers have never done? Talk to us.<p>Programming abilities are strongly desired, but not strictly required. You would necessarily need to do some JavaScript and jQuery as needed for the UI development, but good programming fundamentals and the ability to pick up (or already know) things like Java and SQL would be a huge plus.\nIf you think you might be a fit, contact information is in my profile. Portfolios or github profiles are encouraged. Resumes are also welcome.<p>Perks include market salary, health/dental/vision/life, unlimited paid vacation plan, 401K.<p><a href=\"http://www.mobicorp.com/\" rel=\"nofollow\">http://www.mobicorp.com/</a>","time":1346510743,"type":"comment"},{"by":"ashrust","id":4464336,"parent":4463689,"text":"SendHub (YC W12) is looking for an iOS Engineer. Menlo Park, fulltime.<p>Skills:\nObjective C and the iOS SDK | Git<p>Nice to have:\nHeroku experience<p>About us:\nWe’re making professional communication accessible to all. Over the last century technological advances have disproportionately favored the wealthy. SendHub is leveling the playing field. Founded to help educators communicate in under resourced communities, we now have users across the US in politics, retail, faith groups, sports, education and many more.<p>We have thousands of users, we’re sending hundreds of thousands of messages a month and we’re growing fast - 60%/month across users, usage and monetization.<p>What you’ll be doing:\nWorking closely, and at speed, with our small team to make best in class mobile communication apps. You’ll be involved in almost every part of the software life cycle from specs discussion to implementation to testing and pushing to production. We push multiple times a day and you’ll likely push to production within 24 hours of starting.<p>Our Philosophy:\nWe believe in building a wonderful product and taking care of our people. To ensure our team executes - you’ll get autonomy, recognition and regular feedback. We expect a lot of each other but we wouldn't want it any other way. We're hungry and we need you to be too.<p>Benefits:\nHealth, dental, meals and smart colleagues who will challenge you everyday.<p>We're based in downtown Menlo Park, CA (very close to the caltrain station) and while we're flexible on remote working, you'll need to be around the office.<p>If you're interested, please drop us a line: jobs [at] sendhub [dot] com","time":1346519365,"type":"comment"},{"by":"witten","id":4463897,"parent":4463689,"text":"EnergySavvy - Seattle, WA<p>U.S. utilities spend $6 billion a year on energy efficiency programs encouraging their customers to use less energy, spurred by regulations or simply to avoid building expensive new power plants. Utilities achieve these energy savings by outsourcing these programs to consulting companies armed with Excel spreadsheets and filing cabinets, meaning that the programs don't always work as effectively as they could, and making it difficult to measure a program's effectiveness in a timely manner.<p>EnergySavvy is the data collection and analysis platform for these energy efficiency programs. Through great software and user experiences, we make programs run better, collect clean and consistent data and let our customers optimize their programs in real-time.<p>We're hiring backend Python devs, front-end devs, PMs, etc. Here's our jobs page:<p><a href=\"http://www.energysavvy.com/jobs/\" rel=\"nofollow\">http://www.energysavvy.com/jobs/</a><p>We're also currently offering a $13,000 referral bonus to anyone who refers a dev/PM that we hire! More info at:<p><a href=\"http://www.energysavvy.com/blog/2012/08/28/15k-for-15-days-referral-bonus/\" rel=\"nofollow\">http://www.energysavvy.com/blog/2012/08/28/15k-for-15-days-r...</a>","time":1346512203,"type":"comment"},{"by":"syrneus","id":4464300,"parent":4463689,"text":"Burlington, MA - full time<p>Acquia is looking for great cloud engineers. Positions for junior and senior candidates are available.  Come help us grow our cloud which runs Drupal, Solr and other open source technologies on thousands of AWS machines and is rapidly expanding.<p>Acquia provides commercial support and hosting for Drupal projects and large scale Drupal websites.  We were recently named the fastest growing software company in America by Inc magazine and the 8th fastest growing in any industry.<p>If you have great experience scaling the LAMP stack, building automated toolchains to manage servers on AWS or open cloud stacks and if you have a passion for working with some of the largest companies in the world or managing thousands of servers then let us know.<p>Cloud Engineer position details are available here:\n<a href=\"https://www.acquia.com/careers/job-listing/cloud-software-engineer\" rel=\"nofollow\">https://www.acquia.com/careers/job-listing/cloud-software-en...</a><p>Positions are also open for Drupal experts, JavaEE Architects, Sysops, Devops and more.","time":1346518781,"type":"comment"},{"by":"stochastician","id":4464660,"parent":4463689,"text":"Prior Knowledge (SF) [H1-B, interns ok]<p>Full Time, Distributed Systems Developers and Machine Learning Experts -- and anyone with a passion for posteriors.<p>P(K) is a small team in downtown San Francisco pushing the frontiers of probabilistic machine learning to the masses. Our first product is Veritable, a predictive database. We like to think of it as a database for things you don't (yet) know.<p>We're passionate about discovering the hidden causes behind data, and are currently split pretty evenly between machine learning experts, scalable systems engineers, and people used to working with horribly messy, complex, and sparse data. We're backed by Peter Thiel's group, Founders Fund, who share our commitment to long-term technical innovation.<p><a href=\"http://priorknowledge.com/join-us\" rel=\"nofollow\">http://priorknowledge.com/join-us</a> describes a bit more about what we're looking for, and you can always e-mail me (jonas@priorknowledge.com) for more info! Or swing by our offices at the intersection of 3rd and Market to meet the team.","time":1346524850,"type":"comment"},{"by":"tedd4u","id":4464459,"parent":4463689,"text":"Flickr<p>Location: San Francisco (near Montgomery Station). Relocation and/or visa transfer will be considered for excellent candidates.<p>Flickr is hiring front-end, back-end and iOS developers and MySQL admins (and more). We are hiring full-time but we'll consider contract if that's your preference.<p>Details at <a href=\"http://flickr.com/jobs\" rel=\"nofollow\">http://flickr.com/jobs</a> (or email flickr.jobs@yahoo.com).<p>Flickr lets people share their life in photos and is the best place to discover amazing photos on the web. It's one of the most well known brands on the internet and is visited by over 90 million users every month.<p>Flickr engineering is based on rapid development, continuous deployment, and individual responsibility. We're looking for passionate and motivated developers to help us make Flickr bigger, better and faster.<p>Flickr processes millions of photos and videos every day, with billions of photos already online. We serve billions of pageviews and more than 7 billion API requests monthly for over 75 million registered photographers.","time":1346521547,"type":"comment"},{"by":"robertsosinski","id":4464088,"parent":4463689,"text":"Ticket Evolution<p>Location: Jersey City, New Jersey; Postion: Ruby/JavaScript/Erlang Engineers; Email: rsosinski@ticketevolution.com<p>Ticket Evolution builds software and services that handles the real-time execution, clearing and settlement of event ticket trades.  If you ever purchased a ticket to a sports game online or called a broker for seats to a concert, chances are our system was used somewhere in between.  We recently closed a Series-A round and launched our newest partner cheaptickets.com.<p>We use Ruby on Rails, JavaScript with BackBone and Knockout, and PostgreSQL day-to-day.  We are also starting to dive into Erlang and Riak and are looking for engineers who are comfortable getting out of their comfort-zone.  Besides working on challenging problems, we also sport a 40-hour work week, have a laid-back office, and pay market salary along with equity and health insurance.<p>If you are intersted in learning more, email me directly at rsosinski@ticketevolution.com.","time":1346515353,"type":"comment"},{"by":"lukas","id":4463984,"parent":4463689,"text":"San Francisco (Mission) CrowdFlower <a href=\"http://crowdflower.com\" rel=\"nofollow\">http://crowdflower.com</a> intern, remote, h1b all welcome.<p>We are the worlds leading microtask company.  We send literally millions of small jobs to people around the world every day.  Our technology platform helps our customers design great tasks and ensure that people working on the tasks do good work.  Someone said it's like map reduce but with people :).<p>We are hiring all types of technical people from operations to front end to machine learning experts.  You can check out our exact engineering job descriptions here <a href=\"https://crowdflower.com/about/jobs\" rel=\"nofollow\">https://crowdflower.com/about/jobs</a> but if you are smart and technical and want to tangibly change the world every day then we want to talk to you.<p>email resumes at crowdflower.com or email me directly at lukas at crowdflower.com.","time":1346513706,"type":"comment"},{"by":"phillytom","id":4464521,"parent":4463689,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>Monetate is a SAAS provider to internet marketers. We turn data in action on our clients' sites by doing real-time DOM modification to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve users' problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Use the source - Google Closure to Python, Hadoop and Mahout to Solr and Lucene - we're open source across our stack<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on<p>About us:<p>* Founded in 2008<p>* We pay market rates<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>* Funded by First Round and OpenView<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.  Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a> and see more about our open jobs at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http://monetate.com/jobs/</a><p>We've hired great people from HN in the past.<p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1346522688,"type":"comment"},{"by":"seldo","id":4464226,"kids":[4465559,4464809,4464488],"parent":4463689,"text":"San Francisco, CA. Full time. H1B okay.<p>50% of traffic is now driven by social media, and referrer information is increasingly useless with mobile clients and HTTPS. Traditional web analytics doesn't work for social traffic. So awe.sm is building full-featured social media conversion tracking and analytics.<p>Right now and in the medium term, we're providing immediate value to our customers by giving them firm numbers on the ROI of their social media efforts, in terms of dollars, signups, pageviews or any other metric they pick. Our APIs allow app developers to easily integrate social features into their products and easily present the analyzed data back to their own customers, without having to build their own processing clusters and workflows.\nLonger term, we want to know what's important on the Internet, and we believe that instrumenting social behavior is the way to do that.<p>We're looking for back-end engineers who are interested in learning how to handle large volumes of data for aggregation, geo analysis, and graph analysis, in close to real time. We're currently in transition from a mixed stack of PHP and Ruby to JVM languages -- we believe in simple parts loosely coupled, and also in picking the right tool for the job, so you genuinely have the power to shape the stack you work on.<p>We're also looking for front-end developers to continue to build out our GUI, which is a backbone JS app built on top of the same APIs our customers use.<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 13 people right now. We have a cool new office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1346517483,"type":"comment"},{"by":"barunio","id":4464340,"parent":4463689,"text":"WegoWise.com - Remote devs welcome (located in Boston, MA)<p>Hiring: Ruby developers (Mid to Senior-level) &#38; UX designer<p>We are a leading utility analytics company that helps our users (property owners, utility companies, auditors, and more) reduce energy and water usage, run conservation programs, and save money.<p>WegoWise is the perfect environment for passionate developers to do their best work, learn something new every day, and have fun while building something that serves a socially-conscious purpose.<p>Full details here:<p><a href=\"http://wegowise.com/careers/developer\" rel=\"nofollow\">http://wegowise.com/careers/developer</a><p>Contact: devjobs@wegowise.com<p>++++++++++++++++++++++++++++++++++++<p>We are also actively looking for UI/UX designers!<p>Design is a critically important part of how we build our application, and we're looking to bring someone on to the team to focus on UX and front-end development.","time":1346519411,"type":"comment"},{"by":"zukhan","id":4465000,"parent":4463689,"text":"FULLTIME or INTERN. Offices in San Francisco, Boston, and Menlo Park.<p>Delphix (www.delphix.com) is a data virtualization company that does for databases what VMware did for servers - this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud. We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience. Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded? Are you interested in working on the Data, the next big problem in Data Center? Do you thrive on solving difficult technical challenges? Do you take pride in writing beautiful code with a strong attention to detail? Then we are looking for you! Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between. Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1346531058,"type":"comment"},{"by":"traviskuhl","id":4464215,"kids":[4464416],"parent":4463689,"text":"Team Coco (teamcoco.com)<p>Location: Burbank, CA<p>Position: Web Developer, Full Time<p>Details: <a href=\"http://teamcoco.com/content/web-developer\" rel=\"nofollow\">http://teamcoco.com/content/web-developer</a>","time":1346517308,"type":"comment"},{"by":"pgambling","id":4464025,"parent":4463689,"text":"Houston, TX | PROS | UI Software Engineer<p>(Disclaimer: I just accepted a position with PROS, but I haven't started yet)<p>PROS is looking for UI developers for our new, innovative cloud products.  As a member of the PROS Product Development team, you will be working with Software Engineering teams that place a great importance developing modern, clean, and awesome code.  We currently use JavaScript, jQuery, AJAX, HTML, CSS, JavaScript templating, Backbone.js, Node.js build tools, and RESTful backend endpoints powered by Java and Groovy.<p>Full Job Posting: <a href=\"http://bit.ly/QzAgst\" rel=\"nofollow\">http://bit.ly/QzAgst</a><p>PROS has many other openings, full list here: <a href=\"http://bit.ly/OBEKu9\" rel=\"nofollow\">http://bit.ly/OBEKu9</a>","time":1346514332,"type":"comment"},{"by":"jmileham","id":4464439,"parent":4463689,"text":"ImpulseSave (TechStars Boston Fall 2012) is looking for a senior full-stack engineer\nCambridge, MA<p>ImpulseSave is reinventing the way people save money by making saving as easy and rewarding as spending (we think of ourselves as the anti-marketing company).  Currently in TechStars and still tiny.  It's an exciting time to join our team.<p>As a Senior Engineer you'll work alongside our CTO on full-stack development of our backend applications and mobile client and deployment architecture.  You'll be writing tests, reviewing code, building cutting-edge features and simple, secure services.<p>We use Ruby, RSpec, Rails, Cucumber, JavaScript, Jasmine, Backbone.js, Cordova, and iOS.<p>Email jobs@impulsesave.com","time":1346521102,"type":"comment"},{"by":"rogerbinns","id":4463913,"parent":4463689,"text":"Software Developer at Appington - (Silicon Valley or telecommuting/remote, full or part time)<p>Appington is looking for a software developer to help evolve the core Appington Audio platform and associated infrastructure.  We are also open to interns or junior developers if this describes you in a few years.<p>You:<p>* You are a generalist able to tackle a wide variety of problems and opportunities that come our way<p>* You thrive in a startup environment (lots of uncertainty, few processes or infrastructure)<p>* You love dealing with multiple programming languages, heterogeneous mobile clients, web services, networking, analytics, databases etc and plumbing them all together<p>* You like rapid development, quick turn arounds and responding to changing requirements<p>* You feel right at home with iOS, Android and other mobile operating systems<p>* You like digging into analytics data<p>* You enjoy doing something that nobody else has done before<p>Us:<p>* We are the pioneers of mobile audio platforms<p>* We value the user experience<p>* When people hear what we do, it changes what they think is possible for mobile apps<p>* Python is our main development language on Macs and Linux<p>* We like open source, and open source our work where possible<p>* Mobile clients use Java &#38; C (Android), Objective C (iOS) and HTML5/CSS/JS (web)<p>* Some technologies we currently use are MongoDB and Google AppEngine<p>* Some tools we currently use are vim, emacs, git + Github and Trello<p>Check out <a href=\"http://www.appington.com/jobs\" rel=\"nofollow\">http://www.appington.com/jobs</a> or email us at hireme@appington.com","time":1346512437,"type":"comment"},{"by":"kevinconroy","id":4464059,"parent":4463689,"text":"GlobalGiving.org (<a href=\"http://www.globalgiving.org/\" rel=\"nofollow\">http://www.globalgiving.org/</a>) - Washington DC non-profit named one of the ten startups changing the world (along with Pinterest and AirBNB) by Forbes<p><a href=\"http://www.globalgiving.org/aboutus/jobs/\" rel=\"nofollow\">http://www.globalgiving.org/aboutus/jobs/</a><p>1) Software Engineer for Good - Java and web development<p>2) Project Manager for Good - Help us run our agile process and make sure our user stories and specs are fleshed out enough for development<p>3) Business Intelligence Analyst - Crunch our numbers and find ways to help us improve our business and help even more non-profits","time":1346514814,"type":"comment"},{"by":"revisionzero","id":4464391,"parent":4463689,"text":"Cleveland, Ohio: Windows Application Developer's (C#/.NET/WPF)\nAvailable Job Types: REMOTE, H1-B, INTERN, LOCAL<p>Quixby.com was our initial and still on-going endeavor, focusing on making PC Building simpler.<p>One of our new focus's is with Windows Application development, and in-turn we are looking for passionate developers who would have an interest in making a truly unique application on Windows utilizing C#, .NET, and WPF. An interest in PC Gaming would be a huge bonus =)<p>Thats the short and sweet approach, anyhow, feel free to shoot me an email at austin [at] quixby dot com -- Would love to chat with anyone interested in learning more.","time":1346520371,"type":"comment"},{"by":"jedberg","id":4463996,"parent":4463689,"text":"Los Gatos, CA -- Netflix<p>I'm still looking for an SRE for my team to help with our mission of keeping the largest internet TV network online 24/7/365 using one of the biggest Amazon EC2 installations.<p>We also have lots of other jobs open from DevOps to machine learning.<p><a href=\"http://jobs.netflix.com/jobs.html\" rel=\"nofollow\">http://jobs.netflix.com/jobs.html</a>","time":1346513917,"type":"comment"},{"by":"bigmac","id":4465465,"parent":4463689,"text":"San Francisco, CA Fulltime Security Engineer, Security Intern<p>At Square (squareup.com) we're looking for security experts excited about securing the future of payments. Security at Square is involved in all aspects of the stack: hardware, firmware, mobile, infrastructure, networks, crypto, web, and physical security.  The team is equal parts builder and breaker.<p>Standing invitation to all security folks in the Bay Area or visiting: come have lunch with us at Square. We'd love to meet you and talk about what you're working on. It is almost certainly relevant to us.<p>Contact me: mccauley [at] squareup.com","time":1346541083,"type":"comment"},{"by":"epi0Bauqu","id":4464831,"kids":[4480472],"parent":4463689,"text":"DuckDuckGo: Android<p><a href=\"http://help.duckduckgo.com/customer/portal/articles/216387\" rel=\"nofollow\">http://help.duckduckgo.com/customer/portal/articles/216387</a>","time":1346528183,"type":"comment"},{"by":"vide0star","id":4469984,"parent":4463689,"text":"London: Python and Erlang Engineers, FT, not remote<p>Smarkets (<a href=\"https://smarkets.com\" rel=\"nofollow\">https://smarkets.com</a>)<p>Smarkets is a real-time online trading platform with an Erlang backend and Python frontend. Smarkets is disrupting the global betting industry by offering a modern betting exchange platform with significantly lower transaction fees than the competition. We have traded over £150 million of bets since launching in February 2010.<p>The part of our stack which runs behind the website is one of the few that uses Erlang as a primary language, and is supported by other well-known Erlang projects such as RabbitMQ and CouchDB.<p>The non-Erlang pieces of our stack are mostly written in Python, and relies heavily on asynchronous programming techniques and REST. We use the following technologies: VirtualBox, Vagrant, Flask, gunicorn, PostgreSQL, Ganglia, Icinga, Graphite, Cacti, Jenkins, Trac, Git and many other open source packages.<p>We are well-funded and growing quickly so are looking for Python and Erlang engineers to join our team.\nIf you are looking for a flexible, agile team to work with; want to work somewhere free of big corporate politics; would like a cool project to work on; we’d love to hear from you!\nMore details about the role and what we're looking for can be found on our blog:  <a href=\"http://blog.smarkets.com/2012/07/31/smarkets-seeking-python-and-erlang-engineers/\" rel=\"nofollow\">http://blog.smarkets.com/2012/07/31/smarkets-seeking-python-...</a>","time":1346670938,"type":"comment"},{"by":"silvio","id":4463927,"parent":4463689,"text":"San Jose, Santa Cruz :: Build FPGA design tools at Altera<p>Altera is one of the leading designers of FPGA devices in the world. I'm an engineer in the software team, developing mostly embedded design and instrumentation tools for FPGAs.<p>We are looking for software developers experienced or with a strong desire to learn about Computer Architecture, FPGA design, Digital Logic, Embedded Systems, and more, while at the same time developing engineering design tools in high level languages.<p>To give you an idea of what we do, these are some of the projects that involved me at Altera :<p><pre><code>  * Designed and implemented a high performance on-chip network that's used\n    in thousands of routers, base stations, and switches around the world.\n  * Created a hardware/software instrumentation framework in a mix of Java, C++, C, \n    and Verilog. This is the foundation for all the debuggers at Altera.\n  * Modified the GCC toolchain to add support for Altera's processors, like our\n    NiosII soft processor.\n  * Implemented a GDB Server from scratch in Java.\n  * Defined and implemented the pieces of an ARM CoreSight debug subsystem.\n  * Implemented infrastructure used in a C-to-Gates compiler.\n  * Spent hours hacking away with the tools and many of the available\n    development boards.\n</code></pre>\nIf the above sound interesting to you, then Altera might be the place that you've been looking for. Send me an email to sbrugada at altera.com telling me why you think this would be a good match. You should attach your resume too.","time":1346512695,"type":"comment"},{"by":"squirrel","id":4464594,"kids":[4468261],"parent":4463689,"text":"Notting Hill, London, England.<p>Our web application is at the heart of our busy e-commerce business; every day it serves millions of product images and handles thousands of purchases - but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, we have a mix of Linux, Windows, and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. We expect developers to be generalising specialists, ready at the drop of a hat to refine an algorithm, write a tricky integration test, tune a SQL query, or discuss feature nuances with a product manager. Our team is growing fast and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us; we're hiring for all technical roles including front- and back-end devs, sysadmin, and IT admin.<p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homewares and lifestyle categories, many familiar from the high street. The company has about 65 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.","time":1346523766,"type":"comment"},{"by":"ipster","id":4463847,"parent":4463689,"text":"AllTrails and AllSnow<p><a href=\"http://alltrails.com\" rel=\"nofollow\">http://alltrails.com</a>\n<a href=\"http://allsnow.com\" rel=\"nofollow\">http://allsnow.com</a><p>FULLTIME Rails / iOS / Android Engineers<p>San Francisco (preferred) / Los Angeles / NYC / Remote / H1B<p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people rediscover the outdoors and having lots of fun in the process. Camping and snowboarding benefits, anyone?<p>We just launched our brand new site in partnership with National Geographic (<a href=\"http://alltrails.com/partners/national_geographic\" rel=\"nofollow\">http://alltrails.com/partners/national_geographic</a>) and have the #1 outdoors app in the Apple and Android stores (try searching for 'Hiking'). We also have the #1 Snowsports app on iPhone.<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book, and a core committer to Homebrew on the team. We're looking for exceptional full stack Rails and mobile developers (Android and iOS).<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you!\n<a href=\"http://alltrails.com/jobs\" rel=\"nofollow\">http://alltrails.com/jobs</a> or jobs@alltrails.com","time":1346511372,"type":"comment"},{"by":"3pt14159","id":4463887,"parent":4463689,"text":"Toronto - 500px - backend, front end, android, iOS, senior sys admin, UX designers.<p>Core app: rails with clustered MySQL and mongodb, looking at moving to riak soon. Some components in other languages (c, c++) data mining python + scipy. Backbone JS for rewrite of front end. Salary between 60k and 100k, options worth 0.25% and 0.75% office location currently near King and Peter, might be moving to liberty village soon though.<p>Massive traffic, good revenue, sustainable business and culture. Email me (info in profile).","time":1346512036,"type":"comment"},{"by":"asterix","id":4465910,"parent":4463689,"text":"Palo Alto, CA - Full Time - Ruby on Rails Developer - Neo (www.MyNeoLoan.com)<p>Neo provides affordable car loans to consumers new to credit, such as youth and recent immigrants, by assessing their credit risk based on real-time financial and social data as these individuals have not yet built up a credit score. (Yes, it is about time somebody tried this, and we have the chops to do so)<p>We are a team of four, with high profile advisors. Our beta product is ready, and we are executing our loan program. We have seed funding from a top VC (<a href=\"http://www.businessweek.com/articles/2012-07-26/social-plus-capital-the-league-of-extraordinarily-rich-gentlemen\" rel=\"nofollow\">http://www.businessweek.com/articles/2012-07-26/social-plus-...</a> - see page 2 for Neo). We are based in Palo Alto, two blocks from the Caltrain station.<p>We are looking for a serious hacker to join our core team. This is an opportunity to get involved in a cutting edge consumer risk analytics project that aims to disrupt the US credit system. Plus, consumers are our customers, so the project also involves working on all the cool tools consumers expect these days (web, mobile, social, etc). As a very early member of our team, you will have direct input into many of the decisions that will affect the future of our company<p>Drop me a note at navin@MyNeoLoan.com if you are interested.","time":1346552430,"type":"comment"},{"by":"capkutay","id":4464651,"parent":4463689,"text":"WebAction (<a href=\"http://www.webaction.com\" rel=\"nofollow\">http://www.webaction.com</a>) - Full time or intern in Palo Alto, CA (Downtown Palo Alto). Seeking UI developers and Platform Engineers.<p>WebAction is a start-up looking to fill the gap between big data and transaction data. We have our initial funding and we are now building out our core engineering team. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today.\nWe are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>UI or front-end Developers should be well-versed in HTML, CSS, JavaScript, jQuery, and should be experienced or at least interested in using JS libraries like d3.js. Strong programming fundamentals and experience with languages like Java/C/C++ is a huge plus. Experience developing native iOS apps would also be strongly desired, but not a requirement.<p>For the Platform Engineer position, you should have or at least be interested in learning:\nLarge-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested, email us at jobs@webaction.com. In your message, mention \"Hacker News\" and feel free to let us know about your passions or any technologies that excite you. We look forward to hearing from you.","time":1346524688,"type":"comment"},{"by":"nfriedly","id":4463914,"parent":4463689,"text":"San Francisco, CA or Tipp City / Dayton, OH<p>Sociable Labs has several open positions on both the engineering and the marketing sides of the company.<p>Our product brings social features such as commenting, passive and active sharing, and top \"x\" lists onto media and e-commerce sites. We have a solid system and a rapidly growing base of customers who love our product.<p>We have a fun team, great benefits, and an enjoyable workplace. Our approach is analytics-driven and we're working towards Continuous Integration.<p>I do primarily JavaScript, so I can mention a couple of the recent changes: we now use a node.js powered build system for our JS files, pre-compiled handlebars templates for client-side rendering, and we use feature detection to only load on browsers with localStorage and CORS support. (This works out to IE 8 and newer on the MS side.)<p>See more info at <a href=\"http://www.sociablelabs.com/careers/\" rel=\"nofollow\">http://www.sociablelabs.com/careers/</a> or email nathan @ [company site] if you're curious about anything.<p>Sociable Labs also hosts the Tipp JS meetup, so if you're in the Dayton OH area, please stop by even if you're not interested in working with us! <a href=\"http://www.meetup.com/tipp-js\" rel=\"nofollow\">http://www.meetup.com/tipp-js</a>","time":1346512465,"type":"comment"},{"by":"nchuhoai","id":4463922,"kids":[4463942],"parent":4463689,"text":"Berlin, Germany, (remote possible, while on location preferred)<p>Webcred is hiring to expand their team to accelerate the collaborative consumption movement.<p>Our focus at Webcred is really to make people trust each other more, because we believe that the world would be a better place if we use our resources more efficiently by sharing with each other. That is why we are building tools to allow p2p marketplaces build more trust in their communities, as we see trust or the lack thereof as a major roadblock.<p>We are a very young, but driven startup that is starting at Startupbootcamp Berlin this week. One of the founders grew up in Berlin, a great city to have a perfect work-life balance, but we also have been involved in the Boston scene and believe we can bring the best of both worlds together.<p>We are an all-technical team with allround-capabilities, working on a Rails/Neo4j Stack and looking for people that could help us on the development side, but really, we want to talk to any of you who believe in our mission that a world where people can trust each other is a better world and a world worth building. And on the way, have loads of fun with us.<p>Please contact me at nam@webcred.co with anything, I would be happy to talk to you.","time":1346512623,"type":"comment"},{"by":"snowmaker","id":4464523,"kids":[4492296],"parent":4463689,"text":"Scribd - San Francisco, H1B, INTERN are welcome<p>Scribd (social publishing, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired THREE people from these \"Who is Hiring\" threads, including one just a couple of month ago ... it really works!!<p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript<p>* iOS<p>* Machine Learning / Data mining kinds of problems<p>* Back-end problems: scalability, web crawling, analytics<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.<p>We're profitable, very well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>Looking for full-time and INTERN hires (junior year or older). H1B and relocation are no problem. See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1346522695,"type":"comment"},{"by":"colinhowe","id":4464146,"kids":[4468267],"parent":4463689,"text":"London UK. Mid/Senior Engineer. Conversocial.<p>We provide companies with a SaaS solution that helps them do customer service on things like Facebook and Twitter.<p>We're excited about improving customer service, we're excited about making enterprise software good instead of the usual trash that people have to put up with.<p>We primarily work in Python but accept good people from any background.<p><a href=\"http://www.conversocial.com/jobs\" rel=\"nofollow\">http://www.conversocial.com/jobs</a>","time":1346516371,"type":"comment"},{"by":"bgmasters","id":4463824,"parent":4463689,"text":"Amicus Labs - Designing for Law - San Francisco<p>We’re building software that will radically change how lawyers approach, analyze, and engage with the law. We use advanced case law parsing and tech-enabled human review to construct a detailed outline of the law. Leveraging that data, we can offer litigators legal search tools that are an order of magnitude better than existing offerings, as well as detailed analytics on legal arguments and AI tools that automatically assess and assemble litigation documents.<p>We're looking to add a designer to our small team of legal-minded engineers (Stanford, Berkeley, Google) and lawyers (Stanford, Columbia).<p>The law is intricate. Communicating it clearly is a serious design challenge. We are looking for someone who can shape not only our look and feel, but also how lawyers interact with the law.<p>You:<p>+ A record of creating beautiful software<p>+ The ability to implement what you design (HTML5, CSS3, JS)<p>+ Deep, sincere interest in law<p>+ Desire to forge a product that will change how justice is done<p>Us:<p>+ Backed by the most visionary investors in the world<p>+ Taking a big swing at truly hard problems<p>+ Excellent health/dental/vision<p>+ “No vacation policy” policy<p>+ Great office across the street from 4th &#38; King Caltrain<p>If you're interested in learning more, get in touch: careers@amicuslabs.com.","time":1346510787,"type":"comment"},{"by":"blitzcraig","id":4464129,"parent":4463689,"text":"San Diego, CA (La Jolla) - Fairway Technologies<p>We're looking for a Front End Engineer, preferably with C#/.NET back end experience.<p><a href=\"http://www.fairwaytech.com/careers/job-listings/\" rel=\"nofollow\">http://www.fairwaytech.com/careers/job-listings/</a><p>Fairway Technologies is a full service, software consulting company based in the village of downtown La Jolla. We know that the best developers are hard to find so we like to treat them well. That is why we offer a fun and relaxed environment in our new modern facility. Our culture includes casual attire (shorts, t-shirts, and flip-flops) and fun office environment with flat-screen televisions, game systems, foosball table and dartboard. (Just to name a few)  We work hard to meet the needs of our clients and want to make you comfortable during the process.<p>We offer competitive salaries, flexible schedule, 5 weeks of PTO, 401k Plan, and generous medical and dental benefits.<p>We allow our employees to have the ability to work with limited (to no) supervision, remotely, and commute to the office when traffic is light.<p>We all have a service-oriented attitude.  Our clients love us because we are helpful, friendly and reliable.<p>Fairway is California focused so there are minimal travel requirements and it is anticipated that duties can be fulfilled through a combination of working from Fairway's office in the village of La Jolla, on-site at the client or by telecommuting. This position is an exempt, full-time, W2 position (NOT contracting).<p>At Fairway, we believe in continued education so we hold optional weekly \"Code Brew\" weekly talks and \"Language Club\" discussions. Our sessions are informal and allow our team members to collaborate on new ideas and technological advancements.","time":1346516127,"type":"comment"},{"by":"wferrell","id":4464174,"parent":4463689,"text":"Palo Alto, CA - Runway 20 Inc<p>We're building an intelligent assistant on your smartphone.<p>We provide users just the information they need right as they need it and simplify task completion on the iPhone.<p>From telling you 20 minutes before you leave for work that there is a major accident on your typical route, to booking you a flight to NYC like a real personal assistant, we’re building an app to simplify your life.<p>We're looking for great people to join our small, well funded by startup!<p>Backend Software Engineers and Data Scientists<p>The deep technology problem is information retrieval and machine learning. The user models we build help us make predictions and determine how and when to present information.<p>We look for a B.S., M.S., or Ph.D. in Computer Science or equivalent\n2+ years of programming experience designing and shipping large components of backend services\nExperience programming in Python\nExperience designing and implementing APIs\nExperience with distributed systems and machine learning\nLinux or UNIX OS experience required\nExperience working with database backed web or client applications\nAn ability to write clean code -- and ship\nA passion for learning and always improving yourself and the team<p>iOS Engineers<p>We look for a B.S., M.S., or Ph.D. in Computer Science or equivalent\nExperience building iPhone/iPad apps\nAttention to performance and memory tuning\nExperience working with web services\nFocus on clean code\nAn ability to ship code -- and fast\nA passion for learning and always improving yourself and the team\nWe would love to see what amazing experiences and effects you have developed.<p>Please email me at wferrell at gmail.com with your resume. We would love to show you the product and share much much more about what we are building!","time":1346516732,"type":"comment"},{"by":"nuckin42","id":4464216,"kids":[4464267,4465694],"parent":4463689,"text":"Crimson Hexagon, Boston, MA<p>Software Engineer:\n<a href=\"http://www.crimsonhexagon.com/software-engineer/\" rel=\"nofollow\">http://www.crimsonhexagon.com/software-engineer/</a><p>Senior Software Engineer:\n<a href=\"http://www.crimsonhexagon.com/senior-software-engineer/\" rel=\"nofollow\">http://www.crimsonhexagon.com/senior-software-engineer/</a><p>We're a fun team and we're looking for people who enjoy coding as much as we do.  Our current engineering team is small which means everyone has a very strong influence on the product and everyone makes a difference.  On the cultural side, we have a very open and collaborative environment.  Weekly grocery deliveries to our full kitchen and free lunch every two weeks.<p>We use Java, Tomcat, Maven, Spring, Hibernate, PostgreSQL, and have too many Linux servers to count.  If big data and web applications are your thing, we're the place with almost 100TB of data and taking in over 100GB per day.<p>Any questions or resumes, send to gflynn &#60;at&#62; crimsonhexagon.com \nAnd we do read these, I was hired through the \"Who's Hiring\" thread from May.<p>Thanks!","time":1346517323,"type":"comment"},{"by":"mebassett","id":4467106,"kids":[4468250],"parent":4463689,"text":"London, UK - full time.<p>Universal Pictures International - Junior Developer/Data Scientist,\nInternational Research<p>We're certainly not a startup, but our department acts like one as much\nas possible.<p>We're building tools to forecast, simulate, and model the box office\nmarket.  We're developing simulations and models to give us estimates on\nhow the market responds to social media, weather, video games, et\ncetera, and we're building web apps and ipad apps to present this\ninformation to key people in a way they can use and understand.  We need\nyour help taking the project to the next level.<p>What you'll be doing:<p>1) Maintaining, debugging, and adding features to our existing apps\n(browser and ipad) that help people configure and use our simulations.\n2) Keeping our software on amazon ec2 online.\n3) Help us build new tools to allow people to interface with our newer\nmodels.\n4) Help us develop new models and simulations that can give us deeper\ninsight into how the market behaves and that can respond to historical\nand live data as it comes in (machine learning)<p>What we use:<p>* A lot of python (web.py) and javascript (jquery, jqtouch)\n* amazon ec2 for running the simulations\n* Whatever gets the job done.  We have code written in Racket, and we're\ncertainly not shy about experimenting with your favorite language.  (I'm\nlearning Haskell and plan to be using at work for some experiments, for\ninstance)<p>Who we're looking for:<p>This is primarily a programming position, so we're looking for someone\nwho is enthusiastic about coding and the tools they use, has an love of\nclean code, new languages and technologies, and likes statistics.<p>Bonus points if you like film, functional languages and mathematics.<p>Interested?  My contact details are in my profile.  Let's get in touch","time":1346597020,"type":"comment"},{"by":"david_shaw","id":4465358,"parent":4463689,"text":"Santa Barbara, CA (Remote OK): Security Engineer<p>What we do: Application Security, Network Penetration Testing, Security Policy review (choose one or more -- we're a fluid team!)<p>Redspin is a growing company that, while started in 2000, values the \"startup culture.\" We are small (~25 employees), located near the beach, and all have a serious passion for security.<p>We were recently featured in <i>Outside Magazine</i>'s \"Best Place to Work,\" (#62) and encourage community service, beach volleyball, and company hiking/backpacking/adventure trips. [1]<p>We send the whole team to a variety of tech conferences each year (usually DEFCON), and have a great system that fosters team cohesion via chat, weekly meetings, check-ins, etc.<p>Email jobs at redspin.com, and mention HN in the email/subject so we know where you came from :)<p>[1] <a href=\"http://www.outsideonline.com/outdoor-adventure/best-jobs/More-Best-Places-to-Work-Redspin-Inc-20120731.html\" rel=\"nofollow\">http://www.outsideonline.com/outdoor-adventure/best-jobs/Mor...</a>","time":1346538630,"type":"comment"},{"by":"jasoncartwright","id":4466748,"kids":[4468253],"parent":4463689,"text":"Potato is a developer-lead agency (no Flash developers! No account managers!) based in London, Bristol, Amsterdam &#38; San Francisco. Our clients include Google, PayPal, a number of startups and other agencies such as BBH &#38; Mother.<p>We're hiring for a variety of positions in a variety of locations, freelance &#38; full time, including:<p>Django Developer, London - <a href=\"http://p.ota.to/jobs/django-developer-london/\" rel=\"nofollow\">http://p.ota.to/jobs/django-developer-london/</a><p>Technical Recruiter, London - <a href=\"http://p.ota.to/jobs/technical-recruiter-london/\" rel=\"nofollow\">http://p.ota.to/jobs/technical-recruiter-london/</a><p>Django Developer, Bristol - <a href=\"http://p.ota.to/jobs/django-developer-bristol/\" rel=\"nofollow\">http://p.ota.to/jobs/django-developer-bristol/</a><p>UX Designer, Bristol - <a href=\"http://p.ota.to/jobs/ux-designer-bristol/\" rel=\"nofollow\">http://p.ota.to/jobs/ux-designer-bristol/</a>","time":1346584173,"type":"comment"},{"by":"shawnjan8","id":4464446,"parent":4463689,"text":"Vancouver, BC - Mobify<p>We're a company specializing in the mobile web. We're big on Javascript and Python. We have a client side javascript adaptation framework, Mobify.js, which we recently open sourced, and we're creating a web application GUI around it using Backbone and Django. We also have a bunch of performance enhancements tools for websites on our Cloud platform, also written in Django. We're also continuously adding to our Mobile UI framework. But words don't mean much without the code to back it up - check us out on Github!<p><a href=\"https://github.com/mobify\" rel=\"nofollow\">https://github.com/mobify</a><p>We're also looking for TONS of different kinds of people right now. Front/Backend Engineers, Designers, QA, Sales/Marketing, and a Community Ambassador. Check out the full list of jobs here:<p><a href=\"http://www.mobify.com/about/jobs/\" rel=\"nofollow\">http://www.mobify.com/about/jobs/</a>","time":1346521232,"type":"comment"},{"by":"robg","id":4464329,"parent":4463689,"text":"Boston, MA - Generalists<p>Neumitra is solving daily stress for health, productivity, and happiness<p>We're adding generalists to grow our mobile and web platform with our biosensor. Stress and stress-based disorders become manageable with software personalized by your physiology. We value passion for your craft and our long-term mission.<p>rob at neumitra.com","time":1346519281,"type":"comment"},{"by":"DLarsen","id":4464263,"parent":4463689,"text":"Ventura, CA - Connexity<p>We're looking for a full-time developer to help us build our next-generation online advertising platform. A \ntalented, highly motivated software engineer will fit right in with our small, focused team.<p>We offer ownership for every employee and unlimited paid leave in addition to the usual benefits.<p>Our architecture is unique, and our stack is purposefully diverse. We run Scala (w/ Akka), C, Ruby against Redis, Hbase and Postgres. We do a fair amount of MapReduce and enjoy the challenge of working with a sizable graph database.<p>Our ideal applicant has worked in a startup environment in the past and possesses significant experience across a broad range of skills and applications. Bottom line is that (like everyone else here) we're looking for \"A\" players. Salary DOE.<p><a href=\"http://www.connexity.com/about/jobs\" rel=\"nofollow\">http://www.connexity.com/about/jobs</a>","time":1346517977,"type":"comment"},{"by":"redm","id":4464190,"parent":4463689,"text":"Houston, Tx (The Woodlands) -- MediaFire<p>We are hiring for a variety of technical positions including Engineering (PHP, JS and C++), Quality Assurance and Graphic Design (Web and Video).  You will be working on our next generation products which include a suite of web, desktop, mobile, and infrastructure applications.<p>See more information and apply here: <a href=\"http://www.mediafire.com/about/jobs.php\" rel=\"nofollow\">http://www.mediafire.com/about/jobs.php</a><p>About: MediaFire is a fast growing and forward thinking company where your contributions will be seen and used by millions. MediaFire’s trademark storage, access and sharing features have been expanded to include an enhanced suite of collaboration tools and data backup. Our team is working on a line of new products that will take us into the future of the quickly evolving cloud storage space.","time":1346516912,"type":"comment"},{"by":"mikebabineau","id":4464428,"parent":4463689,"text":"Rumble - SF Bay Area (Redwood Shores, CA) -- <a href=\"https://www.rumblegames.com\" rel=\"nofollow\">https://www.rumblegames.com</a><p>We're a new, well-funded startup making and publishing AAA games for browser and mobile. We're making real games for a large audience. Not ultra casual, not niche-y.<p>Our first title is a cooperative multiplayer 3D action-RPG. Think Diablo on Facebook. But free-to-play, and no big download. No obscure plugins, either -- we use Flash, but you wouldn't believe it. Adobe says they've never seen anything higher quality in Flash.<p>Seriously, check out our trailer: <a href=\"https://www.rumblegames.com/kingsroad\" rel=\"nofollow\">https://www.rumblegames.com/kingsroad</a> (and that was 6 months ago)<p>We're in closed beta. Let me know if you want to give it a test drive.<p>Rumble is backed by Google Ventures and Khosla Ventures ($15mm series A). We have one of the strongest founding teams the gaming industry has ever seen. (No, really: <a href=\"https://www.rumblegames.com/about/our-team\" rel=\"nofollow\">https://www.rumblegames.com/about/our-team</a>)<p>We're both a developer and publisher of games, and we need help on both sides. If you want to develop the next generation of top-quality games, or you want to build and scale infrastructure to 1mm+ concurrent players, this is for you.<p>Positions: <a href=\"https://www.rumblegames.com/careers\" rel=\"nofollow\">https://www.rumblegames.com/careers</a> (contact me directly if something isn't listed)<p>Engineers<p>* Platform -- Java/Groovy/Grails/AWS (esp. Senior and Architect/Lead/VP)<p>* Web -- HTML+CSS+JS+(PHP/Python/Ruby)<p>* Game -- Flash+AS3/Java/C/C++/C#/Unity<p>* Data -- Hadoop/R+ML/Stats<p>Other<p>* Producers<p>* Product Managers<p>* Analysts<p>* Artists<p>* Designers<p>Drop me a line: mike.babineau@rumblegames.com","time":1346521014,"type":"comment"},{"by":"aamar","id":4464791,"parent":4463689,"text":"Los Angeles (Central LA): seeking developers.<p>Unfold's mission is to help people everywhere understand any issue of public debate.<p>We use primarily Clojure but welcome strong, entrepreneurial developers of all sorts. Some functional experience (Lisp, Scheme, Haskell, Ruby, etc.) preferred. We're seeking generalists who can work on everything from web front-ends to mobile apps, machine learning algorithms, crawlers, and NoSQL  databases. Passion about the news, politics, technology debates, language wars, etc. are much valued.<p>We offer: market salary, superior equity, benefits, an environment that prizes learning and growth, and the opportunity to have a lot of say in tools, technology, and strategy.<p>More info and (optional) puzzle at: <a href=\"https://unfold.com/#about/lead-developer\" rel=\"nofollow\">https://unfold.com/#about/lead-developer</a><p>Contact us at jobs at unfold.com","time":1346527488,"type":"comment"},{"by":"kelnos","id":4465328,"parent":4463689,"text":"San Francisco (on-site, no remote)<p>Twilio: Senior/Junior Mobile Developers<p>We're looking for 2-3 mobile developers (probably 2 senior, 1 junior-ish) to help continue building our Twilio Client SDKs for iOS and Android (<a href=\"http://www.twilio.com/client/mobile\" rel=\"nofollow\">http://www.twilio.com/client/mobile</a>).  Experience with both platforms is a plus, but even if you've only done one, as long as you're interested in dabbling with the other, that's great too.<p>If you've done more than high-level app development (networking, audio, JNI on Android, or have dug into platform internals), even better.<p>Drop me an email at (kelnos | twilio - com) or apply at <a href=\"http://www.jobscore.com/jobs/twilio/senior-mobile-engineer/axM3CUTcqr4AcseJe4bk1X\" rel=\"nofollow\">http://www.jobscore.com/jobs/twilio/senior-mobile-engineer/a...</a>","time":1346537821,"type":"comment"},{"by":"amitmathew","id":4463936,"parent":4463689,"text":"Cambridge, MA. Uprise Medical (<a href=\"http://uprisemedical.com\" rel=\"nofollow\">http://uprisemedical.com</a>)<p>Business Co-founder<p>We're looking for a full-time business co-founder that has a history of getting things done and is willing to wear many hats across the areas of business development, marketing, and sales. We are aiming to improve patient education in a meaningful way and we need someone to help us make it happen. We are currently participating in the Healthbox Boston accelerator program.<p>Uprise Medical is an early-stage company aiming to improve health outcomes by changing the way healthcare providers deliver patient education. If you've ever had a loved one with a serious illness, you'll understand the importance of our mission and why we're so obsessed.<p>Send me an email at amit (at) uprisemedical.com and let's talk.","time":1346512810,"type":"comment"},{"by":"dgc","id":4465347,"parent":4463689,"text":"Santa Clara, CA: Backend Developer and/or INTERN<p>WhiteHat Security: <a href=\"https://www.whitehatsec.com\" rel=\"nofollow\">https://www.whitehatsec.com</a><p>We help secure the interwebs by telling our customers how their websites are vulnerable. We do automated black box testing of websites, workflow for our internal analysts, source code analysis, integration with popular security products and services, and (of course) UI and API so our customers can actually use the information we provide.<p>We're looking for smart people who aren't ideologically opposed to perl application development. Also programming language and framework experts. Also QA automation people. And we would like to train some interns to design and build RESTful APIs.<p>For more information you can poke at our website or email me ( dgc at whitehatsec dot com ).","time":1346538328,"type":"comment"},{"by":"RJaswa","id":4465150,"parent":4463689,"text":"San Francisco/Palo Alto: iOS, Ruby on Rails, Generalists<p>Email info@orbesquare.com<p><i>What we do: Or Be Square -- <a href=\"http://orbesquare.com\" rel=\"nofollow\">http://orbesquare.com</a> -- (as in 'be there or be square') is a mobile and web application that helps people discover events and activities they love and plan them with their friends.<p></i>Who: we're a small, passionate, fun group of guys that write code everyday, have worked at Bessemer Venture Partners/Microsoft/Amazon, and went to school at Berkeley/Princeton/MIT.<p><i>Why now: The beauty of our situation is that you get all the excitement and responsibility of being at an early stage company with huge potential, but you get to avoid much of the associated downside because we've already raised a bunch of money and get to spend lots of time with amazing advisors and investors who have helped make companies like Dropbox, Ticketmaster, Amazon Recommendations, Disney, ShoeDazzle, Playdom, etc., the amazing businesses they are today.<p>You'll get to be an instrumental part of the company that delivers what we and our supporters believe could, really, be one of the most important products in a person's life in the future.<p></i>What we've built:<p>(1) Sophisticated and scalable service-oriented architecture<p>(2) A sanitized, curated database of most of the events in the U.S.<p>(3) A recommendation engine that learns about user interests by crunching data from Spotify, Facebook, etc.<p>(4) Clever social functionality that neatly folds together Facebook, Twilio and more.<p>(5) Ticketing feature (with our API partner SeatGeek) that will immediately deliver material revenue when we launch<p>(6) An alpha front-end that gets slicker everyday<p>*What we can offer: competitive compensation, meaningful early stage equity stakes, deep technical problems, shiny aluminum toys to hack on, and a lot of fun.<p>If you're interested please shoot us an email at info@orbesquare.com!","time":1346533914,"type":"comment"},{"by":"dannyroberts1","id":4475680,"parent":4463689,"text":"Cambridge, MA<p>Dimagi<p>Role: Engineer/Adventurer/Do-Gooder<p>At Dimagi, your work can take you literally anywhere. We're looking for talented, adventurous coders to dive in to one of our core mobile health platforms already affecting hundreds of the world's poor and underserved. Our team of top-notch coders has on-site experience in over 20 countries covering East Africa, Central Asia, South America, and the Indian subcontinent, and travel is an important part of every developer's experience. Dimagi's prioritization of global impact and employee growth and satisfaction over the bottom line makes Dimagi a continuously fresh, exciting, and genuine place to work, and keeps us all honest about what we're in it for.<p><a href=\"http://www.dimagi.com/careers\" rel=\"nofollow\">http://www.dimagi.com/careers</a>","time":1346781693,"type":"comment"},{"by":"mrchess","id":4464155,"parent":4463689,"text":"Boston, MA -- Co3 Systems<p>We're a Series A funded company building enterprise software that handles legal response when sensitive data is lost. More about our service can be found here: <a href=\"http://bit.ly/S8zxz5\" rel=\"nofollow\">http://bit.ly/S8zxz5</a>, and our company page <a href=\"http://www.co3sys.com\" rel=\"nofollow\">http://www.co3sys.com</a>. Remember this is enterprise software so don't let the landing page fool you -- we are still building cool things. We're looking for Javascript and Java hackers. Currently a team of 3 engineers (company itself is 13) we use technologies like Hibernate, Grails, Backbone, and CoffeeScript. Fire me an e-mail if interested: jho at co3sys dot com. Full-hires and interns welcome.","time":1346516491,"type":"comment"},{"by":"Radim","id":4464966,"parent":4463689,"text":"Prague, Czech Republic; fulltime.<p>Looking for skilled backend engineers to join a small, dedicated team of developers. You'll be directly dealing with data from the world's largest publishers (Elsevier, Springer, Wiley)... and that's lots of data! The project is an academic search engine and our clients are the largest central + eastern european institutions (national libraries, universities): <a href=\"http://www.suweco.cz/en/who-we-are/\" rel=\"nofollow\">http://www.suweco.cz/en/who-we-are/</a><p>We require: experience writing scalable applications (in whatever sane language) &#38; good communication skills (English). We offer: competitive salary, possibility of working from home &#38; chance to make a difference. Contact: see my HN info.","time":1346530300,"type":"comment"},{"by":"raystar","id":4470209,"parent":4463689,"text":"Goals for Giving are looking for a junior full-time web developer to work on our new online charity fundraising application (<a href=\"http://www.goalsforgiving.com\" rel=\"nofollow\">http://www.goalsforgiving.com</a>).<p>Candidates must have an understanding and knowledge of HTML/CSS and Javascript. Additionally, exposure to Ruby/Python/PHP, Command Line experience and a familiarity with TDD (we use RSpec) would be great.<p>Bonus points for PhoneGap/iOS or Android development, Node.js, Redis, Mongo or Scala knowledge.<p>You will be working alongside our lead developer, helping build out from our current MVP into broader and richer application.<p>The position will be based in East London.<p>Email jobs@goalsforgiving.com for more information.","time":1346677723,"type":"comment"},{"by":"wehriam","id":4464747,"parent":4463689,"text":"New York City + Remote | Full Time | Open to Covering Relocation Costs<p>Designers | Community Managers | Developers<p>Four out of five people report a negative experience when buying a new car and most new car sales departments lose money. Tred helps solve these problems by allowing consumers to configure the perfect new car, then working with dealerships to find it at a great price.<p>We are pre-release, angel-funded, and backed by some of the biggest names in the industry, including the former CEO of General Motors.\nWe are looking for independent thinkers ready to build a company from the ground up. It would be great if you love cars - but you should love people more.<p>* Designers: Your portfolio should include click and touch interfaces. You want to write production level HTML and CSS.<p>* Community managers: You excel at marketing and support. You are excited about inventing and exploring technical solutions.<p>* Developers: You have strong front-end web skills and will rock our Node.js + Backbone.js based platform. You enjoy communicating with a diverse product team.<p>We are a small team with a diverse background:<p>* John Wehr, former CTO of <a href=\"http://flavors.me\" rel=\"nofollow\">http://flavors.me</a> and <a href=\"http://goodsie.com\" rel=\"nofollow\">http://goodsie.com</a><p>* Grant Feek, former private equity associate, former BMW sales, Harvard MBA<p>* Lead Investor Rick Wagoner, former CEO of General Motors<p>Where we are:<p>* We have been working out of <a href=\"http://generalassemb.ly/\" rel=\"nofollow\">http://generalassemb.ly/</a> in New York for the last six months<p>* The founders are based in Seattle until November<p>* We are actively looking for office space in the New York area<p>Email johnwehr@tredsite.com with \"Hacker News\" in the subject line. Please include:<p>* A quick introduction<p>* Your portfolio, resume, or Github account<p>* Any other materials you'd like us to see<p>Please also free to contact me on gtalk at johnwehr@gmail.com or Skype at 'wehriam'","time":1346526577,"type":"comment"},{"by":"xsmasher","id":4463893,"parent":4463689,"text":"Mobile Game Developer at TinyCo in San Francisco\n<a href=\"http://jobvite.com/m?3Rq9sfwC\" rel=\"nofollow\">http://jobvite.com/m?3Rq9sfwC</a><p>We make freemium games for iOS and Android in C++. Always looking for new client-side developers. Growing company with strong revenue from existing stable of games.<p>I'm happy to talk about the company; feel free to contact me.<p>Also looking for devs at new office in Vancouver, BC Canada <a href=\"http://jobvite.com/m?32q9sfwN\" rel=\"nofollow\">http://jobvite.com/m?32q9sfwN</a><p>Other positions (game designer, content manager, UI, UA, QA) hiring too: \n<a href=\"http://jobvite.com/m?33q9sfwO\" rel=\"nofollow\">http://jobvite.com/m?33q9sfwO</a>","time":1346512158,"type":"comment"},{"by":"jjrember","id":4464151,"parent":4463689,"text":"Boulder, Colorado<p>Datalogix is hiring:\nSoftware Engineers\nDevops Engineer\nIT Operations Engineer\nTest Automation Engineer<p>Checkout:  <a href=\"http://www.datalogix.com/careers/job-openings/\" rel=\"nofollow\">http://www.datalogix.com/careers/job-openings/</a>","time":1346516437,"type":"comment"},{"by":"2arrs2ells","id":4464749,"parent":4463689,"text":"Clever (YC S12) is hiring a full-stack engineer in San Francisco to hack education<p>Steve Jobs described education as one of the final frontiers still untouched by modern technology. Clever (<a href=\"https://getclever.com\" rel=\"nofollow\">https://getclever.com</a>) is building the data platform needed to for great software to make its way into the classroom. Just like Stripe has made it simple for developers to build payment processing into their apps, Clever has made it easy for developers to build applications for schools using student data.<p>We're a small team of highly technical hackers with deep experience in education. Since releasing the Clever APIs in June, we've signed up the most innovative education companies as partners and deployed our platform to over 1,000 schools. Clever moves data for over 350,000 students every day, and that number is growing rapidly.<p>Our growth has created some exciting problems around scalable systems, innovative APIs, and big data sets. We're looking to add a versitile engineer to the team to take on a wide range of technical challenges.<p>Things we're looking for:<p>+ Experience with consuming and/or creating RESTful Hypermedia APIs<p>+ Experience with a variety of languages (we use the best tool for the job, everything from Node.js to bash scripts)<p>+ Experience scaling up systems on AWS<p>+ Passion for changing education<p>What Clever offers:<p>+ Competitive salary + significant equity stake in well-funded company<p>+ A chance to revolutionize education<p>+ Flat &#38; close-knit engineering team with lots of peer code review &#38; pair programming<p>+ Great benefits - healthcare, dental, beautiful office<p>To apply, email us at jobs+n@getclever.com, where n is the number of students in the Clever sandbox API data set with a last name that begins with the letter 'V'.<p>Send us one or more things from [resume, github profile, recent side projects, linkedin URL, Stack Overflow profile, etc], and let us know how you solved our 'puzzle.'<p>This job is located in San Francisco, CA. You must be local or willing to relocate.","time":1346526590,"type":"comment"},{"by":"mjbellantoni","id":4464038,"parent":4463689,"text":"Boston, MA (South Station) | Yesware | Full Stack Dev and DevOps<p>Hello! We're looking for bright, friendly and committed people to come help us do things like:<p>* Provide near-realtime analytics from 100,000s of IMAP mailboxes.\n* Decouple our large Rails app into smaller services.\n* Scale our system by an order of magnitude.\n* Whatever you think we should be doing.<p>We use Ruby, Rails, Sinatra, Postgres, Mongo, Redis, jQuery, backbone and more.  YOU DON'T NEED TO KNOW ANY OF THAT, but you do need to be ready to figure it out on the job.<p>We're funded by Foundry Group and Google Ventures.<p>You can find details at the link below:<p><pre><code>  http://www.yesware.com/careers</code></pre>","time":1346514530,"type":"comment"},{"by":"sweis","id":4464835,"parent":4463689,"text":"PrivateCore is hiring in Menlo Park, Ca.<p>We're building a private computing platform that allows users safely use cloud computing resources without ceding control of their data. We're working on protecting from physical attacks: think reset attacks, cold boot, DMA, and malicious hardware.<p>Our work is focused on systems, virtualization, cryptography, and information security. We are funded and can offer competitive benefits.<p>Some of the roles we're looking for are:<p>* Kernel performance engineer<p>* Memory management researcher<p>* Security researcher<p>* Release engineer<p>* Lead QA software engineer<p><a href=\"http://www.privatecore.com/careers.html\" rel=\"nofollow\">http://www.privatecore.com/careers.html</a>","time":1346528236,"type":"comment"},{"by":"CiaranR","id":4463867,"kids":[4469514,4469823,4468279],"parent":4463689,"text":"Location: London, UK<p>Company: Skimlinks <a href=\"http://skimlinks.com/careers\" rel=\"nofollow\">http://skimlinks.com/careers</a><p>Positions:<p>Senior Software Developer &#38; Team Lead - Python, Go, C<p>Data Scientist - Hadoop, Hbase, MongoDB, Statistics, Machine Learning<p>Software Developer (Senior &#38; Junior) - Python, Go, C, PHP<p>Front-End Developer - Backbone.js, require.js, Highcharts, SASS.<p>What it’s like to work at Skimlinks:<p>- Big screens and fast computers (Linux, OSX or PC, up to you)<p>- Sociable company - Friday drinks and regular team lunches<p>- Office right on Old Street roundabout - more hipster coffeeshops that you could possibly need<p>- Unix platform on AWS<p>- Standups and a lightweight process<p>- Testing and Jenkins CI<p>- QA team - ever had someone on your team to whose job it is to double check your end product and catch any errors before release? It's good.<p>- A product team that understands why you might want to spend a sprint refactoring<p>- Hackdays, big data access on what millions of people are clicking on and buying (16 Billion API Requests last month)<p>- Open minded about trying new tools and technologies (any ClosureScript fans out there?<p>About the company:<p>Skimlinks is one of the most well-known UK-originated startups in the internet space, founded in London in 2007 and now with offices in San Francisco and New York. We have been described by Techcrunch as one of London's leading startups, and voted in the top 10 of the Guardian Tech Media Invest.<p>Skimlinks offers blogs, forums and websites the ability to earn an income from their content, by paying them a commission if readers click through and make an online purchase.<p>We consider ourselves a company that sells innovations, and in the last few years we have conceived and built a range of unique, compelling products that have shaken up the online monetization space.<p>Find out about what's it like working at Skimlinks at <a href=\"http://skimlinks.com/careers\" rel=\"nofollow\">http://skimlinks.com/careers</a>","time":1346511752,"type":"comment"},{"by":"adamseabrook","id":4477205,"parent":4463689,"text":"San Francisco, CA (Full time, H1B welcome)<p>Developer Advocate for Bigcommerce <a href=\"http://www.bigcommerce.com/\" rel=\"nofollow\">http://www.bigcommerce.com/</a><p>Bigcommerce is the worlds fastest growing SaaS eCommerce platform with over 27k paying customers. We are looking for a Developer Advocate to connect with companies that would benefit from integrating their platform with ours using our API.<p>Be the voice of the dev community inside Bigcommerce. Create a thriving ecosystem of third party applications by managing our $2m integration fund. Travel within the US and internationally as the face of Bigcommerce.<p>Who are you? Who, Who, Who, Who?\nWe see a developer advocate as someone that comes from a very strong engineering background but with a selfless developer community focus. You currently spend lots of your time blogging, refreshing HN ever 60 seconds, hanging out on IRC and StackOverflow helping newbies and experienced devs, contributing code and docs to open source projects, speaking at dev meetups, sitting on product or standards committees and participating in hackathons. If you are really good you have probably written a book or two that is a must read and have a few nifty side projects you hack away on when you have free time.<p>Apply:\n<a href=\"http://hire.jobvite.com/j/?cj=o8NJWfwk&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=o8NJWfwk&#38;s=Hacker_News</a><p>or contact me on:\nIRC-Freenode nick is AdamSeabrook or email adam.seabrook@bigcommerce.com","time":1346804023,"type":"comment"},{"by":"Skeletor","id":4464629,"parent":4463689,"text":"Mountain View, CA<p>drchrono: Improving Healthcare via our iPad/iPhone certified EHR for private practice doctors and patients.<p>1) FTE: Graphic Designer with strong product focus<p>2) FTE: Server side Python/Django engineers: Junior and Senior level<p>3) FTE: iOS Developers: Join the best of the best in the healthcare space.<p>4) Sales: Hiring entry level sales evangelists.<p>Read more at: <a href=\"https://drchrono.com/jobs\" rel=\"nofollow\">https://drchrono.com/jobs</a><p>Take our 1 hour hacker test here:  <a href=\"http://goo.gl/3oVVo\" rel=\"nofollow\">http://goo.gl/3oVVo</a>  \nIf you get a good score on the test you'll get a call from us.","time":1346524275,"type":"comment"},{"by":"jmvoodoo","id":4464692,"parent":4463689,"text":"Granicus - SF, Reno, Chicago<p>We are a passionate group of civic minded people looking to change the way government works for the better. There are about a hundred of us. We are a profitable. <a href=\"http://www.granicus.com\" rel=\"nofollow\">http://www.granicus.com</a><p>Looking for Rails/JS/UX/C#/C++ - polyglots preferred. Good head for engineering practices (testing, separation of concerns, etc) a must. Must be passionate about your craft, and making our government awesome.<p>Feel free to reach out to me. javier at granicus dot com for more information.","time":1346525532,"type":"comment"},{"by":"inieves","id":4498632,"parent":4463689,"text":"Samsung R&#38;D - San Jose - Software Engineering Manager<p>The Enabling Technology Team, within UXCA, is currently recruiting a world-class Software Engineering Manager to take our recently started 2-person software team to 8 people in 2013, and beyond. This team will be responsible for working with our user experience design team to build prototypes, and test new technologies, before the company moves our concepts and technologies to market.<p>This position reports to the Director of Enabling Technologies, and includes the opportunity to have a direct influence on the product plans of the world's largest mobile phone maker, while still working in a tight-knit, fast moving and highly entrepreneurial team.<p>Responsibilities:\nBuild a high performing team of software engineers to create smart-phone UX prototypes, and frameworks for testing and deploying new technologies.\nResponsible for growth and development of team members.\nResponsible for architecting team structure and dynamics.\nPreparing executive reviews of team outputs to the top executives in Samsung Mobile.\nCollaborate with design leads on producing stunning, cutting edge interfaces.\nCollaborate with hardware leads on prototyping and evaluating new technologies.<p>Learn More &#38; Apply At:\n<a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=3632351\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=3632351</a>","time":1347259618,"type":"comment"},{"by":"breckognize","id":4465396,"parent":4463689,"text":"Pittsburgh: Technical Generalist / Front-End Engineer at Shoefitr<p>We make software that helps online shoe shoppers find the best-fitting shoe. We’re looking for a talented front-end engineer to help us shape the future of Internet apparel retail.<p>You will join a talented engineering and design team that has worked on everything from Microsoft’s C++ compiler to high frequency trading algorithms.  We think you’ll learn a lot from us, and we look forward to learning a lot from you.<p>You’ll work with us to build out our product offering for footwear and apparel retailers. This will involve working with our designers to make UX decisions, prototyping experimental features, and building reusable Javascript components to simplify development. We expect you to be a “full-stack” programmer, but most of your time will be spent developing the user-facing pieces.<p>About you:\n- BS in Computer Science or equivalent experience.\n- Mastery of JavaScript, HTML and CSS. Experience with other dynamically-typed languages a plus.\n- A product portfolio that demonstrates you can build and maintain incredible user experiences.\n- Excited to learn any technology we throw at you.<p>Bonus points if:\n- You love shoes. Like, seriously.\n- You enjoy conducting user tests. \n- You’ve run a marathon (or at least a 5k).<p>Benefits:\n- Stock options\n- Market salary\n- 4 weeks vacation\n- Allowance to pick your own hardware<p>Please apply through our website at <a href=\"http://shoefitr.com/careers.php\" rel=\"nofollow\">http://shoefitr.com/careers.php</a>","time":1346539475,"type":"comment"},{"by":"onthiscarousel","id":4477314,"parent":4463689,"text":"\tDescription: We are looking for motivated and hard-working web and mobile developers that can help us create software tools for the entertainment industry. Local to Los Angeles a plus but not a requirement.<p>What we’re looking for in you:<p>Web Dev - Solid working knowledge of Python (Django), JavaScript, HTML and CSS. Experience with object-oriented JavaScript is a big plus. We are looking for people who can learn quickly and can build on top of what we have already created.<p>Mobile Dev - We’re looking for someone with some experience in iOS and a solid background in programming. Ability to create an awesome mobile version of our web applications.<p>About us:<p>We are a start-up making software tools for the film and television industry. We have been developing a sophisticated web application over the last two years that will change how the work behind films and television shows are created. This is cutting edge technology in a niche market with major studios signed on to use the software upon completion...<p>We’re located in Los Angeles but you can be from anywhere in the US. We are a smart and flexible little company trying to create something that hasn't been done before - an overused statement that can truly be applied to this project. The positions are freelance/contract jobs until<p>What Now:<p>If you’re interested, send us an email to programmer.inquiry@gmail.com with “Interested Programmer\" in the subject line. Include a resume please.","time":1346806116,"type":"comment"},{"by":"cmancini","id":4464435,"parent":4463689,"text":"New York City: Software engineers, Front-end devs, and agile QA engineers wanted at Intent Media.<p>We have a proven and rapidly expanding advertising platform that runs hotel and flight advertising on many major travel sites. From an engineering end this means true big data and performance considerations. This also means we can really feed our user segmentation algorithms and tune so that we make a better travel experience for users while boosting ROI for advertisers and bringing alternate revenue to publishers.<p>We're agile, test everything, and deploy several times a week. We write top-notch Java and Ruby, and Javascript code, with Cucumber, Python, Coffeescript, and Pig mixed in.<p>Everyone here has really interesting stories and are the brilliant, fun kinds of people you want to spend time with. The office is in the heart of SoHo, the hippest area of the best city in the world. We usually eat lunch together from one of the amazing local restaurants, like little Italian sandwich shops and fun Indian take-out restaurants. Employee dogs play around the office all day too.<p>We're well-funded after a series B. We have great investors like Matrix and Redpoint, and have a great growth story to tell.<p>Feel free to reach out to the email in my profile and of course there are more details at <a href=\"http://www.intentmedia.com/jobs\" rel=\"nofollow\">http://www.intentmedia.com/jobs</a>.","time":1346521067,"type":"comment"},{"by":"edawerd","id":4464761,"parent":4463689,"text":"San Francisco: Rails and Javascript Full Stack Engineers<p>Full Time Positions at ZenPayroll<p>About us: We're a team of second time entrepreneurs, tackling the massive payroll market. If solving a real pain point for millions of people gets you excited (plus the chance to build a significant, meaningful company), we'd love to speak with you. We have big ambitions and the resources to make long term bets. Our team is made up of Stanford engineering alums who have had two prior exits. We're hungry to build something truly great and we're in this for the long haul. We're well-funded by some of the best investors in Silicon Valley and we're looking for like-minded engineers to join us.<p>Skills: Some technologies we use include -- Rails | Backbone | MySQL | Coffeescript | Sass. If these technologies excite you and you want to work on a product that has the potential to transform an industry, we'd love the chance to share our vision with you. We employ a test driven development process.<p>There's a ton of work to be done, and you'll be a core member of our team as we grow the company. You'll receive a highly competitive salary, a sizable equity stake, relocation costs, and we'll geek you out with your dream work equipment. Other perks include a housing stipend if you live near the office, three meals a day, company retreats, gym/sports club stipend, and more. You'll work out of a beautiful office one block from South Park in SoMa, San Francisco.<p>If you're interested, send us a note at jobs [at] zenpayroll [dot] com and include your LinkedIn, GitHub, and/or any project pages.","time":1346526894,"type":"comment"},{"by":"kittkat","id":4476471,"parent":4463689,"text":"Boston, MA - MIT Startup Seeks Python Developer<p>Want to help work on a product that is in use by over half a million people? A truly global service that is changing the way business is done in the developing world?<p>The idea for Jana started at the MIT Media Lab. Jana connects Western companies to developing world consumers.  We give away free mobile airtime in exchange for market research information or as an incentive to try a new product. To the users of prepaid phones in the developing world, this free airtime is as good as cash.<p>We are using Python, Flask, CouchDB and Redis. We host everything with Ubuntu on EC2 and other Amazon Web Services. Git makes our codebase easy to work with. We have a small team of bright developers who get things done and like working together. We do not hire on a specific set of skills or list of buzzwords in your résumé.<p>We work with 4 of the top 5 consumer brands world wide, but we're still very much a startup. For fun we play ping pong, or Settlers of Catan. We have a \"magic\" kitchen whiteboard where anything you write down shows up in the fridge the next day. Our office is in an awesome location on Boylston Street in Boston's Back Bay.<p>If you are a great problem solver and you want to work on changing the world, get in touch with us. <a href=\"http://jobsco.re/OVBhqL\" rel=\"nofollow\">http://jobsco.re/OVBhqL</a>","time":1346791942,"type":"comment"},{"by":"sachingulaya","id":4466255,"parent":4463689,"text":"San Diego: Post-doc position @ UCSD's Center for Advanced Radiation Therapy<p>You would be developing a next-generation radiotherapy treatment planning system based on a GPU-driven, cloud-based infrastructure.<p>Requirements: Engineering or science PhD, computational mathematics background, programming experience. A background in ML, data mining, or optimization are preferred but not required.<p>For more information email myusername@gmail.com and I will forward you the job posting and put you in touch with the lab director.","time":1346563384,"type":"comment"},{"by":"scottw","id":4463968,"parent":4463689,"text":"Orem, Utah<p>Company: BetterServers is a small (but well-funded—see below) Linux and FreeBSD VM-in-the-cloud hosting company (pre-beta).<p>Position: We need one or two awesome full-stack Perl or PHP devs. We have tons of work, including web design, DB and RESTful API integration.<p>You'd be employee #6. We have free food, drinks, a beautiful new office at the mouth of Provo Canyon. Our salaries are <i>highly</i> competitive (you'll work hard for it, too). Foosball and table tennis skills a plus.<p>Send a résumé to to mike at betterservers.com.","time":1346513419,"type":"comment"},{"by":"noahbrier","id":4468096,"parent":4463689,"text":"New York, NY. Full time. We're looking for devops, python engineers and frontend (js/backbone) engineers.<p>Percolate is a very quickly growing SAAS company in NYC. We are building a tool that helps brands create content across social. What makes us unique is that we're the only platform that doesn't already assume a brand knows what to say. To help them figure that out we pull data from across the web and make recommendations on interesting content (whether their own or third-party) that might be interesting at any moment.<p>We're looking for devops (!!!), backend and frontend engineers (we run backbone.js alongside our RESTful API) to join the team (the company is 21, product team is currently at 12). On the backend, we're especially interested in folks with good experience working with lots of data and excited to build real-time systems (we run python).<p>Here's a few reasons why you should come work here:\n- You are gonna work in SOHO on Broadway\n- Your chance to work with big data\n- You come in early: We're only-and-a-half a year old\n- As we get bigger, you will be able to focus on what you are good at\n- We are all different and we love it\n- GPL compliant company\n- You choose your workstation\n- You choose your tools\n- No worries, free your mind: NY salary + medical + dental\n- No vacation policy - does not mean no vacation ;)\n- Company invests in you: Fly to PyCon and other conferences\n- We prefer quality over quantity: Focus on clean code and test coverage\n- Your voice will be heard<p>If you're interested email us at jobs@percolate.com. If you have any questions you can email me directly at noah@percolate.com<p>Thanks.","time":1346619894,"type":"comment"},{"by":"orangethirty","id":4464148,"parent":4463689,"text":"Remote: Accountant and Lawyer for rapidly growing freelance practice and startup(s). [USA]<p>The job: Help me with my fast growing freelance practice and startup(s). To give you an idea, the practice just grew 230% in the last month. Startup(s) are getting traction at around 2.1% conversion rate. Internation experience (Europe) is a big plus.<p>What I need: To get things set up properly.<p>Experience with startups is very important. Flexible and able to explain things like I'm five.<p>Email in profile. Look forward to hear from you.","time":1346516402,"type":"comment"},{"by":"jseeba","id":4464543,"parent":4463689,"text":"Mountain View (we just moved onto the same street as YC)<p>BloomReach (<a href=\"http://www.bloomreach.com\" rel=\"nofollow\">http://www.bloomreach.com</a>) is a small, fast-growing startup that is tackling one of the Internet’s most fundamental problems: helping leading online businesses get their highest quality, most relevant content found by their consumers, when and where they want it.  We're delivering a 95% uplift in non-branded organic search traffic for brands like Neiman-Marcus, William Sonoma, Buy.com and others.<p>Here's a Quora post why one of our engineers chose to work at BloomReach: <a href=\"http://www.quora.com/Stormy-Shippy/Posts/There-is-this-little-company-in-Mountain-View-that-I-work-for-called-BloomReach\" rel=\"nofollow\">http://www.quora.com/Stormy-Shippy/Posts/There-is-this-littl...</a><p>Backed by Bain and Lightspeed.  See our advisors here: \n<a href=\"http://www.bloomreach.com/who-we-are/our-investors-advisors/\" rel=\"nofollow\">http://www.bloomreach.com/who-we-are/our-investors-advisors/</a><p>Take a look at open engineering positions here: <a href=\"http://jobvite.com/m?37H9sfw9\" rel=\"nofollow\">http://jobvite.com/m?37H9sfw9</a><p>Email jason at bloomreach dot com if you'd like to chat before applying.  Interns welcome too.<p>We commit to moving through the interview process quickly with you, if you're interested.","time":1346523032,"type":"comment"},{"by":"talipozturk","id":4464192,"parent":4463689,"text":"Locations: Palo Alto, CA | New York\nPosition: Senior Solutions Architect (fulltime)\nCompany: Hazelcast, Inc. (<a href=\"http://www.hazelcast.com\" rel=\"nofollow\">http://www.hazelcast.com</a>)\nHazelcast is an in-memory data grid solution.<p>As a Sn. Solutions Architect, you will work directly with customers and users to help them understand how they can use Hazelcast to achieve better performance and reliablity. Sn. Solutions Architect is an Hazelcast evangelist who loves giving trainings, talking at the conferences, being active in the community and consulting on distributed computing problems.<p>Responsibilities<p>Work with Sales personnel to provide technical support and develop proof of concept applications.  \nGive trainings, speak at the trade shows and conferences.\nBe active in the community. Blog and tweet about Hazelcast features/tips/news.\nCollect feedback from the community, users and customers, shape the future of Hazelcast.\nProvide architectural and advisory consulting for key accounts to ensure successful implementations.<p>Requirements<p>10+ years in software development.\nExpertise in distributed caching, scalability and highly available systems.\nStrong technical skills in Java, Spring, Hibernate and JEE.\nComfortable with Linux, Solaris, Unix and Windows.\n~25% travel.<p>Please contact careers at hazelcast dot com.","time":1346516944,"type":"comment"},{"by":"taurussai","id":4474545,"parent":4463689,"text":"Stealth startup (YC W12) - Mountain View, CA - Paid INTERN (local)/CONTRACTOR\nWe are building client side security software and are solving a relatively common problem (consumers/businesses)regarding cloud security.<p>You will be working with the founding team and get valuable experience in working in a startup environment. 12-14 week internship/Contract starting anytime immediately. Competitive pay.<p>What we're looking for<p>* A great programmer with a solid CS background. We want someone that spends time hacking outside work and has fun doing it. Ideal candidates would have deep experience in building client side software using one or more (plus) of the following :Qt/.NET/iOS/C/C++/Java plus experience working with some popular frameworks (Ruby on Rails / Django or a Java-based framework).<p>* Reasonable experience using Heroku, AWS (or Rackspace)<p>* Some systems programming experience including a reasonable understanding of OSes and crypto / security. It would be a huge plus if you have substantial experience with C/C++ and systems programming on Linux.<p>* Above all, a fast learner. We don't care if you don't know a technology, as long as you have the desire to learn.<p>To apply, please send a github/stackoverflow/whatever profile or links to other stuff you've done (and a resume if you must) to oakenthrones@gmail.com.","time":1346767481,"type":"comment"},{"by":"twohey","id":4465890,"parent":4463689,"text":"Los Altos: Machine Learning Scientist. Full Time (H1B okay) - Ness Computing <a href=\"http://likeness.com\" rel=\"nofollow\">http://likeness.com</a><p>We are machine learning specialists who work together on real-world challenges. Everyone on our team takes ownership of problem-solving, from ideas all the way through implementation. Our favorite types of problems are the ones that others consider impossible.<p>Everything the ML team builds is product-driven to solve a specific customer pain. While we are looking for people who are experts in a specific area, we believe that the best solutions come from collaboration. We expect people to apply their expertise to domains they have not previously worked in.<p>We use principled machine learning approaches, and encode product-level intuition and needs, but are comfortable with using heuristics to get the last mile.<p>You should be familiar with recent ML literature.<p>Bonus points if you have a deep background in one of the following:\n+  information retrieval / search ranking, natural language processing\n+  collaborative filtering, ontology management / data normalization\n+  data mining packages such as Weka, SAS, EViews, Matlab and R\n+  \"big-data\" frameworks such as Hadoop, HBase, or Cassandra<p>If what we are doing sounds interesting to you, please drop me a line.","time":1346551572,"type":"comment"},{"by":"kburkitt","id":4466029,"parent":4463689,"text":"Boxfish! \\0/ : Palo Alto, CA - Full Time: ANDROID, PHP/RUBY, JS, JAVA - INTERN/H1B OK (visa sorted)<p>Boxfish captures and indexes every word spoken on TV. Our mission is to harness this vast resource and deliver on our platform, beautiful and inspiring consumer focused products that reimagine TV discovery. We just launched our first product: the 'Boxfish Live Guide' - a TV discovery app and remote control (to a warm media reception: <a href=\"http://bxf.sh/N0B9ZV\" rel=\"nofollow\">http://bxf.sh/N0B9ZV</a>) and are continuing our march onto Android mobile, tablet, GoogleTv and connected devices.<p>We're a team of 10 and growing, with several positions for exceptional engineers:<p>- ANDROID: developers who can build beautiful products for mobile, tablet and Google TV devices. Bonus points for iOS experience.<p>- WEB (PHP/Ruby): developers to build beautiful, scalable, restful API's that feed from the index of television. Looking for someone who can lead API development, environment and manage a public facing API.<p>- JAVASCRIPT: developers who can build large scale (OOP/MVC) javascript applications that deliver realtime streams of data to responsive user interaces.<p>- JAVA: developers to build the index of TV! Build semantic processing pipelines in realtime, distributed services for trending, metrics and search applications (stack: AWS deployed Redis, MongoDb &#38; ElasticSearch).<p>If you're interested, get in touch! joinus AT boxfish DOT com<p>PRESS: <a href=\"http://bxf.sh/N0B9ZV\" rel=\"nofollow\">http://bxf.sh/N0B9ZV</a>\nJOIN US: <a href=\"http://boxfish.com/joinus\" rel=\"nofollow\">http://boxfish.com/joinus</a>","time":1346556879,"type":"comment"},{"by":"tlianza","id":4463836,"parent":4463689,"text":"Seattle, WA | CTO | Company: Zooppa<p>Love Rails? Interested in online video/advertising/distribution? Learn More!<p><a href=\"http://bit.ly/ZooppaSeniorDev\" rel=\"nofollow\">http://bit.ly/ZooppaSeniorDev</a>","time":1346511178,"type":"comment"},{"by":"racketeer","id":4464782,"parent":4463689,"text":"Locus Energy - Solar Monitoring startup in San Francisco. ?Looking for developers. Come learn about solar power, the grid, virtual irradiance (huh?) and build really fun/weird things for data scientists to help make solar power more affordable for homeowners. We're currently trying to staff up so there are a few positions available. Front end / back end / full stack... whatever you are, we'd love to hear from you. hr_tech@locusenergy.com","time":1346527268,"type":"comment"},{"deleted":true,"id":4463815,"parent":4463689,"time":1346510670,"type":"comment"},{"by":"triggit","id":4508444,"parent":4463689,"text":"Triggit - San Francisco<p>Jr. Developer working on RTB<p>What you’ll get to do all day:\nWork with the engineering team to make sure that the Ruby on Rails application, the Ad server, and all internal systems are running appropriately\nWork with internal users and external users to develop new features\nEnsure proper monitoring and metrics are being built into the applications\nFix issues and bugs\nPerform biz development research\nWork on partner documentation\nRespond to and handle after hour issues and be on call<p>Requirements:\nStrong communication skills and an ability to work with various user groups\nAble to quickly understand business logic and be able to translate into expected technical behavior\n0-3 years of experience preferably including Rails experience, Hive experience, preferably dealing with data at scale\nAn understanding of RDBMS, SQL, and database normalization\nDesire to work in a BDD environment\nUnix fundamentals and thorough understanding of HTTP and all its intricacies\nA detail-oriented approach to development and an interest in developing new skills<p>Apply at: <a href=\"http://hire.jobvite.com/j/?bj=oAuKWfwu&#38;s=Linkedin\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=oAuKWfwu&#38;s=Linkedin</a>","time":1347409038,"type":"comment"},{"by":"mehuln","id":4465854,"parent":4463689,"text":"San Francisco, CA (moving to city post-summer), Full-Time, Interns (Year Around) : <a href=\"http://flutterapp.com\" rel=\"nofollow\">http://flutterapp.com</a><p>We're looking for: - JavaScript Engineer, Node.js, jQuery - C or C++ Engineer - Python Engineers - Hadoop/MapReduce with Machine Learning - Writing API &#38; SDK - iOS Gaming Engineer.<p>jobs [at] flutterapp.com<p>Flutter (YC W12, A16z, NEA funded) is looking for folks interested in innovating, designing, and solving some tough problems.<p>We recognize gestures over the webcam, and our first app Flutter has been very well-received - check it out on Mac App Store.<p>We are looking for folks interested in computer vision, machine vision, using JavaScript to integrate gestures into browsers both computers and tablets.<p>Here's our link to iTunes Mac App Store page: <a href=\"http://itunes.apple.com/us/app/flutter/id522248613?mt=12\" rel=\"nofollow\">http://itunes.apple.com/us/app/flutter/id522248613?mt=12</a><p>We are still a small team, so you will have opportunity to set direction of the company both eng/product wise. You will learn, you will be challenged, you will have to strain your brain, and in many cases, solve problems that seem impossible! If you're up for challenge than send an email to jobs [at] flutterapp.com.<p>jobs at flutterapp.com","time":1346550453,"type":"comment"},{"by":"garysieling","id":4465584,"parent":4463689,"text":"Wingspan Technology - Whitpain, PA (outside Philadelphia)\nIntern and Full time<p>Wingspan Technology is a growing company servicing the pharma and energy industries. We sell a series of products that help our clients solve regulatory compliance problems- we're turning a client project into a new SaaS product and need developers (Java, Scala, .NET, etc), DBAs (Postgres, Oracle), and dev-ops.<p>www.wingspan.com or contact me for more information gsieling@wingspan.com","time":1346544362,"type":"comment"},{"by":"leeny","id":4464419,"parent":4463689,"text":"TrialPay - Palo Alto, CA (F/T, will cover relo)<p><a href=\"http://www.trialpay.com\" rel=\"nofollow\">http://www.trialpay.com</a><p>For the last 6 years, we've been quietly changing the world of online advertising. We work on getting users to try new products and services, install new mobile apps, play new games, and visit new stores by giving them stuff that they already want for free.<p>We're looking for strong back-end engineers and people who like playing with huge volumes of data.<p>aline@trialpay.com","time":1346520889,"type":"comment"},{"by":"drothlis","id":4463983,"kids":[4468248,4478411],"parent":4463689,"text":"London, UK -- graduate or junior developer -- full time<p>My team writes middleware (i.e. software that interfaces with OEMs' software\nand with the GUI team's software) for set-top boxes. We use a bit of C, a bit\nof C++, a bit of shell, a bit of Python. We have a great team and you will\nlearn a lot.<p>As your first task we'll probably get you to do some bug-fixes and feature work\non Polipo (an open source HTTP proxy) and you would be pushing your patches\nupstream.","time":1346513699,"type":"comment"},{"by":"anandkulkarni","id":4463856,"parent":4463689,"text":"FULLTIME and INTERN in Berkeley, CA.<p>Company: MobileWorks<p>Positions: Account manager, 1-3 yrs experience; growth hacker<p>We're building the world's best crowdsourcing platform, with a social mission to battle unemployment worldwide - starting with you!  We're looking for an account manager who can help us work with our top-tier clients, and a growth hacker, to help us grow the brand and client base.<p>Apply here: <a href=\"http://mobileworks.com/jobs\" rel=\"nofollow\">http://mobileworks.com/jobs</a>","time":1346511533,"type":"comment"},{"by":"rmalik","id":4476637,"parent":4463689,"text":"Snapguide is Hiring!<p>Location: All Positions - San Francisco, CA, Full-time, Intern, H1B welcome<p>Right now we're hiring strong software engineers that want to work on both our web and mobile products. We launched last March and were Apple's App of the Week on launch day. The team is a small group of strong technical generalists that implement features from the front-end to the back-end. We move fast while still making time for code reviews and writing unit tests. Official job description below.<p>Software Engineer<p>Responsibilities\n- Work closely with the core engineering team\n- Perform code reviews daily and write unit tests for your code\n- Work closely with our product and design teams to define feature     specifications\n- Ability to move fast and solve problems efficiently<p>Minimum Qualifications\n- B.S. or higher in Computer Science (or equivalent work experience)\n- Very strong in one of the following: Python, Objective-C, JavaScript\n- Knowledge of relational databases and SQL, preferably MySQL<p>More Info: <a href=\"http://snapguide.com/about/careers#engineer\" rel=\"nofollow\">http://snapguide.com/about/careers#engineer</a><p>Email: careers at snapguide.com<p>About Snapguide:\nSnapguide is a free iOS app and web service for those that want to create and share step-by-step \"how to guides.\" The service provides easy to understand instructions for a wide array of topics including cooking, gardening, crafts, repairs, do-it-yourself projects, fashion tips, entertaining and more.<p>Users are invited to create their own guides using the iPhone app. Snap pictures and videos of your project, add captions, and share your guide with the Snapguide community.","time":1346794108,"type":"comment"},{"by":"timanglade","id":4464138,"parent":4463689,"text":"Apigee (Palo Alto, REMOTE, H1B) — Java Developers and iOS Developers<p>Apigee is the API company. We are helping thousands of developers build API-driven applications every day. Our technology powers the APIs of eBay, AT&#38;T, GameSpy, ConstantContact, and hundreds of others. We are actively hiring developers for our Mobile Backend-as-a-Service offering. Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is about to hit GA. We are built on top of Jersey, Jackson and Cassandra (we gutted a lot of the latter and built our own indexing system, query system, storage format and multi-tenancy strategy on top of it).<p>We are looking for Java Developers to join our Core team and help us overcome the next generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>We are also looking for an iOS developer with strong C++ or Objective-C experience, an understanding of Cocoa programing methodologies and memory management, familiar with iOS4/iOS5 restrictions and new features added in iOS6. Specifically we’d love to talk to someone with a deep understanding of core network, logging, telephony, location and security framework, and who has the ability to extend some of the core functionalities there.<p>We offered catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>Want to apply? Have some questions? Want to join but don’t match either position? You should get in touch ➝ tim@apigee.com","time":1346516270,"type":"comment"},{"by":"theo","id":4464617,"parent":4463689,"text":"Pascal Metrics - Washington, DC (Georgetown) - H1B, Intern, Full-Time<p>The One-liner: We're trying to make patients safer by making hospitals safer.<p>We have a number of engineering positions opened.<p>Please checkout <a href=\"http://www.pascalmetrics.com/careers/\" rel=\"nofollow\">http://www.pascalmetrics.com/careers/</a><p>If you're interested in healthcare, improving work culture, hard technical challenges, please feel free to reach out to me directly to chat in detail.<p>theo.nguyen-cao at pascalmetrics.com","time":1346524014,"type":"comment"},{"by":"mp99e99","id":4468449,"kids":[4468452],"parent":4463689,"text":"Orlando, FL: Network Engineers/System Software Developers<p>Valley Area: Liason to promote our cloud to local business, attend meet ups:<p>Pre-Req: Hard Sciences background, Experience working in a service provider environment, natural intelligence and curiousity.<p>Atlantic.Net (<a href=\"http://www.atlantic.net\" rel=\"nofollow\">http://www.atlantic.net</a>) is a 19 year old service provider that has pivoted several times with our latest product being cloud (www.atlantic.net/cloud).<p>We are actively developing this with new features that aren't available anywhere else.<p>Network Engineer: Routing/Switching, Cisco, extensive experience in debugging and conceptually designing WANs/scalable LANs.<p>System Developer: Experience writing in C, /bin/sh, perl, sed/awk anything to scalably get things done in as clean a way as possible balanced by actually having to get things done.<p>Liason: Technical background, great personality and ability to communicate with technical people in a non salesdroid way. Help build our relationships with the community and promote us to local businesses that can take advantage of our product, plus keep contact with existing customers there. May require travel.<p>If interest, mail me direct mp at atlantic.net","time":1346626603,"type":"comment"},{"by":"pmchang","id":4524407,"parent":4463689,"text":"San Francisco: Experienced Web &#38; Mobile Software Developers<p>What we do: Scoot &#38; Doodle is a start-up dedicated to helping people build strong relationships with their friends and family through playful, creative, collaborative experiences and some serious face-to-face doodle time. Watch our video.\n<a href=\"http://youtu.be/DYh1RqXfaEY\" rel=\"nofollow\">http://youtu.be/DYh1RqXfaEY</a><p>We successfully launched our product on Google+ Hangouts last March. We now have  more than 100k monthly users making us Hangouts’ most popular, 3rd party developed premiere app. We've already won a Parents Choice Silver Award and a Children's Technology Review Editor's Choice Award for our app.<p>We plan to release our iPad app in the new year.<p>We're looking for thoughtful, no-nonsense team players to come work with us in our sunny, loft office space above a colorful auto-shop in the Mission.<p>Desired Developer Experience:\n* iOS development\n* Extensive Rails and JavaScript\n* CSS3 and HTML5 \n* Excellent communication and collaboration skills<p>Bonus Points For:\nAgile team experience (pair programming, refactoring, TDD/BDD)<p>Tell Us Your Story:\nEmail your cover letter and resume to patty@scootdoodle.com","time":1347663640,"type":"comment"},{"by":"paulyoung","id":4465587,"parent":4463689,"text":"CrowdTwist is hiring JavaScript / Front End Developers in New York City.<p>H1B candidates welcome, relocation offered.<p>CrowdTwist provides the most advanced multi-channel Customer Relationship &#38; Loyalty Platform on the planet for leading brands such as Pepsi, Miami Dolphins, Sony Music, Zumiez and more.<p>Our white label, SaaS technology gives marketers the ability to incentivize, recognize and reward people based on their combined engagement, social influence and spend - online and off.<p>From purchases and likes, to check-ins, follows, shares and more, CrowdTwist is revolutionizing the way marketers drive awareness, increase acquisition, improve retention, build loyalty, facilitate advocacy and measurably impact their bottom lines.<p>Join our smart team in New York City in a well-funded startup ($6MM Series A). We have a fun, generous company culture that's built on our fundamental principle that when you give more, you get more.<p>Find out more about CrowdTwist:\n<a href=\"http://companies.thedailymuse.com/companies/crowdtwist\" rel=\"nofollow\">http://companies.thedailymuse.com/companies/crowdtwist</a><p>Apply:\n<a href=\"http://jobsco.re/MAryr4\" rel=\"nofollow\">http://jobsco.re/MAryr4</a>","time":1346544506,"type":"comment"},{"by":"lamplighter","id":4464289,"parent":4463689,"text":"Toronto<p>Uken Games is looking for talented developers to help us build mobile games in JavaScript+Rails. We are also looking for web engineers / devops with a passion for performance and scaling.<p>We are a profitable startup (~40 employees) experiencing massive growth, with hundreds of thousands of players a day across iPhone, iPad, Android, BlackBerry and Facebook.<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1346518584,"type":"comment"},{"by":"bhonohan","id":4465064,"parent":4463689,"text":"New York, NY - Software Engineers / Front-end Developer,  FULLTIME<p>charity: water is a 6 year old non-profit organization bringing clean, safe drinking water to people in developing countries. 100% of all public donations directly fund water projects.<p>We raise 70% of our donations online, and tie every dollar donated to mycharitywater.org to the project it funds. Example: <a href=\"http://mycharitywater.org/p/myprojectsview?project_id=ET.GOH.Q4.09.048.132\" rel=\"nofollow\">http://mycharitywater.org/p/myprojectsview?project_id=ET.GOH...</a><p>// Front-end Dev - Looking for someone skilled in HTML5/CSS3/jQuery/Responsive design, to work on our websites, Email Campaigns, data visualizations and admin consoles.<p>// Software Engineers - Our platforms are built on a mix of PHP, Python, Java; Systems integration is key here. Data analysis and visualization skills are welcomed.<p>Full Descriptions: <a href=\"http://www.charitywater.org/about/jobs.php\" rel=\"nofollow\">http://www.charitywater.org/about/jobs.php</a>\nTo Apply: <a href=\"http://www.charitywater.org/forms/hr/job_application/\" rel=\"nofollow\">http://www.charitywater.org/forms/hr/job_application/</a>","time":1346532252,"type":"comment"},{"by":"curtis","id":4464571,"parent":4463689,"text":"Redwood City, CA - UI Engineer<p>Tidemark Systems (<a href=\"http://www.tidemark.net\" rel=\"nofollow\">http://www.tidemark.net</a>, note \".net\") is hiring.<p>Like everybody else in the industry, we're finding hiring to be a difficult problem. For those of us on the UI team it's been an extra challenge -- there are lots of people out there who have experience with toolkits like jQuery, Ext, Sencha Touch, and a whole bunch of other ones, some of which we've never heard of. But we're not simply using frameworks, we're pushing them well beyond what they were intended to do. So if you've got relevant framework experience, that's great. But we really need engineers that are good at the basics: JavaScript, DOM, HTML, and CSS. You'll also need to be decent at UI design and user experience. If you're not just good but great at either of these things (or both!), that's awesome, but we also need you to be able to write code. This isn't just a run of the mill web dev job. This is actual, hard core software engineering, it just happens that the stuff we're (the UI team) doing is all running in the browser.<p>Tidemark is building a hosted business analytics system, which is way more interesting than it might sound. The company is well-funded and we have people with decades of experience in the field.<p>We've got a bunch of other openings as well (see <a href=\"http://tidemark.net/company/careers\" rel=\"nofollow\">http://tidemark.net/company/careers</a>)<p><pre><code>    * Technical Support Engineer\n    * Director of People Operations\n    * Operations Engineer\n    * Graphic Designer - Web Developer Emphasis\n    * Sr. Technical Writer\n    * Enterprise Account Executive\n    * Application Tier Developer\n    * Computation Engine Developer\n</code></pre>\nIf any of these positions sound interesting, my email is on my profile page.","time":1346523462,"type":"comment"},{"by":"meganelacarte","id":4477440,"parent":4463689,"text":"Palo Alto, CA: FT Software Engineers (C++ / Python) - Manager, Front-End, Back-End, Generalists, &#38; Interns!<p>Will relocate.<p>E la Carte (www.elacarte.com) is revolutionizing the restaurant industry with our Presto touch-screen tablets, which enable guests to browse appetizing pictures of the entire menu, place orders, split checks, make payments, and play interactive games – all from the comfort of their restaurant seats without having to wait.<p>We're not just building an ephemeral website or apps - we're building an actual tablet as a platform and amazing software for restaurants across North America! Your grandmother will use this product.<p>Join our tight-knit team of 35 (~10 Engineers from MIT, Microsoft, and Amazon) in our Palo Alto house and help us scale up this fast-growing company. You'll wear lots of hats, have immense room for professional development and growth, and be able to make a huge impact on our product and organization.<p>You'll also be given a lot of flexibility but we have a few unalterable rules: be straight-forward, own your work, stay in touch, and get stuff done. We have fun too - dominate other local startups with us in soccer matches, take a break for an impromptu counterstrike battle, or chow down at our monthly BBQ.<p>Our favorite tools are Python and C++, but our platforms are complex and we learn new technologies daily. Most of our engineers get their hands on a variety of projects, although we could use specialization in the areas of Front-End and Back End. We even have opportunities for Interns and a Manager - just reach out!<p>You can view complete details on our company and specific openings at www.elacarte.com/about or take our challenge at www.elacarte.com/challenge so we can assess your skills instead of your resume writing abilities.","time":1346808531,"type":"comment"},{"by":"blinchik4","id":4476453,"parent":4463689,"text":"Official.fm - New York City - FULL TIME: Ruby Engineers, Frontend Devs - <a href=\"http://official.fm\" rel=\"nofollow\">http://official.fm</a><p>We create tools and services that help optimize the day-to-day of music professionals: labels, artists, etc. We use the latest technologies in order to rapidly iterate and build the best possible product for our users. We are a small company of around 20 creative people and our lean structure allows us to move fast, cut the crap, and ship.<p>We are not afraid to try new things: our labs team has written audio decoders in JavaScript for MP3, ALAC, FLAC, and AAC, along with a pitch detector. We know the difference between production code and research code. We love open-source and it loves us back.<p>The ideal candidate has:<p>* Expertise in Ruby, Ruby on Rails, and related technologies.<p>* Familiarity with modern tools, such as Git, SCSS, and other.<p>* Experience with agile methodologies, TDD, sprints and poker planning, daily stand-ups.<p>* An opinion. We want you to argue about the right way to do things. If something isn’t up to our level of quality, we expect an intervention.<p>* Excitement about music and desire to work in this area.<p>Our stack includes:<p>* Ruby on Rails 3<p>* Nginx + Passenger<p>* PostgreSQL<p>* Full text search<p>* Message queues<p>* JQuery<p>* Backbone.js<p>* Git<p>We’re offering you a full-time, permanent position in New York City to create the second product of our music platform (ask us for details).<p>If you think you’re fit for the job, ping us at jobs@official.fm and let’s talk!","time":1346791644,"type":"comment"},{"deleted":true,"id":4524001,"parent":4463689,"time":1347657293,"type":"comment"},{"by":"dbattaglia","id":4464848,"parent":4463689,"text":"New York City: Software Architect @ TMP Worldwide<p>TMP Worldwide is looking for a second developer to work on the architecture team, to help design and develop a core platform and back end systems for connecting our expanding suite of recruitment-related software products.<p>I'm not a recruiter, and TMP is not a start up, I am a developer myself in TMP's 5-person architecture team.  The work environment is really great, and I get to work on interesting problems every day.  We are a Microsoft shop, so strong C# and SQL Server experience is preferred.  We are using things like NServiceBus, MVC4, Solr, MongoDB, Backbone.js and lots of other interesting technologies.  This position has a lot of influence in future technology choices, along with plenty of room for creativity and experimentation.<p>If this sounds interesting, shoot me an email at Daniel.Battaglia@tmp.com, or apply using the link below:<p><a href=\"http://www.jobsattmp.com/new-york-state/web-development/jobid2691963-.net-software-architect_tech-lead-nyc-jobs\" rel=\"nofollow\">http://www.jobsattmp.com/new-york-state/web-development/jobi...</a>","time":1346528425,"type":"comment"},{"by":"chriszf","id":4467589,"parent":4463689,"text":"San Francisco: Fulltime<p>Do you like talking about code as much as you like writing code? Hackbright Academy is looking for instructors for our ten week code school. We teach a blend of practical engineering skills and computer science theory to a small group of aspiring engineers. More information on what we do can be found here: <a href=\"http://www.hackbrightacademy.com\" rel=\"nofollow\">http://www.hackbrightacademy.com</a>.<p>We're looking for engineers who really know their stuff and are looking for something different. Generalists or specialists of any discipline are welcome; we value communication more than any other specific skill. We write and teach in python and javascript, but that shouldn't matter to you.<p>Alongside teaching, your responsibilities will include designing curriculum and writing internal tools. We're offering a developer's salary, equity, and an absurd amount of vacation time.<p>We're not building earth-shattering software here, but we're empowering a new generation of engineers to do so. If that interests you, email me at c@hackbrightacademy.com.","time":1346607771,"type":"comment"},{"deleted":true,"id":4463700,"parent":4463689,"time":1346508415,"type":"comment"},{"by":"LiveTheDream","id":4464233,"parent":4463689,"text":"New York, NY -- Tapad -- backend developers/intelligent, motivated people<p>Tapad is a advertising technology company, specializing in real-time buying and making sense of the fragmented world where every user and household has multiple device, from smartphone and tablets to connected TVs and laptops.<p>On any given day, I might work on<p>* scaling our 100% Scala-based infrastructure to handle billions of requests per day with 95th-percentile response times in the low 10s of milliseconds<p>* adding features to our back-office webapp (Play) to help our account team manage dozens of campaigns and hundreds of strategies.<p>* analyzing billions of rows of data to uncover performance anomalies<p>* testing machine learning algorithms on said data, to create models that improve performance<p>* practicing my foosball game to ensure foosball dominance in the office<p>Tapad is a fun, growing place to work on high-performance software with a bunch of great people. We just recently took over the office next door to get more space. The dev team is a lean, mean crew of five. Drop a note to toby at tapad dot com.","time":1346517597,"type":"comment"},{"by":"finken","id":4477661,"parent":4463689,"text":"Salt Lake City, Utah | earthmine inc. | Full-Time | <a href=\"http://www.earthmine.com\" rel=\"nofollow\">http://www.earthmine.com</a><p>We’re looking for:<p>* Lead Software Engineer - immediate need for development in C# with .NET but if you have generalist skills, please be in touch!<p>More details:<p>* <a href=\"http://www.earthmine.com/Company?Jobs\" rel=\"nofollow\">http://www.earthmine.com/Company?Jobs</a><p>* <a href=\"http://www.youtube.com/user/earthmine\" rel=\"nofollow\">http://www.youtube.com/user/earthmine</a><p>* Being based in Salt Lake or Park City you’ll of course have the opportunity to leverage the powder rule: we’ll see you in the office at noon because a foot of fresh fell the night before.<p>Us:<p>earthmine collects, processes, and delivers high-resolution, 3D street-level panoramas. How are they 3D?  Every non-sky pixel in the panorama has a 3D coordinate: latitude, longitude and elevation. earthmine data is powering applications ranging from innovative local search and augmented reality to 3D mapping, GIS and asset management systems.<p>Interested?<p>* contact me directly: josh [dot] finken [at] earthmine [dot] com","time":1346812483,"type":"comment"},{"by":"f1gm3nt","id":4466007,"parent":4463689,"text":"Nashville, TN | Developer (On-Site) | Mostly PHP, some Ruby<p>The company I work for is seeking developers. We have had lots of interviews but haven't found the correct fit yet. We primarily work on Symfony 2 (<a href=\"http://symfony.com\" rel=\"nofollow\">http://symfony.com</a>) projects with some legacy Symfony 1.4. We are currently in the process of moving more of our projects to the \"cloud\". We have lots of clients and we are always busy. So if you like to stay busy, there will always be something to do.<p>The work environment is great. We have nerf guns, remote helicopters, and a large break room with free snacks and Mountain Dew. There is also plenty of fresh fruit and juice if that's what you're into.<p>Just for full disclosure, I'm a Senior Developer, not the HR department. You can check out our web site at <a href=\"http://iostudio.com\" rel=\"nofollow\">http://iostudio.com</a> or feel free to send me your resume Joshua.Estes@iostudio.com and I can pass them along to the HR department.<p>Thanks guys","time":1346556268,"type":"comment"},{"by":"axiom","id":4464112,"parent":4463689,"text":"Toronto, Ontario<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>) is hiring for a few roles: mobile dev (iOS, Android), sysadmin/infrastructure developer (rabbitmq, selenium, fabric, ec2), general web developer (python, django, javascript, node.js.) We also hire interns so please feel free to apply for that as well (paid of course.)<p>We're a profitable (and valley VC funded) education startup that helps make class more engaging. We've got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>Our dev team is in Toronto but we've also got an office in San Francisco so if you're really good we would be open to having someone work from there. If you're not based in Canada or the US but are willing to relocate feel free to contact us, because we do cover relocation expenses and will help you manage the work permit process.<p>Send your resume/github account to mike at tophatmonocle dot com.","time":1346515814,"type":"comment"},{"by":"zds","id":4465114,"parent":4463689,"text":"NYC: Product Designers, Communication Designers, Frontend Developers, Backend Developers, Infrastructure Engineers, Data Engineers<p>CODECADEMY has taught millions of people the basics of programming in just one year.  We started a year ago in YC and have brought basic programming literacy to people who didn't know the difference between JS and Java.  We have a lot more to teach and we're looking for designers and developers to help us get there.<p>The boring stuff: we're a small team (12 full timers) with opportunities for people to have an outsized impact.  We have the privilege of working with great investors (YC, Union Square Ventures, Kleiner Perkins, etc.) but, most importantly, of working with great peers (check them out here: codecademy.com/about).  People on our team are Rhodes Scholars, published poets, instigators of international movements, and more.<p>Join us and help the world learn to code.  codecademy.com/jobs or email us at jobs@codecademy.com.","time":1346533172,"type":"comment"},{"by":"noomerikal","id":4465672,"parent":4463689,"text":"LOS ANGELES - Blayze (MuckerLab Fall 2012 class) \nFULL-TIME and will consider PART-TIME<p>We are an early stage startup focused on optimizing the relationship between content creators and their fans.  We have recently been accepted into the Fall 2012 class of MuckerLab - one of LA's hottest startup accelerators.<p>Being a 4 person team, you will have a large influence and meaningful impact on product development, as well as, the ability to conduct interesting research.  Emphasis is on the team aspect, we have a good vibe going (no bro-gramming, no attitudes) and are looking to execute faster but still maintain that good feeling.<p>Working from the MuckerLab office, you will also be exposed to other startups, mentors and investors.<p>We are looking for lead and junior engineers with experience in any of the following:<p>- Building and optimizing sites in Ruby on Rails.<p>- Crunching big data with Java, Clojure, Hadoop, Storm, NoSQL, etc.<p>- Crunching big data with machine learning and data science.<p>Generalists welcome!<p>Ping me - Bennett Neale - bennett (at) blayze (dot) com","time":1346546352,"type":"comment"},{"deleted":true,"id":4463694,"parent":4463689,"time":1346508353,"type":"comment"},{"by":"laurentoget","id":4464759,"parent":4463689,"text":"Atlanta <a href=\"http://www.logicblox.com/careers/\" rel=\"nofollow\">http://www.logicblox.com/careers/</a><p>Partially remote/ H1B may be negotiated if you are a rock star.<p>We need database implementation gurus, programming language/compilers experts, experienced front-end framework developers, and strong app developers/solution architects motivated to learn a new platform.","time":1346526850,"type":"comment"},{"by":"adjohn","id":4464645,"parent":4463689,"text":"San Francisco, Barcelona, Tokyo - Midokura<p>Distributed systems, and networking developers / Front-End Developers / Integration Engineers / Sales Engineers<p>What we do: Distributed, de-centralized, software-defined virtual networks as a service for infrastructure as a service clouds. (SDN, Network Virtualization)<p>That's a lot of words, basically we're building scalable virtual networking for public and private clouds based on OpenStack and CloudStack.  We're a team of 22 spread across 3 offices (Tokyo, Barcelona, and SF).  We're venture backed, and hoping to grow our team to ~50 by the end of next year.<p>We are offering competitive salaries, great benefits, and pre-IPO stock options.  Since we're located in three great cities, you'll get to travel the world to work with teammates from the other offices.<p>We are challenging ourselves and learning things everyday, and want to find members who enjoy these challenges to join our great team.<p>Email adam at midokura.com.  Interns and H1Bs welcome.","time":1346524528,"type":"comment"},{"by":"smcguinness","id":4464671,"parent":4463689,"text":"Frisco, TX: DevOps<p>20% Ops 80% Dev. .NET shop, but also have potential to work on SIP platform, C, C++. Come join a great engineering team and a fantastic team overall.<p>Perks: Flexible work hours (no full time remote, sorry). Full benefits, team lunches twice a week, development freedom.<p><a href=\"http://www.call-em-all.com/About\" rel=\"nofollow\">http://www.call-em-all.com/About</a>","time":1346525078,"type":"comment"},{"by":"bentaber","id":4463746,"kids":[4463800],"parent":4463689,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour. We're looking for developers and engineers up and down the stack at all levels.","time":1346509476,"type":"comment"},{"by":"ipt","id":4466596,"kids":[4468268],"parent":4463689,"text":"London, UK - SamKnows\nFrontend developer/designer<p>SamKnows measures the speed and quality of thousands of residential broadband services, for regulators and ISPs around the world. We need an experienced javascript developer to build a UI and data visualisation frontend which our clients will use for statistical analysis, and to identify problems in their networks.<p>Initially, you will be building a rich (and beautiful) data charting app, with an intuitive UI to allow for complex filtering and aggregation options. Further down the road, there will be the opportunity to work on many other visualisation projects, including mapping and mobile development.<p>If this sounds like you, and you've got at least four years experience as a javascript/frontend developer (ideally 6+ years) and preferably a little PHP, then please write to cvs@samknows.com for more details.<p>This role is available on a permanent or contract basis.","time":1346576285,"type":"comment"},{"by":"shmoopjobs","id":4523849,"parent":4463689,"text":"Shmoop | Mountain View, CA | Software Engineer, Senior Software Engineer<p>Shmoop (www.shmoop.com) is a digital curriculum company that makes learning, teaching, and test prep materials that are - get this - smart and fun. We are on the hunt for a Software Engineer that is ready to jump in and get started!<p>About the job:<p>- Write clean, re-usable code. Elegant code that’s simple and will be read by your coworkers.<p>- Make browsers submit to your will. Ship things that look great and perform well<p>- Focus on building and shipping products based on spec.<p>- Be equally as anal in tackling the mundane as well as the challenging.  We're a startup, there's a lot to do.<p>- Be part of the core engineering team at an early stage startup.  We're onto something big, and you will be one of the core engineers here.<p>- Be ready to have major impact on the company.<p>Apply through our Jobs Page: <a href=\"http://www.shmoop.com/public/jobs/\" rel=\"nofollow\">http://www.shmoop.com/public/jobs/</a><p>Questions?  Email jobs at shmoop.com.","time":1347655424,"type":"comment"},{"by":"twillson","id":4464413,"kids":[4466385],"parent":4463689,"text":"Technical Co Founder | New York, NY | Experience in computer vision, information retrieval, and/or NLP/data-mining<p>We are looking for a hacker co-founder determined to succeed. You will be competing with Amazon, eBay, and Google - combined.<p>We are inventing the future of e-commerce through innovative tools to connect merchants to consumers. We have unchartered, tough problems to solve with a product that is already live.<p>The team - Marketing genius/business hustler Co Founder and CS PhD Technical Co Founder.<p>You are well rounded and frighteningly capable generalist that can tackle anything from Web design and frontend development, to Python on the backend and iOS if need be. We do have a preference for someone fantastic with computer vision, information retrieval, and/or NLP/data-mining, but we wouldn't prefer that over record of building and releasing cool stuff.<p>If you think you are the right fit reply to tiff@roomhints.com","time":1346520743,"type":"comment"},{"by":"XEKEP","id":4477819,"parent":4463689,"text":"Sunnyvale, CA. ☀ INTERN ok. Automatiks, Inc.<p>Today the lights are still off for one fifth of World population. Join us to help us turn them on.<p>Ok, you’ve made programming a part of your life and love your decision.<p>* You have a project coded by you from start to finish and it was not your school assignment.<p>* You developed for web before and liked it.<p>* You are passionate about intuitive UI, data visualization and want to dive deeper.<p>* You are a quick starter - and by that we mean hours, not days.<p>✰ You feel comfortable with hardware. Not a requirement, but a huge advantage.<p>Please tell us about yourself. Use ascii text only and make sure you addressed the items above. List programming languages you’re fluent in. What’s your favorite? Why?<p>We offer a fast-paced startup environment, a company of fun, passionate and sharp pros, and, initially, a place to stay in the SF Bay Area. We will compensate you competitively.<p><a href=\"http://www.automatiks.net/jobs/\" rel=\"nofollow\">http://www.automatiks.net/jobs/</a>","time":1346815387,"type":"comment"},{"by":"natrius","id":4464691,"parent":4463689,"text":"Austin, TX<p>Looking for a engineer and/or designer to join us as a co-founder to help make local news not suck. It's a large industry with mediocre products, and it's ripe for disruption. Your inner idealist will be glad to know that we're going to make people more informed about their cities and their votes while we make money.<p>niran@niran.org","time":1346525531,"type":"comment"},{"by":"benmeyer","id":4524041,"parent":4463689,"text":"San Francisco Bay Area or Remote - Full/Half Time<p>Outbound Marketing Manager for Koombea<p>Koombea (koombea.com) is a 70 person design and development consultancy that focuses on building Web and Mobile products for startups. We're looking for a talented marketer to lead our outbound efforts to increase our brand presence and acquire more top tier clients. This will include everything from online advertising to community management to social media marketing. Right now we're always at full capacity, but we're opening new international offices and hiring technical talent like crazy to take on new clients. We've got offices in San Francisco and Miami with our technical HQ in Barranquilla, Colombia (Basically Hawaii in South America).<p>I joined the company after a 3+ year stint at FB. I worked on a number of small projects and considered taking an investing job, but ultimately was convinced by our CEO that he could offer the best of all worlds. 2 Years later I'm involved in numerous startups, making my own schedule and hearing pitches from talented execs every day.<p>Why it's great to work for us:<p>-Set your own Schedule and Location<p>-Interact with early stage startups every day<p>-Expand your network rapidly<p>-Competitive Salary<p>-Work with World Class Engineers and Designers<p>What we want from applicants<p>-2 or 3 years experience with online marketing/social media marketing/community management<p>-Self Starter - we're very serious about this. You may be given minimal direction, but you'll always receive full support<p>-Excellent communication skills. 1:1 and 1:many are necessary. (Spanish Language fluency is a huge plus)<p>-Big Plus if you've worked at a frantic, fast moving startup.<p>If you're interested please email us at Ben dot Meyer at Koombea dot com. Send us your resume, linked profile or anything else that might impress us. Thank you.","time":1347657831,"type":"comment"},{"by":"cduser","id":4464033,"kids":[4464075,4464683,4466525,4470554],"parent":4463689,"text":"Why don't people from India or other countries post here?<p>Sorry for being off-topic but most of the companies here are from the USA.","time":1346514507,"type":"comment"},{"by":"bankim","id":4464066,"parent":4463689,"text":"Location: San Jose, CA - Full time\nNimble Storage: One of the fastest growing storage systems company.<p>System software engineers are welcome!\nPositions: <a href=\"http://www.nimblestorage.com/company/careers.php\" rel=\"nofollow\">http://www.nimblestorage.com/company/careers.php</a><p>If interested email me at bankim [at] nimblestorage [dot] com","time":1346514956,"type":"comment"},{"deleted":true,"id":4464393,"parent":4463689,"time":1346520432,"type":"comment"},{"by":"statico","id":4464116,"parent":4463689,"text":"Palo Alto, CA -- Senior Engineer at Artillery -- Full time, H1Bs welcome<p>Envision a world where all gaming moves into the browser... One where anybody on earth can access every game, from any device, at any time.  We've set out to change the face of gaming by dragging core gaming kicking and screaming into the browser using the latest HTML5 technology. Share this vision? Join us!<p>Currently we're leveraging open source technologies including Linux, C/C++, Python, JavaScript, Node.js and are keenly aware of all things HTML5, WebGL, and hardware-accelerated graphics. If you have experience in these areas already that's great, but if your expertise lies elsewhere, don’t let that stop you!<p>Backed by a stellar team of investors, angels and advisors.<p>More info at <a href=\"http://artillery.com/jobs\" rel=\"nofollow\">http://artillery.com/jobs</a>","time":1346515931,"type":"comment"},{"by":"XEKEP","id":4477828,"parent":4463689,"text":"Sunnyvale, CA. ☀ INTERN ok. Automatiks, Inc.<p>Electricity industry is ripe for a disruption.<p>A developer designing, coding, testing and troubleshooting software, firmware and hardware<p>You are a CS or EE senior or recent graduate<p>* You have a project coded by you from start to finish and it was not your school assignment.<p>* You programmed for at least one of: RS-232, SPI, MODBUS or CAN<p>* You can probe a device using undocumented protocol in a matter of hours, not days<p>* You feel comfortable with electrical hardware, both analog and digital<p>✰ You are familiar with feedback control, Matlab. Not required, but a huge advantage.<p>What is your favorite programming language? Why? ASCII text, please.<p>We offer a fast-paced startup environment, a company of fun, passionate and sharp pros, and, initially, a place to stay in the SF Bay Area. We will compensate you competitively.<p><a href=\"http://www.automatiks.net/jobs/\" rel=\"nofollow\">http://www.automatiks.net/jobs/</a>","time":1346815552,"type":"comment"},{"deleted":true,"id":4464686,"parent":4463689,"time":1346525451,"type":"comment"},{"by":"adparadox","id":4476445,"parent":4463689,"text":"Washington, DC (Alexandria, VA across from the King Street metro): full-time software developer.<p>Us: The Motley Fool provides financial investment advice to our members through free articles and paid subscriptions.<p>You: Use the right tool for the job (we currently have major sites in C#, Python and PHP, with a smattering of Ruby and Java floating around). Like solving problems and helping the world invest better. Like free food, unlimited vacation days, funny co-workers and ping-pong. Want to work at a company that is established, but still has a startup culture. Bonus points for funny cover letters and Github accounts.<p>Apply: <a href=\"https://tbe.taleo.net/NA6/ats/careers/requisition.jsp?org=TMF&#38;cws=1&#38;rid=323\" rel=\"nofollow\">https://tbe.taleo.net/NA6/ats/careers/requisition.jsp?org=TM...</a>","time":1346791562,"type":"comment"},{"by":"denik","id":4466094,"parent":4463689,"text":"Amsterdam, the Netherlands - SiteSupport Services B. V. - Senior Python developer.<p>We are looking for an experienced Python developer for full-time employment. You will be part of the core team helping to build and architect the backend of our main product.<p>We're a funded startup located in Amsterdam, the Netherlands, developing a web based co-browsing tool that will greatly simplify online support and sales.<p>We offer competitive salary, good benefits, such as reimbursed conference (e.g. PyCon) travel, reimbursed costs of relocation to Amsterdam, help with getting Netherlands' work permit for those outside EU.<p>Job requirements: <a href=\"http://www.python.org/community/jobs/#sitesupport-services-b-v-amsterdam-the-netherlands\" rel=\"nofollow\">http://www.python.org/community/jobs/#sitesupport-services-b...</a>","time":1346558479,"type":"comment"},{"by":"jjoergensen","id":4463804,"parent":4463689,"text":"Barcelona, near Plaça de Catalunya for an international deal-of-the-day site. Backend developers and frontend developers, with 3-5 years experience.<p><a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=3653674\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=3653674</a>","time":1346510444,"type":"comment"},{"by":"nikhilpandit","id":4465870,"parent":4463689,"text":"Grubwithus (YC W'11) - Los Angeles (Venice), CA - Full time<p>Grubwithus is built on Ruby on Rails and is looking for engineers to help us add new features and build a great experience for our users.<p>Requirements<p><pre><code>  - Experience with building and deploying Ruby on Rails applications\n\n  - Strong understanding of computer science fundamentals\n</code></pre>\nGood to Haves<p><pre><code>  - Experience with building an API for a web-service\n\n  - Experience integrating with social networks (Facebook Open Graph, Twitter, etc)\n\n  - Experience with testing frameworks and writing unit tests and functional tests\n</code></pre>\n<a href=\"http://grubwithus.theresumator.com/apply/Uxeq9w/Developer-Ruby-On-Rails.html\" rel=\"nofollow\">http://grubwithus.theresumator.com/apply/Uxeq9w/Developer-Ru...</a>","time":1346550842,"type":"comment"},{"by":"ismarc","id":4464762,"parent":4463689,"text":"Invodo, Looking for Senior Software Engineer\nAustin, TX, remote strongly unlikely\n(I'm going to copy-paste pieces from the job posting, but if you'd like more information or are just curious about what we're doing, drop me a line at mbrace@invodo.com).<p>What we do:\nInvodo helps businesses sell more through the power of video. As a full-service video solution, Invodo creates high-quality video at scale, delivers it through retail-focused technology, and publishes to Facebook, YouTube and retail channel partners to expand the impact. The Invodo video solution increases conversion rates, reduces returns and drives site traffic for clients including Internet 500 retailers and major manufacturers.<p>Invodo is an early-stage company so as a Senior Software Engineer you will play an incredibly important role in the success of both our clients and Invodo.<p>Software Engineers are expected to take ownership of substantial software modules, assist with technical product design, and contribute to the software engineering process at Invodo. The development will be concentrated on our core content management system and analytics platform (my.invodo.com). This customer-facing application software is written in Java/GWT using Hibernate and MySQL backend services.<p>Nearly all of our infrastructure services are written using Scala while the web application is currently written in Groovy (historical artifact at this point).  It's hard to cover everything we do technology-wise in a short post, but we have our own player, make heavy use of CDNs for content distribution, our own analytics system and platform as well as an end-to-end workflow management tool used internally and externally for the video production, management and hosting process (the latter is where we're looking to hire).<p>The entire engineering team is less than 20 people, including operations, professional services and management.  There are currently 9 developers (if I'm counting correctly) and all of the work the engineering department does is recognized throughout the company.<p>Feel free to send your resume/github/project urls to mbrace@invodo.com or ismarc31@gmail.com.","time":1346526895,"type":"comment"},{"by":"salar","id":4463820,"parent":4463689,"text":"Amsterdam, the Netherlands.<p>Silk (www.silkapp.com) is looking for Front-end engineers and a DevOps engineer.<p>We're building a product that makes it easy for people to create sites with content that is easy to query, visualize and share. On a deeper level, our vision is to bring the semantic web to the masses and build an amazing company around that.<p>We're working on many interesting and challenging problems, with a custom-built Haskell graph-database on the back-end and a cutting-edge Functional Reactive client-side framework in Javascript on the front-end.<p>The team is still small (~9 people), so you'll be able to make a large impact. We are well-funded by top-tier VCs and located in the city center of Amsterdam.<p>More on <a href=\"http://jobs.silkapp.com/\" rel=\"nofollow\">http://jobs.silkapp.com/</a>","time":1346510726,"type":"comment"},{"by":"bawb","id":4513759,"parent":4463689,"text":"SF or LA: Software Engineers for OUYA video game console<p>OUYA is hiring full-time front-end and back-end engineers who are proficient in Ruby on Rails, Android and Java programming.\nWork internally within the SF/Bay Area or remotely from the LA area (with occasional travel to SF).<p>- Ruby on Rails, Android, Java a MUST\n- Security experience a plus\n- E-commerce and payment backend experience a plus\n- Hardcore video gamers preferred<p>OUYA is a record-breaking, Kickstarter-backed video game console designed to be inexpensive, open and hackable.<p>Link to our Kickstarter page:\n<a href=\"http://www.kickstarter.com/projects/ouya/ouya-a-new-kind-of-video-game-console\" rel=\"nofollow\">http://www.kickstarter.com/projects/ouya/ouya-a-new-kind-of-...</a><p>Our web page:\nwww.ouya.tv<p>Please reach out at jobs@ouya(dot)tv","time":1347491017,"type":"comment"},{"by":"gobengo","id":4498993,"parent":4463689,"text":"As always, we're hiring like mad at Livefyre (real-time social as a service). We've built a pretty badass system handling hundreds of millions of monthly pageviews, top-15 US traffic, sometimes 100k concurrent long-poll connections. Python/Django, Java/Netty, Redis, Mongo, Celery, Backbone, Google Closure, Elastic Search, Hadoop. All kinds of fun stuff.<p>Hiring in BD, QA, Eng, PM (work with me!), Delivery, Sales, Ops. If you're smart and know what it means to get work done, we probably want to hire you. Lots of opportunities to work with big publishers and brands.<p>We're 50+ people and growing. Office is right on BART at 3rd/Market in San Francisco. Join us!<p><a href=\"http://www.livefyre.com/jobs/\" rel=\"nofollow\">http://www.livefyre.com/jobs/</a>","time":1347269859,"type":"comment"},{"by":"nflath","id":4464396,"kids":[4464438],"parent":4463689,"text":"Menlo Park, CA - FULLTIME, INTERN, H1B welcome<p>OptumSoft (<a href=\"http://www.optumsoft.com/jobs.html\" rel=\"nofollow\">http://www.optumsoft.com/jobs.html</a>)<p>Our company is a startup focused on redefining the way distributed applications are developed. We believe existing mechanisms for programming distributed systems are difficult and error-prone. To solve this, we invented a development platform to construct high-performance large-scale applications, and we are building applications using this framework to validate our beliefs.<p>We already have customers using our software in production environments.<p>We're looking for engineers with C++ development experience that have an interest in distributed systems and/or compilers.<p>If you're interested, please email me - nflath@optumsoft.com","time":1346520457,"type":"comment"},{"by":"aawecler","id":4479438,"parent":4463689,"text":"Yodle : New York, NY : Software Engineers, Software Engineers in Test<p>Yodle helps Americas small businesses get more customers. The work we do benefits the people who build and fix our homes, look out for our health and keep our automobiles on the road.<p>Yodle's engineering team (30 software engineers, 10 test engineers) powers a 800+ person company, that serves over 30, 000 customers.<p>We are looking for a few more engineers to join our team to help us reach our vision of making an even broader impact on the local business economy.<p>You can find out more about our engineering team and the roles available on our careers site here : \n<a href=\"http://www.yodlecareers.com/departments/technology/\" rel=\"nofollow\">http://www.yodlecareers.com/departments/technology/</a>","time":1346854422,"type":"comment"},{"by":"cmatthias","id":4465206,"parent":4463689,"text":"Cambridge, MA (Kendall Square) (on-site, no remote)<p>Software Engineer/Senior Software Engineer at Cogo Labs (<a href=\"http://www.cogolabs.com/\" rel=\"nofollow\">http://www.cogolabs.com/</a>)<p>Cogo Labs is a company that creates companies, kind of like an incubator with a twist: all of our ideas/startups come from within the company. We don't offer investment in outside startups. Thus far we have had two major ($100MM+) acquisitions, and a handful of smaller ones, and we are anticipating more in the near future. Typically, once a startup we are incubating gets off the ground, we hire employees into that startup and assist them with whatever they need to make the company successful. Cogo Labs itself has around 40 full-time employees now in our office in Kendall Square in Cambridge, MA.<p>I'm looking for a software engineer or senior software engineer to join my team. You should have a degree in CS or a similar field, and experience developing for the web, as most of our startups are web properties. Specific experience in Ruby, Rails, and/or Python are a plus, but not absolutely necessary. I'm more concerned with finding smart people than finding people with specific skills.<p>I am currently developing new features for a web site that we run that gets &#62;50k unique visitors per day, and you'd be assisting in this effort. I can be more specific if you're invited for an interview.<p>We are big on metrics and analysis -- there are grids of monitors (we call them \"NOC walls\") all over the office showing up-to-the-minute stats about all of our properties. I can code up a new feature, deploy it, and walk over to one of the NOC walls and literally watch my change affect traffic on the site, or revenue, or profit. It's a really fun place to work. Benefits and perks are great as well (see <a href=\"http://cogolabs.com/careers\" rel=\"nofollow\">http://cogolabs.com/careers</a> for more info).<p>If you're interested, shoot me an email (cmatthias at cogolabs.com) with your resume and a brief cover letter (be sure to mention you saw this post on HN). Bonus points for including a link to your github page or other code repository where I can see some code you've written.","time":1346534922,"type":"comment"},{"by":"kstenerud","id":4475383,"parent":4463689,"text":"San Francisco, CA (full-time, intern, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>We believe that education games don't have to suck, and judging by the popularity of our stuff, people agree!<p>Our apps have been downloaded 5 million times, with over 80 million words mastered by our users!<p>Apple voted us Educational App of the Year in 2011.<p>We have the #1 grossing apps in SAT and foreign languages.<p>We recently secured funding from Sequoia Capital, and are kicking it up a notch.<p>Do you want to disrupt the educational gaming space? We'd love to hear from you!<p>Backend engineer - <a href=\"http://mindsnacks.theresumator.com/apply/zmC1GW/Backend-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/zmC1GW/Backend-Engi...</a><p>Mobile engineer (Android or iOS) - <a href=\"http://mindsnacks.theresumator.com/apply/5t4zzv/Mobile-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/5t4zzv/Mobile-Engin...</a><p>Generalist engineer - <a href=\"http://mindsnacks.theresumator.com/apply/cj0OWK/Generalist-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/cj0OWK/Generalist-E...</a><p>Game designer - <a href=\"http://mindsnacks.theresumator.com/apply/19JX7q/Game-Designer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/19JX7q/Game-Designe...</a><p>Lead UI designer - <a href=\"http://mindsnacks.theresumator.com/apply/FDm1vD/Lead-UI-Designer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/FDm1vD/Lead-UI-Desi...</a><p>Games producer - <a href=\"http://mindsnacks.theresumator.com/apply/QkgdTJ/Producer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/QkgdTJ/Producer.htm...</a><p>Product manager - <a href=\"http://mindsnacks.theresumator.com/apply/bc0fOZ/Product-Manager.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/bc0fOZ/Product-Mana...</a><p>For more info, visit www.mindsnacks.com/careers or email us at jobs@mindsnacks.com","time":1346777576,"type":"comment"},{"by":"martian","id":4475672,"parent":4463689,"text":"San Francisco - Software Engineer<p>Thumbtack is hiring awesome software engineers to transform the way services are bought and sold online. We're Amazon for services. A quarter of a million small businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. We're well on our way to being profitable and growing quickly.<p>Our team is young and passionate and dedicated to good engineering. We have extensive benefits, including a in-house chef, a gorgeous office in SOMA, and money to spend on \nThumbtack services every month.<p>Our delicious food culture was recently the top story on Inc.com.<p>Apply at <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Or email chris at thumbtack with any questions.","time":1346781525,"type":"comment"},{"by":"dwk9080","id":4469395,"parent":4463689,"text":"Headlands Technolgies - San Francisco, CA - Full Time, H1B<p>Headlands Technologies is a quantitative trading firm based in San Francisco.  We have developed a high performance research and trading platform with connectivity to all major exchanges and we're looking for quant researchers to join our team. You would be working to develop new trading strategies to add to our system--a system which presently accounts for a significant amount of the daily trading volume on the major worldwide exchanges. You should be a fluent programmer, comfortable in C++, as well as proficient in some field of applied math.  You should also be extremely passionate about trading.<p>Please send resumes to careers@headlandstech.com","time":1346655432,"type":"comment"},{"by":"dchudz","id":4464726,"parent":4463689,"text":"Kaggle\nSan Francisco\nDeveloper<p><a href=\"http://kaggle.theresumator.com/apply/3s1xdU/Developer.html?source=HN\" rel=\"nofollow\">http://kaggle.theresumator.com/apply/3s1xdU/Developer.html?s...</a><p>As a Kaggle developer, you'll be building the platform that helps solve many of the most valuable problems in data science. You'll guide the development of tools that automate the process of setting up a competition, verifying winning models, and integrating those models into our customers' operations. The tools you will develop go the heart of Kaggle's mission and technology offering.<p>On a typical day, you will:<p>* use whatever machine and monitors you want.<p>* write code for our back-end using the latest version of C#, ReSharper, ASP.NET MVC, and Azure. Front-end developers use tools like jQuery, LESS, and often experiment with other tools like backbone.js.<p>* work on new code and tests in your own git branch.<p>* Develop and own entirely new features on our site.<p>* push your code to production (often every day) and see how our users use it<p>* follow the pulse of what’s happening in our company-wide chat room (today we discussed a cool paper on statistics in baseball)<p>* discuss new evaluation metrics and other data science-y concepts with the data science team<p>* participate in and learn from whiteboard sessions on things like how Gradient Boosting Machines work<p>* optimize pages based on profile stats<p>* investigate new tools, books, etc, to see if they might help make your development work better. Get whatever tools you need that help: no painfully long corporate approval required<p>* work with our data science guys to detect and mitigate suspicious activity on the site<p>* work with our designer on creating new views on the website.  He’ll make it look nice so you can focus on functionality in the model and controller. You're also encouraged to make the front-end look great if you like doing that.<p>* write code for back-end processing such as data analysis and submission scoring","time":1346526095,"type":"comment"},{"by":"blo","id":4464595,"parent":4463689,"text":"San Francisco, CA (SOMA) - Full Time<p>Stealth, not your typical X-for-Y-type startup - consumer web / mobile<p># Designers \n# Engineers (Full-stack / Frontend or Backend) \n# Mobile Developers \n# Data Scientists (Search / NLP)<p>---<p>We are a funded startup fundamentally changing how people interact with online services. We combine UX/UI innovation with data algorithms to allow users to accomplish tasks in a more usable, efficient, and social manner. If you're interested in making a product that people will use everyday, then you should check us out!<p>We work mainly with JS (jquery and node.js) and HTML5. Mobile developers should be familiar with iOS/Android.<p>Curious? Contact [my username] at alum.mit.edu. Please including your portfolio!","time":1346523778,"type":"comment"},{"by":"Robingow","id":4476495,"parent":4463689,"text":"Mountain View, Ca: Software Engineer<p>What we do: Addepar is recreating the infrastructure that powers global wealth management. Addepar's technology increases efficiency, transparency, and sophistication within the global investment industry, thwarting fraud and furthering meritocracy in one of the most important areas of the global economy.<p>Engineers form the core of our culture and team. At Addepar, we value software design, reliability, and user experience. We're looking to create a product and brand that inspires people and aligns incentives in the most important industry in the world. Help us invent the tools to run global finance.<p>What our engineers do:<p>- Optimize for performance, functionality, and stability. \n- Revisit and improve existing features, rethinking previous assumptions. Nothing is ever done. \n- Troubleshoot customer deployment issues requiring rapid identification and fixes. \n- Build massive datasets of the world's public and private financial graph, designing and developing tools and architectures to simplify the process. \n- Identify current software and design weaknesses, and help to develop solutions. \n- Apply theoretical expertise in computer science to real world problems.<p>Requirements:<p>- Technologist, by education or trade, with a fundamental understanding of Computer Science. \n- Experienced in concurrent programming, and developing low-latency/high-throughput software. \n- Personal projects or open source contributions you want to show off. \n- [Bonus] Deep proficiency in Java and/or Javascript.<p>We dress comfortably at the office, eat together, and play team sports together. We've been known to throw impromptu midnight parking lot BBQs (we built a bonfire once, but it didn't end well) and host movie nights in back of our building. Every Thursday evening, we break away from work to play a game of Innovation, Settlers of Catan, Dominion, or one of the many other games in the engineering pit. We don’t believe in excessive meetings, process or excessive contemplation; everyone is empowered and expected to make decisions.<p>Learn more: careers.addepar.com<p>Email: R2 (at) addepar dot com.<p>Interns and H1-Bs welcome.","time":1346792338,"type":"comment"},{"deleted":true,"id":4464940,"parent":4463689,"time":1346529767,"type":"comment"},{"by":"echoage","id":4465369,"parent":4463689,"text":"Toronto, Canada (remote possible)<p>Do you want to work on a meaningful project? At ECHOage, we are modernizing the birthday party experience with an innovative online tool that lets kids give to charity and get the gifts of their dreams.<p>We are looking for smart and passionate full-stack web developers. We value initiative and creativity. We offer great work-life balance and flexible work environment.<p>We use Groovy, Grails, Scala, plus the usual HTML, CSS, JavaScript, jQuery, MySQL, Linux, Git, and a few Java power tools. However, your skills and experience are more important to us than exposure to specific technologies.<p>Contact us at jobs+hn@echoage.com","time":1346538913,"type":"comment"},{"by":"designofc1","id":4465494,"parent":4463689,"text":"Irvington, NY 10533. Front end developer for CMS site. On-site contract assignment for two months, possibly more.  <p>Front end developer for CMS site of approximately 150 pages.  Must have substantial experience working with HTML5, CSS, stylesheets and building templates for CMS.  <p>Architecture and design is ready to go. Many templates to build and pages to populate.  <p>We need the selected developer to spend time with us on-site in our office in Irvington, NY, 10533 under oversight of a senior developer. If our developers achieve full satisfaction with their communication and interaction with you, your capabilities and initial development work, this may only be required for the first few weeks and occasionally during the assignment.<p>We will provide a description of the project and will request an hourly cost or full assignment bid.   This is a full time requirement of a minimum of 35 hours per week.<p>Send resume (or links to your professional profile). Provide links to sites you have developed that demonstrate relevant experience.<p>Recruitment professionals need not apply.  <p>Your Location: \nTri-state area: New Jersey, Connecticut or New York within 40 miles of the Zip Code 10533.<p>English Level:\nFluent in written and verbal English.<p>Independent Contractors Only\nWho We Are\nTDO Communications is a technologically deep full service brand and multi channel marketing communications agency.<p>We provide our clients with the research and evaluation, thinking and creativity, marketing and technology, analytics, accountability and service they need to reach or exceed their business objectives. \nWe are vastly experienced in branding and integrated marketing, with deep roots in web and browser-delivered design and development, SEO, SEM and other online marketing. \nWe are bound by principle and practical experience to deliver quality and business results.\nWe partner with progressive clients.<p>Our riverfront offices, in Westchester, NY are easily accessed from I287, I684, The Sawmill Parkway, Merritt Parkway, TZP and MTA Metro North, Hudson Line local out of Grand Central. (stopping 100 feet from our door.  )<p>www.TDOinc.com\nemail: joe@TDOinc.com","time":1346541885,"type":"comment"},{"by":"wheaties","id":4464588,"parent":4463689,"text":"NYC - Novus Partners: backend and frontend engineers<p>We work in Scala on the back end but don't mind training people up if they lack Scala experience. Our interviews are tough but the people we work with are just incredible. You don't have to be the next gift to mankind, just be comfortable in what you know and what you don't. I don't think there's anyone who doesn't hack on the side here.<p>Front end is written in jQuery and D3 with the signature open source project of nvd3 (novus.github.com/nvd3/) Take a look. Also, we don't support IE. Image that? Life is good.<p>(Edit) Oh yeah, great health care and no co-pays.<p>oreese AT novus DOT com","time":1346523737,"type":"comment"},{"by":"welder","id":4480304,"parent":4463689,"text":"Santa Clara, CA: full-time &#38; internships - Javascript, Perl, Python, Java<p>We automate hacking corporate websites. Over 10,000 per day currently. We also automate analyzing corporate source code for vulnerabilities. Modestly smart dev teams using Scrum.<p>For Javascript devs: We use Backbone.js, Require.js, Twitter Bootstrap, jQuery all talking to a JSON api.<p>For backend devs: We use Perl with Moose or Mouse, Python with Django, Memcached, Redis.io, Jenkins, Gearman.<p>Email alan@h4ck3r.org or alan.hamlett@whitehatsec.com.<p><a href=\"https://www.whitehatsec.com/abt/careers.html\" rel=\"nofollow\">https://www.whitehatsec.com/abt/careers.html</a>","time":1346865361,"type":"comment"},{"by":"rmorrison","id":4466090,"parent":4463689,"text":"Comprehend Systems - Palo Alto, CA - Developers<p>We make next-generation visualization and analytics software that works across multiple, disparate databases in real time. We tackle hard technical problems, are hiring smart entrepreneurial people, and are attacking a huge market opportunity!<p>Perks: Market salary, generous equity, lunch and dinner, laundry and wash-and-fold twice a week, gym membership, any computer setup you want, relocation to the bay area, health, vision, dental, and more!<p><a href=\"http://comprehend.com/careers\" rel=\"nofollow\">http://comprehend.com/careers</a><p>or email your resume to<p>careers@comprehend.com","time":1346558401,"type":"comment"},{"by":"clintcparker","id":4475787,"parent":4463689,"text":"San Luis Obispo, CA (Full-time)<p>MINDBODY is looking for a talented, enthusiastic developer to join one of our scrum teams. We make awesome applications for the health and wellness industry.<p>Preferred Qualifications:<p>-2+ years experience with UX focused development<p>-Strong OO &#38;&#38; Javascript experience (We use C# . If you don’t, that’s ok, we’ll help.)<p>-A passion for good design<p>Reasons to work with us:<p>-Outside magazine top 50 best places to work<p>-In San Luis Obispo (happiest place in USA)<p>Help us create delightful software!\nVisit <a href=\"http://www.mindbodyonline.com/company/careers/software-developer\" rel=\"nofollow\">http://www.mindbodyonline.com/company/careers/software-devel...</a>","time":1346782881,"type":"comment"},{"by":"nbclark","id":4464878,"parent":4463689,"text":"DoubleDutch (San Francisco) is looking for ambitious iOS/Android/web/backend developers to help bring mobile to the enterprise.<p>We offer competitive salaries and equity (of course), but also offer a great work environment based out of the Mission.<p>We already have top technology companies using our software (Cisco, HP, Adobe, etc.) and are looking to get our software in the hands of as many professionals as we can.<p>To learn a little more, visit <a href=\"http://doubledutch.me/about.aspx\" rel=\"nofollow\">http://doubledutch.me/about.aspx</a>, or email me directly at nclark _at_ doubledutch.me<p>Thanks!","time":1346528992,"type":"comment"},{"by":"designofc1","id":4465487,"parent":4463689,"text":"Contract developer on-site in Irvington, New York for two months, possibly more.  <p>Front end developer for CMS site of approximately 150 pages.  Must have substantial experience working with HTML5, CSS, stylesheets and building templates for CMS.  <p>Architecture and design is ready to go. Many templates to build and pages to populate.  <p>We need the selected developer to spend time with us on-site in our office in Irvington, NY, 10533 under oversight of a senior developer. If our developers achieve full satisfaction with their communication and interaction with you and your capabilities and initial development work, this may only be required for the first few weeks and occasionally during the assignment.<p>We will provide a description of the project and request an hourly cost or full assignment bid.   This is a full time requirement of a minimum of 35 hours per week.<p>Send resume (or links to your professional profile) and links to your sites that demonstrate relevant experience.<p>Recruitment professionals need not apply.  <p>Your Location: \nTri-state area: New Jersey, Connecticut or New York within 40 miles of the Zip Code 10533.<p>English Level:\nFluent in written and verbal English.<p>Independent Contractors Only<p>Who We Are\nTDO Communications is a technologically deep full service brand and multi channel marketing communications agency.<p>We provide our clients with the research and evaluation, thinking and creativity, marketing and technology, analytics, accountability and service they need to reach or exceed their business objectives.<p>We are a small familial group in a comfortable and casual environment, but vastly experienced in branding and integrated marketing, with deep roots in web and browser-delivered design and development, SEO, SEM (and other online marketing) and analytics.<p>We partner with progressive clients and are bound by principle and practical experience to deliver high quality and solid business results.<p>Our riverfront offices, in Westchester, NY are easily accessed from I287, I684, The Sawmill Parkway, Merritt Parkway, TZP and MTA Metro North, Hudson Line local out of Grand Central (stopping 100 feet from our door  ).","time":1346541655,"type":"comment"},{"by":"ila","id":4463706,"kids":[4464823],"parent":4463689,"text":"Madrid, Spain<p>Back End Developer / Full time<p>-----<p>Guildda wants to empower companies and individuals to transact in a new way, by disrupting an archaic industry. As Guildda’s Back End Engineer you will be responsible for delivering an amazing, secure, stable, fast experience to our users.<p><i>==Attributes of successful candidates will include==</i><p>- You are a full-stack developer<p>- Understands the entire LAMP stack and can contribute to any part of it<p>- Expert knowledge of server-side languages Python, Ruby, Java or C/C++<p>- Excellent knowledge of RDBMS systems; ideally MySQL<p>- Security obsessed<p>- Love your version control (Git)<p>- Likes getting hands dirty with 3rd party APIs<p>- Enjoys prototyping and iterating stuff<p>- BS or MS degree in Computer Science or a related technical field Back End Engineer<p>- Accountability, honesty, responsibility, flexibility… and a sense of fun and playfulness<p><i>==Responsibilities of the position will include==</i><p>- Build from scratch the entire technology architecture<p>- Be efficient writing code: less is more<p>- Design and implement Guildda’s core service<p>- Build a fault tolerant platform<p>- Work with frontend engineers to plan and implement new ideas and features<p>- Find and fix performance and reliability issues<p>You should aim to make working on Guildda just as fun and simple as using it. Few things make you happier than disrupting industries with as few lines of code as possible.<p><i>==What we offer==</i><p>- Pick your own gear (Mac/PC, OS, editor, etc.)<p>- Flat organisational structure and no bs<p>- Competitive salary + bonus<p><i>==Want to apply?==</i><p>To apply, please send an email with your resume (all in PDF, no LinkedIn URLs please) to the following address jobs@guildda.com with the job’s title as the subject line. Bonus points if you included a link to your Github repository and/or web applications.","time":1346508468,"type":"comment"},{"by":"hyuen","id":4464633,"parent":4463689,"text":"San Jose: software engineers, storage experience a plus<p>Nimble Storage, the fastest-growing storage start-up in history. Located in San Jose, CA, Nimble has developed breakthrough architecture that combines flash memory with high-capacity disk to converge storage, backup, and disaster recovery for the first time.<p>Nimble was founded by storage industry veterans from NetApp and Data Domain, and is funded by Sequoia Capital, Accel Partners, and Lightspeed Ventures, three of the most successful and respected venture capital firms in Silicon Valley.","time":1346524300,"type":"comment"},{"by":"etrgreg","id":4463770,"kids":[4465360],"parent":4463689,"text":"New York, NY - Full-time<p>ExpandTheRoom - Back-end Developer, Mobile Developer, UX Designer<p>ExpandTheRoom, a boutique creative agency, is looking for full-time Mobile Developers (Windows Phone 7, iOS, Android) as well as PHP Developers and UX Designers. We have a truly excellent team of developers and designers, and a fun work environment and culture. We'd also consider internships.\nYou can email us at iwannawork@expandtheroom.com, or check the site: <a href=\"http://www.expandtheroom.com/jobs\" rel=\"nofollow\">http://www.expandtheroom.com/jobs</a>","time":1346509838,"type":"comment"},{"by":"rsync","id":4465220,"kids":[4493469],"parent":4463689,"text":"rsync.net is hiring an implementation engineer.<p>We created 1TB and 10TB annual \"packages\" earlier this year, and one of the benefits that customers receive is a concierge level of implementation support.<p>Basically the customer declares what their environment looks like, and we design a solution that effectively (and efficiently) performs their offsite backup to us.<p>So for instance a customer might arrive with a collection of Windows VMs running on Xen, and this implementation engineer would dialog with the customer and decide whether to populate the account with physical (fedex) delivery, whether to backup the images from the underlying Xen system, or whether to do file level backup from inside the VMs.<p>This individual should have a very broad sysadmin-style technical background, ranging across UNIX, all variants of Windows, and Mac.  In addition, some idea as to how vmware/xen/hyperv environments work, as well as things like exchange/SQL Server/etc. - that is what customers have to back up.<p>This individual should be a \"lifer\".  If you're pursuing an exciting and lucrative career in the field of Information Technology, don't contact us.  If you're not running your own mail server, jailbreaking your own devices, running your own servers and appliances (FreeNAS, OpenWRT, etc.) at home, you're not going to fit here.<p>OTOH, if you're a \"fixer\" who can \"just make things work\" and can juggle a collection of high priority clients, please contact us:  info@rsync.net","time":1346535243,"type":"comment"},{"by":"benji-york","id":4474196,"parent":4463689,"text":"100% Telecommute (REMOTE)<p>Canonical<p>Technical Architect for Cloud Engineering Team<p>From the posting:<p>Alongside four or five engineers, you'll be part of an agile engineering\nsquad working to develop Canonical’s cloud technologies. You will be\nresponsible for designing and building new cloud products, and for ensuring\nthat the architecture of those products will remain valid over time.<p>Details at <a href=\"https://tbe.taleo.net/NA3/ats/careers/requisition.jsp?org=CANONICAL&#38;cws=1&#38;rid=533\" rel=\"nofollow\">https://tbe.taleo.net/NA3/ats/careers/requisition.jsp?org=CA...</a>","time":1346760907,"type":"comment"},{"by":"grandalf","id":4464684,"kids":[4467789,4465691],"parent":4463689,"text":"I'm looking for someone who wants to build out an awesome backend system using ocaml.  Telecommuting OK.  Please let me know how to reach you.  Sorry for the vague posting.","time":1346525426,"type":"comment"},{"by":"trimbo","id":4464265,"parent":4463689,"text":"San Francisco, CA.  Full-time.<p>Radius Intelligence is looking for back-end, front-end and full-stack engineers.<p><a href=\"http://jobs.radiusintel.com\" rel=\"nofollow\">http://jobs.radiusintel.com</a>","time":1346518034,"type":"comment"},{"by":"cartera_dev","id":4465317,"parent":4463689,"text":"Lexington, MA | Senior PHP Developer | Full time<p>Cartera Commerce is the leading provider of card-linked marketing solutions that increase revenue and customer loyalty for merchants, banks, card issuers and loyalty programs. We just recently raised another $12.2M in a round of investment.<p>We are looking for someone with 5+ years of experience building and deploying medium-large scale web based applications using Apache, PHP, MySQL, etc.<p>contact asadraei[at]cartera.com","time":1346537604,"type":"comment"},{"by":"jzoidberg","id":4465202,"parent":4463689,"text":"San Diego and Sunnyvale CA<p>Front end positions: html5 (with Play framework)<p>Back end positions: Scala with Hadoop (we don't require Scala experience just enthusiasm)<p>GridX - we are a well funded startup developing a unique new system to operate the next generation smart electricity grid. Our software wrangle smart grid data at scale to solve real problems that make a difference to everyone's lives.<p>Join us at the ground floor in this exciting and challenging field.<p>Please contact johan at gridx dot com","time":1346534866,"type":"comment"},{"by":"nemesisj","id":4466844,"parent":4463689,"text":"We're looking for a Django / Python developer for a 3-4 month contract.  You'll be helping us build a brand new product from the ground up and expected to provide a lot of input! We're based in Scotland but you can work from anywhere as our whole team works remotely.<p>Find the job description and how to apply here: <a href=\"http://www.getadministrate.com/about/\" rel=\"nofollow\">http://www.getadministrate.com/about/</a>","time":1346588107,"type":"comment"},{"by":"Randgalt","id":4464674,"parent":4463689,"text":"Los Gatos, SSE, Netflix: My team is looking for a stellar engineer to help us take the Cloud Platform to the next level. Details at bit.ly/PGo4mw\"","time":1346525180,"type":"comment"},{"by":"MemoryDealers","id":4465944,"parent":4463689,"text":"Santa Clara: www.memorydealers.com is looking to hire a full time, in house, Magento developer to help with the completion of a new Bitcoin based shopping website.  This is a full time, long term position as a web developer for MemoryDealers.com and other various Bitcoin related projects.  Please contact roger at memorydealers.com   (Position is available in Santa Clara CA, or Tokyo Japan)","time":1346553727,"type":"comment"},{"by":"rafeco","id":4465950,"parent":4463689,"text":"Brooklyn: Data Engineer, remote and relocation possible<p>Etsy is hiring for many technical positions, but my team in particular is hiring Data Engineers to work on our Big Data stack (both infrastructure and data analysis) and build analytics tools.<p>Read more at: <a href=\"http://www.etsy.com/careers/job_description.php?job_id=oG8IWfwc\" rel=\"nofollow\">http://www.etsy.com/careers/job_description.php?job_id=oG8IW...</a>","time":1346553994,"type":"comment"},{"by":"madlag","id":4464942,"parent":4463689,"text":"Stupeflix is hiring !<p><a href=\"http://studio.stupeflix.com\" rel=\"nofollow\">http://studio.stupeflix.com</a><p>Join a fun and thrilling team to build the best video creation tools !<p>Location: Paris, France and San Francisco, CA. (and possibly anywhere in the world ...)<p>Web Frontend / Backend developers (django, gevent, celery ...).<p>Computer Graphics gurus (OpenGL, GLSL).<p>AI masters (image understanding / classification / segmentation ...)<p>Video / photo artists (After Effects, Cinema4D, Maya...).<p>email: jobs@stupeflix.com","time":1346529850,"type":"comment"},{"by":"sidp","id":4464964,"parent":4463689,"text":"San Francisco Bay Area.  Full Time Developers<p>About us:\nCodenow (AngelPad S12) is changing the way developers code by pushing localhost to the cloud to make setup, switching branches, and sharing easy.  We enable this without making you change your favorite IDE, text editor, etc.<p>We are well funded and looking for full time developers.<p>Open Position:\n* Python Engineer\n* Cloud Engineer\n* Android Engineer<p>Contact us at sid at codenow.com","time":1346530295,"type":"comment"},{"by":"RichardPrice","id":4464680,"kids":[4465638,4466349],"parent":4463689,"text":"San Francisco, CA. Full time. Remote is fine too.<p>Academia.edu is a social platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>We believe that science is dysfunctional, and we are working on fixing it. Almost every innovation in medicine and technology in the world has its roots in a science paper. If we want to speed up the world, we need to speed up science. There are many inefficiencies in science:<p>* it's too slow (there is a 12 month time-lag between submitting a paper to a journal and it being published)<p>* all the world's research ends up behind extraordinarily expensive paywalls, even though it was authored and peer-reviewed for free by the scientific community<p>* it hasn't moved out of PDF-land yet (scientists haven't been provided with the incentives to share things like data-sets, code, videos, and other kinds of rich media).<p>We are working on fixing this. We dream of a world where research is shared instantly, as soon as it's finished; where scientists share their full scientific output (data-sets, code, videos, and comments on all this media), and not just papers; and where a villager in India has as much access to the world's scientific output as a professor at Harvard.<p>We need talented and passionate engineers to help us accomplish this mission. We have made a good start: 1.8 million academics have joined Academia.edu, and 3,500 join each day. But there is much more to do.<p>We're a 10 person, engineering-driven, team based in downtown San Francisco. The site is in Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd. We have raised $6.7 million from Spark Capital, True Ventures, Mark Shuttleworth (founder of Ubuntu), and others.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. We are looking to hire a range of positions:<p>* full stack engineers<p>* growth engineer (optimizing our growth and retention channels)<p>* iOS engineer<p>There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. There is more on TechCrunch about our mission here <a href=\"http://tcrn.ch/T42VWC\" rel=\"nofollow\">http://tcrn.ch/T42VWC</a> (The Future of Peer Review) and here <a href=\"http://tcrn.ch/R6Pgrr\" rel=\"nofollow\">http://tcrn.ch/R6Pgrr</a> (The Future of Science)<p>We want to hire world class engineers. We want you to join us in building the future of science whether you are based in San Francisco, New York, Delhi, or Beijing. Remote work is fine. We will handle re-location, including visas, if you would like to re-locate, but re-location is not necessary.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1346525333,"type":"comment"},{"by":"amacinho","id":4464084,"parent":4463689,"text":"Research Engineer, Crimson Hexagon, Boston, MA.<p>Do you have excellent programming skills in Java and at least one of the following languages: Python, Ruby, or R? And an interest/demonstrable knowledge in machine learning, data mining, and statistics?<p>We are looking for a Junior Research Engineer who will be part of our research team. You will be responsible to research, investigate and test new technologies for big data storage, processing, and analytics. In particular, you will build scalable systems that can efficiently process petabytes of data, build and maintain storage systems that are continuously updated and require holding tens of billions of records each with millions of fields. You will work closely with the research scientists in a challenging and nurturing environment.<p>Requirements:<p>Successful candidates will be able to demonstrate achievement in some or all of the above, and you will also be heavily evaluated for your attitude, approach and other intangibles. With that, more definitive criteria for the ideal candidate follow:<p>* Working with large datasets<p>* Unix command line tools<p>* MapReduce paradigm, Hadoop and HDFS<p>* HBase, Cassandra, MongoDB or similar key-value storage systems<p>* Social media, Web application development<p>Above all, we are looking for an engineer with a strong passion for working with large social datasets, who is not afraid of getting his/her hands dirty and who never gets tired of trying and learning new technologies. Our research team provides a spirited, supportive and creative environment where we can learn from each other and build the next-generation social media analytics frameworks.<p>If we have triggered your interest, send us your resume and cover letter telling us why you would like to be part of our team. Be sure to provide concrete examples of your programming skills, such as sample codes that solve your favorite toy problems, demos, web applications you built, public code repositories such as GitHub where you contribute to open source projects. If such examples are not available tell us that, and instead provide short descriptions of previous projects you have been involved in previous jobs or during your education. This is our Van Halen Brown M&#38;M’s test. Please be sure to provide this extra information along with your application.<p>We look forward to seeing if you have what it takes to achieve something extraordinary with Crimson Hexagon!<p>For details: <a href=\"http://www.crimsonhexagon.com/junior-research-engineer/\" rel=\"nofollow\">http://www.crimsonhexagon.com/junior-research-engineer/</a>","time":1346515306,"type":"comment"},{"by":"brunomiranda","id":4464235,"parent":4463689,"text":"iOS Developer, San Francisco, CA. Full Time.<p>Doximity creates products that help doctors communicate, to improve patient care and save lives. In 2 years, 15% of US doctors have signed up. Our products are mobile because doctors are on the move, and they are native because doctors don't have time to wait for HTML5. Our founder/CEO Jeff Tangney previously founded Epocrates, which is used by millions of doctors worldwide.<p>We are a forty-person startup in San Mateo, CA, backed by the investors behind Salesforce and Yammer. Our team includes incredibly talented individuals with MDs/MBAs/PhDs from fine institutions like UCSF, Stanford, Harvard and MIT and a college-dropout iOS engineer in the top 0.25% of StackOverflow.<p>More details: <a href=\"http://careers.stackoverflow.com/jobs/23255/ios-engineer-build-apps-that-help-doctors-doximity\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/23255/ios-engineer-bui...</a><p>Let me know if you are interested at bmiranda at doximity dot com","time":1346517644,"type":"comment"},{"by":"user1241320","id":4499325,"parent":4463689,"text":"Milano, Italy. Full time. Remote will be considered.<p>Beintoo.com, 'Le Web 2011'-award winning startup, is looking for a mobile developer (iOS or android) to join its team.<p>More details here: <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=3712449\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=3712449</a><p>Or email: info+hn@beintoo.com","time":1347278821,"type":"comment"},{"deleted":true,"id":4464198,"parent":4463689,"time":1346517107,"type":"comment"},{"by":"randy","id":4465984,"parent":4463689,"text":"Ridejoy (YC S11). San Francisco, CA. Full time.<p>Full stack engineer to help lay the foundation of our engineering team.<p>Interested in getting in on the ground floor of fundamentally changing the way people travel or, as one of our users said, \"restoring people's faith in humanity\"?<p><a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a>","time":1346555357,"type":"comment"},{"by":"osmeta","id":4465554,"parent":4463689,"text":"osmeta<p>Location: Silicon Valley (Mountain View)<p>Jobs:<p>1) Software Engineering - Full-Time or Internship\n2) User Interface Designer<p><a href=\"http://osmeta.com/about/\" rel=\"nofollow\">http://osmeta.com/about/</a> tells you a few things about the kind of people involved. It's not time yet for us to publicize details of what we do, but do look carefully at what our team members have done in the past.<p>For the software engineering position, we aren't looking for any specific domain expertise because what we're doing involves significant depth and breadth of knowledge and programming skills. It's highly likely that a great programmer with experience on any platform and in any compiled programming language will find our work interesting, challenging, and rewarding. Examples of \"any\" would be one or more of C, C++, and Objective-C on one or more of Android, iOS, Linux, OS X, and Windows.","time":1346543499,"type":"comment"},{"by":"CCs","id":4464567,"parent":4463689,"text":"HealthExpense - Full time positions in Sunnyvale, CA<p><a href=\"http://HealthExpense.com/\" rel=\"nofollow\">http://HealthExpense.com/</a><p>Lead Software Engineer of the Data Team: backend development using Scala or C++, SQL, Data mining.<p>Job description on LinkedIn: <a href=\"http://linkd.in/RxGALg\" rel=\"nofollow\">http://linkd.in/RxGALg</a>","time":1346523345,"type":"comment"},{"by":"felipellrocha","id":4464987,"parent":4463689,"text":"Dallas, TX - no remote. Intern ok. Full, or part time.<p>Globerunnerseo.com. Looking for developers to join a team of laidback people.<p>Needs to be a generalist, learns languages and frameworks as it's needed. We work mainly with php, and wordpress, and python and django. Contact at felipe(at)globerunnerseo(dot)com.","time":1346530852,"type":"comment"},{"by":"cdolan92","id":4464060,"kids":[4466174],"parent":4463689,"text":"Software Engineer - Startup\nSequoia Waste Solutions | Philadelphia, PA; Pittsburgh, PA (telecommute)\nphp objective-c ruby-on-rails sql apex-code<p>Description<p>We want to find an emerging technical developer who can contribute to a venture-backed, self-sustaining startup; someone who can sling code with the best of them but wants broader scope and wants to make an impact — a really big impact.<p>You: ambitious, technical, and adept at managing both the technology and the puzzle pieces behind it. You’ll work with the company leadership on a regular basis, and help refine and expand the company roadmap. Also, be ready to hone your inner air-hockey self.<p>You’ll play a big part in creating and executing the company’s engineering and product roadmaps as well. Just as important, you’ll help define the engineering culture of the company and help us change the world by making waste more efficient. How often do you get to do that?<p>Compensation:<p>We pay competitive salaries, and have bonuses for hitting and beating deadlines. Your compensation will largely be dependent upon experience and skill set. Perhaps most importantly, we offer you the opportunity to gain experience and the chance to substantially change the world by properly merging the waste services industry with cutting-edge technology. Ours is a culture of creating quality products and delivering exceptional service while we disrupt an aging industry model. If you fit that mold, please apply through Careers 2.0, or visit our website and contact us.<p>Perks:<p>• Quiet working conditions<p>• Competitive Benefits<p>• Suburban Office location (escape city taxes!)<p>• Weekly company ‘get togethers’ and events<p>• Everyone has a solid Cherry desk, Aeron Chair, and 2011/2012 iMacs /w maxed specs, etc.<p>• Full access to a techie’s playground (Our sister company is a full fledged SAS-70 data center for the Pittsburgh/Northeast areas)<p>Skills &#38; Requirements<p>Requirements &#38; Qualifications:<p>A solid engineer with proven experience, preferably in PHP and/or Ruby\nSome experience with: MySQL, SQL Server, JavaScript, Windows Server\nHave extensive experience with web services\nResourceful, practical and critical thinker.\nBe thorough, have good attention to detail, and display a high level of accuracy\nHigh stress tolerance\nGood team player and fast learner\nSelf-motivated and organized.\nGood communication skills, able to bring forward a vision or opinion.\nA good sense of humor\nBonus: Previous involvement (or outright failure!) at a startup\nWe would like you to be enthusiastic about working here. If this were just a job, we would work for the government. We are willing to accept constructive criticism and make changes, we expect you to do the same. We anticipate that you would be eager to fill a critical and respected role in a startup packed with dedicated and driven people.  We hire people who finish what they start and who are looking for new challenges. Tell us why you would flourish here.<p>About Sequoia Waste Solutions<p>About Sequoia<p>Sequoia is a Pittsburgh based startup, that is redefining how waste and recycling is handled in the corporate enviornment. Every day, businesses overpay on their waste hauling, due to drastic inefficies in the industry. At Sequoia, we collect, analyze, and present data in a manner that helps us create client-specific plans that reduce trash headed for landfills, and increase recycling. We are closing in on our first year of operation, and are always looking for new and exciting ways to handle and report the awesome data we're collecting. With your help, we'll redesign the waste industry, and reduce the amount of trash heading to landfills. We call it \"saving the world, one line of code at a time\"!","time":1346514815,"type":"comment"},{"by":"gambeht","id":4464586,"parent":4463689,"text":"REMOTE (San Francisco)<p>PlayCoMo - <a href=\"http://itunes.apple.com/us/app/pet-fair/id429367771?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/pet-fair/id429367771?mt=8</a><p>We're a fast growing mobile gaming company looking for talented people to join our team.<p>C++ Game Engineer<p>Data Analyst/Scientist<p>To apply, email: jobs [at] playcomo [dot] com","time":1346523725,"type":"comment"},{"by":"ffmike","id":4463870,"parent":4463689,"text":"Fulltime in Wine Country, CA - REMOTE acceptable<p>Labrador Omnimedia is looking for an iOS developer to help us upend the alcoholic beverage sales industry.<p>Existing application. Profitable company. Great team.<p>Details: <a href=\"http://www.labradorom.com/careers\" rel=\"nofollow\">http://www.labradorom.com/careers</a>","time":1346511807,"type":"comment"},{"by":"paradox95","id":4464679,"parent":4463689,"text":"Chartboost - <a href=\"http://chartboost.com/jobs\" rel=\"nofollow\">http://chartboost.com/jobs</a>\nSan Francisco, CA<p>Looking for a little of everything. Awesome engineers especially.<p>Email travis[at]chartboost[dot]com for more information. I am an engineer at Chartboost, not a recruiter by the way.","time":1346525314,"type":"comment"},{"by":"christkv","id":4465377,"parent":4463689,"text":"10gen is hiring both an erlang and also a haskell developer who can be located either in the states or europe. Want to work on the drivers for you favorite language and join a great group of likeminded people contact me at christkv at 10gen dot com.","time":1346539051,"type":"comment"},{"by":"GavinB","id":4464649,"kids":[4466293],"parent":4463689,"text":"New York, NY<p>Assistant Project Manager, helping build iOS and Web games for the US's biggest kids publisher. One part project management, one part game designer, one part community manager. Entry level or intern okay, but you need to be available on-site in New York.","time":1346524647,"type":"comment"},{"by":"triggit","id":4477176,"parent":4463689,"text":"San Francisco \nAre you an Account Executive / Client Strategy guru?<p>Check out this position at Triggit! \n<a href=\"http://hire.jobvite.com/j/?bj=o8tIWfwZ&#38;s=hacker_news\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=o8tIWfwZ&#38;s=hacker_news</a>","time":1346803531,"type":"comment"},{"by":"benji-york","id":4474201,"parent":4463689,"text":"100% Telecommute (REMOTE)<p>Canonical<p>Software Engineers for Cloud Engineering Team<p>Python/Go/Cloud Stuff<p>Details at <a href=\"https://tbe.taleo.net/NA3/ats/careers/requisition.jsp?org=CANONICAL&#38;cws=1&#38;rid=502\" rel=\"nofollow\">https://tbe.taleo.net/NA3/ats/careers/requisition.jsp?org=CA...</a>","time":1346761059,"type":"comment"},{"by":"triggit","id":4477169,"parent":4463689,"text":"San Francisco - RTB ad serving platform - Engineer needed<p>Job description: <a href=\"http://hire.jobvite.com/j/?bj=oQXoWfwR&#38;s=hacker_news\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=oQXoWfwR&#38;s=hacker_news</a>","time":1346803483,"type":"comment"},{"by":"pjhyett","id":4464182,"parent":4463689,"text":"GitHub's looking for Enterprise Support Engineers (EU/Asia) and Technical Account Managers (SF) <a href=\"https://github.com/about/jobs\" rel=\"nofollow\">https://github.com/about/jobs</a>","time":1346516840,"type":"comment"},{"by":"winstwu","id":4517947,"parent":4463689,"text":"We are hiring: Lead developer - social collaborative consumption startup <a href=\"http://www.shairporter.com/jobs/\" rel=\"nofollow\">http://www.shairporter.com/jobs/</a>","time":1347562787,"type":"comment"},{"by":"aseemk","id":4463961,"parent":4463689,"text":"New York, NY - {Backend || DevOps} Engineers - Node.js, Neo4j, Heroku, EC2<p>---- About us ----<p>Hello, we are FiftyThree (<a href=\"http://www.fiftythree.com/\" rel=\"nofollow\">http://www.fiftythree.com/</a>). We're the company behind Paper, an iPad app for freeform writing/sketching/drawing.<p>Paper has done well: among other things, it won this year's Apple Design Award for iPad, it's had nearly 3 million downloads, and it's used and loved by creatives at top-notch companies everywhere, including Apple, Nike, Pixar, and more.<p>But Paper is just the beginning for us. Our goal is to bring creation tools into the post-PC era, and we think there's a huge opportunity there. Mobile and tablets are changing everything.<p>We like to say that Paper is “where ideas begin”; we're now building a service to “bring ideas together”. Think something like a GitHub for ideas and creations. We have a great team of developers and designers spanning iOS and web, but we’re looking for 2-3 more developers to join us. That’s where we hope you’ll come in.<p>---- About you ----<p>We're looking for great backend or devops engineers to help us build this service. The role is flexible depending on your prior experience, passion, and expertise.<p>E.g. perhaps you love algorithms and performance engineering. Great — let's design an efficient activity feed for our users. (It's a fun graph problem.)<p>E.g. or perhaps you love devops and infrastructure. Perfect — help us setup a high-availability database cluster with master-slave replication.<p>E.g. or perhaps you love data and metrics. Right on — help us get great instrumentation and analytics in place so we can monitor early and monitor often.<p>Whatever your specifics, you'll work across a diverse set of tools. We currently use Node.js (and we write primarily CoffeeScript) with Neo4j (a graph database). We deploy on a mix of Heroku and Amazon EC2. And we use GitHub and Trello to keep track of it all.<p>You don't need prior experience with any of these directly, but you should have some history of building or scaling websites or services like ours. Even better if you can show depth and passion somewhere. Of course, strong engineering skills and an ability to learn quickly are a must.<p>You'll be just our second backend engineer, so you'll help set the tone for culture, process, and workflow. And if we succeed, you'll certainly help shape the company's future and direction, as well.<p>---- Sound good? ----<p>If this sounds interesting to you and you think you fit the bill, drop us a line at mailto:jobs@fiftythree.com. We look forward to hearing from you.<p>You can also learn more through our more general jobs page: <a href=\"http://www.fiftythree.com/jobs\" rel=\"nofollow\">http://www.fiftythree.com/jobs</a>","time":1346513218,"type":"comment"},{"by":"mikek","id":4466014,"parent":4463689,"text":"Mountain View, CA | Kiwi Crate\n<a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1346556497,"type":"comment"},{"by":"benjlang","id":4464687,"kids":[4465699],"parent":4463689,"text":"Israel - list of startups hiring: <a href=\"http://mappedinisrael.com\" rel=\"nofollow\">http://mappedinisrael.com</a>","time":1346525498,"type":"comment"},{"deleted":true,"id":4517678,"parent":4463689,"time":1347559923,"type":"comment"},{"by":"myenergy","id":4464058,"parent":4463689,"text":"MyEnergy - Boston, MA - FULL TIME: Rails Engineers, Frontend Devs, Designers, and Account Managers (and more!) - <a href=\"http://www.myenergy.com\" rel=\"nofollow\">http://www.myenergy.com</a><p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers (and others!) to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, has been named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet.<p>We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Frontend Devs to craft and implement amazing and dynamic experiences in our user-facing platform =&#62; <a href=\"https://www.myenergy.com/careers/frontend_developer\" rel=\"nofollow\">https://www.myenergy.com/careers/frontend_developer</a><p>* and Account Managers to support all the fine folks and entities using MyEnergy all across the country =&#62; <a href=\"https://www.myenergy.com/careers/account_manager\" rel=\"nofollow\">https://www.myenergy.com/careers/account_manager</a><p>We're also interested in hearing from driven individuals who think they may have what it takes as a sort of \"comms hacker\", building from scratch, strategizing, and single-handedly executing a new interdisciplinary public communications operation for MyEnergy. You'll need to be based in Boston, and full of good ideas and the energy to advance them =&#62; <a href=\"https://www.myenergy.com/careers/create_position\" rel=\"nofollow\">https://www.myenergy.com/careers/create_position</a><p>We're HQ'ed in a conveniently located, sunny two-story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1346514806,"type":"comment"},{"by":"calbear81","id":4464359,"parent":4463689,"text":"Mountain View, CA - Room 77 Hotel Search - Software Engineers (Full Stack), Mobile Developers (Android, iOS), Lead Designer, Marketing/Data Analyst, SEM/Email Analyst - H1B welcome<p>What we do and who we are looking for:<p>It's simple - we want to build the world's best hotel search engine.  Best place to search (fastest, most relevant, most results), best place to research (data insight, recommendations), and the best place to shop (metasearch engine, finds lower prices from more sources worldwide).<p>Travel is a big market and there hasn't been much innovation in the last ten years.  We were founded on the belief that consumers deserve to get transparency and a fair deal and we believe that tackling hotel search is a great way to help travelers make more informed decisions and save some moolah.  It's not the sexiest space to be in but the travel space is the 2nd largest commerce category and we think we can own a piece of the pie through a better product.<p>Our engineering team is 15+ and growing and we're hungry for more talent because we've got big problems to solve. We look for people who work comfortably across the entire stack.  We run on Ubuntu, AWS and no specific language knowledge is necessary though we use a lot of C++, PHP, and Javascript.  We don't believe in micromanagement so you'll need to be someone who is self-motivated, not scared off by things you've never done, and willing to make mistakes and know when to ask for a helping hand.  Most of our engineering comes from Google, Facebook, Yandex and other top tier companies as well as top tier schools.<p>On the marketing side, we need some firepower to get the word out there and build smart ways to analyze and optimize the paid traffic we're getting.  If you think it would be fun to compete in SEM against larger, more well-funded companies and you don't find it at all scary, we want to talk to you.  If you've done large scale email program build outs (things like automated price alerts, segmentation), we want to talk to you.<p>What's it like working at Room 77?<p>We're located a stone throws away from Red Rock Coffee in the heart of Downtown Mountain View.  We're a diverse bunch and we like to do a lot of team events.  Lunches are catered and we have a keg on tap, standard valley benefits apply including equity and competitive compensation.  You also get a travel stipend and a travel agent card to get massive savings when you take some R&#38;R.<p>Who believes in us?<p>We've raised $13 million to date from VCs like General Catalyst, PAR, and Sutter Hill and companies like Concur (TripIt).  We're lucky to have both angels and advisers that have started companies like Expedia, MTV, HotelTonight, Nor1, and Zillow.  We're well connected to the industry so you don't have to worry about us having to bang on doors to get to the right folks, all we need to focus on is building a killer product that makes people fall in love with us.<p>If you think this sounds interesting or you just want us to buy you a coffee when you're in Mountain View, reach out to us.  Engineering positions, check out <a href=\"https://www.room77.com/jobs/software_engineer.html?s=hackernews\" rel=\"nofollow\">https://www.room77.com/jobs/software_engineer.html?s=hackern...</a> . Marketing/Analyst positions, send resumes/portfolios to jobs@room77.com or reach out to me directly: roger@room77.com.","time":1346519846,"type":"comment"},{"by":"monstrado","id":4463895,"parent":4463689,"text":"Raleigh // Palo Alto // San Francisco<p>Cloudera<p>Cloudera Inc. is a Palo Alto-based enterprise software company which provides Apache Hadoop-based software and services. It contributes to Hadoop and related Apache projects and provides a distribution for Hadoop for the enterprise.[1] Cloudera has two products: Cloudera's Distribution including Apache Hadoop (CDH) and Cloudera Enterprise. CDH is a data management platform which incorporates HDFS, Hadoop MapReduce, Hive, Pig, HBase, Sqoop, Flume, Oozie, ZooKeeper and Hue and is available free under an Apache license. Cloudera Enterprise is a package which includes Cloudera's Distribution including Apache Hadoop, production support and tools designed to make it easier to run Hadoop in a production environment. Cloudera offers services including support, consulting services and training (both public and private).<p>Job Title: Customer Operations Engineer\nDescription: Ever heard of Hadoop?\nCloudera is looking for a Customer Operations Engineer who has a passion for making customers successful. You will join a team of highly skilled engineers who are responsible for delivering Cloudera's support services including assistance during engineering and operations of distributed systems and mission critical response for production customers. Strong communications and troubleshooting skills are critical for success in this role.<p>At Cloudera, our goal is to make each individual feel valued for his or her contributions to the company’s mission. We are looking for smart people who want to do remarkable things. We strive to create an environment of casual intensity where people enjoy coming to work every day. Our senior management team meets regularly with the whole company to discuss strategy, successes and challenges.\nUpon joining you will be given training in the Hadoop ecosystem, you will also pick an area that you plan to focus in...Such as databases NoSQL, RDBMS, Writing MapReduce, Machine Learning, etc.<p>What's it like to work at Cloudera? <a href=\"http://www.quora.com/Cloudera/What-is-it-like-to-work-at-Cloudera\" rel=\"nofollow\">http://www.quora.com/Cloudera/What-is-it-like-to-work-at-Clo...</a><p>Responsibilities:<p>* Contribute code upstream to the Apache Hadoop Project<p>* Analayze and troubleshoot MapReduce code and workflows<p>* Ensure that critical customer issues are addressed quickly and effectively<p>* Investigate product related issues both for individual customers and for common trends that may arise<p>* Study and understand critical system components and large cluster operations<p>* Differentiate between issues that arise in operations, user code, third party libraries or product<p>* Manage the day to day interactions with our customers<p>* Identify requirements for additional focused services engagements<p>* Coordinate enhancement and feature requests with product management and engineering<p>Qualifications:<p>* Linux (Shell Scripting, Administration)<p>* Java (JVM, Development, Management of Code)<p>* Network analysis (TCP Dumps, etc)<p>* Kernel debugging<p>Pluses:<p>* NoSQL Databases (+++ HBase, Cassandra, Riak, etc)<p>* In depth knowledge of Java<p>* Hadoop Ecosystem (HDFS, MapReduce, Hive, Pig, ..)<p>The technology that we use and develop at Cloudera is breathtaking, it's truly rewarding knowing the use cases for the software that we deploy to customers. If you're interested in Cloudera and have a passion for new technology, apply below.<p>Apply:<p>Raleigh Candidates -&#62; rtpjobs [at] cloudera [dot] com<p>or<p><a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a>","time":1346512198,"type":"comment"},{"by":"rdamico","id":4464988,"parent":4463689,"text":"San Francisco, full time.<p>If you've ever viewed a PDF or Office document on sites like Dropbox, Yammer, or LinkedIn, you've seen Crocodoc (YC W2010) in action. We convert documents to HTML5 so they can be embedded into any web or mobile app. But that's just the beginning.<p>We've developed the world's most advanced web-based document viewing and collaboration technology for Microsoft Office and PDF files, built on open standards such as HTML5 and CSS3. We're processing millions of documents each month, are backed by top-tier investors, and are profitable and growing quickly.<p>If you want to help push the limits of what's possible with HMTL5 and CSS3, 10x a fast-growing business, and build new products that change the way people collaborate and get work done, email co-founder Peter Lai (peter at crocodoc dot com) to apply.<p>Open positions:<p>* Senior Developer<p>* Business Development<p>* Director of Growth<p>* Inside Sales<p>For more information, see <a href=\"http://crocodoc.com/jobs\" rel=\"nofollow\">http://crocodoc.com/jobs</a> and <a href=\"http://crocodoc.com/about\" rel=\"nofollow\">http://crocodoc.com/about</a>.<p>---<p>About Crocodoc:<p>* Growing Fast<p>Crocodoc converts millions of documents to HTML5 each month for top web companies like Dropbox, LinkedIn, and Yammer. The company is profitable and growing fast.<p>* Talented Team<p>Crocodoc was founded by four MIT engineers who have been working together for four years. As we evolve Crocodoc, we’re pushing browsers and mobile devices to the limit and are solving incredibly difficult challenges along the way.<p>* Great Culture<p>At Crocodoc, we work hard and are passionate about what we do...in and out of the office. Our tight-knit team enjoys working from exotic locations, hanging out with each other at the office, and playing heated games of Settlers of Catan.<p>* Awesome Benefits<p>Your happiness and health is our priority. We offer competitive salaries, stock options, health insurance, an unlimited hardware budget, commuter benefits, and relocation assistance.<p>---<p>Recent press:<p>* HTML5 Start-Up Crocodoc Signs Up Dropbox, LinkedIn and SAP as Paying Customers\n<a href=\"http://allthingsd.com/20120501/html5-start-up-crocodoc-signs-up-dropbox-linkedin-and-sap-as-paying-customers/\" rel=\"nofollow\">http://allthingsd.com/20120501/html5-start-up-crocodoc-signs...</a><p>* Crocodoc’s HTML Document Viewer Infiltrates the Enterprise\n<a href=\"http://www.xconomy.com/san-francisco/2012/07/12/crocodocs-html-document-viewer-infiltrates-the-enterprise/\" rel=\"nofollow\">http://www.xconomy.com/san-francisco/2012/07/12/crocodocs-ht...</a><p>* Crocodoc Debuts HTML5 Document Embedding Technology; Partners With Dropbox, Yammer, SAP\n<a href=\"http://techcrunch.com/2012/05/01/crocodoc-debuts-html5-document-embedding-technology-partners-with-dropbox-yammer-sap/\" rel=\"nofollow\">http://techcrunch.com/2012/05/01/crocodoc-debuts-html5-docum...</a>","time":1346530856,"type":"comment"},{"by":"bscoperecruiter","id":4474991,"parent":4463689,"text":"BrightScope is looking for exceptional full-time software engineers/developers to expand our dev team. Are you someone who is tired of working for big technology companies where you are buried in layers of bureaucracy, wait months or years between product releases or don’t have a say in what you build? Do you want to get in on the ground floor of a rising data and analytics company?<p>If you can figure out the toughest problems, love learning new things, and want to play a major role in the success of a growing startup, join us in building something great.<p>BrightScope is full of passionate, smart people that want to change the world for the better. As our products and services gain in popularity, we need more developers to help build our platform.<p>BrightScope is full of passionate, smart people that want to change the world for the better.<p>Responsibilities to include:<p>Developing new features and improving core business software assets and applications\nHelping develop critical parts of our analytics platform and client-facing applications, delivered via a SaaS model over the web\nCoordinating with the project team<p>Requirements:<p>Solid command of your favorite programming language\nSQL experience (MySQL preferred), with a strong grasp of data modeling in large applications\nUnderstanding of MVC frameworks\nExperience with unit and functional testing, and preferably test-driven-development\nA self-starter attitude and an ability to break large problems down quickly\nExtreme attention to detail\nExcellent written and verbal communication skills<p>Experience working with any of the following is desired:<p>Amazon's Web Services: EC2, S3, Route53, RDS, etc.\nKnowledge of *nix is a huge plus (we use Ubuntu on our servers)\nDistributed applications\nDesigning for scale: algorithmic and efficiency concerns, etc.\nMVC frameworks (we use Django) \nWeb services (SOAP, REST)\nAgile development processes\nJIRA or other bug tracking systems\nKnowledge of source control\nExperience working with automated testing tools in Python or another language (Python unittest, nosetest, etc))<p>You will:<p>Improve the efficiency and stability of the systems and applications that power our solutions\nStart with ideas, design products and features, help architect a technical solution, then build, test and launch it\nBe an integral member of the development team and shape our future<p>We will:<p>Make sure you have what you need to be happy and productive\nCompensate you with a mixture of cash and equity\nMake great teammates united around the company mission<p>Interested and qualified candidates should send their resumes directly to jobs@brightscope.com with \"Software Engineer\" in the subject line. Local candidates are a bonus.","time":1346772828,"type":"comment"},{"by":"sbisker","id":4465572,"parent":4463689,"text":"<i></i><i>[Interested in what we do? Come say hi to us and play with our API [<a href=\"http://dev.locu.com/\" rel=\"nofollow\">http://dev.locu.com/</a>] at the TechCrunch Disrupt Hackathon [<a href=\"http://techcrunch.com/events/disrupt-sf-2012/event-info/\" rel=\"nofollow\">http://techcrunch.com/events/disrupt-sf-2012/event-info/</a>] in San Francisco next weekend! -sbisker]</i><i></i><p>San Francisco, CA - Senior Front-End Engineer at Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We have recently launched Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>), our first product, which helps restaurants better manage their online presence.<p>We have more exciting ideas for our data than we have resources to build them. Your job will be to help us change that.<p>We're looking to hire a Senior Front-End Engineer. Generalists and \"desingineers\" would also do well in this position, as we have plenty of work to do on those fronts as well - but significant front-end experience is crucial. You should feel comfortable making major front-end architecture decisions and being a company-wide advocate for building intuitive, responsive interfaces that surprise and delight.<p>Guidelines (requirements is such a strong word):<p><pre><code>  4+ years of experience building rich, interactive websites\n\n  Experience leading or managing an engineering team a plus - if you don't have it,\n  we'll give you a chance to mentor and grow as an leader.\n\n  Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills. \n  (For better or worse, we fully support IE8 - that's where small business owners are, \n  at least for a little while.) \n\n  Experience in proper UI engineering, particularly in Javascript. The deeper your JS\n  experience, the better. \n  (Framework experience (Backbone, Handlebars, etc) and opinions about when \n  they should and shouldn't be used is a +.)\n\n  Ability to go out of your comfort zone and write a server-side controller if no one \n  else is around is a + \n  (Experience with Python / Django in particular is a ++.)\n\n  A good sense of design and/or an ability to work with designers \n  (We won't make you \"design all the things\", but being able to draw on past \n  experience designing dashboards and other user interfaces is a +.)\n  \n</code></pre>\nSpecial note for Generalists and Desingineers<p><pre><code>  We know you like to strike your own unique balance. So don't sweat the reqs and just \n  show us what you've got.\n  We want you to be able to do what you love, the way you're best able to do it. :)\n  \n</code></pre>\nInterested? Drop us a line at jobs@locu.com. Please specify \"Senior Front-End Engineer - HN\", in the subject of your letter. Learn more about us at <a href=\"http://www.locu.com/about/jobs/\" rel=\"nofollow\">http://www.locu.com/about/jobs/</a><p>PS: Like most startups, we're always on the lookout for exceptional talent of all sorts. So if you feel you're a particularly strong fit for what we do or how we do it, check out our other descriptions at <a href=\"http://www.locu.com/about/jobs/\" rel=\"nofollow\">http://www.locu.com/about/jobs/</a>.<p>-------------------------------------<p><i></i><i>Founded a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best angel investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 17 people with very diverse backgrounds, and growing.</i><i></i>","time":1346544109,"type":"comment"},{"by":"danwalmsley","id":4465373,"kids":[4465688],"parent":4463689,"text":"NationBuilder.com<p>Downtown Los Angeles, Full Time, software developers and designers.<p>NationBuilder is a Community Organising System.<p>All the great positive changes in society have been driven by the millenia-old art of Community Organising. Moses, Martin Luther King Jr and Ghandi were Community Organisers.<p>The Internet provides the sheer reach to grow new movements faster than before, but the tools have been difficult to integrate and use, or they have been directed towards throwing animated cows rather than bringing people together to solve problems.<p>NationBuilder seeks to bring the power of community organising to the web for the lowest possible price so that grass-roots leaders can assemble followers in real-time, at scale, to create positive social change at a pace and scale that has never been seen before. Fundamentally, it brings together your web site, social integration, communications, and CRM in one place.<p>We are already changing US politics, but that is just the beginning. We seek to empower everyone in the world who wants to be a leader to build their community, whether they're a film-maker, a blogger, a grandma, a political dissident, a small business owner, or all of the above.<p>To do this, we have assembled a world-class team of Ruby on Rails hackers. Everyone is a full-stack developer and committed to the highest possible standards of excellence. Unlike everyone else in this space, we are fundamentally a tech company - not a consultancy, a think-tank, or the tech wing of a political party.<p>We practice continuous deployment. Committed code can be pushed to production in less than 5 minutes - and that INCLUDES running the full test suite on our CI platform.<p>We practice promiscuous pairing. You will be working directly with great people who know the product inside and out.<p>You will be using the latest Retina Macbook Pro or Macbook Air, working in one of the coolest spaces in Downtown LA with access to the best restaurants, arts, culture and weather in the US. The cost of living is low and the lifestyle is great. There is an epic 2-level restaurant/bar on our roof.<p>We have a real product with thousands of customers, yet our tech team is just 11 people. Anyone who joins today will have a massive influence on the product and market.<p>Our recent Series A was led by Andreessen Horowitz and Sean Parker, and angel investors include Chris Hughes. Sean Parker and Ben Horowitz are on our board, and our co-founders Jim Gilliam and Jesse Haff built Brave New Films and took on the Iraq War and Walmart while creating an entirely new model of film financing and distribution.<p>If all this sounds interesting, get in touch. Check out <a href=\"http://nationbuilder.com/jobs\" rel=\"nofollow\">http://nationbuilder.com/jobs</a> and then email jobs@nationbuilder.com.<p>Thanks,<p>Dan Walmsley<p>VP of Engineering, NationBuilder.com","time":1346538990,"type":"comment"},{"by":"joshbuddy","id":4464737,"parent":4463689,"text":"Leap Motion – San Francisco, CA – Full time, interns, H1B transfers<p>WHAT WE'RE BUILDING\nLeap Motion is reinventing the way people interact with computers. We are building a technology that uses a breakthrough mathematical approach to 3D, touch-free motion control software that’s unlike anything that currently exists on the market or in academia. The Leap device senses your individual hand and finger movements independently, and is 200 times more sensitive than existing gesture control technologies on the market today. In case you haven't seen it yet, watch our product demo video: <a href=\"http://leapmotion.com/\" rel=\"nofollow\">http://leapmotion.com/</a><p>OUR CULTURE\nWe have a collaborative environment where we discuss challenges and ideas openly. Everything from quick design questions, philosophic discussions, to fun ideas for our technology – nothing is off limits. At Leap Motion, you have the utmost creative freedom to work on your passions, and be able to make a significant impact early on. We want our team to think unconventionally, be creative, and find elegant solutions to problems that are yet unsolved. We are an engineering-driven organization; everyone here makes product decisions.<p>WHO WE’RE LOOKING FOR\nWe are looking for exceptionally talented individuals with diverse backgrounds to fill our engineering, design, and operational roles. Join the core team that will help develop the foundation for innovators to build the future. We are seeking passionate problem-solvers to help us tackle seemingly impossible challenges in the areas of applied math/physics, algorithms, graphics, UI/UX design, machine learning, driver development, circuit/hardware design, photonics, and more.<p>DESIRED SKILLS &#38; BACKGROUND\n•  Advanced degree or significant experience in computer science, engineering, math, physics, or a related field\n•  Strong programming skills in C++ preferred; experience with Python, Java, or Matlab also a plus\n•  Solid understanding of algorithms, data structures, and computer science fundamentals\n•  Strong background in image processing, computer vision, graphics, or machine learning\n•  Strong understanding of low-level client-side optimization or GPU programming a plus<p>BENEFITS &#38; PERKS\n• Competitive compensation, great benefits, and generous equity\n• Your very own Leap device, and insight into how it works\n• Collaborate with friendly, talented people with diverse backgrounds\n• Any computer setup and workstation you want\n• Lunch catered daily, snacks and drinks stocked according to requests\n• Spacious office in SoMa, near Caltrain and BART stations\n• Flexible work hours - we care about life-work balance\n• Health plan including medical, dental, and vision<p>HOW TO APPLY\nPlease visit <a href=\"http://leapmotion.com/jobs.html\" rel=\"nofollow\">http://leapmotion.com/jobs.html</a> and find a role that matches your background and skills. Be sure to mention \"Hacker News\" in the Cover Letter section. We'd love to see what projects you've worked on, and hear what interests you and what problems you'd like to tackle at Leap Motion. Tell us what makes you unique and why you’ll make a vital member of our team.","time":1346526323,"type":"comment"},{"by":"urgeio","id":4466352,"parent":4463689,"text":"Top 5 reasons why you should move to Berlin, now:<p>1. Lowest livings costs with highest quality of living. Stay in gorgeous, perfectly renovated apartments in pre-WWII residential buildings with high ceilings, right in the middle of the center and pay a fraction of costs of any other capital (even cheaper than any Eastern European capital). No need for a car—Berlin has one of the densest subway nets and wide streets make biking fun. In addition, Germany has an amazing social health care system including health, unemployment and pension (when working as an employee).<p>2. A vibrant and fast growing ecosystem of smart people. A vast number of new software talents, founders, software companies and VCs are moving to Berlin, every day (Twitter, Google, Soundcloud, Early Bird and many more).<p>3. People here are open-minded, outgoing, mix well and international—no need to learn German, everyone speaks English! Making new friends is a matter of days. Visit tons of networking and startup events, every week.<p>4. Easy work permissions—Europeans do not need any and can work from day one and the rest applies for the hassle-free Blue Card.<p>5. Berlin's night life is unmatched, huge and changing every day (plus ridiculously cheap). Berlin has got some of the most dazzling, naughty, and original clubs on the face of the Earth.<p>Berlin is calling and getting the new tech hub of Europe. If you are passionate about building great software, we’d love to talk with you. If you don't live in Berlin yet, we could help to fix that.<p>=&#62; <a href=\"http://urge.io/jobs\" rel=\"nofollow\">http://urge.io/jobs</a>","time":1346566167,"type":"comment"},{"by":"benihana","id":4464510,"kids":[4464650,4465083,4477206],"parent":4463689,"text":"Brooklyn, NY. <a href=\"http://www.etsy.com\" rel=\"nofollow\">http://www.etsy.com</a>. Remote possible, relocation offered.<p>World's largest vintage and handmade online retailer. We need good people in almost every place in the company - front end, backend, data analytics, ops, even an office hacker. A list of general positions we're actively hiring for: <a href=\"http://www.etsy.com/careers\" rel=\"nofollow\">http://www.etsy.com/careers</a><p>If you're interested in chatting or finding out more about working at this amazingly rad company, ping me on twitter @hoorayimhelping.","time":1346522405,"type":"comment"},{"by":"bai","dead":true,"id":4470092,"parent":4463689,"text":"Official.fm - New York City, NY - FULL TIME: Ruby Engineers, Frontend Devs - <a href=\"http://official.fm\" rel=\"nofollow\">http://official.fm</a><p>We create tools and services that help optimize the day-to-day of music professionals: labels, artists, etc. We use the latest technologies in order to rapidly iterate and build the best possible product for our users. We are a small company of around 20 creative people and our lean structure allows us to move fast, cut the crap, and ship.<p>We are not afraid to try new things: our labs team has written audio decoders in JavaScript for MP3, ALAC, FLAC, and AAC, along with a pitch detector. We know the difference between production code and research code. We love open-source and it loves us back.<p>The ideal candidate has:<p>* Expertise in Ruby, Ruby on Rails, and related technologies.<p>* Familiarity with modern tools, such as Git, SCSS, and other.<p>* Experience with agile methodologies, TDD, sprints and poker planning, daily stand-ups.<p>* An opinion. We want you to argue about the right way to do things. If something isn’t up to our level of quality, we expect an intervention.<p>* Excitement about music and desire to work in this area.<p>Our stack includes:<p>* Ruby on Rails 3<p>* Nginx + Passenger<p>* PostgreSQL<p>* Full text search<p>* Message queues<p>* JQuery<p>* Backbone.js<p>* Git<p>We’re offering you a full-time, permanent position in New York City to create the second product of our music platform (ask us for details).<p>If you think you’re fit for the job, ping us at jobs@official.fm and let’s talk!","time":1346674321,"type":"comment"},{"by":"netfire","dead":true,"id":4463733,"kids":[4475118],"parent":4463689,"text":"Provo, UT - Remote, Full-time<p>SpinGo - Front End Software Engineer<p>Who We Are: The SpinGo Event Platform is the optimal ecosystem for events in the digital age. It is comprised of a comprehensive and dynamic database of events, calendar applications rich with features, and an ever-expanding partner network. We we work closely with closely with venues to obtain event information directly from the source, and to help them promote their events.<p>Who You Are: The Front End Software Engineer will develop high quality user interfaces to meet the needs of our users. You will help improve our main calendar product to help users find events and build tools to help users submit and promote events and manage calendars. You have the skills to build pixel-perfect cross-browser interfaces that provide the best user experience. You will work with other engineers and team members to build scalable web applications. You are self-motivated, give accurate estimates and deliver quality code on-time.<p>Required Qualifications<p>- BS in a Software Development Field or Equivalent Work Experience<p>- Ability to use critical thinking skills to solve front-end development problems<p>- Several years experience developing cross-browser web applications<p>- Expert in JavaScript, HTML and CSS (experience with SASS a plus)<p>- Advanced skills in a server-side interpreted language (PHP, Python, Ruby, NodeJS, etc)<p>- Advanced knowledge of MVC-based architecture and frameworks<p>- Intermediate experience with relational databases, preferably PostgreSQL or MySQL<p>Compensation: $60K-$80K/year, flexible schedule with benefits<p>More details at <a href=\"http://www.spingo.com/jobs\" rel=\"nofollow\">http://www.spingo.com/jobs</a>. To apply email devjobs@spingo.com","time":1346509274,"type":"comment"},{"by":"mirz","dead":true,"id":4482535,"parent":4463689,"text":"Los Angeles: Magento Hacker<p>Swagsy is a socially driven marketplace where celebrities share the products they love: <a href=\"http://investors.swagsy.com\" rel=\"nofollow\">http://investors.swagsy.com</a><p>This isn't another \"I have an idea can you build it for me\" Craigslist ad. Our product is built and in private beta. We are launching with some of the biggest celebrities in the world. And we have a pipeline of brands that are ready to ship.<p>We have A-list advisors, have raised Angel and will close Series A soon.<p>We are looking for a talented Senior Magento Developer for Swagsy.<p>The ideal candidate loves Magento like it was their first born, is brilliant, fearless, and passionate.<p>Expect talented, motivated, intense, and interesting teammates. Your compensation will include meaningful equity ownership.<p>Life is short. Build stuff that matters.<p>Email mlulic at swagsy. Interns and H1Bs and TNs welcome.","time":1346897661,"type":"comment"},{"by":"mirz","dead":true,"id":4477392,"parent":4463689,"text":"Los Angeles: Porn Star Developer<p>We are an angel funded startup looking for hard working porn star to join our production.<p>You should have tremenous coding stamina which results in voluminous output. You should be able to go all night for hours on end and not get bored.<p>You will get very little direction, so it is expected that you know what you're doing - like it's instinctual for you.<p>We are a small team so you should be prepared to wear a variety of hats such as server repair man, pool cleaner and pizza delivery guy.<p>You should be good with people. We often begin the day programming by ourselves, but sometimes end up pair programming (or even small groups!) by the end of the day.<p>We are proponents of testing. If your code fails a test you will be prohibited from doing any new programming (especially with others) until the bug is cleared up.<p>We are a company of finishers. If we start a project we keep at it until it's done!<p>We expect a ton of users when we release. This thing is going to explode - we'll be all over HackerNews!<p><i></i><i></i><i></i><i></i><i></i><p>Real talk:<p>Swagsy is a socially driven marketplace where celebrities share the products they love. <a href=\"http://investors.swagsy.com\" rel=\"nofollow\">http://investors.swagsy.com</a><p>This isn't another \"I have an idea can you build it for me\" Craigslist ad. Our product is built and in private beta. We are launching with some of the biggest celebrities in the world. And we have a pipeline of brands that are ready to ship.<p>We have A-list advisors, have raised Angel and will close Series A soon.<p>We are looking for a talented Senior Magento Developer for Swagsy.<p>The ideal candidate: \n- loves Magento like it was their first born \n- is brilliant, fearless, and passionate<p>Expect talented, motivated, intense, and interesting teammates.<p>Email mlulic at swagsy. Interns and H1Bs and TNs welcome.","time":1346807792,"type":"comment"},{"by":"styloothire","dead":true,"id":4470529,"parent":4463689,"text":"Pune, India: Python and JS developers.<p>Who dis? - We are styloot.com, one of the largest online fashion stores for women. We have created a patented visual search, which is our bee's knees. We carry 500K+ items from 5000+ designers.<p>Who you? - We are looking to hire  Python Programmers and Javascript programmers for our core engineering team. You will be working directly with the product and will be making decisions that directly influence the site. You need to have worked 2-3 years, have a github portfolio, and come from a strong coding background. Other than that, it does not matter where or what you studied.","time":1346683412,"type":"comment"},{"by":"TriggitJobs","dead":true,"id":4504070,"parent":4463689,"text":"San Francisco Entry level Operations Engineer<p>You’ll be the liaison between the engineering team and internal users. We are looking for someone who has a strong technical background that wants to learn all the in(s) and out(s) of how a DSP works and to help improve engineering operations at Triggit.<p>Apply at: <a href=\"http://hire.jobvite.com/j/?bj=oAuKWfwu&#38;s=hacker_news\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=oAuKWfwu&#38;s=hacker_news</a>","time":1347344465,"type":"comment"},{"by":"TriggitJobs","dead":true,"id":4509178,"parent":4463689,"text":"Sr. C/C++ Engineer come work on our Ad Serving Platform at Triggit<p>Check out the job at: <a href=\"http://hire.jobvite.com/j/?bj=oQXoWfwR&#38;s=hacker_news\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=oQXoWfwR&#38;s=hacker_news</a>","time":1347424818,"type":"comment"}]]}