{"comments":[{"by":"avar","id":4727346,"parent":4727241,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, team leads,\nDBA's and sysadmins on-site in the center of Amsterdam. I'm a\ndeveloper there working on infrastructure tasks and relocated there\njust over two years ago and have been very happy with it.<p>We're currently looking to fill 25 developer positions (which matches\nour growth curve), and are also looking for senior team leads.<p>We have people from all over the world relocating to work with us and\nare very well set up to handle relocation and visa issues, most of the\npeople working in IT are expats so we've got a lot of experience with\nbringing people in. All our internal communication is done in English\nso there's no need to learn Dutch.<p>We use Perl for almost everything with a MySQL backend and Git for\ndevelopment. We get our changes out really fast, it's rare for your\ncode not to be on our live systems within hours of you pushing\nit. We're also very open to open sourcing code that doesn't contain\nany business logic, I've personally been involved in open sourcing a\nfew of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and\na few CPAN modules.<p>I'd be happy to answer any questions at avarab@gmail.com and/or\nforward your resume, You can also apply directly at\n<a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> if you'd prefer.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent. If you\n   are not from the EU we will apply for a work &#38; residence permit for\n   you and your family if needed.","time":1351776541,"type":"comment"},{"by":"frisco","id":4728354,"parent":4727241,"text":"Transcriptic: Core Developer<p>Menlo Park, CA<p>Transcriptic is the \"Amazon Web Services\" for life sciences. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic's central, highly automated 'biocenter' in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We're building a long-term company to completely change the way life science research and development is done.<p>We're looking for highly talented full-stack web developers as well as combined background EE/CS engineers for automation integration and development. Experience reverse engineering USB based protocols is a plus.<p>We're a very small startup (you'd be #5), but well funded and have customers. You'd be able to work on interesting science and hard technology in a really small, all technical team with lots of freedom and resources.<p>A biology background is preferred but not strictly necessary for outstanding people. The codebase is mostly Ruby and Scala, with some Python.<p>max at transcriptic.com<p><a href=\"https://www.transcriptic.com/\" rel=\"nofollow\">https://www.transcriptic.com/</a>","time":1351787791,"type":"comment"},{"by":"jamieiles","id":4727277,"parent":4727241,"text":"Cambridge, MA or REMOTE. Full-time.<p>The Ksplice group at Oracle<p>Does writing Python clones of your favorite childhood computer games sound like a fun weekend project? Would you hack on an old-school graphics demo that fits into a DOS MBR in your free time? Have you ever told a joke whose punch line was a git command? If that sounds like you, we want to hear from you!<p>We are a small, tight-knit team of 12 women and men excited to work on technology that most people will tell you is impossible: updating an operating system kernel while it is running. Our product, Ksplice Uptrack, is a subscription service for Linux that provides completely non-disruptive, rebootless kernel updates. (You can read more about the underlying technology at <a href=\"http://www.ksplice.com/paper\" rel=\"nofollow\">http://www.ksplice.com/paper</a>)<p>We're looking for a systems engineer with strong Python experience: Help us bring the Ksplice Uptrack client to new Linux distribution releases, improve our server infrastructure, and develop and extend our REST API and Django-based web interface.<p>If this technology excites you, let's talk! Feel free to direct questions to me at jamie.iles@oracle.com or to jobs@ksplice.com. Oracle is an equal opportunity employer.","time":1351775503,"type":"comment"},{"by":"JshWright","id":4727514,"parent":4727241,"text":"Silent Circle - Washington DC - Remote considered<p><a href=\"https://silentcircle.com\" rel=\"nofollow\">https://silentcircle.com</a><p>We're looking to fill several positions; hoping to find folks with experience in:<p><pre><code>  * Web UI/UX\n  * Web development (our stack is mostly Python)\n  * Systems administration (mostly Debian, some FreeBSD)\n  * Network engineering (Juniper)\n  * Network and Systems Security\n  * Distributed storage\n  * VoIP\n  * Android/iOS development\n</code></pre>\nDo something cool that isn't on the list? Drop us a line anyway. Resumes, portfolios, GitHub profiles, etc all welcome.<p>jobs@silentcircle.com<p>If you'd prefer to send encrypted email, you can reach me here: josh@silentcircle.com<p>Pub key available here: <a href=\"https://silentcircle.com/keys/josh.asc\" rel=\"nofollow\">https://silentcircle.com/keys/josh.asc</a>","time":1351778367,"type":"comment"},{"by":"twakefield","id":4728436,"kids":[4729216],"parent":4727241,"text":"Mailgun - San Francisco, Full Time, Local (relocation provided).<p>Position: Developer Evangelism at Mailgun<p>We are looking for someone that:<p>- Has a technical background and wants to make the world a better place for other developers.<p>- Likes to build things and enjoys experimenting with different languages.<p>- Can write engaging content about technical topics.<p>- Enjoys attending meetups/hackathons/conferences and discussing hard problems with other smart people.<p>- Likes traveling.<p>We offer:<p>- A small agile team (Mailgun) with the backing and security of a public company (Rackspace)<p>- Competitive salary and benefits.<p>- Relocation to San Francisco, CA<p>- A job who's main role is to build cool stuff with Mailgun and show it off to the world.<p>- The self-fulfillment of knowing you were essential to the success of Mailgun and all of the fame and fortune that goes along with it :)<p>About Mailgun:<p>- YC W2011 company, acquired by by Rackspace in Aug 2012.<p>- Located in San Francisco (Folsom and 2nd).","time":1351788524,"type":"comment"},{"by":"bryanh","id":4727743,"parent":4727241,"text":"Mountain View, or Remote (full-time)<p>We're Zapier: we make tools around integrating APIs, and we make them for everyone, not just technical people. We just announced a $1mm+ funding round and are looking for anyone comfortable with the full stack, though specialization is cool as well. No formal requirements, except that you have a history of hacking and getting sh*t done.<p>We have an increasingly varied tech stack and are using Python, Coffeescript/SASS, Backbone, RabbitMQ, Elastic Search, Redis, Node.js, and much much more. The right tool is the right tool, new tech doesn't scare us.<p>We have to solve some interesting problems, for example, every API has different rate limit, so how do you schedule jobs that keep us under the limit, both globally and per-user? We also believe in the power of open source, we've released two OS Django apps already, we'd hope you would want to do the same.<p>Also, customers love us and we're making money.<p>If you want to chat, just contact us at founders@zapier.com (no recruiters please).","time":1351780908,"type":"comment"},{"by":"azylman","id":4728715,"parent":4727241,"text":"San Francisco, CA - Full Time<p>I work for Clever, a YCS12 company. It's quite honestly the best job I've ever had. Every day I get to solve fun and interesting problems in a market (education) where I can actually tell people that I'm trying to make the world better.<p>This is copy+pasted from our jobs page (<a href=\"https://getclever.com/about/jobs\" rel=\"nofollow\">https://getclever.com/about/jobs</a>):<p>## Things we're looking for:<p>Experience with consuming and/or creating RESTful Hypermedia APIs<p>Comfort with a variety of languages (we use the best tool for the job, everything from Node.js to bash scripts)<p>Devops experience scaling up systems including AWS and MongoDB<p>Ability to quickly pick up new technology and apply it effectively<p>## What Clever offers:<p>A chance to revolutionize education<p>Competitive salary and significant equity stake in well-funded company<p>Flat and close-knit engineering team with lots of peer code review and pair programming<p>Great benefits - healthcare, dental, unlimited Amazon budget, beautiful office, etc<p>To apply, email jobs+engineer@getclever.com","time":1351791585,"type":"comment"},{"by":"mattlong","id":4728452,"kids":[4728579,4728608],"parent":4727241,"text":"Crocodoc<p>San Francisco, CA | Full time | Full-stack Engineer<p>## Description<p>We're looking for a full-stack web engineer who can contribute to all aspects of Crocodoc: front-end development, server-side improvements, ops and systems tasks, and everything in between. Does your experience mostly fall into one or two of those categories? Not a problem, as long as you're eager to get your hands dirty outside of your comfort zone.<p>Since you'll be joining a small technical team, you'll take the lead on core projects from day one and often work independently. We're nimble and push code almost every day, but because our product reaches tens of millions of users, everything must be bulletproof.<p>## Skills and Qualifications<p>- Ability to embrace the energy and drive of a close-knit start-up team.<p>- Self-starter with the creativity and initiative to brainstorm, propose, and dive into implementing solutions.<p>- Strong command of Python and up-to-date knowledge of its ecosystem. We love Python and use it throughout our back-end.<p>- Proficiency in JavaScript/HTML5/CSS3 and keen awareness of the state-of-the-art in browser technology. Our HTML-based document viewer is the face of Crocodoc, and we keep it polished.<p>- Familiarity with distributed computing. We use Celery to coordinate dozens of servers to process documents within a matter of seconds.<p>- Comfortable working in (and improving) a Linux-based development and deployment environment.<p>- Understanding of cloud-based infrastructure and all the benefits and drawbacks it provides. We're on Amazon AWS and dig its flexibility.<p>At Crocodoc, you'll be working with a savvy tech team that enjoys solving tough problems and loves to learn and leverage new technologies when it makes sense. If that sounds like your cup of tea, we'd love to hear from you. Please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.","time":1351788698,"type":"comment"},{"by":"spicyj","id":4727421,"parent":4727241,"text":"Khan Academy - Mountain View, CA - full-time and intern, designers and devs\nWe're a non-profit whose mission is to provide a world-class education to anyone, anywhere. We're scaling quickly.\nOur students answer over 2 million math problems per day (over 800mm total so far), all generated by our open source exercise generation framework (<a href=\"https://github.com/Khan/khan-exercises\" rel=\"nofollow\">https://github.com/Khan/khan-exercises</a>), and our videos (now from a variety of authors including Sal) have been viewed over 200mm times. We're tracking all that data and using it to customize each student's experience as well as building brand-new tools like our new programming environment (<a href=\"http://ejohn.org/blog/introducing-khan-cs/\" rel=\"nofollow\">http://ejohn.org/blog/introducing-khan-cs/</a>). We could use your help.\nWorking for Khan Academy is one of the highest educational impact positions you can imagine, and we've been called by Wired one of the best places to work in Silicon Valley: <a href=\"http://news.ycombinator.com/item?id=4157078\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4157078</a>.\nWe're hiring designers and all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.\n<a href=\"http://www.khanacademy.org/careers\" rel=\"nofollow\">http://www.khanacademy.org/careers</a>","time":1351777541,"type":"comment"},{"by":"kstenerud","id":4727573,"parent":4727241,"text":"San Francisco, CA (H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>We build wonderful educational games in San Francisco. If you are nice and want to help us make splendid products, we'd love to hear from you.<p>Voted Educational App of the Year by Apple.<p>We're hiring in lots of areas! Here are a few:<p>-------------------------------------------------------<p>* Backend engineer - <a href=\"http://mindsnacks.theresumator.com/apply/zmC1GW/Backend-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/zmC1GW/Backend-Engi...</a><p>* Mobile engineer (Android, iOS, or Games) - <a href=\"http://mindsnacks.theresumator.com/apply/5t4zzv/Mobile-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/5t4zzv/Mobile-Engin...</a><p>* Generalist engineer - <a href=\"http://mindsnacks.theresumator.com/apply/cj0OWK/Generalist-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/cj0OWK/Generalist-E...</a><p>* QA lead - <a href=\"http://mindsnacks.theresumator.com/apply/0tGRiZ/QA-Lead.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/0tGRiZ/QA-Lead.html</a><p>* Games producer - <a href=\"http://mindsnacks.theresumator.com/apply/QkgdTJ/Producer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/QkgdTJ/Producer.htm...</a><p>-------------------------------------------------------<p>For more info, visit <a href=\"http://www.mindsnacks.com/careers\" rel=\"nofollow\">http://www.mindsnacks.com/careers</a> or email us at jobs@mindsnacks.com.","time":1351779046,"type":"comment"},{"by":"nestlabs","id":4728140,"kids":[4737829],"parent":4727241,"text":"Nest<p>Palo Alto, CA --- Full Times &#38; Paid Internships --- H1B OK, Relocation Friendly, Full Benefits.<p>After spending almost a decade working for Steve Jobs, Tony Fadell, the iPod Godfather, decided it was time to think of the home beyond a mere shelter. Last year, Nest established the first corner stone of this vision by releasing its first learning Thermostats; recently, Nest delivered again by introducing the second version of the Thermostat, which was lauded by the New York Times as “gorgeous, elegant, and very, very smart.” [1]<p>Video of our Thermostat: <a href=\"http://goo.gl/nrM2l\" rel=\"nofollow\">http://goo.gl/nrM2l</a><p>To deliver on the vision of bringing Apple-like discipline to home automation, we are currently looking for motivated individuals with any of the following skill sets:<p>-Mobile Developer: iOS or Android<p>-Frontend developers: our frontend stack is in Django, and we’re also using Amber.js, Backbone.js, and more.<p>-Backend Developers: our stack is in Scala, and we’re more than happy to teach you horizontal/vertical scaling.<p>-Algorithm &#38; Machine Learning Experts: the thermostats provide tons of data we use to help people save energy.<p>-EE people in Networking, System Integration, Firmware...etc<p>We’re still a pretty small team but we’ve got big ambitions and are already having a tangible impact (wait ‘til you see our energy saving numbers). If you want to come change the world with us, please feel free to send us a note at jose@nestlabs.com (or reply to this thread).<p>[1] <a href=\"http://goo.gl/JHyo4\" rel=\"nofollow\">http://goo.gl/JHyo4</a>","time":1351785285,"type":"comment"},{"by":"phillytom","id":4727778,"parent":4727241,"text":"Monetate - (Philly suburbs) Conshohocken, PA - No remote, but we will help you with relocation.<p>Monetate helps internet marketers make their site more relevant.  We turn data in action on our clients' sites by doing real-time data analysis and DOM modification to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users' problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Open source - Google Closure, Python, Hadoop, Mahout, Solr and Lucene - we're open source across our stack<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on<p>About us:<p>* Founded in 2008<p>* Market rate salaries<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>* Funded by First Round and OpenView<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a><p>We've hired great people from HN in the past.<p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1351781310,"type":"comment"},{"by":"lpolovets","id":4728041,"parent":4727241,"text":"Factual is currently hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai.<p>Remote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our new Palo Alto office is still small, so new hires would have a huge impact on the culture there.<p>You can email me personally at leo@factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1351784062,"type":"comment"},{"by":"snowmaker","id":4728027,"parent":4727241,"text":"Scribd - San Francisco, H1B, INTERN are welcome<p>Scribd (social publishing &#38; eBooks, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired THREE full-time people and several interns from these \"Who is Hiring\" threads, including one just last month ... it really works!!<p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript (we recently switched to Coffeescript and are loving it)<p>* iOS<p>* Android<p>* Machine Learning / Data mining kinds of problems<p>* Back-end problems: scalability, web crawling, analytics<p>* DevOps and web infrastructure<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you.  We've hired people from these threads with everywhere from 0 to 10 years of experience.<p>We're profitable, very well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>We're working on a giant new product launch now that we're really excited about.  If you're interested in eBooks, I'd love to tell you about it.<p>Generally we're looking for full-time and INTERN hires (junior year or older) who want to move to SF. H1B and relocation are no problem.  For DevOps and back-end infrastructure roles, we also have a significant remote team and are open to REMOTE candidates.<p>See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1351783897,"type":"comment"},{"by":"lelandr","id":4727700,"parent":4727241,"text":"Houston, TX - funded, Tech-focused startup looking for good talent.  Full time and INTERN positions available.<p>Work Environment:\nWork environment is fun and casual. We are a small startup with adequate funding to do the market some damage.  We are looking to build up a team of great developers to make great products, focusing on doing software right.  All developers will be provided with whatever equipment necessary to get the job done as efficiently as possible.  With a small team you will be able to take on very big projects and tasks that you can be proud of. Employees' meals are paid for, and a gym membership is included for all employees as a perk.<p>Looking for an ambitious, eager, gifted developer with extensive experience and knowledge regarding modern web development, including client-side technologies (ie, Javascript).  We are working on a very large web application that should be a lot of fun to build - and something that as a developer, you yourself would use.<p>Compensation:\nAs always, dependent upon experience - however our salary rates are very competitive relative to the market.<p>Required Skills:\n- C#\n- ASP.NET\n- Familiar with .NET Framework\n- ASP.NET MVC Framework\n- Razor View Engine Syntax\n- AJAX methodology\n- SQL (we will be using MS SQL)\n- Javascript\n- JQuery\n- CSS\n- HTML4+\n- DOM Manipulation\n- Object Oriented Design (polymorphism, inheritence, OOP design patterns, etc.)\n- HTTP<p>Helpful but NOT required Skills:\n- C# 4.0 / 3.5 (dynamic objects &#38; DLR, anonymous methods (lambda syntax), etc)\n- Lucene (or Lucene.Net)\n- Database Design (Index design, \n- Knockout.js\n- JQuery UI\n- LESS/SASS (pre-compiled CSS)\n- Multithreaded / thread-safe programming\n- IIS\n- Distributed Hashtables (ie, NoSQL implementations)\n- ORM Design\n- Security, Cryptography, etc.\n- Meta programming\n- HTML5 specifications\n- Local Storage (browser storage)\n- Third Party API Integration (ie, Facebook API, LinkedIn API, Twitter API, etc.)\n- Graphics Design (Photoshop, Indesign)\n- WCF Web Services\n- SQL Server<p>Feel free to contact me at leland@tech.pro with inquiries.<p>Note: in addition to developers, we are also highly interested in any talented designers as well.","time":1351780451,"type":"comment"},{"by":"nqureshi","id":4727825,"parent":4727241,"text":"GoCardless (YC S11); London; Ruby devs, Front-end devs<p>GoCardless is a London-based payments company that makes it simply for merchants to collect money from their customers by linking bank accounts directly to our systems. As a result, there are no credit card networks involved in transactions - payments become much cheaper and more flexible.\nWe're a small but very technically-focussed company - even our sales/biz-dev guys write ruby, python &#38; php to a reasonable standard - and we try to find tech-driven solutions to problems whenever possible. Developers are core to the company's success, so we're working very hard on recruiting the best people out there. The working environment is pretty flexible - while we work hard, we don't really have fixed hours and people are encouraged to work from home if it helps their productivity.<p>We're solving some really challenging technical problems across the whole stack, including deep integration with legacy banking systems, which brings its own set of challenges.<p>We're backed by Y Combinator, Accel Partners &#38; Passion Capital, and we pay competitive salaries + stock.<p>We're looking for a Ruby developer who can work in our office in central London - for a full job spec, please see <a href=\"https://gocardless.com/jobs\" rel=\"nofollow\">https://gocardless.com/jobs</a><p>Email tom@gocardless.com to apply. No recruiters, please!","time":1351781814,"type":"comment"},{"by":"achompas","id":4728086,"kids":[4728161],"parent":4727241,"text":"Knewton (Union Square, NYC, full-time) is hiring for the following:<p>-&#62; Software Engineer<p>-&#62; Infrastructure Software Engineer<p>-&#62; Data Scientist<p>-&#62; Adaptive Instruction Analyst<p><a href=\"http://www.knewton.com/jobs/\" rel=\"nofollow\">http://www.knewton.com/jobs/</a><p>=====<p>Knewton is building the world's most powerful adaptive learning engine, with the goal of making personalized and engaging education available to all. Knewton has been recognized as a Technology Pioneer for 2011 by the World Economic Forum in Davos and one of the top 25 best places to work by Crain’s New York Business.\nThis is an outstanding opportunity to work with and learn from the world's best engineers and data scientists.<p>=====<p>On a personal note: working for us means you'll get free dinner, drinks, coffee, the benefits you'd expect from a mature company (health/dental/vision, group deals on gym memberships, 401(k)), and the great perks you'd expect from a small company (our ping-pong tournament starts next week, our happy hours start every Friday at 5:01pm, and our vacation policy is limitless).<p>We're also pretty flexible about getting work done. We all work remotely to some degree (I work from Miami every other month, and we have devs in Hawaii and Colorado), and those on our team who weren't impacted by Sandy are working at coffee shops, libraries, and apartments across the five boroughs.<p>Feel free to ask me any questions @achompas on Twitter.","time":1351784656,"type":"comment"},{"by":"msisk6","id":4728332,"parent":4727241,"text":"Rackspace is hiring. I've been here a year in the Austin office working on new cloud products and I have to say it's the best place I've ever worked. The Rack is very family friendly with great benefits and lots of cool folks.<p>In my team we're looking for a Java dev or two for the Cloud DNS product, but we have openings for all kinds of stuff building on OpenStack.<p>All the details here: <a href=\"http://rackertalent.com\" rel=\"nofollow\">http://rackertalent.com</a>","time":1351787481,"type":"comment"},{"by":"mryan","id":4727269,"parent":4727241,"text":"Fashiolista - Amsterdam, NL. Python/Django developers, DevOps. Full time, on-site in our office in the center of Amsterdam.<p>We are a funded startup looking for Python/Django developers and sysadmins with AWS experience... or ideally someone who ticks both of these boxes. As Fashiolista is growing rapidly, we are on the lookout for new team members who can help us scale the site and keep up with our growth.<p>Although we are in the fashion industry, a love of fashion is not required. If you love hacking open source applications and scaling high-traffic websites, you'll fit right in. We encourage our team to work on open source projects where possible, and attempt to open source many of the components we build ourselves. We are looking for \"T-shaped employees\" (a la Valve) who can contribute to a number of areas in the business.<p>Our stack consists of, among other things:\n- Django\n- Celery\n- SOLR\n- Redis\n- Memcached\n- PostgreSQL\n- AWS (with heavy use of CloudFormation)<p>More information is available on our jobs page (<a href=\"http://www.fashiolista.com/jobs\" rel=\"nofollow\">http://www.fashiolista.com/jobs</a>), you can also email me directly if you would like to discuss the role futher (email in profile).","time":1351775445,"type":"comment"},{"by":"MattRogish","id":4728008,"parent":4727241,"text":"Funding Gates (NYC) - Full Time, local or remote (local preferred; relocation provided). Ruby/Rails or JavaScript (Ember.js) experts.<p>We're a Series A funded (all private, no VC) b2b startup going live in a week. Our mission is to keep small and medium sized companies ($100k to ~$25M rev) in business by helping them get paid on time, every time.<p>We import their accounting data (invoices, customers) and give them timely alerts, help them triage their receivables problems, use our own secret-sauce to predict customer quality (can they pay on time, etc.), and a whole lot more.<p>Our aim is to be an outsourced receivables management platform for every small and medium sized business in America (international later, as the rules and regs are a lot more complex - the product will work).<p>We're looking for amazing developers to work on our main product, a ruby-on-rails JSON backend to an ember.js frontend. You should be a full-stack generalist proficient in either Rails or JS. Developers at Funding Gates are smart, humble, honest, friendly, optimistic, and caring, and we don't tolerate working with jerks. We're not looking for rockstars, ninjas, or bros: we value teamwork over heroics, collaboration over silos, and pragmatism over dogma.<p>We have a strong engineering/hacker culture, offer unlimited vacation and a Results-Only Work Environment (<a href=\"http://gorowe.com\" rel=\"nofollow\">http://gorowe.com</a>). We are offering above-average salary and for the right people, significant equity.<p>You can get more details at: <a href=\"http://www.fundinggates.com/jobs/\" rel=\"nofollow\">http://www.fundinggates.com/jobs/</a><p>Contact me at rogish@fundinggates.com. I look forward to talking with you!","time":1351783766,"type":"comment"},{"by":"ladon86","id":4728108,"parent":4727241,"text":"ClassDojo<p>FULLTIME in SAN FRANCISCO, CA<p>ClassDojo is used by over 4mm teachers and students to manage behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We're an edtech startup with $1.6mm in funding some of the biggest names in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we're one of the fastest growing education companies of all time. Paul Graham invested in us, but we didn't do YC.<p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board. If you're a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n\n\n  https://classdojo.wufoo.com/forms/join-classdojo/  \n\n  --------------------------    \n</code></pre>\nOr email jobs@classdojo.com. You can read about the work and  environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a><p>We are looking for:<p><pre><code>  * Full Stack Engineer  \n\n\n  * Front-end Engineer    \n</code></pre>\nIf you think you're a good developer but don't fit into those buckets, get in touch anyway.","time":1351784991,"type":"comment"},{"by":"fab1an","id":4727800,"kids":[4730589],"parent":4727241,"text":"BERLIN - EyeQuant (<a href=\"http://eyequant.com\" rel=\"nofollow\">http://eyequant.com</a>) - we hire internationally and are experienced in getting work permits for US-citizens in Germany.<p>* Lead Designer / Front-End Engineer: <a href=\"http://berlinstartupjobs.com/design-ux/lead-designer-front-end-engineer-eyequant/\" rel=\"nofollow\">http://berlinstartupjobs.com/design-ux/lead-designer-front-e...</a><p>* Python Engineer: <a href=\"http://berlinstartupjobs.com/engineering/e-g-senior-python-developer-eyequant/\" rel=\"nofollow\">http://berlinstartupjobs.com/engineering/e-g-senior-python-d...</a><p>EyeQuant is the world's first scalable neuromarketing web service that instantly predicts where users will look on a screenshot or website. We help companies and advertisers to optimize designs for dramatically higher conversion rates and improved usability faster and more efficient than ever before. Our customers include Google, Spotify, Groupon and some of the world’s best conversion optimization agencies. And we’re just getting started. In 2013, we are going to release a product that you’ll want to tell your grandchildren about. Hint: it’s not a photosharing app.","time":1351781565,"type":"comment"},{"by":"dchudz","id":4728496,"parent":4727241,"text":"Kaggle, Developer (San Francisco, CA)\n<a href=\"https://www.kaggle.com/careers/\" rel=\"nofollow\">https://www.kaggle.com/careers/</a><p>As a Kaggle developer, you'll be building the platform at the center of the data science universe. You'll develop the infrastructure that enables Kaggle’s wordwide network of data scientists to compete and tackle the world’s most difficult predictive modeling problems. The tools you will develop go the heart of Kaggle's mission and technology offerings.<p>On a typical day, you might:<p>* Write code for our back-end using the latest version of C#, ReSharper, ASP.NET MVC, and Azure. Front-end developers use tools like jQuery, knockout.js, and LESS. We place an emphasis on pragmatic problem solving, but are always adopting new technologies that help us get there faster.<p>* Develop and deploy on a daily basis with Git, and take ownership over features used by tens of thousands of data scientists.<p>* Help define both our engineering approaches, and overall company strategy and long-term priorities. Everyone at Kaggle is engaged in all parts of the business, and opinions are taken seriously.<p>* Work with a brilliant team of engineers and data scientists on the cutting edge of machine learning. Not all of us have a background in math or machine learning, but all of us get excited about it.<p>* Get whatever tools you need from our corporate Amazon account: no painful approval required.<p>* Work with the data science team to make competitions smooth and scalable.<p>* Build out key community functionality like user profiles, collaboration tools, or content engines.<p>* Integrate winning algorithms into Kaggle Engine, our RESTful prediction and scoring engine.","time":1351789189,"type":"comment"},{"by":"BraintreeR","id":4727466,"parent":4727241,"text":"Menlo Park, CA or Chicago, IL or San Francisco, CA<p>Braintree - FULL TIME Developers, Designers, Security Engineers, System Engineers, Data Engineers<p>Braintree powers payments for innovative and high-growth mobile and online businesses. We provide an easy-to-integrate API for developers while ensuring the merchants’ end users have a frictionless and secure experience at checkout. Our full-stack payments solution includes a payment gateway, merchant account, recurring billing, and credit card storage.<p>Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node.js, PHP, Java, .NET, Perl, and Objective-C<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a> .","time":1351777928,"type":"comment"},{"by":"jdrock","id":4727707,"parent":4727241,"text":"Austin, TX<p>Client Project Developer<p>Datafiniti is the world's first search engine for data.  Datafiniti's search results are complete data sets taken and aggregated from the web.  You can search for information on places, people, products and pretty much any data available on the web.  We are converting the entire web into a single, searchable database of knowledge.<p>Here's an example search: <a href=\"https://www.datafiniti.net/search/places?%5B%7B%22v%22:%22austin%22,%22c%22:%22city%22%7D%5D\" rel=\"nofollow\">https://www.datafiniti.net/search/places?%5B%7B%22v%22:%22au...</a><p>In addition to our search engine product, we assist clients with a wide variety of custom data collection projects.  We're looking to hire someone that can work on our clients team as a project developer to implement and manage these projects.<p>We're a small, close-knit team, so you'll have the opportunity to make a big impact on the company and its future success.<p>Full details are here: <a href=\"http://datafiniti1.theresumator.com/apply/V5pGWC/Project-Developer.html\" rel=\"nofollow\">http://datafiniti1.theresumator.com/apply/V5pGWC/Project-Dev...</a><p>You can also email your resume to careers at datafiniti dot net.","time":1351780502,"type":"comment"},{"by":"JamesCRR","id":4727952,"parent":4727241,"text":"London - iOS dev, front end/ui designer, community manager\nOpenSignal<p>We're crowd-sourcing cellular and wireless data to provide accurate, independent and global maps of coverage.<p>We're looking for:<p>* IOS developer - to take the lead in building an iPhone app that will get bazillions of downloads<p>* Front end developer - to make our site and maps beautiful and design awesome visualizations<p>* Community manager - to write blog posts and reports on our fascinating dataset and help us publicise our project<p>As a team of only 3 at the moment, this is your chance to get in early: you'll have an opportunity to make an impact not only within the company, you will also be responsible for producing data-viz/apps/blogs seen/used by millions. On top of which you'll get a London salary and access to a well stocked team fridge.  Plus we're planning on flying away for hack weeks. We're backed by some awesome investors.<p>If you've got the skills you'll have the opportunity to work on several aspects of building our product. If you're passionate about data, stats, coding or crowdsourcing, get in touch!<p><a href=\"http://opensignal.com/jobs\" rel=\"nofollow\">http://opensignal.com/jobs</a> or email join@opensignal.com","time":1351783232,"type":"comment"},{"by":"Robin_Message","id":4727440,"parent":4727241,"text":"Unifyo | Cambridge UK | Full-time<p>Unifyo is building clever technology that helps people focus on being productive. Our flagship product is helping successful businesses to stay on top of their ever growing number of customer and contact relationships. By being a browser extension, we can show up in any web application the user is using.<p>Our product is written mostly in Javascript, running on a Ruby on Rails backend, talking to a large variety of APIs, including Google, Twitter, Salesforce and Highrise. We aren’t afraid of legacy schleps either, including IMAP and Microsoft Exchange. We run our software in the cloud and use a variety of continuous testing and deployment tools.<p>We are adding two people to our team. Because we wan the best candidates and are happy to shuffle things around to help them fit, we're advertising three roles:<p>Javascript hacker – responsible for the client-side experience of Unifyo, working across browsers, both as an extension and also embeddable directly.<p>Rails expert – keep our code running smoothly and scaling as we add users, as well as adding new API integrations. You’ll need to think up smart algorithms to match and select data, and straightforward ways to store and retrieve it.<p>All-round programmer – We’re happy to be flexible and for people to move around and learn within the company, so if you’re a quick learner then we’d like to hear from you.<p>We’re a small, fun team, with an emphasis on enjoying our work and learning. Getting involved will be a great way to learn and gain loads of experience really really fast. We’ll also offer a competitive salary and stock options so you can share in the company’s success.<p>Contact me directly: robin@unifyo.com or check out <a href=\"https://unifyo.com/jobs\" rel=\"nofollow\">https://unifyo.com/jobs</a>","time":1351777711,"type":"comment"},{"by":"arohner","id":4735224,"kids":[4735249,4745848],"parent":4727241,"text":"San Francisco, CA or remote fulltime (near pacific time)<p>CircleCI: designers, frontend, backendend engineers.<p>At CircleCI (<a href=\"https://circleci.com\" rel=\"nofollow\">https://circleci.com</a>), we're building Heroku for Continuous Integration. We have traction and revenue. Our customers love us, because we move quickly and provide amazing support. All employees talk to customers and are on support rotation.<p>We're written in Clojure. We eat our own dogfood, DevOps, A/B test, do Continuous Deployment and Customer Development.<p>The frontend is a fat javascript client, using HamlCoffee, Less and Knockout.<p>Backend engineers should know Clojure or another 'weird' language (Haskell, Scala, Scheme, etc), and Linux Devops (C compilation model, make, packaging).<p>We're looking for: designers that can write HTML &#38; CSS, Frontend Engineers and Backend Engineers.<p>We're still a small team (we just hired employee #1 off a HN who's hiring thread), so you'll have a large impact on company culture. We're highly influenced by Valve's Employee handbook.<p>Contact us at jobs@circleci.com. Include samples of awesome stuff you've done.","time":1351897847,"type":"comment"},{"by":"seldo","id":4728275,"parent":4727241,"text":"San Francisco, CA. Full time. H1B okay.<p>Sharing over social media is driving an ever-increasing percentage of web traffic. But with mobile clients and HTTPS, traditional web analytics isn't working anymore. We know we can do better, so awe.sm is building full-featured social media conversion tracking and analytics. We tell our customers the value of their social traffic in a metric that's meaningful to them, whether it's page views, signups or dollars of sales. Our APIs allow app developers to integrate social data into their products, without building their own data collection and processing infrastructure.<p>We're an engineering-driven team building products primarily for other developers, so we're passionate about providing an amazing experience for developers. To help us get there, we're looking for a Developer Experience Lead. By that we mean somebody who will really own that experience: somebody who understands deeply how to get the most out of awe.sm, and has the communication skills to get that information to developers. That will mean representing awe.sm at hackathons and other developer events, and being the primary point of contact for developers building on our platform. We want you to find the pain points before our customers do, and feed that information back to the engineering team, so we can adapt our product to real-world needs. We also want you to do anything else you can think of that will help: building demos, writing client libraries, expanding our documentation, or working one-on-one with clients who have novel problems, to see how we can expand the platform to meet their needs.<p>We want you to eliminate friction from integrating awe.sm with our customers' systems. You need to be an engineer first, but also a puzzle-solver, a pattern-finder, and a great communicator. There's no role more critical to our growth right now. (We are also hiring back-end and full-stack engineers.)<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 13 people right now. We have a cool new office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1351786816,"type":"comment"},{"by":"natemartin","id":4728576,"parent":4727241,"text":"Tesla Motors<p>Palo Alto, CA | Full time | Manufacturing Test Engineer<p>I know most of the job postings here are looking for software positions, but I'm sure there's some people with hardware and test experience as well. Tesla Motors is looking for an experience manufacturing test engineer. We're looking for a generalist, equally comfortable looking at a schematic or at code.<p>You will be responsible for implementing a PCBA functional tester for a manufacturing environment.<p>BSEE (MSEE preferred)\nThorough knowledge of C/C++\nFamiliarity with Labwindow CVI, (labview desirable)\nYou should have a good understanding of microprocessors and analog circuits.  Knowlege of schematic capture and PCB layout tools (Altium preferred)\nKnowledge of Java, python, MySQL, C#, and XML desirable,<p>We're looking for experience with test station deployment, stability, and repeatablity in a manufacturing environment.<p>Addtional desireable skills:  SPC, DOE, NPI, ICT, agilent 3070 basic<p>Contact me, nmartin at teslamotors.com if you are interested.","time":1351790142,"type":"comment"},{"by":"conorh","id":4727670,"parent":4727241,"text":"REMOTE or NYC - Developers and designers (mixture of both, even better!)<p>SquareMill.com - We're a development and design group based out of NYC. We're looking for talented developers and designers who are looking for interesting challenges. We take on all types of work from small startup work (generally in Ruby on Rails), to large scale server development (one of our current projects is to develop a large scale server in Go). Our clients include Kleiner Perkins and pg was a fan of our work there - <a href=\"https://twitter.com/#!/paulg/status/202819543217868802\" rel=\"nofollow\">https://twitter.com/#!/paulg/status/202819543217868802</a>. Also when we say remote, we really mean remote, we don't care where you work from. Come join us and help us expand our company!","time":1351780137,"type":"comment"},{"by":"bcjordan","id":4728282,"parent":4727241,"text":"PopCap Games - San Francisco, CA<p>We at PopCap's San Francisco, CA office want your BRaiNS...<p>... to make games with us!<p>We are hiring one more full-stack (in-your-face game to behind-the-scenes backend) software engineer for our San Francisco office.<p>We have a fun, relaxed work environment and a team of incredibly great senior software engineer generalists -- you will learn to work with the full software stack for everything we make. We care a <i>lot</i> about building high quality games and some of the most innovative software in the world to support them.<p>If you don't yet live in San Francisco, visiting our office should convince you to make the leap. Then we can move you out here.<p>I'm a full-stack software engineer there, email me and we can talk about you joining us in making great games: bjordan@popcap.com","time":1351786869,"type":"comment"},{"by":"davidblondeau","id":4728018,"parent":4727241,"text":"Burlingame, CA (next to the San Francisco airport)<p>Collaborative Drug Discovery (CDD - <a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>) is the first real SaaS informatics platform. Every day, scientists around the world use CDD to manage, analyze and collaborate around their data. This type of collaboration is crucial to research on under-funded diseases like Tuberculosis and Malaria and strategic for many players in the industry. Our long list of customers includes academic labs, biotechs, pharmas, government agencies and worldwide foundations like the Bill &#38; Melinda Gates foundation.<p>We think the world has seen too many ugly scientific applications. We care about usability and details. Our team ships code quickly and iteratively. We think design and community management are as important as great technology.<p>We believe a few great people can make a big difference. We strive to embody our name and empower every CDD employee to do their best work. This means working collaboratively, and giving every person ownership and responsibilities.<p>++Senior Software Engineer++<p>As an engineer, you will have a huge impact on how we design, build and deliver our application. You should be a generalist and enjoy working across the software stack. Our current technologies include Ruby (Rails), MySQL, Javascript, Java, and Solr.<p>We look for engineers who love finding efficient, thoughtful, and highly useable solutions to a variety of technical and product challenges. You should strive to write efficient, maintainable code and you should enjoy fast iterations.<p>Sample projects include:<p>* Designing a flexible model and flow that allow scientists to invite collaborators and selectively share data with them.<p>* Building and maintaining an API for third party developers and integrations.<p>* Developing interactive graphical representations for the analysis of chemical and biologic data.<p>* Optimizing import, export and computation of large data sets.<p>To apply, please contact work@collaborativedrug.com with your resume, cover letter, and links to things you’ve built.","time":1351783828,"type":"comment"},{"by":"jefflinwood","id":4727531,"parent":4727241,"text":"Austin: iOS Developer | Full Time<p>LeanMeanTech is looking to add two iOS developers to the team - one senior developer who can build iPhone and iPad apps without a lot of guidance, and one junior/mid-level developer to work with one of our senior developers.<p>We also do a lot of Android and server-side development, so you'd have the ability to work on other projects if you wanted.<p>A little about us: we work on mobile app projects for clients - this is a great role if you want to work with customers (both technical and non-technical) or if you want to move out of freelance iOS development into a full time position.","time":1351778577,"type":"comment"},{"by":"jasiek","id":4727947,"parent":4727241,"text":"London, UK - Full time.<p>We're looking for a new permanent team member here at State\n(<a href=\"http://state.com\" rel=\"nofollow\">http://state.com</a>): a developer with a strong knowledge of Ruby on Rails,\nJavaScript and CSS. We're looking for enthusiasm, energy, a solid software\nengineering background, experience at larger-scale consumer web or mobile\ncompanies, good technical knowledge and skill across the stack of web\ntechnologies.<p>We're a startup but the product we're building is still secret (sorry!) ‹\nwe can say it is large-scale; consumer; it's all about opinions; it's\nglobal and ambitious.  We have some interesting technical challenges\naround speed and scaling, machine learning / recommenders, natural\nlanguage and the semantic web, and creating a platform and API for\nwidespread use and integration. There's a fantastic team coming together ­\npeople with experience of larger-scale Rails projects, creating JavaScript\nframeworks, managing communities in their millions, global business\ndevelopment, bringing together web and mobile design to create a strong\nbrand, starting successful companies, and developing large semantic web\nand big data projects.<p>Technologies we use include Ruby and Rails, Node, MongoDB, Redis ‹ and\nalso Storm, RabbitMQ and Hadoop. On the web front end we're using Sass and\na significant amount of client-side JavaScript, looking for speed,\nresponsiveness and maintainability. There's a strong structure around a\ncentral API.<p>Send your resume to jan@state.com.","time":1351783193,"type":"comment"},{"by":"silvio","id":4728464,"parent":4727241,"text":"San Jose :: Build FPGA design tools at Altera<p>Altera is one of the leading designers of FPGA devices in the world. I'm an engineer in the software team, developing mostly embedded design and instrumentation tools for FPGAs.<p>We are looking for software developers experienced or with a strong desire to learn about Computer Architecture, FPGA design, Digital Logic, Embedded Systems, and more, while at the same time developing engineering design tools in high level languages.\nTo give you an idea of what we do, these are some of the projects that involved me at Altera:<p><pre><code>  * Designed and implemented a high performance on-chip network that's used\n    in thousands of routers, base stations, and switches around the world.\n  * Created a hardware/software instrumentation framework in a mix of Java, C++, C, \n    and Verilog. This is the foundation for all the debuggers at Altera.\n  * Modified the GCC toolchain to add support for Altera's processors, like our\n    NiosII soft processor.\n  * Implemented a GDB Server from scratch in Java.\n  * Defined and implemented the pieces of an ARM CoreSight debug subsystem.\n  * Implemented infrastructure used in a C-to-Gates compiler.\n  * Spent hours hacking away with the tools and many of the available\n    development boards.\n</code></pre>\nIf the above sound interesting to you, then Altera might be the place that you've been looking for. Send me an email to sbrugada at altera.com telling me why you think this would be a good match. You should attach your resume too.","time":1351788840,"type":"comment"},{"by":"vide0star","id":4737910,"parent":4727241,"text":"London: Python and Erlang Engineers, FT, not remote<p>Smarkets (<a href=\"https://smarkets.com\" rel=\"nofollow\">https://smarkets.com</a>)<p>Smarkets is a real-time online trading platform with an Erlang backend and Python frontend. Smarkets is disrupting the global betting industry by offering a modern betting exchange platform with significantly lower transaction fees than the competition. We have traded over £150 million of bets since launching in February 2010.<p>The part of our stack which runs behind the website is one of the few that uses Erlang as a primary language, and is supported by other well-known Erlang projects such as RabbitMQ and CouchDB.<p>The non-Erlang pieces of our stack are mostly written in Python, and relies heavily on asynchronous programming techniques and REST. We use the following technologies: VirtualBox, Vagrant, Flask, gunicorn, PostgreSQL, Ganglia, Icinga, Graphite, Cacti, Jenkins, Trac, Git and many other open source packages.<p>We are well-funded and growing quickly so are looking for Python and Erlang engineers to join our team. If you are looking for a flexible, agile team to work with; want to work somewhere free of big corporate politics; would like a cool project to work on; we’d love to hear from you! More details about the role and what we're looking for can be found on our blog: <a href=\"http://blog.smarkets.com/2012/07/31/smarkets-seeking-python-and-erlang-engineers/\" rel=\"nofollow\">http://blog.smarkets.com/2012/07/31/smarkets-seeking-python-...</a>","time":1351976984,"type":"comment"},{"by":"twohey","id":4728695,"parent":4727241,"text":"Ness Computing, Los Altos CA. Happy to hire H1B<p>Ness Computing's mission is to make search personal. By combining its understanding of human nature with its expertise in search, recommendations and social networking, Ness delivers experiences that are more deeply personal than ever before. We are aggressively hiring backend systems and machine learning experts.<p>You might be right for the machine learning team if you want to work together with specialists on real-world data challenges others consider impossible. You want to be part of a team where everyone takes ownership of problem-solving, from ideas all the way through implementation. Everything the ML team builds is product-driven to solve a specific customer pain. While we are looking for people who are experts in a specific area, we believe that the best solutions come from collaboration. We expect you to apply your expertise to domains you have not previously worked in.<p>You might be right for the platform team if you love technical challenges and are described by others as a self-starter. You are motivated to produce effective and elegant solutions to new problems. Your role will be part architect and part systems builder and as key member of a highly skilled team, and this excites you.<p>Feel free to contact me directly at me email in my profile. You can find more information at <a href=\"http://www.likeness.com/jobs.html\" rel=\"nofollow\">http://www.likeness.com/jobs.html</a>","time":1351791438,"type":"comment"},{"by":"adam41","id":4728566,"parent":4727241,"text":"Hi!\nJohn here from Minus, an image sharing platform based out of midtown NY.\nWe are looking to hire multiple positions including fulltime iOS Engineers and Android Engineers in our NYC midtown office.\nCompetitive compensations and you get to build and work on our brand new app!\nPlease learn more from <a href=\"http://minus.com/pages/careers\" rel=\"nofollow\">http://minus.com/pages/careers</a>\nYou may reach me at john@minus.com and <a href=\"http://john.minus.com\" rel=\"nofollow\">http://john.minus.com</a>\nThanks!","time":1351790021,"type":"comment"},{"by":"uberc","id":4727567,"parent":4727241,"text":"NEW YORK CITY: FULL-TIME C# GAME PROGRAMMER<p>Grasshopper NYC is hiring a full-time C# game programmer based in our new studio at digital/physical media cooperative Collab in Soho, New York. Come join the team creating game lounges for grown-ups -- the \"arcade\" of the 21st century. You will program games for multitouch tables, tablets, walls and floors -- all meant to to foster meaningful face-to-face social interaction.<p>Experience with Unity 3D and multitouch interfaces are big pluses, but most important is serious fundamental game programming skills; strong software design and architecture; pride in code quality; understanding of practical software engineering, testing, and deployment processes; good communication skills; an eagerness to dive in and work hard to get things done correctly and quickly; and above all a love for programming as a creative craft.<p>For the right candidate, there will also be many opportunities to contribute to game design and overall design of the Grasshopper space and experience. Compensation is based on experience and expertise.<p>For more information or to apply, check out some videos at GrasshopperNYC.com and send questions and/or resume and cover letter (including where applicable links to user profiles on programming-related sites like Hacker News, Stack Overflow, github, and Unity Answers) to Ien Cheng at ien@grasshoppernyc.com.<p>Note: Grasshopper is also hiring game programmer interns and freelancers.","time":1351779004,"type":"comment"},{"by":"findery","id":4727536,"parent":4727241,"text":"San Francisco: We're hiring mobile and back end engineers at Findery (<a href=\"http://www.findery.com\" rel=\"nofollow\">http://www.findery.com</a>)<p>We’re a small team based in an awesome office in San Francisco’s Hayes Valley neighborhood and want to meet creative people eager to help others share the places that matter to them.<p>Findery lets people create, share, and discover notes about the places around them. We want to build something that millions of people will use and love. We want people to put our company name on their license plates; to make cakes with our logo on them; and to meet on Findery, fall in love, and live happily ever after.<p>We’ve built something like this before (our founder/CEO Caterina Fake is the Chairman of Etsy and cofounder of Flickr &#38; Hunch), and it was one of the most fulfilling experiences of our lives. We’re doing it again. Come join us!<p>We’re looking for people who have a reputation for building cool things, a knack for learning and reaching just outside their comfort zone, and a passion for creating a virtual space that will foster real-world experiences. Finally, we’re hoping to hire people with the confidence to voice opinions and offer help, but have the humility to welcome opinions and ask for help.<p>Plus, we want people on the team who are fun to be around. :)<p>Check out our jobs page at <a href=\"http://www.findery.com/jobs\" rel=\"nofollow\">http://www.findery.com/jobs</a> or send us an email jobs@findery.com.","time":1351778604,"type":"comment"},{"by":"squirrel","id":4729655,"parent":4727241,"text":"Notting Hill, London, England.<p>Our web application is at the heart of our busy e-commerce business; every day it serves millions of product images and handles thousands of purchases - but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, we have a mix of Linux, Windows, and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. We expect developers to be generalising specialists, ready at the drop of a hat to refine an algorithm, write a tricky integration test, tune a SQL query, or discuss feature nuances with a product manager. Our team is growing fast and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us; we're hiring for all technical roles including front- and back-end devs.<p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homeware, and lifestyle categories, many familiar from the high street. The company has about 80 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.","time":1351803349,"type":"comment"},{"by":"kevingessner","id":4728472,"kids":[4732864],"parent":4727241,"text":"Fog Creek Software, New York, NY (on-site)<p>INTERNS<p>We're looking for interns to join the Trello, Kiln, and FogBugz dev teams here at the Creek in summer 2013. Our internship is paid ($5000/month) and includes private housing and awesome NYC experiences. You'll be working on shipping code alongside Fog Creek's fulltime developers. You will almost certainly not be required to carry buckets of diesel fuel.<p>Learn more and apply at <a href=\"http://www.fogcreek.com/Jobs/SummerIntern.html\" rel=\"nofollow\">http://www.fogcreek.com/Jobs/SummerIntern.html</a>","time":1351788971,"type":"comment"},{"by":"danlash","id":4728936,"parent":4727241,"text":"Atlanta, GA - Full Time - Developer - VersionOne - <a href=\"http://versionone.com\" rel=\"nofollow\">http://versionone.com</a><p>VersionOne produces a leading agile project management software product by the same name. We are a small team that focuses on continuous improvement in our software as well as our process. Our main technology stack is .NET 4 but we use many tools, languages, and platforms including ruby, less, jquery, d3.js, backbone.js, sammy.js, node, asp.net mvc, html5/css3, nhibernate, jenkins, git, and more.<p>We are looking for passionate developers that are comfortable with practices such as pair programming, test driven development and are great communicators. We have a strong dedication to sustainable pace and team building - we have catered lunches 2-3/mo, a keg of craft beer at all times ... let me repeat, a keg of craft beer at all times ... a pool table, table tennis tables, foosball table, arcade, and team events such as paintball and go karts.<p>If you are interested please contact me (a developer) at [dan][.][lash][at][versionone][.][com] or visit our career page here: <a href=\"http://bit.ly/8y8CNx\" rel=\"nofollow\">http://bit.ly/8y8CNx</a> (email is better). We also have some open source projects here: <a href=\"https://github.com/versionone/\" rel=\"nofollow\">https://github.com/versionone/</a><p>We have offices in Alpharetta as well as midtown Atlanta for your commuting pleasure.","time":1351794475,"type":"comment"},{"by":"mlinne","id":4727836,"parent":4727241,"text":"Berlin, Germany. Full time. stylemarks.<p>We were recently finalist at Seedcamp London, Stanfords Venture Lab and are part of the HUB:raum accelerator program which is sponsored by the German Telekom. At stylemarks we are building a mobile app that enables users to easily sell, discover and buy unique design products. Anytime. Anywhere. Our vision is to discover and explore new possibilities of peer to peer commerce through mobile technology. We want to do to e-commerce what tumblr did to blogging.<p>Currently we are looking for senior iOS developer joining our team.<p>About us:\nWe ran rodeos in Mexico, built microfinance initiatives in Kenya, photographed Victoria Secret Models, built outstanding Playstation Games, survived in Muay Thai camps in Thailand and won hackathons in Moscow! We are team of outstanding and creative individuals who recently moved from three different continents to Berlin to set up their future headquarter here. Our story is unique, so is our company. We love what we are doing and are committed to our vision to change the way how people buy and sell their stuff. All of us have a diverse, rich set of experiences and skills! In matter of the last months we run as finalist in Seedcamp London, Stanfords Venture Lab and Startup Weekend Berlin.<p>More information at <a href=\"http://stylemarks.de/jobs\" rel=\"nofollow\">http://stylemarks.de/jobs</a> or contact marc@stylemarks.de","time":1351781964,"type":"comment"},{"by":"meganelacarte","id":4729374,"parent":4727241,"text":"Palo Alto, CA: E la Carte (www.elacarte.com)<p>1.) Front-end Software Engineer to lead the rebuild of our touch-screen UI using the latest web technologies including HTML5 and advanced Javascript web frameworks<p>2.) Back-end Software Engineer (or full-stack generalist with strong Python skills) to work on a variety of projects including 3rd party integration (this role is to replace 2 co-op/interns leaving soon)<p>WHAT IS E LA CARTE?\nE la Carte (www.elacarte.com) is revolutionizing the restaurant industry with our Presto touch-screen tablets, which enable guests to browse appetizing pictures of the entire menu, place orders, split checks, make payments, and play interactive games – all from the comfort of their restaurant seats without having to wait.<p>We're not just building an ephemeral website or apps - we're building an actual tablet as a platform and amazing software for restaurants across North America! Your grandmother will use this product.<p>Join our small dev team (~6 FT Engineers from MIT, Microsoft, and Amazon) in our Palo Alto house and help us scale up this fast-growing company. You'll wear lots of hats, have immense room for professional development and growth, and be able to make a huge impact on our product and organization.<p>INTERESTED?\nSend resume, GitHub or other code repository link, and brief note to hiring@elacarte.com.<p>If you want to jump to the top of the candidate pile, take our challenge at www.elacarte.com/challenge","time":1351799549,"type":"comment"},{"by":"jcberk","id":4728398,"parent":4727241,"text":"Chicago IL / Nashville TN | edo Interactive | <a href=\"http://edo.theresumator.com/\" rel=\"nofollow\">http://edo.theresumator.com/</a><p><pre><code>  * Software and QA engineers\n  * Data warehouse engineers and DBAs\n  * Data analysts and data scientists\n</code></pre>\nWe're a 75-person funded startup providing an easy way to personalize offers and make them automatically available through credit or debit cards and mobile devices. We work with major national advertisers, and with 140 banks and three of the top six card issuers. TechCrunch called us the anti-Groupon - we take the hassle out of deals. See how it works at <a href=\"http://www.edointeractive.com/video\" rel=\"nofollow\">http://www.edointeractive.com/video</a> .<p>From an engineering perspective, we value well-designed, test-driven, service-oriented code. We're looking for people who can act decisively on the challenges they're tackling. Our process is small-a agile; we value both usability and technical design, and technical itches do get scratched here. If you have problem solving skills and an interest in working with rich data, we'd love to hear from you.<p>We use Java, Grails, and JavaScript; Postgres and Hadoop; DevOps and automated testing.<p>Apply at the website above or email michael.doran at edointeractive.com - say you came from HN. Happy to answer questions at jennifer.berk at edointeractive.com (I sit next to the CTO).","time":1351788193,"type":"comment"},{"by":"jal","id":4730825,"parent":4727241,"text":"Senior Web Front-End Developer | Sunnyvale, CA (near Caltrain) | Full Time | H1B<p>Bracket Computing is a stealth-mode startup, focused on cloud computing technology.  We've just raised a sizable Series A from three tier 1 venture capital firms.<p>We're looking for a senior web front-end developer...  We already have awesome full-time user experience and graphic designers.  The senior web front-end role is all about owning and driving the architecture and design of our web front-end.   We are looking for a senior software engineer who is both passionate about web app development and can guide the front-end contributions of a team of 6 full-stack developers.  We lean towards a modern, single-page web app with a RESTful API-based back-end, using a JavaScript-driven web app stack, e.g. Bootstrap/Backbone/Underscore/JQuery.  This role offers substantial ownership of the company's product &#38; vision.<p>Bracket's engineering team currently has less than 20 developers, mostly senior engineers from NetApp, IronPort, Data Domain, VMware, and Facebook.  We're working on a very hard technology and problem space, and also like having fun at the same time.  :-)  As a well funded startup, we have great perks.   We also have a dog friendly office and BBQ patio.<p>We are in stealth mode currently.  Qualified candidates will meet with the founder/CTO for more details.<p>Please send resumes/CVs to jobs@brkt.com","time":1351820614,"type":"comment"},{"by":"jack7890","id":4727441,"parent":4727241,"text":"Director of Customer Acquisition -- SeatGeek -- New York, NY<p>SeatGeek is a search engine for tickets (think \"Kayak for live events.\")  We're looking for someone to lead all marketing and user acquisition efforts, with a focus on inbound (i.e. unpaid) channels.<p>The ideal candidate would be 2-7 years out of college and would have professional experience with web analytics and/or online inbound marketing.<p>More details here: <a href=\"http://seatgeek.com/jobs/inbound_marketing/\" rel=\"nofollow\">http://seatgeek.com/jobs/inbound_marketing/</a>","time":1351777713,"type":"comment"},{"by":"maxprogram","id":4728415,"parent":4727241,"text":"Atlastory, Inc. | Salt Lake City, UT | Full time<p>About: Atlastory visualizes history on a map, allowing users to explore the world through space and time. It’s like Google Maps with the ability to look 10, 50, or 1,000 years in the past. This is an application that has the potential to change the way people around the world learn history and interact with the past. This is a seed-stage startup with funding.<p>Job: this is an employee #1 position for a generalist back-end developer. You will be involved in developing the back-end map rendering, data organization, and system buildout. We use Ruby, Python, Node.js. You should have experience with DevOps/AWS products, database design (SQL, Postgres, etc.), HTML5/JS/front-end a plus. Most of all this set of problems requires someone who can learn as they go &#38; figure things out that haven’t been done before.  A few of the problems you'll be working on:<p>* PROBLEM: How to design a git-like system for collaboratively editing data that spans the history of the world.<p>* PROBLEM: How to organize a huge amount of GIS data so that it can be easily accessed, fed into an image renderer, backed-up, etc.<p>More details in the full posting here: <a href=\"https://docs.google.com/document/d/1bbbWWp7oPHcwbrqKlgJrp7i1PEySkye78p2bUCzxgNg/edit\" rel=\"nofollow\">https://docs.google.com/document/d/1bbbWWp7oPHcwbrqKlgJrp7i1...</a>","time":1351788291,"type":"comment"},{"by":"galori","id":4728789,"parent":4727241,"text":"Hey - I run the development team at Current TV and I'm looking for an experienced Ruby on Rails contractor to come in and work with us (it could turn into a full time job, I'll know that in a few months when we do next years budget). We have a great team, we do TDD, pairing, XP and all of the rest rest of the fun stuff.<p>Here is the job posting:<p>Current TV is looking for an experienced, passionate Ruby on Rails contract developer to come Pair Program, TDD, XP, Refactor, Retrospect, Estimate and Deliver with us. This position will be located in our San Francisco Office.<p>We love and use the latest RoR, Backbone JS, Jasmine js, Capybara and Rspec, CI, feature flagging, Heroku, git and even little bit of Node JS.<p>Our development team collocated at the Pivotal Labs offices earlier this year, paired with Pivots and learned from them -- and now that we are back in our offices we have fully adopted their XP process including everything described above...<p>We are currently gearing up for all kinds of Election and Debates related projects for online and TV and need your help! (check out <a href=\"http://events.current.com\" rel=\"nofollow\">http://events.current.com</a> for our latest work)<p>This is a temporary position. Assignment will be for 2-4 months but may be possible to extend longer.<p>You can reach us by responding to the craigslist post\n<a href=\"http://sfbay.craigslist.org/sfc/web/3363787997.html\" rel=\"nofollow\">http://sfbay.craigslist.org/sfc/web/3363787997.html</a><p>or you can email me directly\ngsteinitz (at) current (dot) com","time":1351792548,"type":"comment"},{"by":"sanford","id":4727802,"parent":4727241,"text":"BraveNewTalent in London, England\nSenior Front End Engineer<p>BraveNewTalent is looking for a talented, passionate senior front-end developer to join our team. We are a social-learning company based in the Holborn area in central London; providing ways for large businesses to manage their employees/talent, and allowing people to engage with brands and thought-leaders in their field.<p>Our long-term goal is to revolutionise the way education works across the globe. We’re passionate about peer-to-peer learning and believe that by bringing together organisations and people we can bridge the skills gap that currently exists.<p>You can view the site in its current shape at <a href=\"http://www.bravenewtalent.com/\" rel=\"nofollow\">http://www.bravenewtalent.com/</a> and our new framework being built up upon request.<p>The Role<p>The role we have available will involve leading our front-end team to deliver scalable, usable and beautiful interfaces for our product. You will be expected to collaborate well with both back-end developers and user-experience/visual designers; and will be given the opportunity to affect the direction of both the product and the code-base. You will be responsible for leading the front-end team and the front-end framework.<p>For more details: <a href=\"https://bitly.com/BNTsnrfedev\" rel=\"nofollow\">https://bitly.com/BNTsnrfedev</a><p>To catch up, its sanford bravenewtalent com","time":1351781593,"type":"comment"},{"by":"wroberts","id":4727314,"parent":4727241,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons. Our top-100 app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some passionate people to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel Partners, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1351776163,"type":"comment"},{"by":"stevewilhelm","id":4727574,"parent":4727241,"text":"Euclid Inc., Palo Alto, Platform Engineer, Full-time<p>As a member of the Platform team, you must enjoy big data and everything that comes with it – you need to possess intellectual breadth beyond software, enjoy the creative side of analytics, and have a willingness to work outside your comfort zone.<p>To successfully handle the traction with our clients and convert it to revenue, we are growing the platform team. We want to re-architect, revise and strengthen the existing platform to digest and circulate the expected amount of data from global sources. Both the analytic and web application component of our product depend on the platform engineers' work. The platform engineer architects data collection from real time sensor technology, scales and creates algorithms to extract revolutionary business insights, and automates this process to power Euclid’s web application.<p>Euclid is digitizing the real world and leveling the playing field for the brick and mortar retailers by changing how they use data. The platform engineer’s role is to digest and circulate our terabytes of data. Euclid treats platform as an essential and rigorous engineering domain, and invest ample resources to it.<p><a href=\"http://euclidanalytics.com/about-us/jobs\" rel=\"nofollow\">http://euclidanalytics.com/about-us/jobs</a>","time":1351779047,"type":"comment"},{"by":"tburch","id":4728159,"parent":4727241,"text":"Mobiplug - Boulder, CO<p>We're hiring for the following:\n- Mobile Engineers\n- Mobile UX Designer\n- Mobile UI Designer\n- Cloud Platform Engineers\n- Embedded Linux Gateway / Protocol Engineers<p>For more information see our jobs web site at <a href=\"http://jobs.mobiplug.co\" rel=\"nofollow\">http://jobs.mobiplug.co</a><p>About Mobiplug:\nMobiplug is a Boulder, CO based startup that’s bridging the digital and physical worlds in a way that just works, to make life more awesome.  Our team is building and designing an affordable all-in-one home monitoring and control solution that connects thousands of off-the-shelf electronics in your life with the smart phone in your pocket. We’re a TechStars Boulder 2012 graduate and were recently funded by Foundry Group. We thrive on great coffee, cool technology, inspired design, and our team's ability to tackle difficult problems with creative solutions.<p>Benefits:\nA great salary and a creative environment are not all that we have to offer. Every team member receives full healthcare benefits (for you and your entire family), free downtown Boulder parking, and cool home electronics to use in your own home. We’re located in Downtown Boulder just a half block from Pearl Street mall, offering great food and after-work fun within walking distance of the office.","time":1351785561,"type":"comment"},{"by":"kloutlaw","id":4728568,"parent":4727241,"text":"Klout is hiring in San Francisco, CA (Fulltime, H1B ok)<p>We're looking a seriously-talented operations engineer to help us create cutting edge systems and tools to manage, maintain and monitor all aspects of the Klout production, staging, and development environments.  Our environment is an intense combination of modern software and tried and true technologies including and leveraging Hadoop, Hbase, MongoDB, ElasticSearch, MySQL, HAProxy, redis, memcached, Node.js and Scala.  We'll challenge your scalability chops with our high volume consumer site traffic coupled with the Big Data challenges of processing over 10 billion data signals a day for over 400 million users on multiple petabyte clusters.<p>Apply here if this sounds exciting: <a href=\"http://bitly.com/SAkkFL\" rel=\"nofollow\">http://bitly.com/SAkkFL</a><p>We’re also looking for a seasoned infrastructure engineer with Hadoop experience, someone who can both implement elegant solutions to Big Data problems and lead by example. You’ve architected highly-scalable, distributed systems efficiently using open source tools -- and maybe even contributed to some.  You’re well versed in the challenges of dealing with petabytes of data on a daily basis and the opportunity to crunch billions of social signals a day excites you.<p>Problems we’re working on:<p>-Scalability and Infrastructure: Building infrastructure to collect, store and process hundreds of millions of social interactions per day\n-Real-time systems: Real-time data infrastructures to process large volumes of data<p>Apply here if this sounds interesting: <a href=\"http://bit.ly/Pp0EUE\" rel=\"nofollow\">http://bit.ly/Pp0EUE</a>","time":1351790031,"type":"comment"},{"by":"marcolz","id":4735024,"parent":4727241,"text":"San Francisco, CA. Full time. H1B<p>Linqia is the easiest way for people to monetize their interest communities for continuing to do what they are most passionate about – story telling. We're always looking for talented people and we're ready to support them, and help them grow. We believe in openness, co-operation, respect, dedication, and hard work – and we live that way every day.<p>We are currently looking for both backend and frontend engineers to work as founding members of a team responsible for the technical design and implementation of multiple applications.<p>We are looking for somebody to:<p><pre><code>  * develop web applications using PHP and web development frameworks\n  * contribute to the continuous improvement of our development methodology\n  * build prototypes\n  * troubleshoot and debug issues on a needed basis\n</code></pre>\nRequirements:<p><pre><code>  * 3+ years experience as a full-stack web engineer\n  * excellent knowledge of PHP, MySQL and jQuery\n  * experience building customer facing web applications\n  * great team player with excellent communication skills\n  * accustomed to work in startups\n  * knowledge of common software design patterns and API protocols\n</code></pre>\nNice to have:<p><pre><code>  * Python and/or Java experience\n  * Hadoop or generic MapReduce experience\n  * working knowledge of the CodeIgniter and/or Zend frameworks\n  * knowledge of the Backbone.js and Underscore.js JavaScript libraries\n\n</code></pre>\nOur jobs page is here: <a href=\"http://www.linqia.com/about/jobs\" rel=\"nofollow\">http://www.linqia.com/about/jobs</a><p>Email us at: jobs@linqia.com<p>Thanks!","time":1351894334,"type":"comment"},{"by":"ai09","id":4727622,"parent":4727241,"text":"New York, Fulltime, Spreecast Mobile Engineer<p>We are bringing Spreecast, a live video platform, to mobile and are growing a team of engineers in New York City. We’re looking for generalist engineers to join our mobile team.<p>We work primarily in iOS and Android and we use a variety of custom video components. We really like full stack engineers and encourage people to learn new skill sets – our best engineers are comfortable with modifying code on our Wowza, FMS, Ruby on Rails, and Java servers. You can try our website at www.spreecast.com to see the experience we are bringing to mobile apps.<p>We’re most interested in excellent engineers, regardless of which current language/toolset you’re currently using. We believe that excellent engineers can quickly accomplish great things in a language that they don’t already know. So if you’re a longtime C++ engineer that wants to get involved with mobile development, be sure to contact us. Engineers with experience in Android and iOS should definitely apply.<p>Fun Stuff<p>Choose your own engineering setup. For instance I’m writing this on a Retina Macbook Pro with two external monitors and 16GB (!?!) of RAM.<p>We’re expanding our office in NYC to include a full time studio for celebrities to use to create Spreecasts.<p>Our headquarters are in San Francisco so you’ll get to take trips to the Bay Area.<p>About Us<p>We are well funded, have been in beta for 9 months, and have offices in NYC and San Francisco. One of our cofounders, Jeff Fluhr, previously started StubHub and sold it to eBay.<p>Please contact robert@spreecast.com","time":1351779501,"type":"comment"},{"by":"jfarmer","id":4728873,"parent":4727241,"text":"San Francisco: teacher-engineers<p>Dev Bootcamp (<a href=\"http://devbootcamp.com\" rel=\"nofollow\">http://devbootcamp.com</a>)<p>When Obama and Romney talk about \"retooling America,\" that's us.  We're a 10-week intense training program for junior software developers.<p>We want to build the best learning environment, period.<p>Do you love to teach?  Hone your craft?  Share the joy of coding with others?  DBC is the rare place where all of these efforts align.  Spend a week diving deep with a new technology -- and then teach 50 students hungry to hear everything about it.<p>Since starting at DBC I've improved as a developer 10x, and the challenge of building the a learning environment is the hardest problem I've yet to face in my career.<p>Some of my favorite things about DBC:<p>1. Our students are our customers.  They pay us, expect us to change their lives, and hold us accountable to that.<p>2. Our customers sit 50 feet from us.  This is the tightest, fastest feedback loop I've ever seen.<p>3. Our internal software is awesome.  We're building a real-time classroom and learning environment -- a huge technical and design challenge.<p>4. Our students tell us that this is the best learning environment they've ever been in<p>5. The staff at DBC would die for these students, but we know how to have fun.  This is both the most intense and most light-hearted, fun workplace I've ever been a part of.<p>6. We're growing.  So fast.<p>Want to come and play with us?  Email jesse at devbootcamp.com and show me why you love coding and teaching. :)","time":1351793653,"type":"comment"},{"by":"capkutay","id":4728960,"parent":4727241,"text":"WebAction (<a href=\"http://www.WebAction.com\" rel=\"nofollow\">http://www.WebAction.com</a>) - Full time or intern. Palo Alto, CA (Downtown Palo Alto).<p>Seeking Front-end Engineers and Platform Engineers.\nWebAction is a start-up looking to fill the gap between big data and transaction data. We have our initial funding and we are now building out our core engineering team. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today. We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>Front-end Developers should be well-versed in HTML, CSS, JavaScript, jQuery, and should be experienced or at least interested in using visualization libraries like d3.js. Strong programming fundamentals and experience with languages like Java/C/C++ is a huge plus (not required). Experience developing native iOS apps would also be strongly desired, but not a requirement.<p>For the Platform Engineer position, you should have experience or at least be interested in learning: Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested, email us at jobs@webaction.com. In your message, mention \"Hacker News\" and feel free to let us know about your passions or any technologies that excite you. We look forward to hearing from you.","time":1351794686,"type":"comment"},{"by":"benjlang","id":4728190,"parent":4727241,"text":"Israel:<p>MyPermissions - <a href=\"http://mypermissions.com\" rel=\"nofollow\">http://mypermissions.com</a><p>Android Developer\nA creative developer with great love for the little green robot and great eye for small details.\nProven Android experience with 2+ years developing apps which rely heavily on web APIs and WebView.\nDeep understanding of the internal of Android - a plus<p>iOS Developer\nA creative developer which thinks different.\nProven iOS experience with 2+ years of developing apps which rely heavily on web APIs and WebView.\nDeep understanding of internal iOS and API - a plus<p>Front End Developer\nA front end developer with a good eye for the finer details.\n2+ years experience working on JavaScript heavy front ends.\nKnowledge in JavaScript based browser extensions - a plus.<p>Back End Developer\nA jack of all trades backend developer which can easily swim in a distributed environment.\n3+ years developing distributed backend systems.\nPython Knowledge (or willingness to learn) - a plus \nKnowledge in Cloud based system - a plus\nKnowledge in AWS services - a big plus<p>Familio - <a href=\"http://familio.com\" rel=\"nofollow\">http://familio.com</a><p>Web Developer\nWeb development: HTML5, CSS3, Javascript.\nExperience in Backend development using open source technologies (such as: Tornado, Node.js etc)","time":1351785845,"type":"comment"},{"by":"trimbo","id":4728307,"parent":4727241,"text":"Radius - San Francisco, full-time, H1B welcome<p>Radius Intelligence provides data and tools to help companies reach over 20 million small businesses. If you've been following the presidential election at all, you're surely aware that small businesses are important to our economy. Small businesses account for a staggering 99.7% of all employers in the U.S. For the past decade, they've created 65% of all new jobs and have employed over half of all private sector workers. That's what we're about.<p>We're looking for engineers to work on our web application as well as our data pipeline, plus designers, data analysts, ops, sales, marketing and more. The highest priority job openings we have are:<p>Sr. Front-End Developer: <a href=\"http://jobscore.radiusintel.com/Szqm8s\" rel=\"nofollow\">http://jobscore.radiusintel.com/Szqm8s</a><p>Software Engineer for Test: <a href=\"http://jobscore.radiusintel.com/SzqULR\" rel=\"nofollow\">http://jobscore.radiusintel.com/SzqULR</a><p>Interaction Designer: <a href=\"http://jobscore.radiusintel.com/SzqtkG\" rel=\"nofollow\">http://jobscore.radiusintel.com/SzqtkG</a><p>You can find us at <a href=\"http://radiusintel.com\" rel=\"nofollow\">http://radiusintel.com</a> and if you have any questions, feel free to mail me at chris at radiusintel.com","time":1351787128,"type":"comment"},{"by":"mwalker20","id":4734830,"parent":4727241,"text":"Build network control software defined networking (SDN) - Engineer / Developer/ Networking expert looking to do more building than just managing.<p>Our product is a hybrid device that functions as a firewall, router, switch, directory, monitoring and detection software. Escape the hardware bound world and apply your experience to shape the cloud and the future of the entire networking world.<p>We are a Chicago-based company looking for the right person to help build the next generation of network control technology for the emerging cloud computing market. We just released version 3.0 of our Software Defined Network (SDN) product line and are jumping into 3.1 development.<p>Are you: \n    Skilled in the ways of Ruby, Sinatra, and Rails?\n    Have a good understanding of Linux, OpenVPN, IPsec, OpenSwan, RabbitMQ?\n    Intrigued by OpenFlow and ONF?\n    Hungry to devour knowledge?\n    Working with Erlang, Clojure, Objective-C, and Ruby?\n    Excited about the future of networking, cloud, and virtualization?\n    Eager to learn and build projects beyond any old job description?<p>About us:\nOur company is established, funded, and growing - but we like to keep the start-up mentality.  We are a band of software experts leading the way on cloud computing solutions, building automation for enterprises to navigation migrate, deploy, and connect across all cloud technologies and providers.  Today, our 300+ customers use almost 2M hours per month of our solutions and usage is growing exponentially.  \nWe’re located across from Union Station (Chicago), and willing to pay salary DOE, health benefits, bonuses, paid vacation, paid holidays, and equity.  We are flexible with hours, work-from-home options, race/creed/national origin/ EO.\nHit us up: jobsATcohesiveft.com","time":1351891567,"type":"comment"},{"by":"caseydurfee","id":4729596,"parent":4727241,"text":"Seattle, WA.  Full stack LAMP engineers.  Full time.<p>RealSelf.com gives people the real story about cosmetic surgery treatments through unbiased reviews from patients and answers from the top plastic surgeons in the world.  We are the 8th fastest growing company in Washington over the past 3 years.<p>We're looking for a couple more well-rounded LAMP engineers to add to our current team of 7.  We hire people who have exceptional communication and teamwork skills, a user-centric mindset, and enjoy covering a lot of ground technically.<p>We:\n* Have a healthy corporate culture and set of values (<a href=\"http://www.realself.com/values\" rel=\"nofollow\">http://www.realself.com/values</a>) that informs everything we do  \n* Write modular, testable, maintainable code\n* Learn quickly, pushing code several times a day, and share what we learn\n* Automate away the uncertainty/risk/boring parts of testing and deployment\n* Are comfortable jumping in wherever needed<p>Full job description here:<p><a href=\"http://www.realself.com/about/jobs#dev\" rel=\"nofollow\">http://www.realself.com/about/jobs#dev</a><p>send an email to casey@realself.com if you're interested or have any questions.<p>Buzzword bingo: PHP, MySQL, Symfony 2, bootstrap, git, chef,  capistrano, memcache, nagios","time":1351802621,"type":"comment"},{"by":"noahbrier","id":4744251,"parent":4727241,"text":"New York, NY. Full time. We're looking for jr &#38; sr python engineers and jr &#38; sr frontend (js/backbone) engineers.<p>Percolate is a very quickly growing SAAS company in NYC. We are building a tool that helps brands create content across social. What makes us unique is that we're the only platform that doesn't already assume a brand knows what to say. To help them figure that out we pull data from across the web and make recommendations on interesting content (whether their own or third-party) that might be interesting at any moment.<p>We're looking for backend (all levels) and frontend engineers (we run backbone.js alongside our RESTful API) to join the team (the company is 25, product team is currently at 14). On the backend, we're especially interested in folks with good experience working with lots of data and excited to build real-time systems.<p>Here's a few reasons why you should come work here: \n- Your chance to work with big data \n- You come in early: We're only a year-and-a-half old \n- As we get bigger, you will be able to focus on what you are good at \n- We are all different and we love it \n- GPL compliant company \n- You choose your workstation \n- You choose your tools \n- No worries, free your mind: NY salary + medical + dental \n- No vacation policy (we don't count the # of days you take in a year)\n- Company invests in you: Fly to PyCon and other conferences \n- We prefer quality over quantity: Focus on clean code and test coverage \n- Your voice will be heard<p>Lots more info about us at our new about pages: <a href=\"http://percolate.com/about\" rel=\"nofollow\">http://percolate.com/about</a><p>If you're interested email us at jobs@percolate.com. If you have any questions you can email me directly at noah@percolate.com. Thanks.","time":1352132960,"type":"comment"},{"by":"wferrell","id":4727754,"parent":4727241,"text":"Palo Alto, CA - Sherpa<p>We're building predictive intelligence into your smartphone.<p>We provide users just the information they need right as they need it and simplify task completion on the iPhone. From telling you 20 minutes before you leave for work that there is a major accident on your typical route, to automatically surfacing key information at the right location -- like your hotel reservation as you approach your hotel -- we simplify your life and help you focus on what's important.<p>It is really only in the past year that what we are doing has become possible on a large scale. This is because background location is now available and with it we are able to build models of the user and connect key bits of information to the user's current state (think position).<p>We would love to show and tell you more!<p>We're looking for great people to join our small startup backed by top VCs.<p>Specifically:<p># UI / UX Designers<p>Interested in creating beautiful mobile experiences that help people interact with information and complete transactions? Send us examples of your work. We’re looking for someone to own the look and feel -- we know it’s important and need help!<p># Backend Software Engineers<p>The deep technology problem we face is information retrieval and machine learning. The user models we build help us make predictions and determine how and when to present information.<p># iOS Engineers<p>We’re looking for iOS engineers that can build beautiful experiences and effects, and squeeze performance out of the system.<p>Please email me at wferrell AT getsherpa.com with your resume.","time":1351781019,"type":"comment"},{"by":"mjgalbo","id":4729092,"kids":[4729444,4729450],"parent":4727241,"text":"NY Based Funded Healthcare IT Startup seeking Software Engineer<p>As a senior software engineer you'll be working closely with our CTO and touch on every aspect of the technology related to the company. It’s a broad job description and we’re looking for someone who loves being part of a fast-paced, constantly evolving work environment where your opinions and decisions will seriously affect our technical direction. We’re looking for a technology generalist with interest in specializing as necessary - It's more important that you love learning and can adopt new languages/frameworks/APIs very quickly.<p>Aidin's mission is to bring transparency to the healthcare system and empower patients with data to make more informed decisions on where they receive care. We're backed by the best institutional investors in both consumer internet and healthcare IT. Aidin was born out of Blueprint Health, a highly competitive healthcare IT accelerator. We currently reside in Dogpatch Labs, a fantastic office housing the best startup community in New York. Our team is dynamic with backgrounds in education, energy conservation and medical imaging systems.","time":1351796235,"type":"comment"},{"deleted":true,"id":4730285,"parent":4727241,"time":1351811765,"type":"comment"},{"by":"zg","id":4727988,"parent":4727241,"text":"LONDON -- Web Developers (front and back-end)<p>TrialReach is a VC-backed startup solving a huge problem in the healthcare industry.<p>Our recent (tongue-in-cheek) recruitment video: <a href=\"http://www.youtube.com/watch?v=VyRxOTJXBII\" rel=\"nofollow\">http://www.youtube.com/watch?v=VyRxOTJXBII</a><p>• This is a company you can be proud to be a part of.<p>• You'll be working alongside a small but highly talented multi-disciplinary team.<p>• Our gorgeous riverside offices in Richmond provide a change from the urban jungle whilst being just 10mins from the tube.<p><i>The Roles:</i><p>We're currently recruiting for 1xBack-end developer and 1xFront-end developer. If you happen to be a full-stack developer, even better.<p>Our back-end stack is Linux/Postgres/Python/Django. Our front end uses the usual HTML/CSS/JS with some jQuery and various javascript libraries for graphing and displaying data.<p>For more details see <a href=\"http://www.trialreach.com/about/jobs/\" rel=\"nofollow\">http://www.trialreach.com/about/jobs/</a><p><i>Where do I apply?</i><p>We're happy to consider full or part-time applicants. We offer competitive salaries and stock options. You must have the right to work in the UK.<p>We're interviewing candidates immediately. So if you're interested, please do get in touch - zeshan at trialreach.com","time":1351783640,"type":"comment"},{"by":"vosper","id":4730630,"parent":4727241,"text":"We're hiring engineers to work on classification, systems, and core engineering for automated classification of online video. We use Python, linux, and make extensive use of AWS (do you like to play with MASSIVE data sets?).<p>Our product technology is a bit different than anyone else's right now; it uses machine learning and computer vision to watch and classify internet video, frame by frame, at large scale. \nTo put this in context, let’s say that the average video is three minutes long and there are 50 million videos put online every month. That’s 150 million minutes of online video published monthly. If you hired people to watch and categorize every single one of them, you’d need 3,422 people working 24/7 to do what SET technology does. What’s more, we don’t just know that a given video contains sports, we know it’s soccer, hockey, or basketball. And we know whether it’s safe or not fit for a customer's brand.\"<p>Our API provides extremely low latency responses to clients asking questions about page- and video-level. Our Dashboard provides reports generated from large amounts of raw data.<p>lars at set dot tv","time":1351816447,"type":"comment"},{"by":"emilydong","id":4730289,"parent":4727241,"text":"LearnSprout (<a href=\"http://learnsprout.com/\" rel=\"nofollow\">http://learnsprout.com/</a>) San Francisco SoMa, CA - full time &#38; intern<p>I work at LearnSprout because everyday, I feel like I am making a difference. Our vision can change the way students learn. If your interested in joining us in our mission, please email jobs@learnsprout.com<p>A bit about us:\nLearnSprout is a friction-less way for vendors and edtech developers to integrate with schools. The field of education technology is growing faster than ever but developers have a hard time getting their products into schools and classrooms. At LearnSprout, we believe that data integrations should not be the reason that many students miss out on the benefits of great technology.\nWe're a 7 person team looking for 1-2 more developers (to add to our current count of 4) and a designer:\nFull Stack Developers (full time or intern) - Python, JavaScript, MongoDB and Linux\nDesigner/Front end Engineer (part time okay) - Someone with an eye for design who can code HTML/CSS and Javascript.\n*Generous compensation package, health benefits","time":1351811800,"type":"comment"},{"by":"yazirian","id":4728072,"parent":4727241,"text":"Sonian - REMOTE; Full-time<p><a href=\"http://www.sonian.com/about/careers/software-engineer-clojure-cloud/\" rel=\"nofollow\">http://www.sonian.com/about/careers/software-engineer-clojur...</a><p>Come work at Sonian and you'll be writing Clojure full-time, working\non interesting big data problems. The Sonian software stack comprises\nmultiple applications tied together with queues and rest interfaces,\nfocused on archiving and indexing over a petabyte of email. Everything\nruns in the cloud (hundreds of nodes), and is thoroughly automated:\nWant to check if your branch is good? Ask our IRC bot (written in\nClojure) to run tests on it! Tests passed? Ask the bot to merge your\nbranch!<p>Our team is fully remote, but we emphasize pairing with tmux and Skype\n(and emacs!). In addition to Clojure/conj, a few times a year,\neverybody gets together for a week in Boston to talk and hack\ntogether.<p>We are also hiring for another Clojure position, with more of a \nsearch focus:<p><a href=\"http://www.sonian.com/about/careers/software-engineer-search-engine-cloud/\" rel=\"nofollow\">http://www.sonian.com/about/careers/software-engineer-search...</a><p>(We're hiring Ruby/Rails devs, too!)","time":1351784520,"type":"comment"},{"by":"jonesy","id":4727868,"parent":4727241,"text":"Chalfont, PA: AWeber Communications (<a href=\"http://aweber.com\" rel=\"nofollow\">http://aweber.com</a> - jobs at <a href=\"http://aweber.jobs\" rel=\"nofollow\">http://aweber.jobs</a>)<p>We're always looking for talented engineers and product experts. If you don't see the perfect job for you on our site, let us know what it is! You can email brianj at aweber dot com.<p>AWeber’s engineering team is a dynamic and exciting place to be. We use open source technologies like PostgreSQL, Python, MongoDB, Redis, Riak, Chef, Ruby, Graphite, and RabbitMQ. We use approaches to software quality like Test-Driven Development, Continuous Deployment, and a healthy addiction to metrics that give us insight into our applications, and how well they’re serving our customers. We have a mode of execution built around Kanban, and a Kaizen culture of continuous improvement. We believe in the kind of transparency, processes, data sharing, collaboration, and communication that foster a DevOps culture.<p>If this kind of environment sounds like a fit for you, send links to github/bitbucket/etc and a resume to brianj at aweber dot com.","time":1351782258,"type":"comment"},{"by":"lolis_smc","id":4729031,"parent":4727241,"text":"A dynamic web-based company is seeking Programmer/Web Developer.\nLocation- Las Vegas\nThis is a full-time opportunity -- permanent employment candidates only.<p>One of the Project which you will be working is <a href=\"http://singlenomore.com/\" rel=\"nofollow\">http://singlenomore.com/</a><p>Big Plus : Django and Python<p>Base Profile:\n* 4+ years of PHP, Python, QA, Linux, MySQL, PostgreSQL\n* Experience developing with web frameworks Zend, Django, and CodeIgniter\n* Experience unit testing, QA testing, and debugging\n* Strong understanding and development of HTML5/CSS3 and other web technologies\n* Strong understanding and development of Video technologies and VoIP\n* Design and development of mobile applications\n* Results oriented with strong customer focus and good communication skills\n* Open, collaborative communication style\n* Ability to learn quickly and adapt as technology changes<p>To apply, please submit your resume and list of the web applications successfully implemented.\nThis is a full-time opportunity -- permanent employment candidates only.\nCompany offers Health benefits\nSend resume to olga@dreamworldpartners.com","time":1351795525,"type":"comment"},{"by":"bentoner","id":4728077,"parent":4727241,"text":"Draftable - Melbourne, Australia - INTERNs<p>We're building the equivalent of github for business documents, which turns out to require a surprisingly large amount of cutting-edge computer science.<p>We’re hiring 4–6 students to work fulltime over the (Australian) summer and have ~1 spot left. Accommodation available if you need it. Read more at <a href=\"http://draftable.com/jobs\" rel=\"nofollow\">http://draftable.com/jobs</a>","time":1351784578,"type":"comment"},{"by":"kennyma","id":4728099,"parent":4727241,"text":"San Francisco, CA<p>LearnUp is seeking Founding Engineers.<p>We are solving America’s skills gap by allowing job seekers to learn job skills online directly from employers. We are a small team, well-funded, and addressing a real problem. We’ve already established partnerships with leading employers such as Staples, GAP, Whole Foods, and Safeway, and the California Community Colleges have committed to roll out LearnUp to nearly 3 million students.<p>We are looking for full-stack Ruby on Rails engineers to join our Founding Engineering team. This is a key technical position with a huge impact on technical and product direction. The best fit would be someone with a strong understanding of web technologies who is entrepreneurial and enjoys shipping and learning on a daily basis.<p>Our current technologies include Ruby on Rails, MongoDB, Javascript, SASS, HAML, and AWS.<p>We offer competitive salary and sizable equity stake.<p>You can email me personally at kenny@learnup.me<p>More info about LearnUp at <a href=\"http://learnup.me/about\" rel=\"nofollow\">http://learnup.me/about</a><p>More info about the job at <a href=\"http://learnup.me/jobs\" rel=\"nofollow\">http://learnup.me/jobs</a>","time":1351784867,"type":"comment"},{"by":"bendilts","id":4727954,"parent":4727241,"text":"Lucidchart - Salt Lake City, UT<p>Lucidchart is a rapidly growing tech startup looking for great backend software engineers to join us at our headquarters in Utah. At Lucidchart, we build killer graphical web applications requiring highly available, secure and scalable backend services. Talent and ability to learn are more important than years of experience.\nYou may have seen Lucidchart demoed during the second Google I/O 2012 keynote:<p><a href=\"http://t.co/sd6GgZvy\" rel=\"nofollow\">http://t.co/sd6GgZvy</a><p>We're hiring BACKEND SOFTWARE ENGINEERS. Lucidchart runs with various decoupled services in a Linux environment using Scala, PHP, MongoDB and MySQL. At Lucidchart, your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly reliable and scalable.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Scala or Java * PHP * MySQL or other relational database * NoSQL databases (MongoDB especially desirable) * Opscode Chef or Puppet * Cloud computing (AWS)<p>We're also hiring FRONTEND SOFTWARE ENGINEERS. We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Javascript * Google Closure compiler/library * CSS/HTML/DOM manipulation * jQuery * node.js * Native app development on Android and/or iOS * Facebook APIs<p>All applicants email resumes to jobs@lucidchart.com.","time":1351783248,"type":"comment"},{"by":"ckroll2","id":4728118,"kids":[4728471],"parent":4727241,"text":"Vine, NYC, Python Platform Engineer, Senior iOS Engineer, Devops/Systems Engineer (ec2), and Product Designer<p>Vine is turning the world into filmmakers. We're taking the techniques perfected by our favorite storytellers and making them easy to use for anyone with a mobile phone. And just like them, our work is never done. We genuinely love what we do. We want to speak with you if you do, too.<p>We are hoping to add a few new members to our team that can help us succeed in our mission. We'd love to speak with you if you excel with any of the following:<p>- iOS development and building highly customized, pixel perfect layouts for the iPhone\n - Experience building high scale platforms in python or similar (especially on ec2). We use flask+gunicorn+gevent but are open.\n - Deep experience operating and automating large ec2 deployments\n - Product design<p>Our product isn't live yet but you can view some of the posts on twitter &#60; <a href=\"https://twitter.com/search?q=vine.co&#38;src=typd\" rel=\"nofollow\">https://twitter.com/search?q=vine.co&#38;src=typd</a> &#62;.","time":1351785062,"type":"comment"},{"by":"garysieling","id":4727309,"parent":4727241,"text":"Philadelphia, PA (Whitpain) : Software engineers and DevOps/Sysadmins/Postgres DBAs<p>Full Time/Interns, Onsite<p>Wingspan Technology\nwww.wingspan.com<p>We're a quickly growing, client-funded company with SaaS and installable products for Pharma and Energy companies. We just deployed a new product with some interesting technology constraints (e.g. users all over the world, extra care given regulatory constraints)<p>Contact - gsieling@wingspan.com","time":1351776048,"type":"comment"},{"by":"borascorp","id":4728209,"parent":4727241,"text":"IT Guru - Boras Corporation - Newport Beach, CA (Orange County)<p>We represent baseball players and are widely regarded as the premier single-sport athlete representation firm in the world.<p>We're seeking an IT guru to manage the various information technology systems at our Newport Beach headquarters.<p>A love of sports, particularly baseball, is useful, but not strictly required. We take great pride in being the best in the world at what we do, and most of us have played sports at a high level. Regardless, from top to bottom, our personnel believe in doing whatever needs to be done for the team.<p>A more complete job description can be found here:\n<a href=\"http://orangecounty.craigslist.org/tch/3365418491.html\" rel=\"nofollow\">http://orangecounty.craigslist.org/tch/3365418491.html</a><p>Obviously we're not your typical HN poster, but if it sounds like a good fit let us know at jobs at borascorp.com. Please mention HN in the body of your email.<p>More information about us and our work: <a href=\"http://en.wikipedia.org/wiki/Scott_Boras\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Scott_Boras</a>","time":1351785989,"type":"comment"},{"by":"harel","id":4743252,"parent":4727241,"text":"London, UK (West End): Python/JavaScript developers<p>Glow has been working with the Facebook Ads API since June 2009, helping clients like Omnicom, Group M, Kraft Foods, Best Buy, Ford and King.com run effective ad campaigns on Facebook. All the team at Glow come from a background in digital marketing services technology and have a knowledge of the marketing potential and techniques on Facebook which is second to none. In September 2012 we were awarded Strategic PMD status by Facebook, \"the highest distinction of excellence we have ever offered to our marketing developers\"<p>Glow is on a rapid growth curve and are currently looking to assemble a super team of great developers to work in our West End office. Successful candidates will play a pivotal role in building the company as we go forward. \nWe’ll do everything we can to make you feel at home.<p>We cook with Python, Javascript, a large dose of other cutting edge technologies and a healthy mix of social and advertising APIs.<p>If you think you can hack it, please apply to careers@thisisglow.com","time":1352120924,"type":"comment"},{"by":"e1ven","id":4727462,"parent":4727241,"text":"Waltham, Massachusetts - \nWe're 20 minutes from Boston (So that ⌘-F 'Boston' will find it ;) )<p>We're looking for smart, energetic, and fun software engineers to help us revolutionize the digital coupon industry. We're doing cool stuff, and we'd love to get to know you.\nEmail me (email in profile), and I'll share your stuff with the team.<p>Right now, what we really need is a QA Engineer-<p>Requirements:<p>*    Solid grasp of computer science fundamentals\n*    Experience building complex test automation frameworks (Java, Ruby)\n*    Strong SQL experience\n*    Comfortable working in a Unix based environment (Mac OSX and Linux)\n*    Participate in the full software development life cycle, from requirements to test case creation to production support and troubleshooting\n*    Able to work in a fast-paced, startup environment<p>Nice To Have:<p>*    Experience with Selenium 2 Webdriver (Java)\n*    Hands on experience with git\n*    Experience with “NoSQL” databases (MongoDB a plus)\n*    Computer science degree or equivalent\n*    Working knowledge of Continuous Integration Platforms (Jenkins)","time":1351777896,"type":"comment"},{"by":"ccparker","id":4729983,"parent":4727241,"text":"Portland, OR, FULL-TIME, REMOTE, H1B<p>Puppet Labs is hiring additional Professional Services Engineers to join our growing PS team! In this role, you'll help our Puppet Labs' customers succeed through training, consulting, and custom development engagements, as well as  further Puppet Labs product growth with direct customer feedback.<p>As part of our Professional Services team, you will work with our customers to implement solutions and deliver professional services, as well as deliver training and keep Puppet &#38; MCollective training accurate and up-to-date.  In addition, you will be responsible for providing pre-sales support to Sales &#38; Marketing, developing and publishing Puppet modules and products, and developing and promoting integration and tooling around Puppet Labs products. As Professional Services Engineer, you’ll also develop blog posts and other communication for Puppet Labs, and work with R&#38;D and Product Management to develop and test Puppet Labs products.<p>To apply, go to www.puppetlabs.com/jobs","time":1351807636,"type":"comment"},{"by":"fideloper","id":4728272,"parent":4727241,"text":"New Haven, CT<p>Digital Marketing Agency looking for talented backend developer.<p>-------------------------<p>Ppply here<p><a href=\"http://www.jobscore.com/jobs/digitalsurgeons/web-developer/a5INu4hRKr4Q_YeJe4efaV?ref=rss&#38;sid=68\" rel=\"nofollow\">http://www.jobscore.com/jobs/digitalsurgeons/web-developer/a...</a><p>-------------------<p>* LAMP stack\n* PHP, OOP, Frameworks (CodeIgniter, Laravel, Zend)\n* CMS - ExpressionEngine\n* Youthful group of peopl, FUN PEOPLE TO WORK WITH!\n* Big clients (Game companies, big names)\n* We like your attitude and desire to learn more than your resume.\n* Perks n' stuff, kitchen and amenities, etc<p>We’re Digital Surgeons, a digital-first creative agency working with well-known progressive brands pushing the bounds of digital marketing and brand experiences.<p>We have a great, fun, and hard-working culture; we hope you're someone who enjoys working with fun people and making new friends at work.<p>We have many varying client projects, from short-lived campaigns to long-lasting projects. We'd love to work with someone who wants to work with clients and brand names and push the bounds of consumer experiences.","time":1351786796,"type":"comment"},{"by":"oakenshield","id":4728603,"parent":4727241,"text":"YC Winter 2012 security startup (stealth) - Palo Alto, CA - First Hire<p>We are building a multi-platform security application + SaaS that solves a big problem for businesses and end-users in the domain of cloud storage and sharing. Our product is in late alpha, has users, and we are currently ramping up to support more platforms over the next 3 months.<p>We are looking for a strong generalist hacker who is comfortable mucking around systems code but can also work on front-end and UI as required.<p>What we're looking for:<p>* Plenty of C++ programming experience, especially systems code. Any platform is okay (Windows / Mac / Linux), as long as you are not biased against working on another platforms if required.<p>* Great object oriented design and API design skills.<p>* A security mindset (see <a href=\"http://www.schneier.com/blog/archives/2008/03/the_security_mi_1.html\" rel=\"nofollow\">http://www.schneier.com/blog/archives/2008/03/the_security_m...</a>)<p>* Bonuses: Windows low-level expertise, JS wizardry, iOS (or Android) experience<p>Apply with links to stuff you've done or built to oakenthrones@gmail.com.","time":1351790455,"type":"comment"},{"by":"wahnfrieden","id":4728158,"parent":4727241,"text":"Canvas Networks (USV Funded) is looking for an iOS lead engineer to join a small, close team building the rich-media community platform of the future.<p>Here’s what we’re looking for:<p>* You have a history of creating and shipping iOS software. Show us something cool you made in the App Store!<p>* You're proficient in Objective-C and Cocoa.<p>* You're passionate about creating delightful user experiences. You share the same goal with the rest of your team: to deliver the best user experience. Everything that matters to the user — from speedy performance to chrome — matters to you.<p>* You've maintained and improved apps after release. v1 is just the beginning — you know how to iterate on an initial release to continue momentum.<p>Free lunch, flexible hours, one of the biggest arcades in Manhattan (3 cabinets!), competitive salary and full benefits (health, dental, vision), take-what-you-want vacation.<p>Our office is in Union Square, Manhattan. If you don't live in New York City, we'll pay to fix that.<p>Shoot an email to jobs@canv.as with a resume, your portfolio, and a link to your github if you have one.","time":1351785551,"type":"comment"},{"by":"blo","id":4729807,"parent":4727241,"text":"San Francisco, CA (SOMA) - Full Time<p>Web / mobile - funded stealth, not your typical X-for-Y startup<p>* Engineers (Full-stack / Frontend or Backend) * Mobile Developers * Data Scientists (Search / NLP) * Designers<p>---<p>We're a team of engineers and designers (MIT, Cornell, ex-Microsoft/Google/etc) working on technology that helps users access their favorite online services and accomplish tasks in a more usable, efficient, and social manner. Our goal is to make an essential utility that people use everyday.<p>We're funded by many notable investors - several are in the top 25 (out of 100K+) people on AngelList. We haven't announced our product or funding anywhere so we can focus on building.<p>If you're looking to get into an earlier stage startup (more equity, ownership, ...) that solves complex problems, then come find out what we're up to.<p>We work mainly with JS (jquery and node.js). Mobile developers should be familiar with iOS/Android. We prefer designers have technical and UX backgrounds.<p>Curious? Send your portfolio (github, dribbble, resume, etc.) to [my username] at alum.mit.edu.","time":1351805258,"type":"comment"},{"by":"cce_","id":4729153,"parent":4727241,"text":"Boston, MA or Providence, RI -- Full-stack engineer and front-end engineer positions at Tracelytics<p>At Tracelytics we work on elegantly answering questions about performance that web developers face each day.  Our technology monitors the full web application stack, helping developers analyze and visualize changes in performance characteristics.  Our work is distributed, agile, and test-driven.<p>We are not a consumer web startup.  Our product is for nerds, by nerds.<p>Our stack is a fairly typical “big data” system: beneath a powerful interface (jQuery, D3, Backbone) we have a data faucet and processing pipeline that does a ton of writes (Cassandra, Hadoop, MySQL, RabbitMQ, Python, C/C++), a backend that does a ton of reads (Python).<p>If you'd like to join our team, please get in touch at jobs@tracelytics.com or check out these postings:<p><pre><code>    http://www.tracelytics.com/jobs/full-stack-engineer/\n    http://www.tracelytics.com/jobs/front-end-developer/\n    https://jobs.github.com/companies/Tracelytics\n</code></pre>\nThanks!","time":1351796822,"type":"comment"},{"by":"huntero","id":4727735,"parent":4727241,"text":"Alcorn McBride | Full-Time | Orlando, FL<p>Hardware/Software Design Engineer<p>We develop audio, video, lighting, and show control systems for themed entertainment. You'll find our equipment in the world's biggest theme parks, museums, and attractions.\nWe're looking for someone with general knowledge of Digital Video technology and Video Compression. RTOS/Embedded software experience is ideal.<p>It's amazing to see the things our creative customers do with our equipment, and it's exciting to work on next-generation tools and hardware to enable our customers to create the \"next-big-thing\". You'll wear a lot of hats(today I'm bouncing between debugging a PC application and working on an FPGA design), but your primary focus will be on our video products.\nIf you'd like to chat about it, my contact info is in my profile.<p>For more details and to apply, you can check out the job listing on our website: <a href=\"http://alcorn.com/alcorn-mcbride-jobs/\" rel=\"nofollow\">http://alcorn.com/alcorn-mcbride-jobs/</a>","time":1351780862,"type":"comment"},{"by":"blader","id":4727245,"kids":[4728287,4729394,4728128],"parent":4727241,"text":"San Francisco: product designers and mobile engineers.\n[So far, every member of our team (who we didn't already know) joined us via Hacker News]<p>Subscription based social hyperlocal mobile gamified dating discovery engine with loyalty coupons. For the enterprise.<p>Just kidding.<p>We're a stealthy team of product generalists, ML engineers, and even a neuroscientist filling a hole in the universe by building software that enriches the human experience. Everyone on our team codes and contributes on every level, front to back. We've all built web scale products and scaled them to millions of daily active users with zero marketing spend. <p>The world is becoming a different place: everyone is going to be carrying around a network connected super computer with ambient sensors in their pockets. We can see the future that is enabled by these devices. We are making that future happen.<p>Real talk: We've been running our prototype for 5 months now and we all use it multiple times a day, every day. Every person we've shown it to has asked us if they can have it. Every single person who's installed ithas gotten mad when our testflights expire. This is, verbatim, what one of our investors had to say after running it for a week:<p>\"Just wow. It's so magical. So easy. In fact, almost too easy. I'd insert something in the first time user experience that is whimsical and funny like: \"making the magic happen...\" And then boom suddenly your whole life shows up as an archive. I just can't get over this. So stunning. You've achieved what few could.\"<p>We are well funded by a long list of top tier investors: <a href=\"http://angel.co/herelabs\" rel=\"nofollow\">http://angel.co/herelabs</a><p>We're looking for a select few product designers (technical people with a portfolio of mobile work) and mobile engineers (who know iOS inside and out and have good taste in design) who can come in and contribute at speed on day one and who are world class at more than one thing.<p>Ideal candidates are brilliant, fearless, and passionate individuals who are uncompromising in their pursuit of building an incredible product that will positively affect the lives of every human being every day. <p>As teammates we value commitment and accountability; honing our craft; building tools to create leverage; and seeking to learn from and understand each other.<p>We are offering founding team equity and competitive salaries. Office space in the heart of the SoMa in beautiful San Francisco. $10K budget for equipment ready the day you start. Exec budgets, gym memberships, team lunches. Willing to relocate. Willing to fly you in for interviews. Willing to tell you our stealthy secrets.<p>We are not your typical San Francisco stealth startup. We are NOT another me-too-social-local-sharing app. We DON'T sell condoms by subscription. We are NOT the place to share photos of your dog taking a leak. There will be NO gamification.<p>Life is short. Build stuff that matters. Email siqi at herelabs.com.","time":1351775200,"type":"comment"},{"by":"saumil07","id":4731073,"parent":4727241,"text":"LocBox, San Francisco. Frontend Engineer, Rails Developer, Data Scientist, Inside Sales Representative. Relocations Welcome, H1B Transfers Welcome. More at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a> and <a href=\"http://www.techcrunch.com/2012/10/31/locbox-series-a/\" rel=\"nofollow\">http://www.techcrunch.com/2012/10/31/locbox-series-a/</a>.<p>Hello Future LocBox Engineer,<p>I’m CEO at LocBox (<a href=\"http://www.getlocbox.com\" rel=\"nofollow\">http://www.getlocbox.com</a>) and we are looking for passionate partners in our mission - empowering local businesses to generate foot traffic and revenue from their best customers. We want to do it with Data and Design in a space that has traditionally lacked in both but is now heating up.<p>Most local businesses resort to unsustainable daily deals or boring Email Marketing to acquire and retain customers. We reject that status quo and our hundreds of (paying) customers agree. We’ve also developed a new search/crawl/tech-centric way of acquiring our own customers and disagree with the obsolete feet-on-street Sales model. The company is very small but generating material and predictable revenue; net revenue growth has exploded in the last quarter.<p>We also just launched with a $5.1M Series A in the press w/ TechCrunch, AllThingsD, GigaOm and VentureBeat (press links below).<p>Talk to us? I'm saumil at getlocbox dot com and at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a>.<p>Recent Press:<p><a href=\"http://www.gigaom.com/2012/10/31/locbox-nabs-5-1-million-series-a-to-run-local-marketing-campaigns/\" rel=\"nofollow\">http://www.gigaom.com/2012/10/31/locbox-nabs-5-1-million-ser...</a>\n<a href=\"http://venturebeat.com/2012/10/31/locbox-pulls-in-5-1m-to-put-the-nail-in-the-daily-deals-coffin/\" rel=\"nofollow\">http://venturebeat.com/2012/10/31/locbox-pulls-in-5-1m-to-pu...</a>","time":1351825945,"type":"comment"},{"by":"zedwill","id":4742879,"parent":4727241,"text":"Madrid, Spain. Full time.<p>Several positions:<p>* Node.js software developer\n* Presales engineer/Node.js software developer<p>Candidates need to be based in Madrid, Spain. We offer the possibility of working partly remotely.<p>MediaSmart is an startup solving problems in mobile advertising. Work is fun and fresh. You will work in real time bidding, performance advertising, and mobile tracking. Our tech stack is Node.js for the application layer, a No-SQL backend for persistente, and Express+Backbone.js for the user interface. Knowledge of iOS/Android development is a plus.<p>We are looking for two candidates, similar profile but the presales role needs excellent communication skills with clients and the non technical staff.<p>More info and contact information available at:<p><a href=\"http://www.mediasmart.es/es/pdf/developer.pdf\" rel=\"nofollow\">http://www.mediasmart.es/es/pdf/developer.pdf</a>\n<a href=\"http://www.mediasmart.es/es/pdf/presales.pdf\" rel=\"nofollow\">http://www.mediasmart.es/es/pdf/presales.pdf</a><p>When applying, please add you saw this offer in HN","time":1352109262,"type":"comment"},{"by":"ILIKEPONIES","id":4728040,"parent":4727241,"text":"NYC | Full-time Lead Back-end Developer | bondsy (<a href=\"https://www.bondsy.com/\" rel=\"nofollow\">https://www.bondsy.com/</a>)<p>Are you:<p>An experienced Rails developer with mastery of all of our back-end stack elements, including Ruby, Rails, Git, Redis, PostgreSQL, and Heroku?<p>Interested in taking ownership of the server-side component of our product?<p>A good communicator who can collaborate closely with technical and semi-technical team members to design and implement RESTful APIs and architectures? Ideally you will have experience creating systems that scale for long-term growth.<p>We are bondsy, the easiest way to put things back into the world.  And we want to chat with you.<p>Here is a brief writeup on our company: <a href=\"http://techcrunch.com/2012/06/14/bondsy-is-a-social-network-for-friendly-transactions-and-trades/\" rel=\"nofollow\">http://techcrunch.com/2012/06/14/bondsy-is-a-social-network-...</a><p>And, here is our AngelList profile: <a href=\"https://angel.co/bondsy\" rel=\"nofollow\">https://angel.co/bondsy</a><p>Get at us: jobs@bondsy.com.","time":1351784053,"type":"comment"},{"by":"wogg","id":4727810,"parent":4727241,"text":"RescueTime (YC W08) is hiring: Candidate Role: Growth Hacker<p>We’re looking for a startup savvy business development candidate. This role requires hands on marketing and sales planning and execution. Candidates show a willingness to experiment and a desire to own the effort and results. You’ll have top design, product and engineering talent to back you up to reach the markets you want to explore. We’ve got a seasoned product ripe for a growth expert to bring broader markets.<p>- Startup business requires fast thinker and self-starter with tough skin<p>- Contribute language, strategy, content for marketing resources like our public website and social presence<p>- Experiment with and track pricing, plans, and package deals<p>- Leverage marketing tools network to improve lead gen<p>- Explore partnerships with complementary products to expand reach<p>- Should have experience and proven performance in marketing and sales<p>- This is a high value and profile strategic hire and we will invest in the best candidate!<p>- We have great health insurance and a 401k<p>Want to know more? jobs@rescuetime.com","time":1351781691,"type":"comment"},{"by":"ssc","id":4744340,"parent":4727241,"text":"Anywhere<p>REMOTE; FULLTIME; H1B, E3, etc. are all possible!<p>SSC Group LLC is hiring a developer with Rails experience and/or stats/data analysis experience.<p>====&#62;<p>We run adult entertainment websites. Our company is profitable and growing.<p>Some things we use every day and love: Linux, Git, GitHub, Vim, nginx, Varnish, Unicorn, Rails, PostgreSQL, Redis, Javascript, and probably others.<p>====&#62;<p>* We allow full time telecommuting.<p>* We work normal hours.<p>* We pay for coworking/office space if you want it.<p>* We have offices in Los Angeles if you want to work on-site.<p>* We allow our developers to contribute to open source.<p>* We get to pick our tools and technologies on new projects.<p>* We take you to RailsConf if you want to go.<p>* We pay competitively.<p>* Our company owners are technical and understand how development works (refreshing!)<p>* We have a Hubot in our Campfire.<p>====&#62;<p>You should be fluent with Rails (or be proficient with stats) and know your way around a Linux server. You should also be comfortable working with adult material.<p>If you're interested, we want to hear from you!<p>Drop us a line and show us one of your projects, a GitHub/StackOverflow profile, or anything else you're proud of.<p>jobs@sscgroupllc.com<p>Experience with high-traffic web sites and TDD/BDD are pluses.","time":1352133698,"type":"comment"},{"by":"ryanbrunner","id":4730335,"parent":4727241,"text":"Toronto: Developers (Full stack), Interns OK. H1B (well, the Canadian equivalent) OK.<p>Influitive is a Toronto-based startup that helps customers identify, track, and recognize their best fans and advocates. And help people who love companies find ways to help out. You can check out a demo of our product at: <a href=\"http://vip.influitive.com/join/prospect\" rel=\"nofollow\">http://vip.influitive.com/join/prospect</a><p>We’re looking for people who are self-motivated, passionate about code craftsmanship, with strong communication skills and the ability to work well with the product team. Our development team is constantly improving our products, our processes and ourselves, and we’d like you to help us.<p>We develop primarily in Ruby on the backend (mostly Rails, some Sinatra), and use a fair bit of Backbone on the front-end. We're especially interested in getting into mobile in the next few months.<p>Here's some things that are important to us:<p>You have some experience with developing web applications. Ruby on Rails experience is a plus, but we’re willing to help you learn and develop your skills.<p>You like working on long-term, complex problems and continually evolving solutions to meet changing customer needs.<p>Working on a team isn’t a problem for you. You value collaboration, and coming up with solutions through communication and consensus.<p>You contribute back to the community - through open source contributions, helping out other developers, or participating in local user groups or events.<p>You think a healthy work-life balance is important, and part of being a great developer is being a well-rounded individual.<p>If you’re interested in joining us, send us a copy of your GitHub profile, your StackOverflow profile, or anything else you think we might be interested in seeing. Don’t worry about a resume.<p>Get back to me at ryan@influitive.com.","time":1351812324,"type":"comment"},{"by":"euroclydon","id":4727246,"parent":4727241,"text":"Power Analytics | Raleigh, NC | Full Time<p>We're looking for a JavaScript developer to work on our CAD-type app done in SVG, JavaScript, and jQuery.<p>We sell electrical power system simulation and modeling software into data centers, oil and gas, manufacturing, and government. Help us work on the web-based interface to our simulation engine. You will help built a CAD-like WYSIWYG designer using SVG, Canvas, and JS.<p>Take a look at Google Doc Drawings. It's done in SVG. This is the kind of program we're working on. Does this sounds interesting to you? If so, we want to talk. Also, we're looking for someone who understands web frameworks and databases. We use C# ASP.NET MVC, but if you have experience with Java, Python, or Ruby web frameworks you'll be fine.<p>You'll need to have at least a couple years experience writing object oriented JS and understand standard web stuff like caching, AJAX, CSS, etc.<p>Email rkoopman@poweranalytics.com and mention Hacker News in the subject.","time":1351775207,"type":"comment"},{"by":"sashthebash","id":4728582,"parent":4727241,"text":"Berlin, Germany (\"H1B\") - StorageRoom - (1) product manager, (2) growth hacker<p>We’re building a cloud-based Content Management platform that’s targeted at developers. We just received funding from prestigious VCs (unannounced).<p>You say Content Management sucks? That’s exactly what we think, and we see a huge opportunity to do something completely different that plays well with HTML5/JS and native mobile apps. The initial version of our platform is already used by hundreds of customers, from major global media companies to small development agencies.<p>We already have a team of incredible developers that are working on the next generation of our service. We are looking for a (1) product manager, (2) growth hacker to help us on the business side of things.<p>Interested? Please send an email to sascha@thriventures.com and tell us why you are the right candidate.<p>P.S.: The company language is English and living in Berlin without any knowledge of German isn't a problem at all.","time":1351790216,"type":"comment"},{"by":"gonzo","id":4727686,"kids":[4728300,4728844],"parent":4727241,"text":"BSD Perimeter (the company behind pfSense) has an immediate full-time, permanent position for a web developer and designer in our north central Austin office.<p>Successful candidate will work on our public-facing websites, the open source front-end of pfSense, and a variety of proprietary customer and internal projects. This position will be responsible for both the design and implementation of these projects.<p>BSD Perimeter is the leading provider of BSD-based network security appliances, and the company behind pfSense, one of the most widely used firewalls. We’re a small, growing company, with the opportunity for one person to have a significant impact. Our websites as a whole see millions of page views every month.<p>Location: Austin, TX. Remote candidates will not be considered. We will consider those who can relocate quickly at their own expense.<p><a href=\"http://blog.pfsense.org/?p=657\" rel=\"nofollow\">http://blog.pfsense.org/?p=657</a>","time":1351780304,"type":"comment"},{"by":"owensbla","id":4728024,"parent":4727241,"text":"Seattle, WA | Front End JS/CSS Developer<p>About Us<p>We are a Seattle start-up that builds markets for and distributes premium multi-media content. We create tools and services that help companies around the globe manage, market and sell their products.<p>Job Description<p>You will be creating and improving a suite of cutting edge client side applications by consuming our server side JSON APIs and integrating them into client side rendered views. The candidate will also work with design lead to build an immersive and polished experience for the end user. They will work on multiple projects, from concept phase through testing and launch. We work in an open, collaborative environment and seek someone who enjoys problem solving and straying outside the routine.<p>Required Skills &#38; Experience<p>- Javascript MVC and best practices<p>- CSS preprocessors<p>- JS Templating<p>- HTML5 API<p>Bonus Skills &#38; Experience<p>- Backbone &#38; Underscore<p>- CSS Grids<p>- Require &#38; Optimizer<p>- Chrome/Webkit Dev Tools<p>- UI/UX Background<p>If interested, feel free to email me at blake@blakeowens.com with any questions and send along your resume, github account, or website.","time":1351783858,"type":"comment"},{"by":"foresterh","id":4728314,"parent":4727241,"text":"Seattle, Full time.<p>IOS/Objective C Dev/Architect/Lead<p>Gratafy is seeking an expert iOS developer to lead iPhone app development and enhancements, and support our already established iPhone app. This role will directly interface with the founders, other developers, as well as business development and marketing functions. Gratafy is a highly collaborative, agile, and fast-paced environment -- your contributions will be visible and highly impactful.<p>Gratafy is a VC funded startup located in Seattle's South Lake Union neighborhood. We are a growing team, building a social gifting platform focused on giving and sharing experiences. Gratafy allows users to instantaneously send gifts to Facebook friends at a rapidly expanding list of partner local and national restaurants, nightlife establishments, and hotels. We launched at the end of October and have been featured on ABC, CNN, as well as other media outlets.","time":1351787201,"type":"comment"},{"by":"ivyirwin","id":4727792,"parent":4727241,"text":"San Francisco Area -- Remote Possible -- MindTime.com\nMindTime is looking for a a jack-of-all-trades developer to help develop and maintain a small portfolio of websites and applications. MindTime has developed a data point that gives unprecedented insights into human behavior, and they are retooling their platform to integrate with big data.<p>Existing web assets are all built in PHP and MySQL, so familiarity with these tools is required. Current technology roadmap includes a new Facebook App, a revamped API, and more centralized data monitoring.<p>MindTime has been in business for over 15 years, but they are in \"startup\" mode as they steer their business toward greater value. The founder is located in San Francisco, but willing to work with the right team.<p>To see current projects, visit mindtimemaps.com, mindtimetech.com, and smartslices.com. To learn more, send a note to irwin [at] mindtimetech (dot) com.","time":1351781490,"type":"comment"},{"by":"jaeysin","id":4729270,"parent":4727241,"text":"Afar Media | Full Time | San Francisco<p>Afar Media is a collaborative travel guide as well as a printed travel magazine. I'm the lead engineer for a three-person team, and we're looking to add a front-end developer. We use Rails 3, Slim and all the attendant technologies (jQuery, CoffeeScript, drinking lots of coffee). Lately, we've been using Ember.js, which is awesome.\nI'll paste below our official post, but let me say up front why I think this is a great job.\n- We work reasonable hours and we're paid well for our time. (No nebulous promises of worthless equity for infinite hours at the desk.)\n- We believe in travel so strongly that we pay you to do it. That is, each employee gets a yearly travel stipend and three weeks vacation to use it. The only caveat is it must be international travel and it must be to a city you've never visited before. (Note: this is an awesome caveat.)\n- Live somewhere else in the US? Maybe we could work something out about working remotely transition into working in the office. (Maybe. Tell us what's up. I started working remotely from Chicago before moving to SF.)<p>---- Begin Official Description ----\nAFAR Media is a well-funded travel media start-up spanning print and web. We have big monitors, stand-up desks, and fancy new laptops. Your coworkers will be be developers, designers, project mangers, and (this is the cool part) magazine editors, meaning you'll work with a wider ranger of personalities than the standard developer scrum.\nThis job is ideal for someone who loves to travel for fun (the position does not require travel, but a fulfilling life does, and one of our great perks is a yearly travel stipend). No arbitrary requirements here, if you are an expert or a least have a hacking willingness to learn and have a good attitude, we want you. Our team is small, and all opinions are considered (and frankly, needed) from product design through delivery.\nCheck out our site: <a href=\"http://www.afar.com\" rel=\"nofollow\">http://www.afar.com</a> If you are interested, please send an email to jobs@afar.com, including relevant experience and work.","time":1351798408,"type":"comment"},{"by":"martian","id":4728564,"parent":4727241,"text":"San Francisco - Thumbtack - Software Engineer, Product Designer<p>Thumbtack is Amazon for services. A quarter of a million businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. We're well on our way to being profitable and looking for two more souls to join the adventure.<p>We're \"disrupting\" the services industry and have been covered in many major media outlets: WSJ, NBC News, Washington Post, CBS, Inc, USA Today, and hundreds more.<p>Our small team is dedicated to excellent engineering and design. We eat meals together everyday cooked by an in-house chef. We work in a beautiful old warehouse in SOMA. We play ping-pong (if that's your thing).<p><a href=\"http://www.thumbtack.com/engineering\" rel=\"nofollow\">http://www.thumbtack.com/engineering</a> and <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Email chris at thumbtack with questions.","time":1351789991,"type":"comment"},{"by":"scompt","id":4727526,"parent":4727241,"text":"Simfy | Cologne, Germany | iOS Developer<p>We are a team of music- and technology enthusiasts, which combines passion, hard-work and fun to change the way people will listen to music in the future. Starting from the idea that music should be available every where and at any time, independently form where you are and what you do, we keep working every day to make listening to music easier and better.<p>We're looking for an experienced iOS Developer (m/f) who shares the vision and helps to build the best iOS streaming apps out there in the market. You have an insatiable thirst for learning new things and enjoy sharing your knowledge. You are organized, clear-headed, creative and proud of the high-standard to which you work.<p>More details at: <a href=\"http://about.simfy.com/jobs/job-offers/ios-developer-mf/\" rel=\"nofollow\">http://about.simfy.com/jobs/job-offers/ios-developer-mf/</a>","time":1351778529,"type":"comment"},{"by":"mikebabineau","id":4727795,"parent":4727241,"text":"Rumble - SF Bay Area (Redwood Shores, CA) -- <a href=\"https://www.rumblegames.com\" rel=\"nofollow\">https://www.rumblegames.com</a><p>We're a new, well-funded startup making and publishing AAA games for browser and mobile. We're making real games for a large audience. Not ultra casual, not too niche-y.<p>Our first title is a cooperative multiplayer 3D action-RPG. Think Diablo on Facebook. But free-to-play, and no big download. No obscure plugins, either -- we use Flash, but you wouldn't believe it. Adobe says they've never seen anything higher quality in Flash.<p>Seriously, check out our trailer: <a href=\"https://www.rumblegames.com/kingsroad\" rel=\"nofollow\">https://www.rumblegames.com/kingsroad</a> (and that was 8 months ago - we've come a long way since)<p>We're in closed beta. Let me know if you want to give it a test drive.<p>Rumble is backed by Google Ventures and Khosla Ventures ($15mm series A). We have one of the strongest founding teams the gaming industry has ever seen. (<a href=\"https://www.rumblegames.com/about/our-team\" rel=\"nofollow\">https://www.rumblegames.com/about/our-team</a>)<p>We're both a developer and publisher of games, and we need help on both sides. If you want to develop the next generation of top-quality games, or you want to build and scale infrastructure to 1mm+ concurrent players, this is for you.<p>Positions: <a href=\"https://www.rumblegames.com/careers\" rel=\"nofollow\">https://www.rumblegames.com/careers</a> (contact me directly if something isn't listed)<p>Engineers<p>* Platform -- Java/Groovy/Grails/AWS (esp. Senior and Architect/Lead/VP)<p>* Web -- HTML+CSS+JS+(PHP/Python/Ruby)<p>* Game -- Flash+AS3/Java/C/C++/C#/Unity<p>* Data -- Hadoop/Spark/Mesos/Kafka/R+ML/Stats<p>Other<p>* Product Managers<p>* Analysts<p>* Designers<p>Drop me a line: mike.babineau@rumblegames.com","time":1351781514,"type":"comment"},{"by":"swalling","id":4730237,"parent":4727241,"text":"San Francisco, CA. Full time. H1B okay. Remote is a potential too.<p>We're the experimental features team at the Wikimedia Foundation, the nonprofit that supports Wikipedia and other free knowledge projects.<p>We're looking for full stack engineers, ideally with a bent towards frontend work, that can help us fix the experience of editing Wikipedia. Wikipedia has ~450 million monthly unique visitors, but only about 80,000 monthly contributors, and that enormous disparity is what we're working to correct.<p>Rather than describe all aspects of what we're doing, here's a blog post describing one of the projects on our plate, and how it relates to our general approach:<p><a href=\"http://blog.wikimedia.org/2012/10/24/fix-this-broken-workflow/\" rel=\"nofollow\">http://blog.wikimedia.org/2012/10/24/fix-this-broken-workflo...</a><p>The post also includes links to apply, and some examples of what we've done in the past.","time":1351810949,"type":"comment"},{"by":"donohoe","id":4727706,"kids":[4729819],"parent":4727241,"text":"New York City, NY - Front-End &#38; Mobile Web Developer - Quartz <a href=\"http://qz.com\" rel=\"nofollow\">http://qz.com</a><p>Collaborate on a frontend unlike any other news site - one that places emphasis on the reading experience, seamless interaction, and values content over traditional business needs. An opportunity to shape and redefine the news reading experience.<p>More info: <a href=\"http://bit.ly/mobileWebDev\" rel=\"nofollow\">http://bit.ly/mobileWebDev</a><p>New York City, NY - Ad Product Engineer - Quartz <a href=\"http://qz.com\" rel=\"nofollow\">http://qz.com</a><p>A rare opportunity to help conceive and execute a totally custom ad product from the ground up. We’re not talking banner ads, we mean making ads complementary to a great reading experience. Think in terms of “How would Instapaper implement ads?”<p>More info: <a href=\"http://bit.ly/adProdEng\" rel=\"nofollow\">http://bit.ly/adProdEng</a><p>You can email me direct for either of these spots - see my profile page. No recruiters or agencies plz - just people.<p>More info via recent press:<p>\"The Atlantic Launches Mobile-First Business Publication, ‘Quartz’\"<p><a href=\"http://mashable.com/2012/09/24/quartz-the-atlantic/\" rel=\"nofollow\">http://mashable.com/2012/09/24/quartz-the-atlantic/</a><p>\"Quartz: The new biz-news site is a technological and structural innovator, with only a few hiccups\"<p><a href=\"http://www.niemanlab.org/2012/09/quartz-the-new-biz-news-site-is-a-technological-and-structural-innovator-with-only-a-few-hiccups/\" rel=\"nofollow\">http://www.niemanlab.org/2012/09/quartz-the-new-biz-news-sit...</a><p>\"5 things journalists should know about Quartz, Atlantic Media’s business news startup\"<p><a href=\"http://www.poynter.org/latest-news/mediawire/188712/5-things-journalists-should-know-about-quartz-atlantic-medias-business-news-startup/\" rel=\"nofollow\">http://www.poynter.org/latest-news/mediawire/188712/5-things...</a>","time":1351780499,"type":"comment"},{"by":"drothlis","id":4736661,"parent":4727241,"text":"London UK: Junior test automation engineer. Permanent, full-time, on-site.<p>At YouView we are automating the testing of our product (a set-top box) using stb-tester[1], a tool that we developed and open-sourced which captures video from the set-top box and analyses it in real time.<p>These are early days for the project, so you can have a large impact on its direction and success. One week you might be writing a python module to control a network-controllable power supply; another week it might be a script to generate comprehensive test coverage of a menu tree. There will be tedious work too, but we want the kind of person who hates tedious work so much that they automate it away.<p>Unix shell scripting and administration experience is highly desirable. The test scripts themselves are written in python.<p>[1] <a href=\"http://stb-tester.com\" rel=\"nofollow\">http://stb-tester.com</a>","time":1351952586,"type":"comment"},{"by":"lgalea","id":4728009,"kids":[4728433],"parent":4727241,"text":"Toronto, Canada. Full Time. Ruby Developer.<p>Write awesome code  and help people get laid at Avid Life Media. :)<p>We're a leading social entertainment company that operates some of the most vibrant social networking and dating communities on the web.<p>As a developer, you’ll join an elite team working on properties such as CougarLife, Established Men, and ManCrunch.  You’ll be involved in all stages of developing the products. You'll help create new product ideas, guide the product roadmap and spec out what the next generation will look like. We look for individuals who thrive in an environment where they will work creatively, take initiative and deliver on commitments.<p>For more details: <a href=\"http://jobs.startupnorth.ca/job/ruby-developer-toronto-on-canada-avid-life-media-inc-4395eedbf5\" rel=\"nofollow\">http://jobs.startupnorth.ca/job/ruby-developer-toronto-on-ca...</a>","time":1351783774,"type":"comment"},{"by":"shadchnev","id":4733965,"kids":[4753050,4753052],"parent":4727241,"text":"LONDON, UK.<p>Arguably the most exciting tech position in London.<p>We are Forward Labs, a startup lab in London. We are a dozen guys coming up with new ideas, building prototypes, testing them using lean techniques and forming teams around products that have solid traction. Essentially, we are a well-funded playground. Our goal is to produce 1-2 new businesses a year.<p>We have amazing, driven, entrepreneurial people who have a range of skills, from dev to UX/UI, marketing etc all within the team. Since we are part of a larger company, Forward (www.forward.co.uk), we also benefit from access to their expertise. Please read more about the role on our website: <a href=\"http://www.forwardlabs.co.uk/jobs/lead-developer-for-various..\" rel=\"nofollow\">http://www.forwardlabs.co.uk/jobs/lead-developer-for-various...</a>.<p>Email me at evgeny.shadchnev@forward.co.uk for details.","time":1351879865,"type":"comment"},{"by":"takrupp","id":4728001,"parent":4727241,"text":"HFT Market Maker - Los Angeles, CA (NYC possible) - Full Time, No Telecommute - <a href=\"http://constitutionllp.com/active-positions/\" rel=\"nofollow\">http://constitutionllp.com/active-positions/</a><p>One of our clients, a high frequency trading market maker, is looking for top Java developers with a strong skill set in CS fundamentals and statistics.  This firm is not your typical finance outfit, and will actually not look at candidates coming from finance.  They want people coming from low latency, high through-put environments who understand the network stack from top to bottom.  This is a very flat organization, loaded with very passionate developers.  They are also relatively small, about 200 people globally, and they wont be growing much beyond that number.<p>Contact trent.krupp@constitutionllp.com if interested.","time":1351783722,"type":"comment"},{"by":"carlio","id":4729077,"parent":4727241,"text":"Munich, Germany - remote and relocation help possible<p>LaterPay GmbH<p>We are building a payment API to make it easy to charge for digital content, from news articles to stock photography to games. Currently we are working with some of the largest publishers in Germany, focusing on online magazine content, and shortly enabling micropayment based transactions.<p>We are a small team looking for problem solvers and generalists who can debug a puppet manifest one day, prevent obscure XSS attacks the next, and optimise some Django ORM calls in between.<p>We use python, and so proficiency in python and especially Django is a big plus as this is the majority of the day to day job. But we're open to anyone who gets stuff done, to use what is by now probably a cliche!<p>Email me at cc-jobs@laterpay.net with a resume or a bunch of cool stuff you can show us (GitHub profile for example)","time":1351796083,"type":"comment"},{"by":"loire280","id":4729401,"parent":4727241,"text":"GS Design in Milwaukee, WI is hiring a full-time backend developer.  Must be on-site.<p>GS Design offers an incredible work environment, generous compensation and benefits, and the opportunity to work with a national client roster including Harley-Davidson, Mercury Marine, SRAM Corporation, Showtime and more.<p>Most of our work is in Python and PHP, and we use Django, Drupal, and Wordpress.  Our projects are client-focused and varied - web applications, custom content management, and service integration.  We're looking for a flexible, pragmatic generalist who can handle multiple projects and shifting requirements.<p>We're also looking for an Art Director, a User Experience (UX) Architect, and a technical Project Manager.<p>You can see all our open positions here:\n<a href=\"http://www.gsdesign.com/careers\" rel=\"nofollow\">http://www.gsdesign.com/careers</a>","time":1351799883,"type":"comment"},{"by":"salar","id":4728206,"parent":4727241,"text":"Amsterdam, the Netherlands. Interns OK, no remote work.<p>Silk (www.silkapp.com) is looking for a DevOps engineer, and front-end and full-stack engineers.<p>We're building a product that makes it easy for people to create sites with content that is easy to query, visualize and share. On a deeper level, our vision is to bring the semantic web to the masses and build an amazing company around that.<p>We're working on many interesting and challenging problems, with a custom-built Haskell graph-database on the back-end and a cutting-edge Functional Reactive client-side framework in Javascript on the front-end.<p>The team is still small (~11 people), so you'll be able to make a large impact. We are well-funded by top-tier VCs and located in the city center of Amsterdam.\nMore on <a href=\"http://jobs.silkapp.com/\" rel=\"nofollow\">http://jobs.silkapp.com/</a>","time":1351785975,"type":"comment"},{"by":"salsf","id":4729159,"parent":4727241,"text":"San Francisco, CA │ ePantry │ Founding Engineer<p>We launched in August and were seeded behind a vision of making it easier for busy people to make responsible choices.  Highlights below:<p>*  Customer Problem: We want to buy (and not run out of) sustainable products, but busy people take the path of least resistance on their household consumables<p>*  Customer Value Proposition: 5 min registration = A) never run out of TP, B) never overpay, C) always get products good for people &#38; the earth<p>*  Customer Archetype: ~35 y/o female, kids, busy; “green,” but SUV; Whole Foods, but 365 (private label); iPhone, but not techy; Gilt often, but Gucci rarely<p>*  What We Do: “Dollar Shave Club” for name-brand, “green” household consumables ($24+bn TAM), with an emphasis on flexibility and customer service<p>*  Competition: Selling a niche product better than Amazon has a surprising track record.  e.g. Alice, Dollar Shave Club, Manpacks, Quidsi, Zappos<p>*  Our Challenge: Create the most convenient platform in the world for a set of household products with unique purchasing patterns (not a shopping cart site…)<p>*  Full Time Team: Stu (Biz/PM): Advisor &#38; raised &#62;$2m @ 4 start-ups, &#62;$100m invested in tech, employee #2 twice; Jordan (Mktg): Goodby, Doritos, TD Ameritrade<p>*  Seeders : The entrepreneurs behind companies like Hotwire, CitySearch, Friendster, Cater2.me, Everfi, Vincraft, Augusta Columbia, and Toro IP<p>*  Stage: Funded. Compulsively user testing prototypes.  Conversations with suppliers on track.  Alpha customers by November 15<p>*  Founding Engineer: A fully empowered co-founder with strong opinions, understanding of lean &#38; MVP tradeoffs, full stack ownership, and a long term vision<p>*  What You Get: Competitive cash, generous equity, full benefits, flexible/fun environment, passionate team, leave the world better than you found it<p>I would love to grab a coffee/beer and brainstorm about the challenges and opportunities ahead.","time":1351796908,"type":"comment"},{"by":"quixey","id":4729205,"parent":4727241,"text":"Mountain View, CA - Principal Data Scientist, Senior Software Engineer, DevOps Engineer, Engineer in Test, and more!<p>We're Quixey, the Search Engine for Apps. We partner with some of the largest carriers, app stores, browsers, and manufacturers to power app search worldwide. Our Functional Search technology uses data from across the web (blogs, tweets, news and review sites and more) to learn exactly what each app does. Just type what you'd like to do into any \"powered by Quixey\" search bar and we can find an app to help.<p>We're all about solving tough problems, and revolutionizing the existing app discovery model is no small task. We just moved into a bigger office in Mountain View, CA and are actively hiring for positions across the board. Check out open listings here: <a href=\"http://bit.ly/SOngig\" rel=\"nofollow\">http://bit.ly/SOngig</a><p>Also, here are couple descriptions of what we're looking for:<p>Principal Engineer, Search Sciences -  In this awesome newly created role, you will work with various internal teams at Quixey to develop the next generation of technologies to power Quixey’s powerful Functional Search Platform. This will include solving real world challenges in search, organizing information, cluster content, text classification, and extracting signals from structured and unstructured data sources.<p>Software Engineer in Test - We're looking for an experienced engineer to help build the tools and processes that will uphold our quality standards. This includes testing a variety of software products, system architectures, OS platforms and browsers with maximal automation; building test frameworks that are woven into our development and release process including regression and unit tests; and designing and implementing QA strategies for a variety of tools.<p>DevOps Engineer - This position involves building tools to manage, deploy, monitor, and scale our AWS infrastructure with close integration to our build &#38; bug-tracking system, working closely with our development team to plan our co-location strategy, and managing costs effectively for cloud services.<p>We're a fun, exciting startup that's expanding super fast. We’re well funded, backed by world-class investors and are on track to power a billion queries per month. We’re looking for passionate people who can make big things happen and have fun doing it. We're also hiring in Finance, Marketing, and Product Management, so take a look at all our open positions and see what might be a good fit! <a href=\"http://bit.ly/SOngig\" rel=\"nofollow\">http://bit.ly/SOngig</a>","time":1351797508,"type":"comment"},{"by":"cedsav","id":4728905,"parent":4727241,"text":"Sales / Business Development Position - Bloomington, Indiana - Remote OK<p>We’re looking for the right person to help us improve our sales processes and craft our marketing strategies. Ideally, you have experience with inbound marketing, lead management, and enterprise sales.<p>We run FormAssembly, one of the top web form management solutions. We’re small, bootstrapped, profitable, and expanding! Our customers, from Fortune 500 companies to small businesses and nonprofits, use our software to create online forms and collect data. We play a critical role in their business processes; FormAssembly helps them recruit teachers, qualify clients for assistance, learn from their customers, or acquire new ones.<p>More info: <a href=\"http://veerwest.com/jobs\" rel=\"nofollow\">http://veerwest.com/jobs</a>","time":1351794077,"type":"comment"},{"by":"leeny","id":4728343,"parent":4727241,"text":"TrialPay - Palo Alto, CA (F/T, will cover relo)<p><a href=\"http://www.trialpay.com\" rel=\"nofollow\">http://www.trialpay.com</a><p>We work on getting users to try new products and services, install new mobile apps, play new games, and visit new stores by giving them stuff that they already want for free. For instance, our users score free movie tickets in exchange for signing up for Netflix, free Facebook credits in exchange for signing up for Gamefly, and so on.<p>TrialPay was founded by engineers, we’re growing fast, and we’re passionate about understanding consumer behavior. We have great revenue, we respect ideas, and in general, the consensus here is that we work with the smartest people we've ever met.<p>We're looking for strong back-end engineers and people who like playing with huge volumes of data.<p>aline@trialpay.com","time":1351787594,"type":"comment"},{"by":"krupan","id":4728193,"parent":4727241,"text":"San Jose, CA; Salt Lake City, UT; Boulder, CO<p>Fusion-io<p>Everything from embedded software, device drivers, SDK development, hardware or software project management, QA, field support, manufacturing engineering, digital logic (ASIC/FPGA) design and verification, IT, etc.<p>See the full list here: <a href=\"http://www.fusionio.com/company/employment/?area=all\" rel=\"nofollow\">http://www.fusionio.com/company/employment/?area=all</a><p>Fusion-io is a great place to work: high caliber teams, solid benefits, lunch provided least twice a week, and it Salt Lake we now have enough for a weekly lunchtime ultimate frisbee game :-)  (I'm sure the other offices are getting close).<p>We make the most cutting edge, fastest, most reliable non-volatile storage in the world.  Email me if you have any questions: bmurdock AT fusionio.com","time":1351785870,"type":"comment"},{"by":"lucisferre","id":4727828,"parent":4727241,"text":"Vancouver | UX/Interaction Designer and Front-end Dev | WealthBar<p>WealthBar is bringing high-end fee-for-service wealth management to investors with no-minimum investment requirements through an entirely online experience. Come help us to transform the outdated financial service industry in Canada and finally bring it into the 21st century.<p>Find out more at <a href=\"http://wealthbar.com\" rel=\"nofollow\">http://wealthbar.com</a><p>Job descriptions are on MatchFWD<p><a href=\"http://matchfwd.com/opportunities/ux-and-interaction-designer-in-vancouver-british-c\" rel=\"nofollow\">http://matchfwd.com/opportunities/ux-and-interaction-designe...</a><p><a href=\"http://matchfwd.com/opportunities/front-end-web-developer-in-vancouver-british-colum\" rel=\"nofollow\">http://matchfwd.com/opportunities/front-end-web-developer-in...</a>","time":1351781845,"type":"comment"},{"by":"WaterDrinker","id":4727584,"parent":4727241,"text":"London: Ruby on Rails developer and competent all-rounder<p>SupaDupa.me - we're an online e-commerce platform aimed at creatives. Building a beautiful and simple, yet powerful platform takes buckets of skill, imagination and effort but it's rewards are huge when you consider the result: that we allow people to focus doing what they love, allowing them to make a living from their passion.<p>We're looking for a strong all-round web developer, with a particular focus on Ruby on Rails and Javascript. Have a play with the site to get a better idea of what's involved. If you feel you have the skills and the spark to help us grow, get in touch! <a href=\"http://supadupa.me/jobs\" rel=\"nofollow\">http://supadupa.me/jobs</a> or email me directly at james[@]supadupa.me.","time":1351779113,"type":"comment"},{"by":"niklas_a","id":4728131,"parent":4727241,"text":"Stockholm, Sweden: Instabridge is hiring brilliant programmers.<p>Instabridge is a small but hugely ambitious company in the Wi-Fi space. We're changing how Wi-Fi works, and we want you to be a part of it.<p><pre><code>  Who we are:\n  * A highly motivated six person team, all in all having started 10+ companies\n  * Based in Stockholm and NYC\n  * Closing a large seed funding round with some of the world's leading investors\n\n  What we're offering:\n  * A great place to work (seriously! We have a lot of fun)\n  * Competitive salary and stock options package\n  * The opportunity to be part of something big\n\n  Who you are:\n  * A brilliant programmer, preferably with Android experience\n</code></pre>\nSend CV and link to your GitHub account to niklas@instabridge.com.","time":1351785217,"type":"comment"},{"by":"cliftonk","id":4730904,"parent":4727241,"text":"Dallas, TX, full-time<p>Ruby Developer<p>About OrgSync<p>We were founded in 2007, have over 300 colleges and universities as\nclients and are growing rapidly to reach our goal of working with the\n4,000+ colleges and universities across the United States and Canada. In\nthe future, we will also be entering other markets that can utilize our\ndynamic and evolving product. We have an exciting and relaxed corporate\nculture that values team members' contributions and dedication. Come be\na part of our growth.<p>Job Summary<p>We're looking for a programming virtuoso to work alongside a small\nteam of developers and designers committed to building a robust,\nperformant and scalable web application that our users love. You have an\nattention to detail and a professional curiosity that extends beyond the\nworkplace. You will work in a mostly autonomous environment, so you have\nto be just as awesome at getting things done as you are at composing\nelegant solutions.<p>Most of our code is written in Ruby and runs on the Rails stack backed\nby a MySQL database, but we also incorporate other technologies such as\nNode.js, Memcached and Redis. We use GitHub for version control and our\ninfrastructure is entirely hosted via cloud services.<p>This is a full-time position at our headquarters in Dallas, TX and\nincludes a competitive base salary, a full range of benefits, stock\noptions, and an awesome team of creative people by your side.<p>Requirements<p>- Passion for developing excellent software and an appreciation for\n  elegant code<p>- Strong understanding of MVC web frameworks and REST concepts<p>- Strong understanding of relational databases including complex queries\n  and optimization<p>- Familiarity with key/value stores and caching techniques<p>- Familiarity with JavaScript and its frameworks a plus<p>- Open source project contributions a plus<p>- Ability to play \"Careless Whisper\" on saxophone a plus<p>- Strong written and verbal communication skills","time":1351822197,"type":"comment"},{"by":"bentlegen","id":4728630,"parent":4727241,"text":"Disqus<p>San Francisco, CA | Full-time | Software Engineering<p>Disqus is the web's largest third-party conversation platform. We're served on hundreds of thousands of web properties, including CNN, Time.com, MLB, Bloomberg, and IGN. If you're interested in tackling challenging problems involving scale, bulletproof client-side scripting, or reaching millions of users, Disqus might be the place for you.<p>We're growing, and looking to fill several positions:<p><pre><code>  * Software Engineer - Infrastructure\n  * Software Engineer - Core JavaScript\n  * Full-stack Web Engineer\n  * Operations Engineer\n  * Automation Engineer\n</code></pre>\nIf you're interested, email me: ben@disqus.com. More information here: <a href=\"http://disqus.com/jobs/\" rel=\"nofollow\">http://disqus.com/jobs/</a>","time":1351790735,"type":"comment"},{"by":"yesimahuman","id":4727806,"parent":4727241,"text":"Madison, WI: INTERN - Drift Hack<p>We are looking for an awesome intern to help us make tools that let more people build stuff for the web.<p>Our two products, Codiqa (<a href=\"http://codiqa.com/\" rel=\"nofollow\">http://codiqa.com/</a>) and Jetstrap (<a href=\"http://jetstrap.com/\" rel=\"nofollow\">http://jetstrap.com/</a>) are focused on making mobile and web development easier, faster, and more accessible. We are young company with a bright future and passion in this space. We are 100% bootstrapped and have licensed our technology to several large companies, along with building a subscription based product suite.<p>If you are passionate about enabling more people to build for the web or mobile, send us an email with something cool you've built to jobs@codiqa.com.","time":1351781635,"type":"comment"},{"by":"beseku","id":4727726,"parent":4727241,"text":"London, UK - Front-end, RoR and iOS developers<p>We're ramping up a new internal tech team to allow us to build our own products and tools (for internal and public use) and need great developers to help us build up and potentially lead a team of likeminded individuals.<p>More info: <a href=\"http://uk.authenticjobs.com/jobs/13719/senior-front-end-developer\" rel=\"nofollow\">http://uk.authenticjobs.com/jobs/13719/senior-front-end-deve...</a>  <a href=\"http://uk.authenticjobs.com/jobs/14841/senior-ror-developer\" rel=\"nofollow\">http://uk.authenticjobs.com/jobs/14841/senior-ror-developer</a> and <a href=\"http://uk.authenticjobs.com/jobs/14840/senior-ios-developer\" rel=\"nofollow\">http://uk.authenticjobs.com/jobs/14840/senior-ios-developer</a>","time":1351780684,"type":"comment"},{"by":"cdunn","id":4728116,"parent":4727241,"text":"RightSignature | The easiest, fastest way to get documents \nfilled out and signed online. | <a href=\"https://rightsignature.com\" rel=\"nofollow\">https://rightsignature.com</a><p>Santa Barbara or San Francisco<p>Rails/JS Engineer<p>Design Junkie<p>We're a small team of hard-working, smart, friendly, and fun entrepreneurs and programmers looking to add an energetic and talented developer and/or designer to our group.<p>RightSignature is a bootstrapped SaaS company with serious users, solid revenue, and rocket-ship growth.  We focus on building the most elegant electronic signature product on the market while also creating a fun, profitable, and sustainable business.  Check us out: <a href=\"https://RightSignature.com\" rel=\"nofollow\">https://RightSignature.com</a><p>Contact joinus@rightsignature.com if interested.","time":1351785050,"type":"comment"},{"by":"will_critchlow","id":4733183,"parent":4727241,"text":"London: Junior / Graduate Python Developer<p>Distilled is looking for a graduate developer to join our growing Python team in our London office. We currently have the following largely Django based projects:<p>* DistilledU - a feature rich online SEO training platform - our latest project that came out of beta in June this year and is being well received by the SEO industry. \n* Distilled Store - an online store we’ve built from scratch to sell conference tickets and videos.\n* Internal Tools - building a range of tools, from quick hacks to fully functional tools, pulling from APIs and various data sets. \n* Distilled website - currently a Wordpress site that we’ve got grand plans for turning into something far more awesome based on a Django CMS and blogging platform called Mezzanine that we will fully integrate with DistilledU and Distilled Store.\n* Distilled Tools - our internal reporting system and tool for managing freelance writers.<p>You’ll gain experience in Agile development practices and work in an open, fun and collaborative environment. Please apply at the URL below.<p><i></i>Requirements<i></i><p>* Python - some experience, not necessarily commercial.\n* Frickin smart - you will need an uncanny ability to get stuff done.\n* Passion for self improvement - technologies move quickly, we’ll expect you to keep up.  \n* Evidence of getting things done - you’ll probably have a number of side projects.<p><i></i>About the company<i></i><p>Distilled is a search marketing company with a big and ever growing reputation. We have worked with some of the biggest brands in the world, and are known in the industry as experts in what we do. We are 100% owned by the two directors, with offices in London, Seattle and New York. Employees number 52 in total, with London being the biggest office. We like to have fun, with things like Beer o’clock every Friday, regular company outings and a meeting room that is largely used for 4 player Mario Kart.<p>For more info and to apply: <a href=\"http://www.distilled.net/graduate-junior-python-developer/\" rel=\"nofollow\">http://www.distilled.net/graduate-junior-python-developer/</a>","time":1351871575,"type":"comment"},{"by":"kms123","id":4728822,"parent":4727241,"text":"Cambridge, MA / Full time Engineers at Crashlytics (<a href=\"http://www.crashlytics.com\" rel=\"nofollow\">http://www.crashlytics.com</a>)<p>Frontend, Backend, iOS and Android. Mobile apps crash over 1 billion times a day - let's do something about it!<p>Crashlytics is mobile crash reporting and analysis as a service. If you're interested in the intersection of great UX, scalable systems, the mobile internet, and big data analytics we want to talk to you!  We're an early stage startup looking for truly talented engineers with a passion for clean code and great products. Our team is fast, smart and independent -- with previous startup success.  We are looking for seasoned developers and we don’t care what type of environment you are working in (Java vs. PHP vs. Ruby).  We believe in the fundamentals -- so you don’t have to be an expert at everything, we just want you to be excited about taking your production experience and jumping into an emerging tech stack.<p>We're small and growing rapidly, so it's important to us to have a great company culture to support that growth. We offer all of the usual startup perks: snacks in the kitchen, flexible work schedule, top-of-the-line gear (Macbook Air, Thunderbolt display, iPad/Android Tablet), etc. Additionally, we feel strongly that it's the culture created by shared values that really makes Crashlytics a great place to work.<p>Here's a brief look at a few of the things we value:<p>* We focus on the modern web - We don't support IE6, so you'll never have to worry about it! \n* We love feedback - you’ll be able to connect directly with customers who are using what you’re building and use their input to make the product better. \n* We’re self-directed - We trust you to manage your own schedule, vacation, etc. without complex policies or forms to fill out. \n* We ship - we're huge fans of TDD, build/measure/learn, and are moving towards continuous deployment. \n* We give back - We encourage open source contributions and community participation.\n* We’re hyper technical - Deep understanding and optimization are in our soul - what can your code accomplish in 18ms?<p>Interested, send your info to jobs@crashlytics.com!","time":1351792972,"type":"comment"},{"deleted":true,"id":4728803,"parent":4727241,"time":1351792705,"type":"comment"},{"by":"ryporter","id":4727652,"parent":4727241,"text":"Palo Alto, CA. Full time. H1B okay.<p>AMA Capital trades billions of dollars per day in the currency markets.<p>We are all engineers, and we design and implement our own trading strategies and infrastructure, down to the networking code that ties us in to financial markets.<p>We are a very small team (I am currently the only employee). We will add one or two engineers to our team in the coming months and are looking for people who will focus on strategy or on infrastructure.<p>No experience or specific knowledge of finance is required. However, you do need to be at least interested in financial markets and to be able to implement your strategies carefully in C++.<p>For more details, go to <a href=\"http://amacapital.net/careers.html\" rel=\"nofollow\">http://amacapital.net/careers.html</a>","time":1351779932,"type":"comment"},{"by":"WLInternet","id":4734105,"kids":[4734117],"parent":4727241,"text":"Austin: Front-End Developers\nWhite Lion is looking for a full-time front-end developer.<p>We would like you to join us in our vision to be the recognized go-to regional interactive agency for handling complex and challenging web and mobile projects.<p>Does the following accurately describe you?<p>* I want to be part of an organization where my input carries weight and where integrity is a core value.\n* I want to be trained extremely well and then trusted to do my job as I prove myself.\n* I have an extreme passion for the creativity and discipline that goes into front-end development.\n* I like to work on a wide range of diverse and challenging projects.\n* I love the adrenaline rush of complex JavaScript requirements.\n* I can work with jQuery in my sleep.\n* I have a comprehensive knowledge of JavaScript, CSS3 and HTML5.\n* I have hands-on experience working with front-end coding frameworks.\n* I know PHP and I am familiar with MySQL.\n* I am so versed in what is next with front-end development I could teach classes on the subject.\n* I am extremely reliable and dependable.\n* I have an old fashion work ethic.\n* My attention to detail is extreme.\n* I love to continually learn and improve.\n* Web and mobile technologies fascinate me.<p>If ALL of the above matches you perfectly, your primary job responsibilities will be to:<p>* Serve as a front-end developer for new projects.\n* Help maintain and improve existing sites.\n* Collaborate with project managers, UX and graphic designers, back-end developers and other front-end developers.\n* Participate in helping the sales team price out new projects.\n* Help fellow developers debug and trouble shoot challenging issues.<p>We are a dynamic, growing company with a casual, fast-paced workplace.<p>Over the 16 years being in business we attract and retain self-starters by having handcrafted a flexible, world-class work environment.<p>If you have carefully read all of the listed content and feel you have the chops, we want to hear from you!<p>Apply at: <a href=\"http://wlion.com/hires-the-best/front-end\" rel=\"nofollow\">http://wlion.com/hires-the-best/front-end</a>","time":1351881575,"type":"comment"},{"by":"oebs","id":4728784,"parent":4727241,"text":"Berlin, Germany: Adspert (Bidmanagement GmbH) <a href=\"http://www.adspert.de/\" rel=\"nofollow\">http://www.adspert.de/</a><p>We are looking for Python developers for both web application as well as non-web application development.<p>If you mainly want to do Javascript with only a little bit of backend development, then we have a position for you as well.<p>We're a small (~5 devs) but pretty competent team, working on interesting problems. We got a complex system of about 7 or 8 applications (of which 2 are web apps), which share their data through postgres (totaling ~2TB data at the moment, growing every day by a few GB).<p>If you're looking for a nice place to work, without overtime or weekend work, nice colleagues and fun environment, write to jobs@adspert.de.","time":1351792494,"type":"comment"},{"by":"mhale","id":4729818,"parent":4727241,"text":"Austin, Texas -- remote considered<p>Are you interested in helping families be healthier and happier?<p>You're in luck! SwimTopia is looking for Rails and front-end web developers.<p>SwimTopia provides web-based tools to help manage youth-sports teams and leagues. We provide content management, online registration, email, volunteer coordination, and more.<p>Our product is live with a rapidly growing base of happy, paying customers.<p>We are graduates of the Capital Factory 2011 accelerator program, and won the Demo Day pitch competition. Here's our pitch: <a href=\"http://www.youtube.com/watch?v=c0cNviPzjGQ\" rel=\"nofollow\">http://www.youtube.com/watch?v=c0cNviPzjGQ</a><p>More info: <a href=\"http://jobs.swimtopia.com\" rel=\"nofollow\">http://jobs.swimtopia.com</a> or email mason@swimtopia.com","time":1351805365,"type":"comment"},{"by":"WLInternet","id":4734100,"parent":4727241,"text":"Austin: PHP/MySQL Back-End Developer\nWhite Lion is looking for a full-time PHP/MySQL back-end developer.<p>We would like you to join us in our vision to be the recognized go-to regional interactive agency for handling complex and challenging web and mobile projects.<p>Does the following accurately describe you?<p>• I want to be part of an organization where my input carries weight.\n• I want to be trained extremely well and then trusted to do my job as I prove myself.\n• I have an extreme passion for the creativity and discipline that goes into back-end coding.\n• I like to work on a wide range of diverse and challenging projects.\n• I love the adrenaline rush of a complex database design.\n• I can work with Apache and Linux in my sleep.\n• I have a comprehensive knowledge of JavaScript, CSS3 and HTML5.\n• I am an expert in working with coding frameworks.\n• I know PHP and MySQL inside and out and outside in.\n• I have at least 4 years of technical back-end development experience.\n• I am so versed in programming I could teach classes on the subject.\n• I am extremely reliable and dependable.\n• I have an old fashion work ethic.\n• My attention to detail is extreme.\n• I love to continually learn and improve.\n• Web and mobile technologies fascinate me.<p>If ALL of the above matches you perfectly, your primary job responsibilities will be to:<p>• Serve as the back-end developer for projects.\n• Create data models.\n• Help maintain and improve existing sites.\n• Work in collaboratively in team with project managers, UX and graphic designers and front-end developers.\n• Participate in helping the sales team price out new projects.\n• Help fellow developers debug and trouble shoot challenging issues.<p>We are a dynamic, growing company with a casual, fast-paced workplace.<p>Over the 16 years being in business we attract and retain self-starters by having handcrafted a flexible, world-class work environment.<p>If you have carefully read all of the listed content and feel you have the chops, we want to hear from you!<p>Apply at: <a href=\"http://wlion.com/hires-the-best/code\" rel=\"nofollow\">http://wlion.com/hires-the-best/code</a>","time":1351881530,"type":"comment"},{"by":"rootedbox","id":4727468,"parent":4727241,"text":"CHICAGO - COYOTE - We went from 0 to a billion in revenue in 6 years.. So we're pretty much hiring in every type of position you can think of to keep up with growth. Come join us.<p><a href=\"http://www.coyote.com/careers/\" rel=\"nofollow\">http://www.coyote.com/careers/</a>","time":1351777943,"type":"comment"},{"by":"jshiau","id":4728677,"parent":4727241,"text":"San Francisco, CA; Full time; H1B ok.<p>Threadflip is building a new social shopping experience at the intersection of fashion, technology, and commerce.<p>We are looking for seasoned engineers to join our engineering team of three. Our stack is Rails 3, with Redis and Postgres as our stores. We use HAML/Sass/Coffeescript &#38; jQuery for creating beautiful cross-browser experiences. Our site runs on EC2 with all of the benefits and challenges that brings. Our ideal candidate is that rare combination of user champion and engineering generalist, with strong product vision and deep technical chops.<p><a href=\"http://www.threadflip.com/jobs?ref=hn\" rel=\"nofollow\">http://www.threadflip.com/jobs?ref=hn</a><p>Interested? Email us at jobs@threadflip.com","time":1351791209,"type":"comment"},{"by":"schelle","id":4728508,"parent":4727241,"text":"Indiegogo<p>San Francisco, CA | Full Time | Analytics Engineer / Data Scientist<p>There are some exciting and interesting data problems to solve in the crowdfunding world and we're tackling a bunch of them.  At Indiegogo, we consider \"helping people achieve their dreams\" our primary objective, which isn't a bad thing to be doing every day.<p>We currently have a lean \"Insights Team\" of 3 people focused on data analytics, BI, scaling our data infrastructure, and advancements in machine learning.  We'd like to stay small, but are looking to add a couple impactful people to the mix.<p>If you're interested, I'd love to chat more.  For more info: <a href=\"http://www.indiegogo.com/about/careers\" rel=\"nofollow\">http://www.indiegogo.com/about/careers</a><p>Cheers,<p>Eric Schell<p>Founder, Director of Insights","time":1351789388,"type":"comment"},{"by":"jim-greer","id":4728632,"kids":[4749827,4731106],"parent":4727241,"text":"San Francisco, CA Full time.<p>I'm looking for a Director of International Operations for Kongregate, reporting to the COO (I'm CEO). This would be a smart generalist who could handle lots of different responsibilities - I'm open to various combinations of product management, engineering, and other backgrounds. We're expanding our international efforts and need more leadership.<p>Kongregate is a wholly-owned subsidiary of GameStop, but we operate very independently. We have over 15mm monthly unique  visitors who spend nearly 2 billion minutes playing games on our site per month. 75% of our revenue is from virtual goods. We have 36 employees.<p>(we're also looking for good web and mobile engineers, as is everyone else...)","time":1351790746,"type":"comment"},{"by":"timanglade","id":4729728,"parent":4727241,"text":"Apigee (Palo Alto, REMOTE, H1B) — Developer Advocates, Java Developers, Mobile Developers.<p>Apigee is the API company. We are helping thousands of developers build API-driven applications every day. Our technology powers the APIs of Walgreens, eBay, GameSpy, Tout, Citrix, AT&#38;T, Pearson, ConstantContact, and hundreds of others. We are actively hiring for App Services (our Mobile Backend-as-a-Service technology). Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is currently in open Beta. We are built on top of Jersey, Jackson and Cassandra (we gutted a lot of the latter and built our own indexing system, query system, storage format and multi-tenancy strategy on top of it).<p>Our newest open position is Developer Advocate. Our developer advocates partner up with indie developers &#38; startups to ensure they have a successful launch on our platform; meet people from all walks of life from around the world and help them build apps and APIs; bring feedback from the trenches to the product. This is not solutions architecture or community bootstrapping. This is about helping our existing, vibrant community of indie developers into being even more successful than they already are without our help :) (More details here: <a href=\"http://apigee.com/about/jobs/developer-advocate\" rel=\"nofollow\">http://apigee.com/about/jobs/developer-advocate</a>)<p>We are also looking for Java Developers to join our Core team and help us overcome the next-generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>Finally, we are looking for Mobile developers with solid experience in at least one of iOS, Android &#38; JavaScript+HTML5 to work on our SDKs.<p>We offer catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>Want to apply? Have some questions? Want to join but don’t match either position? Then get in touch! ➝ tim@apigee.com","time":1351804333,"type":"comment"},{"by":"stephenhuey","id":4727931,"parent":4727241,"text":"HealthPost in Houston, Texas | Fullstack and Front-End Developers<p>HealthPost launched its first product with a hospital system over a year ago and we're now deploying to hospitals around the country.  We're a leading provider of cloud-based healthcare search and booking solutions for hospitals, emergency rooms, medical practices and other outpatient services.<p>Our team generally uses Ruby on Rails, but we want to always be ready to use the right tool for the job.  We're a small lean crew, our customers love us and we're scaling very rapidly, so we want you to come help us dream up new products for the healthcare industry!<p>No recruiters, please!  Everyone else, feel free to write me at stephen.huey@healthpost.com","time":1351782959,"type":"comment"},{"by":"mikebo","id":4728969,"parent":4727241,"text":"Seattle, WA<p>Familiar<p>Familiar turns your many devices into social picture frames. More at <a href=\"http://familiar.com/\" rel=\"nofollow\">http://familiar.com/</a> We're hiring software engineers who like building user facing products. We use a wide variety of technologies from CoffeeScript to Objective-C, so lots of opportunity to learn something new. If you're interested in hearing more about what we're up to, my e-mail is mike [at] familiar-inc.com<p><a href=\"http://familiar.com/blog/2012/09/familiar-announces-20mm-monthly-photos-displayed-and-13mm-financing.html\" rel=\"nofollow\">http://familiar.com/blog/2012/09/familiar-announces-20mm-mon...</a> gives some background on our recent growth, product, and investors.","time":1351794775,"type":"comment"},{"by":"saharjafari","id":4731607,"parent":4727241,"text":"#LOOKING FOR JOB<p>Hi!<p>I am looking for an internship job. I am no Computer Science student but I learned my lessons online. I focused on learning Front End web development. Check my website at saharjafari.com and see if you want someone like me in your team.<p>I learned JavaScript, HTML and CSS. I could help your startup do CSS and small JavaScript tasks without allocating your expert people on it. I will increase your startup headcount too!<p>I offer to work for FREE in San Francisco Bay Area. I am US citizen and have no problem working in the US. The reason I am willing to work for free is that I want to start my career from somewhere.<p>Please contact me through my website at: www.saharjafari.com<p>Please help women in tech by your upvotes at least!","time":1351839815,"type":"comment"},{"by":"stefanocutello","id":4727917,"parent":4727241,"text":"Amsterdam, The Netherlands.<p>In PastBook.com we have two open positions:<p>* On-Line Marketing and Acquisition Manager (HIRING)<p>* English Copywriter (INTERN)<p>More info here: <a href=\"http://www.pastbook.com/txt/job-offers/\" rel=\"nofollow\">http://www.pastbook.com/txt/job-offers/</a><p>We are also looking for a CTO.<p>LAMP Environment, Redis, Distributed architecture and more. \nContact on twitter @weblance for more info and full list of benefits.<p><a href=\"http://www.pastbook.com\" rel=\"nofollow\">http://www.pastbook.com</a><p>Featured on TC (<a href=\"http://goo.gl/cmFCL\" rel=\"nofollow\">http://goo.gl/cmFCL</a>), WSJ (<a href=\"http://goo.gl/VxFeF\" rel=\"nofollow\">http://goo.gl/VxFeF</a>), TNW (<a href=\"http://goo.gl/RaKPu\" rel=\"nofollow\">http://goo.gl/RaKPu</a>)","time":1351782865,"type":"comment"},{"by":"onsports","id":4728444,"parent":4727241,"text":"San Francisco, CA. Full-time. H1B is fine.<p>OnSports is revolutionizing the sports world. We're a fast-growing, well backed startup and are focused on building social, design forward, mobile apps for the ever expansive sports market. The opportunity ahead of us is huge and we're looking for the right team members to join us.<p>We love what we do and we love what we are building. A challenging problem is what excites us.<p>We are looking for: * Lead Python/Django Developer * Lead Android Developer * Lead iOS Developer * Product Designer *<p>Join us. Email jobs@onsports.com<p>Read more about us and our team at <a href=\"http://www.onsports.com/company/\" rel=\"nofollow\">http://www.onsports.com/company/</a>","time":1351788624,"type":"comment"},{"by":"latch","id":4727454,"parent":4727241,"text":"Singapore and San Francisco (Work Permit / H1B possible)<p>Viki.com is looking to hire engineers and dev ops across all of our teams (platform, web, mobile, flash, analytics). We use a variety of technologies but our core is Rails, PostgreSQL, Node, Redis, JavaScript and ActionScript (plus Java/ObjectiveC on the mobile side of things) - though we're much more interested in hiring well-rounded and passionate developers.<p>We're dealing with some really cool challenges in terms of scale and our global reach. Also, Singapore is an amazing place to be. English-only speakers won't have any problems.<p>Feel free to email me at karl@viki.com for more information.","time":1351777817,"type":"comment"},{"by":"pmjoyce","id":4727564,"kids":[4728674,4730700],"parent":4727241,"text":"London, UK. Full time. Geckoboard<p>Recently named one of London’s hottest startups and backed by some of the most respected investors in the business, Geckoboard creates software that makes it easy for businesses to see all of their key metrics on elegant real-time dashboards.<p>Our approach has won praise and accolades for setting the standards in the field of data communication design and we're growing fast.<p>If you're a Ruby on Rails engineer wanting to join a small, dynamic team building software that customers love then we want to hear from you.<p>You’ll be:<p>===========<p>- Shipping code, solving interesting problems and making a difference<p>- Working with an innovative web application and platform helping thousands of businesses around the world<p>- Working in a small fast moving team to shape the future development of the application with input on key technical decisions<p>- Working in one of London's hottest startups (<a href=\"http://www.guardian.co.uk/uk/2012/jul/08/east-london-20-hott...\" rel=\"nofollow\">http://www.guardian.co.uk/uk/2012/jul/08/east-london-20-hott...</a>)<p>Requirements:<p>=============<p>- An ambitious and tenacious individual with a passion for hacking<p>- Eager to join a fast growing, well funded startup on an upward trajectory<p>- 1+ years’ experience with Rails (or similar advanced web framework).<p>- 2+ years’ experience with a dynamically-typed, object-oriented language (preferably Ruby or Python).<p>- Knowledge of PostgreSQL or MySQL<p>- Experience with at least one NoSQL datastore<p>- Test driven development experience<p>- Familiarity with DVCS (we use git).<p>- Able to work in London full-time<p>Nice to have:<p>==============<p>- Open source contributions<p>- Backbone.js experience<p>- Event driven programming experience<p>- Keen on the startup world<p>Salary<p>======<p>Generous salary - dependent on experience &#38; ability. Stock options form part of the package.<p>Application Process<p>====================<p>To find out more send us your C.V./Github or Stack Overflow portfolio and a short description on why you’re perfect for the role to jobs@geckoboard.com","time":1351778935,"type":"comment"},{"by":"rada","id":4785827,"parent":4727241,"text":"Minneapolis: Web/Mobile Engineer/Developer.<p>Looking for one good developer to join our team. Great environment (think start-up within a large stable company), truly great small team and outstanding life-work balance/schedule (no overtime, summer hours, etc).<p>Our stack is: PHP, MySQL, C#, Javascript (plain/JQuery/JQuery Mobile), HTML5, iOS, Android, Selenium. Any combination of those skills is fine.<p>Full time onsite Minneapolis (Eden Prairie) only, no sponsorship.<p>Email me at <a href=\"http://i.imgur.com/jg46D.png\" rel=\"nofollow\">http://i.imgur.com/jg46D.png</a>. I am happy to answer any fellow developers' questions but please, no recruiters. Thanks!","time":1352930324,"type":"comment"},{"by":"jimc","id":4728931,"parent":4727241,"text":"Practice Fusion -- San Francisco (FT, INTERN, REMOTE, H1B)<p>We are looking for talented Engineers who are passionate about creating life-saving technology for doctors and patients. You relish writing code and building applications and services that are used by 200,000+ users serving 50+ million patients.<p>Stop playing games, start saving lives.<p>Technologies: Sencha, JavaScript, C# / .NET, Java, AWS, SQL Server, Data Warehousing, Groovy, Selenium, Gradle<p>Positions: Software Engineers, Test Engineers, Architects, Data Warehouse Engineers, Program Managers, Interns<p>Join us: <a href=\"http://www.practicefusion.com/careers/\" rel=\"nofollow\">http://www.practicefusion.com/careers/</a>","time":1351794460,"type":"comment"},{"by":"rpikus","id":4728768,"parent":4727241,"text":"Ponte Vedra Beach, FL - Full Time<p>ATP World Tour, the governing body of the men's professional tennis tour is hiring for a Digital Media Systems Administrator.<p>Responsible for maintaining the day-to-day operation and security of Digital Media and related areas of the company. Installs and configures servers, networks, virtualization systems and related technology. Handles monitoring, diagnosis and problem resolution for all systems and users.<p>For more details and to apply online visit: <a href=\"http://protennisjobs.teamworkonline.com/teamwork/r.cfm?i=49245\" rel=\"nofollow\">http://protennisjobs.teamworkonline.com/teamwork/r.cfm?i=492...</a>","time":1351792312,"type":"comment"},{"by":"tow21","id":4727760,"parent":4727241,"text":"London: Farringdon. On-site only.<p>Timetric is looking for python/django/javascript/devops engineers to help us build the best data visualization platform available anywhere.<p>We're a small, motivated team. We've spent a lot of effort getting rid of process, and I've never been in a team which can deploy faster or more frequently.<p>And we're backed by a solid sales team who know how to get users for our products (and pay the bills!)<p>We want smart, interesting people with a passion for making usable systems.<p>There are job descriptions at <a href=\"http://timetric.com/about/jobs/\" rel=\"nofollow\">http://timetric.com/about/jobs/</a> - or just email us at jobs@timetric.com","time":1351781070,"type":"comment"},{"by":"joshyeager","id":4727850,"parent":4727241,"text":"Swift Software - Frederick, MD (Near DC) - Software Engineers for Product Development and Professional Services\nAre you tired of commuting to DC or Northern Virginia? Swift Software is a growing product-centered technology company seeking talented developers to join our development and proserv teams in Frederick, MD. Our flagship product is JobTraQ, a task management and workflow system that offers vastly more flexibility and power than any other product in our market segment, and is significantly less expensive and easier to configure than big \"BPM\" suites like MetaStorm and Lombardi. These advantages are allowing us to disrupt both markets.<p>Product developers will create new features in JobTraQ and enhance existing functionality. You’ll help us build advanced visual design and administration tools, augment the product’s business intelligence capabilities, improve performance and scalability, and use customer feedback to enhance all parts of the system.<p>Proserv developers will work with our mid-market and enterprise customers and our business analysts to design and implement software solutions that build on JobTraQ's capabilities. Our implementation and customization projects are usually one week to two months long, so you’ll enjoy a wide range of work on interesting problems for clients in many regions and industries. Recent projects have included a touchscreen system for warehouse tracking, integration with accounting systems, complex custom finance and billing reports, and automatic data synchronization.<p>Both teams have an enjoyable and collaborative culture in a creative environment. We interact positively and openly and emphasize learning and professional development. These attributes have enabled us to produce an industry-leading product with a globally recognizable and satisfied client base. Our environment is relaxed and fun, we play everything from Total Annihilation to Alien Swarm at our game nights, and we equip everyone with new quad-core Thinkpads with SSDs and dual monitors. Our policies and benefits are family-friendly, with generous vacation time, good health insurance options, and flexible work schedules.<p>For more information about these positions, see the links below. If you are interested in either one, email your resume to resumes@swiftsoftware.com.<p><a href=\"http://www.jobtraq.com/jobs/se227-software-engineer-product-development.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se227-software-engineer-product-...</a><p><a href=\"http://www.jobtraq.com/jobs/se152-software-engineer-professional-services.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se152-software-engineer-professi...</a>","time":1351782085,"type":"comment"},{"by":"mmurph211","id":4727896,"parent":4727241,"text":"Wakefield, MA - Vestmark<p>We're a leading technology platform provider delivering wealth management and investment advisory solutions since 2001. We're looking for engineers to focus on front-end development among other software engineering positions. Head to <a href=\"http://www.vestmark.com\" rel=\"nofollow\">http://www.vestmark.com</a> and <a href=\"http://www.vestmark.com/Jobs/SoftwareEngineering.html\" rel=\"nofollow\">http://www.vestmark.com/Jobs/SoftwareEngineering.html</a> for more info.<p>Pre-IPO company with strong momentum offering competitive wages, excellent benefits and equity.<p>Email hr at vestmark dot com if interested.","time":1351782590,"type":"comment"},{"by":"kevinpfab","id":4728310,"parent":4727241,"text":"Emergent One - Remote (US) - Full Time<p>Emergent One automatically generates REST APIs for existing applications and databases. We're a new startup devoted to making APIs better and more prevalent. Although we're a small team, we are growing fast and moving even faster.<p>We are looking for a Software Engineer that is passionate about developer communities, REST, and of course, building and consuming APIs. The role will be a combination of development on our developer portal solution and our core tech behind generating APIs. You’ll be helping build the API that generates APIs. In fact, that API generated our own private API (so meta!). You'll have a huge impact on the company and customers as a very early member of the organization, and be introduced to a large range of cutting edge API providers.<p><a href=\"http://www.emergentone.com/jobs/\" rel=\"nofollow\">http://www.emergentone.com/jobs/</a><p>===Responsibilities<p>* Lead development on a robust developer portal solution for APIs we provide<p>* Contribute to the core solution that generates APIs<p>* Gain a deep understanding of the Emergent One platform<p>* Help troubleshoot problems in our customer's API design<p>* Work closely with customers to design solid RESTful APIs<p>* Build up a resistance to mildly brain melting meta-ness<p>===Qualifications<p>* 3+ years experience as a Software Engineer / Developer<p>* Experience developing applications built on APIs<p>* Deep awareness of RESTful API design and HTTP standards<p>* Strong knowledge of object-oriented design and design patterns<p>* Experience on a remote team a plus<p>===About Emergent One<p>* Ruby on Rack core, js / backbone frontend<p>* Funded Seed Round, TechStars Cloud Alumni<p>* Remote organization - work wherever you want!<p>* Choose your own hours - we're results driven first!<p>* Regular (friendly) debates and gaming sessions<p>* Founded by 2 ex-Rackspace developers<p>Email us at jobs@emergentone.com","time":1351787154,"type":"comment"},{"by":"jetsnoc","id":4727669,"parent":4727241,"text":"Twin Falls, ID or Remote [about 90 minutes from Boise, Idaho] (full-time, contract and internships available)<p>KickBack Rewards Systems manages a national coalition loyalty program and white-label loyalty programs for convenience stores and grocers.  We bootstrapped, self capitalized, and are a profitable and well managed stable company.  We have several fortune 500's on-board and we've maintained a start-up attitude.<p>Hiring:<p><pre><code>  - Data scientists (\"Big Data\", Hadoop mostly)\n  - DevOps (Chef, Debian 6)\n  - Development (C, PHP, Python, Ruby)\n</code></pre>\nContact me directly:<p><pre><code>  brian@kickbackpoints.com</code></pre>","time":1351780137,"type":"comment"},{"by":"jonstjohn","id":4727528,"parent":4727241,"text":"Salt Lake City and San Diego: PHP/Python(/Ruby) software developers.  Work with a fantastic team of motivated developers, great benefits, fun environment.<p>Check out the position: <a href=\"http://www.drivecurrent.com/careers.html\" rel=\"nofollow\">http://www.drivecurrent.com/careers.html</a><p>We have a couple long-term applications that are developer in PHP w/ Zend Framework, a smaller application in Ruby, and are planning new development in Python/Django.<p>Come join us as we grow a new office in Salt Lake City and expand our existing one in San Diego.<p>Solid paid vacation/holidays, work-at-home days, semi-flexible hours, on-site.","time":1351778554,"type":"comment"},{"by":"johndavi","id":4727405,"parent":4727241,"text":"Palo Alto: Machine Learning Engineers, Java Engineers, (Big) Data Engineers (I feel like without \"big\" regular data nowadays just looks lonely)<p>Diffbot (www.diffbot.com) is brute-force building the semantic web via computer vision, machine learning, NLP, and other buzzwords that aren't actually buzzwords for us. Moreover we're doing it by offering real API services to real developers, and earning real money.<p>Well funded, making excellent revenue, working on challenging novel stuff. Check out our jobs at www.diffbot.com/company (and play with our APIs first to know what we're all about!).","time":1351777374,"type":"comment"},{"by":"mbesto","id":4727683,"parent":4727241,"text":"London, UK, Full Time.<p>Harris and Hoole is a Tesco backed coffee start-up looking for a \"Technology Guru\" to help with internal IT needs. In other words, you get to work with the Operations Director to help decide and implement both traditional IT and \"new\" SaaS solutions. Ideal candidate is someone with a tech background (2+ years) looking to go into more of a business/strategy type role.<p>Website: <a href=\"http://www.harrisandhoole.co.uk/\" rel=\"nofollow\">http://www.harrisandhoole.co.uk/</a><p>Contact: If interested and want to get more details, please send communication to myself: mbesto AT gmail.com.","time":1351780279,"type":"comment"},{"by":"rpikus","id":4728779,"parent":4727241,"text":"Ponte Vedra Beach, FL - Full Time<p>ATP World Tour, the governing body of the men's professional tennis tour is hiring Digital Media Web Developers.<p>Responsible for maintaining and developing new functionality for the ATP's Digital Platform. Works with appropriate stakeholders through all steps of software development lifecycle to determine requirements, implement and launch new digital initiatives.<p>For more details and to apply online, click here: <a href=\"http://protennisjobs.teamworkonline.com/teamwork/r.cfm?i=49243\" rel=\"nofollow\">http://protennisjobs.teamworkonline.com/teamwork/r.cfm?i=492...</a>","time":1351792413,"type":"comment"},{"by":"jrheard","id":4728074,"parent":4727241,"text":"Yelp<p>INTERN OR FULLTIME in SAN FRANCISCO, CA<p>I'm a full-stack web developer at Yelp, and I definitely recommend the hell out of working here. We've still got the startup environment (kegs, dog, etc); we're located in downtown San Francisco, half a block from MoMa; we are in a unique position to do great stuff and solve hard problems while helping people find great local businesses.<p>I built our \"Hot New Businesses\" feature - <a href=\"http://yelp.com/openings/sf\" rel=\"nofollow\">http://yelp.com/openings/sf</a> , for instance, you can find it on the homepage and in our mobile apps too - which crunches through our data nightly and generates a list of the most recently opened bars and restaurants in your city, complete with predictions of the day they opened on. It's a really useful feature, and we have so much data that I was able to build it without knowing anything about machine learning, data-mining, etc; imagine the crazy-useful stuff you could do here, if a knucklehead like me could make a feature like this.<p>For more info about what it's like to work here as an engineer, see a Q&#38;A with me at <a href=\"http://officialblog.yelp.com/2011/07/day-in-the-life-of-a-ye...\" rel=\"nofollow\">http://officialblog.yelp.com/2011/07/day-in-the-life-of-a-ye...</a>. , or feel free to contact me at jrheard at yelp dot com.<p>Here's a list of our open engineering positions:<p>Web Developer<p>☆ Develop cool and useful features for our 61M+ monthly visitors<p>☆ Expertise in JavaScript, HTTP, HTML/DOM, and CSS, as well as server-side chops in a language like Python, \nRuby, Java, C++, etc. We're on Python, but we're just looking for people who are really good at programming, so no worries if you don't have much Python experience.<p>Search and Data-Mining Engineer<p>☆ Tackle machine learning and information retrieval problems from our database of 22M+ Yelp reviews<p>☆ Strong grasp of algorithms and data structures; expertise in Python, Java, or C++ Back-end Engineer<p>☆ Build whole systems that are simple and scalable<p>☆ Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++ Mobile Developer<p>☆ Create fun and useful mobile applications for the iPhone, Android, Blackberry platforms and beyond<p>☆ Expertise in C++, Java and other mobile languages<p>To apply, head to <a href=\"http://hire.jobvite.com/j/?aj=oyXeVfwo&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?aj=oyXeVfwo&#38;s=Hacker_News</a>","time":1351784529,"type":"comment"},{"by":"bankim","id":4728117,"parent":4727241,"text":"Nimble Storage | San Jose, CA | Full Time | H1B welcome<p>Nimble Storage is one of the fastest growing storage systems company. <a href=\"http://nimblestorage.com/company/awards.php\" rel=\"nofollow\">http://nimblestorage.com/company/awards.php</a><p>Looking for system software development and test engineers with expertise in C/C++/Java/Perl. Please check careers page for specific positions: <a href=\"http://www.nimblestorage.com/company/careers.php\" rel=\"nofollow\">http://www.nimblestorage.com/company/careers.php</a><p>If interested email resume along with job position to bankim [at] nimblestorage [dot] com","time":1351785059,"type":"comment"},{"by":"vuzum","id":4749588,"parent":4727241,"text":"Iasi, Romania. Full time<p>Vuzum (<a href=\"http://vuzum.com\" rel=\"nofollow\">http://vuzum.com</a>) is looking to bring in 4 additional web developers to our team. We're building an amazing start-up called Blogvio. The plan is to change the way users add content to their websites, focusing on both web and mobile.<p>You:\nMust be a Senior PHP Developer (CakePHP, Symphony frameworks), AJAX (HTML, CSS, JS), jQuery and HTML5. Especially canvas, audio, video tags.<p>Us:\nA stelar team focusing on solving challenging problems in an interactive way, either for our internal projects, or for our clients.","time":1352225253,"type":"comment"},{"by":"lamplightr","id":4730695,"parent":4727241,"text":"Uken Games in downtown Toronto<p>Uken is looking for talented developers to help us build amazing mobile games.<p>We are a profitable startup (~45 employees) experiencing massive growth.  Some of our challenges include:\n- pushing whats possible in a browser (check out Mighty Monsters on iOS... yes its html5!)\n- scaling our infrastructure to support millions of players across dozens of cross-platform games\n- analyzing billions of user actions to create actionable items that will improve the player experience<p>More info at <a href=\"http://uken.com/jobs\" rel=\"nofollow\">http://uken.com/jobs</a>","time":1351817885,"type":"comment"},{"by":"twalling","id":4728169,"parent":4727241,"text":"Connected Sports Ventures Cambridge, MA FULLTIME - Backend Engineer (Node.js, Redis, MongoDB)<p>We're looking for another backend engineer to join our team as we continue to expand upon our realtime, single game fantasy, football and baseball games (<a href=\"http://rumbletv.com\" rel=\"nofollow\">http://rumbletv.com</a>).<p>You can read more about our current positions and what we're building over at <a href=\"http://jobs.connectedsports.com\" rel=\"nofollow\">http://jobs.connectedsports.com</a>. Any questions or applications can be directed to me at jobs@connectedsports.com","time":1351785662,"type":"comment"},{"by":"thaenn","id":4729641,"parent":4727241,"text":"Boston: Engineers (PHP / Java), Product people, SEM Analyst<p>Ever build an ecommerce travel site from scratch? We have. Twice. Everything we build is designed to help people book a memorable trip at a price that works for their budget.<p>We look at challenging concepts and think, \"Yeah, we can do that.\" And then we go out and do it. We rely on smart, creative individuals willing to take risks. Moving fast is in our DNA.<p>If you're interested in working with people that check their egos at the door and focus on results day in and day out, then drop me a line.<p>thaenn AT smartertravelmedia.com","time":1351803187,"type":"comment"},{"by":"hndl","id":4727575,"parent":4727241,"text":"MineralTree, Cambridge MA<p>A bit about us:<p>\"MineralTree, a provider of a cloud-based secure, integrated payables and cash management solution for small and medium size businesses seeks Developers with solid experience in Java/J2EE software development to work with our talented technical team to design, develop, and enhance our revolutionary product suite.\"<p>We have a proven entrepreneur (this will be his third startup). Plenty of work to be done. We're small, we're fast and we're fun.<p>Email me at: anuj dot bhatt at geeeemail (you know what this is) dot com and we can take it from there.","time":1351779048,"type":"comment"},{"by":"sjezewski","id":4730866,"parent":4727241,"text":"Moovweb (moovweb.com)<p>San Francisco, CA | Full Time | Rails Engineer<p>TL;DR: Moovweb transforms existing websites into mobile websites. \nBe a part of Hampton Catlin's (sass/haml) newest technology.\nWe are working on getting our technology into the hands of everyone.<p>Skills:<p>- 3+ years rails experience / 1+ year and extra tenacious\n- front end (UX/UI) specialist or rails generalist\n- Bonus points for experience with:\n  - background processing libraries (sidekiq)\n  - analytics (mixpanel)\n  - business integration libraries (marketto / etc)\n  - steering the product / app as a whole<p>Email jobs@moovweb.com","time":1351821495,"type":"comment"},{"by":"xsmasher","id":4728841,"parent":4727241,"text":"Mobile Game Developers (C++) at TinyCo in San Francisco <a href=\"http://jobvite.com/m?3Rq9sfwC\" rel=\"nofollow\">http://jobvite.com/m?3Rq9sfwC</a><p>We make freemium games for iOS and Android in C++. Always looking for new client-side developers. Growing company with strong revenue from out stable of launched games.<p>I'm happy to talk about the company; feel free to contact me.<p>Other positions (back end engineers, DBA, game designer, content manager, UI, UA, QA) hiring too: <a href=\"http://jobvite.com/m?33q9sfwO\" rel=\"nofollow\">http://jobvite.com/m?33q9sfwO</a>","time":1351793269,"type":"comment"},{"by":"Stevegottlieb","id":4727787,"parent":4727241,"text":"Union Sq area NYC- Shindig,  revolutionary large scale video chat event platform coming out of Beta with application to online media, distance learning, online dating,gaming and many other verticals is looking for a SENIOR FLEX ENGINEER to join a small but expanding team. We are also expanding our BUSINESS DEVELOPMENT TEAM and are looking for digital media execs with experience in both new media and traditional media. Check out Shindigevents.com and send inquiries to jobs@shindigevents.com","time":1351781433,"type":"comment"},{"by":"zds","id":4727487,"parent":4727241,"text":"NYC: Codecademy is looking for product designers, communication designers, and backend/frontend engineers.<p>We're the easiest way for anyone to learn to code.  In a year, millions of people have used Codecademy to learn the basics of programming and beyond.  We're a small team of 12 but we've seen awesome traction and raised money from smart investors (Union Square Ventures, Kleiner Perkins, etc.).  Come help us change the way the world learns!  Email yoonie@codecademy.com or codecademy.com/jobs.","time":1351778152,"type":"comment"},{"by":"senderista","id":4730633,"parent":4727241,"text":"Seattle: Senior Software Developer<p>Meteor Solutions is a growing, cash-flow-positive web analytics startup based in downtown Seattle. We’re looking for a senior-level dev with experience in high-throughput, highly-available messaging and analytics systems. Bonus points for experience in Hadoop or real-time stream processing systems. AWS experience also a plus.<p>Complete job description here: <a href=\"http://www.meteorsolutions.com/about/jobs/\" rel=\"nofollow\">http://www.meteorsolutions.com/about/jobs/</a>","time":1351816487,"type":"comment"},{"by":"0xa","id":4728531,"parent":4727241,"text":"Tumblr, New York, NY (NYC, Manhattan): Software and Database Engineers<p>Tumblr is actively hiring experienced engineers at every layer of our technology stack.  We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility.  We work in an open, friendly and positive environment that encourages intellectual curiosity, a love for open source, and empowering millions of users to create and explore content.  I'll highlight a few positions here, but you can see the full listings and our benefits at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>* Database Engineer (<a href=\"http://bitly.com/U0VK2P\" rel=\"nofollow\">http://bitly.com/U0VK2P</a>): You'll scale and organize our data persistence layer to a level few sites can match.  We'll love your MySQL expertise and eye for efficiency.<p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): Writing generic, reusable services in Scala or Go, you'll design, code and grow a blazingly fast platform for our PHP application.<p>* Search Engineer (<a href=\"http://bitly.com/TcOdt8\" rel=\"nofollow\">http://bitly.com/TcOdt8</a>): Real-time search and analysis is your forte.  Using your large-scale experience with Elastic Search, you'll tune our search algorithms and expand the software infrastructure.<p>* Product Engineer (<a href=\"http://bit.ly/ToF7Ya\" rel=\"nofollow\">http://bit.ly/ToF7Ya</a>): You're a versed engineer and perfectionist with good taste, ready to take ownership of entire features of our PHP application.<p>About Tumblr:<p>Founded by David Karp in New York City in 2007, Tumblr is a microblogging platform that allows users to effortlessly share anything. Tumblr now hosts over 70 million blogs with over 30 billion posts to date. Our pageview to engineer ratio is 0.5 billion PV per month to 1 engineer. This means every line of code every developer writes has a huge impact. We are focused on building tools and technologies that will advance the state of the art in dealing with massively scaled websites as we quickly grow past 50,000 requests and 1,400 posts per second. We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1351789711,"type":"comment"},{"by":"jhuckabee","id":4727845,"parent":4727241,"text":"REMOTE, -0400 UTC to -0800 UTC<p>Cyanna Education Services [1] is building a web-based business workflow platform to service the education industry. We are looking for a Rails developer to assist in bringing this product to the next level. If you are a self-starter and knowledgeable code wrangler, please email us a little bit about yourself, including resume and github username, to jobs@cyanna.com (no recruiters please).<p>[1] <a href=\"http://www.cyanna.com/\" rel=\"nofollow\">http://www.cyanna.com/</a>","time":1351782046,"type":"comment"},{"by":"JunkDNA","id":4762838,"parent":4727241,"text":"Philadelphia, PA<p>The Children's Hospital of Philadelphia\nWe're not technically a start-up, but our small group inside CHOP is striving to be a startup within a larger organization.<p>See my interview at OSCON for why you might want to work for us: <a href=\"http://youtu.be/wzcIOMp6ZKw\" rel=\"nofollow\">http://youtu.be/wzcIOMp6ZKw</a><p>We are hiring for both a Lead Analyst/Programmer and a Sr. Analyst/Programmer<p>-----\nWe are seeking an experienced software development professional to join our small, highly focused, entrepreneurial R&#38;D application development group within the Center for Biomedical Informatics (CBMi) at The Children's Hospital of Philadelphia. As a member of our team, your technical expertise can have an immediate impact on patient care through our mission to accelerate pediatric research with novel applications and data solutions. Furthermore, your work here has the potential to impact the future of healthcare through our research into software solutions supporting genome-enabled personalized medicine. Our research mission fosters an environment where creativity and exploration of new technologies are promoted and encouraged.\nLikely candidates should have solid experience and working knowledge in three or more programming languages (Python, JavaScript, or Scala experience is highly desirable) and be comfortable with one or more relational database platforms.<p>Our dynamic academic research environment demands an individual with exceptional written and oral communication skills who can rapidly translate requirements from a variety of disciplines into intuitive, high quality software solutions that support our strategic vision.<p>Candidates with prior experience in the biomedical field, especially using highly complex genomic data and/or data from electronic health records are very desirable. Participation in one or more public open source projects is an added bonus.<p>Full details and application for Sr. Analyst/Programmer here: <a href=\"http://bit.ly/cbmijob2\" rel=\"nofollow\">http://bit.ly/cbmijob2</a><p>Full details and application for Lead Analyst/Programmer here: <a href=\"http://bit.ly/cbmijob3\" rel=\"nofollow\">http://bit.ly/cbmijob3</a><p>See some of our active code repos on GitHub for an idea of the kind of stuff we do: <a href=\"https://github.com/cbmi\" rel=\"nofollow\">https://github.com/cbmi</a>","time":1352470362,"type":"comment"},{"by":"buss","id":4728561,"parent":4727241,"text":"San Francisco.<p>Counsyl, a medical genetics company.<p>Come help us end preventable genetic disease.<p>Python &#38; Django experience a plus, but we need all kinds of engineers and scientists. We are growing fast and need devops to help us scale. We need bioinformaticians and production lab scientists. We need roboticists to help with scaling out a fully automated genetics lab.<p>Come make a difference and positively impact the future of humanity.<p>Interns and remote workers welcome.<p><a href=\"https://www.counsyl.com/jobs\" rel=\"nofollow\">https://www.counsyl.com/jobs</a>","time":1351789938,"type":"comment"},{"by":"prabhasp","id":4730940,"parent":4727241,"text":"New York: senior software dev, javascript nija, more.<p>What we do: build cutting edge web software to solve problems in the developing world. Think its bad to be in New York and not have electricity for a week? We work on electrification software to help national governments pull in electricity to those who've never had it. Thats an example of where it starts.<p>More at <a href=\"http://github.com/modilabs/jobs\" rel=\"nofollow\">http://github.com/modilabs/jobs</a> (yeah, old school, we know).","time":1351822913,"type":"comment"},{"by":"danialtz","id":4728440,"parent":4727241,"text":"Oncolead | Munich, Germany | (php/python) web developer<p>Oncolead is a small privately held company that aims to scale and accelerate the tedious and long process of anticancer drug development.<p>We are constantly bringing talented people on board from various backgrounds, and currently looking for a full-time skilled web developer.<p>More info: <a href=\"https://www.dropbox.com/s/0dvjy57p818wa94/web-developer-oncolead-ad.pdf\" rel=\"nofollow\">https://www.dropbox.com/s/0dvjy57p818wa94/web-developer-onco...</a>","time":1351788599,"type":"comment"},{"by":"lylo","id":4731920,"parent":4727241,"text":"<i></i>* FreeAgent - Edinburgh, UK <i></i>*<p>We're looking for RUBY developers!<p>FreeAgent is a company born out of the frustration that accounting is just too damn hard for freelancers and small businesses. We make products to empower people with the knowledge and means to make that easier, and let them do things their way.<p>But whatever we make is only as good as the people making it.<p>Come and talk to us.<p><a href=\"http://www.freeagent.com/company/jobs/ruby-engineer\" rel=\"nofollow\">http://www.freeagent.com/company/jobs/ruby-engineer</a>","time":1351850460,"type":"comment"},{"by":"senderista","id":4730248,"parent":4727241,"text":"Seattle: DevOps Lead<p>Meteor Solutions is a growing, cash-flow-positive web analytics startup based in downtown Seattle. We’re looking for a qualified ops-focused dev with special proficiency in scripting, text processing, and modern configuration-based deployment. Stack includes Python, Chef, Redis, and various AWS services.<p>Complete job description here: <a href=\"http://www.meteorsolutions.com/about/jobs/\" rel=\"nofollow\">http://www.meteorsolutions.com/about/jobs/</a>","time":1351811083,"type":"comment"},{"by":"decklin","id":4727909,"parent":4727241,"text":"Sonian (Newton, MA) - Full time, local or remote<p>We're a funded (recently closed Series C) email archiving startup with many customers. We are looking for an additional engineer for our operations (or \"devops\" if you prefer) team, to take us from merely using configuration management and automated deploys to delivering our internal services as dependable, multi-IaaS-portable tools that empower the rest of the company to solve customer issues.<p>We have offices outside of Boston (Newton), but our dev and ops teams are mostly remote, and we meet over VOIP and pair-program in tmux.<p>Some highlights of what we do:<p><pre><code>  +   We manage hundreds of compute instances across multiple clouds, including over a petabyte of data.\n  +   We write the code to help facilitate deploying our application to new public clouds.\n  +   We automate everything we possibly can\n  +   We build up awesome applications, and then opensource them (Perhaps you've heard of our monitoring framework Sensu - https://github.com/sensu )\n  +   We meet up 2-3 times a year in Boston with the rest of the company.\n</code></pre>\nWhat are we looking for in a new member of our team?<p><pre><code>  +   Excitement, energy and a willingness to learn something new.\n  +   The ability to take a task from idea to code to testing to deploy (all within a short amount of time).\n  +   Bring new ideas around project or processes to the team - if we like it - we'll do it.\n  +   You can work from home, from our Newton, MA headquarters, or your local coffee shop.  Anywhere with Internet access.\n  +   You'll be part of an on-call rotation with the rest of our team.\n  +   Flexible person who can work by themselves or pair with their team to teach or learn.\n</code></pre>\nWhat are some things you should know or have worked with before? (Some, many or all)<p><pre><code>  +   Ruby \n  +   Chef (comfortable writing cookbooks, LWRP's, etc), Fog\n  +   Rails, Sinatra\n  +   Git or other DVCS\n  +   Strong System administration with Ubuntu (includes security, logging, monitoring, web/SQL admin, etc, etc)\n  +   Contributing to open source\n</code></pre>\nInterested? - Contact pete.cheslock@sonian.com or <a href=\"https://twitter.com/petecheslock\" rel=\"nofollow\">https://twitter.com/petecheslock</a>, and let him know you saw this post. Please include a short summary of why you think you would be a good fit, resume/blog/etc, and a link to a Github account or other code samples.","time":1351782775,"type":"comment"},{"by":"paulaminc","id":4727919,"parent":4727241,"text":"Boston, Full-time, Onsite:  product manager and software engineers\nAbout us:  <a href=\"http://www.ripariandata.com/\" rel=\"nofollow\">http://www.ripariandata.com/</a>\nSee what the team is working on in our blog:  <a href=\"http://ripariandata.com/blog/\" rel=\"nofollow\">http://ripariandata.com/blog/</a>\nNo sales pitch, just the facts.  Interested to join a talented team that is very passionate about their work, we should talk.","time":1351782874,"type":"comment"},{"by":"jzoidberg","id":4727780,"parent":4727241,"text":"San Diego and Sunnyvale CA<p>Front end positions: html5 and Play Framework<p>Back end positions: Scala with Hadoop (we don't require Scala experience just enthusiasm)<p>GridX - we are a well funded startup developing a unique new system to operate the next generation smart electricity grid. Our software wrangle smart grid data at scale to solve real problems that make a difference to everyone's lives.<p>Join us at the ground floor in this exciting and challenging field.<p>Please contact johan at gridx dot com","time":1351781345,"type":"comment"},{"by":"oanda","id":4728734,"parent":4727241,"text":"Toronto | Full Time | iOS, Android, HTML5, C++ developers<p>OANDA is looking for developers to help us build our real-time forex trading platform, fxTrade.  Our stack measures latency in microseconds and transacts billions of dollars a day.  If that sounds exciting to you and you are passionate about iOS, Android, C++ or HTML5 then we want to talk to you.<p>Email: hr@oanda.com<p><a href=\"http://fxtrade.oanda.com\" rel=\"nofollow\">http://fxtrade.oanda.com</a>","time":1351791802,"type":"comment"},{"by":"sgrock","id":4727699,"kids":[4742421],"parent":4727241,"text":"New Relic, Portland, OR/San Francisco, CA/Seattle, WA<p>New Relic is looking for several developers to work on our world-class application monitoring product. If you have experience in Ruby, C, PHP, .NET, Java, Android, or Objective-C, you should check us out.<p>We’re a very fast growing pre-IPO start-up and we care about our culture.<p>We value:<p>* Work/Life Balance<p>* Respect<p>* Engineer Code Ownership<p>* Experimentation<p>Check out <a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a> for more details.","time":1351780447,"type":"comment"},{"by":"asider","id":4728094,"parent":4727241,"text":"SF/Montreal/remote: Sr iOS Engineer, Lead Eng, UI Eng<p>Bunch is the home for interest-based communities on mobile.<p>In a world of frictionless sharing, our interest feeds are noisy. Bunch is changing that. It’s the place to share and discuss your #1 passion with like-minded people.<p>We're in private beta, have 1.3 million pre-signup, founded by ex-BandPage and Match.com execs, and have VC funding.<p>Check out our intro video: www.joinbunch.com<p>Email andrew@joinbunch.com to chat","time":1351784808,"type":"comment"},{"by":"abrown9191","id":4732638,"parent":4727241,"text":"BrightScope is looking for exceptional developers to expand our dev team. Are you someone who is tired of working for big technology companies where you are buried in layers of bureaucracy, wait months or years between product releases or don’t have a say in what you build? Do you want to get in on the ground floor of a rising data and analytics company?<p>If you can figure out the toughest problems, love learning new things, and want to play a major role in the success of a growing startup, join us in building something great.<p>BrightScope is full of passionate, smart people that want to change the world for the better.<p>Responsibilities to include:\n•Developing new features and improving core business software assets and applications\n•Helping develop critical parts of our analytics platform and client-facing applications, delivered via a SaaS model over the web\n•Coordinating with the project team<p>Requirements:\n•Solid command of your favorite programming language\n•SQL experience (MySQL preferred), with a strong grasp of data modeling in large applications\n•Understanding of MVC frameworks\n•Experience with unit and functional testing, and preferably test-driven-development\n•A self-starter attitude and an ability to break large problems down quickly\n•Extreme attention to detail\n•Excellent written and verbal communication skills<p>Experience working with any of the following is desired:\n•Amazon's Web Services: EC2, S3, Route53, RDS, etc.\n•Knowledge of *nix is a huge plus (we use Ubuntu on our servers)\n•Distributed applications\n•Designing for scale: algorithmic and efficiency concerns, etc.\n•MVC frameworks (we use Django) \n•Web services (SOAP, REST)\n•Agile development processes\n•JIRA or other bug tracking systems\n•Knowledge of source control\n•Experience working with automated testing tools in Python or another language (Python unittest, nosetest, etc)<p>You will:\n•Improve the efficiency and stability of the systems and applications that power our solutions\n•Start with ideas, design products and features, help architect a technical solution, then build, test and launch it\n•Be an integral member of the development team and shape our future<p>We will:\n•Make sure you have what you need to be happy and productive\n•Compensate you with a mixture of cash and equity\n•Make great teammates united around the company mission<p>Qualified candidates should email their resumes and cover letters to jobs@brightscope.com with “SE YCOM” in the subject line.","time":1351865115,"type":"comment"},{"by":"ubi","id":4729947,"parent":4727241,"text":"San Francisco: Fullstack and Ruby Engineers + CTO for OkCupid Labs<p><i></i> Us:\nBuilding new products that connect people in love, life, work, and beyond\nSmall product teams where your ideas become brand new companies\nWork fast, have fun, ship often\nBrainstorming\nPrototyping<p><i></i> You:\nStartup experience and enthusiasm for new product ideas\nOpen source software projects\nRuby fluent<p>www.okcupid.com/careers","time":1351807155,"type":"comment"},{"by":"ryandetzel","id":4730349,"parent":4727241,"text":"Cambridge MA -- CustomMade.com\n- Python/Django developers\n- Frontend(html,css,js) developers.<p>Culture video: <a href=\"http://vimeo.com/43831514#\" rel=\"nofollow\">http://vimeo.com/43831514#</a>\nMore information: <a href=\"http://www.custommade.com/careers/\" rel=\"nofollow\">http://www.custommade.com/careers/</a><p>Hit me up if you're interested and want more info.","time":1351812454,"type":"comment"},{"by":"Peroni","id":4727360,"parent":4727241,"text":"globaldev - London, UK: Ruby Engineers &#38; Ruby on Rails Developers - Permanent &#38; Contract<p><a href=\"http://globaldev.co.uk/jobs\" rel=\"nofollow\">http://globaldev.co.uk/jobs</a><p>With a portfolio of over 7,500 sites, we’re the largest social network you’ve probably never heard of. One of the world’s leading social discovery and dating companies, we’re the Facebook for people who haven’t met yet – enabling people to find new friends and partners online for fun and adventure in real life.<p>We’re looking for 2-3 expert Ruby engineers &#38; RoR Developers to help us build a series of major enhancements to our dating platform and infrastructure over the next 12 months.<p>It's a fantastic place to work where you'll be surrounded by incredibly talented developers working on big data problems and we are working hard to ensure we provide the best environment for Ruby/RoR Devs in London.<p>Contact me directly in confidence: sbuckley@globalpersonals.co.uk","time":1351776771,"type":"comment"},{"by":"Skeletor","id":4729052,"parent":4727241,"text":"drchrono: iPad Electronic Health Records\nYC Winter 2011 Alum<p>Fulltime in Mountain View, CA<p>Join the fastest growing company in healthcare technology!<p><a href=\"https://drchrono.com/jobs\" rel=\"nofollow\">https://drchrono.com/jobs</a><p>a) We are hiring backend Python/Django developers:\nJoin the best software development team in healthcare!<p>Visit: <a href=\"http://www.jobscore.com/jobs/drchrono/engineer-backend/aC0_8gDwSr4AwceJe4bk1X\" rel=\"nofollow\">http://www.jobscore.com/jobs/drchrono/engineer-backend/aC0_8...</a><p>b) Experienced Sales Candidates:\nHelp us get every Doctor in the U.S. using drchrono!<p>Visit: <a href=\"http://www.jobscore.com/jobs/drchrono/sales/citWIuSeKr4j-QeJe4bk1X\" rel=\"nofollow\">http://www.jobscore.com/jobs/drchrono/sales/citWIuSeKr4j-QeJ...</a><p>c) Account Managers:\nHelp Doctors and their staff master the drchrono platform!<p><a href=\"http://www.jobscore.com/jobs/drchrono/customer-support-cadet/dnakzASgCr4l5xeJe4bk1X\" rel=\"nofollow\">http://www.jobscore.com/jobs/drchrono/customer-support-cadet...</a>","time":1351795775,"type":"comment"},{"by":"wangthony","id":4728672,"kids":[4729163],"parent":4727241,"text":"Tobi (San Francisco area, full-time)<p>What you should know about us:<p>o Engineers make key decisions (no PMs or “business people”)<p>o Startup culture without the BS<p>o Proven, tangible business model (we sell clothes)<p>o Huge market in a fun space (fashion)<p>o Profitable and growing<p>o Self-funded - no VCs, no board politics<p>o Profit sharing bonus plan paid out 2x/year<p>==&#62; LEARN MORE: engjobs@tobi.com or <a href=\"http://eng.tobi.com\" rel=\"nofollow\">http://eng.tobi.com</a>","time":1351791187,"type":"comment"},{"by":"dancablam","id":4728667,"parent":4727241,"text":"Dallas: Linux System Administrator <a href=\"http://dallas.craigslist.org/dal/sad/3375095604.html\" rel=\"nofollow\">http://dallas.craigslist.org/dal/sad/3375095604.html</a><p>Dallas: PHP Developer <a href=\"http://dallas.craigslist.org/dal/eng/3375926632.html\" rel=\"nofollow\">http://dallas.craigslist.org/dal/eng/3375926632.html</a>","time":1351791141,"type":"comment"},{"by":"johntdyer","id":4727709,"parent":4727241,"text":"Voxeo Labs is looking for full-time DevOps team members.<p>We're looking for someone to work remote in, or around, the Atlanta or San Jose area. We're flexible for the right person, but a local is highly desirable.<p>Additional details can be found here - <a href=\"https://gist.github.com/3993941\" rel=\"nofollow\">https://gist.github.com/3993941</a>","time":1351780514,"type":"comment"},{"by":"n9com","id":4727376,"parent":4727241,"text":"FIPLAB - Full time remote iOS/Mac developer<p><a href=\"http://www.fiplab.com/aboutus/careers/\" rel=\"nofollow\">http://www.fiplab.com/aboutus/careers/</a><p>Work with us on building apps used by millions. 400k+ daily active users / 10 million+ app downloads to date. Growing revenues by 300% year on year. Partnered with the biggest names in tech.","time":1351776986,"type":"comment"},{"by":"sethbannon","id":4727757,"parent":4727241,"text":"Amicus. NYC. Full-time.<p>Amicus helps non-profits and universities turn their supporters into fundraisers and advocates. We're Y Combinator alums and well-funded.<p>Our stack is RoR, Backbone, Mongo. We're hiring across the board -- front end, back end, devops.<p>Feel great about what you do.<p><a href=\"http://jobs.amicushq.com/\" rel=\"nofollow\">http://jobs.amicushq.com/</a>","time":1351781046,"type":"comment"},{"by":"rvivek","id":4728371,"parent":4727241,"text":"We're hiring Problem curators and hackers at HackerRank. We are creating an engaged community of problem solvers. Imagine the intelligence and value that a room would hold if it contained hackers/problem solver from around the world? We're building it online\nJoin us (hackerrank.com/careers)","time":1351787933,"type":"comment"},{"by":"emcienjobs","id":4732567,"parent":4727241,"text":"Atlanta: Software Engineer | Emcien.com<p>RoR, Backbone, Linear Algebra, Sparse Matrixes, Pattern Detection<p>Work with smart people on unique and difficult problems.<p><a href=\"https://jobs.github.com/positions/502652e6-a9a5-11e1-95e7-0599ab24122b\" rel=\"nofollow\">https://jobs.github.com/positions/502652e6-a9a5-11e1-95e7-05...</a>","time":1351864149,"type":"comment"},{"by":"pteichman","id":4727708,"parent":4727241,"text":"litl, LLC. Boston, MA. Full-time, remote ok.<p>litl's Woven is looking for a talented, practical Python developer for its image research team. We're a creative engineering team evaluating whimsical ways to visualize and organize photographs.<p>Skills &#38; Requirements<p>Solid proficiency in Python. Experience in one or more of: machine learning, photographic image processing, or the Python scientific computing stack. You're eager to learn the others as you go.<p>The team's responsibilities include:<p>* development and analysis of machine learning and information retrieval methods<p>* novel clustering methods for photo contents<p>* supporting our server team with quick-to-production, highly maintainable code<p>Experience working in a small team of developers with strict code review policies is appreciated. Code samples are most welcome. jobs@litl.com","time":1351780512,"type":"comment"},{"by":"masylum","id":4728198,"parent":4727241,"text":"Teambox:<p>We are hiring!<p>- Senior Fullstack developer with strong js and ruby skills (Backbone, RoR, nodejs)<p>- Junior support engineer with experience in js or ruby and some testing tools.<p>Join our amazing team in Barcelona and help us build an amazing product! :)<p><a href=\"http://teambox.com/jobs/\" rel=\"nofollow\">http://teambox.com/jobs/</a>","time":1351785887,"type":"comment"},{"by":"frabcus","id":4727960,"parent":4727241,"text":"Liverpool, UK: ScraperWiki, a platform for getting, cleaning and analysing data.<p>We're hiring a data scientist, a technical manager and a business data product director.<p>The adverts aren't on our website yet, am taking advantage of first of the month to post it here anyway :)<p>Email francis@scraperwiki.com","time":1351783304,"type":"comment"},{"by":"kittkat","id":4733472,"parent":4727241,"text":"Boston, MA: Full Stack Developers, Python Developers, Interns<p>Jana's hiring web developers at all levels to expand our engineering team. We’re actively hiring people to help us push the envelope on how the modern web can interact with mobile phones.<p>For more info and to apply check out our website: www.jana.com<p>We are:\nJana is a small Boston-based startup focused on people in the developing world.  We came out of the MIT Media lab. We help large multinational organizations like P&#38;G, Unilever, and the United Nations to connect with consumers in emerging markets like India, Indonesia, Brazil and Nigeria. Jana meets these consumers where they're at, which is often the mobile web on their low-end phone. We work at a global scale: through partnerships with more than 235 mobile operators in more than 100 countries Jana can send airtime rewards to more than 3.48 billion people.<p>We want:\nWe’re hiring software engineers to work on both our back-end and front-end challenges. We are python end-to-end, hosting our servers in Amazon’s cloud. Our challenges tend to be systems-level ones, as we engineer the ability to reliably connect with individuals on the other side of the world.<p>We are looking for people who are passionate about what we are trying to accomplish: making a direct connection to developing world consumers using mobile technology.<p>We offer:\nAlthough we're a small startup (15 people), founded in 2009, we offer benefits like 401k, medical, and dental.<p>We provide a fun, relaxing, productive work environment. Our office on Boylston Street in Boston’s Bay also now has a lounge featuring a flat screen tv and wii for people to unwind. For fun we play ping pong or Settlers of Catan. We have a “magic” kitchen whiteboard where suggestions tend to materialize the next day, be it snacks, beer for the beer fridge, wii game suggestions, kickball league sign up, etc. (although I’m still having trouble getting 2 unicorns and world peace).<p>Apply Directly:\n<i>Full Stack Web Developer <a href=\"http://jobsco.re/Rwi6X6\" rel=\"nofollow\">http://jobsco.re/Rwi6X6</a>\n</i>Head Engineering <a href=\"http://jobsco.re/YeB0UX\" rel=\"nofollow\">http://jobsco.re/YeB0UX</a>\n<i>Python Developer <a href=\"http://jobsco.re/OVBhqL\" rel=\"nofollow\">http://jobsco.re/OVBhqL</a>\n</i>Consumer Web App Developer <a href=\"http://jobsco.re/Tqo4oy\" rel=\"nofollow\">http://jobsco.re/Tqo4oy</a>\n<i>Part Time Coder <a href=\"http://jobsco.re/YeBrP1\" rel=\"nofollow\">http://jobsco.re/YeBrP1</a>\n</i>Web Developer Intern <a href=\"http://jobsco.re/Tqohbj\" rel=\"nofollow\">http://jobsco.re/Tqohbj</a>","time":1351874516,"type":"comment"},{"by":"bazookaBen","id":4731353,"parent":4727241,"text":"We're a small team of Javascript/HTML5 developers, building the future of games.<p>Prerequisite: must be willing to learn different technologies to solve problems. Game background not required, we'll teach you everything.<p>If you're in Hong Kong, drop us a line!<p>e-mail ben at marketJS dot com","time":1351833590,"type":"comment"},{"by":"steverb","id":4728482,"parent":4727241,"text":"Cellular Sales: Knoxville, TN: Full Time, Local<p>Position: Software Developer<p>We're a passionate group of developers supporting a passionate group of people who happen to sell phones. Looking for a junior to mid-level developer to jump in and help out.<p>email: steve.barbour@cellularsales.com","time":1351789067,"type":"comment"},{"by":"ryankals","id":4763020,"parent":4727241,"text":"Hey guys - I'm sorry for the plug, but I recently built a website called Qiirk.com which is a tech job board.<p>If you'd like, you can post your job for free using the promo HACKERNEWS. Let me know if you have any problems!","time":1352472992,"type":"comment"},{"by":"BeardedCoder","id":4728668,"parent":4727241,"text":"Rackspace<p>Fulltime in Austin, TX.<p>We are using Scala and Ruby to automate our growing open cloud infrastructure. Seeking individuals with the passion and talent to create great software.  Send resume/info to resume at scalahq.com.","time":1351791142,"type":"comment"},{"by":"gbog","id":4727433,"parent":4727241,"text":"Beijing: Douban.com, the most innovative Chinese start-up, is hiring. Spoken and written Mandarin is required.<p><a href=\"http://www.douban.com/jobs\" rel=\"nofollow\">http://www.douban.com/jobs</a>","time":1351777661,"type":"comment"},{"by":"traviskuhl","id":4727907,"parent":4727241,"text":"Team Coco (teamcoco.com)<p>Location: Burbank, CA<p>Position: Web Developer, Full Time<p>Details: <a href=\"http://teamcoco.com/content/web-developer\" rel=\"nofollow\">http://teamcoco.com/content/web-developer</a>","time":1351782755,"type":"comment"},{"by":"id10t_user","id":4727746,"parent":4727241,"text":"Univ. Nebraska - <a href=\"https://careers.nebraska.edu\" rel=\"nofollow\">https://careers.nebraska.edu</a><p>- IDM Specialist<p>- Web App Developer (C#, .NET, VB)<p>- PeopleSoft SysAdmin<p>- PeopleSoft Programmer","time":1351780920,"type":"comment"},{"by":"mikek","id":4728153,"parent":4727241,"text":"Mountain View, CA - Kiwi Crate<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1351785476,"type":"comment"},{"by":"modernise","id":4727980,"kids":[4728610],"parent":4727241,"text":"I've gotten a good response from email to various companies found on Crunchbase.","time":1351783576,"type":"comment"},{"by":"jergason","id":4728187,"parent":4727241,"text":"Provo, UT. REMOTE<p>i.TV is making Nintendo TVii, the TV experience that launches with the WiiU on November 18th, and we want your help to make it awesome.<p>We are looking for several engineers and one devops engineer to help us revolutionize television. We create applications for tablets, phones, and laptops that work seamlessly with your home system to suggest content to watch, control your TV, and deliver engaging complimentary experiences and extra content during the show.<p>We currently have the top TV app in the app store. We power Huffington Post TV and social TV experiences for EW.com.<p>But NintendoTVii is 10x as cool as that. It is all about what you do while you're watching TV. It will be preinstalled on the WiiU this fall, and we will be in tens of millions of homes before the end of 2013.<p>Our team and culture are what set us apart\n1. Currently 7 really smart engineers.\n2. Lots of autonomy, minimal red tape. \n3. We work in small teams of 2-4 engineers, a designer and a product person who are given a high-level assignment. They are small enough to avoid process/organizational overload and meetings. \n4. Meetings, seriously, the only ones we have are Friday lunch and casual ones over the foosball table. \n5. Focus on learning! Tell us about the cool stuff you use or invent and we'll use it. Go to conferences on the company dime.\n6. 20% time - every Wednesday we have \"Developer day\" where you pick what you think is important and do it. \n7. Personal responsibility - you take vacation whenever you want, choose your own hours, choose your own equipment.<p>We have great benefits\n1. Sweet equipment. We just bought everyone retina macbook pros. \n2. Fully stocked fridge and kitchen with drinks, snacks and lunches. \n3. 100% health and dental\n4. Above-market salary that we reset as often as necessary\n5. Fun downtown Provo location and building<p>Equity opportunity\n20% of the post-investor equity goes to the employee stock plan. Our hardware partner recently advanced us several million against advertising revenue this fall, and we are on track to blow past that before the end of the year. We were last valued at 20 million, and expect to be valued at 50 million during 2013.<p>Technology\nWe use node.js for most of our backend services. We use MongoDB as our database. We create rich clients with JS/HTML, iOS and Android. We expect you to be proficient in at least one of these technologies, and to be able to learn more. We're looking for great devs over a specific skillset.<p>For the DevOps position, we're looking for someone who can focus on scaling, removing deploy friction, uptime and security, but we want someone who is constantly inventing and automating to solve the problem, rather than resorting to manual labor.<p>Some cool problems we are working on:\n1. There are 800,000 unique channel lineups with up to 1000 channels each, with millions of unique events. How can you massage the programming information to make TV guide APIs fast?\n2. We create software that watches TV to extract thumbnails every second, and analyze the caption and audio data. How can we make this faster and more scalable?\n3. How can we create really compelling web applications on custom hardware?\n4. How do you implement really custom, unique but simple designs and keep it maintainable?\n5. How do we get a mobile device to control a TV?\n6. How can we show users the content they will care about most?\n7. How can we use data about sports or TV programs to create engaging visualizations?\n8. How can we help users interact with each other while watching tv?<p>Email jamison@i.tv for more info. Visit <a href=\"http://i.tv\" rel=\"nofollow\">http://i.tv</a> to see the promo stuff.","time":1351785832,"type":"comment"},{"by":"ckluis","id":4727513,"parent":4727241,"text":"Tampa (Dunedin actually)<p>- ASP.NET, C# - devs<p>- MS SQL - dbas<p>- enterprise b2b software - profitable<p>- chris.kluis@mintek.com","time":1351778356,"type":"comment"},{"by":"scottdthomas","id":4729527,"parent":4727241,"text":"Game Closure is looking for great engineers to help us build the world's best mobile game engine. We are 25-strong and growing (carefully). If you want to join a great team, develop cutting-edge technology and have an impact, then we want to talk to you.<p>ABOUT GAME CLOSURE<p>Game Closure is democratizing mobile game development using HTML5, allowing developers to build a game once and launch seamlessly on a variety of mobile platforms (iOS, Android, etc.).<p>We write cross-compilers, custom browsers, ARM7 assembly, GPU shaders, Node.js &#38; Python back-ends, JavaScript game APIs, and whatever else it takes. As an engineer at Game Closure, you will work with these technologies to build core features of our product. You will work with the best engineers in the world -- we have top talent in every part of our stack, from server architecture to browser optimization to Android internals -- on the hardest problems in mobile and social gaming.<p>A few other tidbits:\n- Backed by top-tier investors, including Highland, Benchmark and Greylock.\n- Located in Mountain View, right off Caltrain and in the heart of the Castro Street restaurant corridor.\n- We offer truly meaningful equity -- we want you to feel like a partner in our business and share in its success -- and competitive pay and full benefits<p>Some press clippings:\n- Techcrunch: <a href=\"http://tcrn.ch/XTR9ir\" rel=\"nofollow\">http://tcrn.ch/XTR9ir</a>\n- VentureBeat: <a href=\"http://bit.ly/TszL2o\" rel=\"nofollow\">http://bit.ly/TszL2o</a><p>WHAT WE'RE LOOKING FOR // WHAT YOU'LL DO<p>We are looking for stellar software engineers to architect and build features for our core SDK (and more). Whether you're a generalist or specialist -- we welcome both -- as long as you enjoy the challenges the come with building a next-gen gaming platform, this role will be perfect for you. We're at the size where we can still fit the role around the individual and their interests (rather than the other way around).<p>WHAT WE OFFER<p>In addition to a great work environment and solid compensation and benefits, Game Closure offers:<p>- Ownership: We're a small team, and we empower our people to pursue novel approaches.\n- Challenge(s): What we're doing isn't easy. We're working every day to solve the hardest problems in mobile game development.\n- Skills: There's zero stagnation here. We use the latest tools and technologies every day. You can touch all parts of the stack and see your influence on real, shipping products\n- Creative input: Ideas are valued from all corners of Game Closure, and we work fast -- that idea can go from concept to live in short order.\n- Community. Closures hang together. We take care of our people and believe it makes us stronger as a company. We enjoy working together and relaxing together.<p>TO APPLY<p>We'd love to hear from you. To apply for this position, follow the link: <a href=\"http://hire.jobvite.com/j/?cj=o0mSWfwU&#38;s=HackerNews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=o0mSWfwU&#38;s=HackerNews</a>. <i></i> There is no 'black hole' here. We reply to everyone.<i></i> Thanks!","time":1351801669,"type":"comment"},{"by":"sbisker","id":4728937,"parent":4727241,"text":"San Francisco, CA - Designers Wanted at Locu (<a href=\"http://locu.com\" rel=\"nofollow\">http://locu.com</a>)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We have recently launched Locu &#60;<a href=\"http://locu.com&#62;\" rel=\"nofollow\">http://locu.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>We're creating powerful design tools that let local merchants better connect with their consumers. We're looking for world-class visual designers and user experience designers who are excited to redefine what a menu looks and feels like across web and print, and create tools that put modern web technology in the hands of merchants.<p>Guidelines (requirements is such a strong word):<p><pre><code>  Exceptional visual and/or interaction design talent - please include\n  a link to portfolio.\n  (Intern candidates may link to individual samples of their work\n  instead of a portfolio.)\n  \n  Experience with Adobe Creative Suite, or the ability to learn\n  quickly (Omnigraffle or Fireworks a plus)\n  \n  Expertise in HTML / CSS and Javascript/jQuery, or the ability to learn quickly\n  \n  Excellent written and verbal skills - not afraid to debate and\n  discuss design decisions\n  \n  Experience with any of the following a plus: wire-framing,\n  prototyping, analytics, user research, asset creation, product\n  management, branding.\n</code></pre>\nSpecial note for Generalist Designers and Desingineers<p><pre><code>  We know you like to strike your own unique balance. So don't sweat the reqs and just \n  show us what you've got.\n  We want you to be able to do what you love, the way you're best able to do it. :)\n  \n</code></pre>\nInterested? Drop us a line at jobs@locu.com. Please specify \"Designer - HN\", in the subject of your letter. Learn more about us at <a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http://locu.com/about/jobs/</a><p>PS: Like most startups, we're always on the lookout for exceptional talent of all sorts. So if you feel you're a particularly strong fit for what we do or how we do it, check out our other descriptions at <a href=\"http://locu.com/jobs/\" rel=\"nofollow\">http://locu.com/jobs/</a>.<p>-------------------------------------<p><i></i><i>Founded a year ago by MIT graduates and researchers, Locu (<a href=\"http://www.locu.com/\" rel=\"nofollow\">http://www.locu.com/</a>) has the backing and support of some of the best investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 19 people with very diverse backgrounds, and growing.</i><i></i>","time":1351794485,"type":"comment"},{"by":"RichardPrice","id":4728910,"parent":4727241,"text":"San Francisco, CA. Full time. Remote is fine too.<p>Academia.edu is a social platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>Many people think that science is too closed, and too slow. We are trying to change that. There are 4 things we are trying to achieve with Academia.edu - ways in which we are trying to re-shape and accelerate science:<p>- Instant distribution. Right now there is a 12 month time-lag between submitting a paper to a journal, and the paper being published. We need to remove that time-lag and introduce instant distribution of scientific ideas.<p>- Multi-media. Right now, scientists only share papers in PDF form. We need to bring about a science where scientists are incentivized to share data-sets, code, videos, blog posts, and comments on all these media. Right now 50% or more of the world’s scientific output does not get shared, because the system of credibility metrics only rewards one kind of format, the paper. We need to change this.<p>- Open access. We need to bring about a world where a villager in India has the same access to the world’s scientific output as a professor in Harvard. When you open up access to the world’s scientific literature to 2 billion people, magical things may happen.<p>- Better peer review. Right now the peer review process takes 12 months to complete, and only surfaces the opinions of two academics - academics who may be biased, uninformed about the subject area, or just in a bad mood when writing the review. 2 people is too small a sample size. We need a faster and more robust peer review system, one that surfaces the opinions of the entire scientific community, across a variety of dimensions, and in real-time.<p>It's an exciting time for science. Science is transitioning from a 17th century way of sharing ideas (sending papers around the world with 12 month time-lags in every iteration) to a much faster system of sharing ideas on the web. Science is a foundational part of global growth: almost every innovation in medicine and technology has its roots in a science paper.<p>We need talented and passionate engineers to help us accelerate science. We have made a good start: 1.8 million academics have joined Academia.edu, and 4,000 join each day.<p>We're a 12 person, engineering-driven, team based in downtown San Francisco. Technologies we use include Rails, PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd. We have raised $6.7 million from Spark Capital, True Ventures, Mark Shuttleworth (founder of Ubuntu), and others.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. We are looking to hire a range of positions:<p>* full stack engineers<p>* growth engineer (optimizing our growth and retention channels)<p>* iOS engineer<p>There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>. There is more on TechCrunch about our mission here <a href=\"http://tcrn.ch/T42VWC\" rel=\"nofollow\">http://tcrn.ch/T42VWC</a> (The Future of Peer Review) and here <a href=\"http://tcrn.ch/R6Pgrr\" rel=\"nofollow\">http://tcrn.ch/R6Pgrr</a> (The Future of Science)<p>We want to hire world class engineers. We want you to join us in building the future of science whether you are based in San Francisco, New York, Delhi, or Beijing. Remote work is fine. We will handle re-location, including visas, if you would like to re-locate, but re-location is not necessary.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1351794190,"type":"comment"},{"by":"eugmandel","id":4727979,"kids":[4728952],"parent":4727241,"text":"Burlingame Marketing Automation Startup Qualaroo is Hiring a Full Stack Web Developer<p>About Us<p>Qualaroo (formerly KISSinsights) is an embeddable survey and messaging tool for websites and apps that lets marketers and product managers get targeted feedback from their users, and personalize prompts and forms based on the specific user's feedback.<p>Our office is in the building of Burlingame Caltrain station (\"The Station\"). We have a collaboration room and a quiet room. It’s simple. We respect you too much to describe the chairs or the equipment.<p>Our CEO/founder is a marketer (see his blog: startup-marketing.com). He is the kind of marketer engineers like. If you are interested in marketing, you will learn a lot here. Writing code that is used by no one sucks. Things need to be marketed. Things need to be sold.<p>Yes, of course the salary is competitive. Yes, of course you will get equity (we are a startup, after all). Yes, we have health and dental plans.<p>Our current infrastructure includes Ruby, Rails and MySQL. Our Javascript is both homegrown and based on jQuery and Backbone.js frameworks.<p>Our data set is growing. New technologies will be needed to support it. You will find and research them with us. It's a fun time.<p>About You<p>You are a startup-minded developer. You prefer a startup (somewhat chaotic) environment where you are given freedom and responsibility, as opposed to one where requirements are always clear, priorities don't change and processes are set.<p>You are a generalist. In a small team it does not make sense to focus on one small area to the exclusion of everything else.<p>You probably have a CS degree. If you don't, you have a pretty interesting story to tell.<p>You are pretty senior. You can work without supervision. Number of years of experience does not matter.<p>You do full stack web development. If you lean more towards back-end or front-end, it's fine, but you are still willing to tackle issues in all areas when needed.<p>You probably don't call yourself a \"Ruby Developer\". You are simply a developer. Ruby is just a tool. If you need to learn a new one - pick up a book. We'll pay for it.<p>You feel comfortable with databases. You know how to write code that does not kill them. In general, you always think about performance and how things will work under stress.<p>If you find yourself doing a task more than a couple of times, you want to automate it.<p>You enjoy teaching yourself whatever you need to get the job done. You are curious about new tools and technologies, but getting things done is always your first priority.<p>You like talking to customers and help them with their problems. Support is not a chore - it's how we learn.<p>You shepherd your features all the way into production. Until they have automated tests, are deployed, are monitored and integrated with analytics to see how they are affecting the business, they are not \"done done\".<p>You like Facebook’s \"Done is better than perfect\" and \"Move fast and break things\" posters, but don't take them to the absurd. When you see a piece of code, you can tell the difference between \"done\" and \"perfect\".<p>You can (and like to) describe your solution, make your point and defend it.<p>You voice your opinion when you disagree with something and don't care for passive aggressive behavior. We do argue here. Sometimes it might look not pretty from the outside, but it's because we really like and respect each other.<p>SOUNDS INTERESTING? \nPlease apply here: <a href=\"https://qualaroo.com/join-us/full-stack-web-developer\" rel=\"nofollow\">https://qualaroo.com/join-us/full-stack-web-developer</a>","time":1351783563,"type":"comment"},{"by":"jordo37","id":4727749,"parent":4727241,"text":"San Francisco | Fullstack Engineer, Backend Engineer and Frontend Developer | Perfect Audience<p>What We Do:\nWe've built the world's first and easiest Facebook ad retargeting solution, and we have much more ambitious plans. We believe advertising is a critical part of the internet economy, and want to help small business and publishers succeed with solutions that just work.<p>Who We Are:\nWe're a team of five, split between some of us doing the selling and the rest of us doing the building. We want to bring in more designers and developers to help us keep building new features as fast as we can. Ideally these folks will be ready to dive into anything, pitching in when fires come up. But, they will also own some piece of the product where we need expertise.<p>Traction:\nWe are increasing our revenue by 25% every week and it's going to do nothing but accelerate with some big clients we have lined up in the coming months.<p>What we look for in teammates:\nSmart, really smart\nEager to join a growing startup\nHas a “maker” attitude\nGood at communicating (ready to discuss features, bugs, architecture, etc.)\nLanguage never trumps experience - but if you know Rails, Mongo and Javascript things will go faster\nAppreciation for puns and movie quotes\nExperience in advertising is a HUGE plus<p>Backend Engineer<p>About the Position:\nWe're looking for someone to be the primary backend person at Perfect Audience. This person will guide us as we think about restructuring our data storage and help us prepare for more data influx and more demanding data analysis and visualization.<p>What we are looking for:\nSolid understanding of database paradigms and architecture\nAbility to look at a series of customer or team needs and help us pull together the right technology, queries and optimizations\nAbility to cover DBA or Sys Admin needs is awesome<p>Full Stack Engineer<p>About the Position:\nWe're a team of full-stack engineers who enjoy database design, application logic, and standards-based frontends. We are always looking for more smart generalists to come join us. This is a chance to work on every facet of a successful web app and grow your engineering skillset.<p>What we are looking for:\nSolid software development foundation\nAbility to architect, develop, and test key infrastructure\nUnderstanding of performance and design tradeoffs, without compromising quality\nExperience scaling up webapps and services for rapid growth is a plus<p>Front End Designer / Developer<p>About the position:\nWe regularly get complimented on our design and interface, but we don't want it to just be better than the enterprise tools - we want it to be delightful. We want a skilled individual to come in and own the design and user experience.<p>What we are looking for:\nSomeone as comfortable editing masks in Photoshop as tweaking CSS in a text editor\nInnate understanding of, and instinct for, design and user experience \nExperience seeking input from end users\nAbility to carry design from ideation and wireframes all the way through solid HTML, CSS and Javascript\nExperience with enterprise or B2B tools is a plus<p>Contact us at jobs@perfectaudience.com","time":1351780972,"type":"comment"},{"by":"dogas","id":4729034,"parent":4727241,"text":"Philadelphia, PA, NY or DC - Sr. Technical Engineer at PipelineDeals<p>About PipelineDeals<p>Our team has been developing, delivering, and zealously supporting the PipelineDeals CRM solution for over six years.<p>We’re passionate about creating software that people want to use and share. We love what we do, and we want our customers to love us for helping them close more deals and rule the world.<p>We are looking to hire a Sr. Technical Engineer for our flagship product and future products. We’re interested in people who like to make a difference and will thrive in our culture, which revolves around our customers.<p>You will help create an overall user experience where every pixel counts, user feedback is instantaneous, performance is blazing fast, scaling is automated and downtime a very rare event.<p>What we are looking for:<p>- Software engineering chops - you value how code is written and enjoy teaching design patterns and coding techniques to others.<p>- Significant experience designing, developing and delivering web applications/services.<p>- Demonstrated success working with cloud-based infrastructure services.<p>- Ability to manage technical operations / devops.<p>- Experience utilizing agile methodologies.<p>- Strong application framework experience as well as extensive experience with a SQL backend.<p>- Fluent in Ruby/Ruby on Rails, and experience with Rails upgrade paths.<p>- Fluent in javascript based frameworks such as backbone.js and / or ember.js.<p>- Great communicator at all levels of the organization.<p>- Strategic thinker and detail oriented.<p>Responsibilities<p>* Design, develop and architect technical solutions to support product enhancements and new products.<p>* Own the development methodology and delivery of our product.<p>* Drive error free deployments.<p>* Perform rapid bug-fixing.<p>* Obsess about page load times and application snappiness and speed.<p>* Manage and maintain our infrastructure and technical operations.<p>* Manage and test regular backup and disaster recovery processes and procedures.<p>* Coordinate and perform regular security testing.<p>* Perform capacity planning and manage our infrastructure costs.<p>* Set technical direction and software architecture with input/planning from engineering team.<p>* Perform root cause analysis.<p>Location<p>* Ideally, you will be based in the Philadelphia or the surrounding areas.<p>* We will also consider candidates New York, or Washington D.C.<p>* Remote work situation also possible but not preferred.<p>Interested?  Please contact nick@pipelinedealsco.com.","time":1351795550,"type":"comment"},{"deleted":true,"id":4728555,"parent":4727241,"time":1351789885,"type":"comment"},{"by":"davidmr","id":4728204,"parent":4727241,"text":"Location: Chicago, IL OR New York City OR London<p>Firm: Jump Trading<p>Wanted: C++ hackers with a side of Python<p>Marketing Blurb:<p>Our firm grew out of the knowledge and experience of its founders to become a globally-positioned financial technology firm that remains on the cutting edge of algorithmic trading. We are a privately funded company and do not rely on outside investors or private equity. With offices in Chicago, London and Singapore, we trade across all major asset classes in the Americas, Europe and Asia. Because of our ongoing commitment to technology and human capital we have become an industry leader, quietly setting the standard for sophisticated trading strategies.<p>Our success is driven by three fundamental ideas:<p><pre><code>  * Seek and hire the most brilliant and talented people we can find\n  * Reward those people based on merit\n  * Remain on the leading edge of technological innovation\n</code></pre>\nThe Job:<p>The Data Archive Support Developer will be a part of a team responsible for building and maintaining the HPC software infrastructure used by by Jump's quantitative researchers for statistical analysis. Responsibilities for this position will be split between operational support of Jump's historical market data archives, automation of support tasks, and development of tools which will enhance the efficiency and efficacy of the researchers workflows. A successful candidate will work closely with core developers, quant support system administrators and quant researchers to ensure the integrity of the market data, optimize its format for high performance computing, guarantee its availability in a timely fashion and improve the overall efficiency of the quant research processes at Jump.<p>DUTIES AND RESPONSIBILITIES:<p>* Manage applications which capture market data and prepare the data for consumption by research applications<p>* Verify the integrity of the archived data and resolve data integrity issues.<p>* Build tools which will enhance the overall supportability of the archive environment and automate common tasks.<p>* Work closely with Jump's core developers to build and maintain a deep understanding of Jump's feed and capture applications as well as the archive consumption APIs.<p>* Work closely with Jump's quant researchers to understand how they are using the archives as well as any challenges they are facing.<p>* Use the above understanding to build tools which enhance the overall usability of the archive environment and lower barriers to entry for new archive users.<p>* Act as a support contact for Jump's Quant users for issues related to the archive access APIs and archive data itself.<p>If you have any questions at all, please e-mail me! The job description really doesn't do a great job describing the awesome problems you'll be solving or the freedom you'll have to explore solutions.","time":1351785957,"type":"comment"},{"deleted":true,"id":4728179,"parent":4727241,"time":1351785769,"type":"comment"},{"by":"solomonjames","id":4727872,"parent":4727241,"text":"Spotify : Service Reliability Engineer : New York, NY<p>We want to connect millions of people with their favorite songs and create a service that people love to use. We believe music should be easily accessible and that listening to music will make people live richer lives. We want to create a win-win situation for people who love listening to music and people who love creating music. e primary mission of the operations team is to make sure that the music never stops streaming.<p>Our work environment is exciting, informal, friendly, fun, and very demanding. As an operations engineer you are part of the operations team working on the development and maintenance of the Spotify production environment. Working at Spotify you get an unique chance to work with very large scale systems, millions of users and an incredibly fast-growing environment. Key areas of focus are: automation, a structured approach to system development and a sense for building scalable systems.<p>The system which feeds all these streams is a diverse and technically challenging environment. The service we operate is comprised of a large number of applications running on hundreds of servers in multiple locations around the world. Our platform is built with a special focus on scalability, using mostly Free/Libre Open Source Software.<p>=== Responsibilities:<p>* Making sure Spotify works.<p>* Development and design of the systems used to operate Spotify, with a focus on automation and maintainability at large scale.<p>* Deployment of hardware and software in the production environment.<p>* Troubleshooting and analysing applications, networks and hardware.<p>* Collaboration with the development team on operations-related issues, providing support and acting as stakeholder.<p>=== Requirements:<p>* The ideal candidate is hardworking, motivated and responsible. A university education is a plus but not required- most important is the desire and motivation to learn, strong sense of ownership and drive.<p>* Very good understanding of Linux/Unix based server systems.<p>* Experience with configuration management tools for example: Puppet, Chef, cfengine or FAI.<p>* Deep knowledge of IP-networking.<p>* Experience with maintaining and troubleshooting complex and critical IT-systems.<p>* Very sharp analytical skills.<p>* Excellent written and spoken English skills.<p>* Knowledge of at least one scripting language (bash, perl, python, etc)<p>* Debian GNU/Linux knowledge a plus.<p>* Experience with revision control systems a plus.<p>Please feel free to contact Alexandra at acohen@spotify.com if you are interested.<p>And we have other positions available, all around the world:<p><a href=\"http://www.spotify.com/jobs/vacancies/\" rel=\"nofollow\">http://www.spotify.com/jobs/vacancies/</a>","time":1351782282,"type":"comment"},{"by":"sebslomski","id":4727630,"parent":4727241,"text":"London: JavaScript Developer<p>#Job Description<p>Working closely with all members of the product, UX/UI and Dev teams, you will be responsible for implementing the front-end of our product experience as well as conceptualizing and planning new features.<p>You will be working in a collaborative environment, which is diverse and open-minded. The successful candidate will demonstrate best practice front-end development, including usability, SEO, calls to action and delighting the user while maintaining security, cross-platform/browser compliance, accessibility, scalability and performance standards.<p># Skills &#38; Requirements<p>## Responsibilities<p>- Build UI features in Javascript untilizing RESTful JSON APIs<p>- Be aware of new and emerging front-end technologies<p>- Maintaining and extending existing mobile web apps<p># Skills<p>- Extensive experience with Javascript and Javascript libraries, particularly Backbone.Marionette and jQuery<p>- Fluency with HTML5 and CSS3<p>- Expertise with Javascript MV* frameworks such as Spine, Backbone.js, Sproutcore, Cappuchino<p>- Has an opinion on Crockford's JS style and semicolons<p>- Experience with version control systems, prefrable git<p>- Proven real world experience with mobile web development<p>- Knows what \"use strict\" does<p>- Has an opinion on innerHTML vs. document fragments<p>- Understands inheritance in Javascript, appreciation and understanding of object oriented programming concepts<p>- Obsessive about quality, including code quality<p>- Experience with testing, particularly unit tests<p>- Knowledge of XMPP is a bonus point<p># About Luluvise<p>Luluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Please apply by sending your CV and cover letter to Ekta at ekta@luluvise.com","time":1351779587,"type":"comment"},{"deleted":true,"id":4727629,"parent":4727241,"time":1351779579,"type":"comment"},{"by":"jrdevjob","dead":true,"id":4760849,"parent":4727241,"text":"San Mateo, CA - Jr. Developer - Fulltime - Full Benefits<p>A Great Learning opportunity for Recent Graduates! You will be allowed full freedom on what Languages you want to use and experiment with them while creating different in-house tools.<p>Responsibilities\n-- Work closely with the Product and Development teams to understand product requirements, system architecture and technology.\n-- Develop automated functional and integration tests.\n-- Develop tools and application to integrate with other departments.\n-- Responsible for continuous integration.\n-- Interface with other groups and advocate for those customers in matters of quality and user experience.<p>Requirements\n-- Bachelor’s degree in Computer Science, Software Engineering or relevant Experience.\n-- Attention to detail is critical, as is an understanding of the importance of usability and a focus on quality for the end-user.\n-- Understanding and some experience with Java and/or other OOP languages-- Ability to read and understand HTML, JavaScript and other scripting languages\n-- Some Experience with SQL\n-- Ability to work effectively with Windows, Mac and Unix Operating System\n-- Excellent written and verbal communication skills essential.\n-- Candidate must be resourceful when it comes to gathering information, eager to learn, able to work independently when required, and always be a team player.<p>We Offer Full benefits and exciting other perks, in a great start-up environment.<p>Please send resumes to: azadeh@searchforce.com","time":1352425429,"type":"comment"},{"by":"dubisaweapon","dead":true,"id":4727637,"parent":4727241,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B<p>Did you know there's a company based in Soho that has enough technology to be considered among the world's Top 250 supercomputing sites? One that imports over 5TB of data every single day, and has alumni from Google, Intel, and Microsoft?<p>You might think I'm talking about some stealth-mode startup, but I'm talking about where I work: Two Sigma Investments. At our core, we're a technology company applying our talents to the domain of finance. We've created a system that combines artificial intelligence and keen human insight — a system that's constantly improving and advancing.<p>We're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology. We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you!<p>Dave Hahn \ndave.hahn@twosigma.com \n<a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1351779670,"type":"comment"},{"by":"streeter","dead":true,"id":4727292,"parent":4727241,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons. Our top-100 app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some passionate people to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel Partners, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1351775717,"type":"comment"},{"by":"bentaber","dead":true,"id":4728195,"parent":4727241,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour. We're looking for developers and engineers up and down the stack at all levels.","time":1351785879,"type":"comment"},{"dead":true,"deleted":true,"id":4727924,"parent":4727241,"time":1351782896,"type":"comment"},{"dead":true,"deleted":true,"id":4729160,"parent":4727241,"time":1351796949,"type":"comment"},{"by":"nflath","dead":true,"id":4728237,"parent":4727241,"text":"Menlo Park, CA - FULLTIME, INTERN, H1B welcome<p>OptumSoft (<a href=\"http://www.optumsoft.com/jobs.html\" rel=\"nofollow\">http://www.optumsoft.com/jobs.html</a>)<p>Our company is a startup focused on redefining the way distributed applications are developed. We believe existing mechanisms for programming distributed systems are difficult and error-prone. To solve this, we invented a development platform to construct high-performance large-scale applications, and we are building applications using this framework to validate our beliefs.<p>We already have customers using our software in production environments.<p>We're looking for engineers with C++ development experience that have an interest in distributed systems and/or compilers.<p>If you're interested, please email me - nflath@optumsoft.com","time":1351786361,"type":"comment"},{"by":"ryporter","dead":true,"id":4727339,"parent":4727241,"text":"Palo Alto, CA. Full time. H1B okay.<p>AMA Capital trades billions of dollars per day in the foreign exchange market.<p>We are all engineers, and we design and implement our own trading strategies and infrastructure, down to the networking code that ties us in to financial markets.<p>We are a very small team (I am currently the only employee). We will add one or two engineers to our team in the coming months and are looking for people who will focus on strategy or on infrastructure.<p>No experience or specific knowledge of finance is required. However, you do need to be at least interested in financial markets and to be able to implement your strategies carefully in C++.<p>More details at <a href=\"http://amacapital.net/careers.html\" rel=\"nofollow\">http://amacapital.net/careers.html</a>","time":1351776442,"type":"comment"},{"dead":true,"deleted":true,"id":4728132,"parent":4727241,"time":1351785232,"type":"comment"},{"by":"TriggitJobs","dead":true,"id":4764104,"parent":4727241,"text":"San Francisco (SOMA: Full time) Triggit an early stage start-up is seeking C/C++ engineer who has experience working with high frequency data. This position would work with our CTO on our ad serving platform.<p>Job description: <a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a>\nAny questions, feel free to email Joanne@triggit.com","time":1352486176,"type":"comment"},{"by":"TriggitJobs","dead":true,"id":4745170,"parent":4727241,"text":"San Francisco: Sr. C/C++ Engineer: Ad Serving Platform<p>Comfortable working on large and high frequency systems. Work directly with our CTO.<p>Apply at: <a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a>","time":1352141662,"type":"comment"},{"by":"gadventures","dead":true,"id":4728558,"parent":4727241,"text":"Toronto: System Integration Engineer<p>Our team is excited to work at G Adventures because we love tech and we love travel. We are primary drivers of the technical decisions in an industry that is traditionally non-technical. We enjoy working in an open source environment with the ability to choose the right tools for the job. The complexities of the product (adventure trips) are beyond typical online goods and there are many challenges for any interested programmer, with plenty of room for innovation to disrupt the industry standard.<p>This opening specifically pertains to our internal ERP systems and the transportation of data between them using ETL practices, with the ultimate goal of increasing efficiency across departments and facilitating the reporting of sales and financial data that is invaluable to the business.<p>Our team is enthusiastic and involved in the Toronto tech scene, attending conferences such as DemoCamp, AndroidTO, EcommerceCamp, PyCon, and DjangoCon. Beyond the tech world, there are great travel perks and a vibrant entrepreneurial culture. G Adventures remains wholly owned by its founder, Bruce Poon Tip, which fosters an environment akin to a nimble start-up, with the perks of an established company, but without the long hours.<p>OUR ENVIRONMENT:<p>* You will be working with a PC, but most of the organization uses Macs<p>* Tools are your choice, but we have some recommendations (we love open source!)<p>* Everyone on our development team has an entrepreneurial spirit that we look for in new hires. You should be passionate about technology and trying new ideas<p>RESPONSIBILITIES:<p>* Actively assist in the development and testing of integration processes between multiple systems using Pervasive Data Integrator<p>* Maintain existing code and implement patches and new functionality as needed<p>* Apply best practices to ensure data integrity across systems<p>* Perform low to moderate level database administration (PostgreSQL 9.1, MS SQL Server 2008)<p>* Work with internal departments to identify business requirements<p>* Collaborate with other developers to aid in decision making processes and foster improvements<p>* Research new or existing technologies that would benefit system users<p>REQUIREMENTS:<p>* Bachelor's Degree in MIS, IT, Computer Science or related field. Equivalent technical experience may be substituted for educational requirement<p>* 1+ years experience in data integration and ETL<p>* 2+ years experience with relational databases and strong SQL knowledge<p>* Preferred experience with the following technologies and systems:<p>     <i></i> Pervasive Data Integrator<p>     <i></i> MS Dynamics GP<p>     <i></i> Web Services<p>     <i></i> XML<p>     <i></i> Java<p>     <i></i> VB scripting<p>     <i></i> Python<p>* Familiarity with modern source control systems like SVN or git<p>* Knowledge of financial accounting a plus (Ledgers, Accounts Receivable, Accounts Payable, etc.)<p>* Ability to learn quickly and think abstractly<p>* Continually seeks opportunities to increase product quality and customer satisfaction with a demonstrated fanatical attention to detail<p>Become a key player at one of the world’s top tour operators. Launch exciting initiatives in a global company with significant growth opportunities. A competitive salary, health benefits including major medical insurance, dental, life insurance, vacation time and unique travel opportunities are offered.<p>If you have what it takes and want to join an innovative company with the most creative travel product on Earth then apply now!<p>To apply you must hold appropriate citizenship or documents permitting you to reside and work in the Canada<p><i></i><i>We thank all interested candidates however only those chosen for an interview will be contacted.</i><p>Apply for this position here: <a href=\"https://gadventures.wufoo.com/forms/employment-application/\" rel=\"nofollow\">https://gadventures.wufoo.com/forms/employment-application/</a>","time":1351789894,"type":"comment"},{"by":"cmalpeli","id":4727974,"kids":[4731317],"parent":4727241,"text":"Tons of rails jobs here: <a href=\"http://rorjobs.com\" rel=\"nofollow\">http://rorjobs.com</a><p>- Braintree\n- Adaptive Labs\n- New Relic\n- DZAP/Lease Labs<p>etc","time":1351783472,"type":"comment"}]}