{"comments":[{"by":"apaprocki","id":3538920,"parent":3537881,"text":"New York City / London - Bloomberg LP (<a href=\"http://www.bloomberg.com/careers\" rel=\"nofollow\">http://www.bloomberg.com/careers</a>)<p>We aggregate, scrub, produce, analyze, distribute all of the data in the world that drives our market economies. We know how to process data efficiently and at an enormous scale. We apply the same principles of dealing with market data to other sectors such as government, law, and even sports. We hire people that thrive on challenges and can hack on systems to meet these challenges in the best way possible.<p>We run our own datacenters, containing the biggest/best hardware available in the world. We run one of the largest private networks in the world and connect to more primary data sources than anyone else. Incoming market data rates exceed 45 billion messages a day.<p>If these challenges interest you, check the listings online for something that sounds interesting, apply mentioning me, and e-mail me to get in contact.","time":1328117128,"type":"comment"},{"by":"dotBen","id":3538772,"kids":[3538829],"parent":3537881,"text":"Austin, TX [US/Canada/EU remote ok] - WP Engine (<a href=\"http://wpengine.com\" rel=\"nofollow\">http://wpengine.com</a>)<p>The only managed WordPress platform invested in by Automattic, hosting WordPress for the likes of Foursquare, Asana, Soundcloud and many big name household brands. Security and scalability is what gets us going, along with being part of the WordPress and OS communities.<p>We're still a small (~7 person), funded startup looking to expand the team due to the tremendus growth we've seen over the past 12 months. We currently have positions for:<p>PHP Software Engineers<p>* Bringing the highest level of quality and best-practice to PHP engineering.<p>* Developing both WordPress-code <i>(some of which will be submitted to the open source project)</i> and internal customer-facing projects.<p>Linux Server Admins<p>* We run our own bare-metal hardware because we're so optimized for speed, yet we deploy new servers all the time due to our growth.<p>* You are confident working with high-availability SOA clusters of memcache, varnish, nginx, apache, mysql, etc.<p>* You want to automate the shit out of everything - we do too!<p>You can find out more about what we do, how we do it and why we do it at <a href=\"http://wpengine.com/careers/\" rel=\"nofollow\">http://wpengine.com/careers/</a> - where you can also find out more about our positions.<p>As you would expect we offer a competitive salary, equity, benefits, and a fun environment to work in.<p>You can email your resumes to ben [at] wpengine .com","time":1328115323,"type":"comment"},{"by":"aguynamedben","id":3539769,"kids":[3540781],"parent":3537881,"text":"San Francisco, CA or Portland, OR - Engineers and business people<p>Urban Airship is hiring all kinds of engineers and business people in San Francisco and Portland.  We have a travel program between the cities, so you'd get to know 2 badass cities.<p>Urban Airship helps mobile developers send push notifications at high volumes across iOS, Android, Blackberry, WP7, Kindle, etc.<p>- 10 <i>billion</i> push notifications sent. We're sending about 2.5 billion per month now.<p>- Our systems are engineered to send about 50,000 push notifications per second.  We want to \"light up a stadium in a second\".<p>- We have huge customers like The New York Times, ESPN, USA Today, Groupon, LivingSocial, BET, etc.<p>- We're about 50 people and just raised $15M from Intel, Verizon, and SalesForce.<p>- Working on advanced segmentation of users to send smarter push notifications.<p>- Great, hardworking leadership, one of the most important things in a startup.<p>- Ping pong showdowns.  Lagunitas keg and bourbon in the office.  Fun, connected, smart, and badass co-workers that are 100% startup.<p>The formal job listings are here: <a href=\"http://urbanairship.com/company/jobs/\" rel=\"nofollow\">http://urbanairship.com/company/jobs/</a> but we're hiring smart engineers with a broad range of skills.<p>Hit me up at ben (at) &#60;companyname&#62; (dot) com if you're interested!","time":1328128227,"type":"comment"},{"by":"robinwarren","id":3538565,"parent":3537881,"text":"Haven't seen anyone post this yet (seemed helpful last month) so will jump in with a summary of startup/developer job boards from around the world, most of them are broadly recruiter free:<p>NB: Max Masnick has a big round up of developer jobs boards here:<p><a href=\"http://www.maxmasnick.com/guides/jobs/\" rel=\"nofollow\">http://www.maxmasnick.com/guides/jobs/</a><p>======================<p>World wide:<p>Github <a href=\"http://jobs.github.com\" rel=\"nofollow\">http://jobs.github.com</a><p>Jobs Tractor (Developer Jobs - run by me) <a href=\"http://jobstractor.com/\" rel=\"nofollow\">http://jobstractor.com/</a><p>======================<p>US:<p>Crunchboard <a href=\"http://www.crunchboard.com/jobs/\" rel=\"nofollow\">http://www.crunchboard.com/jobs/</a><p>Startuply <a href=\"http://www.startuply.com/\" rel=\"nofollow\">http://www.startuply.com/</a><p>YC Company Jobs: <a href=\"http://news.ycombinator.com/jobs\" rel=\"nofollow\">http://news.ycombinator.com/jobs</a><p>======================<p>UK:<p>CoderStack <a href=\"http://www.coderstack.co.uk/startup-jobs\" rel=\"nofollow\">http://www.coderstack.co.uk/startup-jobs</a><p>Mind The Product (Product Management Jobs) <a href=\"http://mindtheproduct.com/jobs/\" rel=\"nofollow\">http://mindtheproduct.com/jobs/</a><p>Work in Startups <a href=\"http://www.workinstartups.com/\" rel=\"nofollow\">http://www.workinstartups.com/</a><p>Enternships - (Startup Internships) <a href=\"http://www.enternships.com/en/enternships\" rel=\"nofollow\">http://www.enternships.com/en/enternships</a><p>======================<p>Germany:<p>Berlin Startup Jobs <a href=\"http://berlinstartupjobs.com/\" rel=\"nofollow\">http://berlinstartupjobs.com/</a><p>======================<p>Canada:<p>StartupNorth <a href=\"http://jobs.startupnorth.ca/\" rel=\"nofollow\">http://jobs.startupnorth.ca/</a>","time":1328113188,"type":"comment"},{"by":"vtrac","id":3539656,"parent":3537881,"text":"Austin, TX / NYC, NY / London, UK<p>Bazaarvoice is hiring for a bunch of positions - big data software engineers, front-end engineers, DevOps, etc. Ping me for more info.<p>DevOps Spec:<p>Who We Want:\nBazaarvoice serves traffic on some of the biggest websites on the internet. Every day our content is served to tens of millions of people making tens of thousands of requests per second, resulting in tens of thousands of gigabytes of traffic. Our request logs alone add up to almost 1TB daily. If the thought of doubling these numbers excites you, we'd love to hear from you.<p>Responsibilities:\n* Develop internal tools and processes to maintain stability and performance of our infrastructure\n* Work with Development teams to build applications in an Operationally sustainable way\n* Design cross-datacenter, world-wide systems with a high availability mindset\n* Research, analyze and propose new technology solutions for Bazaarvoice's infrastructure\n* Make things go faster<p>Skills and Experience Necessary for the Role:\n* Bachelor's degree in CS, EE or MIS; or equivalent experience\n* 5+ years experience with LAMP development/administration\n* Hands-on scripting with shell &#38; Python/Ruby/Perl\n* Thorough understanding of TCP/IP networking &#38; DNS\n* Excellent project management, communication, prioritization and analytical skills\n* Strong customer service mindset<p>Technologies:\n* Linux\n* Tomcat\n* Solr/Lucene\n* MySQL\n* Amazon Web Services (EC2, S3, VPC)<p>Bonus experience:\n* Puppet/Chef\n* Hadoop/BI/Big Data\n* Cassandra/Riak\n* OpenStack/Eucalyptus\n* Open source contributions","time":1328127009,"type":"comment"},{"by":"ahuibers","id":3540639,"parent":3537881,"text":"Mountain View, CA - Full Time and Intern<p>Want to work on a product that is used and loved by millions?<p>Bump Technologies is the developer of the Bump app available on iOS and Android.  Bump allows users to exchange contact info, photos, and more, simply by fist bumping phones together.  We now have more than 75mm downloads and are growing quickly.  Objective C, Cocoa, Java, Scala, Python, Diesel, Redis, Riak, and Haskell are just some of the languages/technologies we use.<p>* Android developers<p>* iOS developers<p>* Backend (python) developers<p>Internships in Android, iOS, backend, data analytics, product, and design.<p>At Bump, we offer a fun, collaborative working environment.  You will be challenged to come up with creative solutions to interesting problems and own your own project.  The designs you make and the code you develop will be used by our tens of millions of active users.  We have been working on some new products and features that we are planning to launch in 2012, so it is a really exciting time to join our team.  Check out our tech blog and intern blog on our website to read about some of the cool things we are working on.<p>For more information and to apply online, visit our website <a href=\"http://bu.mp/jobs\" rel=\"nofollow\">http://bu.mp/jobs</a>.","time":1328139030,"type":"comment"},{"by":"ashrust","id":3539369,"parent":3537881,"text":"YC W12 Company Looking for Frontend Engineer, Mountain View - Full time.<p>We're looking for a talented and determined front end dev to lead our UI efforts.<p>Skills: HTML &#38; CSS, OO Javascript (we use Backbone), Git<p>Nice to have: Photoshop/Illustrator, for slicing and dicing designs | PhoneGap/Trigger, for our mobile apps | Python, or a desire to learn quickly (we use Django) | Heroku experience<p>What we're doing: We're building simple tools for business to communicate with their customers. We have hundreds of users and are sending thousands of messages a week.<p>What you'll be doing: Working closely, and at speed, with our small team and toolset to take our rich mobile and desktop clients to the next level, in time for demo day. This will likely mean you'll be learning a lot and most of it will on the job.<p>Our Philosophy: We believe in building wonderful products and taking care of our people. We expect a lot of each other but we wouldn't want it any other way. We're hungry and we need you to be too.<p>We're based in Mountain View, CA, and while we're flexible on remote working, you'll need to be around the office.<p>If you're interested in being more than a cog in the machine, please drop us a line: ash [at] ashrust [dot] com","time":1328122759,"type":"comment"},{"by":"kuang","id":3540692,"parent":3537881,"text":"Berkeley/San Francisco - Full-time<p>Captricity transforms stacks of paper forms into structured data faster and cheaper than anyone else. Our technology can greatly improve the efficiency of low-resource organizations working in the world's most disadvantaged communities. Our first customers work in Mali, Ghana and Sierra Leone. We use computer vision, machine learning and information-theoretic principles to guide an army of online workers (MTurk for now). Our workers love our tasks. Captricity has 5 full-timers, top-notch investors and seed-funding. The product is in private-Beta.<p>If you want to save the world, and have shipped complex, production web-services / user-experiences, drop us a line -- we're looking for:<p>1) a senior engineer to be the lead member of our technical staff.\n2) our first full-time UX designer<p><a href=\"http://www.captricity.com/jobs\" rel=\"nofollow\">http://www.captricity.com/jobs</a><p>More on the role of data in low-resource communities:\n<a href=\"http://www.eecs.berkeley.edu/~kuangc/publications/cidr11-first_mile.pdf\" rel=\"nofollow\">http://www.eecs.berkeley.edu/~kuangc/publications/cidr11-fir...</a>","time":1328139947,"type":"comment"},{"by":"pquerna","id":3539432,"parent":3537881,"text":"San Francisco, CA – interns, remote, h1b, whatever…..<p>Rackspace\n<a href=\"http://www.rackertalent.com/san-francisco\" rel=\"nofollow\">http://www.rackertalent.com/san-francisco</a><p>Here at Rackspace in San Francisco we are hiring across the board. We are looking for Python/Django Engineers, Front-End Javascript Engineers, Pyhton/Twisted Engineers, Node.js Engineers, Test Devleopers, DevOps. Project Managers, you name it.<p>We have an awesome new space in the SOMA district of San Francsico, and we have lots of room!<p>We are open to hiring interns, remote workers or candidates on H1b visas depending on the role.<p>We are working on some very exciting cutting edge products that are highly visible and will be products used across our entire organization and be used by all of our customers.<p>If your interested please feel free to reach out to me &#60;paul.querna@rackspace.com&#62; or Blake Haggerty &#60;Blake.Haggerty@Rackspace.com&#62;.<p><a href=\"http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2011/11/17/BUOG1M0K6A.DTL\" rel=\"nofollow\">http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2011/11/17/...</a>","time":1328123800,"type":"comment"},{"by":"mpakes","id":3538977,"parent":3537881,"text":"San Francisco, CA [Remote Considered] - Coffee Table (<a href=\"http://coffeetable.com\" rel=\"nofollow\">http://coffeetable.com</a>)<p>Coffee Table is looking for iOS Developers to join our team in changing the world of retail commerce. We're a small, driven, entrepreneurial team, so you'll have an opportunity to make a big impact. Catalog shopping is a $270B industry with 20B catalogs sent every year, and we believe that Coffee Table has a unique opportunity to transform the industry by introducing a new, engaging way to shop using mobile devices.<p>Our only hard requirements are that 1) You're smart, 2) You get things done, and 3) You have experience with application development in C, C++, Objective-C, Java, or C#.<p>iOS Development experience, ideally with one or more apps in the App Store, Experience with Objective-C, Cocoa Touch, Core Foundation, Core Animation, and Design/UX skills are highly preferred, but not strictly required.<p>If this describes you (or anyone you know), contact us at jobs@coffeetable.com.","time":1328117770,"type":"comment"},{"by":"bartman","id":3539553,"parent":3537881,"text":"Berlin, Germany (Remote considered) FULL TIME<p>NVIDIA ARC GmbH is looking for a senior software engineer to join our GPU cloud computing project. We're building a rendering solution that greatly reduces the upfront costs for rendering and design studios by seamlessly integrating cloud computing into the 3D modelling and rendering workflow. User response so far has been great - see these (slightly outdated) videos to get an impression: [1] [2]<p>We're a team of five engineers looking for an engineer with outstanding C++ and network programming abilities to take over the client-side part of this project. You should be familiar developing in multi-threading applications and integrating with binary protocols and RESTful APIs. Experience with EC2 and HTML/Javascript/Coffeescript is a plus.<p>Technologies we use are AWS EC2, (unbiased/consistent) real-time raytracing, C++, CoffeeScript/Javascript, Python, PHP, HTML, Flex, RESTful APIs, single-command deployments. You'll have a lot of freedom in working with technologies you like and prefer.<p>We prefer somebody who's in Berlin or willing to move, but are willing to consider remote as an option for the right candidate.<p>Personally, I've been with NVIDIA for 4 years and enjoy the flexibility and freedom I'm given, both on as an engineer and employee (for example, moving to the US to study abroad &#38; transfer to NVIDIA US for that time was encouraged and quite easy).<p>Feel free to email me (see profile) or apply online at [3].<p>[1] <a href=\"http://www.youtube.com/watch?v=NSHkJfDrsf8\" rel=\"nofollow\">http://www.youtube.com/watch?v=NSHkJfDrsf8</a>\n[2] <a href=\"http://www.youtube.com/watch?v=-4CoC1HL0Eo\" rel=\"nofollow\">http://www.youtube.com/watch?v=-4CoC1HL0Eo</a>\n[3] <a href=\"http://careers.nvidia.com/pljb/global_jsp/applicant/DisplayJob/JobDetails.jsp?display=1&#38;pljbHome=/nvidia/nvidiaemployment/applicant/index.jsp&#38;id=6853\" rel=\"nofollow\">http://careers.nvidia.com/pljb/global_jsp/applicant/DisplayJ...</a>","time":1328125497,"type":"comment"},{"by":"ginkgoo","id":3538124,"parent":3537881,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology.<p>Ginkgo BioWorks is a well-funded MIT spinout that genetically engineers organisms that make the world better. Stop building soulless web apps and work on something that matters: <a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a><p>apply here: <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1328107705,"type":"comment"},{"by":"pretzel","id":3538157,"kids":[3538443,3538485],"parent":3537881,"text":"Qubit\nFulltime - London (Soho)<p>At Qubit - <a href=\"http://www.qubitproducts.com/\" rel=\"nofollow\">http://www.qubitproducts.com/</a> - we're helping some of the biggest companies in UK understand their data and providing them with actionable intelligence. Founded by 4 ex-Googlers 2 years ago, we're looking for Front-end/Infrastructure/Statistical engineers to help build our core infrastructure to find deeper insights into our huge data sets.<p>We mainly use Java, to develop our Hadoop pipeline on AWS, and JavaScript, both in browser and on our nodejs/redis servers, with a bit of R, Python and what not in the mix.\n2012 is going (to continue) to be an exciting time for our company and we'd love to have a bunch more people help us grow!<p>Have a chat with us at hiring+yc@qubitdigital.com and let us know what you are looking for to get the ball rolling.","time":1328108177,"type":"comment"},{"by":"datageek","id":3538553,"parent":3537881,"text":"Kaggle - San Francisco, CA<p>We're looking for:<p>* Data scientists<p>* Developers (REMOTE)<p>* Technical sales<p>More information at <a href=\"http://www.kaggle.com/pages/jobs\" rel=\"nofollow\">http://www.kaggle.com/pages/jobs</a><p>Kaggle has just closed a large Series A ($11.25m). Our early employees will help shape Kaggle's direction and grow along with the company. Regardless of the position, you should have a strong interest in data science and the intellectual curiosity to engage with competition clients from a wide variety of fields.<p>Kaggle is aiming to build a meritocratic marketplace that will change the way data science gets done. Read more at: <a href=\"http://www.businessweek.com/magazine/kaggles-contests-crunching-numbers-for-fame-and-glory-01042012.html\" rel=\"nofollow\">http://www.businessweek.com/magazine/kaggles-contests-crunch...</a>","time":1328112993,"type":"comment"},{"by":"squirrel","id":3538207,"parent":3537881,"text":"London (UK) and Boston (US).<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development.<p>We use Java, Scala, and some Groovy; we always write tests first and pair on most coding tasks. Developers have Linux workstations with at least two monitors. We have weekly lightning talks that cover finance and technical topics.<p>Some of you may know us from our sponsorship of Hacker News meetups in London. See <a href=\"http://devblog.timgroup.com\" rel=\"nofollow\">http://devblog.timgroup.com</a> and <a href=\"http://www.timgroup.com/careers\" rel=\"nofollow\">http://www.timgroup.com/careers</a> for more about us.<p>Note we recently changed our name from youDevise to TIMGroup but we're still the same folks!","time":1328108854,"type":"comment"},{"by":"makeramen","id":3538465,"kids":[3538533],"parent":3537881,"text":"Mountain View - drchrono.com (YC W11) [full time and interns]<p>We're looking for more engineers and salespeople to help us revolutionize healthcare through mobile and web interfaces. Our stack includes Python/Django, iOS, and Android, but you don't need to be an expert, just ready and willing to learn fast!<p>Our product supports thousands of doctors who depend on our systems daily to provide quality care to their patients, iPad in hand.<p>The usual startup benefits included: competitive salary, healthcare, whatever hardware you need to be most productive.<p>email: jobs@[our-domain-name]<p><a href=\"http://drchrono.com/jobs/\" rel=\"nofollow\">http://drchrono.com/jobs/</a>","time":1328112123,"type":"comment"},{"by":"vnorby","id":3539508,"kids":[3539676],"parent":3537881,"text":"Menlo Park, CA. Full time.<p>Lead Designer at Everyme (YC S11)<p>Everyme is the best way to keep in touch (<a href=\"https://everyme.com\" rel=\"nofollow\">https://everyme.com</a>). We are looking for an extraordinary designer who has designed for mobile devices and the web. Experience with HTML/CSS is NOT necessary. You will be paid market salary and you will have generous equity. You will be treated like a god and your designs will be followed to the pixel. You will work with a team of 5 amazing engineers. Last month we hired a web engineer from the who's hiring post.<p>Please email me at vibhu@everyme.com with your portfolio.","time":1328124794,"type":"comment"},{"by":"brandonb","id":3538949,"parent":3537881,"text":"San Francisco, CA - Sift Science [fulltime or intern, H1B ok]<p>Sift Science is aimed at bringing machine learning to the masses. Our initial product is an API to detect online fraud. Last year, there was $2.4B in credit card fraud, 70% of it from organized crime, and it literally kills companies (see <a href=\"http://techcrunch.com/2011/11/10/brandstack-heads-for-the-deadpool-blames-credit-card-fraud/\" rel=\"nofollow\">http://techcrunch.com/2011/11/10/brandstack-heads-for-the-de...</a>). We're using large-scale classification techniques, paired with elegant visualization tools, to catch fraudsters before they make off with our customer's cash. Our pilot customers are technically savvy and highly motivated to work with us as we develop our beta product.<p> We're a team of ex-Google and ex-Zillow engineers who previously worked on speech recognition, ads targeting, payments, sentiment analysis, and more. We're backed by top angel investors who \"get it.\" We like to laugh, push each other, and we do fun events with other companies in the broader San Francisco startup community to keep things fresh.<p>If you have expertise or passion for any of the following fields, we want you:\n* Machine learning (including applications like computer vision)\n* Natural language processing\n* Data management (e.g., large-scale databases, map reduce, data fusion, data mining, etc.)\n* Data visualization<p>If this sounds interesting, shoot a resume over to jobs@siftscience.com!","time":1328117466,"type":"comment"},{"by":"sequoia","id":3539127,"kids":[3539173,3539244,3539174],"parent":3537881,"text":"I'm sure this has been done but out of curiosity I wrote a (highly unscientific) little script to count the times that some languages are mentioned herein[1].  The results:<p><pre><code>    java: 53\n    python: 28\n    ruby: 16\n    php: 14\n    node: 9\n</code></pre>\nWinnah: Java! :)<p>EDIT: Thank you goo!\nTake 2, maybe it will work better:<p><pre><code>    java: 42\n    python: 38\n    javascript: 34\n    ruby: 24\n    php: 16\n    node: 15\n</code></pre>\n[1] <a href=\"https://gist.github.com/1718350\" rel=\"nofollow\">https://gist.github.com/1718350</a> [updated for]","time":1328119451,"type":"comment"},{"by":"bendilts","id":3540573,"kids":[3540842],"parent":3537881,"text":"Salt Lake City, UT. - <a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http://www.lucidchart.com</a><p>LucidChart is an HTML5 diagramming application that proves web apps don't need to be pale imitations of their full-featured desktop counterparts. Real-time collaboration and full versioning history aren't our only advantages; users tell us they like LucidChart because it's faster, easier, and smoother than Visio and Omnigraffle.<p>We need great engineers who want to work in a Silicon Valley startup, but would rather live 15 minutes from the ski resorts in Utah. We have one of the largest Javascript codebases on the Internet supporting LucidChart's client, and are using Scala, PHP, node.js, MongoDB, and MySQL to power our servers. Experience in one or more of these areas is helpful, but we're most interested in people with inhuman problem solving skills.<p>We currently have 9 full-time employees, including 6 engineers. That ratio reflects the focus of our organization -- we are a software company, and we live or die on the strength of our engineering team. We think we have the strongest engineering team in Utah, and want to add at least 3-5 people this year.<p>All hires are made by unanimous decision of the current team. If you join us, you can know that everyone here wants you here.<p>Send resumes, github profiles, or whatever else might be relevant to jobs at lucidchart dot com.","time":1328138127,"type":"comment"},{"by":"bjelkeman-again","id":3538881,"parent":3537881,"text":"Amsterdam, Netherlands [UTC-9 to UTC+2 remote ok] - Akvo Foundation (<a href=\"http://www.akvo.org\" rel=\"nofollow\">http://www.akvo.org</a>)\nFull time or part time.<p>Akvo is a small non-profit foundation, but we are not your ordinary NGO.  We develop open source web and mobile software, which we run as a service, and build networks of skilled partners that can change the way development aid is allocated, reported and monitored.<p>There is tremendous interest in our services and we are actively working with hundreds of NGOs, governments and large institutions, like the Worldbank, UN and corporates. For a flavour, check our blog out: <a href=\"http://www.akvo.org/blog/?cat=3&#38;paged=2\" rel=\"nofollow\">http://www.akvo.org/blog/?cat=3&#38;paged=2</a><p>We are a small team (20), well funded, and are expanding our technical team to cope with all the new and exciting stuff.<p>If you are good at a combination of (any combo will do): Java, Google Web Toolkit, Google app engine, python, Django, HTML/CSS/JavaScript, dev/ops, Linux sys admin, QA, Wordpress (themes/plugin building/php); tech doc, well, then I have open positions. Half time to full time. Working from home. If you like a more formal job description we have them here:<p>* Front-end web designer and developer (HTML / CSS / Javascript)<p>* Developer / system administrator<p>* Java developer<p>* Quality Assurance (not listed on jobs page yet, but coming)<p><a href=\"http://www.akvo.org/web/jobs\" rel=\"nofollow\">http://www.akvo.org/web/jobs</a><p>Don’t hesitate to contact me with any questions.","time":1328116548,"type":"comment"},{"by":"knerd83","id":3537969,"kids":[3538611,3538086],"parent":3537881,"text":"Knewton: New York (NYC) funded startup seeking software engineers interested in functional programming, machine learning, distributed systems, and \"big data\" problems. +ONSITE, +REMOTE, +FULLTIME, +INTERN. I am not personally sure (I'm a software engineer) about H1-B but I will refer any visa questions to someone who can answer them.<p>Investors include Peter Thiel (Founder's Fund), Reid Hoffman, and Pearson, a leader in educational publishing. We were recognized as a Technology Pioneer for 2011 by the World Economic Forum in Davos and one of the top 25 best places to work by Crain’s New York Business.<p>We have about 80 employees right now. We pay full market salaries plus stock options, and you can take as much vacation as you need. Hours are typically 40-50 per week.<p>Our product is an adaptive learning platform, which means we use machine learning and \"big data\" techniques to deliver an individualized education to each student. Our eventual goal is to make a high-quality, adaptive education available to everyone in the world. The product is used by Arizona State University right now, and we recently signed a deal with Pearson to power many of their products.<p>Our code is a mix of Python, Java, and Scala. Most of our existing code is in Python, but we're working to scale up in a major way, which involves a migration to the JVM. Currently this involves a mix of Java and Scala, but our long-term goal is to move toward Scala. Consequently, we're really hot for Scala talent right now. Anyone who has experience taking Scala into production we would love to talk to right now.<p>You can reach me at knerd83 at gmail.com, and I'm a software engineer so I'll be able to answer any of your technical questions (e.g. why we're interested in Scala). Reach out if any of the following interest you:<p>* Using technology to democratize education.<p>* Machine learning and data mining, including approaches such as probablistic graphic models (PGMs), Support Vector Machines (SVMs) and Monte Carlo Markov Chains.<p>* Functional programming (cf. Scala and Python).<p>* The Java Virtual Machine (JVM) internals and performance optimization.<p>* NoSQL databases (Cassandra and Redis).<p>* Thrift (the RPC protocol).<p>* Cloud computing (Amazon Web Services, Unix) and distributed systems.","time":1328105662,"type":"comment"},{"by":"stefanobernardi","id":3538226,"parent":3537881,"text":"San Francisco, CA. Full time. Interns. (H1B ok for the right candidates)<p>Betable<p>We're building a platform for developers to easily implement real-money betting in their games and apps.<p>Stack is Rails/jQuery/PG/Node but expanding VERY fast, so as long as you're super smart we're interested in meeting you no matter your favorite tools of the trade.<p>Looking for:<p>* Platform/Backend Engineers<p>You ideally have experience working on APIs or web services, mastery of either Ruby, Python, Perl or Scala and an advanced knowledge of RESTful services, OAuth and JSON.<p>You will help us build the whole platform and the developer-facing APIs.<p>* iOS/Android Engineer<p>You should have experience building SDKs in objective C, Java or C++\nGame development experience and advanced knowledge of RESTful services, OAuth and JSON are big pluses.<p>--<p>We're working on some seriously hard and interesting problems, and need help with it. Our product is still in private beta but the demand is crazy and we already need to scale fast, and as one of our first engineers you'll have a strong impact on the code and product. We can guarantee a fun ride.<p>We're very small but are well backed by the best-of-the-best so you get the best of both worlds: an amazing team, generous equity, a competitive salary and health/dental. A fully stocked kitchen, team-cooked lunches, new computer/monitor and team trips to Vegas make up the rest of the package.<p>Shoot me an email at stefano [4t] betable.com if you're interested.","time":1328109074,"type":"comment"},{"by":"marcia","id":3539443,"parent":3537881,"text":"Mountain View - Khan Academy (full-timers and interns welcome year-round)<p>Our mission is to provide a world-class education to anyone, anywhere. We already have millions of students learning every month, and we're growing quickly.<p>Our students answer over 2 million math exercise problems per day, all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>, <a href=\"http://ejohn.org/blog/khan-exercise-rewrite/\" rel=\"nofollow\">http://ejohn.org/blog/khan-exercise-rewrite/</a>), and Sal's videos have been viewed over 117 million times. We're just getting started feeding this data we're collecting back into the product to help our users learn more (<a href=\"http://david-hu.com/2011/11/02/how-khan-academy-is-using-mac...\" rel=\"nofollow\">http://david-hu.com/2011/11/02/how-khan-academy-is-using-mac...</a>). If you're interested in data, analytics, and education, this is a dream gig.<p>Plus, it's one of the highest educational impact positions you can imagine. We're hiring all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1328123939,"type":"comment"},{"by":"SatvikBeri","id":3538755,"parent":3537881,"text":"San Jose, CA; Austin, TX; New York, NY; Boston, MA - Lattice Engines (<a href=\"http://www.lattice-engines.com\" rel=\"nofollow\">http://www.lattice-engines.com</a>)<p>(Software, Data, and Design roles-see <a href=\"http://www.lattice-engines.com/company-careers.htm\" rel=\"nofollow\">http://www.lattice-engines.com/company-careers.htm</a>)<p>Lattice Engines is the leader in B2B sales intelligence software enabling Fortune 5000 companies to Sell Smarter and achieve a 6-14% increase in sales productivity within one year of deployment through Intelligent Targeting, Contextual Conversations and Measurable Execution. Lattice Engines software integrates internal, external and Lattice Engines proprietary data to identify customer patterns and trigger\nevents that influence buying decisions. Our software is powered by predictive analytics, advanced mathematical algorithms tuned specifically to B2B sales and marketing objectives. Our solutions integrate seamlessly with existing CRM and Marketing Automation systems to deliver B2B sales intelligence directly to your reps.<p>Please contact sberi@lattice-engines.com with the subject line \"Hacker News\"-you'll be given preference over applicants who apply normally through the website.","time":1328115196,"type":"comment"},{"by":"glou","id":3538409,"parent":3537881,"text":"Quirky - Full Time - NYC<p>Quirky is a social product development company where people from all around the world submit invention ideas to our website.  With the help of our passionate community, we select the best ideas each week to develop together and try to bring them to market.  If an idea actually makes it, then everyone who helped along the way gets a piece of the pie.  You can find our products at retailers such as Target and Bed Bath &#38; Beyond.<p>Quirky is a rails shop, and we work with lots of fun technologies like AWS, mongo, iOS and heroku to name a few.  We're a small team that works on lots of big, fun and interesting problems.  We just moved into a brand new, fully custom office space in Chelsea (might be the coolest office you'll find in NYC).  Oh and we also had a reality show on the Sundance Channel last year.<p>We're looking to hire rockstar front end and rails developers.  More details here:<p><a href=\"http://quirky.theresumator.com/apply/\" rel=\"nofollow\">http://quirky.theresumator.com/apply/</a><p>If interested, shoot me an email greg at quirky dot com.  Relocation is available for well qualified candidates (I moved from SF to NYC to work here!)","time":1328111433,"type":"comment"},{"by":"mikebabineau","id":3539105,"parent":3537881,"text":"Rumble - SF Bay Area (Redwood Shores)<p>Lead/senior/mid-level engineers, data scientists, BI, producers, artists, designers, more - <a href=\"http://www.rumblegames.com/careers/\" rel=\"nofollow\">http://www.rumblegames.com/careers/</a><p>Rumble is a developer and publisher of connected games. We were founded in 2011 with a mission to create the most engaging and fulfilling online game experiences on the planet. All of our games are free-to-play and available across your favorite devices and social networks. We are unique in our focus on the gamer audience and our exacting standards around quality gameplay. Our passion is to create experiences that surprise and delight our players. By combining the best of AAA game design with free-to-play accessibility, we believe we will change the way gamers play together.<p>We have an all-star team of game industry veterans from Zynga, Activision, BioWare, Blizzard, Playdom, Electronic Arts, Turbine, FooMojo and RockYou.  Check us out: <a href=\"http://www.rumblegames.com/team/\" rel=\"nofollow\">http://www.rumblegames.com/team/</a> <a href=\"http://www.linkedin.com/company/2326673\" rel=\"nofollow\">http://www.linkedin.com/company/2326673</a>.<p>We are backed by Rick Thompson, Google Ventures, and Khosla Ventures, and recently closed a $15mm series A:<p><a href=\"http://techcrunch.com/2011/12/01/rumble-to-build-and-publish-games-using-15m-series-a-from-google-ventures-and-khosla/\" rel=\"nofollow\">http://techcrunch.com/2011/12/01/rumble-to-build-and-publish...</a><p><a href=\"http://venturebeat.com/2011/12/01/former-ceo-of-bioware-and-pandemic-raises-15m-in-series-a-funding-for-mobile-and-browser-gaming-studio/\" rel=\"nofollow\">http://venturebeat.com/2011/12/01/former-ceo-of-bioware-and-...</a><p>Drop me a line: mike.babineau@rumblegames.com","time":1328119229,"type":"comment"},{"by":"typpo","id":3539482,"parent":3537881,"text":"Mountain View, CA - fulltime or intern<p>Room 77 - <a href=\"https://www.room77.com\" rel=\"nofollow\">https://www.room77.com</a><p>We're changing travel search by giving people full transparency in their search for a perfect hotel stay. Using the staggering amount of data we've collected and analyzed, we'll actually find and request the best hotel room for you.<p>Some projects you'll work on:\n- computer-generating views from any room in the world\n- building the first deep-text hotel search engine (eg. search \"eiffel tower views\" in Paris or \"jetted bathtub\" in New York)\n- super-fast search across all major providers (we show Expedia results faster than Expedia)\n- finding better ways to extract and expose data like hotel freebies and fees<p>...and many other things that contribute to a fast, easy travel planning experience.<p>If you're interested in information retrieval, machine learning, NLP, or computer visualization, you'll have a great time solving brand new problems and creating a genuinely improved and useful hotel search.<p>Check out our jobs page: <a href=\"https://www.room77.com/jobs.html?s=HN\" rel=\"nofollow\">https://www.room77.com/jobs.html?s=HN</a>","time":1328124448,"type":"comment"},{"by":"jayp","id":3538370,"parent":3537881,"text":"Mountain View, CA. Both Full-time and Interns.\n<a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Pattern Insight - a booming startup making code and log analysis tools for a customer base that includes many titans of the tech industry - is hiring software engineers and interns in sunny California. (Relocation options available for full-time positions).<p>We are looking to expand our engineering team by hiring both developers (both systems and application) and QA. For job-specific skills, please see our career page: <a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Our data mining and static analysis technologies have strong research roots, as we grew out of research done at the University of Illinois at Urbana-Champaign. Relatedly, our core engineering team is extremely strong, and as a whole, published over 100+ articles in peer reviewed journals and conferences.<p>Come join us, we are still tiny and looking for people ready and willing to make decisions for our future.","time":1328110970,"type":"comment"},{"by":"jnelson","id":3538075,"parent":3537881,"text":"PhotoShelter - New York, NY<p>PhotoShelter provides tools to help photographers display, market, sell, and distribute their photos. We're a small company with a laid-back atmosphere (we love dogs and cookouts) located right on Union Square, in the heart of the city.<p>We're looking for a back-end engineer to help grow our product. Rather than any buzzwords, we value folks who are passionate about and take pride in their craft. Our back-end stack includes PHP, a bit of C, PostgreSQL, Sphinx and Memcached but we'd welcome inquiries from anyone with experience in designing and writing distributed systems, systems programming, and back-end development in general.<p>Our diverse staff includes veteran engineers from HotJobs and Yahoo, one of Computerworld's 40 Under 40 tech innovators, and even a well-known concert photographer. We offer competitive salaries, stock options, bonuses, great benefits, and try to grab dinner together (on the company!) every few weeks.<p>If you're interested, shoot an e-mail to devjobs@photoshelter.com. Thanks!","time":1328107076,"type":"comment"},{"by":"neodude","id":3539396,"parent":3537881,"text":"San Francisco, CA<p>Pivotal Labs - FULLTIME, INTERN, REMOTE, H1B.<p>We're one of the best agile development consultancies around. We're looking for sharp, empathetic software developers, mainly working in web (Rails) and mobile (iPhone, Android) projects. Past clients include Groupon, Twitter, Google, Gowalla. We also build Pivotal Tracker, an agile project management tool.<p>You don't have to be an expert in Rails or the mobile frameworks to get a job here - as long as you are pleasant to work with and willing to learn, that's good enough. Since we pair every day, you'll pick up what you need to know very quickly. After just a month at Pivotal I felt I had improved leaps and bounds as a developer and learnt a tremendous amount about Rails that I didn't know before.<p>Give me a ping - thomas@pivotallabs.com. Read more about how we work: <a href=\"http://pivotallabs.com/jobs/welcome\" rel=\"nofollow\">http://pivotallabs.com/jobs/welcome</a>","time":1328123201,"type":"comment"},{"by":"dbuxton","id":3538221,"parent":3537881,"text":"Arachnys (<a href=\"http://www.arachnys.com\" rel=\"nofollow\">http://www.arachnys.com</a>)<p>Full time - White Bear Yard, Farringdon, London<p>We're looking for smart Python developers who want to be part of a growing startup solving exciting and technically challenging problems.<p>Our product gathers international press and corporate data and turns it into intelligence for companies doing business in emerging markets.<p>As of Monday, we're now four people (2 1/2 technical :) and looking for our fifth.<p>We'd ideally like someone who could write a thesis on Bayesian classifiers, but we'll consider skilled engineers who can look us in the eye and make us believe that they'll learn. Very specific expertise is not a requirement; enough of a maths/compsci background to call bs on the wrong approach is.<p>Email founders at arachnys.com if it sounds like your sort of challenge. Include links to public code please.","time":1328109025,"type":"comment"},{"by":"alfiejohn_","id":3539628,"kids":[3540181],"parent":3537881,"text":"Melbourne, Australia or Olso, Norway.<p>Opera Software is looking for a System Administrator / System Developer.<p>Opera Software is seeking a talented, engaged System Administrator who thrives in an international product development and production environment.<p>Opera's strong developer culture and hands-on, technical managers make it a unique place to work.<p>Opera email services currently have about 500,000 accounts across our My Opera Mail and FastMail.FM brands. You will be responsible for keeping this commercial email service running with close to 100% availability.<p>Ongoing development and automation of our operational systems is always needed, to keep the administration workload manageable as we grow across geographically distributed data centers.<p>For more info - <a href=\"http://www.opera.com/company/jobs/opening/331/\" rel=\"nofollow\">http://www.opera.com/company/jobs/opening/331/</a>","time":1328126621,"type":"comment"},{"by":"mdkess","id":3538148,"parent":3537881,"text":"Broadway Technology - New York, NY and Austin TX<p>We are a tight, fast and profitable ~50 person software company working in the financial software space. We don't trade - we sell pickaxes to the gold miners, so to speak. Our main product is a high speed distributed system, on top of which we've built a trading platform for algorithms and other software. We are looking for experienced software developers (no finance experience required) - in particular, we really need an awesome UI developer to help build our trading UI and make it fast and beautiful.<p>See our news room for some buzz: <a href=\"http://www.broadwaytechnology.com/press\" rel=\"nofollow\">http://www.broadwaytechnology.com/press</a><p>and apply at: <a href=\"http://www.broadwaytechnology.com/careers\" rel=\"nofollow\">http://www.broadwaytechnology.com/careers</a><p>Also - free lunch and snacks!","time":1328108041,"type":"comment"},{"by":"dman","id":3538242,"parent":3537881,"text":"Enthought - www.enthought.com<p>Python development for scientific applications, financial applications and Python toolset development.<p>Enthought has offices in Austin, New York, Cambridge, Mumbai.<p>If you use Python and love numpy / scipy then Enthought would be a great place for you. Come work with numpy / scipy hackers on solving interesting scientific analysis and data visualization problems. Also we are building the next generation of Python development tools, so there is no shortage of interesting problems to work on. Send applications to jobs@enthought.com and mention that you saw this on the hacker news Feb 2012 thread. Looking forward to working with some of you.<p>If you have any questions about Enthought, what jobs are on offer and what problems keep us up at night feel free to reach out to me at dsharma at enthought dot com","time":1328109234,"type":"comment"},{"by":"klochner","id":3539425,"parent":3537881,"text":"San Francisco, CA - RentMineOnline (FBFund '09, SeedCamp '08)<p>We're revolutionizing the marketing industry for apartment communities. Our company is small, growing and profitable.<p>We're looking for an on-site rails developer (we won't complain if you also like to write javascript).<p>Our stack is:<p><pre><code>   * nginx\n   * passenger/rails\n   * redis\n   * jquery, prototype\n   * amazon rds/sdb/s3\n   * hosted at slicehost\n   * facebook/twitter/linkedin integrations\n   * code hosted on github\n</code></pre>\nCome join our team in the Presidio and start pushing code from day 1. As one of three in-house developers (+2 remote devs), you will have exposure to all aspects of our business, and you will see your work have an immediate and important impact on our operations &#38; bottom line.<p>email kevin@rentmineonline.com","time":1328123734,"type":"comment"},{"by":"numenta","id":3538672,"parent":3537881,"text":"Redwood City, CA - Numenta<p>Build the future of machine learning and big data.<p>Learn more on our website:  <a href=\"http://www.numenta.com/\" rel=\"nofollow\">http://www.numenta.com/</a><p>Job Requirements:<p>* BS or MS in Computer Science, or equivalent experience<p>* Outstanding programming skills, preferably in Python<p>* 3-5 years experience implementing high traffic web applications<p>* 3-5 years experience with high performance systems in a commercial setting<p>* Familiarity with entire web stack: Javascript, HTML, CSS, Memcached, application layer, and databases<p>* Experience with SQL and no-SQL databases<p>* Experience with unix/linux shell<p>* Experience programming Amazon EC2 a plus<p>* Experience with Agile / Scrum and/or test driven methodologies a plus<p>* Able to demonstrate strong intellectual capabilities and significant individual contributions<p>* Excellent written and verbal communication skills<p>Qualified applicants should email a resume and cover letter to resume-web@numenta.com.","time":1328114222,"type":"comment"},{"by":"zukhan","id":3539642,"parent":3537881,"text":"FULLTIME or INTERN. Offices in San Francisco, Boston, and Menlo Park.<p>Delphix (www.delphix.com) is a data virtualization company that does for databases what VMware did for servers - this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud. We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience. Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded? Are you interested in working on the Data, the next big problem in Data Center? Do you thrive on solving difficult technical challenges? Do you take pride in writing beautiful code with a strong attention to detail? Then we are looking for you! Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between. Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1328126755,"type":"comment"},{"by":"js2","id":3538290,"parent":3537881,"text":"Mountain View, CA. Full time. On-site. RockMelt has a few browser developer positions open. RockMelt is based on Chromium.<p>* Mac OS X: Objective-C/C++<p>* Windows: C++<p>* Extensions/platform: Javascript<p>* UX: lead-visual designer<p><a href=\"http://www.rockmelt.com/jobs.html\" rel=\"nofollow\">http://www.rockmelt.com/jobs.html</a><p>Mail me at jay@rockmelt.com if interested.","time":1328109956,"type":"comment"},{"by":"calvarez","id":3539157,"parent":3537881,"text":"San Francisco, CA - Yammer\nThe people who use Yammer regularly tell us that they have better access to information, get less email, collaborate better within and across departments, and feel more valued.<p>We're growing in revenues and customers rapidly.  We really need strong engineering talent but keeping our hiring bar high.<p>We're going to win because we can move more quickly than our competition:\n- weekly releases\n- deep in-house analytics team \n- not wedded to specific technologies\n- only as much process as necessary\n- open and transparent communication across teams and from executive management\n- constant learning<p>Salary, benefits, perks are excellent. <a href=\"http://www.yammer.com/jobs\" rel=\"nofollow\">http://www.yammer.com/jobs</a>","time":1328119864,"type":"comment"},{"by":"dabent","id":3539091,"parent":3537881,"text":"Santa Monica, CA (Los Angeles area)<p>TRUECar.com - TrueCar shows consumers how much people actually paid for a particular new car in their area, then guides them to dealers we've certified. When someone buys from a dealer we've sent them to, we get paid. We already have solid revenues, are well funded and and are growing rapidly. We need lots of technical talent to help us grow.<p>* JAVA - We are looking for Java architects to design and build the technology used to power our production websites, APIs, widgets, and internal tools. This is a chance for you to join a growing company and build something that's going to scale to support millions of users/visitors and provide them with all kinds of data.<p>* Python/Django - Our main site is in Django, which means we need serious talent to help it scale and expand as we continue to grow. Plus, you'll get to work with me.<p>* We also have other technical positions for Front End, Senior Linux Systems Engineer, QA engineer, Java developers and more.  If you're local (in and around Santa Monica) and interested, let me know (email is in profile).<p>* We also have some non-technical openings for senior positions in marketing, customer retention, HR, finance and accounting. Email me for details.<p>My story - moved from Atlanta all the way out to Santa Monica after stopping by the TrueCar booth at PyCon 2011. I started here three month ago and love it. I'm working with a great team that knows how to develop software and for management who seems to \"get it\" with regards to software developers.<p>The Python team in an open workspace that has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>), and all the Santa Monica offices are blocks from the beach. They have great benefits, including company equity, 100% paid family medical, dental, vision, and a healthy 401k. They also offer gym membership reimbursement ($50 a month), 12 holidays, career training, 3 weeks PTO and have a kitchen stocked with fruit, snacks and such. I've honestly never had a job this good. If you're interested, send me your resume. My email is in my profile.","time":1328119076,"type":"comment"},{"by":"cameldrv","id":3538299,"kids":[3540672],"parent":3537881,"text":"Austin, TX<p>DocBookMD (www.docbookmd.com) is a funded, revenue generating Austin startup changing the way doctors communicate using smartphones and tablets.<p>We're looking to bring on a full-time iOS developer to help us make a beautiful, highly functional app.<p>You:<p>* Have at least one app on the app store.<p>* Have a strong sense of pride in your work, and want to write efficient, maintainable code.<p>* Are passionate about making interfaces that are highly functional, yet quick to learn and use (physicians are very busy and are impatient with software)<p>* Have a strong work ethic<p>We offer:<p>* Competitive compensation<p>* An exciting, fast growing work environment<p>* Huge opportunity for professional growth as the company grows<p>* A product that actually matters.  DocBookMD already has saved lives by getting the right information to doctors quickly, so they can make better decisions.<p>kammeyer at docbookmd.com","time":1328110023,"type":"comment"},{"by":"zds","id":3539078,"parent":3537881,"text":"New York, NY or San Francisco, CA<p>DEVELOPER - FULL TIME<p>Codecademy is the easiest way to learn to code.  Since August, more than a million people have used Codecademy to learn the basics of JavaScript and now they can learn Python and Ruby as well.  We're still a small team of six and we're looking for backend and frontend developers to build the education platform of the future.<p>Our stack is Ruby/Rails, MongoDB, with some backbone.js.  We're doing cool stuff like running Python and Ruby environments client-side and we love open source as well.<p>If you're looking to have an incredible impact on the education and future of millions, we'd love to talk to you.  codecademy.com/jobs or email us at jobs (at) codecademy (dot) com.  Thanks!","time":1328118825,"type":"comment"},{"by":"sheats","id":3538403,"parent":3537881,"text":"ClearCare - Full-time - Remote or Downtown SF.\nDjango - jQuery<p>We are a small start-up with the best product in the industry after about a year of development.  We only have one full-time developer at the moment (me) and are looking to add another.<p>If you are looking for a position where you can have a big influence on the product this is it. You need to have experience on all levels of the stack and we'd really love someone who has a passion for simple but powerful UIs.<p>More details: <a href=\"http://clearcareonline.com/\" rel=\"nofollow\">http://clearcareonline.com/</a> and <a href=\"http://careers.stackoverflow.com/jobs/16261\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/16261</a>","time":1328111345,"type":"comment"},{"by":"BrandonMTurner","id":3538186,"kids":[3538867],"parent":3537881,"text":"Boston, MA (No remote) - Full Time - <a href=\"http://www.loseit.com\" rel=\"nofollow\">http://www.loseit.com</a><p>= About Lose It! =<p>Lose It! is a popular iPhone / Android / Website application that changes people's lives by helping them manage their weight.<p>8M+ iPhone Downloads (currently top 10 in Health category)<p>500k+ Android Downloads (very new, currently top 15 in Health category)<p>2M Website enabled users (connecting to our website is optional)<p>2M Uniques per month across all platforms<p>7M+ pounds of weight have been lost by website enabled users (Estimated ~18M pounds lost across all users)<p>8k messages betweens users that opted into social features per day<p>450M+ foods logged by website enabled users<p>Current Team - 1 CEO (technical), 1 Developer (me), 1 Business Dev, 1 Community Manager<p>Current Stack - GWT, MySQL, Java (server side and Android), AWS, Objective C (iPhone), Membase<p>Current Tools - Intellij, Git, Navicat, New Relic, CloudBees, Asana<p>= Who we are looking for =<p>Lose It! is looking for new members (we have more then one spot open) for our product team to help us build our next generation of products. We believe that small teams of well rounded people can do great things, so we're looking for someone that can contribute to all phases of building a great product. We believe that iterating on our products with customers is the best way to build something great, so we'd like someone who enjoys talking to customers and making them happy (and maybe even helping to change their lives).<p>As a software engineer at Lose It!, you'll be an early member of the team that is building the core product, the most complete and effective weight loss software spanning mobile devices and the web. You should have a passion for and a proven track record of building products that delight users.<p>= Who to contact =<p>{first name} at loseit.com - If you think you would be a good fit send me an email with anything (resume, cover letter, github account, maybe just a simple 'hello'. I'll read anything and everything you send).","time":1328108575,"type":"comment"},{"by":"jtmcmc","id":3538369,"parent":3537881,"text":"Bay Area, CA. Badgeville<p>We are looking for a Technical Account Manager / Customer Success Engineer and a Technical Support Engineer. We're a fast growing gamification platform that has been used in major corporate websites like Samsung's and Rogers' to drive customer engagement.<p>The listings can be seen at: \nCustomer Success Engineer / Technical Account Manager\n<a href=\"http://bit.ly/zRA6tl\" rel=\"nofollow\">http://bit.ly/zRA6tl</a>\nTechnical Support Engineer \n<a href=\"http://bit.ly/z1SO3x\" rel=\"nofollow\">http://bit.ly/z1SO3x</a><p>If you're interested or have any questions feel free to email me at justin _at_ badgeville.com","time":1328110951,"type":"comment"},{"by":"heyjonboy","id":3538049,"parent":3537881,"text":"New York City, NY - ParkWhiz<p>Lead Designer: <a href=\"http://www.parkwhiz.com/about/jobs/designer/\" rel=\"nofollow\">http://www.parkwhiz.com/about/jobs/designer/</a><p>ParkWhiz creates software to help parking owners manage and market their parking using the ParkWhiz website, mobile apps, and data APIs. Our platform currently processes millions of dollars in transactions, and we're growing fast. Our stack is PHP, MySQL, nginx, and Redis, with a dash of Python on the backend, and jQuery/LESS/HTML5 on the front-end. We're a small team, and we work smart and fast.<p>Contact me directly if interested: jon@[company].com","time":1328106798,"type":"comment"},{"by":"rjsjr","id":3539737,"parent":3537881,"text":"San Francisco, CA.  Full time.<p>Social Finance <a href=\"http://sofi.org/\" rel=\"nofollow\">http://sofi.org/</a> is fixing Student Loans with better rates, alumni investment, and great social integration.  We're looking for Web Designer/Front End Developer, and Engineers to come work with an experienced startup engineering team and build great products.  Backed by Eric Schmidt and Steve Anderson, we're located in the beautiful Presidio and have a free shuttle from downtown.<p>Apply online at <a href=\"https://sofi.resumetracker.com/public\" rel=\"nofollow\">https://sofi.resumetracker.com/public</a>","time":1328127936,"type":"comment"},{"by":"masnick","id":3538969,"parent":3537881,"text":"Durham, NC - fulltime (H1B) Duke University, Center for Health Policy and Inequalities Research<p>We're a group of public health researchers looking for a junior software developer to work on the software that runs our research. This is a great opportunity for a developer with an interest in public health, including an interest in possibly traveling to international study sites. More information (and contact info) at <a href=\"http://chpir.org/software_dev_job\" rel=\"nofollow\">http://chpir.org/software_dev_job</a>, or contact me directly from my profile.","time":1328117700,"type":"comment"},{"by":"shennyg","id":3540814,"parent":3537881,"text":"Los Angeles, CA - Full Time, Part Time and contract.<p>Contender.com is a high-growth, early stage company, that provides a fully-automated, turn-key platform for buyers and sellers to negotiate prices and purchase event tickets. Read more about why Everything’s Negotiable on our blog: <a href=\"http://www.contender.com/blog/contender/welcome-to-contender-tickets/\" rel=\"nofollow\">http://www.contender.com/blog/contender/welcome-to-contender...</a><p><pre><code>  Job Perks\n  ☑ Play a big role on a small team\n  ☑ Work closely with founders and executives from some of the largest media companies in America\n  ☑ Leave your fingerprint on a huge industry\n  ☑ Have stock options in a company that is fixing a broken model\n\n  Requirements\n  ☑ Experience making web applications that scale\n  ☑ Experience with MVC design patterns and frameworks\n  ☑ Demonstrated fanatical attention to detail\n  ☑ Familiarity with source control systems (Git)\n\n  Pluses\n  ☑ Appreciation of software development best practices, but knows when it is important to deliver\n  ☑ Experience with git flow, Vagrant, Memcached, Amazon Web Services\n  ☑ Comfortable working on the command line\n  ☑ SQL optimization chops\n</code></pre>\nWe are looking for a PHP Developer and also a Frontend Developer. Please use the following link to apply for either:<p><a href=\"http://contender.theresumator.com/apply/Iui6yk/Frontend-Web-Developer.html?source=HN\" rel=\"nofollow\">http://contender.theresumator.com/apply/Iui6yk/Frontend-Web-...</a>","time":1328142081,"type":"comment"},{"by":"3pt14159","id":3538498,"kids":[3539672,3539265],"parent":3537881,"text":"Toronto: Many companies I know are hiring. FreshBooks, 500px, Rocketr, Mozilla, HireWinston, Endloop, Viafora are all hiring developers. Most are also hiring designers (Rocketr and Viafora are not).","time":1328112492,"type":"comment"},{"by":"ubercore","id":3538127,"parent":3537881,"text":"We're looking for Django developers.<p>Remote work is fine, but Providence, RI area is preferable (or, a willingness to consider relocation eventually; though to be clear, for the right person this isn't a requirement at all).<p>We're a small design driven development company working exclusively on Django projects. Very flexible work environment, bonus options, etc. We are not a funded startup, we're bootstrapping ourselves. We have a large fluffy dog as the office mascot!<p>Must enjoy, or tolerate, a wide variety of musical genres and styles.<p>Email peter at projectevolution.com if you're interested!","time":1328107728,"type":"comment"},{"by":"jclemenson","id":3540872,"parent":3537881,"text":"NYC - Founding Engineer / Lead Developer (Ruby) at Centzy (<a href=\"http://centzy.com\" rel=\"nofollow\">http://centzy.com</a>)<p>Centzy is Kayak for local services - comparison shopping for everyday local services like haircuts, dry cleaners, and oil changes. It's a large, untapped market, and we are funded by great investors who share our passion: Lightbank (Groupon's original investor) and ffVC (Klout's original investor).<p>We are a team of two (one hacker, one business guy with a CS degree) and we are looking for another hacker. As our first hire, we would consider you a late co-founder and expect as much. You'll get serious product ownership with real equity and a salary. You'll be the third leg of the tripod.<p>We're looking for someone who has built and scaled products on the Ruby / Rails stack in the past. You've probably worked at a startup if not started one. You are smart and relentlessly resourceful. You'll spend most of your time crafting code in Ruby and Javascript, so you should love it. We think hackers should drive product, so you should be comfortable doing this. You've probably at least dabbled in MongoDB and Node.js.<p>We have great shared startup space in the Lower East Side with tons of great food and bar options nearby. In addition to equity and salary, you'll get your choice of equipment and we'll cover 100% of your health benefits, and lunches and dinners while you're working. And of course the fridge will always be stocked with soda and great micro brews.","time":1328143131,"type":"comment"},{"by":"boatbasin","id":3538173,"parent":3537881,"text":"LocalBonus (New York, NY)\nFULL TIME Rails Developer in NYC (or REMOTE)<p>Why us:\n- Product is something you'd use (we let consumers use their existing credit/debit cards as loyalty cards at local businesses)\n- Seed funding already closed (recently... so we have runway)\n- You'd be the third person on the team so there's plenty of equity to work with\n- We're currently in the Entrepreneur's Roundtable Accelerator program (<a href=\"http://eranyc.com\" rel=\"nofollow\">http://eranyc.com</a>)\n- CTO has 12 years software dev experience, 6 years managing tech teams.  He's an awesome mentor (and generally awesome guy).  Among other things, he managed the team that built Australia's largest Ruby on Rails application.\n- CEO is a Stanford grad with 6+ years direct experience in our industry\n- Ability to shape corporate culture.  We tend to be disciplined and professional about the stuff that matters and very casual/flexible about the stuff that doesn't.\n- Our main stack is Rails 3.1, MySQL (moving to MongoDB soon), jQuery, and HAML.\n- Looking to build out our iOS and Android platform.  If you have experience here, you'd be in charge of this.<p>Ideal candidate:\n- 2-3 years full time dev experience in Ruby (will consider light Ruby experience or more junior if you're a solid fit and eager to learn)\n- Smart / raw talent / logical thought process important\n- Entrepreneurial hustle - basically someone that wants to contribute a lot to LocalBonus and then be CTO/Founder of their own company after this.<p>Email tim@localbonus.com","time":1328108387,"type":"comment"},{"by":"bentoner","id":3538424,"parent":3537881,"text":"We’re looking for a UI/UX designer in Melbourne, Australia.<p>Full-time preferable; part-time or intern possible.<p>We’re a startup based in Carlton. We’re working on a web/email app that makes it easier to write documents with other people. It automatically keeps track of what changed and who did the work, without requiring people to modify how they currently do things, whether it be by passing attachments around by email or by sharing documents in dropbox. It’s not launched yet.<p>Design is really important to us and you’ll be our first dedicated designer. (Right now our team is approximately 4 developers and a business guy.) We’re running into lots of design challenges and need someone to take the lead on these, in addition to designing the overall experience. As an example, this week we are thinking about how to show the changes between two Word documents in a clearer way than the Word compare view (which is horrible!).<p>We dream of hiring a junior version of Ryan Singer. We want someone who’s quite analytical about the design process. Regarding technical stuff, you need to be able to work in HTML and CSS, have a good understanding of what’s possible to do with Javascript, and know or be willing to learn git.<p>Get in touch with me (ben@contextualsystems.com) with any questions, or send a CV and link to your portfolio to apply. I’ll put a more detailed job ad up at <a href=\"http://contextualsystems.com/jobs/\" rel=\"nofollow\">http://contextualsystems.com/jobs/</a> soon.","time":1328111556,"type":"comment"},{"by":"mdelagra","id":3539815,"parent":3537881,"text":"Leapfrog Online is looking for a talented Chicago-area Python engineer to work in our Evanston office. Our Python engineers build and maintain high-traffic web sites using the Django web framework. We offer a great working atmosphere, a strong focus on work-life balance, and tremendous opportunities to learn new skills and technologies. We also have competitive salaries and benefits and close-knit teams who like what they do.<p>As we principally focus on the web, we look for real-world experience using Python application frameworks (such as Django) to build high-traffic web sites and applications. Experience with other languages is welcome. What are the extras we look for? Experience producing and consuming web services (SOAP, REST, XML-RPC); experience working with message-oriented systems (AMQP or other message, pub-sub and task queues such as Celery); deep knowledge of version control systems (especially Mercurial or Git); an interest in non-RDBMS data stores (CouchDB, MongoDB, Redis); knowing what it really means to develop RESTful applications; and, experience with functional and declarative programming models in addition to object-oriented development.<p>If you're a bright, self-motivated engineer who enjoys using open source software to solve interesting problems, you’re our kind of programmer, and we’d like to talk to you. You can apply on our site, where you'll also find full job descriptions and information about Leapfrog Online: <a href=\"http://www.leapfrogonline.com/who/careers/\" rel=\"nofollow\">http://www.leapfrogonline.com/who/careers/</a>","time":1328128868,"type":"comment"},{"by":"jackowayed","id":3539841,"parent":3537881,"text":"Palo Alto, CA; San Francisco, CA; remote for some positions<p>Cloudera is hiring for everything. Lots of cool distributed systems problems to solve, plus some unique opportunities like being a trainer--live anywhere, travel all over for free.<p>I interned there last summer, and I was totally blown away. Everyone there is brilliant, and they get to work on technical problems that are at their level, not just making another webapp.<p>And they're completely exploding. They're aggressively establishing themselves as <i>the</i> Hadoop company. They just signed a big deal with Oracle that should help legitimize them even more in the places that matter (ie. with big companies that are willing to pay big money): <a href=\"http://www.cloudera.com/blog/2012/01/oracle-selects-cdh-and-cloudera-manager-as-the-apache-hadoop-platform-for-the-oracle-big-data-appliance/\" rel=\"nofollow\">http://www.cloudera.com/blog/2012/01/oracle-selects-cdh-and-...</a><p>The culture is great. Fun people to be around, they really appreciate that taking care of engineers is vital to the company's success, management is deeply technical all the way up to the CEO, and they have regular all-hands meetings where they say just about anything you could want to know about the company.<p>I was so impressed that I've kept working on-and-off when I have the time, and I convinced my brother to apply and take a job there.<p><a href=\"http://www.cloudera.com/company/careers/\" rel=\"nofollow\">http://www.cloudera.com/company/careers/</a>","time":1328129224,"type":"comment"},{"by":"dougb","id":3538375,"parent":3537881,"text":"Pittsburgh PA, fulltime<p>Software Engineer – Energy Management Applications KWantera has an\nimmediate need for an application software engineer to help extend our\nEnergy Management, and Trading platform.  The candidate will have\nextensive hands-on experience in developing and debugging\ndata-intensive dynamics web applications: Developing and testing\nclient-side web applications using AJAX technologies (JavaScript,\njQuery, JSON, HTML, and CSS) Work in collaboration with the customer\naccount team to ensure browser compatibility for both cloud-based and\nhosted environments.  Participating in the design process and\ndocumentation of the software architecture<p>Qualifications:\nStrong JavaScript, HTML and CSS programming experience\nfor dynamic web-applications.\nPrior experience with jQuery, Python, and Java.\nExcellent verbal and written technical communication skills\nBS/MS in Computer Science, Computer Engineering, Electrical or related\nwith emphasis on machine learning<p>The successful candidate will be excited to work in energy and\nclean-tech industry. Compensation is commensurate with experience,\neducation, and references.  This position is for immediate hiring. \nAll interested candidates should apply through\n<a href=\"http://www.kwantera.com\" rel=\"nofollow\">http://www.kwantera.com</a> and include a link to a web\nproject along with their resume.<p>You can also contact me for more info doug at company's domain name.","time":1328111003,"type":"comment"},{"by":"200902","id":3538144,"parent":3537881,"text":"Cyrus Innovation<p>FULL TIME - New York - Boston<p>Do you love Ruby on Rails or Java but really consider yourself a Polyglot Programmer? Do you want to work on custom back end applications with other exceptional developers and continuously make yourself a better engineer? Do you want to have a real work-life balance and still be able to produce great work?<p>Cyrus Innovation is a profitable and growing Agile development consulting firm that was founded in 2003 and provides on-site XP teams to start-up and enterprise level organizations in Boston and New York City.<p>We are looking for honest and energized developers to join our exceptional team. We pair program, practice TDD, and have daily stand-ups on every project and are looking for people who love Agile as much as we do. We don’t believe in cubicles and think that an open office space that allows for constant communication is the best way to produce great work. Through our intense hiring process we bring on the best developers in town and aren’t afraid to fire people who can’t get the job done.<p>We are serious about our love for new technology, best practices, and constant improvement. If you have a true passion for coding both in and out of the office and believe that Agile is the best way to get things done, we would love to hear from you.<p>For more information about Cyrus, or to apply for a position please send a resume to Marc Rosenberg at mrosenberg@cyrusinnovation.com","time":1328107996,"type":"comment"},{"by":"jcn","id":3541124,"parent":3537881,"text":"NYC, New York, NY - Full Time Developers, Devops<p>Indaba Music - <a href=\"http://www.indabamusic.com/\" rel=\"nofollow\">http://www.indabamusic.com/</a> - gives musicians reasons and opportunities to make music. We launched in 2007 and over the past five years our community has grown to over 650,000 musicians from almost every country on earth. Our musicians compose, record, and remix music for fun and professional opportunities. We have created original songs for brands like Red Bull, Bacardi, and the NFL and have remixed music for Yo-Yo Ma, Linkin Park, Metric, T-Pain, Peter Gabriel, Snoop Dogg, and dozens of other incredible artists.<p>We're looking for developers who are passionate about music and believe that the music industry is more alive than ever.<p><pre><code>  - We code Ruby\n  - We code Javascript\n  - We love AWS\n  - We &#60;3 New York\n</code></pre>\nWe believe in test coverage and giving our developers a fair amount of autonomy. We have a large code base and are happy to experiment with it for a better experience for our users and our developers. We're looking for ruby/js developers, devops, and really anyone who would like to help us build out our awesome engineering culture.<p>Email jobs@indabamusic.com or find out more on our jobs page (which is mostly a re-telling of this post):<p><a href=\"http://www.indabamusic.com/about/jobs\" rel=\"nofollow\">http://www.indabamusic.com/about/jobs</a>","time":1328148551,"type":"comment"},{"deleted":true,"id":3538502,"parent":3537881,"time":1328112556,"type":"comment"},{"by":"nradov","id":3539457,"parent":3537881,"text":"San Jose, CA. Full time<p>OptumInsight is seeking Software Engineers, a Software Architect, and a Software Development Manager to work on the Axolotl suite of health information exchange applications.\n<a href=\"http://www.axolotl.com/\" rel=\"nofollow\">http://www.axolotl.com/</a>\nWe work mainly with the Java stack but use a number of other tools as well. I prefer generalists who can do both front-end and back-end work as needed. Prior healthcare experience is a plus but not required.<p>Here are direct links to the postings where you can apply.<p>Software Engineer: <a href=\"http://careers.unitedhealthgroup.com/Data/Jobs/Information%20Technology/367875%20Software%20Engineer%20EXCELLENT%20College%20Grad%20Opportunity%20San%20Jose%20CA.aspx\" rel=\"nofollow\">http://careers.unitedhealthgroup.com/Data/Jobs/Information%2...</a><p>Software Architect: <a href=\"http://careers.unitedhealthgroup.com/Data/Jobs/Information%20Technology/372031%20Commercial%20Software%20ArchitectAxolotl.aspx\" rel=\"nofollow\">http://careers.unitedhealthgroup.com/Data/Jobs/Information%2...</a><p>Software Development Manager: <a href=\"http://careers.unitedhealthgroup.com/Data/Jobs/Information%20Technology/374305%20Software%20Development%20Manager%20Health%20Information%20Exchange%20Solution.aspx\" rel=\"nofollow\">http://careers.unitedhealthgroup.com/Data/Jobs/Information%2...</a>","time":1328124180,"type":"comment"},{"by":"maggiemzli","id":3538526,"parent":3537881,"text":"San Francisco, CA. FULL TIME  Senior Web Developer/Engineering Manager<p>Brightidea, Inc. is hiring a Senior Web Developer/Engineering Manager with PHP web programming and architecture experience. Your responsibilities include technical team lead, technical design, and feature implementation for Web 2.0 Social  Innovation Management products, working closely with the CTO,  product managers, your team, and QA engineering to create high quality new features.<p>We are a fast growing SaaS company. Rated top in our field, we develop and host innovation management software for over 200+ influential clients around the world, including fortune 500 companies. Our various clients use Brigjtidea software to change the world; from GE’s ecomanigation.com challenge gathering ideas for Green Innovation, to Harley Davidson for building rides better/faster. We also use our software internally to run company-wide innovation campaigns to come up with our next big products, enhance existing products and services.<p>Work hard and play hard. Some of our employee perks include weekly happy hours around town, a stocked bar, fooseball tournaments among many others. We’re a dynamic profitable company, with a startup atmosphere but without the risk.<p>This position is our downtown San Francisco office 1 block from BART.<p>Email your resume to mli@brightidea.com","time":1328112793,"type":"comment"},{"by":"anarchitect","id":3542427,"parent":3537881,"text":"London, UK. Full time.<p>* Front-end Web developers<p>* Ruby Engineers<p>The Easyart group is the most prominent publisher, printer, wholesaler and retailer of art prints in the UK. Through our brand King &#38; McGaw we supply beautiful art prints, posters and art cards to all major UK museums such as the Tate and National Gallery. We supply most major and numerous independent retailers with art product and have exclusive direct relationships with major classic artists such as Picasso as well as hundreds of young and aspiring artists. Easyart.com is the largest UK art print online shop with more than 20,000 customers browsing our 100,000 prints every day.<p>We are working hard to get more people to explore and buy beautiful art. There are many artists that need discovering, walls that need decorating and trends that need creating. We have the network, contacts and manufacturing platform in place and now need people to help us develop it and realise its full potential.<p>Our technology and marketing team are based on Leather Lane in London, our workshop, customer service and administration is based in Sussex on the South Coast.<p>We're passionate about technology here at Easyart, and always looking for developers to join our team in London.<p>Details: <a href=\"http://www.easyart.com/content/help/jobs.ghtml\" rel=\"nofollow\">http://www.easyart.com/content/help/jobs.ghtml</a>","time":1328185817,"type":"comment"},{"by":"ipster","id":3538396,"parent":3537881,"text":"AllTrails<p>FULLTIME or INTERN<p>San Francisco (preferred) / Los Angeles / NYC / Remote / H1B<p><a href=\"http://alltrails.com\" rel=\"nofollow\">http://alltrails.com</a><p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people rediscover the outdoors and having lots of fun in the process. Camping benefits, anyone?<p>We just launched our brand new site in partnership with National Geographic (<a href=\"http://alltrails.com/partners/national_geographic\" rel=\"nofollow\">http://alltrails.com/partners/national_geographic</a>) and have the #1 outdoors app in the Apple and Android stores (search for 'Hiking').<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book on the team.<p>We're looking for exceptional designers / front-end Engineers, back-end Rails engineers, mobile developers (Android and iOS). Cross-functional and full-stack developers are preferred. We're also hiring for a community manager and sales folks.<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you!<p><a href=\"http://alltrails.com/jobs\" rel=\"nofollow\">http://alltrails.com/jobs</a> or justin@alltrails.com","time":1328111280,"type":"comment"},{"by":"federicof","id":3539544,"parent":3537881,"text":"San Francisco, CA (2 min wlk from Caltrain) FULLTIME REMOTE H1B<p>★ Full stack JavaScript Engineer (Backbone/Knockout/Express/Node) ★ at Gild.com<p>We're rethinking the way professionals find great companies to work for and apply for jobs. We believe that the current process is broken for both applicants and companies, and we're fixing it. We're venture-backed (Globespan, TMT Investments), and our customers are crazy about what we're building.<p>This position is our first technical hire dedicated to our new Node.js infrastructure, with a ton of room to influence its evolution. The best fit will be someone with hands-on experience working with a production Node.js app. This is an amazing opportunity for somebody who is passionate about JavaScript technologies.<p>We're looking for somebody that can translate a high-level product vision to production-ready code without needing a babysitter.<p>Technologies we like: Javascript/Coffeescript, Ruby, Perl, Express.js/Zappa, Socket.io, Sprockets, Rails, Compass, SASS\nWhat you don't know, we will teach you. What we don't know, you will teach us.<p>Cool things we've built: <a href=\"http://youtu.be/13GaYDoRwOg\" rel=\"nofollow\">http://youtu.be/13GaYDoRwOg</a><p>Apply here <a href=\"http://goo.gl/SX4sW\" rel=\"nofollow\">http://goo.gl/SX4sW</a><p>(Please don't apply if you suffer from the \"Not invented here\" syndrome. We like lazy coders.)","time":1328125374,"type":"comment"},{"by":"lamby","id":3538275,"parent":3537881,"text":"London, England. <a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a><p>Small (4) startup in the gaming space looking for software engineers. Are you the one? You are, if you:<p>* Love agile development, working independently on your own challenges, and together in a team on the bigger vision<p>* Are completely fluent in a scripting language such as Python, Perl, PHP or Ruby and have experience with web frameworks and the MVC concept. We don't require fluency in our current technology stack - great programmers can pick up new technologies.<p>* Have used MySQL or PostgreSQL extensively and you know your way around Apache, nginx or other server. It's a bonus if you have good JavaScript skills (we use jQuery)<p>* Get excited by the idea of scaling web apps to millions of users<p>* Are the best developer in your peer group, and want to be at a place where you are constantly challenged and pushed to become better<p>* Get obsessed about the problem you're solving and don't stop until you've cracked it<p>* Have a thirst to learn new skills and technologies, and can pick things up easily<p>* Want to have fun building lots of new features and get stuff done<p>* Are full of positive energy, relish the thought of being part of a small, fast-moving team and enjoy brainstorming about new ideas<p>See <a href=\"https://www.playfire.com/jobs\" rel=\"nofollow\">https://www.playfire.com/jobs</a> for more. You can see some of our code at <a href=\"http://code.playfire.com/\" rel=\"nofollow\">http://code.playfire.com/</a>","time":1328109717,"type":"comment"},{"deleted":true,"id":3538538,"parent":3537881,"time":1328112915,"type":"comment"},{"by":"shahed","id":3553707,"parent":3537881,"text":"Chicago, IL (REMOTE AVAILABLE) - Software Engineer - Part Time<p>Viatask is looking for engineers #2 and #3 to join a small close team building the new way to outsource your physical errands.<p>We are looking for someone who not only is a \"Software Engineer\", but some one who can also feel comfortable calling themselves a \"Softwarepreneur\". Taking issues and solving problems without having to ask questions is something we accel at Viatask and hope you can as well.<p>You'll be challenged to take big structured ideas and bring them to life. Shipping each feature with pride and courage. Also loking into the users criteria and implementing upon that.<p>Viatask: <a href=\"http://crunchbase.com/company/viatask\" rel=\"nofollow\">http://crunchbase.com/company/viatask</a><p>Requirements: Rails, JQuery, HTML, CSS, and expert web development knowledge<p>Press:\n<a href=\"http://thenextweb.com/video/2011/09/30/16-year-old-builds-ta..\" rel=\"nofollow\">http://thenextweb.com/video/2011/09/30/16-year-old-builds-ta...</a>.\n<a href=\"http://nbcchicago.com/blogs/inc-well/shahed-khan-teen-entrep..\" rel=\"nofollow\">http://nbcchicago.com/blogs/inc-well/shahed-khan-teen-entrep...</a>.\n<a href=\"http://socialtimes.com/shahed-kahn_b74848\" rel=\"nofollow\">http://socialtimes.com/shahed-kahn_b74848</a><p>Interested or want more info? Email: contact@viatask.com<p>Thanks, \nShahed","time":1328433587,"type":"comment"},{"by":"tomblomfield","id":3538405,"parent":3537881,"text":"London, UK - GoCardless is a VC-backed startup looking to hire for the following positions:<p>- Backend engineers<p>- Front-end developers<p>- Business development roles<p>We're building the next generation of online payment tools, and are partnered with one of the world's largest banks.<p>GoCardless is built using bleeding edge Ruby and Rails, Postgres 9, Coffeescript and Redis. Experience with any of those technologies is a plus, but certainly not required.<p>More detail here: <a href=\"https://gocardless.com/jobs\" rel=\"nofollow\">https://gocardless.com/jobs</a>","time":1328111381,"type":"comment"},{"by":"BenjaminDyer","id":3542205,"kids":[3542241],"parent":3537881,"text":"Hungary, UK, Possibly Homebased. Full time.<p>Great Developer Wanted - Javascript, CSS3, HTML, UI / UX<p><a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=2475685\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=2475685</a><p>Based in the UK and Hungary, we are an innovative, well funded startup with a unique product. We have exceptional leadership who have already built other start-up companies from scratch and made them into success stories. Currently, we are looking to hire an extremely bright developer that wants to make a difference within our business.<p>This is an excellent position for a talented developer with a great knowledge of HTML and with a passion for producing high quality, functional web and webkit applications. Day to day you will work closely with other developers in the company, working on a range of high profile clients requirements.<p>The job is home based with regular meetings at Budapest and occasional travel to UK.<p>Desired Skills &#38; Experience<p>Must have skills:<p>- Object Oriented PHP \n- HTML\n- Very strong Javascript\n- CSS3\n- MVC experience\n- UI / UX experience\n- Good written and spoken English<p>Additionally any of the following skills would be beneficial:<p>- PhoneGap\n- Mobile app development\n- Objective-C\n- Java\n- Sencha Touch\n- Experience with web services architecture and SOAP/REST interfaces\n- Good visual design skills","time":1328179651,"type":"comment"},{"by":"etrgreg","id":3538282,"parent":3537881,"text":"New York, NY<p>ExpandTheRoom, a boutique creative agency, is looking for full-time Mobile Developers (Windows Phone 7, iOS) as well as PHP Developers and UX Designers. We have a truly excellent team of developers and designers, and a fun work environment and culture. We'd also consider internships.<p>If you're interested, check the site - <a href=\"http://www.expandtheroom.com/jobs\" rel=\"nofollow\">http://www.expandtheroom.com/jobs</a> or contact us at iwannawork@expandtheroom.com","time":1328109813,"type":"comment"},{"by":"triggit","id":3539509,"parent":3537881,"text":"Triggit, Inc.<p>San Francisco, CA  Full-Time.   Remote considered.<p><a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a><p>Want to work with hundreds of terabytes of realtime data using advanced JVM Languages like Clojure and Scala, dig into that data with Hadoop, and invent cutting edge products to handle it all?<p>Triggit, a San Francisco ad:technology startup is hiring.<p>Ping us @ engjobs@triggit.com.<p>If you're obsessed with distributed systems for processing big data and are intimately familiar with Java and Hadoop, you're going to have a lot of fun. At Triggit, we pride ourselves on our merit-based, ownership culture. You get to run your projects, not be run.<p>What You'll Do All Day:\n• Design and Deploy Triggit’s data tools including A/B testing, forecasting, etc.\n• Collaborate with multiple teams to implement requests into the Hadoop Cluster\n• Build and Optimize dozens of reports and create data visualization and storage tools around them\n• Grow and Scale the Hadoop Analytics Platform<p>Additional Openings: \n-\tBackEnd Engineer (C/C++ on Linux)\n-\tPlatform Engineer (Ruby on Rails)\n-\tSr. Dev Ops<p>Base pay for engineers starts in the six figures, you get to build your own battle station, and every engineer gets an office - with a door.  Positions are full time and based in our SOMA, San Francisco, CA office.","time":1328124794,"type":"comment"},{"by":"elmomalmo","id":3538342,"parent":3537881,"text":"Agile Developer (Python, Mobile, UI)<p>Myspace / Specific Media<p>Cardiff, United Kingdom. Full time.<p>Specific Media are recruiting TDD evangelists and clean code junkies to help create the next generation of social entertainment - Myspace TV. Would you like to discuss what you're watching in real-time on your iPad? Browse music on the Web and throw it to your TV? Invite your friends to watch the same sports games? Pause that film and carry on watching it on your mobile? You get the idea.<p>What's even better is that (with the help of the creative talents like Justin Timberlake) you get to use this great technology to help transform Myspace. Your code being used every day by tens of millions of users worldwide.<p>Here at Specific Media, you will work in truly Agile, small teams using Scrum, working in short iterations. You will have unparalleled opportunity to contribute your ideas and have real influence over how we work and on the awesome applications we create. If you're a passionate software developer who is interested in software development both inside and outside work; and you want to be part of the most exciting software projects currently happening in South Wales... Myspace needs YOU!<p>More details are available if you send me an email at emalethan [at] specificmedia dot com","time":1328110570,"type":"comment"},{"by":"bwwhite","id":3538582,"parent":3537881,"text":"London, UK<p><a href=\"http://www.mindcandy.com\" rel=\"nofollow\">http://www.mindcandy.com</a><p>Mind Candy is one of the world's leading developers of social multi-player games, helping kids (and big kids!) around the world play and connect. Best-known for online game Moshi Monsters.<p>Some technical roles we're currently hiring for:<p>* IT Support Engineer<p>* Lead Tester - Gameplay<p>* Mobile Developers<p>* Scrum Master/Agile Project Manager<p>* Senior Front End Developer<p>* Senior Web Developer<p>* Software Engineer - Tools<p>* Software Engineers<p>* Systems Administrator<p>See <a href=\"http://mindcandy.com/recruitment\" rel=\"nofollow\">http://mindcandy.com/recruitment</a> for more details.","time":1328113370,"type":"comment"},{"by":"golovast","id":3539704,"parent":3537881,"text":"Los Angeles, CA (Encino more specifically). Full time, on-site.<p>Sr. Linux Systems Admin/Engineer. We are looking for a jack-of-all-trades type. Someone who is comfortable with a lot of different technologies and stacks.Apache/Nginx/MySQL/Mongo/Tomcat.EC2 experience is a huge plus.<p>About the company: we do online market research and a lot of data analysis. More info here: <a href=\"http://www.usamp.com/\" rel=\"nofollow\">http://www.usamp.com/</a><p>Contact email: devops@usamp.com","time":1328127601,"type":"comment"},{"by":"mcin","id":3555558,"parent":3537881,"text":"Chicago, IL AND/or remote - Full-time, interns.<p>SEEKING A TECHNICAL CO-FOUNDER, ENGINEERS, AND GRAPHIC DESIGNER TO BUILD A REVOLUTIONARY ENTERPRISE SOCIAL PLATFORM<p>Ventur.66 is in the beginning stages of building an enterprise social platform that is destine to revolutionize a profession.<p>Our team is looking for a Technical Co-Founder, engineers, and graphic designers who have the technical skills and leadership capabilities to help build this platform. Because we do not have technical backgrounds, you will have a substantial say in the direction of this product. We seek leaders who possess a great amount of creativity, and an unrelenting drive to make a massive impact.<p>As a Co-Founder, you need to be entrepreneurial, adventurous and most of all, creative. You will have a tremendous amount of creative freedom to build the product, but will never feel like you are stuck without guidance.<p>We want engineers that are capable of building a scalable, secure, and complex network.<p>Essentially, if you are a leader with a passion to build products, we want you.<p>If you are at all curious about what we are creating, or are interested in hopping aboard something that has the potential to impact a profession, please contact us at:<p>ventur.66@gmail.com.","time":1328482191,"type":"comment"},{"by":"jdavid","id":3539655,"parent":3537881,"text":"San Francisco, CA (SF) - PHP Backend Engineer<p>I work at a small growing startup in Downtown San Francisco.  We have a nice office and are working on a site with millions of unique visitors a month.<p>The site is growing by double percentage points every month, so we need to hire a few backend engineers to help us refactor the code and to implement some great new features.  The company is very open and is a great place to work.  Your ideas and code will have an impact on how this company grows and launches features.<p>If you would like to find out more here is what we are looking for.<p>Someone who has worked deeply in PHP on at least one project and has worked on a a site at scale with at least one project.  We would prefer if you were the one who brought the site to scale, but it's ok if you learned a lot while you were there.<p>We are also looking for someone that had worked in a test driven development culture, but it's ok if you always wanted to.  We want to be able to release daily and to know that our code is well covered.<p>I am at @jdavid on twitter if you would like to grab coffee or lunch.  We are near the market and california.<p>One of our founders is extremely inspired by how GitHub is able to launch new code.","time":1328127007,"type":"comment"},{"by":"motti","id":3538126,"parent":3537881,"text":"London, UK<p>FULLTIME or INTERN<p>REMOTE or onsite in our London offices, or some hybrid arrangement.<p>We are building CopyCopy (<a href=\"http://www.copycopy.cc/\" rel=\"nofollow\">http://www.copycopy.cc/</a>) - a cross-platform productivity tool that makes it simple to transfer anything between phones and desktop computers.<p>We use:<p>• Java (for Android, BackberryOS, GWT and in our homegrown lightweight Java server)<p>• C++ (for Win32, Qt, Android NDK and Objective-C++)<p>• Python (occasionally) to string bits together<p>• Objective-C (iPhone and Mac)<p>• JavaScript (web frontend work and browser extensions)<p>• Redis<p>We are a young startup headed by experienced engineers, and moving fast towards the first launch. You will have the opportunity of working on self-contained projects from spec to release to consumers. Our Git repositories, code review and Project Management tools are geared towards remote working and we are open to flexible working conditions. We urgently need full-timers and interns (paid).<p>Equity on top of salary for the right candidate.<p>We are happy to consider remote workers who are located in timezones +/-3 hours from London or you can work in our new North West London offices.<p>Apply now to find out about our \"secret sauce\" that will make CopyCopy the simplest way of transferring anything between devices.<p>Just send your CV to jobs@copycopy.cc now!","time":1328107727,"type":"comment"},{"by":"abuggia","id":3539659,"parent":3537881,"text":"Cambridge, MA.  Full Time<p>Localytics offers the most powerful app analytics platform available and gives publishers of smartphone and tablet apps the tools needed to build more successful and profitable apps.  We’re growing rapidly and are well-funded with a proven business model and established revenue.  Read more about us in the Wall Street Journal’s Career News &#38; Advice section:  <a href=\"http://it-jobs.fins.com/Articles/SB130437040892812517/Localytics-Hiring-Analytical-Engineers\" rel=\"nofollow\">http://it-jobs.fins.com/Articles/SB130437040892812517/Localy...</a><p>Jobs Page:  <a href=\"http://www.localytics.com/jobs/\" rel=\"nofollow\">http://www.localytics.com/jobs/</a><p>We are currently hiring for two positions:<p>- Sales Engineer / Consultant:  We need someone with a strong background in analytics to help our customers get the most out of our product.  Strong technical background also preferred as we may need this person to run Map Reduce jobs to pull custom reports for enterprise clients.<p>- Rails Engineer:  We've recently migrated to Rails 3.1.  We also use jQuery, Underscore.js, factory_girl and RSPec.  We are willing to teach a talented candidate rails but he or she should have a strong background in web technologies and frameworks.<p>We are a big data firm, growing quickly and constantly seeking talented engineers.  Our technology stack includes: Scala, MongoDB, AWS and Rails.<p>Take a look at a presentation our Chief Software Architect gave over the summer on scaling MongoDB: <a href=\"http://www.10gen.com/presentations/mongonyc-2011/optimizing-mongodb-lessons-learned-at-localytics\" rel=\"nofollow\">http://www.10gen.com/presentations/mongonyc-2011/optimizing-...</a><p>Email us at jobs [at] localytics.com","time":1328127026,"type":"comment"},{"by":"dennisquintel","id":3589711,"parent":3537881,"text":"Amsterdam or Remote<p>EnergyTransitionModel.com<p>Quintel is looking for an experienced developer in one or more: Ruby, Rails, Javascript (jquery, backbone, coffeescript, etc). You follow the 20%/80% rule, prefer to re-use then to program and seemlessly switch from big picture to implementation details.<p>We answers questions like: \"If everybody switched to electric cars, how many solar plants have to be built?\". It is used by governments to evaluate strategies dealing with events like peak oil, diminishing gas reserves and new technologies.<p>Quintel Intelligence is a charming Dutch (grown up) startup, with a central office in the center of Amsterdam. Our engineering-driven team (91% engineers, PhDs etc) get the work done during office hours, so that we can enjoy our evenings, sometimes together with afterwork-beers. The atmosphere goes from professional consultancy to monkey house in no time. The team is pretty international: Dutch (of course), Italian, Swiss, British.<p>Our codebase has something for everyone. 30% plain Ruby, 30% Javascript (CoffeeScript/Backbone.js), 30% Rails and 10% other code. We have good code, bad code, tested code, untested code. We have DSLs (for our non-programmers), API, fast EC2 instances for calculations.<p>Some of our products include: <a href=\"http://et-model.com\" rel=\"nofollow\">http://et-model.com</a>, <a href=\"http://etflex.et-model.com\" rel=\"nofollow\">http://etflex.et-model.com</a>, <a href=\"http://energyfuture.nl/energy-mixer\" rel=\"nofollow\">http://energyfuture.nl/energy-mixer</a> (Dutch)<p>You are an experienced developer, you think lean and solve problems creatively. You're proactive, fix first, complain later. You live in (ordered by preference): Netherlands, Europe, World.<p>Reactions to: dennis@quintel.com","time":1329222164,"type":"comment"},{"by":"tommizzle","id":3538095,"parent":3537881,"text":"SimplyBusiness<p>FULL TIME (London)<p>Front End Dev, Senior Java Dev, Senior Ruby Dev<p><a href=\"http://www.simplybusiness.co.uk/about-us/careers/\" rel=\"nofollow\">http://www.simplybusiness.co.uk/about-us/careers/</a><p>Our business is now at an exciting new stage of its life, as it looks to increase its rate of customer growth further, build a strong recognisable brand profile, and develop a comprehensive customer contact strategy to deliver incremental revenue from its growing customer base.<p>We are building an innovative and dynamic culture around Agile. Our view and culture is web, not insurance. You will take part in shaping the future direction of this business from both a technology and cultural perspective, while helping to architect, design and refactor our systems.<p>The company has a dynamic team of 50 people in London and a passionate customer care team of 100 based in Northampton.<p>Salary is commensurate with experience. Excellent flexible benefits package including private health insurance, life assurance and season ticket loan.<p>Email careers [at] simplybusiness.co.uk with your CV/Resume and an explanation as to why you'd want to work here. Make sure you mention HN in your email!","time":1328107304,"type":"comment"},{"by":"mbertrand","id":3539304,"kids":[3539381],"parent":3537881,"text":"Cloudbot - Chicago, IL<p>Engineering Interns<p>Cloudbot is looking for talented and passionate \ninterns to work with our diverse engineering \nteam. You'll gain experience working on our \nplatform and mobile apps.  We have \nopportunities for ownership of a number of \nprojects ranging from API integrations, \nperformance enhancements, and writing \nproduction code.<p>About Us<p>Cloudbot is backed by Lightbank (Groupon \nFounders), AngelPad, Hyde Park Angels and \nDraper &#38; Associates.  We are building a mobile \nand web app that pulls each user's online \npresence into one simple user interface. \nCloudbot helps manage the profiles, contacts \nand activities users maintain across multiple \napplications by bringing all of their social \nactivity together into a single hub. Cloudbot \neliminates the scattered, segmented data silos \nthat naturally form as apps explode in \npopularity. In addition, Cloudbot's universal \naddress book and integrated social connections \nmake it easy to call, email, send a Facebook or \nLinkedIn message, post a tweet, share a \ndocument via DropBox or GoogleDocs, \nschedule a meeting, and more.","time":1328121806,"type":"comment"},{"by":"britman","id":3538108,"parent":3537881,"text":"Sporting Solutions (Part of sporting index group) - based in London (near Waterloo), UK - FULL TIME<p>We are currently in the process of building out our next generation Cloud based sports pricing platform. This allows sports traders in other gaming companies to use our real time quantitative models over the web to predict the outcome of a wide range of sports events in real time. You can find out more about what we're doing here: <a href=\"http://www.sportingsolutions.com/products/c2e\" rel=\"nofollow\">http://www.sportingsolutions.com/products/c2e</a><p>We're looking for great web developers, web ops and customer integration engineers to join us. Core technology stack is .net but we're happy using whatever tools help us get the job done including c#, f#, node.js, scala, erlang, mongodb, rabbit mq and redis to name a few. We're fans of REST, distributed systems and lean start-up methodologies (we see ourselves as an internal start-up - without the raw financial pressures of a typical start-up I guess)<p>If it sounds interesting - get in touch with me - abritcliffe [at] sportingindex.com","time":1328107443,"type":"comment"},{"by":"jasoncartwright","id":3538128,"parent":3537881,"text":"Potato are hiring Django/Python developers in London, Bristol and Amsterdam. Freelance preferred, but fulltime available to exceptional candidates.<p>Our clients include Google, PayPal, News Corp &#38; large agencies. We're a 50 person pure webdev house (no designers, no Flash, no account managers, no sysadmins) working almost exclusively on Google App Engine.<p><a href=\"http://p.ota.to\" rel=\"nofollow\">http://p.ota.to</a>","time":1328107756,"type":"comment"},{"by":"sahil_lmn","id":3538795,"parent":3537881,"text":"Reston, VA (west of Washington, DC) - FULL TIME, INTERN, CONTRACTOR (H1B maybe if already in US)<p>Lucidmedia Networks - <a href=\"http://www.lucidmedia.com\" rel=\"nofollow\">http://www.lucidmedia.com</a><p>Growing Internet ad network looking primarily for generalist Java developers (experience with SQL and front-end web dev would be great too). The Internet advertising industry is quite complex behind the scenes and somewhat parallels the structure of the financial markets. We are analogous to a high frequency trading firm, buying page views to serve ads on behalf of advertising agencies in real-time on exchanges like that of Google or Yahoo. Our server software runs on Spring, MySQL, Redis, and AWS at a glance. We handle about a billion page impressions a day. Big data, big throughput.<p>Small yet experienced team, catered lunches _everyday_, your choice of Mac or PC (all devs are Mac now), good benefits. Our office has superhero posters all over the walls.<p>Contact me directly at sahil_lmn@yahoo.com.<p>We've hired a full-time dev (me) and intern through HN \"Who is Hiring\" threads. These things do work!","time":1328115587,"type":"comment"},{"by":"drusenko","id":3538763,"parent":3537881,"text":"San Francisco, CA - Weebly (<a href=\"http://weebly.com/jobs.php\" rel=\"nofollow\">http://weebly.com/jobs.php</a>)<p>Front-end Web Engineer\nHTML5 Mobile Engineer\nAndroid Engineer\nBack-end Web Engineer\nMySQL DBA\nWeb Designer<p>We're a bit different than your average startup. We're a small team that loves what we do. We only hire others who love what they do, too.<p>Even though we're very profitable, we don't hire just for the sake of it; we hire the best people, then trust them: it's the thinking behind our no-limit vacation policy and company credit card for everyone.<p>We love building things and we focus on being productive, not the amount of time you spend in the office. We hate meetings, so we only have one per week.<p>We put a lot of effort into making Weebly a fun place to work for people who like getting things done.<p>Our millions of users love us (check out our blog comments). We have a net promoter score over 80% (higher than Apple's).<p>Running 2% of all of the websites on the Internet presents some interesting technical challenges. Making a complex task super simple and intuitive is also an ongoing challenge.","time":1328115253,"type":"comment"},{"by":"Noom","id":3544603,"parent":3537881,"text":"Chelsea (Manhattan), NY, full-time, H1B<p>Noom Inc. www.noom.com<p>We’re a 15-person startup with 10+ million users on a mission to help people all over the world lead healthier lives through the use of scalable mobile technology.<p>We need amazing engineers who want to make the world a better place, write elegantly readable and high-performance code, and get things done.<p>If you love tackling hard problems, want to work in an environment where you know exactly how critical your contribution is to the company, and you get a little high from finishing things better and faster than anyone else, we want you!<p>Here are some technologies that we work with on a daily basis (they’re not pre-requisites, just fun things we use right now, and the list will likely change as we grow): Android, iOS, MySQL, Hadoop, git, Java, Python and GWT.  If you’ve never worked with some of them, that’s totally cool--you can learn them here.  The most important thing is a love of creating great software and making a real, quantifiable impact.<p>If you’d like to hear more, please email us at: noom-software-guru@noom.com","time":1328218442,"type":"comment"},{"by":"ddagradi","id":3538628,"parent":3537881,"text":"Pittsburgh, PA - Bearded (<a href=\"http://bearded.com\" rel=\"nofollow\">http://bearded.com</a>)<p>Bearded is a web design and development agency. We’re a small group of web experts focused on inter-disciplinary collaboration as a means to create great websites and applications. Because we’re a small team working on complex projects, our duties frequently overlap, and the ability to work well with others is essential.<p>Bearded is looking for an experienced Interaction Designer / Front-end Developer / UX Advocate to help us build websites, web applications, and native OSX and iOS applications. Throughout the project process you’ll be collaborating with the other members of Bearded, designers and developers alike. The problems we tackle are often unique and complicated, and require a diverse array of skills and talents working in concert.<p>Check out <a href=\"http://blog.bearded.com/post/16770645907/you-should-work-at-bearded\" rel=\"nofollow\">http://blog.bearded.com/post/16770645907/you-should-work-at-...</a> for full details.","time":1328113844,"type":"comment"},{"by":"zeppelin_7","id":3540450,"parent":3537881,"text":"San Francisco, CA, Full Time, H1B<p>Tapjoy is the leader in discovery, engagement, and monetization services for mobile applications. Our turnkey in-app advertising platform helps developers acquire cost-effective, high-value new users, drive engagement within their applications, and create incremental revenue by providing an ad-funded payment method.<p>The Tapjoy ad marketplace spans over 10,000 apps and 280 million global consumers on iOS, Android, Windows Phone 7 and other emerging mobile platforms, delivering more than ~1 million advertising actions per day to developers and brand advertisers. Tapjoy is headquartered in San Francisco with offices in London and Tokyo. Investors include InterWest Partners, North Bridge Venture Partners, D.E. Shaw Ventures, Rho Ventures and J.P. Morgan Asset Management.<p>You can view open positions at: <a href=\"http://tapjoy.jobscore.com/list\" rel=\"nofollow\">http://tapjoy.jobscore.com/list</a><p>We are looking for frontend, backend (or fullstack) engineers. Designers, UI/UX folks are also welcome.","time":1328136292,"type":"comment"},{"by":"mehuln","id":3541306,"parent":3537881,"text":"Flutter (flutter.io) - Full-time, Interns (year around)<p>We're building gesture detection over built-in webcam in devices through the disruptive computer vision technology to enable users to control computers, tablets, TVs, and phones simple finger flicks. Please go to <a href=\"http://flutter.io\" rel=\"nofollow\">http://flutter.io</a> to see our demo video.<p>If you are looking for a very early stage start-up with challenging technical problem in Computer Vision, Machine Learning, and Human Computer Interaction (HCI) then we are the right fit for you.<p>We are looking for:\n1) Full Stack Engineer \n2) Engineers with expertise in C++, Python, Django, and JavaScript\n3) UI &#38; UX expert with neck for understanding HCI - this is not just about creating new graphics... it is really about creating a new way of interaction.<p>We are happy to do H1B, but we're only hiring few folks so you will have to prove your extraordinary talents.<p>Please visit us at flutter.io for more details or send your resume to jobs [at] flutter.io","time":1328153443,"type":"comment"},{"by":"tonyvt2005","id":3538058,"parent":3537881,"text":"Tyson's Corner, VA - Rails Developers - FULLTIME, H1B, INTERN<p>TroopSwap is looking for several RoR engineers to join our small team working on awesome things for the military community.<p>Here's the Github job posting:\n<a href=\"http://jobs.github.com/positions/ba236ece-483c-11e1-8e31-276746c0f8b0\" rel=\"nofollow\">http://jobs.github.com/positions/ba236ece-483c-11e1-8e31-276...</a>","time":1328106930,"type":"comment"},{"by":"codenerdz","id":3539398,"parent":3537881,"text":"San Francisco, FULL-TIME<p>Want to work in the fast growing enterprise social media space in the heart of the SoMa district in San Francisco? The Socialcast team at VMware is actively looking for iOS, Android, Infrastructure and Release engineers.<p>We are working on a number of very exciting products and growing at an extremely rapid pace. Check us out at<p><a href=\"http://www.socialcast.com\" rel=\"nofollow\">http://www.socialcast.com</a><p>Job listings:<p><a href=\"http://bit.ly/w07gmU\" rel=\"nofollow\">http://bit.ly/w07gmU</a><p>please contact the hiring manager directly at rajatg [AT] socialcast.com<p>Personally I started with the company in the beginning of the year and I love it. I'm surrounded by bright and driven people working on bringing social media to the enterprise. Its got the best of both worlds: a startup environment, but backed by a company that is a leader in the virtualization market.<p>My favorite perks:<p>* Great accessible SOMA location<p>* catered lunches 3 times a week<p>* VMWare medical benefits are pretty much second to none<p>* commute benefits are paid for 100%(up to some limit)<p>* 401K matching at 6%<p>* Employee Stock Purchase Plan<p>* Corporate discounts off your mobile bills: around 20% off \nverizon/att/sprint<p>* 9 official holidays, 3 floating holidays, 3 weeks vacation time to begin with and 2 weeks sick time<p>* Best of all: reasonable working hours -- I've been kicked out of the office at around 7pm on numerous occasions<p>P.S. Here is a link to a blog post of one of our Rails gurus on reducing the runtimes of our test by tenfold:<p><a href=\"https://news.ycombinator.com/item?id=3539082\" rel=\"nofollow\">https://news.ycombinator.com/item?id=3539082</a>","time":1328123212,"type":"comment"},{"by":"gnubardt","id":3539333,"parent":3537881,"text":"Cambridge, MA; Seattle, WA, New York, NY; London, UK; Paris, FR<p>Brightcove Inc - <a href=\"http://www.brightcove.com/en/company/careers\" rel=\"nofollow\">http://www.brightcove.com/en/company/careers</a><p>We're an online video platform delivering the 2nd most number of streams (after Youtube).  Join us if you're a smart &#38; nice person who wants to work with a group that operates at massive scale, yet still feels like a small company.<p>We are hiring (and growing) like crazy!  Looking for: Account Manager, Customer Support Specialist, a Sales Director &#38; Sales Manager, Sales Engineers, Rails &#38; Data Engineers, Software Engineering Interns, a Sr. Product Designer and a VP of Operations.  (phew)<p>We deploy continuously, use Java, Ruby/Rails &#38; MongoDB (though we're starting to use NodeJS &#38; Erlang in some projects).<p>We offer a competitive salary, benefits &#38; unmetered vacation time (in the US).<p>Contact me if you have any questions!  sneubardt at brightcove","time":1328122262,"type":"comment"},{"by":"killingmichael","id":3538892,"parent":3537881,"text":"Seeking: 13 developers; Remote / Freelance as well :)<p>Developers who love: iOS, Rails, Node.js.<p>Email me: mj@robotsandpencils.com<p><a href=\"http://robotsandpencils.com\" rel=\"nofollow\">http://robotsandpencils.com</a><p>App Examples - Product Division:\n• Catch the Princess - <a href=\"http://robotsandpencils.com/factory/catch-the-princess/\" rel=\"nofollow\">http://robotsandpencils.com/factory/catch-the-princess/</a><p>• Hidden Cities HD - <a href=\"http://itunes.apple.com/us/app/hidden-cities-hd/id487103601?mt=8\" rel=\"nofollow\">http://itunes.apple.com/us/app/hidden-cities-hd/id487103601?...</a><p>Consulting Division:\n• Series A funded Startups to F500\n• Media/Hollywood to Oil and Gas.\n• LARGE PDF: <a href=\"http://robotsandpencils.static.s3.amazonaws.com/Robots%20and%20Pencils%20-%20About%20Us%20-%20Winter%202011%20-%20Website%20Edition.pdf\" rel=\"nofollow\">http://robotsandpencils.static.s3.amazonaws.com/Robots%20and...</a><p>We offer profit/royalty share (consulting and product divisions).","time":1328116688,"type":"comment"},{"by":"lemming","id":3537945,"parent":3537881,"text":"FULLTIME, REMOTE ok<p>TxVia is looking for several strong system administrators to help us grow our payments business. We're well funded and have a lot of big clients including some household names. Our primary office is in NYC but working in our satellite offices (Dublin, Barcelona, Manila) or remotely would be fine too.<p>We run everything on Linux, we run both virtualised and bare metal environments. We need someone with experience in multi tier network environments (IPS, IDS etc), general network maintenance and support. We're on a big push to automate things we should have a long time ago, so strong scripting skills are a huge plus, as is experience with using Nagios for monitoring. Our software stack is Java so JVM performance tuning and analysis is also desirable. We have lots of interesting problems.<p>Mail me directly for more details or with questions, colin@&#60;company&#62;.com","time":1328105420,"type":"comment"},{"by":"danielsju6","id":3539312,"parent":3537881,"text":"Brookline, MA (Coolidge Corner) - Mobile Application Development<p>Raizlabs is a leading mobile development company based in Brookline, MA.  Millions of users around the world use the applications that we’ve built for our clients, and we’re always looking for talented mobile developers (iOS and Android), designers and project managers to join our team.<p>We partner with companies, agencies and startups that believe mobile is bigger than just building an app.<p>Our mission is to help companies navigate the mobile space through strategy, user interface design and development services. Our collaborative process results in easy-to-use applications that deliver superior results. Raizlabs focuses on creating top-selling, award-winning products.<p>Find out more about Raizlabs at <a href=\"http://www.raizlabs.com\" rel=\"nofollow\">http://www.raizlabs.com</a>. If interested, please submit a resume through our website.","time":1328121991,"type":"comment"},{"by":"myenergy","id":3538320,"parent":3537881,"text":"MyEnergy - Boston, MA - FULL TIME: VP Eng, Data &#38; Rails Engineers <i>and</i> Communications Director<p>We're building the consumer side of the universal energy internet, and we're looking for talented engineers to bring it to life. Working atop datasets never before accessed and assembled in the same place, you'll build experiences and interactions that make a difference here at home and the world over.<p>MyEnergy, formerly Earth Aid, was recently named to Fast Company's Top 10 Most Innovative Companies in Energy. We're venture-backed, with strong strategic partners and investors committed to our vision of building the people's energy internet. We've been called \"the killer app for energy efficiency\" ( <a href=\"http://bit.ly/dZBy7q\" rel=\"nofollow\">http://bit.ly/dZBy7q</a> ) and our work has been featured in publications such as Mashable ( <a href=\"http://on.mash.to/hqyZqF\" rel=\"nofollow\">http://on.mash.to/hqyZqF</a> ), TechCrunch, The New York Times ( <a href=\"http://nyti.ms/ayzLHb\" rel=\"nofollow\">http://nyti.ms/ayzLHb</a> ), The Washington Post, and The Philadelphia Inquirer.<p>We're currently hiring for:<p>* a VP Engineering to lead us in tripling our team =&#62; <a href=\"https://www.myenergy.com/careers/vp_engineering\" rel=\"nofollow\">https://www.myenergy.com/careers/vp_engineering</a><p>* Rails Engineers to take ownership in dreaming up and building out new front and backend functionality =&#62; <a href=\"https://www.myenergy.com/careers/rails_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/rails_engineer</a><p>* Data Engineers &#38; Scientists to embark upon ambitious projects leveraging machine learning and AI =&#62; <a href=\"https://www.myenergy.com/careers/data_engineer\" rel=\"nofollow\">https://www.myenergy.com/careers/data_engineer</a><p>* UI Designers to make the whole of the user experience astounding =&#62; <a href=\"https://www.myenergy.com/careers/ui_designer\" rel=\"nofollow\">https://www.myenergy.com/careers/ui_designer</a><p>* <i>and</i> a Communications Director to articulate and spread the good word! =&#62; <a href=\"https://www.myenergy.com/careers/comms_director\" rel=\"nofollow\">https://www.myenergy.com/careers/comms_director</a><p>We've just opened up our new HQ in a sunny two story loft by Faneuil Hall in Boston, and we offer very competitive salaries, excellent benefits, a fun company culture, and a small arsenal of office helicopter drones. If you might like to join us, send us an email to introduce yourself to jobs at myenergy dot com","time":1328110311,"type":"comment"},{"by":"phillytom","id":3538183,"parent":3537881,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>We're hiring at Monetate. We've hired great people from HN.<p>We're a SAAS provider of testing, targeting, merchandising, agile content tools, primarily in internet retail.  We're funded by First Round (among others).<p><a href=\"http://jobs.monetate.com/\" rel=\"nofollow\">http://jobs.monetate.com/</a><p>* We're looking for backend engineers who want to work on data and web problems at scale.\n* We're also hiring front-end developers who want to help build and test experiments and own our client facing UI. You should be experienced in working with production-quality cross-browser HTML/CSS and Javascript with and without frameworks.<p>We have fun problems at scale, great people to work with, and we get instant feedback from our clients on everything we put out! We're having a blast.<p>Feel free to email me with any questions - tjanofsky monetate com.","time":1328108524,"type":"comment"},{"by":"wjessup","id":3540392,"parent":3537881,"text":"Hiring LA or SF: Senior Technical Producer.<p>Competitive salary, benefits &#38; build big things.<p>Your Job: You’ll work directly with our customers, their teams, and our engineers to distill requirements &#38; develop project plans, design solutions, and keep projects running smoothly.  You need to understand application development &#38; project management and be able to communicate technology in human terms. A background as an engineer or some other technical role is preferred.<p>About Us: Citrusbyte is a highly specialized custom software development consultancy. We are brought in to build large software / technology projects such as ad networks, health platforms, business platforms and more. Our work is typically from concept through launch and beyond. We practice agile development, use small teams ( 2-6 ), and focus on developing a team of A players.<p>Apply: jobs@citrusbyte.com","time":1328135540,"type":"comment"},{"by":"leeny","id":3538478,"parent":3537881,"text":"TrialPay (offer-based payments) in Mountain View, CA is looking for full-time software engineers.<p>And we just got some pretty good press: <a href=\"http://techcrunch.com/2012/01/31/trialpay-40-million-visa-greylock/\" rel=\"nofollow\">http://techcrunch.com/2012/01/31/trialpay-40-million-visa-gr...</a><p>Some of the shiny, new things we're working on this year include managing huge volumes of data (~we're now getting 50 million unique visits a day), creating mobile apps for multiple platforms, and improving the huge constraint optimization problem at the heart of our business model (which offers we should show to which users).<p>So, if you're a great programmer and are excited about working on these kinds of things, please email me: aline at trialpay dot com<p>(More info on jobs page, too: <a href=\"http://www.trialpay.com/about/jobs/\" rel=\"nofollow\">http://www.trialpay.com/about/jobs/</a>)","time":1328112292,"type":"comment"},{"by":"cristinacordova","id":3539156,"parent":3537881,"text":"Palo Alto, CA (across the street from the downtown Palo Alto Caltrain station) - FULL-TIME &#38; INTERNS<p>We're looking for people to fill the following roles on our 18-person team:<p>Backend Engineer, iOS Engineer, Web Engineer, Android Engineer, Data Scientist, Office Manager<p>Pulse makes the most downloaded news application for iPhone, iPad, Android and Windows Phone. At Pulse, you will work closely with a tight-nit team of experienced engineers. Each of us is part engineer, hacker and product designer. Pulse was originally founded in the Stanford Design School. Beautiful, user-centric design is at the heart of our product and work. We recently raised a Series A round of funding led by NEA and Greycroft.<p>Find out more about us here: <a href=\"http://www.pulse.me/jobs/\" rel=\"nofollow\">http://www.pulse.me/jobs/</a> and feel free to send your resume to me at cristina@pulse.me","time":1328119847,"type":"comment"},{"by":"mstangel","id":3538235,"parent":3537881,"text":"West Hollywood, CA - Geni.com, home of the world's largest family tree, has two openings:<p>Network Operations Specialist\nQuantitative Product Analyst<p>We're a fun, flexible team looking to expand with enthusiastic go-getters.  More information at <a href=\"http://www.geni.com/corp/jobs/\" rel=\"nofollow\">http://www.geni.com/corp/jobs/</a>","time":1328109173,"type":"comment"},{"by":"wetbrain","id":3541818,"parent":3537881,"text":"San Francisco, fulltime/internships/H1B\nCauses - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a><p>At Causes, use your programming powers to build the world's largest platform for collective action. Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, open source contributions encouraged:<p><a href=\"https://github.com/causes/suggestomatic\" rel=\"nofollow\">https://github.com/causes/suggestomatic</a> -- item based collaborative filter<p><a href=\"https://github.com/causes/buffet\" rel=\"nofollow\">https://github.com/causes/buffet</a> -- distributed testing framework for Ruby<p><a href=\"https://github.com/causes/mock_redis\" rel=\"nofollow\">https://github.com/causes/mock_redis</a> -- mock redis Ruby gem<p>Apply through the site or rob@causes.com if interested!","time":1328167766,"type":"comment"},{"by":"redguava","id":3538366,"parent":3537881,"text":"Melbourne, Australia.  Full-Time Ruby on Rails developer.<p>Work for a small bootstrapped startup with great culture. Benefits include:<p>- 4 day work week, full time pay.<p>- Great computer equipment.<p>- Flexible hours.<p>- Mostly on-site role but some remote work is fine.<p>- Challenging work with latest technologies.<p>See all the details here <a href=\"http://redguava.com.au/jobs\" rel=\"nofollow\">http://redguava.com.au/jobs</a>","time":1328110915,"type":"comment"},{"by":"flippyhead","id":3538283,"kids":[3538364],"parent":3537881,"text":"Remote (or Seattle, WA)<p>Pathable is hiring CoffeeScript/JavaScript, Ruby, and CSS/SASS/HTML\"5\" developers. We build social software to dramatically improve how people interact, communicate and meet at conferences and events. We're profitable, majority owned by the original founders and growing. We offer full benefits, maternity/paternity leave, significant equity and competitive salaries. Work with an exciting team of smart, progressive developers advancing the next generation of web application technologies. Did I mention we <i>encourage</i> working remotely and the nomadic programmer life-style?<p>Please have a look: <a href=\"http://www.pathable.com/careers-at-pathable/\" rel=\"nofollow\">http://www.pathable.com/careers-at-pathable/</a><p>Please apply here: <a href=\"http://jobsco.re/vPBk6r\" rel=\"nofollow\">http://jobsco.re/vPBk6r</a>","time":1328109860,"type":"comment"},{"by":"blo","id":3539688,"parent":3537881,"text":"San Francisco, CA (SOMA). Full time.<p>Stealth - consumer web and mobile<p>--<p>We recently closed funding (unannounced) from well-known investors. This is an opportunity to join at the earliest stages and help shape product/culture.<p>Do you find yourself using Google to navigate websites that you commonly use, or end up with many browser tabs trying to accomplish some task? We're innovating along how people interact with online services and designing a new web-based experience that allows users to accomplish tasks in a more usable, efficient, and social manner.<p>In addition to great full stack engineers, we are actively hiring front-end and mobile (iOS/Android) developers.<p>We work mainly with Javascript (jquery and node.js) and HTML5.  Our office in San Francisco overlooks the Embarcadero waterfront.<p>Curious? Contact [my username] at alum.mit.edu. And yes, we have hired from these threads in the past!","time":1328127403,"type":"comment"},{"by":"jedberg","id":3540574,"kids":[3544635],"parent":3537881,"text":"Los Gatos, CA Netflix<p>Looking for Senior SREs.<p>Basically, we're acting like a new company to take streaming global and make it so convient that it is better than the free options.<p>I'm looking for people to help make sure that any time someone wants to find and play a movie, they can.<p>We're solving lots of really interesting problems, like how do you maintain a reliable service on hardware that is unreliable and you don't control (Amazon Web Services).<p>Our group also gets to help teach other groups how to build for scale.<p>Come join me!<p>You can get more info here: <a href=\"http://jobs.usethesource.com/item?id=166\" rel=\"nofollow\">http://jobs.usethesource.com/item?id=166</a><p>Or here: <a href=\"http://www.reddit.com/comments/jyaqd/\" rel=\"nofollow\">http://www.reddit.com/comments/jyaqd/</a><p>Or here: <a href=\"http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr\" rel=\"nofollow\">http://www.netflix.com/Jobs?id=7563&#38;jvi=olLGVfwr</a>","time":1328138127,"type":"comment"},{"by":"arcoleo","id":3545467,"parent":3537881,"text":"San Francisco, CA (near Ferry Building).  Full time.<p>Kontagent is building analytics for social and mobile apps.  We are handling billions of daily messages and growing.<p>We are looking for engineers (lots!), account managers, data scientists, graphic designers, a controller, director, and more.  We have a small-ish sized group and are rapidly growing.<p>For engineers, we are looking for C and/or C++ engineers, python engineers, and more.  Quality of the person of course trumps any buzzwords.<p>If you feel you may have something to offer but are unsure about a position, don't see a position listed, or even just want more detail about what we are looking for and what we're like to work for, please contact me.  I'm a developer here myself and would be happy to chat w/ anyone who would like to know more.<p>Please contact me at david.arcoleo [at] kontagent.com","time":1328236612,"type":"comment"},{"by":"lpolovets","id":3539165,"parent":3537881,"text":"Bay Area or Los Angeles or Shanghai strongly preferred, but remote work is possible for exceptional candidates (must live in the U.S.). Full-time only. H1B is okay. We also have several summer internship opportunities.<p>Factual's vision is to be an awesome and affordable data provider, so that developers, startups, and big companies can focus on innovation instead of data acquisition. We believe in openness and transparency rather than proprietariness and obfuscation.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). In late 2010, we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Newsweek, Loopt, and Blekko. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We currently have about half a dozen job openings, from data engineering to software engineering to system administration. For the software engineering position, you would ideally know Java, Clojure, and/or Ruby, and you'll get bonus points for experience with machine learning, NoSQL, algorithms, infrastructure, and/or Hadoop.<p>If you're interested in the Bay Area office, it just opened in December of 2011, so you'd have a significant influence on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1328120078,"type":"comment"},{"by":"ubervero","id":3540370,"parent":3537881,"text":"Brooklyn, NY. Full time.<p>Docracy is the GitHub for legal documents. We are disrupting legal services for good by open sourcing contracts and allowing everyone to branch and sign them. You can have a look for yourself here: <a href=\"http://www.docracy.com/\" rel=\"nofollow\">http://www.docracy.com/</a><p>We are a diverse team of 2 senior devs (Docracy's MVP was built in the time of a Hackathon - and won) and a fully recovered lawyer. VC-backed, working of the new NYU incubator in Dumbo.<p>We are looking for a seriously good front-end dev with a sense of design to create a document editor that will put MS Word to sleep forever, and a Java developer who will learn from the best of the best. More info here: <a href=\"http://www.docracy.com/application/jobs\" rel=\"nofollow\">http://www.docracy.com/application/jobs</a>","time":1328135273,"type":"comment"},{"by":"bijanv","id":3549986,"parent":3537881,"text":"Toronto, Canada - Full Time<p>Full Stack Web Engineer<p>EventMobi is looking to add incredible talent to it's rapidly growing team (we're now 11 from the 5 we were 3 months ago!) We're looking for someone who's interested in taking on a real challenge and solving interesting technical problems.<p>We're in need to scale our architecture, build out our API, and continually add awesome features to our platform.<p>Our mobile apps are built off Backbone.js, Handlebars.js, Zepto, HAML, SASS and a few of our own internal 'frameworks' working off a Node.JS server<p>Our backend and app generator is built off a sturdy LAMP stack and we use Ruby for all of our testing and test automation (Cucumber based).<p>If this alongside work that rolls out to hundreds of thousands of users sounds interesting to you, send us an email to work@eventmobi.com or hit me up on twitter @bijanv","time":1328321749,"type":"comment"},{"by":"l_adams","id":3538876,"parent":3537881,"text":"Chicago - Narrative Science (<a href=\"http://www.narrativescience.com/careers.html\" rel=\"nofollow\">http://www.narrativescience.com/careers.html</a>)<p>We have an platform that transforms data into stories. We're growing our engineering and sales teams.<p>We're a python shop with a number of front end apps that rely on backbone and flask. We use a mixture of storage solutions, primarily MongoDB and Redis.<p>Customers include large online publishers, data companies, ad networks and agencies.<p>We're hiring for the following positions (see the link above for detailed job descriptions).<p><pre><code>   * Data Scientists (Chicago)\n   * Software Engineers: Front-end, Back-end and DevOps (Chicago)\n   * Sales Executives (New York &#38; Chicago)\n   * Account Manager (Chicago or New York)\n   * Manager of Content Production (Chicago)</code></pre>","time":1328116497,"type":"comment"},{"by":"meganelacarte","id":3541747,"parent":3537881,"text":"Palo Alto, CA. Full time &#38; Interns.<p>E la Carte: \nOur 'Presto' touch-screen tablets increase restaurant efficiency and profitability, as well as guest interaction by enabling guests to browse appetizing pictures of the entire menu, place orders, split checks, make payments, and play interactive games – all from the comfort of their restaurant seats without having to wait.<p>We're 33 strong now and brimming at the seams of our Palo Alto house. We're scaling, the demand for our product is huge, and we're growing FAST - hence we have various positions continuously come open in Engineering, Technical Operations, UI Graphic Design, and Business Development.<p>Check out www.elacarte.com/jobs and if you don't see something you fit, email me anyway, especially if you're a Python hacker. :)","time":1328165074,"type":"comment"},{"by":"good","id":3539788,"parent":3537881,"text":"Los Angeles (remote in US/H1B for the right fit) - Ruby on Rails Developers, Sys-Admins, QA<p>Tired of just not doing evil and actually want to do GOOD? If so, check out GOOD (www.good.is). GOOD is a small startup in Los Angeles focused on building tools for people who are pushing the world forward. We are currently looking for some talented software engineers, sysadmins and QA peeps to help us build out our next generation citizenship platform. Interested?  Know someone who might be?  We are offering referral bonus to anyone who can refer us a great candidate  - even if that candidate is you.<p>Check out our available jobs at: <a href=\"http://www.irecruityou.com/company/good\" rel=\"nofollow\">http://www.irecruityou.com/company/good</a>","time":1328128581,"type":"comment"},{"by":"kevingessner","id":3538932,"parent":3537881,"text":"New York NY - Fog Creek Software<p>Intern and Full-time<p>We're looking for top-notch software developers and sysadmins/devops magicians, as well as designers and front-end developers.<p>Great salary, kick-ass benefits.<p>Learn more at <a href=\"http://www.fogcreek.com/careers.html\" rel=\"nofollow\">http://www.fogcreek.com/careers.html</a>","time":1328117313,"type":"comment"},{"by":"rogupta","id":3540340,"parent":3537881,"text":"Boston, MA. Full time.<p>Funded stealth startup looking for an early web developer to help shape the future of the company. The team is focused on building solutions for the electric utility market, addressing a huge problem. <p>The ideal candidate should include:\n- Experience with PHP, Javascript, jQuery\n- Optional experience with Python or Ruby\n- Familiarity with Amazon AWS \n- Ability to solve problems and work independently \n- Ability to function as part of a small but focused team \n- Engineering or technical background<p>Offer will include great equity, challenging projects, opportunities to grow, and flexible work options/locations.<p>Will consider recent grads as well as experienced engineers. Please email rogupta@alum.mit.edu if you're interested.","time":1328134956,"type":"comment"},{"by":"TimothyFitz","id":3538994,"parent":3537881,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\". Yes, your day job will be writing code. But that's the only similarity to a big company software job.<p>You'll be challenged to take big ideas and turn them into concrete testable hypotheses. Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>More details and how to apply <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1328117997,"type":"comment"},{"by":"danielsju6","id":3539269,"parent":3537881,"text":"Paid interns (on-site) wanted for Boston start-up.<p>Come kick-ass in Coolidge corner with the Raizlabs Team (<a href=\"http://www.raizlabs.com/\" rel=\"nofollow\">http://www.raizlabs.com/</a>) to hack on AppBlade (<a href=\"https://appblade.com\" rel=\"nofollow\">https://appblade.com</a>) a start-up in the mobile application distribution space; built in Ruby on Rails. This is a paid position that has the real possibility of getting you onboard with salary/benefits.<p>Familiarity with programming and web-development would be appreciated. Ideal candidates are interested/experienced in Rails, can handcode HTML/CSS, Objective-C, and ready to kick some ass in the mobile space.<p>Hit me up at james.daniels@raizlabs.com, stay hungry my friends.","time":1328121421,"type":"comment"},{"by":"kevinburke","id":3540839,"parent":3537881,"text":"San Francisco, CA<p>Twilio is hiring. Want to call/text message your users, or build a product around phones? Instead of writing horrible interface code to text message or call users, people use Twilio's REST API to take care of the messages and get back to doing what they do best - building great web apps.<p>We are growing like crazy and hiring for lots of positions - see a full list here <a href=\"http://www.twilio.com/company/jobs\" rel=\"nofollow\">http://www.twilio.com/company/jobs</a>. Two good ways to get your resume to the top of the pile: build a Twilio app, and mention this HN post in your cover letter.<p>Remote considered for Developer Evangelist, Marketing and Support positions, but not engineering. Interns welcome.","time":1328142616,"type":"comment"},{"by":"ivanzhao","id":3539261,"parent":3537881,"text":"Inkling, San Francisco, CA<p>Inkling is a publishing startup. We are a new medium, the future of books and publishing (currently with a focus in textbooks on iPad); our platform is so good that completely leaves ebooks in dust, and even most major publishing houses are invested in us.<p>We are hiring engineers of all kinds, from the JavaScript/Python/Scala/iOS to interns. We are Sequoia-backed and just recently secured another round of $17 million funding.<p>The team is lean and flat. Located in the downtown SF, TV-celebrity chef in house, best gym in town, plus generous salary and options.<p><a href=\"http://www.inkling.com/jobs/openings/\" rel=\"nofollow\">http://www.inkling.com/jobs/openings/</a><p>Contact me if you are interested (annemarie@inkling.com)","time":1328121295,"type":"comment"},{"by":"shawndrost","id":3538501,"kids":[3540922],"parent":3537881,"text":"OKCupid Labs is hiring designers, engineers, and more.   Help us invent new products for the modern (mobile) web in our brand-new, dog-friendly SF office.  You'll meaningfully impact product direction, contribute to open source, and hook tons of people up. (Oh, and we're mostly a ruby + coffeescript shop -- all the C++ is in NY.)<p>I started as a developer two months ago, and I'm really enjoying it here: people are positive, and it's a pleasant mix between a startup and established company.  If you have any questions, send em over to drost@okcupidlabs.com and I'll get back to you with a candid response.<p><a href=\"http://jobs.okcupidlabs.com/\" rel=\"nofollow\">http://jobs.okcupidlabs.com/</a>","time":1328112555,"type":"comment"},{"by":"randy","id":3539365,"parent":3537881,"text":"Ridejoy (YC S11). San Francisco, CA. Full time.<p>Lead designer and engineer number one.<p>Interested in fundamentally changing the way people travel or, as one of our users said, \"restoring people's faith in humanity\"?<p><a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a>","time":1328122717,"type":"comment"},{"by":"tomh","id":3538455,"parent":3537881,"text":"Waltham, MA. OpenClinica LLC is hiring (onsite, part- and full-time)!<p><a href=\"https://openclinica.com/openclinica-careers\" rel=\"nofollow\">https://openclinica.com/openclinica-careers</a><p>OpenClinica is an open-source clinical data management system that has been deployed to labs and universities around the planet.  If you are passionate about clinical research, open standards, open source, agile methodologies, and actively creating and contributing to a startup culture, come join us.<p>Out technology stack is Java, Spring, Hibernate, Postgres, some Oracle, jQuery, and XSL/XML transformations. If interested, feel free to email me through thickerson at openclinica dot com.","time":1328112024,"type":"comment"},{"by":"baspland","id":3540452,"parent":3537881,"text":"WhatsApp Inc - BlackBerry App Developer – Java-ME\nMountain View, CA<p>We are looking for experienced BlackBerry client engineers to work on our Blackberry Team.<p>We are looking for engineers who are passionate about the BlackBerry user experience. Using your start-up mindset and your experience developing native mobile apps, you will create new, awesome features used by millions of current WhatsApp BlackBerry users. You must have the ability to work in a very small team and self-organize feature prioritization and delivery; You will own release and QA cycles of your code;<p>Client Engineer requirements:<p>•\tBS in computer science or equivalent.<p>•\tStrong Java programming and Debugging skills, with an understanding of Java-ME limitations<p>•\tExperience developing native BlackBerry apps is strongly preferred, but not required<p>•\tWorking experience with TCP, Messaging, IM, and Push APIs<p>About WhatsApp, Inc. WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows Phone, and Nokia smartphones. In addition to basic messaging, WhatsApp Messenger users can send each other unlimited images, video and audio messages as well as participate in groups.<p>WhatsApp Inc. was founded in 2009 by two ex-Yahoo! engineers. We are located in a spacious office in downtown Mountain View. We are profitable, funded, and we offer very competitive compensation packages. \nOther reasons to join us:\n- work side-by-side with the founders\n - unlimited supply of latest (and even unreleased yet) smartphones\n - fully stocked fridge from Whole Foods \n- herman miller embody chairs \n- frequent company paid lunches and dinners\n - open space, collaborative environment<p>WhatsApp Inc is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status.<p>to apply please go to the following link <a href=\"http://jobsco.re/wSDfNx\" rel=\"nofollow\">http://jobsco.re/wSDfNx</a>","time":1328136307,"type":"comment"},{"by":"jstsch","id":3541088,"parent":3537881,"text":"Den Haag/The Hague, The Netherlands. Full time.<p>Looking to add talented (backend/frontend &#38; mobile/app) developers to our small team of six, within a larger firm. We have a mission to make the world more sustainable.<p>In the group you'll find both a passion for good design &#38; quality code. We try to get our clients to embrace agile development and stay on the edge of modern web technologies.<p>Profile: You enjoy working on multiple short and longer-term projects. You can either focus on code, or also help in finding the best online solution to the clients needs. We develop mostly in PHP and love open source.<p>Interested? Drop me a note at jschuttelaar@schuttelaar.nl.","time":1328147941,"type":"comment"},{"by":"kvogt","id":3539399,"parent":3537881,"text":"San Francisco, CA.  Remote ok, but you're always welcome in the office.  Full time.<p>Justin.tv has iOS applications with over 15 million downloads, and we're looking for a talented engineer to be the lead developer on these apps.  Yes, you can work remotely and on your own schedule.  Justin.tv is a fast-moving company with an incredible video technology stack.  Part of the challenge in this position will be keeping up with the new features that come out and figuring out how to best format those for the mobile experience.<p>You will be judged based on the apps you've built and the code you've written, not your job title or education.","time":1328123230,"type":"comment"},{"by":"skavish","id":3539625,"kids":[3565875],"parent":3537881,"text":"Boston, MA - Full Time - <a href=\"http://animatron.com/\" rel=\"nofollow\">http://animatron.com/</a><p>We are small, well funded startup in Boston building awesome web app for designers and animators.<p>We are looking for developers who know Java/GWT/JavaScript or ObjectiveC/iOS or Android. We use bleeding edge HTML5 technologies (canvas, webgl, audio, video api etc) and Java/MongoDB on server side.<p>We provide competitive salary, stock options, benefits, very flexible hours and vacation. We would prefer locals, but can sponsor H1b for a right candidate.<p>Currently we are located in Framingham, MA but will be moving to Cambridge, MA this summer.<p>Contact me if you have any questions.","time":1328126562,"type":"comment"},{"by":"chauzer","id":3539738,"parent":3537881,"text":"New York, NY - Betterment (<a href=\"http://www.betterment.com\" rel=\"nofollow\">http://www.betterment.com</a>)\nFULLTIME or INTERN<p>We're a VC funded tech startup simplifying investing and making it accessible to everyone. We're located in SoHo in NYC and launched at TechCrunch Disrupt in May 2010 and won for \"NYC's Biggest Disruptor\".<p>Main positions we're looking to fill are:<p>Software Engineers (Java/backend/generalists):\n* Java, Spring, Hibernate, MySQL<p>Frontend Engineers\n* Javascript, JQuery, Flex, HTML5<p>Email jobs[at]betterment.com or see <a href=\"https://www.betterment.com/about/jobs/\" rel=\"nofollow\">https://www.betterment.com/about/jobs/</a> for more info","time":1328127967,"type":"comment"},{"by":"neebz","id":3538237,"parent":3537881,"text":"Engine Room Apps  - Leeds, UK<p>Experienced iOS Developer (Full Time, On site)<p>Required skills:<p>iOS SDK to version 5.0\nXML/JSON/SOAP and RESTful web services\nStrong core iOS development experience with knowledge of core frameworks such as Core Data, Core Animation, CoreLocation etc\nSQLite\nXcode 4.2 development environment\nOpenGL ES\nGit source control<p>----------<p>Experienced Android Developer (Full Time, On site)<p>Required skills:<p>Android SDK and Blackberry API\nXML/JSON/SOAP and RESTful web services\nStrong core Java development experience with knowledge of core Java SDK and libraries\nMySQL, SQLite\nEclipse development environment\nBlackberry SuperApp\nGit source control<p>contact: muneeb [at] engineroomapps [dot] com","time":1328109187,"type":"comment"},{"by":"carbon8","id":3540859,"parent":3537881,"text":"San Francisco, CA.<p>Byliner Inc. is a publishing company and social network built around great stories. We are an online archive of long form journalism and fiction, as well as a publisher of original stories for iPad, Kindle, and other mobile devices.<p>We use Ruby, MySQL, Redis, Sass and are making the shift to using Backbone and CoffeeScript on the front-end. We also produce ebooks.<p>Looking for both UI and back-end developers. Full Time and/or contract.<p>Also starting to look for a designer for help with landing pages and graphics on a contract basis.<p>More info: <a href=\"http://byliner.com/jobs\" rel=\"nofollow\">http://byliner.com/jobs</a>","time":1328142923,"type":"comment"},{"by":"podiodev","id":3540039,"parent":3537881,"text":"Copenhagen, Denmark<p>Podio is looking for an Android developer to join our team in Copenhagen. You'll be doubling the size of our awesome mobile team, and joining one of the best dev shops in Europe.<p>The challenges are many. You'll need to have a great flair not only for code, but also great mobile UI, taking full advantage of everything Ice Cream Sandwich has to offer. Take a look at our existing apps on iOS and Android and tell us what you think.<p>If you are interested, apply directly at <a href=\"https://company.podio.com/jobs#android\" rel=\"nofollow\">https://company.podio.com/jobs#android</a>","time":1328131696,"type":"comment"},{"by":"EToS","id":3540299,"parent":3537881,"text":"RSA Group / MORETH&#62;N Insurance\nHorsham, UK. FULL TIME<p><a href=\"http://beta.morethan.com\" rel=\"nofollow\">http://beta.morethan.com</a>\n<a href=\"http://www.rsagroup.com\" rel=\"nofollow\">http://www.rsagroup.com</a><p>We're a new EBusiness team at the heart of a FTSE 100 Company, Looking for Amazing UI Developers, and Brilliant Back-end Hackers..<p>Primarily we're a Python (Django) and Java (SpringMVC, Fatwire) dev team, Working on strategic web applications like anti-fraud and e-docs through to large Enterprise infrastructure..<p>Come join us!  <a href=\"http://bit.ly/yZU5u0\" rel=\"nofollow\">http://bit.ly/yZU5u0</a>","time":1328134578,"type":"comment"},{"by":"gerardramos","id":3570326,"parent":3537881,"text":"New Orleans, LA. Possibly Remote. Contract, Full Time.<p>Unawkward (<a href=\"http://unawkward.com/\" rel=\"nofollow\">http://unawkward.com/</a>) was recently accepted into an accelerator in New Orleans called Launch Pad Ignition (Tech Stars Affiliate) <a href=\"http://launchpadignition.com/\" rel=\"nofollow\">http://launchpadignition.com/</a>  ..<p>I'm looking for a PHP developer to join me for the next 12 weeks of hackage.<p>Unawkward brings people together to have a damn good time.  If you or someone you know wants to join the party, send an email to gerard@unawkward.com with resume and links.<p>Thanks!","time":1328777828,"type":"comment"},{"by":"amduser29","id":3538145,"parent":3537881,"text":"San Francisco, CA - Lead Mobile Developer<p>Life360 is<p><pre><code>  - a utility used by over 11,000,000 family members\n  - set on making a difference in people's lives\n  - working on some very ambitious goals\n  - backed by top-notch investors\n</code></pre>\nLife360 is not<p><pre><code>  - another photo sharing app\n  - a Groupon clone\n  - built on the FB platform\n</code></pre>\nLife360 offers<p><pre><code>  - interesting and engaging work\n  - great pay and awesome equity\n  - lots of freedom\n</code></pre>\nLife360 would love to tell you more<p><pre><code>  - alex@life360.com\n  - http://life360.jobscore.com/list</code></pre>","time":1328107998,"type":"comment"},{"by":"erikapod","id":3541536,"parent":3537881,"text":"Waterloo, Ontario, Full time<p>At Kik, we're about to launch our second product that looks and feels nothing short of magic. We look for<p>1) Wicked smart\n2) Obsessed with coding \n3) Get's it done<p>Web application developer - you're a javascript wizard. You want to make cool things happen on our new platform.<p>Java Backend developer - scaling to handle the the wave we're about to hit. We're launching our new product in weeks.<p>Platform developer - leading the charge with our new platform. You're probably working on an open source project now, aren't you?<p>Curious about what you'd be working on? let's chat - erika at kik dot com","time":1328159547,"type":"comment"},{"by":"winton","id":3539225,"parent":3537881,"text":"Bleacher Report - San Francisco, CA (Financial District). Full time.<p>We are the 4th largest sports web site in the United States, just behind ESPN, Fox Sports, and Yahoo.<p>Work on a site that reaches 20 million people per month while getting exposure to a variety of technologies (we routinely play with Rails, Node.js, Redis, eventmachine, and Sinatra). We encourage our employees to contribute to open source as apart of their work at Bleacher Report.<p><a href=\"http://bleacherreport.com/careers/engineering\" rel=\"nofollow\">http://bleacherreport.com/careers/engineering</a>","time":1328120746,"type":"comment"},{"by":"BJK","id":3540460,"parent":3537881,"text":"New York City, NY, Full Time, Ruby Developer.<p>We are Plexus Entertainment, developers of gowatchit.com, a new start-up making waves in the film industry; and we're currently seeking talented ruby developers to join our small, dynamic team. We launched a little over a month ago, and have already gotten some exciting press, including a Pogie from New York Times columnist David Pogue. Please check the following link for details: <a href=\"http://www.gowatchit.com/pages/jobs\" rel=\"nofollow\">http://www.gowatchit.com/pages/jobs</a>","time":1328136490,"type":"comment"},{"by":"cpenner461","id":3541532,"parent":3537881,"text":"Nashville, TN or Washington DC.  Full time.<p>Doing really interesting work with unstructured \"big data\" in our core product Synthesys.  Some of the technologies we're using:<p>* Lots of Java, some Python<p>* Hadoop<p>* HBase<p>* Cassandra<p>* AWS/EC2<p>We recently finished an investment round with Silver Lake and are looking to fill a variety of positions from core developers, to system administrators, to research positions.  All the the technical details are at <a href=\"http://www.digitalreasoning.com/careers/\" rel=\"nofollow\">http://www.digitalreasoning.com/careers/</a>.<p>Feel free to ping me (charlie dot penner at digitalreasoning.com) with any questions.","time":1328159517,"type":"comment"},{"by":"alexgodin","id":3539538,"parent":3537881,"text":"New York, NY Full Time (remote or relocation)<p>Backend Engineer @ Dispatch.io<p>What we do\n----\nDispatch connects your cloud services to give you one place to organize, share, and collaborate around your stuff. Our vision is for a more connected cloud.<p>Why you should work here\n----\nWe are a small, fast-moving team who are passionate about building awesome things. You'd be one of the first few members of the team (we’re 5 people right now).<p>We have a big open office in the Flatiron district in NYC, in the center of the NYC tech scene. Our kitchen is well stocked, and our Campfire overfloweth with animated GIFs. As a team member you'll work on your schedule, have access to competitive health insurance plans, a chance to earn real equity, and, most importantly, the opportunity to contribute in a big way to building new ways to organize, collaborate and share in the cloud.<p>We're looking for a backend engineer. The Dispatch backend is a service oriented architecture, built entirely on AWS. Most of the current services are written in Java (and some Scala), but we’re language agnostic. Want to write that new service in Fortran? Go for it! Ok, maybe not. Let’s talk about it.<p>You'll work on architecting and building new stuff, and on improving existing services.<p>Like hacking on 3rd party APIs? Good, because we build on Dropbox, Google Docs, Facebook, Twitter, Gmail, with plans for many more.\nInterested in file transfer and sync? We’re making moving files in the cloud fast and reliable. Search? We’re building search across the stuff in your clouds. Realtime? You can head up our plans to move from asynchronous polling to a socketed system.<p>Things we're looking for\n----<p>* Good architecture skills with a focus on details, experience with fault-tolerance, use of message queues, etc.\n* Experience with small or cross-functional teams (startup experience would be nice).\n* Solid understanding of computer science fundamentals, e.g. data structures, time complexity, algorithms.\n* Comfort with statically-typed languages, knowledge of OOP.\n* Security-mindedness, with the ability to identify and defend against threats and vulnerabilities.\n* Experience with Amazon Web Services would be nice.<p><i>If you're interested in applying please email jobs@dispatch.io</i>","time":1328125338,"type":"comment"},{"by":"Sikul","id":3540854,"parent":3537881,"text":"Santa Monica, CA | Riot Games<p>Riot Games makes League of Legends, one of the most popular games in the world.  Come work on the problems that occur when providing new game content worldwide at massive scale every 2 weeks.<p>We mainly write code in Java, C++, Ruby, PHP, Flex, and Erlang.  You can see the full list of open positions at: <a href=\"http://www.riotgames.com/careers/job-openings-0\" rel=\"nofollow\">http://www.riotgames.com/careers/job-openings-0</a><p>You can contact me through the email in my profile if you have any questions.","time":1328142874,"type":"comment"},{"by":"joelmichael","id":3539562,"parent":3537881,"text":"San Francisco, CA. Full time or intern.<p>We'd like to hear from interested Rails developers at all levels of experience. If you're new to Rails, this is a great place to learn. If you've already got years under your belt, then we'd love to have another strong performer.<p>CoverHound is building a platform that will make the site the Kayak.com of insurance shopping. This disruptive technology has already attracted several talented team members, not to mention venture capitalists.<p>Email joel [at] coverhound.com for more info.","time":1328125640,"type":"comment"},{"by":"revertts","id":3554718,"parent":3537881,"text":"Seattle, WA. Full time<p>We're Amazon's platform team for media content.  We own the systems for uploading, storing, and serving images/video/js/css/etc. across Amazon.com and partner sites.<p>Small blurb about the team: <a href=\"http://wap-jobs.amazon.com/jobs.html#media\" rel=\"nofollow\">http://wap-jobs.amazon.com/jobs.html#media</a>\nFull job description: <a href=\"https://us-amazon.icims.com/jobs/157798/job\" rel=\"nofollow\">https://us-amazon.icims.com/jobs/157798/job</a><p>Feel free to email me if you've got any questions!","time":1328466500,"type":"comment"},{"by":"joyita","id":3543590,"parent":3537881,"text":"London, UK, Full Time<p>We're VC backed startup in London looking for a Java ninja<p>It's a brilliant opportunity for an experienced technologist who is interested in a greenfield project and in using cutting edge tech. We need a dev who has a proven track record with distributed systems, SOA, enterprise messaging and security. Someone not afraid to get their hands dirty!<p>Full spec here: <a href=\"http://www.seedcloud.com/java-technologist/\" rel=\"nofollow\">http://www.seedcloud.com/java-technologist/</a>","time":1328203166,"type":"comment"},{"by":"baspland","id":3540378,"parent":3537881,"text":"Windows Phone 7 App Developer - C# + Silverlight\nWhatsApp Inc - Mountain View, CA<p>We are looking for engineers to work on our Windows Phone Client Team.<p>We are looking for engineers who enjoy writing compact code for mobile phones and are passionate about user experience. Using your start-up mindset and your experience developing native mobile apps, you will create new, awesome features used by millions of current WhatsApp users. You must have the ability to work in a very small team and self-organize feature prioritization and delivery; own release and QA cycles of your code; and have strong C# programming and debugging skills.<p>Client Engineer requirements:<p>•\tBS in computer science or equivalent.<p>•\tStrong C# programming and Debugging skills<p>•\tStrong understanding of C#, application architecture and object-oriented design<p>•\tExperience developing native WP7 mobile apps is strongly preferred, but not required.  LINQ, Silverlight and SQL Server client code have strong cross over utility with Windows Phone development.<p>•\tWorking experience with TCP, Messaging, IM, Push APIs<p>About WhatsApp, Inc. WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows, and Nokia smartphones. In addition to basic messaging, WhatsApp Messenger users can send each other unlimited images, video and audio messages as well as participate in groups.<p>  WhatsApp Inc. was founded in 2009 by two ex-Yahoo! engineers. We are located in a spacious office in downtown Mountain View. We are profitable, funded, and we offer very competitive compensation packages.<p>Other reasons to join us:\n- work side-by-side with the founders \n- unlimited supply of latest (and even unreleased yet) smartphones \n- fully stocked fridge from Whole Foods\n - herman miller embody chairs - frequent company paid lunches and dinners \n- open space, collaborative environment'<p>Please send resumes to baspland@whatsapp.com<p>WhatsApp Inc is proud to be an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status.","time":1328135408,"type":"comment"},{"by":"nod","id":3539070,"parent":3537881,"text":"Tableau Software!  Seattle, WA or Menlo Park, CA<p>A visual analysis software company that's becoming a force in the business intelligence world, we're hiring across the spectrum of development.  I want to highlight that my team is looking for multiple devs to come work on our sophisticated web application that helps people see and interact with their data in web/mobile browsers.<p><a href=\"http://careers.tableausoftware.com/\" rel=\"nofollow\">http://careers.tableausoftware.com/</a>","time":1328118731,"type":"comment"},{"by":"suhail","id":3539201,"parent":3537881,"text":"Mixpanel is hiring and we 1 TB of data every month - We'd love interns or full-times at our SF location.<p><a href=\"http://mixpanel.com/jobs\" rel=\"nofollow\">http://mixpanel.com/jobs</a>","time":1328120470,"type":"comment"},{"by":"sharksandwich","id":3538240,"parent":3537881,"text":"Atlanta, Ga<p>We're a fast-growing startup focused on making green building easier. We're looking for an excellent Rails developer with an interest in sustainability.<p>email stuart at ecoscorecard dot com","time":1328109233,"type":"comment"},{"deleted":true,"id":3543580,"parent":3537881,"time":1328203031,"type":"comment"},{"by":"twp","id":3538499,"parent":3537881,"text":"Open source Java geospatial developer, France (Chambéry) or Switzerland (Lausanne)<p>We're looking for a Java expert with web mapping knowledge. We do open source geospatial software, and have lots of cool projects.<p><a href=\"http://www.camptocamp.com/en/careers/467-senior-open-source-geospatial-developer\" rel=\"nofollow\">http://www.camptocamp.com/en/careers/467-senior-open-source-...</a>\n<a href=\"http://github.com/camptocamp\" rel=\"nofollow\">http://github.com/camptocamp</a>","time":1328112509,"type":"comment"},{"by":"Hovertruck","id":3538203,"parent":3537881,"text":"Chartbeat - Full time - NYC<p>Chartbeat is a real-time analytics service designed for real-time action used by everyone from The Wall Street Journal to Al Jazeera. We're democratizing data by putting it in the hands of people who need it to make decisions and take action - right now.<p>Our stack is mostly Python with some C in there, Google Closure for our JavaScript needs, and other fun things like MongoDB.<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1328108783,"type":"comment"},{"by":"geku","id":3544938,"parent":3537881,"text":"Zurich, Switzerland - local.ch (<a href=\"http://www.local.ch/jobs\" rel=\"nofollow\">http://www.local.ch/jobs</a>)<p>local.ch is looking for frontend developers with excellent JavaScript and Rails skills.<p>We are migrating our website from PHP to Rails and you have the opportunity to help shaping our future technology stack.<p>Have a look on our job page to get to know our great work culture and all job details:\n<a href=\"http://www.local.ch/jobs\" rel=\"nofollow\">http://www.local.ch/jobs</a>","time":1328223695,"type":"comment"},{"by":"mikeevans","id":3538304,"parent":3537881,"text":"Washington DC. Full Time<p>The Washington Post - Looking for back-end and front-end engineers.<p>Design, build, and deliver Web/Mobile applications for WashingtonPost.com.<p>email Michael.Evans at washingtonpost dot com","time":1328110079,"type":"comment"},{"by":"garysieling","id":3538011,"parent":3537881,"text":"Philadelphia, PA\nSoftware Engineers, Interns, QA and Operations<p>Join our team to assist building and managing our cloud based solutions. Become a part of our rapidly growing team, which is building unique solutions for our life sciences customers. Wingspan’s SaaS infrastructure is growing and evolving as new technologies become available and new threats are identified.<p><a href=\"http://www.wingspan.com/careers\" rel=\"nofollow\">http://www.wingspan.com/careers</a>","time":1328106271,"type":"comment"},{"by":"eli","id":3541220,"parent":3537881,"text":"Washington, DC - INTERN &#38; FULLTIME<p>Industry Dive is a newly formed mobile-focused B2B media company.\n<a href=\"http://www.industrydive.com/\" rel=\"nofollow\">http://www.industrydive.com/</a><p>We're looking for interns interested in mobile/web development, online marketing, or writing/editing online content.<p>We're also looking to hire a full time online marketing manager with 3+ years experience in search, display, or affiliate marketing.<p>Email me for details: eli-at-industrydive-dot-com","time":1328151120,"type":"comment"},{"by":"steilpass","id":3542796,"parent":3537881,"text":"Agile Software Developers in Cologne, Germany.<p>Although we have been bought we still feel and work like a startup. We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://adkla.us\" rel=\"nofollow\">http://adkla.us</a>","time":1328193297,"type":"comment"},{"by":"willhf","id":3543740,"parent":3537881,"text":"Portland OR, San Fran -- New Relic<p><a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a><p>Node.js, Java, Rails<p>Are you excited to delve into the internals of frameworks and VMs?  Come help us work on an amazing beloved product!  We especially need a Java Engineer who knows the nitty-gritty of class loading and byte-code rewriting, and a Node.js Engineer with an expert level knowledge of the Node.js implementation.","time":1328205229,"type":"comment"},{"by":"labtop","id":3539716,"parent":3537881,"text":"San Francisco or Seattle.  Full time.<p>Clustrix produces a distributed database appliance that's wire compatible with MySQL.  Need more capacity or throughput?  Just buy more nodes.  Automatic rebalancing, online schema updates, and much more.<p>If you like systems programming, distributed systems, databases and writing C code, check out:<p><a href=\"http://www.clustrix.com/company/careers/\" rel=\"nofollow\">http://www.clustrix.com/company/careers/</a>","time":1328127724,"type":"comment"},{"deleted":true,"id":3543566,"parent":3537881,"time":1328202923,"type":"comment"},{"by":"awecler","id":3538422,"parent":3537881,"text":"New York, NY FULL-TIME\n<a href=\"http://www.yodle.com/yodle-careers/departments/technology/\" rel=\"nofollow\">http://www.yodle.com/yodle-careers/departments/technology/</a>\nYodle builds technology to help local businesses connect with customers.  We are growing our technology team in NYC.  Mail awecler at yodle or try one of our puzzles to apply.\nSenior Software Engineer\nQA Engineer\nIT Analyst","time":1328111554,"type":"comment"},{"by":"martian","id":3541160,"parent":3537881,"text":"San Francisco, CA. Full time engineer.<p>Thumbtack is Amazon for services. A quarter of a million businesses have listed with us, and we're connecting them with local consumers in a very real way.<p>We recently raised $4.5MM in Series A funding.<p>We have an fun, intelligent team and eat gourmet home-cooked meals everyday. We work in Python, PHP, Javascript.<p>More info at <a href=\"http://thumbtack.com/jobs\" rel=\"nofollow\">http://thumbtack.com/jobs</a><p>OR email chris at thumbtack.","time":1328149389,"type":"comment"},{"by":"estel","id":3538076,"parent":3537881,"text":"Bristol, UK, FULLTIME, ONSITE.<p>Gravitywell: small web agency looking for an engaged junior web/mobile developer for a range of client and inhouse projects.<p>We're a PHP shop, so a grasp of that is always helpful, but not compulsory. We're also expanding rapidly into iOS/Android development; but we'd love to hear from you regardless of experience or background.<p>Email me for more details, or any questions at all; nathan@gravitywell.co.uk","time":1328107092,"type":"comment"},{"by":"timcederman","id":3539590,"parent":3537881,"text":"SurveyMonkey needs a fulltime product manager in Palo Alto, CA to work on some exciting new projects.<p><a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&#38;c=q7X9VfwS&#38;j=oyNdVfwd&#38;s=SimplyHired\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?k=Job&#38;c...</a><p>Lots of HN folks in our office.  We also recently acquired Wufoo, and have the esteemed Kevin Hale on our product team.","time":1328125954,"type":"comment"},{"by":"jack7890","id":3539106,"parent":3537881,"text":"Web Engineer - SeatGeek - New York, NY<p>We're a data-driven web app that's trying to use analytics and exceptional UX to making buying event tickets a wholly better experience. #Python #Ruby #PHP #MySQL #Redis #MongoDB #Javascript<p>Competitive comp, outstanding benefits, and a kick ass team. Only looking for folks in NYC.<p><a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1328119248,"type":"comment"},{"by":"rnernento","id":3538412,"parent":3537881,"text":"Lakeville CT, National Regulatory Services - ENTRY LEVEL - Tech Support<p>We're looking for a full time Technical Support representative. We're a small tech group with a lot to do so there are opportunities to learn a bit about everything.<p>Start out doing support, handling releases, updating and maintaining web based software and the infrastructure it's built on.<p>ASP / MSSQL / HTML / Javascript / CSS / Systems Administration<p>mdubecky@gmail.com","time":1328111468,"type":"comment"},{"by":"fbuilesv","id":3541393,"kids":[3545469,3541755,3541552],"parent":3537881,"text":"According to <a href=\"http://redbus2us.com/h1b-visa-2012-cap-count-updates-uscis/\" rel=\"nofollow\">http://redbus2us.com/h1b-visa-2012-cap-count-updates-uscis/</a> , the quotas for the FY 2012 H1-B visas were met on Nov 13, so (if my understanding is correct), no more of these visas will be available until October.<p>I just thought I'd bring this up for international people looking for jobs.","time":1328156316,"type":"comment"},{"by":"mikebo","id":3539197,"parent":3537881,"text":"Seattle, WA<p>Familiar turns your computer into a social picture frame. More at <a href=\"http://familiar.com/\" rel=\"nofollow\">http://familiar.com/</a><p>We're hiring software engineers who like building things. We use a wide variety of technologies from CoffeeScript to C++, so lots of opportunity to learn something new.<p>If you're interested in hearing more about what we're up to, my e-mail is mike [at] familiar-inc.com","time":1328120442,"type":"comment"},{"by":"naqabas","id":3545017,"parent":3537881,"text":"Houston, TX. Full Time. Accepting remote applicants with travel once in a while.<p>Prognosis HIS specializes in EMR(Electronic Medical Record) systems. We are looking for PHP developers that can catch on fast and get work done efficiently.<p>We need the following skills:\nCakephp / MySQL / Jquery / CSS<p>Please e-mail us your resume/linkedin profile, any online work, github profile, etc. to \ncareer.prognosishis@gmail.com","time":1328224901,"type":"comment"},{"by":"BenSS","id":3538308,"parent":3537881,"text":"KinderTown<p>Philadelphia Area - Fulltime<p>We're looking for a developer with iOS/Webapp xp to add to our startup, targeting early childhood education. Neither skill is a hard requirement, but being interested in the edu/kid space is! Complete info:<p><a href=\"http://www.kindertown.com/careers/ios-programmer-with-additional-web-skills/\" rel=\"nofollow\">http://www.kindertown.com/careers/ios-programmer-with-additi...</a>","time":1328110151,"type":"comment"},{"by":"jonkelly","id":3538350,"parent":3537881,"text":"Denver, CO (Englewood).  This or That Media<p>We are hiring full-time software engineers: JAVA, MySQL, EC2,MongoDB, jQuery, Hibernate, Spring. We're looking for folks who can make an immediate impact. Market salary, options, health insurance, and your own office with a door. <a href=\"http://thisorthat.com/pt/jobs\" rel=\"nofollow\">http://thisorthat.com/pt/jobs</a>","time":1328110694,"type":"comment"},{"by":"bwb","id":3541371,"parent":3537881,"text":"Remote Full Time Position at Site5.com<p>Two Positions:\n1. Ruby on Rails Developer - Details at <a href=\"http://gigs.37signals.com/jobs/10420\" rel=\"nofollow\">http://gigs.37signals.com/jobs/10420</a><p>2. PHP Developer with extensive work with Zend Framework to pick up existing projects such as our support desk, employee center, and more! Email bwb@site5.com to apply.<p>Thanks, Ben","time":1328155666,"type":"comment"},{"by":"tialys","id":3538236,"parent":3537881,"text":"Chicago, IL and Jacksonville, FL<p>Hashrocket is hiring Ruby on Rails consultants for our offices in Chicago and Jacksonville. For more information, see: <a href=\"http://hashrocket.com/people/work-at-hashrocket/developer\" rel=\"nofollow\">http://hashrocket.com/people/work-at-hashrocket/developer</a> for more information.<p>ONSITE FULLTIME","time":1328109187,"type":"comment"},{"by":"zoll","id":3538459,"parent":3537881,"text":"Denver, CO - ZOLL creates software for emergency response industry<p>- C#, ASP.NET MVC, and SQL developer with 5+ years experience<p>- Forbes Most Trustworthy Companies list and Fortune's Fastest Growing Companies list<p><a href=\"http://zolldata.iapplicants.com/ViewJob-267991.html\" rel=\"nofollow\">http://zolldata.iapplicants.com/ViewJob-267991.html</a>","time":1328112060,"type":"comment"},{"by":"lcm133","id":3538458,"parent":3537881,"text":"Washington DC Metro - <a href=\"http://www.sawbuck.com/about/jobs\" rel=\"nofollow\">http://www.sawbuck.com/about/jobs</a><p>VC-backed and thriving real estate website Sawbuck.com is seeking a web developer with strong HTML, JS, CSS skills.<p>If you are interested and qualified, email me directly: lmintzer at sawbuck dot com.","time":1328112048,"type":"comment"},{"by":"sricola","id":3538305,"parent":3537881,"text":"bitly - New York City - Fulltime and Interns<p>Actively Hiring:\n* Frontend Engineers\n* Application Engineers\n* Systems Administrators\n* Infrastructure Engineers\n* Summer Engineering Interns<p>bitly helps you collect, organize, shorten and share links. We are currently reinventing how people discover and share content on the web.<p>You'll be working in a flat (flat out), transparent, fast-paced and casual environment in the heart of the Meatpacking District in New York City. We offer competitive compensation and full benefits. More importantly, we offer you the chance to work with smart people on difficult problems at huge scale that impact how millions of people use the Internet.<p>emails jobs [at] bitly [dot] com, or visit <a href=\"https://bitly.com/pages/jobs\" rel=\"nofollow\">https://bitly.com/pages/jobs</a> to learn more.","time":1328110116,"type":"comment"},{"deleted":true,"id":3538225,"parent":3537881,"time":1328109062,"type":"comment"},{"by":"williamcotton","id":3538325,"parent":3537881,"text":"Paperless Post, Inc.<p>For positions in New York and San Francisco.<p>Open Positions:<p>Sys Admin\nCommunity Manager\nDatabase Engineer\nSoftware Engineer in Test\nMobile Web Dev\niOS Dev\nInterface Designer\nFront End Developer<p>All job descriptions can be found at: <a href=\"http://www.paperlesspost.com/jobs\" rel=\"nofollow\">http://www.paperlesspost.com/jobs</a>","time":1328110385,"type":"comment"},{"by":"veritas9","id":3569379,"parent":3537881,"text":"At CodeEval, we're hosting a bunch of coding challenges for companies that are hiring.<p>Warner Bros, Milo, DeviantArt, Shopply, Factual, Modcloth, Verical Brands, Rapleaf, Thumbtack, lolapps, Ampush Social, and Ravn<p>They're all hiring software developers, solve their challenge to apply, or do it just for fun!<p>www.codeeval.com","time":1328750312,"type":"comment"},{"by":"Jakob","id":3539670,"parent":3537881,"text":"Munich, Germany - Full time<p>Pokermania GmbH builds poker platforms for artists with Python, server- and client-side JavaScript, PHP and HTML 5.<p>We are 100% technicians in Munich and search for Game Developers who have fun scaling this game further with us.<p>Please email your application to jobs@pokermania.de.","time":1328127165,"type":"comment"},{"by":"kitko","id":3540419,"parent":3537881,"text":"Hiring SF:  Sr. Javascript Engineer, Sr. Back-End Engineer and Sr. LAMP engineer<p>Looking for full time expert Javascript engineer at Wikia.  \nStrong scaling and performance experience for back-end.\nSr. level LAMP(PHP) engineer for web features and applications.<p>Reach me @ kit@wikia-inc.com","time":1328135853,"type":"comment"},{"by":"munkydung","id":3545119,"kids":[3553674],"parent":3537881,"text":"East Bay, CA USA. Full-time regular.<p>Developer needed for web-based Enterprise Security Reporting product. Rails, TDD, jQuery<p>IBM<p><a href=\"https://jobs3.netmedia1.com/cp/job_summary.jsp?job_id=SWG-0414756\" rel=\"nofollow\">https://jobs3.netmedia1.com/cp/job_summary.jsp?job_id=SWG-04...</a>","time":1328226522,"type":"comment"},{"by":"mikeburrelljr","id":3542239,"parent":3537881,"text":"Funded Palo Alto start-up GetHired.com is looking for Sr. PHP Engineers to help disrupt the HR space.<p>Got what it takes?  Apply on our website at:  <a href=\"https://gethired.com/apply/111\" rel=\"nofollow\">https://gethired.com/apply/111</a>","time":1328180970,"type":"comment"},{"by":"hodbby","id":3542013,"parent":3537881,"text":"Websense, Europe.\nPlease follow the attached link and send email- <a href=\"http://go.hodspot.com/p/websense-europe-open-positions.html\" rel=\"nofollow\">http://go.hodspot.com/p/websense-europe-open-positions.html</a>","time":1328173136,"type":"comment"},{"by":"scraplab","id":3539872,"parent":3537881,"text":"London, UK. Full time.<p>Designer &#38; Front-end Developer at Newspaper Club.<p><a href=\"http://www.newspaperclub.com\" rel=\"nofollow\">http://www.newspaperclub.com</a><p>We help anyone make and print their own newspapers. We believe the web is too important to be left to screens, and that newsprint is a highly evolved technology too. We build things that combine the two, using each medium for what it's best at.<p>We're looking for a great designer + front-end developer to work alongside our co-founder and engineer (me, @tomtaylor) and form the start of a tight knit development team.<p>We want to overhaul our existing in-browser newspaper layout tool + API, launch a print-on-demand marketplace, and develop a number of products and services that use completely personalised newsprint in smart ways.<p>Things like the Postcode Paper we built for Data.gov.uk. <a href=\"http://blog.newspaperclub.com/2009/10/16/data-gov-uk-newspaper/\" rel=\"nofollow\">http://blog.newspaperclub.com/2009/10/16/data-gov-uk-newspap...</a><p>Or the prototype Telepaper, which turns Readability + Instapaper content into a delivered newspaper. <a href=\"http://telepaper.newspaperclub.com/\" rel=\"nofollow\">http://telepaper.newspaperclub.com/</a><p>You'll need to be able to go from sketches and conversation, to working code in browser yourself. We like generalists who can think both like designers + engineers, with a good sense of product intuition. Someone who can code their own designs, and enjoys working closely with a backend engineer.<p>Bonus points if you have a solid understanding of how to build well structured Javascript web apps, using frameworks like Backbone.<p>You've probably got a few years experience working on public sites, either for yourself or others, and can show us sample projects you've worked on. We value code over experience, so show us what you've done.<p>We run a small, friendly ship, in a relaxed environment we share with interesting folks in Shoreditch. We've got a proven business model, and are generating real, actual, genuine profit, with very little investment. We're doing this on our terms, and building the kind of organisation we'd like to work for.<p>All of which, I'll be honest, completely astounds me.<p>In return, we can offer a competitive package of salary and equity, in varying proportions.<p>If you're interested, drop us a line at jobs@newspaperclub.com, with a note about yourself and links to things you think we'd find interesting (eg. Github account, CV, portfolio).","time":1328129626,"type":"comment"},{"deleted":true,"id":3537931,"parent":3537881,"time":1328105158,"type":"comment"},{"by":"wdewind","id":3538494,"parent":3537881,"text":"New York NYC NY Brookyln - Etsy.com<p>Tons of positions available, technical and non-technical <a href=\"http://www.etsy.com/careers/\" rel=\"nofollow\">http://www.etsy.com/careers/</a><p>Feel free to contact me with any questions, info in profile.","time":1328112452,"type":"comment"},{"by":"RichardPrice","id":3539308,"parent":3537881,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>It's widely held that science is too closed, and too slow. We are trying to change that. We believe that faster sharing of research will lead to an acceleration in research innovation: faster innovation in medicine, biology, engineering, economics, and other fields. Faster sharing in biology and medicine, for example, could lead to cancer being solved 12 months before it otherwise would have been, which would lead to millions of lives being saved.<p>Academia.edu has over 950,000 registered users, and over 3 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,000 academics join each day.<p>We need talented engineers to come and help us accelerate the world's research. We believe that there is a chance to make a big impact.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We have a strong engineering culture. We're a 6 person team based in downtown San Francisco. The site is Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture. There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1328121843,"type":"comment"},{"by":"tocomment","id":3538008,"kids":[3538027],"parent":3537881,"text":"I just saw one of these threads with 10+ comments.  Where did it go?","time":1328106260,"type":"comment"},{"by":"jkupferman","id":3538253,"parent":3537881,"text":"turntable.fm - New York City ONSITE FULL TIME<p>We are a team of nine people who love music and building the best social music experience anywhere on web. We keep the work environment a lot like our application, awesome and fun.\nWe run Python, put our data in Mongo, and run our servers on AWS. We do absurd things with Javascript.<p>We're looking for a VP of Technology, iOS Developer, Devop/Sysop, and generalist developers.<p>See our jobs page for more information: <a href=\"http://turntable.fm/jobs\" rel=\"nofollow\">http://turntable.fm/jobs</a>","time":1328109392,"type":"comment"},{"by":"myoung8","id":3540946,"kids":[3541114],"parent":3537881,"text":"Bay Area, CA.<p>Come hack the auto industry at CarWoo! (YCS09)<p>-----------------------------------------------<p>We are looking for an awesome Rails developer to help us take the online auto industry by storm. You'll join a great engineering and design team that's working hard to bring car-buying into the 21st century. The features you create will help turn the mostly terrible experience of buying a new car into a wonderful experience for our customers.\nResponsibilities<p>Work with Michael, Erik, Scott, Rimas, Tim, Andrew, and Patrick to create a world class set of products. We're a small team (just 5 engineers and 2 designers), but we work smart and get a lot done. Here's some of the cool stuff we're working on right now: a queuing system to optimize our operations across the country, an iOS app, and a stealth web crawler.<p>We do story-driven development, so you'll get the chance to work on any or all of this stuff if you so choose.<p>Qualifications<p>- Deep knowledge of Rails and everything that goes along with it (MVC, REST, relational database design/SQL)<p>- Solid grasp on modern web application design using Javascript, HTML, CSS<p>- Experience with version control systems (we use Git/Github)<p>- Solid testing methodologies and willingness to write comprehensive tests before release<p>You get extra bonus points for:<p>- Extensive Javascript experience outside of JQuery (e.g. Backbone)<p>- Ability to write complex SQL<p>- Understanding of good RDBMS design. Experience optimizing queries.<p>- Experience with memcached, sphinx, and nginx<p>- Story-driven development<p>- Web service/API development (REST)<p>- Experience with iOS development (Objective-C)<p>- Ability to play ping-pong skillfully and/or drive a go-kart furiously<p>Perks<p>- Full Benefits (medical, dental, vision, 401k)<p>- 17 days of PTO (vacation)<p>- $5,000 to buy anything you want to get your work done (must include an Apple computer of some sort)<p>- A substantial amount of equity in the company<p>If you're interested, send an email with your résume and something interesting about yourself to michael@carwoo.com.<p>We're based in Silicon Valley, but if you live outside the Valley, we still really want to talk to you (we'll pay for your flight, hotel, and meals when you come interview with us).","time":1328144529,"type":"comment"},{"by":"jrheard","id":3539296,"parent":3537881,"text":"Yelp<p>INTERN OR FULLTIME in SAN FRANCISCO, CA<p>I'm a full-stack web developer at Yelp, and I definitely recommend the hell out of working here. We've still got the startup environment (kegs, dog, etc); we're located in downtown San Francisco, half a block from MoMa; we are in a unique position to do great stuff and solve hard problems while helping people find great local businesses.<p>I built our \"Hot New Businesses\" feature - <a href=\"http://yelp.com/openings/sf\" rel=\"nofollow\">http://yelp.com/openings/sf</a> , for instance, you can find it on the homepage and in our mobile apps too - which crunches through our data nightly and generates a list of the most recently opened bars and restaurants in your city, complete with predictions of the day they opened on. It's a really useful feature, and we have so much data that I was able to build it without knowing anything about machine learning, data-mining, etc; imagine the crazy-useful stuff you could do here, if a knucklehead like me could make a feature like this.<p>For more info about what it's like to work here as an engineer, see a Q&#38;A with me at <a href=\"http://officialblog.yelp.com/2011/07/day-in-the-life-of-a-yelp-engineer.html\" rel=\"nofollow\">http://officialblog.yelp.com/2011/07/day-in-the-life-of-a-ye...</a> , or feel free to contact me at jrheard at yelp dot com.<p>Here's a list of our open engineering positions:<p>Web Developer<p>☆ Develop cool and useful features for our 61M+ monthly visitors<p>☆ Expertise in JavaScript, HTTP, HTML/DOM, and CSS, as well as server-side chops in a language like Python, Ruby, Java, C++, etc. We're on Python, but we're just looking for people who are really good at programming, so no worries if you don't have much Python experience.<p>Search and Data-Mining Engineer<p>☆ Tackle machine learning and information retrieval problems from our database of 22M+ Yelp reviews<p>☆ Strong grasp of algorithms and data structures; expertise in Python, Java, or C++<p>Back-end Engineer<p>☆ Build whole systems that are simple and scalable<p>☆ Expertise in your favorite modern programming language: Python, Ruby, Java, Objective-C, or C++\nMobile Developer<p>☆ Create fun and useful mobile applications for the iPhone, Android, Blackberry platforms and beyond<p>☆ Expertise in C++, Java and other mobile languages<p>To apply, head to <a href=\"http://hire.jobvite.com/j/?aj=oyXeVfwo&#38;s=Hacker_News\" rel=\"nofollow\">http://hire.jobvite.com/j/?aj=oyXeVfwo&#38;s=Hacker_News</a>","time":1328121729,"type":"comment"},{"by":"darose","id":3539014,"parent":3537881,"text":"New York, NY - Sense Networks (<a href=\"http://sensenetworks.com/about_careers.php\" rel=\"nofollow\">http://sensenetworks.com/about_careers.php</a>)<p>Looking to hire:<p>* Senior Data Scientist<p>* Software Engineer, Hadoop/Data team","time":1328118204,"type":"comment"},{"by":"chuang","id":3540953,"parent":3537881,"text":"Menlo Park, CA. Full Time.<p>Production Engineers at Facebook are hybrid software/systems engineers who ensure that Facebook's services run smoothly and have the capacity for future growth. They are embedded in every one of Facebook's product and infrastructure teams, and are core participants in every significant engineering effort underway in the company. Our team is comprised of varying levels of experience and backgrounds, from new grads to industry veterans. Relevant industry experience is important, but ultimately less so than your demonstrated abilities and attitude. We sail into uncharted waters every day at Facebook in Production Engineering, and we are always learning.<p>Responsibilities<p>-Own back-end services like our Hadoop data warehouses, front-end services like Chat and Newsfeed, infrastructure components like our Memcache infrastructure, and everything in between\n-Write and review code, develop documentation and capacity plans, and debug the hardest problems, live, on some of the largest and most complex systems in the world\n-Together with your engineering team, you will share an on-call rotation, backed by our 24x7 Site Reliability Operations team\n-Partnered alongside the best engineers in the industry on the coolest stuff around, the code and systems you work on will be in production and used by millions of users all around the world<p>Requirements<p>-BS or MS in Computer Science, Engineering, or a related technical discipline or equivalent experience\n-Extremely sound knowledge of UNIX and TCP/IP network fundamentals\n-Ability to code really well in at least one language (even if it is not one that Facebook uses)\n-Ability to rapidly learn new development languages (PHP, Python, C++, and Java are all in heavy use)\n-Ability to pick up new software, frameworks and APIs quickly\n-Sharp and tenacious troubleshooting skills: you can fix anything\n-Ability to perform 'guerrilla capacity planning' for internet service architectures\n-Good knowledge of basic large-scale internet service architectures (such as load balancing, LAMP, CDN's), even if you haven't worked on one\n-Configuration and maintenance of common applications such as Apache, memcached, Squid, MySQL, NFS, DHCP, NTP, SSH, DNS, and SNMP\n-A healthy respect for our motto 'Move Fast and Break Things,' but always make sure you know how to fix them too\n-Good verbal and written communications skills\n-Detail oriented and careful<p>If you are interested, please email cathy [at] fb.com or apply through our careers  page: <a href=\"https://www.facebook.com/careers/department.php?dept=engineering&#38;req=a2KA0000000LknwMAC\" rel=\"nofollow\">https://www.facebook.com/careers/department.php?dept=enginee...</a>","time":1328144670,"type":"comment"},{"by":"mikek","id":3538177,"parent":3537881,"text":"Kiwi Crate\nMountain View, CA\n<a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a><p>Front end developer, back end developer, marketing and ops.","time":1328108451,"type":"comment"},{"by":"sinzone","id":3540661,"parent":3537881,"text":"Mashape - Cloud API Hub.<p>Java, Erlang, Node.js, Play Framework, UX/UI Designers.\nSan Francisco<p>More info: <a href=\"http://angel.co/mashape/jobs\" rel=\"nofollow\">http://angel.co/mashape/jobs</a>","time":1328139405,"type":"comment"},{"by":"sethbannon","id":3539529,"parent":3537881,"text":"New York, NY. Reshape civil society with your code at Amicus. <a href=\"http://jobs.amicushq.com/\" rel=\"nofollow\">http://jobs.amicushq.com/</a><p>Intern, H1B, full time.","time":1328125138,"type":"comment"},{"by":"devsatish","id":3538213,"parent":3537881,"text":"Collaborative - Boston, MA/Wausau WI/Raleigh NC/Dallas TX\nFull-time (Enterprise developers (Java/Web/HTML), ETL developers)<p>mail me at smummadi collaborative com","time":1328108919,"type":"comment"},{"by":"dogas","id":3562529,"parent":3537881,"text":"PipelineDeals\n<a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a><p>REMOTE, FULL TIME<p>Join the team of happy hackers at PipelineDeals! We’re looking for a talented junior/mid-level Rails developer preferably in the Philly/NYC/DC area, but remotes are welcome as well.<p>Perks:<p>- Work at a well-established small company that’s 5 years old, bootstrapped, profitable, and proud!<p>- Join a tightly-knit small team of very talented coders to help drive the product.<p>- We are very progressive with the technology we use. Chef, kiji-ruby, authlogic, Backbone.js, etc. We implement the things we find promising, and encourage all developers to help bring ideas to the table. Let your voice be heard and your opinion be respected!<p>- Our team is very test- and spec-driven. We typically use a peer-review model to ensure that none of us are going off the deep end with a solution. We are striving towards continuous deployment. We have our CI server run our test suite upon each push to the remote repo. We measure almost everything.<p>- You are encouraged to contribute to open source, and we have open source Fridays!<p>- Relish in the fact that the projects you will be working on will be used directly by thousands of our customers worldwide!<p>- Reimbursement for conferences or meetups you would like to attend, books you want to buy, screencasts you want to watch.<p>- Great benefits package, a competitive salary, and lots of room for growth. Our goal is to ensure you are comfortable so you will be productive.<p>Requirements:<p>- We are looking for a relatively green go-getter who’s chomping at the bit to make a lasting impression and eager to learn new things.<p>- Must have at least a year of experience working directly with ruby, either with a company, or via open source. Past contributions to open source projects, or maintaining your own, are looked very highly upon.<p>- At least a year’s experience working with Rails, either your own or at a previous company.<p>- Experience with jQuery and (double rainbow bonus) Backbone.js.<p>- Solid familiarity with git or other distributed version control system.<p>- Enough SQL to understand what rails is doing in the backend.<p>- A good sense of humor is a strict requirement. Company culture is very important to us, and we are absolutely NOT a bunch of straight-laced, profit-driven, cubicle-sitting curmudgeons.<p>- Remote work OK, but it is highly preferable if you are located around the Philadelphia area. You will be expected to be at our Philadelphia office sometimes. We do get lonely.<p>Check out the site, play with the demo. <a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a><p>Interested? Email Grant Ammons at grant@pipelinedealsco.com. Look forward to hearing from you!","time":1328633610,"type":"comment"},{"by":"itay","id":3539367,"parent":3537881,"text":"Seattle, San Francisco, Cupertino (and other places), FULL-TIME, INTERN, H1B<p>A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people. Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>For example, my project for the past couple of months has been to develop our new Node.js/Browser SDK, including pulling some of our propietary UI components and sharing them with the world. We also do a lot of work with customers to best help them use Splunk. One of the projects I was involved in included analyzing social data using Splunk (like Twitter/Foursquare).<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you. I personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>I wanted to highlight a few specific positions we're looking for:<p>* Dev. Platform Software Engineer: This is the team I work on. We strongly believe that there is a use for Splunk outside of logging, and we're enabling the usage of the technology for dealing with large quantities of data, whether it's for social network analysis, cloud management or anything in between. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oHkCVfwi\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oHkCVfwi</a><p>* Frontend engineer: We're trying to present a lot of data (some might even call it big data :) in a human-understandable manner. Help us implement the next wave of visualizations: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=okO3VfwQ</a><p>* UI/UX Designer: For many of our customers, they spend a great deal of their day in our web UI, and even more importantly, they spend time there when something is going wrong and they want to find out what. Help us make the UI/UX as easy and intuitive to use as possible: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=okQ4VfwT\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=okQ4VfwT</a><p>* Cloud Software Engineer: we're developing the next stage of our product, which is a hosted version of Splunk in the cloud, with all the benefits you'd expect (like automatic elastic scaling). Come help us make this a reality: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL</a><p>* Hadoop Software Engineer: Usage of Hadoop is exploding to do batch-oriented processing on massive quantities of data. We think there is a lot of value to be had by combining the power of Splunk and Hadoop, and we're developing solutions to make this possible. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS</a><p>* Software Engineer in Test: Splunk is a complex machine, deployed in a distributed manner, many times being used for different things. Our testing team is top notch, and helps us deliver quality releases. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe</a>","time":1328122754,"type":"comment"},{"by":"barnabyc","id":3538664,"parent":3537881,"text":"Providence, RI - Swipely (<a href=\"https://swipely.com\" rel=\"nofollow\">https://swipely.com</a>)<p>Senior UX Engineer<p>Want to change the world?  Love creating awesome user experiences?  Keep reading.<p>THE MISSION<p>Swipely revolutionizes how local merchants do business, arming them with innovative technology that puts the clunky, archaic systems used by big retailers to shame. We're the Robin Hood of business, disrupting the payment space to enable the little guys to do what only the big guys can, and then some. We interact directly with both merchants and their customers, impacting the personal experience on both sides in deep, meaningful ways. We turn rewards and loyalty upside-down (or, as we see it, rightside-up!) by giving points and discounts to customers through their credit card, without the need for special cards, mobile apps, bar codes, or anything else that gets in the way of the experience. We analyze every payment transaction, providing intuitive reports and automated tools for merchants that use them to grow and deeply engage their customers. And that's just the beginning of the possibilities with our passionate team, unique resources, and mission to make our merchants successful!<p>THE OPPORTUNITY<p>Combine a world-class front-end team with a powerfully creative atmosphere, and you get a compelling culture that liberates us all to envision and realize innovative product ideas every day. You will push your own limits of what you think is possible with a user experience. You will propose and refine new concepts, comps, technologies, and solutions, and get the support needed across the company to realize the untapped potential we have yet to discover.  You will work with top sales, marketing, and product talent that deeply values innovation and the engineers that drive it.<p>Evolution is our greatest ally. We built the first incarnation of Swipely with jQuery, experimented with Backbone yet quickly realized we needed more structure, and now cruise on YUI3, with YUI3.5 around the corner. We rock MVC-driven, single-page applications, fully templatized Handlebars views, restful JSON persistence to our Rails backends, frontend unit and integration tests, and (soon!) a pushState architecture with hot data visualizations.<p>We always track and contribute to new technologies like D3, Node.js, Ember, Harmony, CoffeeScript, and Less. Exploration and collaboration are part of our culture, and any topic that can improve our engineering efforts is fair game, including NoSQL storage, Nginx/Unicorn architecture, and deployment and continuous integration tools.<p>THE REQUIREMENTS<p>You love what you do. You wake up every day more passionate about the web’s IxD models and UX than the day before. You demand the highest quality of your projects and want to work with people who demand and inspire the same, from the code down to the pixels. You get energized when opening new Fireworks and Photoshop comps and diving deep with designers.<p>You are self-directed and take initiative with confidence, yet know when to include others. You communicate effectively and thoughtfully. You appreciate the value of documentation. You are accountable for the entire user experience, from conception to production.<p>You love contributing to opensource. Your Github profile is a hive of exciting collaborations. You strive to learn and shape emerging projects. You lead and inspire others with your own applications and sites in your free time. You go out for drinks with your friends and have engrossing discussions about the web. You love freenode.<p>Your JavaScript knowledge is one of your greatest assets. You instinctively understand where native JavaScript ends and frameworks begin. Your extensive experience with MVC and design patterns guides you to insightful and intuitive solutions. You are eager to define new TDD and BDD frontend flows. You’re gratified that your language of choice is currently the most popular on Github and is evolving in leaps and bounds on the server-side. You love your backend developer. You regard as common knowledge that robust, performant code is integral to a compelling UX.<p>Your HTML5 and CSS3 expertise expands as fast as the specs are updated. You shiver with anticipation for Level 4 CSS selector support, consistent gradient rule syntax, and native grid layouts. You rock the Chrome Dev channel and wish the Safari updates were out already. You crave responsive design. You know when to go web versus native.<p>THE BENEFITS<p>Swipely is small yet growing rapidly with explosive signup rates (seriously, off the charts!) offering Silicon Valley style startup perks and more. We've got you covered on hardware -- configure your own laptop and bring on the Happy Hacker keyboards, dual-monitors, and pairing stations. Travel expenses, conference tickets, industry and social events?  Check!  Aeron chairs, daily catered lunches from the finest restaurants around (they are our merchant partners, after all!), all the snacks, beverages, and happy hours you can handle?  Done, done, and done!<p>Residing at 39 Pike Street in the Creative Capital that is Providence, you'll find us strategically located between the humming downtown and the vibrant campuses of Brown and the Rhode Island School of Design, a block away from the best coffee shop in the city.<p>Everyone in our company, from sales to engineering, is searching for you RIGHT NOW and wants to be working with you yesterday. Do us a favor; reach out and tell us about yourself.<p>Please send your resume and github profile to uxeng+y212@swipely.com – include a portfolio if available.","time":1328114158,"type":"comment"},{"by":"ismarc","id":3538527,"parent":3537881,"text":"Austin, TX, Fulltime, Invodo (<a href=\"http://www.invodo.com/html/about/jobs/\" rel=\"nofollow\">http://www.invodo.com/html/about/jobs/</a>)<p>We are a startup that's growing customer-wise and employee-wise.  If you're interested in one, feel free to email me directly at work (mbrace@invodo.com) if you prefer it to be handed off, but we're small enough that you can feel comfortable just sending it to careers@invodo.com.<p>For developers, the skills listed for each job is pretty long.  However, this isn't just a list of buzz-words to catch folks, these are technologies/etc. that we actually use.  Some of the systems we're looking to move away from as they're from systems written before we got traction (which means an entirely different business model) that are slowly being replaced.<p>Software Development Engineer (UI) -- Javascript, Actionscript, working on player framework utilized by our customers.  Skills we're looking for:<p>* Desire to create fast, light, clean, maintainable code that works great, regardless of browser<p>* Excellent JavaScript development skills, including\nJavaScript and CSS optimization and minification techniques<p>* Experience embedding code in 3rd party sites (HTTP&#38;HTTPS)<p>* Asynchronous loading techniques<p>* Experience using RESTful APIs from the browser and Flash runtime JSON/P and XML<p>* ActionScript 3 development<p>* Extensive CSS and HTML development experience<p>* Familiarity with embedding code in e-commerce pages<p>* Familiarity with web video streaming (FMS, HLS, etc.)<p>* Familiarity with HTML5 and emerging HTML5 video standards<p>* Understanding of video SEO (sitemaps, Open Graph, etc.)<p>* Experience using CDN’s<p>* Basic graphics production (Photoshop)<p>* Experience programming in and/or working against a Java stack<p>Senior Software Engineer (Java) -- Senior developer, some Tomcat applications, some embedded Jetty, some applications that aren't web based at all (Netty based, written in Scala), really needs a really good understanding of the JVM.  Technologies actively in use (even if we're trying to phase some of them out) and skills needed:<p>* Grails<p>* Java EE / Groovy / Scala<p>* Spring<p>* Hibernate<p>* HTML, CSS, Javascript<p>* Flash video<p>* Tomcat &#38; Apache<p>* Linux (Redhat / CentOS)<p>* Database/MySQL<p>* Performance modeling and analysis<p>* REST web services<p>* High availability Internet applications<p>* Cloud computing (e.g. Amazon EC2/S3)<p>* Content Delivery Networks","time":1328112802,"type":"comment"},{"by":"jgarrison","id":3591573,"parent":3537881,"text":"Scottsdale, AZ, Denver, and Ames, IA<p>Software Engineers (www.WebFilings.com)<p>WebFilings’ software engineers develop best-in-class, next-generation collaborative web applications for accounting and finance teams around the world.  We hire software engineers with a broad set of skills who are ready to tackle some of technology’s greatest challenges.  Developers work across several Internet application technologies, including RIA platforms like Flash Player, HTML5 and Google App Engine, with an emphasis on great user experiences.<p>WebFilings’ culture is highly innovative and team-oriented.  We encourage autonomy and provide you the opportunity to develop mastery in areas about which you are passionate.  As a software engineer at WebFilings, you will clearly understand the needs of our customers and the benefits our software provides them and their community.  Since we develop and release on extremely fast cycles, you will see your code live, in production, often within days or weeks rather than the months or years as with some companies.\nMinimum Qualifications:<p>BS degree in Computer Science or related field (In lieu of degree, 4 years relevant work experience).\nExperience programming in one or more of Python, Actionscript/Flex, C/C++, C#, Java or Javascript/AJAX<p>Preferred Qualifications:<p>Masters or PhD in Computer Science or related field.\nA solid foundation in computer science, with strong competencies in data structures, algorithms, and object-oriented software design.\nSeveral years of large systems software design and development experience.  Experience working with virtualized OS environments a plus.\nSignificant coding skills in one or more of Python, Actionscript/Flex, C/C++, Java or Javascript/AJAX\nAdditional experience with Objective-C, Mobile computing, SQL, NoSQL, Google App Engine, Amazon EC2, database design, knowledge of HTTP and web protocols are a plus.<p>We Have Three Unique Developer Profiles:<p><i>User-Facing Web Applications<p>We develop highly interactive web applications using the latest web and browser technologies including HTML5, AJAX, Javascript, CSS, and related libraries.  These applications stretch the boundaries of what is possible for a browser-based application and deliver a user experience that is second to none.<p>Relevant technical backgrounds include: Web Application Development, Cross Browser Compatibility, User Interface Development.<p></i>Rich Internet Application Developer<p>RIA developers will be working on a cutting-edge platform that combines a state of the art Google App Engine back-end with a large scale Flash Player-based enterprise application written with the Flex SDK in Actionscript.  Attention to detail, crafting superior user experiences, and writing high-performance efficient code are all key qualities necessary for this position.<p>Relevant technical backgrounds include: Actionscript, Flex SDK, PureMVC, Async service calls, UI/UX Development.<p>*Cloud Computing Infrastructure and Services<p>We develop on the latest cloud computing technologies including Google AppEngine and Amazon EC2 in a hybrid cloud environment unlike anything else in the industry.  We focus on scalability and performance, building a platform that will scale to support tens of thousands of users.<p>Relevant technical backgrounds include: Database Development, Large Scale Distributed Systems, Performance and Memory Optimization, Web Service Development, Google AppEngine, and Amazon EC2","time":1329250138,"type":"comment"},{"by":"magicpixelgames","id":3541212,"parent":3537881,"text":"Los Angeles, CA.  Full Time, onsite only.<p>Senior Game Systems Designer\n(<a href=\"http://www.magicpixelgames.com/2012/01/15/senior-designer/\" rel=\"nofollow\">http://www.magicpixelgames.com/2012/01/15/senior-designer/</a>)<p>Established Video Game development team<p>Unannounced Project<p>Magic Pixel Games (<a href=\"http://www.magicpixelgames.com\" rel=\"nofollow\">http://www.magicpixelgames.com</a>) was founded in 2010 by the core members that developed the award-winning Steven Spielberg's BOOM BLOX. Much of our team has worked together for almost a decade, and we’ve now struck out on our own to continue our tradition of creating extraordinary games. Our first product was launched in 2011: Carnival Island, developed with Sony Santa Monica Studio.<p>We’re now building a team as we ramp up for our second project, which again, strives to break new ground – but is significantly different from our first in all ways – tone, target audience and style…we’re excited!<p>Join us and make a difference!<p>Each member of our closely-knit team makes a very real contribution to the game, and awesome ideas come from everyone. We all wear many hats, we play to each other’s strengths, and we build on each other’s ideas.<p>Our team moves fast, and takes on big challenges. We love what we do, and you will too!<p>Note: We're currently located by the Los Angeles airport. At the moment, we are not considering telecommuters.<p>----------------------------------------------<p>Our team is now looking for a <i>Senior Game Systems Designer</i> to guide the vision for our games. Designers drive our games, and this role is critical for making sure our games are fun, accessible, and ultimately compelling for users of all ages and skill levels…and this is a chance to get involved in its formative days.<p>Primary Responsibilities:<p>• <i>Ideate, design and implement game systems,</i> as required by lead designers and project requirements<p>• Design and tune games and experiences while bearing target audience requirements in mind<p>• Work closely with other designers to help conceive game mechanics while preserving the overall theme and design constraints of the product<p>• Prototype rapidly on ‘whatever works’ (paper or existing games), and then translate those findings into a production environment<p>• Communicate design directives to the team, and confirming that guidelines are followed, providing clear and actionable feedback to content creators where necessary<p>• Evaluate, prioritize and integrate feedback from stakeholders<p>• Drive design considerations for art<p>• Collaborate with engineers on required gameplay enhancements and feature requests, design tools and pipeline<p>• Collaborate with audio artists as needed to fulfill design requirements<p>• Work closely with all team-members in a collaborative agile, small team environment<p>Requirements:<p>• General awesomeness<p>• 2-4 years’ experience in working on and shipping games (at least one shipped and credited game)<p>• Excellent written and verbal communications skills, including sketches, flowcharts or diagramming when needed<p>• Experience with current generation consoles, and the technical aspects of creating content for them, in scripting or creating basic level geometry<p>• Experience architecting complete gameplay systems and compulsion loops including table- and data-jockeying<p>• Comfortable working on an agile and collaborative team<p>• Accurate time and schedule management<p>• Self-motivated, proactive and engaged attitude towards the project<p>• Mention a penguin in the cover letter or accompanying e-mail<p>• Passionate for (and interested in working on) games<p>• Tendency towards bursts of innovative thinking and inspiring brainstorming<p>• Ability to rapidly consider repercussions of design decisions throughout all aspects of a \ngame<p>• Deep understanding of player motivations and design compulsions<p>• Mentally agile and able to participate and contribute to fast-paced design brainstorming and discussion<p>• Wide range of knowledge on all games, past and present and the ability to tap into this for design discussions<p>Preferences:<p>• At least three shipped, credited game projects<p>• Prototyping and rapid iteration skills<p>E-mail your relevant materials to jobs@magicpixelgames.com","time":1328150879,"type":"comment"},{"by":"magicpixelgames","id":3541135,"parent":3537881,"text":"Los Angeles, CA.  Full Time, onsite only.<p>Generalist programmer:  Tools Focus (<a href=\"http://www.magicpixelgames.com/2012/01/20/generalist-programmer-tools-focus/\" rel=\"nofollow\">http://www.magicpixelgames.com/2012/01/20/generalist-program...</a>)<p>Established Video Game development team<p>Unannounced Project<p>Magic Pixel Games (<a href=\"http://www.magicpixelgames.com\" rel=\"nofollow\">http://www.magicpixelgames.com</a>) was founded in 2010 by the core members that developed the award-winning Steven Spielberg's BOOM BLOX. Much of our team has worked together for almost a decade, and we’ve now struck out on our own to continue our tradition of creating extraordinary games. Our first product was launched in 2011: Carnival Island, developed with Sony Santa Monica Studio.<p>We’re now building a team as we ramp up for our second project, which again, strives to break new ground – but is significantly different from our first in all ways – tone, target audience and style…we’re excited!<p>Join us and make a difference!<p>Each member of our closely-knit team makes a very real contribution to the game, and awesome ideas come from everyone. We all wear many hats, we play to each other’s strengths, and we build on each other’s ideas.<p>Our team moves fast, and takes on big challenges. We love what we do, and you will too!<p>Note: We're currently located by the Los Angeles airport. At the moment, we are not considering telecommuters.<p>----------------------------------------------<p>We’ve identified an immediate need for a Tools Programmer to help build up the asset pipeline for our game. As ramp up for our next game, we’re finding gaps in the technology that allow our content creators to put their awesomeness into the game, and we’d like your help!<p>Primary Responsibilities:<p>• Design, implement and maintain content creation tools, asset pipelines and scripts as required by lead programmer and project<p>• Collaborate with other engineers on integration and support tasks<p>• Collaborate with designers, artists and audio artists as needed to build and refine content pipelines.<p>• Work closely with producers, artists, and designers in a highly collaborative agile, small team environment<p>Requirements:<p>• 2-4 years’ experience in working on and shipping games<p>• Superlative C/C++ Proficiency<p>• Strong math skills<p>• Self-motivated, proactive and engaged attitude towards the project, and a genuine desire to help people realize their visions in game<p>• A mention of your dessert in your cover letter/E-mail<p>• Experience with working on other people’s code on a medium-sized team<p>• Comfortable working on an agile and collaborative team<p>• Flexibility in working with scripting languages, build systems, automation, XML and version control systems<p>• Strong debugging skills<p>• Accurate time and schedule management<p>• Passionate for (and interested in working on) games<p>• Generalist skill set, adaptable and flexible<p>Preferences:<p>• At least one shipped, credited game project<p>• Experience on current generation consoles<p>• Familiar with various high level or scripting languages \nfor game development<p>• Experience in GUI development with C# a plus<p>• Affinity to procedural content generation<p>• Wide range of knowledge on games<p>E-mail your relevant materials to jobs@magicpixelgames.com","time":1328148843,"type":"comment"},{"deleted":true,"id":3541125,"parent":3537881,"time":1328148557,"type":"comment"},{"by":"pitdesi","id":3538042,"parent":3537881,"text":"FeeFighters<p>INTERN OR FULLTIME<p>Rails Developers or Intern (Chicago or Remote) and a Marketing Intern (Chicago only)<p><a href=\"http://feefighters.com\" rel=\"nofollow\">http://feefighters.com</a><p>Looking for a Rails developer. We’re a startup working like mad to disrupt a multi-billion dollar financial industry and cut out tens of thousands of inefficient middle-men. Customers include Fog Creek/Stack Exchange, Photojojo, Weebly, Kickstarter, Make a Wish Foundation, tons of awesome startups, and even some public companies! And... we're just getting started.<p>We recently launched a new product called Samurai into public beta. (<a href=\"http://samurai.feefighters.com\" rel=\"nofollow\">http://samurai.feefighters.com</a>) It's an all-in-one all-in-one solution for taking payments online. It has come out of the gate swinging - there is a ton of pent-up demand to fix this industry and we're excited at how many people have been interested in our new product. We have a few more AWESOME tricks up our sleeve and need developers to help build them out!<p>We have passionate users, awesome investors and partners, and products that our customers love. We enjoy a very fun and stimulating work environment in our new office in River North. Much of the Samurai dev team was early on in another payments startup that grew to be a $2Billion company (including the CIO of that company). Here are bios of some folks that you'll be working with: <a href=\"https://samurai.feefighters.com/about\" rel=\"nofollow\">https://samurai.feefighters.com/about</a> We're still finishing up our job description - but here's a start. <a href=\"http://feefighters.com/jobs/rails-ninja-developer/\" rel=\"nofollow\">http://feefighters.com/jobs/rails-ninja-developer/</a><p>Email josh at feefighters with your interest. Also looking for a marketing intern to help us with social media and PR. Lots of fun stuff!\n<a href=\"http://feefighters.com/jobs/kickass-marketing-intern/\" rel=\"nofollow\">http://feefighters.com/jobs/kickass-marketing-intern/</a>","time":1328106677,"type":"comment"},{"by":"vital101","dead":true,"id":3538252,"parent":3537881,"text":"Full Time - Back End Web Developer - Grand Rapids, MI<p>This position is part of a full-service marketing firm with a nimble interactive group. The team works to create and develop effective, hard-working mobile apps, scalable web sites, and web-based applications. This is a fast-paced, creative and flexible environment -- your contributions (code, ideas and preferences) will immediately and directly affect the solutions we provide.<p>We're especially looking for someone who can supplement and advance our app development efforts, so an advanced understanding of Javascript is a must - and some Objective-C experience is a huge plus.<p>We're fairly flexible ... as long as you're on-site, and we're looking at full-time employment. We work hard and have fun. And we'd like an experienced developer who's ready for some new challenges to join the team. Your skills and availability will make a difference.<p><a href=\"http://www.teamddm.com/contact/jobs/web-developer\" rel=\"nofollow\">http://www.teamddm.com/contact/jobs/web-developer</a>","time":1328109354,"type":"comment"},{"dead":true,"deleted":true,"id":3538195,"parent":3537881,"time":1328108735,"type":"comment"},{"by":"maxaf","dead":true,"id":3538834,"parent":3537881,"text":"Full Time Back/Front End, Quantitative Engineers - New York, NY (Midtown East)<p><a href=\"https://www.novus.com/\" rel=\"nofollow\">https://www.novus.com/</a><p>Novus is looking for bright generalist engineers striving to make an impact in uniquely challenging roles. We're looking for engineers to help us build the next generation of real-time financial analytics sytems, used by some of the world's most prominent investors.<p>There's no shortage of ways to innovate and help grow the firm. We want the world's makers to come together with us &#38; help turn inside out an old industry afflicted with the worst case of inertia ever.<p>If this is you, I'm dying to hear from you! max at novus dot com","time":1328116015,"type":"comment"},{"by":"dnoz80","dead":true,"id":3539877,"parent":3537881,"text":"Exeter, UK - Fantasy Shopper (www.fantasyshopper.com)\nLooking for a new exciting challenge at one of Europe's hottest startups?\n<a href=\"http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-one-of-europes-hottest-startups-with-3-3m-from-accel-and-nea/\" rel=\"nofollow\">http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-...</a>\nWe are looking for rock star developers joining our high growth startup. Apply here:\n<a href=\"http://www.fantasyshopper.com/about/jobs\" rel=\"nofollow\">http://www.fantasyshopper.com/about/jobs</a>","time":1328129687,"type":"comment"},{"by":"dnoz80","dead":true,"id":3539875,"parent":3537881,"text":"Exeter, UK - Fantasy Shopper (www.fantasyshopper.com)\nLooking for a new exciting challenge at one of Europe's hottest startups?\n<a href=\"http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-one-of-europes-hottest-startups-with-3-3m-from-accel-and-nea/\" rel=\"nofollow\">http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-...</a>\nWe are looking for rock star developers joining our high growth startup. Apply here:\n<a href=\"http://www.fantasyshopper.com/about/jobs\" rel=\"nofollow\">http://www.fantasyshopper.com/about/jobs</a>","time":1328129660,"type":"comment"},{"by":"dnoz80","id":3539831,"parent":3537881,"text":"Exeter, UK - Fantasy Shopper (www.fantasyshopper.com)\nLooking for a new exciting challenge at one of Europe's hottest startups?\n<a href=\"http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-one-of-europes-hottest-startups-with-3-3m-from-accel-and-nea/\" rel=\"nofollow\">http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-...</a>\nWe are looking for rock star developers joining our high growth startup. Apply here:\n<a href=\"http://www.fantasyshopper.com/about/jobs\" rel=\"nofollow\">http://www.fantasyshopper.com/about/jobs</a>","time":1328129106,"type":"comment"},{"dead":true,"deleted":true,"id":3572164,"parent":3537881,"time":1328810447,"type":"comment"},{"by":"dnoz80","id":3540724,"parent":3537881,"text":"Exeter, UK - Fantasy Shopper (www.fantasyshopper.com)<p>Looking for a new exciting challenge at one of Europe's hottest startups?<p><a href=\"http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-one-of-europes-hottest-startups-with-3-3m-from-accel-and-nea/\" rel=\"nofollow\">http://eu.techcrunch.com/2012/01/23/fantasy-shopper-becomes-...</a><p>We are looking for rock star developers joining our high growth startup. Apply here:<p><a href=\"http://www.fantasyshopper.com/about/jobs\" rel=\"nofollow\">http://www.fantasyshopper.com/about/jobs</a>","time":1328140441,"type":"comment"},{"by":"alexgodin","dead":true,"id":3539539,"parent":3537881,"text":"New York, NY Full Time (remote or relocation)<p>Backend Engineer @ Dispatch.io<p>What we do<p>----<p>Dispatch connects your cloud services to give you one place to organize, share, and collaborate around your stuff. Our vision is for a more connected cloud.<p>Why you should work here<p>----<p>We are a small, fast-moving team who are passionate about building awesome things. You'd be one of the first few members of the team (we’re 5 people right now).<p>We have a big open office in the Flatiron district in NYC, in the center of the NYC tech scene. Our kitchen is well stocked, and our Campfire overfloweth with animated GIFs. As a team member you'll work on your schedule, have access to competitive health insurance plans, a chance to earn real equity, and, most importantly, the opportunity to contribute in a big way to building new ways to organize, collaborate and share in the cloud.<p>We're looking for a backend engineer. The Dispatch backend is a service oriented architecture, built entirely on AWS. Most of the current services are written in Java (and some Scala), but we’re language agnostic. Want to write that new service in Fortran? Go for it! Ok, maybe not. Let’s talk about it.<p>You'll work on architecting and building new stuff, and on improving existing services.<p>Like hacking on 3rd party APIs? Good, because we build on Dropbox, Google Docs, Facebook, Twitter, Gmail, with plans for many more.\nInterested in file transfer and sync? We’re making moving files in the cloud fast and reliable. Search? We’re building search across the stuff in your clouds. Realtime? You can head up our plans to move from asynchronous polling to a socketed system.<p>Things we're looking for<p>----<p>* Good architecture skills with a focus on details, experience with fault-tolerance, use of message queues, etc.<p>* Experience with small or cross-functional teams (startup experience would be nice).<p>* Solid understanding of computer science fundamentals, e.g. data structures, time complexity, algorithms.<p>* Comfort with statically-typed languages, knowledge of OOP.<p>* Security-mindedness, with the ability to identify and defend against threats and vulnerabilities.<p>* Experience with Amazon Web Services would be nice.<p><i>If you're interested in applying please email jobs@dispatch.io</i>","time":1328125340,"type":"comment"},{"dead":true,"deleted":true,"id":3538250,"parent":3537881,"time":1328109334,"type":"comment"},{"by":"davedd","dead":true,"id":3537962,"parent":3537881,"text":"Sucuri.net - Remote - Part or full time.<p>Looking for a junior system admin (or op dev) to help us out.<p>If you love web security, love learning new tools and have already some experience with Linux, WordPress, Joomla, managing sites, etc, email me dd@sucuri.net.<p>thanks,","time":1328105590,"type":"comment"}]}