{"comments":[[{"by":"dgunn","id":3919780,"parent":3913997,"text":"If \"INTERN\", \"REMOTE\", or \"H1B\" candidates are <i>not</i> welcome to apply to your position, you should not use those words in your post. That defeats the purpose of using those key words if those candidates <i>are</i> welcome.<p>For example, if I am looking for H1B opportunities, ctl+f finds basically every listing because those who aren't willing to accept H1B say, \"no H1B\". If you don't accept these candidates, the convention assumes that by default. Don't explicitly say it.","time":1335974839,"type":"comment"},{"by":"kamens","id":3915172,"kids":[3923745],"parent":3913997,"text":"Khan Academy - Mountain View - (full-time and intern, designers and devs)<p>Our mission is to provide a world-class education to anyone, anywhere. We're scaling quickly.<p>Our students answer over 2 million math problems per day (over 500M total so far), all generated by our open source exercise generation framework (<a href=\"http://github.com/khan/khan-exercises\" rel=\"nofollow\">http://github.com/khan/khan-exercises</a>), and our videos (now from a variety of authors including Sal) have been viewed over 145MM times. We're tracking all that data and using it to customize each student's experience. We could use your help.<p>Working for Khan Academy is one of the highest educational impact positions you can imagine.<p>We're hiring designers and all types of devs -- mobile, frontend, backend, whatever you want to call yourself. Big plans ahead.<p><a href=\"http://www.khanacademy.org/jobs\" rel=\"nofollow\">http://www.khanacademy.org/jobs</a>","time":1335890202,"type":"comment"},{"by":"phillytom","id":3914159,"kids":[3914191],"parent":3913997,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>Monetate is a SAAS provider to internet marketers. We do real-time DOM modification on our clients’ sites to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>About us:<p>* Founded in 2008<p>* Funded by First Round and OpenView<p>* Market comp<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Use the source - Google Closure to Python, Hadoop and Mahout to Solr and Lucene - we're open source across our stack<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of deep problems to work on<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.  Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a> and see more about our open jobs at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http://monetate.com/jobs/</a><p>We've hired great people from HN in the past.<p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1335878508,"type":"comment"},{"by":"MattRogish","id":3914497,"parent":3913997,"text":"New York, NY (we'll cover relo except no H1B) - <a href=\"http://fundinggates.com/jobs\" rel=\"nofollow\">http://fundinggates.com/jobs</a><p>We're a well-funded (angel, strategic - not VC), pre-revenue (just starting development, please help me! :D) company in NYC hiring awesome Rails and JS (Ember is nice, but not necessary) developers.<p>We believe strongly in quiet work environments, work whenever, wherever you want (<a href=\"http://www.gorowe.com\" rel=\"nofollow\">http://www.gorowe.com</a>), the best tools money can buy (unlimited computer/desk budget), 20% time to do whatever you want (but you <i>must</i> share it with the team), hiring smart people and getting out of their way, and generally making the best software company in the world.<p>We're hiring for engineers #1, 2, 3 - so at this time our core team should be either in NYC, or relocatable (we'll cover it!). As we grow the core team we'll be more flexible and able to take the culture hit a remote person brings, but not at this time, sorry!<p>I hope to hear from you. rogish [at] fundinggates dot com","time":1335883010,"type":"comment"},{"by":"lpolovets","id":3914313,"parent":3913997,"text":"Factual is hiring in Palo Alto, Los Angeles, and Shanghai. Local candidates preferred, but remote work is possible for exceptional U.S. candidates. Full-time only. H1B is okay for very strong, non-remote applicants.<p>Factual's vision is to be an awesome and affordable data provider, so that developers, startups, and big companies can focus on innovation instead of data acquisition. We believe in openness and transparency rather than proprietariness and obfuscation.\nWe have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense).<p>In late 2010, we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Newsweek, Yelp, and Blekko. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We have job openings for software engineers of all levels. You would ideally know Java and/or Clojure, and you'll get bonus points for experience with machine learning, NLP, algorithm design, or Hadoop.<p>If you're interested in the Bay Area office, it just opened in December of 2011 and is very small, so you'd have a significant influence on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1335880774,"type":"comment"},{"by":"btucker","id":3914488,"kids":[3915897],"parent":3913997,"text":"Brattleboro, VT / Cambridge, MA / Remote - Rails Developers<p>Green River (<a href=\"http://greenriver.com\" rel=\"nofollow\">http://greenriver.com</a>) is looking for two experienced Rails developers to join our team.  We're a Southern Vermont-based consultancy which was founded in 2000.  We started writing production apps in Rails in '05 and have grown to a team of eight developers, two project managers, and a UX designer.  We focus in the areas of Education, Health and the Environment, and have many great projects ranging from a scoring system Starbucks uses to facilitate the inspection of 90% of the farms they buy coffee from[1] to storytelling software for people with memory loss[2].<p>If these types of projects sound interesting, we'd love to hear from you.  You'd have the option of either working out of our beautiful Vermont office overlooking the Connecticut River, joining our new Cambridge-based team, working remotely, or some combination thereof.<p>Email us: jobs@greenriver.com<p>-Ben<p>[1]: <a href=\"http://www.starbucks.com/responsibility/sourcing/coffee\" rel=\"nofollow\">http://www.starbucks.com/responsibility/sourcing/coffee</a><p>[2]: <a href=\"http://www.timeslips.org/\" rel=\"nofollow\">http://www.timeslips.org/</a>","time":1335882897,"type":"comment"},{"by":"jblz","id":3914310,"kids":[3915649,3916404,3914407],"parent":3913997,"text":"Worldwide Telecommute / REMOTE<p>Automattic is currently hiring for the following positions:<p>- Account Engineer - <a href=\"http://automattic.com/work-with-us/account-engineer/\" rel=\"nofollow\">http://automattic.com/work-with-us/account-engineer/</a><p>- Code Wrangler - <a href=\"http://automattic.com/work-with-us/code-wrangler/\" rel=\"nofollow\">http://automattic.com/work-with-us/code-wrangler/</a><p>- Community Handyman - <a href=\"http://automattic.com/work-with-us/community-handyman/\" rel=\"nofollow\">http://automattic.com/work-with-us/community-handyman/</a><p>- Designer - <a href=\"http://automattic.com/jobs/designer/\" rel=\"nofollow\">http://automattic.com/jobs/designer/</a><p>- Growth Engineer - <a href=\"http://automattic.com/work-with-us/growth-engineer/\" rel=\"nofollow\">http://automattic.com/work-with-us/growth-engineer/</a><p>- Happiness Engineer - <a href=\"http://automattic.com/work-with-us/happiness-engineer/\" rel=\"nofollow\">http://automattic.com/work-with-us/happiness-engineer/</a><p>- Mobile Wrangler - <a href=\"http://automattic.com/work-with-us/mobile-wrangler/\" rel=\"nofollow\">http://automattic.com/work-with-us/mobile-wrangler/</a><p>- Systems Wrangler - <a href=\"http://automattic.com/work-with-us/systems-wrangler/\" rel=\"nofollow\">http://automattic.com/work-with-us/systems-wrangler/</a><p>- Theme Wrangler - <a href=\"http://automattic.com/work-with-us/theme-wrangler/\" rel=\"nofollow\">http://automattic.com/work-with-us/theme-wrangler/</a><p>We build WordPress.com, contribute to the WordPress Open Source project (<a href=\"http://wordpress.org\" rel=\"nofollow\">http://wordpress.org</a>) and work on a lot of other really cool stuff.<p>Join us if you are passionate about making the web a better place.<p><a href=\"http://automattic.com/\" rel=\"nofollow\">http://automattic.com/</a><p><a href=\"http://automattic.com/work-with-us/\" rel=\"nofollow\">http://automattic.com/work-with-us/</a>","time":1335880710,"type":"comment"},{"by":"seldo","id":3915393,"parent":3913997,"text":"San Francisco, CA (Mission District) - awe.sm - H1B okay<p>We're building conversion tracking for social media: think \"Sendgrid for social media\".<p>What's that mean? It means we're building a platform that lets other companies abstract away a complex problem that lots of people have been reinventing the wheel for: measuring traffic, page views, signups and sales generated by users sharing with each other on Twitter, Facebook et al. We have a bunch of APIs and are building more all the time, as well as a GUI that attempts to make our data easy to use.<p>We're hiring front-end engineers, back-end engineers, and those who fall into both categories, who we call \"full stack\" engineers:<p><a href=\"http://awe.sm/jobs\" rel=\"nofollow\">http://awe.sm/jobs</a><p>On the back-end, we use a variety of languages including PHP and Ruby (and bash) to build high-performance, high-volume, real-time data collection and processing systems, connecting to a bunch of different data stores including MySQL, Redis and Sphinx. We are more concerned with the \"smart and gets things done\" type than a specific line on your resume, and are willing and eager to provide training and mentorship, both internal and external.<p>We're a team of 13, rising to 14-16 once we hire you people. Our perks include offices with an awesome view ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) at 22nd and Mission, catered lunch 3x a week, and a company IRC server, which should tell you a lot about the kind of devs we are.","time":1335892657,"type":"comment"},{"by":"eli","id":3914267,"parent":3913997,"text":"Industry Dive - Developer Intern &#38; Editorial Intern<p>Washington, DC (just off Dupont Circle)<p>Industry Dive builds mobile apps and websites that help business executives excel at their jobs. We're a young company with experienced founders and a bit of seed money. We are hard at work building out our publishing platform and creating apps for each industry vertical. Pull up constructiondive.com or utilitydive.com on your phone to get a rough idea of where we're headed. (I'll let you in on a little secret: B2B isn't as sexy as working on the next Instagram of Spotify, but there's a lot of money there and the B2B publishing industry is ripe for disruption.)<p>We've got a variety of projects that would be a good fit for a developer intern interested in web design, mobile apps, and/or stable and scalable architecture. Our primary stack is Python/Django (with a little bit of PHP), but being smart and eager to learn is more important than any prior specific technical skills.<p>We're also looking for editorial interns interested in aggregating content and writing features &#38; news summaries.<p>Email eli-at-industrydive.com for details.","time":1335880113,"type":"comment"},{"by":"flyingyeti","id":3915407,"parent":3913997,"text":"Irvine, CA or Remote, full-time<p>The Prometheus Institute is looking for developers to help architect and build our web and mobile infrastructure and support our goal of revolutionizing the way citizens interact with their government.<p>We a civic technology startup whose mission is to pioneer innovative software to advance freedom and civic engagement. We build tools, such as our iPhone app, Do-it-Yourself Democracy, that make it fun and easy to help citizens protect their freedoms and hold government accountable.<p>We are currently focused on rebuilding the DIY Democracy experience as a full web and mobile platform. Our technology stack is built around Python, Django, Postgres, PostGIS, Redis and similar tools.<p>Web Application Engineer: <a href=\"http://prometheuscivic.theresumator.com/apply/Tia2pG/Web-Application-Engineer.html?source=hn\" rel=\"nofollow\">http://prometheuscivic.theresumator.com/apply/Tia2pG/Web-App...</a><p>Web Front-End Engineer: <a href=\"http://prometheuscivic.theresumator.com/apply/bYzV4d/Web-FrontEnd-Engineer.html?source=hn\" rel=\"nofollow\">http://prometheuscivic.theresumator.com/apply/bYzV4d/Web-Fro...</a>","time":1335892939,"type":"comment"},{"by":"j4mie","id":3914349,"parent":3913997,"text":"Brighton, UK - <a href=\"http://dabapps.com\" rel=\"nofollow\">http://dabapps.com</a><p>DabApps is looking for a junior to mid-level software developer with minimum one year of experience. May suit graduate with internship or sandwich year experience.<p>DabApps is a growing company based in the centre of Brighton. We concentrate on web and mobile application development, and are passionate about producing high-quality work that we and our clients can be proud of. Our values are based on standards compliance and best practice and we are constantly working to improve and streamline our development process. We use open source technology wherever we can, and contribute back to the open source community as much as possible.<p>Below is a list of core technologies and skills we are looking for. We are not expecting any candidate to have experience or knowledge in all of these areas. What we are looking for is the ability and desire to learn in a self-motivated way to fill in the gaps in your knowledge as required.<p>Python, Django, Objective-C, JavaScript, HTML/CSS, Relational databases, Redis, MongoDB, CouchDB or other NoSQL databases, Solr, ElasticSearch or other search solutions, \"Big Data\", distributed systems, data analysis/indexing, Linux server administration, Mac or Linux desktop experience, User experience analysis and design, prototyping<p>See <a href=\"http://dabapps.com/careers/current-vacancies/2012-04-software-developer/\" rel=\"nofollow\">http://dabapps.com/careers/current-vacancies/2012-04-softwar...</a> for full details.","time":1335881279,"type":"comment"},{"by":"simonholroyd","id":3914137,"parent":3913997,"text":"TriBeCa, New York, NY<p>At GO TRY IT ON (<a href=\"http://gotryiton.com\" rel=\"nofollow\">http://gotryiton.com</a>), we're developing a platform to help the world answer the question, \"What should I wear?\" We build slick iPhone apps and desktop experiences for a passionate and helpful community that spans the globe. We build fast API's to power social sharing and networking, and fashion discovery. We're growing a database that maps large datasets of user preferences to a growing fashion catalog of products from all over the web. We're working to harness and democratize the value of personal stylists through technology.<p>Tech we use: PHP, jQuery, Node.js, Compass, MySQL, S3, Chef, Capistrano, Jenkins, Github<p>We have: Series A funding from SPA investments and Index Ventures, a small, growing team of very smart people, a sweet office on the 21st floor with awesome panoramic city views [n: <a href=\"http://twitpic.com/6udocv\" rel=\"nofollow\">http://twitpic.com/6udocv</a>, e: <a href=\"http://twitpic.com/6udp0j\" rel=\"nofollow\">http://twitpic.com/6udp0j</a>, s: <a href=\"http://twitpic.com/6udphj\" rel=\"nofollow\">http://twitpic.com/6udphj</a>, sw: <a href=\"http://twitpic.com/6udpsx\" rel=\"nofollow\">http://twitpic.com/6udpsx</a>]<p>ios developer: <a href=\"http://gotryiton.com/jobs/ios\" rel=\"nofollow\">http://gotryiton.com/jobs/ios</a><p>front end developer: <a href=\"http://gotryiton.com/jobs/front-end\" rel=\"nofollow\">http://gotryiton.com/jobs/front-end</a><p>*REMOTE &#38; HB1 considered<p>Email simon@gotryiton.com","time":1335878049,"type":"comment"},{"by":"adrianhon","id":3914823,"parent":3913997,"text":"Six to Start (<a href=\"http://sixtostart.com\" rel=\"nofollow\">http://sixtostart.com</a>) - London, UK<p>Mobile Engineer / Full Stack Engineer, Fulltime<p>We're the creators of Zombies, Run! (<a href=\"http://zombiesrungame.com\" rel=\"nofollow\">http://zombiesrungame.com</a>), a running game and audio adventure for iOS. ZR was #1 Top Grossing Health and Fitness across the world for two weeks and continues to stay in the top 5; we have an Android version coming out soon and are working on extending and expanding the game.<p>We're a small team of five people, but we're growing rapidly off the success of ZR since we're already profitable and not reliant on any investors. At the moment we want to continue developing ZR across mobile platforms, as well as begin development on new and highly innovative mobile games.<p>You'll have the opportunity to make a big difference on the games that we make - games that aren't like anything that people have seen before. At $7.99, ZR is the most expensive game in the Top 200 Paid, and the third most expensive app after Apple's. In other words, we make games so attractive that people are prepared to pay eight times the going rate. That's our business model.<p>We're not interested in gamification or making casual games - we treat smartphones not as faster Gameboys, but as the very first wearable computers. Are you?<p>This position is for London, UK. Email hello (at) sixtostart.com","time":1335886415,"type":"comment"},{"by":"DavidChouinard","id":3914256,"parent":3913997,"text":"FlightAware (flightaware.com) — Houston, TX (no REMOTE, no H1B)<p>Front-end (UI/UX) Developer<p>Here’s a profile of us from 37signals (we do flight tracking software, 2M+ pageviews a day): <a href=\"http://37signals.com/svn/posts/2780-bootstrapped-profitable-proud-flightaware\" rel=\"nofollow\">http://37signals.com/svn/posts/2780-bootstrapped-profitable-...</a><p>We have very interesting data visualization and UI problems and your work will reach millions of users. We've also released a bunch of open source projects. You get top-of-the-line Apple gear and our kitchen is always stocked with snacks and beverages, including a free (!) beer kegerator. We’re a fun, high-caliber team that trusts you and gives you the freedom to be brilliant.<p>We’ve been around for a while and are profitable, but we’re still growing like mad. Compensation is very competitive.<p>Who you are:<p>• You have a trail of cool projects you’ve worked on, including some you’ve written to scratch your own itch.<p>• You obsess over the design of everyday things, from door knobs to teapots or light switches.<p>• You have a passion for software and desire to change the world.<p>• You have excellent implementation skills, including deep expertise in Javascript (jQuery).<p>• You enjoy working on tricky UI problems with equally smart people.<p>You can apply on our website: <a href=\"https://flightaware.com/about/careers/position/frontend_developer\" rel=\"nofollow\">https://flightaware.com/about/careers/position/frontend_deve...</a> or shoot me an email: david.chouinard@flightaware.com","time":1335879951,"type":"comment"},{"by":"TwoSigma","id":3915076,"kids":[3915167],"parent":3913997,"text":"Two Sigma Investments – New York, NY (Full Time Positions)<p>At our core, we're a technology company applying our talents to the domain of finance.  We've created a system that combines artificial intelligence and keen human insight—a system that's constantly improving and advancing.<p>We are looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.  We teach and learn from each other.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology.  We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you.<p>Stacey.Winning@twosigma.com\n<a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1335889192,"type":"comment"},{"by":"mcholly","id":3914979,"parent":3913997,"text":"San Francisco, New York or anywhere if you are pro.<p>We've got lots of engineering work to do, with some cool technologies like rails 3.2, html5, node.js and redis.  We've got internal and external projects, and flexibility for you to settle in at any part of the stack. We look forward to the day when all the content on the web is interactive and we need help to make that happen. Help us get the ad world off flash and into html5.  <p>We do interactive ads and ads pay. Spongecell is spryly booming with a 3 year growth of over 3,000% and a recent $10 million investment.<p>We've got a supportive and flexible development environment with a small but great team of experienced entrepreneurs, tech startup leaders, Railsconf and MySQL conference speakers, a competitive water skier, a restauranteur and a Starcraft wizard. We know where to get good sushi and like bacon and beer.<p>The company offers a very competitive pay, equity and benefits package along with flexible meatspace arrangements.<p>We need good additions to team. If you'd like to talk more send stuff here <a href=\"http://www.jobscore.com/jobs/spongecell/list\" rel=\"nofollow\">http://www.jobscore.com/jobs/spongecell/list</a> or email at matthew.cholerton@spongecell.com.","time":1335888139,"type":"comment"},{"by":"adoherty","id":3914309,"parent":3913997,"text":"Downtown Chicago, IL – Full time Java Developer/Web Developer/DevOps Engineers/QA<p>IMC Financial Markets is a proprietary trading firm. We're primarily a java shop but we're also looking for web devs and sys admin types. We're open to new technologies and open to change; your job will be to use whatever is available to solve the task at hand the best way, and not to waste time reinventing the wheel. Depending on what role you think you’d be best for, you will be writing code that runs on boxes colocated in exchanges all around the world, writing scripts that manage these boxes and tuning them for increased performance, or working on ways to improve testing our code.<p>Perks include:\nOpportunities to travel - we have offices in Amsterdam, Zug, Chicago, Sydney and Hong Kong<p>Commuter Benefits<p>Free Gym Membership<p>Annual Company Trip<p>A fun environment – Pool, foosball, ping pong<p>Massage Therapist on site everyday<p>Fully stocked kitchen, bar, breakfast, lunch all week, and a happy hour every Friday<p>You can apply on our website:\n<a href=\"http://www.imc-chicago.com/Financial-markets/Offices/Chicago/Vacancies/\" rel=\"nofollow\">http://www.imc-chicago.com/Financial-markets/Offices/Chicago...</a> or shoot me an email: heather.corallo@imc-chicago.com","time":1335880709,"type":"comment"},{"by":"dmarble","id":3914552,"parent":3913997,"text":"Spurfly - Palo Alto, CA or Arlington, VA - Python/Coffeescript Developer - LOCAL or REMOTE (full-time preferred)<p><pre><code>    • Full-stack Developer, and\n\n    • Front-end (UI/UX) Developer for desktop web and/or mobile web\n</code></pre>\nHelp us scale and meet demand for real-time location-aware planning. Our focus is on groups and events (\"spur of the moment, on the fly\"). We think we have something unique to offer the world and are launching a native iOS app in a few weeks and expanding to web and mobile web next.<p>The founders are straight shooters who value clear communication and getting stuff done. We're obssessed with creating a product that fills what we see as a major hole in social networking software -- helping people more efficiently connect in real-life with close networks so they can spend more of their time building and enriching real relationships.<p>Technologies:<p><pre><code>    • frontend: coffeescript, jQuery, backbone.js, socket.io, compass\n\n    • backend: python, django, gevent, gunicorn, nginx, postgres\n</code></pre>\nWe need some knowledge/experience optimizing and scaling some or all of the above technologies to handle growth, and building real-time single-page architecture sites or mobile web.<p>Immediate front-end needs include design and development of our desktop web and mobile web versions and giving thoughtful consideration to iPhone workflows as we get feedback from users.<p>Full-stack devs are needed to help optimize and expand our API, re-assess our real-time web architecture, add background processing for actions triggered by the API calls, optimize queries, and support what's going to potentially be a wild ride as we do launch events over the next few months.<p>gmail - davidmarble (main tech guy on the founding team)","time":1335883602,"type":"comment"},{"by":"MikeKaplan","id":3914421,"parent":3913997,"text":"Retroficiency -- Boston, MA (no REMOTE, H1B for right candidate)<p>Retroficiency is a venture backed start-up that's developed cloud-based software to change the commercial energy efficiency game.  We aim to put a significant dent in building energy consumption (more than 40% of the U.S. total), and our approach – driven by sophisticated energy analytics and rapid building modeling – is uniquely positioned to enable current manual processes and scale the evaluation of energy conservation measures like never before.<p>Want more proof we are the real deal?  We just surpassed 100 million square feet evaluated in our first year of availability. We are growing rapidly and need great developer talent.<p>We are looking for great Front-end Software Engineers, Server-side Software Engineers and Web Developers<p>Check out our openings at: <a href=\"http://www.retroficiency.com/careers/\" rel=\"nofollow\">http://www.retroficiency.com/careers/</a>","time":1335882074,"type":"comment"},{"by":"gustaf","id":3915559,"parent":3913997,"text":"Voxer, San Francisco (SOMA), Full time<p>Voxer is a Walkie Talkie application for iOS and Android. We launched in 2011 and have since become the fastest growing mobile voice application in the world. We're also the largest user of Node.JS in the world.<p>What we've built is already an important part of the daily lives of millions of people. We're making voice communication faster, more efficient, and more social. Our goal is ambitious - we're building the next generation communication service at the intersection between phone calls and SMS.<p>We're a surprisingly small team doing this. Only about a dozen engineers who previously worked at Danger, Android, Apple, Twitter and Heysan(YC07). We helped build things like redis for node.js and are contributors to the node.js community.<p>Ryah Dahl talks about Voxer: <a href=\"http://www.youtube.com/watch?feature=player_detailpage&#38;v=Fc26auhSLqM#t=1150s\" rel=\"nofollow\">http://www.youtube.com/watch?feature=player_detailpage&#38;v...</a><p>We use a lot of:<p>★ Node.js<p>★ Riak<p>★ Redis<p>We try to stay out of the spotlight and focus on building something amazing. The problems we're facing are at a scale only seen at companies like Twitter and Facebook and we're looking for exceptional people who can help us tackle them.<p>We're hiring for:<p>★ Node.js / Infrastructure Engineer<p>★ Analytics / Hadoop Engineer<p>★ Data Scientist<p>★ Android Engineer<p>★ Engineering Internship<p>★ Growth Engineer<p>★ iOS Engineer<p>★ iOS Product Manager<p>★ QA Client Automation Engineer<p>★ Engineering Recruiter / Talent Lead<p><a href=\"http://voxer.com/jobs\" rel=\"nofollow\">http://voxer.com/jobs</a><p><a href=\"http://techcrunch.com/2012/01/10/popular-like-voxer/\" rel=\"nofollow\">http://techcrunch.com/2012/01/10/popular-like-voxer/</a><p><a href=\"http://techcrunch.com/2012/04/11/walkie-talkie-app-voxer-\" rel=\"nofollow\">http://techcrunch.com/2012/04/11/walkie-talkie-app-voxer-</a>\ngoes-big-ivp-and-intel-lead-30-million-round/","time":1335894684,"type":"comment"},{"by":"ScIMed","id":3915584,"parent":3913997,"text":"SciMed Solutions, Durham NC, Full-time \nwww.scimedsolutions.com/employment-opportunities<p>Send resume and cover letter to employment@scimedsolutions.com.<p>We are passionate about building software in the medical, scientific, and academic communities. Our work has enabled our clients to make a difference in vaccine discovery, cancer treatment, energy- efficient building construction, and social change.<p>We are looking for someone equally passionate as well as self-motivated, disciplined, driven, a decision-maker, and a team player. We want employees  who are not solely driven by personal success, but are invested in the team's success.<p>Although this position is for a Ruby on Rails developer, Ruby experience is not required. If you have a 4 year degree, are a talented coder, can work quickly, and work across multiple technologies and projects, we'll train you on Ruby.<p>Experience or understanding of Agile development, experience in coding technologies such as PHP, Python, Perl, .NET, JSP, XML, JavaScript, or AJAX are a plus. The best applicants will bring valuable skills beyond computer science and software engineering.<p>We strive to find the best fit for every employee and value personal growth. If you are interested in working in an environment of accuracy, teamwork, openness, respect, and would like to limit your work week to 40 hours, apply today. Send your resume and cover letter to employment@scimedsolutions.com.","time":1335894944,"type":"comment"},{"by":"mikebabineau","id":3916097,"parent":3913997,"text":"Rumble - SF Bay Area (Redwood Shores)<p>Lead/senior/mid-level engineers, data scientists, BI, producers, artists, designers, writers, and more:<p><a href=\"http://www.rumblegames.com/careers\" rel=\"nofollow\">http://www.rumblegames.com/careers</a><p>Rumble is a developer and publisher of connected games. We were founded in 2011 with a mission to create the most engaging and fulfilling online game experiences on the planet. All of our games are free-to-play and available across your favorite devices and social networks. We are unique in our focus on the gamer audience and our exacting standards around quality gameplay. Our passion is to create experiences that surprise and delight our players. By combining the best of AAA game design with free-to-play accessibility, we believe we will change the way gamers play together.<p>We have an all-star team of game industry veterans from Zynga, Activision, BioWare, Blizzard, Playdom, Electronic Arts, Turbine, FooMojo and RockYou. Check us out:\n<a href=\"http://www.rumblegames.com/about/our-team\" rel=\"nofollow\">http://www.rumblegames.com/about/our-team</a><p>We are backed by Google Ventures and Khosla Ventures, and recently announced our first title, a Flash 11-based 3D multiplayer action RPG -- check out the trailer:\n<a href=\"http://www.rumblegames.com/kingsroad\" rel=\"nofollow\">http://www.rumblegames.com/kingsroad</a><p>Drop me a line: mike.babineau@rumblegames.com","time":1335901882,"type":"comment"},{"by":"derwiki","id":3914550,"parent":3913997,"text":"San Francisco, fulltime systems/ops and engineering, Causes - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a><p>At Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 12-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, etc. Ways we're trying to make ourselves better engineers:<p>- deliberate practice with our tools. If you are a vim user, we have the programmer who wrote Command-T on staff and he's a great person to learn from - every changeset gets pushed to Gerrit where it waits to get a +1 from our build suite (that runs in 3 minutes) and a +1 from a human reviewer<p>- last month I said we were hoping to finish our Rails 3.0.11 upgrade soon. I'm happy to announce that not only have we landed on 3.2.3, but we needed some upstream patches to get our site working -- so we're on bleeding edge Rails. We're the largest site I know of on Rails 3.2. Come get your SASS on!<p>- everyone is encouraged to take one hour from their day to learn about something they wouldn't otherwise<p>- every story is scoped so that it can be completed in less than a day. We don't branch, we just work on top of master. We've found that the closer we stay to master, the less needless work we create for ourselves<p>Causes is a great place to better yourself and better the world. We're particularly looking for a systems/ops/network engineer to help wrangle our colo. Apply through the site or adam@causes.com if interested!","time":1335883582,"type":"comment"},{"by":"wdaher","id":3916226,"kids":[3917434,3916334,3916583],"parent":3913997,"text":"Cambridge, MA (or REMOTE). Full-time.<p>Do you like low-level systems programming? Does the idea of hacking on an old-school graphics demo that fits into a DOS MBR in your free time appeal to you? Does \"Dazed and confused, but trying to continue\" mean anything to you? Have you ever told a joke whose punch line was a git command? If you've answered yes to any of the above, I think we'll be fast friends -- and we want to hear from you.<p>We're looking for engineers who are excited to work on technology that most people will tell you is impossible: updating an OS kernel while it is running. Help us bring rebootless kernel updates to Linux, as well as new operating system kernels and other parts of the software stack. You must have prior experience with operating systems, including kernel programming, debugging, porting, memory management, and/or virtualization. Experience with compilers is also relevant.<p>About us:\nWe're a small, tight-knit team of twelve men and women that enjoy working on hard technology problems. We were recently acquired by Oracle, and are eager to take advantage of its vast resources to get Ksplice into the hands of sysadmins everywhere.<p>Feel free to direct questions to me at waseem.daher@oracle.com or to jobs@ksplice.com. If you're interested, send us a resume and we'll be in touch. Oracle is an equal opportunity employer.","time":1335903875,"type":"comment"},{"by":"mecredis","id":3914949,"parent":3913997,"text":"New York City, Rails, Full time<p>I work at Kickstarter we are looking for more Rails engineers that want to write mission critical code that enables thousands of people to realize their creative dreams.<p>Features are developed by small groups of engineers, designers, and product managers. Some of the projects we’re working on right now include: tools for Kickstarter’s project creators, payment processing for millions of dollars in pledges every week, and new ways to discover projects through social recommendations and data analysis.<p>We deploy daily for features big and small, and encourage contribution to open source projects. Everyone in product and design commits code, so expect to work closely with people up and down the stack (right now we're 7 engineers with another 5 or 6 committers). We develop in Rails and JavaScript/jQuery, host on AWS, and manage code in git — but we’re not dogmatic about it.<p>You can checkout some of the projects we've open sourced on our github organization page here: <a href=\"https://github.com/kickstarter\" rel=\"nofollow\">https://github.com/kickstarter</a><p>So if you’re interested in helping us build a platform that is changing how culture gets made, get in touch -- jobs [at] kickstarter.com. We’d love to see your favorite work, whether it’s a side project or your github profile.","time":1335887783,"type":"comment"},{"by":"TimothyFitz","id":3914751,"parent":3913997,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\". Yes, your day job will be writing code. But that's the only similarity to a big company software job.<p>You'll be challenged to take big ideas and turn them into concrete testable hypotheses. Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>More details and how to apply: <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1335885749,"type":"comment"},{"by":"crb","id":3914290,"parent":3913997,"text":"London, UK — Stoneburn: <a href=\"http://www.stoneburn.com/\" rel=\"nofollow\">http://www.stoneburn.com/</a><p>Stoneburn are a Google Apps, Google Enterprise Search and Amazon Web Services consultancy. We're looking for junior administration &#38; deployment staff - our ultimate hires would be a year or two out of university, with a system administrator/scripting background and a hacker mentality. Your primary work to start will be building our support department for business Google Apps customers, but you'd be expected to be competent enough to help out with any Linux/Windows application we might engineer for our customers and host on AWS. (We'll expect you to know enough about e-mail to tell me what an MX record is, but full Google/Amazon training is provided.)<p>As hiring manager I'll be looking out for a cover letter that shows both ambition and the great communication skills you would be expected to display to customers.<p>Depending on your preference for direction, possible career path is into the development or deployment teams.<p>Check the jobs page out at <a href=\"http://www.stoneburn.com/about-stoneburn/jobs\" rel=\"nofollow\">http://www.stoneburn.com/about-stoneburn/jobs</a>. Instructions on how to apply are on that page, but please put 'HN' in the subject.","time":1335880402,"type":"comment"},{"by":"zephyrnh","id":3915131,"parent":3913997,"text":"San Francisco, CA\nH1B Welcome<p>Airbnb - <a href=\"http://www.airbnb.com/\" rel=\"nofollow\">http://www.airbnb.com/</a><p>We only have 27 engineers, and we need more!<p>I'm a backend engineer here, and we're hiring backend, frontend, mobile and ops engineers.  Check out our (pretty sweet) jobs page: <a href=\"http://www.airbnb.com/jobs\" rel=\"nofollow\">http://www.airbnb.com/jobs</a><p>I've been working at/founding startups for the last few years, and didn't think I would end up somewhere as \"big\" as Airbnb, but I love it here.  Despite the large size of our customer service operations worldwide, the entire product team (PMs + engineers + designers) is still ~40 people, there's still a lot to do, and we need help doing it :)","time":1335889873,"type":"comment"},{"by":"nopassrecover","id":3914864,"kids":[3915101],"parent":3913997,"text":"(OFF-TOPIC) - Why are so many jobs downvoted here? Are people downvoting other listings to make their own listings higher ranked? Are there some controversies surrounding the downvoted companies I'm unaware of? (if so please post a link below the job asking for the poster to give feedback on the issue)","time":1335886840,"type":"comment"},{"by":"rhc2104","id":3915468,"parent":3913997,"text":"San Francisco, CA, or REMOTE, full-time or intern<p>Samasource is a distributed work system similar to Mechanical Turk, but aimed at eradicating global poverty by providing work to the people on the lowest rungs of the economic ladder.  See the TEDx talk our founder gave: <a href=\"http://vimeo.com/9305118\" rel=\"nofollow\">http://vimeo.com/9305118</a>.<p>We're looking for a senior engineer (Ruby knowledge preferred but optional), Operations Engineer, PM, and other positions.\n<a href=\"http://samasource.org/careers/\" rel=\"nofollow\">http://samasource.org/careers/</a><p>Feel free to email me at rhc2104(at)columbia(dot)edu if you have any questions.","time":1335893609,"type":"comment"},{"by":"sshumaker","id":3915637,"parent":3913997,"text":"Los Angeles, CA - elarm.com - Full Time<p>At elarm, we're building the next-generation of home security. The clunky, low-tech alarm systems available today haven't changed in twenty years. We're creating a beautiful device you don't just need, but actually want to own: wireless, android-powered, easy to use, and designed for smartphones and video surveillance. And it's been built from the ground up as a consumer electronics product - so you can buy it, open up the box and set it up yourself in just a few minutes.<p>We spent the last year hard at work and just finished raising a large seed round to help transform our prototype into a real shipping product. Come join us and help us launch!<p>We're hiring for the following positions:<p>- Rails / Web Developer<p>- Mobile App Developer (iOS or Android)<p>- Linux / Embedded Hardware Guru<p>We can offer competitive salary, meaningful equity, and a chance to work on something that will become an intimate part of people's lives.<p><a href=\"http://elarm.com/\" rel=\"nofollow\">http://elarm.com/</a><p><a href=\"http://elarm.theresumator.com/\" rel=\"nofollow\">http://elarm.theresumator.com/</a> (jobs)","time":1335895672,"type":"comment"},{"by":"bmcfarland","id":3914282,"parent":3913997,"text":"SoHo, New York, New York --- FullTime Engineer<p><i></i><i>About us:<p>Spling is a fun, beautiful way to collect and express the sights and sounds of the internet. Spling transforms the outdated, blue textual representation of a link into interactive media. Users can then express themselves through their links, creating an online digital media identity.<p>Spling is an early stage startup backed by numerous VCs and angels. We are in a unique position where we can offer a competitive salary with generous, meaningful equity.<p></i><i></i>What we're looking for:<p>At Spling, we believe in beauty through self-expression and creative freedom for our users and team members. We are focused on creating a tight knit community where everyone loves the product they are building, as well as the environment they are working in. We are looking for talented individuals to join our family who have the unique ability to combine hustle with the desire to make every pixel perfect.<p>more info: <a href=\"http://jobs.37signals.com/jobs/10916\" rel=\"nofollow\">http://jobs.37signals.com/jobs/10916</a>","time":1335880352,"type":"comment"},{"by":"zg","id":3914593,"parent":3913997,"text":"London, UK - <a href=\"http://www.trialreach.com\" rel=\"nofollow\">http://www.trialreach.com</a><p><i>The Role:</i> We're looking for for front and back-end developers, but ideally you will be comfortable working on our whole stack (Linux/Python/Django through to HTML/JS/CSS with jQuery) even if you're stronger on one end than the other.<p>Compensation includes base salary + bonus + stock options<p><i>About TrialReach:</i> We're an early stage VC-backed startup that helps patients find and access new treatments before these are available to the general public. We've signed up a bunch of major pharmaceutical companies as customers and we're trying to solve one of the biggest problems in the industry.<p>We've got a great riverside location and you'll get to work alongside some very smart and experienced people on something that can transform the lives of patients worldwide.<p><i>Bonus points if you:</i><p>- Speak any European languages<p>- Are familiar with building systems to manage and display multilingual content<p>- Have experience with recommendation/search algorithms<p><i>Interested? Pop me an email:</i> zeshan at trialreach.com","time":1335884173,"type":"comment"},{"by":"tg3","id":3915764,"parent":3913997,"text":"Chicago, IL (right now, may be moving to the Bay Area) / Remote / Full-time and Intern<p>Wikify.me is a recently-funded (angel) company looking for our first big engineering hires.<p>We are one engineer and one business guy building the 3rd person perspective in social media using NodeJS, MongoDB, and jQuery. Wikify.me launched in a beta release at our Alma Mater a month ago and have been iterating since to get the product we want.<p>We're looking for Interns and Full-time developers to join the Wikify.me team. Experience with Node/Mongo/jQuery is a bonus, but not required. Our only requirement is that you're smart, passionate, and willing to work outside of a job description.<p>We want you to help us build the company you would want to work for, and change the world with an amazing product at the same time.<p>We offer competitive pay and significant equity, and expect that our first hire(s) will be a critical part of building our company and our culture.<p>Send me an email (trey dot griffith at gmail) telling me about something cool you've done, and attach your resume.","time":1335897216,"type":"comment"},{"by":"trefn","id":3914799,"parent":3913997,"text":"San Francisco, CA<p>FULLTIME<p>Mixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http://mixpanel.com</a>) is a web analytics startup based in San Francisco. Our platform is the most powerful &#38; flexible analytics service available for mobile and the web.<p>Revenue is in the millions, growth is solid, and we're cash-flow positive. It's a good position to be in.<p>We're hiring for a number of positions, but I'd like to highlight a few:<p>1. Director of marketing - we're looking for our 1st pure marketing hire (<a href=\"http://news.ycombinator.com/item?id=3896058\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3896058</a>).<p>2. Solutions Architect - hybrid support/sales/marketing/engineering role. Really awesome for developers who want to do more client-facing stuff.<p>3. Backend/ops engineer - we have a large amount of infrastructure (~200 servers) for a company our size &#38; need someone to manage it. This role is all about automation.<p>See <a href=\"http://mixpanel.com/jobs/\" rel=\"nofollow\">http://mixpanel.com/jobs/</a> to learn more, or you can message me directly - tim@mixpanel.com","time":1335886177,"type":"comment"},{"by":"adammichaelc","id":3951767,"parent":3913997,"text":"Full-time front-end developer, San Francisco, CA or Provo, UT. Remote ok.<p>About Us:<p>Raised a $1.7 million seed-round from A-list investors (for details, <a href=\"http://techcrunch.com/2012/02/23/scan-gets-1-7m-from-google-ventures-and-shervin-pishevar-to-make-qr-codes-actually-useful/\" rel=\"nofollow\">http://techcrunch.com/2012/02/23/scan-gets-1-7m-from-google-...</a> )<p>Scan, Inc. <a href=\"http://scan.me\" rel=\"nofollow\">http://scan.me</a><p>Our mission is to connect the digital and physical world via QR codes, NFC, etc.<p>Right now we're working on fixing the broken user-experience with QR codes, and finding and executing on the use-cases where using a QR code is a net-win for the user.<p>For more, see <a href=\"http://techcrunch.com/2012/02/23/scan-gets-1-7m-from-google-ventures-and-shervin-pishevar-to-make-qr-codes-actually-useful/\" rel=\"nofollow\">http://techcrunch.com/2012/02/23/scan-gets-1-7m-from-google-...</a><p>About You:<p>* Lots of experience running a high-traffic site, handling everything on the front end (design, JavaScript &#38; CSS, some scripting language such as PHP to talk to the back end)<p>* Loves getting hands dirty and jumping in to get lots of stuff done<p>* Methodical in doing things right the first time (unit testing, thinking of edge cases, etc)<p>* Loves to geek out learning UX, understands psychology and how to create blissful user experiences<p>5. Passionate about focusing on the user and what they want/need<p>Pluses<p>1. iOS and Android design experience\n2. Thinks QR codes are broken, and has lots of ideas about how to fix them to bring users delight.<p>Email adam@scan.me to start a conversation. Point me to your work and tell me a little about yourself.<p>Thanks!\nAdam","time":1336621628,"type":"comment"},{"by":"metartdev","id":3916318,"parent":3913997,"text":"MetArt / SexArt - Los Angeles, CA, Vancouver, BC or REMOTE<p>MetArt is one of the oldest and busiest paid adult websites anywhere. For over 12 years, MetArt has been the leader in high-quality softcore pornography. We are often in the Alexa top 1,000, and are rapidly expanding our list of money-making properties MetArt is based in Los Angeles but telecommuting is welcome.<p>----<p>MetArt has an opening for a mid to senior level PHP developer and telecommuting is welcome. We are a traditional paid adult site, not one that gives away free content, and we deal with millions of visitors every day.<p>As a senior level developer, you'll be expected to take on the architecture, design, and implemention of complete applications. We work with our own custom content management system that is expanding to meet the needs of our growing network of very profitable sites.<p><a href=\"http://careers.stackoverflow.com/jobs/19187/nsfw-adult-site-php-developer-senior-level-metart\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/19187/nsfw-adult-site-...</a>","time":1335905671,"type":"comment"},{"by":"JoshKastelein","id":3914289,"kids":[3957026],"parent":3913997,"text":"Boston, MA - <a href=\"http://www.crimsonhexagon.com\" rel=\"nofollow\">http://www.crimsonhexagon.com</a><p>Crimson Hexagon is one of few consumers of the full Twitter firehose, and we're looking for software engineers to help scale our infrastructure and support phenomenal growth.<p>With patented algorithms, we use machine learning to measure public opinion about major brands, politics, etc. using the social web as our datasource. Our clients include many household names. We've collected, indexed, and are constantly mining an archive of over 120 billion web and social media documents, adding another 1+ billion every three days.<p>I found my position here in a \"Who is Hiring\" thread[0], and the challenges, culture, and people here have been fantastic. We're a lively crew and are well funded. And we have plenty of perks and plenty of fun.<p>Drop me a line at josh@crimsonhexagon.com<p>[0] <a href=\"http://news.ycombinator.com/item?id=2832316\" rel=\"nofollow\">http://news.ycombinator.com/item?id=2832316</a>","time":1335880393,"type":"comment"},{"by":"emidln","id":3915266,"parent":3913997,"text":"Highland Park, Illinois (near Chicago)<p>OpinionLab is hiring. We listen for, process, and analyze the feedback our customers' clients provide. \nYou might have seen our [+] around the web.<p>We're looking for someone with a very good working knowledge of Python who can work autonomously.\nIdeal candidates would be comfortable digging into the depths of SQLAlchemy or Twisted (via pdb and/or the source)\nif Google or IRC don't produce quick results. Specific libraries or skillsets aren't required (trust me,  \nI'll be interviewing you), but you need to be able to learn efficiently. You'll be working with a small dev \nteam and asked to learn the full stack. We're building the next generation of OpinionLab products, starting \nwith a new data processing architecture, so you'll have an opportunity to shape the company.<p>Everyone likes lists of buzzwords, so we are some things we use: django, tastypie, sentry, rabbitmq, salt, twisted, pypy, ruby, rails, gunicorn, nginx, sqlalchemy, mysql, postgresql, mongodb, redis, autonomy idol, virtualenv, supervisord, github, campfire, linux<p>Our work environment is very casual. You spec your own working environment (some like OSX, some like Linux,\na small minority even do daily work in Windows) so that you are most comfortable (I'm a tmux+vim fanboy).\nYou might find a dog or five in the office on any given day. We provide great benefits (see the linked \nofficial job spec[1] for details).<p>If you have any questions, I'm @emidln on twitter, emidln on skype. and badams@opinionlab.com via email.<p>Send resumes (preferrably with a link to bitbucket, github, or something else publicially visible) to \ncareers@opinionlab.com<p>[0] - <a href=\"http://www.opinionlab.com\" rel=\"nofollow\">http://www.opinionlab.com</a><p>[1] - <a href=\"http://www.opinionlab.com/company/careers/sr-software-engineer-python/\" rel=\"nofollow\">http://www.opinionlab.com/company/careers/sr-software-engine...</a>","time":1335891166,"type":"comment"},{"by":"mb22","id":3914499,"parent":3913997,"text":"Inflection - Redwood Shores, CA\nWe're the little startup that could and you've probably never heard of.<p>We just sold a small part of our business for $100M to ancestry.com - <a href=\"http://www.businessweek.com/ap/2012-04/D9UC8GKO0.htm\" rel=\"nofollow\">http://www.businessweek.com/ap/2012-04/D9UC8GKO0.htm</a><p>We were named one of the hottest big data companies in the valley<p>We have managed to hire a killer leadership team including Peter Merholz - <a href=\"http://www.sfgate.com/cgi-bin/article.cgi?f=/g/a/2012/01/09/prweb9089270.DTL\" rel=\"nofollow\">http://www.sfgate.com/cgi-bin/article.cgi?f=/g/a/2012/01/09/...</a><p>We really value design and engineering - check out our beautiful website: <a href=\"http://inflection.com/careers/\" rel=\"nofollow\">http://inflection.com/careers/</a><p>We have a mixed stack that uses .net, python, erlang, solr, mongo, redis, and other goodies.<p>We're starting to build two new exciting products and we'd love to talk to you. shoot me an email mbaird@inflection.com","time":1335883038,"type":"comment"},{"by":"bwwhite","id":3914333,"parent":3913997,"text":"Mind Candy - London, UK<p><a href=\"http://www.mindcandy.com\" rel=\"nofollow\">http://www.mindcandy.com</a><p>Based in Shoreditch, Mind Candy is a major player in London's rapidly expanding Silicon Roundabout community. Our hero brand is Moshi Monsters, one of the world’s fastest-growing online games for kids (60 million sign-ups and counting), and we have several other projects in the pipeline.<p>Some technical roles we're currently hiring for:<p><pre><code>  * IT Support Engineer\n  * Mobile Developer\n  * Payments Product Manager\n  * QA Automation Engineer\n  * Scrum Master/Agile Project Manager\n  * Senior Mobile Developer\n  * Software Engineers\n  * Systems Administrator\n  * UX/Interaction Designer\n</code></pre>\nOur office in the Tea Building in Shoreditch is really great, and we have a lot of company social events which are always a blast. See <a href=\"http://mindcandy.com/recruitment\" rel=\"nofollow\">http://mindcandy.com/recruitment</a> for more details.<p>Cheers, Bryan","time":1335881101,"type":"comment"},{"by":"niravshah","id":3914872,"parent":3913997,"text":"Washington DC, New York City, Austin or remote.<p>Vox Media is a media/technology startup.  We run a consumer technology news site (<a href=\"http://theverge.com/\" rel=\"nofollow\">http://theverge.com/</a>), a video game news site (<a href=\"http://polygon.com/\" rel=\"nofollow\">http://polygon.com/</a>), and a network of over 300 sports news sites &#38; communities (<a href=\"http://sbnation.com/\" rel=\"nofollow\">http://sbnation.com/</a>).  You can read about some of the interesting challenges we run into on our product team blog: <a href=\"http://product.voxmedia.com/\" rel=\"nofollow\">http://product.voxmedia.com/</a><p>We're hiring Ruby developers and operations engineers, among other roles: <a href=\"http://jobs.voxmedia.com/\" rel=\"nofollow\">http://jobs.voxmedia.com/</a><p>Our investors include Accel Partners, Allen &#38; Company, Comcast Interactive Capital, and Khosla Ventures. We get around 35 million unique visitors every month.","time":1335886961,"type":"comment"},{"by":"bfung","id":3915447,"parent":3913997,"text":"OPOWER <a href=\"http://opower.com/\" rel=\"nofollow\">http://opower.com/</a> <a href=\"http://opowerjobs.com/\" rel=\"nofollow\">http://opowerjobs.com/</a><p>San Francisco, CA or Arlington, VA. Full Time<p>We leverage data and behavioral science to change people's energy consumption habits. Help the environment through energy conservation and help people save money.<p>Java, Rails, Hadoop, and smatterings of many other things - we have a culture where taking initiative and having a good design will result in a system being used by other people. Great perks and a chill yet super productive atmosphere.<p>I can speak about openings about software engineers (associate to lead), and product managers (<a href=\"http://jobvite.com/m?3n1Njfwe\" rel=\"nofollow\">http://jobvite.com/m?3n1Njfwe</a>).  Others openings include Office Manager, Sales, and other functions.  Take a look and contact me (benson [dot] fung [at] opower [dot] com) if you have questions.","time":1335893369,"type":"comment"},{"by":"BraintreeR","id":3915206,"parent":3913997,"text":"Chicago, IL - Braintree - FULL TIME Developers<p>Braintree helps businesses process credit card payments by providing a merchant account, payment gateway, recurring billing and credit card storage. We're unlike others in the industry; we think and do things differently.<p>Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node.js, PHP, Java, .NET, Perl, and Objective-C<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a>","time":1335890579,"type":"comment"},{"by":"arseniosantos","id":3915792,"parent":3913997,"text":"Circa, San Francisco CA, Full time.<p>Circa is re-imagining the way we'll consume news.  We're creating an experience that we feel is missing in today's world of news and building the product that, as users, we would want.<p>We want to create the best news experience by optimizing for truths, encouraging diversity, and empowering the readers.<p>We're looking for engineers to help us build our internal processing, content management, and mobile app products. If you have practical Python experience, have deployed apps to AWS, and are interested in natural language processing, we're looking for you.<p>We've just announced raising $750,000 as part of a seed financing round. Some of our angel investors include Quotidian Ventures, Scott Belsky (Behance), Soraya Darabi (Foodspotting/NYT), and David Karp (Tumblr).<p>More information on us and the position can be found here: <a href=\"http://jobsco.re/JAn0Om\" rel=\"nofollow\">http://jobsco.re/JAn0Om</a>","time":1335897520,"type":"comment"},{"by":"bkrett","id":3914311,"parent":3913997,"text":"Classified Ventures (Chicago, Santa Monica) (no REMOTE) - The parent company of Cars.com, Apartments.com and HomeFinder.com<p>Classified Ventures was founded in 1997.<p>Our websites power the automotive, rental and real estate channels of 150+ online media partners nationwide.<p>Classified Ventures has over 111,000 customers across all product types nationwide<p>The average visitor spends 10.4 minutes on a CV operated website.<p>CV’s employee base has grown by over 350% in the last six years!<p>Classified Ventures is owned by five leading media companies: A.H. Belo Corp., Gannett Co. Inc., Tribune Company, The McClatchy Company and The Washington Post Company.<p>We are looking for people to fill a myriad of different roles, from Admin Assistant to Sales to Engineers!<p>The list of postings can be found here: <a href=\"https://classifiedventures.silkroad.com/epostings/index.cfm?version=1&#38;company_id=15937\" rel=\"nofollow\">https://classifiedventures.silkroad.com/epostings/index.cfm?...</a>","time":1335880747,"type":"comment"},{"by":"BMarkmann","id":3914329,"kids":[3914452],"parent":3913997,"text":"Counterpoint Consulting - Vienna, VA (Washington DC area)<p>Associate Consultant<p>About us:<p>* Founded in 2006, self-funded and always profitable<p>* Laid-back, collegial workplace<p>* Dedicated to making business applications suck a little less<p>About you:<p>* You have a passion for creating software to solve complex business problems<p>* You have strong communication skills, and are able to work hand-in-hand with business people to translate business requirements into cutting-edge web applications<p>Check out our current listing(s) at:<p><a href=\"http://www.c20g.com/site/join\" rel=\"nofollow\">http://www.c20g.com/site/join</a><p>We'd love to get some HN folks on the team!","time":1335881040,"type":"comment"},{"by":"rdoherty","id":3915094,"parent":3913997,"text":"Mountain View, CA or remote SmugMug is hiring!<p>We're looking for QA, iOS developers, web developers (frontend and backend) and designers.<p>We created Camera Awesome, a top iTunes Store app, and are the leading photo website for pros who shoot everything from BMX to brides. We're proudly profitable, free and clear of VC investors.<p>Our core technologies are PHP, MySQL, Memcache, Go, EC2, S3 and YUI. We're also doing a lot of new work with iOS on Camera Awesome.<p>We have our own personal chef, awesome (private!) offices with at $500 decoration budget when you start, just about any hardware you desire and yearly company trips (<a href=\"http://cmac.smugmug.com/Photography/Jackson-Hole/1/18570755_...\" rel=\"nofollow\">http://cmac.smugmug.com/Photography/Jackson-Hole/1/18570755_...</a>).<p>If you're interested send your resumes to jobs@smugmug.com<p><a href=\"http://www.smugmug.com/jobs/\" rel=\"nofollow\">http://www.smugmug.com/jobs/</a>","time":1335889418,"type":"comment"},{"by":"brianmwang","id":3914359,"parent":3913997,"text":"Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>) - New York, NY (Full Time/Intern, no remote, no H1B)<p>Web Developer (<a href=\"http://fitocracy.com/jobs/\" rel=\"nofollow\">http://fitocracy.com/jobs/</a>)<p><i>About Us</i><p>Fitocracy is a fitness social network powered by game mechanics to make exercise a more addictive, accessible experience for all. Hundreds of thousands of people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We turn life into the ultimate RPG where you are the hero that levels up, beats quests, and finds the best version of yourself.<p>Our mission is to turn fitness into a more fun, addictive, and accessible experience for everyone. We aim to provide the motivation, information, and community necessary to \"re-wire\" people's brains so they make sustainable, impactful changes in their lives.<p>We are a small, 5-person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups and Eniac Ventures. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p><i>Our Stack</i><p>Django, Ubuntu Linux, MySQL, nginx, AWS, redis, git, Celery, and Javascript. Expect to use/learn these all.<p><i>Who We're Looking For</i><p>- Experience with Python and Django\n- You can traverse across the web development stack and you're quick to pick up new technologies\n- You are obsessed with delivering a great user experience\n- You work well with small, tight-knit teams and communicate well<p><i>Bonus Points</i><p>- Sysadmin experience a huge plus\n- Interest in health &#38; fitness a huge plus<p><i>Contact</i><p>Email me at brian@fitocracy.com","time":1335881471,"type":"comment"},{"by":"zds","id":3915044,"parent":3913997,"text":"Codecademy (<a href=\"http://codecademy.com\" rel=\"nofollow\">http://codecademy.com</a>) - New York, NY<p>Product Designer, Frontend Engineer, Backend Engineer, Recruiting Engineer<p>Codecademy is the easiest way to learn to code.  Since August 2011, more than 1 million people have started learning the basics of JavaScript, HTML, and CSS with our interactive online tutorials.  We're passionate about extending education opportunities to everyone across the world.  We've partnered with The White House to teach kids to code and we're now building solutions for other programming languages and other learning methods.  We're a small team but we're well funded (raised $2.5m from Y Combinator, Union Square Ventures, etc.) and have been covered extensively in the press (CNN, NYT, WSJ, etc.)<p>Come join us - codecademy.com/jobs or jobs (at) codecademy (dot) com.","time":1335888894,"type":"comment"},{"by":"streeter","id":3914579,"parent":3913997,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Educreations is the easiest way for teachers to teach online. We're growing fast, and have a crazy awesome iPad app that hit the #1 spot after 4 days in the app store. We're unabashidly inspired by the Khan Academy but want to enable all teachers to teach like Sal Khan. We were part of the first cohort of Imagine K12 and are looking to grow the team rapidly.<p>We are looking to make our first hires. If you want to change the world and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p>Email jobs@educreations.com<p>We are looking for:<p><pre><code>    Lead Software Engineer (Python)\n    Lead Mobile Engineer (Objective C/Cocoa)\n    Lead UX/UI Designer</code></pre>","time":1335883974,"type":"comment"},{"by":"rsingel","id":3916129,"parent":3913997,"text":"Contextly - San Francisco - Local, Possibly Remote<p>Contextly is making online news better. We're currently in a closed beta of our related links service, a beta that includes Wired.com and other top tech blogs.<p>We're looking for a technical co-founder to build and architect (in the widest possible conception of that term) a better future for online news. Pardon the generalities, but we actually believe that stealth is underrated for startups.<p>If you are passionate about journalism and big data and want to build something that actually makes a difference, drop us a line, we'd love to talk.<p>There's many decisions yet to be made about our future stack, so being proficient at choosing the right tools in an honest manner is more important than having X years experience in Python/Ruby/MongoDB, etc.<p>E-mail ryan@contextly.com with \"HN\" in the subject line.","time":1335902329,"type":"comment"},{"by":"jroll","id":3914204,"parent":3913997,"text":"Mountain View - drchrono.com (YC W11) [full time and interns, H1B considered]<p>We're looking for more engineers and salespeople to help us revolutionize healthcare through mobile and web interfaces. Our stack includes Python/Django, iOS, and Android, but you don't need to be an expert, just ready and willing to learn fast! Our product supports thousands of doctors who depend on our systems daily to provide quality care to their patients, iPad in hand. The usual startup benefits included: competitive salary, healthcare, whatever hardware you need to be most productive.<p>Learn more at <a href=\"https://drchrono.com/jobs/\" rel=\"nofollow\">https://drchrono.com/jobs/</a><p>Apply via email: jobs@drchrono.com and/or take our hacker test at <a href=\"http://bit.ly/qbKAut\" rel=\"nofollow\">http://bit.ly/qbKAut</a>","time":1335879043,"type":"comment"},{"by":"jakemcgraw","id":3914915,"parent":3913997,"text":"New York, NY - Software Engineer (Various) - Remote possible<p>Refinery29 (Seed $500K, Series A $4.5M, high daily revenue) is looking for a few good engineers to join our rapidly growing technology team. Our company has gone from 8 employees a year ago to just over 75 today, and we're continuing to grow.<p>Our technology team is unique in that tech and product are the same team, developers often drive product design. Our number one priority in technology is hiring smart, driven men and women, giving them the tools to succeed and getting the hell out of the way.<p>If you're sick of building products you don't believe will succeed or having your job dictated to you, come join us!<p><a href=\"http://the-rig.refinery29.com/jobs\" rel=\"nofollow\">http://the-rig.refinery29.com/jobs</a><p>Ping me on Twitter @jakemcgraw if you have any questions.","time":1335887479,"type":"comment"},{"by":"jsatok","id":3914371,"kids":[3917341],"parent":3913997,"text":"Toronto, Canada - AppHero (<a href=\"http://apphero.com\" rel=\"nofollow\">http://apphero.com</a>)<p>AppHero is looking for engineers to join our team.<p>About you:<p>- Passionate about building disruptive products that solve big problems<p>- Excited by the opportunity to learn new things and question norms<p>- Self starter who enjoys thinking outside the box<p>- Entrepreneurial spirit and are interesting in taking an active role in growing AppHero<p>- Experience using Java to build applications<p>- Interested in working on the backend for web and mobile apps<p>About us:<p>- VC funded by top investors from Toronto and New York<p>- Building a product to help people discover the best apps by providing personalized recommendations<p>- Small team with diverse experience<p>- Work from a bright, modern, open concept office at Yonge and Eglinton in Toronto<p>Feel free to reach out if you're interested: jordan (at) apphero (dot) com<p>More info: <a href=\"http://apphero.com/careers\" rel=\"nofollow\">http://apphero.com/careers</a>","time":1335881546,"type":"comment"},{"by":"sahillavingia","id":3915430,"parent":3913997,"text":"San Francisco, CA (SOMA) - <a href=\"http://gumroad.com\" rel=\"nofollow\">http://gumroad.com</a><p>We are building a simple, beautiful, and useful product that enables new forms of commerce for millions of people around the world.<p>We are a tiny team, and offer each employee meaningful equity in a product and vision they believe in.<p>If you are interested, please check out: <a href=\"https://gumroad.com/about/jobs\" rel=\"nofollow\">https://gumroad.com/about/jobs</a>","time":1335893212,"type":"comment"},{"by":"defrex","id":3914585,"parent":3913997,"text":"Toronto, Canada (King St. W.) - Django Developer - <a href=\"http://shopcastr.com\" rel=\"nofollow\">http://shopcastr.com</a><p>Shopcastr is a social marketplace for independent retailers and local shoppers. We’re backed by Mantella Venture Partners and are seeing great early traction. We have a solid team so far and need someone to help make up the foundation of the company as we grow.<p>We’re looking for a developer with some Python and Django chops who isn’t afraid to pick up new skills when needed (we use CoffeeScript and SASS, for example). We’re looking for someone self-taught, though we won’t hold it against you if you’ve also been to school.<p>Email us at jobs@shopcastr.com with whatever you think we need to see before following up with you.","time":1335884097,"type":"comment"},{"by":"axiom","id":3915580,"parent":3913997,"text":"Toronto, Ontario<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>) is hiring for a few roles: designer, sysadmin/infrastructure developer, general web developer. We also hire interns so please feel free to apply for that as well (paid of course.)<p>We're a profitable education startup that helps make class more engaging. We've got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>Our dev team is in Toronto but we've also got an office in San Francisco so if you're really good we would be open to having someone work from there.<p>Send your resume/github account to mike at tophatmonocle dot com.","time":1335894913,"type":"comment"},{"by":"antgoldbloom","id":3914661,"parent":3913997,"text":"Kaggle - San Francisco and REMOTE We're looking for:<p>* Developers (REMOTE)<p>* Data scientists<p>* Business Development<p>Kaggle is a platform for data science competitions, that is changing the way data science is done. We've already solved problems for NASA, Wikipedia, Ford and Allstate (see some of the problems we've solved here:   <a href=\"http://www.abc.net.au/catalyst/stories/3296837.htm\" rel=\"nofollow\">http://www.abc.net.au/catalyst/stories/3296837.htm</a>).<p>We're currently a team of 14, and we're looking for the outstanding developers, data scientists and business folk who will form the core team.<p>More information at <a href=\"http://www.kaggle.com/careers\" rel=\"nofollow\">http://www.kaggle.com/careers</a>","time":1335884956,"type":"comment"},{"by":"jack7890","id":3914209,"parent":3913997,"text":"New York, NY -- Web Engineer -- Fulltime -- SeatGeek<p>SeatGeek is the web's largest search engine for live event tickets. Think \"Kayak for sports/music/theater tickets.\"<p>Our dev team is currently seven people. We're looking to add one or two more. We're specialization-agnostic. Most of our current guys are pretty full stack, so wherever in the web stack you like to spend your time, we can find a place for you.<p>We're using lots of Python these days. A bit of Ruby and PHP too. And always plenty of JS, supported by backbone. Mongo and MySQL for data.<p>More details here: <a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1335879179,"type":"comment"},{"by":"cetani","id":3914264,"parent":3913997,"text":"Cetani  - Carmel, IN (near Indianapolis)<p>www.cetani.com/jobs<p>looking for: Ruby on Rails or C#<p>Cetani provides indoor location tracking software for different industries, but mostly in healthcare.  We use third-party hardware for Real-Time Location Systems (RTLS) and have a software platform to manage and use RTLS information.<p>We're looking for C# (backend/driver) and Ruby on Rails developers.  We're a small but growing company, and are established in the location tracking market.<p>We were founded in 2003 by two developers, so we care about development and technology.  For more information, look online at: www.cetani.com/jobs, or contact me via email (address in profile).","time":1335880082,"type":"comment"},{"by":"esigler","id":3914557,"parent":3913997,"text":"San Francisco, CA - Minted<p>Frontend &#38; backend developers needed!<p>Minted is a social commerce site, crowd-sourcing graphic designs and art from around the world.  Behind the scenes, we're running Python and PHP, on MySQL running in EC2 and Rackspace environments.<p>We provide competitive compensation, generous benefits, and a brightly lit office environment that's 5 minutes walking distance from the Ferry Building in downtown San Francisco.  We're backed by Benchmark Capital &#38; IDG Ventures, among others.<p>See <a href=\"http://www.minted.com/jobs\" rel=\"nofollow\">http://www.minted.com/jobs</a> for more, or send me an email at eric@minted.com","time":1335883629,"type":"comment"},{"by":"andrewvc","id":3914803,"parent":3913997,"text":"Santa Monica, CA<p>Pose.com is a fast growing social network for style and fashion. We're looking for talented Ruby / Rails, Backbone.js, iOS, and Android developers.<p>Our team is fun and small. We're 6 talented hackers and are looking to add a couple more. We're well funded, and emphasize keeping a good work-life balance (read: no crunches, regular hours).<p>Additionally, we're looking to add a front-end developer. We're heavy users of backbone.js and CSS 3, so if these technologies pique your interest, let us know.<p>We're scaling fast, and if you'd like to join us for the ride, send your CV and github acct. (if you have one) to andrew@pose.com","time":1335886209,"type":"comment"},{"by":"dawson","id":3914164,"parent":3913997,"text":"How are you? - <a href=\"http://www.howareyou.com\" rel=\"nofollow\">http://www.howareyou.com</a><p>I'm looking for full-time/contract 6 month + iOS Objective-C developers (iPad), can work remote from anywhere. Would also love to find a full-time UX/UI designer, will put something up on dribbble this afternoon, contact details in profile.","time":1335878532,"type":"comment"},{"by":"volkadav","id":3915009,"parent":3913997,"text":"OmniTI (omniti.com) - offices in Manhattan and Columbia, MD (remote ok for the right candidates)<p>We're a consultancy focusing on high scale web app design, ops support and the like, focusing on open source tools. We're growing and are hiring for a wide range of roles right now to try to keep up with client demand: front and back end dev roles, DBAs, PMs, and systems people.  Full role descriptions are here: <a href=\"http://omniti.com/is/hiring\" rel=\"nofollow\">http://omniti.com/is/hiring</a><p>careers@ if you want to submit a resume or you can reach me directly if you have questions at mjackson@","time":1335888562,"type":"comment"},{"by":"jgilliam","id":3914533,"parent":3913997,"text":"Los Angeles, CA<p>NationBuilder is hiring developers and organizers. We build tools for leaders, mostly focused on politics right now. We're backed by Andreessen Horowitz, Sean Parker, and many others.<p>Developer jobs: <a href=\"http://dev.nationbuilder.com/jobs\" rel=\"nofollow\">http://dev.nationbuilder.com/jobs</a>\nOrganizer jobs: <a href=\"http://nationbuilder.com/organizer\" rel=\"nofollow\">http://nationbuilder.com/organizer</a><p>Our stack is Ruby/Rails/Postgres/Redis/Mongo, details here: <a href=\"http://dev.nationbuilder.com/about\" rel=\"nofollow\">http://dev.nationbuilder.com/about</a>","time":1335883446,"type":"comment"},{"by":"bendilts","id":3916108,"parent":3913997,"text":"Salt Lake City, UT. - <a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http://www.lucidchart.com</a><p>LucidChart is an HTML5 diagramming application that proves web apps don't need to be pale imitations of their full-featured desktop counterparts. Real-time collaboration and full versioning history aren't our only advantages; users tell us they like LucidChart because it's faster, easier, and smoother than Visio and Omnigraffle.<p>We need great engineers who want to work in a Silicon Valley startup, but would rather live 15 minutes from the ski resorts in Utah. We have one of the largest Javascript codebases on the Internet supporting LucidChart's client, and are using Scala, PHP, node.js, MongoDB, and MySQL to power our servers. Experience in one or more of these areas is helpful, but we're most interested in people with inhuman problem solving skills.<p>We currently have 14 full-time employees, including 8 engineers. That ratio reflects the focus of our organization -- we are a software company, and we live or die on the strength of our engineering team. We think we have the strongest engineering team in Utah, and want to add at least 3-5 people this year.<p>All hires are made by unanimous decision of the current team. If you join us, you can know that everyone here wants you here.<p>Send resumes, github profiles, or whatever else might be relevant to jobs at lucidchart dot com.","time":1335902030,"type":"comment"},{"by":"aturnbull","id":3921528,"parent":3913997,"text":"Three Ring (New York, NY)<p>We're an early stage education technology startup looking to grow our team of developers. We provide a simple, easy way for teachers to create digital portfolios of student work using their smartphone.<p>Our current backend is Rails/Postgres on Heroku and our frontend is built using HAML/SASS/JS. We use HTML5 + JS + Phonegap (Cordova) for our iOS and Android apps.<p>We're looking for:<p>Rails Developers - you're a knowledgable, fast learner excited to build a meaningful product. We push code daily and develop priorities based on teacher feedback. There's still a lot to do, and you'll have the opportunity to build out and take charge of significant features.<p>Front-end Developers - you're familiar working in a Rails environment and love getting things perfect. You want to build out a product for teachers that's not just well made, but a joy to use. You like standards and graceful degradation for our friends with IE (but not 6!)<p>Javascript Developers - we're starting on a robust, backbone.js based frontend for the website and have built our app out almost entirely in Javascript. Love making quality web apps? Shoot us an email.<p>Interested in education? Email me: alec [at] threering.com<p><a href=\"http://www.threering.com/careers\" rel=\"nofollow\">http://www.threering.com/careers</a>\n<a href=\"http://mashable.com/2012/04/24/three-ring/\" rel=\"nofollow\">http://mashable.com/2012/04/24/three-ring/</a>","time":1335997928,"type":"comment"},{"by":"cperea","id":3915806,"parent":3913997,"text":"Austin, TX with RGM Advisors, LLC\nFull Time Job Opportunity\nH1B Sponsorship is a possibility\nPosition: Quantitative Researcher\nIndustry: Financial/Proprietary Trading<p>RGM Advisors, LLC is a proprietary trading firm headquartered in Austin, Texas that applies scientific methods and computing power to trading in multiple asset classes around the world.<p>Responsibilities:\nWe are currently seeking Quantitative Researchers at various levels who are capable of working within our proprietary computational research and modeling environment to develop automated trading strategies using machine learning, statistical analysis and other quantitative techniques. Successful candidates have the opportunity to solve complex and intellectually challenging problems including research and development into improved modeling techniques; design of improved tools and processes for conducting research and building trading models; and development and implementation of quantitative trading models for financial instruments traded in various markets.<p>Qualifications:\nExcellent analytical skills\nAcademic background in engineering, computer science, physics, math, statistics or another quantitative discipline\nFamiliarity with machine learning algorithms, statistical analysis and/or quantitative analytical techniques\nFamiliarity with UNIX and C++<p>To apply for this position and to see a full list of open positions at RGM Advisors, please visit our career portal: <a href=\"https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;searchLocation=&#38;searchCategory=\" rel=\"nofollow\">https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;sear...</a>","time":1335897737,"type":"comment"},{"by":"dabent","id":3915611,"parent":3913997,"text":"Los Angeles Area (Santa Monica, CA)<p>TrueCar is changing the way people buy and sell cars.  We are well funded, earning revenue and growing.  Most of our coding is in Python, Java and Javascript.<p>We have several openings right now.  I'll change things up from previous posts and keep them brief.  If it sounds like it might be a fit, shoot me an email (address is in my profile)<p>* Senior Designer and Designer (Photoshop/UX)<p>* Java Architect (hands-on experienced Java geniuses)<p>* Senior Linux System Engineer (If you are one, you know it)<p>* Senior SQL Database Automation Engineer (Microsoft SQL Server)<p>* Statistician (strong SAS programming skills including PROC SQL are needed)<p>* Data Warehouse Developer (ETL/Data Modeling on MS SQL Server 2005/2008)<p>* Data Analyst (SAS/SQL - Looking for an MS in  Statistics, Econometrics, Operations Research, Data Mining, or Math)<p>* BI SQL Analyst (OK, so I had to look up that one: Work with internal stakeholders to understand business objectives and identify useful data sources and analyses in order to reliably and accurately answers to important questions.  Provide ad hoc analyses and reports for internal customers, especially C-level and PR requests.  3-5 years of workplace analytics experience.)<p>I started here at TrueCar in the fall developing code primarily in Python and absolutely love it.  Come join me by the beach: <a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>","time":1335895229,"type":"comment"},{"by":"bhonohan","id":3915065,"kids":[3928100],"parent":3913997,"text":"New York, NY - 3 Developers, IT, Project Mgr - FULLTIME<p>charity: water is a 5 year old non-profit organization bringing clean, safe drinking water to people in developing countries. 100% of all public donations directly fund water projects.<p>We raise 70% of our donations online, and tie every dollar donated to mycharitywater.org to the project it funds. \nExample: <a href=\"http://mycharitywater.org/p/myprojectsview?project_id=ET.GOH.Q4.09.048.132\" rel=\"nofollow\">http://mycharitywater.org/p/myprojectsview?project_id=ET.GOH...</a><p>// Front-end Dev \n- Looking for someone skilled in HTML5/CSS3/jQuery/Responsive design, to work on our websites, Email Campaigns, data visualizations and admin consoles.<p>// 2 Software Engineers\n- Our platforms are built on a mix of PHP, Python, Java; Systems integration is key here. Data analysis and visualization skills are welcomed.<p>// IT SysAdmin \n- Mix of Helpdesk, Server Admin, internal IT Systems management; Knowledge of AWS/nginx and monitoring services.<p>// Software Project Manager\n- Manage resources, schedules; Should be familiar with Agile methodology; code sprints/scrums<p>Full Descriptions:\n<a href=\"http://www.charitywater.org/about/jobs.php\" rel=\"nofollow\">http://www.charitywater.org/about/jobs.php</a><p>To Apply:\n<a href=\"http://www.charitywater.org/forms/hr/job_application/\" rel=\"nofollow\">http://www.charitywater.org/forms/hr/job_application/</a>","time":1335889098,"type":"comment"},{"by":"midas","id":3915001,"parent":3913997,"text":"Priceonomics (YC W12) - San Francisco<p>Front-End Engineer - Full Time<p>Priceonomics is the price guide for everything. We're a team of three who are passionate about reinventing how people search, discover, and purchase products.<p>We're based in the heart of San Francisco, on the edge of SoMa/Mission. We have great investors like Y Combinator, Andreessen Horowitz, Ron Conway (SV Angel), Crunch Fund and many more.<p>Details (and a fun puzzle!) here:\n<a href=\"http://priceonomics.com/jobs/\" rel=\"nofollow\">http://priceonomics.com/jobs/</a>","time":1335888489,"type":"comment"},{"by":"bartonfink","id":3914114,"parent":3913997,"text":"Mapquest Vibe - <a href=\"http://mqvibe.mapquest.com\" rel=\"nofollow\">http://mqvibe.mapquest.com</a><p>Denver, CO - Fulltime.<p>Mapquest is hiring engineers to work on a new product, Mapquest Vibe. Vibe was just released at SxSW and we have a lot of work to do before we can strip the \"beta\" label off. If Mapquest answers the question \"How do I get from A to B\", Vibe answers the question \"Where do I want to go?\" Using Vibe, you can see at a glance where the best businesses are in any neighborhood - our goal is that it will help users feel like a \"local\" wherever they wind up.<p>You'll have a lot of autonomy in terms of how you implement features as well as input into the product direction itself. Projects I've implemented are a semantic tagging system to help categorize businesses, a dynamic geographic buffer to allow for fuzzy location searching, and I'm currently implementing a new API intended for public consumption. It's a very empowering culture and a great place to work.<p>We're hiring across the board. Front-end folks use backbone.js, jQuery and a few mapping-specific toolkits to do various things. Back-end folks use a mixture of Java (running on Play!) and Groovy talking to a Postgres DB. Right now we're doing mobile development for the iPhone, with an Android app on the horizon. Experience matters less than ability - we'd be just as happy interviewing a grad right out of school as we would be interviewing a grizzled vet with 40 years experience. Skills I would particularly like to see added to the team are knowledge of Hadoop and Lucene, but that's my own personal wish-list.<p>If you're interested, shoot me an e-mail (it's in my profile).","time":1335877733,"type":"comment"},{"by":"kstenerud","id":3915014,"parent":3913997,"text":"San Francisco, CA\n(INTERN, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>We build fun games for brains in San Francisco. We're a small &#38; talented team. We hate boring. Our investors are awesome. If you are nice and want to help us make splendid products, we'd love to hear from you.<p>We're hiring in lots of areas! Here are a few:<p>* Backend engineer: So much data, so little time! If you can manage the chaos and make them thar machines answer questions like \"What do they like about our stuff?\" and \"What don't they like?\" and \"Is they learnin' themselves good?\", we want to hear from you!<p>* Frontend engineer: Our users want to see how they're doing. They want interactivity that goes beyond their mobile devices. You've got the magic touch to make that happen. Let's talk!<p>* Mobile engineer: You build pocket-sized awesomeness on iOS and/or Android. We make games that teach people stuff. The perfect combination! Even if you're not a game dev, there's plenty of app-y stuff to do!<p>* UI designer: Engineers make things go vroom, but without a stunning design it's pointless. If you live to make jaw-dropping UI experiences (web and/or mobile), this is the place to be!<p>Email us at jobs@mindsnacks.com<p>More details: <a href=\"http://www.mindsnacks.com/careers/\" rel=\"nofollow\">http://www.mindsnacks.com/careers/</a>","time":1335888623,"type":"comment"},{"by":"tpimental","id":3914197,"parent":3913997,"text":"Care.com - <a href=\"http://www.care.com/\" rel=\"nofollow\">http://www.care.com/</a><p>Waltham, MA<p>Founded in 2006, Care.com is the largest and fastest growing service of its kind in the United States and has been used by hundreds of thousands of American families to find and connect with caregivers. In 2012, Care.com began to expand its service internationally.<p>Several open positions including:<p>- Product Manager<p>- Software Engineer<p>- Web UI Engineer<p>More info here: <a href=\"http://www.care.com/careers-p1089.html\" rel=\"nofollow\">http://www.care.com/careers-p1089.html</a>","time":1335878973,"type":"comment"},{"by":"afletcher","id":3914694,"parent":3913997,"text":"Mediatonic - <a href=\"http://mediatonic.co.uk\" rel=\"nofollow\">http://mediatonic.co.uk</a><p>London, UK - Fulltime<p>Mediatonic is an award winning independent games developer based in Soho, London. We work across a range of different digital platforms (HTML5, Flash, iPhone, console) building connected experiences for clients such as Disney, Cartoon Network, SEGA, Sony, Nintendo, EA, Pixar and Warner Brothers.<p>We're currently hiring for the following positions:<p><pre><code>  * Artist (2D)\n  * Associate Producer\n  * Game Designer\n  * Games Analyst\n  * Games Writer / Creative Producer\n  * HTML5  Developer\n  * Junior Administrator\n  * PHP Developer\n  * QA Engineer (Embedded)\n  * SmartPhone Developer\n  * UI Designer\n</code></pre>\nAbout us:<p>Mediatonic is focused on becoming one of the best digital game developers in the world.  We hire experts in every field related to games and like to take on the biggest technical challenges and projects we can get our hands on.<p>Our working environment and culture is hugely important to us at Mediatonic. Our office is based in Soho London, we have a relaxed, open working environment and run a number of social events and activities during and outside of work time.<p>See <a href=\"http://mediatonic.co.uk/\" rel=\"nofollow\">http://mediatonic.co.uk/</a> for more details.","time":1335885249,"type":"comment"},{"by":"snowmaker","id":3915106,"parent":3913997,"text":"San Francisco, CA - Scribd - Looking for creative engineers with various backgrounds<p>Scribd is one of the early YCombinator companies, and we've been growing steadily.  We're now a top 100 site and one of the top 3 rails sites on the web by traffic.  But we still have a very small, tight-knit team where each person plays a critical role.<p>Scribd alumni have gone on to found four other YCombinator companies, more than from any other startup.  We think this says something about the kind of people that we like to hire.<p>Technology-wise, we mostly work with Rails, Javascript, and iOS.  We also have a lot of challenges related to machine learning, text mining, and scaling large web infrastructure.  We're looking for generalists with an interest in one or more of those areas.  See <a href=\"http://www.scribd.com/jobs\" rel=\"nofollow\">http://www.scribd.com/jobs</a> for lots more detail on the stuff we've built, a lot of which we've open sourced.<p>We're in downtown SF but we've hired a team of the best people we could find from around the world.  Relocation and H1B / J1 visas are no problem.<p>We've gotten some tremendously talented people from these \"Who's hiring posts\" before.  If you're interested, please get in touch with me directly - jared  at scribd.com.","time":1335889573,"type":"comment"},{"by":"Sighduck","id":3914244,"parent":3913997,"text":"GGeez - New York, NY - Technical Co-Founder<p>Hi there! GGeez.com is building an awesome project for the video game community based on challenges. I am seeking a knowledgable person who will be able to work with me and create something that people will absolutely love to use.  You must LOVE video games and have a passion for creating a community.<p>Please check out <a href=\"http://www.ggeez.com/hiring.html\" rel=\"nofollow\">http://www.ggeez.com/hiring.html</a> for more info","time":1335879724,"type":"comment"},{"by":"jnelson","id":3916436,"parent":3913997,"text":"PhotoShelter - New York, NY (Full-time)<p>PhotoShelter provides tools to help photographers display, market, sell, and distribute their photos. We're a small company with a laid-back atmosphere (we love dogs and barbecue) located right on Union Square, in the heart of the city.<p>We are looking for both back-end and front-end engineers to help grow our product. We value folks who are passionate about and take pride in their craft, more than buzzword compliance. Our stack includes css, html5, javascript (with a homegrown MVC framework) on the front-end, and PHP, some C, PostgreSQL, Sphinx and Memcached on the back-end. While specific experience with any of those is a plus, we want engineers who write quality code and design clean solutions.<p>Our diverse staff includes veteran engineers from HotJobs and Yahoo, one of Computerworld's 40 Under 40 tech innovators, and even a well-known concert photographer. We offer competitive salaries, stock options, bonuses, great benefits, and try to grab dinner together (on the company!) every few weeks.\nIf you're interested, shoot an e-mail to devjobs@photoshelter.com. Thanks!<p><a href=\"http://www.photoshelter.com/about/index/jobs\" rel=\"nofollow\">http://www.photoshelter.com/about/index/jobs</a>","time":1335907474,"type":"comment"},{"by":"Hovertruck","id":3914404,"parent":3913997,"text":"Chartbeat is hiring in NYC (Meatpacking District). H1B possible.<p>We're a real-time analytics platform focused on providing data to the people on the front line (people who can take immediate action), rather than the analysts in the back office. Our stack is Python (django/tornado), C, MongoDB, and Google Closure for our JavaScript needs. Hiring engineers and designers of all sorts. :)<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1335881925,"type":"comment"},{"by":"pdavison","id":3915201,"parent":3913997,"text":"Highlight - San Francisco / Full-time / Engineering + Design / H1B<p>Highlight (<a href=\"http://highlig.ht\" rel=\"nofollow\">http://highlig.ht</a>) is looking for extraordinary engineers and designers to join our core team.<p>Our product is a mobile app that helps you see more information about the people around you. It is just now becoming possible thanks to recent advances in mobile technology and the product is incredibly rewarding to work on. Our days are full of interesting challenges around UI/UX, engineering, and machine learning. Our goal is to give you a sixth sense about the world around you, showing you things that you’ve never been able to see before. It’s difficult and ambitious, which is what makes it fun.<p>We launched in January and the response has been very exciting. We recently closed a round of funding from Benchmark Capital, SV Angel, Crunchfund, and a great group of angel investors.<p>We want to make Highlight an amazing place to work, with a creative, open culture that deeply values both engineering and design.  If you are excited about what we are doing we would love to hear from you.<p>You can reach us at jobs@highlig.ht.<p>For more details, please see <a href=\"http://highlig.ht/jobs.html\" rel=\"nofollow\">http://highlig.ht/jobs.html</a>.","time":1335890551,"type":"comment"},{"by":"davidblondeau","id":3914685,"parent":3913997,"text":"Burligame, CA - Collaborative Drug Discovery (CDD) (<a href=\"https://www.collaborativedrug.com\" rel=\"nofollow\">https://www.collaborativedrug.com</a>)<p>CDD is growing and financially stable. Our software helps scientists manage, analyze and collaborate around their drug discovery data (chemistry and biology). We are are in a great position to support the evolution towards more collaboration, specialization and distribution in a market that has been historically closed and secretive. The model has been successful with academic labs, small biotech startups and very large collaborations (like the Gates foundation TB initiative or MM4TB in Europe). We are now gaining some traction with government agencies and the big pharmaceuticals.<p>I am hiring a full-stack software developer (<a href=\"https://www.collaborativedrug.com/pages/employment#h-1\" rel=\"nofollow\">https://www.collaborativedrug.com/pages/employment#h-1</a>). As one of three developers, you need to be comfortable working or interested in building expertise at every level of the stack. Experience or interest in system administration and operations is nice to have though not required. We have many projects involving web development, data visualization, data processing, scaling, security, privacy and other software challenges to make our scientific application collaborative, engaging and rewarding.<p>It is perfectly OK if you do not have experience with any of the languages or technologies we currently use (Rails/Ruby/JS/MySQL/Solr...) as long as you can learn those quickly.\nCDD is a great place if you want to have a lot of impact and like to take on projects and responsibilities.<p>If you are interested, contact work@collaborativedrug.com, you will get an answer from one of the developers.","time":1335885148,"type":"comment"},{"by":"yesimahuman","id":3915547,"parent":3913997,"text":"INTERN (Madison, WI or remote) - <a href=\"http://codiqa.com\" rel=\"nofollow\">http://codiqa.com</a><p>We are building the best development tools for HTML5 mobile apps. 30k users since launch in late Feb, paying customers, active in jQuery Mobile community. We have a complex drag-and-drop tool built with Javascript and backbone.js. Backend built on Python+Django.<p>Interested? Send an email with a link to something you've made to max@codiqa.com","time":1335894557,"type":"comment"},{"by":"jaredrhine","id":3914852,"parent":3913997,"text":"Xtranormal, <a href=\"http://www.xtranormal.com/jobs/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/</a><p>San Francisco near Montgomery BART<p>Xtranormal lets anyone create and share animated and 3D movies using using web, mobile, and desktop apps. We’re growing and have great engineering positions available:<p>* Senior front-end: 4+ years experience, JavaScript apps, HTML5/CSS3/jQuery/LESS/MVC<p>* Operations: 5+ years, Linux, devops, open source, EC2+colo, on-call<p>* Mobile: 2+ years, iOS, HTML5/PhoneGap, JavaScript<p>* Full-stack: 3+ years, Python/Django, REST, SQL, HTML/JavaScript<p>* Front-end: 2+ years, HTML/CSS/JavaScript<p>* QA: 2+ years, web or mobile testing<p>You’ve definitely seen videos made using our technology. Here’s a Python rap video a customer made last year which speaks to the Hacker News crowd (some impolite language is included):<p><a href=\"http://youtu.be/FJ7QsEytQq4\" rel=\"nofollow\">http://youtu.be/FJ7QsEytQq4</a><p>Come help us build new ways for people to build awesome animated videos!<p>Competitive compensation and benefits. To apply for any of these positions or for more information, please email jobs@xtranormal.com and you'll get straight to the hiring manager. Postings are available at <a href=\"http://www.xtranormal.com/jobs/\" rel=\"nofollow\">http://www.xtranormal.com/jobs/</a>","time":1335886726,"type":"comment"},{"by":"coolaj86","id":3915428,"parent":3913997,"text":"SpotterRF - Orem, UT (near Salt Lake City) - Intern, Full-time<p>Our core product and primary focus is the world's first Compact Tracking Radar (not the large spinning blip-blip kind), affectionately known as \"The Spotter\". It's the size of a small lunch box and tracks in real-time, which we primary sell in military / gov't markets.<p>The success of and need for our product has put us in the unique but challenging position to bring government and military customers into the 21st century of technology, design, and usability (and that <i>is</i> a challenge). For example, we use an HTML5 interface for our tracking system and it only works in real browsers (not MSIE).<p>If you love technology, want to work in a friendly environment, and have a budding (or deep) interest in a mix of the areas below, or you just have a good feeling about it, please get in touch with me (ajoneal at spotterrf . com).<p>We're looking for skill but, more importantly, potential.<p>Embedded Developer\n* Linux, Arduino\n* Raspberry Pi\n* C\n* Soldering<p>Web Designer\n* Adobe Suite\n* CSS3\n* HTML5<p>Application Developer\n* Application language (i.e. NodeJS, Ruby, Python)\n* Systems language (i.e Golang, D, C)\n* Problem solving skills<p>Algorithm Developer\n* Radar, Sonar, etc\n* Game Design\n* Artificial Intelligence\n* Machine learning\n* R, MatLab<p>Here are some projects that have sprung out of github.com/SpotterRF (both on and off the clock):<p>* Foobar3000 - The worlds most advanced (and convenient) echo server\n* Dropshare - Simple file-sharing that gets past (government) e-mail filters\n* Mildoc - Pretty documentation for the rest of us\n* Tolmey - GPS Geotranslation in JavaScript\n* Appr - Application Distribution (think App Store)","time":1335893191,"type":"comment"},{"by":"SeoxyS","id":3915346,"parent":3913997,"text":"Chartboost - <a href=\"http://chartboost.com\" rel=\"nofollow\">http://chartboost.com</a><p>San Francisco. Relocation. 14 people company.<p>We're a young but growing advertising and cross-promotion network for mobile games. We help game developers utilize their user base to promote new titles, and make money. We're funded and profitable.<p>We're hiring across the entire spectrum of developers and designers. We're looking for smart and motivated people who know how to get shit done, but are also always interested in learning new things.<p>Stack: Objective-C / PHP / Mongo / Redis / Ruby / JS / Clojure / Storm / a little of everything else.<p>(Generalist) Software Engineer -- <a href=\"http://jobsco.re/ITMWVM\" rel=\"nofollow\">http://jobsco.re/ITMWVM</a><p>Front End Engineer -- <a href=\"http://jobsco.re/HOJdo5\" rel=\"nofollow\">http://jobsco.re/HOJdo5</a><p>Senior Backend Engineer -- <a href=\"http://jobsco.re/HOJF5v\" rel=\"nofollow\">http://jobsco.re/HOJF5v</a><p>Interaction Designe / Product Manager -- <a href=\"http://jobsco.re/ITM7MQ\" rel=\"nofollow\">http://jobsco.re/ITM7MQ</a><p>UI Designer -- <a href=\"http://jobsco.re/HOJlnj\" rel=\"nofollow\">http://jobsco.re/HOJlnj</a><p>Dev Ops -- no link yet<p>Summer Intern -- <a href=\"http://jobsco.re/HOJTJY\" rel=\"nofollow\">http://jobsco.re/HOJTJY</a>","time":1335892034,"type":"comment"},{"by":"puppetrecruiter","id":3915086,"parent":3913997,"text":"Puppet Labs (<a href=\"http://www.puppetlabs.com/jobs\" rel=\"nofollow\">http://www.puppetlabs.com/jobs</a>) - Portland, OR<p>We have grown from 20 to over 80 employees in just over a year and continue to add positions, including:<p>Operations Engineer, Support Engineer (Portland)\nProfessional Services Engineer (Portland or NYC)\nSr Sales Engineer (anywhere in US)<p>For these roles, we are looking for awesome people with strong *nix sysadmin background to join our growing Operations, Support, and Professional Services teams under our Technical Operations umbrella.<p>Puppet Labs creates IT automation software which enables system administrators to deliver the operational agility and efficiency of cloud computing at enterprise-class service levels, scaling from handfuls of nodes on-premise to tens of thousands in the cloud.  Puppet powers thousands of companies, including Twitter, Yelp, eBay, Zynga, JP Morgan Chase, Bank of America, Google, Disney, Citrix, Oracle, and Viacom.<p>Interested?  Check out the postings online at www.puppetlabs.com/jobs or connect with me on LinkedIn at www.linkedin.com/in/aimeefahey.<p>Thanks!\nAimee Fahey\nTalent Acquisition Manager\n@puppetrecruiter","time":1335889283,"type":"comment"},{"by":"typpo","id":3915419,"parent":3913997,"text":"Mountain View, CA - fulltime or intern<p>Room 77 - <a href=\"https://www.room77.com\" rel=\"nofollow\">https://www.room77.com</a><p>We're changing travel search by giving people full transparency in their search for a perfect hotel stay. Using the staggering amount of data we've collected and analyzed, we'll actually find and request the best hotel room for you. Some projects you'll work on:<p>- computer-generating views from any room in the world<p>- building the first deep-text hotel search engine (eg. search \"eiffel tower views\" in Paris or \"jetted bathtub\" in New York)<p>- super-fast search across all major providers (we show Expedia results faster than Expedia)<p>- finding better ways to extract and expose data like hotel freebies and fees<p>...and many other things that contribute to a fast, easy travel planning experience.<p>If you're interested in information retrieval, machine learning, NLP, or computer visualization, you'll have a great time solving brand new problems and creating a genuinely improved and useful hotel search.\nCheck out our jobs page: <a href=\"https://www.room77.com/jobs.html?s=HN\" rel=\"nofollow\">https://www.room77.com/jobs.html?s=HN</a>","time":1335893113,"type":"comment"},{"by":"kristjan","id":3914400,"parent":3913997,"text":"San Francisco, CA - <a href=\"http://singly.com/jobs\" rel=\"nofollow\">http://singly.com/jobs</a>: Security, Infrastructure and QA engineers, Full time, Remote OK<p>Singly is hiring all sorts of engineers (and more) to build a cross-platform, cross-service API that provides merged, normalized and deduplicated data on which apps can be built. We're well on the way to an early-June launch and have had a fantastic response to early signups. A recent $7MM in funding [1] is letting us expand the team and ramp up developer outreach. If you're not quite after a job, we'll still happily pay you at our $10k hackathon [2].<p>Apply through <a href=\"https://singly.com/jobs\" rel=\"nofollow\">https://singly.com/jobs</a> or kristjan@singly.com, or just come hang with us in #lockerproject on Freenode.<p>[1] <a href=\"http://allthingsd.com/20120423/personal-data-connector-singly-raises-7m/\" rel=\"nofollow\">http://allthingsd.com/20120423/personal-data-connector-singl...</a>\n[2] <a href=\"http://hacksingly.eventbrite.com/\" rel=\"nofollow\">http://hacksingly.eventbrite.com/</a>","time":1335881892,"type":"comment"},{"by":"arupchak","id":3915601,"parent":3913997,"text":"Los Gatos, CA - Netflix<p>My team at Netflix is looking for Site Reliability Engineers to come in and help solve our availability and reliability challenges. We have one of the largest AWS footprints out there and are constantly finding out about the limits of AWS technologies.<p>We have a unique problem that we want to figure out how to enable all of our engineering teams to deploy faster and more often, while still increasing the overall availability of the Netflix streaming service. We do this by building tools/services for engineering teams and by helping teams figure out ways to make their software more reliable.<p>Official Job Description: \n<a href=\"http://jobs.netflix.com/jobsListing.html?id=oHxbWfw5\" rel=\"nofollow\">http://jobs.netflix.com/jobsListing.html?id=oHxbWfw5</a><p>To get a sense of what engineering teams at Netflix work on:\n<a href=\"http://techblog.netflix.com/\" rel=\"nofollow\">http://techblog.netflix.com/</a>\n<a href=\"https://github.com/netflix\" rel=\"nofollow\">https://github.com/netflix</a><p>If interested, please feel free to email me directly (email in profile)","time":1335895109,"type":"comment"},{"by":"ehinter","id":3915574,"parent":3913997,"text":"Mountain View, CA. Full time.<p><a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Pattern Insight is a booming startup making code and log analysis tools for a customer base that includes many titans of the tech industry. The data mining and static analysis technologies present in our product have strong research roots, as we grew out of PhD research done at the University of Illinois at Urbana-Champaign. Relatedly, our core engineering team has a strong academic background and as a whole has published over 100+ articles in peer reviewed journals and conferences.<p>We are looking to expand our engineering team in sunny California. As stated above, we are also looking for a handful of interns. For more specific requirements, please see our career page: <a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Come join us, we are still tiny and looking for people ready and willing to make decisions that shape our future.","time":1335894862,"type":"comment"},{"by":"syncopated","id":3914530,"parent":3913997,"text":"Los Angeles, CA / Drupal Developers / Full Time - No remote<p>Stauffer New Media Development<p><a href=\"http://stauffer.com/about/careers\" rel=\"nofollow\">http://stauffer.com/about/careers</a><p>It takes great people to achieve such accomplishments – and Stauffer New Media is looking for talented individuals to complete our team. We are a group of smart, accomplished development engineers who do more than simply code for our clients. Rather, we use our past experience and passion for innovation to create unique, cutting edge solutions for our business clients. Joining our team will provide you the opportunity to work closely with all members, including the most senior staff. You will learn directly from your peers, while experimenting hands-on with the newest open source technology. You will work directly with our clients, developing and shaping projects from start to finish. You will transcend from being simply an engineer to a full-service business consultant, engaged in creating value generating solutions for our clients.","time":1335883422,"type":"comment"},{"by":"lucasr","id":3916832,"parent":3913997,"text":"Mozilla - Remote, or one of our 9 global offices (London, Mountain View, San Francisco, Toronto, Paris, ...)<p>Mozilla has quite a few engineering openings to work on exciting projects like Firefox (front-end and platform), Firefox Mobile (front-end and platform), Boot to Gecko, Web APIs, and more.<p>For more details: <a href=\"http://careers.mozilla.org\" rel=\"nofollow\">http://careers.mozilla.org</a>","time":1335915278,"type":"comment"},{"by":"robinwarren","id":3914156,"parent":3913997,"text":"Covalent Software - <a href=\"http://www.covalentsoftware.com/\" rel=\"nofollow\">http://www.covalentsoftware.com/</a><p>Taunton (near Bristol) UK, Java Fulltime<p>Covalent is the market leader in UK public sector Performance Management, we're a small company (&#60; 40 total, 15 person development team) but growing consistently. Specifically right now we are moving into new markets and hence need to enhance our product to support that. We are also building out new modules to sell into these and our existing markets.<p>Work would be on our hosted Java (Java 6, soon to be 7) thick client application which talks across the internet to our backend running on SQL Server. Although not following any specific agile methodology we deploy nightly to test and do 4 major releases a year to customers. We use continuous integration (Jenkins) and unit testing as appropriate.<p>My email address is in my profile, or go via \n<a href=\"http://www.covalentsoftware.com/company/careers.php\" rel=\"nofollow\">http://www.covalentsoftware.com/company/careers.php</a>","time":1335878397,"type":"comment"},{"by":"tommccabe","id":3914351,"parent":3913997,"text":"New York, NY - DVF is seeking front end web developer.<p>We're a leading fashion brand with a growing e-commerce business and need someone who is great with front end technology. E-commerce experience is a plus.<p>More info here: <a href=\"http://www.authenticjobs.com/jobs/12661/front-end-web-developer\" rel=\"nofollow\">http://www.authenticjobs.com/jobs/12661/front-end-web-develo...</a>","time":1335881321,"type":"comment"},{"by":"rwgould","id":3914443,"parent":3913997,"text":"Toronto, ON - <a href=\"http://gaggleup.com\" rel=\"nofollow\">http://gaggleup.com</a><p>GaggleUp is a new start-up at the intersection of local and online\ncommerce. We are on the verge of launching into new verticals in the\ngroup-buying space, as well as launching co-branding initiatives with\nsome of Canada's most recognizable companies. Our core web application\nhas been carefully designed and maintained with best practices in mind\non the industry-leading web application framework (can you guess which\none?). However our cherished web app needs to be extended, scaled, and\nbuilt out to meet business demand. We are looking for a full time \ndeveloper or two to help take our web app to the proverbial next level.<p>-- About Us --<p>* Our core web app is built with Ruby on Rails and JavaScript<p>* It runs on Ubuntu using Amazon Web Services, and deployment is controlled by Chef<p>* We develop iteratively and release regularly<p>* We care about quality - our code is well-designed and tested (~75% code coverage)<p>* We work hard, but smart. We believe less code is better, and a simple UI is key<p>* We're not religious about technology. We believe in using the right tool for the job<p>* We like to give back to the open source community<p>* We have a very experienced management team who have been hugely successful in the past<p>-- What We're Offering --<p>* A chance to join a growing startup before everyone knows the name<p>* A chance to work on a new web application using cutting-edge tools<p>* A chance to work with an experienced team of entrepreneurs<p>* A competitive salary with a comprehensive benefits package<p>Sound interesting? More information here: <a href=\"http://gaggleup.com/jobs\" rel=\"nofollow\">http://gaggleup.com/jobs</a>","time":1335882348,"type":"comment"},{"by":"sgrock","id":3914569,"parent":3913997,"text":"Portland, OR/San Francisco - <a href=\"http://newrelic.com/about/jobs\" rel=\"nofollow\">http://newrelic.com/about/jobs</a><p>New Relic is growing and has several technical (and non-technical) positions.  If you've got skills in Ruby, Java, C, or iOS, and want to work at one of the coolest companies around, give us a shout.<p>We are passionate, possibly even crazy, about application performance management (APM). Our mission is to make web applications run better, to make the internet more productive, and to make life easier for developers and devops. We are turning the APM marketplace upside down by providing SaaS products that deliver high-value functionality previously only available through enterprise software. We are well above 17,000 customers. And with your help we’ll get to 10x that number.<p>[H1B] is fine.  Usually no [REMOTE] but we have made exceptions.  We're losing our [INTERN] to college so that's also a possibility.","time":1335883776,"type":"comment"},{"by":"jdelic","id":3914699,"parent":3913997,"text":"LaterPay in Munich, Germany is hiring. We're a Python-based Saas company, looking for experienced operations/sysadmins and programmers. We love to hire internationally and are good at helping you relocate to Germany, as long as you have a work permit for the EU.<p>We work with Django, Tornado, nginx, Cassandra, PostgreSQL and Redis. We're building a highly-scalable payment platform based on these tools. We're Angel-funded and have already lined up multiple international customers.<p>Find out more here:\n<a href=\"http://careers.stackoverflow.com/jobs/12430/linux-sysadmin-a-super-scalable-performance-laterpay-gmbh\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/12430/linux-sysadmin-a...</a>\n<a href=\"http://careers.stackoverflow.com/jobs/9841/senior-python-developer-a-german-start-up-laterpay-gmbh\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/9841/senior-python-dev...</a><p>We'd love to hear from you.","time":1335885306,"type":"comment"},{"by":"jeremyw","id":3915319,"parent":3913997,"text":"SimplyHired - Sunnyvale, CA - Full-time - <a href=\"http://www.simplyhired.com\" rel=\"nofollow\">http://www.simplyhired.com</a><p>We're looking for DevOps engineers to round out our operations team.  Help automate, scale and make more reliable the largest job search engine.<p>Open source / Nginx / Varnish / HAProxy / MySQL / N+1 / N+N / Configuration management<p>There are no assigned roles.  You'll cross-train on everything, getting your hands in site reliability in all its breadth: networks, provisioning, performance &#38; scaling, deployment, big data / Hadoop, monitoring, etc.  Both datacenter &#38; cloud.<p>We automate relentlessly in a mix of Python and Ruby.  Think like a developer: learn something, code it up, learn some more, refine.  Over time, we want this stuff to sing.<p>Email jeremy-at-simplyhired.com or see <a href=\"http://www.simplyhired.com/a/our-company/careers\" rel=\"nofollow\">http://www.simplyhired.com/a/our-company/careers</a>.","time":1335891686,"type":"comment"},{"by":"ryen","id":3917007,"parent":3913997,"text":"Coffee Meets Bagel - San Francisco, CA. Full time - Experienced Python/Django web developer<p>Coffee Meets Bagel ( <a href=\"http://coffeemeetsbagel.com\" rel=\"nofollow\">http://coffeemeetsbagel.com</a> ) is a new innovative online dating startup making waves in New York City and looking to expand to the west coast soon.  We've recently been featured in TechCrunch, Glamour, BostInno, and several other major blogs and publications.<p>About the Job:\nWe're looking for an experienced Python/Django web developer to join our early stage team as we scale our website in terms of geography and users, refine our revenue model, and continue to keep our customers happy. You will have an opportunity to work with and learn from a highly experienced technical advisor and a senior python engineer. This is a market with huge opportunity and we will look to you for best practices around architecture, deployment and scaling the service to millions of people.<p>Requirements:\n - 2+ Years of Python development experience with some knowledge of Django or similar web frameworks. You will be able to contribute to our Django code base from Day 1.\n - A strong knowledge of the fundamentals of networking, operating systems, and security.\n - A Bachelors Degree in Computer Science or Computer Engineering or related discipline from a 4-year program.\n - Agile. Intelligent. Creative. Problem-solver. Startup lover. You like finding and working with outstanding engineers and want to help us build an awesome engineering team.<p>Bonus:\n - Experience building back-end systems on a high-traffic, low-latency web site.\n - Knowledge in Machine Learning/Graph Theory/Large-scale Data Analysis is a plus\n - Experience working with, and contributing to open source software projects is a plus—show us your github account or other online projects if available<p>*Also looking for engineering interns, front-end developers, and marketing/PR intern.<p><a href=\"http://coffeemeetsbagel.com/jobs/\" rel=\"nofollow\">http://coffeemeetsbagel.com/jobs/</a>","time":1335918459,"type":"comment"},{"by":"twp","id":3914568,"parent":3913997,"text":"Chambéry, France and Lausanne, Switzerland - Python and Javascript devs - geospatial and business<p>All open source.<p>Geospatial development is primarily Javascript (OpenLayers, Ext.js) and Python (Pylons, SQLAlchemy, etc.).<p>Business development is Python (OpenERP).<p>Full list of positions: <a href=\"http://www.camptocamp.com/en/careers\" rel=\"nofollow\">http://www.camptocamp.com/en/careers</a>","time":1335883749,"type":"comment"},{"by":"sganesh","id":3914284,"parent":3913997,"text":"Austin, TX<p>Audingo - (www.audingo.com)<p>Full Time - (Intern, no REMOTE,  H1B for right candidate)<p>Audingo is helping radio stations and other verticals connect with their listeners via different messaging mediums and helping them monetize it. Checkout the service through www.mix947.com.<p>Our platform runs on Windows Azure. Asp.NET MVC 3, RESTful WCF services &#38; most of windows azure's capabilities power our backend. UI is done using HTML, CSS, JQuery &#38; a bit of flash (this is currently being stripped out). We also have\nan IOS app &#38; an Android app.<p>We're looking for\n(i) UI/UX Designer/Developers\n(ii) .NET Developers with ASP.NET MVC 3, WCF , (Nice to have - Windows Azure Exposure)\n(iii) Product Manager \nand (iv) QA - Selenium &#38; Other Automation Tools<p>Benefits:<p>* Competitive salary (we’re funded)<p>* Stock options (in a pre series A company)<p>* Medical Insurance<p>* Nice Private Office<p>* Equipment Of Your Choosing<p>* Well Stocked Pantry<p>* Relaxed, Fun and Passionate Co-Workers<p>* We're on 360 south of Bee Caves Rd<p>Please send a mail to \"saig AT audingo.com\" with your accomplishments and/or resume.","time":1335880358,"type":"comment"},{"by":"fjordan","id":3914288,"parent":3913997,"text":"rewardStyle - Dallas, TX (Uptown) - Fulltime/Part-time<p>rewardStyle is an invitation-only web tool that helps\nfashion bloggers find and monetize their content.<p>About us:<p>* Soft launched one year ago<p>* Solving hard problems involving complex systems<p>* Currently a small engineering team of three looking for talent<p>What we're looking for:<p>* Designers<p>* Fullstack engineers<p>* Front-end engineers<p>We currently use PHP/C, MySQL, Memcached, and iOS/Android<p>Contact me: forrest at rewardstyle.com if you are interested.","time":1335880393,"type":"comment"},{"by":"steverb","id":3914594,"parent":3913997,"text":"Knoxville, TN<p>CellularSales is a fast growing retailer of Verizon Wireless Cellular Service, and we're looking for a few good devs.<p>Our stack is .NET and we're looking for people who love getting stuff done, and are good enough to teach the rest of us something new.<p>If you're in the area and are interested, shoot me an email (address is in my profile).","time":1335884217,"type":"comment"},{"by":"malcolmong","id":3916359,"parent":3913997,"text":"New York, NY (SoHo) -- Engineers<p>SKILLSHARE<p><i>Our mission is to transform education by democratizing learning and empowering anyone to become a teacher.</i><p>There are some people who like a challenge, and then there's someone who joins Skillshare.<p>Think about all the moments in history when people said \"it couldn't be done\". Being an engineer at Skillshare is for the people who defy these remarks, lead the charge and as a result change the world.<p>As an Engineer, you'll be joining a fast-paced engineering team that identify and solve problems from conception to deployment daily. The product we build supports the fast-growing Skillshare community at large, at scale and you'll be leading its evolution into the world.<p><i>Learn more:</i> <a href=\"http://www.skillshare.com/careers\" rel=\"nofollow\">http://www.skillshare.com/careers</a><p>PS - bonus points if you can beat the founders in a game of Settlers of Catan or Dominion!","time":1335906265,"type":"comment"},{"by":"KoryFerbet","id":3915638,"parent":3913997,"text":"Seattle, WA Fulltime<p>An already profitable Seattle based Startup is looking for mobile developers, both Android and iOS to join their team permanently. They have a fantastic advisory board and great team. Their leaders all have experience taking startups and turning them either public as well as negotiating acquisitions.<p>We are seeking a self-motivated, creative multi-platform mobile application developer with a passion for pushing the envelope of user experience to create intuitive, useful, and widely-adopted apps. This position is the first of its kind in our organization and as such, you will have an opportunity to make this job your own. Because my client is a startup you will have a chance to leave your thumbprint with a company that is revolutionizing mobile performance.<p>Key Responsibilities<p>Develop rich-UI applications for iPhone and/or Android platforms\nWork with graphics designers to design and implement a rich and intuitive mobile user experience\nWork collaboratively in a team environment that includes more senior application developers and/or architects\nSkills Required<p>Strong familiarity with cutting-edge UI implementations, including underlying threading models\nTrack record of bringing apps to mass market, either solo or in team settings\nKnowledge of Java on Android and/or Objective-C on iOS\nDisciplined coding style with an eye toward maintainability\nRelentlessly high quality standards and extreme attention to detail\nA history of positive teamwork and the ability to thrive in a fast-paced environment\nExperience with integrating multiple aspects of API.\nB.S. or B.A. in Computer Science, Computer Engineering, or similar, or equivalent experience<p>Bonus Points<p>Experience working on the NDK\nExperience with Amazon EC2<p>You can apply via <a href=\"http://www.bullhornreach.com/job/149588_mobile-application-developer-seattle-wa\" rel=\"nofollow\">http://www.bullhornreach.com/job/149588_mobile-application-d...</a><p>Or send me an email for more information Kory@imatch.com","time":1335895689,"type":"comment"},{"by":"dgurney","id":3914888,"parent":3913997,"text":"Concert Window is bringing on a CTO in New York, NY.<p>We are creating a way for people to watch live concerts online. We've already built an exclusive network of nine top venues around the country and developed proprietary tech for producing the webcasts. We are supported by Mark O'Connor and Wynton Marsalis, and recently closed an angel round of seed funding.<p>We are making revenue already, with thousands of paying customers.<p>Now, we're bringing on a CTO to mastermind the technical infrastructure that will power Concert Window going forward. We don't care what language or stack you use; we're looking mostly for an extremely high quality candidate who wants to take ownership of creating this infrastructure.<p>The company is run by two Harvard grads and musicians. Ideally you are also a musician or music lover.<p>Email dan@concertwindow.com with \"HN\" in the subject line","time":1335887120,"type":"comment"},{"by":"ipt","id":3914801,"parent":3913997,"text":"SamKnows - London, UK<p>PHP Application Developer<p>SamKnows is regarded as the global leader in internet performance measurement, and it's technology is used by governments and companies around the world.<p>We are looking for a smart, well-rounded developer with 3-5 years industry experience, to help us build data-driven web applications. There will also be an opportunity in the coming year to play a role in re-designing our existing system's data storage/backend, to allow us to scale to orders of magnitude more records than currently processed.<p>You have strong PHP, OO design, and SQL; you also speak Javascript, and use version control. Ideally, you will have a grounding in maths (especially statistics). Any of the following are advantageous: PHPUnit, Symfony, MySQL optimisation, jQuery, Linux, HTML/CSS.<p>Please apply by sending a CV / covering note to cvs@samknows.com","time":1335886183,"type":"comment"},{"by":"stochastician","id":3914373,"parent":3913997,"text":"Prior Knowledge is hiring in downtown San Francisco! We're a small team in downtown San Francisco pushing the frontiers of probabilistic machine learning to the masses. Our first product is Veritable, a predictive database. We like to think of it as a database for things you don't know.<p>We're passionate about discovering the hidden causes behind data, and are currently split pretty evenly between machine learning experts, scalable systems engineers, and people used to working with horribly messy, complex, and sparse data.<p><a href=\"http://priorknowledge.com/join-us/\" rel=\"nofollow\">http://priorknowledge.com/join-us/</a> describes a bit more about what we're looking for, and you can always e-mail me (jonas@priorknowledge.com) for more info! Or come to our Friday office hours and meet the team.","time":1335881574,"type":"comment"},{"by":"adam0101","id":3914216,"parent":3913997,"text":"Hartford, CT - Operations Engineer  - Full Time - Travelers<p>You will be a part of a team of Operations Engineers which will be responsible for a growing number of applications and infrastructure in our corporate environment. You know your way around many operating systems, and network devices. You are comfortable working on a Linux Server issue one day, and the next spending it analyzing a network trace.  You have a demonstrated history of providing great customer service and root cause analysis.  You are comfortable working in a high paced collaborative environment with a small elite team.<p>More details here - <a href=\"http://careers.stackoverflow.com/jobs/19121/it-operations-engineer-travelers?a=mAEMy52\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/19121/it-operations-en...</a>","time":1335879322,"type":"comment"},{"by":"rdamico","id":3915042,"parent":3913997,"text":"Crocodoc.com (YC W10) - San Francisco - {Software Developers, Business Development, Sales/Marketing}<p>We just launched a major new HTML5 document embedding product today (<a href=\"http://tcrn.ch/JbsoVN\" rel=\"nofollow\">http://tcrn.ch/JbsoVN</a>) and announced new customers including Dropbox and LinkedIn.<p>We're growing super fast (haven't had time to finalize formal job descriptions yet!) and are a small, fun, high-intensity team.<p>Our goal at Crocodoc is to free users from antiquated desktop software and empower the world’s top companies to adopt cloud-based document workflows.<p>We've developed the world's most advanced web-based document viewing and collaboration technology for Microsoft Office and PDF files, built on open standards such as HTML5 and CSS3.<p>Drop us a note at jobs@crocodoc.com","time":1335888867,"type":"comment"},{"by":"bjcubsfan","id":3915824,"kids":[3915931],"parent":3913997,"text":"Oklahoma City, OK\nFull Time Engineers with software experience\nCitizenship Required<p>We are looking for programmers who can work with Python, Django, C, and Matlab. They should have Linux/Unix experience. You will work with a company that contracts with the Federal government. This means a very stable job, 40 hour work weeks (Flex schedule available), and excellent benefits; but unlike many government positions, the specific group has stimulating work to do and is not locked in to ancient technology. The work focuses on developing tools for and performing data analysis on the system.<p>I can get you more information if you are interested:<p><a href=\"http://www.twitter.com/bjcubsfan\" rel=\"nofollow\">http://www.twitter.com/bjcubsfan</a><p>email: okc-engineer.bjp@xoxy.net","time":1335897952,"type":"comment"},{"by":"steveb","id":3914886,"parent":3913997,"text":"St. Louis, Missouri - 2 Software Engineers - Fulltime<p>Major global financial corporation.<p>We are seeking 2 software engineers with strong C++/Java/Python skills to develop grid software and implement visualization of financial data.<p>The roles are as follows:  \n1) Help develop a multithreaded C++/MPI application to simulate the behaviors of mortgage portfolios. The application runs a cluster of Linux nodes. We're looking to scale to thousands of cores.<p>2) Develop visualization tools using Paraview or other technologies for financial data. Mine data sets and work with analysts. We are open to big data technologies and techniques.<p>Experience with quantitative finance, HPC or scientific computing is a plus. Our target platforms are both Linux and Windows.<p>email me at steve@borrelli.org if interested.","time":1335887103,"type":"comment"},{"by":"equark","id":3915306,"parent":3913997,"text":"Sense - <a href=\"http://www.senseplatform.com\" rel=\"nofollow\">http://www.senseplatform.com</a><p>- Quantitatively Oriented Developer - Summer Intern<p>- New York City / Cambridge, MA / San Francisco.<p>We're pre-launch startup building a next-generation platform for data and statistics.  We're solving some of the most challenging problems in statistics and big data in a way that will delight both PhD statisticians and business analysts.<p>Position:<p>We're looking for a quantitatively oriented developer to join our small (3) team.  We're open to summer interns.  Strong knowledge of C/C++ and Javascript required. Masters/PhD in a quantitative field and strong opinions about data analysis software such as R, Stata, SAS, or SPSS is a major plus.<p>Sound interesting, drop me a line: tristan@senseplatform.com","time":1335891523,"type":"comment"},{"by":"uberc","id":3915458,"parent":3913997,"text":"New York City. SUMMER INTERNSHIPS in software (including Unity 3D), hardware, and game design at Project Grasshopper.<p>Project Grasshopper: game lounges for grown-ups. Starting in New York City and involving interactive tabletops and innovative physical and digital media in actual locations, with the goal of using games to foster meaningful face-to-face social interaction and in-person community. Founded by former Google PM director.<p>Participants in test events have basically said: we love it, we want it more, and we don't know where else to get it.<p>If this piques your interest, email info@projectgrasshopper.com and I can send you a concept test video that gives a brief overview of the project and includes footage from a recent test event.","time":1335893504,"type":"comment"},{"by":"FreakLegion","id":3916634,"parent":3913997,"text":"Sacramento, CA - Full-time - 5 Engineering openings - REMOTE an option if you're awesome<p>We're a former startup recently turned autonomous software development arm of ManTech International. Malware's our game, with a focus on building enterprise security products. We're largely a .NET shop, but under the hood everything runs on C/C++ (both managed and unmanaged) and hand-coded assembly, so there's room for people at all levels.<p>Email's in my profile. Happy hunting!<p>--<p>1. Software Engineer - C++/Low-level<p>Required skills: C/C++, Windows system internals, Win32 API, ASP.Net, C#/.Net, MSSQL Server<p>Desired skills: In-depth knowledge of CPU architectures and Windows kernels (Windows 2000 forward), x86-64 proficiency, optimizing software for speed and/or memory, Windows device driver development<p>--<p>2. Software Engineer - C++/Low-level (slightly different priorities than above)<p>Required skills: Windows device driver development, C/C++, Win32 API, Windows system internals, ASP.Net, C#, MSSQL Server<p>Desired skills: Managing projects using SDLC, optimizing software for speed and/or memory, x86-64 proficiency, in-depth knowledge of CPU architectures and Windows kernels (Windows 2000 forward)<p>--<p>3. QA Software Developer<p>Required skills: Win32 API, C/C++, socket and network layer APIs, automated testing with TestComplete or equivalent<p>Desired skills: C#/.NET, scripting (Perl/Python/Ruby/other)<p>--<p>4. Software Engineer - Database Specialist<p>Required experience: C# and ASP.Net, MSSQL Server, Service-oriented architecture, HTML and CSS<p>Desired experience: Optimizing software for speed and/or memory, C/C++, WCF<p>--<p>5. Software Engineer - Windows Networking/WMI<p>Required skills: ASP.Net, C#, MSSQL Server, Windows networking<p>Desired skills: Windows system internals, C/C++, optimizing software for speed and/or memory","time":1335911010,"type":"comment"},{"by":"proletarian","id":3914376,"parent":3913997,"text":"We're hiring devs at Adobe to work on social media marketing in San Francisco, Colorado Springs, an Orem, UT. Full-time only.\nWe use Rails, Mongo, Redis, and are doing amazing things with social APIs and big data analytics over social data.\n<a href=\"http://www.adobe.com/products/social.html\" rel=\"nofollow\">http://www.adobe.com/products/social.html</a><p>Position Summary<p>Architect and build new solutions for social marketing within Adobe's Digital Marketing Suite. This position involves working with complex and dynamic social APIs from Facebook and other social platforms. You'll work with large data sets and be involved with scaling a platform that handles millions of users interacting with the world's biggest brands. Our small, distributed team is located in San Francisco, Colorado Springs, and Orem, UT. We constantly get to work with new challenges as the social platforms evolve, and often find ourselves evaluating new technologies.<p>Responsibilities\nLead development for large, complex social marketing features.\nDefine APIs for internal and partner consumption.\nGain broad knowledge of our platform and fix bugs / refactor code throughout.\nMake intelligent engineering choices about product architecture and development approaches.\nLead conversations about our solutions, both internally with team members and externally with customers.\nDefine, develop, and innovate on our team processes.\nWork with team members to guide them to better solutions, review code, etc.\nRequirements\nBS or advanced degree in Computer Science or similar field.\nMinimum of 6 years experience working on complex systems, or equivalent.\nBroad technical knowledge and demonstrated track record of picking up new skills.\nExperience with, or genuine interest in, social media.\nKnowledge of at least one web programming language (Ruby/Rails, PHP, Java, etc.).<p>Here is the link: <a href=\"https://adobe.taleo.net/careersection/2/jobdetail.ftl\" rel=\"nofollow\">https://adobe.taleo.net/careersection/2/jobdetail.ftl</a><p>Adobe believes in hiring the very best. We are known for our vibrant, dynamic and rewarding workplace where personal and professional fulfillment and company success go hand in hand. We take pride in creating exceptional work experiences, encouraging innovation and being involved with our employees, customers and communities. We invite you to discover what makes Adobe a place where exceptional people thrive.<p>Click this link to experience A Day in the Life at Adobe: <a href=\"http://www.adobe.com/aboutadobe/careeropp/fma/dayinthelife\" rel=\"nofollow\">http://www.adobe.com/aboutadobe/careeropp/fma/dayinthelife</a>","time":1335881629,"type":"comment"},{"by":"triggit","id":3915327,"parent":3913997,"text":"Triggit, Inc.<p>San Francisco, CA - Full-Time - NO REMOTE - H-1B friendly<p><a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a><p>Base pay for engineers starts in the six figures, you get to build your own battle station, and every engineer gets an office with a door. We have a really cool office with high ceilings and natural light. We also do daily catered lunches.<p>Available positions:<p><pre><code>  Senior Linux System Administration / Developer Ops\n\n  Senior Reporting Engineer\n\n  Senior Engineer: Ad Serving Systems\n\n  Ruby on Rails Developer (Full Stack)\n</code></pre>\nWe're hiring aggressively, so check out <a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a> or hit up engjobs+hn@triggit.com","time":1335891791,"type":"comment"},{"by":"e1ven","id":3915184,"parent":3913997,"text":"Waltham, Ma (Near Boston)<p>SavingStar is looking for Ruby experts to help us transition the world away from paper coupons, and enable a digital couponing future.<p>If you can intelligently discuss page vs. fragment caching, if scaling a website to millions of users sounds like fun and if you enjoy a fast paced, flexible environment with challenges to spare, we might be a good fit.<p>We're looking for someone to help improve our websites and services, both internal and external, and to work with partners to integrate SavingStar into their environments.<p>We're looking for someone who's used frameworks (such as Rails or Django) extensively, and is comfortable in Ruby on Rails.<p>Our primary database is MongoDB, so NoSQL/Schema-less experience is great.<p>Shoot me an email ;)","time":1335890425,"type":"comment"},{"by":"Jun8","id":3915563,"parent":3913997,"text":"Chicago, IL. Full time.<p>The Applications &#38; Analytics Architecture Group in Motorola Solutions is looking for an software engineer. The group performs research and development on video, image, audio, and data analysis algorithms, applications, and services, to create next-generation public safety and enterprise solutions.<p>Job Responsibilities:\n• Collaborate in cross-functional teams to develop system prototypes, integrating video/image analytics algorithms and software.\n• Contribute to the development of video/image analytics &#38; processing algorithms, develop efficient software implementations of the algorithms, run simulations to evaluate performance and refine the methods.\n• Generate patent disclosures covering the system solutions and the underlying methods.\n• Present results and demonstrations at internal meetings and meetings with customers.<p>Basic Qualifications:\nThe position requires an MS in Computer Science, Computer Engineering or Electrical Engineering.<p>Specific Knowledge/Skills:\n• Enthusiasm for solving complex problems.\n• Extensive C++ and/or Java programming experience and strong object oriented design experience, including working knowledge of core libraries and design patterns.\n• Significant software development experience, including use of software development tools and version control in Unix/Linux and/or Windows environments.\n• Application programming experience on Android mobile platforms.\n• DSP and/or GPU programming experience on embedded platforms is a plus.\n• Web applications or services development experience, including server-side and client-side web scripting (e.g. JavaScript, Python, and/or Perl) is a plus.\n• Experience with multimedia frameworks (e.g. GStreamer, WindowMedia) and video codecs (e.g. MPEG-4 AVC) is a plus.\n• Experience deploying video/image processing applications in live prototype or pilot systems a plus.\n• Some hand-on skills building circuits is a plus.\n• Familiarity with one or more of the following areas is desirable: video/image processing, computer vision, machine learning, data mining, and pattern recognition.\n• Strong teamwork and communication skills, creativity, productivity, and learning agility.<p>If interested, send me a message.","time":1335894740,"type":"comment"},{"by":"cperea","id":3915781,"parent":3913997,"text":"Full Time Job Opportunity in: Austin, TX with RGM Advisors, LLC\nIndustry: Financial/Proprietary Trading\nPosition: Quantitative Researcher<p>RGM Advisors, LLC is a proprietary trading firm headquartered in Austin, Texas that applies scientific methods and computing power to trading in multiple asset classes around the world. This is a unique opportunity to join a successful quantitative trading firm in a geographic location that is consistently recognized as one of the top 10 places to live, work, and play.<p>Responsibilities:\nWe are currently seeking Quantitative Researchers at various levels who are capable of working within our proprietary computational research and modeling environment to develop automated trading strategies using machine learning, statistical analysis and other quantitative techniques. Successful candidates have the opportunity to solve complex and intellectually challenging problems including research and development into improved modeling techniques; design of improved tools and processes for conducting research and building trading models; and development and implementation of quantitative trading models for financial instruments traded in various markets.<p>Qualifications:\nInclude the following\nExcellent analytical skills\nAcademic background in engineering, computer science, physics, math, statistics or another quantitative discipline\nFamiliarity with machine learning algorithms, statistical analysis and/or quantitative analytical techniques\nFamiliarity with UNIX and C++\nRGM Advisors, LLC offers a fast-paced environment where individuals take pride and ownership in their work.  Our culture is intelligent, friendly and diverse.  Our modern, comfortable office space is located in downtown Austin, Texas with 360-degree views of the city.  We offer attractive compensation and benefits packages, hands-on training in trading and financial markets and a casual work environment that fosters innovation and creativity.<p>To apply for this position and to see a full list of open positions at RGM Advisors, please visit our career portal: <a href=\"https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;searchLocation=&#38;searchCategory=\" rel=\"nofollow\">https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;sear...</a>","time":1335897426,"type":"comment"},{"by":"cperea","id":3915794,"parent":3913997,"text":"Full Time Job Opportunity in: Austin, TX with RGM Advisors, LLC\nH1B Sponsorship is a possibility\nPosition: Quantitative Researcher\nIndustry: Financial/Proprietary Trading<p>RGM Advisors, LLC is a proprietary trading firm headquartered in Austin, Texas that applies scientific methods and computing power to trading in multiple asset classes around the world. This is a unique opportunity to join a successful quantitative trading firm in a geographic location that is consistently recognized as one of the top 10 places to live, work, and play.<p>Responsibilities:\nWe are currently seeking Quantitative Researchers at various levels who are capable of working within our proprietary computational research and modeling environment to develop automated trading strategies using machine learning, statistical analysis and other quantitative techniques. Successful candidates have the opportunity to solve complex and intellectually challenging problems including research and development into improved modeling techniques; design of improved tools and processes for conducting research and building trading models; and development and implementation of quantitative trading models for financial instruments traded in various markets.<p>Qualifications:\nInclude the following\nExcellent analytical skills\nAcademic background in engineering, computer science, physics, math, statistics or another quantitative discipline\nFamiliarity with machine learning algorithms, statistical analysis and/or quantitative analytical techniques\nFamiliarity with UNIX and C++\nRGM Advisors, LLC offers a fast-paced environment where individuals take pride and ownership in their work.  Our culture is intelligent, friendly and diverse.  Our modern, comfortable office space is located in downtown Austin, Texas with 360-degree views of the city.  We offer attractive compensation and benefits packages, hands-on training in trading and financial markets and a casual work environment that fosters innovation and creativity.<p>To apply for this position and to see a full list of open positions at RGM Advisors, please visit our career portal: <a href=\"https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;searchLocation=&#38;searchCategory=\" rel=\"nofollow\">https://jobs-rgmadvisors.icims.com/jobs/search?ss=1&#38;sear...</a>","time":1335897534,"type":"comment"},{"by":"mceachen","id":3918002,"parent":3913997,"text":"Twitter - San Francisco, California. Full time &#38; interns for Engineering (front-end: javascript, back-end: rails/scala/java, ML: hadoop/scalding/pig), Design &#38; UX, …<p>I've never felt so appreciated/spoiled at a workplace before. You'll be working with great people, getting stuff shipped daily that makes a difference, working on whatever suits your fancy for a whole week every quarter during company-wide hack weeks, contributing to some of the most popular open source projects out there, and getting fed gourmet catered meals every day.<p><a href=\"http://twitter.com/jobs\" rel=\"nofollow\">http://twitter.com/jobs</a>","time":1335945378,"type":"comment"},{"by":"logicalmind","id":3914395,"kids":[3914832],"parent":3913997,"text":"Western suburbs of Chicago (Naperville area). No H1B, no remote. We are looking for junior to mid-level person with either a Java background looking to move to C# or a C# background. If coming from a C# background, must be open to open source libraries like Spring.NET.<p>It's a small team and you will work with public-facing web applications in the financial field as well as back-office application for internal stuff. Must understand RDBMS fundamentals.<p>I cannot name the company publicly because this is not an endorsed post. But shoot me an email (email is in my profile) if you're interested or have any questions.","time":1335881808,"type":"comment"},{"by":"kabir_h","id":3915507,"parent":3913997,"text":"Cambridge, MA - Shareaholic makes tools for publishers and users to help them find and share the best content on the web. We're a small, funded startup (with killer investors: Dave McClure, Dharmesh Shah, General Catalyst) that reaches 300 million unique users via 200K publishers. We've got an awesome team culture that avoids bureaucracy and gives everyone a meaningful chance to contribute. Everyone codes, even our marketing person.<p>We're hiring a Front End Developer and a Product Designer:\n<a href=\"http://www.shareaholic.com/careers\" rel=\"nofollow\">http://www.shareaholic.com/careers</a>","time":1335894133,"type":"comment"},{"by":"kloncks","id":3915631,"parent":3913997,"text":"Kout.me - Full-time (San Francisco) - Back-end Developers, Designers.<p>Sorry no remote. No H1B.<p>Well-funded early stage startup focusing on simplifying online selling, especially selling across multiple platforms.<p>Looking for designers to make our product beautiful and useable. Looking for engineers to work on some really hard problems in payments, fraud, and creating a multi-platform network.<p>Small team, great culture, flat organization, meaningful equity, strong compensation, and a huge vision we can all rally behind. A perfect way to learn about building a startup from the ground up before building your own.<p>Email hany@kout.me and mention you're from HN.","time":1335895547,"type":"comment"},{"by":"hullo","id":3914632,"parent":3913997,"text":"SparkNotes is hiring a full time web developer in New York, NY.<p>We work mainly with PHP/symfony but are open to candidates with strong ruby/python/perl experience as long as you've worked with (or at least are open to) MVC web frameworks.<p>Full LAMP stack, opportunity to make a big impact (5 person technical team) on a high profile site (well over 10 million uniques/month), backed by the resources of bn.com. Work out of our Chelsea office and cadge lunches off your friends at Google.<p><a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=2924074\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=2924074</a>","time":1335884597,"type":"comment"},{"by":"musman","id":3914863,"parent":3913997,"text":"San Francisco, CA - User Experience Designer @ BillFloat.com<p>BillFloat is seeking a passionate and creative UI/UX Designer to join our product team.<p>We have an innovative solution which offers consumers ‘more time to pay’ over 2,500  bills such as utility, cable, mobile and insurance payments through a range of affordable small-dollar credit offerings.<p>You will work closely with our sales, product and engineering teams to define and evolve the brand and experience across multiple channels. Your main task will be to embrace our users' needs and develop simple, accessible and easy to use design solutions.<p>* Role and Responsibilities *<p>You are self-directed, and comfortable running with a feature from inception to release in an Agile environment.  \nPartner with product managers, fellow designers, and engineers to drive to the heart of a complex problem space and articulate clear user-centered design solutions.  \nYou know how to use data and analytics to inform your designs.  \nBring ideas to life with compelling visual assets, writing and verbal communication.  \nProduce highly usable designs for web and mobile environments.  \nWhile you don't need to be a strong visual designer for this position, you understand intimately the role and influence the visual design process brings to the finished product.<p>* Experience and Skills *<p>2-5 years experience working on consumer web products.\nAbility to translate user goals and behaviors into design ideas.<p>Ability to create workflow diagrams, wireframes, and mock-ups rapidly and at an appropriate level of fidelity. (Hand-waving, white-boarding, paper, balsamiq, Adobe, etc)<p>Ability to assess technology constraints and opportunities, and adjust design approaches accordingly.<p>You know which small stuff to sweat - careful attention to detail while being able to adhere to project deadlines.\nExcellent interpersonal and communication skills.<p>* Extra Credit *<p>Experience in consumer financial or ecommerce products and checkout flows\nWorking knowledge of front-end markup: HTML, CSS, JQuery or Ruby.<p><a href=\"http://jobvite.com/m?3RHMjfwn\" rel=\"nofollow\">http://jobvite.com/m?3RHMjfwn</a>","time":1335886834,"type":"comment"},{"by":"carbon8","id":3915944,"parent":3913997,"text":"San Francisco, CA.<p>Byliner Inc. is a publishing company and social network built around great stories. We are an online archive of long form journalism and fiction, as well as a publisher of original stories for iPad, Kindle, and other mobile devices.<p>We use Ruby, MySQL, Redis, Sass and are making the shift to using Backbone and CoffeeScript on the front-end. We also produce ebooks.<p>Looking for both UI and back-end developers. Full Time and/or contract.<p>Also starting to look for a designer for help with static HTML/CSS and graphics on a contract basis.<p>More info: <a href=\"http://byliner.com/jobs\" rel=\"nofollow\">http://byliner.com/jobs</a>","time":1335899676,"type":"comment"},{"by":"ahuibers","id":3915888,"parent":3913997,"text":"Mountain View, CA, Full-time, onsite<p>Hiring in Machine Learning / Applied Artificial Intelligence.<p>Work on the new new thing at Bump Technologies (we can't say exactly what it is yet...)<p><a href=\"http://bu.mp/openings\" rel=\"nofollow\">http://bu.mp/openings</a>","time":1335898699,"type":"comment"},{"by":"asuth","id":3915451,"parent":3913997,"text":"Quizlet, SF [Full-time, Interns]<p>This is a picture of two kids using our unreleased learning game:\n<a href=\"http://qdaq.com/4j1.jpg\" rel=\"nofollow\">http://qdaq.com/4j1.jpg</a><p>We took this photo in a classroom last week where we were beta-testing our educational game. We want to hire engineers who are excited by helping kids learn, and creating similar reactions to the one above on a scale of millions of kids. We're building web and mobile software that makes a significant difference in the lives of its users.<p>More info:\n<a href=\"http://quizlet.com/jobs/\" rel=\"nofollow\">http://quizlet.com/jobs/</a>","time":1335893423,"type":"comment"},{"by":"kaib","id":3915175,"parent":3913997,"text":"Tinkercad (<a href=\"http://tinkercad.com\" rel=\"nofollow\">http://tinkercad.com</a>) INTERN - Mountain View and Helsinki<p>The first cloud based solid CAD in the world, we are changing the world as part of the digital manufacturing revolution. Super easy interface, usable by people aged 8 and older.<p>We are looking for engineers in Helsinki. Algorithmic backend, frontend and between. Javascript, Go and low level C for the optimized bits.<p>Senior marketing and customer acquisition folks welcome in Mountain View, specifically if you have strong B2C and SAAS experience.<p>If you are interested mail me at kai@tinkercad.com","time":1335890246,"type":"comment"},{"by":"nhance","id":3914725,"parent":3913997,"text":"Reenhanced - <a href=\"http://www.reenhanced.com/\" rel=\"nofollow\">http://www.reenhanced.com/</a><p>Quakertown, PA - Full time Ruby on rails<p>We build software that just works using Ruby on Rails. We're looking for another team member who enjoys a real work life balance to come work on Rails apps and become a better programmer with us.<p>We utilize a really great development process that ensures all of our code is internally reviewed and fully tested before it ever makes it to a production server. This helps us sleep well at night and we rarely have to deal with emergencies.<p>Send me an email at nhance@reenhanced.com","time":1335885474,"type":"comment"},{"by":"kdehne","id":3914780,"parent":3913997,"text":"Charleston, SC<p>When was a last time that a day at the office was accompanied by the satisfaction of knowing that you did something to change the world? For us at Blackbaud, that’s an average day. We’re developing the solutions that help non-profits focus on what they do best; whether that’s saving the environment, educating children or solving the world’s major health concerns.<p>We are hiring User Experience Designers, Software Engineers, QA Engineers, and Product Managers.   <a href=\"http://blackbaud.submit4jobs.com/\" rel=\"nofollow\">http://blackbaud.submit4jobs.com/</a>","time":1335886025,"type":"comment"},{"by":"blo","id":3914619,"parent":3913997,"text":"San Francisco, CA (SOMA) - Mobile / Front-end engineers, Full-stack (node.js) engineers - Full time / intern<p>Stealth - consumer web and mobile<p>--<p>We are a unlaunched, funded startup focused on improving how people fundamentally browse and interact with online services.  Our new web-based experience combines UI/UX innovation with data algorithms to allow users to accomplish tasks in a more usable, efficient, and social manner.<p>We work mainly with JS (jquery and node.js) and HTML5. Mobile developers should be familiar with iOS/Android.<p>Curious? Contact [my username] at alum.mit.edu. Including your portfolio is preferable!","time":1335884468,"type":"comment"},{"by":"hswolff","id":3914026,"parent":3913997,"text":"GetGlue - <a href=\"http://getglue.com/\" rel=\"nofollow\">http://getglue.com/</a><p>New York, NY - Fulltime<p>GetGlue is the leading social network for entertainment. Users check-in and share what they are watching, listening to and reading with friends; get fresh recommendations, exclusive stickers, discounts and other rewards from their favorite shows and movies.<p>Looking for:<p>Python Engineer <a href=\"http://getglue.com/jobs/python_engineer\" rel=\"nofollow\">http://getglue.com/jobs/python_engineer</a><p>Mobile Engineer <a href=\"http://getglue.com/jobs/mobile_engineer\" rel=\"nofollow\">http://getglue.com/jobs/mobile_engineer</a>","time":1335876303,"type":"comment"},{"by":"baudehlo","id":3914708,"parent":3913997,"text":"Hubdoc is hiring in Toronto, ON.<p>We are looking for a great Javascript developer, with good front end experience, will train in Node.js. We are pre-launch, and looking for a top guy to join the team at the ground floor.<p>The team consists of a two founders with great previous startup experience, and myself - a long time open source hacker (I created Haraka, the mail server now used by Craigslist, was one of the original hackers on SpamAssassin, and have done many projects in between those).<p>No hoops to jump through, just email me directly and attach your CV/Résumé: matt@hubdoc.com","time":1335885342,"type":"comment"},{"by":"avar","id":3914205,"kids":[3925914],"parent":3913997,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there currently working on search and relocated over there about a year and a half ago, and have been very happy with it.<p>We have people from all over the world relocating to work with us and are very well set up to handle relocation and visa issues, most of the people working in IT are expats so we've got a lot of experience with bringing people in.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline (PCLN) group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.<p>We use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it.<p>We're also very open to open sourcing code that doesn't contain any business logic, I've personally been involved in open sourcing a few of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and a few CPAN modules.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers. Everything we do is aimed at solving problems for our customers, if it doesn't help our customers we're not interested in doing it.<p>You don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before. The sort of people we'd like to hire are good technically, excellent at communication, and can acquire a good sense of how they fit into the big picture.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume, I've posted in a similar thread here a couple of times before and have already helped get one person hired, many others have had or are having interviews, and I've fielded a bunch of questions from would-be applicants. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent.","time":1335879083,"type":"comment"},{"by":"j_bear","id":3914358,"parent":3913997,"text":"Stitch Fix is in San Francisco at 3rd and Market.  Full-time candidates only, local preferred strongly over remote, relocation possible for the right candidate.<p>Stitch Fix is a totally new way to shop -- check out our video (<a href=\"http://bit.ly/GSelpp\" rel=\"nofollow\">http://bit.ly/GSelpp</a>) for a quick introduction to our service. Here's how we do it: Our clients provide us with details about their size and personal style. Once a month they are offered a Fix: for a $20 styling fee we hand select 5 items using a combination of our proprietary styling algorithm professional stylists and send it to their home. If a customer chooses to buy one or more pieces, the $20 styling fee is a credit toward their purchase. Lots of additional detail is available in our faq (<a href=\"http://bit.ly/JaVIM6\" rel=\"nofollow\">http://bit.ly/JaVIM6</a>).  Our clients love the service and the business is exploding. We have thousands of paying clients, business doubled from November to April, will double again by September, and we will grow faster in 2013. We just raised our Series A from top-tier VC firm to invest in scaling engineering, operations, and merchandising -- which is where you might come in.<p>We are building the team that is going to take us to 10x by the end of next year. We are looking for folks that get super excited about jumping in the deep end, building outstanding products, and delighting clients. In Engineering we're big fans of Continuous Deployment, Specializing Generalists, and people that know the difference between hacking together technology and consistently delivering world-class products. We like people that take their work seriously but aren't serious at work. We believe the best products are delivered when engineers are empowered to solve problems, involved in how the business works and have a clear connection to their customer. The engineering team is currently a data and analytics engineer, a front end engineer/designer, and a generalist engineer. We are in the process of moving from a Linode/Django/jQuery architecture to AWS/Rails/(ember|backbone|similar) and beyond that we have <i>lots</i> of new products to build and will need to incorporate a bunch of new technology to get there.\nWe are looking for 2 more great generalist engineers, ideally with Rails experience but it's not a requirement.<p>If you're interested please send an email to jobs@stitchfix.com.","time":1335881464,"type":"comment"},{"by":"roobeast","id":3915450,"parent":3913997,"text":"San Francisco, CA (Downtown) - Trulia<p>Like working with data?  Forming it into useful visualizations or making it searchable?  \nWe're hiring on the front end and the back end.  Have experience with Solr?  Hadoop?  Jquery? IOS?  Want to work on interesting problems, leverage open source, launch features and have ownership?  \nWe are a great size, not so big you'll go unnoticed, not so small you wonder about the business model.<p><a href=\"http://www.trulia.com/about/careers/Engineering\" rel=\"nofollow\">http://www.trulia.com/about/careers/Engineering</a>","time":1335893411,"type":"comment"},{"by":"mattsears","id":3914428,"parent":3913997,"text":"Littlelines (<a href=\"http://littlelines.com\" rel=\"nofollow\">http://littlelines.com</a>) is looking for front-end and Ruby/Rails developers to work with us in our spanking new headquarters in Ohio.<p>You'll have the opportunity to learn, hone your skills, and contribute valuable work to real projects.<p>We work exclusively on Rails web applications, so some familiarity with Rails views and how a Rails project is set up is a plus. Ideal candidates will be able to work with us at our headquarters.<p>If you're interested please send an email to jobs@littlelines.com","time":1335882149,"type":"comment"},{"by":"alexpoon06","id":3915640,"parent":3913997,"text":"NYC, NY (midtown) - Visual Revenue<p>We use predictive analytics to help media companies like Forbes, InStyle, and Comcast optimize their content arrangement. We built a decision support system to help the editorial team figure out what content to promote, when, and where.  Here are what the press has to say about us.<p><a href=\"http://www.fastcompany.com/1787107/visual-revenue-dennis-r-mortensen\" rel=\"nofollow\">http://www.fastcompany.com/1787107/visual-revenue-dennis-r-m...</a>\n<a href=\"http://thenextweb.com/media/2012/01/27/data-dollars-the-death-of-the-printing-press-doesnt-mean-the-death-of-the-press/\" rel=\"nofollow\">http://thenextweb.com/media/2012/01/27/data-dollars-the-deat...</a>\n<a href=\"http://www.betabeat.com/2012/01/26/is-it-possible-to-predict-pageviews-15-minutes-into-the-future-1-7-m-for-visual-revenue-says-yes/\" rel=\"nofollow\">http://www.betabeat.com/2012/01/26/is-it-possible-to-predict...</a><p>We are primarily a python and JS house.  We are a team of 15 with 8 of us part of engineering.  We are looking to add a few more front end engineers and an UI/UX designer to the team.  Perks include free-gym membership <a href=\"http://visualrevenue.com/aboutus/jobs/free-gym-membership\" rel=\"nofollow\">http://visualrevenue.com/aboutus/jobs/free-gym-membership</a> and stunning office view of downtown Manhattan.<p><a href=\"http://visualrevenue.com/aboutus/jobs\" rel=\"nofollow\">http://visualrevenue.com/aboutus/jobs</a>","time":1335895745,"type":"comment"},{"by":"zinxq","id":3920611,"parent":3913997,"text":"Refresh.io - Palo Alto - Full Time Developers<p>You're a crack-shot software engineer. Not necessarily because of where you went to school, but because simply put - you love this stuff. You know at least one mobile/web-related computer language cold. Whether it's Objective-C, Ruby, Java Javascript, or others - we're not too concerned about which one because no matter which one (or ones) we end up using, you'll not only be able to pick it up fast, you'll be excited about doing so.<p>You understand the latest technology. From NoSQL to Backbone to Node.  You aren't technically religious and gain as much satisfaction in picking the right tool for the job as you do implementing it.<p>You've built stuff. Web sites. Mobile apps. Whatever. You can show us. You can't wait to show us. You're not only excited of the what users can do with it, you're proud about how it's implemented and to a technical audience, you can't wait to talk about it.<p>As part of the first engineering team, you're excited by the prospect of working with smart people. Because you're smart and you know it - and you know that working with other smart people simply makes you better (all the while making them better too). As a bonus, being part of this initial team gives you the opportunity to strongly affect future engineering hires - insuring the caliber of the team.<p>You live within commuting distance to Palo Alto, CA or are willing to relocate (paid).<p><a href=\"http://www.refresh.io/jobs\" rel=\"nofollow\">http://www.refresh.io/jobs</a>","time":1335985551,"type":"comment"},{"by":"factortree","id":3929579,"parent":3913997,"text":"Factor Tree - New York, NY<p>We're an e-Learning startup that targets a very specific problem and demographic: teaching math to kids preK - 6th grade. There's a huge problem with the way kids in the US learn math: lack of basic arithmetic fundamentals. We want to fix this problem using an alternative East meets West adaptive curriculum, and we could use your help.<p>We're a NYC startup, a bit different from the Silicon Valley boys, more results oriented, less fluff and you can bet that everyone on your team is as talented and driven as you. We have awesome proprietary technology and architecture that's going to make a huge impact on math e-Learning and are already working with several schools, organizations, and private consumers. They agree what we have works.<p>This is your chance to \"do good by doing good\"-- get competitive compensation, cash + equity, and make a real difference in the world.<p>Like everyone and their grandmothers, we're looking for talented engineers, Javascript/PHP/AJAX/MySQL. Bonus points if you're UX oriented and have a keen eye for cool design or hopped on the iOS SDK early and are a guru at objective C.<p>You gotta be laid back, we're all going to be spending long hours together and don't want to work with anyone too high strung. After all, most of the times you'll need to see problems from a child's perspective.<p>If this sounds like something you're interested in, tell us why and send your resume/portfolio to recruiting@thefactortree.com with HN in the subject title.<p>www.thefactortree.com","time":1336154966,"type":"comment"},{"by":"LauraSeeker","id":3929448,"parent":3913997,"text":"Seeker Solutions - Victoria, BC and Vancouver, BC - Canada<p>At Seeker Solutions, we build solutions to real-world business issues using natural language processing and machine learning. Our development teams support existing solutions, build new projects and enhancements, and research cutting-edge natural language processing techniques. As we expand our client base into several new industries, we're undergoing a major growth stage.<p>We're currently hiring the following positions:\n* Director of Software Development [Victoria]\n* Software Development Team Lead [Victoria]\n* Software Architect [Victoria]\n* Software QA Analyst [Victoria]\n* Senior Software Developer [Vancouver]\n* Intermediate Software Developer [Vancouver]\n* System Operations Engineer [Vancouver]<p>We are primarily Java-based, with heavy use of Hadoop/HBase, although our research team mostly works in Python, and our processes are fairly agile. Our offices are full of happy people who enjoy awesome perks (Nerf gun fights, bringing dogs to work, gym memberships, a well-stocked kitchen, plus more) and are passionate about what they do. If you're not in our area and are open to moving, Victoria and Vancouver are beautiful cities, boasting vibrant cultural scenes and nearby locations for skiing and surfing.<p>If you're ready to help shape the future of our company and bring new NLP solutions to market, please check the full job postings and apply online via <a href=\"http://seekersolutions.com/careers\" rel=\"nofollow\">http://seekersolutions.com/careers</a> -- feel free to contact me (laura.bowles@seekersolutions.com) if you have any questions.","time":1336153041,"type":"comment"},{"by":"sbisker","id":3916465,"parent":3913997,"text":"Cambridge, MA / San Francisco, CA - Full Time or Intern\nWeb Developer at Locu (<a href=\"http://www.locu.com\" rel=\"nofollow\">http://www.locu.com</a>)<p># Exceptional software engineering talent<p># Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills, or the ability to learn quickly<p># Experience with Python / Django is a plus<p># Previous experience building rich, interactive websites<p># Basic design skills (Photoshop), ability to work with designers<p># Experience in designing dashboards and user interfaces is a plus<p># Previous start-up experience is a plus<p>Front-enders, \"desingineers\" and full-stack all welcome for this position - as long as you enjoy hacking on cool new products and features. :D (We're not explicitly recruiting for pure backend or pure design positions right now, but we're open to resumes there as well - see <a href=\"http://locu.com/#jobs\" rel=\"nofollow\">http://locu.com/#jobs</a> for details. If you're a perfect fit, we'll find a way to make it work.)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We are about to launch MenuPlatform &#60;<a href=\"http://www.menuplatform.com&#62;\" rel=\"nofollow\">http://www.menuplatform.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>Interested? Drop us a line at jobs@locu.com. Please specify which position you're applying for, as well as \"HN\", in the subject of your letter. Learn more about our open positions at <a href=\"http://www.locu.com/#Jobs\" rel=\"nofollow\">http://www.locu.com/#Jobs</a><p>-------------------------------------<p>Founded less than a year ago by MIT graduates and researchers, Locu &#60;<a href=\"http://www.locu.com&#62;\" rel=\"nofollow\">http://www.locu.com&#62;</a>; has the backing and support of some of the best angel investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 10 people with very diverse backgrounds, and growing.","time":1335907880,"type":"comment"},{"by":"pmjoyce","id":3914860,"parent":3913997,"text":"Geckoboard -- London, UK -- FULLTIME<p>Several positions including:<p>Software engineers x 3<p>Interface Designer<p>More details at <a href=\"http://jobs.geckoboard.com/\" rel=\"nofollow\">http://jobs.geckoboard.com/</a> or ping me a mail at paul@geckoboard.com","time":1335886812,"type":"comment"},{"by":"vduquette","id":3914848,"parent":3913997,"text":"Toronto, Canada\nRails developer\n<a href=\"http://sprouter.com\" rel=\"nofollow\">http://sprouter.com</a><p>We are working on a big launch this summer involving live video. Looking for a rails dev looking to take on a big role. We only have two developers right now and are looking to add a third. You will have a big say in product design and will play with the newest tech out there. Rails 3, HAML, jquery, websockets, redis - all the good stuff. Hit me up: vince@sprouter.com for more info.","time":1335886703,"type":"comment"},{"deleted":true,"id":3930148,"parent":3913997,"time":1336162611,"type":"comment"},{"by":"urlwolf","id":3919828,"parent":3913997,"text":"Fluidshopping - Berlin - Fulltime - CTO<p>We are a Berlin-based startup working on next-generation testing and user experience. At Fluidshopping, we want to make split testing easy for web shop owners.<p>This includes test that change the business rules, not the GUI. For example, you may want to test if sending a $10 voucher to those who buy &#62;$50 will have an effect on chance of repeated buy. Or you want to test the effect of free shipping when they bought &#62;$100. As far as we know, these tests are not easy without tinkering with the current shopping cart software setup. We want to make this as easy as testing the GUI and UX elements (design, copy).<p>We use lean startup methods, and can systematically test hypotheses on any market. Our approach is the ‘startup of startups’, that is, iterate fast and discard what doesn’t work, even if the new product looks like a completely new application (and startup!). We have runway for a year. We are two people, and have been funded for only two months. We have offices in Berlin, but we often work from home.<p>We are looking for a technical cofounder (CTO) to disrupt the ecommerce analytics market with us and to receive a forthcoming EXIST schoolarship (2000-2500€/person/month) for one year. We are two people, one of us is technical, with a PhD in machine learning.<p>Responsibilities:<p>Your responsibilities will be to work on new key features, help us scale, contribute to the product and optimize performance. You’ll be the CTO in an agile development environment. The job offers lots of challenges because we build a real-time collaborative tool in a large market that is ripe for disruption.<p>As the CTO, you set the technology. Our current MVP is Django. We need to interface with shopping carts, and when the API is not enough, that means some PHP may be unavoidable.\nWhat we like:\n- node.js\n- Mongo or similar NoSQL db\n- jQuery\n- JavaScript\n- python/django\n- Backbone.js\n- Familiarity with HTML5 (websockets)<p>Perks:\n- Work from home as much as you want\n- … but have a nice office, with terrace and BBQ\n- Stock options in two-digit range\n- Dog\n - In the center of the Berlin startup ecosystem (we organize events such as demodinner)<p>For more see <a href=\"http://fluidshopping.com/blog/about-fluidshopping/\" rel=\"nofollow\">http://fluidshopping.com/blog/about-fluidshopping/</a>","time":1335975331,"type":"comment"},{"by":"proximiant","id":3914360,"parent":3913997,"text":"Proximiant - Mountain View, CA [Relocation, H1B welcome]<p><a href=\"http://www.proximiant.com\" rel=\"nofollow\">http://www.proximiant.com</a><p>NFC Digital Receipts service that allows shoppers to get a picture perfect receipt beamed directly to their phone without sharing their email. We use AWS, Django, C#, C++, Android, and iPhone.<p>We're seeking bright engineers. During an interview, you will do coding -- actual coding sitting at a machine and writing and testing your code.<p>Come help us build a great company! Email jobs@proximiant.com","time":1335881474,"type":"comment"},{"by":"jzoidberg","id":3915991,"parent":3913997,"text":"Sunnyvale and San Diego CA<p>Front-end UI Developer<p>GridX - we are a well funded startup developing a unique new application to operate the next generation smart electricity grid.<p>Help us solve some of the most complex and rewarding energy and environmental problems of our time using Big Data and Cloud Computing.<p>We use Scala based web frameworks like Liftweb and Play! - experience with or interest in those would be a plus.<p>Our UI's use highly interactive HTML5 with WebSockets and Server Side Events. Rendering in SVG and Canvas.<p>Please contact johan at gridx dot com","time":1335900361,"type":"comment"},{"by":"martian","id":3915298,"parent":3913997,"text":"Software Engineer - San Francisco, CA - Thumbtack<p>We're looking for full time software engineers, mobile engineers, and interaction designers.<p>Our delicious company food culture has been featured on Inc.com and inspires many Bay-area startups. We eat family style meals everyday cooked in-house by our gourmet chef.<p>We recently raised a Series A and are growing rapidly. Over 250,000 small businesses have already signed up.<p>We can offer visas if you live abroad and are willing to relocate.<p>thumbtack.com/jobs or email chris at thumbtack.","time":1335891506,"type":"comment"},{"by":"m3talacorn","id":3915390,"parent":3913997,"text":"Amazon - Seattle, Silicon Valley - Full-time\nSoftware Development Engineer - Cyber Analytics<p>Desired Skills &#38; Experience\n- Invention is in your DNA\n- Desire to solve problems that have no textbook solution\n- Strong proven ability in building high-performance, highly-available and scalable distributed systems.\n- Design and coding skills in some language on some OS platform.\n- Experience with object oriented design and development.\n- Data exploration and data modeling skills.\n- A thought leader<p>Cyber Security is a great domain to work in. It is also challenging. Adversaries only have to be lucky once to be successful. You, should you join, have to be smart/creative/insightful all the time.<p>Cyber Analytic Software Engineers love to build and live to explore data. Our engineers are constantly leveraging AWS technologies trying to get more insights to protect our most critical assets in our rapidly changing environment.<p>Our systems and algorithms operate on one of the world's largest cyber data sources and it is quite routine for our systems to operate on [TOP SECRET] scale datasets using distributed frameworks such as Apache Hadoop(Map/Reduce) and other open source technologies such as Lucene.<p>We consistently strive to ensure the security and integrity of our customers data.","time":1335892642,"type":"comment"},{"by":"amykhar","id":3915529,"kids":[3929225],"parent":3913997,"text":"Philadelphia area, Full Time Junior Web Application Developer, No remote. No recruiters.<p>Are you an energetic, smart, hard working developer looking to make a difference? We are the place for you. Our company is at the forefront of the emerging sleep industry. We are the leading Sleep EMR company and have a backlog of projects and ideas being asked for by our customers and employees.<p>We currently need a junior web application developer. We use PHP, JQuery and MySQL, but if you are a whiz at some other web programming language, we are willing to teach the right person to use our languages of choice.<p>Here are some awesome things about our company: We are an employee and customer focused business with benefits like - we offer flex time, Christmas week off and, every other Friday, our developers get to spend time working on things that motivate and interest them.<p>If you are an A player looking for an A company you have found your spot. We are offering a package that could pay as much as $70k for the right person. This is not a remote position, and we are not offering a relocation package at this time.<p>Actual candidates only please. No recruiters.<p>SleepEx is the leading provider of software for the Sleep Lab Industry. We are a small team, about 13 people. We dress casually, and work very hard.","time":1335894405,"type":"comment"},{"by":"vtrac","id":3935243,"parent":3913997,"text":"Austin, TX / NYC, NY / London, UK<p>Bazaarvoice is hiring for a bunch of positions - big data software engineers, front-end engineers, DevOps, etc. Ping me for more info.<p>Here's the DevOps spec:<p><i>Who We Want</i>: Bazaarvoice serves traffic on some of the biggest websites on the internet. Every day our content is served to tens of millions of people making tens of thousands of requests per second, resulting in tens of thousands of gigabytes of traffic. Our request logs alone add up to almost 1TB daily. If the thought of doubling these numbers excites you, we'd love to hear from you.<p><i>Responsibilities</i>: \n * Develop internal tools and processes to maintain stability and performance of our infrastructure  \n * Work with Development teams to build applications in an Operationally sustainable way \n * Design cross-datacenter, world-wide systems with a high availability mindset \n * Research, analyze and propose new technology solutions for Bazaarvoice's infrastructure \n * Make things go faster<p><i>Skills and Experience Necessary for the Role</i>: \n * Bachelor's degree in CS, EE or MIS; or equivalent experience \n * 5+ years experience with LAMP development/administration \n * Hands-on scripting with shell &#38; Python/Ruby/Perl \n * Thorough understanding of TCP/IP networking &#38; DNS \n * Excellent project management, communication, prioritization and analytical skills \n * Strong customer service mindset<p><i>Technologies</i>: \n * Linux \n * Tomcat \n * Solr/Lucene \n * MySQL \n * Amazon Web Services (EC2, S3, VPC)<p><i>Bonus experience</i>: \n * Puppet/Chef \n * Hadoop/BI/Big Data \n * Cassandra\n * OpenStack/Eucalyptus \n * Open source contributions","time":1336316208,"type":"comment"},{"by":"mpakes","id":3916405,"parent":3913997,"text":"CoffeeTable - San Francisco - Full time, local.<p>At CoffeeTable (<a href=\"http://www.coffeetable.com\" rel=\"nofollow\">http://www.coffeetable.com</a>), we’re combining the best parts of commerce, catalog shopping, and tablet devices to create truly inspiring shopping experiences. Whereas the ecommerce giants like Amazon and EBay are all about searching and comparing technical specs, we’re putting the fun back into shopping. Discover products, shop with friends, and get that same special feeling when you walk into a store and they know your name, your size, and exactly what you’d like but didn’t know it.<p>Referral Bonus: Refer a candidate that we hire, and win a new, top-of-the-line iPad 3! (64GB, Wi-Fi + 4G)<p>Looking For:<p>* Senior iOS developers<p>* Server-side developers (CT is a Rails shop, but love Python/Django devs too)<p>* Front-end web developers<p>CoffeeTable is a small team (2 developers) looking to grow in a big way. New hires will have a huge opportunity to make a big impact across the board, from product direction, to design, to architecture.<p>Well funded ($2.5MM Series A from Strategic Partners in the catalog industry) and located right across from AT&#38;T Park in San Francisco.<p>See <a href=\"http://www.coffeetable.com/jobs\" rel=\"nofollow\">http://www.coffeetable.com/jobs</a> for more info.","time":1335906983,"type":"comment"},{"by":"5vforest","id":3930163,"parent":3913997,"text":"GovHub (<a href=\"http://www.govhub.org\" rel=\"nofollow\">http://www.govhub.org</a>) is looking for a full-stack Rails developer to lead our team in Berkeley, CA.<p>GovHub is an online platform that aims to revolutionize the way we consume political information and how we use that information to impact policy development, without the interference of big organized interests.<p>We launched our initial product in late February, and now we’re preparing to embark on a new project, one that will help citizens to get their voice heard by the government officials who matter most. We’re looking for an experienced Ruby on Rails developer to spearhead this newest iteration of our site, which will include rewriting some of our current functionality as well. (We’re currently built on Symfony 1.4.)<p>What we’re trying to build isn’t simple, but we’re confident that with the experience of having built most of it before, and with a venerable and well-rounded developer to take the reins on the project, we’ll be able to do it well, do it quickly, and make a real impact on the space.<p>About us: we’re young, inexperienced, and extremely committed to this company. Currently we’re just one CTO/developer and one CEO/bizdev guy, with a few other folks helping out peripherally. Ideally, you’d be as passionate about the product as we are, and would want to join us in a full-time role. For the right person, we can offer a competitive salary, equity, and a chance to make this project as much of yours as it is ours.<p>Get in touch: abecker AT govhub DOT org.<p><a href=\"http://blog.govhub.org/post/22396376388/govhub-is-looking-for-a-full-stack-rails-developer-to\" rel=\"nofollow\">http://blog.govhub.org/post/22396376388/govhub-is-looking-fo...</a>","time":1336162729,"type":"comment"},{"by":"jefflcap","id":3956443,"parent":3913997,"text":"Captricity - Berkeley, CA - Full-time (relocation assistance avail.)<p>Captricity is seeking a Chief of Technical Staff.<p>Captricity allows anyone to turn paper-based data into structured electronic data. Our vision is to bridge the physical and electronic worlds of data. The genesis of the company comes from research on how technology can improve the efficiency of low-resource organizations around the world.<p>We’re an early stage startup comprised of industry veterans and UC Berkeley Phd grads, combining cutting-edge research with proven skills in product design. We’re backed by some of Silicon Valley’s best investors and firms, tackling a huge problem with tremendous social and economic potential impact.<p>We’re looking for a proven technical leader who can lead a team of engineers to success; someone who can sling code with the best of them but wants broader scope and wants to make an impact — a really big impact.<p>We combine machine learning, computer vision and crowdsourcing to provide a seamless bridge between the offline and online worlds. You’ll help lead us in building and scaling out our technology, product, and business.<p>You: ambitious, technical leader, adept at managing both the technology and the people behind it. You’ll work with the company leadership on a regular basis; actually, you are part of the company leadership .<p>You’ll play a big part in creating and executing the company’s engineering and product roadmaps. Just as important, you’ll help define the engineering culture of the company and help us change the world. How often do you get to do that?<p>More details: <a href=\"http://captricity.com/jobs/#CTS\" rel=\"nofollow\">http://captricity.com/jobs/#CTS</a>","time":1336688503,"type":"comment"},{"by":"nscharhon","id":3916639,"parent":3913997,"text":"Seattle, WA - Pariveda Solutions (full-time)<p>At Pariveda Solutions we focus on The Business of IT®, helping our clients improve their bottom line through information technology strategy and solutions.  Our goal is to be the #1 privately held IT consulting firm in the world, striving to build long-term relationships with clients where partnership is a centerpiece.  Our mission is to incubate, develop and deploy world-class talent in service to our clients.<p>The Pariveda Opportunity:<p>As a Pariveda Associate, you will work on small project teams to deliver solutions to our customers:<p>•\tOn most of your projects you will work directly with our clients:\no\tTo understand and document their business and technology requirements.\no\tTo design, code and test technology solutions. \n•\tOn IT strategy or process projects, you will be a member of a team with more senior Pariveda consultants. You will work with many technologies and work as an IT visionary for the client.  \n•\tOn some projects, you may be a team lead for one or more consultants.\n•\tYou will be involved in building Pariveda by participating in intellectual capital development, training, recruiting, and business development.\n•\tYou will work mostly with local clients as a part of our geographic model, minimizing travel requirements.\n•\tYou will work alongside some of the sharpest developers to improve your technical and consulting skills.<p>This is an exciting opportunity to help build our fast growing national consulting company, your career, as well as the careers of others.<p>Candidates must meet the following requirements:<p>•\tThree to seven years of consulting or related experience\n•\tExperience as a team lead or senior developer\n•\tExperience  in one or more technologies:\no\t Java / J2EE\no\tMicrosoft.NET\no\t Business Intelligence Technologies\no\tASP.net\no\tSQL\no\tAJAX\no\tJavaScript\no\tHTML\no\tCSS\n•\tExperience working with clients or customers\n•\tExperience with multiple phases of the SDLC\n•\tAbility to read and understand technical documents written in English, with good communication skills on email and phone conferences\n•\tAbility to share knowledge and expertise with other Pariveda software developers\n•\tStrong analytical thinking and problem solving skills\n•\tStrong written and oral communication skills\n•\tBachelor’s Degree in MIS, Computer Science or Comparable major\n•\tLegally authorized to work for any company in the United States without sponsorship","time":1335911042,"type":"comment"},{"by":"aviflax","id":3914769,"parent":3913997,"text":"NYC, remote friendly<p>Arc90 is hiring an experienced Web application developer. We need a developer with a deep understanding and appreciation of the Web, with experience designing and building server-side solutions. The ideal candidate would be proficient with both Java and C# and open to learning and mastering a new language.<p><a href=\"http://arc90.com/jobs/web-application-developer/\" rel=\"nofollow\">http://arc90.com/jobs/web-application-developer/</a>","time":1335885898,"type":"comment"},{"by":"jnelson5","id":3920747,"parent":3913997,"text":"Mountain View CA, Full-Time, Web Application Engineer<p>Luminate.com is seeking an engineer with a strong background in web application development and implementation. As a member of the web applications group you will get to work on our core front end product as well as help design and implement our next generation products. We are changing the way people interact with images online and here is your chance to help push that vision to the next level. Come work at one of the hottest silicon valley startups along side veteran engineers and architects from Netscape, TellMe, LiveOps, and Digg and backed by top tier VC's and Google.<p>Required experience and knowledge:<p>* Experience in professional software web apps development (start-up environment preferred)<p>* Open source contributor is a big plus.<p>* Expert knowledge with HTML, Python (or Ruby), Javascript, JQuery, CSS<p>* Strong sense of design and end user experience<p>* Highly creative individual<p>* Proven experience in development of cross browser compatible web applications<p>* Excellent communication skills<p>* Ability to work in a fast paced, collaborative and iterative programming environment<p>Contact: john@luminate.com -or- <a href=\"http://hire.jobvite.com/j/?cj=ogXMVfwE&#38;s=HackerNews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=ogXMVfwE&#38;s=HackerNews</a>","time":1335987449,"type":"comment"},{"by":"nixme","id":3915107,"parent":3913997,"text":"San Francisco, CA - Do (<a href=\"http://do.com/jobs\" rel=\"nofollow\">http://do.com/jobs</a>)<p>Do is on a mission to build the best tools for small teams and businesses across the world.<p>We're hiring developers and designers for backend + frontend web, and mobile (iOS and Android).<p>Tech: Ruby. Lots of Javascript/Coffeescript. Backbone. PostgreSQL, Redis, Solr. iOS. Android.<p>And we're a Salesforce company. Solid funding, great benefits, competitive comp.<p>I'd love to chat if you're interested - gopal@do.com","time":1335889583,"type":"comment"},{"by":"rory_k","id":3918433,"parent":3913997,"text":"Priory Solutions - London, UK - Junior Developer<p>We're expanding and need a talented and keen Junior Developer with Javascript and C# skills to join our team. You'll implement features, solve issues, fix bugs, write tests, and become expert in our products.<p>If you<p>- Have 0-3 years dev experience with strong Javascript &#38; C#<p>- Enjoy writing solid code, solving problems, fixing bugs, writing tests, delivering value<p>- Want to work at a small innovative software company<p>- Are awesome<p>then drop me an email rory.kingan@priorysolutions.com","time":1335956465,"type":"comment"},{"by":"steilpass","id":3915989,"parent":3913997,"text":"Agile Software Developers in Cologne, Germany.<p>Although we have been bought we still feel and work like a startup. We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://adkla.us\" rel=\"nofollow\">http://adkla.us</a>","time":1335900344,"type":"comment"},{"by":"GavinB","id":3914410,"parent":3913997,"text":"New York City / NYC<p>Assistant Project Manager - help us design \"subversively educational\" games for kids. One part game designer, one part project coordinator, one part community manager. Can be entry level, but any experience in games, web, or mobile spaces a plus.<p><a href=\"http://www.careerbuilder.com/JobSeeker/Jobs/JobDetails.aspx?job_did=J3G2WR72G5KL4P511HX\" rel=\"nofollow\">http://www.careerbuilder.com/JobSeeker/Jobs/JobDetails.aspx?...</a>","time":1335881972,"type":"comment"},{"by":"fishpi","id":3914642,"kids":[3916149],"parent":3913997,"text":"Santa Clara, CA, USA -\nLondon, UK -\nBangalore, India<p>Arista Networks is looking for software engineers, hardware engineers and software interns (as well as a bunch of other positions I probably don't know about). We are a fast-growing pre-IPO company that produces high-performance datacenter ethernet switches.<p>More information at <a href=\"http://www.aristanetworks.com/en/careers\" rel=\"nofollow\">http://www.aristanetworks.com/en/careers</a>","time":1335884712,"type":"comment"},{"by":"mikeinterviewst","id":3915138,"parent":3913997,"text":"InterviewStreet (<a href=\"http://interviewstreet.com\" rel=\"nofollow\">http://interviewstreet.com</a>) - Mountain View and Bangalore<p>Programmers for frontend, backend, and project management roles. Our hacker team is 5 strong, so you'll be tackling a huge variety of projects. Help fix a horribly broken hiring world by creating the best platform for addictive programming problems and tutorials.<p>team+mv or team+blr at interviewstreet dot com","time":1335889914,"type":"comment"},{"by":"app","id":3916713,"parent":3913997,"text":"New York, NY / San Francisco, CA (mobile devs only)<p>VIMEO -- vimeo.com/jobs<p>Looking for:<p>PHP App Engineers<p>Backend Engineers (<a href=\"http://bit.ly/JLMR3C\" rel=\"nofollow\">http://bit.ly/JLMR3C</a>)<p>Designers (<a href=\"http://bit.ly/InBF0T\" rel=\"nofollow\">http://bit.ly/InBF0T</a>)<p>QA Engineers (<a href=\"http://bit.ly/KsY3BA\" rel=\"nofollow\">http://bit.ly/KsY3BA</a>)<p>Mobile Engineers (to be posted soon)<p>Mobile Designers (to be posted soon)<p>Stuff we use: PHP, Python, MySQL, Mongo, Redis, AWS, Solr, Hadoop, nginx, node. And pretty much any mobile platform.","time":1335912598,"type":"comment"},{"by":"sameersegal","id":3915470,"parent":3913997,"text":"Bangalore, India - Artoo: www.artoo.in<p>We are using Android &#38; Cloud for low literate, first technology users at the base of the pyramid to help businesses become more effective in alleviating poverty! We work on Play! framework, Nginx, AWS, Android, WebSockets and more ...<p>We are looking for Android, Cloud engineers, data scientists, artists. We are also open to creating a role if you can convince us!<p>Drop me a line at sameer[at]artoo[dot]in","time":1335893635,"type":"comment"},{"by":"kittkat","id":3943842,"parent":3913997,"text":"Boston, MA- Jana's hiring: Full-Stack Web Developers, Web Development Interns, Head of Engineering<p>Jana.com is disrupting the advertising and research industry in the developing world. With our mobile platform we enable big players, like the World Bank, The Economist, or Microsoft, to get crucial customer feedback in days instead of months and have consumers test innovative products with the push of a button. We're engaging 2.1 billion people in emerging markets, earning revenue in 50 countries and have raised almost $10M from premier VC investors.<p>Our team bursts with talent from MIT, Harvard, Stanford and Google but we're pretty relaxed, except during weekly Settlers of Catan battles in the office, ice-cream runs on Wednesdays or beer runs every Friday.<p>In short, we're having fun disrupting century old industries through cutting edge mobile technology.<p>Right now we're looking for full-stack web-developers.  So, if you think you could have the same kind of fun come talk to us!<p>You can view all our open positions and apply at: <a href=\"http://jana.com/about-us/careers/\" rel=\"nofollow\">http://jana.com/about-us/careers/</a>","time":1336488308,"type":"comment"},{"by":"minhajuddin","id":3914279,"parent":3913997,"text":"Cosmicvent Software (Hyderabad, India <a href=\"http://cosmicvent.com/contact-us\" rel=\"nofollow\">http://cosmicvent.com/contact-us</a>): <a href=\"http://cosmicvent.com\" rel=\"nofollow\">http://cosmicvent.com</a>\nWe are hiring freshers who like problem solving. We can even train you for a month on the technologies which we use(ruby, rails, mongodb, javascript, backbone)","time":1335880314,"type":"comment"},{"by":"soham","id":3914515,"parent":3913997,"text":"San Francisco Bay Area (Specifically Palo Alto area)<p>Eng-services team at Box.com is hiring (<a href=\"https://github.com/box\" rel=\"nofollow\">https://github.com/box</a>). Fulltime. Relocation/INTERN/H1B ok.<p>Our small team has an outsized impact on the entire engineering team (100+), technical architecture and Enterprise deployments in general. Looking for people specifically interested in this area.","time":1335883228,"type":"comment"},{"by":"topperge","id":3927122,"parent":3913997,"text":"UberEther - Northern Virginia - Full Time Developers<p>We build identity and access management solutions while melding in big data for analytics and real time risk assessment.<p>We're looking for some young, talented developers (0-2 years out of college) who want to change the way applications and data is secured.  We're bringing in 5 junior resources to pair with our current team to build some awesome new solutions for our customers.<p>Due to the nature of our client base you must be a US Citizen and have the ability to obtain a top secret  security clearance.<p>Full benefits all paid for by us, no need to worry. Great salaries and $10,000 bonus once your clearance comes through.  A great opportunity to get into one of the most challenging environments to protect huge amounts of data.<p>We started the company because we were tired of the corporate BS found in most organizations.  We're tryingt o do things differently. (<a href=\"http://uberether.com/about/\" rel=\"nofollow\">http://uberether.com/about/</a>) If you're interested email me at: matt@uberether.com","time":1336108106,"type":"comment"},{"by":"leeny","id":3915243,"parent":3913997,"text":"TrialPay - Mountain View, CA (F/T, will cover relo)<p>TrialPay is hiring back-end generalists.<p>Small eng team. No bureaucracy. Really smart people. Actually making money. aline@trialpay.com<p>Read more about us here: <a href=\"http://allthingsd.com/20120131/visa-places-bet-on-new-approach-to-payments-with-rare-investment-in-trialpay/\" rel=\"nofollow\">http://allthingsd.com/20120131/visa-places-bet-on-new-approa...</a>","time":1335890947,"type":"comment"},{"by":"gsteph22","id":3962306,"parent":3913997,"text":"Drawn to Scale - San Francisco, Distributed Databases<p>www.drawntoscale.com\nJust drop a line to spire@drawntoscale.com<p>We're building Spire, a database for real-time big data. We're building a SQL engine, fulltext search, and more on top of HBase. It's incredibly fun because we get to build a database <i>from scratch</i>, and we get to do some really cool stuff with distributed systems.<p>We’re obsessed with building pragmatic things that work in “the real world” and joining them with the most cutting-edge distributed systems research. We’ve built and run some of the largest companies and infrastructures: Sun, Amazon, Google, Intel, and more. Even the CEO codes almost every day.<p>Engineer: Database Core / Distributed Systems: San Francisco<p>Help our core team build a database from the ground up. Finally, you can do things “the way they should be”. Instead of a db from the 1980′s, we’re creating a platform for modern, real-time applications.<p>Here are some things you may enjoy doing or learning about:<p>-Building query planners and optimizers\n-Compiler design\n-Functional programming (Scala, Clojure, etc.)\n-Distributed systems architecture: failover, replication\n-JVM tuning and performance hacks\n-Turning academic research into reality\n-Resilient systems for the real world\n-Engineer: Operations and Automation: San Francisco<p>Yes, this is a “DevOps” role. If you like coding <i>and</i> systems work, you’re going to enjoy this. You’ll be the one responsible for building clusters that heal themselves and deploy seamlessly in the cloud or customer sites.<p>-Cluster automation\n-Deployment frameworks like Chef, Puppet, CFEngine\n-Building monitoring tools that you enjoy using\n-Upgrading and recovering from failure with no downtime\n-How to make Linux behave\n-Hadoop/HBase/BigTable/other distributed systems\n-And perhaps a bit of UX hackin’","time":1336786565,"type":"comment"},{"by":"schelle","id":3920420,"parent":3913997,"text":"San Francisco, CA - <a href=\"http://www.indiegogo.com\" rel=\"nofollow\">http://www.indiegogo.com</a>: Rails, DevOps and Scalability engineers - Full Time and Internship<p>Indiegogo is hiring all sorts of engineers (and more) to scale out our global crowdfunding platform.  With the signing of the JOBS Act, things are only heating up more and it's a great time to join (for more info: <a href=\"http://www.indiegogo.com/contact/press\" rel=\"nofollow\">http://www.indiegogo.com/contact/press</a>).  We're closing additional funding in order to keep paces with the customer and technical demands of the new frontier of crowdfunding.  In doing so, we're expanding the team and our data-driven approach to empowering anyone, anywhere, to raise money for anything - spanning creative, cause and entrepreneurial projects.<p>Apply by sending an email to: hn-jobs@indiegogo.com (full list of openings: <a href=\"http://www.indiegogo.com/about/careers\" rel=\"nofollow\">http://www.indiegogo.com/about/careers</a>)","time":1335982825,"type":"comment"},{"by":"nealmydataorg","id":3916313,"parent":3913997,"text":"Tool to manage (add. search, modify) Jobs data regarding who is hiring (<a href=\"http://news.ycombinator.com/item?id=3913997\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3913997</a>) can be accessed at\n<a href=\"http://mydataorganizer.com/ycombJobsMay2012.html\" rel=\"nofollow\">http://mydataorganizer.com/ycombJobsMay2012.html</a><p>Please provide feedback.\nThanks,\nNeal","time":1335905599,"type":"comment"},{"by":"amduser29","id":3915415,"parent":3913997,"text":"Life360 - San Francisco<p>Love geolocation? We are processing over 200 million points / day<p>Want to work on something that matters? Over 15 million people are trusting us with their family safety needs.<p>Want to be respected? Work on interesting projects that you have a material impact on and get paid well doing it.<p><a href=\"http://life360.jobscore.com/list\" rel=\"nofollow\">http://life360.jobscore.com/list</a>\nalex@life360.com","time":1335893059,"type":"comment"},{"by":"donohoe","id":3914453,"parent":3913997,"text":"New York, Backend and Frontend Developers, PM, &#38; Design. Full-time.<p><pre><code>  UPDATE: Only job enquires please. \n  I'm not interested in your consulting company services \n  or recruitment agency at this time. Thanks.\n</code></pre>\nI'm hiring for a number of positions for a new global business site from Atlantic Media. We're based in NYC with an office in Soho. Each role is a hands-on position and you will be working closely with other developers on your team and editorial. There is the opportunity to work on a large number of fun and challenging problems as the site and team grow.<p><i>Backend Developer</i> - Expert level Django/Python or WordPress/PHP experience. You will work with other developers to build a solid backend and devise solutions for our unique set of editorial and application needs. Expertise optimizing code for high traffic sites a must (scalability, caching etc).<p><i>Frontend Developer</i> - We're not beholden to any JS framework (yet) but lets assume jQuery as a start point. Emphasis on building solid user experiences and web applications. Focus on new and emerging \"HTML5\" technologies and APIs (localStorage, geo, offline) and a view to mobile first.<p><i>Design</i> - Looking for a strong design lead to work with product and dev (we're all on the same team, literally). You'll be given wide creative voice and actively encouraged to push in new directions as opposed to traditional methods.<p>You’ll be working with other great minds from Atlantic Media, WSJ, NiemanLab, Gawker and many others. The cast is assembling.<p>Interested? You should be. I’m not leaving the West Coast just for the bagels.<p>Take a look at the postings linked below from Atlantic Media’s site.<p>Use those as a guide and feel free to contact me directly:\nmichael@donohoe.io<p><pre><code>  Project Manager\n  http://bit.ly/HT6BGB\n\n  Web Designer\n  http://bit.ly/IyjuA7\n\n  LAMP/Python Developer (refers to Django, Wordpress also good)\n  http://bit.ly/IyjX5r\n\n  Senior Developer\n  http://bit.ly/IyjBvC\n</code></pre>\nGet in touch. Traditional resume is fine but bonus points:<p>- Links to your work on GitHub or other public repos<p>- StackOverflow profile<p>- Links to websites or services where you've had a primary development role.<p>For Design, any work on Dribbble or other portfolio platform is great. Please draw attention to any mobile work or UI ideas you've explored.","time":1335882458,"type":"comment"},{"by":"Nebula_Inc","id":3915228,"parent":3913997,"text":"Nebula - Palo Alto and Seattle - Dev/Ops Automation Engineer - full time devs<p>Nebula is dedicated to enabling all businesses to easily, securely and inexpensively deploy large private cloud computing infrastructures.<p>We are seeking a versatile, well rounded automation engineer to play an integral role in shipping the V1 of our groundbreaking product: The Nebula Cloud Controller. This person will have direct ownership of mission-criticial projects, direct visibility to company executives, and own test engineering for the company.<p>Responsibilities<p>Determine and implement automated testing strategy \nDesign, build and automate test cases in Python \nParticipate in bi-weekly scrum sessions. \nDrive Nebula's continuous integration environment \nHelp Nebula ship our product releases on time.<p>Environment: Python, Jenkins, Linux, OpenStack<p>Apply here: <a href=\"http://www.nebula.com/careers/devops-automation-engineer\" rel=\"nofollow\">http://www.nebula.com/careers/devops-automation-engineer</a>","time":1335890782,"type":"comment"},{"by":"functionx","id":3954079,"parent":3913997,"text":"Function(x) Inc. / Viggle - New York City / San Francisco\nFull-time - Software / Platform Engineers<p>Function(x) is a start-up \"mode,\" technology driven media company that recently launched the award-wining iOS app (coming soon to the Android market) dubbed Viggle - the first of its kind loyalty and rewards program for watching television (bit.ly/GHC4t2).<p>You can check into your favorite TV shows with Viggle and get great, real, tangible rewards such as movie tickets, music, gift cards and much, much more. All just for watching the TV shows you love.<p>The main conduit through which people interact with Viggle is through the mobile platform, so your work will directly reach the millions of users across the country (and beyond) that we plan on reaching.<p>As a member of our product engineering team, you’ll build real products for the real world. You’ll be responsible for developing server-side infrastructure that powers our mobile and web based product offerings.<p>Responsibilities will include everything from product specification to system design to implementation to operational deployment.  Function(x) systems operate at large scale under highly variable load, so experience with or interest in designing systems for high-availability and scalability is a must.<p>We’re building a great infrastructure to support Viggle – we’re not afraid to choose the best technology for the job, from Java to Node.js to RubyOnRails to Riak to PHP and Python   We use open source and want our engineers to contribute back to the projects we use. Our development processes are agile and transparent.<p>Interested? See more:<p>San Francisco - <a href=\"http://hire.jobvite.com/j/?cj=oiwdWfwH&#38;s=hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oiwdWfwH&#38;s=hackernews</a><p>New York - <a href=\"http://hire.jobvite.com/j/?cj=of1PVfwK&#38;s=hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=of1PVfwK&#38;s=hackernews</a>","time":1336664371,"type":"comment"},{"by":"matrix","id":3914729,"parent":3913997,"text":"Salt Lake City, Utah<p>Black Diamond is hiring for entry level web developers and for an enterprise systems role. This is a rare opportunity to combine a passion for outdoor sports (climbing, skiing, mountaineering, and more) while working as part of a smart, motivated software team.<p>For more details, see the careers section at blackdiamondequipment.com","time":1335885509,"type":"comment"},{"by":"jreposa","id":3914384,"parent":3913997,"text":"Brooklyn, NY - AD60, MyBankTracker.com<p>Web Developer - <a href=\"http://www.ad60.com/jobs/\" rel=\"nofollow\">http://www.ad60.com/jobs/</a>","time":1335881700,"type":"comment"},{"by":"lorinavalny","id":3914483,"parent":3913997,"text":"Clifton, NJ Onsite Web Developer Needed\n\"designer fluent in html/css/js\"\nThis is a new position, we are looking for an individual who can craft the visual and interactive experience that clients and prospects have with our brands.  You will need a high level of creativity with an emphasis on collaboration!  You will be challenged to create a visual message that is consistent with our existing brands while exploring new ideas and ways to communicate our message.\nIf you have what it takes - email your resume to lori@fortressitx.com along with your portfolio.\n<a href=\"http://www.fortressitx.com\" rel=\"nofollow\">http://www.fortressitx.com</a>\n<a href=\"http://www.dedicatednow.com\" rel=\"nofollow\">http://www.dedicatednow.com</a>\n<a href=\"http://www.solarvps.com\" rel=\"nofollow\">http://www.solarvps.com</a>","time":1335882842,"type":"comment"},{"by":"kevingessner","id":3914849,"parent":3913997,"text":"New York NY -- Full-time, on-site<p>Fog Creek Software -- We're looking for top-notch software developers and sysadmins/devops magicians, as well as designers and front-end developers.<p>Great salary, kick-ass benefits, paid relocation.<p>Learn more at <a href=\"http://www.fogcreek.com/careers.html\" rel=\"nofollow\">http://www.fogcreek.com/careers.html</a>","time":1335886714,"type":"comment"},{"by":"karaanne","id":3914447,"parent":3913997,"text":"AxialMarket - NYC - Sr. Software Engineer (FT, no remote, no H1B)\nAxialMarket is an internet-based 2-sided marketplace for buyers and sellers of private companies, combining social interaction and networking tools with real-time workflow, data and analytics.<p>We write Python and JavaScript\nWe use modern tools like EC2, Redis, Memcached, Real-time analytics and RabbitMQ\nWe care A LOT about design\nWe have a ton of data detailing the behavior of participants in our marketplace\nWe are the largest online marketplace of private company transaction participants\nWe work out of our own beautiful, open, bright office near Union Square/Flatiron\nWe pay market\nWe offer meaningful equity\n<a href=\"https://www.axialmarket.com/about/careers/\" rel=\"nofollow\">https://www.axialmarket.com/about/careers/</a>","time":1335882413,"type":"comment"},{"by":"windust","id":3930254,"parent":3913997,"text":"OptionsCity - Chicago, IL - Developer<p>OptionsCity creates professional Options trading software that interacts with the Chicago / NY Exchanges (CME, CBOE, LIFFE, NYSE). We need a Developer to help us get things done (we have a long to-do list and a bunch of features in the queue, and not enough people :).<p>The position is entry level (Junior Developer / Graduate), so as requirements we don't expect you to know a lot (Our stack for the curious is J2SE, SVN, Hibernate, MySql). The only two real big requirements are to be smart, and work with constraints. These two requirements are much better defined at our site <a href=\"http://www.optionscity.com/jobs/developer.htm\" rel=\"nofollow\">http://www.optionscity.com/jobs/developer.htm</a> (and yes, we decided to go with the maritime  themed job posting!)<p>Thanks!<p>Freddy","time":1336163987,"type":"comment"},{"by":"jasonchen913","id":3914599,"parent":3913997,"text":"New York, NY - Full Time \n- J.Crew - Java Web Application Developer / Front End Engineers<p>Are you looking to work on something new? Want to be part of an exciting project that is currently underway? Than the opportunity at J.Crew might be the one for you.  Please feel free to reach out to me at Jason.Chen@jcrew.com if you are interested..<p>Front End Engineer - <a href=\"http://seeker.dice.com/jobsearch/result/10118702/3663/DiceId_10118702/J.%2BCrew/front-end-engineer\" rel=\"nofollow\">http://seeker.dice.com/jobsearch/result/10118702/3663/DiceId...</a><p>Java Web Application Developer - <a href=\"http://seeker.dice.com/jobsearch/result/10118702/617414/DiceId_10118702/J.%2BCrew/java-web-application-developer\" rel=\"nofollow\">http://seeker.dice.com/jobsearch/result/10118702/617414/Dice...</a>","time":1335884271,"type":"comment"},{"by":"ShaneSullivan","id":3915719,"parent":3913997,"text":"Burnaby, BC<p>autoTRADER.ca is Canada's leading automotive marketplace and our Burnaby dev team is hiring multiple positions, including:<p>- Web Solutions Architect\n- Senior QA Manager\n- QA Engineers<p>We develop autoTRADER.ca using Microsoft.Net C#, SQL Server, and related technologies. We also develop for iPhone (#5 in category) and iPad (#1 in category) plus have just started with Android. We develop and support high volume back-end services using WCF, REST, SOAP, etc.<p>We have a great benefits package which includes paid home internet/mobile phone, $1000 tuition reimbursement, paid conferences (we're sending devs to both WWDC and Google IO this year), a bonus system and flexible medical benefits.<p>To apply, please visit <a href=\"http://www.jobsattrader.com\" rel=\"nofollow\">http://www.jobsattrader.com</a>","time":1335896673,"type":"comment"},{"by":"jasonshen","id":3915566,"parent":3913997,"text":"Ridejoy (YC S11). San Francisco, CA. Full time.<p>Engineer number one.<p>Interested in getting in on the ground floor of fundamentally changing the way people travel or, as one of our users said, \"restoring people's faith in humanity\"?<p>See more at: <a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a>","time":1335894784,"type":"comment"},{"by":"zukhan","id":3922709,"parent":3913997,"text":"FULLTIME or INTERN. Offices in San Francisco, Boston, and Menlo Park.<p>Delphix (www.delphix.com) is a data virtualization company that does for databases what VMware did for servers - this is a massive market, and we are on track for similar success. The product is unique and provides huge value to our users - in our first year of selling, we have already added 30 large corporate customers, including many of the Fortune 500 (Proctor &#38; Gamble, Staples, Qualcomm, etc.). The engineering team is top notch, which includes inventors and architects of the VMware platform, Oracle RAC, Sun ZFS file system, and DTrace. We believe database virtualization is the next frontier for achieving 100x payback in IT, and Delphix is leading the way.<p>Delphix engineering sits at the nexus of three core technologies: databases, operating systems, and the cloud. We've taken the best and brightest across the industry and built an engineering culture where anyone with a good idea has a voice and can drive unique projects with the backing of a wealth of knowledge and experience. Whether its developing new abstractions in the filesystem, designing an architecture to inter-operate with a novel database, or developing a new cloud paradigm for structured data, there is no lack of hard problems and opportunities at Delphix.<p> WANTED (intelligent/creative/passionate problem solvers)<p> Do you want to work with brilliant people in a culture where creativity and clarity of thinking is encouraged and rewarded? Are you interested in working on the Data, the next big problem in Data Center? Do you thrive on solving difficult technical challenges? Do you take pride in writing beautiful code with a strong attention to detail? Then we are looking for you! Engineers who strive to master their craft; generalists who want to contribute at all levels of the application, from the database to the client and all things in-between. Delphix offers awesome tough technical challenges in the Systems Management, File Systems, Distributed / Cloud Computing, Clustering, Databases, and software excellence.<p>Email jobs@delphix.com for more information and include Hacker News in the subject line.","time":1336028105,"type":"comment"},{"by":"joshTheGoods","id":3933314,"parent":3913997,"text":"Ensighten - Cupertino (will relo) - (full-time and intern, designers, developers, leaders)<p>We help some of the biggest brands in the world (MS, Sony, AMEX, Purina, etc) manage the flows of data for their various digital footholds (web, mobile, etc). We've braved the early startup landscape and are looking to scale into a world class organization on the scale of most of our clients. We do JavaScript everywhere, and deal with massively scalable and highly available infrastructure composed of multiple commercial clouds (EC2, Azure, RackSpace, Terremark, etc). We're looking for brilliant and energetic people.<p>employment@ensighten.com\n<a href=\"http://ensighten.com/company/careers\" rel=\"nofollow\">http://ensighten.com/company/careers</a>","time":1336252835,"type":"comment"},{"deleted":true,"id":3915405,"parent":3913997,"time":1335892933,"type":"comment"},{"by":"psota","id":3916456,"parent":3913997,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers--UI/UX, frontend, backend data mining/algorithms.  See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1335907790,"type":"comment"},{"by":"ajh980","id":3915496,"parent":3913997,"text":"Detroit (Downtown), MI - Glocal - Full-time (will cover relocation)<p>Glocal (www.glocal.com) is looking for developers to join our growing team and help develop the next major destination for watching video online. We are funded (series A), located in Downtown Detroit (Campus Martius), and backed/partnered with a major technology firm. We will cover relocation expenses.<p>Candidates must have a wide range of development skills and be willing to take on major responsibility right away. Our technology is mostly Rails, Javascript, Python, Ruby, MySQL, and much more all hosted on Engineyard and S3.<p>Want to change the world, and the city of Detroit? Please send resumes to jobs@glocal.com.","time":1335893911,"type":"comment"},{"deleted":true,"id":3915482,"parent":3913997,"time":1335893763,"type":"comment"},{"by":"uwe_dushan","id":3915785,"parent":3913997,"text":"San Francisco, CA. Full time. <a href=\"http://www.unknownworlds.com/jobs\" rel=\"nofollow\">http://www.unknownworlds.com/jobs</a><p>Looking for talented engineers to work on Natural Selection 2. Would consider remote work for the right candidate.<p>The tech is some of the best I've seen in the 11 odd years I've worked in the games industry. Team is small (8 in the office, few more remote) and most excellent. We are a creatively independent, well funded, rather ambitious, anti-crunch, post-hierarchy, release often, 'real' games company.<p>Email us here: jobs@unknownworlds.com or drop me a line directly (dushan@unknownworlds.com) - I'm one of the core engineers.","time":1335897477,"type":"comment"},{"by":"whymsicalburito","id":3955660,"parent":3913997,"text":"Redular - Orange County, CA<p>We have recently secured funding for our next ambitious project and are building a team of 3 engineers to help us bring the project to life!<p>Requirements:\n- Formal Computer Science training\n- Have code you wrote running on a live web server, and working properly.\n- Proficient in OOP (PHP, Java, Ruby, Python, etc)\n- Basic understanding of MVC Frameworks\n- Love tackling hard problems.<p>Bonuses:\n- Previous Start-Up experience\n- Data Visualization experience\n- Machine Learning experience<p>Compensation and Perks:\n- $6k + Equity\n- Monthly beach day! (during the summer)<p><a href=\"http://redular.com/jobs\" rel=\"nofollow\">http://redular.com/jobs</a>","time":1336679933,"type":"comment"},{"by":"Dwatson783","id":3920826,"parent":3913997,"text":"Havas Digital - Boston - Full Time - BI Developer &#38; ETL/API Developer (no remote, relo welcome to discuss)<p>Havas Digital is a global marketing agency focused on utilizing data to help drive marketing initiatives for our clients.  To help drive the greatest results for our clients we use Artemis- a Havas developed analytics platform that drives decisions using big data.  If you're interested in learning about digital marketing, analytics and enjoy playing with data from ad servers, twitter, facebook, site analytics, offline campaigns, CRMs and more then we're what you're looking for.<p>The two roles we are hiring for are based in Boston as part of our solutions team.  These candidates will work as part of a small team to build new capabilities for clients, increase the sources of data we use to build insights and lead new ideas to expand the platform development.<p>What we're looking for:\n- A person that lives to tell a story through data. That understands design and presentation and is willing to go past the traditional to bring better insights.  They should also have an understanding of the data and it's structure, how it should be molded and prepared to optimize it's use.  An interest in online marketing is helpful, experience with big data is preferred and the desire to learn more technically and in the business is welcomed with open arms. If you've worked with Tableau, Microstrategy, Excelcius and the other handful of BI tools out there- we want to hear from you.<p>-A person who loves working with data, is interested in pushing the cutting edges of data and what we can do with it and has an interest in social media and online marketing.  You should have experience with pulling data from APIs such as those from Facebook, Twitter, GA.  You've worked with manipulating those data sets, automating the processes to feed systems with what you've built and tied it out nicely by inserting QA and controls to monitor your work.  You have no fear of diving in and figuring things out and can learn the tools you need to in order to service the platform the best you can.<p>For more on Havas Digital and Artemis: <a href=\"http://www.havasdigital.com/artemis/\" rel=\"nofollow\">http://www.havasdigital.com/artemis/</a><p>Interested? Email me at Doug.Watson[at]HavasDigital.com","time":1335988603,"type":"comment"},{"by":"zinxq","id":3965275,"parent":3913997,"text":"Refresh.io - Palo Alto - Full Time<p>Designer &#38; Front-End Developer<p>You will have 4+ years of experience using your design skills to build front-end interfaces across platforms (web and mobile). With strong project management and communication skills you're comfortable working in a fast-paced iterative environment. You have command of UX and UI and have a good sense of typography and color.  From time-to-time your friends call you a \"ninja\" as it relates to your JavaScript, HTML and CSS skills. You have built apps Objective-C.<p><a href=\"http://www.refresh.io/jobs\" rel=\"nofollow\">http://www.refresh.io/jobs</a>","time":1336859691,"type":"comment"},{"by":"rjsjr","id":3962081,"parent":3913997,"text":"San Francisco, CA. Full time.<p>Social Finance <a href=\"http://sofi.org/\" rel=\"nofollow\">http://sofi.org/</a> is fixing Student Loans with better rates, alumni investment, and great social integration. We're looking for a range of Software Developers and Product Managers to come work with an experienced startup engineering team and build great products. Backed by Eric Schmidt and Steve Anderson, we're located in the beautiful Presidio and have a free shuttle from downtown.<p>Apply online at <a href=\"https://sofi.resumetracker.com/public\" rel=\"nofollow\">https://sofi.resumetracker.com/public</a>","time":1336781010,"type":"comment"},{"by":"cchilton","id":3914900,"parent":3913997,"text":"San Francisco, CA - IOS and Android Engineers - No remote<p>Mindjet has long been known as the global standard for visual mapping of ideas and information, and now provides collaborative work management solutions that dramatically improve how people can work better together.\nMindjet’s incredible market opportunity is driving its rapid expansion. It must ensure that it creates products in the most integrated, agile and effective way. Therefore, we have the need for Mobile Software Engineers.<p><a href=\"http://www.mindjet.com/about/careers/\" rel=\"nofollow\">http://www.mindjet.com/about/careers/</a>","time":1335887290,"type":"comment"},{"by":"adam1010","id":3920922,"parent":3913997,"text":"RentStuff.com -- Chicago, IL  -- Full Time\nPHP Developer for a venture-backed start-up working out of 1871 in Chicago (in the Merchandise Mart)<p><a href=\"http://www.rentstuff.com/jobs/php_dev\" rel=\"nofollow\">http://www.rentstuff.com/jobs/php_dev</a><p>We are a marketplace for renting out stuff you own to other people (bikes, camera equipment, tents and outdoor gear, etc) and we also aggregate listings from local rental shops (think Kayak.com).<p>Intimate, small team environment with lots of authority and great perks!<p>Mysql, jQuery, Bootstrap, LAMP, EC2, AWS, Javascript, FT, Full-Time","time":1335989591,"type":"comment"},{"by":"melissatrahan","id":3915576,"parent":3913997,"text":"San Francisco, CA. Full time or intern.<p>Massive Health is hiring. We're a start-up based in San Francisco, and combined our team has previously shipped products to over half a billion people. We're using this consumer product expertise to improve healthcare by creating beautiful tools that deliver useful insights for getting and staying healthy. We've already launched an app called The Eatery, and there's lots more to come.<p>learn more here: <a href=\"http://massivehealth.com/jobs\" rel=\"nofollow\">http://massivehealth.com/jobs</a>","time":1335894866,"type":"comment"},{"deleted":true,"id":3915364,"parent":3913997,"time":1335892283,"type":"comment"},{"deleted":true,"id":3921372,"parent":3913997,"time":1335995206,"type":"comment"},{"by":"Uchikoma","id":3915248,"parent":3913997,"text":"Berlin, Germany\nDevOps and Senior/Excellent Java developers\nYou can reach me at stephan.schmidt@brands4friends.de\nI'll do the interviewing (+ some developers ;-)\nVice CTO","time":1335890971,"type":"comment"},{"deleted":true,"id":3914399,"parent":3913997,"time":1335881884,"type":"comment"},{"by":"sbrekken","id":3948432,"parent":3913997,"text":"Unfold - Oslo, Norway - Full time.<p>We are currently looking for an ambitious and talented front-end developer with significant hands-on experience to join our team in Oslo, Norway.<p>You have extensive HTML, CSS and JavaScript knowledge. You’re eager to explore new technologies and techniques as our field is rapidly changing. While we are very focused around front-end development, server-side experience is also valued.<p><a href=\"http://unfold.no/vacancies\" rel=\"nofollow\">http://unfold.no/vacancies</a>","time":1336570397,"type":"comment"},{"by":"pariveda1","id":3915396,"parent":3913997,"text":"Pariveda Solutions - Houston, TX - FT\nWe are looking for application developers with excellent problem solving skills and a passion for technology to join our IT consulting team in Houston.  If you or someone you know may be interested, please visit our website at <a href=\"http://parivedasolutions.com/TalentDevelopment/Pages/BrowseBy.aspx\" rel=\"nofollow\">http://parivedasolutions.com/TalentDevelopment/Pages/BrowseB...</a>.  We want to hear from you!","time":1335892794,"type":"comment"},{"by":"asmosoinio","id":3938775,"parent":3913997,"text":"Turku (Finland), Espoo (Finland), Manila (Philippines), remote work in also a genuine option.<p>Gecko Landmarks' brings location based services to everyone in emerging markets, because not everyone can (&#62;60% of global population) read maps.<p>We are hiring a Software Developer (and Beyond) for mobile (Android, J2ME) and server-side (Python, Google App Engine) work.<p>More information: <a href=\"http://geckolandmarks.com/jobs.html\" rel=\"nofollow\">http://geckolandmarks.com/jobs.html</a>","time":1336395407,"type":"comment"},{"by":"RichardPrice","id":3915474,"kids":[3962152],"parent":3913997,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>Almost every technological and medical innovation in the world has its roots in a scientific paper. Science drives much of the world’s innovation. The faster science moves, the faster the world moves.<p>It's widely held that science is too slow, and too closed. We are working on changing that, and re-inventing the way that scientists communicate. The stakes are high. If the inefficiencies in science can be removed, we may be able to accelerate science by a factor of 2, leading to a huge impact for humanity.<p>For more on the problem Academia.edu is solving, see the guest post on TechCrunch last Sunday on 'The Future of Science' by Academia.edu's founder, Richard Price <a href=\"http://techcrunch.com/2012/04/29/the-future-of-science/\" rel=\"nofollow\">http://techcrunch.com/2012/04/29/the-future-of-science/</a><p>Academia.edu has over 1.2 million registered users, and over 3.5 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,500 academics join each day.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We need talented engineers to come and help us with the mission. We have a strong engineering culture. We're an 11 person team based in downtown San Francisco. The site is in Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ tools for scientists to share their work faster and more openly<p>★ algorithms to mine our data, and to find out what research is trending in real time<p>★ back-end infrastructure to scale the site on AWS<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture.<p>There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.\nH1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1335893672,"type":"comment"},{"by":"pariveda1","id":3915365,"parent":3913997,"text":"Pariveda Solutions is hiring in Houston!  We are looking for application developers with excellent problem solving skills and a passion for technology to join our IT consulting team.  If you or someone you know may be interested, please visit our website at <a href=\"http://parivedasolutions.com/TalentDevelopment/Pages/BrowseBy.aspx\" rel=\"nofollow\">http://parivedasolutions.com/TalentDevelopment/Pages/BrowseB...</a>.","time":1335892308,"type":"comment"},{"by":"willf","id":3921379,"parent":3913997,"text":"Wordnik.com (San Mateo, California)<p>We have lots of positions at Wordnik (wordnik.com) as we build out our new recommendation and discovery engine.<p>Check out the jobs page at <a href=\"http://www.wordnik.com/jobs\" rel=\"nofollow\">http://www.wordnik.com/jobs</a> or write me directly (will@wordnik.com)<p>Machine Learning Expert: At Wordnik, we work with text — lots of text. Wordnik uses empirical methods to build recommendation systems and to extend and improve our Word Graph. We employ statistical, machine-learning, and deep-learning methods to exploit that prior knowledge for the modeling of text. We are a coding shop; developers in addition to researchers.<p>Computational Linguist: At Wordnik, we work with text — lots of text. Wordnik uses empirical methods to extend and improve our Word Graph, and we employ statistical, machine-learning, and deep-learning methods to exploit that prior knowledge for the modeling of text. We are a coding shop; developers in addition to researchers.<p>Full-Time Web and Mobile Designer: You are a talented designer that knows the web and mobile ecosystems inside and out. You're passionate about mobile and the web. You have ideas spilling out of your head for design simplifications, improvements, and additions to the user experiences affecting millions of people. Your design work is clean, focused, and inspiring to others.<p>Mobile Developer: You are an eager iOS developer who is a quick learner, with a passion for creating delightful and intuitive software. You want to help push the platform to its limits, with implementation approaches transcending even Apple’s first-party apps.<p>Frontend Hacker: We're looking for a Ruby/JS hacker with aesthetic sensibilities who can help us improve our existing ruby applications and build cool new things like our mobile site, games, browser extensions, etc.<p>Server Engineer: Wordnik is looking for a senior level engineer to help develop our public and private API system. You will help build our out Application cluster, which requires nuts-and-bolts knowledge of high-performance application stacks.<p>Cloud IT Architect: We're looking for a senior, hands-on developer capable of interfacing with the Amazon EC2 API and others, who would be responsible for building internal tools to manage our software infrastructure. This would include both back-end workflow as well as user-interface components.","time":1335995255,"type":"comment"},{"by":"Carter2BT","id":3961850,"parent":3913997,"text":"Portland, OR | Seeking Entrepreneurial Lead Engineer/CTO<p>Help us disrupt a $100 Billion Dollar industry. Looking for passionate entrepreneurial developers (iOS and/or Android and HTML) to be a part of building something from the ground up. Ideal candidate is in Boulder CO or Portland OR - maybe open to remote.<p>E-Mail Carter@Tabrific.com to start conversation","time":1336776406,"type":"comment"},{"by":"mikek","id":3914348,"parent":3913997,"text":"Kiwi Crate is hiring in Mountain View, California.<p><a href=\"http://www.kiwicrate.com/jobs\" rel=\"nofollow\">http://www.kiwicrate.com/jobs</a>","time":1335881269,"type":"comment"},{"by":"lou718","id":3962204,"parent":3913997,"text":"Jawbone, San Francisco, CA. Full-time.<p>Makers of Jambox, Big Jambox, Era and Icon bluetooth headsets, and the UP wristband.<p>We're hiring iOS, web front end, python backend, database  (mongo+mysql) engineers, and more: <a href=\"http://jawbone.com/careers\" rel=\"nofollow\">http://jawbone.com/careers</a><p>Email lou [at] jawbone.com if interested.","time":1336783597,"type":"comment"},{"by":"blckswn49","id":3914779,"parent":3913997,"text":"Hi! We are in Taipei and looking for a remote drupal 7 developer and designer. Must have experience. Please email us your portfolio, resume, and some current drupal based websites that you have designed/ developed to: blck.swn.99@gmail.com.","time":1335886003,"type":"comment"},{"deleted":true,"id":3914730,"parent":3913997,"time":1335885533,"type":"comment"},{"by":"nwjlyons","id":3914811,"parent":3913997,"text":"Oxford, UK - Django Developer -\nTorchbox.com -\n<a href=\"http://twitter.com/#!/torchbox/status/196998627883892737\" rel=\"nofollow\">http://twitter.com/#!/torchbox/status/196998627883892737</a>","time":1335886264,"type":"comment"},{"by":"johnmmurray","id":3914935,"parent":3913997,"text":"Louisville, KY - iOS Developer, Android Developer, 2 Back-end Engineers<p><a href=\"http://www.mavizon.com/careers/\" rel=\"nofollow\">http://www.mavizon.com/careers/</a>","time":1335887689,"type":"comment"},{"by":"grourk","id":3915351,"kids":[3916483],"parent":3913997,"text":"Everyone.  Everyone is hiring Software Engineers.","time":1335892099,"type":"comment"},{"by":"cybernytrix","id":3924935,"parent":3913997,"text":"Stealth startup working on \"TV meets Facebook\". Looking for web backend engineers and video engineers.","time":1336067801,"type":"comment"},{"by":"takecarex3","id":3922345,"parent":3913997,"text":"San Francisco, CA-<p>Venture backed stealth healthcare technology company seeks self-motivated Ruby on Rails Developer (RoR). We have just relocated to San Francisco and have already solidified partnerships with the biggest names in healthcare technology. We recently closed funding with Peter Thiel’s Founders Fund (Facebook, Yammer, Spotify, SpaceX, Practice Fusion, Path, RapLeaf). If you are looking for a ground-level opportunity with high growth potential this is it. You will be one of our founding engineers and work directly with our Product Manager. You will be directly responsible for coordinating, designing, building, and implementing features and workflows into our full product stack. We’d eventually like you to grow into managing our engineering team. Together, we can grow an exciting product that will undoubtedly become an integral part of the future of medical care, but we need your help.<p>Responsibilities:<p>-Work directly with offshore engineering team and report to product manager<p>-Implement product features via Ruby on Rails (RoR)<p>-Build and maintain existing infrastructure and systems<p>-Willingness to take on greater role as company grows and expands, including managing engineering team<p>Requirements:<p>-1-2 years of Ruby on Rails (RoR) development and willingness to vastly improve ability and learn<p>-Strong communication skills with CEO &#38; Product Manager to help design, spec, and build new features<p>-Strong work-ethic, self-motivated, work well in teams<p>Bonus:<p>-Experience with Test Driven Environemnt (TDD)<p>-Experience with agile development<p>-Startup experience<p>-Interest in healthcare<p>-VoIP (SIP/RTP) (OpenSIPS/Asterisk)<p>-iPhone Development<p>-Android Development<p>-Flash RTMP<p>More about the project:<p>The project relies heavily on VoiP Technologies for communication (both voice and video). We have an existing product written with endpoints in Ruby on Rails, iOS and Android. Experience with VoiP Technologies is strongly preferred, although not essential. Experience with Ruby on Rails projects and agile development is required.<p>This is a big opportunity to join a great team of individuals in a leadership role and be on the ground floor of changing healthcare. If you think you’re a good fit, please email sfhealthstartup [at] gmail.com with any relevant information (github, LinkedIn, Twitter, resume, etc.)<p>Competitive compensation, benefits, and equity participation","time":1336018218,"type":"comment"},{"by":"takecarex3","id":3921844,"parent":3913997,"text":"San Francisco, CA -<p>Venture backed stealth healthcare technology company seeks self-motivated Ruby on Rails Developer (RoR). We have just relocated to San Francisco and have already solidified partnerships with the biggest names in healthcare technology. We recently closed funding with Peter Thiel’s Founders Fund (Facebook, Yammer, Spotify, SpaceX, Practice Fusion, Path, RapLeaf). If you are looking for a ground-level opportunity with high growth potential this is it. You will be one of our founding engineers and work directly with our Product Manager. You will be directly responsible for coordinating, designing, building, and implementing features and workflows into our full product stack. We’d eventually like you to grow into managing our engineering team. Together, we can grow an exciting product that will undoubtedly become an integral part of the future of medical care, but we need your help.<p>Responsibilities:<p>-Work directly with offshore engineering team and report to product manager<p>-Implement product features via Ruby on Rails (RoR)<p>-Build and maintain existing infrastructure and systems<p>-Willingness to take on greater role as company grows and expands, including managing engineering team<p>Requirements:<p>-1-2 years of Ruby on Rails (RoR) development and willingness to vastly improve ability and learn<p>-Strong communication skills with CEO &#38; Product Manager to help design, spec, and build new features<p>-Strong work-ethic, self-motivated, work well in teams<p>Bonus:<p>-Experience with Test Driven Environemnt (TDD)<p>-Experience with agile development<p>-Startup experience<p>-Interest in healthcare<p>-VoIP (SIP/RTP) (OpenSIPS/Asterisk)<p>-iPhone Development<p>-Android Development<p>-Flash RTMP<p>More about the project:<p>The project relies heavily on VoiP Technologies for communication (both voice and video). We have an existing product written with endpoints in Ruby on Rails, iOS and Android. Experience with VoiP Technologies is strongly preferred, although not essential. Experience with Ruby on Rails projects and agile development is required.<p>This is a big opportunity to join a great team of individuals in a leadership role and be on the ground floor of changing healthcare. If you think you’re a good fit, please email sfhealthstartup [at] gmail.com with any relevant information (github, LinkedIn, Twitter, resume, etc.)<p>Competitive compensation, benefits, and equity participation","time":1336004953,"type":"comment"},{"by":"Peek","id":3914955,"parent":3913997,"text":"Peek (www.peek.ly) - Manhattan, NY (interns, part-time, full-time, H1B welcome)<p>Peek wants to make the Internet and data available globally via mobile devices. We want people in the most remote regions of the world to obtain $50 or even $25 devices to communicate and collect the data they need. This means that we need to make software that is affordable and uses as little data as possible. But is still incredibly powerful! It's a big challenge.<p>At Peek we are looking for software engineers who have a passion for the startup environment, and who want to develop skills on new and emerging technology while learn more about what it takes to start a successful company.<p>What we're looking for?<p>1. You love to create. You will code and build mobile apps on the hottest mobile platform in the world (and it's not iOS or Android... hmmm), it's an SDK used in 40% of the phones in the global market (and growing 50% year over year). You'll also work on our cloud systems, hosted in Amazon AWS and learn all about mobile to cloud applications, and handling scale on the order of millions of clients. We use C/C++, Java, .NET, Ruby, Javascript (including node.js), and many others.<p>2. You are eager to do it all and make an impact: product and feature planning, development, project management and of course, testing (we all do it!)<p>3. You are \"smart and gets things done\" (and can name the guy who coined that phrase)<p>4. You want to be part of a startup - this means a very small organization with a flat hierarchy where you can communicate freely and openly.<p>What's in it for you?<p>1. A very competitive salary, great health care (incl. vision and dental), stock options, group events (like ping pong nights) and a great working environment in Manhattan, New York.<p>2. The opportunity to work on every aspect of a mobile operation, including embedded (C/C++), back-end (Java, node.js), cloud systems (EC2), and more. You'll get a chance to work on all of these systems, not just one or two.<p>3. Our founders, who have raised over $100m in capital in their careers, will show you the start-up ropes, do sessions with you, and introduce you to folks in the startup community - entrepreneurs, VCs, etc. And when you want to start your next big startup, we'll be there to help you out.<p>Peek launched nation-wide in the US, in late 2008. Since then we’ve launched successfully across Europe and in India, and picked up many awards along the way including Time's Gadget of the Year, Wired Product of the Year, and GSMA nomination for Best Cloud Technology. Peek is backed by top-tier venture capital firms RRE Ventures and L Capital, and led by the founder of Virgin Mobile USA (IPO 2007; acquired by Sprint).<p>Send us an email to jobs@peek.ly","time":1335887862,"type":"comment"},{"by":"mikenyc","id":3914416,"parent":3913997,"text":"New York, NY - Craft Coffee - Lead Rails Engineer\nFull-time\n<a href=\"http://craftcoffee.com/jobs\" rel=\"nofollow\">http://craftcoffee.com/jobs</a><p>We're looking for a kickass full-stack Rails developer.<p>TECHNICAL CHALLENGE<p>It's not a shopping cart.  We want to build a best-in-class integration of marketing and technology.  This is the new golden skill set.  You'll master it at Craft Coffee, and engage in very hard problems on the leading edge of online commerce.<p>See, for example: <a href=\"http://andrewchenblog.com/2012/04/27/how-to-be-a-growth-hacker-an-airbnbcraigslist-case-study/\" rel=\"nofollow\">http://andrewchenblog.com/2012/04/27/how-to-be-a-growth-hack...</a><p>ABOUT CRAFT COFFEE<p>We're seriously passionate about what we do.  Every team member receives tons of great coffee equipment on day 1. We live what we do, and we'd never sell anything to our customers that we didn't personally love.<p>We ship coffee to paying customers in 48 states and 9 countries.  Our subscribers LOVE us.  Coffee is an everyday ritual and we elevate that moment for people.<p>PEOPLE YOU RESPECT LOVE US\nTechnologists, entrepreneurs, food writers, chefs, designers, filmakers.<p>Alexis Ohanian, founder of Reddit.  He subscribed, fell in love, then invested because of our product execution: \"Continuing to be impressed by Craft Coffee. Is it wrong that I'm starting to tell NY tech startups by their attention to design?\"<p>Dave McClure, pirate at 500 Startups: \"For all you aspiring lawyer-entrepreneurs out there, I just want you to know that we invest in lawyers only if they know how to code like [Craft Coffee founder] Mike Horn!\"<p>Amanda Hesser, author of The Essential NYTimes Cookbook &#38; founder of Food52: \"New weekend ritual -- grinding @craftcoffee beans in manual grinder &#38; making coffee in a French press.\"\"They do an excellent job all around -- interesting sources, thoughtfully assembled -- and I really enjoy the element of surprise every month.\"<p>Ondi Timoner, filmmaker (Dig! and We Live in Public), winner of the Sundance Film Festival Grand Jury Prize (twice!): \"Thought I'd never tweet about food &#38; drink but this is really a public service announcement - go get @craftcoffee now!\"<p>Zach Klein, co-founder of Vimeo, CEO of DIY: \"My favorite of-the-month-club is @craftcoffee -- three packages of coffee beans delivered from different roasters each month.\"<p>PRESS LOVE US<p>Wall Street Journal: \"An artisanal greatest hits package.\"<p>Tasting Table: \"Your morning just found more glory\"<p>Sprudge (a leading coffee industry blog): Best New Product of 2012: \"The very act of opening your Craft Coffee box is a joy, the packaging artful, delicate and neat. The coffees selected therein are consistently surprising, unexpected, and splendid. There's some magic in the air at Craft Coffee.\"<p>Serious Eats: \"a chance to really compare and think differently about what's being done out there in coffee\"<p>Saveur: \"perfect gift for the coffee connoisseur in your life.\"<p>Martha Stewart Everyday Food: \"Barista in a box.\"<p>APPLY<p>See our full job post here: <a href=\"http://craftcoffee.com/jobs\" rel=\"nofollow\">http://craftcoffee.com/jobs</a>\nAfter you check us out and see what we're all about, email us at dev@craftcoffee.com.  It's a direct line to the CEO.","time":1335882019,"type":"comment"},{"by":"bherrup","id":3914306,"parent":3913997,"text":"Sterling, VA - Washington, DC - ZipList, Inc. (no H1B, no REMOTE)<p>ZipList, Inc, newly acquired by Condé Nast, seeks a Mobile Developer for a full-time staff position in Sterling, VA.<p>ZipList, Inc. is the technology leader in universal online and mobile shopping lists and recipe boxes. The robust technology ZipList provides is simple: digital and mobile users can populate their universal recipe box and shopping list with recipes from anywhere on the web, including food sites, e-cookbooks, and blogs. They can also save recipes to their universal recipe box using texts and QR codes, or via their mobile device. Combining this robust functionality with the high-quality content available on Epicurious and other Condé Nast food brands, enables consumers to have a one-stop digital recipe and shopping list network offering tremendous ease and flexibility.<p>Condé Nast is home to some of the world’s most celebrated media brands. In the United States, Condé Nast publishes 18 consumer magazines, four business-to-business publications, 27 websites, and more than 40 apps for mobile and tablet devices, all of which define excellence in their categories. The company also owns Fairchild Fashion Media (FFM), whose portfolio of brands serves as the leading source of news and analysis for the global fashion community. Condé Nast has won more National Magazine Awards over the past ten years than all of its competitors combined. Follow us on Twitter @CondeNastCorp and @CondeNastCareer.<p>We are looking for self-starting, entrepreneurial-minded software engineers to work on meaningful components of ZipList's mobile offerings. We work in a highly Agile, scrum-based development environment and we release early and often.  The ideal candidate will be able to easily switch from mobile platform to mobile platform.  They will keep themselves abreast of the new APIs and technologies that are available on these platforms. Also, the candidate will be able to participate in the discussions and make recommendations about what are the best solutions for the many varied scenarios we may face.<p>Skills/Requirements :<p>• A minimum of a B.S. in Computer Science, Electrical Engineering, Computer/Software Engineering or similar degree, and two years of professional software development experience.<p>• A minimum of one year of Mobile Development experience (modern smartphone platforms a plus, iPhone, Android).<p>• Minimum two years experience with Java and/or Objective-C and their respective User Interface layers.<p>• Minimum two years experience with JavaScript, HTML and CSS.<p>• Experience with Client Application Development and Deployment Processes, a plus.<p>• Experience with AJAX, JSON, and REST a plus.<p>• Experience with Windows Phone 7 (.NET) , a plus.<p>• Familiarity with Ruby, Ruby on Rails (or experience with other dynamic languages like PHP or Python)<p>If this sounds like you, please apply at <a href=\"http://bit.ly/HSPVPu\" rel=\"nofollow\">http://bit.ly/HSPVPu</a>","time":1335880687,"type":"comment"},{"by":"nandemo","id":3915613,"kids":[3915839,3919167,3924905],"parent":3913997,"text":"Not a single company hiring in Tokyo?","time":1335895316,"type":"comment"},{"by":"osmeta","id":3916714,"parent":3913997,"text":"osmeta - Mountain View, CA - Full Time or Intern<p><a href=\"http://osmeta.com\" rel=\"nofollow\">http://osmeta.com</a>","time":1335912607,"type":"comment"},{"by":"technology","id":3917887,"parent":3913997,"text":"VaynerMedia - 373 Park Avenue South, Floor 9, New York, NY 10016<p>Community &#38; Content Coordinator\nLocation: New York, NY<p>Location: New York, NY Type: Full Time Min. Experience: Mid Level\nThe Community &#38; Content Coordinator works hand-in-hand with the Account Executive and serves as their more analytics and community oriented counterpart.<p>Who are you?\nCreative, comforted by the numbers, and centered in an unwillingness to maintain the status quo.  We look for folks that are “good at the internet”.<p>The task at hand:<p>You will be assessing and solving complex brand challenges through a community and content lens relying on a sixth sense (and data) to encourage maximum engagement\nAs an ardent protector of our methodology and ethos, you will constantly be called upon to give your ideas on what works, what doesn’t and why\nWe’ll expect you to think like the brand, eat like the brand, and speak like the brand with a level of respect and dedication that is typically only found within a client organization\nInvest in popular culture and digital spaces to bring seemingly unrelated content ideas and concepts to bear (walking the walk is incredibly important to us)\nTranslating an understanding of, and respect for, good user experience into innovative content from ideation to creation to assessment\nAct as a mentor, teacher and/or sounding board for the community managers and multi disciplinary team surrounding you<p>The Ideal Candidate has:<p>A Bachelor’s degree and 2-4 years of interactive experience working on digital / social strategies + campaigns, including some client-facing experience\nA deep love and respect for communities and the power that can be housed within them supplemented by a commitment to listen and adapt as they change\nAn even temperament that will allow you to think clearly and communicate clearly in times when swift action (or the diffusing of potential issues) is imperative\nAn innate curiosity and desire to determine how something works and then be driven to improve upon the original concept\nThe ability to effectively collaborate with multidisciplinary project teams to enable all participants to feel equally invested in strategies and executions and keep everyone in the know and in a position to succeed\nA sparkling personality that will mesh well with the existing VaynerMedia family (we love smart people with a dash of quirkiness and humor)\nAn insatiable curiosity and knowledge about all things social, web, and mobile\nThe ability to write concisely and with a strong voice, without typo or delay with general editorial sensibilities\nAn interest and comfort level in standing in front of a client or a room full of peers and giving their opinion or a presentation\nThe uncanny ability to see opportunities and solutions in the face of a challenge\nAn interest in math, data and analytics (if you were the one asleep in math class, we have other roles that might be of more interest to you)<p><a href=\"http://careers.vaynermedia.com/apply/8WIzAX/Community-Content-Coordinator.html\" rel=\"nofollow\">http://careers.vaynermedia.com/apply/8WIzAX/Community-Conten...</a><p>===========================================================<p>Junior Designer<p>Location: New York, NY Department: Creative Type: Full Time Min. Experience: Entry Level<p>VaynerMedia is looking for a junior designer to join our in-house team full-time. We’re looking for someone who is passionate about design and social media and is comfortable working in a fast paced environment. You'll be working exclusively within the digital realm (no print work) and the portfolio you submit should reflect this.<p>Requirements:\n- Formal design schooling OR equivalent experience working professionally.\n- Strong typography skills and a ridiculous attention to detail. Also helpful to have experience with information and icon design.\n- Must know the ins-and-outs of Photoshop and the rest of the Adobe Creative Suite.\n- You'll be working with our clients and must be comfortable designing within the aesthetic and voice of their brands. You need to be good at taking in feedback and adapting accordingly.\n- Must have a startup mentality. We work hard and love every minute of it. You should also be comfortable working within an agency structure.\n- Must live in or near NYC or be willing to relocate.<p>Bonus points:\n- An understanding of UI/UX.\n- An understanding of the big social media platforms and their abilities/limitations (design-wise).\n- Experience working with developers and a basic understanding of the abilities/limitations of the major code languages.\n- Mild to major illustration skills.\n- An obsession with sports, music, or food.<p>Please include in your cover letter a link to your portfolio (if you do not have a link please attach with the cover letter). Please also include a few sentences on what you think is the best designed website or app out there, and why.<p><a href=\"http://careers.vaynermedia.com/apply/kWHDVB/Junior-Designer.html\" rel=\"nofollow\">http://careers.vaynermedia.com/apply/kWHDVB/Junior-Designer....</a>","time":1335941354,"type":"comment"},{"by":"pabloest","id":3914841,"parent":3913997,"text":"San Francisco, CA<p>Meraki - <a href=\"http://meraki.com\" rel=\"nofollow\">http://meraki.com</a><p>Meraki is the leader in cloud networking and we have over 20,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://www.meraki.com/customers\" rel=\"nofollow\">http://www.meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco - yes, it's sunny here!<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you’ll be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://www.meraki.com/company/jobs#frontendengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#frontendengineer</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://www.meraki.com/company/jobs#backendsystemsengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#backendsystemsengineer</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://www.meraki.com/company/jobs#firmwareengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#firmwareengineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://www.meraki.com/company/jobs#technicalmarketingmanager\" rel=\"nofollow\">http://www.meraki.com/company/jobs#technicalmarketingmanager</a><p>* Front-end Developer: expert level command of HTML and CSS with strong Javascript skills, knowledge of a scripting language, familiarity with back-end application concepts and a strong design aesthetic. (B.S. degree in computer science or equivalent)\n<a href=\"http://www.meraki.com/company/jobs#frontenddeveloper\" rel=\"nofollow\">http://www.meraki.com/company/jobs#frontenddeveloper</a><p>// Support<p>* Technical Support Engineer: sharp, energetic, technical support engineer who can work closely with many groups within the company, including engineering, to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://www.meraki.com/company/jobs#technicalsupportengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#technicalsupportengineer</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, sales engineers, and strategic sales.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1335886632,"type":"comment"},{"by":"dlmiler2","id":3931127,"parent":3913997,"text":"Washington, DC\nGS-11","time":1336183348,"type":"comment"},{"deleted":true,"id":3914422,"parent":3913997,"time":1335882084,"type":"comment"},{"by":"benihana","id":3914524,"parent":3913997,"text":"Durham, NC | Northern VA - Bronto software is hiring. <a href=\"http://bronto.com/company/careers\" rel=\"nofollow\">http://bronto.com/company/careers</a><p>I left this great company a few weeks ago to pursue an opportunity at Etsy, but I'll be the first to say that it's an awesome place to work and would recommend it to anyone who wants to work with good developers. It's an email marketing company currently building out a platform that includes email, social (facebook, twitter) and SMS marketing as well.","time":1335883359,"type":"comment"},{"by":"benihana","id":3914514,"parent":3913997,"text":"Etsy is hiring in New York City - <a href=\"http://www.etsy.com/careers\" rel=\"nofollow\">http://www.etsy.com/careers</a><p>I've been here for three weeks and I love it so far. I pushed code to production on my first day, and since then I've pushed probably 10 times. I have never been more surrounded with competent, smart, fun people.","time":1335883204,"type":"comment"},{"by":"klbarry","id":3915271,"parent":3913997,"text":"New York, NY - Two internships: General programming or electrical engineer intern. $12/hr, ~20 hours week.<p>www.tractechsystems.com\nwww.colormerchants.com<p>Job Description: Join our team if you're looking to learn a lot and make a difference in a very fast growing start-up. We're the industry leader in jewelry RFID, and believe we've only just begun to crack this market. We need bright technical people to handle a variety of programming tasks, work with our RFID technology, and support our business customers.<p>Qualifications:\tWe're looking for an ambitious intern with programming knowledge. We feel that if you're pretty comfortable with one language, it's not too hard to work around the others. Knowledge and enthusiasm for RFID is a huge bonus!<p>*Application Instructions: Send your resume and cover letter to kevin.barry@tractechsystems.com.","time":1335891231,"type":"comment"},{"by":"motti","dead":true,"id":3914814,"parent":3913997,"text":"London, UK<p>FULLTIME or INTERN<p>REMOTE or onsite in our London offices, or some hybrid arrangement.<p>We are building CopyCopy (<a href=\"http://www.copycopy.cc/\" rel=\"nofollow\">http://www.copycopy.cc/</a>) - a cross-platform tool that makes it simple to transfer anything between phones and desktop computers.<p>Join us on our exciting journey, where every day breeds new ideas and more possibilities. We are young, but headed by experienced engineers and looking for fast-learning, productive coders ready to take on the challenge of building a scalable, multi-platform consumer service.<p>Our Git repositories, code review and Project Management tools are geared towards remote working and we are open to flexible working conditions. We urgently need full-timers and interns (paid).<p>You should be familiar with one or more of:<p>• Java (for Android, BackberryOS, and in our homegrown lightweight Java server and its GWT frontend)<p>• C++ (for Win32, Qt, Android NDK and Objective-C++)<p>• Python (occasionally) to string bits together<p>• Objective-C (iPhone and Mac)<p>• JavaScript (web frontend work and browser extensions)<p>• Redis<p>Equity on top of salary for the right candidate.<p>We are happy to consider remote workers who are located in timezones +/-3 hours from London or you can work in our new North West London offices. Apply now to find out about our \"secret sauce\" that will make CopyCopy the simplest way of transferring anything between devices.<p>Just send your CV to jobs@copycopy.cc now and we'll be happy to chat!","time":1335886340,"type":"comment"},{"by":"adamadmeris","dead":true,"id":3914839,"parent":3913997,"text":"Toronto, Ontario - Sr. Java Developer - Fulltime or Contract<p>Admeris Payment Systems Inc is a leading provider of PCI-compliant merchant processing solutions for e-commerce and m-commerce.  Backed by a global acquiring network, Admeris can process in 144 currencies and settle funds in 19 currencies the next business day. Admeris supports Visa, Mastercard, Interac Online, Discover, China Union Pay and American Express with its payment gateway platform and supports merchant business needs with core API, hosted, silent redirect, mobile payment gateways and virtual terminal options.<p>We are seeking to expand our team of software developers/engineers/architects and are open to new candidates submitting resumes. If being on the cutting edge of industry changing payment technologies excites you, we want to hear from you! Our new patent is creating some huge hype globally with telecom providers and we have existing development projects where the forecasts are for our product to be in the pockets of over 100 Million end users within 1 year!<p>Please send all resumes to Careers@admeris.com; when we see a good fit, the next step will be to take a quick 3 question online test to assess your skills.","time":1335886620,"type":"comment"},{"by":"bentaber","dead":true,"id":3914146,"parent":3913997,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour.<p>We're looking for developers and engineers up and down the stack at all levels.","time":1335878223,"type":"comment"},{"by":"zugo","id":3914707,"parent":3913997,"text":"Zugo Services are looking for an experienced Python engineer for a role focused on our tracking &#38; analytics platform. The salary offer for this position is in the range of £40k/£50k per annum and includes a discretionary bonus of up to 10% depending on individual and/or company performance.<p>Required:\n* Interest in MR and distributed data analytics<p>Preferred:\n* Non-trivial experience with DISCO, Tornado, SQLAlchemy, nosetests\n* Experience of optimising TCP/IP kernel and Nginx configurations for managing high load<p>for more info. contact recruitment@zugoservices.com","time":1335885334,"type":"comment"},{"by":"agentargo","dead":true,"id":3914567,"parent":3913997,"text":"Late to the game, but....<p>Next Big Sound, NYC<p>Next Big Sound is hiring engineering talent as well as a Director of Client Services and Music Data Journalist. Check out the jobs page here: <a href=\"http://nextbigsound.com/jobs\" rel=\"nofollow\">http://nextbigsound.com/jobs</a><p>NBS builds analytics tools for the music industry by marrying social media data with traditional music industry data such as record sales, radio play, and digital sales. Raised a Series A in the beginning of the year and are looking for talented people to build out our team.","time":1335883746,"type":"comment"},{"by":"etrgreg","dead":true,"id":3914418,"parent":3913997,"text":"New York, NY<p>ExpandTheRoom, a boutique creative agency, is looking for full-time Mobile Developers (Windows Phone 7, iOS, Android) as well as PHP Developers and UX Designers. We have a truly excellent team of developers and designers, and a fun work environment and culture. We'd also consider internships. If you're interested, check the site - <a href=\"http://www.expandtheroom.com/jobs\" rel=\"nofollow\">http://www.expandtheroom.com/jobs</a> or contact us at iwannawork@expandtheroom.com.","time":1335882035,"type":"comment"},{"by":"langanmj","dead":true,"id":3914743,"parent":3913997,"text":"NYC - Ruby On Rails Developer at VaynerApps (Full-time)<p>VaynerApps is hiring a second engineer for our enterprise-focused R&#38;D group.<p>Learn more and apply at <a href=\"http://www.VaynerApps.com\" rel=\"nofollow\">http://www.VaynerApps.com</a>.","time":1335885677,"type":"comment"},{"by":"springub","dead":true,"id":3916002,"parent":3913997,"text":"Jimdo, Web Startup Generalist, San Francisco, full time<p>Are you ready to pitch in? Jimdo is looking for a Jack/Jill of all trades!<p>Are you comfortable with the Internet and web in all its forms? Do you enjoying doing some of everything? Join us for a different startup experience<p>Jimdo is the easy-to-use but powerful way to create websites. Jimdo has over 5 million users around the globe and is available in 11 languages with offices in Germany, Japan, China, and now the US. We opened our office in San Francisco to put together a small team to provide awesome support to our US customers and to approach the North American market more effectively (<a href=\"http://techcrunch.com/2011/05/19/website-building-tool-jimdo-is-taking-off-adding-cool-features-making-money/\" rel=\"nofollow\">http://techcrunch.com/2011/05/19/website-building-tool-jimdo...</a>). Our team in Germany handles product development and infrastructure, so we’re focused here on finding disruptive ways to reach US customers and establish our brand in North America.<p>Your responsibilities reflect our broad mission. Developing marketing campaigns, helping out with customer support and engagement (email &#38; live chat), SEO, editing help articles, finding and working with partners and affiliates, and more. It’s all hands on deck!<p>This position is full-time and located in our office in San Francisco's Mission district.<p>* We’re looking for someone who has exceptional knowledge about the Internet and building websites.\n * You should be not afraid of changing gears quickly nor of hunkering down on one project for several weeks.\n * Excellent communication skills -- for working with Jimdo users and colleagues around the world.\n * You should write well and clearly.<p>Benefits\nWorking for Jimdo in San Francisco is special since you'll feel like you're at a small startup -- but with a big team behind you. We want everyone who joins Jimdo to visit the office in Hamburg, Germany, about once a year to get to know and work with the European team. You could combine this with a holiday in Europe ;-)<p>* Competitive salary and benefits\n * Three weeks of vacation each year (we expect you to take it!)\n * Centrally located office in San Francisco's Mission District\n * Several health insurance options\n * Vision and dental insurance<p>Still unconvinced? Here are even more reasons to work at Jimdo! <a href=\"http://www.jimdo.com/about-1/reasons-to-work-at-jimdo/\" rel=\"nofollow\">http://www.jimdo.com/about-1/reasons-to-work-at-jimdo/</a><p>Go ahead: <a href=\"http://www.jimdo.com/jobs/\" rel=\"nofollow\">http://www.jimdo.com/jobs/</a>","time":1335900519,"type":"comment"}]]}