{"comments":[{"by":"trefn","id":3783795,"kids":[3785781,3789279],"parent":3783657,"text":"San Francisco, CA<p>FULLTIME<p>Mixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http://mixpanel.com</a>) is a web analytics startup based in San Francisco. We're still small - currently 11 people - and we've built some very interesting technology. To put it succinctly, our platform is the most powerful &#38; flexible analytics service available for mobile and the web.<p>We're growing significantly each month and we're cash-flow positive. It's a good position to be in.<p>We're hiring for a number of positions, but I'd like to highlight a few:<p>1. Solutions Architect - hybrid support/sales/marketing/engineering role. Really awesome for developers who want to do more client-facing stuff.<p>2. Director of marketing - we're looking for our 1st pure marketing hire.<p>3. Backend/ops engineer - we have a large amount of infrastructure (~200 servers) for a company our size &#38; need someone to manage it. This role is all about automation.<p>See <a href=\"http://mixpanel.com/jobs/\" rel=\"nofollow\">http://mixpanel.com/jobs/</a> to learn more, or you can message me directly - tim@mixpanel.com","time":1333291947,"type":"comment"},{"by":"DavidChouinard","id":3783808,"kids":[3784883],"parent":3783657,"text":"FlightAware (flightaware.com) — Houston, TX (no REMOTE, no H1B)<p>Front-end (UI/UX) Developer<p>Here’s a profile of us from 37signals (we do flight tracking software, 2M+ pageviews a day): <a href=\"http://37signals.com/svn/posts/2780-bootstrapped-profitable-proud-flightaware\" rel=\"nofollow\">http://37signals.com/svn/posts/2780-bootstrapped-profitable-...</a><p>We have very interesting data visualization and UI problems and your work will reach millions of users. We've also released a bunch of open source projects. You get top-of-the-line Apple gear and our kitchen is always stocked with snacks and beverages, including a free (!) beer kegerator. We’re a fun, high-caliber team that trusts you and gives you the freedom to be brilliant.<p>We’ve been around for a while and are profitable, but we’re still growing like mad. Compensation is very competitive.<p>Who you are:<p>• You have a trail of cool projects you’ve worked on, including some you’ve written to scratch your own itch.<p>• You obsess over the design of everyday things, from door knobs to teapots or light switches.<p>• You have a passion for software and desire to change the world.<p>• You have excellent implementation skills, including deep expertise in Javascript (jQuery).<p>• You enjoy working on tricky UI problems with equally smart people.<p>You can apply on our website: <a href=\"https://flightaware.com/about/careers/position/frontend_developer\" rel=\"nofollow\">https://flightaware.com/about/careers/position/frontend_deve...</a> or shoot me an email: david.chouinard@flightaware.com","time":1333292238,"type":"comment"},{"by":"avar","id":3784192,"parent":3783657,"text":"Amsterdam, The Netherlands.<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there and relocated over there about a year ago and have been very happy with it. We have people from all over the world relocating to work with us and are very well set up to handle relocation / visa issues.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.\nWe use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers. Everything we do is aimed at solving problems for our customers, if it doesn't help our customers we're not interested in doing it.<p>You don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>(This is a repeat of my January post (<a href=\"http://news.ycombinator.com/item?id=3413911\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3413911</a>) since it still applies, including the keyword \"H1B\" because while it's not in the US we'll similarly assist with the Dutch equivalent if relocation is needed)","time":1333298988,"type":"comment"},{"by":"motti","id":3783774,"kids":[3783829],"parent":3783657,"text":"London, UK<p>FULLTIME or INTERN<p>REMOTE or onsite in our London offices, or some hybrid arrangement.<p>We are building CopyCopy (<a href=\"http://www.copycopy.cc/\" rel=\"nofollow\">http://www.copycopy.cc/</a>) - a cross-platform tool that makes it simple to transfer anything between phones and desktop computers.<p>Join us on our exciting journey, where every day breeds new ideas and more possibilities. We are young, but headed by experienced engineers and looking for fast-learning, productive coders ready to take on the challenge of building a scalable, multi-platform consumer service.<p>Our Git repositories, code review and Project Management tools are geared towards remote working and we are open to flexible working conditions. We urgently need full-timers and interns (paid).<p>You should be familiar with one or more of:<p>• Java (for Android, BackberryOS, and in our homegrown lightweight Java server and its GWT frontend)<p>• C++ (for Win32, Qt, Android NDK and Objective-C++)<p>• Python (occasionally) to string bits together<p>• Objective-C (iPhone and Mac)<p>• JavaScript (web frontend work and browser extensions)<p>• Redis<p>Equity on top of salary for the right candidate.<p>We are happy to consider remote workers who are located in timezones +/-3 hours from London or you can work in our new North West London offices. Apply now to find out about our \"secret sauce\" that will make CopyCopy the simplest way of transferring anything between devices.<p>Just send your CV to jobs@copycopy.cc now and we'll be happy to chat!","time":1333291110,"type":"comment"},{"by":"smilliken","id":3784387,"parent":3783657,"text":"San Francisco - Engineer<p>MixRank (YC S11) is looking for a generalist engineer who will work with us to make online advertising less annoying, more relevant, and more effective. We want to bring the same kind of predictive analytics investment banks use to online advertising. Think of this as one giant optimization problem, with tremendous rewards if we can get it right.\nWe're currently a team of 5, but looking to grow over the next year. Some of the technologies we use every day include Python, PostgreSQL, Javascript, Git, Bash, and Linux; experience in any of these is great, but we also like generalists that can pick up new things quickly. Big data, machine learning, and analytics experience is encouraged.<p>jobs@mixrank.com<p><a href=\"http://techcrunch.com/2011/06/30/want-to-see-which-ads-perform-best-yc-backed-mixrank-is-a-spy-tool-for-adsense/\" rel=\"nofollow\">http://techcrunch.com/2011/06/30/want-to-see-which-ads-perfo...</a><p><a href=\"http://techcrunch.com/2011/12/13/display-ad-data-intelligence-startup-mixrank-raises-1-5m-from-mark-cubam-500-startups/\" rel=\"nofollow\">http://techcrunch.com/2011/12/13/display-ad-data-intelligenc...</a>","time":1333302433,"type":"comment"},{"by":"shrike","id":3784193,"kids":[3784730,3785613],"parent":3783657,"text":"Washington / California / Virginia / Singapore / Cape Town / Tokyo / Europe / Australia / REMOTE<p>Amazon Web Services is hiring!<p>Amazon Web Services (AWS) is a dynamic, growing business unit within Amazon.com. Since early 2006, Amazon Web Services has provided companies of all sizes with an infrastructure platform in the cloud. Using AWS, companies can requisition compute power, storage, and other services – gaining access to a global computing infrastructure that is the backbone of Amazon.com’s multi-billion dollar retail business. The team at AWS is committed to providing developers and their companies with tools and services to be successful.<p>AWS currently has job openings for:<p>- Software Development Engineers &#38; Managers<p>- Software Testing Engineers/Managers<p>- Product Managers &#38; Marketing Managers<p>- Developer Support Engineers<p>- Technical Program Managers<p>- Sales &#38; Business Development Representatives<p><a href=\"http://aws.amazon.com/careers/\" rel=\"nofollow\">http://aws.amazon.com/careers/</a><p>or you can get in touch with me directly, details in my profile.","time":1333299041,"type":"comment"},{"by":"axiom","id":3783731,"parent":3783657,"text":"Toronto, Ontario<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>) is hiring for a few roles: designer, sysadmin/infrastructure developer, general web developer. We also hire interns so please feel free to apply for that as well (paid of course.)<p>We're a profitable education startup that helps make class more engaging. We've got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>Our dev team is in Toronto but we've also got an office in San Francisco so if you're really good we would be open to having someone work from there.<p>Send your resume/github account to mike at tophatmonocle dot com.","time":1333290237,"type":"comment"},{"by":"ramses","id":3784492,"parent":3783657,"text":"Mountain View, CA. Both Full-time and Interns. <a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Pattern Insight is a booming startup making code and log analysis tools for a customer base that includes many titans of the tech industry. The data mining and static analysis technologies present in our product have strong research roots, as we grew out of PhD research done at the University of Illinois at Urbana-Champaign. Relatedly, our core engineering team has a strong academic background, and as a whole, published over 100+ articles in peer reviewed journals and conferences.<p>We are looking to expand our engineering team in sunny California. As stated above, we are also looking for a handful of interns. For more specific requirements, please see our career page: <a href=\"http://patterninsight.com/company/careers/\" rel=\"nofollow\">http://patterninsight.com/company/careers/</a><p>Come join us, we are still tiny and looking for people ready and willing to make decisions that shape our future.","time":1333304912,"type":"comment"},{"by":"randy","id":3785046,"parent":3783657,"text":"Ridejoy (YC S11). San Francisco, CA. Full time.<p>Engineer number one.<p>Interested in getting in on the ground floor of fundamentally changing the way people travel or, as one of our users said, \"restoring people's faith in humanity\"?<p><a href=\"http://ridejoy.com/jobs\" rel=\"nofollow\">http://ridejoy.com/jobs</a>","time":1333316627,"type":"comment"},{"by":"lpolovets","id":3783977,"parent":3783657,"text":"Factual is hiring in Palo Alto, Los Angeles, and Shanghai. Local candidates preferred, but remote work is possible for exceptional U.S. candidates. Full-time only. H1B is okay for very strong, non-remote applicants.<p>Factual's vision is to be an awesome and affordable data provider, so that developers, startups, and big companies can focus on innovation instead of data acquisition. We believe in openness and transparency rather than proprietariness and obfuscation.<p>We have a terrific team that is still fairly small, and an incredible CEO (he was the co-founder of Applied Semantics, which was sold to Google and became AdSense). In late 2010, we raised a Series A from Andreessen-Horowitz, and our customers and partners include Facebook, Newsweek, Yelp, and Blekko. We have lots of challenging problems to work on at all layers of the stack: data cleaning and canonicalization, deduping, storage, serving, APIs, etc. If you love data, Factual is the place to be.<p>We have job openings for software engineers of all levels. You would ideally know Java and/or Clojure, and you'll get bonus points for experience with machine learning, NLP, algorithm design, or Hadoop.<p>If you're interested in the Bay Area office, it just opened in December of 2011 and is very small, so you'd have a significant influence on the culture there.<p>You can email me personally at leo -at- factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1333295581,"type":"comment"},{"by":"squirrel","id":3783876,"parent":3783657,"text":"London (UK) and Boston (US).<p>We're a 100-person financial-software firm committed to learning and improvement as well as great web software and agile development. We're looking to hire both developers and sysadmins.<p>We use Java, Scala, and some Groovy; we always write tests first and pair on most coding tasks. Developers and sysadmins have Linux workstations with at least two monitors. We have weekly lightning talks that cover finance and technical topics. We have _real_ 10% time for relevant projects prioritised by technologists.<p>Some of you may know us from our sponsorship of Hacker News meetups in London. See <a href=\"http://devblog.timgroup.com\" rel=\"nofollow\">http://devblog.timgroup.com</a> and <a href=\"http://www.timgroup.com/careers\" rel=\"nofollow\">http://www.timgroup.com/careers</a> for more about us.<p>Note we recently changed our name from youDevise to TIMGroup but we're still the same folks!","time":1333293633,"type":"comment"},{"by":"rdoherty","id":3784583,"kids":[3796773],"parent":3783657,"text":"Mountain View, CA or remote\nSmugMug is hiring!<p>We're looking for QA, iOS developers, web developers (frontend and backend) and designers.<p>We created Camera Awesome, a top iTunes Store app, and are the leading photo website for pros who shoot everything from BMX to brides. We're proudly profitable, free and clear of VC investors.<p>Our core technologies are PHP, MySQL, Memcache, EC2, S3 and YUI. We're also doing a lot of new work with iOS on Camera Awesome.<p>We have our own personal chef, awesome (private!) offices with at $500 decoration budget when you start, just about any hardware you desire and yearly company trips (<a href=\"http://cmac.smugmug.com/Photography/Jackson-Hole/1/18570755_WwTXSf/1479711694_VbTbHNC/A\" rel=\"nofollow\">http://cmac.smugmug.com/Photography/Jackson-Hole/1/18570755_...</a>).<p>If you're interested send me an email (rdoherty@smugmug.com).","time":1333307036,"type":"comment"},{"by":"ladon86","id":3783806,"parent":3783657,"text":"ClassDojo<p>FULLTIME or INTERN in PALO ALTO, CA<p>ClassDojo is used by thousands of teachers to manage students’ behavior in the classroom, using real time feedback and rewards that can also be shared with parents.<p>We're an edtech startup funded by some of the biggest names in the valley, and we're one of the fastest growing education companies of all time. PG has invested in us, but we didn't do YC.<p>If you're a strong JavaScript hacker who wants to use node.js to change the world, apply here:<p><pre><code>  --------------------------\n  https://classdojo.wufoo.com/forms/join-classdojo/  \n  --------------------------  \n</code></pre>\nOr email jobs@classdojo.com<p>You can read about the work and environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a><p>We are looking for:<p><pre><code>  Lead Software Engineer (node.js)\n\n  Lead Front-end Developer</code></pre>","time":1333292209,"type":"comment"},{"by":"collinjackson","id":3784662,"parent":3783657,"text":"San Francisco, CA - Apportable (<a href=\"http://www.apportable.com\" rel=\"nofollow\">http://www.apportable.com</a>) full time or intern<p>We are building a platform for automatically porting iPhone apps to Android using open source projects like GNUstep, CFLite, and Cocotron as well as our own implementation of UIKit. Our customers describe Apportable as \"indistinguishable from magic\" and you’ll quickly see your work in the hands of millions of Android users.<p>We're a team of six engineers and are hiring more. Familiarity with iOS and/or Android NDK are a plus. We are a YC company with solid funding, great benefits, already profitable. We'd love to chat if you're interested - jobs@apportable.com","time":1333309036,"type":"comment"},{"by":"flyingyeti","id":3784695,"parent":3783657,"text":"Irvine, CA or Remote, full-time<p>The Prometheus Institute is looking for Web Application Engineers and Web Front-End Engineers to help architect and build our web and mobile infrastructure and support our goal of revolutionizing the way citizens interact with their government.<p>The Prometheus Institute is a civic technology startup whose mission is to pioneer innovative software to advance freedom and civic engagement, especially among the younger generations. We build tools, such as our iPhone app, Do-it-Yourself Democracy, that make it fun and easy to help citizens protect their freedoms and hold government accountable.<p>More info on DIY Democracy: <a href=\"http://theprometheusinstitute.org/index.php?option=com_content&#38;view=article&#38;id=793&#38;catid=98&#38;Itemid=126%2c\" rel=\"nofollow\">http://theprometheusinstitute.org/index.php?option=com_conte...</a><p>We are currently focused on rebuilding the DIY Democracy experience as a full web and mobile platform.  Our technology stack is built around Python, PostGIS and MongoDB.<p>Web Application Engineer: <a href=\"http://prometheuscivic.theresumator.com/apply/Tia2pG/Web-Application-Engineer.html?source=hn\" rel=\"nofollow\">http://prometheuscivic.theresumator.com/apply/Tia2pG/Web-App...</a><p>Web Front-End Engineer: <a href=\"http://prometheuscivic.theresumator.com/apply/bYzV4d/Web-FrontEnd-Engineer.html?source=hn\" rel=\"nofollow\">http://prometheuscivic.theresumator.com/apply/bYzV4d/Web-Fro...</a>","time":1333310164,"type":"comment"},{"by":"trvlngwlbry","id":3788401,"parent":3783657,"text":"Prior to July: Buenos Aires, Argentina (REMOTE is possible during this period).\nAfter July: Large city in the U.S.<p>Lead Developer<p>We are Bungolow, a startup putting the \"RAVE\" back in \"Travel\" (that's not actually our tagline, we promise -- just wanted to get your attention).  Bungolow is a members-only site featuring curated hotel bookings for the wide-open Latin American market. Check us out at www.bungolow.com.<p>The reason for the interesting location tag up top is that we are currently participating in a TechStars Network accelerator in Buenos Aires. After the program, we aim to locate in a large U.S. city. This means: a) if you are a U.S. citizen, you have the opportunity to come hang out in an awesome South American city for 3 months then return with us to the U.S. of A; or b) if you are from outside the U.S., we will do everything in our power to get a visa for you to work in the U.S. In both instances, having you with us in BA is preferred but not required.<p>We're looking for a lead developer to drive the technological direction of the company. This is an opportunity to get in on the ground floor of a high-potential start-up. The right candidate will be considered part of the founding team.<p>We're not as concerned about your education background or prior work experience (or for that matter, even the technologies you code in) as we are of seeing evidence of stuff you have shipped. Please send us some links to things you have created online, and make note of your involvement in each.<p>Send to careers at bungolow dot com.","time":1333378651,"type":"comment"},{"by":"ten7","id":3784470,"parent":3783657,"text":"Minneapolis, MN - Part-time and full-time contract to hire.<p>Front-end and back-end.<p>On site in Downtown Minneapolis.<p>TEN7 Contact Form: <a href=\"http://t7.io/Hzilsw\" rel=\"nofollow\">http://t7.io/Hzilsw</a><p>TEN7 Interactive is a web development studio in Minneapolis -- we work with great designers to implement solid Drupal based solutions for our clients and partners. We're looking for both front-end and back-end developers: we don't care where you are in your career, whether you're still in school and want a part-time gig or internship, or whether you're a seasoned veteran contractor or freelancer, that's looking to fill hours. We'd love to find out more about you, so please fill this form out: <a href=\"http://t7.io/Hzilsw\" rel=\"nofollow\">http://t7.io/Hzilsw</a> and we'll be in touch.<p>Since we're small, hiring a full-time employee is a big deal for us. We'd love for that match to be just right for us all. So, we'd love to work together a little before committing to each other permanently.<p><i>=</i>=<i>=</i>=<i>=</i>=<i>=</i>=<i>=</i>=<i>=</i>=<i>=</i>=<i>=</i>=<p>TEN7.com needs some work right now, in the mean time here are some of the sites we've built:<p>* <a href=\"http://www.animalhumanesociety.org/\" rel=\"nofollow\">http://www.animalhumanesociety.org/</a><p>* <a href=\"http://www.buildingthepinktower.org/\" rel=\"nofollow\">http://www.buildingthepinktower.org/</a><p>* <a href=\"http://www.kindestcutmn.com/\" rel=\"nofollow\">http://www.kindestcutmn.com/</a><p>* <a href=\"http://www.iltf.org/\" rel=\"nofollow\">http://www.iltf.org/</a>","time":1333304298,"type":"comment"},{"by":"erma87","id":3783983,"parent":3783657,"text":"Skillshare is hiring in NYC (FULLTIME &#38; INTERN)<p>We are building an online marketplace where anyone can be a teacher and share their skills through in-person classes.<p>Our mission is to flip the traditional notion of education on its head and make education accessible to everyone by empowering teaching. We believe that everyone has something they want to learn and something they can teach to others. This means our communities are really the greatest universities. Our platform helps make the exchange of knowledge easy, enriching, and fun.<p>Check out our manifesto here: <a href=\"http://www.skillshare.com/about/manifesto\" rel=\"nofollow\">http://www.skillshare.com/about/manifesto</a><p>We were named one of the 6 startups to watch in 2012 by Mashable (<a href=\"http://mashable.com/2012/01/08/6-startups-to-watch-in-2012/\" rel=\"nofollow\">http://mashable.com/2012/01/08/6-startups-to-watch-in-2012/</a>), and are backed by an incredible set of investors.<p>If you're passionate about changing the world and revolutionizing education, you can apply at <a href=\"http://www.skillshare.com/careers\" rel=\"nofollow\">http://www.skillshare.com/careers</a>.<p>We're hiring for the following positiong:<p><pre><code>  * Back-End Engineer\n  * Senior Engineer / Architect\n  * Front-End Engineer</code></pre>","time":1333295685,"type":"comment"},{"by":"dmarble","id":3784311,"parent":3783657,"text":"Palo Alto, CA or Arlington, VA - Full-stack Python/Coffeescript Developer - LOCAL or REMOTE (full-time preferred)<p>We're one of the thousands of startups doing social networking. Our focus is on groups and events. We think we have something unique to offer the world and are launching a beta in DC in April and expanding after that.<p>We've built a real-time stack that bridges backbone.js &#60;-&#62; socket.io &#60;-&#62; gunicorn+gevent &#60;-&#62; django. The web application is nearly all single-page architecture, with both web and mobile making use of an API. We use coffeescript pretty much everywhere.<p><pre><code>    * backend: python, django, gevent, gunicorn, nginx, postgres\n\n    * frontend: coffeescript, jQuery, backbone.js, socket.io, compass\n</code></pre>\nWe're looking for an advanced full-stack web developer. You know a lot about several or all of the above. Backend/frontend/query optimization/deployment.<p>We'll be growing our user base very soon -- we've amassed a small army of interns at most colleges around DC and need knowledge/experience optimizing and scaling the above technologies to handle growth. We're on the lookout for those who want senior developer ownership and can be mentors/leaders as we grow.<p>gmail - davidmarble","time":1333301062,"type":"comment"},{"by":"jcstauffer","id":3784343,"parent":3783657,"text":"True Fit, Woburn, MA. - SW Engineers, Dev Ops<p>True Fit, the global leader in fit personalization, delivers proven fit software to retailers selling footwear &#38; apparel online, allowing retailers to personalize their catalog to each consumer’s personal fit and style preference.  This breakthrough unlocks enormous opportunity for retailers, which has been saddled with low online footwear &#38; apparel sales penetration (~ 8%) and high returns therein (~40%-60%), due to unsure fit. True Fit solved the problem with proprietary machine learning software that virtually tries on each product and shows each consumer how that item will fit them and what size to get. We are generating revenue from the top online apparel retailers in the world, and have wide industry participation from over 300 brand partners.<p>We were recently profiled in the Wall Street Journal. The following link goes through Google to avoid the WSJ paywall: <a href=\"http://bit.ly/wsj-true-fit\" rel=\"nofollow\">http://bit.ly/wsj-true-fit</a><p>View opportunities at <a href=\"http://jobs.truefit.com/\" rel=\"nofollow\">http://jobs.truefit.com/</a>, or contact jobs@truefit.com for more information.","time":1333301519,"type":"comment"},{"by":"vanstee","id":3784180,"parent":3783657,"text":"Highgroove Studios (<a href=\"http://highgroove.com\" rel=\"nofollow\">http://highgroove.com</a>)<p>Atlanta, GA or Remote<p>Ruby and Ruby on Rails Developers<p>We focus on Back-end Ruby on Rails Development, using an Iterative/Agile process. Learn more about the position (<a href=\"http://highgroove.com/jobs\" rel=\"nofollow\">http://highgroove.com/jobs</a>) and check us out on github (<a href=\"http://github.com/highgroove\" rel=\"nofollow\">http://github.com/highgroove</a>).","time":1333298829,"type":"comment"},{"by":"tomblomfield","id":3783734,"parent":3783657,"text":"London - full time Ruby developers &#38; dev-ops. You must be able to work in the EU!<p>GoCardless - We're making online payments simple.<p><a href=\"https://gocardless.com/jobs\" rel=\"nofollow\">https://gocardless.com/jobs</a> Contact tom@gocardless.com for more details.","time":1333290330,"type":"comment"},{"by":"olivercameron","id":3784268,"parent":3783657,"text":"Palo Alto/Menlo Park, CA - Lead Designer - Full Time<p>Everyme is looking for a lead designer. We're building the true social network, backed by the address book. We do an incredible amount of intensive computations, but everyone we have showed the product to is surprised by how we've managed to keep the UI beautiful, simple and focused. We like to think we're a dream home for a designer, as every one of our 5 engineers all implement PSDs to the pixel. We're looking for someone who has designed iOS/Mac apps before, and has a keen eye for pixel perfection.<p>You'll be challenged on a daily basis to make our complex algorithms look simple to the end user. MG Siegler wrote a great post on us, which has a little more info about Everyme[1]. We're launching in 10 days, and have raised $1.5m from CrunchFund and others (Andreessen Horowitz, Greylock, SV Angel). To apply, please email oliver at everyme dot com with some of your previous work.<p>1. <a href=\"http://parislemon.com/post/11647475506/your-true-social-network\" rel=\"nofollow\">http://parislemon.com/post/11647475506/your-true-social-netw...</a>","time":1333300259,"type":"comment"},{"by":"sciurus","id":3783875,"parent":3783657,"text":"EuPathDB - Athens, GA<p>We're providing scientists with online research tools to help them decipher parasites that infect hundreds of millions of people worldwide.<p>At EuPathDB, you will work on the cutting-edge of genomic-scale data representation and visualization. As the amount of genomic-scale data grows, we need more developers to help us build tools that make performing dynamic computational experiments easy and accessible to all researchers. Our strong connection with our user community ensures that your work is of real benefit to science and public health.<p>The workplace at EuPathDB is a stimulating blend of academic and professional environments. As a university employee, you will receive a full range of benefits including three weeks of vacation, health insurance, and retirement contributions.<p>We have open positions for a web developer or a data developer. See <a href=\"http://jobs.eupathdb.org/\" rel=\"nofollow\">http://jobs.eupathdb.org/</a> for more information.","time":1333293622,"type":"comment"},{"by":"phillytom","id":3787434,"parent":3783657,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>We're hiring at Monetate. We've hired great people from HN.<p>We're a SAAS provider of testing, targeting, merchandising, agile content tools, primarily in internet marketing. We're funded by First Round and OpenView (among others).\n<a href=\"http://jobs.monetate.com/\" rel=\"nofollow\">http://jobs.monetate.com/</a><p>* We're looking for backend engineers who want to work on data and real-time API problems at scale.<p>* We're also hiring front-end developers who want to help build and test experiments and own our client facing UI. You should be experienced in working with production-quality cross-browser HTML/CSS and Javascript with and without frameworks.<p>We have fun problems at scale, great people to work with, and we get instant feedback from our clients on everything we put out! We're having a blast.<p>Feel free to email me with any questions - tjanofsky monetate com","time":1333364297,"type":"comment"},{"by":"diego","id":3784307,"parent":3783657,"text":"LinkedIn, Mountain View, CA. Local only.\nOur search back-end team is growing, and we are looking for an experienced manager for it. Job description pasted below.<p>Email dbasch AND iperisic at linkedin dot com<p>Responsibilities:<p>·       You will lead an innovative team of software developers to design, build and maintain our search infrastructure.\n·       You'll lead through uncertainty and collaborate with other engineering teams, Business Development, Legal, and teams across the organization to make things happen to achieve desired results.<p>Requirements:<p>·       Deep Software Technical Skills: You are deeply technical, understand how to break down problems and design extensible solutions. You have ample development experience in Java (preferably also C++ or other JVM-based languages such as Scala), as well as scripting languages. You know how to scale systems to a billion calls per day, how to parallelize requests, and how to build infrastructure and APIs for softwareservices. You have experience building large-scale information retrieval solutions, and understand search engines inside and out. You are intimately familiar with concepts such as garbage collection algorithms, parsing, lexing, building inverted indexes, ranking algorithms, etc. You have deep knowledge of the fundamental concepts discussed in books such as Modern Information Retrieval or Managing Gigabytes.\n·       You likely have a BS, MS or PhD in Computer Science or closely related field.<p>·       Management and Cross-Organizational Influence: You have demonstrated successful leadership in building and leading small, high-performance engineering teams. You understand the value of relationships and are highly effective at influencing cross-organizational teams to implement internal component APIs to meet the needs of external consumers. You communicate effectively to all levels inside the company and with partners.\n·       You're a very hands-on technical manager who can influence and lead the architecture, design and development of a scalable, high performance, and high reliability platform.","time":1333301034,"type":"comment"},{"by":"brandnewlow","id":3784070,"parent":3783657,"text":"NowSpots (<a href=\"http://nowspots.com\" rel=\"nofollow\">http://nowspots.com</a>) - Mountain View, CA<p>NowSpots are hackable ads.  Using our api, developers can push content from any app into a banner ad in real-time and track any number of events.  Newspapers use us to build ad units for small businesses.  eCommerce sites use us to build personalized product feed ads.  We turn banner ads into software.  It's a lot of fun. We were a finalist in the SXSW startup accelerator and have hundreds of clients.<p>We're looking for:<p>- Ruby Engineers to hack on our API and make it better<p>- Frontend Developers to design and implement features in our ad builder<p>- Account Managers with experience in real-time bidding and optimizing for ROI<p>- Account execs who can close sales and manage relationships<p>If you want to hack on product or sales for the app platform for advertising, ping us at hello@nowspots.com","time":1333297001,"type":"comment"},{"by":"dkadams","id":3783830,"parent":3783657,"text":"Austin, TX\nFull time\nOnsite, US resident<p>Baxter Planning Systems is seeking qualified candidates to join our team as Senior Java Developers.<p>Founded in 1993 with headquarters in Austin, TX, Baxter Planning Systems is a profitable owner-operated software company that sets the standard for the service parts planning industry. We offer an excellent benefits package and a small, casual work environment within a company that values work-home balance. Our office is conveniently located in West Austin.<p>Java/SQL (PostgreSQL)/Linux/JavaScript (Dojo)<p>We're currently rebuilding our front end, so we'd be especially interested in people who are interested in that, though we typically look for strong generalists.<p>Email: devjobs@bybaxter.com\n(Please ignore the job description on our website. It is out of date.)","time":1333292700,"type":"comment"},{"by":"asuth","id":3784315,"parent":3783657,"text":"San Francisco, CA<p>Quizlet is a learning platform for students that puts students in control of their own learning. We're used by millions of high school and college students and are a top-400 website in the US.<p>Quizlet wants to build a next generation of learning tools that enable students to deeply and creatively learn whatever they need and allowing students to be the source of their own curriculum.<p>We're looking for developers interested in working on the entire stack, but specialization is ok too. Check out our recent Nodejam win for a look at what we do: <a href=\"http://quizlet.com/blog/an-epic-how-quizlet-won-nodejam/\" rel=\"nofollow\">http://quizlet.com/blog/an-epic-how-quizlet-won-nodejam/</a><p><a href=\"http://quizlet.com/jobs/\" rel=\"nofollow\">http://quizlet.com/jobs/</a>","time":1333301076,"type":"comment"},{"by":"ivanzhao","id":3784132,"parent":3783657,"text":"Inkling, San Francisco, CA<p>Inkling is a publishing startup. We are a new medium, the future of books and publishing (currently with a focus on iPad); our platform is so good that completely leaves ebooks in the dust, and even most major publishing houses are invested in us.<p>We are hiring engineers of all kinds, from the JavaScript/Python/Scala/iOS/sysadmin to interns. We are Sequoia-backed and just recently secured another round of $17 million funding.<p>The team is lean and flat. Located in the downtown SF right by the subway, TV-celebrity chef in house, the best gym in town, plus generous salary and options.<p><a href=\"http://www.inkling.com/jobs/openings/\" rel=\"nofollow\">http://www.inkling.com/jobs/openings/</a><p>Contact annemarie@inkling.com directly if you are interested","time":1333297994,"type":"comment"},{"by":"martian","id":3784197,"parent":3783657,"text":"San Francisco<p>Software Engineer, Front-end Developer<p>Thumbtack is hiring awesome software engineers to transform the way services are bought and sold online. We're Amazon for services. A quarter of a million small businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. We're well on our way to being profitable and growing quickly.<p>Our team is young and passionate and dedicated to good engineering. We have extensive benefits, including a in-house chef, a gorgeous office in SOMA, and money to spend on Thumbtack services every month.<p>Our delicious food culture was recently the top story on Inc.com.<p>Apply at <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Or email chris at thumbtack with any questions.","time":1333299083,"type":"comment"},{"by":"triggit","id":3783810,"parent":3783657,"text":"Triggit, Inc.<p>San Francisco, CA  - Full-Time - NO REMOTE - H-1B friendly<p><a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a><p>Base pay for engineers starts in the six figures, you get to build your own battle station, and every engineer gets an office with a door.  We have a really cool office with high ceilings and natural light.  We also do daily catered lunches.<p>Available positions:<p><pre><code>  Senior Linux System Administration / Developer Ops\n\n  Senior Reporting Engineer\n\n  Senior Engineer: Ad Serving Systems\n\n  Ruby on Rails Developer (Full Stack)\n\n</code></pre>\nWe're hiring aggressively, so check out <a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a> or hit up engjobs+hn@triggit.com","time":1333292286,"type":"comment"},{"by":"joelcollinsdc","id":3783855,"parent":3783657,"text":"Washington, DC - Fulltime - US House of Representatives\n<a href=\"http://house.gov/content/jobs/vacancyDetails.php?PositionID=2331\" rel=\"nofollow\">http://house.gov/content/jobs/vacancyDetails.php?PositionID=...</a><p>The job posting is a little ambiguous; we really just need a smart developer that integrates well with the team.  We have a ton of small projects going on in a variety of technology stacks so its hard coming up with a concise job position.<p>While I admit the company is pretty much the opposite of a startup, the job is very rewarding and there is a huge potential to create value with your work.  I'm a developer there; message me if you have any questions.","time":1333293112,"type":"comment"},{"by":"jack7890","id":3783749,"parent":3783657,"text":"New York, NY -- Web Engineer -- Fulltime -- SeatGeek<p>SeatGeek is the web's largest search engine for live event tickets. Think \"Kayak for sports/music/theater tickets.\"<p>Our dev team currently has seven people. We're looking to add one or two more. We're specialization-agnostic. Most of our current guys are pretty full stack, so wherever in the web stack you like to spend your time, we can find a place for you.<p>We're using lots of Python these days. A bit of Ruby and PHP too.  And always plenty of JS, supported by backbone.  Mongo and MySQL for data stores.<p>More details here: <a href=\"http://seatgeek.com/jobs/web_engineer/\" rel=\"nofollow\">http://seatgeek.com/jobs/web_engineer/</a>","time":1333290611,"type":"comment"},{"by":"BrandonMTurner","id":3783874,"parent":3783657,"text":"Boston, MA (No remote) - Full Time - <a href=\"http://www.loseit.com\" rel=\"nofollow\">http://www.loseit.com</a><p>= About Lose It! =<p>Lose It! is a popular iPhone / Android / Website application that changes people's lives by helping them manage their weight.<p>8M+ iPhone Downloads (currently top 10 in Health category)<p>500k+ Android Downloads (very new, currently top 15 in Health category)<p>2M Website enabled users (connecting to our website is optional)<p>2M Uniques per month across all platforms<p>9M+ pounds of weight have been lost by website enabled users (Estimated ~18M pounds lost across all users)<p>8k messages betweens users that opted into social features per day<p>450M+ foods logged by website enabled users<p>Current Team - 1 CEO (technical), 1 Developer (me), 1 Business Dev, 1 Community Manager<p>Current Stack - GWT, MySQL, Java (server side and Android), AWS, Objective C (iPhone), Membase<p>Current Tools - Intellij, Git, Navicat, New Relic, CloudBees, Asana<p>= Who we are looking for =<p>Lose It! is looking for new members (we have more then one spot open) for our product team to help us build our next generation of products. We believe that small teams of well rounded people can do great things, so we're looking for someone that can contribute to all phases of building a great product. We believe that iterating on our products with customers is the best way to build something great, so we'd like someone who enjoys talking to customers and making them happy (and maybe even helping to change their lives).\nAs a software engineer at Lose It!, you'll be an early member of the team that is building the core product, the most complete and effective weight loss software spanning mobile devices and the web. You should have a passion for and a proven track record of building products that delight users.<p>= Who to contact =<p>{first name} at loseit.com - If you think you would be a good fit send me an email with anything (resume, cover letter, github account, maybe just a simple 'hello'. I'll read anything and everything you send).","time":1333293568,"type":"comment"},{"by":"jingoro","id":3783831,"parent":3783657,"text":"FULLTIME / REMOTE - Massachusetts or Northeastern USA<p>Pat Deegan &#38; Associates makes innovative, recovery-oriented tools to support those of us with mental illness. We're in a growth phase and so we're looking for web developers who are passionate about one or more of the following:<p>* Ruby on Rails\n* Web sysops and/or security\n* Healthcare data management (HIPAA/HITECH)\n* Healthcare research<p>See <a href=\"http://www.patdeegan.com/\" rel=\"nofollow\">http://www.patdeegan.com/</a> to learn more about us. If you're interested, send us an email with your information to jobs@patdeegan.com. Thanks!","time":1333292732,"type":"comment"},{"by":"zds","id":3784182,"parent":3783657,"text":"New York (NYC)<p>Developer, Designer, or Developer Evangelist<p>Codecademy is the easiest way to learn to code.  Since our launch in August 2011, more than 1 million people have started learning the basics of languages like JavaScript.  We've raised more than $2.5m from Y Combinator, Union Square Ventures, Ron Conway, and others, and we've built out an awesome team of 9 that's committed to changing the way education works.<p>We use Ruby/Rails, MongoDB, and backbone.js, but we're not picky if you can learn fast and adapt.<p>Email us at jobs (at) codecademy (dot) com or check out codecademy.com/jobs.","time":1333298829,"type":"comment"},{"by":"acdoherty","id":3788128,"parent":3783657,"text":"Chicago, IL\nIMC Financial Markets is a prop trading firm in Chicago. We employ brilliant traders and technologists and truly believe in the symbiotic relationship between the two. We’d post a job description but the truth is- everyone here works outside of their  “job description”….every day.<p>We're primarily a Java shop – show us your skills! Also looking for web developers and systems admins. You’ll be working with the latest technologies and constantly expected to become an expert in things you don’t know, roll with the changes, ask the right questions, and produce killer solutions.<p>Use everything available to you to solve the task at hand—whether it’s writing code that runs on boxes colocated in exchanges all around the world, writing scripts that manage these boxes and tuning them for increased performance, or working on ways to improve testing our code.<p>Added perks…\n    Seriously sweet Chicago office space –think Snacks, bar, etc.\n    Lunches delivered daily from nearby restaurants – btw they’re free!\n    Choose your own workstation preference (Mac/PC)\n    Great Pay\n    Full slew of benefits – pay no premiums\n   A cutting edge, Agile technology environment.<p>Looking to have significant creative influence on one of the world’s most successful trading firms?…don’t wait, APPLY.<p>Heather.Corallo@IMC-Chicago.com\n<a href=\"http://www.imc.nl/Financial-markets/Offices/Chicago/Vacancies/\" rel=\"nofollow\">http://www.imc.nl/Financial-markets/Offices/Chicago/Vacancie...</a>","time":1333375439,"type":"comment"},{"by":"brycereynolds","id":3824018,"parent":3783657,"text":"Palo Alto, CA (FULL-TIME, INTERN, H1B welcome)<p>Fellow engineers! We are hiring at Bloomboard! \n<a href=\"http://www.bloomboard.com/\" rel=\"nofollow\">http://www.bloomboard.com/</a>\n<a href=\"http://www.bloomboard.com/careers/\" rel=\"nofollow\">http://www.bloomboard.com/careers/</a><p>We are a small startup currently working out of the AOL building on Page Mill. We just won within our division at South by Southwest (<a href=\"http://tiny.cc/0mckcw\" rel=\"nofollow\">http://tiny.cc/0mckcw</a>) and recently had an article written about us in the Wall Street Journal (<a href=\"http://tiny.cc/ulckcw\" rel=\"nofollow\">http://tiny.cc/ulckcw</a>).<p>We are writing software that is having a direct impact on K12 education throughout America. Our hope is that our product will increase the effectiveness of the teacher evaluation process as well provide a large marketplace of tools and training for schools throughout the Country.<p>Right now we are small but we are growing very fast. We are only hiring top-tier engineers that have a passion for what they are doing and would like to see their efforts help something that really matters.<p>We are currently building LAMP applications but we are open to hiring smart people that run the gammat. If you know how to program, you know UX/design, you excel in mobile or you are a mad mathematician and want to get some IP under your belt, drop me a line!<p>Bryce<p>Send any questions, comments or resumes my way.\nbryce@bloomboard.com\nSenior Engineer, Bloomboard","time":1334087059,"type":"comment"},{"by":"jsatok","id":3784040,"parent":3783657,"text":"AppHero (apphero.com) - Toronto, Ontario, Canada<p>AppHero is looking for an engineer to join our team and help us revolutionize the way people discover mobile apps.<p>About you:<p>- Passionate about building disruptive products that solve big problems<p>- Excited by the opportunity to learn new things and question norms<p>- Self starter who enjoys thinking outside the box<p>- Entrepreneurial spirit and are interesting in taking an active role in growing AppHero<p>- Experience using Java to build applications<p>- Interested in working on the backend for web and mobile apps<p>More info here: <a href=\"http://apphero.com/careers\" rel=\"nofollow\">http://apphero.com/careers</a>","time":1333296572,"type":"comment"},{"by":"derwiki","id":3784511,"parent":3783657,"text":"San Francisco, fulltime/internships/H1B Causes - <a href=\"http://www.causes.com/joinus\" rel=\"nofollow\">http://www.causes.com/joinus</a> At Causes, use your programming powers to help nonprofits effect change on the world! Ruby on Rails + jQuery stack, 10-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, etc.\nWays we're trying to make ourselves better engineers:\n- deliberate practice with our tools. If you are a vim user, we have the programmer who wrote Command-T on staff and he's a great person to learn from\n- every changeset gets pushed to Gerrit where it waits to get a +1 from our build suite (that runs in 3 minutes) and a +1 from a human reviewer\n- actively upgrading our version of Rails, and not stopping until we hit bleeding edge. We hit Rails 2.3.14 last week and hope to hit 3.0.11 within the month\n- everyone is encouraged to take one hour from their day to learn about something they wouldn't otherwise\n- every story is scoped so that it can be completed in less than a day. We don't branch, we just work on top of master. We've found that the closer we stay to master, the less needless work we create for ourselves\nCauses is a great place to better yourself and better the world. Apply through the site or adam@causes.com if interested!","time":1333305271,"type":"comment"},{"by":"dbodescu","id":3791992,"parent":3783657,"text":"Basel/ Bucharest<p>Java&#38; Web Developers<p>Adobe is hiring Java&#38; Web Developers in Switzerland and Romania.\nAs a part of the Day team in Switzerland and Romania, we are looking for well-rounded developers who know how to create robust products and are able to develop prototypes quickly. You should have a good understanding of and practical experience with Java.<p>Responsibilities\n• Designs, modifies, develops, writes and supports product level software • Participates in the testing, documentation process through test review and analysis, test witnessing and certification of software<p>Requirements\nFor this job we are searching for people with:\n•       Bachelor's degree in Computer Science or a related area and 4-6 years of experience in the field or in a related area\n•       Familiar with a variety of the field's concepts, practices and procedures\n•       Strong knowledge of Web technologies, especially JAVA and JavaScript, system drivers and API's, website architecture\n•       Proficiency  in HTML, DHTML, CSS, XML\n•       Software Product development experience desired\n•       Teamplayer who thrives under pressure\n•       Interest in working with leading edge technology and demanding customers\n•       Excellent interpersonal and communication skills\n•       Good knowledge of English<p>You can apply at jobs-basel@adobe.com for Switzerland, or at hr-romania@adobe.com for Romania.","time":1333440000,"type":"comment"},{"by":"bendilts","id":3786241,"parent":3783657,"text":"Salt Lake City, UT. - <a href=\"http://www.lucidchart.com\" rel=\"nofollow\">http://www.lucidchart.com</a><p>LucidChart is an HTML5 diagramming application that proves web apps don't need to be pale imitations of their full-featured desktop counterparts. Real-time collaboration and full versioning history aren't our only advantages; users tell us they like LucidChart because it's faster, easier, and smoother than Visio and Omnigraffle.<p>We need great engineers who want to work in a Silicon Valley startup, but would rather live 15 minutes from the ski resorts in Utah. We have one of the largest Javascript codebases on the Internet supporting LucidChart's client, and are using Scala, PHP, node.js, MongoDB, and MySQL to power our servers. Experience in one or more of these areas is helpful, but we're most interested in people with inhuman problem solving skills.<p>We currently have 9 full-time employees, including 6 engineers. That ratio reflects the focus of our organization -- we are a software company, and we live or die on the strength of our engineering team. We think we have the strongest engineering team in Utah, and want to add at least 3-5 people this year.<p>All hires are made by unanimous decision of the current team. If you join us, you can know that everyone here wants you here.<p>Send resumes, github profiles, or whatever else might be relevant to jobs at lucidchart dot com.","time":1333339284,"type":"comment"},{"by":"5vforest","id":3784005,"parent":3783657,"text":"Berkeley, CA<p>GovHub is looking for a full-stack web developer to join our team in Berkeley, CA.<p>GovHub is a nonpartisan, web-based citizens' forum that provides a personalized platform for political engagement. We give citizens the tools and information to interact with their elected officials in new, innovative ways.<p>We’re just two weeks past our public beta launch, but we’re rapidly expanding and know that we’ll need to expand the team if we want to challenge the notion that as a citizen in the United States, your influence ends at the ballot box. We have some great support from people both in the technology and political sectors, and the consensus is that this is the perfect time to be digitizing politics.<p>We’re currently a team of 2.5 developers and we’re looking for someone to join us full-time. We have a bunch of ideas and projects that we think you'll be excited to work on, but you will have just as much say as we do in determining our direction.<p>Our current stack is Symfony + Doctrine ORM + Saas + jQuery + PagodaBox (PHP PaaS). No need for familiarity with these, but experience with a MVC framework is necessary. We're also doing mobile development with Sencha Touch 2, so that might be a place where you'd need to lend a hand.<p>We can offer a competitive salary, equity, sandwiches, &#38; a chance to be part of a company that revolutionizes modern democracy.<p>Email me at abecker (at) mygovhub (dot) org.","time":1333296128,"type":"comment"},{"by":"schelle","id":3784087,"parent":3783657,"text":"Indiegogo (<a href=\"http://www.indiegogo.com\" rel=\"nofollow\">http://www.indiegogo.com</a>) -- San Francisco<p>We're hitting another inflection point and looking to add some more world-class people to the team!<p>Available positions:<p><pre><code>  Ruby on Rails Developer (Dev Ops focus)\n\n  Ruby on Rails Developer (Performance and Scaling focus)\n\n  Ruby on Rails Developer (Front End focus)\n\n  QA / Technical Analyst\n\n  Customer Happiness Agent\n\n</code></pre>\nPlease email: hn-jobs@indiegogo.com<p>Thanks,\nEric Schell, Founder/CTO<p>Indiegogo is the leading global platform for crowdfunding, empowering anyone, anywhere, to raise money for anything. We've enabled people to launch campaigns in 200 countries across the world in areas spanning creative, cause and entrepreneurial projects.  Our product is free and easy to start a campaign and Indiegogo provides a truly merit based system to help increase campaign exposure and awareness.  The company has appeared on Oprah, Today, and the BBC, as well as in the Wall Street Journal, The Guardian, and The New York Times. For more information, visit <a href=\"http://www.indiegogo.com\" rel=\"nofollow\">http://www.indiegogo.com</a> and follow at <a href=\"http://www.twitter.com/indiegogo\" rel=\"nofollow\">http://www.twitter.com/indiegogo</a> and <a href=\"http://www.facebook.com/indiegogo\" rel=\"nofollow\">http://www.facebook.com/indiegogo</a>","time":1333297184,"type":"comment"},{"by":"joelbirchler","id":3795179,"parent":3783657,"text":"DECK Monitoring (deckmonitoring.com) is looking for senior developers and a sys admin.<p>Skills &#38; Requirements\n---------------------\n* At least six years of programming experience, professional or unprofessional. \n* You have tackled tough problems and developed large, highly-available applications.\n* An excellent command of a high-level language such as Ruby or Python. We use Ruby extensively.\n* Strong SQL skills.\n* Best practices are in your bones. You write unit tests, pair code, peer review and strive to create beautiful code.<p>Bonus points if you have experience wih:<p>* Rails, RSpec, Cucumber, Sinatra, Git, Lua, R, Redis, Resque, JavaScript, HTML5/CSS\n* Math and Statistics\n* Energy monitoring \n* Scrum/agile methodologies<p>About DECK Monitoring LLC\n-------------------------\nDECK Monitoring is the US market-leader SaaS renewable energy monitoring company. We make great software and take on complex problems (with the help of a whiteboard and some code). We hire the best programmers that we can find and treat them well.<p>* Competitive salary and benefit package (medical, dental, retirement)\n* Conferences, books and other perks\n* Choice of Linux or Mac, editor, etc\n* Offices downtown Eugene and Portland<p>How to Apply\n------------\nSend a paragraph about yourself with relevant links to recent code and a plain-text or pdf resume to careers[at]deckmonitoring.com","time":1333493035,"type":"comment"},{"by":"mikebabineau","id":3784308,"kids":[3792557],"parent":3783657,"text":"Rumble - SF Bay Area (Redwood Shores)<p>Lead/senior/mid-level engineers, data scientists, BI, producers, artists, designers, more - <a href=\"http://www.rumblegames.com/careers\" rel=\"nofollow\">http://www.rumblegames.com/careers</a><p>Rumble is a developer and publisher of connected games. We were founded in 2011 with a mission to create the most engaging and fulfilling online game experiences on the planet. All of our games are free-to-play and available across your favorite devices and social networks. We are unique in our focus on the gamer audience and our exacting standards around quality gameplay. Our passion is to create experiences that surprise and delight our players. By combining the best of AAA game design with free-to-play accessibility, we believe we will change the way gamers play together.<p>We have an all-star team of game industry veterans from Zynga, Activision, BioWare, Blizzard, Playdom, Electronic Arts, Turbine, FooMojo and RockYou. Check us out:<p><a href=\"http://www.rumblegames.com/about/our-team\" rel=\"nofollow\">http://www.rumblegames.com/about/our-team</a><p>We are backed by Rick Thompson, Google Ventures, and Khosla Ventures, and recently closed a $15mm series A:<p><a href=\"http://techcrunch.com/2011/12/01/rumble-to-build-and-publish..\" rel=\"nofollow\">http://techcrunch.com/2011/12/01/rumble-to-build-and-publish...</a>.<p><a href=\"http://venturebeat.com/2011/12/01/former-ceo-of-bioware-and-..\" rel=\"nofollow\">http://venturebeat.com/2011/12/01/former-ceo-of-bioware-and-...</a>.<p>Drop me a line: mike.babineau@rumblegames.com","time":1333301040,"type":"comment"},{"by":"ginkgoo","id":3784059,"parent":3783657,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology.<p>Ginkgo BioWorks is a well-funded MIT spinout that genetically engineers organisms that make the world better. Stop building web apps and work on something that matters: <a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a><p>apply here: <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1333296893,"type":"comment"},{"by":"gapcm","id":3784278,"parent":3783657,"text":"Toronto, Ontario (Mississauga) – Vena Solutions (<a href=\"http://venasolutions.com\" rel=\"nofollow\">http://venasolutions.com</a>)<p>Vena Solutions is a pioneer in a new area known as Spreadsheet Process Management (SPM).  We deliver a next generation software solution for business-critical spreadsheets in the Finance and Accounting departments of companies.  Our flagship product, Vena SPM, delivers the only complete web-based spreadsheet management solution in the market.\nWe are looking for passionate developers and engineers who are looking to join the ranks of a top-notch team where people have fun and strive to create innovative software.<p>Responsibilities Include:\n- Participating in the entire software development cycle\n- Analyzing, designing, and developing new features and products\n- Solving complex business problems for our world-class client organizations\n- Building new software on the latest technologies<p>Skills and Qualifications:\n- Bachelor's degree in Computer Science, Engineering or closely related field\n- Software development experience using an Object Oriented programming language like Java, C++ or C#\n- Strong command of Object Oriented design and development\n- Sound knowledge of Software development practices\n- Strong verbal and written communication skills<p>Additional Assets:\n- Hands-on experience in Java\n- Hands-on experience in JavaScript\n- Hands-on experience with SQL databases\n- Exposure to REST and/or web services<p>For more information about Vena Solutions please visit our website at www.venasolutions.com\nTo apply please email careers@venasolutions.com and include 'HN' or 'Hacker News' in the subject","time":1333300398,"type":"comment"},{"by":"oakenshield","id":3787008,"parent":3783657,"text":"Stealth startup (YC W12) - Mountain View, CA - Paid INTERN (local)<p>We are building a secure Platform-as-a-Service that is more secure and compliant than existing PaaS systems. Existing PaaS offerings cannot support applications that need to comply with regulations such as HIPAA or PCI-DSS, and we are building a PaaS based on public cloud infrastructures (AWS, Rackspace) that can do exactly this.<p>You will be working with the founding team and get valuable experience in working in a startup environment. 12-14 week internships typically starting in early May. Competitive pay.<p>What we're looking for<p>* A great programmer with a solid CS background. We want someone that spends time hacking outside work and has fun doing it. Ideal candidates would have deep experience in Web programming with some popular framework. Ruby on Rails / Django or a Java-based framework is good, but knowledge of multiple frameworks is a plus.<p>* Reasonable AWS (or Rackspace) experience. This includes using EC2/EBS/S3/RDS/IAM including the API, automation using Chef (or Puppet), managing and monitoring instances, etc.<p>* Some systems programming experience including a reasonable understanding of OSes, networking, and crypto / security. It would be a huge plus if you have substantial experience with C/C++ and systems programming on Linux.<p>* Above all, a fast learner. We don't care if you don't know a technology, as long as you have the desire to learn.<p>To apply, please send a github/stackoverflow/whatever profile or links to other stuff you've done (and a resume if you must) to oakenthrones@gmail.com.","time":1333356559,"type":"comment"},{"by":"ezra_ck12","id":3784224,"parent":3783657,"text":"CK-12, a non-profit, seeks highly motivated individuals to become part of a team set to revolutionize K-12 global learning and textbook publishing.\nThrough the use of a superior open-source environment, CK-12 aims to create a major paradigm shift from traditional textbook learning and publishing to collaborative online learning and customized textbook publishing designed to foster greater relevance and resonance among teachers, students, and communities.<p>We are currently looking for the following positions\n» Developer (<a href=\"http://about.ck12.org/about/join-us/developer\" rel=\"nofollow\">http://about.ck12.org/about/join-us/developer</a>)<p>» Senior Developer (<a href=\"http://about.ck12.org/about/join-us/senior-developer\" rel=\"nofollow\">http://about.ck12.org/about/join-us/senior-developer</a>)<p>» Support Engineer (<a href=\"http://about.ck12.org/about/join-us/support-engineer\" rel=\"nofollow\">http://about.ck12.org/about/join-us/support-engineer</a>)<p>» UI Engineer (<a href=\"http://about.ck12.org/about/join-us/ui-engineer\" rel=\"nofollow\">http://about.ck12.org/about/join-us/ui-engineer</a>)<p>» User Interaction Designer (<a href=\"http://about.ck12.org/about/join-us/user-interaction-designer\" rel=\"nofollow\">http://about.ck12.org/about/join-us/user-interaction-designe...</a>)<p>Please send your resume to ezra(at)ck12(dot)org","time":1333299457,"type":"comment"},{"by":"jonbischke","id":3784664,"parent":3783657,"text":"Entelo is hiring: <a href=\"http://www.entelo.com/jobs\" rel=\"nofollow\">http://www.entelo.com/jobs</a><p>Our belief is that a primary barrier to growth for most companies is the difficulty associated with discovering and assessing talent. Entelo helps make proactive recruiting more efficient and effective and is currently used by more than 200 companies, from startups all the way up to the Fortune 50.<p>• Our current stack includes Ruby, Rails, Scala, MySQL, MongoDB, Resque, and elasticsearch and other big data technologies.<p>• We're also contributing to open source as much as we can (e.g., <a href=\"https://github.com/rglabs/teleport\" rel=\"nofollow\">https://github.com/rglabs/teleport</a>, <a href=\"https://github.com/gip/resque-telework\" rel=\"nofollow\">https://github.com/gip/resque-telework</a>) and eventually plan to have open source contributions that don't start with \"tele\". :)<p>• In addition to Github we're using Asana internally to manage projects and we operate in very flexible way.<p>• We provide competitive compensation, generous benefits, a beautiful office working environment in the Mission (SF) and catered meals from Munchery. We're backed by two leading venture capital firms.<p>If you're interested in hearing more, please send me an email directly (I'm a founder of the company) at jon@entelo.com","time":1333309085,"type":"comment"},{"by":"kluikens","id":3788913,"kids":[3818273,3818279],"parent":3783657,"text":"HeartFlow — Redwood City, CA (no REMOTE, possible H1B)<p>------------------------------------------------------<p>Software Test Engineer<p>\"HeartFlow is looking for programmers to help in the design and development of a comprehensive test automation platform for HeartFlow’s products. Applicants should have a good understanding and hands on knowledge of Java, Javascript, Python, HTML/CSS, XML/XSLT, and SQL.\"<p>That official list of skills is more of a wishlist.<p>A few parts of our product are written in C++, so it'd be nice if you could understand it enough for testing. I've spent a good lot of time in C, but have no C++ experience myself. Most everything else in that skill list doesn't require an in-depth expertise, other than Java. Day-to-day, most of your time will be spent in Java.<p>What do we do? Watch this video: <a href=\"http://heartflow.com/wp-content/themes/greenapplesolutions/scripts/video.html\" rel=\"nofollow\">http://heartflow.com/wp-content/themes/greenapplesolutions/s...</a><p>Other open positions:<p>• Biomedical Test Engineer (Cardiovascular Simulation &#38; Imaging)<p>• UX Designer<p>• Software Developer in Cloud Services<p>• Software Developer in Web Applications<p>• Sales Representative (Northern Europe)<p>You can apply on our website (<a href=\"http://heartflow.com/jobs/\" rel=\"nofollow\">http://heartflow.com/jobs/</a>) or shoot me an email: [username]@heartflow.com","time":1333384965,"type":"comment"},{"by":"dillyh","id":3783957,"parent":3783657,"text":"Atlassian Software - Support Engineer &#38; SaaS Support Engineer<p>San Francisco, CA (On site only) - Full Time<p>Atlassian is the makers of JIRA and Confluence, an enterprise bug-tracker and wiki tool that helps teams turn ideas into reality.  We're looking for Support Engineers to come join us in San Francisco and be part of a growing team that has one goal: Making our customers awesome!<p>This isn't your typical Support gig.  At Atlassian, Support Engineers have the responsibility of working with our broad range of small to large customers and have the opportunity to think like owners.  SE's commonly work with development on bug fixes, provide fixes themselves and are able to influence product direction.  We're a growing company so there's a lot of opportunity to work with a broad range of technologies and products.<p>You'll be working out of our brand-spankin' new office in SOMA.  Beer on tap, massage chairs, fully stocked kitchen, etc.  Most of all you'll get to work with our kick-ass suite of developer tools and help customers from Twitter to NASA help get the most out of our products.  We're also a global company with offices in Sydney and Amsterdam and engineers often travel for training and work opportunities.<p>A great candidate can hit that sweet spot between a technical and a customer facing role.  They have a lust to learn new technologies and are responsible for owning customer issues until resolution.  If this sounds like something you'd be interested in, check out the page below for a full job description and to apply.  If you have any questions feel free to contact me directly - dhansen at atlassian dot com.<p><a href=\"http://atlss.in/sfsupport\" rel=\"nofollow\">http://atlss.in/sfsupport</a>","time":1333295251,"type":"comment"},{"by":"chrisrb","id":3808489,"parent":3783657,"text":"San Francisco, CA\nFulltime\nHotelTonight - <a href=\"http://hoteltonight.com\" rel=\"nofollow\">http://hoteltonight.com</a><p>We're a mobile-only, last-minute hotel booking service. iOS, Android, and mobile web, as well as an extensive backend (Rails and HTML5 mobile apps). We're a top rated travel app in the app stores, and our other customers, the hotels, love us as well. We just released our new iPad app, which is fscking beautiful if I do say so! Check it out.<p>We're backed by Battery, Accel, and First Round Capital. The office is on 2nd near Mission, two beers on tap, ping pong table, pool table, various video games, etc. We have a great team, and we're eager for more great folks to join us.<p>We take enormous pride in the product experiences we deliver to both customers and hotel partners. We build amazing products by questioning the standard way of doing things. We're looking for outstanding product builders who shares our passion for beautiful, practical products that earn raves from our peers and our customers.<p>We have several positions open for various developers as well as designers and many more. Check it out:<p><a href=\"http://hoteltonight.com/jobs\" rel=\"nofollow\">http://hoteltonight.com/jobs</a>","time":1333739972,"type":"comment"},{"by":"nixme","id":3784088,"parent":3783657,"text":"San Francisco, CA - Do (<a href=\"http://do.com\" rel=\"nofollow\">http://do.com</a>)<p>Do is on a mission to build the best tools for small teams and businesses across the world.<p>We're hiring developers and designers at any level for backend + frontend web, and mobile (iOS and Android).<p>Tech: Ruby. Lots of Javascript/Coffeescript. Backbone. PostgreSQL, Redis, Solr. iOS. Android.<p>And we're a Salesforce company. Solid funding, great benefits, competitive comp.<p>I'd love to chat if you're interested - gopal@do.com","time":1333297185,"type":"comment"},{"by":"Hovertruck","id":3783914,"parent":3783657,"text":"Chartbeat is hiring in NYC (Meatpacking District).<p>We're a real-time analytics platform focused on providing data to the people on the front line (people who can take immediate action), rather than the analysts in the back office. Our stack is Python (django/tornado), C, MongoDB, and Google Closure for our JavaScript needs. Hiring engineers and designers of all sorts. :)<p><a href=\"http://chartbeat.com/jobs/\" rel=\"nofollow\">http://chartbeat.com/jobs/</a>","time":1333294341,"type":"comment"},{"by":"bgruber","id":3783797,"parent":3783657,"text":"New York, NY - Meetup<p>Meetup has been helping people use the internet to get off the internet for nearly 10 years now. We're hiring fulltime backend and frontend engineers, QA, product managers and designers. We're also looking for summer interns in both design and engineering.<p><a href=\"http://jobvite.com/m?3dx5hfwQ\" rel=\"nofollow\">http://jobvite.com/m?3dx5hfwQ</a><p>check out our dev blog at <a href=\"http://making.meetup.com\" rel=\"nofollow\">http://making.meetup.com</a>","time":1333291967,"type":"comment"},{"by":"chomchom","id":3786825,"parent":3783657,"text":"Novoda (www.novoda.com) , London, UK - \nAndroid developers: INTERN ONSITE (paid) &#38; REMOTE Juniors / Snrs<p>Are you really interested in the Android platform? Have you played around with the platform? We are looking for people to grow into the world's most awesome Android developers within our company. We can help!<p>This is a paid internship so there is tough competition and we do expect you to already have a fair amount of experience. We expect that you are excited about the Android platform and eager to see where you can take it in future.<p>We do all these things and would offer you the opportunity to take part in what you are most interested within:<p>* Hackathon and event attending/speaking \n* Testing and continuous integration \n* Styling &#38; theming \n* Proactive remote working \n* R&#38;D into new industries using Android \n* GoogleTv development work \n* Open source development \n* Innovating in new ways to use the native platforms functionality<p>We will only consider candidates who we believe could potentially join us full time as permanent developers.<p>Application Process\nSend your social bits (cv, github, googlecode, bitbucket, linkedin, masterbranch, twitter account) to jobs@novoda.com.","time":1333353034,"type":"comment"},{"by":"camara","id":3784129,"parent":3783657,"text":"HOUSTON -- FULL TIME or INTERN<p>Camara &#38; Sibley LLP (www.camarasibley.com) is hiring smart programmers (back end and front end) and designers to work in our new special projects division (called \"Cassie\") developing products that help lawyers practice law.<p>Experience with PST and PDF formats and search / tagging at the ~10M to ~100M document scale is helpful, but not required. Camara &#38; Sibley and its clients will be our first customers. Cassie is funded entirely by Camara &#38; Sibley.<p>In addition to Cassie work, you'll be in the middle of an active law practice that handles high-profile socially important tech cases (e.g., Apple v. Psystar and Psystar v. Apple, intervenors in Google Books, Thomas and Tenenbaum) as well as low-profile commercially important (8 figure, 9 figure) matters. We do a lot of international work, especially with Brazil and China. It is the ideal position if you've always had an interest in the law as well as technology.<p>Although all positions are initially in Houston, you may have the option of moving to our newly opened Singapore office in the future.<p>Email me directly: camara@camarasibley.com.","time":1333297910,"type":"comment"},{"by":"mock","id":3805082,"parent":3783657,"text":"Neverblue - Victoria, BC, Canada<p>We are a full-service advertising brokerage that specializes in online customer acquisition and lead generation. We deliver millions of profitable customers to clients from all over the world, including members of the Fortune 1000™.<p>We’re looking for developers (We have a fulltime position as well as contract work) and a QA person to work on-site in our Victoria office on our advertising, mobile, and tracking platforms.  We use a fairly heterogeneous stack: Mostly PHP and Python on the server and the usual suspects on mobile - with zeromq, rabbitmq, postgres, couchdb, and whatever-gets-the-job-done.  We expect you to have a solid background with at least one dynamic language (PHP, Python, Perl, Ruby) and some experience with the usual grab bag of web/database technologies.<p>You can apply on our website <a href=\"http://www.neverblue.com/welcome/about-neverblue/careers\" rel=\"nofollow\">http://www.neverblue.com/welcome/about-neverblue/careers</a> email careers@neverblue.com or talk to me directly at will.whittaker@neverblue.com if you need more details.","time":1333666931,"type":"comment"},{"by":"aawecler","id":3788340,"parent":3783657,"text":"New York, NY<p>Yodle helps local business get more business through online marketing -  we make online marketing accessible to local businesses through technology.  Yodle is 7 years old, we have grown to 800 employees and 30, 000 customers.  We are growing our technology team in New York and looking for the following :<p>Test Engineer - fully automated environment - <a href=\"http://www.yodlecareers.com/jobs/new-york/software-engineer-in-test/\" rel=\"nofollow\">http://www.yodlecareers.com/jobs/new-york/software-engineer-...</a><p>Senior Software Engineer - java, javascript, python, postgres environment - <a href=\"http://www.yodlecareers.com/jobs/new-york/senior-software-engineer/\" rel=\"nofollow\">http://www.yodlecareers.com/jobs/new-york/senior-software-en...</a><p>Team Lead Software Engineering - like building software and mentoring other engineers?  this is the role for you.  <a href=\"http://www.yodlecareers.com/jobs/new-york/software-engineering-team-lead/\" rel=\"nofollow\">http://www.yodlecareers.com/jobs/new-york/software-engineeri...</a><p>Try out our puzzles to apply or reach out to me directly awecler at yodle dot com.","time":1333378012,"type":"comment"},{"by":"adamkhrona","id":3784820,"parent":3783657,"text":"San Francisco (SOMA), CA - Biz Dev Commando - Contract to Hire (awesomium.com)<p>Live in SF? Got some business sense? Wanna join a startup that's blowing up? Sweet!<p>We need a business development 'commando' to take charge of our day-to-day sales and business tasks. Typical things you'll be doing include: responding to sales questions, brainstorming new licensing models, spearheading sales negotiations, evangelizing our product, and _whatever else it takes_.<p>We make 'Awesomium', a tool for embedding the client-side web in other applications. Our mission is to break the web out of its box and into the hands of developers. Our clients include LEGO, Ubisoft, NCSoft, Sony Online Entertainment, Citrix, and Lockheed Martin.<p>Above all, we're looking for someone eager, smart, and responsible who wants to get into the ground-floor of a startup and make a real difference.<p>If this sounds like you, please apply at: <a href=\"http://startupers.com/jobs/khrona/12283/biz-dev-commando\" rel=\"nofollow\">http://startupers.com/jobs/khrona/12283/biz-dev-commando</a><p>Got questions? Email me (I'm the founder and lead developer) at adam@khrona.com","time":1333312915,"type":"comment"},{"by":"dennisquintel","id":3786647,"parent":3783657,"text":"Amsterdam, Netherlands, Part/Full-time, remote work possible. ================================<p>The Energy Transition Model (ETM) is looking for an experienced developer in one or more: Ruby, Rails, Javascript (jQuery, backbone.js, CoffeeScript, etc). You follow the 20%/80% rule, prefer to re-use then to program and seemlessly switch from big picture to implementation details.\nWe answers questions like: \"If everybody switched to electric cars, how many solar plants have to be built?\". It is used by governments, companies, teachers to evaluate strategies dealing with events like peak oil, diminishing gas reserves and new technologies.<p>Quintel develops the ETM and is a charming Dutch (grown up) startup, with a central office in the center of Amsterdam. Our engineering-driven team (91% engineers, PhDs etc) get the work done during office hours, so that we can enjoy our evenings, sometimes together with afterwork-beers. The atmosphere goes from professional consultancy to monkey house in no time.<p>Our codebase has something for everyone. 30% plain Ruby, 30% Javascript, 30% Rails and 10% other code. We have good code, bad code, tested code, untested code. We have DSLs (for our non-programmers), API, fast ec2 instances for calculations. Things we did before: Git as a database, custom query language to extract data from the model, massive processing within a rails request (think thousands of ruby objects calculating energy flows). Visualizations with Raphael.<p>You are an experienced developer, you think lean and solve problems creatively. You're proactive, fix first, complain later. You live in (ordered by preference): Netherlands, Europe, World. You'll work the first months onsite, thereafter you may go abroad and work remote (again). Current dev team has an international background: Italian, British, Dutch, Swiss, US.<p>Reactions to: dennis@quintel.com","time":1333349607,"type":"comment"},{"by":"cvinson","id":3791039,"parent":3783657,"text":"Bandzoogle - Montreal, QC or REMOTE<p>Rails Developer<p>At Bandzoogle, we build tools that help bands succeed online.  Our app powers tens of thousands of artist websites, and helps them make a living by selling their music and growing their fan base.  We've been “bootstrapped, profitable, and proud” since 2003 and are growing fast.<p>We’re looking for an experienced Rails developer to become a core member of our dev team, participate in key technical decisions.  You’ll work on varied and challenging projects, from backend media encoding on EC2, to integrating external APIs, to adding new front-end features.  Even better, our Rails 3 codebase is squeaky-clean and ready for you to jump in and start creating.<p>Requirements<p>* Sample code that we can take a look at (in any language).<p>* Solid Ruby on Rails experience.<p>* Ability to be productive in a distributed team environment.  Our 12 member team is spread across Canada, UK and USA; we work where we love to be.<p>What we offer<p>Beside working on fun projects that empower musicians, Bandzoogle offers:<p>* A great salary plus generous performance bonuses.<p>* A fast paced startup atmosphere, with the stability of an established, profitable company.<p>* A family-friendly schedule — no overtime or weekends.<p>* Health insurance for US and Canadian employees.<p>* Reimbursement of home office expenses, computer, and use of co-working spaces.<p>* An education expense account - reimburse books, conferences, etc.<p>* Yearly meet-ups in fun locations (last one was in Montreal for the Jazz fest), family included!<p>To apply: Email jobs@bandzoogle.com with the subject \"Rails developer\".","time":1333416386,"type":"comment"},{"by":"MattRogish","id":3785611,"parent":3783657,"text":"FundingGates (<a href=\"http://fundinggates.com/jobs/\" rel=\"nofollow\">http://fundinggates.com/jobs/</a>) - NYC - Various Positions. Remote possible (local preferred).<p>Looking for senior ruby on rails and javascript developers for our young, privately-funded startup (no plans to take any more $$). You'd be engineer #1 aside from the CTO (me). We're building technology to help disrupt the small/medium business recevables space. Our software will help mom-and-pops collect money that is owed to them; without us, their options are pretty bleak (try and recover themselves or go to the guy around the corner who will do the proverbial \"baseball-bat on kneecaps\" ploy).<p>Requirements are:\nAmazing at Ruby on Rails\nOR\nAmazing at JavaScript<p>Our company is optimized for developer happiness and run by folks that know how to treat developers. See one of my submissions: <a href=\"http://mattrogish.com/blog/2012/03/17/open-plan-offices-must-die/\" rel=\"nofollow\">http://mattrogish.com/blog/2012/03/17/open-plan-offices-must...</a><p>Contact rogish at fundinggates.com with your github, stackoverflow, etc.<p>Thanks!!<p>--\nMatt","time":1333326433,"type":"comment"},{"by":"typpo","id":3784290,"parent":3783657,"text":"Mountain View, CA - fulltime or intern<p>Room 77 - <a href=\"https://www.room77.com\" rel=\"nofollow\">https://www.room77.com</a><p>We're changing travel search by giving people full transparency in their search for a perfect hotel stay. Using the staggering amount of data we've collected and analyzed, we'll actually find and request the best hotel room for you. Some projects you'll work on:<p>- computer-generating views from any room in the world<p>- building the first deep-text hotel search engine (eg. search \"eiffel tower views\" in Paris or \"jetted bathtub\" in New York)<p>- super-fast search across all major providers (we show Expedia results faster than Expedia)<p>- finding better ways to extract and expose data like hotel freebies and fees<p>...and many other things that contribute to a fast, easy travel planning experience.<p>If you're interested in information retrieval, machine learning, NLP, or computer visualization, you'll have a great time solving brand new problems and creating a genuinely improved and useful hotel search.<p>Check out our jobs page: <a href=\"https://www.room77.com/jobs.html?s=HN\" rel=\"nofollow\">https://www.room77.com/jobs.html?s=HN</a>","time":1333300591,"type":"comment"},{"by":"paulitex","id":3784185,"parent":3783657,"text":"Matygo (<a href=\"http://start.matygo.com/careers/\" rel=\"nofollow\">http://start.matygo.com/careers/</a>) - Vancouver, BC, Canada<p>Come work on the most ambitious project of your life. Matygo is building the flipped classroom platform. We enable any person, school, or college to deliver provably better learning at scale by combining decades of research and the techniques Khan Academy and Udacity have popularized into an accessible web platform. The goal is to move forward how education is delivered around the world.<p>Having just closed a seed round with some top investors, we are looking to expand our founding team with first hires in Software Engineering and UI/UX design.<p>Core technologies: Scala, Sproutcore (and Ember.js)<p>We care a lot about team culture, great compensation, and inspiring workplaces. Learn more and see our openings: <a href=\"http://start.matygo.com/careers/\" rel=\"nofollow\">http://start.matygo.com/careers/</a><p>No remotes unless you are in San Francisco (we travel to SF quite often). Feel free to ping me directly with any questions: paul@matygo.com","time":1333298920,"type":"comment"},{"deleted":true,"id":3823363,"parent":3783657,"time":1334079203,"type":"comment"},{"by":"gsiener","id":3795824,"parent":3783657,"text":"New York, NY (NYC)\nEfficiency 2.0 - <a href=\"http://efficiency20.com/\" rel=\"nofollow\">http://efficiency20.com/</a>\nWe're tackling the world's biggest problem - the conservation of our planet - and we are getting results. We offer consumers personalized advice, tools to help track progress and rewards for reducing their energy consumption. We are a multi-disciplinary team of motivated energy scientists, software engineers practicing agile development, and marketers working to shape the future of energy efficiency.<p>Senior Ruby Engineer - <a href=\"http://jobs.efficiency20.com/jobs/2011/05/05/senior-software-engineer-ruby.html\" rel=\"nofollow\">http://jobs.efficiency20.com/jobs/2011/05/05/senior-software...</a><p>A typical day for an E2.0 engineer may include modeling energy use algorithms in Ruby classes, developing JavaScript-based user experiences to engage our users, and everything in between. Large volumes of data are the norm. Each of our engineers works in all layers of our stack.","time":1333504581,"type":"comment"},{"by":"scottxp","id":3784346,"parent":3783657,"text":"Grand Rapids, MI. Full time.<p>Ruby on Rails Developer<p>ProTrainings.com is an online CPR certification company with offices in the US, UK, and Spain. We are changing the way healthcare professionals get certified by delivering streaming video training, web-based testing, and a growing skill evaluator network for hands-on skills practice.<p>We are a nine-year-old, bootstrapped and profitable company, looking for someone who is a solid web developer, excited to learn, and wants to really make a difference in the world. We use Ruby on Rails, JavaScript (jQuery), MySQL, and Git, but anyone who is a fast and motivated learner is encouraged to apply. You will be working in a small team with two other web developers and a graphic designer.<p>On a side note for anyone unfamiliar with the area -- Grand Rapids has a growing tech and startup community with a co-working space; thriving web developer, Ruby, and lean startup meetup groups; and a seed accelerator program called Momentum.<p>Email me at scott (at) protrainings (dot) com if you are interested.","time":1333301579,"type":"comment"},{"by":"nbclark","id":3784215,"parent":3783657,"text":"San Francisco - DoubleDutch (<a href=\"http://doubledutch.me/jobs.aspx\" rel=\"nofollow\">http://doubledutch.me/jobs.aspx</a>)<p>Experience iOS Developer<p>Ready to do top-notch iOS development? Appreciate visual design? Code in your sleep?<p>Good. Bring your skills to us. Help build our new generation of solid &#38; functional apps, to be used by hundreds of thousands of people. You will help:<p><pre><code>  - Design and implement fun, useful and beautiful user interfaces\n  - Architect sophisticated multi-threaded apps\n  - Write organized and structured code\n  - Find and fix performance problems\n  - Debug hard problems\n</code></pre>\n----<p>Senior Web Developer, with a strong grasp of web technologies (Javascript, CSS, HTML5, ASP.NET MVC or Ruby on Rails), as well as an understanding of database architecture and design. This position will be responsible for building our analytics dashboard, taking large amounts of customer data and determining the appropriate method to deliver the data in an informative an interactive manner (charts, tables, etc.).","time":1333299316,"type":"comment"},{"by":"apgwoz","id":3785527,"parent":3783657,"text":"New York, NY - Full-Time<p>OkCupid/OkCupid Labs is looking for software engineers. In addition to new development on OkCupid.com, and continuing to grow there, the Labs team is building brand new products not necessarily related to dating. More information at <a href=\"http://okcupid.com/jobs\" rel=\"nofollow\">http://okcupid.com/jobs</a> or email me directly apg@okcupid.com","time":1333324596,"type":"comment"},{"by":"mkonecny","id":3784062,"parent":3783657,"text":"Sourcefabric in Toronto is hiring. Full-time candidates wishing to make a difference in a start-up (30 employees). Our development platform is Linux and we use open source tools for our work. Our products are also open source, but we are well-funded, and slowly becoming self sustainable.<p>The Toronto office is focused on creating Airtime which is a radio automation system with a Web UI, so people all over the world can work together to control a radio station. We just won the Guardian Mega Award in London last week: <a href=\"http://www.sourcefabric.org/en/community/blog/1138/\" rel=\"nofollow\">http://www.sourcefabric.org/en/community/blog/1138/</a><p>To learn more about Airtime please visit: <a href=\"http://www.sourcefabric.org/en/airtime/\" rel=\"nofollow\">http://www.sourcefabric.org/en/airtime/</a><p>To apply, please go to <a href=\"http://www.sourcefabric.org/en/about/jobs/\" rel=\"nofollow\">http://www.sourcefabric.org/en/about/jobs/</a><p>or contact me personally at martin.konecny@sourcefabric.org","time":1333296919,"type":"comment"},{"by":"jaos","id":3783825,"kids":[3784299],"parent":3783657,"text":"Timesys Pittsburgh, PA (intern, full-time,remote)<p>We are looking for embedded Linux kernel developers, build system gurus, gnu tool experts, userspace application developers, and support engineers.<p>We have a great team, a fun office environment, and a lot of interesting problems to solve.<p><a href=\"http://www.timesys.com/company/careers\" rel=\"nofollow\">http://www.timesys.com/company/careers</a>","time":1333292587,"type":"comment"},{"by":"mtanski","id":3793464,"parent":3783657,"text":"We're a well-funded startup in the advertising space located in NYC. Currently we're in stealth mode. We're looking for a strong engineer to help us build the front-end (our analytics dashboard) in Python. The front-end is going to be responsible for presenting complex market data, suggestions and predictions (results of ML computations), and real time market feeds.<p>Things we are looking for:\n * Proficiency developing modern web applications using HTML 5 /CSS\n * Proficiency working with Python\n * Experience with a Python web-framework (such as Turbogears, Django, Flask)\n * Know their way around Javascript and Javascript frameworks (such as jQuery)<p>Pluses:\n * Experience working with SQL databases\n * Experience working with non-relational datastores (mongo, hbase, redis, ...)\n * Ability to build data presentation UI (graphing, charting, ...)\n * Knowledge of the online ad-space\n * Open source contributions / github url<p>email: milosz@adfinsolutions.com","time":1333469074,"type":"comment"},{"by":"jgannonjr","id":3784203,"parent":3783657,"text":"Lucid Appeal (<a href=\"http://lucidappeal.com\" rel=\"nofollow\">http://lucidappeal.com</a>) Los Angeles, CA (REMOTE or INTERN considered)<p>We are building a web based CMS for creating and managing cross-platform mobile apps targeted towards athletes, teams, musicians, artists, venues, events, etc.  We are coming fresh out of the gate with users including Bubba Watson (top 10 PGA golfer) and the Los Angeles Clippers.<p>We are looking for our first technical hire.  You will work with the CTO on application development across the stack (both backend and frontend, server and client).  Must haves: strong Ruby &#38; Rails experience, great with JavaScript, HTML5, CSS3, and friends, comfortable coding across the stack.  Bonus: native iOS/Android development experience, experience building real-time JavaScript web apps, experience working with JavaScript MVC frameworks (such as Backbone and Spine).<p>Email us if you are interested - jobs@lucidappeal.com","time":1333299153,"type":"comment"},{"deleted":true,"id":3823370,"parent":3783657,"time":1334079273,"type":"comment"},{"by":"sandwiches","id":3784703,"parent":3783657,"text":"San Francisco, CA - full-time<p>Klout.com is looking for:<p>* Web application engineers ( frontend development w/ node.js+backbone, HTML+CSS )\n* Mobile engineers ( iOS, mobile web )\n* Platform engineers ( API development w/ Scala, Mongo, Hbase )<p>Visit <a href=\"http://klout.com/corp/careers\" rel=\"nofollow\">http://klout.com/corp/careers</a> for more details or email kevin@klout.com.","time":1333310382,"type":"comment"},{"by":"hunvreus","id":3784265,"parent":3783657,"text":"Wiredcraft (<a href=\"http://wiredcraft.com\" rel=\"nofollow\">http://wiredcraft.com</a>) - Shanghai, China<p>Web &#38; mobile developers (Full time and interns)<p>We're looking for people to help us building our own products and working on some awesome projects with the United Nations, various humanitarian org and non-profits (WRI, IFES, NDI), CNN... We love data and maps (think custom tilesets), and tend to be generalists but have been focusing a lot on Javascript lately (node.js and backbone.js mostly). We still love PHP, Python and make use of a lot of other technologies, from Phonegap to Chef.<p>We love Open Source, organizing events in several cities across China, we take good care of our staff (Macbook pro, Ergohuman chair, free snacks, lunches and much more) and have a pretty neat office, along with awesome colleagues.<p>Details: <a href=\"http://wiredcraft.com/about/jobs\" rel=\"nofollow\">http://wiredcraft.com/about/jobs</a><p>Contact: job@wiredcraft.com","time":1333300164,"type":"comment"},{"by":"wrath","id":3784551,"parent":3783657,"text":"Gazaro Inc. Ottawa, Ontario, Canada<p>What You’ll Be Doing<p>1. Crawl the internet. At Gazaro you’ll help us crawl the internet to find and extract information from web pages.<p>2. Work with large datasets. We collect lots of data for our customers. We are constantly trying to come up with new and innovative approaches to analyze and present the data.<p>3. Automation. All this crawling and data analysis has to happen automatically. Writing automation and test frameworks is a crucial part of the work we do.<p>What You Need<p>- Passion for a startup environment<p>- Ability to bring your own ideas to the table<p>- Demonstrated experience in writing applications using Python, Java, or C#.<p>- Basic knowledge of XML.<p>- Have a “customer-first” type attitude.<p>What you’ll be working with<p>We work with the following technologies and tools: Python, MongoDB, Tornado, Scrapy, Git, nginx, Amazon AWS, REST/JSON APIs.<p>How To Apply<p>We are looking for Experience Web Developers and Systems Engineers for our Enterprise platform. If you think you're a good fit let us know by sending us your resume and a short blurb on why we should hire you.","time":1333306271,"type":"comment"},{"deleted":true,"id":3823351,"parent":3783657,"time":1334079066,"type":"comment"},{"by":"bentaber","id":3783901,"parent":3783657,"text":"Boulder, CO - Full Time - <a href=\"http://markitondemand.com/\" rel=\"nofollow\">http://markitondemand.com/</a><p>Markit On Demand<p>Markit On Demand is a design driven technology company based in Boulder, Colorado. We’re part of Markit, a global financial information company that’s headquartered in London. Here in Boulder, where the sun shines 300 days a year, we have a team of 400+ professionals dedicated to the presentation of financial content and data for our clients in the Financial Services, Media and Healthcare industries. On any given day, you might work with a colleague in New York, a retail brokerage in the US, a newspaper in Germany, a bank in Africa, or throw ideas around with an economist in our London office. And that’s before you meet up with co-workers for a foothills hike or a brewery happy hour tour.<p>We're looking for developers and engineers up and down the stack at all levels.","time":1333294173,"type":"comment"},{"by":"emcien","id":3815237,"parent":3783657,"text":"Software Engineer for Complex Web Applications -- Atlanta, GA (no REMOTE, no H1B)<p><a href=\"http://emcien.com\" rel=\"nofollow\">http://emcien.com</a><p>To Apply:\n<a href=\"http://emcien.com/dev-test/\" rel=\"nofollow\">http://emcien.com/dev-test/</a><p>Full posting: <a href=\"https://jobs.github.com/positions/53d16942-7f31-11e1-973f-c10b4dc4e291\" rel=\"nofollow\">https://jobs.github.com/positions/53d16942-7f31-11e1-973f-c1...</a><p>We are a growing company in Midtown Atlanta working with patented pattern detection algorithms to solve retail, industrial, and investigative problems. Our engineering team has significant creative control over the tools and techniques used when developing software -they build their own process, work with new technologies, and occasionally write their own job postings. Emcien offers very competitive salaries, generous stock options, health benefits, and a 401K program.","time":1333927857,"type":"comment"},{"by":"dman","id":3793477,"parent":3783657,"text":"Enthought - www.enthought.com<p>Python development for scientific applications, financial applications and Python toolset development. Enthought has offices in Austin, New York, Cambridge, Mumbai. If you use Python and love numpy / scipy then Enthought would be a great place for you. Come work with numpy / scipy hackers on solving interesting scientific analysis and data visualization problems. Also we are building the next generation of Python development tools, so there is no shortage of interesting problems to work on. Send applications to jobs@enthought.com and mention that you saw this on the hacker news Feb 2012 thread. Looking forward to working with some of you. If you have any questions about Enthought, what jobs are on offer and what problems keep us up at night feel free to reach out to me at dsharma at enthought dot com","time":1333469275,"type":"comment"},{"by":"pmattos","id":3796127,"kids":[3798337],"parent":3783657,"text":"Olympya Software (www.olympya.com), Rio de Janeiro, Brazil.\nSoftware Engineer<p>Do you want to work with games in one of the most beautifull cities in the world? Work with us in Rio. We are currently working on a MMO Football game (soccer if you will), with very innovative concepts, check it out at: www.FutWeb.com.br<p>Come join a young and innovative team in a startup environment where your ideas are heard and your creativity is valued. We are looking for professionals with high initiative and desire to develop games for PC. Our studio is in Rio de Janeiro.<p>Requirements:\n• Graduate in Computer Engineering or Computer Science.\n• Solid knowledge in Object Orientation.\n• Ability to work in a multidisciplinary team.\n• Willingness to learn new technologies.\n• Advanced English.\n• Passion for Games (of course).<p>Intrested?\nPlease send your CV to jobs@olympya.com.\nWe want you on our team!","time":1333511606,"type":"comment"},{"by":"odelara","id":3786134,"parent":3783657,"text":"Clearleap  -  Duluth, GA (Local only, Fulltime, h1b ok)<p>Clearleap is hiring in Duluth, GA.<p>We are an early stage venture-backed technology startup and we are changing the way people watch television, bringing the diversity and breadth of internet video to the television.  Our next generation services allow our customers, video service providers, unparalleled content delivery capability and provide to their subscribers flexible ways to enjoy video content on a variety of devices. Our founders are internet and digital video pioneers with successful entrepreneurial and M&#38;A track records.<p>The Engineering team is a collaborative customer requirements based team. We play a key role in defining the company’s future. We understand the importance of keeping things clean, turning complexity into well-structured, scalable and maintainable solutions.<p>Technical roles we are hiring:<p>Sr. Software Engineer: <a href=\"http://www.clearleap.com/senior-software-engineer/\" rel=\"nofollow\">http://www.clearleap.com/senior-software-engineer/</a><p>Software Engineer: <a href=\"http://www.clearleap.com/about/careers/software-engineer/\" rel=\"nofollow\">http://www.clearleap.com/about/careers/software-engineer/</a><p>Systems Engineer: <a href=\"http://www.clearleap.com/systems-integration-and-support-engineer/\" rel=\"nofollow\">http://www.clearleap.com/systems-integration-and-support-eng...</a><p>Apply by email: jobs@clearleap.com<p>BizDev, Sales and Program mgmt roles:<p>Director of sales: <a href=\"http://www.clearleap.com/director-of-sales/\" rel=\"nofollow\">http://www.clearleap.com/director-of-sales/</a><p>Program manager: <a href=\"http://www.clearleap.com/customer-program-manager/\" rel=\"nofollow\">http://www.clearleap.com/customer-program-manager/</a><p>VP of Operations: <a href=\"http://www.clearleap.com/vp-operations/\" rel=\"nofollow\">http://www.clearleap.com/vp-operations/</a><p>Apply by email: jobs@clearleap.com","time":1333336941,"type":"comment"},{"by":"BraintreeR","id":3788191,"parent":3783657,"text":"Chicago, IL - Braintree<p>FULL TIME Software Engineers<p>Braintree helps businesses process credit card payments by providing a merchant account, payment gateway, recurring billing and credit card storage. We're unlike others in the industry; we think and do things differently.<p>We mostly work with Ruby/Rails, but consider ourselves polyglots. Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product.<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a>","time":1333376231,"type":"comment"},{"by":"Alex3917","id":3783814,"parent":3783657,"text":"NYC - Currently looking to hire a generalist web developer with both frontend and backend experience. This is for a new unlaunched social network that's very much unlike anything else currently in existence. Strong python skills are a bonus. You can email me if interested, my email is in my profile.","time":1333292332,"type":"comment"},{"by":"RRiccio","id":3817665,"parent":3783657,"text":"Rio de Janeiro (or Remote)<p>Rails Developer - Fulltime<p>Glio (glio.com.br)<p>We're a local reviews social network. Our story is similar to the guys at Yipit, ie, our team consists of two non-coders that learned to code in the last couple of months and used some freelancing help to launch our MVP (our official launch will be this week).<p>In the meantime we also were selected to incubate at Instituto Gênesis, which is brazilian's top startup incubator, at PUC-Rio university. And we're about to close our first round of financing.<p>Post-launch we're looking for a Rails developer to join our team and help us run faster. Being able to move to Rio would be a big plus, but we practice the 37signals' philosophy so it's fine if you prefer to work remotely. The compensation for this position includes salary plus significant equity.<p>If you're interested in the position please email me: robertoriccio1 at gmail.","time":1333988888,"type":"comment"},{"by":"twp","id":3784873,"parent":3783657,"text":"Camptocamp SA - Lausanne (Switzerland) - Python devs<p>We do Open Source business (OpenERP) and geospatial development.  We're looking right now for Python/OpenERP devs and project managers. It's a cool place to work. More info on the four positions here:<p><a href=\"http://www.camptocamp.com/en/careers/488-dev-openerp\" rel=\"nofollow\">http://www.camptocamp.com/en/careers/488-dev-openerp</a>\n<a href=\"http://www.camptocamp.com/en/careers/281-integrateur-erp\" rel=\"nofollow\">http://www.camptocamp.com/en/careers/281-integrateur-erp</a>\n<a href=\"http://www.camptocamp.com/en/careers/289-chef-projet-openerp\" rel=\"nofollow\">http://www.camptocamp.com/en/careers/289-chef-projet-openerp</a>\n<a href=\"http://www.camptocamp.com/en/careers/226-integrateur-openerp\" rel=\"nofollow\">http://www.camptocamp.com/en/careers/226-integrateur-openerp</a>","time":1333313954,"type":"comment"},{"by":"brandonb","id":3785242,"parent":3783657,"text":"San Francisco, CA - Sift Science [H1B ok]<p>Sift Science is bringing machine learning to the masses. Our initial product is a hosted model to detect fraud online. Fraud is a huge, difficult problem because the bad guys are getting more and more sophisticated: just in the last month, they've hit our customers with money laundering schemes, used botnets to script mass creation of dummy accounts, set up fake Twilio numbers to fool SMS verification, and more. We're helping our customers fight back, and have huge plans beyond fraud.<p>We're a 5-person team of ex-Google and ex-Zillow engineers, and we're looking to hire engineers with expertise in machine learning, data mining, visualization, and large-scale distributed systems. Our stack includes Hadoop, Rails, d3.js, MongoDB, etc.<p>If that sounds exciting, send us a resume at jobs@siftscience.com.","time":1333319955,"type":"comment"},{"by":"Clear-Capital","id":3823391,"parent":3783657,"text":"Roseville, CA Full Time<p>Clear Capital offers a rare mix of fast growth, undying devotion to technical innovation and stability (10 years old, $120MM company). Your exceptional programming skills will be used daily to create web applications that literally run our company. When it comes to new tech, if we don't use it, we want to. We write all of our own code and we actively seek out new technologies and languages that can help us continue to grow and become more efficient. We are currently hiring:<p>Applications Developer: We are looking for a developer who understands the benefits of object oriented development, takes pride in their work, knows java, C# and .NET and is hungry to learn and contribute. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=135\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Applications Development Manager: Our next manager will have no problem jumping in to code using java, ColdFusion, jQuery, AJAX or javascript when needed without missing a beat. Our manager will also understand how to keep the team productive when the jobs are coming in fast and will have learned the trade from a successful career in app dev management. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=134\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Front End Developer: Help develop web UIs that integrate our back end components using HTML, CSS, jQuery and JavaScript. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=136\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Graphic Designer: Do you live and breath clean design? Do you appreciate what your design can do to drive a B2B business forward? Strong business focused web design portfolio required. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=84\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a>","time":1334079561,"type":"comment"},{"by":"bartonfink","id":3783865,"parent":3783657,"text":"Denver, CO - Director of Mobile Product - Mapquest<p>Mapquest is hiring for a variety of roles, but the primary one is a Mobile Czar to handle product direction and development for our mobile products.<p>We're in the last stages of bringing in a new product team that's focusing more on the ? of \"What do we do with the fact that we know where millions of people are trying to go every month?\" We're working on a new product (Mapquest Vibe - beta launched at SxSW) and you'd be a major player in the direction that the mobile version took. You'll be talking with users to get impressions on UX, writing press releases, and actually doing development work on the app. It's an exciting opportunity to work on a brand name and try to steer it in a new direction.<p>Let me know if you're interested at the e-mail in my profile and I'll be in touch!","time":1333293366,"type":"comment"},{"by":"prsutherland","id":3784074,"parent":3783657,"text":"Insight Squared - Cambridge, MA<p>InsightSquared is a well-funded startup in the Cambridge/Boston area.<p>Our management team has previous experience building successful software products at companies like Salesforce, Akamai, HubSpot, Elance, BzzAgent, and Amazon.com.\nWe’re going after a $2.5B market opportunity for data intelligence for small &#38; medium businesses.\nWe already have several channel partners and many paying customers for our SAAS subscription-based product.\nRead more about us on our blog.<p>We are currently hiring for several positions:<p>* Customer Engagement Specialist\n* Python Developer\n* Python Developer Intern\n* Designer\n* Business Development Specialist\n* Report Analyst Intern\n* Sales Specialist<p>Find out more and apply at <a href=\"http://bit.ly/is2jobs\" rel=\"nofollow\">http://bit.ly/is2jobs</a> or email me  directly at paul at insightsquared.com","time":1333297038,"type":"comment"},{"by":"Aloisius","id":3784390,"parent":3783657,"text":"San Francisco, CA<p>SeatMe is hiring! We're a cozy 15 person startup in downtown San Francisco. We're revolutionizing the restaurant industry and we need your help! We're in search of:<p><pre><code>  * Web developers (we're a Python/Django/jQuery/Backbone shop)\n  * iOS developers (Objective-C for iPad and iPhone)\n</code></pre>\nHow often do you get a chance to work at a tech startup where eating out can be written off as a tax-refundable business expense? Well not here, because our CEO would go to jail (and he's never going back to the big house), but we do work in an awesome intersection of technology and fine dining.<p>We offer a very competitive salary, benefits, moving costs and equity options for all full-time employees.<p>Apply online - <a href=\"http://www.seatme.com/jobs/\" rel=\"nofollow\">http://www.seatme.com/jobs/</a>","time":1333302501,"type":"comment"},{"by":"wdewind","id":3784172,"parent":3783657,"text":"New York, NY, Brooklyn<p>Hiring for tons of engineering positions (front and backend) as well as design, etc. see: <a href=\"http://www.etsy.com/careers\" rel=\"nofollow\">http://www.etsy.com/careers</a><p>Etsy is the global handmade marketplace. Our mission is to empower people to change the way the global economy works. We see a world in which very-very small businesses have much-much more sway in shaping the economy, local living economies are thriving everywhere, and people value authorship and provenance as much as price and convenience. We are bringing heart to commerce and making the world more fair, more sustainable, and more fun.<p>My contact info is in my profile, feel free to contact me if you have any questions.  <a href=\"http://www.etsy.com/careers\" rel=\"nofollow\">http://www.etsy.com/careers</a>","time":1333298686,"type":"comment"},{"by":"veritas9","id":3806286,"parent":3783657,"text":"Quixey (www.quixey.com) - Palo Alto, CA<p>Software Engineer<p>You'll work on:\nCrawlers\nFeature engineering and machine learning\nParsing and natural language processing algorithms\nScaling to handle 10,000 QPS\nMining data about apps and usage patterns\nTools for our partners\nAmong other tools, we're using Python 3, MongoDB, AWS and git.<p>We do everything we can to help you do your best work.\nPrivate cubicles with sliding whiteboard doors\nAny hardware you want, e.g. dual 30' monitors\nThree healthy catered meals a day\nFridges stocked with high-quality food and drinks\nFree membership to Equinox gym\nHigh-end medical, dental, vision and life insurance<p>Also hiring engineering interns.<p>To apply, please solve a coding challenge here: <a href=\"http://www.codeeval.com/public_sc/59/\" rel=\"nofollow\">http://www.codeeval.com/public_sc/59/</a>","time":1333696014,"type":"comment"},{"by":"cristinacordova","id":3785487,"parent":3783657,"text":"Palo Alto, CA (across the street from the downtown Palo Alto Caltrain station) - Full-Time<p>We're looking for people to fill the following roles on our 21-person team: Backend Engineer, iOS Engineer, Web Engineer, Android Engineer, Data Scientist, Product Designer<p>Pulse makes the most downloaded news application for iPhone, iPad, Android and Windows Phone. At Pulse, you will work closely with a close team of experienced engineers. Each of us is part engineer, hacker and product designer. Pulse was originally founded in the Stanford Design School. Beautiful, user-centric design is at the heart of our product and work.<p>Find out more about us here: <a href=\"http://www.pulse.me/jobs/\" rel=\"nofollow\">http://www.pulse.me/jobs/</a> and feel free to find out more about us at cristina@pulse.me","time":1333324043,"type":"comment"},{"by":"cadr","id":3785033,"kids":[3785469],"parent":3783657,"text":"San Francisco, CA - Blurb<p>Blurb lets people tell their stories - currently through print-on-demand books, but increasingly through other venues.<p>We are both established and growing like mad (we were #47 on last year's Inc 500). We have a great group of people and a lot of fun challenges in the year ahead. We just launched a bevy of new products (our iPhone app is getting great reviews).<p>We play with fun tech: Ruby, Rails, ember.js, git, RSpec, Cucumber, Haml, SASS, RabbitMQ, Puppet, Obj-C, and more. We have great benefits, a great work/life balance, and we're in a great location close to the BART, CalTrain, and lots of food options.<p>We are currently hiring for many positions - front end, back end, QA and more - at all levels.<p><a href=\"http://www.blurb.com/join_us\" rel=\"nofollow\">http://www.blurb.com/join_us</a>","time":1333316382,"type":"comment"},{"by":"MatthewB","id":3784071,"parent":3783657,"text":"Teamly (teamly.com) - Mountain View/Bay Area<p>Teamly is angel-funded and part of one of Silicon Valley's best known accelerators. We also have users, early revenues and tons of great press.<p>We're looking for a truly great full-stack developer to join us as our first hire! We're looking for someone with a computer science background who loves startups and wants to work closely with the founders to build our product and company. You will come help us shape the product and company culture from day 1.<p>You'll need at least 2 years of experience with Ruby on Rails and JavaScript (jQuery) plus solid knowledge of MySQL, HTML, CSS, Git, RSpec, Ajax, Chef.<p>We're offering a competitive salary plus meaningful equity.<p>More:<p><a href=\"http://teamly.com/jobs-and-careers-at-teamly\" rel=\"nofollow\">http://teamly.com/jobs-and-careers-at-teamly</a>","time":1333297002,"type":"comment"},{"by":"sambao21","id":3784031,"kids":[3789703],"parent":3783657,"text":"Fulltime - Kansas City, MO<p>Cerner - Web Developer<p>Web developer for our community health teams. Cerner is a healthcare IT company, but our team is dedicated at building websites for patients, physicians, and consumers.\nOur current products include:\n<a href=\"https://cernerhealth.com\" rel=\"nofollow\">https://cernerhealth.com</a>\n<a href=\"https://cernerhealthwins.com\" rel=\"nofollow\">https://cernerhealthwins.com</a>\n<a href=\"https://cernerclinic.com\" rel=\"nofollow\">https://cernerclinic.com</a><p>We currently use Python/Django, javascript/jquery, less/css, html, oracle, mongodb, celery, git, but would entertain anyone with good web skills anywhere on the stack and can learn quickly OR can make convincing arguments with code.<p>I'm one of the devs so feel free to contact me: sambao21 at gmail dot com.","time":1333296471,"type":"comment"},{"by":"nikhilpandit","id":3785589,"parent":3783657,"text":"Grubwithus (YC W'11) - Venice, CA - Front end engineer<p>Grubwithus is taking online relationships offline. We are currently looking for a front-end engineer who can help us build a great user experience.<p>Requirements for this position:<p>- strong Javascript + CSS skills<p>- experience with Illustrator<p>- one or more past projects that demonstrate good UI / UX skills<p>Nice to haves:<p>- Ruby on Rails experience<p>You can read more about working at Grubwithus by going to <a href=\"http://www.grubwithus.com/jobs\" rel=\"nofollow\">http://www.grubwithus.com/jobs</a><p>If you are interested in joining the offline revolution and working at Grubwithus, let us know a little bit about yourself and send us a few links to your Github profile, resume, portfolio, or past projects. Feel free to include any information that you think would help us in making our decision.<p>To apply, send an email to jobs@grubwithus.com","time":1333325937,"type":"comment"},{"by":"lhsgo","id":3795006,"parent":3783657,"text":"Data Analyst at Well Known Major Online Video Service -- Los Angeles\nWe are looking for a Data Analyst Engineer to join our Financial Planning &#38; Analysis (FP&#38;A) team. Primary responsibilities will include generating raw data reports and digging deep into data, analyzing trends on subscriber behavior, preparing reports for management, and collaborating with multiple teams to provide insightful analysis to senior management. While some pieces will be routine, many projects will be ad hoc. Due to the “undefined” nature of the work, the successful candidate will have the aptitude to tackle multiple projects, problem-solve, and efficiently execute deliverables. Competitive salary and full benefits offered.\nResponsibilities may include: •\tCollaborating with different business units to define and build insightful reports •\tOngoing report generation and analysis of key business metrics •\tDigging deep into data files, analyzing and calculating internal traffic metrics • Assisting with the preparation of weekly and monthly metrics reports for the executive team and other departments •\tWorking closely with the marketing team to analyze 3rd party promotions and marketing efficiency •\tAssisting with the creation of presentations to support board meetings and other ad hoc strategic initiatives •\tParticipating, owning, and driving various ad hoc projects<p>Qualifications: •\t2 – 3 years of experience working with large data systems •\tThe ideal candidate will have at least 1-2 years of experience in the online video space or least have a strong understanding of current consumer trends and marketing tactics in the space •\tExpertise with at least one major database system (MS SQL Server, MySQL, Oracle) •\tStrong knowledge of database development, administration and reporting •\tStrong SQL/TSQL development skills •\tBachelor's degree with a major or emphasis in Accounting, Finance, Economics, or Computer Science is required •\tExceptional analytical abilities and strong MS Excel skills •\tExperience in a roll-up-your-sleeves environment is a plus •\tIndependent, energetic, highly technical, and capable of driving for results under pressure and ambiguity<p>EMAIL resume and brief cover letter to: onlinevideodataanalyst@gmail.com","time":1333490327,"type":"comment"},{"by":"callado4","id":3786041,"parent":3783657,"text":"New York, NY - User Experience Designer<p>DirectMarkets is looking for an innovative, creative and intelligent User Experience Designer to join our Product team. A User Experience Designer at DirectMarkets is responsible for creating intuitive, goal directed user experience for DirectMarkets users. The UX Designer will collaborate with the Product Manager, Developers, Stakeholders and Users to create experiences which deliver business value and drive the growth of the business. The key deliverables will be designing wireframes and producing style guides to ensure consistency across the platform.<p>Qualifications:<p>The ideal candidate has:<p>* Minimum or 3-5 years creating user experiences for web-based products.\n* Experience with enterprise products and/or trading systems is a plus.\n* Bachelor's Degree or higher in Human Computer Interaction or similar program.\n* Experience and passion for working in an Agile environment (specifically SCRUM).\n* Excellent verbal and written communication skills.\n* Highly collaborative and innovative.\n* Solid understanding of technology and how software systems are built.\n* Ability to learn new industries and businesses quickly.\n* Experience in visual design is a plus.<p>DirectMarkets' groundbreaking platform is the next evolutionary step in connecting the C-Suite of existing public companies directly with the capital markets. This is accomplished by electronically linking existing public companies with purchasers of securities. The DirectMarkets platform empowers issuers to efficiently sell primary shares directly into the secondary market, providing investors a new source of supply and liquidity, and the ability to accumulate stock positions in a cost-effective manner. Additionally, the DirectMarkets platform enables investors to initiate transactions directly with issuers, redefining the capital-raising paradigm. The result is greater transparency and substantially reduced time and costs associated with capital origination for existing public companies.<p>Apply by email chartel@directmkts.com<p>Website: <a href=\"http://www.directmkts.com\" rel=\"nofollow\">http://www.directmkts.com</a>","time":1333334940,"type":"comment"},{"by":"hmark6","id":3784313,"parent":3783657,"text":"Canton, CT - Web Engineer<p>Build apps for NFL.com, NBA.com, NASCAR.com, NCAA.com, SI.com, USAToday.com,<p>Sports Technologies LLC is looking for a Web Engineer to join our team. You'll be a key contributor as we create new products and expand our current offerings. You'll be a good fit if you're passionate about web development, sports, media, and providing users with a great experience on the web.<p>What's in it for you:<p>* Top of the line equipment so you have the tools you need to get things done\n* A flexible and fun work environment\n* Work as part of a team of bright and passionate developers\n* Competitive base salary\n* Full benefits package that includes: medical, dental, paid vacation, 401k, flexible spending account\n* Annual bonus program\n* The opportunity to build experiences for sports fans across the web\n* Relocation package<p>Things we're looking for:<p>* 2+ years real-world experience in developing web applications\n* Experience working on at least one dynamic, user-centric web application\n* DB Experience (MySQL or similar), you should have the capabilities to write queries, create tables, etc.\n* Familiarity with version control systems\n* Ability to work in a fast-paced environment\n* Exceptional communication skills\n* A willingness &#38; eagerness to collaborate with a team\n* Entrepreneurial spirit\n* Linux/Unix skills, you won't need to do system administration, but you must be able to at least do basic tasks on the command-line\n* Solid Javascript skills, you'll need to know about things like: AJAX, JSON, &#38; JS Frameworks (jQuery, Prototype, etc.)\n* Understanding of modern web standards (html/xhtml, css, best practices, etc.)\n* Bachelor's degree or equivalent experience<p>Other \"nice-to-haves\":<p>* Experience with social components (Facebook/Twitter integration)\n* Experience working on an application targeted at mobile devices\n* Ruby on Rails experience is a big plus\n* To apply, please send an email to eric@sportstechinc.com with your resume, a brief note about yourself, and point us to something that you are proud to have worked on (a Github or similar account would be a great option).","time":1333301070,"type":"comment"},{"by":"ChiperSoft","id":3784168,"parent":3783657,"text":"NFY Interactive is a San Diego based web development firm seeking qualified candidates in the Pacific time zone for a fulltime remote position. You would be a part of a fast-paced, highly skilled company with projects in web development, content management systems, PHP framework development, API construction/consumption, and mobile applications.<p>We are seeking candidates with at least 2 years of experience developing in the commercial arena. Qualified candidates must have a solid grasp of the following:<p>- HTML5 and CSS3 with progressive enhancement<p>- LAMP Application Stacks and the Linux command line<p>- Object Oriented PHP Programming within a structured framework<p>- Basic MySQL database design and query writing<p>- Ability to work quickly and efficiently remotely, communicating via email/IM/video chat<p>Beneficial but not required:<p>- Custom CMS Sites<p>- Javascript Enhancement using jQuery and/or Prototype.js<p>- REST APIs (Creation and Consumption)<p>- Web Application Product Cycles (from design to launch and post-launch maintenance)<p>- Mobile web development<p>- Billing systems and payment gateways<p>- SMS<p>- QR Codes<p>We are looking for full-time candidates which are ready to go to work and can fulfill job tasks which are available now.  This is a remote working position, so candidates must be capable of working from home and managing their own time.  Ideally we would like applicants from the San Diego area, but will accept resumes from anyone in the Pacific time zone.  If you are the right person for this job -- please send your resume/cv and examples (code, github or portfolio) to careers@netfinity.net, or apply on our website at <a href=\"http://netfinity.net/about/careers\" rel=\"nofollow\">http://netfinity.net/about/careers</a><p><i>Absolutely only United States - If you are an overseas development firm please do not contact us.</i><p>We also have an opening for a full-time iOS developer.","time":1333298628,"type":"comment"},{"by":"snikolic","id":3785629,"parent":3783657,"text":"Crimson Hexagon - Boston, MA<p>Looking for frontend web developers, web engineers, dev/sys ops, and backend hackers with an interest in machine learning and big data.<p>We use machine learning to measure public opinion about major brands, politics, etc. using the social web (including the full Twitter firehose) as our datasource. We make our findings available to our customers through a beautiful web product. We've collected, indexed, and are constantly mining an archive of over 100 billion web and social media documents, adding another 1+ billion each week.<p>Small team (6 engineers, 2 research scientists), mostly Java shop, plenty of free food and beer, impressive customer list, $5mm+ in funding, and growing fast.<p>Drop me a line at stefan@crimsonhexagon.com","time":1333327052,"type":"comment"},{"by":"tysont","id":3784160,"parent":3783657,"text":"Amazon.com (Seattle) -<p>My team is hiring 3-4 SDE's and a Manager for a very exciting new Platform as a Service (PaaS) offering that will become a key piece of infrastructure for Amazon.com Retail Website (RCX) as well as other products like Amazon Web Services (AWS) &#38; Kindle.  If you're interested in building super large scale distributed systems, applying machine learning to scale hosting up or down to meet constantly changing traffic flows, and having a massive impact on the world's biggest online retailer... come join us!<p><a href=\"http://careers.stackoverflow.com/jobs/18233/senior-software-dev-engineer-platform-amazon?a=lxBNM0o\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/18233/senior-software-...</a>","time":1333298471,"type":"comment"},{"by":"ottumm","id":3794792,"kids":[3795001,3794810],"parent":3783657,"text":"IBM -- Emeryville, CA<p>BigFix is a highly-scalable systems management solution that was recently acquired by IBM. Located in Emeryville, CA, the BigFix engineering team is responsible for building a distributed framework to discover problems and enact changes across diverse computing environments, as well as using this framework to develop products that compete in a wide variety of markets. We are focused on developing elegant solutions to complex problems, including:<p>* Language and API design<p>* Interface design and implementation<p>* Efficiently managing large amounts of data<p>* Performance and scalability optimization<p>Apply here: <a href=\"https://jobs3.netmedia1.com/cp/job_summary.jsp?job_id=SWG-0476415\" rel=\"nofollow\">https://jobs3.netmedia1.com/cp/job_summary.jsp?job_id=SWG-04...</a>","time":1333486641,"type":"comment"},{"by":"TimothyFitz","id":3784818,"parent":3783657,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\".\nYes, your day job will be writing code. But that's the only similarity to a big company software job.<p>You'll be challenged to take big ideas and turn them into concrete testable hypotheses. Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>More details and how to apply: <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1333312870,"type":"comment"},{"by":"abailin","id":3784823,"parent":3783657,"text":"Pradux is hiring in NYC. We're a very small team that is revolutionizing the e-commerce space. You will take ownership of major functionality of our site and operations and will have creative freedom to get stuff done, however you need to. We are funded, but have only been up and running for about 8 months. Come make a meaningful impact to a small company. Currently, we are part of Dogpatch Labs. We're in private beta, but I can shoot you an invite if interested.<p>Looking for:<p>* Web developer/hacker (full time, part time, or intern) -- we use PHP, lots of javascript, redis, memcached, aws.<p>* UI/UX Architects/designers (full time, part time, or intern)<p>Competitive salary (cash + equity). Shoot me an email if you are interested!<p>email: bailin at pradux com","time":1333312927,"type":"comment"},{"by":"zacharycohn","id":3784283,"parent":3783657,"text":"Seattle, Washington - Ruby/Javascript developer<p>##<p>We are seeking to add another software engineer to join the team. This year Startup Weekend is building several products to expand our marketing and operations capabilities. Within the first 6 months, we will be designing, prototyping, implementing and deploying applications into production. You must be proficient with Ruby, Javascript and Git as those technology powers our development.<p>## Responsibilities<p>Collaborate and work closely with our engineering, marketing and operation teams.<p>## Requirements<p>* Familiar with Ruby on Rails and Sinatra\n* Experience with Git and Github for version control\n* Experience with REST, AJAX and JSON.\n* Experience with JavaScript frameworks like jQuery and Backbone.js<p>## Bonus Points<p>* Attended a Startup Weekend<p>##<p>* To apply, email zachary@startupweekend.org","time":1333300480,"type":"comment"},{"by":"jakejake","id":3784412,"parent":3783657,"text":"Chicago, IL - Full Time.  Eventric is looking for a PHP developer with UI/UX experience.  A-level ping pong skills will also be necessary to avoid humiliation.  We provide software solutions for music touring professionals and work with many of the biggest names in the music industry.<p>We're located in the Wicker Park neighborhood of Chicago, just off the blue line Damen stop.  Great neighborhood with great restaurants all around.  We have a small team, flexible schedule, music and ping pong in the office.  Access to concert tickets and opportunities to hang out back stage with tour managers to help them use the software and gather requirements.<p>Send a message to support@eventric.com ATTN Jason.","time":1333302892,"type":"comment"},{"by":"hswolff","id":3783824,"parent":3783657,"text":"New York, NY - Fulltime - GetGlue - <a href=\"http://getglue.com/\" rel=\"nofollow\">http://getglue.com/</a><p>GetGlue is a social network for entertainment. Users check-in and share what they are watching, listening to and reading with friends; get fresh recommendations, exclusive stickers, discounts and other rewards from their favorite shows and movies.<p>Looking for:<p>Web Developer <a href=\"http://getglue.com/jobs/web_developer\" rel=\"nofollow\">http://getglue.com/jobs/web_developer</a><p>Java Engineer <a href=\"http://getglue.com/jobs/java_engineer\" rel=\"nofollow\">http://getglue.com/jobs/java_engineer</a><p>iPhone / JavaScript Developer <a href=\"http://getglue.com/jobs/javascript_developer\" rel=\"nofollow\">http://getglue.com/jobs/javascript_developer</a>","time":1333292584,"type":"comment"},{"by":"nirvanatikku","id":3784262,"parent":3783657,"text":"Verivo Software - Waltham, MA, USA &#38; London, UK - <a href=\"http://www.verivo.com/\" rel=\"nofollow\">http://www.verivo.com/</a><p>We offer a mobile enterprise app development platform, have established our business and are growing rapidly. A sample from our over 200 clients include: Deloitte, Ernst &#38; Young, Ameriprise, CSX, Allstate, Thomson Reuters and First Solar. We're looking for talented<p>* Software Engineers - Client side (iOS/Android/BB/WP/HTML5) and Server side (.NET/IIS stack)<p>* QA/Automation Engineers<p>* UI Engineers<p>* Product Managers<p>* Enterprise Sales Representatives<p>For more details, check out our careers page: <a href=\"http://www.verivo.com/about-us/careers/\" rel=\"nofollow\">http://www.verivo.com/about-us/careers/</a><p>If interested, feel free to reach out to me: ntikku@verivo.com","time":1333300103,"type":"comment"},{"by":"miles_matthias","id":3784565,"parent":3783657,"text":"InspiringApps, Boulder, Colorado<p>InspiringApps is a team of app experts working collaboratively in an awesome downtown Boulder location. If you like autonomy, opportunity, and frosty beers on a Friday afternoon with a company that is building compelling mobile apps with the latest technology, this could be your gig.<p>WHAT WE OFFER:<p>- A top-notch team of smart individuals<p>- Interesting and challenging work<p>- Competitive salary<p>- Insurance stipend<p>- Awesome view of the Flatirons from our downtown Boulder office<p>- RTD EcoPass<p>To apply, send us a note to jobs@inspiringapps.com including your resume and code samples.<p>We are currently looking for Senior JavaScript developers, iOS developers, and a Project Manager/Quality Control Specialist.<p><a href=\"http://www.inspiringapps.com/about/jobs/\" rel=\"nofollow\">http://www.inspiringapps.com/about/jobs/</a>","time":1333306633,"type":"comment"},{"by":"wulczer","id":3784572,"parent":3783657,"text":"Ducksboard (<a href=\"http://ducksboard.com/\" rel=\"nofollow\">http://ducksboard.com/</a>), Barcelona, Spain is looking for a full-time frontend engineer.<p>I'm one of the Ducksboard founders and I approve this message:<p>Recently funded, we're making beautiful real-time dashboards. You should know the HTML and CSS specs as the back of your hand, treat Javascript as a programming language (modular, documented, tested code) and know what SVG is. Ducksboard is gorgeous and you'll help to make it even prettier.<p>Competitive salary, relocation to Barcelona preferred (we'll help you with everything, one of the founders is an expat as well) but we'll also consider remote hires.<p>Email jobs@ducksboard.com or me (email in my profile).","time":1333306782,"type":"comment"},{"by":"jsl","id":3783923,"parent":3783657,"text":"New York, NY / Colombia (South America) - Stack Builders<p>FULLTIME<p>Stack Builders is a consulting company primarily focused on building large applications for our clients in Ruby on Rails. We're also experimenting with languages like Clojure for future projects. We have teams in both New York and Colombia and are looking for top developers in both areas.<p>We're looking for engineers who can not only build applications in frameworks like Rails, but who can dig in and extend and troubleshoot those frameworks when necessary.<p>See <a href=\"http://stackbuilders.com/careers\" rel=\"nofollow\">http://stackbuilders.com/careers</a> for more, or write me directly with your CV / code samples or questions - justin@stackbuilders.com.","time":1333294484,"type":"comment"},{"by":"jroll","id":3783793,"parent":3783657,"text":"Mountain View - drchrono.com (YC W11) [full time and interns]<p>We're looking for more engineers and salespeople to help us revolutionize healthcare through mobile and web interfaces. Our stack includes Python/Django, iOS, and Android, but you don't need to be an expert, just ready and willing to learn fast! Our product supports thousands of doctors who depend on our systems daily to provide quality care to their patients, iPad in hand. The usual startup benefits included: competitive salary, healthcare, whatever hardware you need to be most productive. email: jobs@[our-domain-name]<p>Take our hacker test at <a href=\"http://bit.ly/qbKAut\" rel=\"nofollow\">http://bit.ly/qbKAut</a>","time":1333291875,"type":"comment"},{"by":"rabedik","id":3785098,"parent":3783657,"text":"Software Engineer, San Francisco CA<p>OcuSpec is a venture backed start-up developing motion control technology that is radically more powerful and affordable than anything currently available. We're seeking smart, passionate people interested in challenging problems and changing the way people interact with machines.<p>Desired Skills/Experience: Software architecture, cross-platform APIs, C/C++, parallel processing (GPU/CPU), computer graphics (openGL/DirectX), real-time systems. This is a great opportunity to work on and take ownership of bleeding edge technology at a early stage. We offer very competitive compensation, great benefits and an office near the Caltrain.","time":1333317290,"type":"comment"},{"by":"CReber","id":3794829,"parent":3783657,"text":"6Wunderkinder (6wunderkinder.com) - Berlin, Germany (no REMOTE)<p>We created Wunderlist and Wunderkit - two fast-growing productivity products (2m+ users). We are looking for Backbone.js, Rails, Android, Mac and QA engineers.<p>To us, you are more than an employee. You are family. And we value family. So expect no senseless hierarchies, only open discussions and transparency. With people from 4 continents, you'll be surrounded by some of the most diverse and smartest people on the planet. Ready yourself to learn a lot, laugh a lot, and change the world.<p>Please checkout our jobs at <a href=\"http://www.6wunderkinder.com/jobs\" rel=\"nofollow\">http://www.6wunderkinder.com/jobs</a>","time":1333487197,"type":"comment"},{"by":"alexandros","id":3784718,"parent":3783657,"text":"Rulemotion is hiring in Athens, Greece. We're building a cutting edge Javascript/Coffeescript &#38; node.js team, with the best hackers we can get our hands on. We also have opennings for capable Python/Django Devs.<p>If:<p>...you are interested in a position with a phenomenal team, the ability to solve hard problems and are able to manage your own time,<p>...you are entrepreneurial and want to work with a growing startup that appreciates good coders and pays above the market,<p>...you enjoy working with people passionate about good code, using all the latest tools and libraries, and encouraging open source contributions,<p>...then I'd love to talk to you! Drop me a line at alexandros [at] rulemotion [dot] com.","time":1333310883,"type":"comment"},{"by":"antgoldbloom","id":3784108,"parent":3783657,"text":"Kaggle - San Francisco and REMOTE\nWe're looking for:<p>* Developers (REMOTE)<p>* Product manager<p>* Data scientists<p>Kaggle is a platform for data science competitions, that is changing the way data science is done. We've already solved problems for NASA, Wikipedia, Ford and Allstate (see some of the problems we've solved here: <a href=\"http://www.abc.net.au/catalyst/stories/3296837.htm\" rel=\"nofollow\">http://www.abc.net.au/catalyst/stories/3296837.htm</a>).<p>We're currently a team of 11, and we're looking for the outstanding developers, product managers and data scientists that will form the core team.<p>More information at <a href=\"http://www.kaggle.com/careers\" rel=\"nofollow\">http://www.kaggle.com/careers</a>","time":1333297626,"type":"comment"},{"by":"nirvanatikku","id":3784242,"parent":3783657,"text":"Verivo Software - Waltham, MA, USA and London, UK - <a href=\"http://www.verivo.com/\" rel=\"nofollow\">http://www.verivo.com/</a><p>We offer a mobile enterprise app development platform, have established our business and are growing rapidly. We're looking for talented<p>* Software Engineers - Client side (iOS/Android/BB/WP/HTML5) and Server side (.NET/IIS stack)\n* QA/Automation Engineers\n* UI Engineers\n* Product Managers\n* Enterprise Sales Representatives<p>For more details, check out our careers page: <a href=\"http://www.verivo.com/about-us/careers/\" rel=\"nofollow\">http://www.verivo.com/about-us/careers/</a><p>If interested, feel free to reach out to me: ntikku@verivo.com","time":1333299758,"type":"comment"},{"by":"blo","id":3784983,"parent":3783657,"text":"San Francisco, CA (SOMA) - Mobile / Front-end engineers, Full-stack (node.js) engineers - Full time / intern<p>Stealth - consumer web and mobile<p>--<p>Do you find yourself using Google to navigate websites that you commonly use, or end up with many browser tabs trying to accomplish some task? We're innovating along how people interact with online services and designing a new web-based experience that allows users to accomplish tasks in a more usable, efficient, and social manner.<p>We work mainly with JS (jquery and node.js) and HTML5. Mobile developers should be familiar with iOS/Android.<p>Curious? Contact [my username] at alum.mit.edu.  Including your portfolio is preferable!","time":1333315737,"type":"comment"},{"by":"amac","id":3784527,"parent":3783657,"text":"SEEKING FREELANCER - Remote\nLion is seeking an ambitious and motivated intern for 2012. This position is remote based; the person required should be willing to work both in their own location and on their own initiative. This is ideal for someone passionate about marketing or sales.\nTasks to do:\n- Provide week-to-week support.\n- Engage with users of Lion in the Lion.co.uk Community.\n- Manage social media presences.\n- Track and manage brand mentions and coverage.\n- Research as needed.\n- Serve as a brand ambassador for Lion online and offline.\nContact am@lion.co.uk or via HN profile.","time":1333305548,"type":"comment"},{"by":"hargettp","id":3821525,"parent":3783657,"text":"Mirror Image Internet, Inc. (mirror-image.com) -- Tewksbury MA (north of Boston)<p>User Interface Software Development Engineer<p>Build the UI for the growing portfolio of web applications we provide to our customers!<p>While the work will initially be almost entirely in HTML/CSS/Javascript (jQuery, typically), we expect you are still an adept software engineer who is unafraid to dive into the Java code running on the server behind your web pages.<p>For more details, see the full posting here: <a href=\"https://jobs.github.com/positions/10e73e32-825a-11e1-90fe-a377ca88290e\" rel=\"nofollow\">https://jobs.github.com/positions/10e73e32-825a-11e1-90fe-a3...</a>","time":1334053580,"type":"comment"},{"by":"MPiccinato","id":3794529,"parent":3783657,"text":"UpTo (upto.com) - Detroit, MI (possible remote)<p>iOS and Android Developers<p>We are a Detroit-based, venture-backed startup developing UpTo - a next generation platform focused on the future tense. We're seeking talented, highly motivated iOS and Android developers that will have an instrumental role in the ongoing development of the UpTo platform.  If you are a developer that is passionate about mobile, we want to talk to you.<p>Shoot me an email, mat@upto.com<p>Or check out our posting <a href=\"http://careers.stackoverflow.com/jobs/18463/ios-application-developer-upto\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/18463/ios-application-...</a>","time":1333482981,"type":"comment"},{"by":"bobx11","id":3784211,"parent":3783657,"text":"Matchbox, Inc. (<a href=\"http://matchbox.net\" rel=\"nofollow\">http://matchbox.net</a>)\nBoston, MA / Cambridge, MA<p>We make the software that powers university admissions decisions at top ranked schools in the world.  We are always looking for other design-oriented makers to join our funded startup that is located on the red line in Kendal Square.  Our office environment is fun, everyone is passionate about the problems we solve and the tools we use, and we iterate collaboratively on our designs.<p>We use iOS (iPad) and Backbone on the front-end and Python, Django, and MongoDB on the back-end.<p>Email me at: jsullivan@matchbox.net","time":1333299288,"type":"comment"},{"by":"speek","id":3784784,"parent":3783657,"text":"Boston/San Francisco/Remote (full time, part time, interns welcome)<p>We're an Innovation and Design Firm based in Boston (think of us as a mix between IDEO and Xerox PARC <i>cough</i> Eames <i>cough</i>) -- we've got a bunch of projects that we're working on and we're looking for more people to help us actualize our vision.<p>We're looking for designers and developers, but to give you a look at what we've got going on, we're working on:<p>- A children's book (iPad app)<p>- A connected device platform<p>- An augmented reality brand recognition engine<p>- A supplement fulfillment subscription service<p>- A real-time sports fan community application<p>+ others<p>If any of this stuff looks interesting, shoot me an email at marc@fluentconcepts.com.","time":1333312326,"type":"comment"},{"by":"leeny","id":3790932,"parent":3783657,"text":"TrialPay - Mountain View, CA<p>We're looking for back-end generalists.<p>Some of the shiny, new things we're working on this year include managing huge volumes of data (~we're now getting 100 million unique visits a day), creating mobile apps for multiple platforms, and getting really good at figuring out which offers we should show to which users.<p>Read more about us here: <a href=\"http://allthingsd.com/20120131/visa-places-bet-on-new-approach-to-payments-with-rare-investment-in-trialpay/\" rel=\"nofollow\">http://allthingsd.com/20120131/visa-places-bet-on-new-approa...</a><p>If you're interested, contact me: aline at trialpay dot com","time":1333414107,"type":"comment"},{"by":"kabir_h","id":3784945,"parent":3783657,"text":"Cambridge, MA - Shareaholic makes tools for publishers and users to help them find and share the best content on the web. We're a small, funded startup (with killer investors like Dave McClure, Dharmesh Shah +more) that reaches 270 million unique users via 200K publishers. We've got an awesome culture that avoids bureaucracy and gives everyone a meaningful chance to contribute. Everyone codes, even our marketing person.<p>We're hiring a Product Designer and Front End Developer:\n<a href=\"http://www.shareaholic.com/careers\" rel=\"nofollow\">http://www.shareaholic.com/careers</a>","time":1333315118,"type":"comment"},{"by":"peach","id":3787235,"parent":3783657,"text":"DevOps Engineeer @ TheFrameworks (theframeworks.com): we are looking for someone to join our young and growing team in a permanent position in our London offices (no remote, work permit needed).<p>We're looking for:<p>* someone with a very good Linux knowledge, OSS enthusiast<p>* proficient programmer in PHP (although we are looking into other possibilities - as rb or py)<p>Will be:<p>* responsible for back end development<p>* maintain and improve the server system<p>More info and application form here: \n<a href=\"http://careers.stackoverflow.com/jobs/16483/devops-engineer-web-developer-theframeworks\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/16483/devops-engineer-...</a>","time":1333360361,"type":"comment"},{"by":"kapilkale","id":3785221,"kids":[3789220],"parent":3783657,"text":"GiftRocket (giftrocket.com)- San Francisco (no remote, no H1B)<p>Community Manager- employee #1<p>We're a small YC-backed company (W11) working in the gift card space. We have been growing like crazy over the past year. We're looking for a technically minded community manager to help us handle customer support, gather and analyze feedback, and help with portions of our marketing efforts. The position is also employee #1, so we expect this person to become a leader in our organization as we scale.<p>More info here:\n<a href=\"http://www.giftrocket.com/jobs\" rel=\"nofollow\">http://www.giftrocket.com/jobs</a>","time":1333319561,"type":"comment"},{"by":"heijmans","id":3788295,"parent":3783657,"text":"MagStream is hiring in The Hague, Netherlands. We are looking for both Junior and Senior JavaScript developers.<p>We are currently building an HTML5 / CSS3 / JavaScript based platform for designing and viewing multimedia magazines. We are a small, dedicated company that works for big companies and other happy clients.<p>For us motivation and team spirit are more important than experience. We are looking for programmers who enjoy creating new products, learning new tech and solving problems. Join us in building the best publication platform!<p>Contact me at jan at magstream dot com for more info.","time":1333377411,"type":"comment"},{"by":"chrisjconlin","id":3783986,"parent":3783657,"text":"NYC, FULLTIME\n2tor (<a href=\"http://2tor.com\" rel=\"nofollow\">http://2tor.com</a>) is changing higher education by building the infrastructure that brings high quality university graduate programs online. Our current partners include USC, Georgetown, and UNC, with more on the way.<p>Hiring: very strong Javascript developers and a DevOps/AWS engineer, but if you want to get your hands dirty with Python, MySQL, MongoDB, building REST APIs, Salesforce, or PHP we'd like to hear from you.<p><a href=\"http://jobvite.com/m?3EC5hfwm\" rel=\"nofollow\">http://jobvite.com/m?3EC5hfwm</a>","time":1333295791,"type":"comment"},{"by":"longhornzee","id":3784003,"parent":3783657,"text":"Twilio (twilio.com) — San Francisco, CA (no REMOTE)<p>Business Development Manager (2 openings) - ISV &#38; Mobile App Ecosystem<p>Looking for 2 technically savvy business folks who have a track record of creating win-win partnerships, and want to drive the next phase of growth for a company that already has 75,000 businesses and developers relying on our service.<p>Details here:<p><a href=\"http://twilio.jobscore.com/jobs/twilio/business-development-manager-mobile-app-ecosystem/bHeuvwDpKr4AemeJe4bk1X\" rel=\"nofollow\">http://twilio.jobscore.com/jobs/twilio/business-development-...</a>","time":1333296091,"type":"comment"},{"by":"cr4zy","id":3784347,"parent":3783657,"text":"Stremor ~ Scottsdale, AZ<p>Front-end Engineer, iOS/mobile developer, or Python dev<p>Startup with a core team of highly successful technical entrepreneurs looking to add talented self-starters to drive direction and product. Our product combines a revolutionary UX for a proven consumer need, driven by big real-time data.<p>The technologies we're building with are Google App Engine\n- Python\n- Objective C\n- HTML5\n- LESS\n- Cocoa touch\nand Git<p><a href=\"http://www.stremor.com/whoweneed.html\" rel=\"nofollow\">http://www.stremor.com/whoweneed.html</a><p>Keywords: iPad, Android, GAE, tablet, Phoenix, Arizona","time":1333301618,"type":"comment"},{"by":"adam1010","id":3787000,"parent":3783657,"text":"RentStuff.com -- Chicago, IL -- Full Time (REMOTE optional)<p>PHP Developer for a venture-backed start-up working out of 1871 in Chicago (in the Merchandise Mart)<p><a href=\"http://www.rentstuff.com/jobs/php_dev\" rel=\"nofollow\">http://www.rentstuff.com/jobs/php_dev</a><p>We are a marketplace for renting out stuff you own to other people (bikes, camera equipment, tents and outdoor gear, etc) -- we have a safety guarantee to cover any theft or damage.<p>Intimate, small team environment with lots of authority and great perks!<p>Mysql, jQuery, Bootstrap, LAMP, EC2, AWS, Javascript, FT, Full-Time","time":1333356418,"type":"comment"},{"by":"Clear-Capital","id":3819812,"parent":3783657,"text":"Truckee, CA, (Tahoe) FULL TIME<p>Some people dream of living in Tahoe, but feel that the opportunities to grow their career just don't exist in this area.  Clear Capital offers a rare mix of fast growth,  undying devotion to technical innovation, stability (10 years old, $120MM company) and a Tahoe location!  Your exceptional programming skills will be used daily to create web applications that literally run our company.  When it comes to new tech, if we don't use it, we want to.  We write all of our own code and we actively seek out new technologies and languages that can help us continue to grow and become more efficient.  If you like the mountains but thought the jobs weren't there, didn't pay well or didn't offer career advancement, think again.  We are currently hiring:<p>Applications Developer: We are looking for a developer who understands the benefits of object oriented development, takes pride in their work, knows java, C# and .NET and is hungry to learn and contribute.  <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=135\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Applications Development Manager:  Our next manager will have no problem jumping in to code using java, ColdFusion, jQuery, AJAX or javascript when needed without missing a beat.  Our manager will also understand how to keep the team productive when the jobs are coming in fast and will have learned the trade from a successful career in app dev management.  <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=134\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Front End Developer: Help develop web UIs that integrate our back end components using HTML, CSS, jQuery and JavaScript. <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=136\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a><p>Graphic Designer:  Do you live and breath clean design?  Do you appreciate what your design can do to drive a B2B business forward?  Strong business focused web design portfolio required.  <a href=\"http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLEARCAPITAL&#38;cws=5&#38;rid=84\" rel=\"nofollow\">http://tbe.taleo.net/NA8/ats/careers/requisition.jsp?org=CLE...</a>","time":1334013894,"type":"comment"},{"by":"fierarul","id":3783879,"parent":3783657,"text":"Fulltime REMOTE employee (Timisoara, Romania)<p><a href=\"http://www.josekibold.ro/jobs\" rel=\"nofollow\">http://www.josekibold.ro/jobs</a><p>Two remote positions:<p>* Experienced Java developer (Swing based app)<p>* Testing and QA engineer<p>(We are in Timisoara, Arad and Targu-Mures.)","time":1333293758,"type":"comment"},{"by":"jzoidberg","id":3788239,"parent":3783657,"text":"Sunnyvale and San Diego CA<p>Front-end UI Developer<p>GridX - we are a well funded startup developing a unique new application to operate the next generation smart electricity grid.\nJoin and help us solve some of the most complex and rewarding energy and environmental problems of our time using Big Data and Cloud Computing.<p>We use Scala based web frameworks like Liftweb and Play! - experience with or interest in those would be a plus.<p>Our UI's use highly interactive HTML5 with WebSockets and Server Side Events. Rendering in SVG and Canvas.<p>Please contact johan at gridx dot com","time":1333376837,"type":"comment"},{"by":"etrgreg","id":3783984,"parent":3783657,"text":"New York, NY<p>ExpandTheRoom, a boutique creative agency, is looking for full-time Mobile Developers (Windows Phone 7, iOS, Android) as well as PHP Developers and UX Designers. We have a truly excellent team of developers and designers, and a fun work environment and culture. We'd also consider internships. If you're interested, check the site - <a href=\"http://www.expandtheroom.com/jobs\" rel=\"nofollow\">http://www.expandtheroom.com/jobs</a> or contact us at iwannawork@expandtheroom.com.","time":1333295763,"type":"comment"},{"by":"ecopoesis","id":3784411,"parent":3783657,"text":"Charlestown / Boston, MA - Local, Fulltime - Software Engineers (Mid and Senior) and Senior Sysadmin<p>Help Tingo.com and SmarterTravel change the hotel booking industry by taking the gamble out of booking. We're looking for experienced developers, preferable with some Java or PHP background. We're also looking for a senior Linux sysadmin with Puppet experience.<p><a href=\"http://www.smartertravelmedia.com/careers/apply_now\" rel=\"nofollow\">http://www.smartertravelmedia.com/careers/apply_now</a>","time":1333302870,"type":"comment"},{"by":"sbisker","id":3784267,"parent":3783657,"text":"Cambridge, MA / San Francisco, CA - Full Time or Intern<p>Web Developer at Locu (<a href=\"http://www.locu.com\" rel=\"nofollow\">http://www.locu.com</a>)<p># Exceptional software engineering talent<p># Exceptional cross-browser JavaScript/jQuery, HTML and CSS skills, or the ability to learn quickly<p># Experience with Python / Django is a plus<p># Previous experience building rich, interactive websites<p># Basic design skills (Photoshop), ability to work with designers<p># Experience in designing dashboards and user interfaces is a plus<p># Previous start-up experience is a plus<p>Front-enders, \"desingineers\" and full-stack all welcome for this position - as long as you enjoy hacking on cool new products and features. :D (We're not explicitly recruiting for pure backend or pure design positions right now, but we're open to resumes there as well - see <a href=\"http://locu.com/#jobs\" rel=\"nofollow\">http://locu.com/#jobs</a> for details. If you're a perfect fit, we'll find a way to make it work.)<p>Locu is developing technologies to change local search ($35bn advertising market by 2014) by creating the world's largest semantically-annotated repository of real-time small-business data. We are about to launch MenuPlatform &#60;<a href=\"http://www.menuplatform.com&#62;\" rel=\"nofollow\">http://www.menuplatform.com&#62;</a>, our first product, which helps restaurants better manage their online presence.<p>Interested? Drop us a line at jobs@locu.com. Please specify which position you're applying for, as well as \"HN\", in the subject of your letter. Learn more about our open positions at <a href=\"http://www.locu.com/#Jobs\" rel=\"nofollow\">http://www.locu.com/#Jobs</a><p>-------------------------------------<p>Founded less than a year ago by MIT graduates and researchers, Locu &#60;<a href=\"http://www.locu.com&#62\" rel=\"nofollow\">http://www.locu.com&#62</a>; has the backing and support of some of the best angel investors in the country. We are looking for more exceptional talent to join our team and help us achieve our vision. We are committed to building a cutting-edge technology giant with a fun and challenging work environment. We have a culture optimized for learning and continuous improvement. We are 10 people with very diverse backgrounds, and growing.","time":1333300174,"type":"comment"},{"by":"yogabbagabba","id":3784372,"parent":3783657,"text":"The White House will be hiring new staff soon, and the pay is not terrible: <a href=\"https://app2.whitehouse.gov/ppo/\" rel=\"nofollow\">https://app2.whitehouse.gov/ppo/</a>","time":1333302110,"type":"comment"},{"by":"shafqat","id":3786217,"parent":3783657,"text":"NewsCred - New York City, H1B okay<p>Lots of positions, but our main focus is to find engineers who are passionate about information retrieval and big data. So any interest or experience in Solr, Lucene, NLP, Machine Learning, etc would be a great fit for the types of problems we're working on.<p>We're disrupting the news industry, have amazing investors, real revenues in the millions, growing very fast.<p>And we have unlimited vacations!<p><a href=\"http://www.newscred.com/company\" rel=\"nofollow\">http://www.newscred.com/company</a>","time":1333338998,"type":"comment"},{"by":"geku","id":3785286,"parent":3783657,"text":"Zurich, Switzerland - local.ch (<a href=\"http://www.local.ch/jobs\" rel=\"nofollow\">http://www.local.ch/jobs</a>)<p>Software Engineers<p>local.ch is looking for developers with excellent JavaScript and Rails skills.\nWe are migrating our website from PHP to Rails and you have the opportunity to help shaping our future technology stack.\nVisit our job page and learn about our great work culture and all job details: <a href=\"http://www.local.ch/jobs\" rel=\"nofollow\">http://www.local.ch/jobs</a>","time":1333320531,"type":"comment"},{"by":"ksowocki","id":3785619,"parent":3783657,"text":"Stepout (formerly Ignighter, Techstars '08) - New York City, Mumbai\nFull and Part Time PHP &#38; jQuery Developers<p>We are India's fastest growing online social dating website.  Here is a profile from the nytimes.  <a href=\"http://www.nytimes.com/2011/02/20/business/20ignite.html?pagewanted=all\" rel=\"nofollow\">http://www.nytimes.com/2011/02/20/business/20ignite.html?pag...</a><p>Browse our open positions at <a href=\"http://stepout.com/jobs\" rel=\"nofollow\">http://stepout.com/jobs</a>","time":1333326606,"type":"comment"},{"by":"tylerlarson","id":3784076,"parent":3783657,"text":"Paperless Post in NY and SF is hiring.<p><a href=\"http://paperlesspost.com/jobs\" rel=\"nofollow\">http://paperlesspost.com/jobs</a><p>Best job I have ever had. I'm a developer, everyone here is awesome and we are working on interesting stuff all the time.<p>We have many positions open and all of them have...<p>20 days of paid time off per year, plus 10 holidays<p>Company-covered health insurance<p>Pre-tax health and transportation benefits<p>401(k)<p>Reimbursement and time off for professional development and \nconferences<p>Discounted membership at New York Health &#38; Racquet Club<p>Happy hours, birthday parties, tech talks, and funtivities","time":1333297080,"type":"comment"},{"by":"rhc2104","id":3784728,"parent":3783657,"text":"San Francisco, CA, or REMOTE, full-time or intern<p>Samasource is a social enterprise that connects people living in poverty with life-changing work opportunities via the Internet.  Think of it as Mechanical Turk as a non-profit.  We're looking for a senior engineer (Ruby knowledge preferred but optional), PM, and other positions.<p><a href=\"http://samasource.org/careers/\" rel=\"nofollow\">http://samasource.org/careers/</a><p>Feel free to email me at rhc2104(at)columbia(dot)edu if you have any questions.","time":1333311126,"type":"comment"},{"by":"neiljohnson","id":3783729,"parent":3783657,"text":"London INTERN and full time.<p>OpenMarket are looking for Java developers to work on mobile messaging/payments platforms.<p>We offer hard problems, lots of autonomy, an engineering driven culture and full control over product delivery from design through to deployment.<p>See <a href=\"http://www.openmarket.com/europe/careers/roles/softdev\" rel=\"nofollow\">http://www.openmarket.com/europe/careers/roles/softdev</a> for more details or contact me directly at neil.johnson //at// openmarket.com","time":1333290180,"type":"comment"},{"by":"jaxzin","id":3785790,"parent":3783657,"text":"Bristol, CT - ESPN<p>Come be a Build Engineer at ESPN.com with me! Build automation, deployment workflow tools, configuration management, and developer productivity are a few of the topics we deal with for one of the largest sites on the internet.<p><a href=\"http://jobs.espncareers.com/bristol/information-technology/jobid2224618-build-engineer-i-jobs\" rel=\"nofollow\">http://jobs.espncareers.com/bristol/information-technology/j...</a><p>brian.r.jackson@(you can guess this part).com","time":1333330355,"type":"comment"},{"by":"mehuln","id":3786191,"parent":3783657,"text":"Flutter (YC W12) - Gesture Recognition thru Webcame (Flutter.io)<p>Full-time, Interns, Contract<p>- Backend Engineer C++\n- Front-End Eng - JavaScript \n- Backend Engineer - Python\n- Holistic Designer (Interactive Design &#38; Visual Design Skills), someone who wants to use design next generation of interactions and UX through gestures.<p>Passion for changing the world by enabling gestures as ubiquitous interaction layer for all devices w/ built-in webcam is a must!<p>Apply: jobs [at] Flutter.io","time":1333338379,"type":"comment"},{"by":"millerjesse","id":3783930,"parent":3783657,"text":"San Francisco, CA<p>Attachments.me is an email software company based out of the Mission in San Francisco. We are currently 5 people and looking to add a few more this year. We've built some incredible technology that lets us do great things with email.<p>See <a href=\"https://attachments.me/pages/join\" rel=\"nofollow\">https://attachments.me/pages/join</a> for the available positions and feel free to email me directly (jesse@attachments.me) for more info.","time":1333294607,"type":"comment"},{"by":"kstenerud","id":3783842,"parent":3783657,"text":"San Francisco, CA<p>Fulltime, internships<p>We build fun games for brains in San Francisco. We're a small &#38; talented team. We hate boring. Our investors are awesome. If you are nice and want to help us make splendid products, we'd love to hear from you.<p>Looking for: mobile engineers (iOS, Android), backend engineers, UI designer, animators, interns (engineering, marketing, art design).<p><a href=\"http://www.mindsnacks.com/careers/\" rel=\"nofollow\">http://www.mindsnacks.com/careers/</a>","time":1333292871,"type":"comment"},{"by":"sdoowpilihp","id":3784680,"parent":3783657,"text":"Santa Monica, Ca<p>We are a well funded, new startup that is changing the way people experience books on mobile devices.  We are in need of a generalist engineer who wants to help us build products which combine traditional books and nontraditional interactive games. Proximity to Los Angeles is desired. We're looking for braininess and experience, but if push comes to shove, we'll take brains over experience!<p>Email careers@bentoboxinteractive.com","time":1333309597,"type":"comment"},{"by":"steilpass","id":3786990,"parent":3783657,"text":"Agile Software Developers in Cologne, Germany.<p>Although we have been bought we still feel and work like a startup. We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://adkla.us\" rel=\"nofollow\">http://adkla.us</a>","time":1333356185,"type":"comment"},{"by":"isaacmoshe","id":3786333,"parent":3783657,"text":"ACADEMIZE WANTS TO FIX EDUCATION AND WE NEED YOUR HELP.<p>San Francisco, CA.<p>Front-End Developer  \nUX Designer\nUI Designer<p>Academize is a venture-backed startup currently taking part in one of San Francisco's top accelerator programmes. We're a passionate team of edutech entrepreneurs looking for talented people who share our vision to come and join us.<p>If the above sounds interesting and you think you've got what it takes then please get in touch at jobs [at] academize [dot] com.","time":1333341107,"type":"comment"},{"by":"mpisula","id":3787781,"parent":3783657,"text":"Xaxis (xaxis.com) - NYC (no REMOTE)\nXaxis, part of GroupM &#38; WPP, is looking for programmers skilled in the following:<p>* Client-side programming\n* Server-side programming (Python and/or C++)\n* Mysql\n* Strong Unix skills\n* Strong presentation skills<p>At least 2 years working with clients required.<p>The role will focus on helping onboarding clients, as well as building custom applications to help with media planning.<p>Feel free to reach out to me @ mike.pisula@xaxis.com for more details.<p>Thanks.","time":1333370785,"type":"comment"},{"by":"rmanalan","id":3783927,"kids":[3783982],"parent":3783657,"text":"San Francisco and Sydney, Australia<p>Atlassian is looking for kickass JavaScript developers <a href=\"http://bit.ly/jsconf2012\" rel=\"nofollow\">http://bit.ly/jsconf2012</a>","time":1333294542,"type":"comment"},{"by":"imdane","id":3785537,"parent":3783657,"text":"San Francisco, CA<p>Rally.org<p>We're currently a team of 25 and looking for full-time:<p>* Developers<p>* Lead Mobile Developer<p>* Data Scientist<p>* Lead Operations Engineer<p>RALLY is a fast-growing startup in the process of transforming the online giving space. It's our goal to combine design and technology to create powerful products that help nonprofits raise more money - so that they can go out and make the world a better place.<p>More information at <a href=\"http://rally.org/corp/careers\" rel=\"nofollow\">http://rally.org/corp/careers</a>","time":1333324912,"type":"comment"},{"by":"chrisdinn","id":3784013,"parent":3783657,"text":"mDialog - Toronto, ON<p>At mDialog, our product powers video delivery for some of the largest, most well-known brands in the world and helps bring the most popular shows to connected devices like the iPhone, iPad, Apple TV, Android, and Roku. We partner with the most successful device manufacturers and are considered thought leaders in the future of television broadcasting. We believe we are at the dawn of new age in broadcasting and are the technology leaders enabling the shift.<p>We're a startup looking for talented people who are excited about working with leading edge technology in a nascent space: video streaming and advertising to connected devices. As a member of our downtown Toronto team, you will contribute to the core product, be involved with product strategy, contribute to prioritizing our product roadmap and own the development of features.<p>We're looking for Scala/Java Developers (Scala experience a big plus), Project Manager and Senior Technical Writer and several other positions.<p>Details here: <a href=\"http://www.mdialog.com/careers.html\" rel=\"nofollow\">http://www.mdialog.com/careers.html</a>","time":1333296288,"type":"comment"},{"by":"devinfoley","id":3784856,"parent":3783657,"text":"Anoni - San Francisco, CA<p>Join the best developers and designers in the world.<p>Build systems and apps that your friends and family will use every day.<p>Solve difficult problems using the tools of your choice.<p>Work in a hacker-friendly environment with lots of perks.<p>We're looking for smart, talented developers who like (or would like) coding in Python, CoffeeScript, and/or iOS to join us. If this sounds like you, send an email to work@anoni.com and tell us about yourself.","time":1333313696,"type":"comment"},{"by":"moosify","id":3784200,"parent":3783657,"text":"Palo Alto @ moosify (www.moosify.com)<p>Experienced iOS Developer.<p>Do you think two people who are totally into house music and are residents at local clubs would make a good match? At moosify we think chances are they do!<p>mobile-first (angel-funded) moosify is a fun &#38; easy way to connect with new people who love the same music and similar places - it's like match.com meets spotify meets foursquare.<p>If interested, please mail Hans (hj@moosify.com)","time":1333299124,"type":"comment"},{"by":"micweiss","id":3785337,"parent":3783657,"text":"IXL Learning - San Mateo, CA, we're looking for all sorts of folks from software engineers to product designers<p>At IXL Learning, we create fun and effective Web-based learning tools. Our IXL product (located at IXL.com) is the world's most popular subscription-based learning site for K-12.<p>You can find more details on each position and how to apply here:<p><a href=\"http://www.ixl.com/jobs\" rel=\"nofollow\">http://www.ixl.com/jobs</a>","time":1333321228,"type":"comment"},{"by":"benjesson","id":3787419,"parent":3783657,"text":"REMOTE: Conversion Rate Optimization (CRO) Consultant<p>About Us...<p>Conversion Rate Experts (CRE) scientifically optimizes websites to make them more profitable, by making them more effective at converting visitors into customers. CRE's clients include Apple, Google, Sony, BT, Vodafone, SEO Book, and SEOmoz. Double-digit improvements are the norm.<p>Nine great reasons to join us...<p>* Work anywhere you choose. We are looking for the very best people, so we won’t be restricted by geographic location.<p>* Learn to be one of the world’s best conversion rate experts. We’ll reveal every secret we’ve ever discovered about growing web businesses.<p>* Industry-leading compensation—with even greater incentives when you “deliver the goods”.<p>* Prestigious clients: Lead projects for some of our great clients, like Apple, Google, Sony, Vodafone, SEOmoz and many exciting less-well-known businesses.<p>* Great colleagues. Our goal is to build and grow the world’s number one team of conversion rate experts. We also work with many of the world’s most respected marketers. So you’ll be in exciting and stimulating company.<p>* Join our private mastermind group. You’ll have access to our mastermind group in which we discuss the latest techniques we’ve developed, and the results they’ve generated.<p>* Opportunities to develop. You’ll be encouraged (and expected) to develop yourself. You’ll have freedom to utilize the latest technology, and to access the most advanced training programs. And you’ll have the budget to work with the best vendors in the world.<p>* Avoid all the nasty and boring stuff. You’ll only be required to work on the important stuff: helping our clients to grow their businesses. We’ll take care of all the admin, paperwork, negotiating, invoicing and marketing, which leaves you free to concentrate on the activities that make you money (getting results!)<p>* Entrepreneurial, but without risk. You will receive a combination of guaranteed payment plus performance-based bonuses. You’ll receive regular training designed to optimize your performance, your time and your income.<p>To learn more (or to apply online), please visit...<p>* <a href=\"http://www.conversion-rate-experts.com/careers/\" rel=\"nofollow\">http://www.conversion-rate-experts.com/careers/</a><p>Cheers,<p>Ben","time":1333364073,"type":"comment"},{"by":"alexsolo","id":3784924,"parent":3783657,"text":"San Francisco, CA<p>PagerDuty - <a href=\"http://www.pagerduty.com\" rel=\"nofollow\">http://www.pagerduty.com</a><p>FULLTIME<p>* Front-end Developer (<a href=\"http://www.pagerduty.com/jobs/engineering/frontend-engineer\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/frontend-engineer</a>)<p>* Designer<p>What we do:<p>At PagerDuty, we're building an alerting and incident tracking system that helps IT operations groups detect and respond to high-severity issues.<p>We're not like the thousands of monitoring systems out on the market. In fact, we don't do monitoring at all. Instead, we plug into existing monitoring systems and handle the people part of the equation: alerting (via phone, SMS, email), on-call scheduling for teams, auto-escalation of critical alerts, and incident tracking.<p>Our current product helps IT ops people know about critical problems as quickly as possible, collaborate as a team to fix problems quickly, and help track and improve incident response performance over time. Our vision is to expand into the event management space. This means treating data from monitoring tools as events and intelligently filtering and correlating events across monitoring tools in order to reduce the noise. It's like spam filtering for events: a critical problem, such as a bad deploy, will automatically alert the entire team via phone call, while a minor issue like a server going down in a fleet of 20 will only generate a low-priority email alert.<p>Why you should work with us:<p>We are different than many startups out there: we charge money for a product. Companies like Intuit, National Instruments, VMWare, Square and 37signals love our product; that's a lot to say for a system that frequently wakes our users up in the middle of the night. We're also fairly early stage (13 people plus a few interns). This combination means you'll get a market-rate salary plus a decent chunk of stock in a company that has already figured out product/market fit.<p>We put a very big focus on the user experience (UI/UX), since some of our core concepts can initially be confusing to people who don't have a lot of experience in the operations and support realm. We want to guide people to use best practices whenever possible. Our customers span a gamut of sizes, from small start-ups just trying to monitor their websites to enterprise clients like Heroku who have to monitor thousands of servers and deal with complex infrastructural issues. As a result, our UIs have to scale and be intuitive with a wide range of data. Simply put, we're solving problems no one else has solved before, and we're doing so by designing clean, elegant, easy-to-use UIs.<p>To apply, please send your resume to jobs@pagerduty.com.","time":1333314741,"type":"comment"},{"by":"sahillavingia","id":3784128,"parent":3783657,"text":"Gumroad (<a href=\"http://gumroad.com\" rel=\"nofollow\">http://gumroad.com</a>) - San Francisco<p>We believe that selling is far too difficult and we think it should be democratized. Why isn't it as easy as sharing?!<p>We are well-funded by super smart (and nice!) guys like Chris Sacca, Max Levchin, Ron Conway, and others.<p>Looking for: product designers, front-end engineers, and back-end engineers.<p>Email me if you're interested - sahil@gumroad.com","time":1333297909,"type":"comment"},{"by":"mprovo1","id":3785307,"parent":3783657,"text":"Cinemagr.am - Montreal (no remote, relocation possible)<p>Android Lead Dev.<p>We're looking for a talented developer to create the Android version of our app. This involve a lot of challenging and interesting problems: real-time filters, camera-shake reduction, video processing and all of that should work on devices with limited memory. Email me directly for more info: marc@cinemagr.am<p>Also, we have serious traction!","time":1333320833,"type":"comment"},{"by":"stevewilhelm","id":3784453,"parent":3783657,"text":"Palo Alto, CA, walking distance from the train station.<p>Euclid Elements is hiring. We are looking for Web designers and developers. If you have a keen design sense, an impressive portfolio, or mad HTML, CSS, or Javascript skills, drop us a line. Ping pong and randonneuring are a plus.<p><a href=\"http://euclidelements.com/about-us/jobs\" rel=\"nofollow\">http://euclidelements.com/about-us/jobs</a>","time":1333303990,"type":"comment"},{"by":"ha470","id":3784881,"parent":3783657,"text":"New York, NY - Fulltime Rails Engineer<p>Branch.com is looking for full-stack/Rails engineers and a front-end engineer to help us make online content more collaborative and conversational.<p>If you appreciate novelty, have an itch to build things, and want to work with the co-founders of Twitter, Blogger, and The Huffington Post on a weekly basis, then shoot us an email at jobs@branch.com :)","time":1333314089,"type":"comment"},{"by":"nelken","id":3785551,"parent":3783657,"text":"Cambridge, MA (Kendall Sq.)\nOutbrain is a well-funded startup providing content recommendations across a large number of publishers and blogs. We are looking for a Research Engineer to work on our recommendation algorithms. Must have strong Java skills, and preferably some machine learning background. Contact us at jobs@outbrain.com","time":1333325130,"type":"comment"},{"by":"mdu","id":3790606,"parent":3783657,"text":"Benbria - Ottawa, Canada. We are looking for:<p>1. node.js developer<p>2. Product manager<p>3. Front-end designer and developer (Dual wielding)<p>4. Software coop or interns<p>Benbria powers notification platforms for some of the largest enterprises in the world. You'll be working with us on our new customer engagement product.<p>More info at <a href=\"http://www.benbria.com/company/careers\" rel=\"nofollow\">http://www.benbria.com/company/careers</a>","time":1333408394,"type":"comment"},{"by":"FLX","id":3784015,"parent":3783657,"text":"Amsterdam, The Netherlands - Fulltime<p>We're looking for great technical support engineers in Amsterdam. Basic linux knowledge and being passionate for customers is a requirement. Be sure that you're resistant to loud music and a fully stocked kitchen :) Unfortunately visa sponsors are not possible at the moment. Email me at me {att} flx {dott} me.","time":1333296300,"type":"comment"},{"by":"msacca","id":3784004,"parent":3783657,"text":"Full Time / Part Time / Contract To Hire<p>San Diego, CA<p>Backend Node.js Developer (or proficient in Javascript - we can train)<p>Tiny Factory (tinyfactory.co) is looking for a Node.js developer to work on some large scale client and internal projects. Open to full time / part time in house (Downtown San Diego).  email hello@tinyfactory.co if interested.","time":1333296092,"type":"comment"},{"by":"Peroni","id":3786577,"parent":3783657,"text":"Make it Digital, Old Street, London, UK<p>Permanent iOS Developer<p><a href=\"http://www.makeitdigital.co.uk\" rel=\"nofollow\">http://www.makeitdigital.co.uk</a><p>Full job description &#38; salary details can be found here: <a href=\"http://hackerjobs.co.uk/jobs/2012/3/26/ios-developer\" rel=\"nofollow\">http://hackerjobs.co.uk/jobs/2012/3/26/ios-developer</a>","time":1333347758,"type":"comment"},{"by":"mpresh","id":3784712,"parent":3783657,"text":"Cloudlock.com in Waltham MA. We are a funded startup building very cool and challenging applications on top of Google App Engine to provide security and analytics for companies that are using Google Docs/Apps as their file sharing platform.<p>Feel free to contact me directly (mike@cloudlock.com) with any questions.","time":1333310641,"type":"comment"},{"by":"willf","id":3784037,"parent":3783657,"text":"Wordnik is looking for a Machine Learning expert, especially those with an interest and with skills in large text processing, to join the team working on both acquisition of lexical information as well as classification and ranking problems. You can write me directly at will@wordnik.com.","time":1333296540,"type":"comment"},{"by":"Peroni","id":3784577,"parent":3783657,"text":"Make it Digital, Old Street, London, UK.<p>Permanent iOS Developer<p>Full details &#38; salary info here: <a href=\"http://hackerjobs.co.uk/jobs/2012/3/26/ios-developer\" rel=\"nofollow\">http://hackerjobs.co.uk/jobs/2012/3/26/ios-developer</a><p>If you're interested, email steve.buckley@makeitdigital.co.uk with your CV and make sure to mention HN.","time":1333306986,"type":"comment"},{"by":"krupan","id":3783823,"parent":3783657,"text":"Salt Lake City, Utah<p>San Jose, CA<p>Superior, CO<p>Full-time.  Fusion-io (we make some of the fastest non-volatile storage in the world, NYSE: FIO).<p>Various software developer positions:<p><a href=\"http://fusionio.hrmdirect.com/employment/search.php?search=true&#38;dept=8782&#38;state=-1\" rel=\"nofollow\">http://fusionio.hrmdirect.com/employment/search.php?search=t...</a>","time":1333292584,"type":"comment"},{"by":"nrh","id":3784027,"parent":3783657,"text":"NYC - Spotify - Full-time<p>Backend: SRE, Software Engineer (Infrastructure), Software Engineer (Backend)<p>Primarily Python &#38; Java, also C/C++, deployed on Debian with Puppet.  Looking for dev and ops (and devops?) with experience working at scale.<p><a href=\"http://spotify.com/jobs/\" rel=\"nofollow\">http://spotify.com/jobs/</a>","time":1333296440,"type":"comment"},{"by":"sethbannon","id":3784691,"parent":3783657,"text":"Amicus is hiring developers looking to make a positive impact with their code. Can you write CSS in your sleep, but are kept awake at night thinking about how to direct your skills towards a more meaningful impact?<p><a href=\"http://jobs.amicushq.com/\" rel=\"nofollow\">http://jobs.amicushq.com/</a><p>New York, NY.","time":1333310026,"type":"comment"},{"by":"KaperLabs","id":3825184,"parent":3783657,"text":"Sunnyvale, CA<p>Currently in Stealth Mode, we are looking for the best Frontend/Backend WebTech engineers. If you have projects to demonstrate, send in your github link etc to<p>jobs@kaperlabs.com<p>Requisite:\nCan churn in millions of lines of code in no time.  \nHave keen interest in Algorithms.<p>If you hate Manchester United, that is a plus :)","time":1334102980,"type":"comment"},{"by":"philco","id":3784381,"parent":3783657,"text":"Meeteor.com\nLooking for a Lead Visual Designer (Employee #1)\nSeattle WA, but willing to work remotely.<p>More on the position here: \n<a href=\"http://philco.thenewhive.com/meeteor-lead-designer\" rel=\"nofollow\">http://philco.thenewhive.com/meeteor-lead-designer</a>","time":1333302297,"type":"comment"},{"by":"happyrock","id":3783964,"parent":3783657,"text":"Work Market (workmarket.com) - NYC (no remote!)<p>Java dev (MySQL, Spring), UX, UI, Designer, Product, and Operations (EC2, Puppet).<p>Union Sq/Spark Capital funded.<p>More here: <a href=\"http://www.workmarket.com/jobs\" rel=\"nofollow\">http://www.workmarket.com/jobs</a> and you can apply via the site!","time":1333295400,"type":"comment"},{"by":"dmvaldman","id":3784457,"parent":3783657,"text":"Mountainview, CA<p>I'm applying to YC S12 as a solo founder. The project is <a href=\"http://www.quipvideo.com\" rel=\"nofollow\">http://www.quipvideo.com</a>. Want to join me? I'm especially looking for a backend NodeJS + MongoDB + AWS wizard.<p>Contact me! dave AT quipvideo DOT com","time":1333304040,"type":"comment"},{"by":"krupan","id":3783833,"parent":3783657,"text":"San Jose, CA<p>Full-time<p>Logic Verification Manager, Fusion-io (we make some of the fastest non-volatile storage in the world, NYSE: FIO).<p><a href=\"http://fusionio.hrmdirect.com/employment/view.php?req=83377&#38\" rel=\"nofollow\">http://fusionio.hrmdirect.com/employment/view.php?req=83377&...</a>;","time":1333292754,"type":"comment"},{"by":"ruckusred","id":3802898,"parent":3783657,"text":"MoviePass is hiring for Customer Support (interns or full-time), as well as a Full Stack Lead Developer/Architect (permanent).\nWe're located in NYC, but finding the right person is more important than their location.\nSend an email to kristina@moviepass.com with contact info and any relevant information you'd like to share.<p>Customer Support Agent<p>What You Can Expect:\nWe have a dynamic, laid back office with other funded startups. We believe the more fun and freedom an individual has, the more they create and contribute, and our office shows this. You'll also get to be a part of the early stages of a young company, knowing that you are helping provide what could be the best customer experience ever :)<p>What We Expect:\nYou LOVE talking to people, and and you're creative with ways to delight them. You can easily handle a phone call, 3 chats, and a barrage of emails, all while boxing up t-shirts to send out and compiling our daily reports. You have a tremendous drive to succeed, and you like discussing creative ideas on how to do that. You're eager to learn about the startup world, and you've had entrepreneurial ideas of your own. You plan on staying with us for awhile, because you love seeing projects through to the end. You have phenomenal communication skills, written and verbal, and you tackle problems head on.<p>Full Stack Lead Developer / Architect<p>background includes...\n5+ years experience with RoR with demonstrable experience using best practices. For example:\n'separation of concerns', 'skinny controllers / fat models', 'progressive enhancement'\ntesting frameworks - preferably RSpec/Cucumber/Web as well as Continuous Integration (both setup and use).  Should be part of your daily workflow.\nAbility to plan and develop a coherent system across various platforms - desktop, mobile, mobile apps\nExternal API's - producing/consuming XML-based data feeds\nGit - should be comfortable with not only basic usage - but more advanced features as well - push/pull branches, gitflow, etc.\nHTML5 &#38; CSS3 - best practices and graceful degradation\nJavascript.  Should be very comfortable with Javascript/JQuery/Ajax\nExperience with payment gateways and e-commerce solutions.\nExperience creating mobile sites\nConfident inheriting legacy code that needs improvement.\nAuthoritative Dev Leader, with the ability to collaborate across departments\nMust have excellent communication skills - both verbal and written, able to articulate ideas.\nAbility to break a job into smaller tasks and accurately estimate time to complete overall project<p>…a plus:\nExperience deploying / managing apps on EngineYard\niOS or Android Develop experience","time":1333638987,"type":"comment"},{"by":"jeffwidman","id":3785649,"parent":3783657,"text":"PageLever (YC S11) - San Francisco - Hiring non-technical person who wants to learn business side of a tech startup<p>See <a href=\"http://news.ycombinator.com/item?id=3778290\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3778290</a>","time":1333327588,"type":"comment"},{"by":"exim","id":3792168,"parent":3783657,"text":"It would be great if job postings will include regions (Europe, Asia, etc...).","time":1333445301,"type":"comment"},{"by":"pmjoyce","id":3792441,"parent":3783657,"text":"Geckoboard -- London, UK -- FULLTIME<p>Several positions including:<p>Software engineers x 3<p>Interface Designer<p>Community Manager and Evangelist<p>More details at <a href=\"http://jobs.geckoboard.com/\" rel=\"nofollow\">http://jobs.geckoboard.com/</a> or ping me a mail at paul@geckoboard.com","time":1333452156,"type":"comment"},{"by":"RDDavies","id":3800093,"parent":3783657,"text":"Simplexity (simplexity.com, wirefly.com)<p>UX Analyst / Developer Roles (Separate)\nReston, VA<p>Shoot me an email, rdavies@simplexity.com. We've got an awesome culture, and you get to work with a LOT of really smart people.","time":1333576925,"type":"comment"},{"by":"khuyi","id":3784414,"parent":3783657,"text":"HowAboutWe.com, a Brooklyn based online dating startup, is hiring Rails developers, designers, and a display media buyer. Check out www.howaboutwe.com/jobs","time":1333302917,"type":"comment"},{"by":"dogas","id":3784147,"parent":3783657,"text":"Seattle/Philadelphia/Remote<p>Web Operations Engineer (DevOps) at PipelineDeals (<a href=\"http://www.pipelinedeals.com\" rel=\"nofollow\">http://www.pipelinedeals.com</a>)<p>Work at a well-established small company that’s almost 6 years old, bootstrapped, profitable, and proud!  PipelineDeals LLC is looking for a full-time Operations Engineer to join our team. You will be in charge of managing all services running at PipelineDeals.com, from developer testbeds to the production infrastructure that tens of thousands of customers use. We need an individual to help build and maintain the supporting infrastructure, as well as ensure a top-notch experience for our customers.<p>Environment: We use leading-edge tech for our product -- Percona MySQL 5.5, Xtrabackup, Redis, Kiji-ruby, HAProxy, and Chef to manage it all.  We are very progressive about our technology use and are always striving to deliver the fastest and most reloable experience for our customers.  We believe strongly in metrics, testing, continuous integration, and working fluidly and harmoniously with our engineering and product teams. Everything we write is designed for simplicity and maintainability. We take security very, very seriously.  All our code runs in the cloud (AWS).<p>You should have:<p>- At least 2 years experience in a systems-related role, supporting and maintaining multiple mission-critical *NIX servers.<p>- Advanced experience in systems administration, packaging and installer technologies.<p>- Experience with Amazon EC2 and the AWS stack (we use fun stuff like S3, ELB, ElastiCache, EBS, IAM).<p>- Experience with Chef, Puppet or another configuration management system (we use Chef).<p>- Experience administering MySQL and InnoDB deployments.<p>- Firm grasp of TCP/IP networking.<p>- Strong written and verbal communication skills.<p>- Excellent organizational skills.<p>- Strong analytical and troubleshooting skills, under pressure.<p>- Have opinions on the right way to do things, and are comfortable sharing them, respectfully.<p>It would be great if you have any of the following:<p>- Experience developing and documenting plans, policies and procedures in support of IT security, disaster recovery, and business continuity planning.<p>- Experience deploying and running build and test automation tools (we use Buildbot, Cucumber and Jasmime).<p>- Knowledge of web application server configuration (Nginx and Unicorn).<p>- Familiar with source control systems such as Git.<p>If interested, please email Grant at grant@pipelinedeals.com.","time":1333298248,"type":"comment"},{"by":"joebasirico","id":3784508,"parent":3783657,"text":"Boston, MA<p>Security Innovation is hiring two roles.<p>A Security Engineer and a Lead Security Manager. If you eat, sleep and breathe Software Security please apply! We've also setup a challenge website for you to test your skills on at: <a href=\"http://bit.ly/Hekjxe\" rel=\"nofollow\">http://bit.ly/Hekjxe</a> (email jobs@securityinnovation.com for hints if you get stuck).<p>Lead Security Manager<p>Our Lead Security Manager will be tasked with delivering security assessments and managing a team of security engineers to deliver security assessments for Security Innovation's wide array of clients; from web, embedded, desktop, mobile and cloud based applications. This person should have some management experience and deep technical, security experience. Their day to day tasks include helping to scope application security projects, delivering the projects, leading and growing a team of security engineers and helping the local sales and marketing resources with proper messaging and understanding. Additionally this person will be expected to lead projects and interface directly with our clients. This person should have at least 3-5 years of manual application penetration testing experience, deep security knowledge, and 1-2 years of development experience.<p>Security Engineer<p>At Security Innovation Security Engineers are tasked with delivering security assessments for our wide array of clients on an even wider array of technologies and platforms. This person should have deep technical and security knowledge. This person will be tasked with performing manual Penetration Tests, Code Reviews, creating Threat Models, Design Reviews and more. Beyond their technical skill this person should have strong written and spoken communication skills. Additionally, this person should have 1-3 years of manual application assessment experience, deep security experience, and development experience would be a plus.<p>About Security Innovation<p>Security Innovation helps our clients to reduce their overall risk by providing application security services, education and standards. We assess the security of a wide range of applications and technologies to ensure they properly protect their sensitive data. Security Innovation is headquartered in Boston and has a branch office in Seattle, WA. This is an immensely challenging and rewarding company to work for, we have built a tight knit team of security experts who are well regarded as leaders in the field. As a reward for being the best in the industry we provide our engineers with 10% of their time for research, hefty hardware and research budgets, retirement, compensation and insurance packages. Oh, and we have unlimited vacation too.<p>More info at:\n<a href=\"http://bit.ly/pisNHF\" rel=\"nofollow\">http://bit.ly/pisNHF</a>","time":1333305229,"type":"comment"},{"by":"itay","id":3818609,"parent":3783657,"text":"Seattle, San Francisco, Cupertino (and other places), FULL-TIME, INTERN, H1B<p>A lot of people think Splunk must be a terrible place to work at because they think it is an \"enterprise\" company. But the truth is, we have great jobs for a lot of people.<p>Want to work on awesome visualizations for gigabytes and terabytes of data daily? We got it. Want to work on building a development platform for an extremely powerful data analysis tool? We got it. Want to help make the core server that powers our extremely fast indexing and performance better? We got it.<p>For example, my project for the past couple of months has been to develop our new Node.js/Browser SDK, including pulling some of our propietary UI components and sharing them with the world. We also do a lot of work with customers to best help them use Splunk. One of the projects I was involved in included analyzing social data using Splunk (like Twitter/Foursquare).<p>Whether it's UI, core systems engineering, dev platform or anything in between, we likely have something for you. I personally work on the development platform in the Seattle office, but I'm happy to answer questions about anything. Feel free to shoot me an email (in my profile), or comment here.<p>I wanted to highlight a few specific positions we're looking for:<p>* Dev. Platform Software Engineer: This is the team I work on. We strongly believe that there is a use for Splunk outside of logging, and we're enabling the usage of the technology for dealing with large quantities of data, whether it's for social network analysis, cloud management or anything in between. <a href=\"http://www.splunk.com/view/SP-\" rel=\"nofollow\">http://www.splunk.com/view/SP-</a>\nCAAAGK3?jvi=oHkCVfwi<p>* Cloud Software Engineer: we're developing the next stage of our product, which is a hosted version of Splunk in the cloud, with all the benefits you'd expect (like automatic elastic scaling). Come help us make this a reality: <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o4U8VfwL</a><p>* Hadoop Software Engineer: Usage of Hadoop is exploding to do batch-oriented processing on massive quantities of data. We think there is a lot of value to be had by combining the power of Splunk and Hadoop, and we're developing solutions to make this possible. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oqCaWfwS</a><p>* Software Engineer in Test: Splunk is a complex machine, deployed in a distributed manner, many times being used for different things. Our testing team is top notch, and helps us deliver quality releases. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=o5ZvVfwe</a><p>* Windows QA Engineer: Splunk is putting a lot of effort into making Splunk &#38; Windows to be a match made in heaven. We need people to help us make sure we're getting everything quite, because details matter. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=oLpdWfw3\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=oLpdWfw3</a><p>* Server Sustaining Engineer: Splunk is a very customer-focused company, and it's important that customers are happy with the products. The sustaining team is in charge of making sure that after major releases, we can keep customers happy for a long time. <a href=\"http://www.splunk.com/view/SP-CAAAGK3?jvi=obAdWfwE\" rel=\"nofollow\">http://www.splunk.com/view/SP-CAAAGK3?jvi=obAdWfwE</a>","time":1333997970,"type":"comment"},{"by":"RichardPrice","id":3784226,"parent":3783657,"text":"San Francisco, CA. Full time.<p>Academia.edu is a platform for academics to share research papers. The company's mission is to accelerate the world's research.<p>It's widely held that science is too closed, and too slow. We are trying to change that. We believe that faster sharing of research will lead to an acceleration in research innovation: faster innovation in medicine, biology, engineering, economics, and other fields. Faster sharing in biology and medicine, for example, could lead to cancer being solved 12 months before it otherwise would have been, which would lead to millions of lives being saved.<p>Academia.edu has over 1.1 million registered users, and over 3.5 million monthly unique visitors. Both of these metrics tripled in 2011. Over 4,500 papers are added to the platform each day, and over 3,000 academics join each day.<p>We need talented engineers to come and help us accelerate the world's research. We believe that there is a chance to make a big impact.<p>We just raised $4.5 million from Spark Capital and True Ventures <a href=\"http://news.ycombinator.com/item?id=3297812\" rel=\"nofollow\">http://news.ycombinator.com/item?id=3297812</a>. Some of our angel investors include Mark Shuttleworth (founder of Ubuntu) and Rupert Pennant-Rea (Chairman of The Economist).<p>We have a strong engineering culture. We're a 10 person team based in downtown San Francisco. The site is Rails, and other technologies we use include PostgreSQL, Redis, Varnish, Solr, Memcached, Mongodb, Beanstalkd.<p>Familiarity with our technologies is a plus, but it's not essential. It's far more important that you are a quick learner who can pick up new technologies quickly. There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>The kinds of things you would be working on include:<p>★ building new features (a conference feature, a discussion feature for papers)<p>★ enhancing existing features (News Feed, Profile page, paper upload tools)<p>★ building back-end infrastructure to scale the site<p>What we're looking for are:<p>☀ 2+ years of web development experience<p>☀ Experience with the full engineering stack<p>☀ Passion for engineering<p>All the strategic decisions in the startup are made collaboratively, whether they are about hiring, new feature development, user growth, user retention, funding, or revenue. You can participate in those general startup decisions as much or as little as you want. We have found that our decisions are much better as a result of everyone contributing to them. If you like having an impact, you will enjoy the Academia.edu culture. There is more information here <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http://academia.edu/hiring</a>.<p>H1B candidates are very welcome. We will take care of the visa process.<p>If you are interested to learn more, please email Richard Price at richard [at] academia.edu","time":1333299476,"type":"comment"},{"by":"windsurfer","id":3784033,"parent":3783657,"text":"Any Canadians?","time":1333296494,"type":"comment"},{"by":"pabloest","id":3795643,"parent":3783657,"text":"San Francisco, CA<p>Meraki - <a href=\"http://www.meraki.com\" rel=\"nofollow\">http://www.meraki.com</a><p>Meraki is the leader in cloud networking and we have over 18,000 customer networks around the world. You can see a sample of customers who rely on Meraki at: <a href=\"http://www.meraki.com/customers\" rel=\"nofollow\">http://www.meraki.com/customers</a>. We were funded by Sequoia and Google, and are based in the Mission district of San Francisco - yes, it's sunny here!<p>Our cloud infrastructure has been developed from the ground up, and we pride ourselves in its reliability, resilience, and performance (we have a 99.99% uptime SLA). Our wireless access points and routers make network management simple, and our relentless focus on user experience delights our customers.<p>We’re looking to hire in San Francisco and we have a few positions open in London as noted.<p>// Engineering<p>On the front-end, distributed web application lets network administrators quickly sift through historical data, perform diagnostics, and navigate a huge space of possible network configurations through an intuitive interface. Our multi-site, hosted backend system provides services thousands of networks and millions of client devices. Your work will be widely deployed and used by millions of people, and you’ll be able to collect an incredible amount of data about how your code is performing. Our team is small enough that you will work on problems core to our business.<p>* Front-end: sharp and creative UI engineers who love to work with Javascript, CSS, and Ruby on Rails.\n<a href=\"http://www.meraki.com/company/jobs#frontendengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#frontendengineer</a><p>* Back-End Systems: familiarity with C++, Ruby or Python, an understanding of databases, and especially experience running a live service or building production systems.\n<a href=\"http://www.meraki.com/company/jobs#backendsystemsengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#backendsystemsengineer</a><p>* Firmware: fluent in C, some device driver experience, with a love for building new products and things like bringing up new platforms.\n<a href=\"http://www.meraki.com/company/jobs#firmwareengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#firmwareengineer</a><p>// Marketing<p>* Technical Marketing Manager: excellent analytical and communication skills, a solid technical background, and the skill to tackle a wide variety of activities, such as launching new products, providing technical education to customers and partners, building collateral and competitive positioning to assist Meraki's rapidly growing sales team, and more.\n<a href=\"http://www.meraki.com/company/jobs#technicalmarketingmanager\" rel=\"nofollow\">http://www.meraki.com/company/jobs#technicalmarketingmanager</a><p>* Frontend Developer: expert level command of HTML and CSS with strong Javascript skills, knowledge of a scripting language, familiarity with back-end application concepts and a strong design aesthetic. (B.S. degree in computer science or equivalent)\n<a href=\"http://www.meraki.com/company/jobs#frontenddeveloper\" rel=\"nofollow\">http://www.meraki.com/company/jobs#frontenddeveloper</a><p>// Support<p>* Technical Support Engineer: sharp, energetic, technical support engineer who can work closely with many groups within the company, including engineering, to diagnose and resolve critical escalated issues, identify, reproduce, and document bugs.\n<a href=\"http://www.meraki.com/company/jobs#technicalsupportengineer\" rel=\"nofollow\">http://www.meraki.com/company/jobs#technicalsupportengineer</a><p>// Sales<p>We have many openings for sales positions, including inside sales, regional sales, sales engineers, and strategic sales.<p>Interested? Feel free to get in touch with me: pablo@meraki.com","time":1333501067,"type":"comment"},{"by":"Peek","id":3790006,"parent":3783657,"text":"Peek (www.peek.ly) - Manhattan, NY (interns, part-time, full-time, H1B welcome)<p>Peek wants to make the Internet and data available globally via mobile devices. We want people in the most remote regions of the world to obtain $50 or even $25 devices to communicate and collect the data they need. This means that we need to make software that is affordable and uses as little data as possible. But is still incredibly powerful! It's a big challenge.<p>At Peek we are looking for software engineers who have a passion for the startup environment, and who want to develop skills on new and emerging technology while learn more about what it takes to start a successful company.<p>What we're looking for?<p>1.  You love to create.  You will code and build mobile apps on the hottest mobile platform in the world (and it's not iOS or Android... hmmm), it's an SDK used in 40% of the phones in the global market (and growing 50% year over year).  You'll also work on our cloud systems, hosted in Amazon AWS and learn all about mobile to cloud applications, and handling scale on the order of millions of clients. We use C/C++, Java, .NET, Ruby, Javascript (including node.js), and many others.<p>2.  You are eager to do it all and make an impact: product and feature planning, development, project management and of course, testing (we all do it!)<p>3.  You are \"smart and gets things done\" (and can name the guy who coined that phrase)<p>4.  You want to be part of a startup - this means a very small organization with a flat hierarchy where you can communicate freely and openly.<p>What's in it for you?<p>1. A very competitive salary, great health care (incl. vision and dental), stock options, group events (like ping pong nights) and a great working environment in Manhattan, New York.<p>2. The opportunity to work on every aspect of a mobile operation, including embedded (C/C++), back-end (Java, node.js), cloud systems (EC2), and more. You'll get a chance to work on all of these systems, not just one or two.<p>3. Our founders, who have raised over $100m in capital in their careers, will show you the start-up ropes, do sessions with you, and introduce you to folks in the startup community - entrepreneurs, VCs, etc.  And when you want to start your next big startup, we'll be there to help you out.<p>Peek launched nation-wide in the US, in late 2008. Since then we’ve launched successfully across Europe and in India, and picked up many awards along the way including Time's Gadget of the Year, Wired Product of the Year, and GSMA nomination for Best Cloud Technology. Peek is backed by top-tier venture capital firms RRE Ventures and L Capital, and led by the founder of Virgin Mobile USA (IPO 2007; acquired by Sprint).<p>Send us an email to jobs@peek.ly","time":1333399761,"type":"comment"},{"by":"archonsystems","id":3788319,"parent":3783657,"text":"We're a fast-paced, creative, software startup team working on an exciting new web app (tell you more about that in person).<p>Unlike most startups that starts with nothing, we're proven and profitable. We have already developed a product, inFlow Inventory, for small businesses that's #1 in its class with 300,000+ installs in 60 countries. But the new product that we are making is even more exciting!<p>We're looking for world-class talents to join us, kick ass, and have fun here in beautiful Toronto, Canada.<p>Check us out at <a href=\"http://www.archonsystems.com\" rel=\"nofollow\">http://www.archonsystems.com</a>!<p>Some of our job benefits:<p>* top market salary: our target is better than 75% of comparable companies<p>* stock options<p>* work from home at least 2 days a week ; flexible office hours<p>* all-expenses-paid conferences<p>* 50% subsidized gym memberships and school courses<p>* top-notch computers ; beautiful office ; awesome people to work with<p>* make a difference: you'll be the first 10 members of a rapidly growing startup<p>A sample of our other members background:<p>* ex Googler @ Silicon Valley who previously graduated #1 in U Waterloo math faculty<p>* ex developer and designer for Mozilla (organization that made Firefox)<p>* ex lead developer of another web 2.0 company<p>* ex marketer who won international marketing competition twice, beating out Fortune 500 companies<p>* and other great people!<p>===============================================<p>WEB APPLICATION DEVELOPER @ Toronto (rails with backbone)<p>===============================================<p>As our Web Developer, you will be working on our new Secret Stealth Project. You will be responsible for programming in an entire feature from front-end to back-end. You will also focus on getting the usability and look &#38; feel <i>right</i> in order for our users to have the best experience possible.<p>You should have:<p>* Ability to complete an entire feature from HTML/CSS/JS to RoR to SQL<p>* Care deeply about UI (both usability and look &#38; feel)<p>* Serious skills with HTML / CSS / Javascript<p>* Hands-on experience with Ruby on Rails and SQL<p>* 1+ year of software development experience<p>* Bachelor degree or higher<p>Nice to have (but not necessary):<p>* HTML5, SCSS<p>* jQuery, jQUI, Backbone, CoffeeScript<p>* MySQL<p>* web/graphic design<p>Other stuff we'd be happy to hear about:<p>* Experience with business systems (accounting, inventory, CRM, etc.)<p>* Experience designing and building web applications (not just websites)<p>* Experience with social media (blogging, Twitter, hardcore Facebooking)<p>* Open-source or recreational coding projects<p>Email us your resume at jobs@archonsystems.com!","time":1333377619,"type":"comment"},{"by":"dabent","id":3785688,"parent":3783657,"text":"Santa Monica, CA (Los Angeles area) also possibly SF Bay area or other cities, but most jobs are in Santa Monica.<p>TRUECar - Put simply, TrueCar shows consumers how much people actually paid for a particular new car in their area, then guide them to dealers we've certified.  We bring transparency to auto pricing and so far we are getting a solid piece of a huge market.<p>* Java - We are looking for talented Java architects to design and build the technology used to power our production websites, APIs, widgets, and internal tools.  This is a chance for you to join a growing company and build something that's going to need to scale to support millions of users/visitors and provide them with all kinds of data.<p>* Data Analyst - Will work on data management and ensure robust pipelines implemented for a diverse range of analytical products.  You will be utilizing the latest technologies to solve challenging problems and create innovative applications from the ground up.<p>* Data Warehouse Developer - We are looking for a super smart and detail-oriented SQL Database Developer who will support the ETL and Data Modeling processes which feed our data warehouse and MicroStrategy environment.<p>* Senior Designer - Works closely with the Creative Director, VP Product, and Chief Product Officer to provide high-level front-end design in the development of key TrueCar products. This position rapidly visualizes information presentation for the web (and portable devices) and turns that vision into static/functional prototypes. The Designer serves as a member of core product team supporting front-end developers and product owners.<p>* Senior Linux Systems Engineer - Will be involved from the design stage through production troubleshooting, from DNS to networking to application behavior and ultimately responsible for making sure our production systems are reliable and perform well.<p>* Statistician/Data Mining Specialist - Masters or Ph.D. in Statistics, Econometrics, Operations Research, Data Mining, or Biostatistics who will work on a wide range of projects from transaction price modeling, forecasting, to multivariate testing and marketing analytics, utilize the latest technologies to solve challenging problems, create innovative applications from the ground up and understand exactly what it takes to create a reliable Web experience for our customers.<p>* Software QA Engineer - We need a well-rounded QA Engineer.  This person will design and execute tests for web services and applications and then help us automate those cases.<p>We've also got non-technical positions for a Director of Customer Relations (in Austin, TX), Area Sales Managers in multiple cities, and a Senior Accountant.<p>As I mentioned, we just hired an excellent front-end developer from the \"Who's Hiring\" thread a couple months back.  He's loving it here as much as I am.<p>Many of the tech team is an open workspace that has a view of the ocean (<a href=\"http://picplz.com/user/dabent/pic/tpc4v/\" rel=\"nofollow\">http://picplz.com/user/dabent/pic/tpc4v/</a>), and all the Santa Monica offices are blocks from the beach.  They have great benefits, amazing team solving hard problems and a company that's well-funded and earning revenue.<p>If you're interested, send me your resume.  My email is in my profile.","time":1333328507,"type":"comment"},{"by":"tommizzle","dead":true,"id":3787495,"parent":3783657,"text":"SimplyBusiness<p>FULL TIME (London)<p>Front End Dev, Senior Java Dev, Senior Ruby Dev<p><a href=\"http://www.simplybusiness.co.uk/about-us/careers/\" rel=\"nofollow\">http://www.simplybusiness.co.uk/about-us/careers/</a><p>Our business is now at an exciting new stage of its life, as it looks to increase its rate of customer growth further, build a strong recognisable brand profile, and develop a comprehensive customer contact strategy to deliver incremental revenue from its growing customer base.<p>We are building an innovative and dynamic culture around Agile. Our view and culture is web, not insurance. You will take part in shaping the future direction of this business from both a technology and cultural perspective, while helping to architect, design and refactor our systems.<p>The company has a dynamic team of 50 people in London and a passionate customer care team of 100 based in Northampton.<p>Salary is commensurate with experience. Excellent flexible benefits package including private health insurance, life assurance and season ticket loan.<p>Email careers [at] simplybusiness.co.uk with your CV/Resume and an explanation as to why you'd want to work here. Make sure you mention HN in your email!","time":1333365901,"type":"comment"},{"by":"TimothyFitz","dead":true,"id":3783852,"parent":3783657,"text":"New York, NY - Software Engineer - Fulltime<p>Canvas (USV Funded) is looking for engineers #3 and #4 to join a small close team building the rich-media community platform of the future.<p>The job title says \"Software Engineer\" but really we're looking for \"Software Entrepreneur\" or a \"Startup Engineer\".<p>Yes, your day job will be writing code. But that's the only similarity to a big company software job.<p>You'll be challenged to take big ideas and turn them into concrete testable hypotheses. Shipping a great feature is important, but positively changing user behavior is the ultimate success criteria. Built-to-spec takes a backseat to moves-the-metrics.<p>More details and how to apply <a href=\"http://canv.as/jobs\" rel=\"nofollow\">http://canv.as/jobs</a>","time":1333293022,"type":"comment"},{"by":"willf","dead":true,"id":3784038,"parent":3783657,"text":"Wordnik is looking for a Machine Learning expert, especially those with an interest and with skills in large text processing, to join the team working on both acquisition of lexical information as well as classification and ranking problems. You can write me directly at will@wordnik.com.","time":1333296545,"type":"comment"},{"by":"psota","dead":true,"id":3790272,"parent":3783657,"text":"Cambridge, MA Panjiva (<a href=\"http://panjiva.com\" rel=\"nofollow\">http://panjiva.com</a>) Hiring engineers--UI/UX, frontend, backend data mining/algorithms. See <a href=\"http://panjiva.com/jobs\" rel=\"nofollow\">http://panjiva.com/jobs</a>","time":1333403647,"type":"comment"},{"by":"rmanalan","dead":true,"id":3783928,"parent":3783657,"text":"San Francisco and Sydney, Australia<p>Atlassian is looking for kickass JavaScript developers <a href=\"http://bit.ly/jsconf2012\" rel=\"nofollow\">http://bit.ly/jsconf2012</a>","time":1333294544,"type":"comment"}]}