{"comments":[{"by":"joelg87","id":4993197,"kids":[4993404,4995656],"parent":4992617,"text":"Buffer (<a href=\"http://bufferapp.com\" rel=\"nofollow\">http://bufferapp.com</a>) - Anywhere in the world (we're a distributed team)<p>I hope you are having a fantastic day. Happy new year :-)<p>I'd love for you to come join Buffer for the fun ride. We're a small team of 7, we have 450,000 users and are about to hit a $1M annual revenue run rate. There are some super interesting challenges ahead and just around the corner we're expecting even faster growth through our mobile efforts.<p>2 key areas we're looking for help with:<p><pre><code>    - JavaScript (+HTML5, CSS, Backbone.js) to lead our webapp \n      and browser extension development\n    - DevOps (we're PHP/MongoDB on AWS Elastic Beanstalk, and it's\n      been put together by a couple of full stack hackers so there\n      will be a lot that could be improved!)\n</code></pre>\nIf you're interested in coming on board, you will:<p><pre><code>    - work primarily with myself and my co-founders Leo and Tom\n    - be a happy, positive-minded and kind person who has a great\n      approach in dealing with others\n    - be a Buffer user (would be awesome, it’s cool if not)\n    - be friendly and comfortable helping our users\n    - be anywhere in the world, and if you'd like, you have help and\n      support from us to move to where you want to be\n    - have experience working with another startup before (would\n      be awesome, it’s cool if not)\n</code></pre>\nYou’ll be amongst people who are striving for success and pushing themselves forward each and every day. Everyone here seems to progress at an incredible pace, we want to do everything to make that happen for you as well. Whether you want to start speaking, blogging, learning marketing or have other areas of personal growth, you’ll have my personal support and the whole team as a resource too.<p>Great salary and equity - $85k-$140k, 0.5-1.5%.<p>If this sounds fun, let's have a chat. I'm looking forward to it! I'm Joel, drop me an email directly - joel@bufferapp.com.","time":1357062071,"type":"comment"},{"by":"dubisaweapon","id":4992667,"kids":[4993641],"parent":4992617,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B\nDid you know there's a company based in New York City that has enough technology to be considered among the world's Top 250 supercomputing sites? One that imports over 5TB of data every single day, and has alumni from Google, Intel, and Microsoft?<p>You might think I'm talking about some stealth-mode startup, but I'm talking about where I work: Two Sigma Investments. At our core, we're a technology company applying our talents to the domain of finance. We've created a system that combines artificial intelligence and keen human insight — a system that's constantly improving and advancing.\nWe're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology. We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you!<p>Dave Hahn dave.hahn@twosigma.com <a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1357052121,"type":"comment"},{"by":"malandrew","id":4993645,"parent":4992617,"text":"San Francisco, Full-time. No remote work.<p>famo.us - we are the company making HTML5 web apps performant. Go to <a href=\"http://famo.us/\" rel=\"nofollow\">http://famo.us/</a> in a modern browser on desktop and mobile devices to try out our stress test demo built on our JavaScript engine.<p>We are all engineers. Our CEO, Steve Newcomb, is a founder and the former CEO of Powerset (which became Microsoft Bing). Om Malik recently called us his current favorite startup: <a href=\"https://twitter.com/om/status/273081831014952961\" rel=\"nofollow\">https://twitter.com/om/status/273081831014952961</a><p>All positions, except PR/Marketing require very solid HTML, CSS and JavaScript experience, but even for that position it is a huge plus. We're looking for:<p><pre><code>  Senior front-end engineer                $100k—$175k  0.25—1.0%\n  Mid front-end engineer                    $90k—$125k   0.1—0.5%\n  Junior front-end engineer                 $75k—$100k  0.1—0.25%\n  Famo.us Template Design Engineer          $90k—$150k   0.1—0.5%\n  3D and/or Physics Game Engine Engineer   $100k—$175k  0.25—1.0%\n  Documentation Writer                      $75k—$125k   0.1—0.3%\n  PR/Marketing/Social Media                  $60k—$90k   0.1—0.5%\n</code></pre>\nIf you don't know JavaScript like the back of your hand, but are an excellent polyglot programmer that believes web apps are the future and you have skills that you believe would be valuable to us, please apply.<p>Our new office will be at 3rd and King St in SoMa, right across the street from AT&#38;T park and one block from the CalTrain station.<p>Please read Steve's essay \"Cult Creation\" if you are serious about applying: <a href=\"http://blognewcomb.squarespace.com/essays/2010/10/14/cult-creation.html\" rel=\"nofollow\">http://blognewcomb.squarespace.com/essays/2010/10/14/cult-cr...</a><p>Apply via AngelList: <a href=\"https://angel.co/famo-us#recruiting\" rel=\"nofollow\">https://angel.co/famo-us#recruiting</a>\nIf you have any questions, email me at andrew+jobs@famo.us","time":1357069206,"type":"comment"},{"by":"Flemlord","id":4993031,"parent":4992617,"text":"FinFolio - C#/WPF, HTML/JavaScript - Denver Tech Center - Local Only<p>I'm a serial entrepreneur in the financial services space and FinFolio is my 3rd company. We're always looking for skilled Microsoft-stack developers, both entry-level and advanced positions.<p>About us:<p>FinFolio is a boutique technology company that makes software for professional financial advisers. Expert skills in C# and related technologies are needed and past experience in finance would be a big plus . We're seeking long-term employees who want to help grow our company over a period of years.<p>Our development environment uses the Microsoft technology stack (C#, WPF, WCF, nHibernate, SQL). You will be responsible for assisting in the development of our flagship WPF product, as well as leading the way in new product development (SharePoint, WinRT, iOS). We expect you to take ownership of the product(s) and care about them as much as you care about being a great developer.<p>The environment is loose and agile; we are constantly refactoring and are big believers in test driven development. You will have interaction with other developers, members of the support team and our founder/CEO who also writes code.<p>For more info:<p><a href=\"http://www.finfolio.com/Pages/Careers.aspx\" rel=\"nofollow\">http://www.finfolio.com/Pages/Careers.aspx</a><p>Please submit a cover letter indicating position applied for, resume, and salary requirements to careers@finfolio.com. No recruiters please.","time":1357059567,"type":"comment"},{"by":"spicyj","id":4993263,"parent":4992617,"text":"Khan Academy<p>Mountain View, CA - full-time and intern, designers and devs<p>We're a non-profit whose mission is to provide a world-class education to anyone, anywhere. We're scaling quickly. Our students answer over 2 million math problems per day (over 900mm total so far), all generated by our open source exercise generation framework (<a href=\"https://github.com/Khan/khan-exercises\" rel=\"nofollow\">https://github.com/Khan/khan-exercises</a>), and our videos (now from a variety of authors including Sal) have been viewed over 220mm times. We're tracking all that data and using it to customize each student's experience as well as building brand-new tools like our new programming environment (<a href=\"http://ejohn.org/blog/introducing-khan-cs/\" rel=\"nofollow\">http://ejohn.org/blog/introducing-khan-cs/</a>).<p>We could use your help. Working for Khan Academy is one of the highest educational impact positions you can imagine, and we've been called by Wired one of the best places to work in Silicon Valley: <a href=\"http://news.ycombinator.com/item?id=4157078\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4157078</a>.<p>We're hiring designers and all types of devs -- mobile, frontend, backend, data scientist, whatever you want to call yourself. Though it's less likely to fit with the HN crowd, we're also looking for an operations assistant, someone to join our team that works with schools, and contractors to create math content for the site.<p>Big plans ahead.<p><a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https://www.khanacademy.org/careers</a>","time":1357063430,"type":"comment"},{"by":"kstenerud","id":4993040,"kids":[4996255,4993096],"parent":4992617,"text":"San Francisco, CA (full-time, intern, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>-------------------------------------------------------<p>We build wonderful educational games in San Francisco. If you are nice and want to help us make splendid products, we'd love to hear from you.<p>Voted Educational App of the Year by Apple. Funded by Sequoia Capital<p>We're hiring in lots of areas! Here are a few:<p>-------------------------------------------------------<p>* Backend engineer - <a href=\"http://mindsnacks.theresumator.com/apply/zmC1GW/Backend-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/zmC1GW/Backend-Engi...</a><p>* Mobile engineer (Android or iOS) - <a href=\"http://mindsnacks.theresumator.com/apply/5t4zzv/Mobile-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/5t4zzv/Mobile-Engin...</a><p>* Generalist engineer - <a href=\"http://mindsnacks.theresumator.com/apply/cj0OWK/Generalist-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/cj0OWK/Generalist-E...</a><p>* QA lead - <a href=\"http://mindsnacks.theresumator.com/apply/0tGRiZ/QA-Lead.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/0tGRiZ/QA-Lead.html</a><p>-------------------------------------------------------<p>For more info, visit <a href=\"http://www.mindsnacks.com/careers\" rel=\"nofollow\">http://www.mindsnacks.com/careers</a> or email us at jobs@mindsnacks.com","time":1357059712,"type":"comment"},{"by":"jrkelly","id":4993850,"kids":[4999744],"parent":4992617,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology.<p>Ginkgo BioWorks is a well-funded MIT spinout that genetically engineers organisms that make the world better. Stop building apps and work on something that matters: <a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a><p>apply here: <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1357072215,"type":"comment"},{"by":"trefn","id":4992873,"parent":4992617,"text":"San Francisco, CA<p>Mixpanel (YCS09; <a href=\"http://mixpanel.com\" rel=\"nofollow\">http://mixpanel.com</a>) is the most advanced advanced analytics platform available for web &#38; mobile applications. We're making millions in revenue, we're profitable, and we're backed by Andreessen Horowitz, Sequoia Capital, Max Levchin, etc.<p>INTERN<p>We're looking for engineering interns for the summer (and the fall, winter, and next summer... we really like interns).<p>Interns here work on very real projects - a few examples from this summer are:<p><pre><code>  * A CRM for the sales/support teams, built on top of our custom datastore\n  * Android/iOS push notification infrastructure\n  * Advanced query optimizations for the aforementioned datastore\n</code></pre>\nYou will learn more with us than you will almost anywhere else.<p>FULLTIME<p>We're hiring for a number of positions (engineering, sales, admin, and more), but I'd like to highlight a few:<p>1. Solutions Architect - hybrid support/sales/marketing/engineering role. Really awesome for developers who want to do more client-facing stuff. See <a href=\"http://mixpanel.theresumator.com/apply/Eoh3qJ/Solutions-Architect.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/Eoh3qJ/Solutions-Arch...</a><p>2. Product Engineer - work on building the parts that people interact with (from APIs through HTML/CSS). Mostly Javascript and Python. <a href=\"http://mixpanel.theresumator.com/apply/rhQrIj/Software-Engineer-Frontend.html\" rel=\"nofollow\">http://mixpanel.theresumator.com/apply/rhQrIj/Software-Engin...</a><p>3. Office manager - looking for someone super smart &#38; organized to keep the wheels greased around here. No job post yet, but you can email me directly.<p>If you're interested, please email me - tim@mixpanel.com.","time":1357056378,"type":"comment"},{"by":"bjornsing","id":4993306,"parent":4992617,"text":"Anyfi Networks (<a href=\"http://www.anyfinetworks.com\" rel=\"nofollow\">http://www.anyfinetworks.com</a>) - Malmö, Sweden (H1B equivalent can be arranged)<p>We are looking for an embedded software engineer with C and Linux experience to join our engineering team. You will work alongside capable engineers to develop a 4G radio access technology with a disruptive price/performance ratio (see <a href=\"http://anyfi.net/documentation\" rel=\"nofollow\">http://anyfi.net/documentation</a> for more info). If you’re up to it you’ll also have the opportunity to travel the world and integrate the software you’ve developed in Wi-Fi routers and residential gateways from leading vendors.<p>Linux and C experience is a must. Internet Protocol and Wi-Fi driver experience is nice to have. We would typically expect a candidate to have an M.Sc. in Computer Science or equivalent and 2+ years working experience.<p>Please send you application to jobs@anyfinetworks.com. We're hackers so if you want to impress us tell us about something you've built.","time":1357063894,"type":"comment"},{"by":"carlio","id":4992771,"kids":[5037940],"parent":4992617,"text":"LaterPay - Munich, Germany - remote and relocation help possible<p>Django Developer, Python Developer<p>LaterPay is a startup looking to change the way we pay for content online. The idea is micropayments, but the twist is that you pay after you accumulate €5, rather than paying into a 'wallet' up front.<p>We have a couple of positions open for python developers, and as we are still very small, those positions have a lot of scope for responsibility and choosing your own focus. We have a lot of Django work, so there's also a possibility to join as a Django specialist, especially if you also grok HTML/CSS/JavaScript. Other technologies we use include Tornado, Cassandra, Redis, and our code lives on github. Experience with these is a bonus but not necessary!<p>If you are interested, drop us an email with a resume and some code to look at - jobs@laterpay.net","time":1357054374,"type":"comment"},{"by":"arohner","id":4993738,"parent":4992617,"text":"SF or REMOTE fulltime (near pacific time)\nCircleCI: designers, frontend, backend engineers.<p>At CircleCI (<a href=\"https://circleci.com\" rel=\"nofollow\">https://circleci.com</a>), we're building Heroku for Continuous Integration. We have traction and revenue. Our customers love us, because we move quickly and provide amazing support. All employees talk to customers and are on support rotation.<p>We eat our own dogfood, DevOps, A/B test, do Continuous Deployment and Customer Development.<p>We're looking for: designers that can write HTML &#38; CSS, Frontend Engineers and Backend Engineers.<p>We're still a small team, so you'll have a large impact on company culture. We're highly influenced by Valve's Employee handbook. SF-local employees have catered lunch every day.<p>The frontend is a fat javascript client, using HamlCoffee, Less and Knockout. We have a lot of interesting design and data-visualization problems that need to be solved, as well as A/B testing, landing page creation and optimization.<p>The backend is written in Clojure. Backend engineers should know Clojure or another 'weird' language (Haskell, Scala, Scheme, etc), and Linux Devops (C compilation model, make, packaging).<p>Contact us at jobs@circleci.com. Include samples of awesome stuff you've done.","time":1357070542,"type":"comment"},{"by":"joshyeager","id":4992644,"parent":4992617,"text":"Swift Software - Frederick, MD (Near DC) - Software Engineers<p>Are you tired of commuting to DC or Northern Virginia? Swift Software is a growing product-centered technology company seeking talented developers to join our product team in Frederick, MD. Our flagship product is JobTraQ, a task management and workflow system that offers vastly more flexibility and power than any other product in our market segment, and is significantly less expensive and easier to configure than big \"BPM\" suites like MetaStorm and Lombardi. These advantages are allowing us to disrupt both markets.<p>Product developers will create new features in JobTraQ and enhance existing functionality. You’ll help us build advanced visual design and administration tools, augment the product's business intelligence capabilities, improve performance and scalability, and use customer feedback to enhance all parts of the system.<p>Our team has an enjoyable and collaborative culture in a creative environment. We interact positively and openly and emphasize learning and professional development. These attributes have enabled us to produce an industry-leading product with a globally recognizable and satisfied client base. Our environment is relaxed and fun, we play everything from Total Annihilation to Alien Swarm at our game nights, and we equip everyone with new quad-core Thinkpads with SSDs and dual monitors. Our policies and benefits are family-friendly, with generous vacation time, good health insurance options, and flexible work schedules.<p>For more information about this position, see the link below. If you are interested, please email your resume to resumes@swiftsoftware.com.<p><a href=\"http://www.jobtraq.com/jobs/se227-software-engineer-product-development.html\" rel=\"nofollow\">http://www.jobtraq.com/jobs/se227-software-engineer-product-...</a>","time":1357051504,"type":"comment"},{"by":"nav","id":4992867,"kids":[4998139],"parent":4992617,"text":"Sd - Subtle Disruption | New Delhi / Remote<p>At Sd we are designers, engineers and aesthetes working on products aimed at uncovering latent needs and desires. We aspire to develop a model that sits at the intersection of disciplines and brings together great people from all over to build interesting companies. We believe innovation often charts its own path and we thus adjust ourselves accordingly by being experimental and lean in our approach.<p>Our ideas seem not bound by verticals or geographies. We are light–packers, risk takers and tend to be driven a bit differently. We are made up of not employees, rather co–founder caliber individuals. We are school, degree and work experience agnostic. What is important to us is: integrity, energy/personality and intelligence (in that order) to apply please visit <a href=\"http://subtledisruption.com\" rel=\"nofollow\">http://subtledisruption.com</a> . You can also follow us at <a href=\"http://twitter.com/sdisruption\" rel=\"nofollow\">http://twitter.com/sdisruption</a><p>Wishing the HNews community a very happy and prosperous 2013!","time":1357056287,"type":"comment"},{"by":"szilveszter","id":4993720,"parent":4992617,"text":"Prezi - <a href=\"http://prezi.com/\" rel=\"nofollow\">http://prezi.com/</a> - San Francisco, CA (full-time, but we're open for interns as well)<p>We are looking for a backend and a frontend engineer. We have just started to build our engineering team focusing on growth, marketing and business development efforts in our San Francisco office (product development is in our other office in Budapest, Hungary with about 40 engineers).<p>Some exciting tasks ahead: build quick prototypes that drive growth; high performance web development (both from a backend and frontend perspective); backend systems for marketing campaigns (and their respective frontend work of course); content management system on our main website; integration with 3rd party providers (e.g. Salesforce).<p>About our technology stack: we primarily use Python/Django in the backend, but we also have Scala and Haskell in production. Frontend is LESS (built on top of Bootstrap), and JavaScript (jQuery) with some CoffeeScript.<p>Why Prezi? We are a profitable (but also well-funded) company that's been around for more than 4 years now, with more than 18 million registered users. We have 100 employees, but the SF office is still pretty small (20 people). We don't track holidays, benefits include health, dental and vision. You get to travel to Budapest, Hungary at least twice a year, a city well-known for its baths and ruin pubs. You have extra budget for personal improvement (books, conferences, etc.)<p>Application form: <a href=\"https://hire.jobvite.com/Jobvite/Apply.aspx?b=nu7Ahjwg&#38;j=oIK4Vfwb\" rel=\"nofollow\">https://hire.jobvite.com/Jobvite/Apply.aspx?b=nu7Ahjwg&#38;j...</a><p>See <a href=\"http://prezi.com/jobs/\" rel=\"nofollow\">http://prezi.com/jobs/</a> for more info and other open positions.<p>If you have any questions, feel free to contact me: szilveszter@prezi.com","time":1357070293,"type":"comment"},{"by":"eisokant","id":4993432,"kids":[4994399,5017981],"parent":4992617,"text":"Madrid, Spain\nFull-time in Madrid<p>Looking For Brilliant &#38; Passionate Web Developers<p>Tyba (<a href=\"http://tyba.com\" rel=\"nofollow\">http://tyba.com</a>) is giving junior talent a professional identity and changing the way companies recruit.\nWe have as a mission to advance the careers of young professionals.\nIf you’re looking for an international team that thrives in a startup culture, we’re the place to be!<p>We can only consider candidates who are allowed to work in the European Union.<p>We offer a challenging environment where you can develop your skills and build a product which people use and enjoy!<p>What technologies do we use?<p>PHP, Javascript, jQuery, MySQL, Nginx, Varnish, Amazon EC2, RDS, Cloudfront &#38; S3, and some other cool technologies.<p>You need to have:<p>* Strong learning and problem solving skills\n* Passion and enthusiasm about new technologies\n* Creativity and initiative\n* Empathy and ability to understand users’ needs\n* Good English level<p>Things that are a plus:<p>* Developing projects on your own\n* Contributing to open-source projects\n* Integration with Facebook and Google APIs\n* Experience with AWS\n* Working with git(hub)<p>We offer:<p>* Work in a dynamic environment with young talented people\n* Room to learn new technologies and skill sets\n* Building a product that impacts the careers of our users\n* A chance to live in one of Europe’s most vibrant cities<p>Who we are looking for?<p>We have several positions open so we are recruiting from experienced developers all the way to high-potential individuals with little experience. What all candidates will have in common is a passion for software development and a strong appreciation of the importance of the user experience. You have to be able to learn quickly, communicate well and co-operate effectively in a team.<p>Our team is international!<p>We are 8 nationalities but use English as our working language. You should be able to write and speak to a level where you can communicate clearly, but fluency is not a requirement.  Knowledge of Spanish is not a requirement.<p>Email us: contact@tyba.com","time":1357065764,"type":"comment"},{"by":"mattsears","id":4992666,"kids":[4992744],"parent":4992617,"text":"Littlelines, Ohio<p>Littlelines is looking for Ruby / Rails developers to work with us at our headquarters in Ohio.<p>You'll have the opportunity to learn, hone your skills and contribute valuable work to real projects. We're an energetic and talented team of designers and developers that love building successful web apps that people will enjoy.<p>For more information about this position, see our job post on Authentic Jobs:<p><a href=\"http://www.authenticjobs.com/jobs/15286/ruby-rails-developer\" rel=\"nofollow\">http://www.authenticjobs.com/jobs/15286/ruby-rails-developer</a><p>If you are interested, please email us at jobs@littlelines.com.","time":1357052108,"type":"comment"},{"by":"kylered","id":4992741,"parent":4992617,"text":"VividCortex, Charlottesville, VA (global workforce) - Hiring Front End Developer (salary + options)<p>We are building a SaaS Platform for systems administration. We are initially focusing on MySQL administration, as we have years of experience building leading tools for the industry. Our beta clients are very well-known, leading tech firms that use MySQL. Our team has years of experience building web applications and with high performance MySQL management.<p>We are also building a killer UI that will be the primary value for our customers. You'll be focusing on making that UI a reality. Ideally, you have expertise in modern web application development including JavaScript frameworks, building responsive designs for mobile/desktop, API client development, MySQL, and the Symfony2 PHP framework. It wouldn't hurt to be a good sysadmin, good with The Cloud, have some other devopsy buzzwords thrown in too... you get the idea.<p>If interested, email stuff to jobs@vividcortex.com . We are fun! ;)","time":1357053797,"type":"comment"},{"by":"ashearer","id":4992832,"parent":4992617,"text":"Providence, RI (full-time or intern) or remote (part-time)<p>Care Thread (<a href=\"http://www.carethread.com\" rel=\"nofollow\">http://www.carethread.com</a>) provides secure mobile messaging and team-based collaboration solutions for healthcare providers in hospitals. Care Thread's mobile and web apps deliver real-time information detailing patient status and treatment to every member of the care team, addressing communication gaps to eliminate unnecessary costs and reduce medical errors.<p>Our products are built around a real-time messaging and notification framework, using tools including node.js, Python, CoffeeScript, RabbitMQ, and PostgreSQL.<p>We're looking to expand our team by adding web front-end developers, mobile developers for iOS and Android, and back-end developers, as well as a system administrator who's comfortable with PostgreSQL databases, Amazon Virtual Private Cloud, and VPNs.<p>If you'd like to build the next generation of healthcare software, please contact us at jobs@carethread.com.","time":1357055666,"type":"comment"},{"by":"nathanhammond","id":4995134,"parent":4992617,"text":"Ally Financial (<a href=\"http://www.ally.com\" rel=\"nofollow\">http://www.ally.com</a>)\nCharlotte, NC (Full time, on-site, relocation possibly available)<p>Our current online banking platforms are hosted third-party solutions. We're building it in-house from scratch to be an API-driven JS MVC (Ember) application for cross-platform (including web) deployment.<p>This is where you come in: we're looking for a few developers who want to be a part of building something right the first time. The team building this is currently just me and two other people. We'll be building everything forward of API consumption (UI dev, testing, &#38; deployment across any imaginable platform). We'll be working with Swagger, HTML/Handlebars, CSS/Compass/SCSS, JS, Ember, PhoneGap, Chef, Selenium, Mixpanel, Optimizely, and/or whatever other tools are right for the job (little is set in stone, we're in the prototype phase of the project).<p>If you're interested, get in touch!\nnathan.hammond@ally.com","time":1357096608,"type":"comment"},{"by":"vide0star","id":4994190,"parent":4992617,"text":"Smarkets, London, Software Engineer, Python &#38; Erlang<p>Smarkets is disrupting the global betting industry by offering a modern betting exchange with significantly lower transaction fees than the competition. We're a well-funded company with a small, agile development team. We've handled over £200 million of bets since launching in 2010.<p>Our office near Old Street in London is shared with other exciting startups and has a pool table, foosball table, and fully stocked fridge.<p>We're heavily driven by user-focused design and a focus on technology and engineering as a first class discipline.<p>We write our software in Python and Erlang, and rely heavily on asynchronous programming techniques and REST. We build on a modern, open-source software stack which includes Linux, Vagrant, Flask, Eventlet, PostgreSQL, RabbitMQ, ElasticSearch, Graphite, Chef, and Git.<p>For more info: <a href=\"https://smarkets.com/about/jobs/engineering\" rel=\"nofollow\">https://smarkets.com/about/jobs/engineering</a>","time":1357077731,"type":"comment"},{"by":"kyleburton","id":4993081,"parent":4992617,"text":"Philadelphia, PA (full time)<p>Relay Network - <a href=\"http://www.relaynetwork.com/\" rel=\"nofollow\">http://www.relaynetwork.com/</a><p>-------------------------------------------------------<p>Relay is a simple and secure way for businesses and customers to instantly connect and share private communications.<p>We are looking for (multiple) full-stack engineers to join our team.  We use Clojure (no previous FP experience required, learn it working with the team), Devops (Chef) and practice Agile (weekly sprints and pair-programming).<p>-------------------------------------------------------<p>* Full Stack Engineers - <a href=\"http://www.relaynetwork.com/files/Relay_Software_Engineer.pdf\" rel=\"nofollow\">http://www.relaynetwork.com/files/Relay_Software_Engineer.pd...</a>\n* Front-End Developer - <a href=\"http://www.relaynetwork.com/files/Relay_Front_End_Developer.pdf\" rel=\"nofollow\">http://www.relaynetwork.com/files/Relay_Front_End_Developer....</a><p>For More Info, email me at kburton@relaynetwork.com","time":1357060257,"type":"comment"},{"by":"phillytom","id":4992864,"parent":4992617,"text":"Monetate - (Philly suburbs) Conshohocken, PA - No remote, but we will help you with relocation.<p>Monetate helps internet marketers make their site more relevant.  We turn data in action on our clients' sites by doing real-time data analysis and DOM modification to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>What we're looking for:<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users' problems<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on<p>* Open source - Google Closure, Python, Hadoop, Mahout, Solr and Lucene - we're open source across our stack<p>About us:<p>* Founded in 2008<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>* Funded by First Round Capital and OpenView<p>* Market rate salaries<p>We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a><p>We've hired great people from HN in the past.<p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1357056232,"type":"comment"},{"by":"lonbinder","id":4993290,"kids":[5012151],"parent":4992617,"text":"One of the best and untapped resources for jobs in NYC is the Made in NY list - <a href=\"http://nytm.org/made-in-nyc\" rel=\"nofollow\">http://nytm.org/made-in-nyc</a><p>----------------<p>We (Warby Parker) are proud to be on it! Here are some of our open roles:<p>* Principal Engineer, Computer Vision - <a href=\"http://wp.theresumator.com/apply/oPMSOg/Principal-Software-Engineer-Computer-Vision.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/oPMSOg/Principal-Software-E...</a><p>* Principal Engineer, Core Services - <a href=\"http://wp.theresumator.com/apply/FOHYC7/Principal-Software-Engineer-Core-Services.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/FOHYC7/Principal-Software-E...</a><p>* Principal Engineer, E-Commerce - <a href=\"http://wp.theresumator.com/apply/EuV9Hy/Principal-Software-Engineer-ECommerce.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/EuV9Hy/Principal-Software-E...</a><p>* Software Engineer (Senior, Mid, and Juniors) - <a href=\"http://wp.theresumator.com/apply/B4SksS/Software-Engineer.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/B4SksS/Software-Engineer.ht...</a><p>* QA Engineer (Senior, Mid, and Juniors) - <a href=\"http://wp.theresumator.com/apply/WoQFbl/Quality-Assurance-Engineer.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/WoQFbl/Quality-Assurance-En...</a><p>* Data Engineer - <a href=\"http://wp.theresumator.com/apply/M4Zd5e/Data-Business-Intelligence-Engineer.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/M4Zd5e/Data-Business-Intell...</a><p>* Systems Engineer (Senior and Mid) - <a href=\"http://wp.theresumator.com/apply/G9KyMC/Systems-Administrator.html\" rel=\"nofollow\">http://wp.theresumator.com/apply/G9KyMC/Systems-Administrato...</a><p>----------------<p>For more info and other roles, check out Warby Parker's job page:<p><a href=\"http://www.warbyparker.com/jobs\" rel=\"nofollow\">http://www.warbyparker.com/jobs</a>","time":1357063728,"type":"comment"},{"by":"jboggan","id":4993597,"parent":4992617,"text":"Factual is currently hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai.<p>Remote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our new Palo Alto office is still small, so new hires would have a huge impact on the culture there.<p>You can email me personally at jake@factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1357068456,"type":"comment"},{"by":"rgaucher","id":4993476,"parent":4992617,"text":"San Francisco, Full-time<p>At Coverity (<a href=\"http://coverity.com\" rel=\"nofollow\">http://coverity.com</a>) we are looking for a security researcher with interest in static analysis. The candidate must be a strong in websec, doesn't be afraid to write code (checker prototypes, etc.), and the best would be to have some prior knowledge in static analysis (which doesn't need to be you wrote your own static analysis tool for brainf*ck or something).\nWe have a description here on linkedin (<a href=\"http://linkd.in/VxL5bx\" rel=\"nofollow\">http://linkd.in/VxL5bx</a>) and you can apply there or just contact me directly (@rgaucher || rgaucher /at/ coverity.com). To have an idea of what we're doing, some of it is on our blog (<a href=\"https://communities.coverity.com/blogs/security\" rel=\"nofollow\">https://communities.coverity.com/blogs/security</a>).","time":1357066657,"type":"comment"},{"by":"avar","id":4992633,"kids":[5043837],"parent":4992617,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there currently working on infrastructure tasks and relocated over there about three years ago, and have been very happy with it.<p>We have people from all over the world relocating to work with us and are very well set up to handle relocation and visa issues, most of the people working in IT are expats so we've got a lot of experience with bringing people in.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline (PCLN) group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.<p>We use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it. We're also very open to open sourcing code that doesn't contain any business logic, I've personally been involved in open sourcing a few of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and a few CPAN modules.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers.<p>You don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before. The sort of people we'd like to hire are good technically, excellent at communication, and can acquire a good sense of how they fit into the big picture.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume, I've posted in a similar thread here a few times before andI've fielded a bunch of questions from would-be applicants. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent","time":1357051067,"type":"comment"},{"by":"dbattaglia","id":4992812,"parent":4992617,"text":"TMP Worldwide - New York, NY<p>We are looking for a senior developer to join the architecture team.  We get to do some pretty awesome things on this team like prototype new applications, research new technologies and develop frameworks and back-end systems used by all new TMP applications.<p>We are a .Net shop at heart, so we definitely want someone who knows C# well and has an understanding of how the CLR/.Net runtime really works.  We also use tools and frameworks like MVC4, NServiceBus, Entity FW, Backbone.js, Solr, MongoDB, SQL Server 2008/2012.<p>I'm not a recruiter or HR person, just a developer on this team trying to help find the right person to work with.  It's a great environment with a lot of really challenging fun work in the world of recruitment software.<p>If you are interested shoot me an email: Daniel.Battaglia@TMP.com","time":1357055332,"type":"comment"},{"by":"kloncks","id":4993264,"parent":4992617,"text":"- Ribbon (<a href=\"https://www.ribbon.co\" rel=\"nofollow\">https://www.ribbon.co</a>) is hiring. Full time in San Francisco. No remote. Front-end Developers, Designers, Rails Devs.<p>- Looking to add to our team of five. Ribbon is building a frictionless payments and ecommerce platform that does the transaction wherever the buyer is. Imagine purchasing an item without leaving Facebook, or buying directly from within the Twitter stream, or through email. That's what we're building for consumers, businesses and developers in an elegant way with a huge focus on design.<p>Looking for someone excited at the stage we're at<p>- dealing with first customers, ramping up traction, figuring out new product direction and features \n- and also excited about the challenges we'll face, like making payments simplified for consumers and dealing with huge technical issues with fraud and building payments infrastructure.<p>We went through AngelPad in the fall and raised a big seed round from great investors. Awesome office in San Francisco, penthouse floor with views of twin peaks and the ballpark in soma.<p>- Some recent press coverage for more details:\n<a href=\"http://techcrunch.com/2012/11/20/ribbon-a-bit-ly-with-paymen..\" rel=\"nofollow\">http://techcrunch.com/2012/11/20/ribbon-a-bit-ly-with-paymen...</a>.\n<a href=\"http://gigaom.com/2012/11/20/shopping-everywhere-ribbon-turn..\" rel=\"nofollow\">http://gigaom.com/2012/11/20/shopping-everywhere-ribbon-turn...</a>.<p>Contact james@ribbon.co if interested.","time":1357063440,"type":"comment"},{"by":"SendGrid","id":4994645,"parent":4992617,"text":"Anaheim, CA (That's right! Orange County or the OC) or Boulder/Denver, CO (full-time)<p>SendGrid <a href=\"http://www.sendgrid.com\" rel=\"nofollow\">http://www.sendgrid.com</a><p>-------------------------------------<p>We've revolutionized the cloud-based transactional email space by efficiently powering the infrastructure for tens of thousands of companies that rely on us to send millions of emails every day. We have been growing really fast since launching in 2009, and we want you to be part of the awesome company we are building.<p>-------------------------------------<p>All Jobs - <a href=\"http://sendgrid.com/careers.html\" rel=\"nofollow\">http://sendgrid.com/careers.html</a><p>Software Engineer (multiple teams) - <a href=\"http://bit.ly/TFo9IC\" rel=\"nofollow\">http://bit.ly/TFo9IC</a><p>DevOps Engineer - <a href=\"http://bit.ly/10KPjU2\" rel=\"nofollow\">http://bit.ly/10KPjU2</a><p>SDET - <a href=\"http://bit.ly/VYTxPZ\" rel=\"nofollow\">http://bit.ly/VYTxPZ</a><p>Sr. Linux Engineer - <a href=\"http://bit.ly/TFoACF\" rel=\"nofollow\">http://bit.ly/TFoACF</a><p>Software engineer - Platform - <a href=\"http://bit.ly/S3Q5Zy\" rel=\"nofollow\">http://bit.ly/S3Q5Zy</a><p>UI/UX Designer - <a href=\"http://bit.ly/Uk84YY\" rel=\"nofollow\">http://bit.ly/Uk84YY</a><p>-------------------------------------<p>PHP, Perl, Ruby, Python Twistd, Flask, Rails, MySql, Hbase, Dynamodb, Linux, SOA, Agile<p>-------------------------------------<p>If you don't see what you're looking for here, reach out to us.  We're always looking for talented, happy, hungry, honest, and humble people.","time":1357086153,"type":"comment"},{"by":"trimbo","id":4992811,"parent":4992617,"text":"Radius Intelligence, San Francisco, CA.<p>Full-time -- on-site only. INTERN and H1B welcome. Principals only please.<p>Radius Intelligence provides data and tools to help companies reach over 20 million small businesses. Consider that many companies you read about here on HackerNews need to effectively reach these companies to sell to them. Payments companies, deals companies... you get the idea.<p>The reason I joined Radius is two-fold: I want to work on products that can benefit small businesses and I like the fact that our product <i>directly</i> benefits from our work with data. We're selling the data we have with a cool web application, not using data science to get a 1% lift of clicks on the blue button.<p>So we're looking for solid software engineers to work on all sorts of problems. We have a sophisticated web application implemented in Python and Javascript and we have our back-end data processing tech which is implemented in Java with Hadoop, Hive and HBase. We have paying customers, but we're on the ground floor with both -- now is the time to join us and make a huge impact. We also need an engineer who is interested in test and performance.<p>Drop a line: jobs@radiusintel.com . Thanks.","time":1357055314,"type":"comment"},{"by":"jasonmotylinski","id":4993065,"parent":4992617,"text":"Thomson Reuters - St. Paul, MN - .Net Software Engineer / FT<p>We are a 40+ developer group working in downtown St. Paul, MN to deliver market data to customers. The larger team produces an easy to consume REST/SOAP API for customers to interface/integrate with.<p>The primary focus for this position is enhancing and maintaining a web-based document workflow and permissioning management system. The application manages the creation and approval of contracts for customers to gain access to the API. The system also integrates with other internal applications via queuing and OData APIs.<p>We are a small team of 2 looking to add a highly motivated engineer. We work in a rapid delivery product cycle. The idea person would love the latest web technologies and able to pragmatically apply them to our application.<p>Our technology stack is:\nASP .NET MVC4\njQuery/Knockout/CoffeeScript\nOData\nZeroMQ\nAutoFac<p>I am the hiring manager so feel free to contact me with any questions about the position: jason[dot]motylinski[at]thomsonreuters[dot]com<p>Official job posting:\n<a href=\"http://jobs.thomsonreuters.com/job/Senior-Software-Engineer-Job/2267909/\" rel=\"nofollow\">http://jobs.thomsonreuters.com/job/Senior-Software-Engineer-...</a>","time":1357060074,"type":"comment"},{"by":"kuang","id":4993415,"parent":4992617,"text":"Berkeley, CA<p>Head of marketing + sales -- Captricity (captricity.com)<p>This is an opportunity to accelerate growth at a seed stage startup. The leaders are tech veterans and CS PhDs. We’re backed by great investors. Primary responsibilities are inbound marketing and architecting our inside sales operations. It's a great opportunity for a up-and-coming leader with a decent amount of saas sales/marketing experience to get to the next level.<p>Details + how to apply: <a href=\"http://captricity.com/jobs/#HMS\" rel=\"nofollow\">http://captricity.com/jobs/#HMS</a><p>Captricity is an award-winning startup that offers a pay-as-you-go service for digitizing paper forms. Our technology turns paper images into structured, machine-readable format quickly and cheaply using crowd-guided machine learning and computer vision. It's not OCR or crowdsourcing; we provide human-quality transcription that works on any form, including hand-written ones, at the speed and cost of a cloud software service. Our vision is to be an on-demand bridge between analog and digital information. Our inspiration comes from research on how to help low-resource organizations become data-driven and more efficient.","time":1357065636,"type":"comment"},{"by":"mvkel","id":4992929,"kids":[5015530],"parent":4992617,"text":"Localist - Baltimore, Maryland<p>When we built Localist, we went back to the drawing board to revisit how people connect around events. Instead of looking at traditional online calendars and creating minimal, evolutionary changes, we started from scratch. The result is a complete rethinking of an online calendar, with Localist at the core; one that connects communities better than any website or social media campaign. We think of Localist as more than a calendar, just as a Content Management System is more than a collection of blog posts.<p>Seeking:\nFULL STACK RAILS ENGINEER\nWe're looking for an experienced developer with top-notch software design skills. Our stack includes Ruby, Rails, Sass, Erb, Coffeescript, jQuery and MySQL. We prefer generalists who have lots of successes at every layer of the stack.<p>BUSINESS DEVELOPMENT\nTo reach our goals, we're looking to hire a Business Development Associate. Our BD Associates are an integral part of Localist's team, securing licensing agreements with new customers who need to connect their audiences to events.<p>CUSTOMER LIAISON\nWe consider top quality customer support to be vital to our business. Our priority is keeping our customers happy, not abandoning them after they've signed up. Depending on workload, this position is a split between support and implementation training.<p>INTERNS\nWe don't like hiring interns just to do the grunt work; we want interns to feel like solid members of the team who are making real contributions to Localist. We're looking for students interested in all deparments at Localist, from Sales to Web Development. Have a passion in these areas?<p>For more information, check <a href=\"http://www.localist.com/about/careers\" rel=\"nofollow\">http://www.localist.com/about/careers</a>","time":1357057678,"type":"comment"},{"by":"bijanv","id":4993319,"parent":4992617,"text":"EventMobi - Toronto, Canada - Full-time Devs<p>EventMobi (<a href=\"http://www.eventmobi.com\" rel=\"nofollow\">http://www.eventmobi.com</a>) is the leading mobile web platform that allows event planners to create engaging apps for their event or conference in only a few minutes. Our mobile event guides, real-time interactivity features and the first ever social / gaming layer customized for conferences and tradeshows have been used by over 1000 events, 2 Million users, and are served for events in 8 languages across 5 continents.<p>We’re not your typical startup, we’re completely self-funded team of 17 and yet with no outside capital we’re massively profitable and on an incredible growth path with companies like Intel, Disney and the Olympics IOC using us for their mobile event app needs.<p>-----------------------------<p>We're to grow our engineering team as our platform expands and we're looking for start-up minded software engineers who want to build extremely fast and see their code in production and in use by millions of people right away! We use a lot of new tech (Node.js,Backbone.js, Redis) in production and we're trying to innovate what is possible one the mobile web.<p>We're looking for devs who are comfortable with Javascript and are excited to build HTML5 products on the mobile web, give us a shout!<p>We're also looking for more experienced engineers to help us build our core platform as we add on other features and services. This means helping architect our multi-tiered API, our data consistency solutions syncing data between multiple devices and global nodes, architecting our scaling solutions, etc.<p>To have a better look, check out our careers page! <a href=\"http://www.eventmobi.com/about/careers/\" rel=\"nofollow\">http://www.eventmobi.com/about/careers/</a>","time":1357064106,"type":"comment"},{"by":"mildavw","id":4993589,"kids":[4993773,4993677,4993774],"parent":4992617,"text":"Portland, OR<p>Unix Systems Administrator<p><a href=\"http://renewfund.com\" rel=\"nofollow\">http://renewfund.com</a><p>Responsibilities:<p>• Maintain internal and external Linux/Mac/Windows systems in a highly automated/repeatable way.<p>• Improve and maintain service and performance monitoring infrastructure.<p>• Provide infrastructure support to our development team through the product development and deployment lifecycle.<p>• Monitor and improve system security.<p>• Provide occasional support to desktop users.<p>Desired skills and experience:<p>• SAGE Level II/III skill set. ( <a href=\"http://www.sage.org/ﬁeld/jobs-descriptions.html\" rel=\"nofollow\">http://www.sage.org/ﬁeld/jobs-descriptions.html</a> )<p>• 3+ years systems administration experience.<p>• Experience with Puppet or other conﬁguration management \ntools.<p>• Understands the importance of virtualization combined with automated provisioning &#38; maintenance.<p>• Demonstrated ability and desire to learn continuously.<p>• A bias towards open source tools.<p>• A love of command lines.<p>• Experience with PostgreSQL a plus.<p>• Bachelor of Science in Computer Science, Computer Engineering, or equivalent experience.<p>We value people, teamwork, innovation, diversity, and a healthy life balance, with an overriding dedication to quality in everything we do.<p>If this sounds like you, we'd love to hear from you. Send your resume to us at work@renewfund.com.","time":1357068342,"type":"comment"},{"by":"dekayed","id":4992855,"parent":4992617,"text":"Spiceworks, Austin, TX.  Full-time <a href=\"http://www.spiceworks.com/jobs/\" rel=\"nofollow\">http://www.spiceworks.com/jobs/</a><p>We're hiring all types (Analytics, UI, Test-Automation, Generalists) of developers and at all levels at the moment.<p>Responsibilities:  What will I do?<p>* Looking for all levels of experience<p>* Contribute to the design and development of product features as well as major components<p>* Contribute to the innovation and evolution of the Spiceworks suite products<p>* Work directly with our growing community of over 2 Million IT pros as well as experience developers who are experts in the industry<p>Qualifications: What does it take to do this job?<p>* Looking for all levels of experience<p>* Object Oriented programming skills with Ruby-on-Rails ( Python or equivalent)<p>* Application and/or Web Application experience is a must<p>* Familiarity with HTML, CSS, JavaScript (Prototype) and Ruby-On-Rails<p>* Solving large-application/user-level problems, performance, scalability, etc.<p>* Skilled with distributed software (native or webapp)<p>* Some experience with SQL is desired<p>Email me at sajana @ spiceworks . com if you're interested!<p>---<p>Called the “Facebook of IT,” Spiceworks innovative model combines a network management app with an online community of over 2 million IT pros around the world.  Our goal is to simplify “everything IT” by helping our users do their jobs, share tips and tricks, and connect with the tech vendors who sell them products. And, given we’re growing by over 2,000 users a day, it’s no wonder we’ve been called the “fast growing social business app” in history!","time":1357056063,"type":"comment"},{"by":"asanwal","id":4992947,"parent":4992617,"text":"CB Insights (New York, NY)\nFull-time, Intern, H1B<p>- Tech industry analyst\n- Full stack developer\n- Machine learning engineer\n- Product adoption manager<p>Full descriptions here - <a href=\"http://www.cbinsights.com/jobs/\" rel=\"nofollow\">http://www.cbinsights.com/jobs/</a><p>We were recently recognized as one of NYCs enterprise tech startups to watch. Backed by National Science Foundation. Profitable and growing.","time":1357058016,"type":"comment"},{"by":"snowmaker","id":4993827,"parent":4992617,"text":"Scribd - San Francisco, H1B, INTERN are welcome<p>Scribd (social publishing &#38; eBooks, top 100 website, YC '06) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired THREE full-time people and numerous interns from these \"Who is Hiring\" threads, including a one just last month ... it really works!!<p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript (we recently switched to Coffeescript and are loving it)<p>* iOS<p>* Android<p>* Machine Learning / data mining / recommendations<p>* Back-end problems: scalability, web crawling, big data, analytics<p>* DevOps and web infrastructure<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you. We've hired people from these threads with everywhere from 0 to 10 years of experience.\nWe're profitable, very well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>We're working on a big new product launch now that we're really excited about. If you're interested in eBooks, I'd love to tell you about it.<p>Generally we're looking for full-time and INTERN hires (junior year or older) who want to move to SF. H1B and relocation are no problem.<p>See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1357071784,"type":"comment"},{"by":"mehuln","id":4993018,"kids":[4994962,5001734],"parent":4992617,"text":"Flutter (flutterapp.con) - Full-time, Interns (year around)<p>We're building gesture detection over built-in webcam in devices through the disruptive computer vision technology to enable users to control computers, tablets, TVs, and phones simple finger flicks. Please go to <a href=\"http://flutterapp.com\" rel=\"nofollow\">http://flutterapp.com</a> to see our demo video.<p>If you are looking for a very early stage start-up with challenging technical problem in Computer Vision, Machine Learning, and Human Computer Interaction (HCI) then we are the right fit for you.<p>We are looking for:\n- Full Stack Engineer: c,c++, python, djengo\n- JavaScript Experts\n- Computer Vision, Machine Learning Experts\n- UI &#38; UX designers with neck for understanding HCI - this is not just about creating new graphics... it is really about creating a new way of interacting with machines.<p>Please send your resume to jobs [at] flutterapp.com","time":1357059340,"type":"comment"},{"by":"brandnewlow","id":4992784,"parent":4992617,"text":"Perfect Audience (YC S11), San Francisco or remote, Full-time.<p>We're looking for full-stack developers.  Perfect Audience is a self-service ad platform that lets businesses get more sales and conversions by retargeting lost visitors on Facebook.<p><a href=\"http://perfectaudience.com\" rel=\"nofollow\">http://perfectaudience.com</a><p>What we are looking for:<p>* Ability to architect, develop, and test key infrastructure<p>* Understanding of performance and design tradeoffs, without compromising quality<p>* Experience scaling up webapps and services for rapid growth is a plus<p>We offer a generous salary and equity grant, free lunches, your choice of snacks in the kitchen, and a desk in our sunny, beautiful office in downtown San Francisco.<p>Office pic: <a href=\"http://i.imgur.com/aL4Mc.jpg\" rel=\"nofollow\">http://i.imgur.com/aL4Mc.jpg</a><p>Want to know more? Write to hello@perfectaudience.com<p>P.S. If you don't know advertising, that's OK.  The ad stuff can be learned.  Being a great developer is much harder to \"pick up.\"","time":1357054621,"type":"comment"},{"by":"mikepk","id":4997784,"parent":4992617,"text":"Boston, MA (full-time, intern)\nSmarterer - <a href=\"http://smarterer.com\" rel=\"nofollow\">http://smarterer.com</a><p>=================================<p>Smarterer is a fun, crowd-sourced, online, testing platform for any knowledge skill (from nuclear physics to World of Warcraft).<p>We have lots of interesting scaling, algorithm, and product challenges. You will be a part of the core technical team and will have a big impact on the product, technology and culture of the company.<p>Our stack is mostly Python and JavaScript, but we're looking for creative startup hackers who love to build things.<p>We're backed by True Ventures, Google Ventures and a collection of amazing angel investors.<p><a href=\"http://smarterer.com/blog/jobs/web-programmer-developer/\" rel=\"nofollow\">http://smarterer.com/blog/jobs/web-programmer-developer/</a><p><a href=\"http://smarterer.com/jobs/\" rel=\"nofollow\">http://smarterer.com/jobs/</a><p>Send me an email if you're interested, mikepk@smarterer.com","time":1357147556,"type":"comment"},{"by":"igurari","id":4993175,"parent":4992617,"text":"San Francisco (SOMA), CA - Full-time Engineer and Full-time Designer<p>Judicata - <a href=\"http://www.judicata.com\" rel=\"nofollow\">http://www.judicata.com</a><p>We are mapping the legal genome. Using data mining, semantic analysis, machine learning and human computer interface technologies, we are extracting deep meaning from legal documents and creating the most powerful litigation tools in the world. We're a team of 7. We develop in Python, Django, JavaScript and Java. And we've raised $2 million from Peter Thiel, Keith Rabois and SV Angel (David Lee) - all former lawyers.<p>We are seeking an engineer and a designer.\nEngineering Requirements: 3+ years of experience. B.S. / B.A. in Computer Science. Strong interest in U.S. law.\nDesign Requirements: 2+ years of experience. Portfolio demonstrating clean, information rich UI designs.<p>Contact us if you are interested: careers@judicata.com","time":1357061785,"type":"comment"},{"by":"schuon","id":4994554,"kids":[4996279,5018008],"parent":4992617,"text":"Munich, Germany\nStylight - European Fashion Community <a href=\"http://www.stylight.com\" rel=\"nofollow\">http://www.stylight.com</a><p>We do beautiful stuff - not only our product is beautiful, also our code and architecture. We're an international, English speaking team of 7 that builds the plattform. We use Bootstrap/Java/JBoss for the frontend and Python/Tornado for our backend. We're hiring across the board on both ends, mail sebastian.schuon@stylight.com if you're interested in coming to Munich - we want all of us in the same room, needless to say we pay for relocation.<p>Check out <a href=\"http://www.stylight.co.uk/Jobs/\" rel=\"nofollow\">http://www.stylight.co.uk/Jobs/</a> to see what we look like!<p>Cheers and a happy new year,\nschuon (<a href=\"http://www.stylight.co.uk/schuon\" rel=\"nofollow\">http://www.stylight.co.uk/schuon</a>)","time":1357084523,"type":"comment"},{"by":"perezda","id":4992688,"parent":4992617,"text":"Mountain View, CA - Wedding Party www.weddingpartyapp.com<p>1. We’re building a company that’s bringing mobile technology to the massive ($100bln) wedding industry. (there are over 2.5M weddings and 300M guests a year in the US alone)<p>2. We’ve seen tremendous growth and are currently working on some technically interesting multi platform and scaling challenges. There are also big data challenges on the horizon.<p>3. We’re a small team of 5 and you will have a huge material impact on the growth of the company.<p>4. We’re on Rails 3.2, Objective C, Java. We use Coffeescript, Underscore, Haml, and Sass. We test with RSpec, Capybara and Selenium.<p>5. We work at an awesome office near downtown Mountain View and have a diverse and wicked smart team.\nLearn more here: www.weddingpartyapp.com/jobs\nIf you’re interested, email us at jobs@weddingpartyapp.com","time":1357052727,"type":"comment"},{"by":"scottyallen","id":4993887,"parent":4992617,"text":"Seeking a data-loving sales person to lead the charge (REMOTE from somewhere in the bay area)<p>AppMonsta sells data and insights to help businesses better understand the mobile app markets.  Our customers love us, we're bootstrapped and profitable, and we're growing quickly. We love hustle - we've been out hitting the streets as founders for the past year (we closed Neilsen and comScore starting with cold emails). Now it's time for us to bring a real pro - we've figured out the product and the market segments, and now we need someone who can use what we've learned to close a whole bunch of new customers.<p>When we talk to prospects, we hear things like \"We've been looking for a solution to this problem for the past three weeks.  This is EXACTLY what we were looking for\".  There are tons of leads just waiting for someone to give them a demo and close them, as well as a ton of companies that don't know they want to talk to us yet (we usually come back from conferences with handfuls of business cards to give demos to).<p>As our first dedicated sales person, there's a huge opportunity waiting for you (and responsibility to match).  You'll set the tone for our whole sales organization, and have the opportunity to grow into a very senior management role.  You'll be instrumental in helping develop a repeatable, measurable sales process.  At the same time, you should be comfortable with being the feet on the street while we ramp up.  We have had great luck with attending conferences, sending cold emails, and giving web demos to close new customers.<p>Our entire team works remotely.  We're very flexible about where and when you work, as long as you're hustling, closing deals, and keeping our existing customers happy and paying.  Being in somewhere in the bay area is a big bonus, as both founders are here, as are a lot of our customers.  We try to get together at least once a week, and meet with our customers in person when we can.  We also provide everyone with a 4G LTE wireless access point so you can work from wherever suits your fancy.<p>Send me an email at scotty@appmonsta.com and tell me what gets you fired up about selling.","time":1357072901,"type":"comment"},{"by":"dschnurr","id":4993029,"parent":4992617,"text":"FindTheBest - Santa Barbara, CA<p>FindTheBest is an unbiased, data-driven decision engine. We collect, organize and present data in a consumer-friendly format so our users can quickly make informed decisions. Each month, 13M+ users view our content on 800+ products and services across 10 verticals. We're backed by Kleiner Perkins Caufield Byers, and our founder/CEO previously started DoubleClick (sold to Google for $3.1B). Located in Santa Barbara (Silicon Beach), we're a fast-growing, fun place to work.<p>We're currently looking for Software Engineers and Frontend Developers. If you're interested you can learn more on our website: <a href=\"http://www.findthebest.com/jobs\" rel=\"nofollow\">http://www.findthebest.com/jobs</a>","time":1357059548,"type":"comment"},{"by":"andylei","id":4993015,"parent":4992617,"text":"Addepar is Hiring - Engineers - Mountain View, Ca<p>Who we are: Engineers rebuilding the infrastructure that powers global finance. Current technology in the space is so broken and opaque, it empowers scandals like Bernie Madoff to go on for a decade while $64 billion vanishes from the economy effecting, endowments, institutions, and notable individuals.<p>Our platform provides increased transparency-- allowing for better decisions and furthering meritocracy in the multi-trillion dollar wealth management industry. We free data from disparate silos and build tools for advanced analysis and decision making.<p>Addepar is an engineering lead company that’s designed our perks around enabling great technologist to build.<p>Join us: Careers.addepar.com<p>Or email R2 [at] Addepar [dot] com","time":1357059298,"type":"comment"},{"by":"jnazario","id":4992789,"parent":4992617,"text":"Invincea Labs -- Fairfax/Arlington<p><a href=\"http://www.invincea.com/the-invincea-team/employment/\" rel=\"nofollow\">http://www.invincea.com/the-invincea-team/employment/</a><p>i have a bunch of immediate openings.<p>i'm hiring for two \"research engineer\" positions, two \"senior research engineer\" positions, and two \"principle research engineer\" positions. think \"software engineer who loves solving science problems and dealing with shifting requirements\". C, C++, Python. algorithms, malware analysis familiarity, automation, etc. US citizens, clearance and/or clearable desired. no relo assistance.<p>i'm also seeking an IT person: sysadmin, devops role. clearance needed, experience in working with secured equipment (e.g. in a secure facility) strongly desired.","time":1357054705,"type":"comment"},{"by":"dogas","id":4992829,"parent":4992617,"text":"PipelineDeals - Seattle/Greater Philadelphia Area (Wayne, PA)/Remote<p>Join the team of happy hackers at PipelineDeals! We’re looking for talented Rails developers in the Seattle or Greater Philadelphia area (remote work ok, for the right type of individual)<p>Perks:<p>* Join a progressive, 6 year-old company that is fun to work at, bootstrapped, profitable and proud.  The stuff you will work on will be used daily by tens of thousands of users across the globe!<p>* We encourage and promote learning on the job.   We have Video/Prezo Fridays, where we all hang out and watch a presentation from a conference, or present ourselves, about various subjects like TDD, architecture, SOLID principles, Ember.js, etc etc.<p>* There are quite a few large projects in our future that will be quite interesting to work on.<p>* Reimbursement for conferences or meetups you would like to attend, books you want to buy, screencasts you want to watch.  In addition, you will be invited to attend our yearly Summit meeting, where the entire company gets together in a wild location.<p>* Great benefits package:  401k, full health coverage, dental, vision.<p>* Very competitive salary, and lots of room for growth. Our goal is to ensure you are comfortable so you will be productive.<p>Requirements:<p>* Must have at 2 years of experience working directly with ruby, either with a company, or via open source. Past contributions to open source projects, or maintaining your own, are looked very highly upon.<p>* At least a year’s experience working with Rails, either on your own or at a previous company.<p>* Experience with jQuery, Backbone.js or Ember.js, Coffeescript<p>* Solid familiarity with git or other distributed version control system.<p>* Enough SQL to understand what rails is doing in the backend.<p>* Willingness to learn every day, and present what you learn to the team.  We love learning here.<p>* A good sense of humor is a strict requirement. Company culture is very important to us, and we are absolutely NOT a bunch of straight-laced, profit-driven, cubicle-sitting curmudgeons.<p>* Remote work OK, but it is highly preferable if you are located around the Philadelphia or Seattle area. You will be expected to be at the office sometimes. We do get lonely.<p>Interested? Email a link to your Github account (or resume) to careers@pipelinedeals.com. We look forward to hearing from you!","time":1357055601,"type":"comment"},{"by":"twohey","id":4993620,"parent":4992617,"text":"Ness Computing, Los Altos CA. Happy to hire H1B<p>Ness Computing's mission is to make search personal. By combining its understanding of human nature with its expertise in search, recommendations and social networking, Ness delivers experiences that are more deeply personal than ever before. We are actively looking to hire an amazing frontend web engineer.<p>You might be right for the role if you care deeply about making software that delights users and have experience doing that on the web.<p>Feel free to contact me directly at me email in my profile. You can find more information at <a href=\"http://www.likeness.com/jobs.html#Frontend\" rel=\"nofollow\">http://www.likeness.com/jobs.html#Frontend</a>","time":1357068845,"type":"comment"},{"by":"ryporter","id":4996102,"parent":4992617,"text":"Palo Alto, CA. Full time. H1B okay.<p>AMA Capital trades billions of dollars per day in the foreign exchange market.<p>We are all engineers, and we all do a little bit of everything. We design and implement our own trading strategies and infrastructure, down to the networking code that ties us in to financial markets.<p>We are a very small team looking to hire employees number 2 and 3, who will focus on strategy or on infrastructure.<p>No experience or specific knowledge of finance is required. However, you do need to be at least interested in financial markets and to be able to implement your strategies carefully in C++.<p><a href=\"http://amacapital.net/careers.html\" rel=\"nofollow\">http://amacapital.net/careers.html</a>","time":1357123523,"type":"comment"},{"by":"rvivek","id":4993686,"parent":4992617,"text":"Mountain View, CA\nHackerRank (<a href=\"http://hackerrank.com\" rel=\"nofollow\">http://hackerrank.com</a>) - we're building an active community of problem solvers across different domains of Computer Science starting with AI.<p>Hypothesis: Every hacker loves a particular type of challenge in a certain difficulty level. We're building a large collection of challenges in different domains of CS with real world data sets to emphasize learning along with contests, leaderboard for fun.<p>We're hiring for multiple positions. Checkout hackerrank.com/careers<p>Btw, if any of the companies here are interested to meet university students from hackerrank.com/backtoschool, let us know.","time":1357069837,"type":"comment"},{"by":"sandrasi","id":5033667,"parent":4992617,"text":"Amsterdam, The Netherlands<p>RIPE NCC is one of the 5 regional internet registries of the world and is looking for an experienced Java / Scala developer. The company is quite international: we have employees from over 20 countries. Applicants from RIPE NCC's service area (Europe and Middle East) are preferred but it's not a requirement. The official language at RIPE NCC is English.<p>You will work in the Business Applications Department in an agile team of 4 software engineers (the total headcount of the department is 14 people). Ideal candidates\n- already have a few years of software development experience,\n- are familiar with Java / Scala / JavaScript,\n- have Clean Coding skills, and\n- have strong spoken and written English.<p>Please read the full job description here which contains everything from requirements to compensation and benefits: <a href=\"http://www.ripe.net/lir-services/ncc/jobs/current-openings/software-engineer-business-applications\" rel=\"nofollow\">http://www.ripe.net/lir-services/ncc/jobs/current-openings/s...</a><p>Full list of RIPE NCC benefits: <a href=\"http://www.ripe.net/lir-services/ncc/jobs/benefits\" rel=\"nofollow\">http://www.ripe.net/lir-services/ncc/jobs/benefits</a><p>Additionally, if you're an expat, you will likely get the \"30% tax ruling\" applied on your salary which is a huge money-saver.<p>In case you are interested, please apply by following the instructions given on the job description page.","time":1357767390,"type":"comment"},{"by":"ultrasaurus","id":4999548,"parent":4992617,"text":"Toronto - PagerDuty - Senior Software Engineer<p>We power the panic buttons in server rooms across the world, we're how IT teams get notified when something breaks, and we're opening our first office outside of San Francisco in Toronto.<p><a href=\"http://www.pagerduty.com/jobs/engineering/software-engineer-senior\" rel=\"nofollow\">http://www.pagerduty.com/jobs/engineering/software-engineer-...</a><p>We also have jobs open in our San Francisco office, naturally: <a href=\"http://www.pagerduty.com/jobs\" rel=\"nofollow\">http://www.pagerduty.com/jobs</a>","time":1357163727,"type":"comment"},{"by":"ar4420","id":5008620,"parent":4992617,"text":"CoachUp | Boston, MA<p><a href=\"https://www.coachup.com/\" rel=\"nofollow\">https://www.coachup.com/</a><p>CoachUp is a marketplace that helps athletes achieve their full potential by connecting them with great private coaches. We are the nation's leading private coaching provider with over 7,000 private coaches in every sport, all across America.<p>We're looking for talented individuals who want to be part of a small team going after a huge opportunity.  Specifically, we have positions open for Senior Software Engineers and Lead UI/UX Designers. We're building in Ruby on Rails, developing at a fast pace, and are constantly iterating and pushing releases into production. There will never be a single boring day at CoachUp!  If you would like to find out more information, you can visit: \nwww.coachup.com/careers<p>We're fortunate enough to have just closed our first round of VC financing, and are looking to invest heavily in our product:<p><a href=\"http://blogs.wsj.com/venturecapital/2013/01/02/gabe-kapler-cam-neely-among-pro-athletes-investing-in-coachup/\" rel=\"nofollow\">http://blogs.wsj.com/venturecapital/2013/01/02/gabe-kapler-c...</a><p>We offer competitive salaries, full health and dental coverage, a fun work atmosphere, and flexible hours.  If you're looking to have a large impact on a small company that is changing the world, get in touch with us today by sending your resume to careers[at]coachup.com","time":1357320278,"type":"comment"},{"by":"kloutlaw","id":4994973,"parent":4992617,"text":"Klout is hiring in San Francisco, CA (H1B is fine)<p>We’re looking for a seasoned product engineer to help us deliver great user experiences at great speeds. Our web applications stack is focused on JavaScript, driven by node.js on the server and Backbone.js on the client. You’ll be working with talented designers, platform engineers, and scientists to bring our 9 billion data signals to our customers, who are a mixture of brands and social media users like you.<p>Apply here if this sounds like you: <a href=\"http://bit.ly/11gKHU9\" rel=\"nofollow\">http://bit.ly/11gKHU9</a><p>We’re also looking for a seasoned infrastructure engineer with Hadoop experience, someone who can both implement elegant solutions to Big Data problems and lead by example. You’ve architected highly-scalable, distributed systems efficiently using open source tools -- and maybe even contributed to some.  You’re well versed in the challenges of dealing with petabytes of data on a daily basis and the opportunity to crunch billions of social signals a day excites you.<p>Problems we’re working on:<p>-Scalability and Infrastructure: Building infrastructure to collect, store and process hundreds of millions of social interactions per day\n-Real-time systems: Real-time data infrastructures to process large volumes of data<p>Apply here if this sounds interesting: <a href=\"http://bit.ly/Pp0EUE\" rel=\"nofollow\">http://bit.ly/Pp0EUE</a>","time":1357092820,"type":"comment"},{"by":"georgeeeee","id":5005869,"parent":4992617,"text":"San Francisco, CA (full-time)<p>Backend Developer @ Beyond Digital  - <a href=\"http://bynd.com/\" rel=\"nofollow\">http://bynd.com/</a><p>Beyond is an international interactive agency with offices in London, New York and in San Francisco. We conceptualize, design and develop creative online brand solutions and web applications for international and domestic customers.<p>Our portfolio ranges from full-blown social campaigns to corporate branding sites to custom content management systems. Our clients include Google, YouTube, Visa, Cisco and IBM.<p>Responsibilities will be based around creating backends using python on google appengine or php on amazon ec2 - familiarity with one of these languages is essential.<p>Bonus points for: experience with appengine, amazon ec2, nosql databases, django, oauth, facebook/youtube/instagram etc apis<p>If you’re looking to join a young and fast-growing creative digital agency, full of enthusiastic hardworking smart people, all driven to create engaging experiences using the latest technologies then Beyond is the place for you.<p>Beyond offers a very competitive salary and excellent benefits including opportunities to travel to our offices in San Francisco and New York!<p>You get 25 days holiday plus we close for Christmas and you get your birthday off! We also like to have fun at the Beyond offices and to unwind we enjoy Xbox championships, trips to festivals and great nights out!<p>email: george@bynd.com","time":1357264663,"type":"comment"},{"by":"scanr","id":5026359,"parent":4992617,"text":"London, England - Full Time - Local Only (with flexibility to work from home on occasion)<p>Optim.al (<a href=\"https://www.optimalsocial.com/\" rel=\"nofollow\">https://www.optimalsocial.com/</a>) is currently hiring full stack engineers for our London office, working on a variety of projects that cover real time bidding, analytics, data science and front end web applications.<p>Requirements:<p><pre><code>    * BS or MS degree in computer science, maths, information science, \n      or related field.\n    * Good understanding of web technologies HTML, Javascript, HTTP, JSON, REST\n    * Must be able to demonstrate that you're a great \n      programmer in any one of Python, Ruby, Java, Scala, Clojure, Haskell, \n      F# or Kotlin\n    * Must be happy to work in either Python, Ruby or Java\n    * Must have a good understanding of a Unix based operating system\n    * Some experience of databases and at least one web application framework\n</code></pre>\nIf you love programming and would like an interesting job with a steep learning curve and a wide variety of challenges, please get in touch. You can email me personally at jamie@optimalsocial.com or use the following Jobvite link:  <a href=\"http://hire.jobvite.com/j/?aj=oYH2Wfwn&#38;s=HackerNews\" rel=\"nofollow\">http://hire.jobvite.com/j/?aj=oYH2Wfwn&#38;s=HackerNews</a><p>No recruiters please.","time":1357655913,"type":"comment"},{"by":"cacois","id":5009902,"parent":4992617,"text":"CMU Software Engineering Institute (<a href=\"http://www.sei.cmu.edu/\" rel=\"nofollow\">http://www.sei.cmu.edu/</a>) - Pittsburgh, PA<p>Dev team looking for:<p>* A Frontend Web Developer<p>* Senior &#38; Intermediate Web Developers<p>* A Dev with some linux kernel Fu<p>Things that are important to us:<p><pre><code>  - Polyglot tendencies and a willingness to learn new tools/languages\n  - Solid coding skills, and a proven track record\n  - Ability and desire to work at all levels of the stack\n  - Ability to multitask, and keep organized with multiple projects at once\n  - Great writing &#38; presentation skills\n  - Ability to interact with customers\n</code></pre>\nThings that are helpful:<p><pre><code>  - Security experience\n  - Experience with distributed systems\n  - Virtualization experience\n  - Comfort in linux environments\n</code></pre>\nWe currently have projects in Python/Django, Java/Spring, .NET, C++, and have a little Node sprinkled in. Always something new to learn, so you have to love the game. It's a great crew to work with - we have some really smart devs here. We're at a university, so its a pretty comfortable, academic environment - and ideal if you are interested in going back to school for a graduate degree. Our active development projects take more than two hands to count, so multitasking is necessary, but its hard to become bored.<p>Posts are making their way onto our job site now. Email me (at my HN username at sei.cmu.edu) with a resume if you are interested. I can put recommendations in for promising candidates. Sorry, no telecommute.","time":1357333665,"type":"comment"},{"by":"gidgreen","id":5006321,"parent":4992617,"text":"Copyscape - <a href=\"http://www.copyscape.com/\" rel=\"nofollow\">http://www.copyscape.com/</a> - Israel (Tel Aviv, Jerusalem)<p>Copyscape is the world's leading online plagiarism search engine with millions of users and a strong global brand: <a href=\"http://www.copyscape.com/press.php\" rel=\"nofollow\">http://www.copyscape.com/press.php</a><p>We are looking for a senior developer to build new services for online content analysis and management. You will work directly with the founders, who have deep product and technology experience, and will quickly gain a high level of autonomy and responsibility. Competitive pay and flexible working location for the right candidate, including the option to work from home. Full time or part time position.<p>You must be intelligent and enjoy working independently, teaching yourself what you need to get the job done. Beyond that, we value experience designing scalable database architectures, customer-facing APIs and web-based user interfaces. Knowledge of C, PHP, MySQL and Javascript are also a plus, but we know the best developers can pick up new languages quickly.<p>Copyscape is provided by Indigo Stream Technologies, a small and rapidly growing company co-founded by Gideon Greenspan (gidgreen.com). The company has been profitable for many years.<p>To apply, please email jobs-2012@copyscape.com - thanks!","time":1357275008,"type":"comment"},{"by":"suitabletech","id":4992991,"parent":4992617,"text":"Palo Alto, CA (remote or relocation possible)<p>Suitable Technologies - <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>We’re a startup that just launched our flagship product, called Beam, a true remote presence device that lets you travel instantly to remote locations, with a depth of interaction that makes you (and everyone else) feel as if you're really there. You can learn more and see our demo video on our site (<a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a>).<p>We’re already shipping to customers, and interest is strong. Yesterday, actually, we were featured on the Yahoo home page (<a href=\"http://news.yahoo.com/telepresence-robots-let-employees-beam-143529632--finance.html\" rel=\"nofollow\">http://news.yahoo.com/telepresence-robots-let-employees-beam...</a>).<p>We have funding, competitive compensation, and a fun work environment, complete with our own chef and break-time games like table tennis. We provide top-of-the-line development hardware, adjustable desks, and will get your workspace just right. We’re located in Palo Alto, CA.<p>Overall, we’re looking for great engineers, designers, testers, and product marketers to help in areas such as C++ development, audio and video software and codecs, web frontend and backend, UI/UX design, optimization, and networking. It’s also an opportunity for someone with experience in web or mobile to work on something unique and challenging.<p>More information is available on our site: <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a>\nContact: jobs@suitabletech.com","time":1357058796,"type":"comment"},{"by":"davidrangel","id":4995057,"parent":4992617,"text":"Palo Alto, CA - Corona Labs (<a href=\"http://www.coronalabs.com\" rel=\"nofollow\">http://www.coronalabs.com</a>)<p>Core Mobile Engineer (<a href=\"http://www.coronalabs.com/about/jobs/core-engineer/\" rel=\"nofollow\">http://www.coronalabs.com/about/jobs/core-engineer/</a>)<p>Join Corona Labs as we reinvent how the world develops software. We are enabling everyone to create world-class apps for phones, tablets, and other connected devices.<p>Corona SDK is the leading mobile development platform for building #1 cross-platform games, apps and eBooks. Over 200,000 developers use Corona from indies to game studios, from teenagers to octogenarians, from publishers to agencies. Their apps have consistently hit the top of the charts on all 4 major app stores: iTunes, Google Play, NOOK, and Amazon.<p>As an engineer in Corona’s Core Engineering group, you will work on the Corona engine. The Corona engine powers all of the company’s mobile and desktop software — from Corona SDK/Enterprise to Corona Simulator/Levels — so your work will have a deep and fundamental impact on the company.<p>We are looking for engineers with experience with Objective-C, Java or C/C++. Please see the job description here:\n<a href=\"http://www.coronalabs.com/about/jobs/core-engineer/\" rel=\"nofollow\">http://www.coronalabs.com/about/jobs/core-engineer/</a>","time":1357095031,"type":"comment"},{"by":"lazyjones","id":4994193,"parent":4992617,"text":"Geizhals in Vienna, Austria is looking for senior and lead web/full-stack developers.<p>We currently use mostly Perl (mod_perl, PSGI/Plack and Mojolicious), PostgreSQL, Redis, Apache, Gearman, as well as JavaScript, C, Java/JSP, PHP for minor projects, but as an experienced lead developer you would build/expand a team based on sound technology decisions yourself (we're very interested in switching to Go).<p>We're a small (hc: 53), privately-owned and profitable company running one of the oldest and most popular price comparison websites in the German speaking area (built in 1997, incorporated in 2000) and several smaller sites, looking to build a strong, experienced development team to bolster our efforts for current and future projects.<p>German is not strictly required, but helpful. English is mandatory. Strong team skills and a hands-on mentality are absolutely required. You must have experience building large, complex, high-performance websites, implementing A/B-testing and working with medium-sized, mixed (not only dev) teams. Experience building smartphone/tablet apps is helpful, though not required.<p>If you want to make a difference and enjoy one of the highest living standards in the world, let us know at: jobs@geizhals.at<p>Salaries for these positions will typically be in the range of €56K-80K/y.","time":1357077829,"type":"comment"},{"by":"ryansapper","id":4995545,"parent":4992617,"text":"Causes - Downtown San Francisco, CA\nFT position - Relocation available \n(Interns also welcome)<p>At Causes, use your programming powers to help anyone change the world! Ruby on Rails + jQuery stack, 15-ish person engineering team, the usual startup perks (catering, snacks, soda, etc), gym membership reimbursement, etc.<p>Ways we're trying to make ourselves better engineers:<p>- Deliberate practice with our tools. If you are a vim user, we have the programmer who wrote Command-T on staff and he's a great person to learn from.<p>- Every changeset gets pushed to Gerrit where it waits to get a +1 from our build suite (that runs in 3 minutes) and a +1 from a human reviewer.<p>- Over the last 4 months, we've upgraded from Rails 2.1 to 3.2.3 and are using the static asset pipeline, SASS/Compass, and HAML. We're the largest site I know of on Rails 3.2. We gave a presentation on the upgrade at last weeks SF Rails meetup, slides at causes.github.com/migrating-rails-talk<p>- Everyone is encouraged to take one hour from their day to learn about something they wouldn't otherwise (aka study hall).<p>- Every story is scoped so that it can be completed in less than a day. We don't branch, we just work on top of master. We've found that the closer we stay to master, the less needless work we create for ourselves.<p>Causes is a great place to better yourself and the world. We're particularly looking for a:\n- DEVOPS ENGINEER \n- FULL-STACK ENGINEER\n- iOS ENGINEER<p>If interested, please check our our team page at www.causes.com/team and apply at jobs@causes.com and use \"HN\" in the subject line.","time":1357107856,"type":"comment"},{"by":"glou","id":4992923,"parent":4992617,"text":"Quirky.com - Full Time - NYC and SF<p>Quirky is a social product development company where people from all around the world submit invention ideas to our website. With the help of our passionate community, we select the best ideas each week to develop together and try to bring them to market. If an idea actually makes it, then everyone who helped along the way gets a piece of the pie. You can find our products at retailers such as Target and Bed Bath &#38; Beyond. Our mission is to make invention accessible.<p>Quirky is a rails shop, and we work with lots of fun technologies like AWS, mongo, iOS and heroku to name a few. We're a small team that works on lots of big, fun and interesting problems. We've got a brand new, fully custom office space in Chelsea (and currently working on a new one in SF). Oh and we also had a reality show on the Sundance Channel last year. VC backed by Andreessen Horowitz and Kleiner Perkins among others.<p>We're looking to hire rockstar rails, front end, back end and mobile developers.  Designers too.<p>More details here: <a href=\"http://www.quirky.com/about/careers\" rel=\"nofollow\">http://www.quirky.com/about/careers</a><p>If interested, shoot me an email greg at quirky dot com.<p>Relocation is definitely available for well qualified candidates (I moved from SF to NYC to work here!)","time":1357057605,"type":"comment"},{"by":"netfire","id":5011645,"parent":4992617,"text":"Provo, UT - Remote, Full-time<p>SpinGo - Front End Software Engineer<p>Who We Are: The SpinGo Event Platform is the optimal ecosystem for events in the digital age. It is comprised of a comprehensive and dynamic database of events, calendar applications rich with features, and an ever-expanding partner network. We we work closely with closely with venues to obtain event information directly from the source, and to help them promote their events.<p>Who You Are: The Front End Software Engineer will develop high quality user interfaces to meet the needs of our users. You will help improve our main calendar product and build tools to help users submit and promote events and manage calendars. You have the skills to build pixel-perfect cross-browser interfaces and help build scalable web applications. You are self-motivated, give accurate estimates and deliver quality code on-time.<p>Required Qualifications\n- BS in a Software Development Field or Equivalent Work Experience<p>- Ability to use critical thinking skills to solve front-end development problems<p>- Several years experience developing cross-browser web applications<p>- Expert in a server-side interpreted language (PHP, Python, Ruby, NodeJS, etc)<p>- Advanced knowledge of MVC-based architecture and frameworks<p>- Advanced knowledge of JavaScript, HTML and CSS (experience with SASS a plus)<p>- Advanced skills with relational databases, preferably PostgreSQL or MySQL<p>More details at <a href=\"http://www.spingo.com/jobs\" rel=\"nofollow\">http://www.spingo.com/jobs</a>. To apply email devjobs@spingo.com","time":1357361162,"type":"comment"},{"by":"jenrobinson","id":5008182,"parent":4992617,"text":"Big Frame | Los Angeles, CA<p>## Lead Engineer - Full Stack ##<p>Big Frame is looking for an experienced full stack engineer to lead the development of our core product. The Lead Engineer will be a talented technologist who loves to create things and has experience building professional-grade software from the ground up. You will be one of the first technical employees of the company with big responsibilities and the opportunity to make a direct and visible impact on scaling the business.<p>$80-120k salary + bonus + 0.25—0.4% equity.<p>You will:<p>Play a pivotal role in defining our technology stack; drive the development schedule and lead the implementation of our core product; build an in-house technical team while directing outsourced designers and developers; attract and develop engineering talent as we grow; be part of an awesome team in sunny Los Angeles (LA location is a must).<p>About Us<p>Big Frame is a growing media company representing some of the most prominent producers on YouTube.  We provide marquee online talent with marketing and production resources to create original content and integrated marketing campaigns. We raised $3M+ earlier this year. <a href=\"http://www.crunchbase.com/company/big-frame\" rel=\"nofollow\">http://www.crunchbase.com/company/big-frame</a><p>To Apply<p>View the full description at <a href=\"http://careers.stackoverflow.com/jobs/28443/lead-full-stack-engineer-drive-platform-big-frame\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/28443/lead-full-stack-...</a>. Send us a brief note including your resume/LinkedIn and Github profile at jobs@bigfra.me.","time":1357315411,"type":"comment"},{"by":"capkutay","id":4993039,"parent":4992617,"text":"WebAction (<a href=\"http://www.webaction.com\" rel=\"nofollow\">http://www.webaction.com</a>) - Full time or intern in Palo Alto, CA (Downtown Palo Alto). Seeking Front-end developers and Platform Engineers.<p>WebAction is a start-up looking to fill the gap between Big Data and transaction data. We have just closed our Series A round and we are getting ready to launch our product. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today. We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>Front-end Developers should be well-versed in HTML, CSS, JavaScript, and jQuery. You should be interested in Data Visualization libraries such as D3 or processing. Strong programming fundamentals and experience with languages like Java/C/C++ is a huge plus. Experience developing native iOS apps would also be strongly desired, but not a requirement.<p>For the Platform Engineer position, you should have or at least be interested in learning: Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested, email us at jobs@webaction.com. In your message, mention \"Hacker News\" and feel free to let us know about your passions or any technologies that excite you. We look forward to hearing from you.","time":1357059691,"type":"comment"},{"by":"rickmzp","id":4994219,"parent":4992617,"text":"Flavorpill // NYC (will relocate) // FULLTIME<p>Ruby, RSpec, Cucumber, HTML5, Haml, MongoDB, elasticsearch, Redis, Varnish, Resque, Chef, Jenkins<p>We're looking for a passionate Senior Developer who wants to be part of a lively, social work environment and who cares about being invested in the product they're creating. Our team is creating a new Flavorpill product, the go-to discovery engine for culture (<a href=\"http://gel.flavorpill.com\" rel=\"nofollow\">http://gel.flavorpill.com</a>) - a social tool that helps users find the best culture events happening around them.<p>We're Agile/XP (1 week iterations, continuous deployment, TDD, pair programming, refactoring, weekly retrospectives). We work out of an open-plan office in the heart of Soho, NYC: <a href=\"http://flavorpill.tumblr.com/about\" rel=\"nofollow\">http://flavorpill.tumblr.com/about</a>. We work hard, have fun, and have amazingly talented people: <a href=\"http://flavorpill.tumblr.com/staff\" rel=\"nofollow\">http://flavorpill.tumblr.com/staff</a>.<p>We don't just talk about culture, we DO it - parties, museums, gallery openings, theatre, film - getting out to experience the city we live in.<p>Apply at <a href=\"http://flvr.pl/132EA5Z\" rel=\"nofollow\">http://flvr.pl/132EA5Z</a> or email kim@flavorpill.com if you're interested!","time":1357078442,"type":"comment"},{"by":"Mailjet","id":5037706,"parent":4992617,"text":"Mailjet - mailjet.com -- \nHiring in quite a few countries (Paris, Brussels, Berlin, Toronto..). \nPossibly Remote for certain positions.<p>Mailjet is an all-in-one solution to send, track and deliver both marketing and transactional emails. Our cloud-based infrastructure is highly scalable. A proprietary technology optimizes the deliverability of the messages.<p>We also provide a few marketing features, such as a WYSIWYG newsletter editor.<p>We're experiencing strong growth... <a href=\"http://news.ycombinator.com/item?id=4846864\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4846864</a><p>Consequently, we are hiring in every domain. Our team is very international... There are about 25 people working for us.<p>Our job openings are listed on Angel.co <a href=\"https://angel.co/mailjet#recruiting\" rel=\"nofollow\">https://angel.co/mailjet#recruiting</a> (details for the salaries)<p>More details are available on our website: www.mailjet.com/jobs (details of the positions)<p>Maybe our DEV EVANGELIST is around?<p>But we're also looking for these people ;-)<p>- Community Manager\n- Tech Customer Support Agent\n- Business Development &#38; Partnership Officer\n- Human Resources &#38; Finance Officer\n- Technical Support Agent\n- Web Designer<p>Don't hesitate to email me if you have questions: elie@mailjet.com\nOr get in touch on Twitter @Mailjet<p>Can't wait to get in touch!","time":1357834451,"type":"comment"},{"by":"blo","id":4993935,"parent":4992617,"text":"Vurb - San Francisco, CA (SOMA) - Full Time - Early-stage (0.5-2+% equity)<p>Looking for engineers in the following areas:<p><pre><code>  * JavaScript (Backbone.js, node.js) - development in the frontend,\n      backend, or both\n  * Mobile (iOS) - lead development of our native mobile platform\n  * Search / Data Scientist - classification algorithms, \n      search (e.g., ElasticSearch), NLP\n  * User Interface/Experience - focus on delivering the \n      best UX/UI experience to our users\n</code></pre>\n---<p>About us: we're changing the way people find information and interact with online services in a way that's more more usable, efficient, and social than options available today (e.g., no more having ten browser tabs open to assemble the information you need).<p>We've been in stealth while we focus on building.  We're funded by many notable investors (people on the boards of Yelp, Yahoo, Dropbox, etc.).<p>We're all engineers (MIT, Cornell, Microsoft, Zynga...)  If you're looking to get into an earlier stage startup that solves complex problems, then come find out what we're up to.  Our office is near AT&#38;T Park.<p>Email us: jobs@vurb.com - please include your LinkedIn / GitHub profiles and a short blurb on what you're interested in and looking for in a startup experience","time":1357073593,"type":"comment"},{"by":"peplin","id":5004287,"kids":[5004296],"parent":4992617,"text":"Ford Motor Company - Silicon Valley Research Lab (<a href=\"http://fordsvl.com/careers/software.html\" rel=\"nofollow\">http://fordsvl.com/careers/software.html</a>) - Palo Alto, CA<p>We're the team behind OpenXC (<a href=\"http://openxcplatform.com/\" rel=\"nofollow\">http://openxcplatform.com/</a>) and are growing out new research lab in Palo Alto. The current opening is for a software engineer with a broad range of talents.<p>For example we're currently working on mobile applications (Android), embedded computing (Arduino, chipKIT, PIC32, ARM Cortex M3), web applications (Flask, Django), the CAN bus, NFC and other networking research. We also do a lot of physical prototyping of electronics and housings - we're talking PCB design, 3D printing and the like.<p>The best candidates are those with a few years of experience in a professional environment or new grads with lots of cool projects under their belt. We love open source and are pushing the company in new and more open directions.<p>Don't let the big corporation name scare you away - the research team operates with much of the freedom to experiment of a smaller company, but with the benefits of large corporate backing (eg. if you need it to get your job done, we can buy it).","time":1357243094,"type":"comment"},{"by":"amberdixon","id":5022104,"parent":4992617,"text":"Airtime (<a href=\"http://airtime.com\" rel=\"nofollow\">http://airtime.com</a>) - San Francisco, CA<p>Airtime is looking to hire a software developer who can help us build a platform that brings people closer together by allowing them to have great video conversations over the Internet. We are an early stage startup founded by Sean Parker and Shawn Fanning. Our main office is in NYC, however we are currently looking for a developer for our SF office.<p>The ideal candidate is self-motivated, a fast learner and passionate about building good software. He or she has a strong grasp of computer science fundamentals, experience working across different technologies, and the ability to think critically about problems and choose the right course of action.<p><pre><code>  Requirements:\n  - 2+ years of software engineering experience.\n  - The ability to write high quality code efficiently.\n  - Passion for learning new technologies and the ability to do so quickly.\n  - Understanding of modern web programming practices.\n  - Self-motivated and possessing strong communication skills.\n  - Willingness to travel to New York City.\n\n  Pluses\n  - Experience with Flash/ActionScript3.\n  - Familiarity with video codecs, protocols and wire formats.\n  - Experience developing iOS and Android.\n  - Ability to work with small teams.\n</code></pre>\nYou will be located in San Francisco. You will be working with a small engineering team in San Francisco and a larger engineering team in our main location in New York City. You will be traveling out to New York City periodically to work (and party!) with Airtime NYC.<p>To apply, please visit <a href=\"https://www.airtime.com/jobs\" rel=\"nofollow\">https://www.airtime.com/jobs</a> and follow the instructions at the bottom of the page.","time":1357580451,"type":"comment"},{"by":"ZephyrP","id":5032045,"parent":4992617,"text":"Ruby on Rails/Javascript Developer (Remote resource)<p>We are in search of a talented frontend developer to add to our small  startup team.  An individual with sound technical skills, but more importantly, an appetite to learn new things and help build a really great product for our clients.<p>We are small startup operating out of the New York, San Francisco, and Charlotte areas.  We are developing a multi-tenant reporting platform using MongoDB and Erlang ERTS to deliver information and analytics to our clients (companies, not individuals) in the wealth management industry.  You would be joining the two founding partners and one full-time (SF-based) developer.   We all work remotely and rely heavily on Skype and Google Chat/Hangout to stay in daily contact and to get things done.  We work as a team to define the functional and architectural direction of the platform and we are looking for someone to join!<p>Our web stack is a Rails 3 app talking to a MongoDB backend, with a heavy real time processing component.  At this time we are primarily seeking a frontend resources with firm Javascript experience and a desire to work with our existing technology stack.<p>Please reply to this post or email at info@purveu.com<p>Thanks!","time":1357746432,"type":"comment"},{"by":"bliscio","id":4997015,"parent":4992617,"text":"DaisyBill is in search of talented engineers to help grow our company.<p>We here at DaisyBill live the core values of a start-up: transparency, collaboration, passion, and smarts. We are deeply committed to our company and to our mission--we’re the good guys in our industry (but the kind of good guys who win).<p>We are a small entrepreneurial team with solid financial backing and deep domain expertise. We have a long list of committed customers waiting for the beta launch of our product.<p>Our development process is collaborative and emphasizes sustainable coding practices such as domain-driven design, test-driven development, pair programming, continuous integration, and smart design decisions. We have state-of-the-art continuous integration and continuous deployment infrastructure.<p>Currently we are working out of Pivotal Labs NYC.<p>Our product is based on open-sourced platforms. We have done a substantial amount of open source work and are excited about future open source contributions.<p>You may be a good fit if you have:\n- Experience with test-driven development (\"TDD\")\n- Interest in (or experience with) pair-programming\n- Strong grounding in OOP and SOA principles\n- Git / Github experience.<p>What you will do\n- Develop new user facing features for our incredibly engaged customer base\n- Work closely with the product owners to mold the future of the DaisyBill<p>What DaisyBIll offers...\n- Startup culture\n- Flexible hours\n- Remote possibilities\n- Laid back environment\n- Casual dress\n- Very competitive salary<p>How to apply:\nEmail a copy of your resume, including the position for which you wish to apply, to: careers@daisybill.com . Principals only please!","time":1357139241,"type":"comment"},{"by":"BraintreeR","id":4998527,"parent":4992617,"text":"Menlo Park, CA or Chicago, IL<p>Braintree Payments - FULL TIME Developers, Security Engineers, System Engineers, Desktop Support, and Infrastructure Engineers<p>Braintree powers payments for innovative and high-growth mobile and online businesses. We provide an easy-to-integrate API for developers while ensuring the merchants’ end users have a frictionless and secure experience at checkout. Our full-stack payments solution includes a payment gateway, merchant account, recurring billing, and credit card storage.<p>Our team is talented, our practices are collaborative (pairing, agile), we work on challenging problems (high availability, quality of service, scaling, security), and our devs have 10% time to work on whatever they want. Developers use and love our product. Although we mostly work with Ruby, we also work with Python, Node.js, PHP, Java, .NET, Perl, and Objective-C<p>More about our people, practices, and software: <a href=\"http://www.braintreepayments.com/devblog\" rel=\"nofollow\">http://www.braintreepayments.com/devblog</a><p>Apply at <a href=\"http://www.braintreepayments.com/braintree-careers\" rel=\"nofollow\">http://www.braintreepayments.com/braintree-careers</a>","time":1357153602,"type":"comment"},{"deleted":true,"id":4993009,"parent":4992617,"time":1357059221,"type":"comment"},{"by":"usamahc","id":4993021,"parent":4992617,"text":"ClassDojo (<a href=\"http://www.classdojo.com\" rel=\"nofollow\">http://www.classdojo.com</a>) - FULLTIME in SAN FRANCISCO, CA<p>ClassDojo is an education technology company being used by over 7 million teachers and students to build positive behaviors like creativity, curiosity and persistence in the classroom, using real time feedback. We're a small team of 7, with $1.6mm in funding from some of the best investors in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we're one of the fastest growing education companies of all time. Paul Graham invested in us, but we didn't do YC.<p>In our first year, we've built a product that makes a real difference to the world, and is used by millions of teachers and students every day. We're about to take it to the next level, hopefully with you on board! 2 key people we're looking for:<p><pre><code>  - Full-stack engineer: we use node.js/MongoDB - there are some really interesting challenges to solve as we scale to millions more users every month!\n  \n  - Front-end engineer: you'll use JavaScript and Backbone.js to lead development of a webapp that is already seen and used in more than 100 countries.  \n</code></pre>\nYou can find out more about our work and our culture (and all the perks!) here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a>. If you're a strong hacker who wants to join a strong technical team at the earliest stages of a high-growth startup - and use JavaScript to improve education - you should join us :) you can apply here:<p><pre><code>  --------------------------  \n  \n  https://classdojo.wufoo.com/forms/join-classdojo/  \n  \n  --------------------------    </code></pre>\nOr just drop me an email directly, and we can chat! I'm Sam, one of the co-founders, and its sam@classdojo.com. Looking forward to it :)","time":1357059401,"type":"comment"},{"by":"exiledsorcerer","id":5008020,"parent":4992617,"text":"NoSQL Hadoop Developer - London, UK.<p>NoSQL Hadoop Developer - www.opencredo.com \nLondon Bridge, 60k - £80k per annum + benefits<p>Permanent<p>NoSQL Hadoop Developer<p>OpenCredo is looking for a NoSQL Hadoop Developer. The successful NoSQL Hadoop Developer is required to work with our in-house delivery team developing solutions for a number of our clients in a variety of domains; Finance, Teleco, Media, Publishing etc. This is a rare opportunity to work with some of the top 1% technologists in the industry; published authors, open source committers and track leads at global software development conferences. The successful developer will be working on multiple Cloud (PaaS), NoSQL and Big Data technology related projects.<p>Strong commercial experience and deep technical undestanding of the following;<p>NoSQL / Hadoop / Pig / Hive / Java<p>Experience with one or more of the following technologies;<p>Spring / Scala / Play /  Ruby / Python / Cassandra / Neo4j / MongoDB<p>You should have;<p>Proven analytical and problem-solving abilities\nExperience working in an agile environment\nA track record building large software products\nStrong written, oral, and interpersonal communication skills\nWant to work in an environment using continuous integration and continuous deployment\nStrong client facing and team leading skills.<p>Additionally you should:<p>Be experienced with distributed and large scale software systems\nBe passionate about writing well structured and easy to maintain code\nLove solving complex problems<p>Dont forget to include some of your previous work including but not limited to your blog and/or Github.<p>NoSQL Hadoop Developer - www.opencredo.com","time":1357313737,"type":"comment"},{"by":"dawson","id":4993692,"parent":4992617,"text":"How are you?  – Shoreditch, London. Full-time and onsite.\n(<a href=\"https://howareyou.com\" rel=\"nofollow\">https://howareyou.com</a> &#38; <a href=\"http://ch.com\" rel=\"nofollow\">http://ch.com</a>)<p>– a venture funded and internationally award winning healthcare startup, based in Cambridge, Beijing and now London. Winner of the most prestigious Institute of Engineering and Technology Innovation Award for best IT Technology and HealthInvestor Award for IT innovator of the year.<p>We're seeking 6 Ruby Engineers (£50k-£90k), 1 UI/UX Designer (£40k-£50k), 1 Front-End Developer (£40k-£50k) and 1 Objective-C Developer (£50k-£80k).<p>You will be working from our new London warehouse with great natural light and lovely period features, including a table tennis-table, free-vend food and drink machines, arcade machines and a bar and break-out lounge fitted with a serviced kitchen and antique Queen Anne Wing leather chairs – situated in the heart of the tech start-up scene near the Old Street roundabout and only 5 minutes walk from Old Street Station.<p>For more information, please email gerhard@ch.com","time":1357069917,"type":"comment"},{"deleted":true,"id":5050913,"parent":4992617,"time":1358090625,"type":"comment"},{"by":"kingrolo","id":4992848,"parent":4992617,"text":"London, UK. (INTERN ok)<p>Django Developers at Wildfish, <a href=\"http://wildfish.com\" rel=\"nofollow\">http://wildfish.com</a><p>We're an independent London based Django consultancy looking to expand our team.  We work on web applications for startups, other clients, and our own hairbrain schemes.  We've mostly been working with freelancers, but are now looking to start putting together a permanent team to take things to the next level.  We're all developers, so understand the things which are important and which aren't.<p>Our office is in London Bridge, so you'll need to be within occasional commute distance of there, but a mixture of remote on site work seems to work best for most of us, so that's fine too.<p>These are some of the technologies we're working with, so please mention any experience, skills or interest in any of them:<p>- Python\n- Django\n- Testing (TDD, nose, django-webtest, factory-boy)\n- gevent, gevent-socketio\n- Ubuntu Linux server admin (Linode, AWS, Fabric, Salt, Nginx)\n- PostgreSQL, Redis\n- Django CMSs (Django CMS 2, FeinCMS, Mezzanine, others)\n- HTML/CSS/Bootstrap\n- Javascript (and any frameworks)<p>It's more important that someone can demonstrate they know their stuff rather than have lots of commercial experience necessarily, so please include any links which might show that (other projects/Github/HackerNews/SO, etc).<p>We'd also like someone who's interested in helping us build the profile of the company but contributing back to the community, including paid time contributing to open source projects, writing blog posts, and developing our own internal infrastructure or cool things you or we may dream up.<p>Please email contact@wildfish.com with your details and salary expectations.  Would possibly also consider those interested in part time work.<p>Thanks!","time":1357055950,"type":"comment"},{"by":"edawerd","id":4993649,"parent":4992617,"text":"San Francisco, Full-time, Intern and H1B OK<p>Looking for full-stack, Rails + Javascript engineer.<p>ZenPayroll (<a href=\"https://zenpayroll.com/\" rel=\"nofollow\">https://zenpayroll.com/</a>) is building the future of payroll. If you love solving core, foundational problems, we'd love to speak with you.<p>Our founders are second time entrepreneurs from Stanford who have sold two prior companies. We've raised $6.1M from an impressive list investors who believe it's time for payroll to be disrupted, including YCombinator, Google Ventures, Salesforce, and the CEOs of Box, Yammer, Dropbox, YouTube, Yelp, and Philz Coffee (yes, the best coffee in the world). See <a href=\"https://zenpayroll.com/investors\" rel=\"nofollow\">https://zenpayroll.com/investors</a><p>Technologies we use include Rails, Backbone, MySQL, and CoffeeScript. We are test-driven, using RSpec and Jasmine.<p>Company benefits include:<p><pre><code>  - Free breakfast, lunch and dinner.\n  - Open vacation policy. We don't count days.\n  - Buy or build your ideal work environment.\n  - Fitness stipend.\n  - A sunny, top floor office space.\n  - Housing stipend if you live near the office.\n  - Competitive salary and equity package.\n  - Health, dental and vision benefits.\n</code></pre>\nPositions we are hiring for:<p><pre><code>  - Software engineers. \n  - Payroll compliance experts. \n  - Marketing and sales. \n  - Customer support\n</code></pre>\nFor a full list of requirements for the positions, please visit: <a href=\"https://zenpayroll.com/careers\" rel=\"nofollow\">https://zenpayroll.com/careers</a><p>To apply, email jobs@zenpayroll.com and include (1) your LinkedIn and resume (github as well if you are applying for a software position), (2) a note on why you are interested in ZenPayroll, and (3) share with us something you've done which you are most proud of.","time":1357069236,"type":"comment"},{"deleted":true,"id":5027128,"parent":4992617,"time":1357665193,"type":"comment"},{"by":"Faerris","id":5008373,"parent":4992617,"text":"LiquidPlanner | Seattle, WA<p><a href=\"https://www.liquidplanner.com/\" rel=\"nofollow\">https://www.liquidplanner.com/</a><p>-------------------------------------------<p>Hey everyone! We're a profitable online project management software company that sits perfectly between lighter weight task-management apps and Microsoft Project.<p>We're hiring like gangbusters and have some great openings that we think the HN community would be interested in:<p><pre><code>  - Program Manager\n\n  - Software Development Engineer (x2)\n\n  - Marketing Communications Technical Writer\n\n  - Account Coordinator\n</code></pre>\nOur benefits include (but are certainly not limited to):<p><pre><code>  - A competitive salary\n\n  - Full benefits, including medical, dental, vision, and life insurance coverage\n\n  - 401(k) plan\n\n  - Four weeks paid vacation\n\n  - A super casual and fun work environment\n</code></pre>\nFor complete details on these roles, come read our Careers page here: <a href=\"https://www.liquidplanner.com/careers/\" rel=\"nofollow\">https://www.liquidplanner.com/careers/</a><p>You can also send your resume and cover letter to jobs[at]liquidplanner.com<p>Thanks!","time":1357317640,"type":"comment"},{"by":"mattdeboard","id":4993118,"parent":4992617,"text":"Courseload - JS/Python/Clojure - Indianapolis, IN - Full-time, US citizenship required, remote OK for the right candidate, relocation assistance<p>Courseload, Inc., is looking for a smart, motivated and disciplined software developer who wants to work someplace they can make an enormous difference in post-secondary education by bringing down costs and increasing accessibility. Our offices sit on one of the most beautiful locations in downtown Indianapolis. The work environment is relaxed; no one much cares when or where you get the work done as long as it's high quality and delivered on time.<p>Our tech stack is mostly (client-side) Javascript &#38; Python, with some C# services being replaced gradually by Clojure (JVM variety). New hires will join our very small product development team and have the chance to make an immediate impact.<p>You can either visit <a href=\"http://courseload.com/jobs\" rel=\"nofollow\">http://courseload.com/jobs</a>, email careers@courseload.com or contact me at the email listed in my profile if you have any questions.","time":1357060891,"type":"comment"},{"by":"ascorbic","id":4996240,"parent":4992617,"text":"Triggertrap (<a href=\"https://triggertrap.com\" rel=\"nofollow\">https://triggertrap.com</a>) | Bristol, UK; London, UK; Worldwide<p>We’re a profitable, bootstrapped startup hiring our first employees. We're working on exciting projects, and offering competitive salaries and generous options packages.\nPositions available now (<a href=\"http://tri.gg/job\" rel=\"nofollow\">http://tri.gg/job</a>):<p>• Lead iOS Developer: Bristol<p>• Lead Android Developer: Bristol<p>• International Sales Director (photography industry): Worldwide<p>• Community manager: London<p>• Operations manager: London<p>We were born from a wildly successful Kickstarter project in July 2011, and began trading properly in May 2012.<p>We started with the TTv1 and Triggertrap Shield: Arduino-based devices that give amazing results for high speed and timelapse photography.<p>Since then we’ve added Triggertrap Mobile, a combination of hardware and mobile apps that lets you trigger your SLR from your smartphone in 14 different ways. This shot into the top 5 in the App Store charts, and has now been downloaded hundreds of thousands of times.<p>Apply here: <a href=\"http://tri.gg/job\" rel=\"nofollow\">http://tri.gg/job</a>","time":1357128002,"type":"comment"},{"by":"gpodio","id":4999858,"parent":4992617,"text":"Copenhagen, Denmark - Podio (Citrix) - Senior Backend Developer<p>We are looking for a full-time backend developer to join the small but amazing Podio team in beautiful Copenhagen.<p>Podio, now part of Citrix, is a collaborative work platform that is already empowering hundreds of thousands of people to work the way they want to by building their own apps, without any technical skills. See <a href=\"https://company.podio.com/\" rel=\"nofollow\">https://company.podio.com/</a> for more info.<p>The Role: You’ll be working on extending and scaling the Podio API, on top of which the whole Podio web app, the iOS and Android clients and the thousands of 3rd party clients are built. The challenges are many, both in terms of complexity (data model, business rules, 3rd party integrations, security, ...) and scalability (thousands requests per second, hundreds of thousands users, many millions of apps, tasks, items, ...).<p>The stack: Python, MySQL, SQLAlchemy, Cherrypy, Celery, RabbitMQ, Memcache, ElasticSearch, Nginx, Chef, Jenkins and a whole lot more for the frontend and mobile clients.<p>Our ideal teammate:<p>- Has many years of relevant industry experience in building and deploying large systems; start-up experience is a plus.<p>- Has hands-on experience with at least some of the technologies we use. Still we recognise that the best candidates will be able to learn quickly, so if you have scaled big platforms before, we’d love to talk to you.<p>- Enjoys working in a lean, agile, test-driven environment.<p>- Understands and is passionate about technology and keeps on top of trends.<p>If you're interested feel free to get in touch (email at profile) or apply directly at <a href=\"https://company.podio.com/seniorbackenddeveloper\" rel=\"nofollow\">https://company.podio.com/seniorbackenddeveloper</a>.","time":1357167401,"type":"comment"},{"by":"cvinson","id":5034637,"parent":4992617,"text":"Montreal (or REMOTE)<p>Bandzoogle is looking for an experienced, well rounded Rails developer to join the our dev team. Our app powers tens of thousands of artist websites, and helps them make a living by selling their music and growing their fan base. We've been \"bootstrapped, profitable, and proud\" since 2003 and were just named one of the 100 fastest growing companies in Canada.<p>As a core member, you'll have varied and challenging projects to work on, from building new e-commerce features, launching in new markets, building mobile solutions, and more.<p>Why work with us?<p>- A great salary plus generous performance bonuses.<p>- A fast paced startup atmosphere, with the stability of an established, profitable company.<p>- A family-friendly schedule -- no overtime or weekends.<p>- Health insurance for US and Canadian employees.<p>- Reimbursement of home office expenses, computer, and use of co-working spaces.<p>- A $1,000 education expense account; reimburse books, conferences, whatever you want to learn about.<p>- Yearly meet-ups in fun locations, family included!<p>Full job post here: <a href=\"http://bandzoogle.com/jobs/\" rel=\"nofollow\">http://bandzoogle.com/jobs/</a>","time":1357779502,"type":"comment"},{"by":"saumil07","id":4994069,"parent":4992617,"text":"LocBox, San Francisco. Frontend Engineer, Rails Developer, Data Scientist, Inside Sales Representative. Relocations Welcome, H1B Transfers Welcome.<p>More at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a> and <a href=\"http://www.techcrunch.com/2012/10/31/locbox-series-a/\" rel=\"nofollow\">http://www.techcrunch.com/2012/10/31/locbox-series-a/</a>.<p>I’m CEO at LocBox (<a href=\"http://www.getlocbox.com\" rel=\"nofollow\">http://www.getlocbox.com</a>) and we are looking to work with great folks that share our mission - empowering local businesses to generate sustainable revenue from their best customers. We want to do it with Data, Algorithms and Design in a space that has traditionally lacked all three but is finally turning the corner (and fast).<p>Most local businesses resort to unsustainable daily deals or boring Email Marketing to acquire and retain customers. We reject that status quo and our hundreds of (paying) customers agree. We’ve also developed a new search/crawl/tech-centric way of acquiring our own customers and disagree with the obsolete feet-on-street Sales model. The company is very small but generating material and predictable revenue; net revenue growth has exploded in the last 2 quarters.<p>Our tech/product team is 6 at the moment and the company as a whole is 11; we're looking to at least triple the tech team size in the next 6 months. The tech stack is standard-issue Rails/HTML/CSS/JavaScript and is deployed on AWS. The product and tech team operates on 2 week sprints and there's a decent bit of Halo-playing and beer-drinking at the completion of sprint milestones.<p>We also just launched with a $5.1M Series A in the press w/ TechCrunch, AllThingsD, GigaOm and VentureBeat.\nReady to talk to us? I'm saumil at getlocbox dot com and at <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a>.","time":1357075722,"type":"comment"},{"by":"MrMike","id":5022761,"kids":[5027813],"parent":4992617,"text":"SHIFT (<a href=\"http://www.shift.com\" rel=\"nofollow\">http://www.shift.com</a>) is hiring in our Santa Monica office.<p>1) Front End Developer (<a href=\"http://jobs.shift.com/apply/BWRv4y/Front-End-Developer.html\" rel=\"nofollow\">http://jobs.shift.com/apply/BWRv4y/Front-End-Developer.html</a>)<p>We are looking for a Front-end developer that will be a pivotal member of our team. You will be working closely with our backend engineers &#38; design team to help implement a fully AJAX/HTML5 driven application using AngularJS. A great fit for this role is someone who is always intrigued by new technology and is constantly finding better ways to write beautiful, shareable and solid code.<p>2) Back End Developer (<a href=\"http://jobs.shift.com/apply/bAVkng/Back-End-Engineer-Python.html\" rel=\"nofollow\">http://jobs.shift.com/apply/bAVkng/Back-End-Engineer-Python....</a>)<p><pre><code>  - Extensive experience with Python 2.7\n  - Experience with various DBs (We use MongoDB, Cassandra, and Redis)\n  - Experience with architecting &#38; optimizing code for performance and resource management\n  - An understanding of how/when/why to use backgrounding via Celery tasks\n  - Experience with or a desire to learn TDD\n  - An understanding and love for the DRY principle.\n  - A positive attitude and enjoy working in a team environment\n  - Thorough knowledge of MVC frameworks (We use Flask; while experience with Flask is a plus, it’s not required)\n  - Thorough knowledge of various debugging methods\n  - A strong desire to keep learning (we move fast, use cutting-edge tech, and constantly have “ah-ha” moments solving complex problems)\n  - A personality that balances humor, maturity, professionalism, motivation/drive and the ability to hang shot for shot when we drink (unless you really, really don’t want to)\n\n</code></pre>\nRead about some of the awesomeness that we do here: <a href=\"http://tech.shift.com\" rel=\"nofollow\">http://tech.shift.com</a>","time":1357587745,"type":"comment"},{"by":"steiza","id":4997320,"parent":4992617,"text":"Olark - Palo Alto, CA; Ann Arbor, MI; remote ok - Full Time<p>### Who is Olark?<p>Simply, we're the people that put live chat on thousands of websites across the Internet.<p>More than that, we're helping businesses scale their personal touch to the Internet, as the lines between customer discovery, sales, and support blur.<p>### Who are we looking for? (details on <a href=\"http://www.olark.com/jobs\" rel=\"nofollow\">http://www.olark.com/jobs</a>)<p>- Ruby on Rails Engineer / Architect: you've worked before on an at-scale Rails app and love making it easier for our customers to use our app and make it easier for your fellow developers to contribute improvements.<p>- Graphic Designer: you'd like to apply your understanding of both functionality and aesthetic to improve our website and chat window.<p>- Marketing Communications: you'll help us educate the world about how the meaning of customer service is changing<p>### What's our culture like?<p>- Our all-hands retreat in August combined team outings (winery tours / biking / canoeing) with talking about the future of interacting with customers and how we were going to change it.<p>- Engaging with our customers! At conferences, answering e-mailed questions, and (of course) chatting with them on Olark. Interacting with our customers has repeatedly gave us insights that couldn't have come from simply writing code.<p>- We have project-based teams that shift (roughly) quarterly. We want to give our teams enough time to make sizable changes, but experience has taught us that iterations need an end date so we can collect feedback from real-world usage.<p>### How to apply<p>For more details and to contact us, check out <a href=\"http://www.olark.com/jobs\" rel=\"nofollow\">http://www.olark.com/jobs</a>","time":1357142794,"type":"comment"},{"by":"Katelyn","id":5023826,"parent":4992617,"text":"Care.com (Matrix, Trinity Ventures funded) is hiring an ios developer to join a small, fast-paced mobile team within care.com to lead our iPhone and iPad developments.<p>This is a lead iOS engineer position for you to grow into as we grow our iOS efforts.<p>You'll be leading iOS development for Karoo (<a href=\"https://itunes.apple.com/us/app/karoo/id544368641?mt=8\" rel=\"nofollow\">https://itunes.apple.com/us/app/karoo/id544368641?mt=8</a>), and for our flagship app, Care.com that isn't in market yet because you'll be helping us build it).<p>You'll be working with a talented, fun and passionate team of individuals in a company that offers great benefits and compensation packages.  We're also looking for an iOS designer.<p>Email or tweet me if interested: kfriedson@care.com / <a href=\"http://twitter.com/kfriedson\" rel=\"nofollow\">http://twitter.com/kfriedson</a><p>More about the role: <a href=\"http://www.care.com/careers-p1089.html#SeniororPrincipalSoftwareEngineerMobileiOS\" rel=\"nofollow\">http://www.care.com/careers-p1089.html#SeniororPrincipalSoft...</a>","time":1357599776,"type":"comment"},{"by":"huntero","id":5050915,"parent":4992617,"text":"Alcorn McBride | Full-Time | Orlando, FL<p>Hardware/Software Design Engineer<p>We develop audio, video, lighting, and show control systems for themed entertainment. You'll find our equipment in the world's biggest theme parks, museums, and attractions. We're looking for someone with general knowledge of Digital Video technology and Video Compression. RTOS/Embedded software experience is ideal.<p>It's amazing to see the things our creative customers do with our equipment, and it's exciting to work on next-generation tools and hardware to enable our customers to create the \"next-big-thing\". You'll wear a lot of hats(today I'm bouncing between debugging a PC application and working on an FPGA design), but your primary focus will be on our video products. If you'd like to chat about it, my contact info is in my profile.<p>For more details and to apply, you can check out the job listing on our website: <a href=\"http://alcorn.com/alcorn-mcbride-jobs/\" rel=\"nofollow\">http://alcorn.com/alcorn-mcbride-jobs/</a>","time":1358090648,"type":"comment"},{"by":"jack7890","id":4992715,"kids":[4992740,4993819],"parent":4992617,"text":"SeatGeek - New York, NY - Fulltime, on-site<p>We're ticket search engine (i.e. \"Kayak for sports/concerts\").<p>⇒ iOS Developer: Looking for someone to lead the development of our iOS apps: <a href=\"http://goo.gl/a9QKN\" rel=\"nofollow\">http://goo.gl/a9QKN</a><p>⇒ Android Developer: Looking for someone to lead the development of our Android app: <a href=\"http://goo.gl/tW3y4\" rel=\"nofollow\">http://goo.gl/tW3y4</a>","time":1357053318,"type":"comment"},{"by":"thackerhacker","id":5001553,"parent":4992617,"text":"ASOS (Camden Town, London) - Senior .net Developers - ASOS Marketplace<p>ASOS.com is a leading and fast growing online fashion retailer. ASOS Marketplace launched 2 years ago with the aim of building a \"Global Fashion Democracy\"; a platform to allow anyone, anywhere to sell fashion. It was a greenfield project and has been carefully cultivated inside and out to provide a great experience for buyers, sellers, its developers and business users alike.\nMarketplace is now at a turning point and 2013 is going to be a big year for the site. We're looking for talented C# devs to help us take it to the next level.<p>In many ways we operate like a startup. We use:\n- ASP.NET MVC - SQL Server - MongoDb - Solr - NServiceBus - Castle Windsor - \nJQuery - Mercurial - agile - with a lower case \"a\"<p>Sound interesting? Apply at <a href=\"http://careers.stackoverflow.com/uk/jobs/28319/senior-net-engineer-asos-marketplace-asos-com\" rel=\"nofollow\">http://careers.stackoverflow.com/uk/jobs/28319/senior-net-en...</a>","time":1357204620,"type":"comment"},{"deleted":true,"id":4994040,"parent":4992617,"time":1357075376,"type":"comment"},{"by":"stevem-newrelic","id":4997462,"parent":4992617,"text":"New Relic - Portland OR/Seattle WA/San Francisco CA (<a href=\"http://newrelic.com/jobs\" rel=\"nofollow\">http://newrelic.com/jobs</a>)<p>We make the best application performance monitoring solution, and deliver the first serious SaaS APM. It gives deep visibility in production apps running on Ruby, PHP, Python, Java, and .NET (with more platforms on the way).  Making it easy for our users, however, is hard work.  Our answer is to hire top notch people and then turn them loose to solve tough problems.<p>We're looking for a number of technical positions (check out the Jobs page), including engineers with skills in Ruby, Node, Python, C, PHP, .NET (to name a few). H1-Bs welcome.<p>We also take our company culture seriously -- Best Place to Work and all that, of course.  But we also provide an unusual and exciting development environment, one where managers are working to enable developers, not the other way around.<p>Come take a look.  <a href=\"http://newrelic.com/jobs\" rel=\"nofollow\">http://newrelic.com/jobs</a>","time":1357144516,"type":"comment"},{"by":"wahnfrieden","id":4994159,"parent":4992617,"text":"Canvas Networks // NYC // FULLTIME<p>Canvas Networks (USV Funded) is looking for an iOS tech lead to join a small, close team building the rich-media community platform of the future. We're working on some new innovations in mobile, and we want someone to help us build it. This is a lead iOS engineer position for you to grow into as we grow our iOS efforts.<p>To help us iterate and continue momentum, we practice continuous deployment to the extent possible, which presents some unique challenges with native Objective-C / Cocoa apps. On our backend servers, we ship twenty times a day – Apple makes things more complex but it's a spectrum we're interested in improving.<p>Free lunch, flexible hours, one of the biggest arcades in Manhattan (3 cabinets!), competitive salary and full benefits (health, dental, vision), take-what-you-want vacation.<p>Our office is in Union Square, Manhattan. If you don’t live in New York City, we’ll pay to fix that.<p>Shoot an email to jobs@canv.as with your resume, portfolio, and github if you have one.","time":1357077239,"type":"comment"},{"by":"maxaf","id":4993837,"parent":4992617,"text":"New York, NY (Midtown East) - full time. <a href=\"https://www.novus.com/careers.php\" rel=\"nofollow\">https://www.novus.com/careers.php</a><p>Novus is seeking generalist hackers to help us build the real-time financial analytics platform that helps institutional investors take better care of capital.\nWe're using Scala, Akka, MongoDB and a slew of other open source tech. Novus offers a productive and gratifying work environment that fosters learning &#38; collaboration, and promotes shipping often and doing the right thing as often as possible.<p>We give back to the community by means of our open source projects. Check out <a href=\"http://nvd3.org/\" rel=\"nofollow\">http://nvd3.org/</a> (beautiful SVG graphs) and <a href=\"http://novus.github.com/salat/\" rel=\"nofollow\">http://novus.github.com/salat/</a> (fast Scala-MongoDB serialization) for some of our internal libs that we've made available to everyone.<p>If you're interested in knowing more about us, shoot me an e-mail: max at novus dot com","time":1357071939,"type":"comment"},{"by":"indymike","id":4993451,"parent":4992617,"text":"Indianapolis, IN (full-time, intern)\nDirectEmployers - <a href=\"http://directemployers.org\" rel=\"nofollow\">http://directemployers.org</a>\n--------------------------------------------\nWe are a not for profit that builds job boards, regulatory compliance solutions, career marketing solutions and job syndication networks. Everything we do is designed to lower the cost of making hires market wide.  Some of our software is open source and we are aggressively creating new open source projects. Our job board network includes over 10,000 .Jobs domain sites, us.jobs the National Labor Exchange which is the official job sharing network used state workforce agencies.<p>All positions are at our Indianapolis, IN location:<p>Software Developer - Python, Java, .NET all needed. Experience with large database applications, Solr and Django a plus.<p><a href=\"http://directemployersfoundation.org/careers\" rel=\"nofollow\">http://directemployersfoundation.org/careers</a>","time":1357066200,"type":"comment"},{"by":"andygeers","id":5002695,"kids":[5008436],"parent":4992617,"text":"Hubbub - London or Remote - Full time<p>Hubbub is saving independent food shops by letting people order online when they can't get to the shops themselves. We mask the complexity of ordering from lots of separate shops and allow customers to place a single order online and receive all their weekly shopping in one go. It's good for the shops because it lets them reach a wider audience, and it's good for our busy customers because it allows them to support their local community.<p>We're looking for two developers, who will double the size of our current team, to work on our Rails based website and supporting applications. Ruby experience is a plus, but we're very happy to take on people without direct experience if they know how to learn - our second developer hadn't written any Ruby before starting with us.<p>More details, including how to apply, are at <a href=\"http://developers.hubbub.co.uk/\" rel=\"nofollow\">http://developers.hubbub.co.uk/</a>","time":1357226485,"type":"comment"},{"by":"slicedata","id":5023321,"parent":4992617,"text":"COMPANY<p>- Name: Slice Data<p>- Team: MIT, Berkeley, Google Research, Microsoft Research, IBM Research, Yahoo Research<p>- Investors: a16z, SHV, more<p>- Customers: Fortune 500s down to SMBs<p>- Product: machine learning applications for non-technical users to help their businesses more effectively capture and retain customers<p>- Looking for: smart hackers, ideally strong in data mining, who are also excited to join an early-stage startup and grow with the company<p>RESPONSIBILITIES<p>- Interact with customers, analyze their data, understand their pain points, and develop new product features and new products<p>- Build predictive models using sophisticated algorithms and data extracted from the web and other sources<p>- Develop and operate secure, scalable cloud infrastructure to manage and process customers' large, confidential datasets<p>QUALIFICATIONS<p>- BS/MS/PhD in Computer Science, Statistics, Math or related fields<p>- Ideally experience with analyzing data sets, formulating data problems, and building machine-learned models<p>- Familiarity with Python, Java/Scala, or R preferred<p>CONTACT<p>- <a href=\"https://www.slice-data.com\" rel=\"nofollow\">https://www.slice-data.com</a><p>- hiring@slice-data.com","time":1357593563,"type":"comment"},{"by":"wmeredith","id":4997178,"parent":4992617,"text":"Kansas City Design/Dev Agency: Server-Side Web Application Developer<p>We're hunting a good backend developer. We do a lot of PHP/MySQL work, but if you're a good programmer with other server side experience, feel free to contact us. We're small which means freedom, but you'll also have to take out your own trash and it's not really a cog-in-a-machine kind of deal. We're developing a couple products internally, but we're primarily funded by client work, so it takes priority.<p>We work on dual screen Mac workstations with nice Steelcase chairs. We're closed between Christmas and New Year's. We work hard and wear a lot of hats, but it's a laid back shop.<p>You can see our CraigsList ad here: <a href=\"https://post.craigslist.org/manage/3516242208\" rel=\"nofollow\">https://post.craigslist.org/manage/3516242208</a><p>If you're interested, feel free to contact me directly at wade [at] voltagecreative [dot] com. I'm the agency Project Manager and UX Specialist.","time":1357141336,"type":"comment"},{"by":"Peroni","id":4993689,"parent":4992617,"text":"Globaldev - London, UK: Ruby Engineers &#38; Ruby on Rails Developers - Permanent &#38; Contract<p><a href=\"http://globaldev.co.uk/jobs\" rel=\"nofollow\">http://globaldev.co.uk/jobs</a><p>With a portfolio of over 7,500 sites, we’re the largest social network you’ve probably never heard of. One of the world’s leading social discovery and dating companies, we’re the Facebook for people who haven’t met yet – enabling people to find new friends and partners online for fun and adventure in real life.<p>We’re looking for 2-3 expert Ruby engineers &#38; RoR Developers to help us build a series of major enhancements to our dating platform and infrastructure over the next 12 months. It's a fantastic place to work where you'll be surrounded by incredibly talented developers working on big data problems and we are working hard to ensure we provide the best environment for Ruby/RoR Devs in London.<p>For more info or to apply email me - sbuckley@globaldev.co.uk","time":1357069878,"type":"comment"},{"by":"joealba","id":4993150,"parent":4992617,"text":"Providence, Rhode Island (full-time)<p>Web Application Developer - Ruby on Rails\nRhode Island Interactive / NIC / RI.gov<p>Job Description<p>Rhode Island Interactive would like to add an additional Web developer and DevOps specialist to its small team in Providence, RI. A subsidiary of NIC, Inc. [Nasdaq:EGOV], we make award-winning online services for the state of Rhode Island and manage the RI.gov portal.<p>Working primarily in our office here in Providence RI, you'll be programming in the Ruby language using the Rails framework and test-driven development practices to build complex Web applications. Your applications will have an immediate impact, helping our state government serve its citizens and business efficiently.<p>Skills &#38; Requirements<p>Applicants should have 2+ years experience with Ruby on Rails, be comfortable managing code with git and writing automated tests using RSpec, MiniTest and Capybara. You'll be provided opportunities to build on your current skills, but you get some bonus points for experience with MongoDB, Oracle, Java, Perl, PHP, Puppet. Strong communications skills are also an important trait, as you will be collaborating with our team and state decision makers to map out the best way to bring an offline paper process online.<p>About Rhode Island Interactive / NIC / RI.gov<p>Benefits include a comprehensive health package for employee and spouse/dependents, matching 401k contributions, and attendance to training sessions and conferences. Additional advancement opportunities are available if you are interested in relocating to other NIC operations around the country.<p>How to apply<p>If this sounds like a career you would enjoy, please send a resume and cover letter to rijobs@egov.com. Include URLs and information about projects you have worked on, any open source contributions you have made, and your Github profile or other appropriate CV links as applicable.","time":1357061392,"type":"comment"},{"by":"auston","id":4993123,"parent":4992617,"text":"Miami, FL (full-time, intern)<p>1SaleADay - <a href=\"http://1saleaday.com/\" rel=\"nofollow\">http://1saleaday.com/</a><p>-------------------------------------------------------<p>1SaleADay is the place to shop for deep discounts every day. We curate products for our customers in a few different categories &#38; have been steadily growing since inception.<p>-------------------------------------------------------<p>1SaleADay is looking for a ruby on rails developer to join the web development team. We are looking for a developer with significant know how &#38; curiosity to work on our customer facing website &#38; back office web applications. Your work will be used on multiple devices &#38; third party platforms.<p>As a developer we believe your most important trait should be the ability to deal with ambiguity, followed by a militant discipline for thorough testing. It's also very important that you have great communication skills because you will be acting as your own product manager - requiring you to coordinate with other departments within the organization.<p>If you believe that:\nPHP is a shallow and pendantic\nPassable isn't the same as passing\nThat you can always be improving your body (of work)\nCode clarity is more important than code brevity<p>and you have a proficiency in:\nRuby 1.8+\nRails 2.3+\nDatabase architecture\nSQL Queries\nGem architecture &#38; development\nGIT Version control<p>plus you have familiarity with:\nMongoDB\nQueue systems\nCode refactoring &#38; optimization<p>You should reach out to us!<p>If you have most or all of the above &#38; experience in:\nDeployment Architectures for Ruby on Rails\nJavaScript\nCSS 2 &#38; 3\nXHTML &#38; HTML5\nCSS Frameworks (LESS or SASS)\nUsing Templating Languages (HAML?)\nTwitters Bootstrap Framework<p>-------------------------------------------------------<p>Email us anytime: dev@1saleaday.com","time":1357060999,"type":"comment"},{"by":"bkanber","id":4993291,"parent":4992617,"text":"Tidal Labs (<a href=\"http://tid.al\" rel=\"nofollow\">http://tid.al</a>) -- Anywhere in the US (but we're based in NYC)<p>We're hiring a web developer: PHP, JS, HTML, CSS. Any level of experience is welcome to apply. We don't care if you've never worked pro before, but you'll still need to have built websites (even if just for fun) in order to be considered.<p>Tidal is a syndicated CMS that powers websites for people like Pepsi, Teen Vogue, Lucky Magazine, Details, Bob Vila, and many more awesome brands. We build interactive websites that make lots of people happy.<p>As a team, we highly value learning and growth. We'll make sure you're better tomorrow than you are today, every day.<p>Your job will be to help conceive and implement new features on websites. You'll also be able to interact with our great clients directly, you'll have a high level of autonomy, and you'll really be able to own your work.<p>Email php@tid.al if you're interested!","time":1357063730,"type":"comment"},{"by":"madh","id":4997917,"parent":4992617,"text":"Practice Fusion (<a href=\"http://practicefusion.com\" rel=\"nofollow\">http://practicefusion.com</a>) - San Francisco<p>We're looking for talented engineers who want to revolutionize healthcare with life-saving technology for doctors and patients. We make web-based EMR (electronic medical record) software. We're growing quickly and have over 200,000+ users serving over 50+ million patients are are the #1 EMR in the country. We have great office in the heart of SF and a fantastic company culture.<p>Some of the stack here is ASP.NET/ActionScript, but we're quickly moving headstrong into HTML5 and Javascript. I'm building out a small team that will work on web (HTML5, Backbone.js, Ruby, Rails) and mobile (HTML5, iOS native) apps. We'll also be doing some web scraping and data extraction too.<p>If this sounds like fun, feel free to contact me directly at hparmar [at] practicefusion.com.","time":1357148583,"type":"comment"},{"by":"AdamGibbins","id":4992679,"parent":4992617,"text":"Boston, MA - TIM Group (previously youDevise) are hiring a Senior Linux Sysadmin.<p>We're a 100 person market leading financial software firm with offices in Boston, New York, London and Hong Kong. Rated one of the fastest growing tech companies in the UK by The Sunday Times (<a href=\"http://www.fasttrack.co.uk/fasttrack/leagues/dbtechDetails.asp?siteID=3&#38;compID=3219&#38;yr=2012\" rel=\"nofollow\">http://www.fasttrack.co.uk/fasttrack/leagues/dbtechDetails.a...</a>).<p>We're a continually iterating self managed team doing awesome things with Puppet, MCollective, Ruby, Graphite, Logstash, KVM, MySQL, MongoDB, JVMs and continuous deployments.<p>We'd love to talk to you, please get in contact with any questions.<p>Official job spec: <a href=\"http://www.timgroup.com/careers/current-vacancies/system-administrator-linux\" rel=\"nofollow\">http://www.timgroup.com/careers/current-vacancies/system-adm...</a>","time":1357052434,"type":"comment"},{"by":"fmavituna","id":5020882,"parent":4992617,"text":"Mavituna Security (<a href=\"http://www.mavitunasecurity.com/\" rel=\"nofollow\">http://www.mavitunasecurity.com/</a>) - Anywhere in the world (we're a virtual team - REMOTE)<p>Mavituna Security is a leading innovator in the field of automated security testing and creator of Netsparker: the world's first false-positive-free web application security scanner. (<a href=\"http://www.mavitunasecurity.com/netsparker/\" rel=\"nofollow\">http://www.mavitunasecurity.com/netsparker/</a>)<p>We're looking to recruit a talented and experienced growth hacker who will lead the ongoing development and execution of our growth strategy, both for our established (and profitable) Netsparker business, as well as our new SaaS venture, which will launch very soon.<p>More info: <a href=\"http://www.mavitunasecurity.com/growth-hacker/\" rel=\"nofollow\">http://www.mavitunasecurity.com/growth-hacker/</a>","time":1357566226,"type":"comment"},{"by":"jabbett","id":5004361,"parent":4992617,"text":"ACT.md (<a href=\"http://act.md\" rel=\"nofollow\">http://act.md</a>) - Boston, Massachusetts<p>At ACT.md, we're building web and mobile apps that will transform how patients, their families, and all their medical providers work together to deliver life-saving care. We may even transform American healthcare while we're at it — creating a paradigm shift from the inefficient work of disconnected individuals to the transparent and fine-tuned collaboration of care teams.<p>We're currently a small group housed at the Harvard Innovation Lab, but we're funded and looking to grow the User Experience and Engineering teams. Specifically:<p><pre><code>  - UI engineer (Backbone.js/HTML5/CSS3)\n  - Mobile web developer (your framework of choice)\n  - Back-end engineer (Python/Flask/SQLAlchemy, MySQL)\n</code></pre>\nNitty gritty details are at <a href=\"http://act.md\" rel=\"nofollow\">http://act.md</a><p>Thanks!","time":1357243915,"type":"comment"},{"by":"jefftala","id":5027257,"parent":4992617,"text":"Mobile Developer @ Frank &#38; Oak in Montreal, Canada.<p><a href=\"http://www.frankandoak.com/about/jobs#job12\" rel=\"nofollow\">http://www.frankandoak.com/about/jobs#job12</a><p>RESPONSIBILITIES:<p>Enhance, build, optimize our Frank &#38; Oak mobile application\nEnsure strong optimization and functionality and monitor app technical performance\nWork with our UX specialists to ensure optimal experience\nAnalyze, review, and modify, mobile systems by designing, maintaining, documenting, testing, developing, and monitoring<p>REQUIREMENTS:<p>Bachelor/Master degrees in Computer Science or Computer Engineering is a plus\nSolid knowledge of mobile development technologies (iOS, Android)\nGreat knowledge of web development technologies (PHP, MySQL, JavaScript, HTML)\nAbility to work independently.\nAbility to manage multiple tasks, deadlines and priorities.\nProficiency in both French &#38; English is a plus","time":1357666630,"type":"comment"},{"by":"vikram","id":4996293,"parent":4992617,"text":"Newman Online. London, UK.<p>We are looking for a Python Developer. We allow plenty of home working, but if you do come into the office, you get free tickets to the cinema we work above (and free barista made coffee).<p>There's a lengthy description at <a href=\"https://jobs.github.com/positions/9f7647ee-3c66-11e2-961a-fb3a8870608d\" rel=\"nofollow\">https://jobs.github.com/positions/9f7647ee-3c66-11e2-961a-fb...</a> but in short we want someone with a lot of Python, who isn't scared by legacy code, and who doesn't require managing. We offer a lot of flexibility and freedom for the right candidates.<p>Development is run by developers, so we use sexy technologies when they are appropriate. We let people choose what they want to work on, but sometimes we all have to chip in on the grotty stuff.<p>Do checkout the advert or email us at jobs@newmanonline.org.uk with any questions.","time":1357129182,"type":"comment"},{"by":"seanmccann","id":4994036,"parent":4992617,"text":"San Francisco<p>Intrans<p>Ruby Engineers, Mobile Engineer, interns<p>The last 50 years has seen the reinvention of almost every major industry except for one: Trucking. Intrans is here to change that by deploying the world's first mobile platform for on-demand freight shipping. Over $30 billion dollars a month is spent trucking freight around the US, without it, the country would grind to a halt overnight. In such a massive market, it's hard to believe that the entire industry today still runs on phones and fax machines, but until now, it has. This means hundreds of millions of dollars worth of freight capacity goes unfilled every month due to the old-school inefficiencies of the industry. We are changing that.<p>If you're ready to change the trucking industry, send your resume and GitHub profile to jobs@intrans.com. We're also looking for summer engineering interns.","time":1357075328,"type":"comment"},{"by":"oonny","id":5004213,"parent":4992617,"text":"Touchstorm (<a href=\"http://www.touchstorm.com\" rel=\"nofollow\">http://www.touchstorm.com</a>) - NYC, but can work from anywhere in the USA.<p>We distribute video. You’ll have a clean sheet to play on, a wildly energetic team to collaborate with, and the entrepreneurial excitement that accompanies extreme growth. You’ll also have the stability and project variety that comes from being owned by a fast-growing digital company.<p>This is a great opportunity to help shape the future of video delivery and distribution. We are looking for a Front-end Developer (with PHP knowledge) to join an agile development team working on our consumer facing web applications. We welcome H1B candidates. You can find more details on requirements and how to apply here: <a href=\"http://authjo.bz/j/15403\" rel=\"nofollow\">http://authjo.bz/j/15403</a>","time":1357242445,"type":"comment"},{"by":"auston","id":4994025,"kids":[4994461],"parent":4992617,"text":"Miami, FL (full-time, intern - LOCAL ONLY)<p>1SaleADay - <a href=\"http://1saleaday.com/\" rel=\"nofollow\">http://1saleaday.com/</a><p>-------------------------------------------------------<p>1SaleADay is the place to shop for deep discounts every day. We curate products for our customers in a few different categories &#38; have been steadily growing since inception.<p>-------------------------------------------------------<p>1SaleADay is looking for a ruby on rails developer to join the web development department. We are looking for a developer with significant know how, curiosity &#38; experimental experience to work on our customer facing website &#38; back office web applications. Your work will be used on multiple devices &#38; third party platforms.<p>As a developer we believe your most important trait should be the ability to deal with ambiguity, followed by a militant discipline for thorough testing. It's also very important that you have great communication skills because you will be acting as your own product manager - requiring you to coordinate with other departments within the organization.<p>If you believe that:<p><pre><code>  * PHP is a shallow and pendantic\n  * Passable isn't the same as passing\n  * That you can always be improving your body (of work)\n  * Code clarity is more important than code brevity\n</code></pre>\nand you have a proficiency in:<p><pre><code>  * Ruby 1.8+\n  * Rails 2.3+\n  * Database architecture\n  * SQL Queries\n  * Gem architecture &#38; development\n  * GIT Version control\n</code></pre>\nplus you have familiarity with:<p><pre><code>  * MongoDB\n  * Queue systems\n  * Code refactoring &#38; optimization\n</code></pre>\n-------------------------------------------------------<p>You should reach out to us: dev@1saleaday.com!<p>-------------------------------------------------------<p><i></i><i></i><i></i><i></i>* BONUS SECTION <i></i><i></i><i></i><i></i><i></i>*<p>-------------------------------------------------------<p>If you have most or all of the above &#38; experience in:<p><pre><code>  * Deployment Architectures for Ruby on Rails\n  * JavaScript\n  * CSS 2 &#38; 3\n  * XHTML &#38; HTML5\n  * CSS Frameworks (LESS or SASS)\n  * Using Templating Languages (HAML?)\n  * Twitters Bootstrap Framework\n</code></pre>\n-------------------------------------------------------<p>Email us anytime: dev@1saleaday.com","time":1357075129,"type":"comment"},{"by":"harel","id":4992942,"parent":4992617,"text":"London, UK - Glow<p>Glow is on a rapid growth curve and are currently looking to assemble a super team of great developers to work in our West End office. We’ll do everything we can to make you feel at home. We have fun challenges to offer, playing with big data, scalability, machine learning, analytics, user interface and we're always willing to learn new things.<p>We cook with Python, Javascript, a large dose of other cutting edge technologies and a healthy mix of social and advertising APIs.\nIf you think you can hack it, we'd love to hear from you. You can apply using the \"apply\" button below or email to careers@thisisglow.com<p>A bit more info: <a href=\"http://www.reddit.com/r/london_forhire/comments/150v91/hiring_python_and_javascript_developers_for_a/\" rel=\"nofollow\">http://www.reddit.com/r/london_forhire/comments/150v91/hirin...</a>","time":1357057897,"type":"comment"},{"by":"witten","id":4993216,"kids":[4994841],"parent":4992617,"text":"EnergySavvy - Seattle, WA<p>EnergySavvy is looking to add to an amazing development team working with cutting-edge, modern technologies. Do you love working on challenging software implementation problems? Do you spend your free-time learning new programming languages and contributing to open-source projects? If so, you'll thrive in EnergySavvy's quick-paced, collaborative atmosphere.<p>We're a small but rapidly growing software company with the mission of transforming how energy efficiency is delivered by combining user experience and software technology to deliver software-as-a-service solutions our customers and users love. Our software helps people make their houses more energy efficient, addressing a major source of energy waste in this country that impacts our energy independence and contribution to global climate change.<p>As a software engineer at EnergySavvy, you'll work with Django, Python, jQuery, nginx and PostgreSQL, and deploy your creations early and often to live customers.<p>Requirements:<p>* You're passionate about learning web technologies, and have experience with modern engineering techniques (Mercurial/Git, staging, continuous integration, etc)<p>* You have a Computer Science degree or equivalent with a strong foundation in data structures and algorithms<p>* You have programming experience in one or more of C/C++, Python, Ruby, Javascript, C#/Java\nAbout EnergySavvy<p>EnergySavvy is a Seattle-based software company focused on energy efficiency. EnergySavvy's flagship product, Optix, is an energy efficiency management system that helps utilities achieve their cost-effective savings goals. Optix drives program success by engaging customers, streamlining stakeholder interactions and providing real-time analytics.<p>We have a great team, wonderful customers, supportive investors, and we are growing quickly in a massive and important space. We are an investor-funded company with real customers, real revenues and a reality-based plan to scale. Learn more about EnergySavvy's company and culture.","time":1357062433,"type":"comment"},{"by":"jtwaleson","id":5002148,"parent":4992617,"text":"Mendix <a href=\"http://www.mendix.com/\" rel=\"nofollow\">http://www.mendix.com/</a> (Rotterdam, The Netherlands) is on a hiring spree.<p><pre><code>  Looking for:\n  - Software Development Manager\n  - Devs (JS, C#, Java, Scala)\n  - Cloud Engineers (*nix, Puppet, Python, DNS, HTTP, etc),\n  - System Engineers (Hardware, Networking, etc)\n</code></pre>\nMendix is a fast growing Agile PaaS (100%+ per year revenue growth for the last 7 years) with HQ in Boston and R&#38;D in Rotterdam.<p>We're not some startup that's hoping to score a big hit, we're trying to change the world of software development.<p>If you've read \"Blue-collar knowledge workers will save the economy\" (<a href=\"http://seldo.com/weblog/2012/08/30/software_developers_can_save_the_economy\" rel=\"nofollow\">http://seldo.com/weblog/2012/08/30/software_developers_can_s...</a>), well, that's basically what we are doing.<p>We cater mostly to large businesses and deliver applications through our network of partners.<p>We're looking for a Software Development Manager to orchestrate R&#38;D (25+ people) and report to the CTO.<p><pre><code>  You should:\n  - have a hands-on mentality\n  - be a great fit with the team\n  - have at least 10 years of experience in software\n   engineering, including hands-on programming skills\n  - think that Agile/SCRUM is a good idea\n  - speak Dutch\n</code></pre>\nThis is a tough job but the salary will match.<p>We're also looking for very good developers / system engineers.<p>We work with the languages listed above, but if you're very good you can probably learn them soon enough.<p>Our team is great and we've had multiple international developers, however, relocation is required.<p>You can contact jobs@mendix.com and find more information at <a href=\"http://mendix.com/jobs\" rel=\"nofollow\">http://mendix.com/jobs</a><p>If you are interested in delivering applications using our platform: we have jobs for that in the US (Boston), the UK (Milton Keynes) and The Netherlands. Or you can sign up to become a partner!","time":1357218497,"type":"comment"},{"by":"afletcher","id":4997260,"kids":[4999634],"parent":4992617,"text":"Mediatonic - <a href=\"http://mediatonicgames.com/\" rel=\"nofollow\">http://mediatonicgames.com/</a><p>London, UK - Fulltime<p>Mediatonic is an award winning independent games developer based in Soho, London. We work across a range of different digital platforms (HTML5, Flash, mobile, console) building original games in partnership with the likes of Disney, Cartoon Network, SEGA, Sony, Nintendo, EA, Pixar and Warner Brothers.<p>We use analytics to support the creative process and are looking for a data engineer to help grow our analytics platform. If you have experience working with big data technologies such as Hadoop, Hive and HBase or are passionate about developing in that area then please get in touch.<p>See <a href=\"http://mediatonicgames.com/\" rel=\"nofollow\">http://mediatonicgames.com/</a> for more details.","time":1357142098,"type":"comment"},{"by":"robg","id":4993769,"parent":4992617,"text":"Build the API for brain health<p>Boston -<p>We're developing wearable and mobile technologies to measure and manage the health effects of life, work, and play.\nOur mission is to optimize brain function through personalized analytics and software. Seeking mobile and web developers with a history of shipping.<p>Say hello@neumitra.com.","time":1357070928,"type":"comment"},{"by":"ghotli","id":4994042,"kids":[4994527],"parent":4992617,"text":"------------------------------------<p>Mosaik Solutions | Memphis, TN | Full Time | Relocation Available<p>------------------------------------<p>8 Fortune 100 clients, Growing Stable Company, Great Benefits, Technical Freedom<p>------------------------------------<p>------------------------------------<p>Leader, Teacher, Software Generalist<p>------------------------------------<p>\"looking for a leader that loves to teach, to help solve architectural grade problems, and to help set the bar for technical prowess\"<p>------------------------------------<p>Here at Mosaik Solutions we’re building a platform for making sense of everyone’s big geospatial datasets. For twenty years we’ve been collecting all of the world’s cell coverage information, but for the last three we’ve transformed our business into a full blown software engineering and data visualization shop. Our mission is to provide our clients with quality solutions to their big geospatial data analysis and visualization needs whether they want the raw data analyses, an API, a beautiful infographic, or full blown custom applications that leverage our data, or theirs.<p>We believe that healthy teams are comprised of happy people that all have something exceptional and unique to bring to the table. At this point in our growth we’re looking for another leader that loves to teach, to help solve architectural grade problems, and to help set the bar for technical prowess. We don’t care if you’re experienced with our specific technologies, we just expect that you’re the kind of person that not too long from now you’ll know more about them them than anyone else. If you think this sounds like you (or the person you’re destined to become!), send us an email at hr@mosaik.com with your resume, a short letter, and anything else that would help us understand why you’re so awesome that we should hire you post haste.<p>------------------------------------<p>Ruby, Python, C, EC2, Chef, Backbone, D3, Bootstrap, PostGIS, Cassandra, ElasticSearch, Redis, OpenLayers, Varnish, HAProxy, Mapserver, Mapnik, Logstash, Graphite, Logstash...<p>------------------------------------<p><a href=\"https://workforpie.com/companies/mosaik-solutions/\" rel=\"nofollow\">https://workforpie.com/companies/mosaik-solutions/</a><p><a href=\"http://www.mosaik.com/\" rel=\"nofollow\">http://www.mosaik.com/</a><p>------------------------------------","time":1357075408,"type":"comment"},{"by":"rgovind","id":5000430,"parent":4992617,"text":"Encameo is hiring a front end + iOS/Android mobile app developer. We are looking for someone who has published apps on app store(s). We work on second screen solutions for Hollywood. We target both movies and TVs. We are three co founders (One serial entrepreneur/one software engineer/one executive producer in hollywood). We are currently in talks with TV networks and studios.<p>We are looking for part time employees...location is not a constraint but Bay area is preferred. At this point, we only offer equity as compensation(All of us are currently working for equity)<p>Craigslist ad...<p><a href=\"http://sfbay.craigslist.org/sby/cpg/3511943284.html\" rel=\"nofollow\">http://sfbay.craigslist.org/sby/cpg/3511943284.html</a><p>If you are interested, send me an email (Address in my profile).","time":1357174826,"type":"comment"},{"by":"benporterfield","id":4997266,"parent":4992617,"text":"Software Engineer (San Francisco, Silicon Valley or Santa Cruz)<p>Looker is a Business Intelligence startup that focuses on the intersection of economics and engineering — helping customers use data to achieve success. We believe that businesses can only thrive when information is easily accessible and consistently defined across the entire organization.<p>More about us:<p><pre><code>  - We are an engineering-focused team of 8\n  - Post series A (but still giving great stock grants to the right people)\n  - Based in sunny Santa Cruz, CA\n  - Growing revenue and plenty of runway\n  - We have a product that our customers love. \n    Quote: \"I'd never start another company without Looker!\"\n  - Stack includes JRuby+Sinatra, Java, CoffeeScript/JavaScript, JQuery, SQL, and more\n  - Top tier clients list. Get to know some of the smartest people in the industry \n    and see how they think and operate \n    (after all, we're helping them to think about data)\n</code></pre>\nDoes this sound like you?<p><pre><code>  - Driven to excel in a fast-paced, autonomous, and fun startup environment\n  - Experience shipping exceptional products or projects\n  - A full-stack generalist, proficient in Ruby, Javascript, or equivalent\n  - Ability to quickly pick up new technology and apply it effectively\n  - Well-versed in common front and back-end challenges\n    (scaling, interacting with DB, debugging, REST, MVC, etc)\n</code></pre>\nWhat to expect:<p><pre><code>  - Meaningful equity, competitive salary, healthcare &#38; benefits\n  - Sane work hours and vacation policy - meaning we have no policy. We trust everyone \n    to work in a way that is most beneficial to them and to Looker\n  - Learning first-hand how a startup works (it's a lot more than just code!)\n  - Significant responsibility for architecting, deploying, and \n    maintaining critical features or infrastructure\n  - A genuine passion amongst teammates for helping great\n    companies become even greater through data discovery\n</code></pre>\nNote: We are still stealthy, so currently our web presence is minimal.<p>Interested? Please email ben@looker.com with some information about yourself and we'll get back to you!","time":1357142196,"type":"comment"},{"by":"bound008","id":4995119,"parent":4992617,"text":"Elastic (YC W'11) <a href=\"http://elasticsales.com/about/\" rel=\"nofollow\">http://elasticsales.com/about/</a> and <a href=\"http://close.io/\" rel=\"nofollow\">http://close.io/</a> - Mountain View, CA<p><i>Great team with an opportunity to grow personally and professionally. \n</i>We'll take good care of you ( free lunch and free commute (ridepal.com) from SF )\n<i>Work from home wednesdays!\n</i>Team Activities\n*We believe in working smarter and not harder.<p>Opportunities:\nHackers and Hustlers.<p>If you are passionate about selling or passionate about code, I am not saying you have to join our team. But you should at least come by for lunch and meet us.<p>jason ( my email address is at ) elasticsales ( and then a dot ) com\nor call me at 650-618-3138","time":1357096303,"type":"comment"},{"by":"divshare","id":4992726,"parent":4992617,"text":"Detroit, MI (Remote OK)<p>PHP/Javascript/HTML5 Generalist to Help Lead Startup to Glory<p>A New Chapter<p>DivShare is seeking a driven developer to join the team. A guru on the frontend with chops on the backend. Specifically, HTML5/CSS3 and Javascript on the front and PHP and SQL around back. You will assist with current code troubleshooting while primarily leading development of the reiteration of the service. A great opportunity to work with a creative startup en route to disruption. This is a temp-to-perm position. 30-40 hours a week ongoing; the more the merrier. DivShare is based in the Motor City but you are based anywhere. Pay commensurable with experience. Ideal Pay/Equity split.<p>The Ideal Teammate<p>You meet our prerequisites of being a fast learner who can pick up new frameworks quickly. You are results oriented and passionate about fast, compliant, and functional code. You have an ambition to build something great. You ship fast and often.<p>Your Experience<p>- Proficient in PHP and Javascript\n- Ability to quickly diagnose and resolve PHP and MySQL bugs\n- Large user systems and media streaming\n- XFS, Lighttpd, Apache, Linux, MySQL \n- Building for the mobile web\n- Responsive web sites that gracefully degrade across devices\n- Up-to-date on HTML5 and enthusiastic about implementing the latest standards<p>Bonus Experience<p>- Java\n- PostgreSQL and/or Nginx\n- Payment systems\n- Implementing third-party APIs\n- Building highly scalable architecture<p>Let's Chart New Territory!<p>Play a major role in sailing the ship of an established startup. Advancement encouraged. Let us know what you've done and what you'd like to do.<p>Important: tell us why you would be the perfect fit and what your ideal career looks like. Are you determined to ship good code fast? What are your key strengths? Weaknesses? What's more important, pay or equity or a combination of both? Be honest!<p>Please include a link to your portfolio, github and/or any other code samples or information you find relevant.<p>Let's chat! Mail: divsharellc at gmail","time":1357053508,"type":"comment"},{"by":"alq","id":5028689,"parent":4992617,"text":"Datadog (<a href=\"http://www.datadoghq.com\" rel=\"nofollow\">http://www.datadoghq.com</a>) New York, NY - Full-time python hackers (pandas, scipy, numpy, hadoop), devops engineers (aws, haproxy, cassandra, kafka, redis, etc.) and support engineers.<p><i></i>tl;dr<i></i> We are a monitoring service, processing hundreds of billions of records every day. Hard problems, great team, paying customers, real-time python stack.<p><i></i>What makes us different?<i></i> Datadog is a product for you, developers, webops. So when you join Datadog, you have a strong and direct voice in the making of the product.<p>Interested? Apply at <a href=\"http://jobs.datadoghq.com\" rel=\"nofollow\">http://jobs.datadoghq.com</a>","time":1357681312,"type":"comment"},{"by":"lylo","id":5007213,"parent":4992617,"text":"FreeAgent (<a href=\"http://www.freeagent.com\" rel=\"nofollow\">http://www.freeagent.com</a>)<p>Full Time, Edinburgh UK or remote.\nOpportunities for Ruby Engineers, Operations staff and and Engineering Managers<p>FreeAgent is a cloud accounting web app developed in Ruby using Rails. We're the market leader in the UK with nearly 30,000 paying customers. We have enormous ambition and need smart people to come and help us realise it.<p>We're looking for Ruby Engineers of all levels, Operations staff as well as Engineering Managers, to come and join our outstanding team.<p>If you have experience working on high-traffic commercial web apps, ideally but not necessarily in Ruby, please drop us a line at jobs@freeagent.com.","time":1357299950,"type":"comment"},{"by":"dmgrow","id":4992769,"parent":4992617,"text":"Lucidchart - Salt Lake City, UT<p>Lucidchart is a rapidly growing tech startup looking for great backend software engineers to join us at our headquarters in Utah. At Lucidchart, we build killer graphical web applications requiring highly available, secure and scalable backend services. Talent and ability to learn are more important than years of experience. You may have seen Lucidchart demoed during the second Google I/O 2012 keynote:<p><a href=\"http://t.co/sd6GgZvy\" rel=\"nofollow\">http://t.co/sd6GgZvy</a><p>We're hiring BACKEND SOFTWARE ENGINEERS. Lucidchart runs with various decoupled services in a Linux environment using Scala, PHP, MongoDB and MySQL. At Lucidchart, your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly reliable and scalable.<p>Requirements:<p>* Talent<p>Recommended experience:<p>* Have built large products / applications<p>* Scala or Java<p>* PHP<p>* MySQL or other relational database<p>* NoSQL databases (MongoDB especially desirable)<p>* Opscode Chef or Puppet<p>* Cloud computing (AWS)<p>We're also hiring FRONTEND SOFTWARE ENGINEERS. We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements:<p>* Talent<p>Recommended experience:<p>* Have built large products / applications<p>* Javascript<p>* Google Closure compiler/library<p>* CSS/HTML/DOM manipulation<p>* jQuery<p>* node.js<p>* Native app development on Android and/or iOS<p>* Facebook APIs<p>All applicants email resumes to jobs@lucidchart.com.","time":1357054362,"type":"comment"},{"by":"nbclark","id":4994016,"parent":4992617,"text":"San Francisco, CA (full-time)\nDoubleDutch - <a href=\"http://doubledutch.me\" rel=\"nofollow\">http://doubledutch.me</a><p>We're looking for ambitious iOS/Android/web/backend developers to help bring mobile to the enterprise.\nWe offer competitive salaries and equity (of course), but also offer a great work environment based out of the Mission.\nWe already have top technology companies using our software (Cisco, HP, Adobe, etc.) and are looking to get our software in the hands of as many professionals as we can.<p>To learn a little more, visit <a href=\"http://doubledutch.me/about\" rel=\"nofollow\">http://doubledutch.me/about</a>, or email me directly at nclark _at_ doubledutch.me<p>Thanks!","time":1357075048,"type":"comment"},{"by":"pretzel","id":4993805,"kids":[5000360],"parent":4992617,"text":"QuBit - London<p>We just got our Series A (and got the founder of Business Objects, Bernard Liautaud on our board) and are looking to bump up our Eng team! We're hiring across the board: <a href=\"http://www.qubitproducts.com/about/jobs/\" rel=\"nofollow\">http://www.qubitproducts.com/about/jobs/</a> (Email careers@qubitproducts.com and mention that you came from Hacker News)<p>If you want to help the biggest companies in the UK (and soon the world!) figure out exactly what they should be doing with their web sites, and do interesting things with the most complete data set about visitors interactions with them, come talk to us! It's going to be a great year.","time":1357071312,"type":"comment"},{"by":"LD82736","id":4998597,"parent":4992617,"text":"Palo Alto, CA<p>imo.im FULL TIME and INTERN Software Engineers<p>Based in Palo Alto, imo is a fast growing startup founded and funded by one of the first 10 employees at Google. We’re building products that help millions of people around the world connect with their friends and make new friends.\nWe’re a closely-knit team made up mostly of engineers including top TopCoders, ACM ICPC World Finalists and medalists of the International Olympiads in Informatics. Our team is highly motivated, hardworking and loves to solve problems. At imo, you will be challenged and inspired daily.<p>Apply at <a href=\"http://imo.im/jobs\" rel=\"nofollow\">http://imo.im/jobs</a>","time":1357154302,"type":"comment"},{"by":"martian","id":4999335,"parent":4992617,"text":"San Francisco - Thumbtack - Software Engineer<p>Thumbtack is Amazon for services. A quarter of a million businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. Unlike many startups, we're well on our way to being profitable.<p>Our small team is dedicated to excellent engineering and design. We eat meals together everyday cooked by an in-house chef. We work in a beautiful old warehouse in SOMA.<p><a href=\"http://www.thumbtack.com/engineering\" rel=\"nofollow\">http://www.thumbtack.com/engineering</a> and <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Email chris at thumbtack with questions.","time":1357161131,"type":"comment"},{"by":"oztune","id":4993318,"parent":4992617,"text":"New York, NY (full-time)\nappFigures <a href=\"http://www.appfigures.com\" rel=\"nofollow\">http://www.appfigures.com</a><p>If you're an app developer it's likely you already know us. We're a small, self-funded team creating the best tools for developers and researchers to analyze the app stores.<p>We are growing at a rapid pace and are searching for:<p>- A lead front end developer with expertise in js, css, html, and working knowledge of front end libraries such as Backbone.js and Angular.js.<p>- An experienced customer support representative who knows how to make people smile.<p>To apply please visit <a href=\"http://www.appfigures.com/jobs\" rel=\"nofollow\">http://www.appfigures.com/jobs</a>","time":1357064085,"type":"comment"},{"by":"jconnolly","id":4992807,"parent":4992617,"text":"The Ladders - New York City<p>Looking for full time on-site developers.<p>We hire passion, not skills.  If you'd describe yourself as a polyglot, prize code quality and clarity, please do get in touch.<p>Some tech we use across our company:\nJava, Scala, Backbone.js, Storm, RabbitMQ, Puppet, Sass, Responsive Design, Objective-C and on and on.\nIdeal candidates probably have at least 5-7 years experience<p>Here's the \"job description\", if you are interested, you can email me directly: jconnolly@theladders.com<p>--<p>We’re looking for a few good programmers to join our team and help us achieve our mission of “the right person for the right job.”<p>Instead of giving you a list of buzzwords to describe the role, we’ll tell you about a project we started recently:\nA few months back, a small team of engineers and designers at The Ladders got together to design a new product. We started off by interviewing some of our customers to learn about their needs. Using that information, we held design studios and brainstorming sessions to flesh out what the actual features and user experience would be like.<p>On the front-end, we decided to build a new Javascript-powered rich UI using responsive design techniques. Many people are working on responsive design for content-based sites, but few are doing it for browser-based applications.\nOn the back-end, we designed an Event Driven Architecture that makes use of Event Sourcing. Instead of updating a relational database in-place when things change, we store a series of discrete application events. We can then replay those events to create the state of the world at any point in the past, right up to the present. (Yes, we’ve built a time machine!)<p>Does this sound like the sort of thing you’d like to do? If it is, we’d like to hear from you.<p>In return for your passion and commitment to code quality, you’ll enjoy an awesome work environment with perks like: Unlimited vacation days! Yes, unlimited! Quarterly hackathons A game room and a well-stocked kitchen Exciting events including holiday parties, picnics, talent shows, pumpkin carving and more Company sponsored athletic teams Competitive salary, bonus and stock options Health/Dental/Vision Insurance, 401K","time":1357055262,"type":"comment"},{"by":"tow21","id":4996276,"kids":[4996916],"parent":4992617,"text":"Timetric is looking for python/django/javascript/devops engineers to help us build the best data visualization platform available anywhere.<p>We're a small, motivated team. We've spent a lot of effort getting rid of process, and I've never been in a team which can deploy faster or more frequently.<p>And we're backed by a solid sales team who know how to get users for our products (and pay the bills!)<p>We want smart, interesting people with a passion for making usable systems.<p>There are job descriptions at <a href=\"http://timetric.com/about/jobs/\" rel=\"nofollow\">http://timetric.com/about/jobs/</a> - or just email us at jobs@timetric.com","time":1357128894,"type":"comment"},{"by":"gduffy","id":4992758,"parent":4992617,"text":"Dropcam, San Francisco, CA. Full-time and intern (onsite only). <a href=\"https://www.dropcam.com/jobs\" rel=\"nofollow\">https://www.dropcam.com/jobs</a><p>Dropcam's cloud service accepts more incoming video per minute than YouTube. We make a Wi-Fi camera and cloud service that allows users to monitor their home or small business from anywhere in the world using apps for iOS, Android, PC, and Mac.<p>We have some of the most challenging software engineering problems in the world, e.g.:<p><pre><code>  * streaming low-latency, live video over consumer wifi networks\n  * storing up to 30 days of video per camera\n  * analyzing video for significant events (computer vision)\n  * refining a user experience that \"just works\" whether you are sharing babies'\n    first steps or catching a burglar (or monitoring your pets, keeping an eye on\n    your small business, providing in home medical care...)\n</code></pre>\nHere's just a couple of the articles written about us this year:<p><a href=\"http://allthingsd.com/20121227/the-story-of-dropcam-a-little-hardware-start-up-with-its-head-in-the-cloud/\" rel=\"nofollow\">http://allthingsd.com/20121227/the-story-of-dropcam-a-little...</a><p><a href=\"http://www.nytimes.com/2012/08/11/nyregion/an-improvised-trap-for-a-burglar-who-made-himself-at-home.html?_r=0\" rel=\"nofollow\">http://www.nytimes.com/2012/08/11/nyregion/an-improvised-tra...</a><p>We are hiring software engineers and product managers (both software and hardware). Dropcam is an amazing place to work. Why? Here are just a few reasons:<p><pre><code>  * Spend more time working on the product vs being in meetings.\n  * Every employee can access our sales dashboard so you know how the company is \n    doing/growing. (5x annual revenue growth in 2012)\n  * We bring in catered lunch every day but not dinner, so you don't feel bad going \n    home to recharge.\n  * Like big data? We measure it in Petabytes, not Terabytes (unlike your average\n    \"web scale\" startup :)\n  * I personally fly employees on helicopter tours of the San Francisco Bay (you \n    can even bring friends). It's a lot of fun!\n</code></pre>\nWhat more would you like to know? Drop me an email at my first name @ dropcam.com or apply at  <a href=\"https://www.dropcam.com/jobs\" rel=\"nofollow\">https://www.dropcam.com/jobs</a>","time":1357054214,"type":"comment"},{"by":"wangthony","id":4993037,"parent":4992617,"text":"TOBI // San Francisco area // Full-time, Local (Relocation OK)<p>What you should know about us:<p>o Great tech: learn &#38; master Ruby, Rails, PostgreSQL, Git, and more<p>o Cool &#38; interesting opportunities in growth, social, mobile, international, big data, predictive analytics, supply chain logistics, warehouse operations, etc.<p>o Unique and empowering engineering culture: tech makes key decisions, with no managers, PMs, or “business people” to get in the way<p>o Profitable and growing with a huge market (H&#38;M, Zara, Forever 21, Nasty Gal, Gilt), AND self-funded!<p>o Competitive base salary + generous bonus plan paid out 2x/year<p>Email us at engjobs (at) tobi.com for details.  Thanks!","time":1357059642,"type":"comment"},{"by":"splay","id":4993012,"parent":4992617,"text":"Splay -- New York, London, Tokyo. Full-time and contract. (onsite and global remote, relocation)<p>We design, build and operate a handful of high profile ecommerce properties which double in scale/sales every six months. We've got hard problems to solve but our work is rewarding and allows us the privilege of continuous innovation.<p>We don't operate with any dogma about any specific technologies or process.  We get shit done. We are entering a new phase of growth, requiring some additional engineering muscle.<p>Send us your best work to date. We'll get in touch if there is potential fit. (info@splaynewyork.com)","time":1357059254,"type":"comment"},{"by":"cdrxndr","id":4998403,"parent":4992617,"text":"## SEEKING FREELANCER ##<p>Looking for a talented ActionScript developer with experience working with Adobe AIR 3 to cross-compile apps for iOS and Android (both mobile and tablet environments).  Pure-play development, with design assets and functional specifications to be provided.<p>Key skills:<p>* Strong Flash/Flex development skills with examples of interactive interfaces with 2-D animations<p>* Experience interacting with native-hooks and mobile UI - e.g., accelerometer, single touch flick/swipe - via AIR<p>Nice to have:<p>* Experience developing child-oriented games (e.g., simple mechanics)<p>* Ideally can work on-site in NYC, but remote is fine.<p>Nondisclosure, noncompete, etc. required.<p>Contact: iamanonon@outlook.com","time":1357152521,"type":"comment"},{"by":"abailin","id":4992883,"parent":4992617,"text":"Pradux, New York City (Soho) [full time &#38; intern]<p>Pradux is hiring in NYC. We're a very small team that is revolutionizing the e-commerce space. You will take ownership of major functionality of our site and operations and will have creative freedom to GSD. Come make a meaningful impact to a small company. We work out of WeWork Labs on Varick and Charlton, so stop by and say hello!<p>Looking for:<p>* Web developer/hacker (full time, intern) -- we use PHP, lots of javascript, redis, memcached, aws.<p>* UI/UX Architects/designers (full time, intern)<p>Competitive salary (cash + equity). Shoot me an email if you are interested!<p>email: bailin at pradux com","time":1357056581,"type":"comment"},{"by":"senthilnayagam","id":4993485,"parent":4992617,"text":"Mountain View, CA \nPortland, OR<p>Hiring for:\nRuby on Rails -&#62; databases(posgres,mysql,mongodb), caching(redis,memcache),\nBig Data -&#62; hadoop,hadoop streaming hbase, cassandra, scripting, machine learning, chef/puupet\nFront End -&#62; html5, Javascript frameworks(backbone.js, jquery, ember.js, sencha, kendo ) twitter bootstrap, websocket,visualization(d3,js, rapahel.js, fusioncharts)\nmobile -&#62; objective-C, rubymotion<p>Full-time on-site only.  INTERN and H1B welcome.<p>Competitive Salary, benefits<p>senthil@railsfactory.com <a href=\"http://www.railsfactory.com\" rel=\"nofollow\">http://www.railsfactory.com</a>","time":1357066860,"type":"comment"},{"by":"jscheur","id":4994108,"parent":4992617,"text":"NoRedInk (www.noredink.com) |  Full Time   |  Palo Alto &#38; SF<p>NoRedInk is transforming education through adaptive learning and personalization, and we're looking for a lead Rails dev &#38; technical partner.  We're one of America's fastest growing startups, and every 0.25 seconds, a student solves a question on our site.  We solve complex and fascinating data problems while striving to eliminate the \"red ink\" on students' papers and empower tens of millions of students around the globe.<p>For more details about NoRedInk and the position, go here: goo.gl/qZN3Y","time":1357076374,"type":"comment"},{"by":"garysieling","id":4992884,"parent":4992617,"text":"Wingspan Technology - Greater Philadelphia (Blue Bell)<p>Join a team of software engineers building the next generation of SaaS apps for regulated pharma. We're growing quickly, providing many opportunities to learn and grow.<p>We have new projects starting up, with Scala, Postgres, and ExtJS, although many of our current products are Java/C#. We're looking for Software Engineers, DBAs, Ops, and QA- \n<a href=\"http://www.wingspan.com/careers/\" rel=\"nofollow\">http://www.wingspan.com/careers/</a><p>Interested? Contact gsieling@wingspan.com","time":1357056618,"type":"comment"},{"by":"tonystubblebine","id":4993141,"parent":4992617,"text":"Lift is looking for a product designer. Full writeup here:\n<a href=\"https://medium.com/inside-lift/a882effb686a\" rel=\"nofollow\">https://medium.com/inside-lift/a882effb686a</a>","time":1357061271,"type":"comment"},{"by":"gregcohn","id":4994688,"parent":4992617,"text":"Los Angeles - Full time - technical<p>Ad Hoc Labs (makers of Burner for iOS - <a href=\"http://burnerapp.com\" rel=\"nofollow\">http://burnerapp.com</a>) are seeking talented engineers (back-end, mobile, telephony) interested in our mission of building a privacy and identity layer for the phone.  You must have strong fundamentals and production-scale experience. Fluency in Python a plus.<p>Significant equity participation and leadership responsibility are possible for the right candidates.<p>Contact greg [at] adhoclabs [dot] co.","time":1357087150,"type":"comment"},{"by":"robdimarco","id":4998780,"parent":4992617,"text":"eLocal (<a href=\"http://www.elocal.com\" rel=\"nofollow\">http://www.elocal.com</a>) - Conshohocken, PA (Philly burbs)<p>Ostensibly, the job title is Ruby Developer, but really your job involves bringing to life the software that is used by our consumers, customers and internal users. You will be responsible, in concert with our product and operations teams, for feature definition, project planning and estimation, development, testing, deployment, and maintenance. Often, we work with Ruby and Rails, but there are many other tools in our toolbox, including PostgreSQL, Solr, Chef, Redis, AWS, PhoneGap, and more. Our developers are given the freedom to find the best solution, but must take on the responsibility for a successful implementation. We are looking for an individual who has a proven ability to ship great software regardless of the technology.<p>Must Haves:<p>- Eligible for work in the US\n- At least 2‐5 years of relevant web development experience\n- Experience with scripting languages such as PHP, Python, or Ruby, (Hardcore would be a +!) as well as the ability to\nquickly learn and apply new technologies (we are willing to take someone without Ruby experience assuming you\nhave lots of web development experience and are willing to learn)\n  - Experience owning, delivering and maintaining production code or services\n  - Exposure developing on Linux/Unix. You don't need to be an admin, but you need to be comfortable with a terminal\nshell\n  - Self motivated with a strong work ethic\nNice to Haves:\n  - Devops: Linux Administration / Nginx / Amazon Web Services / Chef\n  - Data: PostgreSQL / Redis / Solr\n  - Javascript: CoffeeScript / JQuery\n  - Mobile: Phone Gap / iOS development","time":1357156025,"type":"comment"},{"by":"meganelacarte","id":5028733,"parent":4992617,"text":"E la Carte (www.elacarte.com) Palo Alto, CA - Full time<p>Now Hiring in Sales, Engineering (Python/Django/Javascript), &#38; QA/IT\nwww.elacarte.com/jobs<p>We make software and tablets for the restaurant industry, and are a YC company. Our Presto tablets empower restaurant guests to browse the entire menu, place orders, play games, and pay their bill without having to wait. We have a small team making a huge impact on the restaurant industry, all while having fun in our Palo Alto house.","time":1357681857,"type":"comment"},{"by":"markhelo","id":4993730,"parent":4992617,"text":"Wello - San Francisco (<a href=\"https://www.sortbox.co/z/4k\" rel=\"nofollow\">https://www.sortbox.co/z/4k</a>)<p>Wello is looking to hire a software engineer with a passion for designing beautiful web applications. Using 2-way video technology, Wello enables users to workout from the comfort of their home or office with a live, professional trainer.<p>As the third engineer of a highly motivated team, you will be responsible for delivering product features that will delight customers. You will have a huge influence in shaping our product as an early member of the team. If you are someone that loves to build software and work in small teams, we’d love to tell you more about the opportunity.<p>What makes Wello special:<p>Our vision is to build a recognized health and wellness platform for learning and doing\nWe are a small and hungry team\nWe care deeply about great design\nWe are funded, generating revenue and successfully launched.\nLearn more about us at <a href=\"http://www.wello.co/about/\" rel=\"nofollow\">http://www.wello.co/about/</a><p>Responsibilities:<p>Develop new features (backend, data analysis) while working side by side with the rest of the team\nAs an early employee, be a generalist and shape the company and its culture\nPrototype experimental features quickly\nTest your own code and deploy to production quickly and often<p>Requirements:<p>A passion for building intuitive software that delight users\n3-5 years of prior experience building consumer software\nPractical knowledge of building scalable web applications\nKnowledge of design patterns\nDrive to take initiative and ownership\n(Passion for health and fitness solutions trumps any specific requirement).<p>Plus:<p>General knowledge of Django and MySQL\nKnowledge of a good A/B testing framework\nExperience building small mobile applications on the side<p>A Little about the Leadership Team:<p>Co- founder Ann Scott Plante worked at Bain &#38; Company. BA Dartmouth, MBA Stanford. Fellow co-­founder, Leslie Silverglide, previously founded and sold Mixt Greens, a quick-­service restaurant group. BA Johns Hopkins, MSc Oxford, MBA Stanford. Amol Kher, Wello’s CTO,  led teams at Netflix, Google and Microsoft. Hands-­on Technical Advisor, Marc Haverland, led MapQuest’s technical team as well as that of MXLogic (acquired by MacAfee).","time":1357070412,"type":"comment"},{"by":"joshuaxls","id":4993078,"parent":4992617,"text":"AngelList, San Francisco, H1B candidates welcome.<p>We're always ready to talk with talented, motivated designers and developers. We've built a world-class team and will continue to do so in 2013.<p>Each week we help hundreds of startups raise capital and connect with talent. Come join us in the center of the startup universe.<p>You can apply through our own product at <a href=\"https://angel.co/angellist/recruiting\" rel=\"nofollow\">https://angel.co/angellist/recruiting</a>, or email me at josh@angel.co.","time":1357060226,"type":"comment"},{"by":"BrandonM","id":4999981,"parent":4992617,"text":"EasyESI (<a href=\"http://easyesi.com\" rel=\"nofollow\">http://easyesi.com</a>) - Berkeley, CA - full-time, H1B welcome<p>We are a 6-person, tech-led startup that nearly hit breakeven last year and just closed a funding round. We are looking to fill 3 positions:<p>Front-End/UI Engineer - Must have a good attention to detail and be able to use and contribute to a large, modular Javascript codebase (built on dojo). Good understanding of HTML/CSS/Javascript is a must, and a good eye for design is a nice bonus. We support only modern browsers (no IE6 headaches), so we have a very rich HTML/Javascript interface that relies on AJAX queries to pull down data and perform much of the work.<p>Software Engineer - With just 2.5 programmers right now (our CEO has a CS PhD but a lot of other responsibilities), we all wear many hats. Our server is written in Java 7 and runs on the latest Jetty. We use Hibernate and Spring with annotation-based configuration (minimal XML). We use Lucene for indexing documents, Cassandra for logging and searching user events, MySQL for storing relational data, and it all runs on AWS technologies. We have a separate Python codebase for performing offline work. We strive to write all of our code in a modular, reusable style that maximizes code-sharing and minimizes repetition. We schedule weekly time for refactoring so that we avoid the accumulation of technical debt. If you're sharp and you're interested in learning how to write performant code that uses modern academic research and operates on the latest infrastructure, you'll like this role.<p>Systems Engineer - We deal with many terabytes of data. We just recently ordered a 48-bay fileserver (basically a more robust, beefed-up BackBlaze pod) to handle our expanding storage needs over the next couple years. We need someone with Unix experience who is comfortable in Python to help us work more efficiently. You'll manage our AWS installations, manage our internal systems, and help make our entire setup more robust. We're happy to hire someone with solid fundamentals who wants to learn on the job.<p>Salary is competitive with other Bay-area startups. We also offer equity, healthcare, 3 weeks of vacation and 10 holidays, and a relaxed and fun work environment.<p>We consider all applicants; please apply for the position(s) you're interested in at <a href=\"http://easyesi.com/jobs.shtml\" rel=\"nofollow\">http://easyesi.com/jobs.shtml</a>.","time":1357168878,"type":"comment"},{"by":"jpbutler","id":4993200,"kids":[4993333],"parent":4992617,"text":"Boston Area (Metrowest) - Compass Aging<p>We're building out a set of tools to help adult children with aging parents conquer the challenges that come along with that. We're part of Gatehouse Ventures, so we have the environment and the mission of a startup with the resources of a public company.<p>We're hiring for:<p>* Senior Software Engineer<p>* Rails Engineers<p>* Front-End Engineer<p>* DevOps Engineer<p>..and more.<p>See all the jobs here: <a href=\"http://www.compassaging.com/jobs\" rel=\"nofollow\">http://www.compassaging.com/jobs</a>.<p>I'm the hiring manager, so please feel free to reach out to me directly.","time":1357062151,"type":"comment"},{"by":"styloot","id":4995366,"parent":4992617,"text":"Pune, India - Fulltime.<p>Co-Founder of Styloot.com here.<p>Styloot.com, is a visual search engine for fashion. At 700,000 skus and 4000+ brands, we carry slightly more women apparel than Amazon and twice as many shoes as Zappos.<p>We are looking to hire Python and Javascript developers.<p>You will be working directly with the product and will be making decisions that directly influence the site.<p>You must love coding - everything else we can work around.<p>You must have a github repo that you are proud of.\nEmail us if interested - info at styloot.com","time":1357102377,"type":"comment"},{"by":"bpowers","id":4994418,"parent":4992617,"text":"Passport Parking\nNashville, TN - full-time and intern for development<p><a href=\"http://www.passportparking.com/software\" rel=\"nofollow\">http://www.passportparking.com/software</a>","time":1357082099,"type":"comment"},{"by":"eikenberry","id":4995568,"kids":[5001746],"parent":4992617,"text":"Janrain - Downtown Portland, OR\nFT positions, INTERN<p>Lots of positions open; <a href=\"http://janrain.com/about/careers/\" rel=\"nofollow\">http://janrain.com/about/careers/</a><p>Small teams with lots of different technologies; Java, Scala, Haskell, Go, Ruby, Puppet, AWS, Redis, Riak, Postgres, Mobile, and more. Flexible work environment with easy mobility between teams.<p>Mature start-up w/ about 150 employees with about 1/2 being engineering. See the website for more.","time":1357109030,"type":"comment"},{"by":"paulaminc","id":4992659,"parent":4992617,"text":"Riparian Data - Watertown, MA (near Boston) Software Engineer and Product Owner<p>Riparian Data is a Boston-based startup spun out of SoftArtisans, a 15 year-old software company. Our mission: use big data technologies to make enterprise software smarter, faster, and friendlier.<p>Job details:  <a href=\"http://www.ripariandata.com/jobs/\" rel=\"nofollow\">http://www.ripariandata.com/jobs/</a>\nSend resume:  hr@ripariandata.com","time":1357051905,"type":"comment"},{"by":"emcienjobs","id":5013275,"parent":4992617,"text":"Atlanta, GA (full-time)\nEmcien - <a href=\"http://www.emcien.com/\" rel=\"nofollow\">http://www.emcien.com/</a>\n-\n<a href=\"https://jobs.github.com/positions/ee73350c-5528-11e2-850a-9e1769cdfd3b\" rel=\"nofollow\">https://jobs.github.com/positions/ee73350c-5528-11e2-850a-9e...</a><p>We make the most interesting software in Atlanta, and have a lot of fun doing it. No facebook-for-cats here.","time":1357407085,"type":"comment"},{"by":"CMCDragonkai","id":4994214,"parent":4992617,"text":"Looking for a web developer + designer to become the lead instructor at Polycademy in Australia. You'll be teaching web development and meeting up with potential entrepreneurs.<p>Check out <a href=\"http://careers.stackoverflow.com/jobs/28641/web-developer-teacher-instructor-polycademy\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/28641/web-developer-te...</a>","time":1357078412,"type":"comment"},{"by":"devinegan","id":4995187,"parent":4992617,"text":"LaunchKey. We are a funded Las Vegas based startup that is looking for iOS and Android developers. LaunchKey is eliminating the password in 2013. If this sounds interesting, contact us!<p><a href=\"https://angel.co/launchkey#recruiting\" rel=\"nofollow\">https://angel.co/launchkey#recruiting</a>\n<a href=\"http://launchkey.co/\" rel=\"nofollow\">http://launchkey.co/</a>","time":1357097966,"type":"comment"},{"by":"khitchdee","id":4993313,"parent":4992617,"text":"Khitchdee (<a href=\"http://www.khitchdee.com\" rel=\"nofollow\">http://www.khitchdee.com</a>) seeks a summer intern for 2013 at its Allahabad office. Someone interested in music, sound and signal processing algorithms. We're creating a screen, mouse and keyboard free recording studio -- fully voice controlled. Email me at rohit@khitchdee.com","time":1357064008,"type":"comment"},{"by":"tashian","id":4994782,"parent":4992617,"text":"yerdle (<a href=\"http://www.yerdle.com\" rel=\"nofollow\">http://www.yerdle.com</a>) in San Francisco is a seed-stage, mission-driven sharing economy startup looking for designers and full-stack developers.<p>We believe we can eliminate 10-20% of retail by helping people share what they already have with friends and family instead of buying new.<p>On Black Friday we launched a web app at <a href=\"http://yerdle.com\" rel=\"nofollow\">http://yerdle.com</a>, and an iOS app (<a href=\"http://yerdle.com/mobile\" rel=\"nofollow\">http://yerdle.com/mobile</a>). Right now our stack is Rails + backbone.js + mongodb.<p>We have an amazing team with backgrounds from Saatchi &#38; Saatchi S, Walmart, Zipcar, Sierra Club, Facebook, 350.org... and we have money in the bank.<p>More details: <a href=\"http://www.yerdle.com/jobs\" rel=\"nofollow\">http://www.yerdle.com/jobs</a><p>Local candidates only, please.<p>Questions? I'm Carl Tashian, co-founder and vp of engineering, and you can reach me at my first name at yerdle.com.","time":1357088993,"type":"comment"},{"by":"garrynewman","id":4993398,"parent":4992617,"text":"Walsall, England - Facepunch Studios<p>We're looking for anyone with a talent in game design. We don't have a set number of positions to fill - but will seriously consider anyone with any kind of game dev experience.<p>Everything is negotiable - but you should live locally/be prepared to commute to the office daily.<p>If you're interested shoot us an email to jobs@facepunchstudios.com","time":1357065442,"type":"comment"},{"by":"davidcann","id":4992713,"parent":4992617,"text":"Sunnyvale, CA - Double Robotics (YC S12)<p>Join our small team in building the next generation of telepresence robots. We're currently seeking an embedded C programmer, an electrical engineer, and a designer with an eye for both software and hardware, as well as some web/JavaScript skills.<p>Email jobs@doublerobotics.com with your best projects and your resume.","time":1357053246,"type":"comment"},{"by":"abimysoc","id":5042130,"parent":4992617,"text":"mySociety (<a href=\"http://www.mysociety.org/jobs\" rel=\"nofollow\">http://www.mysociety.org/jobs</a>) - UK<p>mySociety is a community of coders and technology fiends using our talents to make the world a better place, and we're looking for web developers and designers.<p>We've previously built sites and software like\nTheyWorkForYou.com\nFixMyStreet.com\nWhatDoTheyKnow.com\nAlaveteli.org\nMzalendo.com\nFixMyTransport.com\nWriteToThem.com<p>We like Ruby, Perl, Python, Django, Rails, node.js, HTML, CSS, PHP and a whole lot more.  Perks include not having to commute, as we nearly all work from home.<p><a href=\"http://mysocietyltd.theresumator.com/apply/olHAWM/Web-Developer.html\" rel=\"nofollow\">http://mysocietyltd.theresumator.com/apply/olHAWM/Web-Develo...</a><p><a href=\"http://mysocietyltd.theresumator.com/apply/wqRSrE/Designer-For-Web-And-Mobile.html\" rel=\"nofollow\">http://mysocietyltd.theresumator.com/apply/wqRSrE/Designer-F...</a>","time":1357900575,"type":"comment"},{"by":"tedd4u","id":4993113,"parent":4992617,"text":"Flickr - San Francisco, CA (Full-time, contract, H1B)\nWe are hiring for engineering and PM roles. \nEngineering: Front-end, back-end (FT and contract), iOS, web performance devs.\nSee details here - <a href=\"http://flickr.jobs/\" rel=\"nofollow\">http://flickr.jobs/</a>\nOh and try the new Flickr iPhone app out.","time":1357060806,"type":"comment"},{"by":"smilliken","id":4994741,"parent":4992617,"text":"MixRank - San Francisco, CA (full-time, intern)<p>Seeking: Engineers, Designer<p>Big data, web crawling, data visualization, machine learning. Happy to chat with anyone— send me an email: scott@mixrank.com.<p>We're also hosting a friendly, casual programming competition tomorrow, Wednesday the 2nd, in San Francisco (SoMA) at 7pm. Email me if you'd like to drop by.","time":1357088182,"type":"comment"},{"by":"sooperman","id":4992795,"kids":[4993312],"parent":4992617,"text":"WebEngage, Mumbai, India. Full-time Java developers - <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=4390398&#38;trk=job_nov\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=4390398&#38;...</a><p>We are <a href=\"http://WebEngage.com\" rel=\"nofollow\">http://WebEngage.com</a>","time":1357054897,"type":"comment"},{"by":"elfred","id":4997819,"parent":4992617,"text":"Austin, TX Chaotic Moon Studios <a href=\"http://www.chaoticmoon.com/apply/studios/\" rel=\"nofollow\">http://www.chaoticmoon.com/apply/studios/</a>\nWe're looking for solid mobile engineers. Specifically iOS, Android and Unity. Apply online or email me at elfred@chaoticmoon.com.","time":1357147746,"type":"comment"},{"by":"brandoneggar","id":4998172,"parent":4992617,"text":"Thuuz Sports (<a href=\"http://thuuz.com\" rel=\"nofollow\">http://thuuz.com</a>) | Palo Alto, CA | Full Time | Python Developer<p>Job Listing: <a href=\"http://www.linkedin.com/jobs?viewJob=&#38;jobId=4325836\" rel=\"nofollow\">http://www.linkedin.com/jobs?viewJob=&#38;jobId=4325836</a>","time":1357150619,"type":"comment"},{"by":"kalmanb","id":5005028,"parent":4992617,"text":"Hack Scala / Akka / Cassandra in beautiful New Zealand<p>Looking to do some travelling, join us in NZ. Exciting code, great lifestyle!<p>We're looking for a permanent NZ based software craftsman - more details <a href=\"http://movio.co/page/jobs/\" rel=\"nofollow\">http://movio.co/page/jobs/</a>","time":1357251113,"type":"comment"},{"by":"geofft","id":4993683,"kids":[4996178],"parent":4992617,"text":"MokaFive - Redwood City, CA (between San Francisco and Palo Alto), interns welcome, H1Bs probably welcome but I'm just an engineer so don't ask me.<p>MokaFive makes life easier for large corporate IT departments who have too many computers to manage, and life better for end-users who would otherwise have to deal with a corporate IT department that's enforcing ridiculously restrictive policies for their own sanity. Our primary product, MokaFive Player, delivers you a VM image of a corporate system that you can run on your own computer (Windows or Mac). You can install whatever software you want, and we automatically split new files into \"layers\", so IT can push a new base layer that takes effect as soon as you reboot, and you can press a button and wipe all locally-installed software including IE toolbars and other nonsense, but keep IT-provided software and non-application files like documents. Since it's running locally, you can get work done offline (unlike Citrix, VMware View, etc.), and not hate your life if you're not on the LAN. There's a bunch of security stuff like full disk encryption and so forth.<p>I'm specifically looking for coworkers on my team, which works on experimental / future products. One product that's been seeing lots of growth is MokaFive BareMetal, a stripped-down Ubuntu derivative that boots directly into MokaFive Player. By providing our usual management capabilities on an underlying OS you don't have to think about, you get the benefits of our product (easier updates, layering, single image, etc.) on corporate-owned hardware. We're also doing some work with MokaFive for iOS to allow you to remotely access files on your desktop from your mobile device, and doing some work with remote filesystems as an outgrowth of that.<p>We're not per se a virtualization company: we don't write the hypervisor, since other people already do a great job of that. We do write a lot of things just above and just below the hypervisor layer, and in general a lot of computer systems work. If you enjoy operating systems / virtualization, come talk to us. Our core product is in C++; there is also a fair amount of open source work to be done in various languages, and we try to be good citizens and work with upstream. (If you're interested in making 2013 the year of Linux on the desktop, helping Windows shops continue to use Windows as a desktop but use Linux for drivers is an oddly great way to help bring that about -- we regularly work to improve Linux's hardware compatibility, since we have customers wanting to use a wide range of machines.)<p>See mokafive.com for more info, or send me an email (gthomas at that domain name).","time":1357069771,"type":"comment"},{"by":"mmurph211","id":4992875,"parent":4992617,"text":"Vestmark - Wakefield, MA (near Boston)<p>Looking for software engineers of all levels, both front end and back end. See <a href=\"http://vestmark.com/Jobs/SoftwareEngineering.html\" rel=\"nofollow\">http://vestmark.com/Jobs/SoftwareEngineering.html</a> for more info.","time":1357056450,"type":"comment"},{"by":"jedberg","id":4994404,"parent":4992617,"text":"Netflix<p>Los Gatos, CA -- full time<p>Netflix is looking for a whole bunch of folks for the streaming service.<p>I'm specifically looking for Site Reliability Engineers.  If the idea of building a reliable system on top of AWS excites you, let us know!<p>Email talent@netflix.com and let them know you saw my post on HH.","time":1357081838,"type":"comment"},{"by":"dougb","id":4999235,"parent":4992617,"text":"kWantera - Pittsburgh PA (full-time)\nWe are an energy management early-stage company in Pittsburgh's Strip District. We are changing the way that businesses buy electricity in the wholesale markets. We also help companies manage their demand and power quality issues.<p>See <a href=\"http://www.kwantera.com\" rel=\"nofollow\">http://www.kwantera.com</a> for more info.<p>We are looking for full-time developers to join the team in our Pittsburgh office.  We are a small group of passionate people changing the energy procurement process. We are looking for people who take pride in their work, like to “get things done\" and want to be a part of a growing company. If you enjoy being part of a small team where everybody contributes and like to make a difference, then this opportunity might be for you.<p>•\tFrontend Developer:\nAbout Position: We are looking for someone to own the design and user experience of our web apps.  The ideal person will have experience presenting complex data in easily digestible ways. Required Skills: js, jQuery, D3, NVD3.<p>•\tBackend Developer:\nAbout Position: We are looking for someone to help us constantly improve our backend systems.  They must be familiar with various OpenSource tools to know which ones to use, and where to develop in house solutions. Must be able to evolve current system to meet future needs in a timely manner and must be good at defining interfaces between components. Must possesses superior programing skills.\nRequired Skills:  Python, Flask, Java, MongoDb, MySQL, interest in Scala.<p>•\tDevOps: \nAbout Position: This position involves building tools to manage, deploy, monitor, and scale our cloud infrastructure, working closely with our development team to plan our co-location strategy, and managing costs effectively. They will own Operations and be responsible for timely delivery of our products.\nRequired Skills: Debian Linux, AWS, Whirr, Python, MongoDb, MySQL, Shell scripting..<p>•\tLead QA Developer: \nAbout Position: We are looking for someone to build a team around. This person will be responsible for making sure our products are of the highest quality.\nRequired Skills: Python, Shell Scripting, testing frameworks.<p>Email careers@kwantera.com if interested.","time":1357160182,"type":"comment"},{"deleted":true,"id":5014912,"parent":4992617,"time":1357437131,"type":"comment"},{"by":"kalushi","id":5007397,"parent":4992617,"text":"Looking for Intern Position for the summer. Bioinformatics/Computational Biology related fields.\nI am a second year student in Jacobs Uni Bremen.\nPreferably in Germany but anywhere would do. cheers","time":1357304479,"type":"comment"},{"by":"iaw","id":5003968,"parent":4992617,"text":"I feel like typically these threads are populated a lot quicker.  I wonder if vacation time is contributing to the reduced growth rate...  Or maybe it's just because I'm actually looking this time.","time":1357239975,"type":"comment"},{"by":"bruth","id":4994672,"parent":4992617,"text":"Work with this fabulous organization: <a href=\"https://github.com/cbmi\" rel=\"nofollow\">https://github.com/cbmi</a> and me: <a href=\"https://github.com/bruth\" rel=\"nofollow\">https://github.com/bruth</a><p>---<p>The Children's Hospital of Philadelphia - Philadelphia, PA<p>Senior Analyst/Programmer x2<p>Requirements:<p>• BS or MS degree in computer science, information science, or related field.<p>• 4+ years of programming experience with progressively more complex projects.<p>• Mastery of one or more programming language highly desired with a demonstrated ability to learn new languages (Python, JavaScript, or Scala experience is highly desirable).<p>• Mastery of unit and integration test design and programming frameworks such as PyUnit or JUnit highly desired.<p>• Working knowledge of one or more bug tracking applications such as FogBugz or Trac highly desired.<p>• Working knowledge of relational database application development highly desired, including stored procedures, SQL, data definition language, basic performance tuning and query optimization, and ETL techniques.<p>• Working knowledge of Python, JavaScript and one or more of the following preferred: Java, PHP, C/C++.<p>• Working knowledge of one or more of the following web application framework/platforms preferred: Django, Ruby on Rails, JBoss, Apache Tomcat.<p>• Previous experience in data modeling and applications of highly multidimensional data types such as that derived from clinical research, genomics, proteomics, or image analysis is preferred.<p>• Experience in healthcare and/or biomedical data management issues is preferred.<p>• Demonstrates expert knowledge of test-driven development, unit testing, and the importance and implementation of configuration management processes and technologies.<p>• Exhibits excellent oral and written communication skills.<p>• Demonstrates knowledge of system integration, configuration, and deployment.<p>• Demonstrates ability to document code and systems.<p>Description:<p>We are seeking an experienced software development professional to join our small, highly focused, entrepreneurial R&#38;D application development group within the Center for Biomedical Informatics (CBMi). As a member of our team, your technical expertise can have an immediate impact on patient care through our mission to accelerate pediatric research with novel applications and data solutions. Furthermore, your work here has the potential to impact the future of healthcare through our research into software solutions supporting genome-enabled personalized medicine. Our research mission fosters an environment where creativity and exploration of new technologies are promoted and encouraged. Likely candidates should have solid experience and working knowledge in three or more programming languages (Python, JavaScript, or Scala experience is highly desirable) and be comfortable with one or more relational database platforms. Our dynamic academic research environment demands an individual with exceptional written and oral communication skills who can rapidly translate requirements from a variety of disciplines into intuitive, high quality software solutions that support our strategic vision. Candidates with prior experience in the biomedical field, especially using highly complex genomic data and/or data from electronic health records are very desirable. Participation in one or more public open source projects is an added bonus.<p>More info: <a href=\"http://www.chop.edu/careers/\" rel=\"nofollow\">http://www.chop.edu/careers/</a> and search for 'cbmi'","time":1357086766,"type":"comment"},{"by":"eyaltoledano","id":4992962,"kids":[5006228],"parent":4992617,"text":"International Gaming League (FounderFuel Fall 2012)<p>Searching for graphic/web designer and a PHP developer. Situated in Quebec or Ontario (Canada). Awesome gaming space.  Lots of data. Lots of fun. :)<p>Contact: info@playigl.com","time":1357058348,"type":"comment"},{"by":"jkolko","id":4994269,"parent":4992617,"text":"MyEdu - Austin, TX - Developers<p>Well funded startup, focused on Education<p><a href=\"http://www.myedu.com/join-our-team/#jobSoftwareEngineer\" rel=\"nofollow\">http://www.myedu.com/join-our-team/#jobSoftwareEngineer</a>","time":1357079310,"type":"comment"},{"by":"0xa","id":4992857,"kids":[4994308,4993969,5024596],"parent":4992617,"text":"Tumblr, New York, NY (NYC, Manhattan): FULL TIME Software Engineers (Scala, Java), PHP Developers and a Site Reliability Engineering Lead (Linux, Nginx, HBase, HAProxy, Memcached, and OpenTSDB)<p>TL;DR: Tumblr is actively hiring engineers at every layer of our technology stack.  <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility.  I'll highlight a few positions here, but you can see an awesome photo of Tommy the Pomeranian with Mayor Bloomberg, our great benefits, and the complete listing of open positions at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a>.<p>Happy New Year,<p>Matt, Director of Engineering<p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): Writing generic, reusable services in Scala, you will design, create and grow a blazingly fast platform for our PHP application.  Being a productive coder with architecture common sense is a must, but expertise in Java or JVM tuning is a plus.<p>* Search Engineer (<a href=\"http://bit.ly/TcOdt8\" rel=\"nofollow\">http://bit.ly/TcOdt8</a>): Real-time search and architecture are your forte.  Using your large-scale experience with building and innovating search backends, you will help take our search infrastructure to the next level.<p>* Front End/PHP Engineer (<a href=\"http://bit.ly/ToF7Ya\" rel=\"nofollow\">http://bit.ly/ToF7Ya</a>): You are a versed engineer and perfectionist with good taste, ready to take ownership of entire features of our PHP application.<p>* Site Reliability Engineering Lead (<a href=\"http://bit.ly/Uyy04u\" rel=\"nofollow\">http://bit.ly/Uyy04u</a>): As the team lead, you are an inspiring software developer with a passion for the highly performant, fault-tolerant, massively distributed systems that make Tumblr fast, reliable and available for hundreds of millions of visitors and tens of millions of users.<p>About Tumblr (<a href=\"http://www.tumblr.com/about\" rel=\"nofollow\">http://www.tumblr.com/about</a>)<p>Founded by David Karp in New York City in 2007, Tumblr empowers millions of users to create and explore content. Tumblr now hosts more than 87 million blogs and 39 billion posts. We work in an open, friendly and positive environment that encourages intellectual curiosity and a love for open source.  As engineers, we are focused on building technologies that advance massively scaled websites.  We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1357056104,"type":"comment"},{"by":"triggit","id":5034232,"parent":4992617,"text":"Triggit - San Francisco - Looking for a Sr. Ad server engineer.<p>Check out the details at: <a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a>","time":1357774130,"type":"comment"},{"by":"newhouseb","id":4993323,"parent":4992617,"text":"Bubbli / Aria Glassworks - SF / Remote<p>We’re looking for an experienced developer to assist in development of our python backend and API (they’re the same thing!) for our mobile app and web presence (and maybe third parties one day). This developer will start on a contract basis, remotely with a 2-3 month term, with the possibility of becoming full-time. We use github, gchat and email to communicate asynchronously, but we'll fly you out to our offices every once in a while if you're not already local.<p>We run a very modern stack - nginx, gunicorn, puppet, celery, aws, redis &#38; postgresql. Our web API (what you'll be working on), is tiny. It uses our own micro-framework (1148 lines of python) specifically for writing APIs built on werkzeug (from the flask family), sqlalchemy, 1161 lines of “business” logic and 798 lines of tests. Much of the base functionality is complete (it’s actively serving our mobile app), which means the next stage -- your primary responsibility -- is scaling this code and optimizing it all while continuing to strive for irreducible complexity.<p>Day to day projects may include (but aren’t limited to):<p>* Implementing sharding logic in our python code<p>* Porting our code to use gevent/eventlet<p>* Profiling hot code areas and potentially rewriting them in C<p>* Investigating whether PyPy makes sense<p>In addition - you may be “on-call” to address server issues while you are actively working (read: sitting at a desk). If/when you transition to full-time these responsibilities may increase.<p>Bubbli is building the technology and products to make bubbles. Bubbles are completely seamless spherical photos that you view through the window of a portable device. We think they're the most compelling means for communicating the real world on the flat web and millions of dollars of VC funding would seem to agree with us. What we've built so far has actually become surprisingly meaningful in our own lives (in capturing moments important to us when photos aren't enough) to the point where we would be seriously sad if the world didn't have it.<p>We're about ready to launch our first iOS app imminently and we need to bulk up the team to support things when our app explodes in popularity. We're a tiny 4 person company (2 programmers, 2 designers) company based in San Francisco. We pay well, we're nice guys, and if you come on full time a few months in, you'll get full benefits, a 401k, and equity.<p>Since we haven't launched, you can google for more...<p>Shoot me an email at ben@bubb.li if interested.<p>Also - a part time CM needed too!","time":1357064159,"type":"comment"},{"by":"triggit","id":5010679,"parent":4992617,"text":"Triggit, Full Time, San Francisco<p>System Admin and Ruby on Rails support engineer<p><a href=\"http://triggit.com/careers\" rel=\"nofollow\">http://triggit.com/careers</a>","time":1357342985,"type":"comment"},{"deleted":true,"id":4995698,"parent":4992617,"time":1357111802,"type":"comment"},{"by":"betadreamer","id":4992968,"parent":4992617,"text":"Front End Developer / Marketing Intern - Santa Monica, CA<p>At The Pool<p>In simple terms our goal is to be the 'offline' social network.<p>Contact me directly at: alexis@atthepool.com","time":1357058506,"type":"comment"},{"by":"joepestro","id":4993839,"parent":4992617,"text":"beRecruited.com - Fulltime, on-site<p>We're the nation's largest online college athletics recruiting platform, and we're hiring.<p>Ruby on Rails or iOS developer? Get in touch with me:<p><a href=\"http://blog.berecruited.com/careers\" rel=\"nofollow\">http://blog.berecruited.com/careers</a> or email me directly joe@berecruited.com (mention you saw this post on HN)","time":1357071995,"type":"comment"},{"by":"alexcaps","id":4994105,"parent":4992617,"text":"At The Pool | Los Angeles, CA | Full Time | Front-End Developer (but be a rockstar)","time":1357076338,"type":"comment"},{"by":"jqueryin","id":4992977,"kids":[5008157],"parent":4992617,"text":".CO - Miami, FL w/ Possibility of REMOTE<p>.CO is a cTLD domain registry with a passion for helping startups.  We're a highly profitable, bootstrapped company. Some of our partners include the likes of 500 Startups, Startup America, Startup Weekend, LeWeb, etc.<p>We are looking for a <i>lead frontend dev</i> to work as a key member of our development team to build and deliver a world-class experience for our users. In this role, you will be responsible for helping craft the future of our service from a front-end, design-driven perspective. You will also be working closely with people across engineering, product, and creative to help develop an amazing experience for our users. You must be open to the idea of moving to Miami, FL in the future if you wish to apply for the remote position.<p>You will be responsible for:<p><pre><code>    * Provide technical development across our family of websites, including: go.co, cointernet.co, startuplife.co, and any other websites developed by the marketing or operations teams\n    * Be the main front-end developer for updates and conversion optimization to these websites\n    * Work with internal and external partners to review and define website improvements - including guidance and participation in wireframe development, technical requirements definition, front end development, back end development, QA testing, deployment, management - and everything in between.\n    * Debug issues that arise with the performance of the websites - including making corrections directly and/or delegating tasks throughout the organization to resolve\n    * Guide our organization toward an industry-leading standard of user interaction and development\n    * Plan for future changes to the website, stay current with software and hardware, and make recommendations that can improve the success of the business\n</code></pre>\nRequirements:<p><pre><code>    * You're self sufficient, get shit done, and don't require hand-holding\n    * You have a passion for startups\n    * You love to build beautiful stuff for the web\n    * You are an HTML and CSS expert, including HTML5\n    * Have knowledge of PHP, with a desire to learn more\n    * Can work from and/or cut-up PSDs\n    * Have worked in a cross-functional team - either in-house or at an agency\n    * Can advise designers on best practices for design as they will apply to development\n    * Maybe even have a few design tendencies of your own (very nice to have!)\n    * Quality and detail-oriented\n</code></pre>\nIf you'd like to know more about us and things we're working on, please don't hesitate to ask. If you're a talented backend or fullstack dev with PHP experience, don't hesitate to send your info as well. Our development team is growing rapidly and we're open to bringing on additional talent. We're also in need of a lead designer, so if you know of anybody, please let them know!<p>Send relevant open source contributions, CV, example work, questions, etc. to <i>corey AT go.co</i> and I'll be in touch.","time":1357058576,"type":"comment"},{"by":"bartonfink","id":4992915,"kids":[4999212],"parent":4992617,"text":"Mapquest.com<p>Primarily in Denver, CO and Lancaster, PA, but we're a relatively distributed company so go ahead and ask if you live somewhere else. As an AOL subsidiary, we've got employees who work out of AOL offices around the world so it wouldn't be unheard of to work from e.g. Seattle or New York if you decide Denver's just got too much sunshine. I've also been told we will sponsor an H1B.<p>Over the past year, MapQuest has brought on an almost entirely new management team to shake things up and change the direction of the company from answering the ? \"How do I get there?\" to answering the more interesting ? \"Where do I want to go?\" We've released two new products in the last year (Discover and Local, formerly known as Vibe) and are aggressively working on creating an engineering-driven culture that actually builds things people might want to use instead of polishing products that were cool in 2004. We've had a banner year, and are looking to hire engineers as well as product managers to continue this upward trend.<p>Among the technical roles we're looking to fill are several Ruby developers at varying levels of expertise to help develop new products as well as one Java developer to work with our data team and revamp various backend services (i.e. search, geocoding and a data ingestion service that populates our location databases). Ever since Valve leaked their company handbook, the phrase \"T shaped\" has been been thrown around a lot by upper management, so you'll need to be able to do full-stack development. We do a lot of pair programming right now, so if you've got experience doing that, it'd be a big plus. We're particularly interested in someone who's got very deep Rails experience to serve as a sort of tech lead, but we have many positions open for Rails people so if you'd be interested at all drop a line.<p>Product is looking to bring on people with some combination of travel industry knowledge and mobile applications to help get the company past maps and directions. Most of our product people have development experience, so you'll be expected to be able to \"talk shop\" with the engineers you work with, but your day- to-day responsibilities aren't going to be producing code as much as producing ideas, pitching them to the rest of the company and helping the engineers and designers see them through to completion.<p>I can definitively say that MapQuest is among the best places I've ever worked. The office space is fantastic (Downtown Denver right off the 16th Street Mall) and the new management team is very serious about doing things right as we try to pivot the company away from directions and into product development. The brand is practically a household name, the product team is happy to listen to engineers for feedback or ideas, and we've got the interesting position right now of being able to work like a startup except with a large pre-build audience (I've been told that we had 40M UV's on a brand new product on launch day, for example). You can read the company postings here (<a href=\"http://company.mapquest.com/careers/\" rel=\"nofollow\">http://company.mapquest.com/careers/</a>) but I'd really enjoy being able to answer ?'s directly. My e-mail is in my profile and please feel free to contact me personally if you have further ?'s, want to chat, or anything else. Happy 2013, and hope to hear from some of you soon!","time":1357057473,"type":"comment"},{"by":"sanj","id":4992861,"parent":4992617,"text":"TripAdvisor: Newton, MA<p>Come help me build the future of travel.<p>Contact info is in my HN account.","time":1357056197,"type":"comment"},{"by":"sycren","id":4997112,"kids":[4997223],"parent":4992617,"text":"Any data analyst jobs going in London?","time":1357140550,"type":"comment"},{"by":"esamek","id":4996306,"parent":4992617,"text":"Washington DC (full-time, salaried)<p>HelloWallet - <a href=\"http://www.hellowallet.com\" rel=\"nofollow\">http://www.hellowallet.com</a><p>By utilizing powerful new technology, findings from behavioral economics, and a network of partnerships with industry experts, HelloWallet is able to offer high-quality, individualized financial advice to all Americans.<p>Senior Software Engineer\n------------------------------------\nDescription:<p>We’re looking for a solid Senior Software Engineer who does not shy away from challenges and opportunities to lead. We¹re a fun and dynamic startup, with a team of people who work together on everything from the latest front-end technologies to superb database design. If you join our team, you¹ll work in our agile engineering group, contributing your expertise to all aspects of our application.<p>Responsibilities:<p>Build amazing interactive experiences that empower our members to increase their financial wellness\nBuild powerful and easy-to-use features in the HelloWallet web and mobile applications\nBuild the tools, systems, and processes to support the HelloWallet service offering\nBuild software and services to integrate with our trusted vendor partners and client systems\nWork with CTO and Product Development Team to help shape product vision\nRequired Skills/Experience:<p>5+ years experience developing commercial quality web and/or mobile applications\nAdvanced knowledge and demonstrated experience with Java, AJAX, JQuery, JavaScript, and Web services (REST, SOAP)\nAdvanced knowledge of web technologies and protocols\nExperience with relational databases including transaction management, tuning and scalability, JDBC, and Hibernate\nAdvanced knowledge of enterprise concepts such as security, scalability, transaction management, and multi-threading\nWorking knowledge of front-end technologies (HTML, CSS, DOM)\nFamiliarity with Scrum agile development process\nDesired Experience:<p>Experience with Android and/or iOS is a huge plus\nExperience with Google Web Toolkit (GWT)\nExperience with Spring framework\nExperience with Subversion, Ant, Hudson, JIRA, and Linux\nMathematics and/or statistics\n Job Benefits:<p>Full benefits package with competitive salary\nExciting, fun, and entrepreneurial work environment\nThe opportunity to empower millions of U.S. consumers to understand and manage their financial lives\nFree Friday Lunches\nFree Time for Pet Projects\nWe’re in downtown DC.  We pay competitive rates and have a damn good time. To apply or if you have any questions, just contact Mitch at jobs@hellowallet.com.<p>Software Engineer\n-----------------------------------\nDescription:\nWe seek solid Software Engineers who do not shy away from challenges. We’re a fun and dynamic startup, with a team of people who work together on everything from the latest AJAX front-end technologies to superb database design. If you join our team, you’ll work in our agile engineering group, contributing your expertise to all aspects of the software.<p>Responsibilities<p>Develop features for the HelloWallet service\nDevelop tools and systems to support the HelloWallet service\nDevelop software and services to integrate with our trusted vendor partners and client systems\nWork with CTO and product strategists to help shape product vision\nRequired Skills/Experience<p>3-5 years experience developing commercial quality Web applications\nAdvanced knowledge and demonstrated experience with Java, XML, and Web services (REST, SOAP)\nExperience with Java EE application servers such as JBoss, Tomcat, WebLogic, WebSphere, etc.\nWorking knowledge of web technologies and protocols\nDesired Experience<p>Experience with Google Web Toolkit (GWT)\nExperience with Spring framework\nExperience with relational databases including transaction management, tuning and scalability, JDBC, and Hibernate\nWorking knowledge of enterprise concepts such as security, scalability, transaction management, and multi threading\nWorking knowledge of client side technologies (HTML, CSS, JavaScript, DOM)\nExperience with Subversion, Ant, Hudson, JIRA, and Linux\nMathematics and/or statistics\nFamiliar with Scrum agile development process\nJob Benefits:<p>Full benefits package with competitive salary\nExciting, fun, and entrepreneurial work environment\nThe opportunity to empower millions of U.S. consumers to understand and manage their financial lives\nFree Friday Lunches\nFree Time for Pet Projects\nWe’re in downtown DC.  We pay competitive rates and have a damn good time. To apply or if you have any questions, just contact Mitch at jobs@hellowallet.com.","time":1357129656,"type":"comment"},{"by":"rdamico","id":4993163,"kids":[4993389],"parent":4992617,"text":"Crocodoc (YC W10) | San Francisco | Full time | <a href=\"http://crocodoc.com\" rel=\"nofollow\">http://crocodoc.com</a><p>## Opportunities ##<p>- Director of Product<p>- Director of Business Development<p>- Full-Stack Engineer<p>- Inside Sales Rep<p>Details below.<p>## About Crocodoc ##<p>Crocodoc powers HTML document viewing and collaboration for some of the world's top consumer and business web applications including Dropbox, LinkedIn, and Yammer. Our platform for Office and PDF files reaches tens of millions of users, and our company is profitable and growing fast.<p>Crocodoc was started by 4 technical founders from MIT and is well funded by Y Combinator, SV Angel, 500 Startups, and top angel investors from Silicon Valley.<p>---------------------------<p>## Director of Product ##<p>Do you love to launch products, close deals, work with developers, and do whatever it takes to thrive in a startup or small organization? Crocodoc is looking for a smart, entrepreneurial, technically-minded hustler to lead major new initiatives targeting developers and SMB customers. This is a key leadership role with enormous growth potential.<p>Many developers find Crocodoc by hunting through the source code of websites like Dropbox that use our white-labeled viewer. That’s a lot of raw demand, just waiting to be harnessed. If you have a technical background with a knack for talking to customers and building great user experiences, this is a chance to lead and 10x an entire product line at Crocodoc focused on our API and developer tools.<p>Responsibilities:<p>- Talk to prospective customers (developers and product managers)<p>- Design a great self-service experience and scalable sales process<p>- Optimize our pricing plans and product tiers<p>- Develop our user acquisition strategy<p>- Qualify leads, own our sales pipeline, and close lots of deals<p>TL;DR: you must be capable of growing our SMB product like crazy while wearing many hats in the process.<p>Qualifications:<p>- World-class ability to communicate with clients and develop customer relationships<p>- Experience with SaaS and/or B2B technology solutions<p>- Basic technical experience (you’ve written a web app) required<p>- Technical sales experience a big plus<p>- Product and marketing experience are also a plus<p>This is a tremendous opportunity to own an entire product from soup to nuts. If you think you'd be a great fit, please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.<p>---------------------------<p>## Director of Business Development ##<p>Crocodoc’s next-generation HTML5 document collaboration platform reaches tens of millions of users, and our business is profitable and growing fast. Our customers include Dropbox, LinkedIn, and Yammer, and we're funded by investors including YC, SV Angel, 500 Startups, and top angels from Silicon Valley.<p>At Crocodoc, we’re fortunate to interact regularly with some of Silicon Valley’s most influential companies. We’re looking for someone with the hustle, product sense, and BD experience to help close our next wave of company-defining partnerships.<p>Responsibilities:<p>- Starting, negotiating, and closing strategic partnership deals<p>- Managing deal flow and our sales pipeline<p>- Conducting outbound prospecting and inbound lead qualification<p>- Working with the CEO to negotiate key deals<p>- Identifying and developing new business opportunities<p>- Providing feedback on the product roadmap based on existing/potential customers<p>Qualifications:<p>- Direct experience with SaaS and/or B2B technology products<p>- Strong organizational skills and the ability to manage your own agenda while working closely with others in a cross-functional role<p>- A great product sense and a knack for customer development<p>- Experience with technical products and/or a background in CS is a big plus<p>- World-class ability to communicate with clients and develop relationships<p>If you've got what it takes to lead business development and build relationships with top brands in Silicon Valley, we'd love to hear from you. Warm introductions to our CEO, Ryan Damico, are strongly preferred. Otherwise please contact jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.<p>---------------------------<p>## Full-Stack Engineer ##<p>We're looking for a full-stack web engineer who can contribute to all aspects of Crocodoc: front-end development, server-side improvements, ops and systems tasks, and everything in between. Does your experience mostly fall into one or two of those categories? Not a problem, as long as you're eager to get your hands dirty outside of your comfort zone.<p>Since you'll be joining a small technical team, you'll take the lead on core projects from day one and often work independently. We're nimble and push code almost every day, but because our product reaches tens of millions of users, everything must be bulletproof.<p>Skills and Qualifications:<p>- Ability to embrace the energy and drive of a close-knit start-up team.<p>- Self-starter with the creativity and initiative to brainstorm, propose, and dive into implementing solutions.<p>- Strong command of Python and up-to-date knowledge of its ecosystem. We love Python and use it throughout our back-end.<p>- Proficiency in JavaScript/HTML5/CSS3 and keen awareness of the state-of-the-art in browser technology. Our HTML-based document viewer is the face of Crocodoc, and we keep it polished.<p>- Familiarity with distributed computing. We use Celery to coordinate dozens of servers to process documents within a matter of seconds.<p>- Comfortable working in (and improving) a Linux-based development and deployment environment.<p>- Understanding of cloud-based infrastructure and all the benefits and drawbacks it provides. We're on Amazon AWS and dig its flexibility.<p>At Crocodoc, you'll be working with a savvy tech team that enjoys solving tough problems and loves to learn and leverage new technologies when it makes sense. If that sounds like your cup of tea, we'd love to hear from you. Please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.<p>---------------------------<p>## Inside Sales Rep ##<p>Crocodoc is looking for a sales representative with a technical background who has the hussle and know-how to close sales with engineers and product managers. You’ll be responsible for managing our growing pipeline, qualifying opportunities, and driving deals to closure. You’ll also have a unique opportunity to improve our sales process and, down the line, grow our sales organization.<p>Skills and Qualifications:<p>- Experience selling SaaS products (API products and developer tools a big plus)<p>- Experience writing web apps<p>- Ability to work well and build rapport with engineers and product managers<p>- World-class ability to communicate with clients and develop customer relationships<p>- Ability to be a self-starter and embrace the energy and drive of a close-knit start-up team<p>To apply for this opening, please email us at jobs@crocodoc.com!","time":1357061547,"type":"comment"},{"by":"learnstreet","id":4998055,"parent":4992617,"text":"LearnStreet (<a href=\"http://www.learnstreet.com\" rel=\"nofollow\">http://www.learnstreet.com</a>) | Palo Alto, CA | Full-time and Intern, Engineers &#38; Designers<p>LearnStreet is an early-stage startup focused on changing the way people of all backgrounds and skill levels learn how to code.<p>We are a small, passionate team of product craftsmen, hackers and designers doing what we love—building a service that inspires users to tap into their amazing potential. We believe putting the power of coding in more hands can unleash a wave of creativity that makes the world a better place for all of us.<p>The LearnStreet team is based in Palo Alto, California and backed by Khosla Ventures.<p>Software Engineer (Full-Time, Intern)<p>We are looking for front-end and back-end engineers who care deeply about using technology to make an impact in education, by making it easier for people to learn programming and computer science on the web. We want people who are ambitious and who will relish the challenge of building a product to educate millions of people around the world.<p>Although we aren't looking for a precise background or skill set, here are some traits we like: You like programming and building products. You’ve done some side projects on your own initiative. You enjoy working hard, figuring out what you need to do to get the job done, and then quickly learning what you need to get it done. You enjoy the excitement of working at an early-stage and ambitious Silicon Valley start-up.<p>Some of the technologies we use include Python (Flask), JavaScript, JQuery, MongoDB, and Node.js.<p>UI/UX designer (Full-Time, Intern)<p>We are looking for user interface / experience designers to join our design team. In this role, you will help create intuitive, usable and visually appealing user interfaces for online programming education. As part of the team, you will help define user models and interfaces for new and existing LearnStreet products and features, develop storyboards and mockups to communicate design ideas, assess the usability of new and existing products, and make constructive suggestions for changes. Background in interaction design is helpful. Experience with Photoshop is required, and experience with HTML and CSS is preferred.<p>If interested, please email jobs@learnstreet.com with your resume and portfolio (GitHub, Dribbble, etc.) if applicable.<p>For more information on LearnStreet, check out -<p>LearnStreet website: <a href=\"http://www.learnstreet.com\" rel=\"nofollow\">http://www.learnstreet.com</a>\nTechCrunch: <a href=\"http://techcrunch.com/2012/11/07/learnstreet-launches-with-1m-from-vinod-khosla-to-teach-you-how-to-build-and-push-code/\" rel=\"nofollow\">http://techcrunch.com/2012/11/07/learnstreet-launches-with-1...</a>\nGigaOm: <a href=\"http://gigaom.com/2012/11/07/khosla-backed-learnstreet-takes-on-codecademy-with-learn-to-code-site/\" rel=\"nofollow\">http://gigaom.com/2012/11/07/khosla-backed-learnstreet-takes...</a>\nWIRED: <a href=\"http://wiredinsider.tumblr.com/post/34100317516/learnstreet-the-addictive-new-way-to-learn-how-to-code\" rel=\"nofollow\">http://wiredinsider.tumblr.com/post/34100317516/learnstreet-...</a>","time":1357149762,"type":"comment"},{"by":"rgoldglass","id":4997093,"parent":4992617,"text":"Your next opportunity is with us<p>Avid Life Media Inc. is a leading social entertainment company that operates some of the most vibrant social networking and dating communities on the web. We currently have online presence in over 20 countries located around the world in a variety of languages, with aggressive plans to continue to expand the businesses. To support our continued compound annual growth and global expansion, we are looking for entrepreneurial, strategic and results oriented team members.<p>PHP Developer<p>As a PHP developer, working on properties such as Ashley Madison, CougarLife, Established Men, and ManCrunch you will be involved in all stages of developing the product you are working on. You'll create new product ideas and help guide the product roadmap, spec out what the next generation will look like, and implement it yourself. Because of this, we look for individuals who thrive in an environment where they will work creatively, take initiative and deliver on commitments.<p>The Challenge<p>As developers at Avid Life Media, we deal with some of the most challenging problems any of us have come across. The scale and speed of our growth force us to experiment with techniques and technologies only the very biggest websites ever need to use. Sometimes we find something other people have pioneered, and adapt it to fit our sites. Other times we’re the pioneers, inventing new solutions.<p>Here's what you'll do<p>-Contribute to product design and implementation discussions\n-Push the envelope on speed to implement projects from the idea phase to production\n-Test and iterate code before and after production release\n-Design, architect, implement, and QA new functionality<p>Here's what you'll need<p>-Experience with PHP\n-Strong JavaScript using JQuery\n-Good knowledge of SQL\n-Understanding of scalability, systems engineering, and algorithms\n-Sense of product and design\n-You know a lot of languages and you’re comfortable learning new ones quickly\n-You understand the importance of test/behaviour driven development\n-A general familiarity with Unix like operating systems (Linux, OS X, BSD) and a love for the power of the command line<p>It would be awesome if you had<p>-Experience with Ruby, Erlang, Objective-C\n-Experience with Sphinx, Lucene and/or Solr\n-Familiarity with Apache, Memcache, Nginx\n-Familiarity with Redis, Beanstalk\n-Knowledge of database scaling and common caching, sharding and partitioning approaches\n-BS or greater in an Engineering-related degree, Computer Science, Math, or Physics\n-Strong statistics/math skills (if you can’t measure it, you can’t understand it)<p>Qualified candidates should send a resume and cover letter to hr@avidlifemedia.com. In the e-mail subject line please reference \"Developer\".","time":1357140318,"type":"comment"},{"deleted":true,"id":4992914,"parent":4992617,"time":1357057449,"type":"comment"},{"deleted":true,"id":4992913,"parent":4992617,"time":1357057401,"type":"comment"},{"by":"urgeio","id":4993331,"kids":[5001136],"parent":4992617,"text":"BERLIN/THE FACTORY, BRAND NEW: Node.js + NoSQL Growth Hacker for High Traffic Site (Fulltime)<p>Top 5 reasons why you should move to Berlin, right now:<p>1. Absolutely lowest livings costs with highest quality of living. Stay in gorgeous, perfectly renovated apartments in pre-WWII residential buildings with high ceilings, right in the middle of the center and pay a fraction of costs of any other capital (even cheaper than any Eastern European capital). No need for a car—Berlin has one of the densest subway nets and wide streets make biking fun.<p>2. A vibrant and Europe's fastest growing ecosystem of smart people and tons of networking events. A vast number of new software talents, founders, software companies and VCs move to Berlin every day (Twitter, Google/Google for Entrepreneurs, Soundcloud, Early Bird, Mozilla and many more).<p>3. People here are open-minded, outgoing, mix well and international—no need to learn one word German, everyone speaks English. Making new friends is a matter of days. Visit tons of networking and startup events.<p>4. Easy work permissions—Europeans do not need any and can work from day one and the rest applies for the hassle-free Blue Card.<p>5. Berlin's night life is unmatched, huge and changing every day (plus ridiculously cheap). Berlin has got some of the most dazzling, naughty, and original clubs on the face of the Earth.<p>Berlin is calling and getting the new tech hub of Europe. If you are passionate about building great software, we’d love to talk with you. If you don't live in Berlin yet, we could help to fix that.<p>APPLY NOW =&#62; <a href=\"http://urge.io/jobs\" rel=\"nofollow\">http://urge.io/jobs</a>","time":1357064252,"type":"comment"},{"by":"zukhan","dead":true,"id":4995135,"parent":4992617,"text":"FULLTIME or INTERN. Offices in San Francisco, Menlo Park, and Boston<p>Delphix is a data virtualization company that is doing for databases what VMware did for servers - this is a massive market, and we are on track for similar success. We're looking for software generalists to help build our full stack, from the operating system and filesystem, to the Java management stack, and the GUI.<p>The engineering team at Delphix is composed of the inventors and architects of the VMware platform, ZFS filesystem, DTrace, Oracle RAC, DataGuard, and Flashback.<p>We've built an engineering culture where anyone with a good idea can have a voice and drive unique projects. Whether it's developing new abstractions in the filesystem, designing an architecture to interoperate with a novel database, or developing a new cloud paradigm for virtualizing data, there is no lack of hard problems and opportunities at Delphix.<p>The Delphix platform has already established itself as the premier platform for structured data management in the enterprise world. In our first year of selling, we added 50 large corporate customers, including many from the fortune 500 (Proctor &#38; Gamble, RBS, Fidelity, Deutsche Bank, Comcast, Staples, Qualcomm, among others). Year 2 revenue is growing at 300%.<p>Check out our technical blog at <a href=\"http://blog.delphix.com\" rel=\"nofollow\">http://blog.delphix.com</a>.<p>News coverage: <a href=\"http://www.prnewswire.com/news-releases/delphix-raises-25-million-in-series-c-funding-157445155.html\" rel=\"nofollow\">http://www.prnewswire.com/news-releases/delphix-raises-25-mi...</a>","time":1357096614,"type":"comment"},{"by":"wroberts","dead":true,"id":4993172,"parent":4992617,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons. Our top-100 app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some passionate people to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel Partners, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1357061739,"type":"comment"},{"by":"streeter","dead":true,"id":4993168,"parent":4992617,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons. Our top-100 app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some passionate people to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel Partners, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1357061663,"type":"comment"},{"by":"danielepolencic","dead":true,"id":4996022,"parent":4992617,"text":"Which? (<a href=\"http://www.which.co.uk/\" rel=\"nofollow\">http://www.which.co.uk/</a>) - London, UK<p>At Which?, we believe that individuals can be as powerful as the organisations they have to deal with in their daily lives. We engage in advocacy campaigns on various consumer protection issues and aim to promote informed consumer choice in the purchase of goods and services, by testing products, highlighting inferior products or services, raising awareness of consumer rights and offering independent advice.<p>But for us, that's not enough. We want to look after consumers wherever and whenever they are to help them make the right decisions. So, we're currently revamping our digital presence by building a better infrastructure to support our products. As an example of what we've been up to, we recently launched <a href=\"http://university.which.co.uk\" rel=\"nofollow\">http://university.which.co.uk</a> which is a new mobile-friendly website designed to help students make more informed decisions about their higher education choices.<p>The biggest challenge we face is designing and building a very broad range of other products in a more service-oriented and cross-platform manner. This will mean that there is a lot of starting from scratch, and having to decide upon the right tool for the right job (we're currently into Nodejs, Ruby, Java and PHP).<p>So if you are a great team player and you are into designing service oriented application, playing with large volume of data aggregation or you just love to solve challenging problems, we'd like to hear what you think. We are hiring front-end and back-end developers.<p>We're a diverse, sociable team, and you'll have the opportunity to make a big impact on the company and its future success.<p>Feel free to email us at recruitment@which.co.uk for more information.","time":1357121534,"type":"comment"},{"by":"rattab","dead":true,"id":4994358,"parent":4992617,"text":"Montreal(MTL), Canada(CAN)<p>* Datacratic (<a href=\"http://datacratic.com\" rel=\"nofollow\">http://datacratic.com</a>, <a href=\"http://datacratic.com/site/careers\" rel=\"nofollow\">http://datacratic.com/site/careers</a>)<p>The team is made up of engineers, and scientists and we are creating a real-time data platform that allows developers to easily and efficiently create sophisticated, predictive, machine-learning applications.<p>Our systems deal with the aggregation of tens of thousands of network events per second, updating complex internal data structures, and scheduling and executing machine learning models. All of this on 16 or more CPU cores with hard real-time constraints.<p>* C++ Software Developer (<a href=\"http://datacratic.theresumator.com/apply/zIk4Dc/C-Software-Developer-Developpeur-Logiciel-C.html\" rel=\"nofollow\">http://datacratic.theresumator.com/apply/zIk4Dc/C-Software-D...</a>)<p>We're looking for someone to help write the real-time machine learning platform onto which all our products are built.<p>We are pushing the limits of what a machine can do in both memory size and processing capacity and we need someone who can help us push them further.<p>We love C++11 and we make extensive use of Boost, ZeroMQ and Linux system calls.<p>* Software Developer (<a href=\"http://datacratic.theresumator.com/apply/BM6u6M/Software-Developer-Dveloppeur-Logiciel.html\" rel=\"nofollow\">http://datacratic.theresumator.com/apply/BM6u6M/Software-Dev...</a>)<p>We are looking for generalist software developers to work on the productization of our applications: creating systems and processes for configuration and control, reporting and visualization, monitoring and deployment, as well as working with our clients to adapt our technology to their needs and develop new features as appropriate.<p>We value personal initiative, accountability and collaboration. We're committed to mentoring and we expect you to walk out the door a better developer than when you walked in.","time":1357081048,"type":"comment"},{"by":"ginkgoo","dead":true,"id":4993508,"parent":4992617,"text":"Boston, MA - 1 year paid internship for programmers to learn to hack biology.<p>Ginkgo BioWorks is a well-funded MIT spinout that genetically engineers organisms that make the world better. Stop building web apps and work on something that matters: <a href=\"http://ginkgobioworks.com/careers.html\" rel=\"nofollow\">http://ginkgobioworks.com/careers.html</a><p>apply here: <a href=\"https://ginkgo.resumetracker.com/public/job_detail/83\" rel=\"nofollow\">https://ginkgo.resumetracker.com/public/job_detail/83</a>","time":1357067206,"type":"comment"}]}