{"comments":[{"by":"tptacek","id":5151976,"kids":[5152644],"parent":5150834,"text":"SFBA, NYC, Chicago<p>Matasano is always hiring application security people, and I'm always happy to talk to systems developers who'd like to do more appsec and software security. We're like the antistartup job: instead of sinking 1-2 years of your time into building a single product built on a single stack, you work with hundreds of firms unbuilding systems running on practically every stack.<p><a href=\"http://www.matasano.com/careers/\" rel=\"nofollow\">http://www.matasano.com/careers/</a> goes into a <i>lot</i> of detail about our hiring process, which people seem to like.<p>I'll be out in Mountain View next week if you're interested in what we do and might want coffee.<p>Special offer: if you're wondering what the day-to-day of our work is and want to learn some interesting things about breaking crypto, mail \"sean\" at Matasano and Sean will send you a series of cryptographic exercises, 40+ in total, ranging from CS101 stuff through block cipher attacks to number theoretic crypto.","time":1359738986,"type":"comment"},{"by":"sethbannon","id":5151055,"parent":5150834,"text":"Amicus (YC S12), New York City, Full Time, H1B<p>We're hiring developers across the stack.<p>Here are some interesting things we'll be working on soon at Amicus (<a href=\"http://amicushq.com/\" rel=\"nofollow\">http://amicushq.com/</a>):<p>+ A realtime collaborative community environment for supporters of nonprofits to communicate, and provide each other encouragement. This will involve realtime javascript with node.js, socket.io, and backbone.js<p>+ Machine learning and statistical analysis on demographics and how they relate to outreach/fundraising effectiveness<p>+ Open source projects, including our own in house, soon to be open sourced, realtime Model View Presenter javascript framework with bi-directional data binding<p>+ Realtime data visualization with D3, including D3's map projection, to create data visualizations to help nonprofitss understand the impact Amicus is having on their organization<p>+ And for lulz: A Minecraft mod/voxel.js project for devirtualizing virtualized servers. Basically a minecraft mod that allows you to control AWS instances by putting down/picking up blocks :-)<p>Sound interesting? Want to change the world for the better? Head over to <a href=\"http://jobs.amicushq.com/\" rel=\"nofollow\">http://jobs.amicushq.com/</a>","time":1359731008,"type":"comment"},{"by":"spicyj","id":5151082,"kids":[5153007],"parent":5150834,"text":"Khan Academy<p>Mountain View, CA - full-time and intern, designers and devs<p>We're a non-profit whose mission is to provide a world-class education to anyone, anywhere. We're scaling quickly. Our students answer over 2 million math problems per day (over 950mm total so far), all generated by our open source exercise generation framework (<a href=\"https://github.com/Khan/khan-exercises\" rel=\"nofollow\">https://github.com/Khan/khan-exercises</a>), and our videos (now from a variety of authors including Sal) have been viewed over 220mm times. We're tracking all that data and using it to customize each student's experience as well as building brand-new tools like our new programming environment (<a href=\"http://ejohn.org/blog/introducing-khan-cs/\" rel=\"nofollow\">http://ejohn.org/blog/introducing-khan-cs/</a>).<p>We could use your help. Working for Khan Academy is one of the highest educational impact positions you can imagine, and we've been called by Wired one of the best places to work in Silicon Valley: <a href=\"http://news.ycombinator.com/item?id=4157078\" rel=\"nofollow\">http://news.ycombinator.com/item?id=4157078</a>.<p>We're hiring designers and all types of devs -- mobile, frontend, backend, data scientist, whatever you want to call yourself.<p>Big plans ahead.<p><a href=\"https://www.khanacademy.org/careers/interns\" rel=\"nofollow\">https://www.khanacademy.org/careers/interns</a><p><a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https://www.khanacademy.org/careers</a>","time":1359731259,"type":"comment"},{"by":"thematt","id":5151294,"kids":[5151677,5211619],"parent":5150834,"text":"Blue Origin (<a href=\"http://www.blueorigin.com\" rel=\"nofollow\">http://www.blueorigin.com</a>)<p>Seattle, WA<p>We're offering the rare opportunity to work on spaceflight! We have a number of different software related positions open, including enterprise software, engineering software, product management, big-data, infrastructure and even hardware stuff.<p>Here are some openings:<p>- Software Engineer: Enterprise Systems (<a href=\"http://careers.stackoverflow.com/jobs/29631/software-engineer-enterprise-systems-blue-origin\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/29631/software-enginee...</a>)<p>- Software Engineer: Engineering Tools (<a href=\"http://careers.stackoverflow.com/jobs/29452/software-engineer-engineering-tools-development-blue-origin\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/29452/software-enginee...</a>)<p>- Technical Product Manager (<a href=\"http://careers.stackoverflow.com/jobs/29628/technical-product-manager-blue-origin\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/29628/technical-produc...</a>)<p>- Senior Build Engineer (<a href=\"http://careers.stackoverflow.com/jobs/29625/senior-build-engineer-blue-origin\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/29625/senior-build-eng...</a>)<p>- Avionics Engineer (<a href=\"http://www.blueorigin.com/careers/careers-avionics-engineer.html\" rel=\"nofollow\">http://www.blueorigin.com/careers/careers-avionics-engineer....</a>)<p>These are some great opportunities for which we'd love to add some ambitious hackers to our ranks. Each job has it's own particular set of requirements, so check them out.<p>We have more than just what's posted, so please send us your resume if you're at all interested in what we're working on. Email: jobs@blueorigin.com","time":1359733251,"type":"comment"},{"by":"whit537","id":5151269,"kids":[5152046],"parent":5150834,"text":"Gittip - <a href=\"https://www.gittip.com/\" rel=\"nofollow\">https://www.gittip.com/</a> - remote<p>We're an open company that's turning the economy inside out. Our product centers on small, weekly, anonymous, cash gifts to people you love and are inspired by.<p>Gittip launched 7 months ago with a single founder and has bootstrapped to about 600 active users moving about $1,500 per week. The concept has legs and now we're assembling a team to take it as far as we can. We started recruiting four weeks ago and have already added a dozen core contributors.<p>Gittip is funded on Gittip. Full-fledged employees receive no salary (per the definition of an open company) and have access to restricted resources such as production data, customer service accounts, etc.<p>Contact: Chad Whitacre - chad@zetaweb.com, @whit537, +1-412-925-4220, irc.freenode.net/#gittip<p>Thanks! :^)<p>More info:<p>\"Design Gittip\"\n<a href=\"http://blog.gittip.com/post/41348666944/design-gittip\" rel=\"nofollow\">http://blog.gittip.com/post/41348666944/design-gittip</a><p>\"Gittip is Hiring\"\n<a href=\"http://blog.gittip.com/post/39687487576/gittip-is-hiring\" rel=\"nofollow\">http://blog.gittip.com/post/39687487576/gittip-is-hiring</a><p>\"The First Open Company\"\n<a href=\"http://blog.gittip.com/post/26350459746/the-first-open-company\" rel=\"nofollow\">http://blog.gittip.com/post/26350459746/the-first-open-compa...</a>","time":1359732982,"type":"comment"},{"by":"josh2600","id":5151048,"kids":[5151179],"parent":5150834,"text":"2600hz is hiring in San Francisco (and remote). Accepting H1B candidates who meet the requirements below.<p>We're building an operating system for telecom and we're looking for people that love Erlang and/or are willing to learn.<p>Our stack is:<p>* Kamailio at the border<p>* Freeswitch as the media engine<p>* our Erlang logic layer<p>* rabbitMQ<p>* couchDB<p>We are also very active in the hardware worlds.<p>Working at 2600hz will be the most fun and hopefully the biggest challenge you've faced so far. Telecom is a big problem and we're fixing it (did I mention we're open-source?).<p>Benefits:<p><i>health/dental/vision<p></i>competitve salary<p><i>potential equity depending on skill level<p></i>challenging work environment<p><i>dog friendly<p></i>the coolest/nicest coworkers on the planet.<p>If this is interesting email j[at]2600hz[dot]com.","time":1359730950,"type":"comment"},{"by":"dman","id":5152485,"kids":[5157732],"parent":5150834,"text":"Enthought - Austin TX, NYC, London, Cambridge, Mumbai<p>==============================================<p>Work with Python hackers building next generation Python development tools. Help create next generation IDE's, UI frameworks and data analysis platforms for Python.<p>Among other things we are looking for a Lead Web Services Developer to build the services serving our IDE. Additional information is available about this position at:<p><a href=\"http://www.enthought.com/company/lead_web_services_developer.php\" rel=\"nofollow\">http://www.enthought.com/company/lead_web_services_developer...</a><p>We also have multiple openings for Senior Software Developers focusing on Data Analysis. You could come into this role from various different backgrounds<p>1) Computer Graphics - past background in interactively visualizing large amounts of data.<p>2) Data analysis - past background in using machine learning / statistics to draw inferences from large amounts of data.<p>3) Writing fast software - If you are well versed in the art of getting maximal performance out of your code and are strong in C / C++.<p>4) Python Wizard - If you know all things Python and have written large scale software in Python.<p>Additional information about this position is available at:<p><a href=\"http://www.enthought.com/company/sr_sw_developer.php\" rel=\"nofollow\">http://www.enthought.com/company/sr_sw_developer.php</a><p>Please contact me at dsharma at enthought dot com if you have any questions. I work as a Software Developer here and would be happy to talk about our tech stack and any other questions you might have.","time":1359743819,"type":"comment"},{"by":"pbiggar","id":5151422,"kids":[5151700,5153330],"parent":5150834,"text":"SF or REMOTE fulltime (near pacific time) CircleCI: designers, frontend, backend engineers.<p>At CircleCI (<a href=\"https://circleci.com\" rel=\"nofollow\">https://circleci.com</a>), we're building Heroku for Continuous Integration. We have traction and revenue. Our customers love us, because we move quickly and provide amazing support. All employees talk to customers and are on support rotation.<p>We eat our own dogfood, DevOps, A/B test, do Continuous Deployment and Customer Development.<p>We're looking for: designers that can write HTML &#38; CSS, Frontend Engineers and Backend Engineers.<p>We're still a small team, so you'll have a large impact on company culture. We're highly influenced by Valve's Employee handbook, and the culture at GitHub, Stripe, etc. SF-local employees have catered lunch every day.<p>The frontend is a fat javascript client, using HamlCoffee, Less and Knockout. We have a lot of interesting design and data-visualization problems that need to be solved.<p>The backend is written in Clojure. Backend engineers should know Clojure or another 'weird' language (Haskell, Scala, Scheme, etc), and Linux Devops (C compilation model, make, packaging).<p>Contact us at jobs@circleci.com. Include samples of awesome stuff you've done.","time":1359734199,"type":"comment"},{"by":"AdamGibbins","id":5151009,"parent":5150834,"text":"Boston, MA. TIM Group (previously youDevise) are hiring a Senior Linux Sysadmin.<p>We're a 100 person market leading financial software firm with offices in Boston, New York, London and Hong Kong. Rated one of the fastest growing tech companies in the UK by The Sunday Times (<a href=\"http://www.fasttrack.co.uk/fasttrack/leagues/dbtechDetails.asp?siteID=3&#38;compID=3219&#38;yr=2012\" rel=\"nofollow\">http://www.fasttrack.co.uk/fasttrack/leagues/dbtechDetails.a...</a>).<p>We're a continually iterating self managed team doing awesome things with Puppet, MCollective, Ruby, Graphite, Logstash, KVM, MySQL, MongoDB, JVMs and continuous deployments.<p>We'd love to talk to you, please get in contact with any questions.<p><a href=\"http://www.timgroup.com/careers/current-vacancies/system-administrator-linux\" rel=\"nofollow\">http://www.timgroup.com/careers/current-vacancies/system-adm...</a>","time":1359730672,"type":"comment"},{"by":"kloncks","id":5151372,"parent":5150834,"text":"Ribbon (<a href=\"https://www.ribbon.co\" rel=\"nofollow\">https://www.ribbon.co</a>) is hiring. Full time in San Francisco. No remote. Front-end Developers, Designers, Rails Devs.<p>Looking to add to our team of five. Ribbon is building a frictionless payments and ecommerce platform that does the transaction wherever the buyer is. Imagine purchasing an item without leaving Facebook, or buying directly from within the Twitter stream, or through email. That's what we're building for consumers, businesses and developers in an elegant way with a huge focus on design.\nLooking for someone excited at the stage we're at: dealing with first customers, ramping up traction, figuring out new product direction and features - and also excited about the challenges we'll face, like making payments simplified for consumers and dealing with huge technical issues with fraud and building payments infrastructure.<p>We went through AngelPad in the fall and raised a big seed round from great investors. Awesome office in San Francisco, penthouse floor with views of twin peaks and the ballpark in soma.<p>- Some recent press coverage for more details: <a href=\"http://techcrunch.com/2012/11/20/ribbon-a-bit-ly-with-paymen...\" rel=\"nofollow\">http://techcrunch.com/2012/11/20/ribbon-a-bit-ly-with-paymen...</a>. <a href=\"http://gigaom.com/2012/11/20/shopping-everywhere-ribbon-turn...\" rel=\"nofollow\">http://gigaom.com/2012/11/20/shopping-everywhere-ribbon-turn...</a>.<p>Contact jobs@ribbon.co if interested.","time":1359733757,"type":"comment"},{"by":"nrh","id":5150903,"kids":[5150971],"parent":5150834,"text":"Spotify, NYC and Stockholm, for...lots of stuff!<p>- Backend Engineers: Improve our ad systems and enable better, more relevant targeting.  Build and scale our backends.<p>- Frontend Web Developers: Mine, aggregate and visualize complex data.  Engage users and optimize front-end experiences.  Build advertising platforms and tools.<p>- Web Developer Team Lead: Build and lead a team of web engineers to create the next generation of Spotify experiences<p>- Machine Learning: Improve our music recommendations, mine those datasets!<p>- Mobile (iOS and Android): I heard something about 1B smartphones by 2015.<p>- Mobile Team Lead<p>- Backend Infrastructure: Build the stuff that the guys building the stuff are building it with; Storage, high-performance messaging, service registration and discovery.<p>- Lots of things not-mentioned (<a href=\"http://www.spotify.com/se/jobs/\" rel=\"nofollow\">http://www.spotify.com/se/jobs/</a>)<p>On the backend, we have an (extremely) service-oriented architecture written primarily in Python and Java with smatterings of C++ and others thrown in. Storage is Postgres or Cassandra. Messaging is zmq and protobuf and a few other interesting things.<p>On the frontend, we do hybrid native+CEF for most platforms.<p>Our website gets a lot of oohs and aahs for being a particularly good example of parallax scrolling.<p>We're looking for experienced developers, no junior roles, sorry.\nApply on the website, but mention HN and get bumped to the top of the resume pile!","time":1359729800,"type":"comment"},{"by":"ig1","id":5150964,"parent":5150834,"text":"A bit of advice for job posters: include a link to your homepage, it makes it much easier for job seekers to check you out.","time":1359730303,"type":"comment"},{"by":"lloyddobbler","id":5152346,"parent":5150834,"text":"FullContact - Denver, CO<p>Looking for a Senior AWS System Admin/DevOps Engineer and an Integration Product Manager.<p>-----------<p>About Us:<p>We’re solving the world’s contact information problem. As we like to say: “If you’ve got an address book, you’ve got an address book problem.” Most people have duplicate, partial, and out-of-date contacts - and they’re scattered everywhere. It’s a mess. Businesses have the same problem, but it’s actually worse when you consider that a company has a bunch of employees, CRMs, Marketing Automation systems, Billing platforms, Help Desk applications.<p>As Dropbox did for files and Evernote did for notes - FullContact is doing the same for contacts. And we’re providing it to Individuals, Businesses and Developers.<p>We were a TechStars Boulder 2011 company. We’re lean, mean and funded by Foundry Group, Tango Group and awesome investors like Brad Feld, David Cohen, Dave McClure, Howard Lindzon and Eric Norlin.<p>-----------<p>Some of the Perks:<p>- Competitive salary based on experience<p>- Generous stock options<p>- 100% paid Medical, Dental and Vision for you as well as Spouse or Family coverage for less than $125 per month.<p>- 10 paid holidays<p>- 15 days paid personal leave<p>- Paid, PAID vacation: in addition to paid personal leave, once a year we’ll actually PAY you $7500 to take an awesome vacation! (Yes, you read that right. More info: <a href=\"http://ful.lc/11p4NOa\" rel=\"nofollow\">http://ful.lc/11p4NOa</a>)<p>- Free Eco Pass<p>- Free Downtown Denver Parking<p>- Opportunity to attend industry events and conferences<p>- Stocked Fridge, Coffee, and Snacks<p>- Lots and lots of free Beer<p>-----------<p>If you're local to Denver and interested in tackling big problems in the contact management space, we want to talk to you. Get more info and apply here: <a href=\"http://ful.lc/YoVtoE\" rel=\"nofollow\">http://ful.lc/YoVtoE</a>.","time":1359742594,"type":"comment"},{"by":"ladon86","id":5151836,"parent":5150834,"text":"ClassDojo<p>FULLTIME in SAN FRANCISCO, CA<p>ClassDojo is used by over 4mm teachers and students to manage behavior in the classroom, using real time feedback and rewards that can also be shared with parents. We're an edtech startup with $1.6mm in funding some of the biggest names in the valley (Jeff Clavier, Ron Conway, General Catalyst, Mitch Kapor...), and we're one of the fastest growing education companies of all time. Paul Graham invested in us, but we didn't do YC.<p>We've built a product that makes a real difference and gets huge engagement with millions of kids, and we're about to take it to the next level, hopefully with you on board. If you're a strong hacker who wants to use JavaScript to change the world, apply here:<p><pre><code>  --------------------------  \n\n\n  https://classdojo.wufoo.com/forms/join-classdojo/  \n\n  --------------------------    </code></pre>\nOr email jobs@classdojo.com. You can read about the work and environment here: <a href=\"http://www.classdojo.com/jobs\" rel=\"nofollow\">http://www.classdojo.com/jobs</a><p>We are looking for:<p><pre><code>  * Full Stack Engineer\n\n  * Front-end Engineer    </code></pre>\nIf you think you're a good developer but don't fit into those buckets, get in touch anyway.","time":1359737637,"type":"comment"},{"by":"jboggan","id":5151878,"kids":[5172833],"parent":5150834,"text":"Factual is currently hiring engineers and data lovers of all levels in Palo Alto, Los Angeles, and Shanghai.\nRemote work is possible for exceptional candidates who are US citizens and living in the US ('exceptional' meaning you are a great engineer and have lots of machine learning/data extraction/NLP/etc. experience that is relevant to what we do).<p>Factual's vision is to be an awesome and affordable data provider that enables developers, startups, and big companies to focus on innovation instead of data acquisition. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners/customers include Facebook, Yelp, Foursquare, Trulia, and Newsweek.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. If you love data, Factual is the place to be. Our main criteria are that you're smart and get things done, but you'll get bonus points for experience with Clojure, machine learning, NLP, algorithm design, or Hadoop. Our LA office is our headquarters and our new Palo Alto office is still small, so new hires would have a huge impact on the culture there.<p>You can email me personally at jake@factual.com, or view our job postings and apply directly via Jobvite:<p>Palo Alto Software Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oTR1Vfwq&#38;s=Hackernews</a><p>Los Angeles Software engineer: <a href=\"http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oQR1Vfwn&#38;s=Hackernews</a><p>Los Angeles Data Engineer: <a href=\"http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews\" rel=\"nofollow\">http://hire.jobvite.com/j/?cj=oSS1Vfwq&#38;s=Hackernews</a>","time":1359738070,"type":"comment"},{"by":"pandemicsyn","id":5151788,"parent":5150834,"text":"Rackspace Cloud Files - San Antonio/Austin/San Francisco/Remote<p>Cloud Files is Rackspace's OpenStack Swift powered scalable cloud object store. It handles billions of requests every month, stores petabytes of data, spans across hundreds of servers, and is deployed across multiple data centers.<p>We're growing exponentially so my team's looking to add another Ops engineer to help handle some of the load. If you come hack with us you'll own a core piece of Rackspace's cloud infrastructure. In the morning you might work on release automation, and in the afternoon you might be performance testing a shipment of the latest and greatest SSD's. There's huge opportunities to make a meaningful impact on the product in whatever your area of expertise is.<p>You should come hack with us!<p>DevOps/Ops Engineer - <a href=\"http://rfer.us/RAXoex2zD\" rel=\"nofollow\">http://rfer.us/RAXoex2zD</a>","time":1359737176,"type":"comment"},{"by":"fortawesome","id":5150942,"kids":[5151770],"parent":5150834,"text":"Boston | Full-Time | Kyruus | <a href=\"http://kyru.us\" rel=\"nofollow\">http://kyru.us</a><p>Hi. I'm Dave Gandy. I'm the lead product designer at Kyruus. I wake up every single day excited about my job. Why? <i>Kyruus is going to change healthcare.</i> No exaggeration.<p>Kyruus is a well-funded, big data healthcare startup in Boston. We believe that the right data at the right time can help doctors make better decisions. <i>We believe data can save lives.</i><p>WHAT I LOVE ABOUT KYRUUS:<p>- Product design. From the top of the organization, Kyruus is committed to product design done right. It's awesome.<p>- Purpose. Every day, I get to help make the world a better place – a little at a time.<p>- People. I work with some of the best people I've ever met. More than just smart people. Good people.<p><i>Kyruus needs good people.</i> Specifically, a UI/UX developer to join the design team. Come work with me.<p>ABOUT YOU<p>- You think users should drive how things are designed.<p>- You think design should drive what gets built.<p>- You love the intersection between art and technology.<p>- You often start designing on paper.<p>- You like to prototype directly in HTML &#38; CSS with a dash of JS.<p>- You know the difference between UI and UX.<p>- You'd describe yourself mostly as a UI designer.<p>- Programmers think you're a designer. Designers think you're a programmer.<p>- You have a GitHub repository. You might have even contributed to an open-source project or two.<p>- You have examples of websites you've designed.<p>SOUND INTERESTING? Feel free to contact me directly. I look forward to meeting you.<p>Dave Gandy - dgandy@kyru.us<p>Lead Product Designer, Kyruus - <a href=\"http://kyruus.com/careers\" rel=\"nofollow\">http://kyruus.com/careers</a><p>Creator &#38; Maintainer, Font Awesome - <a href=\"http://fortawesome.github.com/Font-Awesome/\" rel=\"nofollow\">http://fortawesome.github.com/Font-Awesome/</a>","time":1359730108,"type":"comment"},{"by":"jshen","id":5153259,"parent":5150834,"text":"Los Angeles, CA (Glendale)<p>Disney Interactive, we work on <a href=\"http://disney.com\" rel=\"nofollow\">http://disney.com</a><p>We're hiring developers across our whole stack and at all levels of experience. We use a mix of Ruby on Rails, heavy client side javascript with backbone, and Java for our search a data needs (solr, hadoop, etc).<p>If interested email me at jay.donnell@disney.com","time":1359750493,"type":"comment"},{"by":"frisco","id":5152532,"parent":5150834,"text":"Transcriptic: Core Developer<p>Menlo Park, CA<p>Transcriptic is the \"Amazon Web Services\" for life sciences. Rather than carry out wet-lab experiments by hand, researchers can code up (or visually configure) their experimental protocols and then run them in Transcriptic's central, highly automated 'biocenter' in an on-demand way. Customers have no upfront capital costs and pay for only what they use. Life science research today is incredibly slow, error-prone, monotonous, and expensive with researchers spending many hours a day every day just moving small volumes of liquids from one place to another. We're building a long-term company to completely change the way life science research and development is done.<p>We're looking for highly talented full-stack web developers as well as combined background EE/CS engineers for automation integration and development. Experience reverse engineering USB based protocols is a plus.<p>We're a very small startup (you'd be #4), but well funded and have customers. You'd be able to work on interesting science and hard technology in a really small, all technical team with lots of freedom and resources.<p>A biology background is preferred but not strictly necessary for outstanding people. The codebase is mostly Ruby and Scala, with some Python.<p>max at transcriptic.com<p><a href=\"https://www.transcriptic.com/\" rel=\"nofollow\">https://www.transcriptic.com/</a>","time":1359744445,"type":"comment"},{"by":"dubisaweapon","id":5151037,"parent":5150834,"text":"Two Sigma (SoHo, NYC) - Full Time, Intern, H1B<p>Did you know there's a company based in New York City that has enough technology to be considered among the world's Top 250 supercomputing sites? One that imports over 5TB of data every single day, and has alumni from Google, Intel, and Microsoft?<p>You might think I'm talking about some stealth-mode startup, but I'm talking about where I work: Two Sigma Investments. At our core, we're a technology company applying our talents to the domain of finance. We've created a system that combines artificial intelligence and keen human insight — a system that's constantly improving and advancing.<p>We're looking for a diverse set of technologists to join our team. Our challenges require mastery of areas such as kernel level development, machine learning, and distributed systems. Our team includes a Unix Lifetime Achievement winner, Putnam medalists, ACM Programming competition finalists, and International Mathematics Olympiad medalists. We are proud of our individual pedigrees, but even prouder of our teamwork.<p>We tend to hire people with at least a bachelor’s degree in a technical or quantitative field and experience with C or languages that target the JVM, but we are open-minded in our search for critical thinkers who are passionate about technology. We analyze the data-rich domain of finance, but financial experience is not a requirement. We hope to hear from you!<p>Dave Hahn\ndave.hahn@twosigma.com<p>For a full list of current openings, please visit: <a href=\"http://www.twosigma.com/careers.html\" rel=\"nofollow\">http://www.twosigma.com/careers.html</a>","time":1359730904,"type":"comment"},{"by":"alexschiff","id":5151890,"parent":5150834,"text":"Fetchnotes (TechStars Boston Fall 2012) is hiring a front-end engineer, a lead designer and a metrics engineer in Cambridge, MA.<p>Our mission is to make productivity as simple as a tweet. We help people keep track of what they need to do the same way their brain works - like a Twitter for the inside of your mind. What makes us really unique, though, is that we actually help you get things done too. You can see some of our press and details on job offerings on our AngelList: angel.co/fetchnotes<p>We're a small team tackling a universal problem that has yet to be solved despite a plethora of attempts. If you enjoy that kind of challenge, you'll fit right in. Some things that makes us unique:<p>-Our mobile apps are all HTML5 using Trigger.io, so you can use your web skills to create awesome mobile experiences<p>-No one in our 4 person company ever graduated college<p>-We are a TechStars-backed company, which means you have access to one of the widest entrepreneurial networks on the planet.<p>-We raised a year’s worth of server costs by singing karaoke to our users. We also rick-rolled 10,000 of them. Seriously. Google “Fetchnotes karaoke.”<p>-We have a tournament ranked table tennis player, he’ll beat you with his tiny paddle, “the Humiliator.”<p>-We like standing desks, internet cats, and scotch.<p>-We also have an engineer that wears those toe shoes.<p>Our super jenk jobs descriptions page: <a href=\"http://bit.ly/11oRqgX\" rel=\"nofollow\">http://bit.ly/11oRqgX</a>. Can you tell we need a designer? ;)<p>You can also reach out by email to alex@fetchnotes.com.","time":1359738200,"type":"comment"},{"by":"SendGrid","id":5152033,"kids":[5160956],"parent":5150834,"text":"Anaheim, CA (That's right! Orange County or the OC) or Boulder/Denver, CO (full-time)<p>SendGrid <a href=\"http://www.sendgrid.com\" rel=\"nofollow\">http://www.sendgrid.com</a><p>-------------------------------------<p>We've revolutionized the cloud-based transactional email space by efficiently powering the infrastructure for tens of thousands of companies that rely on us to send millions of emails every day. We have been growing really fast since launching in 2009, and we want you to be part of the awesome company we are building.<p>-------------------------------------<p>All Jobs - <a href=\"http://sendgrid.com/careers.html\" rel=\"nofollow\">http://sendgrid.com/careers.html</a><p>Software Engineer (multiple teams) - <a href=\"http://sendgrid.com/careers/job.html?id=8a42a12b3c1d85fb013c20cfd6805e74\" rel=\"nofollow\">http://sendgrid.com/careers/job.html?id=8a42a12b3c1d85fb013c...</a><p>DevOps Engineer - <a href=\"http://sendgrid.com/careers/job.html?id=8ad8dbd138d2529b0138e4a9351e7980\" rel=\"nofollow\">http://sendgrid.com/careers/job.html?id=8ad8dbd138d2529b0138...</a><p>SDET - <a href=\"http://sendgrid.com/careers/job.html?id=8a42a12b35ce05670135d0582c855129\" rel=\"nofollow\">http://sendgrid.com/careers/job.html?id=8a42a12b35ce05670135...</a><p>Sr. Linux Engineer - <a href=\"http://sendgrid.com/careers/job.html?id=8a42a12b3a4027c0013a4bda2afc6203\" rel=\"nofollow\">http://sendgrid.com/careers/job.html?id=8a42a12b3a4027c0013a...</a><p>UI/UX Designer - <a href=\"http://sendgrid.com/careers/job.html?id=8a42a12b3c34506f013c4ecf3f5854bc\" rel=\"nofollow\">http://sendgrid.com/careers/job.html?id=8a42a12b3c34506f013c...</a>","time":1359739382,"type":"comment"},{"by":"blo","id":5152206,"parent":5150834,"text":"Vurb - San Francisco, CA (SOMA) - Full Time - Early-stage (0.5-2+% equity)<p>Looking for engineers in the following areas:<p><pre><code>  * JavaScript (Backbone.js, node.js) - development in the frontend,\n      backend, or both\n  * Mobile (iOS) - lead development of our native mobile platform\n  * Search / Data Scientist - classification algorithms, \n      search (e.g., ElasticSearch), NLP\n</code></pre>\n---<p>About us: we're changing the way people search and interact with online services in a way that's more more usable, efficient, and social (e.g., no more having ten browser tabs open to assemble the information you need). We do this through unique UX/UI combined with search, machine learning, big data, and other fun technologies.<p>We've been in stealth while we focus on building. We're funded by many notable investors (people on the boards of Yelp, Yahoo, Dropbox, etc.).<p>We're all engineers (MIT, Cornell, Microsoft, Zynga...) If you're looking to get into an earlier stage startup that solves complex problems, then come find out what we're up to. Our office is near AT&#38;T Park.<p>Email us: jobs@vurb.com - please include your LinkedIn / GitHub profiles and a short blurb on what you're interested in and looking for in a startup experience - also check out vurb.com/jobs","time":1359741127,"type":"comment"},{"by":"stouset","id":5152391,"parent":5150834,"text":"OneLogin - San Francisco, CA<p>We're looking for a devops engineer and another Ruby developer to join our team.<p>For the devops position, we want somebody who will be capable of planning, building out, automating, monitoring, and updating our entire backend infrastructure. Since we handle passwords and run authentication infrastructure for our clients, we have extremely high uptime and security requirements for a company of our size. So we're looking for someone who is knowledgeable about security, redundancy, and high availability techniques. We're looking to do a complete overhaul of our backend infrastructure, and this is your opportunity to design and implement a system the way you know best.<p>Also, we're always looking for talented Ruby developers. Most of our application runs on Rails, but a solid foundation in non-Rails Ruby is highly desired. Familiarity with security in general, Rails' security guidelines in particular, and writing polished, tested code are high on our list of desired traits.<p>Email me directly at `stephen.touset@onelogin.com` if you're interested in applying. We're offering great pay commensurate with talent, full benefits (including a kickass healthcare plan), and relocation to the bay area.","time":1359743088,"type":"comment"},{"by":"caetie-akvo","id":5152165,"parent":5150834,"text":"Dev Ops Engineer - Akvo Foundation - Amsterdam, London, Stockholm, or REMOTE at UTC -5 to UTC +2<p><a href=\"http://www.akvo.org/\" rel=\"nofollow\">http://www.akvo.org/</a><p>To apply for this position, send your resume and a brief cover note to caetie@akvo.org.<p>Akvo seeks an experienced software development operations engineer to join our team and help us grow as we maintain and improve our core software products, Akvo RSR, Akvo FLOW and Akvo Openaid. You will be responsible for maintaining and evolving our cloud and SaaS infrastructure (eg servers, VMs and databases). We will also look to you to explore and recommend new technologies to help our team maintain and grow our infrastructure to respond to increasing demand for our products.<p>Core skills required: maintaining VMs, provisioning frameworks (eg Puppet, Chef, Salt), Linux.<p>Desired experience: maintaining cloud infrastructure, Java/Python, open source projects, integration projects, managing migrations, working in remote and distributed team.<p>Our tech team is spread across several hubs, including Amsterdam, Stockholm, London, and Washington DC. You could work from one of these locations, or remotely from a home office. You must live in a time zone between UTC -5 to UTC +2 (East Coast United States to Eastern Europe) and speak fluent English.<p>Akvo is a small non-profit foundation with a big mission. We create open source web and mobile software, and build networks of skilled partners that can change the way development aid is allocated and reported. This is important, because it improves the way projects are implemented in some of the poorest parts of the world, making them more effective, efficient, sustainable and visible.","time":1359740745,"type":"comment"},{"by":"stevem-newrelic","id":5151029,"parent":5150834,"text":"New Relic - Portland OR/Seattle WA/San Francisco CA (<a href=\"http://newrelic.com/jobs\" rel=\"nofollow\">http://newrelic.com/jobs</a>)<p>We make the best application performance monitoring solution, and deliver the only serious SaaS APM. &#62;30K users can't be wrong.  It gives deep visibility in production apps running on Ruby, PHP, Python, Java, and .NET (with more platforms on the way). Making it easy for our users, however, is hard work for us. Our answer is to hire top notch people, give them whatever they need, and turn them loose to solve tough problems.<p>We're looking for a number of technical positions (check out the Jobs page), including engineers with skills in Ruby, Node, Python, C, PHP, .NET (to name a few). H1-Bs welcome.<p>We also take our company culture seriously -- Best Place to Work and all that, of course. But we also provide an unusual and exciting development environment, one where managers are working to enable developers, not the other way around.<p>More about us:\nwww.youtube.com/watch?v=yZL7mMI-CKU\n<a href=\"http://newrelic.com/nerdlife\" rel=\"nofollow\">http://newrelic.com/nerdlife</a><p>Come take a look at our jobs. <a href=\"http://newrelic.com/jobs\" rel=\"nofollow\">http://newrelic.com/jobs</a>","time":1359730834,"type":"comment"},{"by":"lorax","id":5151128,"parent":5150834,"text":"3M Healthcare Information Systems, Bethesda, MD<p>Java Engineer,<p>Machine Learning Engineer,<p>NLP Engineer<p>We are building a medical NLP engine to extract medical facts from medical records and assign codes (ICD, CPT, etc).  The engine is written in Java using a UIMA pipeline. You will get to research, develop, and implement machine learning and nlp techniques to enhance 3M's clinical NLP platform.<p><a href=\"http://jobs.3m.com/search?q=bethesda\" rel=\"nofollow\">http://jobs.3m.com/search?q=bethesda</a>","time":1359731714,"type":"comment"},{"by":"e1ven","id":5151324,"parent":5150834,"text":"Waltham, Ma - (Near Boston)<p>SavingStar is a startup on 128, and we've built a fully digital grocery eCoupon service which works at over 24,000 stores.<p>We're growing and doing cool things, but we need your help.<p>We have two reqs open right now (which I posted below) - Feel free to email our official jobs mailing list (jobs@savingstar.com) or me personally (cdavis@savingstar.com) if you have any questions, or want to know more ;)<p>--\nJava/Scala Software Engineer<p>Design and implement Java and Scala software solutions, both web-based and stand alone\nDesign database schemas and analyze/tune database queries\nProduction support and troubleshooting\nRequirements<p>Deep knowledge of the core Java and JEE APIs\nExperience with most of the following frameworks: Hibernate, Spring,\nMaven, JUnit/TestNG\nBonus Points<p>Experience with Oracle RDBMS\nExperience with NoSQL databases such as MongoDB\nExperience with batch processing\nExperience with Ruby\nExperience with message driven architectures<p>---<p>QA Engineer<p>Requirements:<p>Solid grasp of computer science fundamentals\nExperience building complex test automation frameworks (Java, Ruby)\nStrong SQL experience\nComfortable working in a Unix based environment (Mac OSX and Linux)\nParticipate in the full software development life cycle, from requirements to test case creation to production support and troubleshooting\nAble to work in a fast-paced, startup environment\nNice To Have:<p>Experience with Selenium 2 Webdriver (Java)\nHands on experience with git\nExperience with “NoSQL” databases (MongoDB a plus)\nComputer science degree or equivalent\nWorking knowledge of Continuous Integration Platforms (Jenkins)","time":1359733453,"type":"comment"},{"by":"ptg180","id":5152217,"parent":5150834,"text":"Sparked<p>San Francisco, CA (SOMA)<p>We're hiring front-end engineers at Sparked!<p>We're a crowdsourcing platform that uses social networking mechanics to unlock the assets of a company to the benefit of customers, employees, community, and the bottom line. Our products are being used by companies and organizations like Linkedin, Genentech, Microsoft, the US State Department… and the list goes on. We are profitable and looking to hire!<p>The key things that we're looking for:<p>* Masterful HTML/CSS/JS skills<p>* Strong Design Sensibilities<p>* Familiarity with PHP and the MVC architecture<p>* Comfort with the Agile methodology<p>* Mobile Development Experience<p>We're looking for people who are ready and willing to take creative freedom and run with it- you'll be able to work on everything from mobile web development to sweet d3.js wrangling and everything in between.<p>We provide competitive salaries, equity, health/dental/vision coverage, flexible work schedules, and lots of free beer!<p>If you're interested, but don't think that you'd call yourself a front-end developer, feel free to get in touch too- especially if you have an interest in python, machine learning and scaling big systems. We've got big things in store!<p>Feel free to drop a line to me at patrick@sparked.com!","time":1359741215,"type":"comment"},{"by":"rohamg","id":5152646,"kids":[5163304],"parent":5150834,"text":"Vancouver, BC (or remote)<p>Axiom Zen is always looking for sharp, talented, and experienced people to join our fast-growing team. Most of us are in Vancouver or San Francisco. Ideal candidates are comfortable working with a small and fast-paced team, taking on significant responsibilities, and pushing the boundaries of what's possible with code.<p>We're looking for folks in the following roles:<p>* Software Engineer, Javascript (node), Ruby, others<p>* Mobile Engineer, iOS<p>* Frontend Developer, HTML5/CSS3/JS<p>* System Administrator, experienced Devops<p>* Data engineer, machine learning/NLP/analytics<p>* Product/Project Managers, must rock (CS preferred)<p>* Design/UI-UX super stars<p>* Recruiting coordinator / Talent scout / Studio Manager (engineering or PM background preferred)<p>Axiom Zen is an idea catalyst. We focus on shipping products that are commercially exciting or socially essential, and practice an end-to-end approach, carrying each concept from ideation to production to market launch and beyond.<p>We're in quiet mode. If you're interested in learning more please shoot us an email with your information, links to relevant online profiles, and a short description of the kind of opportunity you're looking for. Email info@axiomzen.co","time":1359745393,"type":"comment"},{"by":"nathanhammond","id":5150896,"parent":5150834,"text":"Ally Financial (<a href=\"http://www.ally.com\" rel=\"nofollow\">http://www.ally.com</a>) Charlotte, NC (Full time, on-site, relocation possibly available)<p>Our current online banking platforms (yes, plural) are hosted third-party solutions. We're building it in-house from scratch to be an API-driven JS MVC (Ember) application for cross-platform deployment.<p>This is where you come in: we're looking for a few developers who want to be a part of building something right the first time. The team building this is currently just me and two other people and we will be building everything forward of API consumption (UI dev, testing, &#38; deployment across any imaginable platform). We'll be working with PhoneGap, Swagger, HTML/Handlebars, CSS/Compass/SCSS, JS, Ember, PhoneGap, Chef, Selenium, Mixpanel, Optimizely, and/or whatever other tools are right for the job (little is set in stone, we're in the prototype phase of the project). There are lots of jobs in other segments as well.<p>If you're interested, get in touch! nathan.hammond@ally.com","time":1359729765,"type":"comment"},{"by":"dannyroberts1","id":5151552,"parent":5150834,"text":"Cambridge, MA<p>Dimagi<p>Role: Engineer/Adventurer/Do-Gooder<p>At Dimagi, your work can take you literally anywhere. We're looking for talented, adventurous coders to dive in to one of our core mobile health platforms already affecting hundreds of the world's poor and underserved. Our team of top-notch coders has on-site experience in over 20 countries covering East Africa, Central Asia, South America, and the Indian subcontinent, and travel is an important part of every developer's experience. Dimagi's prioritization of global impact and employee growth and satisfaction over the bottom line makes Dimagi a continuously fresh, exciting, and genuine place to work, and keeps us all honest about what we're in it for.<p><a href=\"http://www.dimagi.com/careers\" rel=\"nofollow\">http://www.dimagi.com/careers</a><p>You can also read about our company's recent month in Brazil here: <a href=\"http://www.inc.com/magazine/201210/adam-bluestein/letting-employees-work-remotely-pays-off.html\" rel=\"nofollow\">http://www.inc.com/magazine/201210/adam-bluestein/letting-em...</a>","time":1359735270,"type":"comment"},{"by":"vietor","id":5152568,"parent":5150834,"text":"Cielo24, Santa Barbara, California. Office in downtown Santa Barbara.<p>We build crowd/machine hybrid systems, currently focusing on media captioning solutions and seeing significant penetration and revenue in the online education vertical. You've never heard of us, but you've probably seen our work if you've looked at online education media.<p>We're looking for: Python backend developer(s) (Django/RabbitMQ/Celery/Postgres stack), building both workflow management systems, including operational dashboards and analytics, and backend ASR and machine learning based text recommendation systems.<p>Web frontend developer(s) for basic HTML5/JQuery/Bootstrap type sites, and custom HTML5 based work tools (for example, our video caption editor).<p>INTERN: Dev internet with strong enthusiasm for python or web frontend development. Analytics intern who would like to help develop quality metrics, and analyze output quality from various workflows, ASR engines, and other partners.<p><a href=\"http://www.cielo24.com\" rel=\"nofollow\">http://www.cielo24.com</a><p>Email: jobs@cielo24.com","time":1359744802,"type":"comment"},{"by":"jasonvolpe","id":5151241,"parent":5150834,"text":"Chattanooga, TN - Full-Time, Part-Time/Contract, Remote OK - Campus Bellhops<p>Campus Bellhops is expanding from 8 to 90 schools this year, providing flat-rate moving services for college communities. The service is powered by college students who select work from our job board for part-time income and to start developing a professional track record of success. After testing in small markets last year, we are fully-funded and rebuilding the operations from ground zero. (If you visit our site, you will see the old one.) We are currently housed at the Lamp Post Group (venture incubator) under great mentorship and with a handful of other exciting startups in the beautiful Chattanooga, TN. Chattanooga was the first city in the US to have gigabit Internet.<p>I am the sole developer on the project, and I am looking for a partner to either serve as a strong generalist or take over front-end, back-end, or mobile. Strong sysadmin skills preferred.<p>Please contact me at jason@campusbellhops.com if you are interested.","time":1359732752,"type":"comment"},{"by":"joshmaker","id":5151776,"parent":5150834,"text":"The Atlantic, Washington DC, full time on-site designer and devs<p>We work in a fast paced continuous deployment environment on three main websites – TheAtlantic.com, TheAtlanticWire.com, and TheAtlanticCities.com. With 20 million monthly unique visitors across the three sites, this is a chance to work on high profile websites with a track record of sustained growth.<p>LAMP/Python Developer:\n<a href=\"http://ch.tbe.taleo.net/CH01/ats/careers/requisition.jsp?org=ATLANTICMEDIA&#38;cws=40&#38;rid=1317\" rel=\"nofollow\">http://ch.tbe.taleo.net/CH01/ats/careers/requisition.jsp?org...</a><p>Web Designer:\n<a href=\"http://ch.tbe.taleo.net/CH01/ats/careers/requisition.jsp?org=ATLANTICMEDIA&#38;cws=40&#38;rid=1403\" rel=\"nofollow\">http://ch.tbe.taleo.net/CH01/ats/careers/requisition.jsp?org...</a><p>Senior Systems Administrator:\n<a href=\"http://ch.tbe.taleo.net/CH01/ats/careers/requisition.jsp?org=ATLANTICMEDIA&#38;cws=40&#38;rid=1398\" rel=\"nofollow\">http://ch.tbe.taleo.net/CH01/ats/careers/requisition.jsp?org...</a>","time":1359736965,"type":"comment"},{"by":"wahnfrieden","id":5151616,"parent":5150834,"text":"New York City - full-time<p>Canvas Networks (USV Funded) is looking for an iOS tech lead to join a small, close team building the rich-media community platform of the future. We’re working on some new innovations in mobile, and we want someone to help us build it. This is a lead iOS engineer position for you to grow into as we grow our iOS efforts.<p>To help us iterate and continue momentum, we practice continuous deployment to the extent possible, which presents some unique challenges with native Objective-C / Cocoa apps. On our backend servers, we ship twenty times a day – Apple makes things more complex but it’s a spectrum we’re interested in improving.<p>Free lunch, flexible hours, one of the biggest arcades in Manhattan (3 cabinets!), competitive salary and full benefits (health, dental, vision), take-what-you-want vacation.<p>Our office is in Union Square, Manhattan. If you don’t live in New York City, we’ll pay to fix that.<p>Shoot an email to jobs@canv.as with your resume, portfolio, and github if you have one.","time":1359735742,"type":"comment"},{"by":"snowmaker","id":5152076,"parent":5150834,"text":"Scribd (YC '06), San Francisco - H1B, FULL-TIME, and INTERN are welcome<p>Scribd (social publishing &#38; eBooks, top 100 website) is hiring talented hackers and other technical people for a broad range of technologies.<p>We've hired THREE full-time people and numerous interns from these \"Who is Hiring\" threads, including a one just last month ... it really works!!<p>We're looking for people who want to work with:<p>* Ruby on Rails (we're the #2 largest rails site, after Twitter)<p>* Javascript (we recently switched to Coffeescript and are loving it)<p>* iOS<p>* Android<p>* Machine Learning / data mining / recommendations<p>* Back-end problems: scalability, web crawling, big data, analytics<p>* DevOps and web infrastructure<p>That said, we care way more about your personality and general hacking skills then what languages you've used so far, so if you haven't used these but want to break into mobile or web development, this could be a good opportunity for you. We've hired people from these threads with everywhere from 0 to 10 years of experience. We're profitable, very well funded and have a really fun office environment (go-karts + a zipline!). We've got flexible hours, a very engineer-driven company culture, and a really terrific team.<p>Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire.<p>We're working on a big new product launch now that we're really excited about. If you're interested in eBooks, I'd love to tell you about it.<p>Generally we're looking for full-time and INTERN hires (junior year or older) who want to move to SF. H1B and relocation are no problem.<p>See more at scribd.com/jobs and feel free to email me directly: jared at scribd.com","time":1359739838,"type":"comment"},{"by":"JangoSteve","id":5151148,"parent":5150834,"text":"Ann Arbor, MI -- Full time, REMOTE is cool (though we have a cool office too)<p>We help people build their startups. We work with early-stage startups to help refine their idea, whittle it down to an MVP, and then we build that. We try to do that quickly and efficiently, because then, the real work starts; and we are there for the startup to support, guide, and iterate.<p>We love open source and working with startups. We're primarily Ruby (Sinatra, Rails, EventMachine), JavaScript (front-end and back-end), and HTML5, and more recently native development.<p>We're currently looking to bring another great developer into the team.<p>Our old site is pretty outdated and under active re-design/development, so check out our not-yet-launched new site: <a href=\"http://new.alfajango.com\" rel=\"nofollow\">http://new.alfajango.com</a><p>We also have an open-source site for our OSS projects: <a href=\"http://opensource.alfajango.com\" rel=\"nofollow\">http://opensource.alfajango.com</a>","time":1359731944,"type":"comment"},{"by":"mikepk","id":5151175,"parent":5150834,"text":"Smarterer\nBoston, MA - full-time and intern, devs<p>You want a position in the core tech team of a startup, one of the first three or four brave souls. You want to work on all maner of tech challenges, whatever it takes to make awesome products. You're low ego, but both opinionated and passionate about products and technology.<p>We're small but growing. We're funded by Google Ventures and True. Our technology and opportunity could change a lot of people's lives.  We're trying to make a dent in the universe. We have fun and we're a little weird. :)<p>We're looking for versatile tech people who like to build web apps, especially if they have Python experience.<p>Job description: <a href=\"http://smarterer.com/blog/jobs/web-programmer-developer/\" rel=\"nofollow\">http://smarterer.com/blog/jobs/web-programmer-developer/</a><p>interested? you can email me at mikepk@smarterer.com","time":1359732152,"type":"comment"},{"by":"jacobdehart","id":5151892,"parent":5150834,"text":"Chicago, IL - Picturelife<p><a href=\"https://picturelife.com\" rel=\"nofollow\">https://picturelife.com</a><p>Hey I'm Jacob, one of the founders of Threadless.  My new project, Picturelife, is hiring all sorts of smart people. Picturelife is a service that securely stores all your digital photographs and organizes them beautifully.  We currently have an amazing team of brains including OMGPOP founder and YC Alum Charles Forman and NY Tech Meetup President Nate Westheimer.<p>We're looking for full time people in Chicago to help make Picturelife the hottest app on the web and in your pocket.<p>We are looking for:<p><pre><code>  iOS / Mac developers  \n  Windows desktop developers  \n  Android developers  \n  Javascript engineers  \n  UI/UX engineers with Rails experience\n</code></pre>\nContact us at jobs+hn@picturelife.com<p>&#60;3 Jacob","time":1359738201,"type":"comment"},{"by":"old-gregg","id":5152324,"parent":5150834,"text":"Mailgun (YCW11)<p>We work on messaging infrastructure: our technical challenges revolve around making servers efficient and reliable at passing messages and storing data. Fast. If you're into high-traffic concurrent server-side programming on Linux, our set of problems is fairly unique. We're Python fans, but never forget our C roots.<p>We offer competitive salary, great benefits, challenging problems to work on and smart engineers to eat lunch and have fun with.<p>The projects we're currently working on are not old. You won't be fixing other people's bugs or debug some legacy spaghetti. Our technical debt is at all-time low, and most of what needs to be built needs to be done from scratch. Join us!<p>We're in SOMA, San Francisco. Ping us at jobs@mailgun.com","time":1359742262,"type":"comment"},{"by":"vosper","id":5151377,"parent":5150834,"text":"SET Media<p>San Francisco, CA - full-time (H1Bs are welcome); engineers and machine learning researchers<p>We serve the online video advertising marketplace by allowing advertisers to target or filter based on the content of video. We achieve this by using sophisticated machine learning techniques to classify content at scale, and provide an API to support real-time decisioning at page-load time.<p>Out language of choice is Python, our platform is AWS, our methodology is Agile; you don't need to know any of these to apply - we believe that if you're smart then you'll pick it up.<p>Our office is in downtown San Francisco, a couple of minutes walk from Montgomery Station.<p><a href=\"http://www.set.tv/careers/\" rel=\"nofollow\">http://www.set.tv/careers/</a>","time":1359733792,"type":"comment"},{"by":"kylered","id":5151406,"parent":5150834,"text":"VividCortex, Inc.<p>Charlottesville, VA (Remote, Fulltime)<p>We're building database administration tools delivered as a service. We're early-stage, pseudo-stealth, but with great momentum and access to the market, and we're well funded. It's a pretty unique company and market, and it's tackling a legitimate problem in the devops/sysadmin world. Our jobs:<p>Dev/ops: our backend systems and infrastructure are all written in Go (it’s awesome). We are ramping up to handle a jaw-dropping amount of incoming data. Data storage involves MySQL and other storage technologies in a fault-tolerant, distributed environment. We're looking for someone who can switch in and out of a couple of developer and sysops roles -- writing some server software, setting up some machines, whipping up some Chef recipes, and so on. We're a small team, so the real job description is \"we need another backend/infrastructure engineer.\"<p>Frontend: the web app is backed by PHP and Symfony2, and fronted by a lot of JavaScript, using up-to-date technologies and frameworks. There's a lot of API interaction from JavaScript, and a complex user interface that's key for making our customers rave about the experience, not just the technology. We'd love to find someone who can hop back and forth between the PHP and the stuff that runs in the browser, and it's even better if they've got some design sensibilities and can help shape the product's features and functionality too. If you've got the latter skillset, then the PHP coding is optional.<p>Head of UX/UI: your impact would be immediate as we already have leading consumer web companies using our technology. Your impact would also be lasting because there really isn’t anything in this space, and, if you can lead the defining efforts of UX/UI for system administration, then you will have moved the industry forward. \nIdeally, you know Photoshop, have worked with front-end development teams and know a little bit about system administration. Additionally, we work with a lot of charts and graphs, and notification feeds. Other than that, we are open to a variety of experiences.<p>As an early-stage company, we offer the chance to end up owning a fair chunk of what we believe is likely to be a very valuable business.<p>Email jobs@vividcortex.com","time":1359734048,"type":"comment"},{"by":"smilliken","id":5151954,"parent":5150834,"text":"MixRank - San Francisco - Engineering (Full Time, Intern)<p>MixRank crawls the web and collects, monitors, and does analytics on display ads. Our core technology focuses are i) web crawling, ii) distributed data systems/analytics, and iii) data mining. Our customers are advertisers, agencies, and ad networks that use our data to monitor competition and optimize campaigns.<p>If you're in the bay area, you're welcome to drop by our office in SoMa (next to AT&#38;T park) on Wednesday evenings to hang out and (optionally) participate in a casual programming competition.<p>scott@mixrank.com","time":1359738756,"type":"comment"},{"by":"squirrel","id":5151811,"parent":5150834,"text":"Notting Hill, London, England.<p>Our web application is at the heart of our busy e-commerce business; every day it serves millions of product images and handles thousands of purchases - but we can and do update the live site with new code anytime we want without missing a beat. Our systems are written on the LAMP stack and we are migrating to Symfony 2 as our MVC framework. Developers choose the tools that work best for them - for instance, we have a mix of Linux and Mac workstations in the team. We are adopting and adapting agile development techniques such as test-driven development, pair programming, and continuous integration. We hold regular retrospectives to improve our working environment and lightning talks to share cool ideas whether work-related or not. Our developers are generalising specialists whose typical day may include refining an algorithm, writing a tricky integration test, tuning a SQL query, and discussing feature nuances with a product manager. Our team is growing fast and we'd like to hear (at careers@secretsales.com) from any of you who'd like to join us; we're hiring for all technical roles.<p>Established in London in July 2007, Secretsales.com is one of the UK's leading private shopping clubs, offering limited-time online sales with current name-brand goods at deep discounts. Brands include fashion, beauty, homeware, and lifestyle categories, many familiar from the high street. The company has about 80 employees and a substantial annual turnover. The firm is growing quickly after a recent investment round.","time":1359737393,"type":"comment"},{"by":"curtis","id":5152429,"parent":5150834,"text":"<p><pre><code>  +--------------------------------+\n  | Redwood City, CA - UI Engineer |\n  +--------------------------------+\n</code></pre>\nTidemark Systems (<a href=\"http://www.tidemark.net\" rel=\"nofollow\">http://www.tidemark.net</a>, note \".net\") is hiring.<p>Like everybody else in the industry, we're finding hiring to be a difficult problem. For those of us on the UI team it's been an extra challenge -- there are lots of people out there who have experience with toolkits like jQuery, Ext, Sencha Touch, and a whole bunch of other ones, some of which we've never heard of. But we're not simply using frameworks, we're pushing them well beyond what they were intended to do. So if you've got relevant framework experience, that's great. But we really need engineers that are good at the basics: JavaScript, DOM, HTML, and CSS. You'll also need to be decent at UI design and user experience. If you're not just good but great at either of these things (or both!), that's awesome, but we also need you to be able to write code. This isn't just a run of the mill web dev job. This is actual, hard core software engineering, it just happens that the stuff we're (the UI team) doing is all running in the browser.<p>Tidemark is building a hosted business analytics system, which is way more interesting than it might sound. The company is well-funded and we have people with decades of experience in the field.<p>If this position sounds interesting, my email is on my profile page.","time":1359743375,"type":"comment"},{"by":"m0tive","id":5151338,"parent":5150834,"text":"Oxford, UK<p>NaturalMotion (<a href=\"http://www.naturalmotion.com/\" rel=\"nofollow\">http://www.naturalmotion.com/</a>) is a leading game technology\nand development company creating animation software used in AAA titles such\nas Rockstar Games' Grand Theft Auto IV and Irrational Games' BioShock\nInfinity.<p>We're looking for talented C++ programmers to join our team building\nour industry leading animation tools.<p>If you want to help make game characters come to life, get in touch.<p><a href=\"http://www.naturalmotion.com/company/careers/\" rel=\"nofollow\">http://www.naturalmotion.com/company/careers/</a><p>Peter","time":1359733547,"type":"comment"},{"by":"amberdixon","id":5168190,"parent":5150834,"text":"San Francisco (SF), CA<p>Airtime is looking for a smart, self-motivated software developer who is passionate about technology and excited about learning new things.<p>We are a startup founded by Sean Parker and Shawn Fanning. Drawing on the experience and ingenuity of these two industry veterans, our team of amazing engineers and designers are on a mission to build a powerful social video chat platform that could change the way people have conversations with each other.<p>A passion for technology and the ability to learn things quickly is key, as you will be given the opportunity to develop on multiple platforms and in a variety of languages. You will also have a chance to participate in discussions with our product and design teams to build the next generation of Airtime.<p>We are hiring for our satellite office in the SoMa district of SF. Our main office is in NYC. We're currently under 10 people. Our SF employees also enjoy the opportunity to take occasional business trips to our Manhattan office.<p>We are not currently sponsoring H1-B visas.<p>To apply, please complete the Airtime Coding Challenge at <a href=\"http://challenge.airtime.com/instructions\" rel=\"nofollow\">http://challenge.airtime.com/instructions</a>. Once you have done so, please submit your resume and your challenge solution to jobs+hn@airtime.com. You may want to include instructions on how to run your solution. Please put the coding challenge answer in the subject line of your email.","time":1360023358,"type":"comment"},{"by":"ipster","id":5152119,"parent":5150834,"text":"AllTrails and AllSnow<p><a href=\"http://alltrails.com\" rel=\"nofollow\">http://alltrails.com</a> <a href=\"http://allsnow.com\" rel=\"nofollow\">http://allsnow.com</a><p>FULLTIME Rails / iOS / Android Engineers / Designers<p>San Francisco (preferred) / Los Angeles / NYC / Remote / H1B<p>AllTrails is hiring! We're building Yelp for the outdoors - the best way to discover and share hiking trails and outdoor activities around you. We're helping people rediscover the outdoors and having lots of fun in the process. Camping and snowboarding benefits, anyone?<p>We just launched our brand new site in partnership with National Geographic (<a href=\"http://alltrails.com/partners/national_geographic\" rel=\"nofollow\">http://alltrails.com/partners/national_geographic</a>) and have the #1 outdoors app in the Apple and Android stores (try searching for 'Hiking'). We also have the #1 Snow sports app on iPhone.<p>Our company was AngelPad incubated, is funded by 500Startups and consists of a strong team from Google / Microsoft / Facebook with previous startup experience. We also have the author of an O'Reilly Android book, and a core committer to Homebrew on the team. We're looking for exceptional full stack Rails and mobile developers (Android and iOS) and designers.<p>If your idea of sunlight is more than just sitting in front of a really bright monitor all day, we'd love to hear from you! <a href=\"http://alltrails.com/jobs\" rel=\"nofollow\">http://alltrails.com/jobs</a> or jobs@alltrails.com","time":1359740242,"type":"comment"},{"by":"Katelyn","id":5152343,"parent":5150834,"text":"Care.com (Matrix, Trinity Ventures funded) is hiring an ios developer to join a small, fast-paced mobile team within care.com to lead our iPhone.<p>This is a lead iOS engineer position for you to grow into as we grow our iOS efforts.<p>You'll be working with a talented, fun and passionate team of individuals in a company that offers great benefits and compensation packages. We're also looking for an iOS designer.<p>Email or tweet me if interested: kfriedson@care.com / <a href=\"http://twitter.com/kfriedson\" rel=\"nofollow\">http://twitter.com/kfriedson</a>","time":1359742559,"type":"comment"},{"by":"wschroed","id":5203736,"parent":5150834,"text":"The Genome Institute at St. Louis, MO<p>The Genome Institute at Washington University has an opening for a talented software engineer in the Bioinformatics group.  The position will work with an experienced group of software engineers to develop software supporting the tracking of laboratory data and analysis processes to support large scale genomic research projects.<p>The Genome Institute has been at the forefront of genome research since its inception in 1993 and has been a part of major scientific projects such as the Human Genome, 1000 Genomes and TCGA (The Cancer Genome Atlas) Projects.  The Genome Institute is a world-leader in the generation and analysis of genomic sequence data and uses this data to extend biological knowledge of the human genome and provide clinically relevant sequence analysis aimed at understanding human diseases (such as cancer and Alzheimer's disease).  In addition, the Institute fosters public understanding of genomic science through various educational and outreach efforts.<p><a href=\"https://jobs.wustl.edu/psp/APPLHRMS/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_CE.GBL?Page=HRS_CE_JOB_DTL&#38;Action=A&#38;JobOpeningId=25269&#38;SiteId=1&#38;PostingSeq=1\" rel=\"nofollow\">https://jobs.wustl.edu/psp/APPLHRMS/EMPLOYEE/HRMS/c/HRS_HRAM...</a><p><a href=\"https://jobs.wustl.edu/psp/APPLHRMS/EMPLOYEE/HRMS/c/HRS_HRAM.HRS_CE.GBL?Page=HRS_CE_JOB_DTL&#38;Action=A&#38;JobOpeningId=25270&#38;SiteId=1&#38;PostingSeq=1\" rel=\"nofollow\">https://jobs.wustl.edu/psp/APPLHRMS/EMPLOYEE/HRMS/c/HRS_HRAM...</a><p>You can also send questions and resumes directly to me.","time":1360621359,"type":"comment"},{"by":"kmeinert","id":5154255,"parent":5150834,"text":"NetDNA / MaxCDN<p>Los Angeles, CA<p>We're looking for:\n1) Full Time Linux DevOps / Sys Admin \n2) Level 2 Technical Support<p>NetDNA is a Content Delivery Network (CDN) based in Los Angeles with hundreds of servers deployed across 3 continents.  In the office preferred, but remote is a possibility depending on experience.<p>Our Stack:\nCent OS\nNginx\nMySQL\nPython / Perl<p>Recommended Experience (for DevOps):\n•\tExperience with maintaining, managing and monitoring servers running Linux (Cent OS).  \n•\tExperience with Nginx web servers and modules.  \n•\tKnowledge of Anycast, BGP, HTTP HTTPS protocols, caching protocols, web servers, DNS servers.\n•\tExperience with network and server optimization. \n•\tExperience with Mysql database, SQL query, database optimization.\n•\tExperience with remote system management, console server, remote power strip and PIXboot.\n•\tExperience with automatic script using Python, Bash, or perl.\n•\tExperience with monitoring and network statistic tools like Nagios, Zabbix and Munin\n•\tExperience with Puppet for maintaining server state and deploying new code.<p>Read more about what it’s like to work at NetDNA, here: <a href=\"http://www.netdna.com/company/\" rel=\"nofollow\">http://www.netdna.com/company/</a><p>Submit inquiries to careers [at] netdna [.] com<p>NetDNA is also the parent company of MaxCDN.com, you can read what customers are saying about our CDN service, here: <a href=\"http://www.serchen.com/company/maxcdn/\" rel=\"nofollow\">http://www.serchen.com/company/maxcdn/</a>","time":1359761608,"type":"comment"},{"by":"mschaecher","id":5155298,"parent":5150834,"text":"San Francisco, SFBA, REMOTE, INTERNS(too)<p>Munchery is changing something so fundamental as your nightly dinner, and giving local food entrepreneurs the economic freedom to fully leverage their skill, passion and creativity.<p>We're looking for software engineers, senior designers, senior front-end. Hacker, designer &#38; data interns. Operations roles, city management roles, and more postings soon.<p>Only apply if you like zero bureaucracy and tons of empowerment.<p>Working on awesome stuff is only limited by how much you can get done.<p>email me at michael@munchery.com if interested.","time":1359783265,"type":"comment"},{"by":"thiele","id":5154404,"parent":5150834,"text":"Glider (Portland, Oregon)<p>ABOUT US:  \nGlider is a small team building SaaS products to help teams work together. We're backed by True Ventures, and are graduates of TechStars Seattle.  We offer a competitive base salary, benefits, and stock options package along with an awesome opportunity to get in early on a growing, VC backed startup.<p>ABOUT YOU - SENIOR PYTHON ENGINEER:  \nAs a Senior Engineer, your average day will include plenty of coding across the stack. On any given day you could be deploying servers on AWS, coding on the frontend, or writing application code. On top of your daily coding, there will be opportunities to work with clients, give input on the product direction, and help shape Glider’s future!<p>What we're looking for:  \n· Experience with Python  \n· Familiarity with AWS and Chef/Puppet  \n· Demonstrated success working well in small teams and close quarters  \n· Strong desire to build great products that make customers happy  \n· Excitement about what Glider is doing!<p>What would be nice:  \n· Experience with current JavaScript tools such as Backbone and jQuery  \n· Knowledge of Microsoft Offices SDKs, libraries, and plugins  \n· Experience building browser plugins  \n· Experience working with Open Office Server<p>FULL JOB POSTING:  \n<a href=\"http://www.jobscore.com/jobs/glider/senior-python-engineer/apRDNe1Eer4B6DeJe4f41K\" rel=\"nofollow\">http://www.jobscore.com/jobs/glider/senior-python-engineer/a...</a><p>CONTACT:  \nJustin Thiele, justin@glider.com  \n<a href=\"http://glider.com\" rel=\"nofollow\">http://glider.com</a>","time":1359763767,"type":"comment"},{"by":"scanr","id":5208923,"parent":5150834,"text":"London, England - Full Time - Local Only (with flexibility to work from home on occasion)<p>Optim.al (<a href=\"https://www.optimalsocial.com/\" rel=\"nofollow\">https://www.optimalsocial.com/</a>) is currently hiring full stack engineers for our London office, working on a variety of projects that cover real time bidding, analytics, data science and front end web applications.<p>Requirements:<p><pre><code>    * BS or MS degree in computer science, maths, statistics, information science, \n      or related field.\n    * Good understanding of web technologies HTML, Javascript, HTTP, JSON, REST\n    * Must be able to demonstrate that you're a great \n      programmer in any one of Python, Ruby, Java, Scala, Clojure, Haskell, \n      F# or Kotlin\n    * Must be happy to work in either Python, Ruby or Java\n    * Must have a good understanding of a Unix based operating system\n    * Some experience of databases and at least one web application framework\n</code></pre>\nIf you love programming and would like an interesting job with a steep learning curve and a wide variety of challenges, please get in touch.<p>You can email me personally at jamie@optimalsocial.com or use the following Jobvite link: <a href=\"http://hire.jobvite.com/j/?aj=oYH2Wfwn&#38;s=HackerNews\" rel=\"nofollow\">http://hire.jobvite.com/j/?aj=oYH2Wfwn&#38;s=HackerNews</a><p>No recruiters please.","time":1360697702,"type":"comment"},{"by":"zukhan","id":5155668,"parent":5150834,"text":"FULLTIME or INTERN. Offices in San Francisco, Menlo Park, and Boston<p>Delphix is a data virtualization company that is doing for databases what VMware did for servers - this is a massive market, and we are on track for similar success. We're looking for software generalists to help build our full stack, from the operating system and filesystem, to the Java management stack, and the GUI.<p>The engineering team at Delphix is composed of the inventors and architects of the VMware platform, ZFS filesystem, DTrace, Oracle RAC, DataGuard, and Flashback.<p>We've built an engineering culture where anyone with a good idea can have a voice and drive unique projects. Whether it's developing new abstractions in the filesystem, designing an architecture to interoperate with a novel database, or developing a new cloud paradigm for virtualizing data, there is no lack of hard problems and opportunities at Delphix.<p>The Delphix platform has already established itself as the premier platform for structured data management in the enterprise world. In our first year of selling, we added 50 large corporate customers, including many from the fortune 500 (Proctor &#38; Gamble, RBS, Fidelity, Deutsche Bank, Comcast, Staples, Qualcomm, among others). Year 2 revenue is growing at 300%.<p>Check out our technical blog at <a href=\"http://blog.delphix.com\" rel=\"nofollow\">http://blog.delphix.com</a>.<p>News coverage: <a href=\"http://www.infoworld.com/d/the-industry-standard/4-smokin-hot-startups-the-next-tech-boom-209026?page=0,2\" rel=\"nofollow\">http://www.infoworld.com/d/the-industry-standard/4-smokin-ho...</a>","time":1359799664,"type":"comment"},{"by":"streeter","id":5151112,"parent":5150834,"text":"Educreations (<a href=\"http://www.educreations.com\" rel=\"nofollow\">http://www.educreations.com</a>) - Full Time or Intern in Palo Alto, CA<p>Want to use your skills as a force for good to improve education for all? Here's your chance.<p>At Educreations, we believe that the world's best teachers should be available to all students.<p>As a first step, we've made it easy for teachers to create amazing online video lessons. Our top-100 app transforms the iPad into a mobile lesson recording studio, and hundreds of\nthousands of teachers and students are using it daily to learn from each other anytime, anywhere.<p>We're looking for some passionate people to help us redefine online teaching and learning. We were part of the first cohort of Imagine K12 and are funded by Accel Partners, NewSchools Venture fund and other top angels.<p>If you want to make a dent in the universe and are a strong Python hacker, have experience with Objective C or are an awesome designer, we want to talk to you.<p><a href=\"http://www.educreations.com/careers/#jobs\" rel=\"nofollow\">http://www.educreations.com/careers/#jobs</a> or <a href=\"http://educreations.wufoo.com/forms/join-educreations/\" rel=\"nofollow\">http://educreations.wufoo.com/forms/join-educreations/</a><p>We are looking for:<p><pre><code>    Full-stack Engineers (Python)\n    Mobile Engineers (Objective C/Cocoa)\n    Visual Designers\n    Technical Interns</code></pre>","time":1359731590,"type":"comment"},{"by":"abstractwater","id":5153039,"parent":5150834,"text":"San Francisco (Market @ Montgomery)<p>Goodreads, the world's largest site for readers and book recommendations, is hiring engineers, both junior and senior.<p>We use Rails, but no previous experience is required. Strong desire to learn and innovate is!<p>We are looking for kick-ass web developers, iOS (Objective-C) and Android (Java) engineers. Avid book readers preferred!<p>Check out <a href=\"http://www.goodreads.com/jobs\" rel=\"nofollow\">http://www.goodreads.com/jobs</a>  to apply to open positions!  (Please mention HN as your referral.)","time":1359748617,"type":"comment"},{"by":"khitchdee","id":5153156,"parent":5150834,"text":"Khitchdee looks for a musician that enjoys processing streams of numbers a la Digital Signal Processing. We have the ability to digitize sound cleanly through sound-proofing and high quality signal paths. We need the ability to process the digitized sound to recognize the soundscape. At the same time, we need the ability to augment the soundscape with synthesized soundstreams that will play out the speakers in our recording room.<p>We are currently producing a piece of music titled \"Fat lie kebab -- it's a big fat lie\" to commemorate the Kumbh Mela that is in progress, here at Allahabad. If you're planning to attend the mela, it's a great time to check us out. We're holding an open house during this time. See <a href=\"http://khitchdee.forumatic.com/viewtopic.php?f=6&#38;t=21\" rel=\"nofollow\">http://khitchdee.forumatic.com/viewtopic.php?f=6&#38;t=21</a><p>We expect you to write code and jam with us over obscure musical rhythms so you should be into the music. We can help you understand the algorithms if you're not familiar with DSP, but you have to pick up the programming. It's initially in C on Windows.<p>For a full time position, we can offer up to 7 lakhs p.a. + a small amount of equity. Part-time positions and internships are also available.<p>Allahabad is a great place to be working on music.","time":1359749657,"type":"comment"},{"by":"gpodio","id":5152585,"parent":5150834,"text":"Podio - Copenhagen, Denmark (Full Time)<p>We are looking for a senior backend developer to join the small but amazing Podio team in beautiful Copenhagen.<p>Podio, now part of Citrix, is a collaborative work platform that is already empowering hundreds of thousands of people to work the way they want to by building their own apps, without any technical skills. See <a href=\"https://company.podio.com/\" rel=\"nofollow\">https://company.podio.com/</a> for more info.<p>The role: You’ll be working on extending and scaling the Podio API, on top of which the whole Podio web app, the iOS and Android apps and the thousands of 3rd party clients are built. The challenges are many, both in terms of complexity (data model, business rules, 3rd party integrations, security) and scalability (thousands requests per second, hundreds of thousands users, many millions of apps, items, tasks, ...).<p>The stack: Python, SQLAlchemy, MySQL, Memcache, RabbitMQ, ElasticSearch, Celery, Nginx, Chef and a whole lot more for the frontend and mobile clients.<p>Our ideal teammate:<p>* Has many years of industry experience in building and deploying large systems; start-up experience is a plus.<p>* Has hands-on experience in at least some of the technologies we use. Still we recognise that the best candidates will be able to learn quickly, so if you have scaled big platforms before, we’d love to talk to you.<p>* Enjoys working in a lean, agile, test-driven environment.<p>* Is passionate about technology and keeps on top of trends.<p>If you're interested feel free to get in touch.","time":1359744915,"type":"comment"},{"by":"suitabletech","id":5151737,"parent":5150834,"text":"Palo Alto, CA or REMOTE<p>Suitable Technologies - <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a><p>We’re a startup that just launched our flagship product, called Beam, a true remote presence device that lets you travel instantly to remote locations, with a depth of interaction that makes you (and everyone else) feel as if you're really there. You can learn more and see our demo video on our site.<p>We’re already shipping to customers, and interest is strong. We have funding, competitive compensation, and a fun work environment, complete with our own chef and break-time games like table tennis. We provide top-of-the-line development hardware, adjustable desks, and will get your workspace just right.<p>Overall, we’re looking for great engineers, designers, testers, and product marketers to help in areas such as C++ development, audio and video software and codecs, web frontend and backend, UI/UX design, optimization, and networking. It’s also an opportunity for someone with experience in web or mobile to work on something unique and challenging.<p>We’re also looking for people to help with sales, BD, and product management as we expand our offerings.<p>More information is available on our site: <a href=\"http://suitabletech.com\" rel=\"nofollow\">http://suitabletech.com</a> \nContact: jobs@suitabletech.com","time":1359736601,"type":"comment"},{"by":"superplussed","id":5161851,"parent":5150834,"text":"3rd Ward - Brooklyn, NY, Full time, remote, H1B<p>We're a pretty amazing maker/tech/educational space in Bushwick, Brooklyn, NY that is building a tech team from the ground up.  We recently raised a series A round for 4.5 million (investors have not been disclosed yet, but some very high profile ones).  Equity is negotiable with a 2 year vesting period.  This year we are expanding to a culinary school in Brooklyn, a maker/tech school in Philly, as well as getting into online education.  You would be one of our first tech hires!<p>Front-end Developer (with some design chops) -  You should have great HTML, CSS, javascript, jQuery skills, git. Bonuses - backbone, HAML, SASS, Rails.  Design skills are also desirable, not the \"pixel-perfect\" kind necessarily, but at least the \"wire-frame something up and make it look decent enough\" kind.<p>Rails Engineer -  Postgres, elasticsearch, TDD, git, some knowledge of Amazon Web Services is a plus, as is front-end experience.<p>Perks of working at 3rd Ward: an offbeat culture full of creative individuals, free classes and workshop time in our wood and metalshop, and a great deal of personal and professional freedom as you help shape the future of our company.<p>Contact me at jeremy@3rdward.com with a link (github or otherwise) to some of your work.","time":1359937897,"type":"comment"},{"by":"neils2001","id":5163041,"parent":5150834,"text":"Kanjoya, San Francisco\nFull-time and Intern - Software Engineers (all levels)<p>At Kanjoya, we develop technologies that enable real understanding of human expression.  Our social discovery platform, Experience Project (www.experienceproject.com), enriches people's lives by deeply connecting them around their shared experiences. From experiences ranging from fighting cancer to obsessing over contemporary art to confessing that you love your dog more than life itself, Experience Project has it all.<p>We work on a product that deeply enriches people’s lives. 80% of our users say Experience Project has changed their life for the better. And each month,\n* 2+ million meaningful friendships are formed between strangers\n* 10+ million people from around the world make us their home.<p>We are looking for people whose heart is as big as their brain and who believe in a vision that technology can be meaningful and emotionally-rich.<p>Our technology platform includes:\nPHP, Python, MySQL, Redis, Beanstalk, Node.js, Hadoop, Pig, Fluent, Amazon AWS<p>As a member of our engineering team, you will:\n* build both front-end and back-end features used by millions of people\n* be part of a small, fast-moving, highly collaborative team\n* contribute to the product from both an ideation and implementation level<p>We are looking for candidates who have:\n* a passion for working in agile engineering teams where code is released multiple times a day\n* a love for finding creative and thoughtful solutions to a variety of technical and product challenges\n* a desire to write scalable, efficient, maintainable code<p>Interested?  Drop us a note at jobs@kanjoya.com!","time":1359965064,"type":"comment"},{"by":"capkutay","id":5152873,"parent":5150834,"text":"WebAction (<a href=\"http://www.webaction.com\" rel=\"nofollow\">http://www.webaction.com</a>) - Full time or intern in Palo Alto, CA (Downtown Palo Alto). Seeking Front-end developers and Platform Engineers.<p>WebAction is a start-up looking to fill the gap between Big Data and transaction data. We have just closed our Series A round and we are getting ready to launch our product. Our seasoned founding team has multiple successful exits; including some of the key enterprise infrastructure software that you use today. We are located in a newly-renovated office in famous downtown Palo Alto. You can walk to the Apple store in 7 minutes, Starbucks in 8 and the train station in about 15.<p>Front-end Developers should be well-versed in HTML, CSS, JavaScript, and jQuery. You should be interested in Data Visualization libraries such as D3 or processing. Strong programming fundamentals and experience with languages like Java/C/C++ is a huge plus. Experience developing native iOS apps would also be strongly desired, but not a requirement.<p>For the Platform Engineer position, you should have or at least be interested in learning: Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce / Pig / Zookeeper), Data Serialization (Avro / Thrift / Protocol Buffers), Bytecode generation and injection, NoSQL / BigData (MongoDB / Cassandra / HBase), Real-time messaging (0MQ / Kestrel / Kafka or similar), Real-time event processing, Continuous Queries<p>If you are interested, email us at jobs@webaction.com. In your message, mention \"Hacker News\" and feel free to let us know about your passions or any technologies that excite you. We look forward to hearing from you.","time":1359747295,"type":"comment"},{"by":"mattjaynes","id":5152172,"parent":5150834,"text":"This is one of the best companies I've worked for. I'm at another job now, but have to vouch for these guys. They really know how to run a team and a company. It's a lot of fun and very flexible. Some of the nicest and smartest people I've met.<p>=============<p>Montreal (or REMOTE)<p>Bandzoogle is looking for an experienced, well rounded Rails developer to join the our dev team. Our app powers tens of thousands of artist websites, and helps them make a living by selling their music and growing their fan base. We've been \"bootstrapped, profitable, and proud\" since 2003 and were just named one of the 100 fastest growing companies in Canada.<p>As a core member, you'll have varied and challenging projects to work on, from building new e-commerce features, launching in new markets, building mobile solutions, and more.<p>Why work with us?<p>- A great salary plus generous performance bonuses.<p>- A fast paced startup atmosphere, with the stability of an established, profitable company.<p>- A family-friendly schedule -- no overtime or weekends.<p>- Health insurance for US and Canadian employees.<p>- Reimbursement of home office expenses, computer, and use of co-working spaces.<p>- A $1,000 education expense account; reimburse books, conferences, whatever you want to learn about.<p>- Yearly meet-ups in fun locations, family included!<p>Full job post here: <a href=\"http://bandzoogle.com/jobs/\" rel=\"nofollow\">http://bandzoogle.com/jobs/</a>","time":1359740818,"type":"comment"},{"by":"eoghan","id":5152548,"parent":5150834,"text":"Intercom<p><a href=\"https://www.intercom.io/\" rel=\"nofollow\">https://www.intercom.io/</a><p>Remote in US: Support Engineer: <a href=\"https://www.intercom.io/home/jobs/support\" rel=\"nofollow\">https://www.intercom.io/home/jobs/support</a><p>San Francisco: Head of Product Marketing: <a href=\"https://www.intercom.io/home/jobs/marketing\" rel=\"nofollow\">https://www.intercom.io/home/jobs/marketing</a><p>Dublin: Infrastructure Engineer: Mail macey@intercom.io in confidence<p>Dublin: Excellent Ruby Engineers: Mail macey@intercom.io in confidence","time":1359744601,"type":"comment"},{"by":"ZephyrP","id":5151738,"parent":5150834,"text":"Ruby on Rails/Javascript Developer (SF or Remote)<p>We're hiring a developer to add to our small startup team. This candidate must have experience building and maintaining real world applications with a strong command of client side coding as well as the associated document styling and markup.<p>We are small startup operating out of the New York, San Francisco, and Charlotte areas. We are developing a multi-tenant reporting platform using MongoDB and Erlang/OTP to deliver information, performance measurements and capital allocation analytics to companies in the wealth management industry. We all work remotely and rely heavily on Skype and Google Chat/Hangout to stay in daily contact and to get things done. We work as a team to define the functional and architectural direction of the platform and we are looking for someone to join!<p>At our core, we're a Rails 3 app with a MongoDB backend backed by a heavy real time processing extract and load component in Erlang<p>Pluses<p>- Extensive familiarity with JavaScript/CoffeeScript.<p>- Experience working on, and an understanding of, both client-side and server-side code.<p>- Experience with Ember.js or other fully featured JS frameworks<p>- Domain knowledge of the suitability of capital allocations for performance measurement<p>- Experience with Erlang/OTP<p>Interested parties should reply to this post to info@purveu.com","time":1359736618,"type":"comment"},{"by":"hackgurl","id":5151624,"kids":[5152363],"parent":5150834,"text":"GIGTANK [<a href=\"http://www.thegigcity.com/gigtank/\" rel=\"nofollow\">http://www.thegigcity.com/gigtank/</a>]<p>Chattanooga, TN<p>GIGTANK is accepting applications from entrepreneur teams and students/ specialists for the world's only accelerator on a living fiber network enabling next generation businesses to go to market today.<p>Why GIGTANK in Chattanooga compared to another accelerator with a more prominent name?<p>There are a lot of great accelerators out there! But GIGTANK is the only one on a living fiber network. We are looking for innovators interested in applications, devices and platforms that can leverage massive amounts of connectivity. We’ll also put you in front of decision makers from companies like Alcatel Lucent, Cisco, IBM, and many more! You’ll be one of the few teams in the world with access to a $300,000,000 fiber optic grid and potential customers already using it.<p>Who is an ideal candidate for the GIGTANK?<p>Developers, engineers, hackers, designers, and dreamers. We’re looking for people who have big ideas and the skills to help build them. The more experience you have and the more projects you’ve worked on the better.  Remember that we want at least two team members for startups. If you don’t have a team, see below info about applying as a specialist.<p>Entrepreneur Application:\n<a href=\"http://www.thegigcity.com/gigtank-startup/\" rel=\"nofollow\">http://www.thegigcity.com/gigtank-startup/</a><p>Specialist/Student Application:\n<a href=\"http://www.thegigcity.com/gigtank-specialist/\" rel=\"nofollow\">http://www.thegigcity.com/gigtank-specialist/</a><p><i></i>Deadline: March 22, '13<i></i>","time":1359735805,"type":"comment"},{"deleted":true,"id":5151646,"parent":5150834,"time":1359735993,"type":"comment"},{"by":"jacoblyles","id":5153051,"parent":5150834,"text":"Mountain View, CA - Coursera - winner of the crunchie for \"Best new startup of 2012\"<p>Coursera was founded with the mission that everyone should have access to a free, high-quality education. We partner with 33 brand-name universities including Stanford, Duke, and Princeton to bring the best classes in the world to the world's largest platform - the internet.<p>Coursera is hiring all kinds of web and mobile engineers. Come be part of the online education revolution!","time":1359748699,"type":"comment"},{"by":"adamtait","id":5154659,"parent":5150834,"text":"Rally.org : San Francisco : Full-Time<p>Rally.org is an ambitious venture for good - always looking to expand on what the intersection of money and values can mean for the world at large.  Our platform today helps users connect and fundraise around what matters amplifying their stories to reach more people.  We're proud to have raised the largest round ever on AngelList ($8mm) with a great team of investors including Kevin Rose, Mike Maples, and Reid Hoffman.<p>We're a small team of developers in the heart of SF that work across our rails stack, from optimizing relational database queries to building smooth javascript interactions. We work together closely, iterate quickly, and deploy to production daily. We're proud of our pragmatic culture and push each other through pairing, code reviews and speaking up. We use tools like Rails, Redis, Chef and D3-js.<p>We work hard and we have fun, too. Bi-monthly team dinners, in-office yoga &#38; pilates, ping-pong breaks, and an unlimited vacation policy.<p>We're looking for passionate engineers to join the team. You'll be given a ton of responsibility, wear as many different hats as you want, and have a massive impact on both our technology and business.<p>Get in touch with us at jobs@rally.org.","time":1359767923,"type":"comment"},{"by":"ViktorasJucikas","id":5158902,"parent":5150834,"text":"YPlan (London / NYC). Full time, intern, H1B.<p>We're looking for:<p>+ Senior Android developer (<a href=\"http://yplan.theresumator.com/apply/fF7taf/Senior-Android-Developer.html\" rel=\"nofollow\">http://yplan.theresumator.com/apply/fF7taf/Senior-Android-De...</a>)<p>+ Data Scientist (<a href=\"http://yplan.theresumator.com/apply/4qvHMT/Data-Scientist.html\" rel=\"nofollow\">http://yplan.theresumator.com/apply/4qvHMT/Data-Scientist.ht...</a>)<p>I'm a co-founder and CTO of YPlan (<a href=\"http://yplanapp.com\" rel=\"nofollow\">http://yplanapp.com</a>), tonight's going out app (think HotelTonight but for events). Together with my co-founder Rytis we've built the business from nothing to a very talented and hard-working team of 17 people now, raised $1.7m in funding last summer and launched almost 2 months ago in London. We've got tons of media attention (see below) and tons of happy customer feedback.<p>* Wired: <a href=\"http://www.wired.co.uk/news/archive/2012-11/26/yplan-launch\" rel=\"nofollow\">http://www.wired.co.uk/news/archive/2012-11/26/yplan-launch</a><p>* Techcrunch: <a href=\"http://techcrunch.com/2012/12/28/stuck-for-new-years-eve-in-london-yplan-takes-last-minute-booking-mobile/\" rel=\"nofollow\">http://techcrunch.com/2012/12/28/stuck-for-new-years-eve-in-...</a><p>* Stephen Fry: <a href=\"https://twitter.com/stephenfry/status/279157424642994177\" rel=\"nofollow\">https://twitter.com/stephenfry/status/279157424642994177</a><p>Now we want to move YPlan from iOS / iPhone only into a multi-platform / multi-city business, therefore I'm looking to expand technology and product teams.<p>Any questions please feel free to ping me: viktoras[at]yplanapp.com","time":1359873341,"type":"comment"},{"by":"zds","id":5151357,"kids":[5154400],"parent":5150834,"text":"Codecademy (YC S11), NYC, Full Time, H1B etc<p>We're hiring for a lot!  Help build the future of online education and programming with us.  We have millions of users who have written billions of lines of code and that's just the start.<p>We're hiring for:\n+Designers - both product and communication designers.  Design the interface for native education online!\n+Developers - frontend, backend, and mobile.<p>Check out more - codecademy.com/jobs or send us an email at jobs@codecademy.com.","time":1359733643,"type":"comment"},{"by":"advinture","id":5152370,"parent":5150834,"text":"Arc90, NYC, Remote-friendly<p>Quality Analyst<p>Arc90 is a small Web Application Design and Development agency located in Manhattan. We offer a relaxed and fun work environment where your input and abilities will have a direct impact on the end product of every project you are a part of. You’ll be part of a tight-knit, supportive, creative, collaborative community that is passionate about building great user experiences, learning new skills and techniques, and doing the right thing.<p>We are looking for someone passionate about delivering quality software. Overall, your mandate would be to analyse and improve platform availability. While there’s a diverse range of tasks that you would perform as part of that, all of them are about ensuring the the platform is always available. We have a distributed platform, running on a wide range of languages and technologies, and we need to bring its reliability to the next level.<p>To apply, send a short email to jobs@arc90.com introducing yourself and why this position appeals to you. Include a resume and include a code sample that includes a suite of unit tests.<p>For more details, see <a href=\"http://arc90.com/jobs/quality-analyst/\" rel=\"nofollow\">http://arc90.com/jobs/quality-analyst/</a>","time":1359742871,"type":"comment"},{"by":"mryan","id":5151165,"parent":5150834,"text":"Fashiolista - Amsterdam, NL. Python/Django developers, DevOps. Full time, on-site in our office in the center of Amsterdam.<p>We are a funded startup looking for Python/Django developers and sysadmins with AWS experience... or ideally someone who ticks both of these boxes. As Fashiolista is growing rapidly, we are on the lookout for new team members who can help us scale the site and keep up with our growth.<p>Although we are in the fashion industry, a love of fashion is not required. If you love hacking open source applications and scaling high-traffic websites, you'll fit right in. We encourage our team to work on open source projects where possible, and attempt to open source many of the components we build ourselves. We are looking for \"T-shaped employees\" (a la Valve) who can contribute to a number of areas in the business.<p>Our stack consists of, among other things: - Django - Celery - SOLR - Redis - Memcached - PostgreSQL - AWS (with heavy use of CloudFormation)<p>More information is available on our jobs page (<a href=\"http://www.fashiolista.com/jobs\" rel=\"nofollow\">http://www.fashiolista.com/jobs</a>), you can also email me directly if you would like to discuss the role futher (email in profile).","time":1359732033,"type":"comment"},{"by":"avivwecler","id":5153194,"parent":5150834,"text":"Yodle, NYC, Team Lead Software Engineer (Java)\nYodle’s goal is to help small businesses across the US and Canada grow their business through online marketing. Yodle's Engineering team of 45 powers our 900 person, 130MM company that serves over 30,000 customers.<p>As a Team Lead at Yodle you are taking on the challenge of leading a talented group of engineers to success as a team, as individuals and most importantly as a critical part of our business. You’ll work closely with your Product Manager to make sure that the projects your team works on are knocked out of the park and that the products you are responsible for make our clients - small business owners - gasp in horror at the thought of life before Yodle. You’ll need to command respect both for your technical chops and your leadership. You will be responsible for mentoring your engineers, motivating them and helping them grow in their careers. In our highly cross functional environment you also need to be an excellent collaborator.<p>Apply here : <a href=\"http://www.yodlecareers.com/jobs/new-york/software-engineering-team-lead/\" rel=\"nofollow\">http://www.yodlecareers.com/jobs/new-york/software-engineeri...</a>","time":1359750004,"type":"comment"},{"by":"sofauxboho","id":5154051,"parent":5150834,"text":"SFBA<p>Pivotal Labs is dying for a decent junior support engineer / helpdesk person here in San Francisco. Someone to keep things running smoothly, from troubleshooting OS X to just keeping the cables in the conference rooms connected up right. If you have to stop yourself from fixing computers when you're wandering around in public you're our kind of person. If you enjoy people too and love making tech work for humans, I want to talk to you.<p>This was originally my job. I hired someone to take over for me and got promoted. That guy just got promoted. Now we need someone new. This is the kind of place where you pick a thing and become the dude for that. We're growing about 40% per year, lotsa room to move around.<p>Just out of college? Dropped out of college? That's cool. If you can make computers work for people, that's what counts.<p>Contact me if you wanna know more: reedhn@pivotallabs.com<p>Full (kinda dull) job listing here:\n<a href=\"http://pivotallabs.com/pl_job/it-support-engineer/\" rel=\"nofollow\">http://pivotallabs.com/pl_job/it-support-engineer/</a><p>And of course, we're always hiring ruby and moblie devs:\n<a href=\"http://pivotallabs.com/pl_job/software-engineer/\" rel=\"nofollow\">http://pivotallabs.com/pl_job/software-engineer/</a>","time":1359759032,"type":"comment"},{"by":"uberc","id":5150999,"parent":5150834,"text":"New York, NY -- SPRING AND SUMMER PAID INTERSHIPS<p>Come be part of what some are talking about as \"the coolest thing happening in the New York game industry at the moment\" (from a recent Gamasutra blog post: <a href=\"http://www.gamasutra.com/blogs/BenServiss/20121220/183953/The_Grasshopper_Method_Building_Honest_Buzz_for_Your_Game.php\" rel=\"nofollow\">http://www.gamasutra.com/blogs/BenServiss/20121220/183953/Th...</a>).<p>Grasshopper NYC, a game-lounges-for-grown-ups venture based in New York, is looking for spring and/or summer paid interns in game programming and design. Create games that allow people to have fun together face-to-face in a sophisticated lounge atmosphere, including on our custom multi-touch Round Table.<p>Experience with Unity 3D in C# preferred. We're also looking for a great attitude, willingness and ability to learn quickly, a combination of technical smarts and creativity, and a personal interest in what we're doing.<p>We're also looking for folks with Flash, Python, Arduino etc., or event production skills.<p>For more information, see our website at GrasshopperNYC.com. For questions or to apply, please send resume (and if possible code/game samples) to Ien Cheng at ien@grasshoppernyc.com.","time":1359730573,"type":"comment"},{"by":"jconnolly","id":5151491,"parent":5150834,"text":"TheLadders.com<p>New York, NY - full-time onsite positions in ops, front-end, and dev<p>TheLadders has been committed to finding the right person for the right job since 2003. TheLadders is dedicated to the science behind the job search and can help all career-driven professionals of any level find the right job.<p>Get a proper onboarding experience and grow with us: <a href=\"http://dev.theladders.com/2013/02/onboarding/\" rel=\"nofollow\">http://dev.theladders.com/2013/02/onboarding/</a><p>We're overhauling our jobseeker-facing site and mobile presence, and we'd like you to help.  We have open positions for Systems Engineers (ops), Front End Developer, and Software Engineer.  Our redesign is completely responsive, leveraging backbone.js, mustache.js and friends.  We've got a SOA architecture powered by Java, Scala, some Erlang, whatever hammer befits the nail.  We believe in code craftsmanship and SOLID design principles.  We use puppet for configuration management, and manage our own data center.  If you're interested in responsive design, polyglot programming at webscale, or keeping a sane home-rolled infrastructure, contact me at jconnolly@theladders.com and we'll continue the conversation.","time":1359734788,"type":"comment"},{"by":"chicheng","id":5152449,"parent":5150834,"text":".NET Team Lead (New York, NY)<p>The Exchange Traded Funds Technology Team of Bank of New York Mellon is seeking a team lead.\nIn this role, the individual will be responsible for working as part of a team to update a fast-growing application.<p>We're switching over our architecture to DDD so it's soon going to be a fun time.  You'll have a chance to update our software infrastructure, our development policies, and of course, have input into the architecture itself.<p>Detailed responsibilities include: working within the software development life cycle to bring an application from concept/workflow to production; creating the logic, performing the coding, testing and debugging of applications; modifying existing applications/programs as a result of changes in system/user requirements; providing technical assistance in the use of systems software or utilities.<p>We're an ASP.NET/C#/SQL Server shop.  We're currently on .NET Framework 3.5 but moving over to 4.5 soon.<p>•\tRequired: \n*\t7+ years of experience using Microsoft’s .NET Framework \n*\t7+ years of experience using SQL Server (2005/2008) \n*\tC# \n*\tObject Oriented Design \n*\tStrong Transact SQL \n*\tStrong communications (written and oral) skills<p>Experience in the following would be a plus:<p>*\tFinancial services experience (Securities Processing) \n*\tASP.NET \n*\tCSLA .NET (Old architecture)\n*\tSQL Reporting Services \n*\tDomain Driven Design \n*\tEntity Framework \n*\tMQ Series \n*\tSQL Service Broker \n*\tSubversion \n*\tUnity \n*\tMSTest \n*\tJavaScript \n*\tSQL Integration Services \n*\tWCF \n*\tWeb Services (native implementation)\n*\tExperience in standard SDLC (software development life cycle). \n*\tLDAP<p>Interested parties should reply to this post to vladrozenberg@gmail.com","time":1359743502,"type":"comment"},{"by":"lylo","id":5150985,"parent":5150834,"text":"Edinburgh or anywhere. Full-time engineers. Open source web stack/SaaS<p>FreeAgent (<a href=\"http://www.freeagent.com\" rel=\"nofollow\">http://www.freeagent.com</a>)<p>FreeAgent is a company born out of the frustration that accounting is just too damn hard for freelancers and small businesses. We run a SaaS product to empower people with the knowledge and means to make that easier, and let them do things their way.<p>But whatever we make is only as good as the people making it!<p>We're looking for talented web and operations engineers of all levels, from graduates to team leaders, to come and join us on our mission to democratise small business accounting. We like Ruby, elasticsearch, MySQL, RabbitMQ, Puppet and service-oriented architectures. We're based in Edinburgh but we have a growing team of engineers who are distributed across the UK and USA. If we sound like your kind of company, write to us at jobs@freeagent.com.<p><a href=\"http://www.freeagent.com/company/jobs/ruby-engineer\" rel=\"nofollow\">http://www.freeagent.com/company/jobs/ruby-engineer</a><p><a href=\"http://www.freeagent.com/company/jobs/graduate-software-engineers\" rel=\"nofollow\">http://www.freeagent.com/company/jobs/graduate-software-engi...</a>","time":1359730466,"type":"comment"},{"by":"bryced","id":5152166,"parent":5150834,"text":"CircleUp - San Francisco, CA<p>Fulltime Front-End or Full-Stack Engineer<p><a href=\"https://circleup.com/\" rel=\"nofollow\">https://circleup.com/</a><p>CircleUp is a platform for investing in small private companies.<p>We need engineer #3 to help us with the rapid growth of our business! If you’re ready to build a quality product that helps solve a pressing real-world problem, and you like working in a fun, creative environment that welcomes new ideas, come join us. Love of food trucks &#38; free consumer products samples is a plus :)<p>Skills &#38; Experience<p>- Expert-level proficiency in HTML5, CSS3, Javascript, jQuery, and AJAX.<p>- Python/Django application stack experience, basic backend coding<p>- Familiarity with rich client-side Javascript frameworks (Backbone, Knockout, AngularJS, Ember)<p>- Familiarity with mobile web development best practices (i.e. responsive design, progressive enhancement, graceful \u0003 degradation<p>Responsibilities\n - You’ll work on the full stack and own the front-end (as Engineer #3) on our small, agile team of engineers and designers.<p>- You’ll help solve engineering challenges around the elegant display of complex information, the social graph, the mobile web, scale, security, performance, and more.<p>- You’ll rapidly iterate on a product roadmap driven by lean startup principles.<p>Apply at jobs@circleup.com","time":1359740764,"type":"comment"},{"by":"dale-ssc","id":5153856,"parent":5150834,"text":"Socialserve.com -- Charlotte, NC -- local or remote<p>We're looking to add a developer to our small team.  You'll help us write and maintain our ever-growing stable of web-based Python applications for governments, non-profits, and the public.<p>Reasons to work for us:<p>* Developers are at the heart of our business.  We have a flexible, no-nonsense environment where you can get real work done.<p>* Developers make our technology decisions.<p>* We enjoy programming and take pride in our craft.  We strive to develop software that our users love to use.<p>* Python is our primary language and we develop on OS X and Linux.<p>* We love and use open source software, such as PostgreSQL, PostGIS, Git, and Asterisk.<p>* We're a 501(c)(3) non-profit making software that helps governments and other non-profits help people in need.<p>We're typically most impressed by candidates who have:<p>* A desire and talent for solving problems with software<p>* A strong curious streak and a love for learning<p>* Solid written and verbal communication skills<p>* A breadth of software development experience<p>* Experience with modeling relational data, and also with SQL<p>* Familiarity with web standards and technologies<p>We'd love to hear from you.  Please send a résumé to employment@socialserve.com or read more at <a href=\"http://www.socialserve.com/jobs/\" rel=\"nofollow\">http://www.socialserve.com/jobs/</a>.<p>This is an FTE position only, and only for people with a legal right to work in the US (e.g. no H-1Bs), sorry.  No recruiters, job boards, etc. please.","time":1359756825,"type":"comment"},{"by":"krschultz","id":5151129,"kids":[5152069],"parent":5150834,"text":"Lua Technologies - New York, NY - Full Time<p><i>getlua.com</i><p>We're looking for an Android developer to help us empower mobile workforces. Whether you're working on a film set, running a music tour, managing operations at a sports arena, or keeping guests happy at a hotel you need constant access to your colleagues, conversations, and files. Unfortunately, in these and many other industries, you won't have the luxury of getting the job done while sitting at a computer all day. Lua makes it easy to coordinate, collaborate, and stay accountable on the go.<p>Our product is in its early stages, but we've already got meaningful traction. We're currently active on major studio productions, and are working with professional sports teams and worldwide music tours.<p>We graduated from TechStars New York (2012) and recently raised a $2.5M seed round led by IA Ventures that included angels such as John Maloney (former President of Tumblr), Facebook execs, and the producers of the Batman films.<p>We offer competitive salary, equity, great health insurance, a fun office environment, and 2 round trip tickets to Hawaii for every new hire! Our spacious office is easily accessible, located a few steps from Union Square, right in the heart of the Flatiron district (20th and Broadway).<p>Responsibilities:<p>- Developing, testing, and support of Android applications using Java, JUnit, and Android SDK.<p>- Design and implement new features, create UI, debugging, data modeling.<p>- Testing applications against various Android platform versions and hardware models.<p>- Provide timely turnaround and documentation of bug fixes during test cycle.<p>Contact us jobs@getlua.com","time":1359731748,"type":"comment"},{"by":"ndespres","id":5151094,"parent":5150834,"text":"New York, NY -- IT consultant for managed services provider<p>We're a fast-growing company providing IT consulting and helpdesk services for small businesses in the NYC and north NJ area. It's a \"level 3\" engineer job- you'd be taking escalations from the 1st and 2nd tier techs when they weren't able to solve problems themselves; mentoring them on skills they should know; advising clients on the best ways to improve their infrastructure, and implementing solutions to some fun projects (getting those 8 dusty old DL 320's out of someone's rack and onto their very first VMware deployment!)<p>The right candidate will need 3+ years of experience in a helpdesk or service delivery environment; proven skills with Windows servers from 03-08, including Active Directory, Exchange, DNS, DFS, WDS would be cool.. and experience with multiple server environments. Know what a firewall is too- Sonicwall experience would be great!<p>Be a good communicator, superior troubleshooter, able to work under pressure, and really want to be part of a team.<p>I'd love to talk to you more about it if you're interested! Send your resume to ndespres@cmitsolutions.com and let's chat.<p>www.cmitsolutions.com/grandcentral<p>Neil","time":1359731381,"type":"comment"},{"by":"agmiklas","id":5153387,"parent":5150834,"text":"San Francisco AND Toronto, Full Time, H1B<p>PagerDuty just raised a $10.7M round from Andreessen Horowitz to continue building out our IT alerting and on-call management system:\n<a href=\"http://techcrunch.com/2013/01/31/pagerduty-raises-10-2m-round-from-andreessen-horowitz-for-it-alert-service-modeled-on-aws-system/\" rel=\"nofollow\">http://techcrunch.com/2013/01/31/pagerduty-raises-10-2m-roun...</a><p>We're relied on by Github, 37signals, Heroku, Linode, Microsoft, Adobe, and many others, even though we are still a small team of only 18 people.<p>We're currently hiring across the entire stack: ops engineers, backend &#38; systems engineers, and frontend engineers.  We're also hiring many positions into both of our offices -- Toronto and San Francisco.  For more info on our jobs, please see:\n<a href=\"http://www.pagerduty.com/jobs/\" rel=\"nofollow\">http://www.pagerduty.com/jobs/</a><p>We're especially interested in experienced frontend engineers!  If you're a skilled JS programmer who feels that B2B software is often overlooked when it comes to UI &#38; UX, we want to talk to you!<p>If you'd like to hear more about the jobs, please feel free to email me at andrew@pagerduty.com.","time":1359751826,"type":"comment"},{"by":"wferrell","id":5151745,"parent":5150834,"text":"Palo Alto, CA - Runway 20<p>We're building predictive intelligence into your smartphone.<p>We provide users just the information they need right as they need it and simplify task completion on the iPhone. From telling you 20 minutes before you leave for work that there is a major accident on your typical route, to automatically surfacing key information at the right location -- like your reservation as you approach your hotel -- we simplify your life and help you focus on what's important.<p>We're looking for great people to join our small startup backed by top VCs.<p>Specifically:<p>Backend Software Engineers<p>We look for a B.S., M.S., or Ph.D. in Computer Science or equivalent\n2+ years of programming experience designing and shipping large components of backend services\nExperience programming in Python\nExperience designing and implementing APIs\nExperience with distributed systems and machine learning\nLinux or UNIX OS experience required\nExperience working with database backed web or client applications\nAn ability to write clean code -- and ship\nA passion for learning and always improving yourself and the team<p>iOS Engineers<p>We’re looking for iOS engineers that can build beautiful experiences and effects, and squeeze performance out of the system.<p>B.S., M.S., or Ph.D. in Computer Science or equivalent\nExperience building iPhone/iPad apps\nAttention to performance and memory tuning\nExperience working with web services\nFocus on clean code\nAn ability to ship code -- and fast\nA passion for learning and always improving yourself and the team\nWe would love to see what amazing experiences and effects you have developed<p>Please email me at wferrell AT runway20.com with your resume.","time":1359736648,"type":"comment"},{"by":"ebranson","id":5154098,"parent":5150834,"text":"I give you California goernment jobs in Web 3.0 (tm):<p>spb_vacancy_list.ttl.xz (<a href=\"http://gaia.ecs.csus.edu/~bransone/opengovernment/spb_vacancy_list.ttl.xz\" rel=\"nofollow\">http://gaia.ecs.csus.edu/~bransone/opengovernment/spb_vacanc...</a>)<p>spb_vacancy_details.ttl.xz (<a href=\"http://gaia.ecs.csus.edu/~bransone/opengovernment/spb_vacancy_details.ttl.xz\" rel=\"nofollow\">http://gaia.ecs.csus.edu/~bransone/opengovernment/spb_vacanc...</a>)<p>scrape-spb.py (<a href=\"http://gaia.ecs.csus.edu/~bransone/opengovernment/scrape-spb.py\" rel=\"nofollow\">http://gaia.ecs.csus.edu/~bransone/opengovernment/scrape-spb...</a>)<p>The California State Personnel Board (the civil service of California) vacancy listings as linked data in Turtle (N3) RDF. A weekend hack from years ago given new meaning by the recent death of Aaron Swartz.<p>I hope to use the UK Civil Service ontology when I get a handle on the data. Publishing job vacancies as RDF is a breakthrough. I hope our own government officials notice this and follow suit.<p>This is only the beginning. Help me. Help us.<p><a href=\"http://gaia.ecs.csus.edu/~bransone/opengovernment/\" rel=\"nofollow\">http://gaia.ecs.csus.edu/~bransone/opengovernment/</a>","time":1359759426,"type":"comment"},{"by":"kstenerud","id":5155385,"parent":5150834,"text":"San Francisco, CA (full-time, intern, H1B welcome)<p>MindSnacks - <a href=\"http://www.mindsnacks.com/\" rel=\"nofollow\">http://www.mindsnacks.com/</a><p>-------------------------------------------------------<p>We build wonderful educational games in San Francisco. If you are nice and want to help us make splendid products, we'd love to hear from you.<p>Voted Educational App of the Year by Apple. Funded by Sequoia Capital<p>We're hiring in lots of areas! Here are a few:<p>-------------------------------------------------------<p>* Lead Android Engineer - <a href=\"http://mindsnacks.theresumator.com/apply/35CRVW/Lead-Android-Engineer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/35CRVW/Lead-Android...</a><p>* Game Developer - <a href=\"http://mindsnacks.theresumator.com/apply/Bs3ALK/Game-Developer.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/Bs3ALK/Game-Develop...</a><p>* QA lead - <a href=\"http://mindsnacks.theresumator.com/apply/0tGRiZ/QA-Lead.html\" rel=\"nofollow\">http://mindsnacks.theresumator.com/apply/0tGRiZ/QA-Lead.html</a><p>-------------------------------------------------------<p>For more info, visit <a href=\"http://www.mindsnacks.com/careers\" rel=\"nofollow\">http://www.mindsnacks.com/careers</a> or email us at jobs@mindsnacks.com","time":1359786827,"type":"comment"},{"by":"pretzel","id":5151093,"parent":5150834,"text":"Qubit - London<p>QuBit is Series A backed, and has the first platform that combines analytics, personalization and automation.<p>We use a cutting edge technology stack - Java, Scala, Hadoop, Storm, Kafka and Hive backed by Cassandra, Redis and MySQL DBs, all set up via Puppet. Our infrastructure handles 2 billion pageviews per month and we're always growing!<p>We are heavily invested in JavaScript as well - from our measurement tools, to our visualisation and serving tools - we use node, ruby and quite a custom Backbone stack.<p>We also have a team of Web Developers. If you’re a recent grad and good with JavaScript, if you’re bored with JQuery and want to learn in a fast-paced startup environment then you should apply. Our Web Developers work on the nitty-gritty of integrating our platform and tools with our customers' sites. They create A/B and multivariate tests for our blue chip clients.<p>QuBit is hiring at our London offices!<p>Back End Developers\nJavaScript Engineers\nWeb Developers<p>Check out our website: <a href=\"http://www.qubitproducts.com\" rel=\"nofollow\">http://www.qubitproducts.com</a><p>If you think you've got what it takes send your CV to careers@qubitgroup.com<p>We're looking forward to working with you!","time":1359731370,"type":"comment"},{"by":"pragone","id":5152196,"parent":5150834,"text":"New York - Full time or intern Rails devs<p>Aidin's mission is to bring transparency to the healthcare system and empower patients with data to make more informed decisions on where they receive care. We're backed by the best institutional investors in both consumer internet <a href=\"http://techcrunch.com/2012/06/15/aidin-seed-round/\" rel=\"nofollow\">http://techcrunch.com/2012/06/15/aidin-seed-round/</a>. Aidin was born out of Blueprint Health (3% acceptance rate), a Techstars affiliated healthcare IT accelerator. We're surrounded by amazing talent as we currently reside in Dogpatch Labs (<a href=\"http://dogpatchlabs.com/\" rel=\"nofollow\">http://dogpatchlabs.com/</a>), a highly selective co-working space housing the best startups in New York.<p>As a software engineer on a small team, you'll touch on every aspect of the technology related to the company. It’s a broad job description and we’re looking for someone who loves being part of a fast-paced, constantly evolving work environment where your opinions and decisions will seriously affect our technical direction. We’re looking for a technology generalist with interest in specializing as necessary - It's more important that you love learning and can adopt new languages/frameworks/APIs very quickly.<p>There are few companies poised to actually make an impact on people's lives, but Aidin is one of them. Join a team of people committed to leave a lasting impression on a part of healthcare that one day, we too will rely on. We couldn't be any more excited about what we're doing, and so is the tech community! <a href=\"http://techcrunch.com/2012/10/10/meet-the-three-most-fund-able-health-companies-from-the-dc-to-vc-showcase/\" rel=\"nofollow\">http://techcrunch.com/2012/10/10/meet-the-three-most-fund-ab...</a><p>For more info email mike@myAidin.com, or feel free to contact me (info in profile)","time":1359741051,"type":"comment"},{"deleted":true,"id":5152263,"parent":5150834,"time":1359741760,"type":"comment"},{"by":"bjornsing","id":5176730,"parent":5150834,"text":"Anyfi Networks (<a href=\"http://www.anyfinetworks.com\" rel=\"nofollow\">http://www.anyfinetworks.com</a>) - Malmö, Sweden (H1B equivalent can be arranged)<p>We are looking for embedded software engineers with C and Linux experience to join our engineering team. You will work alongside some very capable engineers to develop a 4G radio access technology with a disruptive price/performance ratio (see <a href=\"http://anyfi.net/documentation\" rel=\"nofollow\">http://anyfi.net/documentation</a> for more info). If you’re up to it you’ll also have the opportunity to travel the world and integrate the software you’ve developed in Wi-Fi routers and residential gateways from leading vendors.<p>Linux and C experience is a must. Internet Protocol and Wi-Fi driver experience is nice to have. We would typically expect a candidate to have an M.Sc. in Computer Science or equivalent and 2+ years working experience (but talent and attitude is most important).<p>Please send you application to jobs@anyfinetworks.com. We're hackers so if you want to impress us tell us about something you've built.","time":1360163690,"type":"comment"},{"by":"paulitex","id":5152684,"parent":5150834,"text":"Learndot – Vancouver, BC, Canada or San Francisco, CA, USA\n<a href=\"http://www.learndot.com/\" rel=\"nofollow\">http://www.learndot.com/</a>\nFull-time, Intern, or Remote (North America)<p>Learndot builds beautiful learning centers for organizations. We exist to make the world a smarter place. Learndot is leading a sea change in how learning for organizations is created, comparable to the change from waterfall to agile software development.<p>We are alumni of the GrowLab accelerator in Vancouver. We sell to many happy businesses that love us (Get Satisfaction, Zirtual among them), make money and are growing very quickly.<p>Both founders are developers and we care about creating great work environments, providing flexibility and autonomy, and helping everyone continuously become better at their craft. We are currently a team of five fulltime.\nCore technologies: Client-side Javascript (we use Sproutcore), Scala (all server-side code).<p>To apply email prlambert@learndot.com with [HN] in the subject line. Open positions:<p>1) App and Web Designer. We are looking for a talented visual designer who wants to help us build smart and beautiful applications for web and mobile. Time would be split around 70%/30% between design on our core app and design for our website &#38; marketing pages. You would work closely with our Chief Product Officer to create solutions for user needs, with your end product being photoshop or keynote exports for our dev team.<p>2) Front-End (JS) or Full Stack Engineer (JS + Scala). We are looking for a great javascript developer who will work directly with our CTO and Designer in building our core application across multiple devices. Learndot is a thick-client JS app using Sproutcore. Our backend API is written in Scala. The ability or desire to work in Scala is a bonus, but our immediate needs are on the JS-side.","time":1359745703,"type":"comment"},{"by":"hesparrow","id":5152337,"parent":5150834,"text":"Simplifydi - Berkeley, CA, Full Time, Remote, H1B: Lead Software Engineer<p>Simplifydi is building a web app to revolutionize the way medical device regulatory submissions are created and maintained. We are focused on SaaS tools that will lead to faster FDA or CE mark approvals and a shorter time to market.  Our product roadmap encompasses all aspects of regulatory submissions including tracking, dashboard and other tools for project management.<p>This is an opportunity to get in on the initial co-founding team. The founders have over 30 years of experience in the medical device industry, starting four successful companies (one of which exited with an IPO) and launching numerous products.<p>We are looking to bring on an enthusiastic and motivated lead developer to create these SaaS tools from the ground up. You will be responsible for the technical aspects of the company, working closely with our small, fast moving team. Working remotely is a possibility as long as there are periodic visits to the main office.<p>If you’re interested to hear more contact Helen [at] decusbiomedical.com","time":1359742479,"type":"comment"},{"by":"aushrine","id":5157661,"parent":5150834,"text":"YPLAN is hiring.<p>London: Android Developer, Data Scientist, Mobile Acquisition Manager.<p>---<p>YPlan is a mobile commerce startup, where we're grabbing a huge, inefficient industry and flipping it on its head through mobile-only approach. With YPlan app, you'll get inspired by a carefully curated list of up to 10 London events, pay in 2 taps and go on the same night. Whether it's a top gig from Hot Chip or an invitation only event like Sofar Sounds, we've got it covered.<p>We're looking for outstanding people to join our team and rock the world together.<p>More information / full job descriptions here:<p>Android Developer: <a href=\"http://yplan.theresumator.com/apply/fF7taf/Senior-Android-Developer.html\" rel=\"nofollow\">http://yplan.theresumator.com/apply/fF7taf/Senior-Android-De...</a><p>Data Scientist: <a href=\"http://yplan.theresumator.com/apply/4qvHMT/Data-Scientist.html\" rel=\"nofollow\">http://yplan.theresumator.com/apply/4qvHMT/Data-Scientist.ht...</a><p>Mobile Acquisition Manager: <a href=\"http://yplan.theresumator.com/apply/8Cunuh/Mobile-Acquisition-Manager.html\" rel=\"nofollow\">http://yplan.theresumator.com/apply/8Cunuh/Mobile-Acquisitio...</a><p>---<p>Or just drop me a line at joinus@yplanapp.com<p>Thanks! :)","time":1359844436,"type":"comment"},{"by":"jobi","id":5151655,"kids":[5151715],"parent":5150834,"text":"Boston or REMOTE - full-time<p>Senior Front-End Developer<p><i>Job Description</i><p>The Woven team at litl is looking for a Senior Front-End Developer to join our Copley Square-based team. You will be responsible for all things HTML at litl, including:<p>- develop full HTML5 applications, for the web, mobile or smart-TV platforms<p>- take over maintainership of our existing HTML-based projects, such as our companion app for Samsung TVs, our shared photo site, our internal Operations Dashboard etc...<p>- maintain the company websites<p>- work in close cooperation with our design team to develop user experience prototypes<p>While our headquarters are in Boston, we have developers from various parts of the world. Working remotely is a common practice at litl.<p><i>Skills &#38; Requirements</i><p>Proven record as an excellent HTML5 developer, ideally on a broad range of browser and platforms:<p>- Expert knowledge of HTML5, JavaScript and CSS3.<p>- Experience structuring large HTML applications and writing maintainable client-side code.<p>- Significant experience with popular web development frameworks (such as jQuery, backbone.js...).<p>- Experience in responsive designs for desktop and mobile browsers.<p>- Strong emphasis on code quality and maintainability. We will ask you for code samples.<p>- Experience working in a small team of developers strongly desired. For example, involvement with an open source project is greatly appreciated.<p>- Experience with git strongly desired.<p>- Experience with other platforms appreciated.<p>- Good sense for design and aesthetics appreciated.<p><i>About litl LLC</i><p>We’re the company that brought you the litl webbook, an Internet computer for the home that’s been hailed as a “design miracle” by Fast Company, “truly new” by John Gruber, and “bold” and “refreshing” by Walt Mossberg.<p>With the launch of Woven, our photo viewing app, we’re increasingly focused on helping people enjoy their treasured photo collections through smart and simple mobile apps, desktop software, and supporting services. More information about Woven is available at its website, woventheapp.com.<p>Email: jobs@litl.com","time":1359736067,"type":"comment"},{"by":"fellowshipofone","id":5151898,"parent":5150834,"text":"Stockholm, Sweden - Shapeup Club (shapeupclub.com)\nLooking for iOS Engineers.<p>Shapeup Club is a team of 8 behind the iPhone and Android application of the same name. We have over 2 million registered users, 250,000+ monthly active users who are using the apps to loose or gain weight while also connecting it with their favorite training app (RunKeeper, Withings, ...). ShapeupClub is one of the top 10 grossing (iPhone) apps in Scandinavia.<p>The team started growing a month ago and we have big plans for 2013 with important product upgrades, new partner integrations with quantified self apps (Fitbit, Endomondo, ...) and a greater international expansion.<p>We are looking for a talented iOS (iPhone and iPad) developer with a passion for interaction design and clear product development methods. Needless to say that at this stage, you will have a lot of influence on the product and you will impact technology choices.<p>Our iPhone app has over 4,200 reviews in Sweden alone\nand over 3000 for our Android app\nOur office is on Kungsgatan 73<p>If you are interested, email me at nicolas@shapeupclub.com","time":1359738236,"type":"comment"},{"by":"billpaydici","id":5152404,"parent":5150834,"text":"Paydici in Portland, Oregon (Chinatown) needs Mostly Daytime DevOps (Chef) and a couple strong Ruby on Rails engineers: one with a focus on front-end and another with a focus on scalable backend processing. Key technologies: Rails, Backbone.js, SASS, Hadoop, EC2, Keurig.<p>If you've got lots of customers to bill, then Paydici will handle it for you: mailing paper bills, processing paper checks, electronic billing and electronic payment. We handle everything and deposit $$ in your account.<p>Deets on positions here: <a href=\"https://paydici.com/jobs\" rel=\"nofollow\">https://paydici.com/jobs</a><p>Sampling of bennies:<p>- competitive blended salary (cash + equity) based on your experience—we’re open to working out the right mix for you<p>- 9 paid holidays per year<p>- annual TriMet pass<p>- vacation: unlimited, after you’ve met your commitments<p>- bike and dog friendly<p>- Powell’s Books 1-1 matching—we’ll reimburse you for one book purchased at Powell’s each month<p>We want team mates with a good sense of humor, masterful self-direction, and of course, technical chops. Life’s too short to work with boring people, so we ask that you bring at least one non-work-related super-power as well.","time":1359743228,"type":"comment"},{"by":"oanda","id":5151820,"parent":5150834,"text":"Toronto - OANDA (<a href=\"http://www.oanda.com\" rel=\"nofollow\">http://www.oanda.com</a>)<p>HTML5 / Javascript Web Developer<p>We are looking for amazing web developers to help us build a new HTML5 trading platform that rivals any desktop offering.<p>If you believe that future of applications is HTML5 and the Web and you want to work in downtown Toronto with a bunch of fun, passionate developers then we want to hear from you.<p>Email: paul@oanda.com","time":1359737504,"type":"comment"},{"by":"witten","id":5151398,"parent":5150834,"text":"EnergySavvy - Seattle<p>EnergySavvy is looking to add to an amazing development team working with cutting-edge, modern technologies. Do you love working on challenging software implementation problems? Do you spend your free-time learning new programming languages and contributing to open-source projects? If so, you'll thrive in EnergySavvy’s quick-paced, collaborative atmosphere.<p>We're a small but rapidly growing software company with the mission of transforming how energy efficiency is delivered by combining user experience and software technology to deliver software-as-a-service solutions our customers and users love. Our software helps people make their houses more energy efficient, addressing a major source of energy waste in this country that impacts our energy independence and contribution to global climate change.<p>As a software engineer at EnergySavvy, you'll work with Django, Python, jQuery, nginx and  PostgreSQL, and deploy your creations early and often to live customers.<p><a href=\"http://energysavvy.com/\" rel=\"nofollow\">http://energysavvy.com/</a>","time":1359733973,"type":"comment"},{"by":"feydr","id":5152077,"parent":5150834,"text":"Appthority<p>FullTime no-remote Backend Developers (ror/c++), Devops, ios researchers .<p>We provide an API for <i>very</i> large companies to scan mobile applications against. We perform static/dynamic analysis (amongst other things) and prepare reports against them.<p>If you join you'll have the ability to own entire projects. You won't be wasting anytime doing boring webdev work. No social local mobile here. Screw that. We have quite a few projects that will allow you to really utilize your knowledge.<p>Yes, we have the booze and the nerf guns and the snacks and all that crap but we actually pay our developers too. Since this is the case we don't do startup slave interns or junior developers.<p>We are funded and have the biggest companies in the world as paying customers and they are asking some quite crazy things of us - step up to the challenge. On a side note - we basically don't build anything until someone hands us a check.<p>We need help but we need people who can write code that is very <i>efficient</i> and very <i>fast</i>.<p>Our office is near Embarcadero, SF.<p>Please email me right now at ieyberg@appthority.com .","time":1359739853,"type":"comment"},{"by":"slicedata","id":5154246,"parent":5150834,"text":"SLICE DATA<p>- Team: MIT, Berkeley, Google Research, Microsoft Research, IBM Research, Yahoo Research, ...<p>- Investors: a16z, SHV, Social Capital, ...<p>- Customers: Fortune 500s down to SMBs<p>- Product: machine learning applications for non-technical users to help their businesses more effectively capture and retain customers<p>- Looking for: smart hackers, ideally strong in data mining, who are also excited to join an early-stage startup and grow with the company<p>RESPONSIBILITIES<p>- Build predictive models using sophisticated algorithms and data extracted from the web and other sources<p>- Interact with customers, analyze their data, understand their pain points, and develop new product features and new products<p>- Develop and operate secure, scalable cloud infrastructure to manage and process customers' large, confidential datasets<p>QUALIFICATIONS<p>- BS/MS/PhD in Computer Science, Statistics, Math or related fields<p>- Depth in software engineering, algorithms, and general analytical problem-solving<p>- Ideally experienced with analyzing data sets, formulating data problems, and building machine-learned models<p>- Familiarity with Python, Java/Scala, or R preferred<p>CONTACT<p>- <a href=\"https://www.slice-data.com\" rel=\"nofollow\">https://www.slice-data.com</a><p>- hiring@slice-data.com","time":1359761498,"type":"comment"},{"by":"dawson","id":5154703,"parent":5150834,"text":"To all exceptional Ruby engineers, Objective-C developers, Javascript developers, designers and sysadmins:<p>If you are ready to join a fast growing team of passionate engineers, designers and medical professionals wanting to address the clunky, legacy and vendor lock-in IT healthcare at a global level, we want to hear from you. Our take on the ePHR is <a href=\"https://howareyou.com\" rel=\"nofollow\">https://howareyou.com</a>, you can find out more about our company vision here <a href=\"http://cambridgehealthcare.com\" rel=\"nofollow\">http://cambridgehealthcare.com</a>.<p>You will be working on a service oriented architecture, completely API driven, running on the best hybrid infrastructure - our private Heroku for healthcare if you wish. You will be learning from the best in their field while working from our new, bespoke London office with great natural light and lovely period features. The office comes with a table tennis-table including weekly table tennis sessions with a professional coach, drinks vending machine and a retro arcade machine, all courtesy of How are you?. The Office is situated right in the middle of Silicon Roundabout, 5 minutes walking distance from Old Street station. You can find pictures of our office on our Twitter account <a href=\"https://twitter.com/howareyou\" rel=\"nofollow\">https://twitter.com/howareyou</a><p>All positions are full-time and on-site only, we are willing to help the right candidates in any way we can, regardless of their location. We reward talent, experience and commitment fairly, salaries range from £40k to £90k. All candidates are encouraged to get in touch with us on jobs.hn@howareyou.com<p>How are you? is a venture funded and internationally award winning healthcare startup, based in Cambridge, London and now Beijing. Winner of the most prestigious Institute of Engineering and Technology Innovation Award for best IT Technology and HealthInvestor Award for IT innovator of the year 2012.","time":1359768628,"type":"comment"},{"by":"malandrew","id":5151947,"parent":5150834,"text":"Famo.us<p>Fulltime in SoMa, San Francisco, CA. No remote.<p>We're building the equivalent of Cocoa/CocoaTouch/Android SDK for web applications. If you are a software developer with a passion for building operating systems, high performance graphics, application frameworks and software engineering tools come join us, because we're working on something big getting attention from some of the biggest names in Silicon Valley (although we can't yet say who).<p>Experience with functional programming and especially functional reactive programming is a huge plus. Our main language right now is in JavaScript, because that is what runs in the browser. However, we're still very small and use of only JavaScript isn't set in stone. We're also considering languages particularly well-suited for metaprogramming as we build out our developer tooling (e.g. Clojure &#38; ClojureScript).<p>Apply for jobs via AngelList, <a href=\"https://angel.co/famo-us#recruiting\" rel=\"nofollow\">https://angel.co/famo-us#recruiting</a> , or email tyler@famo.us","time":1359738690,"type":"comment"},{"by":"vide0star","id":5182351,"parent":5150834,"text":"Smarkets, London, Software Engineer, Python, Erlang &#38; Mobile<p>Smarkets is disrupting the global betting industry by offering a modern betting exchange with significantly lower transaction fees than the competition. We're a well-funded company with a small, agile development team. We've handled over £250 million of bets since launching in 2010.<p>Our office near Old Street in London is shared with other exciting startups and has a pool table, foosball table, and fully stocked fridge.<p>We're heavily driven by user-focused design and a focus on technology and engineering as a first class discipline.\nWe write our software in Python and Erlang, and rely heavily on asynchronous programming techniques and REST. We build on a modern, open-source software stack which includes Linux, Vagrant, Flask, Eventlet, PostgreSQL, RabbitMQ, ElasticSearch, Graphite, Chef, and Git.<p>For more info: <a href=\"https://smarkets.com/about/jobs/engineering\" rel=\"nofollow\">https://smarkets.com/about/jobs/engineering</a>","time":1360249244,"type":"comment"},{"by":"amackera","id":5151367,"parent":5150834,"text":"Toronto, Canada<p>Top Hat Monocle (<a href=\"http://www.tophatmonocle.com\" rel=\"nofollow\">http://www.tophatmonocle.com</a>) is hiring for a few roles: mobile dev (iOS, Android), sysadmin/infrastructure developer (rabbitmq, selenium, fabric, ec2), general web developer (python, django, javascript, node.js.) We also hire interns so please feel free to apply for that as well (paid of course.)<p>We're a profitable (and valley VC funded) education startup that helps make class more engaging. We've got some really cool problems to work on and your work would be impacting a huge number of students daily.<p>Our dev team is in Toronto but we've also got an office in San Francisco so if you're really good we would be open to having someone work from there. If you're not based in Canada or the US but are willing to relocate feel free to contact us, because we do cover relocation expenses and will help you manage the work permit process.<p>Send your resume/github account to anson at tophatmonocle dot com.","time":1359733727,"type":"comment"},{"by":"andygeers","id":5151024,"parent":5150834,"text":"Hubbub - London or surroundings - Full time<p>Hubbub is saving independent food shops by letting people order online when they can't get to the shops themselves. We mask the complexity of ordering from lots of separate shops and allow customers to place a single order online and receive all their weekly shopping in one go. It's good for the shops because it lets them reach a wider audience, and it's good for our busy customers because it allows them to support their local community.<p>We're looking for two developers, who will double the size of our current team, to work on our Rails based website and supporting applications. Ruby experience is a plus, but we're very happy to take on people without direct experience if they know how to learn - our second developer hadn't written any Ruby before starting with us.\nMore details, including how to apply, are at <a href=\"http://developers.hubbub.co.uk/\" rel=\"nofollow\">http://developers.hubbub.co.uk/</a>","time":1359730788,"type":"comment"},{"by":"rAtClimateC","id":5160100,"parent":5150834,"text":"San Francisco, Seattle: JavaScript, Rails, and Clojure / Java engineers<p>The Climate Corporation’s mission is to help all the world’s people and businesses manage and adapt to climate change.  To achieve our mission, we have built a unique technology platform to enable, for the first time, the real-time pricing and purchasing of customizable weather insurance. Managing over 200 TB of data, including 34 trillion+ weather simulation data points, 150 billion soil type observations, and more than 3 million daily weather measurements, we are one of the largest users of Amazon Web Services.<p>The Climate Corporation is focused on the enormous challenge and opportunity of protecting the $3 trillion global agriculture industry from the financial impact of adverse weather – the cause of over 90 percent of crop loss – with fully automated weather insurance products. We are also building web and mobile applications that unleash the power of our unique data and analyses to help farmers manage their daily work with field-level weather and crop insights.<p>At The Climate Corporation, leaving a mark on the world is in our DNA; we want to make a lasting and meaningful real-world impact. We relish big problems because they are the most interesting to tackle, the most rewarding, and typically, the most valuable to solve. We also thrive on finding the possible in the impossible.<p>If you are the best at what you do, you like solving interesting problems, and you are looking for like-minded people dedicated to having a major impact on the world, we are eager to talk with you.<p>See our video about what it’s like to work at The Climate Corporation: goo.gl/lNVPS<p>We're an extremely well funded series C startup (~$110 million) with huge things in the works!<p>We're primarily looking for JavaScript, Rails, and Clojure / Java engineers. If you think the above sounds interesting and feel like you might be a good fit, send me your resume.","time":1359909765,"type":"comment"},{"by":"danso","id":5151236,"parent":5150834,"text":"Bloomberg - New York, NY and Washington DC - Full Time Ruby on Rails related dev jobs (I'm not from Bloomberg, just noticed it on their careers site)<p><a href=\"http://jobs.bloomberg.com/search?q=ruby&#38;location=\" rel=\"nofollow\">http://jobs.bloomberg.com/search?q=ruby&#38;location=</a><p>(the dates indicate when the job was posted)<p>Ruby on Rails Developer - Bloomberg Institute Job\tNew York, NY, US\t\nDec 14, 2012<p>Ruby on Rails Developer Job\tWashington, DC, US\t\nDec 27, 2012<p>Ruby on Rails Developer Job\tNew York, NY, US\t\nDec 23, 2012<p>Bloomberg Government - Web Developer Internship Job\tWashington, DC, US\t\nJan 8, 2013<p>Web Front-End Software Engineer Job\tNew York, NY, US\t\nDec 6, 2012<p>Senior Web Developer - Consumer Websites Job\tNew York, NY, US\t\nDec 23, 2012<p>Senior Java Developer Job\tNew York, NY, US\t\nDec 23, 2012<p>Senior Web Developer - Businessweek Job\tNew York, NY, US\t\nDec 8, 2012<p>Senior Cloud Builder Job\tNew York, NY, US\t\nDec 2, 2012<p>Web Infrastructure Architect Job\tNew York, NY, US\t\nDec 29, 2012<p>Senior Software Engineer - Data Visualization Job\tNew York, NY, US\t\nDec 5, 2012<p>Reliability Engineer - CTO Office Job\tNew York, NY, US\t\nJan 24, 2013","time":1359732715,"type":"comment"},{"by":"bradhe","id":5152663,"parent":5150834,"text":"Cloudability in downtown Portland, Oregon<p>We help companies get their arms around how they're using the cloud. We're the only cross-vendor cloud analytics platform on the market and we're the only company that can reliably report on cost and usage of Amazon and other cloud platforms.<p>ENGINEERS: We're looking for Ruby engineers that are in love with big data. We'll need your help scaling up our data pipeline and building tools that our front end team can use to provide the best-in-class user experience that we're already known for.<p>DEVOPS: Devops at Cloudability is an opportunity to define best practices for how to efficiently use the cloud. Devops here is full stack role: Not only will you be in charge of building out our infrastructure, but you'll also to define how we provide the most reliable product on the market, end-to-end.<p><a href=\"http://www.cloudability.com\" rel=\"nofollow\">http://www.cloudability.com</a>\nEmail: Brad Heller, brad@cloudability.com","time":1359745526,"type":"comment"},{"by":"phillytom","id":5151439,"parent":5150834,"text":"Monetate - Conshohocken, PA (Philly suburbs) - No remote, but we will help you with relocation.<p>Monetate helps internet marketers make their site more relevant.  We turn data in action on our clients' sites by doing real-time data analysis and DOM manipulation to put the right experience in front of their users.  We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>What we're looking for:<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve our users' problems<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on<p>* Open source - Google Closure, Python, Hadoop, Mahout, Solr and Lucene - we're open source across our stack<p>About us:<p>* Founded in 2008<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one).  Our technical teams have full authority over (and responsibility for) the problems they work on.<p>* Market rate salaries<p>* Funded by First Round Capital and OpenView<p>We've hired great people from HN in the past. We're looking for people not positions.  We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds.<p>Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a><p>Feel free to email me with any questions or to apply - tjanofsky monetate com","time":1359734311,"type":"comment"},{"by":"thesash","id":5151740,"parent":5150834,"text":"Tradesy is hiring developers and designers for web and mobile, full-time and interns, in Santa Monica or remote.<p>We're building a peer to peer online marketplace that facilitates sticking points in the transaction that prevent people from buying and selling online, from suggesting pricing, to providing shipping kits and handling returns on behalf of sellers, to ranking items in the storefront.<p>Since launching in October we've gotten a lot of great press:<p><a href=\"http://tradesy.com/press\" rel=\"nofollow\">http://tradesy.com/press</a><p>and more importantly, we've gained significant traction right out of the gate, as well as an overwhelmingly positive response from our customers.<p>We're a small team, you'll be the fourth engineer, and while we develop on a LAMP stack with Redis and Solr on top, we value strong engineering talent with a background in Java and/or C++. PHP experience is a perk but not required.<p>For mobile, we're working on iOS first since 75% of our mobile traffic is iOS based, but if you develop for Android we'd still love to talk to you.<p>Marketplaces pose a lot of interesting technical challenges like working with large and rapidly growing sets of user submitted items, processing large volume transactions, working with image processing and manipulation, developing algorithmic solutions for curation, spam, and fraud, and automating chunks of the logistical backend that runs behind the scenes.<p>As a company we value transparency, sustainability, and customer service. We're relentlessly focused on developing a product people love, and to that end we focus on quantitatively measuring impact of the changes we make to the product, as well as getting constant feedback from our customers.<p>You can reach us through angel list, or contact me direct at sash@tradesy.com<p><a href=\"https://angel.co/tradesy#recruiting\" rel=\"nofollow\">https://angel.co/tradesy#recruiting</a>","time":1359736629,"type":"comment"},{"by":"joeconway","id":5219107,"parent":5150834,"text":"Shoreditch, London, UK<p>IOS and ANDROID MOBILE DEVELOPER, full-time or internship<p>We are looking for an open-minded, creative, passionate and experienced mobile developer with experience in writing code for either iOS or Android.<p>Requirements:\n- Experience in Mobile development (iOS, Android, Sencha Touch)<p>- Understanding of Git or other version control platforms<p>- Preferable to have code examples available or a public Git repository<p>- A keen interest in startups and best development practices<p>- At least one published app<p><i>Who we are</i><p>Leto (<a href=\"http://letolab.com/\" rel=\"nofollow\">http://letolab.com/</a>) is a London-based technology innovation house that helps clients around the world to build startups and reengineer existing businesses. Not only we create web and mobile applications for our customers, but we also develop our bespoke in-house technologies.<p>In addition to other services, we provide technology and strategy consultancy to derive a competitive advantage for our clients. Our approach focuses on lean software development applying agile methodologies and cutting edge technologies.<p><i>WE OFFER</i><p>- Competitive salary<p>- Friendly and easy-going team<p>- Hands-on experience with real Silicon Valley and London startups<p>- Working with a cutting-edge technology every day<p>- Opportunity to meet entrepreneurs, investors, mentors at various events<p>- Opportunity to develop and launch your own project with our help<p>- And of course, many amazing parties and fun, not to mention our Beer Fridays! :)<p>Shoot us an email on team@letolab.com (bonus points for mentioning that you found us on HN)! Remember to include your CV and portfolio, so we can learn more about the amazing work you've done in the past!","time":1360844720,"type":"comment"},{"by":"whockey","id":5151764,"parent":5150834,"text":"Plaid Technologies - plaid.io<p>San Francisco, CA - Full Time and Internship - Developers &#38; Designers<p>Plaid makes it simple for any developer or application to link with credit and debit card spending data. In the process, we're generating one of the largest transactional data sets in the world, and using machine learning and statistical analysis to draw insights about how consumers spend their time, money, and attention.<p>We're a small, all engineering team - looking to bring on more ambitious, fun team members. Our stack is made up of Node, Hadoop and Hive with Mongo and Redis. We're looking for experienced generalists, and prefer fast learners to specific experience with our stack. Whether you're a mobile developer, data scientist, or or a resident philosopher we'd love to hear from you.<p>Interns: <a href=\"https://plaid.io/summerofplaid\" rel=\"nofollow\">https://plaid.io/summerofplaid</a>\nFull-time: email jobs[at]plaid.io","time":1359736842,"type":"comment"},{"by":"armrbusting","id":5220021,"parent":5150834,"text":"NYC<p>ff Venture Capital<p>Engineer/Developer/Hacker in Residence<p>Looking for an awesome engineer to come in-house and join our team.<p>-Define and test your best practices while developing in-house proprietary products.  Such products will be used by both our portfolio and offered to the greater startup community.  If these products are successful, we may spin them out to be an entirely separate companies.<p>-Support ff Venture Capital in all things engineering/technical, including providing technical due diligence on potential investments.<p>-Support specific portfolio companies as needed, including, but not limited to coaching/mentoring young companies and tech leads, and performing technical interviews.<p>Check out ff at: <a href=\"http://www.ffvc.com\" rel=\"nofollow\">http://www.ffvc.com</a><p>Check out the full listing at:\n<a href=\"http://ffventure.theresumator.com/apply/iMl5nU/Developer-In-Residence.html\" rel=\"nofollow\">http://ffventure.theresumator.com/apply/iMl5nU/Developer-In-...</a>","time":1360857715,"type":"comment"},{"by":"Peroni","id":5155703,"parent":5150834,"text":"Globaldev - London, UK: Ruby Engineers &#38; Ruby on Rails Developers - Permanent &#38; Contract<p><a href=\"http://globaldev.co.uk/jobs\" rel=\"nofollow\">http://globaldev.co.uk/jobs</a><p>Globaldev are the tech team behind the largest social network you’ve probably never heard of. One of the world’s leading social discovery and dating companies, we’re the Facebook for people who haven’t met yet – enabling people to find new friends and partners online for fun and adventure in real life.<p>We’re looking for 2-3 expert Ruby engineers &#38; RoR Developers to help us build a series of major enhancements to our dating platform and infrastructure over the next 12 months.<p>It's a fantastic place to work where you'll be surrounded by incredibly talented developers working on big data problems and we are working hard to ensure we provide the best environment for Ruby/RoR Devs in London.<p>For more info or to apply email me - sbuckley@globaldev.co.uk","time":1359801092,"type":"comment"},{"by":"bokchoi","id":5152027,"parent":5150834,"text":"LabKey Software <a href=\"http://labeky.com/\" rel=\"nofollow\">http://labeky.com/</a><p>Seattle, San Diego<p>LabKey Software is hiring exceptional people who will help scientists attack some of the most challenging problems in the world. Our team partners directly with leading biomedical researchers working to prevent and treat a wide range of diseases (HIV, cancer, diabetes, auto-immune diseases, asthma, allergies, and others); we learn their research and develop solutions to their data management and analytical challenges. We release everything we develop as open-source software, accelerating research in labs and networks throughout the world.<p>LabKey Software is headquartered in Seattle, WA and is establishing a new development office in San Diego.<p>We currently have openings for Java devs and test/QA engineers.  <a href=\"http://www.labkey.com/company/careers\" rel=\"nofollow\">http://www.labkey.com/company/careers</a>","time":1359739321,"type":"comment"},{"by":"perezda","id":5151186,"parent":5150834,"text":"Mountain View, CA - Wedding Party www.weddingpartyapp.com<p>Looking for Android, Rails or iOS Engineers.<p>1. We’re building a company that’s bringing mobile technology to the massive ($100bln) wedding industry. (there are over 2.5M weddings and 300M guests a year in the US alone)<p>2. We’ve seen tremendous growth and are currently working on some technically interesting multi platform and scaling challenges. There are also big data challenges on the horizon.<p>3. We’re a small team of 5 and you will have a huge material impact on the growth of the company.<p>4. We’re on Rails 3.2, Objective C, Java. We use Coffeescript, Underscore, Haml, and Sass. We test with RSpec, Capybara and Selenium.<p>5. We work at an awesome office near downtown Mountain View and have a diverse and wicked smart team.<p>Learn more here: <a href=\"http://www.weddingpartyapp.com/jobs\" rel=\"nofollow\">http://www.weddingpartyapp.com/jobs</a><p>If you’re interested, email us at jobs@weddingpartyapp.com","time":1359732220,"type":"comment"},{"by":"harel","id":5170004,"parent":5150834,"text":"London, UK - Glow is Hiring Python and JavaScript Developers<p><a href=\"http://thisisglow.com/\" rel=\"nofollow\">http://thisisglow.com/</a><p>Glow is on a rapid growth curve and are currently looking to assemble a super team of great developers to work in our West End office. We’ll do everything we can to make you feel at home. We have fun challenges to offer, playing with big data, scalability, machine learning, analytics, user interface and we're always willing to learn new things.\nWe cook with Python, Javascript, a large dose of other cutting edge technologies and a healthy mix of social and advertising APIs. If you think you can hack it, we'd love to hear from you.<p>Email us: careers@thisisglow.com<p>A bit more info: <a href=\"http://www.reddit.com/r/london_forhire/comments/150v91/hirin..\" rel=\"nofollow\">http://www.reddit.com/r/london_forhire/comments/150v91/hirin...</a>.","time":1360059949,"type":"comment"},{"by":"sadadar","id":5151364,"parent":5150834,"text":"ConnectSolutions - San Francisco, CA - Full Time <a href=\"http://www.connectsolutions.com/careers\" rel=\"nofollow\">http://www.connectsolutions.com/careers</a><p>ConnectSolutions works in the Unified Communication space as a managed services provider, hosting enterprise and government UC products and building a platform and services around them. We are a profitable small business based in SF that was bootstrapped but recently took investment ($10M, <a href=\"http://tiny.cc/qnqdrw\" rel=\"nofollow\">http://tiny.cc/qnqdrw</a>) in order to drive additional growth. We solve real and challenging collaboration problems for a large base of highly recognizable customers. Our success is in a large part due to the collaborative nature of our business and dynamic company culture. Our competitive compensation, benefits and perks reflect the high value we place on our people. Sometime this year ConnectSolutions customers (including Google, Charles Schwab, KPMG, SAS, Kaplan, General Motors, USAID, FDA, and many others) will surpass 5 billion collaboration minutes.<p>We're looking to start to ramp up a SaaS business to augment our successful and profitable managed services business that attracts high profile enterprise and government customers with a business that can take our lessons learned and value to small to medium sized business.<p>- Our product manager wants a full stack engineer with a lot of energy to work closely with to co-found a business line, if you're interested in being a technical co-founder without  the risk of short runway this would be a great job for you.<p>- Our engineering team is looking for a devops engineer who can help move us into a SaaS world while our 5 year history is in managed services.<p>- We're also hiring a support engineer on our managed services side and an associate customer engagement person (combo project manager and account manager)<p>If interested in any of these positions, or you just think the domain/company sound cool and aren't a fit for these but want to work with us, e-mail me at matt@connectsolutions.com.","time":1359733695,"type":"comment"},{"by":"rrhyne","id":5151997,"parent":5150834,"text":"Orderoso (San Diego, Remote) - PHP/MySql Software Engineer<p>Your core duties will be MVC based PHP (yii preferred) and MySQL, but you'll finish features out with HTML, CSS and javascript. You'll have direct input on all levels of the product, from concept to deployment. Every person in the office is considered a seasoned UX person, experience in this area is a plus. You might know about design for efficient data management.  Experience with Node, Backbone.js and NoSQL technologies is a plus.<p>Core: PHP via MVC, MySQL, HTML, jQuery, handcrafted javascript and CSS, TDD and RESTful APIs, GIT, 3+ years experience<p>Bonus: Ecommerce, d3.js, Appcelerator Titanium, Phone Gap or other Javascript mobile frameworks, NoSQL, Node.js, Backbone.js, Linux server administration<p><a href=\"http://orderoso.com\" rel=\"nofollow\">http://orderoso.com</a> send resume to tech at orderoso.com","time":1359739114,"type":"comment"},{"by":"avar","id":5150851,"parent":5150834,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there currently working on infrastructure tasks and relocated over there about three years ago, and have been very happy with it.<p>We have people from all over the world relocating to work with us and are very well set up to handle relocation and visa issues, most of the people working in IT are expats so we've got a lot of experience with bringing people in.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline (PCLN) group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.<p>We use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it. We're also very open to open sourcing code that doesn't contain any business logic, I've personally been involved in open sourcing a few of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and a few CPAN modules.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers.\nYou don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before. The sort of people we'd like to hire are good technically, excellent at communication, and can acquire a good sense of how they fit into the big picture.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume, I've posted in a similar thread here a few times before andI've fielded a bunch of questions from would-be applicants. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent","time":1359729306,"type":"comment"},{"by":"radimm","id":5151073,"parent":5150834,"text":"Berlin, Germany or Remote (within EU); relocation possible; no agencies<p>candena GmbH (<a href=\"http://candena.com/\" rel=\"nofollow\">http://candena.com/</a>) - recently incorporated in Germany - is building the team-based collaboration platform for educational and training purposes. We have already been chosen as the official platform provider for the open online course that launched in January 2013 and is operated by world-known academic and business experts in US and Europe.<p>We are hiring for multiple full-time positions:<p>* Lead Developer (Ruby/Rails, Full Stack experience, Project management)<p>* Full stack engineer (Ruby/Rails, Coffee Script, usability, testing)<p>* UI/UX developer (HTML/CSS/JS/CoffeScript with Ruby/Ruby on Rails knowledge)<p>If you are interested, feel free to contact me directly at rmarek@candena.com together with the CV and/or Github repository, examples of your work, etc.","time":1359731199,"type":"comment"},{"by":"swang","id":5154573,"parent":5150834,"text":"Metamarkets - <a href=\"http://www.metamarkets.com/\" rel=\"nofollow\">http://www.metamarkets.com/</a> - San Francisco, CA\nLooking for: Interns, Full-Time, H1B transfer-friendly<p>Metamarkets is looking for people who are excited by data.<p>We have a number of different engineering positions open both on the front-end and the back-end.<p>On the front-end we're running entirely in JavaScript/CoffeeScript with Node.js for our server-side along with a framework called DVL that builds on top of D3.js.<p>On the back-end we're using everything from Java, Scala, R, Hadoop, Pig, ZooKeeper, to Memcached. This is all to help run our own distributed, column-oriented analytical datastore called Druid.<p>Please see <a href=\"http://metamarkets.com/jobs/\" rel=\"nofollow\">http://metamarkets.com/jobs/</a> for more information about the jobs we have open. Questions please send to hiring@metamarkets.com","time":1359766600,"type":"comment"},{"by":"willf","id":5151382,"parent":5150834,"text":"Reverb Technologies (aka Wordnik) has a number of good positions available including: iPad Visual Designer, iPad Interaction Designer, Full-Time Web and Mobile Designer, iOS Developer, Frontend Hacker, Server Engineer, Machine Learning Expert, Computational Linguist, and Analytics and Data-Mining Expert. Job descriptions are at <a href=\"http://www.helloreverb.com/jobs/\" rel=\"nofollow\">http://www.helloreverb.com/jobs/</a> (where you'll also see a bit about what it's like to work here).<p>Feel free to contact me at will@helloreverb.com if you want to apply or have questions — and check out what we're building at <a href=\"http://helloreverb.com\" rel=\"nofollow\">http://helloreverb.com</a> (as well as <a href=\"http://wordnik.com\" rel=\"nofollow\">http://wordnik.com</a>, which just got a bit of a refresh).","time":1359733835,"type":"comment"},{"by":"soundandfeury","id":5152465,"parent":5150834,"text":"Location: Atlanta, GA<p>Company: Experience ( <a href=\"http://www.findexp.com/\" rel=\"nofollow\">http://www.findexp.com/</a> )<p>Looking for devs of all shapes and sizes.<p>We are a small group of sports / music fans that believe live events should be more fun. Our product lets teams offer unused or unsold seats as in venue upgrades through a mobile device,  providing an awesome experience for the fan.  It's better for fans, better for teams, and both love our current product. We are a well-funded and passionate startup, looking for a few devs to help us grow and change the industry.<p>Some technologies we use: Groovy/Grails, PostgreSql, redis, BackboneJS, etc. Experience with any of these is not required. We believe a good dev can pick up tools as necessary. We move fast, and we love new challenges and finding the right solution for them.<p>Contact us: listen [at] findexp.com","time":1359743639,"type":"comment"},{"by":"bostonpete","id":5151746,"parent":5150834,"text":"Exa (<a href=\"http://exa.com\" rel=\"nofollow\">http://exa.com</a>)<p>Burlington, MA (on 128 outside Boston)<p>We're a relatively small software company that develops simulation products that are extensively used for product design in a number of (e.g. automotive, aerospace, and motorsports). I manage the preprocessor group here.<p>Exa has a number of SW positions listed on our site, but I'm hiring for a couple of positions that aren't yet listed there. Here's the more senior position description on monster (I'm also looking for recent grads for a similar, but more junior role)...<p>Senior Software Engineer – Graphical Preprocessor Development - C++<p><a href=\"http://jobview.monster.com/Senior-Software-Engineer-Graphical-Preprocessor-Development-C-Job-Burlington-MA-US-118789067.aspx\" rel=\"nofollow\">http://jobview.monster.com/Senior-Software-Engineer-Graphica...</a>","time":1359736649,"type":"comment"},{"by":"tjlogins","id":5151214,"parent":5150834,"text":"M6D (media6degrees) is hiring full-time Java developers in NYC.<p>Required Technical skills:\nServer-side Java including multi-threading, concurrency, database connectivity, etc\nLinux\nSQL\nTDD, Unit, Integration and Functional testing.\nSubversion or Git\nExperience with dependency injection and design patterns\nOne or more of the following considered a PLUS:<p>Desire to work with Kafka, Cassandra, Hadoop/Hive, Machine Learning, Real-time Bidding, Distributed Systems, Big Data.\nDetailed knowledge of browsers and web technologies\nCode profiling and optimization\nExperience with online ad serving\nBrowser Re-targeting\nExperience integrating with a major advertising exchange through APIs (e.g., YieldManager, DoubleClick)\nDog lover, musical skills, winning Ping Pong and/or Ultimate Frisbee awards!<p>interested? email me: tj@m6d.com","time":1359732495,"type":"comment"},{"by":"sashthebash","id":5152717,"parent":5150834,"text":"StorageRoom - Berlin, Germany - H1b\n-----------------------------------<p>We’re building a cloud-based Content Management platform that’s targeted at developers. We just received funding from prestigious VCs (unannounced).<p>You say Content Management sucks? That’s exactly what we think, and we see a huge opportunity to do something completely different that plays well with HTML5/JS and native mobile apps. The initial version of our platform is already used by hundreds of customers, from major global media companies to small development agencies (e.g. Viacom).<p>We already have a team of incredible developers that are working on the next generation of our service. We are looking for a <i>growth hacker</i> that can help us market the service.<p>Interested? Please send an email to sascha@thriventures.com and we can tell you more.","time":1359745975,"type":"comment"},{"by":"bendilts","id":5151097,"parent":5150834,"text":"Lucidchart - Salt Lake City, UT<p>Lucidchart is a rapidly growing tech startup looking for great backend software engineers to join us at our headquarters in Utah. At Lucidchart, we build killer graphical web applications requiring highly available, secure and scalable backend services. Talent and ability to learn are more important than years of experience.<p>You may have seen Lucidchart demoed during the second Google I/O 2012 keynote: <a href=\"http://t.co/sd6GgZvy\" rel=\"nofollow\">http://t.co/sd6GgZvy</a><p>We're hiring BACKEND SOFTWARE ENGINEERS. Lucidchart runs with various decoupled services in a Linux environment using Scala, PHP, MongoDB and MySQL. At Lucidchart, your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly reliable and scalable.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Scala or Java * PHP * MySQL or other relational database * NoSQL databases (MongoDB especially desirable) * Opscode Chef or Puppet * Cloud computing (AWS)<p>We're also hiring FRONTEND SOFTWARE ENGINEERS. We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Javascript * Google Closure compiler/library * CSS/HTML/DOM manipulation * jQuery * node.js * Native app development on Android and/or iOS * Facebook APIs<p>We're also looking for a product manager to help us unify the vision of Lucidchart and our future products, develop relationships with key integration partners, and be sure we always deliver the highest value to our customers.<p>All applicants email resumes to jobs@lucidchart.com.","time":1359731394,"type":"comment"},{"by":"expect_labs","id":5151901,"parent":5150834,"text":"San Francisco, CA (full-time, remote, H1B welcome)\nExpect Labs (<a href=\"http://www.expectlabs.com\" rel=\"nofollow\">http://www.expectlabs.com</a>)<p>-------------------------------------------------------<p>Expect Labs is a startup based in downtown SF that is building a product called MindMeld (www.expectlabs.com/mindmeld). We're backed by some of the most prominent investors in Silicon Valley, including Google Ventures and Greylock.<p>-------------------------------------------------------<p>Our open positions include:<p>Back-end Software Engineer\nFront-end Software Engineer\niOS Engineer\nAndroid Engineer\nDesigner\nProduct Manager<p>-------------------------------------------------------<p>If you are awesome and interested in what we're working on, we'd love to hear from you. Visit www.expectlabs.com/jobs or shoot us an email at jobs (at) expectlabs (dot) com. Thanks and good luck!","time":1359738260,"type":"comment"},{"by":"bwb","id":5152587,"kids":[5163718],"parent":5150834,"text":"World Wide Web Hosting LLC / Site5.com<p>We are 100% remote based, so you can be anywhere in the world!\n<i>Our big focus is on work life balance, we don't do overtime and we work really hard to ensure everyone has a generous amount of time off.<p>Ruby on Rails Developers - Remote anywhere in world.\n</i>Check out our projects at <a href=\"http://www.eng5.com/projects.html\" rel=\"nofollow\">http://www.eng5.com/projects.html</a><p>We are also looking for someone for the Operations department, must be incredible at organization as the primary duty is to help keep the company and our projects on task and organized in Basecamp + a lot of work to keep the 90+ person company functioning smoothly.<p>Email careers@site5.com with a link to Github for the RoR position, or your resume for the Operations position. \nThanks, Ben","time":1359744941,"type":"comment"},{"by":"shadchnev","id":5152397,"parent":5150834,"text":"LONDON, UK.<p>Arguably the most exciting tech position in London.<p>We are Forward Labs, a startup lab in London. We are 18 guys coming up with new ideas, building prototypes, testing them using lean techniques and forming teams around products that have solid traction. Essentially, we are a well-funded playground. Our goal is to produce 1-2 new businesses a year.<p>We have amazing, driven, entrepreneurial people who have a range of skills, from dev to UX/UI, marketing etc all within the team. Since we are part of a larger company, Forward (www.forward.co.uk), we also benefit from access to their expertise.<p>Please read more about open positions on our website: <a href=\"http://www.forwardlabs.co.uk/careers\" rel=\"nofollow\">http://www.forwardlabs.co.uk/careers</a><p>Email me at evgeny.shadchnev@forward.co.uk for details.","time":1359743133,"type":"comment"},{"by":"martinduncan","id":5154030,"parent":5150834,"text":"San Francisco, CA<p>Voxer has multiple job opportunities for Engineers who are looking for an exciting new career. If you have skills in iOS app development, Hadoop, HBase, Node.js, Web Design or QA Automation, we'd love to talk to you. We're also looking for a Visual Designer, if that's your passion.<p><a href=\"http://voxer.theresumator.com/\" rel=\"nofollow\">http://voxer.theresumator.com/</a><p>Some information about Voxer, and what we're up to!<p>Voxer is more than just a walkie-talkie app, it is one of the most used Push-to-Talk and messaging applications in the world. Voxer iOS and Android apps allow tens of millions of users across the world to communicate instantly. We're making voice and multimedia communication faster, more efficient, and more social. Our goal is ambitious - we're building the next generation communication voice service at the intersection between PTT, phone calls, SMS, conference calls, and multimedia messaging.<p>It's no small feat to achieve, to keep one of the world's fastest growing voice applications humming along and growing at a phenomenal pace. But we are 50 dedicated individuals who are putting some of the most exciting technology in the world to work right now - we are the world's largest Node.js site, and we also run one of the largest Riak clusters in the world.<p>We are dedicated and solely focused on building the next generation of communication. The problems we're facing are at a scale only seen at companies like Twitter and Facebook and we're looking for exceptional people who can help us tackle them.<p>We closed our first outside round of funding last spring, and our brand new offices are right off Market Street in San Francisco. There's tons of restaurants and shopping nearby at Westfield and Union Square to spend your hard earned cash on, and if you're a musician there's a few outside on the street that we wouldn't mind you teaching a few new songs to. There are plenty of MUNI lines right outside, BART is a block away, plus the Ferry to Oakland and Marin is a pleasant fifteen minute stroll or five minute bus ride away.<p>We look forward to hearing from you!","time":1359758825,"type":"comment"},{"by":"peawee","id":5154082,"parent":5150834,"text":"Two Positions: SF, CA, and REMOTE, anywhere<p>SpiderOak is looking for two talented, driven developers to advance our world in the web (the SF position) and on the MacOS platform (the REMOTE position). We're interested in people who want to carve out a world for themselves and who want to be able to make a difference in both the product they build and the organization they're in.<p>MacOS Developer (REMOTE):\n<a href=\"https://spideroak.com/blog/20130201115107-now-hiring-mac-client-engineer\" rel=\"nofollow\">https://spideroak.com/blog/20130201115107-now-hiring-mac-cli...</a><p>Web Developer (SF, CA):\n<a href=\"https://spideroak.com/blog/20130201162523-now-hiring-web-developer\" rel=\"nofollow\">https://spideroak.com/blog/20130201162523-now-hiring-web-dev...</a>","time":1359759259,"type":"comment"},{"by":"kittkat","id":5177701,"parent":5150834,"text":"Boston, MA: Jana wants Interns, Full Stack Developers, Python Developers, Web Developers<p>Jana’s hiring web developers. We recently added Dan O’Brien as VP Engineering and Craig Lancaster as Chief Architect (ex-Zynga Boston’s Director of Engineering and CTO) but we’re still looking for interns and more experienced engineers. Can you help us push the envelope of how the modern web can interact with mobile phones?<p>For more info/to apply: www.jana.com<p>We are:\nJana is a small (15 FT) Boston-based startup that came out of the MIT Media Lab. We focus on people in the developing world.  We help organizations like P&#38;G, Unilever, and the United Nations connect with people in emerging markets like India, Indonesia, Brazil and Nigeria. Jana meets these consumers where they're at, which is often the mobile web on their low-end phone. We work at a global scale: through partnerships with more than 235 mobile operators in more than 100 countries Jana can send airtime rewards to more than 3.48 billion people.<p>We want:\nWe’re hiring software engineers to work on both our back-end and front-end challenges. We are python end-to-end, hosting our servers in Amazon’s cloud. Our challenges tend to be systems-level ones, as we engineer the ability to reliably connect with individuals on the other side of the world.<p>We are looking for people who are passionate about what we are trying to accomplish: making a direct connection to developing world consumers using mobile technology.<p>We offer:\nWe provide a fun, relaxing, productive work environment. Our office is on Boylston Street in Boston’s Back Bay. We offer benefits like 401k, medical and dental and perks like an in office lounge with an Xbox and Wii. We try to accommodate employee wants, be it snacks, beer fridge preferences, game suggestions, kickball league sign up, etc.<p>Apply Directly:\n<i>Full Stack Web Developer <a href=\"http://jobsco.re/Rwi6X6\" rel=\"nofollow\">http://jobsco.re/Rwi6X6</a>\n</i>Python Developer <a href=\"http://jobsco.re/OVBhqL\" rel=\"nofollow\">http://jobsco.re/OVBhqL</a>\n*Web Developer Intern <a href=\"http://jobsco.re/Tqohbj\" rel=\"nofollow\">http://jobsco.re/Tqohbj</a>","time":1360172295,"type":"comment"},{"by":"robmallery","id":5154201,"kids":[5154249],"parent":5150834,"text":"Originate is hiring in SF, LA, NYC, Sunnyvale and Vegas.<p>We're hiring smart people, no seriously, that's the only criteria... oh yeah, and gets stuff done.  Helps if you're cool too :-)<p>Tech stacks are RoR, Scala, Java, Node.JS, iOS and Android.<p>Originate is a unique Venture firm.  We build a startup's software (web and/or mobile) in exchange for equity.  Currently we're 85 people total (60 elite engineers) and 5 offices across the country.<p>Key differentiators:\n-20% of the equity Originate takes in a new venture is shared with the engineers through our \"Innovation Equity Program\".<p>-EIR program to build your own startup or work on Open-Source projects 20% of your time.<p>Send a note on AngelList if interested...<a href=\"https://angel.co/originate\" rel=\"nofollow\">https://angel.co/originate</a>","time":1359760782,"type":"comment"},{"by":"oebs","id":5151627,"parent":5150834,"text":"Berlin, Germany: Adspert (Bidmanagement GmbH) <a href=\"http://www.adspert.de/\" rel=\"nofollow\">http://www.adspert.de/</a><p>We're hiring:<p>* Python developers for both web application as well as backend services development.<p>* Python developers who also like Javascript!<p>We're a small (~7 devs) but pretty competent team working on interesting problems. We got a complex system of several applications and services, which share their data mainly through Postgresql (totalling ~2TB data at the moment, growing every day by a few GB).<p>If you're looking for a nice place to work in the center of Berlin, friendly colleagues and a fun environment, without overtime or weekend work, write to jobs@adspert.de.<p>PS: We already hired someone from the November \"Who is hiring\" (hi Florian! :-) and you can be next!","time":1359735851,"type":"comment"},{"by":"ryporter","id":5151476,"parent":5150834,"text":"AMA Capital -- Palo Alto, CA. Full time. H1B okay.<p>Join us in writing software that trades billions of dollars per day in the foreign exchange market.<p>We are a very small team, all engineers, who design and implement our own trading strategies and infrastructure, down to the networking code that ties us in to financial markets. We will add one or two engineers to our team in the coming months and are looking for people who will focus on strategy or on infrastructure.<p>No experience or specific knowledge of finance is required. However, you do need to be at least interested in financial markets and to be able to implement your strategies carefully in C++.<p><a href=\"http://amacapital.net/careers.html\" rel=\"nofollow\">http://amacapital.net/careers.html</a>","time":1359734701,"type":"comment"},{"by":"zacharydanger","id":5151189,"parent":5150834,"text":"Garland, TX -- 1000bulbs.com - Full Time<p>Job listing and application can be found here: <a href=\"https://github.com/1000Bulbs/dev-app\" rel=\"nofollow\">https://github.com/1000Bulbs/dev-app</a><p>Looking for good developers who might know Rails/PHP to help us sell more light bulbs online.","time":1359732226,"type":"comment"},{"by":"tarlyn","id":5163514,"parent":5150834,"text":"Singapore, Full Time<p>Navagis - Technical Sales<p>Our optimum candidate would be someone coming from Computer Science/Software Engineering who has worked in geospatial technologies, lives in Singapore, wants to join a fast moving startup, and loves being able to present new and disruptive technologies to CIO's and CEO's of various enterprise companies around southeast asia.<p>We are a US based startup working on awesome geospatial products. The job would involve traveling to Indonesia, Philippines, Malaysia, Thailand, and India. Although you will primarily be acting as a sales role, we are looking for someone with a good technical background, they should also understand geospatial technologies.<p>Please contact me at jobs@navagis.com","time":1359976551,"type":"comment"},{"by":"rsingel","id":5154242,"parent":5150834,"text":"Contextly<p>San Francisco, Remote<p>CTO/Late Stage Founder<p>We help publications build loyal audiences with tools that make life better for publishers, writers and readers. We've got revenue, customers and a cool roadmap (<a href=\"http://contextly.com\" rel=\"nofollow\">http://contextly.com</a>).<p>We're looking for someone who can make the right platform decisions, prioritize features and lead a team - while also writing code. You should also think that making online publishing better is something you would be proud to do.<p>There's lots of fun challenges with big data, machine learning, etc, but you don't have to be an expert in any of that. We're looking for someone who is curious, motivated, wants to learn new technologies and gets stuff done.<p>Email ryan contextly com","time":1359761444,"type":"comment"},{"by":"ddispaltro","id":5152779,"parent":5150834,"text":"Come work at Rackspace in the heart of San Francisco (2nd and Folsom), we have 14k sq feet and are expanding to another 14k sq feet within 5 months. We are hiring for many positions, full-time or interns. Rackspace focuses on building big systems to serve builders and are incredibly customer-focused dead set on building useful services that operate at scale.<p>We are looking for the following:<p>* Get stuff done, people that are motivated to make an impact\n* Distributed systems experience\n* Excited to build new stuff\n* Passion for new technology\n* Like working next to Mailgun\n* Interns are welcome, h1b’s are welcome<p>I run the San Francisco office so please ping me directly, daniel.dispaltro@rackspace.com","time":1359746595,"type":"comment"},{"by":"f00biebletch","id":5173809,"parent":5150834,"text":"Palo Alto, Skype<p>We are hiring to help us build massive distributed systems from the ground up on C#/F#/Azure.  We run elastic systems backed by a nosqlish data store, async replication, and, in general, do a lot of async programming.  We are doing devops, building systems to support Skype's amazing user base and move functionality, so our engineers get to do full lifecycle in an agile environment.  It is somewhat like a startup with a lot of money, food, dogs, but we do have a few more managers.  My team is smart, experienced, not risk averse, and in control of their own destiny.  You can't ask for much more than that.<p>Contact f00biebletch at gmail dot com for more great info.","time":1360104385,"type":"comment"},{"by":"drothlis","id":5151716,"kids":[5171210],"parent":5150834,"text":"YouView, London, UK / permanent, full-time, on-site<p>YouView is looking for Test Automation developers. You'll be writing\ntest scripts and working on our test infrastructure, much of which\nwe open-source (e.g. <a href=\"http://stb-tester.com\" rel=\"nofollow\">http://stb-tester.com</a> ).<p>We use a lot of shell &#38; python, and a bit of C; but intelligence, the\nright attitude to automation (automate everything!), programming\nability, and a focus on simple solutions are more important than\nexperience with specific technologies. You could learn a lot about Unix\nhere. Might also suit an experienced Linux sysadmin (with excellent\nshell scripting) looking to do more python programming.","time":1359736389,"type":"comment"},{"by":"tjtrapp","id":5152272,"parent":5150834,"text":"Manhattan Beach, CA<p>Full-time Java Developer<p>Trippy.com is currently building a next-generation travel system.  We are looking to hire a developer who loves to solve problems by writing code.  The ideal person enjoys getting involved in both the server and client code bases.  The basic stack is mongo, java+spring, html5+css+javascript, and obj-c.  You do not need to know all of the technologies we use day-to-day but are required to have a natural curiosity to learn new technologies and be comfortable writing Java.<p>Would you like an opportunity to work with a small, technology-driven team in sunny Southern California?<p>Send your resume and one of the following: github, stackoverflow, linkedin to jobs@trippy.com.","time":1359741847,"type":"comment"},{"by":"arram","id":5152137,"parent":5150834,"text":"ZeroCater (YC W11), San Francisco, New York\nWe help companies build great cultures through shared meals.\nWe're hiring:<p>- Senior developers<p>- Sales people<p>- Account Managers<p>- Operations Specialists<p><a href=\"http://www.zerocater.com/jobs/\" rel=\"nofollow\">http://www.zerocater.com/jobs/</a>\nContact us: jobs [at] zerocater.com","time":1359740470,"type":"comment"},{"by":"timanglade","id":5151944,"parent":5150834,"text":"Apigee (Palo Alto, REMOTE from within US, H1B) — Developer Advocates, Java Developers, Mobile Developers.<p>Apigee is dedicated to powering the API &#38; Mobile revolutions. We are helping thousands of developers build API-driven infrastructure and mobile apps every day. Our technology is used at Gilt, Getty Images, Tout, Walgreens, OnStar, eBay, GameSpy, Citrix, AT&#38;T, Pearson, ConstantContact, Best Buy, Dell, Comcast and hundreds of others. One of the latest cool uses of our technology is <a href=\"https://baas.io\" rel=\"nofollow\">https://baas.io</a> a backend-as-a-service platform in Korea.<p>We offer catered lunches, full health/dental/life/401k, above-market salaries, options, unlimited vacation and flexible hours.<p>We are actively hiring for App Services (our Mobile Backend-as-a-Service technology). Our stack is fully open-source (<a href=\"https://github.com/apigee/usergrid-stack\" rel=\"nofollow\">https://github.com/apigee/usergrid-stack</a>) and our hosted service is currently in open Beta. We are built on top of Jersey, Jackson and Cassandra.<p>Our newest open position is Developer Advocate. Our developer advocates partner up with indie developers &#38; startups to ensure they have a successful launch on our platform; meet people from all walks of life from around the world and help them build apps and APIs; bring feedback from the trenches to the product. This is not solutions architecture or community bootstrapping. This is about helping our existing, vibrant community of indie developers into being even more successful than they already are without our help :)<p>We are also looking for Java Developers to join our Core team and help us overcome the next-generation technical challenges, from Websockets to multi-DC, log routing and beyond! Not much is required except familiarity with at least one NOSQL database, a good understanding of the Spring framework, and solid experience in having fun.<p>Finally, we are looking for Mobile developers with at least 1 year experience in one of iOS, Android or JavaScript+HTML5 development to work on our SDKs and a range of exciting mobile apps.<p>Want to apply? Have some questions? Want to join but don’t match either position? Then get in touch! ➝ tim@apigee.com","time":1359738675,"type":"comment"},{"by":"markhelo","id":5152492,"parent":5150834,"text":"Wello - San Francisco, CA (INTERN, H1B)<p>We are looking for engineers who are interested in the health and fitness space. If you are a generalist who wants to solve different problems as they show up and learn and grow with us, consider us.<p>We connect users with fitness experts using live 2-way video. We are a fitness marketplace. Not only do we connect people with experts, but they also do the workout over video using their browser. Our users have spent 20K cumulative minutes exercising using our platform and making themselves healthier in just a few months since we have launched.<p>We are seed funded and part of the latest batch of Rock Health companies.<p>Email: dev at wello dot co<p>www.wello.co","time":1359743978,"type":"comment"},{"by":"natehark","id":5152617,"parent":5150834,"text":"Optify (<a href=\"http://www.optify.net\" rel=\"nofollow\">http://www.optify.net</a>) - Seattle WA<p>We're hiring full-stack engineers with Java or .Net experience to help us expand and grow our marketing automation platform for digital marketing agencies.<p>Optify is solving big-data problems using a variety of open-source technologies including PostgreSQL and ElasticSearch, while presenting simple, actionable and insightful results to our customers via our rich web application.<p>For more information: <a href=\"http://www.optify.net/about-our-b2b-inbound-marketing-solutions/careers\" rel=\"nofollow\">http://www.optify.net/about-our-b2b-inbound-marketing-soluti...</a>","time":1359745197,"type":"comment"},{"by":"stevewilhelm","id":5151442,"parent":5150834,"text":"Euclid, San Francisco, CA - Full Stack Web Developer<p>Euclid helps physical retailers understand their customers better. Our data analytics platform is leveling the playing field for brick and mortar retailers by providing them with the data and analytical tools to assess and re-shape their business.<p>Experience building scalable production web applications from database to front-end using Ruby on Rails, Ember.js, Amazon Web Services, and deploying with Github and Heroku perferred.<p>Contact darrin@euclidanalytics.com or see <a href=\"http://euclidanalytics.com/about/careers\" rel=\"nofollow\">http://euclidanalytics.com/about/careers</a> for details.","time":1359734323,"type":"comment"},{"by":"brianmwang","id":5151794,"parent":5150834,"text":"New York, NY - Fitocracy (<a href=\"http://fitocracy.com\" rel=\"nofollow\">http://fitocracy.com</a>)<p>Web Developer<p>We are looking for exceptional software developers to help us take Fitocracy to the next level. Our team is solving really tough problems all set behind an awesome user experience that needs to scale to millions of users. You must kick ass at Python, Django, and Javascript as well as be biased toward shipping code and product. Since we are a small team, you will work not only on product development but pretty much any other challenge we can throw your way.<p>We are offering a competitive salary and equity ownership. This is for a full time position in New York. And yes, we will help you relocate to the best city on Earth :)<p>What You'll Be Doing\n- Work closely with the rest of the Fitocracy team and deliver new features using Python, Django, and Javascript\n- Help manage the servers and services we use: AWS, Linux, MySQL, nginx, uwsgi, redis, git, and Celery \n- Communicate constantly with both the team and the Fitocracy community \n- Track user feedback and continuously iterate on it \n- Test, release, and maintain your code \n- Make sure the user experience is consistently awesome<p>We especially want to talk to you if...\n- You have any experience with machine learning\n- You're strong in statistical analysis and/or AB testing<p>About Us\nFitocracy is a social network that empowers everyone to reach their next level of fitness. Nearly  a million people use our web and mobile apps to track their progress, compete against their friends, and get real world results. We are building a world where fitness is possible for everyone. Enough of the useless crap that's polluting the market these days. We're setting out to change everything.\nWe are an 8 person team based out of NYC that recently raised money from a variety of VCs and angels, including 500 Startups, Eniac Ventures, folks from Zynga/Google/Greylock. The founders, having gone through significant fitness transformations in their own personal lives, originally started Fitocracy in late 2010 as a way to marry their love of fitness with their years growing up playing classic role playing games like Final Fantasy and Everquest.<p>Contact\nEmail me at brian@fitocracy.com","time":1359737210,"type":"comment"},{"by":"BrandonSmith","id":5155069,"parent":5150834,"text":"Raleigh, NC - Republic Wireless / republicwireless.com / @republicwirelss<p>Republic Wireless is a division of Bandwidth.com and we are changing mobile communications forever. We are always looking for all-around athletes. Right now we are actively searching for:<p><pre><code>  +----------------------+\n  | Dev Ops              |\n  | Front-end Developers |\n  | Android Developers   |\n  | Software Testers     |\n  +----------------------+\n</code></pre>\n<i>Erlang, Android, iOS, HTML5, JS, Dev Ops, Java</i><p>Check out a recent NY Times article... <a href=\"http://bit.ly/rw-on-nytimes\" rel=\"nofollow\">http://bit.ly/rw-on-nytimes</a><p>Inquire at hackernews@bandwidth.com","time":1359776842,"type":"comment"},{"by":"goronbjorn","id":5152104,"parent":5150834,"text":"Los Altos, CA<p>Box (Box.com), specifically platform: developers.box.com, box.com/platform<p>You can find all of our recent awesome news here: <a href=\"http://www.crunchbase.com/company/box\" rel=\"nofollow\">http://www.crunchbase.com/company/box</a><p>Platform Engineer:<p>You'll be building and designing APIs on the Box platform from front to back as well as developer-facing tools such as SDKs. Box is an enterprise software company, but we build and design our APIs to be on par with the <i>best</i> APIs out there e.g. Twilio, Stripe, etc (you can see our documentation here: developers.box.com/docs).<p>All experience levels are welcome to apply.<p>If interested, please contact me directly: sean@box.com","time":1359740126,"type":"comment"},{"by":"kyleslattery","id":5151452,"parent":5150834,"text":"Artisan (<a href=\"http://useartisan.com\" rel=\"nofollow\">http://useartisan.com</a>)<p>Philadelphia, PA - Full-time<p>We're building tools to help companies unleash the full power of their apps, the first of which is \"Optimize\", allowing our customers to A/B test native iOS apps, without changing any code.<p>If you love mobile, we have no shortage of interesting problems to solve, and we're in a really cool office in the heart of Old City.<p>We have positions for iOS, Rails, and Android developers, as well as Dev/Ops and QA. Check out our jobs page (<a href=\"http://useartisan.com/jobs/\" rel=\"nofollow\">http://useartisan.com/jobs/</a>) for more info.","time":1359734469,"type":"comment"},{"by":"ryanb","id":5152432,"parent":5150834,"text":"Tutorspree (YC W11) is hiring Web Engineers in New York, NY. (Tribeca)<p>+ Our web stack uses Python/Flask/postgres/nginx.\n+ Competitive salary + stock options.\n+ Live in New York!<p>Please reach out to me directly if interested - ryan@tutorspree.com","time":1359743397,"type":"comment"},{"by":"Brandrew","id":5169031,"parent":5150834,"text":"Share Practice: Founder's Den San Francisco, iOS dev<p>Share Practice is the first social clinical reference tool for doctors. We're figuring out everything that doctors know about every disease, and making that info available to everyone. We're Founded by a doctor at <a href=\"http://carepractice.com\" rel=\"nofollow\">http://carepractice.com</a>, funded by Founders Fund, and worked by really super cool Burners. We need an iOS rockstar who wants to join our team, kick some ass, and change the world.<p><a href=\"http://sharepractice.com\" rel=\"nofollow\">http://sharepractice.com</a>\nEmail in profile","time":1360038014,"type":"comment"},{"by":"mbtmbt","id":5151089,"parent":5150834,"text":"Revel Touch (Palo Alto, CA), full-time engineers, especially HTML5/Javascript engineers<p>We are a well-fonded series B startup, building a mobile e-commerce platform.  As a B2B2C SaaS company we have real customers and real revenue.  Our market - mobile e-commerce - is red hot.  Our beautiful apps built for iPad are regularly promoted by Apple.  We are now adapting our platform to building sophisticated HTML5 apps, both for mobile and desktop.  Come join us!<p>All positions are listed at <a href=\"http://www.reveltouch.com/careers.html\" rel=\"nofollow\">http://www.reveltouch.com/careers.html</a>","time":1359731342,"type":"comment"},{"by":"jonty","id":5151904,"parent":5150834,"text":"London, UK - Permanent, full time, on-site.<p>Lumi - <a href=\"https://lumi.do\" rel=\"nofollow\">https://lumi.do</a><p>We're looking for recommendation engineers, backend developers, search specialists, and operations people capable of writing code. Our stack is mostly Python, with occasional diversions into Java and C. We'd like you to know a bit of everything and a lot of something.<p>You'd be joining an East London based ten-person team. We've been working together for about a year, and have plans to expand rapidly in the near future.<p>Either launch a CV at hello@lumi.do, or drop me a line personally if you'd like to chat first.","time":1359738289,"type":"comment"},{"by":"amduser29","id":5153160,"parent":5150834,"text":"SF / Mobile Engineer / Android / iOS / Windows 8<p>Part location, part communication, all awesome. Life360 keeps millions of families connected, no matter what chaos life throws their way. With over 27 million registered users, Life360 is the biggest family network in mobile and one of the fastest growing geolocation apps on the market. Our platform spans across iOS, Android, Blackberry, along with a growing web presence.  We are looking for awesome mobile engineers to help take our app to the next level as well as expand into connected car and connected home.<p>Contact: alex@life360.com","time":1359749686,"type":"comment"},{"by":"eliekh","id":5157870,"parent":5150834,"text":"Heart of San Francisco, CA<p>We're hiring a Senior Back-End Developer / System Architect for a leading position at Woopra, a leading Customer Analytics business with more than 3000 paying customers. You will be a key decision maker when it comes to system architecture and you'll be working directly with the founders.<p>Applicant must have experience in:<p>+ High Scalability, Performance &#38; Availability<p>+ Java<p>+ NoSQL<p>+ Open Standards and API design<p>+ Real-time Data<p>+ Working in startup environments<p>If you're interested in growing with Woopra and take a leadership role in our company, drop us a line at careers@woopra.com<p>PS: we're 300 feet from the Caltrain station<p>Link: <a href=\"http://www.woopra.com\" rel=\"nofollow\">http://www.woopra.com</a>","time":1359849264,"type":"comment"},{"by":"nixy","id":5150923,"parent":5150834,"text":"Palo Alto, CA<p>Software/Mobile Engineer at Accedo.tv<p>We are seeking an Junior Mobile Developer to be an integral member of our development team. The ideal candidate will be proficient with application development in Smartphone / tablet space and web development (web 2.0 / rich frontends). Provide expert knowledge and guidance on multiple mobile initiatives. Ensure that the development effort adheres to SDLC process. Give input to Mobile Solutions. The candidate will also be able to work on multiple projects, be equally comfortable jumping into existing applications and pushing out a large volume of high quality code in a fast-paced, highly iterative environment. The ability and willingness to pick up new technologies quickly is essential. This is your opportunity to design and develop applications for some premium media companies and gain experience of working across multiple platforms and multiple audience needs.<p>Ideal candidate will have the following-<p><pre><code>  BS/MS CS/CE or equivalent experience\n  Exp w/iOS SDK and Objective-C\n  Exp w/Android or Google Web Kit front-end a plus\n  Exp development and using Web Services using contract-first techniques.\n  Demonstrated experience with object oriented software design and development (in PHP/Java).\n  Good knowledge of software engineering life cycle process including design, development, build/release and QA.\n  Basic understanding of source code control procedures and environments (git, subversion, Jira).\n  Basic knowledge of Internet Application architectures and Protocols (TCP/IP, HTTP, etc.).\n  Experience in creating user interfaces from design concepts \n</code></pre>\nThis is a contract to hire/ full time and on-site position located in our Palo Alto office. Salary commensurate with experience. Please contact back with your resume and cover letter.<p>About Accedo: Accedo is the leading enabler of Smart TV and IPTV applications. Accedo provides platforms, applications, tools and services to media companies, platform and CE companies and TV operators globally, to help them deliver the next-generation TV experience. Accedo's cloud-based platform solutions enable customers to cost-efficiently roll out and manage application offerings and stores for multiple devices and markets.<p>nik at accedo dot tv (Please put HN in the subject line)","time":1359729957,"type":"comment"},{"by":"asanwal","id":5151057,"parent":5150834,"text":"CB Insights - New York, NY (Full-time, intern, H1B)<p>NSF backed data company recently recognized as one of NYC's top emerging enterprise companies. We are generating revenues/profits, have taken no dilutive external financing, are solving hard problems, and have a great team.<p>Hiring page here - <a href=\"http://www.cbinsights.com/jobs/\" rel=\"nofollow\">http://www.cbinsights.com/jobs/</a><p>Looking for\n- inside sales (not yet posted on page)\n- full stack developer\n- product adoption manager\n- tech industry analyst\n- machine learning engineer<p>Reach out directly to me (email in profile) or to careers@cbinsights.com","time":1359731050,"type":"comment"},{"by":"chunsaker","id":5154434,"parent":5150834,"text":"Stormpath (San Mateo, CA)<p>Stormpath is an easy, secure user management and authentication service for developers. We're looking for \n- Core Java developers\n- Front-end engineers\n- DevOps \n- Developer Advocates<p>It's a bonus if you love security, if password breaches make you angry, and if want to help developers get busy with API-based architecture. The team is smart, fun and friendly, and we've got some great announcements coming up.<p>Check out the jobs page at <a href=\"http://www.stormpath.com/\" rel=\"nofollow\">http://www.stormpath.com/</a> or email your jobs@stormpath.com","time":1359764369,"type":"comment"},{"by":"error54","id":5151750,"parent":5150834,"text":"Atlanta,GA or Valdosta,GA - Full Time<p>Fast growing health care IT company<p>Web Developer<p>Fun but fast paced environment with plenty of opportunity to make a name for yourself.<p>Requirements\n-Bachelor’s degree in Computer Science or related field, or equivalent experience<p>-Strong knowledge of Javascript, PHP, HTML, CSS, and MySQL<p>-Fundamental understanding of website architecture and software design patterns<p>-Experience in versioning control<p>-Ability to work in multi-platformed environment (Windows, Linux, MacOS)<p>-Excellent oral and written communication skills<p>-Knowledge of the healthcare industry is a huge plus<p>Apply online: <a href=\"http://bit.ly/YoLdwQ\" rel=\"nofollow\">http://bit.ly/YoLdwQ</a>","time":1359736702,"type":"comment"},{"by":"wldlyinaccurate","id":5152312,"kids":[5155621],"parent":5150834,"text":"London, UK<p>IPC Media is the UK's leading magazine and digital publisher. We're currently hiring DevOps, PHP (preferably Symfony) developers and front-end developers.<p>Lately we've been doing a bunch of fun stuff:\n- Reducing page load times across our sites\n- Implementing a continuous integration system\n- Switching to Git and embracing a better workflow with GitHub Enterprise\n- Building a new platform to serve our mobile sites<p>If you want to know more about the positions or about the day-to-day work, hit me up: \"joseph_wynn\" at ipcmedia.com.","time":1359742197,"type":"comment"},{"by":"ComputerGuru","id":5153341,"parent":5150834,"text":"NeoSmart Technologies (<a href=\"http://neosmart.net/\" rel=\"nofollow\">http://neosmart.net/</a> and <a href=\"http://systemdiscs.com\" rel=\"nofollow\">http://systemdiscs.com</a>)<p>Chicago (REMOTE)<p>Looking for business development and marketing specialist to help our small but very profitable startup enter new markets and establish new connections with large corporations, computer repair chains, resellers, and affiliates for our very powerful and very popular system recovery and repair products and utilities.<p>Email us at neosmart@neosmart.net","time":1359751237,"type":"comment"},{"by":"stephenhuey","id":5153043,"parent":5150834,"text":"HealthPost - Houston, TX - Ruby on Rails<p>We're currently serving hospitals around the country and need full stack developers to come help us continue building new products.  Join now and you'll be on a small team, but this year we're skyrocketing in size and scope, which means your contributions will enhance healthcare for more and more people.  Generous pay, vacation, flexibility and other benefits to ensure you are refreshed enough to deliver your most creative work!  Write me via my profile.","time":1359748639,"type":"comment"},{"by":"jack7890","id":5151061,"parent":5150834,"text":"SeatGeek -- New York, NY -- Full Time<p>We're a search engine for tickets and live events.<p>Android Developer -- Live event apps are where photo sharing apps were four years ago.  We're looking for someone to define the live event experience on Android: <a href=\"http://seatgeek.com/jobs/android_developer/\" rel=\"nofollow\">http://seatgeek.com/jobs/android_developer/</a><p>Designer Who Can Code -- I know, such people aren't lining up at the Unemployment Office.  But if you fit that description, drop me a line at jack [at] seatgeek.com","time":1359731073,"type":"comment"},{"by":"megakwood","id":5152127,"parent":5150834,"text":"Guidebook is hiring Python+Django, Android, iOS Developers, and Designers FULLTIME in Palo Alto, CA and San Francisco, CA.\nGuidebook makes a mobile app that helps people find their way around complex venues and events. You may have used our app at a show like PyCon, PAX, UDC, etc. We're also now beginning to publish guides for places like Universities, museums, community centers, etc.<p><a href=\"http://guidebook.com/jobs/\" rel=\"nofollow\">http://guidebook.com/jobs/</a><p>More contact info for me is in my profile.","time":1359740377,"type":"comment"},{"by":"jfilleti1","id":5153490,"parent":5150834,"text":"Care.com, Waltham, MA   www.care.com<p>We are looking for individuals with experience designing and developing native and hybrid applications for Android devices. Experience with software development for J2EE platform is a plus. You should also have experience using web services, XML, REST, AJAX and other integration technologies.<p><a href=\"http://www.care.com/careers-p1089.html#SeniororPrincipalSoftwareEngineerMobileAndroid\" rel=\"nofollow\">http://www.care.com/careers-p1089.html#SeniororPrincipalSoft...</a>","time":1359752796,"type":"comment"},{"by":"paulaminc","id":5150937,"parent":5150834,"text":"BOSTON, MA - @RiparianData - Full Time<p>Riparian Data is a small, Boston based startup devoted to building a better mobile email app for today's overloaded office workers.<p>We're running a Meteor stack on top of Node.js, with straight Ruby for services on the back end. This is all supported by a Mongo database.<p>Hiring:  Product Owner and Software Engineer\nMore details:  <a href=\"http://www.ripariandata.com/jobs/\" rel=\"nofollow\">http://www.ripariandata.com/jobs/</a>\nemail us:  hr@ripariandata.com","time":1359730044,"type":"comment"},{"by":"styloot","id":5155656,"parent":5150834,"text":"Pune, India - Fulltime.<p>Co-Founder of Styloot.com here.<p>Styloot.com, is a visual search engine for fashion. At 700,000 skus and 4000+ brands, we carry slightly more women apparel than Amazon and twice as many shoes as Zappos.<p>We are looking to hire Python and Javascript developers.<p>You will be working directly with the product and will be making decisions that directly influence the site.<p>You must love coding - everything else we can work around.<p>You must have a github repo that you are proud of. Email us if interested - jobs at styloot.com.","time":1359799355,"type":"comment"},{"by":"steilpass","id":5152277,"parent":5150834,"text":"Agile Software Developers in Cologne, Germany.<p>Although we've been bought we still feel and work like a startup. We are looking for great developers with a web background. We believe in modern engineering practices, agile environment, the right tools for the right job and fun at work. If you want to work with lots of data in a self organizing way give me a call.<p>More information at <a href=\"http://dev.adcloud.com\" rel=\"nofollow\">http://dev.adcloud.com</a>","time":1359741885,"type":"comment"},{"by":"mbleigh","id":5153386,"parent":5150834,"text":"Divshot (<a href=\"http://divshot.com/\" rel=\"nofollow\">http://divshot.com/</a>)<p>Los Angeles, CA (or remote)<p>We're building tools to make web development fitter, happier, and more productive and we're looking to hire full-stack and front-end web engineers.<p>If you love working with bleeding-edge browser technologies, shipping open source, attending hackathons, and lots and lots of JavaScript (Ruby too? Bonus!) let us know!<p>jobs@divshot.com<p>H1B, REMOTE, and INTERN positions available for the right candidates.","time":1359751820,"type":"comment"},{"by":"jasonmoo","id":5151876,"parent":5150834,"text":"Vimeo – NY, NY (Chelsea)<p>Check out all our jobs: www.vimeo.com/jobs<p><pre><code>    * PHP Engineers (full-stack &#38; backend)\n    * Sr iOS Engineer\n    * Site Reliability Engineer\n    * MySQL DBA\n    * Statistician\n    * Web Analyst Manager\n    * Digital Project Manager\n</code></pre>\nStuff we use: PHP, Python, MySQL, Mongo, Redis, AWS, Solr, Hadoop, nginx, node, Vertica. And pretty much any mobile platform.<p>Feel free to email our Tech Recruiter, tyler at vimeo dot com.","time":1359738050,"type":"comment"},{"by":"nmueller","id":5152276,"parent":5150834,"text":"Nearbuy Systems, Redwood City, CA<p>Nearbuy helps brick and mortar retailers understand what's happening inside their stores.  Our team is small but growing fast and we're hiring full-stack and front-end engineers.  If you're interested in problems like big data processing or data visualization, or like working with technologies like Ruby, Node.js, Ember and Cassandra, drop me a line at nate@nearbuysystems.com.","time":1359741866,"type":"comment"},{"by":"geofft","id":5152315,"parent":5150834,"text":"MokaFive - Redwood City, CA (between San Francisco and Palo Alto), interns (specifically college students looking for summer internships) and H1Bs welcome<p>MokaFive makes life easier for large corporate IT departments who have too many computers to manage, and life better for end-users who would otherwise have to deal with a corporate IT department that's enforcing ridiculously restrictive policies for their own sanity. Our primary product, MokaFive Player, delivers you a VM image of a corporate system that you can run on your own computer (Windows or Mac). You can install whatever software you want, and we automatically split new files into \"layers\", so IT can push a new base layer that takes effect as soon as you reboot, and you can press a button and wipe all locally-installed software including IE toolbars and other nonsense, but keep IT-provided software and non-application files like documents. Since it's running locally, you can get work done offline (unlike Citrix, VMware View, etc.), and not hate your life if you're not on the LAN. There's a bunch of security stuff like full disk encryption and so forth.<p>I'm specifically looking for coworkers on my team, which works on experimental / future products. One product that's been seeing lots of growth is MokaFive BareMetal, a stripped-down Ubuntu derivative that boots directly into MokaFive Player. By providing our usual management capabilities on an underlying OS you don't have to think about, you get the benefits of our product (easier updates, layering, single image, etc.) on corporate-owned hardware. We're also doing some work with MokaFive for iOS to allow you to remotely access files on your desktop from your mobile device, and doing some work with remote filesystems as an outgrowth of that.<p>We're not per se a virtualization company: we don't write the hypervisor, since other people already do a great job of that. We do write a lot of things just above and just below the hypervisor layer, and in general a lot of computer systems work. If you enjoy operating systems / virtualization, come talk to us. Our core product is in C++; there is also a fair amount of open source work to be done in various languages, and we try to be good citizens and work with upstream. (If you're interested in making 2013 the year of Linux on the desktop, helping Windows shops continue to use Windows as a desktop but use Linux for drivers is an oddly great way to help bring that about -- we regularly work to improve Linux's hardware compatibility, since we have customers wanting to use a wide range of machines.)<p>See mokafive.com for more info, and send me an email (gthomas at that domain name) if you're interested!<p>I'll be in Cambridge and Pittsburgh next week for the MIT and CMU career fairs, with time to chat with interested folks in those two cities.","time":1359742210,"type":"comment"},{"by":"lukas","id":5154698,"parent":5150834,"text":"We're hiring at CrowdFlower!  Lots of positions but I especially like the \"Everything Web Engineer Extraordinaire\" position <a href=\"http://www.jobscore.com/jobs/crowdflower/everything-web-engineer-extraordinaire-ewee/coC2uazYOr4OrriGakhP3Q?ref=rss&#38;sid=68\" rel=\"nofollow\">http://www.jobscore.com/jobs/crowdflower/everything-web-engi...</a><p>Intern, Remote, H1B all fine.<p>Ask about our unlimited Otter Pop policy.","time":1359768599,"type":"comment"},{"by":"measlyweasel","id":5177608,"parent":5150834,"text":"CARFAX, Columbia, MO (no remotes)<p>CARFAX provides trusted information that helps millions of people buy and sell used cars with more confidence. At CARFAX, we’re at our best when we’re growing, and we believe the same is true of the people who work here. That’s why we invest in the growth of our employees and offer rewarding, creative, fast-paced work, as well as many other opportunities to challenge you.<p>Why you want to work for Carfax:\n- Your high energy, entrepreneurial spirit will be appreciated<p>- You work well in an environment that is chaotic at times<p>- Team dynamics are important to you<p>- You are comfortable being yourself at work<p>- You thoroughly know and have created useful projects in a high-level language such as Java, Groovy, Ruby or Python<p>- You particularly like technologies whose names start with 'G' ( our main stack involves Groovy, Gradle, Grails and Git)<p>- You've got a solid knowledge of at least a few of the following: HTML5, CSS3, Javascript/CoffeScript/jQuery, Web Standards, MVC architectures, RESTful/Service Oriented Architectures, Spring, Oracle, Mongo, RabbitMQ, Continuous Integration, TDD.<p>- We love messing with the latest and greatest technologies and will send you to conferences/training to find out more about the state of the art<p>- We promote a teaching environment even when it requires us to slow down<p>- Personal Dev time every Friday afternoon, work on your own projects, many devs here own/run productive side projects<p>- Agile/XP flows through our veins, we are meta about this probably to a fault. We pair program, use TDD, and we frequently review agile concepts and their application to our work flow<p>- Comfortable work/life balance, excellent benefits, competitive salary and bonus program<p>- We like to have FUN at work -- lots of events and team building (zombie paintball, annual paper airplane contest, musical chairs competitions for extra vacation days, theme dinners, SWAG, parties, the list goes on and on...)<p>We want developers that are comfortable learning new technologies and really diving deep into optimizing our existing stack. If you can be a top notch contributor on our team then please apply at <a href=\"http://jobvite.com/m?3YUpHfwI\" rel=\"nofollow\">http://jobvite.com/m?3YUpHfwI</a> and we'll get back to you as fast as we can","time":1360171304,"type":"comment"},{"by":"devinfoley","id":5150950,"parent":5150834,"text":"San Francisco, CA - IFTTT<p>Hiring for multiple positions in engineering (including interns) and business development.<p>IFTTT is changing the way people make connections between the services and devices they use every day. We are an ambitious bunch seeking adventurous, creative, and hardworking people to join us in building a revolutionary product.<p><a href=\"http://ifttt.com/jobs\" rel=\"nofollow\">http://ifttt.com/jobs</a>","time":1359730155,"type":"comment"},{"by":"zackbloom","id":5152202,"parent":5150834,"text":"Hubspot (Boston) is always hiring great engineers: <a href=\"http://dev.hubspot.com/\" rel=\"nofollow\">http://dev.hubspot.com/</a>","time":1359741104,"type":"comment"},{"by":"nwilkens","id":5155129,"parent":5150834,"text":"MNX Solutions - Monroe, MI -- Full time, onsite or remote.<p>We provide Linux server monitoring, management and consulting services to a wide range of companies.<p>We are looking for a Linux server admin to join our growing team.<p>Check out our jobs page, and shoot me an email if interested:<p><a href=\"http://www.mnxsolutions.com/jobs\" rel=\"nofollow\">http://www.mnxsolutions.com/jobs</a>\nnick.wilkens@mnxsolutions.com","time":1359778499,"type":"comment"},{"by":"davefp","id":5151177,"parent":5150834,"text":"OTTAWA, ON, CANADA. Full-time and INTERNships.<p>Shopify<p>Shopify is the easiest way to start selling online.<p>Here are some milestones we hit in 2012:<p>* $1,000,000,000 Merchant GMV<p>* 40,000 Merchants selling on Shopify<p>* 100% YoY increase in team size, merchant count, and revenue<p>We're a Ruby on Rails shop with strong mobile and javascript teams. The perks aren't half bad either.<p>More info here:\n<a href=\"http://shopify.com/careers\" rel=\"nofollow\">http://shopify.com/careers</a>","time":1359732175,"type":"comment"},{"by":"JaretManuel","id":5152767,"parent":5150834,"text":"Bloomington, Indiana Remote Possible \nFormAssembly\nVeerWest (Dba. FormAssembly.com) is seeking an awesome system administrator. LAMP (Linux Chef). We are also seeking a customer support representative and an intern position. We're 200 users strong and we integrate very nicely with Salesforce. www.veerwest.com/jobs","time":1359746406,"type":"comment"},{"by":"bennjammin","id":5153796,"parent":5150834,"text":"Voleon Capital Management - Berkeley, CA - full-time<p>We're a statistical arbitrage hedge fund startup looking for Linux Systems Administrator / Architect to join our team.<p>Job listing is <a href=\"http://voleon.com/Linux-Systems-Administrator.v2.pdf\" rel=\"nofollow\">http://voleon.com/Linux-Systems-Administrator.v2.pdf</a>.<p>Interested?  Email working@voleon.com","time":1359756221,"type":"comment"},{"by":"mbrzusto","id":5151053,"parent":5150834,"text":"Kontagent\nKontagent.com/why/careers<p>We are hiring scientists, engineers, interns, marketing, sales ... at both downtown San Francisco and downtown Toronto locations.<p>DATA SCIENCE\nR&#38;D Data Scientist/Engineer\tSan Francisco, United States<p>ENGINEERING\nEngineering Manager - Application Development\tSan Francisco, United States\nIntegration Engineer\tToronto, Canada\nLead Data Quality Analyst\tSan Francisco, United States\nLead Engineer\tSan Francisco, United States\nPost Sales Engineer\tToronto, Canada\nSenior Software Engineer - Application Development\tSan Francisco, United States\nSenior Software Engineer – Data Store Team\tSan Francisco, United States\nSoftware Engineer II - Application Development\tSan Francisco, United States\nTechnical Lead - Application Development\tSan Francisco, United States<p>MARKETING\nArt Director\tSan Francisco, United States<p>PRODUCT MANAGEMENT\nTechnical Project Manager\tSan Francisco, United States<p>PROFESSIONAL SERVICES\nCustomer Insights Analyst\tSan Francisco, United States<p>SALES\nBusiness Development Representative\tSan Francisco, United States\nDirector of Channel and Business Development\tSan Francisco, United States\nEMEA Corporate Account Manager\tLondon, United Kingdom\nField Sales Executive\tSan Francisco, United States\nSales Engineer\tSan Francisco, United States\nSales Training Manager\tSan Francisco, United States\nSenior Sales Engineer\tSan Francisco, United States<p>UNIVERSITY RECRUITING\nData Science Intern\tSan Francisco &#38; Toronto, United States\nIntegration Engineer\tToronto, Canada\nSales Associate Intern- Summer 2013\tSan Francisco, United States\nSoftware Engineer\tSan Francisco, United States\nStatistician Intern\tSan Francisco &#38; Toronto, United States","time":1359730981,"type":"comment"},{"by":"philbo","id":5150860,"kids":[5153204],"parent":5150834,"text":"BIZZBY ~ LONDON, UK ~ FULL TIME<p>Bizzby is a well-funded startup preparing to revolutionize the economy. We are a team of talented, highly-motivated developers and designers based in Shoreditch, working hard to deliver jaw-dropping software within the next few months. There are two vacant positions that we'd love to fill. Come and be extraordinary with us!<p>* Back-end developer (Node.js, CoffeeScript, MongoDB)<p>You should have a deep understanding of the principles of good object oriented software design and prefer writing code test-driven out of choice. Experience with CoffeeScript is not essential but knowledge of JavaScript and a passion for learning is.<p>* QA engineer (iOS, Android, mobile web)<p>You should come with a strategy for test automation across a wide range of devices and operating systems, backed by the technical chops and experience to put your plans into practice. We want you to break our stuff then help us to make it better!<p>The salary for both positions is above market rates for the right candidate and comes with gym membership, iPhone and more Mac equipment than you can shake a stick at.<p>If this sounds like your cup of tea, send your CV to phil@bizzby.com - no remote workers or agencies please.","time":1359729416,"type":"comment"},{"by":"0xa","id":5151819,"kids":[5155457],"parent":5150834,"text":"Tumblr, New York, NY (NYC, Manhattan): FULL TIME and INTERN Software Engineers (Scala, Java), PHP Developers, and Site Reliability Engineers (Linux, Nginx, HBase, HAProxy, Memcached, and OpenTSDB).<p>TL;DR: Tumblr is actively hiring engineers at every layer of our technology stack. <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a><p>We have interesting projects for people with a knack for software design, a nose for efficiency, and a passion for massive scale and visibility. I'll highlight a few positions here, but you can see an awesome photo of Tommy the Pomeranian with Mayor Bloomberg, our great benefits, and the complete listing of open positions at <a href=\"http://tumblr.com/jobs\" rel=\"nofollow\">http://tumblr.com/jobs</a>.<p>Happy ground hog day,<p>Matt, Director of Engineering<p>* Software Engineer--Distributed Services (<a href=\"http://bit.ly/QWZC0p\" rel=\"nofollow\">http://bit.ly/QWZC0p</a>): Writing generic, reusable services in Scala, you will design, create and grow a blazingly fast platform for our PHP application. Being a productive coder with architecture common sense is a must, but expertise in Java or JVM tuning is a plus.<p>* Front End/PHP Engineer (<a href=\"http://bit.ly/ToF7Ya\" rel=\"nofollow\">http://bit.ly/ToF7Ya</a>): You are a versed engineer and perfectionist with good taste, ready to take ownership of entire features of our PHP application.<p>* Site Reliability Engineer (<a href=\"http://bit.ly/12fx0XP\" rel=\"nofollow\">http://bit.ly/12fx0XP</a>): As a software developer with a love of highly performant, fault-tolerant, massively distributed systems, you will make Tumblr faster, more reliable and highly available for hundreds of millions of visitors.<p>* Engineering Summer Intern (<a href=\"http://bit.ly/XcFl71\" rel=\"nofollow\">http://bit.ly/XcFl71</a>): You will be putting code into production. You will be integrated into a small engineering team working on a real-world project.  We have a total of 10 openings across all our engineering teams.<p>About Tumblr (<a href=\"http://www.tumblr.com/about\" rel=\"nofollow\">http://www.tumblr.com/about</a>)<p>Founded by David Karp in New York City in 2007, Tumblr empowers millions of users to create and explore content. Tumblr now hosts more than 92 million blogs and 42 billion posts. We work in an open, friendly and positive environment that encourages intellectual curiosity and a love for open source. As engineers, we are focused on building technologies that advance massively scaled websites. We are also excited to deliver a range of new products that will enable users to share their own creative content, discover content, and connect to one another in new ways.","time":1359737495,"type":"comment"},{"by":"cleverbaker","id":5152553,"parent":5150834,"text":"REMOTE Front-end Developers,<p>Join our around the clock coding team. We're just getting started <a href=\"http://www.OvernightConversions.com\" rel=\"nofollow\">http://www.OvernightConversions.com</a><p>Our clients are ad agencies and high-level designers. Perfect for freelance consultants who want to work random or sporadic hours.","time":1359744629,"type":"comment"},{"by":"georgespencer","id":5151886,"parent":5150834,"text":"Rentify\nFULL TIME in LONDON<p>We're hiring Ruby hackers of all experience levels. Venture-funded startup kicking ass in an exciting market. Big data challenges. Come and do your life's work.<p>No jokers.<p>We're also looking for data scientists, designers and a bunch of other roles.<p>mistergeorgespencer+HN@gmail.com to get a head start on your application.","time":1359738148,"type":"comment"},{"by":"chewc","id":5154276,"parent":5150834,"text":"Seeking talented software developers who thinks big and wants to make a difference to improve customer experience in Amazon globally.<p>Location: Amazon, Seattle, WA (FT, H1B)<p>More information and apply here:\n<a href=\"http://www.amazon.com/gp/jobs/194775\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/194775</a>","time":1359761900,"type":"comment"},{"by":"tmsh","id":5153018,"parent":5150834,"text":"Menlo Park, CA (Full Time)<p>Intuit is hiring Front End Engineers (JavaScript, HTML, CSS) and Back End Engineers to work on our award-winning product Mint.com and our Banking Solutions products. Check out <a href=\"http://bit.ly/YlZNIt\" rel=\"nofollow\">http://bit.ly/YlZNIt</a> to learn more.","time":1359748431,"type":"comment"},{"by":"smali","id":5151959,"parent":5150834,"text":"Jobvite is hiring for multiple engineering positions: front end, backend, analytics, reporting, QA &#38; operations.<p><a href=\"http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qHV9Vfwq&#38;s=HackerNews\" rel=\"nofollow\">http://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qHV9Vfwq&...</a>","time":1359738775,"type":"comment"},{"by":"skbohra123","id":5151576,"parent":5150834,"text":"Geekybuddha - Bangalore, India\nIntern - Hardware hacker<p>We are working on a very challenging consumer hardware product.<p>Technologies - C++, Python, PIC, Arduino and other related stuff. If you have anything to do with electronics tinkering, we would love to talk to you. Email in profile.","time":1359735484,"type":"comment"},{"by":"fvaleur","id":5152534,"parent":5150834,"text":"Appfolio is hiring security engineers and site reliability engineers in Santa Barbara, CA<p>Rails-based shop. We run our own servers in a colo. Small-ish company with great culture and nice people.<p><a href=\"http://www.appfolio.com/jobs\" rel=\"nofollow\">http://www.appfolio.com/jobs</a>","time":1359744484,"type":"comment"},{"by":"triggit","id":5216493,"parent":5150834,"text":"Jr. System Admin / Operations engineer, Full time, Triggit<p>Join a growing ad tech start-up. Be our 2nd System person!<p>More details at:  <a href=\"http://hire.jobvite.com/j/?bj=oVi0WfwT&#38;s=hacker_news\" rel=\"nofollow\">http://hire.jobvite.com/j/?bj=oVi0WfwT&#38;s=hacker_news</a>","time":1360798732,"type":"comment"},{"by":"cdolan92","id":5151899,"parent":5150834,"text":"<p><pre><code>    Startup - Sequoia Waste Solutions (Pittsburgh, PA) \n\n    Full Time or Contract. Remote OK, Local Preferred.\n\n    Positive-Cash Flow with 8 full time employees + contractors, interns\n</code></pre>\nWe are a 1.5 yr old startup working to disrupt the $60 billion waste industry, and we are primarily looking for a backend &#38; systems developer. We need individuals who are willing to solve problems inherent to an aging industry, and by doing so, topple the biggest players in the market.<p><pre><code>    About the company: \n</code></pre>\nSequoia is saving businesses money by incentivizing them to recycle. We work with almost any sized business to make recycling and waste-vendor management simple.<p>We have hundreds of client locations in a dozen states, and are cash flow positive with reoccurring monthly revenue, but need to stay on top of our tech development to stay ahead of the multi-billion dollar players in the space.<p>You will be an integral part of a small development team, tasked with improving upon 1-2 years of database, iOS, and customer portal/CRM development.<p>Currently we are rebuilding our backend, taking into consideration all the lessons of our first year and a half with clients. After doing so, we'll be prepared to roll out service in nearly every metro-area around the country - scaling on what will be your product!<p><pre><code>    &#60;-- Requirements/Responsibilties --&#62;\n</code></pre>\nLeadership experience, with the ability to produce from conception to execution.\nComfortable architecting 'behind the scenes' systems, and building those systems in a manner suitable for scale.\nA keen eye for customer UX.<p>Preferably, you have a cool project, website, or demo that you could send in.<p>We've done a majority of development for iOS, and run our data services on Salesforce and an AWS RDS instance. We're looking to get away from Salesforce as the backend to our customer portal and develop our own, pulling data from our own database.<p><pre><code>    &#60;-- What we will be working on --&#62;\n</code></pre>\nCollecting more data streams, via government agencies and any available API's, so that we may better analyze our customer's services.\nFurther down the road, we will make trash receptacles 'smart' for data collection and customer service.<p><pre><code>    &#60;-- To apply --&#62;\n</code></pre>\nEmail resumes and any relevant work to &#60;resumes@sequoiawaste.com&#62; , or through our website, at <a href=\"http://sequoiawaste.com/opportunities#view3\" rel=\"nofollow\">http://sequoiawaste.com/opportunities#view3</a>","time":1359738246,"type":"comment"},{"by":"jgrahamc","id":5150874,"parent":5150834,"text":"London, UK and San Francisco, CA<p>CloudFlare is hiring for our new London office and for the HQ in San Francisco: <a href=\"https://www.cloudflare.com/join-our-team\" rel=\"nofollow\">https://www.cloudflare.com/join-our-team</a>","time":1359729513,"type":"comment"},{"by":"urge_io","id":5151065,"parent":5150834,"text":"BERLIN/THE FACTORY - FULL TIME - NODE.JS<p>1. Node.js + NoSQL Growth Hacker for High Traffic Site<p>2. Lead Software Engineer Node.js<p>More info on <a href=\"http://urge.io/jobs\" rel=\"nofollow\">http://urge.io/jobs</a> and apply to career at urge dot io","time":1359731100,"type":"comment"},{"by":"ryen","id":5152425,"parent":5150834,"text":"Ochre - New York City<p>Software Engineer<p>--<p>Ochre (www.theochre.com) is an NYC-based media startup. We are a new,\ngrowing company building an online video network giving content makers the\nability to create interactive videos where viewers can make decisions on the\noutcome of the story - seamlessly and in real-time. We partner with ad networks,\nagencies and IT resellers to release this content.<p>Founded by Grammy-winning producer Devo Springsteen, Ochre is not just\nabout 0s and 1s. It’s about embracing technology to allow our partners tell stories\nin meaningful ways never before possible. It’s about changing the video medium\nfrom a 1-way presentation to a 2-way conversation. It’s about changing culture\nand our expectations of content.<p>We are a seed-funded startup (including celebrity investors) currently closing a\nround with top tier institutional investors.<p>----------<p>About our Software Engineer Position<p>We’ve developed an API-based video platform which stitches together videos\nduring playback. As one of the first full-time engineers you will be responsible for\nhelping scale the system to meet with our fast-climbing demand. You’ll do things\non a high level such as:<p>- Integrate our playback system with partners (Aol, Youtube, Spotify, etc.)<p>- Help scale our video consumption and playback system<p>- Further develop robust HTML5 playback protocol to stitch videos together on iOS/Android<p>- Integrate the interactive technology with relevant e-Commerce and social network backends<p>- Integrate user data with our analytics platform<p>- Assist with hiring additional team members and help develop processes for iteration and\nrelease<p>- Help make our product more fun and valuable<p>We offer competitive compensation packages including generous equity options.<p>----------<p>Requirements<p>- 3+ years experience building products for fast growing web or mobile products<p>- Minimum 3+ years of experience with Ruby/Rails<p>- Bonus points for experience with Flash/ActionScript3 and/or HTML5 video<p>- BS or MS in Computer Science or related field preferred<p>- Comfortable in a small, intense and high-growth start-up environment<p>- Passion for media &#38; fun!<p>If interested, contact info@theochre.com with resume and any other relevant\ndetails and we’ll connect from there!","time":1359743339,"type":"comment"},{"by":"languagehacker","id":5152158,"parent":5150834,"text":"San Francisco, CA. Wikia, Inc. Jobs in data engineering, backend scaling, and LAMP development. <a href=\"http://www.wikia.com/Careers\" rel=\"nofollow\">http://www.wikia.com/Careers</a>","time":1359740699,"type":"comment"},{"by":"eugeneka","id":5152487,"parent":5150834,"text":"AmazonStudios, Seattle, WA (FT, H1B)<p><a href=\"http://www.amazon.com/gp/jobs/197123\" rel=\"nofollow\">http://www.amazon.com/gp/jobs/197123</a><p>Send your resume to eugeneka[]amazon[]com, or apply directly on the page","time":1359743880,"type":"comment"},{"by":"joepestro","id":5152125,"parent":5150834,"text":"beRecruited.com - Fulltime, on-site (San Francisco)<p>We're the nation's largest online college athletics recruiting platform, and we're hiring. Our team has smart, fun full-stack engineers (including 3 YC founders), and we're growing quickly.<p>Ruby on Rails or iOS developer? Get in touch with me:<p><a href=\"http://blog.berecruited.com/careers\" rel=\"nofollow\">http://blog.berecruited.com/careers</a> or email me directly joe@berecruited.com (mention you saw this post on HN)","time":1359740337,"type":"comment"},{"by":"traviskuhl","id":5151649,"parent":5150834,"text":"Team Coco (teamcoco.com)<p>Location: Burbank, CA<p>Position: Web Developer, Full Time<p>Details: <a href=\"http://teamcoco.com/content/web-developer\" rel=\"nofollow\">http://teamcoco.com/content/web-developer</a>","time":1359736000,"type":"comment"},{"deleted":true,"id":5150849,"parent":5150834,"time":1359729293,"type":"comment"},{"by":"jwaldrip","id":5151530,"parent":5150834,"text":"iTriage Health -- Denver, CO. Full-time | Ruby Developers, JS Developers &#38; Node.js Developers.<p>Join us in creating mobile and web applications that empower consumers to make better health care decisions. We have a very talented tram and are looking for additional talent to join the team.<p>email: jwaldrip@itriagehealth.com<p>site:  <a href=\"http://about.itriagehealth.com/careers/\" rel=\"nofollow\">http://about.itriagehealth.com/careers/</a>","time":1359735120,"type":"comment"},{"by":"johnjohn101","id":5151043,"parent":5150834,"text":"StudyHall.com is hiring.<p>TechCrunch Disrupt finalist. EdTech gurus. \nHiring designers and front-end experts.<p><a href=\"http://bit.ly/XM68cN\" rel=\"nofollow\">http://bit.ly/XM68cN</a>","time":1359730922,"type":"comment"},{"by":"chrisbolt","id":5154235,"kids":[5160933],"parent":5150834,"text":"deviantART (<a href=\"http://www.deviantart.com/\" rel=\"nofollow\">http://www.deviantart.com/</a>) is looking for a DevOps Engineer. We're based in Los Angeles, but looking to hire someone remote.<p>It's a LAMP site, but in Ops we use a mix of PHP, Ruby, and Python. For configuration management we use Puppet.<p>You can find more details at <a href=\"http://deviantart.jobs/\" rel=\"nofollow\">http://deviantart.jobs/</a>","time":1359761357,"type":"comment"},{"by":"merinid","id":5160995,"parent":5150834,"text":"NYC<p>Big Public Data opportunities at Enigma.io\n<a href=\"http://www.enigma.io/about_jobs/\" rel=\"nofollow\">http://www.enigma.io/about_jobs/</a><p>Full Time positions, Internships","time":1359923049,"type":"comment"},{"by":"atechie","id":5151025,"parent":5150834,"text":"Bangalore - Fullstack software engineers @promptcloud<p><a href=\"http://promptcloud.com/careers.php\" rel=\"nofollow\">http://promptcloud.com/careers.php</a>","time":1359730794,"type":"comment"},{"by":"adnam","id":5151091,"parent":5150834,"text":"yuilop is hiring! Our mission is to make communication free&#38;easy, for everybody, to everybody, to any phone, anywhere in the world. We're looking for Android, Nokia, Java, erlang and SIP/VOIP hackers, plus DBAs and many other positions. More info here:<p><a href=\"http://yuilop.com/intl/jobs/\" rel=\"nofollow\">http://yuilop.com/intl/jobs/</a><p>Feel free to drop me a mail, adam (at) yuilop dotcom","time":1359731353,"type":"comment"},{"by":"BrandonM","id":5153601,"parent":5150834,"text":"EasyESI (<a href=\"http://easyesi.com\" rel=\"nofollow\">http://easyesi.com</a>) - Berkeley, CA (SFBA) - full-time, US residents only<p>EasyESI is 7-person, tech-led startup that helps lawyers sift through mountains of evidence in a case to find the smoking gun. This is a good business to be in: the amount of data is only increasing, lawyers are willing to pay for better solutions, and we're good at applying cutting-edge CS to traditionally hard problems. As a result, we're cash-flow positive less than two years after our founding, and growing rapidly.<p>We have many challenging problems, including machine learning, visualization, search, and nifty user interfaces. We're looking for generalists; we'll teach you (or you'll teach yourself) what you need to know.<p>We're a fun company, with an awesome location in downtown Berkeley, foosball, game nights, and more. We'll offer you a great salary, equity, health care, retirement with company matching, and a generous vacation schedule.<p>We are looking to fill 3 positions:<p>Front-End/UI Engineer - Must have a good attention to detail and be able to use and contribute to a large, modular Javascript codebase (built on dojo). Good understanding of HTML/CSS/Javascript is a must, and a good eye for design is a nice bonus. We support only modern browsers (no IE6 headaches), so we have a very rich HTML/Javascript interface that relies on AJAX queries to pull down data and perform much of the work.<p>Software Engineer - We all wear many hats, contributing to a backend Java codebase that uses minimal XML. We use a lot of modern open source technologies: Lucene, Cassandra, AWS, etc. We have a separate Python codebase for performing offline work. We strive to write all of our code in a modular, reusable style that maximizes code-sharing and minimizes repetition. We schedule weekly time for refactoring so that we avoid the accumulation of technical debt. If you're sharp and you're interested in learning how to write performant code that uses modern academic research and operates on the latest infrastructure, you'll like this role.<p>Systems Engineer - We deal with many terabytes of data. We have our own 48-drive-bay fileserver to handle our expanding storage needs over the next couple years. We need someone with Unix experience who is comfortable in Python to help us work more efficiently. You'll manage our AWS installations, manage our internal systems, and help make our entire setup more robust. We're happy to hire someone with solid fundamentals who wants to learn on the job.<p>We consider all applicants; please apply for the position(s) you're interested in at <a href=\"http://easyesi.com/jobs.shtml\" rel=\"nofollow\">http://easyesi.com/jobs.shtml</a>.","time":1359754024,"type":"comment"},{"by":"ARothfusz","id":5166480,"parent":5150834,"text":"dotCloud, San Francisco, CA.\n<a href=\"http://dotcloud.com/jobs.html\" rel=\"nofollow\">http://dotcloud.com/jobs.html</a><p>Solutions Engineer: deeper analysis of customer and potential customer stacks to help them optimize for PaaS deployment.<p>Platform Engineer: building the best language-agnostic PaaS in the world.","time":1360006451,"type":"comment"},{"by":"scapa","id":5152565,"parent":5150834,"text":"Any one hiring for hardware or linux device drivers/firmware positions?","time":1359744765,"type":"comment"},{"by":"transmit101","id":5150933,"parent":5150834,"text":"London: C++, Dev ops/Sysadmin, Android, Ruby on Rails<p><a href=\"http://mixlr.com\" rel=\"nofollow\">http://mixlr.com</a><p>Our hiring post: <a href=\"http://devblog.mixlr.com/2013/02/01/were-hiring/\" rel=\"nofollow\">http://devblog.mixlr.com/2013/02/01/were-hiring/</a><p>Mixlr is a platform for live audio with nearing 1 million registered users. We've built a series of products based around an extensive live broadcasting infrastructure, all fully maintained and managed in house.<p>We have a strong sense of product and design, and an interesting and scalable technical architecture.<p>We've got to where we are as a team of four. Now we're looking to expand and would like to talk to smart and passionate engineers who want to join us.<p>--- C++ engineer (full-time, London)<p>Our cross-platform desktop app is written is C++, and is a core part of our service.<p>We're looking to find somebody who is comfortable with deploying (beautfully written, maintainable) C++ applications to multiple platforms, and has at least a working knowledge of audio or video callbacks and streaming techniques.<p>We make heavy use of the QT framework, so some familiarity here would be useful, and the standard Unix toolchain features heavily in our workflow (we currently build using MinGW for Windows).<p>At Mixlr, we debug multithreading problems before breakfast. And because our app is currently a web/native hybrid, being comfortable working with networking and a good knowledge of web development techniques would be an advantage.<p>--- Dev-ops/Sysadmin (full-time, London).<p>At Mixlr our product requires an extensive and occasionally challenging backend infrastructure.<p>We are looking to find an experienced backend engineer with deep knowledge of managing both virtualized and physical environments. A strong knowledge of Amazon Web Services is a must, as that's where our entire stack is deployed right now.<p>We use Puppet to manage and deploy our servers, Ruby for scripting and run a 100% Linux environment making strong use of the Unix tool chain.<p>Experience of deploying and monitoring Ruby on Rails applications: we currently extend Nginx with a Lua caching layer, to enable us to use full page-caching for the majority of our website traffic. Being comfortable debugging, maintaining and improving this layer will be essential. Knowledge of MongoDB, Redis and deploying various applications on the Java virtual machine would also be directly relevant.<p>As with all of our roles, a passion for music and/or audio is a plus!<p>--- Android developer (full-time, London)<p>We've already designed and released a successful and well-received mobile application for iOS, and now we are planning to bring the full Mixlr experience to Android devices.<p>We are looking for an experienced Android developer to join the team on a permanent basis, and design and build Mixlr's Android app - from the first Git commit onwards.<p>We're looking for somebody to hit the ground running, so were you to apply you should have prior experience in building a non-trivial Android app. You should be confident with advanced Java programming techniques including advanced multithreading techniques.<p>As with all of our positions, you'll be interacting extensively with our various web services and the wider internet, so being comfortable in the world of networking would be an advantage.<p>--- Rails developer (full-time, London)<p>Our website is still the core way in which our users interact with Mixlr, and we have big plans for it going forward.<p>The ideal candidate would have extensive Ruby on Rails experience and be comfortable working with an extensive Rspec test suite. We make heavy use of the jQuery and Backbone JavaScript frameworks, write our CSS using SCSS, and rely on MongoDB and Redis to store and cache our data.<p>We would like to meet a smart, passionate Rails developer who is eager to extend their skill set, working on a fast-growing product with thousands of daily users.<p>If you want to talk more to us, drop me a line: rob@mixlr.com","time":1359730014,"type":"comment"},{"by":"jxtx","id":5153406,"parent":5150834,"text":"Atlanta GA and State College PA<p>The Galaxy Project, Emory University and Penn State University<p><a href=\"http://galaxyproject.org\" rel=\"nofollow\">http://galaxyproject.org</a><p>Contact: jobs@galaxyproject.org<p>Working for the Galaxy team provides a rare opportunity to perform research and to develop software at the leading edge of life sciences, genomics, data intensive computing, and big data analytics.<p>We develop Galaxy, a platform that enables researchers to store, analyze, visualize and share genomic data; and provides genomic tool developers with the ability to deploy their tools within a complete analysis framework. Thousands of researchers worldwide use Galaxy on a daily basis. Galaxy is an open source project committed to the openness of scientific enterprise and is free for all.<p>Positions are available both at Emory University, Atlanta GA (in the lab of PI James Taylor) and Penn State University, State College, PA (in the lab of PI Anton Nekrutenko).<p><i>Software Engineers</i><p>We have a wide variety of active projects, current areas of expertise sought include:<p>- Web-based visualization and visual analytics. We are building novel interactive visualizations of next-generation sequence data that leverage cutting edge web technologies.<p>- Informatics and data analysis and integration.  We build and use tools to analyze large datasets generated by high-throughput sequencing of DNA to understand genomes and genome function.<p>- Distributed computing and systems programming. We are engaged in the development of workflow systems, cloud computing based solutions, and other projects involving high performance and data intensive computing.<p>- Bioinformatics application areas such as re-sequencing, de novo assembly, metagenomics, transcriptome analysis and epigenetics.<p>Regardless of your areas of expertise we seek talented, self-motivated individuals to join our team. Galaxy is developed in an academic research environment, and members of the Galaxy team work closely with researchers on projects at the leading edge of data-intensive biology.<p>Galaxy is written in Python, but also makes substantial use of JavaScript, canvas, and other modern web technologies. Many of the analysis components of Galaxy are performance critical, and are implemented in C and other languages as well.<p><i>Postdoctoral Scholars</i><p>We are also recruiting postdoctoral scholars with expertise in Bioinformatics and Computational Biology. Our work on Galaxy is driven by our biological and biomedical research programs, and we are interested in hearing from potential postdocs with a wide variety of research interests:<p>- Computational and HCI research on both the development of analysis and data management tools, and the development of novel user interfaces and interactive visualizations for analyzing large-scale data.<p>- Distributed and high-performance computing for data intensive science, specifically genomics.<p>- Vertebrate functional and evolutionary genomics, particularly through the development of novel machine learning, data mining, and data integration methods incorporating genomic sequence and experimental data.<p>- Numerous areas of biology including genomic and epigenomic mechanisms of gene regulation, the role of transcription factors and chromatin structure in global gene expression, development, and differentiation.","time":1359751965,"type":"comment"},{"by":"amwelles","id":5151508,"parent":5150834,"text":"Help advocacy organizations get things done by working with Richir Outreach (<a href=\"http://richiroutreach.com/\" rel=\"nofollow\">http://richiroutreach.com/</a>)<p>Raleigh, NC, USA - Full time, no remote<p>We work primarily with NationBuilder (<a href=\"http://nationbuilder.com\" rel=\"nofollow\">http://nationbuilder.com</a>), Salsa (<a href=\"http://salsalabs.com\" rel=\"nofollow\">http://salsalabs.com</a>), ActionKit (<a href=\"http://actionkit.com\" rel=\"nofollow\">http://actionkit.com</a>), Wordpress, and Drupal. Even our strategists get hands-on with code!<p>---------------<p>LEAD DIGITAL STRATEGIST<p>The Lead Strategist will serve as project manager for a number of progressive campaigns and grassroots organizations.  The ideal candidate will be able to manage web projects from beginning to end, as well as coordinating integrated outreach campaigns that include social, mobile, video, and paid media. The Lead Strategist should also be knowledgeable of best practices in online organizing and outreach for nonprofits and campaigns, and be able to advise clients accordingly.<p>The individual in this role should have demonstrable experience with online organizing and outreach, although we are willing to provide technology-specific training to the right candidate.<p>- 3-4 years project management or outreach experience<p>- track record of managing projects with multiple stakeholders and demanding timelines<p>- understanding of intersction of new media, outreach, and organizing<p>- excellent verbal and communication skills<p>- interest or background in advocacy and/or community organizing experience<p>---------------<p>FRONT-END DEVELOPER<p>Our staff has the freedom to geek out on the latest tech and implement their vision for a variety of projects. Work with jQuery, Liquid, HTML, SASS, PHP, MySQL, and whatever else you'd like to get your hands dirty with.<p>- demonstrated mastery of CSS<p>- 2 years experience with Adobe Suite or similar<p>- portfolio of implemented themes, templates, or skins<p>- familiarity with open source libraries such as jQuery<p>- track record of troubleshooting and training<p>- commitment to winning reforms that will advance the public good<p>Bonus points for:<p>- PHP/MySQL experience<p>- contributions to open source projects<p>- UX expertise<p>- familiarity with mobile web development<p>---------------<p>Enjoy competitive salary and significant benefits including 100% employer-paid healthcare, 17 paid days off your first year (27 your second year), plenty of training opportunities, and a great working environment.<p>We are an affirming employer. Transgender and gender non-conforming people, lesbians, gay men, people of color, people of faith, and people with disabilities are strongly encouraged to apply.<p>---------------<p>Contact autumn@richiroutreach.com for more information, or apply online (<a href=\"http://richir.theresumator.com/apply/\" rel=\"nofollow\">http://richir.theresumator.com/apply/</a>).","time":1359734922,"type":"comment"},{"by":"scosman","id":5151130,"kids":[5151432],"parent":5150834,"text":"Toronto - MyShoebox Engineer<p>## Job Summary ##<p>MyShoebox is a recently launched startup with explosive growth. Our mission to to unify photo collections across devices and people. You can read more about our product in Forbes and TechCrunch (links at the bottom) or at shoeboxapp.com<p>We're looking for entrepreneurial developers to help us grow. You will have an opportunity to try multiple roles including new feature development, scaling a startup, product design, measuring progress and more. As a small company you'll have the opportunity to make a large impact to our business.<p>ABOUT US<p>1) With apps for Mac, PC, iOS and Android MyShoebox unifies your photo collection in the cloud and allows you to access any photo from any device.<p>2) Forbes says: \"MyShoebox is obviously onto something here and their numbers prove it. Let’s just see how fast all the other players in the photo-sharing game can catch up.\"<p>3) Founded by ex-Microsoft and ex-RIM engineers with a passion for building innovative experiences to explore large photo collections.<p>4) Located in Queen Street West, downtown Toronto. We're easily accessible by transit and in the heart of a fun and diverse neighbourhood with dozens of amazing lunch options.<p>ABOUT YOU<p>1) You want to start your own startup some day<p>2) You build passion projects or contribute to open source projects<p>3) You believe choosing the problem is just as important as how you solve a problem<p>4) You love to jump into new and ambiguous problems<p>5) You believe design includes everything from pixels to big-O performance<p>PRESS\nTechCrunch \"After One Month MyShoebox Tops 13M Photos Stored Averaging 3,275 Per User\"\n<a href=\"http://techcrunch.com/2012/11/28/after-one-month-myshoebox-tops-13m-photos-stored-averaging-3275-per-user/\" rel=\"nofollow\">http://techcrunch.com/2012/11/28/after-one-month-myshoebox-t...</a><p>Forbes \"Move Over Flickr Photobucket and Picasaweb Here Comes MyShoebox\"\n<a href=\"http://www.forbes.com/sites/karstenstrauss/2012/11/07/move-over-flickr-photobucket-and-picasaweb-here-comes-myshoebox-video/\" rel=\"nofollow\">http://www.forbes.com/sites/karstenstrauss/2012/11/07/move-o...</a><p>## Job Responsibilities ##<p>Startups require embracing a number of roles. Depending on your area of interest and expertise there are opportunities in:<p>New feature development<p>- building highly available web services<p>- scaling high-throughput image and video encoding servers<p>- mobile application development (iOS and Android)<p>- desktop application development (Mac and Windows)<p>- web development<p>- computer vision (best shot detection, face detection/recognition)<p>Growth hacking<p>- Determining where customers come from, how they engage and developing ways to grow faster<p>Interaction design<p>- Designing new ways to make photo collections as large as 120,000 photos friendly, approachable and fun<p>## Required Skills ##<p>We believe strong engineering fundamentals allow you to adapt to new languages, development environments and challenges. As a company with 5 client platforms and multiple servers we value the ability to learn quickly over expertise in any one technology.<p>Applicants should have:<p>- A passion for building new things (please include links to GitHub account and/or side projects on your resume)<p>- A understanding of standard algorithms, data structures and performance<p>- Respect for software maintainability and readability<p>- Experience with multiple languages and frameworks. We use Java, C#, Objective-C, Javascript and Ruby<p>- Experience with data stores, multiple a plus. We use Postgresql, Redis and Memcached","time":1359731748,"type":"comment"},{"by":"ontime","id":5152314,"parent":5150834,"text":"On Time Systems, Inc.<p>Eugene, (Possibly Portland) OR<p>Who we are:<p>We're a unique and small (25, soon growing to 50) company focusing on search and optimization. Employees here are treated incredibly well and have a lot of freedom to get the job done, or to create something new and useful. We hire smart people and then trust them to get things done, which means refreshingly little babysitting occurs. The work environment is friendly, informal and intellectual.<p>What we're looking for:<p>- knowledgeable C++ devs who are comfortable with algorithms and search<p>- Android and iOS developers<p>- Windows and C# developers<p>- familiarity with Oracle DB software and SUN hardware is a plus<p>Our company is profitable via a long-standing contract with the USAF, and exploratory with various startup side projects. Right now we are working on connecting drivers and vehicles to live traffic light data for routing and other novel applications. We tend to hire really smart people from various backgrounds, and this method has served us pretty well.<p>We do cool stuff! Come check us out!<p><a href=\"http://www.otsys.com/employment.php\" rel=\"nofollow\">http://www.otsys.com/employment.php</a>","time":1359742206,"type":"comment"},{"by":"ashearer","dead":true,"id":5152992,"parent":5150834,"text":"Providence, RI (full-time or intern) or remote (part-time)<p>Care Thread (<a href=\"http://www.carethread.com\" rel=\"nofollow\">http://www.carethread.com</a>) provides secure mobile messaging and team-based collaboration solutions for healthcare providers in hospitals. Care Thread's mobile and web apps deliver real-time information detailing patient status and treatment to every member of the care team, addressing communication gaps to eliminate unnecessary costs and reduce medical errors.<p>Our products are built around a real-time messaging and notification framework, using tools including node.js, Python, CoffeeScript, RabbitMQ, and PostgreSQL.<p>We're looking to expand our team by adding web front-end developers, mobile developers for iOS and Android, and back-end developers, as well as a system administrator who's comfortable with PostgreSQL databases, Amazon Virtual Private Cloud, and VPNs.<p>If you'd like to build the next generation of healthcare software, please contact us at jobs@carethread.com.","time":1359748235,"type":"comment"},{"by":"pghimire","dead":true,"id":5151864,"parent":5150834,"text":"FLINT NY is hiring a Front End Developer, a Brand Strategist and a BookKeeper.<p>---------------------------------------------\nApply Here: <a href=\"http://flintny.com/jobs/\" rel=\"nofollow\">http://flintny.com/jobs/</a>\n--------------------------------------------<p>At Flint we use strategic, innovative thinking to design and build digital and physical brands, products and services that help our clients engage, delight and interact more profitably with their customers. We are a small, rapidly growing professional team committed to developing meaningful, on brand creative solutions that exceed our clients' expectations. We are located in the SOHO neighborhood of NYC. Our clients include both start-up and fortune 500 companies. We work in healthcare, education, retail, finance, among other industries.","time":1359737900,"type":"comment"},{"by":"jaymod","dead":true,"id":5152258,"parent":5150834,"text":"Epoxy (<a href=\"http://epoxy.tv\" rel=\"nofollow\">http://epoxy.tv</a>) in Venice, CA (Los Angeles; full time ideal, intern, remote and h1b considered)<p>Senior Full-Stack Engineer, Senior Front-End Engineer and more<p><a href=\"http://epoxy.tv/jobs\" rel=\"nofollow\">http://epoxy.tv/jobs</a><p>Epoxy builds exceptional software for online video creators and viewers. Our tools help YouTubers and networks optimize their businesses and deepen the relationship with their audience. Our channel experiences provide viewers with new ways to connect with and experience the content they love.<p>Epoxy was founded by designers, engineers and entrepreneurs who are passionate about product and solving problems. Our backgrounds include Stanford, Brown, IDEO, Adobe, Mixpanel, Google/YouTube and Team Downey.<p>There are a number of senior engineering positions we'd like to hire for specifically, but we're absolutely interested in hiring smart people who don't exactly fit any of those particular positions. In general, we look for:<p>* BS or MS in Computer Science, a related degree from a top-tier program or the equivalent experience and mastery in industry<p>* Substantial real-world engineering experience with products shipped<p>* Strong, well articulated opinions on product design and engineering issues along with genuine flexibility and enthusiasm for approaches other than your own<p>* Preference for fast-moving markets, products, teams and the sometimes-ambiguous and fickle nature of early-stage startups<p>* High personal value on culture and culture fit in a job<p>* Deep sense of personal product ownership and long-term interest in developing technical and soft skills<p>We're building on a thoroughly modern stack including Ruby on Rails, node.js, Backbone.js, MongoDB, and friends.<p>Sound like something for you? Check out more complete descriptions at <a href=\"http://epoxy.tv/jobs\" rel=\"nofollow\">http://epoxy.tv/jobs</a> or drop us a line at jobs@epoxy.tv. Thanks!","time":1359741697,"type":"comment"},{"by":"martinduncan","dead":true,"id":5154022,"parent":5150834,"text":"Voxer has multiple job opportunities for Engineers who are looking for an exciting new career. If you have skills in iOS app development, Hadoop, HBase, Node.js, Web Design or QA Automation, we'd love to talk to you. We're also looking for a Visual Designer, if that's your passion.<p><a href=\"http://voxer.theresumator.com/\" rel=\"nofollow\">http://voxer.theresumator.com/</a><p>Some information about Voxer, and what we're up to!<p>Voxer is more than just a walkie-talkie app, it is one of the most used Push-to-Talk and messaging applications in the world. Voxer iOS and Android apps allow tens of millions of users across the world to communicate instantly. We're making voice and multimedia communication faster, more efficient, and more social. Our goal is ambitious - we're building the next generation communication voice service at the intersection between PTT, phone calls, SMS, conference calls, and multimedia messaging.<p>It's no small feat to achieve, to keep one of the world's fastest growing voice applications humming along and growing at a phenomenal pace. But we are 50 dedicated individuals who are putting some of the most exciting technology in the world to work right now - we are the world's largest Node.js site, and we also run one of the largest Riak clusters in the world.<p>We are dedicated and solely focused on building the next generation of communication. The problems we're facing are at a scale only seen at companies like Twitter and Facebook and we're looking for exceptional people who can help us tackle them.<p>We closed our first outside round of funding last spring, and our brand new offices are right off Market Street in San Francisco. There's tons of restaurants and shopping nearby at Westfield and Union Square to spend your hard earned cash on, and if you're a musician there's a few outside on the street that we wouldn't mind you teaching a few new songs to. There are plenty of MUNI lines right outside, BART is a block away, plus the Ferry to Oakland and Marin is a pleasant fifteen minute stroll or five minute bus ride away.<p>We look forward to hearing from you!","time":1359758768,"type":"comment"},{"by":"martian","dead":true,"id":5152032,"parent":5150834,"text":"San Francisco - Thumbtack - Software Engineer<p>Thumbtack is Amazon for services. A quarter of a million businesses have listed on Thumbtack, and we connect those businesses with new customers everyday. Unlike many startups, we're well on our way to being profitable.<p>Our small team is dedicated to excellent engineering and design. We eat meals together everyday cooked by an in-house chef. We work in a beautiful old warehouse in SOMA.<p><a href=\"http://www.thumbtack.com/engineering\" rel=\"nofollow\">http://www.thumbtack.com/engineering</a> and <a href=\"http://www.thumbtack.com/jobs\" rel=\"nofollow\">http://www.thumbtack.com/jobs</a><p>Email chris at thumbtack with questions.","time":1359739376,"type":"comment"},{"by":"nixy","dead":true,"id":5150924,"parent":5150834,"text":"Palo Alto, CA<p>Software/Mobile Engineer at Accedo.tv<p>We are seeking an Junior Mobile Developer to be an integral member of our development team. The ideal candidate will be proficient with application development in Smartphone / tablet space and web development (web 2.0 / rich frontends). Provide expert knowledge and guidance on multiple mobile initiatives. Ensure that the development effort adheres to SDLC process. Give input to Mobile Solutions. The candidate will also be able to work on multiple projects, be equally comfortable jumping into existing applications and pushing out a large volume of high quality code in a fast-paced, highly iterative environment. The ability and willingness to pick up new technologies quickly is essential. This is your opportunity to design and develop applications for some premium media companies and gain experience of working across multiple platforms and multiple audience needs.<p>Ideal candidate will have the following-<p><pre><code>  BS/MS CS/CE or equivalent experience\n  Exp w/iOS SDK and Objective-C\n  Exp w/Android or Google Web Kit front-end a plus\n  Exp development and using Web Services using contract-first techniques.\n  Demonstrated experience with object oriented software design and development (in PHP/Java).\n  Good knowledge of software engineering life cycle process including design, development, build/release and QA.\n  Basic understanding of source code control procedures and environments (git, subversion, Jira).\n  Basic knowledge of Internet Application architectures and Protocols (TCP/IP, HTTP, etc.).\n  Experience in creating user interfaces from design concepts \n</code></pre>\nThis is a contract to hire/ full time and on-site position located in our Palo Alto office. Salary commensurate with experience. Please contact back with your resume and cover letter.<p>About Accedo: Accedo is the leading enabler of Smart TV and IPTV applications. Accedo provides platforms, applications, tools and services to media companies, platform and CE companies and TV operators globally, to help them deliver the next-generation TV experience. Accedo's cloud-based platform solutions enable customers to cost-efficiently roll out and manage application offerings and stores for multiple devices and markets.<p>nik at accedo dot tv (Please put HN in the subject line)","time":1359729958,"type":"comment"},{"by":"reaclmbs","id":5152462,"parent":5150834,"text":"Lookout Mobile Security - San Francisco, CA<p><a href=\"https://www.lookout.com/resources/reports/state-of-mobile-security-2012\" rel=\"nofollow\">https://www.lookout.com/resources/reports/state-of-mobile-se...</a><p>We're hiring in administrative, hr, ops, bizdev, product, and engineering (Ruby/Obj-C/JavaScript/Java/C).<p><a href=\"https://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qT79VfwO&#38;v=1&#38;page=Apply\" rel=\"nofollow\">https://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qT79VfwO...</a>","time":1359743623,"type":"comment"},{"by":"JaretManuel","dead":true,"id":5151975,"parent":5150834,"text":"Bloomington, Indiana (or Remote for right candidates) FormAssembly<p>VeerWest (Dba. FormAssembly.com) is seeking an awesome system administrator. LAMP (Linux Chef). We are also seeking a customer support representative and an intern position.\nWe're 200 users strong and we integrate very nicely with Salesforce. \nwww.veerwest.com/jobs","time":1359738978,"type":"comment"}]}