{"by":"blader","id":4727245,"kids":[4728287,4729394,4728128],"parent":4727241,"text":"San Francisco: product designers and mobile engineers.\n[So far, every member of our team (who we didn't already know) joined us via Hacker News]<p>Subscription based social hyperlocal mobile gamified dating discovery engine with loyalty coupons. For the enterprise.<p>Just kidding.<p>We're a stealthy team of product generalists, ML engineers, and even a neuroscientist filling a hole in the universe by building software that enriches the human experience. Everyone on our team codes and contributes on every level, front to back. We've all built web scale products and scaled them to millions of daily active users with zero marketing spend. <p>The world is becoming a different place: everyone is going to be carrying around a network connected super computer with ambient sensors in their pockets. We can see the future that is enabled by these devices. We are making that future happen.<p>Real talk: We've been running our prototype for 5 months now and we all use it multiple times a day, every day. Every person we've shown it to has asked us if they can have it. Every single person who's installed ithas gotten mad when our testflights expire. This is, verbatim, what one of our investors had to say after running it for a week:<p>\"Just wow. It's so magical. So easy. In fact, almost too easy. I'd insert something in the first time user experience that is whimsical and funny like: \"making the magic happen...\" And then boom suddenly your whole life shows up as an archive. I just can't get over this. So stunning. You've achieved what few could.\"<p>We are well funded by a long list of top tier investors: <a href=\"http://angel.co/herelabs\" rel=\"nofollow\">http://angel.co/herelabs</a><p>We're looking for a select few product designers (technical people with a portfolio of mobile work) and mobile engineers (who know iOS inside and out and have good taste in design) who can come in and contribute at speed on day one and who are world class at more than one thing.<p>Ideal candidates are brilliant, fearless, and passionate individuals who are uncompromising in their pursuit of building an incredible product that will positively affect the lives of every human being every day. <p>As teammates we value commitment and accountability; honing our craft; building tools to create leverage; and seeking to learn from and understand each other.<p>We are offering founding team equity and competitive salaries. Office space in the heart of the SoMa in beautiful San Francisco. $10K budget for equipment ready the day you start. Exec budgets, gym memberships, team lunches. Willing to relocate. Willing to fly you in for interviews. Willing to tell you our stealthy secrets.<p>We are not your typical San Francisco stealth startup. We are NOT another me-too-social-local-sharing app. We DON'T sell condoms by subscription. We are NOT the place to share photos of your dog taking a leak. There will be NO gamification.<p>Life is short. Build stuff that matters. Email siqi at herelabs.com.","time":1351775200,"type":"comment"}