{"by":"jordo37","id":4727749,"parent":4727241,"text":"San Francisco | Fullstack Engineer, Backend Engineer and Frontend Developer | Perfect Audience<p>What We Do:\nWe've built the world's first and easiest Facebook ad retargeting solution, and we have much more ambitious plans. We believe advertising is a critical part of the internet economy, and want to help small business and publishers succeed with solutions that just work.<p>Who We Are:\nWe're a team of five, split between some of us doing the selling and the rest of us doing the building. We want to bring in more designers and developers to help us keep building new features as fast as we can. Ideally these folks will be ready to dive into anything, pitching in when fires come up. But, they will also own some piece of the product where we need expertise.<p>Traction:\nWe are increasing our revenue by 25% every week and it's going to do nothing but accelerate with some big clients we have lined up in the coming months.<p>What we look for in teammates:\nSmart, really smart\nEager to join a growing startup\nHas a “maker” attitude\nGood at communicating (ready to discuss features, bugs, architecture, etc.)\nLanguage never trumps experience - but if you know Rails, Mongo and Javascript things will go faster\nAppreciation for puns and movie quotes\nExperience in advertising is a HUGE plus<p>Backend Engineer<p>About the Position:\nWe're looking for someone to be the primary backend person at Perfect Audience. This person will guide us as we think about restructuring our data storage and help us prepare for more data influx and more demanding data analysis and visualization.<p>What we are looking for:\nSolid understanding of database paradigms and architecture\nAbility to look at a series of customer or team needs and help us pull together the right technology, queries and optimizations\nAbility to cover DBA or Sys Admin needs is awesome<p>Full Stack Engineer<p>About the Position:\nWe're a team of full-stack engineers who enjoy database design, application logic, and standards-based frontends. We are always looking for more smart generalists to come join us. This is a chance to work on every facet of a successful web app and grow your engineering skillset.<p>What we are looking for:\nSolid software development foundation\nAbility to architect, develop, and test key infrastructure\nUnderstanding of performance and design tradeoffs, without compromising quality\nExperience scaling up webapps and services for rapid growth is a plus<p>Front End Designer / Developer<p>About the position:\nWe regularly get complimented on our design and interface, but we don't want it to just be better than the enterprise tools - we want it to be delightful. We want a skilled individual to come in and own the design and user experience.<p>What we are looking for:\nSomeone as comfortable editing masks in Photoshop as tweaking CSS in a text editor\nInnate understanding of, and instinct for, design and user experience \nExperience seeking input from end users\nAbility to carry design from ideation and wireframes all the way through solid HTML, CSS and Javascript\nExperience with enterprise or B2B tools is a plus<p>Contact us at jobs@perfectaudience.com","time":1351780972,"type":"comment"}