{"by":"sebslomski","id":4727630,"parent":4727241,"text":"London: JavaScript Developer<p>#Job Description<p>Working closely with all members of the product, UX/UI and Dev teams, you will be responsible for implementing the front-end of our product experience as well as conceptualizing and planning new features.<p>You will be working in a collaborative environment, which is diverse and open-minded. The successful candidate will demonstrate best practice front-end development, including usability, SEO, calls to action and delighting the user while maintaining security, cross-platform/browser compliance, accessibility, scalability and performance standards.<p># Skills &#38; Requirements<p>## Responsibilities<p>- Build UI features in Javascript untilizing RESTful JSON APIs<p>- Be aware of new and emerging front-end technologies<p>- Maintaining and extending existing mobile web apps<p># Skills<p>- Extensive experience with Javascript and Javascript libraries, particularly Backbone.Marionette and jQuery<p>- Fluency with HTML5 and CSS3<p>- Expertise with Javascript MV* frameworks such as Spine, Backbone.js, Sproutcore, Cappuchino<p>- Has an opinion on Crockford's JS style and semicolons<p>- Experience with version control systems, prefrable git<p>- Proven real world experience with mobile web development<p>- Knows what \"use strict\" does<p>- Has an opinion on innerHTML vs. document fragments<p>- Understands inheritance in Javascript, appreciation and understanding of object oriented programming concepts<p>- Obsessive about quality, including code quality<p>- Experience with testing, particularly unit tests<p>- Knowledge of XMPP is a bonus point<p># About Luluvise<p>Luluvise is an innovative and fast growing social and communications platform dedicated to women. Our vision is to become the social destination for women around the world.<p>Launched in December 2011, Luluvise is strongly supported by some of the most respected investors and tech advisers in Europe &#38; the US.  We have received considerable global press from Wired, Tech Crunch, The Sunday Times, Wall Street Journal, Financial Times, Venture Beat, Glamour and Cosmopolitan, to name a few.<p>We have an enthusiastic, open-minded and international team. We are looking for extraordinary individuals who are passionate about their work and who can join us in building this exciting new company.  We want to push boundaries and build something that will be used by millions of women.  We are just at the beginning of this journey!<p>The role will be based in London’s buzzing tech scene, a truly fantastic place to work and live. This is a great opportunity for international applicants to relocate to London and join this thriving community.<p>Please apply by sending your CV and cover letter to Ekta at ekta@luluvise.com","time":1351779587,"type":"comment"}