{"by":"jergason","id":4728187,"parent":4727241,"text":"Provo, UT. REMOTE<p>i.TV is making Nintendo TVii, the TV experience that launches with the WiiU on November 18th, and we want your help to make it awesome.<p>We are looking for several engineers and one devops engineer to help us revolutionize television. We create applications for tablets, phones, and laptops that work seamlessly with your home system to suggest content to watch, control your TV, and deliver engaging complimentary experiences and extra content during the show.<p>We currently have the top TV app in the app store. We power Huffington Post TV and social TV experiences for EW.com.<p>But NintendoTVii is 10x as cool as that. It is all about what you do while you're watching TV. It will be preinstalled on the WiiU this fall, and we will be in tens of millions of homes before the end of 2013.<p>Our team and culture are what set us apart\n1. Currently 7 really smart engineers.\n2. Lots of autonomy, minimal red tape. \n3. We work in small teams of 2-4 engineers, a designer and a product person who are given a high-level assignment. They are small enough to avoid process/organizational overload and meetings. \n4. Meetings, seriously, the only ones we have are Friday lunch and casual ones over the foosball table. \n5. Focus on learning! Tell us about the cool stuff you use or invent and we'll use it. Go to conferences on the company dime.\n6. 20% time - every Wednesday we have \"Developer day\" where you pick what you think is important and do it. \n7. Personal responsibility - you take vacation whenever you want, choose your own hours, choose your own equipment.<p>We have great benefits\n1. Sweet equipment. We just bought everyone retina macbook pros. \n2. Fully stocked fridge and kitchen with drinks, snacks and lunches. \n3. 100% health and dental\n4. Above-market salary that we reset as often as necessary\n5. Fun downtown Provo location and building<p>Equity opportunity\n20% of the post-investor equity goes to the employee stock plan. Our hardware partner recently advanced us several million against advertising revenue this fall, and we are on track to blow past that before the end of the year. We were last valued at 20 million, and expect to be valued at 50 million during 2013.<p>Technology\nWe use node.js for most of our backend services. We use MongoDB as our database. We create rich clients with JS/HTML, iOS and Android. We expect you to be proficient in at least one of these technologies, and to be able to learn more. We're looking for great devs over a specific skillset.<p>For the DevOps position, we're looking for someone who can focus on scaling, removing deploy friction, uptime and security, but we want someone who is constantly inventing and automating to solve the problem, rather than resorting to manual labor.<p>Some cool problems we are working on:\n1. There are 800,000 unique channel lineups with up to 1000 channels each, with millions of unique events. How can you massage the programming information to make TV guide APIs fast?\n2. We create software that watches TV to extract thumbnails every second, and analyze the caption and audio data. How can we make this faster and more scalable?\n3. How can we create really compelling web applications on custom hardware?\n4. How do you implement really custom, unique but simple designs and keep it maintainable?\n5. How do we get a mobile device to control a TV?\n6. How can we show users the content they will care about most?\n7. How can we use data about sports or TV programs to create engaging visualizations?\n8. How can we help users interact with each other while watching tv?<p>Email jamison@i.tv for more info. Visit <a href=\"http://i.tv\" rel=\"nofollow\">http://i.tv</a> to see the promo stuff.","time":1351785832,"type":"comment"}