{"by":"seldo","id":4728275,"parent":4727241,"text":"San Francisco, CA. Full time. H1B okay.<p>Sharing over social media is driving an ever-increasing percentage of web traffic. But with mobile clients and HTTPS, traditional web analytics isn't working anymore. We know we can do better, so awe.sm is building full-featured social media conversion tracking and analytics. We tell our customers the value of their social traffic in a metric that's meaningful to them, whether it's page views, signups or dollars of sales. Our APIs allow app developers to integrate social data into their products, without building their own data collection and processing infrastructure.<p>We're an engineering-driven team building products primarily for other developers, so we're passionate about providing an amazing experience for developers. To help us get there, we're looking for a Developer Experience Lead. By that we mean somebody who will really own that experience: somebody who understands deeply how to get the most out of awe.sm, and has the communication skills to get that information to developers. That will mean representing awe.sm at hackathons and other developer events, and being the primary point of contact for developers building on our platform. We want you to find the pain points before our customers do, and feed that information back to the engineering team, so we can adapt our product to real-world needs. We also want you to do anything else you can think of that will help: building demos, writing client libraries, expanding our documentation, or working one-on-one with clients who have novel problems, to see how we can expand the platform to meet their needs.<p>We want you to eliminate friction from integrating awe.sm with our customers' systems. You need to be an engineer first, but also a puzzle-solver, a pattern-finder, and a great communicator. There's no role more critical to our growth right now. (We are also hiring back-end and full-stack engineers.)<p><a href=\"http://totally.awe.sm/jobs?source=hackernews\" rel=\"nofollow\">http://totally.awe.sm/jobs?source=hackernews</a><p>We're 13 people right now. We have a cool new office with awesome views ( <a href=\"http://www.flickr.com/photos/seldo/6326815086/in/photostream\" rel=\"nofollow\">http://www.flickr.com/photos/seldo/6326815086/in/photostream</a> ) in the heart of the Mission. We have catered lunches, and full health, vision and dental coverage. We use an IRC server for team communication and are agile in the sense that we move quickly and react fast, not in the sense of having attended an overpriced training course.","time":1351786816,"type":"comment"}