{"by":"mattlong","id":4728452,"kids":[4728579,4728608],"parent":4727241,"text":"Crocodoc<p>San Francisco, CA | Full time | Full-stack Engineer<p>## Description<p>We're looking for a full-stack web engineer who can contribute to all aspects of Crocodoc: front-end development, server-side improvements, ops and systems tasks, and everything in between. Does your experience mostly fall into one or two of those categories? Not a problem, as long as you're eager to get your hands dirty outside of your comfort zone.<p>Since you'll be joining a small technical team, you'll take the lead on core projects from day one and often work independently. We're nimble and push code almost every day, but because our product reaches tens of millions of users, everything must be bulletproof.<p>## Skills and Qualifications<p>- Ability to embrace the energy and drive of a close-knit start-up team.<p>- Self-starter with the creativity and initiative to brainstorm, propose, and dive into implementing solutions.<p>- Strong command of Python and up-to-date knowledge of its ecosystem. We love Python and use it throughout our back-end.<p>- Proficiency in JavaScript/HTML5/CSS3 and keen awareness of the state-of-the-art in browser technology. Our HTML-based document viewer is the face of Crocodoc, and we keep it polished.<p>- Familiarity with distributed computing. We use Celery to coordinate dozens of servers to process documents within a matter of seconds.<p>- Comfortable working in (and improving) a Linux-based development and deployment environment.<p>- Understanding of cloud-based infrastructure and all the benefits and drawbacks it provides. We're on Amazon AWS and dig its flexibility.<p>At Crocodoc, you'll be working with a savvy tech team that enjoys solving tough problems and loves to learn and leverage new technologies when it makes sense. If that sounds like your cup of tea, we'd love to hear from you. Please contact us at jobs@crocodoc.com or visit <a href=\"https://crocodoc.com/jobs/\" rel=\"nofollow\">https://crocodoc.com/jobs/</a>.","time":1351788698,"type":"comment"}