{"by":"davidmr","id":4728204,"parent":4727241,"text":"Location: Chicago, IL OR New York City OR London<p>Firm: Jump Trading<p>Wanted: C++ hackers with a side of Python<p>Marketing Blurb:<p>Our firm grew out of the knowledge and experience of its founders to become a globally-positioned financial technology firm that remains on the cutting edge of algorithmic trading. We are a privately funded company and do not rely on outside investors or private equity. With offices in Chicago, London and Singapore, we trade across all major asset classes in the Americas, Europe and Asia. Because of our ongoing commitment to technology and human capital we have become an industry leader, quietly setting the standard for sophisticated trading strategies.<p>Our success is driven by three fundamental ideas:<p><pre><code>  * Seek and hire the most brilliant and talented people we can find\n  * Reward those people based on merit\n  * Remain on the leading edge of technological innovation\n</code></pre>\nThe Job:<p>The Data Archive Support Developer will be a part of a team responsible for building and maintaining the HPC software infrastructure used by by Jump's quantitative researchers for statistical analysis. Responsibilities for this position will be split between operational support of Jump's historical market data archives, automation of support tasks, and development of tools which will enhance the efficiency and efficacy of the researchers workflows. A successful candidate will work closely with core developers, quant support system administrators and quant researchers to ensure the integrity of the market data, optimize its format for high performance computing, guarantee its availability in a timely fashion and improve the overall efficiency of the quant research processes at Jump.<p>DUTIES AND RESPONSIBILITIES:<p>* Manage applications which capture market data and prepare the data for consumption by research applications<p>* Verify the integrity of the archived data and resolve data integrity issues.<p>* Build tools which will enhance the overall supportability of the archive environment and automate common tasks.<p>* Work closely with Jump's core developers to build and maintain a deep understanding of Jump's feed and capture applications as well as the archive consumption APIs.<p>* Work closely with Jump's quant researchers to understand how they are using the archives as well as any challenges they are facing.<p>* Use the above understanding to build tools which enhance the overall usability of the archive environment and lower barriers to entry for new archive users.<p>* Act as a support contact for Jump's Quant users for issues related to the archive access APIs and archive data itself.<p>If you have any questions at all, please e-mail me! The job description really doesn't do a great job describing the awesome problems you'll be solving or the freedom you'll have to explore solutions.","time":1351785957,"type":"comment"}