{"by":"quixey","id":4729205,"parent":4727241,"text":"Mountain View, CA - Principal Data Scientist, Senior Software Engineer, DevOps Engineer, Engineer in Test, and more!<p>We're Quixey, the Search Engine for Apps. We partner with some of the largest carriers, app stores, browsers, and manufacturers to power app search worldwide. Our Functional Search technology uses data from across the web (blogs, tweets, news and review sites and more) to learn exactly what each app does. Just type what you'd like to do into any \"powered by Quixey\" search bar and we can find an app to help.<p>We're all about solving tough problems, and revolutionizing the existing app discovery model is no small task. We just moved into a bigger office in Mountain View, CA and are actively hiring for positions across the board. Check out open listings here: <a href=\"http://bit.ly/SOngig\" rel=\"nofollow\">http://bit.ly/SOngig</a><p>Also, here are couple descriptions of what we're looking for:<p>Principal Engineer, Search Sciences -  In this awesome newly created role, you will work with various internal teams at Quixey to develop the next generation of technologies to power Quixey’s powerful Functional Search Platform. This will include solving real world challenges in search, organizing information, cluster content, text classification, and extracting signals from structured and unstructured data sources.<p>Software Engineer in Test - We're looking for an experienced engineer to help build the tools and processes that will uphold our quality standards. This includes testing a variety of software products, system architectures, OS platforms and browsers with maximal automation; building test frameworks that are woven into our development and release process including regression and unit tests; and designing and implementing QA strategies for a variety of tools.<p>DevOps Engineer - This position involves building tools to manage, deploy, monitor, and scale our AWS infrastructure with close integration to our build &#38; bug-tracking system, working closely with our development team to plan our co-location strategy, and managing costs effectively for cloud services.<p>We're a fun, exciting startup that's expanding super fast. We’re well funded, backed by world-class investors and are on track to power a billion queries per month. We’re looking for passionate people who can make big things happen and have fun doing it. We're also hiring in Finance, Marketing, and Product Management, so take a look at all our open positions and see what might be a good fit! <a href=\"http://bit.ly/SOngig\" rel=\"nofollow\">http://bit.ly/SOngig</a>","time":1351797508,"type":"comment"}