{"by":"cliftonk","id":4730904,"parent":4727241,"text":"Dallas, TX, full-time<p>Ruby Developer<p>About OrgSync<p>We were founded in 2007, have over 300 colleges and universities as\nclients and are growing rapidly to reach our goal of working with the\n4,000+ colleges and universities across the United States and Canada. In\nthe future, we will also be entering other markets that can utilize our\ndynamic and evolving product. We have an exciting and relaxed corporate\nculture that values team members' contributions and dedication. Come be\na part of our growth.<p>Job Summary<p>We're looking for a programming virtuoso to work alongside a small\nteam of developers and designers committed to building a robust,\nperformant and scalable web application that our users love. You have an\nattention to detail and a professional curiosity that extends beyond the\nworkplace. You will work in a mostly autonomous environment, so you have\nto be just as awesome at getting things done as you are at composing\nelegant solutions.<p>Most of our code is written in Ruby and runs on the Rails stack backed\nby a MySQL database, but we also incorporate other technologies such as\nNode.js, Memcached and Redis. We use GitHub for version control and our\ninfrastructure is entirely hosted via cloud services.<p>This is a full-time position at our headquarters in Dallas, TX and\nincludes a competitive base salary, a full range of benefits, stock\noptions, and an awesome team of creative people by your side.<p>Requirements<p>- Passion for developing excellent software and an appreciation for\n  elegant code<p>- Strong understanding of MVC web frameworks and REST concepts<p>- Strong understanding of relational databases including complex queries\n  and optimization<p>- Familiarity with key/value stores and caching techniques<p>- Familiarity with JavaScript and its frameworks a plus<p>- Open source project contributions a plus<p>- Ability to play \"Careless Whisper\" on saxophone a plus<p>- Strong written and verbal communication skills","time":1351822197,"type":"comment"}