{"by":"will_critchlow","id":4733183,"parent":4727241,"text":"London: Junior / Graduate Python Developer<p>Distilled is looking for a graduate developer to join our growing Python team in our London office. We currently have the following largely Django based projects:<p>* DistilledU - a feature rich online SEO training platform - our latest project that came out of beta in June this year and is being well received by the SEO industry. \n* Distilled Store - an online store we’ve built from scratch to sell conference tickets and videos.\n* Internal Tools - building a range of tools, from quick hacks to fully functional tools, pulling from APIs and various data sets. \n* Distilled website - currently a Wordpress site that we’ve got grand plans for turning into something far more awesome based on a Django CMS and blogging platform called Mezzanine that we will fully integrate with DistilledU and Distilled Store.\n* Distilled Tools - our internal reporting system and tool for managing freelance writers.<p>You’ll gain experience in Agile development practices and work in an open, fun and collaborative environment. Please apply at the URL below.<p><i></i>Requirements<i></i><p>* Python - some experience, not necessarily commercial.\n* Frickin smart - you will need an uncanny ability to get stuff done.\n* Passion for self improvement - technologies move quickly, we’ll expect you to keep up.  \n* Evidence of getting things done - you’ll probably have a number of side projects.<p><i></i>About the company<i></i><p>Distilled is a search marketing company with a big and ever growing reputation. We have worked with some of the biggest brands in the world, and are known in the industry as experts in what we do. We are 100% owned by the two directors, with offices in London, Seattle and New York. Employees number 52 in total, with London being the biggest office. We like to have fun, with things like Beer o’clock every Friday, regular company outings and a meeting room that is largely used for 4 player Mario Kart.<p>For more info and to apply: <a href=\"http://www.distilled.net/graduate-junior-python-developer/\" rel=\"nofollow\">http://www.distilled.net/graduate-junior-python-developer/</a>","time":1351871575,"type":"comment"}