{"by":"mebassett","id":16969587,"parent":16967543,"text":"Trivium Real Estate | Frontend and Devops | London | Full-time | ONSITE<p>We&#x27;re a young, investor-backed, machine-learning startup for the commercial real estate industry. Our MVP is moments away from launching and customers are queuing to take it for a spin. As such, we&#x27;re growing our team to tackle the challenges ahead.<p>We&#x27;re a team of 8, located at London&#x27;s South Bank and value continuous learning, empathy with our clients and customers, and empowering our engineers to make the best decisions.<p># Front-End Engineer<p>This is for someone who:<p><pre><code>  - is comfortable in functional programming, especially Elm; and\n  - is experienced shipping front-end software to production; and\n  - has empathy for users and loves friendly UX; and\n  - has an eagerness to learn and willingness to share knowledge.\n</code></pre>\n## A Typical Day<p><pre><code>  - Start off writing a feature that requires elm-ports. These can be tricky, so you pair with another developer who has shipped such code before.\n  - After lunch you&#x27;re requested to review a Pull Request that fixes a bug you accidentally introduced a couple weeks back. There&#x27;s no blame, instead some discussion about how our tests and review process could have caught this earlier.\n  - The afternoon is spent with the Product guys around a whiteboard. You&#x27;re helping them sketch out a realistic wire-frame for a feature we plan to deliver in a couple of weeks.\n</code></pre>\n# Dev-Ops Engineer<p>We&#x27;re believers in CI and automated testing, but we need some help getting there. In particular we spend far too much time:<p><pre><code>  - Ensuring our testing, deployment, and validation services are up to date with the product.\n  - Managing different servers for staging and production.\n  - Trying to ensure we have a consistent build process across different machines.\n  - Thinking about the best way to deliver our machine-learning services in production.\n</code></pre>\nYou should have:<p><pre><code>  - experience maintaining CI services;\n  - experience writing web applications in a functional language;\n  - experience with different build processes (e.g. Make, `webpack`);\n  - knowledge of and comfortability with Linux, AWS, and Docker.\n</code></pre>\n# Benefits<p><pre><code>  - £50-70k DOE. + Equity.\n  - 20+ holidays per year.\n  - Support for conferences &amp; other tech related education.\n  - Friendly, supportive team.\n  - Great office location.\n</code></pre>\n# Some Tech we like:<p>We&#x27;re more interested in a willingness and ability to learn than what you currently know. But in case your interested in the stack we&#x27;re using:<p><pre><code>  - Haskell\n  - Elm\n  - PostgreSQL\n  - Python &#x2F; scikit-learn\n  - Tensorflow &#x2F; Deep learning\n  - AWS\n  - CircleCI\n  - Automated Testing\n</code></pre>\nWe aren&#x27;t looking for any particular level of experience, just great engineers and friendly people.  Contact info in my profile or at <a href=\"https:&#x2F;&#x2F;www.triviumre.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.triviumre.com</a>","time":1525197754,"type":"comment"}