{"by":"hunterwerlla","id":16968025,"parent":16967543,"text":"Microsoft | Bellevue, WA | Junior&#x2F;Senior Engineers | mostly C, some C++ and some C# | Cortana | sdk, devices, audio, and cloud service work | Full time onsite<p>Hi all,<p>The Cortana SDK and devices team is looking for software engineers to work on the Cortana SDK and Cortana Devices. Our team builds the client for Cortana, the SDK to build standalone Cortana devices with, and does some cloud service work as well. This is a young team, so you can make a large impact on the code base without feeling bogged down in years of tradition.<p>We have already shipped our first product, the Harman Kardon Invoke: <a href=\"https:&#x2F;&#x2F;www.harmankardon.com&#x2F;invoke.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.harmankardon.com&#x2F;invoke.html</a> and are working on cool projects like the JCI GLAS: <a href=\"https:&#x2F;&#x2F;glas.johnsoncontrols.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;glas.johnsoncontrols.com&#x2F;</a><p><i>requirements</i>\nWe need people well versed in low level programming with a knack for picking up things fast. We have a lot of different aspects of the project that need fleshing out from audio pipline to lighting to services. Much of our current work is C, but we have work in C++, C#, Objective-C and Java as well. IOT or light embedded experience is definitely a plus: our devices rely heavily on cloud services. Linux experience is preferred, and the ideal person would be able to develop on and for both Linux and Windows, but if you have no experience with one of the two that is fine as well. About half the team uses Linux for development and the other half uses Windows.<p>Personally speaking, I have a lot of fun at work because we work on so many different types of technologies all the way from a C# service to arcane areas of Linux APIs. Another thing I like is we have no standard platform for development, so I Vim and Linux for all of my work (if you want to become our first developer primarily on OSX that&#x27;s fine with us :P).<p>If you are interested, please email your resume to me at cortanasdkresumes@microsoft.com and a short 1-3 sentences that indicate you read the post. You should also apply to the external postings below as well:<p>External postings:<p><a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;387001&#x2F;Senior-Software-Engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;387001&#x2F;Senior-Softwa...</a><p><a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;413905&#x2F;Software-Engineer-2\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;413905&#x2F;Software-Engi...</a><p><a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;390183&#x2F;SOFTWARE-ENGINEER-2\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;us&#x2F;en&#x2F;job&#x2F;390183&#x2F;SOFTWARE-ENGI...</a>","time":1525189487,"type":"comment"}