{"by":"johnumbaugh","id":16967770,"parent":16967543,"text":"CareEvolution | Healthcare Interoperability Software Developer&#x2F;Architect | Ann Arbor, MI | REMOTE OR ONSITE, VISA, <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a><p>Note: this job is open to US Residents only.  Foreign nationals can apply but only if you live within the US.<p>Does what you do matter? Is the work that you do making a difference in the world?<p>What CareEvolution does actually matters. Our HIEBus platform helps patients attain better health outcomes.<p>Simply stated, at CareEvolution, you will craft our platform for healthcare interoperability, as well as web and mobile applications. Under the covers, though, a lot more is going on - we have developed a robust software solution that ingresses data, programmatically links that data across institutions on a per-patient basis, and supplies APIs to consume, project, modify, and aggregate that data in all sorts of interesting and useful ways. You can read our company page for a more detailed explanation of our mission and culture.<p>We are looking for software developers to help us build out our platform; write IHE Profile data adapters (drivers) to automatically ingress data from hundreds of data sources - both batched and in real time; craft the next generation of healthcare apps; identify the real needs of our customers, and execute on them accurately and quickly; and be technical sherpas helping customers connect to us<p>At CareEvolution, we don&#x27;t give you things to work on. Part of your work at CareEvolution determining your work: you decide what to do. We&#x27;ve designed our organization specifically to promote creativity, innovation, and focus on solving some of the hardest challenges in healthcare.<p>We&#x27;d love to talk to you if you have experience with healthcare technologies like CDA&#x2F;CCD&#x2F;CCDA; IHE profiles like PIX, XDS, XCPD, XCA, XDR; and HL7<p>We&#x27;re a small team - still under 100 people (and all technical!) - but our platform manages health data for over 100 million people.<p>Check out our listing on StackOverflow: <a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;171879&#x2F;healthcare-interoperability-software-developer-careevolution\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;171879&#x2F;healthcare-interoperab...</a> .<p>Visit our website at <a href=\"https:&#x2F;&#x2F;www.careevolution.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.careevolution.com&#x2F;</a> - or visit our recruiting portal at <a href=\"http:&#x2F;&#x2F;letsfixhealthcare.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;letsfixhealthcare.com&#x2F;</a><p>Submit resumes to resume@careevolution.com<p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.","time":1525188103,"type":"comment"}