{"by":"caseyrabiea","id":16968373,"parent":16967543,"text":"The Trade Desk | Full Time, Onsite &amp; Remote | New York NY, San Jose CA, San Francisco CA, Aliso Viejo CA, Ventura CA, Boulder CO, Denver CO, Bellevue WA, London UK, Sydney AUS, Shanghai CN<p><i>Hiring: All levels of software engineers, as well as front-end focused developers who are comfortable with data-access design, development and optimization. You might be a great fit for The Trade Desk&#x27;s dev team if:<p></i> You are a full-stack engineer who wants to work everywhere, not just a small subset of components. Experience &#x2F; interest in working in a variety of layers and technologies within a SOA is a must for our team. This includes: client-side React &amp; Redux, MVC-based web architecture, external RESTful APIs, distributed (and in our case, highly scaled) request handling services, no-SQL and relational SQL databases, many-layered data pipeline (e.g. data bus architecture, Hadoop &#x2F; MPP data warehouse, etc.) that moves hundreds of thousands of items per second, and data visualization (e.g. Tableau). Experience in all these layers is not strictly required, but we do like to see experience working in more than one, as well as eagerness to work on projects that might slice through them all.<p>* You have product-driven software development experience using a modern, object-oriented language. Memory-managed languages are best -- .e.g. C#, Java, Python, Ruby, etc. We do most of our work in C#&#x2F;.Net, but specific experience here is not required.<p>Cool stuff about TTD:<p>* Our platform processes 8million+ queries per second<p>* Work with the best engineering team in AdTech<p>* The combination of huge data sets, high throughput, low latency and amazing scale means that we&#x27;re constantly solving some of the biggest challenges in computer science.<p>* We&#x27;ve grown faster than any other adtech company in the industry, and have been recently recognized as one of the fastest growing companies in America by Inc. Magazine and Deloitte.<p>* Amazing Company Culture<p>* Top-tier benefits<p>If you&#x27;re interested, please apply directly on our website: <a href=\"https:&#x2F;&#x2F;www.thetradedesk.com&#x2F;join-us&#x2F;open-positions\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thetradedesk.com&#x2F;join-us&#x2F;open-positions</a><p>*Note: We are also hiring a NoSQL DBA (Aerospike - remote or onsite), SQL DBA&#x27;s, entry level Site Reliability Engineers (Boulder CO and Ventura CA), Mid-Senior Level Site Reliability Engineers (all levels - remote or onsite), Business Intelligence Analysts (NYC, Sydney AUS), Integrations Managers (NYC), Sr. Data Scientists (Boulder CO, NYC, London, Ventura CA), Application Support (NYC, Ventura CA).","time":1525191244,"type":"comment"}