{"by":"gault8121","id":16968265,"parent":16967543,"text":"Quill.org | Senior Product Manager | New York, NY | ONSITE, SALARY: 80k-140k, <a href=\"https:&#x2F;&#x2F;www.quill.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quill.org&#x2F;</a><p>Quill.org is an open source web app that helps low-income K-12 students become great writers and critical thinkers. Quill is now being used by 900,000 students from 5,000 schools across the country, and we are a nonprofit funded by foundations such as the Bill &amp; Melinda Gates Foundation, Google.org, and the Pineapple Fund.<p>30 million low-income students in the United States struggle with writing, and we aim to help all of these students become confident writers and critical thinkers in the next 10 years. To see how writing instruction is a game changer for students, please check out this Atlantic article: <a href=\"https:&#x2F;&#x2F;theatln.tc&#x2F;2aJnEfU\" rel=\"nofollow\">https:&#x2F;&#x2F;theatln.tc&#x2F;2aJnEfU</a><p>We are looking for a senior product manager who has 4+ years of experience leading product teams and is passionate about education and open source development. The PM’s primary responsibilities will be managing our engineering and design teams and overseeing all of our projects.<p>We’re a small team of eleven working in the Financial District of New York City. You will be joining as our first PM, and you will be directly involved with both building the app and testing it with students in classrooms.<p>Fast Company recently featured Quill and explored how our automated writing feedback helps students revise their work and improve their skills: <a href=\"https:&#x2F;&#x2F;www.fastcompany.com&#x2F;40458272&#x2F;this-machine-learning-powered-software-teaches-kids-to-be-better-writers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fastcompany.com&#x2F;40458272&#x2F;this-machine-learning-p...</a><p>To view the full job description and apply, please visit our AngelList post at: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;quill-org&#x2F;jobs&#x2F;357770-senior-product-manager\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;quill-org&#x2F;jobs&#x2F;357770-senior-product-manage...</a>","time":1525190678,"type":"comment"}