{"by":"YuriNiyazov","id":16968900,"parent":16967543,"text":"Academia.edu | Full Stack Engineer | San Francisco, CA | Onsite<p>Academia is building an open-science platform to bring the world’s research online, available to all, for free.  With over 60 million registered users, Academia is rapidly transforming the way researchers share their work.  We’re a small team of 25 people, passionate about building great software to open up science.  In 2016, we raised $11 million to fuel the growth of the platform and the team.<p>The present model for publishing academic papers is called the prestige model.  In this model, academic journals recruit professors to publish in their journal.  The paper is peer reviewed by 2 or 3 people, and then published.  This process takes 2-3 years (which is about how long it took 120-years ago).  The paper is then made available behind a paywall, and is accessible for $50-$100.  In this model, an average citizen would need to spend thousands of dollars in order to learn the latest research on any topic.<p>Academia’s mission is to democratize academic publishing, making academic papers available and accessible to anyone (not just academic elites), anywhere, on any device, in any language, for free.<p>The problem with the prestige model is several fold: the paper is reviewed by only 2 or 3 people, which isn’t a strong quality signal in today’s world.  Only a few people (100s) actually read papers published in journals, whereas in Academia’s platform, some papers get thousands of readers.  In Academia’s platform, papers get &gt;69% more citations.  And, in Academia’s platform publishing model, the papers are free, accessible to anyone.  <a href=\"http:&#x2F;&#x2F;journals.plos.org&#x2F;plosone&#x2F;article?id=10.1371&#x2F;journal.pone.0148257\" rel=\"nofollow\">http:&#x2F;&#x2F;journals.plos.org&#x2F;plosone&#x2F;article?id=10.1371&#x2F;journal....</a><p>As a result of Academia’s disruptive movement into Academic publishing, we’ve become the world’s largest distributor of academic papers.  In addition to our over 60M registered users, we now have over 6.5M monthly actives, and over 30M unique visitors every month.<p>With the release of our Premium product, we’ve gone cash flow positive; i.e. we’re generating more cash than we’re spending.  When our investors heard about this news, they put more money into our company (an influx of $11M in the last year).  We now have enough cash to move out of our single-threaded development model; we’re deepening our free offering, and widening our revenue producing products and features.  As a result, our valuation has grown substantially.<p>Due to our cash flow positive results and these recent investments, we’ve decided to grow our company.  We’re 25 employees, with 17 in engineering.  We expect to double in size during the next year, so there are many interesting, exciting, and provoking technical and business challenges at our company.\nWe’re located 2+ blocks from Montgomery BART in downtown San Francisco.<p>We’re a Ruby on Rails shop, with React on the frontend.  All of our engineers are full stack, and virtually all of them are computer scientists.  We value and recruit computer science generalists at Academia.  All of our development teams are product engineering teams.  Our teams consist of 1 PM, 1 Designer and 2-4 engineers.<p>Why don’t you ping me?  I’m Director of Infrastructure Engineering at Academia. yuri at academia dot edu","time":1525194162,"type":"comment"}