{"by":"jwoah12","id":16968923,"parent":16967543,"text":"BAMTECH Media | Sr. Software Engineer | NYC | ONSITE<p>BAMTECH Media is the technology and digital media company spun out of MLB Advanced Media, providing end-to-end video streaming solutions over web, mobile, and connected devices. Our platform powers media experiences for partners including MLB, NHL, ESPN+, Eurosport, WWE and more (we&#x27;re building the Disney streaming service - <a href=\"https:&#x2F;&#x2F;www.theverge.com&#x2F;2017&#x2F;8&#x2F;8&#x2F;16115254&#x2F;disney-launching-streaming-service-ending-netflix-deal\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theverge.com&#x2F;2017&#x2F;8&#x2F;8&#x2F;16115254&#x2F;disney-launching-...</a>). We operate at the cutting edge of digital media at a time when more people than ever are choosing to consume their media over the internet.<p>The Content Engineering (CE) org builds the systems at BAMTECH that interface with content providers and enable internal and external consumers for all of our partners to access media content and metadata. From live and VOD media on ESPN+ to team lineups and editorial articles on MLB.com to live and replay games on NHL.tv, CE’s services and applications enable us to make content available to anyone that needs it.<p>Content Engineering is looking to hire a Senior Software Engineer to lead front-end development of a brand new media-centric Content Management System. This CMS will allow Programming&#x2F;Editorial to curate the content that appears in our products, view&#x2F;update media metadata, and manage operational tasks.<p>As a Software Engineer on the CMS team, you&#x27;ll be part of a collaborative group of developers who are serious about delivering quality software. You&#x27;ll also be encouraged to spend some of your time each sprint on professional development: take an online course, experiment with a new technology, or work on an internal side project. We welcome candidates of all backgrounds and are actively working to foster a diverse team and organization. The interview process consists of a 45-minute online&#x2F;phone interview followed by a 4-hour onsite interview consisting of 4-5 technical sessions with team members. If interested, please reach out to me directly (details in profile). Only candidates themselves, please.","time":1525194329,"type":"comment"}