{"by":"59243","id":16968057,"parent":16967543,"text":"Expensify - Portland, OR, San Francisco, CA Full Stack Engineer, Mobile Engineer, Infrastructure Engineer<p>Hey there! Allow us to introduce ourselves. We are Expensify and we do “expense reports that don’t suck!” (Google “expensify” to read more.) We’re getting crushed under an ever-growing pile of super awesome work, and I need one bright soul to help us dig our way out. I can guarantee you fun, an amazing opportunity to learn, and the siren’s call of distant riches. But only if you are all of the following:<p>- An incredibly hard worker, even when it’s not so fun. There is a ton of work to do, and a lot of it downright sucks. After all — we do the sucky work so our customers won’t need to. I need you to buck up and grind through server logs, user emails, source code, and bug reports, without complaint or supervision, and come back asking for more.<p>- A cool person to be with. Not a crazy party animal, just someone we can trust, rely upon, hang out with, bounce ideas off of, and generally interact with in a positive way, both personally and professionally. In fact, this is one of the most stringent requirements we have: would you be fun to hang out with day and night on some remote, exotic beach? This isn’t a rhetorical question, either: every year we take the company overseas for a month and work incredibly hard while having a ton of fun. We’ve done Cambodia, Thailand, Turkey, Croatia, Portugal and Uruguay. Our most recent trip was Uruguay in January, where do you want to go next?<p>- Super talented, in a general way. We’re going to throw a ton of work at you of every possible sort, and you need that magic skill of being able to figure it out even if you have no idea where to start. On any given day you might bounce between super low-level coding, super high-level technical support, marketing-driven data-mining, updating our user documentation, inventing&#x2F;designing&#x2F;building some new feature, etc. This is not a code monkey job — you’re going to be a full participant in the process, and you need to bring your own unique blend of skills to the table.<p>- Specifically talented in a programming way (or if not, shoot as an email anyways!). You can instantly visualize solutions to problems big and small. Your code is always clean, well commented, has good nomenclature and indentation. You can switch on a dime between C++, PHP, Bash, Cron, HTML, CSS, JavaScript, jQuery, Dwoo, SQL — not because you know them all, but because you’re the sort of person who can just pick it up and figure it out.<p>If you’re this sort of person, you’ll know what I mean. If not, then this position isn’t for you. And there are a bunch more, but odds are if you got this far, nothing I can do would stop you from applying. That’s a problem because while I know you are awesome, it’s actually really hard and time consuming to find you in the midst of the literally hundreds of other applications I get from everyone else. So this is where I’m going to ask my first favor: can you make it really easy and obvious how great you are, so I don’t accidentally overlook you?<p>There are probably many ways to do that. But the easiest way to do that is to check out we.are.expensify.com and send in an application(which you can find at <a href=\"http:&#x2F;&#x2F;we.are.expensify.com\" rel=\"nofollow\">http:&#x2F;&#x2F;we.are.expensify.com</a>) or email us at jobs@expensify.com. We are excited to hear from you!","time":1525189639,"type":"comment"}