{"by":"KasianFranks","id":16967589,"kids":[16967760,16978500],"parent":16967543,"text":"Smart Baskets for Cryptocurrency | Valletta, Malta &amp; San Francisco, CA | FTEs, INTERNS, REMOTE or ONSITE | Algo, Data &amp; Software Engineers - Python, NLP, advanced sentiment analysis, quant &amp; hedge fund analytics<p>Company:<p><a href=\"https:&#x2F;&#x2F;vectorspace.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;vectorspace.ai</a> - Advanced Natural Language Processing (NLP) &amp; Sentiment Analysis for Smart Cryptocurrency Basket Trading.<p>Which groups of cryptocurrencies are beating the market? Why? What do they have in common? How strong are those relationships? Are those relationships well known and obvious or are they hidden relationships? Are the relationships numerical or nonnumerical based on concepts, context and sentiment or a combination of both?<p>These are the questions our platform is designed to answer. It&#x27;s based on a combination of context-controlled sentiment analysis and aan advanced cryptocurrency NLP and Machine Learning discovery engine that enables a user to automatically generate a token basket or “mini-index fund” made up of cryptocurrencies that are related to trends in news, global and local searches, concepts, context, keywords, hashtags, social media, URLs and other dynamic content.<p>More: <a href=\"https:&#x2F;&#x2F;vectorspace.ai&#x2F;assets&#x2F;Vectorspace_Whitepaper.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;vectorspace.ai&#x2F;assets&#x2F;Vectorspace_Whitepaper.pdf</a><p>Algorithms &amp; Tech:<p>We&#x27;re a Python &amp; Tcl house at the core. We sit on top on Linux most of the time on the ground and in the cloud. We&#x27;re made up of data engineers, scientists, quants and cryptocurrency and trading vehicle experts. We&#x27;re in on-going collaboration with Lawrence Berkeley National Laboratory in the area of Life Sciences related to human healthspan.<p>What we&#x27;re looking for:<p>We&#x27;re serial technical &amp; scientific founders and sometimes the bane of the music industry [1]. We&#x27;re essentially a startup that&#x27;s funded by a variety of cryptocurrency trading vehicles including our own. We have experience founding and running public companies and private startups in the areas of advanced NLP, finance, music and genomics. We&#x27;re looking for people that may want to start their own venture one day while also being able to roll up their sleeves and cut some interesting code. It&#x27;s as simple as that.<p>Contact:<p>info@vectorspace.ai<p><a href=\"https:&#x2F;&#x2F;vectorspace.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;vectorspace.ai</a><p>Telegram: <a href=\"https:&#x2F;&#x2F;t.me&#x2F;joinchat&#x2F;GrCYjA8rPgD8coAiEhRuBA\" rel=\"nofollow\">https:&#x2F;&#x2F;t.me&#x2F;joinchat&#x2F;GrCYjA8rPgD8coAiEhRuBA</a><p>[1] <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;startup-frontier&#x2F;steve-jobs-made-warner-music-sue-my-startup-9a81c5a21d68\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;startup-frontier&#x2F;steve-jobs-made-warner-m...</a>","time":1525187089,"type":"comment"}