{"by":"eob","id":16968875,"parent":16967543,"text":"Instabase | Machine Learning Engineer | San Francisco and NYC | careers@instabase.com<p>About Instabase<p>Founded in 2015, Instabase is a cross-cloud operating system with a powerful suite of data processing applications. We have taken $23M Series A funding from Andreessen Horowitz, Greylock, and NEA, and we have strong customer and revenue growth. Instabase is used in universities (Stanford, Columbia) and large financial institutions in Asia and the US, both as a platform for collaboration and a tool to automate human-intensive workflows. We are a small team, ~15 with 90% engineers, scaling rapidly driven by customer demand. We do core R&amp;D, product management, sales, customer success --- the whole product experience!<p>Job Description<p>We take the latest techniques from research labs around the world, evaluate them against each other, and adapt them into products for use in industry. Living at at that edge of research and production is the “secret ingredient” that powers many of our capabilities as a platform.<p>As a machine learning engineer, you will be responsible for writing and maintaining Instabase&#x27;s machine learning stack. This role includes developing specific models that enable new apps, designing general-purpose machine learning infrastructure for customer use, and helping design end-user apps that make machine learning capabilities more accessible. We have the benefit of close customer relationships and fantastic dataset access to inform our work: what you do at Instabase makes an immediate impact on our customers’ capabilities.<p>We look for people who have a bias toward action, who enjoy finding patterns amid chaos, and who are capable of driving a project from whiteboard sketches to completion.<p>Working in this area requires knowledge in one or more of the following:<p>-  Languages: Python, Go, C++<p>-  Frameworks: OpenCV, NumPy, Tensorflow, Keras, SpaCy<p>-  Mindset: Strong ability to translate ML fundamentals into applications","time":1525193997,"type":"comment"}