{"by":"herbps10","id":16967678,"parent":16967543,"text":"Silent Spring Institute | Newton, MA | ONSITE | Software Engineer\nWe’re looking for a web application engineer to lead our efforts to design digital tools to communicate research about harmful chemicals in everyday environments.<p>We measure chemical levels in people’s environments and in their bodies—even a New York Times columnist Nicholas Kristof was tested in one of our studies: <a href=\"http:&#x2F;&#x2F;nyti.ms&#x2F;2CdcyQ4\" rel=\"nofollow\">http:&#x2F;&#x2F;nyti.ms&#x2F;2CdcyQ4</a>! We built a web application to help us return individual results in an understandable way to the people who were tested. We need your help turning it into a scalable tool that can be used by more studies to reach tens of thousands of participants. Here’s a description of some of our work so far: <a href=\"https:&#x2F;&#x2F;ehp.niehs.nih.gov&#x2F;EHP702&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ehp.niehs.nih.gov&#x2F;EHP702&#x2F;</a>.<p>Silent Spring is relentlessly asking tough questions about the chemicals in our homes and in the products we buy. You’ll be there with us, helping us communicate our findings to create conscious consumers and healthier communities.<p>You will have opportunities to develop new software tools or lead data science projects, for example, analyzing environmental health data, developing new R packages, or creating novel visualizations of our unique datasets. You will help develop new smartphone tools, like Detox Me (<a href=\"https:&#x2F;&#x2F;silentspring.org&#x2F;detoxme&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;silentspring.org&#x2F;detoxme&#x2F;</a>) to collect data on the products people are using and track interventions to their reduce exposures.<p>This is a full time position. We offer competitive salaries, 4 weeks vacation plus holidays, health insurance, and other benefits.<p>More information: <a href=\"https:&#x2F;&#x2F;silentspring.org&#x2F;opportunities-silent-spring-institute#SoftwareEngineer\" rel=\"nofollow\">https:&#x2F;&#x2F;silentspring.org&#x2F;opportunities-silent-spring-institu...</a> To apply: Send a cover letter and resume to careers@silentspring.org","time":1525187623,"type":"comment"}