{"by":"avivo","id":16969521,"parent":16967543,"text":"Center for Social Media Responsibility | Senior Research Engineer | San Francisco, Ann Arbor, or remote | Visa (H1B Cap Exempt) | Full-Time (or Part-Time&#x2F;Fellow for the right person) | <a href=\"https:&#x2F;&#x2F;www.si.umich.edu&#x2F;research&#x2F;center-social-media-responsibility\" rel=\"nofollow\">https:&#x2F;&#x2F;www.si.umich.edu&#x2F;research&#x2F;center-social-media-respon...</a><p>The Center for Social Media Responsibility’s (CSMR) mission is to ensure that the social media platforms that impact our public discourse (Facebook, YouTube, Twitter, etc.) are designed and operated with the responsibility that befits their scale and power.<p>A core CSMR focus area is the creation of &quot;Platform Health Grades&quot;—a set of metrics that capture the positive and negative impacts of platforms on discourse—on challenges like misinformation, harassment, polarization, etc. Platforms and teams are rewarded for shipping products and moving metrics; so we are focused on creating useful metrics that inform the product creation, evolution, and measurement processes, leading to both internal and external accountability.<p>As the Senior Research Engineer, you will be the lead engineer for Platform Health Grades and other key projects. This involves designing, developing, and owning the core data infrastructure, as well as executing and owning the data collection and analysis components. You will be ingesting data from sources including platform firehoses, scraped websites, and a variety of partners; and classifying and aggregating that data, working with UMSI researchers and other partners. The ideal candidate would be excited to have a formative impact in a fast-paced organization focused on ensuring that technology serves humanity.<p>CSMR is part of the University of Michigan School of Information, and this position could be based in Ann Arbor, San Francisco, or remote. The ideal candidate would be a full-time employee, but part-time, contract, or a fixed term fellowship is also possible.<p>Contact csmr-info@umich.edu if you’re interested in learning more.","time":1525197494,"type":"comment"}