{"by":"aliuy","id":16969295,"parent":16967543,"text":"Azure Cosmos DB (Microsoft) | Engineering + Product Management + Marketing | Seattle, WA | Onsite Only | Full-Time | <a href=\"https:&#x2F;&#x2F;www.joincosmosdb.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.joincosmosdb.com&#x2F;</a><p>Azure Cosmos DB is a globally distributed, multi-model database-as-a-service featuring:<p>•\tTurnkey Global Distribution - automatically replicate data to any number of regions worldwide to achieve high availability and low-latency for global user base at the click of a button... complete with tunable well-defined consistency semantics.<p>•\tMulti-model - use key-value, graph, column, and document data in one service, at global scale and without worrying about schema or index management.<p>•\tElastic Scale - elastically and transparently scale-out storage and throughput to seamlessly scale from 100&#x27;s of requests per second to 100,000,000&#x27;s of requests per second over a petabyte of data.<p>•\tGuaranteed low latency - write-optimized, latch-free database engine that guarantees &lt;10ms @ P99 for single-document reads and &lt;15ms @ P99 single-document writes.<p>•\tFully-Managed w&#x2F; comprehensive SLAs - complete with 99.99% Availability SLA along with extra guarantees on throughput, latency, and consistency.<p>Our team is consistently amongst the fastest growing foundational services in the Microsoft Azure platform; and has ambitious plans to go much further in the coming years. You can find a brief recap of our 2017 accomplishments here: <a href=\"https:&#x2F;&#x2F;azure.microsoft.com&#x2F;en-us&#x2F;blog&#x2F;azure-cosmosdb-recap-of-2017&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;azure.microsoft.com&#x2F;en-us&#x2F;blog&#x2F;azure-cosmosdb-recap-...</a><p>We are hiring across the board: software engineers, program managers (aka product managers), and product marketing managers. We’re looking for folks with a strong technical background balanced with great customer empathy, excellent communication skills, and the scrappiness + tenacity to get shit done.<p>For more information, get in touch with us by sending in a cover letter (describe your interests and why cosmos db?) along with a resume at joincosmosdb [at] microsoft [dot] com.","time":1525196259,"type":"comment"}