{"by":"dallasdev","id":16973211,"parent":16967543,"text":"Mr Cooper | Full Stack Developer &amp; Sr Software Engineer | Dallas, TX | Onsite<p>We’re here to keep the dream of home ownership alive. Oh, and while we’re at it, we’re determined to change the lending industry itself. It’s simple, but it won’t be easy. And we’ll need a great team behind us. (That’s where you come in.) We want to show the world that transparency, candor and collaboration aren’t just good values. They’re good business. Working here isn’t for people who want to punch a clock. It’s for people who want to punch a hole in the status quo. Come join us. And make a difference instead of just a living.<p>We need someone who’s up to speed with the latest client-side frameworks, techniques and technologies. We need someone who’s great at working collaboratively with other teams, and knows how to take a project from conception to analysis, prototyping, visual design, and implementation. Most of all, we need someone who always keeps the customer’s viewpoint front and center at every phase of every project. (If you’re good at ping pong, that’s a plus too.)<p>Our Product team lives and breathes Agile methodology (Extreme Programming, to be specific). Devlopers work closely with product managers, engineers, and outside business stakeholders to launch products quickly and improve them constantly, based on real feedback. Your background in enterprise application development will be a major asset to the team as we create modern apps that can integrate with traditional enterprise systems.<p>Tech stack: ReactJS, Redux, NodeJS, Springboot, Ruby on Rails.<p>You can apply at:<p><a href=\"https:&#x2F;&#x2F;www.mrcoopercareers.com&#x2F;en-US&#x2F;job&#x2F;full-stack-developer-2025&#x2F;J3M46N6XZLCP4YB4WBW\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mrcoopercareers.com&#x2F;en-US&#x2F;job&#x2F;full-stack-develop...</a>\n<a href=\"https:&#x2F;&#x2F;www.mrcoopercareers.com&#x2F;en-US&#x2F;job&#x2F;sr-full-stack-web-developer-1742&#x2F;J3Q82B70W5D984PQFGZ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mrcoopercareers.com&#x2F;en-US&#x2F;job&#x2F;sr-full-stack-web-...</a>","time":1525222711,"type":"comment"}