{"by":"indirectlylit","id":16970708,"parent":16967543,"text":"Learning Equality | Full-stack web developer | San Diego, CA | <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;</a> | ONSITE | Full-time<p># Who we are<p>We’re a cross-disciplinary team who believe in the transformative power of learning. Our software is open-source, our org is not-for-profit, and our primary users are in underserved communities such as rural schools and refugee camps.<p>We’re building Kolibri [1], an offline-first application that makes high-quality education tools and content available in low-resource contexts. We&#x27;re also building a supporting ecosystem of tools and training materials. This all builds on previous work which now reaches millions of learners in hundreds of countries [2].<p>In the past two years we’ve: received substantial funding, e.g. from Google.org; doubled our team size with a focus on pedagogy and training; added dozens of languages and thousands of openly-licensed resources; begun deployments with partners around the world, including UNETE, the MFE Nalanda project, Vodafone Foundation and UNICEF Uganda<p># Who you are<p>You are an experienced full-stack developer who is comfortable with ORMs, relational databases, API design, modern JS web frameworks, build tooling, and automated testing.<p>You want to use your skills to have a positive impact on the world, and our core values [3] resonate with you. You take pride in your craft and think carefully about the needs of your users.<p># Links and references<p>Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;4t6yqj1\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;4t6yqj1</a><p>[1] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;learningequality&#x2F;kolibri\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;learningequality&#x2F;kolibri</a>\n[2] <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;map&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;map&#x2F;</a>\n[3] <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;values&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;values&#x2F;</a><p>Feel free to email with questions: &#x27;devon&#x27; at our domain name","time":1525203746,"type":"comment"}