{"by":"jeandenis","id":16971142,"parent":16967543,"text":"Plaid | Software Engineer | San Francisco, CA | equity + benefits | ONSITE, Full-time, <a href=\"https:&#x2F;&#x2F;plaid.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;plaid.com&#x2F;</a><p>* About Me *<p>Hello HN! My name is Jean-Denis Greze and I&#x27;m the Head of Engineering at Plaid. I helped grow Dropbox from 100 engineers to 600+. I joined Plaid because I believe in their mission to empower the consumer financial revolution and believe we are uniquely positioned to drive change in the industry.<p>* About Us *<p>We provide a single API on top of the U.S. financial system and help companies like Venmo, Coinbase, Lending Club, Square Cash, and Robinhood handle banking data. Being at the epicenter of Fintech allows us to pursue everything from the Bitcoin frenzy to the revolution happening in Home Mortgages. We are a mature and enthusiastic workplace excited to grow from 120 (48 engineers) to 200+ employees in 2018.<p>* About You *<p>We&#x27;re looking for experienced software engineers with 3+ years experience in SRE, Backend, Product, Security, or Data Science. Our tech stack includes Node.js, Typescript, and Go, and while we love experience with these technologies we get excited about anyone comfortable stepping into a new environment. We value transparency, humility, and intellectual honesty.<p>* Get in Touch *<p>You can learn more about us at <a href=\"https:&#x2F;&#x2F;plaid.com&#x2F;company&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;plaid.com&#x2F;company&#x2F;</a> and see our open roles at You can learn more about us at <a href=\"https:&#x2F;&#x2F;plaid.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;plaid.com&#x2F;careers</a> . Reach out to me directly at greze+hn@plaid.com with a sentence or two about yourself and either your LinkedIn profile or your resumé.<p>Tech Buzzwords: Node.js, Python, Go&#x2F;Golang, Typescript, AWS, Redshift, EC2, ECS, S3, ElasticSearch, Spark.<p>Company Buzzwords: $60 million raised, Series B. Catered Lunch, Dinner. Health+Vision+Dental+Life, Monthly team events. Wellness + Transportation Benefits, Uber&#x2F;Lyft credits. Flexible Hours&#x2F;WFH. Unlimited PTO (three week minimum).","time":1525206174,"type":"comment"}