{"by":"ganonm","id":16972441,"parent":16967543,"text":"Ai Build | London, UK | Backend&#x2F;Frontend&#x2F;Fullstack Software Engineers, Data Scientists| Full-time | ONSITE\n<a href=\"http:&#x2F;&#x2F;ai-build.com&#x2F;technology.html\" rel=\"nofollow\">http:&#x2F;&#x2F;ai-build.com&#x2F;technology.html</a><p>We are an early-stage startup developing large-scale, autonomous 3D printing technology to provide the factory of the future to our customers. We utilise industrial 6-axis robots combined with plastic extruders to print large scale structures and objects (often at a scale of meters). Our current focus is on development of the web platform that is used for managing the printers and generating toolpaths. We are also constantly investing effort into developing our core printing algorithms further.<p>Tech stack: Dropwizard (Java 8, Kotlin), PostgreSQL, React, Redux, NGINX, Docker, Terraform<p>We are hiring for several roles<p>- Frontend (required: 1+ years experience with React, CSS &amp; HTML. Beneficial: experience with 3D programming e.g. ThreeJS, familiarity with REST APIs)<p>- Backend (required: 1+ years experience with a JVM server framework, REST, Strong grasp of computer science fundamentals. Beneficial: mathematical background&#x2F;strong knowledge of data structures&#x2F;algorithms)<p>- Data Science (required: 1+ years experience implementing modern machine learning techniques in a professional or academic capacity, familiarity with software engineering practices e.g. version control and application architecture. Beneficial: PhD in closely related area, prior experience working as a software engineer and&#x2F;or a computer science degree)<p>You will be joining at an early stage and thus will have a large say in how we progress our technology. We are hoping to find fellow engineers who care about code quality and modern software engineering best practices. We aren&#x27;t into micro-managing and prefer people who have the ability to work independently with minimal guidance.<p>If you are interested, please contact us at jobs@ai-build.com","time":1525214726,"type":"comment"}