{"by":"axiomds","id":16973022,"parent":16967543,"text":"Axiom Data Science | Portland, OR | Full-stack Sensor Web Engineer | <a href=\"https:&#x2F;&#x2F;axiomdatascience.com\" rel=\"nofollow\">https:&#x2F;&#x2F;axiomdatascience.com</a><p>Axiom Data Science is a technology and informatics firm working towards increasing the accessibility, reuse, and impact of scientific data. We specialize in developing data management systems, intuitive web-based data portals, and scalable solutions for organizing and analyzing large amounts of diverse datasets.<p>We are a small, 20-person company that values user experience. Our employees are self-driven, resourceful, and instrumental in expanding our vision.<p>As a full-stack web engineer you will develop brand-new features and extend current capabilities of our web-based scientific data management tools. This will include development of key features in support for our scientific data management platform, the Research Workspace. You will also likely participate in projects related to our integrated data visualization platform. Development work will span the full web stack include user interface development, web service APIs, and data storage. For frontend features, you will be responsible for collaborating with users to create and test your design.<p>Full-time, ONSITE (some work from home is OK but you must live in the Portland, OR metro area and work primarily in the office)<p>Tech sample: Docker, JavaScript, Java, Python, Node.js, Play Framework, Webpack, Backbone.js, Marionette, Angular, Postgres, GlusterFS, Redis, ElasticSearch, MongoDB, Kafka, Ansible, Nagios, and Prometheus.<p>Full job description: <a href=\"https:&#x2F;&#x2F;l.axds.co&#x2F;2jnrYFY\" rel=\"nofollow\">https:&#x2F;&#x2F;l.axds.co&#x2F;2jnrYFY</a><p>Salary DOE, 85K-110K. Benefits include five weeks paid leave, flexible holidays, health benefits, 401K contributions, and a gym membership.<p>Send a resume to careers@axds.co by June 1, 2018.<p>The following additional application materials are recommended, but not required: code samples, profile links to GitHub&#x2F;StackOverflow; descriptions and screenshots of a completed project; and other examples of expertise or open source participation.","time":1525220441,"type":"comment"}