{"by":"joshfraser","id":16971405,"parent":16967543,"text":"Origin Protocol (<a href=\"https:&#x2F;&#x2F;www.originprotocol.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.originprotocol.com</a>) is a blockchain project focused on building the sharing economy without intermediaries. We&#x27;re creating protocols to allow buyers and sellers of fractional usage assets and services (think Airbnb, Getaround, Fiverr, Taskrabbit) to transact without paying middlemen 20-30%. We&#x27;re excited by the opportunity to promote free and transparent commerce and redistribute value to the contributors to the network instead of just the founders and VCs. We believe the open source protocols we&#x27;re developing could ultimately replace dozens of existing multimillion or multibillion dollar businesses.<p>We&#x27;re experienced founders who have built and sold multiple businesses in the past. Origin is the most ambitious idea we&#x27;ve tackled to date (hopefully on the right side of crazy). We currently have a working MVP built on Ethereum and IPFS. We&#x27;re looking for all sorts of people to join our team, whether you code in react, python or solidity. We&#x27;re a distributed team, 100% open-source and open to remote.<p>We&#x27;re backed by well known investors like Pantera Capital, Foundation Capital, Garry Tan, Alexis Ohanian and many more. (<a href=\"https:&#x2F;&#x2F;medium.com&#x2F;originprotocol&#x2F;announcing-origin-protocols-successful-strategic-round-36c9779a356e\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;originprotocol&#x2F;announcing-origin-protocol...</a>)<p>You&#x27;ll get the chance to work alongside engineering legends like Yu Pan who was part of the founding team of PayPal and the 1st engineer at YouTube. (<a href=\"https:&#x2F;&#x2F;medium.com&#x2F;originprotocol&#x2F;welcoming-yu-pan-to-the-origin-team-fcce3e3a2166\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;originprotocol&#x2F;welcoming-yu-pan-to-the-or...</a>)<p>Ping us at founders@originprotocol.com if you&#x27;re interested, or better yet, join our public Discord group and start engaging with our distributed engineering team there (<a href=\"http:&#x2F;&#x2F;www.originprotocol.com&#x2F;discord\" rel=\"nofollow\">http:&#x2F;&#x2F;www.originprotocol.com&#x2F;discord</a>).","time":1525207568,"type":"comment"}