{"by":"jfbriggs","id":16972613,"parent":16967543,"text":"Scoop | San Francisco, CA | Full-Time, Onsite | <a href=\"https:&#x2F;&#x2F;www.takescoop.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.takescoop.com</a><p>Scoop brings co-workers and neighbors together to enjoy a smooth carpooling experience—unlocking new opportunities to create friendships, improve their well-being, and make the most of their valuable time.<p>Few companies get to face such diverse technical challenges as Scoop, and we’ve built a team of people excited to face these challenges together while investing in each other’s growth.<p>Scoop’s engineering team may move bits and pixels, but we also put real, live human beings in cars together. We’re touching problems academics have written about for years, and have data that no other company has ever collected.<p>Scoop, however, knows engineering is not a lone discipline. We’re a small team with varied backgrounds: big companies, VC-backed startups, bootcamps, academia, etc. We like to build together, and we like to learn together. Our entire team and process are built around helping you grow and be successful, and we’d love to tell you more about the impact you could have at Scoop.<p>====<p>We’re prioritizing looking for:<p>iOS&#x2F;Android Engineer: In these roles (we’re looking for someone for each), you’ll be part of a small team working on Scoop’s mobile apps.  You can count on building new features&#x2F;screens, implementing complex business logic, and leveraging iOS&#x2F;Android APIs for things like location data; work that will directly impact thousands of commuters on a daily basis.\nTo find out more:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;0738c3b5-3609-42c0-98e4-eb3d349ca34e?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;0738c3b5-3609-42c0-98e4-eb3d...</a> (iOS)\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;64d80e73-9ebc-4a5a-b75a-9f954bcd9991?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;64d80e73-9ebc-4a5a-b75a-9f95...</a> (Android)<p>Platform Engineer:  In this role, you’ll be an important part of building out the platform upon which the Scoop team builds applications.  You’ll focus on both writing new software and deploying existing tools; help scale our build, test, and deployment pipeline; and ensure our product consistently works well for thousands of carpoolers daily.\nTo find out more:\n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;81a66379-655c-4adb-a8e5-3a7b43f331c2?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;81a66379-655c-4adb-a8e5-3a7b...</a><p>Data Engineer:  In this role, you’ll work closely with data scientists and Scoop’s product team to understand their needs and create a platform that empowers them.  Your efforts will include architecting, developing, and deploying infrastructure on which data moves; as well as operationalizing machine learning - from research into fault-tolerant, production-scale deployments.\nTo find out more: \n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;8d1055ac-ac0e-4613-a874-afc0dfeaf9c2?lever-origin=applied&amp;lever-source%5B%5D=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop&#x2F;8d1055ac-ac0e-4613-a874-afc0...</a><p>====<p><i></i>Interested in Scoop, but believe your skills align more closely with a different role?  Visit <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;takescoop</a> to see all of our current openings!","time":1525216288,"type":"comment"}