{"by":"valtjobs","id":16970076,"parent":16967543,"text":"Tufts | Software Developer | Software Engineer | full time | Medford, MA, USA | Onsite<p>We are a team at Tufts University (Boston area) researching data visualizations for machine learning model comparison and selection. Plain English project description: You train a variety of ML models to solve a particular problem. Which is the best model for the task at hand? What can you learn by comparing the models?<p>The project (Data Driven Discovery of Models, aka D3M) is funded by a large grant from the Defense Advanced Research Projects Agency (DARPA). We are looking for a full-time full stack developer (mostly front-end) to join our multi-institutional team of researchers at Tufts, Georgia Tech, and Wisconsin-Madison.<p>This would be a great way for an established front-end dev to get their feet wet in machine learning, or for a dev with ML experience to work on higher-level ML concepts.<p>Our current tech stack: Docker, Node, Vue, D3.<p>The most important skills a candidate would have are front-end development skills in JavaScript, including knowledge of the current state of frameworks such as Vue.js, excellent communication and team skills, and experience in maintaining software over the course of a multiyear project.<p>Responsibilities: software development of front- and back-end visual analytics system for the DARPA D3M project (e.g., Vue client, D3 visualizations, Node server, communication channels between different components would be through Web Socket and gRPC), Team Management (e.g., participation in D3M project meetings, collaboration with the team members, composed of Tufts, Georgia Tech, and Wisconsin-Madison, Collaboration with other teams in the D3M project).<p>Expertise: JavaScript, Python. Experience of working in web-based front-end frameworks like Vue, React, Angular, etc. Must be thoughtful of UI&#x2F;UX. Experience in web-based visualization tools such as D3, Tableau, etc. Knowledge of open-source development and team-collaborative development environments, e.g., GitHub. Experience with integration technologies like Docker, Kubernetes, etc is a plus. Research experience a plus. Basic knowledge of stats&#x2F;data science.<p>Qualification: BS or MS in computer science with 2+ year experience in working client-web based architecture and developing web-based visual analytics tools. Experience developing server-side data management systems is useful. Experience with machine learning would be an additional plus. The BS&#x2F;MS isn&#x27;t a hard-and-fast requirement, but this position will require the theoretical and mathematical background found in traditional CS education routes.<p>Travel: Some travel is required to attend integration exercises at DARPA in DC, including up to 4 weeks in the summer and 2 weeks in the winter.<p>If you are interested, shoot us an email: jobs.valt@gmail.com<p>Or apply online: <a href=\"http:&#x2F;&#x2F;jobs.hr.tufts.edu&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.hr.tufts.edu&#x2F;</a> (job # 18001176)","time":1525200246,"type":"comment"}