{"by":"seregine","id":16970651,"parent":16967543,"text":"Outschool (<a href=\"https:&#x2F;&#x2F;outschool.com\" rel=\"nofollow\">https:&#x2F;&#x2F;outschool.com</a>) | Principal software engineer | San Francisco, CA | ONSITE<p>Outschool (YC W16) is the marketplace of small-group online classes for kids, K-12. Our live video chat format makes awesome learning experiences available to kids around the world. They love it!<p>Already, hundreds of independent teachers are offering thousands of classes in every subject: forensic science, competitive math, storytelling, art, and many more. We’re growing 8x year-over-year, and just raised more funds to expand the team. We want to be every kid’s second school.<p>We are a product-focused team of 6 in SF, with experience in education, marketplaces, software, and operating online services at Udemy, Amazon, Airbnb, YC, Square, Google, and several startups. We have an exceptionally sane work culture for our early stage: no egos, boondoggles or fake urgency. We pay attention to our users and prioritize carefully, start simple, run experiments, then iterate.<p>We&#x27;re now looking for a senior software engineer. It’s an amazing time to join! You would build a new kind of educational service from an early stage, learn and grow with us, and significantly contribute to our success. Everything about our product will evolve, so you&#x27;ll work on a variety of large-scope projects: in-class interactions, teacher tools, messaging, marketplace discovery, metrics, internal process, infrastructure, and more. You’ll contribute to every product area at every layer of the stack. We use modern ES6+ JavaScript, React, GraphQL, Node, and Postgres.<p>We think that the best candidates:<p>* care about learning and education<p>* have been programming professionally and challenging themselves for at least 5 years<p>* prefer to focus on user experience over infrastructure complexity<p>* need a mature perspective on engineering tradeoffs, product decisions, and teamwork<p>* can be effective with minimal process at first, and adopt more structure as the team grows<p>* communicate clearly<p>* have something to teach us<p>If you’re interested and available, please reach out to work@outschool.com","time":1525203393,"type":"comment"}