{"by":"aimeerose","id":16972918,"parent":16967543,"text":"Development Seed | Washington D.C. | Cloud Engineer | Full-time, Onsite | <a href=\"https:&#x2F;&#x2F;developmentseed.org&#x2F;careers&#x2F;cloud-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;developmentseed.org&#x2F;careers&#x2F;cloud-engineer&#x2F;</a><p>Development Seed is an engineering and design shop based in Washington, DC, Lisbon, Portugal and Ayacucho, Peru. We’re a team of twenty-six developers and designers creating positive social impact with open tech and open knowledge alongside organizations like the World Bank, the Washington Post, and NASA.<p>We are looking for an engineer to help us build powerful open tools for managing and distributing data in the cloud. You’ll build reliable, scalable services optimized to deliver petabytes of satellite imagery data to millions of simultaneous users. You will be solving real problems for organizations that address big global challenges. You will be using the best technology available on a team of people that want you to grow and win.<p>You:<p>- Collaborate — Working as a team makes us stronger than any individual developer. You write clear Github tickets and communicate effectively on Slack and in-person.<p>- Learn — We constantly evolve our technology stack and techniques to deliver the best work to our partners. You don’t need to know any particular language or framework upfront but you need to demonstrate you’re able and excited to learn new ways to build. You’ve also tried out enough options to know that the hip new thing isn’t always the best solution.<p>- Code — You write code focusing on both performance and maintainability. You know when to use a quick fix and when to invest more time refactoring.<p>- Care about the world and believe that we can do better — Social change is the foundation of everything we do. You are impatient about solving the world’s toughest challenges.<p>Ideal candidates have 2+ years professional experience with:<p>- Node.js<p>- Amazon Web Services, specifically Cloudformation, S3, Step Functions, ECS, Lambda, Elasticsearch and DynamoDB<p>- Docker<p>If this sounds like you, send your resume to jobs@developmentseed.org. Tell us about yourself and what you’d love to work on at Development Seed.","time":1525219416,"type":"comment"}