{"by":"stacyatdomino","id":16989497,"parent":16967543,"text":"Domino Data Lab | Principal Front-End Engineer | San Francisco, CA<p>Domino has an ambitious vision for data science and machine learning. Our platform helps data science teams accelerate research, increase collaboration, and rapidly deploy predictive models. Our customers are the most sophisticated analytical organizations in the world, including Monsanto, Allstate, and Instacart. Backed by Sequoia Capital, Zetta Venture Partners, Bloomberg Beta, and In-Q-Tel, we are at the epicenter of the data science revolution, helping companies build better cars, develop more effective medicine, or simply recommend the best song to play next.<p>At Domino, we have a maniacal focus on user enablement. We believe software wins hearts and minds with world-class design, usability, and impressive performance. If you agree, we have a mission for you.<p>As Domino’s Lead Front-End Engineer, you will drive adoption and evolution of application front-end frameworks, as well as software development best practices. You will champion our front-end team across engineering, product and design to influence and deliver UI&#x2F;UX into our product.<p>Whether you’re wonky about Angular.js, React, or Vue.js, you work efficiently, you foster a collaborative environment, and you are open to new ideas. You dream in domain models, UI components, and you contribute to design and implement an elegant but comprehensive API that backs up your user experience.<p>Responsibilities<p>Collaborate with product managers and UX designers to understand product requirements<p>Ensure the technical feasibility of UI&#x2F;UX designs<p>Design and establish front-end practices and patterns<p>Develop, maintain and ship user-facing features<p>Build reusable code and libraries for future use<p>Have the technical leadership to make tough design and framework choices<p>Optimize application for maximum speed and scalability<p>Help build a product, team, and company<p>Qualifications<p>Demonstrated track record of technically leading a team to build high quality web applications<p>Deep experience with an SPA framework e.g. React, Angular, Vue<p>Egoless and mission focused<p>Desire to meet world-class data scientists and grok how they work","time":1525378527,"type":"comment"}