{"by":"fnl","id":16980404,"parent":16967543,"text":"Selerity | DevOps&#x2F;SRE | Contract or Full-time | NYC or REMOTE | <a href=\"http:&#x2F;&#x2F;www.selerityinc.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.selerityinc.com&#x2F;</a><p>Senior DevOps (Site Reliability) Engineer to join Selerity’s team, scaling up an A.I. driven analytics and recommendation platform and integrating it into enterprise workflows.  Highly competitive compensation plus significant opportunities for professional growth and career advancement.<p>Location is flexible: We have offices in New York City and Oak Park, Illinois (Chicago suburb) but about half of our team currently works remotely from various parts of Europe, North America, and Asia.<p>Want to change how the world engages with chat, research, social media, news, and data?<p>Selerity has dominated ultra-low-latency data science in finance for several years.  Now our real-time content analytics and contextual recommendation platform is gaining broader traction in enterprise and media applications.  We&#x27;re tackling big challenges in predictive analytics, conversational interfaces, and workflow automation and need your help!<p>We’re looking for an experienced DevOps (Site Reliability) Engineer to join a major initiative at a critical point in our company’s growth.  The majority of Selerity’s applications are developed in Java and C++ on Linux but knowledge of other languages (especially Python and JavaScript), platforms and levels of the stack is very helpful.<p>Must-haves:\n  * Possess a rock-solid background in Computer Science (minimum BS in Comp Sci or related field) + at least 5 years (ideally 10+) of challenging work experience.\n  * Implementation of DevOps &#x2F; SRE processes at scale including continuous integration (preferred: Jenkins), automated testing, and platform monitoring (preferred: JMX, Icinga, Grafana, Graphite).\n  * Demonstrated proficiency building and modifying Java and C++ applications in Linux environments (using Git, SVN). \n  * Significant operations expertise with the Ansible (preferred), Chef, or Puppet deployment automation system in a Cloud environment.<p>Interview Process:<p>If you can see yourself at Selerity, send your resume and&#x2F;or online profile (e.g. LinkedIn) to careers@selerityinc.com.  We’ll arrange a short introductory phone call and if it sounds like there’s a match we&#x27;ll arrange for you to meet the team for a full interview.","time":1525289629,"type":"comment"}