{"by":"michaeldiep","id":16998635,"parent":16967543,"text":"Homij Software Testing and Quality Control\nINTERNS | ON-SITE&#x2F;REMOTE | San Francisco, CA\nTimeline: 10-12 weeks (25-40 hours per week)<p>Organizational Background: Homij is a start-up tech organization that seeks to change the way death and dying is discussed. Our main mission is to connect people by commemorating and sharing stories of the deceased. We encourage everyone to share stories, experiences, and memories of the loved once and instill a supportive community. Homij anticipates to be in a full beta stage by September 2018. More information can be found at: www.homij.org.<p>Position Description: During weeks 1-2 of this internship, interns will become familiar with the intricate aspects of our application, target customer, and needs within the death and dying industry. In weeks 3-4, the intern will work with our mobile development team to generate the common use cases and scenarios that we can see a customer use our platform. The following 7-8 weeks, the intern will be running the designed test cases against our live application, submitting tickets and bug lists to our engineers. By the end of the 12 week period, the candidate will have gained experience with designing and developing test cases for a mobile application. Ideal candidates have experience or interest in doing quality assurance testing for mobile applications. The responsibilities for this candidate includes test design, documentation, review, and execution of these tests. The candidate needs to be able to work collaboratively with others on the development team. We are looking for someone who has great verbal and written communication skill along with the ability to solve complex development problems. We’re looking for someone to fill the gap between our software development and customers. We want you to work with developers and businesses to ensure our product fits the needs of our consumers.<p>Inquiries to: homijgroup@gmail.com","time":1525470334,"type":"comment"}