{"by":"csindia-careers","id":17020310,"parent":16967543,"text":"CognitiveScale | (Senior) Software Engineer (front-end&#x2F;back-end&#x2F;data&#x2F;machine learning) | FULL TIME | Hyderabad, India | ONSITE | Salary + Equity | <a href=\"https:&#x2F;&#x2F;www.cognitivescale.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cognitivescale.com</a><p>We&#x27;re a post-Series B Augmented Intelligence company headquartered in Austin, TX and are looking for multiple talented engineers to work in our Hyderabad office. At CognitiveScale, we work broadly in two different teams:<p>- Developing our flagship product Cortex, an AI platform and marketplace supporting the full SDLC<p>- Using Cortex to develop bespoke solutions for several customers in the healthcare, financial services and e-commerce space<p>In addition, we have just set up an innovation lab out of India for our developers to pair up with academic researchers on exploratory work for potential capabilities. There are interesting problems to be solved including (but not limited to) deep learning and&#x2F;or blockchain-backed features, meta learning, natural language processing, computer vision and speech recognition, ethical AI, etc.<p>We are looking for talented, motivated engineers who have T-shaped skills or want to be part of a great startup success story. We&#x27;re looking for expertise in at least one programming language (Python, Java, Scala) - we don&#x27;t care which one it is though. We pick up the right languages and tools for a task, and we&#x27;re sure you can do the same. Experience with industry-grade deep learning, big data&#x2F;data-engineering and the blockchain will be highly valued.<p>We offer competitive compensation, a great working environment with the latest tech tools to help you work and grow your career, and a genuinely casual work culture where the focus is on getting sh*t done (flexible timings, work-from-home, etc.). Your potential peers are very strong, approachable engineers, both in India and the United States. There is also a lot of cross-pollination between offices and great opportunities for rapid growth are available. The company is committed to keeping employees happy with regular tech seminars, hackathons, fun outings.<p>To apply (or if you have any questions), please reach out to cs-india-careers@cognitivescale.com with your resume.","time":1525780624,"type":"comment"}