{"by":"ASchubert","dead":true,"id":17055399,"parent":16967543,"text":"Invia Group Germany| Back End Developer (m&#x2F;f) e-Commerce | Leipzig, Germany | ONSITE | RELOCATION supported-<p>Do you want to work for one of the most successful German e-commerce companies and develop the future of online travel industry? Become a part of our team which unites more than 80 engaged developers. As Backend Developer (m&#x2F;f) you will be responsible for the technical optimization of our internet presence. You will work in this role on innovative projects such as improving of our online booking system, develop new interactive functionalities and apply the latest findings of the software development. Through the implementation of new innovative features and usage of new modern technologies (Cloud, Micro-Services, Grunt) you will have a chance to develop and improve your skills.<p>Your main tasks would be:<p>-Development, design and Implementation of data models and sustainable codes for complex and for well-known web portals \n-Follow best practices, test automation and CI &#x2F; CD \n-Use of caching strategies (e.g. Memcache, CDN) \n-Improve and scale our backend services \n-You help us to move from a monolithic application to a microservice-oriented architecture \n-You are working close together with our Frontend developer and share your ideas and suggestions with our team<p>If you love technical challenges and have good knowledge in PHP, Python or Golang and the ability to easily switch between those languages you would be the perfect candidate for us.<p>We require some experience in the use of Frameworks like Django, Symfony or Zend Expressive as well as some eexperience with cloud-services such as AWS and containerization (Docker).<p>Apply directly here: <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;backend-germany\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;backend-germany</a><p>In case you have any questions, do not hesitate to contact Alexander Schubert via jobs@invia.de","time":1526150655,"type":"comment"}