{"by":"WadeWilliams","id":2950748,"parent":2949787,"text":"Phoenix, AZ, Full Time - Some Telecommuting if you're the best.<p>Job Title: Front End Developer<p>Local Motors (www.local-motors.com) is a auto industry game changer. Using our website, anyone can participate in co-creating amazing new vehicle designs. After building the Rally Fighter (www.rallyfighter.com) and the XC2V for DARPA (<a href=\"http://www.local-motors.com/lmBuild.php?c=11185\" rel=\"nofollow\">http://www.local-motors.com/lmBuild.php?c=11185</a>), now Local Motors is producing a new web site which will leverage co-creation and gaming to bring America the next generation of automobiles.<p>Are you positive, supportive and inspiring to others?<p>Do you get things done? Are you independent, and yet take direction well?<p>Are you passionate enough to work in a start-up?<p>Do you get excited about cool new interfaces and ways of interacting with the web?<p>Do you want to be a part of changing our world in a meaningful way?<p>You may be a recent graduate with relevant school projects or endless hours of relevant tinkering behind you. You may have a couple of years experience under your belt developing slick user interfaces. Either way, you are both talented and organized.<p>Our playground:<p>LAMP, HTML5, CSS3, Javascript, jQuery, SVN,<p>Responsibilities:<p><pre><code>    Implement public facing pages\n    Help make UI and UX decisions\n    Build reusable CSS/JS frameworks to simplify development\n    Participation in general internet engineering needs of the company\n\n\n</code></pre>\nRequirements:<p><pre><code>    Smart\n    Gets things Done\n    Exceptional proficiency using HTML5/CSS/Javascript/jQuery/AJAX in a production environment\n    In depth knowledge of browser compatibility\n    Familiarity with Object Oriented Programming\n    Demonstrated design and UX sensibilities\n    Strong CS fundamentals gained through Bachelor’s degree in CS, HCI or related discipline or equivalent industry experience\n    Personal projects that show and aptitude for front-end engineering and product design sense\n    Ability to work in areas outside of their usual comfort zone and get things done quickly\n    Knowledge of SVN\n\n\n</code></pre>\nDesirable:<p><pre><code>    Excellent Knowledge in SEO and Internet Marketing\n    Experience using object oriented PHP\n    Experience with PHPMyAdmin\n\n    Experience using MySQL in a production environment\n\n\n</code></pre>\nBenefits<p><pre><code>    Competitive salaries\n    Vacation days &#38; time off\n    Medical coverage\n    70 Degree winter days in Phoenix, AZ\n    An active working environment with brilliant designers, engineers and technology experts\n    Much more...</code></pre>","time":1314895987,"type":"comment"}