{"by":"paulitex","id":2950435,"parent":2949787,"text":"Vancouver, BC, Canada. full post: <a href=\"https://www.matygo.com/careers\" rel=\"nofollow\">https://www.matygo.com/careers</a><p>Matygo takes the traditional university classroom and explodes it across time, space, and social dimensions. We've reexamined the problems historically addressed by an LMS[1] and built a globally accessible free system for university instructors that makes learning more efficient, removes redundancies in teaching, builds social and content graphs, and has already gained traction internationally.<p>We're a small founding team (two, both technical, plus an HN-hired intern) with a huge ambition to revolutionize one of the largest and most important industries on earth. We are seeking a developer and a marketing communicator. These will be our key first hires and will be expected to lead teams in the near future.<p>By far, the most important qualification is culture fit.<p>See the story of William Kamkwanba from one of our first blog posts (<a href=\"http://blog.matygo.com/post/518849458/announcing-the-matygo-alpha\" rel=\"nofollow\">http://blog.matygo.com/post/518849458/announcing-the-matygo-...</a>) for our guiding philosophy.<p>Matygo is a GrowLab company (<a href=\"http://www.growlab.ca/\" rel=\"nofollow\">http://www.growlab.ca/</a>), backed by top investors. We are still in the first quarter of the program - joining now means being able to go through most of the program including the trip to SF, Demo Day, Under the Radar conf, and meeting a ton of people.<p>Developer:<p>- We play with fun tech: our backend is a custom framework in Scala and our web frontend is Sproutcore. We need someone who can rock them both: Javascript experience is essential, and Scala would be fantastic (but Java + some functional is sufficient).<p>- Very comfortable with all levels of the web stack. Can implement a feature front-to-back from our db (schema design, mysql) to the css and js that makes our app hum. Rest, http, and tcp understanding essential.<p>- Good software engineering skills including testing (e.g. unit vs. integration - when to use which?), system design, and agile techniques.<p>Marketer:<p>- Great communication skills: Will be responsible for everything from our A/B testing our landing page and social media to partner and customer engagement channels.<p>- Familiarity with lean startup and customer development approaches.<p>- Possess the ability, drive, and vision required to play a key part in developing and executing Matygo's user acquisition strategy. We go direct to instructors (and students, in the near future).<p>- Sales and presentation/public speaking experience would be fantastic.<p>For both positions:<p>- Creative. Bonus points for side hobbies like music, photography, design, or any other creative expression.<p>- Desire to work startup hours and understand the commitment, responsibility, and rewards that come with being a first employee of a high growth startup.<p>- See 'how to apply': <a href=\"https://www.matygo.com/careers\" rel=\"nofollow\">https://www.matygo.com/careers</a><p>[1]<a href=\"http://en.wikipedia.org/wiki/Learning_management_system\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Learning_management_system</a>","time":1314891600,"type":"comment"}