{"by":"calbear81","id":2951584,"parent":2949787,"text":"Mountain View, CA (Remote, H1B welcome) - Room 77<p>Are you a superstar coder?  Prefer to work on cool new technology rather than me-too websites?  Enjoy working with world-class engineers?  Come join Room 77, where you can make a big impact as an early employee of a fast-paced startup.<p>Room 77 ( <a href=\"http://www.room77.com\" rel=\"nofollow\">http://www.room77.com</a> ) is building the world's best hotel search engine, featuring room-level information that cannot be found anywhere else.  Combining state-of-the-art search engine technology with the latest developments in 3D rendering, we’re building innovative products to perform fast meta search and compute virtual views out of each hotel room.<p>Quick facts:<p>- Founded in 2009; currently at approximately 20 employees<p>- Fully funded (Series B) by leading VCs and prominent investors, including founder of Expedia<p>- Based in Silicon Valley (downtown Mountain View, California, two blocks from Caltrain station)<p>- Winner of multiple awards including “Best Startup” at 2011 Launch conference and “Audience Favorite” at Web 2.0 Startup Expo<p>We’re looking for software engineers who are smart and can roll up their sleeves to get things done.  We don’t care what programming language you’ve used before or what operating system you’re familiar with, but we do need people with demonstrated passion for programming and problem solving, as well as hands-on attitude and hacker mentality.  Years of programming experience is almost always required, and a degree in computer science helps, too (although the latter isn’t a strict requirement).  In case you’re curious about our technology stack, we use primarily C++ / Javascript / Python / PHP / MySQL, with Ubuntu Linux and Amazon Web Services.<p>We’ll offer you:<p>- Generous cash / equity package with significant upside potential<p>- Free lunch<p>- Medical, dental and vision benefits<p>- 401K match<p>- Travel agent ID card giving you industry insider discounts at many hotels and theme parks<p>- Relocation and immigration assistance, if needed<p>- A unique learning experience as part of a well-funded startup company<p>- A chance to make a big difference, and a fun place to work!<p>Join us and be part of the next revolution that’ll change how people travel. Talk to us at jobs@room77.com","time":1314908350,"type":"comment"}