{"by":"CivisBG","id":10154480,"parent":10152809,"text":"Civis Analytics | Chicago, IL | <a href=\"https:&#x2F;&#x2F;civisanalytics.com\" rel=\"nofollow\">https:&#x2F;&#x2F;civisanalytics.com</a><p>Civis Analytics is building cloud-based products to help organizations do data science better. We create technologies that empower organizations to unlock the truth hiding in their own data, transforming them into smart organizations that are ready to thrive. We help organizations solve their biggest problems with Big Data.<p>We are currently hiring for multiple key infrastructure positions, including:<p>DevOps Engineer - Help us design, build, and automate our extensive AWS infrastructure using tools like Python and Ansible. We use significant portions of the AWS stack, including EC2, RDS, Redshift, and S3, and are looking for experienced candidates who can hit the ground running and help us scale as we take our platform from private beta to public product - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1P30uit\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1P30uit</a><p>IT Specialist - Help us in-source our IT support. We&#x27;re looking for experienced candidates who can support internal users and infrastructure, from Apple laptop configuration, to wireless networking, to VoIP and video conferencing solutions - <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1VZpwlW\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1VZpwlW</a><p>Along with key infrastructure positions, Civis Analytics is hiring Applied Data Science Managers and other roles. View all of our open positions at <a href=\"https:&#x2F;&#x2F;civisanalytics.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;civisanalytics.com&#x2F;careers</a>. All positions are onsite in either our Chicago or Washington, DC offices.<p>We are a team of engineers, data scientists, and statisticians building a cloud-based data science platform to change the way organizations use data. We&#x27;re smart, fun, and a little bit weird. Does this sound like you?","time":1441130884,"type":"comment"}