{"by":"rcymerys","id":10154123,"parent":10152809,"text":"u2i LLC <a href=\"http:&#x2F;&#x2F;www.u2i.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.u2i.com</a> @ Przemysłowa 12A, Kraków, Poland\nu2i is a consulting firm with a focus on developing technology driven websites and web applications.\nWe collaborate with our clients to come up with creative solutions to their business needs, using our ﬂexible and down-to-earth approach to delivering projects. We have experienced developers who are skilled in developing robust, scalable applications.<p># Junior&#x2F;Regular&#x2F;Senior Developer ONSITE\nWe’re looking for passionate developers (either with experience or looking for a first job) to join our projects for Nielsen Social that provides analytic insights into social media, focused around tv-related activity. In our work we process the whole Twitter stream in order to generate various reports on TV and advertising. The application is currently deployed across more than 500 AWS machines. On the project we work in small teams and do pair-programming, moreover we have a daily contact with product team.\nRuby, Rails, Hadoop, Hive, SQL, Git, Linux, AWS<p># Quality Assurance Lead ONSITE\nWe’re looking for a QA Lead to work on automated testing and data validation processes. The project you’ll be working on provides analytic insights into social media, focused around tv-related activity. We process the whole Twitter stream in order to generate various reports on TV and advertising. The quality of data in these reports is extremely important to our clients, so we need to have the best possible validation and testing processes. But the job is not all about technical skills - you’ll be the foundation of our Quality Assurance team, responsible for planning the release process and managing the QA team. You’re going to work with both the development and product team in order to assure the highest quality in the software we deliver to our clients.\nRuby&#x2F;Python&#x2F;Groovy, SQL, Git\nMore info at: <a href=\"http:&#x2F;&#x2F;www.u2i.is&#x2F;hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;www.u2i.is&#x2F;hiring</a>","time":1441128258,"type":"comment"}