{"by":"swilson7","id":10152982,"parent":10152809,"text":"Human API - Redwood City, CA &amp; Vancouver, BC <a href=\"http:&#x2F;&#x2F;humanapi.co&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;humanapi.co&#x2F;</a> (onsite, visa)<p>== About us ===<p>We&#x27;re a small, product-centric team focused on opening the world of health data. For us, life is all about moving fast, crushing hard problems, and enjoying the journey. Our investors include a16z, Eric Schmidt, Blue Run Ventures, Max Levchin, Scott Banister, and Alex Payne.<p>== What you will build ==<p>Human API is the easiest way to integrate health data from anywhere. Users can now securely share their health data with any application or system, regardless of how that data was recorded, processed or stored. As an engineer on our team, you’ll be involved in one or more of the following areas:<p>- Modeling clinical data --&gt; organizing and normalizing the world of health data<p>- Developing and scaling structured APIs<p>- Scaling our ingestion platform and optimizing a multivariate rate limited system<p>- Data engineering and building tools for data science - NLP and Classification<p>- Powering platforms and tools for customers to build health apps<p>== Open roles ==<p>Most of our engineers have diverse programming background (Javascript (Nodejs) &#x2F; Scala &#x2F; Python &#x2F; Java &#x2F; C), and most roles require willingness to work on Nodejs, however we gravitate towards using the right tool for the job. Experience with some of the following required:<p>- Stream processing and unified log systems with Kafka, RabbitMQ, and zeromq<p>- Mongodb, Redis and Cassandra for data storage<p>- Data analysis with Spark or Python tools<p>- Building and scaling a modern infrastructure stack with Docker and Mesos<p>- Building consumer focused apps and&#x2F;or developer focused tools<p>- Powering search with Elastic Search and related tools<p>You can read more about some of the open roles here: <a href=\"http:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join\" rel=\"nofollow\">http:&#x2F;&#x2F;humanapi.co&#x2F;company&#x2F;join</a> We&#x27;d love to hear from you even if you don&#x27;t &quot;fit&quot; one of the job specs -- we hire for people not roles. andrei@humanapi.co","time":1441121181,"type":"comment"}