{"by":"tyw","id":10153977,"parent":10152809,"text":"Audiomack | NYC | REMOTE<p>Audiomack (<a href=\"http:&#x2F;&#x2F;www.audiomack.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.audiomack.com</a>) is a fast-growing music sharing and discovery website. We are looking for a generalist engineer to work with us in a contracting role on a full-time (or nearly FT) basis. You would be welcome to work out of our SoHo NYC office, remotely, or some combination. We are looking for candidates who can contribute immediately to both backend and frontend projects.<p>Between destkop &amp; mobile sites, embeds on other sites, plus iOS and Android apps we generally have 5-20k simultaneous users, 2-3 million streams per day, resulting in 30+ TB daily bandwidth use. We are looking for someone who is passionate about designing and implementing efficient systems that millions of users will interact with daily.<p>Skills &amp; Requirements:<p>- excellent coding skills and proven track record of delivering value<p>- several years of experience with full-stack web development: backend, frontend, database<p>- (if working remotely) proven telecommuting skills: self-motivated, highly productive, maintains open lines of communication with the team<p>- able to make sense of existing code and seamlessly integrate new features without breaking current functionality<p>- good coding habits: writing tests, matching existing coding style, intelligent decision-making on when to refactor, etc.<p>Key Technologies:<p>- PHP &#x2F; Zend Framework<p>- Redis &#x2F; Redis Cluster<p>- The usual frontend technologies (HTML5, CSS3, JavaScript + common libraries, AJAX)<p>- AWS (EC2, CloudFront, S3, etc)<p>- Git &#x2F; Github<p>Bonus for candidates with experience in:<p>- music fingerprinting<p>- extensive HTML5 audio&#x2F;video development<p>- soundmanager2 or some other audio API&#x2F;framework<p>- redis clusters<p>- sysadmin-related tasks<p>If interested, please contact us: management at audiomack.","time":1441127352,"type":"comment"}