{"by":"powster","id":10153720,"parent":10152809,"text":"East London, UK • ONSITE • Front-End Developer • POWSTER (<a href=\"http:&#x2F;&#x2F;www.powster.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.powster.com</a>)<p>We are looking for a cutting-edge Front-End Developer to join our creative studio, creating projects for all the major movie studios, and the major record labels and game companies.<p>===== our movie platform =====<p>Our movie platform gets 2.2 million visits a week and has 2 component parts, the all movie destination (<a href=\"http:&#x2F;&#x2F;movies.powster.com\" rel=\"nofollow\">http:&#x2F;&#x2F;movies.powster.com</a>) and the individual movie pages i(Ant-Man &#x2F; The Martian). You’ll be working on developing the platform further and taking it to the next level for the major movie studios.<p>===== our creative =====<p>You’ll also be creating work for bespoke innovative creative builds, these are idea generated from scratch for our clients and we’d love you to be part of the process. They range from interactive music videos which we shoot and produce in house, to projecting tweets on the houses of parliament. We like to think that anything is possible when pitching, if we haven’t done before we’ll pull together, work it out and make it happen. This comes from having a drive to make the unseen! When bolstered by the very diverse and strong team we can adapt to anything thrown at it, from technical interactive builds to large scale video productions.<p>===== your skills =====<p>You should have a keen interest in keeping up to date with modern coding practises, particularly with respect to mobile &#x2F; responsive design. Our platform is a web-app, and a love for JavaScript is essential.<p>Full job spec: <a href=\"https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1RHoJD4v6InMPmFIm_L5DGl7y2lpZVrPOAstbMlWN0Y8&#x2F;edit\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;document&#x2F;d&#x2F;1RHoJD4v6InMPmFIm_L5DGl7y...</a><p>Send over your portfolio: jobs@powster.com","time":1441125831,"type":"comment"}