{"by":"sfanning95","id":10158061,"parent":10152809,"text":"Improbable | Multiple Software Engineers &amp; Head of Security | Full Time, ONSITE LONDON, UK\n(<a href=\"http:&#x2F;&#x2F;improbable.io&#x2F;life-at-improbable&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;improbable.io&#x2F;life-at-improbable&#x2F;</a>)<p>Improbable is developing an operating environment that makes building simulated worlds possible. Worlds which can be run in real time, simulating the behaviours and interactions of millions of entities. Spaces with their own rules and properties that a multitude of people can simultaneously change, explore and visualise in as many different ways as developers can imagine.<p>We are hiring across multiple teams within the business including:<p>- Building our base real-time distributed simulation platform<p>- Applying our real-time distributed simulation platform to gaming<p>- Building revolutionary new online games backed by our simulation platform<p>- Applying our real-time distributed simulation platform to other verticals<p>Also, Head of Security: We are currently looking to make a critical first security hire around whom we can build a team as we scale. Our codebase is a large-scale, cloud-agnostic, distributed system with a complex combination of Go, JVM technologies and C#.  \nThis team will be responsible responsible for auditing the system’s current security architecture and will also be responsible for security design &#x2F; implementation in future to ensure our data and execution environments are safe. Our current needs surround security auditing, pen-testing, vulnerability testing &#x2F; research, encryption and authentication with great freedom to establish our security infrastructure.<p>Check out: <a href=\"http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;parmyolson&#x2F;2015&#x2F;05&#x2F;27&#x2F;improbable..\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;parmyolson&#x2F;2015&#x2F;05&#x2F;27&#x2F;improbable...</a>.<p>In some circumstances we can sponsor visa&#x27;s for exceptional talent. Currently 20+ open positions with more in the pipeline - email me directly if you don&#x27;t see anything that quite matches your skills (Sean@improbable.io)","time":1441183161,"type":"comment"}