{"by":"kreide","id":10157216,"parent":10152809,"text":"Medallia - Palo Alto, CA - <a href=\"http:&#x2F;&#x2F;engineering.medallia.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.medallia.com</a><p>Medallia is hiring engineers to build our microservice platform. World-class companies (Airbnb, Mercedes, Nordstrom to mention a few) use Medallia to create awesome customer experiences.<p>We are a fast-growing (70% per year), Sequoia-backed company that recently became a tech unicorn; our mission is no less than to transform the way the world&#x27;s companies view and interact with their customers. We allow hundreds of thousands of employees to access, analyze and take action on large amounts of customer data in real time. We are still a small engineering team, only about 50 or so of us, thus everyone counts.<p>Dividing our codebase into independent microservices will make it easier for new engineers to get up to speed, enable much faster deployments of new code (by the engineers themselves) and make it easier and cheaper to scale with much better resiliency.<p>Despite the popularity of microservice architectures, and plethora of available frameworks, there are still many unsolved problems (especially around RPC performance, storage and freely moving processes around) in operating at scale in production. We not only want to solve these for ourselves, but share our findings and tools with the wider community.<p>We are using a blend of the best tech out there: Docker for containerization; Aurora&#x2F;Mesos for data center &#x2F; server management; CEPH for fully redundant storage and putting it together in a way we haven&#x27;t seen anyone else do. Check out this presentation we held at a recent Docker meetup (hosted by us) for how we are going about it:<p><a href=\"http:&#x2F;&#x2F;files.meetup.com&#x2F;10524692&#x2F;Relocatable%20Docker%20Containers%20with%20CEPH.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;files.meetup.com&#x2F;10524692&#x2F;Relocatable%20Docker%20Cont...</a><p>Please send me a note at kristian@medallia.com if any of the above sounds interesting to you.<p>Kristian Eide,\nSoftware Architect","time":1441163422,"type":"comment"}