{"by":"gallamine","id":10154944,"parent":10152809,"text":"Distil Networks | SF, DC (Arlington) NC (RDU) | ONSITE (with a few exceptions) | We block bots on the internet.<p>Yo HN, Distil&#x27;s mission is to stop bad bots from scraping content from our customers websites. This is along with reducing fraud, spam and security issues from automated traffic. Measurements on our global traffic show about 60% of the traffic is from non-humans and that number is growing. We have a global network and actively block traffic based on our bot &#x2F; human signatures. Our customers love us (and they pay us too!) and that&#x27;s why we&#x27;re growing very fast. Our investers love us. I (data scientist, employee 14) stoked about working there too. Lots of problems (and lots of and lots of data) and good people to work on them with.<p>What we’re looking for (<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;distilnetworks?lever-via=3TYvimYmGi\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;distilnetworks?lever-via=3TYvimYmGi</a>):<p>- Senior Lua Developer - Our next generation of bot blocking technology will be built with NGINX and Lua. Make it go fast!<p>- Senior Solutions Architect &#x2F; Solutions Engineer - The nitty-gritty work of getting customers hooked into our network and happy with the performance.<p>- QA Automation Engineer - Automate testing all the things! These folks are surprisingly tough to find.<p>- Front End Engineer - Change the face of what our customers see.<p>- Senior Javascript Engineer - We need deep, framework-less, JavaScript experience to build fast bot-fingerprinting systems on the frontend.<p>- Ruby&#x2F;Rails Developer - Our customer facing systems are Ruby&#x2F;Rails and we need more help.<p>- DevOps Engineer - We run a vast global network and East&#x2F;West coast engineering teams that need support.<p>- Graphics Design - Make our marketing material, website, presentations and everything else look beautiful.<p>- We&#x27;re also hiring sales, marketing, and recruiting.<p>I&#x27;m a data scientist at the company and I&#x27;m having a great time working there. If you want more information or want me to push your resume into our hiring stack, contact me: william dot cox at distil networks dot com.","time":1441134719,"type":"comment"}