{"by":"coopc","id":10155355,"parent":10152809,"text":"Skeleton Key - <a href=\"http:&#x2F;&#x2F;www.skeletonkey.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skeletonkey.com&#x2F;</a> - St. Louis, MO - FileMaker Application Developer - ONSITE or REMOTE<p>DESCRIPTION<p>Skeleton Key is an accomplished team of technology consultants that solve problems. We’re well-known as experts in FileMaker, and we have a lot of experience integrating PCs and Macs. We’re also certified trainers who emphasize constant education for ourselves to best serve our customers.<p>Our job is to make your systems function smoothly, with all the right elements in place. We are solution-agnostic. That decision was one of our first as a company, and it makes us customer-centric in a way nothing else can.<p>ROLE<p>To be successful in this developer position you must have thick skin, be a fast study and thrive on doing the hard work to get the job done. You should be excited about working in a team environment where accountability is high and your opinion is valued.<p>Depending on your experience level, you’ll be understudy to a top-flight application development team or working with customers and our internal team to deliver high quality applications and extraordinary customer experience. Either way you’ll be given the opportunity to develop both your business and technical skills while being surrounded by a stellar team that never stops learning.<p>Ideally, we’re looking for someone with experience in developing database systems with FileMaker Pro. That said, experience with any of the following technologies would be a plus: FileMaker Server, FileMaker Go, PHP, HTML, CSS, JavaScript, ODBC, SQL.<p>You should also have:<p>Good troubleshooting and technical analysis skills.\nAbility to understand new business models and workflows.\nExcellent verbal and written communication skills.<p>CONTACT<p><a href=\"http:&#x2F;&#x2F;www.skeletonkey.com&#x2F;hiring&#x2F;applynow&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skeletonkey.com&#x2F;hiring&#x2F;applynow&#x2F;</a>","time":1441138393,"type":"comment"}