{"by":"cybertaek","id":10154967,"parent":10152809,"text":"Sparkcentral | San Francisco, CA | Full Time\nEngineering Manager<p>Looking to build something extraordinary?<p>In less than 3 years, Sparkcentral has become an industry thought-leader that is revolutionizing the way enterprises help and engage customers. Our goal is to inspire and enable amazing customer experiences, and we’re doing this by completely reimagining what enterprise customer service software should look like.<p>Sparkcentral is starting to scale, supported by the great customer relations we’ve built with the most amazing brands out there.<p>Many large companies such as Uber, Dropbox, Netflix, T-Mobile, and Delta Airlines have chosen Sparkcentral.<p>Management at Sparkcentral is very different. So we expect you to be a little different as well.<p>You, as the manager, are responsible for unblocking your team. You need to provide leadership, not micromanagement. You are here to help engineers achieve their goals and ambitions, provide great communication, and to help engineers ship the product.<p>You are responsible for setting the culture in your team. That culture is to make sure every engineer is happy, unblocked, doing whatever it takes to help an engineer ship, and to ensure that are no politics while doing all the above. Sparkcentral is all about output. It doesn’t matter if someone is in the office 25 hours a week, so long as the team ships great things.<p>You are not just a manager, but also an engineer. You must understand how engineers think, what they crave, how much to put on their plate, when to prioritize engineer initiatives, and be able to deliver that repeatedly.<p>We want you if this sounds like what you can provide as a manger. You’ll be a serious contender if you have 4+ years of experience in an agile, startup as either a lead engineer or experience in a management capacity. Working with teams in different locations is a huge plus. You must have been an engineer for a few years at some point in your career. We don’t want people out of touch.<p>Did we mention how we are hiring rapidly, and making our engineering team exponentially larger? Yeah, talk about a challenge and an opportunity to excel.<p><a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;2gtmis\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;2gtmis</a>","time":1441134914,"type":"comment"}