{"by":"aeflash","id":10153419,"parent":10152809,"text":"Fluid, Inc. | <a href=\"http:&#x2F;&#x2F;fluid.com\" rel=\"nofollow\">http:&#x2F;&#x2F;fluid.com</a> | San Francisco, CA (but remote friendly)<p>Senior Full Stack Engineer<p>Fluid&#x27;s main product offering is Fluid Configure, a flexible and powerful platform for mass customization and configuration of consumer products. Fluid Configure is being successfully used by The North Face, Reebok, Oakley, and Vans, among many others. We are looking for engineers with well-rounded experience to help us build out the next generation of Fluid Configure, and help us solve problems in building flexible and performant web UIs, 3D rendering, image processing, scalability, server APIs, and administration tools.<p>Senior Software Engineer - AI &#x2F; Machine Learning<p>Fluid&#x27;s next product (currently in the alpha phase) is Expert Personal Shopper (XPS) - an AI &#x2F; ML-driven product recommendation engine. XPS uses a variety of AI technologies such as IBM&#x27;s Watson, Named Entity Recognition, Natural Language Classifiers, and Sentiment Analysis to produce its results. We are looking for smart, creative, skilled engineers to advance our intelligent XPS platform. Experience with AI or machine learning technologies is a huge plus (but not required).<p>Fluid is a company of about 100 people, with offices in SF and NY, as well as many remote employees spread across the globe. Fluid started as a digital agency, but within the last 5 years has seen strong growth in its SaaS business. On the Software R&amp;D team, we value technical skills as well as creative and intrapersonal skills. We have flexible working schedules, great benefits, and consider our 40-hour work weeks sacred.\nIf any of these positions interest you, send me your resume or something that showcases your skills at aearly+hn@fluid.com (I am Alex Early). You can also apply online[1]. We also have a variety of other non-engineering positions open.<p>[1] <a href=\"http:&#x2F;&#x2F;www.fluid.com&#x2F;careers#resumator-job-job_20150316171355_2W8SD5VIMBT7WZJD\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fluid.com&#x2F;careers#resumator-job-job_2015031617135...</a><p>Keyword Soup: React, Flux, Node.js, Javascript, Functional Programming, FP, RWD, HTML5 Canvas, Browserify, Express.js, REST, AWS, EC2, DynamoDB, ElastiCache, Bitbucket, Git, CI, Atlassian, Hipchat, reaction GIFs, emoji, Redis, Chef, Java, Groovy, Neo4j, NER, NLP, Machine Learning, your favorite tech that would help us effectively solve problems","time":1441123870,"type":"comment"}