{"by":"leadpages","id":10154220,"parent":10152809,"text":"LeadPages (www.LeadPages.net) - Minneapolis, MN | Full Time | Python Engineer, Web Developer, Automation, Production Engineers, Technical Project Managers, etc.<p>LeadPages is Minnesota&#x27;s fastest growing startup and we&#x27;re looking for some amazing people to join our team! Our team and culture is like no other. We work remote two days per week and the other three days in our incredible downtown Minneapolis office. We&#x27;re a SaaS company with one of the best tech stacks I&#x27;ve seen yet and... we&#x27;re a Mac shop! :)<p>We currently have full time opportunities available for:<p>- Senior Python Engineers (Python - we use Web App 2 and some Flask, Google App Engine, Gulp, Git, Mongo DB, TDD) =&gt;<a href=\"http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?3lghnhw1\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?3lghnhw1</a><p>- Senior Web Developer (Marketing; using PHP, JS, CSS, and HTML) =&gt; <a href=\"http:&#x2F;&#x2F;jobvite.com&#x2F;m?3740yhwv\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3740yhwv</a><p>- Automation Engineers (DevOps; Load, Performance and API testing using LocustIO, JMeter, and other good things) =&gt;<a href=\"http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?321hnhwt\" rel=\"nofollow\">http:&#x2F;&#x2F;hire.jobvite.com&#x2F;m?321hnhwt</a><p>- Production Engineers (DevOps; using Docker, Google Cloud, Kafka, Spark, Mesos, Chef, Terraform, Packer, Vagerant, etc.) =&gt; <a href=\"http:&#x2F;&#x2F;jobvite.com&#x2F;m?3Rf0vhwn\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3Rf0vhwn</a><p>- Technical Project Manager (Experience in a Software Development Environment using Jira&#x2F;Confluence with Startup experience preferred) =&gt; <a href=\"http:&#x2F;&#x2F;jobvite.com&#x2F;m?3S30yhwf\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3S30yhwf</a><p>These are all full time positions with great benefits including Medical, Dental, Vision, 401k, PTO, Flexible Schedules, Work From Home options, and more! We even offer relocation packages for anyone that would be open to relocating to beautiful Minneapolis, MN.<p>If you&#x27;re interested in seeing any of the other positions that we also have available on our Marketing, Product, Technical Support, Customer Success or Operations teams, check out our website at: <a href=\"http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers</a><p>Interested in emailing me directly? You can reach me at: Tiffany@Ave81.com<p>I&#x27;d love to talk with you soon!!<p>Thanks, Tiffany","time":1441128948,"type":"comment"}