{"by":"wrdevos","id":10153276,"parent":10152809,"text":"Springest - Amsterdam - 3 Backend Ruby Developers - ONSITE - <a href=\"https:&#x2F;&#x2F;www.springest.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.springest.com</a> | <a href=\"http:&#x2F;&#x2F;devblog.springest.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;devblog.springest.com&#x2F;jobs&#x2F;</a><p>Springest is the largest source for learning in Europe. You can find everything you need to learn (or progress) in your professional life. We have a strong product focus in which everything revolves around the users of our Dutch, German, UK, and US sites. Next to that, more and more organisations are using our SaaS tools to stimulate and manage learning for their employees.<p>Working at Springest<p>To strengthen our development team more, we are looking for a senior Ruby developer who can work independently. We don’t have managers at Springest, but processes, and we feel that individuals taking responsibility is very important. At Springest, you will work in a product team and in close collaboration with product owners, marketing, and sales colleagues. You are also a member of our development team where we discuss architecture, infrastructure, and keep a close watch on security and performance.<p>Your New Colleagues<p>At Springest you will work with around twenty colleagues who all are very skilled at what they do and almost all of them have a healthy dose of nerd skills that we really value. As a developer you fulfil an important role here that all your colleagues value and appreciate. Springeteers are a happy bunch and we often get together outside work to enjoy free time as well. Our office is a cosy place where anything goes and that we all take good care of together.<p>We are all active organisers and members of a lot of Meetups and other forms of knowledge exchange (learning is our hobby!) and we participate quite actively in the Amsterdam startup ecosystem. In addition to that we get a lot of attention for Springest being the poster boy of how HOLACRACY and GTD can work for an organisation, which in turn is due to our organisational structure without managers and other unnecessary overhead.<p>Our Data and Stack<p>At Springest you will work on our Ruby on Rails application on a daily basis. The app runs on AWS in Docker containers. You can read more about that on our blog.<p>We serve over 100 different SSL endpoints, among which are our APIs, Admin backend for learning providers, and of course our public websites. How we do that will soon be published on our blog.<p>At this time, we have over 150,000 courses by 5,000 providers in our Postgres database. Our users trust us with over 50,000 reviews already. Our exciting job is to maintain this ever scaling dataset.<p>It should not surprise you that our search engine is a core feature, for which we use Elasticsearch. We provide over 6,000 subjects in more than 150 categories with courses through this engine. We do personal recommendations for our users with it, taking their location, start dates, and many other factors into account that are important when choosing the right form of education.","time":1441123041,"type":"comment"}