{"by":"dramudit","id":10154042,"parent":10152809,"text":"Bloomberg L.P. | New York, NY | ONSITE, VISA<p>Apply at:<p><a href=\"http:&#x2F;&#x2F;jobs.bloomberg.com&#x2F;job&#x2F;New-York-Senior-Python-Developer-Job-NY&#x2F;290974800&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.bloomberg.com&#x2F;job&#x2F;New-York-Senior-Python-Develop...</a><p>The Content Generation and Distribution team is responsible for Bloomberg&#x27;s market-leading enterprise reference data product. We build and maintain high-performance systems that feed billions of data points per day to our customers, who include key financial players that rely on our software. Our system delivers a wide range of information on nearly all types of financial instruments including equities, fixed income, indices, FX, and futures &amp; options. We work with hundreds of databases and a distributed system that utilizes multiple processes across dozens of machines to generate the needed data. We make data available to our clients via various delivery mechanisms such as web services, MQ, and SFTP. We interact closely with our business and sales teams and have many opportunities to design and develop innovative solutions to satisfy ever-growing customer demands.<p>We are seeking a Software Engineer with excellent programming skills, strong problem-solving abilities, and the desire to work in a closely-knit team environment. Our work atmosphere is fast paced, spirited and friendly. You will have the opportunity to work with a wide variety of technologies such as Python, C++, Perl, Java, Javascript, SQL, RabbitMQ, Celery, Git, Jenkins, Robot Framework - whatever it takes to get the job done.<p>Qualifications:<p>- Minimum 3+ years of current Python development experience\n- Experience developing software in a UNIX environment\n- Understanding of Python, including code organization and testing\n- Excellent communication skills<p>Other desirable skills:<p>- Experience with compiled languages such as C, C++ or Java\n- Experience building both small scripts and large systems in Python\n- Working knowledge of development tools such as debuggers, memory profilers, and performance measurement\n- Relational database experience","time":1441127732,"type":"comment"}