{"by":"jessmartin","id":10154104,"parent":10152809,"text":"## PRINCIPAL ENGINEER (Ruby) | FIRST (<a href=\"http:&#x2F;&#x2F;firstleads.net\" rel=\"nofollow\">http:&#x2F;&#x2F;firstleads.net</a>) | DURHAM, NC &amp; REMOTE<p>First is a venture-funded startup at the intersection of predictive analytics and real estate tech. We identify when and why people will move, and build products to change the game for real estate professionals and consumers.<p>Our team is focused on shipping great products and driving innovation in a massive industry (2014 realtor commissions were &gt;$69B). We believe in continuous improvement and sharing knowledge - whether through pair programming, speaking at meetups, and eventually open-sourcing parts of our system.<p>We’re moving fast and ready for a technical leader to join our CTO in building initial product offerings and automating our data platform.<p>As one of our first engineers, you&#x27;ll be a senior leader helping guide key architecture and technology decisions. You will reliably scale our data platform to support products and the needs of our data science team. This includes choosing and deploying our server and compute infrastructure (e.g., Ansible, Hadoop, Spark, etc) and building frameworks to support the development of our predictive models.<p>==What you bring to the table==<p>* Passion for startups and building tools that will be used to change the face of real estate<p>* Generalist mindset, excited to jump into many parts of the stack to ship working software<p>* 8+ years software development experience; 5+ years experience in Ruby<p>* Clear, effective communication skills, both written and verbal<p>* Experience with agile practices, including TDD, continuous delivery, object oriented design, SOLID principles, etc<p>* Comfort with asynchronous development: pull requests, chat, email, etc<p>==Extra bonus points for==<p>* Experience with graph databases - Neo4j or others<p>* Operational skills, or willingness to learn - Ansible, Chef, Puppet, etc<p>* Proficiency in GitHub flow<p>* Experience with pair programming (remote or in-person)<p>* Open source contributions, side projects and gems<p>Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;vinq65\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;vinq65</a> or email jobs@firstleads.net","time":1441128164,"type":"comment"}