{"by":"joeconway","id":10154241,"kids":[10172950],"parent":10152809,"text":"Scribd (YC &#x27;06, &quot;Netflix for eBooks&quot;, top 100 website, 50 people) is hiring talented devs in a variety of flavors to help us build the library of the 21st century.<p>We&#x27;ve hired TEN full-time people and TONS of interns from these &quot;Who is Hiring&quot; threads ... we do go through all of the applications we receive in response. \nThere was some feedback about people not hearing back at all. We take candidate experience very seriously and recently hired someone to own our recruiting process and now everyone who applies through our job board (<a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;gr84t3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;gr84t3</a>) will get a response.<p>We&#x27;re looking for people who want to work with:<p>* iOS OR Android (we&#x27;re a top 10 eBook app with more reviews than Wikipedia, with a small mobile team so there’s a lot of opportunity for impact and responsibility)<p>* Machine Learning &#x2F; data mining &#x2F; recommendations - think Netflix prize, but for books!<p>* Internships: junior standing or above for all areas of engineering. We hire several interns every summer and year-round and we’re currently looking for our first round of 2016 interns to start in the winter term.<p>We care way more about your personality, potential, and general hacking skills than what specific languages you&#x27;ve used so far, so if you haven&#x27;t used these but want to break into mobile or web development, this could be a good opportunity for you. We&#x27;ve hired people from these threads with everywhere from 0 to 10 years of experience. That being said, there isn’t always an opening that’s a good fit but we do our best to find a match for talented people and there are several people who interviewed 2 or 3 times before the time was right.<p>To expedite your application, please apply directly to our job board where you’ll find all of our current opening and the job descriptions. We do our best to respond within 24 hours, and you’ll get an answer either way. \n<a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;gr84t3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;gr84t3</a><p>We&#x27;re profitable, very well funded and have a really fun office environment (go-karts + a jam room!) in the center of the startup world in San Francisco. Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire, and we love hiring people with entrepreneur and startup ambitions. We are also always looking for international people interested in moving to the US and can help you secure a visa.<p>You can read more about our &quot;Netflix for Books&quot; service here<a href=\"http:&#x2F;&#x2F;wrd.cm&#x2F;1dJquzz\" rel=\"nofollow\">http:&#x2F;&#x2F;wrd.cm&#x2F;1dJquzz</a> or check out our tech blog at<a href=\"http:&#x2F;&#x2F;coding.scribd.com\" rel=\"nofollow\">http:&#x2F;&#x2F;coding.scribd.com</a>.   We recently launched the first &quot;Netflix for Comics&quot; - really exciting stuff! More here: <a href=\"http:&#x2F;&#x2F;wrd.cm&#x2F;1MbaBA6\" rel=\"nofollow\">http:&#x2F;&#x2F;wrd.cm&#x2F;1MbaBA6</a><p>More info is available at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;gr84t3\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;gr84t3</a>, but as a HN user, feel free to contact us directly with any and all questions by emailing { jacquie at scribd.com }.","time":1441129095,"type":"comment"}