{"by":"juanplusjuan","id":10154034,"parent":10152809,"text":"### PriceMethod || https::&#x2F;&#x2F;www.pricemethod.com || San Francisco, CA || ONSITE ###<p>Our company, PriceMethod, helps hosts perfectly price their short term rentals, every night. We’ve brought data-driven, dynamic pricing to the vacation rental market (Airbnb, Homeaway&#x2F;VRBO). Our product puts the power of major hotel chains into the hands of the people in the sharing economy. After crunching billions of data points through our machine learning models, we wrap up the result into a lovely swan towel and put a chocolate beside it. We aim to make our product simple and our customers smile.<p>Our proprietary pricing model is just the tip of iceberg, however. We’re actively building a community for hosts + vacation rental owners to collaborate with each other and providing them with the best possible tools to thrive. We help hosts navigate unfamiliar territory of professional rental management by answering their most pressing questions cheerfully and accurately. In effect, we’re the hosts for hosts.<p>Available positions<p>* Data Scientist - we’re looking for a senior data scientist to join our existing team of three (2 data scientists, PhD and Masters, 1 machine learning PhD) to work on our predictive and reactive data models, PhD preferred<p>* Lead Product Designer - solid design process, be comfortable collaborating with engineers in a fast-paced environment, have the chops to hire and bring on designers to support you, easily dance between big picture thinking and scoped-down user stories; passion for data visualization and the sharing economy<p>* Front End Engineer - Backbone &#x2F; EJS, jQuery, Underscore, React; experience in motion graphics &#x2F; animation = bonus; first engineer hire and will work closely with CTO<p>* Growth Marketer - we are growing organically with no marketing or advertising, and now want a dedicated expert to pour fuel on the fire. Ideal candidate would have experience in setting up marketing&#x2F;growth engines across multiple channels, including email, social, content, PR, SEO, SEM.<p>What about us? We’re a veteran team of 7 with strong backgrounds in finance, real estate, data science, machine learning, and vacation rentals. We are seed-funded so we’d offer a significant equity stake and competitive salary at a quickly growing startup.  Also, we’re ex-YC and currently part of a new incubator, NFX, offering plenty of opportunities for career growth and exposure to the wider startup community.<p>To apply, please email your resume to hiring@pricemethod.com.","time":1441127701,"type":"comment"}