{"by":"nickdandakis","id":10166732,"parent":10152809,"text":"We are looking for energetic full stack Technologists to join our team at Big Spaceship. Big Spaceship is a digital agency in Brooklyn that brings together product design, brand communications, and social content to help businesses thrive. We’re also a little weird, extremely collaborative, and sometimes communicate entirely in gifs and emojis.<p>This role is part of the larger technology team. You will work day in and day out with a great, full-service digital team to find innovative solutions to brand challenges and bring digital campaigns, platforms, and services to market.  You will not simply be responsible for coding; you will be an integral part of shaping our clients’ brands through concepting and technology. We are looking for someone who loves to wear multiple hats, who pushes the whole team to produce more compelling work, and who can bring something unique to the table with both creativity and technical skill.<p>ROLE + RESPONSIBILITIES:<p>- Collaborate with designers, strategists, analysts, and developers to create compelling campaigns, platforms, and services<p>- Drive innovation in both our clients’ and Big Spaceship’s systems, processes, and technology stacks<p>- Spark creativity across the entire team<p>- Track industry trends and find opportunities to apply them to our work<p>- Mentor and train junior developers<p>- Help source and vet technology partners that can bring the work to the next level<p>SKILLS + EXPERIENCE:<p>- 3-5 years of front-end development experience in an agency environment or similar<p>- 1-3 years of experience with a modern JavaScript framework (Angular, Backbone, Ember, etc.)<p>- Understanding of MVC concepts, preferably with experience applying them in JavaScript<p>- Expert knowledge of XHTML, HTML5, CSS3<p>- Experience with responsive web design techniques<p>- 1-3 years experience in backend languages like PHP or Python<p>- 1-3 years experience in SQL or noSQL database technologies (e.g. MySQL, Mongodb, etc.)<p>- Experience with Git or Mercurial version control<p>- Experience using JIRA or a similar issue tracker and project management tool<p>- Strong communication and problem-solving skills<p>- A passion for digital culture and inventing solutions to tomorrow’s challenges today<p>- The ability to work collaboratively with colleagues across disciplines<p>To apply please visit <a href=\"http:&#x2F;&#x2F;www.bigspaceship.com&#x2F;careers&#x2F;#technologist-full-stack\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bigspaceship.com&#x2F;careers&#x2F;#technologist-full-stack</a>","time":1441305169,"type":"comment"}