{"by":"bcantrill","id":9639588,"parent":9639001,"text":"Joyent, San Francisco &#x2F; Vancouver | ONSITE or REMOTE | Software engineer<p>Recently, the world has figured out what we at Joyent have known for a long time:  that operating system containers are the future of elastic infrastructure.  While this future has become clear to many, its essential implication remains elusive:  that in an all-container world, the old abstraction of the virtual machine becomes prohibitively confining -- a suffocating skeuomorph that incarcerates infrastructure in the past.  At Joyent, we believe in containers to our marrow -- and that the transition to native container infrastructure presents opportunities to fundamentally rethink computing, networking and storage systems.  We are looking for more people like us:  systems generalists who love to cut code -- software engineers who are afraid of neither the biggest of problems nor the grittiest details, who are comfortable in every stage of the software design and implementation process, and who find gratification in seeing their work available as open source.  We&#x27;re seeking engineers who are able to move up and down the stack: at any given time, we may find ourselves debugging a nasty device firmware bug, rewriting a portion of the operating system kernel, instrumenting the networking stack, debugging a virtual machine or interpreter, or developing code for a distributed system to allow containers to be understood or managed -- perhaps all in the same day or as part of the same problem.  We expect that you have detailed knowledge of a favorite language, tool or system, but that you are also able to quickly pick up new ones as needed.  And while implementation experience is essential, enthusiasm and interest can trump experience; we are willing to take a chance on someone who wants to step up.<p>We have immediate job opportunities in both downtown San Francisco and Vancouver (both close to mass transit) -- and we are remote-friendly in the US and Canada for those who have a track record of contributing to our open source communities (or who otherwise have a proven ability to work remotely).  We are a growing company that appreciates the value of talent -- in terms of things both big (we offer highly competitive salary and excellent benefits) and small (your ACM membership dues are on the house).  Join us in forging the containerized future of elastic infrastructure!<p>E-mail jobs@joyent.com (subject &quot;Software engineer&quot;) or DM me on twitter (@bcantrill)","time":1433173962,"type":"comment"}