{"by":"ejdyksen","id":9639574,"parent":9639001,"text":"Mutually Human – Developers&#x2F;Designers \u001f– Grand Rapids, MI &amp; Columbus, OH (on-site, full time)<p>We&#x27;re always looking for developers, but we&#x27;re especially looking for a senior designer to join our team right now.<p>A little bit about us:<p><pre><code>  - We write custom software of all shapes and sizes for clients all over the US.\n\n  - We aren&#x27;t limited to any specific set of technologies, which is a great\n    opportunity to learn. In the past two years, I&#x27;ve worked with Python, iOS,\n    Angular.js, CoffeeScript, QT, Node, Ruby, Rails, and more.\n\n  - We practice a sustainable pace. Late nights and &gt; 40 hour weeks are\n    rare by design. For example. last year I worked an average of 40.408 hours per\n    week.\n\n  - We offer competitive salaries, health&#x2F;vision&#x2F;dental insurance, quarterly profit\n    sharing, retirement + match, weekly catered lunches, and a top-floor office\n    with snacks, guitars, and your choice of standing or sitting desks.\n</code></pre>\nA little bit about Grand Rapids:<p><pre><code>  - 2.5 hours from Chicago and Detroit, less than an hour to the beach.\n\n  - Lots of great beer. Founders Brewery (a mile from our office) has 3 beers in\n    the Beer Advocate top 15. HopCat is a “World Class” bar on BA.\n    Just look here: http:&#x2F;&#x2F;beeradvocate.com&#x2F;beerfly&#x2F;city&#x2F;43\n\n  - Low cost of living. I bought a nice house with a mortgage payment\n    30% lower than the rent of my 1 bedroom apartment in Mountain View.\n</code></pre>\nA little bit about you:<p><pre><code>  - You love making software, and you have experience with a variety of technologies.\n\n  - You learn new stuff quickly. You’ve used a lot of technologies, but you’re not\n    afraid to use more.\n\n  - You believe software is written for humans, not computers.\n</code></pre>\nI&#x27;m a software developer on this awesome team. If you&#x27;re interested, check out our website:<p><a href=\"http:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;hiring&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mutuallyhuman.com&#x2F;hiring&#x2F;</a>","time":1433173881,"type":"comment"}