{"by":"joshuakarjala","id":9639653,"parent":9639001,"text":"Dixie | Copenhagen, Berlin, London | Technical co-founder<p>Every business needs a back office, yet no business owner enjoys doing bookkeeping, accounting, payroll or the like. Most people end up either taking away precious time from their business and their loved ones, or simply outsource these tasks out of sight, thus losing the benefits of knowing what&#x27;s going on in their company.<p>With Dixie we want to challenge the way the back office works. By taking care of the tedious tasks and providing actionable insights - not just numbers - Dixie’s goal is to help everyone do what they love and their business be successful.<p><i>So what kind of product will I be building?</i><p>Dixie is a tech company, tackling a real life problem. At the core of our product is a personal advisor who assists business owners with their administrative tasks and provides them with valuable insights.<p>Your job is to craft an elegant and easy to use interface between business owners and our advisor team. Focus is on providing a day to day overview of how a business is doing, ignoring all the noise. Advisors communicate with the business owners by submitting them actionable tasks and answering ad-hoc questions.<p>Behind the scenes your job is to evaluate and glue together the best existing tools into a unified platform. On top of this we will build the automation that allows our advisory team to focus on their client relationships and not menial tasks. <p><i>Requirements</i><p><pre><code>   - You are passionate about entrepreneurship and technology - and maybe even back office ;)\n   - You are passionate about and have strong experience with modern frontend &amp; backend technologies\n   - You have previous experience as a CTO or lead developer in a startup environment\n   - You are confident that you can build and lead an amazing team\n   - You have experience running agile(ish) &#x2F; lean product development\n   - Willing to relocate to Copenhagen, London or Berlin\n</code></pre>\nPlease apply @ <a href=\"https:&#x2F;&#x2F;dixie.workable.com&#x2F;jobs&#x2F;62065\" rel=\"nofollow\">https:&#x2F;&#x2F;dixie.workable.com&#x2F;jobs&#x2F;62065</a>","time":1433174399,"type":"comment"}