{"by":"dasil003","id":9639385,"parent":9639001,"text":"MUBI :: San Francisco, CA :: Senior Engineer<p>MUBI is hiring a senior software engineer to start growing our San Francisco team.  We are a VoD company with a focus on bringing the best films to our customers around the globe.  What sets us apart is true editorial credibility in the film world, and a strategy where we built traction with a cinephile audience first before throwing money at massive content deals.  We have run very lean for a number of years to find product-market fit and we are now at an inflection point where we will scale the subscriber base and generate real profits.  If you have been looking around the Valley and concerned that valuations are out of control and investors are chasing too many flimsy business models, then you should take a look at what we&#x27;re doing.<p>The product is a streaming service and social network currently available on the web, iOS, Android, Amazon Fire TV, PlayStation, Samsung Smart TVs, and several more on the way.  It is build primarily of Ruby, Rails, Backbone + Marionette, and the usual client-side frameworks.  We are heavily invested in Chef for configuration management, both at Engine Yard where we host our main applications, and also for newer infrastructure such as our custom-built CDN that we are tuning to deliver a better QoS than off-the-shelf vendors can provide.<p>The position is for the first engineer to be sitting next to me (Co-Founder &amp; CTO) and our Head of Product in our San Francisco offices.  Although we were founded in Palo Alto, currently the CEO and bulk of our team is based in London due to the UK being our primary growth market.  We are now looking to move the product and engineering center of gravity to San Francisco in a run up to make the US a primary market in 2016 and beyond.  You would be #9 software engineer overall, and will play a strong role in defining the architecture of our application.  Strong ruby and rails skills are ideal, though this can be substituted by strong web and backend development skills in similar languages and architectures.  VoD and client-side video app development are a bonus but not required.  You will have significant opportunity to define your own position and work on any area of our technology where you can add value.<p>If you are interested please contact me by email, which can be found on my MUBI profile at <a href=\"https:&#x2F;&#x2F;mubi.com&#x2F;users&#x2F;2\" rel=\"nofollow\">https:&#x2F;&#x2F;mubi.com&#x2F;users&#x2F;2</a>","time":1433172791,"type":"comment"}