{"by":"jjarmoc","id":9640629,"kids":[9640828],"parent":9639001,"text":"~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~<p>NCC Group<p>Atlanta. Austin. Chicago. New York. San Francisco. Seattle. Sunnyvale.<p>Application Security Consultant<p>Full-Time, work visa sponsorship available<p>~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~<p>Long-time Hacker News readers will be familiar with Matasano Security, and will expect to see us post in this thread.  This month, there will not be a post from Matasano Security.  Effective today, there will no longer be a Matasano Security.  Instead, we&#x27;re officially rebranding as NCC Group.<p>In late 2012, Matasano was acquired by NCC Group joining iSEC Partners and later Intrepidus Group.  Since that time, we&#x27;ve been working together, cross staffing projects and benefiting from each other’s expertise.  It&#x27;s been a slow, steady process of increasing cohesion.  We&#x27;ve reached the point where we need to assume a single identity, that of NCC Group.<p>Being a part of this process as it unfolds reminds me a bit of watching the Voltron cartoon series as a child in the &#x27;80s.  The show featured pilots each commanding their own robot lions.  Robot lions are fierce, powerful beings.  But when they came together they&#x27;d form Voltron - a giant humanoid robot with the lions compromising each of it&#x27;s parts.  I like to think this is what&#x27;s happening at NCC Group.  What were previously separate companies each well accomplished in computer security are becoming a single even more formidable entity. &quot;Form arms and body! And, I&#x27;ll form the head!&quot;<p>So, what does this have to do with hiring?<p>Growing a larger company requires a larger number of individuals.  We still need candidates with the same skills as always; programming, reverse engineering, protocol analysis, web application building&#x2F;breaking, adversarial thinking.  We need people who understand technology and can identify flaws in how it&#x27;s implemented.  We need those who can look at a security weakness, and accurately gauge it&#x27;s relative risk to the organization.  And we need folks who can communicate that risk to multiple audiences, in varying levels of detail.<p>There&#x27;s no better time than now to join us.  Our integration effort has opened up opportunity within the company to focus on areas of specialization, advance skills, and take on ever more complex projects and challenges.  If you&#x27;ve always wanted to be part of something new, but found yourself averse to the risk of early stage start ups, joining us now might be a way to do both.  We&#x27;re stable but we&#x27;re evolving and changing, and our employees will shape what we become.<p>If you want to learn more about us check out our:\n   Blog - <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;blog&#x2F;</a>\n   Cryptopals - <a href=\"http:&#x2F;&#x2F;cryptopals.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;cryptopals.com&#x2F;</a>\n   Microcorruption - <a href=\"http:&#x2F;&#x2F;microcorruption.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;microcorruption.com&#x2F;</a><p>If you&#x27;re ready to apply, contact us at:\n   <a href=\"https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nccgroup.trust&#x2F;us&#x2F;careers&#x2F;</a><p>Please, bear with us on the sites above.  We&#x27;ve migrated a boatload of content, and it&#x27;s likely there will be some website wrinkles.  We&#x27;ll iron them out as soon as we can (mostly we&#x27;ll just keep breaking interesting software).<p>~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~","time":1433180560,"type":"comment"}