{"by":"baran","id":9640133,"kids":[9640558],"parent":9639001,"text":"healthfinch (www.healthfinch.com&#x2F;careers) - Madison, WI<p>Healthcare is unnecessarily complex, healthfinch aims to fix that. We do so by building applications that seamlessly integrate into electronic health record systems to automate pieces of the physician’s day. Our award-winning tool, Swoop has significant traction, but we are not resting on our laurels. Instead, we are quickly building out three additional applications and the platform we need to support them.<p>Software Engineer - Remote, Onsite<p>Join our modest development team and change the way the health care industry works! We’re scaling to more customers, integrating with a broad range of medical systems, and building out capabilities that will impact the day-to-day lives of thousands of doctors, nurses, and other heath care practitioners.<p>We work with Ruby and Javascript on our current apps, but believe in the philosophy of using the best tool for the job.<p>Lead UX Designer - Remote, Onsite<p>At healthfinch, we’re looking for a passionate, talented and experienced Lead UX Designer who can help us optimize our flagship application while guiding the aesthetics, functions and experience of our new suite of applications. Our Lead UX Designer will work closely with our Engineering, Customer Success, Sales and Marketing staff to understand the complex healthcare IT landscape, our vision for our future products and most importantly, the needs of the customers.<p>You are a strong candidate for healthfinch if you have deep experience in UX design&#x2F;research and can demonstrate an ability to take an application from concept to market. You must be a gifted communicator who is able to solicit meaningful feedback from clients and can, in turn, prioritize feedback with staff to incorporate it into our product roadmap. You understand that great product design is a result of intense collaboration, multiple iterations, patience and persistence.","time":1433177600,"type":"comment"}