{"by":"rdl","id":9640625,"parent":9639001,"text":"CloudFlare, Inc<p>Locations: San Francisco, CA, US; London, UK; Singapore, SG; VISA ONSITE<p>CloudFlare is the leading edge network performance and security company -- with customers ranging from &quot;mommy blogger&quot; WordPress blogs all the way through large, highly dynamic sites like HN, Reddit, and many enterprise sites.  There are all the challenges of making the Internet better from a performance perspective as well as trying to drive security forward for everyone.<p>We&#x27;re rapidly growing and always looking to fill a variety of roles (we started 2015 at 128 and are looking to double every year...), but a few in particular.<p><a href=\"https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cloudflare.com&#x2F;join-our-team</a> has a full listing.  Please apply through the website.<p>1) Principal Engineer -- we&#x27;re looking for someone who can help re-architect the parts of our site which are starting to show scaling issues (a high class problem to have).  A lot of our stack is in PHP and Postgres stored procedures, but there&#x27;s no requirement it remain so, and no requirement you be a PHP expert.  We&#x27;re very interested in fully transitioning to Go and a microservices architecture, so we&#x27;d highly value someone who is familiar with the transition.  \n<a href=\"http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;cloudflare&#x2F;principal-engineer&#x2F;cDJc8g-Zir5kwJiGaltGfR\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;cloudflare&#x2F;principal-engineer&#x2F;...</a><p>2) VP Engineering -- \nOur team is growing rapidly (and &gt;50% engineering), and we&#x27;re looking for an engineering leader with a people-first philosophy.  We&#x27;re looking for someone with a track record of snipping great products and who can build great organizations where engineers love to work.\n<a href=\"http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;cloudflare&#x2F;vp-of-engineering&#x2F;cacM-A8N4r5jGgiGaltGfR\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;cloudflare&#x2F;vp-of-engineering&#x2F;c...</a>","time":1433180537,"type":"comment"}