{"by":"conorgil145","id":9640737,"parent":9639001,"text":"Virtru | Washington, DC or REMOTE (within America) | Fulltime | Javascript fullstack, iOS, .NET<p>== Who we are ==<p><a href=\"https:&#x2F;&#x2F;virtru.com&#x2F;how-it-works\" rel=\"nofollow\">https:&#x2F;&#x2F;virtru.com&#x2F;how-it-works</a><p>Everyone has a right to keep their digital content private and secure. We founded Virtru because we believe that exercising that right should be easy and convenient.<p>Virtru allows you to send end-to-end encrypted email using your existing email address and existing email provider with the flip of a switch.<p>We have browser extensions for Chrome&#x2F;Firefox, apps for  iPhone and Android, and a plugin for Outlook desktop.<p>Our full time team of ~23 is currently 50% engineers. We value automated testing, readable&#x2F;maintainable code, documentation, and code reviews. We run in 2 week sprints and dedicate about 20% of total capacity to things the dev team thinks are important (technical debt, refactoring, exploring a new technology, etc), while the rest goes to feature development and addressing bugs.<p>We are well capitalized with investments from Bessemer Venture Partners [0] and private investors.<p>== Current positions ==<p>1) Full stack NodeJS&#x2F;Javascript developer with expert level CSS, JS animation, and demonstrated high-end UI&#x2F;UX experience.<p>2) Full stack NodeJS&#x2F;Javascript developer with experience deploying and maintaining services and infrastructure in AWS using automated tools such as Terraform, Ansible, Chef, Puppet, AWS CloudFormation, etc.<p>3) C# .NET developer with experience developing MS Office and Office365 add-ins to support our Outlook desktop and Office365 add-ins.<p>4) iOS Developer with experience leading a team of mobile developers to support our Virtru Mail Apps.<p>== Get in touch ==<p>If you care about privacy and are interested in creating security products at a company which thinks that user experience is a first class citizen, please get in touch! Send a secure email (using Virtru!) to jobs@virtru.com with subject “HN who is hiring response” and tell us what interests you about Virtru. It would be great if you can provide some sample code that we can check out (github, bitbucket, etc).<p>[0] <a href=\"http:&#x2F;&#x2F;www.bvp.com&#x2F;portfolio&#x2F;virtru\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bvp.com&#x2F;portfolio&#x2F;virtru</a>","time":1433181487,"type":"comment"}