{"by":"rsp1984","id":9640099,"parent":9639001,"text":"DotProduct -- Boston, MA or Wiesbaden, Germany<p><pre><code>  == 1. Senior R&amp;D Engineer in Computer Vision ==\n  == 2. Software Engineer in Mobile ==\n  \n  == 1:\n</code></pre>\nWe are looking for a software engineer with a strong 3D Computer Vision or Graphics background to join our R&amp;D team. Interesting things we are working on include Real-time Image Processing, SLAM, Optimization methods, Surface Reconstruction, Meshing, 3D Scene Management.<p>Candidates should be extremely proficient both on a theoretical &#x2F; algorithmic level and in practical implementation (mostly C++ and shader languages) of Computer Vision and Graphics algorithms.<p>Masters or PhD degree in CS or related fields with focus on Vision or Graphics is required, as well as practical product development or job experience.<p><pre><code>  == 2:\n</code></pre>\nWe are looking for an experienced, hands-on, detail-oriented developer with strong skills in C++ and&#x2F;or Java to join our application, UI and tools development.<p>We have a number of projects inside the company for which we are looking for support, from app development (Android, Windows, Qt) to internal tools, sensor integration and development of core technology.<p><pre><code>  == General information:\n</code></pre>\nBesides the opportunity to work in a world-class R&amp;D team on leading mobile 3D computer vision technology, we offer a great salary, benefits and and a nice work place with top-of-the-line work equipment. Significant equity is part of the compensation package.<p>Our R&amp;D team is still intimate so new hires can have a large impact on product and future developments. Both positions are local and full-time.<p><pre><code>  == About DotProduct:\n</code></pre>\nWe are a team of seasoned entrepreneurs and Computer Vision professionals that brings real-time 3D capturing to mobile devices equipped with advanced camera sensors.<p>We are backed by Intel Capital and various angel investors. Our office locations are Houston, TX; Boston, MA and Wiesbaden, Germany (R&amp;D). Contact is jobs (at) dotproduct3d (dot) com www.dotproduct3d.com","time":1433177429,"type":"comment"}