{"by":"interurban","id":9640713,"parent":9639001,"text":"Maxymiser | New York City - NYC | Onsite | Full time<p>Maxymiser helps Fortune 100 companies optimize their websites through the use of A&#x2F;B testing,\nmultivariate testing and personalization. Founded in 2006, Maxymiser has grown to be a market leader in our space, and we continue to grow our team in NYC.<p>We&#x27;re looking for a front-end developer&#x2F;solutions engineer to join our team in NYC.  We support our US clients in their A&#x2F;B testing programs.  We&#x27;re front-end generalists by necessity, our clients use every version of every library and framework out there and we support them all.  I&#x27;ve copied an abbreviated version of the description below, let me know if you have any questions - you can reach me at joe.thackery @ maxymiser.com<p>Solutions Engineer:<p>ABOUT THE JOB<p>- You will provide front-end development support and coding best practices to Fortune 100 companies.<p>- You will communicate technical problems and solutions to technical and non-technical users.<p>ABOUT YOU<p>- You are well-versed (2+ years) in JavaScript, HTML and CSS.<p>- You are comfortable with multiple JS libraries (Dojo, jQuery, etc.) and MVC frameworks (Angular, Ember, etc.)<p>Bonus: You are familiar with website user testing (A&#x2F;B and Multivariate testing).<p>Bonus: You have experience with analytics platforms (Google Analytics, Omniture, etc.)<p>ABOUT MAXYMISER<p>- Casual, relaxed work environment.<p>- Ping pong, billiards and comfy work stations (beanbag chairs and treadmill desks) in our office in Flatiron&#x2F;Gramercy.<p>- Catered lunches and a well stocked kitchen.<p>- Competitive compensation and benefits.<p>See the full description (and apply) here: <a href=\"http:&#x2F;&#x2F;www.jobs.net&#x2F;jobs&#x2F;maxymiser&#x2F;en-gb&#x2F;job&#x2F;United-States&#x2F;JavaScript-Solutions-Engineer&#x2F;J3J6786MB2QGT2ML36T&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobs.net&#x2F;jobs&#x2F;maxymiser&#x2F;en-gb&#x2F;job&#x2F;United-States&#x2F;J...</a><p>or contact me at joe.thackery @ maxymiser.com","time":1433181198,"type":"comment"}