{"by":"chetanahuja","id":9641009,"parent":9639001,"text":"PacketZoom | SF Bay Area (San Mateo) | INTERN | VISA (CPT&#x2F;OPT processing) ok.:<p>We&#x27;re looking for one intern with deep interest in system and network level issues, protocols (TCP&#x2F;HTTP&#x2F;UDP based protocols etc) and Unix System level programming in C&#x2F;C++. Additional interest in mobile programming (iOS&#x2F;Android at the lower layers of the system) would be a bonus. Connect at jobs@packetzoom.com or directly with me, CEO&#x2F;CTO of the company (my user info is in the profile).<p>You&#x27;d be working at our San Mateo office. If you&#x27;re a student in a US university but far away from the Bay Area, don&#x27;t worry. We&#x27;d make travel and living arrangements for you at company expense. Unfortunately we can&#x27;t process candidates from foreign universities at short notice (much as we&#x27;d love to).<p>PacketZoom was started with the goal to completely change how mobile devices communicate with the cloud. We&#x27;ve created a tech stack and cloud service to upend the tired old TCP&#x2F;HTTP stack with a more mobile friendly networking protocol built on top of UDP.<p>Read this for the background and our motivations: <a href=\"https:&#x2F;&#x2F;packetzoom.com&#x2F;blog&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;packetzoom.com&#x2F;blog&#x2F;</a><p>Discussed here on HN: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9354279\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9354279</a><p>We ran an Intern program for the first time last year with two amazing interns from Harvard and CMU respectively. One of them wrote a review:<p><a href=\"http:&#x2F;&#x2F;www.glassdoor.com&#x2F;Overview&#x2F;Working-at-PacketZoom-EI_I..\" rel=\"nofollow\">http:&#x2F;&#x2F;www.glassdoor.com&#x2F;Overview&#x2F;Working-at-PacketZoom-EI_I...</a>.<p>Come join us in the beautiful Downtown San Mateo, CA for a summer of fun combined with occasional hard work and learning.. or the other way round.<p>Connect at jobs@packetzoom.com or directly with me (my user info is in the profile).","time":1433183550,"type":"comment"}