{"by":"dlau1","id":9641760,"parent":9639001,"text":"Good Eggs - San Francisco, CA, Full Stack Engineers<p><a href=\"http:&#x2F;&#x2F;www.goodeggs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.goodeggs.com</a><p>=== About us ===<p>Good Eggs brings local, farm-fresh groceries right to your door! We are a technology focused company with a CTO who previously founded Carbon Five, an exceptional agile development shop. See our Engineering Blog and Github account:<p><a href=\"http:&#x2F;&#x2F;bites.goodeggs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bites.goodeggs.com</a><p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;goodeggs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;goodeggs&#x2F;</a><p>We have a great mission (<a href=\"https:&#x2F;&#x2F;www.goodeggs.com&#x2F;philosophy\" rel=\"nofollow\">https:&#x2F;&#x2F;www.goodeggs.com&#x2F;philosophy</a>) - to grow and sustain local food systems worldwide - and everyone here is deeply committed to it. We have expanded to 4 cities - New York, New Orleans, Los Angeles and San Francisco - and our investors include Sequoia Capital, Harrison Metal, Baseline Ventures, Collaborative Fund and Westly Group, among others.<p>There are ~20 of us on the engineering team and we’re actively growing. We’re building next-generation web and mobile applications with JavaScript across the stack, including Node.js, MongoDB, AngularJS, and CoffeeScript. The team has been built from the ground up with practices around test-driven development, pair programming, and continuous deployment.<p>== About you ===<p>Ideal Candidates Will Have:<p>* 3-5+ years full-stack web application development in Ruby, Python, Java, or JavaScript<p>* TDD experience &#x2F; experience with pairing &#x2F; Continuous Deployment<p>* Domain expertise in: e-commerce, billing, payments, or warehouse distribution software<p>======<p><a href=\"http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;goodeggs&#x2F;software-engineer&#x2F;cQ_hd-0USr4Om7eJe4iefn\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobscore.com&#x2F;jobs2&#x2F;goodeggs&#x2F;software-engineer&#x2F;cQ_...</a><p>I’m an engineer at the company, if you have any questions feel free to e-mail me: daryl(at)goodeggs.com","time":1433189286,"type":"comment"}