{"by":"DigiRecruit","id":9641535,"kids":[9643193],"parent":9639001,"text":"CAPITAL ONE: Senior Product Manager | San Francisco, CA (ONSITE) | rin.chon@capitalone.com<p>The founder and CEO of our company, which went public in 1994, mandated that we digitally reimagine our business and bring design to the forefront of our products. He challenged us to disrupt the banking industry and become a tech company that also happens to be a bank. Our San Francisco based team, D3 (Data + Design + Disrupt) embraces this mandate by following a human-centered approach for product development and by creating new B2B business models grounded in financial transaction data. We are a small entrepreneurial team that operates more like a startup than a $46 billion dollar bank. We are using data to build a new marketing platform for Fortune 500 retailers from scratch.<p>We need you to: \n-Help define product strategy and roadmap based on the Customer Development process for a new B2B marketing platform used by national retailers. \n-Collaborate with our data scientists, designer, business analyst, and developers to create insightful and actionable data visualizations. \n-Independently lead day-to-day execution of the roadmap and project management including wire frames, pilots, timeline planning, user stories, etc. \n-Use your analytical side to productize insights uncovered by our data teams and work with external partners to test these insights in a hypothesis-based approach followed by building a scalable product.<p>Preferred skills and knowledge: \n-Have deep knowledge of digital advertising channels, strategies, and attribution models.\n-Demonstrated use of the Customer Development process to build products.\n-Proven ability to execute quickly and simply with a strong bias towards action.\n-Demonstrated analytical mind that can turn data analysis into a product.<p>Basic Qualifications:\n-Bachelor’s degree or military experience.\n-At least 5 years experience in a product-management role.<p>===========================================================\nAt this time, Capital One will not sponsor a new applicant for employment authorization for this position.<p>No agencies please.<p>Capital One is an equal opportunity employer committed to diversity in the workplace. Capital One promotes a drug-free workplace.<p>All qualified applicants will receive consideration for employment without regard to gender, race, color, age, national origin, religion, disability, genetic information, marital status, sexual orientation, gender identity&#x2F;assignment, citizenship, pregnancy or maternity, protected veteran status, or any other status protected by applicable national, federal, state or local law.<p>Capital One will consider for employment qualified applicants with a criminal history in a manner consistent with the requirements of applicable laws regarding criminal background inquiries, including, to the extent applicable, Article 23-A of the New York Correction Law; San Francisco, California Police Code Article 49, Sections 4901-4920; Newark, New Jersey Ordinance 12-1630; and other applicable federal, state, and local laws and regulations regarding criminal background inquiries.","time":1433187509,"type":"comment"}