{"by":"wtvanhest","id":9641218,"parent":9639001,"text":"Capital Peers – San Francisco, CA – Full-time (local only)<p>We are a B2B Financial Technology company focused on bridging the gap between institutional investors and small real estate funds.  Small real estate funds often are a source of risk in the form of Ponzi Schemes, failed compliance and style drift (investing in assets they are not supposed to).  Our business eliminates those risks and helps institutions make investments in funds that would have been impossible prior to us launching.<p>I am the founder with 5+ years of experience in commercial real estate brokerage and 3 years at BlackRock (the world’s largest asset manager).  <a href=\"http:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;williamvanhest\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;williamvanhest</a><p>I left BlackRock to start this company and I now have two part-time people and I am in late stage negotiations with several full-time people.  We are currently scheduling meetings with angels and VCs during the last two weeks in July and expect to be funded shortly after.  We will be renting office space in SOMA, hopefully in between BART and Caltrain.<p>I am interested in meeting people who would consider a position in FinTech or finance and are looking for a new opportunity between now and the conclusion of our angel raise in July.<p>POSITIONS:<p>Senior Software Developer – I would like to recruit a senior developer with a lot of experience who is comfortable leading the development team.  We will be automating a lot of work and we will be designing interfaces for institutional investors.  I programmed the current site in rails but I am language agnostic, as long as it is a modern language (rails, node, python etc.)  You would be considered a founding team member with equity that reflects that and a salary that matches the founding team salaries.  (again, local only)<p>Finance &#x2F; Real Estate – Senior finance or real estate manager - Founding team member with deep real estate, asset management, or investment banking experience.  This role (like the founder’s role) will involve business development as we ramp the customer base and you must be comfortable picking up the phone and talking to clients.  You also must be comfortable managing a small team and help them develop.  Generous equity will be granted and the salaries of all ‘founding’ team members will be set equal to each other.<p>Please reach out to the founder at william@capitalpeers.com","time":1433184941,"type":"comment"}