{"by":"racycle","id":9642658,"parent":9639001,"text":"My current employer is looking to fill a software engineering role. We&#x27;re based in Sunnyvale, CA (close to Hwy 237 &amp; 101).\nLooking forward to hearing from you:\nbassem@kumunetworks.com<p>Here&#x27;s the description of the role:\n=========\nRole: Software Engineer<p>Kumu Networks is revolutionizing the way wireless systems are built using an innovative full-duplex wireless design that its co-founders developed in their research at Stanford University. Kumu&#x27;s patented full-duplex technology changes the basic assumptions on which current wireless radios are built, allowing for improved performance and reduced complexity in a variety of wireless devices and affecting all wireless markets.<p>To work on ground-breaking technology like full-duplex wireless, our engineers must be agile, have diverse skills, and have the desire to tackle diverse and challenging problems. Often, our best innovations require a holistic approach. In software terms, this translates to using a variety of different languages and tools. Engineers at Kumu have both the technical skills to get into the details of and execute on new design, as well as to help lead the team to success.<p>You are, first and foremost, a versatile software engineer who is comfortable using a variety of interpreted (python) and compiled languages (C++). You will be responsible for definition, development, and testing of a variety of software components, ranging from embedded control of full-duplex systems to higher-level infrastructure networking &amp; management to helping build out internal Kumu tools like automation frameworks. You will specify and drive implementation of a variety of algorithms, drivers, and networking components running on embedded Linux platforms, including the implementation of control algorithms, drivers for custom FPGA blocks, and integration with layer 2&#x2F;3 networking stacks. You are a skilled software problem solver and a keen architect in software separation and interfaces, but also familiar with networking and communication concepts, fluent in C and <i>nix APIs, an avid unit tester, and comfortable with source code control with Git. Bonus points include a healthy thirst for automation, experience with embedded systems, experience with python, and experience with Shell scripting.\nRequirements\nDemonstrated ability to design, build, and ship software on Linux platforms\nExperience with build systems (make), source control (Git), and bug tracking systems\nFamiliarity with modern software engineering practices like unit testing and code review\nKnowledge of Ethernet and IP networking protocols (ARP, DHCP, VLAN, IP, TCP&#x2F;UDP etc)\nClear written and spoken communication, ability to create functional and design specifications\nExperience working with new hardware platforms, bringing them from bare metal up to linux\nBS  in Computer Science or related field\n5+ years of experience\nBonus Points\n·   Experience working for a start-up company\n</i> Experience designing software&#x2F;specifying CPU requirements for ASIC development\n· Experience with cellular protocols like LTE and&#x2F;or 3G\n· Product validation and reliability testing","time":1433197735,"type":"comment"}