{"by":"gungun99","dead":true,"id":9642552,"parent":9639001,"text":"Spartan Software in San Francisco is looking for a Software Engineer<p>We’re hiring talented Software Engineers to join our small team of localization experts.<p>* Design cost-effective translation automation solutions for our customers.  \n* Develop world-class engineering products for our customers. \n* Participate in open source initiatives. This is a big one here and we can’t wait to tell you more about this in person!<p>We’re looking for: \n* 2+ years of Java experience. \n* 2+ years of professional software engineering experience. \n* Experience developing a web application or web-based internal tool. \n* Interest in learning new technologies and contributions to open source. Feel free to share a link to a project you’re proud of or your GitHub. \n* Strong communication skills and an interest in communicating occasionally with clients. \n* Experience with relational database&#x2F;MySQL design. \n* Bachelor’s degree in a STEM field.<p>We’re offering: \n* Competitive salary and annual bonus structure. \n* Fidelity SIMPLE IRA to help you save for the future. \n* Full medical and dental benefits. We cover 100% of the premiums for employees. \n* 15 days PTO + 10 paid holidays off annually + the day off on your birthday \n* Opportunity to travel internationally to attend industry events and conferences. \n* Relaxed office close to Muni and bus lines near Golden Gate park. \n* We do a lot of team lunches and 1-on-1s here. We believe very strongly in the importance and benefits of setting aside time to talk, whether it’s on your team or with company leadership members. We’re a place where we encourage you to have your voice heard. \n* We value work-life balance here at Spartan, which means regular work hours and flexible schedules so you can manage your priorities outside the office :)<p>Love Spartan but want to work remotely? We&#x27;re open to remote employees, as long as they want to travel to SF as needed.<p>How To Apply: <a href=\"http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;932\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;932</a>","time":1433196682,"type":"comment"}