{"by":"tomonocle","id":9642335,"kids":[9648683],"parent":9639001,"text":"ITV plc &#x2F; Platform Engineer(s) &#x2F; London, UK &#x2F; Onsite (+wfh)<p>ITV are building a new platform to host all of our applications - internal and external. Whether it’s the system that sells the adverts for Corrie, pays Ant &amp; Dec, schedules Emmerdale for broadcast or gets TOWIE on to the ITV Player, it’ll live here and you can help build it.<p>As a Platform Engineer you’ll be a part of the team responsible for a product end-to-end. Working closely with the developers, testers, product owners and scrum masters you’ll make sure the environments are ticking over nicely, polish the build pipeline and make sure everything’s looking good in production.<p>You’ll be jointly responsible for the quality of everything the team produces - if you build it, you run it. One day you might be helping design a new microservice, the next watching your system handle millions of requests during the X Factor final. The coffee’s pretty good too.<p>Our ethos is simple: Automate, automate, automate. We believe in using the right tool for the job - right now we’re using things like AWS, docker, jenkins, sensu, redis, terraform, centos, rabbitmq, nginx, varnish, haproxy, trello, github, slack and openstack - but we’re always keeping an eye on the future and experimenting with new tech.<p>We want our team to be two things: ‘smart’ and ‘kind’. If that’s you and this sounds like fun then please get in touch - email + linkedin in my profile.<p>Tom<p>What we offer:<p>* Great salary<p>* Five weeks holiday (plus national holidays)<p>* Annual bonus<p>* Training + conferences<p>* SAYE scheme (discounted shares)<p>* Life cover (4x salary)<p>* Generous pension (matches your contribution + 3%)<p>* ‘Relish’ scheme: gym, extra holiday, cycle to work, childcare vouchers, private healthcare<p>* Volunteer days<p>* Further education sponsorship<p>* Discounts at highstreet + online retailers<p>* Tickets to shows","time":1433194571,"type":"comment"}