{"by":"shedd","id":9643789,"parent":9639001,"text":"Zoomer (YC S14) – SAN FRANCISCO OR REMOTE<p>Zoomer is building a new take on food delivery - a platform to handle an extraordinarily high volume of concurrent deliveries from restaurants that already deliver (i.e. pizza, wings, sandwiches, etc.).  We’re bringing much needed change to local high-volume delivery restaurants that are still doing delivery the way they’ve always done it. Our restaurants and their customers love the service, and our order volume is surging. You’ll make a real impact working to build and scale Zoomer as we continue to grow to new restaurants and territories.<p>We have amazing investors behind us, including Y Combinator (S14), First Round Capital, SV Angel, CrunchFund, Eric Ries, Gabriel Weinberg, the founder of DuckDuckGo and others.  This is your opportunity to get in on the ground-floor - we’re making key hires to build our core team. You’ll have a ton of impact – lots of freedom to evolve our platform, stack, and apps.  We follow strong dev practices, put an emphasis on testing, and deploy rapidly.<p>Help us build cutting-edge technical solutions to:<p><pre><code>  - tough logistics problems, quickly routing orders to optimal drivers in near-real-time.\n  - on-demand prediction and forecasting models\n  - scalable compute and data infrastructure\n  - multiple mobile apps - for restaurants and drivers - on both iOS and Android\n  - range of complex real-time frontend interfaces\n </code></pre>\nOur stack: We have an AI backend service that handles order routing, multiple mobile applications – for our drivers and restaurants, and several Ruby on Rails applications for customer-facing&#x2F;internal services.  We’re using Angular.js and CoffeeScript on the frontend. Our data team uses Python.<p>The roles we’re hiring for:<p><pre><code>  - Ruby on Rails engineers\n  - Artificial Intelligence engineer\n  - Data engineer\n  - DevOps engineer\n  - Data scientist\n </code></pre>\nIf this sounds interesting and you&#x27;d like to learn more, please apply here: <a href=\"http:&#x2F;&#x2F;www.zoomerdelivery.com&#x2F;#jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zoomerdelivery.com&#x2F;#jobs</a>","time":1433218136,"type":"comment"}