{"by":"brassdan","id":9643251,"parent":9639001,"text":"HERE maps | Berkeley, San Francisco Bay Area | Web Developer &#x2F; Tools Engineer<p>Nokia HERE is a global leader in the mapping and location intelligence business. HERE Reality Lens (<a href=\"https:&#x2F;&#x2F;realitylens.here.com\" rel=\"nofollow\">https:&#x2F;&#x2F;realitylens.here.com</a>) utilizes advanced reality capture technologies to collect, process, and publish petabytes of street-level, aerial, and indoor spatial data to customers in over 72 countries around the world. These software and data services, the sixth largest on AWS, allow users to visualize high-resolution 3D panoramic and oblique imagery while interactively measuring, mapping, and modeling.<p>As Web Developer &#x2F; Tools Engineer, you would:<p>- Create Canvas&#x2F;WebGL and DOM-based solutions integrating 2D maps, 3D imagery and LIDAR point clouds.<p>- Design and implement web-based tools for managing live operations and other shared platform services using a Node.js technology stack.<p>- Integrate software with HERE platforms, processes, pipelines, and products.<p>- Design data models for SQL and NoSQL databases and caches. (MySQL, MongoDB, Redis).<p>Please have:<p>- Experience with Cloud Computing platforms and Linux (e.g., Amazon AWS).<p>- Experience with HTML&#x2F;CSS&#x2F;JavaScript&#x2F;TypeScript using client-side frameworks such as Angular.js, server-side frameworks such as Express, and full-stack frameworks such as Meteor.<p>- Experience modeling and implementing scalable and robust data storage in any of MongoDB, DynamoDB, PostgreSQL, MySQL.<p>- Experience achieving quality and user satisfaction metrics for customer facing web applications.<p>- A thorough understanding of all things HTTP, including patterns for RESTful design, scalability, and security.<p>- Good computer science fundamentals including an understanding of data structures and algorithms, their runtime and storage complexities.<p>To apply, please use this job post at <a href=\"http:&#x2F;&#x2F;sfbay.craigslist.org&#x2F;sfc&#x2F;sof&#x2F;5053881133.html\" rel=\"nofollow\">http:&#x2F;&#x2F;sfbay.craigslist.org&#x2F;sfc&#x2F;sof&#x2F;5053881133.html</a> . I am also recruiting a Java backend and C# front-end engineer on craigslist for my team.","time":1433207619,"type":"comment"}