{"by":"gungun99","dead":true,"id":9643110,"kids":[9643120],"parent":9639001,"text":"iMatchative in San Francisco is looking for a Sr. Full Stack Engineer<p>The Role: \nWe’re hiring a Senior Full Stack Python Engineer to join our growing engineering team. We have a lot of interesting challenges that all involve delivering a Service Oriented Architecture -- from entity detection, related entities, extracting data from a variety of unstructured sources, machine learning systems to analyze this data, and an amazing single page application for our users.<p>You’ll help us get there, including: \n* Drive the design and implementation of Python components for a Single Page Application, including App frameworks and back end code. You’ll be working in App layer as well, not just writing algorithms in Python or solely back end services. \n* Coach and mentor peer engineers to become great Python developers and recommend Python best practices and tools. \n* Be responsible for designing and building REST APIs and services, including data serving, caching, and other core services such as authentication. \n* Document your design and code. \n* Employ development best practices and tools in a Continuous Integration environment.<p>What we offer: \n* True startup experience - a chance to disrupt an $11 trillion dollar industry \n* Direct access to advisors and executives who are the top experts in alternative investments, behavioral finance and data science from HBS, Stanford, LSE, and MIT \n* Working with an experienced and collaborative team to build a delightful, disruptive, world class product \n* Prime location in downtown San Francisco, close to BART, Muni and CalTrain \n* Generous compensation and equity. Excellent health, wellness, and 401k plans<p>Perks: \n* Mac or PC? You choose when you get here, along with a huge monitor. \n* Hungry? We&#x27;ve got a fully stocked pantry with snacks and drinks. \n* Speaking at a conference or holding a workshop? We&#x27;ll pay for your expenses. \n* Love listening to Spotify, Pandora, or Rdio? We&#x27;ll get you a subscription. \n* Personal development? We&#x27;ll set you up with a PluralSight subscription or GA classes.\nHow To Apply\n* To apply, click the link! <a href=\"http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;864\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;864</a>","time":1433204983,"type":"comment"}