{"by":"surething","id":9646499,"parent":9639001,"text":"Mac Application Software Engineer at Phase One - Frederiksberg, Denmark - Full-time ONSITE<p>We are looking for a top-notch software engineer to join our world-class software R&amp;D team behind the award-winning Capture One Pro software. As a part of our highly skilled and motivated team, you will work with OS X technologies on the Mac in the exciting world of pro photography to bring the best products into the hands of our demanding customers.<p>You will be an integral part of the Mac software R&amp;D team in Copenhagen. In close cooperation with your colleagues, you will design, implement and maintain Capture One and our other software products. You will have the opportunity to work on many different parts of our software and be involved broadly in the development process. In addition we offer:<p>* A challenging job at the forefront of technology.<p>* Innovative international environment with highly skilled colleagues.<p>* An informal environment with freedom to innovate.<p>* Great opportunities for personal and professional growth.<p>* Attractive salary.<p>Whether you have many years of relevant expertise or are right out of school, you might be the person we are looking for!<p>Check out our new medium format camera system : <a href=\"https:&#x2F;&#x2F;www.phaseone.com&#x2F;en&#x2F;Products&#x2F;Camera-Systems&#x2F;XF-Camera-System.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.phaseone.com&#x2F;en&#x2F;Products&#x2F;Camera-Systems&#x2F;XF-Camer...</a><p>Take a stab at Capture One : <a href=\"https:&#x2F;&#x2F;www.phaseone.com&#x2F;en&#x2F;Imaging-Software&#x2F;Capture-One.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.phaseone.com&#x2F;en&#x2F;Imaging-Software&#x2F;Capture-One.asp...</a><p>Read a little about us here : <a href=\"https:&#x2F;&#x2F;www.phaseone.com&#x2F;en&#x2F;FooterMenu&#x2F;About-us.aspx\" rel=\"nofollow\">https:&#x2F;&#x2F;www.phaseone.com&#x2F;en&#x2F;FooterMenu&#x2F;About-us.aspx</a><p>Upload your application to us via Jobfinder : <a href=\"http:&#x2F;&#x2F;www.jobfinder.dk&#x2F;job&#x2F;329513288&#x2F;mac-software-engineer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.jobfinder.dk&#x2F;job&#x2F;329513288&#x2F;mac-software-engineer&#x2F;</a><p>Some keywords could be: Objective-C, C++, RAW, Photography","time":1433259202,"type":"comment"}