{"by":"kdole","id":9647080,"parent":9639001,"text":"SF (Burlingame) - DevOps Engineer&#x2F;SysAdmin - Collaborative Drug Discovery, Inc.<p>We&#x27;re the leading hosted collaborative drug discovery informatics platform. Scientists around the world manage, analyze and securely collaborate around their data using CDD Vault. This type of collaboration is crucial to research on under-funded diseases like Tuberculosis and Malaria and also provides a strategic, competitive advantage in commercial markets.<p>Our long list of customers (<a href=\"https:&#x2F;&#x2F;www.collaborativedrug.com&#x2F;pages&#x2F;who\" rel=\"nofollow\">https:&#x2F;&#x2F;www.collaborativedrug.com&#x2F;pages&#x2F;who</a>) includes academic labs, biotechs, big pharmas, government laboratories, as well as leading funders of collaborations like the NIH, the EU FP7, and the Bill &amp; Melinda Gates Foundation. We&#x27;re small, profitable, and growing.<p>As the first full-time member of the operations team, you will be in charge of the infrastructure used to deliver the CDD Vault application. We have cabinets in two data centers, and have begun deploying an on-premises version of our application to customers with specific security requirements.<p>We believe in infrastructure-as-code. We are looking for someone who is already skilled at automating infrastructure management, or someone who has a SysAdmin background and a strong desire to strengthen their coding skills. You will be given significant leeway to do your job the way you think is best.<p>The ideal candidate has experience with a lot of the following:<p>* Linux&#x2F;Unix\n* Firewall and VPN configuration\n* Automated configuration management\n* Hardware monitoring and troubleshooting\n* Database replication, backups, and monitoring (MySQL)\n* Network and OS security hardening, monitoring, and auditing<p>...and a desire to learn about the rest.<p>You must:<p>* Be local to our Burlingame office or willing to relocate\n* Be able to participate in weekly on-call rotation with two other employees (we get paged outside of normal work hours less than once a month, and with your help we&#x27;d like to make incidents even less frequent)\n* Be independent, meticulous, and result-driven<p>To apply, please contact me at the email address below with your resume and a brief explanation of why you would like to work with us. The email address has been gzipped, base-64 encoded and reversed to ensure that you are a human who can use command line tools.<p>=AAAA4hlEzGLAIQ5P78SX3kKp00SskMLK9iyMlUyP7MSx5sTWr8LPvyAAUVTfCLAIs4H","time":1433263466,"type":"comment"}