{"by":"mikeatlas","id":9649135,"parent":9639001,"text":"Weft - <a href=\"http:&#x2F;&#x2F;weft.io\" rel=\"nofollow\">http:&#x2F;&#x2F;weft.io</a> - Cambridge&#x2F;Boston, MA (office is in central sq.) -- LOCAL&#x2F;ON-SITE ONLY<p><pre><code>   ===========================\n   ====== What we do =========\n   ===========================\n</code></pre>\nWe&#x27;re the single source of truth in logistics -- we track every boat on the water, every plane in the sky, and every truck on the ground so that we can know everything that&#x27;s going on in the logistics world. We do a lot of analysis and optimization, too. We’re working in the largest, least sexy, most invisible industry in the world — 90% of everything has been on a ship at one point in time. The problem -&gt; Lots of inefficiencies in the supply chain! One of our customers spends $400mm&#x2F;year shipping empty containers, another spends $80mm&#x2F;year on late fees. Lots to optimize! How we fix it -&gt; We track everything in the supply chain and make predictions and recommendations as to what our customers should do!<p><pre><code>   ===========================\n   ===== How we do it ========\n   ===========================\n</code></pre>\nWeb&#x2F;data stack -&gt; clojure&#x2F;scala&#x2F;python + postgis&#x2F;redshift&#x2F;redis&#x2F;rabbit + ruby on rails + hadoop&#x2F;EMR&#x2F;Spark&#x2F;Docker (we’re a SOA shop)<p>Mobile -&gt; iOS, android, mobile web<p>Algorithms -&gt; a dizzying mixture of oldschool and newschool techniques... think ML, Neuro-AI modeling, and statistics<p>Hardware -&gt; think guts of a cell phone with hardening the of industrial systems, power management to last 5 years between charges done at the cost of a dinner<p><pre><code>   ===========================\n   ====== And the rest =======\n   ===========================\n</code></pre>\nWe&#x27;ve got some very interesting partners and customers (ranging from CPG companies and telcos to enterprise software providers to regional and international logistics companies). We also have some top tier investors (a16z, atlas)! Looking specifically for:<p>- Senior Firmware Engineer: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;weft&#x2F;jobs&#x2F;69235-senior-firmware-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;weft&#x2F;jobs&#x2F;69235-senior-firmware-engineer</a><p>If this sounds interesting, please shoot us an email at mike@weft.io or connect with us through the AngelList posting.","time":1433280370,"type":"comment"}