{"by":"clay_to_n","id":9654787,"kids":[9656191],"parent":9639001,"text":"Beverlywood &#x2F; Culver City, CA - Stasis Labs - <a href=\"http:&#x2F;&#x2F;www.stasislabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.stasislabs.com</a> | INTERNs OK<p>Stasis Labs is a health technology company building connected medical devices.  Our first product is a vital signs monitoring system for non-critical patients.  We’re initially targeting middle-class Indian hospitals, and our business model is especially suited for that market.  We’re starting in India but have global plans long-term, including coming back to America.<p>Our tech:<p><pre><code>  — Electrical engineering, analog circuit design\n  — C++ code on ARM microprocessors\n  — Bluetooth 4.0 (BLE) networking\n  — Android app: Java, material design, information display\n  — Web: Sails.js (node.js framework which includes Express), React.js\n</code></pre>\nYour role:<p><pre><code>  — Work with a microprocessor and Bluetooth 4.0 chip running C++ code and an Arduino stack to send data to an Android application\n  — Research Bluetooth capabilities and help design an effective data transfer implementation\n  — Work with Android developers as well as hardware designers.  You&#x27;ll be on the software team, but very close to the hardware\n</code></pre>\nIdeally you&#x27;d have strong skills in C++ or Java, with experience working with Arduino or a similar stack.  Having Bluetooth experience is a huge plus.  You should be comfortable in a quickly changing environment.  You should be willing to collaborate with everyone in the team, and potentially to play a larger part in the company as it grows.<p>We’re very early stage, but have had a lot of success at business competitions at USC and elsewhere.  We’re now taking this full-time and raising money on a convertible note. We&#x27;re working out of a house in Beverlywood (near Robertson and Pico).  Salary and equity compensation both flexible based on experience and skills. Less than 10 employees this summer.<p>We&#x27;re fine with working from home a few days a week, but we&#x27;d like you to start in the office for a week or two.  We&#x27;re still figuring out this policy, but we don&#x27;t believe in micromanaging people and want our engineers as comfortable as possible.<p>If you&#x27;re interested, email me (Clayton) at: stasislabs+hn@gmail.com","time":1433356509,"type":"comment"}