{"by":"Max2HQ","id":9662684,"parent":9639001,"text":"Max2 Inc, Makers of Scene - <a href=\"http:&#x2F;&#x2F;www.sceneapp.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sceneapp.io</a> - iOS Software Engineer - New York, NY or Seoul, Korea<p>Scene is a community powered discovery platform for surfacing real-time knowledge and offers on local venues. You can think of us as Waze for local places. We are looking for iOS engineers with a passion for delivering polished mobile user experiences and working through complex problems to join our development team and accelerate our app development. We offer competitive compensation and benefits including early stage company stock options. Work alongside a young, dynamic and talented technical team with experienced leadership and have direct meaningful involvement in building a new consumer platform in a real startup environment!<p>RESPONSIBILITIES<p><pre><code>     - Design and build advanced applications for the iOS platform \n     - Collaborate with the business team, designers and other developers to define, design, integrate and ship new features\n     - Setup proper interactions of the front-end design and implementation with backend servers\n     - Unit-test code for robustness, including edge cases, usability, and general reliability.\n     - Work on bug fixes and improving application performance &amp; continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n</code></pre>\nQUALIFICATIONS<p><pre><code>     - Graduating in May 2015 or have graduated from a Master’s or undergraduate degree in Computer Science or related fields \n     - 2+ Years of iOS development experience (Objective-C and&#x2F;or Swift) \n     - Strong understanding of MVC or MVVM architecture pattern \n     - Strong knowledge in object-oriented design, data structures, algorithm, and problem solving \n     - Proficient with memory management \n     - Ability to be detail-orientated but also design, build and iterate prototypes quickly \n     - Experience with Git, agile methodologies &amp; unit testing \n     - Strong but well founded opinions on code style, structure, automated processes and product building.\n</code></pre>\nSend us your resume and any links to your projects at:  careers@sceneapp.io","time":1433457752,"type":"comment"}