{"by":"squirrel","id":9704512,"parent":9639001,"text":"London, United Kingdom - Geckoboard - <a href=\"http:&#x2F;&#x2F;geckoboard.com\" rel=\"nofollow\">http:&#x2F;&#x2F;geckoboard.com</a> - ONSITE (but some working from home is no problem)<p>Geckoboard is a successful and growing 25-person B2B SaaS startup based in East London. Our elegant, real-time dashboards solve a difficult but valuable problem for thousands of paying subscribers, by taking the complexity out of connecting to their data and making that data simple for anyone to interpret at a glance. As a result, our customers unlock data they didn&#x27;t know they had, connect people and join up projects, and make better decisions faster.<p>We have a lot of exciting work ahead and are looking for curious and creative problem solvers to help develop our product and take it to even more customers. You&#x27;ll be joining a friendly team with great people in an environment with empowered developers, flexible working conditions, and a focus on skill development.<p>We are looking for full-time senior engineers, both front- and back-end. A variety of skills for modern, scalable web applications - e.g. React, Javascript, Go, Ruby, Chef - are of interest, but we like to have people learn on the job so don&#x27;t worry about any you might be missing. See our jobs page for details: <a href=\"https:&#x2F;&#x2F;www.geckoboard.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.geckoboard.com&#x2F;careers&#x2F;</a><p>We’re constantly striving to ensure that we offer the most encouraging, supportive and efficient environment possible. We want everyone on the team to be empowered to influence our architectural decisions. The whole team is involved in prioritising and evaluating our work and we regularly program in pairs to share knowledge, promote collaboration, and improve our code quality.<p>We don&#x27;t just pay lip service to work-life balance, we actively and strongly encourage it. Flexible working hours and the ability to regularly work from home lets you work in a way that fits you and your family. We see our contractual obligation to offer 25 days&#x27; paid holiday as a lower bound for everyone in the organisation, not a limit.<p>We actively contribute to personal and professional development and have a minimum budget allowance to be spent on courses, conferences, and books. We also run fortnightly &quot;innovation days&quot;, where everyone has complete freedom to work on anything that interests them, from contributing to open source, to learning a new skill, or improving our internal tools and processes.","time":1434094748,"type":"comment"}