{"by":"galori","id":9708894,"parent":9639001,"text":"StitchFix - San Francisco, CA - [REMOTE OK!] - <a href=\"http:&#x2F;&#x2F;stitchfix.com\" rel=\"nofollow\">http:&#x2F;&#x2F;stitchfix.com</a><p>We&#x27;re doing TONS of hiring, and solving some REALLY interesting problems. I just joined as Principal Engineer and I&#x27;m loving it. The business is an advanced algorithms &amp; machine learning recommendation engine applied to a Women&#x27;s Fashion e-commerce &#x2F; subscription service.<p>In english, we send our clients an outfit every few weeks, our algorithm and our stylists choose the perfect outfit for our customers, and they LOVE it. Just search instagram for hashtag &quot;#stitchfix&quot; and see how many of our customers post happy pictures of themselves receiving this month&#x27;s &quot;Fix&#x27;. Our customer referral-to-friend statistic is off the charts.<p>We&#x27;re hiring for these roles: Senior Full Stack Rails Engineer, Head of DevOps, Lead iOS Engineer, Data Engineer, Data Scientists, Product Designer, UX Designer<p>On the business side, it&#x27;s a startup but we&#x27;re profitable and we&#x27;re not planning on seeking additional funding! Its amazing to be part of a company that is experiencing so much growth and success.<p>On the Engineering side, we&#x27;re solving some really interesting problems. The Principal Engineer role which I just started is a very interesting type of position. We do not have Product Managers, and Principal Engineers are responsible for a part of the business (I&#x27;m responsible for part of the consumer facing web site). They are responsible for driving the product forward, working with all the stakeholders and then also implementing the solutions. I&#x27;m only 2 weeks in and I already think this is how all companies should operate (sorry PM&#x27;s!)<p>There is an entire separate department we call AA (Algorithms and Analytics), they are also hiring like crazy. They are working on really advanced machine learning recommendation algorithm and with every little improvement of the algorithm they can see real impact of increased sales and increase customer-sat (Tim Cook&#x27;s favorite quotes stat, which stands for Customer Satisfaction)<p>Anyway...don&#x27;t let the industry put you off, the smartest, most driven but nicest people work here and you&#x27;ll be doing yourself a disservice if you don&#x27;t at least consider it :)<p>Check out our engineering and algorithms web site: <a href=\"http:&#x2F;&#x2F;technology.stitchfix.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;technology.stitchfix.com&#x2F;</a> and here is our jobs page <a href=\"https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers</a>.<p>Email me at gsteinitz (at) stitchfix (dot) com and I can answer any questions for you, or connect you with the hiring manager depending on which job you&#x27;re interested in.<p>Gal","time":1434147306,"type":"comment"}