{"by":"jik","id":6476073,"parent":6475879,"text":"Quantopian - Boston, MA - Operations Engineer<p><a href=\"https://www.quantopian.com/about#jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.quantopian.com&#x2F;about#jobs</a>\njobs@quantopian.com<p>At Quantopian, we’re building the world’s first algorithmic trading platform in the cloud. Our engineers are all generalists who write, test, and deploy code across our stack. Each of us also has an area of deep, focused excellence. If you like keeping the gears turning smoothly, crushing hard problems, and working with really smart people, then you may be the operations engineer we’re looking for to help us change the world of finance.<p>As a Quantopian Operations Engineer, you’ll report directly to the Vice President of Operations and play a key role in expanding and maintaining our cloud infrastructure. Your primary responsibilities will include:<p>- designing and implementing improvements to our application infrastructure and continuous delivery pipeline;<p>- identifying gaps in our application monitoring infrastructure and propose and implement solutions;<p>- monitoring the performance and availability of our application, analyze and troubleshoot issues, and propose and implement improvements to prevent them from recurring; and<p>- participating in our on-call rotation and providing occasional after-hours support for production issues.<p><i>Skills &amp; Requirements</i><p>The ideal candidate will have experience in most of these areas:<p>- Hands-on management of Linux systems (Ubuntu preferred), 3+ years<p>- Python, Ruby automation scripting &#x2F; application development<p>- MongoDB &#x2F; other NoSQL databases<p>- Management and deployment of cloud-based infrastructure services such as Heroku, AWS, RightScale, Papertrail, PagerDuty<p>- Internet infrastructure services such as DNS, SMTP<p>- Development infrastructure services such as Github, Jenkins<p>Here are some of the Operations projects we’ve worked on recently.<p>- a Python class which uses off-the-shelf tools to manipulate the Interactive Brokers API Gateway, so that we can transparently log our users into their stock trading accounts through our application;<p>- Geckoboard status boards with custom push widgets that give us real-time visibility into site activity, with smart alerts about anomalies, displayed on a heads-up display in our office that’s driven by a Raspberry Pi; and<p>- strong encryption of our users’ intellectual property in our database, implemented using mongoid-encrypted-fields in our Ruby layer and a compatible Python class we built ourselves and integrated with Schematics.<p><i>About Quantopian</i><p>We’re still a small company (our daily standups include every employee!), so you’ll play a major role in shaping our direction and enjoy a complete lack of bureaucracy.<p>Our small size and ambitious goals dictate our approach to talent acquisition and retention: we believe in hiring the best engineers and giving them hard problems to solve and the autonomy to solve them.<p>Our office is conveniently located in Downtown Crossing.<p>We offer flexible work hours and a deeply ingrained respect for a healthy work&#x2F;life balance.<p>We offer generous benefits, including 401(k) matching, stock options, and health insurance with no employee premium.<p>FOSS is the foundation of our product, and we believe in giving back to the community. We’ve open-sourced Zipline, our backtesting engine (&gt;1,000 stars and &gt;180 forks!), as well as other code we’ve written, and we plan on opening up more of our code in the future.","time":1380635360,"type":"comment"}