{"by":"estsauver","id":6476952,"kids":[6489888],"parent":6475879,"text":"The Climate Corporation, <a href=\"http://climate.com/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;climate.com&#x2F;careers</a>, San Francisco, Seattle, Or KC Preferred (varies by position.)<p>I know we&#x27;re hiring for a wide variety of software positions, including Rails Engineers, Javascript Engineers, Clojure&#x2F;Java Engineers, project&#x2F;product people and a variety of scientific positions as well. If you&#x27;d like more details you can contact me personally at estsauver at climate period com or you can contact us through the Jobvite link.<p>========================================================\nAbout Us:<p>The Climate Corporation’s mission is to help all the world’s people and businesses manage and adapt to climate change. To achieve our mission, we have built a unique technology platform to enable, for the first time, the real-time pricing and purchasing of customizable weather insurance. Managing over 200 TB of data, including 34 trillion+ weather simulation data points, 150 billion soil type observations, and more than 3 million daily weather measurements, we are one of the largest users of Amazon Web Services.<p>Today The Climate Corporation is focused on helping farmers protect and increase their profits in the face of increasingly extreme weather. At the heart of the company is our unique Climate Insights™ technology platform, which encompasses our core competencies across weather monitoring, agronomic modeling, and weather simulation, and accounts for over 200 TB of data, including 34 trillion+ weather simulation data points, 150 billion soil type observations, and more than 3 million daily weather measurements. This platform powers the company’s portfolio of technology-based products and services, which are revolutionizing agricultural risk management and farm management.<p>At The Climate Corporation, leaving a mark on the world is in our DNA; we want to make a lasting and meaningful real-world impact. We relish big problems because they are the most interesting to tackle, the most rewarding, and typically, the most valuable to solve. We also thrive on finding the possible in the impossible.<p>If you are the best at what you do, you like solving interesting problems, and you are looking for like-minded people dedicated to having a major impact on the world, we are eager to talk with you.<p>See our video about what it’s like to work at The Climate Corporation: <a href=\"http://vimeo.com/63381109\" rel=\"nofollow\">http:&#x2F;&#x2F;vimeo.com&#x2F;63381109</a><p>What We Offer:<p>Our team is composed of some of the most brilliant interdisciplinary minds in the industry. The environment is extremely engaging and fast-paced, with dozens of specialties coming together to provide the best product possible product and experience for our customers.<p>Competitive salary, excellent benefits, and some of the best perks in the industry, including:\nStock options. Our success is your success The opportunity to learn business and sales operations skills at a company experiencing explosive growth\nWe provide meals and a large assortment of snacks, drinks, fruits, coffees, and teas to help you get through the day\nSpend 25% of your time (2 solid weeks out of 8) exploring personally compelling topics through independent research&#x2F;development work\nCompany sponsored outings, including go-kart races, kayaking, holiday yacht parties, and sporting events, etc.\nWe sponsor hackathons, meetup groups, networking events, tech-talks, and conference trips. If you want to get involved in the tech community, we&#x27;ll support your efforts\nWe encourage all employees to better understand our customers by getting out of the office and hearing firsthand from the agents and farmers our products serve\nEnergetic idea-driven work environment with an exciting culture\nExciting world-changing opportunity - we are solving problems that have a massive impact on the world\nA driven, talented team that aims to make a large-scale impact through an innovative technology platform<p>=====================================================<p>If you&#x27;d like to talk, please shoot me an email. I&#x27;ve only been at Climate for a little while, but if you think this is a place that would interest you, please reach out.<p><a href=\"http://jobvite.com/m?3TeB5gwy\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3TeB5gwy</a>","time":1380642852,"type":"comment"}