{"by":"NLShapeways","id":6476417,"parent":6475879,"text":"Senior UI Engineer, for SHAPEWAYS 3-D PRINTING (FULL TIME, New York, NY, NO H1-B SPONSORSHIP, www.shapeways.com)<p>Position Summary\nShapeways is looking for senior front-end engineers to build world-class user interfaces for our customers. If you’re a web developer&#x2F;application engineer and you have the skills to create highly interactive and well-designed web interfaces we are looking for you!<p>Responsibilities\n* Develop slick and performant web front-end for Shapeways Shoppers and Shop Owners.\n* Work closely with Dev, Product, and Design teams to construct creative solutions to complex problems.\n* Own the software architecture for Shapeways web and mobile web experiences.\n* Develop custom components that can be reused on site.\n* Optimize efficiency, scalability, and stability of Shapeways web properties.<p>Key Goals\n* Deliver high-quality web and mobile web applications on a weekly release cycle\n* Mentor software engineers and UI engineers on patterns and best practices<p>Minimum Qualifications\n* 6+ years full-cycle software development experience\n* Experience in a high-visibility iterative development cycle\n* Ability to assess project scope and timelines\n* Ability to create and evangelize frameworks and patterns\n* Leadership mentality\n* Relentless pursuit of awesomeness<p>Preferred Qualifications\n* Expert in HTML, CSS, and JavaScript\n* Knowledge of Compass, Sass, Jquery\n* Strong with either PHP, Java, Ruby, or Python\n* Mastery of responsive design and mobile web\n* Deep understanding of content delivery and client-side performance\n* Understanding of SSL and Security\n* Experience with shopper focused e-commerce<p>Why Join Our Team?\nShapeways is building out our front-end engineering team to build world-class interfaces for both web and mobile devices. The front-end engineering team will have ownership over the technical architecture and implementation of all customer facing Shapeways web properties. Candidates joining the Shapeways front-end engineering team will be getting in on the ground floor of a momentous opportunity to revolutionize how people make, buy, and sell products across the globe. If you are a positive entrepreneurial force with excellent front-end technical skills, you are the perfect fit for this role.<p>(EMAIL COVER AND RESUME TO natalie@shapeways.com)","time":1380638042,"type":"comment"}