{"by":"jillysciarilly","id":6476469,"parent":6475879,"text":"Rackspace (www.rackspace.com) - Remote OR Local (San Antonio&#x2F;Austin, TX) DevOps&#x2F;Automation Engineers<p>Apply Here: <a href=\"https://rackspace.hua.hrsmart.com/ats/js_job_details.php?reqid=15658\" rel=\"nofollow\">https:&#x2F;&#x2F;rackspace.hua.hrsmart.com&#x2F;ats&#x2F;js_job_details.php?req...</a><p>In recent years, new trends and methodologies have emerged to help build scalable, fault tolerant and repeatable web infrastructure configurations. Tools like OpenStack, Chef, git, Linux, NoSQL, and more are helping to drive this evolution. As a DevOps engineer you’ll be working with these tools daily and leveraging them to build complex environments for customers. These environments will be built on Public Cloud, Private Cloud, and Dedicated platforms to enable true hybrid infrastructure.<p>Additionally, you will leverage load tests to assist customers with performance tuning and capacity planning for their applications.  You will have the opportunity to contribute to open source tools that assist in configuration management, deployment and operation of high-availability, high-performance applications.<p>You:<p>• Extreme comfort with Linux operating systems.\n• Proficient web programming and scripting ability. \n• Proficient automation skills with Chef or similar. \n• Broad knowledge of the following with deep knowledge of some: PHP, Python, Ruby, Javascript, Memcached, LAMP, nginx, node.js, nosql, Varnish, git. \n• Working knowledge of software development methodologies including code profiling, regression testing, and continuous integration.<p>The role:<p>• Support medium complexity customers on an as-needed basis. \n• Collaborate with customers and other teams on tools for systems automation. \n• Work in conjunction with multiple teams to make sure that the infrastructure and customer applications work harmoniously together.<p>Must Haves:<p>• High school diploma or equivalent required.  \n• Bachelor’s degree in Computer Science, MIS or equivalent experience.  \n• Experience with high-availability, high-performance, open source web technologies.  \n• Experience with cloud platforms, open source databases and caching layers. \n• 3+ years commercial experience as either a LAMP stack software developer and&#x2F;or systems administrator with at least 1 year of current commercial experience working with a high-traffic site.","time":1380638508,"type":"comment"}