{"by":"jillysciarilly","id":6476525,"parent":6475879,"text":"Rackspace (www.rackspace.com) - Remote OR Local (San Antonio&#x2F;Austin, TX) Developer Support Engineers<p>Apply Here: <a href=\"https://rackspace.hua.hrsmart.com/ats/js_job_details.php?reqid=14172\" rel=\"nofollow\">https:&#x2F;&#x2F;rackspace.hua.hrsmart.com&#x2F;ats&#x2F;js_job_details.php?req...</a><p>Do you enjoy tackling new and unusual problems with software? Do you believe in open source? Do you like to keep up to date with advancements in technology? Do you want to spend 20% of your time at work contributing to an open source project of your choice? Are you interested in how companies all over the world create applications and run them in the cloud? If so, you should come work for the world’s leading open cloud provider within our Developer Support Team.<p>Ideal candidates will be passionate advocates of technology and open source. We&#x27;re looking for people who don&#x27;t just use these development tools and services, but people that write them. It is one thing to start a virtual machine on a host, it is another to have the curiosity to read the source code and figure out how it all works. Developer Support has two main functions: helping customers programmatically leverage our cloud services and contributing code, plugins, modules and extensions to projects and partners that are advancing the open revolution.<p>Role:<p>• Support customer developers coding against our APIs through phone, chat, forums, and email.\n• Contribute code to select open source projects.\n• Educate customers about product usage, options and capabilities by responding with clear documentation, reference architectures, or code samples.\n• Troubleshoot errors between the customer’s application and the Rackspace API.\n• Write code to help an ecosystem develop and thrive around OpenStack and Rackspace.\n• Engage actively blogs and forums with technical articles and answers.\n• Add insights to existing Knowledge Base.\n• Build tools for other Support functions to leverage.\n• Support customers by proactively sending them code samples and partnering with them to help them with their applications.\n• Test and verify bugs submitted on behalf of customers.\n• Suggest input on product, process, and service improvements as well as submit ideas for new products.\n• Conduct research on new technologies relating to open cloud features.\n• Provide feature explanation and coding best practices.\n• Record common or creative solutions for use by internal employees and customers to reduce repeat problems.<p>Must Haves:<p>• Experience with API documentation, wikis, forums and content management systems.\n• 4-5 years overall professional software development experience\n• 2+ years of scripting language development experience (Python, .Net, Ruby, Perl, PHP, etc.)\n• 3+ years of experience working in a Linux&#x2F;Unix or Microsoft development environment\n• Familiarity with object oriented development principles\n• Automation experience with Chef and&#x2F;or Puppet\n• Ability (and enthusiasm) to mentor less experienced developers\n• High school diploma or equivalent<p>Nice to Haves:<p>• Experience with Agile methodologies (Scrum, XP, Lean, Kanban, etc.)\n• Experience with good engineering practices (test driven development, continuous integration and pair programming, etc.)\n• Experience in distributed systems\n• Understanding of functional design principles\n• Experience in the Hosting Industry","time":1380638913,"type":"comment"}