{"by":"AmyLynchTW","id":6476546,"parent":6475879,"text":"Europe - Manchester | London | Hamburg\nThoughtWorks - Principal Technical Consultant<p>Our mission is to better humanity through software. We strive to achieve this by delivering disruptive thinking to companies with ambitious missions, keeping technology at the heart of what we do. As a Principal Technical Consultant, you&#x27;re responsible for creating and implementing cutting-edge technology solutions for our customers whilst driving software excellence to influence and shape the wider software industry as well as our business.<p>As a Principal Consultant at ThoughtWorks, here&#x27;s what we&#x27;ll be looking for you to bring:<p>- You love coding. Even if your recent roles have taken you away from being as hands-on as you might like, you&#x27;ve no doubt found other ways to keep your coding skills from getting too rusty and we expect that you&#x27;ll have had exposure to recent technologies. \n- You have a rich breadth of experience and are equally comfortable talking financial projections or business process modelling as you are advocating for TDD.\n- You really understand the business context of the challenges that organisations face and distinguish yourself in the way you articulate this with clients to create and deliver robust, scalable, elegant, flexible and relevant software solutions that truly transform industries.\n- Leadership is not something you do from far away, you get the importance of taking people with you along the journey and are able to influence and coach those around you to orchestrate team success.<p>As a Principal Consultant at ThoughtWorks, here’s what you can do:<p>- Directly guide the technical strategy for one of the world’s largest airlines. Build out a new capability within ThoughtWorks - perhaps for Mobile, Big Data or DevOps. Explore ways to improve our business relevance for customers. Create and implement an original tech solution to manage high broadcasts for a new live sports coverage. Travel and work on high impact global P3 (pillar 3) projects in locations such as Africa or Ecuador. Deliver the new technology platform for a government agency providing tailored information to the public&#x27;s needs. Speak at conferences. Influence and shape our client portfolio. Get published.<p>There&#x27;s no typical day or engagement for our Principal Consultants. You might spend a few weeks with a new client on a deep technical review or a complete organisational review, helping them to understand the potential that technology has to solve their most pressing problems. On other projects, you might be acting as the architect, leading the design of technical solutions, or perhaps overseeing a programme inception to build a new product. It could be much more about getting stuck into a delivery project where you&#x27;re equally happy coding and tech leading the team to implement the solution. Whatever your role the team always look to draw on your experience when things get tough and you often handle the difficult client conversations allowing the team to continue building software without undue pressure. You have great relationships with our new business team and work collaboratively to support pre-sales, meet prospective clients and ultimately influence and shape our portfolio of work.<p>You recognise that building your network is absolutely key to enable you to perform in your role - and you appreciate that it might be tough initially to find your place in our incredibly flat-structured organisation. You&#x27;ll be drawing on all of your passion for technology, recent hands-on coding experience and knowledge of latest tech and industry best practices to help you gain the respect and credibility of your fellow technologists.<p>About ThoughtWorks<p>ThoughtWorks is a software company and community of passionate individuals whose purpose is to revolutionize software design, creation and delivery, while advocating for positive social change. Our clients are people and organizations with ambitious missions; we deliver disruptive thinking and technology to empower them to succeed. In our 20th year, over 2300 ThoughtWorks employees - &#x27;ThoughtWorkers&#x27; - are currently serving clients from offices in Australia, Brazil, Canada, China, Germany, India, Singapore, South Africa, Uganda, Ecuador the U.K., and the U.S.<p>To apply (or to look at other global opportunities) please visit <a href=\"http://join.thoughtworks.com/apply\" rel=\"nofollow\">http:&#x2F;&#x2F;join.thoughtworks.com&#x2F;apply</a>","time":1380639100,"type":"comment"}