{"by":"lengads","dead":true,"id":6476060,"parent":6475879,"text":"London, UK - FULLTIME INTERN (REMOTE OKAY)\nCrowdScores: <a href=\"https://crowdscores.co.uk/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;crowdscores.co.uk&#x2F;jobs&#x2F;</a><p>Do you live and breathe the world of football? Know what makes a good story? Do you enjoy building engaging conversations that leave a lasting impression through blog posts, Twitter, and Facebook? If you’re nodding your head positively to all these questions, we want to talk to you!<p>You&#x27;ll get to work in a tight and growing team of smart people working at the heart of the Silicon roundabout to promote a really exciting new product. You&#x27;ll work directly with the co-founders and will gain invaluable experience helping an early-stage startup grow the hardest thousand users it ever will.<p>You must be passionate about football, enjoy watching as many games as you can, and be an confident communicator with your finger on the pulse of the game. You must also have a strong understanding of social platforms and communication.<p>We&#x27;re happy for you to work remotely and the role offers a subscription to all sports TV channels and any transport costs.<p>London, UK - FULLTIME PYTHON DEVELOPER\nCrowdScores: <a href=\"https://crowdscores.co.uk/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;crowdscores.co.uk&#x2F;jobs&#x2F;</a><p>We are looking for an exceptional person to grow our backend team. You should have strong experience in Python and love writing readable, idiomatic code. You will get the the opportunity to work with exciting technologies and large datasets in a real-time environment. We’re currently transitioning our server stack to an SOA built primarily with Nginx, Python, Django, Postgres, and MongoDB glued together with RabbitMQ and running on AWS. In this role you will certainly have the opportunity to influence the technological choices.<p>Please contact jobs@crowdscores.co.uk and read more at <a href=\"https://crowdscores.co.uk/jobs/\" rel=\"nofollow\">https:&#x2F;&#x2F;crowdscores.co.uk&#x2F;jobs&#x2F;</a>","time":1380635199,"type":"comment"}