{"by":"sshrinivasan","id":6477962,"parent":6475879,"text":"Zymeworks Inc. - <a href=\"http://www.zymeworks.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.zymeworks.com</a> - Vancouver, Canada<p>Position: Front-end software developer.<p>Zymeworks Inc. is a Canadian computational biotechnology company developing and utilizing predictive \ncomputational technology for the design of next-generation antibody-based therapeutics in the treatment of cancer, \nautoimmune and inflammatory diseases. Zymeworks is experiencing technical success, business success, and \nexciting growth.<p>Zymeworks is looking for an exceptionally talented software developer to complement our current team. We are \nlooking for motivated individuals who are eager to showcase their talent, demonstrating the passion and drive to grow \nwithin this progressive and developing Company.<p>Currently we have an opening for a Front-End Software Developer to take part in designing, building and expanding \nour suite of scientific data analysis and modelling tools.<p>Roles &amp; Responsibilities\n• Creating front-end web applications and their supporting back-end APIs for analyzing and visualizing in-silico and biological data.\n• Writing tools to enable our scientists to develop, analyze and interpret in-silico and biological data at a high \nlevel.\n• Integrating and maintaining the developed software as part of the entire computational platform.\n• Developing data exploration tools and innovative visualizations to transform information into knowledge. \n• Formulating initial specifications based on requirements and feedback from our scientists, implementing the \nspecifications, and ensuring reliability of the final product.\n• Coordinating with the scientific staff and the software development team to propose new directions and \nsolutions for data interpretation, visualization and integration with other in-house tools.<p>Our Platform\nCandidates should have demonstrable experience in, or an interest working with the following technologies:\n• JavaScript (AngularJS, D3, WebGL)\n• Python (NumPy, Pandas)\n• Go \n• SQL<p>Qualifications &amp; Experience\n• A Bachelor’s degree in Computing Science, Engineering, or equivalent. \n• Proven experience developing and maintaining JavaScript based web applications, their supporting backend APIs and other associated infrastructure.\n• Experience developing software on Linux or Mac OS X.\n• Fluency in English, spoken and written.\n• Applicants with proven and demonstrable experience developing large-scale data analysis, exploration and \nvisualization tools will be given preference.<p>Zymeworks is a dynamic and progressive company. Our people are passionate, engaged and extremely motivated to \nsucceed. Our environment is relaxed and collaborative yet focused and pragmatic. To learn more about Zymeworks \nInc. and our current openings, please visit our website at www.zymeworks.com.\nCompensation is on par with industry standards and commensurate with experience and includes an extended \nbenefits plan and participation in the employee stock-option plan. If you are interested in applying for this position, \nplease email your curriculum vitae and cover letter including available start date in PDF format to \ncareers.1278@zymeworks.com with &quot;1278: Front End – Software Developer&quot; in the subject line. Due to the high \nvolume of applicants, only those selected for interviews will be contacted.","time":1380650913,"type":"comment"}