{"by":"oneyellowbrick","id":6477999,"parent":6475879,"text":"Patientco - Atlanta, GA (midtown) - FT Software Engineer<p>Apply here:   <a href=\"http://www.patientco.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.patientco.com&#x2F;careers&#x2F;</a><p>(put &quot;hn&quot; in the notes field for priority review)<p>---------------<p>Patientco simplifies the challenge of understanding healthcare expenses for patients so they pay their healthcare providers faster. Already 1M+ patients securely receive, pay and track their healthcare expenses via Patientco.<p>Founded in 2009 by a team of Georgia Tech graduates and led by an Atlanta based serial entrepreneur, Patientco has experienced huge growth over the last few years and is financially backed by BlueCross BlueShield Venture Partners and Sandbox Industries.<p>--------------<p>Job Description:<p>As a Software Developer, you’ll build products that make very complex healthcare issues seem simple.  Working closely with the other members of the development team, you’ll design, develop, and deploy innovative scalable web-based software solutions at a rapid pace.  We’re looking for a software developer that is extremely innovative, seeks continuous improvement, works efficiently, and thrives when working independently.  We utilize agile methodologies to define weekly sprints that see code being deployed multiple times per week.<p>The following are some of the technologies we currently utilize, however we’re always evolving so we’ll find the best tools for the job:<p>* PHP<p>* MySQL<p>* MongoDB<p>* jQuery<p>* Twitter Bootstrap<p>* Puppet<p>* PHPUnit<p>* Selenium + PHPUnit for automated testing<p>* Atlassian Suite (JIRA, Confluence, Crucible, Bamboo)<p>--------------<p>Benefits:<p>* No Vacation Tracking – When you need a break, take a break. Autonomy and innovation are hard work, we understand that.<p>* Casual dress all-day, everyday – You don’t code better in a tie.<p>* Start-up Environment – You’re idea will be heard, no matter how crazy you think it is.<p>* Health and Dental, Vision, Short-term and long-term disability<p>* Free Parking (Tech Trolley also passes our front door)<p>* Midtown Atlanta (Atlanta Technology Square – Across the street from Georgia Tech) – Bars, Restaurants, and Sports.<p>* 401K<p>* Telecommute days – Work remotely when you need to!<p>* Free food and unlimited snacks!<p>* Fun events: whitewater rafting, Segway tours, go-karting, sporting events, and weekly trivia!<p>--------------<p>Apply here:   <a href=\"http://www.patientco.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.patientco.com&#x2F;careers&#x2F;</a><p>(put &quot;hn&quot; in the notes field for priority review)","time":1380651234,"type":"comment"}