{"by":"alexschiff","id":6477231,"parent":6475879,"text":"Fetchnotes - Cambridge, MA. Interns and full-time. We make your notes and to do lists better, not just better organized.<p>We have a really simple and effective product for keeping track of reminders, ideas, etc., but what I think is really exciting about our business is the R&amp;D we&#x27;re doing to automate those things or find relevant context&#x2F;information.<p>For example, you write down a book you want to look up, and we show you where you can find it. You have a grocery list, we let you know when you&#x27;re within a block of a store that has those items. The possibilities are endless, and there&#x27;s just as much product strategy that needs to be determined there as there is code. But we believe that productivity software can do so much more than empower the procrastination they do today.<p>Looking to add engineers with experience in mobile development (Android in particular), JavaScript (we use Angular, but experience with another framework like Backbone or Ember will suffice), machine learning and natural language processing. As far as NLP goes, we&#x27;re doing some really unique things that involve more statistics than typical NLP toolkits, so a good stats background will be helpful.<p>Backed by TechStars Boston and a group of fantastic angel investors and venture capitalists, we&#x27;re a young, close-knit and energetic team of 6 who believe that simple products, engineered properly, can make a big impact on people&#x27;s lives. We hang out after work frequently, have dinner together at least weekly, and are genuinely friends (not just co-workers). After big releases, we&#x27;ll usually take the day off to do something fun like laser tag or kayaking. I believe in hiring people that I want to work with over the course of a career, not just for a particular role today. At the end of every interview I ask myself, &quot;In 10 years, will I regret not having had the opportunity to work with this person?&quot;<p>Also, we were #2 on Hacker News last year when we accidentally called 2,000 people bitches: <a href=\"https://news.ycombinator.com/item?id=3557813\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=3557813</a><p>Sound interesting? Send your Github and a little about yourself to alex@fetchnotes.com. If you want to learn more about us, check out angel.co&#x2F;fetchnotes or kareer.me&#x2F;discover&#x2F;fetchnotes.","time":1380645321,"type":"comment"}