{"by":"dschwartz88","id":6477193,"parent":6475879,"text":"Harry&#x27;s (<a href=\"http://www.harrys.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.harrys.com</a>). Fulltime or Intern. New York City.\nA bit about us:<p>We built Harry’s with one simple belief: everyone deserves a great shave at a fair price. As such, we seek to provide our own brand of exceptional shaving products direct to our customers online. We launched on March 13th and have been humbled and flattered by the early customer response, and we&#x27;re now looking to bring on more talented engineers to help make every one of our customers happy and change the world, one 5-o&#x27;clock shadow at a time.<p>We&#x27;re looking for outstanding full stack engineers and data engineers who want to solve thorny e-commerce problems in {customer marketing, web performance, customer experience&#x2F;support, operations, supply chain management} in innovative ways.<p>Technologies: our web site is built on Rails, we&#x27;re hosted on Heroku, our data is stored in Postgres, and we write a lot of Python to consolidate data from various sources and analyze it.<p>For the full stack engineer who thrives on shipping features in the face of complex problems and processes: Our custom e-commerce platform powers the entire business, from the HTML on our homepage all the way down to our supply chain. We’ve got fun problems to work out every day, at every level of the stack, all with the hope to make purchasing and shaving with us the best experience out there. We’re looking for someone genuinely excited by the opportunity to make millions of peoples lives easier and build the Harry’s platform of tomorrow. Your primary responsibilities will include:<p>* Architect and implement core features of the production website<p>* Build infrastructure to support various external features and other units of the business<p>* Think about performance all the time, and proactively make changes to make our platform better<p>* Determine ways to operate more efficiently (e.g. optimizing our inventory and shipping algorithms)<p>For the statistically inclined engineer who communicates with data and hacks on data problems:<p>Data plays an integral role at Harry&#x27;s, informing every facet of our business. We are constantly working to understand the behaviors of tens of thousands of customers, tailoring offerings to them so that we can make them happy and drive continued demand. To that end, we&#x27;re looking for a statistically-inclined software engineer who is well-versed in building data systems and wants to use data to inform decisions at Harry&#x27;s in a forward-thinking way. Your primary responsibilities will include:<p>* Build infrastructure to automate data collection, storage, processing, and presentation.<p>* Instrument our website and marketing communications to gather the data we need.<p>* Test changes we make to our site, emails, packaging, shipping options, -- everything, really -- relentlessly.<p>* Produce, analyze, and present data to users in a context that allows them to make meaningful strategic decisions.<p>* Use your sheer intellectual horsepower to figure out and communicate how to better delight our customers.<p>If interested, email jobs@harrys.com with why you&#x27;re interested and relevant links (e.g. Github, projects, LinkedIn).","time":1380644949,"type":"comment"}