{"by":"challLO","id":6477587,"parent":6475879,"text":"Learning Objects- <a href=\"http://http://www.learningobjects.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;http:&#x2F;&#x2F;www.learningobjects.com&#x2F;</a> - Washington, DC<p>Who the heck are we?<p>Are you in to disruptive innovation?  Fired up to transform education?  Join our growing team.<p>We’re a scrappy, fast-growing startup, owner-operated, and privately held.  We’re in Chinatown, not Herndon, so you can sell your car and walk to work.  Choose your Friday happy hour specialty. Choices include: Rock Band, karaoke, and foosball.<p>If you&#x27;re relentless and resourceful, a lifelong learner, a major contributor, and ready to change the status quo, we want to talk to you.<p>What would you do?<p>You&#x27;ve got years of Java experience, and have built some pretty slick web apps. HTML, CSS, Javascript: you&#x27;ve got it. And yet you feel like you&#x27;re being held back. Your old job is still stuck in the 2000&#x27;s. You&#x27;re sick of Struts, sick of Spring, sick of JSP and think &quot;I could build a better web framework than this&quot;. You post your personal projects to GitHub when you get the time to do something cool, but it&#x27;s not as much as you&#x27;d like.<p>And then you see this post. And you think: Who would do that? Who would have 10% time projects, and happy hours every Friday? Who would have an office dog and a ping-pong table?<p>Here come the specs:<p>You will:<p>* Design, implement and test new features using a variety of the latest technologies under our customized version of the agile development methodology<p>* Contribute across the technology stack, from the interactive web and mobile front-end to the clustered object-oriented application layer to the back-end database\nYou bring:<p>* Minimum two years development experience (if you have more we will pay for it so don&#x27;t be afraid to apply)\n * Proficiency with Java 5\n * 1 year experience developing interactive web applications using AJAX\n * Proficiency with JavaScript, CSS, and HTML\n * Familiarity with agile development processes\n * Strong communication skills (you’ll work directly with clients)\n * Interest in being involved in the UI design process\n * Experience with jQuery or AngularJS is a plus<p>Apply online at <a href=\"http://www.learningobjects.com/careers.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.learningobjects.com&#x2F;careers.html</a><p>-or- email chall@learningobjects.com","time":1380648161,"type":"comment"}