{"by":"Lapppppple","id":6477609,"parent":6475879,"text":"Gilt (<a href=\"http://www.gilt.com/careers/department/technology-product-management/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gilt.com&#x2F;careers&#x2F;department&#x2F;technology-product-ma...</a>) -- NYC and Dublin<p>Founded in 2007, Gilt.com is an innovative online shopping destination offering its members special access to the most inspiring merchandise and experiences every day at insider prices. You can learn more about what we&#x27;re up to by visiting our Tech Blog: Tech.Gilt.com.<p>Contact: Lapple@gilt.com<p>We&#x27;re hiring both front- and back-end engineers, as well as a UX Director. Here&#x27;s the first part of our &quot;Generalist Engineer&quot; job description (more details at <a href=\"http://www.gilt.com/careers/job/r1118/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gilt.com&#x2F;careers&#x2F;job&#x2F;r1118&#x2F;</a>):<p>At Gilt, we endorse making mistakes if it leads to better systems. We use non-mainstream technologies if they get the job done. We trust each other to work autonomously, and decentralize decision-making to eliminate friction. And we allow anyone on the team–from first-time bloggers to experienced writers–to publish to our tech blog, give a presentation, or organize a meetup.<p>We strive to create the best and most stimulating work environment possible, and invite you to become a part of it.<p>Interested? If so, keep reading:<p>As a Gilt Engineer, you’ll become part of a team that values open source technologies, solves challenging and unique problems, and innovates quickly. Your passion for great technology will drive you to identify solutions to existing problems and discover better ways to help us innovate faster and better. You’ll be encouraged to take risks–from developing your own grassroots projects to submitting proposals to prestigious tech conferences.<p>* Your main responsibility is to write great code. We’re a Scala shop building microservices and “lots of small apps.” We have a large legacy of Java and Ruby. We all create new stuff, and help keep the old stuff working.\n* You’ll need to love learning, and have the ability to learn quickly. We’re on the leading edge of development paradigms, algorithms, service delivery, data at scale, continuous delivery and technical management. Non-traditional.\n* During the interview process, we hope to learn something from you: expertise about a new technology, insight into a trend, a novel approach to solving a problem–something we don’t know yet. What’s your potential? What can you bring that no one else can? Tell us!\n* Right now you have reputation for being good-to-great. At Gilt we will push you to be great.","time":1380648314,"type":"comment"}