{"by":"ianstormtaylor","id":6478148,"parent":6475879,"text":"Segment.io - San Francisco, CA - Full-time<p>Looking for:<p><pre><code>  * Backend Engineer\n  * Mobile Engineer\n  * Customer Engineer\n</code></pre>\n<a href=\"https://segment.io/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;segment.io&#x2F;jobs</a><p>---<p>Backend Engineer<p>Our analytics backend is getting to be quite the beast. We want your help scaling our thousands of events per second and terabytes of data. If you&#x27;re a fan of distributed systems and like to stress-test a new database every other week, you&#x27;ll fit right in. And it won&#x27;t hurt if you like streams, trying out ES6 features, and open-sourcing your work.<p>Our entire backend runs on Node, with a sprinkling of Redis, Mongo, and RabbitMQ. We&#x27;re open to running a variety of languages and could still use someone to show our Go and Erlang libraries some love.<p>Think that might tickle your fancy? We&#x27;ve got a few projects in the pipeline that you can sink your teeth into right away:<p>Live Debugger\nYou&#x27;ll build a system that helps developers debug requests to the Segment.io API, and whether the request has been successfully routed to all its destinations. The fun part of this one is working at a variety of scale (isn&#x27;t it always?). You&#x27;ll have to build a system which helps devs debug on localhost, but also help them monitor production environments sending 500 requests a second.<p>MapReduce for All\nWe&#x27;d love to have a way for developers to query the terabytes of analytics data stored in the Segment.io data warehouse. Can you streamline the process until your mother can submit mapreduce queries with ease?<p>Data Export APIs\nPerhaps you&#x27;d like to build an API to export analytics data from Amazon S3 (or maybe even Glacier?). Exporting will have to stream terabytes of data without waking our ops guys in the middle of the night. Then, you&#x27;ll deploy the system to EC2 and test it, and announce it to the world!<p>To apply, email us at jobs+backend@segment.io with:<p><pre><code>  - a description of your own favorite software project (code is a bonus)\n  - a link to your Github (if you have one)\n  - what languages and frameworks you like to use, and why\n  - any bash command you&#x27;d probably use to inspect a logfile\n\n</code></pre>\n-----<p>Mobile Engineer<p>With our new iOS and Android SDKs we want to change the mobile analytics game. The market is flooded with new mobile analytics startups, but underneath they all collect the same data. And anytime you make an analytics change, you have to re-submit your app to the app store. Bummer. :&#x27;(<p>Developers can drop in our SDK and then later enable any of Segment.io’s dozens of analytics integrations without writing additional code or even submitting updates to the app store. Both iOS and Android SDKs are open source, so you&#x27;ll be working closely with the rest of the community (and get a great chance to show off your work).<p>Here&#x27;s some examples of what you&#x27;d probably tackle at Segment.io:<p>Best New Tools\nAs the maintainer of the SDKs, you&#x27;d have total control over which analytics tools get added and distributed across millions of devices. What are the best new tools? Something for an interesting new app category? Help our users find the best-in-breed mobile analytics tools, and build them into the SDKs so that they can enable them instantly.<p>Community Distribution\nAs Segment.io&#x27;s mobile expert, you&#x27;ll be guiding (and helping write!) lots of the mobile content marketing we produce. We want you to become the world&#x27;s leading expert on mobile analytics, knowing the business models, industry, tools and problems inside and out. We&#x27;ll help propel you to become a thought leader in a brand new field.<p>Xbox, Playstation, Roku\nYou could also play around on new platforms, bringing analytics bliss to the home entertainment world and gaming platforms.<p>To apply, email us at jobs+mobile@segment.io with:<p><pre><code>  - a description of an app you worked on (code is a bonus)\n  - a link to your Github if you have one\n  - the most interesting mobile SDK you&#x27;ve worked with and why\n\n</code></pre>\n-----<p>Customer Engineer<p>At Segment.io, customer support drives the focus of the entire team. We&#x27;re looking for a hungry engineer (don&#x27;t worry, we&#x27;ll feed you) who approaches customer support with an analytical efficiency. You&#x27;ll keep finding new ways to improve the product, libraries, and docs wherever it&#x27;s needed. For most of our users, you&#x27;ll be the face of the company. Are you suave, courteous, and patient? :)<p>You&#x27;ll be responsible for analyzing our richest source of data: support requests. &quot;Where is support coming from? Why do customers need help? Which parts of the product need the most love?&quot; You&#x27;ll be in charge of automating as much of that as possible without sacrificing quality.<p>Currently we get about 40 support requests per day. Here&#x27;s the breakdown:<p>35% are variations of &quot;thanks your product is super awesome!&quot; which are fun.\n25% are technical support requests for our main javascript library. You might have to jump on Skype with a Ukrainian developer or a Japanese designer (watch the timezone!) or maybe run down the street to help a local startup.\n15% are technical problems with our mobile libraries for iOS and Android.\n10% require debugging a server-side integration: Python, Ruby, PHP, Java, .NET, or Node.\n5% are completely confused, but we still &lt;3 them.\nand the remaining 10% are hiring, sales and other random inquiries.\nThis kind of analysis should feel natural to you!<p>Your analysis of support issues, feature requests, and customer feedback will be absolutely critical to planning tasks with the rest of the team. We want to make sure we&#x27;re all building things that will benefit our customers.<p>Segment.io&#x27;s support team also educates our customers on how the product works. You&#x27;ll chat with marketers, data scientists, developers, and business owners from all over the world to help make their analytics amazing.<p>To apply, email us at jobs+customer@segment.io with:<p><pre><code>  - a description of your own favorite software project (code is a bonus)\n  - a link to your github (if you have one)\n  - think of the last time you taught someone something technical, what was it?</code></pre>","time":1380652496,"type":"comment"}