{"by":"jonmcauliffe","id":6478329,"parent":6475879,"text":"Voleon Capital Management -- Berkeley, CA -- Full-time, on-site<p>We are a science-driven systematic trading firm, built on the principle\nthat statistical machine learning provides the best solutions to the\nscientific problems we must solve. Our team includes faculty at premier\nuniversities and PhD&#x27;s from top-tier schools. You will have a high impact,\nand you can expect frequent interaction with the researchers, officers, and\nfounders.<p>We&#x27;ve had great success and are getting big fast. Willingness to take\ninitiative, and a gritty determination to productize, are essential.<p>Our offices are in downtown Berkeley, one block from campus and one block\nfrom BART.<p>* Member of Research Staff<p><pre><code>    We are looking for a PhD-level scientist to join us in developing\n    predictive financial models and other quantitative components of\n    automated trading systems. You will apply modern statistical\n    machine-learning methods to large, high-dimensional data sets. The work\n    will range from data preparation to model development to production\n    software implementation.\n\n    We take a rigorous approach to building trading systems, and we\n    actively foster a collegial, intellectual environment.\n\n    We hire on the basis of exceptional talent. If you excel in a technical\n    field such as statistics, mathematics, computer science, engineering,\n    or operations research, then we encourage you to contact us. The\n    following criteria, while not all requirements, illustrate the demands\n    of this role.\n\n    + Background in modern statistical methods &#x2F; machine learning\n    + Evidence of strong mathematical abilities, e.g. publication record,\n      graduate coursework, or competition placement\n    + Substantial programming experience and interest in software\n      development techniques\n    + Competence in solving large-scale computing problems\n    + Track record as an applied researcher\n    + Demonstrable clarity of thought (not optional)\n\n    Interest in financial applications is essential, but experience in\n    finance is not a primary factor in our hiring.\n</code></pre>\n* Software Engineer<p><pre><code>    You will architect and implement a diverse set of core infrastructures,\n    including new production systems, scientific-computing environments,\n    and modern data stores.\n\n    We seek candidates with a proven track record of writing correct,\n    well-designed software, solving hard problems and delivering complex\n    projects on time. You should preferably have experience with high\n    assurance, distributed, fault-tolerant systems. Experience with\n    functional programming as well as soft real-time, low-latency,\n    cache-friendly systems is a bonus.\n</code></pre>\nBenefits and compensation are highly competitive. Interested\napplicants are encouraged to send a cover letter and resume to\nworking@voleon.com.","time":1380653982,"type":"comment"}