{"by":"summerville","id":6478877,"parent":6475879,"text":"Fleetio - <a href=\"http://www.fleetio.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fleetio.com</a> - Birmingham, AL or REMOTE - FULL TIME<p>We&#x27;re looking for a badass Rails developer who can grow into a CTO-ish role.<p>Fleetio is improving the way companies manage vehicle-based operations and our customers love us for it. We&#x27;re a fast-growing, bootstrapped &amp; profitable SaaS company with hundreds of paying customers around the world.<p>Your primary responsibility in the short term (next 6 - 12ish months) will be to deliver on the product roadmap. You&#x27;ll develop new features, enhance existing ones and squash bugs. You&#x27;ll balance timely delivery of customer-facing improvements with solid architecture decisions and code organization, minimizing technical debt.<p>Down the road, you&#x27;ll have the opportunity to be responsible for growing and leading the engineering team, defining how software gets built at Fleetio, and building upon the foundation being put in place today.<p>You in a nutshell:<p><pre><code>  - You have deep knowledge of Ruby, Rails and other Web technologies.\n\n  - You understand the balance between scrappiness and long-term code maintainability.\n\n  - You feel compelled to make things look beautiful and work flawlessly.\n\n  - You are organized, and take pride in abstracting and refactoring.\n\n  - You are creative, ambitious and you get things done.\n\n  - You are a great writer, a strong conversationalist and an even better listener.\n</code></pre>\nIt would be great if you also:<p><pre><code>  - Know a thing or two about cars and engines\n\n  - Have used a variety of frameworks (server side, browser side, or for desktop software)\n\n  - Have a technical background: a degree in CS, EE, math, physics, etc.\n</code></pre>\nSound like you?<p>We would love to know more. Email us at jobs@fleetio.com and tell us a little about yourself.<p>Full job posting: <a href=\"http://www.fleetio.com/jobs/software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fleetio.com&#x2F;jobs&#x2F;software-engineer</a>","time":1380659304,"type":"comment"}