{"by":"mebassett","id":6479900,"kids":[6546426],"parent":6475879,"text":"London, UK - full time&#x2F;part time&#x2F;internship&#x2F;flexible.<p>NBCUniversal - Research Assistant, Data Science &amp; Predictive Analytics.  x2<p>We&#x27;re no startup.  We&#x27;re the special operations team for the corporate world.<p>We&#x27;re hunting for engaging problems and opportunities to create real value for our marketing, sales, and research teams throughout our international businesses (television, movies, news, and home entertainment).<p>You&#x27;ll be helping us on a variety of problems - little ones like writing a script to hack a third party&#x27;s website and collect info on our products, to large ones like creating a model that can show our products value through time.  In all cases you&#x27;ll be working closely with the a senior engineer and either senior corporate management or a business unit in TV, film, or news.  A typical week might look like this:<p>* Meet with the head of sales for a UK TV channel, learn about a problem they&#x27;re facing trying to get an accurate value for advertisement slots.<p>* Discuss what you learned with the rest of team.  Someone suggests that a nearest-neighbors regression on data from the marketing team might help.<p>* A senior dev helps you implement the algorithm and a UI for the sales team to use it.<p>* Spend some time with the sales team to see if it&#x27;s creating any value, look for improvements.<p>What we use (We list this to tell you what we&#x27;re like, not to tell you what languages we expect to see on a CV):<p>* Racket.  We&#x27;re big fans lisp and functional programming.<p>* Bash.  We create a lot of value with small dirty hacky shell scripts, and we aren&#x27;t shy about it.<p>* Whatever gets the job done, and whatever we think might be fun to use.  Python, R, Javascript, Hadoop, EC2.  We even wrote code in Fortran once (we don&#x27;t like to talk about it.)<p>Who we&#x27;re looking for:<p>Most importantly, you should be an intelligent problem solver who wants to apply whatever programming and maths knowledge you have to real world problems. We&#x27;re not fussed about what languages are on your CV.<p>You have some familiarity with functional programming, machine learning, and linux&#x2F;bash scripting, and you&#x27;re eager for a chance to use it on real-world problems with support from other programmers.  Given the predictive modeling angle, you&#x27;re probably studying or have studied maths, stats, or even physics.<p>These are <i>two</i> assistant&#x2F;internship positions for students looking for experience while doing their degree.  Alternatively, if you can take on several projects in a full time role, please get in touch, too. We&#x27;re pretty flexible.<p>Interested?  My contact details are in my profile.  Get in touch.  I&#x27;d love to hear from you.","time":1380672933,"type":"comment"}