{"by":"bijanv","id":6479048,"parent":6475879,"text":"EventMobi - Toronto, Canada - Sr. Infrastructure &amp; Scalability Engineers &#x2F; Full-Stack Engineers - <a href=\"http://www.eventmobi.com/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.eventmobi.com&#x2F;careers&#x2F;</a><p>To get a feel for our culture and office checkout our fun video: <a href=\"http://bit.ly/18jDnuI\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;18jDnuI</a><p>--------------------------<p>EventMobi is an app building platform that allows event planners to create engaging mobile apps for their event or conference in only a few minutes. We’re based in Toronto and are committed to using the mobile revolution to completely transform the events industry.<p>Our apps allow event planners to distribute content to their attendees, keep them engaged with the event, and help them learn and network with other attendees. EventMobi apps have been used at over 2500 events, 2 Million users, and are served for events in 15 languages across 5 continents.<p>We’re not your typical startup, we’re completely bootstrapped&#x2F;self-funded yet we’re massively profitable and on an incredible growth path with companies like Intel, Disney and the Olympics IOC using us for their mobile event app needs.<p>We embraced HTML5, cloud architecture and cross-platform mobile web apps before any of them were fancy buzz words! Come and join Toronto’s fastest growing self-funded tech start-up \nand be part of something amazing.<p>--------------------------<p>We&#x27;re looking for a a senior Infrastructure &#x2F; Scalability Engineer (DevOps) and Full-Stack Software Engineer to join our team and help build out the platform we need to innovate this space. This is a very fast-paced role, and we need energetic individuals that can build large-scale SaaS systems, be part of and lead the growth of engineering team.<p>This is a great career opportunity to grow with a young startup, get your hands dirty in all aspect of cloud services, mobile and web development and help with every aspect of a startups technology infrastructure.<p>Our stack looks like something like this:\n- Heavy use of Javascript (we use Angular for our apps, NodeJS for other services)\n- Python &#x2F; Flask\n- MySQL &#x2F; Redis &#x2F; MongoDB\n- Dozens of nodes on AWS automated by Chef\n- Jenkins for CI, Cucumber&#x2F;RSpec&#x2F;Karma for test automation<p>If you would like to chat further about the details feel free to email me at bijan@eventmobi.com","time":1380661058,"type":"comment"}