{"by":"burnsidedig","id":6479070,"parent":6475879,"text":"Burnside Digital- www.burnsidedigital.com - Portland, OR and Los Angeles, CA REMOTE considered<p>About Burnside Digital\nBurnside Digital is not just another boring agency building brochure sites. We’re a growing development shop who specializes in building compelling and usable apps using Ruby on Rails, iOS, and Android. We practice agile development, which means you’ll be working closely with the client, designers, and developers at every stage, not just being handed comps and a deadline. We reward hard work and believe strongly in a sustainable work&#x2F;life balance. Learn more at <a href=\"http://www.burnsidedigital.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.burnsidedigital.com&#x2F;</a><p>Apply\nPlease send your resume and a link to your portfolio to jobs@burnsidedigital.com. Candidates without a portfolio will not be considered!<p>We&#x27;re currently hiring for a number of positions including:<p>UI&#x2F;UX designer- \nWe&#x27;re looking for a top-notch UX&#x2F;UI designer to join our growing creative team. You&#x27;ll be working on a wide variety of client projects, both web and mobile. You&#x27;ll work closely with our developers to design and refine beautiful, usable apps. Our agile process means that you&#x27;ll get to continually improve the user experience throughout the development process.<p>Responsibilities\n-Advocate for the user&#x27;s experience throughout a project&#x27;s lifecycle\n-Create designs based on best practices, with a focus on usability\n-Review existing client design to make specific UX recommendations\n-Create quick but clear mockups, sketches, wireframes, &amp; user flow diagrams\n-Lead user research and stakeholder interviews\n-Accurately estimate creative work to coordinate with development\nThrive in a fast-paced, highly collaborative environment<p>Requirements\n-3+ years of professional experience in a UI&#x2F;UX&#x2F;IA role\nStrong visual design skills, including an eye for typography &amp; color\n-A determined focus on serving and delighting the customer\nExperience designing for desktop &amp; mobile\n-Experience working with an iterative process\n-Experience with user research, human-centered design, &amp; prototyping\n-Comfortable delving into the complexities of challenging business logic\n-Experience working directly with stakeholders to manage their -UX needs from concept to completion.\n-Portfolio showing examples of your process, including sketches &amp; wireframes<p>Project Manager:<p>Responsibilities:\n-Manage multiple projects of medium to large scale through every phase of the project.\n-Organize and facilitate project planning, daily stand-up meetings, reviews, retrospectives, sprint and release planning, and demos.\n-Track and communicate team velocity and sprint &#x2F;release progress with and to all affected teams and management.\n-Ensure the development teams are practicing the core agile principles.\n-Update agile tracking systems to provide transparency on product and sprint backlogs.\n-Assist with internal and external communication and maintaining client relationship.\n-Assist team with making appropriate commitments through story selection and task definition.\n-Determine and remove obstacles that may interfere with the ability of the teams to deliver assigned goals.\n-Facilitate discussion and conflict resolution; improve the productivity of the teams in any way possible.\n-Provide direction to project activities to ensure successful implementation and support.\nPromote continuous improvement and help teams to increase productivity. \n-Promote a collaborative team environment that fosters creativity and innovation.\n-Assist in defining and deploying new product development processes and in facilitating the. continuous improvement of existing processes.<p>Experience:\n-5+ years experience in software project management.\n-Thorough understanding of enterprise software development processes and lifecycle.\n-Ability to adjust and apply technical knowledge in a dynamic environment.\n-Experience with Agile, Kanban or Lean development processes. \nMust have web development and front-end (customer facing) project experience.\n-Excellent team building, communication, and collaboration skills required.\n-Experience with a modern programming language: Python, Ruby, Java, Objective-C, C++, etc.","time":1380661364,"type":"comment"}