{"by":"ridruejo","id":6480137,"parent":6475879,"text":"BitNami - <a href=\"http://bitnami.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bitnami.com</a> - San Francisco, CA<p>Global Marketing Director<p>BitNami is reinventing the software application experience. Our solution allows users to launch and run popular server applications and development stacks in the cloud and anywhere else just with one click. The simple elegance of our approach has won us fans all across the world. Mostly by word of mouth, BitNami has grown to support over 1 million downloads each and every month. We have also become the largest source of applications for the leading cloud marketplaces including Amazon Web Services, Microsoft Azure and VMware.<p>While we have made great progress as a company and a brand, the journey is just beginning. Our goal is to have every developer, systems administrator and business user demand BitNami each and every time they need to deploy their applications. To accomplish this, we must evolve and permeate our brand, generate even more awareness across our target audiences, expand our partnerships with software vendors and deliver the industry’s best user experience. If this sounds as exciting to you as it is to us, then please consider hopping on the BitNami wave.<p>We’re looking for a marketing visionary that brings new ideas to the table and the ability to lead and grow a marketing team as the company grows; yet somebody that isn’t afraid to roll up their sleeves to get real work done. We need someone that is comfortable wearing many different hats. Marketing is extremely important to us and we need to find a leader that combines solid experience and passion with the work ethic and motor needed to thrive in a fast-paced startup environment.<p>Primary Responsibilities include:<p>Maintain the BitNami web properties and identify opportunities for improving the conversion rate from web visitors to BitNami users.\nClosely monitor key metrics associated with the customer acquisition process to identify bottlenecks and areas of opportunity.\nIdentify and manage awareness generation activities spanning SEO, social media, press &amp; analyst relations and other activities.\nDefine and execute outbound marketing campaigns as necessary to further drive adoption of BitNami solutions.\nEngage with software vendor and cloud provider partners to maximize value for each relationship.\nIdentify and track key industry events and coordinate sponsorships and conference booths&#x2F;activities.\nGenerate thought-provoking and useful content as necessary to support above activities.<p>You should have at least 5-10 years of marketing experience in the software industry, with a good understanding of each of the areas of responsibility. We will give strong preference to candidates that can work from our corporate office on Mission Street in San Francisco.<p>Compensation includes a generous equity stake, six-figure base salary, excellent benefits and a number of high-growth company perks.<p>Email careers@bitnami.com","time":1380678366,"type":"comment"}