{"by":"pyrox420","id":6480418,"parent":6475879,"text":"Rockton, IL&#x2F;Beloit, WI - Fulltime Senior Engineer at AccuLynx (<a href=\"http://www.acculynx.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.acculynx.com</a>)<p>Ready to be treated like an adult? Unlimited paid time off, flexible hours, cutting edge technology, and sweet hardware all while working in a fun environment. AccuLynx isn’t your typical startup company. For one, we’re profitable! Second, our primary product is a SaaS that caters to specialty trade contractors. Yup, software helping construction contractors. We are looking for a “smart-and-gets-things-done” senior software engineer. We don’t care if you used to work for black-market hamster traffickers or moonlighted as a garden gnome. We do not hire based on buzzwords or popular acronyms. We expect you to have mastered at least one language and be eager to master any technology or language in the future.<p>At AccuLynx, the employees are a highly valued asset and we strive to provide the best working environment possible. Sit&#x2F;stand desks, super comfy chairs, dual monitors, casual dress, and fun tech could all be in your future. We believe that culture is the most important ingredient for success. Fun, learning, collaboration, innovation, and personal growth is a way of life at AccuLynx. Playing boardgames for “team building”, frequent team lunches, and team outings are the norm. We might even develop video games on the side (shhh, don’t tell the CEO).<p>Detailed job description can be found here: <a href=\"http://careers.stackoverflow.com/jobs/31889/senior-c-sharp-engineer-acculynx\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;31889&#x2F;senior-c-sharp-e...</a><p>We&#x27;d like to see skills in our current stack: C#, ASP.NET WebForms&#x2F;MVC, Sql Server, JavaScript, AngularJS, jQuery, Redis, ElasticSearch, and Git.<p>Benefits are top notch: Highly competitive salary (60k-95k), stock options, unlimited paid time off, free snacks&#x2F;drinks, $5k&#x2F;year to spend on continuing education (conferences, classes, etc),  sweet computer hardware, choice of cell phone, MSDN subscription, gym membership, competitive medical, dental, vision, 401K with matching &amp; safe harbor contributions, relocation reimbursement available, sweet sit stand desks, etc.<p>We are moving to an awesome new office in Beloit, WI within the next 5 months (each developer gets their own office!). For now applicants must be willing to commute to the Rockton, IL area. Full time telecommuting is not an option at this point but the occasional day working away from the office is acceptable.<p>Email me if you are interested (mention HN to get my attention), my name is Paul: dev@acculynx.com<p>Seriously, this is the best job I&#x27;ve had and I want to bring the best onto my team.","time":1380684132,"type":"comment"}