{"by":"grrrando","id":6482721,"parent":6475879,"text":"RED TETTEMER O&#x27;CONNELL + PARTNERS<p><a href=\"http://rtop.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;rtop.com&#x2F;</a> | <a href=\"http://createcoolshit.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;createcoolshit.com&#x2F;</a><p>Brooklyn &#x2F; NYC &#x2F; Philadelphia &#x2F; LA<p>RTO+P is a full-service ad shop based in Philadelphia. Last month, we won Ad Age&#x27;s &quot;Small Agency of the Year (11-75 Employees)&quot; award. We serve clients like Under Armour, NBC Universal, Planet Fitness and more. From a tech standpoint: we focus on the speed and quality of our work, and embrace bleeding-edge techniques and philosophies wherever we can.<p>We&#x27;re looking for: Tech Lead, Lead&#x2F;senior Rails engineer, Senior front-end developer, and more. We&#x27;re approaching hiring with a &quot;smart people first, skills second&quot; mindset, so get at us. Agency experience is not required.<p>Philly people: Welcome to your new favorite place to be. The office in Philly is rad beyond description - built into the former penthouse apartment of John Wanamaker, directly next to Philly&#x27;s City Hall, and loaded with more quirk and haberdash than you&#x27;ll likely ever be able to fully observe. This is the beating heart of our agency. We&#x27;ve got an impressively sized (and growing) tech team and we&#x27;re working on creating and building the best god-damned websites, apps, and experiments the world&#x27;s ever seen. Seeking all positions.<p>Brooklyn&#x2F;NYC people: This summer we opened a tech-focused outpost in DUMBO, Brooklyn. We&#x27;re still building the BK team and are seeking developers, product people, and tech-centric designers. A small amount of travel can be expected, mainly to Philadelphia every few weeks (costs fully covered).<p>LA people: We just opened a killer office in Venice. We&#x27;re looking to fill this office out as a mini-agency within the agency, capable of both full autonomy and working as part of the larger agency machine. Seeking all positions.<p>Please contact me at interactivejobs@redtettemer.com - attach your resume (required) and anything else to impress (code samples, portfolio, side project link, etc.).","time":1380725511,"type":"comment"}