{"by":"pgassee","id":6485017,"parent":6475879,"text":"San Francisco&#x2F;CA, New York&#x2F;NY, London&#x2F;UK Remote&#x2F;Re-location OK, Full-time<p>Whitetruffle.com is a game-changing recruiting platform that matches software engineers and UX&#x2F;designers to great tech jobs. We’re looking for more engineers to join our family to help refine and enchance our proprietary matching algorithm, improve our UI, and lead the development of our mobile app. We have 2500+ companies like Pebble, Asana, Path, Evernote, Optimizely, Delve News, etc. who use Whitetruffle to source talent to build out their teams. The popularity of the platform stems from the fact that candidate contact info remains anonymous until both parties agree to the match, and you&#x27;re introduced directly to the in-house hiring source (founders, CTOs, HR lead).  The great benefit: it&#x27;s fast without any spam.<p>We&#x27;re continuing to scale quickly and need to keep up with our growth. If you have a passion for disruptive products and like coding, fast releases, cool designs, and like to be part of an energetic and smart team, you may be a good match. Our office is based in the SoMA area of San Francisco, California, next to the Giants Stadium and close to all transportation hubs and freeways.<p>Work style: “work whenever, wherever”<p>Workflow: Weekly meeting over IRC every Monday morning. Once a week team lunch brings everyone together to talk about the product, brainstorm new ideas, or share their crazy weekend stories. On Tuesdays we have a 1 hour product meeting over Google Hangout. We&#x27;re on IRC all the time.<p>Push Process: Push to master whenever you want, unit tests run automatically and are hooked up to IRC; push to prod whenever you want as long as unit tests pass. QA on your own. It’s OK if you break the site from time to time, we like taking risks and prefer to push code.<p>Whitetruffle job openings:<p>1. Sr. Software Engineer (Machine Learning, MySQL, Python or Ruby, API experience a plus) \n2. Seasoned UI Engineer (CSS3, JavaScript, PHP, jQuery, Python or Ruby) \n3. Mobile Engineer (iOS, Obj-C, Android, Java)<p>Most of our engineers were hired using our own product.  For all jobs, register (build your profile) at  <a href=\"http://www.whitetruffle.com/company/whitetruffle\" rel=\"nofollow\">http:&#x2F;&#x2F;www.whitetruffle.com&#x2F;company&#x2F;whitetruffle</a>.  If you’re a good match, we’ll contact you.<p>For more details visit <a href=\"https://www.whitetruffle.com/candidates\" rel=\"nofollow\">https:&#x2F;&#x2F;www.whitetruffle.com&#x2F;candidates</a>.  Make sure to try our service so we can have a productive conversation.","time":1380744910,"type":"comment"}