{"by":"akelani","id":6510833,"parent":6475879,"text":"ShowKit - West Hollywood, CA - FULLTIME, REMOTE, H1B<p>ShowKit (<a href=\"http://showkit.com\" rel=\"nofollow\">http:&#x2F;&#x2F;showkit.com</a>) is a mobile&#x2F;software startup run out of Curious Minds, a privately funded incubator in West Hollywood, CA. Curious Minds specializes in highly disruptive mobile and web applications.<p>We are currently looking for a talented software developers. You will build, maintain and improve our real-time SIP&#x2F;RTP-based framework, platform &amp; applications.<p>To apply: Send your resume and GitHub account to anthony@showkit.com<p>Senior-level Software Developer<p>Qualifications:\n- Strong C&#x2F;C++ programming skills\n- Strong network programming experience\n- SIP&#x2F;RTP experience\n- Strong OO &amp; multi-threaded programming skills\n- Strong debugging skills\n- Experience dealing with bandwidth and latency issues\n- Self-Motivated\n- Good design, analytical and problem-solving skills\n- Good communication skills\n- Passion for real-time!<p>Desired&#x2F;Other Skills:\n- OSX and Windows development\n- Mobile development (iOS, Android, Windows Phone)\n- H264 Codecs\n- OpenGL\n- WebRTC\n- Knowledge of network security strategies\n- Familiar with mobile frameworks (PhoneGap, Xamarin, RubyMotion)<p>Mobile&#x2F;Web Developer<p>Qualitifcations:\n- Strong Mobile Development Skills (iOS, Android, Windows Phone)\n- Strong Web Development Skills (Ruby on Rails, JavaScript)\n- Experience with mobile frameworks (PhoneGap, Xamarin, RubyMotion)\n- Strong OO &amp; multi-threaded programming skills\n- Strong debugging skills\n- OSX development experience\n- C&#x2F;C++ experience\n- Experience dealing with bandwidth and latency issues\n- Self-Motivated\n- Good design, analytical and problem-solving skills\n- Good communication skills\n- Passion for real-time!<p>Desired&#x2F;Other Skills:\n- Android NDK\n- OpenGL\n- H264 Codecs\n- WebRTC<p>Product:<p>ShowKit is a mobile software development kit that turbo charges apps with live communication features in under 30 minutes. Before ShowKit, it would take companies and software engineers months of intensive development to add features like audio&#x2F;video conferencing, screen sharing, and gesture control to their applications. Our first-to-market gesture control functionality empowers users to tap, swipe, highlight, and fully control another users’ screen remotely while simultaneously connecting the two users via audio&#x2F;video conference.<p>Notably, ShowKit is the only framework that includes hardware accelerated video encoding &amp; decoding. This enables 720p at 30fps, the highest quality video conferencing resolution on the market, while using minimal cpu resources and allowing the app to run seamlessly in the background while a call is taking place. Comparable solutions use full cpu resources &amp; only achieve 4-5fps at that resolution, which isn’t feasible for video conferencing.<p>AngelList Profile: <a href=\"http://angel.co/showkit\" rel=\"nofollow\">http:&#x2F;&#x2F;angel.co&#x2F;showkit</a> ShowKit<p>Demo Videos: <a href=\"http://www.youtube.com/user/ShowKitSDK\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;ShowKitSDK</a><p>Our Office &amp; Perks:<p>Our Penthouse office sits on the historic Sunset Strip with the best view of all of LA. - Top of the line gear - Kitchen stocked full of drinks and snacks - Friendly and down-to-earth work environment - Health, Dental &amp; Vision Coverage","time":1381176335,"type":"comment"}