{"by":"arenasolutions","id":13086531,"parent":13080280,"text":"Arena Solutions, Inc | Software Engineer, Technology Group | Foster City, CA, USA | ONSITE, FULLTIME, <a href=\"https:&#x2F;&#x2F;www.arenasolutions.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.arenasolutions.com&#x2F;</a><p>We are looking for an intellectually curious Software Engineer to become a core member of the Technology Group at Arena Solutions, and help us build the next generation of product lifecycle management software.<p>We&#x27;re a successful company with fifteen years of experience delivering our product as a software-as-a-service, and our market leadership position reflects our long history and strong reputation for security and reliability. Our customers are discrete manufacturers who put our applications, infrastructure, and reputation at the heart of their business. We believe the best way to meet our customers&#x27; needs today and tomorrow is to continually evaluate new technologies and apply industry-wide best practices as we iterate on our software and infrastructure.<p>You will be designing, implementing, and evolving the software and infrastructure tools Arena will be using for the next five years and beyond. You understand the technologies that drive modern multi-tenant Software-as-a-Service companies and have strong opinions on how to build scalable software and infrastructure. You can deconstruct a legacy system into its constituent parts and rebuild it as a distributed system with a focus on security, resiliency, and responsiveness.<p>You will evaluate existing and emerging technologies, build pragmatic prototypes focused on a current or future business need, and then drive adoption of the selected technologies by the wider software development team. Your completed projects will become the foundation of Arena&#x27;s future software architecture.<p>Responsibilities:<p>* Collaborate with Arena&#x27;s Chief Architect and Director of Infrastructure Engineering to plan and prototype the next generation of Arena&#x27;s architecture\n* Mentor and inspire fellow engineers on the theory and practice of proposed new technologies<p>Skills and Experience:<p>* Implementation of Software-as-a-Service using JVM-based languages<p>Interests:<p>* Building reliable, asynchronous distributed systems\n* Event sourcing and related technologies such as Kafka\n* Scala, Akka, Reactive Streams, VueJS, and&#x2F;or AngularJS<p>HN Addendum:<p>We are omitting specific experience requirements to avoid great candidates self-filtering themselves -- we are investing in you rather than mining your current skill set. This position reports to the Director of Infrastructure Engineering. Please include a cover letter and mention you saw our post in this thread.","time":1480659849,"type":"comment"}