{"by":"jamalex","id":13080511,"parent":13080280,"text":"Learning Equality - <a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;</a> - San Diego, CA -- Onsite | Full-time<p># Who we are<p>We&#x27;re a nonprofit startup that builds and supports open-source educational software for communities with limited or no access to the Internet. We believe in the transformative power of learning, and are passionate about social justice and breaking down barriers preventing people from reaching their full potential.<p>We started 4 years ago with KA Lite (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;ka-lite&#x2F;</a>), an offline-installable platform bundling Khan Academy content and our own student tracking tools. KA Lite has already been used in over 175 countries and territories.<p>We&#x27;re now in the midst of developing a new platform, Kolibri (<a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;kolibri&#x2F;</a>), that will empower users to create, curate, share, and learn from diverse forms of openly licensed content, in both online and offline environments. We&#x27;re building tools for authoring videos and exercises, an app ecosystem for embedding and distributing HTML5 educational bundles, features for discovering and communicating with other devices peer-to-peer over a local network, interfaces and web-based visualizations for exploring student data, and systems for motivating, engaging, and guiding learners.<p># Who you are<p>You care deeply about making the world a better place, believe in the power of learning, strive to promote equality, and resonate with our statement of core values.<p>You love to build things, and like to think carefully about how best to serve the needs of a diverse set of users.<p># Positions<p>Frontend Web Developer: You have solid experience with web development using HTML5, JavaScript, modern JS frameworks (we use Vue.js), and CSS with pre-processors. You love building beautiful interfaces and collaborating with the UX team.<p>Python Developer &#x2F; DevOps: You have skills and experience working with Python, in a variety of contexts. We use Django for the backend of Kolibri, and also leverage Python for automation of business processes, API&#x2F;web scraping for pulling in new content, media processing&#x2F;computer vision, and data analysis&#x2F;machine learning.<p>Additional _non-dev_ positions (Implementation&#x2F;Partnerships and Content Managers) to be posted later this week.<p># Benefits<p>- Salary at the same levels as other core team members<p>- Retirement plan with matching employer contributions<p>- Full health care, dental, and vision insurance<p>- Education fund to support ongoing professional development<p>- Flexible and generous vacation policy and work schedule<p>- Well-stocked, bottomless cabinet filled with snacks and Guayaki<p>- Working in sunny San Diego (coverage of basic relocation costs, if needed)<p># Read more and apply<p><a href=\"https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;learningequality.org&#x2F;about&#x2F;jobs&#x2F;</a>","time":1480609241,"type":"comment"}