{"by":"jayzee","id":13083369,"parent":13080280,"text":"Quartzy | Palo Alto, CA | <a href=\"http:&#x2F;&#x2F;quartzy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;quartzy.com</a> | Full-time | Onsite<p>Quartzy&#x27;s marketplace team builds systems to help find our users the best price possible for materials they use every day in their labs. We’re on a quest for an extraordinary application engineer who will join us to help grow and improve our marketplace applications.<p>You are a self-starter with a bias for action, and you can take projects from start to finish. You want to work as part of a small, tightly-knit team that moves quickly and pushes changes to production many times a day. You always admired your friends in science, but your knack for computers led you to programming.<p>Quartzy is a global two-sided marketplace for the life sciences. Our platform helps labs order scientific supplies ranging from beakers to capital equipment; we make life easier and save money for scientists and lab managers in academia and at pharma and biotech companies. We give the software away for free and earn revenue when labs buy their supplies from us. With over 200,000 scientists from all over the world relying on Quartzy, we help accelerate the pace of scientific discovery, and we need your help to accelerate our own pace as well.<p>What we&#x27;re looking for:\n- You have three or more years of experience writing clean, thoughtfully crafted PHP that scales.\n- You have experience with other parts of our technology stack: MySQL, Redis, Beanstalkd, RabbitMQ, nginx, Git.\n- You have the ability and desire to own projects that directly impact Quartzy&#x27;s bottom line.\n- You are a strong communicator. You write well and can easily explain complex technical concepts to non-technical people.<p> Does that sound like you? We&#x27;d love to hear from you -- go here to read the whole job description and apply: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;7nl1uo\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;7nl1uo</a>","time":1480625255,"type":"comment"}