{"by":"simonhorlick","id":13085591,"parent":13080280,"text":"NGI Systems | Embedded Android OS Engineer | London | REMOTE<p>About Us<p>We are an innovative IT startup looking to fundamentally change the restaurant ordering and payment experience using tablet and kiosk menu systems. We are currently the top smart-menu solution in the UK, having reached the finals of the Tech Innovation Awards at Restaurant Tech Live 2016. Visit our product website at www.NextMenu.com for more information. Check our blog posts and tweets for the latest updates.<p>About You<p>You are a seasoned freelancer with extensive experience customizing OS builds for embedded solutions and IoT devices. You have advanced knowledge of Linux and are comfortable jumping in and getting your hands dirty. You have experience building Android from code and customizing the configuration, drivers and apps that are included in the image. You have created customized images for commercially available tablets and phones. You like tinkering with hardware and are familiar with low-level interfaces.<p>You are looking for a challenging project with real potential where you can make an impact. You have worked with global teams in different time-zones and geographical locations.<p>Nice-To-Have Experience:<p>* contributed to building payment acceptance devices<p>* worked on ePOS &#x2F; mPOS solutions<p>* created SDKs and APIs for attached devices (NFC sensor, thermal printer)<p>* built over-the-air OS and firmware update delivery mechanisms<p>* customised OS for Smart TVs<p>* customised OS for Smart Watches<p>About the Role<p>You will work closely with our in-house team and external partners, currently split between London, Switzerland and Romania.\nYou will work on porting customized versions of Android and embedded Linux to mobile phones and tablets, integrating the necessary drivers, libraries and daemons. You will automate the OS image build processes to help other developers ship functionality to end users. You will develop remote update subsystems for software, firmware and OS.<p>To apply send us a CV and a cover letter to hr@ngi.systems.","time":1480647217,"type":"comment"}