{"by":"kevinwuhoo","id":13081143,"parent":13080280,"text":"10x Genomics | Pleasanton &amp; San Francisco, CA | Onsite | 10xgenomics.com<p>We&#x27;re a biotech company creating novel software, chemistry, and microfluidic systems to allow better understanding of the genome. While DNA sequencing technology has advanced rapidly, it’s still at a level equivalent to what assembly language was to computing. With huge advances yet to be made, we&#x27;re creating products that will do for sequencing what C did for computing which enable scientists to gain higher-order clarity and meaning to what is now very low-level information. Software is a key part of that leap. There&#x27;s no shortage of difficult problems due to the scale and complexity of analyzing, managing, and visualizing sequencing data. Thoughtful and elegant software engineering can yield big payoffs.<p>Our software and instruments are used at top research institutions and hospitals around the world. 10x Genomics has most recently raised a $55M Series C from Fidelity and SoftBank and has about 130 employees in Pleasanton, San Francisco, and in the field across the world.\nYou can view a demo of an existing piece of visualization software at <a href=\"http:&#x2F;&#x2F;loupe.10xgenomics.com&#x2F;loupe&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;loupe.10xgenomics.com&#x2F;loupe&#x2F;</a>, or read about (and run if you&#x27;d like) our massively parallel pipelines at <a href=\"http:&#x2F;&#x2F;software.10xgenomics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;software.10xgenomics.com</a>. We manage our pipelines with Go, develop analysis code using the NumPy stack, and drive our front-end applications with React&#x2F;Redux (previously Angular 1), but we&#x27;re always open to any technology that allows us to develop faster. No previous biological experience is required; we have plenty of folks here to handle that, but there is a lot to learn about if you&#x27;re curious. You&#x27;ll be directly working with a team of six other engineers (one of them being myself).<p>We&#x27;re currently hiring for several software roles, but specifically for senior generalists, senior UI engineers, and QA engineers. Our computational biology group is also always looking for bioinformaticians who are experienced with NGS, and our company is always looking for scientists and engineers (hardware included). Here are some of the job postings we have up, but feel free to email me if you think you&#x27;re a good fit for another role.<p>- Senior Software Engineer - <a href=\"http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;274521&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;274521&#x2F;</a><p>- Senior UI Engineer - <a href=\"http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;274522&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;274522&#x2F;</a><p>- Software Quality Engineer - <a href=\"http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;476114&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;476114&#x2F;</a><p>- Software Quality Engineer (Computational Biology) - <a href=\"http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;472908&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;472908&#x2F;</a><p>Just a note that we do have a satellite office in San Francisco even though the listings only specify Pleasanton. Our full page of job listings can be found at <a href=\"http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.10xgenomics.com&#x2F;careers&#x2F;</a>. Reach out if you&#x27;re interested in working on high impact, big data problems using modern software development best practices or even if you just want to chat. You can reach me at kevin.wu@10xgenomics.com or @kevinwuhoo.","time":1480612486,"type":"comment"}