{"by":"cpeel","id":13080906,"parent":13080280,"text":"BlackSky Global | <a href=\"http:&#x2F;&#x2F;www.blacksky.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.blacksky.com</a> | Seattle WA &amp; Herndon VA | Relocation | ONSITE | Full-time<p>BlackSky Global, a service of Spaceflight Industries, is hiring Software Development Engineers in Test (SDETs) in Seattle WA and Herndon VA as we build out our constellation of 60 imaging satellites and the ground systems that communicate with them. We launched our first satellite, Pathfinder-1, two months ago with Pathfinder-2 set for launch Q1 2017.<p>Ground System SDET<p>In Seattle WA we&#x27;re hiring a Ground System SDET to work closely with our ground systems dev team as we build out our next generation ground systems platform. This includes the software operators use to task the satellites, the software running on our ground stations to communicate with the satellites, and the telemetry infrastructure used to track and monitor it all. Want to work on software used to control satellites in space? This is the team for you!<p>* Stack: Python 3.5 with asyncio, Docker, InfluxDB, ElasticSearch, LogStash, Kibana, Redis, Consul, Vault, GovCloud (plus radios, antennas, and satellites)<p>* <a href=\"https:&#x2F;&#x2F;www.blacksky.com&#x2F;detail-job&#x2F;job_20161030221054_7WKMYSHELDTBDT9L\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blacksky.com&#x2F;detail-job&#x2F;job_20161030221054_7WKMY...</a><p>Platform SDET<p>In Herndon VA we&#x27;re hiring a Platform SDET to work with developers to validate all aspects of our imaging and analytics platforms. This includes UX testing, feature validation, API-level unit testing, integration testing, and scale &amp; performance testing. While some of this work will be manual, the focus will be on writing and running automated tests and integrating those into an automated regression suite. You will work closely with our DevOps team as we drive the organization to a true continuous integration model.<p>* Stack: Node.js, AngularJS, React&#x2F;Redux, Karma, Mocha, Java, GitHub, CircleCI, AWS<p>* <a href=\"https:&#x2F;&#x2F;www.blacksky.com&#x2F;detail-job&#x2F;job_20161030214322_SXA3RF6C7WDLBRAQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.blacksky.com&#x2F;detail-job&#x2F;job_20161030214322_SXA3R...</a><p>Apply online at the links above or email me directly at &lt;my_HN_username&gt;@blacksky.com.","time":1480611390,"type":"comment"}