{"by":"arobbins","id":13081941,"parent":13080280,"text":"Factual | Engineers and data lovers | Los Angeles, San Francisco, Shanghai | www.factual.com&#x2F;jobs#openings<p>Factual is currently hiring engineers and data lovers of all levels in the SF Bay Area, Los Angeles, and Shanghai.<p>Factual’s location platform enriches mobile location signals with definitive global data, enabling personalized and contextually relevant mobile experiences. Built from billions of inputs, the data is constantly updated by Factual’s real-time data stack. We were named one of &quot;50 Disruptive Companies in 2013&quot; by MIT Technology Review. We have a terrific team that is still fairly small and an incredible CEO who was previously the co-founder of Applied Semantics (which was bought by Google and became AdSense). Factual has venture funding from Andreessen-Horowitz and our partners&#x2F;customers include Bing, Apple, Facebook and Groupon.<p>There are many challenging problems to work on at all layers of the stack: data cleaning and canonicalization, storage, deduping, serving, APIs, improving data using machine learning, etc. A great example is one of our most recent products, Geopulse Audience, which stands at the intersection of high quality places data and large scale analysis of user geo-data: <a href=\"http:&#x2F;&#x2F;www.factual.com&#x2F;products&#x2F;geopulse-audience\" rel=\"nofollow\">http:&#x2F;&#x2F;www.factual.com&#x2F;products&#x2F;geopulse-audience</a> . If you love data, Factual is the place to be. Our main criteria are that you&#x27;re smart and get things done, but you&#x27;ll get bonus points for experience with Clojure (<a href=\"http:&#x2F;&#x2F;www.factual.com&#x2F;jobs&#x2F;clojure\" rel=\"nofollow\">http:&#x2F;&#x2F;www.factual.com&#x2F;jobs&#x2F;clojure</a>), machine learning, NLP, algorithm design, or Hadoop&#x2F;Spark.<p>You can email me personally at alexr@factual.com, or view our job postings here: <a href=\"https:&#x2F;&#x2F;www.factual.com&#x2F;jobs#openings\" rel=\"nofollow\">https:&#x2F;&#x2F;www.factual.com&#x2F;jobs#openings</a>","time":1480616791,"type":"comment"}