{"by":"xfax","id":13082074,"parent":13080280,"text":"Axial | New York City | Full-time | Onsite | Head of Data | <a href=\"http:&#x2F;&#x2F;www.axial.net\" rel=\"nofollow\">http:&#x2F;&#x2F;www.axial.net</a><p>Axial is building the online capital market for private companies. In other words, we help mid-sized companies raise equity and debt to grow their businesses, and we make it easier for entrepreneurs to sell their businesses, earning rewards for years of hard work. Every week, over 200 private companies use Axial to passively explore or actively pursue a financial transaction for the next stage of their business.<p><i>The Role</i><p>Your mission will be to shape and lead a world-class data organization at Axial that helps the entire company make smarter decisions and which innovates new data products for the users of Axial’s online marketplace.<p>You will be managing a team currently consisting of a data scientist, data engineer and data analyst. You will manage the quality, integrity and stability of Axial’s data and data infrastructure. While Axial’s data volume is smaller than a mass-market consumer product, it is mission-critical to our success and comes with fascinating challenges. Axial is still a startup, and with that in mind, this role will be a mix of execution and management (in other words, you have to like getting your hands dirty, while designing scalable approaches).<p>Currently, Axial uses data to understand the health of our online network, run predictive analytics, track key goals and benchmarks, and optimize our sales and marketing tactics. The data team builds and tests internal data tools to help Axial’s business units make informed decisions, operate more efficiently and become more self-sufficient around data. The team also helps the CEO and executives with strategic projects.<p>See job posting for more details: <a href=\"http:&#x2F;&#x2F;www.axial.net&#x2F;about&#x2F;current-openings&#x2F;?gh_jid=515290\" rel=\"nofollow\">http:&#x2F;&#x2F;www.axial.net&#x2F;about&#x2F;current-openings&#x2F;?gh_jid=515290</a><p>Interview process consists of a phone screen and two on-site interview rounds.","time":1480617437,"type":"comment"}