{"by":"mathias_awkward","id":13080297,"parent":13080280,"text":"iOS Engineer | Hyper | <a href=\"https:&#x2F;&#x2F;www.watchhyper.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.watchhyper.com&#x2F;</a> | Berlin Area, Germany | Full-time | Onsite<p>This is your chance to join a small but highly skilled and fast product team in Berlin and work on a kick ass product suite on iPad, iPhone and Apple TV. Hyper is a curated video discovery app to find videos worth watching - handpicked by filmmakers every day.<p>With only two Devs so far, Hyper has been named Best of 2015 (Apple), Best of 2016 (Red Dot Design Award), Best New App in 100 countries, was greatly covered by The Verge, Wired, TechCrunch, Gizmodo and The Next Web all the way to Variety and the Wall Street Journal. Only one year into the project, Hyper is now pre-installed in all Apple Stores across the United States, is the best rated video app on iPad and was the first ever Editor’s Choice in the history of Apple TV.<p>Jump in with us to as we continue to push the boundaries on iOS and partake in shaping the very meaning of great UX. You will be surrounded by a highly creative team of engineers, designers and filmmakers that live to innovate and make sure to have fun in the process.<p>Enjoy working in a stylish factory floor office space in the vibrant center of Berlin’s alternative district of Kreuzberg. Free drinks, snacks, gadgets and a whole lot of perks included. We also tend to do team events that aren’t actually awkward. As we’re working closely with our sister team in New York, you should expect occasional trips with us to the Big Apple, for cool hackathons, exchange of learnings, and working with our remote colleagues right off the 80-something floor of the One World Trade Center.<p>We work with Objective-C, Swift, Java, AngularJS, React, NodeJS &amp; general Web tech.<p>Shoot us an email if that’s you’re thing too.<p>Email Jonas (co-founder) at jobs@watchhyper.com\nwatchhyper.com\n<a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=12846216\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=12846216</a>","time":1480608144,"type":"comment"}