{"by":"erbdex","id":13080557,"parent":13080280,"text":"Reverie Language Technologies | Bangalore, India | Full-Time<p>$whois \nanything that has to digitally touch more than 200M lives in India has to go multilingual(how PayTM had to launch in 8 languages post demonetisation). We build the tech that enables such growth into multilingual audiences. Our Language as a Service platform funnels data for clients like Ola, SnapDeal, HDFC, Practo, Hungama, AbhiBus and so on.<p>$pwd \nlooking to hire the first full time dev to start work on our analytics framework. This involves extending the data-infrastructure here and enabling data-driven decision making throughout the org. You&#x27;d be working very closely with our data-science team on some of the harder problems on this side of the continent. Our codebase spawns across golang, java, c, python and scala. We deep-learn knowledge graphs on instances with 500GB+ memory. 10M+ strings run through our platform on any given day.<p>$which \nyou come in and build systems so that we can programatically and scalably convert this into actionable insights. Can you build systems that understand Internet growth and usage better than most orgs? With data of some of the largest consumer facing clients running through our platform-- you have a shot at this. You&#x27;re free to use Erlang&#x2F;Haskell&#x2F;Scala&#x2F;R.. when and where you like.<p>$whoami \ninquisitive, data-driven, can wrap your mind around complex problems. As far as the toolkit goes-\n    - You&#x27;re familiar with Linux internals, are a advanced command line user.\n    - You&#x27;ve worked around with sql, nosql and time-series dbs.\n    - You know your bash and one or more of Perl, Python, PHP, Ruby.\n    - Great if you understand APIs, data-crawling, web frameworks and AWS.\n    - Excellent if you&#x27;ve worked with Kafka, ZMQ, Cassandra, Elasticsearch and D3.js libraries.\n    - Brownie points if you&#x27;ve built backends, designed APIs, worked at distributed systems.<p>Contact: abhishek.tiwari+hn AT reverieinc.com","time":1480609456,"type":"comment"}