{"by":"jhuckestein","id":13083139,"parent":13080280,"text":"Monzo | Backend, Web or Android Engineer | London | VISA, REMOTE, INTERNS <a href=\"https:&#x2F;&#x2F;monzo.com\" rel=\"nofollow\">https:&#x2F;&#x2F;monzo.com</a><p>At Monzo we aim to build the best current account in the world. We are always keen to hear from capable, creative engineers who want to help us accomplish that goal.<p>Our backend engineering team have a variety of different backgrounds: we have several non-graduates; only a couple of us studied Computer Science; one of the team has a degree in Marketing; some of us have worked in huge companies; some have only ever worked in startups; others are former consultants. As long as you enjoy learning new things, we’d love to talk to you.<p>We work in project-based sprints, and take turns to be the floating engineer who handles interrupt-driven work and non-critical bug fixes. We work directly with everyone across the company, from customer support to regulation, product to financial crime, and we run regular knowledge-sharing sessions so you’ll learn heaps about everything from how banks work to effective communication.<p>We encourage an open and transparent working environment. You can get involved in any aspect of the business you are interested in and, following Stripe’s example, all emails in the company are visible in an email archive. We regularly run hackathons in which people build things on our third party API and we contribute to open source software as much as possible. We’ve also made our product roadmap public and give sneak peeks of features in our community forum.<p>If you’re unsure about applying or have any questions about the role or team, please don’t hesitate to email our CTO Jonas (jonas@monzo.com) directly :) We&#x27;re very open about what we do in general, so our blog is a good place to learn more about what we do.<p>Stack: Go, Cassandra, Kubernetes, Kafka, Linkerd&#x2F;Finagle<p>Learn more on our careers page: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;monzo&#x2F;jobs&#x2F;244898\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;monzo&#x2F;jobs&#x2F;244898</a>","time":1480623674,"type":"comment"}