{"by":"kehunt","id":13082730,"kids":[13083496],"parent":13080280,"text":"Yammer (Microsoft) | Software Engineer | San Francisco, Seattle | VISA <a href=\"https:&#x2F;&#x2F;careers.microsoft.com&#x2F;yammer\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.microsoft.com&#x2F;yammer</a><p>Hiring all roles (mobile, front end, java services, infrastructure) in San Francisco and Seattle.<p>Yammer&#x27;s mission has always been to connect people with information to enable better, faster decisions. We believe effective communication involves more than chat rooms (though we use those too!). A big part of the mission I enjoy is that we are sparking cultural changes in our customers; to become transparent workplaces, with fewer silos and greater connections across the org chart from left to right and bottom to top.<p>Since winning TechCrunch in 2008 our growth has been exponential year over year. Over the last 4 years as a part of the Microsoft Office 365 suite, we&#x27;ve been quietly tying our systems together with the O365 fabric while continuing to improve the experience using our tried-and-true data-driven methods. We know everything we ship has an impact, and precisely how much.<p>We create with vim, SublimeText, IntelliJ, and GitHub; run on Macs and Ubuntu; write Swift &amp; ObjC, Java (Dropwizard), Python, and Ruby on Rails; manage PostgreSQL, HBase, RabbitMQ, Memcache, HAProxy, ElasticSearch, Kafka, Storm, Kibana, and Vertica clusters at scale; and automate using Puppet, Docker, Mesos, Marathon and Azure across physical data center &amp; cloud environments.<p>We have two floors in the &quot;Twitter building&quot; at 10th and Market in San Francisco, where we work next to the Outlook Mobile, MileIQ, Volumetrix, and other acquired startup teams. It&#x27;s a fantastic, open, creative space.<p>If San Francisco isn&#x27;t your thing, we have a large sibling team in Seattle (Redmond). We&#x27;re hiring for all roles in both locations!<p>Microsoft pays very competitively, invests in employees, and is highly supportive of a diverse and respectful workplace. It&#x27;s a startup atmosphere with the stability and maturity of a large company, which makes it a perfect balance for me.<p>If you have questions about a role I&#x27;d be happy to talk over email or in person. (I&#x27;ve been at Yammer for 7 years.)","time":1480621289,"type":"comment"}