{"by":"tmostak","id":13080948,"kids":[13082535],"parent":13080280,"text":"MapD | San Francisco (city) | Backend Developer, Frontend Visualization Developer, Technical Marketing Director (ONSITE)<p>MapD (<a href=\"https:&#x2F;&#x2F;www.mapd.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mapd.com</a>) is a Google Ventures&#x2F;Nvidia&#x2F;Verizon Ventures&#x2F;Vanedge&#x2F;In-Q-Tel backed Series A startup that builds a lightning-fast GPU-accelerated database and visual analytics platform that takes advantage of the massive parallelism and high memory bandwidth of GPUs. We can literally run queries orders of magnitude faster than other systems (<a href=\"http:&#x2F;&#x2F;tech.marksblogg.com&#x2F;billion-nyc-taxi-rides-nvidia-tes...\" rel=\"nofollow\">http:&#x2F;&#x2F;tech.marksblogg.com&#x2F;billion-nyc-taxi-rides-nvidia-tes...</a>) and since the results are on the GPUs, we can easily visualize the result sets with the native GPU rendering pipeline. Check out our Tweetmap demo (<a href=\"http:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;tweetmap\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;tweetmap</a>) or our billion-row taxi demo (<a href=\"http:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;taxis\" rel=\"nofollow\">http:&#x2F;&#x2F;www.mapd.com&#x2F;demos&#x2F;taxis</a>) for an idea of what the system can do.<p>We’re looking for:<p>Backend Developer - Someone with strong experience in C++ and database&#x2F;systems programming. Knowledge of CUDA&#x2F;OpenCL, LLVM, X64 Optimization, and&#x2F;or OpenGL a major plus.<p>Frontend Developer – Someone with strong knowledge of React&#x2F;Redux. Ideal candidate has good design sense and data visualization background.<p>Technical Marketing Director - Someone who can convey the technical value of our product via our website, blog, documentation, tutorials, demo videos, etc.<p>We’re a growing Series A company (30 people) with deep knowledge of databases and GPU Programming. Benefits and equity are competitive ($115K-$170K &#x2F; 0.2+%).<p>Please email jobs@mapd.com if you&#x27;re interested!","time":1480611584,"type":"comment"}