{"by":"gitonup","id":13093232,"parent":13080280,"text":"Indeed.com | Seattle, WA | Fulltime | Multiple Openings | ONSITE, VISA (can transfer H1-B) | <a href=\"https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobListSeattle\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobListSeattle</a><p>Indeed in Seattle is hiring for many roles, but especially for Technical Product Managers and Product Scientists.<p>In a Technical Product Manager we are looking for a feature owner able to wear many hats with a strong CS background and a track record of delivery.  Our Seattle office in particular is launching new teams around privacy and our pipeline of jobseeker data acquisition among others: <a href=\"https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobDetail&#x2F;Technical-Product-Manager&#x2F;3390\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobDetail&#x2F;Technical-Product-M...</a><p>In a Product Scientist, we are looking for a hybrid Data Scientist and Product Manager.  We are continuously improving how we match job seekers to employers and vice versa, as well as improving our understanding of how millions of people monthly are using our site.  An ideal candidate will use quantitative analysis, data mining, and machine learning techniques to understand how users on our site interact with each other, and use that information to drive new product features and improvements: <a href=\"https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobDetail&#x2F;Product-Scientist&#x2F;3949\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobDetail&#x2F;Product-Scientist&#x2F;3...</a><p>We have a gorgeous office space downtown near Pioneer Square by the water.  All of our openings for this office can be found at: <a href=\"https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobListSeattle\" rel=\"nofollow\">https:&#x2F;&#x2F;www.indeed.jobs&#x2F;career&#x2F;JobListSeattle</a><p>You can drop our Seattle recruiter a direct line by b64decoding amdhYnJpZWwtY2UraG5AaW5kZWVkLmNvbQ==","time":1480721678,"type":"comment"}