{"by":"Adutude","id":13101097,"parent":13080280,"text":"Tropare Inc.|Laguna Beach, CA, US|Full-time|ONSITE|$65K-$75k USD DOE|<a href=\"http:&#x2F;&#x2F;www.tropare.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tropare.com</a><p>Tropare, inc. provides big data services and mobile apps to fortune 500 enterprise customers.  Our products and services are powered by our own patented technologies to provide high performance, purpose built solutions.<p>We are a small focused company that has been in business for 5 years. We have been profitable and growing since the first year. We have now grown to the point, where we need to add a member to our team.<p>We run on a variety of platforms and use quite a bit of Perl, Javascript and C.  We also run our solutions in the cloud, mostly AWS.<p>We are currently seeking an entry level developer that has some web and database,  development experience, in a professional capacity, for 1-3 years.  Our new team member will be passionate about developing quality software.  As our new developer, you&#x27;ll be working with Perl, MySQL, Linux and Javascript on the back-end to our mobile app platform.<p>This is an excellent opportunity for someone,  with good coding skills,  that is looking to gain experience with a team of seasoned software development veterans.  The position is on-site, and our office is on one of the most beautiful stretches of the California coast.<p>Knowledge of Perl, PHP or similar, SQL databases, XML, Javascript, and Linux is required. Experience with MySQL, PostgreSQL, mod_perl, jQuery, AJAX, OpenAuth, Git, and AWS is desired.<p>Duties and Responsibilities: Maintain and extend functionality of back-end systems to support changes required by client requests. Develop new client facing web tools. Assist in troubleshooting software issues. Show creativity in developing solutions.<p>Position is on-site at our office in Laguna Beach, California, US (we are two blocks from the beach).<p>Please e-mail resumes&#x2F;cover letters to scott[at]tropare[dot]com. We&#x27;ll respond with a short quiz that tests your skills. Principals only, no agencies or recruiters.","time":1480876560,"type":"comment"}