{"by":"jasaunders","dead":true,"id":13108162,"parent":13080280,"text":"Uncorkd | Chicago, IL | Onsite | Full-time | Chief Technology Officer (CTO) | $75k-$100k &#x2F; 3%-10% equity<p>Uncorkd is hiring a CTO! If you&#x27;re interested in the alcoholic beverage space and want to be an early, integral part of our team, let&#x27;s chat. Uncorkd software is used by hundreds of restaurants and bars nationwide and we’re changing the way the industry manages their entire beverage programs.<p>The $200 billion beverage industry is antiquated and everything from performing inventory to placing orders from vendors is still done by paper and pen. We&#x27;re providing value-added tools to help the over 350,000 US establishments that serve alcohol better manage their beverage inventory, menus, ordering and provide analytics and data to help improve operations and business intelligence for the supply chain.<p>We are looking for a hands-on, super smart engineer to join us in tackling this fun industry with enormous opportunity. We need someone who is a full-stack generalist. Over time as we grow, you will be responsible for leading a more specialized team. You will spend 80% of your time helping build and develop new web and mobile products and 20% of your time improving our existing product. You will have decision-making authority to decide on the best technologies and frameworks for the job and have autonomy in creating, testing and deploying web and mobile products. If you enjoy beer, spirits or wine, you’ll get to work with your interests on a daily basis.<p>~ Here&#x27;s a link to the full job posting: <a href=\"http:&#x2F;&#x2F;www.uncorkd.biz&#x2F;about&#x2F;careers&#x2F;chief-technology-officer&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.uncorkd.biz&#x2F;about&#x2F;careers&#x2F;chief-technology-office...</a><p><i></i> Please email jobs+HN@uncorkd.biz with a description of yourself and experience, resume and any relevant links to your work or online profiles (GitHub, StackOverflow, etc…).","time":1480964163,"type":"comment"}