{"by":"amgreg","id":13178705,"parent":13080280,"text":"Octane Lending, Inc. | New York | Senior Software Engineer | On-site - Full-time | VISA | $115,000-$160,000<p>ABOUT US<p>We build software that offers financing to consumers and helps merchants close deals.  Our flagship product is a point-of-sale financing platform for niche consumer lending markets such as powersports and recreational vehicles. We have raised about $8M in venture capital and $25M in debt. Our management team hails from Yale, Harvard, Princeton, Columbia, and Penn and includes the former Chief Risk Officer for GE Capital Consumer.<p>WHO WE&#x27;RE LOOKING FOR<p>We are looking for experienced web developers with an ability to contribute to some or all of the following software development roles:<p>* JavaScript specialists for modern client-facing web development (a familiarity with the bleeding edge of web development is a plus).<p>* Python specialists or backend framework generalists (we run Django).<p>* Google Chrome Extension specialists.<p>* Backend and web development at scale.<p>* (Amazon Web Services and Unix specialists or infrastructure generalists.<p>* Security specialists.<p>OUR STACK<p>Linux, Python, Django, RabbitMQ, PostgreSQL, JavaScript (ES6), Google Chrome Extensions, etc.<p>QUALIFICATIONS<p>* 4+ years experience as a software developer building products for web and&#x2F;or backend with possible focus on third-party integrations, systems security, information security, API development, JavaScript framework development, and modern software development practices.<p>* A college degree or equivalent experience in Computer Science or related fields with emphasis on a solid understanding of Computer Science fundamentals.<p>* Ability and desire to be productive independently while integrating into a closely knit team. We are a small, growing startup with a strong entrepreneurial spirit, and we value this in others.<p>* Experience with application, database, networking, and systems security, especially in the realm of PCI or EI3PA compliance a plus.<p>* Experience with modern testing practices and technologies such as unit testing in Python and Javascript, integration testing, Jenkins a plus.<p>* Experience with machine learning, data science, and predictive modeling a plus.<p>* Familiarity with our existing and future stack a plus.<p>* User experience (UX), graphics, and a mind for product are a plus.<p>Interested?<p>email Andre Gregori, Chief Product Officer.\nandre (at) octanelending.com","time":1481742251,"type":"comment"}