{"by":"Spoom","id":10493591,"parent":10492086,"text":"Futuri Media | Cleveland, OH ONSITE | <a href=\"http:&#x2F;&#x2F;futurimedia.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;futurimedia.com&#x2F;</a> | Web and Mobile Developers<p>We are a profitable startup serving broadcast media clients around the country and the world from the heart of downtown Cleveland.  We work with radio, TV, and online publishers using our licensed technology to help them connect with their audiences, identify social trends before anyone else, and increase their ratings, revenue, and engagement.  You&#x27;ll be joining a small, tight-knit development team.<p>All positions below require someone who works well with a team, has great communication, and is able to work with a development tracking system (we tend to use Kanban-style systems, and we&#x27;re currently using JIRA Agile).<p>- TopicPulse Web Developer (PHP, MySQL, Javascript)<p>TopicPulse lets radio and TV stations know what&#x27;s trending in social media right now, in their market, nationally, and around the world.  TopicPulse monitors Twitter, Facebook, and other social media platforms to identify precisely which topics are hot, and which ones are not, in real time, taking the guesswork out of what the audience is talking about.<p>Required skills include PHP, MySQL, Javascript, jQuery, Backbone.js, CSS (LESS a bonus), Redis, Memcached, Node.js, git (or similar version control), Linux &#x2F; Unix command line familiarity, Bootstrap, Nginx, and Apache.  If you&#x27;re a quick learner and you&#x27;re missing one or two of these, apply anyway.<p>We&#x27;re looking for senior developer-level experience for this position.  Ideally you have worked through issues related to scalability as TopicPulse has many moving parts and is growing quickly.  Experience with semantic analysis or AI would also be big plusses.<p>- Mobile Developer (Frontend, Cordova, Javascript)<p>Our radio, TV, and portal apps allow users to connect with the media they care about and stay up to date.<p>Required skills include Cordova &#x2F; PhoneGap experience, CSS (LESS a bonus), Javascript, jQuery, Bootstrap.js &#x2F; Marionette.js, Node.js, Grunt.js (or similar Javascript build systems), and iTunes Connect &#x2F; Google Play deployment.  Plusses include iOS (Objective C or Swift) and&#x2F;or Android (Java) development capabilities, PHP, MySQL, and other backend abilities.  As mentioned, you&#x27;ll primarily be working on the front end, but we value versatility.<p>- Web Developer (PHP, MySQL, Javascript)<p>Futuri Media powers hundreds of radio and TV stations around the country and the world with our technology solutions.<p>Required skills include PHP, MySQL, Javascript, jQuery, Backbone.js, CSS (LESS a bonus), Redis, MongoDB, Memcached, git (or similar version control), Linux &#x2F; Unix command line familiarity, Bootstrap, Nginx, and Apache.<p>---<p>All full time developer positions include a competitive salary and excellent benefits, including health and dental insurance, paid time off, 401K retirement plan, monthly massages, discount gym memberships, Cleveland Indians tickets, and free parking.  Did I mention that we&#x27;re a block away from Progressive Field?<p>Apply online at <a href=\"http:&#x2F;&#x2F;futurimedia.com&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;futurimedia.com&#x2F;careers&#x2F;</a> through the Senior Web Application Developer position, and please mention that heard about the position from Jamie.  Futuri Media is an equal opportunity employer.","time":1446486684,"type":"comment"}