{"by":"vfiles","id":10494562,"parent":10492086,"text":"VFILES • NYC • Full Time • ONSITE • Full-stack + iOS<p>VFILES is the hippest and foulest-mouthed unification of community, content, and commerce in the fashion world today. To spare you a longer, platitudinous spiel about the brand, here&#x27;s some things to watch&#x2F;read about us:<p>• Our most recent user-generated fashion show: <a href=\"https:&#x2F;&#x2F;www.vfiles.com&#x2F;vfiles&#x2F;32011&#x2F;media&#x2F;459248\" rel=\"nofollow\">https:&#x2F;&#x2F;www.vfiles.com&#x2F;vfiles&#x2F;32011&#x2F;media&#x2F;459248</a> \n• New York Times: <a href=\"http:&#x2F;&#x2F;www.nytimes.com&#x2F;2013&#x2F;05&#x2F;02&#x2F;fashion&#x2F;building-blocks-all-in-a-row.html?_r=2\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2013&#x2F;05&#x2F;02&#x2F;fashion&#x2F;building-blocks-al...</a>\n• New Yorker Magazine: <a href=\"http:&#x2F;&#x2F;www.newyorker.com&#x2F;culture&#x2F;culture-desk&#x2F;a-model-funeral\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newyorker.com&#x2F;culture&#x2F;culture-desk&#x2F;a-model-funera...</a>\n• Nylon: <a href=\"http:&#x2F;&#x2F;www.nylon.com&#x2F;articles&#x2F;how-vfiles-is-changing-fashion\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nylon.com&#x2F;articles&#x2F;how-vfiles-is-changing-fashion</a><p>We&#x27;re looking for<p>• an experienced iOS developer: We’ve recently started a relationship with Thoughbot (a great bunch of open-source- and robot-obsessed developers) to build an iOS app. They’re about a month into development with Swift 2, targeting iOS 9, and using functional, modern programming techniques. We want you to hook into their process, and eventually take over all iOS development.<p>• a full-stack engineer: Our application is a decoupled suite of Snap services serving an increasingly mature Angular frontend. You&#x27;ll not only get to work with Haskell every day, but also fun tools like Neo4j, ZeroMQ, ElasticSearch, and more. Engineers here always have the right to experiment with new techniques and technology to solve problems.<p>You&#x27;ll join a team of four engineers in a company of about twenty people amongst the editorial team, shop team, video production, etc. Everybody here is at the top of their game; it&#x27;s a very refreshing environment to work in, regardless of your interest or lack thereof in fashion and pop culture.<p>As for fringe benefits, we throw the best parties in town (hosted by A$AP Mob and crashed by Kendrick Lamar), have company trips to gorgeous Montauk, organize funky Soul Cycle rides and boxing workouts with designers, models, and other personalities, and are invited to essentially everything that happens in New York.<p>You can write us at engineering ∀ vfiles ∘ com if you are interested in hearing more and coming in to meet us.<p>At this time we can only consider local applicants willing and legally able to work at our Soho offices without sponsorship.","time":1446493248,"type":"comment"}