{"by":"jackfoxy","id":10492781,"parent":10492086,"text":"Tachyus - San Mateo, CA - several open positions<p>We are revolutionizing the oil and gas industry, well funded, and (most importantly) producing significant revenue. This is the opportunity for the right people to align with us and share in ownership. We are a focused science and engineering driven team working with real physical devices and processes measuring and analzing the natural world. We take our Values statement seriously, so read it first and decide. <a href=\"http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;tachyus.com&#x2F;joinus&#x2F;</a><p>Software Engineers - F#, Python, Typescript, UI<p>Expressive, declarative code is more frequently correct code. The core of our software platform is built with F#, a functional-first, strongly-typed compiled language. We seek engineers who are excited to do full-stack, product-driven thinking.<p>Our core physics and data science algorithms are written in Python and bridge the gap between pure research code and production-quality algorithms.<p>Web Engineers (you know who you are) we use Typescript on the front-end, and F# for our API layer. We recently open-source Gluon <a href=\"http:&#x2F;&#x2F;www.tachyus.com&#x2F;gluon&#x2F;tutorial.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.tachyus.com&#x2F;gluon&#x2F;tutorial.html</a>. Regardless of language experience, the ideal candidate has strong experience implementing web applications which are correct, attractive, performant, and maintainable.<p>Correctness Engineer<p>The Tachyus Correctness Engineer is a Software Engineer who specializes in building the infrastructure to prove our software and algorithms produce accurate results. The CE works closely with the Software and Science organizations to prevent, catch, prioritize and eliminate errors in both software and data. He or she is an engineer at heart, preferably with experience writing production code.<p>Data Physicist (research scientist), Data Engineer (Business Intelligence), Petroleum Engineer, Recruiter<p>We are hiring across the board as we execute on our ambitious product roadmap.","time":1446481622,"type":"comment"}