{"by":"acdlite","id":10495054,"parent":10492086,"text":"OpenGov | Redwood City, CA | ONSITE\nFull-Stack Engineer<p>We&#x27;re innovating, solving big challenges and having fun while doing it. As a senior member of OpenGov&#x27;s engineering team, you will engage in solving technical problems from taming complicated data sets to pushing browsers to their limits with powerful data visualization and analytics.<p>We&#x27;re looking for folks with can-do attitudes who go above and beyond. You are a self-starter who can take early ideas and quickly iterate to build prototypes and products. Our ideal back-end engineer has experience delivering high quality, maintainable code to production, implementing both incremental improvements as well as large features and architectural advancements. Our engineering culture is centered around hiring smart talent, building world-class software and we stay humble while driving forward with our audacious mission.<p>Some of our current project wish list items include<p>- Migrate financial data towards a columnar store\n- Expand our dashboard reporting capabilities\n- Self-service tools for customers to get up and running in minutes\n- Deeper data integrations with customers<p>Responsibilities<p>- Architect and implement software components with order of magnitude scaling in mind\n- Build, analyze, and maintain APIs that power many products\n- Work with data (lots of it)\n- Contribute towards building a great culture in a small team &amp; company<p>Ideal Candidate Has<p>- Strong desire to innovate and build world class software that is mission-driven\n- 4+ years of experience and a track-record of developing high-quality code, preferably Ruby in a small, agile team\n- Experience working with large, distributed systems\n- Experience with JS&#x2F;Node.js, Postgres, Cassandra\n- Experience building SaaS software\n- BS&#x2F;MS in Computer Science preferred\n- Sound judgment for balancing between idealism and pragmatism","time":1446496919,"type":"comment"}