{"by":"colinyoung","id":10493567,"parent":10492086,"text":"Moneythink | Chicago, IL<p>At Moneythink, we&#x27;re building tech products that help build the habits American youth will need to become more financially capable. To equip students for these decisions, Moneythink trains college volunteers to mentor youth using a mobile technology suite designed to support students as they build the financial skills they need to reach their full potential. We&#x27;re a 7-year old nonprofit that has backing from both small donors, medium-sized venture firms that fund nonprofits, institutions like Chase, AMEX, and governments at the state and city level. We&#x27;re currently hiring for two positions:<p>1. Senior Android Engineer (ONSITE)<p>We believe that mobile apps are the best way to form healthy financial behaviors, and we’re looking for a Senior Android Engineer to help us build several new products and to expand our core mobile product. We’re looking for someone who can lead Android projects in both the Android SDK and React Native (but we know it&#x27;s brand new - we&#x27;ll learn it together!). You should be comfortable working with both in-house and external teams (we currently work every day with CauseLabs, a well-regarded Denver-based software lab.) You&#x27;d be our second in-house engineer, but in addition to the other in-house engineer, you&#x27;ll work with 3 remote developers; that dev headcount will be maintained for the next 2-3 quarters but we&#x27;ll gradually become an entirely in-house engineering team. Including engineering, we intend have a 5+ person in-house product team by the end of the year.<p>For more: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;moneythink&#x2F;jobs&#x2F;97443-senior-android-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;moneythink&#x2F;jobs&#x2F;97443-senior-android-engine...</a><p>2. UI&#x2F;UX Lead (REMOTE OK, ONSITE in Chicago or San Francisco)<p>Financial education is very hard to simply teach in a classroom, so we’re excited to bring on an experienced interaction and visual designer who can take our core app to the next level while also building new apps for our next user segments. We’re looking for a designer who has studied the discipline of user experience, has a robust visual design portfolio, and is excited to get in the field to understand the human context of our users. The ability to create mockups with clear requirements for engineering is important. The ability to do front end development in HTML&#x2F;CSS&#x2F;JS would be nice, but is not required.<p>For more: <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;moneythink&#x2F;jobs&#x2F;97463-ui-ux-lead\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;moneythink&#x2F;jobs&#x2F;97463-ui-ux-lead</a>","time":1446486479,"type":"comment"}