{"by":"buf","id":10493415,"parent":10492086,"text":"iOS&#x2F;Rails engineer - 17hats - REMOTE<p>17hats is an online service designed to help tame the chaos of running a small business by combining invoicing, customer quotes, contracts, to-do lists, client contacts, bookkeeping and more into one easy-to-use app. Rather than repeat all the stuff that makes 17hats so nifty, head on over to our website and check it out: <a href=\"https:&#x2F;&#x2F;www.17hats.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.17hats.com</a><p>* Required Dev Skills (please know 2 out of the 3 below):<p><pre><code>    iOS (obj-c&#x2F;swift) \n\n    Ruby&#x2F;Rails (our API)\n\n    JS (Knockout, but all new stuff is React)\n</code></pre>\n* Responsibilities:<p>- Lead by example – by writing good code, talking about good code, and then drinking beers with the team to celebrate all the good code everyone wrote<p>- Design and development of new product features and enhancements<p>- Communicate with non-engineers to define requirements and deliverables<p>- Know what technologies are out there in case you need to use them<p>- Periodically teach your co-workers all the great stuff you learned via tech talks, brown bags, blogs or open source<p>* About Us:<p>We are a small team of good-hearted folks with families, working really hard on a product that we’re very excited about. We’re committed to staying small and nimble, and we have this crazy belief that there are other good-hearted people out there willing to help us get a fair shot against the big corporate players. We hope that resonates with you.<p>You&#x27;ll be working with people who previously worked at places like Eventbrite and Instacart, people who&#x27;ve contributed to Rack, and people who have founded their own startups before. We&#x27;re all ambitious, but we realize the importance of being able to work from anywhere.<p>Every engineer on our team works remotely. That being said, we do need someone who can work California business hours (9am-6pm PST) and who is available for emergencies at night. If you live in the LA area, you are welcome to be in our cool office in Pasadena. Bonus points if you can curse in Dutch.<p>email buford @ 17hats","time":1446485591,"type":"comment"}