{"by":"willu","id":10493125,"parent":10492086,"text":"AddStructure - Chicago, NYC - REMOTE - Full Stack Developer<p>Founded in 2014, AddStructure is an angel-backed startup focused on providing state of the art natural language processing applications to large enterprises. Have you ever visited a product on Amazon or a restaurant on Yelp and wondered how they&#x27;ve automatically summarized those reams of reviews? We provide that same capability and many others to our Fortune 100 and Global 1000 customers. We tackle some of the hardest problems in text analytics and produce results that border on magic.<p>We&#x27;re currently hiring multiple developers with various levels of experience. As you&#x27;ll be among our earliest employees, there&#x27;s a great opportunity to play a fundamental role in building a strong foundation to support future growth. Above all else, we&#x27;re looking for smart, capable people with a &quot;can do&quot; attitude.<p>Our ideal candidate will possess all or most of the following attributes:<p>* Flexibility to work in a fast-paced startup environment  \n* Strong understanding of modern frontend development practices  \n* Fluency in Javascript&#x2F;Node.js, HTML, and CSS&#x2F;Less  \n* Familiarity with frameworks like Backbone and Bootstrap  \n* Experience with source control, testing, and deployment tooling - git, grunt, etc.  \n* Competency with both relational databases (SQL Server, PostgreSQL) and NoSQL databases (MongoDB)  \n* Interest in learning new technologies and helping with a wide array of technical tasks<p>Required:  \n* At least 2 years of development experience  \n* Located in the domestic United States  \n* English fluency<p>Preferred:  \n* Bachelor&#x27;s Degree in Computer Science or similar field  \n* Experience with server-side programming in Java, C#, and&#x2F;or Scala  \n* Experience with Apache Spark, Kafka, Cassandra and related distributed computing systems  \n* Experience with administering Amazon Web Services (EC2, EB, EMR, etc.)<p>Email us: jobs@addstructure.com","time":1446483971,"type":"comment"}