{"by":"galori","id":10494282,"parent":10492086,"text":"StitchFix | San Francisco, CA | [REMOTE OK] [ONSITE IS MORE FUN] | Principal Full-Stack Rails Engineer &#x2F; Manager<p>(We&#x27;re also hiring for many, many other roles including: VP Engineering, UX Designer, and then a slew of operation &#x2F; warehouse type roles, Stylist roles, Photographer, Comp Managers and lots of others. We&#x27;re growing at a dizzying pace. I&#x27;m dizzy just thinking about it. All open jobs: <a href=\"https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers</a>)<p>We&#x27;re solving some REALLY interesting problems. I just joined as Principal Engineer and I&#x27;m loving it. The business is an advanced algorithms &amp; machine learning recommendation engine applied to a Women&#x27;s Fashion e-commerce &#x2F; subscription service. In english, we send our clients an outfit every few weeks, our algorithm and our stylists choose the perfect outfit for our customers, and they LOVE it. Just search instagram for hashtag &quot;#stitchfix&quot; and see how many of our customers post happy pictures of themselves receiving this month&#x27;s &quot;Fix&#x27;. Our customer referral to friend statistic is off the charts.<p>On the business side, it&#x27;s a startup but we&#x27;re profitable and we&#x27;re not planning on seeking additional funding. Its amazing to be part of a company that is experiencing so much growth and success. On the Engineering side, we&#x27;re solving some really interesting problems. The Principal Engineer role which I just started is a very interesting type of position. We do not have Product Managers, and Principal Engineers are responsible for a part of the business (I&#x27;m responsible for part of the consumer facing web site). They are responsible for driving the product forward, working with all the stakeholders and then also implementing the solutions. When people hear this sometimes they ask &quot;so what the engineers just sit around and invent features?&quot;...well its not like that. What Product Managers do is talk to all the business stakeholders, customers, consult the A&#x2F;B testing results, take UX design input into account and then try to put that all together. Of course there is still one key business stakeholder that makes the high level calls, but there is a lot of Product Management type work that happens between that decision that typically falls on a product manager and here it falls on the Principal engineer.<p>There is an entire separate department we call AA (Algorithms and Analytics) They are working on really advanced machine learning recommendation algorithm and with every little improvement of the algorithm they can see real impact of increased sales and increase customer satisfaction. Don&#x27;t let the industry (Womens Fashion) put you off. The smartest, most driven but nicest people work here and you&#x27;ll be doing yourself a disservice if you don&#x27;t at least consider it. The engineers I&#x27;m working with really care about the craft of Software Engineering and this is a great environment for anyone that feels the same.<p>Check out our engineering and algorithms web site: <a href=\"http:&#x2F;&#x2F;technology.stitchfix.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;technology.stitchfix.com&#x2F;</a> and here is our jobs page <a href=\"https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.stitchfix.com&#x2F;careers</a>.<p>To reach the hiring managers and recruiting team directly, email tech-jobs (at) stitchfix (dot) com (its not a black hole - it actually goes to the right people.) You can say you heard about it from me (Gal Steinitz) - a Principal Engineer on the Engineering team.","time":1446491658,"type":"comment"}