{"by":"dankang","id":10495700,"parent":10492086,"text":"The Rockport Group | <a href=\"http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;</a> | New York, NY | Full Time | Onsite<p>Rockport is an industry leading provider of commercial mortgage origination, underwriting, securitization and asset management software.  Our software platform is used by some of the largest financial services companies in the world to power their business, including banks you&#x27;ve probably heard of, investment funds your parents&#x27; retirement funds may be invested in and insurance companies that may insure everything around you.<p>We are always looking for talented engineers to join our development team - we have three roles in mind at the moment; see descriptions below:<p>- Financial Software Engineer:\n<a href=\"http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;about&#x2F;careers.html#financial-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;about&#x2F;careers.html#financial...</a><p>This role is highly visible within the firm and you will be working closely with other developers, as well as our product integration team, sales and senior management. This part of our product suite is extremely sensitive to the growing needs of our customers and changes in the marketplace and you will have a chance to contribute to the product roadmap as well as our strategic direction.<p>Understanding of real estate finance and structured products as well as experience with the technologies and languages we&#x27;re using – C#, VBA, Excel and SQL – will also be helpful, but we&#x27;re open to exceptional candidates with any background.<p>- Software Engineer\n<a href=\"http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;about&#x2F;careers.html#engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;about&#x2F;careers.html#engineer</a><p>You will have a chance to work with a variety of products and technologies, such as web front ends created with AngularJS, database-backed web services powered by SQL Server and ASP.NET Web API and XAML-based .NET applications that provide superior desktop experience and connectivity with Microsoft Office. You will use technology to create elegant products that meet the complex needs of our demanding customers and use your insight and creativity to contribute to the technical roadmap and architectural decisions that will shape our products for years to come.<p>- Senior Software Engineer:\n<a href=\"http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;about&#x2F;careers.html#senior-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.therockportgroup.com&#x2F;about&#x2F;careers.html#senior-en...</a><p>See above.  But also, as a senior member of the team, you will guide and mentor less experienced members of the team, provide leadership in your areas of expertise and represent the engineering team to senior management.<p>You can send your resume to careers@rockportllc.com - also feel free to contact me @ dkang@rockportllc.com","time":1446502228,"type":"comment"}