{"by":"cyriacthomas","id":10497879,"parent":10492086,"text":"Compile • Bangalore • Full Time • ONSITE • <a href=\"https:&#x2F;&#x2F;www.compile.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.compile.com&#x2F;</a><p>Our goal at Compile is simple: help organizations benefit from the intelligence that’s hidden under big data. Our customers, which include Fortune 500 to hyper-growth startups, use our insights to power their marketing engine.<p>• Software Engineer, Web&#x2F;Generalist (<a href=\"https:&#x2F;&#x2F;www.compile.com&#x2F;careers&#x2F;software-engineer-web.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.compile.com&#x2F;careers&#x2F;software-engineer-web.html</a>)<p><pre><code>  - Solid understanding of web-related technologies and programming \n  - Ability to design systems, good knowledge of DBMS\n  - Must have experience in designing and building REST interfaces\n  - Must have experience in Django and similar web frameworks\n  - Must have experience with front-end (templates, js frameworks, styling)\n  - Comfortable with analysing large amounts of data\n  - 3 to 5 years experience in the industry\n</code></pre>\n• Software Engineer, Data&#x2F;Generalist (<a href=\"https:&#x2F;&#x2F;www.compile.com&#x2F;careers&#x2F;software-engineer-data.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.compile.com&#x2F;careers&#x2F;software-engineer-data.html</a>)<p><pre><code>  - Ability to design systems, good knowledge of DBMS\n  - You are familiar with algorithms for natural language processing (NLP), information retrieval, text processing, text mining and analysis\n  - You are comfortable with tools such as NLTK, Pandas, Scipy, Weka, Lingpipe, Gensim, Apache mahout, openNLP, Stanford NLP\n  - Ability to visualize the output with d3.js, matplotlib or similar libraries.\n  - Must be able to design and build REST interfaces\n  - Must have knowledge of web frameworks or micro-frameworks\n  - Experience with Deep Learning is a plus\n  - 3 to 5 years experience in the industry\n</code></pre>\nIf you are interested email us at careers@compile.com","time":1446530782,"type":"comment"}