{"by":"leocassarani","id":10499008,"parent":10492086,"text":"London, United Kingdom - Geckoboard - <a href=\"https:&#x2F;&#x2F;www.geckoboard.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.geckoboard.com</a> - ON SITE (but some working from home is not a problem)<p>Geckoboard is a successful, growing 25-person B2B SaaS startup based in East London. Our elegant real-time dashboards solve a tricky, important problem for thousands of paying subscribers, by taking the complexity out of connecting to their data and making that information simple for everyone to interpret at a glance. As a result, our customers unlock data they didn&#x27;t know they had, connect people and join up projects, and make better decisions faster.<p>We are looking for a front-end developer who is excited about tail-call optimisation in ES6, uses TDD consistently or wants to learn to do so, and builds super-usable single-page applications. Any React knowledge is a plus but we are happy for you to learn with us.<p>We are also looking for an experienced and highly technical QA Engineer. As our first QA hire, you&#x27;ll have the opportunity to decide on the approach and tools that fit Geckoboard best. You will identify where our QA process is currently lacking, while making sure that we can continue deploying changes to the product several times a day.<p>Please see our jobs page for details: <a href=\"https:&#x2F;&#x2F;www.geckoboard.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.geckoboard.com&#x2F;careers&#x2F;</a><p>We’re constantly striving to ensure that we offer the most encouraging, supportive and efficient environment possible. We want everyone on the team to participate in making our architectural decisions. The whole team is involved in prioritising and evaluating our work and we regularly program in pairs to share knowledge, promote collaboration, and improve code quality.<p>We don&#x27;t just pay lip service to work-life balance, we actively and strongly encourage it. Flexible working hours and the ability to regularly work from home let you work in a way that fits you and your family, and we have generous maternity and paternity leave policies. We see our contractual obligation to offer 25 days&#x27; paid holiday as a &#x2F;lower&#x2F; bound for everyone in the organisation, not a limit. We actively contribute to personal and professional development and have a minimum budget allowance to be spent on courses, conferences, and books. We also run fortnightly &quot;innovation days&quot;, where everyone has complete freedom to work on anything that interests them, from contributing to open-source projects, learning a new skill, or improving our internal tools and processes.","time":1446552536,"type":"comment"}