{"by":"source99","id":10493344,"kids":[10499204],"parent":10492086,"text":"Fitbit | San Francisco, Boston, San Diego -- <a href=\"https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#all\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#all</a><p>Fitbit is hiring lots of positions in multiple locations.  It is a great company to work for.<p><a href=\"https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#all\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fitbit.com&#x2F;jobs&#x2F;search#all</a><p>At Fitbit we are committed to creating great experiences that inspire and empower people to live healthier, more active lives. We design products and experiences that fit seamlessly into your life so you can achieve your health and fitness goals, whatever they may be.\nFounded in 2007 in San Francisco, Calif., today, Fitbit is the market leader in the fast-growing Connected Health &amp; Fitness category. Fitbit’s full line of products, which includes the Fitbit Zip and Fitbit One activity tracker clips, the Aria Wi-Fi Smart Scale and now, the Fitbit Flex, means Fitbit offers the most diverse product line for everyone to track their everyday health. Fitbit products are carried at leading U.S. retailer stores and sold internationally, including Canada, UK, France, Germany, Spain, Japan, Australia and New Zealand. Fitbit is funded by the Foundry Group, True Ventures and SoftTech VC.<p>Perks &amp; Benefits at Fitbit<p>Free Fitbit products<p>Competitive salaries and Equity Options still available<p>Awesome Medical Benefits: Health, Vision, Dental, Life<p>Catered lunches and fully-stocked kitchen<p>Choose your technology. Mac or PC<p>Flexible work schedules<p>Open and collaborative environment where your ideas are heard<p>Casual dress code<p>High visibility to management<p>Tax-free Transit<p>Employee referral bonus program<p>Weekly Events: Happy Hours, Holiday Parties<p>Work on Products that are helping improve peoples&#x27; lives<p>Office TVs and Games<p>Easy access to Public Transportation<p>Amazing downtown San Francisco location","time":1446485220,"type":"comment"}