{"by":"Bwater_Tech","id":10496854,"parent":10492086,"text":"BRIDGWATER ASSOCIATES  |  Westport, CT  |  Full Time  |  Onsite<p>At Bridgewater, we are engineering Systems to Understand the World - our philosophy is that the world can be understood, and we strive to build a fundamental, cause-and-effect understanding of markets and management. Technologists advance this mission, collaborating with our researchers and managers to design, engineer and run platforms that enable systemization and scale in everything we do.<p><i>DATA SCIENTIST</i> - \nYou will combine advanced data analysis techniques with a deep understanding of the financial domain to generate new standards, answer the toughest data challenges, and drive Research to adopt methodologies that advance our systematic investment process. Your experiments and discoveries will serve as a basis for the development of a new class of platform designed to accelerate investment research.  \n<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1NNKOhA\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1NNKOhA</a><p><i>SOFTWARE DEVELOPER</i> - \nResearch Technology is building the next generation platform to fuel Bridgewater’s macro‐economic research, modeling, simulation, and visualization. We are changing how Bridgewater, the world&#x27;s largest hedge fund, discovers and systemizes new fundamental economic understanding – the core of our business. We are looking for the best engineers in the world to join us on our mission. This is the hardest problem that most of us have ever seen. The intellectual ambition of our endeavor ‐‐ to build a studio (like an IDE) for macro‐economists to use to develop a model of how the entire world works ‐‐ is breathtaking. It begs for creative invention, from UI&#x2F;UX breakthroughs to new architecture&#x2F;systems design, and everything in between. The engineering challenge is tough; we have large volumes of data, always‐increasing performance demands, and the security constraints that come from working with the firm&#x27;s most valuable intellectual property. Our collaboration with end users, some of the most sophisticated economic thinkers in the world, is intense and demanding by nature.\n<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1N9QBex\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1N9QBex</a>","time":1446515766,"type":"comment"}