{"by":"ajayrinse","id":5970316,"parent":5970187,"text":"San Francisco CA – Full Time – Technical Lead (VP of Engineering)<p>Rinse (www.rinsenow.com) is a consumer-service start-up that removes the stress that comes with dry cleaning &amp; laundry and gives you back control of your busy life.  We are creating a seamless customer experience through a combination of technology, incredible customer service, and strong back-end partnerships.  Customers can schedule a pick-up on their mobile device; we then pick-up, clean, and return their clothes at their convenience.  We have received a strong response to date and are growing the business (and team) quickly to help more customers recapture some of their precious time!<p>We are looking for someone who is excited about joining a start-up early and helping to build something special.  We want someone who is excited to tackle immense technical challenges with total freedom on how to execute.  We want someone who wants a seat at the table; who is interested in having his&#x2F;her voice heard in major strategic discussions and board meetings; and who wants to contribute with way more than just beautifully written code.  We want someone who wants to drink from the fire hose, have an immediate and substantial impact, and wants to work closely with a high-caliber team and accomplished advisors.  We are moving fast and we want someone who is ready to run with us.<p>You…\n- Are itching to join an amazing company on the ground floor and have a major impact within the first couple months\n- Crave freedom to operate and decide how you want to build the core technology that supports the business\n- Are passionate about solving complex and dynamic challenges, and building highly scalable systems\n- Are capable of and excited to recruit a world-class team of engineers to work with you\n- Have experience developing, releasing, and maintaining large-scale software applications\n- Have a Bachelors or Masters in Computer Science from a leading institution<p>We…\n- Value respect, integrity, judgment, and positive energy over job-related experience and technical chops\n- Work hard because we love what we’re doing, but also believe in balance\n- Plan to invest heavily in technology to streamline business operations, in addition to having a world-class consumer-facing mobile application\n- Are based in SF, which is where we have initially launched…but our ambitions extend well beyond the Bay Area.\n- Are moving quickly, are well capitalized, and want someone who will come in and hit the ground running\n- Are led by two co-founders with substantial experience in start-ups, dry cleaning, and consumer focused companies.<p>We are looking for someone who is strong technically but who can also be a leader and culture carrier for Rinse.  The right person will be granted a substantial equity stake, cash compensation, and will have the chance to help build an amazing company from the ground up.  If you are interested, e-mail your resume to Ajay Prakash at ajay@rinsenow.com to learn more.","time":1372683959,"type":"comment"}