{"by":"Ovid","id":5970251,"kids":[5980407,5970303],"parent":5970187,"text":"Amsterdam, Netherlands. Work permit and relocation assistance provided.<p>We want developers who like to have fun and socialize outside of work, but care about their jobs, too. We&#x27;re looking for UX designers, front-end and back-end developers.<p>UX designer: use Photoshop, Gimp, or whatever makes your socks roll up and down and you know how to make Web and&#x2F;or mobile applications work for customers. Knowledge of HTML, JavaScript and CSS also needed.<p>Front-end developer: you can make Web sites do exactly what you want them to do, regardless of the browser or operating system the web site is running on. Knowledge of HTML, JavaScript and CSS required.<p>Back-end developers: you know what it takes to power the back-end of large web sites. You understand scalability issues and can explain the difference between an inner and outer join. You know what O(log N) is and why it&#x27;s important. Your programming language history isn&#x27;t important because you&#x27;re good enough to learn a new language if needed.<p>All positions: not looking for rock stars. Looking for competent technical talent who are willing to move to Europe (unless you&#x27;re already here). We have many expats working here and we&#x27;ll even help pay for Dutch lessons, if you want them.<p>We also like people who understand business because you&#x27;ll be expected to make many of your own decisions without having to ask permission from management for every little thing that you do. You will have the power to get stuff done, work with a great bunch of people and be able to spend your five weeks of vacation time cruising across Europe and discovering why Amsterdam is such a beautiful city.<p>For more information, see <a href=\"http://www.allaroundtheworld.fr/vacancies.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.allaroundtheworld.fr&#x2F;vacancies.html</a><p>Send email to jobs at allaroundtheworld.fr.  Please include:<p>Your name, your timezone (helpful when scheduling interviews!), your CV, where you heard about us and why you want to live in Amsterdam!","time":1372683263,"type":"comment"}