{"by":"farolino","id":5970777,"parent":5970187,"text":"London, UK - M7 Real Estate - Full Stack Web Developer<p>I am Oli the Technology partner at M7 Real Estate and I am looking for a full stack web developer to work from our London Office.  I can&#x27;t accept remote workers for this role, but you&#x27;ll be working from our 7th Floor Office in Marble Arch with awesome views of Hyde Park.<p>You will be the first dedicated developer to join the business, reporting directly to me who has been the sole developer to date.  Due to the small nature of the team I really need someone self-motivated who is keen to take on new challenges and is happy to just get stuff done to help us drive our business forward.  This is not a heavily structured development team environment and you need to be comfortable with that.<p>You need to be just as happy working with relational databases, querying them and also hand coding the standards compliant HTML &#x2F; CSS to sit on top of them.  Typical projects involve PHP, MySQL, HTML, CSS, JQuery.  Experience of CakePHP would be brilliant, as would any C# experience but neither of these are deal breakers.  Source control is GIT and the rest of your tools are broadly up you.<p>As well as our internal systems, we also provide outsourced web development services to 3rd parties so you will get to work on a diverse range of projects.  Our core business is in the process of going through a rapid period of expansion and to support that we are starting to create a more formal dev team and you will be a pivotal part of that both in terms of how we operate day to day and who we hire as and when we need to grow.<p>M7 Real Estate is a company of 30 people, led by a partnership of 11.  Most of the partnership has worked together over 3 different businesses over the course of the last 15 years.  We are a close team that finds the right people and then hangs on to them.  We are in the process of opening offices in Glasgow, Amsterdam and Denmark and Germany is forecast for later in the year.  If this is of interest and you want to find out more about who we are and what we do, then drop me an email oli.farago@m7re.co.uk","time":1372688390,"type":"comment"}