{"by":"gabeh","id":5970744,"parent":5970187,"text":"WellTok, based in downtown Denver, is hiring experienced full stack Ruby on Rails engineers to work on a real problem that will require innovation: fix healthcare.  You will have the opportunity to directly affect many peoples’ lives in positive ways.  Welltok’s pioneering Social Health Management solution CaféWell makes it fun and more rewarding to get and stay healthy through incentives; social networking; advice from experts, peers and veteran professional athletes; fun health challenges with family members and co-workers; and reliable health and fitness information.<p>We are a well-funded, rapidly growing, early stage company still building out the core-engineering group in which you will have a real impact.  We are not looking for someone who just follows orders and writes code, we want someone who is passionate about collaboration and influencing features in our products.  We believe our small cross-functional teams working in short iterations with direct involvement with the business are major ingredients to our proven value.<p>You are able to design and build solutions at multiple levels of the technology stack.  You will be supported by a strong engineering team that will push you to become better at your craft.<p>Qualifications<p>• You are proficient working with Ruby on Rails; we’re currently on 3.2.x and we like CoffeeScript and Haml.<p>• You are passionate about testing your code, not only to catch bugs but as a process that produces better design; we like rspec.<p>• Proven experience developing web-based applications which are used by real people right now.<p>• You have a solid understanding of Computer Science fundamentals and distributed, scalable systems.<p>• You know the operating systems (*nix) you use to develop and run your code on intimately.<p>• You are able to identify and solve problems related to the development and production operating systems your code runs on; we use AWS for most of our infrastructure needs.<p>• You are personable and enjoy working and socializing with colleagues.  You work well in a team and enhance the performance of other engineers by sharing and educating them on the areas you have the greatest expertise in.<p>Benefits<p>We respect you more than to try to lure you in with promises of MacBooks, snacks, or any of that junk (don’t worry you will get a MacBook and snacks).  We will pay you what you could get elsewhere and then make joining us an easy decision with a generous, well-defined bonus program.  On top of this we offer the kinds of benefits that help us hire and keep the best people, like: Health&#x2F;Dental&#x2F;Vision Insurance, 401k, etc.<p>Interested?<p>Introduce yourself (resume, websites, github profile, etc.) to gabe.hesse@welltok.com. If we’re interested you’ll hear back from us within 48 hours.","time":1372688089,"type":"comment"}