{"by":"greghinch","id":5971068,"parent":5970187,"text":"We Are Pop Up - London, UK - Web Application Developer (full-time)<p>We Are Pop Up is a community-driven marketplace for short-term commercial property leasing. While we certainly didn&#x27;t invent the concept of a &quot;pop up shop&quot;, we&#x27;re embracing it whole-heartedly as a solution to two social problems which have arisen in our  time: 1) How can we lower the barrier-to-entry to enable a new generation of retail, food, and creative entrepreneurs to operate as easily in the offline world as businesses currently do online? 2) As commerce increasingly moves online, vacant property is left behind, which can have detrimental effects on both the nearby businesses and the greater community alike. How can we find new ways of filling that space? The missing piece which transforms these two real problems into mutual solutions is an excellent software platform that removes the time and overhead typically associated with commercial leasing. We Are Pop Up officially launched this platform near the end of 2012, and has already given numerous creative entrepreneurs around the UK opportunities to engage the offline world in ways they never had before.<p>We&#x27;re looking for an experienced Web Application Developer to work directly along side our Lead Developer and Creative Director, building features and scaling the platform. Someone who&#x27;s comfortable working with the whole stack, understands the principles of excellent software development, and wants to treat their code as their craft. We&#x27;re primarily in a Django&#x2F;Python environment, but any relevant experience is great, as long as you are willing to learn Python. The number of years you&#x27;ve been working professionally isn&#x27;t too important (though it should be at least &quot;a few&quot;), but what you&#x27;ve done is. Being an expert in SQL will get you a lot of points. We follow Agile development practices, and you&#x27;ll be shipping features frequently.<p>--<p>Skills and Attributes We&#x27;re Looking For (being 100% in all is not required, but candidates who are will receive preference)<p>* Experience building web applications from the bottom, up. Django&#x2F;Python experience preferred, but Rails&#x2F;Ruby, PHP, etc. is also great, so long as you&#x27;re a quick and willing learner<p>* Solid knowledge of SQL and related best practices. We use Postgres, but are happy with MySQL or similar experience<p>* Ability to work in Javascript&#x2F;HTML&#x2F;CSS. We use YUI 3 and Bootstrap. You certainly don&#x27;t need to be a designer, but you should be able to take on a feature and fully implement it, including all relevant front-end code<p>* General understanding of Solr&#x2F;Lucene search<p>* Experience deploying basic server infrastructure and with the Unix command line (being an expert SysAdmin is not required)<p>* Familiarity with code profiling and optimization<p>* Interested in things like Agile development, TDD, and pair-programming<p>* Work equally well in close coordination with others and independently&#x2F;self-directed. We&#x27;re a small team, so we&#x27;ll always be working closely, sometimes in pairs, but often you&#x27;ll need to be able to take on things on your own<p>* Legally eligible to work in the UK (mandatory)<p>What We&#x27;re Offering<p>* Competitive salary, based on experience<p>* Meaningful, early-employee equity<p>* Regularly attend some of the coolest pop-up events and parties in London<p>* Work on a developer-driven software team, where your contributions will have a hugely positive impact on the lives of others<p>More About Us<p>We&#x27;re a group of Brits and Americans who came together in the spring of 2012 to take on an ambitious idea cooked up by 2 of our co-founders in a pub one evening (where all good ideas start). We&#x27;re artists and environmentalists, consultants and entrepreneurs, engineers and educators. Collectively we&#x27;ve worked with Fortune 500s, government and the public sector, universities, creatives, small businesses, and (other) start-ups. We&#x27;re alumni of Springboard Mobile in the fall of 2012 and we&#x27;re looking to change the world.<p>Principals only, no recruiters<p>Please submit your CV, a paragraph summarizing your relevant experience, and links to your work on Github, Bitbucket, etc. to jobs[at]wearepopup.com, with the subject &quot;Hacker News candidate for your Web Application Developer role&quot;<p>We look forward to hearing from you!","time":1372690719,"type":"comment"}