{"by":"greyhat","id":5971175,"parent":5970187,"text":"San Mateo (San Francisco Bay Area), California<p>Coupa Software - Procurement and Spend Management for business, in the cloud.<p>Looking for...<p><pre><code>    - Ruby on Rails developers \n    - iOS developers\n    - integrations engineer (connecting enterprise financial systems)\n    - UX &amp; visual designers\n</code></pre>\nOur product is built on Rails, and helps businesses save money, and helps all of their people who do purchasing and expenses to have much more efficient and enjoyable jobs. Our customers love our product, because we work extremely hard on to improve and protect the user experience, design, and overall coherence of the product.<p>Current goals and challenges include building new features, improving our automated testing, and maintaining a solid foundation for the product. Your workload in a given month might include bugs, a feature or three to build by yourself or with a few others, improving our technology stack, or implementing your own ideas to improve the product. We like people who are full stack, and like learning about all areas of the product.<p>I am a full-stack dev, so I do everything from tuning database queries to Rails to JavaScript to visual design on my features, its pretty damn rewarding and interesting.<p>Working on the product development team is pretty great. I enjoy working and spending time with everyone on the team, and we have smart people from lots of different backgrounds and locations. We have a neat office space in downtown San Mateo that is open and perfect for a team of programmers (we keep the noise down when we&#x27;re working). We are two blocks from the San Mateo CalTrain station, we have plenty of room for bikes, and free parking passes if you want to drive.<p>We have had remote developers for a long time, across the country and world. We also allow for working from home as needed for local people (or wherever else you are productive), and we strongly encourage people to go home and rest if they look tired or don&#x27;t feel well.<p>We offer good pay, great health &#x2F; dental &#x2F; vision insurance, unlimited vacation, extremely flexible hours (pretty much be in by 11am if you are local). We have &quot;field trip&quot; lunches on Wednesdays to get the team together and relax, and other days we might walk to the park or somewhere downtown for lunch.<p>Please email a quick intro and your resume, website, or github to * brianfarr@gmail.com * if you are interested or have any questions.<p>If you seem like a good possibility, your resume will be seen by my manager and the team early this week. If not, I will try my best to point you to someplace you are a good fit, or connect you with recruiters I know. Also, if you are new or looking to move to the SF Bay Area and want to talk to someone who did it last year, from the midwest, send me an email too.<p>(P.S. - We have already hired one Rails engineer from an HN Who&#x27;s Hiring post).","time":1372691738,"type":"comment"}