{"by":"TLCooksey","dead":true,"id":5971209,"parent":5970187,"text":"Badgeville- Senior Operations Engineer- Redwood City, CA\nApply at: engjobs@badgeville.com<p>Badgeville, Inc., is looking for a Senior Operations Engineer Are you the one?<p>We build the leading SaaS platform for gamifying and measuring behavior across the web, mobile, and applications, serving tens of millions of requests per day. We are looking for bright, resourceful engineers with in-depth Linux Sys Admin experience and good working knowledge of Open Source Technologies such as Puppet, Chef, MongoDB, MySQL, Redis, Apache, Keepalived, Memcached etc.… and have mind-set to maintain, manage and monitor a virtualized cloud infrastructure in the cloud.  An ideal candidate would be a self-starter, always learning and have following skills.<p>Why would you want to be our Senior Operations Engineer?<p>We sit right at the spot where websites, mobile apps &amp; enterprise SaaS smack full-speed into big data analytics. Gamification is the big idea of 2013 and it’s only getting bigger. At Badgeville, you’ll be surrounded by the speed and flexibility of a start-up team while working to support some of the world’s biggest companies. Do you love brand-new offices featuring overstocked kitchens, games &amp; outings, bike &amp; jogging paths, unbeatable views and ridiculous gyms with climbing walls? Sure — we’ve got all of those. But you want all of that while you get to work with the latest systems in one of the hottest emerging markets around. You want to be in a position where the way you lead your team determines how the company performs every day. That’s why you want to be at Badgeville.<p>Requirements and Skills:<p>A minimum of 5 years hands-on Linux &amp; package management experience\nSolid understanding of Internet working and security fundamentals\nExtensive experience with automation tools – Puppet &amp; Chef\nGood understanding of underlying protocols &amp; web interfaces – TCP&#x2F;IP, JSON, REST, HTTP(S)\nConfortable with Linux shell scripting – Bash, Perl, Python\nStrong Systems Knowledge – storage subsystems, performance tuning\nAbility to quickly solve problems and automate routine tasks\nGood working knowledge of DB Systems (MongoDB, MySQL)\nExcellent written and verbal communication skills (ability to explain a problem&#x2F;issue)\nExcellent team player and comfortable interacting with developers\nPreferred Knowledge and Skills:<p>Good networking knowledge – multilayer load balancing, BGP, network traffic analysis, firewalls, routers, switches\nExperience in an Enterprise level Network Operations Center a plus\nBenefits&#x2F;Perks<p>Competitive Salary\nStock Options\nFull medical, dental &amp; vision benefits\nBrand-new office space bursting with tasty treats, games, and jogging&#x2F;bike paths\nFully paid gym membership (for code-crushing forearms)\nCompany-provided CalTrain pass\nLots of fun team events &amp; outings\n About Badgeville<p>Badgeville, the Behavior Platform, makes it easy for business leaders, marketers and innovative technologists to use smart gamification techniques to increase user loyalty and engagement across eCommerce, Media &amp; Entertainment, Health, Education, Services and Enterprise web &amp; mobile experiences. Using Badgeville, brands can reward users with real-time achievements and reputation, while at the same time driving user behavior, achieving specific business goals, and measuring and optimizing user engagement. Badgeville customers include Samsung, CA Technologies, X.Commerce, NBC, Bluefly, Interscope Records, Deloitte Digital, and The Active Network. Founded in 2010, Badgeville is based in Redwood City, CA, with offices in New York and Europe.","time":1372692056,"type":"comment"}