{"by":"lancenl","id":5971708,"parent":5970187,"text":"GlobalSign - Portsmouth, NH - Full Time Technical Support<p>Who we are:\nGlobalSign was formed in 1996 as one of the Internet’s original trust service providers (you probably know us as a Certificate Authority). Over the years we have issued millions of digital certificates that have been used to secure commerce and communication on the Internet. Our solutions take the pain out of using cryptography and help organizations solve complex problems with increased productivity and peace of mind.<p>What we are doing:\nHow trust is bootstrapped on the internet hasn&#x27;t changed much since 1996 -- we are fixing that!<p>We&#x27;re looking for someone fitting these characteristics:\n•\tFanatical about customer service &amp; love working directly with customers and end users.\n•\tTech Geek and troubleshooting expert. Your friends and family always call you with their computer issues.\n•\tYou have a voracious appetite for learning and teaching technology.  (Bonus points for any completed Coursera, Udacity, edX, or other self-directed learning courses)\n•\tVersed in both corporate IT environments as well as modern web technologies.  (Serious bonus points for REST API experience!)\n•\tYou enjoy working to bridge gaps between business requirements and technical capabilities.\n•\tExcellent communicator – you’re known for your high degree of empathy and listening skills, but also to your ability to explain complicated concepts and ideas to a wide audience in both written and spoken methods. \n•\tYou have suburb organization and time-management skills.  Your inbox is a hallmark of productivity.\n•\tDesign minded – you think about why processes, interfaces, products and systems are designed the way they are and you’re constantly thinking about ways they could be better.\n•\tYou can operate successfully without explicit direction on required tasks to achieve general objectives.  You’re able to view the organizations&#x27; goals in context and tailor your efforts and direction appropriately.<p>Please email jobs@globalsign.com for more details.","time":1372696374,"type":"comment"}