{"by":"SatvikBeri","id":5971323,"parent":5970187,"text":"Lattice Engines - Boston MA - QA Engineer\nwww.lattice-engines.com<p>Work as part of a team of world class engineers to develop QA tests and automation for the implementation of our SaaS based enterprise &#x27;Big Data&#x27; predictive analytics engine. You will be an instrumental member of one of our agile&#x2F;SCRUM teams designing and developing our core technology. You will join a fast growing team driven by excellence in quality.  You will work with the latest test and QA automation technology and help to define the processes and standards by which QA operates.  Excellent teamwork, collaboration and ability to work in a fast passed environment are required.<p>Responsibilities<p>•\tDevelop reusable test designs and test cases within an agile model\n•\tFocus is on automation, but some manual test planning work is required\n•\tParticipate in the agile&#x2F;SCRUM process and collaborate with development and production team throughout all stages of the SDLC\n•\tProduce and maintain useful and usable documentation of work, and contribute regularly to the general Engineering body of knowledge\n•\tExecute deep-dive QA forensics - providing extensive issue analysis &amp; decomposition\n•\tDefine and refine solutions to big-data technical challenges\n•\tIdentify test priorities across an n-tier technology stack<p>Qualifications<p>•\tBachelor’s Degree or an equivalent combination of education and work experience\n•\tHands-on expertise with automation frameworks (e.g. STAF, Jenkins, etc.) and test scripting tools (Selenium, Junit&#x2F;Nunit, Watin, SOAPUI, etc.)\n•\t2 to 4 years’ experience as a Software QA Engineer testing multi-tier web applications, ETL experience a bonus\n•\tStrong knowledge of SQL and relational databases required\n•\tExperience with testing SaaS based solution considered favorably.\n•\tExperience with using one or more automation tools such as QTP or Selenium\n•\tUnderstanding of software engineering skills and QA&#x2F;Test and automation methodologies\n•\tPassionate about QA and keeping current with industry trends and best practices\n•\tExcellent written and verbal communication skills<p>About Lattice Engines\nLattice is revolutionizing sales and marketing through the power of Big Data. Our Big Data for Sales platform, salesPRISM, delivers real-time, predictive and actionable insight to sales and marketing professionals wherever they are so they can engage the most receptive customers in the most compelling ways. Fortune 500 companies such as ADP, Dell, EMC and SunTrust rely on Lattice to generate 75 percent more pipeline, triple conversion rates, and double win rates. Lattice is privately held and backed by NEA and Sequoia Capital with headquarters in San Mateo, CA.","time":1372693083,"type":"comment"}