{"by":"thecodemonkey","id":5971590,"parent":5970187,"text":"Washington D.C., Full Time Front-End Developer<p>Engage is an interactive agency that provides technology and strategy to Fortune 500 companies, political organizations, and nonprofits, and we&#x27;re looking for a Front-End Developer to join our bullpen of developers. All of our development and creative work is produced in-house, so you’ll be working directly with our team of designers and developers.<p>This is a full-time position and you must be able to work on-site in Washington, DC. This is an immediate opening, but we&#x27;re willing to let people who live in other parts of the country temporarily work remotely until they can relocate.<p>We prioritize proven work, so please make sure to submit work samples with your application (links to live projects preferred). You&#x27;ll probably need at least 2 years full-time experience in a front-end development role to meet the qualificaitons below, but we&#x27;re not opposed to hiring a prodigy.<p>Must-haves:<p><pre><code>  * Strong experience with CSS3, HTML5 and JavaScript and able produce clean,\n standards-compliant markup\n  * Experience with several (ideally all) of the following: jQuery, Backbone,\n Underscore, RequireJS, Twitter Bootstrap,\n Media queries&#x2F;Responsive design, Cross-browser compatibility, testing &amp; support\n  * Not a designer but good design instincts -- strong UI &amp; UX skills\n  * Understands and pursues pixel perfection for every site &amp; project\n  * Skilled with Photoshop &amp; the Adobe Creative Suite\n  * Comfortable with version control - Git preferred\n  * Experience with Vagrant\n  * Comfortable working on tight deadlines and in a team environment\n  * In general, a nice person to be around who enjoys tackling challenges\n and learning new skills\n</code></pre>\nBonus points if you:<p><pre><code>  * Have experience with Facebook Connect, Twitter Login, OAuth, etc\n  * We occasionally use open source and third-party CMS, so some experience with\n WordPress, Expression Engine, and&#x2F;or Drupal is helpful\n  * Have a basic understanding of PHP or MySQL (but your primary\n experience&#x2F;interests should be in front end work, not back end)\n</code></pre>\nPerks:<p><pre><code>  * Small team -- tons of opportunity to work on projects for high-profile clients,\n add to your skillset &amp; advance within the company\n  * Competitive salaries\n  * Annual performance bonuses\n  * Generous benefits package\n  * Team outings (last time we played tourist in DC and rode around on Segways)\n  * Free snacks\n  * Free energy drinks -- these days it&#x27;s Lo-Carb Monster but won&#x27;t hate if you&#x27;re\n a Red Bull person\n  * Paid hackathon and conference attendances\n  * Dog-friendly office\n  * Located on a cool street with tons of bars and restaurants\n  * Very close to 395 &amp; the Metro (Blue and Orange lines)\n</code></pre>\nTo apply, please include your resume, work samples, link to your GitHub profile, and a brief description of why you’re interested in the position. Apply here: <a href=\"http://engagedc.theresumator.com/apply/VzN338/Front-End-Web-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;engagedc.theresumator.com&#x2F;apply&#x2F;VzN338&#x2F;Front-End-Web-...</a>","time":1372695354,"type":"comment"}