{"by":"flyscripter","id":5971029,"parent":5970187,"text":"Riverbed Technology, Cambridge, MA, Full-Time<p>Python&#x2F;JS Guru<p>DevOps style developers needed to join a small but growing team at Riverbed Technology that is building out a new open source SDK and applications for customized visibility and control of the network infrastructure (see <a href=\"http://github.com/riverbed\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;riverbed</a>). This is your chance jump in and put your years of experience to work setting the direction of this new initiative of programmable infrastructure.<p>The strong candidate...\n- Reads Hacker News before breakfast\n- Tries out new packages just because they sound cool\n- Enjoys the challenge of balancing &quot;elegant&quot; and &quot;functional&quot;\n- Relates to fellow coding experts as easily as junior engineers\n- Wishes there were more hours in the day just to code\n- Understands that technical compromise can be a good thing\n- Always wants to see the bigger picture<p>You will have the opportunity to work at multiple levels, from low-level REST APIs in Python to single page applications in JavaScript, from data analysis modules to new visualizations. This open source project will demand strong skills in API development, modularization, clean code, testing and documentation. You will be faced with the challenges of creating complex new features with a simple and usable interface that the non-coder can use and the advanced developer can extend.<p>This will be a fast paced environment looking to leverage new open source packages and methodologies, picking the right tool and the right library that can be leveraged by our customers.<p>Nuts and bolts required:\n- Years of hands on development experience\n- Strong programming and debugging skills in Python\n- Strong understanding of OO principles\n- Some experience with JavaScript\n- At home in a Linux development environment\n- Comfortable turning technical requirements into a functional specification\n- Some network background - at least an understanding of basic network concepts<p>Bonus points:\n- Strong design and architecture experience\n- Experience with JavaScript &#x2F; UI Frameworks such as extjs, d3, node.js, bootstrap\n- Automation experience - unit testing, Puppet, Chef, Jenkins\n- Strong networking background\n- Exposure to cloud services<p>Riverbed Technology, Inc.&#x27;s Cascade office is located in Cambridge, MA. Riverbed offers excellent salary, options and benefits. We are proud to be an EEO&#x2F;AA employer M&#x2F;F&#x2F;D&#x2F;V<p><a href=\"http://riverbed.force.com/careers/ts2__JobDetails?jobId=a0xi0000000Rz0sAAC&amp;tSource=\" rel=\"nofollow\">http:&#x2F;&#x2F;riverbed.force.com&#x2F;careers&#x2F;ts2__JobDetails?jobId=a0xi...</a>","time":1372690391,"type":"comment"}