{"by":"ParivedaFin","id":5971838,"kids":[5977660],"parent":5970187,"text":"Pariveda Solutions - Application Developers (web&#x2F;mobile, java, .net, c#, sharepoint, BI, iOS, android) - full time&#x2F;perm only - sorry no sponsorship provided; Atlanta, Chicago, Dallas, DC, Houston, Los Angeles, New York City, San Francisco, Seattle<p>We’re looking for exceptionally smart software developers and consultants of all levels. We write software on all scales working with small businesses to fortune 500 companies focused on a variety of software projects.\nPariveda Solutions is an ESOP-based IT Consulting firm currently hiring for all our offices in CA, GA, IL, NY, TX, VA and WA.\nHere’s what we DON’T do:\n•\tIT related software job-placements\n•\tAugmented staff\n•\tLife-long specialist work\nHere’s what we DO do:\n•\tWork directly with clients\n•\tSmall team project software that WE pitch to the clients\n•\tConstantly learn\n•\tProvide abstract solutions to hard problems\n•\tBuild in a variety of languages…\no\tJava (you bet)\no\tC# (you better believe it)\no\tC&#x2F;C++ (sometimes, yeah!)\no\tWeb languages (of course)\n•\tPerform all roles in software (we develop, we test, we pm, we architect, we sell)\n•\tEngage in all steps of the SDLC\n•\t…and much more<p>Here’s some general information about us:\nPariveda Solutions is an award winning software development and management consulting firm. Our goal is to be the #1 privately held IT consulting firm in the world and our future looks bright. This is truly a great place to work – focused on career development and filled with smart, passionate people who care about the work they do.<p>7 Reasons You Should Consider Pariveda Solutions\n•\tFull time, salaried position with strong base compensation, and profit sharing\n•\tAward winning company (Consulting Magazine’s “Small Jewels” list, Employer of Excellence, Best Places to Work, INC 500&#x2F;5000 Fastest Growing Company list)\n•\tEmployee ownership in company (privately held company with Employee Stock Ownership Plan - at all levels)\n•\tClear career path (project reviews, semi-annual reviews for promotion)\n•\tExcellent benefits (company paid premiums for healthcare&#x2F;dental, medical concierge service, 2% 401K matching day one, paid sabbatical for principals and above at 5 years of service)\n•\tSmall teams structure leads to accelerated skills growth\n•\tContinual internal knowledge sharing and training<p>Interested? Email liz.dinzeo@parivedasolutions.com. Principals only, no recruiters or third party inquiries please.","time":1372697234,"type":"comment"}