{"by":"ryguytilidie","id":5972906,"parent":5970187,"text":"San Francisco, CA. Full time.<p>Academia.edu is a social platform for academics to share research papers. The company&#x27;s mission is to accelerate the world&#x27;s research.<p>Many people believe that science is too closed, and too slow. We are trying to change that. There are 4 things we are trying to achieve with Academia.edu - ways in which we are trying to re-shape and accelerate science:<p>- Instant distribution. Right now there is a 12 month time-lag between submitting a paper to a journal, and the paper being published. We need to remove that time-lag and introduce instant distribution of scientific ideas.<p>- Better peer review. Right now the peer review process takes 12 months to complete, and only surfaces the opinions of two academics - academics who may be biased, uninformed about the subject area, or just in a bad mood when writing the review. 2 people is too small a sample size. We need a faster and more robust peer review system, one that surfaces the opinions of the entire scientific community, across a variety of dimensions, and in real-time.<p>- Multi-media. Right now, scientists only share papers in PDF form. We need to bring about a science where scientists are incentivized to share data-sets, code, videos, blog posts, and comments on all these media. Right now 50% or more of the world’s scientific output does not get shared, because the system of credibility metrics only rewards one kind of format, the paper. We need to change this.<p>- Open access. We need to bring about a world where a villager in India has the same access to the world’s scientific output as a professor in Harvard. When you open up access to the world’s scientific literature to the 2.5 billion people who are online right now, magical things can happen.\nIt&#x27;s an exciting time for science. Science is transitioning from a 17th century way of sharing ideas, based on the journal system, to a faster system of sharing ideas on the web. Science is a foundational part of global growth: almost every innovation in medicine and technology has its roots in a science paper.<p>We need talented and passionate engineers to help us accelerate science. We have made a good start: 2.9 million academics have joined Academia.edu, and 13,000 join each day. We&#x27;re a 12 person, engineering-driven, team based in downtown San Francisco. Technologies we use include Rails, PostgreSQL, Redis, Varnish, Solr, Memcached, and Mongodb. We have raised $6.7 million from Spark Capital, True Ventures, Mark Shuttleworth (founder of Ubuntu), and others.\nFamiliarity with our technologies is a plus, but it&#x27;s not essential. It&#x27;s far more important that you are a quick learner who can pick up new technologies quickly. We are looking to hire a range of positions:\n* full stack engineers * growth engineer (optimizing our growth and retention channels)\nThere is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>. There is more on TechCrunch about our mission here <a href=\"http://techcrunch.com/2012/02/05/the-future-of-peer-review/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2012&#x2F;02&#x2F;05&#x2F;the-future-of-peer-review&#x2F;</a> (The Future of Peer Review) and here <a href=\"http://techcrunch.com/2012/04/29/the-future-of-science/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2012&#x2F;04&#x2F;29&#x2F;the-future-of-science&#x2F;</a> (The Future of Science)<p>We want to hire world class engineers. We want you to join us in building the future of science whether you are based in San Francisco, New York, Delhi, or Beijing. We will handle re-location, including visas, though unfortunately we are not currently hiring remote employees.<p>If you are interested to learn more, please email Ryan Jordan at ryanj [at] academia.edu","time":1372705906,"type":"comment"}