{"by":"khinrichs","id":5972239,"parent":5970187,"text":"Mobile Application Developer -- iOS and&#x2F;or Android\nFull-time Position<p>BrickSimple LLC (<a href=\"http://bricksimple.com\" rel=\"nofollow\">http:&#x2F;&#x2F;bricksimple.com</a>) is a leading developer of next generation web, mobile,\nand wearable computing applications. Our talented creative team develops custom solutions and\nproducts that leverage current mobile&#x2F;tablet computing and powerful emerging technologies.<p>If you&#x27;re an Android, iOS, and&#x2F;or HTML5 developer that wants to build some awesome stuff, BrickSimple is a great place to do it.<p>Core Tech Skills:<p>o Android, iOS, and&#x2F;or HTML5\no Java and&#x2F;or Objective C\no SQL, Databases, Storage\no Web service experience (JSON&#x2F;REST)\no Responsive web design is a plus\no SCORE MULTIPLIERS: OpenGL, AR, Glass Mirror API, Custom Kernels<p>Other Requirements:<p>o Excellent Communication skills\no Self-directed learner - ability to pick up new technology&#x2F;frameworks&#x2F;skill sets&#x2F;etc\no Ability to work individually or as part of a tight talented team\no 3 years+ development experience\no 1 year+ mobile development<p>Our main office is located in the heart of downtown Doylestown, PA. Public transportation\n(SEPTA bus and regional rail) is available. Our employees can walk out the front door to more\nthan two dozen dining options.<p>As a company that&#x27;s been around for more than a decade, we offer a competitive salary and\nexcellent benefits (heath, dental, 401k). If you&#x27;re tired of the cube life or being a consulting lone\nranger, give us a shout. BrickSimple is committed to innovation and its a great opportunity to work\nwith a talented team.<p>Corporate Culture:<p>o Open bullpen office model\no Tech Lunch discussions of new technologies\no Corporate Movie Outings, LAN Gaming events\no Conference participation including WWDC, Google I&#x2F;O, GDC\no Technical executive team that still writes code<p>Compensation:<p>o Salary is commensurate with experience and competitive\no Healthcare, Dental, Life&#x2F;Disability, 401k<p>If you&#x27;re interested, please send your resume along with why you think you&#x27;d be a good fit to jobs@bricksimple.com","time":1372700135,"type":"comment"}