{"by":"hurdleress","id":5972583,"parent":5970187,"text":"Counsyl<p>South San Francisco, CA with various positions in the field (<a href=\"http://jobs.counsyl.com\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.counsyl.com</a>)<p>Our goal is to make the human genome practically useful for life-altering decisions.<p>We&#x27;ve invented the Counsyl Test, a breakthrough diagnostic intended for parents planning to start a family. The test won the Wall Street Journal Innovation Award for Medicine, was named one of Scientific American&#x27;s &quot;Top 10 World Changing Ideas,&quot; and was featured in the New York Times. Our test is now prescribed by physicians for more than 2.5% of all births in the United States.<p>Recent TechCrunch article: <a href=\"http://techcrunch.com/2013/04/23/counsyl\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;04&#x2F;23&#x2F;counsyl</a><p>Upcoming Tech Talk on 7&#x2F;18: <a href=\"http://genomicsbigdata.eventbrite.com\" rel=\"nofollow\">http:&#x2F;&#x2F;genomicsbigdata.eventbrite.com</a><p>We&#x27;re looking for people who are excited about solving the practical last mile problems needed to actually achieve a return on our society&#x27;s multibillion dollar investment in the Human Genome Project.<p><i>Hiring for Software Engineers</i> (<a href=\"https://www.counsyl.com/jobs/software-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;software-engineer&#x2F;</a>)<p>You should have a BS, MS, or PhD in Computer Science (or equivalent) and significant independent programming experience as demonstrated by Github account, personal web page, or prior employment.<p>You should also be a generalist, interested in rotating through the engineering team and working in one or more of these areas:<p>- Genomics: design, validate, and optimize clinical genomic assays for rare Mendelian variants<p>- Machine Learning and Data Science: extract meaning out of one of the largest clinical genomic datasets in the world<p>- Robotics: automate and scale our backend to do more clinical sequencing and genotyping than anyone has ever done before<p>- UI&#x2F;UX: design the first widely adopted user interface for the medical genome<p>- Clinical Integration: solve the wide variety of practical issues associated with translating genomics into a clinical context<p>- Infrastructure: build and deploy the hardware and software systems that support secure, large-scale computations on genomic datasets<p>From a skills perspective, you should have familiarity with several of the following technologies. We obviously don’t expect you to know everything on the list, but you should be nodding to yourself by the end of it.<p>- Python: Django, Numpy, Scipy, Cython<p>- HTML&#x2F;CSS&#x2F;JS: Coffeescript, Backbone.js, Twitter Bootstrap 2, HTML5, Chrome Web Inspector<p>- C++: STL, gcc&#x2F;g++, Boost, C++11<p>- Functional Programming: Haskell, underscore.js, functional reactive programming<p>- Data Science and Visualization: D3,GNU GSL, Netlib&#x2F;LAPACK, graphviz, R, Matlab, Matplotlib, Numerical Recipes<p>- DevOps&#x2F;System Administration: Amazon Web Services, Puppet, nginx, nagios, Apache, Fabric<p>- APIs: REST, JSON, SOA, and all that jazz<p>- Biological Databases: NCBI, UCSC, 1000 Genomes, Hapmap, UK10K<p>- Sequencing&#x2F;Computational Biology: NGS pipelines, GATK, FreeBayes, samtools&#x2F;pysam, bedtools&#x2F;pybedtools, SNPEff<p>- Unix&#x2F;Linux: bash&#x2F;zsh, emacs&#x2F;vim, git, GNU toolchain<p>- Databases: PostgreSQL, psycopg2, hstore, replication<p>Again, please consider these guidelines, not absolutes. For example, if you know Chef, we figure you can learn Puppet, and if you know Ruby, we figure you can learn Python.<p><i>What you&#x27;ll do</i><p>- Move fast without breaking things :)<p>- Start in the areas you&#x27;re familiar with, and grow to work on the full stack<p>- Work closely with a small, tight-knit team<p>- Develop algorithms and code for all aspects of clinical genomics, from machine learning to supply chain optimization to insurance billing<p>Apply Online: <a href=\"https://www.counsyl.com/jobs/software-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;software-engineer</a><p>We&#x27;re also hiring for:<p>* Automation Engineer(<a href=\"https://www.counsyl.com/jobs/automation-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;automation-engineer&#x2F;</a>)<p>* Clinical Account Executive (<a href=\"https://www.counsyl.com/jobs/clinical-account-executive/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;clinical-account-executive&#x2F;</a>)\nLocation: Syracuse (NY), Long Island (NY), Orange County (CA) and Los Angeles (CA)<p>* Billing Operations Manager (<a href=\"https://www.counsyl.com/jobs/billing-operations-manager/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;billing-operations-manager&#x2F;</a>)","time":1372702920,"type":"comment"}