{"by":"rohall","id":5972023,"parent":5970187,"text":"Cambridge, MA - Bluetrain Mobile - Senior Engineer\n<a href=\"http://www.bluetrainmobile.com/careers-senior-software-engineer\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bluetrainmobile.com&#x2F;careers-senior-software-engin...</a><p>About the Opportunity at Bluetrain Mobile\nBluetrain Mobile is a Cambridge-based cloud software company whose platform helps marketers build brilliant websites to engage customers and drive lead generation. Beginning with our mobile website platform offering and with any-screen solutions soon to follow, Bluetrain gives marketers at small and medium-sized enterprises a new level of power to deliver engaging online experiences on every device while maintaining creative control over their brands online.<p>Working at Bluetrain Mobile is an opportunity to join an entrepreneurial team with a proven track record of success and to be part of a company positioned for rapid growth. It is a place where we work hard, take initiative, and innovate. We are highly selective in our hiring process, seeking individuals with track records of demonstrated excellence in their professional and academic backgrounds. We look for smart people who are passionate about technology and the mobile web, who care deeply about their careers, and who want to work hard and have fun.<p>Description of Role\nAs a Senior Engineer at Bluetrain Mobile you will be directly involved in the development of the core platform. You will work as part of a team to plan, design, and develop functionality ranging from backend enhancements to user facing and device specific features. Your role will involve close collaboration with other Engineers and members of the Bluetrain team to share ideas, problems, and solutions.<p>Responsibilities\nDevelop new features and core components of the Bluetrain platform\nParticipate in architecture planning meetings and code reviews\nWork as part of an Agile team\nProduce well documented and tested code\nAttend and contribute to product meetings which further evolve the vision of the platform<p>Required Skills and Experience\nBachelor’s or Master’s degree in Computer Science with a minimum of 6-8 years of programming experience with 5 years in web-based technologies\nStrong background in Ruby on Rails, Javascript, HTML5, and CSS\nUnix system administration (experience with Amazon AWS is a plus)\nExperience with SaaS development is a plus\nExperience with Agile methodologies and Test Driven Development is a plus\nFamiliarity with version control (Git or SVN preferred)\nFamiliarity with software design methodologies<p>Non-technical Skills and Experience\nAbility to collaborate closely with other functional teams within the organization\nStrong analytical, writing, and presentation skills\nKeen design sense, experience working directly with designers\nExceptional relationship and communication skills\nWell-developed problem-solving ability, research, and critical thinking skills<p>Compensation\nCompetitive salary\nAttractive equity package<p>Benefits\nBenefits include health, dental, vision and 401k<p>Apply\nPlease send resume to: careers@bluetrainmobile.com","time":1372698630,"type":"comment"}