{"by":"capkutay","id":5973816,"kids":[5975434],"parent":5970187,"text":"WebAction (www.webaction.com) in Downtown Palo Alto - Full Time- Hiring Front End Developers and Platform Engineers<p>Jobs@WebAction.com\nWebAction is an enterprise infrastructure software company based in the San Francisco Bay Area, providing the first Real-Time Big Data Server; a platform that will enable the next generation of real-time, data driven applications. Founded by a team of Silicon Valley veterans with proven track records, WebAction is backed by some of the most respected names in Silicon Valley.<p>We offer a competitive salary, excellent benefits package, generous equity for the right candidates, and (of course) a kitchen stocked with snacks and drinks. If you want to join our cutting-edge team, grow as we do and share the excitement of an early start-up environment please apply today.<p>Job Description: You should be a self-starting web UI developer with a desire to lead and mentor others. You excel in a fast-paced agile environment and will be able to collaborate with back-end engineers to design interfaces and architect interaction models, and with the product team to wire-frame and prototype ideas.<p>Desired Skills &amp; Experience for Front-end Position:<p>-JavaScript knowledge necessary – please be prepared to show us examples of your work<p>-Experience with HTML5&#x2F;CSS3<p>-Experience with JavaScript frameworks (jQuery, Backbone, etc.)<p>-Experience or interest in learning visualization frameworks (d3, processing.js)<p>-Know how to build drag and drop web diagramming UIs (such as mxGraph, gliffy, drawio)<p>-Excellent communication skills, both written and oral<p>-Must be able to function well in an early stage startup environment<p>-Must be able to multi-task<p>Pluses:\n-Experience in user interaction design and user experience<p>-Knowledge of back-end web frameworks<p>-iOS or Android experience<p>For the Platform Engineering position, we ask that you have experience writing clean code in Java and have a strong desire and skills to implement a scalable, highly optimized data processing infrastructure.<p>If this sounds like you, shoot us an e-mail at jobs@WebAction.com.","time":1372715385,"type":"comment"}