{"by":"zmb","id":5974921,"parent":5970187,"text":"<i></i>Ambitious engineers wanted to solve privacy for consumers.<i></i><p>KeepSafe is a place for your personal things. 12 million people trust KeepSafe the mobile app to give them control over who sees what. We&#x27;re making it so you can pass your phone with photos around the Thanksgiving table and not have to worry about grandma swiping accidentally to your last raging houseparty.<p>Be the fourth team member and help us think through challenging privacy issues like how to let individuals privately sharing documents, photos, messages and retain distribution control over the data we might share to our friends on Facebook or Twitter?<p>We want everyone on our team to constantly be learning new things, building great technology, and helping build KeepSafe to be a great company.<p>Particular areas we need expertise in:\n<i>Security\n</i>Backend \n<i>iOS &amp; Android\n</i>Web\n<i>Data Science<p>Here’s why you should join us:<p></i><i>(1) Impact</i>* - At KeepSafe everything you do counts. When you join, you will get to see and impact every aspect of the business.<p><i></i>(2) Challenge<i></i> - KeepSafe shows how a small team can leverage software to serve millions of happy customers. We’re building on this one specific product to grow a universal solution for the fundamental privacy problem.<p><i></i>(3) Freedom<i></i> - KeepSafe is the most fun time we’ve ever had because we have the freedom to work in a way that suits us best. You are free to decide with what tools you use and equipment you need.<p><i></i>(4) Earlybird<i></i> - We boast millions of customers but our team is small. Now is a rare opportunity to join a startup with significant traction and still be early enough to come along for the full ride.<p><i></i>(5) Longboards &amp; Beer<i></i> - Before thinking about starting a company together, Philipp and Zouhair were already close friends over their mutual interest in beer. We make sure that our fridge is always stocked. When a friend left his board in our office, we discovered that starting skating at age 30 is not so hard and we fell in love with longboarding. When you join, a board will be waiting for you. Jamann!<p>Requirements:\nCode speaks stronger than degrees.\n- You have a strong understanding of computer science\n- You get excited about startups\n- You like learning\n- Programming experience in at least two languages<p>Bonus, not necessary:\n- You have experience in cryptography and security engineering\n- You have experience in building iOS apps that are in the App Store\n- You have experience in working with Android and Java\n- You know what it takes to scale a system to millions of users<p>We get extra excited to see:\n- Contribution or launch of an open source project\n- Mobile apps, web apps you have made\n- You build mobile apps that have good traction in the app store\n- Your hacker news and stackoverflow profile that shows deep and intelligent Q&amp;A<p>We offer:\n- Very competitive salary\n- Very competitive equity\n- Benefits (Medical, dental, vision)\n- Set up your workstation any way you want.\n- Ownership of a product that millions of people use<p>Contact: jobs@getkeepsafe.com","time":1372726281,"type":"comment"}