{"by":"ryanhalper","id":5974528,"parent":5970187,"text":"Seattle, WA - Gratafy - Fulltime&#x2F;Onsite - Hiring Backend&#x2F;Full-stack Devs<p>Gratafy is well-funded year-and-half old startup located in Seattle&#x27;s South Lake Union neighborhood that likes to have fun while also creating top-notch software and user experiences.<p>Gratafy is transforming the way people gift by making experience-based items from restaurants and other local merchants instantly available to send and redeem digitally in venue. We&#x27;re seeking talented engineers to help us expand our growing platform to people across the country. We value engineering a great deal and thrive on solving complex problems for the betterment of our product and our overall customer experience.  Gratafy is a highly collaborative, agile, and fast-paced environment – your contributions will be noticed and will make a difference.<p>What You’ll Work On\n•\tBack-end Architecture and server side application development to support consumer IOS, Android, Mobile-web, and Web apps under constant product iteration.\n•\tYou will enhance the system that powers Gratafy’s end-to-end gifting platform spanning consumer apps, merchant tools, and point-of-sale integration.\n•\tYou will work on our own API, and integrations with Facebook and other social networks’ APIs to build new valuable features for our customers.\n•\tYou will create solutions to make our system faster, more reliable, more flexible, and more scalable.\n•\tYou will work alongside our engineers, developers, designers, founders, and other employees in a collaborative format in order to learn and teach.\n•\tYou are smart with excellent critical thinking skills and you ship.<p>Skills\n•\tExpert LAMP stack developer.\n•\tExpert REST Web Services and API design\n•\tExperience with Facebook Connect, other API&#x27;s\n•\tSome exposure to cloud platforms\n•\tExposure to .NET environments.\n•\tHTML5, JavaScript&#x2F;JQuery\n•\tExposure to IOS and Android mobile development\n•\tGit<p>Please send resume and github info to work@gratafy.com. Candidates will be contacted to schedule an interview at the Gratafy offices. Competitive cash salary, equity, and benefits (medical insurance, vacation, office snacks&#x2F;drinks, choice of computer hardware&#x2F;setup).","time":1372722078,"type":"comment"}