{"by":"hurdleress","id":6035616,"parent":5970187,"text":"Hiring Software Engineers @ Counsyl, South San Francisco, CA<p><a href=\"https://www.counsyl.com/jobs/software-engineer/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.counsyl.com&#x2F;jobs&#x2F;software-engineer&#x2F;</a><p>Counsyl is a medical genomics startup with the goal of making the human genome practically useful for life-altering decisions. Over the last few years, we’ve grown from a Stanford dorm room to become one of the largest clinical genome centers in the world. Our pre-pregnancy genetic test is now prescribed by physicians for more than 2.5% of all births in the United States.<p>The cost of sequencing human genomes is plunging - over 5x faster than the cost of computing; the potential impact on preventive healthcare and the medical landscape is boundless. The science is there but the scale isn&#x27;t. That&#x27;s where Counsyl comes in. We are building the technology platform to make genomics useful and accessible to everyone.<p><i>Software is at the heart of Counsyl</i><p>The vast majority of our operations are powered by our own custom-built infrastructure on a Python&#x2F;Django&#x2F;Postgres stack, from ordering to lab processing to billing. We’re building new tools, new workflows, and new infrastructure to solve the challenging problems of a technology startup involved with not just bits, but also interconnected physical components like lab robotics and patient samples.<p>Don’t be intimidated if you don’t have a genomics background; solving these problems fundamentally requires software solutions. We’re looking for the best and brightest software engineers — strong generalists with solid CS fundamentals and practical software engineering intuition — to help us scale up genomics to billions of users.<p>Prerequisites:<p>- BS, MS or PhD in Computer Science or equivalent experience<p>- Strong software engineering fundamentals: design, testing, version control<p>- Significant independent programming experience as demonstrated by a GitHub account, personal web page, or prior experience.<p>- We like to see experience with:<p>* Python, Django, CoffeeScript, Backbone.js, Bootstrap, HTML5, CSS<p>* NumPy, SciPy, scikit-learn<p>* Relational database systems, such as PostgreSQL<p>* Unix, Git, and other command line tools<p>Perks:<p>-Competitive compensation and benefits<p>-Generous equity package in a fast-growing startup<p>-Catered meals every day plus a fully stocked kitchen<p>-On-site gym access to work it off<p>-Dry cleaning and laundry service","time":1373667477,"type":"comment"}