{"by":"redadehy","id":6037152,"parent":5970187,"text":"Entrepreneurial software engineer -- Augmedix -- Google Glass Healthcare IT startup -- San Francisco, CA<p>DESCRIPTION\nAre you a future-oriented, entrepreneurial engineer who wants to help change healthcare? We are currently looking for a self-motivated, experienced developer who can help us develop our core product on the Google Glass platform, and change the way doctors and patients interact with technology. Above all, we are looking for someone who can fill many hats as the product develops and the team grows. We are exploring uncharted territory, and if you enjoy the freedom and responsibility of designing and building systems from square one, your impact will be huge. You will drive product development and technology innovation in partnership with the CTO.<p>ABOUT THE COMPANY\nAugmedix is on the hottest startup in Silicon Valley and the first Google Glass startup -- ever! We’re creating a groundbreaking service for medical doctors that’s powered by Google Glass. The company is midway through raising a very successful seed round. You couldn’t pick a more exciting time to get involved.\nWe are headquartered in San Francisco and are part of Rock Health. We’re part of a vibrant community with some of the hottest digital health startups, and every day, venture capital, technology, and healthcare luminaries drop by and provide up-close mentorship.<p>KEY RESPONSIBILITIES\n- Design, develop, test, and deploy software for healthcare applications\n- Work with the CTO and other team members to understand requirements and define technical specifications and technology roadmap\n- Research and evaluate third-party software and hardware solutions\n- Also, you get to play with Google Glass before anyone else!<p>QUALIFICATIONS\n- B.S. in Computer Science or equivalent from a top tier school\n- Programming experience (2+ years) with Linux, Java, C&#x2F;C++, JS, HTML, and Python\n- Familiarity with both client-side and server-side JavaScript frameworks\n- Proficiency with Android development is highly desired\n- Understanding of TCP&#x2F;IP, UDP, and networking fundamentals\n- Knowledge of security protocols and video streaming standards is a plus\n- High levels of creativity, quick learning and problem solving capabilities<p>Send your resume to jobs@augmedix.com.","time":1373708804,"type":"comment"}