{"by":"benfwirtz","id":5472747,"kids":[5472920],"parent":5472746,"text":"Unifyo | Cambridge or London, UK | Full-time<p>Unifyo is the next generation relationship management tool. It’s clever technology is helping successful businesses to stay on top of their ever growing number of customer and contact relationships in a social world. Instead of company data being scattered across multiple applications and employees wasting time on searching for the right pieces of customer info, Unifyo provides instant access to unified customer profiles, without any complex setup or integration work. Less time spent on searching, more time spent on business.<p>We are adding two people to our team of 7:<p>1) Online Marketing / Growth hacking – responsible for user acquisition and overall growth. If you have great communication skills, you love to experiment with user acquisition techniques and you are into measuring what works and what doesn't, then we'd love to hear from you.<p>2) Sales / Customer Success – convert users to paying customers. The likes of Yammer and other \"free to sign up\" services didn't scale by simply cold-calling companies, but by making sure that people and companies which did sign up got the most out of their products, converted into paying customers and made sure every employee is using their products. Little cold-calling but lots of selling by making sure our users use Unifyo successfully - if that sounds like a plan to you, get in touch.<p>We’re a small, fun team, with an emphasis on enjoying our work and learning. We are a Seedcamp funded company (Europe's biggest startup accelerator), so you'll have access to a huge mentor network. Getting involved will be a great way to learn and gain loads of experience really really fast. We’ll also offer a competitive salary and stock options so you can share in the company’s success.<p>Contact me directly: ben@unifyo.com or check out <a href=\"https://unifyo.com/jobs\" rel=\"nofollow\">https://unifyo.com/jobs</a>","time":1364821355,"type":"comment"}