{"by":"derricki","id":5473907,"parent":5472746,"text":"Lucidchart - Salt Lake City, UT<p>Lucidchart is a rapidly growing tech startup looking for great product developers at all experience levels to join us at our headquarters in Utah. At Lucidchart, we build killer graphical web applications requiring highly available, secure and scalable backend services. You may have seen Lucidchart demoed during the second Google I/O 2012 keynote: <a href=\"http://t.co/sd6GgZvy\" rel=\"nofollow\">http://t.co/sd6GgZvy</a>. Talent and ability to learn are more important than years of experience.<p>We're hiring BACKEND SOFTWARE ENGINEERS of all levels. Lucidchart runs with various decoupled services in a Linux environment using Scala, PHP, MongoDB and MySQL. At Lucidchart your responsibilities would include enhancing existing services, building new services, integrating with 3rd party applications and ensuring services are highly reliable and scalable.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Scala or Java * PHP * MySQL or other relational database * NoSQL databases (MongoDB especially desirable) * Opscode Chef or Puppet * Cloud computing (AWS)<p>We're also hiring FRONTEND SOFTWARE ENGINEERS of all levels. We build killer graphical web applications that push the boundaries of what's possible in the browser. Lucidchart is powered by one of the largest Javascript codebases on the Internet, optimized so that the user experience is indistinguishable from an installed native application. Come help us show the tech world what can be done on the web.<p>Requirements: * Talent<p>Recommended experience: * Have built large products / applications * Javascript * Google Closure compiler/library * CSS/HTML/DOM manipulation * jQuery * node.js * Native app development on Android and/or iOS * Facebook APIs<p>We're also looking for a product manager to help us coordinate the vision of Lucidchart and our future products, develop relationships with key integration partners, and coordinate product input to make sure we deliver the highest value to our customers.<p>All applicants email resumes to jobs@lucidchart.com.","time":1364832491,"type":"comment"}