{"by":"ghn881","id":5473725,"parent":5472746,"text":"Hiring World Class Developer<p>Onsite in San Francisco or Remote<p>Email: devhiring@clearcareonline.com<p>Our company is looking for a world class Python/Django web developer to join our team.<p>Our opportunity is particularly exciting because our product has B2B, B2C and mobile modules. Moreover, almost everything we build today is a “first” in the world and benefits our users' lives in very real, tangible ways. We are venture backed by Voyager Capital, Harbor Pacific and Qualcomm Ventures which means we have the resources to deliver a best-in-world solution to our customers, we are growing very rapidly, and we are extending our widening our leadership gap relative to our competitors.<p>We have a small development team and intend to keep it that way by hiring really top talent that is capable of independently developing at all layers of the stack (Python/Django, Postgres, HTML, CSS, JavaScript, jQuery), and of independently producing new modules. We've found this enables us to move very quickly.<p>We have really strong UI talent that creates our front-end interfaces, and then you can take the UI work that is handed to you, make improvements, and make it real!<p>QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<p>EDUCATION and/or EXPERIENCE Bachelor’s degree or equivalent additional experience. At least 8 years of professional web development experience. At least 3 years of professional Django experience Experience at infrastructure layer and ideally AWS preferred but not required. Strong in all levels of the stack (Python/Django, Postgres, HTML, CSS, JavaScript, JQuery). Demonstrable professional success independently producing customer-facing modules. Comfort with and personal preference for agile development model.<p>Pays $130,000 - $160,000 / year based on experience","time":1364830895,"type":"comment"}