{"by":"x2Opteron","id":5473897,"parent":5472746,"text":"Kennett Square, PA :: \nChatham Financial :: recruiting _at_ chathamfinancial _dot_ com<p>Who do we want?<p>- We want to hire full-time people passionate about software development and testing; who care about building and maintaining top-notch infrastructure, services, and UIs.<p>- If you're not already well-versed with the tools we use, no worries! We hire people, not 'X years in Y language/technology'<p>What do we do?<p>- The domain happens to be the financial industry (namely mitigating Interest Rate and Foreign Exchange risk). It's a casual work environment, and we work with the advisory side of the business as our primary 'customers' (they are experts in the area of finance we serve).<p>- Check out <a href=\"http://www.chathamfinancial.com\" rel=\"nofollow\">http://www.chathamfinancial.com</a> for more info on the business side of things.<p>How do we do it?<p>- Web and service development: the language we typically use is C#, but we always seek to choose the right tool for the job.<p>- Testing: we have a large automated test suite in BPT, and are developing an in-house services testing framework in Ruby (which will likely be open sourced)<p>- Other languages/technologies that we utilize are: Rabbit MQ, Node.js, AWS<p>- We continuously integrate using TeamCity, focus on agile and lean developement practices (scrum), and deploy all of our software to production every 2 weeks. Check out <a href=\"http://intruthitsnotthatsimple.wordpress.com/\" rel=\"nofollow\">http://intruthitsnotthatsimple.wordpress.com/</a> for one of our Product Owner's perspectives on things<p>Other misc. info<p>- Every 3 months we have a Hack Week. It's a week to work on ideas that we wouldn't normally have time for in the 'daily grind'. These can be anything from trying out a new language or technology to refactoring existing stuff. You choose!<p>- Very family friendly<p>- Philosophy-driven, not policy-driven (let's get paid to work together and solve problems, and have fun all the while!)","time":1364832392,"type":"comment"}