{"by":"lstepnio","id":5473227,"parent":5472746,"text":"Tampa, Florida - Bright House Networks - Systems Engineer<p><a href=\"http://tinyurl.com/bnraug2\" rel=\"nofollow\">http://tinyurl.com/bnraug2</a><p>Systems Engineering and Operations team is responsible primarily for data center systems infrastructure design, deployment, operations, and continuous improvement supporting core customer and internal Bright House Networks services and applications.  The shared and stand-alone infrastructure runs on physical and virtual hardware, including servers, storage arrays, load balancers, firewalls, and switches.  The Systems Engineer is actively engaged throughout the infrastructure life cycle, from concept to ongoing support.  The position interacts with various Engineering, Development, Product, and Operations teams, to design the supporting systems, develop implementation strategies within new and existing environments enterprise-wide, provide and maintain design and ‘as built’ documentation, and implement ongoing service delivery enhancements.  Critical foundational services for customer network access and user experience are also supported. Responsibilities include operating system (O/S) administration, hypervisor management, storage administration, network administration, capacity and performance management, fault monitoring, remote access, security, database administration, and configuration management within the data center. This position requires strengths in the engineering and operation of service deployment in a diverse environment with multiple technologies.  The Systems Engineer must maintain a broad perspective and a strong awareness of new technologies and internal operations to support all aspects of network services, systems infrastructure, and application integration.  Virtualization, Linux systems expertise, UNIX and Windows experience, database administration (Oracle and MS-SQL), storage, and network knowledge is key to success in this position. This position reports to the SEO Manager and has no supervisory responsibilities.<p>TL/DR; We need us some awesome engineers. \nemail: luke @ my bright house . com","time":1364826826,"type":"comment"}