{"by":"jacobmorse","id":5474117,"parent":5472746,"text":"Dallas, Texas (Will consider REMOTE): Core Engineer, Cloud Application<p>At PureDiscovery (<a href=\"http://purediscovery.com\" rel=\"nofollow\">http://purediscovery.com</a>), our goal is to meaningfully connect the world. We're building the next generation of web and mobile applications on top of our groundbreaking (patented) Brainspace platform, and we're passionate about creating the best possible core technology and user experiences.<p>We are growing rapidly, and as we do there are plenty of opportunities for engineers to shine. We work in Ruby and Java, building complex systems with high scalability in the cloud. We're looking for an engineer to work on our core technology and service infrastructure. We are a young, fast-moving startup where everyone has a voice and cane make a difference, so you'll play a key role in steering our technical direction as we continue to scale (quickly!).<p>Some of our technical challenges include...<p><pre><code>    • Architecting and building our next generation of web services\n    • Scaling up our existing systems to handle growing traffic\n    • Identifying and and building key new features to meet the needs of a growing customer base\n</code></pre>\nResponsibilities:<p><pre><code>    • Participate in the planning, analysis, design, development and deployment of product features and enhancements\n    • Work as part of the development team to establish and apply the latest in engineering best practices\n    • Build high-performance, scalable applications and APIs\n</code></pre>\nYou...<p><pre><code>    • Have a desire to solve hard problems\n    • Think that real-time analytics at web scale is a fun challenge\n    • Want to work at a place where off-the-shelf solutions aren't good enough.\n    • Want to build something great\n    • Are willing to dig into Java, NLP, and machine learning. And aren't afraid of Scala, Clojure, or</code></pre>\nwhatever it takes to make great things work at web scale.<p>Bonus points for...<p><pre><code>    • Expertise in engineering world-class web applications\n    • Experience with the AWS toolkit (EC2, S3, Elastic Beanstalk, etc)\n    • Familiarity and experience with modern architectures such as ???\n    • Experience scaling from hundreds to thousands of users and beyond via load balancing, auto-</code></pre>\nscaling server deployment, HTTP accelerator caching, reverse proxies, failover, etc.\n    • Experience with worker queues and clustering.\n    • Strong understanding of high availability best practices in and out of the cloud\n    • oAuth experience\n    • Experience with Twitter and Facebook APIs\n    • Excellent typing ability in the presence of flying nerf darts and RC helicopters<p>You’ll help lead our core development side in our current, early stages through to first public release and post-launch scaling. You love to ship code, have a strong sense of ownership, and an entrepreneurial spirit.<p>We offer...<p><pre><code>    • A great company culture. We work hard and play hard!\n    • A challenging objective with great opportunity to technically accomplish things you never thought you could\n    • Competitive Salary, stock options and a 401k\n    • Generous vacation policy\n</code></pre>\nDo you want to come to work every day and creatively solve big market-driven problems? Our team is devoted to the continuing pursuit of technical excellence. We will challenge and support you to get the most out of your potential, and expect you to do the same for us.<p>If this sounds interesting, drop me a line: jacob@purediscovery.com","time":1364834136,"type":"comment"}