{"by":"mikerustici","id":5474282,"parent":5472746,"text":"Nashville, TN: Software Developer<p>An Open Letter<p>My name is Tim Martin. I own this company with one other person, Mike Rustici. We hire exceptional software developers.<p>You want to work here. If you’re a great software developer, you really want to work here.<p>We value life outside of the office. People who work here don’t work more than 40 hour weeks. Seriously, we don’t let them. We don’t have a vacation policy. If you are the kind of person for whom we have to count vacation days, you’re not the right person. Take care of your work, take time off and live your life. I have no idea how many days off any of our employees took last year. Because they get their work done and done well, I just don’t care.<p>You want to work here. I wear a t-shirt to work everyday. Mike wears a collar, but we make fun of him for it. I play ping pong every day because the title of “King of the Table” is important. I care about our Office Mom’s bird Ripley because she cares about it.<p>You want to work here, because you’re good. We often dole out projects with a 10 minute conversation and a month to make it go. Show us that you’re good, and we’ll trust you to decide how something should work and when you’re going to do it. If you are uncomfortable learning new things and working through stuff yourself, you probably don’t want to work here.<p>You want to work here, because we're good. Check out the our website to see that (scorm.com). We recently invented the Tin Can API which is spreading like wildfire and reinventing our industry (tincanapi.com).<p>We're a small company with big-time clients and potential to match (I'm posting particular job ad from the Googleplex). You've probably never heard of us and you've probably never worked with us, but the people who have hold us in the highest esteem. If you're going to apply, make sure you know what we do. We are at the very center of the e-learning industry and we're always evolving our products and creating new ones.<p>Skills &#38; Requirements<p>Mike and I are both former developers who didn’t like working for people who didn’t value our work. We won’t forget that. We also didn’t like working with people who couldn’t keep up.<p>We want depth of development skill, but particular languages are not crucial. Depth in Java or .NET would be a good place to start and experience with the LAMP stack or Python might come in handy. We’re not hung up on a particular amount of experience, but we are adamant about a particular level of skill.<p>In this particular role, excellent communictation and a desire to work with people will be important (yes, real live people...but at least they're other developers). We are looking for somebody who can help our clients integrate our products, but also get down and dirty in coding those products.<p>About Rustici Software<p>Rustici Software creates products that simplify conforming with e-learning standards like SCORM and AICC. We recently invented the next generation of these standards that an entire industry is rallying around. What does that mean? Read our website for the technical details. At a high level, we found a niche solving a deceptively complicated problem in a growing industry. We're the only company in the world that does what we do and we're beloved by the people in that industry. We're also been repeatedly named one of Nashville's fastest growing companies and best places to work.<p>How to apply<p>Each time we hire, we wait until we find exactly the right person. If that’s you, we really hope you’ll send your resume over to us with an email.<p>Make sure that what we get from you makes it painfully apparent that you are the right person. Make sure that you make it clear in your email or resume or whatever, that this job is important to you, that you want to work here, not just somewhere.<p>You will want to spend some time on our website, learn how we think and what we do. Get to know us if you want us to get to know you.<p>Submissions should be made to jobs@scorm.com.<p>One of the first things we’ll have you do in the selection process is complete a small programming test. If you’d care to submit it with your initial application, it certainly won’t hurt. We have intentionally kept it simple in an effort to value your time. But we can tell a lot from your response. Consider it carefully. You can download the test from scorm.com/wp-content/assets/jobs/EmployeeTest.zip. Look at the comments of the HTML file for directions on how to proceed.","time":1364835398,"type":"comment"}