{"by":"jacobmorse","id":5474146,"parent":5472746,"text":"Dallas, Texas (will consider REMOTE): Rails Developer<p>At PureDiscovery (<a href=\"http://purediscovery.com\" rel=\"nofollow\">http://purediscovery.com</a>), our goal is to meaningfully connect the world. We're building the next generation of web and mobile applications on top of our groundbreaking (patented) Brainspace platform, and we're passionate about creating the best possible core technology and user experiences.<p>We are growing rapidly, and as we do there are plenty of opportunities for people to shine. Our front-end stack is Ruby on Rails, Knockout.js, Slim, &#38; Coffeescript. We're looking for a Ruby on Rails expert help join our amazing product team, empower the creation of innovative user experiences by working with our powerful core services.<p>We are a young, fast-moving startup where everyone has a voice and can make a difference, so you'll play a key role in steering our technical direction as we continue to scale (quickly!).<p>On any given day you might...<p><pre><code>    • Do a daily standup in person or online.\n    • Evaluate new platforms, plugins, and other technologies.\n    • Contribute to and maintain internal libraries and frameworks that document what we’ve learned and help us iteratively build better and faster.\n    • Optimize, optimize, optimize. Because you love to.\n    • Commit often, ship early, and dodge incoming RC Helicopters.\n    • Provide input to our ongoing evaluation of the area's best tacos, hamburgers and BBQ\n</code></pre>\nYou...<p><pre><code>    • Have a desire to solve hard problems\n    • Know the joys and pains of building web applications heavily dependent on APIs \n    • Want to work at a place where off-the-shelf solutions aren't good enough.\n    • Want to build something great—even world-changing.\n    • Have experience deploying a Rails application on a multitude of platforms.\n    • Have excellent communication skills\n    • Are comfortable doing full-stack web development\n    • Have or would love to build web services of your own.\n    • Regularly star new GitHub repos and keep an eye on RubyGems and npm.\n</code></pre>\nBonus points for...<p><pre><code>    • Experience with Postgresql &#38; MongoDB\n    • Experience with Redis, Sideckick, Resque, etc.\n    • Strong understanding of high availability best practices in the cloud \n    • Experience with oAuth\n    • Experience with Twitter, Facebook and other common APIs</code></pre>\n￼￼￼\nYou’ll work with our Product and UX team in our current, early stages through to first public release and post-launch scaling. You love to ship code, have a strong sense of ownership, and an entrepreneurial spirit.<p>We offer...<p><pre><code>    • A great company culture. We work hard and play hard!\n    • A challenging objective with great opportunity to technically accomplish things you never thought you could\n    • Competitive Salary, stock options and a 401k\n    • Generous vacation policy\n</code></pre>\nDo you want to come to work every day and creatively solve big market-driven problems? Our team is devoted to the continuing pursuit of technical excellence. We will challenge and support you to get the most out of your potential, and expect you to do the same for us.<p>Interested? Drop me a line: jacob@purediscovery.com","time":1364834307,"type":"comment"}