{"by":"mindcrime","id":5474855,"parent":5472746,"text":"Chapel Hill, NC<p>Raleigh, NC<p>Durham, NC<p>Remote - maybe, see below.<p>Fogbeam Labs.<p>At Fogbeam Labs, we're not just \"putting the enterprise in enterprise social network\", and we're not just re-inventing enterprise software, we're re-inventing the enterprise!  Old fashioned \"command and control\" structures can't adapt fast enough for today's dynamic, fast-paced business environment and the enterprises of the future will feature adaptive, sense &#38; respond management, built on top of emergent networks and teams that assemble, overcome a challenge and disperse only to form again elsewhere.<p>We are bringing together Machine Learning, Artificial Intelligence, Social Network Analysis, Social Networking, Business Process Management, Workflow Automation, Business Intelligence and Knowledge Management to build tools to provide enterprises the capabilities they need to collaborate and compete in this new era.<p>We are a \"pure play\" Open Source company where all of our products are developed in the open, licensed under <i>real</i> Open Source licenses (mostly Apache Software License v2), developed collaboratively with the community. We don't do \"throw it over the wall\" code dump style \"open source\" ala Android or whatever.<p>Do you love Open Source, and radically cool technologies?  Do you like the idea of using awesome technology to solve gnarly business problems? Have you ever found yourself daydreaming about things like \"Could there be an actual commercial application for Plan 9\" or \"How could a business use an immersive 3D virtual reality type world for something productive\"?   If so, you might want to talk to us...  We're looking for hackers, sales-people and interns as follows:<p>#SALES#<p>Looking for inside and outside sales people.  Experience selling enterprise software solutions is desirable, but we're also very open to training someone from the ground up.  If you enjoy interacting with people, have a highly social nature, like solving hard problems and want to make a pile of money in the process, get in touch.  Experience with a well known sales methodology such as Solution Selling is a bonus, but not absolutely required.  Remote work arrangements possible, depending on details.  Call us and let's talk.  We really are interested in everything from demonstrated sales superstars to newbies who have never sold before (yes, we'll train the right person(s)).<p>#INTERNS#<p>Looking for a chance to work with some really exciting technology over the summer, contribute to the Open Source world, and learn all about life in a self-funded, bootstrapped startup?  Consider interning with us this summer.  Internships might be paid or unpaid depending on some details, but at the very minimum we can promise you a glowing reference letter, recommendations (assuming you really <i>do</i> good work, of course!) and access to our networks for future purposes. And, depending on how things shake out, maybe a job offer if things go well.  If you like the idea of working with Groovy, Grails, Mahout, Solr, Lucene, UIMA, OpenNLP, Camel, Hadoop, etc. -  and you're interested in graph theory, social network analysis, text mining, machine learning, etc. - ping us.  Interns would need to be onsite in the Chapel Hill / Raleigh / Durham area<p>#COFOUNDER#<p>We're open to adding another member to the founding team.  We're 2 people now, down from a previous 3, due to one co-founder being overwhelmed by life circumstances and choosing to step aside.  An ideal potential co-founder would fit one of two molds:  \"Developer\" or \"Business Guy\".<p>\"Developer\" should have extensive experience programming in Java and Groovy and experience with Grails, as well as considerable indepth experience with typical components of the Java enterprise stack:  Spring, Hibernate, JBoss, Tomcat, etc.  Strong knowledge of SQL and one or more relational databases (preferably PostgreSQL) would be needed.  Strongly preferred would be some experience with machine learning, text mining, social network analysis, enterprise integration, data mining, etc.  Experience contributing to Open Source projects is a huge plus.<p>\"Business Guy (or Gal!)\" would have would ideally have experience in marketing, product management and/or sales, in the enterprise software world.  Knowledge of the Customer Development process would be preferred, as well as experience with at least one well known sales methodology such as Solution Selling.  Actual sales closing experience would be a HUGE plus here, but isn't absolutely required.  Experience developing partnerships, working with industry analysis,  and any PR knowledge would also be highly valued.  If you speak terms like \"differentiation\" and \"positioning\" and read Jack Trout and Al Ries  books for leisure, you're our kind of gnarly dude / dudette.<p>Anybody we would add to the founding team at this point would need to live in the Chapel Hill, Raleigh, Durham area.<p>Email Phil at prhodes (at) fogbeam (dot) com for more info.","time":1364840284,"type":"comment"}