{"by":"bscoperecruiter","id":5474810,"parent":5472746,"text":"BrightScope is looking for a Javascript/CSS expert with a knack for design.<p>Do you want your work to make an important impact on the product? Are you someone who preaches the work of Edward Tufte? Are you excited by standards-based web design and pushing the envelope with innovative interfaces? Do you want to be a part of one of San Diego's premier startups?<p>Responsibilities to include:\n•Designing, developing and improving the front end of our business software assets and applications\n•Helping develop the face of our analytics platform and client-facing applications\n•Optimizing code for the various browsers that visit our site\n•Working alongside the development and product teams\nRequirements:\n•Portfolio of working samples\n•Passion for design and user experience\n•2+ years development experience and an ability to write excellent code using Agile development processes\n•Strong foundation in HTML, CSS, and Javascipt (major bonus point for JQuery)\n•A self-starter attitude and an ability to break large problems down quickly\n•Excellent visual eye for aesthetics\n•Extreme attention to detail<p>Nice-to-haves:\n•Knowledge of browser idiosyncrasies (even IE7/8/9) and page optimization\n•Experience with the Django framework for Python, or MVC development generally (we use Django)\n•Experience with Adobe Photoshop/Illustrator/InDesign\n•Experience with unit and functional testing, and preferably test-driven-development\n•Agile development processes\n•JIRA or other bug tracking systems\n•Knowledge of git, svn, etc (we use git)\n•SQL experience (MySQL preferred), with a strong grasp of data modeling in large applications<p>You will:\n•Play a foundational role in designing our products and services\n•Be an integral member of our team and help shape our future<p>We will:\n•Make sure you have what you need to be happy and productive\n•Provide you with a competitive salary and compensation package including medical, dental and vision insurance, paid sick and vacation time and company equity\n•Make great teammates united around our company mission<p>Interested applicants - please email your resume and link to your online portfolio to jobs@brightscope.com. Be sure to reference \"HN-FEE\" in the subject line.","time":1364839971,"type":"comment"}