{"by":"jhumphries","id":5475301,"parent":5472746,"text":"Stack Exchange is hiring full-time a Product Designer!  We'll welcome someone remote or NYC-based.  We need an impeccable, well-rounded web designer with front-end coding skills and illustration abilities.  Someone with a design blog would be awesome, too.  The work you do here will directly affect millions of users around the world.<p>Apply (and view our other opportunities) at stackexchange.com/about/hiring.  Please include a link to your portfolio.<p>RESPONSIBILITIES:<p>-Create brand identities, web design, and marketing materials for each of our communities, both in digital and in print\n-Work with our developers and product managers to refine rough ideas into beautiful, usable new features\n-Help us design the future of Stack Overflow Careers, our job service for developers\n-Design eye-catching promotional mini-sites, advertising, and recruiting materials to reach people inside and outside of our community\n-We don’t care where you work. We’re looking to hire the best person wherever you are in the world. If you’re interested in working in New York, you’ll enjoy a beautiful, brand-new office with some amazing amenities. If not, we expect you to be available to sync up with various teams during our afternoon in New York.<p>REQUIREMENTS:<p>-An exceptional portfolio showcase strong graphic design, UX, brand identity skills, and HTML/CSS skills\n-An excellent understanding of emotional design, visual hierarchy and application of appropriate art direction (not just making something “pretty”)\n-A demonstrated ability to create different types of art and illustration styles based on project need\n-Experience working together with a variety of people and teams to get projects shipped quickly<p>ABOUT STACK EXCHANGE:<p>Stack Exchange is a fast-growing network of 90+ Q&#38;A sites. Our product team of 25 developers, designers, product managers, and sysadmins supports a network of 35+ million users. We’re making the Internet a better place to get answers, and we need your help.<p>We believe in hiring smart people and getting out of their way. We have an office in New York with some of the best amenities of any New York startup, and we have people who work remotely all over the world. We keep meetings and ceremony to an absolute minimum.<p>BENEFITS<p>20 days vacation\nFlexible hours\nRidiculous health insurance (no copay)\nInsanely great workstations, chairs, and desks\nAll-expenses-paid conference of your choice once per year\nGym membership reimbursement\nFree catered lunch and monthly metrocards (NY office)\nEmployees will never be poked with a sharp stick<p>OH YEAH, AND...<p>Stack Exchange, Inc. does not discriminate in employment matters on the basis of race, color, religion, gender, national origin, age, military service eligibility, veteran status, sexual orientation, marital status, disability, or any other protected class. We support workplace diversity.","time":1364844440,"type":"comment"}