{"by":"mierle","id":5475623,"parent":5472746,"text":"<p><pre><code>  San Francisco, CA and Cambridge, MA - Locu is hiring Frontend\n  Engineers, Backend Engineers and Visual Designers -\n  Full-time; H-1B OK\n\n  Locu is developing technologies to change local search ($35bn\n  advertising market by 2014) through a number of initiatives\n  that help local businesses better connect with their consumers.\n  As part of this vision, we created one of the world's largest\n  semantically-annotated repositories of real-time small-business\n  data, which is now distributed and viewable on sites like\n  OpenTable, Citysearch and TripAdvisor (and more). We recently\n  launched Locu.com, our local business facing product, that\n  combines great tech and beautiful design to help local\n  businesses better manage their online presence.\n\n  Our beautiful offices are in downtown San Francisco, CA (Union\n  Square) and Cambridge, MA (Kendall Square). Check out photos\n  and learn more about our other perks: http://locu.com/about/jobs/\n\n  Frontend Engineering\n      \n    If you are passionate about building products that will touch\n    millions of merchants and hundreds of millions of consumers\n    through the applications powered by our local data APIs, Locu\n    is the right place for you. [JQuery, Less, Django, etc.]\n      \n  Backend engineering\n      \n    We started Locu out of MIT to solve real-world problems by\n    leveraging the latest research in computer science. If you\n    are looking to solve some of the most challenging problems in\n    machine learning, NLP and human computation, you'll feel\n    right at home. [Python, Django, Node.js, Postgres, Redis,\n    AWS, etc.]\n     \n  Design\n      \n    We're looking for visual designers who are excited to\n    redefine what the future of local business data looks like\n    across web and print, and to create tools that put modern web\n    technology in the hands of merchants.\n\n  Interested? Drop us a line at jobs@locu.com. Please include\n  \"[HN]\" in the subject of your letter. Learn more about us at\n  http://locu.com/about/jobs/.\n</code></pre>\nLink (photos!): <a href=\"http://locu.com/about/jobs/\" rel=\"nofollow\">http://locu.com/about/jobs/</a>","time":1364847567,"type":"comment"}