{"by":"Michelle1","id":5476257,"parent":5472746,"text":"San Francisco, CA – Fulltime, Software Engineer &#38; Data Scientist<p>About us - \nAt Ginger.io, we are on a mission to change population health. The company is a spin-off of the MIT Media Lab, and we use sensor data and machine learning to build a 'check-engine light' for a person's health. Our platform is designed to help chronic patients, their caregivers and providers. Ginger.io is currently working with leading US healthcare institutions, has won industry awards, and has been featured in the Economist, New York Times, and Businessweek.<p>Software Engineer (Web, Mobile, Data) - \nGinger.io is looking for software engineers to help us take our product to the next level.   We’re looking for candidates who can play across at least one of the following areas:<p>• Back-end web development: Python, MySQL, MongoDB, Django, Celery\n• Front-end web development:  HTML, CSS, Javascript, jQuery\n• Mobile: Android, iOS (either native or using frameworks like PhoneGap), background processing\n• deployment &#38; scaling: database sharding and replication, Apache/Nginx, Fabric, RabbitMQ, logging, monitoring\n• Data engineering: production feature extraction and machine learning, distributed computation using Hadoop and Celery, data modeling using R and Python toolkits.<p>For more information: <a href=\"http://ginger.io/jobs/software-engineer/\" rel=\"nofollow\">http://ginger.io/jobs/software-engineer/</a><p>Data Scientist - \nWe are looking for a Data Scientist with a background in statistics and data mining to focus on offline analysis and study design. This role is both internal and external facing, hence excellent communication skills are a must. We’re looking for a subset  of the following technical skills.<p>• MS (or PhD) in statistics, epidemiology, computer science, public health or related quantitative field\n• Expertise in statistics including study design, hypothesis testing, sample size estimation, generalized linear models and multivariate statistics\n• Familiarity with machine learning and bayesian methods for classification for offline analysis\n• Ability to develop and iterate models and analysis using R, Python, and other scripting languages on large datasets\n• Ability to work with engineering team to deploy analysis/ models on production servers  \n• Experience with grant writing is a plus.<p>For more information: <a href=\"http://ginger.io/jobs/data-scientist/\" rel=\"nofollow\">http://ginger.io/jobs/data-scientist/</a>","time":1364853828,"type":"comment"}