{"by":"sidjoshi","id":5482850,"parent":5472746,"text":"Seattle - Amazon.com / H1B Welcome / Full Time<p>Have you ever called customer service for a company and got transferred from this person to that person because they couldn’t figure out what your problem was? This happens for those companies because they don’t have advanced technology to predict how best to solve the customers’ problems. Our team is responsible for building software to enable Amazon to intelligently predict the customers’ pain points to optimally route the customer to the right solution, whether it be a customer service agent or self-help features. You would design and develop software to build and interface with machine learning models from data you gather, and to interface with Amazon’s numerous backend systems to solve the customers problem right the first time.<p>As a member of our team, you will design, build and deliver technology that directly impacts millions of Amazon customers. You will have the opportunity to provide direction to our businesses and guide the design of our systems based on realistic time lines and resource constraints. Amazon.com has been ranked #1 in customer service experience, and it will be a challenge to continuously improve customer service technologies, and we need many smart people like you to join us in meeting these challenges.<p>Basic Qualifications:\n- Bachelor’s degree in Computer Science or equivalent program with formal training in computer science basics such as data structures, sorting/searching algorithms, order analysis.\n- 3+ years of experience in C++ and/or Java<p>Preferred Qualifications:\n- Communication skills for both a technical and business audience\n- Willingness to deeply understand the goals and challenges of customer service operations\n- Analytical abilities, proven design skills and a track record of delivery\n- Strong background in computer science basics (data structures, sorting and searching algorithms, order analysis)\n- Experience with designing, building and deploying scalable, highly available systems\n- Fluency in Java\n- Experience with CSS, JavaScript, AJAX, Perl a plus\n- Experience with data analysis and data mining in large scale database environments a plus<p>Please contact me for more info:  sidjoshi (at) amazon (dot) com","time":1364944122,"type":"comment"}