{"by":"sentinel","id":5485288,"parent":5472746,"text":"Paris, France - Viadeo<p>iOS developer, full time, we can help with H1B (equivalent for France) if needed<p>We're looking for another iOS developer to join our mobile team at Viadeo, in Paris.<p>About us:<p>You'll be working on making the Viadeo iOS application awesome, working closely together with the 2 iOS devs: my colleague, Malik and myself, Andrei. But also, you'll be working with the whole mobile team, composed of 13 other cool, brilliant, motivated people: Android/BlackBerry devs, backend devs, marketing, design, product people, one technical lead and a chief mobile officer.<p>From a technological perspective, we work with Objective-C, the different iOS frameworks, and we use Git/GitHub as our source code management system. We're keen on working fast, in an agile/SCRUM manner. We're keeping the concept of working like a \"start-up within a start-up\" and we're looking for another developer to join us and help us build the next versions of the Viadeo app.<p>About you:<p>You should have some previous experience in working with iOS, know your way around Core Data, be comfortable with Cocoa Touch (or at least be able to pick up its different aspects), understand the MVC pattern and apply it as much as possible in your projects. Speaking of which, it would be great if you have something we can look at, either previous projects or previous code. It would be awesome if you have a GitHub account. Also if you know and use Git.<p>Other than that, work well with others, be motivated and cool, cause you'll be joining a cool and motivated team.<p>About Viadeo:<p>You'll be working in a fast-growing, competitive, international company, in the field of professional social networking, which still has the spirit of a start-up. Go to <a href=\"http://corporate.viadeo.com/en/about-us/group-facts/\" rel=\"nofollow\">http://corporate.viadeo.com/en/about-us/group-facts/</a> for more info. Download our Viadeo iOS app (<a href=\"https://itunes.apple.com/za/app/viadeo/id379428410?mt=8\" rel=\"nofollow\">https://itunes.apple.com/za/app/viadeo/id379428410?mt=8</a>) to see how it looks. Check out viadeo.com for our website.<p>Did I mention we get a cooked lunch served at the company cantine every day, with a salad bar and Nutella chocolate cake desert (or fruit salad for the health conscious)? Also, free drinks, coffee and tea.<p>Get in touch with me if you have more questions or are interested in this position (also attach your CV): apatru [at] viadeoteam [dot] com","time":1364987057,"type":"comment"}