{"by":"peawee","id":9812766,"parent":9812245,"text":"[ALL REMOTE] SpiderOak, multiple positions. Bias in favor of decent overlap with US Central timezone. Very occasional travel to Chicago or Kansas City will be required.<p>SpiderOak is expanding out, building next-gen products to help bring the same privacy to cloud computing as you’d expect from personal computing. There are multiple positions open, ranging from entry-level tech support positions to higher level development and management positions. We’re a global team of engineers, with 8 years of history behind us in building SpiderOakONE and SpiderOak Groups, and customers from the average Joe to Fortune 500s and the government. Be part of a growing team at an exciting time for privacy on the internet.<p>* Product Manager [$75k-$100k]: Help manage all aspects of product development, and make sure that product development stays on-track and on-time. Guide products from inception to completion, with involvement in everything from development to support to documentation to pricing. See more at <a href=\"https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;product-manager\" rel=\"nofollow\">https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;product-manager</a><p>* JavaScript UI Developer [$75k-$100k]: We&#x27;re building our next-generation products making full use of HTML5 technologies. If you&#x27;ve experience with building effective and amazing UIs in React, please see more at <a href=\"https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;javascript-front-end-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;javascript-front-end-develope...</a><p>* Python &#x2F; Django Developer [$75k-$100k]: Love Django? We need a Django-head to help us build out our web-driven products, from components for SpiderOak Groups to our website to backend internal tooling. If everything from SQL and Python to CSS and HTML is your thing, see more at <a href=\"https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;django-developer\" rel=\"nofollow\">https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;django-developer</a><p>* Customer Relations Representative [$36k]: Be the hero that our users need and deserve. Upward mobility within the company certainly possible as well. See more at <a href=\"https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;customer-support-representative\" rel=\"nofollow\">https:&#x2F;&#x2F;spideroak.com&#x2F;articles&#x2F;customer-support-representati...</a>","time":1435766162,"type":"comment"}