{"by":"playing_colours","id":9812785,"parent":9812245,"text":"relayr @ Berlin, Germany - Embedded Systems Engineer <a href=\"https:&#x2F;&#x2F;www.relayr.io&#x2F;jobs&#x2F;embedded-systems-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.relayr.io&#x2F;jobs&#x2F;embedded-systems-engineer&#x2F;</a> - Full time<p>relayr is all about bringing things to life. We have three technical pillars: an Internet of Things Platform as a Service, open SDKs and a Hardware development platforms designed to allow developers to quickly build Internet of Things solutions. We have several internal and client projects and are looking for an enthusiastic engineer to work as a full-time employee together with our team of five hardware engineers in our Berlin Office. You will bring products from idea&#x2F;concept through design, prototyping, development testing, design verification and validation<p>The Mission:<p><pre><code>  - Develop Libraries and examples running on diverse hardware platforms\n  - Construct prototype applications for client projects\n  - Support existing Products e.g. WunderBar\n  - Experiment and discover new possibilities\n  - Help build out your team\n</code></pre>\nYour Skills:<p><pre><code>  - Excellence in Embedded C &#x2F; C++\n  - Interest in light-weight languages like Lua or Python\n  - Experience in Developing and debugging for ARM, RTOS\n  - Some knowledge of developing low-level drivers\n  - Knowledge of Freescale Kinetis and Nordic nRF51 families an advantage\n  - Experience using and adapting common Open Source toolchains\n  - Some experience in PCB design and analysis &#x2F; troubleshooting\n  - Good level of English.\n</code></pre>\nWe Will<p><pre><code>  - Listen to and value your opinion, value and respect you as a person\n  - Make mistakes, break stuff, learn and move on\n  - Operate in a non-hierarchical open fashion\n</code></pre>\nA small and growing team where your influence and skills will be needed, recognized and rewarded.","time":1435766267,"type":"comment"}