{"by":"nullspace","id":9812894,"kids":[9813241],"parent":9812245,"text":"x.ai - <a href=\"http:&#x2F;&#x2F;x.ai&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;x.ai&#x2F;</a> - New York City, NY - VISA - email: jobs@human.x.ai - <a href=\"http:&#x2F;&#x2F;x.ai&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;x.ai&#x2F;jobs</a><p>At x.ai, we are building an artificial intelligence powered personal assistant. The software will schedule meetings for our customers automatically without subjecting them to the typical back and forth over email negotiating when and where to meet someone. We are looking for a smart, self-motivated, and enthusiastic individual to join us on the journey in building the artificial intelligence of the future. You’ll get to work side by side with a small team of serial entrepreneurs moving at breakneck speed.<p>We are an Scala &#x2F; Node.js &#x2F; MongoDB &#x2F; AWS company, and are looking to hire:<p>a) our <i>first Infrastructure Engineer</i><p>b) backend engineer with experience in Scala.<p>c) web application engineer ( we use Node.js and AngularJs )<p>----------------<p>As an Infrastructure Engineer, some of the things you would do are:<p>* Build, manage and scale out the core infrastructure that powers x.ai, keeping resilience and security in mind<p>* Iterate on our continuous integration and continuous deployment pipelines<p>* Automate everything to a point of fault<p>* Constantly improve our development processes and tools to reduce friction from idea to deployment<p>Ideally, you would have experience with working on distributed applications, Linux, automation tools and container technology like chef &#x2F; puppet &#x2F; docker, and experience with at least one programming language. As a bonus, experience in AWS, MongoDB, Apache Spark would be great.<p>----------------<p>As a backend engineer some of your responsibilities would be:<p>* Build, evolve and scale out infrastructure to ingest, process and extract meaning out of free form text<p>* Design and build a system that enables seamless human-machine interactions<p>* Solve various optimization and constraint problems related to coordinating people’s schedules and preferences<p>* Integrate with various external APIs<p>We are a Scala team and would prefer if you have experience in the language, but feel free to ping us if you want to do hardcore functional programming. :)<p>----------------<p>As a web application engineer, you would:<p>* Evolve Human-Machine interaction to improve data collection for our information-hungry AI<p>* Design and implement clever ways to capture both implicit and explicit human preferences<p>* Evolve frontend architecture<p>* Integrate with various external APIs<p>We&#x27;re looking for someone who&#x27;s awesome at JS &#x2F; HTML &#x2F; CSS, and has an excellent product sense. We use Node.js &amp; Angular, so experience with that would be great.<p>----------------<p>Email jobs@human.x.ai if you&#x27;re interested, and also go to <a href=\"http:&#x2F;&#x2F;x.ai&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;x.ai&#x2F;jobs</a> to check out our other open positions.","time":1435766895,"type":"comment"}