{"by":"voxy_dale","id":9812403,"kids":[9813273],"parent":9812245,"text":"Voxy - <a href=\"https:&#x2F;&#x2F;voxy.com\" rel=\"nofollow\">https:&#x2F;&#x2F;voxy.com</a> - New York, NY - Senior Full Stack Python&#x2F;Django Engineer - Full Time<p>Voxy is changing peoples lives for the better every single day. That’s not an overstatement, it’s the truth. Learning a new language is the single hardest things that you can ask an adult to do. We make it happen. Every. Single. Day.<p>Voxy provides a cloud-based English language learning platform that’s based on 20 years of cutting edge scientific research into language learning. It’s proven effective, in the lab and in the wild. It’s a tough problem, but that’s okay, we like tough problems and you should too.<p>You&#x27;re the type of engineer engineer that wants to join a growing start-up as we tackle the old-school entrenched players in a $60B&#x2F;year industry that hasn’t seen any real innovation in decades. You&#x27;re looking for a kick-ass culture, paying customers and top-tier investors; we have that.<p>These things are important to us, and they should be important to you too:<p>- Engineers. Real engineers. That means you problem solve first and write code second.<p>- We’re about the right tool for the job. At the moment that’s Python, Backbone, MongoDB and PostgreSQL. In the future, maybe something else.<p>- We build our mobile solutions as native apps.<p>- We pair-program and follow Agile. Unless it’s not working, in which case we don’t.<p>- Thirst for learning. What we’re working on today may be something different tomorrow, and as a company we support that.<p>- Respect. We love new ideas and discussion, and while we don’t always agree with each other our strong opinions are loosely held.<p>Competitive salary, stock, medical, dental, vision, etc. Yep, we’ve got that, plus a whole host of other benefits like CitiBike memberships, gym reimbursements, snacks, beer (to offset the gym memberships), unlimited vacation, free Mandarin&#x2F;Spanish&#x2F;French lessons, and a bunch of other stuff. HQed in NoHo, with offices in São Paulo, we are situated amidst multiple train lines, restaurants, coffee shops, bike stores, bars, gyms, fashion, galleries and general NY excellence.<p>You are currently eligible to work in the US.<p>If you’ve got at least 3 years of real world engineering experience, even if you don’t currently use our stack, let’s talk.<p>We are an equal opportunity employer and value diversity at our company. We really do, you should come and check it out for yourself. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.<p>More info and application here <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;key3ob\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;key3ob</a>","time":1435764099,"type":"comment"}