{"by":"kevinburke","id":9812482,"parent":9812245,"text":"San Francisco, CA - Onsite - Shyp<p>Need to mail something? Don&#x27;t worry about boxing up your packages or finding the best deal. Request a pickup in the Shyp app, we&#x27;ll pick it up from you, package it and find the best deal out of UPS, Fedex &amp; USPS to get your items to their location safely, cheaply &amp; on time.<p>5 server-side engineers are serving operations in 4 cities. We just raised $50m and we&#x27;re looking for engineers to help us expand.<p>Lots of interesting problems to work on, including:<p>- Warehouse optimization<p>- Driver dispatch&#x2F;routing optimizations<p>- Figuring out the best carrier for a given package<p>- Communicating sundry shipping options across different carriers in a standard way<p>- People ship a lot of interesting stuff! Tons of opportunity to give everyone a great experience at scale, no matter what they&#x27;re sending.<p>Some of the benefits of the job:<p>- No waking up in the middle of the night! Open hours are 8am to 8pm.<p>- Whatever laptop setup you want.<p>- We host tech talks over lunch twice a month - have had people from Bugsnag, Stripe, Twitter, Medium, ngrok, and Layer come give talks in the past four months.<p>- $400 a year in travel credit, we want you to get away<p>- Daily Volume (compared to tweets or push notifications or text messages) is low, so systems aren&#x27;t constantly falling over or about to.<p>- Our data is stored in Postgres, no worries about writes being acked and not actually saved.<p>- Servers&#x2F;stored data are all UTC :)<p>- No long hours - pretty much everyone leaves the office at 6pm sharp.<p>- Really generous health&#x2F;dental&#x2F;vision coverage<p>- Office is about two blocks from Montgomery BART, lots of food&#x2F;culture options nearby.<p>- We&#x27;ll help you relocate to SF<p>If you&#x27;re interested, we&#x27;d love to talk to you! <i>You can&#x27;t waste our time by getting in touch.</i> We&#x27;ll answer your questions about Shyp and tell you a little more about what our interview process looks like.<p>Please drop me a line - burke@shyp.com.<p><i>Not looking, but based in SOMA?</i> You might be interested in our lunchtime tech talks - ping me, burke+talks@shyp.com and I&#x27;ll let you know the next time we have a speaker in.","time":1435764607,"type":"comment"}