{"by":"kalvin","id":9813515,"kids":[9814729],"parent":9812245,"text":"Nava | Washington DC<i></i>* | Experienced full-stack developers&#x2F;devops&#x2F;product manager&#x2F;operations | On-site - Full Time<p>I&#x27;m part of a small team of engineers from Silicon Valley that came out to DC last year to help fix Healthcare.gov. It turns out there’s a lot more to fix. And it’s surprising how much can be fixed by a small group of resourceful people with a Silicon Valley mindset, deep technical experience, and the willingness to work closely with dedicated civil servants in government.<p>Our revamped Healthcare.gov application has been used by millions, converts 35% better, and halves the completion time. The login system we rebuilt is about two orders of magnitude more reliable and two orders of magnitude less expensive; for example, it’s about $70M less per year to operate. We’re just getting started, and we’ve started Nava to help fix everything else. [0]<p>People die because the Veteran&#x27;s Administration is months behind in processing claims. The Social Security Administration pays benefits to millions of deceased Americans. $80 billion is spent every year on federal IT contracting, and 96% of projects are deemed failures [1].<p>That’s not because there’s some conspiracy or because government is inherently incapable of doing it right. These are complicated legacy systems and processes, and there are very few people with modern tech industry experience who are aware of these problems and willing to help fix them. You can help change that.<p>Our team is 10 people (Stanford, Google, YC alums), and we plan to bring on a few people every month through 2015.<p>We’re looking for:\n- experienced full-stack engineers\n- experienced devops engineers\n- a product manager with a technical background\n- a hyper-resourceful operations person<p>We have a social mission (we just incorporated as a public benefit corporation (PBC) this week), but we pay market compensation (above market, for DC) and equity (above market).<p>If you&#x27;d like to build software and infrastructure that radically improves how our government serves people, we’d love to hear from you at jobs@navahq.com.<p>*Not in DC &#x2F; able to relocate, but intrigued and in SF? Talk to us.<p>[0] <a href=\"http:&#x2F;&#x2F;www.fastcodesign.com&#x2F;3047856&#x2F;innovation-by-design&#x2F;meet-nava-a-startup-that-wants-to-fix-the-governments-crappy-design\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fastcodesign.com&#x2F;3047856&#x2F;innovation-by-design&#x2F;mee...</a><p>[1] <a href=\"http:&#x2F;&#x2F;www.washingtonpost.com&#x2F;blogs&#x2F;wonkblog&#x2F;wp&#x2F;2013&#x2F;10&#x2F;22&#x2F;the-lessons-of-healthcare-gov-stretch-far-beyond-obamacare&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.washingtonpost.com&#x2F;blogs&#x2F;wonkblog&#x2F;wp&#x2F;2013&#x2F;10&#x2F;22&#x2F;t...</a>","time":1435771225,"type":"comment"}