{"by":"jonbischke","id":9813599,"parent":9812245,"text":"Entelo - San Francisco (SOMA), CA - Full-time - <a href=\"http:&#x2F;&#x2F;www.entelo.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entelo.com&#x2F;</a> ; We&#x27;re currently only hiring Onsite in San Francisco, so can&#x27;t support remote employees at the time.<p>Our mission is to help organizations build diverse, cohesive and better teams. We&#x27;ve been building a variety of hiring solutions to help companies big and small leverage the wealth of information online to find amazing prospective employees and make better hiring decisions. The sales and marketing worlds have many solutions that enable them to be more efficient and productive and it is our belief that we can adapt the best that sales and marketers have to recruiting&#x2F;talent departments.<p>We owe a ton to the Hacker News community as we&#x27;ve made multiple hires through our interactions with engineers here and I personally have learned a ton from the HN community.<p>We&#x27;re hiring aggressively on our engineering team and are looking for collaborative, thoughtful and resilient individuals to help us improve the way all organizations think and approach recruiting. Our open roles:<p>-Sr. Backend Engineers&#x2F;Architects (Salary Range: $140k-$180k)\nWe&#x27;re looking for people that are interested in our backend challenges. Our backend team deals with crawling, parsing and normalization of hundreds of millions of social profiles (i.e. Linkedin, Github, Twitter) and use complex algorithmic and statistical methods to match disparate social profiles.<p>We&#x27;ve used a combination of Scala, MongoDB, RabbitMQ, AWS and Redshift although have seriously considered using both Go and Postgres.<p>-Full-stack Ruby Developers (Salary Range: $110k-$160k)\nOur full-stack team deals with a variety of challenges from the frontend to the database. They build new products, improve ElasticSearch, handle DevOps by committee and are heavily involved in making product decisions. The team is highly collaborative and we&#x27;re looking for individuals you genuinely working with their colleagues to come up with solutions. Our full-stack team gets involved with many of of the other teams including but not limited to Product, Sales and Customer Success.<p>Our stack includes Ruby on Rails, MySQL, ElasticSearch, Redis, Javascript, AWS and Docker among other technologies.<p>Last thing I&#x27;d like to mention is that we deeply invest in our employees&#x27; professional growth to the point where we offer every employee a $1k annual stipend to use on whatever courses&#x2F;conferences&#x2F;training will help them improve. And for those engineers who care about becoming leaders one day, we live and breath recruiting which is one of the most important skills for budding engineering leaders- I guarantee you&#x27;ll learn more about it here than anywhere else :)<p>I&#x27;m the founder and if you&#x27;re interested in any opportunities with us, you can reach me directly at jon at entelo dot com","time":1435771851,"type":"comment"}