{"by":"jameincke","id":9813561,"parent":9812245,"text":"CloserIQ | New York, NY<p>CloserIQ is the network connecting top sales talent to venture backed tech startups. We are a self-funded and highly profitable recruiting tech startup combining powerful software with world class service.<p>We are currently hiring for multiple roles:<p>Talent Advisor: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;jYihA&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;jYihA&#x2F;8bd29</a><p>Recruiting&#x2F;talent coach position. Our Talent Advisors attract, engage and onboard top sales talent to the rapidly growing CloserIQ network. You’ll be joining a small team of sales leaders, technologists, and growth hackers as a “sports agent” for the top revenue generators in the tech community.<p>Client Advisor: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;jfJQA&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;jfJQA&#x2F;8bd29</a><p>B2B sales position. You will be educating startup founders, sales managers and HR stakeholders about CloserIQ’s unique sales recruiting solution. This is an entrepreneurial and self-directed role that will play a large role in the growth of the company.<p>Software engineer: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;jAAwOQ&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;jAAwOQ&#x2F;8bd29</a><p>As an early software engineer at CloserIQ, we want you to bring experience building real products in the real world. We&#x27;d love if you have any specialities in the web stack that makes you a resident guru we can go to with tough problems. We also love if you have a keen sense of quality vs speed as we ship aggressively and value speed just as much as quality.<p>Business Operations Intern: <a href=\"http:&#x2F;&#x2F;clsr.us&#x2F;j8h2w&#x2F;8bd29\" rel=\"nofollow\">http:&#x2F;&#x2F;clsr.us&#x2F;j8h2w&#x2F;8bd29</a><p>We&#x27;re looking for smart and tech savvy interns to help out as we grow the business. We&#x27;re a team of 6 based in midtown east. You&#x27;ll work with our founders, talent team and engineers on all aspects of the business and have a meaningful impact on the success of the company.","time":1435771583,"type":"comment"}