{"by":"weeby_jobs","id":9813486,"parent":9812245,"text":"Weeby.co is looking for a C++ Engineer | ONSITE (Mountain View, CA) | FULL TIME | engineering@weeby.co<p>We are changing the way people build games. We believe that non-zero compile times when iterating on a game are unacceptable, that the right tools can turn a single developer into an entire game studio, and that drop-in social experiences provide them with the best user acquisition and re-engagement strategy in the industry. The Tealeaf team builds the runtime that makes that all possible.<p>Responsibilities\nYou will be part of our team building Tealeaf, the HTML5 runtime that powers all Weeby games on iOS and Android. You will contribute to features like on-device remote debugging from your desktop browser, remote application loading, CanvasRenderingContext2D Path APIs, and the WebGLRenderingContext.<p>- Implementing DOM APIs in C++ and exposing them to the JavaScript runtime\n- Writing integration tests in JavaScript for new APIs. A feature that isn’t tested isn’t done.\n- Code review other team member’s features and fixes<p>Qualifications\nYou have experience with the following:<p>- writing concurrent C or C++\n- binding native code with a JavaScript engine like v8 or SpiderMonkey\n- writing JavaScript\n- implementing vector graphics rendering algorithms\n- OpenGL ES, WebGL\n- WebIDL, experience implementing&#x2F;maintaining C++ code generator\n- Knowledge&#x2F;experience with blink dev-tools protocol<p>Why you should join<p>We build the tools to make building fun games easy, and we have fun while we build them. The code we write spans several domains which makes for intellectually stimulating days. When we need a break from the keyboard we compete in an office ping pong ladder, get coffees and dine down the block. For fun we have team BBQs, weekly team dinners and enjoy weekly game nights joined by friends and the StartX community.<p>We offer competitive salaries (weeby 250k) and equity.<p>Interested? Shoot us an email (engineering@weeby.co) with your resume.","time":1435771029,"type":"comment"}