{"by":"mattbee","id":9813518,"parent":9812245,"text":"Bytemark (York, UK) is looking for an experienced web developer. We&#x27;re seeking someone who is able to get things done from scratch, who can tell us about something they made the web and say &quot;I made that!&quot;.<p>We need an engineer who is comfortable working at both the front- and back-end of a modern web application. You should be able to pick apart HTML, Javascript, the DOM, HTTP, SQL and a back-end framework or two. We use Ruby &amp; Go, but particular languages aren&#x27;t as important as a proven track record, and a desire to get projects delivered.<p>At Bytemark we build our own cloud hosting infrastructure, so the more you know about IP networking and operating systems, the better. We&#x27;re also steeped in Free Software, its history and licenses, so any expertise there would put you in good company.<p>We have processes that work for our small team: we test automatically, but usually think we could do more. We use Git or Mercurial for revision control, Redmine to keep track of our bugs, and Jenkins for CI. We meet fortnightly rather than daily. We trust you to pick the right project from our development plan; we don&#x27;t over-manage. In short, we have an evolving methodology and a wealth of experience — this means we can quickly and efficiently deliver new features for our customers. Join, and help us do more!\nWe have our own data centre and cloud hosting platform (<a href=\"https:&#x2F;&#x2F;www.bigv.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bigv.io&#x2F;</a>), and are looking for a web developer to join our engineering team.<p>Location: York, Manchester, remote considered for more experienced engineers.<p>Salary: £32500 to £48000<p>We are an equal opportunities employer - we don&#x27;t even want to know your name or see your CV until the third round of interviews.<p>Therefore please apply through our anonymous recruitment process where you won&#x27;t need to give your name to get an interview:  <a href=\"https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;4\" rel=\"nofollow\">https:&#x2F;&#x2F;careers.bytemark.co.uk&#x2F;positions&#x2F;4</a>","time":1435771241,"type":"comment"}