{"by":"udfalkso","id":9814164,"parent":9812245,"text":"Foodstand | NYC | Full-Time | Frontend Engineer | On-Site Preferred<p>Foodstand is a quickly growing digital community for anyone who cares about supporting a better food system. We’ve launched a beta version of our mobile app that allows eaters, makers, and growers to share and discover good food from like-minded folks. We have an extremely active and growing audience and have a quickly established ourselves as the hub of good food through our events, community activities, and partnerships. The Foodstand app was incubated by Purpose, the movement-building agency in NYC that has launched several movement organizations and initiatives to tackle issues of social change such as gun violence, LGBT rights, human trafficking, and climate change. The Foodstand venture is Purpose’s effort in mobilizing consumers to be a part of changing our food system.\nWe are a small team working from the lovely Purpose offices near Union Square in New York City. As our user-base continues to grow, we are looking for an outstanding Front-end focused engineer to help us scale up our community and continue to improve our product.<p>On-site full-time presence in NY is preferred but we are open to other arrangements for outstanding candidates. You will be joining a very small engineering team and will have the opportunity to make a huge impact on the organization and the product. If you care about food and improving our broken food system, and want to work with fun, smart, pragmatic, motivated people, please get in touch.<p>Our stack is HTML, CSS, JS, Ember, Cordova, Objective C (iOS), Ruby&#x2F;Rails&#x2F;Postgres&#x2F;Heroku. Experience with these specific technologies is a plus, but not required.<p>You can learn more about Foodstand and the team here: <a href=\"https:&#x2F;&#x2F;www.thefoodstand.com&#x2F;about-foodstand&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thefoodstand.com&#x2F;about-foodstand&#x2F;</a><p>Apply by emailing udi@thefoodstand.com with your resume. Thanks!","time":1435775956,"type":"comment"}