{"by":"TravisDirks","id":9815751,"kids":[9817247],"parent":9812245,"text":"Seldn, inc - Warning None standard offer: Creative Sabbatical in Maui, Hawaii<p>We have decided to sponsor a creative sabbatical for a front end developer or data scientist to come work on our AI startup (= Seldn) for this period. Seldn will sponsor airfare (from the US) and stay in return for their spirited help at Seldn, intellectual company &amp; commitment to enjoying Hawaii&#x2F;life. That&#x27;s it -- no catch. We&#x27;d be open to opportunities for them to continue working with us after that but no commitment required.<p>Please pass this opportunity on to the coolest front-end Developers&#x2F;Data scientists you know! \nMore details:<p>Creative Sabbatical: Data Scientist&#x2F; Developer? Come work on an AI startup in Hawaii<p>About Us: Seldn is an Artificial Intelligence (AI) that can automatically predict global macro risks. Our core technology uses complexity-physics inspired machine learning algorithms and Big Data to provide a SaaS platform geared toward predicting political, financial and social macro risks – think economic crashes, labor strikes, riots, etc.<p>Very neat stuff and definitely ambitious. Our first focus is enterprise s&#x2F;w catered toward supply chain disruptions. We are a very early stage stealth startup, normally based in Palo Alto, CA.<p>Sabbatical: Seldn is sponsoring a creative sabbatical for a data scientist and a front-end developer to come spend the summer Hawaii working with us on our meaningful world-changing AI platform.<p>Dates:  July 10 – Aug 27, 2015 (negotiable but minimum 5 weeks)\nLocation:  Maui, Hawaii.\nWhat’s covered:  Roundtrip Airfare (from US) &amp; stay.\nCommitment:  Spirited help at Seldn, shared responsibilities at the community house and enjoying Hawaii.\nEligibility: Limited spots open for \n1. Super smart data scientist with experience in data wrangling, algorithm development, machine learning, python, cloud deployment\n2. Front end developer with production experience in HTML5, CSS, at least one JavaScript framework (Angular&#x2F;Backbone&#x2F;Ember) and building next-gen enterprise SaaS products. More details on our ideal dev.<p>To Apply: Email radhika@seldn.com with: 1. your resume 2. brief description on why we should pick you and 3. a superpower you wish you had<p>That&#x27;s it -- no catch. This could turn into a long-term career opportunities at Seldn, but no commitment required.","time":1435790574,"type":"comment"}