{"by":"brndn","id":9815080,"parent":9812245,"text":"Ericsson Inc. - Acton, MA (full-time, on-site) (outside of Boston, Massachusetts)<p>Senior level developer<p>• Work on a small, fast-moving team building services to help bring TV to a mobile world<p>• Develop full-stack web applications. (ruby on rails, nodeJS, postgres, mongodb, etc.)<p>-------------------------<p>• Experience from technical roles focusing on integration is a required experience for this role, e.g. experience from work as Integration engineer, Professional Services, or Systems Engineer.<p>• Previous experience working in a Linux development environment with at least one scripting&#x2F;interpreted language such as (Perl, Ruby, Python, etc) and at least one programming language (C&#x2F;C++, Java, etc)<p>• Prior experience developing web service&#x2F;Internet communication protocols within Rails or other database abstraction platforms.<p>• Also required are superb written and verbal communication skills.<p>• The successful candidates will likely have an Engineering or Computer Science degree and a minimum of 7+ years successful track record in high-end professional services business development&#x2F;delivery with extensive experience in working with IP networks and how they relate to complex broadband IP service deployments.<p>-------------------------<p>Preferred Skills:<p>• The ability to articulate state of the art key IPTV technology components as well as the current state of standards and video compression technologies (H.264, H.265, HEVC, VC-1, etc…) and broadband networking.  Ability to communicate at an executive level with Tier1 customer and partner senior management. Interpersonal awareness and communication skills are required.<p>• Extensive experience with IP networks as well as their supporting infrastructure including experience working directly with Tier 1 PTT’s&#x2F;RBOC’s or MSO’s.  Hands on configuration experience with networking equipment such as routers&#x2F;Switches, DNS, SHCP, Firewalls, Loabalancers, etc would be a plus.<p>Contact: brandon.burke [AT&gt; ericsson.com","time":1435784061,"type":"comment"}