{"by":"snowmaker","id":9816112,"kids":[9816135],"parent":9812245,"text":"Scribd (YC &#x27;06, &quot;Netflix for eBooks&quot;, top 100 website, 50 people) is hiring talented hackers of all kinds to help us build the library of the 21st century.<p>We&#x27;ve hired EIGHT full-time people and TONS of interns from these &quot;Who is Hiring&quot; threads ... it really works!<p>We&#x27;re looking for people who want to work with:<p>* Ruby on Rails (we&#x27;re the #2 largest rails site, after Twitter)<p>* Javascript (well, we use Coffeescript)<p>* iOS OR Android (we&#x27;re a top 10 eBook app with more reviews than Wikipedia, with a small mobile team)<p>*  Data science &#x2F; data analysis (using big data tools like hive to analyze an amazing proprietary dataset)<p>* Machine Learning &#x2F; data mining &#x2F; recommendations - think Netflix prize, but for books!<p>* Product manager and design (UI or UX) roles too<p>* Internships: junior standing or above for all areas of engineering. We hire several interns every summer and year-round.<p>That said, we care way more about your personality and general hacking skills then what languages you&#x27;ve used so far, so if you haven&#x27;t used these but want to break into mobile or web development, this could be a good opportunity for you. We&#x27;ve hired people from these threads with everywhere from 0 to 10 years of experience.<p>We&#x27;re profitable, very well funded and have a really fun office environment (in-office go-karts!) in the center of the startup world in San Francisco. Scribd alumni have gone on to found 4 other YCombinator companies, more than from any other startup. We think this says something about the kind of people that we like to hire, and we love hiring people with entrepreneur and startup ambitions. We are also always looking for international people interested in moving to the US and can help you secure a visa.<p>You can read more about our &quot;Netflix for Books&quot; service here <a href=\"http:&#x2F;&#x2F;wrd.cm&#x2F;1dJquzz\" rel=\"nofollow\">http:&#x2F;&#x2F;wrd.cm&#x2F;1dJquzz</a> or check out our tech blog at <a href=\"http:&#x2F;&#x2F;coding.scribd.com\" rel=\"nofollow\">http:&#x2F;&#x2F;coding.scribd.com</a>.   Last month we launched the first &quot;Netflix for Comics&quot; - really exciting stuff! More here: <a href=\"http:&#x2F;&#x2F;wrd.cm&#x2F;1MbaBA6\" rel=\"nofollow\">http:&#x2F;&#x2F;wrd.cm&#x2F;1MbaBA6</a><p>More info is at <a href=\"http:&#x2F;&#x2F;www.scribd.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;www.scribd.com&#x2F;jobs</a>, but as a HN user, feel free to apply directly by emailing me at jaredf at scribd.com.","time":1435795534,"type":"comment"}