{"by":"tonyleask","id":9816162,"parent":9812245,"text":"&quot;Ask.com&quot; (Please email resume to Jobs@ask.com) VISA Friendly &amp; ONSITE Only<p>JD: Node.js Platform Engineer<p>Us<p>As a top US internet site, Ask.com’s mission is to get our millions of users across the globe the answers they need. We’ve been in the Q&amp;A business for more than 17 years, and although Jeeves has since retired, we carry on his passion for serving our 100 million users with answers they can trust. We are serious about creating and maintaining a company culture that is both innovative and fun, and we’re looking for great people to come join our team.<p>The Role<p>As a member of the Application Platform Team, you will oversee the web application architecture for the Ask.com family of websites, and help design and develop the services, platforms, and frameworks that enable our front-end teams to build awesome experiences at scale.<p>What you will do\n•Design and build Ask.com’s next-generation web application platform\n•Obsess over performance and scalability across our tech stack\n•Advance Ask.com’s technical culture through presentations, meet-ups, conferences, etc.\n•Work closely with front-end developers to understand their needs and explore technology trade-offs\n•Help define architecture and technology choices through research and prototyping\n•Write clean, well-tested, maintainable code\n•Thrive in a highly collaborative team and engineering organization<p>Your Skills\n•Passion for high performance and scalability\n•Solid understanding of software architecture best practices\n•Experience building frameworks and APIs that enable maintainable and reusable application development\n•Advanced JavaScript skills (OO, functional, Node.js)\n•Extensive experience with another language is a big plus\n•Solid CS fundamentals in Algorithms, Data Structures, Operating Systems, Networking, etc.\n•Solid web fundamentals (HTML, CSS, HTTP, Cookies, Redirects, etc.)\n•BA&#x2F;BS in Computer Science or equivalent experience","time":1435796243,"type":"comment"}