{"by":"robinmacharg","id":9817985,"parent":9812245,"text":"Actual Experience PLC,  Provider of Digital Quality analytics services | Android Developer | Bath, UK | ONSITE (with home-working) | FULLTIME<p><a href=\"https:&#x2F;&#x2F;www.actual-experience.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.actual-experience.com&#x2F;</a><p>We offer digital quality analysis services for businesses and consumers.  Our Digital Supply Chain Director service enables continuous, automatic, and real-time Voice of the Customer analysis, identifying any sources of service misbehaviour and directing attention where improvement in experience for staff and customers will be most meaningful. Our service is being incorporated into digital product architectures and processes for some of the world’s largest, most sophisticated digital enterprises.<p>To give a concrete example: 95% of a web-page may load in a fraction of a second, but the quality of the user-experience is adversely affected by the last image (or javascript, or whatever) taking 3 seconds to arrive from the CDN.  Our software captures this kind of measurement and helps identify the cause.  It&#x27;s not limited to web-pages; we have measurement profiles for email, database, VoIP, cloud services etc.  We can also help identify where the service is <i>too</i> good, where the additional speed is essentially wasted and, perhaps, the investment would be better made in other areas of an infrastructure.<p>You can see the technology in action with our consumer version, BbFix. (<a href=\"https:&#x2F;&#x2F;www.bbfix.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.bbfix.org&#x2F;</a>)  This allows you to see how good your broadband really is.  And where any problems lie from home router to ISP to the Skype or iPlayer endpoints.<p>We&#x27;re looking for an Android developer to create apps, in the short-term, to:<p>- Report the results of the analysis in a simple, engaging way that CxOs can understand<p>- Measure the Digital Quality to and from from mobile devices and services in a similar way to our current wired Digital Users.  With our Tier-1 clients you could have your app deployed to hundreds of thousands of devices.<p>Beyond that we have plans for tablets and a mobile version of BbFix.<p>The job-spec is here: <a href=\"https:&#x2F;&#x2F;www.actual-experience.com&#x2F;site&#x2F;assets&#x2F;files&#x2F;1036&#x2F;ae_android_developer.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.actual-experience.com&#x2F;site&#x2F;assets&#x2F;files&#x2F;1036&#x2F;ae_...</a><p>We have a mixed technology base: Erlang, Python and the usual Web-stack.  The iOS app is Swift-based.  Our APIs are JSON and we use Git.  You might not know all of them but you&#x27;ll be interested in finding out more, given the chance.  Finally, the working environment is very relaxed with most people flexibly working from home a couple of days a week.  Get in touch via the website with a CV or directly: robin@actual-experience.com with any questions.","time":1435833151,"type":"comment"}