{"by":"skyscannerrec","id":9818652,"parent":9812245,"text":"SKYSCANNER <a href=\"http:&#x2F;&#x2F;www.skyscanner.net&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.skyscanner.net&#x2F;</a> Full Stack Engineers and Senior Full Stack Engineers - Edinburgh, Glasgow, Barcelona, Sofia, Budapest – ONSITE<p>Complex Problems Live in Travel: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=pUkYP5Pfefg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=pUkYP5Pfefg</a><p>Skyscanner is the world’s travel search engine with ambitions to be everybody&#x27;s personal travel assistant. As a full stack engineer, we want to employ your problem solving capabilities. Solving complex scalability challenges, proposing new design and systems solutions and all the while, instigating and promoting best engineering practices. To be really useful to us, you should have across the board experience – a bit of database, a bit of back end as well as some UX familiarity into the bargain – after all, if you don’t know what can go wrong, you won’t know how to fix it. We’re looking for exceptional engineers who can make difficult decisions and take ownership of a problem from end to end.<p>If you hate doing what you’ve always done but love finding new and better solutions, make our problems your problem. Apply today.<p>You can offer us:<p>A hunger to learn, a desire to meet challenges, a passion for technology and development, a commitment to applying engineering best practice to produce top quality solutions.<p>We can offer you:<p>An excellent career move.\nThe chance to work with great developers, in fact, great people across the board.\nThe space to be trusted to do what you do best and to make decisions that matter.\nThe potential to tackle big stuff, not small stuff.\nWhat do you need to apply? We’re looking for people across all levels of experience and we’re more concerned with what you can do than what you have done. As a minimum, a Computer Science degree or similar; experience in a web economy or other tech environment; proficiency in object-oriented programming, automated testing, front and back end web development and database technologies.<p>Take a look at one of our videos where you can hear from one of our full stack engineers speaking about the technical challenges he works on and life at Skyscanner: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ailLq2McoAE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=ailLq2McoAE</a><p>Our benefits include: bonus, pension, healthcare, flexible working, home country working, share incentives.","time":1435843562,"type":"comment"}