{"by":"nefaries","id":9818855,"parent":9812245,"text":"MANDIANT\nFull Time ONSITE - TS&#x2F;SCI with Polygraph Required - Annapolis Junction, MD<p>Join an industry leading team performing challenging and meaningful work.  Mandiant is supporting a critical customer mission to design, deliver, and operate a national network defense capability.  We have an immediate opening for a fully-cleared mid to senior Incident Response and Malware Analysis Consultant to provide ongoing breach detection, threat analysis, incident response, and malware analysis.  This is an evolving program and provides a great opportunity to influence its progression.<p>The ideal candidate will be fully cleared, have strong industry experience in developing and operating next generation defensive cyber operations to help improve the customer&#x27;s breach detection and mitigation capabilities, excellent communication and presentation skills with the ability to present to a variety of external audiences, capable of managing multiple tasks and priorities with divergent schedules, proactive and amicable personality, but also does not back down in the face of adversity, and has an understanding that this program is in its infancy and you will play a large role in development and refinement of its analysis and operations capability.<p>What we can offer you:\n  Great salary and incentives, internal training and conference opportunities, encouragement and support for speaking engagements, and career flexibility (though we ask for at least a year at this customer)<p>If you are interested, please visit <a href=\"https:&#x2F;&#x2F;www.fireeye.com&#x2F;company&#x2F;jobs&#x2F;jobdescription.html?gnk=job&amp;gni=8aa343974c1c5593014c5208f35c74c1&amp;jobtitle=Senior%20Consultant%2C%20Incident%20Response%20and%20Malware%20Analysis%20%28TS%2FSCI%20FSP%29&amp;loc=United%20States%20Annapolis%20Junction%20MD\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fireeye.com&#x2F;company&#x2F;jobs&#x2F;jobdescription.html?gnk...</a>","time":1435845362,"type":"comment"}