{"by":"secfirstmd","id":9824975,"parent":9812245,"text":"Videre - Operations Manager, Global, Full Time.<p>A dynamic, pioneering international NGO working in the worlds of media and human rights is seeking a talented individual to join its team in a key role as Operations Manager. It is a fascinating position that requires a highly responsible individual.<p>ABOUT VIDERE<p>Videre is a cutting-edge, fast-growing, international human rights charity that maximises the power of technology to achieve justice.We give local activists the equipment,training and support needed to safely gather verified video evidence of human rights violations and effectively distribute it to those who can create change. As a result of our actions, perpetrators have been brought to trial and their means of oppression exposed to millions of viewers worldwide. It has empowered oppressed communities to expose human rights violations to millions around the world and deter their repetition. With visible influence, this small organisation is uncommonly high-impact and benefits from an esteemed international reputation.<p>JOB PURPOSE<p>This key individual will work directly under Videre’s Senior Management Team. The role will involve carefully creating, training, maintaining, coordinating and directing network operations in the field. Work will be in various geopolitical areas that might be hostile and where telecommunications are poor and infrastructure negligible, the main emphasis of the role will be on precision, logistics and safety.<p>MAIN RESPONSIBILITIES<p>Managing logistics, operations and communication – Constant telecommunications management with partners, deal with urgent problems, manage networks on a 24&#x2F;7 basis where necessary, problem-solve to remove any obstacles to productivity and safety through all stages of operation – from planning to capturing visual data and broadcasting it. Support and ensure the welfare of all individuals involved in the projects under you.<p>Planning operations – Create plans to execute Videre’s vision and missions in its areas of operation, with guidance from the senior management team.<p>Training– Train networks to use overt and hidden cameras to create visual information. The training includes filming, gathering information, verification, operations and basic security when needed.<p>Identifying and recruiting – Find suitable partners to work with and create common ground for future engagement.\nDocumenting and reporting – Ensure all activities are recorded, documented and analysed. Monitor and report on all levels of activity to assess effectiveness, impact and progress of the organisation’s projects.<p>Find the full JD at:\n<a href=\"http:&#x2F;&#x2F;reliefweb.int&#x2F;job&#x2F;1061716&#x2F;operations-manager\" rel=\"nofollow\">http:&#x2F;&#x2F;reliefweb.int&#x2F;job&#x2F;1061716&#x2F;operations-manager</a>","time":1435925122,"type":"comment"}