{"by":"frabrunelle","id":9828879,"parent":9812245,"text":"MaidSafe.net [<a href=\"http:&#x2F;&#x2F;maidsafe.net\" rel=\"nofollow\">http:&#x2F;&#x2F;maidsafe.net</a>] | Troon, UK (allows remote)<p>- Rust Open Source Software Engineer [<a href=\"http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;90236&#x2F;rust-open-source-software-engineer-maidsafenet\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.stackoverflow.com&#x2F;jobs&#x2F;90236&#x2F;rust-open-source...</a>]<p>Job Description<p>Can you imagine a new decentralised Internet, free from corporations selling your personal details and private information for their profit, where users are in control of their data and all communication is secure, private and anonymous? What if this new network was comprised of the spare computing resources of the world’s Internet users and has years of planning and development behind it.<p>The company implementing the replacement for much of the Internet’s services is called MaidSafe and they plan a public launch of the platform later this year. This new network has generated much interest from the world’s technology press.<p><a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;07&#x2F;23&#x2F;maidsafe&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;07&#x2F;23&#x2F;maidsafe&#x2F;</a><p><a href=\"http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;kashmirhill&#x2F;2014&#x2F;04&#x2F;08&#x2F;beyond-bitcoin-crypto-ownership-companies-hope-youre-ready-to-decentralize-everything-on-the-internet&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.forbes.com&#x2F;sites&#x2F;kashmirhill&#x2F;2014&#x2F;04&#x2F;08&#x2F;beyond-bi...</a><p>As the platform approaches its first public release, MaidSafe are looking to strengthen their team with engineers experienced in producing open source software. MaidSafe are implementing their vision in Rust and knowledge of this new language is an advantage. A background in contributing to open source projects is essential and the successful candidate will also be able to demonstrate knowledge of multiple programming languages.<p>This role provides the opportunity to work for a cutting edge open source company with a big future, as well as the freedom to push your skills to the limit.<p>While an office based developer is preferred, this may be a remote position where for ease of collaboration, the candidate will be required to work between 09:30 and 17:30 UK time (British Summer Time) Monday through Friday.<p>Skills &amp; Requirements<p>- Commits have been made to verifiable open source repositories<p>- Experience in Rust preferred, but not essential<p>- Experience working within an iterative Agile development process<p>- A proven track record of submitting quality bug reports to open source issue trackers, preferably with bug fixes. Some links to examples would be great<p>- A presence on Stack Overflow, where you have asked or answered hard questions and been recognised by others for your answers<p>- Familiarity with revision control and hosted repositories<p>In addition to supplying a CV, a list of URLs (code contributions, stack overflow answers, mailing list posts) containing evidence of why you would be a great hire, is essential. It would be great if you could supply a github.com or sourceforge.net, or equivalent account for MaidSafe to review.","time":1435976698,"type":"comment"}