{"by":"zhwrd","id":9845702,"parent":9812245,"text":"Unata (unata.com) is a VC-backed, Toronto-based startup in the enterprise retail space. We are building the retail experience of the future. We work with large retailers to power their digital experiences, while personalizing each shopper’s content and offers based on their purchase history. We’re connecting the physical shopping experience with the best of the digital world. We are growing fast and need to scale our core product team. We are looking for the roles below.<p>Current stack<p>Backend: Python (Flask, SQLAlchemy, Celery, Numpy, Pandas), PostgreSQL, Cassandra, Jenkins CI, Redis, Memcached, CentOS<p>Frontend (including Mobile): Angular.js, Sass, Grunt<p>- Platform Engineer - Python experience, intermediate&#x2F;sr, understanding of service-oriented architectures (more info &gt; <a href=\"http:&#x2F;&#x2F;unata.com&#x2F;platform-eng\" rel=\"nofollow\">http:&#x2F;&#x2F;unata.com&#x2F;platform-eng</a>)<p>- Data Science Engineer - Application development experience, machine learning knowledge &amp; experience (more info &gt; <a href=\"http:&#x2F;&#x2F;unata.com&#x2F;data-sci-eng\" rel=\"nofollow\">http:&#x2F;&#x2F;unata.com&#x2F;data-sci-eng</a>)<p>- QA Engineer - Test automation, development experince, process minded, familiarity with CI systems like Jenkins (more info &gt; <a href=\"http:&#x2F;&#x2F;unata.com&#x2F;qa-eng\" rel=\"nofollow\">http:&#x2F;&#x2F;unata.com&#x2F;qa-eng</a>)<p>- Data Developer - Data integration development experience, detail oriented (more info &gt; <a href=\"http:&#x2F;&#x2F;unata.com&#x2F;data-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;unata.com&#x2F;data-developer</a>)<p>Why you should work for us:<p>- Competitive compensation and stock options, comprehensive health benefits, flexible paid vacation<p>- Relaxed work environment in downtown Toronto (King &amp; Bathurst), Work-from-home-Wednesdays, fun company activities<p>- Opportunity to make a big impact in digital retail! Your work will be seen and used by millions of retail customers!","time":1436279957,"type":"comment"}