{"by":"stan_sf","id":9875884,"parent":9812245,"text":"PowWow Energy - Redwood City CA - full stack or backend developer<p>Join our team and help ease the drought by helping farmers!<p>We are looking for a talented full stack or backend developer to join an award winning early-stage start-up. You&#x27;d be joining an experienced entrepreneurial team in creating software that delivers answers to farmers in the field to assist them in their daily operation, and as a by-product save significant water and energy.\nYou should be a team player with demonstrated ability to build applications. As a member of the software development team, you must be self-starting with the ability to help figure out what we need to do, then do it with a positive attitude. Our current software stack is JQuery and Google Maps on the client side, with Python &#x2F; Django on the server side, using PostGIS as the database.<p>Required skills:<p>* Minimum 5 years working professionally as a software developer, preferably with a SaaS product\n* Relational database and SQL experience, ideally with Postgres\n* Some Javascript&#x2F;CSS3&#x2F;HTML5 experience, preferably with JQuery and Bootstrap\n* B.S. in software engineering or computer science<p>Highly desired skills:\n* Operational experience with AWS\n* M.S. in computer science or experience as software lead in a VC-backed start-up<p>What&#x27;s in it for you?\n* Join an award winning start-up at an early-stage\n* Have an impact on agriculture and water sector\n* Room for growth and ability to help define the culture of the company<p>About PowWow Energy<p>PowWow Energy, Inc. (<a href=\"http:&#x2F;&#x2F;www.powwowenergy.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.powwowenergy.com</a>) is a leading innovator in the Agriculture &amp; Food sectors. Based in California, our team leverages Big Data and emerging Internet of Things technologies to provide simple answers to farmers in the field. By helping them manage risks in their daily operations, we help them save water and energy while improving their bottom line. Our first SaaS application, the Pump Monitor with smart leak detection™, was a Cleantech Open 2013 winner. We have since extended our capabilities using the same no-hardware, Software-as-a-Service business model to ease farming operations, and further improve water use efficiency and energy efficiency.<p>Please send resumes to jobs@powwowenergy.com","time":1436751299,"type":"comment"}