{"by":"eosher","id":9885567,"parent":9812245,"text":"NPR | Sponsorship Product Developer | Washington, DC | On-Site<p>See full description and apply here:\n<a href=\"https:&#x2F;&#x2F;careers-npr.icims.com&#x2F;jobs&#x2F;2441&#x2F;sponsorship-product-team---developer&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-npr.icims.com&#x2F;jobs&#x2F;2441&#x2F;sponsorship-product-...</a><p>We are looking for a talented and knowledgeable web developer to help us build sponsorship products that live up to the high standards of NPR&#x27;s digital efforts.  A person passionate about polyglot programming, web technologies, database development, RESTful APIs; often things that have not reached mainstream, yet. We are looking for a person who both learns fast, but can also figure things out independently and show us better ways for building complex, highly scalable systems on the web.<p>We are working to create a suite of new sponsorship products that bring value to the sponsor and to the user.  We need a web developer to help us find innovative ways to recognize the corporate sponsors that help keep NPR going.   You&#x27;ll be a founding member of a new product team focused on sponsorship at NPR.  You will have the opportunity to help define this team, while still working within the NPR Digital Media family.<p>Qualifications:<p>Basic skills required:\nFluency in HTML5&#x2F;CSS3, including media queries and Responsive Web Design techniques.\nFluency in writing functional Javascript code, not limited to jQuery programming.\nFluency in LAMP stack: Linux, Apache, MySQL, PHP.\nExtensive experience working with content-management systems.\nExperience working with ad servers (DFP Premium)\nAbility to work in Unix command-line over SSH terminal. Experience working with a version control system (SVN or Git preferred).\nBonus Points for:\nEvery additional programming language and framework you are fluent in.\nSignificant contributions to open-source projects Mad Node.js skills\nAddiction to writing code in Test-Driven Development style.","time":1436887194,"type":"comment"}