{"by":"hp685","id":9889199,"parent":9812245,"text":"Cisco is a leading networking, IT and software provider with annual revenues of $50 billion. We build innovative products that change how people work, live, play and learn.<p>We are building a complex Distributed Real-Time system that would run on 25K+ servers spanning the globe; running over a million concurrent applications and will form the bedrock of Cisco’s manufacturing process. \nIt would control Intellectual Property and security of our products and gather telemetry data throughout the life cycle of a product for real-time analytics to facilitate optimization&#x2F;process-control.<p>The software stack is built on Linux, using Python, Java, C++ and Cassandra. UI. and Analytics dashboards are developed using a mix of Backbone.js, React.js, JQuery and HTML5.<p>We are a very small, agile team within Cisco’s Supply Chain Division and we are looking for new university grads to join the team at our San Jose HQ.\nYou will have an opportunity to work on the cutting edge of the technology stack in a fast-paced environment.<p>We do offer excellent compensation, benefits and relocation assistance.<p>The ideal candidate will have:<p>•\t     Demonstrated Python&#x2F;C++&#x2F;Java and JavaScript experience;<p>•\t          In-depth understanding of Algorithms, Operating Systems and Programming Languages<p>•\t          Good analytical, problem solving and communication skills<p>•\t          Familiarity with Linux and Version control systems<p>•\t          Knowledge of JavaScript frameworks (a plus)<p>•\t          Knowledge of Cassandra&#x2F;No-SQL databases (a plus)<p>•\t     Knowledge of Jenkins&#x2F;CI framework (a plus)<p>•\t          Bachelors, Masters or PhD in Computer Science or Computer Engineering<p>This would be an excellent opportunity to work with an amazing and a fun team. The team is spread across North America and Asia, has a highly innovative posture and a casual-friendly working culture.<p>Please include your Resume and links to Github or academic project portfolio in your response.<p>Send your response to harshp@cisco.com","time":1436923572,"type":"comment"}