{"by":"pandamcbonesaw","id":9471505,"kids":[9471603],"parent":9471287,"text":"Ayasdi | Menlo Park, CA | Full Time | REST API Engineer<p>-- the pitch --<p>Ayasdi uses a pioneering approach to automatically discover insights from complex data. Founded in 2008 after a decade of research at Stanford, DARPA, and NSF, Ayasdi uses Topological Data Analysis (TDA) to unify best-of-breed machine learning approaches into a common framework without the need to write algorithms, queries or models. We’re building a platform to solve some of the world’s most complex data problems, are well funded by top-tier VCs and have a passionate team with a great culture.<p>-- position info --<p>As a REST API engineer on the frontend team you will help architect one of the most important products Ayasdi has to offer. The API allows customers to automate common processes and integrate the core Ayasdi functionality with their existing tools, in addition to being the data layer that all of our web applications use. You would be the second person on our API team, so you will have the freedom and flexibility to make large architectural decisions as the company grows.<p>-- requirements --<p>• Experience building and maintaining APIs used by demanding customers<p>• Ability to write comprehensive unit and integration tests<p>• Proficiency with the modern Java platform and patterns, including dependency injection, advanced annotation usage, and concurrency facilities<p>• Experience navigating the Java library ecosystem, in particular outside of JEE<p>• Familiarity with Jersey, Mockito, and code generation is a plus<p>• Familiarity with machine learning, statistics, or data visualization is a big plus<p>-- contact --<p>I&#x27;m on the frontend engineering team, but we are also hiring compute and backend engineers.\nFeel free to send me an email if you want to know more: danny@ayasdi.com\nOr head over to our careers page: <a href=\"http:&#x2F;&#x2F;www.ayasdi.com&#x2F;company&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ayasdi.com&#x2F;company&#x2F;careers&#x2F;</a>","time":1430490439,"type":"comment"}