{"by":"timmclean","id":9471510,"parent":9471287,"text":"Code for a Cause : Web Developer for Healthcare Non-Profit (work from home in Toronto, ON)<p>We Canadians are proud of our universal health care, but our healthcare system faces difficult challenges.  Our hospitals&#x27; staff use “enterprise”-quality software that is hostile to its users.  Doctors often struggle with the software’s interfaces, and are unable to access the information that they need in a timely manner.  Quality of care suffers.<p>KoNode is a small nonprofit software startup intent on fixing these problems.  We’re building a series of open-source applications to “fill the gaps” in existing processes, and help medical staff provide better care.<p>Our team is ready to expand, and welcome a new developer with ninja-like coding skills and a passion for improving users&#x27; lives. A short-list of great perks of joining our team:<p><pre><code>    - Work from home, on your own full-time schedule. Freelance freedom!\n    - A team experienced with  healthcare workflow &amp; users’ needs.\n    - Regular in-person meetings at Toronto’s Centre for Social Innovation.\n    - Strong network of healthcare, business, and programming consultants.\n    - Happy, helpful team atmosphere. Driven to make an impact.\n</code></pre>\n. . . and the goal we’re achieving together? Providing healthcare professionals (and beyond) with an accessible alternative to tedious, bulky, costly software.  When an automated solution doesn’t yet exist... well, we make one happen. Simple.<p>Sounding even better? Here’s a picture of KoNode on the technical side:<p><pre><code>    - Web (HTML&#x2F;JS&#x2F;CSS) + NodeJS (we use node-webkit, aka NW.js)\n    - Cutting-edge libraries including Lodash, Moment.js, React, and more.\n    - Modular design, piecing together apps using open-source and custom code.\n    - Collaborative version control and feature management on Git[Hub].\n    - Real-world testing &amp; feedback with network of health professionals.\n</code></pre>\nTeam members must be able to meet in downtown Toronto periodically.<p>Ready to apply? Contact us with your resume and portfolio at david@konode.ca","time":1430490451,"type":"comment"}