{"by":"richardhills","id":9471391,"parent":9471287,"text":"10to8 - <a href=\"https:&#x2F;&#x2F;10to8.com\" rel=\"nofollow\">https:&#x2F;&#x2F;10to8.com</a> - London, UK - Frontend Javascript Engineer<p>10to8 is an online booking system that helps businesses. We are an ambitious startup, based in London, looking for a javascript developer to join our engineering team. Visit <a href=\"https:&#x2F;&#x2F;10to8.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;10to8.com&#x2F;jobs&#x2F;</a> to apply.\nWe are passionate about cutting-edge technology and we want to make its benefits available to everyone, bringing it to places where it can have a dramatic impact and improve the lives of people.<p>Can you imagine a world, where no one missed their commitments? No forgotten dentist appointments, no late meetings, no last-minute cancellations or disappointing no-shows. Can you imagine if coordinating took much less effort, than organising your time now?<p>That world is possible with intelligent software like 10to8, which makes getting to the right place at the right time just happen. That’s the world we’re building with its customers right now.<p>We are looking to hire a javascript developer to join our dedicated engineering team in London. You’ll help develop new features for our web and mobile apps, used by thousands of small businesses in the UK and abroad. Our apps use a mixture of modern technologies, including React, websockets, HTML5, and BEM, and are largely asynchronous, with liberal use of AJAX. We will also soon start using React-native for our mobile apps.<p>You know the fundamentals of interaction and visual design; you can tell the best from the good. Above all, you can clearly articulate the reasons behind your logic.<p>If you are motivated, communicative and a good team player, we want to hear from you. You will play an active part in guiding the future development of 10to8 products. We strongly believe in autonomy and participatory decision-making; your code will be in production within a few days of starting.","time":1430489760,"type":"comment"}