{"by":"arcadia","id":9472170,"parent":9471287,"text":"Principal Software Engineer - Full Time | Burlington, MA | Arcadia Solutions (<a href=\"http:&#x2F;&#x2F;www.arcadiasolutions.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.arcadiasolutions.com</a>)<p>Arcadia Solutions is an EHR data aggregation and analytics company that helps our clients (generally provider networks and health plans) use their data to identify opportunities to reduce medical expense and improve care provided to patients - especially those most in need of medical interventions.<p>The web application is written in AngularJS with a Rails API and MSSQL back end. We&#x27;re also using CoffeeScript, Sass, D3.js, Rspec, Capybara, Jasmine, and Redis. The team in place consists of four Engineers who have been working with Angular for about 18 months and Rails for anywhere from 18 mos - 3 years. We started development on the application in November 2013 and worked&#x2F;learned alongside three consultants from thoughtbot for the first six months (thru initial launch). In the time since we&#x27;ve continued to enhance the product, which is rapidly emerging as a leader in the market.<p>In 2015 we expect to spend some time focusing on scaling the product - it&#x27;s currently deployed to fifteen clients of varying sizes, but we expect to add a handful more (and thus, many new users) to the application each month this summer. Based on what&#x27;s near the top of our product roadmap, we&#x27;re also expecting a few complex data modeling challenges. While the team in place is definitely up to the challenge, we&#x27;d love to add some technical leadership to the team. As such, we&#x27;re hoping to find someone with experience on Rails and Javascript frameworks (preferably Angular), experience scaling enterprise applications, and a commitment to testing&#x2F;quality.<p>Some perks of the position include a flexible schedule (WFH when you need to, work late one day&#x2F;leave early the next, etc), dedicated investment time (work on trainings, side projects, open source, etc. for at least one day&#x2F;month), snacks, pet-friendly office, company-sponsored events (we just spent a long weekend in Stowe, VT), and kick-ass teammates (at least we think so)!<p>You can apply for this position at the link below, or feel free to reach out to missy.carroll [at] arcadiasolutions.com with any questions.<p><a href=\"https:&#x2F;&#x2F;careers-arcadiasolutions.icims.com&#x2F;jobs&#x2F;1369&#x2F;principal-software-engineer&#x2F;job\" rel=\"nofollow\">https:&#x2F;&#x2F;careers-arcadiasolutions.icims.com&#x2F;jobs&#x2F;1369&#x2F;princip...</a><p>Hope to hear from some of you!","time":1430494968,"type":"comment"}