{"by":"tatiana317","dead":true,"id":9472231,"parent":9471287,"text":"Backend Cloud Engineer (Python) 4Catalyzer, NYC, NY On-site only<p>4Catalyzer <a href=\"https:&#x2F;&#x2F;www.4catalyzer.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.4catalyzer.com&#x2F;</a> is a Jonathan Rothberg company that is incubating medical startups. Jonathan is a serial entrepreneur with five successful exits under his belt, one at $800 million. He only starts companies that will one day save the life of someone he loves.<p>•\nDescription\n• 3 or more years of experience developing flexible cloud-based computing environments\n• Extensive experience with virtualization and cloud computing leveraging AWS\n• Comfortable with Linux system administration\n• Experience with scripting, management, and automation tools such as bash, Python, Perl, Chef Jenkins, and Bamboo\n• Experience developing high availability systems and software for fault-intolerant applications such as medicine, scientific computing, aerospace, and finance\nDetails\nSkills\nPython, Cloud Computing, Cloud Storage, Amazon EC2, Virtualization, Automation, Cloud Services, Linux System Administration, Linux, Amazon Web Services, Amazon S3, Amazon RDS, Chef, Cloud Security, Jenkins, Test Automation, HIPAA, HITECH &#x2F; HIPAA compliance analysis and assessment, Bamboo, HITECH &#x2F; HIPAA compliance analysis<p>Product\nAt 4Catalyzer we strive to transform 21st century medicine by solving today’s most challenging problems – across life science research tools, medical devices and therapeutics. We aspire to create significant societal impact and are motivated by the idea that our products will change the lives of people we love.\nFundamentally, we are focused on developing new types of sensors and pairing them with deep learning to get a window into biology and medicine that nobody has ever had before. We have audacious plans – but we have an unbeatable team and a founder that has disrupted biomedical science successfully more than once.\nIf you have experience in image reconstruction, mixed-signal IC design, high-speed electronics, nanophotonics, microfabrication, MEMs, biophysics, biochemistry, molecular biology, deep learning, cloud computing, embedded systems, or hold any dual degree with distinction along with computer science please contact us and “put a dent in the universe”.\nWhy Us?\nWe envision, incorporate, finance, support, and mentor a select number of startups that we are committed to make successful. Each startup is funded from the beginning for success, allowing the team to exploit new developments in physics, math, and the life sciences to create truly novel technologies and do the science enabled by being first.\nOur Startups have decoded the Neanderthal Genome, enabled what the New England Journal calls the new age of molecular medicine, helped crack the disappearance of the honey bee, sequenced the first personal genome, developed promising new drugs for breast cancer, been named three times as World Economic Forum Technology pioneers, and twice as Science Magazines top innovations of the year.\nThe startups have dedicated space and we work intimately with them to support them strategically, administratively, legally, commercially, with regulatory agencies, as well as offer them core design, engineering, software platforms, and a supplier and manufacturing network to accelerate their programs.","time":1430495344,"type":"comment"}