{"by":"jjarmoc","id":9472163,"parent":9471287,"text":"~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~<p>MATASANO SECURITY - Chicago. New York City. Sunnyvale.<p>Application Security Consultant<p>Full-Time, work visa sponsorship available<p>~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~<p>The security of computer systems has increasingly become an everyday concern.  The news all too often brings word of yet another compromise, exposing financial information, personal details, or simply salacious pictures.  Whatever the impact, it&#x27;s clear the technology industry has a problem, and there are few easy solutions.<p>Some seek legislation to impose harsher penalties on the responsible parties.  This ignores the fact that many of those responsible are outside the jurisdictions which seek to punish them.  In some cases, they may have tacit approval of their own government, or even be operating on their government&#x27;s behalf.  Others turn to established security products looking for antivirus and network filtering technologies to add protection.  This is an also an imperfect solution.  It places the defender in a reactive posture, responding only to those threats which have been previously detected, and for which countermeasures have been developed.  There&#x27;s no perfect solutions.<p>At Matasano, we believe the best way to combat security weaknesses is at their source; by discovering and remediating software vulnerabilities before others leverage them for ill effect.  Our clients see the value in this approach.  We&#x27;re engaged to work on some of the most interesting and important software on the planet.  Aside from identifying vulnerabilities, we help our clients identify the root cause.  Through this, they can adjust processes to reduce the likelihood of similar problems in the future, while increasing their ability to identify and correct them.  The goal is more resilient software.<p>We&#x27;ve assessed hot startup web applications, low level device firmware, mobile platforms, and everything in between.  With this breadth, we have need for employees skilled in frameworks like Node, Rails, Django, and Spring.  We need people comfortable with x86 and ARM assembly, reverse engineering, and binary protocol analysis.  If you&#x27;re skilled in a programming language with the letter &#x27;C&#x27; in it, that&#x27;s desirable.  Newer safer languages like Rust and Golang are in demand.  In short if you share our focus on helping secure our software ecosystem one piece at a time and want a chance to do something about it, we should talk.<p>Learn about our hiring process at <a href=\"http:&#x2F;&#x2F;www.matasano.com&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.matasano.com&#x2F;careers</a> or contact us at careers@matasano.com\nGet a taste for some of what we do at <a href=\"http:&#x2F;&#x2F;www.microcorruption.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.microcorruption.com</a> and <a href=\"http:&#x2F;&#x2F;www.cryptopals.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cryptopals.com</a>\nCheck out our blog at <a href=\"http:&#x2F;&#x2F;chargen.matasano.com\" rel=\"nofollow\">http:&#x2F;&#x2F;chargen.matasano.com</a><p>Next month, you&#x27;ll notice a change in these posts.  Since being acquired by NCC Group in 2012, Matasano has been working increasingly closely with our peers at iSEC Partners and Intrepidus Group.  The time has come to formalize this, by adopting a common name; next month  I&#x27;ll be posting under that name.<p>~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~&#x27;`^`&#x27;~<i>-,._.,-</i>~","time":1430494924,"type":"comment"}