{"by":"vivekpreddy","id":9472980,"parent":9471287,"text":"Entelo - San Francisco (SOMA), CA - Full-time - <a href=\"http:&#x2F;&#x2F;www.entelo.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.entelo.com&#x2F;</a> ; we&#x27;re unfortunately are not hiring remote or part-time at the moment as we&#x27;re committed to building a strong internal engineering culture at this stage before opening the doors.<p>Entelo&#x27;s mission is to help organizations build great teams. Our goal is to help any organization recruit for any of their open roles. We&#x27;ve currently built a powerful people search engine that indexes hundreds of millions of social profiles and looks for signals to predict who may be more receptive to a career change. It&#x27;s our belief that the the HR&#x2F;Recruiting world deserves many of the same powerful tools that sales and marketing organizations have had, and it&#x27;s our responsibility to deliver.<p>The Hacker News community has been great to us as we&#x27;ve made 4 engineering hires through the HN community. We care about building a thoughtful and considerate engineering environment with true work-life balance and personal flexibility (no one works more than 50 hours in the office and we&#x27;re flexible with work schedules).<p>We&#x27;re currently looking to rapidly expand the engineering team. Here are a few of our open roles:<p>-Sr. Data Engineer. Salary Range: $130k-180k<p>We&#x27;re looking for our first data team hire. The ideal candidate will have had experience building out analytics frameworks for which we can run large scale data analysis on. The person that fills this role will work alongside our VP of Engineering to build the data team long term and will be expected to have their own opinions on how to build an analytics framework from the ground up. We&#x27;re currently using a combination of Scala, MongoDB, ElasticSearch, AWS, Amazon Redshift and are open to &quot;big data&quot; technologies such as Hadoop, Storm, Kafka, etc.<p>-Sr. Backend Engineer&#x2F;Architect. Salary Range: $140k-180k<p>We&#x27;re looking for someone to own our backend infrastructure. We index hundreds of millions of profiles, and this requires crawling, parsing, normalization (data is semi-structured) and matching of these social profiles. We&#x27;re currently using a stack that includes Scala, MongoDB, Golang, Java and AWS although we&#x27;ve been considering using Amazon&#x27;s new Postgres solution.<p>-DevOps Engineer. Salary Range: $110k-140k<p>We&#x27;re looking for our first dedicated DevOps engineer as we&#x27;ve currently been doing DevOps by committee. We&#x27;re looking for someone that isn&#x27;t rigid in thought and is open to using tools&#x2F;technologies to solve our internal upkeep problems. We take a software-centric approach to DevOps and do try to use a modern stack here: Docker, New Relic, Loggly, PagerDuty, Rails, ElasticSearch but we&#x27;re open to those that may have more traditional DevOps experience but open to using newer technologies.<p>-Full-Stack Rubyists. Salary Range: $100k-$170k (wide range depending on experience and ability to play some of the other roles)<p>We&#x27;re always in the market for talented full-stack engineers. Our stack includes RoR, MySQL, AWS, Javascript, Bootstrap, Redis, ElasticSearch<p>If you&#x27;re interested, please don&#x27;t hesitate to reach out to me directly at vivek at entelo.com. I head up recruiting here and will make sure to get you in touch with our VP of Engineering as quickly as I can!","time":1430500464,"type":"comment"}