{"by":"pjsugi","id":9472164,"parent":9471287,"text":"InVenture - Los Angeles, CA (Santa Monica) - Data Scientist - Full Time or Intern<p>InVenture is a world leader in providing direct loans and financial services in emerging markets. We are a global team with diverse backgrounds who are singularly focused on using technology, data and customer-centric approach to meet the financial needs of the 2+ billion people of the emerging global middle class.<p>Investors include Lowercase Capital and Google Ventures.  We are Fast Company’s #1 most innovative company in money, #13 overall.<p>We are looking for people to join our data science team who have the following qualities.\n- Problem solver.  You thrive on finding novel solutions to hard problems.  These problems may have ranged from extracting a new dataset from an unexpected source, to building cohorts for customer retention analysis, or the NY Times saturday crossword.\n- Expert.  You have domain expertise.  Tell us about the genetic algorithm you implemented to find a solution to your NP-hard problem, or the hobby that keeps you busy on nights and weekends.\n- Curious.  You aren’t content until you understand why the features you have built have the explanatory power they do, and why they aren’t just a spurious correlation.\n- Communicator.  You’ll be the expert in your field.  Can you explain it to us in laymen’s terms?\n- Education.  Masters degree in a quantitative field, or relevant experience and&#x2F;or an impressive Kaggle profile.\n- Language.  We are language agnostic and have expertise in python, R, SQL, Spark, MATLAB, and Stata.  We build visualizations using d3, ggplot, matplotlib, seaborn.  Huge bonus points if you are fluent in Swahili ;).<p>Why should you join?\n- Take it from people who have build models and studied problems ranging from microfinance to global climate change: we are tackling an incredibly hard problem with huge social and financial impact.  The impact of our models is both intimidating and inspiring.\n- We leverage a unique, diverse, and deep data set.  You’ll be surprised by what connections we’ve found between our different data sources.  Surprise us by what you will find.\n- You will own a model, or multiple models, whether building a country-level credit model from scratch, or integrating new data sources into our existing underwriting models.\n- Amazing company culture. Our employees come first as indicated by our “Employee Awesomeness” program. We do lunch and learns, provide a flexible work schedule, and have regular team outings and happy hours. Our smart, passionate team is the backbone of our culture, and is what differentiates us from others making it a special place to work.\n- And btw, our customers love us: inventure.com&#x2F;love<p>Contact peter@inventure.com and please include the hacker news in the subject line.","time":1430494924,"type":"comment"}