{"by":"Curaladie","id":9473251,"parent":9471287,"text":"Curalate www.curalate.com (NYC, Seattle or Philly)\nFT Fullstack engineers<p>WHO WE ARE:\nCuralate is the leading marketing and analytics suite for the visual web and a partner to more than 500 of the world’s most-loved brands. We’re a passionate team of visual thinkers, makers, and storytellers dedicated to helping brands create authentic connections with consumers through images. And we’re building something really powerful.<p>Much like the brands we work with, our people are nothing short of inspiring – and we’re looking to grow our team. If you’re scrappy, creative, curious, and FUN, then we think Curalate could be the place for you.<p>WHAT YOU&#x27;LL DO:\nJoin our team of 17 in tackling some of the gnarliest problems out there at the intersection of computer vision and big data.<p>You&#x27;ll be expected to dive into our stack and toolkit, and start shipping code on day one. We&#x27;re not hiring code monkeys; you&#x27;ll be given substantial feature ownership, and we&#x27;ll expect you to contribute product ideas as well as code.<p>OUR STACK: \nWe&#x27;re not language zealots; we believe in using the right tool for the job, and are comfortable with a polyglot codebase. That said, today we lean on:<p><i></i>Languages: Scala, Javascript\n<i></i>Frameworks: Storm, Lift, Scalatra, Akka\n<i></i>Infrastructure: AWS\n<i></i>Databases: Cassandra, MySQL (RDS), DynamoDB, Redis, Memcached\n<i></i>Front End: jQuery, Bootstrap<p>(Production experience with any of these technologies is not required. However, candidates will, at a minimum, want to have experience with an object-oriented language like Java, C++, or C#).<p>ABOUT YOU:\nAlthough experience with our existing technology stack is great, we&#x27;re much more interested in hiring developers with exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. While we&#x27;re not looking for any specific industry experience you should have at least two years of experience and come prepared to join a fast-moving team. Above all else, we&#x27;re looking for others who are as excited about the potential in this space as we are, and who will be willing to join us in moving fast and breaking things as we execute against that vision.","time":1430502791,"type":"comment"}