{"by":"rockymeza","id":9473757,"parent":9471287,"text":"# Lead Mobile Developer<p>Fusionbox is a software development agency located in beautiful Denver, Colorado. We are committed to the open source community and we&#x27;re serious about architecture and design at every level of the stack.<p>We&#x27;ve built our name on Python development and security, but now we are looking for an experienced mobile developer to support our clients more fully.<p>## Job Description<p>You will be in charge of the iOS stack, working closely with the backend engineers and the designers to deliver top-quality products to clients.  Ideally you are also fluent in Android application development.<p>At Fusionbox we open source anything not core to a client&#x27;s business. Our rule is: if you&#x27;ve used a piece of code in more than one project, it&#x27;s time to open source it.  So you&#x27;ll be tasked with maintaining your open source contributions.<p>Finally, you will be expected to have opinions. If you see some aspect where Fusionbox could be improved, whether it be in the engineering process or in the way the company is run, patches welcome. You understand iOS conventions and best practices and are willing to defend them.<p>## Requirements<p>We are looking for an iOS developer with at least 3 years of software development experience. You don&#x27;t have to be an expert in all of the following subjects, but if you feel comfortable with about half and you are interested in learning about the other half, please get in touch.<p><pre><code>  * Experience with RESTful integrations\n  * At home with version control\n  * Understanding of relational databases and data normalization\n  * Knowledge of software security, including common attacks and how to prevent them\n  * Love of open source\n  * A need to do things The Right Way®\n</code></pre>\nYou would like to get paid to write open source software.<p>For more information, contact info@fusionbox.com<p>Please do not contact us if you are a recruiter or outside of the United States.","time":1430506968,"type":"comment"}