{"by":"alphataraxian","id":9473786,"parent":9471287,"text":"Alphataraxia | Washington DC | Developer<p>Alphataraxia Management is a fast-growing investment management group with offices in both Washington DC and Los Angeles.  We operate with a start-up model, using small teams and few layers of management to rapidly identify, understand, and capitalize on opportunities in the energy space.  We deploy our investors’ capital across a diversified set of markets where rigorous quantitative analysis of big data can provide an edge.<p>We are looking for hard-working candidates with a strong programming background to help us continue to build out our back-end data collection and storage systems.  As performance merits, the role would expand into taking ownership of parts of the firm&#x27;s system infrastructure, and performing data analytics.<p>Our greatest advantage is that we offer dramatically higher rates-of-learning than are found in more traditional roles.  We expect candidates to be given a high level of responsibility and freedom.  Applicants with a strong programming background will thrive in our information-rich environment.<p>Duties and Responsibilities:\n- Automate the import of data from a variety of different data vendors and a variety of different data formats into our proprietary tools and databases\n- Work independently in the development, testing, implementation and maintenance of complex systems with fast turnaround. \n- Provide support and reactive development for the investment teams; often by creating in-house data visualization tools<p>Minimum Qualifications:\n- Strong understanding and experience with a back-end programming language\n- Familiarity using MySQL, Oracle or similar relational database\n- Ability to develop on Linux and&#x2F;or Windows\n- Willingness to follow our code precedents, conventions, and documentation standards\n- At least a BS in Computer Science, Computer Engineering or an equivalent degree\n- Willingness to work in collaborative environment<p>Ping us at careers@alphataraxia.com","time":1430507173,"type":"comment"}