{"by":"the_watcher","id":9473638,"parent":9471287,"text":"Survata, San Francisco, CA<p>Survata sells consumer datasets to businesses. We’re a San Francisco startup attacking the $40 billion market research industry by making a complex &amp; bureaucratic process into a simple &amp; painless one.<p>Full-stack Software Engineer\nOur systems are are more complex than they originally seem. From a survey-building tool, to an ecommerce platform, to an ad network, to a data analysis tool, our systems have to do a lot to deliver big value to our clients. You’ll add a lot of features in a short amount of time. You’ll build them quickly, but you’ll make sure you’re keeping the code base clean. You’ll build them from the DB all the way up to the CSS, with the bulk of the heavy lifting being in Javascript. Our focus is on keeping things simple for our clients, so you’ll take that to heart. You’ll work with our entire engineering team to bring our systems to the next level.<p>About you\n* You love to build software that drives the bottom line for a business.\n* You want to work with other smart, hard-working engineers to solve big problems.\n* You have strong opinions about what makes a good API. You not only help build ours, but you’re a customer of it, so you’ll help keep us in line.\n* You’ve probably used several Javascript frameworks, and can rattle off their strengths and weaknesses. (We use Angular, which we sometimes like and sometimes hate.)\n* You thrive on the energy of operating in a fast-paced, ever-changing startup atmosphere.<p>Senior Backend Software Engineer\nOur systems are are more complex than they originally seem. From a survey-building tool, to an ecommerce platform, to an ad network, to a data analysis tool, our systems have to do a lot to deliver big value to our clients. You’ll help set up our systems for the growth to come. It might be using memcached when deciding what survey to show to on our network. It might be automatically determining what relationships are statistically significant. It might be augmenting the data we provide with data from other sources. No matter the project, you’ll jump in with both feet, architecting it just enough to deliver in the short term and set us up for the long term.<p>About you\n* You’ve built big systems that drive a business.\n* You love data &amp; analytics and can build systems that help shine a light on the story behind that data.\n* You understand that your software runs on computers (but you architect things so you spend the minimum amount of time possible thinking about that).\nREST, JSON, and APIs make you happy (even though the capital letters are annoying).\nYou’re not afraid to build all the way from the DB up to the CSS (even though you’ll spend most of your time on the server).\n* You’ve used a lot of AWS services. You love some, are frustrated by others, and can’t wait to try the next one.\n* You thrive on the energy of operating in a fast-paced, ever-changing startup atmosphere.<p>To apply, send a resume or LinkedIn profile to jobs@survata.com.","time":1430505889,"type":"comment"}