{"by":"jtheory","id":9473911,"parent":9471287,"text":"Patients Know Best -- REMOTE ONLY. At present we all work core hours in London time, give or take a few hours.\nWe&#x27;re hiring mid-level developers -- full-stack, really (we&#x27;re all full-stack more or less!) but we&#x27;ve notice we&#x27;re weaker on front end, so we&#x27;ll be particularly interested if you have solid experience with some of these: strong cross-browser support (we have to support more than the &quot;evergreen&quot; browsers), i18n (we can&#x27;t assume text length is constant, or even RTL...), multi-device&#x2F;resolution support, accessibility, jQuery for auto-save and that sort of thing; HighCharts for graphing.<p>For the rest of the stack: Java experience is important; beyond that, we can generally show you around (more below).  We&#x27;re mostly a Java enterprise stack, actively rebuilding and splitting up functions, actually. Recently we&#x27;ve scripted the setup of the entire stack (or individual servers), including using Vagrant to easily set up a complete environment locally for each developer.<p><i>More about PKB</i><p>I&#x27;ve worked in a lot of different sectors since I first started writing code in the late 90s, including education, b2b supply chains, POS systems, e-commerce, banking, and anti-spam.<p>PKB has been head-and-shoulders above the rest in everything I care about.<p>We&#x27;re building something that actively, directly, improves the lives of people in general -- not selling more stuff, helping others sell more stuff, or making comfortable people a bit more comfortable. If you&#x27;re interested in PKB&#x27;s growth, funding, profitability, contracts, etc., ask -- our CEO is also active on HN. I&#x27;m the CTO.<p>We&#x27;re pragmatic about work&#x2F;life balance. I work from France, or sometimes from Malaysia, where my in-laws live. Almost half of the developers have small children at home -- personally, I get my kids up in the morning, sometimes see them at lunchtime, then take over late-afternoon &amp; evening (while my wife works), and I fill in a bit of extra working time around the edges as needed. We&#x27;re collaboratively figuring out what works (e.g., how many working hours should you overlap to collaborate effectively?), and planning our lives and our work around what&#x27;s effective, not around some photocopied list of rules stapled to a cubicle wall. One of our developers only codes part time (and occasionally takes long leaves of absence), because he&#x27;s also a theatre director.<p>Culture -- we&#x27;re live in various parts of the UK, central France, Bangalore, and Vienna; we range in age (though I don&#x27;t actually know everyone&#x27;s ages, so I can&#x27;t say exactly!). We&#x27;re not all native English speakers -- but communication skills trump even technical skills for remote teams, so we all understand, speak and write English easily and with the confidence to interrupt if we didn&#x27;t catch something. We collaborate, not compete -- let ideas fight it out, but we&#x27;re on the same team. We&#x27;re not the sort of group to tell dirty jokes, or tales of how drunk we got last weekend; though we do have interesting stories to share.<p>If we sound like a good match, get in touch: <a href=\"https:&#x2F;&#x2F;patients.bamboohr.com&#x2F;jobs&#x2F;view.php?id=4\" rel=\"nofollow\">https:&#x2F;&#x2F;patients.bamboohr.com&#x2F;jobs&#x2F;view.php?id=4</a> (I&#x27;m also contactable directly -- see profile -- but I get a lot of email).","time":1430508231,"type":"comment"}