{"by":"IDislikeNames","id":9473758,"parent":9471287,"text":"Microsoft | Seattle | Principal Engineer &#x2F; Architect<p>The Application and Services Group (ASG) is looking for a passionate and influential Principal Development Engineer and expert in cloud computing and cloud services. As a leader you will have experience building and delivering scalable web services and data platforms. You will have expert understanding of cloud service architecture and experience delivering services at scale.<p>Your role in the CTOs office of ASG will involve designing and delivering next-generation experiences that take the cloud for granted. In this role, you’ll deal with internet-scale systems, unique distributed graph problems, and have the opportunity to influence scenario and interface design at the ground level.<p>Ideally you’ll have a deep understanding of how the Web works, including Content Distribution Networks (CDNs), security best practices, networking, and how search engines and web-scale indexes work. You’ll need to be comfortable programming at all levels in the stack, and be knowledgeable from the UI all the way down to distributed consensus protocols such as Paxos.<p>We are looking for passionate, energetic and collaborative developer interested in having influence across ASG and across the company. Candidates for this impactful role should enjoy solving complex problems, designing and developing distributed systems and services, working across the company with key stakeholders, directly improving customer experience, security, performance, and reliability of scalable cloud systems.<p>At Microsoft we are structured around a single strategy to create a unified family of devices and services. The Application and Services Group is the central hub for this strategy, and the CTO’s office is driving key aspects of this work.<p>A successful candidate will have:\n- 10 + years of Industry experience in developing and implementation of cloud services at scale\n- PhD, BS&#x2F;MS in Computer Science or equivalent industry experience\n- Demonstrated CS fundamentals, fluent in systems development, multi-threaded programming, strong experience in architecting systems at scale\n- Demonstrated technical design, problem solving and debugging skills<p>Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, veteran status, genetic information, or any other protected status.","time":1430506972,"type":"comment"}