{"by":"aaronkwhite","id":9473049,"parent":9471287,"text":"Workiva | Denver, CO | Interaction Designer (Mid &#x2F;Sr) | Full-Time<p>About Us\nWorkiva is reinventing financial and managerial reporting. Our cloud-based applications enable real-time collaboration for the most important and challenging reports, including SEC filings. The easy-to-use interfaces and controls, specifically designed for financial professionals, make the Wdesk product platform the top choice of the most influential organizations in the world.<p>About You\nInteraction Designers (IxD) at Workiva are responsible for designing and prototyping superior user experiences across the entire product suite. IxDs work closely with Customers, Engineers, Product Managers and User Researchers to discover, validate, design, prototype, test, and iterate on products that ship continuously.<p>What You&#x27;ll Need\nYou have some serious design skills, and the track record of shipping user driven designs and experiences that have delighted your users. You are obsessed with creating great products that enrich and improve the lives of real people. You enjoy utilizing the best methodology to fit the problem, from sketching and whiteboard to bending the Lean Canvas to your will in order to validate opportunities that are quickly translated into the product backlog.<p>Your safe place is in front of Illustrator&#x2F;Sketch, where you can quickly produce wireframes, user flows, lightweight personas, mockups and production ready assets. You also possess truly inspiring communication skills, and are constantly iterating on your communication methods to be as effective as possible.<p>View full posting: <a href=\"https:&#x2F;&#x2F;www.workiva.com&#x2F;content&#x2F;interaction-designer-3\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workiva.com&#x2F;content&#x2F;interaction-designer-3</a><p>Website: <a href=\"http:&#x2F;&#x2F;www.workiva.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.workiva.com</a>","time":1430501061,"type":"comment"}