{"by":"klistwan","id":9474188,"parent":9471287,"text":"Software Engineer<p>Kira Talent (www.kiratalent.com&#x2F;about&#x2F;) - Toronto, Canada<p>Full-Time<p>Our mission is to help schools predict their most successful students. We&#x27;re used by almost half of the top MBA programs across North America, and are quickly growing in engineering, undergraduate business and science programs.<p>Applicants complete timed and written assessments created by the school, that test non-cognitive competencies like leadership, creativity and empathy. Admissions teams can then better evaluate students and build a stronger program overall.<p>We&#x27;ve raised over $3M of financing, and are growing our engineering team in all areas (full-stack web, infrastructure, etc).<p>Here&#x27;s what we&#x27;re working on: \n- architecting and building global infrastructure to scale our video recording and streaming\n- workflow features that help admissions team assign applicants to certain reviewers, and manage their reviewing teams\n- capturing analytics data about how our users use the product, and making decisions internally - data trumps everything!<p>Here&#x27;s what we use: Python (Django), JavaScript (jQuery, RequireJS, FlightJS), MySQL, Celery, RabbitMQ, Wowza, AWS, ActionScript.<p>You’d be a great fit to our team if you have: \n- 2+ years of software engineering experience in production\n- Proven yourself as an A+ engineer through great work results, interesting hobby projects, open source contributions, or superior academic results\n- Deep experience with multiple programming languages including Python, C, Java, Ruby, JavaScript<p>Since we’re a small team (you’d be #16), we have lots of fun together! We host bi-weekly lunch &amp; learns, beer o’clock on Friday afternoons, board game nights every few weeks and have done tons of activities outside of work (i.e. wine tasting, cottage retreat, etc).<p>My name is Konrad, and I&#x27;m one of the founders! Send me a note at konrad@kiratalent.com if you&#x27;re interested!","time":1430511104,"type":"comment"}