{"by":"srverma","id":9474017,"parent":9471287,"text":"Palo Alto, Ca - Branch Metrics - Full Time - Solutions Engineer<p>As a Branch Solutions Engineer, your job is to inspire and equip customers to build transformational app experiences using the Branch SDK and API. As the primary technical contact for a diverse customer base, Branch Solutions Engineers are highly competent IT&#x2F;software generalists who share knowledge during all stages of the customer’s lifecycle.<p>A few of things you&#x27;ll find yourself working on:<p>- Educate customers, from developers and product managers to C-level executives, on what is possible with Branch.\n- Understand customer requirements and communicate the business value of solving technology problems using mobile deeplinking technology.\n- Create technical content to show customers how to implement specific use cases or best practices for new technologies.\n- Prepare demos and proof of concepts to demonstrate various use cases for Branch&#x27;s SDKs and API.\n- Distill and communicate customer needs and product feedback to Product Management, Engineering, Marketing and Sales.\n- Develop feature requests for high value partners.\n- Document the architectural solutions that customers have designed and deployed for internal use.\n- Position yourself as a thought leader in the mobile growth space. Prepare talks for industry events. Collaborate on blog posts, technical articles and other content with Branch&#x27;s marketing and sales groups.<p>We&#x27;re Looking for Someone With:<p>- iOS and Android programming experience (building apps or SDKs)\n- Three to ten years professional experience in a client-facing technical role.\n- Professional software engineering experience preferred. Experience in the design, configuration, deployment and debugging of mobile applications and SDKs is a strong bonus.\n- A firm understanding of the technology stacks common to the mobile and web ecosystem.\n- A world class communicator. Confident dispensing knowledge to a highly skilled and experienced audience including C-level executives.<p>Branch (branch.io) is a deeplinking and tracking technology that helps mobile developers attribute app installs, optimize and create invite systems, and do smarter in-app sharing through our unique device fingerprinting and deep linking technology. We dynamically generate short URLs on the fly that pass and track data from the originating source through install, across devices, and across platform. We use this technology to provide brands a deeper insight into app installs, more personal customer acquisition, and better engagement of users with our variety of SDK features. Our business is growing rapidly, is loved by our customers, and would provide a very rare opportunity for someone looking to get the true entrepreneurial experience. You’d be joining at a time when we&#x27;re growing from 25 to 50 post Series-A.<p>Email sahil+hn@branchmetrics.io if you&#x27;re interested. Please attach a resume.","time":1430509320,"type":"comment"}