{"by":"wolfmen","id":9475679,"parent":9471287,"text":"Technical Account Manager&#x2F;Engineer | San Francisco, Singapore, Boston | Full-time<p>Nanigans is looking for a Technical Account Manager &#x2F; Business Operations Engineer to join our growing teams worldwide. Everyday Nanigans processes hundreds of millions of mobile installs, purchases, and other actions across thousands of websites and mobile apps. The Technical Account Management (TAM) team is responsible for ensuring that incoming data is integrated correctly into the Nanigans platform to allow our clients to make real-time data-driven advertising decisions.<p>What you will be doing\nYou will be an expert at the inner workings of our advertising automation software, and will advise our users on how to seamlessly integrate our SaaS solution into their website, mobile app, and&#x2F;or measurement system. You’ll consult with a variety of companies, from small, savvy venture-backed startups to the largest eCommerce, gaming, and digital brands on the internet. Example engagements within this role include–but aren’t limited to–configuring Nanigans to ingest real-time events from websites and mobile apps, supporting our mobile SDKs and other measurement solutions, and leveraging SQL to troubleshoot integration issues.<p>What makes you perfect for the this role\n2-5 years experience in a related role or industry.\nNew grads with technical coursework or side projects are also encouraged to apply.\nFamiliar with HTML, Javascript, and&#x2F;or Web Development Concepts (REST&#x2F;GET&#x2F;POST&#x2F;HTTPS).\nExperience extracting data from relational (MySQL&#x2F;SQL) or big data (Hadoop&#x2F;Hive) data stores helpful. Don’t know SQL? That’s okay. Tell us why you want to learn it.\nComfortable reading source code and&#x2F;or programming in languages such as Python, PHP, Objective C, or Java. If you can code (you’ll have that opportunity) or want to learn how to do so, a big plus.\nPassion for fast-paced, start-up environments. If you use Reddit, Hacker News, or have a grab bag of GIFs ready–a big plus.\nOccasional travel. We have offices in Boston, New York, San Francisco, London, Seattle, Singapore, and Sydney and clients in over 25 countries.\nA few extras that would really put you on top\nExperience with advertising technology and tracking, preferably in both mobile and desktop environments a plus.\nFamiliarity with digital advertising industry concepts and terminology a big plus, although you can also learn this at Nanigans. What is does CTR, CPM, or CPC stand for? What’s the difference between an SSP, DMP, and DSP?\nBig Data experience an added bonus.\nFamiliar with attribution &#x2F; server &#x2F; measurement &#x2F; etc advertising solutions such as DoubleClick, MediaPlex, BrightTag, Adeven&#x2F;Adjust, or Omniture a big plus.\nFluency in another language (such as Mandarin, German, Portuguese) a plus.<p>Interested? Apply here: <a href=\"http:&#x2F;&#x2F;www.nanigans.com&#x2F;jobs&#x2F;?p=job%2FoOsS0fwS\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nanigans.com&#x2F;jobs&#x2F;?p=job%2FoOsS0fwS</a>","time":1430535061,"type":"comment"}