{"by":"joelm","id":9476183,"parent":9471287,"text":"Bigleaf Networks | Portland, OR | Lead Software Engineer<p>We provide internet redundancy and optimization, keeping businesses connected to the cloud across multiple ISP connections. Our proprietary platform uses Software-Defined-Networking technologies to provide seamless failover and dynamic application prioritization.<p>We need someone to join our team to handle:<p>• Software Projects: You&#x27;ll be responsible for driving the development of new systems, features, and bug-fixes; coordinating people and resources to ensure projects are done excellently and on-time. You’ll lead the technical development of our software and systems forward, navigating challenging projects and complex decisions.<p>• High-availability software design, development and deployment: Our customers purchase our service to improve their network reliability and performance. In this role you&#x27;ll carefully brainstorm, design, build, and deploy systems that are fault-tolerant, efficient, fail gracefully, and solve problems in creative ways. You should have the ability and vision to solve challenging business needs through artful and scalable software and system designs.<p>• Troubleshooting: Our software has to run efficiently, and our network has to run almost flawlessly. You&#x27;ll spend time diagnosing problems in code and with Linux system integration, testing code updates, and helping with network operations, all to ensure our customer&#x27;s don&#x27;t have to think about their internet (because it always works).<p>• Linux Systems Development: We run a software-based network that relies extensively on Linux. You will help ensure that these systems are designed and implemented in a scalable and reliable manner, with appropriate security measures in place.<p>For more details see <a href=\"http:&#x2F;&#x2F;www.bigleaf.net&#x2F;careers&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bigleaf.net&#x2F;careers&#x2F;</a><p>If this sounds of interest to you, please email me at joelm@bigleaf.net","time":1430550370,"type":"comment"}