{"by":"JabavuAdams","id":14461566,"kids":[14471554],"parent":14460777,"text":"I can&#x27;t comment on the back-end jobs, but I did interview at Uken a couple of weeks ago, with bizarre results.<p>I was interviewing for a Team Lead role. When I mentioned to people in my network that I was interviewing at Uken, they generally told me to steer clear. I decided not to pay much attention to this, since I knew the company had a couple of rough &#x2F; cancelled projects a couple of years ago. I decided to look at them through fresh eyes. Also, I was excited to take on a formal team lead role, as I have often performed these duties informally, and I&#x27;m getting older.<p>The first set of interviews went well. There was a minor coding test and I seemed to ace it. The role would have been all about C# with Unity, but I had my choice of coding language for the question, and chose Python. One of the interviewers that day seemed to imply that the project I&#x27;d be taking over had some serious code quality issues. To me this was an opportunity, rather than a turn-off. I&#x27;d have a chance to make an immediate impact, I thought.<p>Then came the second set of interviews. First, I talked to the CEO. That seemed to go well, and got me further excited about the role. The next step was white-boarding with the other team lead (not the one from the first tech interview).<p>The question was to architect &#x2F; design a card and deck API in C#. I felt well prepared for this, as I&#x27;ve worked on card &#x2F; casino-like games in the past. Before getting very far in, he threw me a curve-ball: you should also support Magic-style collectible card games. He kind of seemed to be making things up as we went along -- it seemed pretty clear that he hadn&#x27;t run through this exercise himself. By the end of the interview, he was saying things like &quot;maybe I shouldn&#x27;t have thrown in the Magic requirement&quot;.<p>It could have gone better. I don&#x27;t think I aced it, but I also don&#x27;t think I did poorly. I made a couple of unforced errors e.g. defining enums where I got confused between C++ and C#. I also started to use an ArrayList instead of a List&lt;T&gt;.<p>The exercise didn&#x27;t test any of the advanced or esoteric features of C#. In fact, the interviewer said that they don&#x27;t use advanced features. They just use plain-vanilla C# because they have a lot of interns, and frankly he didn&#x27;t know Unity when he started the job.<p>So, I leave thinking, &quot;well, I could have done better, but they seemed satisfied&quot;.<p>A couple of days later, I get a call from HR stating that my knowledge of C# is not sufficient. Having a C# expert is critical to the role. Keep in touch...<p>Now, keep in mind the interviewer&#x27;s statements re: C#. Also, C# is a dead-easy language. Also, I taught C# using Unity, for game programming for a couple of years. But apparently I don&#x27;t know C#.<p>Had they said, we weren&#x27;t satisfied with how well you architected the solution, I would have found that disappointing, but not bizarre. Maybe this was lost in translation between the dev and HR?<p>But, here&#x27;s the thing. I mention my weird interview to some friends, without naming the company. A friend asks &quot;was that Uken?&quot;. Apparently he interviewed there within the last few months for a Senior Dev role. He aced the first technical test (same problem as me), after being told by HR that there would be no technical test that day. He even implemented unit tests, and they all passed to the interviewer&#x27;s satisfaction. A day or two later, he gets feedback that he did not pass the technical test.<p>So, something&#x27;s up. Whether by accident, or on purpose, these guys seem unable to hire good people. I&#x27;d be cautious about burning any time on them. Of course, YMMV, anti-loops, etc.","time":1496333576,"type":"comment"}