{"by":"fabiob87","id":14468278,"parent":14460777,"text":"netzstrategen | Full Stack Web Developer | Barcelona | Fulltime | ONSITE<p><a href=\"http:&#x2F;&#x2F;www.netzstrategen.com&#x2F;suchen&#x2F;full-stack-web-developer-phpjs-mw&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.netzstrategen.com&#x2F;suchen&#x2F;full-stack-web-developer...</a><p>Keywords: Git, Drupal, Elasticsearch, WordPress, Memcached, Varnish, MySQL, PHP, JavaScript, HTML5, CSS, gulp, Sass, npm, Composer, WooCommerce, Drupal Commerce, PHPUnit<p>Are you up to date with latest web technologies, do you love to write clean code and find architectural solutions for challenging problems? Do you have a sympathy for UX and a passion for learning new methodologies? Do you love what you do?<p>Join our team in Barcelona! We are looking for you:<p>-&gt; Open Source - contribute upstream &amp; gain reputation\n-&gt; Make Impact - build innovative sites used by millions of people each month\n-&gt; Strive for Quality - operate in a team focused on pragmatic and clean solutions\n-&gt; Interdisciplinary - work alongside consultants, analysts, designers, developers, marketers, and other specialists<p>We create platforms, apps, stores, and digital campaigns. Our projects are for publishing and retail websites. Our customers are our partners, we get them up to speed in the digital world by introducing them to new paradigms, tools, and processes. You are in direct contact with our customers to discuss tasks and coordinate requirements.<p>You will work in a dynamic international team of digital strategists distributed across offices in Barcelona, Cologne, and our head office in Karlsruhe, Germany.<p>We love to collaborate, work independently, and we feel responsible for what we do. Therefore you can manage your time and tasks the way it fits your working style best. We follow agile methodologies to operate in fast-paced environments. Our ideal candidate will be versatile, self-motivated and curious.<p>Contact: jobs@netzstrategen.com","time":1496390483,"type":"comment"}