{"by":"chrisbaglieri","id":14464179,"parent":14460777,"text":"Blackfynn | Engineers (Full Stack, Front End, Data) | Philadelphia | Full-time, On Site | <a href=\"http:&#x2F;&#x2F;blackfynn.com\" rel=\"nofollow\">http:&#x2F;&#x2F;blackfynn.com</a><p>We&#x27;re a life sciences software startup building a data platform which integrates complex scientific and clinical data to enable therapeutics for disease.<p>Neurologic conditions affect one in six people worldwide. We want to improve their lives. We&#x27;re a driven, curious group wielding data science and building software that meaningfully impacts humans. Our mission is bold, our team is experienced, and our product is ambitious. We&#x27;re looking for engineers and data scientists to help us bring it to life.<p>We love individuals who are curious about domains outside of the ones we normally operate in, enjoy polyglot codebases, consider themselves a generalist, and desire to work on products that make a positive, meaningful impact. The bar for software in this field is, unfortunately, low. We want to change that in a massive way.<p>Today our stack includes the following (it&#x27;s constantly evolving, we&#x27;re right tool for the job people):<p>* Languages: Scala, Python, Javascript<p>* Frameworks: Scalatra, Akka, Flask, Polymer, D3<p>* Datastores: Redis, Postgres (RDS), Hbase, Kinesis<p>* Infrastructure: AWS, Kubernetes, Docker<p>* Domains: Scientific Research (Neuroscience, Genomics, Imaging), Clinical Research, Healthcare Informatics<p>We&#x27;re well funded and have excellent traction on a number of significant partnerships. The product team is a great crew, pragmatic, super bright, without egos, and passionate about our work. Our code is well tested and structured.<p>* <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;blackfynn&#x2F;jobs&#x2F;163111-full-stack-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;blackfynn&#x2F;jobs&#x2F;163111-full-stack-engineer</a><p>* <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;blackfynn&#x2F;jobs&#x2F;163112-front-end-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;blackfynn&#x2F;jobs&#x2F;163112-front-end-engineer</a><p>If you&#x27;re interested, I&#x27;d love to talk. chris@blackfynn.com","time":1496348567,"type":"comment"}