{"by":"tonyleask","id":14462001,"parent":14460777,"text":"Investopedia | Senior Web Developer, Product Team | Edmonton, AB Canada | ONSITE, FTE, VISA, SALARY:DOE, <a href=\"http:&#x2F;&#x2F;www.investopedia.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.investopedia.com</a><p>The engineering team at Investopedia believes in owning their impact and fighting complexity while giving back and having fun. We believe that small, empowered, self-motivated teams can do big things. Our work crosses a wide variety of teams, applications, and technology stacks within Investopedia - collaboration and communication are as important as writing new code. We work primarily with PHP but have started to extract smaller services using Node.js and Python. We&#x27;re looking for:<p>- Exceptional ability to work anywhere in the technical stack, delivering quality code both on the frontend and backend.\n - Exceptional proficiency using PHP&#x2F;HTML&#x2F;CSS&#x2F;Javascript.\n - Ability to leverage and integrate with third party APIs.\n - Commitment to continuous improvement and building a world-class engineering culture.\n - Demonstrated design and UX sensibilities.\n - Enthusiasm for leading, guiding, mentoring and collaborating with other engineers.\n - Exposure to architectural patterns of a large, high-scale web application.\n - Strong CS fundamentals, rigor in engineering.\n - Familiarity with Drupal, online advertising, publishing, and SEO is a plus.<p>Benefits: - Competitive Vacation Plan - Competitive salary - Great benefits (medical, dental, vision, RRSP matching)- Unlimited snacks&#x2F;drinks - great workspace (daily foosball, dart challenges and beer always on tap)<p>For full job description and to apply, visit: <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;J0yDWQ\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;J0yDWQ</a> (or e-mail jobs@investopedia.com)<p>About our company: <a href=\"http:&#x2F;&#x2F;www.investopedia.com&#x2F;corp&#x2F;about.aspx\" rel=\"nofollow\">http:&#x2F;&#x2F;www.investopedia.com&#x2F;corp&#x2F;about.aspx</a>, For more jobs, visit: <a href=\"http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings\" rel=\"nofollow\">http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings</a>","time":1496335978,"type":"comment"}