{"by":"jsime","id":14462317,"parent":14460777,"text":"Oracle Cloud Infrastructure | Principal Member of Technical Staff | Seattle | ONSITE, <a href=\"https:&#x2F;&#x2F;cloud.oracle.com&#x2F;en_US&#x2F;bare-metal\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.oracle.com&#x2F;en_US&#x2F;bare-metal</a><p>Oracle’s Cloud Infrastructure team is building new IaaS technologies that operate at high scale in a broadly distributed multi-tenant cloud environment. Our customers run their businesses on our cloud, and our mission is to provide them with best in class compute, storage, networking, database, security, and an ever expanding set of foundational cloud-based services.<p>We’re looking for hands-on engineers with expertise and passion in solving difficult problems in distributed systems, virtualized infrastructure, and highly available services. If this is you, at Oracle you can design and build innovative new systems from the ground up. These are exciting times in our space - we are growing fast, still at an early stage, and working on ambitious new initiatives. An engineer at any level can have significant technical and business impact.<p>As a Principal Member of Technical Staff you will own the software design and development for major components of Oracle’s Cloud Infrastructure. You should be both a rock solid coder and a distributed systems generalist, able to dive deep into any part of the stack and low level systems, as well as design broad distributed system interactions. You should value simplicity and scale, work comfortably in a collaborative, agile environment, and be excited to learn.<p>- 5+ years experience delivering and operating large scale, highly available distributed systems.\n- Strong knowledge of C, C++ or Java, and experience with scripting languages such as Python, Perl, etc.\n- Strong knowledge of data structures, algorithms, operating systems, and distributed systems fundamentals.\n- Working familiarity with networking protocols (TCP&#x2F;IP, HTTP) and standard network architectures.\n- Strong understanding of databases, NoSQL systems, storage and distributed persistence technologies.\n- Strong troubleshooting and performance tuning skills.\n- Experience building multi-tenant, virtualized infrastructure a strong plus.<p>Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.<p>To apply, contact jon.sime (at) oracle.com.","time":1496337538,"type":"comment"}