{"by":"nsamuell","id":14465311,"parent":14460777,"text":"Pathgather - <a href=\"http:&#x2F;&#x2F;pathgather.com\" rel=\"nofollow\">http:&#x2F;&#x2F;pathgather.com</a> - ONSITE - New York, NY (NYC)<p>Pathgather is a fully-funded enterprise learning startup (Techstars &#x27;14) focused on helping employees at Fortune 500 companies advance their careers by learning new skills. Our platform is used by some of the largest companies in the world (HP, Visa, Qualcomm, etc.) to aggregate learning content from both public providers (e.g. Udacity, Pluralsight) and private catalogs (internal learning systems), empower their employees to share what they&#x27;re learning (e.g. articles from HN), and track employee progress towards career goals. We&#x27;ve got real revenue, real customers, and a real opportunity to make learning better for employees everywhere.<p>We&#x27;re looking for Backend and Frontend Engineers to join the engineering team. Our two teams interface via our GraphQL API; this means our frontend engineers can query exactly the data they need and our backend engineers can focus on more interesting problems than fetching data for views.<p>As a Backend Engineer, you&#x27;ll leverage our PostgreSQL schema heavily to enforce our business logic via DB constraints, trigger functions, and all kinds of fun things... When you aren&#x27;t designing database models, you&#x27;ll be writing integrations with a variety of external services, working on our machine learning models, and - of course - LEARNING.<p>As a Frontend Engineer, you&#x27;ll be tasked with implementing the &quot;delight&quot; our customers have grown to expect from our product. This means focusing on the right interactions and keeping everything clean, consistent, and reusable. React, of course, helps a ton for this.<p>If any of this sounds interesting, contact me (neville@pathgather.com, CTO) or apply to our careers link below!<p>BACKEND ENGINEER (Ruby&#x2F;Postgres&#x2F;GraphQL), $100-130k, <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather&#x2F;e700098b-b552-4b10-a5a5-e0e1e49a4154\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather&#x2F;e700098b-b552-4b10-a5a5-e0e...</a><p>FRONTEND ENGINEER (React&#x2F;React Native&#x2F;CSS), $100-130k, <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather&#x2F;8a543314-5444-468c-85ce-3ede0320f0af\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;pathgather&#x2F;8a543314-5444-468c-85ce-3ed...</a>","time":1496354695,"type":"comment"}