{"by":"steve-mushero","id":14467419,"parent":14460777,"text":"OpsStack | Product Manager | Bay Area | ONSITE | Full-time | OpsStack.io<p><a href=\"http:&#x2F;&#x2F;www.opsstack.io&#x2F;job-product-manager\" rel=\"nofollow\">http:&#x2F;&#x2F;www.opsstack.io&#x2F;job-product-manager</a><p>OpsStack is unifying the Cloud &#x2F; On-Line operations world, helping Ops, DevOps, SRE, and SysAdmin teams finally get control of their new chaotic &amp; dynamic world. Our job is to build the full-stack, full-lifecycle tools that drive their world.<p>This is an exciting Product role at the forefront of Cloud and DevOps technologies.<p>Responsibilities:<p>- Driving every aspect of OpsStack product\n- Work with customers, engineers, stakeholders to define everything\n- Understand fast-moving Ops&#x2F;DevOps market, and its future\n- Drive requirements, documentation, and acceptance processes\n- Ensure smooth sequencing, delivery, and integration of new features and enhancements<p>Suggest you review this great article on What Makes a Great Product Manager as we agree: <a href=\"https:&#x2F;&#x2F;hackernoon.com&#x2F;what-makes-a-great-product-manager-3c1d03b90356\" rel=\"nofollow\">https:&#x2F;&#x2F;hackernoon.com&#x2F;what-makes-a-great-product-manager-3c...</a><p>You must understand the technology to some degree, the market a lot, and the customer for sure. Expect a lot of customer face time, and a lot of discussion over what matters, to who, and why.<p>Requirements:<p>- Several years Product Management experience. In a seriously technical product. \n- Ideally in SaaS, IT, and Cloud. \n- You don&#x27;t need to be an engineer, but thinking like one will help; a lot. \n- Experience in Story, Project Management, and Roadmap tools.  \n- Ideally you have experience managing Linux Systems &amp; AWS&#x2F;Azure cloud resources<p>To apply, please send your resume and an overview of why this is the role for you.  We strongly encourage a diverse workforce &amp; a wide pool of applicants - we are everything-friendly.\nSend to: Jobs (at) OpsStack.io","time":1496376939,"type":"comment"}