{"by":"camerond","id":14461246,"parent":14460777,"text":"Carnegie Mellon University | Cloud Education Research Programmer | Pittsburgh, PA<p>The Computer Science Department is seeking a Cloud Education Research Programmer to work on an exciting new opportunity. You will be working with Prof. Majd Sakr, who with his team developed a project-based online Cloud Computing course. You are responsible for developing new projects using the Google Cloud Platform (GCP) and will be responsible for maintaining, enhancing, testing, and debugging the web-based applications that are used to administer projects of the online Cloud Computing course and other CMU CS courses.<p>* Design and implement educational projects to run on cloud infrastructure. Migrate existing projects from Amazon Web Services (AWS) or Microsoft Azure to the Google Cloud Platform.<p>* Developing the front-end application through which projects are developed and students complete projects.<p>* Design experiments to evaluate the effectiveness of new educational methods and interventions to improve student learning at large-scale.<p>* Collect and analyze data from these experiments and participate in submitting publications describing the methods, experiments and results.<p>* Maintaining the software systems used to manage student status, achievements and learning progress.<p>Qualifications:<p>* BS in Computer Science or other relevant field required; MS preferred.<p>* 1-3 years of experience designing and supporting production front-end applications.<p>* 1-3 years of experience developing applications.<p>* Experience with Cloud platforms preferable – GCP, Azure, or Amazon Web Services (AWS).<p>* Experience with Django, Bootstrap, ReactJS, and JavaScript charting libraries is highly desired.<p>* Understanding of user &#x2F; system management for mid-scaled organization. Experience supporting authentication and authorization using Active Directory, LDAP, OAuth, and Shibboleth is preferred.<p>Learn more and apply at <a href=\"https:&#x2F;&#x2F;cmu.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job=2005738\" rel=\"nofollow\">https:&#x2F;&#x2F;cmu.taleo.net&#x2F;careersection&#x2F;2&#x2F;jobdetail.ftl?job=2005...</a>","time":1496331790,"type":"comment"}