{"by":"DavidMcLaughlin","id":14462690,"parent":14460777,"text":"Cloud Platform @ Twitter | San Francisco, CA | ONSITE<p>We&#x27;re looking for engineers to come work on Twitter&#x27;s Cloud Platform team in downtown San Francisco. All of Twitter&#x27;s stateless services run on our platform, and this means we need to support hundreds of thousands of tasks running across tens of thousands of machines (and growing every day!).<p>Our platform is almost entirely open sourced via Apache Mesos and Apache Aurora, and we&#x27;re looking to push on and improve the efficiency, usability and reliability of our platform at our unique scale.<p>We have the following technologies on our team:<p>* Mesos - C++ - Isolation and resource management (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;apache&#x2F;mesos\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;apache&#x2F;mesos</a>)<p>* Aurora - Java - Service scheduler. (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;apache&#x2F;aurora\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;apache&#x2F;aurora</a>)<p>* Workflows - Scala&#x2F;ReactJS - our internal Continuous Delivery platform<p>* Analytics Pipeline - Scala&#x2F;Python - our data pipeline to feed back to users to help them make smarter decisions about how they use our platform.<p>* Operations - Python&#x2F;Go&#x2F;Puppet&#x2F;etc. - The tooling we use to do all of this with a pretty painless oncall and only two SREs.<p>As you can imagine, it&#x27;s a great team for an experienced generalist who enjoys all parts of building a product, but we also have problems that a specialist in any of these areas would have a field day with.<p>We&#x27;re mostly looking for candidates who have at least a couple years experience designing (and implementing) complex systems in a team environment, as well as candidates excited about this space.<p>If this interests you at all or you&#x27;d like more information on the work we&#x27;re doing, our roadmap or any other questions, please get in touch at dm@twitter.com","time":1496339791,"type":"comment"}