{"by":"tonyleask","id":14461933,"parent":14460777,"text":"IAC Publishing Labs (was Ask.com) | Senior Developer, Backend Engineering | Oakland, CA | ONSITE, FTE, VISA, SALARY:DOE, <a href=\"http:&#x2F;&#x2F;www.iacpublishinglabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.iacpublishinglabs.com</a><p>We are looking for a Senior Developer for the Backend Engineering team to work on business products and projects related to our microservices and data platforms. We power the systems behind our top-10 digital properties and world class performance marketing functions. The Backend Engineering team is responsible for initiatives such as search indexes and data systems, data pipelines and processing, and rapid microservices delivery. You’d be working with multiple teams in a culture that values collaborative, pragmatic solutions.<p>- Solve for challenges that involve concurrency and multi-tenancy at a large scale. \n - Work with a technology stack that includes Java, Node.js, Openshift &#x2F; Kubernetes &#x2F; Docker, Linkerd, AWS services, Solr, big data systems and more.\n - Work on large container and cloud migration initiatives.\n - Participate in the architectural strategy, from PoC to proposal to implementation.\n - Implement modern, scalable, business driven capabilities for big data and real time processing. \n - Be recognized as a master of, and internal SME for, specific solutions and technologies.\n - Collaborate with the Front End, BI, Data Sciences team on designing and implementing solutions.\n - Leverage self service development pipeline and push directly to production.<p>Benefits: - Unlimited vacation - Competitive salary plus bonus - Great benefits (medical, dental, vision, 401k matching, legal insurance, pet insurance) - Unlimited snacks&#x2F;drinks, frozen yogurt and beer - Relocation assistance (if moving to the SF Bay Area) - Close to many public transit options (BART, Ferry, AC Transit) - Subsidized dollars towards public transit or parking garage - Tuition Reimbursement<p>For full job description and to apply, visit: <a href=\"http:&#x2F;&#x2F;smrtr.io&#x2F;J0yDWQ\" rel=\"nofollow\">http:&#x2F;&#x2F;smrtr.io&#x2F;J0yDWQ</a> (or e-mail jobs@ask.com)<p>About our company: <a href=\"http:&#x2F;&#x2F;iacpublishinglabs.com\" rel=\"nofollow\">http:&#x2F;&#x2F;iacpublishinglabs.com</a> For more jobs, visit: <a href=\"http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings\" rel=\"nofollow\">http:&#x2F;&#x2F;iac.com&#x2F;careers&#x2F;job-listings</a>","time":1496335623,"type":"comment"}