{"by":"czbond","id":14463122,"parent":14460777,"text":"ParkHub | Data Engineer | Dallas, TX | ONSITE, <a href=\"http:&#x2F;&#x2F;parkhub.com\" rel=\"nofollow\">http:&#x2F;&#x2F;parkhub.com</a><p>Tired of working crazy hours for sociopaths or &quot;bros&quot; running their startup? Would you like normal hours, a culture that respects career progression collaboratively, cool people, and a company with good revenue which is scaling - without the crazyness of your typical startup?<p>Note: Ask questions directly of us in Slack. <a href=\"https:&#x2F;&#x2F;join.slack.com&#x2F;parkhub-hire&#x2F;signup\" rel=\"nofollow\">https:&#x2F;&#x2F;join.slack.com&#x2F;parkhub-hire&#x2F;signup</a><p>ParkHub is seeking a Data Engineer to add to our team. We have a hardware team, software team, and design team - with data as a central core and thesis of the business. You will be the first hire centered on data - with plans to add additional within the year.<p>What you will do: \nCollaboratively define and build new and existing data models, Setup data warehousing processes and infrastructure, Develop data analytics to generate business insights, Monitor and maintain data hygiene and quality, Tune the performance of data stores and sources, Migrate existing data to newly built data structures, Emergency troubleshooting of issues relating to data quality, Assisting with business reporting requests<p>Experience we&#x27;re looking for:\nPerforming ETL operations with relational and non-relational databases in production environments, Business-focused schema modeling, design, and architecture, Managing large data migrations between different platforms and infrastructures, Development using scripting and programming languages, Performing statistical analysis of large datasets, Maintaining and improving data quality and hygiene, Tuning the performance of business-dependent data stores<p>About us in short: Clear business model with large clients paying us, Have grown greatly the past few years, team is still small enough (technology team is ~ 17), raising a B round. Management team is respectful, honest, and actually &quot;normal&quot;. (Been in startups long enough, you know that value)<p>Submit resumes to chris.bond@parkhub.com","time":1496342285,"type":"comment"}