{"by":"leadpages","id":14465174,"parent":14460777,"text":"Leadpages (www.Leadpages.net) - Minneapolis, MN | Full Time | ON-SITE | Now Hiring Senior Software Engineers (Python, Ruby and JavaScript), Senior Rails Developers, Senior JS App Engineers and Customer Success!<p>Leadpages is a Minneapolis-based SaaS startup and we focus on conversion optimization software. We&#x27;re 100% committed to diversifying our team to include all members of the Python, Ruby, Java, and PHP communities - we&#x27;ve found that through this diversity, we&#x27;re able to grow in infinite ways and build great things. We have an excellent culture that is lightyears ahead of the industry and a great appreciation for work-life balance (we practice this heavily!), AND... we work remote two days per week with the other three days from our incredible downtown Minneapolis office (yes, if you are not already local, you’d have to be open to relocation).<p>What we’re using…<p>The Leadpages main app was built with Python on Google App Engine on the backend; we have a fantastic Python REST API stack based on the Falcon framework and running in Kubernetes. Our Distributed Systems team is using Scala and Akka, while our DevOps team is using Docker, Ansible, Grafana, Kibana, Jenkins, ElasticSearch and Google Compute Engine. On the front end, we’re using modern JS tools like Aurelia, React, Redux, and Babel.<p>Our Drip product team is busy with scaling and creating one of the MarTec industry’s most impressive marketing automation platforms. It’s a beautiful Rails app that’s built on Rails 4, AWS, JSON, Sidekiq, and PostgreSQL.<p>If anything caught your eye, we’d love to hear from you! We currently have opportunities available for:<p>- Senior Python Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2qLeBRq\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2qLeBRq</a><p>- Senior Ruby on Rails Developer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2stS10X\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2stS10X</a><p>- Senior JavaScript Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2sjK0w8\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2sjK0w8</a><p>- Senior Software Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2rvL16m\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2rvL16m</a><p>These are all full-time positions with excellent benefits including Medical, Dental, Vision, 401k (+match), Open PTO, Flexible Schedules, Work From Home days, and more! We even offer generous relocation packages to help you relocate to beautiful Minneapolis, MN.<p><i></i>If you&#x27;re interested in seeing any other open positions within our Marketing, Product, HR&#x2F;Recruiting, Customer Success or Operations teams, check out our website at <a href=\"http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers</a><p>Interested in emailing us directly? You can reach me at Tiffany@Ave81.com<p>Let’s build something awesome!","time":1496353819,"type":"comment"}