{"by":"sageabilly","id":14464085,"kids":[14466522],"parent":14460777,"text":"CapTech Consulting | Engineers (.NET, Java, DevOps, Android, iOS) | Philly, DC, Richmond, Charlotte, Atlanta, Chicago, Denver, Remote | Onsite and remote | Fulltime | www.captechconsulting.com&#x2F;careers<p><i>CapTech is a U.S.-based technology and management consulting firm that partners with some of the world’s most successful companies to achieve their strategic and business objectives. We help organizations bridge the gap between business and technology by delivering organizational transformation, customer engagement, data &amp; analytics and custom IT solutions. Our collaborative approach helps organizations grow their business, engage with customers and turn data into powerful insights. We bring expert consultants to every engagement to develop a deep understanding of the goals and assets unique to each client. We tailor custom solutions to maximize the impact of our clients’ investment. It’s one of the reasons we’ve been on the Inc. 500&#x2F;5000 list for 10 years. </i><p>We&#x27;re really in need of .NET engineers in Richmond and Chicago and Java engineers all down the eastern seaboard (Philly, DC, Richmond, Charlotte, Atlanta). There&#x27;s also a big need for iOS and Android developers in Columbus OH. However, we&#x27;re hiring for many different IT positions so please check the careers page.<p><i>personal note</i> I LOVE working here- culture is a HUGE part of this company and it shows. Read the values page on the CapTech website- everything that&#x27;s written there is true. It&#x27;s also fantastic because even though it&#x27;s a consulting firm, it&#x27;s explicitly NOT like the big 4 firms. There&#x27;s a ton of camaraderie, professional support, and an enormous emphasis on work-life balance. You don&#x27;t have to travel if you don&#x27;t want to, and their mantra is &quot;live where you work&quot; so your commute won&#x27;t be crazy either. You can work 40 billable hours and go home- that is <i>absolutely fine and great</i>, or you can get involved in extracurricular stuff or take a ton of training or take on extra projects if that&#x27;s your thing too, and it&#x27;s <i>equally great</i>. They&#x27;re happy to meet anyone&#x27;s personal needs as far as work-life balance, and it&#x27;s awesomeeeee. Compensation is pretty sweet too!","time":1496347988,"type":"comment"}