{"by":"marpaia","id":14462255,"kids":[14466399],"parent":14460777,"text":"Kolide | C++ Software Engineer on osquery | Fully Remote | Fulltime | <a href=\"https:&#x2F;&#x2F;kolide.com&#x2F;osquery\" rel=\"nofollow\">https:&#x2F;&#x2F;kolide.com&#x2F;osquery</a><p>Hey there! Mike Arpaia here, a Co-Founder of a host endpoint company called Kolide (<a href=\"https:&#x2F;&#x2F;kolide.com\" rel=\"nofollow\">https:&#x2F;&#x2F;kolide.com</a>) and the original creator of the open-source security software osquery (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;facebook&#x2F;osquery\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;facebook&#x2F;osquery</a>) which I put together as a solution to Facebook&#x27;s HIDS problem when I worked there as an engineer.<p>Kolide is building a team of software engineers to work on and contribute to the osquery codebase, which is an open-source C++ project. Open sourced by Facebook in 2014, osquery is an operating system instrumentation and analysis framework which solves a variety of monitoring and instrumentation use-cases. Since its release, osquery has become one of the most popular open source security software projects on all of GitHub with over 9,000 stars and 1,000 forks.<p>The osquery engineering team at Kolide, led by me, the progenitor of the osquery project, will focus on improving the open source codebase for all users of osquery. Engineers will work closely with members of the core osquery team, osquery community members, and other Kolide employees to prioritize features and collaborate on development. Due to the distributed nature of the osquery open source project, this is a completely remote role; Candidates should feel comfortable working independently in a distributed fashion.<p>The following attributes would be true of an ideal candidate:<p>- Extensive experience writing C++<p>- Deep knowledge of the operating system internals of macOS, Linux or Windows<p>- A passion for open source software and community<p>- Strong writing skills and the ability to express ideas via project proposals and design documents<p>- Previous contributions to osquery are definitely a plus, but not strictly required<p>If this sounds interesting to you, shoot me an email at mike@kolide.com!","time":1496337250,"type":"comment"}