{"by":"alexatkeplar","id":14465394,"parent":14460777,"text":"Snowplow Analytics | Front-End Engineer | REMOTE, UTC+0 to UTC+3<p>We are now looking for our first front-end engineer to join the Product Engineering team working on Snowplow Insights. Snowplow Insights represents the next phase in the evolution of Snowplow, from a consulting company through a services firm (the Snowplow Managed Service now has over 100 customers) to a full-fledged product business.<p>You&#x27;ll be building our product front-end in React, written in TypeScript with Redux, and interacting with our growing collection of micro-services via GraphQL and REST. This is an opportunity to get in extremely early in Snowplow&#x27;s product evolution, playing a major role in developing the Snowplow Insights user experience, product design and technical architecture.<p>For more information: <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;front-end-engineer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;front-end-engi...</a><p>Snowplow Analytics | Sysadmin | ONSITE London, UK<p>Snowplow is building out a dedicated Technical Operations team in 2017, and is looking for experienced systems administrators to join it. Initially this role is open only to candidates based in London or the South-East of England.<p>The sysadmins within our Technical Operations team will have four key responsibilities:<p>1. Handling deployments, upgrades and other maintenance of Snowplow-related infrastructure (load balancers, Redshift clusters, ASGs etc) for our Managed Service customers, across over 100 AWS accounts<p>2. Responding to customer issues and questions concerning Snowplow-related infrastructure, as escalated to you by our L1 Support team<p>3. Working with Snowplow SREs to design, deploy and operate Snowplow’s internal infrastructure, responsible for running the Snowplow Managed Service, the Snowplow website and other services<p>4. Being on call rotation to triage and resolve operational incidents relating to internal or client infrastructure<p>For more information: <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;systems-administrator&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;systems-admini...</a>","time":1496355349,"type":"comment"}