{"by":"jcmack","id":14462291,"parent":14460777,"text":"Coursera | Curriculum Engineer | Mountain View, CA | Onsite | <a href=\"https:&#x2F;&#x2F;www.coursera.org\" rel=\"nofollow\">https:&#x2F;&#x2F;www.coursera.org</a><p>Coursera is scaling a global platform to provide universal access to the world’s best education, and we’re driven by the passion and mission to enable people to learn without limits.<p>At Coursera, the Content Strategy and Management (CSM) team develops and executes on a strategy to grow the value of content in Coursera’s catalog. CSM manages the performance of content throughout its lifecycle - from content identification through production to maintenance. CSM analyzes the performance of existing content, identifies gaps in our catalog, and works with instructors at universities and in the field to craft the best curriculum to fill that gap.<p>As a Curriculum Engineer, you will play a key role in shaping the future of computer science and technology education. We expect you to be an entrepreneurial domain expert who is passionate about education and excited about working in a dynamic environment. You will work cross-functionally across the teams within Coursera and externally with the top universities and companies in the world to offer the best computer science and technology content for our learners.\nYour responsibilities:<p>* Curate customized sequences of courses for top careers and skills to improve content recommendations for Coursera’s learners<p>* Work with companies, government organizations and not-for-profits to recommend the most suitable set of technology content for their employee training and workforce development needs<p>* Identify existing and new industry trends and skills gaps and used this information to craft new content<p>* Work with instructors from the world’s best universities and companies to guide them in producing the best content that meets the needs of our computer science and technology learners, including providing topic guidance and curriculum review<p>Your Skills:<p>* 2+ years of professional experience in a technical role (e.g. software engineer, full stack engineer, etc)<p>* Comfortable working cross-functionally, both with internal and external teams<p>* Prefer background in teaching and&#x2F;or designing technical curriculum.<p>If interested, apply here: <a href=\"https:&#x2F;&#x2F;about.coursera.org&#x2F;careers&#x2F;listing&#x2F;?id=525757b5-9a12-493a-a06e-bfa6c8c326c2\" rel=\"nofollow\">https:&#x2F;&#x2F;about.coursera.org&#x2F;careers&#x2F;listing&#x2F;?id=525757b5-9a12...</a>","time":1496337403,"type":"comment"}