{"by":"brdd","id":14465916,"parent":14460777,"text":"Conduit | Software engineer (Full stack, front-end, back-end) | Boston&#x2F;Cambridge | FULL-TIME | <a href=\"https:&#x2F;&#x2F;cond.co\" rel=\"nofollow\">https:&#x2F;&#x2F;cond.co</a><p>====<p>Conduit is a small venture-backed startup based out of Cambridge. We’re building personal relationship management software to help track, maintain, and grow relationships. People have a hard time staying in touch with others-- let&#x27;s change that.<p>We&#x27;re continuing to grow our team. If you&#x27;re a top engineer with any background, we want you: someone who can hold their own and be comfortable taking charge of large projects at an early-stage company. You&#x27;ll build out our infrastructure from the ground up, make and defend impactful technical decisions, and have the opportunity to grow into future leadership positions. We value smarts over skill-- experience, versatility, and intuition are crucial. Sound like a good fit? Let&#x27;s get in touch.<p>DETAILS<p>Front-end engineer (JS&#x2F;React, Node&#x2F;Express, GraphQL): <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;goconduit&#x2F;jobs&#x2F;210117\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;goconduit&#x2F;jobs&#x2F;210117</a><p>Back-end engineer (Python, DBs and APIs, Node): <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;goconduit&#x2F;jobs&#x2F;210118\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;goconduit&#x2F;jobs&#x2F;210118</a><p>BENEFITS AND PERKS<p>- Be an early-stage employee and work with a fun, world-class team. - Receive significant equity at a fast-growing and valuable company. - Little to no legacy: don&#x27;t deal with old codebases; we&#x27;re clean and modern. - Flexible vacation policy: take the time you need. - Bring your own laptop. We&#x27;ll provide everything else you need to be productive. - Team lunches twice a week and occasional team outings. - Unlimited snacks, plus all the coffee, tea, beer, and fruit water you can drink.<p>=====<p>No remote, please. TO APPLY: Email us resume&#x2F;work experience&#x2F;some projects of yours to careers@cond.co<p>=====<p>=====<p>=====","time":1496359599,"type":"comment"}