{"by":"joshuakelly","id":14460912,"kids":[14460940],"parent":14460777,"text":"Universe | Senior Full Stack Developer | Toronto, Canada | ONSITE, VISA | <a href=\"https:&#x2F;&#x2F;www.universe.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.universe.com&#x2F;</a><p>At Universe, we bring the world together through real-life experiences, so you build memories that last a lifetime.  We’re on a mission to reclaim the human connection by providing event ticketing technology which has touched the lives of millions around the world.<p>As a Senior Full Stack Developer at Universe, you will apply your passion for technology and live events in your quest to build a world-class Event Ticketing platform. In this deeply technical and business-minded position, you’ll architect, implement, and evolve our frontend and backend systems with a talented team of like-minded peers. As a senior developer with great influence on our product, you’ll be challenged with the rewarding tasks of understanding our customers with strong empathy, curating an amazing product experience, and championing our vision to new heights.<p>Application process:<p>* Submit application at <a href=\"http:&#x2F;&#x2F;universe.applytojob.com&#x2F;apply&#x2F;6hV3Xj&#x2F;Senior-Full-Stack-Developer\" rel=\"nofollow\">http:&#x2F;&#x2F;universe.applytojob.com&#x2F;apply&#x2F;6hV3Xj&#x2F;Senior-Full-Stac...</a><p>* Phone screen<p>* Meet the leadership team + Pair programming challenge (in person if you’re local)<p>What your day would look like:<p>* Writing new application code for our core product API and client (especially transactional pieces)<p>* Advocating best practices for development and testing<p>* Performance profiling new and existing features in both our server processes and in the browser<p>* Mentoring junior developers on the team and promoting skill growth<p>What we’re looking for:<p>* Experienced in Ruby on Rails, NodeJS, and&#x2F;or MVC backend frameworks<p>* Experienced in React or Ember frontends<p>* Excited about BDD, automated deployment, fixing bugs, and shipping code<p>Here&#x27;s why you&#x27;ll love working at Universe:<p>* You&#x27;ll work with veteran engineers, who will challenge you to ship frequently<p>* You&#x27;ll work with amazing designers, who will challenge you to implement beautiful interactions and user interfaces<p>* You&#x27;ll be at the helm of your own career, shaping it with your own innovative contributions to a nascent team and product<p>* You&#x27;ll enjoy the culture and perks of a startup, with the stability of a fortune 500 company (NYSE:LYV). Perks include local sake and cold brew coffee on tap, 2 tickets to see a concert of your choice every year, unlimited access to Amphitheatre shows in North America for you and a friend, and 4 weeks vacation (2 weeks during the Christmas holidays &amp; 2 weeks of your choice)<p>More information @ <a href=\"http:&#x2F;&#x2F;careers.universe.com\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.universe.com</a>","time":1496329984,"type":"comment"}