{"by":"LogicX","id":14474787,"parent":14460777,"text":"DNSFilter | Golang&#x2F;Ruby on Rails Engineer | Myrtle Beach, SC, USA | REMOTE <a href=\"https:&#x2F;&#x2F;dnsfilter.com\" rel=\"nofollow\">https:&#x2F;&#x2F;dnsfilter.com</a><p>100% Remote opportunity - Within 6 hours of EST. Full-Time Employee (after a few weeks of contracting)<p>We are a DNS company. DNSFilter provides recursive DNS services with content filtering and threat protection to the Managed Service Provider and Small Medium Business market segments.<p>We have a technically strong founding team, but are looking to step up our golang strength by bringing on a strong golang developer to refactor our code, add tests, and work through our queue of github issues.<p>The primary code-base, in golang, handles incoming DNS requests, and interacts with our ruby on rails API, redis, and kafka. The code base stresses concurrency, and we run it on dozens of anycast nodes around the globe, distributed via docker containers.<p>We have a Ruby on Rails developer founder, but would like our golang developer to be familiar enough with RoR to make quick changes to the API. We&#x27;re also looking to branch off some RoR functions into a separate golang project, which would require reading and understanding the RoR code to reimplement as a golang API.<p>We also have a few other projects written in golang which could use some testing love, and resolution of pending issues and feature-additions. Those projects are a Kafka Consumer (to influxdb and TimeScaleDB (Postgresql)) and a HTTP&#x2F;HTTPS proxy.<p>Another one of our founders is experienced in DevOps, and coded most of our golang app, and handles our infrastructure, docker containers, etc. The existing team has very strong DNS knowledge, and it would be advantageous if our golang developer understood DNS (think dig, different Resource Record types) and some networking concepts (TCP, UDP, Ports). \nWe heavily leverage the github.com&#x2F;miekg&#x2F;dns library, and have plans to implement DNSCrypt, DNSSEC, eDNS0 client subnets, and other standards into our code-base.<p>Looking for 2+ years of golang experience.<p>Please contact us: jobs [at] dnsfilter.com if you’re interested.","time":1496459007,"type":"comment"}