{"by":"jsulinski","id":14473860,"parent":14460777,"text":"Draft | Operations&#x2F;Backend&#x2F;SRE&#x2F;DevOps Engineers | New York, NY | Onsite | Full-time | Salary: $135-$170k<p>Do you...<p>Enjoy building scalable, distributed systems with automation and modern tools?<p>Love telemetry and monitoring and view them as a means of validating success as much as diagnosing problems?<p>Know how to apply best practices to enable building of a resilient system across multiple geographic regions, as well as within a single zone?<p>Have enough determination to solve the vexing issues -- and the prudence to leave the non-pertinent challenges for later?<p>Have a &quot;buck stops here&quot; attitude, and feel personal responsibility for the availability and success of projects you contribute to?<p>Draft<p>DRAFT (get.playdraft.com) is the first truly mobile sports fantasy game. On DRAFT you can do quick head-to-head drafts with your friends (or random opponents), or draft in groups, leagues or tournaments. And you can even win real money doing it.<p>Team<p>We&#x27;re proud of our flexible, collaborative atmosphere that stresses quality and efficiency over sheer velocity. We&#x27;re looking for people who value integrity and humility, and take pride in the work they do. Our hierarchy is very flat and everyone is empowered to make or contribute to important decisions.<p>Scale<p>We were recently acquired by Paddy Power Betfair (ISE: PPB) and are preparing for a significant increase in users as a result of cross-promotion and the start of the NFL season. Accordingly, we’re looking for a few talented operations and back-end engineers to form the core infrastructure team to help us scale, build new features, and improve our engineering tools.<p>Apply at <a href=\"https:&#x2F;&#x2F;angel.co&#x2F;playdraft&#x2F;jobs&#x2F;234940-operations-engineer-sre-devops\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;playdraft&#x2F;jobs&#x2F;234940-operations-engineer-s...</a> or shoot us an email: nicolo at playdraft.com.","time":1496444094,"type":"comment"}