{"by":"virtuallynathan","id":14470909,"parent":14460777,"text":"Amazon Web Services | SDE &#x2F; SysDE &#x2F; Research&#x2F;Data Scientist | Seattle, Palo Alto (ONSITE) | VISA, aws.amazon.com, AS16509<p>The Internet is the world’s most complex network, with over 57,402 unique networks connected together, it contains hundreds of millions of edges and nodes. It is THE most pervasive, important, and complicated communications network in the world -- somewhere out there things are about to go south. One of the core backbone routers of a major Tier-1 Internet provider is having a bad day. It started with a transient, yet persistent, problem which was only detectable by a slight increase in dropped packets that went mostly unnoticed. An hour later the router suffered a catastrophic failure dumping 500Gbps of traffic onto an already congested alternate path causing ripples across the Internet, disrupting websites and other Internet based services on the U.S Eastern seaboard. Social media is ablaze as frustrated people rant about their favorite website, video, or gaming service being down, or so slow that it’s unusable. While the Internet burns, our customers are humming away oblivious to the disaster. If you have an insatiable curiosity, love the process of discovery, and you’re reading this with a grin... we should talk. Come join us and...<p>* Do what nobody else in the world is doing... literally.<p>* Gain knowledge and expertise on the inner workings of the Internet, working with top-tier Network Engineers<p>* Define and Develop Amazon’s Internet Monitoring architecture<p>* Play in the piles of data to discover patterns that push our understanding and knowledge of Internet performance and availability anomalies<p>* Build massive real-time systems which inform and drive complex changes across the Internet<p>* Gain practical experience building software using Amazon Web Services<p>We are hiring for SDE&#x2F;SysDE I (Entry Level), SDE&#x2F;SysDE II (Mid-Level), Senior SDE, and Research&#x2F;Data Scientist I&#x2F;II (Entry&#x2F;Mid Level). We may have an opening for a Data Engineer I&#x2F;II in the future.<p>Sound like fun? Email me: nahtnow at amazon dot com.<p>(*) Note, I currently don’t have openings for interns or just-graduated college students. For internships or recent college grad positions please apply here: <a href=\"https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;team&#x2F;university-tech\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.jobs&#x2F;en&#x2F;team&#x2F;university-tech</a>","time":1496419528,"type":"comment"}