{"by":"rsyring","id":14539435,"parent":14460777,"text":"Level 12 | Full Stack Web Developer - Python, React, SQL  | Louisville, KY | REMOTE, SALARY:$75K-115K, <a href=\"https:&#x2F;&#x2F;www.level12.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.level12.io&#x2F;careers&#x2F;</a><p>We have openings for mid &amp; senior&#x2F;lead level positions.<p>Please see our website for what is probably the most detailed job description you have ever seen.  No plain, repetitive, HR riddled job description here, we want you to know what you are really getting into: <a href=\"https:&#x2F;&#x2F;www.level12.io&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.level12.io&#x2F;careers&#x2F;</a><p>- We have a commitment to transparency and offer a “no surprises experience” throughout the interview and hiring process.\n- We practice and preach sound development practices. You are likely to learn and grow as a developer while working here.\n- You will have the option of working from home or our office, whatever suits you best. Let’s make the most of our time and minimize commuting when not necessary.\n- We have a no-drama office policy. We value and cultivate enjoyable working relationships among team members.\n- We emphasize work&#x2F;life balance and adopt policies that make sure our people don’t get burnt out. For instance, our PTO&#x2F;Vacation policies are designed so that you actually use them.\n- A commitment to Agile Principles while not being enslaved to any particular methodology.\n- You have the skills and experience (3-6 years) to be a mid-level or senior-level (6-10 years) full-stack web application developer.\n- You like building full stack web applications with technologies like Python, React, SQL, etc.\n- You are committed to automated testing of all the software you write (our apps typically have 92%+ test coverage).\n- You recognized that there is a lot of idealism in the software development community and are not disenchanted with the the day-to-day realities of programming.\n- You like working independently but can take direction from the team lead and contribute to a team as needed\n- If you apply as instructed, we will give you a yay or nay response. No black holes here!","time":1497290796,"type":"comment"}