{"by":"StyleOwner","id":2832863,"parent":2831646,"text":"StyleOwner is hiring.  email matt@styleowner.com<p>Where: San Francisco, CA and Ann Arbor, MI<p>Remote / Telecommuters also considered.<p>StyleOwner is looking for highly skilled, top 1% developers (frontend and backend positions available). Salary: highly competitive. www.styleowner.com. A lot of people think we’re going to be the next big thing.<p>Accel Partners has funded us and Bob Pittman (the founder of MTV Networks) recently became an investor. Social media is huge, and the best marketer is a recommendation from a friend or family. So why not combine the two? StyleOwner is empowering the Facebook generation to become entrepreneurs and start their own online store. We’ve partnered with amazing brands to create “the itunes of fashions” and allow our StylEpreneurs to curate their own store, share it with their sphere of influence, and earn 10% commission on everything they sell. We’re reinventing retail — true social selling for the first time.<p>We’ll show you our concept deck and give you a demo of our site and business plan. You show us your Github profile.<p>Our technology stack is primarily ruby on the backend and html/css/js on the frontend. We use backbone.js, sinatra, datamapper, jquery, etc. Experience with git or a willingness to learn is a must.<p>We’re looking for someone who we can pay a top salary plus very nice perks, equity, etc. We want you to join our awesome team and make bring this disruptive form of online shopping to reality. As an added bonus, Sunday is funday at StyleOwner. StyleOwner will pay for your fun on Sundays. Do whatever you love to do: fancy meal, rock climbing, baseball game, day trip etc (as long as it’s legal of course) submit receipts and we will pay up to $250 per Sunday.<p>Our development team is in San Francisco and our main headquarters is in NYC.<p>Please send us a link to your github profile, resume, and some references. We’d love to meet with you, buy you a coffee or a beer, and show you some of our code and figure out if it’s a good fit.<p>We’ll start out with a chat over the phone so that you can ask any questions you may have after reading this posting.","time":1312214794,"type":"comment"}