{"by":"RyanGWU82","id":2833518,"parent":2831646,"text":"San Mateo, CA<p>PBworks is hiring a Senior Operations Engineer!<p>PBworks is hiring a Senior Operations Engineer who can wear many hats. We're looking for folks who aren't scared of being hands on with everything. Willing to compile a grsecurity Linux kernel? Troubleshoot network packet loss? Scale databases? If you’re able to take on a wide range of responsibility, this position is for you.<p>Your job will be to create an environment where 4 million users and over 1.5 million workspaces can flourish and change the way people work. You'll get the freedom to do the job right, and a fantastic engineering team to back you up. What are you waiting for? Mail your resume and a short paragraph of why you'd like to join to jobs-ops@pbworks.com.<p>What You'll Be Doing:<p>- Physical server management: Managing a cluster of about 70 physical servers in San Francisco. Plus 3 servers in Sacramento. Plus a handful in our office in San Mateo.<p>- Engineering: Developing ops infrastructure tools in PHP, Perl, Ruby, or shell scripts.<p>- Automation: automating deployment with puppet.<p>- Monitoring: using Ganglia and monit to understand what's going on with the systems.<p>- Networking: Running the network infrastructure, including routers, switches, and site-to-site VPNs between the three locations above.<p>- Databases: Managing a handful of MySQL databases: advising developers on schema changes, keeping the databases reliable, and optimizing performance.<p>- Security: Analyzing the systems' security, keeping up with new threats, and recommending and implementing new security technologies and policies.<p>- Email: Ensuring the best possible outgoing email deliverability, and that we don't lose any incoming email.<p>- Office IT: running the office network; operating the employee VPN; occasionally fixing a printer or troubleshooting someone's laptop.<p>- Planning: Monitoring resource utilization trends; budgeting; planning for growth.<p>The Operations Engineer role is extraordinarily wide. If you've got software development experience, there are a variety of customer-facing infrastructure projects that may interest you. If you like NoSQL, there are definitely ways we can add NoSQL databases to optimize performance and developer productivity. We're looking for someone with a wide range of experience and interests, but if you haven't already worked in all these roles, we're here to help you learn.<p>Requirements: 3+ years experience running a production cluster. Debian and SaaS experience strongly preferred.<p>Bonus: Knowledge of PHP, puppet, git, quality programming abilities, computer science chops, and an understanding of SaaS business.<p>Technology: You'll get to solve real business problems with a wide range of technology. Here's a sample of what we work with: Debian Linux, Apache, Nginx, Percona Server (MySQL), memcached, MogileFS, XtraBackup, LDAP, puppet, Ganglia, monit, Perl, Node.js, ejabberd, Vyatta, Amazon Web Services, Solr, Postfix, git.<p>Why we're different: PBworks blurs the lines between operations and development. You'll sit in on every team engineering meeting and have input to decisions at all levels. As part of your job, you'll continue to architect our system to handle failures so you won't get paged when a hard drive fries. We're committed to providing the resources so that these failures don't become emergencies. We value automation and addressing the root cause of issues so they don't happen again.<p>To apply, email jobs-ops+hn@pbworks.com.","time":1312221504,"type":"comment"}