{"by":"Matt_Mickiewicz","id":2833536,"parent":2831646,"text":"San Francisco, CA - VP of Marketing<p>99designs is the #1 marketplace for crowdsourced graphic design. We connect passionate designers from around the globe with customers seeking quality, affordable design services.<p>Are you a product-centric marketing gun with a track record of success?\nLooking for an opportunity to unleash your talent and make a difference on a global scale?<p>Then we’ve got the job for you.<p>99designs.com is the #1 online marketplace for crowdsourced graphic design services. With a community of over 100,000 freelance designers and 75,000 customer projects delivered in just 3 years, we’re taking the world by storm. To date we’ve grown 120% year-on-year almost purely on word-of-mouth from customers and designers that rave about our service... and now it’s time to step up a gear.<p>We need a talented marketer to accelerate growth and take our business to the next level. Someone who understands product development intimately (two-sided marketplace experience a real plus), who can craft a holistic marketing strategy and then lead our team of external and internal marketing specialists to execute it.<p>Key Areas of Responsibility:<p>- Setting marketing priorities and directing teams to execute them\n- Working with the design team to improve conversion rates\n- Increasing retention of existing customers with targeted up-sell and cross-sell strategies\n- Increasing referral by encouraging customers to make introductions\n- Increasing new visits by managing PPC and other paid advertising opportunities\n- Increasing new visits through SEO best practice\n- Building out and managing the marketing team\n- Managing PR strategy and executing all initiatives (internal/external)\n- Owning key marketing metrics and reporting to the Board as well as the wider team<p>Ideal Applicant Attributes:<p>- Extensive history in marketing-led product development (5+ years relevant experience)\n- A strong analytics background and a metrics driven approach to marketing\n- Hands-on startup and team building experience\n- Demonstrable track record of acquisition marketing success in a B2B environment\n- SME business market / “Pro Consumer” specialist<p>This job is based out of San Francisco, California, in a very central waterfront location that is also inhabited by other creative web startups such as Automattic (the makers of WordPress), Lab Zero and Dog Patch Labs.","time":1312221736,"type":"comment"}