{"by":"covati","id":2834699,"parent":2831646,"text":"Durham, NC United States<p>Currently seeking PHP &#38; Javascript developers who are looking to rock out in the triangle.<p>A very quick note about us: at Argyle Social we have built a Social Media Marketing Software platform that helps marketers to Manage, Measure and Analyze their social media marketing efforts. We are building the best tool out there for marketers looking to prove the value of social media.<p>Do you like waking up in the morning excited about the code you are going to write today? How about being amazed at how awesome the features and products you build look when you're done? Have you always wanted to play with new big data technologies like Hadoop and NoSQL DBs?<p>This isn't just HR BS, we work pretty damn hard to ensure that the dev team is doing interesting stuff and getting to push the envelope with new and interesting technologies. We know that when you are challenged with something fun, you write better code - so that's what we do.<p>We use an Agile development that has evolved over time (and continues to grow with us) to work well with our small, limber team. It has allowed us to build an impressive amount of robust product with very few resources.<p>On the front end we have a very slick, intuitive, and clean UI (check us out at ar.gy). You'll be working with our designer on anything that requires front end work - you'll be in awe of what he can do. On the backend we are building up a pretty huge dataset that we get to rip into. Learn more about our infrastructure at taws.me/2011/05/meeting-1.html<p>Argyle is a Venture backed company that has been operating in the triangle since December of 2009. We have 10 full time employees and an office in downtown durham where the Coke Zero flows like a babbling brook and the gummy bears and Fiber One brownies are plentiful.<p>More details here:\n<a href=\"http://careers.stackoverflow.com/jobs/12851/love-code-you-write-argyle-social\" rel=\"nofollow\">http://careers.stackoverflow.com/jobs/12851/love-code-you-wr...</a>","time":1312235710,"type":"comment"}