{"by":"markmsmith","id":2842442,"parent":2831646,"text":"Location: Raleigh, North Carolina<p>Rally Software is looking for passionate developers with experience in building robust and flexible web-based applications.<p>What’s it like at Rally?<p>We pair.  We use Git, Groovy, Grails, Spring, ExtJS, Ruby &#38; MongoDB.  We only use OSs that have pipe &#38; grep.  We drink beer and play LAN games together.<p>What makes Rally a ridiculously good place to work<p><i>- Entrepreneurial Atmosphere:</i> You are in charge of your destiny. The team owns all architectural and framework choices, so if anything is not working, we change it!  Prove a new technology solves a problem and we’ll use it.<p><i>- Hackathons:</i> Had a flash of inspiration for an idea that could help the business?  Unleash your creativity with regular opportunities to prototype with whatever cool new tech you want and present it to the rest of the team.  If they like it enough, it could even become a fully-fledged feature and released as part of the product.<p><i>- No role or tech ruts:</i> Extend your role or create your own.  Work across the entire stack (presentation, middleware, web services &#38; backend) or specialize in an area of interest to you.<p><i>- Learning:</i> Overwhelming encouragement (and sponsorship) for attending and presenting at conferences, meet-ups, writing books, and blogging.  Our experiment-rich culture has us evolving our methodology and tools constantly.<p><i>- Fun:</i> We have a kegerator with a different beer every month, as well as regular video game and table tennis sessions.  Few things compare to hearing your coworkers’ cries from across the office as you frag them at the end of a long day.<p><i>- Copious Awards:</i> Rally was named the Best Company to Work For In Colorado (where our HQ is) for the last four years running and ranked in the top ten Best Places to Work in the U.S. from Outside Magazine.  We opened our North Carolina office in 2009 and are looking to aggressively grow it.  Our product has won numerous awards and was recently recognized by industry analyst Forester Research as offering “the best combination of capability and strategy of Agile ALM tools\".<p>At the end of the day, the main things we’re searching for are talent and passion.  However, experience in certain areas could help you hit the ground running, so here’s our attempt at narrowing things down a bit -<p>Apply if you have ninja skills in:<p>Java, Javascript, and OO design.<p>We upvote you if you also know:<p>Groovy, Grails, Ruby, CSS, ExtJS (or similar JS frameworks), Git (or other distributed SCM), SQL (especially Oracle), MongoDB (or other NoSQL) and Agile methodologies.<p>A taste for beer &#38; thai food, as well as having crazy good hand-eye coordination are also helpful.<p><i>Apply Here:</i> <a href=\"http://www.rallydev.com/careers/available_positions/?category=Engineering\" rel=\"nofollow\">http://www.rallydev.com/careers/available_positions/?categor...</a>","time":1312397428,"type":"comment"}