{"by":"bluelinespecial","id":14238718,"parent":14238005,"text":"GrokStyle | Full Stack &#x2F; Backend Engineer | San Francisco, CA | Fulltime | ONSITE<p>Contact: jobs AT grokstyle.com<p>GrokStyle is a deep learning AI company, focused on building fine-grained recognition systems for retail and e-commerce applications. We provide new capabilities to consumers and retailers to assist in matching a consumer’s desired product with the correct or closest matching product based on visual similarity, given a photograph on the web or one taken on their cell phone.<p>GrokStyle was recently named one of the 100 most promising private AI companies globally by CB Insights (AI 100), and our work is based on award-winning computer graphics and machine learning research. We have signed the framework for a worldwide deal with a major retailer and are looking to expand our engineering organization. Our phenomenal team includes engineers and research scientists from Google and top academic professionals from Cornell and UW, and we are looking to further strengthen that base.  We have been funded by the National Science Foundation, Amino Capital, Canaan Partners, and several ex-Googlers.<p>We are seeking engineers with experience in building full stack web applications - from backends in Python to desktop and mobile frontends. Engineers would be responsible for designing and managing APIs and services, building tools for high availability, continuous deployment, scaling, improving our system throughput and reducing hardware costs. In general, you&#x27;d be responsible for figuring out the best tools to make our company more productive, building and deploying them, and ensuring their adoption across our engineers.<p>Given our small size, you will be involved with our entire serving architecture, with the opportunity to greatly influence our serving stack and also assist our data scientists and deep learning engineers to build systems that can learn, train and predict at scale.<p>Skills we&#x27;re looking for:<p>* Experience in production systems, involving both frontend and backend development, experience in building and scaling micro-services and APIs.<p>* Python, possibly with experience with Django.<p>* Strong CS fundamentals (undergrad or masters in CS or similar), and solid architecture and design skills.<p>* Bonus skills: If you have skills in the following areas, we can use them as well: Docker, AWS, Redis, Postgres, Celery.<p>Recent press: <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;04&#x2F;04&#x2F;grokstyle-is-putting-computer-vision-to-work-on-home-decor-with-2m-in-funding&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2017&#x2F;04&#x2F;04&#x2F;grokstyle-is-putting-compu...</a>","time":1493654693,"type":"comment"}