{"by":"leadpages","id":14238292,"parent":14238005,"text":"Leadpages (www.Leadpages.net) - Minneapolis, MN | Full Time | ON-SITE<p>Leadpages is a Minneapolis-based SaaS startup and we focus on conversion optimization software. We&#x27;re 100% committed to diversifying our team to include all members of the Python, Ruby, Java, and PHP communities. We have an excellent culture, a great appreciation for work-life balance and work from home two days per week (the other three days from our incredible downtown Minneapolis office).<p>The Leadpages main app was built with Python on Google App Engine on the backend; we have a fantastic Python REST API stack based around the Falcon framework and running in Kubernetes. Our Distributed Systems team is using Scala and Akka, while our DevOps team is using Docker, Ansible, Grafana, Kibana, Jenkins, ElasticSearch and Google Compute Engine. On the front end, we’re using modern JS tools like Aurelia, React, Redux, and Babel.<p>Our Drip product team is busy scaling and creating one of the MarTec industry’s most impressive marketing automation platforms. It’s a beautiful Rails app that’s built on Rails 4, AWS, JSON, Sidekiq, and PostgreSQL.<p>If anything caught your eye, we’d love to hear from you! We currently have opportunities available for:<p>- Senior Python Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2qkXARE\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2qkXARE</a><p>- Senior Ruby on Rails Developer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2oYhdu2\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2oYhdu2</a><p>- Senior JavaScript Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2p0UrCK\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2p0UrCK</a><p>- Senior Software Engineer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2pP1XVm\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2pP1XVm</a><p>- Senior Scaling Architect =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2p18BUD\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2p18BUD</a><p>- Senior UI&#x2F;UX Designer =&gt; <a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;2pnIYjd\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;2pnIYjd</a><p>These are all full-time positions with excellent benefits including Medical, Dental, Vision, 401k (+match), Open PTO, Flexible Schedules, Work From Home days, and more! We even offer generous relocation packages to help you relocate to beautiful Minneapolis, MN.<p><i></i>If you&#x27;re interested in seeing what else we&#x27;re hiring for, check out our website at <a href=\"http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.leadpages.net&#x2F;careers</a><p>Interested in emailing us directly? You can reach us at Tiffany@Ave81.com or Madelon.Deming@Ave81.com<p>Let’s build something awesome!","time":1493652530,"type":"comment"}