{"by":"capkutay","id":14239351,"parent":14238005,"text":"Striim | ONSITE | Palo Alto, CA | Senior Software Engineer - Machine Learning<p>About Striim:<p>Striim is the only end-to-end solution for streaming data integration and real-time operational analytics. The platform specializes in data integration across a wide variety of sources including change data from enterprise databases, log files, message queues, and IoT sensor data. With that difficult piece solved, Striim&#x27;s analytics layer makes it easy for operational teams to perform machine learning, correlate across streams, detect anomalies, identify and visualize events of interest, and trigger alerts and workflows, all within milliseconds.<p>Today, our product is used to solve some of the toughest data management challenges at large Aerospace, Financial, Retail, and Cloud companies. We were also just recently voted one of the best places to work in Silicon Valley [0].<p>Job description:<p>Team Lead to design and implement Machine Learning and Predictive Analytics modules within Striim&#x27;s real-time analytics platform. Examples include online (i.e. incremental) algorithms (and data structures) for time-series forecasting, document classification, clustering and hyper parameter optimization in addition to crafting new ones as you see fit.<p>Minimum qualifications:<p>BA&#x2F;BS degree in Computer Science or related technical field or equivalent practical experience.\nExperience with one or more general purpose programming languages including but not limited to: Java, C&#x2F;C++ or Python.<p>Experience with one or more of the following: Unsupervised learning, inference, data mining, classification, pattern recognition, recommendation systems, targeting systems, ranking systems or similar.<p>Preferred qualifications:<p>MS or PhD degree in Computer Science, Artificial Intelligence, Machine Learning, or related technical field.<p>2-5 years of industry experience.<p>Experience with distributed systems, ML architectures, R, MLib, or other statistical learning tools.<p>Job posting: <a href=\"http:&#x2F;&#x2F;www.striim.com&#x2F;careers&#x2F;?p=job%2FokB74fwQ\" rel=\"nofollow\">http:&#x2F;&#x2F;www.striim.com&#x2F;careers&#x2F;?p=job%2FokB74fwQ</a><p>0: <a href=\"http:&#x2F;&#x2F;www.bizjournals.com&#x2F;sanfrancisco&#x2F;news&#x2F;2017&#x2F;04&#x2F;18&#x2F;best-places-to-work-2017-bay-area-top-companies.html#g126\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bizjournals.com&#x2F;sanfrancisco&#x2F;news&#x2F;2017&#x2F;04&#x2F;18&#x2F;best...</a>","time":1493658583,"type":"comment"}