{"by":"sethhochberg","id":14239212,"kids":[14241720],"parent":14238005,"text":"DevOps Engineer | Digitally Imported | REMOTE | Fulltime | <a href=\"http:&#x2F;&#x2F;di.fm\" rel=\"nofollow\">http:&#x2F;&#x2F;di.fm</a><p>Digitally Imported (the people behind DI.FM, JazzRadio.com, and a related family of other internet radio properties) are seeking a full time engineer to join our devops team.<p>You&#x27;d be tasked with supporting the infrastructure and deployment for a mix of Ruby (Rails) and Golang applications powering our core APIs, internal tools, and customer-facing websites. Some specific technologies we work with are NGINX (both as a reverse proxy and load balancer), ZFS and GlusterFS, both Ubuntu and CentOS, Ansible, and MySQL (Percona XtraDB). We collocate bare metal in the northeast US, and occasional planned travel for infrastructure work may be required. We&#x27;re growing, and are seeking candidates who are equally comfortable working with the constraints of an existing environment while helping us architect for a stable and scalable future.<p>We&#x27;re a midsized (~40 full time employees) organization where almost everyone works remote from wherever they are around the globe. We don&#x27;t watch the clock or mandate any set schedule outside of occasional teleconference meetings - we&#x27;re just looking for kickass work. We&#x27;re great about ensuring you&#x27;re set up with whatever you need to make your home office work, and music isn&#x27;t just our business, it runs in the blood of the company - we&#x27;re DJs, audio engineers, performers, and more... all supporting streaming of great music to a fanbase who has been listening to us for more than a decade.<p>More details and a full list of desired qualifications here - <a href=\"http:&#x2F;&#x2F;www.di.fm&#x2F;jobs#devops\" rel=\"nofollow\">http:&#x2F;&#x2F;www.di.fm&#x2F;jobs#devops</a><p>Feel free to email seth[at]di.fm or with any questions, or see the link above to apply.","time":1493657683,"type":"comment"}