{"by":"dkoston","id":14239122,"parent":14238005,"text":"Help.com | Austin | Software Engineer (Front-end - React.js)| ONSITE<p>It&#x27;s 2017 and customer service still sucks. Companies have tons of data about you (what you&#x27;ve purchased, every page view to your site, every interaction you&#x27;ve ever had with them). However, that data is stuck in a bunch of fragmented systems and even the customer service systems they currently use don&#x27;t connect their own data between different channels (tickets, chats, phones, etc).<p>Help us eliminate terrible customer service experiences by building out the world&#x27;s best customer service and support platform. With workflows shaped from our time at HostGator (10M+ customers) and GoDaddy (10M+ customers), and technology skills developed from building cPanel, Cloudflare, CBS Sports apps, Node itself, and more.<p>We are predominantly in the JavaScript&#x2F;Node.js ecosystem, specifically a React&#x2F;Redux stack on the front-end with Jest and Enzyme driving testing. Everything is built and deployed in containers on Kubernetes and we&#x27;re building for scale. We are looking for a front-end engineer to assist with development for our customer service platform.<p>As our product is real time, distributed, and relies on a great user experience, we’re looking for an engineer that has extensive experience in building single page applications.<p>Qualifications\n  - Extensive experience with React and it&#x27;s ecosystem (Webpack, Redux, ES6, Flow), ideally on a single page app with 100,000+ users.\n  - 3+ years experience with front end JavaScript development. Experience with Javascript testing frameworks such as Jest and enzyme.\n    - Experience with REST-ful web services.\n    - Experience working with Git.\n    - Passionate about UX.\n    - Experience with Agile methodologies and JIRA.<p>Perks\n    - Working with 2 Node Core Contributors and tons of other smart folks\n    - Founders have helped build many successful companies before (cPanel, Cloudflare, HostGator, etc)\n    - On-site lunch\n    - Well tested code and agile practices\n    - Your code is used 8+ hours a day by our customers so you&#x27;ll gain massive amounts of experience and feedback<p>Apply today at <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;help.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;help.com&#x2F;</a>","time":1493657060,"type":"comment"}