{"by":"zachshefska","id":14238621,"parent":14238005,"text":"MarketSmart | Full Stack Developer | College Park, MD | ONSITE, Full-time, <a href=\"https:&#x2F;&#x2F;imarketsmart.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;imarketsmart.com&#x2F;</a><p>MarketSmart is like HubSpot, SurveyMonkey and Tableau mixed together and specially designed for nonprofits to help their fundraisers zero-in on the wealthiest and most passionate prospective donors.<p>There’s a start-up vibe here but we are profitable and our growth is stable (+32% in 2016, +25% in 2015 and this year we are aiming to grow by 50%+). There are 1.5 million nonprofits in the United States alone. So, with fewer than 200 customers spending an average of about $25,000&#x2F;year each, there is lots of room for expansion. We are well funded and already have many of the most recognized charities around the world as clients (in four countries).<p>We are looking for someone with technical chops and leadership abilities; someone who enjoys collaborating and teaching others, is hungry, eager to grow and wants to develop products that will make the world a better place.<p>Technical qualifications:<p><pre><code>  -Experience developing scalable and high-performing Python web applications\n  -Flask (or similar experience with other Python web frameworks) for rapidly developing web applications\n  -Experience with REST based APIs consumption and creation\n  -Strong database skills with MySQL, PostgreSQL, etc.\n  -Deep commitment to test-driven development\n  -Experience working with HTML5, CSS3, JavaScript, and jQuery\n  -Experience working with JavaScript framework AngularJS\n  -Familiarity with Amazon Web Services\n  -Experience with container services like Docker\n</code></pre>\nOur hiring process is a bit unique. If you’re interested in this position, please fill our our short survey here: <a href=\"https:&#x2F;&#x2F;imarketsmart.com&#x2F;careers&#x2F;open-positions&#x2F;survey&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;imarketsmart.com&#x2F;careers&#x2F;open-positions&#x2F;survey&#x2F;</a> or reach out to me via email - zshefska (at) imarketsmart.com.<p>After completing the survey we’ll want to set up a phone call. After that, if all goes well we’ll most likely ask you to come in and meet our team.","time":1493654170,"type":"comment"}