{"by":"zinxq","id":14238759,"parent":14238005,"text":"Lending Tree, Inc. | Software&#x2F;QA&#x2F;Devops Engineer | Charlotte, NC | ONSITE<p><a href=\"https:&#x2F;&#x2F;www.lendingtree.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.lendingtree.com</a> Email us at: jobs@lendingtree.com<p>Our Tech Stack: C#, Java, .NET core, Docker, Linux, Javascript, React, Mongo, SQL Server, Kafka, Spark<p>Who we are: LendingTree, Inc. empowers consumers with information, tools, advice, products and services for critical transactions and financial decisions in their lives.<p>Specifically - We&#x27;re looking for:<p>Dev-ops Engineers:\nWe are in the midst of migrating our primary infrastructure to Kubernetes, .NET core, docker, linux, mongo, kafka, and other cutting edge technologies. We&#x27;re looking for serious dev-ops engineers to join our team.<p>Back-end Engineers: \nYou&#x27;re a crack-shot in your back-end language of choice. Our system matches users with hundreds of possible opportunities in real-time. Needless to say, we&#x27;re looking for people who care about performance. A lot. Our back-end systems are written in C#, Java, Redis, Mongo, and SQLServer. You might know C# or Java or you might not, but either way you&#x27;re willing to learn. Regardless, you can impress us in your language of choice. If you&#x27;re a Senior Engineer - you&#x27;ve worked in server-side code for a few years. You&#x27;ve scaled to thousands or maybe millions of users. If you&#x27;re a Junior engineer, you love to code and you&#x27;re good at it. You&#x27;re smart, you&#x27;re passionate, and most of all you can&#x27;t wait to get started. (New grads please apply!)<p>QA Engineers:\nWe&#x27;re writing software - and fast. We running hundreds of tests on every check-in and we need more. TestNG, Selenium,  \nand testing intuition guides our tests.  If you love making sure things are working right - email us !<p>Front-end Engineers:\nYou know Javascript. You know the ins, the outs and how to make it blazing fast. You care about performance because you know your users are waiting for every line of your code. You&#x27;ve used some popular frameworks, maybe angular or react - but you know one or more cold.<p>Where we are:<p>Charlotte, NC:\nIf you&#x27;re into great weather and a central location (our airport is an American hub) you should check us out. You can pick great urban living (Uptown&#x27;s 4th ward is the place to be) or get yourself a huge house (at reasonable prices) in the burbs. The standard of living for an engineer doesn&#x27;t get any better than this.","time":1493655005,"type":"comment"}