{"by":"snewman","id":14239414,"parent":14238005,"text":"Scalyr | Backend, Agent, Customer Success Engineers | San Mateo, CA | ONSITE<p>I&#x27;ve built half a dozen startups, including Writely (aka Google Docs), and I can honestly say that Scalyr is my favorite so far. We&#x27;re building an amazing team, users rave about our product, and things are taking off – we&#x27;re closing seven-figure contracts and revenue grew 5x last year. And we&#x27;re doing it on a sane, 40-hour, daily-team-hike, Fridays-at-home schedule. We&#x27;re pre-series-A, but in many ways playing like a series B company, so this is a chance to get the best of both worlds -- early-stage equity and impact, with later-stage compensation and stability; plus a very strong team for peering or mentorship.<p>Backend Engineer: We&#x27;ve built a NoSQL data engine from scratch that searches text at 750 GB&#x2F;second. How&#x27;d you like to help us scale and optimize to multiple TB&#x2F;second?<p>Agent Engineer: you&#x27;ll own our lean, mean data collection agent. If you enjoy constantly getting to play with new tools, come help us connect to... everything. You&#x27;ll get to play with packages from Apache to Zookeeper, APIs from AWS to, er, Azure, while tackling challenges such as monitoring 100,000+ simultaneous log files using minimal CPU.<p>Customer Success Engineer: our customers are engineers. We&#x27;re looking for someone with lightweight ops experience and good communication skills to help them get the most out of Scalyr. A great opportunity to join the team and work your way up the engineering ladder.<p><a href=\"https:&#x2F;&#x2F;www.scalyr.com&#x2F;company&#x2F;jobs&#x2F;back-end-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scalyr.com&#x2F;company&#x2F;jobs&#x2F;back-end-engineer</a><p><a href=\"https:&#x2F;&#x2F;www.scalyr.com&#x2F;company&#x2F;jobs&#x2F;agent-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scalyr.com&#x2F;company&#x2F;jobs&#x2F;agent-engineer</a><p><a href=\"https:&#x2F;&#x2F;www.scalyr.com&#x2F;company&#x2F;jobs&#x2F;customer-success-engineer\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scalyr.com&#x2F;company&#x2F;jobs&#x2F;customer-success-enginee...</a>","time":1493659010,"type":"comment"}