{"by":"moises_silva","id":14239697,"parent":14238005,"text":"Toronto, Canada | Full Time | ONSITE or REMOTE or RELOCATION&#x2F;VISA | FreePBX&#x2F;Asterisk AMI&#x2F;PHP developers<p>Sangoma Technologies Corporation is a leader in delivering globally scalable Voice-Over-IP telephony systems, both on-site and cloud-based. Sangoma is the official sponsor and maintainer of the FreePBX Open Source project. To get an idea of what we build have a look here:<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;sangoma\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;sangoma</a><p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;freepbx\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;freepbx</a><p><a href=\"https:&#x2F;&#x2F;freepbx.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;freepbx.org&#x2F;</a><p><a href=\"https:&#x2F;&#x2F;sangoma.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sangoma.com&#x2F;</a><p>We&#x27;re building new services and products and we&#x27;re looking for:<p>1. FreePBX Web Developers (PHP, Asterisk Dialplan and AMI, Javascript, WebRTC and NodeJS) to build UC solutions, WebRTC applications for hosted and premise UC&#x2F;PBX systems.<p>2. Core developers (C&#x2F;C++&#x2F;Python) to extend our protocol stacks, write telecom applications, extend and improve OSS projects such as Asterisk&#x2F;FreeSWITCH, etc.<p>3. Lab automation developers (Python) to extend our infrastructure and automation testing frameworks.<p>All positions require strong Linux knowledge and great communication skills. Experience with telephony and&#x2F;or audio&#x2F;video is not required but a great asset. It does not matter where you live (even disparate time zones can work, we have remote people in USA, Africa, Spain, South America and Asia). If you live in Canada or want to immigrate to Canada, that&#x27;s even better, we can help with the immigration paper work (just last December we brought over a couple of devs from Argentina).<p>If you have questions or would like to apply email softwarejobs@sangoma.com and preferably mention HN in the email subject.","time":1493660552,"type":"comment"}