{"by":"yllus","id":14239424,"kids":[14280166],"parent":14238005,"text":"Canadian Football League | Lead Web Developer | Toronto, Canada | Full Time | ONSITE | <a href=\"http:&#x2F;&#x2F;www.cfl.ca&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.cfl.ca&#x2F;</a><p>Under the direction of the Director of Technology, the Lead Web Developer would lead the development of the web properties of the Canadian Football League, including CFL.ca, LCF.ca and its team websites.<p>We employ a small, top-notch team of experienced graphics designers, product managers and fellow developers who blend structured requirements gathering with lots of face-to-face interactions to work together and create a terrific website experience. All team members are empowered to bring their own ideas of how to make the digital experiences of the Canadian Football League truly great; so bring your ideas and opinions - not just your coding skills.<p>This position is a full-time role located at the CFL headquarters in Toronto, ON, Canada at 50 Wellington St. E.<p>RESPONSIBILITIES<p>- Develop WordPress plug-ins and themes in PHP, JavaScript and CSS for CFL.ca, LCF.ca and the team websites<p>- Architect and develop the CFL API, a PHP-based REST API that serves statistical data to CFL.ca, the CFL Mobile app and various external partners<p>- Manage communication with the Canadian Football League’s server administrator &#x2F; operations staff, proactively scheduling server performance<p>- Write and maintain automated tests for new and modified pages and API endpoints<p>QUALIFICATIONS (KNOWLEDGE, SKILLS, ABILITIES, EXPERIENCE)<p>- 5+ years of professional web development experience in PHP, JavaScript and CSS<p>- 4+ years working with the WordPress CMS to build themes and plugins<p>- 4+ years experience with MySQL databases<p>- A passion for football or another professional sport is a big plus<p>Job Type: Full-time<p>Salary: $85,000.00 &#x2F;year<p>Contact: E-mail ssyed@cfl.ca with your resume; I&#x27;ll be in touch shortly!","time":1493659057,"type":"comment"}