{"by":"thebiglebrewski","id":14239003,"parent":14238005,"text":"Getaway (<a href=\"http:&#x2F;&#x2F;getaway.house\" rel=\"nofollow\">http:&#x2F;&#x2F;getaway.house</a>) | Full Stack Developer | Brooklyn, NY | ONSITE&#x2F;Remote considered&#x2F;Full time<p>If you’re reading this job description, you’re probably someone that spends a lot of time on the computer and the internet. Although we leverage these tools like any other business does, our our product seeks to physically take our customers away from these things in an effort to find the magic and relaxation they’ve so desperately been seeking. We’re putting tiny houses on camp sites in remote locations so our “users” can get away and set up a high-speed interface with their humanity. We create and maintain technology that, in some cases invisibly, enables a mystical experience for our guests and removes stress from their lives.<p>Getaway is a small but rapidly growing team that just raised a $15M Series A financing round. Our offices our located in Downtown Brooklyn but we are open to remote candidates that can visit our offices at least twice a month.<p>The Full Stack Developer will focus on the following areas:\n- Building new features for and maintaining the current functionality of our website, written  with a React&#x2F;SASS front end and Ruby on Rails back end, in an Agile working environment \n- Some minor developer operations tasks ensuring the website is serving our customers well and performing to our expectations - we’re hosted currently on Heroku\n- Supporting the cabin automation effort, working on software to make the guest experience seamless and magical - currently written in Groovy and Ruby\n- Writing internal tools to support our Guest Experience team and make it extremely easy for guests to get the things they need to have a wonderful time on their Getaways\n- Continuing to find efficiencies and ways to leverage software to improve our team’s workflows and the way we do business\n- Occasionally writing code in front of a fire, if you so desire (for real)<p>We’re looking for someone with around 2 years of experience but don’t want anyone to shy away from applying if they think they’re a real “rockstar&#x2F;ninja&#x2F;etc”. This is not a junior development role and those straight out of school or bootcamp need not apply, unfortunately we just don’t have the resources to support such a candidate at this time.<p>Feel free to reach out to me directly at zach (at) getaway (dot) house about this role!","time":1493656410,"type":"comment"}