{"by":"tkmcc","id":14241410,"parent":14238005,"text":"Curalate | Full Stack Developer, Back-end Developer, Front-end Developer, Product Designer, Senior DevOps Engineer, Client Support Engineer | Seattle, NYC, Philadelphia | <a href=\"https:&#x2F;&#x2F;www.curalate.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.curalate.com&#x2F;</a><p>Curalate is the leading visual commerce platform, connecting pictures, people and products. Our visual commerce software helps more than 850 brands tell their stories through imagery in order to drive engagement, build awareness, and form stronger, more meaningful relationships with consumers.<p>We&#x27;re hiring developers, designers and product people with exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. We&#x27;re not language zealots: we believe in using the right tool for the job, and are comfortable with a polyglot codebase. That said, today we lean on:<p>Languages: Scala, Javascript\nInfrastructure: AWS, Asgard, Jenkins\nDatastores: Cassandra, MySQL (RDS), DynamoDB, Redis, Redshift, S3\nData Processing: Storm, Lambda, Kinesis, Kafka, SQS, Spark\nMicroservices: Finatra&#x2F;Finagle, Scalatra\nFront-end: AngularJS, Less, Gulp, Bower\nImage Processing: OpenCV, Caffe\nSearch: Elasticsearch, Cloudsearch<p>Although experience with our existing technology stack is great, we&#x27;re much more interested in hiring developers with exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. While we&#x27;re not looking for any specific industry experience you should have a CS degree and&#x2F;or <i>at least two years</i> of experience and come prepared to join a fast-moving, high-performing team.<p>Check out our Engineering Blog to learn more: <a href=\"http:&#x2F;&#x2F;engineering.curalate.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.curalate.com</a><p>You can find and apply to all roles on our jobs page (<a href=\"https:&#x2F;&#x2F;www.themuse.com&#x2F;companies&#x2F;curalate\" rel=\"nofollow\">https:&#x2F;&#x2F;www.themuse.com&#x2F;companies&#x2F;curalate</a>), or reach out to me directly and mention HN (&lt;my username&gt;@curalate.com).","time":1493671644,"type":"comment"}