{"by":"sofiegraham","id":14242400,"parent":14238005,"text":"BuildZoom | Public Relations Freelancer | <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;buildzoom&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;buildzoom&#x2F;</a> | REMOTE<p>REMOTE PUBLIC RELATIONS FREELANCE<p>APPLY FOR THIS JOB: \n<a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;buildzoom&#x2F;4af2f840-53af-4a16-bdfb-a9b4b15b71b5\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;buildzoom&#x2F;4af2f840-53af-4a16-bdfb-a9b4...</a><p>BuildZoom is the marketplace for general contractors. We collect and analyze hundreds of millions of building permits, licenses, property features, demographics and other data points to provide property owners with hiring recommendations and make the entire process of hiring a contractor simple and straightforward. We serve millions of monthly visitors and several billion dollars in projects annually.<p>In order to continue to grow, we need your help getting BuildZoom in the news. As a PR Freelancer, you will comb through information we send you about construction projects in your area in search of items that are newsworthy. Once you identify interesting stories you will reach out to reporters - ranging from local foodie bloggers to the New York Times - pitch them, and work with them to ensure stories are written. We will provide you with data in an ongoing fashion and will share our tips and secrets to guide you through the process more easily and quickly.<p>This is a remote freelance position. Instead of hourly compensation the position will be rewarded based on how many stories you get reporters to write that mention us as a source of information. In other words, you will be paid based on the results you produce, not the time it takes you.<p>The Role:\n- Scour data to find interesting content\n- Develop a clear and concise understanding of the story and angle\n- Write effective pitch emails\n- Create and manage your own system for spotting and distributing the newsworthy items in our data feed<p>About You:\n- Enthusiastic, motivated and responsible self-starter\n- Excellent written and verbal communications skills","time":1493678468,"type":"comment"}