{"by":"JasonCEC","id":14241592,"parent":14238005,"text":"Analytical Flavor Systems | Manhattan - NYC | Full-Time | Onsite | <a href=\"http:&#x2F;&#x2F;www.Gastrograph.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.Gastrograph.com&#x2F;</a><p>Position: Full-Stack Engineer, Application Engineer, DevOps, Data Scientist, Sales (inside or field)<p>Application &amp; Data Stack: Golang, Javascript, Docker, Streaming Infrastructure, R, TensorFlow, MySQL, AWS<p>Team: we&#x27;re a diverse 9 person company (across Data, Engineering, Chemistry, and Biz)<p>Analytical Flavor Systems uses machine learning and artificial intelligence to build tools for the food &amp; beverage industry. Our Quality, Process, and Market Intelligence services create real-time predictive decisions metrics at each stage of a products life-cycle. We leverage our predictive models across products &amp; industries for flavor profile optimization, production process optimization, demographic targeting &amp; cognitive marketing - helping companies create and sell the best product to their highest value consumers.<p>Our Services<p>_Quality Intelligence_: Real-time predictive quality control, assurance, and improvement from human sensory data.<p>_Process Intelligence_: Real-time predictive process control and optimization from human sensory data + manufacturing &amp; LIMS data.<p>_Market Intelligence_: Linking flavor-profile, demographics, and sales data to find the highest value consumer demographics for a product&#x27;s flavor-profile.<p>The Position(s)<p>_Engineering_: Web-application or Streaming Infrastructure focused full-stack engineer capable of integrating the data pipeline and outputs of machine learning models into an easy to use management platform.<p>_Data Science_: Data science is central to our predictive Quality, Process, and Market Intelligence services. We didn’t build a data science team to optimize our product&#x27;s marketing spend, sales funnel, or client retention – we built a data science team to build our product. We need data scientists who can understand our clients and can take a nebulous business goal, create a set of quantitative decision metrics, and build predictive models to optimize those metrics.<p>The extensive role of data scientists at Analytical Flavor Systems allows us to invest in their education across sensory perception (standard sensory science so they know what we’re improving and replacing), tasting experiences (so they appreciate the products we work on and understand how the data is collected), production knowledge (test batches in our R&amp;D brewery and roastery so they understand the data they work with and how our predictions impact a client’s process), and data science tear-downs (a meeting where the team collaboratively attempts to find and fix problems, try new techniques, and debate the philosophical implications of a model&#x27;s construction).<p>_Sales_: We prefer the thoughtful relationship builder to the cowboy negotiator. Most of our contracts are multi-year high-price affairs, so relationships are really important. Plus, you get to spend your time at breweries, distilleries and roasteries (I&#x27;ve personally never been to a sales meeting where beer or coffee wasn&#x27;t served freshly brewed).<p>Next Steps<p>Please submit something awesome to JasonCEO@Gastrograph.com to apply.","time":1493672792,"type":"comment"}