{"by":"Infosourcer","id":14248596,"kids":[14336885],"parent":14238005,"text":"Cloudera | Engineering (&amp; More) | Full-Time | Onsite | Globally<p>Cloudera was founded in 2008 to help businesses capture, store and analyze that data. We built a software platform that can handle the huge amounts of data now available. We developed a powerful collection of processing and analytic capabilities. Our customers are able to ask very deep questions of their data, and get their answers quickly.<p>From the beginning, we recognized that data could drive social, as well as commercial, value. For example:<p>* Producing and distributing clean energy is easier and cheaper if we can instrument wind farms, solar collectors and transmission networks, and continuously optimize them.\n* There are seven billion people in the world today, but the population will grow to nine billion by the year 2050. We must feed two billion more people but won’t find much new arable farmland. If we can analyze data on soil chemistry, model weather accurately and select the varieties of seeds best suited to produce in those conditions, we can increase crop yields.\n* Genetic analysis, both of patients and of the diseases that afflict them, provides a rich toolbox for interfering with disease onset and progression, and offers the hope of designing new drugs that can cure many varieties of cancer in our lifetimes.<p>Cloudera was also started &quot;because we believe that data makes things that are impossible today, possible tomorrow. There’s more data coming, and there are plenty of impossible things to work on. Our journey is only well begun.&quot; ~Mike Olson, Cloudera CSO<p>If you would like to join us on this exciting journey, check out the possibilities on our website-&quot;There are plenty of impossible things still to be done.&quot;<p>To learn more &amp; apply for our current openings in the US, Asia-Pacific, Latin America,and Europe&#x2F;Middle East&#x2F;Africa, check us out here <a href=\"https:&#x2F;&#x2F;goo.gl&#x2F;Pm87Mj\" rel=\"nofollow\">https:&#x2F;&#x2F;goo.gl&#x2F;Pm87Mj</a>","time":1493746757,"type":"comment"}