{"by":"roqad","id":14247014,"parent":14238005,"text":"Roq.ad <a href=\"http:&#x2F;&#x2F;roq.ad\" rel=\"nofollow\">http:&#x2F;&#x2F;roq.ad</a> | Client Services Manager | Berlin | Full Time | ONSITE<p>We are a young tech start-up based in Berlin-Kreuzberg that provides cross-device technology to improve digital advertising. Our cross-device technology was completely built in-house and complies with EU and German privacy regulations. The core of our tech is our Roq.ad Cross-Device Marketing Graph, which predicts what internet devices belong to the same user based on a probabilistic and deterministic approach. Many international brands such as Axel Springer, Vodafone, Red Bull, and Deutsche Bank are already satisfied customers and many market leading AdTech companies are our partners. For our proprietary technology we were acknowledged as one of the Top 3 Companies to watch in 2015 in Germany and also as a Top EU Tech Company by European Tech Tour.<p>We are looking for a Client Service Manager (m&#x2F;f) to join our team. Our ideal candidate will be creative, enthusiastic and good at “getting things done.” She&#x2F;he will work with us in the heart of Berlin and play an active role in our future.<p>Your responsibilities:\n•\tYou are responsible for understanding client needs and setting up audience and cross-device campaigns accordingly, reporting + analyzing + optimizing results, and communicating with the client continuously.\n•\tYou are responsible for creating, setting up and optimizing media campaigns over various DSP and platforms.\n•\tYou are responsible for client happiness, so always striving for the best for our clients, in terms of results but also with coming up with new ideas based on the latest industry and tech developments.\n•\tYou will be responsible for rebooking, up- and cross-selling.\n•\tRunning campaigns using the Roq.ad cross-device technology means you work closely with our IT and data experts, defining and implementing new product requirements.<p>What we expect from you:\n•\tYou completed a business, engineering or comparable studies with a strong analytical focus.\n•\tYou have some good knowledge in market intelligence, Ad-Ops, or account management in the AdTech industry.\n•\tYou understand how businesses operate, allowing you to easily put yourself in your clients&#x27; shoes.\n•\tYou know how Real Time Bidding works and can explain the difference between a DSP, DMP and SSP in less than 3 minutes.\n•\tYou have an eye for detail. Setting up campaigns on the multiple platforms we use requires precision and has little room for mistakes.\n•\tYou are fluent in English. Other languages are beneficial.<p>email your cv --&gt; jobs@roq.ad","time":1493738061,"type":"comment"}