{"by":"jobs-at-OEM","id":14240217,"parent":14238005,"text":"Open Energy Market | Full Stack Web Developers | Surbiton UK | Remote or Onsite<p>How would you like to join a company that is actually disrupting an industry that’s still based on faxes? The UK commercial energy brokerage industry is stuck in a bygone age. Relationships and paperwork still dominate. We use technology to modernise the industry and empower its customers. We focus on trading only large volume contracts. Our software automates the procurement process offering direct access to the UK’s suppliers. Customers can forecast their portfolio allowing greater control over their use and costs.<p>For more information about us and our company, visit <a href=\"https:&#x2F;&#x2F;openenergymarket.com\" rel=\"nofollow\">https:&#x2F;&#x2F;openenergymarket.com</a>.<p>We are seeking intelligent and creative people to join us as Full Stack Web Developers.<p>Our development team is cross-functional and is currently fully remote. We have an office in Surbiton from which you can work if required. You will be comfortable working in a mature and collaborative environment. Liaising with non-technical employees across multiple time zones will be required. The role provides a high level of autonomy and you will be reporting directly to the CTO.<p>You will be responsible for the development, deployment and support of our software. This will cover the ongoing support of our current software and the development of our new platform. You will be expected to contribute to all areas of the Devops process including support of our mixed Azure and AWS environment.<p>Our software is currently built using ASP.Net MVC and standard web technologies. Any experience of these technologies would be highly preferable and you will have strong HTML, JavaScript and CSS skills.<p>All new development work will be undertaken using .Net Core and we are evaluating Vue.js as our preferred frontend framework. However, we are constantly investigating other technologies that would benefit our product or speed up our development process. Skills such as Powershell or Bash scripting experience would also be welcome.<p>About you<p>- You are a craftsman and take pride in all aspects of your role.<p>- You leave the code in a better state than you find it using a pragmatic, boy scout, approach.<p>- You program for fun as well as your day job.<p>- You like to break things while finding out how they work.<p>- You engage with the wider developer community and are involved in open source.","time":1493663830,"type":"comment"}