{"by":"kubatyszko","id":14241546,"parent":14238005,"text":"ZestFinance | Sr. Devops Engineer | Los Angeles, CA | ONSITE , <a href=\"https:&#x2F;&#x2F;www.zestfinance.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zestfinance.com&#x2F;careers.html</a><p>Responsibilities<p><pre><code>   * Serve as a primary point responsible the overall health, performance, and capacity of our business systems\n   * Assist in the roll-out and deployment of new releases to facilitate our rapid iteration and constant growth\n   * Develop tools to improve our ability to rapidly deploy and effectively monitor our application stack.\n   * Work closely with software engineers to ensure our applications are designed with &quot;operability&quot; in mind\n   * Participate in a 24x7 on call rotation\n   * Ensure high reliability of our services\n</code></pre>\nQualifications<p><pre><code>   * Prior experience in an enterprise facing technical operations role\n   * 5+ years in a UNIX-based operations role\n   * Deep UNIX&#x2F;Linux systems knowledge and&#x2F;or systems administration background managing large business critical deployments\n   * Strong troubleshooting skills that span systems, network, and code\n   * Demonstrated programming skills in one or more of: Python, Ruby, Java, C, Shell\n   * Experience (not mandatory) with cloud technologies such as AWS, Google Cloud\n   * Previous experience in financial institutions highly welcome\n</code></pre>\nAbout Zest<p>ZestFinance, Inc. applies its unique credit-decisioning technology platform — based on data science and machine learning — to help lenders effectively predict credit risk so they can increase revenues, reduce risk and ensure compliance. ZestFinance was founded in 2009 by Douglas Merrill and a team of former Google employees with the mission of making fair and transparent credit available to everyone.<p>Apply here: <a href=\"https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?aj=oLmP4fwK&amp;s=Hacker_News\" rel=\"nofollow\">https:&#x2F;&#x2F;app.jobvite.com&#x2F;j?aj=oLmP4fwK&amp;s=Hacker_News</a><p>For other openings visit: <a href=\"https:&#x2F;&#x2F;www.zestfinance.com&#x2F;careers.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zestfinance.com&#x2F;careers.html</a>","time":1493672535,"type":"comment"}