{"by":"rachel_lim","id":14245959,"parent":14238005,"text":"Carousell | Backend Software Engineer | Singapore | Full-time<p>Carousell (<a href=\"http:&#x2F;&#x2F;carousell.com&#x2F;app\" rel=\"nofollow\">http:&#x2F;&#x2F;carousell.com&#x2F;app</a>) is a mobile classifieds app that makes selling as easy as taking a photo, buying as simple as chatting. With over 57 million listings, we are one of the world’s largest and fastest growing marketplaces. Carousell began in Singapore and has spread to 19 cities around the world. Carousell has also been ranked as the top Lifestyle and Shopping app in Singapore, Taiwan, and Hong Kong and was awarded Google Play Best Local App 2016 in Singapore.<p>Carousell is looking for a Backend Software Engineer to work on building the simplest buying and selling experience on our mobile application. Your responsibilities would be to:\n-Design and build scalable REST APIs for the Carousell marketplace platform.\n-Work with the Android, iOS, web, product and design teams to build innovative, robust, and easy-to-use features for our users.\n-Work with infrastructure team on performance profiling and optimisation.\n-Write clean, testable code with unit tests.\n-Participate in code reviews to maintain a high-quality code culture.<p>Requirements: \n-Degree in Computer Science, Software Engineering or other equivalent degrees&#x2F;experience\n-5+ years experience in software development\n-Deep experience in Python, Django&#x2F;Flask, RESTful APIs\n-Excellent knowledge of RDBMS and object caches such as PostgreSQL, Memcached, Redis and knowledge of how to design, tune and optimise SQL queries and caching strategies\n-Experience in building large, scalable distributed systems with good understanding of microservices architecture and associated principles\n-Experience with TDD&#x2F;BDD and agile methodologies<p>Good to have: \n-Experience using Elasticsearch\n-Experience using RabbitMQ, Kafka and microservices-based architecture\n-Knowledge and experience in building distributed, asynchronous task systems<p>Apply now at <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;ou4qd81\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;ou4qd81</a><p>Contact: sakshi.malani@thecarousell.com","time":1493730031,"type":"comment"}