{"by":"jonaliang","id":14243912,"parent":14238005,"text":"ThoughtWorks Pte. Ltd. | Senior &#x2F; Lead Software Developer Consultant | Singapore | Full-Stack Developer Consultant ONSITE<p>We are passionate technologists who believe in the power of software and technology as tools for social change. The people in ThoughtWorks Singapore are as diverse in personality as we are in our backgrounds, culture, and expertise.<p>If you’re someone who’s inspired by technology, by joining ThoughtWorks, you become part of a community. People join because they get to talk to the people who wrote the books that influenced them, work with the people who wrote the tools they would like to use, and collaborate on projects that propel change in the real world.<p>As a polyglot technologist at ThoughtWorks, you&#x27;ll get to\nthink through hard problems in a consultancy environment, and work with amazing people to make the solutions a reality.\nYou&#x27;ll be working in a dynamic, collaborative, non-hierarchical environment where your talent is valued over your job title or years of experience. You&#x27;ll spend your time building custom software using the latest technologies and tools in a highly hands-on capacity, usually in a pair-programming environment as we work with Agile Extreme Programming methodologies. You will craft your own career path here as we believe every individual is unique and there is no set path one must take to achieve one&#x27;s career goals and aspirations.<p>We are language agnostic, so we are not looking for anyone with expertise in a specific tech stack, as long as you&#x27;ve had at least 5 years of hands-on development and delivery experience in Java &#x2F; C# &#x2F; Ruby on Rails &#x2F; Python &#x2F; Node.js or any similar exciting technologies. You should possess great OO skills and strong design patterns knowledge, as well as a practitioner and advocate of software development best practices like Test Driven Development (TDD) and Continuous Integration (CI).<p>If you relish the idea of being part of a community that extends beyond the work we do for our customers, you may find ThoughtWorks is the right place for you. If you share our passion for technology and want to help change the world with software, we want to hear from you!<p>Apply here:\n<a href=\"https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;466063\" rel=\"nofollow\">https:&#x2F;&#x2F;www.thoughtworks.com&#x2F;jobs&#x2F;466063</a>","time":1493698418,"type":"comment"}