{"by":"lateguy","id":14244079,"parent":14238005,"text":"Accredible | www.accredible.com | Full Stack | Cambridge UK<p>Accredible is looking for a Full Stack Developer to continue building the best credentialing system in the world. A close, dedicated startup team who are passionate about improving the education system and backed by some of Silicon Valley’s top venture capital investors.\n4 hours per week (paid) to spend learning anything you like, even if it’s not related to your role, plus a budget to spend on materials.\nA promise to invest in your growth personally and professionally. Wherever you’d like to go and whatever you’d like to do we’ll be there to support you.\nYour Role &amp; Responsibilities<p>In the past three years we’ve built the best credentialing product in the world. Universities, associations, tech companies and others are able to create, deliver and manage tens of thousands of digital certificates and open badges with just a few clicks. We’re continuing to make this product as good as it can be and have been laser focused on the needs of credential issuers. Now we’re ready to start focusing on credential recipients; the people who take part in learning and then receive a certificate or badge.<p>Your role will be to build a great product for certificate recipients. You’ll be helping them to upload their own certificates, send transcripts to third parties, embed their certificate wallet in a website, view course recommendations that help them skill up, etc. You’ll be able to have a huge impact for thousands and thousands of users.<p>You won’t be doing this alone as we have a world-class product team you’ll be working with. You’ll have support from a designer, a back-end engineer, a project manager and another front-end engineer.<p>Compensation &amp; Benefits\n£40,000+ salary + equity, depending on experience.\nFlexible hours &amp; comfortable with working from home 2 days a week.<p>Your skills<p>We are looking for you to demonstrate to us that you have these skills:<p>Full stack engineering ability. You’ll be working in, AngularJS 1.6, Ruby on Rails, HTML, SASS and Javascript. Design and UX support is be available but you’re comfortable building and maintaining product features that go from front-end to back-end. We think you’ll spend more time writing AngularJS than anything else.\nProject management. You’ll agree with the team on your priorities and then you’ll take a leading role in planning and maintaining sprints to keep projects organised and to communicate effectively.<p>Apply here: \n<a href=\"http:&#x2F;&#x2F;accredible.breezy.hr&#x2F;p&#x2F;95745b89416c-full-stack-developer-at-accredible\" rel=\"nofollow\">http:&#x2F;&#x2F;accredible.breezy.hr&#x2F;p&#x2F;95745b89416c-full-stack-develo...</a>","time":1493701565,"type":"comment"}