{"by":"DLarsen","id":14241382,"parent":14238005,"text":"Connexity | Santa Monica, CA or Camarillo, CA | Full-Time | Onsite<p>Join a small, tightly-knit Data Science team as we transform our data assets into valuable business products. Although this group of 4 has a great deal of industry experience, we&#x27;ve only worked together in this capacity for about a year. This means that there&#x27;s still a lot of opportunity and green-field work ahead of us. The position could be described as a Sr. Data Scientist or Machine Learning Engineer. We work with billions of records per day and small hundreds of thousands of (messy!) features. We primarily use Scala&#x2F;Spark and Python, but we employ R, Ruby, plain old SQL and other tools on a regular basis.<p>We&#x27;d like to find someone familiar with Bayesian systems, Random Forest and other classification. Experience in ad-tech, e-commerce or online retail is a plus, but we strongly favor hiring someone with the right qualities that transcend mere familiarity.<p>More than anything we value sound judgement. It&#x27;s great if you have loads of tools in in your tool belt, but you really have to know when it makes sense to use them.<p>As you get involved with research or optimization work, we want to have confidence that you&#x27;ll have the right intuition about what questions to pursue and what questions to defer. With our high transaction volume, hundreds of unique models in production and hundreds of thousands of potential features, discernment is an essential virtue. We&#x27;ll always have 5x more questions and curiosities than we&#x27;ll have time to chase down. We&#x27;re looking for that person whose judgement is guided by experience possesses a knack for uncovering valuable, actionable insights.<p>Within our team I lean strongly toward the engineering side of the spectrum, but I&#x27;d be happy to have a conversation about our work. = dlarsen@connexity.com If you&#x27;re more comfortable going the typical HR route, I can probably streamline the first phases of communication.","time":1493671453,"type":"comment"}