{"by":"Trey_DeVries","id":14242813,"parent":14238005,"text":"Looker Data Sciences | Software Engineers | San Francisco, CA or Santa Cruz, CA | Onsite Fulltime |<p>WHO WE ARE\nLooker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data-driven and see yourself at Looker.<p>Looker is seeking experienced Full Stack Engineers to build out our cutting-edge data discovery platform. Looker is still a small team, so you’ll have the opportunity to work on many aspects of the product.  Actually, you’ll probably work on nearly all of it! You should have extensive experience and a proven track record solving web, database, and network engineering problems. Most of all, you should share a love of programming.<p>WHAT WE NEED YOU TO DO\n- Love building new technologies that have the power to impact businesses’ day-to-day operations and change the way companies make decisions.\n- Love working with a small team of highly-motivated individuals.\n- Possess innate passion for coding, building businesses, web development, and data!\n- Solve complex web engineering problems.\n- Be a teacher, mentor and foster a collegial atmosphere while giving and receiving feedback.\n- Take full ownership. Make Looker better.<p>WHAT YOU BRING TO LOOKER\n- 3+ years experience building highly-available, modern web applications.\n- A firm grasp of Computer Science fundamentals including object oriented design, data structures, algorithm design, problem solving and complexity analysis.\n- Expert knowledge of modern JavaScript, HTML, &amp; CSS, including libraries and frameworks.\n- Deep familiarity with at least one of these server side languages: Ruby, Python, Java, or similar.\n- Interest in working on or debugging many layers of the application stack, including issues as far-ranging as SSH tunnels to Java stack overflow exceptions.\n- Knowledge of how to identify, prevent, and resolve security issues in all layers of the application stack.\n- Authorization to work in the U.S. without visa sponsorship.<p>NICE TO HAVE\n- Past experience working in startups, building information visualizations, and&#x2F;or experience with BI and data discovery tools.\n- Experience managing databases and familiarity writing SQL queries.<p>Apply at: <a href=\"https:&#x2F;&#x2F;jobs.lever.co&#x2F;looker&#x2F;aa4f2ee6-fc83-4e7c-97d9-83c2dc2723b3\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.lever.co&#x2F;looker&#x2F;aa4f2ee6-fc83-4e7c-97d9-83c2dc2...</a>","time":1493682362,"type":"comment"}