{"by":"alexatkeplar","id":14240577,"parent":14238005,"text":"Snowplow Analytics | Open-Source Engineer | Remote, INTERN.<p>Snowplow Analytics is looking for 1-2 open source software interns this Summer (May through August), for a 8-12 week paid internship. Our interns will work directly on and contribute to projects within the Snowplow open source stack (<a href=\"https:&#x2F;&#x2F;github.com&#x2F;snowplow\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;snowplow</a>). A Snowplow intern loves coding, enjoys experimenting with new technologies and is happiest working &quot;in the open&quot; on community&#x2F;team projects. Technologies we use at Snowplow include Scala, Rust, Go, Hadoop, Kinesis, Redshift, Spark, Akka and Kafka.<p>This is a paid internship; we will consider remote candidates who are up to UTC +&#x2F;- 5 hours maximum. Interested? Please email intern@snowplowanalytics.com, and tell us about a piece of software you are proud to have written. (And don&#x27;t be afraid to suggest specific projects&#x2F;initiatives&#x2F;features that you would like to work on in your internship.)<p>For background on two of our recent internship programs check out:<p><pre><code>  http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;blog&#x2F;2016&#x2F;03&#x2F;17&#x2F;2015-2016-winternship-wrapup&#x2F;\n  http:&#x2F;&#x2F;snowplowanalytics.com&#x2F;blog&#x2F;2015&#x2F;07&#x2F;10&#x2F;introducing-our-2015-summer-interns&#x2F;\n</code></pre>\nSnowplow Analytics | Sysadmin | ONSITE London, UK<p>Snowplow is building out a dedicated Technical Operations team in 2017, and is looking for experienced systems administrators to join it. Initially this role is open only to candidates based in London or the South-East of England.<p>The sysadmins within our Technical Operations team will have four key responsibilities:<p>1. Handling deployments, upgrades and other maintenance of Snowplow-related infrastructure (load balancers, Redshift clusters, ASGs etc) for our Managed Service customers, across over 100 AWS accounts<p>2. Responding to customer issues and questions concerning Snowplow-related infrastructure, as escalated to you by our L1 Support team<p>3. Working with Snowplow SREs to design, deploy and operate Snowplow’s internal infrastructure, responsible for running the Snowplow Managed Service, the Snowplow website and other services<p>4. Being on call rotation to triage and resolve operational incidents relating to internal or client infrastructure<p>For more information: <a href=\"https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;systems-administrator&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;snowplowanalytics.com&#x2F;company&#x2F;careers&#x2F;systems-admini...</a>","time":1493666236,"type":"comment"}