{"by":"mclarke","id":14247473,"parent":14238005,"text":"Silicon Valley Bank | API Banking Engineer | San Francisco, CA | Full-Time | Onsite &#x2F; Remote (US) <a href=\"http:&#x2F;&#x2F;docs.svbplatform.com\" rel=\"nofollow\">http:&#x2F;&#x2F;docs.svbplatform.com</a><p>Enable the world of FinTech by building public APIs for commercial banking. We&#x27;re using clojure &amp; postgres to expose brand new, easy to use, well documented RESTful interfaces for clients. Among other projects we work on, our small team created the technical integration with Stripe that powers Atlas (<a href=\"https:&#x2F;&#x2F;stripe.com&#x2F;atlas\" rel=\"nofollow\">https:&#x2F;&#x2F;stripe.com&#x2F;atlas</a>). Our team consists of former Facebook, Disqus, and Standard Treasury (YC S13) engineers; startups are in our DNA.<p>With an aggressive roadmap of new products we&#x27;d like to launch in 2017, we&#x27;re looking to expand our team to help deliver new APIs. While we don&#x27;t currently have any full time remote employees on our team, we are open to remote US-based engineers helping us become a fully-distributed team.<p>Our interview process is designed to be respectful of your time; we have a short (~1h quiz) to get a baseline assessment of your technical skills, followed by a broader parsing problem (~4h project) to understand how you solve technical problems in a more realistic scenario. Both steps can be submitted on your schedule. These code samples minimize complications with whiteboard interviews and establish a consistent sample for all applicants.<p>Unfortunately, we&#x27;re not able to provide detailed feedback on individual submissions, and we can&#x27;t sponsor visas at this time.<p>This is the third or fourth month in a row that we&#x27;re posting this same job post, and we have met many great folks (especially those as enthusiastic about Clojure as we are!), some of whom have joined our team. We&#x27;ve grown and will continue to grow as we build this product into a world-class banking API. Come join us!<p>Separately, we have a product manager role now available as well, where you can help us define and execute against the aggressive roadmap we have in front of us. More info on that role is available here: <a href=\"http:&#x2F;&#x2F;docs.svbplatform.com&#x2F;jobs&#x2F;pm.html\" rel=\"nofollow\">http:&#x2F;&#x2F;docs.svbplatform.com&#x2F;jobs&#x2F;pm.html</a><p>Contact Mike at api-jobs@svb.com for more information and to apply.","time":1493740668,"type":"comment"}