{"by":"Naveg","id":14250767,"parent":14238005,"text":"Alloy | San Francisco, CA and Vancouver, BC | Full-time, Onsite | <a href=\"https:&#x2F;&#x2F;alloy.ai\" rel=\"nofollow\">https:&#x2F;&#x2F;alloy.ai</a><p>Over $20 trillion worth of goods are manufactured, transported, and sold each year - the things we use, wear and eat every day. The global supply chain is one the world&#x27;s largest economic engines.<p>The manufacturers, distributors, brands, and retailers that make up this complex network struggle to track and respond to supply and demand as their products travel from production to consumer. Those who try rely on 40-year-old data standards, lots of manual Excel work, and hordes of human middleware.<p>Alloy is an end-to-end supply chain visibility platform that provides the first comprehensive, low-latency view of demand and inventory across all distribution channels. Our platform connects manufacturers, suppliers, distributors, and retailers, allowing businesses to track their products down to the store shelf and better respond to end-consumer demand. We tie all of this information together with smart notifications that help get products to the right place at the right time.<p>We are post-revenue, well funded by leading VCs, and growing rapidly, with large contracts from some of the world&#x27;s most recognisable brands. Our small team has diverse backgrounds and experience in analytics, large-scale enterprise SaaS, and retail and financial technology. Culture really matters to us: we value diversity in all forms and strive to foster integrity, respect, and open communication.<p>We use Google Cloud Platform, Postgres, Redis, Python, modern Java, and React, all wrapped in beautiful design.<p>== About You ==<p>You thrive in a small team where you can build technology from the ground up. You love to pick up new tech, master it quickly, and do something creative with it.<p>You don’t shy away from even the most challenging problems and are relentless in always looking for better solutions. You are self-motivated and enjoy working with others towards a common objective. Building software is the means to an end: you want to change the way an entire industry operates.<p>As an engineer at Alloy, you’ll do any or all of the following:<p>* Model parts of the supply chain and develop features that bring them together<p>* Automate the collection, parsing, and storage of huge volumes of data<p>* Design a flexible but blazing-fast analytics framework that powers instant insights<p>* Build beautiful, easy-to-use applications that our customers love to use<p>* Dive into server provisioning, deployment, automation, and monitoring<p>We would love to hear from you - send me a note at evan@alloy.ai","time":1493760242,"type":"comment"}