{"by":"AnuPrakash","id":14256398,"parent":14238005,"text":"Dodge Data &amp; Analytics|Software Business Analyst, Director, Technology Operations, Senior Software Engineer (MuleSoft), |Hamilton, NJ| Onsite, Full Time<p>Dodge Data &amp; Analytics is North America’s leading provider of construction project information and analytics. Building Product Manufacturers, Architects, Engineers, Contractors, and firms that support them, leverage Dodge to identify and pursue unseen growth opportunities and execute on those opportunities through industry-wide workflow solutions supported by Dodge. We are industry experts and forward-looking partners to many of the nation’s construction and building product manufacturing leading companies. Whether it’s on a local, regional or national level, we allow our clients to better understand their markets, uncover and size hidden growth opportunities, and pursue those opportunities. We do this by providing construction project information, key insights into industry relationships and integrated workflow tools. As we look ahead, we’re leveraging our 100-year-old legacy to reinvent ourselves and help the industry meet the building challenges of the future.<p>To learn more, visit www.construction.com.<p>If interested in applying for these positions, please use the appropriate link below:<p>software-business-analyst: <a href=\"https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;e7ee92120676\" rel=\"nofollow\">https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;e7ee92120676</a><p>Director-technology-operations:\n<a href=\"https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;d220c8b93525\" rel=\"nofollow\">https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;d220c8b93525</a><p>Senior-software-engineer-mulesoft:\n<a href=\"https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;39a1a7fdcfb5\" rel=\"nofollow\">https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;39a1a7fdcfb5</a><p>Senior-software-engineer:\n<a href=\"https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;b2d512a553a4\" rel=\"nofollow\">https:&#x2F;&#x2F;dodge.breezy.hr&#x2F;p&#x2F;b2d512a553a4</a><p>For all other openings, please visit our career page: \nwww.construction.com&#x2F;jobs","time":1493824620,"type":"comment"}