{"by":"janpaul123","id":14261975,"parent":14238005,"text":"Remix (YC W15) | Backend, full-stack, algorithm engineers, and more | San Francisco | ONSITE, VISA<p>Join us in building a real-life SimCity.<p>Today, cities use pen and paper to make planning decisions that affect millions of people&#x27;s lives. We think there&#x27;s a better way. We&#x27;ve built a web-based platform that helps city planners make much smarter decisions.<p>Originally started at Code for America, we&#x27;re now working with 200+ cities including Atlanta, Sydney, Boston, Miami, San Francisco, Reykjavik, and Seattle. All in just two years. Learn more about our product at <a href=\"http:&#x2F;&#x2F;remix.com\" rel=\"nofollow\">http:&#x2F;&#x2F;remix.com</a>.<p>We’re looking for engineers across our stack to write robust code that drives the world’s first transit planning platform. We use:<p>- Mapping: OpenStreetMap, Mapbox, Mapzen, Leaflet, TWKB, GTFS, PostGIS, ogr2ogr<p>- Back-end: Ruby, Rails, Python, Flask, PuLP, COIN-OR Branch and Cut solver (CBC), Cython, Sidekiq, PostgreSQL, Redis<p>- Front-end: React, Webpack (with Hot Module Replacement), ES6&#x2F;Babel, LESS, CSS Modules, Yarn<p>- Testing: CircleCI, RSpec, Approvals, WebMock, puffing-billy, Capybara, Jasmine, Happo, Browserstack, Overcommit, Codecov (&gt;75% coverage front+back-end)<p>You’ll work on (for example):<p>- The scheduling algorithm that turns a Remix map into work sheets for bus drivers<p>- Visualisations for use in public meetings, such as the “Jane” (Jacobs) isochrones tool (<a href=\"https:&#x2F;&#x2F;blog.remix.com&#x2F;remixs-isochrone-visualizes-travel-time-e703b9f929d8\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.remix.com&#x2F;remixs-isochrone-visualizes-travel-ti...</a>)<p>- Our geo-database of open data (transit and census)<p>- Live-updating costing models and simulations<p>- Our demographics tool that helps transit agencies serve their communities equitably (per the Civil Rights Act of 1964)<p>Go to <a href=\"http:&#x2F;&#x2F;remix.com&#x2F;jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;remix.com&#x2F;jobs</a> to apply and to see all our openings (design, data, sales, customer success, etc). We are committed to a workplace that reflects the community we serve. We especially encourage women, people of color, and others who are underrepresented in the tech industry to apply.","time":1493865072,"type":"comment"}