{"by":"jangid","dead":true,"id":14271604,"parent":14238005,"text":"Optimizory | Software Engineer - Back End | NOIDA, India | ONSITE, SALARY: 350k-500k INR, <a href=\"http:&#x2F;&#x2F;www.optimizory.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.optimizory.com&#x2F;</a><p>Optimizory was created with a vision of building innovative products, which address key problems faced by the target segment. We are now proud owners of two segment leading products vREST and RMsis.<p>We strongly believe that people are the key constituents of a great company and hence look forward to working with people with diverse ideas, a lot of energy and a deep expertise in their domain.<p>The culture in the company is very informal with lots of flexibility in all respects and you get to work with some of the brightest people in the industry.<p>The position of <i>Software Engineer - Back End</i> involves developing server side functionality of web applications. The job involves<p>- Developing, integrating and testing components for RMsis (a web app)\n- Developing POC&#x27;s for functions under consideration\n- Though we expect the potential team member to be open to new technologies, currently the work involves the following\n  - Programming in JAVA AND&#x2F;OR Scala\n  - Use of Spring, Hibernate, Play, Akka frameworks\n  - Multiple databases including Postgres, MySQL &#x2F; MariaDB, Oracle, SQL server<p>We are looking for team members with<p><pre><code>  - A degree in Computer Science and a deep understanding of the subject\n  - Ability to quickly learn and adopt new technologies and languages\n  - A complete understanding of Web Stack&#x2F;familiarity with web technologies and frameworks\n  - Experience&#x2F;familiarity with message based &#x2F; Asynchronous design is desirable\n  - 0-1 year experience\n</code></pre>\nThe selection process has three stages — (1) Online Programming Test (2) Video Chat (3) Onsite Interview.<p>To apply, send your resume to career@optimizory.com","time":1493967538,"type":"comment"}