{"by":"clured","id":14273933,"parent":14238005,"text":"Open Syllabus Project | Web Applications Developer (Python and Javascript) | Full-time | NYC or Remote<p>The Open Syllabus Project is an academic data mining project based at Columbia University that&#x27;s analyzing a corpus of 1M+ college course syllabi. We launched a beta version of the project with an op-ed in the New York Times last year [1].  Since then the project has appeared in Nature, Time, The Washington Post, The Chronicle of Higher Education, MarketWatch, Der Spiegel, Business Insider, Lifehacker, FiveThirtyEight, WNYC, QZ, and elsewhere. It&#x27;s also been picked up by major news outlets in Europe, Russia, China, Japan, South Korea, Ukraine, Egypt, and Mexico. With new funding from the Sloan, Hewlett, and Templeton foundations, we&#x27;re working towards second release of the project that will feature much larger collections of syllabi, books, authors, institutions, and publishers.<p><a href=\"http:&#x2F;&#x2F;explorer.opensyllabusproject.org&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;explorer.opensyllabusproject.org&#x2F;</a><p>We&#x27;re hiring a full-stack web applications developer to take a leading role in the development of these public-facing web services. We&#x27;re looking for a developer who has significant experience at both layers of the web stack - someone who enjoys building large, stateful Javascript applications, and also is able to build and maintain the server-side APIs that feed these client applications.<p>PROJECTS<p>- Build a API in Python (Flask or Django) that organizes the results of the metadata extraction pipeline into web-facing data stores (Elasticsearch, Postgres) and exposes well-structured REST endpoints for the client application.<p>- Build a front-end application using React and Redux &#x2F; MobX that surfaces the data on the web.<p>- Work with the data engineering team to define data requirements for the front end application.<p>QUALIFICATIONS<p>- 3+ years of professional experience in software engineering.<p>- Demonstrated ability to build high-quality, fast web applications that serve sizable traffic.<p>- Experience building large, stateful Javascript applications with React and React-ecosystem libraries like Redux and MobX.<p>- Experience with modern Javascript build tools like Webpack or Gulp.<p>- Experience with server-side Python development with Flask or Django.<p>- Commitment to sustainable engineering practices - automated testing and deployment, continuous integration, and reproducible development environments.<p>- An eye for clean, readable, extensible, well-tested code.<p>- Experience with remote &#x2F; distributed collaboration on GitHub.<p>Drop us a line at syllabusopen@gmail.com.<p>[1] <a href=\"https:&#x2F;&#x2F;www.nytimes.com&#x2F;2016&#x2F;01&#x2F;24&#x2F;opinion&#x2F;sunday&#x2F;what-a-million-syllabuses-can-teach-us.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nytimes.com&#x2F;2016&#x2F;01&#x2F;24&#x2F;opinion&#x2F;sunday&#x2F;what-a-mil...</a>","time":1493996609,"type":"comment"}