{"by":"nlavezzo","id":4596615,"parent":4596375,"text":"FoundationDB - Vienna, VA (DC Suburb) - Evangelist remote, core engineer must be local but we would consider relocation expenses.<p>FoundationDB (<a href=\"http://foundationdb.com\" rel=\"nofollow\">http://foundationdb.com</a>) is fundamentally new database technology, built completely from the OS up. It is a NoSQL database (distributed, ordered key-value design) with high levels of fault tolerance and performance, but with the most important missing feature given up by other NoSQL databases - true ACID transactions. Our primary value proposition is that we give you the best of both worlds - the distributed design / scalability, fault tolerance, and flexible data models of NoSQL, and the strong data consistency guarantees of single machine relational databases.<p>We are well funded, and are currently in the latter stages of our alpha program and have a very long and impressive list of alpha users that includes \"household\" tech names. Public beta is expected soon.<p>Who we're looking for:<p>A software engineer to add to our core development team. The most important traits this person should have are a strong background in computer science, experience working with distributed systems, and a desire to work on and solve difficult problems in an interactive team setting. Some pluses would include C++ and Java experience. Must be a friendly person who enjoys working with other people as we are a very team-centric environment.<p>A Developer Evanglist - this person should have experience building interesting applications using popular technologies such as Ruby on Rails, Django, etc. and be able to show us a few cool projects they've worked on. They should also be able to interact well with new people (they will be attending conferences on our behalf, visiting offices of other startups, etc.) and be well spoken, both in small groups and on stage giving presentations. Must also be willing and able to interact heavily with the developer community on popular social networking sites. The ability to write some thoughtful blog posts would be great as well. Ideally this person would be located in (or willing to move to) NYC or the Bay Area, so that we can have a more ongoing presence in those places.<p>Apply at info@foundationdb.com","time":1349095557,"type":"comment"}