{"by":"ramanujam","id":4596487,"parent":4596375,"text":"Monetate - Conshohocken, PA (Philly suburb) - No remote, but we will help you relocate.<p>Monetate is a SAAS provider of testing, targeting and personalization tools (e.g. A/B - MVT testing, recommendation engines etc). We turn data in action on our clients' sites by doing real-time DOM modification to put the right experience in front of their users. We’re looking for engineers who want to do highly visible work on great brands and solve tough problems with great coworkers.<p>What we're looking for:<p>* Problem solvers who like to code - we take things apart, figure out how they work, then build software to solve users' problems<p>* People who like to ship - we're focused on building and shipping great products - if you like to see your work in production quickly you'll see it here<p>* Use the source - Google Closure to Python, Hadoop and Mahout to Solr and Lucene - we're open source across our stack<p>* People who like hard challenges - we have great problems across our products - data, UX, 3rd party JS, high volume / low latency APIs - we have no shortage of fun problems to work on<p>About us:<p>* Founded in 2008<p>* We pay market rates<p>* Respect - it's our core value. We have a great team and we work well together. Our vacation policy is the same as Netflix (we don't have one). Our technical teams have full authority over (and responsibility for) the problems they work on.<p>* Funded by First Round and OpenView<p>We're looking for people not positions. We have people who have joined the team with no background in our primary languages and people from non-traditional backgrounds. Check out our blog at <a href=\"http://engineering.monetate.com/\" rel=\"nofollow\">http://engineering.monetate.com/</a> and see more about our open jobs at <a href=\"http://monetate.com/jobs/\" rel=\"nofollow\">http://monetate.com/jobs/</a><p>I got hired via HN about two years ago and we do have a good number of engineers in the team who found Monetate through one of these threads.<p>Feel free to email tjanofsky &#60;at&#62; monetate com with any questions or to apply.","time":1349093730,"type":"comment"}