{"by":"avar","id":4596963,"kids":[4598481],"parent":4596375,"text":"Amsterdam, The Netherlands. H1B[1]<p>Booking.com is always on the lookout for good developers, DBA's and sysadmins on-site in the center of Amsterdam. I'm a developer there currently working on infrastructure tasks and relocated over there about two years ago, and have been very happy with it.<p>We have people from all over the world relocating to work with us and are very well set up to handle relocation and visa issues, most of the people working in IT are expats so we've got a lot of experience with bringing people in.<p>It's a rapidly growing company that represents the biggest chunk of the Priceline (PCLN) group of companies where problems that look relatively mundane on paper become much more interesting due to the scale and growth levels we're operating at.<p>We use Perl for almost everything with a MySQL backend and Git for development. We get our changes out really fast, it's rare for your code not to be on our live systems within hours of you pushing it. We're also very open to open sourcing code that doesn't contain any business logic, I've personally been involved in open sourcing a few of our internal tools, including <a href=\"https://github.com/git-deploy\" rel=\"nofollow\">https://github.com/git-deploy</a> and a few CPAN modules.<p>We have a relatively flat hierarchy with minimum levels of bureaucracy since we're very data driven and have a clear goal: helping our customers. Everything we do is aimed at solving problems for our customers, if it doesn't help our customers we're not interested in doing it. You don't have to know Perl in advance to be a developer there. We've hired people who've done C, Java etc. before. The sort of people we'd like to hire are good technically, excellent at communication, and can acquire a good sense of how they fit into the big picture.<p>I'd be happy to answer any questions at avarab@gmail.com and/or forward your resume, I've posted in a similar thread here a couple of times before and have already helped get one person hired, many others have had or are having interviews, and I've fielded a bunch of questions from would-be applicants. <a href=\"http://booking.com/jobs\" rel=\"nofollow\">http://booking.com/jobs</a> also has some good information.<p>1. Well, not H1B, but we'll take care of the Dutch equivalent.","time":1349099869,"type":"comment"}