{"by":"larrysilverman","id":4597055,"parent":4596375,"text":"Telecommute, US :: TrackAbout :: Full Time<p>.NET Web and Mobile, 6 open positions<p><a href=\"http://www.trackabout.com\" rel=\"nofollow\">http://www.trackabout.com</a><p>Apply Here: <a href=\"http://trackabout.theresumator.com/apply/LLlGPw\" rel=\"nofollow\">http://trackabout.theresumator.com/apply/LLlGPw</a><p>TrackAbout is a small (&#60;40) but successful SaaS company providing tracking and rental services for durable, returnable assets. Our customers use a variety of mobile devices to scan assets (RFID and barcodes) every time they touch or move them. We have customers around the globe.<p>We are experiencing high demand for our services and we are growing. We need great people who are interested in playing pivotal roles in the growth of a small company. Our customer base is very dependable and we are doing well despite the economy.<p>Our headquarters is just outside the Pittsburgh International Airport in Pennsylvania, but our entire development staff is work-from-home.<p>We are seeking exceptional developers who are truly passionate about technology and the craft of software development. All members of our development team are dedicated to keeping up with the latest technologies, practices, patterns and tools related to software development. We do peer programming and collaboration on a regular basis. We take time out to share our knowledge with one another and improve both our skills and our distributed development environment. We often experiment with and integrate new tools into our environment.<p>Stuff we use includes: .NET 4.0, jQuery, Backbone.js, MonoTouch for iOS, Mono for Android (Xamarin tools), ReSharper, Mecurial (Hg) and Subversion, MassTransit Lean Service Bus, Jenkins CI, VersionOne, Trello, MediaWiki, WCF/Web API and RESTful web services, RhinoMocks, Ninject, NHibernate.<p>TrackAbout has a Developer Free Time policy intended to promote creative thinking and innovation by providing developers an opportunity to contribute new ideas and technologies for the benefit of the company.<p>We host an annual Dev Con where all the remote developers are brought together for a week to strategize, tackle tough issues, bug bash, socialize and have fun.<p>We promote continuous improvement in every aspect of our work. After each release we hold a retrospective and discuss how we can do better.<p>Our published core values are:<p><pre><code>  * Believe in the Power of Storytelling\n  * Work with Great Passion and Enthusiasm\n  * Celebrate Problem Solving\n  * Foster a Fun and Friendly Atmosphere\n  * No Egos &#38; No Yelling\n</code></pre>\nApply Here: <a href=\"http://trackabout.theresumator.com/apply/LLlGPw\" rel=\"nofollow\">http://trackabout.theresumator.com/apply/LLlGPw</a>","time":1349100852,"type":"comment"}