{"by":"driedyam","id":4598728,"parent":4596375,"text":"SocialChorus - San Francisco, CA \nFull-time, full-stack Ruby On Rails Developers<p>SocialChorus is a social marketing and SaaS technology company. Until recently, word-of-mouth marketing did not have the scale, efficiency and ROI that global brands demanded. Our platform enables direct and enduring relationships between brands and thousands of their best advocates and fans. Equipped with a real-time performance dashboard, our clients take the guesswork out of their social marketing ROI. With over 25 Fortune 500 brands already using our software, our team is defining how brands leverage social influence to build sustained earned media. Backed by Kohlberg Ventures, SocialChorus has offices in New York City and San Francisco. <a href=\"http://socialchorus.com\" rel=\"nofollow\">http://socialchorus.com</a> @SocialChorus<p>On to our development practices. We are on Rails 3.2.5 with deployment on Heroku and test driving EVERYTHING with Rspec, Jasmine, and Selenium. Every Monday we have an internal planning meeting that includes the dev team along with our project manager to go over upcoming features, stories that need discussion, and story estimation (Pivotal Tracker). Mornings start with stand-ups to go over the previous day's work, work for the current day, or any blockers anybody might have. Pair programming and green tests make the day fly by with the gratification of clean code without broken windows. Our analytics module runs in EC2, hitting nginx, aggregating all data into our sharded MongoDB database. Like to map/reduce over extremely large data sets? Sweet.<p>Great startup environment with a kegerator, ping pong table, Ruby Meetups every 3rd Thursday, Settlers of Catan, Bang!, Dominion, and poker tournaments! Food trucks every wednesday and friday too. Come join our team at: <a href=\"http://www.socialchorus.com/company/jobs\" rel=\"nofollow\">http://www.socialchorus.com/company/jobs</a> or email jobs@socialchorus.com","time":1349117900,"type":"comment"}