{"by":"hartard","id":4598260,"kids":[4599114],"parent":4596375,"text":"Google | Customer Solutions Engineer | Full time | Mountain View, CA<p>As a Customer Solutions Engineer, you will utilize both your technical aptitude and exemplary communication skills to drive business with Google's top-tier customers. You will work with our Sales, Sales Operations, Product Management, and Engineering teams to improve the online presence of our clients by providing technical solutions that include products such as the AdWords API and YouTube custom channels. You will develop value propositions, present business arguments, create proofs-of-concept, and evangelize Google technologies. You will interact frequently and closely with our customers on both technical and non-technical levels. The CSE role allows you to apply both your technical skills and business acumen in the fast-paced world of Google sales.<p>Requirements:<p><i>Minimum: BS degree in Computer Science or related major (In lieu of degree, 5 years of work experience in relevant field).<p></i>Minimum: Application development experience within the UNIX and/or Windows environments.<p><i>Minimum: 2 years coding experience in Java, Python, C++, or PHP<p></i>Minimum: 2 years technical background in Web technologies such as HTTP, HTML, XML, DNS, and TCP/IP.<p><i>Minimum: 2 years Technical sales or field sales experience, with strong business knowledge; sales engineering or professional consulting experience<p></i>Minimum: Excellent communication skills.<p><i>Preferred: MS degree in Computer Science or related major.<p></i>Preferred: 5+ years Technical sales or field sales experience, with strong business knowledge; sales engineering or professional consulting experience<p>*Preferred: Proven ability to adapt your message to the technical level of the audience and comfort presenting technical materials to large groups.<p><a href=\"http://www.google.com/about/jobs/locations/mountain-view/client-facing/technical-sales/sales-engineer-gtech-mountain-view.html\" rel=\"nofollow\">http://www.google.com/about/jobs/locations/mountain-view/cli...</a>","time":1349112774,"type":"comment"}