{"by":"saumil07","id":4599825,"parent":4596375,"text":"LocBox, San Francisco, Frontend Engineer, Rails Developer, Data Scientist, Relocation<p>Dear (Future) LocBox Engineer,<p>It’s only October 1st and this thread has become so noisy that you’ve either a) resorted to keyword searches OR b) gone back to the 10 blank check offers you’ve received in the last 6 minutes OR c) rightfully concluded that YOU are the world’s most interesting man/woman.<p>With that in mind (and after this author has cried quiet tears about the cooler job market when they graduated MSCS ‘05), let’s get the relevant keywords out of the way: Ruby, Rails, HTML, CSS, JavaScript, Information Retrieval, CoffeeScript, Backbone, San Francisco, product/market fit, Local, Offline-to-Online, Predictable Revenue, Not-A-Game.<p>Now that generic recruiter-style keywords are published, let me attempt to stand out from the crowd - I’m CEO at LocBox (<a href=\"http://www.getlocbox.com\" rel=\"nofollow\">http://www.getlocbox.com</a>) and we’re rethinking the way local businesses generate revenue and foot traffic from their customers.<p>Most local businesses resort to unsustainable daily deals or boring Email Marketing to acquire and retain customers. We reject that status quo and our hundreds of (paying) customers agree. We’ve also developed a new search/crawl/tech-centric way of acquiring our own customers and disagree with the wildly obsolete feet-on-street Sales model. The company is small but generating material and predictable revenue.<p>We’re venture-funded (2.5+ years cash in the bank), are working on interesting technology problems and pride ourselves on working hard, drinking bacon-flavored vodka and keeping bureaucrats out. And if you care about it, yes, we have a super-nice office with Bay Bridge views and non-mandatory Halo parties.<p>Talk to Us? <a href=\"http://www.getlocbox.com/careers\" rel=\"nofollow\">http://www.getlocbox.com/careers</a>, saumil at getlocbox dot com, <a href=\"http://blog.getlocbox.com\" rel=\"nofollow\">http://blog.getlocbox.com</a>","time":1349133136,"type":"comment"}