{"by":"jtmcmc","id":4604161,"kids":[4604357],"parent":4596375,"text":"Playhaven - San Francisco - Support and Engineering jobs<p>Playhaven is a pretty exciting mobile startup based out of SOMA. We're helping mobile games companies monetize their games and we need engineers as well as support managers. We're a very relaxed and informal company where everyone knows how to work and have fun. You can see the full list of our jobs at <a href=\"http://www.playhaven.com/team\" rel=\"nofollow\">http://www.playhaven.com/team</a> and feel free to email me justin@playhaven.com with any questions. Some of our jobs include:<p>Support Manager:<p>Responsibilities:\nAssist developers in using our product with an emphasis on optimal efficiency.\nEnsure developer success by managing support tickets from triage to resolution.\nAssist in writing technical documentation.\nTroubleshoot potential system or integration bugs.\nServe as the liaison between the client and Product and Engineering team.<p>Requirements:\nA strong programming background<p>Understands RESTful APIs and web scale technologies<p>Excellent communication skills in English, particularly written communication<p>Demonstrated creative problem-solving approach and strong analytical skills<p>A desire to learn rapidly in a fast paced environment<p>and<p>Sr. Android Developer -<p>Responsibilities:\nTake ownership of the PlayHaven Android SDK, which is integrated into thousands of games:\n<a href=\"https://github.com/playhaven/sdk-android\" rel=\"nofollow\">https://github.com/playhaven/sdk-android</a> . \nCollaborate with talented engineers and product managers to design and implement new features. \nWork with QA to ensure compatibility with the ever-growing set of Android devices in the market. \nDevelop reliable software in rapid iteration cycles and push code to thousands of Android games, including many top tier titles. \nOpportunity to expand into other domains, including iOS and Unity development.<p>Requirements:<p>BA/BS in Computer Science, Computer Engineering or related field<p>2+ years of professional Android development experience\nGeneral familiarity with iOS<p>Experience writing robust and testable Java code<p>Ability to diagnose and troubleshoot customer issues<p>Desired:<p>Experience specific to the development and maintenance of Android SDK packages<p>General familiarity with iOS<p>Unity3D game and/or plug-in development experience is a big plus<p>Passion for the Android platform<p>Love of mobile gaming<p>Good sense of humor :)","time":1349210681,"type":"comment"}