{"by":"meganelacarte","id":4628750,"parent":4596375,"text":"E la Carte - Palo Alto, CA - full-time Front End Engineer<p>E la Carte is revolutionizing the restaurant industry with our Presto touch-screen tablets, which enable guests to browse appetizing pictures of the entire menu, place orders, split checks, make payments, and play interactive games – all from the comfort of their restaurant seats without having to wait.<p>Join our tight-knit team of 35 (~10 Engineers from MIT, Microsoft, and Amazon) in our Palo Alto house and help us scale up this fast-growing company. You'll wear lots of hats, have immense room for professional development and growth, and be able to make a huge impact on our product and organization. Our platforms are complex and we learn new technologies daily.<p>As a Front End Engineer, you'll build a new interface for our restaurant guest experience using the latest web technologies with embedded hardware. Day to day you will:<p>• Work with designers to develop a fully functional interface for a number of purposes.\n• Tackle the challenge of guiding interactions of new guests while making the experience enjoyable for staff making use of it daily.\n• Design extensibility for optimal fixed-hardware layouts while supporting any number of potential future platforms.<p>You'll be given a lot of flexibility but we have a few unalterable rules: be straight-forward, own your work, stay in touch, and get stuff done. We have fun too - dominate other startups with us in soccer matches, take a break for an impromptu counterstrike battle or real-life paintball, or chow down at our monthly BBQ.<p>Desired Skills &#38; Experience<p>• Graphics software to manipulate designs, as well as graphics development toolkits.\n• Python, C++ or similar language with cross-platform development experience.\n• Web technologies (HTML5/CSS3/JavaScript), including advanced web frameworks such as Ember.js, KnockoutJS and Backbone.js.\n• Qt, PySide and/or mobile development platform familiarity a huge plus.<p>Let us judge you on your skills rather than your resume by taking our challenge at www.elacarte.com/challenge OR if you prefer the typical application route, you can email us at hiring@elacarte.com","time":1349730641,"type":"comment"}