{"by":"pytrin","id":6310612,"parent":6310234,"text":"Binpress (<a href=\"http://www.binpress.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.binpress.com</a>) Mountain View, CA. We provide a platform for developers to build profitable businesses from their open-source projects. We are a funded startup that&#x27;s already generating significant revenue.<p>--<p>CMO &#x2F; Head of growth<p>We are looking for a creative thinker who is experienced with all online marketing channels, including paid acquisition, search marketing, social and online communities, and Email marketing, and has a knack for using unconventional methods to acquire customers (i.e, growth hacking).<p>Ideally you are intimately familiar with the software development process and with marketing developer tools. Responsibilities include:<p>* Outlining and executing immediate and long-term marketing plans.<p>* Breaking down marketing plans into action items and being accountable for getting it done.<p>* Analyzing marketing performance and constantly adjusting strategy.<p>* Coming up with creative ideas for impact growth through unconventional methods.<p>* Helping us build our marketing team.<p>* This position is an onsite position - no remote.<p>Developer Evangelist<p>we want you to help us build the online presence of Binpress and evangelize our platform to developers. As our evangelist you will:<p>* Reach out to potential publishers and community influencers, both inside and outside our community.<p>* Attend conferences and meetups as our official representative with Binpress schwag.<p>* Write content on our blog around the topics of open-source, software licensing, and general software development topics.<p>* Help us refine our core messaging through interacting with developers in and outside our community.<p>* Organize other people in different locations to do what you do in their local developer community.<p>* Remote is possible, but preference for someone local<p>We have a couple of other positions you can find through our AngelList jobs - <a href=\"https://angel.co/binpress/jobs\" rel=\"nofollow\">https:&#x2F;&#x2F;angel.co&#x2F;binpress&#x2F;jobs</a>\nYou can connect with us through there, or by sending your details directly to me at eran@binpress.com (I&#x27;m the CTO and co-founder). If you do send your details in through either channel, please include a note about which role you are applying for, and how you think you can help us in that capacity.","time":1378047659,"type":"comment"}