{"by":"emidln","id":6310546,"parent":6310234,"text":"Chicago, IL (Loop). Full time. Clojure and ClojureScript<p>OpinionLab is seeking a Sr. Software Engineer with strong functional \nprogramming skills to join our Chicago, IL based Product Development team.<p>About Us:<p>We help our clients listen to customer feedback and respond in real time. We have\nestablished clients (Wal-Mart, Bank of America, Ford Motor Company, Verizon,\nPayPal, to name a few) with production solutions for feedback ranging from Websites \nand mobile devices to In Store Displays and physical goods. We process \nstructured and unstructured data into actionable customer insight. Our\nphilosophy is so simple it&#x27;s groundbreaking: listen always, listen everywhere.<p>Tech Details You Care About:<p>- Frontend: ClojureScript, Bootstrap 3\n- Backend: Clojure, Storm, Redis, ElasticSearch, Datomic, PostgreSQL\n- Monitoring: Sentry, StatsD\n- Deployment: AWS. Git-&gt;GiHub-&gt;BuildBot-&gt;((Archiva&lt;-Salt) or (S3&lt;-CDN))<p>What We&#x27;re Offering:<p>- Competitive salary commensurate with skills, education &amp; experience \n- Generous benefits include medical, dental, life and disability insurances, \n  paid holidays, vacation and sick days, 401K with employer match, &amp; FSA plan\n- Casual workplace environment in the heart of Chicago\n- Interesting problems\n- Fun technology<p>Our Requirements:<p>- Willingness to use (possibly learn) Clojure and ClojureScript\n- Self-motivated with ability to work in informal and relaxed environments\n- Unnatural love of your REPL\n- Proficiency with a development environment (Mac, FreeBSD, Linux, Windows, just\n  be good with something)\n- Strong written, visual, and verbal communication skills (we like whiteboards)\n- Fluent in English\n- Experience with message-passing systems<p>Your Responsibilities:<p>- Understand our system from top to bottom\n- Code what needs to be exist\n- Test the under tested\n- Document the under documented\n- Help wrangle life on the bleeding edge (we keep things like core.async and\n  Storm under internal CI out of necessity) \n- Know or learn the languages and tools we use\n- Participate in design discussion, tech reviews, and open source projects\n  as necessary<p>Reach out to careers@opinionlab.com","time":1378046508,"type":"comment"}