{"by":"xtracto","id":6310856,"parent":6310234,"text":"(This is mainly aimed for people in Mexico)<p>Hello,\nThe company I work for is growing quite fast. Right now there are a lot of open positions form various technical roles (requiring varying degrees of technical skills) in Guadalajara.<p>Among the open positions there is:<p>- Software Engineer: Responsible for developing amazing software. Requiring outstanding programming skills.<p>- Technical Support Engineer: Responsible for of solving customer technical issues. Requiring great communication and problem solving skills. Must be technical (know web-dev technologies) but not as hardcore-developper as for a Software Engineer.<p>- Technical Support Engineer II: Same as previous, but with more experience in a tech-support role.<p>- Technical Support Manager: Same as previous but with experience in a managerial roles.<p>- Front-End Software Engineer: Responsible for implement next-gen front-end solutions. Requiring very good (ninja&#x2F;leet&#x2F;hax0r etc..etc ) skills in front-end development (you will implement what the clients will see!)<p>- Technical Lead&#x2F;Technical Manager: Responsible for leading a team of Software engineers. Requiring very strong technical background (like having High Availability software for lunch).<p>The full list of available positions is: <a href=\"http://www.ooyala.com/about/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;www.ooyala.com&#x2F;about&#x2F;careers</a><p>Para aplicar pueden enviar su CV a: careers-mx@ooyala.com\nY digan que vieron el anuncio en ycombinator :D\nOoyala ofrece un ambiente de trabajo muy padre, trabajo mano a mano con ingenieros y otros colegas de Mountain View (es bueno tener disponibilidad para viajar), seguro de gastos médicos mayores, performance-bonus, desayuno, comida y cena gratis. Cerveza gratis 24&#x2F;7 (no... no nos la pasamos borrachos todos los días... y hay de varias marcas :P). Y sobre todo, la oportunidad de trabajar en una tecnología de la cual es en el momento oportuno para crecer: video en línea.<p>Cualquier pregunta o comentario con respecto a alguna de estas vacantes o Ooyala en general no duden en contactarme!\np.s. Perdón por mi spanglish","time":1378051075,"type":"comment"}