{"by":"lightsidelabs","id":6310695,"parent":6310234,"text":"LightSide - Pittsburgh, PA<p>JOB TITLE: Software Developer – Educational Technology<p>LightSide is hiring an experienced Java developer for a full-time position working on our machine learning tools for educational technology that improves student writing. This position will be extending and improving an existing backend system, thinking critically about performance optimization, concurrency, and security issues, as well as adding new features and functionality on a regular basis.<p>This job will be highly collaborative, working with our team of machine learning researchers, frontend developers, and a user experience designer. Our web services are built in Python using the Django framework; while your primary responsibilities won’t focus on this code, you may find yourself on forays into it on occasion.<p>No experience with machine learning or natural language processing is necessary or expected, but you need to be eager and interested in finding out how those tools work under the guidance of experienced researchers from Carnegie Mellon’s Language Technologies Institute.<p>This employee will work out of our office in Pittsburgh, PA, and compensation will be competitive and based on experience.<p>Skills and Requirements<p>Ideal candidates will have an active interest in educational technology, are interested in using machine learning for real-world benefit, and have prior experience with:\n  * Java backend development in live, large-scale customer-facing web services\n  * Working with continuous integration on Amazon Web Services or another cloud host\n  * Dealing with databases and storage, in the context of large volumes of large files\n  * Concurrency wrangling, potentially with specialized JVM languages like Clojure\n  * Agile development on a small, dynamic team.<p>About Us<p>LightSide (www.lightsidelabs.com) is developing state-of-the-art technology to support writing and education – including automated assessment, formative feedback, and revision assistance for student writers.  We’re a spin-out from Carnegie Mellon University, and our founders have published more than 30 papers in the fields of natural language processing, machine learning, and computer-supported collaborative learning. Our office is located in the Shadyside neighborhood of Pittsburgh, Pennsylvania.","time":1378048871,"type":"comment"}