{"by":"TORIG-TG","id":6310657,"kids":[6311357],"parent":6310234,"text":"Lead Developer - AngularJS and Rails<p>Remote or Local - Ft. Lauderdale, FL<p>Torig is shaking up an old industry with a mobile-first scheduling and routing web app for a specific trade.<p>We are an early-stage company and working with us will be an opportunity for professional and personal growth. We have built a team, are financed, and are ready to hire an experienced technical lead.<p>Your expertise and great technical skills will turn specifications and ideas into action on Web and Mobile Platforms.  You will need to own and guide the development process to a successful launch. We keep tight feedback loops to ensure efficient development.<p>We are a results driven team using Agile&#x2F;SCRUM methodologies to build successful products. We offer the freedom to work remotely and make your own hours. If you are part time, you are welcome to have another job simultaneously, but you will end up leaving that job for us!<p>Your competitive salary will be augmented with available stock options.<p>We like people who really like:<p>• Ruby on Rails<p>• JavaScript, Angular.js or similar frameworks, and Node.js<p>• HTML 5 and CSS 3<p>• Writing and interfacing with APIs<p>• Clear and effective communication<p>• Working hard to build great things<p>If you are not a life long learner and do not like being creative, this is not the job for you! We value our company culture as much as your skills.<p>About Torig<p>Torig is highly experienced in its target market and its team has a proven track record of success.<p>Our product has been thoroughly researched and planned. We follow the Lean Startup methodology. We are a bit obsessed with user experience and want to build the best products possible. Our team is dedicated, accomplished, and fun.<p>Our product is currently in development with an excellent team and we are building a flourishing and lucrative business.<p>Please contact me at Info [at] Torig.com","time":1378048213,"type":"comment"}