{"by":"bijanv","id":6311135,"parent":6310234,"text":"EventMobi - Toronto, Canada - Full-Stack &#x2F; Infrastructure &amp; Operations Engineers - <a href=\"http://www.eventmobi.com/about/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.eventmobi.com&#x2F;about&#x2F;careers&#x2F;</a><p>--------------------------<p>EventMobi is an app building platform that allows event planners to create engaging apps for their event or conference in only a few minutes. We’re based in Toronto and are committed to using the mobile revolution to completely transform the events industry.<p>Our apps allow event planners to distribute content to their attendees, keep them engaged with the event, and help them learn and network with other attendees. EventMobi apps have been used at over 1500 events, 2 Million users, and are served for events in 15 languages across 5 continents.<p>We’re not your typical startup, we’re completely self-funded and yet with no outside capital we’re massively profitable and on an incredible growth path with companies like Intel, Disney and the Olympics IOC using us for their mobile event app needs.<p>We embraced HTML5, cloud architecture and cross-platform mobile web apps before any of them were fancy buzz words! Come and join Toronto’s fastest growing self-funded tech start-up and be part of something amazing.<p>--------------------------<p>We&#x27;re looking for a Full-Stack Software Engineer and an Operations (DevOps) Engineer to join our team and help build out the platform we need to innovate this space. This is a very fast-paced role, and we need energetic individuals that can build large-scale SaaS systems, be part of and lead the growth of engineering team. This is a great career opportunity to grow with a young startup, get your hands dirty in all aspect of cloud services, mobile and web development and help with every aspect of a startups technology infrastructure.\nOur stack looks like something like this:<p>- Heavy use of Javascript (we use Angular and Backbone)<p>- Python &#x2F; Flask<p>- MySQL &#x2F; Redis &#x2F; MongoDB<p>- Dozens of nodes on AWS automated by Chef<p>- Jenkins for CI, Cucumber&#x2F;RSpec&#x2F;Karma for test automation<p>If you would like to chat further about the details feel free to email me at bijan@eventmobi.com","time":1378055243,"type":"comment"}