{"by":"capkutay","id":6311109,"kids":[6311282],"parent":6310234,"text":"WebAction (www.webaction.com) in Downtown Palo Alto - Full Time- Hiring Front-End&#x2F;UI Developers and Platform Engineers<p>Jobs@WebAction.com<p>WebAction is an enterprise infrastructure software company based in the Palo Alto, providing a platform that will enable the next generation of real-time, data driven applications. We acquire and crunch all types of mission critical data found in enterprise companies and turn it in to alerts and beautiful dashboards. Our platform is real-time from end-to-end.<p>We offer a competitive salary, excellent benefits package, generous equity for the right candidates, beer fridays, and (of course) a kitchen stocked with snacks and drinks. If you want to join our cutting-edge team, grow as we do and share the excitement of an early start-up environment please apply today. We&#x27;re currently hiring Front-end and Platform Engineers<p>Desired Skills &amp; Experience for Front-end Position:<p>-JavaScript knowledge necessary<p>-Experience with HTML5&#x2F;CSS3<p>-Experience with JavaScript frameworks (jQuery, Backbone, etc.)<p>-Experience or interest in learning visualization frameworks (d3, processing.js)<p>-Excellent communication skills, both written and oral<p>-Must be able to function well in an early stage startup environment<p>-Must be able to multi-task<p>Pluses:<p>-Experience in user interaction design and user experience<p>-Knowledge of back-end web frameworks<p>-iOS or Android experience<p>-A passion for design<p>For the Platform Engineering position, we ask that you have experience writing clean code in Java and have a strong desire and skills to implement parts of a distributed, highly optimized data processing infrastructure.<p>Skills you should have or at least be interested in learning:<p>Large-scale distributed systems, Highly available, highly scalable architectures, Hadoop (MapReduce &#x2F; Pig &#x2F; Zookeeper), Data Serialization (Avro &#x2F; Thrift &#x2F; Protocol Buffers), Bytecode generation and injection, NoSQL &#x2F; BigData (MongoDB &#x2F; Cassandra &#x2F; HBase), Real-time messaging (0MQ &#x2F; Kestrel &#x2F; Kafka or similar), Real-time event processing, Continuous Queries<p>If this sounds like you, shoot us an e-mail at jobs@WebAction.com. If you&#x27;re not an exact match (according to this job post) but still feel like you could contribute...feel free to shoot us an e-mail regardless.","time":1378054927,"type":"comment"}