{"by":"mattiasgunneras","id":6311420,"parent":6310234,"text":"BREAKFAST - Brooklyn NY - Full Time Engineers<p>We&#x27;re an early stage startup looking to define the intersection of real-world signage and the digital world and we&#x27;re looking for a few experienced computer engineers to join our small team in Brooklyn.<p>Roles we&#x27;re hiring for:<p>- Software engineers with strong analytical and match skills. Machine learning, &quot;big data&quot; and complex algorithms such as search or online ad-platform experience is a bonus.<p>- Full stack developer and operations (dev-ops) engineer. Experience with large platform systems and geo is a bonus but not a requirement.<p>- Electrical Engineer, this is a senior and very varied role. We&#x27;re looking for someone with lots of experience with PCB schematics and layout, assembly and manufacturing. Experience with microcontroller circuits, serial and SPI interfaces, and everything up into system integration and firmware coding. Experience with FPGAs is a bonus.<p>We&#x27;re mainly looking for senior applicants however I don&#x27;t want to discourage younger engineers to apply.<p>About us<p>We&#x27;re a small company in Brooklyn, NY (Dumbo), our mission is to bring smart wayfinding to the masses. Our smart mechanical&#x2F;digital street sign, Points (<a href=\"http://breakfastny.com/points\" rel=\"nofollow\">http:&#x2F;&#x2F;breakfastny.com&#x2F;points</a>), is just the beginning of what is possible in this brand new market. Using all the power that comes with realtime data and online signals, in a real-world scenario opens up new doors to what physical spaces can offer.<p>We are big users of open source software. Our codebase is mainly python, c&#x2F;c++ and javascript (node.js). However we do not discriminate if your main focus has been some other language. Our software stacks usually include linux, nginx, postgres, redis and misc AWS services.<p>We do a lot of prototyping in-house. We believe that engineers should have access to the right tools to get their job done. We have 3D printers, a large scale CNC for cutting metal and a slowly growing prototyping shop for electronics work.<p>By looking at our previous work you can get a better sense of who we are and what we like to tinker with. <a href=\"http://breakfastny.com/projects/\" rel=\"nofollow\">http:&#x2F;&#x2F;breakfastny.com&#x2F;projects&#x2F;</a><p>We&#x27;ll offer salary based on your experience and the specific role that you fit in. We also offer health care, an unlimited vacation policy, weekly happy hour beers and a couple of office get-away days a year where we all go out and do something crazy to blow off some steam (zip-lining, go-carting and other juvenile-ish fun). We&#x27;ll let you pick the laptop of your choice as well.<p>If you&#x27;re interested in joining us in this very early and exciting time of our business, please talk to us so we can figure out how to get you on the team.<p>Get in touch with me on jobs+engineer@breakfastny.com","time":1378059489,"type":"comment"}