{"by":"stevederico","id":6311190,"parent":6310234,"text":"Lead Android Engineer, Bixby Apps - SF<p>Lead the Android Team at a Mobile Agency<p>Uncover the best work of your life and become the leader of the Android division at Bixby Apps. Bixby Apps is a mobile development agency focused only on Android, iOS, and Windows Phone. We build apps for big brands like BMW, Lenovo, and The Nielsen Company. Work on the new devices and operating systems, sometimes before they are released to the public.<p>Android Lovers Only<p>Do you love playing with the newest Android devices? Do you love pushing the limits of the newest NDK? Join Bixby Apps and lead the Android Team in their process and development.<p>Note: We are not currently looking for candidates outside the US.<p>Skills &amp; Requirements<p>At Bixby Apps, we understand the power of Android. Carry the newest devices and work with cutting-edge software. Fight the good fight against the iOS Team and show them who is boss.<p>Each applicant should have the following experience:<p>- 2+ Apps in Google Play Store\n- Database Frameworks\n- Drawing Custom Views\n- Custom Animations\n- Thread Management\n- GPS and Location\n- Understanding of Android Design Guidelines\n- Unit Testing\n- Get Shit Done<p>Join a team where making great apps and getting shit done is priority number 1. Bixby Apps was founded by developers and designed for developers. There are no development managers, meetings, or office politics. Bixby Apps is about letting the experts do what the experts do, code!<p>About Bixby Apps\nBixby Apps is a mobile development firm providing iOS, Android, and Windows Phone app development services to large brands, small businesses and agencies worldwide. Bixby Apps has built apps for major brands like BMW, Lenovo, &amp; The Nielsen Company. We pride ourselves on our quality-first approach to development and design. You can find our work at:  <a href=\"http://www.bixbyapps.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bixbyapps.com</a><p>Please submit resume to jobs@bixbyapps.com","time":1378056125,"type":"comment"}