{"by":"londont","id":6311476,"parent":6310234,"text":"ZenPayroll (YC W12) is hiring software engineers to help make delightful payroll<p>About us:<p>+ We&#x27;re building the future of payroll. If you love solving foundational problems that affect millions of people, we&#x27;d love to talk with you. Just imagine that you can help your favorite cafe or flower shop pay their employees.<p>+ Our founders are second time entrepreneurs from Stanford who have had two prior exits. We&#x27;re hungry to build something truly great and we&#x27;re in this for the long haul.<p>+ We&#x27;re funded by the CEOs of Yelp, Dropbox, Yammer, Box, Parse, and others, as well as Google Ventures, Salesforce and Y-Combinator. Full list at www.zenpayroll.com&#x2F;investors.<p>+ Most importantly, our company values are here: <a href=\"https://zenpayroll.com/about\" rel=\"nofollow\">https:&#x2F;&#x2F;zenpayroll.com&#x2F;about</a>.<p>--------------------------------------------------------------------------------<p>Things we&#x27;re looking for:<p>+ Experience with Rails | Backbone.js | CoffeeScript | MySQL is a plus but not a pre-requisite.<p>+ Interest in using a test driven development process. We also pair part of the time.<p>+ Interest in building user-facing and core-backend features, as well as being an active part of the design process.<p>+ Desire to understand the customer perspective. All members of our team are builders and it&#x27;s important everyone understands the pain point we&#x27;re solving.<p>--------------------------------------------------------------------------------<p>Perks:<p>+ You&#x27;ll be a core member of our team as we grow the company. As a result, you&#x27;ll receive a competitive salary + significant equity stake.<p>+ Housing stipend if you live near the office, three meals a day, company retreats, gym&#x2F;sports club stipend, dream work set-up, and more -- including copious espressos brewed by one of our co-founders. People are the foundation of our company and we make sure they know they&#x27;re valued.<p>--------------------------------------------------------------------------------<p>Above all, we&#x27;re looking for individuals who are yearning to do the best work of their lives. You&#x27;ll be amply rewarded for the work you do.<p>--------------------------------------------------------------------------------<p>To apply, send a note to jobs [at] zenpayroll [dot] com and include your LinkedIn, GitHub, and&#x2F;or any project pages.<p>This job is located in SoMa, San Francisco, CA. You must be local or willing to relocate (we&#x27;ll cover the cost).","time":1378060301,"type":"comment"}