{"by":"camara","id":6312520,"parent":6310234,"text":"CS Disco - Houston, Tex. - FT or INTERN<p>Disco is 10x faster, 10x cheaper ediscovery software that lawyers use to find evidence from millions or tens of millions of documents and emails collected in investigations or litigation. Search Enron&#x27;s emails: <a href=\"http://demo.csdisco.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;demo.csdisco.com&#x2F;</a><p>Our CEO is a litigation partner and the youngest graduate of Harvard Law School (at 19). Our COO is a cofounder of Trust Egg (YC W11). Our CTO is the former CIO of publicly traded Sonic Foundry. We have $400k in seed funding from Casi Labs, the technology division of a law firm, and are currently raising a VC round.<p>Customers include some of the largest law firms in the country (K&amp;L Gates, Morgan Lewis), midsize law firms and litigation boutiques (Susman Godfrey, Gibbs &amp; Bruns), and large corporate litigants (AIG, Cameron, Orix, Westlake Chemical). 60% month-over-month recurring revenue growth since January 2013 launch with 0 churn (no customer has yet left).<p>ENGINEERING - We are looking for 1 front-end engineer or designer with tech skills and 2-3 back-end engineers (C#,.NET, IIS, RavenDB, Lucene).<p>Problems include: (1) scaling highly performant (1&#x2F;3 second search, 1&#x2F;10 second document navigation) database and search to 10TB+ document sets (tens or hundreds of millions of documents); (2) automating document classification based on lawyer classifications of other documents within and across databases; and (3) real-time processing, analytics, and search of corporate email and documents in place, i.e., automating the internal audit and compliance function at large corporations.<p>Send a resume and code samples to Gabe Krambs at krambs@csdisco.com. Market salary.<p>SALES AND MARKETING - Sign and support channel partners (vendors who sell software and services to law firms and corporate litigants) and develop and present marketing material at trade shows and sales pitches. Graphic design, public relations, and proven sales skills strongly encouraged.<p>Send a resume to CeCe Cohen at cece@csdisco.com. Base plus commission.<p>If you want to work in law or legal technology, you should contact us even if this particular product doesn&#x27;t seem immediately interesting.","time":1378075864,"type":"comment"}