{"by":"wh-uws","id":6312120,"parent":6310234,"text":"Driveless (<a href=\"http://driveless.co/\" rel=\"nofollow\">http:&#x2F;&#x2F;driveless.co&#x2F;</a>) - REMOTE from: SF Bay Area, LA, Santa Monica, NYC, Austin, Houston or Atlanta<p>Hi, I&#x27;m starting a company called driveless and I&#x27;m looking to build a kick ass team<p>I&#x27;m technical, full stack, and love getting my hands dirty with all types of tech. I&#x27;ve been doing web development since shortly before firebug was created and most recently spent 2 years at Ruby&#x2F;Rails shop. Now I want to build with Scala and the Play Framework.<p><i>Here’s the pitch:</i><p>This is a startup building a service to help people find shared rides to and from nightlife (bars &#x2F; restaurants &#x2F; etc.) so they don&#x27;t have to drive home drunk.<p>Also have big ambitions of becoming a general purpose local transit alternative (think commuters) but want to start with the smaller market segment first.<p>I want the company to ultimately be completely distributed but I want people in LA (especially Santa Monica), NYC, Austin, Atlanta, Houston or the SF Bay Area to start for the first 3 to 6 months. These places have active nightlife scenes that I know and&#x2F;or quality technical talent around.<p>Right now the company is completely bootstrapped and I want to keep it that way for as long as possible so you’ll need to have a cash reserve. If we can get really good traction getting funding may be entertained but I’d rather raise money from customers, you should feel the same too.<p><i>Here’s where you come in:</i><p>Across the board people will need to be scrappy and not be afraid of wearing many hats.<p>Specific roles:<p>- - - -  - - - - - - - - - -  - - - - - - - - -<p>*  CTO &#x2F; Vp Engineering<p>Have you built cool stuff that lots of people use?<p>Do you want to run you own engineering organization of really smart people and have them at your disposal to help solve problems?<p>I want to build from the ground up with Scala on the backend. But if you can convince me Go or &lt;insert your favorite language&gt; is a better choice and is the new python re: <a href=\"http://www.paulgraham.com/pypar.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.paulgraham.com&#x2F;pypar.html</a> I&#x27;m all ears.<p>come join driveless!<p>* Developer<p>Have you built cool stuff that lots of people use?<p>Not quite ready to lead the team but still think the concept is cool and want to be a part.<p>You’ll be a part of decisions that have a direct impact on the direction of the company and a great deal of autonomy to figure out and then go build what users want or may not even know they want.<p>come join driveless!<p>* Lead Designer &#x2F; UX<p>Have you built beautiful usable products that lots of people love?<p>I need you help crafting great user experiences that will keep people engaged as they are introduced to and explore their ability to move around town without a car through shuttle and charter services.<p>Need them coming back for more.<p>come join driveless!<p>- - - -  - - - - - - - - - -  - - - - - - - - -<p><i>check it out</i><p>all there is right now is an interest form and ideas in trello boards.<p>you would be in from the ground up<p><a href=\"http://driveless.co/\" rel=\"nofollow\">http:&#x2F;&#x2F;driveless.co&#x2F;</a><p>if you&#x27;re interested in the roles or just think the concept is interesting and want to chat feel free to shoot me an email at<p>wharris [at] driveless.co","time":1378069022,"type":"comment"}