{"by":"RichardPrice","id":6313562,"parent":6310234,"text":"San Francisco, CA. Full time.<p>Academia.edu is a social platform for academics to share research papers. The company&#x27;s mission is to accelerate the world&#x27;s research. 4.1m academics have joined Academia.edu, and over 300k join each month.<p>Many people believe that science is too closed, and too slow. We are trying to make science faster and more open. There are 4 things we are trying to achieve with Academia.edu:<p>- Instant distribution. Right now there is a 12 month time-lag between submitting a paper to a journal, and the paper being published. We need to make publishing a button, and the distribution of scientific ideas instant.<p>- Better peer review. Currently two people peer review a paper, which is too small a sample size. With 50,000 people worldwide in a research community like Machine Learning, or breast cancer, what 2 people think is not statistically significant. We need a broader-based peer review process, one that surfaces the opinions from the entire scientific community.<p>- Data-sets. Scientists don&#x27;t share their data-sets right now. The data remains stuck on their hard-drives. The main reason for this is a lack of incentives for the scientists to share their data. We need to introduce the right reputation mechanisms in science to facilitate the sharing of data. -<p>- Open access. We need to bring about a world where a villager in India has the same access to the world’s scientific output as a professor in Harvard. When you open up access to the world’s scientific literature to the 2.5 billion people who are online right now, magical things can happen.<p>We&#x27;re a 12-person engineering-driven team based in downtown San Francisco. Technologies we use include Rails, PostgreSQL, Redis, Varnish, Solr, Memcached, and Mongodb.<p>We have raised $6.7 million from Spark Capital, True Ventures, Mark Shuttleworth (founder of Ubuntu), and others.\nWe are looking to hire software engineers to help build a faster and more open science.<p>There is more information about the company on our hiring page, at <a href=\"http://academia.edu/hiring\" rel=\"nofollow\">http:&#x2F;&#x2F;academia.edu&#x2F;hiring</a>. There is more on TechCrunch about our mission here <a href=\"http://techcrunch.com/2012/02/05/the-future-of-peer-review/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2012&#x2F;02&#x2F;05&#x2F;the-future-of-peer-review&#x2F;</a> (The Future of Peer Review) and here <a href=\"http://techcrunch.com/2013/02/03/the-future-of-the-scientifi..\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2013&#x2F;02&#x2F;03&#x2F;the-future-of-the-scientifi...</a>. (Reputation Metrics in Science)<p>We will handle re-location, including visas. We are not currently hiring remote employees.<p>If you are interested to learn more, please email Richard Price at richard [at] academia.edu.","time":1378099317,"type":"comment"}