{"by":"nickwisesatapps","id":6314182,"parent":6310234,"text":"Harwell Space Cluster, Oxfordshire, UK - Satellite Applications Catapult<p>3 roles open – Data Engineer&#x2F;Scientist, Web UI Developer, Visual&#x2F;Graphics Designer<p>The Satellite Applications Catapult is looking for enthusiastic and passionate software developers with an entrepreneurial spirit to help us push boundaries and find new ways to utilise and exploit satellite data.  Along with vast amounts of satellite data (&gt;7PB), we also have a 28 screen videowall to visualise the data, a 3D projection suite, an operations centre, high performance compute and cloud computing infrastructure, raspberry pi systems, arduino boards, 3D printer, oculus rift, Kinect and Leap Motion as tools to work with, and a culture of innovation where the traditional ways are challenged and new ideas and techniques are championed.<p>Launched in April 2013, the Catapult is a not-for-profit organisation. Our vision is to be a world leading technology and innovation centre helping businesses of all sizes to realise the potential of Space. We bring satellite service providers together with businesses to facilitate new opportunities and innovation.  As part of this we are creating a software platform that will lower the barrier to entry for using and exploiting satellite-derived data and services, and innovating with new techniques in data management and visualisation.<p>Our culture is exciting and innovative.  A great example of this is we offer employees the opportunity to spend 10% of their working time on ideas and projects. If their ideas develop into commercially viable projects, the Catapult will help find funding to spin the idea into a business venture.  Our benefit package includes; 28 days holiday, a generous pension scheme, life insurance, a cycle to work scheme and childcare vouchers.<p>Right now we’re building a core team of developers to pull together the base platform, with plans to expand as more projects develop.<p>If you are interested in joining us check out <a href=\"https://sa.catapult.org.uk/vacancies\" rel=\"nofollow\">https:&#x2F;&#x2F;sa.catapult.org.uk&#x2F;vacancies</a> or email career@sa.catapult.org.uk for details.","time":1378112453,"type":"comment"}