{"by":"jeffatclypd","id":6314902,"parent":6310234,"text":"Ruby&#x2F;Rails Engineer @ clypd - Boston, MA. USA<p>Who we are, what we do\nWe are bringing digital advertising to the TV experience. People are consuming TV in all sorts of cool new ways: Roku, TiVo, tablets, mobile. We are bringing digital advertising into this new world. Ads that people actually want to see. Ads that make a difference.<p>The Opportunity<p>We are looking for amazing engineers that want to make a profound difference at an early stage company. Engineers that want to learn the latest stuff and apply it to some really interesting problems. Ad Tech is as bleeding edge as it gets. You need to get a lot of processing done in a short period of time. The quicker and smarter your technology is, the more money you make. Systems need to be wicked scalable to handle billions of requests per month. These are really fun problems to solve.<p>What stuff we think you will do<p>You will be learning all aspects of the system and contributing to them. You will work with the rest of the engineering and product teams using Agile methodologies. You will use Continuous Integration and Test techniques to build rock solid code. You are going to love working here.<p>Stuff we hope that you have done\nAchieved at least a Bachelor in Computer Science &#x2F; EE &#x2F; Computer Engineering, developed scalable systems using Ruby&#x2F;Rails, Javascript and used NoSQL databases. We hope that you have worked at small companies or startups and are as passionate about making awesome products as we are.<p>No recruiters, please. Boston region applicants, please.<p>Give us a shout! We want to talk to you! Sorry, no recruiters please.\nPlease send resume to jobs [at] clypd.com<p>Clypd is an Equal Opportunity Employer (EOE). Qualified applicants are considered for employment without regard to age, race, color, religion, sex, national origin, sexual orientation, disability, or veteran status.<p>Listing here:<p><a href=\"http://www.linkedin.com/jobs2/view/6991558?trk=job_nov\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;jobs2&#x2F;view&#x2F;6991558?trk=job_nov</a>","time":1378126355,"type":"comment"}