{"by":"andreipop","id":6318347,"parent":6310234,"text":"HumanAPI (Funded startup) - Palo Alto, CA - <a href=\"http://humanapi.co/careers\" rel=\"nofollow\">http:&#x2F;&#x2F;humanapi.co&#x2F;careers</a><p>HumanAPI is building the unified API for all human health data, and we are hiring another experienced engineer to add to the core team.<p>We started this company in late March this year, and are currently hard at work building the infrastructure to pull in and analyze health data from a wide variety of sources. Some of these include: wearable sensors, consumer health devices, smartphones, and genetic testing services (like 23&amp;Me). We collect this data, normalize it, and have built an API to allow any application developer to easily and securely build applications with our service.<p>We are looking for a long term hire, and this position includes meaningful equity in an exciting, fast growing startup.<p>The person joining must be an opinionated, independent thinker and feel comfortable making big decisions. You have experience shipping real products to users. You are broadly curious, have probably had some side projects, and you have ideally hacked around with some hardware as well.<p>You are versatile across technologies and platforms, and can teach yourself what you don&#x27;t know quickly. You don&#x27;t identify with specific technologies as much as you identify with the problems that need to be solved.<p>Ideally, though not required, you have some experience with distributed database systems (cassandra, hadoop, hbase, etc.), security (HIPAA), and generally get excited about data, sensors, health, and how we can combine them to make people healthy at scale.<p>We are based in Palo Alto, California - the right candidate can work remotely for a time period, though we would like to get the whole team under the same roof soon.<p>Come help us build the human health data infrastructure layer.<p>To apply, send an email directly to andrei@humanapi.co with your background, some relevant links (github, linkedin, etc), and any questions you have :)","time":1378174651,"type":"comment"}