{"by":"bencpeters","id":6318418,"parent":6310234,"text":"AIQ Investments - Park City, UT<p>QA Engineer&#x2F;Sys Admin&#x2F;Jr. Developer<p>We are looking for a candidate with strong Linux system administration skills and some application development experience including automated testing and dynamic scripting languages to fill a Testing &amp; Systems Administration position at our financial start-up. The successful candidate would become an integral part of a small, fast-paced team and would be expected to wear multiple hats, including everything from working on hardware maintenance of our super computer to helping fill a QA vacancy on the primary development team. We want someone who enjoys working hard and learning new things, but also does well in an environment with a lot of freedom and self supervision. We currently have a small, tight-knit team but are poised to scale up quickly, so this position has a lot of potential for growth for the right candidate. We&#x27;ve got some pretty impressive hardware resources to play with, and we respect powder days.<p>Necessary Skills:<p>* Demonstrated experience working with and administering Linux installations (Fedora&#x2F;Red Hat preferred)<p>* Demonstrated experience developing software including automated testing<p>Nice to Have:<p>* Experience with Groovy, Bash, JavaScript, and Python scripting and development<p>* Web application development experience using a modern framework like Node.js, Rails, Django, or Grails<p>* Familiarity with Spock testing framework for Groovy<p>* Experience managing a grid compute environment (SunGrid)\nVPN administration experience<p>* Experience building computers and working with server hardware<p>About Us:<p>We are a financial start-up located in Park City, UT capitalizing on exponentially improving processing power and machine learning algorithms to disrupt the money management industry. We combine state-of-the-art hardware (we&#x27;ve got our own, in-house GPU super computer) with a variety of machine learning techniques to develop data-inspired investment strategies. We strive for a &quot;Work Hard, Play Hard&quot; mentality and live in Park City for a reason - some of the best skiing, mountain biking, and hiking in the country is located right outside of our office. If you&#x27;re looking for a relatively entry-level position with a lot of potential for advancement outside of the Bay Area bubble, we want to hear from you.<p>If this sounds interesting, submit your resume, cover letter, github profile (if applicable) and&#x2F;or code sample to jobs@aiqinvestments.com. We&#x27;d love to hear details of any projects (professional or academic) that you&#x27;re proud of and had an important&#x2F;lead role in bringing to fruition too.<p>If you have any other questions, feel free to contact me personally by email (see profile)","time":1378175950,"type":"comment"}