{"by":"sugnid","id":6321135,"parent":6310234,"text":"Rap Genius (YC S11) - Brooklyn, NY - <a href=\"http://rapgenius.com\" rel=\"nofollow\">http:&#x2F;&#x2F;rapgenius.com</a> - Help us build the Internet Talmud<p>jobs@rapgenius.com<p>Rap Genius is at an unusual point in our history: we&#x27;re one of the fastest-growing sites on the internet, we get 25MM unique visitors per month, we&#x27;ve raised $15m from Andreesen Horowitz, and yet our tech team is still only six people.<p>What this means is that for anyone who joins us now it&#x27;s a best-of-all-possible-worlds–type situation: you&#x27;ll get to work on something that a ton of people are obsessed with, you&#x27;ll eat a lot of sushi, and yet you&#x27;ll still have the chance to experience the small-team vibe and pick everyone else who works here &#x2F; &quot;define the culture.&quot;<p>WHO WE ARE<p>We&#x27;re a tiny, quick-shipping team. Each of us makes product decisions and owns whole features. We&#x27;re close and we all enjoy spending time together.<p>Our house library includes Metaprogramming in Ruby; Godel, Escher, Bach, an Eternal Golden Braid; The Rise and Fall of the Third Reich; POODR; and &quot;Is Justified True Belief Knowledge?&quot;.<p>Loving rap is not a prerequisite for working here, though an appreciation osmoses to everyone after a while.<p>WHAT WE&#x27;RE BUILDING<p>We started Rap Genius in 2009 to explain the meaning of rap lyrics, but the big vision goes beyond music and touches <i>all of text</i> – whether it&#x27;s the Bill of Rights (<a href=\"http://news.rapgenius.com/United-states-congress-the-us-constitution-bill-of-rights-lyrics\" rel=\"nofollow\">http:&#x2F;&#x2F;news.rapgenius.com&#x2F;United-states-congress-the-us-cons...</a>), the Bible (<a href=\"http://news.rapgenius.com/God-10-commandments-lyrics\" rel=\"nofollow\">http:&#x2F;&#x2F;news.rapgenius.com&#x2F;God-10-commandments-lyrics</a>), “The Waste Land” (<a href=\"http://poetry.rapgenius.com/Ts-eliot-the-waste-land-lyrics\" rel=\"nofollow\">http:&#x2F;&#x2F;poetry.rapgenius.com&#x2F;Ts-eliot-the-waste-land-lyrics</a>), or the Supreme Court’s DOMA ruling (<a href=\"http://news.rapgenius.com/The-supreme-court-of-the-united-states-ruling-united-states-v-windsor-lyrics\" rel=\"nofollow\">http:&#x2F;&#x2F;news.rapgenius.com&#x2F;The-supreme-court-of-the-united-st...</a>), it&#x27;s all on Rap Genius (or Poetry Genius, or News Genius, or... you get the idea). One of our favorite recent examples is Junot Diaz&#x27;s amazing annotations on an excerpt from his own The Brief Wondrous Life of Oscar Wao (<a href=\"http://poetry.rapgenius.com/Junot-diaz-the-brief-wondrous-life-of-oscar-wao-excerpt-lyrics\" rel=\"nofollow\">http:&#x2F;&#x2F;poetry.rapgenius.com&#x2F;Junot-diaz-the-brief-wondrous-li...</a>).<p>BENEFITS<p><pre><code>  * Bomb salary and equity—you won&#x27;t be taking a pay cut to work here\n  * We don&#x27;t count vacation days\n  * Free meals in the office, free unlimited Seamless, free unlimited Fresh Direct\n  * Free gym in the building\n  * We pay your phone bill and when you join we&#x27;ll upgrade you to the newest iPhone (or, if you insist, Droid (just kidding, you&#x27;re getting an iPhone))\n  * Laundry and shower in the office\n  * Free indoor bike parking\n  * Free health, dental, and vision benefits\n  * The deluxe computer setup of your choice\n</code></pre>\nWHAT WE&#x27;RE LOOKING FOR<p><pre><code>  * Experienced full-stack Rails engineers\n  * Front-end developers with an eye for design\n  * iOS devs to build our iPhone app from the ground up\n</code></pre>\nINTERESTED? Hit us up at jobs@rapgenius.com with:<p><pre><code>  * Your name and GitHub profile, your Twitter, blog, StackOverflow account, personal website, etc. The more, the better\n  * A cool side project you built, library you&#x27;ve released, or some code that&#x27;s impressive\n  * Something brief about what you like and dislike about the technologies you&#x27;ve used\n  * Your résumé\n  * Location—you can&#x27;t get the true RG cult effect working remotely, so only apply if you live in NYC or are willing to relocate. Our office is in Williamsburg.</code></pre>","time":1378218353,"type":"comment"}