{"by":"neomindcheryl","id":6323632,"parent":6310234,"text":"Neomind Labs, Ruby on Rails consultants - Philadelphia, PA\ncontact: cheryl@neomindlabs.com (administrator)<p>Senior Rails Developer,<p>We are a small Center City Philadelphia consulting company focused on creating quality software using sustainable development practices. Our clients are businesses, non-profits, and academic institutions.<p>Job Details &#x2F; Required Skills:<p>* Developing and maintaining Ruby on Rails applications for multiple clients\n* Test Driven Development\n* Refactor &#x2F; rebuild components of older Rails applications\n* Work directly with customers to understand requirements and deliver usable software\n* Collaborate via Git<p>Are you frustrated with developing software &quot;the wrong way&quot;? Are you tired of being a big fish in a little pond?<p>Software development practices have come a long way. Stakeholders who are afraid to let you continuously reinvent your job are wasting their time and yours.<p>We are looking for talented application developers with Rails experience for full-time employment.<p>The candidates&#x27; primary responsibilities will be to assist in new development, maintenance, and deployment of various Ruby on Rails applications.<p>We always try to use the right tool or library for the right job, and we do lots of experimenting with new things.<p>We develop under Linux and OS X, deploy to Linux and use Git for version control.<p>We use most or all of the major Rails testing tools (Factory Girl, Minitest, Rspec, Cucumber, etc.)<p>For deployment: Capistrano, Chef\nOn the front-end: JQuery, Haml, and Sass\nOther tools: Pivotal Tracker, GitHub, Semaphore, Code Climate, AirBrake, Pingdom<p>A desire to learn more about Ruby, Rails and good software development practices is mandatory.<p>Please do not respond to this if you are not in the Philadelphia area, or are otherwise unable to work with us in person at least some of the time.","time":1378241297,"type":"comment"}