{"by":"andrewmahon","id":6336700,"parent":6310234,"text":"Type&#x2F;Code - D.U.M.B.O., NYC, NY.   <a href=\"http://typecode.com\" rel=\"nofollow\">http:&#x2F;&#x2F;typecode.com</a><p>Type&#x2F;Code is a small but growing design&#x2F;development consultancy focused primarily on web and mobile. Clients range from local businesses (<a href=\"http://joenewyork.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;joenewyork.com&#x2F;</a>) to startups (<a href=\"http://www.slated.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.slated.com&#x2F;</a>) to large media properties (<a href=\"http://www.architizer.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.architizer.com</a>) all the way to Google (<a href=\"https://www.google.com/producer/currents\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;producer&#x2F;currents</a>). We&#x27;re tight knit, love the work we do, and enjoy a fantastic view of the Manhattan skyline. We believe that tight integration between the design and development processes leads to the best final product.<p>We&#x27;re seeking exceptional frontend and backend developers as well as UI and UX designers to join the team on a fulltime basis. Interns are cool too, and we pay! Some notes on the various roles and what we’re looking for:<p>Frontend Developer: A track record of creating pixel perfect, rich HTML&#x2F;CSS&#x2F;JS digital experiences.<p>Backend Developer: Django? We love it. Elasticsearch, AWS, Salt Stack, yeah we love those too.<p>Full Stack Developer: See above + kicking ass.<p>UI Designer: An uncanny aesthetic, and the ability to iterate on designs in the browser with HTML&#x2F;CSS.<p>UX Designer: The ability to anticipate every possible user flow, and communicate those completely and concisely.<p>All: The ability and desire to take on a variety of roles and responsibilities. As a small but growing team, we see new challenges every day and are seeking some truly awesome folks to join us in tackling them.<p>Interested? Hesitate no longer, show us what you got: jobs+hn@typecode.com","time":1378412796,"type":"comment"}