{"by":"PieterPaul","id":6339127,"kids":[6339246],"parent":6310234,"text":"Pie - SINGAPORE. FULL-TIME.<p>We&#x27;re hiring smart, senior and passionate full-stack software engineers to join our small and kick-ass team of 4 in sunny.... Singapore! We can&#x27;t sponsor relocation costs, but we offer highly competitive salaries including a generous equity stake.<p>Pie is a SaaS startup building a super fast, real-time, responsive and scalable platform with global reach. We are agile and use different technologies, among others Node, Javascript, Redis, and Rails. We don&#x27;t write code without testing it and we use continuous integration to do so.<p>As an early Pie team member you&#x27;ll be part of the core dev team and there will be lots of interesting strategic choices and challenges to deal with.<p>Still here? Drop us a note, we&#x27;d love to hear from you!\nteam@piethis.com<p>More About Pie<p>Pie is a knowledge management tool that people will actually use.<p>Our goal is to make Pie the best tool for professionals to securely share, collect and curate knowledge. We&#x27;re doing this by making Pie as visual and intuitive as possible. We&#x27;re data-driven and we believe a strong developer culture is vital for building the most valuable product for our users.<p>The founding team of Pie is not new to building, scaling and exiting startups. Thijs has previously built and sold a contextual search venture to Mozilla. Pieter has lead the product management department for Playfish in Beijing which was later sold to EA.<p>Pie has some incredibly smart investors and shareholders that believe in the team and share their vision. Among others we have the co-founder of Match.com, a boardmember of SingTel, a large U.S. based VC, and several other highly experienced investors backing us. We&#x27;ve also got NEO.com as one of our shareholders (which is highly unusual for them).<p>We&#x27;ve been overwhelmed with the positive feedback we got from the 350+ pilot companies that signed-up for our early Beta. We&#x27;re currently growing the team with senior software developers to further increase the value that our growing user base derives from Pie.<p>Drop us a note on team@piethis.com or see www.piethis.com for more information","time":1378452091,"type":"comment"}