{"by":"scattaneo","id":8120722,"parent":8120070,"text":"Aruba Networks (AirWave group) | Sunnyvale, CA<p>senior front end &#x2F; full stack engineer<p>You&#x27;ve worked with modern JS frameworks such as Backbone &#x2F; Angular &#x2F; Ember &#x2F; Closure.  You&#x27;ve worked on a team of at least 3 people.  You know JavaScript and one server side scripting language (Perl &#x2F; Python &#x2F; Ruby). If this fits you, we want you to help build the UI and APIs for AirWave. AirWave is Aruba&#x27;s software solution for managing and monitoring the health and usage of massive WiFi deployments.  That means building APIs that expose the data we collect about the network and then UI dashboards to present the health of the network in different ways. If this sounds interesting, but you don&#x27;t have a lot of JS experience we still want to talk to you.<p>Aruba Networks is a leader in providing enterprise-scale WLAN&#x2F;edge networking products. Our customers include major universities, giant tech companies, and international retail stores with deployments numbering thousands of access points and tens of thousands of wireless devices.<p>We practice Agile&#x2F;extreme programming with short release cycles in a fun, relaxed atmosphere that feels very much like working for a startup -- except without the long hours, and with all the benefits of being part of a larger company (401k, ESPP, open vacation, ability to visit apropos technical conferences, free pizza).<p>But enough about us, what about you?<p>You must have a solid grasp of computer science&#x2F;software engineering concepts, including common data structures and algorithms and object-oriented design. You must also be familiar with at least one flavor of Linux (preferably CentOS&#x2F;RHEL) and be completely at home on the UNIX command line.<p>Nice-to-haves: the more of these you can check off, the better:<p>- version control systems (preferably svn)\n- SQL databases (preferably Postgres)\n- web stack (HTML, CSS, JavaScript, Ajax, Apache)\n- web frameworks (especially ExpressJS)\n- desire for life long learning.\n- passion for craft beer\n- ability guide a nerf dart to its target<p>To apply, please send your resume in plain text or PDF format only to airwave-resumes (at) arubanetworks.com","time":1406908376,"type":"comment"}