{"by":"eluckyg","id":8120273,"parent":8120070,"text":"<a href=\"https://www.hireart.com/jobs/9b26ada4/apply\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hireart.com&#x2F;jobs&#x2F;9b26ada4&#x2F;apply</a>\nAs our Marketing Lead, you will devise marketing strategies to grow and shape our brand. You’ll drive our brand visibility and own our communications efforts. You’ll run everything from press releases to industry events, taking charge of our growing presence in the mobile advertising industry.<p>The Perfect Candidate:<p>A clear and concise communicator.\nOrganized and proactive -- a strong prioritizer with an attention to detail.\nTackles tough questions with creativity and enthusiasm.\nStrong writing skills and ability to create sparkling social media presence.\nCreates inbound magic with dynamic, engaging content.\nComfortable working with product, engineering, and business development teams.\nA bachelor’s degree, equivalent or upwards, is desired. Don’t let this hold you back if you have the skills&#x2F;experience.\nBonus Points<p>Portfolio of superb marketing campaigns you’ve run and&#x2F;or managed (developer marketing is a plus).\nExisting knowledge of the mobile advertising and&#x2F;or app ecosystem.\nRolodex of marketing tools to make your life efficient &amp; our processes streamlined.\nFigured out that Amazon’s 1-click patent could be circumvented if you do a “purchase on mouse hover”.\nRequirements\nBuilding relationships with the world’s largest app developers and advertisers\nWorking with the Business Development team to devise marketing best practices\nUnderstanding our product inside and out\nCreating and curating content for our communications channels\nGathering feedback about the product and how it can be improved\nBuilding &amp; managing our identity through press releases, blog posts, tweets and all relevant channels\nCreating&#x2F;practicing innovative and new marketing tactics\nThe Good Stuff<p>Intelligent, driven team members\nProduct-centric company\nLearning environment where we encourage people to think from first principles and take the widest responsibility they can handle\nLunch everyday, Friday dinners, plus an abundance of customizable snacks and drinks\nAwesome medical, dental, and vision benefits\n401(k) and meaningful equity\n24 Hour Fitness gym membership\nUse the best hardware\nBook&#x2F;game budget\nExciting field trips for team bonding\nImpromptu ping pong games\n3D printer &#x2F; maker culture\nHack days once a month\nSunny office in the Financial District of San Francisco\nCompany Description\nHeyzap is changing the way we discover games, enabling game developers to grow and monetize their titles with Heyzap Ads. We work with thousands of mobile game studios, including the largest and most innovative game developers like King, Kabam, PocketGems and TinyCo.<p>Our office, in San Francisco’s Financial District, is in the middle of a new mobile gaming epicenter. We are backed by Union Square Ventures, Chris Dixon, Naval Ravikant, Ashton Kutcher and Qualcomm Ventures.","time":1406905491,"type":"comment"}