{"by":"KarenS","id":8120188,"parent":8120070,"text":"SENIOR DEVOPS &#x2F; PRODUCT EVANGELIST (PRODUCT MARKETING) at Loggly (San Francisco, CA)<p>Hi! I wanted to personally recommend a sweet opening in my department at Loggly (a cloud-based log management provider - www.loggly.com) in San Francisco, CA. We’re looking to fill the missing piece of our marketing team: a Senior DevOps &#x2F; Product Evangelist.<p>Before I get any further, I want to quickly tell you about my own experience as an employee working at Loggly: it’s great! I am consistently challenged and am gaining new experience daily. I genuinely respect and like my coworkers. I feel like the work I do is valuable and recognized, and shared in a collaborative environment. I am well taken care of and provided all the tools I need for success. You wouldn’t be disappointed to join a team like this!<p>That said, this role currently open in marketing would be a dream job you if you have both a strong understanding of the logic of IT &#x2F; Ops as well as a desire to communicate and share that knowledge to contribute the developer community. Our audience is primarily devops, developers and engineers, and this role is chartered with making content (like web pages, videos, demos, blog posts, tweets, podcasts, white papers, webinars, etc.) that would interest and resonate with this audience in relation to application intelligence and monitoring.<p>You would have influence crafting our voice and our community - that is huge!<p>Main requirements for this position:<p>• Experience with IT operations software.<p>• SaaS experience preferred.<p>• Domain knowledge of application intelligence or application monitoring products like Splunk, New Relic, AppDynamics, Sumo Logic, Boundary, etc.<p>• 3+ years in a marketing, evangelism or business development role<p>• Very familiar with typical web&#x2F;Internet–facing technology stacks.<p>• Strongest affiliation with Linux<p>• Excellent written and verbal communication skills<p>The full listing can be found on our career page → <a href=\"http://bit.ly/LogglyJobs\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;LogglyJobs</a>\nInterested in applying? Questions about the role or Loggly? Great! Please email me at KAREN@LOGGLY.COM. Include a résumé, cover letter and link to your most relevant social channel. Be prepared to provide writing samples if requested.<p>Best,\nKaren Sowa<p>PS - we also have some engineering positions open - if you’re interested, email me and I can forward your request on to the right person.<p>Current Openings:<p>• Front End UI Engineer<p>• Front End Software Engineer<p>• Software Developer: Infrastructure Engineer<p>• Lead Developer Infrastructure Team<p>You can find all the details for these positions on our career page → <a href=\"http://bit.ly/LogglyJobs\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;LogglyJobs</a>","time":1406905080,"type":"comment"}