{"by":"skrebbel","id":8120479,"parent":8120070,"text":"Izooble - Eindhoven, the Netherlands - Lead Programmer<p>We&#x27;re a small Dutch startup looking for an experienced programmer to co-lead a small team of 3 programmers (frontend and backend) and an intern. Tasks involve making software design and architecture decisions together with the relevant team members, hacking on features alone or together, motivating the team, and keeping tabs on our (very light-weight) kanban-esque process.<p>Previous leadership experience is welcome, but experienced programmers who are looking to extend their leadership skills are most welcome as well. We&#x27;re not very hierarchically organized so typically you&#x27;ll &quot;lead by programming&quot; (and code-reviewing), not by Excel and sticky notes.<p>In case you care, our stack is React+TypeScript on the frontend, plus SASS&#x2F;Foundation for a nice responsive mobile web experience. We do cross-platform C#&#x2F;Mono on the backend (no Microsoft-lock-in here: current dev team consists of OSX, Linux <i>and</i> Windows users), all data in PostgreSQL, and Docker for deployment. When we grow, we&#x27;ll probably want to add fancy trendy data stores (like Neo4J or Redis) so you&#x27;ll have plenty nice new things to work out. We don&#x27;t really care whether you have particular experience with any of the aforementioned technologies, as long as you have decent full-stack web dev experience. So if you know Ruby, Python, OCaml, CoffeeScript and LESS, then hey, let&#x27;s talk :-)<p>Izooble (<a href=\"https://izooble.com\" rel=\"nofollow\">https:&#x2F;&#x2F;izooble.com</a>) is a Social Recommendation Platform for products in which people use their social networks to ﬁnd, share and buy products online. With Izooble, users get 100% personalized search results and 100% relevant content in their wall, without privacy issues and free of advertisements.<p>We&#x27;re organised as a distributed company, currently with people in the Netherlands, Spain and Poland. One of your responsibilities will be to make sure the remote team members don&#x27;t miss out on what happens in the office, so it would be good if you can be in the office quite frequently. But not necessarily daily, depending on how far away you live: We&#x27;ll happily hire a good candidate who lives 2 hours away without demanding relocation.<p>If you&#x27;re interested or have any questions, get in touch with me personally, via my HN profile. (please note, I&#x27;m currently on holiday so I might respond a bit slowly)","time":1406906734,"type":"comment"}