{"by":"jcsalterego","id":8120997,"parent":8120070,"text":"Union Metrics - <a href=\"http://unionmetrics.com\" rel=\"nofollow\">http:&#x2F;&#x2F;unionmetrics.com</a> - San Francisco, CA and Austin, TX<p>We are a fast-growing, profitable startup building powerful social media analytics software. Every day our systems process more than 130 million social events and deliver analytics for thousands of paying customers.<p>We have two open engineering positions:<p>=== Data Engineer (Austin, TX) ===<p>We need an engineer who wants nothing more than to wrangle massive amounts of data. Do you love to build on top of open source technologies like Hadoop and Cassandra using hundreds of servers? Do you enjoy working in a polyglot environment with plenty of variety? If you’re passionate about building the infrastructure to process, analyze, and store hundreds of millions of events every day, then we want to talk to you.<p>Responsibilities:<p><pre><code>    * Implement stream processing pipelines to handle hundreds millions of messages and events daily with Java and Ruby\n    * Use open source tools and data stores to analyze and store billions of data points\n    * Build workflows to make data accessible to end users\n</code></pre>\n=== Full Stack Ruby (&amp; Rails) Engineer (Austin, TX) ===<p>We’re looking for an experienced Ruby (and Rails) engineer who’s passionate about the craft of building software. If you’re interested in working with a small team of engineers to build software that not only scales but delivers an amazing user experience, then we’d love to talk to you.<p>Responsibilities:<p><pre><code>    * Implement core user-facing functionality in a Ruby on Rails application within a large service oriented architecture\n    * Design and build backend services and APIs\n    * Integrate with massive analytics systems and data stores\n</code></pre>\nYou can find more info about these positions at <a href=\"https://unionmetrics.com/company/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;unionmetrics.com&#x2F;company&#x2F;careers</a> and you can find out more about us at <a href=\"https://unionmetrics.com/company/about/\" rel=\"nofollow\">https:&#x2F;&#x2F;unionmetrics.com&#x2F;company&#x2F;about&#x2F;</a> or email us at jobs@unionmetrics.com.<p>I&#x27;m a member of the engineering team and I&#x27;d be happy to answer any questions about us or the positions: mando@unionmetrics.com","time":1406909701,"type":"comment"}