{"by":"ultrasaurus","id":8120607,"kids":[8120742],"parent":8120070,"text":"PagerDuty - San Francisco and Toronto, Full time<p>If you&#x27;re looking for a start up that&#x27;s growing quickly solving a real problem rather than selling ads, we&#x27;re making the process of fixing technology problems better.  We also just raised $27MM, to add quite a bit more brain power<p>* I have a soft spot for our Evangelist role: <a href=\"http://pduty.me/1oVNvmu\" rel=\"nofollow\">http:&#x2F;&#x2F;pduty.me&#x2F;1oVNvmu</a><p>* We&#x27;re hiring smart devs regardless of language in Tornto: <a href=\"http://pduty.me/1uP9D6r\" rel=\"nofollow\">http:&#x2F;&#x2F;pduty.me&#x2F;1uP9D6r</a> and San Francisco: <a href=\"http://pduty.me/1sbWjWf\" rel=\"nofollow\">http:&#x2F;&#x2F;pduty.me&#x2F;1sbWjWf</a><p>* We&#x27;re also hiring for our internal IT team: <a href=\"http://pduty.me/1m5D0bl\" rel=\"nofollow\">http:&#x2F;&#x2F;pduty.me&#x2F;1m5D0bl</a> if you&#x27;re looking to work on an IT team that&#x27;s loved and resepected<p>* And a dozen others on <a href=\"http://www.pagerduty.com/company/work-with-us/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pagerduty.com&#x2F;company&#x2F;work-with-us&#x2F;</a><p>Benefits<p>* Competitive salaries and company equity.<p>* Generous paid vacation (3 weeks your first year, 4 weeks afterwards), unlimited sick days, regular holidays.<p>* Comprehensive medical, dental, and vision plan options for you and your spouse&#x2F;family.<p>* Daily catered lunches and free snacks, drinks and beer.<p>* Weekly game nights, monthly hack days and impromptu ping-pong battles.<p>* Convenient office location, close to major public transit.<p>More about us:<p>PagerDuty is &quot;9-1-1 dispatch&quot; for IT, helping operations engineers and devops resolve problems with their IT systems as quickly as possible. We’re backed by some of the Valley’s best investors, including Y Combinator and Andreessen Horowitz. We&#x27;re based in San Francisco, California with a presence in Toronto, Canada. We&#x27;re obsessive about reliability and ensuring that when your systems are down, the right people get notified every time. PagerDuty is used by thousands of customers globally, from Fortune 500 companies to startups, including HP, Intel, Instagram, Airbnb, Box, Microsoft, Nike, Rackspace, and GitHub. We&#x27;ve got ambitious plans to grow and are seeking passionate people to join our crusade against downtime. We provide a competitive salary, comprehensive benefits and opportunities for career growth","time":1406907633,"type":"comment"}