{"by":"aj_icracked","id":8120592,"parent":8120070,"text":"iCracked is looking for a lead iOS developer to join our team in creating the ultimate on-demand repair, buyback, and insurance service. We are helping tens of thousands of customers a month with our platform and we&#x27;re growing like crazy. We want someone to join our team and take ownership of projects and scale with us to 100X the size we are now.\nYou would be joining us as our second iOS developer on the team and we have 3 iOS apps that are currently deployed. (2 Enterprise, 1 consumer facing @ <a href=\"http://bit.ly/1jJRLBJ\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1jJRLBJ</a> )<p>We are Y Combinator (W12) and very well funded. We have an incredible, core team of 70 with beautiful office spaces on the water in Redwood City. Think of us as the Uber meets AAA of iOS devices. iCracked started on a college campus repairing iPhones 3 years ago. Now, we have a 24&#x2F;7 on-demand dispatch service going out to over 600 iTechs in 11 countries around the world.<p>We&#x27;re a lean development team that moves fast. We push to production multiple times a day and continuously iterate on the core service. This is a exciting time to join if you truly want to be involved in developing the core product at a tech driven company.<p>To really set yourself apart, we&#x27;d love to see projects, apps (maybe even your own startup) you&#x27;ve created from scratch in your free time. Send us a link with a short description.<p>What we’re looking for in you:<p>- Demonstrated ability in developing and deploying apps<p>- Fluent in Objective-C<p>- Strong knowledge of CocoaTouch, iOS SDK’s<p>- Demonstrated passion for developing your own projects<p>- Comfortable coding views by hand (We rarely use IB)<p>- Familiarity with: Rest API&#x27;s, Git, MVC<p>Bonus Points (but not required):<p>- Background of C&#x2F;C++<p>- Good design sense<p>- Experience building web applications<p>We love founders and the founder mentality.<p>With iCracked, you wouldn’t be starting a new job; you would be joining a family. We take care of all team members and provide almost all amenities to make everybody’s lives better. Salary is excellent and we have set aside great equity packages and benefits for you.<p>If you’re interested reach out to AJ Forsythe at AJ[at]iCracked.com","time":1406907537,"type":"comment"}