{"by":"thistleco","id":8120481,"parent":8120070,"text":"Thistle - SF or remote - Full Time or intern - <a href=\"http://www.thistlechangeyou.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thistlechangeyou.com</a>\nNumerous needs, including Software engineer, Product Manager, brand ambassador, operations lead<p>Thistle is a healthy food and juice company based in San Francisco, California. We do on-demand deliveries of healthy food and juice. We started in 2013 with a small juice stand and have grown quickly to now serve fresh juice and food to over a thousand customers daily. Our mission is to deliver nutrition that is both fast and healthy and we are committed to being organic, local, and sustainable.<p>SOFTWARE ENGINEER - FULL TIME - SF OR REMOTE\nWe’re looking for a full stack engineer to lead the development of our web and mobile apps responsible for delivering food and juice products to customers. As our first technical hire, you’ll be creating the foundation on which we develop future products, from driver delivery logistics to inventory management systems etc. There are lots of fun challenges to be solved, come help us engineer the future of fast healthy food!<p>Duties and responsibilities will include:\nArchitecting the technology we’ll need to delight customers during the ordering experience, manage inventory, and optimize driver delivery logistics \nManaging a team (as needed) to execute on the design and development of our mobile and web apps\nCreating product roadmaps and prioritizing features \nDeveloping and implementing split testing systems \nHiring and managing the tech team\nKey things we&#x27;ll be looking for:<p>Full stack engineer (comfortable with Ruby, JS, iOS &#x2F; Android) \nInterested in picking up new languages (e.g. native iOS &#x2F; Android) \nExcited about our juice and food and willing to learn about our product\nSalary will be competitive and equity &#x2F; stock options will also be available<p>PRODUCT MANAGER - FULL TIME - SF\nDuties and responsibilities include:\nDriving the definition and execution of product go-to-market plans\nCreating product roadmaps and prioritizing features \nHelping translate business needs to tech requirements\nCollecting and analyzing data to inform product direction \nDeveloping and implementing split testing systems\nHiring and managing the tech team<p>Key things we are looking for:\nExperience in consumer web and mobile product development\nUser experience savvy\nDeep understanding of new web and mobile technologies \nExcited about our juice and food and willing to learn our details about our product<p>Other positions we&#x27;d like to fill:\nDesign intern - introduce yourself and email your portfolio to talent@drinkthistle.com\nOperations person - someone telling our drivers where to go and what to do - huge need and a good opening for a smart person who likes to roll up their sleeves.<p>Help us create great products that make healthy living accessible and appealing!","time":1406906737,"type":"comment"}