{"by":"gjmulhol","id":8120234,"kids":[8124001],"parent":8120070,"text":"Citrine Informatics (Palo Alto, CA) -- <a href=\"http://www.citrine.io\" rel=\"nofollow\">http:&#x2F;&#x2F;www.citrine.io</a><p>Computational Scientist (Employee #1)<p>Use data to master the periodic table<p>==========<p>The founders of Citrine are materials scientists who believe that data, at unprecedented scale, can completely transform our field. We’re looking for a computational scientist to join our team as employee #1 and help define the future of Citrine and materials R&amp;D at large. The successful candidate will demonstrate uncommon passion for and excellence in the three pillars of Citrine’s mission: (1) physical sciences, (2) scientific computing, and (3) large-scale data analysis.<p>## About Us ##<p>Citrine Informatics is dedicated to solving one of the greatest scientific &amp; economic challenges facing society today: How to rapidly invent and manufacture novel materials with desired properties. Our approach is unique in the materials industry: Instead of building traditional research labs and factories, we are an all-software company that aggregates huge quantities of materials data and uses these data to develop machine learning models of materials behavior. These models then guide our partners in academia and industry toward blockbuster materials. We aim to make breakthrough discoveries in areas ranging from energy (batteries, photovoltaics) to aerospace (superalloys, heat shields) to electronics (screen coatings, transparent conductors).<p>## Key Skills ##<p>You are someone who loves science, remembers more than a little bit of high school chemistry and beyond, is hungry to solve really hard problems across data mining, scientific computing, and understanding experimental scientific information. We use C++, Java, Python, Ruby, and any other tools we can get our hands on to solve the problems we encounter, so we want you to be hungry and flexible.<p>## Why Citrine ##<p>- Change the world through materials that enable amazing products people use every day<p>- Be inspired by working with brilliant people on a hard, important problem<p>- Experience life at a fast-moving, venture-backed Silicon Valley startup<p>- Enjoy our work-hard, play-hard culture—meet us and you&#x27;ll understand<p>- Continue to publish—we expect that many Citrine alumni will go on to illustrious careers in academia<p>## I&#x27;m Sold--What&#x27;s Next? ##<p>Visit <a href=\"http://www.citrine.io/#join\" rel=\"nofollow\">http:&#x2F;&#x2F;www.citrine.io&#x2F;#join</a> to see our process, and get contact information for our team.","time":1406905286,"type":"comment"}