{"by":"dogles","id":8120966,"parent":8120070,"text":"BOSTON - SENIOR ENGINEER - PROLETARIAT, INC.<p>Proletariat is a Boston-based startup built by game-industry veterans from Harmonix, Turbine, Media Molecule, and Insomniac. We lovingly handcraft engaging tablet-first experiences, focusing on creating great team multiplayer games. Like the original revolution, Proletariat rises up to wrest game development from big industry and return it to the people.<p>We&#x27;re currently looking for Senior Engineers who want to build great games for tablet and mobile devices. We are a small team, so you will have the opportunity to work in many different areas: gameplay, user interface, server systems, and internal tools. You will work with our artists, designers, and product managers to create new features that are launched regularly to our playerbase.<p>You can find more information about our team at <a href=\"http://proletariat.com/team\" rel=\"nofollow\">http:&#x2F;&#x2F;proletariat.com&#x2F;team</a> and our current game in development at <a href=\"http://worldzombination.com\" rel=\"nofollow\">http:&#x2F;&#x2F;worldzombination.com</a>.<p>Qualifications:<p>- 3+ years engineering experience.<p>- Some game development experience.<p>- Demonstrable ability to learn and work in multiple programming languages.<p>- Continues to improve development skills and learn new technologies.<p>- Self-directed and can work autonomously, but can also ask for help when needed.<p>- Able to communicate well with other disciplines, including artists, designers, and product management.<p>- Enjoy playing a wide variety of games.<p>Bonus:<p>- Experience with Unity engine.<p>- Experience with Haxe programming language.<p>- Mobile development experience.<p>- Node.js experience.<p>Proletariat is a well-funded, venture-backed startup that offers attractive salary, benefits, and equity for qualified candidates. Contact careers@proletariat.com if you are interested in joining the revolution!","time":1406909580,"type":"comment"}