{"by":"mikebabineau","id":8120145,"parent":8120070,"text":"The Factory - San Francisco, CA -- <a href=\"http://www.thefactory.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thefactory.com&#x2F;</a><p>The Factory is changing the way companies are built. Backed by the founder of Skype and Rdio and led by Rdio&#x27;s founding team, we&#x27;re a product incubator without the burdens of outside influence, funding, or time constraints.<p>We are well-funded and have a small and exceptional team of twelve. We have a gorgeous office in SOMA. Salary is top-notch, as are the equity and benefits as an early member.<p>We&#x27;re looking for highly experienced, entrepreneurially-minded builders to help:<p>* Dream up and build products<p>* Develop and perfect a common platform and pipeline<p>* Create open-source tools to help others launch products<p>Current positions:<p>* Senior Front End Engineer (<a href=\"http://www.thefactory.com/pdfs/sr_frontend.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thefactory.com&#x2F;pdfs&#x2F;sr_frontend.pdf</a>)<p>* Senior Back End Engineer (opportunistic)<p>* Other roles (opportunistic)<p>You can read more about us here: <a href=\"http://gigaom.com/2013/06/21/the-factory-janus-friis-todd-berman/\" rel=\"nofollow\">http:&#x2F;&#x2F;gigaom.com&#x2F;2013&#x2F;06&#x2F;21&#x2F;the-factory-janus-friis-todd-be...</a><p>On the front end, we use reactive patterns for both web (ClojureScript) and mobile (Objective C).<p>On the back end, we have a message bus-oriented microservice architecture built in Scala (with Finagle) and Go. Services are packaged as Docker containers and continuously deployed to a Mesos+Marathon cluster on AWS.<p>Other key tech includes ZooKeeper, Exhibitor, Zipkin, Kestrel, Packer, CloudFormation, and Python. And our small team has already open sourced a few dozen projects: <a href=\"https://github.com/thefactory/\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;thefactory&#x2F;</a><p>If you think this sounds like a fit, drop me a line: mike@thefactory.com","time":1406904766,"type":"comment"}