{"by":"shs","id":8120154,"kids":[8137462,8137450],"parent":8120070,"text":"HubSpot - Cambridge&#x2F;Boston, MA - <a href=\"http://www.hubspot.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.hubspot.com</a><p>HubSpot is a great place to work.  In fact, it was ranked the #2  place to work in Massachusetts and we&#x27;re the fastest growing non-public software company in the US (and 33rd fastest growing non-public company).  We focus on helping businesses with their online marketing - specifically helping them to avoid interrupting and annoying their customers with bad marketing.<p>In Engineering, we&#x27;re organized into small teams where you get to have a big impact on the product.  We have a great environment to move quickly in and deploy hundreds of times a day.  We use GitHub Enterprise for SCM, Jenkins to build, an internal deployer system for zero-downtime deploys, and we even have a Heroku-style system coming (for those that would ask &quot;why not just use Docker?&quot;, there&#x27;s still the provisioning and routing issue).<p>On the backend, we use Java and Python (though more Java these days).  It&#x27;s really modern Java.  We use Dropwizard which is really wonderful if you haven&#x27;t checked it out (annotate paths similarly to how you&#x27;d use Flash in Python and just have the method return an object and Jackson will serialize it into JSON and return it - Java can be really nice).  For data, HBase, Hadoop, MySQL, ZoopKeeper, Redis, and Memcached all have their place.  Again, we deploy hundreds of times a day so don&#x27;t expect your code to languish in the repository.  We like pushing small changes fast.<p>On the front end, we use Backbone.js, CoffeeScript, and jQuery.  We also have our iPhone and Android applications.<p>Engineers get a lot of responsibility from the start and you&#x27;ll usually push changes your first day.  You&#x27;ll also get a Retina MacBook Pro and Thunderbolt display.<p>Work schedules are flexible.  Most engineers keep a 10-6 schedule.  You get to make a meaningful difference in a product with loads of paying customers and a ton of traffic.  Best of all, you get to work with loads of smart and fun people.  That&#x27;s the best thing about HubSpot: the people are great people that you can rely on, learn from, and have a great time getting things done with.<p>Software Engineering: <a href=\"http://jobvite.com/m?3N1tAgwC\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3N1tAgwC</a><p>All Jobs: <a href=\"http://jobvite.com/m?3S1tAgwH\" rel=\"nofollow\">http:&#x2F;&#x2F;jobvite.com&#x2F;m?3S1tAgwH</a>","time":1406904851,"type":"comment"}