{"by":"msisk6","id":8120913,"parent":8120070,"text":"Rackspace - Operations Engineer - Austin, TX<p>Want to work with me building new products and services on OpenStack?<p>Overview &amp; Responsibilities<p>Behind the scenes of every Fanatical customer experience is YOU, the Rackspace Operations Engineer. You embed with product teams, influence product direction, architect, build, and deploy Openstack products. Keeping these products seamless through expertise in configuration management and continuous deployments which results in providing Fanatical service for our customers.<p>You:   \n* Linux Wizardry   \n* Believe servers are cattle not pets   \n* Have experience building and operating complex systems at scale   \n* You live to automate all the things with Chef&#x2F;Puppet&#x2F;Ansible&#x2F;Salt   \n* Measure and monitor <i>everything</i>   \n* Excited by containers, especially Docker   \n* Grok APIs   \n* OpenStack all the way   \n* Open-Source is <i>the</i> way   \n* Github, of course   \n* Uptime rules!<p>In this roll you will:   \n* Work at a scale beyond your imagination. And love it.   \n* Build agile systems on our public cloud infrastructure.   \n* Make architectural design decisions and solve technical problems.   \n* Collaborate in a cross-function team with developers, QA and product management (no silos allowed).   \n* Perform periodic on-call duties as part of a global team to provide Fanatical support to our customers.<p>Qualifications<p>Must Have&#x27;s:  \n* Fundamental knowledge of servers&#x2F;computers hardware and software \n* Excellent problem solving skills with a desire to take on responsibility\n* Excellent written and verbal communication skills with ability to communicate technical issues to nontechnical and technical * audiences\n* 3-5 years of relevant work experience, including with Linux systems requiring the use of languages like Python, C, C++, Java, Perl, Shell or PHP<p>Nice to Have&#x27;s:  \n* Technical certifications (i.e., Red Hat, UCP, CompTIA, MySQL) \n* Virtualization and strong networking knowledge \n* Experience working in the cloud computing industry \n* Bachelors degree in computer science, engineering, or equivalent work experience<p>[Apply](<a href=\"https://social.icims.com/job/Linux-System-Engineer-Job-US-TX-Austin-10892820.html?isd_source=email&amp;isd_pub=252467\" rel=\"nofollow\">https:&#x2F;&#x2F;social.icims.com&#x2F;job&#x2F;Linux-System-Engineer-Job-US-TX...</a>)<p>Or email me directly if you have questions: &lt;mike.sisk@rackspace.com&gt;","time":1406909304,"type":"comment"}