{"by":"sokratisp","id":8120300,"parent":8120070,"text":"Togethera (<a href=\"http://togethera.com\" rel=\"nofollow\">http:&#x2F;&#x2F;togethera.com</a>) - Back-end developer, London (Remote OK), Full-time<p>We’re building the easiest way for families and small groups to stay connected through private sharing of thoughts, photos and videos - on their smartphone, tablet or computer. We&#x27;re a small team (<a href=\"http://togethera.com/about\" rel=\"nofollow\">http:&#x2F;&#x2F;togethera.com&#x2F;about</a>) and we&#x27;re funded by a group of international investors, most of them entrepreneurs themselves.<p>Our product is driven by a RESTful API built in Python and Django, that serves our web (AngularJS) and mobile clients (iOS and Android). We launched our native iOS app two weeks ago and were featured by Apple on day one. We&#x27;re hoping to achieve the same with our Android app very soon and replicate the increase in traction we saw for iOS.<p>The existing architecture has served us very well and will continue to do so for the next few months. However, we feel that now is the time to build a new system that will:<p>- make the most of the lessons from the last 12 months and optimise performance of existing clients<p>- help us deliver our roadmap<p>- handle scaling as we&#x27;re starting to grow fast<p>To do this we&#x27;re looking for an experienced software engineer that understands databases, has worked with systems that had to scale fast and is comfortable with our stack and managing servers (we use Ansible). The ideal person has worked as a back-end&#x2F;full-stack developer for a fast growing mobile startup.<p>----------------------------------------------------------<p>What we offer:<p>Apart from the standard salary and options, we provide an environment where you will:<p>- have real impact on everything the company does<p>- produce your best work on something that you can use every day, which has the potential to reach millions of users across the world<p>- work on something that truly makes people happier (our users say that with their reviews - not us)<p>- work with <a href=\"https://twitter.com/mitsuhiko\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;mitsuhiko</a> (author of Flask) and <a href=\"https://twitter.com/stavros\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;stavros</a> who are advising and have helped us get to this stage<p>If you’d like to move to London, we’ll help you relocate here, but we’re also happy to work remotely.<p>To apply please email me at sokratis@togethera.com with a bit about yourself and products you’ve built.","time":1406905606,"type":"comment"}