{"by":"Xorlev","id":8120474,"parent":8120070,"text":"FullContact - Denver, CO or Riga, Latvia<p>We&#x27;re a TechStars Boulder 2011 company focused on fixing the contact information problem. Our mission is to make contact management a thing of the past. We&#x27;re still a small company (&lt;35), but looking to make key additions of important team members.<p>We clean, deduplicate, and search for contact information millions of times daily and maintain billions of records.<p>We&#x27;ve been on HN for our Person API which turns an email address or social handle into a full profile about a person (minus private contact info, e.g. phone&#x2F;email&#x2F;things we haven&#x27;t seen publicly). This API has billions of indexed profiles and crawls public sources 24&#x2F;7&#x2F;365.<p>We have massive challenges to solve, in usability, simplicity, scale, and raw smarts. It&#x27;s not easy to maintain billions of records, link them, and dedupe others automatically. But we want it to be stupid easy for our users.<p>=&gt; I want:<p>* Smart new team members I can learn from and teach. Our company is all about learning, and every person has something to offer. You don&#x27;t need to know our stack.<p>=&gt; If you:<p>* Like to keep shipping, but work sustainably<p>* Be respected and respect others<p>* Simplify<p>* Be candid<p>* Trust each other<p>* Keep the BS to a minimum<p>* Build open-source software<p>* Work on a world-class JVM stack that doesn&#x27;t have too many skeletons<p>* Java&#x2F;Scala&#x2F;Clojure<p>* A little Go too, but sssh. ;)<p>* And perhaps a smattering of Python<p>* We do like our tech, but only in the pursuit of &quot;getting shit done.&quot;<p>* Like to work with some of the most interesting (and dangerous) data in the world, and lots of it. We take privacy super seriously, and you should too.<p>* Are creative. All of our positions require excessive creativity and out of the box thinking.<p>* Have experience with programming. We don&#x27;t require you to know Java or Scala or Clojure, but that&#x27;s a plus. Smart people can learn quickly.<p>=&gt; And would like benefits such as:<p>* Unlimited vacation. As long as you aren&#x27;t screwing your team (or vice versa, we all need a break)<p>* World-class healthcare. Seriously, I haven&#x27;t seen coverage like this anywhere else. It&#x27;s insane.<p>* Power-day policy. Take a day off, make it up elsewhere. Somewhat vestigial with our unlimited vacation, but it&#x27;s a good way to take a day off with almost-zero-notice for days when the slopes are killer.<p>* A healthy work-life balance.<p>* Going to industry events. If you want to talk to me, I&#x27;ll be at Cassandra Summit with my team members, one of whom is presenting his work on a Cassandra SSTable reader for Hadoop.<p>=&gt; Then we have a few positions that may be of interest:<p>Engineers:<p>☆ Android Developer<p>☆ Data Engineer<p>☆ Senior Software Engineer (come work with us!)<p>Crucial product&#x2F;sales&#x2F;design:<p>☆ API Account Executive<p>☆ Applications Product Manager<p>☆ Product Analyst<p>☆ Director of UX<p>If you&#x27;d like to consider joining us, find us at <a href=\"http://www.fullcontact.com/about/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.fullcontact.com&#x2F;about&#x2F;careers&#x2F;</a>","time":1406906722,"type":"comment"}