{"by":"yale","id":8120964,"parent":8120070,"text":"WeWork - New York City<p>Full-Stack Software Engineer\nType: Full Time<p>We are looking for experienced and passionate software engineers that thrive in small, focused and highly collaborative teams. You will be working closely with the Product, Design and engineering teams to not only develop, but also help define and execute on projects. Strong communication skills and a desire to be involved in all aspects of the project life-cycle are a must. Strong problem solving skills, thinking outside the box and dealing with ambiguity are skills that we value. Our technology stack is primarily Ruby&#x2F;Rail, Angular, iOS, and Android, but we are not dogmatic about it.<p>A bit about us<p>WeWork transforms buildings into beautiful, collaborative workspaces that provide infrastructure, services, networking events and technology. We are expanding our locations and markets, both domestically and internationally. One of our goals is provide the digital and virtual offerings to enhance our members’ success.<p>The digital team is responsible both for the experience that connects our members and the systems that drive our business. We build everything from mobile applications to robust API services.<p>We’re a fast-moving team that operates like a startup within WeWork. We push frequently, continually gather feedback from members, and only build what’s necessary.<p>Requirements<p>You are fluent in one or more backend languages (Python, Perl, PHP, etc), with experience in Ruby a plus, and stay up-to-date on best practices.\nYou try to future-proof everything you create by minimizing built-in assumptions, and writing tests where appropriate\nYou write DRY code\nYou advocate the use of MVC, templating, ORMs, and other techniques to save time and headaches\nYou know when to apply duct tape and when to rebuild<p>Personality<p>You want to work in a small, agile team\nYou mentor other developers when needed\nYou work hard and don’t need much oversight\nYou like variety in your projects\nYou want to be proud of what you do at your job<p>To apply please email us at digital-hiring+hn@wework.com","time":1406909579,"type":"comment"}