{"by":"spicyj","id":8121041,"parent":8120070,"text":"Khan Academy — Mountain View, CA (we also love interns, and remote is a possibility)<p>We&#x27;re a small, non-profit tech startup bringing a free, world-class education to anyone, anywhere.<p>Here&#x27;s a testimonial we received last week:<p>==================================<p>Thank you Khan Academy for igniting the passion to learn everything which I usually neglected and missed during my academic carrier. Though myself should be blamed for that, the conventional classroom teaching and limited access of study material is also important factors. Now while teaching my students I am equally enjoying the materials. I sincerely hope Khan Academy should reach to every single child in the world. Thank you again for the magnificent en-devour.<p>==================================<p>Every month we get hundreds of letters like this from people in all walks of life who are thankful for our free, high-quality educational content. Most of you reading this are familiar with Sal&#x27;s videos, but we also have hundreds of videos by other teachers, partnerships with organizations like MoMA and the California Academy of Sciences, and a huge library of interactive exercises. Over 20 million math problems are done every week on our site.<p>A few things we&#x27;re currently working on building right now:<p>– The next version of our personalized learning dashboard [1] to make the UI more consistent across subjects and to help people learn better<p>– Improved knowledge models so we can better know what you know and don&#x27;t know [2]<p>– Infrastructure improvements to make the site more reliable and faster for our millions of visitors every month [3]<p>– Better tools for our content creators to allow them to make thousands of engaging, interactive exercise problems without knowing how to code [4]<p>– A major revision to our iOS app to let students practice skills on the go (or in a classroom with iPads!)<p>You&#x27;ll be part of a small team working alongside both &quot;celebrity&quot; devs (like jQuery creator John Resig and Google&#x27;s first employee Craig Silverstein) and many more who you haven&#x27;t heard of but who are also really awesome.<p>We&#x27;re especially looking for new product designers (of all types) but we also have many engineering positions open as well as some positions for a teacher and contract question writers.<p>Apply at <a href=\"https://www.khanacademy.org/careers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;careers</a> and mention that you&#x27;re coming from HN. Feel free to reply here if you have questions about applying or about KA in general. Unfortunately we can&#x27;t sponsor visas right now unless you&#x27;re from Canada, Australia, or Mexico.<p>[1]: <a href=\"https://www.khanacademy.org/about/blog/post/58354379257/introducing-the-learning-dashboard\" rel=\"nofollow\">https:&#x2F;&#x2F;www.khanacademy.org&#x2F;about&#x2F;blog&#x2F;post&#x2F;58354379257&#x2F;intr...</a><p>[2]: <a href=\"http://mattfaus.com/2014/05/improving-khan-academys-student-knowledge-model-for-better-predictions/\" rel=\"nofollow\">http:&#x2F;&#x2F;mattfaus.com&#x2F;2014&#x2F;05&#x2F;improving-khan-academys-student-...</a><p>[3]: <a href=\"http://www.alangpierce.com/blog/2014/07/07/bigbingo-khan-academys-new-bigquery-backed-a-b-testing-framework/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.alangpierce.com&#x2F;blog&#x2F;2014&#x2F;07&#x2F;07&#x2F;bigbingo-khan-aca...</a><p>[4]: <a href=\"https://github.com/Khan/perseus\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Khan&#x2F;perseus</a>","time":1406909900,"type":"comment"}