{"by":"AngularJobs","id":8121271,"parent":8120070,"text":"Angular Developer to help build a cutting-edge, next generation UI in Downtown Seattle, WA<p>&gt; <a href=\"https://www.angularjobs.com/posts/1016-angular-developer-to-help-build-a-cutting-edge-next-generation-ui-in-downtown-seattle-wa\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;posts&#x2F;1016-angular-developer-to-...</a><p>&quot;Build JavaScript heavy apps in an agile environment. Join a self-motivated &amp; empowered team at one of Washigton&#x27;s Best Companies to Work for.&quot;<p>About Daptiv<p>===<p>Daptiv is a SaaS-based enterprise Project and Portfolio Management company. Their applications have revolutionized the ways that customers manage teams, projects, and portfolios, allowing customers around the world to transform their mid-office business operations.<p>&quot;We are an Agile shop that believes self-motivated, empowered teams can do extraordinary work.&quot;<p>About the Job<p>===<p>- Our Engineering team is looking for a talented web developer with strong experience in the latest web technologies to help us build our cutting-edge, next generation UI.<p>- We are creating advanced, data-driven UIs for our scheduling and resource management views.<p>- We are looking for devs that buy into the Agile SDLC, writing unit tests, pair programming when needed, contributing and using CI, many code checkins per day, many small code reviews per day, etc..<p>- In addition, we desire devs that aren&#x27;t afraid to dive into the full stack when needed, mostly C# and some Java. Ex: If there&#x27;s an API that doesn&#x27;t exist, they will work with the team to build it out. Lastly, all developers at Daptiv contribute to our CD efforts and will need to learn how to write Chef recipes to support this.<p>- We moved from AJAX and ASP.NET to AngularJS a year ago; since have launched a number of AngularJS apps.<p>Apply here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/1016\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1016</a><p>Required Experience<p>===<p>- Building maintainable and high-performing JavaScript-heavy web applications<p>- HTML5, CSS3, JavaScript, jQuery, jQuery UI<p>- Integrating with RESTful APIs for server side functionality<p>- Knowledge of cross-browser compatibility issues as well as experience with legacy and modern browsers<p>- Client side MVC style frameworks such as AngularJs, Ember, or Backbone w&#x2F; Marionette<p>- Responsive CSS, and responsive CSS frameworks such as Twitter Bootstrap<p>- Javascript build tools, such as Grunt<p>- Languages that compile into javascript, such as Typescript, Coffeescript, or Dart<p>- Testing frameworks such as mocha, jasmine<p>Compensation<p>===<p>- We can offer relocation for the right candidate, but will assess that on a case by case basis.<p>Apply here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/1016\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1016</a><p>More About the Company<p>===<p>From new product development to operations and service delivery, Daptiv’s on-demand solutions streamline employees’ day-to-day interaction and collaboration while dramatically reducing the complexity of managing multiple teams, projects and tasks. Daptiv has evolved from a startup founded in cramped Pioneer Square offices 12 years ago to the on-demand leader in collaborative business software that it is today.<p>Clients: Honeywell, Chase Bank, Coach, Virgin, Kaplan, BP, Good Samaritan Society.<p>Voted one of Washington’s “Best Companies to Work For”<p>Daptiv is located in Downtown Seattle just steps away from the WaterFront, Ferries, Water Sports and home of Pike Palace, the oldest public farmers markets in America(est. 1907).<p>Team Size: 5-10<p>Leverages agile methodology.<p>Apply here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/1016\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1016</a>","time":1406911253,"type":"comment"}