{"by":"AngularJobs","id":8121007,"parent":8120070,"text":"Angular UI Developers: Help Improve the State of Health Data. Work on the East or West Coast!<p>&gt; <a href=\"https://www.angularjobs.com/posts/1090-angular-ui-developers-help-improve-the-state-of-health-data-work-on-the-east-or-west-coast\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;posts&#x2F;1090-angular-ui-developers...</a><p>&quot;Join Aetion in Los Angeles or NYC. Help Improve Health Care. Very Interested in candidates from Top Universities!&quot;<p>Locations<p>===<p>- Los Angeles, California<p>- New York, New York<p>The Role<p>===<p>- Work with with HTML5, JavaScript, CSS3, AngularJS, jQuery, Bootstrap, and RESTful JSON APIs<p>- Create responsive web applications<p>- Implement best practices<p>- Have passion for code quality<p>- Test with Karma&#x2F;Angular Mock<p>- Use agile methodologies<p>Desired Background<p>===<p>- 2+ years of experience as a web developer<p>- Engineering or Science degree (CS, EE, math, physics, etc.) from top-tier university<p>- Familiarity with web-based, multi-tier software architectures<p>- Firm grasp of software implementation best practices; passion for code quality and testing<p>- Ability to work in a fast-paced, team-oriented environment and to learn new concepts and technologies<p>- Self-motivated, independent, detail oriented<p>About Aetion<p>===<p>Aetion allows Health Care practitioners and researches to query multiple databases for the information they need. Real-world data is in their blood: combining decades of medical, epidemiologic and biostatistical research with cutting-edge informatics and data handling, Aetion provides proven software for rapid-cycle generation of reliable results from real-world data.<p>Culture<p>---<p>Aetion is a small company that just entered into a major growth phase. Their typical Dev Team consists of 5-10 folks.<p>Apply here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/1090\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1090</a>","time":1406909752,"type":"comment"}