{"by":"BrianPetro","id":8121796,"parent":8120070,"text":"Lead Frontend ‪#‎AngularJS‬ Web Dev for Post Production &amp; Advertising company in SOHO, LONDON<p>&gt; <a href=\"https://www.angularjobs.com/posts/1131-lead-frontend-angularjs-web-dev-for-post-production-advertising-company-in-soho-london\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;posts&#x2F;1131-lead-frontend-angular...</a><p>&quot;Smoke &amp; Mirrors is a leading Post Production and VFX transcreation house in need of a new guru - join our small team, make a difference!&quot;<p>ABOUT THE COMPANY<p>===<p>Smoke &amp; Mirrors is a leading Post Production and VFX transcreation house. We work in the heart of Soho, in the thick of a great creative media environment. We work with and share chic new office space with some brother and sister companies who are doing similar high-end work delivering brand messages for our clients in over 180 countries and in over 200 languages. 150,000 brand marketeers, procurement specialists and agency partners access our services and technology each and every month.<p>ABOUT THE JOB<p>===<p>We need a talented front end web dev to help build more intelligent application suites, in an agile environment, to service internal projects.<p>We’re a small team looking for a well-rounded developer, but whose current interest and focus is on UI and is interested in performance, data-intensive web apps and automated testing.<p>We have an existing groundbreaking internal application engine - which uses semantic-web technologies - that’s ready for launch: it’s been designed to flexibly model many business processes to eventually replace multiple legacy applications. You’ll continue that project with the existing backend-focused developer, with the goal of shaping the framework to forge into our second business-domain app replacement, whilst continuing to shape the code for further launches.<p>You’ll also get the opportunity to contribute ideas and code to Smoke &amp; Mirrors’ ongoing involvement in UK government-backed cutting-edge research projects where there&#x27;s scope to learn a lot of new technologies from talented and venerated academics and professionals.<p>Apply here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/1131\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1131</a><p>KEY RESPONSIBILITIES<p>===<p>- Take ownership of the design and development of our new internal business application<p>- Helping with UI, design and collaborative ideas and architecture for multi-party projects<p>- Minor ad-hoc support for existing apps&#x2F;scripting that support our use of high-end video post-production applications (but really we’re interested in replacing old processes, not propping them up)<p>Experience<p>===<p>- Several years’ hands-on web development experience<p>- Computer Science Qualification<p>- Excellent Javascript skills<p>- Deep knowledge of HTML5&#x2F;CSS3<p>- Angular JS &gt;1 year dev<p>- Node.js proven experience<p>- REST, web sockets<p>- Commitment to unit testing<p>- Awareness of performance issues<p>- GIT<p>Nice to have<p>===<p>- Knowledge of semantic web technologies: RDF&#x2F; Triple Store &#x2F; SPARQL<p>- Some exposure to video processing would be helpful, but not required<p>ABOUT THE JOB AND WORK ENVIRONMENT<p>===<p>- Agile environment – set goals and deliverable<p>- Standard Office hours – no death marches….<p>- Fun, young, media-based, atmosphere – kickstart your social life…<p>Apply here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/1131\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;1131</a>","time":1406915738,"type":"comment"}