{"by":"AngularJobs","id":8121589,"parent":8120070,"text":"Impact Advertising w&#x2F; AngularJS. Experience High-Growth w&#x2F; 100M+ Users Weekly! Work in Boston or NYC<p>&gt; <a href=\"https://www.angularjobs.com/posts/832-impact-advertising-w-angularjs-experience-high-growth-w-100m-users-weekly-work-in-boston-or-nyc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;posts&#x2F;832-impact-advertising-w-a...</a><p>&quot;Both Junior &amp; Senior Available! Focus on JavaScript. TDD Angular components. &quot;Never lost a developer over price&quot; - CTO&quot;<p>Join a small team in a well-funded startup changing the way advertising affects 100M+ people every week. Looking for passionate people who love the startup life and care about user experience, customer development, working with a diverse group of smart &amp; experienced people, and having fun every day, no grinches allowed.<p>- Team Size: Small (3-4)<p>- Looking to unload all Javascript so the current developer can work on Big Data (his niche)<p>- Looking for someone who can work well independently but ask for help when they need it<p>Apply Here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/832\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;832</a><p>Workplace<p>---<p>- Whiteboards everywhere<p>- Natural light with no glare<p>- Height-adjustable desks<p>- Triple monitors and the fastest MacBooks money can buy<p>- Great location next to the Alewife stop on the red line and an easy drive on Route 2<p>- The internal cafeteria, run by Whole Foods, is the best you can get, short of the one at the Googleplex<p>Senior Expectations<p>---<p>- Experience in high-growth start-up environments<p>- Recognizes extraordinary opportunities<p>- Brave enough to seek help<p>- Excited about self-improvement<p>- Expert knowledge of Javascript<p>- Experience with TDD<p>- Implements cross-browser development techniques<p>- Understanding of Node.js(JavaScript environments outside of the browser)<p>- CORS<p>- AMD JavaScript module development<p>- MongoDB<p>Junior Expectations<p>---<p>- JavaScript Experience<p>- TDD Experience<p>- Start-up ambitions&#x2F;experience<p>- Has something to prove<p>- Asks the right questions<p>- Passion for improving advertisements<p>Toolset<p>---<p>- NodeJS<p>- Grunt<p>- AngularJS<p>- jQuery<p>- NPM<p>- RequireJS<p>- Jasmine<p>- PhantomJS<p>- (suggestions?)<p>The Product<p>---<p>Patent-pending search engine takes the search keywords, negative terms and match types from your campaigns and matches these against multiple focused search queries extracted from the content of each web page. This allows for the programmatic, pixel-perfect matching of search ads to search intent through ads that are embedded in the content. If users choose to engage with a Swoop search ad they are driven to the appropriate brand content. If they don’t, their browsing experience continues uninterrupted.<p>The Process<p>---<p>- Preliminary discussion with AngularJobs<p>- Referral for interview with the CTO<p>Compensation &amp; Benefits:<p>---<p>- &quot;Never lost a Developer over Price&quot; - CTO<p>- Equity in company depending on skill set<p>Apply Here:<p>&gt; <a href=\"https://www.angularjobs.com/apply/832\" rel=\"nofollow\">https:&#x2F;&#x2F;www.angularjobs.com&#x2F;apply&#x2F;832</a>","time":1406913750,"type":"comment"}