{"by":"mfjordvald","id":8121771,"parent":8120070,"text":"OnePlus - <a href=\"http://oneplus.net\" rel=\"nofollow\">http:&#x2F;&#x2F;oneplus.net</a> - Shenzhen, China, Relocation required and working visa provided.<p>At OnePlus we&#x27;re trying to redefine the smartphone market with a disruptive business and marketing model. We&#x27;re probably crazy taking on the industry giants but crazy is what&#x27;s needed to pull something like this off - and so far it&#x27;s working.<p>Our team of 30 people are responsible for all sales outside China. We handle everything from our e-commerce to marketing and support and often one person can be in several roles should he or she prefer - for instance help execute a marketing idea or organize a fan gathering.<p>We are based in Shenzhen, China, an hour north of Hong Kong. Our team is international - consisting of more than 10 different nationalities - so all work takes place in English. If you happen to know Mandarin that&#x27;s a plus but most of our team members don&#x27;t.<p>Ultimately we are well on our way to realizing our dream with mainstream media starting to take notice: <a href=\"http://time.com/3006267/oneplus-one-review-phone-of-dreams/\" rel=\"nofollow\">http:&#x2F;&#x2F;time.com&#x2F;3006267&#x2F;oneplus-one-review-phone-of-dreams&#x2F;</a><p>To help us get all the way we are looking to hire for multiple different roles.<p>PHP programmer: Chiefly Laravel and Magento programming with some XenForo inbetween. We currently build and manage our e-commerce platform, community forum and centralized account system with future plans being far more ambitious.<p><a href=\"http://oneplus.net/careers/php-programmer\" rel=\"nofollow\">http:&#x2F;&#x2F;oneplus.net&#x2F;careers&#x2F;php-programmer</a><p>Front-end developer: Help us perfect our user experience with modern HTML and CSS, perform multi-variant testing and perform user studies. Your job is to make our platform as intuitive and frictionless as possible.<p><a href=\"http://oneplus.net/careers/front-end-programmer\" rel=\"nofollow\">http:&#x2F;&#x2F;oneplus.net&#x2F;careers&#x2F;front-end-programmer</a><p>Customer support manager: Help us tackle problems in customer support and scale our customer support operations. The key to any well respected company is to treat your customers well. Your as a customer support manager is to figure out how we can meet customer support demand as efficiently as possible.<p><a href=\"http://oneplus.net/careers/customer-support-manager\" rel=\"nofollow\">http:&#x2F;&#x2F;oneplus.net&#x2F;careers&#x2F;customer-support-manager</a><p>Your dream job: We want to hire smart and experienced people. If we don&#x27;t have a job position that fits you perfectly but you believe we should, then apply and tell us why we&#x27;re missing your contribution. If we agree we&#x27;ll create a position for you to fix that mistake.<p><a href=\"http://oneplus.net/careers/your-dream-job\" rel=\"nofollow\">http:&#x2F;&#x2F;oneplus.net&#x2F;careers&#x2F;your-dream-job</a><p>We&#x27;re looking for many more people for many different roles, please have a look at our full careers page and get in touch if you&#x27;re what we&#x27;re looking for - and we&#x27;re what you&#x27;re looking for.<p><a href=\"http://oneplus.net/careers/\" rel=\"nofollow\">http:&#x2F;&#x2F;oneplus.net&#x2F;careers&#x2F;</a>","time":1406915547,"type":"comment"}