{"by":"justinweiss","id":8121747,"parent":8120070,"text":"Avvo is hiring web developers in Seattle, WA!<p>Feel free to contact me directly: jweiss@avvo.com, and let me know you came from HN.<p>We&#x27;re looking for a Web application developer to help shape the way people connect with the lawyers who will make a difference in their lives.<p>At Avvo, you&#x27;ll get to work with smart, passionate people in small, focused, cross-discipline teams building Web, iOS, and Android applications. You&#x27;ll take a product from conception to completion, shaping its direction the whole way. You&#x27;ll have the flexibility to build each project in the way you think is best, using the best tools and technologies. You&#x27;ll own the development of the project from the front end to the database layer.<p>When you&#x27;re done, you&#x27;ll get to extract stuff that would be useful to other people and open-source it. We&#x27;re the team behind projects like resque-scheduler (<a href=\"https://github.com/bvandenbos/resque-scheduler\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;bvandenbos&#x2F;resque-scheduler</a>), robut (<a href=\"https://github.com/justinweiss/robut\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;justinweiss&#x2F;robut</a>), resque_unit (<a href=\"https://github.com/justinweiss/resque_unit\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;justinweiss&#x2F;resque_unit</a>), and delsolr (<a href=\"https://github.com/avvo/delsolr\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;avvo&#x2F;delsolr</a>).<p>We use whatever tools and technologies we think are best for the situation, including Ruby, Rails, Redis, Solr, Git, Chef, SASS&#x2F;Compass, neo4j, Sinatra, Objective-C, and EC2.<p>We&#x27;re looking for:<p>* Passion for building software. Huge bonus points if you&#x27;ve built or maintained open source software or side projects. (Send us your GitHub profile!)<p>* The ability to identify and institute software best practices throughout a team and organization.<p>* Someone who can provide technical leadership. You should be comfortable mentoring new developers, sharing knowledge across the team, driving a new project from the beginning, and thinking about how projects and teams will interact on a strategic level.<p>* Experience working on a large software project over several years. You should be able to reliably add features to shipped code, identify and reduce technical debt, participate in the product design process, estimate accurately, and provide quality feedback to the rest of the team.<p>* Enthusiasm for learning about new technologies and sharing them with your coworkers. We&#x27;ve seen huge productivity improvements from using new tech, so a keen eye for cool new stuff is a plus.<p>* Collaboration with other disciplines - you&#x27;ll be working closely with designers and PMs, and it takes everyone&#x27;s skills to build something remarkable.<p>* A strong desire to build the best product for your customers, no matter how long it takes to get there.<p>We&#x27;ll give you:<p>* A competitive salary and generous stock options.\n* The machine of your choice.<p>* Three weeks of vacation each year.<p>* Paid conference expenses, books, and classes.<p>* A great working environment in a beautiful building in the International District, on the bus and light rail lines, walkable from Belltown, Downtown, Capitol Hill, and Pioneer Square.<p>* A free ORCA card for all your public transportation needs.<p>* A strong work &#x2F; life balance - we&#x27;ll ask a lot of you while you&#x27;re here, but we&#x27;re not going to make you work 10-hour days.<p>Besides all this, I&#x27;ve been here for almost seven years and I still love it. Devs really get a lot of freedom and autonomy here, and we get to work really closely with other disciplines like product, design, and marketing. I love that, since we all get to learn from each other. And we ship code all the time.","time":1406915231,"type":"comment"}