{"by":"dsiroker","id":8121626,"parent":8120070,"text":"Optimizely - San Francisco, CA - Fulltime, Permanant. Intern&#x2F;H1-B okay as well.<p>Optimizely is a website optimization platform. We enable businesses to show the right thing to the right person at the right time.<p>Our first product makes A&#x2F;B Testing easy. In 4 years we’ve grown to become #1 in the category with 7,000+ paying customers including Starbucks, Disney, and Salesforce. We&#x27;re profitable and our revenue is growing 400% year-over-year. Last May, we raised 58 million dollars to allow us to continue building great new products.<p>Join us in our mission to empower businesses to make better data-driven decisions.<p>About the Job:<p>We have scale: 7,000+ customers (including 100 of the top websites in the world); 120 billion server requests&#x2F;month You’ll work on our amazing visual editor - a cutting edge tool that is the core of our product - and will enable it to do even more awesome things for our customers Work in small teams, in a continuous integration environment; we’re fast and nimble: 1-2 deployments every day<p>About Us:<p>You’ll work on our amazing visual editor - a cutting edge tool that is the core of our product - and will enable it to do even more awesome things for our customers. We are also building a mobile SDK for both iOS and Android and are working on some great new products.<p>Requirements:<p>A track record of being able to ship product, independently and&#x2F;or as part of a small team. We will leave out the long list of languages because we would prefer a great engineer to someone who knows some Ruby.<p>Bonus Points:<p>Passionate about front end technologies, you have a curiosity that motivates you to experiment and keep on top of technical trends Practitioner of progressive enhancement, and responsive UI design Good at debugging using dev consoles, firebug, firecookie, or any of your favorite tools Fearless - you’ll tackle a massive JavaScript codebase, and are willing to prototype crazy, awesome ideas<p>Perks:<p>Free city-wide Gym membership at any Crunch Fitness. Free Clipper Card to pay for your commute from anywhere in the bay area. Catered in-office lunch and dinner on weekdays. Full medical insurance with very low co-pay and deductible. HMO, PPO, and HSA options available. Full dental coverage including orthodontics. Full vision coverage including contacts. Dependents 100% covered for medical, dental, and vision. Unlimited vacation policy. 401k benefit. Top-of-the-line MacBook Pro or MacBook Air and 30&quot; monitor. Working with a great team and having a huge impact!<p>If you&#x27;re interested, please shoot me an email at Ryan.Jordan@optimizely.com!","time":1406914018,"type":"comment"}