{"by":"jdotjdot","id":8121922,"parent":8120070,"text":"The Campus Job - New York, NY\nReach out to: joinus at thecampusjob dot com<p>Our early-stage startup aims to change the way students make money and get work during school. Two years ago, we created a prototype as a side project for fun (no marketing or maintenance), and since then, we’ve have had clients from Fortune 500s to well-known startups sign up for and use our service. However, we’ve decided to quit our cushy jobs at Google + McKinsey, and instead focus on growing this to be bigger and better than ever before… and we need your help. Our new website (with a much larger mission than before) is launching to the public in 1-2 weeks, so we need someone who can join our team as soon as possible (ideally in the next 1-2 months) to help build out cool new features for our quickly growing userbase.<p>We’re looking for a front-end developer to be the final founding member of our team. You should be experienced with or excited to learn AngularJS. You’ll work closely with our CTO, and we even hope that you can eventually take over the title and managing the entire engineering team as we continue to hire. You’d start by working with the CTO on growing the site, then quickly moving on to your favorite of the other exciting projects we have planned, involving cutting-edge web design, machine learning, natural language processing, and more. The back-end of the site is built in Django with Python, and knowledge of it is not required, though familiarity with Django or Rails could be helpful.<p>The New York-based team of four includes co-founders from McKinsey and Google, as well as the best salespeople and marketers in the business.  We’re really fun, and incredibly diverse. Our interests range from traveling and cooking to hacking to beer-brewing.<p>We look forward to hearing from you, so please reach out if you’re interested in learning more!<p>The Must-Haves:\n* Degree in CS or equivalent experience (we’re happy to take a look at your code!)\n* Front-end web development experience, including mobile-friendly pages\n* Experience with Javascript and CSS3\n* Experience with or an appetite to become the expert in AngularJS\n* A love of college<p>The Nice-To-Haves:\n* Being in New York\n* Knowledge of Python\n* Familiarity with an MVC framework like Django or Rails","time":1406917059,"type":"comment"}