{"by":"hirobert","id":8121360,"parent":8120070,"text":"The Noun Project - Los Angeles, CA<p><a href=\"http://thenounproject.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;thenounproject.com&#x2F;jobs&#x2F;</a><p>jobs@thenounproject.com<p>--------------------------<p>Django &#x2F; Python Developer<p>The Job:\nThe Noun Project isn&#x27;t just a library of icons: it&#x27;s an active venue for ideas, where users share and create our visual language. We need a full-time Python developer to make this space available, functional and evolving. The right candidate is a life learner with a proven background in modern MVC frameworks (Django and the like), fluency in Javascript (jQuery and CoffeeScript) and an understanding of APIs. They should be both disciplined and imaginative in their work, a great communicator and a clean coder. Those with a working knowledge of front-end development and an interest in web standards will be at an advantage.<p>The Traits:\nYou&#x27;re a developer with several projects under your belt. You understand how to validate user input and optimize queries to make fewer database calls. You’re also familiar with making requests to REST-ish APIs.<p>The Responsibilities:\nDeveloping user facing features with Django Working directly with designers and front-end developers<p>The Perks:\nMarket salary Generous benefits Valuable equity Creative work environment Ability to really affect a product We&#x27;re small. We all share our ideas. We all collaborate.\nWhen you apply for this position, make sure to send your resume and a link to your personal site or portfolio. Developers without a website or web portfolio need not apply.<p>----------------------------<p>Senior Interaction Designer<p>The Job:\nThe Noun Project is seeking an ambitious lead interaction designer based in LA. The right candidate has an understanding of design, interactions, and a passion for visual communication.<p>The Traits:\nApplicants must have experience working on a variety of projects, including mobile, web, and desktop, and have a proven background in leadership and creative direction. Individuals should also be familiar with HTML, JavaScript (jQuery), and CSS. Those with an an interest in making the world a better place will be at an advantage.<p>The Perks:\nMarket Salary Generous benefits Valuable equity Creative work environment Ability to really affect a product We&#x27;re small. We all share our ideas. We all collaborate.\nWhen you apply for this position, make sure to send your resume and a link to your personal site or portfolio. Designers without a website or web portfolio need not apply.<p><a href=\"http://thenounproject.com/jobs/\" rel=\"nofollow\">http:&#x2F;&#x2F;thenounproject.com&#x2F;jobs&#x2F;</a><p>jobs@thenounproject.com","time":1406911858,"type":"comment"}