{"by":"drone","id":8121127,"parent":8120070,"text":"UI Developer &#x2F; MacroFab, Inc. &#x2F; Houston, TX Full-time<p>==== About MacroFab<p>MacroFab is making it easier, faster, and less expensive for makers and creators to get their designs to market through cloud-enabled electronics manufacturing and automated operations services. Our goal is to make it possible for any maker or product designer to get their product to market quickly and easily, whether their market is 100 users or 100,000.<p>Fully interactive and automatic production tools for electronic products, with direct control over all just-in-time manufacturing and fulfillment tasks through the web and via APIs. MacroFab is the first electronics manufacturing service to give makers and entrepreneurs a completely transparent, scalable, and manageable outsourcing capability.<p>===== Why Work with Us?<p>We’re creating the next generation of manufacturing services, one which is powered not by cheap labor, but by intelligent software and beautiful machines. We’re creating a service that has all of the capabilities we needed when we had a small products company. We’re makers, developers, and entrepreneurs who are working to enable other makers, developers, and entrepreneurs. We are all about building things: machines, software, and communities. We’re focused on that point where abstracts meet reality and concrete inventions are born. If you like creating new, beautiful code and machines, if you like the challenge of tackling difficult problems, and if you want to help inventors and makers get from idea to product fast while saving them money and time, then we’d love to have you on our team.<p>====== About You<p>As a UI Developer at MacroFab, you’ll be responsible for creating rich, interactive user interfaces using Mojolicious that enable our customers to quickly and easily take full control over our manufacturing capabilities and verify the final results. You’ll work with a highly-decoupled MVP architecture using Mojolicious, Perl, ElasticSearch, memcached, MySQL, RabbitMQ, AWS, jQuery, Mustache.js, and Bootstrap. Your work will also create API endpoints for internal systems to access user-generated data. The user interfaces you build will interact with CAD data from customers and allow them to explore their products before they are manufactured.<p>======= Get in Touch!<p>Send your resume and some examples of your work to jobs@macrofab.net","time":1406910306,"type":"comment"}