{"by":"jonathaven","id":8122630,"parent":8120070,"text":"Haven - San Francisco - Full-time<p>You will be the first engineering hire at a VC funded startup in San Francisco that is modernizing one of the largest industries in the world but one most people never think about. Haven connects ocean carriers and shippers with smart, easy to use software and services to more efficiently manage their supply chain. Haven is currently working with transportation and logistics providers in Asia, Europe, and North America.<p>On the technical side this is an opportunity to build a world-class SPA application that serves a high-volume of transactions that have a real-world impact. We will be leaders in establishing the JS ecosystem for enterprise development and look forward to making meaningful contributions to the open source community.<p>We love well designed products, digital and otherwise. We’re looking for an engineer with a similar mind-set.<p>Responsibilities:<p>Architecting and building features for a single page web application \nRedesigning features based on customer feedback\nWorking with the latest development frameworks<p>Requirements:<p>3+ years of professional development experience; we’ll gladly take more experience and compensate accordingly\nNode.Js experience\nAngular.Js or experience with similar platform (Backbone, Ember, etc…)\nREST API design experience\nTest writing experience\nOO design skills\nSQL and NOSQL experience \nCSS &#x2F; LESS &#x2F; HTML<p>Bonus Points:<p>Scala, Java, C# or other statically typed language with enterprise features\nDomain Driven Design experience (DDD)\nTDD experience\nFunctional programming experience\nGrunt &#x2F; Chef &#x2F; Puppet &#x2F; Docker &#x2F; Vagrant etc...\nAWS &#x2F; Heroku<p>What You Can Expect From Us:<p>A friendly and encouraging work environment with a minimum of politics\nClear goals and expectations\nExposure to a problem domain that most people will never get to see\nMentorship from founders that are deeply experienced with shipping products, digital and otherwise<p>Benefits:<p>A free personal trip to an international port city of your choice once a year - no, we won&#x27;t put you in a shipping container like that scene from Silicon Valley\nLaptop and display of your choice\nExcellent healthcare plan (medical &#x2F; dental &#x2F; vision)\nGym membership reimbursement \n401(k)\nCommuter Benefits<p>Apply at <a href=\"http://jobsco.re/1kqKye0\" rel=\"nofollow\">http:&#x2F;&#x2F;jobsco.re&#x2F;1kqKye0</a>","time":1406924998,"type":"comment"}