{"by":"micahgoulart","id":8122211,"parent":8120070,"text":"deviantART - Mobile Applications Developer - Remote - <a href=\"http://deviantart.com\" rel=\"nofollow\">http:&#x2F;&#x2F;deviantart.com</a><p>deviantArt was created to entertain, inspire, and empower the artist in all of us and today is the leading destination on the Internet for creativity and the arts.  The Devious Technology department is responsible for working on interesting scalable technologies and fun features across a number of areas of DeviantArt. Our remote teams work on a rapid iteration process and encourage collaboration between developers, UI designers, product managers and non-technical staff.  <p>You&#x27;re a great fit for us if you have:<p>- BS or MS in Computer Science or equivalent experience\n- 2-3 years of software development experience in team based environments\n- A track record of working on scalable production level interactive Android native mobile applications, preferably you will have apps in the store to reference\n- Ability to demonstrate expert level development skills across a range of technologies including: Android - Java\n- Knowledge of Object Oriented Design, and the MVC paradigm\n- Experience with integration of RESTful APIs into Mobile Applications and ability to rapidly evaluate unfamiliar systems and design integration solutions<p> You’re an even better fit if you have:<p>- Experience with Android testing\n- Experience with Android Studio &#x2F; gradle\n- Worked with git or another distributed version control workflow and modern code-review developer tools and processes\n- Experience with web development stack is a plus<p> We also enjoy looking at code samples. Please submit links to your live projects, github accounts or other examples of your best sample code!!  <p>  This position is open to both US and non-US residents. We like telecommuters and offer flexible work schedules!<p>Shoot us an email at alicia@deviantart.com or apply at <a href=\"http://deviantart.theresumator.com\" rel=\"nofollow\">http:&#x2F;&#x2F;deviantart.theresumator.com</a>","time":1406919998,"type":"comment"}