{"by":"erikwiffin","id":8122322,"parent":8120070,"text":"Research Square - Durham, North Carolina and remote - www.researchsquare.com<p># About Us<p>Research Square (RS) is the parent company of American Journal Experts (AJE), Rubriq, and Journal Guide. RS was founded in 2004 as AJE and offers a fast-growth startup-like environment with 120+ employees. We&#x27;ve been profitable since day one. At RS, we see our mission as greater than just building a product, and we are passionate about helping the scientific research community discover and implement better research faster.<p>At RS we have an “Open Office” environment where people can choose to work from home. We have a good number of folks who come into the Durham office for periodic meetings, work sessions, board game nights, team outings, Kinect nights with the office XBox, etc. We like hanging out together...we&#x27;re fun. We also have team members who do all that remotely, and that&#x27;s OK too.<p># Positions Available<p>## Front-End UI&#x2F;UX Developer<p><a href=\"http://researchsquare.theresumator.com/apply/mKX8u0/FrontEnd-UIUX-Developer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;researchsquare.theresumator.com&#x2F;apply&#x2F;mKX8u0&#x2F;FrontEnd...</a><p><pre><code>  + Utilize the latest web development standards and hands-on technical skills to\n    create standards compliant, cross-browser compatible sites and applications that\n    conform to our brand standards.\n  + Work with other members of the engineering team to make sure all the pieces fit\n    where they should, do what they&#x27;re supposed to, and interact the right way with\n    our back-end systems using our (well documented) APIs.\n  + Work with our two front-end engineers to translate visual concepts and design specs\n    into clean, fast-loading solutions.\n</code></pre>\nRequirements<p><pre><code>  + minimum of 3-5+ years experience developing websites\n  + experience with non-table based layouts and generating mock-ups on the fly for\n    browsers HTML, CSS, JavaScript\n  + ability to hand-code clean, standards-compliant, cross-browser compatible HTML,\n    CSS and JavaScript code\n  + know how to resolve issues with even outdated browsers. Significant chunks of our\n    IE browser customers use versions as low as 7.0.\n</code></pre>\n## Software Development Engineer<p><a href=\"http://researchsquare.theresumator.com/apply/KbZdNP/Software-Development-Engineer.html\" rel=\"nofollow\">http:&#x2F;&#x2F;researchsquare.theresumator.com&#x2F;apply&#x2F;KbZdNP&#x2F;Software...</a><p>This is the right fit for you if you&#x27;re comfortable with both working collaboratively with other developers, as well as being independent. You will be working on a variety of projects for internal as well as external clients, including building web applications, APIs, search and social integration tools, data analysis tools, and much more.<p>Requirements<p><pre><code>  + experience with relational databases\n  + experience with object-oriented programming\n</code></pre>\nBonus points<p><pre><code>  + experience with Zend Framework &#x2F; Slim Framework\n  + experience with ORMs\n  + experience with JavaScript (jQuery)\n  + experience with JSON, REST and APIs\n  + familiarity with Git or other DVCSes</code></pre>","time":1406921305,"type":"comment"}