{"by":"bitcrusher","id":8122414,"parent":8120070,"text":"FlareWorks - <a href=\"http://www.flareworks.co\" rel=\"nofollow\">http:&#x2F;&#x2F;www.flareworks.co</a> - San Francisco, CA. Bay Area Only<p>Interested in changing the world? Neither are we! But we are interested in having fun and building cool software.<p>FlareWorks is a mobile messaging startup headquartered in San Francisco, California. Our mission is to build a platform for contextual communication between family and friends that is easier, simpler and safer than texting. Our company’s visual messaging service —called \nFlares— uses visual cues, instead of text, to provide communication shortcuts between friends and family.<p>We&#x27;re a seed funded, early stage startup, so this is an opportunity to get in on the ground-floor. You would be engineer number 2 or 3. We&#x27;re looking for mobile developers, both iOS and Android to help us take our application and platform to the next level. Our mobile apps are the face of the organization and, as such, you’ll be on the front lines of creating an application and experience that has the potential to be used by millions of people every day.<p>Our Stack:\n  * Node for our API.\n  * Erlang for our platform.<p>What we offer:\n  * We&#x27;re not fans of 9-5 with a lunch break. Work when you want, where you want. Results matter. &quot;Seat Time&quot; does not.\n  * Unlimited PTO. Take the time off you need, when you need it. We don&#x27;t offer prizes for &#x27;attendance&#x27;.\n  * 5K equipment budget. Buy what you want; After a year, it&#x27;s yours to keep.\n  * Company outings. We like to get out and do things as a team. Lunches, dinners, games, volunteering, concerts. We&#x27;re always on the lookout for things to do.\n  * A real voice. We want to know what you think. If you have an idea or think something isn&#x27;t working, we want to hear about it. Your voice counts.\n  * Generous options and an actual competitive salary ( no low balling + options bait and switch here ).<p>What we&#x27;re looking for:\n  * Senior level Android and iOS engineers.\n  * UX and visual design chops.\n  * Meticulous attention to details.\n  * Android:\n    * Animation and the hardware accelerated rendering pipeline as well as OpenGL ES.\n    * Location, Content and Media SDK experience.\n  * iOS:\n    * Core Graphics, Core Animation, Core Data, Core Location\n  * Comfort with rapid iteration and real-time team collaboration.<p>If this sounds like a good fit for you, email us (jobs@flareworks.co) and we&#x27;ll talk.","time":1406922554,"type":"comment"}