{"by":"krishna_sh","id":8122091,"parent":8120070,"text":"Nimble Storage:\nEssential Functions:<p><pre><code>    Influence the overall vision and direction of the product and provide valuable technical input.\n    Responsible for working on new initiatives and features in CASL file system, Protocols and Performance.\n    Work with the CTO, product management and architects to crystalize new product requirements.\n    Create architectural and functional specs and other design documentation.\n    Responsible for designing, coding, testing and debugging components in Nimble Storage’s data services group.\n    Work with other data services teams, QA, customer support and platform team to solve complex customer and release issues.\n    Provide guidance to management and participate in technical communication with customers.\n    Work collaboratively and guide other engineers.\n</code></pre>\nRequirements:<p><pre><code>    BS in CS or EE required. MS degree preferred with at least 10 years of experience in software design and development\n    Must have very strong system programming background with C&#x2F;C++ for large enterprise class software.\n    Must have proficiency with data structures, algorithms and multi-threaded programming\n    Must have in depth knowledge of OS internals.\n    Must be capable of debugging issues in multi-threaded and clustered environments.\n    Prior experience in leading one or more of the following areas is a huge plus:\n        Data-path on large and complex modules.\n        Distributed Systems, Clustering or HA\n        Memory management, Virtualization or De-duplication\n        Replication, QoS, Storage Protocols (iSCSI&#x2F;SCSI, FC, NFS, CIFS).\n        Performance tuning and modeling\n        Use of Performance analysis tools e.g. Oprofile, gprof.\n    Experience in developing enterprise software products, passion for quality and excellent software engineering practices.\n    Experience providing technical leadership to small-medium size engineering teams is a plus.\n    Ability to write clear and articulate functional and design specifications\n    Ability to work independently and manage multiple priorities in a fast-paced environment and take on a variety of roles as needed\n    Ability to convert vague project ideas into detailed high level and bottoms up effort estimates.\n</code></pre>\n<a href=\"http://www.nimblestorage.com/company/careers.php\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nimblestorage.com&#x2F;company&#x2F;careers.php</a>","time":1406918561,"type":"comment"}