{"by":"jaaron","id":8123346,"parent":8120070,"text":"Riot Games - Full-time in Los Angeles &#x2F; St. Louis &#x2F; Points elsewhere globally<p>Riot Games, developer and publisher of League of Legends, is looking for highly accomplished engineers passionate about the technology that excites and engages millions of players globally. Our opportunities run the gamut of Game Development, Big Data, eSports, Merchandise, Live Service Development and Corporate IT Systems. With 27 million players daily, we face cutting edge technical challenges at scale. Consequently, we’re an engineering organization that values “T-shaped” engineers. We are expected to make pragmatic decisions about the best tool for the job, thus a broad exposure to many languages and tools is vital.<p>Excited to improve the game engine behind today’s largest PC game? Interested in crafting the future of infrastructure as a service? Curious about the role of open source in the video game industry? Thrilled to participate in and cultivate a global engineering organization? We are. If this sounds like you, check out the careers section on the Riot Games website or apply directly:<p><a href=\"http://boards.greenhouse.io/riotgames/jobs/10838#.U7Mi8Y1dWH9\" rel=\"nofollow\">http:&#x2F;&#x2F;boards.greenhouse.io&#x2F;riotgames&#x2F;jobs&#x2F;10838#.U7Mi8Y1dWH...</a><p>Ok, corporate speak aside, League of Legends offers a pretty amazing and rare intersection of core video gaming and cutting edge, large scale, interesting tech problems. For those of us engineers who are gamers in our heart, this is a chance to work on something you’re truly passionate about. I feel quite lucky to work at Riot and am excited to have other other gamers join us in building games by players and for players. If you have any questions, feel free to hit me up directly on Twitter or LinkedIn. (PLEASE let me know this is why you&#x27;re reaching out to me though!)<p><a href=\"https://twitter.com/jaaronfarr\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;jaaronfarr</a> <a href=\"https://www.linkedin.com/in/jaaronfarr\" rel=\"nofollow\">https:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;jaaronfarr</a>","time":1406934931,"type":"comment"}