{"by":"linhphan","id":8123076,"parent":8120070,"text":"Remind, SOMA, San Francisco - Education startup\nwww.remind.com&#x2F;careers<p>Our messaging system makes it easy and safe for teachers to communicate with students and parents, largely in the US and recently-launched to international markets.<p>* 20% of US teachers use and love our product. Teacher testimonials, “truly one of the most life-changing app for teachers”, “this is the best tool for teachers since electronic gradebooks”, “this is one of the best teaching tools I’ve used in my 22 years of teaching.”<p>* We have 7MM monthly active users! We deliver 80M messages per month.<p>* Series B was $15M. Total funds raised $20M from First Round Capital, Social+Capital (led by Chamath Palihapitiya) &amp; Kleiner Perkins (led by John Doerr).<p>* Current Engineering opportunities include fullstack, frontend, backend, and iOS Engineers! We love hiring generalists. \nTech stack: Our architecture consists of many small micro services built with Ruby, Node.js and Go, running on top of Heroku and AWS behind a public RESTful API. We use Postgres, DynamoDB, Redshift and Redis heavily, with a massive job queue backed by Sidekiq and RabbitMQ. Frontend clients include a native iOS &amp; Android app as well as a full AngularJS single page app.<p>Other opportunities: Community Manager, Sr. Designer, Sr. Product Manager.<p>* Benefits: Competitive salary and equity, company-paid premiums for you and your dependents for medical&#x2F;dental&#x2F;vision, short- and long-term disability coverage, FSA plan, 401K plan, paid holidays, and open vacation policy!<p>* And what about perks? Public transit&#x2F;parking reimbursement, gym membership reimbursement, weekly kick-ass boot camp classes, monthly hack days, trips to technical conferences, company off-sites, weekly happy hours, fully-stocked kitchen and fridge, delicious catered free meals, foosball table, badminton, basketball, 20-foot loft ceilings with lots of lights. We’re a bunch of kids-at-heart and even have swings!","time":1406930477,"type":"comment"}