{"by":"wschroed","id":8131602,"parent":8120070,"text":"St. Louis, MO, United States - Business and Technology Applications Analyst II<p>I am looking for another software developer for the LIMS group at The Genome Institute, a position where the primary language is Perl. You may contact me directly (my user name at genome.wustl.edu) with your resume and samples of code or hosted repositories; it does not matter to me what languages you choose. Officially, you can apply to this job through <a href=\"https://jobs.wustl.edu\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.wustl.edu</a> (search for job ID 28449). Below is a copy of the official job posting with all the HR legalese. :) This is considered a mid-tier position, between junior and senior experience.<p>SUMMARY<p><pre><code>  - Job Title: Bus &amp; Tech App Analyst II - The Genome Institute - 28449\n  - Job ID: 28449\n  - Location: Medical School\n  - Full&#x2F;Part Time: Full-Time\n  - Regular&#x2F;Temporary: Regular\n\n</code></pre>\nJOB TYPE&#x2F;SCHEDULE<p>This position is full-time and works approximately 40 hours per week. Position hours are generally M-F 8:30-5.<p>DEPARTMENT NAME&#x2F;JOB LOCATION<p>This position is at the Genome Institute. This position is for the Medical School Campus.<p>ESSENTIAL FUNCTIONS<p>The Genome Institute at Washington University has an opening for a talented software engineer in the Bioinformatics group. The position will work with an experienced group of software engineers to develop software supporting the tracking of laboratory data and analysis processes to support large scale genomic research projects. The Genome Institute has been at the forefront of genome research since its inception in 1993 and has been a part of major scientific projects such as the Human Genome, 1000 Genomes and TCGA (The Cancer Genome Atlas) Projects. The Genome Institute is a world-leader in the generation and analysis of genomic sequence data and uses this data to extend biological knowledge of the human genome and provide clinically relevant sequence analysis aimed at understanding human diseases (such as cancer and Alzheimer&#x27;s disease). In addition, the Institute fosters public understanding of genomic science through various educational and outreach efforts.<p>REQUIRED QUALIFICATIONS<p>Certification or degree in computer programming from a technical school or college plus two years of relevant work experience required. Additional relevant programming experience may be substituted on a year-for-year basis for required education<p>PREFERRED QUALIFICATIONS<p>The ideal candidate has a talent and love for writing software, is interested in developing that skill, and applying it in a production environment. The candidate will be expected to learn new things on a regular basis, think critically, and collaborate with other developers across groups. The environment is fast-paced and a person who likes to get things done will find a lot of opportunity. Design, testing, debugging, and problem analysis are a regular part of the work. Skills in abstract software design, object-oriented architecture, relational data modeling, and web interface design will be used frequently, which will require thorough knowledge of each concept. The applicant will use these skills to develop software that will: interface with people and&#x2F;or laboratory equipment, process and analyze large data sets on a compute cluster, and provide intuitive web based interfaces to the specifications of the laboratory managers and technicians. Proficiency in dynamically typed languages (Perl, Ruby, Python, Lisp, etc.) is a plus, but not required. Understanding of relational databases and SQL will be helpful. Experience with web technologies such as HTML, CSS, Javascript and approaches such as REST and AJAX is an asset. Regular work will be done in GNU&#x2F;Linux and other UNIX-like development environments. Familiarity with open source technologies, version control software such as git, and programming in a network environment are also assets.<p>SALARY RANGE<p>The hiring range for this position is commensurate with experience.<p>DEPARTMENT SUMMARY<p>One of only three NIH-funded large-scale genome centers in the United States, The Genome Institute at Washington University is a leader in genomics research as it applies to the study of biology, human disease and the field of personalized medicine. Founded in 1993, The Genome Institute focuses on cancer genomics, the genomics of heritable diseases, microbial and pathogen genomics, as well as novel sequencing and evolutionary genomics.\nOur mission is to help improve the human condition by producing, studying, and interpreting high-quality genome-based data that drives biological discoveries that range from the bench to the hospital bedside. We value the open sharing of information and ideas and encourage collaboration while also engaging the next generation of scientists through educational outreach efforts.<p>BENEFITS<p><pre><code>  - Retirement Savings Plan\n  - 22 vacation days\n  - 8 Paid Holidays\n  - Sick Time\n  - Tuition benefits for employee, spouse and dependent children\n  - Free Metro Link&#x2F; Bus pass\n  - Free Life Insurance\n  - Health, Dental, Vision\n  - Health Savings Accounts (HSA)\n  - Long Term Disability Insurance\n  - Flex Spending Plan\n  - Other Benefits\n</code></pre>\nMed School HR website (<a href=\"http://medschoolhr.wustl.edu\" rel=\"nofollow\">http:&#x2F;&#x2F;medschoolhr.wustl.edu</a>)<p>EOE STATEMENT<p>All qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, protected veteran, or disability status.","time":1407158653,"type":"comment"}