{"by":"mhall","id":8131645,"parent":8120070,"text":"Chicago, IL, USA - Software Developer<p><a href=\"http://mintel.atsondemand.com/index.cfm?fuseaction=512212.viewjobdetail&amp;CID=512212&amp;JID=434811\" rel=\"nofollow\">http:&#x2F;&#x2F;mintel.atsondemand.com&#x2F;index.cfm?fuseaction=512212.vi...</a><p>We have a great opportunity for a talented individual to join the IT team in Chicago as a Software Developer. Joining an established team, the candidate will be redeveloping marketing intelligence websites that are used by most of the largest CPG companies and financial services institutions in the US and Canada, as well as the data entry and quality assurance systems which power it.<p>Responsibilities:<p>- Participate in planning activities with the Product Owner and other stakeholders.\n - Develop features for our client-facing website and data entry software.\n - Demo software to stakeholders and record their feedback.\n - Participate in testing and other quality assurance activities.\n - Manage the deployment of new features to beta and live environments.\n - Contribute to continuous improvement activities.<p>Benefits:<p>- Join a diverse, high-functioning Scrum team who enjoy great relationships with their Product Owner and stakeholders.\n - Exposure to our full software stack, using primarily Open-Source software.\n - A culture that fosters entrepreneurial spirit.\n - Influence the direction of your team through continuous improvement activities.\n - Collaborate with your team in an agile open workspace, or retreat to one of our quiet areas when you need to focus on individual tasks.\n - Intensive pairing activities to get you up to speed quickly with our technology stack.\n - Generous health insurance, vacation time, and 401k matching.\n - Access to recreational activities such as ping-pong, shuffleboard, on-site gym and regular social events.<p>Experience and Skills:<p>- STEM degree or equivalent experience coupled with a proven ability to solve problems with code.\n1-3 years of experience (academic or professional) of software development.\n - Ability to learn and adapt to new technology platforms.\n - Experience in web technologies, Python, and POSIX-based systems is beneficial but not required.\n - Desire to work in a highly collaborative environment and participate fully in agile software development processes.\n - Aptitude for identifying and solving problems, both technical and organizational.\n - Desire to enhance your development capabilities with some of the skills of a sysadmin, tester and DBA.<p><a href=\"http://mintel.atsondemand.com/index.cfm?fuseaction=512212.viewjobdetail&amp;CID=512212&amp;JID=434811\" rel=\"nofollow\">http:&#x2F;&#x2F;mintel.atsondemand.com&#x2F;index.cfm?fuseaction=512212.vi...</a>","time":1407159511,"type":"comment"}