{"by":"danielha","id":8135358,"parent":8120070,"text":"Disqus is hiring:\n* Dev Ops Engineer &#x2F; Site Reliability Engineer\n* Data Engineer\n* Algorithm Engineer\n* Backend Engineer\n* Frontend Engineer\n* Product&#x2F;UX Designer<p>Apply here: <a href=\"http://grnh.se/7po6vh\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;7po6vh</a><p>--<p>About Disqus<p>What is Disqus? \nDisqus is a free service that enables great online communities. As the web’s most popular discussion system, Disqus is used by 3 million websites that cover pretty much any topic imaginable. Our magic is in connecting people to stuff worth talking about.<p>Who are we? Disqus is a fast-growing team making a big impact. We’re a group of hackers and tech geeks who love the web and believe that better communities will make an even better web. We believe in amazing user experiences, well-designed code, and fast, iterative development.<p>We go above and beyond when it comes to thinking outside of the box to solve problems creatively. We&#x27;re driven to learn and implement new technologies, and figure how to scale them to accommodate our massive scale. Are you up for the challenge of building an application that supports 50,000+ requests per second, and 4MM active concurrent connections to our realtime stream? Then join us.<p>We love what we do, and we love the team we’ve built: <a href=\"http://disqus.com/about\" rel=\"nofollow\">http:&#x2F;&#x2F;disqus.com&#x2F;about</a>.<p>---<p>Work Perks<p>We&#x27;re a small team that gets a lot done and has a lot of fun along the way. All full-time employees of Disqus receive the same great benefits:<p>* Competitive salaries and stock options\n* Daily catered lunch and fully stocked snacks, drinks, and beer\n* Weekly in-office yoga and massage\n* Apple computers and a bountiful equipment policy\n* Flexible hours, so you can be at your most productive\n* Generous out-of-office time for holidays, vacation, sick leave, and personal or family needs\n* Comprehensive medical, dental, and vision plan options\n* Team celebrations: company anniversaries, birthdays, weddings, babies - you name it, we celebrate it!\n* 401(k) plan, pre-tax commuter benefits, employee assistance program and flex spending accounts\n* Convenient office location in SOMA near public transit (blocks from BART, Muni, Caltrain) and parking\n* Friendly, casual office environment with plenty of toys (foosball, ping pong, video games, and more)","time":1407208978,"type":"comment"}