{"by":"jonmort","id":8136655,"parent":8120070,"text":"Adaptavist - Developer - Leamington Spa, UK<p>---- About Adaptavist ----<p>Adaptavist - In operation since 2005 as a lifestyle business, but re-imagined  in 2011 as a super charged Atlassian consultancy with real pedigree, has gone on from strength to strength. We are the biggest dedicated Atlassian consultancy in the world today!<p>We deliver consultancy around strategy, architecture, and execution of all aspects of Application Lifecycle Management. We work with clients to develop a vision, to plan and then execute on a client’s behalf.  We then go on to manage and operate services on for them over the longer term. All this wrapped with our library of plugins, thought leadership and other IP in this space.<p>With it’s global headquarters in the technology hub of London, England, but with a truly global delivery footprint, Adaptavist is recruiting to build out it’s physical presence in the UK as well as both Germany and the USA in support of it’s rapid commercial growth.<p>Adaptavist’s approach to hiring in these new territories is to seek out talent, and craft a role around that talent supported by training as required in pursuit of the simple goal of excellence. Each country operates as part of the whole, with local team members, being part of a larger global team.<p>Far from being just another Atlassian partner, we consider ourselves to be a boutique consultancy helping organisations improve or re-engineer all aspects of their software delivery supported by the Atlassian tools.<p>---- Developer Leamington Spa ----<p>Requirement:\nWe have need for a Developer (Java based) to join a new team being established in Leamington Spa. We are looking for someone with commercial experience developing across a range of languages and technologies with our primary focus being:<p><pre><code>  * Java\n  * Javascript\n  * SQL\n  * HTML&#x2F;CSS\n  * Ruby\n</code></pre>\nThe successful candidate will have the following attributes:<p>* Passion for technology and experience that they can talk about at length including a history of object oriented programming (preferably in Java) and an appreciation of client side applications (web technologies should be familiar)<p>* They should also have a habit of learning new technologies and investigating ideas new and old and be able to express opinions on these areas including areas of interest yet to be investigated.<p>* The ability to take part in a technology debate, contributing opinions and being able to back them up when challenged with a competing view is valuable.<p>We typically find that the sort of person we are looking for has hobby projects (in a range of completion states) and participates in the open source community through things like:<p><pre><code>  * Google Code\n  * GitHub\n  * Bitbucket\n</code></pre>\nAncillary knowledge is important - the areas matter less than the breadth and depth - Examples of such areas may be experience with:<p><pre><code>  * Logic programming\n  * Functional programming\n  * Linux\n  * Puppet\n  * Networking\n  * Switches\n  * Protocols\n  * Hardware hacking\n</code></pre>\nWe’re looking for someone who can demonstrate their ability to learn quickly and deeply with a solution in mind.<p>You will be as comfortable working in teams as independently and will have opportunities to work with customers as part of a consultancy-led delivery team. Customer facing experience is a bonus. Over time we expect candidates to grow into being able to lead themselves and others, working within our continually improving current good practices, implementing solutions for leading global organisations. Future career growth might be into areas of consultancy, software architecture or management. Let us know what you&#x27;d like to do.<p>So far, our successful hires in this area have found Adaptavist’s challenges &amp; clients, as well as our fun &amp; flexibility to be key attracting factors. The variation between small tactical and larger strategic projects is a bonus, as we don’t find our employees bored or feeling like they aren’t challenged on a weekly, or even daily, basis. There’s an opportunity for the right person to join a like-minded team as part of a cutting edge company making a real difference to organisations of all shapes and sizes.<p>If you think that you have the above criteria and feel you would fit into our Adaptavist family - please get in touch recruitment@adaptavist.com","time":1407243611,"type":"comment"}