{"by":"maramartin","id":8138362,"parent":8120070,"text":"SF - Full-Stack Ruby on Rails Engineer @ STORENVY<p>We&#x27;re hiring an experienced Full-Stack Ruby on Rails Engineer to join our small, collaborative and growing development team. You&#x27;ll share major technical responsibility on our products such as the Storenvy Marketplace, our API or backend support for the Storenvy iOS app.<p>Truth be told, most of us are full-stack engineers, but if you&#x27;d like to specialize in a particular area we&#x27;re open to it. As a member of this core team you&#x27;ll make important technical decisions, collaborate with other engineers, and ensure the scalability and performance of our applications through performant code and solid architecture.<p>Here are some of the things you&#x27;ll help us accomplish:<p>* Rapidly develop features in the Storenvy product roadmap in a test-driven, engineer-friendly environment.<p>* Improve architecture &#x2F; Ops: We&#x27;re moving to a service-oriented architecture this year to enhance developer productivity and to support scalability.<p>* Drive Consumer Growth: Measure and assess user engagement via metrics tools. Create tools that help merchants become more successful.<p>* Mobile: Work on the upcoming Storenvy mobile apps.<p>* API: Enable stores to power up through third party integrations.<p>We&#x27;d be especially thrilled to see candidates with the following experience:<p>* 2+ years of professional software engineering experience, with at least 1 professional project where you worked in Ruby on Rails.<p>* Interest in growing our product and our company. We&#x27;re successful because we build with our passionate community in mind.<p>* Strong communication and teamwork skills.<p>* Experience scaling a web application with Ruby, MySQL and Redis.<p>* Experience with test-driven development.<p>Bonus points for:<p>* Interest or experience developing and shipping native mobile apps.<p>* Experience in developing ecommerce or payments solutions.<p>* Ship a Ruby gem or have a cool side project? Tell us about it!<p>How To Apply:<p>* The Sourcery will be the first point of contact.<p>* All applications receive a response.<p>* All applications are kept strictly confidential.<p>* Apply via <a href=\"http://www.thesourcery.com/jobs/773/applications/new\" rel=\"nofollow\">http:&#x2F;&#x2F;www.thesourcery.com&#x2F;jobs&#x2F;773&#x2F;applications&#x2F;new</a>","time":1407261892,"type":"comment"}