{"by":"mataniko","id":8144778,"parent":8120070,"text":"thePlatform - Client Integration Engineer - New York, NY (Area) - Local only, work from home.<p>thePlatform helps some of the world’s largest media companies manage and publish their video content online. Some of our customers include SyFy, Fox Sports Network, NBC Sports, National Geographic, the Travel Channel, Oxygen and more.  As an independent subsidiary of Comcast, we enjoy the benefits of a relationship with a large company while maintaining keeping the agility of a startup.<p>This position will be filled remotely in New York City, and will report to the Manager of Integration Engineers in Seattle, WA.<p>thePlatform offers competitive compensation and spectacular benefits typically seen only at very large organizations, including free cable, internet and an employee stock purchase plan, due to our company’s association with Comcast. Please visit our Careers page to learn more about our culture and benefits. www.thePlatform.com<p>We&#x27;re looking for someone with a development background and account management skills.<p>Responsibilities:<p><pre><code>  * Develop and code custom Groovy scripts according to the customers ingest requirements.\n  * Develop and code custom Java&#x2F;.NET projects using thePlatform API&#x27;s to meet various customer application needs.\n  * Seamless project management through all phases of the customer relationship - coordinating with the customer, account manager, technical resources, and support personnel.\n  * Communicating regularly with the customer to evaluate satisfaction and proactively identify upcoming needs.\n  * Coordinating with technical personnel as needed to meet customer needs, while managing customer expectations to prevent overload or missed deadlines.\n  * Formal routing of customer requests to engineering, sales or support as needed.\n  * Communication to the customer regarding new features and releases of thePlatform services.\n  * Documentation of current customer practices.\n  * Travel: 5-10%\n</code></pre>\nRequirements:<p><pre><code>  * 3+ years experience in professional services or technical project management.\n  * Experience with a variety of web development technologies such as DHTML, JavaScript, XML, REST.\n  * Knowledge and ability to develop in .Net (C#) or Java.\n  * Technical understanding of Web Services, current trends in the mobile and broadband marketplace.\n  * Energized by making customers happy and successful.\n  * Ability to understand the customer and to anticipate future needs and help determine the ideal solution for issues.\n  * Phenomenal communication skills are a must for this job.\n  * Steadfast and calm in explosive situations.\n  * Ability to multitask effectively.\n</code></pre>\nFeel free to contact me at matan.bareket [at] theplatform.com","time":1407358087,"type":"comment"}