{"by":"askhr","id":8150347,"parent":8120070,"text":"Dictionary.com - Oakland (iOS Developer) Full Time<p><a href=\"https://hire.jobvite.com/j?aj=oHvnYfwh&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=oHvnYfwh&amp;s=HackerNews</a><p>Dictionary.com is a profitable, growing, and massive website with over 50 million unique users per month. More people visit Dictionary.com every year than go to the movies. Our customer base includes anyone who wants to feel smarter and communicate better. Our family of free, advertising-supported sites: Dictionary.com, Thesaurus.com and Reference.com provide accurate and exhaustive definitions, synonyms, examples, pronunciations, translations, and more for millions of words. We create innovative and timely products to facilitate learning and intellectual growth, such as the Word of the Day which is enjoyed by 1 million people every day. Our vision is to go beyond a simple web utility and become the #1 trusted and inspirational brand for words and word meanings anywhere.<p>The Role\nDictionary.com is seeking an exceptional iOS Developer to be part of a growing in-house team. As an iOS engineer at Dictionary.com, you will play a large role in all aspects of iOS development. Your code and technological feats will be seen by millions of active users on web, tablet and smartphone products.<p>Responsibilities:<p>Collaborate with the product and design team.\nDesign and implement new user-facing features in Dictionary.com’s iOS products.\nBuild the libraries and frameworks that support internal analytics and marketing platforms.\nLiaison with external &amp; internal resources.\nAbility and willingness to mentor others on mobile technologies.<p>Qualifications:<p>1 - 4 years of iOS development experience.\nExperience deploying consumer-facing apps to the iTunes app store.\nComputer Science degree or equivalent experience.\nConsiderable experience with Objective C and Cocoa Touch.\nExperience with REST APIs.\nWeb development skills such as: HTML, CSS and Javascript&#x2F;jQuery.\nExperience with sizing projects and providing status updates.\nUnderstanding of code documentation best practices and style.\nStrong communication skills.\nMust learn and work well independently and also within a collaborative team environment.<p>Preferred Qualifications:<p>Experience with C and C++.\nExperience working with large-scale, consumer-facing apps.\nStrong competencies in data structures and software architecture.\nExperience working in an agile development environment.<p>Apply now:\n<a href=\"https://hire.jobvite.com/j?aj=oHvnYfwh&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=oHvnYfwh&amp;s=HackerNews</a>","time":1407448884,"type":"comment"}