{"by":"BVB","id":8154720,"parent":8120070,"text":"YouEye, Inc. - <a href=\"http://www.youeye.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youeye.com</a> - Front End Rails Developer (Full-Time or Contract) - Mountain View, CA<p>The Company<p>Our mission is simple: we all use mobile apps and the Internet, so let&#x27;s make them better, together. YouEye is bringing user research labs to the cloud. If customer insights are the currency of product development, we are the bank.<p>We have an extensive repertoire of software, including OSX, iOS, Windows, Android, and web applications. Our mobile apps can be found on iTunes ( <a href=\"https://itunes.apple.com/us/app/youeye-for-participants/id660935955\" rel=\"nofollow\">https:&#x2F;&#x2F;itunes.apple.com&#x2F;us&#x2F;app&#x2F;youeye-for-participants&#x2F;id66...</a> ) and Google Play ( <a href=\"https://play.google.com/store/apps/details?id=com.youeye.recorders.android.web\" rel=\"nofollow\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=com.youeye.rec...</a> ).<p>The Task<p>Working at YouEye, you have the unique responsibility of not only making our own products better, but influencing thousands of web products by assisting in the development of a great user research toolset. From page analytics to signal processing and participant sourcing, there&#x27;s a lot of stuff going on behind the scenes.<p>Whether you&#x27;re cranking out some CoffeeScript, integrating an API, or hacking on CSS, we want engineers who care about user-centric design.<p>The Engineer<p>You&#x27;ve made something awesome on the web. Whether you&#x27;ve built an entire online web application or coded a killer javascript widget, you know your way around clean design and code. You are comfortable with modern web frameworks, image manipulation tools, rapid prototyping, MVC architecture, and writing tested code. We use Ruby on Rails as our web stack, with CoffeeScript, jQuery and a pinch of love.<p>On a team, we work fast and hard. You are comfortable pair programming and working with other engineers. You are opinionated but flexible. Above all, you want to ship an incredible product and have an integral role in making that happen.<p>We view our perfect candidate as someone who has:<p>- Created a website or web app via Ruby on Rails<p>- Spent plenty of time working with CSS &amp; related technologies<p>- Experienced writing HTML5, JavaScript, and other fancy technologies built on those foundations, such as AngularJS and CoffeeScript<p>- (Optional) Set up or used any Amazon Web Services for a project<p>- (Optional) Developed applications for the mobile space, especially mobile web apps<p>Don’t hesitate to apply if you don’t meet all of the bullet points above. If you have any demo projects to show off, that is a big plus! We would love to see what you have created, be it a personal website, a mobile app, or a cool algorithm that you’ve open sourced on GitHub.<p>The Culture<p>Sure you love making great products, working on open source projects, and telling the tales of great engineering triumphs, but what else are you up to? We&#x27;re made of musicians, pilots, snowboarders, yo-yo enthusiasts, gamers, hikers, cyclists and comedians. We want to learn from you!<p>The Benefits<p>- Competitive pay<p>- Stock options<p>- Comprehensive Healthcare&#x2F;Dental&#x2F;Vision coverage<p>- Pre-tax commuter benefits<p>- Catered lunches<p>- Well-equipped break area<p>- Generous time off<p>- The gear you need to get things done<p>How to apply<p>Please send your resume and links to anything you’d like to show us to jobs@youeye.com<p>We accept both full-time and contract applications.<p>We are unable to sponsor a visa at this time.","time":1407527714,"type":"comment"}