{"by":"a_bergie","id":8154072,"parent":8120070,"text":"SnapEngage - <a href=\"http://snapengage.com\" rel=\"nofollow\">http:&#x2F;&#x2F;snapengage.com</a> - Front-End&#x2F;UX Software Engineer - Berlin, Germany or Boulder, CO<p>SnapEngage is a fast growing live chat solution for the web. We are an Internet startup (TechStars  2009) with offices in Boulder, Colorado and Berlin, Germany where everybody has a huge stake in the company’s success. We are customer funded and profitable. We’re committed to creating products that make peoples’ lives better and changing the way companies interact with their customers.<p><a href=\"http://snapengage.com/front-end-and-ux-software-engineer/\" rel=\"nofollow\">http:&#x2F;&#x2F;snapengage.com&#x2F;front-end-and-ux-software-engineer&#x2F;</a><p>What you&#x27;ll do:<p><pre><code>  * Create beautiful UI with millions of daily views on mobile and desktop\n  * Lead UI&#x2F;UX projects \n  * Research and promote new technologies to help improve our development processes\n  * Contribute ideas to improve our service and software\n  * Maintain and improve existing functionality\n  * Spend a few hours a week chatting with customers\n  * Participate in daily stand-up meetings with our global team\n</code></pre>\nWhat you know:<p><pre><code>  * Wizardly UI design skills and able to implement them in JavaScript, HTML and CSS\n  * Mastery of JavaScript frameworks like Backbone, Underscore, D3\n  * Excellent written communication skills in English, other languages a plus\n  * Ability to write clean, efficient code\n  * Quick learner, team player, positive attitude\n  * Experience with Google AppEngine, GWT, Eclipse is a plus\n  * Allowed to work in Germany (EU citizen or work visa holder) or in the USA\n</code></pre>\nAwesome benefits of working at SnapEngage:<p><pre><code>  * Work from home part of the week\n  * Gain-share plan\n  * Yearly team building trip to exotic locations\n  * Opportunity to make great ideas come to life\n  * Work with an awesome multicultural team\n</code></pre>\nCheck out our Jobs page for other positions too - <a href=\"http://snapengage.com/jobs\" rel=\"nofollow\">http:&#x2F;&#x2F;snapengage.com&#x2F;jobs</a><p>Come chat with us at <a href=\"http://snapengage.com\" rel=\"nofollow\">http:&#x2F;&#x2F;snapengage.com</a> if you&#x27;re interested!","time":1407519793,"type":"comment"}