{"by":"askhr","id":8166046,"parent":8120070,"text":"Ask.com - Oakland (Software Engineer, Smart Answers) Full-Time, Visa offered<p><a href=\"https://hire.jobvite.com/j?aj=oFpWYfwI&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=oFpWYfwI&amp;s=HackerNews</a><p>Us<p>Join the #1 brand and top Web property focused on answering people’s questions.  At Ask.com, we’re building a next-generation Q&amp;A service – spanning both the Web and mobile devices — that combines the power of search with insight from real users by developing products and tools that drive user satisfaction, revenue, and traffic.  We are serious about creating and maintaining a great culture and are looking for great people to come join our team.<p>The Role<p>Become part of a software engineering team that builds technology that directly answers our users questions.  Ask.com was the first search engine to develop and deploy this technology which uses a combination of linguistic analysis, API usage, editorial content, and structured data processing.   A wide array of tools and support applications create these Smart Answers and we are continually improving these tools while also creating new technologies to help our hundreds of millions of users around the world get to their answer as quickly as possible.<p>You\nYou are an experienced software engineer with a passion for coding excellence and a substantial interest in relational databases, big data systems, information retrieval, and application services. You will bring your innovation, motivation, and superior ability to problem solve to contribute to our continued success.<p>Your Task<p>-Maintain, troubleshoot, and improve a suite of software applications and tools that are critical to our content business.\n-Monitor and improve performance and health of the applications, tools processes, and infrastructure.\n-Be a constructive, participating member in migrating C#&#x2F;.Net&#x2F;ASP&#x2F;MSSQL applications to a Java&#x2F;Node.js&#x2F;MySQL environment.\n-Convert unstructured data to structured, relational databases and leverage those systems in data driven knowledge applications and services.<p>Your Skills<p>-Heavy knowledge in designing and optimizing complex SQL queries.  Strong experience using Stored Procedures. Understanding of the  differences between MySQL and MSSQL in order to port Stored Procedures from MSSQL to MySQL.\n-Hands-on experience using RESTful APIs and WebServices in C#&#x2F;.NET.  Experience with IIS, Tomcat, Jetty, JSP&#x2F;Servlet, and Apache httpd.\n-Proven experience in developing web services and applications in C# and .NET environments.\n-Proficient in building web services in JAVA.\n-Fast prototyping skills and familiarity with scripting languages such as Python and Unix shell scripting.\n-Strong unit testing, devops, and debugging skills.\n-Node.js experience a plus, especially with migrating from .NET&#x2F;ASP to Node.js.\n-Hadoop and big data experience a plus.\n-Computational linguistics and NLP experience desired.\n-Strong analytical problem solving skills.\n-Able to work effectively and cooperatively in a team environment.\n-Experience with the Agile development methodology.\n-BS&#x2F;MS in computer science, computer engineering or related technical field, and -5+ years experience in job offered or computer-related occupation.  PhD a plus.<p>Apply Now:\n<a href=\"https://hire.jobvite.com/j?aj=oFpWYfwI&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=oFpWYfwI&amp;s=HackerNews</a>","time":1407803418,"type":"comment"}