{"by":"askhr","id":8166035,"parent":8120070,"text":"Ask.com - Oakland (Node.js Platform Developer) Full-Time, Visa offered<p><a href=\"https://hire.jobvite.com/j?aj=o78ZYfwW&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=o78ZYfwW&amp;s=HackerNews</a><p>Us\nAs a top US internet site, Ask.com’s mission is to get our millions of users across the globe the answers they need. We&#x27;ve been in the Q&amp;A business for more than 17 years, and although Jeeves has since retired, we carry on his passion for serving our 100 million users with answers they can trust. We are serious about creating and maintaining a company culture that is both innovative and fun, and we’re looking for great people to come join our team.<p>The Role \nJoin a software engineering team that is responsible for developing a new application platform to support the Ask.com family of websites. Our focus is building great experiences for our users. The successful candidate is familiar with client side technologies and techniques, and has a stronger emphasis on HTTP, algorithms, network and service architecture. Some understanding of various data stores and distributed computing architecture is also beneficial.<p>Your Task\nDesign, build and test high performance scalable systems utilizing Node.js\nWork closely with internal engineering customer base to understand their needs and explore technology trade-offs\nWrite clean, well-tested, maintainable code\nJoin in design of a new platform from the ground up using the best technologies for the job\nThrive in a highly collaborative team\nDesign and implement from start to finish (R&amp;D, design documentation, prototyping, implementation, unit testing, test plan&#x2F;test cases)\nDrive continual improvement to our service oriented architecture<p>Your Skills\nBA&#x2F;BS in Computer Science or equivalent experience\nAdvanced JavaScript skills (OO, functional, Node.js a plus)\nAdvanced web fundamentals HTTP, AJAX, web sockets and other emerging technologies\nExperience with a breadth of languages including explicitly functional languages\nExperience building frameworks for front end clients (eg: desktop, mobile&#x2F;tablet)\nIn-depth knowledge of design patterns and their appropriate application\nSolid CS fundamentals in Algorithms, Data Structures, Operating Systems, Networking\nPreference for agile work environments\nExcellent written and verbal communications skills at the business and technical level\nStrong work ethic, commitment and team work\nAbility to create solid documentation.\nMaster of analysis, object oriented design and other abstraction patterns\nContributor to open-source project a plus<p>Apply Now:\n<a href=\"https://hire.jobvite.com/j?aj=o78ZYfwW&amp;s=HackerNews\" rel=\"nofollow\">https:&#x2F;&#x2F;hire.jobvite.com&#x2F;j?aj=o78ZYfwW&amp;s=HackerNews</a>","time":1407803191,"type":"comment"}