{"by":"denisjtyrell","id":13544184,"parent":13541679,"text":"Veeva Systems <a href=\"http:&#x2F;&#x2F;www.veeva.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.veeva.com</a> | Pleasanton, CA; Toronto, ON-CA | ONSITE<p>At 1,700 employees and growing and consistently strong financials (NYSE:VEEV), Veeva was named among the top fastest growing public technology companies on Forbes’ annual Fast Tech 25 list. We build innovative cloud solutions for some of the world’s largest pharmas and biotechs, and we need great people like you to make it happen.<p>We&#x27;re always hiring in every area, including:  Engineering, Product Management, Services, Sales, IT&#x2F;Ops and many others.  \nVisit our careers page at <a href=\"https:&#x2F;&#x2F;www.veeva.com&#x2F;meet-veeva&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.veeva.com&#x2F;meet-veeva&#x2F;careers&#x2F;</a> for a complete listing of jobs.<p>In particular, we are hiring for these positions:<p>1) Principal Software Engineer, Java - We are seeking an experienced Principal Software Engineer to join our Vault Development team to build new functionality into the Vault product and continue to scale the platform. The ideal candidate would have extensive experience with the usual Java open source frameworks, tools and technology like Java, Spring Framework, MySQL, and Hibernate.  Apply Here: <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;on5Q2fw4\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;on5Q2fw4</a><p>2) Principal Performance Engineer - We are seeking an experienced performance engineer with a passion to make cloud applications fast and efficient.  You will work with developers to test and optimize Veeva Vault software pre-production, and also monitor and troubleshoot performance issues in production.  This is a technical, hands-on role for someone who is adept at gathering and analyzing performance data and finding the root cause of performance bottlenecks.  Apply Here:  <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;oy3Q2fwd\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;oy3Q2fwd</a><p>3) Performance Engineer, QA - Is your passion performance testing, always looking for ways to better the user experience?  Do you hate waiting for a page to load up slowly and itch to get away from that page? As a performance engineer you&#x27;ll be a part of a team responsible for helping Veeva remain the world&#x27;s most highly performing, scalable, and reliable industry cloud computing company in the industry.  Apply Here:  <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;oh5yZfwD\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;oh5yZfwD</a><p>4) QA Engineer - Veeva Systems is looking for a QA Engineer that likes to figure out how things work and make sure they are working correctly.  This is a hands-on position for delivering a quality SaaS product.   You should want to be part of fast-paced team who takes pride in building great software and making customers happy.  Apply Here:  <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;o8GRZfwo\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;job&#x2F;o8GRZfwo</a><p>5) Mobile Software Engineers, Architects, QA, PM.  We are starting up a whole new mobile platform group and need mobile engineers, PM and QA who want to take on the new challenge of building a whole new mobile platform to enable our internal teams and eventually our partners and customers to build native mobile applications on top of Veeva Vault.  These positions will be available soon!  Keep checking here:   <a href=\"http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;?c=Product+Development\" rel=\"nofollow\">http:&#x2F;&#x2F;jobs.jobvite.com&#x2F;veeva&#x2F;?c=Product+Development</a>","time":1485977827,"type":"comment"}