{"by":"AlisaT","id":13546369,"parent":13541679,"text":"Rent the Runway | New York City, NY | Onsite - Full Time | visas welcome; relocation available<p>Here&#x27;s our careers page: <a href=\"https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;renttherunway\" rel=\"nofollow\">https:&#x2F;&#x2F;boards.greenhouse.io&#x2F;renttherunway</a><p>Here&#x27;s a general look at our tech stack: <a href=\"http:&#x2F;&#x2F;dresscode.renttherunway.com&#x2F;blog&#x2F;tech-stack\" rel=\"nofollow\">http:&#x2F;&#x2F;dresscode.renttherunway.com&#x2F;blog&#x2F;tech-stack</a><p>Hiring:<p><pre><code>  - Front end &amp; full stack engineers (Javascript&#x2F;React&#x2F;Redux)\n  - Back end engineers (Java and then some)\n  - Data engineers (Python and then some more)\n  - Mobile developers (mid to senior; iOS and Android)\n  - Software engineer in test (building test infrastructure; not manual QA)\n</code></pre>\nAbout engineering at RTR (dresscode.renttherunway.com):<p>Our engineering team works on product-oriented problems across the boundaries of e-commerce, mobile, analytics and shipping&#x2F;fulfillment. The backbone of our business is our custom logistics management system, which gives us the crucial ability to deliver the right product to the right user at the right time - a simple goal with a complex solution. We use data, engineering and algorithms to create a personalized website and an adaptive supply chain to fulfill our commitment to an amazing customer experience.<p>Engineers at Rent the Runway solve real business challenges and have a tangible impact on the success of the company. Some engineers work on cross-functional teams devoted to specific parts of our product, while other teams focus on functions like data engineering and DevOps. Our engineers come from different backgrounds, industries, and walks of life - and we all contribute to a collaborative, product-driven culture across our organization.<p>About the company:<p>Described by Forbes as “Tech’s Next Billion Dollar Star,” Rent the Runway is set to disrupt the $1.7T global fashion industry by ensuring that rental is a habitual, convenient, daily part of getting dressed. We believe that fashion is an industry that should be democratized by giving everyone access to real, quality clothing and the associated feelings of self-confidence that come with that.<p>We&#x27;re EBITDA profitable on over $100 million of revenue in 2016, and our last round of funding in Dec 2016 was led by Fidelity Investments - a vote of confidence in our long-term staying power: <a href=\"http:&#x2F;&#x2F;fortune.com&#x2F;2016&#x2F;12&#x2F;28&#x2F;rent-the-runway-series-e-funding&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;fortune.com&#x2F;2016&#x2F;12&#x2F;28&#x2F;rent-the-runway-series-e-fundi...</a><p>If you have additional questions, feel free to drop a line: atao (at) renttherunway.com<p>No recruiters, please.","time":1485990593,"type":"comment"}