{"by":"Xophmeister","id":13546593,"parent":13541679,"text":"Wellcome Trust Sanger Institute | Cambridge, UK | Onsite | <a href=\"http:&#x2F;&#x2F;www.sanger.ac.uk\" rel=\"nofollow\">http:&#x2F;&#x2F;www.sanger.ac.uk</a><p>Senior&#x2F;Software Developer, Human Genetics Informatics<p><a href=\"https:&#x2F;&#x2F;jobs.sanger.ac.uk&#x2F;wd&#x2F;plsql&#x2F;wd_portal.show_job?p_web_site_id=1764&amp;p_web_page_id=297364\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.sanger.ac.uk&#x2F;wd&#x2F;plsql&#x2F;wd_portal.show_job?p_web_...</a><p>We are seeking a software developer to join the Human Genetics Informatics (HGI) team at the Wellcome Trust Sanger Institute. HGI is an agile development team responsible for providing efficient access to cutting-edge analysis methods to human genetics faculty groups at the Sanger Institute.<p>Skilled developers are encouraged to apply regardless of prior job experience, as the focus is on coding and core computer science skills rather than on work experience. Recent graduates or current students in their final year are especially encouraged to apply, although it is essential that any candidate has substantial development experience outside of coursework (e.g. active participation in open source projects or the pursuit of personal coding projects). An interest in scientific research and a strong intellectual curiosity are also necessities, although a formal education in genetics is not required.<p>Our team&#x27;s focus is the development and operation of scientific analysis workflows and tools for genetic data analysis, as well as developing the infrastructure necessary to manage the efficient operation of those workflows.<p>This role will involve working as part of the HGI team to deliver working systems that produce analytical outputs for human genetics faculty research groups within the Sanger. Team members will be expected to produce quality code; to be able to work both independently and closely with colleagues to develop, debug, and optimize their code; and to be comfortable communicating directly with scientific researchers regarding requirements.","time":1485992587,"type":"comment"}