{"by":"ccheever","id":13543234,"kids":[13545304],"parent":13541679,"text":"Exponent | Software Developer | Palo Alto, CA | ONSITE, INTERNS, FULL-TIME | <a href=\"https:&#x2F;&#x2F;getexponent.com\" rel=\"nofollow\">https:&#x2F;&#x2F;getexponent.com</a><p>Exponent lets web developers build truly native apps that work across both iOS and Android by writing them once in just JavaScript. It&#x27;s open source and free and uses React Native. Several of our engineers are core contributors to React Native, and we regularly collaborate with Facebook and other companies on the direction of the framework.<p>Our technology is built around an Android&#x2F;iOS application which allows developers to load their JavaScript projects on the fly with no native build dependencies or waiting period for store deployment. Out of the box, developers using Exponent get access to native mobile APIs like push notifications, camera, maps, and more (<a href=\"https:&#x2F;&#x2F;docs.getexponent.com&#x2F;versions&#x2F;v13.0.0&#x2F;sdk&#x2F;index.html\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.getexponent.com&#x2F;versions&#x2F;v13.0.0&#x2F;sdk&#x2F;index.html</a>).<p>We have a lot of irons in the fire, and we&#x27;re looking for engineers who can comfortably own and work on multiple projects. We&#x27;re also interested in hosting some interns for Summer 2017. Some examples of recent projects at Exponent:<p>* Creating cross-platform APIs (like our new WebGL implementation) that provide developers native mobile functionality within JavaScript<p>* Building our not-yet-released JSFiddle for mobile apps<p>* Designing and implementing a community front-end to explore applications built on Exponent<p>* Building the foundation of a scalable infrastructure to host our take on a new mobile web<p>Some projects that are underway or on the horizon for us:<p>* Rethinking developer tooling for React Native projects<p>* Greatly expanding the functionality available in our SDK&#x27;s API<p>* Improved monitoring and alerting for our infrastructure<p>* Increasing our test coverage and improving overall reliability<p>Some buzzwords:<p>React Native, JavaScript (ES6&#x2F;ES7, Flow), Android, iOS, Node.js, Electron, Go, Kubernetes, Google Cloud.<p>We don&#x27;t expect candidates to already be proficient in these, but it&#x27;s what we&#x27;re currently using day-to-day.<p>Please send an email to jobs@getexponent.com and mention this post if you&#x27;d like to start a conversation with us. Definitely include links to applicable resources: resume&#x2F;CV, your blog, GitHub profile, recent projects or open source contributions, etc. Typical interviews with us include remote pairing, small take-home projects (1-2 hours), and we usually finish with some more traditional in-person interviews.","time":1485972503,"type":"comment"}