{"by":"d3dtn01","id":13545831,"parent":13541679,"text":"Genome Medical | Product Manager | San Francisco Bay Area | REMOTE\nWHO IS GENOME MEDICAL\nGenome Medical, Inc. is an early-stage company using telemedicine to integrate genomic medicine into everyday health care.  Founded by personalized medicine pioneers Dr. Randy Scott, Dr. Robert Green, and Lisa Alderson, our goal is to bridge the growing gap between available genome technology and current medical practice.  As genetic information becomes increasingly important in medicine, there are too few experts to meet the growing demand for interpretation. We are addressing this challenge by creating a scalable, efficient model for lifelong genome-centered health care.   Our network of clinical genomics experts provides consultations to both patients and physicians.  To learn more, please visit www.genomemedical.com or find us on Twitter.\nROLE\nWe are searching for a product manager to transform our already launched, speed-to-market product offering into the envisioned experience that Genome Medical was founded upon.\nYou will be reporting directly to the CEO and will be responsible for all things product.\nRESPONSIBILITIES\n- Lead product management (requirements gathering, strategy&#x2F;concept development, execution, user and acceptance testing) to build the overall product vision and user experience for patients and clinicians.\n- Lead the development and customization of user workflows by working with the clinical team as well as partner organizations.\n- Serve as the voice of the customer and interface with our engineering team to translate customer requirements into development requirements.\n- Work with senior leadership to define product vision and strategy. \n- Drive innovation, definition, deliverables and design of product features to deliver against team and company goals, while working with outsourced engineers and designers\n- Establish a regular feedback loop to ensure we’re meeting our users needs.\n- Research trends and collect data to inform product direction, whether in the form of competitive intel, user behavior or other business metrics.\n- Coordinate with cross-functional teams to ensure a successful launch of solutions through training, support and marketing efforts.\n- Define and analyze metrics that inform the success of products.\nQUALIFICATIONS AND EXPERIENCE\n- 5+ years of product management experience delivering successful and innovative consumer products (consumer health experience is a plus).\n- Minimum 1 year of experience in healthcare.\n- Basic understanding of the technical architecture of web and mobile apps.\n- Exceptional communication, organizational and analytical skills.\n- Strong people skills, intuitive understanding of team dynamics.\n- Able to work cross-functionally with engineering, marketing, sales and operations teams.\n- Experience designing simple and intuitive user interfaces – ability to create examples through wireframes and mock-ups.\n- Experience using both qualitative observations and quantitative data to inform the development process.\n- Excellent written, oral, organizational and analytical skills with strong technical abilities.\n- Ability to accelerate the shipping&#x2F;launching of products, including providing hands-on leadership.<p>If interested, please submit your resume to  info@genomemedical.com.","time":1485986822,"type":"comment"}