{"by":"markstraub","id":13548671,"kids":[13548742],"parent":13541679,"text":"Smile Identity | Mountain View | Full time | Full Stack Engineer | REMOTE, VISA<p>Smile Identity solves hard problems of identity for high value transactions in low-trust environments. We are backed by Vinod Khosla &amp; 500 Startups.<p>We are looking for someone with a passion for server side development who wants to be a key part of the team designing a server architecture from the ground up. We need someone flexible that can code in a bunch of web technologies while dealing with the inevitable day to day issues of bringing a new service to life. The job is to implement and then continuously improve our API&#x27;s, enterprise facing web, server security, and cost per transaction.<p>Requirements<p>You love to code. You have coded a variety of languages&#x2F;technologies; in particular heroku, sql, rails, js, html, css, python.<p>You are comfortable with combining web and compiled languages in a unified system. You understand security, the need to protect our client&#x27;s privacy and the integrity of our data.<p>You understand the need for instrumenting. We need metrics for everything.<p>You are highly entrepreneurial. You take the initiative to solve problems as they arise, love to troubleshoot, and are flexible.<p>You are a great collaborator. You know that startups are a team sport. You speak your mind but also listen to others.\nYou can take the heat. You are organized, do well under pressure, and can prioritize multiple tasks.<p>You have been part of a team that launched and maintained systems and APIs at scale. You have worked with AWS services and components and have a deep familiarity with Linux.<p>Preferred Qualifications<p>You were a SysAdmin in a previous life.\nSome C&#x2F;C++ background\nSome ML background\nYou are a seeker of truth and get excited about expanding access and trust in underserved markets around the world<p>Qualified &amp; interested? \nEmail resume to talent@smileidentity.com","time":1486018571,"type":"comment"}