{"by":"bnoohi","id":13542303,"parent":13541679,"text":"Pangea Money Transfer | Chicago, IL | Lead iOS and Software Engineer (Platform) | Full Time, On Site | <a href=\"http:&#x2F;&#x2F;engineering.gopangea.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.gopangea.com</a><p>Founded in 2012 and headquartered in Chicago, IL, Pangea started with the mission of making money transfer simple, fair and safe. Since then, we’ve been striving to enhance the security and reduce the cost and pain points of international money transfer.<p>Our first solution allows users to complete a transfer in three easy steps and pay with any US debit card, with an innovative nationwide cash solution coming soon. Receivers in Mexico, Colombia, Guatemala, El Salvador and Dominican Republic can collect the transfers in cash or receive the money directly into a bank account. Through every partnership and product iteration, we’ll continue to help our users save more time and money.<p>Pangea is successful because of our world-class team members and strong passion for making an impact in our customers’ lives. We are different. We are innovative. We are eager to learn from each other. We are dedicated to building the world’s best platform for transferring money.<p>You can see the full description at:<p>- Lead iOS Engineer - <a href=\"http:&#x2F;&#x2F;engineering.gopangea.com&#x2F;join&#x2F;lead-engineer-ios\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.gopangea.com&#x2F;join&#x2F;lead-engineer-ios</a><p>- Software Engineer (Platform)\n<a href=\"http:&#x2F;&#x2F;engineering.gopangea.com&#x2F;join&#x2F;software-engineer-platform\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.gopangea.com&#x2F;join&#x2F;software-engineer-platf...</a><p>You can email me directly with a resume at bardia --at-- gopangea.com<p>You can learn more about the engineering team at:\n- <a href=\"http:&#x2F;&#x2F;engineering.gopangea.com\" rel=\"nofollow\">http:&#x2F;&#x2F;engineering.gopangea.com</a>\n- <a href=\"https:&#x2F;&#x2F;github.com&#x2F;gopangea\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;gopangea</a>","time":1485967786,"type":"comment"}