{"by":"ramikhalaf","id":13547993,"parent":13541679,"text":"Workpop | Santa Monica, CA | Front End Engineer | Full-time, onsite, (Relocation bonus, Visa Transfer, TN) | www.workpop.com | 5+ openings<p>Workpop is a well capitalized venture backed startup based in Santa Monica. We are streamlining hiring and HR for SMB’s and their employees. We provide employers with sourcing, screening, digital onboarding and employee management all in one place. For job seekers, Workpop makes the job application process less painful by providing more transparency and personalized feedback on how to get the jobs they want. We’re transforming an outdated industry with innovative technology and design, and we’re having a lot of fun doing it.<p>Workpop is looking for mission driven, talented, and passionate front-end software engineers to join our growing team. You work where design meets code. You know HTML5, CSS3, and JavaScript like the back of your hand. You&#x27;re passionate about experimentation, innovation, and playing around with the latest front-end technologies. You write clean, compatible, powerful user interfaces with speed. Bonus points if you are passionate about understanding your audience, and dreaming up ways to build great experiences for them.\nAs a core member of our growing team, you’ll work closely with the rest of our design, engineering, product, team to turn ideas into tangible user experiences. You&#x27;ll combine your keen design sense, stellar front-end chops, and the right technologies, to realize these ideas and validate them with users. Your wizardry will translate design concepts into living, breathing prototypes and finished products. We are a JavaScript shop: React, Meteor, node.<p>You can apply here <a href=\"https:&#x2F;&#x2F;www.workpop.com&#x2F;jobs&#x2F;64oY9i6iFYPmDGSDg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.workpop.com&#x2F;jobs&#x2F;64oY9i6iFYPmDGSDg</a> and mention hackernews, or reach out to me at &#x27;rami&#x27; at ‘workpop.com’","time":1486007924,"type":"comment"}