{"by":"octodragon","id":13551614,"parent":13541679,"text":"|| AlphaSights -- New York -- REMOTE &amp;&amp; ONSITE -- Full Time ||<p>Interview Process: 3 or 4 rounds of interviews with future teammates that you&#x27;ll be working with.<p>You’ll build usable software that supercharges our employees in their everyday work. We practice test driven development, continuous integration &amp; deployment, and pair programming.\nAs a Software Engineer at AlphaSights you will:<p>- Write high quality and maintainable code<p>- Understand all other functions of AlphaSights to build \nsoftware to meet the needs of our growing business.<p>- Work in a collaborative project team with two week iterations and be part of iteration planning and retros.<p>- Pair with teammates, review PRs, help others with technical questions &amp; share your learnings<p>- Learn to master a specific part of the stack, e.g., UI&#x2F;UX, microservices, DevOps, etc. with the opportunity to take on product and&#x2F;or technical leadership over time.<p>--- What We&#x27;re Looking For ---<p>At AlphaSights, we value diversity and individuality. Drawing on a range of experiences and perspectives better equips us to solve challenging problems. We believe you’ll be successful in this role if you:<p>- Have 1+ years of experience developing web applications and&#x2F;or programming with languages similar to Ruby,Javascript, Python, Java, etc.<p>- Are able to understand difficult technical problems and develop end to end solutions.\n- Enjoy collaborating and making teammates better by teaching and mentoring.<p>- Have excellent communications skills and are fluent in English.<p>- Take responsibility for leaving things in better shape than you found them.<p>- Are always positive and a little quirky.<p>For more information about our team, how we build, our projects, our tech stack, and our benefits, visit engineering.alphasights.com.<p>Questions? Interested in chatting? You can reach me at: isabel.lee@alphasights.com<p>Thanks and Have an Awesome Day!","time":1486052175,"type":"comment"}