{"by":"lizzyschiller","id":13552068,"parent":13541679,"text":"Smart Yields | San Francisco, CA or Honolulu, HI | Lead Javascript Engineer<p>THE COMPANY: We&#x27;re a team of farmers, engineers and explorers looking to change agriculture with technology. Posed with the complex problem feeding 9 billion people by the year 2050, we’re looking to team up with other individuals who are hungry to help us meet that goal by making farming a sustainable and prosperous endeavor.<p>JOB DESCRIPTION: In order to make a change in agriculture, we need great engineers who are independent problem-solvers looking to use their programming skill sets to make a change for a greater good. Software plays a big part at Smart Yields especially with the advent of the Internet of Things (IoT) and our play to capture big data. Whether it’s developing an alarm system to alert farmers of potentially harmful situations or creating automated watering schedules for farm hands, you’ll be charged with constantly improving the lives and efficiencies of farmers on a daily basis.<p>YOU WILL:\n+ Design, test and deploy cutting-edge software for farmers and agronomist.\n+ Assist in maintenance and upkeep of created and existing database, application and server infrastructures.<p>SKILLS\nMinimum\n+ BS degree in Computer Science, Information Sciences or equivalent practical experience.\n+ 3+ years developing full-stack web applications using tools such as Nginx, NodeJS, Express, React and React Native.\n+ Is an independent and efficient problem-solver and troubleshooter.\n+ Ability to solve real-world problems using software.<p>Preferred\n+ Masters, Ph.D in Computer Science, Information or equivalent practical experience.\n+ 6+ years developing full-stack web applications using tools such as Nginx, NodeJS, Express, React and React Native.\n+ Experience working with hardware engineers on Internet of Things (IoT) projects. \n+ Low-level experience working with scalable information and system architectures. (+1M users or devices)\n+ Experience using testing suites and Continuous Integration (CI) in development and deployment.\n+ Good judgment in UX&#x2F;UI and usability.\n+ Mastery of all client-side languages, libraries and practices (i.e. can build any interface with ease)\n+ Familiarity with agile development practices (e.g. scrums, etc.)\n+ Mastery of version control (such as Git) in the development process.<p>HOW TO APPLY\nPost your resume and a cover letter briefly describing why you’re interested in growing with Smart Yields to lizzy@smartyields.com","time":1486054806,"type":"comment"}