{"by":"mentalhealtham","id":13560709,"parent":13541679,"text":"Mental Health America | Front-end Web Developer | Alexandria, VA (Washington, DC area) | Full-time, ONSITE preferred, mainly because we&#x27;re fun to be around | $80-90K + benefits<p>MHA has a strong benefits package, including a family-friendly work environment, health insurance, flexible work schedules, telecommuting, PTO, professional development funds, and a 401K match.<p>We&#x27;re looking for a Front-end Web Developer with CMS experience (Drupal preferred) for our office in Alexandria, VA. Candidates with a portfolio and 3+ years of experience are preferred. MHA believes we must address mental illness before Stage 4. We promote mental health as a critical part of overall wellness, including prevention services for all; early identification and intervention for those at risk; integrated care, services, and supports for those who need it; with recovery as the goal.<p>The Front-end Web Developer will broadly support the organization by maintaining the design and navigation of the MHA website, implementing special web-based projects, and providing other support for web-based initiatives.<p>Job duties&#x2F;responsibilities include:<p>* Maintain the MHA website (built on Drupal)<p>* Lead periodic web design and alignment projects<p>* Implement and adapt additional Drupal modules as required<p>* Develop custom content for MHA websites and other properties<p>* Develop content, including email templates and page wrappers, for other MHA web-based programs, such as Blackbaud’s Luminate Online Marketing system<p>* Advise senior team on web and digital strategy<p>Desired Skill Set: JavaScript, jQuery, and other javascript frameworks; HTML5; CSS3&#x2F;SASS&#x2F;SCSS; PHP; cross-browser development; CMS experience; experience working with APIs to build data-driven user interfaces. Any experience with design or user experience is a bonus.<p>Full description and application instructions at <a href=\"http:&#x2F;&#x2F;careers.mentalhealthamerica.net&#x2F;jobs&#x2F;8763761\" rel=\"nofollow\">http:&#x2F;&#x2F;careers.mentalhealthamerica.net&#x2F;jobs&#x2F;8763761</a> - please reply here with any questions!","time":1486137776,"type":"comment"}