{"by":"ewa","id":13580660,"parent":13541679,"text":"Intercom | Dublin, Ireland | ENGINEERING MANAGER | SOFTWARE ENGINEER | SUPPORT ENGINEER | Full Time | ONSITE<p>WHAT: Software-as-a-Service, customer communication platform. Intercom is one of the top 5 fastest growing software companies of our generation. If you haven&#x27;t heard about us yet, we are the first Irish tech start up of it&#x27;s kind to rapidly grow and take Europe and USA by storm and we have only just began!<p>ROLE: Want to write code, define product vision &amp; manage a team? We are looking for an Engineering Manager in Dublin. You’ll work directly with a product, design, and engineering team who’ve worked in places such as Amazon, Facebook, Google, Apple and Zendesk. And best of all, be early enough to hold a leadership position where you have a high impact role in our success over the coming years. Apply here: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;1tlsfw\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;1tlsfw</a><p>BENEFITS: Competitive salary, meaningful equity, free food, health insurance, life assurance, unlimited holidays, paid parental leave, public transport and gym covered. Hiring process consists of tech test, phone interview and an onsite interview with technical and culture sessions.<p>TECH: The core Intercom product is a Ruby on Rails application with an Ember.js frontend. We use MySQL and MongoDB for most of our storage, though we’re starting to migrate to other services like Amazon’s DynamoDB. We don’t need you to be familiar with any of these technologies to work with us. Great people are effective and learn what we use quickly (or introduce us to better ways of working).<p>How we work: <a href=\"https:&#x2F;&#x2F;www.intercom.io&#x2F;careers&#x2F;engineering\" rel=\"nofollow\">https:&#x2F;&#x2F;www.intercom.io&#x2F;careers&#x2F;engineering</a><p>Also hiring for Product Engineers: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;hkso711\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;hkso711</a>, Lead Data Engineer: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;h8qa7l\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;h8qa7l</a> and Support Engineer: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;8k2xe61\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;8k2xe61</a>","time":1486396970,"type":"comment"}