{"by":"enalicho","id":13588228,"parent":13541679,"text":"Fuse Tools | Software Engineer, Senior Javascript Engineer, Community Engineer, CFO &amp; Senior Operations Executive, Cloud Software Engineers, Ops Engineer, UX Designer | Oslo, Norway or Palo Alto, America | <a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@fusetools&#x2F;we-are-growing-and-hiring-a745b32e5039#.5lky4f3wk\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@fusetools&#x2F;we-are-growing-and-hiring-a745...</a><p>Fuse is a new platform which makes app development easier, more efficient and more fun for both developers and designers. We’re committed to solving actual cross platform app design and development problems with tools that simplifies working with layout, interaction and motion.<p>In order to do this, we&#x27;ve implemented our own OpenGL engine that targets multiple platforms. We&#x27;ve also developed a superset of C# called [Uno](<a href=\"https:&#x2F;&#x2F;www.fusetools.com&#x2F;docs&#x2F;uno&#x2F;uno-lang\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fusetools.com&#x2F;docs&#x2F;uno&#x2F;uno-lang</a>), with built in support for foreign code written in Objective-C, C++, and Java in order to help target multiple platforms from a single codebase.<p>We&#x27;re currently hiring people for several roles, as we have just secured $12 millon in funding from NorthZone and Alliance Venture. We currently have around 25 developers on our team and, as we grow, we&#x27;re also looking for people who can help us manage that growth. If you have expertise in different approaches, we would love to hear them.<p>We want people who like to think about API + library design, since the tools we make here are used by developers all over the world. Almost everyone on our team has a developer background, and we follow a strong practice of eating our own dog food. If you work on Fuse, you&#x27;ll be using Fuse. Our community gets close support from us, the developers, so you must be good at communicating through Slack and at workshops. We&#x27;re looking for people who like to help other people.<p>For more information please reach out to us on Slack [here](<a href=\"https:&#x2F;&#x2F;fusecommunity.slack.com\" rel=\"nofollow\">https:&#x2F;&#x2F;fusecommunity.slack.com</a>). In order to apply, just go straight to [here](<a href=\"https:&#x2F;&#x2F;docs.google.com&#x2F;a&#x2F;outracks.com&#x2F;forms&#x2F;d&#x2F;e&#x2F;1FAIpQLSfOHiRKKkWJDyH5p125q59LY9x0HPRAjdEMVedBDsd6GPiahA&#x2F;viewform?c=0&amp;w=1);\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.google.com&#x2F;a&#x2F;outracks.com&#x2F;forms&#x2F;d&#x2F;e&#x2F;1FAIpQLSfOH...</a>","time":1486459982,"type":"comment"}