{"by":"RossSheingold","id":13582005,"parent":13541679,"text":"Cycle | Los Angeles, CA | Onsite | Full-time | Full-stack software engineer | Competitive salary, unlimited PTO, 401(k)| <a href=\"http:&#x2F;&#x2F;cycle.media\" rel=\"nofollow\">http:&#x2F;&#x2F;cycle.media</a><p>Cycle seeks a Full-stack software engineer to own the entire software development and deployment process. You should have a passion for all things social and extensive knowledge in leveraging external APIs. You will collaborate with the Chief Innovation Officer to develop and implement an efficient internal database. A successful candidate will have in-depth understanding of and experience with:<p>- Developing software features using object-oriented programming in Ruby, and the popular web framework Ruby on Rails.\n- Developing software features using templating languages ERB and Mustache.\n- Developing software features using relational databases (specifically Postgres), as well as database maintenance &amp; migrations.\n- Developing software features using various data stores, especially Redis, and usage patterns relevant to job queues.\n- Developing software features leaveraging threaded environments, especially with relation to Sidekiq and background job processors.\n- Developing software features that interact with multiple authentication protocols, especially Google OAuth &amp; Microsoft 365 OAuth.\n- Developing software features and custom scripts that leverage external APIs (especially Google’s GeoLocation API, Facebook’s Graph API, YouTube’s Data API, as well as Instagram, Twitter and any yet to be released API such as Snapchat), as well as dealing with rate limits, throttling, and efficient retry patterns.\n- Developing software features using front-end technologies, such as JavaScript, SASS, and Sprockets asset pipeline.\n- Developing software features by creating database schemas that represent and support business processes\n- Git code versioning tool\n- Heroku’s deployment, logging, and add-on resources.\n- Hosted Search APIs and how to efficiently integrate with third party data stores (specifically Algolia).<p>Experience: 2-4 years\nApply here: <a href=\"https:&#x2F;&#x2F;cycle.workable.com&#x2F;jobs&#x2F;419205\" rel=\"nofollow\">https:&#x2F;&#x2F;cycle.workable.com&#x2F;jobs&#x2F;419205</a>\nInterview process:<p>- Recruiter application&#x2F;resume screening\n- Recruiter phone screening\n- On-site interviews with key stakeholders and senior software engineers  \n- On-site or take-home technical coding challenge&#x2F;exercise","time":1486403458,"type":"comment"}