{"by":"bluespot","id":13617086,"parent":13541679,"text":"bluespot.io | Full-stack Software Developer | London | Onsite<p>We are a small London-based development consultancy, approaching our first birthday with a good year behind us and even better one in front. We build web apps, and provide expertise on the best processes for building web apps, for a range of clients, from small startups to government departments.<p>Right now, we are looking for an experienced full stack developer to join us.<p>We work in small teams, which typically consist of two developers, one “product owner” from the client side, and one agile coach &#x2F; project manager &#x2F; scrum master. We work using a simple but powerful agile methodology that encourages collaboration, delivery, reflection and improvement. Each week, we plan and deliver completed features to our clients, with our aim always to have teams working together, not in silos or staggered across iterations.<p>We would like to talk to people experienced in any technologies&#x2F;languages, but at the moment our go-to server stack is Ruby and Ruby on Rails &#x2F; Node.js where appropriate. We love React and Redux in the browser and find React Native makes us incredibly productive when creating native apps. We believe testing is imperative to creating a healthy project and commonly use RSpec and Capybara with Ruby and Jest, Jasmine or Mocha with JavaScript.<p>We like to work in a casual, friendly atmosphere. We value social collaboration both with colleagues and our clients, so working from our Soho office (by the way, Soho is awesome) with hours of 10am - 6pm is the norm, but we are flexible with those hours and with days worked at home.<p>We are a family and life friendly office, we understand school runs, doctors appointments, errands, and that hobby you love that means you need to nip off a bit early today. We trust you to cover your work with your team and your client in a responsible manner. The same goes for holidays.<p>Too many agencies use a model where increased success only serves to makes their founders richer. If you came to work here, you would be become a member of our share scheme and be included in the company&#x27;s profit sharing.<p>Salary will be negotiable based on experience, but typically in the range of £40k - £60k<p>Please see full job description here:\n<a href=\"http:&#x2F;&#x2F;bluespot-io.breezy.hr&#x2F;p&#x2F;9d5e965b267c-software-developer\" rel=\"nofollow\">http:&#x2F;&#x2F;bluespot-io.breezy.hr&#x2F;p&#x2F;9d5e965b267c-software-develop...</a><p>If you’d like to chat to us about the role, please apply through the link above or do get in touch at jobs@bluespot.io","time":1486747547,"type":"comment"}