{"by":"cdolan23","id":13649013,"parent":13541679,"text":"Amyris, Inc. | Software Engineer | Emeryville, CA | Full-time, ONSITE, <a href=\"http:&#x2F;&#x2F;amyris.com\" rel=\"nofollow\">http:&#x2F;&#x2F;amyris.com</a><p>We are searching for talented, curious, and self-motivated developers to join our software engineering team in building the most advanced production-scale synthetic biology platform on the planet. R&amp;D at Amyris is a highly multidisciplinary effort, where we need brilliant contributions from every area of the life sciences and engineering disciplines in order to take projects from concept to market.<p>From hacking directly on DNA in the lab to full scale factory production, every aspect of our work is facilitated and accelerated by software and hardware automation. Our tools integrate the activities of scientists, engineers, and industrial robots to enable the rapid optimization of genetic designs and laboratory processes.<p>Among the tools we have developed are a CAD&#x2F;CAM system for genetic engineering: a compiler toolchain whose target architecture is life itself. This stack physically integrates high level genetic modules into microbial hosts. We also derive novel strains through random mutagenesis and directed evolution. Using our custom control platform, we then subject these experimental organisms to high throughput performance screening in our state-of-the-art robot labs.<p>Do you want to work with brilliant scientists and engineers to help create a better future for ourselves, our children, and everyone on the planet? Have you ever wished you could have gotten in on the ground floor at the dawn of the integrated circuit revolution? This is your chance to do foundational work in biotechnology. We are past proof of principle; we have begun the rapid expansion of a technology that will characterize this century. We think we&#x27;re doing something far more interesting and exciting than almost anyone else out there, and we offer competitive compensation, excellent benefits, unlimited high quality conversation, free lunches, and beer!<p>We&#x27;re looking for full stack developers to help build (mostly) web based tools for facilitating all aspects of the scientific and engineering process.  Our stack is primarily Javascript (React, JQuery), Python (Pyramid), and Postgres, with a fair amount of F# and a bit of legacy PHP.  Right now we&#x27;re looking for developers with at least 5+ years of industry (software, not necessarily biotech) experience.<p><a href=\"https:&#x2F;&#x2F;amyris.csod.com&#x2F;ats&#x2F;careersite&#x2F;JobDetails.aspx?id=278\" rel=\"nofollow\">https:&#x2F;&#x2F;amyris.csod.com&#x2F;ats&#x2F;careersite&#x2F;JobDetails.aspx?id=27...</a>\n<a href=\"https:&#x2F;&#x2F;amyris.csod.com&#x2F;ats&#x2F;careersite&#x2F;JobDetails.aspx?id=278\" rel=\"nofollow\">https:&#x2F;&#x2F;amyris.csod.com&#x2F;ats&#x2F;careersite&#x2F;JobDetails.aspx?id=27...</a><p>We also have openings (or will soon) in scientific computing, automation, and are looking for a DBA.  Full list here: <a href=\"https:&#x2F;&#x2F;amyris.com&#x2F;careers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;amyris.com&#x2F;careers&#x2F;</a><p>I&#x27;m the hiring manager for these positions. Feel free to contact me with any questions (email in profile).","time":1487122540,"type":"comment"}