{"by":"eriktrautman","id":12017051,"parent":12016568,"text":"Viking Education | Growth Marketer | Onsite (SF) or Remote | <a href=\"http:&#x2F;&#x2F;www.vikingcodeschool.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.vikingcodeschool.com</a><p>Viking Code School is a 100% online development bootcamp.  Our core program is an immersive where students only pay tuition when they get a job.  We&#x27;re a mission-driven company with the goal of launching a million high-growth careers around the world while having fun doing so.<p>We have a best-in-class student experience that we&#x27;re beginning to offer to the market through different modalities and products which opens up significant new markets and growth potential.  There is a lot of room to improve the breadth, depth, and analytics around our acquisition channels… which is where you come in.<p>We&#x27;re seeking a highly versatile hustler with strong previous startup experience who will lead our core marketing channels and top-of-funnel efforts.  This will require you to have very strong skills along both content-driven and paid acquisition axes as well as a creative eye for hacking new channels.  You will also interface directly with our product&#x2F;engineering team to help put together A&#x2F;B tests and other product experiments, so the role is decidedly cross-discipline and strong product&#x2F;technical comfort is a must.<p>This is not a micromanaged role for individuals looking to &quot;get into&quot; startups but rather a high ownership position where you will be accountable for delivering results.  Only individuals with a proven track record of success will be considered.<p>Requirements:<p>* 3+ years in a growth or marketing role at a startup with demonstrable track record of results<p>* Strong track record working with paid campaigns, producing content, tracking analytics and sourcing creative for campaigns.<p>* Comfort developing and executing a growth strategy.<p>Email careers@vikingcodeschool.com with your CV, links and anything else that would prove your general awesomeness.","time":1467387872,"type":"comment"}