{"by":"papercruncher","id":12018962,"kids":[12020171],"parent":12016568,"text":"San Francisco | Senior Engineers | Tubi TV | Full-Time | ONSITE | VISA (transfer H1&#x2F;O1)<p>We are making premium TV shows and movies available for streaming everywhere and to everyone, 100% free.\nJoin Tubi TV and reinvent the way consumers discover and consume premium content. With over 40,000 movies &amp; TV shows, Tubi TV has the world&#x27;s largest catalog of premium content, all made available to consumers for free. Some of our studio partners include MGM, Lionsgate and Paramount. We offer very competitive pay, full medical, dental &amp; vision benefits, catered lunch, gym subsidies and your choice of hardware. At the moment, for all positions we are looking for engineers with a few years of software development experience in the industry.<p>We are hiring for:<p>- Devices frontend engineer: Hack on the web, xbox, roku, TVs and anything that can stream video. If you have a good eye for design, love working on the latest web technologies or squeezing the last bit of performance out of a hardware constraint Smart TV, then this position is for you. <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk06f7q&#x2F;?referer=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk06f7q&#x2F;?referer=hn</a><p>- Senior Data Engineer: Come and build out the next iteration of our data platform. Full autonomy and end to end ownership. Work on your choice of algorithms using Spark&#x2F;Flink or any other stacks you deem suitable. See: <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk06xpn&#x2F;?referer=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk06xpn&#x2F;?referer=hn</a><p>- Senior Backend Engineer: Work on NodeJS v6, design APIs, architect video encoding pipelines and work on networking infrastructure. See <a href=\"https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk067d5&#x2F;?referer=hn\" rel=\"nofollow\">https:&#x2F;&#x2F;tubitv.recruiterbox.com&#x2F;jobs&#x2F;fk067d5&#x2F;?referer=hn</a><p>If you&#x27;d like to chat more first, shoot me an email and mention HN (marios at tubitv dot com)","time":1467400791,"type":"comment"}