{"by":"djd20","id":12018723,"parent":12016568,"text":"<a href=\"http:&#x2F;&#x2F;tauri-tec.com\" rel=\"nofollow\">http:&#x2F;&#x2F;tauri-tec.com</a> | Full Stack Python Hacker | Canterbury, London, Dubai, Bangalore | REMOTE in reasonable timezone | Full-Time<p>Looking to join a small 4 person, casual, team of PhD&#x27;s&#x2F;Unix hackers who pride themselves on quality?  Looking for a well run, well established, 10 year old company to work with? Do you love python, postgres, pyramid and sqlalchemy?<p>Drop us a line - we&#x27;re working on a large, well funded, project where we process (for search &amp; convenient reading) thousands of documents a day for the finance industry and need a solid pair of hands with a sense of humor and a life outside of work.  This involves a pile of aws infrastructure, and a fair amount of tricky reporting and data-collection work, as well as things like &#x27;similar to this document&#x27; and surrounding compliance.  Lots of good concurrency issues and careful balancing of resources &amp; profiling profiling profiling... and testing!<p>As pretty much everything we do is based on open source libraries we try to contribute back where we can, have contributed small patches to sqlalchemy &amp; deform.<p>We will happily consider a range of experiences, but would prefer someone who is familiar with our tool-chain, any experience with elastic search &amp; recommendation mechanisms a plus.  Some frontend js&#x2F;css knowlege, and sysadmin (ansible, linux) knowledge welcome too although we are happy to share internally.<p>Our main dev office is in Canterbury, Kent, but we have a presence in Dubai (Astrolabs in JLT) and Bangalore, as well as space available in a London office near Baker st.  Depending on location we may need you to have appropriate visas in place already.<p>Drop us an email to contact at our domain name with a CV, and any work you may have open sourced online.<p>Our interview process will usually involve a skype chat, followed by a group chat with the whole team.  Depending on background we may ask you to complete a task or two.","time":1467399129,"type":"comment"}