{"by":"AlexDenisov","id":12019431,"parent":12016568,"text":"Uberchord (<a href=\"https:&#x2F;&#x2F;www.uberchord.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uberchord.com</a>) | Full-time, onsite in Berlin, Germany, offers Visa Support | Backend Web Engineer | join@uberchord.com<p>Uberchord is a new guitar learning platform for iOS with patent-pending realtime audio recognition. Featured as one of the best apps 2016, our users write us love letters – seriously. As part of our team you will make a difference in music learning.<p>HELP US TO CHANGE MUSIC EDUCATION<p>We are a small team of top engineers, musicians and experienced entrepreneurs who set out to change the way we learn musical instruments. We developed a unique audio recognition technology that allows us to understand the player in real-time to give constant feedback on an unprecedented level. Our goal is nothing short of audacity – make musicians, not just players.<p>Our users give us glowing reviews, Apple seems to like us too, and with a top-tier investor we are ready for the next level.<p>WANT TO BE PART OF IT?<p>We are currently looking for a senior full-stack web engineer (ideally with good knowledge of Parse and Google Cloud) to work on our upcoming music platform.\nYou consider yourself a top software engineer. You have a degree in computer science and have a few years of serious coding in large and complex projects under your belt. Most of all, however, you love to create beautiful apps, care about music and code alike and want to be part of a small, hard working team. We offer you plenty of room to apply your creativity, learn new stuff and grow. And yes, we pay well and offer shares.<p>We are located at the heart of Europe’s music tech scene, at Factory Berlin, Soundcloud’s headquarter.<p>These are full-time positions in Berlin. We don’t care where you come from, we’ll help you to relocate.<p>Reach out to us: join@uberchord.com<p><a href=\"https:&#x2F;&#x2F;www.uberchord.com&#x2F;jobs&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.uberchord.com&#x2F;jobs&#x2F;</a>","time":1467405275,"type":"comment"}