{"by":"diafygi","id":12019308,"parent":12016568,"text":"Python Software Engineer | <a href=\"https:&#x2F;&#x2F;UtilityAPI.com\" rel=\"nofollow\">https:&#x2F;&#x2F;UtilityAPI.com</a> | Oakland, CA | ONSITE | Solar Job<p>==Company Description==<p>Twilio for energy data! We are a SaaS that is used by solar and energy efficiency companies to collect their customer&#x27;s utility bill and usage data automatically. We have funding from the Department of Energy and private capital, and we are generating significant revenue, so we have lots of runway (i.e. good job security).<p>Our office is in downtown Oakland (our desks are solar panels!). We work hard and we make real money while conveniently also saving the planet. We value learning and solving real problems for the world. We have a great team and a supportive, learning environment.<p>==Job Description==<p>You will be writing application code and helping maintain&#x2F;optimize&#x2F;scale the stack. We write scripts that collect data from utilities, and these scripts can break unexpectedly when utilities change their interfaces or we see new types of files or formats, so being able to update them quickly is important. Our codebase is well organized, documented, and tested.<p>==Requirements==<p>* U.S. Citizen or Permanent Resident (required)<p>* At least 1 year of Python work experience (required)<p>* In depth knowledge of Python Language: in particular; iterators, generators, list comprehensions, abstract classes, &amp; multiple inheritance<p>* HTTP (methods, cookies, headers, etc.)<p>* Regular Expressions (we use them heavily)<p>* CSS Selectors (we use them heavily)<p>* JavaScript (basic understanding)<p>* Git, SSH, GPG (basic understanding)<p>==Preferred==<p>* Good understanding of best practices for web development using Django<p>* Experience with web scraping tools such as Selenium, Scrapy, or Mechanize.<p>==How To Apply==<p>Email me, Daniel Roesler, a cover letter and a PGP-encrypted pdf resume encrypted with my public key. Please include links to your github, bitbucket, or personal side project website (for reference, mine is daylightpirates.org).","time":1467403888,"type":"comment"}