{"by":"billhendricksjr","id":12019285,"parent":12016568,"text":"ProducePay | Los Angeles, CA | ONSITE | full-time<p><a href=\"https:&#x2F;&#x2F;producepay.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;producepay.com&#x2F;</a> is a two-sided marketplace connecting farmers with produce distributors and provides immediate cash flow to both parties.<p>We&#x27;re looking to hire a Senior UI&#x2F;UX Designer to join the team in Downtown Los Angeles. Req below.<p>We&#x27;re a well capitalized, seed stage startup backed by some of the smartest investors in SoCal. See <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;06&#x2F;29&#x2F;producepay-seed-funding&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2016&#x2F;06&#x2F;29&#x2F;producepay-seed-funding&#x2F;</a><p>If interested, email your resume and portfolio to me, bill at producepay dot com.<p>Responsibilities:<p>•\tApply strategic thinking to design and deliver innovative end-to-end user experiences that optimize among user needs, business goals, and technological realities across web &amp; mobile platforms<p>•\tDesign both interaction components and system-wide capabilities<p>•\tTake ideas and concepts, and visualize them in such that they are communicated effectively and compellingly for internal leaders, partners and customers<p>•\tTurn visions into concepts and translate those concepts into designs that illustrate simplicity, despite complexity of the system<p>•\tDirectly responsible for delivering User Experience visions, UI specifications, wireframes and prototypes<p>•\tCollaborate effectively with product management, development, marketing, and other team members<p>•\tUse facilitative leadership skills to drive to the best outcome for stakeholders, resulting in others learning from you, and inspiring others to want to work with you<p>Qualifications<p>•\tFour-year degree in Human Computer Interaction, graphic design, or other relevant field. Graduate degree a plus<p>•\t5+ years of interface design experience in delivering high-volume, high-profile or award-winning web sites or products; preferably experience with SaaS and mobile products<p>•\tStrong knowledge and experience with driving and applying user-centered design processes while working collaboratively with customers, along with cross-functional teams including engineering, product management, and user research. Seasoned in Agile development processes<p>•\tProficient in a variety of methods to convey ideas and concepts (e.g. storyboards, wireframes, prototypes, etc)<p>•\tProven track record in setting a vision for great customer experiences, inspiring others to get behind the vision, and ultimately delivering products and services that are known for their delightful experience and ease of use<p>•\tEffective communicator, presenter, and negotiator<p>•\tOrganized, self-directed, efficient and able to manage multiple and complex projects in a timely manner<p>•\tExpertise with design tools such as Photoshop, Illustrator, Dreamweaver, but skilled in creating &#x27;lo-fi&#x27; prototypes to share with users in a fast, iterative manner<p>•\tFamiliarity with web and mobile technologies and their impact on the feasibility of design solutions; hands-on expertise with HTML, CSS, Javascript is a plus<p>•\tA passion for creating products that resonate on an emotional level<p>•\tStrong online portfolio available for viewing","time":1467403741,"type":"comment"}