{"by":"perlin","id":12017581,"parent":12016568,"text":"Oden Technologies | <a href=\"http:&#x2F;&#x2F;oden.io&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;oden.io&#x2F;</a> | Full Time | Onsite | New York, NY<p>We are an industrial IoT company that allows manufacturers to optimize processes and produce more output with less input by improving efficiency and reducing waste products. Our goal is to create smart factories using cutting edge technologies. We are currently funded w&#x2F; a small # of employees. Now is a great time to get in ;)<p>Stack: Python, React, ConcourseCI, Cassandra, KairosDB, MongoDB, Go (nothing is set in stone, we value engineers that take a scientific approach to evaluating all possible solutions — help us decide!)<p>* Hardware &amp; Network Engineer: \n<a href=\"https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk06pfp&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk06pfp&#x2F;</a>\nWe need engineers, preferably w&#x2F; experience in IoT, to help us build out our hardware and network strategy. This includes writing software for embedded devices, experimenting with different network connectivity solutions, and optimizing device firmware for reliability and security.<p>* Frontend Engineer: <a href=\"https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk06s2b&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk06s2b&#x2F;</a>\nOur end-user product is a dashboard that allows factory workers to grok massive amounts of timeseries data. Experience in analytics or visualization solutions is preferred.<p>* Data Engineer: <a href=\"https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk06s2k&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk06s2k&#x2F;</a>\nWe currently ingest 8.5M datapoints per day and expect that number to increase 100x by the end of the year. We are looking for a skilled big data engineer to help us ingest and process this data.<p>* Backend &#x2F; Realtime Stream Processing Engineer: <a href=\"https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk0hdsz&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;odentech.recruiterbox.com&#x2F;jobs&#x2F;fk0hdsz&#x2F;</a>\nImagine two machines reporting datapoints at different intervals, that are components of a complex aggregated metric. We need to be able to perform aggregations on datapoints as they arrive, in as close to realtime as possible. Experience in realtime stream processing libraries and out-of-order event processing is a plus.<p>Feel free to apply on Recruiter Box (make sure to mention HN), or reach out directly: mykola@oden.io","time":1467390957,"type":"comment"}