{"by":"alexandros","id":12017701,"parent":12016568,"text":"Resin.io | REMOTE | Linux engineers, Security engineers, Backend engineers, UI&#x2F;Front-end engineers, Sales engineers (for the last one only, bay area preferable)<p>Resin.io allows IoT developers to push Linux Containers to embedded devices. See our latest demo at DockerCon [1].<p>We&#x27;re very emphatic about our remote culture [2].<p>The resin.io team is composed of people passionate about quality code, well-thought out architecture, and great user experience. Etcher.io, a tool we recently released, is a good example of all those things.<p>Most of our code is node.js though we&#x27;re transitioning some parts of the stack to Go.<p>Some details on the individual roles:<p>Linux engineers - We&#x27;re building a minimal OS for embedded devices[3]. Knowledge of Yocto Linux very helpful.<p>Security engineers - Passionate about building an end-to-end secure code delivery pipeline, from the cloud to the device, all the way down to the bootloader and CPU?<p>Backend engineers - Resin&#x27;s backend is composed of ~10 microservices with unique challenges. Most of the code is in node.js and CoffeeScript, JS knowledge required.<p>UI&#x2F;Front-end engineers - We&#x27;re passionate about UX, and have a lot of cool features to build. Most of our UI is in AngularJS but knowledge of other frameworks a plus.<p>Sales engineers - (ideally in the bay area) - End-to-end understanding of resin.io, ability to work with customers to both teach and guide them to use resin.io effectively. You may need to spend time on-site with customers.<p>Workflow engineers - Looking for full-stack developers passionate about optimising the way a remote team works.<p>Our interview process is a first call to go through programming competence, as well as a follow up with the corresponding team lead.<p>If any of the above sound exciting, drop us an email at join@resin.io<p>[1]: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?time_continue=1573&amp;v=75vm6rRb6K0\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?time_continue=1573&amp;v=75vm6rRb6...</a>\n[2]: <a href=\"https:&#x2F;&#x2F;resin.io&#x2F;blog&#x2F;how-we-run-a-remote-team&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;resin.io&#x2F;blog&#x2F;how-we-run-a-remote-team&#x2F;</a>\n[3]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;resin-os&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;resin-os&#x2F;</a>","time":1467391746,"type":"comment"}