{"by":"Curalatis","id":12017122,"parent":12016568,"text":"Curalate | SEATTLE | NYC | PHILLY - <a href=\"http:&#x2F;&#x2F;www.curalate.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.curalate.com</a> (roles can sit in any of our offices)\nCuralate is the leading visual commerce platform, connecting pictures, people and products. Our visual commerce software helps more than 800 brands tell their stories through imagery in order to drive engagement, build awareness, and form stronger, more meaningful relationships with consumers.<p>* TechCrunch: Curalate Raises $27.5M to Help Brands Connect Content to Commerce \n* One of the nation’s 25 Hottest “under-the-radar startups” by Business Insider \n* Inc. Magazine: The 10 Hottest Startups to Work for in NYC (Curalate is #1!)<p>ALL ROLES CAN BE FOUND HERE: <a href=\"http:&#x2F;&#x2F;grnh.se&#x2F;4d5kan\" rel=\"nofollow\">http:&#x2F;&#x2F;grnh.se&#x2F;4d5kan</a> \n- Full Stack Engineer - Front-End Engineer - DevOps Engineer - Product Manager - Product&#x2F;UX Designer<p>We hire developers, designers and product people with exceptional problem solving skills, creative out-of-the-box thinking, and comfort with quickly learning, evaluating, and deploying new technologies. Also, We&#x27;re not language zealots; we believe in using the right tool for the job, and are comfortable with a polyglot codebase.<p>Value Props:<p>* Hard problems to solve--everything we build revolves around images (data, monetization, commerce, image recognition etc etc)--and the challenges are endless.<p>* Leadership: Our Co-founder is our CTO and an Engineer (dev is our biggest team by far) and our VP of Engineering has managed to retain his entire team for over a year (aside from one of our dev&#x27;s that decided the Seattle weather wasn&#x27;t for him and headed back to sunny LA)<p>* New tech: Our primary language is Scala, but we are always open to trying new languages, frameworks etc-- this is a &quot;best tool for the job&quot; shop, so we are open to experimenting and failing fast<p>* Ownership: you will ship code from day one and see your impact right from the jump. We are all about autonomy, so we hire the best--it&#x27;s literally easier to get into Harvard, than to get a spot on this team--dev&#x27;s and give them the support to kill it<p>* Fun: This company is incredible and our people are brilliant, but we don&#x27;t take ourselves too seriously. . .laughing is part of our DNA<p>* Being at the bleeding edge of tech on a winning team. . . Need I say more?","time":1467388213,"type":"comment"}