{"by":"BGCivis","id":12018557,"parent":12016568,"text":"Civis Analytics (<a href=\"https:&#x2F;&#x2F;civisanalytics.com\" rel=\"nofollow\">https:&#x2F;&#x2F;civisanalytics.com</a>) - Chicago, IL - Full-time - Onsite<p>Civis is a 3 year old, quickly growing, Chicago-based technology company that helps organizations utilize data science to make better decisions.  We build software products that empower organizations to understand their data at the individual level and put it to work.<p>Our roots are in politics and campaigns, but we now also work with non-profits, healthcare and education groups, the public sector, and across the media landscape.<p>We&#x27;ve had some recent press in Wired (<a href=\"http:&#x2F;&#x2F;bit.ly&#x2F;1tdw4Uu\" rel=\"nofollow\">http:&#x2F;&#x2F;bit.ly&#x2F;1tdw4Uu</a>) and the WSJ (<a href=\"http:&#x2F;&#x2F;on.wsj.com&#x2F;2913XOx\" rel=\"nofollow\">http:&#x2F;&#x2F;on.wsj.com&#x2F;2913XOx</a>).<p>We are hiring for software engineers and data scientists of all levels and multiple disciplines, including a lead data engineer, full-stack web-developers, natural language processing experts, and more.<p>What&#x27;s so great about working at Civis Analytics?<p>Your work will make the world a better place. Don’t just experience the thrill of solving interesting problems-- have the satisfaction of knowing that your work makes a difference in the world.<p>You will learn. Our engineers and data scientists are the best and brightest in their fields, and are eager to teach and learn from you.<p>Your work will be diverse. Every day we&#x27;re learning and working on new, cutting edge problems at the intersection of technology, data science, and practical application.<p>Your voice can change the direction of a project. We strongly encourage our staff to participate in the brainstorming and prioritization process. We don&#x27;t want people that mindlessly program. We want your perspective and experience.<p>See our open positions and apply at: <a href=\"https:&#x2F;&#x2F;civisanalytics.com&#x2F;careers\" rel=\"nofollow\">https:&#x2F;&#x2F;civisanalytics.com&#x2F;careers</a><p>We&#x27;re smart, fun, and a little bit weird. Does this sound like you?","time":1467397845,"type":"comment"}