{"by":"Infosourcer","id":12018578,"parent":12016568,"text":"Cloudera | Engineering Manager&#x2F;Tech Lead, Kafka &amp; Zookeeper | Palo Alto or San Francisco, CA | Full-time | Onsite<p>Leading the Apache Hadoop movement from the start! <p>Cloudera is headquartered in Palo Alto, California with 25 offices in 20 countries.\nWe are a cutting-edge software company of 1,200+ employees globally that provides Apache Hadoop-based software, support and services, and training to business customers.<p>Cloudera is looking for a few Engineering Managers with distributed computing experience to help define and build a highly-scalable next generation storage engine team.<p>We are looking for a few folks who have:<p>-Prior experience managing a team of 3-7 engineers.<p>-Strong Java and Scala skills required.<p>-Strong written and verbal communication skills and collaborative mindset.<p>-Comfortable interacting online with a worldwide open-source community.<p>-Strong grasp of algorithms and data structure fundamentals: O(log n) vs. O(n)  matters a lot when N is 100 petabytes<p>-Experience with distributed systems a strong plus<p>So, why Cloudera?<p>Amazing people - We are a fun and smart team, including many of the top luminaries in Hadoop and related open source communities. We frequently interact with the research community, collaborate with engineers at other top companies and host cutting edge researchers for tech talks.<p>Innovative work - Cloudera pushes the frontier of big data and distributed computing, as our track record shows. We test and deploy our code on huge clusters with thousands of nodes, terabytes of RAM, and petabytes of storage.<p>Great culture - Transparent and open meritocracy. Everybody is always thinking of better ways to do things, and coming up with ideas that make a difference. We build our culture to be the best workplace in our careers.<p>Oh the perks - Free lunches, happy hours, gym sponsorship, video game rooms, ping pong, foosball, offices in Palo Alto and San Francisco and we get shit done!<p>To apply, please go here <a href=\"http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3OBL6iw3\" rel=\"nofollow\">http:&#x2F;&#x2F;app.jobvite.com&#x2F;m?3OBL6iw3</a> and also sign up for our Talent Community to hear about future opportunities <a href=\"https:&#x2F;&#x2F;jobs.jobvite.com&#x2F;cloudera&#x2F;jobAlerts\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.jobvite.com&#x2F;cloudera&#x2F;jobAlerts</a>","time":1467398011,"type":"comment"}