{"by":"wskemper","id":12017258,"parent":12016568,"text":"ViaSat, Inc. | USA (anywhere) | Full Time | <a href=\"https:&#x2F;&#x2F;www.viasat.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.viasat.com</a><p>ViaSat&#x27;s Cloud Engineering squad provides network and security services to every program at the company, from development through production, with a focus on utilizing public and private cloud platforms. We engage hands-on with other engineering teams to help them get to the cloud. We also build the network services platform these groups use to meet their operational, security, and regulatory requirements.<p>On any given day, you may be walking colleagues through the finer points of VPC design, helping a product team debug a critical failure in production, or presenting a workshop on developing against our internal APIs. You might be adding DNSSEC to our DNS service, writing automation to validate TLS configurations across the entire network, or expanding our platform into São Paulo. Our work and our products are always evolving, which leaves little chance you&#x27;ll ever get bored.<p>We are looking for engineers who are proficient with multiple languages, and are familiar with existing IaaS and PaaS products like AWS, OpenStack, or Marathon. We also need our team members to be good communicators and people-friendly, as our daily work involves interfacing with many people all around the company. An engineering degree or equivalent experience is necessary.<p>You&#x27;d get bonus points for having a strong security background, knowing advanced networking concepts like BGP and VLANs, and having previous work experience building globally-distributed applications.<p>Interview process: an HR phone screen, a technical phone&#x2F;Skype interview, and a half-day on-site interview.<p>Our team is location-agnostic; you can work from any ViaSat office (<a href=\"https:&#x2F;&#x2F;www.viasat.com&#x2F;contact&#x2F;locations\" rel=\"nofollow\">https:&#x2F;&#x2F;www.viasat.com&#x2F;contact&#x2F;locations</a>), or from home, as long as you reside within the United States.<p>Interested?  Email me at stephan.kemper@viasat.com","time":1467389046,"type":"comment"}