{"by":"jason_dstillery","id":12018928,"kids":[12057680,12057681],"parent":12016568,"text":"Dstillery - NYC, New York<p>Dstillery is hiring Engineers, Analysts, and Senior Product Managers!<p>Dstillery is a machine-learning product company that has built a strong foundation in the adtech industry and is exploring opportunities to branch out into other applications. Join us, and you&#x27;ll gain deep experience developing systems at scale and working with a world-class data science team (winners of multiple KDD Best Paper and other awards). We&#x27;re still pretty small on the engineering team, and everyone gets their hands dirty and makes a real impact.<p>We&#x27;re mostly a Java shop. Hadoop, Spark, Storm, Cassandra, and Kafka are big parts of our stack, and we&#x27;re always looking for new tech that helps us work at scale. Experience with these is a big plus, but if you&#x27;ve never used them before that&#x27;s fine too. If you write clean, tested, working code, think through problems, and know how to ship, we want to talk to you.<p>We&#x27;re a Crain&#x27;s Best Place to Work in NYC for the 3rd year in a row. We play Ultimate or Soccer on Fridays, have a company band, game nights, and dev seminars where we talk tech and learn from each other. We keep sane hours and don&#x27;t track vacation.<p>We&#x27;re interested in how you really think through problems and write code, so for developers, our hiring process revolves around a small, self-paced take-home project that reflects some of the real work we do.<p>Please check out our job postings to apply:<p>Software Engineer: <a href=\"http:&#x2F;&#x2F;dstillery.com&#x2F;careers&#x2F;listings&#x2F;details&#x2F;?gh_jid=11316\" rel=\"nofollow\">http:&#x2F;&#x2F;dstillery.com&#x2F;careers&#x2F;listings&#x2F;details&#x2F;?gh_jid=11316</a><p>Analyst: <a href=\"http:&#x2F;&#x2F;dstillery.com&#x2F;careers&#x2F;listings&#x2F;details&#x2F;?gh_jid=111556\" rel=\"nofollow\">http:&#x2F;&#x2F;dstillery.com&#x2F;careers&#x2F;listings&#x2F;details&#x2F;?gh_jid=111556</a><p>Senior Product Manager: <a href=\"http:&#x2F;&#x2F;dstillery.com&#x2F;careers&#x2F;listings&#x2F;details&#x2F;?gh_jid=20813\" rel=\"nofollow\">http:&#x2F;&#x2F;dstillery.com&#x2F;careers&#x2F;listings&#x2F;details&#x2F;?gh_jid=20813</a><p>All roles are ONSITE in NYC.","time":1467400517,"type":"comment"}