{"by":"jonahbailey","id":12018040,"parent":12016568,"text":"Campspot | Senior Software Developer | Remote or On-site | Full-time | Grand Rapids, MI<p>Campspot created and maintains a reservation, management, and payment system for clients managing campgrounds and boutique resorts. Our management system stands out for its ease-of-use and powerful optimization engine, which ensure clients get the maximum return on each spot in their property. The Campspot software product is currently built on Angular, Node.js, and Loopback.<p>We’re looking for a full-stack developer. Our ideal candidate understands the inner-workings of all ends of web applications and enthusiastically enhances our users’ camping reservation experience with clean, logical, high-quality code and test-driven development practices.<p>Our developers work on self-managed teams of two to five designers, testers, and other developers. Teams collaboratively implement features through ideation, launch, and beyond. They also tackle bugs on a daily basis and offer prompt and friendly responses to support inquiries.<p>As a Campspot developer, you’ll spend most of your time writing tests and code, but you&#x27;ll also participate in the entire lifecycle of new features. This includes research, design, and planning; project management; technical documentation; meeting with stakeholders; user testing; and more.<p>If this sounds like you, we welcome you to join a team where you can apply your talents to shape a product millions will use.<p>This job is permanent. We are not interested in contractors or moonlighters.<p>More info about Campspot: \n<a href=\"http:&#x2F;&#x2F;campspot.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;campspot.com&#x2F;</a><p>Job Listing: \n<a href=\"http:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;117047&#x2F;senior-software-developer-campspot?offset=0\" rel=\"nofollow\">http:&#x2F;&#x2F;stackoverflow.com&#x2F;jobs&#x2F;117047&#x2F;senior-software-develop...</a>","time":1467394229,"type":"comment"}