{"by":"i2oc","id":12028433,"parent":12016568,"text":"Pushpay (<a href=\"https:&#x2F;&#x2F;pushpay.com\" rel=\"nofollow\">https:&#x2F;&#x2F;pushpay.com</a>) | Auckland, New Zealand | Fulltime<p>Pushpay improves sales and business processes by making payments simple. For communities we offer a purpose-built giving experience that removes all of the friction between community members and their cause. For commercial enterprises we took our learning from the community space to deliver a bill payments experience that helps you build customer relationships, not deter them.<p>Product Manager (<a href=\"https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;product-manager\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;product-manager</a>)<p>Help us ship the right product at the right time. Working with researchers, analysts, and engineers, you will build a program of work that delivers targeted outcomes that meet product and company objectives. With a team that ships every day you will be able to confidently make an impact using experiments, data, and staged rollouts. The results are seen by our communities which create positive change for people around the world.<p>Product Analyst (<a href=\"https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;product-analyst\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;product-analyst</a>)<p>Take ideas to real working product. You will validate ideas with research, map out the problem space, then work with a cross-functional team of designers, engineers, and customer success coaches that will make it a reality in weeks not years. With clear business measures, backed by data, you will see your hard work make a difference in the everyday lives of people.<p>UX Designer (<a href=\"https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;ux-designer-auckland-nz\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;ux-designer-auckland-nz</a>)<p>We believe in high fidelity, usable, empathetic and intuitive products and as such are looking to grow the design team to achieve our vision. As a designer, you will have experience (5+ years) designing digital products and systems, not just websites. You have helped ship products before. You will have a strong understanding of screen sizes, user interface design and what makes a digital product effective.<p>Software Engineer (<a href=\"https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;senior-software-engineer-auckland-nz\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;senior-software-engineer-auckland-n...</a>)<p>Lead the engineering in the Pushpay platform. We are growing our engineering team and are looking for seasoned development leaders who can unpack the potential of their teams. We work in a continuous delivery environment making an impact every single day. Through rapid feedback loops, learning, and modern, reliable technology we are the heart of generosity for our communities.<p>Quality Assurance Engineer (<a href=\"https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;software-test-analyst-auckland-nz\" rel=\"nofollow\">https:&#x2F;&#x2F;jobs.pushpay.com&#x2F;software-test-analyst-auckland-nz</a>)<p>Help us restore a healthy developer:tester ratio. You balance automation and exploration. Your understanding of web and mobile platforms allows you to hone in on the dark corners. A passion for good experience allows you to see through user eyes to find what is functional, but not to form.<p><i>-</i>-<i>-</i><p>eChurch (<a href=\"https:&#x2F;&#x2F;echurchgiving.com\" rel=\"nofollow\">https:&#x2F;&#x2F;echurchgiving.com</a>) | Redmond, Washington | Fulltime<p>eChurch removes the barriers to giving and unlocks generosity from a new generation of digital givers. Trusted by nearly 4,000 churches worldwide including several of the top 10 churches in the US, we are driving more than $1B NZD in payments annually.<p>Product Marketing Manager (<a href=\"https:&#x2F;&#x2F;workforcenow.adp.com&#x2F;jobs&#x2F;apply&#x2F;posting.html?client=PushPayPR&amp;jobId=14367\" rel=\"nofollow\">https:&#x2F;&#x2F;workforcenow.adp.com&#x2F;jobs&#x2F;apply&#x2F;posting.html?client=...</a>)<p>Lead the go-to-market strategy of our generosity solution, services and ancillary products into faith communities. This includes customer and market research, segmentation, product positioning, messaging, pricing, packaging, product launch and sales enablement content. You will be a key leader in driving long-term product strategies, increasing customer success and achieving company growth goals. You will be a key evangelist and spokesperson for our entire product line.","time":1467594782,"type":"comment"}