{"by":"vikp","id":12020629,"kids":[12030055],"parent":12016568,"text":"Dataquest | San Francisco, CA | Data Scientist| Full-time | Onsite or Remote<p>At Dataquest (<a href=\"https:&#x2F;&#x2F;www.dataquest.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io</a>), we&#x27;re building the future of online education. Most online learning has turned into &quot;let me throw up a bunch of videos and call it a course&quot;. We help people actually learn and demonstrate their skills . Our paths take people from zero coding knowledge all the way through to getting jobs at companies like 3M and Fitbit. Our cohesive curriculum, interactive learning by doing approach, project focus, and strong learning community are critical to this process.<p>We&#x27;re all self-taught, and we&#x27;re passionate about helping people learn more effectively.  We&#x27;re constantly trying new learning techniques and refining our approach. We&#x27;re profitable and control our own destiny, so we have a lot of latitude to do what&#x27;s best for our students, not what&#x27;s best for VCs.<p>We&#x27;re been teaching data analysis and data science to tens of thousands of students a month, and we want to deepen our curriculum.  This involves teaching more complex math and machine learning techniques, how to more effectively communicate results with interactive dashboards, and much more.  Our philosophy is to teach not just syntax, but the deeper understanding and theory behind techniques.  Our lessons are usually walkthroughs of interesting datasets, where we introduce concepts along the way.  Looking at some of our blog posts (<a href=\"https:&#x2F;&#x2F;www.dataquest.io&#x2F;blog&#x2F;data-science-portfolio-project&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io&#x2F;blog&#x2F;data-science-portfolio-project...</a>, <a href=\"https:&#x2F;&#x2F;www.dataquest.io&#x2F;blog&#x2F;kaggle-tutorial&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io&#x2F;blog&#x2F;kaggle-tutorial&#x2F;</a>), and our lessons (<a href=\"https:&#x2F;&#x2F;www.dataquest.io&#x2F;track&#x2F;data-scientist-track\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dataquest.io&#x2F;track&#x2F;data-scientist-track</a>) might help explain our approach.<p>This position will have a lot of autonomy in expanding and building our data science curriculum. If you&#x27;re passionate about finding insights in data and teaching others to do the same, we&#x27;d love to chat.<p>Email me at vik at dataquest.io if this sounds interesting!","time":1467417922,"type":"comment"}