{"by":"benscallan","id":12031426,"parent":12016568,"text":"Venture Founder (CTO &amp; COO)\nLondon, United Kingdom · Accelerator\nDESCRIPTION<p>Grow a start-up business with the backing and support of Jaguar Land Rover<p>The InMotion Accelerator is a 6-month programme that allows you to develop a new business in mobility and smart transportation. InMotion offers entrepreneurial freedom and ownership with the reassurance and the security of a corporate backed venture. Here’s how it works. We provide you with a validated business idea, early stage funding and a monthly living allowance. You join a co-founder team of three to build the idea and accelerate the business, leveraging InMotion’s resources and capabilities to gain an unfair advantage, while retaining majority ownership in the business. Sound interesting? Then read on….\nREQUIREMENTS<p>Prove your potential and entrepreneurial capability to build your own business\nAs CTO you will have a few years of development experience under your belt either in a start-up or working as a contractor. You’re most likely a full stack dev, but could also be a front end dev with good visual design skills, who’s comfortable with combining technology with a solid product and business understanding.\nInMotion will support you with training and network with dedicated Venture Partners who provide guidance at every stage, connecting into a broad range of advisors, including inside JLR. We have a Growth team to leverage the unfair advantage of JLR and an in-house Technical team to support your tech. This dedicated network and the supporting cast of InMotion is part of our commitment to help you build your business.\nBENEFITS<p>Develop a high potential start-up business ready to scale and grow<p>At the end of the accelerator you will have developed your early-stage business, built a beta product with a clear value proposition that demonstrates product-market fit. At this point you will have started to generate your first revenues from your early customers. At the demo day will showcase your business to potential investors and global media. We’re committed to helping fund the business and provide support to guide you through the process of closing your seed round<p>If you think you have what it takes then we want to hear from you. We’ll expect you to demonstrate an entrepreneurial edge and your strengths to become a Venture Founder. We’ll start with an initial telephone screen before inviting you in to pitch to us, to prove you’ve got what it takes. For aspiring CTOs we’ll ask you to complete a technical challenge. After the final stage will give you’ll have an opportunity to engage deeper with the program and the InMotion team. So, if you’re excited by the opportunity then apply online through inmotion.im&#x2F; or with bscallan@jaguarlandrover.com, business lead to find out more.<p>Reference Ycombinator","time":1467647683,"type":"comment"}